{
    "id": "534210",
    "url": "https://archiveofourown.org/works/534210?view_full_work=true",
    "author": [
        "kellifer_fic"
    ],
    "title": "ticket for littering",
    "rating": "Mature",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Teen Wolf (TV)"
    ],
    "relationships": [
        "Derek Hale/Stiles Stilinski"
    ],
    "characters": [
        "Derek Hale",
        "Stiles Stilinski",
        "Scott McCall",
        "Isaac Lahey",
        "Erica Reyes",
        "Lydia Martin"
    ],
    "additional_tags": [
        "Werewolves",
        "werewolf violence",
        "accidental feels",
        "Cuddling & Snuggling",
        "accidental werebaby acquisition"
    ],
    "language": "English",
    "series": "",
    "published": "2012-10-11",
    "completed": null,
    "words": "7,607",
    "chapters": "1/1",
    "comments": "104",
    "kudos": "9,215",
    "bookmarks": "1,580",
    "hits": "120,955",
    "summary": "<p>Stiles is totally ready for his life to stop being a horror movie and start being a romcom. This... isn't exactly what he had in mind.</p>",
    "notes": "<p>Apologies for any liberties taken with the lycan canon.</p>",
    "text": "Isaac is getting really good at Stiles-hunting.\nStiles would object, but he's kind of proud that of all of them, Isaac's shown a particular flare for following a scent. He hadn't found his niche werewolf-wise like the others, Erica being scary and Boyd being sensible with Jackson rounding them out nicely by being a douchebag. Isaac wasn't really anything yet, no allocation on the Spice Girl line-up for him, so Stiles was willing to put up with a little humiliation for Isaac to have a thing.\nEven if it means a face full of dirt.\n\"Ow,\" Stiles complains, rolling over. Isaac really loves the running, heel-clip manoeuvre that results in a Stiles face plant every time. He's pretty sure he saw it on a National Geographic special about lions but Stiles is just glad that Isaac didn't take any other tips from that particular documentary.\nThat could've gotten awkward for all involved.\n\"The others aren't even close, not even Derek,\" Isaac enthuses, bouncing around Stiles like an excited puppy which is pretty much what he is. \"What did you use this time anyway? I wanted to stay away from you.\"\n\"A mix Deaton showed me how to make,\" Stiles says. He's been trying to find novel ways to mask his scent to keep the werewolves on their toes and he seems to have hit a winner with a blend Deaton created for him. No one noticed it when he was close by them but when they tried to track him, the scent encouraged them to head in the wrong direction. \nHe should totally market the stuff, especially in Beacon Hills. Maybe call it Wolf Away.\n\"Dammit, I dropped my wallet, help me look would you?\" Stiles says after he's patted down his empty pockets fruitlessly.\nIsaac nods agreeably and they both push hands through the piles of leaves for a few quiet minutes, waiting on the others to figure out where they are. Stiles is pretty sure that Derek will figure it out next, head towards the area he least wants to go not only because he's good at puzzle solving but because he's pretty contrary.\nIsaac squeaks and scuttles backwards and Stiles watches him, amused. \"Touch a spider?\" he guesses because Isaac is getting the hang of being a tough guy for the most part but he still turns into a fail-wolf when presented with anything with more than four legs.\n\"No, I... no,\" he says, crab walking forward again, color draining out of his face. \n\"What? What?\" Stiles demands. It's right then that Derek bursts out of the trees and nearly runs right over where Isaac is heading. Isaac is up and knocking Derek sideways, so fast Stiles almost can't follow the movement.\n\"You're only allowed to tackle Stiles,\" Derek grumps, brushing sticks and dirt out of his hair but Stiles is ignoring them both because he's managed to find what freaked Isaac out.\nA baby, buried by leaves.\n\"Is it... is it a... body?\" Isaac asks, small voiced and throat clicking on a dry swallow. Derek blinks at him, then is up and crowding against Stiles' back, concerned.\n\"No,\" Stiles says, scooping the baby up carefully, who grumbles a little but doesn't seem concerned otherwise. \"No it's... a little dirty but it's fine I think.\"\n\"Oh thank god,\" Isaac says, flopping backwards.\n\"Where'd it come from?\" Derek asks, leaning over Stiles' shoulder to poke a curious finger at the bundle. The baby unearths one hand from its blankets so it can grasp Derek's finger. He snatches it back with a hiss like he was burned and Stiles chuckles when he rises to his feet, holding the baby.\n\"You have as much information as us dude, we just found it,\" Stiles says, turns on his heels so he can thrust the baby at Derek. \"C'mon, take a whiff and tell us its fortune.\"\nDerek leans forward so tentatively that Stiles wants to outright laugh at him, but he resists the temptation. Derek's nostrils flare when he breathes in and Isaac stiffens as well.\n\"It's a werewolf.\"\n\n*\n\"He's fine,\" Deaton proclaims after looking in ears, taking temperatures and doing some other stuff Stiles hopes the baby never remembers because he will be back to bite Deaton's ass if he does. \"I mean, he's a little warm but I figure that's normal for a werewolf.\" He looks to Derek for a moment who nods stiffly.\n\"It's a boy?\" Stiles asks. He missed the unveiling and had to wait impatiently to find out.\n\"Yes. He can't have been out there for more than a few hours. He's not malnourished, no signs of prolonged exposure.\" Deaton looks at them all, serious face on. \"You guys don't know of any incursions into your territory?\"\nThe others look to Derek to answer for them all. \"There were faint traces where we found the kid, nothing I could follow, nothing I recognized.\"\n\"You think it was a lone omega?\" Deaton asks him.\n\"Makes sense. Sometimes omegas will abandon a child close to a pack's territory, hoping it will be taken in by an established pack. It's the best chance for survival.\"\n\"You mean someone just left the kid there?\" Stiles asks, a little horrified. He makes grabby hands at the baby and after Deaton gives him an exasperated nod, he picks the kid up and tucks him under his chin. Stiles isn't sure how he missed it before, but the kid definitely smells like the other wolves instead of a regular baby, all earth and wild things.\n\"Usually a mother's instincts wouldn't let her leave... she'd have to have had no other choice,\" Derek says, frowning. \"She might've been pursued by hunters and knew she couldn't outrun them towing a kid. We can't know for sure.\"\n\"She might just be trying to hide him. She might be coming back,\" Stiles says, hopeful, but he doesn't like the way Derek's face tightens at his words.\n\"She's most likely dead.\"\n\"Don't say that in front of the B-A-B-Y,\" Stiles hisses, folding his fingers over the baby's miniscule ears. \n\"Why are you spelling baby?\" Erica asks, rolling her eyes. \"Plus, he's too young to know what the hell is going on.\"\n\"Someone's got to protect his tiny sensibilities,\" Stiles sniffs, irked.\n\"I always knew you'd make a good mother someday,\" Erica says, grinning broadly and Stiles juggles the baby enough to be able to flip her off.\n\"Okay kids, what's the plan?\" Deaton interjects.\n\"He's a baby wolf. There's no way we can hand him over to the authorities,\" Stiles says, jostling the baby when he starts fussing. He subsides almost immediately and it's then that Stiles notices everyone is staring at him. \"What?\"\n\"You're on baby duty till we figure something out,\" Derek announces.\n\"Yeah, that's very funny,\" Stiles says, then when he notices Derek glowering, he quickly shoves the baby at Isaac who looks like he's been handed a bomb. \"No way. I'm the only one who lives with a parent who is, let me remind you, the authorities.\"\n\"What do you suggest?\" Derek grits out and Stiles smiles, takes the baby back from Isaac which they both look amazingly relieved about, then holds him out to Derek. \"Now who's being funny.\"\n\"He needs to be around wolves and you're the most responsible one, as much as it pains me to admit it.\"\n\"How do you figure?\"\n\"You know that health class where you have to look after an egg for a week like it's a child?\" Stiles gestures at Erica and Isaac, then shifts the baby to one arm so he can draw a finger of his free hand across his throat.\n\"Mine was fine,\" Boyd pipes up.\n\"I'm sorry, did you want to look after the baby?\" Stiles asks, raising his eyebrows.\n\"Shutting up,\" Boyd says and shrinks back.\n\"My place is full of... tetanus,\" Derek says, last ditch effort to get out of pup sitting duty.\n\"Your bedroom and the kitchen have been redone. Just make sure the baby doesn't get out of those areas. I've got some old stuff at my place that was baby Stiles proof so I'm pretty sure will be good for the junior wolf here.\" Stiles shoves the baby at Derek and doesn't really give him a choice about taking him.\nStiles turns to leave, head for home so he can grab the old crib his dad's never been able to throw out and the kid cage that was gathering dust in the back of the garage when he realizes he's caught on something.\nIt's Derek.\n\"You're helping me.\"\n\"Totally dude, I'm going to go get you stuff now.\"\n\"No, you're helping me,\" Derek says, voice going low and dangerous, maybe a little desperate. \"Tell your dad you're staying at Scott's and then come back to my house.\"\n\"I love how you give me orders like I'm going to follow them. It's adorable, really.\"\n\"You seem to be good with him,\" Deaton interjects, gives Stiles an amused smirk when he receives a death glare.\n\"Okay, that's the plan,\" Derek decides. \n\"Fine,\" Stiles huffs.\n\n*\n\"Can you not do that?\" Derek complains, dodging Stiles and the baby that's being waggled at him. \n\"We were just going to attack you with cuddles,\" Stiles says, pouting. \n\"Put it down.\"\n\"He freaks out when I do,\" Stiles says, kind of managing to flail around the space with his arms while still holding the kid. He's been walking the baby around the house and outside a little because he's been unsettled. Stiles tried feeding, changing and cuddling but the kid is getting grumpier by the minute, like he's caught it from Derek.\n\"Just... you'll get attached. You shouldn't.\"\n\"Ah, too late for that Obi Wolf Kenobi,\" Stiles says. \"Dean and I-\"\n\"Geez, don't name it,\" Derek groans, rubbing a tired hand down his face.\n\"I needed to call him something other than junior dude,\" Stiles says, unrepentant. Dean is giving him a wobbly lip and watery eyes, like he doesn't want to cry but he's fighting a losing battle. He's trying to be stoic like his adopted papa Derek which is crazy amounts of adorable but there's only so much a kid can handle that hasn't even seen his first anniversary. \"He really digs me but I think he needs wolf time.\"\n\"Ugh,\" is basically what Derek says, but he accepts Dean grudgingly, holds him away from his body like the baby's made completely of poop which is sort of possible considering Stiles didn't do a sniff check before handing him over.\n\"Would you just... why are you so bad at this? You've been around children before.\"\n\"Not for a long time,\" Derek says, rolls his eyes when Stiles basically manhandles him into cuddling Dean by shifting his arms and finding a space for Dean to fit like a game of Tetris. The baby takes a giant, contented whiff, burps and then passes out. \"Don't say a word.\"\n\"He wuvs you,\" Stiles says, curling his fists under his chin and batting his eyes at Derek.\n\"My arms might be occupied but I can still kick you.\"\n\"No violence when you're holding an infant.\"\n\"What is he wearing?\" Derek demands when he notices the t-shirt Dean's in. The front has the words My Daddy is Grrrreat and there's a picture of a dancing cartoon dog with blue spots underneath.\n\"I stopped at Walmart on the way back and that was the closest on-theme clothing I could find.\"\n\"I hate everything you do.\"\n\"I've kinda been getting that feeling lately.\"\n\n*\nHe therefore knows they're to blame for being in the supermarket later with a baby strapped to his chest and absolutely no way to explain it when he runs into his dad.\n\"Do I even want to know?\" his dad asks, which is less hysterical than Stiles was expecting. Then he does something else Stiles wasn't expecting and reaches out a hand to pat the baby's head.\nExcept, right at that moment, Dean isn't a baby. Stiles is looking down at a pair of fuzzy black ears and a grey pointed muzzle. Dangling out of the baby carrier's leg and arm holes are paws that are lazily batting at the air. \"Is he one of Deaton's?\"\n\"Yes!\" Stiles barks, almost hysterically latching onto the first logical explanation his dad offered. \"He... hurt his back? So I have to carry him. The puppy, not Deaton.\"\n\"There any reason you felt compelled to dress him?\"\n\"For funsies?\"\n\"We're not keeping him,\" Stiles' dad says, stern.\n\"No, no, no, no! Scott just volunteered to look after him overnight and since I'm staying at Scott's-\"\n\"He looks like a wolf.\"\n\"He's a... malamute mix. Crazy, right?\"\n\"Don't get attached,\" his dad huffs, although he's looking positively charmed as Dean enthusiastically licks his fingers. \"We're both not home enough for a dog like this.\"\n\"Yes sir, just dog sitting, I swear,\" Stiles says.\n\n*\nDerek's head appears from his bedroom and then the rest of him follows. \"So?\"\n\"You knew this could happen?\"\n\"We can shift pretty much from birth as a defense mechanism. Pups can run, babies can't. Did you see something frightening?\"\n\"Yeah, my dad,\" Stiles says. \n\"You were carrying him against your chest, he probably felt your heart rate speed up.\" Derek frowns for a moment. \"Did your dad see Dean change?\"\n\"No. I just looked like a crazy person with a dog in a baby carrier,\" Stiles grumbles and there's a quirk of Derek's lips that is very close to an actual smile. Derek hunkers down and holds his hands out and puppy Dean waddles towards him, tail wagging. \"Oh, now you're fine with him?\"\n\"He's gotta get my scent. He needs to feel reassured before he'll shift back.\"\n\"Can't he stay like this for a little while?\" Stiles asks, scooping Dean up before Derek can get a hand on him and pressing his face into Dean's fuzzy scruff. \"He'd be much easier to explain to my dad.\"\n\"I thought you liked the baby?\" Derek says, stealing Dean out of Stiles' grasp.\n\"I do, but...puppy!\" Stiles says, rubbing Dean's silky paws when they wave in his direction.\n\"My Mom used to tell me that I spent more time on four paws than two feet when I was little.\" \n\"I thought you guys didn't shift until you were older?\" Stiles says, scrunching up his face.\n\"Not into the full werewolf form, no. We can do this until we're about six.\"\n\"Neat,\" Stiles enthuses, huffs a disappointed sigh when Dean kind of whuffles and then shivers and there's a baby in Derek's arms again.\nDean makes up for no longer being a cute, fuzzy puppy by immediately peeing on Derek.\n\n*\nStiles forgoes the couch and instead puts Dean in the middle of Derek's bed with his body on one side and a wall of pillows on the other. Derek has a surprising amount of pillows considering his utter lack of any other soft furnishings.\nStiles means to read while Dean catches some sleep, but he must pass out himself because when he opens his eyes Derek's in the bed with them, having replaced the pillow wall on Dean's other side his body. \nStiles is much better at ignoring his uncomfortable yet surprisingly inevitable crush on Derek when he's not in such close proximity, looking all relaxed and much less frowny than usual. \nOne of Dean's chubby fists is batting against Derek's chin while he gurgles happily to himself. \"Hey, no, don't wake pappa grouchy wolf,\" Stiles says, making to grab Dean and roll them both off the bed to escape but Derek huffs and throws a leg over Stiles, pinning him. \n\"Stay,\" he grunts.\n\"Um, okay?\" Stiles relents, flopping back down on the bed with Dean draped across him. He can't reach his book so in an effort to entertain himself and ignore the fact that Derek is a warm, sleep muzzy weight that he could get far too used to, he holds Dean aloft and starts buzzing him around like a miniature rocket, making the appropriate zooming and pew-pew noises much to Dean's delight.\nScott clears his throat from the doorway.\n\"Um... you'd tell me if you'd eloped with Derek and then adopted a baby, right?\" Scott says, looking more than a little dubious.\n\"Dude!\" Stiles says, tucks Dean under one arm while he fights his way out from underneath Derek's leg. Derek's head rises and his hair is smashed flat on one side which is hilarious and Stiles really wishes he had his phone handy so he could take a picture.\nScott's nostrils flare and his face does something hilariously startled. \"Oh wait, correction, adopted a werewolf baby.\"\n\"No one's adopted anything. This is Dean.\" Stiles brandishes the baby at Scott and Scott actually skitters backwards, tucking his hands into his armpits and then scowling when Stiles just laughs at him. \n\"I don't want to touch it.\"\n\"You're such a wuss,\" Stiles huffs, clambers the rest of the way off the bed with Dean tucked against his chest and bounces him a little when he fusses. \"What are you doing out here?\"\n\"Derek called.\"\n\"You did?\" Stiles says, frowning and looking over his shoulder at Derek who has managed to lever himself upright and is dry washing his face with his hands. He's got a bare chest and bare feet and Stiles can't decide where to look or what he finds more compelling but he's used to that.\n\"He said there was something we all needed to know.\" Scott gives Stiles an impatient glare. \"Are you really not going to explain the baby?\"\n\"Not when it's driving you this crazy,\" Stiles says, grinning.\nScott huffs and stomps away. Stiles can hear him call out a greeting to Jackson who has just arrived. Stiles emerges from the bedroom to see the others have trickled in as well, Boyd herding Erica while Isaac is an already ungainly lump on the half-done living room floor. He's hunkered on the part that Derek's managed to refinish so Stiles drops down as well, wincing when his knees pop and lets Dean crawl out of his lap.\n\"Please explain the baby,\" Scott grits out, pointing at where Dean is making a circuit of the group, pausing sporadically to investigate hands and feet before he keeps on trucking.\n\"Patience young padawan,\" Stiles says and Derek gives him the side-eye before he drops to his haunches to redirect Dean from the part of the floor that's still mostly charred wood that hasn't been replaced yet.\n\"We think Dean was abandoned by an omega because she knew this was claimed pack territory,\" Derek explains for Scott's benefit. \"I've been making some calls and there's a pack my mother was on good terms with in New York that's willing to take him if she doesn't show back up.\"\n\"We're not giving him to strange wolves!\" Stiles protests, scooping Dean up protectively when he veers near enough. Dean pats at Stiles' face and gurgles.\n\"I've met them. They accepted Laura and I into their territory when we moved there. They're good people.\"\n\"Says you,\" Stiles huffs.\n\"There's a couple in the pack that have been trying unsuccessfully for a baby. Do you have a better idea?\" Derek asks, looking annoyed. \"We can't give him to humans and I was too young to be formally introduced to any of the other packs we had ties with to make so much as an overture in that direction.\"\n\"We could...\" Stiles chews on his bottom lip but nothing comes to him. \n\"We can't keep him,\" Derek says, a little more gently, sounding eerily like Stiles' dad. \"None of this pack are mature enough and as you've said numerous times, I live in a burned out shell of despair.\"\n\"Why do you pick now to agree with me about that?\" Stiles complains. Dean starts to whine a little, perhaps sensing Stiles' distress and he hands him off to Jackson who, weirdly enough, is the only other person that doesn't act like Dean will shatter when handling him. Jackson immediately holds Dean aloft and pushes his shirt aside so he can blow raspberries on his rounded tummy. Dean giggles delightedly and the fine layer of fur that had been sprouting along his arms and legs in response to Stiles' unease recedes.\n\"We're really lucky Pamela's pack were able to take him. They're a large pack, well established and better yet, under the radar when it comes to hunters. They're mostly made up of born werewolves so Dean will get the best start possible.\"\n\"You don't want him growing up in this freak show,\" Jackson adds, shrugging. The others look a little hurt by that but it's something Stiles can grudgingly agree with. They're not necessarily a freak show but they are unsettled, young and in constant danger.\nDean is better off well away from it all.\nStiles slowly nods, and he's a little heartened that Derek looks like he'd been waiting for his acquiescence before he rises and says, \"Good. Pamela is sending a couple of beta's to take Dean back to New York. They'll be here tomorrow so don't freak out if you smell them. I don't want us to destroy any goodwill we have because you guys can't control yourselves.\"\n\"Maybe you should all go burn off some excess energy while you can in the woods,\" Stiles suggests, getting to his feet and prying Dean away from Jackson. \nDerek offers him a smile, the small kind that makes Stiles feel warm in the pit of his stomach. \"That's an excellent idea,\" he agrees, already striding towards the door, stripping off the shirt he'd only just put on as he goes because he's ridiculous. \"Last one to the edge of town is on diaper duty until Dean's picked up tomorrow.\"\nThere's a mad scramble for the door and Stiles laughs at the tripping, shoving and outright biting that goes on before the other wolves disappear into the night.\n\n*\nStiles can see two men standing on the porch through the window beside the door, looking around. They're both dressed in black, one of them with a leather jacket and the other in just shirtsleeves despite the chill in the air. For a second Stiles can't decide whether they're hunters or wolves but then the one in the jacket heads back down the porch steps, sniffing the air in the direction the pack headed and Stiles is pretty sure he knows.\n\"Hey, hi,\" Stiles says, pushing open the door and holding it with his foot. Dean's in a milk coma so Stiles tosses him onto a shoulder. \"Are you-?\"\nThe guy in shirtsleeves spins on Stiles and makes for him, eyes fixed on the sleepy lump of Dean. Stiles scrambles backwards into the house, thinking about maybe slamming the door but he's seen Derek go through doors without blinking so he knows it won't be much of a hindrance.\n\"Give me the kid,\" Shirtsleeves demands, holding his hands out. The guy in the jacket is hanging back, eyes still scanning the woods like he's watching for the others.\n\"You're not from the New York pack,\" Stiles bites out and the guy advancing on him falters, before he reaches again for Dean, Stiles twisting to hold Dean in the protective curve of his body.\n\"Just bring the human, Jasper, Christ,\" the guy outside bawls and Stiles turns to flee but knows it's pretty fruitless, squeaks when a firm hand clamps on the back of his neck and tugs him nearly off his feet. Jasper breathes hot, fetid air into the side of Stiles' face.\n\"Fine,\" he growls and tows Stiles back towards the door.\n\n*\n\"Would you shut up?\" Jacket, name of Barney which Stiles will find funny later when and not if he survives this latest round of kidnapping, snaps from the driver's seat. Jasper, in the passenger seat, had given up on glowering at Stiles and telling him to shut it about ten minutes into their trip.\n\"I get horribly car sick when I'm in the back. I puke like, a lot. It's pretty spectacular.\"\n\"You can crack a window,\" Barney snarls between clenched teeth. \"Before you get any funny ideas, remember we can outrun you and we won't be in a good mood if we have to.\"\nStiles cranks his window down about halfway. Dean has roused somewhat and is starting to make distressed noises, probably in response to Stiles' erratically thumping heart. Stiles presses Dean closer, really lets his fear at the situation take hold and Dean lets out a short wail that tapers off into a yip as he shifts.\n\"Holy crap,\" Jasper says when he notices Stiles is now holding a pup. \"I didn't know it could happen that young.\" \nThe car slows when Barney takes a moment to look backwards as well and Stiles siezes his opportunity. \"Find Derek,\" he says right into Dean's fuzzy ear and then flings him out the car window.\nStiles yelps when Barney slams on the breaks and he's thrown into the back of the driver's seat, face first. He cranes around desperately and sees Dean has recovered from tumbling into a pile of leaves and is disappearing into the undergrowth in a swish of grey-tipped tail. \n\"Son of a bitch!\" Barney yells, reaches back to punch Stiles, a burst of bright pain across his cheekbone before he and Jasper are leaping from the car.\n\n*\nHe's in a pretty seedy-looking motel room so he knows where he is, at least. Lucky's Motel is on the outskirts of Beacon Hills, used mostly by tourists on their way to somewhere other than Beacon Hills. Lucky's is also where most of the after prom parties are held because Lucky himself is willing to turn a blind eye to underage drinking and people using the empty-for-years pool as a makeshift skateboard park.\nStiles makes his way across the patchy carpet, pretty sure the heated debate outside is about whether to kill him or not and he doesn't want to stick around for the decision, no matter what it is. If he remembers rightly from he and Scott sneaking out here when they were fifteen, most of the rooms have bathrooms that back onto the forest behind.\nStiles makes a face when he catches his reflection in the rust-spotted mirror over the sink. He takes a moment to prod at the ugly yellow and green under his eye, knows it's going to turn a spectacular mix of purple and black over the next day if he lives that long. Then he's over to the window, hoping desperately that the two werewolves are distracted enough growling at each other not to hear when he pushes the window back and uses the edge of the bathtub to hoist himself up and through.\nThere are two rooms in the whole motel that have a high brick wall behind them and unfortunately Stiles finds he's in one of these. There's enough space for him to squeeze out and into the gap between wall and motel room, but he can't make it over the wall so he's going to have to circle around to the front of the rooms to escape. \nStiles edges along the gap between the room's back wall and the brick, hunkers down when he reaches the corner and can see the two werewolves still arguing just outside the door. He's going to have to make a hell of a run for it when they go back inside because if he stays where he is when they discover him missing, they'll sniff him out in two seconds.\n\"-Alpha's scent was all over him!\" Jasper is saying, flailing his hands in the direction of the room.\n\"He's more trouble than he's worth. We should just kill him and go hunt the kid down.\"\n\"That pack will have found him by now,\" Jasper says. \"I'm telling you, they'll trade him for this guy.\"\n\"He's a pet.\"\n\"This is a smaller pack we're dealing with. The Alpha probably took a human mate so his authority wouldn't be challenged. He'll trade for the baby, especially because they don't know-\"\n\"I can't believe that Alpha bitch offed herself before we got to her. If she didn't, we'd have her power instead of chasing around a baby.\"\n\"Hang on,\" Barney says, nostrils flared and head whipping around. \"Can you smell that?\"\nStiles presses himself backwards, puts a hand over his mouth to stifle his breath sounds but the wolves aren't looking in his direction. Instead they're both watching the parking lot, the trees bordering it. Stiles blinks wide, hopeful eyes at the undergrowth, thinking maybe Derek's found him.\nA moment later though, Dean barrels out of the trees, yipping and almost tumbling over his own feet. Stiles lets out a distressed noise that he can't stop and while Jasper stalks across the parking lot towards the little wolf, Barney turns and his gold eyes find Stiles.\nBarney advances on him and Stiles has nowhere to go but through, hopes surprise is enough and shoots up, running straight at the oncoming werewolf. Barney does look startled for a second before he neatly sidesteps Stiles and grabs a handful of his shirt, pulling him up short.\n\"Dean, no, bad wolf!\" Stiles yells, managing to wrench himself out of Barney's grip for the few precious seconds it takes him to scoop up a rock and pitch it in Dean's direction, hoping to turn him around before it's too late. The rock falls short, but Dean skids to a stop anyway, letting out an unsure noise as Jasper gets closer to him. Jasper is moving slowly, hands out like he's trying not to spook Dean into flight.\nIt's then that Derek does in fact burst out of the edge of the forest, doing that weird four legged loping thing that Stiles will never get used to. He skids to a halt crouched over Dean and Stiles gets to feel a moment of pure unadulterated relief before Barney is yanking him up and across to where Jasper has fast retreated to.\n\"No closer!\" Barney yells, sounding desperate even to Stiles' ears. Derek's snarling, a deep thrum that is giving Stiles gooseflesh so he can't even imagine what it's doing to the other werewolves. Stiles feels the neck of his shirt tear under Barney's claws and then there's jagged, uneven teeth hovering over his now bare collarbone, an obvious threat.\n\"Toss us the pup and we'll let your human go,\" Jasper calls, trying to salvage the situation. Stiles sees Erica, Isaac and Scott ease out of the trees, all rumbling and jostling. Scott lunges forward enough that Derek has to put an arm out to stop him, Scott straining in Stiles' direction.\n\"Not going to happen. You kill him and you'll be dead five seconds later.\" Derek rises, still with Dean between his legs, the pup tugging on Derek's jeans with frantic teeth. \n\"He's not going to kill him. He's just going to bite him,\" Jasper says, and if Stiles noticed the way Derek tensed at that, then the werewolves were certainly going to. \"Yeah, we thought you might be keeping him human for a reason. Not sure why but each to their own I guess.\" Jasper's voice is increasing in confidence the more Derek bristles. \"I think we'll take the pup and the boy, just until we're far enough away from town for you not to get any stupid ideas.\"\n\"Call him to you,\" Barney growls into the vulnerable skin of Stiles' throat. For a second he doesn't know what the guy means, but then he gets it. \nThey want him to call Dean.\n\"No way,\" Stiles spits. \"Go on, bite me. The first thing I'll do is rip your throat out with my new teeth.\"\n\"Shut-\" Jasper starts to say, but that's when a wolf Stiles has never seen before lands on Jasper from the motel's roof, pile-driving him into the gravel. Barney is so startled that Stiles is able to pull out of his grip and stumble away far enough that when another wolf lands on Barney, Stiles is only knocked sideways and not flattened.\nDean lands on his chest a moment later and Derek is there, crouched over them both, Stiles almost able to feel the vibration from his growls coming up from deep in his chest. They stay like that until the new wolves toss both Jasper and Barney aside, lifeless and stand, blood slicking their faces and clothes.\nThere's a man and a woman, the man big and blonde and the woman small and dark. The woman is smiling at Derek, brushing her hands off on her jeans. \"I'm glad we got here early,\" she says.\nDerek finally acknowledges the woman with a nod, standing upright as well but keeping a leg pressed firmly to Stiles' side while Stiles attempts to stop Dean licking his face off in excitement. He's surrounded by his own wolves when Derek settles and Stiles accepts a hand up from Scott, cradling a squirming Dean to his chest.\n\"Meredith, it's good to see you,\" Derek says.\n\n*\n\"You're one to talk, Stiles,\" Derek grumbles and Stiles sighs, finally making his way over to the couple, only prodded a few times by Derek. Meredith watches them approach, a gentle smile on her face. Lars is standing behind her, a hand on her shoulder. They've cleaned up which Stiles appreciates, using the room he had been held in and then following Derek out to his house.\n\"Is this really okay? You're taking an Alpha werewolf into a pack with one already,\" Stiles says. \nThey pieced bits of the story together until they pretty much figured out what had happened. Dean's mother had been a packless Alpha instead of the omega they'd assumed her to be, making her vulnerable to attack from ambitious wolves. Ending her own life meant that her power had passed onto Dean instead of the werewolves chasing her but it had been a risk, even though she knew the area was pack controlled.\nShe was just lucky that Stiles and Isaac had found him before the other wolves pursuing her had.\n\"When he's old enough, he'll have some tough decisions to make but until then he needs protection. You don't have the numbers to do that effectively.\" Meredith is the Allison-type of practical and Stiles finds himself liking her despite himself. \"We'll raise him as one of our own,\" she adds gently, like she knows that's important for Stiles to hear.\n\"He'll be safe,\" Derek offers, poking Stiles again, who sighs heartily before he relents and gives Dean across. Lars is the one to take him, rubs a rough cheek against Dean to scent mark him or tickle him, Stiles isn't sure which, thinks maybe it's a bit of both.\n\"I think Dean will be a good bridge between our two packs,\" Meredith says. \"I'm sure Pamela will agree to Stiles visiting as an emissary.\"\n\"Not alone,\" Derek grunts and Meredith gives him an amused grin. \n\"Of course. We'll contact you when we're back in New York.\"\n\"Wait! You need Reginald,\" Stiles says, races back into Derek's house and comes out a moment later brandishing a stuffed giraffe with thoroughly chewed ears. \nLars offers his own smile and then they bundle into Meredith's car, already fitted with a baby seat. Scott loops an affectionate arm across Stiles' shoulders to watch them disappear down the road. \"You know man, if you love them, let them go.\"\n\"Oh my god, shut up,\" Stiles groans, elbowing Scott in the ribs. Scott laughs and takes Stiles down in a headlock and then they're scrambling around, slapping at each other and Derek's saying, \"Oh my god, really?\" before he leaves them to it.\nStiles feels a little better about the night when Erica and Isaac pile on and help him pin a protesting Scott so they can shove leaves down his shirt and rub mud in his hair.\n\n*\nHe's feeling a little punchy.\n\"I know.\"\n\"And yet you're lurking,\" Derek says, raising his head enough so he can see Stiles.\n\"You are the last person who should be passing judgement on other people's lurking,\" Stiles scoffs, shuffles across the room and drops down on the corner of Derek's bed. He might be crossing a line or taking a liberty or whatever, but Derek was the one to invade his space first.\n\"You should go home.\"\n\"Dude, I'm empty nesting here, plus my whole face hurts and I haven't thought of a convincing lie for my dad about it. I need ice cream and The Notebook.\"\n\"You'll survive.\"\n\"I suppose I should be used to getting absolutely no sympathy from wolf kind but I deserve at least a comfort cuddle,\" Stiles presses, reaching out to jiggle Derek's foot because he gets the feeling this is one of the few rare occasions that Derek will let him get away with it. Stiles has had a long, trying day, his life in danger for most of it so he's feeling a bit reckless, is maybe willing to push his luck in the life endangerment department.\nInstead of Derek kicking him out, which is what Stiles is expecting, he holds his arms open.\n\"Is this a trap? Are you going to compression suffocate me because you've finally reached the Stiles tolerance threshold?\"\n\"You have three seconds before I rescind the offer and we never speak of this again,\" Derek huffs, which isn't a no exactly.\nStiles flops backwards so he's on one of Derek's arms and Derek reels him in, arranges Stiles to his finicky satisfaction and then lets out a deep sigh, body relaxing, rough cheek pressed to the top of Stiles' head. \n\"You're good at hugging, you should do it more often,\" Stiles observes, trying to be clinical about the whole thing because otherwise he's definitely going to get a very inappropriate boner from the casually possessive splay of Derek's large hand on the small of his back.\n\"It's comfort and scent sharing. All werewolves are good at it,\" Derek says.\n\"Is that all this is?\"\n\"This is something you asked for, and it's a better option than being subjected to The Notebook.\"\n\"I was joking about that,\" Stiles huffs. \"My comfort movies of choice are totally manly, like Die Hard and anything with Steven Segal.\"\n\"I like Dirty Dancing.\"\n\"Lies.\"\n\"Nobody puts Baby in a corner.\"\n\"You're hurting my brain.\"\n\"You usually hurt mine so it's a nice change of pace.\"\n\"Are you just being nice to me because my nest is now empty?\" Stiles asks, turning his head so he can prop his chin on Derek's chest. \n\"No, just... seeing another werewolf threatening to bite you gave me a little... clarity.\"\n\"About what?\"\n\"About you.\"\n\"You're not biting me!\" Stiles squeaks, tries to scramble away but Derek clamps down, holds Stiles to him.\n\"Stiles, calm down. Stiles!\" he barks and Stiles flops, uncertain and worried. \"No, I'm not going to bite you, jesus,\" Derek grumbles.\n\"Oh, okay, good. Just... I'm sorry I'm not all yay werewolf, about myself I mean. I'm totally yay werewolf for you guys, except for Scott because he didn't really want it either and now he's used to it but I know he'd go back to being a regular asthmatic nerdburger if he could and-\"\n\"Stiles,\" Derek grunts, taps Stiles on the back of his head lightly to stop him rambling. \"I'm just trying to explain something to you.\"\n\"Oh, right, yes, please continue,\" Stiles says.\n\"I thought I had a problem with that, with you not wanting the bite. I thought because you didn't, we couldn't.\"\n\"We couldn't what?\"\nDerek raises his eyebrows, waits for Stiles to get it.\n\"Oh... Oh!. Wait, you want to, with me?\" Stiles asks, dumbfounded. \n\"Very much so, yes,\" Derek agrees. \"I mean, I've been aware of you wanting to for some time-\"\n\"Yeah, yeah, spare me the weird wolf senses and my total lack of privacy because of them.\"\n\"I'm just saying, it's okay, we can.\"\n\"Because you decided?\"\n\"Not just... no,\" Derek says, pushes Stiles off and he's about to be hurt by that but Derek is sitting up and tugging Stiles along with him before he can be so Stiles isn't staring up Derek's nose for this conversation. \"I decided I'd like to try, but you can decide whatever you want to. You've made it abundantly clear that I'm not the boss of you.\"\nStiles thinks about answering, thinks of the words he could use to very enthusiastically inform Derek that he's on board with the trying but he figures with werewolves, actions always speak louder than words.\nExcept, his mouth kind of gets the better of him when Stiles nudges closer to kiss Derek, and not in the way it's supposed to. \"You're really handsome. Is that dorky to say that? You're like, old school handsome which I didn't think people even were anymore and you're a big, doofy marshmallow when you think people won't notice it but I totally notice all the time and I never thought that this would even be possible, like I imagined it, of course I did because I'm nothing but a bag of directionless hormonal urges, or so my dad says but-\"\nStiles keeps trying to talk even when Derek pinches his mouth closed with his fingers. Instead of looking harassed which is Derek's default expression when Stiles starts to ramble, he looks kind of amused. \"Really? You're going to keep talking now?\"\n\"Scott reckons I would find a way to talk in a complete vacuum. No one in space can hear you scream but they would be able to hear me babble.\"\n\"I'm trying to remember why I thought this would be a good idea.\"\n\"Why do you?\" Stiles asks. He winces a little, because he doesn't want to give Derek an easy out, but again, his mouth totally gets away from him.\n\"I just... it doesn't have to be so hard.\"\n\"I thought that was the point,\" Stiles says, waggles his eyebrows. When Derek groans and knocks his head back against his headboard, Stiles adds, \"Oh c'mon, you couldn't just set something like that down without me picking it up.\"\n\"Just-\" Derek must decide that he's the one that's had enough of talking because he gets Stiles under the elbows and hauls him up, sets them together chest to foot and nips at Stiles' mouth until he can't help but let go an exhalation of surrender and open it to Derek's. \nWhen they pull apart eventually, Derek smiles. \"Ah, blessed silence.\"\n\"Funny,\" Stiles snorts."
}