{
    "id": "535679",
    "url": "https://archiveofourown.org/works/535679?view_full_work=true",
    "author": [
        "wangler"
    ],
    "title": "Outrun Your Ghosts",
    "rating": "Mature",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "F/M",
        "M/M"
    ],
    "fandoms": [
        "Teen Wolf (TV)"
    ],
    "relationships": [
        "Derek Hale/Stiles Stilinski",
        "Allison Argent/Scott McCall"
    ],
    "characters": [
        "Adrian Harris",
        "Scott McCall",
        "Stiles Stilinski",
        "Derek Hale",
        "Alan Deaton",
        "Ms. Morrell",
        "Lydia Martin",
        "Jackson Whittemore",
        "Sheriff Stilinski",
        "Melissa McCall",
        "Allison Argent"
    ],
    "additional_tags": [
        "Alternate Universe",
        "Additional Warnings Apply",
        "Intoxication",
        "Minor Violence",
        "Paranormal",
        "Suicide Attempt",
        "Romance"
    ],
    "language": "English",
    "series": "",
    "published": "2012-10-12",
    "completed": null,
    "words": "19,148",
    "chapters": "1/1",
    "comments": "546",
    "kudos": "10,133",
    "bookmarks": "2,983",
    "hits": "146,097",
    "summary": "<p>When Derek Hale arrives at the Beacon Hills Young Adult Rehabilitation Center, he plans on keeping his head down and serving the rest of his time in minimum security peace. Stiles Stilinski changes all of that.</p>",
    "notes": "<p><strong>Warning/Tags:</strong> AU - no werewolves, romance, psychiatric rehab setting, intoxication, mention of suicide, attempted suicide, mild violence, patient abuse, psychological abuse, handwave-y justice system, mention of past Kate/(underage)Derek, characters using flippant language about mental health disorders</p>",
    "text": "After his first week at the Beacon Hills Young Adult Rehabilitation Center, Derek’s allowed to explore the grounds. He heads for the lake. At twenty, he’s older and bigger than most of the boys, and they give him a wide berth as he trudges through the leaves, his hands shoved deep in the pockets of his jacket.\nIt’s fall, and chilly, and it makes his toes and nuts ache to watch the pack of boys out on the docks taking turns throwing each other into the dark lake water. They surface whooping and thrashing, and churn the water to a pale green.\n“You’re Derek Hale,” someone says. It startles him, and he feels his lip curl with reflexive anger. The voice comes from a boy who looks like he’s at the tail end of a long growth spurt, all big hands and feet and broad shoulders and a loose-limbed, uncoordinated gait.\nDerek’s used to being recognized, even now. It’s been four years since the fire, but in a town this small, folks remember things like eleven people dying on the same night, in the same inferno. People remember a sixteen-year-old boy being charged as an accomplice to the arson that killed his entire family.\n“And you’re in my way,” Derek says.\nThe boy glances over his shoulder and looks back at Derek. “You're going for a swim with those douchebags? In your... jeans?”\n“Maybe I’m going to watch.”\n“Wouldn’t fault you there. It’s eye candy central. But Whittemore is a Grade A fuckface, so... that kind of spoils the picture.”\n“I didn’t...” Derek goes hot at his armpits and hopes he isn’t flushing. “That’s not what I meant.”\n“Hey man, it’s cool. They hardly ever let us near the ladies. It’s like... a thing to check out guys in a drought situation. Right?” The boy doesn’t sound too sure, or sane for that matter. There’s a slightly manic edge to his tone as he plays with the zipper of his light jacket and shuffles from one foot to the other.\n“You’re still in my way,\" Derek says.\n“Yeah. Oh. Yeah, I just um. I wanted to say that I know you didn’t do it. And I’m Stilinski, but people call me Stiles. You can call me Stiles.”\n“I’m not going to call you anything,” Derek says, trying to move forward on the path. Stiles sidesteps and gets in front of him. They’re about the same height, but Stiles carries himself with his shoulders hunched in. Like he’s anticipating a blow.\n“I’m serious,” Stiles says.\n“Fine. Nice name. I’ll try to remember it. Bye.”\n“About the fire!” As soon as Stiles says it, he flinches and takes a step back. “About you not doing it, dude,” he says more quietly.\nFor a moment, Derek feels something like relief. It’s stupidly nice to hear someone say that they believe him—except this little shit isn’t saying that he believes Derek, he’s saying that he knows. And that’s bullshit. He was probably eleven or twelve when the fire happened. He knows nothing.\n“Shut up,” Derek says, grimacing at how childish it sounds.\n“You shut up! Everyone thinks you’re a psycho and that you went all Thelma and Louise with your sister because you did it, but you didn’t, it was all Kate. She is a crazy, crazy bi—”\nDerek’s on him before he realizes it, shoving him against a tree and pinning him there with his forearm. Stiles goes bug-eyed and red, wheezing. There are voices from up the hill at the main building, counselors shouting at Derek. There are more voices from down at the lake, jeers and encouragements, the bloodthirsty din of a crowd hoping for a fight.\n“How do you know that?” Derek asks.\nHe shakes Stiles because Stiles isn’t even listening—he’s staring at a fixed point behind Derek’s shoulder, and he looks different now, looks terrified. Not pressed against a tree trying to breathe terrified. A different kind. A kind that makes the back of Derek’s neck prickle up with cold sweat.\nDerek releases Stiles, suddenly feeling like he’s picking on a scared kid. It makes him feel sick. “Whatever,” he says, fixing the wrinkles on Stiles’ jacket and knowing there are about a dozen guards and counselors jogging at them with tasers. Great fucking first week in minimum security.\n“Because she keeps bragging about it,” Stiles says, his voice a low, hoarse mumble. It’s the last thing Derek hears before he’s tackled to the ground.\n\n***\n\nKate Argent isn't bragging about much these days. She's dead.\nDerek eats by himself under supervision in a corner of the cafeteria, stirring soupy oatmeal and remembering the way his uncle Peter had come to visiting hours and confessed the murder to Derek first, so that Derek would hear it from him and not through the inmate grapevine.\nKate had been older, convicted of murder and arson and locked away for life. Peter had spent almost four years recovering from his coma and burns enough to function in normal society with one goal: having Kate and everyone associated with the fire killed.\nDerek’s family sucks.\nThe alive part of his family, anyway. Everyone else, they’d all been—hell, even Peter had been—great. The best. The kind of family people put in grocery store commercials to sell Thanksgiving turkeys. Derek misses them so much he wants to burn the world and he can’t understand why Kate, who had no reason to set fire to anything, felt that same dark impulse and acted on it and took away everything he loved.\nPeter Hale paid an inmate to slit Kate Argent's throat and she died before she hit the ground.\nDerek scans the cafeteria. It’s Saturday, and everyone is back in their drab uniforms. Fridays are the only days the residents (a cutesy term for prisoners and in-patients) can wear their civvies. He has to glance around for a few minutes before he spots Stiles’ nicely-proportioned head and buzzed-short brown hair in a sea of grey.\nThere’s a chance the kid has had enough access to the Internet to come up with ways to provoke Derek about the fire. But why would he? Derek doesn’t know any Stilinskis other than the Beacon Hills sheriff, who always seemed like a nice guy, one of those TV dad types with tired eyes.\nWhat would Stiles have to gain by provoking him?\nMaybe Stiles is being bullied at the Center and he’s looking for protection. Derek knows how he looks—muscular and carefully unapproachable—and Stiles seemed like he was trying to get on his good side. The kid’s out of his mind if he thinks Derek’s going to stick his neck out for a gangly stray. He has to do a clean year at the Center before his release and another five years on probation before he's done serving time for Kate Argent's crime.\nDerek finishes eating, because he’s learned that a shitty meal is better than an empty stomach. He brings his tray to the dish racks and swipes the ID around his neck at the door to the kitchen to report for the dishwashing duty he’s earned for the entire month. Courtesy of Stiles.\n\n***\n\nDerek has to walk by the Center's small library every time he goes to his room. Like most of the common areas, it's walled with wide windows that don't allow for unsupervised behavior. The population of the library rarely changes. Most of the residents avoid it, sticking to the rec areas and expansive grounds when it's free time.\nIt takes Derek a few passes to realize the bowed head next to a high stack of textbooks belongs to Stiles. He's in there all the time.\nSo he's a bookworm. Whatever.\n\n***\n\n“Mom. Yeah, I know. I know.”\nDerek steps out of the water in the shower to make sure he heard that right. One thing they’re short on at the Center is moms. Especially in the boys' showers. He leans against the wall closest to the soft voice and cranes his neck to hear better.\n“She’s not like you. It’s all wrong. I think she’s here to hurt people. To hurt him.”\nDerek almost drops the soap as his fingers clench involuntarily. It’s Stiles. And he’s definitely out of his mind.\n“I know she can’t really but... I know. I’m not going to get involved.” Stiles sighs, sounding like a pissy teenager arguing with his mom. It gives Derek a dizzying sense of nostalgia for a moment. On the day his mother died, they argued about having sugary weekend-only cereal on a Thursday. He sighed at her and rolled his eyes and she swatted his head as he ducked away to catch a ride to school with his big sister.\nHe hasn’t thought about that in years.\n“I just want to go home,” Stiles says, softly, like he’s talking to himself now.\nDerek steps back into the water so he can’t hear him cry.\n\n***\n\nBefore breakfast, residents with clear behavior records are allowed to exercise on the trail that runs the border of the Center’s grounds, along the tall barbed wire fence lined with security cameras. Derek begins running the first day he’s allowed to, a month after he’s arrived.\nHe sets off at a hard run, not bothering to pace himself. He wants to feel like he’s getting somewhere, like he’s running away, like he’ll be free if he goes fast enough and wants it enough.\nHe passes another jogger, his mind on the harsh scraping sounds of his own breath and the slap of his shoes against the gravel.\n“Derek Hale!”\nDerek’s run hitches, but he doesn’t slow. He is not going to talk to Stiles.\n“Dude, your pace is murder.” Stiles wheezes as he catches up to him.\nDerek speeds up, like they’re playing tag.\n“Okay, bad wording,” Stiles pants out. “But seriously. You’ll never run a marathon at this rate.”\nResigned to the fact that Stiles is going to stay at his heels, Derek stops and watches as Stiles takes several jarring paces to slow down.\n“How old are you?” Derek asks, hunching over to catch his breath and wipe the sweat out of his eyes.\n“Almost seventeen.”\n“Are you a troubled youth or a headcase?” Derek asks, although he’d bet an entire week’s desserts that the answer is Stiles was locked up on account of batshit craziness.\nStiles’ mouth squirms, a pained expression working its way across his face before he shrugs. “I’m an inpatient, not a convicted asshole.”\n“Nobody’s perfect,” Derek says. Then, because Stiles looks like he’s trying not to look like someone drowned his kitten, he adds, “You’re fast as hell.”\n“I played lacrosse at school. Coach’s idea of practice was running us until we puked. I liked it though. Running. I like it.”\n“Lacrosse?”\n“It’s a modification of a centuries-old Native American game,” Stiles says, gesturing like he’s flinging a catapult. “With sticks. Like hockey sort of? But with baskets and running.”\n“Yes, Stiles, I know what lacrosse is. I mean, you don’t look like a lacrosse player.”\n“Well. Coach thinks I suck at it. So A+ for instincts. You wanna keep running?”\nYes, Derek thinks. Forever.\nHe sets off at a vaguely more reasonable pace and Stiles matches him for three miles, until the breakfast bell rings. They don’t talk as they shuffle into the showers, but Stiles pauses, lips parting like he’s going to say something, before he ducks into one of the bathroom stalls and stays in there until Derek is finished rinsing off.\n\n***\n\nRunning together becomes a tradition, not because Derek wants it to, but because Stiles shows up on the trail every morning. He has the near-vibrating energy of a teenager, and despite complaining every tenth of a mile, his endurance is better than Derek's. Now that he can run outside and not on treadmills, Derek makes it his personal goal to maintain a faster speed for long enough to outrun (and avoid) Stiles on the trail.\nSo far it's not going well.\nThey take a break where the trail edges along the quiet lake. Stiles sprawls out in the autumn leaves like he's trying to make snow angels. Just as Derek considers taking off again while Stiles is on the ground, Stiles says, \"I used to think I could outrun them.\"\n\"Who?\" Derek asks, curiosity outweighing his desire to not have a conversation with Stiles.\n\"You know,\" Stiles says, waving a hand vaguely.\nDerek has a suspicion Stiles means his hallucinations. \"But you can't?\" He can sympathize. It took him a long time to learn that nothing helps him outrun the memory of his family's funeral or his gut-deep fears of smoke and the smell of charred meat.\n\"Nope,\" Stiles says, sitting up and wiggling to try to get the leaves out of his sweatshirt.\n\"You'll have to get faster then,\" Derek says. He waits for Stiles to stand and stretch before setting off on the trail again.\n\n***\n\n\"Did you have a car?\" Stiles asks. He's stacking up carrot sticks on his lunch tray.\n\"No,\" Derek says, chewing celery loudly in hopes that Stiles will stop asking him questions about before. Before is not a time he likes to talk about.\n\"I have a Jeep. She's kind of powder blue with some customizations. She was impounded on a drug bust and my dad got a super crazy deal and gave her to me on my sixteenth birthday. I had to learn to drive a stick.\"\n\"Ah,\" Derek says.\n\"Can you drive a stick?\"\nDerek is a little embarrassed to admit this. \"No.\"\n\"Oh man, I'll show you how some time,\" Stiles says, like they can just walk out into a parking lot and start driving. \"It's fun. I was trying to teach Scott, but he's actually less coordinated than I am. We almost drove into a streetlight.\"\nWhen Derek doesn't finish his fries, Stiles steals them and eats them like a squirrel storing food in his mouth for the winter.\nDerek shakes his head, trying to hide a grin because he doesn't understand why Stiles makes him feel like smiling.\n\n***\n\nOnce a month, on a Friday, the female population is allowed to mingle with the male population on the baseball field. Derek thinks they picked the baseball field because the fences essentially make it a great big cage, and the grandstands make it easier for the counselors to keep an eye on the residents. The Center calls it Field Day and allows visitors, as if there's something special about standing around on a baseball diamond for hours.\nDerek goes because it’s a pretty day and staying inside means having to sort puzzle pieces in the rec room. He looks for Stiles out of habit. It’s become something that comforts him. He doesn’t know anyone at the Center, and doesn’t care about getting to know them, but he’s been forced to know Stiles and he likes to know where Stiles is, mostly so Stiles can’t sneak up on him saying something weird.\nWhen he spots Stiles, he thinks he’s seeing things. The kid is standing with two exceptionally pretty girls near the pitcher’s mound. One of them catches his eye and looks away quickly. He can easily read her lips as she asks, “Is that Derek Hale?”\nStiles turns, his expression lighting up in a big grin. His mouth is huge. “Derek! C’mere!”\nTo avoid gathering further attention, Derek jogs up to them, scowling.\n“So this is super awkward,” Stiles says. “But these are my friends Lydia—she’s here on a day pass visiting, even though I’m pretty sure she’s a sociopath—Martin and Allison. Um. Argent.”\nLydia has red hair and full lips and enough makeup that Derek can immediately pin her as an outsider. Allison is Kate’s niece and Derek thinks he might pass out. It’s a horrible feeling, like he can’t control his body at all no matter how much he doesn’t want to pass out in front of a bunch of strangers. The field ripples, like the surface of a wave pool.\n“Whoa, man,” Stiles says, grabbing Derek’s elbow. Derek wants to put his elbow in Stiles’ gut for touching him, but it’s annoyingly helpful to be steadied. “She’s one of us. Actually, one of the convicted assholes.”\n“Nice,” Allison says. Her arms are crossed tightly and her lips are pursed and she has dimples like Kate’s.\n“Sorry, inside joke,” Stiles says. “Actually she shot this guy Matt with like, six arrows.”\n“He was stalking me,” Allison says with a shrug.\n“It’s not like he died,” Lydia says. She’s playing with her hair and snapping gum like all of this is a very boring school trip.\n“My dad’s working on appeals.” Allison is slight, and very pretty, but there’s something hard in her eyes and Derek absolutely believes that she shot a man with arrows, as crazy as it sounds.\n“Seems justified,” Derek says, trying to go along with the unsettling, polite normalcy of their conversation. What he really wants is to shove her, to ask her why her aunt took everything from him. But that’s the kind of thing every one of his therapists in a long line of therapists has guided him to work through. Except they think he’ll really kill someone because they think he’s a killer and in reality he’s never killed anything but a squirrel. After he hit it he took it to a vet’s office to see if something could be done, even though its tiny body wasn’t moving on the passenger seat as he sped there wildly, trying not to kill anything else with his sister’s car.\nDerek breathes through the urge to shake Stiles off and run away.\n“Allison’s dating my best friend from school,\" Stiles says. \"Well, from ever. It’s kind of a long distance thing right now.”\n“Who’s this dickhead?” a sharp-faced boy asks as he wraps himself around Lydia from behind and kisses her neck until a whistle sounds from the stands. It’s Whittemore, one of the boys from the dock.\n“Derek Hale,” Lydia says, nuzzling Whittemore before turning a sharp gaze on Derek. “Aren’t you a little old to be in here?”\n“He’s twenty,” Stiles says. “They accept minimum security residents until twenty-one. This is Jackson,\" he tells Derek, \"and he’s definitely a convicted asshole.”\nDerek still feels dizzy, and Stiles is still holding his elbow like he’s helping a grandma cross the street. “Jackson Whittemore,” Derek says, remembering why he knows that name. “Your dad prosecuted my case.”\n“My bad,” Jackson says, smirking.\nLydia smiles. “Be nice.” She tucks Jackson’s hand around her middle until another whistle sounds.\nJackson shrugs. “Just because headcase here—” Derek cringes. “—has a new boyfriend doesn’t mean I have to play footsies with him. Did Stiles tell you why they locked him up?”\n“Shut up, Jackson,” Stiles says.\nDerek glances at Allison. He can’t help it. She’s an Argent and she’s right there, within arm’s reach. She’s watching him like she can’t hear anything else that’s happening, like she’s trying to measure him.\nJackson snorts. “Did he tell you how he started screaming in the bathroom at school because he thought he saw a zombie?”\nIt’s Stiles’ hitched, uneven breathing that pulls Derek’s attention back from Allison. “God, eat a bag of dicks, Jackson,” Stiles is saying, waving his hands for emphasis like he’s snatching flies out of the air.\nJackson looks at Derek, and ignores the way Lydia is pushing his shoulder and telling him to stop. “His dad didn’t want him anymore after that. Had him locked up for—”\nDerek’s fingers are already curled into a fist when Jackson’s head snaps back and he barrels into the kids standing behind him. Stiles is on him, following the punch with another, and a broken, ugly sort of snarl.\nAs Lydia screams at both of them and the counselors swarm, Allison takes Derek by the sleeve and pushes up on her toes to speak to him in a hurried, low voice. “They’re going to take him away again. He likes you. Don’t...” She bites her lip. “I believe him. About the stuff. And I’m sorry. About my aunt. I’m sorry that happened to you.”\nBefore Derek can reply, she’s gone, whisked away as the shouting counselors separate the male and female populations.\nDerek looks for Stiles in the fray, and sees him slumping to the ground, supported by a thin man with glasses who’s holding a metal cylinder that looks like a gun. Jackson’s sitting in the red clay, clutching a bloody nose and watching Stiles, his blue eyes wide and his brow furrowed deeply. All the nasty rage that sharpened his face is gone, and Derek realizes he’s just a kid too.\nStiles keeps fighting, moving like he’s in sludge, throwing a slow-motion punch and thrashing his legs out sluggishly as he lands on his side in a loose curl. He blinks, closes his eyes, and doesn’t move anymore.\n\n***\n\nThat night, Stiles is gone, the girls are gone, and Derek doesn't know what to do.\nHe shouldn't care. He has less than a year before his release, and the last thing he needs is to get wrapped up in a teenager's drama. Except. This doesn't feel like drama. It's not the typical infighting he's gotten used to after four years in various detention centers.\nHe shouldn't care, but he can't shake the way Stiles fought being tranqed like his life depended on it. It was probably some kind of classic paranoia, but it's still unsettling.I believe him, Allison had said.\nDerek sighs and goes looking for Stiles' roommate, hoping he can learn something from him. But there's no one in Stiles' room, and when Derek asks a kid walking by, the kid shrugs and says, \"I dunno. Greenburg is never around.\"\nIt's a few hours before curfew, so Derek slips into the empty room. There are two beds, like his own room, although his is effectively a single since they don't have enough adult residents to fill that section of the facility. He shouldn't even be in one of the juvenile halls, but he timed his rambling walk through the facility well enough to slip through every door as one of the juvenile residents entered with an ID card. No one gave him a second glance, so he's pretty sure it's standard practice to go wandering around whenever possible.\nThe room is nearly bare, sterile the way holding cells are. Above what Derek assumes is Stiles' mattress based solely on the wrinkled sheets and pile of dirty socks peeking out from under the bed, a few posters hang, promoting bands Derek has never heard of. It's like an ugly parody of a dorm room.\nDerek half-heartedly pokes around, opening a dresser drawer a few inches and sifting through a pile of essays and quizzes on the nightstand. He can't bring himself to read Stiles' private things and he feels like an idiot trying to play detective, so he slips back out of the room, into the pale fluorescent light in the hallway. It occurs to him that he's being filmed, but his snooping evidently doesn't warrant an alarm.\nWhen he gets back to his room, Derek does pushups until his arms tremble. There's a light dusting of clay on the dark blue carpet next to his shoes.\nWhere the hell is Stiles?\n\n***\n\n\"I didn't know he'd freak out,\" Jackson says. \"He didn't have to be such a girl about it.\"\nDerek shoves Jackson against the tile in the shower. \"Three minutes until the monitor checks on us. How much do you think I can accomplish in three minutes?\"\nJackson's eyes are scared, but he scowls. \"What the fuck is your problem?\"\n\"Tell me what you know.\"\n\"When I talk to my father about what you're pulling, I'll get a restraining order the size of this zip code, and your ass will be at county before you can—\"\nDerek gets Jackson by the throat. His grip is precise—not hard enough to leave a mark, but hard enough to show Jackson that he can knock him out, soon, if he doesn't wise up. \"Tell me,\" he repeats, slowly enough to get through Jackson's thick, rich-boy skull. \"What you know.\"\nThen he lets Jackson go and steps back to the showerhead beside him like nothing happened.\n\"It's true what I said about him freaking out at school,\" Jackson says shakily, his body a symphony of awkward, jerky motions as he showers in Derek's peripheral vision. \"He kept screaming about a dead kid in the bathroom and they took him away in an ambulance. It's just him and his dad I guess, and the doctors said it would be best to send him here where he could get better help. But you know that just means he's—\"\n\"Jackson.\"\n\"Whatever, dude. He thinks he can see ghosts. He talks to Scott about it because they're butt buddies and Scott talks to Allison about it because they're gross and Allison tells Lydia because girls can't exist without telling each other every goddamned thing, and Lydia tells me because she feels sorry for him. Fascinating shit. You can write a blog about it.\"\n\"What are you in here for, Whittemore?\"\nJackson shuts his showerhead off and grabs a towel. \"Performance enhancement. I'm only here until after Christmas break. My father thought it would be an important life lesson.\"\n\"I can tell it's really made a man out of you,\" Derek says to Jackson's back as Jackson walks away.\n\n***\n\nThe next morning, the cafeteria serves Cheerios and 2% milk. Derek scans the crowd for ten minutes before accepting that Stiles isn't there.\n\n***\n\nTwo days later, Derek goes running before breakfast, hoping to find Stiles, even though he knows Stiles will probably be banned from morning activities for a while because of the fight.\nHe runs like he's being chased, and by breakfast he's ready to go back to bed.\nStiles isn't there.\n\n***\n\nIt's a week before Stiles shows up for breakfast in the cafeteria, quietly eating chalky scrambled eggs drizzled with syrup. It's like he was never gone.\nDerek sits across from him. \"That's disgusting.\"\n\"I think you mean delicious,\" Stiles says. There's a bruise at his throat from the tranq gun. He glances up and gives Derek a thin smile. \"How's your marathon training going?\"\n\"I'm still working on the pacing issue,\" Derek says. The table feels a mile wide when he's consumed with a weird desire to physically examine Stiles for damage.\n\"So listen. Um. Sorry for the supremely awkward thing with my friends. I shouldn't have brought you over but Allison's actually really great and I dunno, I thought you should know that. And it's none of my business and super uncool and I'm sorry,\" Stiles says, looking down like he's speaking to the eggs.\n\"Why were you gone so long?\"\n\"I was just in the infirmary. It's not a big deal,\" Stiles says. He stabs a lump of eggs. \"Everything's fine.\"\n\"Allison said she believes you.\"\nStiles looks up. His chest rises and falls with two shallow, agitated breaths before he smiles. \"Yeah, I told you she's great,\" he says, giving a half-shrug and turning his attention to opening his carton of orange juice.\n\"But—\"\n\"It's not important,\" Stiles says, quick and anxious.\nBecause Derek has been losing his mind for seven days, snooping around and trying to learn about a kid he practically just met, he gives his tray an angry push and snaps out, \"So everything. All of that. It's just you being crazy?\" And ungrateful.\n\"Sure,\" Stiles says slowly. \"It's not the official diagnostic label, but it's concise. Gets the point across.\"\nWhat sucks is that even as he stands and stalks away, his breakfast uneaten and Stiles left behind looking like he's trying to shrink himself with the power of his mind, Derek still thinks there's something more to all this. And he hates that he can't let it go when he should. He shouldn't be obsessing over a teenager with baggage and a bad attitude.\nLater, in the library where Stiles doesn't show up even after Derek waits for two entire hours, Derek can't concentrate on reading. He can't even stay angry at anything but himself, for being so goddamned relieved that Stiles is back.\n\n***\n\nNo one uses the computer labs because the computers are so heavily monitored and loaded with every version of Net Nanny known to man that they can only be used to play solitaire.\nDerek likes the computer lab because it's quieter than the library and he actually likes solitaire.\n\"Oh my God, I haven't even done anything,\" he hears. And of course it's Stiles, sitting at one of the monitors, which is off. He's whispering to the blank screen. \"Mom, even if I wanted to have sex, there'd be way more logistics involved than just finding condoms. This place isn't exactly privacy central. Also he's not my boyfriend. He's probably not even gay, he's just like... lonely and kind of nice.\"\nDerek desperately wishes for the ability to become invisible. There's no way he'll get lucky enough to creep back out of the computer lab without Stiles seeing him.\n\"Yeah,\" Stiles is saying, rubbing the back of his head. Derek can see his shy grin in the reflection of the blank monitor. \"I know. He's totally cute.\"\nStiles quiets, like he's listening. He fidgets with his sleeves and hugs his one knee to his chest and nods intermittently. \"I told Dad that, but they talked him into paying for three more months, and they fed him all this bullshit—. Bullcrap. About separation anxiety and how I'd make stuff up to try to go home.\" He sighs. \"I know, Mom. I'll just. You know my filter sucks. I didn't mean to tell Derek, and I'm not gonna say anything to anyone else. I— What?\" He whirls and focuses on Derek and all Derek can think is that he just got tattled on by someone's dead mom.\n\"Uh,\" Derek says.\n\"Dude. Are you spying on me?\"\n\"This is a public room. Don't you have somewhere private to talk to yourself?\"\nStiles' jaw goes tight. He looks like he's about to say something, but his frown just deepens. There's something stubborn in his eyes. Derek thinks he must have been a real jackass when he was a little kid.\n\"Not going to defend yourself?\" Derek asks.\nStiles doesn't say anything.\nDerek points to the blank monitor. \"Is this because you told her you wouldn't say anything else?\"\n\"Told who?\"\nDerek frowns. \"Your mom.\"\n\"My mom died when I was eleven. That's a computer. Who's the crazy one now?\"\n\"Who are you afraid of?\" Derek asks.\nStiles is silent and very, very still for a long moment before he bursts with motion, crossing the cramped room to where Derek sits, his fingers dancing like he's been electrocuted. \"Everyone,\" he says in a low hiss. \"Do you think there's a single person on the planet who isn't going to want to lock me up for the rest of my life for this? My dad looks at me like he's sorry, like it hurts him, you know, that I exist. And everyone but Allison and Scott thinks I'm broken. You think I'm a headcase. I am! Fuck, I am.\" His breath rattles like his words are choking him.\nDerek catches one of Stiles' flailing hands by the wrist. \"I don't think you are.\"\n\"Liar,\" Stiles says. His hand is shaking. \"You don't have to lie to me.\"\n\"Allison believes you,\" Derek says. \"Is that because of Kate? Does Kate talk to you?\"\n\"Don't make fun of me,\" Stiles whispers. His head whips around like he heard something, and Derek's skin goes cold. He lets go of Stiles' hand and doesn't try to stop him when Stiles rushes out of the room.\nWhen Derek is alone in the silence, he wonders if he's alone at all.\n\"I'm sorry,\" he says quietly, to the monitor. What else can he say?\n\n***\n\nOn Halloween night, the counselors set up little bowls of candy at the monitoring stations. Under supervision, the girls are allowed to trick-or-treat through the boys' facility and vice versa.\nWay too old for trick-or-treating but privately annoyed that his pride is getting between his face and a lot of candy, Derek stays in his room until a knock sounds at the door. When he peers through the window that's criss-crossed with thin wire, Stiles is standing in the hall, waving with a sock on his hand.\nDerek opens the door. \"You're not doing much to dispel the crazy myth,\" he says.\n\"It's Halloween, jerkoff. This is a sock puppet. Come with me to get candy. You can help me carry as many Reeses as possible back to my room.\"\n'\"What do I get out of this arrangement?\"\n\"Spectacular company.\" Stiles opens and closes his fingers, making the suspiciously dingy-looking sock move its mouth. \"Entertainment?\"\nDerek's in sweatpants and bare feet and no shirt and he was ready to try to sleep early, but he sighs and throws his regulation t-shirt on and walks out into the hall with Stiles. \"I don't think a sock puppet is a legitimate Halloween costume.\"\n\"It's just a disguise. I'm going to fill it with candy.\"\n\"You're going to fill your dirty sock with candy?\" Derek shakes his head and reaches into one of the candy bowls they pass. He ends up with a handful of candy corn and begins eating each one of them in three small bites, one color at a time.\n\"It's not dirty, it's old. I don't have all the secrets to getting whites their whitest, okay?\"\nDerek pictures Stiles doing the laundry back at his home and figures it's a miracle the socks are still a vaguely neutral shade of off-white. \"Hey, is your dad the sheriff?\"\nStiles is busy trying to shove Reeses packages into the sock like he's hiding a shank. \"Huh? Yeah. He's been a cop my whole life. Although they almost fired him for having a crazy kid.\"\n\"Nobody can get fired for that.\"\n\"Well. I may have also hacked into the police database to get some info on—\" Stiles swallows. \"Just some stuff.\"\n\"I went to Beacon Hills High,\" Derek says, wondering how he didn't remember why Jackson's story about Stiles sounded familiar until now that he's wondering what Stiles would need information on that badly.\n\"Yeah. I know.\"\n\"When I was a freshman, a kid slit his wrists in the boy's bathroom. He died. They never put it in the papers because they didn't want copycats.\"\n\"If you're going for spooky Halloween stories, you could pick one less real, man.\"\nDerek sighs and quiets as they pass another group. When they're alone again, he bumps Stiles lightly, getting over his immediate discouragement enough to keep picking at the topic. \"I can't un-know what you told me. I'm not going to tell anyone else,\" he says, feeling a little guilty for pushing it. He's still not sure that shit like seeing ghosts can happen in real life, but he's convinced that Stiles believes what he's seeing. Even if it's hallucinations, they're obviously very real to Stiles.\n\"That's all I was looking for,\" Stiles says quietly. His sock puppet is already full, lumpy with candy, and he cradles it against his middle to keep the guts from falling out. \"The police report—it was all the same as what I saw. I hoped it wouldn't be, you know? Then they could just give me medicine or whatever and it wouldn't be a big deal.\"\n\"So we both know each other's spooky Halloween stories,\" Derek says. It feels like an olive branch. Or at least, his response to Stiles' weirder trick-or-treating olive branch.\nStiles slows and looks at Derek, smiling hesitantly. \"Our stories aren't very good Halloween stories.\"\n\"Ghosts and mass murder?\" Derek has never talked about the fire. Not casually. Not ever. Not unless it meant ending a long, frustrating therapy appointment. But Stiles makes him feel like he's buzzed. Or maybe it's a sugar high. \"Isn't that as good as it gets?\"\n\"No way. Good Halloween stories have like, naked ladies,\" Stiles says. \"And humping.\"\nDerek snorts a soft laugh. \"Last time I checked they had dead bodies in the woods or giant pumpkins. I think you're talking about bad horror movies.\"\n\"Maybe,\" Stiles says, his voice gone soft and vague. Derek follows his gaze, really hoping this won't turn into a repeat of Stiles' creepy conversations with his dead mom.\n\"Good evening, boys. Happy Halloween.\" It's the tall, thin man from the baseball field. He's wearing a white coat and glasses and stands at the monitoring station like a scarecrow.\n\"Hey Dr. Harris,\" Stiles says.\n\"How are you feeling?\"\n\"Fine. Really great.\" Stiles' fingers curl into the fabric of the sock around his other hand. He gives a short, silent huff of a laugh. \"Totally normal.\"\nHarris sizes Derek up. \"And you've made a friend?\"\n\"No,\" Stiles says, and it's weird how that immediately stings. \"We're just trick-or-treating. You know, doing the whole Halloween thing. Candy. Boo.\"\n\"I like candy corns,\" Derek adds helpfully.\n\"Excellent,\" Harris says. His smile is thin, like he's the only one aware of a private joke. \"Try not to be late to your evaluation tomorrow, Mr. Stilinski. I'd hate to revoke your fitness privileges for another week.\"\n\"Doubtful,\" Stiles mutters.\n\"Excuse me?\"\n\"I said 'wonderful.' See you in the morning,\" Stiles says, hustling around Harris and skipping the candy.\nDerek follows after him, resisting the urge to look back at Harris. There's an ugly tension in the air, but he can't pinpoint exactly what it's coming from other than Stiles' clear issue with authority figures. \"Not a fan of Dr. Harris?\"\n\"He's my primary care while I'm in here.\"\n\"And that's bad?\"\n\"He has total say when it comes to diagnosis and meds and releasing me and all that,\" Stiles says. \"And he's a smarmy asshat. Also he hates me for some reason. So no, not a fan of Dr. Harris.\"\n\"Hates you? How could he not be charmed by your personality?\" Derek asks, snickering when Stiles punches him in the arm with the sock puppet and half the Reeses go cascading to the floor.\n\n***\n\nDerek's never been on a date. When he was sixteen, and he snuck Kate Argent into his family home in the middle of the night, it wasn't a date. She picked through his room and talked about how pretty he was and asked to use the guest bathroom and then they had sex on his floor on a sleeping bag he shoved under his bed the next day, because he was terrified his mom would see the stains on it.\nThe next day everyone was dead before Derek and his older sister Laura got home from school. They took off after the funeral, running because they didn't want to be split up when all they had left was each other. Then Kate got caught and confessed and said that Derek asked her to do it, that they were lovers and he wanted his family out of the picture so he'd be free to live his life with his older girlfriend.\nLaura drove him to the sheriff's station, saying it would be okay, that no one would believe Kate Argent, that everyone knew how much Derek loved his family. That was the last time Derek saw his sister. She died in a car wreck six weeks later. They let him go to the funeral, but he couldn't get out of the car; he couldn't watch them put her in the ground.\nDerek's not an expert on dating, but it sure feels like a date when he walks Stiles back to his room and they stand in front of the door, close together.\n\"Do you want some of these?\" Stiles asks, holding out a Reeses. \"I have like two million.\"\n\"I'm not a big fan.\"\nStiles stares at him. \"Oh my God. You wound me.\"\n\"You think I'm cute?\" Derek blurts.\n\"Oh, wow,\" Stiles says, drawing it out. His breath smells like sweet peanut butter. \"That's ultra awkward. Yes. Yep. I better go.\" He points at the door. \"To my room. It's right here.\"\n\"Yeah,\" Derek says. \"Curfew. Got it.\"\nStiles pauses in the doorway, looking at Derek. He gives a sly little grin and kisses Derek's cheek. With the sock puppet. \"Goodnight, dude.\"\n\n***\n\nDerek doesn't see Stiles at breakfast, but doesn't think much of it since Stiles told Harris he'd see him in the morning.\nHe works out at the fitness center after breakfast and goes to a group therapy meeting where everyone seems a lot angrier than he is, in a way he can remember being, and knows he still is, at his core. It's just, he's been really distracted lately.\nNot only distracted but craving the distraction. The walking, mouthy distraction.\nHe reports for janitorial detail and vacuums a dozen bedrooms, lulled by the constant hum of the industrial vacuum and the soothing repetition. When he gets to his own room, the clay from the baseball field is still there, trapped in the carpet. It gives him an odd pang of regret to clean it up.\nLater, he realizes the vacuum was why he didn't hear Stiles pounding on the door to the adult dorms until almost too late. He runs over a shoelace with the vacuum and it tangles into the brushes and has to turn it off, and it's only then that he hears the rhythmic thumping and the muffled sound of his name, shouted over and over.\nDerek dashes out into the hall, following the vacuum's black power cord and the bright orange extension cord it's attached to. He reaches the hallway door and wrenches it open and Stiles stumbles into him like he was throwing all of his weight into the door.\n\"I know I said I wouldn't talk about it,\" Stiles says in a panting rush, \"but...\" He puts his arms around Derek's neck and lowers his voice to a whisper that's so hot and shivery against Derek's ear it takes Derek a few moments to process what Stiles is saying.\nWhen the words sink in, Stiles' breath doesn't feel good anymore.\n\"He killed her, I swear,\" Stiles whispers frantically. \"She showed me. She was in his office and he gave her something, and it was too much and she had a seizure and she died, and he moved her body and made it look like it was a suicide. Derek. I think he knows. I think he knows I know. Don't trust him. I don't know what to do. Please, Derek.\"\nThe doors burst open again before Derek can respond. Harris leads three counselors—the tall, meaty kind that work security more than anything else.\n\"Mr. Hale,\" Harris says. \"I thought we might find him with you.\"\nFeeling numb under his skin, like a wave of adrenaline is building, waiting to crash, Derek decides he believes Stiles. He doesn't have a good reason to. Not a single one. But he really believes him, dead people and all. And because he believes him, there's only one thing he can do.\nDerek pushes Stiles away gently, and keeps his eyes on Harris. \"It's fine, sir. He just seems a little attached to me.\"\n\"We've noticed that you two run together,\" Harris says, reaching for Stiles' wrist like he's reaching for a feral animal.\nStiles is staring at Derek at the edge of Derek's vision, a pale, dark eyed thing breathing too hard. He lets Harris tug him.\n\"You know how it is,\" Derek says, forcing himself to smile. \"You don't want to say no when someone's, you know.\"\n\"A headcase,\" Stiles fills in for him.\n\"Mentally ill,\" Harris says, his tone brittle and soft. \"We've talked about your language, Mr. Stilinski. Acceptance begins with you.\"\nDerek glances at Stiles, and feels like he got hit in the solar plexus. Stiles is buying it, hook line and sinker, betrayal written across his face like a tattoo. Fuck.\nStiles only looks away from Derek when they turn him and lead him out the door, two big counselors flanking him like walls. \"Accept this,\" Stiles says, flipping Harris the bird as they pass.\n\"Sorry for the trouble, Mr. Hale,\" Harris says, when they're alone.\n\"It's fine. I feel bad for him. It's gotta be rough being so confused,\" Derek says, each word like a drop of lead in his gut. He's lied plenty of times, when he's had to, but it's never felt this bad.\n\"He's a very sick boy,\" Harris says. \"We're doing what we can.\"\n\"He's okay, right?\" Derek asks. \"These episodes don't hurt him?\"\n\"No. Though I believe he poses a danger to himself. We'll be adjusting his medication. Ah,\" he says, gesturing in apology. \"But that's enough of that. Patient confidentiality.\"\n\"Of course,\" Derek says.\n\"It's kind of you to keep an eye on him,\" Harris says. \"I'll be sure to report that to the proper channels. We keep detailed records here at the Center.\" He's smiling, and that thin sliver of a threat is all Derek needs to know he made the right choice.\nThis man is dangerous.\nAnd now he has Stiles. Again.\n\n***\n\nIt's drizzling next time they're allowed out on the baseball field with the girls. Derek huddles in the dugout, watching the rain turn the clay a dark, ugly shade of brown.\n\"Where the hell is Stiles?\" someone asks him. He looks up from the bench and sees a boy around Stiles' age with messy hair and black eyes. Derek's pretty sure he's never seen him at the Center before.\n\"Scott, calm down,\" Allison says, jogging after him. She has her hair pulled to one side and she's fidgeting with the ID card around her neck. \"Derek, this is Scott. He's—we're dating.\"\n\"I came to visit Stiles,\" Scott says. \"We can't find him.\"\n\"He's...\" Derek closes his eyes, hating the way they're watching him, hopeful and scared. When he opens his eyes again, it isn't any easier. \"He's in the rec room.\"\n\"What the hell,\" Scott says. \"Dude, I skipped school to come out here. Can't somebody go get him?\"\nDerek looks at Allison. \"He doesn't want to come out.\" She frowns. \"Or talk to anyone. Or go running. Or eat.\" He checks himself as his voice gets louder, more agitated. \"Or anything.\"\n\"Why?\" Scott asks.\n\"Harris,\" Allison says quietly.\nDerek nods, unwilling to say anything else. After what he's seen, he wouldn't put it past the Center to film them in the dugout.\nThere's no way Derek can explain to them how bad off Stiles had been when Derek tried to coax him out to the field. Stiles sat on the couch, listing against the armrest, his gaze slowly shifting around the room, unfocused.\n\"Why don't you come outside?\" Derek asked, crouching in front of him. He didn't expect much. It had been over a week of this. \"Allison will be out there today.\"\nStiles twitched, as if hearing something, and shied to the right, not away from Derek but away from the empty space beside him.\n\"Stiles,\" Derek said, talking to him slowly, like he was speaking to a child. \"You like it outside. Come on. It's not raining much.\"\n\"I can't find her,\" Stiles said, so softly it was barely audible. His gaze remained blank, focused somewhere at Derek's chest.\n\"Allison? She's outside. I promise. Come on, you can stay with me. We can throw mud at Jackson. Run bases. Whatever you want.\"\n\"Not Allison.\" Stiles leaned back and seemed to lose his balance. He caught himself with his palms against the couch cushions and blinked. \"Mom was here. She said, be quiet baby. Shh, shh.\" He sighed out a soft, sweet sound and tilted into the armrest, head pillowed in his arms. \"Where'd she go?\"\n\"Not far,\" Derek said. \"I promise. Okay? So let's just go outside for a little while.\"\nStiles looked at him, eerie and curious. \"You're Derek Hale. Sorry. About Kate. She's not very nice.\"\nDerek placed his hands on Stiles' knees and tried not to squeeze too hard. \"Stiles, listen to me! You're just... you're just.\" What. Drugged? Poisoned? Buried under a layers of chemicals so thick they had to feed him a liquid diet and help him use the bathroom? Derek sighed. \"Okay. I'll be back soon.\"\n\"I'm gonna wait here,\" Stiles said, blinking sleepily. \"For my dad.\"\n\"It's bad,\" Derek says to Allison, as Scott turns and rattles the fence, growling until a whistle blows.\n\n***\n\nThey have limited contact with the outside; everything hinges on Scott. Allison takes him out into the rain, holding his hand and giggling, and when they reach the outfield and sit side by side, like young lovers stealing time, she speaks to him in hushed tones.\nDerek watches from the dugout, making sure he can't hear them, and that they look happy and flirtatious and not at all like Allison is grilling Scott on everything has to tell Sheriff Stilinski.\n\n***\n\nDerek used to be good at waiting. The past four years of his life have been an exercise in patience, in finding things to do to pass the time and quiet his mind. When he isn't busy enough, regret hits him, like ink in his blood, and hate follows. He hates himself for falling for a pretty girl with a pretty smile. A stranger. He never should have brought a stranger into his house, where his family slept, where they'd been safe and sound and alive. He hates himself for being excited about doing something wrong.\nWhen he remembers, he remembers laughing that night, kissing her body where she told him to put his mouth.\nIt's a cause and effect he feels when he's alone with his own body. He fucked around, and now everyone's dead. One of his therapists told him that his self-loathing is why he works out so much, why he's spent years running and lifting weights and changing his body. He isn't the skinny kid he was when he stood in front of his parents' graves and knew he put them in the ground.\nDerek doesn't give a shit what his court-appointed therapists say. When his lungs are burning and his muscles ache and he can barely breathe, he almost feels normal. That's all.\nOut on the track, along the high fence, Derek stops running and hunches over, gasping. He's been going too fast this time, pushing too hard without Stiles at his heels bitching about a reasonable pace. No matter how much he runs, he can't stop thinking about Kate. About Kate talking to Stiles. About Stiles in his bed, staring at the ceiling.\nHe used to be good at waiting, but now he itches all over, hurting with the need to know if Scott's talked to the sheriff yet.\n\n***\n\nA few days later, Derek goes to shower before bed after working out in his room. He almost trips over Stiles, who is sitting on the wet tile in a stream of cold water, fully dressed.\n\"Jesus, Stiles,\" Derek says, turning the water off. \"What are you doing here?\"\nIt's worse than usual.\nIt's not the childlike emptiness that's consumed Stiles ever since the counselors led him away. This time, Stiles has his wrists pressed against his ears and he's shivering and muttering to himself, and Derek knows this is more than he can handle on his own, even as he tries.\n\"Let's get you dry,\" Derek says, trying to coax Stiles up.\nStiles flinches and hiccups a sound. It's a sob, Derek realizes. The hoarse, dry kind that comes when you've been crying so long your eyes are dry and your throat is raw and your nose is stuffed up.\nThat's, of course, when Jackson Whittemore walks in. \"Wow, you guys. Get a room.\" He stops and sighs. \"What's wrong.\"\n\"He's freaking out,\" Derek snaps, his hands on Stiles' wet shoulders. \"What does it look like?\"\n\"So call the monitor station, dipshit. They're not paying us to mop up headcases.\"\n\"He's your friend,\" Derek says, trying to insinuate grow a pair, you fucking reptile.\n\"He goes to my school. There's a big difference.\" But Jackson crouches anyway, the cuffs of his pajama pants dragging on the wet tiles. \"He doesn't look so hot.\"\n\"My room's not far from here,\" Derek says. \"Think we can get him back there?\"\n\"I think this is starting to sound really shady,\" Jackson says, staring uncomfortably at Stiles, who is still curled up, clawing at his short hair and muttering things like no and shut up shut up.\nThey manage to hoist Stiles up without any of them slipping and breaking something, but moving is more difficult, mostly because Stiles refuses to walk and clings to Derek like a wet octopus once he's standing.\n\"There's no way you're going to get him to your room to do whatever weird shit you have planned,\" Jackson says. \"I can... I can go get you more towels; I'm on laundry this week. But if you tell anyone I'll—\"\n\"You'll what?\" Derek snaps.\nJackson gives him a long, tight-lipped glare and leaves.\nThe big bathroom stall at one end of the room is their best bet for privacy. It's not Derek's first choice, but Jackson is right. If Derek tries to take Stiles back to his room, they'll never manage to look casual enough to avoid catching the attention of whoever monitors the security feeds.\n\"What happened?\" Derek asks, as he settles Stiles down onto the floor and starts stripping him out of his wet tee shirt. He doesn't expect an answer, and Stiles doesn't give him one. Instead, Stiles presses as much of his body as he can against Derek's while keeping his ears covered again. He's way too big to be plastered to Derek's lap, but Derek does his best to hold him.\nWhen Jackson comes back, it's mildly surprising. When he throws the warm towels at Derek's head and walks away, it isn't. But Derek allows himself a small breath of relief once he has something to dry and warm Stiles with. He knows he's flying by the seat of his pants, and probably doing more harm than good, but he can't bring himself to call the monitors, who will send for Harris and his goons. Not yet.\nDerek rests his back against the wall and brackets Stiles with his arms and legs, shifting Stiles every time he relaxes enough to be moved. Eventually, they find a position that's almost comfortable, minus how numb Derek's butt feels from sitting on the tile in his thin sweatpants. Stiles' pants and socks are edging toward dry, and his bare, freckled shoulders are warm from the towel and the compulsive way Derek's been stroking him for an hour.\n\"This place is really boring without you,\" Derek says quietly. \"I don't like anyone else here.\"\n\"Her name is Ellen,\" Stiles whispers, startling Derek. \"She gets mad sometimes when I'm not listening, and she starts screaming at me. She's a spooky Halloween story, Derek. She won't believe me that I can't do anything, not yet. Not until my dad comes to pick me up. But she won't listen, she just screams at me. I think... I think she was really sick. She's distorted, you know? Even Kate won't hang around when she's here.\"\n\"Is she here now?\" Derek asks, feeling selfish for worrying about that first, when he should be trying to get Stiles to talk more, to finally communicate again.\nThe automatic bathroom lights are off, and it's almost pitch black, the only light a weak glow from the red exit sign. There's plenty of room for ghosts.\n\"Yeah, she is,\" Stiles says. \"She says I can go to sleep now.\" He moans, soft and miserable, and presses his face to Derek's throat. \"I'm so tired.\"\nDerek stays awake all night, holding him.\n\n***\n\nBefore dawn, Derek cocoons Stiles in towels and goes to the monitoring station. He tells them he just got up to use the bathroom and found Stiles in there, and no one asks any questions. When he leads them back to the bathroom and hovers near the showers, he sees Stiles wake to bleary lucidity.\nTheir eyes meet.\n\"How long?\" Stiles mouths, tapping at his wrist.\nDerek hesitates, before holding up two fingers and mouthing as clearly as he can, \"Two weeks.\"\nIt's been two weeks since Harris started drugging Stiles.\nStiles frowns.\n\n***\n\nThe days are tedious. After three more mornings pass, Derek decides he can't just sit around waiting to find out what Scott McCall is accomplishing out in the real world. Derek can only assume that something's gone wrong, because even the few hours he spent with Sheriff Stilinski years ago were enough to show him that the man would never leave Stiles in this state knowingly.\nThey're permitted weekly phone calls and by now Allison should have been able to speak to Scott. Derek has to get to her to find out what Scott said.\nBut first Derek visits Stiles, which is as simple as making his way to Stiles' favorite place on the couch in the rec room, near the locked double doors where deliveries come in and the Center's staff members check in and out from a small office. It's taken Derek a few visits to figure out that the opening doors are all that Stiles really pays attention to. As if he's waiting. As if he's expecting someone.\nWhen Derek gets there, a staff member is sitting with Stiles, hand-feeding him bits of a soft cookie. He recognizes her from some of the group therapy sessions. She's a Licensed Mental Health Counselor, which means he'll probably have a one on one date with her at some point.\n\"Doctor... um,\" Derek says.\n\"Morrell. Just Ms. Morrell,\" she says, friendly but guarded. \"Stiles, is this a friend of yours?\"\n\"He's not going to answer you,\" Derek says.\n\"Give him some credit. He's not unresponsive.\"\n\"No,\" Derek says, unable to mask his irritation. \"Just sedated within an inch of his life.\"\n\"So you are friends,\" she says, patting the couch beside her. Derek doesn't like letting her sit between them, but he complies, hoping she'll wander off if he proves himself to be no danger to Stiles.\nDerek's never put that much thought into it. They are, right? Of course they are. Stiles kissed him with a sock puppet. Derek can't stop thinking about Stiles. They're friends. \"He goes running with me.\"\n\"You spend a lot of time with him here in the rec room these days.\"\n\"Is that on the security tapes?\"\nMorrell's brow furrows and she glances around until her gaze settles on a narrow camera attached to the ceiling in the corner. \"Those are in place per licensing standards. I don't watch them. I'm not sure who does.\"\n\"Then who's spying on me?\"\n\"No one's spying on you, Derek,\" Morrell says. \"The counselors mentioned it to me. We're all glad to know someone's watching out for Stiles.\" She strokes Stiles' forearm absently, and Stiles stares at absolutely nothing as he continues to chew the small piece of cookie she pushed between his lips.\n\"Don't you think it's weird that he's this drugged out? He was fine a few weeks ago,\" Derek says, uncomfortable on the couch beside her. He doesn't know what to do with his hands, and they curl in his lap like claws.\n\"You have to trust his doctor's judgment. I know it must be troubling for you, but it won't be permanent,\" Morrell says. \"These medications tend to have an adjustment period.\"\n\"He's not adjusting,\" Derek mutters. What Morrell is saying sounds reasonable, almost reasonable enough for Derek to wonder what kind of spiral of paranoia he's been sucked into. But only almost.\nThere's a sense of urgency in him, like a screw under his ribs, tightening more with every breath. The longer he watches Stiles withdraw from the world, the longer it's been since Stiles made a smartass comment or laughed with his mouth open too wide, the more Derek feels like this is a life or death situation. But who's going to believe that?\n\"Give him a few more days,\" Morrell says. \"If he's still struggling this much, I'll speak to Dr. Harris about his medications. Would that make you feel better?\"\nIt would. But right now, it's not enough. \"Do you think it would help for him to be around someone familiar?\" Derek asks.\nMorrell frowns. \"It's my understanding that Dr. Harris has strongly requested that the Stilinski family remain hands off during this adjustment process.\"\n\"I don't mean his dad. I mean—Allison Argent. They're classmates. She's over in the girls' facility.\"\n\"Doesn't Stiles see her on field days?\" Morrell asks, wrapping the remains of the cookie up in a napkin and placing it on the coffee table in front of them.\n\"He won't come out. She was asking for him last time,\" Derek says, trying not to sound too eager.\n\"I see.\" Morrell wipes the crumbs from her fingers delicately and glances at the clock. \"I suppose she could have a quick visit. Would you mind staying here with Stiles while I go see if she's available?\"\n\"Not at all,\" Derek says. When Morrell stands, he scoots closer to Stiles, but not as close as he wants to, and it's not until then, that the urge strikes him, that he realizes how exactly strong the impulse is.\nThey're definitely friends.\nAfter Morrell walks away, her black pumps clicking on the polished floor, Derek stares at Stiles' hand. It looks so still, nothing like the wild appendage Stiles punctuates every other sentence with.\n\"I'm going to fix this,\" Derek says. He looks around the room. The counselor at the monitoring station is reading a book, and two residents are playing chess in the corner, and the TV is droning quietly. No one notices them when Derek threads his fingers between Stiles' and holds his hand gently while they wait for Allison.\n\n***\n\n\"You've grown up into a real woman,\" Stiles says, when Allison walks up to them. Morrell, trailing behind, doesn't look too happy about that greeting.\nAllison glances at Derek, wide-eyed for a moment until she composes herself with a vague giggle and pushes her hair back behind her ears. \"It's been like a month, Stiles. Shut up.\"\nKate Argent is a complication they don't need.\n\"That was good though,\" Derek says, pretending like Allison elicited a random bout of lucidity and not a strange, ugly taunt from a dead woman. \"He's recognizing friends, right?\"\nStiles snorts. His gaze is sharp, too keen, and then he shudders and squirms his shoulders and between one blink and the next his eyes are blank and gentle again. \"I really hate her,\" he mumbles, pushing his tongue out of his mouth like he tastes something bad.\n\"You hate Allison?\" Morrell asks, in the clinical way therapists do, like it's a question about the weather.\n\"I like Allison,\" Stiles says. He squints, as if peering through a fog, and sees Allison, and gives her a crooked, faint smile. \"She shoots bad guys.\"\n\"That's me,\" Allison says, blinking hard, but not hard enough to stop the thin tears that scatter down her cheeks. She pushes between Derek and Stiles and puts her arms around Stiles, hugging him desperately. Stiles leans into her and closes his eyes, and Derek realizes there was actually some merit in his plan to get Allison out of the girls' facility long enough to get information.\nMorrell crosses her arms. \"All right. I'm giving you five minutes. Any more than that and I'm going to need to chart it.\"\n\"Thank you, Ms. Morrell,\" Allison says. \"I really appreciate it.\"\n\"Thank Derek. It was his idea,\" Morrell says, giving Derek a weird look he can't read. Before he can think about it too much, she's walking to the adjacent staff lounge and the clock is ticking.\nDerek fights back a pang of jealousy as Stiles rests his head against Allison's shoulder and falls asleep like he's been awake for days.\n\"I didn't realize you guys were...\" Derek starts, unable to even finish the sentence because he can feel himself acting like an idiot and not focusing on the actual crisis at hand.\n\"We met outside of school,\" Allison says. \"In a grief program for kids. Our, you know, moms.\"\nDerek didn't know. He's never wanted to keep up with the Argents. And now he feels like a dick. \"Oh.\" He swallows. \"Has Scott...?\"\n\"He talked to Stiles' dad. And Scott's mom—she's a nurse at the hospital.\" Allison adjusts herself on the couch so she can glance at Stiles' face. Derek's heart sinks as he sees that she's checking to make sure he's asleep. \"Harris got to them,\" she says.\n\"What do you mean got to them?\" Derek grips the back of the couch, hard, already feeling like he wants to rip it to pieces.\n\"Harris called them both and said that a lot of kids hatch elaborate plans to try to get discharged or pulled out. Scott and Stiles have been friends since they were little kids and they're always in a world of shit, so... they think Scott's making it up to help Stiles.\"\n\"He is trying to help Stiles!\"\n\"There's nothing he could say,\" Allison says, voice wavering. With anger, Derek realizes. \"You know I believe him. There's things he knows about her that no one else would know. But Stiles' dad isn't going to believe that his kid talks to dead people. He's freaked out and he thinks Harris is helping Stiles get better.\"\n\"What if he comes here? Scott has to tell him to come, that he has to visit. If he sees this there's no way he'll think it's helping.\"\nAllison shakes her head. \"They told him that Stiles had a bad episode, like... that he was hurting himself, and that there's some intensive thing they're doing and that relatives can't come see him.\"\n\"What about Thanksgiving?\" Derek asks. There are paper turkeys everywhere announcing the lunch and dinner on Thursday. From the gossip he's heard in the halls and before meetings, it sounds like everyone has a visitor coming for the big communal meal.\n\"Scott's coming,\" Allison says, biting her lip. \"And his mom. To see me, I mean. But Scott said that Stiles' dad isn't coming. They asked him not to.\"\nIt's like all the air is being sucked out of the room. \"So that's it?\" Derek asks. \"That can't be it.\"\n\"Maybe we can try to talk to Mrs. McCall on Thursday. Maybe if it's both of us, and not Scott... I don't know. She's pretty good friends with the sheriff.\"\nDerek's shaking his head and trying to swallow back a bitter cocktail of panic and rage when Morrell comes strolling back to the couch. \"Oh no. He fell asleep?\" she asks with a fond smile.\n\"He must have been tired,\" Allison says, holding Stiles like it's going to take a fight to get him out of her arms.\nMorrell looks at Derek. \"That's too bad. I hope you two were able to make the most of your visit anyway.\" That weird look is back.\nEventually, Allison has to get up, and she nudges Stiles into Derek's hold and gives them a long look, like she's having profound realization. Derek feels his neck heat with a flush. \"I can hang here some more while he sleeps,\" he says, clearing his throat against a sudden hoarseness.\nDerek watches Morrell and Allison walk away, their idle conversation soft and musical. He's glad Stiles is still asleep. When Stiles is sleeping, it's like nothing's wrong, like he's just really tired from running around and being a pain in the ass.\nDerek listens to the sound of the TV and tries not to think about how he's letting Stiles down.\n\n***\n\nOn Thanksgiving morning, Derek has to be in the kitchen by seven to peel carrots. He runs into a bleary-eyed Jackson in the bathroom and drags him out by his collar to the door to the juvenile hall.\n\"Let me in,\" Derek says, pointing at the card swipe. It's too early in the morning for enough foot traffic to allow Derek to sneak through open doors to get to Stiles' room.\n\"Going to baste a young turkey?\" Jackson asks.\n\"Shut up, Jackson.\" Derek doesn't wait; he grabs Jackson's lanyard and yanks Jackson to the lock to sweep the card through. When the light turns green and the door clicks, he pushes through it and dashes down the hall, only vaguing hearing Jackson saying something about him being creepy.\nStiles' room is the third on the left, and Derek doesn't take a breath until he's there, squinting in the low light to verify that Stiles is alone. Derek doesn't want to wake him, except that he does. Today feels important. Scott and his mother will be visiting, and Derek knows it might be his last chance to do something—and below that, like a bruise, are the memories of sleepy Thanksgiving mornings when the house already smelled good by the time Derek padded into the kitchen to sneak a bite of pie crust.\nHe always loved Thanksgiving. It feels right to start it with a friend.\n\"Stiles,\" he says, sitting carefully on the edge of the bed so he isn't crowding him in the dark. He doesn't want to scare him.\nYawning, Stiles rolls over and rubs his eyes. He stares for a while, eyes black spots in the dark. Derek resigns himself to the fact that this is going to be like any other time.\nThen Stiles says, \"Dude. Is it the butt crack of dawn? What are you doing?\"\nDerek stares. \"It's Thanksgiving.\"\n\"Oh. Awesome.\" Stiles stretches slowly, smiling. \"My dad's coming today.\"\nThere's a long silence as Derek breathes through the ice-water shock of how wrong Stiles is. It's just dark enough that he can turn his face away until his expression steels. \"I can't wait to meet him,\" Derek says, not brave enough to tell Stiles the truth.\n\"Mom thinks he'll like you,\" Stiles says, curling onto his side like he's trying to go back to sleep.\n\"Did you... uh.\" Derek swallows, trying not to wonder why Stiles is talking to his ghost mom about Derek meeting his law enforcement professional dad. \"You've been talking to her?\"\n\"Dreaming, I think. I don't know.\" Stiles yawns again. \"Stop waking me up, man. I have a headache.\"\n\"Stiles.\"\n\"Oh my God, where do I hit snooze?\" Stiles flails a hand out to punch Derek's hip.\n\"Stiles,\" Derek says again. His voice goes thin, near its breaking point, and Stiles peers up at him in the darkness.\n\"Something's wrong, isn't it?\" Stiles asks. He starts to sit up, arms wobbling.\nDerek catches him and pushes him back down until he realizes he's... pushing Stiles into his bed, and that it's a huge invasion of very personal space and he's fucking everything up. \"I—\"\nStiles wiggles and thrashes, and Derek braces himself for a head butt, but what he gets is one of Stiles' arms around his neck and a tight-lipped, uncoordinated kiss on the lips. The kiss only lasts a moment, and then they're breathing quickly, lips bumping together. Stiles' mouth is warm and his breath smells like sleep and medicine.\n\"We shouldn't be doing this,\" Derek says.\nStiles lets go of him and sinks back against his pillow. \"Sorry. It's hard to see mixed signals in the dark.\"\nDerek laughs despite the sharp ache in his throat. It's good to hear Stiles' voice, sleepy but uncut. Why did he wait until now to try to find him in the early morning, when whatever they're giving him is starting to wear off?\nThere's something freeing about the darkness and the blanket of pre-dawn drowsiness. \"There are a lot of signals I want to give you,\" Derek says, allowing himself to acknowledge that the way he feels about Stiles is different than friendship. He doesn't have any other friends, but if he did, he doesn't think he'd want to kiss them. \"Just not right now.\"\n\"Really? Because that sounded like an instantaneous breakup with your crazy not-actually-boyfriend.\"\n\"Watch your language,\" Derek says. \"Acceptance begins with you, right?\"\nStiles huffs, and Derek can feel him rolling his eyes without being able to make it out.\nEven though he knows better, and doesn't know if Stiles will remember this at all, Derek leans down and kisses him again, just as briefly, but more tenderly now that it's not sneaking up on either of them. \"Accept this,\" he says.\n\"Oh my God, Derek. Save these lines for when I'm actually awake,\" Stiles says, laughing quietly. \"Snooze. Snooze.\"\n\"I'll see you soon,\" Derek says, resisting the urge to scruff at Stiles' short hair or something equally embarrassing. This isn't what he came here to do, but then again, he isn't sure why he came here at all.\nHe slips out of the room feeling dizzy, and a little scared, and a lot like there's no going back now.\n\n***\n\nPeeling carrots isn't as soothing or distracting as Derek hoped it would be. He spends two hours trying not to slice his fingers as he glances at the clock and counts the minutes until visitors start arriving.\nAllison is across the kitchen, pink-faced over a few pots of steaming soup stock for gravy. Their eyes meet, and Derek can feel the magnetism of the worry they share. It's strangely comforting.\nThe kitchen smells good, and people are laughing and talking loud. It sounds like a celebration, but Derek can't shake the sense of dread that makes his feet feel heavy. Just after 9am, he's done with his part of the chores, and goes to help Allison just to keep busy.\n\"When is Scott coming with his mom?\" he asks.\n\"Soon, I think,\" Allison says. \"She works later this afternoon, so they're coming for lunch. Have you seen Stiles?\"\n\"Yeah, this morning,\" Derek says, before he remembers exactly how that went.\n\"Before seven?\" Allison asks, wiping steam from her cheek. \"This morning?\"\n\"I was checking on him.\" Derek takes a spoon and stirs the stock so he doesn't have to look at her.\n\"Are you guys... is something going on? Because that's fine, but... he's not himself right now.\" Allison pries the spoon out of his hand.\n\"I don't know,\" Derek says. \"I mean—I didn't do anything. He kissed me.\"\nAllison's eyebrows arch delicately. \"No offense, Derek, but the way he's been acting on those meds, I'm pretty sure he'd kiss my grandfather.\"\n\"No, he was...\" Derek's glad the steam is hot. Hopefully it'll explain the way his face is burning. \"He seemed like himself, mostly. I'm going to try to go by in the morning again.\"\n\"To kiss him?\"\n\"No! Because his head was clearer. Maybe we can work out a plan, I don't know.\"\n\"Allison Argent?\" one of the counselors with a clipboard calls out. \"Scott and Melissa McCall are here, hon. Go ahead and get changed.\"\n\"I'm done in here,\" Derek says quickly. \"I'll meet you in the cafeteria.\"\n\n***\n\n\"Mrs. McCall,\" Derek says, shaking Scott's mom's hand firmly. There are orange and red balloons at each table, and brown garlands made of construction paper. Derek can make out the limp, asymmetrical one Stiles worked on all week.\nMelissa is pretty and bright-eyed, young for what Derek thinks when he thinks mom. \"You have a hell of a reputation, kid,\" she says.\n\"Mom,\" Scott says, pained.\n\"Allison says you're a nurse,\" Derek says. He's wearing a soft t-shirt and faded jeans, and Scott and Allison and Melissa are dressed up like they're going to church. He feels out of place socializing with someone's parent.\n\"For six long years,\" Melissa says, nodding.\nThe food isn't out yet, and the cafeteria is quiet and near-empty. It's the perfect moment to explain the situation, but Derek's throat feels tight. Where does he start? It sounds ridiculous when he tries to put it into words.\n\"Mrs. McCall,\" Allison says, holding Scott's hand. \"We wanted to talk to you about Stiles.\" Her voice wavers more than he's heard it waver before, like she's feeling the same way.\n\"We can talk about Stiles,\" Melissa says, \"but you know there's nothing I can do. I know it's hard to see your friend hurting, but that's the nature of what he's going through.\"\n\"But they're hurting him,\" Derek says, fighting to keep his voice down. She sounds so calm and sure of herself, but she hasn't seen anything. She doesn't know.\n\"Are you saying they're abusing a patient?\" Melissa asks. \"That's a very serious allegation, Mr. Hale.\"\n\"They're drugging him,\" Allison says.\n\"He's undergoing treatment for a psychological disorder, Allison. It's pretty standard to be medicated.\"\n\"No.\" Derek tries not to crowd her, but he doesn't want to speak too loudly. \"It's too much. It's not normal.\"\n\"According to your degree in medicine?\" Melissa asks.\n\"He was fine one day and then the next he was all different,\" Scott says, earning an eyeroll from his mother.\n\"Scott, you said you haven't seen him since he attacked Jackson Whittemore,\" she says.\nScott scowls. \"But Allison and Derek—\"\n\"Allison and Mr. Hale are looking out for their friend, but that doesn't mean they know what's best for him.\" Melissa says, playing with her bracelet like she's wringing her hands. \"Kids, it's Thanksgiving. Let's try to have a good day.\"\n\"Can we visit him at least?\" Allison asks. \"Please, Mrs. McCall. You're a nurse. Can't you just see him and see what you think?\"\n\"Visit who?\"\nDerek flinches back at the sound of Dr. Harris' voice. Harris is wearing a polo shirt and a warm smile that he directs at Scott's mom.\n\"Stiles Stilinski,\" Scott says. \"We were thinking maybe we could see him if he's not coming to lunch.\"\n\"I'm sorry—Doctor? This is Scott,\" Melissa says, briefly giving Scott a look that clearly communicates stop talking. \"He's dating Allison. The kids are just a little worried about their friend.\"\n\"Understandably,\" Harris says, shaking Scott's hand, and then Melissa's. He lingers, holding her hand in both of his as he says, \"Mr. Stilinski is a very troubled boy, but we all have faith that he'll pull through. I just had a wonderful conversation with his father this morning. He's lucky to have such a strong support system.\"\n\"See?\" Melissa says, extracting her hand from Harris' with a small frown. \"That's exactly what I told the kids.\"\nHarris lingers like a fungus, and a charged silence grows. Derek sees his own deep scowl mirrored on Scott and Allison's faces.\n\"We're going to go find seats before it gets too full,\" Melissa says, gesturing vaguely. Every seat is empty. She exchanges polite goodbyes with Harris as Derek's ears ring with futile rage.\nWhen Harris crosses the room to another small family, Melissa yanks Scott close. \"Okay. You guys have about five seconds to convince me that we should do something stupid.\"\nScott blinks. \"What?\"\nMelissa shakes her head. \"Stiles' dad isn't answering calls this morning. He's been taking depositions on that big highway wreck since six, and he won't be done for another hour. Even emergency calls are being routed through reception at the station. There's no way he spoke to anyone from the Center this morning.\"\n\"Wait. Are you guys dating?\" Scott asks, his voice hitting a squeaky tone that makes him sound like he's ten.\n\"Focus,\" Allison says, elbowing Scott.\nDerek figures it's now or never. \"Stiles told me that he learned something about Harris. Something incriminating. He thinks Harris is going after him for it.\"\nMelissa's teeth drag at her lower lip. \"You have to realize that that sounds very unlikely. Stiles is experiencing severe hallucinations.\"\n\"I believe him,\" Allison says, her voice soft but steely. \"I don't think he's seeing things.\"\n\"Honey...\" Melissa rubs her forehead. \"Okay. That's not up for debate right now. Let's go see him before lunch, and I'll talk to Stiles' dad about it when I get home. How does that sound?\"\nA few minutes of hushed discussion lead to a plan that involves carefully timed trips to the guest bathroom and meeting up at the rec room, where if they're lucky, Stiles will be hanging out on his favorite couch.\nThe plan goes by without a hitch, but there's no one in the rec room at all.\n\"I could lose my license for this,\" Melissa says, sighing. \"Let's get a move on. Where to next?\"\n\"His room,\" Derek says. \"He was in there this morning.\" He ignores Scott's thoughtful frown and Melissa's curious squint.\n\"How do you two know each other?\" Melissa asks, as they hustle down the hall, ducking through doors in a group as Allison gives each passerby a bubbly, smiling explanation that they're taking mom on a fun tour of the facility.\n\"He talked to me,\" Derek says. It sounds pathetic, but when it comes down to it, that's the difference between Stiles and everyone else he's encountered since the fire. The only people who ever wanted to talk to him were people who had to for their jobs. \"We hung out.\"\n\"He's a talkative kid,\" Melissa says, giving Derek's hand a brief squeeze. \"I'm glad he has a friend here.\"\nWhen they reach Stiles' room, Derek's heart starts racing. He knows Stiles' friends will be able to see that Stiles isn't being helped at all, that Harris is pulling the spark out of him. They'll tell the sheriff the truth and everything will be okay.\n\"Dude,\" Scott says. \"Where is he?\"\n\n***\n\nAllison limps into the infirmary, complaining of bad cramps. It takes her three minutes to determine that Stiles isn't in there. She returns a hot water bottle and a frown. \"Do you think he went outside?\"\n\"If he was feeling well enough to wander outside, he would have come to the cafeteria,\" Derek says, remembering something that makes his stomach bottom out. \"He thought his dad was coming today. He told me he was.\"\n\"Did you tell him he wasn't?\" Allison asks.\n\"No,\" Derek says, swallowing against a wave of panic. \"He looked really happy about it. I couldn't.\"\n\"It's fine, hon. I don't think I would have either,\" Melissa says.\nThey're standing in the hall by the infirmary, getting strange looks from the counselor at the monitoring station, and they're running out of time.\n\"We should split up,\" Scott says. \"I'll take Allison and check the fields.\"\n\"He likes the running trail,\" Derek says. \"We can try out there.\"\n\"If we don't find him soon, we need to tell the staff,\" Melissa says. \"Whether Harris is mistreating him or not, there are plenty of people here who know how to care for him and need to know where he is. If he's lost and disoriented, he could hurt himself.\"\nHurt himself. \"Wait,\" Derek says. He leans against the wall, rubbing his face. \"Stiles said that Harris killed a girl, that he—\"\n\"Killed?\" Scott asks. \"And you didn't think that part was important?\"\n\"Everything already sounded crazy enough!\" Derek says. \"And Stiles said Harris had it out for him all along.\"\n\"He thinks his teachers have it out for him too,\" Allison says. \"But that's not the same as killing someone. Are you sure he said that?\"\n\"He said a girl died in Harris' office.\" Derek rubs his forehead, trying to remember exactly what Stiles said. \"That Harris made it look like a suicide.\"\n\"The Center had a suicide about five years ago,\" Melissa says. \"Ellen Mathis. I work with her father.\"\n\"That's... that's what he said her name was,\" Derek says. \"Ellen.\"\n\"Okay.\" Melissa raises her palms. \"We need to find him. And we'll go from there. Allison? Go to the station over there, bring Scott. Tell them Stiles threatened to hurt himself. They'll have emergency protocol. It'll get things moving.\"\n\"What are you doing?\" Scott asks.\n\"Derek and I will start checking bathrooms and closets. Go,\" Melissa says. She takes Derek's hand and they set off at a run. Her fingers are icy cold.\n\n***\n\nA chime sounds every few seconds, not as loud or panic-inducing as a fire alarm, but just as jarring. The bathrooms in Stiles' hall are clear, and the janitor's closet is clear. Dozens of counselors are looking for Stiles now too, and Derek follows Melissa numbly as she talks to everyone she encounters like she owns the place. He's never met a mom who acts like Melissa does. Scott's a lucky kid.\n\"Did someone get a hold of his father?\" Melissa asks a counselor in scrubs. \"They confiscated my phone when I came in.\"\n\"We're running it through Dr. Harris,\" the man says. \"There are operating procedures, ma'am.\"\n\"Operate faster,\" Melissa snaps, before she jogs down the hall, dragging Derek along and asking him where they should look next.\nDerek stops in his tracks when a wave of hot air hits him, like the blast from an open oven door. \"What was that?\"\n\"What was what?\"\n\"That heat. Didn't you feel it?\" Derek asks. He sniffs reflexively, expecting to smell burning, but the hall smells like floor polish and disinfectant, like always.\n\"I didn't feel anything. It's freezing in here,\" Melissa says.\n\"No, I felt something hot,\" Derek says, reaching to feel for a draft. His hands pass through warm air again and he recoils, startled. The air almost felt thick, like hot mist. His initial fear, that bone-deep revulsion toward fire, passes. This warmth is something good, in a way he can't pinpoint.\nHe tries to step toward it, and shuffles around until his fingers brush against it again. \"Getting warmer,\" he says.\"Getting colder,\" Laura said, giggling as he stumbled around the house blindfolded, trying to find the Pokemon she'd hidden.\n\"Derek, what are you doing?\" Melissa asks. \"We need to keep moving.\"\n\"Wait,\" Derek says, hoarse. \"It's. She's... I'm getting warmer.\"\n\"We don't have time for this.\"\n\"Trust me. Please.\"\nMelissa bites her nails.\nDerek walks with both hands out, following the warmth that becomes hotter and hotter with each step. It's like Laura's at the edge of his vision, urging him on.\n\"We're almost there,\" Derek says.\n\n***\n\nThey find Stiles in the utility room two halls down from his own.\n\"Get help!\" Melissa screams. \"Go, Derek! Tell them to call 911.\"\nDerek stares, only for a second, for a few heartbeats. For an agonizing moment. Then he's dashing away, sprinting down the hall and screaming for the counselors, for anyone, for help, help.\nAll he can see is Stiles convulsing on the floor, mouth wet with spittle, eyes rolled back.\nThe next minutes pass like they're lit by strobe lights. Allison is there. And Scott. The utility room door is open, and they can hear Melissa in there shouting orders and counting like she's doing CPR. Derek sits on the floor with his back against the wall, and doesn't know when his legs gave out. The counselors won't let them close, not close enough to see or know if Stiles is breathing. If he's still alive.\nDerek wants to scoop up the prescription bottles that littered the floor around Stiles. He doesn't want anyone to see.\nParamedics swarm the hall, their shoes heavy and loud against the floor. They have radios and urgent voices, and the chime is still sounding again and again, like a countdown clock.\n\"Scott,\" Melissa says, as she hurries over, pale and trembling. She pushes her keys into Scott's hand. \"I'm going to ride with him. Meet me at the hospital, okay?\"\n\"Is he?\" Allison's voice hitches as the gurney passes, surrounded by so many EMTs it's impossible to make out Stiles as it crowds past.\n\"He's alive,\" Melissa says. \"I've got to to go. Derek—whatever you did. Whatever... that was. You saved his life.\"\nScott sinks to the floor beside Derek, and Allison follows him. They sit together silently as the chime eventually stops ringing out and the sound of sirens fades away outside.\n\"I've known Stiles since we were eight,\" Scott mutters. \"He wouldn't have done that. Ever.\"\n\"It doesn't matter. They'll never believe us now,\" Allison says.\n\"No,\" Scott says. \"He wouldn't give up. We can't give up either.\"\nAllison looks up, her bloodshot eyes narrowing. \"The cameras.\"\nDerek follows her gaze. It takes him a moment to understand what she's saying. His mind is on an endless loop of wondering if the warmth was really Laura, and replaying the way Stiles looked on the concrete floor, dying.\n\"The security tapes,\" he says.\n\"Stiles' dad will be at the hospital,\" Scott says, scrambling to stand. \"He's a cop. They'll have to let him see!\"\n\"I'm coming with you,\" Derek says. It's not that he doesn't trust Scott; this is something he has to see through. He has to see it made right.\n\"Um. I don't think they're going to let you visit Stiles, even if you guys are boyfriends or whatever,\" Allison says.\nScott blinks. \"First my mom and now you guys? Damn.\"\n\"We're not dating,\" Derek grits out. \"Just drive me to the hospital. If we get caught, I'll tell them I forced you.\"\nScott's gaze is hard as he gives Derek a hand up. \"I don't care if we get caught.\"\n\n***\n\nIt turns out Thanksgiving is a good day to escape the Beacon Hills Young Adult Rehabilitation Center. In the midst of the hysteria over arriving guests and paramedics and the rapid-fire gossip of a supposed suicide attempt, Derek and Scott slip out. It doesn't sink in that they pulled it off until they're in Scott's mom's car and Derek realizes it's been years since he's been in a car that wasn't a transport vehicle.\n\"Put your seatbelt on,\" Scott says.\nScott drives like a sixteen-year-old who thinks he's in an action movie. Derek hangs onto the oh-shit handle and mutters about red lights under his breath, but can't bring himself to tell Scott to slow down. He's twisted tight with adrenaline and worry, and the hot little ember of hope that maybe they'll get to Sheriff Stilinski.\nThey park in the employee lot and jog up to the hospital.\n\"Dude, your nametag thing,\" Scott says.\nDerek pulls his lanyard off and shoves his ID card into his jeans pocket. They walk through the automatic doors into the hospital lobby, where the decorations are just as tacky and autumnal as they were at the Center.\n\"Scott?\" the receptionist asks. \"Honey. Your mom said you'd be coming. It's going to be a while before your friend can see anyone, so why don't you two boys have a seat.\"\nDerek's fingers curl into fists. It could be minutes before someone figures out where he went. He doesn't have time to wait.\n\"Okay,\" Scott says, grabbing Derek's wrist and pulling him into an alcove of plastic chairs and weird computer games attached to the walls. There are tiny tables with sand and plastic toys everywhere, and Derek feels like he's in a bad dream. \"Calm down, man. You look like you're about to Hulk out.\"\n\"Calm down? Do you understand that I am going to go back to prison for this?\" Derek asks, jerking his hand out of Scott's grip. He's angry, and hates the way it feels, like if he just hits or breaks something it'll release some of the pain.\nBehind them, the doors whoosh open, and when Derek turns he sees flaring blue and red lights and thinks this has to be some sort of record for apprehending an escapee from a minimum security rehab facility. Then a uniformed man stalks in at a controlled pace just under a run, and he's harder and older now, but Derek recognizes him anyway. It's Stiles' dad.\n\"Are they here yet?\" Stilinski asks the receptionist, who's already reaching over the counter to buzz him through the locked double doors that lead to the emergency wing. He glances aside at the last minute. \"Scott?\" A haggard frown. \"Derek Hale?\"\nThe double doors hang open.\n\"Sir, uh,\" Scott says. He holds his keys out. \"Mom said to meet her here.\"\nStilinski points at Derek. Even visibly wrecked with worry, he's naturally intimidating the way Derek remembers his own father being. Old guy power, his sister had always called it.\n\"You. Stay right there.\"\nThen he's gone, and the lobby is quiet.\nThey wait.\n\n***\n\nIt takes exactly twenty-three minutes for the shit to the hit the fan.\nMelissa and Stilinski walk back through the double doors at the same time, engrossed in a hushed conversation just as Harris and three big counselors walk through the glass doors from the parking lot. Everyone stops, like it's a showdown in a Western, and Scott mutters, \"Shit,\" where he's sitting beside Derek on the hard plastic chairs.\n\"There!\" Harris shouts, pointing at Derek. \"It's Hale. Restrain him!\"\nIt's ridiculous, really. Harris is one of the doctors at the Center, not the director. The fact that he's here coming after Derek on his own is utterly transparent, but in the chaos erupting around him, Derek has no idea how to explain that, or who will believe him.\nHe stands and holds his hands out, trying to look passive so none of the counselor goons will get taser-happy.\n\"Fuck, shit,\" Scott is saying, pressing close to Derek like they're about to fend off an army together.\nDerek looks right at Harris, watching his jittery, furious approach. He's so busy trying to maintain a defiant expression that he doesn't see Stilinski come at him until Stilinski has a tight fist in his t-shirt.\n\"This situation is under control,\" Stilinski says. He has one hand on his holster and Derek doesn't know if he should be relieved or seriously concerned for his safety.\nThe counselors and Harris stop short as Melissa takes Scott by the sleeve and pulls him over to the reception desk. \"We have the means to transport Derek Hale back to our facility,\" Harris says, pushing his glasses up with one finger. \"We can take it from here.\"\n\"I'm not sure you understood me.\" Stilinski's grip is like iron, stretching Derek's shirt. \"The situation is under control now. I'll take this boy's statement and drop him back at the Center this evening.\"\n\"Drop him back?\" Harris gives a brittle laugh. \"With all due respect, Sheriff, Mr. Hale needs to be released to my custody immediately. He's a threat to others. We have reason to believe he may have compromised your son's—\"\n\"That's a load of shit!\" Scott shouts. \"Harris is a douchebag.\"\nMelissa cringes. \"I'm going to have to go with Scott. Actually, on both counts. If Derek hadn't found Stiles, I'm not sure...\"\n\"And how exactly did Mr. Hale know where to find him?\" Harris asks.\nDerek keeps very still. \"Because I know the truth,\" he says, watching Harris fail to hide a flinch around his eyes.\n\"Enough of this,\" Stilinski says, his voice gravelly. \"Listen, Doctor, I appreciate your help, but I've got police procedure to follow here. I assure you Mr. Hale won't be presenting a threat to anyone while he's in my custody.\"\nMelissa steps between the sheriff and Harris. \"Stiles is in his father's care while he's here,\" she says. \"So it would be best for the hospital staff if we ended this commotion and got back to work.\"\n\"What she means is leave,\" Scott says.\n\"Scott,\" Melissa warns, shooting him a look. She turns back at Harris. \"But yes, that's what I mean.\"\n\"I'm disappointed in this turn of events,\" Harris says. \"Mr. Hale, I'm sure you understand the consequences of your actions. I'll be in contact with your parole committee immediately.\"\n\"They're probably not at work today,\" Derek says, pointing at a plastic gourd hanging from the ceiling. \"It's Thanksgiving.\"\n\n***\n\nSheriff Stilinski handcuffs Derek to a rail in the hallway outside of Stiles' room. \"Sorry to do this, son, but I can't be in two places at once.\"\nScott, looking like a puppy with his tail between his legs every time Stilinski glances at him, stays out in the hall with Derek. They observe the quiet bustle of an emergency room corridor. It isn't nearly as hectic as Derek expected it to be. Most people seem to be waiting for something to happen.\nDerek strains to hear the quiet conversations from inside Stiles' room. Nothing sounds too urgent, but it doesn't sound easy either. Every voice has an edge to it.\n\"What if he's in a coma or something?\" Scott asks. He fidgets with a cleaning cart that's parked in the hall next to Derek, knocking over spray bottles.\n\"It's only been a few hours,\" Derek says. \"I don't think they'd even know that yet.\" He doesn't tell Scott that his uncle was in a coma for two years, and that he woke up out of his mind with cold, careful rage.\nIt takes all of Derek's control not to rattle the cuffs, to strain and strain. He's so close he thinks he might be able to hear Stiles breathing if he tries hard enough, but he can't see a damn thing and no one's telling them anything and it's torture. He feels each breath keenly, is uncomfortably aware of his heartbeat.\nMelissa returns in scrubs and brings them sandwiches before her shift starts. \"I can text you if we know anything,\" she tells Scott. \"It's all right if you want to go back and see Allison.\"\n\"No,\" Scott says. \"I need to stay here.\"\n\"I understand,\" she says, kissing him on the cheek. She pauses, hanging onto him like she really needs to, and gives Derek a long look. \"How are you holding up?\"\n\"I'm all right, ma'am. Thank you,\" Derek says.\nMelissa's lips quirk in a small smile. \"I don't think I'm ready for ma'am just yet, but I'm glad to hear that. We'll sort this out, and he'll be okay.\"\nShe sounds so certain, and Scott looks so comforted by her presence, that Derek tries to believe. After what he's seen today, it isn't impossible.\n\n***\n\nStilinski emerges a few hours later, looking exhausted but calm. \"Why don't you go sit with him while he sleeps, Scott,\" he says.\nScott flails toward the door cartoonishly and calms himself at the last moment. When he slips through the door hesitantly, Stilinski clears his throat and pulls up a chair beside Derek.\n\"I've spoken to Nurse McCall about the allegations you've raised about Doctor Harris and the Center.\"\nDerek takes a deep breath. \"Sir, I don't know much. Everything I've seen at the Center—it's a good facility. Better than anywhere else I've been. It's only Harris. Stiles said...\"\n\"You understand that my son is suffering from a serious illness,\" Stilinski says, as if it pains him speak each word. He scrubs his hand at his face. \"What he says isn't... it can't be the truth. It might be to him, but it can't be.\"\n\"He talks to his mom,\" Derek says, looking away.\n\"I don't think you—\"\n\"I thought he was nuts, sir, to be honest,\" Derek says. \"But the things he knew about me. I think you need to have faith in him.\"\n\"I'm trusting Nurse McCall's opinion of you, but that doesn't mean you have room to push it,\" Stilinski says. He draws a small notepad from his pocket. \"I need you to tell me everything you know. The things that concerned you. What might have led up to... today's events.\"\n\"That's the thing, Sheriff,\" Derek says. \"I came here to try to tell you to look at the surveillance tapes. They have cameras all over the place. I don't know who has access to them, but you could find out, right?\"\nStilinski lunges for Derek abruptly, and Derek freezes, knowing he can't fight back against a cop. He closes his eyes, hoping he can restrain himself from throwing him off.\nThe cuff at his wrist unlocks with a slippery sound.\n\"Sheriff?\" Derek asks hoarsely.\n\"It's been a few hours,\" Stilinski says. He takes Derek by the shirt again, in a way that makes Derek think he's yanked Stiles around like this too, as if holding him by his scruff. \"If there's something incriminating on those tapes, they could be erasing them right now. Let's go.\"\n\"But—\" Derek looks at the door to Stiles' room.\n\"This won't take long. Nurse McCall will contact me if I'm needed in the next hour.\"\nDerek digs his heels in without meaning to. He's so close, right there, and Sheriff is going to drag him away now, for a good reason, and he should be hurrying—running even—but Stiles is right there. Derek isn't going to see him again. Maybe not for years. Maybe not—maybe not for a really long time.\n\"What is it?\" Stilinski asks, a low warning in his voice, as if he expects Derek to try to make a run for it.\nThere's no easy way to tell a concerned father that you want to see his unconscious son one more time because you're probably going to prison. \"I...\" Derek realizes it was just this morning that they kissed—that Stiles kissed him. It seems like days ago now. It feels like he imagined it. \"I just wanted to see him,\" Derek says, not ashamed that he wants to see Stiles so much, but that he knows they should be dashing away. He's being weak and stupid.\n\"Are you in a relationship with my son?\" Stilinski asks, right there in the damn hallway.\n\"Not yet,\" Derek says. \"Sir.\"\nStilinski stares at him for a breath, before he makes a strangled sound, like a laugh that turned into indigestion. \"Go. You have sixty seconds and I have a stopwatch.\"\nThe next minute passes like the last wisp of a dream in the morning. Derek's never been in a hospital room with so many gadgets and tubes and machines. Scott looks up at him, a little green, like it's freaking him out too that there's a tube slinking into Stiles' mouth and tape and wires and stickers all over him.\n\"I'm going back now,\" Derek mumbles. He doesn't even have enough time to try to squeeze past Scott to Stiles' side, and part of him is grateful. He's scared. Stiles looks fragile and very sick. \"Everything's...\" He places his hand on the outline of Stiles' foot under the thin blue blanket that covers him from the waist down. \"It'll be okay. You're going to be okay now.\"\nHe doesn't cry until he's in the back of Stilinski's cruiser.\n\n***\n\nWhen they get back to the Center, Stilinski handcuffs Derek again. \"This isn't for show. Desperation does funny things to you. Just try to keep your cool for now, and let's figure this out.\"\nHarris meets them at the front doors, and Stilinski walks right past him like he can't hear the angry, frantic stream of complaints running from Harris' mouth. \"I need to speak to Director Deaton,\" he says. \"It's urgent.\"\nWhile Harris buzzes around the room like a hornet, talking about how unacceptable everything is, Stilinski has a quiet conversation with Deaton. Mid-sentence, Deaton gestures for Harris, his eyes gone glittery. Derek's never met the director before, but he immediately trusts him more than he trusts Harris; there's something calmly resolute in his expression.\nDerek can't really listen to them. He's idly straining against his cuffs and ignoring the people watching them from the edges of the room. The smells of pumpkin pie and roasted meat override the too-sweet smell that usually lingers all over the Center. There's a football game playing on the TV in the corner of the reception room.\nStiles is asleep, with a machine breathing for him. Stiles looked awful. He almost died. If they hadn't found him, if Laura hadn't—\n\"Mr. Hale. Derek,\" Stilinski is saying, repeating himself until Derek can hear him over the sick ringing in his ears. \"I want you to stay with me. Come on.\"\n\n***\n\nNo one was ever reviewing the security feeds, because Harris had tampered with the schedule and assigned a fake employee ID to the position. Each camera has a five-day recording memory. It's enough.\nDerek throws up in a wastebasket ten minutes into the first tape.\nSomeone turns the monitor off as he retches. What they've seen is already enough to know that Doctor Harris pushed Stiles to the dark place that left him curled up on a cold floor, alone. Dying alone.\nDeaton drapes a damp towel over the back of Derek's neck as Sheriff throws Harris around a lot harder than he needs to, cuffing him with the same cuffs he wrenched off of Derek's wrists a few minutes before. For a few seconds, Derek thinks he'll kill Harris. He doesn't want him to. Stiles is going to need his dad when he wakes up.\nStilinski freezes, making hurt, horrible sounds with each breath. He's got his gun in his hand, and Harris is flinching away and wheezing.\nIt's Deaton who puts his hand over Stilinski's.\nThe office is too small and stuffy, and it smells like puke and fear, and Derek can still hear Stiles on the tape—the distorted sound of his hiccuping sobs as Harris told him his father was never coming back for him, that he'd signed custody over to the state.\n\"That won't make this right,\" Deaton says.\nStilinski pushes his gun back into his holster and clips it down, giving it a pat like he wants to make sure it stays there. For a long time.\nA chill runs through Derek, as weighted and alive as Laura's heat was when she showed him the way to Stiles. This time, there's nothing familiar about it, but it's still recognizable. It's a bone-deep, vengeful chill, and Derek can see the moment it strikes Harris.\nStiles' mom is pretty great.\nStilinski gets on his radio and rattles off a few codes and jargon that Derek doesn't understand while Harris sits against the edge of a desk, his fingers curled into fists and his eyes blank with terror. It's satisfying, but awful too, because Derek's done with fear and horror. He's done.\n\"Derek,\" Stilinski says. \"You did good. You and Scott and the Argent girl.\" He starts to speak again and shakes his head and pulls Derek up into a strong, wiry bear hug. Derek goes rigid. He pats at Stilinski's back until he's released.\nThat night, a few of the counselors let Allison and Derek stay out in the rec room together and bring them plates of leftovers. They eat at the coffee table, having gravitated to Stiles' spot on the couch. Derek knows it won't be Stiles' spot anymore; Stilinski will never send him back here. And Stiles hated the rec room anyway. What Harris did to him, what he made him, wasn't Stiles at all.\n\"He wasn't awake yet,\" Derek says, pushing cranberry sauce around his plate. He wants to say more—that he wishes he could have said goodbye, or hello, or that he misses Stiles voice and wants him back, and doesn't want to be here alone now the he knows what it's like to be with someone. To care about what they're thinking and wonder what they're doing. To feel weird flutters of happiness when they're around, even when they're doing stupid things.\nAllison nudges his knee with her own and steals the last of his turkey. She doesn't say anything, but Derek thinks she must understand.\n\"You're not like her at all,\" Derek says. It's as close to an apology as he can manage without telling Allison that he's sorry he saw Kate's dimples on her face.\n\"That's what my dad says,\" Allison says with a tight smile.\n\"See you on the field,\" Derek says, when it's curfew and a few sleepy-eyed counselors are there, waiting to escort Allison back to the girls' facility. They hug briefly, Derek trying not to smush up against Allison's boobs too hard and Allison ducking for a kiss on the cheek and pulling back at the last minute.\n\"Awkward,\" Allison says.\nMaybe they'll be friends, too.[ Epilogue ]\nStiles sleeps for a week. The day after he wakes up, he raises hell until someone gets him on the phone with Derek.\nWhich is weird and wonderful. Derek draws circles on the receptionist's desk with his fingertip as he listens to Stiles talking in a hushed, wrecked voice.\n\"Scott says you busted out like, full on prison break.\"\n\"We were in his mom's car,\" Derek says, trying not to worry him. \"It wasn't too fast or furious.\"\nThey discuss the relative grossness of hospital food compared to rehab food. Derek asks how Stiles' Jeep is doing and Stiles says he isn't even allowed to drive a wheelchair yet, dipshit. Stiles asks if Derek's been running by himself and Derek says no, it's surprisingly boring when he's not being harassed every step of the way.\n\"I'm sorry you're in trouble because of me,\" Stiles says, as one of his hoarse chuckles dies down.\n\"Director Deaton is handling it,\" Derek says. \"I'm still out in eight months if I don't escape again. I'm also supposed to stop sneaking into the juvenile halls. Apparently it looks bad.\"\n\"Appalling,\" Stiles says, between suspicious-sounding sniffles.\n\"It's your dad I'm in the most trouble with,\" Derek says.\n\"Really? He said you were... I think um, respectable. Or 'actually pretty upstanding.' I forget.\"\n\"Good, because I may have told him I wanted to date you. I forget.\"\n\"Oh shit,\" Stiles says. \"Yeah, you're screwed.\"\nA nurse takes the phone away from Stiles and tells Derek that he's supposed to be resting, not giggling.\n\n***\n\nJust after New Year's, Stiles comes to the Center on field day. He's wearing a hoodie and jeans that don't fit him right, and his hair is getting longer. He looks healthy and normal, like any other high school kid, and Derek stares at him, wondering if they're still—if things are still the same.\nDerek's never been so nervous. It makes his hands feel sweaty, so he keeps them shoved in the pockets of his jacket. \"Hey.\"\nStiles gets close, shifting around on his feet like a boxer, his cheeks flushed with two mismatched splotches that Derek can't stop staring at. \"It's cold as balls out here.\"\n\"Balls aren't,\" Derek starts to say. Until his tongue jams against the roof of his mouth because no, he's not going to have a conversation about balls right now. With Stiles. \"Yeah, it's pretty cold.\"\n\"I bet your artful stubble keeps your face warm though,\" Stiles says, waving a finger around like he's tracing the shape of Derek's jawline in the air.\n\"You're back at school?\" Derek asks, watching Stiles' mouth.\n\"Yeah. I have to do summer school for a couple of classes, but I pretty much kept up while I was here. Oh, and Jackson's back,\" Stiles says. \"I guess you knew that. He's actually acting like a real boy lately. Most of the time.\"\n\"You're a junior?\" Derek asks. He was never a junior. He finished school online in Juvenile Detention.\n\"Yeah. Me and Scott are going to try for first line next year.\"\nA bitter winter wind ripples the grass that's getting too long. \"Are you... how are you?\" Derek asks.\n\"You mean the ghosts?\" Stiles asks.\nDerek stares and tries to settle his expression, but it's pretty much a lost cause. \"Yeah.\"\n\"Do you really want to know?\" Stiles gives him a steady, clear look. A challenge.\n\"I do,\" Derek says.\n\"They're around,\" Stiles says. \"Sometimes. Mom doesn't come by much. I think she wants me to have a normal life and not a spectral parent thing going on. Dad still thinks it's all in my head, but I'm being really careful, you know? Normal. Being normal. He's dealing.\"\n\"Does she...\" Derek clears her throat. \"Kate. Is she giving you trouble?\"\n\"No. Oh! That, yeah. Dude, so...\" Stiles comes closer, lowering his voice. \"Don't freak out, but your sister is hot. She's also fierce. Like... fierce. She chased Kate off.\"\n\"She found you,\" Derek says, rushing the words out. He doesn't understand how Stiles can just talk about what he sees, because he hasn't told anyone about Laura. Not even Allison. \"When you were...\"\n\"I don't remember,\" Stiles says, toneless. His tongue pushes against the inside of his cheek and his eyes get distant, and just as Derek starts to think he fucked this up already, Stiles' expression brightens again and he pushes Derek's shoulder. \"So yeah, that's all settled. I think they were both just following you around like, drawn to the magnetic pull of your angst.\"\n\"My what? Shut up,\" Derek says, hoping Stiles will touch him again.\n\"I don't want to tarnish your behavior record,\" Stiles says. \"So know that I am graphically imagining kissing you right now. There are fences and oral involved, actually.\"\nDerek's glad he put antiperspirant on. Twice. \"Yeah, that's. Probably against the rules.\"\nTheir eyes meet. Derek swallows.\nThen Scott tackles Stiles with a hug and a whooping laugh, and Allison follows, giggling. They stay outside all afternoon, warmer in a group.\n\n***\n\nThe next six months push the limits of how much innuendo can be achieved during recorded, supervised weekly phone calls.\n\n***\n\nOn his release day, Derek asks the receptionist if he can use the phone to call a cab. The middle-aged woman behind the desk rolls her eyes. \"Son, that boy's been waiting outside for you since seven am.\"\nStiles stands next to the Jeep like a cowboy, arms crossed and the whole image spoiled by the biggest grin Derek's ever seen on a human being.\n\"You wanted to learn to drive a stick?\" Stiles asks.\n\"That sounds dirty,\" Derek says.\n\"God, I hope so. It's kind of what I was going—\"\nDerek silences him with a kiss, cradling Stiles' face in both hands. Nobody sounds a whistle, though it definitely starts to get pornographic. They have to stand there breathing, mouth to mouth, for nearly five minutes before either of them can dislodge and get into the car.\nStiles shoves his fingers into Derek's back pockets, starting the whole cycle of public cuddling over again. \"Sorry,\" he says, grinning. \"Not really. Hi. I missed you. Can we drive somewhere and make out? I would like to do that. A lot.\"\n\"Stiles,\" Derek says, shivering with so much joy it would scare him, if Stiles wasn't there anchoring him.\n\"Is that a yes?\" Stiles asks, wiggling his fingers unfairly.\n\"Yes,\" Derek says. \"Yes.\""
}