{
    "id": "5516603",
    "url": "https://archiveofourown.org/works/5516603?view_full_work=true",
    "author": [
        "thecommodore_squid (orphan_account)"
    ],
    "title": "Thirty-Eight Days and Counting",
    "rating": "Mature",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "F/M",
        "M/M"
    ],
    "fandoms": [
        "Captain America (Movies)",
        "Marvel Cinematic Universe"
    ],
    "relationships": [
        "James \"Bucky\" Barnes/Steve Rogers",
        "Clint Barton/Natasha Romanov"
    ],
    "characters": [
        "James \"Bucky\" Barnes",
        "Steve Rogers",
        "Natasha Romanov",
        "Clint Barton",
        "Sam Wilson (Marvel)",
        "Tony Stark",
        "Kate Bishop",
        "Bruce Banner",
        "Brock Rumlow",
        "Alexander Pierce",
        "Riley (Captain America movies)",
        "Nick Fury",
        "Rebecca Barnes",
        "Malcolm Ducasse",
        "Peggy Carter",
        "Angie Martinelli",
        "Other Cameos"
    ],
    "additional_tags": [
        "Alternate Universe",
        "Witness Protection",
        "Post-Traumatic Stress Disorder - PTSD",
        "Fake/Pretend Relationship",
        "Fake Marriage",
        "Mutual Pining",
        "Star Wars as a Plot Device",
        "Bucky has issues",
        "Steve Has Issues",
        "Everyone Has Issues",
        "Bucky/Bagels is the Real OTP",
        "bed sharing",
        "Cuddling",
        "Steve and Bucky Play Fake Relationship Chicken",
        "But They're Both Stubborn and Competative",
        "Drugs",
        "Withdrawal",
        "Torture",
        "Memory Issues",
        "Suburbia",
        "criminal organization",
        "Invasive Neighbors Squad",
        "Overprotective Characters",
        "Angst",
        "Fluff",
        "Happy Ending"
    ],
    "language": "English",
    "series": "",
    "published": "2015-12-24",
    "completed": null,
    "words": "40,292",
    "chapters": "1/1",
    "comments": "774",
    "kudos": "12,014",
    "bookmarks": "3,722",
    "hits": "167,574",
    "summary": "<p>It didn’t escape him that Steve shared his assumed last name. “Are you gonna be my cousin?” Bucky asked dully.</p>\n<p>Steve frowned. “Husband, actually,” he said easily, holding up his left hand to show a typical golden band.</p>\n<p>Bucky scowled and closed the door.</p>\n<p>AKA<br>An AU in which Bucky is put in the witness protection program and Steve is the agent hired to protect him/pretend to be his husband.</p>",
    "notes": "<p>This fic is dedicated to The Force Awakens because holy shit, yes- a truly A+ movie.</p>\n<p>Also. Star Wars references. (None to the new movie, though. I'm not THAT fast of a writer. So no worries about spoilers or anything.)</p>\n<p>So, I know I've already written a fake relationship AU, but I swear this one is totally different. The idea just really spoke to me, and I couldn't resist.</p>\n<p>All mistakes are my own. Comments and kudos always make my day better.</p>\n<p>I hope you guys enjoy reading this as much as I enjoyed writing it.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>\n<a href=\"https://www.tumblr.com/blog/thecommodoresquid\" rel=\"nofollow\">I'm on tumblr.</a>\n</p>",
    "text": "\n“Why don’t you start at the beginning?”\n\n\n \n\n\nJames didn’t respond, staring down at his shaking hands. Blood had congealed and dried along the creases of his palms, more blood becoming especially apparent beneath the torn sleeve of his left arm.\n\n\n \n\n“Detective Barnes,” the man prompted gently, but James couldn’t bring himself to look up, hypnotized by the rusty-red decorating his skin. “Detective Barnes.”\n \nBucky startled awake, heart hammering.\n \nHis hands were trembling as he fumbled to turn on the light. Dimly, he recalled the techniques he’d been taught in therapy, mumbling, “Thirty-seven days,” his eyes flicked to the digital clock, “Nineteen hours, twenty-six minutes.”\n \nHis hands continued to shake. His lips trembled. “Thirty-seven days, nineteen hours, twenty-six minutes,” he repeated, voice shaking softly. “Thirty-seven...”\n \nHe repeated the numbers to himself until the shaking subsided, forcing himself to relax into the mattress. Bucky glanced at the clock and smiled humorlessly. “Thirty-seven days, nineteen hours, forty-eight minutes.”\n \nSomething about numbers was supposed to ground him. Keeping track of time acutely did ground him. The numbers too. Bucky had always been a numbers guy- thinking that way made sense to him in a way that not much else did. Especially now.\n \nBucky felt that constricting feeling rising up in his throat again, but he shoved it away, angrily muttering, “Thirty-seven days, nineteen hours, forty-nine minutes.”\n \nHe didn’t manage to go back to sleep. Instead, he turned the TV on and pretended to watch a show about weird houses.\n \nHe only got out of bed to start the day when the clock changed so that it had been exactly thirty-eight days.\n \nIt was thirty-eight days and counting.\n \n \nBucky stared at the post-it note on the refrigerator that had been there for eight days, six hours, and eleven minutes.\n \n\nWill be sending company. (X) Fury\n\n \nCompany had not been sent to the small suburban house, and the note hung over Bucky’s head like a bad omen. First of all, Bucky didn’t need company. He was perfectly capable of defending himself. Secondly, Fury could suck his dick.\n \n(Although Bucky was fairly certain the scary FBI agent wasn’t into that sort of thing.)\n \nBucky glanced at the mail stacked neatly on the counter, some envelopes addressed to Buchanan Rogers. Bucky had gotten to pick his first name, figuring that no one had called him “Bucky” since he told his sister that it was a baby’s name and embarrassed her into calling him James instead. Bucky figured it was safe to use it here. It was something he’d respond to and wouldn’t lead anyone to suspicions regarding his actual identity.\n \nEven if it was kind of a weird nickname, Bucky liked it.\n \nDuring the eight days (six hours, fifteen- shut up) that he’d been in the house, he’d fallen into a rhythm. He’d pretend to sleep, pretend to watch TV, eat mechanically at the correct times, rinse, and repeat.\n \nThe mandatory therapist that he’d seen for the three mandatory sessions had basically only been useful for her numbers thing. Bucky hadn’t opened up enough for her to give him a proper diagnoses, but it went without saying that he was fucked up. Bucky didn’t need a fancy degree to come to that conclusion. And he didn’t need help.\n \nIt was even worse after the-\n \nAfter the-\n \nThe-\n \nWell.\n \n“Thirty-eight days, thirty-eight minutes,” Bucky whispered.\n \nThe neighborhood was fine, at least from what Bucky had seen from his limited exposure thus far. His next-door neighbor to the right waved amiably whenever he saw Bucky timidly venture outside to pick up his mail. His neighbors to the left hadn’t yet acknowledged him, but Bucky thought he saw a middle-aged couple with a teenage girl occupying the house.\n \nAcross the street were the sweet old ladies who Bucky had only seen once when he was watching the street behind the safety of his window. Next to them (diagonally right from Bucky) was another couple that had left cookies on his doorstep when he’d first moved in. The post-it note attached had a little smiley face and read: from Natasha and Clint AKA your best neighbors. On the other side of the old ladies was some guy who Bucky had only ever seen wearing sunglasses- even at night.\n \nHe’d scope them all out completely eventually. He was just a little reluctant to leave the house for prolonged periods of time at present.\n \nBucky hadn’t realized that he was staring vacantly at the floor for what was probably too long until there was a knock at the door. Bucky startled, pulse sky-rocketing for a moment. He ignored his nerves and tiptoed quietly to the door.\n \nBucky put a hand on the glock in his belt before he opened the door a crack. Outside stood a tall, nicely-proportioned man. (And by “nicely-proportioned,” Bucky meant “a walking wet-dream.”) The flare of the sun made Bucky squint as he took in the man’s chiseled features, all-American blonde hair, and blue eyes. “Can I help you?” he asked warily.\n \nThe man ducked his head sheepishly, averting Bucky’s eyes for a second before meeting them. They were so ridiculously blue that Bucky kind of wanted to ask if he wore colored contacts. “Um. I’m Steve. Steven Rogers. I’m... company.”\n \nBucky narrowed his eyes, knowing that Steve was referencing Fury’s note. It didn’t escape him that Steve shared his assumed last name. “Are you gonna be my cousin?” Bucky asked dully.\n \nSteve frowned. “Husband, actually,” he said easily, holding up his left hand to show a typical golden band.\n \nBucky scowled and closed the door.\n \nThere was a pause before Steve knocked softly again. “Is this a homophobia thing?” he asked, voice muffled through the door.\n \n“No,” Bucky snapped.\n \n“Then can I come in?”\n \nBucky locked the door, knowing the sound was audible.\n \nHe heard Steve sigh. “Why are you being difficult about this?”\n \n“Don’t need help.”\n \n“I beg to differ.”\n \nBucky shook his head, stalking towards the kitchen and crumpling Fury’s post-it note. He uncrumpled it, carefully tore it into tiny squares, and tossed the remains in the recycling.\n \n“It’d look unseemly if one of the neighbors saw me stranded on your porch,” Steve called dryly.\n \nBucky shook his head, not deigning to reply.\n \n“I can pick this lock, Buchanan.”\n \n“It’s Bucky,” Bucky said without thinking, forgetting about his silent treatment for a second. Then he scowled at the door, as if Steve was responsible.\n \n“Okay, Bucky then.” There was a pause. Bucky shuffled uneasily in the foyer. “Please let me in.”\n \nBucky crossed his arms indignantly, even though Steve couldn’t see him.\n \n“Look, I’m here to help.”\n \nBucky scoffed.\n \n“It’s part of my job,” Steve said, a dangerous edge coming into his deep voice. Bucky was surprised and embarrassed to find the sound sending a thrill through his gut.\n \nWhen Bucky didn’t say anything to that, there was another stretch of silence.\n \n“I read your file,” Steve finally said, quietly. Bucky straightened, panic and anger and curiosity shooting through him all at once. “I know what they did to you.”\n \n“How dare you,” Bucky hissed.\n \n“I’m not trying to start a fight,” Steve said, sounding annoyed. “I’m just saying that I understand.”\n \n“You understand nothing,” Bucky said darkly.\n \nSteve made a noncommittal noise. “I brought bagels and lox from your favorite deli.”\n \nThis caught Bucky’s attention. “Sesame?” he asked hesitantly.\n \n“Yeah.”\n \nBucky cursed himself and his love for that damn deli as he unlocked the door and opened it. Steve looked pleasantly surprised and too smug for the American-wholesome-boy-next-door image he had going for him. Seriously- he was wearing khakis.\n \nSteve stood from where he’d been sitting on the porch, grabbing his suitcase and walking inside.\n \nBucky immediately closed the door and engaged the four locks. Steve whistled. “Nice.”\n \n“Bagels,” Bucky demanded.\n \nSteve wordlessly handed over a brown bag, stock full of bagels, lox, and cream cheese. Bucky made a pleased noise at the sight and dropped the bag on the table, preparing one of the bagels just the way he liked it- with a heap of lox and minimal cream cheese. When he bit down, an almost pornographic moan rose from deep in his throat as his eyes fluttered shut.\n \nBucky cracked an eye open to see Steve looking distinctly uncomfortable. “If you have sex with that bagel, I’m going to request a transfer.”\n \nBucky snorted despite himself, causing Steve to grin triumphantly. “Jealous?” Bucky taunted after he’d swallowed.\n \n“Very,” Steve said, trying to look as serious as he could.\n \nBucky returned his attention to the bagel. It had been so long since he’d last eaten one. The bagels at the grocery store didn’t even belong in the same category as these. These bagels were superior to all other bagels. They were amazing enough that Bucky could almost tolerate Steve’s awkwardly hovering presence.\n \nAlmost being the key word.\n \n“Don’t just fuckin’ stand there. Sit down. Or make coffee if you wanna be useful.”\n \nSteve frowned, the young lines of his face pulling into something nearly unattractive. “I think I prefer to stand,” he said, voice hard.\n \n“Stubborn little shit, are you?” Bucky said dryly before taking another bite.\n \n“It’s been said,” Steve agreed mildly.\n \nIt was silent as Bucky finished his bagel.\n \nThen, Steve addressed the elephant in the room, placing a golden ring on the table in front of Bucky. “Congrats, hubby,” Steve said.\n \n“I don’t want to marry you though,” Bucky grumbled, eying the ring with distrust. “Why can’t you be my cousin or some shit?”\n \nSteve shook his head. “I don’t look much like you and having your cousin stay at your house for the foreseeable future seems weird and dysfunctional. It attracts attention.”\n \nBucky frowned. “No it doesn’t.”\n \n“It shouldn’t,” Steve said, “but people make snap-judgments.”\n \n“And being a gay couple doesn’t attract attention,” Bucky said flatly.\n \nSteve drew up his shoulders, stance becoming coiled and defensive. “Are we going to have a problem?”\n \n“Not with the gay thing- I’m bi. That part is whatever.” Steve visibly relaxed. “I’m just opposed to the idea of pretending I’m in love someone. Not to mention being comfortable around them.”\n \nSteve raised an eyebrow. “We’ll work at it.”\n \nBucky wrinkled his nose, glaring at the ring.\n \n“Look we’ve already thoroughly established a cover this way, and the rings were really expensive, and the agency paid for them. I’d feel bad if you refused to wear it.”\n \nBucky, being frugal with money himself, sighed in defeat, reluctantly slipping the ring on.\n \nSteve reached into his bag and tossed Bucky a piece of paper that had probably been forged by some FBI people. “Happy marriage,” Steve said. Bucky looked at the certificate and rubbed a hand across his jaw, feeling the stubble there.\n \n“We’ll have to get that framed probably,” he grumbled.\n \n“That’s the spirit.”\n \nBucky tapered into silence, staring at his watch as the seconds ticked by.\n \n“So,” Steve began awkwardly.\n \nBucky shoved to his feet, chair legs scraping against the hardwood floor. “We can talk covers later. I need a minute,” he muttered before stalking off, beating a retreat upstairs and locking himself in his room.\n \nBucky slid to a sitting position, tucking in the farthest corner with his knees drawn to his chest. He took his glock out of his waistband and ran his fingers over it, closing his eyes.\n \n“Thirty-eight days, one hour, two minutes.”\n \n \n \nBucky watched Steve warily as he unpacked his things.\n \nSteve was talking easily about their cover story as he sorted through his things. At the moment, he was stocking a high-tech, well-hidden safe with plenty of guns and ammunition, handling the items like he was more comfortable with them than with human conversation.\n \nBucky listened attentively to what was going to be their established history. He thought the story was a little too dull, but he kept his mouth shut.\n \nFinally, he blurted, “Shouldn’t it be a little more exciting?”\n \nSteve looked up from his task, lips pursed. “What do you mean?”\n \nBucky sighed. “It’s a standard boy-meets-boy, they fall in love, they get married, they move to suburbia to live a boring life story. It should be more exciting. Or at least have a cute twist. If we’re gonna have to tell this story a bunch, people are gonna think we’re cute as fuck.”\n \nSteve arched an eyebrow. “What?”\n \n“I’m not fucking around when it comes to cuteness, Steve.”\n \n“Are you... making a joke?”\n \nBucky allowed his lips to quirk slightly, watching bemusedly as Steve’s shoulders relaxed. “But, for real. We’ve gotta throw in something really cute. People don’t coo at married people for standard stories.”\n \nSteve shrugged. “Maybe boring stories should be exactly what people want, though.”\n \n“Where’s your sense of imagination? Action! Romance! Adventure! Sex!” Bucky announced, spreading his arms out.\n \nSteve rolled his eyes. “That doesn’t happen in real life.”\n \n“The hell it does. My mom met my dad because she stole my dad’s motorcycle three times. He asked her out by stealing her car.”\n \nSteve’s eyes went wide. “Were your parents delinquents?” he asked incredulously.\n \nBucky held his thumb and forefinger a centimeter apart, making a vague noise.\n \n“Why am I not surprised?”\n \nBucky ignored him deliberately. “Okay: new story. We knew each other since we were kids, and I went off to war-“\n \n“Bucky, this sounds like the start to a Nicholas Sparks-“\n \n“-and you thought I died, and you were super sad and shit because you just realized you were in love with me. But, I miraculously survived this freak accident-“\n \n“What freak accident?” Steve asked, amused.\n \nBucky faltered. “Uh- I fell off a train.”\n \n“A train?”\n \n“Yes. And got amnesia.”\n \nSteve made a noise in the back of his throat. “Now you’re just being ridiculous.”\n \nBucky’s lips curved into a smile as he went on. “When you saw me again, I didn’t recognize you, and you thought you had seen a ghost. But you figured you had nothing to lose when you approached me, and when you were sure it was me, you kissed me, and all my memories came back.”\n \n“Oh my god,” Steve said, trying to stifle a laugh.\n \n“You proposed to me while we were trying to take down the bastards who sabotaged the train I fell off in the first place. Like the scene from Pirates of the Caribbean.”\n \n“They were getting married in that scene, not proposing.”\n \n“I know, but that doesn’t fit with the story.”\n \nSteve giggled. “Oh, we’re worrying about realism now, aren’t we?”\n \nBucky couldn’t contain a little smile. “Oh, shut up. It’s better than what you had.”\n \n“Why don’t we compromise?” Steve suggested, still smiling a little.\n \nBucky groaned. “Fine.”\n \nThey settled on something a little tamer than Bucky’s extravagant idea (“It could totally be a hit romance movie, Steve, hear me out- a thriller romance movie- Steve, are you listening?”) and a little more exciting than Steve’s lame idea (“It’s just plausible, Bucky, and it’s uncomplicated... But fine. Not like I care that my idea is better or anything.”)\n \nAfter they’d finally agreed on something plausible, Steve dragged Bucky outside to retrieve the mail.\n \nBucky’s next-door neighbor to the right was gardening, and straightened with intrigue when he saw them.\n \n“’M not a hermit, Stevie,” Bucky grumbled, letting the nickname roll off his tongue naturally.\n \n“While I was gone, you were,” Steve argued happily, approaching the mailbox as Bucky trailed after him, scowling, hands shoved in pockets.\n \n“Most of these are addressed to some guy named Bruce Banner,” Steve observed, leafing through the envelopes.\n \nBucky shrugged. “Yeah, he was the last person to live here. He had to leave kind of abruptly apparently.”\n \nSteve frowned at the envelopes. “Do you think we kicked him out?” he asked quietly.\n \n“Wouldn’t surprise me.”\n \nSteve pursed his lips, a crease forming between his brows. As Bucky watched Steve with a carefully blank face, the next-door neighbor approached them, removing dirty gardening gloves. “Beautiful day,” the man remarked, tossing a look their way.\n \nBucky tried to smile and knew it fell short. “Sure is,” he agreed half-heartedly.\n \n“I don’t believe we’ve officially met. I’m Sam Wilson.”\n \nSteve looked up, perceptive eyes sweeping over Sam’s form. Bucky realized that Steve wasn’t planning on responding first after an awkward beat. “Buchanan Rogers,” he returned, “But you can call me Bucky. This is my... husband.”\n \n“Steve,” Steve said.\n \nSam looked amused. “Newlyweds?”\n \n“How’d you guess?” Steve asked dryly.\n \nSam chuckled. “I’m good at reading people.” He looked at Bucky. “Didn’t know you had a husband. I assumed it was just you.”\n \n“Well, Stevie, here, had to wrap up some things with his work. I moved out here a week early to get us settled,” Bucky said, trying his best not to sound passive-aggressive towards Steve, lest Sam pick something up.\n \nSteve frowned at Bucky. “I was only gone a week.”\n \nBucky arched an eyebrow. “Eight days, nine hours-“ he cut himself off before he blurted the minutes since he’d arrived at the house too. Sam and Steve were already looking at him oddly. Bucky turned his gaze to the ground. “Anyways.”\n \nSteve reached out and clasped Bucky’s shoulder with surprising firmness. The touch was grounding in a really nice way- not that Bucky would ever admit it. “I’m here now,” he said softly.\n \nBucky bit his lip to keep from saying exactly how long Steve had been here (three hours, sixteen- shut up).\n \n“You two are cute,” Sam said, smiling, albeit a little sadly for whatever reason.\n \nBucky flushed, but gave Steve a smug look. Steve rolled his eyes, dropping his hand from Bucky’s shoulder. “Hear that, Stevie,” he teased, “We’re cute.”\n \nSteve coughed, ducking his head and ignoring Bucky. “Thank you, Sam.”\n \nSam shrugged, then nodded to the envelopes. “Are you still getting Bruce’s mail?”\n \nBucky and Steve nodded. “He didn’t leave a forwarding address,” Bucky said quietly.\n \nSam sighed, scratching the back of his head. “Nobody knows where he went... Tell you what, the next best thing is Tony.”\n \n“Tony?”\n \n“Yeah. They were sort of tight,” Sam said, and Bucky tried not to think about how cryptic that sounded. “I’ll invite him, Natasha and Clint, and you guys over for dinner tomorrow, how’s that sound? You can give Tony the letters and meet the squad.”\n \n“The squad?” Steve echoed.\n \nSam smirked. “The squad,” he agreed.\n \nBucky huffed a laugh. “I wasn’t aware that grown-ass men referred to their friend groups as a ‘squad.’”\n \nSam laughed, and the sound was actually pretty beautiful. Sam was a good-looking guy. If the circumstances were different, Bucky probably would’ve already turned this conversation towards flirting. But the circumstances were how they were: Steve was Bucky’s alleged husband and Bucky was fucked up in the head. “Just getting with the times, dude. I didn’t know that my new neighbor was actually a ninety-five year-old man,” Sam teased.\n \nBucky scoffed, shooting a glance at Steve. “How dare you accuse me of that when we’re standing next to the guy wearing khakis.”\n \nSteve frowned. “What’s wrong with my khakis?”\n \nSam giggled. “Dude. You two are both grandpas. This is perfect.”\n \nSteve smirked, disrupting the wholesome American vibes yet again. “I think I could change your mind,” he said, dropping his voice low.\n \nA shiver went down Bucky’s spine, but he ignored it, instead opting to look at Steve incredulously. “Are you flirting with the hot next-door neighbor in front of me?”\n \nSteve snorted while Sam laughed. “Don’t worry, Bucky. I’m a committed man,” Sam said, raising his hand to show a silver wedding band. “Although I can’t say I wouldn’t hit that,” he conceded, eying Steve.\n \nSteve blushed, and Bucky nodded. “He’s mine.”\n \n“Don’t talk about me like I’m your property, Buck. At least, not outside closed doors,” Steve said cheekily, and Bucky sputtered.\n \nSam held up both hands. “I am going to pretend that I did not hear that.”\n \n“Wise man,” Steve said, slinging his arm across Bucky’s waist. Bucky tried not to show his surprise, and ended up leaning into the touch after a pause.\n \n(It had sort of been a while since anyone besides doctors and other, less-savory folks had touched Bucky. He was maybe a tiny bit touch-starved. Not that it mattered.)\n \nSteve started rubbing these little circles with his thumb across the fabric of Bucky’s shirt. The movement definitely didn’t distract Bucky.\n \nSam gave Bucky a smirking, knowing look that told him he wasn’t fooling anyone. Bucky looked at the ground, and Sam started backing away, pointing at them. “Tomorrow at seven, lover-boys.”\n \n“You got it, Sam,” Steve agreed.\n \n \n \n“Okay, so we have a little bit over twenty-four hours to get to know each other.”\n \nBucky glanced at his watch and did some snap calculations. “Over thirty hours.”\n \nSteve looked at Bucky curiously. “You keep doing that.”\n \nBucky bristled. “Doing what?”\n \n“The time thing. Is it just a thing you do or what?” Steve asked, and he sounded genuinely interested.\n \nBucky glared.\n \n“Fine,” Steve sighed, “you don’t have to tell me.”\n \nBucky started picking at the hem of his shirt- a comfortable red Henley that Bucky had been wearing for the past three days. “What’s your favorite color?” Bucky asked.\n \n“What?”\n \nBucky shot Steve a look. “We’re getting to know each other, right? Your favorite color, Steve.”\n \nSteve smothered a little smile, going to sit on one end of the couch in Bucky’s living room. Bucky hesitated before sitting on the other side.\n \n“I like them all,” Steve said honestly. “Today, I think I’m feeling blue, though.”\n \n“What kind of blue?”\n \n“Navy.” Steve paused, lips curling. “I kind of hate royal blue. It makes me sad to look at.”\n \nBucky was startled into a little laugh. “I thought you said you like all the colors?”\n \nSteve made a face. “Hyperbole, Buck.”\n \n“Punk,” Bucky muttered under his breath, rolling his eyes.\n \nSteve pretended not to hear. “What’s your favorite color, then, smartass?”\n \nBucky shrugged. “Red.”\n \n“Like your shirt?”\n \n“Any red. I dunno. It’s eye-catching.”\n \n“Red is interesting,” Steve mused. “It represents both violence and love. Ain’t that weird?”\n \n“I don’t think that’s weird at all. Don’t those two go hand-in-hand?”\n \nSteve frowned. “That’s certainly a pessimistic way of looking at things.”\n \n“Hey. I’m not a pessimist. I’m a realist. Big difference,” Bucky said seriously.\n \nSteve broke into a grin. “You know, every single person I’ve ever called a pessimist has said something along those lines.”\n \n“Well, us realists know what’s up.”\n \nSteve snorted. “Alright, whatever. You enjoy being sad and disillusioned.” Bucky nodded, pretending to raise a glass. “Favorite movie?”\n \n“The Empire Strikes Back,” Bucky said immediately.\n \n“Wow, you were prepared for that one.”\n \nBucky narrowed his eyes. “You’re a Star Trek guy, aren’t you?”\n \nSteve arched an eyebrow. “And what would be wrong with that?”\n \n“Nothing. I’m cool with Star Trek. I just don’t want you to be under the impression that it’s better than Star Wars.”\n \n“Well, no need to worry. I haven’t seen either,” Steve admitted.\n \nBucky’s eyes widened. “You’re kidding, right?”\n \nSteve shook his head. “I don’t have a lot of time to be caught up with pop culture.”\n \n“Steve, these movie franchises are not new developments,” Bucky said incredulously. “Star Wars and Star Trek are like... historic. I can’t believe this.”\n \n“You’re going to force me to watch all of them, aren’t you?” Steve asked, resigned.\n \n“Not the prequels. Those are optional,” Bucky mused, already trying to plan a good time for a movie marathon.\n \nSteve sighed, leaning back in his seat and looking tired at the thought.\n \nBucky blinked back to the present. “We’ll be talking about this more later. Your favorite movie?”\n \n“Um...” Steve ducked his head, a blush coloring his cheeks. “How to Train your Dragon.”\n \nBucky stared at Steve in surprise.\n \nSteve was quick to say, “Look, when you have amazing animation, story, score, and characters all rolled into one, I’m a goner. Plus: dragons.”\n \nBucky giggled. “Oh my god. You’re not a bodyguard. You’re a fucking dork.”\n \nSteve jutted out his amazing jaw. “I’m not even a bodyguard. I’m an agent.”\n \n“And a dork.”\n \nSteve lifted a nonplussed shoulder. “I’ve been accused of worse.”\n \nWhen Bucky stopped giggling, they sat in silence for a moment. “Okay. New question. Favorite food.” Bucky smirked. “I bet it’s apple pie.”\n \nSteve rolled his eyes. “It’s not. Although, apple pie is pretty damn amazing.”\n \nBucky grinned, opening his mouth to boast in triumph, but Steve cut him off with a look.\n \n“I happen to be partial to shawarma.”\n \n“Huh. Nice.”\n \n“You?”\n \nBucky jerked his thumb in the direction of the kitchen. “Bagels from Maria’s Deli.”\n \nSteve tipped his head back to laugh, exposing the tendons of his neck. Bucky tried not to stare, but he was only human. “I should have guessed.”\n \n“Those bagels are too good for this world,” Bucky murmured, gaze going distant.\n \n“Oh, god. Do you need a minute alone with the bagels?”\n \n“I’ll have you know that the bagels and I are very happy together.”\n \nSteve was still smiling with his stupidly full lips. Bucky decided he could get used to the expression. “Okay. Favorite memory.”\n \nBucky thought about it for a moment, mood sobering. “My sister and I always used to do this dumb thing. It started when I was reading Harry Potter in the fifth grade, and Becca wanted to read it too, so I was a ten-year-old dick and told her that Dumbledore dies ‘cause I thought Becca was being an annoying copycat. It became a thing, and whenever we got annoying, we’d spoil books or TV shows for each other. I hated her so much for it, but it was also totally out of love? I don’t know how to explain it. But there was this one time when Becca and I were home for Christmas, and my ma was being annoying about asking if I’d met anyone special yet. Becca and I knew she’d started watching Breaking Bad and had gotten completely hooked on it. So Becca looked straight at me, smiled, and spoiled the ending for ma.”\n \nSteve was watching, an indecipherable expression on his face. “That’s hostile.”\n \n“Ma was furious,” Bucky agreed, smiling sadly. “But she stopped bothering me about being lonely and shit, and Becca was there to look out for me.”\n \n“You really love her,” Steve said.\n \n“Yeah, I do.”\n \n“I’m sorry.”\n \n“Me too,” Bucky sighed, staring at his lap. “How about you? Favorite memory?”\n \nA wrinkle appeared between Steve’s eyebrows, and he licked his lips. “I dunno.”\n \n“You’re not getting out of this one, Steve,” Bucky said. “I just spilled my guts. Don’t make me feel awkward about it.”\n \nA light blush spread across Steve’s features. “It’s embarrassing. And I barely know you.”\n \n“I’m not going to judge you,” Bucky said seriously. “I’ll never do that.”\n \nSteve frowned, but a gleam had returned to his eyes. “Except about not having seen Star Wars?”\n \n“And Stark Trek,” Bucky agreed.\n \nSteve puffed out a breath. “Okay, well... It’s kind of a long story.”\n \n“We’ve got time- about thirty hours,” Bucky reminded Steve gently.\n \nSteve seemed to gather his strength. He turned to Bucky fully, a note of defiance lacing his posture. “When I was born, the doctors were certain that I was going to die.”\n \nBucky’s eyes widened. This was not what he’d been expecting.\n \n“I was premature, had underdeveloped lungs, an undeveloped eardrum, a heart murmur, scoliosis, nutrient deficiencies, and a number of other ailments I won’t bore you with. Anyway, my mother was told that I was halfway dead, and that she had two choices.” Steve paused, biting at his lips absentmindedly. “She could either try to raise me herself or pretty much sell me to the government.”\n \n“Holy fuck,” Bucky breathed.\n \nSteve’s eyes flicked towards Bucky and then back downwards. “Now, from what I’ve been told, my mother wasn’t doing very well. My father was out of the picture, her debt was incredible, her paycheck was insignificant, and she’d just been diagnosed with cancer. She knew she could hardly take care of a healthy baby, let alone me. So, she agreed to let the government have me on one condition.”\n \n“And what was that?” Bucky asked, absorbed in the story.\n \nSteve smiled sadly, finally meeting Bucky’s gaze fully and steadily. “That if she survived cancer long enough, she’d get to meet me some day. And the government agreed.”\n \n“What happened?”\n \nSteve laughed, and the sound was bitter. “The government had some experimental tests. They were trying to create something to help soldiers get stronger without impairing their mental faculties- I don’t know all the details. The tests had side effects that I can’t really legally talk about. But I survived. And so did my mother. I met her when I was twenty-one. Her name is Sarah, and that day was probably the best day of my life.”\n \n“I can imagine,” Bucky whispered, wanting to reach out to Steve and do something dumb like brush the hair away from his forehead or hold his hand.\n \nSteve was quiet for a long time. “We meet up whenever we can, but I literally belong to the United States government.”\n \nBucky frowned. “That can’t be true.”\n \n“I don’t technically exist, you know,” Steve mused, almost to himself. “I was proclaimed a stillbirth.”\n \n“Fuck.”\n \nSteve shrugged. “It is what it is. New question.”\n \nBucky stared at Steve for a moment in confusion. For the life of him, he could not get a good read on this guy. After a moment of consideration, he figured it was best to move on from the solemnity of the conversation. “Favorite animal?”\n \nSteve looked visibly relieved that Bucky had let him off the hook (for now). “Oh, shit. I have no idea... Maybe dogs? I really like dogs.”\n \nBucky smiled a little bit. “I see it.”\n \n“You?”\n \nBucky thought about it. “Panthers are hella cool. I’ve liked them since I had to make a poster about them in the third grade.”\n \n“Oh?” Steve said, smirking.\n \n“I’d like to see you try to make a better poster.”\n \nSteve actually rose halfway out of his seat before collapsing back into the couch, looking at Bucky. “You were joking.”\n \nBucky tapped his nose in silent agreement, trying not to laugh at Steve’s swiftness to the challenge.\n \n“When’s your birthday?”\n \n“Wasn’t that in my file?” Bucky asked dryly.\n \nSteve lifted a shoulder. “No. I never got to see your real name or any concrete details- just your background and the incident.”\n \nBucky mulled over this new information for a moment. Steve had only seen the worst of him. It was a wonder that he was even here right now. “March 10th.”\n \nSteve’s eyes brightened. “That was last month, wasn’t it? How old are you?”\n \nBucky swallowed. “Um. Twenty-eight. Um. When’s your birthday?” he said awkwardly, trying not to think about how he spent his own birthday that year.\n \nSteve looked away quickly, and it took Bucky a moment to realize that he was embarrassed. “Um. Don’t laugh, okay?”\n \n“Why would I-“\n \n“It’s July 4th.”\n \nAnd how could Bucky not? He burst into a fit of giggles, delighted. “Oh my god. Are you-? You’re serious! Oh my god. Hey, Steve, I’ve got a question for you.”\n \nSteve stared at him, resigned. “What?”\n \n“Oh say, can you see by the dawn’s early light?” Bucky asked with mock sincerity.\n \nSteve blinked, unimpressed.\n \n“I can feel the patriotism, Steve,” Bucky said sarcastically, nudging Steve with his toe.\n \n“I’m not patriotic,” Steve sighed, looking heavenward.\n \n“Oh, cruel irony,” Bucky said gleefully.\n \n“This is why I never tell anyone my birthday.”\n \n“Hey, you’re the one who brought up that question.”\n \nSteve looked at Bucky tiredly. “It was a lapse in judgment.”\n \nThey went on like this, learning dumb and insignificant things about each other. They kept the rest of the conversation light-hearted after Steve’s discomfort with the whole favorite memory thing, and Bucky was kind of glad for it. By the time they’d ordered in take-out and had finished eating, Bucky registered with mild shock that he hadn’t checked the time for six hours.\n \n(Well, six hours and fourteen minutes.)\n \n“Shit, have we really been talking this whole time?” Steve asked when he noticed Bucky’s surprise.\n \nBucky nodded, suddenly feeling shy. “It didn’t feel that long to me either,” he mumbled.\n \n“Well, you know what they say. Time flies when you’re having fun,” Steve said lightly, smiling in Bucky’s direction.\n \nBucky didn’t say anything for a minute. Then (because he was apparently a masochist), “You read my file.”\n \nSteve frowned, all of the lines in his face becoming visible. “Yes.”\n \n“And you’re not scared.”\n \nSteve considered. “Maybe on your behalf. But scared of you? No. I’m not.”\n \n“I could snap at any minute,” Bucky continued, not sure why he was pressing this.\n \n“I think we could handle it if you did. They didn’t send me for nothing,” Steve muttered, looking away.\n \n“What the fuck is that supposed to mean?”\n \n“That maybe you should be the one who’s afraid of me.”\n \nThey stared at each other, tense.\n \nBucky shifted uneasily. “What do you mean?”\n \nSteve smiled humorlessly. “I mean that I’m the only one dangerous enough to protect you.”\n \nA shiver went down Bucky’s spine. Steve’s gaze was intense, and his eyes were hard but curiously devoid of emotion. For the first time since Bucky had met Steve, he was absolutely certain that this man was not what he seemed to be. He wasn’t an all-American boy-next-door. He wasn’t an out-of-touch grandpa who wore khakis unironically. Bucky wasn’t sure what Steve was, and he didn’t know if he wanted to find out.\n \nBucky cleared his throat, dropping his gaze and effectively breaking the moment. “Um. The guest room is upstairs. First door on the left. My room is right across the hall, if you need me. I’m- uh- going to turn in early.”\n \nSteve watched him carefully, his face blank. “Don’t freak out if you hear me moving around in the middle of the night.”\n \n“I’ll try not to,” Bucky said slowly, glancing up with a question in his eyes.\n \nSteve smiled ruefully. He must have seen Bucky’s curiosity because he explained, “I don’t sleep much.”\n \nBucky nodded. “Well, welcome to the club,” he muttered under his breath before making a break for his room.\n \nBucky knew that this was the time of evening that only grandparents went to bed, but he didn’t really care. He knew he wouldn’t sleep, but he knew he wouldn’t be able to stay down there with Steve for much longer without saying the Absolute Wrong Thing.\n \nSo, Bucky curled into a ball in the center of his bed and pretended to sleep.\n \n \n \nThe story goes like this:\n \nJames Barnes was a private detective in Brooklyn, pretending he knew exactly what he was doing with his life.\n \nJames wasn’t necessarily swimming in money, but he got by with the cases that came to him. His customers were loyal and willing to pay the price to get information.\n \nAs winter churned onwards with gusto, James received a new client named Jasper Sitwell. Sitwell was suspicious that his boss was embezzling funds and perhaps doing something even shadier on the side. He hired James to investigate.\n \nWhat James found could hardly be described as “something shady.” What he gradually uncovered was a criminal organization so deeply rooted in New York City that James could hardly tell who was a part of the organization and who was a victim of the organization.\n \nJust as James realized that he was way out of his depth with the case, things went south. James met with Sitwell to discuss his findings so far and apologize for deciding to turn the case over to someone more capable of doing something about it. Sitwell turned on James, claiming that the organization had blackmailed him into trading James for protection. So, Sitwell brought James directly to the leader of the organization, Alexander Pierce.\n \nJames was tortured in many creative ways under Pierce’s supervision. The worst of the torture involved a drug that tampered with memory. James lost sense of time and continuously woke up with blood on his hands, not sure whether it belonged to him or someone else.\n \nAfter what James learned had been around three months, someone caught him while he was under the influence of the drug (and apparently had been on his way to kill the mayor and his family). James woke up in a questioning room, but his case was quickly referred to the FBI. After pouring over evidence that indicated James’ innocence in any crimes he may have been associated with, the agency determined that the witness protection program would be the best way to keep James safe from the nameless organization, and in return James gave them all the information he had.\n \nHe was moved to a suburban neighborhood in upstate New York.\n \nAt least here, Bucky could keep track of the time.\n \n \n \nBucky stepped out of bed when the clock turned so that it had been exactly thirty-nine days.\n \nSteve wasn’t in the kitchen when Bucky slumped to the coffee machine dejectedly. Bucky rested his head on the cold marble of the counter, letting his eyes close as the coffee machine churned in agitation.\n \nWhen Steve quietly came back inside from wherever he’d been, he found Bucky staring blankly at broken shards of what had previously been his favorite coffee mug.\n \n“Bucky?” Steve asked warily, stepping into the kitchen.\n \nBucky blinked slowly and looked up. Steve was a little bit sweaty, wearing workout clothes that looked at least a size too small- not that Bucky was complaining or anything. As Steve stared at him with growing concern, Bucky looked back down at his broken cup for a moment, then back up at Steve. “It broke,” Bucky said, voice coming out raspy.\n \n“How?” Steve asked slowly.\n \nBucky shifted, wincing when he stepped on a piece of ceramic. “I dropped it.”\n \n“You dropped it?”\n \nBucky nodded. “On the way to get coffee.” Bucky clenched his fists. “I haven’t had coffee.”\n \n“Okay. Don’t move. I’m gonna grab the vacuum cleaner.”\n \nBucky didn’t move, looking mournfully between the shards of ceramic and the coffee maker. Steve returned, vacuuming what he could from around Bucky’s feet. When he was finished, Bucky immediately searched for a new mug.\n \n“Wait. Buck- you’re bleeding.”\n \nBucky shrugged, pouring the hot coffee into his new mug.\n \nSteve took him by surprise when he grabbed Bucky by the shoulders and steered him to sit down, grabbing his ankle and placing his foot on another chair. Bucky stared at the sole of his foot and- okay, yeah- that was blood.\n \nA winkle appeared between Steve’s brows as he cleaned away the blood to make sure the cut was clean. Then, he layered two Snoopy Band-Aids over the cut.\n \n“Thanks,” Bucky whispered.\n \n“Well, don’t get used to it. I just didn’t want to see you bleed out,” Steve said teasingly. “Like, for real. You didn’t even notice you got cut.”\n \n“I have a really high pain tolerance,” Bucky told Steve wryly.\n \nSteve shot him a troubled look but said nothing. Good, Bucky thought with some morbid satisfaction, he should be uncomfortable.\n \nAfter a few minutes of sipping coffee in silence (Steve had gone to pour his own cup), Bucky asked, “Did you go for a run or something?”\n \n“Oh. Yeah. It helps me think less.” Steve lifted a shoulder with a little self-deprecating smile. The movement let his shirt stretch, and for a moment, Bucky was actually worried that the fabric was going to tear.\n \n“That’s good,” Bucky said awkwardly, trying desperately to find the easy banter from yesterday. Instead of finding that, they tapered off into more silence.\n \n(Bucky was trying not to ogle Steve’s chest, but... seriously. Steve’s pecks were so defined and muscular that Bucky almost wanted to buy him a bra. It was just indecent. Why was this happening to him?)\n \nAfter stewing in frustration over his lack of social skills, Bucky decided that he didn’t care about finding ease in his “relationship” with Steve and settled more comfortably into the silence. It wasn’t that Bucky saw Steve as something bad entering his life- Steve was literally hired to make sure that Bucky didn’t die or relapse (or worse, the back of his mind reminded him). No, Bucky was just used to handling things alone. Before all this, he was a private detective, and the strongest human relationship in his life (excluding his relationship with his sister) had been with the angry, alcoholic neighbor who he sometimes collaborated with on particularly difficult cases.\n \nAnd now Bucky apparently had a husband. A really, really hot husband who was somehow both a complete dork and a terribly dangerous asset.\n \nDid Bucky care if they were friendly beyond business? Not particularly. Bucky was a private detective. He was accustomed to bullshitting his way through situations. The truth was that a stable relationship seemed like an exhausting amount of work, and Bucky had more important things to worry about, such as trying not to relapse into a blank-slate assassin.\n \nBucky sunk into a gloomy silence, taking almost angry sips from his coffee. He knew he had a good thousand-yard stare going for him, and maybe that was why Steve knocked his knee against Bucky’s still-elevated leg. “Hey? You with me?” he said softly.\n \nBucky shifted his gaze to Steve, who was watching him seriously and a little bit nervously. Instead of saying anything relevant at all, Bucky said, “Everybody’s going to hate me.”\n \nSteve’s brow furrowed. “What?”\n \n“At the dinner thing tonight,” Bucky explained in irritation, “that Sam invited us to. They’re all going to hate me.”\n \n“Why?” Steve asked, sounding genuinely confused.\n \nBucky rolled his eyes. “Where to begin? Fuck, Steve, you’ve read my fucking file. You know how fucked up I am,” Bucky snapped, voice coming out more bitter than he’d intended.\n \nSteve narrowed his eyes. “Stop.”\n \n“What?”\n \n“The self-deprecation isn’t doing anyone any favors.”\n \n“You’re not my damn therapist.”\n \n“You don’t have a therapist. You ditched her after the mandatory three sessions,” Steve pointed out.\n \nBucky scrambled to his feet. “Fuck you,” he said, hurt. “You don’t know shit about what it’s like in my head.”\n \n“I know what it’s like to lose time,” Steve returned, crossing his arms.\n \nBucky swallowed roughly. “Have you ever lost time and woken up with blood on your hands?”\n \nSteve didn’t say anything, and Bucky was satisfied, however petty it was. “They won’t hate you,” Steve said tiredly, rubbing a hand across his face. For the first time, Bucky noticed the dark circles under Steve’s eyes that were as pronounced as bruises. “There’s a certain charm to just the right amount of grumpiness.”\n \nBucky wanted to roll his eyes. He wasn’t the charming type of grumpy, whatever that meant. He was the type of grumpy that lashed out just enough to damage. Exhibit A: current conversation. “You can’t be serious.”\n \nSteve was starting to get frustrated, and Bucky waited anxiously to see what he’d do when finally pushed too far. “If you never want to establish a connection with your neighbors, be as much of a jerk as you’re being right now.”\n \nBucky didn’t say anything for a moment. Then, “You know, I’m really sorry you’re stuck with me, but that doesn’t mean I’m going to pretend to be a fun person to be around.”\n \n“You did fine with that yesterday afternoon.”\n \nBucky closed his eyes, recalling the ease of their conversation and how much fun he’d had just talking to Steve. Despair crashed into him, squeezing his heart tightly. Bucky was never going to find that ease- he wasn’t even comfortable with himself, much less another person. Trying to ground himself, he attempted to remember exactly how long it had been since that conversation, but he couldn’t. His throat tightened with panic, and he turned away, eyes searching for the time. Thirty-nine days, forty-three minutes, he thought, lip trembling involuntarily.\n \n“...Bucky?”\n \nBucky ignored the concern in Steve’s voice, wrapping his arms around himself. It had been exactly thirty-nine days and forty-three minutes, and he was going to be fine, and he was free, and he wasn’t about to hurt anyone if he could just get away from Steve and make sure.\n \nBucky started to stalk out of the room, shuddering, but Steve grabbed his shoulder. Bucky flinched.\n \n“Hey, what’s wrong?” Steve asked softly.\n \nBucky whirled around and exploded, “I can’t remember when we stopped talking!”\n \nSteve looked at him in confusion. “What?”\n \n“I can’t- I don’t know when we stopped talking yesterday,” Bucky managed, breath hitching. He was furiously embarrassed immediately after the admission. It was a terribly small thing to be freaking out about, but if Bucky couldn’t keep track of the time, it brought him a terrifying step closer to relapsing.\n \nSteve’s eyebrows drew together, but he seemed to understand what Bucky needed at the moment. “When did you get out of bed?”\n \n“8:13,” Bucky whispered. “Thirty-nine days exactly.”\n \nSteve nodded as if he understood. “How long ago did you go to bed?”\n \nBucky pressed his lips together and thought. “Fourteen hours and thirty-eight minutes.”\n \n“How long has it been since-“\n \n“Thirty-nine days and forty-five minutes.”\n \nSteve smiled hesitantly, and Bucky realized that he was still gripping his shoulder, fingers digging into Bucky’s skin. “See? You’ve been keeping track. You’re okay.”\n \nBucky deflated a little bit. “But-“\n \n“You know you went to bed like five minutes after we stopped talking. So, you’re good.”\n \nBucky sagged within himself. “You’re right,” he mumbled. “I’m being stupid. This is so stupid.”\n \n“Nothing about this is stupid,” Steve said gravely.\n \n“Liar.”\n \nSteve frowned. “Look, Buck, I fixate on shit like that too. It’s not stupid.”\n \n“You mean you obsessively keep track of the time?” Bucky asked bitterly, shaking off Steve’s grip and taking a step back.\n \nSteve shook his head and was quiet for a moment. “I kind of obsessively clean. Um. I already completely took care of my room and the living room.” Bucky glanced towards the living room and had to do a double take. It looked flawless.\n \n“Okay,” Bucky said with a sigh. “Okay.”\n \nSteve was staring at his feet and shifting his weight, looking increasingly uncomfortable. “I’m going to straighten up the kitchen,” he mumbled, shrinking within himself as if he thought Bucky was going to laugh at him.\n \nBucky just nodded tiredly. “Yeah. I’m going to shower.”\n \n“Yeah.”\n \n \nBucky was eating a bagel for lunch and watching curiously/warily as Steve scrubbed at a scratch in the floorboards.\n \nThey hadn’t spoken since Bucky’s freak-out, and the silence was actually kind of nice and companionable. It was different, but nice.\n \nSteve broke the silence when he said distractedly, “We haven’t discussed boundaries.”\n \nBucky offered a noncommittal hum around his mouthful of bagel.\n \n“With PDA and shit. We should probably discuss that before we go over to Sam’s.”\n \n“Well, decent people don’t make out in front of people they’ve just met, so I don’t really see much of an issue,” Bucky said after he swallowed his bite.\n \n“It’s more complicated than that,” Steve said, sitting back on his heels and looking rather flustered. “Are we gonna be a naturally handsy couple? Shy newlyweds? Annoyingly enamored? The possibilities are kind of overwhelming.”\n \n“Won’t that stuff just come to us naturally?” Bucky asked. “And couldn’t it be a combination of some of those things?”\n \n“Sure,” Steve said easily, “but I don’t want one of us to panic if something ends up awkward. I’m here to keep you safe, and if your neighbors think there’s something up, I won’t be doing my job.”\n \nBucky wrinkled his nose. “Then what do you want to do? Roleplay? That’s kinky of you, Rogers.”\n \nSteve ignored the jibe. “We could act it out. How long do we have until we have to be at Sam’s?”\n \nBucky glanced at the clock. “Six hours and thirty-four minutes.”\n \n“We could go into town and walk around to just... test things out around other people.”\n \nBucky blinked. “While that is a great idea, I don’t know how well I’m gonna do in a place with a lot of other people.”\n \nSteve’s lips curled into a humorless smile. “Bucky, I’m here to protect in all its forms. Whether it be protecting you from criminal organizations, protecting you from yourself, or protecting other people from you. You don’t have to worry.”\n \nBucky felt himself relax a little bit. “If I snap, you’ll stop me? Make sure I don’t hurt anybody else?”\n \n“On my honor.”\n \nBucky nodded, getting to his feet. “Alright, then. I could use a few things to liven up the place anyways.”\n \nSteve drove them into town using the unremarkable gray sedan that the agency had left with Bucky.\n \nThe nondescript downtown held about four restaurants and ten small stores around a cozy block. Bucky kind of hated how different it was from Brooklyn. Steve parked along the curb and turned to Bucky. “What do you want to try first?”\n \nBucky shrugged, eyes sweeping the area. “We could go to that antiques shop and see if they have a record player or something. I didn’t get to bring mine with me.”\n \n“I meant which type of couple, but that works too.”\n \nBucky frowned, thinking for a moment. “Why don’t we just let it happen?”\n \nSteve considered. “Fine. But if it backfires into something completely uncoordinated, I’m blaming you.”\n \n“You’re too picky, Stevie.”\n \n“Whatever.”\n \nOnce inside the antiques store, Bucky took note of the people inside. There was a bored teenager running the cash register, a middle-aged mom examining some statues, and an old man looking nostalgically at baseball cards. Bucky hunched his shoulders and let his hair fall in front of his face almost subconsciously.\n \nSteve must’ve noticed because he put his hand on the small of Bucky’s back. The light pressure was surprisingly pleasant, and Bucky caught himself leaning into it. “You good?” Steve whispered, leaning down a little bit.\n \nBucky let out a puff of air. “Record players.”\n \nThey found a display showcasing three of them, and Bucky immediately started examining the cheapest one while Steve wandered to look at the music they had. They approached the counter with the record player and three albums that Steve had wordlessly chosen and Bucky had wordlessly accepted.\n \n“How’d you find everything today?” the teenager asked. Bucky glanced at his nametag: Eli.\n \n“Good,” Steve said, flashing a smile as Bucky took out his government-issued credit card. Then, he experimentally leaned into Steve’s side.\n \nWhich was...\n \nSteve was all solid warmth against him, and Bucky couldn’t remember the last time any warmth had thawed through his skin. Steve smiled down at him and shifted to wrap his arm around Bucky’s shoulders.\n \nIn conclusion: yes.\n \nBucky tried not to show how flustered he was from this small amount of contact, but he probably failed as he signed Buchanan Rogers in a nearly indecipherable script and Eli handed him his stuff. Bucky unplastered himself from Steve’s side and took the record player, happy to have something he wanted.\n \n“Have a great day,” Eli said.\n \n“You too,” Bucky and Steve said at the same time, although Steve sounded a lot more genuine.\n \n“That was good,” Bucky said as they exited the store.\n \n“The casual touching?”\n \nBucky felt his face go hot and prayed Steve wouldn’t notice. “Um. Yeah. That was nice.”\n \nSteve bumped their shoulders together. “Alright. We can do that.”\n \n“That was easy.”\n \nSteve snorted, and Bucky smirked, immediately loving that he’d caused that reaction. “We still have to figure out the verbal half.”\n \n“What d’you mean?”\n \nSteve gave him a sideways look. “There are different kinds of ways to show love through speaking. Have you ever watched Merlin?”\n \nBucky frowned. “You had time to watch five seasons of medieval gay wizardry, but you didn’t have time to watch Star Wars?”\n \nSteve blushed. “Yes,” he said, a note of defiance in his tone.\n \nBucky sighed in defeat. “Yeah, I’ve watched Merlin. Go on.”\n \n“Well, Arthur and Merlin were totally in love, but they showed it through bickering and teasing and shit.”\n \n“Yeah.”\n \n“And have you seen Parks and Rec?”\n \nBucky narrowed his eyes. “That show has seven seasons. You’re telling me you had time for that too, but no Star Wars?”\n \n“There’s always time for Parks and Rec,” Steve argued defensively.\n \nBucky groaned. “I’ve seen most of it.”\n \n“Well, Leslie and Ben are super supportive and cute, but April and Andy are really weird and adorable, but nobody can argue against the love there. Point is, different couples show love in different ways.”\n \n“Right.”\n \n“So, we have to figure out how we’re going to be,” Steve concluded.\n \n“How’re we gonna do that?”\n \nSteve lifted a shoulder. “This would be easier if we had an objective third-party.”\n \n“We could just ask somebody random if we seem like an authentic couple?”\n \nSteve ran a hand through his hair. “No, that could backfire and end up compromising us.”\n \n“Why don’t we just wing it?”\n \nSteve gave him a look. “No offense, Buck, but your behavior is kinda unpredictable. We’ve gotta prepare somehow.”\n \nA crease appeared between Bucky’s brows as he considered the man before him. “Wow... You’re kinda bossy, aren’t you?”\n \nSteve ducked his head, a blush spreading across his features. “Uh-“\n \n“You don’t have to respond to that,” Bucky said, playing with the sleeve of his shirt as he watched families meander down the street. “But, Stevie. I think you’re massively underestimating me. I’m a private detective-“ Steve made a hushing noise as a couple walked past, “-and I’ve pretty much bullshitted my way through eighty-eight percent of my life.”\n \nSteve arched a brow. “You’ve been honest for twelve percent of your life?” he asked incredulously.\n \n“Hey, could be worse, you punk. Point is, I can pretend to be charming and in love if I have to.”\n \nSteve leaned back on a lamppost, crossing his arms. “Prove it,” he said, tilting his chin upwards.\n \nBucky smothered a smirk. “You sure you wanna go there, Rogers?”\n \nSteve rolled his eyes. “We’re married, Buck. I’m sure.”\n \nBucky took the cue, sauntering over to the lamppost until there was only a breath of space between their chests. He teasingly slid a hand from Steve’s abdomen up to his pecks. He looked up so that their lips were barely a centimeter part. “Is that so?” he murmured lowly, eyes sparkling.\n \nSteve swallowed heavily. “You can do better than that. More romance, less seduction.” And was it just Bucky’s imagination or did Steve’s voice sound a little husky?\n \n“Stevie,” Bucky whispered, making a tsking noise. He leaned forward, tracing his nose along Steve’s jawline. “Desire is just as authentic as love.”\n \n“Not good enough,” Steve murmured lowly, his hand absentmindedly coming to clutch at the back of Bucky’s shirt.\n \nBucky leaned back, taking in the sight of Steve’s flushed face, considering his next move. “The first time I saw you, my heart stopped beating. I’d never seen anyone so beautiful,” Bucky said, not breaking eye contact as his other hand came to rest on the side of Steve’s face.\n \nSteve sighed happily, eyes fluttering shut for a moment. “Tell me more?”\n \n“I thought you’d be some sort of pretentious all-American dick, but you turned out to be so much better- so much more. I haven’t even begun to figure it out yet.”\n \n“Yeah? You plan to try?”\n \nBucky smirked. “There’s nothing I’d rather do.”\n \nSteve stared at him, lips curling into a tiny smile. Bucky stepped away smugly, ignoring the rush of cold that assaulted his limbs as the contact disappeared. “Told you I can bullshit.”\n \nSteve looked away, clearing his throat. “That you can.”\n \nBucky whacked Steve’s arm playfully. “See? We’ll be totally fine.”\n \nSteve smiled at him, but the expression didn’t reach his eyes. “You’re right.”\n \nBucky went to buy a picture frame for their marriage certificate before Steve drove them back home and they started getting ready for dinner at Sam’s.\n \nBucky started to pace after he’d framed the certificate and set up the record player, but Steve stopped him, grabbing his arm and squeezing lightly.\n \n“We’ll be good.”\n \nBucky let out a breath he hadn’t known he’d been holding.\n \n \n \nSam warmly welcomed them into his house. “Hey, guys! Clint and Natasha are already here. We’re just waiting on Tony, but that’s nothing new. Come on in- I’ll introduce y'all.”\n \nSteve and Bucky followed Sam into a spacious open floor area that contained the kitchen and family room. Sam was cooking something that smelled absolutely heavenly, but Bucky pushed that note aside in favor of examining the two people sitting on the couch.\n \nThe woman was sitting elegantly in the man’s lap, red hair curling tastefully around her face. Her skin was porcelain-pale, her eyes green and sparkling with intelligence. The man whose lap she was sitting on looked like the term “scruffy” personified. Uneven stubble dotted his face, his blonde hair was a mess, and he looked like he’d had his nose recently broken.\n \n“Steve, Bucky, this is Natasha and Clint.”\n \n“Did you get our cookies?” Clint asked, straightening a little bit, eyes lighting up.\n \n“Yes,” Bucky said the same time that Steve said, “Cookies?”\n \nBucky gave Steve a sheepish look. “They dropped cookies on our doorstep, but I ate them all before you got here.”\n \n“Tasha, oh my god, they liked my cookies,” Clint whispered excitedly to Natasha.\n \n“What do you mean, ‘your cookies’?” Natasha asked bemusedly. “You bought them from the bakery.”\n \n“Well, they were delicious,” Bucky said. When both Natasha and Clint looked at him at the same time, Bucky tensed and tucked himself into Steve’s side, trying not to visibly shrink under their gazes.\n \n“Thank you, Bucky,” Clint said smugly, jabbing Natasha in the ribs.\n \nNatasha was studying him curiously. “What kind of name is ‘Bucky’?”\n \nBucky frowned, and Steve gave his shoulders a squeeze. “It’s a nickname. I mean, my real name is Buchanan.”\n \nNatasha arched an eyebrow. “Isn’t ‘Bucky’ kind of a weird stretch from ‘Buchanan’?”\n \nBucky hunched his shoulders while Sam said, “Nat, be nice.”\n \n“She’s just giving you a hard time, bro,” Clint said.\n \nNatasha shrugged, rising gracefully to her feet. “Or am I?” she muttered darkly, but there was a trace of a smile on her lips. She walked over to them and stuck out her hand. “Glad to finally meet you two. And, in case there was any dispute, Clint and I are your best neighbors,” she said as she shook their hands.\n \n“I resent that,” Sam said.\n \n“I’m sure we can find some sort of balance,” Steve said wryly.\n \n“Nope,” Clint piped up. “It’s already decided. Nat and I win indefinitely.”\n \n“What happened to your nose?” Bucky asked him, unable to quell his curiosity.\n \nClint gave a lopsided grin. “I got punched.”\n \n“Oh?”\n \n“It was badass.”\n \nNatasha leaned forward and whispered theatrically, “He punched himself.”\n \nClint frowned. “I distinctly remember the punching, and it was not self-inflicted.”\n \n“He’s trying to make himself look cool.”\n \n“Naaaaaaat,” Clint whined.\n \n“Cliiiiiiiiiint,” Natasha whined back mockingly.\n \nBucky was chuckling to himself by the time Clint heaved to his feet and made his way to Natasha with these wide, puppy-dog eyes. “Idiot,” Natasha muttered fondly before punching him lightly on the bicep.\n \nBucky heard the front door open loudly and felt Steve stiffen against him.\n \n“That’s probably-“ Sam started, but was cut off with a, “TONY STARK IS IN THE BUILDING!”\n \nBucky glanced up at Steve to find his jaw set, eyes sharp with alertness. Bucky grabbed Steve’s hand and laced their fingers together. Steve glanced down at him, and Bucky murmured, “We’re safe.”\n \nSteve nodded, visibly deflating as the guy who was always wearing sunglasses stepped into the room. Said sunglasses were currently perched delicately on his spiky hair. When Tony saw Steve and Bucky, he stopped in the doorway so that Sam bumped into his back. Not noticing, he offered a rakish grin. “New neighbors?”\n \n“Yeah, this is Steve and Bucky,” Sam supplied.\n \n“And you know who I am,” Tony said, finally stepping into the room so that Sam had room to walk around him.\n \n“Why do you always wear sunglasses?” Bucky asked, shifting his weight restlessly.\n \nTony gave him a calculating look. “You been watching me?”\n \nBucky shrugged. “So what if I have?”\n \nTony beamed. “I like you. Which one is he? Steve or Bucky?”\n \n“Bucky.”\n \n“Okay, cool. That’s a weird fucking name-“\n \n“I know,” Natasha grumbled.\n \n“-and it embarrasses me to say it. Got any other nicknames, sweetheart?”\n \nBucky shot a helpless glance at Steve. Steve just rolled his eyes and lifted a shoulder, so Bucky turned back to Tony and deadpanned, “That’s a third date kind of question.”\n \nTony snickered. “Old fashioned, are we?” Before Bucky could say anything, Tony turned to Steve and blinked. “Shit. What percentage of your weight is muscle mass?”\n \nSteve glanced down at his admittedly tight shirt. “Um.”\n \n“I bet it’s like over seventy percent. Hot damn. Buckaroo, you gotta give me a high five for scoring that piece of ass.”\n \nBucky looked at Steve’s blush in amusement before obliging Tony’s high five, but not without a warning, “Don’t objectify my husband.” Tony looked mock offended.\n \n“You guys wanna migrate back to the couches?” Sam asked. “I don’t know about y'all, but I don’t really want to stand around all night.”\n \nAfter they’d settled into the cushions (Steve’s thigh pressed against Bucky’s and the amount of warmth was borderline ridiculous), a small silence stretched forth.\n \n“So, Steve-and-Bucky,” Natasha said, leaning forward to brace her elbows on her knees, “how did you two meet?”\n \nBucky smirked and Steve let out a huff that might have passed as a laugh, both prepared with the story they’d worked out. “Steve knocked into me and spilled his coffee all over me.”\n \n“Lukewarm coffee,” Steve added hastily.\n \nBucky waved a dismissive hand. “And I’m an angry Brooklynite at heart, so I probably cursed at him enough to scandalize a sailor.”\n \n“I disagree with that,” Steve said. “He mostly just looked defeated.”\n \n“In my defense, it was a hard week at work.”\n \nSteve shrugged, swaying so that their shoulders pressed together. “I barely heard anything Bucky was saying. I was kind of distracted-“\n \n“-by the way my shirt was sticking to my skin,” Bucky finished smugly. “Instead of just apologizing like a normal person, Steve offered to buy me a new outfit and take me out for dinner. I agreed to the dinner but not to the outfit.”\n \n“And the rest is history.”\n \nNatasha leaned back, seemingly satisfied. “Dumbasses,” was all she said, though.\n \n“It’s more romantic than how you and Barton met,” Tony interjected.\n \nClint looked highly offended. “What the fuck, man? Nat and I have been adorable from the start.”\n \nNatasha raised an eyebrow. “Clint, you thought I was in the Russian mob.”\n \nClint frowned. “Yeah, and I’m still not convinced that you aren’t.”\n \nNatasha sighed heavily, but her lips started to curl mockingly. “It really is the only explanation for why I married you. I’m obviously a sleeper agent.”\n \nTony laughed. “One day, somebody’s gonna say ‘Rutabaga’ or some shit, and you’re gonna wake up screaming.”\n \nNatasha pointed at Tony in affirmation.\n \nClint scowled. “Fine. I want a divorce so I can marry Sam instead.”\n \nSam pumped his fist in triumph while Natasha grinned. “You’ve got something going on the side?”\n \n“We were gonna tell you, Nat, we swear,” Sam said with faux-solemnity.\n \nClint scooted over on the couch so that he was draped over Sam’s lap, dramatically batting his eyelashes. “At least Sam appreciates my bird obsession.”\n \n“You and your fuckin’ birds,” Natasha scoffed.\n \nClint looked at Steve and Bucky gravely. “This is what I have to deal with.” Sam stroked a hand through Clint’s hair consolingly, and Clint smirked pointedly in Natasha’s direction. Natasha stuck her tongue out.\n \n“As much as I love to watch your weird foreplay, I’m sure new-neighbors aren’t enjoying themselves as much as I am,” Tony said.\n \n“Fuck you, Stark,” Clint whined.\n \n“He does have a point, though,” Sam said, shooting an apologetic glance towards Steve and Bucky. “I probably should’ve warned you about how weird the squad is.”\n \n“No,” Steve said, smiling faintly. “Weird’s good.”\n \n“What brings you two to the suburbs anyway?” Tony asked distractedly, examining his cuticles.\n \nBucky studiously examined the stitch of his jeans, and there was a pause of hesitation before Steve answered. “We needed a break from the city for a little while. We’re both sort of trying to figure ourselves out, and we decided a change of pace could be what we need.”\n \n“I respect that,” Clint said from where he was still lounging across Sam’s lap.\n \n“And what do you guys do for a living?”\n \n“I’m a freelance illustrator,” Steve answered, and Bucky carefully kept the surprise off his face. He’d expected Steve’s cover to be security work or some shit.\n \n“And Buckeye the Rabbit?” Tony asked.\n \n“I consult for the government,” Bucky said, glad to fall back on Fury’s careful instruction.\n \n“Shady,” Natasha said. “I like it.” Bucky saluted her.\n \n“What about you guys?” Steve asked politely.\n \n“I own a gym where we teach self defense, mixed martial arts, and ballet,” Natasha said.\n \nBucky blinked in surprise. “Oh.”\n \n“You boys want lessons?” she asked, eyes sparkling with mirth.\n \n“Actually, we both have professional combat training,” Steve said.\n \nNatasha shrugged. “Doesn’t mean you don’t have nothing to learn, but suit yourselves.”\n \n“I teach a kindergarteners down at the local elementary school,” Clint said, suddenly looking almost serious.\n \n“I did not expect that,” Bucky admitted.\n \n“I’m a very misleading individual,” Clint stage-whispered with a wink. “I’m an enigma.”\n \nBucky snorted, ducking his head towards Steve’s shoulder.\n \n“I’m a therapist at the VA,” Sam told them, letting his hand wander to rest on Clint’s chest as Clint played with Sam’s fingers.\n \n“Wow. That’s awesome,” Bucky said, purposefully ignoring the sudden tension in Steve’s muscles.\n \nTony waved a dismissive hand. “Sam tries too hard to put up an angelic front, and I am convinced he’s secretly a terrible person.”\n \nSam just grinned, wiggling his eyebrows. “Maybe I am, Stark. Maybe I am.”\n \n“And I’m between things right now,” Tony said, “but I dabble in robotic engineering. And mechanical engineering. And computer engineering. And-“\n \n“Are you like a secret genius?” Bucky blurted out.\n \n“Not so secret, Buckaneer.”\n \nBucky frowned at Tony. “You know, making up even more ridiculous nicknames should make you more embarrassed.”\n \n“Nonsense. I’m charming. Squad, tell Brooklyn 9-9 that I’m charming.”\n \nNatasha sat up straighter. “No.”\n \nThings were almost astonishingly comfortable after that. Thanks mostly to Tony, there was never a lapse in conversation, and they mostly told dumb stories about events from the week. By the end of the night, Bucky knew that one of Sam’s clients was getting married in Hawaii, one of the kids at Natasha’s studio had gotten a small part in a Broadway show, one of Tony’s robots (named Dum-E) had started a moderate fire in Tony’s basement, and that Clint had gotten punched because he’d confronted one of his kindergartener’s parents about some suspicious bruising.\n \nBucky didn’t talk much. Any stories he shared were vague and pointless. But Steve talked even less- the only contributions he made were hilariously timed sarcastic comments that had Clint doubled over in laughter and Tony slapping him delightedly on the back. Bucky wondered absently if Steve wasn’t talking because he was afraid of blowing their cover or if he just didn’t have any good stories.\n \nThe thought was too depressing to dwell on for more than a passing instant.\n \nBut Sam’s cooking was to die for.\n \nBucky may be able to survive without Maria’s bagels every day if he could just charm Sam into cooking for them regularly.\n \nWhen he and Steve left for the night, it was with happy smiles and stomachs full of warm food. As they bid everyone farewell, and Sam shut the door behind them, Steve and Bucky turned to each other with matching grins.\n \nThey reached out for a high five at the same time, slapping their hands together with a satisfying noise. “That went so well,” Steve said excitedly. “I can’t believe that went so well.”\n \n“Don’t you do this often?” Bucky asked happily as they made their way back to their house. “Aren’t you a secret agent?”\n \n“Not really,” Steve said, shrugging. “This is only my second undercover gig.”\n \nBucky faltered in surprise. “Then what the hell did you do before?”\n \nSteve looked a little bit uncomfortable. “The term they gave me was ‘terrorism control.’”\n \n“That sounds... ominous.”\n \n“And super classified,” Steve added, giving Bucky a look as they walked inside their house, “so don’t hope for any details.”\n \n“I wasn’t asking,” Bucky said. “But why the sudden shift to undercover work?” he asked, unable to quell his curiosity.\n \nSteve bit his lip, leaning against the counter as Bucky flipped on the lights. “I think they want me to take over the agency one day, and they want me well-versed in all the areas of specialization.”\n \nBucky paused. “So you’re like a really big deal, then.”\n \nSteve made a vague noise. “Depends on who you ask.”\n \n“Well, I’m asking you.”\n \nSteve smiled sadly. “Then, no. I’m not a big deal.”\n \nBucky debated asking about the whole “dangerous” comment from last night, but he thought better of it. They hardly knew each other, and Steve didn’t owe Bucky anything. Plus, Bucky kind of didn’t want to know yet.\n \nSo, he changed the topic instead. “Did you like them?”\n \nSteve didn’t seem surprised by the abrupt shift. “Yeah. They’re good people.”\n \n“Didn’t Sam say he was married?” Bucky wondered aloud. “I haven’t seen anyone else at his house since I’ve gotten here. What do you think is up with that?”\n \n“I dunno,” Steve said. “Maybe they’re on a business trip.”\n \n“Yeah.”\n \n“Did you like them?”\n \n“Huh?”\n \nSteve nudged Bucky with his toe. “Did you like them?” he repeated.\n \n“Oh. Yeah, I did.”\n \n“I think they’ll be good for you.”\n \n“What’s that supposed to mean?”\n \nSteve rolled his eyes. “I don’t want you to become a recluse at twenty-eight.”\n \nBucky ignored the comment, eyes wandering to rest on the pile of envelopes on the counter. “Shit. We forgot to give Tony the letters.”\n \n“We can drop them at his place tomorrow,” Steve said. “I mean, we are neighbors.”\n \n“Alright. Sounds like a good plan.”\n \nThey lapsed into silence as Bucky checked in with the time. It had been thirty-nine days, fourteen hours, and twenty minutes. And Bucky was okay. Bucky was fine. And Steve was here to make sure he didn’t hurt anybody.\n \nTomorrow would mark forty days, and Bucky wondered if he’d ever move past this- if some day he would be able to look at a clock without searching for a specific moment.\n \nBucky wasn’t sure if he wanted to know the answer to that either.\n \n \n \nBucky knocked on Tony’s door with no small amount of trepidation.\n \nSteve was still on his run or whatever by the time Bucky had dragged himself out of bed. Bucky had stared at the neat stack of envelopes for twelve minutes before thinking, Fuck it, and making his way to Tony’s too-big house.\n \nThe door swung open, and Tony barely blinked before he was grabbing Bucky by the shoulders and yanking him inside, muttering, “Thank god, I need a test subject.”\n \nBucky stiffened at the words, but Tony kept shoving him further into the house until he was standing in front of a blank wall. Tony stood back, looking Bucky over critically. “Relax your stance- feet shoulder width apart, hands at your sides. Okay, great. Now, stand still.”\n \nBucky could only mutely follow Tony’s instructions as the man hastily whirled around. He brought his hand into the air, and a blueish projection appeared. Bucky made a noise of surprise, which Tony either didn’t hear or ignored.\n \nTony moved around images with his hands until he seemed to come across a file of sorts that he was looking for. He tapped it, and the projection moved to encase Bucky’s body. “What the fuck!” he screeched as the light conformed to his body, almost like armor.\n \nTony frowned, narrowing his eyes speculatively. “Interesting. Jarvis, fit me with my stuff too.”\n \n“Who the fuck are you talking to?” Bucky asked, irritated now.\n \nTony continued to ignore him as a disembodied voice said, “Of course, sir.”\n \nBucky flinched. “What the fuck?”\n \nMore projections surrounded Tony’s body in the same sort of armor. Tony finally looked at Bucky and actually saw him, lips lifting into a mischievous smile. “Sith or jedi?” he asked.\n \nBucky blinked. “What?”\n \n“You’ve watched Star Wars, right?” Tony asked, almost exasperated. “Do you want to be sith or jedi? Have you ever taken a buzzfeed quiz to figure out which side you’d be on?”\n \n“I mean... yeah?” Bucky said, helplessly confused.\n \n“Good. Then, which?”\n \n“Sith?” Bucky said hesitantly, even though he liked to think he was most similar to Han Solo.\n \n“That makes this so much easier, thank god.” Tony looked at the ceiling. “Engage the simulation, J.”\n \n“Very well, sir,” the disembodied voice said.\n \n“Okay, but who is-“\n \nBucky cut himself off as more projections appeared. He lifted his hand in surprise to see the red lightsaber he was holding.\n \n“Holy shit,” he murmured.\n \n“It’s like a wet dream, isn’t it?” Tony asked bemusedly. When Bucky looked up, he saw that Tony was holding the projection of a blue lightsaber. His expression turned expectant. “Well?”\n \nBucky couldn’t help but grin as he lowered his voice as best as he could. “I have you now.”\n \nTony beamed, raising his lightsaber. “Now we’re getting somewhere.”\n \nBucky raised his own lightsaber, and after a slight pause, they moved forward at the same time, slashing their lightsabers towards each other. When they collided, they made the exact noise that Bucky had expected. “This is insane!”\n \n“Riiiiight?”\n \nThey twirled around each other with playful jabs of the lightsabers. Bucky tried to compose himself into actually playing the role of a sith lord. “Join me, Stark,” he said, pressing forward so that the lightsabers came very close to Tony’s face before Tony managed to deflect the blades. “Together we can rule the galaxy.”\n \nTony swung around, and Bucky barely blocked the saber. “I’ll never join you.”\n \nExperimentally, Bucky backed away and lifted his hand in imitation of the force chokehold. To his utter delight, Tony’s armor lifted him off the ground, and Tony mimed choking as he made these ridiculous gagging noises.\n \nBucky approached him, lightsaber at the ready. “We’re not so different, you and I.”\n \nTony continued pretending to choke as he spat, “I’m nothing like you.”\n \nBucky finally released Tony from the chokehold, and Tony flung out his arm. To Bucky’s shock, he was actually thrown across the room. He landed on his back with an oomf!, and when he looked up, Tony had his lightsaber pointed lethally at Bucky’s throat. He smirked. “Jedis always win, dude.”\n \nTony offered a hand, and Bucky pulled himself to his feet, still smiling. “Eh, whatever. The sith has more fun.”\n \nTony stuck his tongue out before he shouted at the ceiling, “J, play the cantina music on loop.”\n \nSure enough, the song started to resound throughout the house, and Bucky burst into laughter. “This is the best thing that’s ever happened to me,” he declared.\n \nTony shrugged, but Bucky could tell he was pleased. “I’ve had a lot of free time to design meaningless shit like this.”\n \n“It’s not meaningless to me.”\n \nTony gave Bucky an odd look, but it passed after a moment. “I forgot you came here of your own free will. What’s up, Buckster? Also, what’s your full name? I need more nickname fodder.”\n \nBucky rolled his eyes, secretly happy at the teasing. “It’s Buchanan. Buchanan Rogers.” Tony’s eyes lit up as he visibly started to make up new nicknames in his head. “And I’m here to drop off some letters that were addressed to Bruce Banner. Sam said you might want them.”\n \nThe smile dropped off Tony’s face so quickly than Bucky wondered if it was ever there in the first place. “Oh,” he said, sounding like he’d been punched in the throat.\n \nBucky reached to where he’d stuffed the envelopes in the pouch of his sweatshirt, handing them to Tony. He watched as Tony ran his fingers over the address. There was definitely a story there.\n \nBucky was debating whether or not he wanted to risk asking about it before he saw the change in Tony’s face. Something in his eyes faded and hardened so that it looked almost casual as he tossed to envelops carelessly on a nearby table. “Well, I’ll keep those around in case he ever comes back,” Tony said with feigned lightness. “Thanks, Buchananball.”\n \nBucky gave him an unimpressed look.\n \nTony started to grin. “Get it? Like Buchanan and cannonball?”\n \n“I understood the first time,” Bucky deadpanned.\n \nTony actually giggled, and Bucky resisted the urge to sigh in defeat.\n \n“I should head back home. Steve’s probably back from his run by now.”\n \nTony’s giggles increased in intensity. “Did you know-“ he gasped, “-that Angie thinks he’s hot? An old married lesbian woman thinks your husband is hot.”\n \n“I honestly don’t blame her. You’d have to be blind not to think so,” Bucky said candidly.\n \n“I would totally bang your husband,” Tony added, calming down with extreme effort. “Like, anywhere.”\n \n“Aaaaaand you ruined the whole thing,” Bucky grumbled sarcastically.\n \n“Don’t worry, Rogers. I’d bang you too,” Tony said, patting Bucky consolingly on the shoulder. “And not to discredit your hotness or anything, but how did you manage to score the literal Adonis?”\n \nBucky scowled, although there was no heat to it. “Fuck you. Steve thinks I’m charming and shit,” he said indignantly.\n \nTony nodded. “In your own way,” he said, considering.\n \n“The fuck you mean by that?”\n \nTony smirked. “You’re like a pissy raccoon. It’s kind of adorable.”\n \nBucky glared. “I’m not adorable. I’m dangerous.”\n \nTony just laughed. “And you’re a Star Wars geek.”\n \n“That has nothing to do with anything.”\n \n“You’re still holding your lightsaber.”\n \nBucky raised the weapon menacingly. “Don’t make me use the force again.”\n \n“Is that a threat, Darth Rogers?”\n \n“It sure is, Master Stark.”\n \nThe music abruptly shifted from the cantina theme to the imperial march. Bucky didn’t bother to stop the pathetic noise of excitement that he made. Tony looked at the ceiling fondly. “Thanks, J.” And then they were off again, pretending they knew how to duel with lightsabers and shouting random lines from the movies that made no sense in their context but made them laugh all the same.\n \nBucky finally cornered Tony in his kitchen, lightsaber pointed at Tony’s heart and hand raised in threat of the chokehold. “You fool,” he sneered. “You really thought you stood a chance?”\n \nTony smirked and suddenly shouted, “It’s a TRAP!” before he somehow navigated himself out of the corner and slashed down with his lightsaber.\n \nThe projection went through Bucky’s abdomen, and Bucky suppressed his laughter as he heavily collapsed to his knees, clutching at the handle of Tony’s lightsaber.\n \n“Tony,” he pretended to gasp, “I am your father.”\n \n“No. That’s IMPOSSIBLE. NOOOOOOOOOOOO!” Tony shouted theatrically.\n \nThey collapsed into laughter, both of them sinking completely to the floor as the simulation faded, making the armor and lightsabers disappear.\n \n“Man,” Tony breathed, “you made that so much more fun than anyone else. Nat takes it too seriously and always beats me up. Clint usually falls over himself and stabs himself with the lightsaber. And Sam always worries he’s gonna hurt me. Bro-chanan, we need to do this more often.”\n \n“Thank god,” Bucky said, relieved. “This was awesome, and you’re going to have to explain how it works to me.” Bucky glanced at his watch and felt his stomach twist. “Shit. Steve’s probably worried. I didn’t tell him I was coming over here.” He clambered to his feet, worried that Steve was going to go full FBI mode if Bucky didn’t get back to the house soon.\n \n“Awwwww, he’s overprotective,” Tony crooned, batting his eyelashes.\n \n“Fuck you.”\n \nTony winked and Bucky snorted.\n \nAfter he finally left, Bucky hurried back to the house to find Steve aggressively cleaning the microwave.\n \n“Um,” Bucky said.\n \nSteve jolted, straightening so fast that Bucky winced in sympathy for his back muscles. He whirled around, looking harried as he mumbled, “Sorry. Where were you?”\n \nBucky cocked his head. “Dropping Bruce Banner’s mail off at Tony’s. We got distracted.”\n \nSteve raised an eyebrow but didn’t ask. Bucky didn’t explain, mostly because he knew he’d get annoyed when Steve inevitably didn’t appreciate the awesomeness behind Tony’s simulation.\n \n“I was a little worried,” Steve finally admitted, gesturing self-deprecatingly towards the microwave. “Hence the cleaning.”\n \n“Sorry,” Bucky murmured sheepishly. “I didn’t mean to be gone that long.”\n \n“It’s okay,” Steve said earnestly. “I didn’t go into full panic mode, so all is well.”\n \n“How was your run?”\n \nSteve smiled, eyes crinkling happily. “It was great. This morning I guess Sam was running at the same time, and I totally beat him.”\n \nBucky looked at him. “Stevie, running isn’t a competition.”\n \n“Not with that attitude,” Steve insisted stubbornly. “Sam seemed to have fun with it anyway.”\n \n“Yeah, I’m sure getting passed and laughed at is a perfectly fun time.”\n \nSteve laughed softly. “It was funny,” he insisted.\n \n“And you’re kind of an asshole,” Bucky said. “Should I be disturbed that this doesn’t surprise me at all?”\n \nSteve just winked.\n \n“I knew that boy scout aesthetic was just a front.”\n \nSteve frowned. “I actually would hope that you wouldn’t think of it as a ‘boy scout’ aesthetic. I have a few admittedly unpleasant things to say about boy scouts.”\n \nBucky shook his head. “Are you even real?”\n \n“They’re homophobes, Buck,” Steve said, crossing his arms. “It’s the twenty-first century.”\n \n“Holy fuck,” Bucky sighed.\n \n“And just because-“\n \nBucky held up both hands in peace. “Whoa, I’m not trying to argue with you. You don’t have to convince me or anything.”\n \nSteve let out a breath before ducking his head in embarrassment. “Ah.”\n \nBucky chuckled. “I’m glad you’ve got strong opinions.”\n \n“Careful,” Steve said warningly. “Don’t speak too soon.” But his eyes were sparkling.\n \n“Stevie, I will gladly listen to you rant about justice to the boy scouts,” Bucky said, holding up his right hand as if taking an oath.\n \n“That’s highly reassuring. I can go off on a lot of tangents.”\n \nBucky walked over to the refrigerator to find that its contents had been depleted to a half-finished beer, a single apple, and a small package of cheese. He groaned, letting his forehead thunk to rest on the door.\n \n“What?” Steve asked.\n \nBucky turned around, kicking the refrigerator shut. “We’ve gotta go to the grocery store. Or, I mean, I can go by myself or whatever.”\n \n“I can come,” Steve said with a hesitant smile. “I don’t want us to be strangers the whole time we’re here. That’d be awkward.”\n \nBucky tried to hide his relief. “Oh. That’s- that’s good.”\n \nSteve’s smile brightened. Bucky decided that it was a good look on him.\n \n“Grocery store?”\n \nSteve nodded. “Grocery store.”\n \n \n \nBucky glared contemptuously at the store-brand bagels.\n \nSteve wandered towards him, holding a carton of milk. “I wasn’t sure what type of milk you like, so I just got 1%,” Steve said, carefully placing it inside their cart. Then he seemed to notice Bucky’s attention towards the bagels. “Um. What are you doing?”\n \nBucky scowled. “They’re taunting me.”\n \n“The- the bagels?”\n \nBucky turned his glare on Steve. “I only have two good ones left, Steve. They’re laughing in my face. They know that as soon as I run out of the ones from Maria’s Deli, I’m going to have to deal with them,” he said, jabbing a finger in the direction of the bagels.\n \nSteve was trying not to smile. “Buck, I could always take a day-trip to Brooklyn and grab you more bagels.”\n \nBucky’s eyes widened. “Don’t tease me, Steve.”\n \n“I would never do that,” Steve said with a faint, almost private, smile.\n \n“Steve,” Bucky sighed. “How are you even real? Screw knights in shining armor. I’ll settle for blondes in tacky khakis any day.”\n \n“They’re not tacky.”\n \n“Sure.”\n \nSteve bumped their shoulders together. “What else do we need?”\n \nBucky glanced at the half-full cart. “Eggs, ice cream, cookie dough, some more veggies, and probably some coffee things.”\n \n“Probably some pasta sauce too,” Steve mused, dropping his chin onto Bucky’s shoulder in a way that looked casual but felt very deliberate.\n \nBucky batted him away, tossing a grin at him. “Keep your hands to yourself, Rogers.”\n \nSteve rolled his eyes as he drew away. “Is this just because you don’t want the bagels to know you’re seeing someone else?”\n \n“Those bagels can know whatever the hell they want. I’m just trying to keep our focus centered on the mission.”\n \n“The mission?”\n \n“Yes,” Bucky said impatiently. “Standard retrieval op.”\n \nSteve smothered a laugh, playing along. “Potential hostiles. Extraction imminent.”\n \n“Affirmative. Time is of the essence.”\n \nThey finished grocery shopping with remarkable efficiency. If there was a reward for efficient grocery shopping, it would totally go to Steve and Bucky. We make a good team, Bucky thought before he cringed at the dreamy tone of his internal monologue and tried to forget the thought had ever existed.\n \nWhen they got back to the house, Steve went into his room to finish making himself at home. Bucky turned on the TV and started watching the show about weird houses that he was vigorously pretending he wasn’t addicted to.\n \nThe best part was that while he watched the dumb (thrilling) house show, he got to snack on a bag of cookies.\n \nCookies were important to maintain temporary happiness.\n \nMission: success.\n \n \n \n\n“What do you remember?” a man with an arctic smile asked as he blinked slowly.\n\n\n \n\n\nHe was silent.\n\n\n \n\n\n“What do you remember?” Arctic Smile repeated impatiently.\n\n\n \n\n\nWhen he did not say anything, Arctic Smile hit him so hard that his teeth tore his mouth. He tasted blood. But he shook his head. His mind was a yawning chasm. He could not answer even if Arctic Smile was watching him intently.\n\n\n \n\n\n“Your name?”\n\n\n \n\n\nHe shook his head.\n\n\n \n\n\n“Your sister?”\n\n\n \n\n\nHe shook his head. He did not know he had a sister.\n\n\n \n\n\nArctic Smile sat back, triumph flashing through his cold eyes. Then he leaned forward. “That’s okay. You belong to me now. You are the Soldier. You are a patriot.”\n\n\n \n\n\nThe Soldier clung to the feeble sense of identity as soon as it was given. “And?” the Soldier said, and his voice was raw, as if he had been screaming.\n\n\n \n\n\n“And I have a mission for you.”\n\n \nBucky startled awake with a pained gasp.\n \nThe icy color Alexander Pierce’s eyes stained his vision as he fumbled for his watch with shaking fingers. Bucky catalogued everything he’d done for the past twenty-four hours. Lightsaber fighting with Tony. Grocery shopping with Steve. Dumb house show. Tentative dinner with Steve. More house show. Sleep.\n \nIt had been forty days, seventeen hours, and fifty-four minutes.\n \nBucky forced his muscles to tense and relax. When he still felt like his skin was crawling, he climbed out of bed with a sigh and padded quietly downstairs, remembering yesterday’s genius purchase of ice cream.\n \nHe stopped in his tracks when he saw Steve sitting on the floor with his back to the wall, positioned so that he could see the front door, the stairs, and the living room at the same time. He was looking at Bucky. “Hey.”\n \nBucky licked his dry lips. “Hi,” he whispered, hoping his voice sounded steady.\n \nSteve deliberately turned his attention from Bucky to the gun in his lap. He started to slowly clean it, and Bucky finally allowed his feet to carry him into the kitchen to retrieve the ice cream with quavering movements.\n \nBucky hesitantly walked towards Steve, clutching his spoon so tightly that his knuckles had turned white. “Couldn’t sleep?”\n \nSteve smiled humorlessly, the dark circles under his eyes more pronounced than ever. “Something like that.”\n \nThe room went quiet, and Bucky gingerly sat down a few feet away from Steve, cradling the carton of ice cream in his lap.\n \n“Nightmares?” Steve finally asked.\n \nBucky stilled until he found the courage to shoot a glance at Steve. “Something like that.”\n \nSteve huffed out a small breath. An extremely optimistic person could have compared that noise to an approximation of a laugh. But Bucky was not even slightly optimistic, and to him the noise sounded bitter and tired.\n \nThey fell into the silence of suburbia at night.\n \nSuburbia was haunting in comparison to Brooklyn. The quiet was jarring, the darkness was disorienting, the soft noises of nature were eerie, and the very air reminded Bucky of a hibernating bear. There was something about the atmosphere that was both oppressive and isolating.\n \nBucky couldn’t decide if he liked it or not, but the contrast made it even more difficult to relax at night than it would’ve been.\n \nBut as Steve cleaned his gun and Bucky ate his ice cream, the stillness felt appropriate.\n \n“You know,” Steve said quietly, not looking at Bucky, “you could always talk to me about it.”\n \nBucky arched an eyebrow. “Yeah. Likewise.”\n \nSteve looked up sharply, eyes narrowed so that his expression clearly said, Not happening.\n \nBucky tried for a smirk and probably failed. “Exactly.”\n \nSteve watched Bucky for another moment before he turned back to his gun. “Fair enough. I guess I see your point.” He tried for a smile that looked more like a grimace. “But I do not see your point in choosing that flavor of ice cream.”\n \nBucky gratefully latched onto the conversation. “That’s because you have no taste.”\n \n“How do I have no taste?” Steve asked indignantly.\n \n“Exhibit A,” Bucky said, gesturing to Steve’s pajama pants.\n \nSteve looked down at his dinosaur pjs. “This was a gift from a friend.”\n \n“It’s not even the dinosaurs that are the problem,” Bucky said as if Steve had never replied. “It’s the fact that the background is a rainbow gradient.”\n \n“They’re supposed to be ironic.”\n \n“I assumed that as a fake freelance illustrator-“\n \nSteve seemingly choked on his next breath of air and coughed. “Erm. I actually do have a portfolio for it.”\n \nBucky stared at him. “For real?”\n \nSteve rubbed the back of his neck. “I went to art school in my free time,” Steve said quietly. “It was something to make me feel normal. It comes in handy for deep undercover missions.”\n \nBucky wasn’t entirely sure what he was supposed to say, so he just went with, “You’ll have to show me some of your stuff some time.”\n \nSteve made a noncommittal noise, placing his gun on his thigh before he extracted another one that had evidently been wedged between his back and the wall. Bucky tried not to think about the potential dangers of that. “You got your degree in criminal psychology, right?”\n \n“Yeah.”\n \n“That’s good. Useful.”\n \nBucky scoffed. “Sure did me a lot of use.”\n \nSteve leveled him with a look. “Buck. You uncovered the criminal underground of New York City after a month of investigation. I’d say that’s very useful.”\n \nBucky glared, stabbing violently into his ice cream. “You know what I meant.”\n \n“Yeah, but I’m just saying a lot of good came out of your investigation too. We have the upper hand thanks to you.”\n \n“They still haven’t caught anyone?” Bucky asked, scared to hear the answer.\n \nSteve pursed his lips. “Still only Jasper Sitwell’s body.”\n \n“Well. Can’t get caught if you’re dead.”\n \nSteve visibly shrank in on himself. “Right.”\n \n“We go back to normal when they arrest Alexander Pierce, right?” Bucky asked, twirling his spoon absently. “You go back to the agency and I go back home?”\n \n“If there are no complications.”\n \nBucky frowned. “Complications,” he echoed.\n \n“You know that we don’t usually do this, right? We usually let people adjust to witness protection independently.” Bucky nodded slowly. “The only reason I’m here is because of the uncertain danger of the situation. It’s likely that the criminal organization has the resources to find you again. Not only are we protecting you- we’re also protecting everyone who could be hurt if you’re captured again.”\n \n“Complications,” Bucky repeated numbly, staring at his lap.\n \nSteve kept speaking in that clipped, clinical tone. “We don’t know how far the organization’s reach stretches. We know that they have the drug that impairs your memory. It may not just be Alexander Pierce who needs to be arrested to ensure your safety. There may be other individuals.”\n \nBucky’s hands were shaking again. Objectively, he knew this was a possibility. But he’d been doing so well. His veins hadn’t burned with need for weeks. The addiction had dwindled from a fervency to an ache. He couldn’t go back- not after the bile and the shudders and the sweat and the delusions had ebbed away.\n \n“Steve,” Bucky said, and his voice came out very quietly. “Promise that if they come for me, you’ll kill me.”\n \nSteve looked at him steadily. “No,” he said.\n \nBucky’s hands curled into fists. “I am not going back,” he growled. “I would rather die.”\n \n“I won’t let either of those things happen,” Steve snapped. “I’ve been protecting people my entire life, and I’m not going to stop because of you.”\n \n“It’ll protect more people if you kill me.”\n \n“They aren’t going to take you back, so I won’t have to even consider that option.”\n \n“Goddammit, Steve!” Bucky shouted, voice hoarse. His fingers were digging into his thigh, and Steve had gone very still. “Just promise me.”\n \nSteve’s lips were pressed into a firm line, his body coiled tightly, like a predator laying in wait, or like a prisoner about to be sent to the electric chair. “Promise you what?”\n \n“If they come to take me, and if you can’t stop them,” Bucky began with a snarl, “shoot me in the fucking head.”\n \nThey stared at each other for an indeterminate stretch of time, tense.\n \nThen, “Okay.”\n \nBucky told his hands to stop shaking.\n \n(They didn’t listen.)\n \n“Okay,” Steve said again. “Okay, okay.”\n \nBucky let his head drop to hang between his shoulders. He took a deep, shuddering breath. He stared at his ice cream bowl. He’d bent the spoon over the course of the conversation with how hard he’d been clutching it.\n \n“Hey,” Steve said softly, and Bucky forced himself not to stiffen when Steve’s hand touched his shoulder. “I promise.”\n \nBucky slumped forward, and Steve’s hand stayed where it was.\n \n“Do you- um- want a hug?”\n \nBucky pushed the bowl out of the way and, unable to speak, crawled towards Steve. Steve opened his arms, and Bucky fell into them. Steve felt solid and warm- Bucky wanted to cry.\n \n“I promise,” Steve was murmuring. “I promise I promise I promise.”\n \n“I’m sorry,” Bucky mumbled against Steve’s chest. His fingers had curled into the fabric of Steve’s shirt.\n \n“No, no, I’m sorry. Shouldn’t have brought it up after a nightmare.”\n \nThe worst part was that they weren’t even nightmares- they were memories. Bucky must’ve made a pitiful noise, because Steve made a hushing sound and pulled him closer.\n \nSteve started running his hand up and down Bucky’s back. “Is this okay?” he whispered.\n \nBucky nodded against him. “I don’t think I’ve been hugged since two Christmases ago,” he admitted honestly but immediately regretted it. He hadn’t meant to say that out loud.\n \nSteve stilled. “Last hug I had was with my mom.”\n \n“Is this okay?” Bucky asked, suddenly not sure if Steve was just hugging him out of a weird sense of obligation to comfort regardless of his own boundaries. Because Steve seemed like the type of person who’d do that.\n \n“Yeah. This is. Yeah.”\n \nBucky relaxed. “Good.”\n \nThey stayed like that for what was probably too long to be socially acceptable. But fuck that. They were technically married. It didn’t matter if they’d only met roughly three days ago (less than that).\n \nBucky was the one to pull back, running a hand through his tangled hair. “Hey, Stevie?” he said.\n \nSteve smiled at him, and Bucky thought he saw a little bit of fondness there, but he was probably imagining things. “Yeah, Buck?”\n \n“When do you want to watch Star Wars?”\n \nSteve was startled into a laugh.\n \nBucky smiled, delighting in the reaction, but after a minute the smile faded.\n \n“No, seriously.”\n \nSteve looked at him. “Do you want to show me Star Wars right now?” he asked resignedly.\n \nBucky clambered to his feet by way of answer.\n \n \n \n“Episode V now?” Bucky asked hopefully, making sure he was using his puppy eyes.\n \nSteve stood, and his back muscles popped audibly. Bucky cringed. “Gimme a little bit of time to let it sink in first.”\n \nBucky pouted. “That means a lot later.”\n \n“Maybe we can do one a day?” Steve suggested.\n \nBucky frowned. “You didn’t like it.”\n \nSteve shook his head. “No, Buck, no, the movie was great. It was. It’s just content-heavy. It’s a lot to take in.”\n \nBucky eyed Steve skeptically.\n \n“I swear.”\n \n“Who was your favorite?”\n \nSteve looked offended to be even asked. “Princess Leia. Duh.”\n \n“Mine’s Han Solo,” Bucky said, pacified for the moment.\n \n“Why am I not surprised?”\n \n“I dunno. Han and I are both ruggedly attractive men,” Bucky replied with a shrug.\n \nSteve’s eyes had that glint of mischief again. “You’re also both whiny drama queens.”\n \nBucky blinked. “I resent that.”\n \nSteve just smiled. “I’m going for a run.”\n \nBucky made a derisive noise. “That’ll kill you some day.”\n \n“Relax, you jerk. I won’t be gone long.”\n \n“I’ll be sure not to burn the house down in your absence,” Bucky said dryly.\n \nSteve sighed heavily, and Bucky had to bite down on a smile.\n \nMaybe this wouldn’t be as bad as he’d initially thought.\n \n \n \nBucky was leafing through envelopes, leaning against the mailbox, when Clint and Natasha walked up to him, a large dog in tow.\n \nClint was waving madly as if they weren’t the only people on the street. “Hey! Hey, Bucky! Hey!”\n \nAt a more normal volume, Natasha said, “Buchanan.”\n \n“Hi,” Bucky said as they approached, smiling and nodding in the direction of the dog. “You have a dog.”\n \nClint frowned. “No we don’t.”\n \nBucky knelt down and scratched the dog’s ears, inspecting the collar with a raised eyebrow. “Oh? So who named him Lucky and bought him a collar?”\n \nClint blinked. “Me?”\n \n“So it’s your dog.”\n \n“No. He just hangs around. I don’t like to think of it as ownership.”\n \nBucky glanced at Natasha, who looked vaguely bored. “I think you’re in denial,” Bucky said.\n \nLucky made a dog noise, and Bucky resumed petting him.\n \nClint laughed. “You think this is bad? You should see Nat with her cat.”\n \n“I don’t have a cat.”\n \n“See?” Clint said, grinning. “Her name is Liho and we love her very much.”\n \nNatasha lifted a shoulder. “She’s better company than you.”\n \n“Lucky and Liho?” Bucky asked bemusedly. “They get along?”\n \n“The only thing Liho likes in this world is Nat,” Clint said, rolling up his sleeve to show a scabbed area on his forearm that looked suspiciously like cat claws.\n \nNatasha smiled. “That cat is good for one thing.”\n \n“Aw, come on, Tasha.”\n \n“I’m being serious,” Natasha said, and her eyes were crinkled with happiness.\n \n“You never know true fear until you remember Liho is in the room while you’re having sex,” Clint said solemnly to Bucky.\n \nBucky cringed. “Too much, Clint.”\n \n“I have a scar on my dick.”\n \nBucky was increasingly alarmed. “Please do not show me.”\n \nClint smiled widely, reaching for his waistband. “Sorry, I’m deaf. Did you just say, ‘Please show me’?”\n \nBucky clapped his hands over his eyes while Natasha laughed.\n \n“Eh, you couldn’t handle my dick anyway,” Clint said dismissively. “You’d leave Steve in a heartbeat, and I’m only a home wrecker on workdays and special occasions.”\n \nBucky rolled his eyes. “I highly doubt you have anything on Steve’s dick.” (Not that Bucky had spent time thinking about Steve’s dick or anything.)\n \n“Want me to get the measuring tape, boys? I’ll watch,” Natasha said, crossing her arms.\n \nClint laughed, rocking back on his heels. “I’m always down for my wife watching dick contests.”\n \n“I can’t say I disagree,” Natasha mused.\n \n“Hey, Bucky?” Clint said, suddenly looking excited. “Do you think you could talk Steve into coming to my kindergarten class?”\n \n“Um. Why?”\n \n“He’s an illustrator. It may be cool. It’s important to cultivate artistic development, especially at an early age,” Clint explained.\n \n“I don’t think Steve’s ever done something like that before. I can bring it up.”\n \nClint beamed. “Cool.”\n \n“Which reminds me,” Natasha cut in. “What kind of combat training do you boys have? Just curious.”\n \nBucky rubbed the back of his neck. “Uh. Martial arts for the both of us. Mostly self defense based for me and hand-to-hand based for Steve,” Bucky said, glad that this was something he actually knew about Steve from their getting-to-know-you chat.\n \nShe nodded consideringly. “Cool.”\n \nLucky barked, wagging his tale, and Clint’s smile softened. “Yeah, okay, you attention whore.” He looked up at Bucky. “Until we meet again,” he said, batting his eyelashes.\n \n“Ignore him.”\n \n“Maybe next time I’ll show you my dick,” Clint added cheerfully.\n \nBucky laughed. “Yeah, keep dreaming, dollface.”\n \nAs he and Natasha walked away, Natasha reached out and laced their fingers together, Clint leaning down to whisper, “He called me dollface.”\n \n“More like bitch-face,” Natasha teased. Clint laughed.\n \nBucky looked away and headed back inside.\n \n \n“I’m bored,” Bucky announced, flopping dramatically onto the couch next to Steve, purposefully sprawling out in the most ridiculous way possible.\n \nSteve ignored him in favor of continuing his sketch. “That’s nice, Buck.”\n \n“Steve,” Bucky sighed, “I’m bored.”\n \n“So go find something to do.”\n \nBucky groaned, flinging his arms and legs out so that he smacked Steve in the chest and kicked his knee. When Steve didn’t even blink, Bucky quieted down, watching the wrinkle between Steve’s eyebrows as the pencil scratched against the paper. Steve paused to bite on the eraser and then continued. “What’re you drawing?” Bucky asked.\n \nSteve’s eyes flicked up distractedly. “You.”\n \n“Me?”\n \nSteve nodded. “I’m trying to get your hair right.” He turned the sketchbook so that Bucky could see. “It’s difficult.”\n \nBucky blinked at the drawing in shock. “Are you fucking kidding me? That looks exactly like me.”\n \nSteve wrinkled his nose and shook his head, turning the sketchbook back around to rebalance on his knees. “The eyes aren’t quite right and the hair needs work.” Steve gestured vaguely in his direction. “Your hair is sort of a combination between wavy, straight, and tangled. Very interesting, but hard to capture. And your eyes are too expressive to be as dead as they look here,” Steve explained absentmindedly, barely paying attention to Bucky.\n \n“Wow. Somebody did his homework.”\n \n“Fuck off. I’ve had to stare at you for the past week.”\n \nBucky let Steve work at the sketch for another fifteen minutes before he sighed loudly. “Can we watch more Star Wars?” He wasn’t whining. He wasn’t.\n \nSteve’s lips curled. “Fine. Give me ten more minutes.”\n \nBucky made a pleased noise, scrambling to set up the movie. Even though he knew Steve probably wasn’t listening, he started saying, “I’m so excited. The Empire Strikes Back is one of the greatest films ever made, in my humble opinion. Definitely the best of the franchise. The characters are amazing, and the plot really thickens, and the story just evolves in such a satisfying way. And, oh my god, the ending. I can’t wait to see what you think. You may actually want to start Episode VI straight afterwards.”\n \nBucky knew he’d been rambling- mostly to himself, if he was being honest. But he looked up to see Steve watching him with a fond smile. Bucky felt his cheeks heat as Steve said, “You’re kind of a nerd.”\n \nBucky tucked a strand of hair behind his ear. “You ain’t seen nothin’ yet, pal. Wait ‘til I make you watch Lord of the Rings.”\n \nSteve huffed a laugh, putting his sketchbook aside. “Just start the damn movie.”\n \nBucky grinned widely and finished setting up before he joined Steve on the couch, sitting so that they were almost touching. “You’re going to love it.”\n \nAs the movie played, Bucky realized that he wasn’t wearing socks, and the house was cold enough to warrant discomfort. He frowned to himself, debating the course of action. He could run upstairs to grab a blanket or a pair of socks, but that would mean missing Han’s rescue mission for Luke. Not worth it.\n \nBut his toes were freezing.\n \nBucky deliberately shifted so that he was sitting with his back against the arm of the couch. He lifted his feet to rest on the cushions and tried to warm his toes with his hands.\n \nWhich didn’t really work.\n \nHis gaze came to rest on Steve, who always seemed to emanate warmth. The internal struggle that followed was probably melodramatic, but Bucky couldn’t help but agonize over whether or not he should initiate contact.\n \nHe blew out a frustrated breath and threw caution to the wind as he shoved his feet under Steve’s thigh. Steve looked at him in surprise, but Bucky just scowled challengingly.\n \nSteve’s lips quirked slightly, and he turned back to the movie. Bucky couldn’t help but take it as a victory.\n \nFeet warm and the rebel forces being attacked, Bucky sighed contentedly. He burrowed more comfortably into his position so that he was more slumped against the arm of the couch, feet anchored by Steve’s muscular thigh.\n \nJust as Luke was battling Darth Vader in one of the most iconic scenes in cinematographic history, the doorbell rang.\n \nBucky and Steve made twin noises of disappointment, Bucky immediately jabbing the PAUSE button so that Steve wouldn’t miss anything. “I’ll get it,” Bucky grumbled irritably.\n \nSteve gave him a careful once-over and got to his feet with Bucky. “I’ll come.”\n \nBucky scoffed. “Relax. I’m not gonna fall back on murderous tendencies just because someone interrupted what is arguably the best scene in the entire world of cinema.”\n \nSteve did not look convinced. Bucky didn’t really blame him.\n \nBucky stomped to the door and threw it open, distinctly annoyed. Tony and Sam stood on the porch. Tony didn’t even wait for acknowledgement before brushing past Bucky and walking inside, calling, “Love what you’ve done with the place.”\n \nSam offered an apologetic look. “He was bored and insistent. I brought cookies as a consolation.” He held up a tupperware container.\n \nBucky’s eyes zeroed in on the cookies. “Did you make those?”\n \nSam shrugged. “Yeah. It’s a hobby.”\n \nBucky opened the door wider. “Any person with cookies is a person welcome in our home.”\n \nSteve clapped Sam on the back as he came inside. “Buck and I were just watching a movie.”\n \n“Not a movie,” Bucky declared dramatically. “The movie.”\n \nSam looked intrigued. “And what would that-“\n \n“THE EMPIRE STRIKES BACK!” Tony shrieked from the other room. Bucky turned to see him storm back into the foyer. “And you didn’t invite me?!”\n \nSteve smirked at Tony. “Well, we weren’t only watching the movie,” he said lowly.\n \nTony blinked in surprise as Sam guffawed, but the expression quickly morphed into a sneer. “Why, Rogers. You sly dog.” He turned to Bucky. “Please tell me you were roleplaying as Han and Leia.”\n \nBucky groaned. “Please leave.”\n \nSam was grinning toothily, thrusting the cookies in their general direction. “Here, take them. We’ll get out of your hair.”\n \n“But Saaaaaaaaaaam,” Tony whined. “I’m bored.”\n \nSam gave him an unimpressed look. “Dude, there are plenty of other things to do. Come on- we can go make fun of that show about spies.”\n \nTony looked around dejectedly. “Can’t even stick around to watch them have super hot couch sex,” he grumbled. “I miss Bruce. You guys are no fun.”\n \nSam rolled his eyes, looking at Steve and Bucky as Tony stomped towards the door. “Feel free to come over to my place after you finish your movie.”\n \nSteve blushed, and Bucky’s eyes tracked the spread of heat down Steve’s neck. How far did that blush extend?\n \n(Focus, Barnes.)\n \n(*Rogers.)\n \n(Shit. Having a new identity was hard.)\n \n“Thank you for the cookies,” Steve said earnestly, resolutely ignoring the innuendo in Sam’s tone, even though he had been the one to insinuate anything in the first place.\n \n“No problem, man. I made like eighty,” Sam said.\n \nTony huffed. “Sam stress-bakes.”\n \nSam slapped Tony on the arm. “Anyways.” He cast Steve and Bucky another look. “Hope to see you later.”\n \n“Sure,” Bucky said, letting them leave as quickly as they’d entered.\n \nBucky turned back to Steve, who was trying not to laugh.\n \n“Why the hell did you make them think we were having sex with Star Wars as a backdrop?” Bucky asked incredulously.\n \nSteve’s eyes sparkled. “Well-“\n \n“I’m more offended that anyone would think I’d want to focus on something non-Star Wars related while Episode V was on, even if that thing is sex,” Bucky groused.\n \nSteve grinned. “Star Wars trumps sex, huh?”\n \n“Of course it does!”\n \nSteve shook his head as if to say, Unbelievable.\n \n“But seriously, why?”\n \nSteve shrugged. “I kinda just wanted to watch the movie with you. Bringing up sex made them leave fast.”\n \nBucky tried to hide the fact that he was floored that Steve wanted to spend time with him. “I thought you liked them.”\n \n“I do. I just want to spend time with you right now. They’re available later.”\n \nBucky looked at the floor, smothering a smile. “Good,” he mumbled faintly.\n \nThey settled back into their previous position on the couch, Steve not even blinking when Bucky stuck his feet under his leg.\n \nSteve’s reaction to the “I am your father” line was epic. His eyes widened in sudden understanding, a grin breaking across his features. “I think I’ve heard that somewhere before,” he said sarcastically, and Bucky snorted despite himself.\n \nBut Steve’s favorite part was the “I love you”/”I know” moment. He actually let out a tragic coo at the scene, pouting adorably.\n \nBucky decided he liked watching movies with Steve.\n \nWhen the credits started to roll, Bucky was greeted with Steve’s small but genuine smile.\n \n“Episode VI?” Bucky asked tentatively.\n \nSteve laughed. “After we hang out with Sam and Tony. But tonight, yeah.”\n \nBucky counted it as a win.\n \nBefore they left for Sam’s house, Steve grabbed Bucky by the shoulders and regarded him speculatively.\n \n“Um?” Bucky said.\n \nSteve looked at him in that analytical way for another moment before he refocused on Bucky. “Can I give you a hickey?”\n \nBucky’s jaw actually dropped. “What.”\n \nSteve colored a little bit, but raised his chin with defiance. “They think we were just having sex. I think a hickey would be appropriate to sell the idea.”\n \n“Why do I have to be the one with the hickey?” Bucky asked. He couldn’t believe this was an actual conversation he was having.\n \nSteve frowned to himself. “You know how I was experimented on?” Bucky nodded. “I told you there were side effects. I don’t really bruise.”\n \n“Oh,” Bucky said, feeling a little bit dumb.\n \n“You don’t have to say yes,” Steve assured him.\n \nBut now Bucky was taking it as a challenge. He met Steve’s gaze with determination. “To hell with it. We’re married and shit. Give me a hickey.”\n \nSteve smiled a little bit. “Alright. Here goes.”\n \n“Here goes,” Bucky echoed, tipping his head back to give Steve access to his neck.\n \nSteve took a tiny step forward so that there chests were touching before he dipped his head down and pressed his lips to a particularly sensitive spot on Bucky’s neck. Bucky sucked in a sharp breath as Steve sucked the skin into his mouth.\n \nAnd then Steve bit down, and a spike of heat went straight to Bucky’s groin. He stifled a groan, hands twitching. Before he could stop himself, he threaded his fingers through Steve’s hair and pulled him in harder. Steve made a humming noise against his neck and worked the skin between his teeth for another moment before easing back, soothing the pleasant sting by licking over the spot.\n \nWhen Steve pulled back, he looked too smug for Bucky’s liking. Thanks to Bucky, Steve’s hair was now sticking up badly, and the redness of his lips made him look almost debauched. “Well,” he mused (and yep- his tone was definitely smug), “that’s a hickey.”\n \nBucky tried to remember how to use his vocal chords. “That’s, uh- that’s one way about it,” he agreed weakly.\n \nSteve snorted, cocking his head to scrutinize the bruise that Bucky could feel developing. “Do you think one’s enough to convince them?” he asked, absently stroking his thumb over the hickey.\n \nBucky tried not to shiver but probably failed. “Um. I dunno.”\n \nSteve thought for a moment. “Maybe one on your collarbone wouldn’t hurt.”\n \n“I think they’re supposed to hurt a little,” Bucky shot back, trying to find his wit as his brain continued to melt.\n \n“Very funny. You want another one?”\n \nBucky swallowed heavily. “Uh. Sure.”\n \nSteve leaned down and started sucking another mark into Bucky’s collarbone. Bucky let his eyes flutter shut as he gave into the impulse to tug at the strands of Steve’s hair (in his defense, Steve didn’t seem exactly opposed to the idea the last time Bucky did it). Steve was gripping his shoulder with one hand and letting the other run down his back. Bucky sighed as Steve alternated between biting and sucking until Steve finally pulled away again, and Bucky forced himself back to the present.\n \nHe hoped his eyes didn’t look too glazed.\n \nJudging by Steve’s self-satisfied smirk, Bucky probably wasn’t succeeding.\n \nSteve grabbed Bucky’s hand and tugged him towards the door. “Um. Your hair’s all messed up,” Bucky managed before they stepped outside.\n \nSteve looked at Bucky mischievously. “I know,” he whispered and continued pulling Bucky out of the house.\n \nHow was this guy even real?\n \nAs Steve knocked on Sam’s door, Bucky let his fingers ghost over the bruise on his collarbone, urging his mind to remove itself from the gutter.\n \nWhich proved exceedingly difficult as Steve leaned against Bucky’s side with all his warmth and muscles.\n \nBucky bit his lip, suddenly interested in the ground.\n \nThis was stupid.\n \nWhy did his secret agent fake husband have to be so hot? And adorable? How could someone even be hot and adorable at the same time? Unfair.\n \nBefore the whole incident with the memory drug and becoming a tool of the criminal underground, Bucky had been a social guy. He’d been social in the sense that he’d been good at flirting with strangers, good at making acquaintances, and good at interacting with a lot of people at once.\n \nHe was antisocial in the sense that his deeper relationships were few and far between. He’d loved his sister and his parents, but they were the only people he’d had for a long, long time.\n \nJames had been used to interacting with attractive people and getting them to spend the night.\n \nBut Bucky hadn’t bothered to even make small talk with anyone until Steve had shown up. Bucky’s intention had been to get through the witness protection program with his head down as misery quietly ate as his heart. But Steve was completely uprooting that plan with his willingness to interact with the neighbors and his determination to become Bucky’s friend. So in addition Steve’s incredible physique, he was kind and dorky and maybe just as messed up as Bucky.\n \nBucky didn’t really know what his feelings were doing. He hadn’t developed romantic attraction for anyone since college. He knew Steve was one of the hottest people he’d ever met. But seeing him smile also made Bucky feel a little bit fuzzy on the inside.\n \nHe had forced himself not to give the feelings much thought.\n \nBut... maybe Bucky had a teeny-tiny crush.\n \nJust a smidge of a crush.\n \nReally, an insignificant speck of a crush.\n \nA fetus of a crush.\n \nInconsequential, really.\n \nBucky pulled himself out of his thoughts when Tony opened the door. His eyes flicked from Steve’s mussed hair to Bucky’s hickeys, and he broke into a huge grin. “Well, well, well,” he sang delightedly.\n \n“What?” Steve said innocently. Bucky glanced at his too-earnest expression and thought, You little shit. His inner monologue sounded startlingly fond.\n \nSam wandered towards them. “Hey, fellas. Tony’s turning my coffee machine into a robot.”\n \n“A coffee robot,” Tony added, still eying Bucky’s hickeys and twirling a screwdriver absently.\n \n“That seems highly unnecessary,” Bucky noted, meeting Tony’s gaze. Tony raised his eyebrows questioningly, and Bucky let a slow smirk spread across his features as he deliberately ran a hand down Steve’s back.\n \nSteve leaned into the touch.\n \n“It’s super important for Sam’s sanity,” Tony argued. “It’ll be awesome.”\n \nSam sighed in resignation. “I’ve accepted my fate.”\n \nTony stepped aside with a flourish. “Come in.”\n \n“Not like this is my house or anything,” Sam grumbled sarcastically as Steve and Bucky stepped into the foyer. “How was Star Wars?” he asked them with a knowing look to his eye.\n \n“Epic,” Steve informed him, reaching over to circle his fingers around Bucky’s wrist.\n \n“I’d stress to say it was even orgasmic,” Bucky added, trying to sound coy.\n \nTony laughed as Sam shook his head.\n \nBucky tried to think about the last time he’d gotten laid. It had definitely been over four months. Jesus.\n \nThere was a beeping noise from the kitchen that sounded fairly urgent, and Tony turned and ran, yelling indistinctly about “coffee” and “robotics” and “loose wire.”\n \nSam looked at them. “I should probably make sure my kitchen isn’t burning down.” He sounded pretty defeated.\n \nThey followed him into the kitchen to see Tony frantically digging through the coffee maker’s circuitry, muttering incoherently to himself.\n \n“Everything okay?” Sam asked.\n \n“Totally!” Tony said, sounding vaguely panicked.\n \nBucky and Steve exchanged glances.\n \n“Uh-huh,” Sam said, unimpressed.\n \n“Everything’s fine,” Tony declared confidently just as the coffee maker burst into flames.\n \nSteve started laughing, and Bucky said, “You can create a hyper-realistic lightsaber simulation, but you can’t keep a coffee maker from combusting?”\n \nTony scowled, rushing over to run the machine under water. “I’m working on it.”\n \nSteve looked at Bucky. “Lightsaber simulation?”\n \n“Your boy-toy is an amazing sith lord,” Tony said.\n \nBucky shrugged.\n \n“Tony gets bored,” Sam explained. “He gets bored and creates weird shit.”\n \nThey hung out in the kitchen as Tony started to dismantle the blender while still participating avidly in conversation. They eventually migrated to the living room (Tony brought the blender) so they could sit down and chat.\n \nIt was good company.\n \nSam excused himself for a moment to start working on dinner, and a moment later, Tony distractedly got to his feet, muttering about needing a smaller screwdriver.\n \nBucky puffed out a sigh and let his head drop onto Steve’s shoulder. Steve brought a hand up to pat his cheek. “You okay, soldier?”\n \nBucky tried not to stiffen at being called soldier again. “Yeah, I’m good. You?”\n \n“Having fun,” Steve said, sounding slightly surprised. “I didn’t really expect this to be fun.”\n \nBucky frowned. “Body guarding a reformed assassin?” he asked, dropping his voice to a whisper so that only Steve could hear. “I don’t know what you considered fun before, but I consider that a blast,” he said sarcastically.\n \nSteve sighed. “You know that’s not what I meant.”\n \n“Oh? Then what did you mean?”\n \nSteve pulled away to face Bucky, giving him a look. “We can talk about this later. Why don’t you go check on Sam and Tony?”\n \n“Fine,” Bucky muttered, getting to his feet and silently approaching the kitchen.\n \nWhen he heard hushed voices, he reflexively stopped in his tracks to listen.\n \n“...word on him?”\n \nSam sighed. “Tony, you know I haven’t found him yet.”\n \nTony let out a frustrated noise. “How can someone disappear so completely?”\n \nThere was an awkward pause. “You may have to accept the fact that Bruce probably isn’t coming back.”\n \n“Oh, yeah? Just like Riley isn’t coming back?”\n \nThere was a tense pause before Sam said quietly, “I don’t want to talk about this.”\n \n“Maybe he left you because he got sick of you always babying him,” Tony went on harshly.\n \n“Maybe we don’t know the full story,” Sam snapped. “Maybe Riley wants to come home. Maybe he can’t.”\n \n“Just like Bruce wants to come home?” Tony practically snarled.\n \n“Maybe Bruce doesn’t want to be found.”\n \nBucky came back to himself guiltily. This was obviously an extremely personal conversation. He walked into the kitchen as casually as possible, disregarding the tense atmosphere. “Hey, fellas,” Bucky said with false cheer.\n \nTony thrust the blender towards Bucky. “I made the blender a robot that is also an alarm system.”\n \n“Why?”\n \nTony shrugged. “I was bored.”\n \nSam carefully turned towards the stove so that his back was to them. Bucky kept him in his peripheral as Sam took a few deep breaths, his shoulders knotted with tension. The ony indication that Tony was less than fine was the tight sorrow in his eyes.\n \nSteve wandered into the room. “Everything okay?” he asked casually.\n \nBucky shot him a look, and Steve raised his eyebrows in question. Bucky tried to communicate an expression that said, Later.\n \n“I made a blender robot,” Tony announced again.\n \n“Fabulous.”\n \n“I know, right?”\n \nSam turned around, and nobody acknowledged how strained his smile seemed. “Anybody feel like staying for dinner?”\n \n“I should get going,” Tony said. “I’ve got lots of important shit to do.”\n \nSam pursed his lips but said nothing.\n \nSteve and Bucky ended up staying for dinner, Bucky watching as the tension in Sam’s face finally began to relax and his smiles and laughs came more freely. It was gratifying.\n \nBucky felt good about leaving Sam alone by the time the meal was finished, so he and Steve headed back to the house.\n \n“What happened?” Steve asked immediately.\n \nBucky frowned, debating whether or not it was his information to tell. “I overheard Sam and Tony talking...”\n \nSteve looked at him expectantly, and Bucky’s shoulders slumped as he realized that he could trust Steve to keep this between them.\n \n“So, you know how the guy who used to live in this house basically dropped off the face of the Earth?” Steve nodded. “Well, Tony and Sam haven’t been able to find him. And- get this- Sam’s husband disappeared too.”\n \nA crease appeared between Steve’s brows. “That’s not ominous at all.”\n \n“Get a hold of yourself. I don’t know if it’s anything crime-related. I’d bet on normal domestic disputes,” Bucky said dismissively.\n \n“What if they were kidnapped, though?” Steve demanded seriously.\n \nBucky shrugged. “It’s not our place to interfere.”\n \nSteve watched him with narrowed eyes. “I’m keeping an eye on this situation,” he said finally.\n \nBucky sighed. “Fine.”\n \nSteve tried for a smile. “Return of the Jedi?”\n \nBucky visibly lit up.\n \n \n \n\nThe Soldier stared down at his bloody hands.\n\n\n \n\n\nThe mission had been straightforward. He was to terminate the target and make it look like a suicide. But the target had been stronger than initial reports suggested. There had been a struggle, and the termination had been messier than intended.\n\n\n \n\n\nThe Soldier’s hands started to tremble as the fog around his mind wavered.\n\n\n \n\n\nThe Soldier- no. James. His name was James.\n\n\n \n\n\nAlexander Pierce gazed at him with displeasure, tapping a needle idly against his fingertips. “Mission failure, I take it?” he said wryly.\n\n\n \n\n\nJames wanted to scream.\n\n\n \n\n\nHe struggled wildly, thrashing his limbs out, as Pierce readied the needle and jabbed it into his forearm.\n\n\n \n\n\nThe fog in his mind returned full-force after a futile moment of resistance.\n\n\n \n\n\n“What is the last thing you remember?” Arctic Smile asked.\n\n\n \n\n\nThe Soldier said nothing.\n\n \nBucky woke up with a muffled scream, biting down hard on his thumb to keep the sound somewhat contained.\n \nHe tried to breathe, but his chest was heaving, and he was shaking all over. He had to get out of here- the walls were closing in and the air was turning to lead and-\n \nBucky threw himself out of bed and stumbled downstairs, hugging his arms around himself to keep the pieces of his body together.\n \n“Bucky?” Steve whispered, rising to his feet from his usual position by the wall. Of course he was there. “Bucky, what happened?”\n \nBucky choked on a sob, shaking his head rapidly. He couldn’t breathe. He had to get out of this house or he was going to explode.\n \nSteve approached him slowly, his hands held up peaceably. “What happened?” he asked again, voice soft.\n \nBucky flung an arm out in warning. “Don’t touch me,” he gasped. “Don’t come near me.”\n \nSteve faltered. “What?”\n \n“I may-“ he managed, “I may hurt- I may kill-“\n \n“You won’t,” Steve said, taking another step forward.\n \n“I said stay away!” Bucky shouted, stepping forward to shove Steve’s shoulders.\n \nSteve staggered a step backwards, posture changing from vulnerable to militant in a second flat. “Stand down, soldier,” he snapped.\n \nBucky stilled, his mind whirring to a halt. “Do not call me that,” he growled lowly.\n \nSteve blinked, as if only just remembering himself. “I-“ he began.\n \n“Don’t ever call me that!” Bucky shoved past Steve and stalked towards the door.\n \n“Buck- where are you going? What-?”\n \n“Outside,” Bucky replied gruffly. “Leave me the fuck alone.” And he slammed the door behind him.\n \nBucky stood on the porch for a moment, taking deep, shuddering breaths. When he felt slightly more composed, he wandered across the lawn and sat down on the curb dropping his head into his hands.\n \nHe felt ashamed.\n \nBefore he could sink too deeply in his misery, Bucky heard the crunch of footsteps approaching and looked up.\n \nA teenage girl stood before him, hands on her hips. “Hi. I’m Kate Bishop, your next-door neighbor,” she informed him before sitting down on the curb next to him without asking.\n \nBucky glanced around, bewildered, before he asked in a croaking voice, “What time is it?”\n \nKate pulled her phone out of her pocket. “5:37.”\n \nBucky took note of her backpack. “You’re going to school.”\n \nKate nodded. “Yep. And you still haven’t introduced yourself.”\n \nBucky scowled. “Buchanan Rogers. Call me Bucky.”\n \nKate nodded again. “And your husband’s name is Steve.”\n \n“Steve,” Bucky agreed, voice cracking pathetically.\n \nKate sighed. “So what brings you to the curb at such a glorious hour?”\n \nBucky lifted a shoulder half-heartedly, looking away. “Steve and I had a fight,” he said, and it wasn’t exactly a lie.\n \nKate looked at him with utmost seriousness. “You can tell me about it. I only have like five friends that I’d be able to spill the details to, and none of them would care. Except maybe Clint.”\n \nBucky rubbed his hands up and down his thighs, trying to get them to stop fucking shaking. “I just had a nightmare, and he didn’t react excellently. He actually kind of set me off again.”\n \nKate frowned speculatively. “Were you a soldier? Do you have PTSD?”\n \nBucky shrank in on himself. “No, and I don’t know but probably.”\n \n“You should go see a therapist,” Kate went on nonchalantly. “Sam has a whole cult of therapist-followers.”\n \nBucky snorted at the mental image. Kate beamed victoriously. “I tried therapy. Wasn’t really my thing.”\n \n“You should try again.”\n \nBucky sighed, rubbing a hand across his stubbly jaw. “Why are you talking to me?”\n \nKate shrugged. “My dad’s kind of a raging bigot. Which is insane because we live on a block with like three gay couples. He’s surrounded by the gay. But anyway, I told him that I may be into girls too, and he’s been kind of a bitch about it. He wakes up at six, so I’ve been leaving the house before then. I don’t actually have to be at school until seven-thirty, but it’s better than my dad right now. I’m a little early today and you looked like shit, so I figured I’d socialize.”\n \n“Huh,” Bucky said. “Well, fuck your dad.”\n \nKate smirked. “He’s a fat asshole.”\n \nBucky giggled a little bit, still jittery with adrenaline and high on nerves. Kate looked at him oddly.\n \n“So, question,” she said, leaning back slightly. “How do you ask a girl to prom?”\n \nBucky frowned. “I think I made a poster.”\n \n“She would hate that.”\n \nBucky frowned. “Why does everything have to be so complicated? Why can’t you just ask her?”\n \nKate scrunched up her face. “I dunno. Social constructs have embedded themselves into my brain?”\n \n“Keep it simple. It’s hard to find simple sometimes.”\n \nKate nudged him. “Thanks, Bucky.”\n \nBucky wrinkled his nose. “Okay, I change my mind. You’re too young. Call me Mr. Rogers.”\n \n“Nope!” Kate declared cheerfully, bouncing to her feet. She tapped him with her toe and inclined her head in the direction of Bucky’s house with a meaningful look. Bucky turned.\n \nSteve was frozen on the bottom step of the porch, a mug clutched tightly in his hand, expression akin to a deer in the headlights.\n \n“I’ll leave you to it,” Kate said, and skipped towards her car.\n \nBucky sighed, running his hand through his hair. “Don’t just stand there. C’mere.”\n \nSteve hesitated before cautiously approaching Bucky. He stopped a few feet away. “I- uh- I brought you coffee,” he mumbled.\n \nBucky made grabby hands, and Steve gave a huff, gingerly lowering himself to sit next to Bucky and handing him the mug.\n \n“I’m sorry,” Steve whispered. “I should’ve just left you alone. I didn’t know.”\n \nBucky dropped his head onto Steve’s shoulder. “It’s okay. You didn’t know.”\n \nSteve shifted to wrap his arm around Bucky’s shoulders. “I was just scared. I didn’t know what to do.”\n \n“In the future, just pacify me. I can be pretty irrational when I get like that,” Bucky whispered, rubbing his face against Steve’s neck contentedly. “I can’t believe you brought me coffee. You’re kind of adorable.”\n \nBucky felt Steve’s skin heat and tried not to smile. “You’re welcome. It’s the least I could do.”\n \n“Kate Bishop, our next-door neighbor, talked me down,” Bucky explained. “She thinks I need a therapist.”\n \n“We could always ask Sam for a recommendation,” Steve said seriously.\n \n“I don’t know if I’m ready for that.”\n \n“Well, whenever you are, I’ll stand by you.”\n \nThis was what drove Bucky crazy. How Steve sometimes acted like they were married and in love without anybody else around. It made him feel too happy- too warm.\n \nAnd that was dangerous.\n \nBucky let out a breath. “That’s what he called me,” he whispered, squeezing his eyes shut, and Steve went still. “When I couldn’t remember my name, he called me the Soldier.” His voice wavered, and he had to stop talking.\n \nSteve’s arm tightened around his shoulders. “Bastard,” he muttered darkly. “I’m sorry.”\n \n“Yeah,” Bucky managed, voice choked. They were quiet for a long time before Bucky murmured, “You know, I don’t even remember everybody I killed. I don’t remember. That’s even worse than the fact that I killed them. That’s so fucked up.”\n \nSteve pulled Bucky tighter against his body. “It’s not your fault,” he said fiercely.\n \nBucky just shook his head slightly.\n \n“I’ll kill him,” Steve added, almost as an afterthought. “I’ll kill him for what he did to you- for what he did to everyone.”\n \n“That’s a nice thought, Stevie.”\n \nThey stayed like that for a long time, pressed together on the curb with Bucky tucked into Steve, clutching the mug of coffee like a lifeline.\n \nAnd the oddest thing was that Bucky had never felt safer.\n \n \n \nLater, Bucky got a text from an unknown number that just contained a picture of him and Steve essentially cuddling on the curb.\n \nBUCKY: Who is this\n \nUNKNOWN NUMBER: its natasha lol\n \nBUCKY: How did you get this picture?????????\n \nNATASHA: kate took it and texted it to clint and he texted it to me :P\n \nBucky sighed, looking to the heavens. Steve glanced at him, a worried pull to his eyebrows. “Kate took a picture of us on the curb this morning, and it’s making its rounds among the neighbors.”\n \nSteve’s lips quirked. “Can I see it?”\n \nBucky thrust the phone in his face as he approached from where he’d been cleaning the kitchen again. “Text it to me.”\n \nBucky did, and then launched into a rant about invasive neighbors minding their own business. Steve watched him with an affectionate smile until he was finished. “You like them,” Steve said.\n \n“I do not,” Bucky lied.\n \n(Later, when Bucky peaked over to see what Steve was doing on his phone, he saw that the picture was now his background.)\n \n \n \nThe landline was ringing.\n \nThe landline never rang.\n \nBucky didn’t even know they had a landline.\n \nBucky was staring at it in abject horror, frozen in the middle of his trek to get a snack. Steve poked his head over the upstairs landing, paint smeared across his forehead adorably. “What the fuck is that?”\n \n“We have a landline?”\n \nSteve cursed and vaulted himself down the stairs, skidding to a stop in front of the phone with impressive speed. He picked up and said in a clipped tone, “Rogers’ residence.”\n \nThere was a pause. The lines on Steve’s face deepened, and Bucky felt his skin start to prickle. He reflexively looked for the clock, needing the security of numbers.\n \nIt had been sixty-four days, eight hours, and forty-four minutes.\n \n“Confirm. This is Agent One.” Steve rubbed a hand across his jaw. “I see,” he said. “Is my assistance required?” Another pause. “And what of the current mission?”\n \nIt always hit Bucky like a slap in the face when he remembered that Steve was literally being paid to live here. He looked away.\n \n“Estimated duration?” A pause. “When do you need me?” A pause. “Confirm.” Steve hung up, looking at Bucky. Bucky was suddenly reminded of how tired Steve always looked. “I’ve gotta leave you for a few days. I dunno how long it’s gonna be, but at least five days.”\n \nBucky froze. “What if something happens?”\n \n“This takes priority,” Steve said, not meeting his eyes. “They need my focus elsewhere.”\n \nBucky swallowed heavily. He hated when Steve was like this. “I see.”\n \n“I’m going to pack.”\n \nBucky stood, body rigid, in the no man’s land between the living room and the kitchen. He clenched and unclenched his fist. The abrupt shift of Steve’s personality was giving him fucking vertigo.\n \nHe found himself bracing his weight on the counter, eyes closed, adrenaline crashing. This week was gonna suck shit. Bucky could feel it.\n \nSteve made his way downstairs after a while, a bag slung over his shoulder. He shifted awkwardly. “I may call you while I’m out if we’re given any down-time. I want to check in- make sure you haven’t burned the house down.” He was trying for a joking tone, but it fell short.\n \nBucky blew out a breath, looking Steve over for a long moment. “I don’t think I like you in mission mode,” he confessed quietly.\n \nSteve looked away. “I don’t like me like that either.”\n \n“It makes you look older,” Bucky added.\n \nSteve absently touched his own cheek. “Well, I didn’t know that.”\n \n“You’ll stay safe, right?” Bucky whispered. “Come back in one piece?”\n \nSteve smiled humorlessly, his eyes bitter. “I’m kind of indestructible, Buck.”\n \nBucky sighed. “You leaving right now?”\n \nSteve nodded. “Yeah.”\n \n“I’ll walk you to the car.”\n \nThey made their way outside, and Steve threw his bag into the passenger’s seat. Bucky was about to open his mouth for a potentially pathetic good-bye when he heard someone make a noise. He looked over to see an older, pot-bellied man standing by some shrubs. He was staring at them with disdain, trying to be covert about it. This must have been Kate’s bigoted father.\n \nSteve followed his gaze, and when he looked back at Bucky, there was a familiar glint in his eye. Bucky looked at him warily, because that glint meant mischief.\n \nSteve sauntered over to him, deliberately drawing attention to his narrow hips. He slid his hands down Bucky’s sides until he tucked them in Bucky’s back pockets. Steve pulled them flush together and murmured, “We should give him something other than his daughter to bitch about.”\n \n“Good idea,” Bucky managed, knowing where Steve was going with this. Steve let a slow smirk spread across his features, and Bucky couldn’t help but stare- he was only human. His hands had somehow found themselves resting against the strong muscles of Steve’s chest.\n \nSteve leaned in, pressing their lips together in a kiss that immediately turned hot and open-mouthed. Bucky let out an admittedly indecent moan, curling his tongue around Steve’s. Steve’s hands tightened their possessive grip on his ass, pulling Bucky impossibly closer.\n \nSteve bit down on Bucky’s lip before soothing the spot with his tongue. Bucky broke away for an instant to nip at Steve’s jawline, reaching the sensitive place below his ear. Steve let out a small noise that Bucky definitely wanted to further investigate, but Steve got impatient and dragged him back up.\n \nKate’s father was making a choking noise, but Bucky didn’t even register it until he let out a deliberately loud cough. Steve broke away, leaving Bucky thoroughly disoriented, desire thrumming through his veins, as Steve stepped back and turned to Mr. Bishop.\n \n“Oh, sorry, sir. Were we bothering you?” he asked with icy politeness.\n \nMr. Bishop sputtered inelegantly.\n \n“I’m sure,” Steve went on snarkily, “that you wouldn’t want our lives to intrude on yours. I mean, if your wife was leaving for an indefinite amount of time, we would never expect you to kiss her good-bye. Talk about public decency.”\n \n“Young man-“ Mr. Bishop snapped, eyes narrowed, expression haughty.\n \nBucky’s brain finally decided to reboot. “Oh, I’m sorry!” he nearly shouted. “Was our public display of affection making you uncomfortable?” Mr. Bishop looked aghast. “Well, you can suck my dick! Except- oh, wait- Steve already did that this morning!” Bucky reached out his hand, and Steve met him for a high five without prompting.\n \n“In the shower,” Steve added, smirking.\n \n(Bucky’s brain went a little wonky at the image. What was the point here? He’d had a point in the dick-sucking comment.)\n \n“This is-“ Mr. Bishop tried, but he was too angry/flustered. Bucky watched gleefully.\n \n“With all due respect, sir. Fuck you. I’m trying to say good-bye to my husband, and we’d appreciate a moment of privacy,” Bucky cut in.\n \nMr. Bishop, still gaping like a fish, turned on heel and stormed into his house.\n \nSteve turned to Bucky, trying not to smile. “I was trying to make my point subtlety.”\n \n“Going in like a runaway train is more fun,” Bucky shot back, not mentioning that he definitely would’ve had more tact if Steve hadn’t just had his tongue in Bucky’s mouth.\n \nSteve giggled. “That’s my usual approach,” he admitted. Then, he reached out for Bucky.\n \nBucky stepped into the comforting circle of Steve’s arms.\n \n“’M gonna miss you,” Steve whispered.\n \n“Yeah, I’ll miss you too, you fucking punk,” Bucky grumbled.\n \nSteve watched him carefully. “After I go, could you check and see if I turned the lights off in my room?”\n \n“Of course.”\n \nSteve smiled, albeit a little bit sadly. “I’ll try and call you when I know when I can come home.”\n \nHe called it home, Bucky thought dumbly. “Okay.”\n \n“If you start to feel unsafe, call Natasha,” Steve said, dropping his voice low. “I trust her capabilities.”\n \n“Yeah, I will. You be careful out there.”\n \nSteve held the side of Bucky’s face for a moment, locking their eyes for what felt like forever. “You too.”\n \nAnd then he turned and climbed into the car.\n \nBucky watched him drive away, trying not to feel hollow.\n \n \n \nWhen he went to make sure the lights were off in Steve’s room (they were), Bucky paused in the doorway, noticing the open sketchbook lying on the bed. Steve never left his sketchbook open, even if he was comfortable showing Bucky his drawings.\n \nBucky approached the book cautiously and found a cartoonish drawing of Steve holding out a heart. SORRY I WAS SUCH A DICK, was written carefully in the blank space.\n \nBucky sat heavily on Steve’s bed, pressing his hand into his mouth as an onslaught of emotion hit him like a tidal wave.\n \nHe clutched Steve’s sketchbook to his chest and cried for exactly seven minutes.\n \n \n \nBucky hated everything.\n \nThe house was too empty.\n \nThe absence of Steve felt downright awful. It was too quiet, reminding Bucky of the first eight days he’d spent at the house, alone and miserable.\n \nBucky stood at the fridge, contemplating the bottle of beer. He knew if he started drinking, he wouldn’t be able to stop any time soon. Bucky had never really been an alcoholic, but he knew his emotional state was tenuous at best.\n \nInstead of grabbing the bottle, Bucky grabbed the newest stack of envelopes addressed to Bruce Banner and headed over to Tony’s house.\n \n“Hi,” Bucky grumbled miserably when Tony opened the door.\n \nTony raised an eyebrow. “You look like shit.”\n \nBucky ran a hand through his hair. “Steve left on a business trip, and he doesn’t know how long he’s gonna be gone.” He thrust out the envelopes. “More mail.”\n \nTony took them, but he kept his eyes on Bucky. “Want to watch while I make a robot suit?”\n \n“Sure.”\n \nBucky followed Tony into the house and downstairs to the basement. This was Tony’s lab/workshop area. Tony sat down on a swivel chair and immediately went to work on what was apparently a robot suit.\n \n“It’s gonna fly,” Tony explained, examining a blowtorch.\n \n“Cool.”\n \nThey sat in silence for a while, Tony occasionally muttering to himself.\n \n“Hey, is your dad Howard Stark?”\n \nTony looked up sharply but tried to look dismissive. “Well, he technically disowned me, but yeah, I guess.”\n \n“Oh,” Bucky said. “Is that why you’re out here?”\n \nTony offered a wry smile. “I wanted Stark Industries to shift from the weapons industry to clean energy. Pops wasn’t too keen on the idea.”\n \n“So, you’re here,” Bucky said slowly, frowning. “Why?”\n \nTony looked confused. “What do you mean? I can’t work at Stark Industries because my father would never allow it. What else am I gonna do?”\n \n“Get off your ass and make a difference. Be better.”\n \nTony narrowed his eyes. “Look, Rogers. I know you’re having a shitty day, but that doesn’t give you the excuse to tell me how to live my life.”\n \nBucky held up his hands defensively. “It was just a suggestion. You don’t have to take it any other way.”\n \nTony returned to his project, a line of displeasure between his eyebrows. “I’m not sitting on my ass here,” Tony said abruptly. “I’m doing good things.”\n \n“I know.”\n \n“I mean, could I be doing better things? Probably. But it’s not like I can just go door-to-door and ask people if they want clean energy homes.” Tony waved a screwdriver around. “That would be insane.”\n \n“Okay.”\n \n“Although,” Tony added thoughtfully, “I could advertise. People generally know who I am.”\n \n“Yeah.”\n \n“And I’ve got people who’d be willing to help me out as long as there’s profit involved. Shit, how do I make a profit? I’m not a business man- I’m a scientist.”\n \nBucky shrugged. “I dunno.”\n \nTony looked at him. “What do you even do for the government?”\n \n“I go over cases to see if there are any discrepancies,” he said. “It’s a lot of boring reading.”\n \nTony nodded. “Yeah, that doesn’t help me at all.” He looked at Bucky intently. “See, the only reason I ever had faith in Stark Industries was because they had money. And like, a lot of people use money to get more money, but I wanted to use the money to do something good for once in my life. Howard took that away from me.”\n \n“Look, Stark,” Bucky began, leaning forward in his seat. “I grew up pretty fucking poor. The only reason my sister and I could go to college was because we got a shitton of scholarships. Money has always been an issue for us.”\n \n“Where are you going with this?”\n \nBucky held up a hand. “I’m just saying that you have the ability to get money. Howard didn’t take your dream away from you. He just made it more difficult to achieve. If Becca and I could get through college with barely any cash, you can do your fucking clean energy thing.”\n \nTony sighed, running a greasy hand through his hair. “You’re a pain in the ass.”\n \nBucky smirked. “Just saying.” There was a stretch of silence. “Tell me about the clean energy thing.”\n \nTony’s face lit up. “I call it the arc reactor,” he announced before launching into a lengthy, technical description that Bucky could barely understand.\n \nBut he was trying to listen, and the arc reactor sounded massive. “Any way to make it on a small scale?” he asked.\n \nTony waved a hand. “Duh.”\n \n“Work on that, then.”\n \n“You can’t tell me what to do,” Tony muttered but moved to another table and started laying out materials.\n \nBucky smiled to himself and watched Tony work.\n \n \n \n“Young man,” a crisp voice with a British accent called.\n \nBucky turned to see one of the old ladies that lived across the street. “Ma’am.”\n \nThe woman gave him a once-over. “Steve was supposed to meet us for tea this morning.”\n \nBucky blinked. He had no idea that Steve had been friendly with the old ladies. “He had to leave kind of suddenly. Business trip.”\n \nThe woman frowned. “Come inside. Buchanan, right?”\n \n“Yes, ma’am,” Bucky said, feeling unbelievably small under the woman’s gaze.\n \nBucky approached her, and she extended her hand. “I’m Margaret Carter, but please call me Peggy.”\n \nBucky shook her hand. “Then, you can call me Bucky.”\n \nShe nodded. “I have tea, and I won’t have it go to waste.”\n \nBucky looked at her in resignation. “Alright.”\n \n“Angie isn’t such a fan of tea,” Peggy explained as Bucky followed her inside. “Steve likes tea.” She gave him a look. “You have a fine young man to call your husband.”\n \n“Tell me about it.”\n \n“Gladly,” Peggy said, smirking a little bit in a way that resembled Steve’s smirk a little too much for his liking.\n \nBucky frowned. “What’s that look supposed to mean?”\n \nPeggy lifted a shoulder as she made her way around the kitchen, and Bucky sat down at the table. “An old woman is allowed to look. Steve is-“\n \n“Super hot, yeah. I know.”\n \nPeggy laughed. “I’m glad we have an understanding.”\n \n“English, are you flirting with the Rogers boy again?” a voice called from the other room.\n \n“It’s a different Rogers today, darling!” Peggy called.\n \nThere was a shuffling noise before the other old lady (who Bucky assumed was Angie) came into the room, eyeing Bucky critically. “He’s here to drink your communist tea?”\n \n“As if coffee is any better?” Peggy demanded, affronted.\n \nAngie rolled her eyes, looking at Bucky. “Brits.”\n \n“Darling, I thought you liked my accent.”\n \nAngie grinned, holding apart her thumb and forefinger. “A smidge.”\n \nPeggy glanced at Bucky as she passed him the tea. “See what I have to deal with.”\n \n“You only have yourself to blame- you’re the one who proposed, remember?” Angie snarked back.\n \nPeggy pursed her lips theatrically. “I did?”\n \nAngie laughed, sitting down in the chair next to Peggy and dropping her head on Peggy’s shoulder. “What’s your name?”\n \n“Bucky.”\n \nAngie nodded. “You don’t have to pretend to like the tea, Bucky.”\n \nBucky laughed, while Peggy looked mock-offended.\n \nAngie grumbled to herself good-naturedly as she poured herself some coffee. Peggy and Bucky sipped at their tea in silence because Bucky knew that it was definitely too late to tell them he actually preferred coffee.\n \n“So, how’d you guys get so buddy-buddy with Steve?” Bucky asked curiously. Over the course of the twenty-seven days since Steve had arrived, they’d pretty much spent ninety-five percent of their days together and consequently told each other everything about the other five percent. Or so Bucky had thought.\n \nPeggy looked at him. “There really isn’t much to tell. He just comes over for a cup of tea every few days. Usually right before he goes running.”\n \nThat explained why Bucky had no idea when these meetings were happening. He was usually still asleep or pretending to be asleep before Steve went running.\n \n“He talks about you a lot,” Angie added with a grin.\n \nBucky ducked his head shyly. “Aw, really?”\n \n“He’s your husband, my dear. Don’t sound so shocked,” Peggy chided.\n \nBucky twisted the wedding band around his finger. “Yeah,” he sighed.\n \nAngie and Peggy exchanged a glance in which they seemed to have an entire conversation. “Trouble in paradise?” Peggy asked.\n \nBucky frowned. “I mean, he had to leave pretty abruptly, right?” They nodded understandingly. “So we yelled at each other a little bit, but I think we still left things on good terms. I mean- I just miss him.”\n \n“Aww,” Angie crooned.\n \nBucky swallowed, staring intently at his tea. “He’s my best friend,” he mumbled, hunching his shoulders self-consciously.\n \n“That’s how it’s supposed to be,” Peggy said softly.\n \nBucky took a sip from his tea, knowing Peggy and Angie were still watching him expectantly.\n \nHe licked his lips. “We should tell each other everything,” he said slowly, trying to take care with keeping his words vague at best. “But we don’t. There are certain subjects we’ve barely touched upon. I don’t know if it’s healthy, and I guess it’s been bothering me.”\n \n“Oh?” Angie and Peggy said at the same time.\n \nBucky cringed at himself. “I- uh- we’ve both been through some shit. I don’t think either of us have ever talked to anybody about it.”\n \n“Peggy served in World War II,” Angie told him. “She had PTSD- still does, I think. It took her a long time to tell me anything.”\n \n“That’s true,” Peggy affirmed. “Trauma isn’t a light subject, Bucky.”\n \n“Tell me about it.”\n \n“You need to give yourself time to acknowledge whatever shit you’ve been through before you can talk about it with some objectivity.”\n \nBucky took another sip of tea. “Everyone thinks I should go see a therapist.”\n \n“Therapy isn’t a bad thing, you know?” Peggy said sternly, a furrow in her brows.\n \nBucky sighed. “I guess. I just really don’t want to talk about it.”\n \n“You’ve got time,” Angie said. “You’re young.”\n \n“Jeez, I didn’t mean to get so gloomy on you guys. I don’t normally unload like this,” Bucky said, terribly embarrassed. “Sorry.”\n \nPeggy waved a dismissive hand. “I live for this shit.”\n \nBucky choked on his tea.\n \n“As a couple that’s been together since the fifties,” Angie added, “I think you should probably talk to Steve about all this.”\n \nBucky sighed. “You’re probably right.”\n \n“I’m always right,” Angie agreed as Peggy rolled her eyes fondly. Angie leaned forward on her elbows. “So, talk to me. What’s new with you kids and your memes and shit?”\n \nBucky burst into laughter, and Angie looked pleased with herself. “I don’t know much about the current meme culture,” he admitted.\n \n“Grandpa,” Angie coughed into her hand. Peggy whacked her on the back of the head.\n \nBucky smiled with brightness- it was possibly the most genuine smile he’d had since Steve had left.\n \n \n \nBucky was definitely not moping.\n \nOn an unrelated note, everything sucked shit and the world hated him and Steve was still gone.\n \nIt had been five days, and he hadn’t even contacted him. Bucky checked his phone every two minutes, and he was starting to get jittery with anxiety. What if Steve was hurt? What if he didn’t come back?\n \nHe glared at the stupid house show as if it was responsible.\n \n(Although, the house they were currently showcasing had a really nice color scheme. Steve would probably appreciate its- goddammit, Barnes, not everything is about motherfucking Steve Rogers.)\n \n(“A smidge,” Bucky’s inner monologue argued with a pout.)\n \n(Bucky sighed, conceding that his inner monologue probably had a point.)\n \nBucky was clicking the home button of his phone again when the phone buzzed. He yelped aloud, scrambling to read the text.\n \nNATASHA: i know ur sulking come over 4 coffee\n \nBucky sighed. Still no Steve. He scrubbed a hand over his face. It wasn’t even 6:00 yet.\n \nBUCKY: Right now?\n \nNATASHA: yas\n \nBUCKY: You serious?\n \nNATASHA: Clint and I do not joke about coffee.\n \nThe proper punctuation of the text threw Bucky off enough to get him out the door and over to Clint and Natasha’s porch. Natasha opened the door before he even knocked, dressed in compression shorts and a sports bra, hair tied back in a messy and short ponytail. “Rogers,” she said curtly, stepping aside to let him in.\n \nBucky shuffled inside. “Why did you invite me over?”\n \nNatasha frowned. “You seem lonely.”\n \nBucky shrugged.\n \nFrom the kitchen, they heard a crash, followed by a whiny, “Aww, coffee, no.” Another crash resounded, followed by an even whinier, “Aww, Liho, nooo.”\n \nAt Bucky’s questioning look, Natasha sighed and said, “Clint and the cat probably broke something.”\n \nSure enough, as soon as they walked into the kitchen, Clint shouted, “It was the cat.”\n \nNatasha stared at him blankly.\n \nClint crumpled. “Okay. Maybe it was a little bit me.” He was in the process of trying to shove shards off coffee mug into the trash.\n \n“Idiots,” Natasha said, addressing both Clint and a too-innocent looking Liho affectionately.\n \n“You flatter me.”\n \nNatasha scoffed and poured two mugs of coffee, passing one to Bucky. Clint shrugged and started drinking straight from the pot. Bucky started drinking his own coffee gratefully.\n \n“How you holding up, Bucko?” Clint asked, unsuccessfully trying to wrangle a tie. Natasha rolled her eyes and did the knot for him while Clint looked at her like she created the universe itself.\n \nBucky scowled deeply in answer to Clint’s question.\n \nClint laughed, and Natasha turned to look at him. “Wow. You’re angsty without Steve. I like it,” she declared.\n \n“Um. Thanks?”\n \nNatasha raised her mug.\n \n“Did Steve tell you how awesome he was with the kindergarteners last week?” Clint asked, continuing to drink straight from the pot.\n \nSteve had agreed to talk to Clint’s kindergarteners about being a professional illustrator and had come home absolutely beaming about it.\n \n“Yeah, he did,” Bucky said.\n \n“I bet he undersold himself. A few kids told me they wanted to be artists after he left,” Clint told Bucky, grinning.\n \n“That’s amazing.”\n \n“I know. People are too dismissive when it comes to artists. God knows I could never do what they do.”\n \n“Tell me about it,” Bucky agreed. “You ever seen Steve get into the zone?” Clint and Natasha shook their heads in sync. “He has this whole extra sense. It’s amazing. And really ridiculously hot.”\n \nNatasha snorted. “Of course.”\n \nBucky’s thoughts drifted slightly. “Mmmmmm.”\n \n“Snap out of it, Rogers,” Natasha said, literally snapping her fingers in front of his face. “You get sex when he comes back. For now, join us in the real world.”\n \nBucky ignored the way he was flushing. “Whatever. Like you’ve never drifted while Clint was away.”\n \nNatasha lifted a noncommittal shoulder. Clint looked offended, and Natasha reached over to pinch his bicep, her expression flickering into a smile as Clint yelped.\n \n“Anyway. It’s terrible because we don’t know when he’s coming back,” Bucky said, trying not to pout.\n \n“There’s always sexting,” Clint suggested mildly.\n \n“Nah, he’s super busy,” Bucky grumbled.\n \n“Get over yourself,” Natasha muttered playfully.\n \n“Wow. Fuck you,” Bucky shot back melodramatically.\n \nClint giggled and lit up as Lucky sleepily padded into the kitchen. “Hey, pizza dog.”\n \nLucky perked up.\n \n“No pizza right now,” Clint informed him apologetically, crouching down to give him some proper attention. Lucky essentially preened.\n \nNatasha leaned close to Bucky and stage whispered, “He gives that dog more love than me.”\n \n“I didn’t hear what you just said, but I’m sure it defaced my character in some respect. I advise Bucky not to listen to your lies,” Clint said cheerfully, his voice a little bit too loud for normal conversation.\n \nBucky snorted, and Natasha made a face. Clint looked up, and she signed something at him.\n \nClint looked affronted. “What about last night?”\n \nNatasha signed something again, and Clint’s face turned so red that he had to look away.\n \n“I’m not even going to ask,” Bucky muttered.\n \n“Good choice,” Clint said faintly.\n \nNatasha lifted a nonchalant shoulder.\n \n“Today, the principal is doing her in-class evaluation thing,” Clint explained to Bucky, “so I put on a fucking tie.”\n \n“I can see that.”\n \n“It physically pains him to wear it,” Natasha added.\n \n“I have nothing to worry about, though. My kindergarteners are smart and well-rounded,” he bragged.\n \nNatasha patted him on the shoulder. “I’ve got the tiny munchkin ballerinas today.”\n \n“Nat secretly adores small children,” Clint said to Bucky.\n \n“I have no idea what you’re talking about,” Natasha said, leaning over to stroke Liho’s fur.\n \nClint grinned at Bucky, opening his mouth to say something else, but his grip on the coffee pot slipped, and it crashed to the floor in a mess of glass and coffee.\n \nClint pouted. “Aw, coffee, no.”\n \n \n \nIt had been ten days, five hours, and three minutes since Steve had left.\n \nBucky was watching Pacific Rim in Sam’s living room, trying to give the movie his undivided attention like the movie deserved.\n \nHe checked his phone again.\n \nNothing.\n \nHe sighed, and Sam glanced over knowingly. “Missing your boy?”\n \nBucky immediately felt guilty. He knew Sam’s husband had been gone for over a month, and here he was moping about the guy he’d only known for thirty-six days. “Sorry,” he mumbled.\n \nSam gave him a sympathetic look. “It’s okay to miss him. Lord knows I miss my husband.”\n \nBucky froze, not expecting Sam to bring it up.\n \nSam smiled humorlessly. “Yeah, I know you’ve noticed by now that he hasn’t been around. It’s okay- I mean, not okay, but I’m dealing with it.”\n \n“I’m sorry,” Bucky said quietly, sincerely.\n \n“Got nothing to do with you.” Sam turned his attention back to the movie. “I think Riley and I would’ve been damn good jaeger partners.”\n \nBucky smiled. “Yeah?”\n \n“Yeah. We were pararescue together. Always sort of been able to read each other.” Sam smiled sadly. “Or at least, I thought so.”\n \n“I’m sure he’ll come back.”\n \nSam gave him a look. They fell silent.\n \nBucky was reaching for his phone again some time later when it started buzzing. He leapt to his feet, and Sam startled. “Sorry,” Bucky whispered, and answered the call from BLOCKED NUMBER. “Hello?” he said apprehensively.\n \n“Bucky,” Steve breathed.\n \nBucky felt himself slump in relief. “Steve.”\n \n“I’m on my way home. I should be there in, like, three hours,” Steve said, voice slightly crackly over the line.\n \n“All in one piece?” Bucky asked, trying to keep his tone light.\n \nSteve laughed dryly. “Yeah, Buck, I’m fine. I heal pretty quick.”\n \n“Thank god,” Bucky muttered.\n \n“You doing okay? Anything happen while I was gone?”\n \n“Well,” Bucky began, “The neighbors proved invasive as ever.” He shot a mock-dirty look at Sam, who smirked and held up his hands defensively. “And I had tea with Angie and Peggy.”\n \n“Really?” Steve asked in surprise.\n \n“Yeah. They’re sweet old ladies.”\n \n“Don’t be fooled,” Steve said dryly. “I’m pretty sure that Peggy has killed a man with a fork.”\n \n“Wouldn’t surprise me,” Bucky agreed mildly, happiness buzzing through his body. “I’m over at Sam’s now. We’re watching Pacific Rim.”\n \n“Oh, I love that movie. What do you think our jaeger would be called?”\n \nBucky’s heart pounded. Steve acted like it was implicit that they would be jaeger partners. He gave a watery smile. “I dunno. You’re the creative one.”\n \n“I’ll get back to you on it.”\n \n“I’m counting on it.”\n \nA pause. “I’ve gotta ditch this burner phone now. I’ll be home soon.”\n \n“Okay.”\n \n“Okay.”\n \n“Love you,” Bucky said softly (married people closed phone calls with love you’s, right?).\n \nSteve snorted. “Bye, Buck.”\n \n“Bye.” The line went dead.\n \nBucky turned to Sam, who had both his eyebrows raised. “Well?”\n \n“He’ll be home in a few hours. Sorry about that.”\n \nSam shook his head. “Don’t apologize. Warms my heart to see two people in love.”\n \nBucky swallowed. He hated lying to Sam.\n \n“Come on. Watch movies with me until he gets back,” Sam prompted, throwing in a cheeky grin that showed off his teeth.\n \n“As you wish,” Bucky said, flopping back down on the couch.\n \n“Oh, man. Just for that, Princess Bride is next.”\n \n“That was my plan all along,” Bucky informed him theatrically.\n \nThey watched movies throughout the afternoon, making snarky comments and just generally having a great time, until Bucky heard the rumbling of an engine just as Home Alone was ending. He peeked out the window, as he had been doing any time he’d heard a car for the past two hours, and broke into a huge grin when he saw it was Steve.\n \n“Perfect timing,” Sam declared, shoving to his feet as Bucky bolted for the front door.\n \nSteve was getting out of the car, and everything about his demeanor suggested exhaustion. A miscellaneous wave of emotion hit Bucky, and he ran the rest of the distance, Steve turning when he heard the movement.\n \nWhen Steve saw him, a big but tired smile broke out on his face, and he opened his arms. Bucky fell into them, sinking into the warmth of Steve’s body.\n \nSteve tilted his chin upwards and pressed their lips together, kissing him gently and slowly. It was definitely up there in the top five best kisses that Bucky had ever had, leaving him weak in the knees and aching for more as Steve pulled away. “Sorry,” he murmured in Bucky’s ear. “Sam was watching.”\n \nBucky tried not to visibly freeze. Right. This was all fake. Why did it always hurt so much to remember that?\n \nBucky ignored his own feelings and jabbed Steve hard in the chest. “I missed you, you punk.”\n \n“Yeah, I missed you too, you jerk,” Steve returned affectionately, tapping their foreheads together.\n \n“Can we go inside?” Bucky asked with a sigh, still plastered to Steve’s chest and not really planning on moving any time soon.\n \n“Hold on a second,” Steve said, sounding vaguely bemused. “I brought you something.”\n \nBucky perked up, lifting his head from where it had been resting against Steve’s collarbone. “Oh?”\n \nSteve laughed, stepping away and turning to the passenger’s seat. Bucky mourned the loss of contact for a moment before Steve returned with a brown paper bag sporting a familiar logo. “You got me bagels?” Bucky managed, actually tearing up a little bit.\n \n“Maria’s bagels,” Steve confirmed, handing Bucky the bag. “I was in the neighborhood.”\n \n“You are the best thing to ever happen to me,” Bucky whispered, looking at the contents of the bag and completely missing Steve’s blush.\n \n“Hey, Steve,” Sam said from somewhere behind him. “Glad you’re back.”\n \n“Hey, Sam. Thanks for looking out for him.”\n \n“Yeah, he was pretty hopeless without you,” Sam teased.\n \n“Was not!” Bucky snapped. “I was very responsible.”\n \n“And bitchy,” Sam added with a cough.\n \n“Fuck you.”\n \nSteve leaned into Bucky’s side. “You okay if I steal him?” he asked Sam jokingly.\n \n“Yeah,” Sam said, sighing. “I don’t think I want to be around for your reuniting sex.” He added a shudder, and Steve laughed.\n \n“I can’t believe you got me bagels,” Bucky muttered.\n \n“Anything for my best guy.”\n \nBucky ducked his head, smiling widely.\n \n“I’ll leave you two to it,” Sam said pointedly, backing away towards his house and turning away with a meaningful wink.\n \nSteve and Bucky walked into the kitchen, Bucky immediately preparing a bagel. “How was the mission?” he asked, more serious.\n \nSteve sighed, leaning heavily against the counter as he watched Bucky. “Long. Dangerous.”\n \n“Yeah?”\n \nSteve ran a hand through his hair, causing the strands to stick up atrociously. Bucky’s fingers twitched, wanting to smooth it back into place. “Yeah. More people died because of me, but that’s nothing new,” he said, trying to keep his tone light.\n \nBucky frowned around his bite of bagel (delicious as always, thank-you-very-much). “Oh?” he said carefully.\n \nSteve tensed. “Sorry, ignore me. I probably need to shut up for a while- I’m still healing, and that sometimes makes me feel weird. And act weird.”\n \n“You okay?” Bucky asked, worry shooting through him.\n \nSteve shrugged. “Yeah, I’m fine. Just a few gunshot wounds. Should be better in the morning.”\n \n“Steve!” Bucky shouted, dropping his bagel in surprise. Steve jumped, staring at the bagel. “You were shot?”\n \nHe looked vaguely confused. “Um. Yeah.”\n \n“Fucking hell,” Bucky despaired, picking his bagel up again and shoving a bite that was too big into his mouth.\n \nSteve looked around the room, seeming to shrink in on himself. “I’m gonna start straightening up. You didn’t clean at all while I was gone, did you?”\n \nBucky stared at Steve, not fooled. “Steve.”\n \n“I’ll start on the upstairs, and work my way down,” Steve announced, pushing himself off the counter. “Eat your bagel, Buck.”\n \n“Steve.”\n \n“I’ll stay out of your room,” he went on, heading for the stairs. “I know that’s your space.” He wouldn’t meet Bucky’s eye.\n \n“Steve.”\n \nSteve ignored him, heading upstairs and gathering various items of equipment to start cleaning.\n \nBucky cursed and scarfed down the rest of his bagel. Sure, Steve cleaned when he was stressed, but Bucky could tell that this was something on a much greater scale. Steve was pale and jittery, healing from fucking gunshot wounds, and men had died under his watch on the mission. This could not be good.\n \nBut he knew Steve wouldn’t listen to him right now, much in the same way that Bucky wouldn’t be able to listen if somebody told him to stop counting the moments. This, he understood.\n \nSo, instead of demanding Steve stop, he followed him from room to room as Steve furiously scrubbed at imaginary stains and reorganized bookshelves. Bucky pretended to read a book as he followed Steve around. Steve was either ignoring him or was too far away to even register his presence.\n \nAnd that was fine with Bucky as he followed Steve downstairs, through the rooms that honestly didn’t need to be cleaned.\n \nBucky could handle it until they reached the kitchen.\n \nSteve scrubbed so hard at the place behind the coffee maker that the marble warped slightly. Bucky walked over to inspect the situation and saw that Steve had an angry gash across his knuckles. He must’ve scraped it against something.\n \n“Steve, you’re bleeding,” Bucky whispered softly.\n \nSteve swallowed visibly, not looking up. “It’ll heal in a minute. I’m fine.”\n \n“Stevie, it’s clean.”\n \nSteve shook his head, and Bucky noted with alarm that silent tears had started to streak down his cheeks. “It’s a mess.”\n \n“Steve,” Bucky whispered again, and reached out.\n \nSteve flinched when Bucky laid his hand on his shoulder. “I can’t,” Steve gasped, tears coming harder now. Bucky wrapped his arms tightly around Steve’s torso, pressing his arms into his sides to half-restrain him. Steve dropped his cleaning products and crumpled against him.\n \nBucky led them carefully upstairs, Steve still shaking and crying silently. But when Bucky pushed open the door to his own room, Steve froze and refused to move. “Steve, come on. I know you only ever sleep when you pass out, and I know you absolutely need to sleep right now. You know I don’t get much sleep either, and this may just work.”\n \nSteve sagged forward and nodded, letting himself be pulled into Bucky’s room. He was startlingly pliant as Bucky carefully pushed him into the bed. Steve struggled to remove his jeans, mumbling a weak, “Sorry,” as the fabric stubbornly clung to his thighs. Bucky just shook his head, grabbing the ankles of the jeans and tugging them off.\n \nSteve flopped back, and Bucky glanced down at his own sweatpants, deeming himself fit to go to sleep. He crawled under the covers, and Steve immediately curled into him with a shuddering breath.\n \n“There was an explosion,” he whispered hoarsely. Bucky made a hushing noise and ran his fingers through Steve’s hair. “I should’ve noticed something was wrong. A lot of people were injured. A lot of people died.”\n \n“It’s not your fault.”\n \nSteve laughed, and it was a bitter, horrible sound. “I was in charge.”\n \n“Steve Rogers, you listen to me,” Bucky whispered fiercely, pulling Steve tighter against him. “There was no way you could’ve done anything, even if you noticed something was up. You are not responsible for these lives- whoever planted the explosion is.”\n \nSteve shuddered. “I don’t know, Buck,” he murmured brokenly.\n \n“None of it is your fault,” Bucky said again, pressing a kiss to the top of Steve’s head absentmindedly. “Not your fault. Not your fault.” Bucky repeated the words until Steve released enough tension to completely collapse on him. His weight increased as sleep gradually took him. Bucky smoothed a finger across one of the dark circles under Steve’s eyes before he settled in more comfortably to try and get some sleep himself.\n \n \n \nBucky woke with a start as Steve climbed out of bed.\n \n“Ah- sorry. Didn’t mean to wake you,” Steve whispered, standing in only his boxers and a T-shirt. Bucky licked his dry lips and kept his eyes above the waist. “Just wanted to go on my run.”\n \n“Right. Go ahead. I’ll meet you in the kitchen.”\n \nSteve scratched the back of his head, shuffling awkwardly. “Thanks for last night. I actually managed to sleep for eight hours,” he said, sounding surprised.\n \nBucky blinked slowly. “Eight hours? Fuck, new record.”\n \nSteve looked at him sheepishly. “So, I guess this worked,” he concluded, gesturing towards the bed and trying not to blush.\n \n“We can keep doing this, then,” Bucky said, trying to keep his voice casual. “Best sleep I’ve had since I was knocked out on my way to kill the mayor.”\n \nSteve chuckled dryly. “You got it.” He started to turn towards the door but paused, seeing something on the wall. Bucky followed his gaze to where he’d taped Steve’s sorry-for-being-a-dick note, and he felt his face heat up. Steve turned towards him. “You hung up my apology cartoon?” he asked incredulously, a faint smile curling his lips.\n \nBucky looked away and shrugged. “Yeah, so?” he said challengingly.\n \n“That’s real nice, Buck. Thanks.”\n \n“Go on your run,” Bucky said, waving Steve away. “Beat Sam’s ass.”\n \nSteve laughed happily and bounded out the room.\n \nBucky fell back onto his bed and blew out a long breath, letting his eyes fall shut to try and erase the image of Steve’s muscular legs.\n \n \n \nBucky convinced Steve to watch the modern Star Trek movies that had Chris Pine, and they were lounging on the couch in their normal position: Bucky sitting against the arm of the couch with his feet shoved under Steve’s thigh.\n \nSteve shifted slightly, and Bucky looked over at him. He stretched a little, and then deliberately moved so that he was now lying sideways on the couch, body squeezed between Bucky and the cushions. Steve slung an arm across Bucky and kept nudging him until Bucky rolled his eyes and settled back so that Steve was basically spooning him on the couch.\n \n“My feet,” Bucky complained.\n \n“The icicles?” Steve asked dryly, before he clamped his legs around Bucky’s feet. “Better?”\n \nBucky hummed in affirmation, snuggling back into Steve’s broad chest.\n \nNothing else was said on the matter, and Bucky was stupidly pleased with the whole turn of events.\n \n \n \nThe new sleeping situation was great.\n \nNot perfect, obviously. Bucky still woke up with nightmares and stared into space, counting the seconds, until the clock ticked to 8:13. Steve had nightmares of his own as well, and he almost never fell back asleep after he woke up.\n \nBut it was so much better than the situation before: Bucky watching the house show more than closing his eyes while Steve watched the exits and cleaned his guns.\n \nBucky decided that cuddling with Steve was an experience akin to reaching nirvana.\n \nReasons: warmth, muscles, Steve’s snuffly sleep noises, and the undeniable feeling of safety.\n \nAlthough the one con of the situation was that Bucky’s inner monologue wouldn’t stop screeching. It was kind of annoying, but definitely worth it.\n \nSteve seemed pretty satisfied with the whole thing too, if the slightly alleviated dark circles and more cheerful mornings were anything to go by.\n \n(If Bucky was still asleep when Steve got up for his run, he’d grumble irritably and swat at Steve. Steve would just giggle and run his fingers through Bucky’s hair, which was a surefire way of lulling him back to sleep. It was nice.)\n \nBucky was still hazy with sleep as Steve disentangled himself from Bucky and climbed out of bed. Bucky mumbled something indistinct, and Steve laughed softly. “What was that, Buck?”\n \n“It’ll be a hundred days at 8:13,” Bucky informed Steve sleepily.\n \nSteve dropped a kiss onto Bucky’s forehead, and Bucky didn’t think Steve was even aware that he’d done it. “I’m so proud of you.”\n \nBucky smiled, and let himself drift back to sleep as Steve combed his fingers through Bucky’s hair.\n \nMaybe this was what home felt like.\n \n \n \nBucky was sitting at Sam’s counter while Sam tried a new recipe for some sort of fancy cake. Bucky was here for emotional support and taste testing. Also: gossip.\n \n(Something Bucky never thought he would avidly participate in when he was forced to move to suburbia.)\n \n“Tony’s finally getting his clean energy thing off the ground. We’ve got a mutual friend, James Rhodes, who I actually think is Tony’s best friend but I’m not sure. Anyway, Rhodey is helping spread the word, and now Tony has a bunch of investors. A lot of them are enemies of Stark Industries, and you can imagine how ecstatic Tony is at that,” Sam chattered as he poked the cake batter.\n \n“That’s great for him,” Bucky said. “I may have pushed him a little bit on that. Remember when I was being a dick when Steve was gone for ten days?”\n \nSam nodded, smirking faintly. “You weren’t that bad.”\n \nBucky shook his head. “I literally told Tony to get off his ass. God, I’m such a bad friend.”\n \n“Naw, you’re helping him achieve his dreams.”\n \nSam sniffed the cake and shrugged a little. Bucky played with his wedding ring. “Did you hear that Kate’s going to NYU for college?”\n \n“Yeah,” Sam said warmly. “Did you hear her dad isn’t paying for it?”\n \n“Did you hear Clint and Natasha are helping her pay?”\n \nSam nodded. “I think Kate really wants to work for this on her own, though. We’ll see what happens.”\n \n“I’m proud of that kid,” Bucky admitted.\n \n“Same.” Sam opened the oven and shoved the soon-to-be-cake inside. “So, how are things with you and Steve?”\n \nBucky couldn’t help bit grin. God, he was so pathetic. Even the mention of Steve made him smile. What the hell. “Things are great.”\n \n“Yeah?”\n \n“Yeah,” Bucky agreed. “So many cuddles.” Every night. And sometimes multiple times throughout the day, depending on their moods (because bad days were definitely a regular occurrence and cuddles were not always appreciated).\n \n“Gross,” Sam said, wrinkling his nose.\n \n“Cuddles sustain me.”\n \n“Groooosssss.”\n \nBucky giggled a little bit.\n \n“God, you two are so dumb and in love, and it sickens me.”\n \n“Yeah,” Bucky agreed happily, but he immediately froze. He hadn’t even thought about the whole thing with Steve being an undercover agent in that moment. Bucky’d just blindly agreed to being in love, like a reflexive response.\n \nBucky thought about it hard for a long moment: how incredibly fond he felt every time Steve was in the room or any time he was even mentioned, how his heart leapt whenever the casual touching seemed even slightly deliberate, how his body went fuzzy every time Steve smiled or looked at Bucky affectionately.\n \nShit.\n \nBucky groaned, dropping his head onto the counter. “You okay, man?” Sam asked.\n \n“Sam,” Bucky groaned. “I’m in love with my husband.”\n \nHe could practically hear Sam’s smile. “Oh?”\n \n“I’m in love with my husband,” Bucky despaired, banging his head lightly on the counter.\n \n“You should ask him out,” Sam deadpanned.\n \nBucky lifted his head to look at Sam mournfully. “Man, this sucks.”\n \nSam rolled his eyes and patted Bucky consolingly on the head. “You’ll manage.”\n \nBucky made a truly pitiful noise but didn’t comment further on the subject, and soon Sam was talking about sending some of the vets over to Natasha’s studio to teach them ballet.\n \nBucky and Sam finished the entire cake in under ten minutes.\n \n \n \nWhen he returned home that night, Steve was painting in the living room, clothes rumpled and splattered with paint.\n \nOh no.\n \nSteve turned, beaming when he saw Bucky.\n \nOh no.\n \nThere was a streak of blue paint across his cheek.\n \nOh dear god no.\n \n“How was Sam?”\n \n“Good,” Bucky said, trying not to sound strangled.\n \nSteve grinned, gesturing towards his canvas. “I’ve been painting.”\n \nI love you, Bucky’s internal monologue screamed. He furiously ignored it. “I can see that. You have a little...” Bucky touched his own cheek.\n \nSteve shrugged. “That’s okay.”\n \n“No, let me get it,” Bucky offered, stepping into the kitchen to wet a paper towel before he walked into Steve’s space and stroked the paper towel down Steve’s cheek slowly. “There,” he whispered, but his touch lingered.\n \nSteve’s eyes were burning into him, and as Bucky let himself give in to eye contact, his breath caught.\n \nSteve was staring at him intently, and Bucky could swear he saw heat flashing through his heavy gaze. Steve reached out and loosely circled his fingers around Bucky’s wrist.\n \nBucky licked his lips, and Steve’s eyes flicked down and back up.\n \nThe fucking doorbell rang.\n \nBucky jumped away. “I’ll get it,” he declared, voice strained. Steve watched him with a slight frown as Bucky staggered inelegantly for the door, tripping over the rug as he went.\n \nSmooth, Barnes, his inner monologue noted.\n \nNatasha was at the door with Liho on her shoulder, and Bucky kind of wanted to strangle her. “Game night,” she declared.\n \n“Game night,” Bucky repeated.\n \nNatasha nodded solemnly. “Clint and I have Cards Against Humanity, Apples to Apples, Furt, Pictionary, and Monopoly.”\n \n“And?”\n \n“We’re playing at least one. I highly suggest Furt.”\n \n“The fuck is Furt?”\n \nNatasha shrugged. “I don’t really know.”\n \n“You’ve never played it?”\n \n“No, I have. Loads of times. It’s hard to explain.”\n \n“Stevie!” Bucky called.\n \nSteve padded into the foyer. “Yeah?”\n \n“Nat’s forcing us into a game night.”\n \n“Sounds fun,” Steve said agreeably.\n \nHe could not have been more wrong.\n \nThey ended up playing Monopoly, which was only a good idea for home wreckers.\n \nAnd as it turned out, Steve was competitive enough that he treated board games like wartime strategy. Tony was just as stubborn to win, Clint literally could care less about the actual rules of the game, and Natasha only liked playing to embarrass everybody else and kept trying to steal money. Sam and Bucky were the only sane people, and that meant that they were in dead last place. Clint had been named the banker but had been “banished” to play with Lucky and Liho.\n \nThe only reason Steve and Tony didn’t come to blows by the end of the night was because while they were too busy being competitive/stubborn assholes, Natasha gleefully slipped under their radar and won (probably through cheating).\n \n“We should do this again,” Natasha said cheerfully, celebrating her win as she leafed through her paper money, and Steve and Tony glared in shock.\n \n“They almost punched each other,” Bucky said incredulously.\n \n“It’s okay,” Tony piped up, slinging an arm over Steve’s shoulders (which was really awkward since Tony was half a foot shorter). “Stevie-kins knows it’s all in good fun.”\n \nSteve glared sullenly, clearly still not over the game. “I will end you, Stark.”\n \nTony stepped away and raised his hands. “Hey, let’s call it a truce and watch Star Wars.”\n \n“Steve still hasn’t seen the prequels,” Bucky said helpfully.\n \n“The prequels suck,” Clint whined. Apparently he had turned his hearing aids back on.\n \n“Episode III is okay,” Sam said with a shrug.\n \n“To watch Episode III, we must watch Episodes I and II,” Tony announced.\n \nBucky leaned against Steve, and felt his husband’s muscles relax. He smiled faintly to himself as Steve rested his chin on top of Bucky’s head.\n \n“Movie marathon it is, then.”\n \nThey moved to Tony’s house because Clint had lost his DVD for Attack of the Clones, and Tony had more couches.\n \nClint, Natasha, and Sam took one couch, and Steve, Bucky, and Tony took the other. Bucky laid down with his head in Steve’s lap and his feet shoved under Tony’s legs because dammit his feet were always cold. Tony didn’t seem to mind, though, and Steve kept playing with his hair, which was some A+ shit.\n \nBucky glanced up at Steve during one of the dull parts of The Phantom Menace, and his inner monologue was at it again: I love you I love you I love you I love-\n\n \n\nBucky dug his fingernails into his palms. This wasn’t good. This was definitely not good.\n \nSteve glanced down at him to catch his gaze and smiled warmly. Bucky wanted to die. Instead, he turned his head and pressed a kiss to Steve’s thigh because they were around their neighbors (friends?) and married people behavior was excusable.\n \nSteve moved his hand from Bucky’s hair to lightly stroke his face, and Bucky’s eyes fluttered shut, but Steve moved back to his hair after a moment.\n \nThis was going to be a problem.\n \nThey climbed into bed that night, and just like any other night, Bucky snuggled onto Steve’s chest, but his heart was hammering.\n \nSteve must’ve felt it, because he whispered, “You okay?”\n \nBucky nodded and squeezed his eyes shut.\n \nBut he didn’t get any sleep that night.\n \n \n \n“Ask for Dr. Malcolm Ducasse,” Sam had said in what Bucky assumed was his therapist voice.\n \nSteve had offered to come with him to the appointment, but Bucky begged for him to stay home. This was something he wanted to do by himself.\n \nMalcolm greeted Bucky with a sympathetic smile and kind eyes. “Mr. Rogers, how are you feeling today?”\n \nBucky shrugged. “Pretty okay.”\n \nMalcolm nodded. “Let’s get started with any questions you have for me before we begin.”\n \nBucky hesitated, shifting on the comfortable couch across from Malcolm’s chair. “I just heard about you from my friend, Sam.” Malcolm nodded. “I don’t know much about therapists. Do you guys have, like, specialties? Like, certain areas of trauma you focus on?” Bucky asked uncertainly.\n \n“Not all therapists do, but mostly, yeah,” Malcolm answered. “I usually am most effective when paired with people recovering from drug addiction, but I’m flexible.”\n \nBucky swallowed, hearing his throat click. “I’ve- uh- I’ve sort of experienced a lot of... of bad things?” he said, and the statement came out sounding like a question. He cringed.\n \nMalcolm shifted. “Okay. We can discuss what you want to gain with these sessions,” he said gently.\n \nBucky ran a hand through his hair. “I want to stop being so scared all the time,” he murmured, not looking at Malcolm.\n \nWhen he finally gathered the courage to look up, Malcolm was smiling faintly. “I think we can work at that.”\n \n \n \nBucky spoke with Sam on the phone on the way back home. “How was Dr. Ducasse?” Sam asked.\n \n“Surprisingly approachable.”\n \n“I thought you’d like him.”\n \n“...Thank you, Sam.”\n \nHe could hear Sam’s smile. “No problem, Bucky.”\n \n \n \nWhen Bucky got home, he immediately knew that something was wrong.\n \nIt was too quiet- the type of quiet that felt deliberate.\n \nBucky reached for a gun that wasn’t there, and closed the front door softly behind him, even though whoever was in the house definitely already knew he was there.\n \nHe eyed the safe in the living room, but he didn’t know the combination. The only weapons he could immediately access were knives from the kitchen.\n \nBucky took his chance and grabbed four knives on silent feet.\n \nBucky heard a noise that sounded suspiciously like a hiss of pain and ran upstairs as quickly as possible.\n \nBucky took a steadying breath outside Steve’s closed bedroom door (which was more of a studio than a bedroom nowadays). It had been a hundred and twenty-six days, seven hours, and forty-two minutes. Bucky was free, Bucky was calm, Bucky was ready.\n \nHe kicked the door open.\n \nA silencer muffled the blast of the gun, and Bucky reflexively ducked behind the door for cover, but the bullet hadn’t been aimed at him.\n \nSteve gasped in pain.\n \nBucky burst back into the room, throwing his first knife in the direction of the man with the gun. It hit him in the neck, and Bucky turned away before he saw the bloodshed, eyes searching for Steve.\n \nHe wasn’t hard to find.\n \nHe was half-collapsed against a man dressed in tactical gear, face streaked with blood. His knee was a mess of exposed tendons and bone and blood, and Bucky swallowed down the urge to vomit. They’d shot Steve in the fucking kneecap. They’d blown out his kneecap.\n \nA dozen guns were pointed at Bucky, and three more were pointed at Steve.\n \n“James Barnes,” a man drawled almost lazily. “You’ve been pretty tricky to find. Scrappy little maggot, you are, aren’t you?”\n \n“Let go of him,” Bucky growled, jerking his head in Steve’s direction. “He has nothing to do with this.”\n \n“He’s FBI, right? They’ve been giving us some problems lately,” the man said. “We should kill him. Or maybe take you both, I dunno. Haven’t decided yet.”\n \nSteve looked delirious with pain. “I’m sorry,” he mumbled, and when he opened his mouth, blood dribbled onto his chin. He spat another thick wad of blood on the floor.\n \nBucky’s knives were raised, but he wasn’t going to delude himself. Fifteen guys with guns against a guy with knives and a guy with a blown-out kneecap didn’t exactly inspire good odds.\n \nBut the guy who’d shot Steve was at his feet, his gun in reach. As quickly as he could, he snatched the gun, and clicked the safety off, pressing the barrel to his own temple.\n \nAll of the safeties in the room clicked off in rapid succession.\n \n“You need me alive,” Bucky said coldly, finger playing with the trigger.\n \nThe man bared his teeth. “We don’t.”\n \n“You’re bluffing,” Bucky said, and put the slightest amount of pressure on the trigger.\n \n“Oh, let’s not be hasty!” the man shouted, and Bucky eased off the trigger, pleased. Steve’s breathing had gone ragged. “What do you want?”\n \nBucky jerked his head in Steve’s direction. “You let him go. Alive.”\n \nThe man rolled his eyes. “You can’t seriously expect us to-“\n \n“You either get two dead men or one live one. Your choice,” Bucky snapped. “If you lay one more finger on him, I swear to god, I’ll blow my fucking brains out.”\n \nThe man growled.\n \n“And we don’t want that, do we? You need me because I’m already reactive to the drugs, right?”\n \n“Well, nobody ever accused Detective Barnes of stupidity,” the man said icily. “Let the FBI rat go,” he commanded as if bored.\n \nSteve collapsed to the floor. “Bucky,” he breathed hoarsely.\n \nWith the gun still pressed to his temple, Bucky crouched down and cradled the side of Steve’s face tenderly. “Hey, it’s gonna be okay. I’ve got you.”\n \n“I promised-“\n \n“Change of plans,” Bucky whispered, brushing his thumb over Steve’s bottom lip. He closed his eyes briefly before whispering. “I love you.”\n \nSteve’s eyes widened, swimming with tears from either pain or emotion. “Buck-“ Before he could say anything to break his heart, Bucky slammed the hilt of his knife down on Steve’s head, and Steve crumpled. Bucky brushed a sweaty lock of hair off of Steve’s forehead.\n \nBucky sniffled a little bit before straightening.\n \nThe man whistled. “Ruthless.”\n \n“I didn’t want him to see,” Bucky ground out. “My condition still stands. Don’t fucking touch him. I want to see all of you leave this house.”\n \nThe man nodded, roughly grabbing Bucky’s arm. “I could probably get away with killing the FBI rat,” he noted mildly, “but I’m a sucker for doomed romance. Lead the way, boys.”\n \nBucky watched grimly as the men trooped out of the room, he and the leader following at the end of the line.\n \n“I’m Brock Rumlow, by the way,” the man said conversationally. “We’ll probably get to know each other intimately. I wonder if you’ll remember.”\n \nBucky’s stomach clenched with anxiety. He closed his eyes for a moment before opening them, making sure everyone was out of his home and into shady black vans before he followed Rumlow into the last van.\n \nRumlow held his hand out, and Bucky offered him the gun. He handcuffed Bucky’s wrists to the car door “as a precaution,” and they were off.\n \nBucky stared out the window. He’d lasted a hundred and twenty-six days, but he was going back.\n \nHe may never be a free man again, but Steve was alive.\n \nHe closed his eyes. Steve was alive.\n \n \n \nPierce visited him in his cell. “Detective Barnes,” he said with the arctic smile, clasping his hands behind his back, “It’s been a while.”\n \n“One hundred and twenty-six days,” Bucky informed him.\n \n“That’s cute- you’ve been keeping count.” Pierce leaned casually against the bulletproof glass that enclosed his cell. “How’ve you been?”\n \n“Great until you showed up.”\n \n“Don’t be coy, Detective.” Pierce raised an eyebrow. “I hear you went into witness protection. Buchanan Rogers? I can’t believe you used your middle name. That was an unnecessary risk,” Pierce chided.\n \nBucky shrugged.\n \n“The information you gave the FBI has made things slightly more difficult for the organization, but you know me. I’m resilient.” Pierce’s tone was dry. Bucky wanted to kill him. “And- good news- we’ve almost perfected the memory drug.”\n \n“Found a better name for it yet?” Bucky asked, trying to find his sarcasm.\n \nPierce chuckled. “Why do you care? You’re not going to remember.”\n \nBucky tensed.\n \n“I’ll introduce you to the doctor we have working on it. He’s quite charming. I think you two will get along. In the meantime, I believe Agent Rumlow and you have some bonding exercises planned.”\n \nRumlow stepped into view, rolling his neck and shifting his weight.\n \n“Rumlow enjoys bringing out the worst in people. He likes taking them to the brink of death slowly. I’m sure his methods will be more effective than our last attempt of conditioning.”\n \n“What do you need conditioning for?” Bucky asked, trying to keep the waver out of his voice as Rumlow stepped forward. “You’re just going to wipe my memory anyway.”\n \nPierce’s eyes twinkled. “Detective, you have no idea.” Bucky shivered involuntarily. “Have fun, boys,” Pierce called as he strolled away, whistling.\n \nRumlow smirked. “Barnes.”\n \n“Rumlow.”\n \nThe first punch was like getting hit by a truck.\n \nSome indeterminate amount of time later, Bucky lay on the floor, coughing up blood, completely disoriented. Rumlow watched him, bored. “Broken arm, cracked ribs, dislocated jaw, broken nose, bruised trachea, fractured wrist,” somebody listed.\n \nBucky’s head lolled to the side to see a man who had the grimy look of a prisoner, his hair dark and greasy, and his skin pale and bruised.\n \n“Treat the wounds,” Rumlow commanded.\n \nThe man stilled. “You do know I’m only licensed as a field medic, don’t you?”\n \nRumlow lifted a shoulder. “Not my problem, Wilson.”\n \n“Same last name as Sam,” Bucky mumbled, numb with pain.\n \nThe man froze and looked at Bucky intently. “Sam? Sam Wilson? Therapist? Former pararescue? Super attractive?” he demanded.\n \n“Yeah,” Bucky coughed. His throat felt like it was burning. “How’d you know?”\n \nThe man gritted his teeth as he examined Bucky’s ribs. “He’s my husband.”\n \n“You’re Riley.”\n \nRiley nodded.\n \n“No talking,” Rumlow barked, and they fell silent.\n \n“He thinks you left him,” Bucky breathed when Rumlow pulled out his phone and started scrolling.\n \nRiley flinched. “I expect he does. But is he okay? Healthy? Eating well?”\n \n“Yeah, he’s okay. And you do know he stress-bakes, right? Of course he’s eating well.”\n \nA ghost of a smile touched Riley’s lips. “That man.” He looked at Bucky. “How do you know him?”\n \n“I moved to the neighborhood.”\n \n“Oh. How’s everybody else?”\n \n“Fine. Kate’s going to NYU.”\n \n“Atta girl.”\n \n“And Tony just got sponsored by this big company for his clean energy thing, and the CEO personaly visited him for the endorsement, and I think Tony’s in love with her.”\n \nRiley’s lips twitched upwards. “Man, I gotta tell-“\n \n“Shut the fuck up!” Rumlow snapped, leaning forward and pocketing his phone. “You know what, Wilson. Forget about the injuries. Let him stew in ‘em for a couple of days. You’re dismissed.”\n \nRiley gritted his teeth and let some guards shove him from the cell. Rumlow crouched down next to Bucky and smoothed a threatening hand through his sweaty hair. “Gotta learn to listen, baby,” he murmured lowly. Then, he abruptly stood and strolled from the room. He must’ve clicked a button because the bulletproof glass turned black, and Bucky was submerged into darkness, injuries screaming at him until he passed out from pain.\n \n \n \nBucky had no idea how long Rumlow left him alone in the dark.\n \nIt was especially terrible because when he was lucid, there was no way to count the moments. He had lost all sense of time, and his skin crawled with dread every time he woke up.\n \nHis various injuries were swollen and probably ugly and infected. The neglect of his aching body could not be good, and Bucky hated every unaccountable second of it.\n \nBut it was worth it. Steve was alive, and that was all that mattered. Maybe his kneecap had even reconstructed itself by now. Steve’s healing was incredible like that.\n \nThe dark and the silence ate at him until Bucky thought he was going insane.\n \nAnd time continued to slip away-\n \n \n \nThe first words Bucky heard since Rumlow left him in darkness were a meek, “Hi, I’m here for some blood samples?”\n \nBucky pried his swollen eyes as far open as he could, and was blinded by the brightness. He hissed at the instant headache, but he couldn’t move.\n \n“Oh, jeez,” the same voice said, alarmed. “You look like absolute shit.”\n \nBucky groaned indistinctly.\n \n“I’m not that kind of doctor, but I’ll see if I can do anything to help.”\n \n“Don’t bother,” Bucky rasped, and his jaw screamed. Thank god Riley had popped it back into place before he left, or it would be so much worse. “Rumlow wants it this way.”\n \n“Ah,” the man said. “Well, let’s see if I can be sneaky.” Bucky heard him enter the cell, and he tried to make out the man’s features. He got the vague impression of dark curls and glasses before his eyes slid shut. “I’m Dr. Bruce Banner,” Bruce said quietly.\n \n“What the fuck,” Bucky mumbled.\n \n“What was that?” Bruce said in amusement.\n \n“I live in your house.”\n \nBucky could feel Bruce’s gaze on him. “Small world,” he said tersely. “How’s Tony?”\n \nBucky swallowed, and it felt like sandpaper scraping against his throat. “Kicking off his clean energy shit. Pretty successful so far. Half in love with Pepper Potts. Misses you.”\n \nBruce didn’t reply, but Bucky felt a prick in his forearm, so he assumed he was concentrating on drawing blood. “Good for him,” he finally managed. “The others?”\n \n“Pretty good. Sam misses Riley.”\n \n“Yeah,” Bruce agreed. “Riley went missing a few weeks before me. Sam was frantic. I can’t imagine how he must feel. You know, Riley almost died in the military.”\n \n“Damn,” Bucky said because he couldn’t say anything else.\n \n“So Sam is fairly overprotective,” Bruce continued. “I hope Riley gets home to him soon. I don’t think Hydra needs him much anymore.”\n \n“Hydra?”\n \n“Yeah. That’s the name of the organization. Shady, right?”\n \n“What happens when they’re done with Riley?”\n \nBruce paused. “Let’s hope that doesn’t happen.” Another prick in his forearm. “They tried the memory drug on him, and it wasn’t receptive. They’ve tried it on others too. None of them were ever as receptive as you, and they’re getting desperate.”\n \n“I made things as hard for them as I could.”\n \n“Yeah, good job on that,” Bruce said mildly. “Anyway, I’m making the drug as effective as possible.”\n \n“Great,” Bucky muttered.\n \nBruce put a fucking Band-Aid over the injection site on his forearm. As if that was the worst of his injuries. The gesture was surprisingly touching, though. “They’ve got drones on Tony, in my defense. They’ll kill him if I refuse.”\n \n“Fuck you, Hydra,” Bucky slurred, considerably more disoriented than he had been a minute ago.\n \nBruce patted him carefully on the cheek. “I snuck you some morphine,” he whispered so that only Bucky could hear.\n \n“Thaaaannnkkkkkssssssss,” Bucky managed.\n \n“Don’t mention it. I’m the one responsible for the perfected memory drug.”\n \n“Not your fauuuuult,” Bucky announced. “I forgive you.” He was stumbling over his words, either from pain or from the morphine.\n \nBruce patted his cheek again and left the cell.\n \nBucky drifted into unconsciousness.\n \n \n \n“Little bitch.”\n \nBucky had learned that Rumlow was fond of giving nicknames.\n \nAnd not the endearing sort of nicknames either.\n \nBucky blacked out for a second, coming to as Rumlow hauled him up by the torn collar of his shirt. “You like that, you cocksucker?”\n \nBucky looked at Rumlow blearily. He knew better than to struggle.\n \nRumlow slammed him against the wall hard enough to rattle hit bones (the broken ones howled). “Tenacious,” Rumlow commented, grabbing a fistful of Bucky’s hair to yank his head forward before slamming it back into the wall. Bucky cried out. “But not unbreakable.”\n \nBucky bit down a whimper, even though it wasn’t like he had any pride left. He’d pissed his pants not half an hour ago, for fuck’s sake.\n \nRumlow traced a nail down his cheek with deceptive lightness. Bucky let the whimper burble past his lips, and Rumlow smirked. “That’s it, baby.”\n \nIt was disturbing- the way Brock talked to him almost like a lover.\n \n“You’re doing so well,” Rumlow murmured, and now his nail was digging in to Bucky’s skin hard enough to leave angry scratches. “Take it like the little bitch you are.”\n \nThat was what Bucky was doing, wasn’t it? It was difficult to feel guilty about it, though.\n \n“I’ve seen more of you than your FBI rat has,” Rumlow went on. “Does that bother you, baby?”\n \nBucky bared his teeth.\n \n“Oh, you don’t want me to talk about him? Shhhhh, it’s okay, I won’t lay a finger on your precious FBI rat.” Rumlow’s hand closed around his throat. “Too pretty for my taste anyways.”\n \n“Shut up,” Bucky rasped.\n \nRumlow sneered, tightening his hold. “Am I striking a nerve?”\n \n“He’d crush you like a bug,” Bucky choked out.\n \nAnger flashed through Rumlow’s features before he eased back, smoothing Bucky’s filthy shirt down. Bucky’s senses went on high alert. Rumlow played with the collar of his shirt for a moment before yanking down and tearing the fabric, leaving Bucky bare-chested.\n \nThe bruises over his ribs looked worrying, but Rumlow didn’t pay them any attention, instead inspecting Bucky’s arms. “Which hand do you shoot with?”\n \nBucky clamped his mouth shut.\n \n“Throw knives with?”\n \nBucky remained silent.\n \nRumlow looked up. “Oh, that’s cute. If you don’t tell me, I’ll hurt something you may need. Which arm is more important?”\n \nBucky watched Rumlow for a moment before whispering, “Right.”\n \n“Good boy,” Rumlow said, stroking his cheek. He whipped out a wicked-looking knife and turned over Bucky’s left palm. “Good boy.”\n \nThe first gash was shallow but long, extending from Bucky’s wrist to his inner elbow. Bucky’s knees buckled with white-hot pain, and he fell to the floor.\n \nRumlow just shifted his stance slightly, carving careful rings of blood around his bicep in a way that looked almost artistic. Bucky’s vision blurred, and he choked on a sob.\n \n“Aw, hurts, doesn’t it, baby?” Rumlow crooned. “Maybe next time you won’t talk back to me.”\n \nDimly, Bucky saw Rumlow pull a lighter out of his pocket and flick the flame on, holding it to heat his blade.\n \n“Don’t want you to bleed out,” he explained. “It’s a clean blade, don’t worry.”\n \nHe pressed the burning flat of the knife to each gash in order to cauterize the wounds.\n \nAnd Bucky screamed until his voice gave out.\n \n \n \nWhat was probably days later, Bucky woke up in a sterile room with all of his wounds treated.\n \nHe looked down at himself in confusion. He even looked clean. He had a fresh change of clothes and could see the natural color of his skin without looking through layers of blood, vomit, piss, and dirt.\n \n“They’re prepping you,” Bruce explained, and Bucky jumped, pulse skyrocketing. “Sorry- didn’t mean to startle you.” Bruce stepped into view, holding up gloved hands. “They want you to be ready to assassinate ASAP, and I’m pretty much done.”\n \nBucky swallowed heavily, nodding in resignation. “When is it gonna happen?”\n \n“Tonight,” Bruce said gently.\n \n“You know I’d never blame you for any of this,” Bucky said quietly, trying to sit up without hurting his aching ribs.\n \n“You’re a good man, Detective Barnes.”\n \n“Hey, can I ask you a favor?” Bucky said, stomach twisting with nerves.\n \nBruce nodded. “Anything.”\n \n“I’m gonna forget- everything,” he said, wincing when his voice broke. “I just want to talk to someone about what I may never remember. It’s important to me.”\n \nBruce smiled wryly. “I’m not that kind of doctor either, but I can listen as a friend.”\n \n“That’s what I meant,” Bucky said.\n \n“Then go.”\n \nSo, Bucky told Bruce about Rebecca Barnes and how he’d probably never see her again. He told him about his private detective business, and how his neighbor sometimes helped him out, even though she was a broken alcoholic who jumped to anger too easily. He told him about moving to suburbia and meeting his invasive neighbors. But most of all, he told him about Steve.\n \n“I don’t think anybody knows him,” Bucky confessed quietly. Bruce was working on the drug and listening at the same time. They both ignored the heavily armored guards in the room. “I don’t think anybody ever thought there was anything to know.”\n \n“You care about him a lot,” Bruce noted, not sounding distracted despite looking like he was doing eight things at once.\n \n“I love him,” Bucky said with a shrug. “He knows. I don’t know how he feels, though.” He looked up at Bruce. “Hey, do me a favor? Erm- another favor?” Bruce gave him an amused glance. “If you ever run into Steve, tell him I still do.”\n \n“I will,” Bruce agreed quietly.\n \n“I hope you get back home,” Bucky whispered drowsily.\n \n“You too, James.”\n \nPierce breezed into the room. “Everything set, doctor?” he asked Bruce.\n \n“I believe so,” Bruce said, stepping away and handing Pierce a bottle of fluid. “Just inject into the neck.”\n \nPierce shot Bucky a look. “Do I have to restrain you?”\n \n“Probably,” Bucky said, lifting his chin in a last flimsy show of defiance.\n \nPierce chuckled dryly and nodded at the guards, who immediately wrestled Bucky back onto the table he’d been sitting on, strapping his arms and legs down.\n \nPierce appeared above him, his eyes cold and blue as ever. “I hope to never see you again, Detective.”\n \n“Likewise,” Bucky gritted out.\n \nPierce pushed the needle into Bucky’s neck and pressed down on the plunger.\n \nFor a minute, Bucky felt cold.\n \n“What is the last thing you remember?” Pierce asked.\n \nBucky laughed giddily. “Nice try, motherfucker. Didn’t work,” he snapped. “I’m still here.”\n \n“Give it a minute,” Bruce said warily.\n \nBucky blinked and felt the telltale beginnings of fog descending on his mind.\n \n“What is the last thing you remember?”\n \nBucky frowned in confusion, looking around. “When’d I get here?” he asked groggily.\n \nPierce sighed. “Dr. Banner, please hand me another syringe.”\n \n“I’d have to highly advise against administering another dose,” Bruce said frantically. Bucky blinked slowly. “The effects could be fatal.”\n \n“Another,” Pierce snapped. Bucky felt another needle bite into his neck. “What is the last thing you remember?”\n \nBucky’s brow furrowed in confusion. “Where’s Steve?” he mumbled. “How’d I get-“\n \n“Give it a moment,” a man’s voice cut in, sounding panicked and strained.\n \nBucky blinked.\n \n“What is the last thing you remember?”\n \nBucky jerked in his restraints. “I got away!” he shouted hoarsely. “I thought I got away.”\n \nPierce smirked his arctic smile.\n \nBucky blinked again.\n \n“What is the last thing you remember?”\n \nJames scowled. “Where the fuck am I? Who the fuck are you?”\n \nThe man with the arctic smile looked at him gleefully.\n \nJames blinked slowly.\n \n“What is the last thing you remember?”\n \nJames opened his mouth in confusion. “I- I don’t know.”\n \nHe blinked.\n \n“What is the last thing you remember?”\n \n“I-“\n \nHe blinked.\n \n“What is the last thing you remember?”\n \nHe said nothing. His mind was a gaping hole.\n \n“What is your name?” Arctic Smile pressed.\n \nHe shrugged, noting that he was restrained to a table. Huh.\n \n“Do you remember Steve?”\n \nHe furrowed his brows but shook his head after thinking became increasingly difficult.\n \n“Do you remember your sister?”\n \nHe had a sister?\n \nArctic Smile stood, grinning wide. “That’s okay. You are known as the Soldier.”\n \nThe Soldier’s stomach twisted with unease, but he did not know why.\n \n \n \nThe Soldier tracked the target in his crosshairs before he sighed with the trigger. The bullet hit home, and the target collapsed in a burst of red.\n \nSomething muffled and distant within him was screaming, but the Soldier paid it no mind.\n \nIt was not mission-relevant.\n \n \n \nThe Soldier carefully arranged the unconscious target in the filled bathtub before leaving long, angry gashes on the target’s wrist, careful with his angle.\n \nThe suicide was a footnote in tomorrow’s paper.\n \nThe irrelevant part of him was screaming again, but it was easy to ignore.\n \n \n \nThe Soldier waited until the target was sleeping in bed before climbing silently into the apartment and slitting her throat.\n \nThe target died with a smile frozen on her face, stuck in a pleasant dream for the rest of eternity.\n \nThe Soldier heard the target’s lover screaming before he had reached sufficient distant.\n \nThe irrelevant part of him was weeping.\n \n \n \nThe Soldier killed.\n \n \n \nThe Soldier forgot.\n \n \n \nThe Soldier killed.\n \n \n \nThe Soldier wavered.\n \n \n \nThe Soldier was made to forget.\n \n \n \nThe Soldier killed.\n \n \n \nThe Soldier was awaiting the prick of the needle, but Arctic Smile was late, and the irrelevant part of him was progressively getting louder and more demanding.\n \nThe Soldier was laying back pliantly on his usual table. The lights were dark, and he didn’t think that was normal, but the shifting fog in his mind was making it difficult to concentrate. Immediate administration of memory drug required for maximum efficiency.\n \nNO! the irrelevant voice roared. The Soldier frowned. This was the loudest it had ever been.\n \nThere was a distant sound of a scuffle, but the Soldier wasn’t moving any time soon. This was the meeting place. Arctic Smile and Handler always met him here, right?\n \nThe struggle got closer, and the Soldier tensed, although he did not know what to do. Therefore, he continued to lie down and stare blankly at the ceiling.\n \nThere was a loud bang, and the door exploded off its hinges. The Soldier’s muscles coiled even more tightly.\n \n“Bucky?” a voice said.\n \nThe Soldier lifted his head and saw a man with hair like sunshine and a face like a Greek tragedy. “Steve,” he breathed out, the word coming as muscle memory.\n \nSteve approached him, the Greek tragedy on his features crescendoing. He grabbed the Soldier’s shoulder, squeezing tightly. “Bucky,” he said again.\n \nThe Soldier sat up, alert and confused.\n \n“Are you okay?” Steve demanded. “Are you hurt?”\n \nThe Soldier frowned. “Prisoners?” he said tentatively. There was something important about prisoners.\n \n“Yeah, Buck, we got ‘em. We’re taking them in.”\n \nThe Soldier shook his head slightly. “Neighbors?”\n \n“They’re fine,” Steve said, shifting his hand form the Soldier’s shoulder to the back of his neck.\n \n“No,” the Soldier snapped, shoving Steve away. There was something important about neighbors and prisoners. “Two,” the Soldier said, staring intently at Steve. “Prisoners. Neighbors.”\n \nSteve’s heart broke, and it was visible all over his face. “We found all the prisoners. I don’t know what you want me to say.”\n \nThe Soldier made a noise of frustration. If only he could make sense of his disjointed half-trains of thought. “Missing neighbors,” he finally bit out, somewhat pleased with his communication skills.\n \nSteve’s eyes widened. “Are you talking about Bruce Banner and Sam’s husband?”\n \nThe Soldier sagged, relieved.\n \n“I didn’t ID any of them. I was- ah- kind of preoccupied,” Steve said, sheepish. “But we liberated all the prisoners. If those two weren’t among them, I’ll keep looking.”\n \nThe Soldier nodded, satisfied. He suddenly remembered that Arctic Smile and Handler were supposed to meet him. He cocked his head curiously. “Are you here for upkeep?”\n \nSteve recoiled as if he’d been slapped. “What?”\n \n“Administering the memory drug,” the Soldier explained. “New dose required. Arctic Smile and Handler are late.”\n \n“Oh, Bucky,” Steve murmured brokenly. “No. I’m getting you out of here.”\n \nThe Soldier stared at Steve blankly. “Out?”\n \n“Yeah,” Steve confirmed, voice breaking. “You’re gonna be free again.”\n \nA pulsing curiosity ricocheted through the Soldier’s bones, and he blurted out, “Hey, do you know what day it is?”\n \nSteve pulled the Soldier to his feet. “November twelfth. 5:54 in the evening.”\n \nThe Soldier nodded as if this information was relevant. He let Steve half-carry him from the room because he hadn’t noticed how dizzy he was. “Inefficient operation,” the Soldier warned, voice slurring slightly.\n \n“That’s okay, Buck. I’ll sling you over my shoulder if I have to,” Steve said through gritted teeth.\n \nThe Soldier must’ve blacked out because he did not recall much of the rest of his escape.\n \n \n \nThe Soldier sat handcuffed to a gray table.\n \nA man sat across from him, glaring. The Soldier didn’t think the expression was personal. He sort of assumed it was just his natural face.\n \n“Detective Barnes. You’ve had quite the year.”\n \nThe Soldier shrugged.\n \nThe man stared at him for a long moment until the Soldier shifted with discomfort.\n \n“Can you tell me your name?”\n \nThe Soldier scowled. “Of course I can,” he snapped but fell silent. He clenched his fists so that his nails bit into his palms. He swallowed heavily, digging through the muddled contents of his brain.\n \n“Detective-“\n \n“This is stupid,” the Soldier growled. “I know my fucking name.” He blinked away tears (where did those come from?) and tried desperately to find his name.\n \nHe couldn’t.\n \nThe Soldier slumped, shaking his head.\n \n“That’s okay,” the man said. “You’re James Buchanan Barnes.”\n \nThe Soldier relaxed slightly.\n \n“Can you tell me when you were born?”\n \nThe Soldier bit down hard on his lip. He took a shaking breath before shaking his head.\n \n“Alright. You were born on March 10th.”\n \nThe Soldier stared hard at his handcuffs.\n \n“Can you tell me your sister’s name?”\n \nThe Soldier furiously scrubbed a tear away before shaking his head.\n \n“Rebecca Barnes.”\n \nThe man stared at him for a long moment.\n \nThen he leaned back and raised his voice slightly. “Send in Agent One.”\n \nThe only door of the room slid open and the man with sunshine hair and a Greek tragedy face stepped inside. The Soldier let all the tension seep from his muscles. “Steve.”\n \nThe man across the table arched an eyebrow. “Interesting.”\n \nSteve glanced at the man. “Sir?” he said, hands twitching at his sides.\n \n“Permission to approach,” the man said, watching the Soldier warily.\n \nSteve crouched to his knees beside the Soldier’s chair and pressed his face into the Soldier’s side. The Soldier wanted to run his fingers through Steve’s hair, but he was cuffed pretty securely to the table.\n \n“Hey,” the Soldier whispered, trying to nudge Steve gently. “You okay?”\n \nSteve raised his head and laughed bitterly. “How could you ask me that? You’re the one who’s been gone for two and a half months doing god-knows-what.”\n \nThe Soldier tried for a smile, but it was small and sad. “You’re being evasive.”\n \n“I’m okay now,” Steve said, running his hand down the Soldier’s arm almost reverently. “You’re alive.”\n \n“That’s enough for now, Agent One,” the man across the table cut in, and Steve abruptly straightened and stepped away, falling into parade rest. “Very interesting. You’re the only concrete detail he remembers,” the man informed Steve.\n \nSteve’s face was too blank. The Soldier scowled again.\n \n“Alright, Detective. Just one more question for now,” the man said and gave his full attention to the Soldier. “Can you tell me your name?”\n \nThe Soldier stilled. After a silence that stretched on for several uncertain moments, he whispered, “No, sir.”\n \n“Thank you, Detective Barnes. That will be all,” the man said.\n \n \n \nBucky was shivering.\n \nHis body ached all over, muscles crying in pain. His head throbbed horrendously. His limbs quaked involuntarily. He was soaked in sweat.\n \nHe’d been like this before.\n \nBucky was handcuffed to the wall in the dark of a grimy cell, curled into the fetal position because his exhausted body had just been wracked with yet another seize. His stomach heaved painfully, and he coughed up bile.\n \n\nHe’d been like this before.\n\n \nHis mind was dripping with haze, but that much he knew. He wondered how many days had passed. He wondered about the minutes, but then his body started to convulse again, and he could not think much else other than, I need it I need it I need it I need-\n\n \n\nThe door clicked and creaked open, throwing a sliver of light into the room. Bucky’s chest heaved with exhausted breaths.\n \nSteve stepped inside.\n \nBucky’s brain cried out in confusion. “What’re you doin’ ‘ere,” Bucky coughed out in a truly pathetic voice.\n \nSteve settled down to sit next to him. “Looking after your dumb ass,” Steve explained.\n \nBucky frowned and spit out some residue bile from his throat.\n \n“You okay?” Steve whispered, reaching over and combing his fingers through Bucky’s disgustingly sweaty hair.\n \nBucky leaned into the touch, and the shudders started again. His teeth chattered. “I need-“ he croaked. “I need it.”\n \n“No you don’t,” Steve said firmly. “You can get through this.”\n \n“Because you’re making me!” Bucky shouted, voice hoarse and frantic. “And I don’t want to do this again! I’ve done this before! I’ve fucking done this before!”\n \nSteve made a soft hushing noise and pulled Bucky close so that his head was cradled in Steve’s lap.\n \nBucky choked on a desperate sob. “I can’t do it- I can’t. Just give me more. I know you fucking have it.”\n \n“You’re doing so well, Buck,” Steve murmured, and to Bucky’s ears his voice sounded thick with tears. “It’s almost over.”\n \n“It’s not,” Bucky sobbed, fingers weakly curling into the fabric of Steve’s pants. “I don’t want to do this again. I don’t want-“\n \n“We’re gonna be okay.”\n \nBucky could no longer find the words to express his rage and exhaustion and need, so he curled in on himself and cried on Steve’s lap.\n \nAfter he’d thrown up for what felt like the millionth time, Steve stroked a hand down the sweat-soaked fabric of his shirt and whispered, “I love you.”\n \nBucky shuddered.\n \n \n \nBucky awoke with enough lucidity to be properly disgusted with himself.\n \nThe floor was covered in bile (so were his clothes), he had a good layer of dried sweat going for him, and he’d apparently been gouging his skin with his fingernails.\n \nIn short: a huge mess.\n \nBut he was curled up on Steve’s lap, and Steve was making these groggy noises that indicated that Bucky’s movements had woken him up. Bucky wanted to sigh with relief- at least the guy had gotten some sleep. He doubted Steve had stopped for shuteye since Bucky had been recaptured. He was stupid and noble like that.\n \n“Hey,” Steve croaked, voice raw like he had spent the majority of the night crying.\n \nBucky winced as he rolled over. He’d never felt grosser. “Hey yourself,” he rasped out.\n \nSteve’s lips quirked. “You did it.”\n \n“It’s not over,” Bucky warned, and Steve frowned. “Even when you moved in with me, I was still getting these flashes of need for the drug.” Bucky sighed tiredly. “So, it may never be properly over.”\n \nSteve brushed Bucky’s disgusting hair out of his face. “But the worst is over.”\n \n“Of the withdrawal? Yeah.”\n \nSteve sagged with relief. “I don’t think I can go through that again.”\n \n“Tell me about it,” Bucky deadpanned.\n \nSteve grimaced. “I can’t imagine how difficult that was for you. Especially having to go through it for a second time.”\n \nBucky tried for a shrug, but all of his muscles were cramped. He hissed in pain, and Steve squeezed his shoulder hard enough to leave bruises. “I can’t tell what’s worse,” he mumbled, trying for a light tone but failing, “the vomit or the convulsions.”\n \n“I think the convulsions, but I wasn’t the one going through it,” Steve said softly.\n \n“They both suck.”\n \nSteve hummed in agreement.\n \nBucky hesitated. “I assume Fury wants to talk to me?” he asked quietly. “I- I don’t remember the names, but I think I could probably remember how I killed them. We could just look over the obituaries from the time I was gone,” he suggested, voice shaking.\n \nSteve frowned deeply. “I don’t know if that’s a good idea.”\n \n“What?”\n \n“We’ve arrested basically all of Hydra,” Steve told him. “We have enough evidence to put Alexander Pierce away for several lifetimes. We don’t need more assassinations.”\n \n“But-“\n \n“I don’t think it’s a good idea.”\n \nBucky gritted his teeth. “How much evidence do you have for Brock Rumlow?”\n \n“A lot,” Steve said darkly.\n \nBucky relaxed slightly. “But-“ he protested faintly.\n \n“It’s almost over.” Steve tried for a smile. “You can- you can go home soon. Be James Buchanan Barnes again.”\n \nBucky’s internal monologue cried out in distress. For once, Bucky vehemently agreed with it. “Steve Rogers,” Bucky said lowly. “You sayin’ you don’t want me around anymore?”\n \nSteve froze. “I- what?”\n \n“Tell me if I’m coming way out of left field here,” Bucky began nervously, “but I don’t want to go back to any life that’s a life without you.”\n \nSteve’s eyes were wide. He looked hunted. “No, that’s- uh- that’s a good point,” he whispered, voice shaking. “I didn’t think-“\n \n“I don’t know if you remember my dramatic love confession,” Bucky said dryly, “but it definitely still applies.”\n \n“I remember,” Steve said quietly. He swallowed heavily. “I don’t know how much you remember from this past week, but I told you. I love you too.” Bucky’s insides exploded with incredible warmth. This man would be the death of him.\n \nThey sat in silence for a while. Steve continued to run his fingers through Bucky’s hair as if it wasn’t the grossest thing on the planet.\n \n“So,” Bucky said. “What now?”\n \nSteve’s gaze went far away. “I think I have an idea.”\n \n \n \nSteve led Bucky to a shower and gave him a fresh change of clothes that consisted of jeans and a sweatshirt. “I’m so glad you know my style,” Bucky teased, hip-checking Steve as he gingerly took the clothes and tried not to get dried vomit all over them.\n \nSteve smiled. “I’ll wait outside the door for you.”\n \n“You don’t have to-“\n \n“I want to,” Steve said, hunching his shoulders.\n \nBucky studied him carefully for a moment before nodding. The shower was scalding bliss. He had no idea if he’d been allowed to shower as the Soldier, but he kind of assumed Rumlow was one to just use a hose.\n \nBucky stepped into the hallway, skin damp and raw but clean. The sweatshirt was particularly nice because it continued to hide his left arm from Steve. Steve hadn’t seen the scars yet, and Bucky was breathlessly thankful of that fact.\n \nSteve reached for Bucky’s hand and linked their fingers together. “Ready?”\n \n“Yeah.”\n \nThey walked down a few hallways that Bucky had difficulty paying attention to because holding Steve’s hand was super nice, and Bucky was trying to savor it.\n \nSteve stopped in front of a door marked DIRECTOR FURY and knocked.\n \n“Enter,” Fury called.\n \nThey did, and Steve didn’t let go of his hand.\n \n“Agent One. Nice to see you looking more level-headed,” Fury commented, almost bored. “Detective. Nice to see you not covered in puke.”\n \nBucky glared at him. Steve ignored the commentary and said, “Sir, there’s something I’d like to discuss with you.”\n \nThis got Fury’s attention. “Oh?”\n \nSteve nodded and gave Bucky’s hand a squeeze. “I think we both know that this came to an end a while ago.”\n \nFury laced his fingers. “Is that so?”\n \nSteve glared at Fury with such intensity that even Fury looked vaguely uncomfortable. Then, Steve said lowly, “Agent One died in the siege for Hydra.”\n \n“Excuse me?”\n \n“Agent One started dying a long time ago,” Steve continued, steel in his voice. “But he died when we sieged Hydra. Killed in action.”\n \nFury looked shocked, and Bucky was hugely impressed with Steve for being the one to cause that.\n \n“Steve Rogers however,” Steve went on, “would like to continue to live his life in the suburbs of New York.”\n \nFury smiled humorlessly, leaning back in his chair. “I have to say, I’m impressed.”\n \n“Thank you, sir.”\n \n“Agent, you could’ve been the best damn director the agency has ever seen,” he said bluntly, and Steve straightened a little bit. “But I know you would always hate it, and that kind of subjectivity is not what this agency needs.” Fury leaned over and pressed a button. “Hill, can you add to the records that Agent One is KIA.”\n \nThere was a lengthy pause. Then, a vaguely confused, “Yes, sir?”\n \n“I’m not going to make it so easy for you,” Fury warned. “You’ll always be on my radar, Agent. Never forget that we made you. Never forget where you came from.”\n \nSteve’s grip on Bucky’s hand was tight. “Yes, sir.”\n \n“I’ll warn the Barnes household to look out for you as Buchanan Rogers,” Fury told Bucky, “but it’s your responsibility to achieve contact. You don’t need our protection anymore.”\n \n“Thanks,” Bucky muttered.\n \n“Dismissed,” Fury said, and turned his back on them.\n \n \n \n“When was I free?” Bucky asked, staring at his watch and trying not to tremble.\n \nSteve looked at him. “November twelfth. 5:54.”\n \nBucky’s shoulders slumped. “Twelve days, three hours, and forty minutes.”\n \nSteve pulled him close, and Bucky pressed his face into Steve’s neck, breathing him in. “We’ll be home in a few hours. We’ll be home.”\n \nSteve decided to drive, and Bucky sat in the passenger’s seat, examining the gouges he’d left on his skin during withdrawal. “How did you find me?” he eventually asked.\n \nSteve gave him a sidelong glance, then reached over and put his hand on Bucky’s knee. Warmth emanated from that point outwards. “Tony saw the license plate of one of the vans, and our paper trail led to the major Hydra base of operations.”\n \n“How quickly did your knee heal?”\n \nSteve shrugged. “I dunno. It wasn’t really the most important thing on my mind,” he said wryly, with a deliberate squeeze of Bucky’s knee.\n \n“You’re an asshole with no sense of self preservation,” Bucky declared.\n \n“But you love me.”\n \n“Yeah,” Bucky sighed, sinking down in his seat. “I really do.”\n \nSteve beamed at him. “Dr. Banner and Mr. Wilson were already sent home,” he told Bucky after a while. “From what I’ve heard, the reunion was pretty heavy.”\n \n“Sorry to miss it,” Bucky mumbled, propping his feet up on the dashboard, just because he could. “They’ve all been kind to me.”\n \n“They’re your friends.”\n \nBucky put his hand on top of Steve’s. Steve smiled but didn’t say anything more.\n \n \n \nWhen they finally got home, the invasive neighbors were waiting on their front lawn. “They fuck are you guys doing out here?” Bucky squawked. “It’s cold!”\n \nNatasha rolled her eyes. “Stop motherhenning,” she snapped, but she was the first to grab Bucky in a bone-crushing hug.\n \nAnd suddenly Bucky was surrounded by the first people he’d considered his friends in a long time. He sniffled a little bit, melting into the hugs and maybe clinging a bit, but none of them seemed to care.\n \nRiley grabbed him in a particularly suffocating embrace and choked out, “Thank you.”\n \n“It was Steve,” Bucky assured him. “It was all Steve.”\n \nSam put his arm around Riley’s shoulders and said, “No, Bucky. It was you too.”\n \nUnsurprisingly, Tony’s way of greeting him was by shouting, “I knew Buchanan was a made-up name.”\n \nBucky rolled his eyes. “It’s really not.”\n \n“Enough of that, Jamie,” Tony shouted, grabbing him tightly. “The bae hath returned.”\n \nBruce shook his head before giving Bucky a tentative hug. “So, I may or may not have slightly sabotaged the memory drug,” he told him. “They wanted me to permanently wipe your memories. I said it wasn’t possible if they still wanted you to be clear-headed, even though I could totally manage that.” He sounded pleased with himself.\n \n“Hey, thanks, man,” Bucky said happily.\n \n“James Bae-chanan Bae-rnes,” Tony was saying. He elbowed Bruce. “Does that work?”\n \nBruce shook his head.\n \n“Dude, I can’t believe you’re not dead,” Clint announced, clapping him on the back. “Sick.”\n \n“Totally,” Bucky said dryly. “None of you are mad about the whole lying about our identities thing?” Bucky asked, gesturing between him and Steve.\n \n“We were a little miffed,” Natasha admitted. “But we got over it pretty quickly. You know, once we realized you’d been captured by the criminal underground.”\n \nBucky felt overwhelmed, and he leaned back into Steve’s chest for comfort. Steve subconsciously wound an arm around Bucky’s waist to keep him there.\n \n“Oh wait!” Tony declared. “You guys are actually married? I kinda assumed that was part of the cover too.”\n \n“No,” Steve said, sounding slightly flustered. “It was part of the cover.”\n \n“But,” Sam cut in, eyes sparkling with mirth and happiness simultaneously, “you fell in love anyway. Oh, that’s adorable.” He reached out to offer Bucky a high five, and Bucky reluctantly slapped Sam’s hand.\n \n“Do you guys all want to hang out tomorrow?” Steve asked. “We’re pretty exhausted.” Bucky nodded in agreement, dropping his weight more heavily on Steve, who didn’t even budge, the bastard.\n \nEverybody agreed and dispersed after more hugs.\n \n“Is there still blood in the studio?” Bucky asked.\n \n“No, it was cleaned,” Steve said, not meeting his eye.\n \n“You cleaned it,” Bucky said incredulously.\n \nSteve lifted a shoulder. “Yeah. I cleaned it.”\n \nThey made their way to the bedroom, and Bucky let his hand ghost over Steve’s apology cartoon before he kicked off his jeans and climbed into bed.\n \nSteve wound his arms around Bucky and pulled him close. “God, I’m never letting you out of my sight again.”\n \n“Good,” Bucky said, tracing the contours of Steve’s perfect face.\n \n“We’re gonna be the clingiest couple ever,” Steve announced.\n \n“I’m oddly on board with that.”\n \nBucky leaned in to capture Steve’s lips. The kiss was soft and chaste, but it was genuine. No one was watching. This kiss was just because.\n \n“I love you,” Bucky sighed, resting his forehead against Steve’s.\n \n“Love you too,” Steve breathed, his eyes fluttering shut.\n \n“The nightmares are gonna be really bad.”\n \n“I know,” Steve whispered, pressing another kiss to Bucky’s lips just because. “And I’ll be here for cuddles.”\n \n“Cuddles and kisses.”\n \n“Can’t forget kisses.”\n \nBut they were both exhausted, and they fell asleep in record time, limbs all twisting together.\n \nEven if Bucky woke up no less than eight times that night. It was infinitely better than waking up in a cell.\n \n \n \nAfter Steve destroyed everyone else in some game that liked to mimic wartime strategy, Bucky and Steve were promptly banned from Clint and Natasha’s household.\n \n“Why me too?” Bucky protested.\n \n“Spousal privilege,” Natasha declared, grinning wolfishly.\n \nBucky didn’t actually feel bad about it because everyone else was leaving around that time too.\n \nSteve was still grinning smugly, his hand linked with Bucky’s, as they got home.\n \n“I invited my family over for dinner next weekend,” Bucky told him. “You could invite your mom too if you want.”\n \n“That’s a great idea, Buck,” Steve murmured, letting his eyes trail over Bucky’s body in a way that felt so deliberate that Bucky shivered.\n \n“Bed?” Bucky asked.\n \n“Bed,” Steve confirmed.\n \nSteve undressed Bucky slowly, letting his hands explore the taut muscles of his stomach before pulling his sweatshirt off in one smooth motion.\n \nBucky tensed, watching as Steve’s gaze fell on his left arm.\n \nSteve made a pained noise and dropped his head to kiss at the rings of scars around his bicep. His lips were sweet and soft against the pain that Rumlow had caused, and Bucky could only issue a shaky but blissful sigh. Steve traced a hand down Bucky’s chest, just feeling, even as he turned Bucky’s wrist over and kissed at the long scar along his forearm.\n \n“Who?” Steve asked roughly.\n \n“Brock Rumlow.”\n \nSteve growled and pulled Bucky close almost possessively. “I should’ve killed him,” he said darkly.\n \nBucky just shook his head and pulled Steve in for a kiss. Their lips were hot against each other, and Bucky quickly traced his tongue long the seam of Steve’s mouth. Steve opened up without hesitation.\n \n“Shirt,” Bucky mumbled distractedly, tugging at said apparel. Steve leaned back and yanked the shirt off, and Bucky scraped his nails over Steve’s abdomen. Goosebumps rose on his skin, and the muscles twitched.\n \nBucky dropped to his knees and fumbled with the buckle of Steve’s motherfucking khakis.\n \n“Buck-“ Steve gasped.\n \n“I’m going to suck your dick,” Bucky explained calmly.\n \n“Fuck.”\n \n“Fucking khakis,” Bucky swore, and yanked the pants down until they were around Steve’s ankles. Steve kicked them off the rest of the way, and Bucky pulled Steve’s underwear down.\n \nBucky took Steve in hand, leaned forward, and started giving it his all, but as Steve’s thighs started to tremble, and Steve’s hand tightened in his hair, Steve surprisingly pushed at Bucky’s shoulder, and Bucky immediately pulled off. “Don’t want to,” Steve gasped. “Not yet. Want this to last.” He cradled Bucky’s face as if it were delicate. “What do you want, Buck?”\n \nBucky ran his hands up Steve’s thighs, thinking. “I want to do everything with you.”\n \nSteve sighed happily.\n \n“But right now I think you should fuck me.”\n \n“Fucking hell, Buck,” Steve groaned. “Yeah,” he managed. “I can do that.”\n \nBucky scrambled to get his jeans off, wincing when the fabric caught on his achingly hard dick.\n \nBucky lay on his back and Steve settled between his thighs, letting his hands roam over Bucky’s skin. The contact was glorious, and Bucky knew there was no way he’d ever get tired of this.\n \nAnd as Steve moved, little breaths shaking, arms trembling, muscles clenching, Bucky knew he’d never seen anything so beautiful. He hiked his legs up on Steve’s back, marveling at this wonderful man. This wonderful man who nobody had ever thought to know, who knew Bucky maybe more than anyone else, who Bucky knew like the back of his hand.\n \nThis wonderful man who had saved his life. Bucky kind of wanted to think that to an extent, he’d saved Steve’s life too.\n \nMaybe they’d saved each other.\n \nSteve reached over to grab Bucky’s hand, and pressed a reverent kiss to his knuckles. Bucky arched on the bed and tipped over the edge. Steve followed after a few more thrusts, and then collapsed heavily onto Bucky’s chest.\n \nBucky traced the muscles of Steve’s broad back absentmindedly.\n \nSteve hummed. “Love you.”\n \nBucky smiled faintly to himself. “Wow, Steve... that was... really gay.”\n \n“Oh, fuck you,” Steve grumbled.\n \n“Urgh, fine,” Bucky sighed, pretending to sound exasperated. “Just gimme a minute to get interested again.”\n \nBucky felt the vibrations of Steve’s soft laugh. Steve fumbled to prop himself up on an elbow. “You’re the worst,” he complained.\n \nBucky smiled, stroking the side of Steve’s face. “Love you too.”\n \nSteve fell back down on Bucky’s chest and hummed again. “You know,” he said idly, “you’re the only person in the world who’s made me feel like an actual person.”\n \nBucky didn’t know what he could say to that, so he pressed a kiss to the top of Steve’s head. “More of you for me, then,” he finally whispered.\n \nSteve traced the rings of scars around his bicep. “Did these hurt?” he asked.\n \n“Yeah.”\n \nSteve kissed him slowly. “I’m so sorry I didn’t get to you sooner.”\n \n“Shut up. You got to me.”\n \nSteve sighed, clearly not convinced.\n \n“Anybody else would’ve just given up on me,” Bucky said fiercely, grabbing Steve’s face. “Anybody else.”\n \nSteve shook his head. “You’ve got friends. They’re all incredibly loyal.”\n \n“They’re your friends too, and that wasn’t the point.”\n \nSteve blew out a breath. “Yeah, I know what your point is.”\n \nBucky grabbed Steve’s hand and guided it to trace his scars- old and new. “My body is a map,” Bucky said, and then moved his hand to press against Steve’s chest- against his steadily beating heart. “Your body is a clean slate.”\n \nSteve looked at him, and his gaze was so tender that Bucky couldn’t stop his lips from curling slightly.\n \n“I love you,” Steve said.\n \n“Yeah, I love you too.”\n \nTurns out, naked cuddling with Steve proved to be an even more euphoric experience than regular cuddling with Steve.\n \n \n \nSeeing his family again was a little wonky.\n \n“I can’t believe you went back to calling yourself Bucky,” Becca exploded, jabbing him in the ribs.\n \nBucky winced.\n \nWinifred was already crying as she hugged him and held up a bag from Maria’s Deli. “We brought you bagels,” she said tearfully. “I won’t have my boy be subjected to that store-bought crap.”\n \n“Aw, thanks ma,” Bucky said, trying not to tear up himself as he took the bagels and shot Steve an ecstatic look. Steve just rolled his eyes fondly.\n \nGeorge, steadfast as ever, just patted him on the shoulder and nodded.\n \nGood talk, dad, his internal monologue drawled.\n \n“And this must be Steve,” Winifred said, clasping her hands with stars in her eyes.\n \nSteve shifted, already uncomfortable with the attention. “Ma’am.”\n \n“None of that. Call me Winifred.”\n \n“Winifred,” Steve amended, shooting Bucky a slightly panicked look. Winifred crushed Steve in a hug, and Bucky stifled a laugh at the little squeak of surprise Steve made.\n \n“James, he’s so hot,” Becca stage whispered. “Like, so hot. How did you manage that?”\n \nBucky shrugged helplessly. “I honestly have no idea.”\n \n“Show me your wedding ring,” Winifred demanded, turning on Bucky. Knowing when to pick his battles, Bucky sighed and stuck his hand out. Winifred cooed appreciatively. “Are you two ever going to have a ceremony now that you’re actually together?”\n \nSteve and Bucky exchanged an uncertain glance. “Uh. We haven’t really discussed it,” Bucky said.\n \n“Well!” Winifred said, clapping her hands together. Steve jumped. “If you ever decide you want to, I’ll plan the whole thing! Navy blue would go great with Steve’s-“\n \n“Okay, thanks, mom,” Bucky said, a little bit too loudly. Becca snickered. “Why don’t we go eat bagels?”\n \nBucky didn’t miss George giving Steve a stern look before making the I’m Watching You gesture and following them into the kitchen.\n \nSteve looked vaguely bewildered as he sat down next to Bucky. Bucky patted him on the thigh. “We’re loud,” he explained needlessly.\n \n“Yeah,” Steve agreed distantly.\n \nBucky and Winifred prepared their bagels in the same exact way, while Becca whined loudly as she rummaged through Bucky’s refrigerator. She eventually yanked out the carton of eggs and started making frittatas.\n \nThe doorbell rang, and Steve jumped to his feet, pulling on Bucky’s hand. “That must be Sarah,” he said, unable to hide his excitement.\n \nBucky grinned and followed him to the door.\n \nA small woman with pale skin and hair like sunshine stood at the door. As soon as she saw Steve, she hauled him down for a hug. “My sweet boy.”\n \n“Hey, ma,” Steve breathed, sagging into Sarah’s embrace before he pulled back and gestured behind him. “This is Bucky.”\n \nBucky stuck out a hand to shake, but Sarah batted it away and pulled him in for a hug too. “Thank you,” she whispered.\n \n“For what?”\n \nSarah rolled her eyes. “For trying to keep his sorry ass out of trouble.”\n \n“Ma!” Steve exclaimed, reddening.\n \nSarah and Bucky snickered. “I think we’re gonna get along,” Bucky told her cheerfully. Steve tried to put on a sullen face, but he looked too delighted to pull it off.\n \nThe Barnes family embraced Sarah warmly as if they’d known her their entire lives. Bucky complained about Becca’s merciless teasing, but Becca was one of his very favorite people in the world, and it was so transparent in the moment that it would be humiliating if he couldn’t see the same sentiment in Becca.\n \n“I got a job,” Becca announced. “While you were busy slumming it here.”\n \n“Fuck you,” Bucky snapped. “I’m in a delicate state.”\n \n“Language,” George said, slapping him on the back of the head.\n \nSteve laughed, eyes crinkling from where he sat next to Sarah. Bucky didn’t know if he’d ever seen Steve look this happy.\n \n“And did you hear about the Johnsons?” Winifred was saying in glee. “Henry’s getting arrested for embezzlement.”\n \n“Don’t sound so happy, mom,” Bucky said with an eye roll.\n \n“We hate the Johnsons,” Winifred explained to Steve and Sarah.\n \n“In that case, we hate the Johnsons too,” Sarah said.\n \nWinifred beamed.\n \nBucky sat down next to Steve, leaning heavily into his side.\n \nThis felt suspiciously like family.\n \nSteve started absentmindedly rubbing circles on his left arm, and Bucky had to blink away tears.\n \nBecca caught his eye, and they exchanged a watery smile as Winifred ranted about the Johnsons, George rolled his eyes affectionately, and Sarah listened avidly.\n \nAnd Steve. Solid and present. Steve dropped a kiss onto the top of his head, and Bucky sighed happily.\n \nBecause yeah. Maybe this was his new family, and maybe Bucky was stupidly happy with the whole thing.\n \n \n \nBucky was straddling Steve on the couch and attacking his husband’s neck like he had a score to settle.\n \nMaking out with Steve: an A+ experience. 10/10 would recommend.\n \nSteve moaned a little bit, running his hands down Bucky’s back with his eyes closed.\n \nBucky was trying to see how long he could make a hickey stay visible on Steve’s super-healing skin.\n \nThe record so far was four and a half minutes.\n \nBut this was Bucky’s pride at stake. He could do better than four and a half fucking minutes.\n \nSteve gasped as Bucky continued playing with the skin between his teeth, and Bucky savored the noise. It was possible that he savored every noise Steve made.\n \nSteve slipped his hands under the front of Bucky’s shirt and felt the muscle there, shifting his hips slightly and- hello there.\n \nThe doorbell rang.\n \nBucky pulled away with a groan. “Why does this always happen?” he whined.\n \nSteve smirked lazily, reaching a hand up to touch the latest bruise. “I dunno.”\n \nBucky sighed and moved to stand before he froze. “Shit. I have a boner. I can’t go to the door with a boner.”\n \n“Think about gross things,” Steve said, looking at the timer on his watch.\n \n“Like what?” Bucky asked frantically.\n \n“I don’t know. Your grandma’s buttcrack.”\n \n“What the fuck, Steve?” Bucky snapped.\n \nSteve rolled his eyes. “I could just suck you off really quickly,” he suggested mildly.\n \n“Not helping,” Bucky hissed.\n \nThe doorbell rang again.\n \n“Help!” he squeaked.\n \nSteve pursed his lips, wracking his brain. “Shit. I don’t fucking know. Khakis. Don’t you hate khakis?”\n \nBucky paused. “Yeah.”\n \nSteve lit up. “Also. Store-bought bagels.”\n \nBucky shuddered.\n \n“Eating store-bought bagels for the rest of your life.”\n \n“Don’t you dare threaten me, Stevie,” Bucky warned, relaxing as his dick finally started to calm the fuck down.\n \nThe doorbell rang again, and Bucky felt safe enough to shuffle to the door after one last appraising glance at the hickey that would probably fade in less than five minutes.\n \nNatasha stood at the door, looking bored. “Game night,” she declared. Liho was sitting at her feet, watching Bucky almost accusingly.\n \nBucky sighed and turned slightly. “Stevie, game night!”\n \nSteve shuffled into the foyer, running a hand through his disheveled hair. Bucky noted with no small amount of satisfaction that his hickey was still there. “Is there any routine in the random nights you say are game night?”\n \nNatasha frowned. “Why do we need routine?”\n \n“Good point,” Steve said. He smiled at Bucky and pressed a kiss to his temple.\n \nBucky smiled back.\n \nLater, he had an appointment with Dr. Ducasse. They were going to talk about potential job opportunities for Bucky. Later, Steve would wrap Bucky in his arms, and he wouldn’t pretend to ward off nightmares. He’d just be there when they inevitably occurred. Later, Bucky would press Steve into the sheets and whisper, I love you, over and over again.\n \nBut for now, maybe all he needed was game night.\n \nIt had been thirty-eight days, twenty hours, and sixteen minutes. Bucky was free.\n \nAnd maybe this time, it would be for good."
}