{
    "id": "566258",
    "url": "https://archiveofourown.org/works/566258?view_full_work=true",
    "author": [
        "entanglednow"
    ],
    "title": "By Any Other Name",
    "rating": "Explicit",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Teen Wolf (TV)"
    ],
    "relationships": [
        "Derek Hale/Stiles Stilinski"
    ],
    "characters": [
        "Derek Hale",
        "Stiles Stilinski"
    ],
    "additional_tags": [
        "Action/Adventure",
        "Angst",
        "Amnesia",
        "Violence",
        "Witches",
        "Hunting"
    ],
    "language": "English",
    "series": "",
    "published": "2012-11-18",
    "completed": null,
    "words": "33,090",
    "chapters": "1/1",
    "comments": "1,431",
    "kudos": "23,543",
    "bookmarks": "7,882",
    "hits": "499,358",
    "summary": "<p>He doesn't know his name, he doesn't know who he is, and neither does the werewolf he's on the run with. But he's pretty sure they hunt monsters, because they seem to be really good at it.</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
    "text": "He wakes up staring at the sky, with absolutely no idea who he is. Which he figures is a crappy start to anyone's day.\nHe can see the flash and dart of sunlight between the leaves overhead, and he can feel the rough, damp press of hard dirt under his back, so he knows he's outside. It's more than just a garden, there's the sense of space, of area, the wet smell of trees and cold air. His head doesn't hurt, so he doesn't think he's suffered any sort of traumatic head injury. Which seems strange because he's pretty sure that's how you get amnesia, isn't it? After a traumatic head injury. You can't hit your head hard enough to forget who you are and not feel it, that's just stupid. The inside of his brain is really just a fog of half-processed thoughts. It's not empty - he knows things, he remembers things, but nothing about him.\nHe's in the woods, he may or may not have a traumatic head injury, but he doesn't seem to be hurt in any other way. That feels like something of an accomplishment. He's clearly smart enough to make deductions based on evidence.\nBut he knows absolutely nothing about himself. There's just nothing there.\nWhat he does know right now, is that someone is fighting an animal roughly ten feet away from him. Not the sort of thing he wants to be lying there and staring at the sky for. He rolls, as quickly as his stiff, protesting body can manage, because he really doesn't want to be on the ground, confused and defenceless, if there's some sort of vicious dog on the loose.\nThe first thing he sees is a dead man, sprawled in the grass next to him. Close enough that he can make out the grisly extent of the man's injuries in a second. His outflung hand is smeared with dirt, leaves clinging to the palm. The fingers are bone-white, his arm leads up to where his throat is a mess of blood and tissue, jaw half torn away, and there's the white flash of bone there that makes his stomach jolt. The smell of it on the wind is unexpectedly sharp, and he's scrambling sideways, trying to get away from the body. From the strange, dead man within touching distance.\nHe'd almost forgotten the fight. But he jerks his head up when a wet, animal snarl is accompanied by the crash of bodies hitting the ground. A crunch of small stones and dirt skitters past him.\nThere's a stranger with glowing, sparking blue eyes, and he's trying to wrestle some sort of animal statue away from - holy shit - that's not an animal. That's a guy with claws - that's a guy with claws and fangs, and the low, burning grate of noise is coming out of his throat. He's the animal. He's the - animal?\nThere's a witch fighting a werewolf right in front of him - and thinking that doesn't help, really doesn't help at all. Because that makes no sense, and when you have no memories the one thing that should be reassuring is what to expect from the rest of the world, for it to make sense, to follow some sort of pattern. Or for it to be, at the very least, normal.\nThe guy with glowing eyes snaps out something he can't hear - or can't translate - then punches half the statue into Werewolf Dude's chest, it literally drives all the way into it, blood spattering all along the witch's sleeves, droplets arcing up to hit his throat and cheek. But it doesn't kill the werewolf, even though there's far too much blood, and growling, and wet, choking heaves of breath. He's not dead, not dying, doesn't look like he's dying from it any time soon at least. He mostly just looks really, really pissed off. Though the way that Glowing Eyes is twisting the statue - like he's trying to blend Werewolf Dude's heart - makes him roar with pain.\nAnd he's just frozen there on his knees in the dirt, watching it happen. Because he doesn't know what to do. But the fact that his first instinct is to scramble upright, heft a spiky branch off the forest floor, and bring it down with all his strength on the side of Glowing Eyes's head, tells him something about himself. The way he grips the wood tight, watches the witch collapse sideways, head a mess of blood and dirt, it tells him things he doesn't understand. But who is he to second guess himself and his own instincts.\nThen he finds himself pulling the fanged monstrosity - werewolf, holy shit, werewolf, werewolves are real - up by the slippery, blood-slick leather of his jacket, and hauling him in the direction of the black, wet-dream of a car, and hoping like hell it's either his, Mr Werewolf's, or that Mr Werewolf knows how to hotwire a car.\nThe werewolf is heavier than hell, all bones and muscle. He's still snarling wetly, bright red eyes and blood-slick fangs far too close to his face to be anything comforting. His grip keeps slipping on the bloody leather of the other guy's jacket, it's running down his wrists in thin streams. He hopes like hell werewolves are more durable than people. Because he thinks he just killed a man for this one - he just killed a man - and he thinks it'd be nice to know his name, if nothing else. Or y'know his own name, no pressure. One thing at a time.\nThey stumble past another dead man on the way, chest being eaten out by some sort of crawling blue flame. Then another by the tree line, facedown in the dirt. What exactly is he a part of? What the hell has he woken into?\n\"Is that your car?\" The weight on his shoulder breathes pain, and doesn't answer. He does his best to tug at the jacket, twist his fingers in the leather to get his attention. \"Hey - dude, is that your car?\"\nThe guy looks at him, confusion and wariness struggling out through the pain. As if he has no idea what's going on either. No idea who he is. That seems to be a thing that's going around. There is definitely a mutual sense of bewilderment here. He honestly doesn't know whether to find that comforting or not. Or whether to be afraid, because people don't lose their memories in groups. That doesn't happen. Was it magic? Were their memories taken by magic?\n\"Do you know who you are?\" he asks, confirming that it's true, or trying to get an explanation.\nThere's a headshake, rough and jerky, which works in place of words. The bleeding werewolf's heavier suddenly, coughing blood, and he stumbles, nearly loses his grip on him and has to tighten his hold, much to the snarling displeasure of said werewolf. Though he doesn't get bitten at least. It's always a good day when you don't get bitten by a werewolf.\nBut he has to say, the werewolf thing totally works for him, it's genuinely terrifying, and on any other day maybe he'd be screaming and begging for his life. But there's a mess of witches decomposing fifty feet away, at least one of which is because of him, and he knows without doubt that they need to get out of here. They need to leave right now, memories or not. This is not a good place to stay. Eventually there'll be police all over this place, eventually there's always police, and right now he doesn't know how to explain werewolves, or self-defence in the face of skin-eating magic.\nHe's digging through the pockets of the werewolf's incredibly tight jeans, and hoping that he isn't going to get anything punctured for it. He's trying not to be over-familiar but they're kind of in a hurry. Yes, so, keys. Apparently he has keys, and apparently the car really does belong to him. Though the werewolf's in no shape to drive, so it looks like it's up to him. He's just glad he remembers how.\nThey get the hell out of dodge - or wherever they are.\n \n*****\n \nWerewolf Dude has mostly healed before they reach the nearest motel. He finds that fascinating enough that he almost swerves off the road twice trying to get a look at it. The guy literally just heals the stab wounds over like they were never there. Until the bloody, torn shirt is a red, dripping mess over perfectly healed skin, and he's staring - he probably shouldn't be staring, it's probably rude, or something. But he's had a tough day so far. Considering this is the third, maybe fourth, magical and impossible thing he's seen already.\nThe motel looks cheap and nasty, and exactly the sort of place that takes cash (they have cash,) doesn't mind the blood stains, (there are a lot of blood stains,) and also doesn't check ID, which he assumes they also have, but he doesn't want to start pulling his stuff out on the side of the road. It's already too dark to see anyway. He doesn't want to lose what identification he might have in a ditch somewhere.\nHe's shaking when he sits on the end of the bed, and he can't make himself stop, because he killed a man, and drove a bleeding werewolf God knows how many miles. He has no idea what his name is, or anything about himself other than he's apparently the type of person that can do this, who knows how to do this, is willing to do this. He's not sure if that's amazing, or terrifying, or some awful third option. Because he's roughly three hours into his life, and there are already dead bodies, and murder, and witches, and werewolves that heal like Wolverine, and cheap motel rooms that smell like people had sex in them, or died in them, or possibly died while having sex in them, which he really doesn't want to think about or he won't be able to touch anything in the room. Basically what he's saying is, that it's a lot to process. He doesn't know if this is normal for him. Is this normal for him? This shouldn't be normal for anyone. What kind of person would this be normal for?\n\"It was a stupid idea to just grab me,\" Werewolf Dude says, from where he's cleaning blood off his face in front of the stupid, full length mirror the room has. It had taken a full minute for him to even care that he was covered in blood, suggesting that he ended up covered in blood a lot, and wasn't that a comforting thought. He'd prowled the motel room like the smell of it offended him.\nThe guy out front must have noticed the blood, but he hadn't said anything about it. He doesn't know whether to worry about that or not.\n\"I could have killed you.\" The angry werewolf is glaring at his reflection now, like he barely notices what he looks like - and how is that even possible? How could you not know you looked like that?\nHe can see his own reflection from where he's sitting on the bed too - where he'd sank into an exhausted heap the minute the door swung shut - and he looks stupidly, incredibly young, face pale and blotchy, and not half as heroic as he was imagining...hoping for?\n\"And yet you didn't, so clearly we know each other, right? That makes sense. If we didn't know each other you would have - what, savaged me or something?\" He'd seen what happened to the people that had been savaged, and he's fairly certain he isn't going to forget that any time soon. He watches Werewolf Dude's jaw work, and he thinks that's as close to a yes as he's going to get. \"Not that I know much about werewolves. Can I just have a moment to let that sink in. I mean, I know I probably know about you and everything already. But - werewolves, I think I deserve a moment to process that there are apparently werewolves, also witches -\" He stops and thinks about it. \"There were witches at least, because we killed a bunch of them. You noticed that right, the dead bodies. There were dead bodies.\" He trails off, because he honestly doesn't know what else to say. But his face looks as shocked as he feels, which is something. There's a dried smear of blood on his cheek, which he hadn't noticed before. He rubs at it with his sleeve, harder than he means to, until it's gone.\n\"You talk a lot,\" Werewolf Dude says. Though he says it like he's pointing it out, noticing it, rather than judging it, or threatening to make him stop.\n\"Huh, I guess I do, I'm - my name, what's my name - ?\" He can't believe it took him this long to really think about it. He digs into his pockets, looking at every piece of plastic and tossing them aside, until he finds one with his face on it. \"Stilinski - no first name. My license has no first name on it. How can I not have a first name? I can't just call myself Stilinski. Also, Jesus that's a horrible photo. I look about twelve. I'm kind of hoping my ID's fake now. If only because that address sounds totally made up.\"\n\"Stiles.\" Werewolf Dude says, voice rough but certain.\n\"What?\"\n\"The witch, the one I killed, he threatened you, and he called you Stiles.\"\n\"My name is Stiles Stilinski?\" he says incredulously. \"What were my parents drunk or something? Don't they know that alliteration is the easiest route to terrible punishment and eternal mockery.\" Stiles? Stiles Stilinski? It doesn't so much roll off the tongue as clatter out in pieces. But he supposes it'll do. It's the only name he has right now. And it's definitely better than no name at all. \"Ok, Stiles Stilinski it is then. Your turn, because I can't keep calling you 'Werewolf Dude,' in my head. Since that is your one defining characteristic. That and the stubble.\"\nThe guy frowns and fishes in his pocket, tosses car keys and cards aside, before flipping one around and squinting at it.\n\"Derek Hale,\" he says, brow furrowing as if he doesn't like the sound of it.\n\"Derek?\" Stiles laughs, he can't help it. Because that is just ridiculous. \"Your name is Derek? Dude, that's got to be a fake name.\"\nDerek's forehead creases further, eyebrows almost meeting. He really doesn't look like a Derek. He looks like maybe he could have eaten a Derek at some point.\n\"Whoever made your fake ID clearly hates you,\" Stiles decides. \"Bet it was the same guy who made mine. We should totally get our money back once we remember who that is. Hey, how old are you?\"\nDerek checks. \"My fake ID says twenty four.\"\n\"I'm seventeen.\" That's a little depressing, though still better than Stiles was expecting. He'd honestly expected younger.\n\"Great, I'm a werewolf with an underage boyfriend.\" Derek glares at himself in the mirror. He looks like he does that a lot.\n\"A grumpy, werewolf with an underage boyfriend - \" Stiles realises what he's saying, somewhat belatedly. \"Hey, whoa, wait, why am I your boyfriend?\"\nDerek looks at him like he's an idiot.\n\"You killed the man that was attacking me, before you even knew my name, and then I let you drag me to a car with four puncture wounds in my chest, let you shove me in the passenger seat and drive my car, without ripping your throat out.\"\nThat's - that's actually pretty fair, and ok, that's - oh my God, wow. Stiles knows nothing about himself other than the fact his boyfriend is a) a werewolf and b) almost too hot to be a real person. So even if it's all downhill from here, at least he started on an unexpected and confusing high. How the hell did he manage that anyway, seriously? The more he thinks about it, the less he believes it. Which suggests he either has shitty self-esteem, or good instincts.\n\"Ok, so I can see how someone would end up with you.\" Stiles gestures in the mirror, towards the very obvious proof of Derek's muscles, and scowly face of improbable hotness. \"But there's no way you'd hook up with me. I mean - look at my nose, my nose is ridiculous, and I barely look seventeen, barely. Jesus.\" He looks away.\nDerek stares at him blankly for a second, and Stiles realises belatedly what he just insinuated about Derek's taste.\n\"Not that I think that's your thing,\" he offers hurriedly. Then thinks about it for a second. \"Though you clearly don't mind if we're...together, and oh my God, I'm just going to stop talking now. I can already tell this is a relationship where I spend a lot of time with my foot in my mouth.\"\nDerek grasps his jaw and turns his face back to look in the mirror.\n\"Maybe not just your foot,\" he says, like he's considering it.\nStiles smacks his hand away. \"Oh my God, quit casting aspersions on my good name - which, granted, we aren't a hundred percent sure on right now.\" He can't help looking at the mirror again, where Derek is currently trying to glare his memories back to the surface. Which probably won't work. Though the guy's giving it a damn good go. \"I'm probably not your boyfriend,\" Stiles says. \"Have you seen you? You're like - no, you know what, I'm not even going to finish that, because clearly you're a guy who has your ego stroked constantly. You probably can't even say hi to someone without them immediately falling all over themselves to tell you how pretty you are.\"\nDerek's eyebrows just look insulted now. Insulted in his direction.\n\"Don't even look at me like that, you know it's true.\" Stiles takes a moment to rub a hand over his hair, and wonder why it's so short. If it's a personal choice, or there was some horrible incident with open flames, or gum. He looks like the sort of person who could have an accident like that.\n\"I think you are,\" Derek says grudgingly.\n\"What?\" Stiles stops trying to decide if he likes his ears and looks at him.\n\"My - \" Derek stops and pulls a face. \"I think we're together.\" He shakes his head, as if whatever he's feeling is hard to explain. \"You feel almost familiar, everything else - the idea of anyone else coming close to me is - it makes me want to break something. You, you're non-threatening, you're like a vibration under the skin, all tones of motion and enthusiasm, and you're - good.\" The frown slips away, as if he'd found the word he was struggling for.\nGood? Stiles supposes he can live with that.\n\"So does that mean you - do you find me attractive?\" He can't believe he actually asked that, once it's out. But he does genuinely want to know. He's trying to piece together what the hell is going on, and if they're together then Derek must at least find him a little attractive, right? Also, it'll be a huge ego boost if the answer's yes.\nDerek throws him a pointed look.\n\"I did, before I knew you were underage.\"\nStiles glares at him. \"Oh, ouch, way to wound a guy. Clearly your memory-having self didn't care.\"\n\"Not surprising,\" Derek says, mostly to his own reflection. \"I look like a fucking criminal.\"\nStiles wants to point out that if they're having sex then he technically is a criminal. But he's fairly certain that the murder trumps the underage sex anyway.\n\"You certainly do look dangerous, even when you're not all fanged-out.\"\nDerek pulls a face at him, which he can read perfectly for all that they're mostly strangers.\n\"That's what I'm calling it, in my head. You're not going to stop me calling it that. It's like the perfect description of what you did, with the teeth and the eyes and the whole -\" He waves a hand around Derek's general vicinity. \"Sexy Wolverine thing you have going on.\"\nDerek rolls his eyes and tosses his shirt towards the bathroom.\n\"So, er, what exactly do we know about us?\" Stiles asks. \"Aside from the elephant in the room that is you being a werewolf. Because I don't remember anything about being me, but I definitely remember that werewolves aren't supposed to be real. I would definitely remember if we lived in a world where werewolves were supposed to be real.\"\nDerek glares at him, as if doubting the truth of his existence is insulting somehow.\n\"Well, we know you talk too much,\"  he starts, like that was the most obvious thing.\n\"Hey.\" Stiles wonders if they have the sort of relationship where friendly shoving is allowed.\n\"Witches are hunting us,\" Derek adds. \"We probably lost our memories via magic, and I own a Camaro.\"\n\"And that is a freakin' beautiful car, by the way, we could probably dig through it later for clues or something - oh.\" Stiles slides off the bed and scoots across the carpet on his knees. To the chair where Derek threw his jacket, and he fishes through the pockets. \"I know you have a phone, I saw it when you were looking for cash when we paid -\" He pulls it out with a noise of discovery, then wonders if that's some sort of weird violation, even though neither of them know who they are. Can you violate people's privacy when no one remembers if they want to be private or not? So many questions.\nHe tosses it to Derek.\n\"Check your phonebook.\"\nDerek frowns.\n\"We don't know anything about ourselves, or each other. But you still have your phone, and the people in your phone will know who you are at least,\" Stiles explains, shuffling close again. \"Hell they'll probably know who I am if we're as close as you think we are. Who's in your contact list.\"\nDerek reads out the names as he scrolls through them.\n\"Boyd, Deaton, Erica, Isaac, Peter, Scott, Stiles.\"\nStiles makes a frustrated noise.\n\"Are any of those familiar to you? Except me, obviously, or at least I'm assuming that's me. I have no phone - I think the witch guy broke it. Because none of them sound familiar to me. I guess I should know your friends, or some of them at least.\"\nDerek shakes his head.\n\"No mom or dad?\" Stiles adds. \"That's weird right? Unless they're dead, or you don't talk to them. Who calls you the most?\" He tries to get a better look over Derek's arm, though he's being very protective of his mysterious numbers.\nDerek hits a couple of buttons, and then his eyebrow flicks up.\n\"You do.\" He turns the phone so Stiles can see his own name, repeated over and over through the list of names and numbers.\n\"Well that's not going to be any help, since I don't remember being me. Though I suppose that kind of answers the question of whether we're together. Look how clingy I am.\" He wonders if he should be embarrassed about that. Not that it really matters because he is a little bit anyway. \"Any messages?\"\n\"Deleted,\" Derek says simply.\n\"Outgoing messages?\" Stiles suggests, after a second's thought. \"Have you sent anything in the last twenty four hours?\"\nDerek's quiet for a second, thumb moving.\n\"There's one. 'They're tracking you, don't go home, don't tell Scott what we're doing,'\" he reads, then turns the phone so Stiles can see again.\n\"Great, we're being hunted by witches, and - Scott's the guy in your phone right? Why were we not supposed to tell him. Was he one of the people after us? Who's Scott?\" If someone betrayed them that makes Derek's entire phone suspect. Judging by Derek's expression he's thinking the same thing.\n\"Why do you keep asking me?\" Derek says stiffly, with that frustrated huff of air through his nose, that Stiles thinks is definitely his thing.\nStiles shrugs, because he genuinely doesn't know. He's mostly thinking aloud, and Derek's the only person around so he's thinking aloud at him.\n\"So, the Scott from your phone, he was part of this or something? Did he betray us?\"\nDerek sighs and pointedly shakes the phone.\n\"Right, right, you know nothing either.\" Stiles makes reassuring gestures. \"I'm sorry, I'm clearly a questioner, I am compelled to ask questions in the face of confusion and bewilderment. Just assume I'm adding 'do you think?' to the end of all my sentences, ok. I think that'll be easier, or at least cut down on the frustration all round.\"\n\"The answer's still 'I don't know,'\" Derek says, though Stiles's explanation doesn't seem to have softened his tone much.\n\"Wow, you really are very grumpy,\" Stiles tells him. \"Do you think that's a werewolf thing, or just a you thing?\"\nDerek looks like he kind of wants to hit him with the phone. So, yes, almost certainly a Derek thing.\n\"It's totally a you thing, isn't it? Insanely hot and grumpy is your thing, and apparently my thing as well, who knew? Ok, so we're being possibly hunted by witches, whose powers we aren't entirely sure of yet. Can witches track people via cellphones? Can witches track people in general. I feel like I'm running blind here. I don't even know if I knew there were witches yesterday. I mean I could have had some sort of witch-proof plan laid out for us yesterday, and I wouldn't know anything about it.\" It's frustrating, suddenly, how much he wants to grasp whoever he was, or is. But there's just nothing there.\n\"It's best to be safe,\" Derek says stiffly, and then takes hold of his phone in both hands like he's going to snap it in half.\n\"Wait!\" Stiles reaches over and twists it out of Derek's hand, then flips over the pad on the bedside table and snags the pen beside it. \"I'm going to take down the numbers first. Who knows if we'll need to get hold of one of them later. It is pretty much the only connection we have with who we are, trustworthy or not.\" He manages to get them down before Derek starts pulling the phone into pieces. He literally just pulls the thing apart, and the pen goes slack in Stiles's fingers. \"Dude, exactly how strong are you?\"\nDerek looks down at where he's been snapping the plastic and metal, without even thinking about it. Shards of it falling silently to land in the threadbare motel carpet.\n\"Are you going to, like, dislocate my shoulder giving me a friendly punch or what?\" Stiles says, then laughs in a way that only half sounds like it's joking. \"Because if that's an option I'm going to veto the friendly punching right now. Oh my God, no, you know what, if we're actually dating then there will be no punches, at all. Because I'm pretty sure that abusive werewolf boyfriend is a Lifetime movie too far for me.\"\nDerek glares at him. \"I can control myself.\"\nStiles raises an eyebrow.\n\"How do you even know that?\"\n\"You're still in one piece, aren't you,\" Derek points out.\nWhich sounds weirdly threatening, or possibly dirty, Stiles doesn't even know. He doesn't know Derek well enough to be able to tell if he's joking.\n\"What's that supposed to mean?\" Stiles demands.\n\"You're very annoying,\" Derek says quietly, then tips his head forward in a way that Stiles thinks is supposed to mean something.\n\"You're the one who decided to date me, and hey, you're not exactly a -\" Stiles inhales the end of the sentence, because Derek has stalked his way closer, without Stiles even realising it. All predator smile and warm breath.\nDerek takes up space in a way he doesn't even seem to notice, radiating heat and intensity that leaves Stiles's mouth suddenly very dry. Because he thinks Derek's going to kiss him - almost definitely going to kiss him, no matter how insane that seems. The thought shouldn't be so startling. If they're together, if they're in a relationship then they probably do this all the time. But Stiles doesn't remember it, they don't really know each other at all right now. What if they've gotten this horribly wrong. What if they're not together, what if it's all weirdly circumstantial and it's just because Stiles smells completely non-threatening, or Derek knows him because of some other completely non-sexy reason. What if they're related?\nHe laughs a little, quiet and breathless, and it cracks as it slides down his throat.\n\"What if it's not true,\" Stiles says quickly, heart pounding. \"We could be related, we could be brothers. How creepy and disturbing would that be?\" He's rambling and he knows it, but he can't stop.\n\"We're not brothers.\" Derek tries to tug his face close again, and Stiles can't think of a single reason not to let him. He wants Derek to kiss him, and he honestly has no idea why he's pretending that he doesn't. He doesn't know why he's so nervous about just letting it happen.\nDerek's mouth is warm, all easy shift and pressure. Stiles lifts his hands and curls his fingertips in Derek's shirt, opens up a little for him. The kiss goes deep, turns into a wet slide of tongues, and a harsh grate of stubble that makes his insides feel tangled and hot. It's really, really good, it's better than Stiles has any frame of reference for. Which makes the fact that Derek pulls away very confusing, and a little upsetting.\n\"What? Why did you stop?\" he says numbly, his mouth is still wet, which is weirdly distracting.\n\"You're -\" Derek stops, frowning.\n\"What? I'm what?\" Stiles isn't quite sure whether he sounds nervous or irritated, adrenaline makes his voice louder than he means.\n\"Not familiar,\" Derek says, with a frown of disappointment. \"I thought I'd feel something.\"\n\"Oh screw you,\" Stiles says sharply, face colouring, trying to twist his way out of Derek's impossible grip.\n\"No,\" Derek eases him back into stillness, gives a frustrated sigh. \"I didn't mean it like that, I just meant you feel new, I thought if you were mine I'd know it.\"\nStiles thinks about objecting to the 'mine' part of that sentence. But he's finding it really hard to think straight after that.\n\"I think we've already established how memorable I am,\" Stiles says, trying to make a joke, and feeling kind of shitty, because it's fairly obvious that Derek has gotten it out of his system, and he has no intention of kissing him again.\nBut then he does, he just sways back in, as if it's that easy for him, slightly too much pressure, and the faint scrape of sharp teeth.\n\"I never said I didn't want to,\" Derek says roughly, right into his mouth. Before he's sliding away.\nStiles doesn't know what to say to that. He isn't sure he's supposed to say anything to that.\n\"It's late,\" Derek says. \"And you're human, you should get some sleep.\"\nStiles mouth still doesn't work well enough to form words, so he just stupidly watches Derek shut himself in the bathroom.\n\"It's awesome how you say 'human' like it's an insult,\" he mutters. Which doesn't get a reply, but he knows Derek can still hear him.\nHe finds the remote and turns the TV on, just for some noise. Because that's easier than thinking about the fact that he's way too wired to sleep. He feels like he's barely been awake that long. It wasn't long ago at all that he was a completely blank slate, before he murdered a man for his werewolf boyfriend, who kisses him like it's easy. How is he supposed to sleep, how is he supposed to stop thinking about that for long enough to sleep?\nAs if to prove himself wrong, he falls asleep to the drone of the TV, playing reruns of the Outer Limits, even though the bed is strange and cold, and he still feels like there's a giant hole in his head. He vaguely registers waking up at some point to a completely dark room. Derek has stretched out beside him on the bed. Which is reassuring in a way he doesn't even know how to put into words. He isn't sure why, he isn't sure how to explain that without accepting that Derek is his in some way - or that he's Derek's, but that rankles somehow. The thought of belonging to someone.\nHe finds a cool space on the pillow and shuts his eyes again.\n \n*****\n \nThe second day of Stiles's life, he wakes up being aggressively spooned by the werewolf he met yesterday.\nIt feels like the sort of thing a person should freak out over. Because this definitely isn't how they ended up last night. But he's still mostly half asleep, so instead there's a vague sort of annoyance that his leg has fallen out of the covers, and a weird absence of tension. Also, he thinks he might have stubble burn on the back of his neck. Which he supposes he's used to, in another life. He can't be bothered to move, even though the light coming through the tatty curtains tells him it's probably close to midday. He doesn't know if he's the sort of person who sleeps until midday, but he feels like he could at least pretend to be one of those people, just this once.\nAlso Stiles has discovered something which may be of crucial importance later. Werewolves apparently snore, yes they do.\nThough Derek must have some sort of sixth sense that Stiles is awake because he stiffens up briefly, and then he's pressing his face against the back of Stiles's neck, before relaxing again. Derek seems to have had the same idea as him, turning his scratchy face into Stiles's easily irritated skin, rather than cope with the glaring and pointed evidence of daytime.\n\"Er - morning?\" Stiles says, with what is probably way too much enthusiasm. But they're pressed really tightly together, which hadn't seemed as awkward when Stiles was half asleep, and Derek was snoring against his shoulder. In fact he should probably get up now. Because he has no idea how someone should behave when you're in bed with the man you lost your memory with yesterday, the man you almost certainly usually have morning sex with. And thinking that doesn't make anything less terrifying, exactly the opposite actually. \"I should - do you want the bathroom because I was going to shower?\"\nDerek's nose does this weird drag up through his hair, like he can't resist, and oh Jesus, there shouldn't be any sort of nerve endings there attached to his dick. But it's already coping with a lot at the moment, so he's going to give it a pass.\n\"No, I'm good,\" Derek says smoothly, and doesn't make any attempt to roll away, or move his hand from the curve of Stiles's hip - where it's currently burning some sort of permanent impression.\nStiles gurgles an answer - that may or may not be coherent - and then forces himself out of bed, before he can change his mind, or do something stupid, or register that there's a naked werewolf stretching in a way that could be considered gratuitous on the other side of the bed.\nJesus fucking Christ.\nHe shuts himself in the bathroom.\nHe stalls in the shower for as long as he can, and doesn't jerk off, even though he really, really wants to. He uses his finger to get his teeth as clean as possible. Then he stares at himself in the mirror, as hard as he can. But his face is still giving him nothing. He still knows nothing about this pale, baby-faced, lanky, weird-nosed, surprisingly hairy, seventeen year old, who has an underwear-model-hot, werewolf boyfriend, and is being hunted by witches for some unknown reason. He still has the strangest feeling that this is all a misunderstanding. That he has to be someone ordinary, he feels ordinary, everything that's happened to him so far has been completely insane, and, ok, fine the fact that he's mostly dealt with it like it was normal for him says that he might be reaching with 'ordinary.' But he doesn't feel...special.\nHe puts on yesterday's clothes, because he doesn't have any others. They still look clean enough, for all that he woke up yesterday on a forest floor and then hauled a bleeding werewolf a hundred yards.\nWhen he opens the bathroom door he finds the room empty. He has about ten minutes to panic about that, and wonder if he's been abandoned. The thought of being abandoned in some seedy motel in the middle of nowhere, when he's not even a hundred percent sure of his real name, makes him feel a little bit sick.\nBut then Derek is standing in the doorway, holding a container with two cups of coffee in it, and a paper bag that smells like breakfast.\nStiles is immediately a mess of relief, and some weird sort of other emotion that hadn't had long enough to decide what it was yet.\n\"I didn't know whether you wanted sweet or savoury,\" Derek says, and this is the first time Stiles has seen him look uncertain. \"So I got you both.\"\n\"Oh my God, I love you,\" Stiles says, and he's stolen the warm paper bag, and one of the tall cups of coffee before he can even really register the weird look he's getting. \"What?\"\n\"Nothing,\" Derek says quietly. He throws his keys on the table.\nStiles eats everything, before it occurs to him that Derek might have wanted whichever one he didn't pick, and he has a moment to feel horribly guilty, before he realises that Derek's watching him with this weird little half-smile, like witnessing him eat was the most entertaining thing he'd ever seen. Stiles drinks half the cup of coffee, rather than feel embarrassed, and discovers that he's either not a huge coffee drinker, or this is really awful coffee. Or maybe both, because God, that's really awful. Even with the sugar Derek has clearly randomly guessed about. His taste buds are never going to forgive him for this. He drinks it anyway, because Derek's still looking weirdly unsure what he's supposed to do.\n\"Thanks, I mean, for that - you had something right. I didn't - you weren't going to eat one of those?\"\n\"I'm good,\" Derek says.\n\"You have to tell me, dude. I get the feeling I miss things, and I also don't think you should have given me coffee because I think stimulants are probably a really bad idea for me -\" Stiles can't talk then, because there's a bitter, coffee flavoured mouth over his own, and he decides that he might change his mind about the taste, because this is so much better. He tries to kiss back, more than he'd managed the first time Derek kissed him. He gets his hands in the soft leather of Derek's collar and does his best to relearn whatever he's forgotten.\nHe thinks that Derek means to pull away but changes his mind at least twice. Stiles feels pretty awesome about that.\n\"The car,\" Derek says, sounding reluctant and distracted. Though it still makes absolutely no sense at all.\n\"What?\"\n\"You said something yesterday about going through the car, to look for clues.\"\n\"Yeah,\" Stiles says stupidly, because that's an awesome idea, he remembers doing that. But he's already leaning forward and, yeah, kissing again. This is fucking amazing. He has no objection if Derek wants to skip the whole getting their memory back for the day, and just kiss him for the next hour or so. But Derek pulls away, and whatever Stiles's face looks like probably isn't very flattering, because Derek does this half-smiling thing, like he's decided, yeah, Stiles is his. Which is horribly smug, and Stiles should be irritated, or he should punch him on the arm or something. But instead his pulse does this frantic, epileptic thing inside his throat, mouth suddenly dry.\nHe's half-hard in his jeans.\nThis is so unfair.\n \n*****\n \nStiles wasn't lying before, the Camaro is a beautiful car, and he doesn't know whether Derek owns it or whether he stole it, but he clearly knows his way around it, with some sort of awesome muscle-memory or something (which Stiles hasn't experienced yet. But Derek clearly has more muscles to help him with that.)\nDerek pops the trunk, while Stiles rifles through the glove compartment, under the seats, under the visors, the darkness of the backseat. He finds a spare phone (with no numbers or call history,) another set of keys to somewhere, car information, what looks like a folded up collection of maps, printed pages, and torn out articles, and a half scribbled-in notepad. He uses a pen he finds in the glove compartment to check and yes, that's Stiles's handwriting on the pad and the maps. So they clearly belong to him. He also finds a book under the passenger seat. Enough to make everything more confusing, until he goes through it, works out what any of it means, if any of it means anything important.\nDerek appears by the door. He dumps a bag where Stiles's leg still juts out of the car.\n\"What did you find?\" he asks.\n\"Phone.\" Stiles holds it up and shakes it. \"No numbers programmed in, car stuff, maps with a couple a places circled - \" He goes to unfold them, and then thinks better of it. \"Can't see properly, I'll unfold them in the room, there's some print-outs, some articles, a notepad that I have apparently written it.\" He shows Derek by flicking the pages and waggling the pen. \"Oh, and a book about curses and cursed artifacts, which, just so you know, does not fill me with good feelings. What about you? What did we get from the trunk?\"\nDerek toes the bag at his feet.\n\"Couple of changes of clothes, money, magazines - probably not mine.\" Derek tosses them into Stiles's lap, and he has to agree, because one of them is questioning whether he's getting excited about the newest hairstyles, and the other is a science magazine, chemistry by the look of it. \"Crowbar, some ammunition but no gun, smells a little like guns in there though. Mostly it smells like blood, human, witch, werewolf, and something else, snakes maybe - I don't know, it's familiar and yet not at the same time.\" Derek shakes his head roughly, as if he just doesn't know.\n\"You know, I thought your awesome sense of smell would be more helpful.\" Stiles offers up a frustrated little frown.\n\"There's too much,\" Derek grumbles, and Stiles can't tell if he sounds hurt or pissed. \"Most of it's just the way things smell, food, people, animals, some of it's familiar, but I don't know from where, or when, or if we need to know about it. I don't have anything to go on. I don't remember enough to separate out what's important from what isn't.\"\n\"I wasn't complaining,\" Stiles says quietly, because he didn't mean to make it sound like Derek wasn't trying, or he wasn't helping. He didn't mean that at all. \"I'm sorry, I just, I don't know how this works.\"\n\"I'm kind of winging it too you know.\" Derek sighs out a breath. \"I know how to be...I know how to be what I am, but that's about it.\" His shoulders roll when he says it, Stiles thinks maybe not all the things he knows how to do are nice. And he's not entirely comfortable with it.\n\"Y'know,\" Stiles starts, looking down at the maps, and the notepad, and the dark dashboard. \"I was joking when I was mentally referring to us as monster hunters, but I'm starting to think that may be an actual possibility.\"\nDerek still seems to want to assume nothing until proven otherwise. In fact he's looking at Stiles as if maybe he wants to say, 'you watch too much TV,' or 'this is just like you,' but he doesn't know if any of that's true. Because they don't know anything about each other, except that they know each other, and they maybe trust each other? Which makes everything else...not easy, but easier. Trying to pick up clues about your life from your things. It's hard - harder than it should be.\n\"Look through it while I shower,\" Derek says with a nod.\n\"You trust me with all this stuff?\" Stuff which he ends up carrying, because Derek is locking the car, and hefting the bag. Forcing Stiles to follow him back to the room.\n\"I'm thinking you're smarter than you look,\" Derek says ahead of him.\n\"Oh my God, I think that was an insult. I can't even believe -\" And he's talking to the bathroom door.\nStiles sighs and dumps it all on the bed, sets it all out, maps and torn-out articles, and the notes made in his own handwriting. He shoves the motel pen in his mouth (and only worries later about shoving a motel pen is his mouth because, ugh, fuck. But it's way too late by then.) He sets them all together, scribbles notes down next to the notes he made, while he was still him. Because there are gaps where he clearly thought stuff was too obvious to write down. Some stuff about 'the old house' which means nothing to him, but probably did to past!him. Something about the woods, seriously, which woods? Then there's something that looks like some sort of number code. Which he'll have to look up later, somehow, somewhere.\nBut after a while he thinks he has something. It's not good, it's kind of messed up, but it's concrete. There's evidence here when you start pushing it all together, and Stiles thinks he kind of rocks at this stuff. He probably would have made an awesome cop, if he wasn't already some monster-hunting werewolf's jailbait boyfriend.\nHe drops a leg off the bed, and cautiously tests the bathroom door, which Derek hasn't locked.\nIt opens easily, though probably not silently, because Derek's head tilts, just a little. Stiles can see him perfectly, because he hasn't bothered pulling the curtain, all planes of pale skin, turning slowly into the spray. It's not even like he hasn't already seen Derek naked, at some point, probably, many times. He must have done, unless they have sex in the dark, and seriously if Stiles were Derek he wouldn't do anything in the dark. He'd look at himself all the time.\nHe knows that Derek knows he's there. His werewolf senses are insane. So the fact that he's just standing there and staring, probably hasn't escaped his notice.\n\"Umm, I think I might have found something, when you're finished.\"\nDerek shakes his head under the spray, and then turns around and looks at him. He's not even pretending to be embarrassed about his body, and Stiles isn't pretending not to look, because it just doesn't occur to him. How is he supposed to do anything else? Because Derek looks like he's been carved in marble, like someone just went to work on every stupidly perfect line of him, and water streams down his body in a way that seems to want to draw attention to every single one of them.\nHe really is intimidatingly, nakedly beautiful.\nStiles hates that his face is probably red, and blotchy, and awful right now. He huffs like he can pretend the whole arousal thing is an embarrassing but completely expected consequence, what with Derek flaunting himself like a...like a thing. He exhales shakily, and then quietly pulls the door shut. He leans back against it afterwards and calls himself several unflattering names.\n*****\nDerek does eventually reappear, toweling his ridiculous hair dry, in a way that will probably leave it looking sexy and effortless. Whereas Stiles suspects he shaves his own head because he couldn't get any sort of hair to go with his face. Derek surveys the mess of paper that Stiles is currently in danger of being consumed by, if appearances are to be believed. It covers every inch of the bed, including his lap. Notes on random pieces of paper are slapped in wherever there seems to be even a vague connection. There are a lot of vague connections - but everything about Stiles's life is pretty vague right now, so he thinks that's only fair.\nAt Stiles's gesture Derek drags a chair over and sits in it. Stiles holds his hands over the huge mess of it, making sure nothing gets swept out of place, because it's in order, it's mostly in order, and he's really hoping he's got this right.\n\"Ok, so some of this I'm guessing about - some of this I have to guess about, since we have no memory of anything that happened more than two days ago. As far as I can tell three days ago we were in Beacon Hills, just inside the woods, roughly here.\" Stiles points it out on the map. \"That's where we started, where we lost our memory, where we fought the witches.\" He taps the paper he's settled on top of the map. \"Either we tracked the witches coming in, or we followed them there. I don't know for certain. I do know, with a fairly high degree of certainty, that we set a trap for the one that has a name.\" Stiles twists the pad around until Derek can read the name 'Andrew Frain.'\n\"We set a trap?\"\n\"Yeah.\" Stiles says with a frown. \"Which didn't exactly go as planned, as you can probably guess yourself by the way it turned out.\"\n\"Why?\" Derek asks.\nStiles picks up several of the newspaper articles, and passes them over. Derek gives him a look and straightens them out.\n\"I think this is why. They're all stories about children - well technically anyone under eighteen, but they're mostly children - disappearing. The disappearances move through three states. In a few of them the bodies were eventually found. But mostly they just disappear without a trace. They don't say a lot, but something about the way they were saying it told me the official stories were hiding something really unpleasant. And when you put it together with the other stuff I found in the car it starts to make a horrible sort of sense.\"\nStiles unfolds a piece of printed paper, and turns it so Derek can see it. There's what looks like an ugly green brooch lying on red velvet.\n\"This is apparently called the Stone of Echoes, which is a horribly pretentious name for a piece of horribly gaudy jewelery. But it's in the book with the curses and cursed artifacts. It was made in the eighteenth century, in France, by some aristocrat that went crazy and killed all four of his children. According to the book it's supposed to be able to increase the power of the witch who possesses it, to a freakin' insane degree. Believe that or not, I have no idea if it's true. But it's also supposed to be cursed, and it will literally rot your body from the inside out if you don't feed it. So pretty much your average magical ring of power, and Frain has it.\"\n\"Feed it?\" Derek's mouth twists.\n\"Yeah,\" Stiles winces because he's been thinking about that, and wishing he didn't have to. \"And I'll give you one guess what the creepy stone eats.\"\n\"He's feeding it children?\" Derek grinds out.\n\"It doesn't actually say that, but I'm guessing, yes. Which is why we were after him. Which is why we tracked him from...wherever he came from, to Beacon Hills.\"\n\"Which is why we laid a trap for him,\" Derek says, and he's nodding, so Stiles assumes he's following this.\nStiles nods back. \"And I think I was the bait in our trap,\" he says slowly.\nDerek's teeth press together. Stiles keeps going before he can speak.\n\"No, it was actually a good plan, in fact I think it was my idea.\" He flips through the pad he'd scribbled in. \"Here's a list of similarities between the other kids, as if we were making a list - and I fit more than a few of them.\" He flips another few pages. \"And this is something about something called mountain ash being used to mask the presence of werewolves, to make protective circles as well I think. I've underlined that three times, so I figure you probably put up a protest at least. There are a few references to Deaton here, that's the same name as in your phone. I get the feeling he's our go-to guy for magical information, and possibly weapons? And, ok, fine, I could be making our life sound less like an episode of Supernatural. But the evidence was kind of in your car, I can only work with what you give me. There are some mentions of 'the house,' which I have no context for. But it seems to relate to Beacon Hills again. A meeting place for them? Frain's house maybe?\"\nStiles drops the pad.\n\"I don't know what went wrong, but I'm going to take a wild guess that the one thing we didn't expect was the sheer number of witches that would be tracking Frain as well. For the stone, I'm assuming they want to steal his shiny jewelery for themselves, or, I don't know, maybe followers? So, yeah, I think we were prepared, but we were outnumbered too. The only thing I'm not clear on is how we lost our memories.\" He chews the pen he's holding, looks up at Derek to see what he thinks.\n\"You worked all that out while I was showering?\" Derek says quietly. He looks kind of stunned.\nStiles grins at him a little.\n\"Yeah, I get the feeling that I do the planning,\" he says. \"I mean obviously I don't remember anything. But the putting things together, the making things work, I feel like I'm good at that. So, I'm thinking, maybe I take care of the what, and the why, and you take care of the how with your enormous werewolf muscles.\" He doesn't bother gesturing, because they're both aware of the enormous werewolf muscles. Stiles has had trouble not looking at them for the last twenty four hours. \"It works, right?\" He really wants Derek to say yes, because this is first time he's actually felt like he has a grasp of what's going on.\nBut Derek doesn't look convinced. He shakes his head.\n\"We're not monster hunters, Stiles,\" he says carefully.\n\"Are you sure about that?\" Stiles throws the pad down, watches it bend the map, and paper rushes into the dip it makes, a scatter of notations, and names, and places. \"Are you absolutely sure?\"\nDerek exhales and stares down at the map, covered in circles and wind direction and what looks like the range of his own hearing and sense of smell. Stiles can tell that he's really not. The evidence has gone way beyond circumstantial, because they were clearly hunting something - and everything here says that they've done it before. That they had experience, somehow.\n\"You trust me right?\" Stiles asks quietly.\nDerek goes very still, and it's only then that Stiles realises what a stupid question that is. They don't even know each other. How can Derek be expected to trust him in a day and a half.\n\"No,\" he says quickly. \"I mean, forget I said that, it's stupid -\"\n\"Yes,\" Derek says, which seems to surprise him as much as Stiles. \"Yes, I trust you. I probably shouldn't right now, I shouldn't trust anyone. But I trust you.\"\nStiles stares at him, because for a second Derek looks something that comes frighteningly close to vulnerable, like he really doesn't know why he trusts him. He shuffles on his knees to the end of the bed, pushing paper out of the way, until their knees brush, and Derek's hand lifts briefly, as if it wants to touch him, before settling on the folded edge of a map instead. Stiles doesn't know what that means.\n\"I mean obviously you can do things I can't do. You can heal, and you're super-strong, and I'm pretty sure a bunch of other things you haven't told me, or we don't know about.\" Stiles glances at Derek, but his expression isn't really helpful. \"So, I was thinking maybe it was because you trust me to tell you what to do - I don't mean like all the time,\" Stiles clarifies, when Derek huffs disbelief. \"I mean that I tell you where we're going, what we're hunting. Is that stupid? Because that didn't sound stupid in my head. When I was working it all out it sounded like it made complete sense. But I'm obviously not who I'm supposed to be, and I'm up to my neck in stuff I don't know, and if I'm getting things like this wrong -\"\nDerek catches his hand mid-flail.\n\"Stiles, breathe,\" he says simply.\nAnd just like that, he does, slow and briefly painful, and he hadn't even realised how tight his chest was getting. He gives a shaky laugh.\n\"Fuck.\"\n\"No,\" Derek starts, cautiously. His hand's still tangled with Stiles's, thumb dragging on his skin like he hasn't noticed, which makes something in Stiles's chest tighten. \"I - you may not be entirely wrong. The telling me what to do part, maybe, sometimes.\"\n\"You're really sore on that aren't you? You want to be the one telling people what to do, don't you? Oh my god, you probably boss me around in bed all the time.\" Stiles realises what he's said a second after he says it, and he can feel heat flood his face. \"I mean - I didn't mean to say that. Wow, I really do just say whatever I'm thinking don't I?\"\nDerek's still watching him, expression amused, and - not just amused, oh my God, kind of intrigued as well.\n\"Er, where was I? Oh, yeah, I never said you agreed to it all, did I? You probably complain, and growl at me all the time, and yell at me for talking too much - but if I've proven that I can do it. That I don't put you in danger. If we do this, do you think we do this, Derek? Is this who we are?\" Stiles's heart is beating so fast, and it was all so easy when he was laying it all out like a puzzle. It was easy when he was treating it like a game, when it wasn't their whole life. Because this is as good as a name when you don't know who you are. But who Stiles apparently is - he's confused, and awed, and fucking terrified by it.\n\"Yeah,\" Derek says quietly, and his face goes some way towards reassuring Stiles that he isn't crazy, that it isn't just him. \"I think maybe this is who we are.\"\nStiles gives a weak little laugh, and Derek's hand is still on him somehow, but that's ok, that's more than ok.\n\"This is dangerous for you, more than dangerous.\" Derek seems to realise, all at once.\nStiles nods, shakily, because, yeah, obviously. But he thinks they must have had this conversation already, because he's still here.\n\"If I didn't want danger I'd probably still be in school somewhere, and not dating a werewolf, with witches out for my blood. Something tells me you don't fall into crap like this without seeing it. I think I made a choice somewhere, that I chose this. That maybe I chose you - to stay with you, I mean.\" It's so awkward to say, like some weird declaration he doesn't intend, in a relationship he doesn't remember. That he still doesn't know how to talk about it.\n\"So, where are we going?\" Derek asks, like he can see it and he's willing to set it aside for now. \"You're the one with the maps. You're the one that decides what we do.\" He's looking straight at Stiles now, he trusts him to do this. Something in Stiles's chest clenches tightly. He grins and reaches out for Derek's hand, tugs him over until he can sit in a clear space on the bed.\n\"I think I know where Frain's going to be six days from now.\"\n \n*****\n \nThe third day of his new life Stiles doesn't wake up being aggressively spooned by a werewolf. He wakes up curled into the side of one. He has an arm thrown over Derek's waist, and their legs are tangled together. They're both in danger of slipping off the bed. Not remembering anything about his life is making everything feel like the first time he's ever done things, his whole life is just a continuous stream of new experiences right now, which is mostly frightening and confusing. But this - not so much.\nThe last thing Stiles remembers was yawning his way through reading the curse book, a dusty collection of ugly trinkets that did gruesome things to people, trying to find some way to track the witch with the stone. He'd clearly managed it before somehow, past-him had found a way to do it. He was honestly starting to get a little - a lot - annoyed at past-him, for making everything seem so easy. The TV's still on, though it's muted now, playing what looks like a cookery show. A smiling chef in kitchen whites is crushing garlic, with an unbearable amount of enthusiasm. Derek makes a low, grumbling noise, when he moves, like he knows Stiles is awake and doesn't want him to be.\nDerek has an arm thrown over his eyes, chest rising and falling in a way that's hypnotic. The sheets have slipped down just far enough to meet the elastic of Derek's underwear, and suddenly Stiles is faced with the reality of being in bed with an amazingly hot, twenty four year old werewolf. In a way that had never really come out last time, when he'd flailed his way out of the bed like a nervous virgin, with his face too hot and his underwear too tight. But then he hadn't been face to face with it then.\nThe fact that this time he's pressed close enough to breathe against Derek's skin, arm feeling the heat of him all along its length, it's intimate, and a little scary. But in a way that makes his heart race, and his fingers want to curl and pull Derek closer. Close enough that he can press his face into his skin - like he probably would if they were actually together - if Stiles remembered them being together. He wonders what Derek would do if he slipped his hand down, pushed it under the elastic of Derek's briefs and touched him. He wonders whether he'd push Stiles away, or whether he'd let him curl a hand round him, work him slowly until he came, all over his own stomach and Stiles's fingers. Even the thought of it makes him hold his breath, and swallow, and resist the urge to push into Derek's hip. He wishes he felt brave enough to do that. That he remembered something about them. Because Derek kisses him like it's easy even without his memories, and Stiles wants that too. He wants to feel that.\n\"What are you thinking about?\" It's a low, tumbling, grate of sound from Derek. All of Stiles's tentative thoughts are knocked apart, by a wave of embarrassment and uncertainty. He doesn't remember how to do this, which is exactly the same as never having done it at all right now. It leaves him feeling young, and useless, and clumsy, and he just can't.\n\"Nothing, I wasn't thinking about anything.\" Stiles struggles his way out of the sheet, before Derek can wake up properly, and ask any more questions, see any answers whether Stiles wants him to or not. In his heartbeat or his face, or the way he smells so strongly of arousal he might as well have rolled all over him - and Jesus, it's like he can't stop punishing himself.\nStiles stumbles his way to the bathroom, pushing the door shut behind him and then leaning against it, chilly air prickling against his skin. He's so hard it's just a continuous throb of tension, and he knows there's no way he's going to be able to just leave it. He turns the shower on, as hard and as loud as it will go. He lets it pour over him, hopes it'll drown out the bitten-off noises, and the soft sound of his hand working on himself. Until he's leaning against the chill of the tiles, panting, feeling loose and light-headed, and watching the water wash the evidence away.\nHe stumbles out, wraps a towel around his waist and attempts to wash his teeth, until they don't feel as awful. Then he stares at his reflection, until his cheeks don't look so incriminatingly flushed.\nHe should really have locked the door, because he gets no warning at all before it's clicking open and then shut, and then he's blinking at Derek, who's leaning back against it. He's wearing his jeans, zipped but unbuttoned, and he's bare-chested, hair flat on one side in a way that should look silly, but manages to just look artfully rumpled instead.\n\"This seems fair.\" Derek's voice is quiet, but pointed, and Stiles thinks that's supposed to mean something.\n\"What?\" he says stupidly, trying to make his voice work, trying not to look as if he did anything in the shower other than wash. Which he thinks is a losing battle against Derek's werewolf senses.\n\"I seem to remember you watching me yesterday.\" Derek gestures at the towel Stiles is wearing. \"Though that's kind of cheating.\"\nHe knows what Derek wants straight away, and his first instinct is to refuse, to laugh his way through embarrassment, through the jittery realisation that Derek wants to see him naked. But he doesn't - he doesn't. Feeling oddly self-conscious - no, feeling amazingly self-conscious - Stiles leans back against the sink. He can do this, Derek's probably seen him naked enough times that it won't even matter. It's probably not even a big deal, he's just making it one. Derek's eyes darken when he lifts a hand to the tucked-in edge of the towel. Then Stiles swallows down the frantic jump of his heartbeat, and tugs it open with shaky hands, lets it drop.\nDerek inhales sharply, nails grating on the door behind him, like maybe he hadn't expected Stiles to actually do it. Stiles is pretty sure he's never felt this exposed before in his life. Cold air rushing over his naked body like a reminder. Derek isn't doing anything, he's just staring, which was kind of the point, Stiles guesses. But it still feels jarringly intimate, unfamiliar, exciting and terrifying at the same time. Stiles's hands slowly drift inwards, think about making some sort of embarrassed attempt to cover himself. Derek takes two steps forward and catches his wrists, eases his hands away from his body, pins them loosely against the sink and just looks at him. Stiles is pretty sure his face is some shade of red as yet undiscovered by science, because he's hard, he's so obviously hard, chest heaving. There's no way to pretend that it's not Derek, and even if they are together - it all still feels so new.\nDerek's looking at him like he doesn't want to ever stop, and Stiles is hot and shivery, and a little bit scared. But the way Derek looks genuinely rattled, as if Stiles standing here naked is too much for him, might be the only thing keeping him upright.\n\"I wake up to you smelling like sex,\" Derek says roughly. \"Smelling like an invitation, and then you come in here and jerk off.\" The words are so low they grate and Stiles swallows. \"You have no idea how much I wanted to touch you this morning, how much I want to touch you now. I want to put my mouth all over you.\" Derek takes another step, shoe pushing between Stiles's bare feet, hands tightening on his wrists. There's a low burn of noise in his throat that sounds like intent.\nThat makes Stiles's entire body jerk, skin suddenly tingling all over, heartbeat slamming in his chest, and it doesn't matter that he came ten minutes ago, he's in serious danger of humiliating himself right now. Without anyone even touching him. Derek's voice grates over his skin like a physical thing.\n\"Oh my God, you can't just say things like that,\" Stiles says shakily.\n\"Why not, why can't I say it if I mean it?\" Derek's close enough that his chest is spotted with drops of water.\nStiles's whole body feels tight, and confused and greedy, shifting against the sink, in a way that makes Derek's fingers tighten and then relax. He's leaning closer, all red eyes and stubble, and he smells like cheap motel shampoo, and sweat, and something that's probably familiar, because Stiles can feel this jump of nervous tension in his skin, and he wonders if that is his sense memory. The way he reacts to Derek's hands, his voice, to the way Derek smells. But his body is still a stranger, and he doesn't remember, God, he doesn't remember any of it.\n\"Because I don't remember you,\" he stutters out. \"And I know - ok, I know you're huge, and insanely hot but it's still weird for me.\" He has to swallow then, mouth too dry to finish until he does. \"Because I can't smell that we're close, or just know that we're cool because I don't want to eat you, or anything like that. You're just very hot and naked and confusing, and a werewolf for God's sake, and yet sort of...mine. But it still scares me, and I don't even know what to do with all of that.\"\nStiles can't quite believe that he's talking a hot guy, who's almost certainly his own boyfriend, out of having sex with him, out of touching him, when he clearly wants him to. Is this the sort of thing he does? It's a wonder he found anyone that was willing to have sex with him at all.\n\"I'm sorry,\" Stiles says helplessly. \"God, I'm sorry, I'm being stupid.\" He's embarrassed suddenly, so much so he can barely breathe.\n\"You're not being stupid,\" Derek says quietly, the aggressive, predatory look is completely gone from his face. He eases back, fingers sliding free of Stiles's wrists.\nStiles feels awful all at once, as if he's ruined something he didn't even know he had.\n\"I don't know what I'm doing, and I want - fuck, I'm sorry.\"\nDerek sways forward again, just long enough to press his forehead against Stiles's, one gentle push, which makes Stiles's stomach stop clenching and jumping. Makes him sigh out a breath.\nThen he's alone in the bathroom.\n\"You are so fucking stupid,\" he tells his reflection. Which looks damp and rumpled, and confused, really confused.\n-\nWhen he gets back to the room he's determined not to be embarrassed, even though he's clearly failing at dealing with his own relationship. The amnesiac werewolf is dealing with this better than he is, what does that even say about him? Stiles is so busy trying to act casual that he doesn't notice at first that Derek has stolen his old shirt, and replaced it with one of his own, out of the bag from the trunk of the car.\n\"Are you trying to tell me something?\" Stiles holds the shirt up, the collar's frayed, and there's a tear at the hem, but it smells clean...clean-ish. \"Or is this some weird scent-marking thing? I'm not your territory you know.\" Stiles isn't even sure Derek wants him to be any more.\n\"Funny, because you smell like you are,\" Derek decides, from where he's stretched out on the bed, reading the curse book. He's smiling, and it looks weird and unfamiliar, like everything else about him. Stiles throws the towel at him.\nHe puts the stupid shirt on.\n\"So, two hundred and sixty miles West. We follow the map, scout out the town, see if we can find some witches. I'm assuming you know what witches smell like?\"\n\"Yeah,\" Derek says roughly. \"Do you really want to chase this guy. We don't even know who we are.\"\n\"He's killing children,\" Stiles bites out. \"Maybe that makes me an idiot, but I want to go after him. I want to make him stop.\"\nDerek nods, like he's just confirmed something he already knew. \"But this time, we're not using you as bait,\" he says firmly, like he's angry at his past self for letting it happen. Stiles tries not to feel anything about that.\n\"No kidding, but he might remember us, even if we don't remember him. Because, you do realise I have no idea what he looks like. I'd need a computer and maybe even then I wouldn't know.\" Not having a computer right now was kind of a pain.\n\"I'll get one,\" Derek says simply.\n\"You want to just stop and buy a laptop?\" Stiles asks, because sometimes he's not sure what to do with the fact that Derek accepts everything so easily.\n\"We might need one. I'm assuming you know how to work it?\"\nStiles flexes his fingers.\n\"I'm pretty sure I could do that, yeah.\"\nDerek pulls on a new shirt, grabs his jacket off the bed.\n\"Pack everything up, we don't want to stay in one place too long. I'll bring back lunch and then we'll leave.\"\n\"Hey, buy toothbrushes and toothpaste too,\" Stiles says. \"New phones too, if we're going to be out of contact with each other. Maybe some food if we're going to be on the road, flashlights.\" Stiles bites his lip, looks up, at where Derek's still waiting, hand on the doorknob. \"I can't think of anything else.\"\nDerek eyeballs him, waits an extra handful of seconds to make sure, then disappears out the door.\nStiles tosses the bag on the bed, packs all their clothes into it, and the papers, maps and book, and a couple of towels, just in case. Because it turns out maybe he is a little bit of a criminal after all. Or possibly he used to be an awesomely well-behaved kid, and Derek has been a horrible influence on him. It's suddenly irritating that he has no idea. Who was he? What was he like? He's too young to be able to tell by frown lines, or laugh lines, whether he's happy, or sad, or stressed out. Whether he chose this life, or it chose him. But he's young - and he's checked his body in the bathroom mirror, no scars, no obvious scars. He can't have been in this life for long. What happened to him?\nHe watches TV, biting the skin at the edge of his nail, and waiting for Derek to come back. He feels a little adrift without him, and he briefly worries that they have an awful, co-dependant relationship. But then he remembers that he and Derek probably have friends, parents maybe? He just doesn't remember them.\nDerek brings burgers, and a shiny silver laptop (and everything else Stiles asked for). They eat on the bed, leaning against each other, in their jackets, with the motel door open, and the late sun streaming in. Stiles makes up stories about their childhood, how they met, some of them best guess, some of them hopeful, some of them ridiculous, and all of them are probably wrong. But some of them make Derek huff laughter, and shove fries in Stiles's mouth, which makes it totally worth it.\nSo, they're doing this, without their memory, running off into possible, terrible danger to save people they don't even know from witches, who may or may not know how to give them their memories back.\nStiles wonders if he's always been this crazy?\"\n \n*****\n \nArnville isn't exactly a hive of activity. It's small and it doesn't have a motel, so they stay at one in the next town, picking up what they can from news stories and police reports they manage to catch hold of. Stiles gives in to the urge to Google himself almost straight away, and it turns out there are more Stilinskis than you'd think. Not millions, but enough for him to scroll through three pages, wondering if he's related to any of them. The doctor, or the college student, or the sheriff. Though Stiles still isn't sure if Stilinski is even his real name, or whether they just snagged one from the Beacon Hills phonebook. He's half way through typing in Derek's name when Derek distracts him by throwing a bag at him. Which turns out to contain a jumble of clothing, tags still attached.\n\"Should I be worried that you're apparently dressing me?\" he asks, while unfolding a pair of jeans. \"And that you know my size?\"\n\"I've seen you naked,\" Derek reminds him, and manages to peg him in the face with the next bag. Judging by how gently it was thrown that was totally on purpose. \"And I just got you stuff that's the same as what you're wearing.\"\n\"Because my style is classic and timeless?\"\nDerek's face seems to disagree, but is keeping the rest of its opinion to itself, possibly to avoid sleeping on the couch - if they had a couch, or anything was actually happening in the bed. And Stiles is just going to leave that whole thing alone now.\nIt's hard to wait, to wait for something to happen, something that might be bad. He feels useless, spends too much time researching things he doesn't know enough about, and watching reruns of old TV shows, while sprawled next to Derek on the bed.\nUntil it's time to go looking for Frain.\n-\nDerek parks on a side road, just out of town, where they can't be seen by anyone who lives there, or anyone passing by.\n\"This isn't exactly a safe place for your car,\" Stiles points out, giving her an affectionate pat. \"Have you seen your car, she's beautiful and she doesn't deserve this. I feel it's my duty to defend her from your terrible mistreatment.\"\nDerek shrugs like he doesn't even care. Stiles gets the feeling his other self is probably more attached to it than this one. That Derek's other self would probably be horrified at the impending abandonment of this beautiful machine. Though getting that across to Derek is going to be a losing battle, because he already looks impatient.\n\"We can't just stroll into town, we don't know if any of them will recognise us, we don't know enough about what they know.\" Stiles shakes his head. \"I tried looking for Frain online, but there are too many. There's an auction house attached to his name, probably not him, but because of that the name just goes everywhere. Seriously, you type it in and you don't get any faces, just ten pages of freakin' antiques.\"\n\"But he was supposed to show up here?\" Derek's asking like Stiles hasn't already checked and double-checked.\n\"This was the next stop according to the map that past-me made. Do we trust past-me? I mean I know I'm heavily biased and everything, but I'm going to go with, yeah.\" Stiles scratches the back of his neck, because that's about as far as he's gotten, to be honest. \"So, how exactly do two strange men who've just come into town subtly inquire if any children have gone missing?\"\nDerek does the jaw tightening thing. \"They don't.\"\nStiles nods his head because they really don't.\n\"Not unless they want to become people of interest. We don't want to become people of interest. That's the one thing we definitely do not want to be.\" He sighs, because he's just had a horrible idea. \"Shit, ok, if we find me some sort of sports kit I could probably pass for younger than seventeen, fifteen maybe. People will talk to a stupid kid.\"\n\"Do not try and pass for fifteen,\" Derek says stiffly, and judging by the look on his face this is non-negotiable.\n\"It's either that or cruise around looking conspicuous, until you smell a witch,\" Stiles says. \"Which - yeah, that's going to get us noticed. We're going for the 'doesn't get us noticed,' plans, where at all possible, remember.\" He throws up his hands. \"Maybe we could try the whole road trip thing, and rely on small-town gossip. But if anyone asks you're my older brother. You'll have to be a Stilinski though, if anyone asks. Because Stiles Hale sounds really freakin' stupid. And take the leather jacket off, wearing that you're like an ad for the guy everyone's mother warned them about.\"\nDerek shoots him a look, more amused than offended. He shrugs his jacket off, dumps it through the passenger window. Stiles isn't exactly sure whether that's better or not, because now he's all muscles and stupid hotness in a more accessible sort of way. He's going to get groped by every waitress within a hundred miles. Stiles is in some weird space where he's not sure whether to feel smug, or jealous.\nNot that it can be helped, because they're clearly doing this.\n\"Come on, buy your little bro a soda.\" Stiles thumps Derek on the arm.\n\"I will bite you, I swear to God.\"\n-\nSmall towns.\nStiles is only half way through his soda, which Derek bought for him, on the express understanding that he not pretend to be a day younger than he actually was, when the waitress of the diner - who doesn't try and grope Derek, but does bring him a suspiciously large piece of pie - starts talking about an old house, three miles past the old farm road, that's suddenly got people in it. Nosing around looking to buy, the burly man behind the counter suggests. People from the city, unpleasant, rude, arrogant.\nStiles tongues his straw, and gives Derek a significant look.\n\"I thought that would be harder,\" Derek grumbles, as if he's actually giving this one to Stiles, grudgingly and with ill grace. But he's totally giving it to him.\n\"You're really not a people person are you?\" Stiles ignores the frowning, and finishes his soda. Because he's actually thirsty, and chewing the straw is an oddly familiar sort of stress relief - hey, sense memory!\n-\nIt's a slow, short drive, Derek wary and tense the whole way. He stops the car at the end of the grown-over driveway. The house looks tatty and disheveled from the outside, and it's empty. It has that special, creepy, empty house look about it.\n\"Stay here,\" Derek says firmly.\nStiles watches him get out of the car, with a slow-burning prickle of angry disbelief.\n\"Do I really strike you as the sort of person who listens to the phrase 'stay in the car?'\" He's more incredulous than annoyed. Because they've only known each other just over a week, but Stiles is pretty sure that if nothing else has come through, that one should have been fairly obvious.\nDerek stares at him for a second, watches the climb of his eyebrows, and his little head bob of acknowledgment, that, yes, the minute Derek turns his back Stiles will be out of this car, and following him inside. Derek growls quietly, and then grasps Stiles by a handful of his shirt and hauls him out of the car.\n\"Stay close,\" he amends. This time it's rough enough that Stiles knows this is something Derek needs him to obey - or to at least give the impression he's obeying anyway.\nThe house doesn't look like much from the outside. It's neglected and dusty, paint peeling, and there are cracks in the floorboards and walls, just wide enough that sunlight can make its way through the gauntlet of dust and spiders. This is definitely the crappiest house Stiles has ever seen. But it's still weirdly imposing. There's something about its size, the way that it sits. On a less sunny day Stiles would joke about it being haunted.\n\"Why can't witches have nice apartments in the city?\" Stiles says carefully, while avoiding suspicious piles of what looks like dirt - of what he hopes is dirt. \"Didn't anyone tell them this is the twenty-first century? This place is in serious need of some Fantasia mops.\"\nThe front door is unlocked and it creaks ominously when Derek pushes it. Stiles is smart enough to leave it open when they go inside, and he has to wave away a couple of cobwebs. Though there's definitely a clean spot through the middle of the room. The smeared tromp of shoes through the gauntlet of tools and broken wooden struts. Someone has been here recently. One of the floorboards sinks unexpectedly beneath Stiles's foot, and he flails, briefly, before Derek catches his arm and tells him to be careful in a low, hissing voice. It jerks up when he steps off of it, looking completely harmless again.\n\"Can you say deathtrap.\" Stiles is judging this house, and he's judging anyone that meets here. \"Can you smell anything?\"\n\"Yeah, but nothing recent, there's no one here now.\"\nDerek wanders towards the back, and Stiles follows, at a distance. It's easy to see where the dust has been disturbed, where people have stopped, shuffled around. Against the far wall there's what looks like a rolled carpet, two bags, a stack of books. Surely witches wouldn't leave their stuff unguarded? Even as he thinks it he sees the half-circle in the dust, drawn thinly in yellow chalk. It looks completely harmless - but Stiles is still opening his mouth to say 'don't cross it.' A second too late though, because Derek's boot is already stepping over it.\nA lot of things happen at once, loud, painful things. But the only thing Stiles really registers is being thrown across the room. He hits the floor, painfully hard, a broken half-tumble that jars his elbow and neck. There's no air in him at all, and everything is fuzzy and washed in shades of crackling blue.\nThen everything is completely black.\n-\nThere's a dragging noise, which registers only vaguely in the back of Stiles's head. He knows his eyes are closed, because he can't see anything, but he can't figure out how to make them open. The sensation of being sprawled on the floor keeps coming and going, like pins and needles in his brain. He can't even twitch his fingers, he's just numb. He's afraid he's going to wake up and forget everything all over again. That he'll forget about Andrew Frain, and the murders, and Derek. He doesn't want to forget Derek.\n-\nSomeone is moving him, and talking, but the voices are sluggish like they're underwater, or speaking another language, all garbled together.\n-\n\"Christie, stop screwing around.\" The words echo, as if they're coming from far away. The world tips, briefly, and then resettles.\n\n\"I was just looking.\"\n\nStiles can see floorboards, they're so much dirtier up close. They keep blurring in and out. There are three, no, four voices talking in the other room, and the slow tread of boots somewhere behind him. He shuts his eyes again.\n\n\"The boy should be awake by now.\"\n\nStiles thinks he should be pissed about being called a 'boy,' especially considering what's been happening to the kids that went messing.\n\"Aidan's watching him.\"\nThat's a female voice, Christie? They're getting further away, more muffled.\n\n\"How old is he do you think? We could keep him. He might be useful later -\"\n\n\"I know you're awake.\" The boots walking around Stiles's body belong to a man, with a raspy, deep voice. Aidan, he assumes. \"You can either stop pretending, or I can kick you in the stomach.\"\nStiles opens his eyes, and glares up at him.\nAidan's a heavy man, as big as Derek, but he's not wearing it as well.\n\"There we go. We have some questions for you, and I think you're going to have some answers.\"\nThere's a snarl from the other room, and the smash of something hitting a wall. Which takes Aidan's attention away from Stiles just long enough for him to snag the piece of wood he'd been eyeing to his right, and swing it at his head. The man put his arm up, and it breaks across it. It barely even pushes him back, and then he's grasping the front of Stiles's shirt, hauling him upright, and slamming him into the wall. The impact knocks all the air out of him, and rattles his teeth, dust and bits of wood shower over his head and shoulders.\nSomeone's screaming in the room behind them. But Stiles is too busy trying to struggle his way out of Aidan's hold to worry about that right now.\n\n\"You didn't tell me he was a fucking Alpha, the circle isn't going to hold, get Marcus, get Marcus now.\"\n\nThe shouting in the other room cuts off, with a noise that says whoever that was, he won't be talking again.\nThrowing a punch seems like it should be an instinctive thing. But Stiles's instincts must be shittier than most, because he only gets a glancing blow across Aidan's jaw, and manages to kill all the feeling in his hand. Then he gets shoved into the wall for his trouble. He's still dizzy from whatever knocked him out, sound cutting in and out, and someone's still screaming. Stiles thinks it's probably Christie.\nHe pulls against the grip on him, manages to haul him forward one step. Aidan swears, stumbles when he hits the broken floorboard, and his grip on Stiles goes loose. Stiles yanks himself backwards, towards the doorway, a flail of movement, but he doesn't manage to pull himself free. Punching didn't do him much good, time to go for the low blow. He knees the guy in the balls, as hard as he can. He's immediately dropped on his ass, when the hands on him spasm and let go, and Stiles moves instinctively towards the sound of snarling, towards the sound of Derek, only to get jerked back by the collar of his shirt, and half-choked in the process. Seriously, what sort of man can get kneed in the balls and then get back up a second later. Is this guy even human? There are witches and werewolves, what else is out there?\n\"I'm going to smash all your teeth in, you little bastard.\" The hand in his shirt tightens, knuckles almost pressed against his throat. This has happened to him before, Stiles thinks, with an horrible sort of realisation. Because he remembers how much getting punched in the face is going to hurt. It's the first thing he's remembered. Which suggests his brain is kind of a dick.\nAidan settles for one punch, hard enough to make the side of his face vibrate with pain, cheek and jaw roaring with blood, and then the guy pins him to the floor, and brings his own face in close.\n\"Where's Frain,\" he shouts, hand tightening again in Stiles's shirt, until his knuckles are crushed up tight to his windpipe. \"Tell me where he is.\"\nThere's a heavy, wet growling from across the room, and Stiles decides that's a pretty sweet distraction. He scrabbles out to the side, for the wrench he'd seen on his way down to the floor. He catches it by the head, rather than the handle but he swings it hard enough that it probably isn't going to matter. Metal cracks against unprotected skull, and the witch staggers on his knees. Nothing happens for a second, and then blood just rushes down the side of his face. The blue-green glow of his eyes goes bright, and then gutters and dies. He slams into the floor like there's nothing left to brace himself with, and Stiles doesn't know whether he killed him or just knocked him unconscious, but at the moment it doesn't matter. At the moment he doesn't care.\n\"Derek.\" He's scrabbling backwards, twisting onto his knees. The noise in response to that goes all the way through him.\nStiles is scrambling upright, when he catches sight of the witch stood by the doorway. He has Derek pressed against the wall, impossibly still, lips curled back from his teeth. Derek's still making that raw, wet noise, somewhere between a groan and a snarl, and it's not until Stiles stumbles a step to the side that he realises it's because the witch has him pinned. Worse then that, he has his glowing hand pushed inside Derek's chest.\nStiles is going to take a wild guess that this is Marcus.\n\"Let him go.\" Stiles can feel his heart hammering against the inside of his ribcage.\n\"No, I think I'll keep a choke chain on the dog, thank you very much,\" Marcus says flatly. \"Drop the wrench, please.\" He gestures, elegantly, with the other hand, to where Stiles is still holding the dripping length of metal.\nStiles drops it, hears it clunk sharply against the floorboards.\n\"I remember you,\" Marcus says. \"You were the ones hunting Frain.\" His eyes narrow as he considers them both. \"Did you kill him?\"\nStiles doesn't know what the right answer to that question is, the answer that will help them. But he can't afford the pause to think about it, so he goes for honesty.\n\"No, we're still looking for him,\" Stiles says.\"Which I'm pretty sure you're doing too. You're all after the same piece of tacky jewelery.\"\nThe man's trying very hard not to react, but Stiles sees his mouth tighten briefly.\n\"Where's the stone?\" he says simply, and Stiles knows they're not pretending to be civil any more.\n\"We don't know. We were after Frain - we were tracking him for the murders.\"\n\"But you know about the stone?\" Marcus confirms, as if just knowing about it isn't going to end well for them. Stiles isn't surprise, cursed artifacts probably don't bring out the best in people.\nHe nods slowly.\n\"How? How do you know about it?\"\nStiles thinks about it for a minute, thinks about it hard.\n\"I have a book, about cursed artifacts -\" He lifts a hand. \"I'm going to go into my pocket.\"\n\"Oh be my guest,\" Marcus says, as if they have all the time in the world.\nStiles reaches in, and carefully pulls the book free, then flips it open to the page he left the folded print-out inside.\n\"The Stone of Echoes.\" He opens the book, turns it so the other man can see.\n\"Come closer,\" Marcus stiffly.\n\"I could throw it,\" Stiles offers, and his voice sounds just a tiny bit hopeful.\n\"I don't think so.\" Marcus is smiling now, small and amused, and Stiles gets the feeling that he knows he's always the smartest man in a room. He takes a step towards Stiles, to read the curling writing on the page. His foot hits the loose board and drops, further than he's expecting, he stumbles, and his hand slips out of Derek's chest.\nWhich Derek had obviously been waiting for.\nHe catches Marcus by the hair, and jerks his head back. Derek's whole mouth comes down on the front of Marcus's throat, and there's nothing but blood. They go down together, but Derek's the only one moving after they hit the floorboards, pushing himself up on his hands, gasping through red teeth.\nStiles scrambles over to him, where he's hunched over on the floor, heaving in every breath, mouth and throat bright red. Derek catches his sleeve the moment he's close enough, hauls him in. Rough and too hard and Stiles doesn't even care.\n\"Stiles, God damn it, Stiles.\"\n\"Derek.\" Stiles presses a hand to Derek's chest. The rips in his shirt are ragged, but there's no wound. Stiles doesn't think there ever was. It's like the bastard just phased his hand through Derek's chest. He's trying to heal something which was never physical damage. \"Derek, hey, you're ok, whatever he was doing he's not doing it any more. We're ok, we're good.\"\n\"That was not fucking pleasant.\" Derek's voice sounds gritty and awful.\nStiles buries his face in Derek's throat, doesn't care that he's smearing the dead witch's blood into his hair, and across the side of his face. Derek wraps a hand round the back of his neck, hard enough to hurt, and holds him there.\n*****\nStiles stares at himself in the motel's bathroom mirror. His face is red on one side, most of it centered on his cheekbone, but there's a curve of colour waiting to appear around his eye. He thinks it'll be bruised tomorrow, that there will be significant bruising tomorrow. He's shaking a little, but he thinks that's the adrenaline, the realisation that they could have died today, or at least ended up hurt worse than this. He has to wonder how many times he's felt that. How many times they've gone back to - wherever they usually go to when the dust settles, with the knowledge that they could have both died.\nOr maybe they're both so badass that they just don't do that any more. Maybe they don't even think about things like that any more - and he doesn't know whether that thought reassures him, or just makes him horribly sad. Either way, they're almost certainly better at it than he feels right now. Better at dealing with it, accepting the consequences of it, maybe? Though something about his face, with its soft edges and ridiculous nose, something about the way it looks haunted. It says he still feels like this sometimes. It can't be as easy as he thinks it is. Maybe his other self - maybe he struggles with it too.\nHe throws his shirt over the rickety chair in the corner, wets the towel and presses it against his eye. It doesn't really hurt yet, it just feels hot and tight, sensitive to the touch.\nWhen he looks in the mirror again, Derek's standing behind him.\n\"Yeah, the lurking in the background waiting to jump out at people never gets old, or is in any way disturbing. You're a complete creeper, you know that?\"\nDerek comes close enough to curl his hands around Stiles's bare arms, more gently than he's expecting. They fold there and hold him without squeezing. As if Derek just wants to touch him. Stiles lets the towel fall into the sink, twists until his ass hits the porcelain. Until he's leaning away from the width of Derek's chest, warmth curling off him, eyebrows pulled together, and Stiles can see his eyes working their way over the side of his face.\n\"I'm fine,\" Stiles says quietly. Because it's almost the truth. He's fine - he will be fine.\nDerek's palms move over him, with the sort of familiarity which he should probably want to examine closer. Stiles knows that he's checking him over, making sure that he's not hurt anywhere else. He knows Derek wants to see for himself that the scrape on his cheek, and the bruises up his arm are the only marks on him.\n\"I'm fine,\" Stiles says again, not forcefully, because he's in no hurry to push Derek's hands away from his skin. The warmth of them, there's something reassuring about that, about the way they hold him still, ground him in the too-bright, shitty, motel bathroom. \"I'm fine,\" he says, and tries to make that the last time, hopes he sounds it, if only to reassure Derek. He's still a little shaky, but he's not longer shaking. Because it's really hard to feel like the world is collapsing in on itself when Derek has his hands on him. Stiles doesn't know what that says about him, what that says about them.\nHis own hands are in Derek's shirt, not moving, just curled in the fabric. Some stupid attempt to make sure he stays. As if Derek wasn't going to do that anyway - and he doesn't know how he knows that, he just does.\n\"Derek,\" he says, because he can. They're both alive, and this thing viewed from the outside has to be insane. What they're doing is insane, and terrifying. But Stiles thinks that they saved people today, and he doesn't even know what to do with that. He doesn't know how to feel about that. One of Derek's hands has made its way up to his throat, curled there, thumb brushing where his pulse is jumping under the skin. Stiles had almost forgotten the fist that had pushed into his windpipe. He wonders if there's a mark there.\nThe low, unhappy noise that Derek makes tells Stiles that he doesn't know what he's doing either - and then Derek's leaning in and kissing him, where he's backed up against the sink, waist held almost too tightly in Derek's hand. He's kissing Stiles like he never wants to stop, all open mouth, and heat, and wet slide of tongue. Stiles has a hand fisted in Derek's shirt, the other curled behind him on the sink. Something clatters there, and Stiles pushes harder into the kiss, feels the scrape of stubble against his skin, the way Derek tenses like he wants to hike him up against the sink. But he's restraining himself. Stiles tips his head back, swears when his mouth falls free.\n\"Tell me if you want me to stop,\" Derek says, biting the words into his jaw. \"Tell me if you don't want this.\"\nStiles doesn't have to ask what he means, because it's them, it's everything. It's whether to be what they used to be, and it's getting harder and harder to ignore the fact that they both want that. Stiles hauls Derek closer, by his shirt, kisses him again. Because he can safely say that this is the only thing he wants in the whole damn world right now. He tightens his fingers, struggles to talk through the roar of blood, and the sharp, sudden greed of his own body.\n\"This is good,\" he manages, but that's not enough. \"I want this, this is me telling you that I definitely want this. You have no idea, God, Derek.\" His fingers tighten in Derek's shirt, strangle the fabric and he watches it pull down, expose the smooth curve of Derek's throat, the hard ridge of his collarbone. It makes him sigh out a breath.\n\"I want you to smell like you're mine.\" Derek makes it sound so rough and honest.\nJesus, how can he just say things like that, like they're normal? Because it makes Stiles's insides twist into some sort of aroused knot. He doesn't even really know what he means, but it's ok, it's all ok.\n\"Oh my - yeah, ok,\" Stiles is trying to haul him closer, even though that's a physical impossibility right now. \"Lets go with that.\"\nThey stumble through the door into the bedroom, and Derek just shoves the bag off the bed, letting the contents cascade out of it, into a spray on the carpet. Then he sits on the bed, hauling Stiles in, between his spread thighs, and biting at the naked warmth of his stomach. Derek pulls his jeans open without looking, and Stiles is already hard under the edge of his hand, harder when Derek palms him, and tilts his head back so he can see his face.\nStiles is watching it all, pushing his fingers through Derek's hair, resisting the urge to grip it tight and tug it, tip Derek's head back further, lean down and kiss him - God, he wonders if he would have done that before. If he would have been brave enough to do all of that. Fuck it, he does it anyway, before he can talk himself out of it, before he can think too much about what he would and wouldn't do. He clutches Derek's hair tight and pulls, and then leans down and opens Derek's mouth with clumsy kisses. Derek's pushing him out of his jeans, big hands sliding into his boxers and taking them too. The quick thump of adrenaline is still making everything feel jittery and unreal. But Stiles lets Derek strip him, lets him lay his hands on his skin, grip tight and haul him down the bed, mouth hot and open on his chest, wet against his throat - and then pressed hard against his own mouth.\nDerek's still sliding his hands on Stiles like he doesn't think he's allowed.\n\"I want to fuck you,\" Derek says, thready and rough. \"Tell me I can do that, tell me you want that.\" It sounds more like a demand than a question, but Stiles doesn't even care.\n\"Yeah,\" he says quietly, heart slamming in his chest, thighs tensing. He feels hot and strangely greedy at the thought of it. \"Ok.\" Because he does, he does want that. You can be nervous and still want something. You can want something without really knowing what it will feel like, what it will mean.\nThere's lotion in the bathroom, and Stiles thinks maybe this is how it goes for them, fight evil witches, stop in shitty motel rooms, and fuck using bathroom supplies. Like a pornographic version of Supernatural, only without the awesome soundtrack and the incestuous overtones.\nHe ends up with his legs spread, one hand thrown over his head and fisted in the sheets, while Derek breathes against the naked line of his cock, close enough to open his mouth there. Stiles is groaning before anything even happens, at just the thought of it, biting down on his lip, and pushing a knee into Derek's armpit in a way that says 'please, please, you bastard.' He's not sure how to ask, not sure if he can, throat locked up with anticipation, and nerves, and lust. Derek nudges his thighs open around his shoulders, slides there like he was made to fit, until one of Stiles's legs is looped over the muscled length of his forearm, spread in a way he'd feel embarrassed about, if Derek wasn't currently running the flat of his tongue along the entire length of his dick. Nothing in his head - no last, lingering self consciousness, or embarrassment can survive that. All the air catches in Stiles's throat, and he clenches, tightens all over, and just begs.\n\"Oh my God, don't stop, please don't stop -\"\nThe words cut off completely when Derek opens his mouth and takes him in. It's all burning heat, and stubble, and shivery wet suction, and Stiles cannot stay still for that. Jesus Christ, it's like he's never done this before, and he just wants to fist his hands in Derek's hair - he lets one slide down, touches tentatively at Derek's shoulder, neck, and the dark spikes of his hair. Only to let it slide away again. Until Derek catches his wrist and pulls it back - and, oh, that's good, he can do that, that's totally permission to do that. Derek lets him tug, lets his hips jerk, and twist, and rock up into him, and it's all a shuddering, beautiful mess of Derek, and Derek's huge impossible shoulders, and his mouth, open and wet and all the way around him. All of which Stiles is stuttering out loud, too embarrassed to think about what he's saying, but too stunned to keep it all in, voice a garble of words, cut through occasionally with Derek's name. It's too much, and Stiles doesn't know how to stop it.\n\"I'm going to come,\" he says, soft and a little apologetic. But he wants it so much, wants it desperately. He doesn't care if it's too soon. He just needs it right now. \"Derek.\"\nDerek pins him still and sinks down, all the way, and Stiles's orgasm leaves him stuttering half words, and clenching his hand so tight in Derek's hair.\n\"Oh my God, oh my God, Derek.\"\nDerek lets him slip free, into the chill air of the room, and he makes a shaky noise of loss. But he can't form words any more, because Derek has completely ruined him. Derek has ruined him forever. He's spread out, and still shivering a little, and Derek is biting the muscle of his thigh with blunt teeth, breath flaring hotly against the skin. Stiles can hear the snap of plastic, and it doesn't make sense until Derek's easing his thigh to one side, pushing a slippery finger into him. It's strange and foreign, and Stiles isn't sure what to do with it at first. But Derek's making soft noises in his throat, pressing in, and easing him open with a thumb so he can see, and Stiles should probably be embarrassed, but the way Derek just grunts out a breath is so fucking hot. He spreads his legs a little more, and Derek adds another finger, watching his face, watching for his reactions. But it doesn't hurt exactly, it's just different, weirdly intimate. It's more what's going to happen, what Derek wants, what he's going to do. Stiles stretches a hand down and digs his nails into Derek's shoulder.\n\"You good?\" Derek asks roughly.\n\"So good,\" Stiles manages brokenly, still a little wrecked. \"So very much of the good.\"\nDerek's three fingers deep now, it's a stretch that aches, body protesting a little, but Derek's other hand is clenching and relaxing on Stiles's thigh, and his eyes look savage. Stiles wants to know suddenly, if Derek used to look at him like that all the time. Because he can see how that would break someone open. That naked, almost aggressive desire. Stiles's cock twitches against his stomach. Heel sliding in the sheet. He draws in a breath when Derek effortlessly rearranges his body to make it easier, to make his fingers push deeper.\nStiles thinks he really wants to be fucked.\n\"I don't remember how to do this,\" he says, rushed and apologetic, but he needs to say it, needs to explain it. \"I thought it would be instinctive, but I don't remember. I don't know how good I'm going to be.\"\n\"You'll be amazing,\" Derek says, he kisses the bare curve of Stiles's hip, scrapes his teeth there and pulls him closer. \"You already are.\"\nGod, Stiles knows that everyone says stupid things when they have sex, but that is so - this is going to be ok. Derek stretches up to kiss him, to bite at his mouth, before he's leaning back and away, stomach tensing. Stiles is rolled in the sheets, and pulled up to his knees, and he can't help the quiet snort that escapes, because of course they're going to do it in this position. He's shaking again, which is stupid because he knows they must have done this, but he doesn't remember it. He doesn't remember anything, but this feels right. This feels like something that they can do.\nDerek's fingers are back inside him, stretching him out again in quick, hard pushes, before sliding free. The bottle hits the carpeted floor. Stiles is breathing too fast, teeth pulling at his lower lip, hot and nervous when Derek spreads him open, when he pulls him back by his hips, presses in and pushes. It hurts a little, everything is too big, and Stiles doesn't know where to put his knees, how to brace himself on his hands. Derek makes this low, punched-out noise when he sinks deeper, and Stiles hisses, tries to adjust to it. Because that is a large intrusion into his personal space. Derek growls, harsh in his throat, like he wants to just fuck deep into him, and Stiles really hopes he's not going to do that just yet, because everything feels too much already.\n\"Wait,\" Stiles says, because he needs just a second. \"Please, just wait a second.\"\nDerek goes still, hands tight on his skin, but he lets Stiles settle, lets him adjust, lets him press his forehead into the pillow and breathe - shift his body into the push to try and make it easier.\n\"Stiles,\" Derek says eventually, low and gritty, and Stiles can feel him trembling where he's curved over his back. He can feel the tension in him, gone tight in stillness. The flex of fingers on his waist, the tension of thighs against his own, and Stiles has no idea how much it costs him to be gentle, to go slow.\n\"God, yeah, ok, gently.\" There's so much to go in, and Stiles is breathing in gutted little groans, trying to adjust to it.\nIt's an awkward rhythm that never really gets completely comfortable. Stiles doesn't remember how to move into it, doesn't know how to take it any more. But Derek goes slowly, takes it easy, and every so often there's a spark of gut-tightening pleasure, and Stiles huffs out a gasp. He's half hard, body not sure if it's being punished, or rewarded, but interested just the same. Derek is heavy and burning hot, strong enough to put Stiles wherever he wants. But he's making noises, low, breathy whimpers and cracked groans, like Stiles isn't the only one who's dealing with too much. It's good in a way that's sharp and almost overwhelming. Until it becomes something that Stiles finds himself pushing back into, driving those broken noises out of Derek every time.\nStiles tries to touch himself, wants so badly to touch himself, but he can't hold himself up on one hand.\n\"Fuck, please, I can't, please.\" Frustration punched out in a rough fall of words. But Derek's hand moves from the bend of his waist to the heavy jut of his cock, all hot fingers and tight grip, and Stiles hisses gratitude and pushes into it.\nDerek folds over his body, fingers biting into his hip. Until he's curled tight over him, all the way inside him, when Stiles comes with a gasping noise that sounds like a sob. His whole body clenches, and Derek makes a low noise in his throat, bites, hard but brief, at his shoulder, before going still, letting him ride it out. Until Stiles is shivery and loose, listening to his heart pound and whimpering through the comedown. Derek starts moving again, his hands slide up Stiles's back, and grip around his shoulders. Stiles just relaxes into it, and lets Derek take what he needs, body bending until he's down on his forearms, ass raised. Derek says fuck, over and over, rhythm broken into something jagged and greedy. It's good, and it hurts a little, but Stiles is clawing at the sheets, and turning his face against the pillows, skin burning\n\"Derek.\"\nDerek shudders to a stop, stream of words bitten off when he comes, and Stiles can feel it, he's not expecting to but he does. Derek pants his way through it, claws blunt human nails against Stiles's skin, and then Derek just curls over Stiles's body like he doesn't want to stop, drags his teeth over the bowed curve of his neck, in a way that feels so intimate that he shudders.\n\"Oh my God,\" Stiles says thickly. He feels sweaty and achy and so, so good.\nDerek groans agreement and eases out gently. Stiles's limbs just give up completely, and he has his face in the pillow, finding a space to breathe, eyes shut, fingers curled weakly in the sheet. He's still shivery with the lassitude of post-orgasm awesomeness. But there's a sharp ache there too, and his insides feels bruised and disarranged.\nDerek's hot palm is spread low on his back, which feels a little possessive. But Stiles is sort of glad of that at the moment. Because he feels thin and light, and weirdly fragile, like this is a place where things could go wrong if he doesn't say the right thing, or do the right thing, or something. But Derek's the one who's curling closer, body pressing in warm, heavy lines along Stiles's side. He presses his nose into Stiles's ear, breathes there, quiet and steady. Which is unfair because Stiles's chest still feels tight, back sweaty and damp, pulse tripping in every breath.\n\"Stiles, can I -?\" Derek starts. But he doesn't seem to know how to finish the sentence.\n\"I'm gonna go with, yeah, you can do whatever you want,\" Stiles mumbles out, and he sounds a little drunk, but he just let the guy enthusiastically fuck him, so he's pretty sure they can work everything else out.\nBut Derek is already sliding down the bed, spreading his thighs wider and sinking down and, oh my God, running his tongue where Stiles is still warm and sore, and slick with Derek's come. He should maybe protest, but he's too busy biting back a groan, because that is so wrong, and yet - he's spreading his thighs, and making choked noises in his throat.\n\"This is a werewolf thing, isn't it?\" Stiles says hoarsely, and gets a hot stab of tongue for his snark.\nNot complaining, so not complaining.\n \n*****\n \nHe wakes up to find Derek dragging his teeth over the bend of his throat, all hot breath and sharpness - and oh fuck, if Stiles wasn't already hard that would have done it. It's not morning yet, the room's still mostly dark, heavy and warm, and it's strange to wake up tangled up with Derek after they - after they'd had sex. Stiles hadn't had a chance to think about what it all meant yet, to think about what this changed. Now they were...sleeping together, it's different. That's what they're doing, he assumes, sleeping together. Together? He doesn't know, he's forgotten how their relationship works. He's forgotten how to have a relationship. But he'd really, really like to have this one. If that's an option.\n\"So you don't regret the whole sex thing then?\" Stiles says carefully. Which sounds overly loud and destructive in the quiet of the room. Because that's more of his insecurity than he wanted to show.\nDerek growls, and mouths across his neck and the bend of his shoulder, teeth scraping in gentle pulls.\nStiles is going to take that as an emphatic no, and he's immediately shivery with relief - not just relief. Derek's dragging him in, pressing tight against his back. He's hard again, all wandering hands and hot mouth and obvious, obvious interest in continuing what they started yesterday. Stiles had expected that there'd be more talking, and awkwardness and - things that weren't this. Is it really this easy?\n\"Maybe you should - oh, God, I can't make sentences when you do that.\"\nDerek rolls and stretches over him, until he can crush all Stiles's words under his mouth.\n\"I like kissing you, you feel so fucking new.\" Derek's voice is all early morning roughness, and promise.\nStiles can't help the way his hands lift to Derek's waist, fingertips pushing into the skin.\n\"I'm seventeen, and I have an unbelievably hot, werewolf boyfriend, I think I only feel new because you don't remember me. Or maybe you don't kiss me, maybe you just roll me over and -\" Stiles can't finish that. Even after having Derek all the way inside him once already. That doesn't mean he isn't thinking about it though, or wanting it.\n\"Do you want me to?\" Derek asks, and Stiles is pretty sure that if he says yes Derek will do exactly that. All he has to do is say yes and Derek will tug him up to his knees and fuck him again - and he can't think about anything but that now. Stiles has a hot boyfriend he can have sex with whenever he wants. His brain is kind of an asshole for holding out on him, because he thinks remembering that would be - will be amazing. Though there is a small flaw in the otherwise awesome morning plan.\n\"Don't think I wouldn't say yes,\" Stiles says. \"Because I would. Constantly, if I could get away with it, you and sex are an awesome combination. But my ass is still kind of - not up for a repeat round yet.\"\n\"Mine's fine,\" Derek murmurs into his skin.\nWhich - oh my God - fuck, yes. Yes.\n \n*****\nThey do both get in the shower eventually. Though it takes a while to get to the whole cleaning part.\n*****\n \nIt's hard to settle down with the stuff they took from the house, to open the cases and bags, and search through the belongings of the people they'd killed. Stiles tells himself that they all wanted the stone. They were all prepared to power it, and use it, and he shouldn't feel sorry for any of them. They were bad people. But they were still people, and their stuff just makes it more obvious. Tangled phone chargers that had been badly rolled up, keyrings, pens without lids and chewed ends, receipts and notes, and grocery lists. Their jackets and bags aren't full of evil witch paraphernalia, they're just full of people things. The most important things might be Marcus's phone, and the laptop belonging to the woman, Christie. Though the laptop is password protected, and Stiles has no idea how to get into it. Because computer hacking skills are clearly not part of his muscle memory. He has no idea if he was good at that before, but he's worse than useless now.\nMarcus's bag has less people things in it, and more creepy shit (which is probably not a technical, magical term, but it applies, so Stiles doesn't care.) There are thin sticks in plastic bags, that smell incredibly suspect, feathers and tattoo ink, and what looks like a set of knuckledusters for a man with seven fingers. There's a pendulum on the end of a long piece of string, with what looks like blood on it, inside a plastic case. Which seems familiar but he's not sure how. Oddly shaped bones, and sheets of paper with writing Stiles can't read. He doesn't really want to touch any of it of it (and some things he wants to touch significantly less than others,) so he just pokes it with a motel pen instead. Also, there are books, old books with tiny cramped writing, and few pictures. Stiles doesn't think they were written for anyone whose knowledge of magical theory isn't bewilderingly deep. It's almost like if someone with a vague interest in astronomy was given a thousand page essay on string-theory. He doesn't have a hope.\nDerek's sitting loose-limbed, and half-naked and beautiful against the headboard. Stiles's ability to concentrate on dry, centuries-old magical history? theory? is severely damaged by that. Especially now he knows what Derek feels like. Now they're together again, properly, or something like it. He's not used to the way Derek touches him like he can't believe he ever stopped. Which Stiles isn't sure he's ever going to get used to.\nBut it's pretty freakin' distracting. He chances a look over the book he's flicking through.\n\"I don't know enough about magic to know what half this stuff is. I mean, I could make a guess but I'd probably be wrong at least half the time, and it's safe to say these books are almost completely impenetrable, to me at least.\" He drops them on the table, and drifts over to the bed, lets Derek pull him close enough to kiss, and Stiles doesn't resist, doesn't even remember how to want to resist. If he'd known Derek would make it this easy to kiss him - Stiles would have been less afraid of it. \"I don't know what I'm doing,\" he admits, angry with himself for not being better at this, for not being able to figure out more of it.\nDerek just pulls him down into the warm, heavy curve of his body, breathes a laugh into the side of his neck. Fingertips dragging through Stiles's short hair. Before he's over him, kissing down, nails drifting up his ribs.\n\"I have to keep looking through their stuff,\" Stiles says, words falling out reluctantly between biting kisses. \"I have to find something.\"\n\"Tomorrow,\" Derek says fiercely, hand already pushing into the loose waistband of Stiles's borrowed jeans. \"Tomorrow.\"\n \n*****\n \n12345  - stoneofechoes - marcus - christie12345\nStiles's attempts to guess Christie's password are not going well. He gets the feeling she was probably smart enough to not have picked something obvious. It doesn't help that he doesn't know anything about her. No personal information, no birth date, no likes or dislikes. All he really knows is that she was a vindictive bitch, one that hung around with a group of witches who were willing to sacrifice children for power, and what she'd sounded like when she screamed. Which isn't anything to base any sort of relationship on, or to get into her very secret laptop. Derek is the one who'd killed her, which is about as intimate as you can get with someone, but Stiles is fairly sure he'd have even less luck. Stiles doesn't think Derek is a fan of modern technology. He supposes that growing up in the woods, in a huge pack of werewolves - which is his favourite fake childhood for Derek - that he'd find it kind of hard to make time for Facebook too.\nHe switches to Marcus's phone, which isn't password protected. That would probably be more helpful if he actually knew what he was looking for. There are no full names in the phone book, only code names and numbers, and there are no messages. There is a calendar, with all the phases of the moon clearly marked. One of them, the new moon, is highlighted and has a note. 'Active.' He swivels it so Derek can see. Derek pushes off the bed and comes closer, hand curling round Stiles's neck like he has to touch him, like he can't help itself.\n\"He clearly had a plan for the new moon. Something we need to know, something we could use, maybe?\"\n\"Or something completely unrelated to any of this,\" Derek suggests. Because optimism is clearly not Derek's thing.\n\"Hey, I'm trying here. You're not exactly helping with this, and someone kept me up all night, so wild stabs at things is all I've got at the moment. You could try making a few wild stabs of your own, you know.\"\nDerek makes a grumbling noise that sounds annoyed, but shoves a hand up under the back of Stiles's shirt anyway, fingers shifting mindlessly on his bare skin, some strange refusal - or inability - to be mad at him any more.\n\"There's a red mark on the new moon,\" Stiles adds. \"It must be important in some way. Something to do with Frain.\"\nDerek looks at him, and he obviously thinks Stiles is reaching for something that isn't there. He sighs and tosses the phone on the table.\n\"So we look for him again, using his name, and the reports of disappearances.\" Stiles curls his hands into fists, frustrated and angry, because if they have to wait for children to disappear to get a lead on him, then Frain has already won. \"We'll find him again. We will.\"\n\"You know that for sure?\"\n\"Yeah.\" Stiles scratches at his bare shoulder, where Derek's shirt has slipped to one side. Derek follows the movement with his thumb, and Stiles is left staring at the calendar for a second.\n\"You're very distracting,\" he admits, when he can't catch the edge of his last thought.\n\"Uh huh,\" Derek agrees, thumb moving in circles, around and around - smaller and smaller circles.\n\"Holy shit.\" Stiles is off the chair and over by the bed, bending over it and rifling in their bag for the laptop before dragging it out. He jigs from foot to foot while it boots up and then finds Google, and types in 'locater spells, pendulum.' There's a lot of rubbish, but there are also pictures. Heavy pendulums on string, and maps. He flails a hand out, open and shut, impatient. \"Did you get the maps from the gas station?\"\nDerek's already unfolding them on the table. As if he's following his thoughts. Stiles digs in Marcus's things, pulls out the pendulum.\n\"So I'm guessing this is Frain's blood, yes?\" He slips it out of the case and tips it into the light, until the red-brown stains are more visible. \"They weren't looking for anyone else.\"\n\"It's definitely blood,\" Derek agrees. Unlike Stiles he doesn't have to look at it. \"And it's supposed to find him? Can we even do this? We're not witches, can we make a spell work? Do we want to?\"\"\n\"Do you have any better ideas?\" Stiles says, and he's straightening the largest map. He holds the pendulum over it, runs a hand down the string to settle it. But nothing happens. The only jiggle in the string, is from his own hand. \"Shit, why isn't this working?\"\n\"It seems a little obvious,\" Derek says slowly, because clearly he's an expert all of a sudden. \"You're not supposed to do anything else with it?\"\nStiles shrugs, helplessly, he'd expected it to work, and he's not sure whether to feel frustrated or embarrassed that nothing's happening.\n\"You're supposed to just hold it. It's supposed to do all the searching on its own. It's meant to swing, and then you ease it down until it stops against the map. Hang on.\" Stiles swings the laptop round again, kneeling up on the chair, until he can bend over the table. \"Something about people with magical protection -\" Stiles stops. \"Oh, it won't work on people with magical protection.\" His sinks to his knees on the chair.\n\"Which I'm assuming Frain has,\" Derek points out. \"He'd have to.\"\nStiles frowns.\n\"But the others found him, they had his blood, they must have found a way past it. Hang on, hang on, reading. Magical protection works...unless it's a new moon.\"\nHe juggles Marcus's phone, and the laptop and the pendulum, until Derek takes the laptop from him. Then he spins Marcus's phone to face Derek, calendar still glowing on the screen.\n\"We have to wait three weeks to find out where Frain is,\" Stiles says fiercely. \"But we can find him.\"\n \n*****\n \nStiles thinks three weeks is going to feel like a lifetime. The two of them, pushed together in random motel rooms, trying to remember how to get along, living in each other's space, dealing with the fact that they were sleeping together again. He doesn't want to fight with Derek, now his life feels something like stable, for all that there isn't much of it. Only there isn't any trying to remember how to be around each other, there isn't any knocking up against each other's edges. It's easier than it should be. They argue over laundry, they compromise on food, they watch too much late night TV, and Derek still won't let him drive the Camaro (he can't even remember that first frantic drive out of Beacon Hills.) Occasionally they scroll through the local news stories, Stiles tapping a pen against anything that looks suspicious, while Derek watches him, like he knows exactly what he's thinking.\nStiles eventually worries about the full moon, which creeps up on them slowly, almost without them noticing. He asks Derek about it, over boxes of Chinese food, because he doesn't want it to be the elephant in the room. It's pretty much the only thing he knows about werewolves after all - if it turns out to be true.\n\"Are you going to, like, turn into a wolf, an actual wolf?\" Stiles asks, dragging one of Derek's boxes within range of his chopsticks. Because he's apparently the type of person that has to try everything.\nDerek shrugs. \"Hell if I know.\"\n\"I mean, not that that wouldn't be amazingly cool and everything, if you did. Because it would, if you're worried. But I'd kind of like some sort of warning if that's going to happen. Or if you're going to be - I don't know - something more like the giant savage wolfman that you see in Hollywood movies.\"\nDerek doesn't seem to think that's a compliment.\n\"I don't know exactly.\" He shrugs. \"But I guess we'll find out.\"\n\"That's what I mean though, is it -\" Stiles stops. Because he isn't sure how to say this to the guy you're sleeping with.  \"Should we find somewhere to put you,\" he asks cautiously. \"I mean like locking you away for it, until it's...not the full moon any more?\"\nDerek pauses, chopsticks half way to his mouth. He frowns, as if he hadn't even thought about whether he'd be dangerous on the full moon.\n\"I don't - I don't think so. I don't think it's going to be dangerous. I don't feel like I'm going to be dangerous. it's more like -\" he sets his food down, face twisting in thought. \"It's more like the waves are getting a stronger. Like I'm getting stronger as it gets closer, clearer, and everything is almost - I don't know - easier to touch, inside me. But the control is still there. I still have a handle on it. I can feel it rolling there, under the skin. But thinking about things, you, what we're doing, makes it settle.\" He shakes his head and frowns. \"It's hard to explain.\"\nStiles leaves him the last spring roll.\n\"I don't know. I think you did a pretty good job.\" He trusts Derek, he does. Not just because he's the only person in his life right now. Because Derek tries to do what's right, even though he doesn't remember why.\nSo, yeah, the full moon mostly passes without any sort of transformation, or screaming, or silver chains. Nothing really happens at all.\nApart from the sex.\nThe sex is fucking awesome.\n-\nThey learn, over a lazy weekend, that Derek can't get drunk, and Stiles absolutely can - also hangovers are evil and should be genetically bred out of human beings, so no one has to suffer like that - silver doesn't do anything to Derek. Stiles has no idea how to get his hands on wolfsbane to test that out. Derek isn't all that fond of the idea, protesting that if it drove him mad he could be dangerous to not only Stiles but everyone else in the vicinity. Reckless experimentation seems to be Stiles's thing. Getting pissy about being a guinea pig is apparently Derek's thing. Though Stiles can't really fault him for that.\n-\nA spate of animal attacks that leave nothing but messy corpses behind, leads then fifty miles north. Stiles isn't sure about heading into the woods, but Derek seems to know what he's doing, and he can sprint through them like nothing Stiles has ever seen, faster when he gives in and drops to all fours. Which is pretty fucking insane to watch, if he's honest.\nIt's a group of rogue werewolves, smaller than Derek. They're clearly afraid of him, they call him 'Alpha,' and they look at Stiles like he's food. Stiles spends half a night pushing stranded hikers towards safety, while the woods are full of snarling and crunching, and wet noises of pain.\nHe worries, he can't help it. He worries for Derek, because werewolves are the same level as him. They're a threat to him. But he also worries that Derek will find something out here, someone, some werewolf. He worries that Derek will choose them instead.\nInstead Derek leaves the last werewolf's shattered body at the bottom of a ravine, and limps back to the car. Then spends the whole drive back staring at the place where the rogue werewolf had grabbed Stiles, at the long, messy scratches he'd left behind on his wrist - and when they get back to the room he's clearly restraining himself from putting his mouth there. The raw drive of it, leaves Stiles breathless.\n\"It's fine,\" Stiles says, dragging his shirt off. \"Do it, I know you want to.\"\n-\nDerek's the one who buys a gun. Stiles isn't expecting it, he gets back to the room and it's just sitting on the table, next to the paper and a tall cup of coffee.\n\"You thought you weren't scary enough already?\" Stiles asks, more than a little surprised. Because Derek had never struck him as a gun sort of person.\n\"It's not for me, it's for you.\" Derek pushes it awkwardly across the table. Then frowns, as if he's not entirely happy about it.\n\"You realise I can't kill a werewolf with that, don't you?\" Stiles points out. \"You're a werewolf, you should know that. As for whatever else is out there -\" He shrugs. \"Who knows.\"\n\"No, but you can hurt one enough to make it think twice, or to let you get to the car,\" Derek says. He's clearly been thinking about this. Stiles thinks the whole werewolf chase in the woods rattled him more than he let on.\nStiles sighs and picks it up, checks it isn't loaded without even thinking about it. Then stares at his own hands\n\"I think it's safe to say you've done that before,\" Derek says quietly, he looks just as surprised as Stiles feels. \"You wanted to know something about yourself.\" Derek's expression is worried, which probably says more about what Stiles looks like, than what Derek feels about it.\nStiles isn't sure whether he wanted to know that about himself or not.\nHe puts the gun in the trunk, and does his best to forget about it.\n-\nThere's a ghost in a hospital, two hundred miles out of their way, but they go anyway.\nStiles and Derek spend a night digging bones out of a basement floor, while the victims of an angel of mercy hold off her ghostly claws. Stiles doesn't know where to take the bones, what to do with them. So they toss them into a river, watch them separate and float away.\nThey're doing this the best way they know how, and maybe they're doing it wrong, but they're trying.\n-\nIt's Stiles who suggests looking into magical protection, for when they go up against Frain. Derek isn't so sure about the whole fighting magic with magic thing. Stiles protests that that's the whole point, it's not for fighting, it's for protection. Frain has the stone and there's the possibility that he's going to be stupidly powerful when they finally find him. Stiles knows they don't stand a chance against that, unless they can take Frain by surprise, and if he has any followers, werewolves - anything like the trap where they fought Marcus and his group.\nDerek hates the idea, but he doesn't object when Stiles researches all their options.\n \n*****\n \nAndrew Frain's secret apartment is a thousand miles back the way they'd come, back towards Beacon Hills. It takes them a couple of days to get there, and judging by the lack of any sign that they were being followed in the last three weeks, Stiles thinks - he hopes - that there are no witches left to follow them.\nThey check into another motel, just outside town, once Derek's satisfied that the place doesn't smell like witches. Stiles hasn't actually asked what witches smell like yet. He's starting to think he doesn't want to know, since Derek's always wrinkling his nose like he finds them offensive on principle. He can't help but wonder how much he knows about actually being a werewolf, whether it's something he can just feel inside, something he learned as they go, or something he was thrown into. Derek himself seems frustrated more often than he should, and Stiles thinks a lot of this is a mystery to him as well. He doesn't know how that works, but Stiles wonders if he'd woken up as a werewolf, or a vampire or a freakin' merman or something, if he'd immediately know how to be one, or whether the knowledge of it, the how of it, would be a part of himself that he wouldn't remember.\nDerek looks significantly less offended when Stiles presses him into the back of the door, cold fingers pulling his shirt out of his jeans. Derek growls, and tries to tug on the too-short length of Stiles's hair, fails miserably.\n\"I need this, before we look for Frain,\" Stiles says, between biting kisses. \"Fuck, Derek, please. I can't -\" He stops there. But Derek knows what he means. He has to know, because Stiles's entire body is screaming it. Just in case.\nJust in case.\nIt's a little harder, a little rougher, than Derek's ever taken him before. He pins Stiles to the bed with a strength that's more that he should be capable of, and every thrust is sharp and deep. Stiles thinks he's getting used to the ache of it, to the way Derek fits against him, and inside him. He knows he's becoming addicted to the noises Derek makes when they're together, like he's breaking into pieces. The way Stiles can change them, make them go low and desperate by pushing his body back just right.\nDerek doesn't move off him straight after. He just pulls out and rests against his back, pressing his face down into Stiles's sweat-damp neck, and making a low, rumbling noise. Murmuring words too low to catch.\nEventually Stiles nudges him with an elbow, when Derek's weight isn't quite so comforting any more.\n\"Come on, dude, you weigh a ton.\"\nDerek growls protest, until Stiles is quiet, shifting his weight just a little, just enough to give Stiles breathing room, but not enough to move away. Then Derek digs his fingers into Stiles's waist, holds him in the middle of the bed, breathing him in. Like he needs this too. Stiles sighs and edges his thighs apart, lets Derek soak himself into every pore. It's amazing Stiles smells of anything but him any more.\n\"I get the feeling that sometimes you want to do weird, werewolf things to me?\" Stiles says quietly. \"Things you don't tell me about, because you think they'll freak me out.\"\nDerek's quiet for a while. But Stiles waits for an answer, for the fingers at his waist to relax and stroke down.\n\"Little bit, yeah,\" Derek admits.\nWhich is flattering, or possibly weird. Stiles hasn't decided yet. Though he's apparently into both flattering and weird. Stiles guesses they've had this conversation before after all, or something like it. He knows Derek has instincts that are different to his, that he wants things. He - the before he, the one that slept with Derek and knew who he was, and didn't find any of this strange - he must have wanted things too, must have - he must have liked Derek enough to let him have some of them. All of them?\n\"We probably did them you know, whatever it is you're thinking. I would have let you, I think. I'm pretty sure I would have let you have whatever you wanted. \"\nDerek eases his weight down onto him again, nose pressed just above his ear.\n\"Would you mind if I did now?\" he rumbles, curious, hopeful.\nStiles turns his head, until he can just see him over his shoulder.\n\"Tell me,\" he says. \"Tell me what you want.\"\nDerek breathes into his hair, air warm against his scalp. He doesn't speak for a minute, as if he's not sure if Stiles is serious. Or maybe he just doesn't know what to admit to first.\n\"I want to stay inside you after I come,\" he says at last, almost too quiet to hear. He presses his face into Stiles's skin, and the rasp of stubble almost tickles.\n\"How long?\" Stiles asks, curious, because Derek doesn't talk about what he wants much.\n\"Until you stop squirming,\" Derek rumbles, like he's thought about it a lot. There's a pause. \"Until you fall asleep, maybe.\"\n\"What else?\" Stiles asks, because he wants to know. He wants to know if any of them are things that he thinks about too.\n\"I want to bite you,\" Derek says quietly. \"When I'm inside you, hold your neck in my teeth until I leave a mark.\"\nIt takes Stiles a second to realise the implication of that, and he's not sure - he's honestly not sure what he thinks about it.\n\"That's not - that's not a werewolf turning thing is it?\" he asks, carefully, he knows that just because it's a thing Derek thinks about, doesn't mean he would actually do it. Not without asking. But there's still that sliver of unease at the thought of it.\nDerek's fingers stop moving, and he eases his mouth away from Stiles's skin, as if that wasn't what he'd meant at all.\n\"No, I don't think - no, I think I have to be - with the fangs to do that.\"\n\"You think?\"\nThere's a moment of quiet.\n\"I know,\" Derek says firmly. \"That's an instinct too, and I don't - I don't want that with you.\" It's said slowly and quietly, as if Derek isn't entirely sure - no matter what he says.\n\"You just want to mark me?\" Stiles guesses. \"Something that shows.\"\nThe rush of breath at the back of his neck stops, and then comes back, warmer and harder than before.\n\"Yes.\" There's no hesitation there, Derek admits that one straight away.\n\"Like a 'keep your damn hands off, this is mine,' sort of a mark?\" Stiles continues.\n\"Yes,\" Derek isn't trying to control the way his voice sounds. \"That and more.\"\n\"That's kind of messed up,\" Stiles says, though he reaches a hand back and digs his fingers into Derek's thigh, to show he doesn't really mind. He wants things as well, after all. The difference is he's not brave enough to say them out loud.\n\"We've been hunting witches with severe memory loss, I'm a werewolf, you're seventeen. I think we reached messed up a while back,\" Derek murmurs, presses down into his body again.\nWhich is true, they probably did. They probably reached it long ago, if Stiles is being honest, before they started this. Or maybe when they started this.\n\"It'd hurt wouldn't it?\" he asks.\nDerek goes still, hands curled round Stiles's waist, his nails dig in, all warning sharpness.\n\"Yeah, it'd probably hurt.\"\nWhich - doesn't mean he doesn't want it, and that surprises him. Because he hadn't known that was his thing, before - before - shit, just over a month ago. Which isn't any time at all to hope to know everything about yourself, is it?\n\"I think I might let you do that, next time,\" he says quietly.\nDerek's hand slides up to the back of his neck.\n\"Don't say that unless you mean it,\" he growls out, like Stiles has pushed hard enough to make him feel...uncivilised. He kind of likes the idea.\nStiles lets Derek's hand press him forward.\n\"Don't say that unless you want it too.\"\nStiles squirms until Derek lets him turn over, and he's slotting their legs together and pulling Derek down, by his stupid, soft, spiky hair.\n\"I do,\" he says quietly. \"I think I'd let you do that. If we survive Frain I'll let you put your teeth in me, you possessive bastard.\"\n*****\nFrain's apartment is in a nice part of town, quiet and upscale. Magic and child-murder apparently pays really well. Or maybe when you go to ground with powerful magical artifacts you didn't want to stand out from the crowd. It probably wouldn't do to have magical symbols daubed all over the walls, a few animated corpses guarding the door. That kind of shit can bring down the tone of the whole neighbourhood.\n\"He's in there isn't he?\" Stiles asks, because even though he can't hear anything, or smell anything, he knows that Derek can.\n\"Someone's in there,\" Derek confirms, mouth twisted in a scowl. \"The whole place stinks of them.\"\nThey make their way round the back, and Stiles is checking every patch of grass, every part of the wall, for the same semi-circle pattern that was in the house. He's checking for any pattern at all, any writing, anything that looks out of place, or that looks like a trap. He doesn't see anything, but he's careful where he puts his feet anyway. He tries to be ready for things he might not be able to see.\n\"There should be some sort of protection here. I made notes about what to look out for, but there was so much of it. I wish I remembered more about this stuff.\" Stiles wants to reach out, wants to stop Derek from pushing on ahead. He doesn't know whether that's paranoia or common sense. But it's strong enough to rattle him more than he is already.\n\"Maybe he doesn't feel like he needs protection,\" Derek says darkly.\nStiles doesn't want to think about the possibility that this might be a guy who really doesn't need to put up protection. Or leave any guards. If the stone is as powerful as the book suggests. Their plan is fairly simple, kill the witch - but putting it into practice, that's another thing entirely. He wishes he'd brought the gun.\n\"Or maybe someone broke it already?\" Stiles guesses. \"You said the place stank of them.\" The door's not locked. But then maybe witches don't bother with security. Stiles carefully pushes the door open, and Derek holds him in the doorway, doesn't let him go past it.\n\"I'm going first,\" he says, hard, grating, and Stiles already knows that there will be no argument about this. Nothing he's going to win anyway. Whether he likes it or not.\n-\nThe whole apartment's dark, and it stretches away, in both directions. Looming shadows of furniture and lamps, the vague outline of doorways. There isn't enough light to get a good idea of the interior. But Derek only gets a foot inside before he stops.\n\"What? What?\" Stiles tangles a hand in the back of his shirt, pulls hard enough to actually get Derek swaying back a step, so Stiles can see past him.\nThere's a body on the floor. Sprawled at Derek's feet, limbs stretched out on the carpet in a way that says it was trying to drag itself towards the door. Its dry, brown skin is sunken into its bones, and the face looks like it's been melted by something. It's still smoking faintly, though it doesn't smell, at least not to him. Stiles thinks he should be able to smell it. Even though he really, really doesn't want to. He takes a jittery step back, and knocks into Derek.\n\"Holy crap, it's like he looked into the Ark of the Covenant or something,\" Stiles says, because there really is no better way to describe it. He knows because he's trying to think of one. But Derek has a hand on his shoulder, turning him slowly. \"Jesus Christ.\" Stiles's voice comes out thin, tapers off at the end. Because there's not just the one body at the door. The bodies are everywhere. They're strewn across the apartment. The messy, half-lit aftermath of what had to have been a fight. Some barely look as though they were touched, others are a mess of broken bones and blood. Some of them are in pieces, and there's another like the man inside the door, next to the shadow of the couch. There's even a statue against the far window, which Stiles has the awful feeling used to be a person. Now hunched in on itself, stony and misshapen.\nStiles can hear Derek breathing beside him, and he wants to reach out, wants to step back, wants to do pretty much anything but venture further into the apartment. But he takes one shuffling, silent step forward, swallows down something hysterical, chokes it back until he can breathe again. He makes himself deal with this.\n\"Do you think one of them's Frain.\" Stiles hears himself say, and he has no idea how he can sound so normal standing in the middle of this. For all that he's trying, he still has no idea how he manages it.\n\"No,\" Derek says, and he curls an arm round Stiles's waist, pulling him back into the curve of his body, already looking up in the direction of the bedroom doorway.\nIt's not entirely dark, there's a lamp lit in there somewhere, and Stiles never heard the door open, but it must have done. There's a man standing in the shadows, emaciated, pale and sweaty. His skin looks like it's been stretched over his skull - but too hard, it's already tearing in places. He has no hair, and one of his cheeks is hollowed in, like his teeth are just gone. He's half slumped against the wall, Stone of Echoes burning a sickly green where it hangs against his bare chest. His fingernails are clawed into the wall, as if he's trying to hold himself up, and his chest is heaving. But his eyes are fixed firmly on them.\n\"Oh my God,\" Stiles says, he can't help himself. He thinks it's safe to assume that this is Andrew Frain.\n\"Well, well, more visitors. I am blessed.\" Frain's voice rustles out of his throat in dry bursts.\nStiles's horror must be obvious.\n\"I'm not what you expected?\" Frain sounds amused, though there's a stiff edge to it, one that says his amusement doesn't always end well for other people.\n\"What did it do to you?\" Stiles hears himself say. Because that's the only thing he can think of right now. Frain looks like he's being eaten alive from the inside.\n\"It did what it's supposed do,\" Frain says, like he's not offended at all. \"Test its wearer, test their conviction, their determination.\" Frain takes two heaving breaths, and works his way further along the wall, bare feet soundless on the carpet, like he weighs nothing at all. \"But it's so impossibly hungry, all the time. It's never enough.\" The words are snapped out, in that dry-branch voice. Spit's gathering at the corner of his mouth, the foam of dehydration.\nStiles is pretty sure he still looks horrified, because Frain laughs, a croak that sounds demented and hoarse.\n\"We always think we can control what can't be controlled, don't we? We lie to ourselves. We always think we're better - think that we're more than we are.\" Frain uses the wall to take another step forward. It looks painful, he looks like he'll snap if he moves too fast. But his hands are crackling faintly, with slow blue fire. Stiles is afraid to move. Frain's practically a corpse but he's still the most terrifying things Stiles has ever seen. For all that he hasn't had time to see much. \"But I still have more than enough power to destroy you,\" Frain says thinly. \"To destroy you in a hundred ways. Whenever I please.\"\nDerek tugs Stiles back a step, and Frain doesn't even gesture - but the door slams shut behind them, hard, in a way that says it won't be opening for them, even if they try. The angry crunch of wood expanding in its frame.\n\"You've been following me North, I've felt you. Who are you?\"\nIt's such an easy question. But it's one of the only ones Stiles can't answer.\n\"We don't know,\" he admits, and it sounds stupid coming out of his mouth. To admit to that of all things, ten feet away from a man that would be happy to kill them both, whether they know anything or not.\nBut Frain nods like he isn't surprised.\n\"You met Sebastian, that was always his favourite trick. Steal a person's life, make them yours. I shall assume you're hunters then, though I've never heard of any of them using attack dogs.\" He sends a pointed look Derek's way.\nDerek snarls at him, but Frain simply laughs.\n\"You stay for the boy then. Curious, if not very interesting. You came here to kill me, with barely any magical protection, no memory, no weapons. Forgive me for judging you both harshly.\"\n\"It looks like you're doing a good job of killing yourself already,\" Derek says quietly, and he's right. Andrew Frain's skin is taking on a paper-thin look.\n\"But you still hoped to try,\" Frain says slowly, and it's not hard to see how incredulous he is at the idea. \"Do you have any idea how many witches have tried? Not just witches, werewolves too, and I recall a very persistent skinwalker, and a fetch, though they weren't much of a threat after I killed their better half. So many people hoping that greed, and anger, and arrogance would be enough to destroy me and take what was mine. They were all wrong, of course.\" He stops, stares right at Stiles. \"How old are you?\"\nStiles tries to move back, instinctively. But there's nowhere else to go. Frain laughs at his expression. A jerky, crackling series of heaves.\n\"Oh, don't worry, the stone wouldn't want you, the wolf has already ruined you, in all the ways that count.\" Frain looks honestly disappointed, then disgusted, and Stiles clenches his fists and fucking seethes.\n\"And the children that you fed to that thing,\" he says stiffly. \"They didn't matter at all. They were just what...resources?\"\nDerek's fingers pinch into Stiles's arm, like he wants to pull him back, or pull him behind him. Stiles is fairly certain that Derek knows him well enough by now to realise he won't go. Frain looks as brittle as an eggshell, Stiles could probably go over there and push him over, and he'd shatter into a thousand pieces. But somehow he's still terrifying. The way he's crawling his way along the plaster, stick-thin legs folding and moving like the legs of a bird, face made impossibly more hollow by the green glow of the stone.\nEven Derek is growling quietly beside him.\n\"No one has the conviction to go through with things any more,\" Frain says, voice firmer than before. \"We're the last of us a dying breed. The ones determined to do what must be done and not look back.\" He's still scraping his way along the wall, towards them, bone-thin hands flickering and sparking. \"Willing to do whatever was necessary, no matter the cost, to change the world. To mold it in our image.\"\nThe click of his teeth is audible now, and low as his voice is, Frain still makes it burn somehow. One more step and he coughs, knees going out of him. He raises his head in their direction, as if deciding how he wants to kill them.\n\"They were no challenge at all you know. They came to me, to steal from me, but they didn't realise the power of the stone. They didn't realise its potential. What it could do, what it wanted to do. They didn't realise -\" Frain is almost close enough to reach out and touch them now, where they're backed up against the door. \"They didn't know that it was never meant for anything human.\" It's soft, distant, like a realisation, and there's a soft, dry sound, like twigs breaking. Stiles thinks Frain's trying to laugh again. Then the witch is sliding down the wall, body folding with dry little cracks. Until he's against the carpet, all shriveled, pale limbs and cracking skin.\nIn less than a minute Andrew Frain is a dry husk at their feet.\nThe light on the stone goes out.\nStiles breathes out shakily. Then again, loud and rough. Because they are officially the luckiest people alive. If Frain hadn't emptied himself out fighting whoever had tracked him here. They'd be part of the mess on the carpet.\n\"Jesus,\" Stiles says softly and his mouth tastes like tin. \"Jesus.\" He relaxes in Derek's grip, goes to take a step forward.\n\"Don't touch it,\" Derek snarls, fingers biting in hard enough to hurt.\n\"Wasn't going to,\" Stiles reassures him. \"Don't actually want to go near it, if I'm being honest. But we can't leave it there.\"\n \n*****\n \nThe Stone Of Echoes is behind the motel toilet, wrapped in two plastic bags, a shirt and another plastic bag, and then taped up with heavy duty duct tape. It had been an unbelievable pain in the ass trying to wrap it without touching it. The book said it only affected those who had magical ability, But Stiles wasn't taking any chances with it. Not after seeing up close what it could do. He wasn't risking his life on the assumption that he wasn't magical. Derek had been pretty adamant about that too.\nStiles scratches absently at the back of his neck, then winces when his nails encounter the red, raised skin, because he keeps forgetting. Derek hadn't been lying when he'd said it would hurt. Stiles would be pissed at him, but Derek can't stop touching it, can't stop tugging his shirt aside and looking at it, as if he can't believe Stiles said yes.\nThe TV's on in the background, someone blaring on about some Sheriff's kid that's still missing. Stiles isn't really listening. He's not listening at all when Derek comes out of the bathroom, wearing a very small towel, and water droplets, and absolutely nothing else. He must appreciate the way Stiles is looking at him, because he smirks at him, pulls the pen out of his mouth, kisses him, and then shoves it back in.\n\"You're kind of rude,\" Stiles says around the pen. \"No manners at all.\"\n\"Raised by wolves,\" Derek agrees, stretching out on the bed beside him, jostling Stiles's typing enough to turn the last two words into nonsense.\n\"Next you'll be wanting to pee on me.\"\n\"Not unless you want me to,\" Derek says, while flicking idly through one of the magazines he'd found in the trunk of the car. Stiles suspects that was a joke. It's hard to tell, because Derek's joking voice sounds a lot like his ordinary voice. Oddly enough his angry voice tends to sound more like he's joking than his joking voice. Because Derek likes to be contrary, just to throw people off. Or at least that's the excuse Stiles is going for. He hits Derek with a pillow anyway.\n\"I think we need to talk about the thing we haven't been talking about,\" Stiles shuts the laptop and looks at him. \"Frain's dead - it's - that's what we were waiting for, isn't it? We were waiting until after he was dead. I know you've been really quiet about it.\" Stiles pauses, but Derek's face is giving him nothing yet. \"But I think it's time we phone your friend, Deaton.\"\nDerek frowns. \"I don't know him, I don't trust him.\"\n\"You don't trust anyone you can't smell,\" Stiles says, nudging him with a shoulder. \"But Frain's dead, there are no witches left to ask about our memories. Not to mention we still need to know what to do with the stone. He's helped us before. We know that much. He knows who we are, he can tell us who we are.\" Derek has to want to know who he is, because Stiles does, even though he's afraid of it too. He always did, there was just so much going on, so much to finish. But now it's all done, and no matter how easy it would be to get distracted by something else - it's time.\n\"He might be a witch. He might want to use it,\" Derek doesn't look at him, but Stiles can read his frown sideways, his uncertainty. He thinks it's the same as his own - thinks it comes from the same place as his own.\n\"We have to trust someone eventually,\" Stiles says quietly. Someone other than each other.\n\"I do trust someone,\" Derek says, and stares at Stiles until he has to look away.\n\"Ok, so we ask him how to destroy it. If he wants us to bring it to him we refuse. We find another way, we phone Boyd, or Isaac or Erica. You must have friends we can trust. We have to know, we have to know Derek.\" They have to know eventually, and the longer they leave it, the harder it will be. Derek has to know that.\n\"Don't tell him that we don't know who we are,\" Derek says at last. \"Don't - don't give him anything he can use.\"\nStiles has to wonder what happened to Derek, to make trust so hard for him. To make him expect people to take things from him, if he doesn't hold them tightly enough. He wonders how many skeletons they have in their closets that will hurt like hell coming back. But he can't think like that.\n\"Dude, I don't think I can fool someone who knows us,\" he says instead. \"We don't even know if our names are our real names. He's going to know we're not right. He's going to know straight away when I don't know who he is. This is - we did what we had to do, and we need to fix ourselves - don't look at me like that, I know we're not broken - but even if we can't trust him, we still need his help.\" Stiles is already pulling the folded piece of paper out of their bag.\nDerek doesn't stop him, doesn't try and convince him not to, and Stiles knows that costs him something. To let Stiles trust someone else.\nStiles dials the hastily scribbled number. It rings four times before someone picks it up. Someone soft-voiced, Stiles was expecting something rougher, no nonsense, kind of grizzled. At least that was the picture he'd had in his head. The voice on the phone isn't like that at all, and it throws him for a second.\n\"Is this Deaton?\" he asks. Not as confidently as he'd been going for.\nThere's a pause on the other end. Filled with nothing but silence.\n\"Stiles?\" There's surprise there, and a lot of disbelief. But there's familiarity too, and his name, his name is apparently right.\nDerek comes closer, maybe so he can hear the conversation better, pick up noise in the background, or maybe just so he can lean against Stiles's back. So he can slide a hand down to curl around Stiles's wrist.\n\"Yeah,\" he offers, uncertain what else to say. \"We think we need your help Deaton, or I guess it's Mr Deaton? I'm sorry, I don't know.\"\n\"Stiles, where are you?\" He's expecting the confusion, but not the urgency.\nStiles doesn't answer that. He doesn't need the squeeze on his wrist to remind him not to.\n\"We have something of a memory situation. Meaning we have very little of it, and I'm phoning you because your number was in Derek's phone. There are notes which I'm pretty sure were made by you, and I think you give us supplies, or something. So you must know things. I think we should trust you but -\"\n\"Derek's with you.\" That's definitely relief, more surprise as well though.\n\"Yeah, yeah he is.\" And his name apparently really is Derek. Which is...kind of unexpected actually. \"He's here too, but he - er - doesn't want to trust you.\"\n\"That sounds a lot like Derek. But a lot of people are very worried about you, both of you. We all assumed the worst when we didn't hear from you. We thought you were both dead - and it's a relief to know that you're not.\"\nStiles isn't sure whether to reassure Deaton that they're both ok or not. He's talking to them like he knows them, but to Stiles he's just a strange voice on the end of a phone.\n\"We don't know who we are.\" Stiles looks over his shoulder at Derek, but he squeezes his hand, encouraging him to go on. \"We know our names, from our ID, but that's about it. We remember things, but nothing about us.\"\n\"Did you by any chance encounter an animal statue, something like a jaguar, roughly a foot high,\" Deaton says hurriedly.\n\"Yes,\" Stiles says. \"I remember that. I definitely remember that. Is that what did this?\"\n\"I can help, both of you. You need to come see me.\"\n\"It's a little bit more complicated than that.\" Stiles takes a breath. \"We have the Stone of Echoes.\"\nThere's a sharply indrawn breath on the other end of the phone.\n\n\"How the hell - my God, Stiles, please tell me you didn't touch it.\"\n\nStiles frowns at Derek.\n\"I didn't touch it. We need to know how to destroy it.\" Stiles holds his breath and waits. Waits to see if Derek's friend can be trusted.\nDeaton sighs, and Stiles thinks he knows he's being tested.\n\n\"You'll have to melt it down, extreme heat will destroy the fixings and the base, and the stone must be smashed. But after that, please, Stiles you need to come home. You have no idea what your disappearance did to - \"\n\nStiles's fingers are sweaty and too tight on the phone. He can barely feel his fingertips any more. He didn't even realise he was squeezing it that hard.\n\"Where's home? Where's home for us?\"\nThere's a longer pause, and Stiles can't read anything in it, but Derek's hands curl round his arms from behind, and grip tight.\n\n\"Beacon Hills. I think you both need to come and see me. I run a veterinary clinic in town.\"\n\n\"You're a veterinarian?\" Stiles says incredulously.\n\n\"Among other things. Stiles, can I talk to Derek?\"\n\nStiles holds the phone out. It takes Derek a second to actually take it. He watches Derek's face. Deaton does more talking than he does, and Stiles can't hear any of it. He doesn't have the hearing to pick up anything but the steady drone of sound. All he really gets from Derek's face is confusion, before he hangs up.\n\"Do you think we should trust him?\" Stiles asks.\n\"I think we need to go and find out either way.\" There's reluctance in Derek's voice, but they both know they have to do this. That they need to do this, find their way back to who they're supposed to be - even if something in Stiles twists sharply at the thought of it. As if he's not good enough as he is, with half his pieces missing.\nHe exhales roughly.\n\"So, we destroy the stone, and then go back to Beacon Hills. You do realise the place sounds like it's full of witches? It sounds like it is literally a town settled by witches. It could be, I wouldn't know. I wouldn't be able to tell.\"\nStiles takes Derek's phone from him, scrolls through the call history to find Deaton's number, he doesn't know why, he doesn't know what he's doing.\n\"I'd know,\" Derek promises.\n\"Of course you would,\" Stiles agrees. \"Because you're a creeper, and you like to smell things with your super senses. Hey, it could just be a hill with a beacon on it, wouldn't that would be hilarious?\" Stiles is babbling, too fast and too hoarse, thoughts spiralling together in a way he can't seem to stop.\nDerek catches him, before he can start pacing his way across the room.\n\"You're scared,\" Derek says simply.\n\"Dude, yes, I'm fucking terrified.\" He's not afraid to admit it. Because this is it, this is the end of the road. This is wherever they go home to, if they have a home, family, friends. Or none of the above. \"Aren't you?\"\nDerek doesn't say anything, but Stiles knows how to read his face now.\n \n*****\n \nBeacon Hills is a nice place.\nIt's more than just a hill with a beacon on it. But it doesn't look like the sort of place anything terrible could start. It doesn't give the impression that anything threatening could live here. It just doesn't feel like the sort of place the both of them could come from. Stiles doesn't know if that's a bad sign or not. It leaves him uneasy, and it leaves Derek quiet - quieter than usual.\nThey head through town at night, avoiding contact with anyone just in case. Derek still isn't entirely sure if they should trust Deaton this much. But Stiles figures Derek had him in his contacts, and they're going to have to decide to trust someone at some point. They need to be themselves again. If this is really what they do, then they need to remember it. To know how to be good at it, to be better at it. But Stiles isn't going to pretend that the idea doesn't scare the shit out of him. He's not even joking a little bit. The thought of it leaves him shaking in the passenger seat of the car, folding and re-folding the maps, with the sort of attention to detail that would drive a lesser man mad. Derek just accepts the many times Stiles comes close to poking him in the face with an errant corner. But then, Stiles thinks maybe Derek is just as worried as he is. He's just hiding it better.\nDeaton isn't what Stiles is expecting. He's smaller, friendlier, and has less beard that he'd been imagining. But the look he gives them - as if he never expected to see them again. This sort of relieved, shaken look. He doesn't look like he wears that expression often, and it's weird to meet someone who knows you so well, when you don't remember them at all. Stiles keeps expecting to find him familiar, for it to suddenly click, like the name of someone you haven't seen in a long time. But he's nothing - he's just a stranger.\n\"Come into the back,\" Deaton says, gesturing slowly towards an open door, pushing it slightly so they can see that there's no one else in there. So maybe he does know them as well as he's supposed to.\nStiles throws Derek a look, but Derek just lays his hand on Stiles's back, so he can fist his hand in the material of his jacket, and pull him back if necessary.\n\"I'm not a threat to you, I promise.\" Deaton's reassuring tone is good. Stiles wants him to be the sort of man that they can trust. But he clearly understands that they're not there yet. \"Though I suppose that doesn't mean much at the moment, to either of you. I can understand how my motives and intentions are a complete mystery to you. But I swear I mean you no harm at all. \"\nStiles shrugs, because the alternative is to stand here forever, or leave and try to muddle their way through this town on their own. So he follows Deaton, and Derek comes because he can't do anything else. The room Deaton leads them to is smaller, holding an examination table and some stacked up bags of dog biscuits. Stiles can't help the amused look he throws at him. Because he actually is a veterinarian. It's not just a cover for whatever he does on the side, and Stiles can't get his head around the idea of an evil veterinarian, which helps, a little.\n\"You both live in Beacon Hills,\" Deaton says quietly. \"I think it'll be easier if I explain what was done to you.\" He reaches up to take a book from a shelf full of what looks like cat food, then settles it open on one of the silver tables. \"Does this look familiar?\" He taps his finger on the page, and Stiles goes close enough to see. He can already make out the shape of the animal statue though, the pronged curves of it that ended up in Derek's chest.\nDerek nods over his shoulder. \"That's it.\"\n\"Yeah,\" Stiles says. \"That's one of the first things I saw when I woke up. The witch, Sebastian I think his name was, was trying to put it through Derek's chest.\"\n\"Magic that works on memory is very interesting,\" Deaton explains, and Stiles gets the feeling he has a lot of experience explaining things to people. \"Is he still -\"\n\"No, I killed him,\" Stiles says simply.\nDeaton goes very still, like he's surprised by that, but he's trying very hard not to show it.\n\"I see. Well it's really more of a binding than an erasure. The memories have been... I suppose the easiest way to describe it is 'switched off.' You haven't been able to access them but they're still there.\"\n\"Why would anyone even do that?\" Stiles asks. \"It sounds like a really shitty way to attack someone.\"\nDeaton's hand slides down the page, tapping at a symbol that seems to be related.\n\"Oh, it's not meant as an attack. It's more of a method of control. Once you no longer know who you are, you could be convinced of anything. The memories gradually replaced with ones that the magic user deemed more...useful. You were lucky Derek was able to discern that his motives were suspect. I doubt he'd ever attempted to control an Alpha before.\"\n\"Alpha, we heard one of the rogue werewolves we fought call Derek that. What is it?\"\nDeaton pauses, the book falling shut when he moves his hand.\n\"You'll understand when you get your memory back. It would be easier for you if I didn't have to explain everything.\"\n\"Easier for us to go through with it you mean?\" Stiles guesses\nDeaton looks at Stiles, though he doesn't seem surprised.\n\"Yes,\" he says at last, and Stiles isn't expecting him to be so honest. He gives him points for it. \"I think it will be easier for you that way.\"\n\"So how are we supposed to get our memories back anyway,\" Stiles asks. \"More magic? Because I have to be honest, we've both kind of had our fill of that.\"\n\"Tea,\" Deaton says.\nStiles stares at him. \"Tea? You're serious?\"\nDeaton raises his hands apologetically at Stiles's expression.\n\"I'm aware how it sounds. But you'd be surprised how many ways the body can be convinced to throw off magical influence. Though it'll be easier for you than it is for Derek, some of the herbs involved don't react well with werewolves.\"\nStiles moves back into Derek, and Deaton watches curiously, though his face is giving nothing away now.\n\"It won't be dangerous?\" Stiles isn't prepared to risk anything without answers.\nDeaton shakes his head.\n\"No, not dangerous, just unpleasant.\"\n\"I can live with unpleasant,\" Derek says quietly.\nDeaton looks between then again, as if he's trying to read something, and Stiles tries his best to give him nothing. Because he gets the feeling something about them - something about them has surprised the hell out of Deaton, and he doesn't like that idea at all.\n\"I have a few things to prepare. Come in when you're ready.\" Deaton gives them one last look, and then heads deeper into the clinic, through a small door. They both stare after him, until Stiles can't hear him any more.\nDerek's leans into his shoulder, grips his waist.\n\"I'll go first if you want.\"\n\"No.\" Stiles shakes his head. \"No, if it's dangerous for you I want to know if it works first. If something goes wrong, you're stronger than me, you're faster than me.\"\n\"If anything goes wrong, I'll kill him,\" Derek says simply. His hands flex tight on Stiles's waist, and they're reluctant to let go when Stiles turns in his grip.\n\"He's your friend, remember,\" Stiles says, with a shrug and a huff of laughter. \"I'm good, I can do this. This is what needs to happen, right? We get our memories back, we go back to being who we were. Who we are - who we're meant to be. God, it sounds so final like that.\"\nDerek's face isn't trying to hide anything - and Stiles doesn't want to leave him like this.\n\"It'll be ok, we started this together. We'll be fine.\" He rubs his hands on his jeans, wonders why it feels like he's lying. He looks at the door. This feels like an end. It shouldn't feel like an end. But suddenly he needs - he needs to make sure that Derek knows.\n\"Derek?\"\nDerek moves a little closer, nods like Stiles wanted confirmation that this would be ok. But that isn't what Stiles wants. His throat feels too dry to speak, jammed tight full of things he probably shouldn't say. But he'll never get another chance, there will never be another go at this.\n\"I love you,\" Stiles says, quickly, before he can change his mind. He feels a little bit sick, because Derek looks like he's been gutted. \"Just, no matter what happens after I'm me again, old me, I mean whoever Stiles Stilinski is. I don't even care, I just have to say that. I won't be me any more after this, not this me. I'll be gone, and whoever I am - I just had to say it. You have no idea how much I needed to say it. Before it happens, and I'm not...who I am now.\" It hasn't even been two months since - it hasn't even been two months, and this is insane. But Stiles figures if whoever he was before was in love with Derek, then it makes sense. It's not new, it's just something else he'd forgotten.\nBut something cold and solid in his chest wants to tell Derek he doesn't want to do this. They don't have to do this, they could leave. They could leave and be whoever they wanted to be.\nHe doesn't say any of it. He doesn't, he just gets up on shaky legs, and goes to find Deaton.\n \n*****\n \nStiles thinks it'll be gradual. He thinks the memories will come back slowly, maybe he'll remember his name, his childhood, parents, siblings. As if the amnesia is like a fog rolling over the hills, and it just needs to be blown away. But it's not like that at all. It's like waking up from a dream, where you've forgotten who you are, where you've forgotten everything. One moment Stiles doesn't know anything about himself, about his old self.\nAnd then he remembers everything.\nDeaton gives him a look that's all sympathy, and Stiles doesn't even know what his face looks like. But whatever's there, it makes Deaton come closer, lay a hand on his shoulder and grip tightly, as if he's afraid Stiles is going to fall.\nIt's so fucking ironic that he's laughing, and it sounds awful, but he doesn't know how to stop.\n \n*****\n \nStiles goes home.\nHe doesn't know what else to do.\nHis dad looks at him like he's a ghost. He looks old and brittle, and too thin in his uniform. He cries, and hugs Stiles hard enough to hurt, hard enough that he can feel it all the way down to his bones. Stiles feels awful, feels gutted out and horrible, because he didn't know, he didn't even try. It had been so easy when he didn't know anything. When he didn't have to think about the people that might have been looking for him. Stiles feels bruised all the way through, bruised and betrayed somehow, by his old self, by his own stupidity. By the fact that he throws himself into everything so hard, without thinking. Betrayed by Derek, a little.\nHe sits in his room, eating sandwiches he can't taste, talking to cops he doesn't recognise. He has no idea which parts to lie about, so he lies about almost all of it. He had amnesia, he was out of state, he hung around with some people who were into magic, no, he didn't know any of their real names, they disappeared without telling him. He didn't go to the police because he thought maybe he was on the run. He has no idea if his story is coherent or believable. But eventually they leave him alone. Eventually they leave.\nHis dad's too afraid to leave him though. He sits next to him on the bed, asks him if there's anything Stiles wants to tell him. But Stiles doesn't know how to explain any of it. Doesn't know how to tell him that he'd killed people, while he was gone, and it was the right thing to do. So he says nothing, he listens to his dad talk in a voice made raspy-hoarse by relief. He stares at the familiar walls of his room, and tries to feel like himself again.\nHis dad tells him how worried everyone had been, how much it had hurt Scott to not be able to find him.\nScott. Oh my God, Scott.\nIt's so hard to eat sandwiches when you're crying.\nSo fucking hard.\n \n*****\n \nThe Hale house doesn't look like Stiles remembers.\nSomeone has been fixing it. There's new wood, new walls, the porch is longer, the stairs have been replaced, and there's a light on in one of the windows. Which is definitely new, new and strange, because the last Stiles remembers there hadn't been electricity. You were more likely to cut yourself on the old wiring than light anything with it. It stops him in his tracks for a minute, because he's not expecting it. You expect to come back to everything the same, and it's like missing a step in your brain when it isn't.\nHe wonders who it was, who decided to rebuild it. Peter, Scott, Isaac, Erica and Boyd?\nSometimes Stiles forgets it was barely a month and a half. It feels like he was gone for so much longer. It feels like he was gone forever. Trying to put himself back into his life, and finding he doesn't fit the way he used to, edges that keep grating against the outline of who he used to be. It makes him angry, and sad, and it confuses the hell out of him.\nIt's been a week, and Derek hasn't come to him. Stiles had been angry about that, so fucking angry. Until he'd realised that Derek couldn't come to him. That maybe he was just as adrift and terrified as Stiles was.\nHe stands on the lawn next to his Jeep, because he can't go any further. It had taken pretty much everything he had just to get here. Whatever he'd had left, after dealing with his dad, and the cops, and Scott. Nothing fits properly any more. He doesn't know what he's doing any more.\nAnd suddenly Derek is just there, in the darkness next to him, shoulders drawn in. Which shouldn't make it easier to breathe and harder at the same time, but it does. Derek doesn't speak. Which is kind of a blessing, because Stiles doesn't know how to talk to him any more. But he figures that's honest without being - without being something he can't say.\n\"I don't know how to talk to you any more,\" he admits.\nDerek looks like he's trying so hard not to wince at that. Not to feel it. Though his shoulders are hunched up like he's feeling everything else.\n\"Just talk to me,\" he says, and Stiles has a sharp, unhelpful memory of Derek saying something a lot like that two weeks ago, curled lazily against his back, fingers digging into the bend of his waist - he shakes it off. Because it's not helping.\n\"Are you going to talk back? Are we going to have conversations? I don't even know if we're friends. We're not - we're not anything else any more.\"\nDerek turns to stare at the house, before Stiles can catch what's on his face. It takes a long minute before he realises Derek doesn't have an answer to that.\n\"The house looks good,\" Stiles offers, just for something to say. For something to keep them both here.\n\"Isaac.\" It sounds like it's hard for Derek to say his name. \"Isaac wanted to fix it, they didn't know whether I was coming back.\"\n\"Are you ok with that?\" Stiles asks. \"That they've been working on it, I mean.\"\nDerek shrugs. \"Yeah, it was - I'm not sure I would have done. Maybe it's better that someone else did. That someone else tore down the parts that needed it, rebuilt the pieces they could.\" Derek swallows and goes quiet.\nStiles takes a breath, pushes at the conversation.\n\"I always got the feeling that you wanted to keep it as it was, that you felt...responsible or something.\"\nStiles looks at Derek, at the soft, uncertain, confused way he looks back. It's a familiar look. But Stiles knows what Derek looks like braced over him now, mouth open, murmuring his name, over and over, and his heart just clenches. He's suddenly staring at the house himself, rather than looking at Derek. Because he can't, he really can't. Derek doesn't say anything about how fast his heartbeat is. About how Stiles probably smells like sweat, and arousal, and confusion - all broken into pieces.\nHe just stares into the dark, because he can.\n\"It's -\" Stiles wets his mouth, desperately, tries to put his thoughts in order. Because he has to get some of it out, there's just too much of it. \"It's like I'm two people now, and I can't be both of them. There's the me that went on a road trip, and killed monsters, and lived out of motel rooms, and had you, and there's the me that's still seventeen, and in school, and trying to deal with the fact that my best friend is a werewolf, and still desperately trying to find something to be really good at.\"\nHe clenches his hands into fists and moves, because he has to, faces Derek, shoes shifting in the dirt.\n\"I can't put them together. They don't fit together. They're both me, and they're both wrong, and I don't even know what that is. How can I feel like a kid when I spent a month and a half not being a kid - I spent that time killing people that deserved it, and not knowing I wasn't supposed to be that person, and then there was you, and I didn't know. I didn't know, Derek. You didn't have a history, I wasn't afraid of you, and you didn't remember either, and it was easy.\"\nStiles shakes his head and pushes his hands into his pockets. He genuinely has no idea what he's supposed to do. There's a crack right down the middle of - of everything, and he wants to fix it, and he's terrified of it, and angry. Because everything he had was a lie. What's he supposed to say?\n\"It was my first time, you know,\" he says, awkwardly, embarrassed as hell, but it just comes out, and he has no idea why. \"I had never even kissed anyone, but you kept saying - and I just assumed. I thought I'd just forgotten everything, I thought that was why it all felt so strange. I'm probably the only person to lose my virginity and not even realise it. But I was completely willing, because I thought that was what we did.\"\nDerek looks torn open.\n\"Stiles, I'm -\"\n\"Don't say you're sorry,\" Stiles says, so angry he can almost taste it. \"Don't you fucking dare say you're sorry, for any of it.\"\nDerek goes stiff beside him, then curls into himself in what feels like defeat.\n\"God, Derek, I know that it's all different now. I know that your life is more fucked up than we ever could have imagined, and you have Isaac, and Erica, and Boyd, and Peter. I know that we thought everything made sense and we got it all wrong. It wouldn't be the first time we've got it wrong. We've proven how good we are at that. I know that you don't want me -\"\nStiles has to stop then and take a breath, and another. The third breath comes out as noise, and he bites down on it, because he won't, he won't.\nDerek's hand is on the back of his neck, suddenly heavy, palm hot over the fading marks he'd left there, and Stiles shudders and shakes him off, because there is so much sense memory there, and it's all wrong.\n\"Don't act like him. I can't - I can't deal with this if you act like him. You can't touch me and not be him.\"\n\"I am him.\" Derek sounds angry too now.\n\"You're not,\" Stiles says thickly. \"You're really not - but I wish -\"\nThen Derek's hand is back on his neck, forehead pressed hard against Stiles's temple, and he's breathing so hard, so impossibly hard. Stiles feels like he's drowning, but Derek won't move his hand from the back of his neck. He won't let him go under.\n\"I knew something bad would happen if I remembered. I knew I wouldn't get to - this is why I didn't want to do it.\"\n\"You didn't want to remember?\" Derek asks, and there's quiet surprise there, raw underneath the anger.\n\"No, I wanted to keep you.\" Stiles doesn't register how honest that is until after he's said it, and he's shaking his head, trying to force words out, trying to explain, to deflect. But Derek's fingers are dragging in his hair, a painfully familiar sensation - and then he's moving him, pressing him back against the hood of the Jeep. Derek kisses him, and it's familiar and different at the same time. Stiles shouldn't know how to do this, he shouldn't be allowed to grip Derek's hair and kiss him exactly the way he remembers, or maybe not exactly, because this is angry, this is desperate, and Stiles is aware, all of a sudden, of all the things that he isn't. But Derek doesn't stop kissing him, doesn't care. Until Stiles's mouth is his own again, and Derek's staring at it like he did something wrong, or as if he doesn't think he's allowed to do that any more.\n\"What you said, before you left.\" It comes out gritty and hard.\n\"Don't you dare use that against me,\" Stiles says desperately. \"You were everything I had. So don't you dare tell me it shouldn't have happened, or you regret it, or we're going to pretend it never happened. Because, fuck you, I'm not even capable of that right now.\"\nDerek grips the back of his neck and shakes, hard.\n\"I'm not sorry. I'm not sorry for any of it. Don't you get that this is killing me too? I chose you, and I don't regret it. I would still fucking die for you. But I'm not him, I can't be him.\"\nStiles shakes his head, because Derek is so stupid sometimes.\n\"Just tell me what you want?\" He says, because he's tired and that's the only thing he wants to know right now. \"Just be honest with me.\"\n\"You,\" Derek says, without even hesitating. \"I want you.\" Derek's hand slides up his wrist, pushing his shirt up to his elbow and Stiles's stomach stops churning, like it just wanted Derek to touch him. \"I want what we had.\" The words come out in pieces.\n\"Derek.\"\nStiles gets hauled against the solid weight of Derek's chest, hands on his hips, pulling him in tight enough that his feet almost leave the floor.\n\"You're not carrying me into the house you caveman,\" Stiles says, with a snort that sounds a touch hysterical. But Derek already has his face buried in Stiles's neck, and they're doing this. They're actually doing this. This is insane.\nDerek pulls him, in stumbling steps, to the porch.\n\"Who's in there?\" Stiles gets out, because he doesn't want to deal with anyone else right now.\n\"No one,\" Derek says stiffly. \"When I heard you coming I told them all to leave.\"\n\"What did you tell them, about what happened?\"\nDerek shakes his head, one jerky movement.\n\"Its not for anyone else,\" he says firmly, and Stiles feels warm and a little bit broken inside.\nDerek tugs him up the stairs, and holds him against the wall, fingers gentle on the edge of his shirt, barely brushing his stomach as he slides it up. Stiles rolls his eyes, and digs his fingers tight into Derek's skin.\n\"It's not like we haven't done this before,\" he points out. So many times. Derek scowls at him, like he's made a really awful joke, and Stiles laughs and leans in to press his mouth there. Because Derek is still in there, planed and shredded and bleeding a little, but he's still there.\nDerek's bedroom has new floorboards and new paint on the walls, but no bed, just a sad mattress pushed into a corner. They didn't try and make anything of it. Hoping he'd come back, maybe.\n\"Nothing smells like you,\" Derek says fiercely. \"It's like being gutted, do you have any idea what that's like?\"\nYes, Stiles thinks. God, yes.\n\"Shut up, shut up,\" Stiles says, and bites him.\nHe thinks it's going to be strange, that it's going to be awkward, because Derek is Derek again, and Stiles is Stiles. But their bodies already know each other too well. Know how to fit together, know how and when to push. They don't have to be careful. But Derek doesn't seem to know that yet. Because he is careful, stripping Stiles impatiently, but without any force. There's a shaken control about him. Which is the Derek Stiles remembers, not the one he - not the one he knows. That control doesn't leave, it's still there when they press together, when Stiles digs his fingers into Derek's back and hisses encouragement, when he wraps a leg around his waist and takes him, all of him.\n\"Come on, Derek, come on,\" Stiles snaps impatiently. \"You fucked me harder than this after we killed Marcus.\"\nDerek growls at him, and pins him, and he stops holding back, stops treating Stiles like he's something different, someone different. There are large hands on his thighs, and Stiles fists a hand in Derek's hair, and bites at his shoulder. He braces himself with one hand against the wall, when Derek curls over him and into him, and it's just weight and strength and short, hard thrusts into his body, that make him feel like he's shaking apart.\nUntil he does.\nLater, so many minutes, too many to count, or remember. Derek turns his face into Stiles's neck and exhales, like he hasn't since they came back. Stiles pins him to the mattress with all the limbs that still work. Thoughts a blur of before, and after, and now.\n\"I didn't stop feeling any of it,\" Derek murmurs, against his ear, and Stiles knows, he knows.\n \n \n \n "
}