{
    "id": "5798602",
    "url": "https://archiveofourown.org/works/5798602?view_full_work=true",
    "author": [
        "peradi"
    ],
    "title": "have you heard",
    "rating": "Not Rated",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M",
        "Gen"
    ],
    "fandoms": [
        "Star Wars - All Media Types",
        "Star Wars Episode VII: The Force Awakens (2015)"
    ],
    "relationships": [
        "Poe Dameron/Finn",
        "Poe Dameron/Finn/Rey"
    ],
    "characters": [
        "Poe Dameron",
        "Finn",
        "Phasma",
        "Hux",
        "Kylo Ren",
        "Stormtroopers",
        "Luke Skywalker",
        "Leia Organa",
        "Rey",
        "Han Solo",
        "Snoke"
    ],
    "additional_tags": [
        "stories",
        "Revolution",
        "The First Order Sucks",
        "stormtroopers - Freeform",
        "Propaganda",
        "finn is the patron saint of revolution",
        "fn-2187 was a storm trooper"
    ],
    "language": "English",
    "series": "Part 1 of once there was",
    "published": "2016-01-24",
    "completed": "2016-02-14",
    "words": "42,166",
    "chapters": "8/8",
    "comments": "2,066",
    "kudos": "14,403",
    "bookmarks": "5,498",
    "hits": "218,362",
    "summary": "<p>\n<i>\"I heard FN-2187 was a Stormtrooper.\"</i>\n</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>--</p>\n<p>Finn sparks a revolution.</p>\n<p>The Stormtrooper revolution continues, with a little help from some friends.</p>\n<p>The Stormtrooper revolution has ignited the galaxy. Nothing will ever be the same again.</p>\n<p>Otherwise known as: where in the world is Kylo Ren?</p>\n<p>The battle for Persephone.</p>\n<p>The First Order is in its death throes. The end is not quite here.</p>\n<p>The revolution is drawing to a close. A new struggle begins.</p>\n<p>There is much Skywalker family drama.</p>\n<p><i>How close is the ending, well, nobody knows</i><br>The future's a mystery and anything goes<br>Love is confusing and life is hard<br>You fight to survive 'cause you made it this far</p>\n<p> </p>\n<p> <b>This Isn't The End, Owl City</b></p>",
    "notes": "<p>inspired by http://archiveofourown.org/works/5648131 which is absolutely amazing</p>\n<p>follow me on tumblr at swearydroid -- i post star wars nonsense and love getting messages :)</p>\n<p>LADIES AND GENTLEMEN due to popular demand there will be another four chapters of this, one by this friday and the next probably by next monday. the stormtrooper revolution is in progress, and will not be stopped.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>okay the following is going to be a little gushy so i can only apologise </p>\n<p>YOU ARE ALL AMAZING AND WONDERFUL ANd words cannot say how much i appreciate each and every comment and there are so many and i just read them and giggle in utter delight. i am going to respond to every one, but it could take a little while so please don't feel i ignored you -- chances are i have read your comment and i am trying to work out how to reply to it in a way that conveys my utter gratitude and joy</p>\n<p> </p>\n<p>this fic will end at some point i swear. two more chapters. ish.</p>\n<p>there are two more chapters to go. :D :D :D thank you all for supporting me on this crazy ride and here's hoping we'll make it out in one piece</p>\n<p>also, just out of curiosity, who would read a fic where Poe was born into the First Order and had to wear the uniform but also wasn't evil. I'm feeling it. Mainly cos I want to see mr dameron in THOSE BOOTS but ah well.</p>\n<p>and that's it! it's all done, its over, can you believe it. i don't know if im happy with the ending? it was so hard to wrap up. its such a monster of a story. the question: what next? options include:</p>\n<p>1. first order poe<br>2. sequel to this<br>3. prequel to this</p>\n<p>thank you so very much for all ur lovely support and comments and everything. u r all wonderful and if i haven't responded just know that i read what you wrote and really appreciate it</p>\n<p>thank you for being there with me on this wild wild ride.</p>",
    "text": "\"\nThey shoot RK-8978 for the crime of leaving.\nThey mean her as an example. Here, they say, here is what happens to those who would defect, defy, rebel. Here is the cooked blood and collapsed charred flesh of your sister, of the thing who was once your sister, of the anomaly, the broken.\nHere, they say, lies sedition. See how broken it is. How bloodied. See the obscene redness of treachery’s blood against the moon-paleness of her skin. See how small she is, without her armour, see how weak, how she breaks before blaster fire.\nHere she lies, the example, she-who-would-have-left. Here is what happens to the Troopers who would follow in the footsteps stamped by FN-2187, here is the example.\nThe problem the First Order never considered: the example is subjective. A body, cooked and smouldering by a blaster hail, a girl of intermediate age, hair blackened and wisping -- cut down by her very squadmates -- is meant to say all of the above and more, is meant to stand as a fixed point.\nBut TQ-7676 watches with his tongue thick in his mouth, his hands sweating within his gauntlets, bright white in a sea of bright white, and he thinks: this is what they do to those who are caught.\n \n--\n \n“TQ-7676’s squad was poisoned,” General Hux says, his voice low and dangerous, resounding through the galaxy, on holoboards and in dorms, in mess halls and officer lounges. Everyone watches, and everyone hears. “Infected with treachery -- his crime was the crime of his whole squad, who failed to report their concerns to superiors, and so they will all face the consequences.”\nBlasters sing. Twenty three Troopers fall into smoking ruin.\nThe message intended: watch each other, report each other, your crimes are the crimes of your unit; you are not individuals.\nThe message intended: rebellion is a sickness, a tumour, a cancer to be carved from the flank of the Order.\nThe lesson RT-5687 (otherwise known as Red, for the colour of her hair)  learns: when you leave, take with you all you love.\n \n--\n \nThis time, they do not broadcast the execution.\n“It offers the wrong message,” Hux says, heels wearing a path in the corridors of the Finalizer. “It shows that people are leaving. It proves Ren right -- he’s already muttering his venom to the Supreme Leader.”\n“So we pretend it never happened,” says Phasma.\nHux sighs. “Don’t be so  literal  Phasma. It’s unbecoming. It’s about...shaping the truth. Telling them how to think. Telling them what the story  really  is -- get them by their thoughts, and the rest will follow. They  cannot  think that FN-2187 is someone they can imitate…” he blinks, a slow smile curving his face. “So we tell them that he is not one of  them  . I always thought he was a little too good to be a  genuine  Stormtrooper.”\n \n--\n \nThe mark of good propaganda: when it convinces even those who dream it up.\n \n--\n \nBefore she died, RT-5687 said to EG-5555  did you hear of the traitor FN-2187  and EG-5555 said  yes he was a Resistance plant, didn’t you hear? \n Well yes  RT-5687 said  but don’t you know that some think -- \n\n Some think what? \n\nTreachery. It tastes of copper blood, hot and salt in the mouth, and RT-5687 bites down on it.\n\n That he was one of us. \n\n Don’t be   stupid. \n \n--\n \nEG-5555 is known to her squad as Fiver. She is an excellent markswoman, her Aqualian heritage granting her better eyesight than most. It also gives her a frill of dry blue scales around her eyes.\n(In the Resistance there is a joke about humanity: they fuck anything that sits still long enough, even the things designed to prey upon them.)\n(A fact about Aqualians: they are sharp teeth and long venomous tentacles)\n(An achievement of an ancestor Fiver will never know: somehow impregnating a giant sea anemone.)\n“The traitor FN-2187,” she spits, during a weekly Moral Meeting. “He was never a Stormtrooper. He was never one of  us .” Her squad nod around her.\nThis is the truth. This is the truth they know. FN-2187 was not a normal Stormtrooper. He was a Resistance plant. He was a shapeshifter. He was a Bounty Hunter.\nHe was, in short, anything but one of  them .\n“He’s scum,” agrees EG-7070. They call him Two Sevens, because nicknames are often in short supply -- this squad already has a Seven, a Sevener, a Seven-Seven, Big Seven, Little Seven and Medium Seven.\n“Was  scum,” Fiver says. “He’s dead.”\n“No,” says Big Seven. She’s shaven-headed and silver-eyed, black as night. “No, he’s not. I was on a patrol on H’Trakok, in the J’Ara system, and we were told to keep an eye out for him. My, uh, my commander said that he had been seen on patrol in the area and we had to find him…”\nHer voice trails off. Fiver wets her lips. She thinks of that trooper, the one people used to call Red because of her hair, the one who vanished along with her squad, dead in action.\n“I heard,” she says, treading soft, treading slow, words sneaking into the conversation, curling up from her throat, “that...that  some think  ,” and here she stops. Treachery. It tastes of copper. It tastes of blood. She thinks of Red, of the squad that died on some backwater, of commanders who do not remember and Stormtroopers who never forget, because all that they own is what they see with their own eyes and hear with their own ears and even  then  they do not own these things, because Big Seven could -- if she was commanded to -- forget that she had ever been on patrol in some lonely planet in some lonely system --\nBut she didn’t forget. She is saying.\nAnd so Fiver says, “That some think that he was a Stormtrooper.”\n \n--\n \nMedium Seven, EG-6777, wants to report her.\n“Spreading dissent,” he says. He’s very young. His eyes are fiery with hate. He’s got the words of the Order on his bones. “It’s a dangerous, ridiculous lie.”\nStormtroopers do not have friends. Stormtroopers do not have sisters or brothers or family, and yet Medium Seven comes to Two Sevens before he goes to a superior -- not because of programming, but because it feels normal, it feels  right , to discuss these things.\nRaised from birth to a chorus of propaganda, the song of war, and some things can never be crushed: namely the teenage urge to   talk .\n“It is,” says Two Sevens, though he does not know precisely what Medium Seven means: the lie that FN-2187 was a Stormtrooper; that he is alive; that he escaped at all.\nThere are many, many lies.\n“We should get her purged, for the good of the unit.”\nExamples are what you make of them. Two Sevens thinks of TQ-7676. The holoboard. The steam coiling from broken white-black shells, like beetles smashed underfoot.\nThe message: if one fails, we all fail.\nThe lesson: if you see someone committing dissent, and do not report it, you are as guilty.\nThe  actual lesson: we see your unit as the same entity. All will account for the crimes of one.\n“I’m meant to outrank her. They’ll blame me.”\nStormtroopers do not have friends. Stormtroopers do not have brothers. Stormtroopers, especially Stormtroopers like Medium Seven (baby fanatics with fire in their eyes and hate on their lips), obey without question.\nMedium Seven does not say a word to the officer when she comes for inspection.\n \n--\n \nTwo Sevens is loyal to the Order. He believes firmly that they are in the right, that democracy is a scourge. He has fired his blaster into unarmed crowds, and he would do so again, but there is a kernel of...not doubt, not that, but  confusion .\nWhy are there so many stories of the traitor circling? Why can no one agree on what happened?\nOnboard the Finalizer, Kylo Ren throws a tantrum. This is not anything unusual.\nThe difference: the red flash of his sabre curves through a command console and through Medium Seven. The boy dies between one breath and the next, his blood running red through the plates of his armour, smashed-beetle bright, and he smells of cooking meat.\n“Get rid of that,” Hux tells Two Sevens, flapping a hand at him. “Stop costing me  money , Ren,” says Hux, fallen soldier forgotten.\nStormtroopers do not have friends. They do not have brothers.\n \n--\n \nTwo Sevens is loyal to the First Order.\nHe fires his blaster into unarmed crowds. He obeys without question.\nHe tells nothing but the absolute truth.\n“Medium Seven was the loyalest of soldiers,” he says. “He served no other master but the First Order. He would have turned any of us in if he suspected us of treason.” A pause. A weighted pause. In the dorms: Fiver with her strange, blue-frilled eyes; Big Seven with her calm certainty. Others: Sevener, Sevens, Bright -- a cruel nickname, for she is anything but -- Sharp, Spite, Shiner, Charm. Niner. Fives, Sixes, Thirds, Four-and-half.\nThis is a eulogy. Eulogies are permitted. Eulogies are not treason -- how could they be? All Two Sevens is doing is speaking well of his model comrade. All Two Sevens is doing is highlighting the good of his service.\n“And he died,” he says. “He died.”\nHe doesn’t need to say: Kylo Ren killed him.\nHe doesn’t need to say: Hux asked me to get rid of  that .\nHe doesn’t need to. They know, they all know, and they raise their alcohol ration in a quiet, solemn toast.\n \n--\n \n“I heard that FN-2187 was a Stormtrooper,” says Fiver to him, three days later.\nHe could say  that is not what I was told  . He could say  we do not speak of traitors  . He could say  once upon a time Hux’s speeches were full of bile and hate for that man, and now he is not mentioned at all. He could.\nHe says, “I heard that too. Who did you hear it from?”\n“She’s dead now. Her entire squad as well.”\n“I admire your comradeship,” says Two Sevens, “and I appreciate your presence in my squad. And I have heard that too. A lie, of course.”\n“Of course.”\n“We need to make sure it has not spread. Has the rest of the squad heard it?”\n \n--\n \nThey have.\n \n--\n \n“How could they just have vanished? ” Hux shouts.\nPhasma shows her teeth. Her helmet is wedged against her hip. “I don’t know,” she admits. Sleek chrome glittering in the sterile lights of the Finalizer. Hux’s fists quivering at his sides. “Three hundred and twenty six,” she says, “we’ve got back a hundred, but the rest --”\n“In the scheme of things,” he says, “that’s not much. Right?”\n“There are two billion active Stormtroopers in our Empire,” she says.\n“Good,” says Hux. “Good.” But there’s a thin thread to his voice, a snag, a catch; the unspoken --\nTwo billion. And what if they decide that they are not Stormtroopers anymore?\n \n--\n \n“Have you heard the rumour?”\n“Yes. FN-2187 was a Stormtrooper.”\n“Nonsense, of course. Sedition.”\n“Dangerous sedition.”\n“He was a traitor.”\n“A monster. I’m escorting some cadets to their training planet. They would listen to such a rumour.\"\n\"They would listen readily.\"\n\"We much protect them at all costs.\"\n \n--\n \nThey change the training routes. They have to. Five carriers full of soon-to-be Stormtroopers vanish in five standard months and that’s a thousand altogether, a thousand children who will never march beneath the red and black banners of the Order.\n \n--\n \n“FN-2187 wasn’t a Stormtrooper,” says Blue to Green. She’s named for the colour of her eyes; he for the strange ridge of scales he’s got on his spine.\n“Nope,” Green says to Blue. “Not at all. Filthy rumour that. My troop don’t know it.”\n“Will they?”\n“I don’t know. I don’t think so.”\n \n--\n \nGreen says to Tenner, his commander, “There’s this awful rumour going round.”\nTenner says to Green, “I’ve heard it. Where did you hear it from?”\nGreen says to Tenner, “If I tell you, it needs to be on the condition that they’re purged.”\nTenner says to Green, “Sure as the sun, they’ll die.”\n \n--\n \n\"This is what we get for recruiting non-humans,\" says Commander Tarr. He's an avid humanist, and Hux hates him. \nHux hates most people. \n\"Don't be an idiot,\" says Phasma. Hux doesn't hate Phasma. She's calm, despite everything, and her face is all hard lines. \"If we purge non-humans then we lose half our battle force. The defection of Blue and Green was nothing to do with their ancestry and everything to do with an unforgivable lapse in their programming. We need to investigate higher command.\"\n\"Don't be absurd. We can't investigate them; if we do then Ren will be up my arse. He's already looking for an excuse to cost me my command.\"\nPhasma's eyebrows scoot up. A red flush rides onto Hux's cheekbones. He's said too much -- fuck. \nThings are slipping between his fingers. Stormtroopers are leaving, and that's not meant to happen. \nThey're not meant to think for themselves. \n\"Right,\" he says. Fingers splay into his hair. \"We'll purge non-humans from higher command. Blame them for the spread of dissent.\"\nThe art of compromise: no one is left happy.\n \n \n--\n \nWords have power. Words travel where nothing else can, hunting along the edges of space, bleeding into ships and minds and dorms, things that the Order thought it could shutter down. Hux does not speak of Finn anymore, and neither does anyone in power, but they do not need to --\n“Did you hear --”\n“Yes. Awful rumour.”\n“Where did you hear it from?”\nAnd when a code is a code dreamed by one lone genius it can be cracked, but when a code grows organic from the hearts and minds of a people who have always been kept pressed down beneath high boots and white armour -- well, it is harder to trace.\nStormtroopers are raised with a limited number of words. They are raised to speak a certain language, and they  still  speak that language --\nPurged: to be cut from the First Order.\nKilled: to cease to be a Stormtrooper.\nHero: to obey orders.\n-- and yet.\n \n--\n \nThis is how the Resistance discovers that they have sparked a revolution: five carrier ships with an escort of a thousand TIE fighters materialise in Resistance air space. \nFinn's woken by the wail of alarms. He leaps out of Poe's arms, dresses in a fumble, and races to the landing pad. \n\"Fuck, fuck, fuck,\" Poe pants. His eyes are wild and wide. TIE fighters in the sky, brighter than stars. Five carrier ships. That's five thousand, two hundred and twenty Stormtroopers. It's an invasion. \n\"Mobilise!\" Organa's voice rings out across base. \"Get to the X-Wings! Dameron, take black squadron --\"\nOrders barked out. The Resistance is nothing but organised. Every man and woman there knows their place. \nExcept Finn. \nThere's something wrong. \nHe stands there, in the centre of the storm, and he looks up, at the huge bloated moon of D'Qar and the TIE fighters like lost stars and the carrier ships, and his boyfriend is tugging his hand, trying to get his attention and --\n\"They would have killed us already,\" says the boy who had been a Stormtrooper. \"If they wanted to kill us, they wouldn't be waiting. Why are they waiting?\"\n \n--\n \nThe answer comes in the form of a broadcast, delivered in response to General Organa's demand that they identify themselves. \n\"Was FN-2187 a Stormtrooper? I heard he was. Is he?\"\nIt's a woman's voice, trembling and very young. \nFinn pulls the transmitter to his mouth. His lips brush it as he speaks. \"Yes. I was. I was, and I'm not anymore. My name is Finn. What's yours?\"\nThe rush of static is a sigh of relief. \"They call me Fiver.\"\n\"Hello Fiver,\" says Leia Organa. \"Why don't you let me direct you to a more appropriate landing space?\"\n \n--\n \nThe Resistance changes over night. \nA process is put in place, which is a fancy way of saying that the Stormtroopers -- all four thousand of them -- have to line up to have their minds read by Luke Skywalker to make sure they're not First Order spies. \nThat takes five days. By the end Luke is pale and shaking, ready to drop, but there's hope in his eyes for the first time in thirty years.\n\"Not one of them harbours any desire to harm us,\" he says. \"They want to see the Order fall.\"\nFiver, who is leader by virtue of age and confidence, finds herself compelled to speak. \"More than that. We want Stormtroopers freed. No offence General, but I don't want to storm the Order if it means my kind are going to be cut down indiscriminately. There are so many of us, and so many of us --\"\n\"Who want to be free,\" cuts in Finn. \nThe look Fiver gives him can only be described as worship. The frills around her eyes flush a deeper blue. \"Yes,\" she says. \"Precisely. We are at your disposal, FN -- Finn, that is. Finn. Sir. Finn.\" She coughs. \nShe's looking at him like he's the sun -- that is, she's looking at him like he's too bright to bear, like she can't tear herself away. \n\"We only ask that, uh.\" She stammers a little, unused to making demands of those she believes outrank her. \"We only ask that the cadets be spared active combat. The eldest is but five rotations and they are not ready -- give them ten years and they will fight for you --\"\n\"Ten? They can have twenty. Thirty. They need never fight, if they do not wish to,\" says General Organa. \nFiver's mouth hangs slack. She tries several times to speak, and fails, and then she bursts into tears, pressing her face into her hands. \nFinn pulls her against him. She shudders all over at the contact, cringing away and pushing closer at the same time. \n\"It's okay,\" he says, patting the sharp jut of her shoulderblades. \"It's all a little much, isn't it?\"\n\"You're FN-2187,\" she says, like a prayer. \"You were a Stormtrooper.\"\n \n--\n \nThe first mission that Finn goes on is one of rescue. \nIt's fitting. Before he leaves, Poe kisses him long and sweet deep and tells him the story of his first meeting, a story of subterfuge and spying, hunting for information. \"You're the patron saint of revolution,\" he says, staring at Finn with such love that Finn shivers. \"You go and set them free, d'you hear me? You go look after them.\"\n \n--\n \nI'Tara is a training world, densely populated. The youngest troopers are stationed at the pole. They are kept warm by artificial atmosphere, and cordoned off, and Finn aches to rip away every soul on the planet but it is at the pole that their contact works. \n\"How do you know you can trust her?\" he asks of Fiver. \nShe turns her wide, blue-ringed eyes on him. \"I asked her if she had heard you were a Stormtrooper. She said she had; and that she believed it.\"\nThere's utter conviction in her voice. The way she looks at him is akin to how Rey looks at Luke, or Poe at General Organa. \nIt makes him uncomfortable, to be the subject of such devotion. \nHe's tried to explain to them that he's not special, that he's no hero, that he tripped and landed in adventure -- but they won't believe him, they do not listen, and in the end Poe had taken him aside and told him to stop being so Force-damned modest. They love you because you're very loveable. And besides, he had added, every revolution needs a figurehead. \n\nI don't want to be a figurehead!\n\n\nWrong word. How about patron saint?\n\nThat's worse but Poe had kissed him, and Finn can forgive Poe anything if it's followed by a kiss. \nIt's a devilish power that Poe is all too glad to exploit. \n\"Here,\" says Fiver. \"Here we land.\" \n \n --\n \nFive thousand gone from I'Tara, basically overnight. Five thousand cadets. Ten thousand are killed as one of the major barracks ignites in revolt. Two thousand arrested.\nDrops of water in an ocean, Phasma wants to say, but they both know that she doesn't believe it.  \n“Kill them!” Hux shouts, a high and desperate whine in his voice. “Give the order -- blow up the planet!”\n“There are still two million cadets there, sir,” says Phasma. Her voice is level. Her hands are steady on her weapon. Her heartbeat is slow and sure. “Two million cadets and five hundred thousand two hundred --”\n“I don’t care! If one rebels, they all will. We’ll  fall  ,” and he jabs one leather-clad finger against her breastplate. “Give the order -- that is an  order .” And the jumble of words, and the wetness of his lips, and the wildness of his eyes. His hair, sweat-drenched, is bright as blood.\n“Five hundred thousand and twenty one soldiers,” says Phasma. “Sir. Loyal soldiers, sir.”\n“But they’re not loyal, they can’t be loyal, traitors come from their ranks and so they’re infected as well!”\nWildness in his eyes and sweat in his hair and her blaster is heavy and familiar in her hands.\n“Kill them! If you don't, I'll get rid of you and find someone who will!”\n“Yes sir,” says Phasma.\n“Of course sir,” says Phasma.\n“I only ever think of my troops,” says Phasma, and shoots him in the head.\n \n--\n \nPhasma's hands shake. She drops her blaster on the floor, pulls her helmet off and tosses it aside. Her breathing is, as ever, slow and deep and calm. \nThere is absolute silence. Hux's body smolders. The reek of charred flesh and cooked blood fills the air. \nExamples are what you make of them. \nPhasma does not remember her parents. She does not remember a time before the First Order. The first hand she was offered smacked her down and pressed a gun into her chubby starfish hands and she has never, never known any other way. \n\"FN-2187,\" she says, aloud. Her right hand is starting to spasm. She sips in oxygen and her heart judders against her ribs and she thinks how she would wear her helmet at First Order functions, hating how people stared at her face. She thinks how she did as she was told, always as she was told; how she thought she was a Stormtrooper and nothing else. \nThe silence is an ache. It seems to continue forever. \nThen there's a hiss. A click. A Stormtrooper removing his helmet. He's young. He wets his lips before speaking. \"Have you heard?\" he says. \"FN-2187...he was a Stormtrooper.\"\nThere is always a choice, Phasma thinks. \"Yes,\" she says, \"yes he was.\"\n \n--\n \nGeneral Organa almost has a heart attack. Poe draws his blaster, tries to put himself between the former Captain and Finn. \nFinn, however, can never be held back. He steps forwards, offers his hand. Phasma hesitates a moment, then clasps it. \n\"I used to be a Stormtrooper,\" she says. \n\"Yeah,\" grins Finn, bright and wild as the sun. \"Me too.\"\n \n \n \n\n Here’s a fact: you’re all going to die. All of you. It’s one of the only things we can be absolutely clear on. \n\n\n Here’s another fact: there’s always a choice. Always. You’ve been told that there isn’t, and I can’t blame you for believing that, but I’m telling you here and now that there’s always an alternative. \n\n\n Fact: yes, death counts as an alternative. \n\n\n Another fact: you are born, you die. The bit in the middle is yours. It’s the only bit you get. Do with it as you will and don’t ever forget the second fact -- \n\n\n I just said that -- \n\n\n Fine, here it is again: there’s always a choice. \n\n\n The last fact: FN-2187 was a Stormtrooper. \n\n \n\n -- \n\n \nCato Twelve, a planet with no strategic value, makes Hoth look like a pleasure spa from the Old Republic.\nThe horizon is bitten up by mountains straining for the sky, the ground is iron-cold and the snow falls in greyish clots, coloured by the heavy volcanic activity to the south of the planet.\nIt’s the perfect place to make the transaction.\n“Forty three defectors, ma’am,” says Phasma.\n“Excellent work,” says General Organa.\nIn a snowfield, there are two transports. Both are collections of rust and metal that look about five seconds from tumbling apart; the sort of things that smugglers who aren’t too good at smuggling use.\n“It was not my work,” says Phasma. She is wearing a heavy grey coat, hood pulled tight around her face, night-goggles obscuring any clue to her identity. “They escaped of their own accord and found their way to me.”\nGeneral Organa is similarly attired: not one scrap of flesh exposed to the elements. The wind is sharp enough to flay away skin in seconds.\n“Disembark!” Phasma calls, over the howl of the sky.\nA shuffling, shivering collection of one-time troopers totter down the ramp. They are bundled up in furs and fleece, in smuggler-garb and stolen First Order trench-coats.\n“Come aboard,” says General Organa. You can’t see her face, but there’s a strange note in her voice that Phasma still puzzles over. Phasma considers herself an excellent judge of character, and it irks her that much of General Organa remains inscrutable.\n(A fact Phasma doesn’t know: that note is compassion.)\nOne of the troopers lags behind. She’s younger than the rest, thinner, and even in her layers and layers of fur she shivers. She has nothing to cover her face, and in half a heartbeat her white skin is red and raw.\nOnce she was FG-4235, slated for termination; there’s no point in a Stormtrooper who will not eat and who vomits up what she does.\nThey call her Little One.\nPhasma shrugs off her coat. It is bantha-fur, heavy and rank, and without so much as looking at the trooper she drops it over her shoulders. Little One  oofs  at the weight, and peers up with frozen lashes and bleeding mouth.\n“Hurry up,” snaps Phasma. “You’ll get frostbite.”\nLittle One scurries to catch up, bundling the coat around her as she does so.\nGeneral Organa’s face and tone is, as ever, alien to Phasma. “Good work Captain,” she says.\n“I’m no Captain,” says Phasma, “not anymore,” but there’s a kernel of something inside her, something warm and bright, and it disconcerts her because she has never felt its like before.\n \n--\n \n“Can I get a new name?” says Little One.\n“Of course,” says Jena, once almost decommissioned for ‘Unseemly Care Towards Inferior Species’ and now acknowledged leader of the makeshift unit.\n“Can you call me Phasma?” says the trooper, the huddle of bones in a swamp of a coat.\n \n--\n \n“We didn’t have a  choice  ,” says a commissioned officer. “You understand -- you  must do -- if I hadn’t ordered the execution of the squad then I would have died as well, and I have a family --”\nHis voice is a high, irritating whine. Phasma shoves the barrel of her blaster against his temple, pulls the trigger.\nCharred flesh and cooling blood.\nShe looks up. Behind him, huddled and awaiting execution, is the FC unit, all five hundred and twelve of them.\n“There’s always a choice,” she says. Her voice is trained to carry across battlefields and the screams of dying men. It reaches every corner of the vast jail quarters effortlessly. “Do you understand that?”\n“You’re Phasma,” says one of the troopers at the front. He’s older than the rest, with a scar that forces his mouth into a permanent sneer. “You shot my captain for trying to desert.”\n“Yes. I did. FC-8758, known to everyone as Heartsore because she could recite the entire script of that cursed holofilm. Shot in the head, five years ago, on the planet R’Thar. She tried to leave to be with a local she had met and fell in love with.” She smiles at his stunned, slack expression. “I do not forget. We cannot forget. We were Stormtroopers, and our memories are the only thing we can trust.”\n“She was a good woman.”\n“I do not deny that. Here,” and she offers him the blaster, safety off, handle first. “Take your vengeance.”\nHe blinks. He stares.\n“There’s a choice,” Phasma says, “a choice, always a choice. Now take your vengeance, or come with me.”\nA choice, a choice, always and forever a choice, and the trooper shakes his head. “She called me Scarmouth,” he says, instead, “and I always hated it but --”\n“Welcome to the other side,” grins Phasma, “Scarmouth.”\n \n--\n \nA fact: Phasma does not ever say  I’m with the Resistance  because she’s not, she knows she’s not. She knows that there is not a place for her on D’Qar; she knows that those who fly the X-Wings are those she used to gun down; she knows that she is a horror story (and she is a little proud of this fact.)\nA fact: she said  I only ever care for my soldiers. \nSomething General Organa has noticed: Phasma says  soldiers  in the same way that she says  pilots  , in the same way Luke once said  students  and now says  Rey .\n \n--\n \nOne day, after another batch of deserters have been sent on their way, General Organa says, “Would you like a drink?”\nThey’re on Ohsana, a smuggler’s moon, land of scoundrels and battered ships and lost souls and there is no better place to find cut-price vodka, the sort that could be used to strip paint. Phasma knocks back a glass like water. The General matches her, and does not wince at all.\nThey don’t speak. They drink. After they’ve finished a bottle between them, General Organa stands -- a little unsteadily -- and says, “You know, they speak highly of you.”\n“Who does?” says Phasma, who is used to drinking far more, and far worse, and still finds herself warm and shuddery.\n“Your soldiers. Do you know what they call you? Cap’n of the Void. Wayfarer. Rescuer.”\n“I am only doing my duty. I am doing what is right by my soldiers.”\n“They’ve started naming themselves after you.”\nPhasma’s brow furrows. “I do not understand. Why do they do this? Do you not provide a sufficient array of new titles to choose from? Would you like me to --”\n“Oh  hush , Phasma. I’ll see you next time.”\n“You do not need to come in person. Surely the Resistance has better uses for its General than to see her sent to shitbucket worlds to accept a batch of deserters.”\n“I don’t need,” says General Organa, “and yet I do. That’s what being a leader is about.”\nShe touches her palm to Phasma’s cheek; she has to stand on tip-toe to do so.\nThen she is gone. Phasma has no time to contemplate what this means, what all of this means, for she has heard word that a half-dozen troopers have somehow found themselves aboard a slavers ship; and her duty calls.\n \n--\n  \n“I don’t want to be part of the Resistance,” says Vee-Vah and that’s how it starts. She’s named after the noise the Med-droid who treated her made. She lost her arm in her escape, and she’s sick of the sight of blood. “I don’t want to stay on D’Qar. I want to settle down. I want a family.”\nShe’s the first. She’s not the last, and soon the Resistance camp is buzzing.\n“I mean,” Sunlight says to Fiver, “we’re not obligated to them, are we? We don’t have to stay, otherwise we’re just conscripts.”\n“We’re not exactly  welcome ,” chimes in Clover.\n“Cowards,” says Shot-at-Dawn to Two Sevens. “All of them, bloody stinking  cowards  . How dare they not fight? Don’t they understand what the First Order  does? ”\n(Stormtroopers do not understand that some words are names and some are not. They understand that people name children after things and people they like, or are proud of, and Shot-At-Dawn takes a grim pleasure in contemplating what the First Order would do to him if he was ever recaptured.)\n(Two Sevens will not tolerate any other name but that given to him by a fire-eyed baby fanatic who did his duty and followed orders and still died and was thrown out of the airlock because no trooper is buried.)\n(Every member of the Resistance has a funeral. This is the reason that Two Sevens stayed.)\n“The children shouldn’t be here,” says Sunlight to Big Seven. “We said they don’t have to fight, and they’re growing up surrounded by battle.”\n“What if the planet’s attacked?” says Big Seven to Fiver.\nAnd then, one day in the canteen: “What if, what if,” snaps Fiver, the scales around her eyes flushing royal-blue in her anger. “We owe the Resistance  everything .”\n“No we don’t,” Two Sevens says. “We owe FN-2187. I’m loyal to him.”\nTwo Sevens is not well-liked. He’s never shed his thorny, military demeanour; but when he speaks people tend to listen.\nClover  is  well-liked. When she speaks, people listen as well.\n \n--\n \nThe voices build to a crescendo and finally a compromise is reached: Ithaka.\n(The definition of compromise: nobody is happy.)\nIthaka is a land of mists and swamps and iron-seas, an Outer Rim planet that no one’s ever heard of.\nThose Stormtroopers that want to be free from the conflict head there in ships and droves. Big Seven takes a clutch of cadets. Clover takes her new husband. She’s already swelling with child.\n When you leave, take with you all you love .\nIt’s a lesson they learned in front of the holoscreens of the First Order.\n“I don’t like this,” Rey says.\n“They must have a choice,” Luke says. “Everyone must always have  a choice.”\n“Master,” says the second-to-last of the Jedi, craning her neck back, watching the vapour trails flutter into shreds in the blue, blue sky. “There  always is a choice, I know that. It’s just…”\nShe feels the Force. She feels it around her and in her, and she feels it ebb and flow and sing, and she feels the tentative hope of those troopers leaving, and she feels the pain of those left behind. She thinks that when Stormtroopers desert they almost always do so in units, in groups, in families.\nWhat it is to have people who love you.\nLuke takes her hand. She feels his pulse echo down his arm and into her, steady and grounding.\n“We make our choices, and we live with the consequences,” he says.\n \n--\n \n“I don’t like this,” says Poe. The Resistance is his home and his family and his everything. Leaving it is aborrence.\n“I can understand it,” says Finn. Finn, who dreams of open skies and children named after Poe,. Finn, the patron saint of revolution, who tripped and fell into glory. “I mean -- they want a normal life.”\n“No such thing,” Poe says with a huff, drawing Finn down next to him. He plants a kiss above Finn’s left eye.\n“If you could,” says Finn, “would you? Go and have a family, get away from this?”\n“I’ve got a family,” says Poe. “All noisy cousins and too many kids running around in the roots of the life tree. My home’s never quiet -- it’s exhausting. Nah, I prefer open space and an X-Wing and you,” and he kisses Finn again, a question shaped by the push of his tongue and slur of his hands against Finn’s naked chest.\nFinn pulls away. There’s something sharp in his eyes. “That doesn’t sound bad,” he says. “Not bad at all -- kids and family and…” his voice trails off. He shuffles up against Poe. “Besides. What’s a cousin?”\n \n--\n \n“We need to turn them against him,” says the newly appointed General Tarr. If they hate FN-2187 then they hate the Resistance, then they will not betray the First Order; they will stay where they are meant. Hux was always too gentle with the troopers. He was a cold fish. Too fond of non-humans. I have already ordered the purging of any with non-sapien ancestory,” he says, like Ren agrees or cares. All are alike in the Dark Side. All have souls that flicker greasy-silver on the flank of dark. All are nothingness, atoms to be broken up, dust in the wake of those greater.\n“I have a plan which I am sure the Supreme Leader will agree with,” says General Tarr, with an oilslick smile.\nOnce, there was a boy named Ben Solo and he sat on his father’s knee one warm summer night, and fireflies danced glowing patterns into the blue of the sky. The father told the boy a story about a nerfherder -- a scruffy one! -- who was sick of the terranterrors preying upon his flocks so he set fire to the forest where they lived. All day and all night the fire burned, and in the morning the terranterrors were dead or fled. “Your job is done,” he said to the fire. “You can go now.” And the fire had said: “I like it here; I think I will stay.” And it burned him right up, nerfherder and nerfs and all.\nBen Solo’s mother had said, is this really a story for children? but Ben hadn’t listened. He was too intent on the fireflies. He held up a hand, focused, and their flight changed, forming the wobbly letters of his name --\nRen’s teeth clack together. The end of his tongue is severed in a spurt of blood.\nBen Solo is dead and gone, fireflies and father and all.\n“I will confer with him,” says Kylo Ren.\n \n--\n \nIthaka burns.\n \n \n--\nIthaka burns, and it is not the bright red flare of Starkiller, planets fracturing into hot dripping lava, people turned to dust in a heartbeat, breath caught and never drawn again. It is slow. It is fire. It is weapons lined up from space firing down, beams of heat, tectonic plates cracking asunder, heartbeat of the planet exposed raw and red and glowing, it is a sky the colour of blood and corrosive rain that strips flesh to bone. It is screaming agony to the sky, it is every Force user in the galaxy waking sweating and weeping. It is a planet of refugees boiling alive, it is hellfire, it is slaughter, senseless and mindless slaughter.\nIt is the Resistance, they say.\n \n--\n \n“It was a foul and cowardly attack,” says General Tarr. His voice rings to every corner that the Order occupies, and beyond. “The Resistance pretended to give the Stormtroopers a choice -- fight for them, or settle on a planet in the Outer Rim. They promised that those who did not fight for them would be spared. They lied. This morning, fifty ships stolen from our armoury were sighted in the Outer Rim; they had been taken by the deserters, and now they were turned upon their comrades. They destroyed the planet and any life on it. The deserters upon Ithaka did not die easily. They burned alive. This is a clear message from the Resistance, intended to warn any who refuse to join their ranks.”\n“They were Stormtroopers,” says General Tarr. His eyes are cold. His hands clasped at the base of his spine. His face is red and flushed, with passion or rage. “And they were murdered.”\n \n--\n \n“Evidence,” says Tarr to Ren, after the broadcast. “That’s what Hux lacked. He had this notion that people listen to words alone, that troopers were mindless -- they’re not. I wish they were, but they’re not. We give them evidence, and they respond.”\nRen is silent. He is thinking of the flare of Starkiller over Hux’s face, the fury. He is thinking of Hux’s thorny dignity and sharp pride and brilliant, brilliant mind.\nTarr is not as clever as he thinks he is.\n“Those ships were very well guarded. I wonder how they got into the hands of lowly troopers?”\n“I don’t know what you mean,” says Tarr, clipped and curt and if Ren wanted he could scoop out his thoughts, leave him a gibbering senseless wreck. The thought makes him smile beneath his mask. “The Resistance did this.”\n“Very well,” says Ren. Last night, he had dreamed of fire. He had bitten through his lip to keep himself from crying out.\n \n--\n \nRey stumbles into Finn and Poe’s quarters, red-eyed and shaking. “They -- they -- they’re dead -- they’re screaming -- oh Force, I hear them --” and her hands, her soft clever hands, reach for her hair and yank like she can rip the voices from her head. Finn  snaps awake, reaches for her; she collapses against him, so very small, sharp scavenger edges. “They’re dead, they’re all dead,” she whispers into the curve of his neck, curling inwards like she can somehow escape whatever is grasping at her if only she makes herself small enough.\nPoe knows better than to say it was just a dream. He flicks the light on, and Rey cringes further against Finn.\n“What happened?” he says.\nRey coughs and coughs and manages, “Ithaka. Ithaka, it’s burning.”\nLand of swamp and mist, land of iron seas and birds with five wings. Unknown to the First Order, unknown to anyone --\nOnly not anymore.\n“It burned,” says Rey, again. Tenses jumbled up. Did it happen or didn’t it? Is it happening, or has it happened, and it doesn’t matter which for she can’t stop it and she can’t save them and judging by the look on her face she does not realise that she’s said all this aloud.\nFinn cups her tear-struck face in his hands, smooths his thumbs over her cheeks and kisses her above the left eye, then above the right, and she sounds like she’s choking on blood, like she’s been shot in the stomach, and he kisses her soft wet mouth and tastes copper where she’s bitten through her lip.\nPoe huffs and Finn thinks oh shit I’m not meant to kiss her -- but then there’s a rustle of fabric, of sheets sliding free, and Poe is tugging them both down, arranging Rey between them. She turns, huddles up against Finn, her shoulderblades jabbing against his chest, her arms reaching for Poe. He clutches at her, presses himself to her, anchoring her. “You’re here with us,” he says. “You’re here. You’re here.”\n \n--\n \nWord spreads quickly on the Resistance base, where mess halls are full of chatter and newly released Troopers, and within three hours everyone knows: Ithaka burned. Ithaka burned .\nTwo Sevens punches a wall. He doesn’t know why. He’s never been one for tantrums, and he’s never had a temper, but all the pain floods him and overspills and he punches a wall and all that happens is he splits open his knuckles and bleeds red as the skies over Ithaka, and a hard broken sound forces through his throat.\n“They were meant to be safe,” he says. His hand hurts. His throat hurts. His eyes are a dry burn and once upon a time he was loyal to the First Order, once upon a time he shot striking miners without question and now he is here, bleeding from the hand, thinking of how many children were on that planet, how many conscripts, how many lives.\n \n--\n \nThey were meant to be safe, says Two Sevens to Shot-At-Dawn.\nThey were meant to be safe, says Shot-At-Dawn to Charred and Chancer and Choice. They were meant to be safe, they said they would be safe, those who did not want to fight, says Chancer to Choice, and Chancer was the only one from her unit to choose to come to the Resistance and now everyone she left behind is gone and she’s cursing herself for forgetting the rule that every defecting trooper learned from the holoscreened executions --\n\n When you leave, take with you all you love. \n\nAnd Charred says to Choice, and Choice says  to her unit -- fifty strong -- and one, a young man named Lighthands, says how did they find it? We were told Ithaka was safe, we were told that no one outside the Resistance knew where it was and they found us still, they found us.\n \n--\n \nThe question: who can we trust?\n \n--\n \nFinn doesn’t know how to give speeches, and yet it seems to be expected of him. He is, after all, the patron saint of revolution.\nThat title -- once spoken in affection -- sickens him now, weighs heavy on his shoulders. He is unworthy. He isn’t a soldier, he isn’t a leader, he isn’t like Poe or Organa or Rey. He’s just...just a Stormtrooper.\nHe started this. He couldn’t save them.\nHe stands before the assembled crowds, the Resistance and the defectors. More Stormtroopers than one might think. Not all had gone to Ithaka; many had wished to remain and fight, and Finn is suddenly glad of this -- though at the time, when thousands of curly-haired tots had asked him to teach them to shoot, he had been heartsick.\nAnger swells within him, a depthless and blinding rage. He opens his mouth. He will stir them up, he will pledge vengeance against the First Order, he will tell them that whoever gave the order will die, that whoever flew those ships will die, that he will not rest until Ithaka is  avenged  --\nThe words die on his tongue.\nHe looks at them again. Faces and faces and faces, nothing hidden, nothing concealed. Some are scarred, some are young, some human and some not, men and women and everything in between. At the front: General Organa, Luke Skywalker, Rey, Poe. Behind them: the blue-scaled Fiver, surrounded by a swamp of baby cadets (they're called littleones, and they hate it, and everyone calls them it regardless).\nThere had been children on Ithaka.\nMost are here. But there had been  children  there, and --\nHe finds himself looking at Rey and Poe, thinking of the taste of Rey’s blood on his lips, the warmth of her hand in his, the slump of Poe’s jacket on his shoulders, the way Poe curls around him at night, the way Rey looks at him, gentle and a little wistful, like she’s contemplating the horizon.\nFinn swallows thickly.\n“My name is Finn,” he says, unnecessarily. “I was a Stormtrooper. We all were. And so was...”\nAnd just like that, he knows what to say.\n“Red. Red II. Jumper. Dancer. Vee-Va. Silver. The Cold One. The Warm One. Singer. Storyteller. Big Seven. Sevener.”\nNames. The names of the fallen.\n“Sunlight. Lightdance.”\nRey stands. She climbs onto stage next to him and winds her fingers through his, turning to face the crowd.\n“Clover,” she says, “Finn the Second. Finn the Third.”\nPoe joins them, leaping up onto stage with the flourish of a pilot, taking Finn’s other hand. “Chewie,” he says. “Han,” because Stormtroopers did not always understand names, but they understood enough to know that people were named after heroes.\nThere’s a disturbance towards the side of the crowd. Someone’s pushing their way through. Finn doesn’t pause in his recitation -- he couldn’t, even if he wanted to -- but he recognises this one. Feral-mouthed, tall and lithe; Two Sevens, who doesn’t get on with anyone.\nTwo Sevens hesitates for a moment, poised at the front of the congregation. His hair is white blonde, a clumsy spill over his eyes, and he looks very very young.\nThen his jaw tightens, and he steps forward. “Medium Seven,” he says. His voice is low and rough and earnest. “Trilla. Pansy.”\nOrgana is next. “Pella. Stormer.”\nThen a woman’s voice from somewhere in the depths of the gathering, calling out: “Daisy! Hawthorn!”\nA man’s voice: “Shiner!”\nAnd then they are all talking at once, all reciting the names of those they knew and those they lost, and the noise builds and ebbs and flows, sometimes a susurration and sometimes a yell, waving lower and higher, thousands of voices gathering together, singing up towards the cold, distant stars.\n \n--\n \nAfterwards.\n“We need to find who did this,” says Rey.\n“I know where  to start,” says Poe.\nThe lining of Finn’s throat feels like it’s peeling loose in long red shreds. His tongue is gluey from speaking too long, and he forces himself to breathe in and out, in and out, names rattling in his skull.\n\n Red I. Red II. Blue.Sunburst. Starlight. Heart. Dotty. Leia. Organa. Organa II. Han-Solo. \n\nIt’s a long time before he can speak.\n \n--\n \nWithin three days, Captain Phasma has arrived. General Organa summons Finn, Rey, Poe and Luke to her quarters -- and they find Phasma kneeling.\n“I was the only one who knew the map to Ithaka,” she says, without preamble.\n“Did you do it?”\nRey and Finn stare at him. Poe shrugs. It’s a valid question.\n“I do not remember the three hours between eighteen-oh-hundred and twenty-one-hundred on the seventh day of the last lunar cycle,” she says. “Everything else is accounted for, save those three hours, and I can only assume that the Knight of Ren --” her voice catches. She shows her teeth. “I should have reported this at once. I should have turned myself in for cleansing -- but there was a training squad coming in and --”\n“He takes what he wants,” Rey cuts in. Her eyes are flinty and Poe looks at her, iron-hard feral desert child, the girl who takes wreckage and makes it anew, the girl who has a garden behind her bunker on D’Qar, who coaxes bright flowers from wet soil and, yes, this is a girl you fall in love with and never let go. She’s shining. She’s burning, burning up, and sometimes Poe feels like he’s changed to two comets, yanked through the firmament, planets spinning below, destiny a hard and relentless drumsong on his flesh and --\n“I want you to do it,” Phasma says to General Organa. “Please, all I ask is that you find a worthy replacement -- “\n“I’m not going to kill you,” says General Organa, flatly. “It wasn’t your fault. It was...it was Ren’s fault. He did this.” Something haunted and dark steals across her face. “There’s a choice, always a choice, and he  chose .”\n“We’re not doing enough,” Finn says suddenly, rudely. “We can’t just keep waiting for them to find their way to us; we need to  drag  them here. We need to get the word out.”\n“I agree,” says Phasma, and that’s something Finn never thought he would hear from her. “We need to encourage larger defections. This serves the dual purpose of weakening the First Order and strengthening our own forces -- what?” says Phasma, unnerved by the fact that everyone in the room is now looking at her.\n“You said  we ,” says General Organa.\n“Ah.” Phasma coughs. “Well -- yes. I would...that is. If you'll -- if you’ll have me -- because this -- this is --they were  innocent .”\n“Welcome to the Resistance, ‘ma,” says Poe, slapping his hand onto her shoulder. He has to stand on tiptoe to do so.\nShe glowers at him. “Never call me that again.”\n“Sure thing,” says Poe, with a grin that could swallow the sky.\n \n--\n \nLater that night. Poe’s room, Poe’s bed, but not just Poe; Rey’s there as well, slanting sharp against Finn’s right shoulder, her leg hitched up over his, the points of her toes nudging Poe’s calf. Poe. against Finn’s left side, his hand slung up over Finn’s chest so his fingers can toy with the ends of Rey’s hair.\n“Shall I tell you a story?” Poe ventures, after a while. “My mother used to tell me stories about the old legends before she went out for a mission. It used to calm me down.”\n“We don’t  have  a mission,” Rey says, sharp and bitter. “We don’t have a  plan  . We’ve...we’ve just got a planet full of hate and pain and sorrow and I can  feel  it and Master Skywalker’s no help at  all  --”\n“We used to recite Hux’s speeches before we went to sleep,” Finn interrupts. “I never listened to the words, just the voices -- it was nice hearing everyone speak aloud. You, uh. You didn’t hear it much. The speaking aloud that is. People didn’t want to speak to me. Troopers, that is. It’s funny. I can’t go outside without someone coming up to me -- they used to salute until I made them stop, and I think that someone started a rumour that I like flowers now they all give me random bits of plant.”\nRey huffs laughter. “That’s lovely,” she says. Then, “Go on Poe, tell us a story.”\nPoe sits up, shuffles back and plonks himself down in the middle, crushing Rey’s arm in the process. She yelps, hits him, and he tussles with her playfully, angling himself over her --  on top of her  -- and a warm burst of  something  blooms in Finn’s stomach.\nRey relents, peers up at Poe through the disarray of her fringe. He stamps a kiss to the uptilt of her nose and slumps down again.\n“Right,” he says, a little out of breath. Rey rubs her ankle against his knee. Finn, on impulse, reaches out and catches her foot, runs his thumb under her sole, and draws her leg up so together they cage Poe. “Once upon a time,” he says, “there was a beautiful princess called Leia…”\n \n--\n \nWhen he’s finished, Rey’s frowning.\n“That’s not how I heard the story,” she says. “You missed out the bit with Jabba the Hutt.”\n“Who's that?” says Poe.\n“Uh…” says Finn, because he’d been thinking that too -- Stormtroopers hear a  very different  version of that story.\nRey has no qualms about speaking her mind: “I heard that she smothered him with her breasts in the throes of congress. I mean,” she adds, at Poe’s horror-struck look, “I know it isn’t true, but that’s what I heard. Funny, isn’t it?”\n“I don’t think sex with a Hutt is  funny  --”\n“Not that! The fact that it’s a different story depending on who told it.”\n“Yeah,” says Finn. “I, um. I heard something different. About, uh. Boba Fett and Princess Leia and apparently she sold herself to him and got dumped for giving him syphilis and  I know that didn’t happen ,” for Poe looks perhaps five seconds from converting to the Dark Side, “but that’s what I heard.”\n“That’s what you heard,” says Poe. He sounds like he’s mulling the words over, tasting them.\n“What if,” Rey says, “what if everyone was told the same story? At the same time? What if it  couldn’t  be distorted? Luke says that he can feel the hatred of the troopers even here; they’re burning up with stories of Ithaka and the innocent who died there. But we know that the First Order did it and...what if we could tell them? All at the same time?”\n“That would be wonderful,” says Poe. “But unless you’re  really good at the Jedi Mind Trick I don’t see how -- “\nFinn bursts out laughing.\nThe other two stare at him like he’s finally cracked. Maybe he has.\nHe kisses Poe hard on the mouth. Then, for good measure, he kisses Rey.\n“I’ve got an idea!” he says, and bolts from the room.\nRey and Poe lie there, tangled up and speechless -- but only for a moment -- for they have spent the very best bits of their lives with Finn, and they have no intention of letting him escape for long.\n \n--\n \n“When I was a Stormtrooper,” says Finn. “My squad hated me. I mean, really hated me -- I didn’t fit in, I was too nice --  anyway  , they used to threaten me with transfer to the  Messenger . No one wants to go there; it’s the most boring place in the galaxy. It’s located in the centre of First Order airspace, It is dedicated entirely to sending out the daily broadcasts. It isn’t heavily protected. All it does is take in signals and send them out again -- not encrypted ones, no, nothing so important. Messenger deals entirely with the blunt, everyday sort of propaganda. The sort of propaganda that says FN-2187 was not a Stormtrooper and The Resistance burned Ithaka…”\n“It’s where they send the daily speeches out from,” says Phasma. “Every day, every single port and ship and planet in the Order gets the same message. Speeches, generally, but sometimes propaganda films.”\n“Exactly,” says Finn. “Every day, every place, the  same message .”\n“So you’re saying,” Rey says, “that if we could get there we could hijack the signal and broadcast whatever we want?”\n“Well. Yes. But you couldn’t just go in there -- it’s in the middle of the Order -- you’d have to be  insane  --”\n \n--\n \nLadies and gentlemen, presenting: Poe Dameron, certified madman.\n \n--\n \nOQ-2411 does not like Morning Moral Meetings. This is not because she dislikes the speeches -- she finds them comforting -- but because it is one of the few times that higher officers and Stormtroopers mix and it is when Captain Jael can see her.\nEven when she’s in her armour, caged and supposedly safe, Jael picks her out.\nFingers pressing into the joins of her armour. A sly, quick smile. A puff of hot breath into her mask, hands either side of her helmet, a slick of black-haired Captain smirking at her and OQ-2411 thinks of showers and surprise inspections and wants to die.\nShe’s a trooper. She’s nothing. She’s told no-one because everyone knows that Captain Jael has a habit of picking out pretty troopers and taking an interest until the trooper does something wrong, or says something wrong, and then they’re off on some mission to the back end of nowhere and they're never seen again.\nToday, Jael is fiddling with the holoscreen. It isn’t co-operating. Her slim white hands push at the cables, and she curses under her breath.\n“Charmer!” Jael calls and OQ-2411’s stomach curdles, sweat congealing under her armour.\nShe hates that name. Hates it.\n“C’mere. Help a girl out.”\nAnd OQ-2411 does, for she has no choice, and she’s taller than the Captain and can reach up to shove the wires back into place and Jael taps long red fingernails on her breastplate and says, soft and hungry, “Afterwards, you’ll report to my quarters,” as she’s done before, and OQ-2411 salutes.\n“Yes Ma’am.”\n \n--\n \nColonel Archer kicks the holoscreen. It flares into life. He doesn’t pay the speeches any attention, not anymore, because he’s thinking of Stormtroopers dying. It’s funny. He never really thought of them as people -- they weren’t people, they were tools, they were white masks and flat black eye-holes and sharp salutes and numbers -- but --\nThe children of Ithaka. General Tarr says it a lot. He’ll probably say it in today’s speech, red abhorrence flaring on his cheeks, coughing out words like bullets. Firing up the troops, he calls it. Saturate them with hate, point them at the enemy.\nTarr deals in hate.\n(When Archer was young, before he learned to kill without ever getting blood on his hands, his mother told him a story. It was about a Princess, who had a land plagued by rebels. The rebels stole her crops and ate her people up, and all she wanted was to get rid of them, so she set a fire. The fire climbed into the rebels houses and burned them all up, and in the morning the princess asked the fire to go.\nI will not, the fire had said, I like it here and it had burned the Princess up as well, land and crops and people and all.\nThere’s a lesson there, Archer thinks. Maybe.)\n(Or maybe it's just a story.)\n(Or maybe it's both.)\nAnyway. The children of Ithaka.\nThe funny thing: he’s never thought of Stormtroopers as children before.\n \n--\n \nIn mess halls. In hangars. On planets and in training facilities, in the morning and at night and in the middle of the day, all over the would-be Empire, all at the same time.\nGeneral Hux had arranged for them to be shown in the morning. General Tarr altered this. Regimentation, he had said, that’s the key. All at the same time -- everyone stops and hears him speak.\nHe likes that: the fact that everyone must inconvenience themselves to listen to him.\nIt demonstrates his power, he thinks.\nKylo Ren thinks General Tarr has much to learn about power.\n \n--\n \nOQ-2411.\nColonel Archer.\nTR-0001, who is the oldest Stormtrooper in her unit and knows that soon her joints will fail and she will be decommissioned and no Stormtrooper ever gets a grave.\nMarksman, named for the only notable thing he can do: kill things with accuracy.\nKits. KO-8763, who no one likes, Stunner who everyone does -- named because she is a little too fond of her electric prod -- and Captain Jael, and more. Millions. Billions.\nSome are loyal, some not, and all sit down to watch at the same time and what they hear is what was broadcast from the Messenger and that is --\n“Hi. Uh. My name was FN-2187, and I was a Stormtrooper.”\n \n--\n \nFinn doesn’t know how to make speeches. It’s an artform that makes very little sense to him. All he can do is all he’s ever done; he says who he is, and what he is, and he does not stop.\n“Ithaka burned. It burned down to the ground and it was full of refugees, children and noncombatants, and the First Order deployed their ships and pretended that it was the Resistance. You may not believe me. You don’t need to believe me. I just need to tell you the truth, and I need you to listen.”\n \n--\n \nAfterwards, in the control room of the  Messenger .\nPhasma says, “I don’t know why I had to speak,” and she sounds almost  petulant .\n“Because they need to understand that we don’t just kill people,” says Poe. And then, because he’s an arse, he adds, “Ma.”\nShe hits him.\n“Oh  Force  you broke my  kidney  --”\n“Shut up!” Rey flings a hand out towards the dashboard.\nThere’s a light beeping. On and off. On and off.\nIncoming signal.\n“Open up the comm-link,” says Rey, and with a flicker of fingers Finn obeys.\n \n--\n \n“Hi!” It’s a girl. She’s in the beetle-shell white of a trooper, helmet off, red smeared down her face. Her lip is split open but she’s grinning. “Are you the Resistance?”\n“Yes,” says Finn. “I’m -- “\n“I know who you are. You’re FN-2187, you were a Stormtrooper, you’re...you’re  wonderful.  I’m OQ-2411...I don’t have a name, not really, but I’ve just killed my superior officer and I really think we need to get out of here. What coordinates are safe?”\nFinn’s not fast enough. Rey elbows him aside, fingers rattling on the keys. “Here,” she says. “Can you steal a ship?”\n“We’ve got one,” says the girl. “What’s your name?”\n“Rey. Is everyone --”\n“Call me Rey. I’m Rey. I’m Rey and I just killed Captain Jael. Gotta go!”\n \n--\n \nShe goes, but in half a heartbeat another comms-link is open. This time it’s a red-haired trooper with a First Order officer under her arm. “I’m Osma. We’re coming,” she says, without preamble. “But we’re bringing this bastard with us.”\n“For trial?” asks Rey.\n“No! This is Colonel Brendol Archer. He’s a bastard but he’s  our  bastard. When the Captain tried to turn off the message he shot her! He’s...he’s one of the good ones.”\nColonel Brendol Archer does not look happy. His eyes are wide and fretful, his mouth a hard line, but he still manages to sketch a salute -- despite being in a practical headlock of what Finn presumes is soldierly affection. “I will submit to the firing squad,” he says, “all I ask is --”\n“Oh what is  with  you First Order idiots? You’ll get a trial if necessary. If your troopers are vouching for you then that’s good enough for me --”\nArcher squirms free. “So, um. You don’t kill officers on sight?”\n“Nope,” says Phasma. “Only the ones I don’t like --”\n“By which she means everyone gets a fair trial and no one is shot at dawn and no one is tortured and --  what are you doing --” for Archer is reaching for his comms.\n“What do you think? Spreading the word. Do you know how many of us fight to the death because we think that you’ll skin us alive and rape our corpse if we’re captured?”\n“Uh,” says Poe.\nOsma squeals in delight and ruffles Archer’s hair. It sticks up in black scuffs, and he glowers like a cat dunked in water.\n“You need a new name,” she says. And then, to Poe, “What’s yours, handsome?”\n“I’m Poe Dameron -- “\n“There you go! You’re Poe. Now hurry up.”\nThe screen flickers black, but the lights keep on coming: message after message after message.\n \n--\n \nOn the planet D’Qar, under a star-strewn sky, the not-quite-last Jedi takes his sister’s hand.\n“Can you hear it?” he says.\n“Yes,” she says.\n\n Ma. Osma. Poe. Rey. Fighter. Flighter. X Wing. Stormer. Hansolo. Jenna. Kyra. \n\nNames. Billions crying out their names to the void, new names to replace the old, a song without end.\nLeia squeezes Luke’s fingers, and together they listen.\n    \nJanus II is an industrial planet, the sky curdled yellow, three suns hidden behind bruised clouds. Its capital, Claudia II, is a city-vast factory, spires thrusting hungry and sharp into the belly of the atmosphere, millions bent-backed over weaponry and droid-parts and ships.\nOn the flank of one of the warehouses, someone has spraypainted: FN-2187 WAS A STORMTROOPER.\n“Who’s FN-2187?” says a worker, moth-pale and only tangentially humanoid. Their name is Janus Worker 23-45, Second Class.\n“Dunno,” replies their companion. He’s of a species that has been all but wiped out by the First Order, a genocide so thorough that he doesn’t even know what his people were named. People know him as Janus Worker, 98-35, Third Class.\nThey go into work. As ever, the day begins with a speech from High Command. It will be, as it always is, on the importance of productivity, on the great service they do for the First Order.\nExcept this time it isn’t.\nBy the end of the day, 23-45 and 98-35 have discovered the following things:\n \n--\n \nKIlling General Tarr is not victory. It is duty. It is a pleasant duty, but it is not victory, for killing the man does not unmake the mistake. Billions are in open revolt. Billions more are tied up trying to quash the revolt, but they cannot be trusted.\nNo one can.\nMaster Snoke tells him he must find time for himself, and so he spends three days with General Tarr, drawing out his death, asking him again and again --\n\n Did you not think? Did you not think? The children of Ithaka, the children of Ithaka -- did you not think that Stormtroopers are NOT CHILDREN NEVER CHILDREN and you have made them THINK THEY ARE PEOPLE -- \n\nAfterwards, Ren goes to meet Tarr’s  replacement. He does not bother to wash. He stinks of blood, and his bootprints are red.\nThe newly appointed General Asric is in her late forties, grey-haired and hawk-featured and proud.\nRen drops what is left of Tarr at her feet. Her aura -- a flat, iron grey -- flickers red-gold with fear, but quiets in moments, and her lips curl into a sneer.\n“I will do better than my predecessor Lord Ren,” she says. with a respectful tilt of the head.\nPerhaps Kylo Ren can get along better with this one.\n \n--\n \nCallimina Archer has seen more battles than she can name, and so when word gets to her that a gaggle of Stormtroopers are revolting she does not panic. This is no different to any other failed rebellion -- of which there have been plenty -- and so she pulls on her officer blacks and summons her daughters to her office. It’s the most secure room in the house.\n“Remember your brother,” she tells them, “remember your father: they died for the First Order. You do their memory proud.”\nShe sends out a comm for Captain Thresh, the head of their personal guard.\nHe does not answer. Another voice, one she doesn’t recognise, says, “Was he a Stormtrooper?”\n“I  beg  your pardon?”\n“FN-2187. Was he a Stormtrooper?”\n“No! He was rebel scum, as are you, and you are all going to die --”\n“Well,” says the trooper, “yes, we are. Everyone is born, and everyone dies, and what you do in the middle is down to you. Now, I know you’ve got kids, so I’m going to ask you again --  was FN-2187 a Stormtrooper? ”\n“No!”\n“Too bad,” says the trooper. The comms link goes dead.\n“Mother,” says her youngest, Cosetta, “Mother, what’s that smell?”\nSmoke starts to coil under the door. Callimina rushes across her office, her coat a black flare behind her, and types in the code to open it with shaking fingers.\nThe pad beeps once, and dies. The lights flicker off and the room is plunged into velvet blackness.\n“They’ve cut the power,” she whispers.\n“Mother I smell  burning ,” wails Cosetta. Her elder sister shushes her.\n“Mother, there’s backup supplies aren’t there?”\n“They should have kicked in by now. They must have taken out the entire grid. Don’t worry my darlings,” she says, “and do not cry -- we are of the First Order, and we never show weakness. This will blow over -- we are safe in here -- nothing can get through that door --”\nAn explosion sounds, hard and ragged, and Cosetta screams.\n“They’ve got to the armoury,” Callimina says. “They’ve got --”\nLight, sudden and blinding, and Callimina knows no more.\n \n--\n \n“Master Luke is calling me back,” says Rey. “I have to return to complete my training. Apparently.”\n“Well,  yeah ,” says Poe, because if she expects him to disagree she doesn’t know him at all. He cups her face in his palms. She brings her own hands up, curls them over his wrists. There is something about her fingers that makes him think of knives, and he kisses each one. “You’re our best shot against Snoke and Ren. If you think we’re going to let you get killed out here, you’re mad.”\n“I want to stay with you,” she says.\nFinn brushes her hair from her nape and plants a soft kiss where her jaw meets her throat. “I know. But you can’t. You’ve got to go. Get strong. Get strong enough to stop him.”\nRey kisses Poe, hard and fierce, teeth and tongue and  claim -- and she snaps around and does the same to Finn, biting his lower lip so hard she draws bright blood. Feral desert child she is, she laps it from her teeth and snarls. “I’ll kill him for you two. My boys. My beautiful boys.”\nFever-flare of a girl in his arms, lightning trapped into slender bones, thunder-white skin and a throat made for battle-hymns. Poe’s so in love he could die. He catches the bird-sharpness of her hips, pulls her into another kiss and Finn pulls her dress off her shoulders and, well, what transpires next is for their eyes only.\n \n--\n“I’m Break-The-Door-Down,” says the Stormtrooper. “Because,” he adds, in the laboured tones of one who has had to explain his name ten thousand times over and expects to continue to do so, “I was the one who got into the armoury on Thalia Five..”\n“I’m Bren,” says the Resistance fighter. He’s got unkempt black hair and sparking grey eyes and the sort of smile that suggests he knows precisely when the world is going to end. At the mention of  Thalia Five  his smile wavers, just a little. “We all get new names. We all start again. Bren was what my littlest sister called me, before she learned to pronounce my proper name.”\n“I never had sisters,” says Break-The-Door-Down.\n“I have four. Don’t know where they are now. Probably the Academy. All the girls from my family were sent off to fight. Anyway. Let’s get you settled in. I’m your Captain now. I’ll take care of you.”\n \n--\n \nRen snaps awake, his hand reaching for his lightsabre. He ignites it, and scarlet light dances off bedsheets and black walls and --\n Hux .\n“You’re dead.”\n“I see you are as quick-witted as ever. You’re dreaming.”\nIt is something of a departure from his normal dreams, which almost always feature fire and charred red skies.\n“I’m here to tell you a story,” says Hux.\n“If I am dreaming, then I do not have to listen. Good night, General.”\nRen flicks the lightsabre off and lies back down.\nTries to.\nHis bed is gone. He stands on white, shifting sands that stretch to a curving horizon, where purple sky meets the cool flank of the desert.\nGeneral Hux  tsks  in that way that always made Kylo Ren want to tear his tongue out through his teeth. “I’m here to tell you a story, and you will listen to me.”\nHe’s in his high boots and black greatcoat, the one that flares out at the back, like an echo.\n“Fine,” says Ren. He’s accustomed to stranger dreams, after all. “Where are we?”\n“My home planet.”\n“Your home planet is Thalia Five. It has no deserts.”\n“Once upon a time,” General Hux starts, ignoring Ren totally (much in the way he did when he was living), “there was a young prince. He had a name, but no one remembers it. He was just a prince. And in his kingdom there lived a great and terrible dragon --”\n“Dragons are not real.”\n“Shut  up . This dragon ate up his villagers. It ate up his wife. It was so big and fierce that nothing in the land could face it. In despair, the prince crept to where the dragon was known to sleep. He had in his possession a magical liquid that burned without end --”\n“--so speeder fuel?”\n“I will  gut you  . Shut  up . He set a fire and it ate up the dragon, scales and wings and all. And he said to the fire, go from this place I have no more need for you. And the fire said, I go where I please, and it ate up the prince, kingdom and castle and all. Do you understand?”\n“No. I’m sure I have heard this story before -- “\n“Yes. You have. Kylo.  Listen  , for Force’s sake I am begging you  listen to me --”  and it isn’t Hux, it isn’t Hux at all, it’s a young man with a scruff of long brown hair and strange, yellow eyes and there’s something really --  achingly -- familiar about him, only --\nThe desert is falling away. The sky is bleeding dripdripdrip sllide  --\n(ithaka burned and that was because of you --)\n“There’s a choice,” says the man who isn’t Hux, who is caught between Hux and someone else, face running like wax or paint or blood. “There’s always a choice. Kylo?  Ben --” \n \n--\n \nOn the side of the governor’s house on the rural planet of Blake-717, someone has spraypainted FN-2187 WAS A STORMTROOPER. In the streets, Stormtroopers run riot.\nIn the morning, GQ squad, who apparently stayed loyal, will scrub the paint off. They will round up the tatters of YH squadron and they will shoot them in the streets, the words of the First Order on their lips: treachery is a tumour and we will carve it out.\nJust before lunchtime, their captain meets with an unfortunate end. He is crushed beneath a ruined TIE fighter.\nJust  after  lunchtime, a new captain is appointed: GQ-9831, a promising young soldier with a sterling record.\nIn the afternoon, GQ squad will follow her onto a ship, ostensibly to carry on the good fight, for the training planet Ronan is igniting in a fire-fight between the barracks that have stayed loyal and those that have not.\nGQ squad never get to Ronan.  \n \n--\n \nThe latest deserters show up sleep-sore and bloody-handed.\n“Sir!” barks the captain, a woman who reminds Finn a little of Phasma, in that she’s over six foot and terrifying. “GQ squad, wishing to defect. We can fight for you --”\n“Or not. Down to you, really. What’s your name?”\nThe captain flusters. Her head quirks on one side and she says, “They know me as -- knew me as -- GQ-9831 but I never -- I never had a nickname, it was unprofessional it was -- “\nThe Stormtrooper at her left, a skinny boy of no more than nineteen, slaps his hand onto her shoulder. “You saved us,” he says, “so let’s call you Finn.”\nThere are a lot of Finns.\n \n--\n \nOf course, not everything is perfect. Integration is hard, and the lines may be fused by the crucible of warfare but there are cracks --\n“Fucking  bastard .”\n“Call me that again -- I dare you -- I  dare you --” \n“Stormtrooper, Empire-loving  bitch.” \nShannah Yzetta is a veteran of the wars against the Empire. He’s grey-haired and grizzled and wiry, wolfish strength and he is very, very drunk.\nTwo Sevens is younger and stronger and not drunk at all, and his eyes are filled with fire.\n“Shut up.”\n“Make me. I saw your type all the time. I’ve shot you all my life, spent all my life shooting people like you -- fuck it, you ain’t people. You’re numbers. You’re fuckin  nothing --”\nHe doesn’t get to finish that sentence.\nIt’s hard to speak when you’re choking on your own  teeth .\n \n--\n \n“Now, if we just restrain ourselves,” says Archer, all prim and proper, straight-spined and glowering. Two Sevens bristles behind him.\nShannah’s mouth is pulverised: it looks like a split-open fruit. His teeth are the seeds, hanging loose.\n“You could have killed him,” Archer continues.\n“And what in Force’s name were you thinking?” Pava says. She’s holding the pilot -- ostensibly to keep him back, but really to keep him on his feet, because it turns out that drunk veteran will always lose to angry young soldier. “They’re our allies. Two Sevens is a good man.”\n“Ain’t a man,” says Shannah. “Ain’t nothing.”\n“Kindly shut the fuck up,” says Archer.\n“Make me, First Order bitch. Didya take it up the arse from General Hux?”\n“No. I did go to school with him. You see, where I come from we attend school.”\n“Archer! Not helping!” for Shannah is starting to struggle anew, and Pava can’t blame him: in that moment Archer’s all First Order snobbery, imperial tilt to his chin.\n“An’ you come from somewhere where they kill children!”\n“Yes! I don’t know if you’ve heard the rumours -- but  so do you!” \n“Calm  down  ,” Jessika pleads, and Archer subsides. Two Sevens clamps a hand onto his shoulder in the universal gesture of  he’s not worth it bro. \nAnd then -- “Fuck you! And fuck FN-2187, the cunt who brought you here.”\n \n--\n \n“So he fell down the stairs to his bunk?”\n“Repeatedly,” says Jessika..\n“And landed on his face.”\n“Yup,” Archer says.\n“And testicles.”\n“That too,” chimes in Two Sevens.\nGeneral Organa raises one indomitable eyebrow. “I understand your need to defend your friend, but do try and avoid causing grievous harm to those you are meant to be fighting with.”\n“I am nothing but loyal to those on my side,” says Two Sevens.\n“One would hope you are loyal to the Resistance,” says General Organa.\n“Isn’t that what I said?” Two Sevens replies, with an insolence that reminds her of her husband. A bolt of sorrow strikes her spine.\n“Go! And stop making trouble.”\n \n--\n \n“Everything you are,” says Snoke, his hand gentle on Kylo’s hair, “is what I made you. You are a wonder. You are a weapon more powerful than any Starkiller. You are storm and silence and  power  and the pinnacle of the Dark Side.  My pinnacle,” he adds, and gestures for Kylo to stand.\nKylo does so. They are aboard  The Citadel, Snoke’s crowning glory: a ship of such intricate design that they say it drove its maker mad. It drifts through First Order airspace, undetectable, shielded so thoroughly that Resistance pilots have flown beneath it and not realised its presence.\n“Thank you Master.”\nOnce, Snoke towered above Kylo, as imposing as the sky. Now, they are of a height. Still: Ren feels like the smallest of children in the weight of his presence, the superior power of his Master pressing down on his own Force awareness, solid as durasteel clamps around his wrists and throat.\n“Tell me, child. What are the nature of your dreams?”\n“I dream of fire and of blood, of our galaxy burning. It is madness.”\n“It is. And tell me how we cease this madness.”\n“By ruling it. All things are mad, unless they are under your control.”\n“ Our  control.”\n“Ours,” says Ren. “Of course.”\n“You are troubled,” observes Snoke as he turns back to his throne. “You taste blood in your mouth -- “\n“No, I do not. I  want to  . The galaxy is in chaos, our Stormtroopers in open revolt, planets declaring themselves for the Resistance.  Entire planets  . That cursed broadcast --  FN-2187 is a Stormtrooper  ,” and Ren’s voice slants higher, aping Finn’s earnest, bright speech, “  and you can be too -- you can be free too!  It’s revolting -- and we permit it to continue! Let me go out Master, let me  kill them --”\nSnoke lifts his hand. At once the ever-present manacles tighten, and Kylo clatters to his hands and knees, gasping for breath. Hot, hideous fingers prise open his mind, catch his throat in a sickening clutch, and his world goes white with pain.\n“Don’t question me, child,” Snoke says, gently rebuking. He sits down. Kylo bites through his lower lip to keep himself from screaming. “All I do is for your own good. You know this.” With a wave of his hand he releases Ren: the man gasps in air, his teeth red in the half-light of the throne room.\n“Yes Master.”\n“You will swing the balance of the Force to the Dark Side. You will echo for ten thousand years. But you must do as I say -- and I say that the time is not ripe, and you are not ready to face Skywalker.”\n“Then let me kill FN-2187, or his friends,” says Kylo. Blood dribbles down his chin. “Let me kill them. Let me, at least, kill the scavenger girl.”\n“I do fear I have spoiled you. I admire the strength of your hunger, but you must practice a modicum of self control. “You will kill them. They will weep and beg for the mercy of death and you will not deliver it, and you will allow them to see the destruction of their beloved, and then you will grant them the mercy of the final blackness -- but  not yet  . And do not fear for the First Order. The Dark Side grows strong with hate and  oh how the galaxy fills with hate -- can you not taste it?”\n“When I wake,” says Ren, “I taste blood.”\nSnoke smiles. “Let me tell you something. Why are revolutions called revolutions?”\n“I do not know.”\n“Because they  always come round again . We will emerge from this revolution stronger than ever. Now, leave me. I would be alone.”\n \n--\n \nLeia and Luke and Phasma stand in General Organa’s bunker, in the centre of a camp that has swelled in size ten times over, and ten times again, since the broadcast from the  Messenger . There are similar encampments all over the skin of D’Qar, and other bases spot around the galaxy, hidden away and known only to a few. Almost overnight, the Resistance went from being a rag-tag group of pilots and madmen to an enterprise the size of the universe.\n“They are killing children,” Luke says. “I feel it. Last night, a group of troopers sealed the doors of an officer training academy and burned it down -- the youngest was fourteen.”\n“Of course they are killing children,” Phasma snaps. “Do you not know anything about the training of troopers? The youngest one I saw executed was four. Four. Troopers, especially ones that are only just defecting, have no notion of the rules of warfare you enjoy prattling about. They do not see a fourteen year old officer -- or would-be officer -- as a child; they see a threat; and they act to eliminate the threat.”\n“Still,” starts Luke, but Phasma isn’t finished --\n“The Jedi took children when they were barely off the teat. Do  not  preach to me Skywalker, especially about the well-being of my troopers. But rest assured, the practice will slow and halt in time. With Finn’s example, they will learn the rules of civilisation.”\nThe wonders of the modern world, Leia thinks. Captain Phasma telling her brother of the virtues of civilisation.\n“It is quieter without him,” says Leia.\n“I do not miss the cries of  FN-2187 was a Stormtrooper that heralded his emergence from his bunk,” says Phasma, “and I feared the start of a religion around him...but yes, I must concede that the boy’s absence is tangible.”\n“Do you mean that you miss him?”\nPhasma glowers. Leia beams, and pats the back of her hand.\n“It is necessary. He is a figurehead. He must be where he can do the greatest good. One benefit of his absence is that the pilot is with him,” continues Phasma, “for if he had called me  Ma  one more time then -- and I regret to say this, General -- I would have shot him.”\n“I fear for Rey,” Luke admits. “Her training is not yet complete, but she is deeply distracted. She misses her boys.”\n“She must stay here, you said so yourself. She’s too valuable to allow to run around willy-nilly.”\n“Yes. It’s just...I feel her pain.”\n“Students learn nothing from being coddled,” Phasma says. “You must know this. Students need regimen. They need attention. They need discipline and a task to perform, and -- why are you smiling?”\n“Just thinking,” says Leia, “that Poe has given you a rather apt nickname.”\n \n--\n \nFinn never stops moving. He is in a bar on Ohsana, standing on a chair before a crowd, electric thrum of violence kept at bay by virtue of his reputation and Poe’s easy smile. He’s onboard a ship that’s five seconds from meltdown, troopers training blasters on each other. He’s there when Jadqara surrenders wholesale, and he’s there when the industrial world Kygo Beta is incinerated by the First Order fleet. He’s there when a little girl shoots her captain. He’s there when a Mandalorian bounty hunter is shot by Poe, moments before he completes his mission.\nHe’s there -- but he’s also in dorms and barracks, on battlefields and in alleyways. His name is spraypainted on streets. His name is carved into bunks. His name is worn by rebellious First Order officers, badges tucked secret and sly into collars and sleeves. His name is on the lips of Alacia Brackenwater, who is shot for high treason when her mother catches her telling the story of  FN-2187 who was a Stormtrooper to her four year old cousin.\nIt frightens him: the responsibility. It weighs on his shoulders, heavy enough to snap him asunder, but he must bear it -- he  must -- for he is Finn who was FN-2187, who was a Stormtrooper.\n You’re my patron saint  , Poe croons to him at night, patching the words to some old Republic ballad.  You’re my patron saint of salt and stardust, my saint of revolution  -- and he draws out revolution into its damn near erotic, curled and crisp --  my song and my sky with no pollution -- \nNonsense words. But they’re words of love and that matters more than he could ever say.\n \n--\n \nLuke and Rey sit at the edge of camp, where shadows tangle in the light. Above, the sky is milky purple, D’Qar’s vast moon gliding ghost-pale on a froth of white cloud.\n“I’m  ready  Master,” she says. “I wake up every morning with blood in my mouth, and it belongs to those people I can’t protect. I hear them screaming. I hear them  singing  . Please let me go and join Finn and Poe, let me go and  fight .”\n“No. You aren’t ready. You are not capable of handling yourself in another confrontation with Ren -- and rest assured, the instant you start involving yourself in this war he will sense you and he  will come for you.“\n“With all due respect, Master, I have handled myself for long before you came along.”\n“I know. Everything you are is your choice. And if you were to leave...I cannot stop you. I would not stop you. I just fear for you.” Luke seems to age fifty years in a single breath. He rolls his eyes skywards. “I wish I could protect you from what awaits.”\nRey takes his hand. It took her a little while to get used to physical contact. She still remembers the snatch of panic in her chest when Finn grabbed her hand -- in Jakku, people who try and touch you almost always mean you harm. And yet in this new world in which she finds herself, people touch freely, and find comfort in it, and so she takes Luke’s hand and raises it to her mouth and kisses his knuckles.\nAs she does so, she feels the flutter of his Force awareness at the edge of her skull, gentle as a frill of summer wind. She nudges back against it, opening her mind up to him --\n-- and at once, all at once, she topples over, flooded from spine to sinew with a sense of guilt so profound she cannot speak. Her eyes spring open, wide and white and wild with panic and --\n“Rey!” Luke slaps her across the cheek. His face is a white smudge in the dark.\nWhy is it dark? It was evening, it was --\nShe’s on her back, staring up at the stars. Her mouth is full of blood -- she’s bitten into the tip of her tongue, almost clean through.\n“Here,” Luke says, and rips open a translucent Medi-Pad. “Open.”\nRey opens her mouth, and he tucks the dressing onto her skin, and in a blinking the wound has gone.\n“What happened?”\n“I am so sorry,” says Luke. “I’m so sorry.”\n“What  happened? ”\n“You entered my mind,” he says. “I only meant to offer you comfort, but you -- you went deeper --”\n“Then  I’m sorry. I didn’t mean --”\n“No matter. It did not bother me.” But his eyes, his eyes are wet. “What bothered me was that you were screaming, and I could not help --”\n“You’re a good man,” she says. “I know you think you’re not, but you are, and what Kylo -- what Ben -- did wasn’t your fault. It  wasn’t .”\n“I permitted Snoke into my Academy. I believed him when he spoke of balance in the Force. I -- “\n“If you had scraped the inside of his head out, he would still have hidden his intentions from you.”\n“I should not have trusted him!”\n“And Ben shouldn’t have stabbed Han and he did; and he shouldn’t have become Kylo Ren and he did; and he shouldn’t have let them burn Ithaka and he  did  . There’s a choice, Master, always a choice and what you have to remember -- what you  must  remember -- is that Kylo Ren  chose  . And so did I.  Everything I am  I made for myself. Same with him. Same with  you  .  Please  stop blaming yourself and  start  letting yourself do things.”\nShe hesitates. Runs her tongue over her lower lip, ponders the wisdom of saying what she now knows -- and then it occurs to her that he probably knows it anyway. The joys of Jedi mind powers. “I know why you don’t want to go out and fight. It’s not because of me. It’s because you’re worried that you’ll fuck up again. You’re worried you’ll get me killed. But you  won’t .”\nShe reaches for his hand, and presses her forehead to it. He reaches out with a tentative hand and strokes her hair.\n“Thank you,” he says, so quietly she can barely discern the words.\n \n--\n \nAsk Poe Dameron what victory looks like and he will say this: the Resistance, bright and shining, red-black banners burning up, stacks of TIE fighters forming the funeral pyre for the First Order, Snoke -- that shadowed, hallowed nightmare -- hauled into the sun and burning up at the touch; fire and phoenix and rising, rising, rising; song and dance and the heady thrum of  life  , singing from one end of the galaxy to the other. The song of the Resistance, incorrigible and unconquerable; Finn under his left arm, Rey under his right; warm press of their mouths against his -- and against his  other bits  -- and joy everlasting.\nAsk Luke Skywalker what victory looks like and he will say this: there is balance. Nothing is wholly good and nothing is wholly bad, but there is an equilibrium. He does not wake bathed in sweat, he has his sister at his side, and Rey as his bright-eyed padawan, and he can start to rebuild.\nAsk Phasma what victory looks like and she will say this: the campaign is concluded; the next battle will start in our favour.\n \n--\n \nHere’s an experiment.\nAsk Kylo Ren.\nHe wouldn’t be able to say.\n \n--\n \nThere are no Stormtroopers onboard  The Citadel  . There are only the Knights of Ren, and their Master, and  his  Master -- and the Master of the Knights of Ren is looking out at the vastness of space and thinking of a child’s story.\nSomeone, a very long time ago, told a weak, stupid boy a tale about a nerfherder, and his nerfs, and fire. Fire that ate everything up\n(nerfherder and nerfs and all)\nbecause of course it did, that’s what fire does.\nFire can’t be controlled or caged or  stopped .\nIt just  is .\nIt does as it wills. It does whatever it wills. This is the nature of the Dark Side as well.\nAt least, he thinks.\nHe thinks it is.\nHe does not know anymore.\n \n--\n \nRen walks past two of his brother Knights. They bow, one knee clacking to the floor, and on impulse he seizes one of them by the robes and hauls him into the air. He forces his way into the man’s skull, tastes his thoughts, thoughts of bloodshed and slaughter on distant planets, of women screaming and children breaking into wet bundles of blood and bone --\n“Lord,” says the other. “Lord, what are you  doing?” \n“It ate him all up,” Kylo says. He holds the Knight in his mind. It is so easy. “It ate him all up and said  yes I shall stay here you will not command me.” \nHe  clutches  and the Knight’s pain shudders to a halt. He hangs slack in the air.\nKylo drops him.\n“He was weak,” he says to the other Knight. “He sought out those who could not fight back, unworthy opponents, and he felt guilt for his actions. I will purge such weakness from my order.”\n \n--\n \nLessons are subjective. Examples are only what you want to make of them.\nYou cannot teach those who will not listen.\nDarth Vader’s redemption came from behind his helmet. He  chose . Luke did not foist the choice upon him. He couldn’t. No one can.\nThere is a choice. Always.\nAnd Kylo Ren thinks of a dead man, of a dead man who had once had a son, a man who had said --\n\nSnoke is using you for your power. When he is done with you, he will crush you.  \n\nDead man can be right. \nYou can learn from history. \n(there is always a choice)\n \n--\n \n“Have you heard?” says Kylo Ren. “Once upon a time there was a scared old man. He was sensible, and the universe was mad, and he wanted the universe to make sense so he didn’t have to be scared anymore. And the old man was very strong, but the universe was stronger, and so the old man found a little boy and set him on fire. And the boy burned up, and the boy burned up all the madness in the universe, and the old man was satisfied and said to the boy: you will go away now, you are not wanted.”\n“And the boy said, why am I not wanted? I have done all that you have asked of me”\n“And the man said, yes you have and now you will go away. i do not want you; you will go.”\n“And the boy said, I am fire, and I do as I please. And he burned the old man up, skin and bones and fear and all.”\nKylo Ren lifts Snoke’s head higher, trying to remember how tall his Master had been. The eyes are slack, the mouth hanging open. Brackish blood splatters onto the floor.\nThe Knights of Ren hold back. They have their lightsabres out, singing scarlet death, but none of them stirs forward.\nRen wiggles his hand. Snoke’s head lollops to and fro.\n“And the old man was burned up,” says Kylo. “Skin and bones and all.”\nWith this, he drops the lump of flesh, wiping his hand clean on his cloak, mounting the stairs to where Snoke had once sat.\n“There is always a choice,” says Kylo Ren.\nThe Emperor takes his throne.\n \n\nWhen Kylo Ren comes home, there is blood on his hands. “Mother,” he says, and his voice threatens to crack open. He hisses in a hard, sharp breath. “Mother -- I am sorry. I...I -- there is a choice, always a choice, and I chose wrong and I am \n\nso so sorry\n\n,” and his great shoulders shake, and he kneels to the woman he made a widow, to General Organa, and she catches his chin with her palms and presses her forehead to his. She feels the throb of his heart, as she once felt him stir in her womb. She feels his depthless, yawning guilt, vast enough to swallow all the stars in the sky. \n\n\n“Ben,” she whispers, “oh Ben, I forgive you, I do,” and behind her, wavering like the shadow of D’Qar’s moon come dawn, Han Solo smiles as his family reunite. \n\n\nIt’s hard, of course. Rey does not like him, and Finn shows his teeth, and Poe draws his gun. But with time, and with love, she knows that her family will learn to function again. \n\n\nHe killed Snoke, after all. He killed Snoke, and the song of the Light inside him is louder than ever, burning away the shadows and in time, in time --\n\n \n\n--\n\n \n\nThat’s not what happens. \n\n\nOf course it isn’t. \n\n \n\n--\n\n \n\nBut for one moment, just one moment, the barest breath of time -- nestled between one heartbeat and the next -- Leia believes that it could happen. \n\n\n“Han,” she says, “oh Han,” for the Force is strong with her, and it calls the news to her bones, “oh Han, he killed him, he killed Snoke,” and she remembers Ben at seven, in the Academy, a long-limbed man called Snoke watching him train, she remembers Ben at five, curled against her and crying from his dreams, she remembers kissing away the glitter of his tears, telling him that everything was going to be okay --\n\n\n-- and for one moment, just one moment, it is. Snoke is dead. She feels the universe heave a great sigh. She feels the Force lurch from side to side, like an ocean in flux, and she feels the absence of darkness, a hole that could be filled with light --\n\n\n-- only it isn’t. \n\n\n“Han, our Ben is \n\nhome\n\n,” she says, but even as her lips form the \n\nh\n\n of \n\nhome \n\nthe surge comes again, and it is fire and it is pain, and it is --\n\n\nIt is --\n\n\nLeia’s eyes are pinned open wide, wide, wide as the vision overtakes her. Snow an iron cascade, some planet with no name, gnarled trees grasping at the grey belly of the sky. Rey, her hair a frosted mat, her lips bleeding, her eyes wet, the glow of Luke’s lightsabre casting sick green shadows over her face. She looks half-dead. \n\n\nAt her feet. Snow a bloody, churned slurry. The dance of fighters ripping up the earth. Corpses littering the ground, eyesockets filling up with white. Poe. Finn. Luke. Phasma. Broken, crooked bodies. Charred lines. \n\n\n“Bow to me,” says Kylo, says the boy who was Ben, says the man who has made his choice. “Bow to me, and I will spare you. I will teach you.”\n\n\n“I’ll never bow,” Rey shouts back. “I’ll die before I bow, I’ll \n\ndie\n\n --”\n\n\n“Then so be it,” says Kylo Ren, and he does not dance or parry: he thrusts once, and Rey’s breath is punched from her lungs, and she slides off his sabre in a heap of burned and useless flesh. \n\n\n“Mother,” says Kylo. His mask is gone. His face is the one she has known and loved for thirty years. His smile is entirely his own. She wishes his expressions were warped and cruel; she wishes that he was scarred, burned up, veiled. But he isn’t. He’s her son. He’s her son. “Mother, let me tell you a story. Once upon a time there was a woman, and she had more children than she ever knew, only she failed them all. And they died. And she did not. She watched them die, and she failed them, and she lived a long, lonely life and there was no end.”\n\n \n\n--\n\n \n\nA warm scream fills Leia’s throat as she jerks awake. Luke’s hand finds hers, fingers knotting tight. “I felt it too,” he says. “I felt it.”\n\n\n“Me too,” and there’s Rey, small sharp thing huddled against the foot of the bed. “I felt him die. But it’s not better. It’s not better.” She shivers, but the set of her chin is stone. “I dreamed of fire. I woke with blood in my mouth, I think I bit my tongue again, and -- and they’re out there, my boys are out there -- I have to find them I \n\nhave to\n\n.” The hot spill of words. The ferocity of youth. Leia holds out her free hand. \n\n\nRey hesitates for a moment, then takes it. Her palm is work-roughened. Here is a girl who has never had a day of ease. Here is a child raised in hunger and pain and flight, here is a girl who has fought for each breath she has ever taken, here is a girl who has lived a lifetime of fear and pain -- and yet here is a girl with love in her eyes, and a heart big enough to hold the world. \n\n\nThere’s always a choice, Leia thinks. \n\n\n“Go with her,” she tells Luke. Luke’s lips open, ready to voice his objections, but she squeezes his fingers with big-sister authority. “You \n\nwill\n\n go with her, and you will...you will help them.”\n\n\nLuke kisses her forehead. Rey wavers, then presses her lips to Leia’s cheek. \n\n\n“If you see my son,” she says. \n\n\nShe doesn’t finish that sentence. \n\n\nShe doesn’t know how to. \n\n \n\n--\n\n \n\n“I still sense good in him,” says Luke, like these words will bring comfort. \n\n\nIn a galaxy far away, a long time ago, a woman panted those words as she died, blood sick and wet on her thighs. Leia shouldn’t remember this, but she does -- she was never a normal child, not even fresh-turned out into the world, purple-slimed and howling. \n\n\n“Phasma told me Hux had a sister,” Leia replies. “He had a sister, and the sister had a husband who beat her, and she stayed with him because that’s what you do in the First Order --you obey. And he found out, and he helped her escape him, even though the husband was from good old imperial stock, even though his father told him not to intervene. He was nineteen, and he held a gun to his sister’s husband’s head, and he said that if he ever laid a hand on her again he’d shoot him.”\n\n\nLuke’s staring at her with the intensity of a hermit. She wonders if he knows how much he looks like Ben Kenobi. She wonders if he cares. \n\n\n“Everyone has good in them,” she says. “I’m old, Luke, and I’ve seen the universe grow and shrink and rage and I have learned one thing above all: everyone is both bad and good, and the bad can do good and the good can do bad, and Ben does have good in him but -- but I don’t know if it’s enough.”\n\n \n\n--\n\n \n\nA conversation between a trooper and a pilot:\n\n\n“My sister was born blind-deaf,” says Pava.\n\n\n“I am sorry,” says Fiver. “At least she would have a funeral. In the order, they would have burned her.”\n\n\n“She’s not dead.”\n\n\n“I don’t understand. She was -- is -- crippled. Why was she not humanely euthanized shortly after birth? She will live in darkness and suffering. She will never have a purpose. It is cruel to keep her alive.”\n\n\n“Bitch! She’s alive, and she works with the Resistance, and she has a droid to help her communicate --”\n\n\n“It is \n\ncruelty\n\n to force her to endure!”\n\n\nThey glower at each other, both hot with fury, both utterly convinced they are in the right. \n\n \n\n--\n\n \n\nHere’s the thing about good: it’s \n\nsubjective.\n\n\n \n\n\n--\n\n\n \n\nFinn knows this. He knows this, and he knows why troopers stay loyal, even if Poe doesn’t -- he knows, and he understands, and h struggles to put it into words. \n\n\nIf asked, he may say this: the worst thing that the First Order does to its troopers is make them want to be troopers. \n\n \n\n--\n\n \n\nTY unit stayed loyal. \n\n\nTY unit stayed loyal, even though their officers did not, and they shot their commanders and shot their comrades , and Finn and Poe find themselves locked up in jail cells awaiting delivery to Ren.\n\n\n“Why did they do it?” says Poe, left side of his face black-blue with bruising. His mouth split open like over-ripe fruit in the summer. “Why defend the people who enslaved them?”\n\n\nFinn hooks his fingers into the bars. His head jangles with numbers and names and \n\nFN-2187 was a Stormtrooper \n\nand he understands, he does, because the First Order is a mother, a cruel and hungry mother who rears strong young sons. Being a trooper is to be told you are nothing, and yet told you can attain if you serve -- and it is all too easy to neglect to notice that the one you are serving is the one that makes you nothing, because you blind yourself to that fact. \n\n\nYou tell yourself: \n\nI will please the system, the Order, I will rise, rise, rise. \n\n\n\nYou tell yourself:\n\n I am nothing because I am a trooper, but within the First Order I am something. \n\n\n\nYou do not tell yourself: \n\nI am nothing because the First Order made me nothing.\n\n\n \n\n--\n\n \n\nLoyalty makes sense, in those circumstances. \n\n\nIt’s not loyalty to a cause. It’s loyalty to a story\n\n. I am a Stormtrooper, I will rise. I am a Stormtrooper, and without the Order I am nothing and within the order I have a chance.\n\n\n\nShot-At-Dawn calls it cowardice. Two Sevens would call it the same thing that makes a clipped-winged bird huddle to the ground, unwilling to fly, even when its primaries grow back. \n\n \n\n--\n\n \n\nThere’s good in everyone, and evil as well, but pettiness is a niche all to itself; and it’s pettiness that makes TY-0989 yank Finn from Poe and hit him in the mouth at two o’clock in the morning, standard time. \n\n\nSleep is shredded in moments. Finn lands against a wall, shoulders, spine, mouth -- all red and singing in pain -- and out of instinct he lashes out in return. His fist catches the trooper’s cheek. Finn’s travel-sore and battle-weary and TY-0989 is fresh and young and full of spite. \n\n\n“Fucking martyr,” he spits. He’s not wearing his helmet. He’s only a little older than Rey and the colour of Jakku dust. “I’ll show you who’s a fucking --”\n\n\nAboard the good ship \n\nCommander, \n\nwhere the blood of mutinous officers rusts along the walls and in the dorms,  alarms start to sing. \n\n \n\n--\n\n \n\n“Took you long enough,” Poe pants. \n\n\nRey presses the pads of her fingers to his temples. “Who did this to you?” She tastes anger at the back of her throat, like bile or blood, and to swallow it down is to poison herself -- so she lets it spill out in hot-veined words. “I’ll kill them, I’ll -- “\n\n\n“They’re already dead,” says KU-0956, now known as Ceasefire. \n\n\n“You didn’t let them surrender?” \n\n\n“They killed their own,” Ceasefire says, and that’s it. \n\n\nFinn understands. A Stormtrooper is raised to believe that loyalty is the foremost virtue. \n\n\n(Once, Hux bragged that a trooper has loyalty carved into their very bones.)\n\n\n(He’s right, of course.)\n\n\n(The problem: loyalty, like hate, is merely a concept. Stormtroopers are loyal. Stormtroopers are unquestionably loyal. The question is: \n\nwho are they loyal to\n\n.)\n\n \n\n--\n\n \n\n“Let me tell you a story,” says Hux. “Once upon a time, there was an Emperor and he wished to rule everything that has ever been, or ever will be --”\n\n\n“And he conjured fire, and it ate him up! I’ve heard this one \n\nbefore\n\n,” says Ren. He knows he is dreaming, and he detests that even in death Hux can still rile him. \n\n\nThey stand on silver sands. The sky above is the thin white of dawn. There are two suns. \n\n\n“No. No, I want to tell you a different story -- sit down,” and in the infuriating manner of dreams, Kylo finds himself bidden to do so. Hux sits as well, cross-legged.\n\n\n“Once upon a time, there was an Emperor and he wished to rule everything that has ever been, or ever will be. And he succeeded. And he lived a long and lonely life, and there was no end.”\n\n\n“I do not understand.”\n\n\n“I don’t presume you do,” says Hux. His face gentles. He reaches out with a gloved hand; Kylo skitters backwards. \n\n\n“What are you doing?”\n\n\n“You are \n\nblind\n\n. So very blind.”\n\n\nSyrupy blackness starts to run across the desert sands. Kylo springs to his feet; the darkness consumes the sun and the sky, until it is just he and Hux --\n\n\n-- \n\nonly it is not Hux --\n\n\n\n“Listen to me. You son of a bitch, listen to me, I’m trying to help \n\nlisten to me --”\n\n\n\nKylo clamps his hands to his ears. “I can’t hear you! I can’t hear you! I \n\ncan’t \n\n--”\n\n \n\n--\n\n \n\nThe Falcon sings through the stars, as it has done since the time of its birth, and aboard Luke plays Chewie at cards, losing roundly,  and Rey jerks awake from a dream. At once, Finn’s hands are in her hair, soothing her, while Poe reaches for a glass of water. \n\n\n“I dreamed about sand,” she says, “why do I always dream about sand? I hate it. It’s coarse and irritating and it gets \n\neverywhere.”\n\n\n\n“Dunno. Why do I always dream about your dumb face rather than --”\n\n\nFinn smacks him. Poe lapses into quiet. \n\n\n“I dreamed there was a man, and he was telling me a story,” says Rey. She’s staring into the murk of the ship like she can see her dream unveiling there, holoscreen-style. “He said. ‘Once, in a galaxy very far away, and a long time ago, there was a man. He was married to a beautiful young woman. Now, where they lived there was a forest full of wolves, and the wife was prone to wander through them. He was plagued with dreams of the wolves eating up his wife, and he couldn’t bear it, so he set the forest on fire, hoping to smoke the wolves out.’”\n\n\nShe takes a sip of water, leans against Finn. Her skin is glossed with sweat. \n\n\n“And he asked me how it would end. And I said, wasn’t it obvious? The fire ate up the wolves, and because the wife was with them it ate up her as well, because you can’t control the fires you start -- and if the man was stupid enough to set his home on fire because his wife was a tit then, well, he deserved it.”\n\n\n“And,” she continues, “he just got really quiet and he said I was right, and he said that I was a clever girl, and that I reminded him of someone he could have known. He asked me who my father was; he said that I did him credit. I said I had none; and I needed none; and that everything I was entirely my own choice. And, uh. I said he was being an arrogant prick. He \n\nwas\n\n,” Rey says to Poe’s  open-mouthed grin. “He was, he was a patronising shit.”\n\n\n“You should ask Master Luke,” says Finn. “Sounds like his sort of thing.”\n\n\n“Yeah. Force, help me.”\n\n \n\n--\n\n \n\n“We will proceed with the liberation of Persephone,” says Leia. “We promised aid, and it will be delivered,” and none question her, and none suggest that she take time to mourn, and she is winter, she is fury, she is the unstoppable drift of tectonic plates. \n\n\nShe is a mother. \n\n\n(\n\nA woman who had more children than she ever knew --)\n\n\n\n(Poe. Pava. Snap. Sunny. Dancer -- \n\nher pilots hers --\n\n)\n\n\n(Once, Han had asked her: \n\nWhat would you do if I died in action?\n\n\n\nShe had replied: \n\nbury you.\n\n)\n\n \n\n--\n\n\n\n\n\n“I \n\ncannot,” \n\nsays Phasma. “I cannot take up command again -- they will not accept me --”\n\n\n“They will, and they have, and this is an \n\norder\n\n.”\n\n\n“To be a captain again --”\n\n\n“I was thinking Major.”\n\n\nPhasma bows her head. “May I speak plainly, ma’am?”\n\n\n“That you may.”\n\n\n“Even if we do not win...even if I die in battle, which I certainly expect to, I am glad that I could have fought for the Resistance. Under you. I am glad that...that I will have a funeral. Ma’am.”\n\n\nPhasma’s hair is too long, or too short, depending on how you look at it. Not a buzzcut anymore; it is feathery, falling down towards her collar. There’s a wisp snagged on her nose. \n\n\nLeia reaches up -- and up -- and brushes it aside. Her mouth pulls tight. “I know,” she says. \n\n \n\n--\n\n \n\n“What did he look like, this man you dreamed of?”\n\n\n“Shaggy hair. Strange eyes -- sort of yellow. A scar on his cheek. Metal hand. He seemed...familiar, somehow. Are you okay?” for her teacher has gone white. \n\n\n“I am...I must meditate on this.”\n\n\n“Stupid, cryptic Jedi,” Rey, the littlest Jedi, mutters. \n\n \n\n--\n\n \n\n“Captain, I have a question -- \n\nsir\n\n.”\n\n\n“No need to be quite so formal, Break-Door-Down,” says Captain Bren, corner of his mouth tugged up in sly amusement. Break-Door-Down has succumbed to pressure and permitted the shortening of his title, the removal of \n\nthe\n\n (but who will \n\nnot\n\n answer to Door, Break, or \n\nGet Down\n\n or any of the other absurd names that they try and foist upon him).\n\n\n“Yessir,” says Break-Door-Down, because old habits die hard. “Can I --” and halfway through the request he remembers he doesn’t need permission to sit, and so he slumps hard onto the workbench. \n\n\nOpposite him, Shot-At-Dawn pauses in the cleaning of her gun. \n\n\n(Her name is now even more apt. Once a he, now a she, and the First Order decommissions what it perceives as deviation.) \n\n\n“What is it?”\n\n\n“Have I made an error? I thought your name was Captain Bren.”\n\n\n“It is.”\n\n\n“I heard Pava refer to you as \n\nArcher\n\n.”\n\n\n“That’s my surname.”\n\n\n“Why do you have two names? Is it a mark of rank?”\n\n\n“Nope. Everyone has them -- well. Humans do. It demarcates family lineage. So, I am Archer because my mother was Archer and so was my father --”\n\n\n“Your parents were siblings?”\n\n\n“No! I’m not from fucking \n\nJakku\n\n. No, my mother is an Archer -- Callimina Archer -- and my father was an I’mak, and as she had the higher rank he took her surname. It’s how it worked on my old home planet. Some places function differently, but that’s the basic principle. My sisters have that surname as well.”\n\n\n“Can I have a surname?” Shot-At-Dawn says. Break-Door-Down’s lips shape the word \n\nArcher\n\n and \n\nCallimina \n\nand he has gone very, very pale. \n\n\n“Just pick one.”\n\n\n“It’s a mark of family, right?”\n\n\n“Generally, yes.”\n\n\n“Then I’m Archer. So’s Break-Door-Down. My unit is my family.”\n\n\nShe says it with calm authority. Bren Archer’s face lights up with joy. “That’s...that’s lovely.”\n\n\n“When we liberate your family,” continues Shot-At-Dawn, “your sisters may serve with us, and they will be Archers too.”\n\n\n“My sisters are not the serving sort,” says Archer, but he’s smiling at the thought.\n\n\nBreak-Door-Down remembers: a commslink, \n\nFN-2187 was not a Stormtrooper -- Thalia Five -- I know you have kids in there --\n\n\n\nHe remembers, and says not a word. There’s always a choice; and sometimes it is better for the past to remain the past.\n\n \n\n--\n\n \n\n“\n\nWhat\n\n did you say your surname was?” says Pava. Fiver smiles, wide and joyful. \n\n\n“Holdhands. Same as the rest of my unit. We could never do \n\nthis\n\n in the Order,” and she holds up their entwined fingers and all Pava can do is thank every deity she knows that Fiver did not choose the \n\nother\n\n activity she has learned to love after defecting. \n\n \n\n--\n\n \n\n“Traitor is a \n\nbad\n\n thing,” beeps R2-D2. \n\n\n“It’s what the Order calls Finn,” says Two Sevens Traitor, flinty-eyed and daring the droid to disagree. “I’m proud to claim it for myself.”\n\n \n\n--\n\n \n\nPersephone calls. \n\n\nThe freshly surnamed troopers -- for once one decided upon a name, the others started to adopt their own, and soon the poor overworked droids have twice as many bizarre titles to note down -- are given a choice. \n\n\n(There is \n\nalways\n\n a choice, Phasma told them, one and all. Always, always, always.)\n\n\n(You do not have to fight. You do not have to fly to Persephone and land on the once-lush grasslands and tear into those you once called brothers and sisters, you do not have to.)\n\n\nThey remember Ithaka. \n\n\nAll who can go, do so. \n\n \n\n--\n\n \n\nThe message the First Order intended: this is what happens if you fight for the Resistance. \n\n\nThe message they delivered: we will kill you if you fight or not. \n\n\nThe message they delivered: you might as well fight. \n\n \n\n--\n\n \n\n“Mercy is weakness,” says Emperor Ren. \n\n\n“But sir -- Thalia Five has surrendered -- they have laid down their arms --”\n\n\n“Burn it to the ground. They defied me once, they shall do so again. \n\nBurn it down\n\n.”\n\n \n\n--\n\n \n\nThat night, Kylo Ren dreams of a desert, and blood between his teeth. He dreams of General Hux, gibbering and hunched over, carving names into his arms until bone shows slick and white through the red ruin of his flesh. \n\n\n“Sixty billion in the Hosnian system,” he says, staring up with empty sockets (there are names on his face, curling inwards, spiralling towards his eyes, names on his lids, on his lips, on the inside of his tongue --) “Sixty billion and I cannot remember their names, I cannot, I cannot. I can’t remember, I have to, I can’t remember and I have to --”\n\n\n“Do you remember the names of the Jedi children?” a voice singsongs into his ear. “Do you remember, do you? Have you heard that the Resistance has taken the entire fleet from the skies around Janus II? They surrendered. Mercy can be wisdom, it can be, sometimes. When you’re fighting a war --”\n\n\nKylo Ren spins around, shoves at the figure behind him. The man laughs, low and cold and curdled. \n\n\n“--when you’re fighting a war,” says Kylo. “You kill your enemies.”\n\n\n“Enemies. Friends. They’re such arbitrary concepts.”\n\n\n“Get \n\naway\n\n from me --”\n\n\n“Listen to me, you idiot. You bastard. Listen to me, bone of my bone, listen to me --”\n\n\n“I \n\nhate you!” \n\nKylo screams. “I --”\n\n\nHe wakes to dark pressing thick and velvet around him, and the news that the Resistance is heading for the barracks world of Persephone. \n\n\n“Ready my ship,” he says, “prepare for battle.”\n\n \n\n--\n\n \n\n“Get down, get \n\ndown\n\n,” and Break-Door-Down does not have to be told twice, tumbling into cover, Bren fast behind him. Blaster-fire wails overhead, and the command centre stands hideously strong.\n\n\n“We need air support you \n\nfucks\n\n,” Bren barks into his commslink. \n\n\n“Roger that; Black Squadron is diverted; Green Squadron tied up with TIE fighters. ETA: ten minutes.”\n\n\n“We need it \n\nnow\n\n, One Eye, we need it \n\nright now\n\n.”\n\n\n“Easy, Hux-fucker,” says Shannah Yvetta, “hold it down, keep safe, we’ll get to you as soon as we can, y’hear?”\n\n\n“Easy for you to fuckin’ say, up in the kriffing \n\nsky \n\n--”\n\n\n“I said keep safe, you First Order fuck. Don’t you dare die.”\n\n\n“I won’t, One Eye. Who else’ll rip your other eye out?”\n\n\n“Only one who gets to kill you is me,” snaps Shannah, and the link cuts off. \n\n\n“Down ladies, get down, c’mon!” \n\n \n\n--\n\n \n\nAn X Wing tumbles down, igniting as it goes, wings of fire spreading in a single greasy flare -- and then it plunges into the blood-swilled lake, and Fiver screams, because she knew who was in that fighter, she knew. \n\n\n“Keep it together,” Two Sevens snarls in her ear. “Mourn later, do you hear me? Mourn later!”\n\n\nShe thinks of General Organa, shoulders straight despite the weight of losing a husband, a son, a planet, a home -- and she bites back her tears. “To me!” she shouts, and lunges forwards.\n\n \n\n--\n\n \n\n“I need to tell you something.”\n\n\n“Not the time, Door!”\n\n\n“But sir -- “\n\n\n“Door Archer, you son of a bitch, you follow orders.”\n\n\n“It was me! I did it! I blew up the bunker, your mother was in it -- I am so \n\nsorry\n\n-- “\n\n\n“\n\nWhy are you telling me this now -- \n\nfuck me, Door. Right. Tell me their names --”\n\n\n“Their --”\n\n\n“Tell me the fucking names!”\n\n\n“Callimina, Cosima, Collette, Kaylah and Quizzica.”\n\n\n“That’s fine. That’ll do. It’s war, it’s war, we fight and we kill and we remember.”\n\n\nBren stamps a hard kiss to Door’s forehead. \n\n\n“I forgive you. Now bring me the scalps of any First Order bastards you find! First Order bastards,” he adds, “who aren’t me!”\n\n \n\n--\n\n \n\n“I’m frightened.”\n\n\n“It’s okay. We all are. Deep breaths, okay?”\n\n\nOsma holds Reyma’s hands, tight as can be. Reyma, the girl who shot her rapist and named herself after two Resistance heroes, clutches back. It’s her first proper battle, and she’s ashen under a mask of blood. \n\n\n(It’s not hers.)\n\n\n“What’s your name?” says Osma, who still refers to Bren as \n\nPoe\n\n, despite his virulent protests. \n\n\n“Reyma. Reyma Kiltjael.”\n\n\n(Kiltjael. Spelling is not a strong suit for Reyma. The words tangle themselves up, turning upside down as she tries to read them.)\n\n\n(Someone once told her that you name yourself after what makes you proud. \n\nKilled Jael\n\n. Her children will know where their freedom came from.)\n\n\n“And who are you?”\n\n\n“I was a Stormtrooper. I was. And now I’m \n\nme\n\n.”\n\n \n\n--\n\n \n\nAnd in the sky, Poe coughs out hard, tearless sobs. \n\n\n“Pava’s gone,” he says.  “Pava’s gone, she’s down, she’s \n\ngone\n\n.”\n\n\nHe thinks of General Organa, iron-eyed and winter-hard and swallows thickly. \n\n\n“Black Squadron, prepare to engage.”\n\n \n\n--\n\n \n\nFinn and Rey are two minutes from deploying  when Rey collapses: her legs shudder to the side, her eyes roll back, and blood froths between her lips. She’s bitten through her tongue.\n\n\n“Rey! REY!” and Finn grabs her, pulls her away from the gathered ranks of Resistance fighters -- some are wearing full Stormtrooper uniform, others bits and pieces of it, and the overall effect is that one cannot tell the difference between former trooper and Resistance veteran, between refugee and bounty hunter gone good. \n\n\n“Go on without me.”\n\n\nMajor Phasma gives him a quick, curt nod. “If we survive this,” she says, “I will have them make you an officer. I always said you had the material for it. Fall \n\nout\n\n.”\n\n \n\n--\n\n \n\nFinn carries her towards the Med-Bay. They’re using an old First Order ship -- most of the Resistance is using old First Order gear nowadays -- and he finds that he knows exactly where to go without stopping to consult a holomap. He’s got these corridors carved into his programming, after all --\n\n\nRey stirs in his arms. Her eyes sneak open. “They gone?”\n\n\n“Yes -- yes, Rey are you okay?”\n\n\n“Put me down.”\n\n\nFinn lowers her with exceeding gentleness. Her legs snap straight. \n\n\n“I had a vision,” she says, without preamble. “He’s got Poe.”\n\n \n\n--\n\n \n\nIn the command centre, Luke bleaches white. \n\n\n“No. \n\nNo \n\nRey, what are you doing -- can’t you see? --”\n\n\nBy the time he’s got to the hangar, it’s too late. \n\n \n\n--\n\n \n\nThey’re gone. \n\n \n\n--\n\n \n\nKylo’s flagship is called \n\nthe Executor \n\nbecause of course it is. Rey’s eyes are shuttered tight, focusing on the thin silver thread of \n\nPoe \n\nthat sings to her, distress and pain tangling up, discordant and hideous. \n\n\n“I’m coming for you,” she promises. “I am, I am.”\n\n \n\n--\n\n \n\nRen is waiting for them. His cape is a tattered black shiver, and his helmet is battered, and his lightsabre sings crackling death, and there is no sign of Poe. \n\n\nWith a flicker of fingers, he sends Finn flying backwards. The trooper smacks against the white wall with a wet, organic crunch and does not move. \n\n\n“Have you heard?” says Kylo, almost conversationally, clenching his fist. “I’m stronger than Snoke. I’m stronger than any Jedi there ever was.”\n\n\nRey cannot breathe. Her legs thrash; her face purples. She reaches out to the Force, the way Master Luke has shown her, and \n\nyanks \n\n-- and his grasp on her slackens, and she smacks into the ground.\n\n\nHer own lightsabre blossoms green as spring. \n\n\n“I could teach you,” he says. “I could --”\n\n\n“I would rather \n\ndie \n\nthan be like you -- you \n\ntraitor \n\nyou \n\ncoward\n\n --” she screams, and he shrugs, languid. \n\n\n“Very well.”\n\n\nHe doesn’t clench his fist. He doesn’t swing his sabre. He snaps his fingers. \n\n\nThe wall rips open, metal screaming, and a girder slashes across Rey’s throat. \n\n\nFinn’s extremities go cold. He cannot breathe. He cannot think. There is so much blood, and it’s all pouring from her -- how can a girl so little have so much blood in her?\n\n\n“I did ask,” Kylo says, a petulant twinge in his voice and he steps forward and Finn hunches over Rey, one hand in her throat, trying desperately to hold the artery closed -- the way his trooper training told him how --  and Kylo never makes contact, because Luke has arrived, and it is a fight that songs will be written about -- Kylo Ren, defeated by Luke Skywalker, forced to flee his own ship -- but Finn does not notice one bit of it, not one bit, because Rey is bleeding in his arms, Rey is dying slow and red, and nothing else matters, nothing else at all. \n\n \n\n--\n\n\nA long time ago, in a galaxy far away, there was a girl. \n\n\nShe was beautiful and clever and strong, with a bodyweight that was at least ninety per cent heart. She was not a princess. She was not a general. She did not have a kingdom or an army, but she had friends she loved and a life she lived, and her heart was her downfall -- for a girl with a heart that was at least ninety per cent of her bodyweight is doomed, perhaps, from the first time she draws breath. \n\n\nBecause this is a girl who has lived a life of pain and struggle, and emerged with her eyes shining hope. Because this is a girl who shines with hope, and this is a girl with the boy she loves at her side. \n\n\nShe set no fires. She came to save her prince, the \n\nother\n\n boy she loves, and she died. \n\n \n\n--\n\n \n\nExcept, of course, the stories almost always leave out the truth of the matter: there is no end. \n\n \n\n--\n\n \n\nIn the Falcon, Luke cuts into Rey with scalpels designed to operate on machinery. Chewie moans advice in the background, and Luke remembers Tattoine, the Sand People, and how they could salvage a body that would not die. \n\n\n“Hold on,” he says. “Hold on,” and he thanks every god that there has ever been that he knows electronics, that he knows how flesh and metal meld together and make life. \n\n\nA bit of piping. A lot of prayer. Finn, bruised and shaking and very much alive. \n\n\nBelow, victory songs are sung. Persephone falls to the Resistance, and above Rey breathes -- Rey \n\nbreathes\n\n.\n\n \n\n--\n\n \n\nAt least. She tries to. \n\n \n\n--\n\n \n\nThere’s a low, metallic wheeze shuddering through the corridors. \n\n\n“What is wrong with the engines?” Ren asks of a nearby officer. She checks her datapad.\n\n\n“That’s not the engine,” she says, “it seems to be the, uh. The holoboard sound.” She frowns over a map of the ships electronics. “Why’s it turning on? It’s -- oh fuck. It’s being hijacked, it’s an external signal --”\n\n\nRen tears the pad from her hand, flicks his wrist; she sails down the hallway, landing bruised and shuddering and alive. \n\n\nThe wheezing continues. It’s a strange sound, a little like metal grating on metal, a little like the shuddering breath of a great animal -- and as he listens it clarifies, and sounds (somehow) \n\nwet\n\n. \n\n\nHis fingers skitter over the map. Every holoboard in the ship is activating. \n\n\nThe sound coalesces. It is breathing. It is the pull of air into lungs and out again, and it is distorted, heavy and mechanical and it is --\n\n\n\nNo --\n\n\n\nThe screens flicker on. A girl stares out from them.\n\n\n“Kylo Ren,” she says, vibrato and metallic, blood-gargled and barely audible. Her throat -- her split-open throat -- has been clumsily stitched shut around a mechanical instrument, the sort of thing Sand People use on those warriors who have suffered injuries to the throat. Primitive, clunky but \n\nfunctional \n\n-- it is keeping her alive. It is distorting her voice. \n\n\nAfter the effort of speaking his name, she breathes in. \n\n\nIt is a hard, metallic wheeze. It echoes. \n\n\nNo. \n\nNo\n\n. He remembers the tales. Grandfather’s breath, hard and looming, \n\nGrandfather\n\n --\n\n\n“My name is Rey,” she says, “and I am a Jedi Knight.”\n\n\nShe heaves in another breath. Talking pains her, but her eyes are sharp and clear, even as blood starts to trail from the corner of her mouth. \n\n\nShe heaves in another breath, and the ship rings with the metal shudder of -- like -- \n\n\n\nDon’t think it! Don’t even think it!\n\n\n\n“Once there was a girl,” she says. There’s blood on her mouth. There’s fire in her eyes. Her voice is rasping, shuddering, metal-organic. “And she \n\nlived\n\n.”\n\n\n\n\n\n \nThey shoot JA-8757 for the crime of sedition.\nAt least, they try to.\n“Take off your helmet!” barks Colonel Stabilo, and the trooper does so. “Take aim!” Her squad levels their blasters, angle them at JA-8757’s sweat-glossed face. “Fire!”\nThey do.\n“Knew you wouldn’t have the balls,” says JA-8757 to her captain, one JJ-8752.\n“I couldn’t kill you, you little shit,” he says, all rough affection, then turns to his squad. “Come on! Let’s get the rest of the bastards!”\n \n--\n \nJA-8757’s crime: saying, within earshot of another trooper, the words  I think Persephone is a lost cause .\nColonel Stabilo’s mistake: forgetting that power is contingent on people believing you have it. She thought that because she was a colonel, because her family had been High Command since the days of the Empire, she carried their authority about like an heirloom.\nThat’s not how it works. Not anymore.\nLegacy means nothing. All that matters is who you are right in that moment, when you’ve got a blaster in your hands and a choice at your feet.\n \n--\n \nEvery child in the Republic is taught this: wars have rules.\nEvery child in the First Order is taught this: wars have rules.\nThe problem: the rules differ  drastically.\n \n--\n \n“Can I have a cigarette?” quips Commander Vesper, hawkish arrogance parcelled in First Order black.\nThere are rules. Even when surrendering, a man has a little dignity. Even here, on Persephone, on the day the First Order has its back broken -- even then.\nHe knows this.\nCass, once Stormtrooper CH-0023, apparently does not.\nHe hits Vesper across the mouth.\n“I surrendered!” spits Vesper, eyes wide, blood trickling from his split lip.\n“What was it that we’re told in basic training?” asks Cass, drawing his riot baton, letting it extend.\n“No trooper surrenders. It’s better to die,” says Jezzika, once CH-0742.\n“And what did the First Order  do  to those troopers who came back from captivity? Who clawed their way home?”\n“Executed them for permitting themselves to be captured,” drawls Stumps, once SH-8422.\n“Oh yes. That’s what we were taught.”\nCass tips the Commander’s chin up with the end of the baton.\n“Why don’t I show you how well we learned the lesson?”\n \n--\n \n“That’s odd.”\n“What?”\n“They were waving a white flag. Why were they doing that?”\nTwo Sevens tugs the length of fabric loose from the officer’s bloodied fists.\n“Strange First Order thing, probably,” he says.\nBeside him, a Resistance fighter whines. “He looks so young,” she says.\n“Seventeen rotations, I’d say,” says Two Sevens, absently. “Why the white?”\n“Oh God,” she says, “oh God,” and she is pale and sweating and fever-rank and Two Sevens does not know what is wrong. “They were surrendering, they were children --”\n“No they weren’t,” says Two Sevens. Battle-sickness, he assumes. It gets to everyone. He nudges a reassuring palm against her shoulder.\n(Some troopers have learned how to touch, how to hug, how to use their bodies for things that are not warfare..Some haven’t.)\n(Two Sevens decidedly hasn’t.)\n“They didn’t tell you,” says his squadmate, “what a white flag means, did they?”\n \n--\n \nA story that Vesper once told his daughter, as she perched on his knee:\n“There was once a beautiful princess, and her land was stricken by a terrible monster --”\n“Did it look like a rathar?”\n“ Yes . And the princess -- why, she looked a little like you.”\nThe child tittered.\n“And she was so scared of this monster, but a friendly fire spirit asked if it could help -- and she agreed! -- so it burned up the monster, tentacles and eyes and all. And the friendly fire spirit went away, its purpose served.”\nThat’s not the ending Vesper’s father told him, but his little Amelia is far too young to face such cruel stories.\n(When he was her age, CH-0023 fell asleep to the soft murmur of his comrades, reciting the words of Hux’s speeches.)\n( Please  , Vesper tries to say.  I don’t want my daughter to grow up without a father .)\n(The baton comes down again. And again. And again.)\n \n--\n \n“You okay, Reyma?”\n“I was so s cared ,” says the girl. Her knees are hunched to her chest. Cass loops an arm around her shoulders, tugs her into a half-hug.\n(Cass  does understand the need for touch.)\n“It’s a scary thing,” he says. “But you fought anyway, and that’s okay. They tell us that fear is weakness, but it isn’t -- it is utterly, utterly human.”\nThey sit there in silence for a moment. Around them, Persephone recovers.\nFinally, Cass says, “Shall I tell you a story?”\n“Go on then.”\n“There was once a boy called FN-2187,” starts Cass, “and he was a Stormtrooper…”\nThere’s blood on his hands. It dries in the sun.\n \n--\n \n“No,” Finn snaps, “you  cannot just kill them.”\n“They are First Order monsters,” says the Stormtrooper. His name is Finnoehan. Even Finn thinks that name is a little much.\n“We promised a fair trial and we will  deliver a fair trial.”\n“You...you mean to keep your promise to them?”\nFinnoehan gestures behind him. There are perhaps fifteen officers there, chained in durasteel, stripped of any indicator of rank and, in a couple of cases, just stripped entirely. All are bruised and split-lipped. All look very cold, and very scared.\n“We also do not beat prisoners.”\n“We don’t? Huh.”\n“And give them some clothes!”\n“Why? They would not have given us the same choice.”\n“Because we’re not like them. Because at some point we’ve got to draw a line and not cross it. Because we don’t want to build a new world on the blood of the old.” Finn’s exhausted. His head is a hard, ugly throb and the smell of Rey’s blood is still snagged in his nose. “Because we were Stormtroopers, and we’re not the monsters they wanted us to be.”\nFinnoehan nods, slowly. He’s the newly elected captain of the ship  Breakwing , which had been sent to Persephone to assist the struggling loyalists. Instead, the troopers had risen up and slaughtered the majority of their officers.\n(Elected. Isn’t that a funny thing? The troopers had sat down, talked, and voted on a leader. They had chosen. The thought is enough to warm Finn’s aching, aching heart.)\n“I will deliver them for trial,” he says, eventually. “Because we were Stormtroopers, and we are not anymore.”\n“Because you’re Finnoehan.”\n“I’ve been thinking about changing it, actually. Everyone’s named after Resistance heroes.”\n“Change it to whatever you want. You get to choose.”\n“I’ve always liked that bit of day, when the sun’s just going down.”\n“Dusk?”\n“That’s the one. That’s me.”\nCaptain Dusk salutes, and the commslink fades out.\n \n--\n \nCaptain Dusk, of course, passes the message along.\n“Finn said what?”\n“Yup. No shooting of prisoners.”\n“Really? Fuck.”\n \n--\n \nThey throw Colonel Stablio’s corpse out of the airlock, along with the rest of the officers.\nThe lucky ones are already dead.\nOne of them is spared. Only one. Her name is Sekhmet, and the rest of the officers thought her soft and useless, and this is why she lives --\n“ I’m sorry Jate, I really am ,” and it’s JJ-8757’s nickname and none of the officers knew it, but this one, this small and scared thing, she did and so she hauls the girl away from the grasping hands of her comrades.\n“Touch her, and I’ll fucking kill you,” she says.\n \n--\n \nThe question: what now?\n“We should go to the Resistance,” says Jate. “They’re the ones fighting for us.”\n“I want to go to the Outer Rim,” her captain, Jayjay, says. “I don’t want any part in this war.”\n“I say the Resistance,” says Yanda.\n“I say the Outer Rim,” says Eighty Nine, who has not quite grasped the concept of  naming .\n \n--\n \nThe solution:\n“Hands up who wants to go to the Resistance. Hands up for the Outer Rim.”\nA count.\n“Resistance, it is.”\nSurly mutterings. “If you don’t like it,” says Jate, “then go away.”\n“Who put you in charge?” says Jayjay. He’s smart enough to not claim command by virtue of his once-held rank. The atmosphere is electric, and trying to use old power structures to secure his wishes will probably result in him being thrown out the airlock as well.\n“Hands up for me,” says Jate, suddenly. “Right. And hands up for Jayjay.”\nShe wins by fifty-three votes.\n“I don’t like it.”\n“Next time, promise something better. Now do as you’re told!”\nThat’s democracy.\n \n--\n \n“How is she?”\n“Coming out of surgery soon,” Poe says. Poe who has never been aboard the  Executor, Poe who was never in Kylo Ren’s hands, Poe who is still wracked with guilt over the fact that Rey’s throat was split open because of him, split to the spine.\nBB-8 beeps sadly. Poe rubs his hand along the droids shell. “How’s being patron saint of the revolution going?”\n“Shit,” Finn says, with feeling. “I just had to explain why we don’t shoot prisoners.  Again  . Captain Dusk...he’s a good person, they’re all good people, but they’ve been taught that...that war is one thing, and it’s not, it’s another, and they’re on our side and  good  but they don’t understand. And bad is just caught up in the good, and I can’t unpick the two and I want Rey and I want you and I want to sleep for a thousand years.”\n“Finn,” says Poe. “Oh baby,” and he pulls Finn against him, presses a kiss to the corner of his mouth. “It’s okay. It’ll be okay, we --”\n“You didn’t see her. I had my hands in her throat, there was blood everywhere, and her head was  dangling  and if -- if there had been just a moment more, a bit more, then she would have --”\n“But she didn’t. And she’s alive --”\n“--but --”\n“She’s not dead. She’s  not . And she’ll be okay, and we’ll win, we will.”\n“You don’t know that. You don’t.”\n“Yes I do. Because once there was a Stormtrooper, and his name was FN-2186, and he was raised to kill, to fight. He was told, every day of his life, that killing people was good, that the First Order was everything -- and do you know what he did? He rebelled. And if he can do that, then anyone can.”\n \n--\n \n“You can’t just  shoot them,” Jayjay is saying, but Jate doesn’t hear him, doesn’t hear anything but the buzz of blood in her ears.\nSekhmet is bleeding.\nSekhmet is bleeding from places where  no one should ever bleed  and the culprits are there -- are  right there  -- hands up, tentative, like they don’t know what they did wrong.\n“She’s an officer,” says one of them, Tallymark. His gaze flickers to Jayjay, like an appeal to rationality. “She’s an officer, she’s one of them -- does it matter what we do to her?”\n“Of course it doesn’t,” chimes in his squadmate, Flies-Better. Her lips curl. “She’s one of them. They burned the Hosnian system, they treated us like slaves --”\n“And so you -- you --” Words catch in her throat. Jayjay is in the way, she can’t kill them without maybe hitting him, and so she lets the blaster hang slack by her side. “Revenge makes nothing better! Acting like animals helps fucking no one! What,” and she stops, scrounging for something beyond  I’ll kill you I’ll kill you.  “Have you heard,” she says, instead, “that Finn lets officers live? That he doesn’t allow torture, that he -- that he told Captain Dusk, of  Breakwing , to bring them in for trial.”\n“Then we’ll put her on trial,” sneers Tallymark.\n“What are we?” she says, ignoring him, turning to the assembled troopers. “What are we? The First Order says that rebels are all rapist, murdering bastards. Are they right? Are we proving them right? Or are we people, actual people, with names and lives and fucking  compassion . We’ve got a second chance. What do we want our new world to look like?”\n \n--\n \nMartial law applies.\nTallymark and Flies-Better are shot.\n“I’m sorry,” Jate says. “I promise you that no one will ever do that to you again.”\nSekhmet’s family died when Thalia Five burned. She has no one.\nShe takes Jate’s hand.\n \n--\n \nThe junior officers emerge blinking, shaking into the light. The eldest, Two Sevens thinks, looks all of sixteen rotations old.\n“Not so arrogant now, are they?” Cass crows.\nTwo squadrons, linked up and flushing out any survivors. This particular cavern system was one of the last to be checked.\n“We surrender,” says a girl, dark-skinned and black-eyed and still wearing her insignia. “I --”\n“We don’t take officers as prisoners,” Cass says, levelling his blaster.\nTwo Sevens steps in front of him. “We take whoever surrenders.”\nCass isn’t angry; he’s genuinely confused. Head quirked on one side, brows pulling down, lips curling around, “Why?” because no one has ever explained it to him.\nTwo Sevens isn’t entirely sure how to put it into words. He’s thinking of blood-soaked white flags, broken bodies in the mud, miners crumpling under his blaster.\n“Because,” he says, “because we’re better than they say we are.”\nThere’s a clump of hair on Cass’s riot baton. It flutters in the wind, adhered by something red and tacky, and Two Sevens doesn’t comment on it.\n“Because,” he continues, “Finn would want us to realise that.”\n \n--\n \n“Tell me something,” says a man Kylo Ren does not recognise, “do you remember the names of the Jedi children?”\n“No. To remember them is weakness.”\n“Did Snoke say that, or did you?”\n“Does it matter?”\n“No. It doesn’t. Everything you are is your own choice. You know, they once called me the Chosen One.”\n“I don’t care. I don’t  care  --”\n“My Lord?” says Commander Tyra. “My Lord?”\nRen jerks awake. “Yes?”\n“We can retreat to the Outer Rims,” she says -- or is saying -- or has been saying.\n“You need to remember, Kylo. Remember.”\n“I’m awake,” he says. “I’m not dreaming. You’re not  real  --”\n“My Lord --”\n“No,” says the man. His smile is  sad . “No you’re not.”\n \n--\n \nThe General has new headquarters. Once the First Order flagship  Tyrant  , now  Solo , it loops in slow orbit around Persephone -- the planet on which the First Order’s spine was snapped -- and in the medbay Rey sleeps, recovering from her surgery, and in the brig scared First Order loyalists await trial, and in the command centre Leia, Luke, Finn, Poe and Chewie sit in a circle around a great silver hologram of the planet below.\n“I feel him,” Leia says, “under my heart, I feel him. He’s...he’s so afraid, he’s lunging from one engagement to the next, he’s running. He killed Snoke, he thought that he was ready and he  isn’t  . He’s just  scared . He thought that he could bring the Dark Side to victory but he forgot, or he never knew, that the Dark Side eats up its own.”\nLuke puts his hand on her shoulder. “There’s the Light in him,” he says.\nPoe’s lip curls. “I don’t care. I really don’t care.” BB-8 beeps at him.\n\n Don’t interrupt the General -- \n\n“I’ll say what I like,” snaps Poe. “I don’t care about him. I don’t care about the Force, or the prophecy, or Chosen Ones or,” he bites back the words  Skywalker family drama but he can tell from Luke’s face that they’ve been heard. “I...I --”\n“I know,” says Leia. “He’s caused such pain, but he is my son, and I still feel his fear.”\n“Yeah.” says Poe, hot and burning around his nape, shaking with -- with something. It’s all too much. Pava is dead. Dancer is dead. All of Green Squadron is gone. Rey’s clinging to life by a thread. And now -- “Yeah, he’s your kid, yeah,” and he turns and walks off, needing movement, needing  something .\n“I should go after him,” mutters Finn, and dashes off.\n \n--\n \nThere’s a ghost aboard  Solo .\n“Once there was a man,” he says, “and he failed his children. Don’t you take after me, Leia, don’t you dare.”\nThe Force is a hungry, merciless thing. It plucks at her bones, whispering  listen listen listen and Leia cannot pretend that she can’t hear it anymore. She lifts her head, stares at her father’s apparition. He’s young, so very young, long-haired, a scar crooked over his cheek.\n“Han, I need you,” she whispers, tears running hot and silver down her face. “Oh Han, why did you leave me?”\n“Once there was a man,” says Anakin Skywalker, “and he was so afraid for his family he set a fire that ate up everything he had ever loved.”\n“I know that story. I know it and I wish I didn’t.”\n“Let me tell you another one then, daughter. Once there was a woman, and she saved her children, even though it burned her alive.”\n \n--\n \nThe secret: the strongest woman in the world breaks sometimes.\nThe truth: strength is not in never breaking; it is gathering the pieces and standing once more.\n \n--\n \n“Poe?”\nShe finds him by Rey’s bedside, his head bowed, his shoulders a low arc. BB-8 is between his knees, softly beeping --\n\n Wake up Rey, wake up Friend Rey. \n\n“Hello ma’am,” he says, pepper-quick grin on his face, but there’s something lost about it, like he’s copying something he once knew how to do. “She made it through the surgery, at least.”\n“She’s remarkable. She’s --”\n“If you say, she’s strong with the Force I’ll fucking scream, I swear. I wish she wasn’t a Jedi. I wish she was just Rey. She wakes screaming every night, she wakes -- she  woke -- with blood on her tongue and this scream, this awful --”\n“I was going to say that she reminds me of you.”\n“Oh. Well. Everything I am I learned off you.” He flashes another smile, this one a shade brighter.\n“No. Everything you are you chose.” She sits down next to him. “But I’ll say this -- you have a damn good role model.”\n“Thanks, General.”\n“Call me Leia.”\n \n--\n \n“We need to head back to Persephone.”\n“My Lord -- there is nothing there for us,” General Asric says. She reeks of fear. “We must flee to the Outer Rims, we must --”\n“She’s right,” says the man, wavering in and out of existence like a bad holoscreen connection. “There’s nothing there for the Order. But what is there for you, Kylo? What is there for you?”\n“We can set a trap,” says Kylo Ren. “I’ll go alone, and tell my mother I have seen the error of my ways. And then, when the time is right --”\n“Let me tell you a story,” says the man, “about an Emperor who got everything he ever thought he wanted. There was no end.”\n \n--\n \nThree days after the final battle of Persephone, they hold a funeral on the planet’s largest continent.\n“We remember the fallen,” says General Organa, “those who gave their lives so that we may build a better world, a brighter world.”\n“We remember those who fought so bravely,” says Phasma, “and we aspire to be worthy of their sacrifice.”\n“They are at rest with the Force,” says Luke, “and they will know peace.”\n“They were magnificent pilots,” says Poe, “and good friends.”\n“They were so very brave,” says Rey, “we remember them,” and her voice is not as metallic as before, but there is a hard and shuddering whirr to it. She wears a black headscarf around her throat, over her head, designed to shield the machinery that has patched her together.\n(Her breath snags, catches, buzzes.)\n(You can tell she is approaching.)\n“Jessika Pava,” says Finn. “Dancer. Captain Finn --”\nHis speech is the longest. Not one person thinks it should have been otherwise.\n \n--\n \n“Mother, I’m frightened,” says Ben Solo, crouched in the snow, blood crusted on his face.\nIt could be his. It could be someone else’s. The air’s got that sharp suck to it that heralds the arrival of snow, and the sky is bloated with cloud.\n“Mother,” he says, again. He looks so very young. He’s fifteen. The age he had been when he slaughtered the Jedi children, when --\n(do you think, says a voice she knows far too well, that he remembers their names?)\n“Please don’t leave me,” he says, “I’m hiding from them, I’m here, I’m on Octavia -- you know, it's on the Outer Rim, it's hidden away -- I didn't know where else to go -- they tried to kill me and I ran so far and so fast and I think they’ve found me, I think they have --”\nLeia snaps awake. Her brother, curse him, has sensed her agitation and is already in her quarters.\n“He’s here,” he says, “landed not half an hour ago -- I felt him.”\n“It’s a trap.”\n“Obviously.”\n“You’re going, aren’t you?”\n“He’s my son. I have to.”\n“I’ll come with you.”\n“No you won’t. Someone needs to stay behind and lead the revolution if --”\n“Don’t even  say it.”\n \n--\n \nThis is Octavia: millions and millions of miles away, a planet of ice and trees and snow, where nothing lives, nothing at all.\n \n“You are  not going alone,” snaps Finn.\n“Yes, I am,” Rey snaps back. Her hands quiver. Her breath is stuttering, metallic and hard, and she forces herself to calm down, because breathing too hard and too deeply still pains her.\nShe tastes blood. Old blood, cooked onto the lining of her throat from the surgery.\n“I’m not going to be alone. The general’s coming.”\n“Which is also fucking stupid,” Poe chimes in. “General -- ma’am --  Leia . You know it’s a trap, right? He’ll kill you!”\n“He’s my son.”\n“He was Han’s son too -- do you remember what happened to him?”\nLeia hisses in a breath. Poe’s eyes widen, like he can’t quite believe what words are tripping off his tongue, and he starts to apologise, but the General cuts him off. “I know. But I have to. I can’t fail my children. I can’t be like...I can’t be like someone I knew, a very long time ago. Besides. I need you here. I need you to help Luke and Chewie consolidate our victory.”\nShe reaches up and touches his face, and Poe’s eyes flutter closed; he catches her hand, presses it against his cheek.\n“You’re a good boy,” she says. A pause. Then: “I am so very proud of you. And I am sorry for leaving you.”\n \n--\n \nThings Rey notices: General Organa says  children .\nThings Rey knows: Poe Dameron’s parents died before he was twelve years old.\nThings Rey knows: family is who you choose. Always and forever, it is who you choose.\n \n--\n \n“I’m not leaving you,” says Finn. Finn, the patron saint of revolution, Finn who was a Stormtrooper, Finn who is so full of love that he could splinter apart from it. “You can’t make me leave you.”\n“You have a duty here,” Rey says. “Just as I have a destiny. The Force knows that I have to face Ren --”\n“Fuck the Force! Let me send in soldiers, let me bomb the entire planet to nothing, let me -- let me  help --” and his eyes are wet, and his hands are shaking and he once ran halfway across the universe to save this girl, this beautiful mad girl, and the thought of her running off one way while Poe stays somewhere else --\nHis heart is being pulled into three, dripping handfuls.\n“You can’t,” he says, “you  can’t .”\n“I  have to,” Jedi girl with stars in her bones, eyes that encompass all the skies that ever were, and he kisses her, kisses her long and deep, kisses her until Poe clears his throat delicately.\n“If there’s a chance he can be saved,” Leia says. “I have to...I have to see.”\nFinn grabs Poe’s hand, squeezes so tightly that bones crack. “If he kills her,” he says, “if he kills her, then --” and he’s astonished by the  fury  that runs through him, the same fury that snatched at him on the night Ithaka burned.\n“He won’t. And you wouldn’t, even if he did.”\nRey kisses Poe, and that’s it. She’s gone.\n \n---\n \n“Why is the general not here to accept my surrender?”\n“Maybe because she’s got better things to do,” Phasma says. “Like cleaning her teeth. Or brushing her hair. It takes a lot of maintenance. The hair, that is.”\nThe Major slants a look to Poe, quirks a brow in query.\n“That is precisely how you banter, Ma,” he says, happily. “I’m so glad you’re learning.”\n“I will shoot you.”\n“No you won’t. Leia’ll  never  go out with you if you kill her favourite pilot.”\nPhasma flushes hard, from jaw to temple. “I -- I -- “\n“Everyone can see it, you  idiot  . I’m giving you my official permission to try and  tap that .”\n“We are in  delicate peace talks --” \n“No we’re not. She’s surrendered, right?”\nAsric’s jaw is taut. She nods.\n“Well then, let’s lock the bitch up.”\nThey are using one of the old barracks as a prison.\nIt’s funny, Poe thinks. Prisons were the mark of tyranny. And now they say something very different: this is where people go because we do not kill them. This is where they are tried.\nThis is where we build justice, from the ground up, with words and trials and judges and juries.\n \n--\n \nThey have Luke check General Asric, just to be sure.\nWhen he’s finished with her, his face is very pale.\n“Kylo’s...Kylo’s talking to people who aren’t there. He’s ranting about names and legacy and blood in his mouth and...oh my sister, oh my sweet sister, what have I let you go to meet?”\n \n--\n \n“Once,” says a man Kylo Ren does not recognise, “in a galaxy far far away, and a long time ago, there was a man. He had a wife he loved, and two children he loved more than the world, but the world was vast and cruel and the man feared for the safety of his children and his bride. And so he set a fire, he set a great and terrible fire, and it ate up everything he loved. And he lived a long and lonely life, and there was no end. And then, one day, he found that the fire was being relit, by a boy who could not remember the names of those he killed. What does that mean? What does that mean to you, grandson mine?”\nKylo Ren doesn’t hear him.\nHe’s got his hands clamped over his ears. Blood sizzles against his lower lip. He’s chewed his cheeks to rubble, because if he opens his mouth to speak --\nWell. He’s terrified of what he might say.\n( there is always a choice and --) \n\n (and what if I made the wrong --) \n\n\n (made the wrong one?) \n\n \n--\n \n“What’s your name, child?”\n“S-sekhmet. Ma’am. Major. Uh.”\nPhasma cups the girls chin, tilts her head this way and that, notes the splatter of purple bruises on her throat.\n“My name is Phasma,” she says, “I was a Stormtrooper, and no one will ever touch you again, be sure of it.”\n \n--\n \n“What’s your name?”\n“Uh. Snap. Folks call me Snap. What’s yours? Uh -- where are your clothes?”\n“I’m Osma.”\nSome Stormtroopers are unsure of physical things, and take things slowly.\nOthers do not.\n“Victory party?” says Osma, with a wink and a smile.\n \n--\n \n“I fucking hate you, First Order shitbag.”\n“I want to pop out your other eye, illiterate rebel scum.”\nBren yanks Shannah Yvetta into a blokish hug, slapping his shoulderblades.\n“We won,” he says, “no thanks to you.”\n“Go fuck yerself,” says Yvetta. “And thanks for not dying.”\n“You too, brother. You too.”\n \n--\n \nBen Solo embraces his mother. He is bloody-mouthed and shaking, burbling names to himself like a prayer, and she holds him, the warm fall of son against her chest, his gangling arms looped around her.\n“Mother, I’m sorry,” he says, “I’m so sorry. There’s a choice, always a choice, and I made the wrong one, I made the wrong one. I remember their names, I remember who they are, I  remember --”\n“Oh Ben. Oh  Ben --” \n \n\n -- \n\n \nThat is not what happens.\nFor a moment, just a moment, Leia allows herself to wish it.\nThe snow is an iron cascade. The stars glimmer between scuffs of wolf-grey cloud. All is very still. The Force is singing, high and sweet, with the aftershocks of victory -- but there is a lower note, a challenge, something dark and slinking, and she knows that in the woods of Octavia her son\n(stalks)\nwalks like a beast with blood on its breath, waiting.\nIn her hand is Luke’s lightsabre. At her side is a girl who seems  achingly familiar and --\nThe thought is amputated in a flat white strike.\nShe’s lifted off the ground, gasping, gagging for breath -- her lungs constricting  squeezing -- like a durasteel corset, like --\n(once there was a mother)\n(and she set a fire)\n-- and she hears a distant voice crying her name and she sees her brother and tastes blood and --\n                              \nwatch the horizon\n\n\nThere’s a storm building on the flanks of a planet so shit and tiny it doesn’t even have a name.\nThe lightning lashes down, hard and sharp like it wants to burrow up inside the earth, like it’s scared of whatever snarls in the skies. Poe can emphasise.\n“Snap, Snap, can you hear me?”\n“Loud and clear Cap’n.”\n“Bank left, bring up over that ridge -- we can’t let them double back towards Finn and the rest.”\n“Gotcha, Cap,” sings another voice, cheery and bright. “Snappy -- let’s mow the bastards down.”\n“Cool your jets, Ozzie. We need to get them away from the main event.”\n“Aye-aye Cap Dameron.”\nThe Resistance is more of a patchwork now than ever before. X Wings are joined by TIE fighters, which makes it a bitch to tell who you’re meant to be shooting at sometimes.\nAnd so it’s a TIE fighter -- flown by Osma (much to Poe’s jubilation she picked Dameron as a surname. What he doesn’t know is that her name’s double barrelled -- Dameron-Damnson, because that’s the exclamation he evokes from his comrades and Snap doesn’t want his head getting any bigger.) -- a TIE fighter that swings and loops around Poe Dameron’s X Wing, and it’s a one-time Stormtrooper who yowls in utter, feral victory as they start to mop up the last of the loyalists.\n“For  Ithaka  , you  cunts ,” she snaps.\n \n--\n \nThe Knights of Ren are -- were -- ancient, proud, defiant. Bowing to no one but their master, Lord Snoke. Not Sith, not really, for Sith teeter too close to the Jedi, one and another, black mirrored reflection is still a reflection, the Knights of Ren want to exist without that, without the idea that they are but the echo of the light.\n(A bit of Ren theology: the Dark Side of the Force is the true side. The passion and power of the Dark is the true purpose of the Force; the Light, with its weakness, is nothing but a lie.)\nImara Ren is of Twi’lek origin. She’s got very sharp teeth, and sea-foam blue skin, and she moves like the lightning, here and there, fast as thought. She wields two lightsabres, both double ended, and the effect is of mad, dancing starfire, swinging about her.\n“Come for me,” she coos, “come forth, Last of the Jedi, come forth Luke Skywalker --”\nLuke’s lightsabre shines bright as any star.\nBut it doesn’t move an inch.\nIt doesn’t have to.\n“ Fire ,” barks out Finn.\nImara, to her credit, blocks the first hundred shots.\nBut then there are a hundred more.\nAnd a hundred more.\nAnd a hundred more.\n\n\n--\n \nA very long time ago -- a  very  long time ago -- there was an Order. Order Sixty Six, it was called.\nFinn does not know this.\nWhat he does know is that a lightsabre can do much -- a good soldier (and good soldiers are never alone)  can do  more .\n\n\n--\n \nLuke Skywalker, before Leia left:\n“I want to come with you. If you meant to bring him to justice, then I must be there -- I am --”\nThe words not spoken: a better fighter than you; I defeated him once I can and will do so again; darling sister, do not face this monster alone.\nIn response, Leia cradles her twin’s face. His cheeks are hollowed by isolation; her palms roughened by work. “It has to be. Don’t you see? It has to be me.”\nAnd it is not a prophecy, it is not an order, it is not anything more or less than this: she is his mother.\nHe is hers.\nAnd she opens her mind to him, tilting her forehead forwards so they can touch brows, and he slides into her thoughts as though they are a warm tide-swell on the planet he once called home.\nHe sees: Ben Solo, five years old, fireflies tangled in his hair. Ben Solo, ten years old, the shadow of Snoke looming obscene behind him.\nHe sees: Kylo Ren redeemed.\nHe sees: what Leia will do if he cannot be.\n“Oh sister,” he breathes, “oh no, you can’t -- he is your  son .”\n“And so I owe it to him that it is  me ,” she says. “Do you understand? It’s the last kindness I can give him. It’s the only way to save him.”\n \n--\n \nBefore she leaves, he presses their father’s lightsabre into her hand.\nHer fingers tighten on it. Her eyes are stone.\n“If,” he says, “if -- if you do what you intend, it will kill you.”\n“No it won’t,” she says, trailing her fingers along his cheek, big-sister authority, the strength of a Princess and a General, of a mother and a widow and a Queen. Leia Organa, who always knows precisely where she stands. “I have lived through much, and I will live through this and -- and if he kills me then --” Her voice catches. She closes her eyes, swallows, and manages, “Then I will die knowing that I did right by my child. I will not fail him again Luke, I will  not --”\n“Oh Leia. You never failed him at all. Can’t you see that? Can’t you see that?”\n \n--\n \nPhasma does not go to the tiny, nameless planet where Imara Ren makes her last stand. Someone must stay behind, and she does, and she finds herself the subject of another promotion, and it is Colonel Phasma who leaves her tent to find a spectacular array of small, half-formed creatures waiting for her.\n(A note: Phasma does not understand children. They are caught in the throes of transformation, erratic as terranterrors, and they make her a little uneasy. Stormtroopers were not children. Stormtroopers were cadets, were would-be and will-be; they were soldiers-to-be who happened to be smaller. And now she is faced with a bundle of madcap potential that could go anyway at all, and it frightens her a little.)\nAnyway. The half-formed things --  children , Phasma corrects -- are ranked up in neat rows. At least they have good posture.\nEvery Resistance camp bulges at the seams with children. The camp on Persephone is no exception, despite the fact it was a warzone until two days ago -- in those two days no fewer than twelve personnel carriers have arrived, unpacking shivering huddles of boys and girls who are not soldiers-to-be but something else, something more.\n“Colonel?” says one. It’s a she. Possibly. It has short  hair, and bright eyes, but most things of that age -- prepubescent, Phasma thinks -- have short hair and bright eyes and somewhat chubby features. “I am Ninety-Twenty-Eight-Six. I am...I  was  part of the Stormtrooper programme. And uh. I am not anymore. And neither are any of us and we’re good with things, good with mechanics, and we asked the Resistance fighters,” here there is a sudden burst of clapping.\nThere’s something a little forced about it.\nPhasma remembers when she was that small, shouting and stamping her feet whenever the name  Snoke  was mentioned, because not showing enough enthusiasm would mean attention paid to you and even at that age (before her growth spurt, before muscle, before  anything ) you knew that attention paid to you was not a good thing.\n“Settle down,” she says, attempting to mimic the effortless casual tone Dameron uses with his pilots.\nAt once, the children snap to attention. Wide eyes. Straight shoulders.\nSomething curdles in Phasma’s stomach.\nOnce, the sight of so many would-be soldiers with such good reflexes, such respect, would have filled her with pride. Now -- now she knows they are not soon-to-be soldiers but children, now she knows that there is a difference between fear and respect.\nShe says, “Call me Phasma,” because names, names are important.\n“Phasma,” says the leader. It is brown in colour, wearing the black pyjamas that are mandatory for every child destined to become a trooper. “We wanted to give you a gift. And we asked the Resistance,” this time there is no clapping, just an earnest sense of  listening which is quite different to any other kind of silence, “the pilots, and they said that they’d help us -- and --”\n(Phasma thinks: they’re not naming which pilots helped them, in case this backfires, in case this earns punishment. They don’t want the blame to spread. They know that. They are so young, and they already know that.)\n(For a fervent moment, she wishes Hux was still breathing, so she might have the pleasure of shooting him again.)\n“ -- and we made this,” and the children step apart, formation opening up like a blossom, and in the middle are two of the smallest creatures ( children ) that Phasma has ever seen, and in their hands is a shining chrome helmet.\n“We know you lost the other one,” says the leader. “Uh. And we had it -- um -- we had it customised.”\nShe -- he? -- pronounces the word  customised like it’s foreign.\nIt is. Of course it is. Stormtroopers do not customise anything.\nPhasma takes the helmet from the two tiny things, and holds it aloft. It is remarkably similar to her old one, only at the back someone has lasered an inscription:\nMA\nBECAUSE SHE SAVED US.\nThere’s something wrong with Phasma’s eyes. They’re hot and itchy and  wet  and it’s this ghastly Persephone air; there’s too much ash in it.\n“Thank you,” she says. This does not seem enough. She wracks her mind, unearths an image of the Wookie greeting the General.\nShe catches the smaller of the children by the front of its pyjamas and lifts it up to her face. The child’s eyes bug, but it doesn’t thrash or whimer or whine; it was a trooper and knows better.\nColonel Phasma bumps her nose against the cheek.\n“Thank you,” she says, again, and drops it.\nFortunately, children of that age bounce.\n \n--\n \nOn the planet with no name, when the battle is won,  pilots and ground troops reunite on a valley carved deep between the slick black mountains. The rain has abated, just a little, and it falls in a fine mist around the victors.\nThere are so many people, and you can’t tell one-time trooper from long-time Resistance fighter, because they’re all in a mishmash of uniforms and armour -- that’s Snap with white gauntlets, there’s Bren in his old First Order boots and the bottle green jacket of a Resistance captain --\n(Hang on, that’s  Poe’s . How did he --)\nBut there’s no time to consider, because Poe’s got to keep going. People pat him on the back, start chants of his name --\n( Dameron! Dameron!) \n-- offer him drinks, which he declines with a quick shake of his head --\n(“Hey, I think I’m pregnant,” says Ozzie to Snap.\n“It’s only been a week since we -- you know --”\n“I’m bleeding. That means I’m pregnant, right?”\n“Kriffing hell, what sort of sex ed did you get in the Order?”)\n-- and on, and on, elation swelling the air around him, the bigness of victory stretching the valley to breaking point, tightening his throat --\n(“Come to my quarters.”\n“Fuck you, First Order dick -- I don’t swing that way!”\n“Wasn’t talking to you, ‘zetta! Shot-at-Dawn, you game?”\n“Please have some dignity Cap’n.”)\n-- and past all those stories, all those people, with hands and hearts full of triumph, past the stink of blood and the wild, electric thrill of  life  --\n(“I loved her, I loved her so much --”\n“I know. Oh Fiver, oh sister, oh my sister --”)\n-- and the battle, the battle is almost won -- for some it is won entirely, Knights of Ren dead and General Alaric surrendered and the First Order falling, falling, falling --\n(“No one’s going to hurt you ever again, no one will ever touch you --”)\n(“Have you heard? There’s correllian whisky by the kriffing barrel, these Ren bitches knew how to  live  --”)\nAnd then, for some, the battle’s still raging on.\nFinn’s surrounded. Someone starts a chant of, “ Finn! Finn! Finn! ” and it spreads out like ripples in a pond, like wildfire, like --\nLike revolution.\nAnd someone sees him, and someone else calls out, “Let the boy through!” and Poe’s all but shoved the last few metres into Finn’s arms.\n“Hey,” says the patron saint of revolution.\n“Hey,” says the Resistance’s best pilot.\nWhen they kiss, it’s to a backdrop of song, of absolute feral joy, to people set free.\n \n--\n \nThat night, they somehow find a quiet space away from the celebrations.\n“Why does Bren have my jacket?” Poe says, because the enormity of  everything else he wants to ask is threatening to break him apart.\n“Oh, he didn’t have anything else to wear. Just First Order uniform. You gave me that jacket, and I thought you wouldn’t mind if I passed it on.”\nFinn. His beautiful Finn who literally gave a man the jacket off his back.\nPoe kisses him. Finn responds eagerly, and it’s something, it’s something, but it isn’t enough.\n \n--\n \nMorning on Persephone. A sky of grey and gold. Tendrils of sunlight bleeding into cloud, rain-wet earth, air thick with petrichor.\nSekhmet Snapthorne’s one of the first up.\nShe watches the sun rise. Her wounds have cleared up pretty well, and the MedDroids have assured her that she isn’t pregnant, so that’s something.\nThat’s something, but it isn’t enough.\n \n--\n \n“It’s a good likeness!” Poe says, almost  weeping in mirth. Finn’s mouth hangs slack.\n“Well,” he allows, “it is that but uh. Why is it so big?”\nPhasma claps her hand to Finn’s shoulder. Finn’s knees buckle.\n“It is a sign of respect,” she says and once upon a time there was a Stormtrooper called FN-2187 and had you told him that Captain Phasma would single him out for praise he would have been terrified, tremor-struck and sweat-slick in heartbeats, for attention -- individual attention -- is not a good thing. This is what all troopers learn.\nBut FN-2187 is gone and, for that matter, so is Captain Phasma -- it’s Finn and Phasma who regard the painting of Finn that a group of enterprising troopers have daubed onto the blackened flank of a building that was once a barracks.\n“I’m not that muscly,” says Finn. “And, uh, why is Poe clinging to my leg?”\n“I think they copied some stuff off the old Resistance propaganda posters,” says Phasma.\n“They’ve got Rey down pretty well,” says Poe. “Look at her face. She looks ready to take on the First Order single-handedly.”\nYes. She does. There’s none of the scavenger from Jakku on the paintings face. She’s all warrior. Hard eyes and hard edges and it breaks his heart, because that’s how they see her, that’s how they remember her -- or, more precisely, that’s how they see her because that’s the way they’ve been trained to see her. They have smoothed away her softness because they think to portray it would shame her. They have given her the cold eyes of a First Order general because this is what they think Finn wants.\nThis is what it is to be a trooper: weakness is shameful, burn it away.\n“It’s very...nice,” he says, to the artist. Her name is Shot-At-Dawn and her face is set in the same hard lines as Rey in the painting -- but his praise, tentative as it is, melts her.\n“Thank you sir!”\n“Call me Finn.”\nLeia and Rey have not yet returned.\n \n--\n \nLuke Skywalker meditates, calling for guidance.\nHe gets one image, again and again: blood on snow. Broke-back trees framed black against a star-strewn sky.\nHis sister. His heartbeats and hers are one and the same, and he sees with her eyes, sees his nephew, as sharp and black as any of the trees. He sees his nephew lift a hand, clench his long fingers into a fist -- and he sees Leia lifted up, carried back on the long, hungry hands of the Force and --   \n \n--\nOnce upon a time there was a boy, and he loved his father\nOnce upon a time, in a galaxy not so far away, there was a little boy and all he wanted to do was fly the Millenium Falcon and go on adventures and speak Wookie and learn to fix things. He loved fireflies and stories of the old times and he really liked his Uncle Luke (even if he was a little scared of him).\nAnd, once upon a time, that boy grew up.  \n \n--\n \nLeia Organa dies in the snow. She dies with blood thick in her throat and the Force gnawing at her ribs, with the screams of the second-to-last Jedi ringing in her ears and --\n \n--\n \nThat’s not what happens.\nIt could have done. It  could have done  -- and indeed Rey sees it happening, for the Force is cruel and shows  could bes  along with  this is what will and prophecy is dumb animal wildness, not the precision that a long-dead order liked to pretend it was.\nRey’s vision goes warped and silver and strange and she sees Leia fall, sees blood bright on the snow, and she sees the woman stop breathing and --\nThen her eyes clear, and she heaves in air (metallic whir of the contraption in her throat keeping her alive) and sees Leia, brave and indomitable conqueror that she is,  stand .\nShe can barely do this. Her legs are aquiver and her mouth, her mouth is red and wet with blood --\n(blood in your mouth on waking, in your throat, let me tell you granddaughter mine --)\n(the Force is  cruel --)\nAnd Rey hears a voice tangled in the wind, carried to her ears, she feels hands cup her chin, tilting her head this way and that -- and for a moment she leans into the spectral caress, barely cognizant of her surroundings.\nThere’s a face. A man. Through him, she sees snow and broke-backed trees and Kylo Ren, red lightsabre crackling and spitting fury.\n“He won’t listen to me. Will you, child?”\nAnd then he’s gone. Rey’s lightsabre sings green.\n“Let me  teach you ,” she snarls, white-toothed and feral, and leaps forward.\n \n--\n \nLeia stands.\nLeia stands, and there are hands at her back, and someone is holding her up. A voice in her ear:  daughter mine, don’t take after him. You’re better than your father. Please know this. \nShe’s never heard  that voice before.\n \n\n -- \n\n \n“Oh,” says Cass, “Finn! What an absolute  honour .”\nThe worst thing about this whole scene is that: the absolute, honest delight in Cass’s eyes and voice. He’s quite clearly jubilant, a little boy in the presence of his hero, practically vibrating with the urge to salute (but he doesn’t, because he’s heard how Finn dislikes the trappings of military honour).\nThere’s blood smeared on his knuckles, and a bleeding girl at his feet.\n“What’s going on here?” says Finn. His voice is whip-tight, and Poe has to swallow back a hot surge of fury.\n“Oh,” says Cass. “Just an altercation. This one --” and he gestures at the girl with a cursory, dismissive flick of one wrist, “--got two of us killed. Flies-Better and Tallymark. Good soldiers, or so I hear. She made...accusations. Anyway, I heard her talking with Reyma about it, saying how happy she was that they were gone -- that they wouldn’t touch her again -- and she was all but gloating, and of course I dealt with it. Can’t have the officers thinking they can get one over on us. I know that’s what you always say.”\n“I -- I -- I have  never said that ,” and Cass’s joy dims, just a little. It’s replaced by bemusement.\n“I heard that you did,” he says and there you go, Poe thinks, there you go. I heard, I heard, I heard. “I heard that you said that the officers were the real monsters, that the troopers were victims.”\n“I -- I think I said something like that, yes, but I never said -- I  never said -- that this -- that --”\nWords fail him. He bends down and lifts the girl to her feet. Poe recognises her as Sekhmet. Her lovely face is a mask of blood.\n“I never said this,” says Finn. “Oh Force -- I never said this.”\n“Well,” says Cass, now a little irritable. “What do you expect? They oppressed us --”\n“And what do you think Stormtroopers did to Resistance fighters?”\n“Well, that’s --”\n“That’s not different.” Finn’s very deliberately not looking at Cass. He’s mopping the blood from Sekhmet’s face with gentle little dabs. The girl sways in his grasp. “That’s not different at all. Everyone here’s lost relatives to troopers or to Resistance fighters, or to Jedi or -- or anything. And we can’t start taking revenge on each other because we’ll tear ourselves apart.”\nOne last dab of the tissue. “I’m arresting you for assault,” says Finn to Cass. There’s an iron set to his jaw that makes Poe think of General Organa.\n \n--\n \nFinn’s learning.\nBeing the patron saint of revolution, the uncrowned king of one-time troopers, well. It’s more than just speeches. It’s a  legacy  and legacies are wild, burning things -- hard to grasp, hard to guide.\n“He thought I’d be pleased,” says Finn. “He thought I’d -- I’d be  pleased . How could he thought that of me?”\n“Because he doesn’t know you. Because he knows FN-2187-who-was-a-Stormtrooper, and he knows Finn patron-saint-of-revolution, and he knows the stories -- but the thing with stories is they change in the telling. People change stories so they mean whatever they want them to mean. Cass turned you into a story, and told himself what he wanted to hear.”\n \n--\n \nLuke sees the fight unfurl through his sister’s eyes. He sees Rey dance, wielding Anakin’s old lightsabre like a staff -- because no amount of Jedi training will ever unmake the desert-scavenger survival song in her bones and he’s to blame for that as well.\n(Once there was a father, and he tried to save his child, and he failed.)\n(Once there was a mother who should have never been a mother, a man too preoccupied with the war and --)\nAnyway. That is a story for another time. Luke is cross-legged, the Force curling around him like a snake with a mouse -- or a man with a favoured pet.\nLuke sees: Kylo pushing Rey’s sabre down, smacking her in the face with a half-open palm, the blow of a boy who has never learned to fight with his fists. He sees Rey recover, come back furious, come back strong; he hears her breath, hard and rasping and metallic; he sees plumes of smoke in the star-filled air. He tastes his sister’s despair, and her resolution.\n( Once there was a mother who saved her children, even though it burned her alive -) \n--\n \n“Come and  get me  scavenger,” barks Kylo Ren, and in a whirl of black he’s gone, through the trees, through the snow and it’s a trap, of course it’s a trap; it’s one of the first things you get taught about subterfuge; that a fake retreat is the perfect weapon against an opponent consumed by rage or hate; that retreating to better, higher ground gives you the perfect opportunity to double back, attack again.\nIt’s a trap.\nBut what other choice do they have but to follow?\n \n--\n \nThe trial takes place in the middle of the Resistance encampment. To say it is  makeshift is an understatement.\n“What’s a defense lawyer?” says Phasma. “Why does he need one? He’s guilty, that’s why he’s being brought to trial.”\n“That is...not how trials work.”\n“It is in the First Order,” says Phasma. “No one is ever brought to trial unless there is concrete evidence of their guilt.”\n“...oh dear,” says Poe.\n \n--\n \nThe question is: what sort of world do you want to build?\nIf you asked Poe he would say: where there’s a senate, like the old days, and where everyone can vote for rules over them, and where the Jedi Order brings peace wherever they tread and --\nIf you asked Finn he would say: a world where Rey can come home, and be safe.  \n \n--\n \nWhen Kylo turns to face them, it is at the top of a great canyon, jagged stone cleaving down to a tyrant of a river that froths at the mouth, shunting along chunks of ice the size of X Wings.\nThe fall would kill. Rey supposes that this is the  point .\nKylo’s Ren snarls, teeth and lips curling, and Rey thinks of dogs on Jakku, the mangy things that you’d have to shoot when the madness took them, because it was kinder.\nHe lunges forwards; the attack is absolute fury, hard swings and firesong of lightsabre and hate and this is the Force, this is it at its most elemental, a beast with curds of spit between its teeth.\nRey falters under the onslaught.\nKylo’s swing would have cleaved her in two -- but though he is fast, Leia is faster, and the air thickens with the reek of cooked meat as Kylo Ren’s arm topples away.\n \n--\n \n“The question is,” says Finn. “What sort of people do we want to be? Are we tools, are we monsters, are we everything that the First Order wanted us to be? Or are we something  more ?”\n \n--\n \nHis lightsabre sizzling in the snow. His lips curled up, mad-dog snarl, and he stumbles back, and Rey remembers the sound, the exact sound, that Han Solo had made as he died: a low, hard breath, almost like a sigh but not quite, she remembers that and she swings her lightsabre, angling it deliberately so it doesn’t go anywhere fatal; it skids along his leg, and the reek of burning flesh intensifies and Kylo Ren  howls .\nHe crumples to the ground.\nShe could kill him. It would be so easy, so very easy --\n \n--\n \nThere are some things only a mother can do.\nLeia’s hand is gentle on Rey’s elbow. She guides the quivering girl to the side and steels herself, lifting her lightsabre high for the killing blow.\n You’re not the person I was  , says a male voice, low and urgent.  You’re not the person I was Leia, Leia, Leia -- \n Leia, you can’t -- this isn’t what we   meant --  the second voice, just as urgent, soft and singing, light as breath.\nThere are tears stuck to Leia’s lashes.\nHer hands shake.\n \n--\n \n“I sentence you to ten years in prison,” says Admiral Ackbar. “And I strip you of your rank, and all military honours; you will never fight for us again. May this serve as a warning to those who would try and taint the New Republic with the brutality of the First Order. May it serve as reassurance to those who have been wronged that your voices will be heard, that you will be kept safe. May it serve as the foundation stone of a galaxy at peace, governed in justice and with wisdom.”\nAfter the trial, Finn finds Shot-At-Dawn. Her hair is in an unkempt bun, paintbrushes stuck through it; flecks of paint are scattered like freckles on her nape.\n“I loved the painting,” he says, and again there’s that flare of brilliance in her eyes, of utter delight. “But,” he says, “I think we can do better, if we do it together.”\nShe reaches up, pulls a paintbrush from her hair and offers it to him.\nThe next mural is of Poe and Rey. They are embracing, lit by dawn-light, Rey in her scavenger scarf, the glint of her metal-throat a thing of absolute beauty -- for it keeps her alive and nothing that keeps Rey alive could be anything less than beauty -- and Poe, tousled and grinning as wide as the sky, in his pilot uniform, while BB-8 nudges at his leg.\nThe real BB-8 gives them a fiery thumbs-up and chirrups encouragement.\nYes, thinks Finn, as he fills in Rey’s soft-curling hair. Yes, this is the sort of world I want to live in.\n \n--\n \nLuke jerks from meditation, his eyes filled with horror, his skin running cold, his bones aching, his hands spasming.\nOn Octavia, the lightsabre falls.\n\n\n\n\n\n\nA long time ago, on a planet a very long way away, a boy sat down with the two men who have come from the stars.\nHe says, “You must know such amazing stories.”\n“That I do,” says the older of the two men. He has seen much, and done much, but there is youthful exuberance in his eyes. “Would you like to hear my favourite?”\nThe boy nods. He is small for his age, fine-boned and soft-haired, and although his palms are work-blistered there’s something innocent about him, something untouched.\n(The man knows this: the boy has a mother. The mother is more than work-blistered. She is bent-backed and tired-eyed and her energy, which is considerable, is focused upon her guarding her son. Hence his innocence. Hence his sky-open eyes and his concern for stories.)\n“Once,” says the older man, “there was a young girl. She lived alone, but she was plagued by the monsters that dwelled in her desert home --”\n“Oh not  this one again ,” chimes in the younger man. There’s no petulance in his voice -- an observer would get the impression that this objection is just part of the story, part of the tradition. “I’ve heard it so many times before.”\n“We all have,” says the older man, “for it holds a valuable lesson.”\n“Yes, for --”\n“Don’t interrupt!” the boy chides, snapping his foot against the younger man’s shin. “I want to hear.”\n“Oi! Little Jedi respect their elders.”\n“Then listen to your Master,” says the older man. His lips curve in a slow, easy smile. His voice is gentle and hypnotic as wind over ocean, and he continues: “This girl lived alone in the desert, and she was much troubled by the monsters around her. These monsters took many forms: rathars and wolves and men, for monsters can walk on two legs or more, and the girl knew well the many faces of evil. And she was sore afraid of the night, for this was when the monsters would gnaw the edge of her home and call her name. And, one night, in her pain and fear and loneliness, she set a fire. She stoked it high, first with all the kindling she had, and then with her home, and then with the clothes off her back. And the fire burned up the monsters, and when morning came it still burned. She said to it: ‘Your purpose is served, please go.’ And the fire did not listen, and it tried to devour her as well.”\n“But the girl was strong and canny, and though the fire scarred her it did not kill her, and she ran for miles and miles, bleeding and charred, and weeping -- for she saw the destruction her fire had wrought. Presently, she came to a village. There was a boy in the village, and he saw the state of the girl and said to her: ‘Why do you cry? Why are you hurt?” And she said: ‘Leave me, leave me, I am burned because of the fire I have set.’ And he said: ‘You are hurting.’ And she said: ‘I deserve this hurt, I have hurt others. Let me die, so that I might pay penance for the fire.”\n“And the boy was not satisfied with this answer, and he grew angry: ‘You set this fire. You know where this fire is. No one else does. It is your responsibility to live, so that you may put it out. Nothing is gained by your death.’”\n“The girl saw the wisdom in this, and she stood, and she drank the water the boy offered her and permitted him to tend to her wounds. And, together, they returned to the place where the fire still raged and, together, they put it out. And afterwards the girl said to the boy: ‘Thank you, for you have saved me.’ And the boy, who was rightly annoyed, said: ‘I have saved no one; you have saved yourself. For that is the way it must be, and the way it always will be, Force permitting.’”\n“And the girl saw the wisdom in this as well and said, ‘We will journey together, and we will rest together, and we will find the fires that have been started by those like me.’ And thus they did. And there was no end.”\nThe younger man claps. The older man bows, and smiles, and the boy looks confused.\n“How did the girl survive the fire?”\n“It’s a parable, youngling,” says the older man. “It might have happened; it might not. The point is not the story. The point is the lesson.”\n“Which is?”\n“If I have to explain it to you, I am not a very good storyteller!”\n \n--\n \nLater on, the boy becomes a young man and the young man becomes an older man, and there is no more time for stories under the stars. There is war, and pain, and forgetting and one day the older man looks to the younger man and says, “Do you remember when we used to tell stories?”\nAnd the younger man, who is full to the brim with fire and fury and that hideous, quaking fear that always accompanies anger says, “Not especially.”\n“Me neither,” says the older man. “There was one...about a boy, I think. And a girl?”\nHe’s scrounging for the words. He can’t find them.\n“Something about a fire,” says the young man, “about starting a fire, and not being able to control it. The Council loves that sort of shit. Do not start fires, they eat you up. Don’t change anything, it’ll destroy you.”\n“I don’t think that’s what the story meant--”\nBut the young man is gone.\nThe older man, who will one day soon be an  old  man, can’t dispute the claim.\nHe doesn’t remember the story either.\n \n--\n \n“So,” says Poe. “Trials. Really?”\nFinn nods. “If we’re going to kill people,” he says, “we’ve got to have a reason for it. We’re building a new world. We’re building a Republic. We can’t have it built on blood and battlefields. We just  can’t .”\nPoe presses his face into the curve of Finn’s neck. Finn smells warm and fresh, like rain on spring grass, and -- and yet it isn’t enough because somewhere, somewhere very far away, Rey is fighting for her life, fighting a different kind of battle.\n“We’ll start with Asric…” Finn says, absently, raising one hand to toy with a curl of Poe’s hair. There’s paint flecked over his knuckles. “And --”\nThat’s when Luke Skywalker, ever the mood-killer, bursts into their tent. There are tears in his eyes. “We have to go to Octavia. She’s killed him. My sister -- she -- she’s killed her son, oh Leia, my sweet Leia, I am  sorry  --”\n \n--\n \nThis is what happens, at the top of a deep gouge in the rock, above a river where chunks of ice the size of X Wings float along, buffeted by wavelets.\nLeia’s lightsabre comes down.\nIt is a killing blow. It will go through Kylo Ren’s breastplate and into his heart and in one sweep it will end him. His heart will not struggle on -- it will die in a flash, cooked flesh and congealing blood. His lungs will flutter once or twice, but no more. It will be quick.\nExcept, of course, it is not.\nKylo Ren gathers what remains of his strength and  focuses and the lightsabre’s course is diverted, swinging not onto his chest but across his hip, thigh, leg. Leia, astonished, flounders -- just for a moment.\nIt is long enough.\nAnother  shove  and this one is not aimed at his mother, or at the girl.\nKylo Ren uses the last of his power to propel himself back over the cliff. He falls in a fluster of black, like a great broken-winged bird, falling until he is but a dot; and he smacks the water with an impact that rings up the canyon walls; and he does not surface.\n \n--\n \n“I haven’t forgiven him, you know.”\n“Who the hell are you?”\nThere’s a woman in Finn’s bedroom. She’s sad-eyed and beautiful, and  translucent. \n“You’re dreaming, little one. I wanted to talk to you. I wanted to see the boy who’s making the universe sing.”\n“Still. Who are you?”\n“Forgive me -- I’ve forgotten my manners. My name is Padme.”\n“I don’t know that name.”\n“No one does. I was a Queen once, and a soldier, and a mother -- and I have seen such dreadful things done in my name, things I never wanted done.”\n“Me too.”\nThe woman walks with eerie, hypnotic grace. Her feet barely graze the floor. “He loved me. He still does. And he did terrible things to save me. He never once asked -- is this what she wants? Is this what she would desire, does she think this is worth it?”\n“A man almost beat a child to death because he thought I’d want it,” Finn says. He wets his lips. Padme sits on the side of the bed. “There are pictures of me -- paintings -- and I look...I look like a killer. They paint me with First Order blood on my hands. I don’t want that. I don’t want to lose control of my story.”\n“No. So you take control of it yourself. You fight for what you want, you say what you want, over and over -- and yet people will still ignore that, and paste their words over yours, and your life will be a ceaseless struggle against this.”\n“They call me the patron saint of revolution.”\nPadme’s lip curls. “He called me his only reason for living, and burned up the galaxy for me.”\n“Just one man? I’ve got almost ten billion former troopers singing my name, and God knows what they’re doing.”\n“One man can do much, when he is a Skywalker.”\n“Oh  dear .”\n“Yes.”\nThey sit in silence for a while. It’s a good silence, a comfortable silence, the silence of two people who perfectly understand each other.\nThen Finn says, “You mean Vader, don’t you?”\n“He prefers Anakin -- but, yes, I do.”\n“So you’re…”\n“Luke’s mother. And Leia’s.”\n“I can see where they get their looks from.”\n“ Flirt .” She laughs and Finn, despite himself, grins back.\n“Luke told me. Most people don’t know. They, uh. They wouldn’t understand. Wouldn’t look at Leia the same way -- or Luke. They wouldn’t know that he redeemed himself, that --” Finn bites his lower lip. Hangs his head. “You know all that. But -- but you said that you haven’t forgiven him.”\n“No. It...it is different for Luke. He sees his father as a brave and noble man, corrupted by the Dark Side. I saw Vader’s birth throes. I saw Anakin choose, again and again, to do evil. I saw him darken, I saw him fall, and I saw him justify every step with my name. How can I forgive that? How can I forgive the man who murdered children to save me?” Her hand lifts, rubs against her throat, and there Finn sees the dim shadow of a bruise. “He destroyed everything I built.”\nFinn takes her hand. It’s like holding water that keeps its shape by a constant, swirling current.\n“Do you miss him?”\n“No. I am a Queen, and I am a politician, and I am used to loss.” Her chin goes up. Finn knows what a liar looks like, but he doesn’t say it.\n“I don’t know what to do,” says Finn. “I’m...I was a Stormtrooper, and now I’m the head of a fucking revolution -- only it isn’t a revolution, not anymore, it’s a Republic and I’m  scared .”\n“You’re a good man, Finn.”\n“Yeah, but is that enough?”\nPadme kisses him. It’s a very strange kiss. It feels like water pressing against his lips, and also like the touch of a summer breeze, and brings to mind -- for some reason -- Rey, just after she’s finished training, when she’s all hot with tension and tacky with sweat.\nIt’s chaste and sweet and over in a moment.\n“It has to be,” she says.\n“You were a good person,” he says, suddenly frantic, “and you failed and --”\n“But you keep trying. That’s what the Light side is. Endless and endless, sure as the tide, never giving in.”\n \n--\n \nThis is what revolution is, Finn thinks.\nOver and over. Never giving in.\n \n--\n \nKylo Ren falls and falls and hits the water and it’s like hitting durasteel -- wet crack as bones break -- blood swills into his mouth, teeth splinter, tongue shredded, and his vision fades into black and in the black he sees a face, a scarred and grinning face, an ancient face --\n Your training is complete,  says Lord Snoke.  You understand my final lesson -- \n \n--\n \nOnce, not so long ago, there was a old man and he faced someone who had been a young man and was now an older man -- for a given value of man.\n “ You can't win. If you strike me down, I shall become more powerful than you can possibly imagine,” says the old man.\nThe older man does not listen.\nThe old man falls.\nThe old man wins.\n \n--\n \nKylo Ren sinks deeper under the waves. All is black, and all is blood.\nHis lungs scream with pain. All he need to is open his mouth, allow the water to flood in, die. He will die, and the Force will take his spirit, and he can serve the Dark Side as he was always meant to. He will be free -- finally free -- of the constrainments of life, of the call of the Light. He will be as a god, a god with blood on his breath and a hunt in his heart; he can purge the Force from the inside out; Snoke will kneel to him; the galaxy in its entirety will kneel, whether they wish to or not --\n\n (once there was an emperor and he got everything he ever wanted --) \n\n\n (Snoke wanted to die, can’t you see? can’t you see? there was a boy, and he was on fire, only the old man wanted him to be only --) \n\n\n (nothing is ever your choice) \n\n (no: everything is. You’ve just made the   wrong ones) \nHe can finally be worthy of his grandfather’s name --\n Kylo  .  Kylo listen to me -- \nHis feet brush the bottom of the river. He’s hanging slack, pushed this way and that by the waves, but his lungs refuse to co-operate. He breathes out -- silvery bubbles float like constellations to the surface -- and the grasp on his chest tightens.\n\n Your training -- \n\n\n Your training is complete, child, you are my successor, you will -- \n\nWill what?\nA final bubble pops free.\n \n--\n \n“Here we go,” says Finn, presenting a still-wet watercolour to Poe. “Isn’t it lovely?”\n“Uh -- you’ve really captured Chewie’s feminine grace.”\n“It’s Leia, you dick.”\nPoe smirks, gets a kiss for his troubles.\n“We’re almost there,” Luke says. “I can feel my sister’s pain -- I -- “ And his voice fractures like winter ice, snapping open, and his head bows.\nThe mood sours in a heartbeat. Finn shoves the painting aside, runs his hand along Luke’s shoulder. “She did the only thing she could have done.”\n“She blames herself for it.”\n“Kylo Ren was no one’s fault but Kylo Ren’s,” says Poe, showing his teeth. “He chose to be a murdering bastard. No one made him. I mean, look at Finn. Raised to be a trooper, and now the best and bravest man I know. Doesn’t matter who your parents are; it matters what you choose.”\nLuke reaches up, takes Finn’s hand.\n \n--\n \n Breathe in , Snoke says.\n\n Grandfather I want to be worthy of you -- \n\n“You stupid  bastard ,” and Kylo Ren’s head snaps to the side. Someone’s hit him across the face.\nHe’s underwater, he sees nothing but black and black and --\nNo he’s not. He’s standing on sand, and in the distance twin suns slink towards the horizon.\nThere’s someone holding him by the front of his robes. It’s a man, a little shorter than him, a little younger -- tangle of hair and a scar crooked over one eye and s o very familiar  --\n“Are you listening to me? Are you finally listening? Are you?”\nThe man drops him. Kylo sprawls onto the sand in a useless tangle of limbs. He can’t breathe -- the air is too hot, snatching at the lining of his throat -- and he cannot stand and --\nThe man. The man overbrimming with rage. His eyes are bitter, bright yellow, like the eyes of some venomous predator and he strides back and forth, kicking at the ground, sending up flurries of grit.\n“Yes,” Kylo manages. “I am -- I am --”\n“You filthy fucking coward. Do you want to live up to my legacy? Then you’re going the right way about it!” The man kneels, grabs Kylo’s chin. “You’re going to die, and you and Snoke will unseat the balance of the Force for  years . The Force is a wild animal and you’re going to be a shot of adrenalin under its skin. Do you know what that will do to the universe? To the Jedi?”\n \n--\n \nThey meet in a clearing, acres of black sky above, acres of black forest around. Snow crackles underfoot, and the air thrums with frost.\n“You did the right thing,” says Luke to Leia and he’s right, he’s right, but that doesn’t make it any easier.\n \n--\n \nBB-8 rolls into Rey’s lap and refuses to budge.  Don’t leave again Friend Rey,  he chirrups,  don’t you ever leave again, don’t ever leave again. \nFinn on one side, Poe on the other, how it should be, how it should always be. Rey squeezes her eyes tight shut, tears scalding tracks down her numb cheeks. Poe kisses one earlobe, Finn kisses her jugular and Chewie, deciding that what these cubs need more than anything is a hug, scoops the three of them into his lap and buries his face into Rey’s hair.\n “Little ones,”  he croons, low and throaty, “little ones, so far from home. The battle is won. Han is avenged.” \n “He’d hate us for it,”  Rey says, for the tears she sheds are not for the Knight who tumbled from a cliff but for the man who looked on her with kindness, for the man who offered her a job, for the closest thing to a father she has ever known. “We did the right thing, and it’s still the worst thing in the world.” \n\n “There is a choice, a choice, always a choice. And the choice is not always pleasant, and it is not always good, but you must make it.” \n\n \n\n -- \n\n \n“My name,” says the man, “is Anakin Skywalker.”\nKylo Ren knows. To some extent, he’s always known.\n“Grandfather. I -- I don’t deserve to live, do I? You’re right. I can’t remember the names of those I’ve killed, and I’m a -- I’m a coward, I’m nothing, I’m not worthy of you --”\n“Are you  deaf?”  And Anakin, on his knees, smacking his grandson across the cheek, his teeth showing white and terrible and the Force straining at the seams, flood of dark and despair and  pain  and this is the Dark Side, this is the  real  Dark Side: the slow and awful fatigue of  giving up . “That’s not what I said! That is not what I said!”\nPeople tell themselves the stories they want to hear.\n \n--\n \n“I had to write a will,” says Finn.\n Do not leave Friend Rey, do not ever leave again -- what is a will?  chirrups BB-8.  It is something humans write when they are going to die -- you are not going to die! Friend Finn is not going to die, not now, not ever -- his beeps are getting shrill with panic, and Rey soothes a hand over his shell.\n“He’s not going to die, BB-8.”\n\n Love Friend Finn, Friend Finn cannot die. \n\n“We love him to; he’s not going to die.”\n“ Anyway  . I had to write a will, and it had a space for  surname and I didn’t know what to put, so uh -- I hope it’s okay but --”\nPoe straightens his shoulders a fraction.\n“--I put Organa.”\nPoe’s shoulders slump. The General smiles.\n“That is fine with me.”\n“Can I be Organa too?” says Rey. “Only...surnames are about family, right? And Finn’s my family, and so are you and --”\n“That is also fine,” says Leia, and there’s something approaching happiness in her eyes; but the rest of her is bent-backed and broken as the trees, as the cracks in the earth. She looks like a woman who has walked through hell.\n“Poe can be an Organa too.”\n“I  have  a surname, you know.”\n“Yeah, but -- but you can have two? I want you to share it with us. I want you to be part of the family as well.” There’s something childlike about Rey’s insistence. She stares at their clasped hands. “I don’t want us to...to break apart. I want us to stay together, I want -- I don’t want to be left again,” she finishes, soft and lost, and Poe kisses her.\nIt starts off discreet enough, but then Rey parts her lips a little and it is decidedly  not  discreet, and BB-8 beeps protest.\n\n If you are going to mate, do it elsewhere! \n\n \n\n -- \n\n \nSo they do.\n \n--\n \nThis is Phasma’s experience of trials to date: the miscreant is found doing something wrong, or an official document is produced that says they have been doing something wrong and this is all the proof that is needed. The trial is an excellent chance to highlight the individual’s failings -- these failings are, of course, an anamoly and the individual in question is either:\nand both of these are things that absolve the First Order of any responsibility -- it was not a failing in the programming, or choice, but some external factor -- madness or rebellion, and once upon a time those were both the same thing -- and, thus, the individual was carved from the flank of the order like cancer from a host.\nThe end.\nHowever. The Resistance does things a little differently.\nMaz Kanata says, “She needs a lawyer. I will be the lawyer.”\nPhasma says, “She does not need a lawyer. She needs a blaster to the head.”\n“You do not understand democracy, do you?”\n“I understand that the majority of people wish her dead; that the majority of troopers have seen the horrors she has committed; that democracy is, after all, the will of the many. Thus, it is democratic to kill her.”\nMaz sniggers. “You’re more than just a pretty face, aren’t you?”\nPhasma, who has never been called  a pretty face  , let alone  just a pretty face  is stumped. Her mouth opens and shuts.\nMaz pats her knee. “Look, dearie, it goes like this. I’ll say why she’s innocent. You -- or someone else -- say why she’s guilty. It’s the way it’s got to work.”\n“But she’s guilty,” says Phasma.\n“Who says so? You?”\n“Well -- myself and my troopers --”\n“And if I were to say that you, Phasma, should go on trial for your crimes, and that I could find a thousand or so civilians who would gladly call for your head -- would you want to have a lawyer then, or is their condemnation enough?”\n“Well. If my troopers said I was a poor leader, I would allow myself to be killed. Civilians…” Her voice trails off. She’s moments from saying  don’t count  but she’s learned enough of this strange new world to understand that this is not an acceptable turn of phrase.\nMaz rolls her eyes. “Another example then. I say that Shot-At-Dawn was stealing bread. Shot-At-Dawn says she was not. Who do you believe?”\n“Shot-At-Dawn --”\n“Because she is a trooper, yes. And another question. Hux is caught with a girl who is not keen on the idea of being with him. Who do you believe? The girl or Hux?”\n“The girl --”\n“Why? Hux is a soldier, a general. His word means more than hers.”\n“That is  not the same .”\n“Isn’t it? When we start ranking people according to some arbitrary scale of how good they are, we put the power into the hands of people and  people  are flawed and fallible and  dim .” Maz nods once, decisively. “You’ll give me a week to prepare my defense. Ackbar can serve as judge.”\n \n--\n \nFinn’s having a piss in the woods when destiny comes knocking.\n“Stormtrooper -- oh,  come on!”  a voice barks.\nFinn shoves himself back into his pyjamas, and spins around, hand flying to his blaster.\nThere’s a man. He’s sort of translucent. Finn hazards a guess: “Anakin?”\n“Yup, well done. Come with me.  Now .”\n“Why?”\n“Please. I need your help.”\n \n--\n \nWords Finn was programmed to respond to:\nWords Finn actually responds to:\n \n--\n \nFinn should have gone to wake Rey. He should have gone for Poe, or BB-8, or Chewie -- but there’s desperation crackling around Anakin Skywalker (Anakin Skywalker’s  ghost  and my aren’t the dead chatty) and there’s pain in his eyes, and it speaks to that deep, glowing part of Finn that the First Order was never able to touch, that nothing’s been able to touch.\nAnd so he runs, calling out his location to Rey as he does so, knowing -- well, hoping -- that she’ll pick up on it, follow him.\n(He hears Han Solo snap:  that’s not how the Force works!) \n \n--\n \nIt’s not too long before he finds himself plunging down a sheer icy bank, falling on his arse, snow crumbling under him -- it feels like ten thousand tiny mouths against him, biting and nipping at his bare palms.\n(He was going out for a  piss  . He’s wearing one of Poe’s old shirts and a bantha-fur coat and unlaced boots. He’s going to die of fucking  frostbite  because he can’t say no to  Darth Vader’s ghost .)\n(And yet. And yet. He’s Finn, and he makes his choice, always makes his choice, and when someone says --\n-- he’s always going to respond because of the aforementioned: he’s  Finn .)\n“Right, you need to get him out,” says Anakin, flinging a hand out, indicating a great greyish chunk of ice on which --\nOh  -- \n You are kidding me  , says Rey’s voice, sharp and clear at the back of his head.  I’m coming, I’m coming, don’t do anything stupid .\n He’s alive, says Luke’s voice, almost marvelling. And then:  is that my father? \n“Stop pestering the boy!” Anakin snaps. “Now, Finn --”\nHe doesn’t need to complete that sentence. Finn thinks of General Organa, shucks off his coat and boots, and jumps in.\n \n--\n \nThe cold knocks all the sense from his brain -- well, what little sense remained.\nHis arms are lead. His legs are lead.\nInside: that glowing pool of  something  that the First Order, that the slaughter of Ithaka, that nothing, not revolution or Empire, has ever been able to extinguish.\nFinn Organa pulls Kylo Ren to shore.\n \n--\n \n“You don’t get to die. You don’t, you don’t,” Finn pants.\nThe wet crack of breaking ribs under his hands. The  one two three  he was taught in basic training. Emergency aid. Keep going, keep going.\n“And let me tell you, my legacy is worthless. My legacy is blood and pain and two children who I should have cared for. My legacy is watching from the shadows as my grandson poisoned himself trying to become me. My legacy is murder and despair and billions upon billions dying for no reason at all,” Anakin shouts in the background. Maybe Kylo can hear him. Maybe he can’t.\n“Did your uncle ever tell you how I died? I died looking on the face of my son for the first time, after saving his life. I died breathing regret. I  gave up  . Don’t you dare do the same. Don’t you dare be like me. I died. I died, and I had to watch the universe pass by -- I couldn’t influence you, I couldn’t save my children, and I --” His voice catches. “If you want to make me proud Kylo, then you know what you have to do. You  know .”\n“Live,” says Finn. He forces air down Kylo Ren’s throat. Pumps his chest. Air. “Breathe. Breathe you bastard, breathe for your mother, for me, for the world I want to build, for a world built on novel things like  justice  and  fair trial  -- not  arbitrary lightsabre death  . Breathe because Padme hasn’t forgiven Anakin and might never forgive him because he died before he could fully make amends. Breathe because there are troopers out there who would torture First Order officers to death in my name, because I refuse to build a new world on the blood of the old, breathe --  breathe -- ”\nWith a hard, coughing splutter -- a spray of red blood -- Kylo Ren does.\n\"I can't feel my legs,\" he manages. \nFinn looks. \n\"No wonder. You don't have any. Well. Uh. They're kind of --\" He tries to think up a nice way to say burned beyond all repair and fails. \n\"My arm.\"\n\"Your arm is also gone,\" says Finn, helpfully. \"Leia cut it off.\"\n\"Deserved it,\" manages Kylo Ren. \"I -- I wanted to die.\"\n\"Yeah, well, you don't get to.\"\n\"I've done awful things.\"\n\"I know. Mainly to my friends.\"\n\"Don't you want me dead?\"\n\"No. I want you on trial. I want the republic to see that justice touches everyone. Also, and I may be wrong here, but I'm detecting a hint of regret.\"\nKylo Ren glowers. \nTries to glower. \nHis face had frozen itself onto the ice block. When Finn pulled him free --\nWell. \nYou can imagine. \n \n--\n \nBy the time the rest arrive, Anakin has gone and Finn has hauled Kylo Ren into something approximating a more comfortable position. The man is leaking blood everywhere, like he's falling apart from the inside out. \nLeia freezes. Her face is unreadable. Poe grabs her hand, and she leans against him.\nRey steps forward, ready to kill; Luke puts a hand on her shoulder, gives the barest shake of his head. \nChewie snarls. It's a chainsword sound, the likes of which Finn hopes never to hear again. \n\"I'm -- I don't want to -- I'm --\" Kylo Ren manages. \nHe's leaning on Finn. All Finn need do is step to the side -- the barest fraction of movement, and Kylo would crash into the snow, kowtowing to those he has brought such misery to. \nFinn doesn't move. Kylo Ren leans on him all the more and says, in a voice so gargled with blood that it is almost incoherent, \"Lor San Tekka. Jessika Pava. J'Tara Wren. Han Solo. Ben Solo.\"\n \n--\n \nOnce there was a boy who set himself on fire.\nHe lived.\nThe hard part comes after.\n   \n“Once there was a girl,” says Luke, “and she was beautiful. And there was a boy, and he was young, but old enough -- perhaps -- to know better and --”\nHe trails off.\nRey blinks at him. She inhales with a low, metal rasp.\nHe’s telling this story all wrong.\n“It was eleven years after the Battle of Endor,” he says, instead, “and I was thirty one…”\n \n--\n \nHe doesn’t remember what she called herself. This, he knows, is unforgivable in and of itself -- though, in his defense, she was not forthcoming with her name. She was beautiful, dark spill of hair and bright eyes, and she took him to her bed because his name was Luke Skywalker, because he was a hero, because he was a Jedi Knight -- the first of the last of the Jedi. And he was young, not in years perhaps but in life -- for he was overspilling with hope, giddy with it, singing with it, a new Academy opening up, the possibility of a new Jedi Council looming large -- he had a nephew, a sister, something approximating a family.\nAnd he had an admirer.\nAnd was it any wonder he let her take him? She was a little older than himself --  he never did find out her exact age -- and, as aforementioned, she was beautiful.\n(Luke has says this three times already. Rey’s hawk-sharp brows have drawn together.)\n(Does she suspect --)\n(He doesn’t have to tell her --)\n(Well. He does.)\nAnyway. He bedded her. He moved on. Han laughed at the story -- farmhand seduced, Jedi Knight corrupted -- and that was that was that.\nUntil --\n \n--\n \n“No,” Rey says.\nHer eyes are bright. Her hair is a dark spill.  She leaps to her feet.\n“Rey --”\n“No, no, I don’t want to hear it -- I don’t want to know. You left me.”\n“I -- I didn’t know you existed, not until you were five, you were so far away -- and then by the time I got to you Ben had --”\n“I don’t care. You left me.”\n“It was for the best! You’re a Skywalker --”\n“No. I’m not. I’m not a Skywalker, my name is Rey Organa, and I have a family and it is --” She hauls in another breath and then coughs, hard, as the apparatus jams up. “ Fuck  -- I need someone to get a look at this.” It’s sleek, silver chrome, shining bright against her skin. “It should work damn it, it should work.”\n“Rey -- shall I --”\n“No!”\nShe doesn’t hit him. She doesn’t need to. She flinches away, fast and bitter and shaking, and her cheeks are burned-red, as if scoured by sand, and her fingers flex. “You left me,” she says, again. “With --”\nAnd then: the shove. Her mind against his, demanding, and he opens up for her, permits her to scour through his memories, lets her taste first-hand his guilt, his pain, his undying shame.\n\n I am your father, and I did what I thought was right for you. By the time I knew you existed Ben had slaughtered every apprentice I had. The Skywalker name is cursed. All I wanted was for you to be safe. I didn’t know she would abandon you -- \n\n“You gave up,” spits Rey. “You gave up on yourself and on your family and you gave up, you ran away and hid, you --”\n“I did what I thought was right --”\n“You’re --” and words fail her entirely. She rubs the metal stitched into her throat until her wheezing subsides. “You’re just…” She shakes her head. “I have a family. I have a family and  it isn’t you .”\n \n--\n \n“That’s  theft .”\n“It is not! It is commerce. I buy it from someone for one price and sell it to you for another. This is the way of trade.”\n“You’re a Hutt. You’re a  criminal .”\n“My father was a criminal. I am a legitimate businessman. And,” adds Rotta, sounding more than a little pained, “I  am one of the few who will trade with you. Most are too afraid.”\n“Why?”\n“Put the gun down, child, and then we may converse like civilised beings.”\nPhasma shows her teeth, but complies.\n“Why are they afraid? We are the New Republic. We are not the First Order.”\n“The New Republic consists entirely of Resistance fighters and one-time troopers. Mainly the latter. Civilians fear you because you are seen to be the sort to -- oh I don’t know -- threaten a being with a gun when he offers you what is considered a very reasonable price?”\n“An eighty per cent mark-up on songsilk is  not  reasonable.”\n“I have had to brave the wreckage of the galaxy to bring it to you. There are pirates aplenty, and many difficulties --”\n“Tell me where the pirates are; I will have them executed.”\n“Now,” says Rotta, “ that  is the sort of talk I can support. Pirates help no one. I would invite you for tea.”\n“Why?”\n“So that we may discuss terms.”\n“Why not do it here?”\nRotta blinks. He looks to Phasma’s left, where two dozen armed guards bristle. He looks to her right, where another two dozen grin back.\n“I feel rather uneasy here. It’s a quirk of my species. We dislike guns waved in our faces.”\nPhasma waves her hand. The troops holster their weapons. They are dressed in a mishmash of white beetle-shell armour and olive-green jackets. They could be troopers. They could be Resistance. It is impossible to tell.\n(What no one will ever, ever dispute: they are all soldiers.)\n“You have fought a war and won it,” says Rotta. “Now, you must succeed in peacetime. Let me tell you this for free, Lady Phasma: winning is easy. Governing is far harder. What do you think of civilians? Truly.”\nPhasma says nothing. Her tightened lips speak volumes.\n“Well, there we go. You are a soldier; you are surrounded by soldiers; and yet you must learn to work with those who are not.”\n“Very well. We will retire to my quarters.”\n“Excellent.” Rotta undulates after Phasma. “Civilisation can be won with the blaster, but not kept with it.”\n \n--\n \nThe Hutt brings novelties with him, like a soft-skinned Twi’lek girl who has no discernible purpose other to stand around, look pretty, and occasionally flick one of her long tentacles over her shoulder.\nTwo Sevens does not understand.\n“You cannot fire a blaster?”\n“Well,” says she, fluttering her lashes, “No. But I can use my hands for  other things .”\nShe lifts the hands in question. They are green. The nails are long and gold.\n“Like medical aid?” says Two Sevens.\n“Like…” The girl blinks a few times. “What did you say your name was?”\n“Two Sevens. And you are?”\n“Jayda. Rott calls me Pumpkin Pie. I’m his bride.”\n“Congratulations.”\n“He’s away a lot. It does get  frightfully lonely.”\n“I am sorry. You accompany him now, though.”\n“I wanted to see what sort of revolution the troopers had organised,” she says. One gold-bright nail trails along Two Sevens’ chest plate. His head quirks on one side. “All these big, strong soldiers.”\n“Yes.”\nHe looks at her finger. She looks at him. Then, with a huff of irritation, she stands up. “I must find my husband.”\n“Good luck,” says Two Sevens.\nCivilians, he decides, are very strange.\n \n--\n \n“What’s the point of her then?” Two Sevens asks Bren. “All she does is stand around and complain.”\nBren tells him.\nTwo Seven blushes from jaw to brow. “ Oh .”\n \n--\n \nThe strangeness of peace, thinks Phasma. There is time for luxury. For clothing of soft pretty fabric, for Twi’lek girls with long nails, for scents and jewellery and good food. She has no taste for it, but many of her troopers do, and soon she finds herself facing up to a trooper named Ceasefire and saying, “You’re getting fat.”\n“I --”\nHe does not look happy.\n(This is an understatement. Phasma may not be Captain Phasma anymore, and she does not shoot people for insubordination, but she is still Phasma, the hard-featured, undisputed leader of the troopers and so, yes, they fear her. As they should. And they love her. As they should.)\n“You are not the first. You will not be the last. We are soldiers, still. We will always be soldiers.”\n“The war’s done,” says Ceasefire.\n“Yes. But we cannot afford to be complacent. The Other New Republic was complacent, and they burned up.”\n(That’s a story there.  Once there was a Republic founded on war and they forgot the rules of war, they forgot what had bought them their freedom, and so they burned up. )\nPhasma is not yet accustomed to giving lessons via stories. She says, instead, “Lose the weight. I’m starting drills. They are not obligatory.”\nHere’s something the troopers learn quickly: when Phasma says that something  is not obligatory  it is a good idea to consider it obligatory.\n \n--\n \n“So, uh,” says Finn, “you trade all over the galaxy?”\n“That I do,” says Rotta the Hutt. Rotta is a glutinous thing the colour of a fresh bruise. He’s considered a prodigy by Hutt standards; barely seventy years old, slithering along the straight and narrow and (largely) legal path that his darling Daddy never managed to navigate.\nFinn likes him.\n(To be honest, Finn likes everyone.)\n(Almost everyone.)\n“And if I gave you something, you could send it off everywhere?”\n“For the right price.”\n“I don’t have any money.”\n“The price does not need to be in money,” says Rotta. Finn thinks of metal bikinis, chains and flushes all over. Rotta’s laugh sounds like swamp bubbles popping. “No, not that sort of thing. I deal in the currency of reputation.”\n“Uh, okay…”\n“What do you wish to be sent out?”\n“Um. It’s probably easier if I show you”\n \n--\n \nThere’s a painting on the side of the barracks-turned-courthouse.\nIt’s Rey.\nShe’s caught in the instant before saying something, lips parted, curving up into a smile. Her throat tapers into metal, smooth and gorgeous, and she’s in grey silk Jedi robes, and her lightsabre is green as any meadow.\n“She’s lovely,” says Rotta. “You are a lucky man to have her.”\n“I know. But-- look at her. So, when they started painting us we looked like soldiers. And now they’ve started drawing us -- me and Rey and Poe -- like we’re human. We’re smiling. Happy. You know? And that’s how I want the universe to see us. That’s the story I want to be told.” Finn sticks his hands in his pockets, hunches his shoulders. “The story of us, together, and of the Stormtroopers together -- of FN-2187 who was a Stormtrooper and who made friends and fell in love and, uh, of Stormtroopers who said they weren’t going to kill anymore and of how the First Order actually fell, how it collapsed in on itself, because we stood together and stood as friends and --” Finn trails off.\nRotta plants a supportive, if slimy, hand on his shoulder.\n“Propaganda,” he says. “It is a vital part of any society.”\n“The  truth ,” Finn snaps.\n“A truth,” Rotta comprimises. “I think I can help you with this.”\n \n--\n \nKylo Ren remembers.\nThe woman was known as Fulcrum. She was fast, but not fast enough, and fell in two neat halves and as she died --\n\n “No Snips, no no no, no oh Force -- oh Ben, what have you done --” \n\nKylo Ren remembers.\n(Ben what’s wrong. Ben what are you doing. Ben why are you locking the doors why are you why are you)\n( Master Skywalker there’s too many of them --) \nA choice, always a choice.\n(No please don’t but I must yes I must the draw of the Light is too strong they call me Jedi Killer they call me they call me  they call to me )\n(Ben please. Ben please I thought you were my friend Ben please Ben What Are You Doing Ben there’s so much blood Ben why are you doing this please Ben please)\n(My name isn’t Ben.)\n(It’s Kylo.)\nKylo Ren remembers.\n(I love you. I love you Ben, I love you, I’ll help you)\n(Mummy I had a bad dream.)\n(What was it)\n(About the dark)\n \n--\n \nOnce there was a boy called Ben Solo.\nHe grew up.\nHe did not die. He changed. He did not die it would have been easier if he had done because death, at least, is catharsis but he’s not dead, he’s strapped to a medical gurney undergoing surgery on the good ship  Solo  because Leia refuses to put him on Persephone because if he got loose, if he killed even one of her soldiers, one of her pilots then --\nThere’s a file in her hand. The name at the top reads POE DAMERON-ORGANA.\n \n--\n \n“What do we do with him?”\n“Put him on trial, the same as the rest.”\n“It’s different.”\n“Because he’s your son?”\n“Do you really think that little of me, Poe?”\n“No General. No I don’t. I -- he’s killed so many people.”\n“I know. So have I. So have you.”\n \n--\n \nAn encounter Poe is trying not to think about:\n“Tell us a story, Mister Dameron!”\nHe lifts the smaller of the children onto his hip. She clutches at his hair.\n“How about the Battle of Endor?”\nHe tells the story. He makes appropriate sounds, mimicking X Wings and TIE fighters and BB-8 chitters like an Ewok, and at the end he does as his mother used to do, pattering the points of his fingers onto the girl’s head.\n“And the drums rang out, for the Empire was no more!”\n“But --” The girl’s eyes screw up, in the way of children everywhere when they are thinking terribly hard. “But what about the troopers?”\nAnd then Poe remembers. He’s on Persephone. The child in his arms was a Stormtrooper. Her eyes are wide and she doesn’t look excited.\n(They used Stormtrooper helmets as drums.)\n(His mother had told him this as well.)\n(He had giggled in delight at the image.)\n“Uh...well,” he says, and shifts the child to the other hip, “most of them switched sides. To our side. To the good side.”\n“No they didn’t,” says the boy at his feet. “They were loyalist scum, and they died.”\n“Did they?”\n“They died, yes. But they weren’t scum. They, uh. They were fighting for what they had been told to fight for. And, later on,  they would rebel. How about I tell you that story instead?”\nThe girl nods enthusiastically, so Poe tells the pair the story of FN-2187 who had been a Stormtrooper. He tells her of how Finn fell in love, of how the rebellion spread through murmurs and stories. He tells them of brave, noble Rey.\n(BB-8 mimics her breathing: that low metal rasp. The girl laughs for joy, and the sullen boy grins.)\nHe tells them of the general Leia. He tells them of how Finn liberated troopers from the slave camps in the T’Sara system. He tells them of how you can name yourself whatever you want, and how no one will ever have a number ever again. He tells them all of this, and when he has finished both have forgotten the Battle of Endor. Both are trying -- with limited success -- to make Rey’s breathing noise.\n(Every generation has a story.)\n“And when you hear that noise,” says Poe, “I want you to think of Rey. Think of how brave she is, and how good. Think of how she protected her friends, how she got her throat --” he pauses, thinks that  throat ripped out  is probably the wrong phrasing for children, no matter their origin, and says: “  hurt  . She did it because she loved her friends, because she wanted to care for them, because she was willing to do anything for them. And that is something we  all need to aspire to .”\n \n--\n \nThe girl’s name is Rozetta. She tells the story to her friend Songbird, who tells her teacher Fiver, and Fiver tells Shot-At-Dawn and Shot-At-Dawn tells Reyma Kiltjael. By the time the story has got that far, the impression has improved drastically, and Shot-At-Dawn uses a metal comb and a glass of water to convey it accurately.\nReyma smiles. She’d testified at Cass’s trial, and she’d sat in at General Asric’s and seen justice done twice over, and this is how the New Republic is built, on trials with evidence and sentences and justice, and the troopers are starting to understand. And Shot-At-Dawn tells her the story of a girl whose heart is ninety per cent of her bodyweight, a girl who you always hear coming, a girl who lived because of the metal in her throat.\n(There are many, many troopers with wounds like that: torn throats and missing limbs and they are alive, they are alive because the Resistance believes in keeping soldiers going even when they can no longer fight -- and so these troopers hear the tale of Rey and to them the sound of her breath is not just the sound of victory but the sound of hope, because she could have died and did not, because they saw fit to keep her alive.)\n \n--\n \nOnce, Rey was silent. She stole over deserts and between scrap and garbage as shadows do, slipping quicksilver slick into places where no man could follow. Once. And now she isn’t, and now you can hear her coming, always hear her coming, especially when she is upset and weeping and her breathing buzzes like a swarm of wasps caught in a droid.\nLike Vader’s did.\nCorrection: like her  grandfather’s did.\nSometimes, there is nothing worse than getting precisely what you wanted.\nHer feet carry her through the camp, through the alleyways and tucked-away places, the hiding places, the places she makes a point to know -- because she was a scavenger, and she lived so long because she knew where to hide where no one could find her. Finally she finds somewhere small and safe and secret, between two weapons dumps, where the air is acrid with the reek of old blaster-fire and there’s blood rusting on the concrete and no one around.\nLuke Skywalker is her father.\nShe is a Skywalker.\n“No I am  not . I have a family, I have a family, and it’s not the -- it’s not the ones who left me to rot on Jakku, it’s not, it’s not -- it’s --”\nHer breath catches.  Snags .\n“Lady Rey?”\nShe looks up. There’s a girl. She seems vaguely familiar but Rey’s not Finn, and struggles with all the names. This one is small, and looks frightened.\n“Just Rey. Uh.”\nHer eyes are puffy and red-rimmed and her breathing is  hideous . She sounds like she’s gargling with bloody gravel.\n“I -- I’ll go --”\n“No, don’t worry.” The girl, bizarrely, is smiling. “Can you stay? It’s just...it’s nice.”\n“What’s nice?”\n“Hearing your breathing. We never quite get it right.”\n“What do you mean?”\n“When we tell the story -- your story. It’s nice to hear it. It’s comforting. It means hope and…”\nAnd then: “Are you crying? Please don’t cry.”\n \n--\n \nLet me tell you about the Force.\nIt eats up its own, Dark or Light, because it is dumb animal hunger and all the humanity of a storm.\nOnce, there was a boy. He dedicated himself to the Light.  He did everything right. He was alone all his long, long life.\n  \n--\n \nKylo Ren has spent his life not listening to his grandfather.\nThe machines whirr and start to sing out alarms as his heart-rate plunges.\n“You bastard, you live, you live -- you have to live -- you have to face what you’ve done! You don’t get to die, you don’t  deserve  to die -- you don’t get to, do you hear me?”\nFortunately, he has picked an excellent time to  start .\n \n--\n \nIf you live long enough, you see the same eyes in different faces.\nThis can destroy a man.\nLet me tell you about the Force.\nIt is hunger. It is wild. It is bloody mawed fury and it is the gentle touch of a mother’s hand -- it is everything, and in everything, and the only constant is that it eats up those who embrace it, eats them to nothing and licks the bones clean.\nLight or Dark, right or wrong, they all burn up in the end. This is the way of the world, you know.\nThis is what it is to be Obi Wan: you have seen the same eyes in different faces too many times. You know that those who set fires are always eaten up by them in the end. You know that things come in cycles, that the past always repeats -- sure as tide on the shore -- you know that the best and bravest man you knew chose to fall to the Dark Side, and you know that his son chose to hide rather than face the pain of his nephews betrayal.\nThis is what it is to be Obi Wan: you have forgotten the rest of the story.\n \n--\n \nAboard the  Solo , Kylo Ren undergoes his fourth surgery.\n“If I wanted,” says Leia. “I could give him bio-mechanics that didn’t quite fit, that always hurt him, that meant he would never be able to fight again. I could, if I wanted to -- if I ordered it -- ensure that he was always crippled, never a threat. I could have some implants put in that would explode if triggered. I could.”\nLeia looks up at Phasma.\nPhasma says nothing. Instead she reaches out and takes Leia’s hand. Leia hesitates, just for a moment, before squeezing back.\n“I could,” says the General. “And I won’t.”\n“And that’s the point,” says Phasma. “You could be that woman, and you’re not.”\n \n--\n \nSome wars continue. Some end. Three days after the return of Kylo Ren to Persephone, Osma and Snap announce their pending nuptials.\n(That is: they announce them in the morning; by the evening the party is in full swing.)\n(The end of war is a catalyst for all sorts of things. Joy. Pain. And, of course, weddings -- which are both of these)\n“I am not well-trained in interrogation methods,” says Archer, once Colonel Archer of the First Order, named Brendol after the man his father fought alongside, now known to many by the unfortunate nickname of ‘Our Bastard’ due to his aforementioned lamentable career choice. “But I will start by removing your genitalia with a hackblade and busk it from there. And then, when you’re a mewling and bloody wreck, I would burn all you love to the ground.” He pauses, then lifts his glass. “But I am assuming that you will  not  hurt my Osma, because you will be a worthy husband to her -- I simply wish to illustrate what I, what  we , would do to you if you did.”\nFinn’s not been to many weddings -- to any weddings in fact -- but, judging by the strained look on Poe’s face, Best Man’s speeches are not meant to include graphic threats of violence.\n“To the happy couple! Anyone else?”\n“Uh, only one person is meant to speak --” starts Snap, but he’s drowned out by the exuberance of Reyma, Osma’s former squadmate.\n“If you hurt her,” she says, bouncing to her feet, “I’ll vivisect you.” She’s ruddy-faced and grinning, slopping wine onto her hand as she brandishes her cup in a toast. “To the happy couple!”\nShannah Yzetta, not to be outdone, is the next to stand. “If you ever hurt him,” he trills, “I’ll strap you to the outside of my X Wing and orbit the planet a couple of times until you’re all blown up and dead. To the happy couple!”\n“Is this tradition? The threats?” says Phasma to General Organa.\n“Uh. Well. It seems to be now?” says Leia. Kylo Ren is recovering. Soon he will be strong enough to stand trial.\nBut now, right now, Poe leaps onto his chair and starts a lengthy discussion of the strange and varied tortures he would subject Osma to in the event of her infidelity.\nLeia has learned to compartmentalise. She was a princess, then a diplomat, then a general.\nHere, there is life. On board  Solo  is life of another kind. Both hold pain and fire, and both should be valued.\n“I approve,” says Phasma. “It demonstrates the strength of the bond they have to their squadmates and reassures the couple that they will always be cared for, and that they may have chosen a partner and started a new life but they will not leave the old behind.” She nods once, decisively. “I will not speak, for I am not of her unit, but know that I too would skin alive the pilot known as Snap should he harm my trooper.”\n“And I’d shoot Osma if she hurt Snap.”\nThey exchange a brief smile.\nPoe concludes his toast: “...and then they would  lick all the honey out of your hair  and that would  tickle . Enough chatter! Let’s get pissed!”\n \n--\nFinn’s drunk. Well. He thinks he is. He feels all  fizzy,  warm and bubbly and everything has a slight haze to it. There’s a glass of something blue and glittery in his hand, and Poe is trying to teach Archer to dance which is  hilarious because the one-time Colonel has all the agility of a dead plank of wood and Poe --\nPoe --\nPoe is  undulating  , spinning and grinding his hips in a way that is outright  obscene . Finn flushes at the sight, thinks of long nights spent with Poe’s and Rey’s hands on him.\nArcher’s pale face is ruddy-red, and Poe’s got him by the waist,  rubbing on him.\nA hot pang of jealousy lances right through Finn. It’s illogical, he knows, but Archer is so  pretty , all sharp cheekbones and ghost-grey eyes and the sort of smile that suggests he knows exactly when the world is going to end.\nHe downs his drink, and strides over, interrupting Poe mid-thrust.\nPoe immediately slings his arms around Finn’s shoulders and kisses him, hot and hungry and just a little too much for public.\nArcher bursts out laughing. His hair is, as ever, an absolute mess, sticking up in deliberate defiance of the First Order’s protocol. “I’ll leave you ladies to it,” he says, and wanders off to resume his effort to get Shot-At Dawn into his bed.\n“Hi,” says Finn, softly, once the kiss is done. Poe smirks at him, stamps a kiss to the corner of his lips. “Missed you.”\n“Missed you too,” says Poe. His breath is warm and sweet and this is half of Finn’s victory, right in his arms.\n“Let’s get Rey,” he says. Then: “Where is she?”\n \n--\n \nNo one dances on Jakku, but Rey is determined not to be left out so she improvises a style best described as ‘fighting ten thousand enemies at once’.\nDespite her outright hazardous approach to dancing, she’s not lacking for partners. Each one of them wants to listen to her breathe, ear to throat, hands on the sleek metal, and her skin is warm all over, the Force slick and fast over and in her, and she’s Rey Organa who is  not a Skywalker.\nAnakin killed children, she knows.\nHe  killed children . How can anyone forgive him that?\nOnce, she thinks, there was a girl and she got what she wanted: a family. And then she got another one, only she didn’t want that one, because she already had one and the other family was bloody and broken and carried with it a hideous legacy and she did not want that. She did not want that at all. She did not want a legacy that was not hers, because she had only just got her  own  legacy and that was hard enough.\nHere she is: a girl with a heart that could hold the universe, and breath that sings troubled troopers to sleep.\n Once there was a man  , says a voice in her head,  and he made a mistake .\nThen:  I am not going to run from this. We need to talk. \n \n\n -- \n\n \nOnce, there was a man. He ran so fast and so far and found himself right back where he started\n“I’m your father. I love you. I failed you, and I’m sorry. I’m going to try each and every day to make it up to you. I am never going to leave you again.”\n(Not-leaving: the deepest sign of affection you can give anyone, especially Rey.)\n \n--\n \nLeia leaves the celebrations because she must, because she is a mother, because Kylo Ren is her son, was always her son.\n(Once, there was a woman. She saved her children, even though it burned her alive.)\n“I sentence you to exile.”\nNo prison can hold him, if he does not wish it to. Besides. Prison is not right for him, this burner of galaxies. This Jedi Killer. This frightened, angry child.\n(Once, there was a man. He saved the life of a great warrior and the great warrior pledged a life debt to him. The man died. The great warrior fulfilled the life debt in another way.)\n(Dying is easy. Living is hard. Fighting a war is easy. Governing is hard.)\n “I will take him to Kashyyyk, where he might begin to atone for his crimes.” Chewie claps a great hand to Kylo Ren’s shoulder.\nThis is Kylo Ren: more metal than man. His legs are sleek chrome, plated and jointed, flexing perfectly -- covered with cloth you cannot tell that they are false. His face is another matter. It has not healed fully. Bits of it are still wet and red.\nHalf of it -- the half that can move -- shapes what could be a smile.\n“You will not return,” says Leia.\n(It burned her alive --)\n“Not now, and not ever.”\n(--she saved her children.)\nKylo nods, once, and that is it.\n(Once there was a woman, and she had more children than she ever knew.)\n(She did not fail them.)\n \n--\n \n“Dance with me.”\n“I cannot dance.”\n“Not a good enough excuse. Come on.”\nLuke takes Rey’s hand.\n \n--\n \n“Do you think I have a chance?” says Phasma to Poe. They sit by a great bonfire, flames reaching for the stars, and Poe can still taste Finn on his lips. He’s aching for Finn, for Rey, but Rey is still dancing with Luke and Finn is working his way around the Stormtroopers.\n“What do you mean?”\n“Well...a General, and a soldier like me?”\n \n--\n \n\n “I will not call you Ben Solo. You have lost the right to that name.” \n\n“That isn’t my name anymore.”\n“ Nor will I call you Kylo Ren.” \n“I don’t have a name,” says the man who was once Kylo, was once Ben Solo. He’s not in pain. He should be. He  should  -- and yet he is not, not in physical pain. He is whole, and he is strong, and his breath sings unhindered out of his lungs and his heart beats on, stubborn and hard, because he is Leia Organa’s son and he wants to live. He wants to live.\n“Everyone needs a name,” says a voice.\nThere’s a man sitting opposite him. He’s got a scar curved over his left eye. He’s smiling, and it is a kind smile.\n“Grandfather,” says Kylo, almost reverently. “You’re -- why are you here?”\n“You are my legacy. You take after me more than I like. I’m not going to leave you. I promise.”\n(Not-leaving: an act of affection that Kylo Ren has finally, finally started to appreciate.)\n“I --”\n“Anyway. Names. You need one.”\n“I’m not Ben anymore. I can’t be Kylo Ren.”\n“Think of something.”\n“You tell me.” And then Kylo stops, shakes his head, and corrects himself: “No. I need to choose, don’t I?”\n“Yes. You do.”\n“Then call me Ky. It’s close enough. Maybe...maybe one day I can change it to something else. But, right now, I can’t forget Kylo Ren. I can’t forget who I was. I am ashamed of the name, but I cannot forget that I once chose it.”\n“Good boy,” says Anakin Skywalker.\n \n--\n \nThis is what it is to be Obi-Wan.\nThere is a choice.\nThere is always a choice.\nIf Anakin can make his, then so can he.\nMaybe it's time he started to remember the stories.\n \n--\n \n“I’m not crying,” Leia says, dashing tears from her eyes. “I’m not -- “\nPhasma sits beside her. Below, on Persephone, the wedding celebrations continue.\nNow? Phasma sits besides the General, and takes her hand, and she does not leave.\n(Not-leaving: an act that Leia’s life has been sorely lacking in.)\n \n--\n \nA year later, and Finn finds himself in Coruscant, dressed in swooping robes of purple and gold.\n“I still think they’re a little much,” says Rey.\nPadme, translucent but still somehow the most strikingly lovely woman in the room, says, “You look gorgeous, son-in-law. Hold your head high, don’t stare at one person for too long --”\n“I’m married to a Senator,” says Poe. “I’m married to a Senator and a Jedi, I cannot believe this.”\n“When you live long enough, you see the same eyes in different people,” says Padme. “But when you live  even longer  you realise that people can have the same eyes and be utterly different people, because there is  always  a choice. Now, Finn darling, wear the indigo bantha-leather boots -- the black ones are far too military.”\n“Yes’m.”\nFinn leaves his (absurdly opulent quarters) into sleek white corridors, only to be ambushed by the slimy embrace of Rotta the Hutt.\n“Finn the Liberator! Finn the Defector! My darling, darling ally --”\n“Finn Organa-Dameron, actually.”\n“Excellent, excellent,  congratulations -- you are all looking beautiful by the way --”\nPoe and Rey follow. Poe, in his officer’s uniform, olive green and gold; Rey in her grey Jedi silks, her new lightsabre at her hip.\n“Oh, we know,” says Poe.\n“Here you go,” says Rotta, offering a datapad, showing his latest project. There’s a billboard. It’s bigger than most buildings, towering over the shuttleport, and on it is the latest of Shot-At-Dawn’s artwork: Finn and Rey and Poe, embracing each other, smiling bright and happy, eyes glittering and no weapons in sight. Finn isn’t wearing a shirt; he’s sleek and muscled and defined in a way that is downright  obscene. \nThere’s a caption:\nFINN WANTS YOU  TO DONATE TODAY TO THE FUND FOR REFUGEES\n“We’ve raised almost a billion credits,” says Rotta. “And they’re all over the galaxy. And there’s a holoplay in production -- and the story is on every datapad in the quadrant.”\nHe tugs a slim quadrant out of his velvet coat and offers it. Finn takes it; his eye is drawn at once to the first line:\n\n Once there was a boy. His name was FN-2187 and he was a Stormtrooper… \n\n \n--\n \nThis is not the end. Stories do not end because life is a story, and life does not neatly tie itself into a bow. People keep living, and there are always battles to be fought, and revolutions always come around again. Light endures not because of one great victory but because of a series of smaller ones, battles fought in private and in the hearts and soul in the people. There will always be another fight.\nBut this is  an  end. And a start.\nChancellor Leia Organa takes her seat at the head of the New Republic Senate. Phasma, in shining chrome armour, sits behind her, ready to gun down anyone who twitches a muscle wrong. She sees Finn in a train of purple, gold collar and gold torc and purple boots, diamond glittering on his ring finger, looking a little ill-at-ease in all his finery but unable to stop smiling. She sees Poe Organa and thinks\n(she had more children than she ever knew)\nthat she will burst from pride.\nShe sees Rey, with Luke beside her, who are very much  not  the last of the Jedi. She sees Reyma Kiltjael, the youngest Senator since Padme Amidala herself; she sees Bren Archer, all decked out in olive green; there’s Shot-At-Dawn, sketching with fast, loose motions of her wrist. There’s Sekhmet, pressed up against Two Sevens’ flank like she never wants to be anywhere else.\nIt’s probably the most chaotic Senate she’s ever attended. The delegates share floor-space with those they represent, and everyone clamours for attention.\n(Chewbacca and Ky are such a long way away.)\n(She burned herself alive to save her children, but she survived.)\n“Order! Order!” she sings out, and the hubbub dies down.  \nAnd so it begins."
}