{
    "id": "5889310",
    "url": "https://archiveofourown.org/works/5889310?view_full_work=true",
    "author": [
        "demistories"
    ],
    "title": "brick walls",
    "rating": "General Audiences",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "F/M"
    ],
    "fandoms": [
        "Miraculous Ladybug"
    ],
    "relationships": [
        "Adrien Agreste/Marinette Dupain-Cheng",
        "Adrien Agreste & Marinette Dupain-Cheng",
        "Chat Noir/Ladybug",
        "Chat Noir & Ladybug"
    ],
    "characters": [
        "Adrien Agreste",
        "Chat Noir",
        "Chat Noir (Miraculous Ladybug)",
        "Marinette Dupain-Cheng",
        "Plagg (Miraculous Ladybug)",
        "Tikki (Miraculous Ladybug)",
        "Background & Cameo Characters",
        "Sabine Cheng",
        "Alya (Miraculous Ladybug)",
        "Nino (Miraculous Ladybug)"
    ],
    "additional_tags": [
        "Fluff",
        "Developing Relationship",
        "Reveal",
        "Identity Reveal",
        "SO MUCH FLUFF",
        "its actually kinda gross",
        "marinette is oblivious"
    ],
    "language": "English",
    "series": "",
    "published": "2016-02-03",
    "completed": null,
    "words": "6,559",
    "chapters": "1/1",
    "comments": "172",
    "kudos": "9,356",
    "bookmarks": "1,398",
    "hits": "100,095",
    "summary": "<p>Ladybug is sitting right behind him. <i>Marinette</i> is sitting right behind him. </p>\n<p>Part of Adrien wants to turn around and announce to her “I’m Chat Noir!” and part of him wants to keep playing this game with her. Not that she knows it’s a game yet.</p>",
    "notes": "<p>Technically inspired by and a continuation of <a href=\"https://archiveofourown.org/works/5821474\" rel=\"nofollow\">I'll Be Better Than My Worst Critic</a>, but can be read as a standalone with how Adrien found out just being sorta weak and maybe a reference or two that you might not get. But like I said, you're fine reading this without the other~ </p>\n<p>Most ideas from a convo with <a href=\"https://zoenightstars.tumblr.com\" rel=\"nofollow\">Maya</a> and this was also almost so angsty. I blame that on Maya too. </p>\n<p>I'm not in love with the beginning. I got my 'aha! I understand what I'm doing!' moment about 2k into this so...we'll see.</p>\n<p>6k of gross fluff with very minor angst because it's the love square, it's gonna be a little angsty</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Disney references for the win! And a reference to one of my favorite text screenshots of all time that I can't currently find. </p>\n<p>Fun fact: I actually wrote that 'You're Ladybug, with or without the mask part' before the last episode aired, so I was really really happy that was addressed in it! </p>\n<p>NOW WITH A HUNGARIAN TRANSLATION <a href=\"http://susielupin.blogspot.hu/2016/02/teglafalak.html\" rel=\"nofollow\">HERE</a> BY THE LOVELY <a href=\"https://susielupin.tumblr.com/\" rel=\"nofollow\">SUSIELUPIN</a> ON TUMBLR!<br>I'm on <a href=\"https://sadrien.tumblr.com/tagged/my-fics\" rel=\"nofollow\">tumblr</a> (and you can reblog this there!) &lt;3</p>",
    "text": "Ladybug is sitting right behind him.  Marinette is sitting right behind him.\nPart of Adrien wants to turn around and announce to her “I’m Chat Noir!” and part of him wants to keep playing this game with her. Not that she knows it’s a game yet.\nIt’s been a week, and she  hasn’t  noticed. How hasn’t she noticed?\nIf he’s being fair, he’s not sure how he didn’t notice either. From her hair to her eyes to her voice, it should be obvious to anyone. Plagg had said it was part of the magic, and it was just weaker for him because he was used to being around miraculous. Or something like that. Adrien hadn’t exactly been paying attention. He might have been thinking about Marinette’s laugh.\nAdrien spins around in his seat when class ends. Marinette blinks at him in surprise. He’d always wanted to know the classmate who could barely get a sentence out around him. She was so passionate and expressive around other people and everyone seemed to like her. He’d been worried that she was scared of him.\nIf he hadn’t noticed her crush, it was actually a miracle that he’d figured out she was Ladybug.\n“Hey, Mari,” he says, resting his chin on his hand. “Have you finished the essay yet?”\nShe scrunches up her nose as she closes her notebooks. “I’ve only got the first page written. But I might try to finish it tonight so I can just forget about it.”\nAlya snorts. “Yeah right.”\nMarinette elbows her. “Hey! I want a free weekend. I do not want to spend all Sunday night writing about  flower symbolism .”\n“Gross,” Nino says. “That’s gross, dude.”\nMarinette looks up from her backpack. She meets his eyes, and her eyes are such a gorgeous blue. Not that that’s what he’s focused on right now. They’re having a conversation. “What about you?” she asks. “Is your essay done yet?”\nNino starts laughing and Adrien swats him away. “I’ve been busy,” he says. “Photoshoots and other homework and my dad getting home and everything. I’ll do it tonight.”\n“No way, man.” Nino stands up. “Video games, tonight, six pm. I’m challenging you and you better be online.”\nAdrien shrugs. “Okay, maybe I won’t be doing the entire essay tonight.” He smiles at Marinette. “You’re definitely smarter than me.”\nShe blushes a little. “That’s not true.”\nAlya shakes her head and pulls Marinette to her feet. “Keep telling yourself that. It’s not going to stop being a lie.”\nShe starts to protest, but Adrien agrees with Alya. “You’re one of the smartest people I know, Marinette.”\nHer smile is enough to keep him light on his toes for the rest of the day.\nMarinette is floating on clouds. If Cloud Nine is a legit thing then she is there.\nShe’s not entirely sure what caused the change in her and Adrien’s relationship, not that she’s complaining. Sure, they’d been getting closer. He’d been over to play video games (and eat pastries) a few more times and she’d been slowly dismantling her idealized image of him, but in her mind they were only tentative friends. They had exchanged numbers but didn’t really text. They hung out in a group but not often by themselves. They would say hi to each other each morning, and most of the time that seemed to be the extent of the conversation.\nBut now. Now! Now Adrien actively seeks her out. He talks to her and  keeps talking to her. He had listened to her ramble about a problem she was having with one of her fabrics and not only paid attention, but gave her advice. He showed up a few times at the bakery just to say hi and grab something to eat. He texts her. He texts her for no reason at all.\nShe is on Cloud Nine, and that means at some point she is going to fall again, hard, but she can’t really find it in herself to mind.\nSabine lets Adrien in with a smile, immediately handing him a plate of snacks. “Go on up, she’s just working on a project. Make sure she eats?”\n“Sure thing, Sabine,” he says. “Thanks.”\nThere’s something so homey and comforting about the Dupain-Cheng home that makes him never want to leave. Something in the bright colors and smell of food cooking. In the smiles, the conversations, the laughter. The way Marinette’s parents insist on him calling them by their first names, how they always seemed willing to listen, even though he’s just some boy that their daughter is only now becoming friends with. How they trust him in their daughter’s  room . Not that Adrien would ever do anything, but if movies and books were anything to go by, that was not something that usually happened.\nIt makes going back to his actual home like going from a warm and comfortable room to jumping into ice water.\nHe knocks on her trap door. “Mari?” He imagines her kwami going into hiding as Marinette tries to make it look like she’s the only one in her room. Or maybe not, maybe it’s just Plagg who makes messes.\n“Come in!” she yells back.\nAdrien pushes the trapdoor open.\nMarinette is sitting at her desk, surrounded by fabrics. She pushes them away and smiles at him. “Hey, Adrien.”\n“Hey there, princess,” he says with a wink. He holds out the plate. “Your mom wanted me to make sure you don’t work yourself to death.”\nShe doesn’t react to the nickname or the wink, just rolls her eyes and says “She’s overreacting” as she takes the plate and puts it down on her desk. If it had been that easy, she would’ve noticed the day he found out.\n“So what are you working on today?” Adrien asks.\n“Pants,” she says. She sticks out her tongue as she holds the fabric up to the light. She hmphs as the fabric slips.\nAdrien can’t stop himself from smiling. It’s little things like this that make his stomach flip.\n—«·»—\nMarinette hopes he doesn’t notice her slight falter when he calls her princess. When did he start calling her that?\nAdrien knows he’s going to reach a point where he’s just going to walk up to her and shout, “I’m Chat Noir and you’re Ladybug and we are so oblivious!” Plagg is sort of against the idea. He says that he should let Marinette figure it out for herself. But there’s only so many hints that Adrien can drop.\nIt’s a quiet night.\nLadybug loves these nights, when nothing is happening and she can just watch the world sparkle in the darkness. It’s nice to have a patrol where she can just sit on a roof with Chat and enjoy his company.\nAnd lately, she’s found that she truly does enjoy it. Some of her best nights are spent sitting on a rooftop with Chat, letting the conversation between them ebb and flow. He has a natural humor to him, which yes, includes puns, and a warm and inviting personality. Their conversations are intimate even though they only ever vaguely discuss their lives, and each night she’s reminded of how she can trust Chat Noir with her life.\nLadybug watches the lights in the house across the street flick off.\nChat swears suddenly.\nShe blinks in surprise. “What is it?”\n“The literature homework,” he says. “I completely forgot about it!”\nLadybug knows the feeling. There have been countless times where she’s gotten too caught up in an idea or an akuma attack or just being Ladybug and didn’t do her homework. “Do you have time to do it when you get home?”\nHe shrugs. “Who knows. It’s Shakespeare and there are questions I’m supposed to answer, so it’ll take longer than I’d like. I mean, I love the Bard, but man he is wordy.” He runs his hands through his hair, making his already messy look stand out at every angle.\n\nStrange, they were doing Shakespeare in school too. “Which play?” she asks.\n“A Midsummer Night’s Dream.” Chat rubs the back of his neck. “Any chance you know what the significance of the changeling boy is?”\nShe stares at him for a moment. “…Actually, I think I do.”\n Weird that our curriculum lines up like that,  she thinks.\nAdrien decides to go an even more direct route. Apparently, using nicknames and exact questions from their homework wasn’t enough— although he really hadn’t done the homework so at least he got something out of it.\nHe drops onto the roof next to Ladybug. “How are you tonight, Bugaboo?”\nShe smiles and glances out to the Paris skyline. The city’s lights make her eyes sparkle. “I got to sleep all weekend. I haven’t been this rested in months.”\n“Relatable,” he says. “I’m so glad that Ms. Mendeleiev was out today. I didn’t really want to do anything in physics, and that means I have hours less homework than usual. Maybe I can actually get more than two hours of sleep tonight.”\nLadybug nods. “Yeah that was definitely— Wait.” She freezes. “Say that name again.”\n“Ms. Mendeleiv?” Chat asks slowly. This is good. This is progress.\nShe takes a few slow breaths. “She teaches physics?”\n“Well, math and science, but physics is kind of her  thing .” He debates whether or not he should say that it’s also his thing or if that’s too obvious. Although maybe he wants too obvious.\n“Do…do we go to the same school?” she asks cautiously.\nChat stops himself from celebrating. Celebrating always waits until everything has been finished, and they’re only part of the way there. But it’s a good thing that she’s asking this question and not just pretending that it didn’t happen, right? “I go to Collège Françoise Dupont.”\nLadybug nods. “Right,” she says, her voice distant.\nHe wonders if she has any idea who he is yet.\n—«·»—\nChat Noir has been in the same building as her this entire time?!\nHas she spoken to him? Have they been in the same classes? Are they friends? Does he know  who she is?! She needs a minute to process this. Or maybe a few days. Or a week. The rest of her life?\n—«·»—\nLadybug left shortly after her epiphany.\nAdrien can’t blame her, even as he sneaks back into his room and faceplants onto his bed. “You sure I can’t just tell her, Plagg?” he mumbles into his pillow.\n“It’ll build trust between you,” Plagg says.\n“Yeah sure. I’m sure she’ll be thrilled that I kept the fact that I knew her secret identity from her for weeks.” He rolls over. “Maybe you’re just doing this to torment me.”\n“Maybe you’re just being overdramatic.”\nIt’s been a week, and Marinette has decided to outright ignore the fact that her and Chat go to the same school. If she doesn’t, she’ll start questioning every single person in the building. And she really doesn’t need that.\nBut maybe she’s been overly focused on the fact that she doesn’t actually know what color Chat’s eyes are. That has never bothered her until now. His bright green eyes made him  him , they were distinguishing and playful and filled with life… What does he look like without such a drawing feature?\nShe’s pushing away the idea that maybe that boy over there is Chat Noir because he definitely isn’t standing right when she bumps into Adrien. Her stutter returns for half a second out of surprise. “A-adrien! Sorry, I wasn’t paying attention.”\n“It’s fine,” he says, his gaze sliding off her. He’s distracted.\n“Are you alright?” she asks hesitantly.\nAdrien blinks. “Yeah, of course. No harm done.” He smiles, but it doesn’t reach his eyes. She hates how so few of his smiles do.\n“I wasn’t talking about me knocking into you,” Marinette points out.\n“Oh.” He shrugs. “I’ll be fine.”\n“That’s not the same as being fine right now.”\nHe stares at her for a long moment. “I’m on my way,” he promises. “Thanks though, Mari. For caring.”\nHer heart melts a little bit. It doesn’t seem fair. She wants to shout that people are supposed to care. People are supposed to be worried about you and are supposed to love you and are supposed to want you to be okay! “Of course,” she says instead. “What are friends for?”\nThe word friends is bittersweet on her tongue.\nAdrien’s been hoping that she’ll bring it up. Or that hint at it. Or something.\nBut he understands that she needs time to process the idea that they likely know each other out of costume. He wants to give her the time to adjust that he’d hadn’t had. He’d had the realization and then had been thrown into a party, forced to socialize and act normal for hours. When he’d gotten home, he’d sat down on his bed and stared at the wall.\n“So?” Plagg had asked.\n“Marinette is Ladybug,” Adrien said after a minute.\n“Took you long enough,” Plagg muttered. “How does it feel?”\n“Weird.”\n“I’m sure she’ll be thrilled to hear that.”\nAdrien had shaken his head. “I’m just getting used to the idea, Plagg. It’s weird, but it also feels… It feels right.”\n“It solves your girl problem,” Plagg pointed out.\nAdrien had smiled and fallen backwards onto his back. “Yeah it does,” he said. In his mind, Ladybug and Marinette’s smiles became one.\nHe smiles to Marinette when she passes his desk to her seat. He can see the hint of Ladybug in the smile she returns.\n“You’re happy tonight,” Ladybug says to Chat.\nThere’s something about him that’s different tonight. More bounce in his step, an extra sparkle in his eye. She shoves away the part of herself that wonders how she can make him feel this way.\n“There’s this girl,” he says, swinging his legs over the edge of the roof.\n“Oh really?” she teases. She tries to keep her voice light. He’s never mentioned anyone before.\nChat smiles. It’s one of his rare real smiles that reach his eyes and make the corners of them crinkle, except for this time his eyes are soft and yearning. “She’s smart, and, and fun, and…”\nLadybug stifles a laugh. Count on Chat to make her laugh when she feels petty waves of jealousy growing inside her. “Pretty?”\n“Beautiful! She’s got these eyes that just— And this hair! Wow! And her smile!” He leans back on his hands, sighing dramatically.\n“Ami. C’est l’amour,” she says dutifully.\n“But she’s the princess! To even have a chance, I’d have to be a prince!” He shakes his head. “And I’ve got no genie to help me out in that corner.”\nShe rolls her eyes. “Finished, Al?”\nChat laughs. “My Lady, when your own words fail you, quote someone else. She’s just… Her laugh, Ladybug. I want to make her laugh everyday.”\nHer stomach twists. “You really like her, don’t you?” she whispers.\nHe sighs. “Can I be cliche?”\nThe words are tight in her throat. “Go ahead.”\nHis smile is soft again. “To the moon and back.”\n“That’s great, Chat,” she manages. “You deserve someone who makes you feel this way.”\nHe looks at her for a long moment, and she wishes she could read him instead of just getting lost in green eyes. He turns away, letting his shoulders slump. “She doesn’t know I like her.”\nLadybug frowns, and stubbornly ignores the hope that ignites in her because Chat is her friend and partner and she wants him to be happy. “How can she not?”\nChat’s smile is sad. She wants to wipe it from his face and never see it again. “Chat Noir and my civilian identity are pretty different people.”\n“So you don’t flirt with her?”\nHe shakes his head. “Not nearly as blatantly as I do with you, My Lady”\nShe takes that and holds onto it tightly. A little part of Chat that is reserved only for her.\n—«·»—\nIf he tells anyone he’s in love, they’ll just tell him he’s too young. Look at Romeo and Juliet, they’ll say. That’s what they say to others. You don’t actually know what love is, it’s just lust.\nAdrien’s argument is this: does anyone know what love really is? Can anyone really tell if love is true or not? And if someone makes him happy, does it really matter all that much?\nHe’d fallen in love with Ladybug. The superhero who had stolen his heart the first time she caught him. He’d fallen face first, hurtling toward the pavement, knowing she’d reject him but loving her anyway. She was perfect. She was everything. She was idolized. Until she started revealing more of herself around him and he realized that he was wrong to do that. He didn’t really know her. She was more than his idea of her in his mind, she was a person. He devoted himself to learning the real Ladybug, the one behind the mask, the human with flaws and mistakes who he still loved with all his heart.\nIf he dove into love with Ladybug, he hesitantly tested the waters with Marinette. He went in one step at a time, learning the patterns of her freckles and the way she giggles and how her eyebrows furrow when she’s frustrated with a design. It was slow, it was difficult, and he hadn’t even noticed until he was halfway in. The process of becoming friends had taken the longest, it was an hours long trip just to get to the water. And after all that, falling in love with her just took a little more time.\nFinding out that Ladybug and Marinette are one in the same changes everything and nothing. Adrien didn’t know it was possible to love someone enough for two people, but he did nonetheless. If anything, finding out just assured him that he really does love her.\nYes, he loves the Ladybug parts of Marinette. But he also loves the parts of Marinette in Ladybug. He loves  her , as a whole, as one person. He loves how hard she sometimes has to fight to keep her temper, how she stands up for others, how much she genuinely cares. He loves when she’s clumsy and when she’s tumbling over Paris’ rooftops. He’s in love with this wild and wonderful and daring and loving girl who’s taken him out of an empty house and shown him the entire world.\nShe’s shown him the world. She’s shown him every side of herself. Now, he wants to show her.\n—«·»—\nMarinette isn’t sure how she gets back to her room. Her legs feel week, her mind feels tired, and for some reason, she really wants to cry.\n“Tikki?” she asks, leaning against the wall. “Do you think Chat ever really loved me?”\n“Oh, Marinette,” Tikki sighs, landing on her shoulder. “The silly cat is head over heals for you.”\nMarinette covers her face with her hands. “I thought he flirted with everyone, that he told everyone that he loved them. I never thought it could be  real .”\n“Mari, it’s not your fault for not noticing,” Tikki says gently.\n“But it’s not that!” She sinks to the floor. “I was just too busy with Adrien to notice. And now… I’ve fallen in love with the cat just as he’s fallen out of love with me.”\nTikki let’s her wallow for a few minutes before saying, “You should talk to Chat about this.”\nMarinette lifts her head. “There’s someone else, Tikki. Didn’t you hear? She makes him happy, I couldn’t do that to him.”\n“But—”\n“Besides, what am I going to say to him? I might be a little in love with you, but I’m also in love with one of my friends? I’m sure he’ll be thrilled.”\n“You can be in love with more than one person,” Tikki reminds her.\n“I know.” Marinette tugs the ribbons out of her hair. “I know. It’s just… It’d never work! Chat isn’t in love with Marinette, he’s in love with Ladybug. This perfect, idealized, incredible version of me that doesn’t exist!” She throws the ribbons across the room. They flutter to the floor in an unsatisfying way.\n“Of course she exists,” Tikkis says sharpy. It’s the harshest Marinette’s ever heard the tiny kwami. “Marinette, you’re Ladybug, with or without the mask. That doesn’t change just because you aren’t transformed. Everything Ladybug is, minus her powers, is all you.”\nMarinette shakes her head and rests her chin on her knees. “He doesn’t love me, Tikki. Not really.”\nAdrien is getting sick of waiting. He’s sure there’s some part of Marinette that knows the truth, he’s just not reaching it. And Plagg is still being difficult.\nOf course, Plagg wouldn’t be able to stop him if he just walked up to her and revealed himself. But the longer he waits, the more nervous he becomes. What if she’s disappointed? What if she no longer likes him because he’s Chat? What if this ruins everything?\n\nHe tells himself that he’s overthinking everything, but the voices in his head are hard to ignore. So he just smiles at her and flirts slightly less subtly.\nWhen she figures out, he hopes she’ll somehow let him know.\nAdrien is spinning around in her desk chair. He has a pen between his lips and is frowning in a way that makes Marinette’s heart flutter. After the other day, she’s more than a little relieved that it still flutters in the same way.\nThey’re supposed to be working on a project, but during a break Adrien had gotten caught up in a puzzle Nino sent him and Marinette had a strike of inspiration. She tears her gaze away from Adrien and goes back to her sketch.\nShe makes some adjustments to the sleeves and detailings on the shirt. She’s been saving up money for a while, she might have enough to get all the materials she needs. Maybe she can get some really nice fabric for the skirt. She starts daydreaming about fabrics and patterns as she works on the hem.\nMarinette isn’t exactly sure how much time has passed before she feels Adrien’s eyes on her, she just knows she’s done three more sketches of the skirt and is starting to settle on a final design. She can feel herself blushing as she looks up to meet his gaze, mumbling, “Sorry.” She’s struck by how green his eyes are. She’s spent hours staring at pictures of them, but the fact that there seems to have been almost no color editing done on them still surprises her.\n“It’s fine.” At some point, he’d spun around in the chair and is now resting his arms on the back of it. “You’re cute when you’re concentrating.”\nMarinette blinks a few time, her blush deepening. “Oh.”\nAdrien reaches forward and tucks a strand of hair behind her ear.\nShe tenses as he turns bright red.\n“Oh, sorry sorry I just—!” He laughs breathlessly. “Your hair— Sorry sorry!”\n“Uh… That’s okay!” she says quickly. She wonders how similar the shades of their blushes are. By how hot her face feels, she’s guessing pretty close.\n“No, really, I’m sorry.” He gives her what she’s sure is supposed to be an apologetic look, but it comes out just looking worried.\n“You don’t have to be,” Marinette promises. “Don’t worry about it, really.”\nAdrien looks down at the floor. “So um, I think I have an idea for the presentation, although it might take a little bit more work.”\n\nShe’s grateful for the abrupt change of subject. “I bet we can handle it. What is it?”\n—«·»—\nThere’s something surreal about watching Marinette when she’s in her zone. When she’s concentrating her hardest but completely at ease. There’s something loving and caring in her look, even when she’s frustrated. She loves fashion and design so much, Adrien wonders how Chloé could ever tell her she wasn’t an actual designer. The way her eyes light up when she’s talking about an idea, how she bites her lip with she’s hand sewing, her gasps of happiness when something is finally working out right.\nSomething about watching her doing something she loved so much made him undeniably happy. Of course, that meant he had to lose himself and do something like brush her hair back.\nStill, what Adrien wouldn’t give to see Marinette like she is when she’s working on a design every second of every day.\n—«·»—\n“Sorry I wasted so much of your time,” Marinette says as Adrien packs up his things.\nHe frowns as he pulls his bag on. “Wasted my time?”\nShe chews on her lip. “When I was designing and you were doing nothing? We could’ve gotten a lot more done.”\nAdrien laughs. “You didn’t waste my time, Mari. We were taking a break. Besides, I like watching you design.”\n“You do?” she asks in surprise.\nHis smile is so, so familiar. But she can’t place it, because it’s making her heart melt. “Yeah! I love hanging out with you, it’s a lot of fun. I actually just like being around you in general. We should hang out together more often.”\n\nMarinette nods. “Yeah we—” His words process. She runs them through her mind a few times. Then she runs everything that had happened through her head. “Wait, did you just flirt with me?”\nAdrien’s smile widens. “Have been for the past few weeks but thanks for noticing.”\nShe laughs nervously, blushing creeping into her cheeks. “Right. Yup. Uh, why are you flirting with me?”\n\nHe raises an eyebrow. “Why do you think?” he asks with a slight smirk.\nHer breath catches in her throat. “I- I, uh, don’t know?”\n—«·»—\nAdrien is going to scream.\n—«·»—\nHis smile softens again. He touches her arm as he turns to the door. “I’ll see you tomorrow, princess.”\nMarinette waves goodbye in a daze.\n—«·»—\n“You’re going to kill that girl,” Plagg says as soon as they’re alone.\n—«·»—\nMarinette stands in the middle of the room, frozen in place.\nTikki floats in front of her face. “Mari?” She waves her arms.\n—«·»—\nAdrien buries his face in his hands. “She’s so cute,” he whispers.\nPlagg makes a gagging noise.\n—«·»—\nMarinette.exe has stopped working.\nAdrien is tired. He’s tired of school, he’s tired of modeling, he’s tired of hiding, and he’s tired of unreasonably long photoshoots. He wonders if there’s any possible way that they can just use pictures of him while he’s asleep, because he won’t be standing for much longer.\nSchool plus fencing plus piano plus basketball plus Chinese plus modeling plus  saving Paris  plus general stress takes its toll. And he needs to pay up sometime soon, because his body is ready to give out. He’s not asking for much, just a solid seven hours to sleep. At least.\nHe’s tired of not knowing if Marinette knows. Before, he’d been impatient and anxious. Now he just wants to wrap her up in a hug and say “I love you so so much and I don’t care if you don’t love me back, just let me love you and I’ll be okay.” If he doesn’t get some rest soon, there’s a very high possibility of him doing that. Exhaustion takes away his better judgement.\nHe pushes a plate of cheese towards Plagg as he stumbles into bed. His homework isn’t completely done yet, the shoot ran late, and it’s after two in the morning. He has another shoot in the morning before school. A little later in the morning, that is.\nAdrien always looks forward to patrol. He can just relax and be himself with Ladybug for a long period of time, usually with minimal akumas and fighting involved. But this week, this week patrol is all that’s keeping him on his feet.\nHis schedule is stuffed with photoshoots and rehearsals and runways and meetings with his father and lessons. To know that he has this time to just forget about all of that and run across the rooftops is liberating. It lifts a weight from his shoulders and keeps his chin above water. The fact that Ladybug will be with him makes him float.\n“Love is gross,” Plagg says.\n“I know,” Adrien mumbles.\nPlagg is quiet for a few minutes as he eats his cheese. Adrien begins to drift off to sleep.\n“As much trouble as she’s given you,” Plagg says, “I’m glad you have her.”\nAdrien smiles. “So am I.”\nFor the past few days, Chat’s been…less than usual. Ladybug isn’t sure if it’s because of the girl he had mentioned or just life, but it’s strange. Everything about him is just less. He’s quieter. He flirts less, talks less, smirks less, even moves less.\nShe’s starting to get a little worried.\nLadybug is sitting on one of the beams of the Eiffel Tower when he slinks up to her, blending into the fading light.\n“Sorry I’m late,” he says through a yawn.\n“Are you okay?” she asks, offering her hand. He takes it, and she pulls him to sit next to her.\n“Just tired.” His eyes are dull, and she can see the exhaustion in his motions. “Sorry if I’m not much help tonight, the shoot ran a lot later than expected. I was going to take a quick catnap after, but I didn’t even have time to wipe off the makeup before I came here.”\nThe first thing her mind latches onto is the word ‘makeup’. She can’t see it in the dim light, but she can’t help but wonder how it looks on him and if the makeup artist did him justice. The next word that catches is ‘shoot’. “Did you say shoot?”\nChat blinks slowly, and for a second, she thinks he might fall asleep on her. “Looks like the cat’s out of the bag,” he says with a sing song lilt in his voice. A slow smirk spreads across his face.\nLadybug rolls her eyes. “I will shove you off this Tower.”\n“No you won’t,” he mumbles, leaning against her with his eyes closed. “You love me.” He relaxes against her side and his breathing evens out.\nShe freezes for a few seconds. When she’s sure he’s asleep, she carefully moves her arm around him, holding him close so he doesn’t fall. “Yeah I do,” she murmurs as she looks out over Paris. “I do love you, kitty.”\n—«·»—\nLadybug shakes him awake when patrol is over. “It was a quiet night,” she says with a small smile when he tries to apologize. “Just promise you’ll get some more sleep?”\nChat promises, even if it’s an empty one. She has this worried look on her face that tugs on his heartstrings.\n“Good going, Romeo,” Plagg says when he releases the transformation. “You fell asleep on top of her.”\nAdrien is too tired to care. He’s too tired to be excited or worried or even feel, really. “We were on the Eiffel Tower,” he says. “That’s romantic enough.”\n“Sure.” Plagg plops down on his pillow. “Good slip of the tongue. Now she knows you do photoshoots.”\n“I just said shoots,” Adrien argues. “Maybe she’ll think…film shoots or something. I don’t know, I’m too tired for this Plagg, and don’t we want her to know?”\n“ You want her to know.”  \n“Shut up, Plagg. I know you do too.”\nPlagg groans, but stops talking.\nAdrien isn’t sure if he was dreaming or not, but when he wakes up, he remembers Plagg saying, “She loves you too, you know.”\nAlya is ranting again.\nNot that this is unusual. The subject matter isn’t new either. Ladybug and Chat Noir’s civilian identities. Marinette’s learned to hide any reaction she could possibly have to Ladybug and Chat Noir.\n“I just want to know!” Alya says, throwing out her arms. “Is that too much to ask?!”\n“Probably,” Nino says with a shrug. “Respect their privacy.”\n“I do,” she grumbles. “I’m just curious!”\n“Curiosity killed the Chat,” Adrien murmurs. His cheek is resting in his hand, and he looks like he’s about to fall asleep any second.\nMarinette rolls her eyes.\n“Satisfaction brought it back!” Alya finishes.\nAdrien lifts his head. “Let’s not test that statement with the actual Chat Noir please.” He yawns. “Please.”\n“No worries, man,” Nino says, ruffling Adrien’s hair. “We aren’t planning on it.”\nAlya crosses her arms. “I wouldn’t tell anyone,” she says. “They can trust me with their identities!”\n\nMarinette raises her eyebrows. “Alya, you run a blog about them.”\n“I wouldn’t tell anyone!” Alya presses a hand to her chest. “I swear. Cross my heart and hope to die.”\n“But they'd still be letting the cat out of the bag,” Adrien says. He blinks slowly, a smirk spreading across his face.\nMarinette scoffs and shakes her head. His puns are awful, but at least this time they’re not hundreds of feet above—\nParis.\nHundreds of feet above Paris.\n\n “Looks like the cat’s out of the bag.” \n\nThe lilting of his voice. His smirk. The cadence of the words. The way his left eyebrow had raised slightly. Even the blinking.\nHer eyes snap to Adrien’s. He’s staring at her, smirk frozen, eyes wide in surprise.\nMarinette looks down at her hands. His eyes are so green. They’re the same green as Chat’s. Which could be a coincidence.\nShe shuts her eyes. Chat’s hair is longer and messier, but only just. Adrien calling her princess. Chat calling her princess when she was Ladybug. The homework. Ms. Mendeleiv.\nHis stare.\nAdrien Agreste is Chat Noir.\nLadybug is pacing around the roof when Chat shows up.\nMarinette hadn’t said anything. She hadn’t even looked at him. She knew. She had to.\nLadybug turns to him when he lands on the roof. She stares at him, mouth open like she wants to say something, no words coming out. He keeps a bit of a distance between them, because he doesn’t know what she’s going to do.\n“The cat’s out of the bag,” she finally whispers.\nChat steps closer, releasing his transformation. He catches Plagg in his hands as he pops out of the ring. “Marinette,” he says when the green light around him fades.\n“Chat Noir.” She meets his eyes. She looks scared.\nLadybug hesitates before dropping her own transformation. A red kwami lands on her shoulder.\n“Ladybug.”\n“Adrien.”\nThey’re on a rooftop in Paris. They have all the air in the world. Why does it feel like they’re suffocating?\n“I can’t believe all it took was a pun,” Plagg mutters.\nAdrien laughs. He can’t either. He honestly wasn’t sure if it was ever going to happen. With that single comment, Adrien can breathe again. “This is Plagg,” he says lifting his hands.\nMarinette motions to her own kwami. “Tikki.” She bites her lip. “How did you…?”\n“How did I know?” he asks. “Your dress.”\nShe frowns. “My dress? What do you mean?”\n“Chloé said you weren’t a designer. And you told me about it. Twice.”\nShe closes her eyes. “So you’ve known since—”\n“Since Chloé’s party, yeah.” He pauses before adding, “I’m sorry for not saying anything sooner. I…didn’t know how.” Plagg moves from his hands to the top of his head, nestling in his hair.\n“It’s okay,” she says softly. “I wouldn’t have known how to either.”\nAdrien smiles. “You would’ve done it better than me.”\nMarinette laughs breathlessly and shakes her head. “I’m glad it’s you.” Her smile is hesitant, but it’s so real.\nHe returns the smile. “I am too.”\n“I should go,” Adrien says.\nMarinette looks over at her clock. He’s right, it’s late, but she doesn’t want him to. “You probably should.”\nThey’d finished the rest of their patrol by mostly standing in a slightly uneasy silence. It was strange seeing Adrien transform into Chat, how suddenly his posture and movements changed. Although surely it was somewhat similar for her. She knew she stood straighter and more confidently as Ladybug.\nMarinette had pulled him back to her house, dragging him through her trapdoor and shoving a cup of hot chocolate into his hands. Communication was key to every healthy relationship, and it had definitely been lacking in theirs.\nNow it was hours later and their hot chocolates have gone cold. Their conversation has gone from themselves to school to games to their families to their kwami and back to themselves. They’ve finally reached the point they easily jumped to during patrol. And Marinette is relieved. She’d been terrified that everything was going to change. At least she has this, their easy conversations and flowing banter.\nAdrien should really go. They’re sitting on her bed, the trapdoor is just above him. Neither of them move.\nThere is one thing they haven’t talked about.\nMarinette almost doesn’t want to say anything. She doesn’t want to get her hopes up like that. And she really shouldn’t. But she has to know…\n“Before you go,” she says. Her voice sounds awful and weak. “The girl you were talking about that night—” She can’t bring herself to say anything more.\nAdrien leans forward, brushing her bangs out of her eyes. “I was talking about you.”\n“Me?” she repeats. It sounds a little bit like a question, and it feels like one too.\n“You,” he says firmly. He locks eyes with her. She should’ve known him by his eyes, they stay the same brilliant green. “It was always you. Even when I thought it was someone else, it was still you.”\n“Not Ladybug?”\n“I’m in love with you,” Adrien says. “I’m in love with all of you, Marinette. Ladybug included. If you weren’t Ladybug, I’d still love you just as much as I do now. You  are  Ladybug, maybe you don’t see it, but I can see her when the mask is off. And I can see Marinette when the mask is on.”\nMarinette leans closer. Their noses brush against each other. “I’m a little in love with all of you too, Adrien,” she says. “And by a little, I mean I’m absolutely in love with you. With you, with Chat, with all of you.” She lets out a small laugh. “We made this really hard for ourselves, didn’t we?”\nAdrien nods. “Maybe a little bit.” His gaze drops. “Any chance I can get a goodnight kiss before I leave?”\nShe still doesn’t want him to leave. She wants him here, next to her, like he always has been. She presses her lips to his to try and let him know.\nHis lips are soft and warm and she’s imagined this kiss a thousand times, but it’s different in every way possible. It’s not their first kiss. It’s not perfect. But it’s real.\nAdrien presses the tips of their noses together when he pulls away.\n“Alya’s going to freak out,” Marinette whispers.\n“Nino too,” he adds. “I think they were scheming together.”\n\n“Definitely.”\n\n“How do we tell them?”\nMarinette shrugs. “I’m not sure. We could just hold hands and see what happens.”\n“Bets will be exchanged,” Adrien warns. “I know for a fact that was happening.”\n“Oh god.” She buries her face in his neck. “Was I really that obvious?”\nHe laughs and hugs her tight. “Was I?”\n“I don’t know,” Marinette admits. She pulls away. “One more kiss goodbye?”\n“If we keep doing this, we’ll be here until morning,” Adrien says, but he’s already leaning in.\nNeither of them would mind."
}