{
    "id": "614576",
    "url": "https://archiveofourown.org/works/614576?view_full_work=true",
    "author": [
        "drunktuesdays"
    ],
    "title": "cool story, bro",
    "rating": "Explicit",
    "archive_warnings": [
        "Underage"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Teen Wolf (TV)"
    ],
    "relationships": [
        "Derek Hale/Stiles Stilinski"
    ],
    "characters": [],
    "additional_tags": [
        "Major Original Character(s)",
        "Alternate Universe - Twins",
        "First Time"
    ],
    "language": "English",
    "series": "",
    "published": "2012-12-29",
    "completed": null,
    "words": "13,087",
    "chapters": "1/1",
    "comments": "385",
    "kudos": "21,589",
    "bookmarks": "4,893",
    "hits": "300,015",
    "summary": "<p>Based on a truly ridiculous conversation with Kalpurna about a hypothetical Stilinski Twins situation that ended up sounding something like:</p>\n<p>“FUUUUUUCK, is it a sweet valley high situation where Stiles is very aware that his twin is way more attractive and confident than he is, EVEN THOUGH THEY'RE IDENTICAL, and he always ends up with the hotter significant others and more friends and Stiles guesses that's why he's attracted to the pack at first, because it's something that's just his, not his twin's too. But of course, Stiles's twin gets bit and now he's part of Derek's pack, and Derek doesn't snap at him like he snaps at Stiles, never slams him into things, fucking FIGURES, STILES'S TWIN GETS EVERYTHIIIIIIIING.”</p>\n<p>Kalpurna/good ideas OTP.</p>",
    "notes": "<p>audienced, cheerleaded, beta'd, and altogether improved by shiningartifact. Thank you, darling.</p>\n<p>A delightful story cover was made by mary-mcsly and posted <a href=\"https://mari-mcsly.tumblr.com/post/40461798726/cover-for-cool-story-bro-by-drunktuesdays\" rel=\"nofollow\">here!</a></p>",
    "text": "After Brad was bitten, Stiles couldn’t stop himself from having a bit of a tantrum. \nHe wasn’t a monster. He waited until his twin had gotten out of the ER and everyone had gone home safely. Then he went out to the woods with Scott and Allison, and Stiles had a hissy fit. \n“It’s okay to be scared for your brother,” Allison said comfortingly. “You know as well as anyone how awful it can all seem. ”\n“Scared,” Stiles said, kicking rocks. “I’m not scared for him. He’ll probably be awesome at this too. He’s not even going to need training, he’ll just naturally make wolfing out seem cool.”\n“Probably,” Scott agreed, and then winced when Allison hit him “What? He’s right, Brad is good at everything.”\nStiles sent a rock flying at a tree and then fell backwards in a startled pile of limbs when Derek kicked it back. \n“What are you all talking about?” Derek demanded, staring at Stiles. “What happened?”\n“First of all, ow,” Stiles said, shaking himself off. “Second, something might have happened but we already dealt with it, so chill out.”\n“Your family was threatened, and you want me to ‘chill out’?” Derek said, his eyes flashing red.\n“The other alpha said he was sorry,” Scott said, “He just got caught up in the moment. He’s already fled the state.”\n“Yeah,” Stiles said. “He thought Brad was an Abercrombie &amp; Fitch model. Since we’re identical twins, do you think I get confused for a model too?”\n“No,” Derek said. Stiles made an indignant noise. “I want to talk to him before the next full moon.” He turned on his heel and melted back into the woods.\n“We’re still not in your pack,” Stiles yelled after him, but there was no answer. \n*\nStiles wasn’t entirely positive that Brad’s new werewolf muscles even really made a difference to his lacrosse game. Brad was sort of insanely good anyway, so it was hard to tell. \n“Good game, right?” he said, dropping down next to Stiles on the bench. \n“Yeah, it looked like it,” Stiles said, not without a touch of bitterness. “How close are you to breaking the record now?”\n“Two goals away,” Brad said, ducking his head, like he was embarrassed by this, one of his seriously ten million accomplishments. \n“Awesome, dude,” Scott said, sincerely grinning at Brad. \nBrad dug his knuckles into Stiles’s head in a noogie. “We should go out sometime and practice. You could be up there with us if you tried.”\n“Doubtful,” Stiles said, scowling. They picked up their bags and headed towards the locker room. “By the way, Derek wants to talk to you.” \n“Who is Derek?” Brad said with a sharp glance.\nStiles and Scott exchanged helpless glances. “It’s super hard to explain,” Scott said, hesitating. “He’s a werewolf too.”\n“But not a nice one,” Stiles added, and then thought about it for a minute. “But he’s gotten nicer.\" \n“Sometimes,” Scott said. “Sometimes he’s all, ‘we’re brothers, and we have to look out for each other, Scott.’ Then, ten minutes later, he’s all “I’m going to chase you through a parking garage and make you drop your milk, and then be a total dick about it.’”\n“And he lives in a subway car,” Stiles said.\n“This guy sounds like an asshole,” Brad said, flexing in the mirror. \n“Stop doing that, it freaks me out,” Stiles said, annoyed. “He is an asshole, that’s what I’m saying. He’s probably going to yell mean things at you, and push you around and---why, what, what’s wrong?”\n“I’m your older brother. You’re supposed to come to me if you’re being bullied,” Brad said, hands on his hips. He looked at Stiles, betrayed. \n“You’re older by six minutes!” Stiles scoffed. \n“Scott,” Brad said, turning to glare, “is he bullying Stiles?”\nScott thought about it. “It’s kind of hard to tell with Derek? Even his affection is pretty intimidating.”\nBrad shook his head and pulled on his clothes. “Let’s get this over with.”\n*\nOf course, Brad got on with the pack. Of course. Derek, perhaps learning from his mistakes with Scott, didn’t get really fucking intense when they walked into the train station– he didn’t yell, or shove Brad into a wall. He just shook Brad’s hand, answered a few questions, asked a few of his own, showed him where they kept the full moon manacles and backed off.\nBoyd, Erica and Isaac knew Brad from school and kept their distance at first, but Stiles honestly didn’t believe there were people who could dislike Brad. Sure enough, in no time, they were all talking and laughing, probably fucking bonding or whatever it is wolves do. \nAll of a sudden, Stiles was pissed. It wasn’t Brad’s fault that he was bitten, no one gave Brad the choice, but Peter Hale had made Stiles decide, and it was the right choice, he knew it was. It still got him hot and angry in his gut, that he’d had to make that call, that he’d had to make so many shitty, hard, decisions, that he had to fight for every inch of respect he’d ever won. \nHe was quietly seething and that’s when Derek slipped into the train seat next to him, and by virtue of proximity, became the target for Stiles’s rage. \n“All this, this doesn’t mean anything,” Stiles said. “You get that, right?”\n“No,” Derek said shortly. “What are you talking about?”\n“We’re making nice, and that’s great and all, but this doesn’t mean he’s joining your pack.”\n“Maybe you should let him make that decision,” Derek said, balling his fists on his thigh.\n“No,” Stiles said, turning to face him. “Look, I know we split the favorable genes in the pool 70/30, I know he’s...him,” and he gestured at the way Isaac was laughing (laughing!) at something Brad was saying, “but he’s still my twin brother. We’re a package freaking deal.”\n“I get it,” Derek said.\n“I don’t think you do, or--” Stiles said, but Derek stopped him with a hand pressed against his chest.\n“I get it, Stiles.”\nStiles exhales. “Okay,” he said. Derek left his hand there a beat too long before removing it to stand up and walk away. \nStiles was still sulking when they finally made it home, but Brad was upbeat and chattering about the meeting. “Derek wasn’t nearly as terrible as you described,” Brad said, as they pulled into the driveway. \n“Yeah,” Stiles said. “I guess it’s just me who gets him all mad.” \nBrad hummed thoughtfully. “Maybe,” he said, dubiously. “He didn’t smell that mad when he was talking to you.”\n“I still find that incredibly off-putting,” Stiles told him, and meant it. Whatever privacy he had left after sharing a room for seventeen years was now going to decimated further by sharing it with a werewolf. He buried the thought as too horrible to consider and quietly unlocked the door. They crept into the house, tiptoeing past the kitchen. \n“Boys,” their dad called. \n“Fuck. Busted.” Stiles whispered, turning to Brad with wide eyes.\n“Where were you guys?” his dad said, coming around the corner to lean against the doorframe.\n“Nowhere,” Stiles said, trying to keep the defensive tone out of his voice. “With Scott.”\n“You’re covered in mud,” he said. “You must have been doing something.”\n“We were outside,” Stiles said. “Mrs. McCall needed us to garden.”\n“You gardened,” their dad said, flatly. He turned to Brad, fixing him with a stare. “At night.” \nBrad was usually the first to cave, confessing all of their misdeeds when Stiles could have held out for ages. “It was too hot earlier,” he said uncomfortably. “I couldn’t find my sunglasses, so we waited.”\nThey watched as their dad seemed to deflate, looking tired and a little sad. “Fine,” he said. “Just go upstairs.” He turned and headed down the hall toward his bedroom.\n“That was awful,” Brad said when they were alone. “Does it get easier? The lying?”\n“No,” Stiles said, unhappily. “Not really.”\n“It’s weird being on this side,” Brad said. “Hearing you do it, but not to me this time.” \nStiles felt a little sick. Brad had been incredibly cool about finding out just how much Stiles had been lying to him for two years. They had never really kept secrets from each other before, but Stiles couldn’t - wouldn’t - involve him until the choice had been taken from him. \n“Sorry,” he said, inadequately. Brad waved him off, and Stiles thanked every possible deity that he was constitutionally incapable of holding a grudge. \n*\nOf course, Brad did end up joining Derek's pack. \nStiles came home from school a few days before the next full moon and found Scott already there, deep in conversation with Brad. \"Hey,\" he said, shifting his backpack strap over his shoulder uncertainly. \"I would have just driven you if I knew you were coming over.\"\n\"I just needed to talk to Brad for a minute,\" Scott said, fidgeting in the way that Stiles knew meant nothing good. \n\"Wolf crap,\" Brad said, ruefully, like he just wanted to bond over how weird everything was. Stiles kind of wanted to kick him, but instead he went upstairs, slammed open the door to their room, and slung himself sideways into his computer chair. \n\"Ssh,\" Derek said, irritated. \nStiles's heart stopped beating for a second, and then went into overdrive. \"What the hell are you doing,\" he hissed. \nDerek made a gesture that Stiles interpreted from past occasions as threatening his vocal cords. He opened his mouth anyway, prepared to shout the house down, when Derek moved faster than Stiles could react and snatched Stiles up out of the chair and back against his chest. His hand clamped down over Stiles's mouth and Stiles fought the childish urge to lick him. \n\"Quiet,\" Derek breathed into the shell of Stiles's ear. \"Brad's talking to Scott about joining the pack.\" They were both silent for a minute, and Stiles felt the heat of Derek up against his body, the edge of his belt digging into the small of Stiles's back. He was trying to stay stiff, trying not to lean into it, but there was nothing he could do about the way his heart was racing out of his chest. He could only hope that Derek would chalk it up to adrenaline. \"He wants to give it a chance,\" Derek said, and Stiles could hear the relief in his tone. \"He’s gonna try if Scott will.\"\n\"Scott won't,\" Stiles managed, muffled by Derek's fingers. \nDerek tightened his grip and hissed, \"He agreed. They're coming to talk to me tomorrow.\"\nA moment later, Scott called up the stairs, \"I gotta go. See you, Stiles!\" The door slammed shut behind him, and he heard Brad flip on the TV.\nStiles hit Derek's arm sharply, and Derek let go, backing up a few steps. \"It's happening,\" Derek said, low and intense. \"You said you and Brad, you were a package deal, so--\"\n\"Don't fucking rub it in my face,\" Stiles hissed, and he could taste the acid in the back of his throat. \"Don't, just--get out.\"\nDerek looked almost hurt for a second before his face went blank. \"I didn't--\"\n\"Just get out,\" Stiles said, no longer trying to be quiet, and he balled up his fists at his sides. \"Just stay away from me.\"\nThe sound of the TV stopped abruptly, and Derek looked sharply toward the stairs, then turned and slipped out of the window. Stiles threw himself sideways onto his bed, listening as Brad took the stairs two at a time, paused in the doorway and sniffed. \"Was Derek here?\"\n\"No,\" Stiles said, voice muffled by the pillow he was trying to drown himself in. \nBrad didn’t say anything else, and Stiles heard him leave, only to return a little later to leave something on the nightstand. It was hot chocolate, in the mug Stiles had made for their mom when he was little. Brad had made one too, a blue one with different colored polka dots and a perfectly shaped handle. Stiles's was lopsided and dented, with swirls and colors that didn't match or make sense. His mom had sworn that they were both the best things she'd ever seen. \nThe hot chocolate Brad had made was the good stuff too, not even the Swiss Miss packets Stiles was usually lazy enough to reach for.\n\"Thanks Brad,\" Stiles said quietly, and Brad ruffled his hair as he passed. \n*\nStiles avoided everyone the next day at school.\nIt wasn't easy, considering Scott was in almost every one of his classes - a fact that had seemed ideal every day before today - but he managed it. Mostly, he kept his head down, doodling in his notebook, and resolutely ignored the way Scott was trying to catch his eye.\nHe never saw much of Brad at school, so that was easy enough. Brad texted him though, halfway through last period. \"You coming with us to Derek’s?\" \n\"Detention,\" he texted back, grateful to be doing this over text, where his heartbeat couldn't be detected. \n\"OK,\" was the reply. \"Meet us later.\" \nStiles hung back when the bell rang, letting everyone leave before he ventured out. He still almost got caught, rounding the corner to see Brad and Scott slipping into Derek's car. Derek had his dumb sunglasses on, and there was a polite, restrained, almost practiced smile on his face as he greeted Brad – a smile Stiles had never once seen before. Derek didn't waste his time faking polite with him, apparently. Stiles just rolled his eyes as he watched them leave. \nThat night, when Brad snuck in through the window, tumbling into bed, he whispered, \"You still awake?”\n\"No,\" Stiles said, pulling the covers over his head.\n\"Did you cover me with Dad?\" \n\"What do you think?\" Stiles said peeking his head out to give him a level look. \n\"Thanks, Stiles,\" Brad said sincerely, and reached out with his pinky extended towards Stiles. Stiles thought about ignoring him, thought about blowing it off, but caved without much resistance, looping his finger around Brad's in the handshake they’d invented when they were six. \n\"You should have come over,\" Brad said, rolling away, satisfied. \"Derek asked where you were.\"\n\"Wasn't in the mood to sit and twiddle my thumbs,\" Stiles said, trying to hold onto his irritation in the face of Brad's openness. He imagined that's exactly how it would have gone: him watching Scott, Brad and the rest reaffirm how super awesome and badass they were, on their own little team. \n\"You know I wouldn't steal him, even if I could,\" Brad said carefully. \"You know that, right?\"\nStiles huffed. \"Scott's given me too much blackmail material over the years to abandon me now,\" he said.\n\"Yeah,\" Brad said in a weird tone. \"Scott. That's what I meant.\"\n“Dude, I know,” Stiles said, looking over at Brad, “that’s what I just said. Did you take too many head shots in werewolf boot camp tonight?”\nBrad just rolled his eyes, toeing off his shoes and pulling up the covers. “’night, Stiles.”\nStiles shook his head and sighed. “’night, Brad.”\n*\nThe next morning was Saturday, and neither of them got out of bed until almost noon. Stiles had no idea why his father let it happen - normally he was purposefully clomping down the hall outside their room by ten at the latest. \nStiles stretched in his sheets, curling his toes deep into the fabric, enjoying the stretch of his muscles. \n\"Who are you going to prom with?\" Brad asked from the other bed. \nStiles stopped stretching to look at him. He was flat on his back, arms crossed under his head, gazing contentedly at the ceiling. \"How on earth is that your first question after waking up?\"\n\"I've been up for three hours,\" Brad said, unperturbed. \"I was meditating.\"\n'Ugh,\" Stiles said and pushed the heels of his hands into his eyeballs. \n\"Answer the question,\" Brad demanded. He swung his legs out of bed, and shoved him over until Stiles let him in next to him. \"Stiles. Stiles. Stiiiiiiles. I'll call you by your real name if you don't tell--\"\n\"No one,\" Stiles said, giving in. \"God, we can't all be you.\"\n\"What does that mean?\" Brad said, offended. His shoulder knocked against Stiles's. \n\"You know what I mean, you damn hussy,\" Stiles said, but his voice lacked any bite. \"How many people in our class have you slept with now?\"\n\"I think it's tacky to count,\" Brad said primly. \"They're all special in their way.\"\n\"Hate you,\" Stiles groaned, covering his face again. \n\"You could find someone too,\" Brad said earnestly. \"It would be so easy, you just gotta let go a little. If you would just stop all the pining--\"\n\"Dude, I said I was over Lydia!\" Stiles said, sitting up. Brad sat up too, and scrubbed his hand across his face. He moved the hand to Stiles’s shoulder, leaned forward and had opened his mouth to speak when he stopped, cocking his head to the right. Stiles was just about to comment on how much he looked like the neighbor's dog when Derek slid the window open. \n\"You heard me coming,\" Derek said, a twinge of approval in his voice. ”Good.” He took in the scene, and said, \"what’s going on?\"\nStiles opened his mouth to answer, but Brad cut across him. \"We're talking about getting Stiles laid.\"\nDerek froze, eyes darting between them like Brad was kidding. Stiles punched Brad in the arm but only hurt his own knuckles. Brad just laughed at him. \"C'mon Derek, help me out here. He could grow his hair out a little--\"\n\"What, like your gross bird's nest?\" Stiles squawked, hitting him again.\n\"It's called tousled bedhead,\" Brad said loftily. \"Anyway, we're not talking about me. We're talking about putting you in clothes that fit and setting you loose on the world.\" He was looking at Derek with a challenge in his eyes, daring him to--something. Probably daring him not to laugh, Stiles thought. \n\"This is stupid,\" Derek said. \"Let's go.\"\n\"Not today,\" Brad said. \"I'm hanging out with my brother.\"\n\"Brad,\" Derek said stiffly. \"I'm not asking.\"\n\"Neither am I,\" Brad said. \"I'm spending today with Stiles.\" Stiles's hand still hurt where he had punched Brad's stupid werewolf muscles, but he was still pleased enough to dig his toes affectionately into Brad’s calf where it was sprawled across the bed. \nDerek stood there another moment, looking awkward. Brad rolled his eyes and elaborated. \"So I can only go if Stiles comes.\"\n\"Stiles has yet to want to come anywhere with the pack,\" Derek said. \n\"Stiles,\" Stiles said, emphasizing his name, \"thinks it's rude when you talk about him like he's not here. Also, when have you ever asked me to do anything?\"\nDerek stared at him. \"Every time,\" he said flatly. \"You were supposed to come with Scott, and then with Brad, but I had to hear--\"\n\"Got it,\" Stiles said grumpily. \"I'm allowed as the plus one.\" He shoved off the bed and made towards his dresser. \"Where are we going?\"\n\"He never tells us,\" Brad said, too cheerfully. \"Better wear something you can run in, maybe spandex.\"\nStiles flipped him off and headed off to shower. He heard Derek growl at Brad before he turned the water on. Dude needed to lighten up.\n*\nDerek's secret destination was a clearing two towns over that was bordered on one side by a jagged cliff. \n\"First one to reach the top gets to keep what's up there,\" Derek said lazily, as they all climbed out of the cars. \n\"What are we, twelve?\" Jackson said, grumpily. \"I thought this was going to be a serious training.\"\n\"It is,\" Derek said. \"Climbing is a serious skill. So is learning better hiding places for the embarrassing shit you idiots keep under your mattresses.\"\nThere was a beat of silence, and then a cloud of dust nearly rose up in their mad dash to get to the top and protect their secrets. \nStiles sprawled out in the grass to wait for them to get back. “What’s really up there?” \n“A ten dollar Starbucks gift card,” Derek said, dropping down next to him. Stiles snorted out a laugh and laced his hands under his head, staring at the clouds. It was a nice afternoon, and Stiles was still kind of sleepy, so he was content for a bit to just lie there, basking. \nApparently their personalities were switched today, because Derek was a goddamn Chatty Cathy. “What Brad was saying this morning--”he bit off the rest of the sentence with a clack of his teeth. \n“No worries dude,” Stiles said, turning his head to look at him. “I’ve had seventeen years to learn the lesson that I can’t do everything Brad does, no matter what he says. Plus, finding someone he hasn’t already slept with is like finding a needle in a haystack.”\n“It’s not that you can’t,” Derek said, and he was glaring straight ahead at an old stump of a tree. “You shouldn’t. Your first time, you should be with someone you know, someone who would make it good.”\nThe lazy sleepiness of the afternoon dissipated in a second, replaced by electricity in the air and licking up and down Stiles’s spine. “What,” he said, and his voice was unsteady. “Wait, are you offering.?” He tried to make it come out like a joke, like something they could both come back from, but he couldn’t.\n“Yes,” Derek said, and finally turned his gaze on Stiles as the air was sucked completely out of his lungs. \nThere was a cry of outrage from the cliffs above him as the pack discovered the total lack of blackmail material at the top. He heard them screaming insults at Derek even as they climbed down, ten times faster than they had gone up. Derek’s intense stare wavered as they got closer and closer, and he eventually broke eye contact, standing to meet them. \nStiles closed his eyes and played dead until his heartbeat was under control. \nDerek didn’t so much as look at him for the rest of the day. It might have been because the pack was dogged about getting their revenge on him, but the implication seemed to be that it was Stiles’s move. \nThe only problem was that Stiles had no idea what Stiles’s move was going to be. He trudged after the pack down the path to the car, lost deep in thought.\nUp until the age of about seven, Stiles and Brad had been inseparable. They were full-on creepy similar about everything, to the point where even their own mom had trouble telling them apart if they concentrated on fooling her. \nThen she had gotten sick, and their dad’s eyes had gotten less bright, and things had gotten hard. And in the middle of all of this, Lydia Martin had invited Brad to her birthday party and not Stiles. \n\"I won't go without you,\" Brad had said fiercely, lying next to Stiles in the big double bed in Deputy Clarke’s guest room while their dad spent yet another night at the hospital. \"I'll tell Lydia tomorrow.\" Stiles hadn’t said anything, just rolled away and tried to fall asleep. \nThe next day at recess, Lydia had come over, all perfect curls and smiles, with an invitation for Stiles too. He'd taken it, stammering his thanks, and Brad had practically bounced home, positive everything had been solved. Stiles had stuffed the invitation in the bottom of his bag, and left it there. \nHe didn't remember much about the actual party, just all the lead up and then that it was there that he’d met Scott, his first friend that was completely separate from Brad, who didn't even really care about Brad, who never liked Brad better. He wasn't sure he'd ever met anyone else that's been true for.\nStiles climbed into the Jeep, and slammed the door. On the other hand, it was an offer for no strings sex with a hot guy who, under all his douchebaggery, Stiles knew was a good person. He was pretty sure this was the outcome Brad was looking for with all his plans for taking Stiles out clubbing. He was pretty sure that if he asked his opinion, Brad would call him an idiot if he turned Derek down.\n*\nThey made it back to Beacon Hills just before five. Stiles sat patiently through dinner, waited until his father was happily ensconced in front of the television and then yelled, hoodie in one hand and a backpack of hastily packed supplies in the other, \"I'm sleeping over Scott's!\"\nHe barely waited for a reply before he was vaulting over the front steps and into the Jeep.\nStiles didn’t bother texting Derek before he started driving. He was under no delusions that Derek wouldn't hear him coming in more than enough time to do something about it if he had been kidding. Still, his heart lurched in his chest as he approached the train depot and Derek was leaning against the wall outside. His eyes gleamed in the dim light of the setting sun, and Stiles's hands were shaking as he shut off the engine. Derek shoved off the wall and moved towards him, opening the Jeep's door for him. Stiles swallowed and unbuckled his seatbelt, and slid out, hefting his backpack over his shoulder. \n\"You're nervous,\" Derek said, closing the door behind him.\n\"You can smell that?\" Stiles asked. \n\"No,\" Derek said, wryly. \"But it's fifty degrees out tonight and you're sweaty.\"\n\"Sorry,\" Stiles said, embarrassment rising up in the back of his throat. \"I didn't know it was against the--\"\n\"It isn't,\" Derek said. \"Only, we don't have to, if you don't want.\" He looked determined, like he needed Stiles to understand that, first. \nStiles rolled his eyes. \"If you've already changed your mind then--\" but Derek cut him off again, which – rude. He would complain about it, but Derek was suddenly in his space, backing him up against the driver's side door of the Jeep until his back hit it with a dull thud. Derek's hands were around his jaw, cupping his face, tilting him enough to get better access to his mouth. \nIt wasn't Stiles's first kiss, wasn't even his first kiss with a guy, but it was definitely the first kiss that made him short circuit. Derek kissed him like he was starved for it, like he'd been waiting for it. When Derek finally drew back, Stiles had sagged all of his weight back on the Jeep, was about as capable of holding himself up as a jello jiggler. \n\"I didn't,\" Derek said, and his voice was weak, like he was startled too. \"I didn't change my mind.\"\n\"Then we're on the same page,\" Stiles said, and he was proud of getting the words out so clearly. Derek looked at him for a minute, and then leaned right back in, resting his forearms against the glass of the window, caging Stiles in to kiss him again. \nIt was a long time before they surfaced again. The door handle was sharp and digging into Stiles’s spine and his ass was cold where it was pushed against the metal, even through his jeans. The wind cut straight through his hoodie, and the parts of him that weren’t currently touching Derek pebbled with gooseflesh. The parts that were – the skin of his neck under Derek’s hands, his thighs where Derek was wedged between them, were overheated and sweaty. He desperately needed to crack his neck, to lick his lips, to unclench his fingers where they were bunched in the fabric of Derek’s shirt. \n“We could go inside,” Stiles mumbled into Derek’s mouth, but it was still another minute before Derek backed up enough to lead him in. Stiles stumbled after him, down the steps and through the unlit hallway to the train car. \n“Is Isaac here?” Stiles asked, brain finally rebooting enough to function. \n“No,” Derek said. “I told him to go out with Scott tonight.”\n“You didn’t know for sure I was coming,” Stiles said, licking away the dryness on his lips. \nDerek tracked his motion. “I’m an optimist.”\n“No you’re not,” Stiles scoffed, and was prepared to back up his argument with properly cited sources when Derek grabbed his wrist and tugged, making him stumble forward into the train car. A mattress with a ton of pillows was crammed in a corner of the car; the sheets looked crisp, like they were recently washed, which Stiles appreciated. Made the whole thing less grim. \nDerek was looking at him when Stiles finally dragged his eyes away from the mattress. His face was set, like he was preparing for Stiles to run away screaming. Optimist, his ass. \nStiles flung himself sideways onto the bed, hitting the mound of pillows with a bounce. He wiggled a little, getting comfortable. “Nice,” he commented, and he raised his hand over his head to grab the back of his shirt and pulled it off. \nDerek’s eyes darkened, zeroing in on his chest. Stiles seriously hoped he wasn’t going to stand there all day. He’d been hard since he’d left his house, and it was starting to ache. It didn’t look like Derek was much better off, the bulge clearly visible in his jeans. Still, Derek wasn’t moving, just looming, staring. “Derek,” Stiles said, raw and uncertain; and finally, finally, Derek moved.\nHis hands were like brands on Stiles’s skin. He’d look to see if there were visible handprints where Derek was touching him, but they were kissing again, and Stiles had his priorities. Derek was touching him everywhere, hands roaming up his shoulders, to his neck, down his back, hot and tight just under his ribs. Stiles squirmed until he got one of his legs free, so he could plant his foot on the mattress, knees spread wide enough for Derek to settle between. \n“Off,” he said hoarsely, and shoved at Derek’s shirt until Derek stopped kissing him long enough to strip it off. The moment he was free of the sleeves, he was diving back down, mouth drawn like a magnet to Stiles’s own. Stiles couldn’t do anything but let him, too distracted by the breadth of Derek’s back, the warmth of his skin, the way Derek shuddered when Stiles scratched his nails down Derek’s spine. \nThey took a long time getting further. Stiles was shoving his hips up into Derek’s, mindlessly searching for friction before it occurred to him that he could do something about the situation. He’d mock his own stupidity, but honestly, he couldn’t help but forgive himself, considering the situation. He magnanimously went for Derek’s belt first, stripping it open and scrabbling at the button of his jeans. Derek made a low, hoarse noise in his ear, and Stiles wanted nothing more than to hear that again. He got his hand in there, wrapping around Derek and pulling him out while Derek panted, hot and heavy in his ear. He got a few good, enthusiastic strokes in before Derek was twisting out of his grip, backing up and away, to Stiles’s horror. But Derek only moved to kick off his jeans completely, shucking his underwear off at the same time. Then he was reaching for Stiles again, and Stiles helped him unbutton his pants and they went flying somewhere over Derek’s shoulder. \n“How far do you want to go tonight?” It was the first thing either of them had said in a while, and Stiles startled at first, not expecting the question. Derek was sitting back on his haunches, between Stiles’s knees, and Stiles knew if he said it, Derek would be content just to kiss him through mutual handjobs.\n“When have I ever thought small?” Stiles said, and spread his knees farther apart. \nDerek let out a harsh breath, and his hands came up to clutch hard around Stiles’s too-warm thighs. “Are you sure?” he asked urgently.\n“Can we just stamp yes on the proceedings until you’re told otherwise?” Stiles said, trying for a reassuring smile. “It’s not like I’m shy. Also, there’s, ah, lube and condoms in my backpack.”\n“You brought your own?” Derek smirked at him. “How polite.”\n“I didn’t want to presume anything,” Stiles shot back. “I’ve seen how well-thought-out your plans are.”\nIn retaliation, Derek bit the inside of Stiles’s thigh, just a little nip, raising a mark on his skin. It didn’t really work well as punishment, and Stiles whimpered, reaching down to grab his dick and squeeze. \n“Fuck,” Derek said, voice throaty and face flushed. He reached for Stiles’s bag and dug around in it, quirking an eye at Stiles when he dumped out two full bottles of Wet and a strip of about ten condoms. \nStiles shrugged. There was no excuse for not being prepared, he felt. Derek was back between his legs, but crouched lower this time, sliding a pillow under Stiles’s hips. His breath was hot, and Stiles shivered as he felt it coast over his cock. Derek noticed, and did it again on purpose, eyes on Stiles, and Stiles huffed out a laugh at him. “Tease,” he accused.\nDerek smiled, sharp like a shark, and faster than Stiles could brace himself for it, bent his head to suck Stiles completely into his mouth. \nStiles bucked up with a shout, and Derek’s fingers bit into his hips to hold him still. “Christ,” Stiles said, shakily, relaxing into Derek’s grip. Derek bobbed his head down once, twice, and pulled off with a slick pop. “Has anyone ever done this for you?”\n“Tons of times,” Stiles said, and Derek’s eyes darkened. Stiles hoped his heart was already skipping around like a schoolgirl at recess so much that Derek wouldn’t detect the lie, but he wasn’t going to put money on it. \nSuddenly, he heard the clicking sound of Derek opening the lube, (lube tube, tube of lube Stiles sang crazily to himself to keep from tensing up or coming – both were honestly real possibilities) and then a finger, slick and cold, was pressing against his hole. \nEven as he told himself not to, Stiles stiffened, feeling every nerve in his body orient down towards that finger. Derek felt it, he had to, and leaned up to take Stiles in his mouth again. \nStiles groaned, and tried desperately to keep still, to keep from shoving up into Derek’s throat. When Derek’s finger started moving again, Stiles was better able to relax against it, distracted and too turned on to do anything else. \nDerek took his time opening Stiles up, keeping Stiles on the edge of orgasm with his mouth and fingers for what felt like forever. In the end, Stiles was begging for it, shamelessly and without restraint, tossing his head back and forth on the bed and calling Derek’s name, pleading. \nDerek didn’t move until Stiles felt well and truly mad, just making drawn-out noises that weren’t anywhere near words. Only then did he rear up, sliding a condom down over his dick, and pushed in. \nIt was honestly the weirdest feeling of Stiles’s entire life. He couldn’t categorize it as either good or bad, just strange. He was forcing himself to breathe, to hold still, to let Derek push until his hips were flush against Stiles’s ass. \n“Stiles,” Derek said – gasped, really. He was covered in sweat, braced over Stiles, eyes wider than Stiles had ever seen them. He couldn’t help but crane his neck up until Derek got the point and met him in a kiss that was hardly coherent, a kiss that was interrupted again and again by their panting breaths. “Are you okay?” Derek asked, reaching a shaking hand up to touch his jaw. \n“Yes,” Stiles strained, and he shifted around until Derek dropped his hands to grab at Stiles’s thighs, spreading him open and up for little pushes that turned into longer thrusts, when Stiles started moving with him. It was good now, better, the ache from the beginning more distant and in the background. Derek was groaning, little punched out noises that seemed to come deep in his chest with each thrust, and Stiles just couldn’t stop thinking how Derek was in him, and people did this every day. \nDerek shuddered and bucked before too long, clutching Stiles a little too tight as he shoved himself as close as he could get to Stiles and came. \n“Derek,” Stiles pleaded, so close, so fucking close and Derek swore, pulling out and sliding down again to suck him back into his mouth. This time, Derek kept his hands off Stiles’s hips, let him shove up as much as he wanted, unresisting as he worked him towards orgasm. When Stiles finally came, it was like his entire body locked up, like all his strings were pulled too tight, like everything in him exploded and when he came back down he was wrung out and destroyed. \nWhen he opened his eyes again, Derek looked smug, licking his lips in a way that made Stiles groan. “Go away,” he said weakly, flapping his hand. Derek laughed and rolled away to dispose of the condom. \n“I’m going to take a shower,” Derek said, grabbing a towel off the floor. \n“Where the hell is there a shower?” Stiles grumbled. “You live in a train depot.” Derek didn’t answer him, and Stiles was starting to feel gross, the drying sweat, lube and body fluids on him not exactly a pleasant feeling. He didn’t know if he was expected to follow Derek, to get in the shower with him, or whether fuckbuddy etiquette dictated that you just got the next turn. Without Derek’s body heat, the train car was kind of cold, and there wasn’t a blanket on the bed. Derek ran too hot to need one, normally, he surmised. \nDerek’s phone vibrated next to him, and Stiles didn’t even feel guilty about reaching for it and flicking it open. It was a text from Isaac that just said can i please come back now. \nyes, Stiles typed back, suddenly embarrassed. He didn’t want to shower with Derek, didn’t want to lie there, cold and naked on this weird nest-bed, and he certainly didn’t want to sexile Isaac any longer than he had to. \nSo he shoved his clothes back on, grabbed his bag and left. It was a long, miserable ride home. He felt young and dumb, and a little ashamed. Brad would have known what to do with Derek, afterwards. Brad would have said something, done something that would have made it all less weird. Brad wouldn’t have run for the hills like an awkward virgin. But Derek had known he was an awkward virgin, and hadn’t really given him a clue on what came next, once you weren’t a virgin anymore and awkward was all that was left.\nThe tree outside his window was much harder to scale than the werewolves in his life made it seem, but he didn’t tumble to his death at any point, so he counted it as a success. The window was unlocked as usual and he slid it open, revealing an empty bedroom. He breathed a sigh of relief, hightailing it to the bathroom to scrub his body until his skin fell off. \nWhen he finally came out of the shower, having doused himself in bodywash a zillion times, Brad was home, sitting cross-legged on his bed, laptop open in front of him. \n“Hey man,” Stiles said casually, crossing the room to his own bed. \n“Hey,” Brad said, sniffing suspiciously as Stiles passed him. “I thought you were sleeping at Scott’s?”\n“Changed my mind,” Stiles said, pulling down his covers to slide in, avoiding Brad’s gaze. \n“Did you get in a fight with Scott?”\n“No.”\n“Okay,” Brad said. “Because I saw him and Allison at Katie Zavig’s party tonight, so you must have changed your mind about seeing him completely.”\nStiles felt sore and his skin didn’t feel quite right on his body. He could still feel phantom touches, and there were things that had to be thought about, scoured over before he could finally abandon himself to sleep. Talking about it with Brad was pretty much one of the last things he wanted to do, and he wanted even less to have to summon the energy to lie his brother, the walking lie detector. \n“Go tell Dad if you want,” he said rudely and turned his back on the room. There was a sharp inhale from Brad’s side and then quiet. A few moments passed, and then the lights flicked out and there was silence. \nStiles dug his nails into his palm and wished he was a better person. \n*\nThe next morning was stilted and awkward. Brad ducked around him as they got ready, avoiding his eyes, and the more guilty Stiles felt, the more surly he got. By the time they left for school, Stiles was in an impressively foul mood – one that even Scott sensed when Stiles screeched to a stop outside his house. It was a dead silent ride. \nSchool was better, in that Stiles had more distraction, less time to contemplate his life, but then worse again when he saw Isaac, who gave him a look. Stiles didn’t want to read too much into it, but was pretty sure the look said, “I know you skanked it up with Derek last night and I’m judging you.”\nIsaac once told Scott (and then Scott immediately told Stiles under many promises never to repeat it) that his first concert had been a Hannah Montana show. Stiles held that knowledge in the front of his memory, and smirked meanly back. \nHe skipped lacrosse practice, because he was never going to play anyway, and he wasn’t in the mood to face Isaac, Scott, and Brad. Isaac probably would have told Boyd about him and Derek, so count him among the people Stiles was avoiding too. He kicked a rock and headed for the parking lot. God, he was unfit for human consumption right now. \nIt was with that thought that he reached the Jeep and found Derek lurking next to it. “Hey,” Stiles said, surprised into a friendly tone. \nDerek scowled. “You left.”\nStiles rolled his eyes. “We were done, weren’t we?”\n“No,” Derek said, eyes flashing. \n“The original offer was for a devirginizing,” Stiles said, opening the door to chuck his stuff in the back. “Job well done. Feel free to use me as a reference.”\nSuddenly there was a hand on the back of his neck, and he was yanked backwards enough for the door to slam shut, and then he was being shoved around until he was in a familiar position: his back against the car, Derek pressed close against his front. \n“I wasn’t done with you,” Derek repeated fiercely. \n“I don’t care,” Stiles retorted. His mad-for-no-reason mood that had been dogging him all day was in full force now.\n“Yeah?” Derek said, and his voice was strained. “You know everything about sex now? You’ve done it all?”\n“Done enough with you,” Stiles said, and considered stomping on Derek’s foot until he backed up. \nDerek caught it, or enough of it, in his eyes, because he backed off a little, loosening his grip on Stiles’s wrists. “No,” he said, again. “Not nearly enough.” There was promise in his eyes, a dark look that lit up something in Stiles’s gut. Late last night, Stiles had come to the conclusion that he probably wasn’t cut out for fuckbuddies, that it probably was best left to others. \nBut here, pinned under Derek’s gaze again, he thought, okay then. You’re on. \nIt was far, far more intense, the second time. Derek touched him with intent – like he was proving something, like he was storming a castle. Point proved, Stiles thought. Achievement unlocked. \nAfterward, he rolled onto his back and exhaled loudly. There was graffiti on the roof of the train car, someone's name in angles and sharp twists he couldn't make out. He stared at it anyway, waiting for his heart rate to go back to normal. \nHe was almost there when two arms slipped under him, one under his knees and one supporting his back, and lifted. \n\"What the hell?\" Stiles said, flailing wildly. \nDerek's grip never loosened and he strode out of the car and through an old door with a faded sign that said Employees Only. It was a break room of sorts, with lockers, a small kitchenette, and in the back, a shower. \n\"Oh brother,\" Stiles said, rolling his eyes. \n\"People who run off don't get to shower alone,\" Derek said, and proceeded to start a very stupid waterfight. \nStiles went home still laughing. \n*\nThe third time was pretty damn good too. \nThe fourth, fifth and sixth times happened in one twenty-four hour period, when Derek convinced him to stay over and kept pinning him every time Stiles tried to get out of bed. \nTo be fair, he hadn’t struggled that hard. Or really, at all. \nBrad didn’t say anything anymore when Stiles rolled in at strange hours or disappeared from the school parking lot, but Stiles knew he was paying attention. “Don’t pick me up from school tomorrow,” he told Derek one night, pulling his jeans back on. \nDerek frowned, eyebrows drawing together in irritation. “I thought you said your dad was working all week.”\n“He is,” Stiles assured him, hunting for his shirt among the clutter. “You can pick me up somewhere in town if I can’t get the Jeep.” Derek scowled again, like the explanation wasn’t good enough. “Hey, I’m not the genius who bought himself a super distinctive car.”\n“Who cares?” Derek said mulishly, watching him dress. “Also, I didn’t buy it.”\nStiles stopped, his hoodie dangling from his hand. “You didn’t?”\n“No,” Derek said, and he rolled his shoulders, cracking his neck. “My dad had just retired from his job, and bought it for himself as a present. My mom was pissed.”\n“Too expensive?”\n“He let Laura drive it more than he ever did,” Derek said. “He taught her to drive on it, and when she got her license, all she had to do was look at him, and he threw her the keys. My mom thought it was a ridiculous car for a sixteen year old.”\n“It’s a ridiculous car for anyone,” Stiles said. \n“Shut up,” Derek said, and drew him down into bed again. \nLater, after Stiles had been thoroughly distracted again from leaving, Derek said hesitantly, “You’d really rather that I pick you up from the side of the road?”\nStiles laughed. “Not really worried about being classy when I’m picked up for my trashy sex marathon in an abandoned train car.”\n“Okay,” Derek said, and walked him to the car. \n*\n Then there was the night Derek took Stiles on a stakeout.\n“I always wanted to do this,” Stiles said, sinking low in the seat. He was wearing a black long sleeve shirt, black hoodie, black jeans, even a pair of black sneakers, reflector strips blacked out with electrical tape. There was a black ski mask and gloves on the dashboard, just in case. \nDerek looked just like he always did. Granted, that still involved a lot of dark colors, but Derek clearly hadn’t dressed up for the occasion, which Stiles thought lacked some fun. \nLuckily, tonight was a night he seemed willing to be amused. “You always wanted to stake out someone’s house?”\n“Sheriff’s kid,” Stiles reminded him. “My dad did it occasionally, and it always seemed so awesome.”\n“It’s mostly boring,” Derek said, looking out the window toward the house where the suspect guy was watching Dancing With The Stars on his living room couch.\n“That’s what Dad always said,” Stiles said, “but I never believed him.” His stomach grumbled, and he shifted, embarrassed. He probably should have eaten at some point instead of tearing his room apart finding every piece of black clothing he owned. \nDerek reached for a bag in the backseat and unzipped it, lifting out two sandwiches and a thermos. \n“Whaaaaaat,” Stiles said, mouth hanging open. \n“Are you hungry or not,” Derek said grumpily, passing him one. Stiles hastily took it before Derek changed his mind. He braced his feet on the dashboard, glancing over at Derek as he did, waiting to be reprimanded. Derek didn’t seem to notice though. He seemed almost relaxed, unwrapping his own food and watching the house, so Stiles balanced the sandwich on his knees, cutting into the plastic wrap with his nails. \nIt was good. He chomped through it happily and nudged Derek’s arm until Derek turned to look at him. “What’s in the thermos?” he asked, mouth obnoxiously full. \nDerek’s mouth twisted with something like fondness. “Hot cocoa,” he said gruffly. \n“Fuck, seriously?” Stiles said, excited. “I love hot cocoa.”\n“I know,” Derek said, staring out over the lawn again. “Brad told me once.”\n“Oh,” Stiles said, and tried not to be too pleased by that. \nThey passed the thermos back and forth, watching this random house, in the middle of a completely boring subdivision. Derek refused to actually answer when Stiles asked what they were watching the house for, so Stiles started making up a story about the guy who lived there, and what he’d sold his soul for. \n“I’m gonna go take a leak,” Derek said, about twenty minutes in. \nStiles, thrown, stopped with his intricately detailed story. “What, in the woods?”\n“No, I’m going to break into that old lady’s house and use her bathroom.” Derek rolled his eyes. \n“Don’t act like you wouldn’t do that,” Stiles said darkly. “You’d totally do that.”\n“Only to you,” Derek said, and slipped noiselessly out of the car. \nDerek’s phone chimed while he was gone, and Stiles checked it. The message was from Erica, who said how’s the date going?\nStiles passed Derek his phone when he climbed back in. “Cover story for your absence tonight?” he asked.\n“Mmm,” Derek said. “Check the bags in the backseat, I think there’s chips in one of them.”\nStiles wasn’t hungry yet, but that kind of behavior deserved rewards. “Hey, wanna fool around?”\nDerek shot him a look. “We’re supposed to be watching the house.”\n“Better keep watching, then,” Stiles said, sounding more confident than he felt. He moved slowly, so Derek could push him off if he really wanted, but he didn’t – he barely seemed to be breathing as Stiles thumbed open his jeans and tugged the zipper down. \n“Stiles,” Derek groaned, half protest, half pleading. \n“Eyes on the suspect,” Stiles said and bent his head to take him in. \nIt was his first time giving head, much less giving head in a car. Derek’s thighs were tense under him, and his breath was coming faster now, harsh and panting. Stiles hadn’t even really started yet and he could feel Derek working himself up. It was pretty good for his previously basement-level self-confidence. \n“You still watching?” he said, pulling off for a moment. \n“Yes,” Derek hissed, and Stiles smirked, working him a few times with his hand before taking him back into his mouth, hollowing his cheeks around him. \nEnthusiasm was probably his best strategy here, and he played to it shamelessly, bobbing his head in the best rhythm he could muster. Every time Derek had done this to him, Stiles had been putty after – just wrecked – and he wanted desperately to do the same to Derek. Derek’s hand was warm on the back of his neck, and Stiles was lost in it, his world narrowed to the feel of Derek – in his mouth, on his skin, under his hands. He used just a tiny bit of teeth, just barely scraped up Derek’s cock and Derek shouted, rocking up enough to choke Stiles, shooting down his throat.\nStiles pulled off, coughing a little, and Derek reached for him immediately, pulling him bodily across Derek’s lap until Stiles was straddling his hips. “Sorry,” he was muttering. “Sorry, sorry, sorry,” but his hands were busy at Stiles’s waist, yanking his jeans open. \nHe paused when he got them open. “You even wore black boxers,” he said incredulously. \n“I am committed to stealth,” Stiles gasped, rocking his hips insistently. “Also, priorities!”\nDerek shook his head, but he got his hands on Stiles, so that was okay. It was an embarrassingly quick hand job, but how could it not be? He was only human, and it turned out that giving head made him rock hard. He didn’t know if he should feel weird about that or not, but Derek was licking his fingers clean of Stiles’s come, so it was pretty hard to concentrate on anything.\n“You stopped watching,” Stiles said sleepily, slumped into his own seat again. \n“Sorry,” Derek said. “I got distracted.” He started the car, even though the supposed suspect was still meandering around the house, in a robe and bunny slippers. \n“It’s okay,” Stiles said. “Don’t let it happen again.”\n \n*\n“You were out late again last night,” Brad said, casually perching on the end of his bed. \nStiles was sitting at his desk, chewing on a pen cap while he tried his best to murder Scott’s avatar on screen. “Hm?” \n“I’m not trying to get my head bitten off again,” Brad said cautiously. “Only, the last time you were sneaking around late at night, I got turned into a werewolf.”\nStiles winced, typed a brief message to Scott and swivelled the chair around. “I’m still sorry about that,” he said.\n“Shut up,” Brad said. “You had nothing to do with it. Tell me what’s going on with you.”\nBrad was leaning forward, elbows on his knees, broadcasting “you have my undivided attention.” Stiles caved like a house of cards. \n“Remember that thing you said the other day, about getting over myself, and letting things happen?” Stiles raised his eyebrows and gave him a significant look. \n“No fucking way,” Brad said, and held up his hand for a high five. Stiles slapped his palm, feeling equally stupid but satisfied that he could do this now, that he wasn’t eternally stuck at the kids’ table. “Details,” Brad demanded. “Who? When? Where? Not how, though. Let’s be real, no one needs that amount of detail.”\nStiles rolled his eyes at him. “I dunno. It’s not that big of a thing, I guess. It’s just this guy. It’s not going to turn into anything. I’m not even a hundred percent on whether he even likes me that much.”\n“Dude,” Brad said, managing to cram a whole lot of judgment into such a short word. \n“It’s so good though,” Stiles argued. Brad looked tempted by this as an argument so Stiles pressed on. “It’s honestly just sex. No one’s gonna get invested.”\n“You get invested in the Puppy Bowl,” Brad said, but he got up like the conversation was done. Stiles breathed a silent sigh of relief and turned back to his computer game, and Brad went back to organizing his loafers, or whatever he was doing. \nFive minutes later, Derek tapped on the window. “You get it,” Brad said, voice muffled from where his head was buried in the closet. \n“You get it,” Stiles said defensively. “He’s your alpha. He’s probably here for you.”\nBrad laughed. “Like he’s ever here for me.”\nDerek, impatient, opened the window from the outside. “If you two idiots are done,” he said pointedly. “We have a problem.” \n*\nThe problem turned out to be weird shit in the woods. Big surprise. The pack was gathered around markings that made absolutely no sense. Stiles didn’t have their heightened sense of smell, and even he knew that the footprints – wide, with too many toes, improbably shaped – weren’t normal. \n“This isn’t right,” Stiles said, and his skin crawled suddenly. “There’s something fishy about this.”\nThe words were barely out of his mouth when a woman stepped out from behind the trees and said, “So your pack does have a member with a brain, Derek Hale.” \nDerek had just time enough to growl before she reached out, curled a hand around his wrist and they both disappeared.\nThere was chaos for a second, as six werewolves all charged the same empty spot at the same time. There was screaming, cursing, and ringing for some reason and it took a minute for Stiles to realize that last one was only in his ears. He stared mindlessly for a moment at the space where Derek was last standing, with only the thought, what. \n“Stiles,” Allison was shaking him. “Stiles, listen to me.” He looked up at her, numb with shock. “I know who that was. Listen to me, I know who that was. \nThe commotion stopped as abruptly as it started, and five half-shifted werewolves turned glowing yellow eyes on Allison. She swallowed. “That was Lisa Regan. She—she was friends with my aunt.” Stiles inhaled, as he grasped what that meant, what she might want with Derek. But Allison wasn’t done. “Stiles, she’s a witch, but she’s also a hunter, a really scary one. Even Gerard was scared of her.”\n“How do we get him back?” Boyd asked, voice low and furious. \n“You can’t,” she said, back straightening with resolve. “Only Stiles and I can.”\nFor a moment there was total fucking pandemonium again. Everyone was shouting Allison down, and she was shaking her head stubbornly, firing right back. \nStiles put two fingers in his mouth and whistled as piercingly as he could. The werewolves clapped their hands over their ears immediately, and gave him resentful looks. “Why us?” he said, attention solely on Allison. \n“Because she won’t deal with werewolves. She hates them. We have a chance, a slim chance, if we go as humans, and explain that Derek isn’t evil.” \nStiles nodded. “Then we need a plan.”\n*\nHe had shaved his head for the first time when his mom was sick. Before that, he and Brad had found it absolutely hilarious to pretend to be each other. They fooled their dad with ease, their mom when they concentrated, had even done it to all of their friends at one time or another. \nThe game had stopped being funny when their mom’s eyesight started to go. She genuinely couldn’t tell them apart any longer and would cry, begging their forgiveness. It had been so hard for everyone, their dad had started to talk about limiting visits, or stopping them all together.\n“Shave it,” Stiles had said, handing the electric razor to his brother, sitting on the side of the bathtub. Brad’s eyes had been wide and frightened, but he had done it, and they hadn’t acknowledged the tears in both their eyes. \nNow, five years later, their positions were reversed. \n“Just do it,” Brad said, gritting his teeth. \n“God, shut up,” Stiles said. He wracked his brain one last time for another way, another plan, but they had gone in circles for as long as they could before hitting on this. It was the only way. \nWith a steady hand, he shaved the first stripe, and Brad’s hair began to flutter down to the floor. \nWhen it was done, they stood side by side in front of the mirror. Brad reached up, scrubbing his hand over what was left of his hair and let out a shaky laugh. \nStiles clapped him on the shoulder. “You’re gonna love the upkeep.” He twisted to avoid the punch aimed at his shoulder, and threw Brad some clothes, an exact copy of the outfit he himself was wearing. \n“Ugh,” Brad groaned. “Insult upon injury.” But he shrugged them all on, the t-shirt under the flannel under the hoodie, with crappy jeans to match. \n“Hey, I was wondering if you guys wanted--” Their dad stood in the hallway in his uniform, mouth hanging wide open.\n“Heeeey dad,” Stiles said. “We’re definitely going to clean up all the hair, if that’s what you’re worried about.”\n“No, not exactly.” He leaned against the doorframe, arms folded. “What is going on here?”\n“Would you believe Brad here was jealous of my sweet style?” Stiles said. \n“Not in a million years.” \nStiles opened his mouth to try another story when Brad cut him off. “I wanted to, Dad,” he said quietly. “Stiles and I have been hanging out a lot lately, and it made me remember how it used to be.”\nStiles looked over at him, nonplussed. He hadn’t known Brad felt that way.\nTheir dad coughed. “You kids used to confuse me all the time,” he said gruffly. “Getting me to call you the wrong name was--”\n“Ten points,” Stiles said, laughing a little. “If you were yelling at us, it was twenty-five.”\n“We kept track in a little notebook,” Brad said. “A running tally.”\n“Yeah, your mom found it,” he said. “She used to lord it over me how many more points I had than she did.” He reached out and rubbed his knuckles over both of their shaved heads. “I haven’t seen you guys this close in years. I like it.”\n“Me too,” Brad said, and Stiles didn’t have to be a werewolf to know he wasn’t lying. \n“You guys gonna be around tomorrow?” their dad said hopefully. “I have to go to the station tonight but maybe tomorrow we could order pizza, have a Stilinski men night?” He smiled at them, looking happier than Stiles had seen him in weeks. \n“Dad, we--” Brad started, but Stiles cut him off. \n“Yeah, Dad,” he said. “That sounds really, really nice.” Brad gave him a look but Stiles just shrugged at him. If they didn’t make it through tonight, missing dinner would not be the biggest problem on their list.\nTheir dad slapped them both on the back, and crushed them into a double hug. \n“All right, all right,” Stiles said, squirming. “Let’s not get carried away. It’s not like I’m letting you get meat on the pizza.”\nHis dad scowled, stepping back. \"We'll talk about that tomorrow.\" He turned to go. \"Whatever you're up to tonight, be home and asleep by midnight. School tomorrow.\"\n\"’kay. 'Night, dad,\" Stiles said quietly, watching him walk away. He and Brad looked at each other. \n“If there is a tomorrow,” Brad said, and Stiles nodded, squaring his shoulders for the night ahead.\n* \nThe plan went down like this: They had called Lisa Regan and negotiated a meeting, and she had let Derek on the phone for just a moment, to prove he was alive. \n“Don’t come after me,” Derek had growled. It was fortunate that no one ever listened to his orders. \nThe meeting place was an abandoned factory on the north side of town. She had warned them she was surrounding the place with mountain ash, and had. They were there now, standing just outside the line. Lisa stood in the doorway, watching. Clearly and carefully, Allison and Stiles stepped over the line. \nShe nodded approvingly and came forward. She waved something in the air over them, an artifact Stiles didn’t recognize, and everyone tensed. \nShe gave Allison a hard look. “Stupid girl,” she said, and expertly extracted two guns from Allison’s belt, a knife from her boot, and two daggers from her sleeves. \n“Don’t know how those got there,” Allison said, her eyes politely downcast, but she flicked them up briefly at Stiles and Stiles winked at her. \n“Well come on,” the hunter witch said, turning her back to go back inside. With a quick gesture, Stiles broke the mountain ash line and ducked sideways behind a car. Lightening quick, Brad took his place beside Allison and handed her another knife that she stowed carefully in her jacket. \nWhen they had disappeared inside the building, Stiles widened the break in the ash line, allowing the rest of the wolves to pace carefully inside and hide with him, waiting for the signal to come in. \nThere were raised voices, mostly between the hunter and Allison. “She’s not going to give in. Not until Derek’s paid for Kate’s death,” Erica said. Her voice was bitter and harsh, and she was leaning forward to speak into Stiles’s ear, careful not to attract attention. \nHe flushed a little, thinking of Derek and how he had yanked Stiles up against his body that day Brad and Scott had joined the pack, had whispered in Stiles’s ear exactly what was going on. Stiles shivered. \n“Seriously, Stiles, get it together,” Erica hissed, and he felt his face heat up and flipped her off. \nJust then a light flashed through the window, and that was Allison’s signal that they weren’t going to be able to negotiate. They all charged through the doors, but the werewolves weren’t shifting. Scott skidded to a stop, staring at his hands, obviously trying to concentrate. \nStiles stopped just outside the entrance to the factory. Derek was chained in the center of the room, slumped over, his broad back facing Stiles. He sucked in a breath, because there were cuts all over Derek that weren’t healing, like he had been whipped with something. He looked half-dead and barely conscious. \nBubbling with anger, Stiles looked for the witch. Allison was crouched low, ducking spells as they flew at her, keeping Lisa’s attention on her. Scott and Isaac were circling the other way, trying to get behind her, but the woman was too fast. She whirled and aimed a finger at Scott, and something, a spell, black and deadly, shot out of her fingertips, and Scott only just dived out of the way to miss it. When he hit the ground, Stiles heard a sickening crack and Scott cried out, holding his leg. \n“Mongrels,” she hissed, advancing. “Stupid mangy, dirty, animals,” she spit out, her face an angry mask, and she was raising her hand again. Scott couldn’t heal – he wasn’t going to have time to move, and a jolt of fear shook through Stiles. She was going to kill him.\n“Scott,” he screamed, and darted forward, but in the woman’s fury, she had forgotten Allison. In a flash, Allison had the hidden knife in her hands, and she buried it between the witch’s shoulder blades. \n“Allison,” Scott cried, urgent and scared. \nAllison raised her head and looked at him, her eyes huge and haunted. “She was going to hurt you,” she said simply, her voice ragged. Moments later, she was in Scott’s arms, and Stiles turned away to give them a moment. \nDerek was still in chains, but he was rousing, head beginning to lift from where it had sagged on his chest. Brad was leaning over him, struggling with the chains, trying to break the locks. \nStiles made his way over to help, but he’d only gone a few steps when there was a click, and Derek was free. He flexed his wrists, stretched and then reached out, and Stiles watched as he swept Brad close to his chest and kissed him, hard. \nStiles spun around, reeling, and walked out the door. \nHe was overreacting. He knew he was, he wasn’t completely stupid. Derek hadn’t known, he’d assumed it was Stiles. It was the whole point of the plan, actually. There was no reason to be hurt. \nHe was, though. Acid burned in his gut and he wanted to kick something, anything. Derek should have been able to tell, should have known. He kept seeing it over and over again, Derek holding Brad close, kissing him. Derek always treated Brad better, never acted like a dick or like Brad was exasperating him just for being there. \nHe pulled his hood up over his head and walked home. His feet pounded out his frustration, and he exhaled against the cool night air. It didn’t matter. He didn’t have exclusive rights to Derek. They weren’t dating, they weren’t even friends. The words felt wrong in his head though, and he burned with regret. He had known he wouldn’t be good at screwing around. He had known it, and let himself believe it wasn’t true, that maybe this time he and Brad could both be good at something. \n“Stiles,” someone called furiously behind him. \n“Leave me alone, Brad,” Stiles said flatly. \nThere was a hand on his shoulder spinning him around. “Your secret fuckbuddy is Derek?” Brad’s eyes were flashing and furious.\n“Yeah,” Stiles said, and he was angry, he was so angry. “But don’t worry about it. Once again, you won. Number one champ, seventeen years running.”\n“What are you talking about?” Brad said. \n“I’m talking about you. I’m talking about when I tried out for lacrosse, you became first string. I’m talking about how when I go to see my favorite band, you end up invited backstage. I’m talking about fucking werewolves, and how many times I almost died, and you breezed through it.” It was exploding out of him, and he was shaking like a leaf. “And I’m talking about how the first time I got something of my own, no matter how stupid or fake it was, I had something with Derek, and you’re the one who got to rescue him, who got the big reunion scene. So I’m telling you, leave me alone, Brad.”\n“You can’t really think that,” Brad said, and he was pale, eyes wide. “That’s not how it is.”\n“It really is,” Stiles said, and moved to storm off. \nBrad grabbed his arm, stopping him. “Did you ever stop to think that I was trying to follow you? That you just stopped talking to me, stopped wanting to be around me, you just abandoned me.” Stiles opened his mouth to refute it, to argue but Brad held up his hand. “Did you know that I wasn’t scared when that alpha bit me? Did you realize that the reason I was okay with the pack, with everything was that I thought we’d finally stop having secrets? That you’d be my brother again?”\n“I didn’t keep Derek a secret,” Stiles said. “I told you I was seeing someone.”\n“Yeah, you looked me in the eye and said no one was invested,” Brad said. “You cannot seriously be that dumb.” \nStiles blinked. “I don’t know what you’re talking about.”\n“Derek’s in love with you, you moron!” Brad yelled. “He’s been in love with you forever! You cannot mess with him like this!”\n“No,” Stiles said, shaking his head. “You’re wrong.”\n“I’m not,” Brad said, with a disturbing amount of conviction. “I’m not wrong, and you have to stop sleeping with him, for his sake.”\n“For his sake?” Stiles repeated dumbly. \nBrad just looked at him. “You asked me once how I stay friends with everyone I sleep with. First rule, never fuck someone who feels something for you that you don’t feel for them.”\n“You’re nuts,” Stiles said weakly, but the bitter jealousy had gone out of him, replaced by pure shock. \nBrad scoffed. “When have I ever been wrong?” he said. \nFucking Brad, Stiles thought to himself. “I’m sorry I stopped being around,” he said. “I’m sorry I never told you what was wrong.”\n“It’s okay,” Brad said, already losing the tension out of his shoulders. “I’m sorry you felt sidelined. I had no idea you did.”\nThey trudged back to the house in silence. He could feel Brad looking over at him a few times, but he wasn’t ready to talk, couldn’t think. He needed time. \nBut of course, when they got back to the house, Derek was right there, sitting on the steps. Brad gave Stiles a significant look, and then went inside, closing the door behind him. \nStiles dropped to sit on the stairs next to Derek. \n“I didn’t know it was Brad,” Derek said. “I wouldn’t have kissed him, I didn’t--I was powerless, I couldn’t smell him”\n“I know,” Stiles said, and he felt tired, like he’d been put through more tonight than he ever has. “We’re not together, you’re allowed to kiss whoever you want.”\nDerek hunched his shoulders, forward. “Yeah,” he said, but he sounded miserable. \nStiles couldn’t hold it in. “Brad says you’re in love with me.”\nStiles turned to watch Derek’s face and it was frozen, like that hadn’t been in his script for the conversation. There was silence for a solid minute. Then Derek’s jaw twitched, and he gritted his teeth before saying simply, “yes.”\nStiles exhaled loudly. He still hadn’t believed it when Brad had said it, but here it was, from the source. “Okay,” he said. “I didn’t know that.”\n“You weren’t supposed to,” Derek said, staring at their feet on the bottom step. “I didn’t--I knew you didn’t feel like that.”\nStiles nodded. “Brad told me I needed to stop this,” and he waved a hand between them. “He said it wasn’t fair.”\n“Do you want to stop?” Derek said hoarsely. \n“No,” Stiles said, stripped down to bare honesty. “I don’t. But we can’t be fuckbuddies anymore, not now that I know, not anymore.”\n“So date me,” Derek said. The words sounded ripped out of him, like he was saying them before he could stop himself. It didn’t make it all any less ridiculous. \n“What?” Stiles said, incredulously, already shaking his head in disbelief. \nDerek moved, grabbing his arm and pulling him up to face him. His hands came up to clamp on Stiles’s shoulders, holding him tight. “Date,” he repeated. “Not just fucking. We’ll go out, I’ll fucking buy you food, you can talk for two hours about the ending of a movie I’ve never seen, I’ll talk to your dad.”\n“You want to talk to my dad?” Stiles said, and his voice was high and incredulous. \n“Not even a little bit,” Derek said. “But I will anyway.”\nStiles’s mouth was hanging open, and Derek took advantage of it and kissed him. It was unfair negotiating techniques, because any arguments Stiles had went right out the window, even before they were formed. Derek’s mouth was insistent, laying claim to Stiles, and his hand was hot as it skimmed along Stiles’s shoulder and curled around the back of his neck. \n“C’mon,” Derek said, when they broke apart. “Let me try.”\n“Okay,” Stiles said, leaning his forehead against Derek’s. “I’m in.” \nHe heard Brad cheer from upstairs. “Shut up, Brad,” they yelled in unison, and Stiles laughed, and kissed him again. \nEpilogue\n“Are you fucking kidding me?” Stiles said, munching on the leftover kernels of his popcorn. “How were you surprised by that? I saw that coming like ten minutes into the movie.” \n“That’s because you’re a giant fucking nerd and read all the comics at age four,” Derek said and slapped the bag of popcorn into a nearby trash. \n“Hey,” Stiles yelped. “I wasn’t done with that.”\n“You don’t bring outside food into a restaurant,” Derek said. “What, were you raised by wolves?”\n“Oh, Arby’s is a restaurant now,” Stiles said. “Let me go get my coattails.”\nThey got their food and slapped it down at a table, still bickering when Brad and Erica slid into the seats across from them. \n“Go away,” Derek said immediately. \n“Wait,” Stiles said practically. “Is anyone dead or dying?”\n“No,” Erica said.\n“Then go away,” Stiles said, grinning. \nErica rolled her eyes. “No one wants to crash your weird date, losers.”\n“It’s not weird,” Derek said. “It’s incredibly normal and by the book.”\n“He held my hand and everything,” Stiles said cheerfully. \nBrad pretended to gag himself. “We’re leaving so quickly,” he said. “Trust me. We just wanted to tell you that we’re together now.”\nStiles choked. “You’re what now?”\n“I thought you were dating Boyd,” Derek said, confused. \n“I am,” Erica said, pleased. \n“As am I,” Brad said. \nStiles let his head drop to Derek’s shoulder. “Please tell me my brother isn’t in a threesome relationship with all my friends.”\n“Not all your friends,” Brad said. “We’re totally not dating Isaac.”\n“Or Scott,” Erica said.\n“Or Allison,” Brad agreed.\n“Thank God for small favors,” Derek said, sliding an arm around Stiles’s shoulders. \n“Listen,” Erica said. “Not everyone wants your weirdo backwards relationship.”\n“Hand-holding,” Derek repeated dangerously. Stiles patted his thigh comfortingly. Derek leaned down and kissed him, slipping his hand up to cup Stiles’s neck. \n“You’re totally disgusting and I need to go take my lady to pick up my man friend,” Brad said, making a face at them. \n“Yeah,” Erica said. “We’re gonna go do weird stuff in your house. Don’t come home without calling first.” With that, they got the hell out of dodge, snickering and laughing. \n“Figures,” Stiles said, resting his chin in his propped up hands. \n“What?” Derek said.\n“I get into a homosexual relationship with a werewolf, and Brad gets in a bisexual polyamorous relationship with two werewolves,” he said mournfully.\n“I’m better, I’m the alpha,” Derek said, deadpan.\n Stiles pulled the wrapper off his straw and balled it up. \n“Flick that at me and you’re gonna pay,” Derek said, warningly. \nStiles flicked it at him without hesitation. Derek retaliated by stealing a handful of curly fries. “Do you really care?” he said, mouth full. “About Brad?”\n“Not really,” Stiles said, and he realized it was true – he wouldn’t trade his life with Brad’s for anything. “I love you.” \nDerek paused mid chew. “Are you joking?”\n“No,” Stiles said, and grinned at him, wide and gleeful. “How many dates did it take?”\n“Thirty-seven,” Derek said, without hesitation. He swallowed his mouthful of food, still staring at Stiles. “Don’t fuck with me, Stiles.”\n“I love you,” Stiles said again, and flicked another wrapper at him. \nDerek dove for him, crowding into the corner of the booth, kissing him frantically. “Say it again,” he demanded. \n“I love you,” Stiles said, and let himself be pulled into Derek’s lap. Derek curled his hands around his back and crushed Stiles to him. \nSomeone coughed loudly, and they both looked up.\nThere was an Arby’s employee standing frozen next to their table, mop forgotten in his hand.\n“I’ll pay you $50 to walk away and leave us alone,” Derek said without loosening his grip. \n“Done,” the guy said. Derek reached into his pocket, pulled out a wad of cash, and threw it on the table. The guy took it and ran. \nBy the time they surfaced, Derek’s hair was a mess from Stiles’s hands and Stiles looked like he’d been hit by a really affectionate truck. \n“Bed,” Stiles said. “Like, yesterday.”\n“Yours,” Derek said hoarsely. “I don’t want to think about what’s going on in mine.” He grabbed their coats and pulled Stiles out the door. He held Stiles’s hand the whole way home."
}