{
    "id": "6260548",
    "url": "https://archiveofourown.org/works/6260548?view_full_work=true",
    "author": [
        "dontcareajot"
    ],
    "title": "Damage",
    "rating": "Mature",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Deadpool - All Media Types",
        "Spider-Man - All Media Types",
        "Marvel"
    ],
    "relationships": [
        "Deadpool/Spider-man",
        "Peter Parker/Wade Wilson"
    ],
    "characters": [
        "Wade Wilson",
        "Peter Parker"
    ],
    "additional_tags": [
        "Fluff",
        "lots and lots of fluff",
        "Hurt/Comfort",
        "there's a tiny bit of blood and violence",
        "eventual identity reveal",
        "Slow Burn"
    ],
    "language": "English",
    "series": "",
    "published": "2016-03-15",
    "completed": "2016-04-20",
    "words": "42,300",
    "chapters": "15/15",
    "comments": "1,129",
    "kudos": "20,094",
    "bookmarks": "3,938",
    "hits": "258,218",
    "summary": "<p>Peter Parker finds himself in a sticky situation and who should show up to rescue him but the infamous Deadpool? Now Peter feels indebted to the mercenary... And maybe weirdly charmed by him.</p>",
    "notes": "<p>Both DP and Spidey are based mostly (though not entirely) on their movie counterparts (that would be Garfield for Spidey, not Holland).</p>\n<p>This work has now been translated into Russian! You can find the translation <a href=\"https://ficbook.net/readfic/6867024\" rel=\"nofollow\">here</a> , courtesy of dartsnapper @ tumblr.</p>\n<p> </p>\n<p> <i>As of 01/13/2022 this story is fulled revised!</i></p>\n<p> </p>\n<p> <i>This fic was a huge labor of love and it means the world to me that people are still enjoying it all these years later. I still read and cherish every comment I get and I can't thank all of you enough for the kind words. Extra special thanks to the readers who leave a comment on every chapter as they go, I really appreciate you taking me on that journey with you.</i></p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_14_endnotes\">notes</a>.)\n</p>\n<p>Double update! Click ahead to the epilogue~</p>\n<p>I'm also on <a href=\"https://dontcareajot.tumblr.com\" rel=\"nofollow\">tumblr</a>! Come say hi!</p>",
    "text": "Peter wakes up dizzy and hurting all over.\nThe world has gone sideways and for a heartbeat or two, he can’t make sense of what he’s seeing. Then he realizes, no- he’s gone sideways. His shoulder and face are pressed uncomfortably into an unforgiving concrete floor. He feels stiff, sore like he hasn’t moved in a long time. He tries to raise his hands, touch his face, verify that his mask is still in place, but he doesn’t get very far. His hands are bound tightly behind his back. Everything smells like blood.\nHe struggles into a sitting position. His vision swims. He feels… drugged. Weak and heavy-lidded. He can’t remember how he got here.\nHe looks around, hoping to get his bearings. It looks like he’s in an old warehouse. Pale sunlight is streaming in through skylights in the ceiling, illuminating… Well, not much of anything. Dust-covered cement floors and bits of trash lying around. Nothing is familiar.\nIt looks like people are milling about at the far end of the room, near the entrance. They’re far enough away that Peter can’t tell exactly how many there are or hear anything they’re saying if they're saying anything at all. A few of them have guns, some holstered and some not. Knowing that should put Peter on edge but the only feeling he’s able to dredge up out of the fog that is currently his brain is one of utmost weariness. He feels like he could tip over and go back to sleep.\nSo, definitely drugged, then.\nHe opens his mouth. He’s not sure what for. Maybe to call out to the armed strangers, but that would be a bad idea, wouldn’t it? He realizes this a half a second before he follows through and snaps his mouth shut. It turns out not to matter because at that moment a distraction provides itself.\nThere’s a loud banging on the door. From the other side, someone yells loudly enough for Peter to hear even from as far away as he is, which is impressive. All the strangers turn toward the noise as one, each of them tense, hands flying to weapons, which tells Peter that they weren’t expecting company.\nA second later, a shot rings out, then another, and another, and then all the strangers are firing at once and all Peter can hear is a cacophony of gunfire. He hears bullets pinging off metal walls, striking flesh, spent shells and casings falling to the ground. The noise makes his head hurt. He closes his eyes, just for a second, or so it seems, and when he opens them again the strangers are all on the ground, limbs splayed and weapons abandoned. Standing amidst the bodies, sword drawn and dripping red, is Deadpool.\nPeter knows he’s pretty out of it but he’d recognize the crazed mercenary anywhere. He’s only dealt directly with the man a handful of times but his iconic getup is hard to mistake. If there were any doubt, the way he skips toward Peter and yells, “Spidey! There’s my baby boy,” would be enough to confirm it. Peter is pretty sure no one else has ever called him baby boy, even in jest.\n“What are-“ Peter stops. His voice sounds wrecked and his mouth is dry. He clears his throat and tries again. “What’re you doing here, Deadpool?” A little better, but still slurred. There’s blackness creeping in around the edges of his vision, which even he can tell probably isn’t good.\nDeadpool reaches him between one blink and the next. The mercenary kneels in front of him, head tilted to the side. There are bullet holes punched in his suit. “Aw, Spidey, what’d they do to you? Your suit’s all torn! And I’m pretty sure that’s your blood.”\nBlood? Peter looks down at himself and- oh. Right. He’d smelled blood earlier and there it is, seeping slowly from a wound in his side. He tries to place his palm over it but the bindings pull at his wrists and he’s reminded abruptly that he’s still tied up. Great.\n“Never fear,” Deadpool says, standing just long enough to strike a heroic pose. “Deadpool is here!” The effect is somewhat ruined by the fact that he’s also covered in blood. Probably the blood of all the people he just killed, which Peter makes a mental note to berate him for later. Right now he’s too tired.\n“You’re awfully quiet today,” Deadpool comments, kneeling once more to cut the ropes binding him. Peter didn’t see where he pulled the knife from and doesn’t see where it disappears to once he’s finished using it. Peter’s shoulders scream in relief as he’s able to roll them forward. His entire body is so stiff and sore that he can only muster a grunt of protest as Deadpool scoops him into his arms and starts to carry him bridal-style toward the entrance.\n“Sorry, sorry,” Deadpool mutters, half under his breath. “It’s just- you don’t seem like you can walk and actually you seem pretty out of it- but I probably should’ve asked you if I could pick you up, huh? Shit. ‘S too late now. Wait, where should I take you? To the Avengers? But they’ll yell at me. Do you have a Spidey Cave somewhere? Huh? Spider-Man?”\nPeter rests his head against Deadpool’s shoulder and doesn’t answer. The man smells like gun powder. He always smells like gun powder. And he’s so warm. Is he always this warm?\nPeter drifts off while Deadpool is still rambling. He’s pretty sure the last word he hears before he gives in to the blackness is tacos.\n-\nLater, consciousness hits Peter in the face like a sledgehammer. One second he’s blissfully unaware, the next he’s sitting bolt upright on a sofa and feeling every blow he’s ever taken all at once. He’s not sure how long he sits there clutching the armrest and staring blankly at the floor. Long enough to mentally catalog all his new injuries. There's the uncomfortable twinge in his ankle, probably from landing on it wrong, the various aches in his back and arms and legs where he undoubtedly sustained a few kicks or punches, the throbbing in his head and along his jaw, and the burn of a cut along his side.\nThat one hurts the worst, though when Peter looks down at it he’s surprised to see that it’s been bandaged. Just enough of his suit has been torn away to get at the wound. The rest of it, he finds, has been left alone, including his mask which remains firmly in place. He breathes a sigh of relief as his fingers find the edge of it at his throat.\n“Spider pal! You’re awake!” Deadpool is standing in the doorway, paper bag clutched in one hand, half-eaten taco in the other. He’s still spattered with blood, now dry and turning brown.\nPeter gives a weary nod. “How long was I out?”\nDeadpool plops himself down in the nearest armchair, a ratty green thing that was either just rescued from a trash heap or belongs in one. “Only about twenty, twenty-five minutes. Probably. Just long enough for me to fix you up and get some tacos. Guess you’ve got a little healing factor too, huh? Anyone else would’ve been out for hours on the stuff they gave you.”\n“A little, yeah,” Peter hedges. “I take it this is your place?”\nIt’s hard to tell with the mask on but the way Deadpool palms at the back of his neck suggests a certain amount of sheepishness. “Uh, yep. Welcome to the Deadhut. Or one of them, anyway. Mi casa, su casa. And all that.”\nThe so-called Deadhut is kind of a mess but then Peter didn’t really expect much else. It could use a good dusting and a broom and there’s a lot of clutter, random things like magazines, video games, books, knitting needles and yarn, bullets, knives, a spatula, toy cars, and stuffed animals, among other things. The paint on the walls is peeling and faded, a fact which the various posters that are pinned up do nothing to draw attention from. The floors are bare concrete and the furniture couldn’t clash more if Deadpool had planned it that way. Hell, maybe he did plan it that way.\nBut… it’s not terrible. Kind of cozy, in a strange way. Not like Peter’s apartment, which feels empty and cold no matter how much time he spends there. This place feels lived in, which is funny since Peter is reasonably sure that Deadpool doesn’t spend even half his time in New York.\nPeter clears his throat. “Did you, um…” He gestures at his own face, hoping Deadpool understands what he’s getting at. “While I was out, did you…?”\n“Did I…? Oh, your mask? Nah, man, come on. I’d never do that! Definitely crosses a line, don’t you think?”\nPeter has no real reason to believe him but he feels relieved nonetheless. Deadpool has a few screws loose but he wouldn’t betray Spider-Man that way, would he? He’s made no secret of how much he looks up to him.\n“How are you feeling?” Deadpool presses when Peter doesn’t comment. “You hungry? Got enough for us to share.” He brandishes the paper bag.\n“No,” Peter lies. This is, after all, Deadpool, and Peter doesn’t trust him, not after all the stories he’s heard, and if you don’t trust someone, you don’t accept food from them, right? “I feel… better. I think. How’d you find me?”\n“I saw you get taken,” Deadpool says. He hasn’t eaten any more of his taco, Peter can’t help but notice. “So I just, you know. Followed the baddies. Took me straight to where they were holding you. Which- warehouse? I mean, how fucking cliché, right?”\nPeter rubs at his temples. His head is still throbbing but it’s fading by the minute. Now his skin is starting to itch under his mask. He probably bled and now it’s dried and cracking. “So what happened? I remember most of it. I was trying to stop a bank robbery. Big job, lots of mooks in ski masks. Then it gets a little fuzzy.”\n“Yeah, I heard the commotion from a few streets over. Got there just in time to see you get knocked on the head. Then you got a little wobbly on your feet, some guy got a needle in you, and the next thing I knew you were being stuffed in a shady-looking van and driven across town. They were asking for ransom. How weird is that? I think the bank job was bait, though, to lure you out, but I didn’t let the leader guy live long enough to find out for sure-“\n“Ransom from who?” Peter interrupts, startled. His Aunt May? They’d have to know his identity if that was the case.\n“The Avengers,” Deadpool tells him, the word accompanied with a grand hand gesture. “So fucking stupid, right? All they did was risk pissing them off. But the leader, he wasn’t real bright. You could tell just looking at him. One of those guys who thinks it’s cool to wear socks with sandals.”\n“So… did they get word to the Avengers?”\n“Nah, I think I offed them all before they got the chance.”\n“Why? Why did you even bother?” Peter wonders, though he’s partly relieved. The last thing he needs is the Avengers thinking he can’t handle himself. He feels bad enough already about losing a fight with a bunch of randoms. Not even a super villain, just a group of normal guys with guns and drugs strong enough to knock him out. He’s been off his game lately. Between school, work, and being Spider-Man, it’s been hard to find enough hours in the day to sleep properly.\nDeadpool tilts his head, once again doing his best impression of a confused puppy. Peter imagines he’s looking quite earnest behind that mask. “They hurt you, Spidey. So they had to pay.”\nPeter shakes his head. “I- that’s not- you shouldn’t have killed them.”\n“They were bad guys and they hurt you. Even after you were unconscious. They must’ve because I know you weren’t that banged up when they first got you. I had to rescue you. I did rescue you.”\n“There was a better way. There’s always a better way. You didn’t have to-“\nDeadpool has gone very, very still in his chair. He’s taken to gripping the armrest. Hard.\nPeter sighs. “You did rescue me,” he says, slowly. “And I’m grateful. Thank you, Deadpool.”\nDeadpool instantly brightens. “Any time, Spider-Man!”\nPeter struggles to his feet but it’s easy enough to find his footing once he works the soreness out of his legs. His ankle complains when he puts too much weight on it but he’s had worse before. It’s nothing he can’t manage.\n“Leaving already?” Deadpool pouts, watching as Peter moves toward the window. He stands, too, tacos left in the chair.\n“Gotta get home,” Peter says. He pushes the window up and glances around to get a sense of where he is. Though Deadpool claimed he was only out for about twenty minutes it’s somehow already pitch black outside. There aren’t very many people around, which is good. Fewer people to see him leaving this apartment. “It’s Monday, right? That’s when they re-run Golden Girls.”\nHe’s joking (mostly- who doesn’t love a bit of Golden Girls?) but, behind him, Deadpool gasps. “You like Golden Girls? I think I’m in love. Marry me, Spider-Man!”\nPeter rolls his eyes. When he turns, he catches Deadpool staring at his ass and making grabby hands. This earns him another eye roll which, unfortunately, he can’t even see. “Never in a million years,” he decides. “Besides, I’d look terrible in a wedding dress.”\n“Then I’ll wear the dress! I’ve got the legs for it.” Deadpool strikes a ridiculous pose and Peter, despite all his aches and pains, actually finds himself laughing. It’s short-lived, mostly because it pulls at the wound in his side, but it’s enough that Deadpool hears. He coos, “Don’t you have just the cutest laugh? You should laugh more, Spidey!”\nPeter frowns. “I laugh plenty,” he says. “You’re just not around to hear it.” Once the words are out Peter realizes they sound an awful lot like some kind of invitation and wishes he could take them back. There’s a pause where Deadpool seems to be trying to decide on how to reply.\nThankfully he settles on a simple and non-awkward response of, “Whatever, everyone could use a little more laughter in their life. Even spider-themed superheroes.”\n“I… guess that’s true,” Peter admits. He clears his throat. “Um, thanks again, Deadpool. I owe you one.” He holds out his hand for a friendly shake. It seems like the right thing to do.\nDeadpool hums. “You do, don’t you,” he says, taking the proffered hand. Peter can’t help but notice that Deadpool’s hand dwarfs his own. Granted, he’s wearing thicker gloves, but still. “Say, Spider-Man,” Deadpool begins. He still isn’t letting go of Peter’s hand. “I’ve got this… mission tomorrow. Could really use your help.”\n“Oh, no, wait a minute,” Peter says. He goes to pull his hand away and for a moment it seems like Deadpool isn’t going to let him have it back but when Peter keeps pulling he gives in and releases it. “I don’t kill people, Deadpool. I’m not gonna tag along on any merc business.”\n“It’s not!” Deadpool shakes his head. “No merc business, promise! Just a little thing. And if you get there and decide it’s not for you, you can walk away! No hard feelings. Promise. Scout’s honor.”\nOn the one hand, Peter wouldn’t say he’s exactly eager to spend any more time in the mercenary’s company. On the other, he does owe the man and Peter doesn’t like being in debt to anyone but especially not semi-insane anti-heroes. “There won’t be any killing? No thieving? No morally ambiguous anything?”\n“Nope!”\nPeter gives in with a sigh. “Alright, fine. But I’ve got…” He very nearly says school, but quickly rewords himself. “Stuff. To do. So I can’t meet you until tomorrow night.”\n“Works for me! Meet ya here?”\nPeter glances out the window again. “Yeah, I think I can find my way back.”\n“Great! See you tomorrow, Spidey! Be careful out there. No more abductions! Would hate to have to rescue you again!”\nThis last part is yelled out the window as Peter swings away on a web. He rolls his eyes- something Deadpool makes him do a lot- but he’s also smiling under the mask.\n-\n“Ow, ow, ow,” Peter mutters as he carefully peels his suit off. It seems like every inch of the suit reveals a new bruise. Evidently, the men who captured him earlier had a vendetta against Spider-Man- a vendetta they enacted with kicks and punches to an unconscious victim.\nPeter stands in front of the mirror while he removes his mask, almost afraid at what he’ll find beneath it. He was right about the blood. There’s some caked on his chin, where his lip split, and on his cheek, where he suffered a minor cut. Other than that there’s some bruising, mostly around his eye. The one on his cheekbone has already faded to yellow, which means that by morning it should be gone completely.\nIt’s with some trepidation that he peels away the bandage on his side, but the cut isn’t looking too bad. It would seem that along with slapping a bandage over it, Deadpool also took the time to clean and disinfect the wound, which is something else he has to be grateful for, then.\nPeter squints at himself in the mirror. The Avengers wouldn’t like him hanging around with someone like Deadpool. He’s heard Tony complain about the merc more than once, but Deadpool helped him today. Even the Avengers would have to agree that Peter owes him a debt, right? There’s nothing wrong with repaying that debt, so long as it’s harmless, which Deadpool had assured him it will be.\nThen again, does Deadpool even know the meaning of the word harmless? He’s crazy. That’s one thing everyone that’s worked with him or even spent five minutes in the same room with him seems to agree on. Today, though, he’d seemed… bizarre, but lucid. Maybe Peter just caught him on a good day?\nPeter pinches the bridge of his nose. “Shit,” he mutters, which he thinks sums up his feelings rather nicely.\nHe needs a bath, he abruptly decides. Not only is he filthy but he’s carried Deadpool’s smell home with him. After a bath, he’ll study, and then, if there’s time, sleep.\nThere’s a part of him that’s very anxious indeed to see what Deadpool has in store for him tomorrow.\n“This is the mission? Ice cream?”\nDeadpool thrusts out a vanilla cone, silently urging Peter to take it. “No, no. This is just pre-game. I got vanilla cause I didn’t know what kind you’d like and it seemed safe but please tell me vanilla isn’t your favorite, it’s so boring.” His own ice cream is about six different colors and smells like fruit.\nInstead of meeting in Deadpool’s apartment, Deadpool had been waiting for Spider-Man on the roof, so now here they sit, legs dangling over the edge. Peter takes his ice cream with a great deal of hesitation. What if it’s poisoned? Is he being paranoid? Probably. If Deadpool wanted him dead, he could’ve just offed him yesterday. Still…\n“I like vanilla but it’s not my favorite,” he says, abruptly deciding to bite the bullet (or, in this case, lick the ice cream). He pushes his mask up to his nose and adds, “My favorite is actually chocolate chip.”\nDeadpool scoffs. “That’s just as bad,” he declares. “Fucking chocolate chip. That’s just boring with sprinkles-“ He stops talking. \nPeter freezes, immediately on alert. He looks over but Deadpool is just staring at him, or past him. It’s hard to tell with the mask but when Peter looks behind himself there’s nothing there. “Uh,” he starts, but evidently Deadpool finds his on-switch again because he interrupts.\n“How old are you?” he blurts.\nPeter has a very quick internal debate about whether or not to share the truth, then decides he might as well. There’s very little someone can do with an age. “Twenty.” He adds, eye roll practically audible, “So don’t worry, you can continue to ogle my ass guilt-free.”\n“What?” Deadpool says, and Peter has to mentally backtrack.\n“I mean- I meant to say-“\n“Nope, too late!” Deadpool says, jabbing a victorious finger toward Peter’s face. “You said it, the whole world heard it! I get to stare at your butt whenever I feel like it!”\n“That’s not what I said,” Peter argues, but he’s smiling so he’s not sure how effective it is. “And you’re the only one here so I don’t think the whole world heard-“\n“No take backs!”\nPeter chuckles and goes back to eating his ice cream, silently admitting defeat. He has a feeling that most arguments with Deadpool can’t be won.\nOut of the corner of his eye, Peter sees Deadpool reach for the bottom of his mask and then hesitate, fingering the edge of it. Peter tries to seem wholly engrossed in his own ice cream, even going so far as to angle his body slightly away. One of the small handful of things Peter knows about the mercenary is that he’s scarred, apparently pretty badly, though no one can seem to agree on the cause or the extent of the scarring. They all agree on one thing, though- Deadpool hates being seen without his mask.\n“Good stuff,” Deadpool says a moment later. Peter dares to look over. Deadpool’s ice cream cone is gone and his mask is back in place. Behind him, the sun is just starting to set and New York City is just starting to light up.\n“What the- how’d you finish so fast?”\nDeadpool shrugs. “Practice.”\nPeter takes another pointed bite out of his cone. “Well, us normal people have to contend with brain freeze.”\nDeadpool kicks his legs against the side of the building. “Take your time, baby boy, there’s no rush.”\nThe next few minutes are filled with companionable silence, something Peter didn’t even know Deadpool was capable of. The mercenary seems lost in thought, eyes tracing the skyline and fingers tapping an uneven rhythm against the roof.\n“Penny for your thoughts?” Peter says, softly, almost hesitant to interrupt whatever is going on in his head.\n“What kinda girl do you take me for?” Deadpool teases, snapping out of it. “They cost way more than a penny.”\nPeter recognizes it for the evasion it is and chooses not to comment. He and Deadpool aren’t… friends, by any stretch of the imagination. He has no right to pry.\n“Your suit’s all back in one piece,” Deadpool notes. “How many of those have you got hanging in your spider closet back home, anyway?”\n“How many do you have?” Peter counters.\n“Touché.”\nPeter licks his lips, clearing them of ice cream. Deadpool watches with a strange sort of intensity. Peter clears his throat. He’s not sure what Deadpool finds so fascinating. It’s just- his face. Not even his entire face, just a piece of it. Little does Deadpool know that under the rest of the mask he looks like a tired, disheveled mess. This morning, thanks to a lack of sleep, there’d been bags under his eyes in addition to his now-fading bruises. “You wanna tell me what this mission is all about now?” Peter asks, deflecting attention. “Is that what this is, a briefing?”\n“Nope!” Deadpool sounds like he’s probably grinning beneath his mask. “The mission is a surprise! Don’t you just love surprises? It’s like Christmas!”\n“But you promise it’s nothing shady?”\n“Yes, Spidey. God. It’s like you don’t trust me or something. But I’d never lie to you. Mislead you, maybe. Fib a little here and there. But lying’s not my bag, you dig?”\n“Well that’s reassuring,” Peter deadpans.\nIf Deadpool picks up on the sarcasm, he doesn’t let on. “Yeah, so, no worries. No one is gonna get hurt today. I promise. I know you’ve got a reputation to uphold and all that.”\nPeter pops the last of his cone into his mouth and tugs his mask back down. He just hopes he’s doing the right thing here.\n-\nThe house Deadpool leads him to is a bit on the run-down side and decidedly not in the nicest part of town, but there are discarded toys on the lawn and children playing further down the street. Peter’s spidey sense is quiet and he has no reason to suspect a trap.\n“Damn, looks like we missed the party,” Deadpool murmurs.\nThe sun is fully set now, leaving them and their surroundings illuminated only by a lone street lamp and what little moonlight can creep through the clouds. Deadpool pulls him to a stop in the middle of the front lawn, fingers curled around his wrist. The touch lingers as he explains, quickly, all in one breath, “The older one is Emily, the younger one is Sarah. It’s Emily’s birthday today. All you have to do is smile and play nice. That’s the mission. Got it? Got it.”\nPeter blinks. “I- what? What are you-“\n“Oh, and here,” Deadpool adds, shoving a small, wrapped gift into his hands. “You’ll need this.”\nThe present is way too big to fit into one of Deadpool’s pouches. “Where were you even hiding that?” Peter asks, mildly disturbed at the possibilities.\nThe porch light flicks on and the front door squeaks open. “Who’s there?” calls a woman’s voice, high and nervous.\nThe pressure of Deadpool’s hand on his wrist is gone and, Peter is unsurprised to find when he turns back, so is Deadpool. Peter could easily make himself disappear as well, as the woman hasn’t even seen him yet, but if this is how Deadpool wants the debt repaid then so be it.\nPeter clears his throat and steps forward into the light. He puts on his best hero voice (they all have one, even if people like Tony Stark would deny it). “It’s just me,” he says. “Your friendly neighborhood Spider-Man.”\n“Oh, my God,” says the woman, swinging the door wide and squinting at him. She has her blonde hair pulled up in a messy, drooping bun and there are dark circles under her eyes, but after a quick study of his suit, she looks genuinely amazed- and pleased- to see him. “Is it really you?”\n“The one and only,” he assures her.\n“Oh- hang on. Let me fetch the girls. Come, come, wait by the door,” she instructs, the wariness gone completely from her voice, replaced by excitement. “Emily, Sarah!” She disappears for a moment around the corner and returns not five minutes later, this time accompanied by two young girls. The oldest- Emily, Peter presumes- couldn’t be more than seven or eight, while the youngest looks about five. They’re wearing matching blue and white checkered dresses and have their hair pulled into pigtails. Sarah’s face is streaked with dirt.\nSarah is the first to react to his presence. She gasps, comically huge, and launches herself at him. “It’s you!” she squeals.\nPeter intercepts the would-be hug to twirl her around, which sets her off giggling. “Hello, Sarah,” he greets once he sets her down, kneeling so they’re at eye level. “And Emily.”\nEmily is staring, eyes wide. She tiptoes forward slowly like she isn’t sure she’s allowed. Peter presents her with the gift. “I heard it’s your birthday today.”\nIt’s her turn to gasp. She takes the present in a hurry but then takes care when she removes the bow. She casts around for where to put it before she decides to stick it to the front of her own dress. The wrapping paper itself doesn’t receive the same consideration. As she tears into it to get at the gift, Peter silently prays it isn’t anything too weird. Or dangerous. Or lethal. But these are kids. Surely even Deadpool wouldn’t hurt a kid?\nHis faith in the mercenary is rewarded when Emily discards the last of the paper and removes a small book. Peter isn’t able to get a glimpse of the title but Emily seems thrilled. She clutches it to her chest, looking awed. “How did you know?” she asks.\n“I’m Spider-Man,” seems the only fitting explanation.\nEmily nods, like this makes perfect sense. She hugs him, one small arm wrapped around his shoulders. “Thank you, Spider-Man.”\n“You’re our favorite hero!” Sarah declares once Emily steps back. She wraps her tiny fingers around his thumb and tugs him toward the door. “You have to come have cake!”\nTheir mother laughs. She’s looking warmly at the three of them from the doorway. “Sarah, you have to ask if he wants cake.”\nSarah nods. She looks up at him with big, blue eyes and asks very seriously, “Do you want cake, Spider-Man? We have a ton of leftovers.”\n“Oh, um…” Peter casts around, looking for Deadpool, but the man is still nowhere to be found. “I should really-“\nEmily is still holding the book like she’s never going to let it go. “Please?” she says simply.\nPeter folds immediately. “Alright, I guess I have a little free time.”\nSarah cheers and Emily lights up and Peter feels pretty damn good about his decision.\n“I have some questions about the webs,” Sarah says seriously as she drags him into the house.\n-\nDeadpool is waiting on the street for him when he exits the house some twenty minutes later, full of cake and having been thoroughly questioned about everything from his choice of color scheme to the inner workings of the criminal mind and back around to his favorite boyband. Deadpool is just a silhouette against the night sky until Peter reaches him. He’s twirling a knife between his fingers. Every so often the blade catches the light.\nFor a moment, when Peter draws even with him, they just stand there looking at each other. It’s Peter who breaks the silence. “I’m pretty sure Sarah is going to be President one day,” he says.\nDeadpool hums his agreement. “She’s smart as a whip, that one.”\n“Wanna tell me what that was all about now?”\nWith one last flick of his wrist, Deadpool makes the knife vanish. “Thanks, Spidey,” he says, ignoring the question. “Knew you’d be good with kids. You just have that vibe, you know? Just screams kid friendly and PG.”\n“Seriously,” Peter presses, trying not to let him weasel his way out of answering. “Who was that family? Was that- wait. Are you their dad?”\nDeadpool holds up his hands, vigorously shakes his head. “No, no no no. No kids in this universe. Uh, that I know of, anyway. If there is one, we haven’t met yet.”\n“Okay… so who were they?”\nDeadpool scratches at his chin through the mask. “They’re… I used to know their dad,” he says slowly, probably debating with himself as he goes about what exactly he should reveal. Peter knows the feeling. “He was in Weapon X with me. He… told me a lot about them before he died, and I know since he’s been gone they’ve had it pretty rough. I just figured having their favorite superhero drop by would be nice.” He shrugs.\n“And the book?”\n“Um.. he used to read it to her when she was little. Like a bedtime story or something. But they lost their copy when they moved.”\n“Huh,” Peter says, briefly at a loss.\n“Yep,” Deadpool says, popping the p. He turns on his heel and starts off down the sidewalk.\nPeter, trailing a short distance behind, studies the line of Deadpool’s shoulders and finds himself, for the first time, actually curious about the mercenary’s past. He’d thought he knew everything he needed to know- that Deadpool was a part of Weapon X, that he had a healing factor to rival that of Wolverine, that he was scarred and psychologically damaged (to say the least about his fluctuating mental state)- but now he’s thinking maybe those are all just facts on a page. They don’t really tell him anything about who Deadpool is, at his core, or what he’s been through.\n“So you can consider us even now,” Deadpool says into the ensuing silence.\nPeter jogs a bit to catch up. “Hey,” he says, deliberately bumping their shoulders together. “You know I’d have done that for free. All you had to do was tell me what the deal was.”\nDeadpool shakes his head. “Spider-Man doesn’t have time to visit every little girl or boy that wants to meet him. I know you’re a busy guy, what with all the world-saving and crime-stopping.”\n“Still, I’d have done it.”\n“Nah. Not many heroes who’d do a favor for the ‘merc with a mouth’,” here he employs air quotes. “It’s cool, though. It all worked out.”\n“I would have,” Peter insists. “I’d have done it anyway. Which means…” He pauses, bites his lip, then plows on. “Which means we’re still not even. That wasn’t a favor for you, Deadpool, that was a favor for them.”\n“Same thing-“\n“It’s not! I still owe you.”\nDeadpool looks at him. “So I still have a spider-favor to cash in?”\n“Yeah. But still, you know, no killing. No merc business. But if you ever need my help with something that’s not terrible…”\nDeadpool kicks at a pebble that’s in their path and sinks momentarily into thought. He hums. “So, like, how good are you at video games? Because I’m stuck on this one level of Mario 64-“\nPeter laughs and nudges him with an elbow. “I’m serious!”\n“So am I!” Deadpool insists, nudging him right back. “I figure, hey, you’re dextrous, you’ve got great reflexes, probably have really good hand-eye coordination…”\n“Sadly, being bitten by a radioactive spider didn’t make me magically good at video games. I mean, I’m alright, but my aunt still kicks my butt at Wii bowling.”\n“I bet you’re a huge nerd in real life,” Deadpool declares, seemingly out of nowhere, snickering. “Aren’t you? In the suit, you’re this super suave, super smooth hero with the ass of a god, but out of the suit- well, I assume you still have an ass that needs worshipping, unless that suit’s padded- please tell me it’s not padded-“\n“It’s not,” Peter glowers, shielding his ass from Deadpool’s wandering eyes with his hands. He’s often grateful for the mask, especially in times like these when he needs to hide a blush. It’s been a while since he’s had anyone flirt so blatantly. Since Gwen, his love life has been a series of sad first dates and not much else.\n“Hey, you said I was allowed to ogle,” Deadpool pouts.\nThe remark surprises a laugh out of him. “I didn’t say that,” he reminds. “I just meant I’m not jailbait-“\n“And thank god for that,” Deadpool cuts in. Then he says, all in one breath, “Then I’d have to feel real bad about the dreams I’ve been having. Oops, did I say that out loud? Ignore that. Dreams, what dreams? No one is having any dreams.”\n“I… I don’t know whether to be offended or flattered,” Peter muses.\n“Both?” Deadpool suggests.\n“Both,” Peter decides. They reach an intersection and, for the first time, Peter realizes he doesn’t actually know where they’re going. He isn’t sure Deadpool even knows.\nHe also realizes he’s not in a hurry to leave, which is troubling.\n“Hey,” Deadpool says, scuffing the toe of his boot along the ground. “Do you wanna maybe grab a bite to eat? I know this great place not far from here, best chimichangas I’ve ever fucking eaten.” He jerks a thumb over his shoulder, presumably toward said restaurant. \nPeter knows it’s getting late and he definitely has housework that needs doing, not to mention the studying and sleeping he needs to catch up on, and it goes without saying that Spider-Man shouldn’t be seen in the company of Deadpool too often, but his mouth runs away from him and he’s agreeing before he really means to.\nHe finds he’s not that sad about it. It’s worth it for the ridiculous little happy dance Deadpool does. Peter is pretty sure he’s smiled more with Deadpool in the last couple of days than in the last couple of years combined.\nThe mercenary slings an arm around him and directs him down the sidewalk. If Peter leans into him just a little instead of pulling away, well, no one needs to know. No rule says he can’t be nice to Deadpool, right? \n“You’ll love it,” Deadpool promises, fingers curled over Peter’s shoulder.\nPeter is supposed to be writing a paper.\nHe’d started off in his apartment but, aside from a couple of brief outings as Spider-Man, he’d been cooped up there all weekend. A change of scenery had been in order, which is why he’d relocated to the coffee shop right down the road. It was Monday, mid-morning, so the place wasn’t too crowded and it had just enough background noise to put Peter at ease but not drown out his thoughts. He’d started off strong, with caffeine in his system and a single-minded determinedness to finish this god-forsaken paper.\nThen Deadpool had walked in about thirty minutes later and his focus was immediately waylaid.\nThe mercenary was dressed in a jacket that was zipped nearly to his chin, hood pulled up to cover his head, but underneath he was wearing his full costume. He was hard to miss. At first, Peter wasn’t the only one staring. Everyone had turned to watch as Deadpool approached the counter, ordered his drink from an only slightly terrified looking barista, fumbled in one of his many pouches for the right change, and then took a seat at a corner table, facing the door.\nFacing Peter, actually, though Peter felt sure that was a coincidence. Eventually, everyone silently and mutually decided to ignore his presence and went back to their business. Everyone except for Peter, who couldn’t help glancing over every two seconds, wondering why Deadpool had somehow wound up at this this coffee shop, and also wondering, for that matter, why Deadpool was even still in New York at all. He was notorious for never staying in one place longer than it took to complete a mission there.\nCome to think of it, Peter had no idea why Deadpool had come to New York in the first place. He should probably find out before Deadpool could cause the kind of trouble he was infamous for. It hadn’t come up the last time they’d seen each other as they’d been too busy stuffing their faces with chimichangas. Well, Peter had, anyway. Deadpool had talked a lot- a lot- and pointedly avoided eating so long as there was a chance Peter might see his face.\nNow, every so often, from the corner of his eye, Peter catches Deadpool taking a sip of his coffee, mask pushed up to his nose. It’s impossible to tell anything about his features from this distance but that doesn’t stop Peter from trying. His curiosity has always been a force to be reckoned with and the harder Deadpool tries to hide, the more curious Peter becomes.\n“Do I have something on my face, kid?”\nPeter jumps. Actually, physically jumps, which is embarrassing. Deadpool is suddenly looming over him. Peter hadn’t seen him get up from his seat. He’s very tall and very broad-shouldered. That’s easy to forget when Peter is also in costume and not playing the part of a defenseless nerd.\n“Uh, no,” he stammers, hoping and praying Deadpool won’t somehow recognize him. “I was just-“\n“Staring,” Deadpool says with obviously fake cheer. He pulls out a chair and sinks down into it in one smooth movement. He leans forward, deliberately putting himself in Peter’s personal space and- ah, yes, there’s that gunpowder smell that always seems to accompany him. “Do we have a problem?”\nHe’s never sounded like this when he’s talking to Spider-Man. Borderline dangerous. “No- not at all,” Peter says carefully, refusing to be daunted. He closes his laptop. “I was just… admiring your costume.”\nThe flattery works like a charm. In an instant, the threatening aura is gone. Deadpool leans back, spreads his hands. “Oh, this old thing?” he teases. “Thanks, pal. Made it myself.”\nPeter nods. “Yeah, ‘s nice, but if you were going for incognito…”\nDeadpool leans forward again, this time to prop his elbows on the table. People around them are starting to stare once more, maybe wondering why the masked merc has taken an interest in the skinny dweeb. Better Peter Parker be seen with him than Spider-Man, though. At least their picture is less likely to be published on a front page this way.\n“Incognito?” Deadpool says. “No, see, I don’t get to be incognito. Ever. In costume, out of costume- people stare. Or, depending on how well they know me, they run screaming. Or, if they have good taste, they start swooning and dropping their panties. But you see the problem.”\n“You draw attention?” Peter ventures, attempting to hide his smile and doing a poor job of it. The smile only seems to encourage Deadpool, who nods happily.\n“Right. Too much attention. Sometimes a guy just wants to grab a coffee and not be gawked at, you know?”\nPeter does know. At least, he can imagine. He’s glad he’s lucky enough to be able to preserve his secret identity. He doesn’t know what he’d do if we were constantly being hounded like Tony Stark or Steve Rogers- or, he supposes, Deadpool. “Sorry if I… gawked…”\n“You,” Deadpool says, hooking his foot around the leg of Peter’s chair and pulling it closer. Metal scrapes against hardwood. “Have permission.” He waggles his eyebrows. Somehow Peter just knows that’s what he’s doing, even though his mask barely moves. “You’re cute, kid. Real cute. Anyone ever tell you that?”\n“Not anyone wearing a mask,” Peter replies honestly. There’s a blush creeping over his cheeks, he can feel it. It’s silly. It’s just Deadpool, the same guy who’s been hitting on him since they met. The only difference now is that he’s talking to Peter, not Spider-Man. Maybe that matters.\n“What’s your name?” Deadpool asks. His ankle is pressed against Peter’s under the table. Does he know? Is he doing it on purpose? Peter doesn’t pull away, lest he draws attention to it. “Tell me yours, I’ll tell you mine.”\n“It’s… Peter. Peter Parker.” There's no sense in lying, or maybe Peter just doesn’t want to.\n“Wade Wilson,” Deadpool says. Then, he claps. “Yay, alliteration buddies! I think this means we’re soulmates.”\nPeter already knew Deadpool’s name, of course, he’s just never been given permission to use it. Does this count? Would it be weird for Spider-Man to start calling him Wade?\nPeter shakes his head, mostly at himself. “Kinda getting ahead of yourself there, pal,” he says, about both of them.\n“You’re right. My heart belongs to someone else, anyway. Doesn’t mean I can’t treat a cute guy to coffee though, eh?” Deadpool abruptly stands. Amidst protests from Peter, he produces a few crumpled bills and sets them on the table. “Nice meeting you, Petey. Don’t worry about the money. I’m filthy fucking rich.”\nPeter blinks up at him. Clearly, his protests are going to go ignored, then. “Um, nice to meet you too, Wade.”\nWade salutes him on his way out the door, cocky swagger to his hips.\nPeter stares at the money for several minutes after he leaves. Deadpool is a whirlwind. Peter finds it hard to keep up, but he’s having a lot of fun trying.\nHe winds up leaving all the money Wade gave him in the tip jar. It would feel wrong to spend it himself.\n-\n“Oh, honey, what happened to your face?”\nPeter shrugs and attempts to wiggle his way out of Aunt May’s hands but she holds him tight, turning his head this way and that, probably looking for other blemishes. “Nothing, nothing. Just- tripped the other day. No big deal.”\nTruth be told, he’d been in a little scrap as Spider-Man just this morning. Now, he’s cursing himself for forgetting to throw a little concealer on the newly formed bruise adorning his jaw. He’d been in a hurry, though. His lunches with Aunt May are something he tries never to be late for. She’s big on punctuality.\n“You? Trip? Peter, I don’t believe that for a second. You’re as graceful as a ballerina, child.”\n“Normally, sure,” Peter says, sticking to his lie. He finally manages to shake off her hold on him and ducks past her into the kitchen. “I brought cookies. For dessert.” He holds up the box. As far as subject changes go, it’s pretty thin. Aunt May gives him a look that says she isn’t buying it for a second and, bless her, lets it pass. She takes the box from him with a smile. “I was gonna get flowers, too,” he continues. “But then I, um. Forgot. Next time, though.”\n“Next time,” she agrees, mirth dancing in her eyes. “There’s the Peter I know and love. So forgetful. I can forgive you, though. I know you’re busy. Studying hard, aren’t you?”\n“Yes, Aunt May,” he assures her, rolling his eyes affectionately. “Nothing has changed since last week when I was here. Still in school, still living in the same apartment, still taking pictures for the Bugle, still single.”\nShe swats him lightly on the arm. “You’ve ruined it, Peter! What on earth are we going to make small talk about now?”\nDespite her teasing, they find no shortage of things to talk about throughout lunch. They keep it light, each avoiding touchy subjects like Uncle Ben or Gwen or anything to do with money, but Peter knows Aunt May likes to save anything that might be deemed controversial for after the meal and today is no different. Just as Peter is finishing the last bite of his sandwich she says, gently, “So, still single, hm?”\nPeter sighs, bracing himself for whatever she might say next. Usually, it’s a diatribe on how he shouldn’t force himself to be alone forever for Gwen’s sake. Not that he’s doing any such thing. He loves Gwen and probably always will but it’s not about that. It’s about not making the same mistake twice. As long as he’s Spider-Man, having a serious relationship seems pretty out of the question. “Yep. Still single.”\nAunt May places her hand atop his where it rests on the table. “You would tell me, wouldn’t you?” she asks, brow furrowed. “If you met someone?”\nPeter gets an unbidden image of Deadpool, sitting beside him on a rooftop, haloed by the setting sun. He’s not sure why. He shakes his head to clear the image. “Of course, Aunt May. Anyone I met would have to pass the May test.” He smiles. “If you don’t like them, they aren’t relationship material, right?”\n“You’ve got that right,” she chuckles, reaching out to pinch his cheek. “No one is really good enough for my Peter but they’ve got to at least come close.”\nPeter thinks she’ll let it drop after that but instead her expression again turns dour. “It’s just- I wonder what you do, Peter. It can’t all be studying and work, can it? Do you just stay cooped up in your apartment? Do you have friends? I never hear about any friends.”\nPeter does, in fact, have friends. He used to have more but it turned out most of those were actually Harry’s friends and after he jumped off into the deep end and went all green goblin they just sort of… vanished. One by one. Now he’s left with a couple of friends from work and MJ, who still keeps in touch even after their brief, failed try at a relationship. It’s enough. Peter doesn’t long for companionship- he isn’t lonely, but he doesn’t know how to make Aunt May understand that.\nHe pats her hand. “You don’t need to worry about me,” he tries to assure her. “I’m fine. Everything is fine. And I’m happy being single.”\nShe hums, looking doubtful. “Well, as long as you’re happy.”\nHe is. Mostly.\nHe thinks again of Deadpool. Of Wade. He wonders idly what the mercenary might be doing right now, then remembers it’s probably something Not Good and frowns down at his empty plate. So Deadpool makes him laugh. He’s still Deadpool and therefore not someone Peter should consider a friend. Definitely not someone Peter should be eager to see again.\nAnd yet.\n-\nPeter hears Deadpool before he sees him. He’s on patrol- nearing the end of it, actually, and is just about to swing his way home- when a shout catches his attention and he changes direction, heading towards it and bracing himself for trouble.\nHe arrives on the scene just in time to see Deadpool pull a gun and shoot a fleeing man in the leg, sending him sprawling. Deadpool jogs over to him, retrieves something from the downed man, and jogs back to a woman cowering in the shadows. She takes whatever is it he offers to her, thanks him, and scrambles out of the alley, back to the safety of the public street. She walks quickly, with her head down. Deadpool turns his attention back to the wounded man, starts to advance on him with purpose. His fists are clenched by his sides.\nPeter drops down gracefully in front of Deadpool, halting his progress. Deadpool doesn’t seem surprised to see him but he does seem pleased. His stance instantly loosens. “Oh, hey, Spidey! Don’t mind me, just helping out.” He takes another step forward.\nPeter places a palm flat against his chest, stopping him once more. “We need to call that man an ambulance,” he says, hopefully in a tone that brooks no argument. “And then you can explain to me why you shot him.”\nPeter isn’t sure why, but that seems to surprise Deadpool. “Ah,” he says. Then, simply, “Alright.”\nDeadpool does as instructed. He pulls a phone out of one of his pouches, dials 911, explains to them that “some douchebag” has been hurt and they better get there pronto. Peter approaches the man just long enough to verify that he is, in fact, still alive, and not likely to bleed out anytime soon, even if he can’t currently walk. Peter would like to believe that’s not an accident. He’d like to believe Deadpool chose his shot with care and was deliberately non-lethal. He tries not to think too hard about why that’s so important to him.\n“There, done,” Deadpool announces, snapping the phone closed. “Now for the second thing-“\n“Wait. Let’s get out of here before that ambulance gets here.” Peter steps close to the mercenary, whose first instinct is to recoil when Peter places his arm around him, then he seems to understand and settles into the hold, even laughs. “Hold on,” Peter instructs.\nDeadpool does just that while Peter slings them up to the nearest roof. As soon as his feet are back on solid ground he releases Peter, only to latch back on a moment later, hands wrapped around Peter’s forearms as if to keep him from getting too far away. He breathes, excited, “That was amazing, holy shit. You’re so strong, Spidey. I want web-shooters!”\nDeadpool’s excitement is infectious but Peter’s smile is quick to fade. “I need to know why you shot him,” he reminds, voice level. “Were you trying to kill him?”\nDeadpool doesn’t seem in any hurry to let go of him. In fact, his hold tightens. “What? No, no- I just had to stop him. I caught him hitting that girl. He tried to take her purse. I was- I was doing a good thing. He deserved more than that, though. He deserved a beating of his own. Fucking scumbag. She was pregnant, you know? Who robs a pregnant lady? That’s some seriously bad karma-“\n“Wade,” Peter interrupts. He tries to sort through his mixed feelings of relief and apprehension. “I’m… glad. That you helped her. And that you didn’t kill him.”\nDeadpool nods, once. There’s a pause. Then he says, slowly, “You’ve never called me that before.”\nPeter can feel the tips of his ears burning as he realizes his mistake. “Uh… Sorry. I didn’t mean-“\n“No,” Deadpool says. He’s standing very close, radiating warmth. Peter has to tilt his head up to look him in the eye. “It’s- it’s fine. It’s nice. I like it. I wondered if you knew my name. I figure the Avengers have a file or two on me, eh?”\n“I’m not an Avenger,” Peter gently reminds. “If they have a file, I’ve never seen it.”\nFor a moment neither of them speaks. There aren’t many quiet moments with Deadpool, which is why this one is so striking. Peter has just enough time to realize there are butterflies in his stomach before Deadpool- Wade- steps away, releasing him.\n“And, um, thanks,” Wade says, palming at the back of his neck. He studies the ground. “For not just, you know. Showing up and assuming I was in the wrong. Most people would’ve. Hell, most people do.”\nPeter swallows. “I, um. I try to give everyone a fair shake. You’ve been here a couple of weeks now and you haven’t caused any trouble, so.” He shrugs.\n“Right.” Wade perks up. “I kinda like it here, you know? New York isn’t so bad.”\n“I like it quite a bit myself,” Peter agrees. God is he glad he wears a mask. He’s pretty sure his face is doing some dopey fond thing- and not in regards to his city. This is bad. He sends up a silent prayer that none of the Avengers- or, for that matter, the X-Men- ever get wind of this.\n“So you don’t mind if I hang around a bit?” Wade asks. Before Peter can even open his mouth, Wade drops dramatically to his knees, hands clasped in front of him. “Please, please, please? I promise I’ll be good! I don’t wanna go back- too many bad memories. And all the other heroes hate me, it’s terrible. Don’t know a good thing when they see it. You’re the only one with any sense, Spidey.”\nBy the end of his rant, Peter’s shoulders are shaking with laughter. “You’re ridiculous,” he decides. “But yeah, you can stay. If you promise to be good. That means no killing.”\nWade pouts. “Even if they really deserve it?”\n“Even if you think they really deserve it, yes.”\n“Fine,” Wade agrees with a sigh, relenting surprisingly easily.\n“Besides,” Peter adds, offering him a hand up. “I still owe you that favor.”\n“So you do,” Wade agrees, sounding mischievous. “I’ve never had a hero in debt to me before. I can’t waste this golden opportunity.”\nPeter holds up a finger. “Nothing-“\n“Morally ambiguous,” Wade finishes for him, waving a dismissive hand. “Yeah, yeah. Don’t worry, I’ll put you to good use.”\nPause. “Sounds dirty,” Peter says.\nWade chuckles. He drapes an arm over Peter’s shoulders and whispers into his ear, “Only if you want it to be.”\nPeter shrugs him off, blushing again. Damn it. “Mind out of the gutter,” he scolds.\n“Hey, you’re the one who went there first,” Wade points out.\nPeter shakes his head but he can’t argue the point.\nThey wind up walking back to Wade’s apartment together. Wade blows him a kiss farewell and decrees this the “start of a beautiful friendship”.\nPeter is just worried he’ll come to regret his decision.\n“Lookin’ good, Spidey. And by ‘good’ I actually mean terrible. And by ‘terrible’ I mean damn fine but a little scorched around the edges. Get into a fight with a toaster?”\nPeter picks grumpily at a blackened portion of his suit. “Electro,” he says, which is enough explanation.\nWade hops down from his perch atop the nearest dumpster. He looks past Peter, finally seems to notice the scores of police cars and general destruction and mayhem that Spider-Man’s fight with Electro left behind. How he could’ve possibly been oblivious to it before is a mystery to Peter. “Shit, I missed it? Would’ve been the perfect opportunity for a team-up!”\n“I handled it,” Peter says. He’s sore and tired and mostly he just wants to go home and collapse into bed but he can’t because he promised he’d have dinner with MJ and he can’t cancel on her again. That would be the third time in a row and at that point, it just becomes suspicious, not to mention super rude. His Aunt taught him better than that.\n“Aw,” Wade coos. “Is someone a grumpy little spider today?” He pokes Peter’s exposed ribcage. This suit has enough holes in it that there probably won’t be any fixing it, even with Peter’s quite frankly amazing sewing skills. “Does someone need a nap? Oooh, or a hug?”\n“I’m not grumpy,” Peter says, aware that he sounds the exact opposite. He swats at Wade’s hand. “I’m just- I need to get out of here before the cops decide they want a word.”\n“Right. I getcha. My place isn’t far, you know. You could crash there for a while if you wanted. As long as you promise not to snoop. I know it’s no five-star hotel but the couch is pretty comfy and I’ve got air fresheners.”\n“Do you?” Peter wonders, trying to remember what the place had smelled like. Not air fresheners, that’s for sure. At the time it had mostly smelled like tacos if he recalls correctly.\n“They’re new,” Wade says, doing jazz hands.\nThe offer is actually pretty tempting. Not only does he know Wade’s place is pretty cozy but he’s also aware of the fact that Wade’s presence would, undoubtedly, cheer him up. When the man went from being a mysterious nuisance to a source of- of happiness, Peter isn’t sure. It’s annoying and unexpected and if MJ ever found out Peter was thinking about bailing on her so he could spend time with a sword-wielding maniac, she’d kill him.\nHe sighs, pinches the bridge of his nose between two fingers. “I- I can’t. The suit. I wanna change. And I’ve got… plans.”\n“Plans? What kinda plans? What does Spider-Man do with his free time, hm?” Wade’s shoulders slump as something occurs to him. “Is it a date? I bet it’s a date.”\nPeter laughs. It’s humorless. “Definitely not a date. Haven’t been on one those in a while.”\nWade perks up. He shoots a finger gun at Peter, complete with little pew pew noises. “We could fix that any time, pal.”\n“What, you know someone?” Peter deadpans.\n“You can’t see it,” Wade tells him seriously. “But I am rolling my eyes so hard right now.”\nPeter has to laugh at that- genuinely, this time. “It’s just a friend,” he assures him, not sure why he’s even bothering. “A friend date, I guess. One that I am going to be seriously late for if I don’t leave right now.”\nWade holds up his hands. “Don’t let me keep you, princess. You know I love watching you walk away.”\n“Too bad I won’t be walking,” Peter quips.\nHe hears Wade wolf whistle as he slings himself toward the nearest rooftop. The grin on his face lingers far longer than it has any right to.\n-\nPeter is underdressed. He knows he’s underdressed as soon as he steps out of the cab. Leave it to MJ to pick somewhere exceedingly fancy for dinner- exceedingly fancy and probably exceedingly expensive, too, as if either of them can really afford it. At least it's just MJ, Peter tells himself. She won’t care if he’s not wearing a tie and she’ll understand when he orders the cheapest thing on the menu.\nOf course, as soon as he has the thought, Peter rounds the corner and spots MJ at a central table. MJ and a girl Peter’s never met before.\nShe’s beautiful, with smooth, dark skin, big, expressive eyes, and soft, black hair that falls in loose curls over her shoulders. She’s the kind of pretty that’s intimidating. Peter used to think that about MJ, too, though, and now the two of them are good friends.\nIt’s with some trepidation that Peter approaches the table. MJ’s eyes light up as soon as she sees him. “Peter!” she says happily, standing to greet him. She wraps him in a loose hug that he barely has time to return before she whirls around and gestures at her friend. “Peter, this is Marisol. Marisol, Peter. I hope it’s okay that I asked her to join us, Pete. This is her favorite restaurant, so I thought, why not-“\n“It’s fine,” Peter assures her, aware that he sounds brusque but unable to help it. Of all the days for MJ to spring this on him, she couldn’t have picked a worse one. He’s exhausted from his fight with Electro and the last thing he wants to do is try to impress a girl. “Nice to meet you, Marisol,” he says. He turns to MJ. “A word?”\n“Of course,” MJ says, confusion evident. “Be right back!” she calls to Marisol over her shoulder as Peter leads her away from the table. Marisol, for her part, gives a little wave, brow furrowed.\nUnfortunately, there’s nowhere to go that could be considered private, so Peter settles for being out of earshot. He puts his back to Marisol so the poor girl can’t see his borderline murderous expression. “I see what you’re doing here,” he tells MJ, voice low. “And I don’t appreciate it.”\nMJ tries to feign innocence. “I don’t know what you mean, Pete. I just thought-“\n“You just thought, hey, dinner with Peter, perfect opportunity to set him up with someone. And, let me guess, you were going to find some convenient excuse to duck out after the appetizers, leaving us alone? And then we would what, magically fall in love?”\nMJ is scowling now, offended. “I thought it might be nice for you to meet someone new. That’s all.”\nA metaphorical lightbulb flickers to life above Peter’s head. He points accusingly. “You’ve been talking to Aunt May, haven’t you?”\nFor a second it looks like MJ might try to deny it. In the end, she decides to go with the truth. “Yes,” she admits, tilting her chin up like she’s daring Peter to challenge her. “And she’s right. You need to put yourself out there! Even if it doesn’t work out romantically, you could always make some new friends.”\nPeter groans, frustrated. “I don’t need new friends! And I don’t need you and Aunt May scheming behind my back!”\n“Oh, don’t be a child, Peter. We aren’t scheming. Is it really going to hurt anything for you to sit down and have dinner with a pretty girl? No. Now put on your big boy pants and let’s go back to the table before she decides she’s fed up and leaves. Okay?”\nPeter thinks about arguing some more. He even thinks about storming out but none of this is Marisol’s fault and she’s the only one whose feelings would get hurt if he left without an explanation.\n“You do look pretty tired, Pete,” MJ notes. Concern colors her voice. “Have you been sleeping alright?”\nPeter touches his own face. Great, something else to be self-conscious about.\nHe doesn’t dignify MJ with an answer. Instead, he turns on his heel and, fake smile plastered firmly in place, goes back to the table. MJ follows behind at a leisurely pace, giving Peter plenty of time to arrive before her and make their apologies.\nMarisol takes it all in stride. She really is a lovely girl. Not just in looks but in manner. She’s graceful and elegant and smart and she laughs at Peter’s dumb jokes- and even supplies some of her own. So why, then, is Peter having to fake the cheer on his face? Why can’t he invest himself in the conversation? Why doesn’t he care, at the end of it all, whether or not she’s impressed with him?\n“No chemistry,” he tells MJ after dinner, as the two of them wait for their cabs. “She’s beautiful, obviously, but. There was nothing there.”\n“Seems like she would disagree. She gave you her number, Peter.”\nPeter absently fingers the scrap of paper in his pocket. He shrugs. There’s a pretty good chance he’ll never use it.\nMJ huffs, annoyed. “It’s never going to work if you don’t at least try, you know.”\n“I shouldn’t have to try. I never had to try with Gwen. Or Harry. I never have to try with you. It just… comes naturally. Because there’s chemistry. Platonic or otherwise.”\nMJ rolls her eyes hard enough that Peter is afraid she might dislodge them. “When are you going to stop comparing everyone to Gwen? No one else is Gwen. No one is ever going to measure up. But you can find something new, something different. Something just as good.” She thumps him on the shoulder. “But not if you keep dismissing everyone you meet as not good enough the second you lay eyes on them!”\nPeter rubs at his shoulder, wincing. MJ packs quite the punch despite looking so unassuming. “Just please don’t set me up with anyone else without warning me first? Okay? Can we at least agree that’s a little underhanded?”\n“Whatever,” MJ grumbles. “Anyone else would’ve been thrilled to walk in and see a girl like that sitting there.”\nPeter really doesn’t want to acknowledge the truth of that.\n-\nPeter has a pretty well-kept routine, barring any Spider-Man issues that crop up. On Friday’s, he goes grocery shopping, which is exactly what he’s doing when Wade decides to make another appearance.\nWade is in civvies this time, aside from his usual mask and gloves which remain firmly in place. Peter is starting to think they might be glued on. He’d test the theory if he didn’t think Wade would get royally pissed. There’s also the whole invasion of privacy thing but damn if Peter isn’t dying to know what the mercenary finds so off-putting about his own face. It can’t be all that bad. And, even if it is that bad and Wade is lacking skin or covered in festering boils or actually a leper, Peter already knows he wouldn’t run screaming, like Wade seems to think. Peter isn’t charmed by him because of what he does or doesn’t look like.\nActually, scratch that, Peter isn’t charmed by him at all. That would be weird. And bad.\nHe shakes his head as if he can dislodge the thought entirely from his brain. It doesn’t work, but he decides to pretend it never occurred and forces himself to refocus on his grocery list, which mostly contains microwaveable meals and various flavors of ramen noodles. Aunt May would be disappointed in him.\nPeter decides to try and grab his things and leave as quickly as possible, figuring that the less time Wade spends around him out of costume the less likely he is to recognize Peter as Spider-Man. He almost makes it out without incident, too, but then he rounds the corner of an aisle and there Wade is, helping a petite elderly lady reach things on the top shelf. Peter’s first instinct is to retreat but the image of famed and deadly mercenary Deadpool helping tiny old people do things as mundane as grocery shop holds him enthralled long enough for Wade to spot him and then there’s no escape.\n“Petey!” Deadpool shouts, pointing. He says something in hushed tones to the old woman that has her giggling behind her hand and then jogs over, excitement etched in every line of his body. “Remember me?” he asks, stopping a few feet in front of Peter, as if anyone normal would forget an encounter like the one they had in the coffee shop.\n“Of course. Wade Wilson. Alliteration buddies.”\n“You do remember! Shit, what are the odds, right? This city is crazy big but we just keep bumping into each other. Must be fate!”\n“I dunno,” Peter hedges. “It’s only happened twice…”\n“You’re even cuter standing up,” Wade says, talking over him. Peter can’t see his eyes but he gets the distinct impression he’s being given a once over. The impression is solidified when Wade adds, “You work out? You’re pretty toned for a geek.”\n“Sometimes.” Peter is suddenly hyper-aware of how unkempt his hair is and how pale he is and the fact that there’s a stain near the bottom of his shirt. All things he doesn’t have to worry about as Spider-Man. Spider-Man never has stains. Peter shifts awkwardly on his feet. “What are you doing here, Wade?”\n“As of two seconds ago, helping Martha reach the olives.”\n“Martha?”\n“Yeah. Nice old lady, three grandchildren, and one on the way. Lost her husband last year. She plays bridge every Monday. Always wanted a pony. Just met her five minutes ago but it’s amazing what people will tell you once you get them talking.”\nPeter blinks. “Right. Sure.”\n“But if you were asking what I’m doing here in general, well. Even heroes have to eat. And sadly I can’t just eat tacos and chimichangas. I asked.”\n“Who the hell did you ask?” Peter wonders.\nWade doesn’t answer. Instead, he leans in close. He seems to be studying Peter. Then he says, voice soft, “Your smile…”\nPeter hadn’t been aware he was even smiling. Now that attention’s been drawn to it, it drops. “What about it?” he asks, defensive. Bracing himself for Wade to out him to the world as Spider-Man as a worst-case scenario.\n“Nooo, don’t stop,” Wade whines. He touches the corner of Peter’s mouth, very lightly. Peter stands very still. “It’s- it’s nice. You’re really… really…”\nHe trails off. Peter never gets to find out what he really is because Martha, having made it five more feet down the aisle, calls Wade’s name. Wade immediately straightens, touch disappearing. He shrugs apologetically. “Sorry, Petey. Duty calls.”\nPeter wants to protest, wants to demand that Wade come back and finish that thought right this instant. What is he really? Really cute? Really entertaining? Really something? Of course, Peter doesn’t say anything. He just nods his understanding, hesitates just long enough to watch Wade skip down the aisle, and then takes his leave.\nPeter just hopes he hadn’t been about to say really familiar.\n-\nAs far as patrols go, this has been one of Peter’s quieter nights. It’s a nice night, too. The sky is clear, the moon is bright, the weather is perfect for web-slinging, but tonight Peter almost wishes there was someone in need of rescuing or some problem to solve. It would spare him having to be alone with his thoughts, which have turned traitor on him. All he can think about is his encounter with Wade earlier today. He keeps turning it over and over in his head, then wondering why he cares so much, then getting frustrated that he cares so much, and so on and so forth. It’s a never-ending cycle.\nIt’s almost a relief when Wade shows up in the flesh.\n“We have got to stop meeting like this. On rooftops, I mean. It’s romantic and all but I have a helluva time getting up here.”\nPeter doesn’t startle when Wade sidles up beside him and places a hand on his shoulder. He’d heard him coming, though Peter suspects that was deliberate. He doubts very seriously that Wade would fail to sneak up on him if he really wanted to.\n“You know, you’re a hard spider to find. You really should have a spider signal. Like the bat signal, with the giant fucking bat projected onto the clouds. Except yours would be a spider, obviously. Genius, right? Hold on- are we allowed to talk about Batman? Rival franchises and all.”\n“I have no idea what you’re talking about,” Peter admits, “But it sounds like a dumb idea.”\nWade scoffs. “Fine. Get a pager or something then, Christ.”\n“Pager? What is this, the nineties?”\nWade tilts his head. “I don’t know, is it? ‘S hard to keep track. But that’s beside the point. The point is, it’d be nice if I had a way to contact you.” He scuffs the toe of his boot along the ground, suddenly very interested in everything that isn’t Peter. “In case there’s any, uh. Emergencies. And whatnot.”\n“In case of whatnot,” Peter parrots, watching him. “Right, makes sense.”\n“What if I need to call in that favor, hm? What if I need to call in that favor all the way from Bolivia?”\nPeter considers this. “Are you going to Bolivia?”\n“Well, no,” Wade admits. “But I am gonna be gone for a few days. Got a job. Can’t say where, though, then I’d have to kill ya. Wait. Am I allowed to say that? Is it funny when I say it, or scary? I can’t see your face, help me out here.”\nPeter clears his throat. There’s a weird pang in his chest. He doesn’t like it. “Depends on whether or not you mean it, I guess,” he says. It sounds kind of hollow.\n“I’d never kill you, Spidey.” He reaches over to pinch Peter’s cheek. Hard to do with the mask in the way but Wade doesn’t let that deter him. “You’re just too darn cute!”\nPeter ignores him. “So… you’re leaving? For how long?”\n“However long it takes to get the job done. Five days tops. Probably. Maybe. Why? Is there a certain hero in red and blue spandex that’s gonna miss me while I’m gone?”\n“You wish,” Peter says, but it sounds unconvincing even to him. He shouldn’t care. He knows he shouldn’t care. What’s more, he knows Wade is probably going off to kill someone in exchange for money. Why doesn’t that bother him like it used to? Maybe it’s just gotten a little too easy to pretend otherwise. They don’t talk about it and Wade doesn’t kill in front of him, or in New York at all as far as Peter can tell. His way of following the rules.\nWade bumps their hips together. “Aw, shucks. I won’t be gone long. Not since I just got your permission to hang around and all. I’ll be back to bother you before you know it!”\n“That a promise?”\nMaybe Wade picks up on Peter’s uncharacteristically somber tone because his own sobers up to match it. “Told you, lying ain’t my bag. Not sure why you’d care, though. I figured you’d be happy to have me out of your hair. Like the other heroes.”\n“Like you said, I’m the only hero with any sense.” It comes out quiet, nearly a whisper.\nWade chuckles, low. “That you are. I’m not used to anyone worrying about me, you know. I think I like it.”\n“Worrying? Who’s worrying? I’m not worrying.” Peter realizes, rather abruptly, just how close the two of them are standing. It seems prudent to put some distance between them. “I’ll, um. I’ll find something,” he says, stepping back. “Some way for us to keep in touch. Just in case.”\n“Just in case,” Wade agrees. Peter would swear he’s smirking under that mask. “We’ll work something out when I get back, yeah? Just don’t croak on me while I’m gone and we’re golden.”\n“I’ll do my best,” Peter promises, marveling at how quickly he’s grown attached to someone that is so ridiculously off-limits and should be impossible to like. It’s just his luck, he supposes.\nWade is gone for two weeks.\nPeter tries not to think about it. At first, it’s easy. Spider-Man is kept busy. In the first five days alone he stops three attempted muggings, puts Rhino back where he belongs, foils one of Loki’s many plans for world domination with the Avengers, and helps Wolverine track down Mystique who, it turns out, is holed up in a penthouse suite under an assumed name with something valuable taken from Xavier’s school.\nAfter that, though, things get quiet. Then six days have gone by, and then seven, and then ten, and by the thirteenth day Peter is officially concerned.\nBy the time he decides to swing by Wade’s apartment and check on things just in case, he’s exhausted. Spider-Man spent the morning taking down Mysterio and the evening putting a stop to a pyromaniac with a homemade flamethrower. Peter spent all his free time in between working on a project that’s due in two days and he’s had three sleepless nights in a row. He’s dead on his feet and he knows it, but he also knows he won’t be able to rest entirely easy until he’s sure that Wade is okay. He chooses not to examine too closely why exactly that might be.\nThere’s a light on in Wade’s window, which briefly gives him hope. Peter climbs up to the window with ease and finds it unlocked. That, too, gives him hope that Wade might be home after all, but the apartment is empty. Peter calls Wade’s name- he’s not there to sneak up on the man, after all, and in fact, feels like that would be a very bad idea- and gets no reply. He searches every room and finds nothing but dust, furniture, and naturally accumulated clutter.\nHe hadn’t actually expected to find Wade at home but he’s still somehow disappointed. He sinks down on Wade’s couch with a heavy sigh and notes, idly, that the place does smell nice, kind of like fresh linen. That would presumably be thanks to the air fresheners that Wade mentioned.\n“Where are you?” he murmurs to himself, squinting accusingly at Wade’s TV. His own face is reflected back at him from the dark screen.\nPeter thinks about getting up. He means to get up and go home, he really does, but Wade’s couch is comfortable and it’s so quiet and peaceful and he’s so tired…\nHis nap is entirely accidental.\nIf he has dreams, he doesn’t remember them.\nHe wakes sometime later to someone softly calling his name. Not his name, but Spider-Man’s name. Over and over, growing more frantic with each repetition. Peter finally regains consciousness right around the time Wade is saying, “Please tell me you didn’t die on my couch. I’d never be able to explain that.”\nPeter blinks his eyes open, becomes painfully aware of how his suit is sticking to him and how itchy his mask is, then realizes he’s still on Wade’s couch, head pillowed on the armrest. Wade is kneeling on the floor beside him. His hand, heavy and warm, is resting lightly on Peter’s bicep. He’s definitely not dead. Relief is the first thing Peter feels but hot on its heels is mortification. \nPeter groans. He places his hands over his face. He says, voice still rough with sleep, “Of course you’d come home the one night I just happen to fall asleep on your couch like some creepy stalker.”\n“Don’t worry,” Wade says. “I think it’s cute. In fact, this is probably the best thing I’ve ever come home to.”\nPeter peeks out at him from between his fingers. Sometimes he really wishes he could see Wade’s face, read his expression. It’s selfish, that wish, especially when Peter knows he could never return the favor. “You… don’t want to know why I’m here?”\n“Nah.” Wade squeezes his arm once, reassuring, and lets go. “I’m just gonna assume it’s because you were worried about me- which is stupid, by the way, even if it is flattering- or you missed me so much you… wanted to be surrounded by my shit for some reason? I didn’t think these through too hard but shhh, don’t tell me otherwise and ruin the fantasy, k?”\nPeter’s brain is still working too slowly for him to come up with a suitable retort. He opens his mouth, closes it, and opens it again. What finally comes out is, “What happened to you?” He props himself up on an elbow to get a better look.\nNot only is Wade spattered with blood, but there are also holes torn in his suit. There’s one in particular that catches Peter’s eye, right at the curve of his neck. The skin revealed there is scarred and uneven and Peter is weirdly fascinated. He reaches out, stops just short of touching, pauses there. Wade doesn’t seem to be breathing. “Are… you okay?” Peter ventures, taking his hand back.\nFor a second, Wade is silent and perfectly still. Then, abruptly, he holds up his own hand, which has a bloody white towel wrapped around it. “I will be!” he chirps, sounding far too cheerful for someone who looks to have lost as much blood as he has.\n“What happened?” Peter repeats, cringing on his behalf.\n“Just had a little teeny tiny minor setback, no big deal. Not the first time I’ve had to regrow a limb, won’t be the last. But, hey, you should’ve seen the other guy. I look like a fucking treat compared to him, lemme tell ya.”\n“Please don’t,” Peter mumbles.\nWade stands. Peter starts to rise with him, either to accommodate him on the couch or to leave, like he feels he probably should. Instead, Wade lifts Peter’s legs with his uninjured arm, plops himself down on the couch, and resettles Peter’s legs across his lap, which reads to Peter like a clear invitation to stay. Peter, hesitant, wills himself to relax back into the cushions. He watches the way Wade’s fingers curl casually around his ankle.\n“You know you were gone for two weeks?” Peter presses. Wade’s suit is ripped along his thigh. The skin there is scarred, too.\n“Was I? Well, you know what they say. Time flies when you’re yada yada- oh, wait! That’s why you’re here! Because I was gone so long. Okay, I can work with that. That’s fine. But, you know, Spidey, you really don’t have to worry about me.”\n“I wasn’t-“ Peter cuts himself off with a groan. “Ugh, whatever. See if I ever come check on you again.”\n“So you were checking on me!” Wade does a victorious fist pump with his rag-wrapped hand. “Knew it! Well, my eight-legged pal-“\n“I don’t have eight legs. I very clearly don’t have eight legs-“\n“-This should help put your mind at ease.” Wade wiggles around, jostling Peter until he can get at a particular pouch. He pulls out an old flip phone, brandishes it with pride. “Ta-dah! It’s personalized and everything!”\nPeter takes it. He flips it open and closed, and finally turns it around. “By ‘personalized’ I guess you mean you put a Deadpool sticker on the back?”\nWade’s reply is a thumbs up. “Mine has a tiny Spider-Man! Genius, right? It’s so we can keep in touch. In case of emergencies, like I said before. My number’s already programmed in.”\nPeter slides his thumb around the edge of the small screen. “I’m… why did you- I said I’d figure something out, you didn’t have to do this.”\n“I just figured, you have a secret identity, I don’t, so it’d be easier for me to get us phones and shit. This way no one can trace them back to you. Thoughtful, aren’t I? It’s okay, you don’t have to hide your swooning, I won’t let it go to my head.”\nPeter chuckles. “Spider-Man doesn’t swoon. But… thanks. Now I can just text you like a normal person instead of breaking into your apartment.”\n“Next time I might have to call the cops on you.” He gestures. “I think there’s a remote somewhere by your head and I’m pretty sure Star Trek reruns are on and we’re missing them.”\nPeter fishes around blindly with his hand until it comes into contact with the remote. He’s just started flipping channels when Wade says, “Oh, and one more thing, Spidey. You usually sleep in your suit?”\nPeter digs his heel into Wade’s leg. “Shut up,” he grumbles.\n-\n“Not so fast!”\nThe would-be assassin freezes, blade drawn and poised to finish off her quarry. She’s dressed like a dime-store ninja, mask pulled up to obscure the lower part of her face. Her eyes watch him with no small amount of shrewdness. The scientist in her hold is so scared he looks like he might wet himself. Peter prays he at least waits until the fight is over.\n“Let him go,” Peter orders, not at all surprised when the woman ignores him and raises her blade once more. Peter rolls his eyes. “They never listen,” he complains, mostly to himself. He fires web at her, intending to pull the blade from her hand, but she’s light on her feet. She flips backward, dodging his every shot. He pauses, just for the barest of seconds, to reassess. She takes the opportunity to rush him. She moves like fluid and she’s on him before he knows it. He barely has time to swing himself out of the way and even then she manages to nick his leg, cutting through the fabric of his suit with ease.\nFrom the safety of the rafters, he examines the cut. It’s not too bad, long but not all that deep. He’s definitely had worse before.\nShe stands below, watching him, pacing back and forth. The scientist has scrambled away but she blocks the only exit from the room.\n“That the best you got?” Peter calls down to her. “I’ve got a friend who wields a katana better than you in his sleep.”\nHer voice, when she speaks, is high but rough like sandpaper and sounds like hissing. She has an accent but it isn’t one that Peter can place. “Does he also poison his blades?” she asks, faux-sweet.\nPeter looks back down at the cut. “… You’re bluffing.”\nShe brandishes the sword. The edge is now adorned with his blood. “One hit. That’s all I ever need, little hero.”\nHe fires more web at her, which she dodges easily, but he uses her distraction as an opportunity to swing himself at her, intending to take her off her feet. She dodges that, too, and Peter starts to feel the effects of the poison right around the time he hits the ground. He rolls into standing, poised to counter any incoming blows, but she’s still just watching him, mirth dancing in her eyes. \n“Oh, no,” he mutters as his vision begins to go double. This is entirely too much like the time he was recently drugged, he thinks. His limbs already feel sluggish and heavy and his knees weak. This isn’t a feeling he wants to get used to.\n“Don’t worry,” says the woman. “You were not part of the contract. In such a small dose my poison probably won’t kill you. It will just incapacitate you long enough for me to finish the job I was sent here to do.”\nPeter stumbles towards her, not sure what he intends to do but just knowing he has to do something.\nA shot rings out, taking the woman in the shoulder and narrowly missing Peter himself. She cries out in pain and falls to one knee, sword abandoned. She clasps a hand over her new wound and looks around, confused and angry, but Peter already knows who it is even before Wade announces himself.\n“Ah, there you are,” Wade says casually, sidling up to Peter. He twirls the gun around his finger. “My little damsel in distress.”\n“I’m not a- never mind.” He decides not to question how Wade knew where he would be or exactly the right moment to show up. Instead, he advances on the woman, even though he feels like his legs might give out from beneath him at any second. “Who sent you?” he demands to know. “Why kill this scientist?”\nShe grits her teeth and says nothing.\n“Uh, honey,” Wade says, tapping him on the shoulder. “The cops are on their way. Shouldn’t we, you know, vamoose?” He levels the gun at the woman, finger on the trigger. “I can take care of this problem real quick.”\n“Don’t kill her,” Peter snaps. The cut on his leg is burning now. It feels like it’s on fire.\n“Fine,” Wade snaps back. “I’ll just make sure she can’t get up and follow us.” He fires before Peter can protest again, hitting the woman in the knee and knocking her on her ass. She screams, a sound of rage and hurt, and writhes uselessly on the floor.\n“Now come on- whoa there, buddy.” Wade catches Peter as he sways nearly off his feet. “You’re a little unsteady. What happened? Wait, don’t tell me she cut you. I know this chick. Made a name for herself in the merc business by playing dirty.”\n“I- yeah. Yeah, she did. So get me out of here before I embarrass myself.”\n“Roger that.”\nPeter refuses to be carried. He makes it most of the way outside by himself and then has to clutch shamefully at Wade’s arm to make it the rest of the way. They’re already a block gone by the time the cops show up, sirens announcing their presence behind them. It’s slow going and with every step, Peter feels the effects of the poison more and more.\n“Since it doesn’t seem like you’re in any shape to do any web-slinging,” Wade says, taking them down the next side street, putting them out of the eye line of any cops. “We’ll call a cab.”\n“A cab? Dressed like this?”\n“Yeah, I do it all the time. They’ll just think we’re cosplayers or something.”\n“Coswhats?”\n“Doesn’t matter. Point is, it’ll be fine.”\n“You have real weapons strapped to you.”\nWade shrugs. “New York cabbies,” he says like that makes his point.\nTrue to his word, they have no more trouble than usual getting a cab. The cab driver doesn’t so much as look at them sideways when they climb in. \nPeter rests his head against the window. The cool glass feels nice. It would feel nicer if he could remove his mask but he’ll take what he can get. “I guess I owe you double, now,” Peter says. Wade doesn’t reply. “You said you knew her? That woman?”\n“Oh, not well. But we merc’s tend to keep tabs on each other. I mean, she is my competition, more or less. Hey, you’re not gonna die, are you? Should we be going to a hospital? Poisons are a little outside my purview.”\n“No, no hospital. Don’t trust anyone there.” He closes his eyes against a wave of dizziness. “So, she was paid to kill him and probably didn’t even know why.” He hums, turning it over in his head. “He was probably crooked. Got on the wrong side of the wrong people. I don’t trust anyone at Oscorp anymore.”\n“So why save him?”\n“Whatever he did, he didn’t deserve to die for it.”\nWade is quiet for a moment. Then, “And her? She’s a paid killer. She’ll survive this and go right back to taking contracts.”\n“She’ll survive this and go through the system.” Peter sighs. “People can change, Wade. Even people like her.”\nWade seems to have no retort for that. He lets it drop and the rest of the cab ride is spent in silence. Peter doesn’t even realize where they’re going until they arrive outside Wade’s apartment building. Of course, Wade would bring him here. Where else could they go?\nThey stumble up the stairs and in through the doorway, Peter limping and dizzy and Wade doing his best to support him without actually carrying him. Peter doesn’t know where he’s trying to go or what he’s trying to do, it just becomes abundantly clear all at once that he needs to sit down, right now, or else topple over.\nHe tries to convey this to Wade by gesturing without actually letting go of him. He tugs, pulling Wade toward the couch while Wade tries to hold him steady. They fall, of course, right over the back of the couch and into a heap on the other side, half on the cushions and half on the floor. They’re still holding onto each other. Wade is laughing breathlessly.\n“Come- Spidey, come here. Up and at ‘em,” he says, pulling Peter all the way onto the couch. Their legs are a tangled mess. Wade tries to separate, to drag himself out from under Peter, but Peter protests.\n“No, no, no. Stop, stay,” he says, clinging, curling his fingers into the fabric of Wade’s suit. He rests his head on Wade’s chest and wills him to be still. “I’m- I’ll be fine, I’m just…” He trails off as Wade settles beneath him. Wade is so warm and he smells masculine and familiar and Peter can hear his heartbeat, fast and a little erratic.\nPeter doesn’t protest in the slightest when Wade winds his arms around him. He strokes his fingers down Peter’s spine, soothing. “It’s alright, baby boy, just get some rest. You’ll heal up in no time. This is nothing for the amazing Spider-Man, right? Shrug it off, kiddo, you’ll be fine.”\nPeter isn’t sure if Wade is babbling for his own benefit or for Peter’s but Peter appreciates it either way. He can feel the vibrations of Wade’s voice through his chest. It pulls him under, lulling him to sleep. He’d swear that just before he drops off, Wade brushes a kiss against his temple, but maybe that’s just a dream.\n-\nThere’s no confusion the next morning. Peter wakes up and he knows where he is and exactly how he got there. He’s in Wade’s living room, and that’s Wade breathing deep and even beneath him. Those are Wade’s arms wrapped around him. That’s Wade’s heartbeat in his ears, much slower and steadier, now.\nThe only surprise lies in the fact that Peter doesn’t want to move. Wade is firm and solid beneath him and Peter feels- warm and safe and surprisingly well-rested, all things considered. It should feel awkward, shouldn’t it? Somehow, it doesn’t, not even when Wade begins to stir, waking slowly to the world around him. Peter doesn’t feel a need to run for the hills, or even really a need to move, especially not when Wade’s hold on him only tightens as he wakes.\n“Psst, Spidey, you awake?” Wade stage-whispers. He pokes the side of Peter’s face.\nPeter nods. Wade sounds different in the morning. He absently files that information away.\n“Oh, good. So you didn’t die after all. But what the fuck is it with you and my couch? Do- do spiders like couches? Is that a thing?”\nPeter groans. He takes Wade’s nonsensical question as his cue to finally move. He rolls off of the mercenary and into a sitting position on the floor. “I think,” he says slowly, taking note of the dull throb behind his eyes and the slight nausea making his stomach churn. “That I feel hungover. Which sucks, because I didn’t even get the fun part of being drunk.”\n“Oooh, I bet that’d be fun. Drunk Spider-Man. You know, if you were legal.” Wade sits up. His mask went slightly askew at some point during the night but he fixes it quick enough. His gloves are missing, Peter notices. He isn’t sure if Wade lost them last night or removed them himself. “How’s your leg?”\nPeter turns it over to examine the cut on his calf. “Well, it stopped bleeding,” he says. “But I should probably disinfect it before we wind up having to amputate.”\nWade stands and offers a hand up to Peter, who takes it gladly. “Come on, I’ve got stuff for that in the bathroom.”\n“Disinfectant stuff? But I thought you didn’t need that kind of thing?”\n“I don’t,” Wade agrees, and elaborates no further.\nWade’s bathroom is much like the rest of his apartment. Sort of dingy and cluttered but clean enough that Peter doesn’t have any qualms about hopping up on the counter when Wade directs him to.\nWade cleans the wound like he’s done it a thousand times before. First, he cleans around it with a wet rag, getting at all the dried blood that Peter’s suit will allow him to. He’s gentle, surprisingly so. He even lets the water warm up a little before he takes it to Peter’s skin. He warns Peter before he pours the alcohol on but still says “sorry, sorry” when Peter hisses in pain. Finally, he tapes the bandage on with careful fingers, pressing lightly. At the end of it all, he calls Peter a good patient and coos, “Do you want a lollipop?”\n“I don’t think I want whatever lollipop you’re offering,” Peter quips.\n“Gutter mind,” Wade snipes back. He’s standing between Peter’s legs, now, arms braced on the countertop. Peter just really, really wants to see his face. He wants to be able to read what he’s thinking there, to know the shape of his eyes and the curve of his smile. He doesn’t know why. It’s irrational and unfair but he can’t help it. He stares hard at Wade’s oh-so-familiar mask, tries to imagine what lies beneath it, but his imagination, he’s sure, doesn’t do the real thing justice.\nPeter raises his hand slowly, makes no sudden movements. Wade still flinches, ever so slightly, when Peter’s fingers come to rest on the curve of his cheekbone. Then, he stills beneath the touch and waits.\n“Do you ever take it off?” Peter wonders. He touches Wade’s brow bone, follows it down to the slope of his nose.\n“Not around you,” Wade answers honestly.\nPeter places his fingers over Wade’s lips, then lets his hand drop. “Why not?”\nWade shakes his head. He creates space between them, backing up until Peter has room to hop down. “It doesn’t matter,” he says, dismissive. Then, “Do you wanna grab breakfast? I could really go for some pancakes.”\nPeter lets him get away with the subject change, but not happily. “Sure,” he says and decides that this may not be the worst morning he’s ever had.\nPeter keeps checking his phone. Or, not his phone, the phone Wade gave him. He does it almost absently, pulling it from his pocket, flipping it open, then closed, then slipping it away again. He’d just- he’d thought that when Wade, notorious Spider-Man fanboy, got ahold of a way to contact him, he’d be hearing from the man nonstop. So far- nothing. Actually, Peter hasn’t heard a peep out of him since their pancake breakfast two mornings ago. He’s not worried but he is miffed.\nPeter considers texting him first but... What if Wade doesn’t want to hear from him? What if Peter crossed some sort of line the last time they were together without even realizing it? What if Wade was serious about the whole emergencies only thing? Why is Peter stressing over it like this?\nAs the elevator doors slide open, Peter slips the phone back into his pocket.\nThe Bugle is always a bustling place, even on an otherwise calm weekday. People are walking briskly here and there, shuffling papers. Faxes are being sent and mouses are being clicked and keys are being typed and conversations are being held, some louder than others. That’s why Peter doesn’t hear it at first. In fact, he doesn’t hear anything out of the ordinary until he’s a scant few feet from Jameson’s door.\n“- fucking redact it! Redact it!”\nPeter freezes. He listens harder.\n“Redact-? Do you even know what that means, kid? I can’t redact it! It’s out there! You can’t un-print what’s been printed!” That’s Jameson’s voice, sounding more annoyed than usual, which is an impressive feat. Peter is pretty sure he recognizes the other voice as well, though he’s quietly hoping he’s wrong.\n“You better find a way or I’ll…”\n“You’ll what?” Jameson challenges.\n“You better be real fucking glad that Spider-Man doesn’t want me killing. He’s the only goddamn reason your brains aren’t paste right now, you get me?”\nDefinitely Wade, then, sounding downright scary. It’s as if Peter conjured him there just by thinking about him. He places his hand on the knob, intending to interrupt before Deadpool decides he no longer cares what Spider-Man thinks of him and offs Jameson in a fit of annoyance.\n“Listen,” Wade continues, taking the murderous tone down a notch or two, maybe even attempting to sound reasonable. Peter pauses again, silently scolding himself for eavesdropping even as he continues to do just that. “Spider-Man, he’s- he won’t like this. This makes him look bad, see?”\n“If you think I give a fig what Spider-Man thinks, you’re dead wrong. He’s a menace! Do you even read our paper, son? We’re always printing stories like this. They sell and they get the truth out there.”\n“But I am not okay with contributing to Spider-Man slander! He can’t be seen with me. Not- not like this. It’s not good, it’s-“\nPeter, feeling some combination of touched, confused, and worried, finally decides to cut in. He swings the door open, surprising both Jameson and Wade. “If it’s written, it’s libel.”\n“I know,” Jameson snaps, at the same time Wade asks, “What?”\n“If it’s written, it’s libel. Not slander,” Peter explains. Wade is wearing a hoodie over his suit again. This one has the word meh printed across the front in bold letters. His pouches and weapons are nowhere to be seen.\n“Peter! What are you doing here?” Wade opens his arms like he might go in for a hug. He doesn’t, though, just gestures widely. “Waaaaait a minute. Peter Parker. I knew I knew that name from somewhere- you take Spider-Man’s picture all the time!”\nPeter fidgets. “Um, yeah-“\n“Did you take this?” Wade picks a paper up off of Jameson’s desk and thrusts it angrily under Peter’s nose. There’s a picture of Spider-Man and Deadpool on the front page, probably taken after their run-in with the mercenary woman. It’s grainy, clearly not professional, snapped with a cell phone camera or something of the like. In it, the two of them are leaning on each other, seemingly walking arm in arm. In reality, Peter knows, he was hanging on to Wade to keep from falling on his ass.\nThe headline reads, SPIDER-MAN GETTING CHUMMY WITH FELLOW MASKED FREAK. The article details an eyewitness account of the two of them making their way down the street that night and recounts a few of Wade’s less charming public outings, including the time he slaughtered several people on a highway overpass. Peter would like to believe it’s an over-exaggerated retelling.\n“No, wasn’t me,” he tells Wade matter-of-factly. “First of all, look at the quality, and secondly, I don’t have to resort to sleazy pap shots.” This last is meant mostly for Jameson, who gives him the stink eye. “Wade, I wouldn’t take your picture without your permission. Not ever.”\n“You know this bozo, Parker?” Jameson asks. “Why am I not surprised? And why am I not calling the cops right now?”\nPeter ignores him. Wade is being too quiet. “You believe me, right?”\nWade clears his throat. “I- yeah. Thanks, Petey. But that doesn’t solve my current conundrum. Spider-Man’s panties are gonna be in a wad when he sees this. You know, if he wore any. I’m pretty sure he doesn’t. The suit’s too tight, right? He’d have a panty line visible from space.” He pauses as if Peter is going to either confirm or deny that Spider-Man goes commando. Peter doesn’t, so Wade plows on. “I’ve been trying to get on his good side and this is gonna set me back several fucking light-years. I know he doesn’t wanna be seen with me-“\n“What makes you think that?” Peter wonders. The two of them had, after all, just gone out to breakfast together for all the city to see and Peter can’t recall ever insinuating he wouldn’t want to be associated with Deadpool even if it is, technically, true- or rather, it used to be true. Now Peter finds he’s… mostly okay with it. Or, not okay. It’s bad, in some ways. The Avengers aren’t going to like it. The X-Men aren’t going to like it. It’s going to give some people a sour taste in their mouth about Spider-Man. He’s not angry about it the way he would’ve been a few weeks ago, though.\n“It’s just common sense,” Wade says, as though Peter is being dense. “He’s a hero. I’m a killer. He’s got a reputation that needs to stay untarnished. People look up to him, like little kids and stuff. It’s alright if he’s seen with me every now and then, out in the city, but making the front page? With a headline like that? That’s a big deal.”\nStrange how Wade is only saying exactly what Peter’s been thinking, but now that it’s been said all Peter wants to do is contradict it. He opens his mouth to do just that but Wade interrupts him with a curse. “And now,” he says dramatically, moving his limbs in a way that somehow suggests an eye roll. For someone whose face is always covered, he’s incredibly expressive. “You probably don’t want anything to do with me, either, since now you know I’m a killer. Shit.”\nPeter blinks. He tries to do a mental run-through of his other two out-of-costume encounters with Wade. It’s so hard to remember what Peter knows and what Spider-Man knows and keep them separate, but he's pretty sure Wade is right. He’d never mentioned his occupation to Peter. He only has about half a second to decide whether or not to play dumb. He settles on not.\n“I know what you are,” Peter carefully informs him. “I recognized the suit, the first time we met.” That’s plausible, right? Peter is supposedly friends with Spider-Man, after all. It wouldn’t be ridiculous for him to have heard of Deadpool.\nWade tilts his head to the side, considering. “And you still…?”\nJameson makes a disgusted noise. “Would you two take this somewhere else? If this idiot isn’t gonna kill me, I’ve gotta get back to work.”\nPeter is almost glad for the interruption.\n“Listen, mustache,” Wade growls, pivoting on his heel to point menacingly at Jameson. “Maybe this can’t be undone but if you ever even mention me in your paper again, especially alongside Spider-Man, I’ll come back here with a sword and gut you like a fish in front of your entire fucking staff.” He pauses, then lightly knocks the snow globe on Jameson’s desk onto the floor. It rolls and disappears beneath a filing cabinet. That done, he turns to leave.\n“I wish you would, you pansy,” Jameson snaps at Wade’s retreating back. Wade flips him off.\nPeter scurries after Wade, eager to give Jameson time to calm down. It seems like every eye in the office tracks them as Peter walks with Wade to the elevators, some with fear and some with curiosity. If Wade is bothered it doesn't show.\n“I can take it from here, Petey,” Wade tells him, jabbing the down button with more force than is strictly necessary. \n“It’s fine. I’ll- I’ll ride down with you. No one will miss me for a few minutes.”\n“Can’t get enough, huh?” Wade teases. “Even after I threatened to murderize your boss. Someone’s got it bad for the ol’ Wadester.”\nPeter rolls his eyes. Wade tuts.\n“Don’t deny it. I can see it in your big, beautiful doe eyes. But who can blame you? I mean, have you seen this physique?” Wade flexes. Pointlessly. His hoodie is too baggy. Peter knows all about his ‘physique’, though. Like Spider-Man, Deadpool’s costume leaves little to the imagination.\nPeter had almost forgotten Wade could see his face. He prays the poor lighting in the elevator obscures the way his cheeks have gone pink. “Yeah,” he says, attempting to play it off. He presses the lobby button before Wade has a chance to attack it. “Too bad your ‘heart belongs to someone else’. How’s that going, by the way?” Peter would be lying if he said he wasn’t just a little interested in the answer.\nWade shrugs. “He’s too good for me. Hard to believe, I know, but it’s true. And, actually, I’m not even sure he’s into dick? I forget not everyone is… like me.”\nPeter blinks. “And what are you like? If you don’t mind me asking, I mean.”\n“Hell if I know what kinda fancy label I’m supposed to put on it. Dick, boobs, both, neither- what’s it matter? They’re all just parts. This time those parts happen to belong to a dude, but it’s the dude I like, not the parts. You follow?”\n“Makes sense. You could always ask him.” Peter tries to remember if Wade has ever mentioned any other guys in his life, or anyone else, period. He hasn’t, either to Spider-Man or to Peter, but that doesn’t mean other people don’t exist in his world. Peter is well aware that Deadpool must have his secrets, same as Spider-Man. A family, maybe? Friends? Colleagues?\n“Oh, yeah, sure. Just drop that into casual conversation. ‘Uh, hey, bro, just wondering- do you get hard for guys, too, or is your penis only into vagina’?”\nPeter laughs. “Well, I wouldn’t phrase it like that.”\nWade waves a dismissive hand. “Doesn’t matter anyway. Like I said, he’s too good for me. Just like you.”\n“Me?”\n“Yes, you adorable little nerd, you.” Wade reaches over to ruffle Peter’s already-ruffled hair. Peter scowls and attempts to coax it back into place. The elevator dings and the doors slide open. “That’s my cue!” Wade chirps. “I’ll be seeing you, Petey!” He blows a kiss over his shoulder just as the doors start to slide shut again. Peter mimes catching it, mostly in the hopes that it will make Wade smile.\nOf course, when Peter arrives back in the office, everyone is watching him with questions in their eyes. Maureen is the only one to approach him. She’s one of his few friends at work so he obliges when she grills him about Deadpool, and about what went down in Jameson’s office. He carefully omits any of the more personal details of their acquaintance, mostly out of habit. Being overly cautious and private is second nature, now. It's for the best.\n-\nPeter is just getting home when the phone rings. The phone. The Deadpool one. It startles him so much he almost drops his camera.\nThe ringtone is Call Me Maybe and, Peter discovers when he flips the phone open, Deadpool has set his own name as Sexy Mofo. There’s a tiny picture of him throwing up the peace sign. It’s ridiculous… but it makes Peter smile.\n“What’s up?” is his greeting of choice, after some deliberation. Hello would’ve been too formal and yeah too dismissive.\n“Spidey, hey! I was hoping you’d pick up. Have you… had a chance to look at the paper today?” There’s a lot of background noise. It sounds like Wade must be out somewhere. Funny, to imagine him strolling casually down the sidewalk whilst on the phone with Spider-Man and undoubtedly decked out in all his gear.\n“Yeah, um. My friend, Peter- Peter Parker- said you stopped by the Bugle today. And that you seemed pretty upset.” Even after all this time, it’s still strange to refer to himself in the third person.\n“Oh.” Wade hesitates. “You guys talk, huh?”\n“Sometimes.”\n“Right… Did he say anything else, because-“\n“He said you threatened to gut his boss like a fish.”\n“That was… a joke. Mostly. Kind of. Listen- I called because I want you to know I had nothing to do with that story getting published but I totally understand if you want me to skip town, now. It doesn’t look good, I get it, I’m-“\n“Wade, stop,” Peter interrupts, aware that Wade would probably keep babbling until he cuts in. “You don’t have to leave. I get crap like that printed about me all the time. No one who matters will pay any attention to it.” He has no idea if he’s bullshitting or not. He just knows he doesn’t want Wade to leave. Silly, that. But it makes sense, doesn’t it? He’s pulled Peter’s ass out of the fire twice now. Having him around is clearly not a bad thing.\n“… You sure?” Wade ventures. The background noise has quieted down some like maybe Wade ducked into a building or off onto a side street.\n“I’m sure,” Peter promises.\nWade blows out a breath. “That’s a relief. I’m- oh. My date is here. Gotta go, Spides! Talk to you later. Thanks again!”\nThe line abruptly goes dead. Peter lowers the phone, stares at it where it rests in his palm.\n“Date?” he asks, dumbfounded. The phone chooses not to shed any light on the subject and Peter is ashamed to admit he spends the rest of his night wondering who on earth Wade might be on a date with.\n-\nWade calls again at 5:48 in the morning. Peter knows that’s what time it is because when he blinks his eyes open he happens to be facing a clock. It takes him several groggy seconds to realize those are the muffled strains of Call Me Maybe he’s hearing.\nHe digs the phone out from under his pillow, where he doesn’t remember placing it, and answers with a sleep-deprived, incoherent grumble.\n“Oh, did I wake you up? What time is it?”\nPeter runs a hand through his hair. It’s sticking up in all directions, he can feel it. “Too early,” he complains. “Please tell me you aren’t just calling to gossip.”\n“Nope. I’m calling in that favor you owe me. And also,” Wade giggles. “You sound adorable when you wake up.”\nThe first part of that gets Peter’s attention. He sits up. “Are you in trouble? What’s going on?”\n“No, no, everything’s fine. I got this gig I need help with.”\nPeter frowns at his closet door. “As in, a mercenary gig? I told you, I won’t-“\n“It’s not like that, Spidey. Come on, give me some credit. It’s a good guy gig. I mean, yeah, this rich old fuck is paying me a shit ton of money to do it, but it’s definitely not gonna give anyone any bad karma. Someone stole something from him, he wants us to steal it back. Or, me, actually, but it’ll be a hell of a lot easier if you help.”\nPeter feels woefully unprepared to listen to any of this at the moment but he soldiers on. “Details,” he demands, giving up on sleep entirely. He pushes the covers off himself and trudges into his kitchen to make coffee. He notices, absently, that his pajama pants are too long. They’re dragging the floor.\n“Okay, so. Some bad guys took this ancient, expensive artifact from our guy, who’s a collector or something. I dunno. I tend to zone out for the exposition. Anyway, they’re holding it at this mansion up in Colorado. It’s some real Mission Impossible shit. They’ve got it in this vault thing, right, and guarded by these gun-toting bastards, and the room it’s in has a pressure-sensitive floor. Which is where you come in, my wall-crawling comrade. I can get you in, no problem, then all you have to do is snag the stupid thing and we can be on our merry way, no casualties or anything. Probably.”\nPeter sighs. “I dunno, Wade-“\n“I’ll split the money with you. Fifty-fifty. That’s twenty-five thousand dollars for a day's work, Spides. Or two days, I guess. We’ve gotta head up there early for some recon. But your part- just a day. And not even a whole day! Probably just, like, an hour!”\nThat gives Peter pause. “It… wouldn’t be a favor if you paid me…”\n“Don’t sweat it. It’s not like I need the money. So, you in?”\nPeter bites his lip. On the one hand, he does owe Wade. Twice over, in fact. On the other hand, shady work. But back on the first hand, twenty-five thousand dollars… and it’s not like anyone has to know Spider-Man is getting paid to help out some poor old man who got robbed. That’s all people will see, right? Spider-Man helping out?\n“Fine. When do we leave?”\n“I feel ridiculous,” Peter announces.\nWade doesn’t look up from where he’s tinkering with something at the kitchen table. “Why’d you come in through the window? You always come in through the window. I have a perfectly good door, you know.”\nPeter drops his duffel bag in the recliner and goes to peek over Wade’s shoulder. “It’s the civvies,” he says, ignoring Wade’s question. “It feels weird to be wearing them and my mask.”\nWade finally glances over. He scoffs. “You look fine. And I do mean fine. So shut up and hand me that screwdriver over there.” He gestures vaguely behind himself.\nIt takes Peter a moment to locate said screwdriver. For some reason, it’s sitting in the spoon rest by the stove. “What are you doing?” he asks, passing it over. The thing in Wade’s hands is a strip of black leather, like a belt, with some kind of gizmo attached. The face of the gizmo is removed, revealing its innards, which Wade seems to be tampering with.\n“Shh,” Wade shushes him. “Just- stand over there and look pretty for a minute while I concentrate. But not too pretty, that would be distracting.” There’s a click. “Oh- wait! I got it! Yes!” He slides the faceplate back into place and stands, hoisting the belt victoriously.\n“…Yay?” Peter ventures. “What is it?”\n“This, my arachnid friend, is a teleportation belt. An old buddy made it for me but I hardly ever use it since it’s about as reliable as… something that’s not reliable.”\n“Did anyone ever tell you you’ve got a way with words?”\nWade waves him off. “It was on the fritz but I’m pretty sure I’ve got it working well enough to get us to Colorado and back.”\n“We’re teleporting there? Wait- what if it doesn’t work?”\nWade shrugs, which is the opposite of reassuring. “Grab your bag. This should take us straight to the hotel.”\nPeter does as instructed. Wade holds the belt in one hand, his own bag slung over his shoulder, and curls his fingers around Peter’s wrist with the other. “You might wanna hold your breath and close your eyes,” he says. “My first time wasn’t very fun.”\n“That’s what she said,” Peter mumbles, but he does as asked. He almost wants to leave his eyes open, just out of curiosity. He’s sure it would look quite strange. It feels quite strange, at any rate. One second Wade is beside him, breathing and holding his wrist and Peter can hear cars passing by outside and Wade’s neighbors stomping around upstairs. The next, all that disappears. All the noise just stops, all at once, and Peter can’t feel Wade beside him anymore. He only feels like some invisible weight is pressing in on him from all sides, making it difficult to breathe. Then, a split second later, the weight disappears, and sound returns. Different sounds, though. Wade, still beside him, but also people talking and papers shuffling and wheeled suitcases rolling across tile floors.\nPeter opens his eyes. They’ve arrived in the lobby of a hotel. There’s a lady in a pants suit standing three feet to their right who looks very surprised to see them.\nWade cheers, letting go of Peter’s wrist. “We made it! And all in one piece, too! You are in one piece, right?”\n“Uh.” Peter looks down at himself. “Yeah, seems that way.”\nThe surprised lady looks around like she’s wondering if she’s the only one who saw two masked men materialize out of thin air. Wade pushes her aside on his way to the front desk, where he leans casually and dings the service bell three times, despite the attendant standing right in front of him. The attendant’s smile bravely persists. She doesn’t even look curious about their attire.\n“Reservation for Wilson,” Wade says. The attendant passes him two key cards, one of which Wade then passes to Peter.\n“This is a really nice hotel…” Peter notes as they make their way toward the elevator. There’d been a marble fountain in the lobby. Everyone, patrons and staff alike, is in suits.\n“Deadpool travels in style,” Wade says. Then, “Thanks for coming with, by the way. I figured you’d turn me down since I didn’t give you a lot of notice. You seem like the type who’d have plans already, big hero that you are.”\n“Well, I did. I’m missing school, for one thing.” The elevator moves quietly, smoothly. One wall is glass, allowing Peter to look down on the lobby as they rise.\n“You go to school?”\nPeter’s brain catches up with his mouth and he realizes he hadn’t meant to admit to that. “Uh… yes?”\n“You sure? You don’t sound sure.”\nPeter scratches at the back of his neck. “I, uh. Just don’t normally tell people stuff like that. That’s all.”\nWade snorts. “What, like I could find you just because I know you’re a student? Only you and about a million other twenty-year-olds. Geez, Spidey, you’re a little paranoid.”\n“You think?”\n“Yeah. I mean, what’s the worst that could happen if someone found out who you are, anyway?”\n“… They could go after my family and friends?”\n“Oh.” Wade considers this. “Guess I didn’t think of that. Don’t really… have any family or friends to speak of… Well, there’s Nate, but he can take care of himself.”\n“Nate? Is he the one you were on a date with?”\nWade stares at him. “What?”\n“The other night, you said-“\n“Oh. Oh, no. It wasn’t really a date, Spidey. It was a meeting. About this job.” \n“Ah,” Peter says, feeling foolish even though he’d had no way of knowing that. The elevator arrives at their floor and they file out into the hall. Wade leads the way to their room, Peter trailing along at his side.\nWade snickers, pokes Peter in the shoulder. “You were jealous.”\nPeter pokes him right back. “Was not,” he argues.\n“Were too! I could hear it in your voice. You were totally jealous that I was on a date with someone else.”\nPeter thinks back. Had he sounded jealous? He hadn’t meant to. Was he jealous? He’s… kind of relieved that Wade wasn’t on a date but that doesn’t count, right? It doesn’t mean anything.\nThankfully he’s saved having to reply by their arrival at their room. It’s a perfectly nondescript door. Peter is expecting a basic room- two beds and a bathroom, maybe a desk or a chair in the corner if the hotel is really trying to dress things up. What he gets instead is a suite. There’s a bedroom, a living room, a mini-kitchen, and a bathroom with a jacuzzi tub. Everything is ornate and lavishly decorated. The TV takes up almost an entire wall and by itself probably costs more than Peter’s monthly rent. The place is nicer than his and Wade’s apartments combined.\nPeter pauses in the doorway to take it all in. Wade shoulders past him, unfazed. “Dibs on the bed by the window!”\n“… Wade,” Peter says. Then, “Why?”\nWade pokes his head back out of the bedroom. “Why the window bed? Because look at this fucking view! That shit’s top dollar.”\nPeter shakes his head. “No, I meant… We’re just staying for a night, right?”\n“Oh, yeah. I just told them to give me whatever was available. Seriously, come look at the view.” He takes Peter’s hand and pulls him toward the bedroom windows, which are covered with heavy velvet curtains. Wade pulls one aside so Peter can see the outdoors.\nThey’re in the mountains. High up, from the looks of it. Outside is a winter wonderland, a beautiful blue sky, and a row of snow-capped mountain peaks. Trees dot the landscape, appearing here and there where the snow allows. It’s beautiful, like something Peter might’ve seen on a postcard once.\n“Wow,” he breathes. “I’ve never been in the mountains before. Or too many places out of the city, really.”\n“You gotta live a little,” Wade tells him, clapping him on the back. “And now I’ve gotta go to work. There’s recon to do and the sooner I do it, the sooner it’ll be done.”\n“What, already? We just got here.”\n“I know you’ll be bored to tears without me but, hey, they’ve probably got pay-per-view porn and I’ve got an unlimited budget. Go nuts, baby boy.” Wade is already unpacking things from his duffel. Weapons, mostly. As Peter watches, he sheds his hoodie and baggy jeans, stripping down to just his suit. He clicks a gun into its holster and straps his sheathes to his back.\n“I am not jerking off in this hotel room. Too weird. When will you be back?”\nWade shoots him a thumbs up. “Before you know it!”\n“Got your phone on you?”\nWade holds it up in confirmation and pointedly slips it into one of his pouches. “Yes, dear.”\n“Okay, good… Be careful,” Peter can’t help but add, aware that he sounds doting but unable to help it.\n“Always am,” Wade chirps. He takes Peter by the arm and plants what would be a kiss on his cheek if not for their masks. He makes an over-exaggerated mwah noise and then practically twirls away. “Don’t wait up!”\nOf course Peter does wait up. After Wade leaves, Peter’s first order of business is to call MJ and cancel their plans to see a movie the following night, just in case he doesn’t make it back in time. His excuse is less a mercenary whisked me off to the mountains and more I’ve got all this coursework due and I’m poor. MJ, being the wonderful friend that she is, offers to pay for his ticket but he’s never let her before and he’s not about to start now. Before hanging up, she also accuses him of having what she calls a ‘secret lover’ and, when he refutes the claim, suggests that he should get one.\nBy the time Wade does finally get back it’s past midnight and Peter has had time to bathe and watch three and a half movies. He comes in and brings the smell of pine with him. Peter is happy to note that there’s not a scratch on Wade anywhere.\n“Well?” Peter says.\n“We’re good to go tomorrow,” Wade says, collapsing backward onto his bed. Then he says ow, complains that his swords are jabbing him in the back, and removes them. “What are we watching?”\nPeter tells him, and Wade proceeds to provide color commentary on the movie Gone Girl for the next hour. It’s very much not a comedy but Peter finds himself laughing harder than he has in a long time. Wade has a talent for that, it would seem.\nIt takes Peter a while to fall asleep. He hates sleeping in his mask but he doesn’t breathe a word of complaint. It’s something he assumes Wade does a lot, if not all the time. Wade doesn’t seem to have any trouble getting to sleep, at any rate. Peter looks over and can’t make much out in the dark but the way Wade’s gone lax, and his chest rises steady and even, suggests that he’s out like a light.\nPeter is finally, finally dozing off when something jolts him back to the world of the alert. It’s Wade, shifting in his bed, mumbling something incoherent under his breath. Peter listens, trying to make it out, trying to figure out if Wade is awake or not. It doesn’t seem like it, and his restlessness quickly turns to thrashing and his voice begins to sound pained.\nPeter shoves his own blankets off and climbs over to Wade’s bed. He perches on the side, not sure what to do. Wade is clearly in distress. In the midst of a nightmare, Peter assumes. \n“Wade,” Peter tries, and then again louder. Wade doesn’t respond so Peter reaches out, intending to take him by the arm, but his touch is intercepted. Wade uses one of his hands to grab Peter’s, his grip crushing. The other wraps around Peter’s throat, too fast for Peter to move. Peter’s spider-sense is urging him to get away, to put distance between himself and the danger, but he forces himself to be still.\n“Wade,” Peter says, calmly, placing his hand over Wade’s on his throat. Not prying, just touching. He takes it as a good sign that he can still talk, though Wade’s grip is bruising. “It’s me. It’s just me.” He can’t see Wade’s face, can’t tell if he’s still talking to a sleeping man or if Wade has become aware. Gradually, Wade’s grip on his hand loosens, and then his grip on Peter’s throat. \n“Oh, my god,” he says, sitting up, letting go all at once. “I’m- I was having a dream, I think. I’m so sorry, Spidey. Did I hurt you? Please tell me I didn’t hurt you.”\n“I’m not a delicate flower,” Peter assures him. “Are you okay?”\nWade is shaking. It’s only barely perceptible but Peter can feel it. “Yeah. Just. Bad dreams. Bad memories. I’m sorry.” He brings his legs up to his chest, wraps his arms around them. It's strange to see someone Peter always thinks of as strong and unshakeable be reduced to comforting himself, making himself as small as possible.\n“Does that… happen a lot?” Peter wonders, keeping his voice low. He doesn’t know why, maybe to comfort him or maybe to distract him, but Peter reaches out and takes Wade’s hand in his. Their hands are bare, their gloves abandoned sometime earlier. It’s dark, too dark for Peter to see anything, but he can feel the uneven texture of Wade’s skin, can feel calluses that are just starting to form and it occurs to Peter that this is the hand Wade recently had to regrow. Does it hurt, he wonders? Reforming all those calluses? Wielding blades and guns and getting blisters until they do?\n“Not that much,” Wade says. He curls and uncurls his fingers as Peter traces patterns over his palm. “Just sometimes. Fucking figures it would happen tonight.”\n“What were you dreaming about?”\nWade hesitates. Gradually his trembling subsides. Peter thinks he might not ever answer, might deem the information too personal, but then he says, “Vanessa. My ex. They killed her.”\n“I’m sorry,” Peter says, even though he knows it means nothing. The words don’t help, but what else is there to say? “I… lost someone like that, too. She died because of me.”\n“We’ll start a club,” Wade says, squeezing Peter’s hand. “The Dead Girlfriend’s club.”\n“How about just the Tragic Ex’s Club? Cause there was this guy, my best friend. He sort of went completely nuts. He’s locked up now.”\n“Huh,” Wade says, tilting his head. “There’s… a lot to process in that sentence. First of all- guy? I was under the impression you were straight, Spidey.”\nPeter smiles. It had been his intention to take Wade’s mind off his nightmare. “Well, we were never… official. We just fooled around, off and on. Before… Before my girlfriend. But, no, not straight.”\n“Don’t mind me,” Wade mumbles. “Just filing this information away.”\nPeter chuckles. “You gonna be alright?” he asks, letting go of Wade’s hand.\nWade actually seems to think about it for a second. “Yeah. Probably.” He catches Peter’s wrist as Peter begins to stand. “I’m… sorry,” he says. “Again. And thank you, Spidey. Really. I promise I will try to avoid choking you in the future unless you ask nicely.”\nThat startles a laugh out of Peter. “Go to sleep,” he says, aware that he’s blushing. “Big day tomorrow.”\n“Yes, mum,” Wade chuckles, letting go of him.\nPeter’s bed is cold when he settles back into it.\n-\nPeter is having an unpleasant but admittedly silly dream about showing up to class in his underwear when something wakes him. At first, he isn’t sure what’s done it but then he hears a noise from the other room. A thump, and then footsteps. He rises, groggy and sleep-rumpled, and trudges toward the noise to see what his temporary roommate might be up to.\n“Wade?” he calls, rounding the corner.\n“Oh, shit, don’t- don’t-“ Wade rambles, voice trembling. That, more than anything, is what brings Peter up short. Wade hadn’t even sounded like that after his nightmare. Peter doesn’t register what he’s looking at for another several seconds and when he does it takes his breath away.\nWade must’ve just showered, because the bathroom door stands open, releasing steam into the room, and Wade has a towel draped over his head. He’s turned away from Peter but he’s bare from the waist up, revealing the broad expanse of his back and shoulders, covered in scars. Some angry, some faded, some raised, and some not. Some look like the result of burns while others look inflicted by sharp objects, long and curved. They look awful and painful and Peter has the sudden and unexpected urge to hurt whoever inflicted them.\n“Go back to bed,” Wade snaps. “You’re supposed to be asleep.” He’s so stiff, holding himself like he’s anticipating a blow.\nPeter stumbles toward him. He reaches out and this time- this time he touches. He rests his fingers on Wade’s shoulder, bare skin against bare skin, and traces a pattern of scars, marvels at how soft Wade’s skin is, despite the bumps and ridges. Wade flinches, at first, but he doesn’t pull away.\n“I- I can’t find it,” Wade says, crumpling. “My mask. I can’t find it, Spidey, I’m- I took it off, to take a shower, and now I can’t fucking find it-“\nPeter draws back, shocked. In his sleepy daze, he hadn’t even realized Wade was maskless. As curious as Peter is, as much as he wants to know Wade’s face, he’d never dream of taking that choice away from him. He averts his gaze, though Wade is making sure on his own that Peter isn’t able to see anything. “You didn’t bring a spare?”\n“Didn’t think I’d need one,” Wade says, brusque.\n“I’ll- I’ll help you look,” Peter offers. “It’s gotta be here somewhere, right? It’s- oh.” Peter spots red, peeking out from beneath the sofa. Wade’s mask must have fallen there somehow. “Here it is.” Peter bends to retrieve it and hands it over with his eyes steadily fixed on the floor. Wade snatches it back. He slams the bathroom door shut behind him.\nPeter blinks at the closed door. He’d like to ignore it but he knows he feels… stung. He knows he has no right to expect Wade to open up to him, or go maskless around him, but he still feels somehow hurt that he won’t. Especially since Wade had more or less admitted to him recently that it’s personal. Not around you, he’d said, as though Peter were somehow undeserving or untrustworthy. Even still, after all this time they’ve spent together. Even after last night, when it had seemed like they were making progress.\nHe expects Wade to have calmed down by the time he reappears. He expects him to try and pretend that nothing happened, or to brush the whole incident off with humor.\nHe doesn’t. Instead, Wade remains cold and quiet. Aloof. He shrugs off Peter’s attempts at conversation as he arms himself to the hilt, preparing for their mission.\n“Non-lethal, right?” Peter asks, watching him. It is, after all, supposed to be an easy mission. No casualties. That’s what Wade had said.\nWade doesn’t answer.\n“Well,” Peter mumbles, mostly to himself, sounding weary. “This should be fun.”\n“It’s cold,” Peter complains, sinking lower in his coat.\n“No shit,” Wade murmurs, but he doesn’t seem very cold. He’s laid out in the snow in just his suit, with no coat or any winter gear in sight. He’s been lying like that, almost perfectly still, for the better part of an hour, peering through the scope on a sniper rifle. In front of them, in a small valley between two cliffs, sits the mansion they’re trying to infiltrate. Peter doesn’t know what Wade is watching for. He’d asked and gotten no reply.\nIn fact, most of his questions and attempts at conversation have been brushed off and turned aside. Ever since this morning, when Peter caught Wade in a partial state of undress, he’s been taciturn. Peter was tempted to point out that usually that sort of thing leads to sexy times, not to endless rounds of the quiet game, but he’s pretty sure that with the mood Wade is in the remark would earn him a glare, not a laugh.\nThe fact of the matter is, Peter isn’t quite sure how to treat this new, aloof version of Wade. He’s been replaying the last several hours in his head, wondering what he did wrong, but he can’t pinpoint anything. He's thought about trying to reassure Wade that this morning didn’t change anything but he isn’t sure how to start that conversation. Every time he tries to run through what to say in his head, he gets stuck. Besides, he’s not even sure what, exactly, Wade is upset about. It’s all made for a tense and too-quiet morning.\n“Almost time,” Wade says. Peter jumps at the sound of his voice. “Grab onto me. As soon as the distraction blows, we’re teleporting in.”\n“Blows?” Peter wonders, but he sheds his coat and dutifully grabs on to Wade’s belt when he stands. Wade straps the sniper rifle to his back.\nAs has become the new norm, Wade ignores him. Peter’s question is answered soon enough, anyway. Within the next minute, an explosion goes off near one end of the house, blowing out a wall and sending smoke and debris into the air.\nWade doesn’t give him any warning before he teleports them. They land in an empty and cavernous concrete room, one wall dominated by a large metal door. Peter struggles to orient himself, feeling dizzy and sick for several seconds. It passes, but slowly. Peter is just proud he manages not to lose his breakfast.\n“How are we getting that open?” Peter asks, gesturing at the frankly imposing vault door.\nWade is digging around in his satchel. “Key,” he says, but what he pulls out looks less like a key and more like a severed hand. He approaches the door and does something with the hand that causes several locks to click back one at a time. The door swings open a fraction of an inch.\n“How long has that been in there?” Peter sputters. “How- why- who- ugh.”\nWade shrugs, tosses the hand carelessly aside. It flops against a wall and falls to the floor. “We don’t have much time. Those guards won’t stay gone long.”\n“Right,” Peter mutters. He approaches the vault door, pushes it open just enough to be able to see inside. The room is massive and filled with little glass cases, each proudly displaying what Peter assumes is a priceless artifact. It’s a very odd assortment of things. There are gems and coins and books, which makes sense, but there are also eyeballs floating in blue liquid and a pile of nothing but dust and pieces of broken tech and clothing from bygone eras.\n“Eclectic fellow, isn’t he?”\nWade gestures. “Turn on your earpiece. I’m going to go keep a lookout.”\nPeter has to reach up under his mask to fiddle with the small radio Wade supplied him with. He knows it’s on when it briefly supplies feedback which settles into a low electronic hum. “Wait- what am I supposed to be grabbing, here? There’s like a million things in that room.”\n“It’s a crystal. Big, blue, floating. You can’t miss it. And remember- don’t touch the floor.”\n“Floating?” Peter asks, but Wade already has his back to him, walking away.\nPeter sighs. He turns back to the room, fires web at the ceiling to pull himself up. From there he has an even better view of all the miscellaneous items. It still takes him a while to find the crystal he’s looking for since it’s situated near the rear of the room, but, true to Wade’s word, he knows it when he sees it. It’s a small blue crystal, hovering about an inch off of a black velvet pillow. It, like everything else, is covered by a glass case.\nIt’s not all that difficult to remove the case. He just attaches web to it and lifts, being careful not to drop it, then webs it to a wall. Retrieving the crystal is no problem either. He wraps it in his web so he doesn’t have to touch it, wary of whatever enchantment is probably placed on it. It’s as he’s in the process of this that his radio crackles to life and Wade says, “Shit, they’re coming back.”\n“What? What do we do?” Peter looks around. There’s only one way in or out.\n“Hurry,” Wade snaps.\nPeter does just that, crawling quickly along the ceiling. He isn’t even halfway out when Wade utters another curse. “I had another distraction planned. Stupid fucking faulty bomb. Didn’t go off.” Here, he cuts out, then Peter hears more cursing.\n“What’s going on?” Peter asks, listening hard. “Wade? Are they here?” There’s no answer.\nThe sounds of fighting reach Peter as he draws close to the exit, not through his earpiece but through the vault door, which is still cracked open. He lets himself drop to the floor, braced for whatever might come at him on the other side.\nTurns out he needn’t have worried for himself. No one takes notice of him. Every man in the room is focused on Wade, who is dispatching them with cold, brutal efficiency. At first, Peter is glad to see his guns are still holstered, thinks that maybe Wade is only dealing non-lethal blows, but- no. Wade isn’t pulling any punches. He isn’t sparing anyone. Peter watches as he beheads a man, then opens another from groin to throat. The cement floor is quickly becoming awash with red. Wade is just a blur of motion.\n“Wade!” Peter calls, snapping out of his shocked daze. “Stop- what are you doing-“\nWade pays him no mind. He’s already felled nearly every guard in the room. By the time Peter jolts himself into action, Wade is cutting the legs from beneath one of only two men left breathing. The last, a man with five o’clock shadow and wide, watery eyes, drops his gun and holds up his hands, surrendering.\nWade advances on the man, blade leaving a trail of dripping blood behind him. He raises his sword and there is no doubt in Peter’s mind that he’s about to slaughter an unarmed, surrendering man. The man seems to know it, too. He squeezes his eyes shut, braces himself against the wall behind him.\n“Stop!” Peter yells again. He webs Wade’s sword, yanking it from his hand. Wade turns and Peter imagines that if he could see Wade’s expression it would frighten him. “That man is unarmed,” Peter tells him, persevering. “Don’t make me subdue you.”\nSomething about Wade’s stance reminds Peter of a coiled snake, ready to strike. He’s powerful. Peter forgets that, sometimes. His physique isn’t for show. He’s lithe and fast and well-trained and strong. Peter has never had to think of Wade in terms of ‘how would I defeat him’ before. He finds himself doing that now, formulating strategies and calculating his odds and he hates himself for it and he hates Wade just as much for making him do it.\nAll at once, Wade’s demeanor changes. His fingers uncurl from claws and he straightens. He sheathes his remaining sword in one smooth motion and growls, “Let’s fucking go.”\nThe last thing Peter wants to do is touch Wade. He’s covered in blood- largely the blood of his foes, not his own- but he forces himself to do it. He approaches slowly and grabs onto Wade’s wrist so Wade can teleport them away from the heinous scene around them. Peter can’t even look at most of the bodies without wanting to throw up.\nTheir hotel room materializes around them. Peter doesn’t feel as sick this time. At least, not because of the teleportation.\nHe immediately puts distance between himself and Wade, staggering to the other side of the bedroom, but he doesn’t turn his back. He’s afraid to, which is new and terrible and Wade seems to realize it the same instant Peter does.\n“Don’t do that,” Wade snaps.\n“What?” Peter snaps right back. His heart is racing. He’s still in fight or flight mode.\n“Don’t act like I’m some- deranged lunatic who’s gonna cut you as soon as look at you.”\n“I don’t know what you are. I thought I did but that… That was-“\n“Business as per fucking usual is what that was. I saved the mission. I did what I had to do.”\n“You slaughtered them! And you were going to kill an unarmed man! Wade, I’ve seen you fight before without killing a soul. I know you can do it, you chose not to. You promised me no causalities. So what was that?”\nWade folds his arms over his chest. “Stress relief,” he says.\nPeter makes a noise, part disbelief and part disgust.\n“I did it because I wanted to. Because that’s who I am.” Wade starts to close the distance between them until he’s looming over Peter. Peter has to tilt his chin up. “I’m a killer, Spider-Man. Does that put you off? Does that disgust you? This is who you’ve been palling around with. A professional killer. And guess what? I enjoy my job. I love it. I can’t wait to send poor fucking saps to the afterlife. Straight into Death’s arms. How does that make you feel, hero? You think I’m a psychopath? You wanna lock me up? I’d like to see you try.”\nPeter shakes his head. “What’s wrong with you? What’s- this isn’t you, I know it’s not.”\nWade scoffs. “What do you really know about me, Spidey? Next to fucking nothing. Don’t pretend you’re an authority on all things Deadpool.”\nPeter swallows. He forces himself to take a deep, calming breath. He places his palms flat against Wade’s chest, can feel Wade’s heart rabbiting much the same as Peter’s has been. The touch must surprise Wade because he goes still. He's even holding his breath. “What are you trying to do?” Peter asks, lowering his voice. “Trying to scare me off? Trying to see how far you can push me? Why?”\nFor a moment Wade says nothing. He places his gloved hands over Peter’s, holding him there. He’s still covered in blood and smells like copper. “I’m just helping you toward a realization,” he says, and for once in this conversation sounds familiar to Peter.\n“What realization is that?”\n“That I’m no good. That you’re better off as far away from me as you can get. I thought- For a while, I thought it might be good. That you might rub off on me. But I’m no hero, Spidey. I never will be. I’ll never be…”\n“What?” Peter prompts. \n“Good enough,” Wade finishes. He tips his chin down, tries to put distance between them again but Peter doesn’t let him. He clings. “I’ve done things…” Wade continues. “I can’t outrun the past. I can’t get rid of these fucking scars. And I know that no matter how good I am, no matter what I do… You’ll never want me.”\nPeter’s breath catches in his throat. There haven’t been many times in his life when he’s found himself utterly speechless but this is one of them. He feels like if he speaks he'll choke on the words.\n“Why would you?” Wade begins to babble into the silence. “I’m a mess, inside and out. What they did to me in Weapon X, it fucked me up, Spidey. There’s no coming back from it. I’ll always be a big, screwed-up piece of work, hurting the people I care about, fucking up the world around me. It was stupid of me to try and get close to you. No good could ever from it.”\n“I- I can’t just- What you did today was…” Peter trails off. He doesn’t know what he wants to say. He doesn’t know what he needs to say. What Wade did today was wrong, there’s no question about it. Peter didn’t much like the side of Wade that he saw in action in that mansion. Still, even with mounting evidence to the contrary, there’s a very large part of Peter that refuses to believe Wade is a monster. He knows Wade isn’t a monster, and Peter has grown too fond of him to let him walk away.\nSince words are failing him, Peter does the only thing he can think to do. He hugs Wade, arms wrapped tight around his waist. He decides he doesn’t care about the blood, he just wants to convey to Wade, somehow, that he isn't a lost cause. Not to Peter.\nWade really is shocked, now. At first, he seems scared to touch Peter. Then, slowly, hesitantly, he returns the embrace, arms enveloping Peter in warmth and the smell of gunpowder.\n“You can’t get rid of me that easy,” Peter says. “So for the sake of several poorly trained guards, please stop trying.”\nWade laughs like it’s startled out of him. “You really should leave,” he says, but he doesn’t let go.\nThere’s apologizing that needs to happen and forgiveness that needs to be worked towards but Peter decides they can figure all that out later. Everyone deserves a second chance. Everyone can change. Even people like Wade, self-proclaimed perpetual fuck up. Peter believes that wholeheartedly, and he’s willing to work to make it happen.\nPeter shifts the curtains aside to take one last look at the scenery. The sun is setting behind the mountains, casting them in shadow. He’s not entirely sad to be returning to the city, to what’s familiar, but he will miss the view. He sort of regrets not getting to make a snowman. He’s sure, with Wade as his company, the activity would’ve been quite the experience.\nBehind him, Wade is packing the last of his things back into his duffel. He’s not saying much. Peter can tell that everything that’s happened over the course of the last two days has somehow shifted their relationship. It is now irreversibly changed, though Peter has no idea if it’s for the better or not. Peter can’t even say how it’s changed, exactly. He just feels it, like a fraying line between them.\nPeter pulls the crystal from his pocket, still wrapped in web. He turns it back and forth in his hands. “So, what does it do?” he asks, breaking the borderline uneasy silence between them.\n“Hell if I know,” Wade admits, hoisting his bag onto his shoulder. “I don’t ask too many questions. That’s a quick way to stop getting job offers.”\n“It’s a floating blue crystal that someone just paid you fifty-thousand dollars to retrieve and you’re not even a little curious what it does? Or how it works?” Peter is at least interested in the science behind it if nothing else. It seems a waste to send it back without studying it first, though he knows that’s not an option.\n“Aw, Spidey,” Wade says, reaching over to pat him on the head. “So sweet, so naïve. In my experience, it’s better not to know.”\nPeter passes the crystal over when Wade holds out his hand. It disappears into one of Wade’s pockets. “It could come back to bite you,” Peter points out, because that’s how these things work in his experience.\n“Look,” Wade says. “I know what’s really bothering you. If this thing turns out to be evil and it kills a bunch of people or wrecks some shit or whatever, you don’t have to worry about being responsible. Alright? I took the job, I roped you in. It’s on me. I’ll even let you say ‘I told you so’. But if every random object I was paid to fetch wound up being evil and coming back to ruin my life, I’d have given up the business a long time ago.”\nPeter holds up his hands, conceding the point, but he feels compelled to add, “If it does wind up being evil, I’m definitely gonna say ‘I told you so’… But I’ll also be there to help you clean up the mess.”\nWade pauses. “Unless,” he says. “It’s past your bedtime.”\nPeter rolls his eyes. “Shut up. Are you ready to go yet?”\nWade nods. He fiddles with the teleportation belt. “Anywhere in particular you wanna get dropped off?”\nPeter considers. Obviously, he can’t say his apartment, but he could at least have Wade get him close. He rattles off a place just a few blocks down. Wade fiddles with the belt some more, then directs Peter to take his arm.\nPeter is more familiar with teleporting now than he ever thought he would be. He’s only a little dizzy when he comes out the other side and it takes him less time to orient himself. The coffee shop is, thankfully, mostly empty at this time of day. The barista looks surprised for half a second to see them appear, then shrugs and goes back to wiping down counters. Peter imagines she probably sees weirder on a weekly basis, knowing this city.\n“Oh, hey, I’ve been here before,” Wade notes, looking around with interest.\nPeter freezes. Internally, he berates himself. It’s not that he’d forgotten his maskless meeting with Deadpool here, it’s just that he’d, well. Momentarily forgotten. \n“I sat… right over there,” Wade says, pointing at the corner table. “And then I met this super cute nerd. We totally hit it off, Spidey. I’m pretty sure I caught him checking out my ass, which, by the way, is pretty great. I’ve seen him since, too. I think he likes me.”\nPeter’s panic is derailed. “Wait,” he says, coming to a realization. “Are you trying to make me jealous right now?”\n“That depends. Is it working?” Wade sounds half-joking, half-hopeful.\nPeter decides his life is officially ridiculous. Wade is trying to make him jealous by bragging about flirting with him. This is a situation that never occurred to him when he decided to keep his identity secret. “No,” he says. “I am definitely not jealous that you and some nerd flirted with each other.” Wait- flirted with each other? But Peter hadn’t been flirting. Had he?\n“Weirdly specific,” Wade points out. “What if I held his hand? Took him on a date? Kissed him? Would that make you jealous?”\nPeter’s cheeks are burning. He mentally adds this to the list of times he’s glad he keeps his face covered. “Still no,” he insists, which is true, but he can’t stop imagining it. Wade kissing him. Him, not Spider-Man. Wade’s hands, large and warm, cupping his face and leaning in, or maybe holding him by the waist, or maybe twining their fingers together. Wade’s face must be scarred, too. What would that feel like? To be kissed by him?\n“What if I took my mask off for him?” Wade asks, voice and chin dipping low, unconsciously bringing their faces closer. “Bet you’d be jealous then.”\n“You wouldn’t.” Peter is practically whispering.\n“I might.” Wade shrugs. “If he asked nicely. I mean, he’s really cute, Spidey. I’ll probably do just about anything if he bats his eyelashes at me and says please.”\nPeter’s mouth has gone dry. “So that’s your weakness,” he says, trying to regain some footing. “Cute boys.”\nWade chuckles. He nudges Peter with his elbow. “Thought you would’ve figured that out by now.”\n“Well, I haven’t gotten you to take your mask off, have I?”\n“You haven’t tried batting your eyelashes at me, either,” Wade points out. He doesn’t give Peter time to retort before he switches the subject, abruptly announcing at his usual volume, “I’ll let you know when I get our money, then I can give you your half and we can be done with the whole thing.” Just like that, everything is normal again.\nPeter starts shaking his head before Wade is even done talking. “I can’t take the money.”\n“What? Why? I thought that was the whole reason you took the gig.”\n“I agreed to help because I owed you a favor. The money was just a bonus.”\n“So… why can’t you take it? Favor’s repaid, I’m happy to share the loot.”\nPeter shifts awkwardly on his feet. He doesn’t want to start another argument or put more distance between them. “It’s… nothing. I just… don’t really need it. So you can keep it.” It nearly pains him to say it. That money could do wonders for the mountain of debt he’s burying himself under in college.\n“You’ve got a lousy poker face,” Wade tells him. Peter refrains from pointing out how that makes no sense, what with the mask. Besides, he’s right. Peter has never been the best liar, secret identity aside. “What’s the real reason?”\n“It’s just… I felt okay about it when we were just helping someone, but…”\nPeter can practically see the metaphorical lightbulb go off over Wade’s head. “Oh,” he says, flat. Monotone. “It’s because I killed those people.”\nHesitantly, Peter nods.\n“So, what, it’s blood money now? Tainted? You know that wasn’t your fault, you had nothing to do with those guys dying-“\n“They didn’t die, Wade. You had it right the first time. They were killed, and- No, I don’t want to argue about this. I just wouldn’t feel right about it, okay? About taking the money. Can you just accept that?”\nThe barista is definitely eyeballing them now. Peter lowers his voice again, though it’s probably too late to pretend they weren’t talking about murdering people. She’ll undoubtedly be texting all her friends in a minute about how Spider-Man killed a dude. Great. “Like I said, I went because I owed you. Not for the money. So don’t worry about it, alright? I’ll be fine. We’re fine.”\nFor a second it seems like Wade might push the issue, but then he gives in with a little huff. “Did anyone ever tell you you’re a stubborn little shit when you want to be?”\n“I’ll take that as a compliment.”\n“You should. I like it.” Wade steps back. He offers up a salute, half-hearted and largely sarcastic. “I’ll see you around, Spidey.”\nPeter salutes him back and in the next instant, he’s gone, leaving Peter with the sinking feeling he won’t be seeing Wade for a while.\n-\nHe’s right. Wade disappears. Whether he’s still in the city or not, Peter isn’t sure. He keeps an eye out for him on patrols, can’t seem to help it, but he never does spot him.\nHe thinks about texting him. A text is harmless, right? Wade could ignore it if he’s trying to get some space or take a break from… whatever they are. If he’s trying to take a break from Peter. Peter never can bring himself to do it, though, too afraid that Wade really would ignore the message and too afraid to find out how much that would sting.\nThings stay quiet around the city so Peter has little to no Spider-Man business to distract him. Instead, he throws himself into his studies. He spends time with MJ and has lunch with Aunt May and makes Jameson happy with some new pictures. With every day that passes, he wonders more and more where Wade might be, what he might be doing, and whether or not he might be in trouble.\nIt turns out he needn’t have worried. He finally spots Wade during one of his patrols, almost three weeks after their last meeting. At first, he thinks his eyes are playing tricks but- no. That’s Wade walking down the sidewalk, hands stuffed in his pockets, iconic mask peeking out from beneath a hood he has pulled low.\nPeter follows him. He swings from rooftop to rooftop, careful to keep out of sight. Wade never looks up. If he realizes he has someone tailing him, he doesn’t give it away.\nPeter doesn’t have to follow for long. Two blocks down, Wade enters an otherwise empty diner. From Peter’s vantage point across the road, he sees Wade take a seat, sees a waitress with a bored expression come and hand him a menu, sees Wade scan it, and then put it back down. He pulls out a knife and begins picking at his nails. The waitress, when she comes back to take his order, eyes him uneasily.\nPeter thinks about leaving. He could just walk away and let Wade continue his recluse act. The thought quickly passes, though. Even if Wade wants to be left alone, it isn’t in Peter to grant that wish. Instead, he drops down to the ground and pulls the diner door open. The waitress lays eyes on him and breaks into a grin.\n“Are you really Spider-Man?” she asks, excited, and Peter thinks that even if he weren’t he’d say yes just to avoid disappointing her.\nShe seems a little confused when he takes the seat across from Wade, who has yet to look up from his own hands. They’re bare, no gloves, and once again Peter finds himself fascinated by the mercenary’s scars. They’re beautiful in their own strange and terrible way. They tell a story and they’re a part of who Wade is. Perhaps that’s why Peter rather likes them.\n“Hi,” Peter says, when it becomes clear that Wade won’t be the first to speak.\n“Hi,” Wade parrots, pocketing the knife. He folds his hands on the table and stares expectantly.\nIt’s hard to tell what kind of mood Wade might be in today. “Do you, um… Mind if I join you?” Peter stumbles over the sentence, feeling awkward and unsure. Two things he’s never really experienced around Wade before, at least not to this degree.\nWade shrugs.\nPeter huffs. “Alright, what’s wrong? Why are you giving me the silent treatment?” He’d hoped that after so much time they would be past this but that was probably a silly hope. Things don’t just mend themselves if you leave them alone. They’d parted on okay terms, though, hadn’t they? Hadn’t they already been on the road to fixing this the last time they’d seen each other? It had seemed that way, what with Wade’s continued flirting.\n“Me? Silent treatment? Buddy, I wouldn’t even know how.”\nThe waitress seems hesitant to approach but she does, notepad in hand, to take Spider-Man’s order. Peter just asks for a coffee. He’s not hungry but it would be rude not to order anything.\n“Then why’d you fall off the map?” Peter asks as soon as she’s out of earshot, picking their conversation back up.\n“I’ve been around. Took a couple of jobs but otherwise, I’ve been right here in the city. Didn’t realize you wanted to keep tabs on me. Is that a condition, too? I can’t stay here unless I tell you every little thing I do?”\n“That’s… not what I meant. I just- normally I see you and-“ Peter stops. This isn’t at all how he meant for this conversation to go. He tries again, decides to be blatant in the hopes that Wade will appreciate his honesty. “I missed you, that’s all.” It shocks him, realizing as he says it just how much he means it. He has missed Wade, in all his manic, mouthy glory. He makes Peter laugh and he’s silly and capable and, at times, insightful and Peter is almost always having fun when he’s around.\nWade fidgets with the hem of his sleeve, which is so long it falls over his knuckles. “But not too much, right? You’ve got my number- why didn’t you call? Why didn’t you go looking? Why do I have to do all the work?”\n“… What?”\n“It’s a two-way street. Or it should be. I don’t wanna always be the one hounding you, you know? And I kept thinking- oh, he’ll call. He’ll shoot me a message or stop by the apartment. But you never did. So then I started thinking I would call, or find you, but no. I wanted to see how long you’d go before you noticed. I wanted to see if you’d vanish once you didn’t owe me anymore.”\nPeter opens his mouth, closes it again. He hadn’t thought about it in those terms at all. He’d assumed that if Wade wasn’t contacting him then he didn’t want to be contacted.\n“Just tell me,” Wade says, leaning forward, elbows propped on the table. “Did I completely fuck things up in Colorado? I mean, I know I fucked things up- what else is new- but, like, on a scale of one to ten-“\n“I wasn’t avoiding you because of Colorado. I wasn’t avoiding you at all. I thought- I thought you wanted space or something. Or that you were done with me or…”\n“Done with you?” There’s a pause, and then Wade laughs. “Oh, my god. Spider-Man is insecure? Holy shit, that’s adorable.”\nPeter didn’t know he was waiting to hear Wade’s laugh but as soon as he does some of the tension drains from him, like something in him just needed to hear that sound to be put at ease.\n“As if I could ever be done with you. Fucking hell, Spidey. Have you seen yourself? Do you know who you are?” He drums his fingers on the tabletop. “So we were both just being insecure assholes? That’s my gig. You heroes are supposed to have all the swagger, all the confidence. I didn’t even think you might be over there moping, thinking I dumped you, because why the hell would you? Look at me. Or, you know. Don’t. Point being, you’re stupid and I forgive you.”\nPeter blinks. “…Thanks?” he ventures. “Uh. So we’re good now?”\n“We’re getting there.” Wade pauses again. His fingers keep tapping. “You really missed me?”\nPeter ducks his chin. No point in being shy about it now. “Yes.”\nWade giggles. Actually giggles. Peter wouldn’t say he’s used to Wade’s mood swings but he’s not totally unfamiliar, either, and in this case, he’s glad for it. It helps that he feels partly responsible for cheering him up. It’s a good feeling.\nWade reaches out, pokes Peter on the nose, and says, “Boop.”\nPeter catches his hand before he can retract it. He holds it there, lines their fingers up. Peter’s are long and thin, like an artist’s, and dwarfed by Wade’s, who has the hands of a fighter. His scars only further that impression.\n“Do they hurt?” Peter asks.\n“All the time,” Wade replies.\nPeter lets go when their waitress approaches their table with Peter’s coffee and Wade’s meal. Peter thanks her, Wade ignores her. As soon as she walks away, Wade hooks his feet around Peter’s ankles under the table. Peter lets him.\nPeter pushes his mask up to sip at his coffee. Out of the corner of his eye, Peter notes the waitress staring. Maybe trying to figure out if he knows him.\nWade fiddles with his silverware.\n“I can go,” Peter offers gently.\n“No,” Wade says with no hesitation. “Stay. I’ll eat later.”\nPeter wants to tell him he’s being ridiculous, wants to tell him that he won’t be scared off no matter what Wade looks like under that mask, but it all sounds so serious, so presumptuous, in his head. He leaves it all unsaid. Instead, he just says, “Okay,” and he stays.\n“We’re gonna have to talk about it eventually, aren’t we? The whole… difference of opinion thing.”\n“Eventually,” Peter agrees. “But not tonight.”\n-\nPeter texts Wade the next day while he’s at work. He doesn’t intend to make the same mistake twice.\nWade texts back in record time. Peter figures he just needed a little encouragement because after that it’s as though the flood gates have opened. Wade texts him throughout the day and into the night. Random things, random pictures, all in the interest of making Peter laugh. If people catch Peter smiling dopily at his phone- well. He lets them.\nAunt May is staring at him.\nPeter flips his phone shut. “What?”\nHer smile is small and knowing. “Who’s that you’re texting, dear?” she asks faux-innocently.\n“No one,” is Peter’s reflexive answer, which he realizes after the fact is more suspicious than just saying ‘a friend’ or even just saying ‘Wade’.\nAunt May takes a very pointed bite of her mashed potatoes. She hums, looking far too conniving for her own good. “No one? So you won’t mind if I set you up with Nora’s daughter? She’s a sweet little thing, already agreed to the date. All I had to do was show her your picture.” She takes another bite, letting Peter stew in silence for a moment. “Or, if not her, there’s this new girl who just moved in a few houses down, I hear she’s single- Or, oh, this nice boy at the supermarket! His name was Evan, I think. He was very handsome-“\n“No,” Peter groans, finally interrupting. “Absolutely not. No one is setting me up with anyone. Ever. I don’t need to be set up, Aunt May. I’m perfectly happy with- with-“\nAunt May’s eyebrows are somewhere around her hairline. “With who?” she presses.\nPeter had been going to say with the single life. Instead, he says, “With… Wade…” It comes out sounding weak and unsure, the lie already tasting bitter on his tongue. He wishes he could take it back as soon as it leaves his lips. Dishonesty has never been something he’s very comfortable with.\nIf Aunt May notices anything amiss then she doesn’t point it out. Instead, she claps, which Peter feels is rather uncalled for. “Oh, I knew it! You haven’t stopped smiling at that phone since you walked in. Tell me all about him, Peter!”\nPeter bites his lip. It’s too late now, he decides, and tries to recall everything about Wade that might earn his Aunt's approval. “He’s… very outgoing. And funny. Kind of… out there, sometimes, but it keeps things interesting. He can be… surprisingly sweet, though. And he’s insecure, a little bit, about his looks, but-“\n“But looks aren’t everything,” Aunt May finishes for him, grinning from ear to ear. “He sounds lovely. Do you have a picture? When can I meet him?”\nPeter groans again. “It’s still new, Aunt May! I can’t just spring you on him. And no, no pictures. We haven’t reached the ‘selfie together’ stage yet. Give it time, okay?”\nShe reaches out to pat his hand, still looking inordinately pleased. “Have you told MJ? You have to tell MJ.”\nPeter sighs. Wade, he thinks, must never, ever find out about this.\n-\n\n\nwhere r u? it’s chimichanga time\n\n\n\nWhat is it with you and Mexican food?\n\n\nI’m on my way home. Were we supposed to meet up today? No one told me.\n\nPeter pockets the phone. He shoves his camera and portfolio into his bag, then shoulders the burden. He’s the only one left in the office so there isn’t anyone to wish him goodnight. He’d stayed late today to finish up some editing and procrastinate an essay and now it’s dark out and he’s so hungry his stomach is actually growling, which is how he knows it’s reached critical levels. Just the thought of chimichangas is kind of making his mouth water and he doesn’t even like Mexican food that much.\nHis phone buzzes again as he’s stepping out onto the sidewalk.\n\n\nu were just supposed to KNOW. like a fuckin mind reader\n\n\n\nI’m Spider-Man, not Professor X. Where should I be and when?\n\n\n\nmy place. headed there now. race ya!\n\n\n\nNot fair! I don’t have my web shooters.\n\nPeter is only barely paying attention to his surroundings as he texts. It’s only thanks to his spider-sense that he avoids a head-on collision with another pedestrian and they still somehow manage to knock shoulders.\n“Oh, sorry,” Peter apologizes on reflex. “Are you-“ He stops. “Oh,” he says. “Hi.”\nWade is decked out in all his gear today, weapons included, but it doesn’t look like he’s been in a fight. There’s no blood or telltale rips in his suit. He looks up from his phone. His Spider-Man phone, to which Peter is currently holding the twin. “Peter Parker? Damn. I’m starting to think it really is fate. What are the odds, right?”\nPeter laughs, nervous and strained. He tries to surreptitiously slide the phone back into his pocket. He can tell he fails on the surreptitious part by the way Wade tilts his head, very obviously tracking the movement. Wade’s thumb is hovering over his keypad. No doubt he was replying to Peter’s last message. “Right!” Peter chirps, probably just this side of too cheery. Internally, he curses his luck. Of all the times to run into Wade out of costume…\nThere’s a pause. “I can’t believe you’re wearing a fucking sweater vest,” Wade says, which is enough of a tangent that Peter starts to relax. “It’s kind of amazing.”\nPeter laughs again, tugs self-consciously at the hem of said sweater vest. “Um, thanks. I like your… thigh holster.”\nWade snickers. “I bet you do,” he says. “Hang on, just gotta finish this text to Spider-Man. Who I’m super tight with, by the way. Just saying. Feel free to be impressed.”\nPeter rolls his eyes. A moment later, Wade hits send, and Peter’s phone chimes, obnoxiously loud in the otherwise relatively quiet night. Peter doesn’t move, just internally berates himself for not putting it on silent like a freaking moron. \nWade looks at him, then at his pocket. “Huh,” he says. “You gonna check that?”\n“Nope!” Peter says, suddenly feeling very hot under the collar. There’s no way he could explain away the phone. Especially not with the obnoxious (and yet somehow endearing) Deadpool sticker on the back. It would be too much of a coincidence. “It’s- probably nothing. Don’t worry about it. So, where were you headed-“\n“Hang on,” Wade interrupts. He presses a few more buttons on his phone. Peter’s pocket chimes once again. “I really think you should look at that,” Wade urges, sounding amused. “Sounds like it might be important. Could be your girlfriend.”\n“Don’t have one of those.”\n“Boyfriend?”\nPeter shakes his head.\n“Hm,” Wade says. “Interesting.”\nPeter opens his mouth, not at all sure what’s going to come out. In the end, nothing does. They’re interrupted by a man in a black beanie with a beard in desperate need of a trim. At first, it seems like he’ll pass them by but then he stops, just out of Wade’s arms reach. “You,” he says. His voice is gruff. It's the kind of voice one only acquires after years of smoking cigarettes. “You Wade Wilson?”\nThe change in Wade is subtle but Peter picks up on it. His posture shifts as he goes on high alert. He keeps the phone clutched in one hand, moves the other to the holster at his side. He stops just short of drawing his gun. With one more small shift, he’s placed himself mostly in front of Peter. Preparing to protect him. “Yeah. You a fan?”\n“Something like that,” says the man, smirking.\nPeter sees Wade look around, figures he’s probably checking to make sure no one else is nearby to get caught in any crossfire. The sidewalk is otherwise empty, excepting the three of them, which is normal for this time of night. Peter knows, he’s walked this route enough times. Normally he appreciates that the Bugle is out of the way but right now the relative seclusion and darkened street lend an ominous air.\n“Well,” Wade says, tone still light. “I’m in the middle of something, so if you could kindly fuck off-“\nThe man draws and fires in the span of an eye blink. Wade’s head snaps back, neck at an unnatural angle. Red spatters the sidewalk behind him. He falls, crumbles to the ground in a heap of boneless, lifeless limbs.\nPeter stumbles backward to avoid going down with him. He stares, uncomprehending. Wade isn’t getting up. He isn’t moving. The back of his head is a mess of blood- darker in color than his suit- and brain matter. Logically Peter knows that people don’t just survive getting shot in the head, not like that, but he still finds himself holding his breath. Hoping. He knows Wade has a healing factor. Can it bring him back from something like this? It can regrow limbs but can it knit his brain back together?\nHe barely registers the man fleeing until he’s already half a block gone. Peter runs after him anyway, loathe to leave Wade’s side but unwilling to let the man escape. He doesn’t have his web-shooters but he’s far from helpless and he’s already closed most of the distance between them when a sleek black car screeches to a halt beside the curb. The windows are tinted so dark they show nothing but the reflection of city lights. The door swings open and the man clambers in, just seconds before Peter can grab him. Instead, Peter’s fingers close on empty air, and the car screeches away again.\nPeter can still see Wade when he turns around. From this distance, he’s just a smear of red on the pavement. Still unmoving. Still silent.\nHe doesn’t know what to do. He doesn’t know what to do, so he goes back. His mind is a mess of random observations and half-formed plans and panicked questions. Things like, what do I do with the body? And, there’s blood on my shoe. And even, I never saw his face.\nHe kneels next to the body. Because that’s what it is, isn’t it? A body. It’s a weird realization to have. Peter feels numb.\nWith shaking hands, he pulls out his phone. The phone.\nThe last two messages Wade sent him were:\n\n\nthat’s what makes it fair\n\n\n\n\n;)\n\n\nPeter laughs because it’s either that or cry. He puts the phone back in his pocket, thinks idly that there’s no use for it now. He touches the back of Wade’s hand where it rests on the concrete.\nWade’s finger twitches.\nPeter jumps, scurries backward. Wade’s finger twitches again, and then his hand moves, and then he’s lifting it to his forehead and groaning. “Fucking hell,” he mutters, slowly rearranging his limbs and sitting up. “That always fucking hurts and it never fucking kills me so why do they keep trying?”\nThere’s still blood dripping from his head down the back of his suit. Peter watches it with wide eyes.\nWade finally seems to realize he’s got company. “Oh,” he says. “Sorry about that. Were you- uh. You look a little pale. You alright, Petey? Get a little sick at the sight of blood?”\n“Me?” Peter says, finding his voice. “Me? Am I alright? Wade- I just watched a man kill you.”\n“Yeah, and?”\nPeter sputters incoherently, waving his hands.\n“You said you’d heard of me, right? Figured you’d know all about the ol’ healing factor. Kinda what makes me super, after all.” Wade wipes at his wound with the back of one hand, smearing blood in an attempt to clear it away. “Ugh, gross,” he says to himself. “Another suit for the dumpster.” He takes the dirty glove off and flings it away.\n“I didn’t know you could come back from the dead!”\n“Oh, sure.” Wade stands, brushes himself off. Some poor sap, Peter thinks, is going to walk by this bloodstain and be very confused later. “I can’t be killed. And trust me, people have tried.”\nPeter stands, too, just so Wade isn’t looking down at him. “I thought- I was in full-on freak out mode, okay? Don’t just act like this is nothing. I thought you were dead. I ran after the guy! I was gonna punch him in the face for you!” He shoves Wade- lightly, but maybe Wade is still dizzy because he sways with it and grabs onto Peter for balance, fingers curled around Peter’s arms. He doesn't let go.\n“Aw, you were gonna punch a guy for me? That’s sweet. But dangerous. You should leave that to the professionals, kiddo. I’d hate to deprive the world of your pretty face.”\n“Professionals like you? Professionals who get shot in the head by some jerk in a beanie? Who was that guy, anyway?”\n“Probably a member of the drug cartel I pissed off last time I was out of town. He did look like a jerk, didn’t he? Should’ve seen it coming a mile away.”\n“That is not the point.”\n“I don’t know what you want to me say, dear. I’m sorry you had to witness that? I’m sorry I got blood on your shoe? I’m sorry we keep running into each other?”\n“No- don’t be sorry for that.” Being around Wade out of costume is weirdly freeing. Peter thinks it should probably be the other way around. “I’m not sorry about that.”\n“…Good,” Wade says after a beat. He clears his throat, steps away. Then perks up again. “Oh, shit. I was supposed to meet Spider-Man. How much time did I lose?”\nPeter checks his watch, feeling a little miffed by Wade’s sudden awkwardness. “Fifteen minutes.”\nHe groans. “Great. Gotta go, Petey! Be careful on the way home!” He blows a kiss as he starts jogging away.\nPeter thinks it’s lucky he isn’t just some normal pedestrian. Otherwise, he’d probably need therapy.\n-\n“So what happened?”\nPeter is calm now. Calmer than he was twenty minutes ago, anyway. He can’t seem to stop replaying the incident in his head- alive now or not, he witnessed Wade dying and he was devastated and he knows eventually those are feelings he’s going to have to deal with- but otherwise, he’s fine. He’d swung by one of his secret stashes to grab his suit and managed to arrive at Wade’s place just moments after the mercenary himself.\nWade looks over from where he's prodding gingerly at his skull in a mirror. He still hasn’t changed his clothes. “Oh, nothing. Just a shooting. But don’t worry- I’ll handle it. I’m thinking the guy responsible will make a nice kebab, skewered just so.” He draws his katanas as if to demonstrate, but then just tosses them aside. They land gently in the armchair.\n“You’ll kill him?”\n“Sure. An eye for an eye and all that.”\nPeter shakes his head. He wants to argue. The words are on the tip of his tongue. Instead, he closes the distance between them and folds Wade into an embrace. Peter isn’t very physically affectionate by nature but- this is what he needs. Right now, he craves the affection like he so rarely does. Maybe because he thought he lost Wade, or maybe it’s just been too long.\nWade always, always seems surprised when Peter touches him in a non-hostile way. This is no exception but he recovers quicker than ever before, pulling Peter to him with strong arms. “I’m okay,” he says, voice soft, as though Peter's concern is silly.\n“I know,” Peter says. Then, “You smell bad.”\n“Well if someone wasn’t being clingy then I could go shower.”\nNeither of them moves.\n“I think,” Peter says finally, hooking his chin over Wade’s shoulder. “That I was promised chimichangas.”\n“That you were. But now I’m thinking we have Chinese delivered, park our asses on the couch, and watch movies until we pass out. All in favor say aye.”\nPeter didn’t really come prepared for an impromptu sleepover and he has a test tomorrow and he’s not at all fond of sleeping in his suit but- “Aye. Sounds great.”\nWade falls asleep before Peter does, head resting on Peter’s lap. Peter struggles to stay awake during his test but still regrets nothing.\nPeter should be studying. Instead, he’s perched on a rooftop, waiting for Wade to arrive and marveling at how predictable he’s become. Not that he’s all that sad about it. Spending time with Wade will always trump sitting alone in a library, nose stuffed in a book for the sake of a grade. Besides, it’s a beautiful day. Even Aunt May wouldn’t fault him for taking a little time off. Probably.\n“You’ll never guess where I’ve been,” Wade says, announcing his presence. He’s only a silhouette against the setting sun until he draws near.\nPeter tilts his head. “… Albania?”\n“What? No.” Wade plops down beside him with none of his usual grace. He thrusts a white paper bag in Peter’s general direction. “Here’s your fucking chocolate chip ice cream, you nerd.”\nPeter takes the bag, peers inside. Wade wasn’t bluffing. There is indeed a small bowl of chocolate chip ice cream sitting inside, along with a bright pink spoon. Peter fishes them out, excited. “You can’t call me a nerd while you’re doing something nice for me. It’s just confusing.”\n“It’s a term of endearment.” Wade waves a dismissive hand. Agitation is radiating off of him like heat. He’s talking faster than normal. “Anyway. I’ve been at the Avenger’s HQ all day. And do you know why?”\n“Why?” Peter asks around a mouthful of ice cream.\n“Because of you.”\nPeter licks his spoon clean and calmly waits for elaboration.\n“Yes, you,” Wade says, as though he’d asked. “When I first got the call I thought- hey, guess they need some fucking dirty work done. Cause that’s what they do, you know. They call me in when some shit needs doing that they won’t deign to do themselves. Which is fine. It’s whatever. But today they just wanted to talk. About you.” Wade is gesturing a lot, talking with his hands. He seems too riled up to sit still.\n“I didn’t know you worked with the Avengers sometimes,” Peter muses. “Actually I kinda thought they had you blacklisted or something.”\n“Eh,” Wade says. “More like for. I work for them sometimes. But that’s beside the point. The point is- they wanted to know my intentions. I’m pretty sure they think I’m going to murder you. Or… infect you with my crazy? Somehow? I don’t really know, they weren’t super clear on that front. You’re not one of them, right? You said you weren’t one of them.”\n“I’m not,” Peter assures him. “We’ve helped each other out before, I guess, but I’ve never been officially added to the roster. What did they say, exactly?”\nWade hunches his shoulders, curling in on himself. “They made some… insinuations. Called me a bad influence and basically told me to stay the fuck away from you because I’m- Well, whatever. I told them to go fuck themselves. I hear that shit from myself every day, I don’t need to hear it from them, too.”\nPeter takes another bite of ice cream, this one contemplative. “I’ll talk to them,” he decides.\nWade shakes his head. “Don’t do that. They’re just looking out for you. It’s not like they’re wrong-“\n“They are wrong,” Peter snaps, though his ire isn’t directed at Wade and he hopes Wade knows it. “They’ve got no right to talk to you like that. You’re my friend and if I want to spend time with you, I will, the Avengers be damned.”\nWade stares. Peter pauses with his spoon in mid-air. “What?”\n“That’s hot,” Wade declares. “You going all protective boyfriend on me. I like it.”\nBoyfriend. Peter blushes. “I… I wasn’t-“\n“But,” Wade interrupts. “There’s a better way to get our point across.” He rubs his hands together and performs his best villain laugh, which is quite good since the two of them hear them so often. It’s almost scarily accurate, even. “Let’s roll their front yard.”\nPeter mentally translates that into English. “You want to… Cover Avengers Tower in toilet paper…?”\n“Yes,” Wade practically hisses. “It’s perfect.”\nPeter shrugs. “Okay, I’m in.”\nWade cheers, throws his fist into the air. “Yay! Now, we’re going to need a lot of toilet paper…”\n-\nIt’s MJ who brings it to Peter’s attention.\nThe two of them are grabbing a post-lunch coffee when she finally broaches the topic of Wade, Peter’s mysterious new boyfriend, which Peter knows she’s been dying to ask about all along. He’s rather impressed with her restraint, actually, and tells her so, but once the floodgates have opened she drowns him in questions. She’s not kidding when she says she wants to know everything. She asks about Wade’s favorite color and what he does for a living and how they met- all questions Peter either knows or can bullshit an answer for. Then she starts digging deeper. She wants to know where Wade grew up, are his parents still around, what are his hobbies, who are his friends, how old is he, etc. It's as she’s asking that Peter realizes he has no idea.\nHe almost immediately determines to remedy that. This is why, when Wade invites him over for movies- something that is quickly becoming a happy routine- he leaps at the opportunity to learn a little bit more about the mercenary.\n“So,” Peter says, attempting casual and falling just short. They are now halfway into an old black and white detective movie. They’re camped out on the couch, sitting close enough that their thighs are pressed together even though it’s probably big enough for four people to sit comfortably side by side. “I was thinking and I realized, I know you, but I don’t know a lot about you.”\n“Okay,” Wade says slowly, instantly wary. He turns the TV down. Peter has his full attention. “What do you wanna know?”\n“I guess I just… wondered about your past, mostly. Pre-Weapon X.”\nWade starts to tap his fingers on his own knee. “What about it?”\nIt wasn’t Peter’s intention to make him nervous but he presses on, choosing his words carefully, keeping his tone light and inquisitive. “Just, where are you from? What did you do before? That kind of thing.”\nWade’s tapping speeds up. “Why are you asking? I mean, are you asking because you want me to tell you I was a saint before Weapon X? That I was some average joe vanilla good guy? Because Weapon X fucked me up, Spidey, but I was already pretty fucked up to begin with, so I hate to disappoint you, but-“\n“No, no.” Peter places his hand atop Wade’s, stilling it. “I’m just curious, Wade. No ulterior motive. I promise.”\nAfter a moment, Wade nods. “Alright. Well… Never got along with my parents, to say the least. Got out of there as soon as I could. Career-wise, I’ve always been a killer. It’s what I’m good at. I was Special Forces for a while but I didn’t like some of the orders they were handing down so I went into business for myself. Became a mercenary. Started picking my own jobs.”\nPeter nods, silently encouraging him to go on.\n“Then… I met a girl. Fell in love with said girl. Got cancer. Left the girl. Volunteered for Weapon X. Continued muddling my way through life and now here I am, the scarred shell of a man you see before you.” Wade laughs, bitter and more than a little self-deprecating. It tugs at Peter’s heartstrings. “I was a real looker back then, Spidey, like holy shit. It was a face even you could’ve loved-“\nPeter rests his fingers on Wade’s jawline, just lightly. Wade stops talking. The two of them are sitting even closer now, somehow. Peter notices and doesn’t care to change it. “Do you know why I want to see your face so bad, Wade?”\nWade swallows. He shakes his head.\n“Because I want to know you. Really and truly. And I feel like I can’t- not until I can look in your eyes.”\nFor a beat, Wade says nothing. He touches Peter’s throat, right where Peter knows the line of his mask ends. “That works both ways. I’ll show you mine if you show me yours.”\nPeter’s heart is beating harder and faster than he’d like to admit. He’s never revealed his identity, never taken his mask off- not for anyone. But, “I don’t think you need me to take the mask off. I think you know exactly who I am.” His voice is shaking. He can’t help it. If he’s wrong- well. He hopes he isn’t wrong. He really hopes he can trust Wade with this. If not, the consequences are too daunting to think about. “You’re smarter than a lot of people give you credit for, Wade. You can’t honestly tell me you haven’t guessed by now.”\n“Do it anyway,” Wade urges, voice low. “For me. Please.”\nPeter takes a deep breath. He pushes his mask up to his nose, pauses. There’s no going back after this. There’s no putting the secret back in the box. Peter doesn’t think Wade will give him cause to wish he could. In fact, he's counting on it.\nHe can’t look at Wade once the mask is removed. He holds it in his hands, stares at it in lieu of making eye contact, even though he knows he wouldn’t be able to see Wade’s expression anyway. The mask stares back at him, so utterly familiar.\nFor a long time, Wade says nothing. Then, “Peter,” he breathes, warm and relieved. His gloveless fingers graze Peter’s cheekbones, his nose, the edge of his bottom lip. Peter looks up, finally, and though Wade’s face is still covered he’d like to think he’s smiling. “I knew it was you. I wanted it to be you.”\n“You did?”\nWade nods. “Fate, Peter, what did I tell you? You’re… amazing. You’re perfect and I didn’t wanna have to choose and can we just ignore all the stupid things I said before I knew it was you, please? Cause I’m pretty sure I said some really stupid things-“\n“It was… nice,” Peter argues. He’s blushing and Wade is looking at him. Wade is looking at him with the knowledge that Peter is also Spider-Man and it’s a strange, heady sort of feeling. It’s freeing, in a way, but also terrifying because now there’s nothing for Peter to hide behind. He feels laid bare. “When did you figure it out?”\n“I started suspecting in the supermarket. Something about you was ringing some bells. But I thought I was crazy for thinking it. I mean, what are the odds, right? But I knew I was onto something the other night, with the phones, which by the way was so stupid of you, it’s amazing you’ve managed to keep it a secret this long.”\n“Hey! In my defense, I wasn’t exactly expecting you to show up when you did.” Peter ducks his chin, pouting. “Don’t think you’re getting out of your end of the bargain by distracting me with insults.”\n“Loving insults,” Wade corrects. He sighs. “Are you sure about this?”\n“Beyond sure.”\nWade reaches up, then stops.\nPeter gently places his hands on Wade’s mask. “Let me?” he asks.\nWade lowers his own hands, nods once.\nWhen Peter slips the mask off, Wade’s eyes are closed. He keeps them that way as Peter takes in the details of his face. His scars, which match those covering the rest of his body. His lips, one of which he holds between his teeth. The curve of his cheekbones, the line of his jaw, the slope of his nose. All familiar and yet brand new. Peter could look at him for hours, for years, and not be bored.\n“Wade,” he says softly. “Look at me.”\nWade acquiesces. The first thing that strikes Peter is how expressive his eyes are. They somehow manage to convey so many things at once. Fear and hope and resignation and hurt. They’re beautiful and oh-so-very Wade and Peter was right- his imagination could never have done Wade justice. The two of them are looking each other in the eye for the first time and Peter has so much fondness for this man he can barely contain it all. He feels likes he’s going to explode if he doesn’t do something.\n“Wade,” Peter says again. “I’m going to kiss you now. Okay?”\nWhatever Wade was expecting, it evidently wasn’t that. His eyes go wide, he begins to form a surprised question, but Peter doesn’t give him time to voice it or himself time to doubt. He closes the distance between them, presses their lips together as gently as he knows how. Wade melts into it in an instant, hands coming up to frame Peter’s face, to hold him there. He smells of gunpowder and something else, something distinctly Wade that Peter has grown to love.\n“I tried,” Peter says when they separate. Neither of them goes very far. “To pretend that this was something else. But the other night- I had a terrible day and I was exhausted and angry and all I wanted to do was be with you. Near you. That’s all I wanted and I knew then that I was fooling myself-“\n“Am I dreaming?” Wade wonders. “Is it April Fools?”\nPeter laughs, just this side of breathless. “No, this is real. I mean it. Every word. Did you really think your scars would scare me off? They’re just… you, Wade. They’re part of you and I like them.” He traces one with his thumb, follows it over Wade’s brow bone. “They tell a story. Your story.”\nWade kisses him like he can’t help it. It’s chaste and light and neither of them pushes for more. There’s still so much mystery between them, so many questions that need to be asked and talks that need to be had. “Whatever you do,” Wade says seriously. “Don’t pinch me.”\nPeter laughs and kisses him again.\n-\nPeter’s life is never simple. He accepted that it never would be when he decided to become Spider-Man, which is why he’s only mildly surprised to find Black Widow waiting for him not far from Wade’s apartment. She’s leaning casually against a lamppost, red hair catching the light.\nPeter stops well out of arms reach. “What are you doing here?” he asks, wary and irritated all at once. He still hasn’t forgiven the Avengers for talking down to someone he cares about and he highly doubts she’s here to apologize. He and Wade never did get around to rolling their yard, more’s the pity.\n“Delivery,” she says, extending a thin white packet. He doesn’t like the look on her face. Her expression is a perfectly blank mask. “We just thought it might be prudent to show you who you’re really making friends with.”\n“Keep it. Whatever you've got in there, whatever you think you’ve got on Wade, I don’t need to see it. I know exactly who I’m making friends with, thanks.” He goes to move past her but she stops him with a hand on his shoulder.\n“Just take it,” she urges. “You don’t even have to open it. Just take it off my hands and I can say my job is done.”\nAfter a pause, Peter does as she asks. She’s right. He doesn’t have to open it.\n“For what it’s worth,” she adds, and something seeps through the mask. Pity? “I think you’re going to want to see what’s in there.”\nPeter shrugs her hand off his shoulder. For some reason, he feels like he’s lost some kind of game he didn’t know he was playing with her.\nWhen he gets home, he throws the packet onto his desk, intending to ignore it. He showers and eats and goes to bed.\nBut, just as Black Widow undoubtedly intended, he can’t stop wondering.\nIt’s not that Peter is opposed to Wade showing up at his place of employment, it’s just that he’s not expecting it. This is why, when the murmuring starts up, he doesn’t initially pay attention. Then the distressed, curious, and amused mumbling of his coworkers grows louder, draws nearer to him- and then Wade throws his arm around Peter’s shoulders and he nearly jumps out of his skin.\n“Morning, sunshine,” Wade singsongs. “Or should I say afternoon? The day kinda got away from me, what with all the napping I did.”\n“What are you doing here?” Peter blurts. Wade is wearing his mask, because of course he is. Peter had kind of hoped that after the initial reveal he might forgo it but now that seems like a silly hope. Wade wasn’t wearing the mask just for Peter’s supposed benefit and he won’t stop now just because Peter didn’t run for the hills the first time he got a look at him.\n“Bringing you donuts,” Wade tells him, brandishing a small white box. “These are absolutely the best donuts in the entire city and I can say that for a fact because I’ve been to every single donut shop since I’ve been in town. It took a while but I knew I couldn’t really think of New York as home until I’d figured out the best place to get donuts, you know?”\n“Um,” says Peter. He takes the box. “Thank you.” He looks around, unsubtly scanning the room and its other occupants. No one will quite meet his eye, but when he looks away he can feel them staring. “Maybe we should… talk outside?” he suggests, even as he leans further into Wade’s side.\n“Why?” Wade asks. His grip on Peter tightens, almost to the point of being uncomfortable. “Don’t tell me you’re embarrassed to be seen with me, Petey.”\nPeter places the donuts on his desk- he’ll definitely be back for those- and wiggles his way out of Wade’s hold. “Nope,” he says. “We are definitely talking outside. Elevator, go.”\nWhen Wade doesn’t immediately follow instructions, Peter takes his sleeve and starts pulling him in the right direction. At first, Wade digs his heels in, refusing to be moved, but Peter's strength is something to be reckoned with and after a moment he lets up and reluctantly trudges along. He links their arms when Peter drops his sleeve. Now that he’s been given tacit permission to touch Peter, he doesn’t seem to want to stop. Peter isn't complaining.\nDespite saying they should talk outside, Peter starts up as soon as they’re in the empty elevator. “Why’d you really come here today? Huh? Cause I know you’re not just here to deliver donuts.”\n“I just wanted to see you,” Wade says, pout audible. He winds his arms around Peter, pulling the two of them together. As close as they are, Peter has to tilt his chin up to look Wade in the eye. He’d have to go up on his tip-toes just slightly to kiss him and-\nThat’s beside the point. Peter shakes his head at himself. “I’m- glad. But I still don’t think that’s the only reason.”\n“I just wanted to see if things were different now.”\nWade is being very distracting. Peter isn’t sure it’s intentional. His thumbs are rubbing small circles into Peter’s skin and he’s talking very low and standing so close. “Of course, things are different now,” Peter says, struggling to hold onto his train of thought. He really wishes Wade wasn’t wearing the mask. “How could they not be?”\n“No, I mean- bad different. Like you changed your mind different. Like you came to your senses different. You get me?”\n“Clearly,” Peter tells him, linking his hands together behind Wade’s head. “I haven’t.”\n“You’re crazy,” Wade says, but he sounds pretty happy about it. “Or I’m still dreaming. Am I still dreaming?”\nPeter kisses his cheek. “Nope, not dreaming,” he promises, just as the elevator slides to a stop. He doesn’t want to disentangle himself from Wade but he does, instead twining their fingers together as they walk through the lobby toward the front doors. There’s not really anywhere to gain total privacy but at least outside they’re surrounded by strangers and the hustle and bustle of the city. People are far less likely to look twice at them.\nWade slouches against a wall, standing in the shade. He tilts his head. “You still don’t believe me?” he guesses.\n“I do...”\n“But?”\n“But I still think you had another reason for coming here today. I mean, why here? Why now? I was supposed to see you tonight anyway.”\nWade folds his arms over his chest. “Well, what’s your theory?”\n“I think you’re testing me. I think you thought I actually would be ashamed to be seen with you.”\nWade scoffs but doesn’t deny it. He gestures around. “Doesn’t exactly seem like you’re proud to me, Peter.”\n“I’m not ashamed,” Peter argues. “I- I wouldn’t mind it if you wanted to go back upstairs right now and kiss me in front of everyone. I don’t care what they know or don’t know or gossip about.”\nWade points. “Yes, good idea. Let’s do that.”\n“But,” Peter stresses. “You’ve been seen with Spider-Man. And not just seen with him- your picture has been in the paper. Remember that? Remember ‘getting chummy’?”\n“Boy, do I,” Wade says, suggestive eyebrow waggle implied.\nPeter rolls his eyes. “I’m serious, Wade. People think you and Spider-Man are... I don’t know. Friends, at the very least. Involved, maybe. You start being seen with both of us and-“\n“You worry too much,” Wade whines. He pushes off the wall, closes the distance between them. He fluffs up Peter’s hair with his fingers, frames his face with his hands. “Way too much. People think you know Spider-Man, right? So that’s how we met. Whatever. I can be friends with Spider-Man and… friends with you, too. Unless you really are ashamed and this is all some kind of elaborate excuse to make me feel better about it-“\n“I think,” Peter says, lips twitching up into a smile. “That we’re both a little paranoid.”\n“Aw.” Wade places a hand over his own heart. “Something else we have in common. We’re adorable.”\nPeter chuckles. “Adorably screwed up. We’re gonna make all the other couples jealous.”\nThere’s a beat where they both realize what Peter has just said. ‘Couples’, as if they are one. There’s another beat where they silently agree not to acknowledge it in any way.\n“You believe me, right?” Peter asks. “That I’m not ashamed of you?”\n“I want to. That’s enough for now.” Wade surreptitiously glances around, then pushes his mask up to his nose. Peter meets him halfway for the kiss, using his hold on the front of Wade’s hoodie to draw him down. People are passing by on the sidewalk just a few feet away. Peter doesn’t care. He’d probably let Wade kiss him on national television if it meant putting his fears to rest, his own concerns about his secret identity be damned.\nWade nuzzles at Peter’s throat, plants a kiss there as well, butterfly light. “I really like you,” he says like it’s a secret. “Really really. But I have this bad habit of fucking things up.”\n“I like you, too,” Peter says. He thinks of Black Widow’s packet, still lying unopened on his desk at home.\n“You’re too good to be true,” Wade sighs. He sounds like he means it.\n-\nLater, Peter is juggling his things, attempting to fumble a key into a lock, and talking to MJ with the phone pressed between his shoulder and his ear. It’s a miracle he manages not to drop anything. “I do like him,” he tells her. “It’s just- I don’t know if I can be with him. You know?”\nPeter isn’t sure why he thought calling MJ would be a good idea. Since she doesn’t know about his double life he winds up having to be so vague and use so many euphemisms to talk around things that it’s hard to paint a clear picture for her. Still, he’d felt like he needed to talk to someone, and Aunt May was out of the question. MJ may be biased and protective of Peter but she’s not Aunt May level biased and protective.\n“So…you can’t be with him,” MJ says, voice tinny over the phone line. “Because he… did bad things…? What kind of bad things? Is he a serial cheater or something?”\nPeter tosses his keys onto the coffee table. He pointedly avoids looking at his desk. He still catches sight of that damn packet out of the corner of his eye. “No, no. Nothing like that, it’s just-“\n“Is he a porn star?”\n“What? No-“\n“A prostitute? You know, Peter, sex work isn't bad, it's just a job-”\n“Ugh, no, stop trying to guess,” Peter groans. “He’s not a sex worker of any kind.”\n“Drug user, then,” MJ continues guessing. “He was into the hard stuff and you’re worried about him relapsing.”\nPeter considers. “... Not exactly.” Less drugs, he thinks, more murder. Besides, Wade can’t exactly relapse since he never stopped in the first place. MJ would definitely freak out of he told her that, though. “Look, the point is- I don’t know what to do. I don’t know how much I can trust him, and I don’t know if I can ask him to change.”\n“Oh, Peter,” she sighs. “I don’t know what to tell you. He’s not going to hurt you, right? I’ll kick him in the shin if I need to.”\nThat mental image startles a laugh out of him. “I don’t think he’d hurt me on purpose,” he assures her. “But I’ll let you know if I need him whipped into shape.”\nMJ hesitates. “I’m really glad you found someone,” she says slowly, voice gone serious. “But please be careful. Promise me, Pete.”\nPeter smiles. Sometimes he’s really glad he has MJ on his side. “I promise.”\n-\nPeter lets Wade take him to dinner and a movie.\nThey don’t call it a date. In fact, it seems like both of them are very carefully avoiding the word. Regardless, that’s what it is. Peter knows it, at least. It was his idea. After Wade’s display at the Bugle, being seen with him in public seemed like the thing to do to help put his fears to rest. It’s worth it for the way Wade seems to revel in it. He’s giddy all night, overflowing with happy energy. It’s contagious. Peter has more fun with Wade in one night, watching one bad movie and eating one cheap meal, than he’s had in years.\nAfter all is said and done, Peter isn’t quite ready to go home and end their night. He’s hesitant to invite Wade over, still thinking of Black Widow’s ominous delivery and his own already-founded misgivings about getting any closer to Wade than he already has. It’s not wise to hand Wade his address. He knows it isn’t.\nHe does it anyway.\n“Walk me home?” he says. Peter doesn’t drink- it messes with his balance too much- but he feels drunk anyway. Buzzed, at least. He can’t stop smiling. It’s all Wade’s fault- he seems to have made a game out of how many times he can get Peter to laugh.\nWade, of course, agrees. As Peter is trying to unlock the door, Wade wraps his arms around him from behind and hooks his chin over Peter’s shoulder. He’s been tactile all night, as though touch-starved. Not that Peter minds in the slightest. “Gonna invite me in?” he asks.\nPeter leans back into the hold. Wade is broad and solid and warm and a lot of other adjectives that Peter enjoys. He wants to invite him in. But. There’s always a but. \nWade doesn’t give him time to answer. He turns Peter around, crowds him up against the door. Peter isn’t sure when Wade removed his mask but it’s gone now, the red just peeking out of one of Wade’s pockets. He kisses the corner of Peter’s mouth, his jaw, his neck, leaving a trail of heat in his wake. Peter tilts his head, encouraging him even as he says, “I- I don’t know if that’s smart.”\n“Want me to beg?” Wade asks, sounding almost amused. One of his hands has found its way under Peter’s shirt, is stroking the skin just above the waistband of his jeans. The other is flat against Peter’s back, keeping them close.\nPeter doesn’t reply, too busy making a mental list of pros and cons and getting sidetracked by the thought of Wade on his knees.\nAs if he can read minds, Wade says, “Here, I’ll ask nicely. Can I pretty please blow you?”\nPeter laughs, breathless. His mouth is suddenly very dry. “So romantic, Wade. You really know how to treat a lady.”\n“So’s that a yes?” Wade’s fingers drop to Peter’s belt buckle. “Here or inside?”\nPeter laughs again. “Oh my god, no. Most of my neighbors are old ladies.”\nWade rests his head on Peter's shoulder. “They’ve probably seen worse.”\nPeter shakes his head. He nudges Wade’s chin with his fingers, drawing him into a proper kiss. He hopes it softens the blow when he asks, sweetly, “Rain check?” It nearly pains him to say it. He wants- he just wants. It feels wrong to get Wade’s hopes up when Peter is so unsure, though. Black Widow definitely accomplished what she set out to do- shake Peter’s faith in Wade and their burgeoning relationship.\nWade groans.\n“You sound like a dying animal,” Peter notes.\n“I am dying. You’re killing me.”\n“Don’t be dramatic.”\n“I’m not. I’m being one hundred percent literal. We’ve found my kryptonite- being rejected by Peter Parker.”\n“Not rejected… Just postponed.” He coaxes Wade into meeting his gaze. Actually seeing Wade’s eyes is still so novel. “I had fun tonight,” he tells him seriously. “Thank you.”\nWade steals one more kiss. He smiles into it. “Goodnight then, baby boy. I’ll see you soon?”\n“I hope so.”\nWade seems reluctant to let go but, finally, he does. He takes a deep breath and steps back. Then, with one last wink, he turns to trot down the stairs. Peter watches him go, internally cursing himself for letting him walk away.\n“Damn responsibility,” he murmurs, finally shoving the key into the lock and pushing the door open with what probably amounts to more force than necessary.\nThe packet is still staring at him from his desk, begging for attention. At first, Peter turns his back, intending to shower and go to bed and continue ignoring it, like always, but then he abruptly changes his mind. He snatches the packet up, marches to the garbage can, and holds it poised to drop.\nHe could just get rid of it. If he doesn’t know what’s in it, he doesn’t have to feel guilty about this thing with Wade. He can just go on living in blissful ignorance. He could call Wade right now and tell him to come back and finish what he started.\nBut… that’s not entirely true. He still has cause to feel guilty, packet or no packet. He knows what Wade is. A killer. And whether he looks at the Avengers info or not, eventually he’s going to have to face that reality. Eventually, he’s going to have to either confront Wade about it or cut ties. It’s silly to think he and Wade could ever be anything serious when they have such a fundamental disagreement between them.\nPeter doesn’t throw the packet away. He goes and sits at his desk and stares at it.\nHe’s not sure how much time passes. Eventually, he braces himself and opens it.\nIt appears to be copies of every piece of information the Avengers have on Wade. It’s the file Wade joked about them having. Sitting there, for Peter to peruse, is all of Wade’s personal information. His height and weight and birthday. It details the abuse he suffered as a child, his time as a member of Special Forces, his start as a mercenary, and his entry into Weapon X. It lists every person he’s ever been romantically involved with and some of their unfortunate ends.\nPeter feels sick reading it. Mostly with himself because whatever else this is, it’s also a gross invasion of privacy. He can’t seem to stop.\nHe only feels sicker when he reaches the details of what Wade suffered in Weapon X. Peter thinks it would’ve broken a lesser man- and then reminds himself that it did break Wade, which only becomes more and more evident as he scans Wade’s post-Weapon X history. His rapidly escalating kill count, his so-called “episodes”, his mood swings. There are multiple, tentative psychological diagnoses listed in the margins, including schizophrenia, psychopathy, and sociopathy, each given by a different doctor.\nThe pictures, though, are by far the worst part of the whole thing. Each comes with a detailed report of Wade’s “mission” and its resulting body count. There’s Wade shooting a man at point-blank range in the head, skewering a man on two of his blades, disarming a man by literally removing both of his arms. In his search for this man Francis, which Peter now knows as one of the men responsible for Wade’s condition, Wade spared no one, even men surrendering to him. If they were in any way a part of Weapon X, Wade cut them down without a thought.\nPeter has always known what Wade is and what he does. He even got a taste of it in Colorado. He’d just assumed- he’d hoped- that was an unusual occurrence. A one-time thing. Looking at the file, it would seem the only thing unusual thing about it was that Peter was able to stop Wade from killing that man.\nKnowing and seeing are two different things. Now Peter has irrefutable proof that Wade is just as bad as the evil men Spider-Man defeats. He has no value for human life.\nIt’s hard to reconcile the picture the packet paints with the version of Wade that Peter has come to care for. The Wade he knows makes him laugh, and stops pregnant women from being robbed, and is an insecure mess. The Wade he knows remembers his favorite ice cream flavor and does favors for little girls. The Wade he knows makes him feel... free and happy.\nThen again, can he trust that anything Wade has said and done was genuine? The two little girls he met- were they real? Was that a setup? A deliberate scene to garner Spider-Man’s trust? The mugging attempt? The aftermath of the ninja woman's attack, when Wade had helped him home and taken care of him? Could it be possible that it was all a lie?\nPeter wants, more than anything, not to believe what he’s seeing, and to cling to the version of Wade that he loves.\nBut...\nThere's always a but.\nHe takes out the phone Wade gave him. He runs his finger along the Deadpool sticker on the back. One of the edges is already starting to peel away. Peter smoothes it down.\nHe takes a deep breath, flips the phone open, and hits the call button.\n“What, missing me already?” is Wade’s greeting. “I haven’t even made it home yet.”\nPeter bites his lip. He thinks about hanging up.\n“Can you… come back? We need to talk.”\n“Uh-oh,” says Wade. “Be right there.”\nPeter hangs up. He leaves the contents of the packet right where they are and waits.\nPeter isn’t really sure what his face is doing but it must be something not good because concern starts pouring off Wade in waves as soon as he lays eyes on him.\n“Peter?” he asks, taking him by the shoulders. At some point on the journey home, he replaced his mask. Peter can’t decide if it’s going to make things easier or harder, not being able to see his face. “What’s wrong? Are you hurt?”\n“Uh… No.” Peter shrugs him off. He nudges the door open the rest of the way, silently directing Wade to enter. Wade does and starts looking around with interest at Peter’s bare-bones apartment. It lacks the personality of Wade’s. You can’t really glean much about Peter Parker from studying it, except that he’s not particularly messy, the clutter of books aside. Wade actually seems disappointed.\n“Nice place,” he says. “But not very you.”\nPeter sighs. “I didn’t invite you back so you could give me decorating tips.”\n“Why did you invite me, then-“ Wade starts to ask, at the same moment his eyes land on the desk, and the pages and pictures spread out atop it.\n“That,” Peter tells him, watching as he slowly approaches the file and starts sifting through its contents, using one finger to nudge aside papers and photos. “I was hoping… I mean, I want-“\n“Where did you get this?” The shift in his mood is palpable. Suddenly he’s angry, defensive- or, at least, teetering on the brink of being both.\nPeter matches his tone without trying. “The Avengers- Black Widow. I’ve had it for a while. I couldn’t decide if I should look at it or not.”\nWade stops at one page in particular. Peter can’t see what it says but he can guess. It’s probably the page about Wade’s time in Weapon X. The amount of details they were somehow able to garner is, frankly, disturbing. “But you did look at it.”\nPeter doesn’t bother confirming the obvious. “I want to know if it’s true.”\n“Which part?”\n“All of it.”\nWade taps his finger on the desk, hums. “Yep,” he says, popping the p. “All looks pretty true to me. The Avengers are pretty good about fact-checking. What I don’t get is why they gave this to you. To warn you off? It’s none of their fucking business. Hypocrites, the whole motherfucking lot of them.” He whirls on Peter, finally looking at him again. “And? Did it work? Are you disgusted with me now? Scared of me? Think I should be thrown in a cell?” He sounds like he thinks he already knows the answer, like he’s already prepared to defend himself.\n“No, Wade, stop-“\n“You already knew all this shit, Peter, so don’t you dare-“\n“I thought I knew. I thought I understood what I was getting into, but look at that, Wade. You’re- you’re a killer-“\nWade’s hands are balled into fists at his side. “Are we really doing this? I told you that. I told you exactly that so don’t throw that shit in my face, don’t act like you didn’t know. How many times did I warn you? God, Peter, over and over again, and you never acted like it really phased you, so I thought…” He trails off. He’s slouching, diminishing his own height.\nPart of Peter wants to cross the room and comfort Wade, wants to never have this argument, but the sensible part of him knows that isn’t really an option and never was. Still, he has to fold his arms over his chest to ease the impulse. “I want,” Peter begins, only to be interrupted.\n“I know what you want,” Wade sneers. “You want me to be a hero, right? A self-fucking-righteous goody two shoes- like you.” He starts pacing, like a caged animal, like he doesn’t know what to do with this sudden surge of adrenaline. “But guess what? My way is better. My way works. I put assholes in the ground so they can’t hurt anyone else ever again. And you? You fight the same fucking bad guys on repeat because your precious system doesn’t work.”\nPeter’s stomach is turning and his face feels hot. He’s trying to stay calm but it’s difficult in the face of Wade’s abrupt anger. “Is that what you really think?” he asks, voice just this side of eerily serene.\nWade doesn’t answer. Maybe he doesn’t even hear. “You can’t be this naïve, Peter. You can’t really think the world is this black and white. Shit, I know you’re young, but-“\n“I’m naïve just because I think killing people is wrong?” Peter speaks through gritted teeth. He doesn’t like Wade being angry with him, he likes being angry with Wade even less. And yet. “That’s pretty basic hero stuff, Wade. Killing is wrong. We put killers behind bars.”\n“Right, cause I’m sure you’ve never killed anyone before. Not even once. And the Avengers? It’s not like they leave a trail of bodies wherever they go, right? How about the X-Men? Have you asked about their kill count recently? Or is it just me you decided to go all Mother Theresa on?” He’s stopped pacing in favor of gesturing wildly. Peter is fairly certain that if he weren’t blocking the door, Wade would have already bolted.\n“It’s called self-defense,” Peter argues. “Notice I said self-defense. Not vengeance, not senseless slaughter. There’s a difference.”\n“Doesn’t look like much of one from where I’m standing.” He shakes his head- at himself or at Peter, Peter isn’t sure. “I can’t believe you lead me the fuck on. I can’t believe I let you. I should’ve known- too good to be true, right?”\nHe makes as if to leave, stepping toward the door. Peter doesn’t move.\nThey’re just inches apart, Peter tilting his head up, Wade standing at full height again, practically chest to chest. Peter wants to say something to fix this but the words won’t come. He doesn’t know if it can even be fixed. He’s not okay with what Wade does, he can’t tell him it’s fine, but he can’t bring himself to do the opposite, either. To tell him to lose his number or get out of his city. It’s too final.\n“Get out of my way,” Wade practically hisses when Peter neither says nor does anything.\nPeter moves. Wade slams the door shut behind himself.\nPeter goes to bed angry and confused and replaying everything Wade said over and over again in his head.\n-\nIt doesn’t really hit Peter until the next day, the fact that he shouldn’t be expecting any texts or that he can’t just call Wade on his lunch break or that they won’t be meeting up that night for tacos or that Peter probably shouldn’t count on Wade being around to help out with any crime-fighting. For all he knows, Wade’s already skipped town and won’t be back anytime soon.\nAt first, it’s just sort of this vague but persistent irritation, like an itch he can’t scratch. He’ll pick up his Deadpool phone (he thinks about peeling the sticker off, then doesn’t), open it, remember that he and Wade aren’t speaking, and close it again. Or he’ll think of something funny to tell Wade on the phone later, only to realize there won’t be any phone conversations in the foreseeable future.\nAfter the second day, it becomes less an irritation and more a tangible hole in his life. He hadn’t quite realized just how much of his social calendar had been taken over and claimed by Wade. Now, suddenly, he has all this free time. Free time he should be using to study or sleep or clean, but when he tries he just- loses interest. Loses motivation. He can’t stop thinking about Wade, about what he’d rather be doing and with whom.\nBy day four he’s thinking, okay, sure, I miss him now but it’ll pass.\nOnly it doesn’t pass. It just gets worse. He replays their conversation in his head for the millionth time, only this time he changes it. He imagines what he could’ve said to make Wade stay, to make him understand, to keep him from getting angry. He imagines himself saying, I don’t care anymore, I just want to be with you. It’s more true than Peter is comfortable admitting.\nOn day six he tries texting Wade. A plea for the two of them to talk.\nPredictably, there’s no response.\nPeter tries calling. It rings and rings and goes to voicemail. The first several tries, Peter doesn’t leave one, then he figures, why not, and keeps it short and sweet. He asks Wade to please, please call him, just so he knows he’s okay. He says that he really wants to talk, that he doesn’t want them to be on bad terms.\nWade never calls him back.\nIf there’s one thing Peter hates, it’s being ignored. He’d rather have Wade yelling at him again than stonewalling him like this.\nStill, it’s largely on a whim that he decides to deviate from a patrol route one night and swing by Wade’s apartment. He just intends to swing by, not go inside, but then he sees a light on and, well.\nIn his own defense, he does knock on the window first. It’s only when he gets no answer that he slides it open and goes inside, uninvited and grateful that Wade never learned his lesson about locking it.\nThe only light on, the one Peter had seen through the window, is the kitchen light, spilling out into the living room. Peter opens his mouth to call for Wade, only to come up short when he really registers what he’s looking at.\nThe apartment is a mess, and it's not just Wade’s usual brand of messy. It’s actually trashed, as though it’s been ransacked. Couch cushions are ripped open, the TV and bookshelf are toppled over, posters are torn from the walls, Wade’s gaming system is smashed and his DVD collection is scattered in pieces across the concrete floor. The kitchen doesn’t look to be in much better shape. Every dish Wade owns- which, admittedly, isn’t all that many- looks to be broken, the glass spilling across the tile and reflecting the light.\nPeter steps carefully around the mess, picking his way toward the bedroom, growing increasingly concerned, especially once he notices the trail of what looks like blood leading from the front door. “Wade?” he calls. No answer.\nHe hesitates with his hand on the doorknob. Is this another invasion of privacy? Peter’s never been in Wade’s room before. He’s never been invited in.\nSpecial circumstances, Peter tells himself and goes in anyway. The door creaks as it opens, the hinges in need of oiling. The only light is that of the moon, slanting in through gaps in the blinds over the bedroom window.\nThe first thing Peter notices is the Deadpool suit and weapons laying across the sheets.\nThen his eyes find Wade, sitting on the floor, propped up against his bed. He’s in plainclothes, chin tilted down, one arm wrapped over himself and the other clutching the teleportation belt.\n“Wade…?” Peter ventures, crouching down beside him, but even as he says it he gets that feeling one gets when they’re talking to someone they know can’t hear them. Wade isn’t moving- isn’t even breathing. He’s dead.\nIt’s a weird thing to think. Even weirder that it shouldn’t send Peter into a panic.\n“What happened to you?” he asks aloud, just because it’s too quiet in the apartment. The moon doesn’t provide much light but it does reveal shiny, wet stickiness on Wade’s hands and clothes. Peter pries Wade’s arm away from his midsection and discovers the source of the blood- a gaping wound in his stomach, at which point Peter is glad there isn’t more light. He can see plenty already.\nHe blows out a breath, not sure what to do. He doesn't know how fast Wade’s healing factor is supposed to be working. He’d healed from that gunshot to the head incredibly quickly. Then again, Peter doesn’t know how long he’s been sitting here. Maybe it's been mere seconds. Maybe the wound is already knitting itself back together and Wade will wake up any at any moment.\nPart of Peter wants to stick around and find out but he knows he’s probably the last person Wade wants to see when he wakes up, and there’s no telling what kind of mood he’ll be in after getting hurt like this. Peter isn’t looking to pick another fight.\nInstead, Peter clears off the bed and helps Wade onto it. It’s not difficult, with his enhanced strength, and Wade is still warm and pliable, which is probably a good sign. At least now maybe Wade won’t wake up with aches and pains from sitting on the floor for so long.\n“You’re a sap,” Peter tells himself as he places a pillow under Wade’s head. He almost removes Wade’s mask, as well- the only part of the Deadpool suit he’s currently wearing- but stops just short, decides against it. He’s pretty sure he forfeited the right to see Wade’s face. Hopefully just temporarily.\nPeter decides to make one more plea for communication, vows to himself that if he doesn’t hear from Wade this time, he’ll give up. He doesn’t want to force Wade into anything, after all.\nHe has to search but eventually, he finds pen and paper in the kitchen and scrawls a note.\nCall me, please, it says.\nPeter considers, then adds, I miss you.\nHe leaves it on Wade’s nightstand, pauses just long enough to realize that Wade is breathing now. The deep, even breathing of someone who is very, very asleep. It’s a relief, but Peter still leaves feeling unsettled and sad and sure that Wade isn’t going to call.\nThree more days pass before Peter ever hears from Wade. When the phone finally rings- the phone- his stomach sort of bottoms out and he stutters as he answers, shocked. He’d pretty much given up hope, which is why he spent the last three days trying to stay as busy as possible. No time to dwell, that way.\n“Peter?” Wade asks as if it would be anyone else. “What are- why does it sound like you’re being yelled at?” He sounds strange. He’s talking fast but deliberately monotone.\nPeter glances over his shoulder, where Jameson is scolding some poor intern. Loudly. He turns back around, shielding the phone from view in case anyone should happen to look over. Not exactly the ideal place for this conversation but Peter isn’t about to lose the opportunity, and there’s enough commotion that he’s pretty sure his voice is drowned out. “It’s not me getting yelled at,” he tells Wade. “But I’m at work.”\n“Oh. Sorry. What time is it?”\nPeter checks his watch. “About ten in the morning.”\n“Shit, I thought it was later. Okay, I can- call back or. Something.”\nPeter abruptly realizes that Wade sounds strange because he’s nervous. “Wait,” he says, somewhat irrationally afraid that if Wade hangs up now he’ll never hear from him again. He laughs, mostly at himself. “I mean, obviously I want to talk. I’ve been trying to reach you since you stormed out of my apartment.”\n“Yeah, I… listened to the voicemails,” Wade says carefully. “And got your note... I think maybe I’ve been kind of an asshole.” He makes a sort of self-deprecating noise, tinny over the phone line. “Sorry it took me so long to call. There was some shit I had to take care of. Some things I needed to sort out. You know how it is.”\nPeter hunches over, places his hand over the phone, realizes that looks suspicious, and straightens back up. He lowers his voice as he asks, “By the way, what happened to your place?”\n“What?”\n“Uh, it was kinda trashed last time I was there. Is everything okay? Are you in some kind of trouble?”\n“Oh. Um, no. I did that.”\nSince Wade isn’t currently there, Peter directs his mystified look at the nearest wall. “You wrecked your apartment?”\n“I wasn’t exactly planning on coming back and it’s not like I can’t afford to replace all that shit ten times over- Look, it’s a long story. Can I see you? Please? I’m not above begging.”\nThe fact that Peter has been trying for over a week to get in touch with Wade and Wade still thinks he might have to beg to see him strikes Peter as sad. He’s not sure what it says about the state of Wade’s self-esteem, but it can’t be anything good. “Yeah, of course. I’ll text you, okay? When I’m done here.”\n“Promise?”\n“Promise.”\nPeter is reluctant to end the call. Maybe Wade is, too, but he says, softly, “See you later, Spidey,” and that’s their cue. It’s either hang up or risk looking like a clingy dork, so Peter hangs up.\nIt might as well be years rather than a small handful of hours before Peter is done at the Bugle. He checks his watch every five minutes or so like it’s a compulsion. Jameson goes on another rant about Spider-Man but Peter barely notices. He’s pretty sure a couple of people attempt to have conversations with him. He doesn’t mean to brush them off, but he’s distracted. He's too busy trying to organize his thoughts and figure out what the hell he’s going to say to Wade.\nIt was Peter’s idea to meet somewhere public. Neutral territory. As soon as he’s free of the Bugle, he dons his Spider-Man suit and webs his way to the chosen rooftop. It seemed appropriate. Secluded but not hidden and familiar to them both. Besides, Peter would be lying if he said the mask wasn’t something of a security blanket.\nHe absolutely expects Wade to show up in uniform, as well. Instead, he shows up wearing baggy jeans and a sweater that’s just big enough to make him look smaller than he really is. He’s not even wearing his mask. He’s making himself vulnerable, Peter realizes. He’s reluctant to remove his own mask but it doesn’t seem right to be the only one hiding his face. He slips it off as Wade approaches, hands stuffed in his pockets and chin ducked. Sheepish.\n“Hi,” Peter says. Wade takes a seat beside him, their legs dangling over the edge of the building. The people on the streets below look like little more than ants. Neither of them has much cause to be afraid of heights.\n“Hi,” Wade parrots. He won’t quite look at Peter.\n“You want me to go first?” Peter asks before an awkward silence can set in. He doesn’t wait for an answer. “Cause I can totally do that. I’ve been thinking about what I want to say since last time I saw you. And- I guess… I still don’t really know. But ‘I’m sorry’ seems like a good place to start.”\nThat gets Wade’s attention. He looks up, finally. “You’re sorry? What the fuck for?”\n“For going through that file, for starters. I had no right.”\nWade shakes his head. “None of that stuff was secret. You could’ve asked me about any of it, Peter. My past, Weapon X, Vanessa- whatever. I would’ve told you anything you wanted to know.”\n“Would you? Without getting defensive? Without hiding anything?”\nHe glowers. “I was starting to think I didn’t need to.”\n“Look,” Peter sighs. “I- I stand by my beliefs. My uncle used to say ‘with great power comes great responsibility'. He meant a responsibility to protect people, but he also meant a responsibility not to abuse that power. I can’t appoint myself judge, jury, and executioner. I just can’t. What if I pull the trigger on an innocent? On someone’s mom or dad or brother or kid? I’ve had people taken away from me- I can’t do that to someone else. Not if there’s another way.”\n“I’ve lost people too, you know. You don’t have that market cornered.”\n“I know that. Hell, Wade, after what you’ve been through… Most people would’ve given up a long time ago, I think. But not you. You still try, and I think that’s amazing.”\nThe resignation on Wade’s face turns to tentative hope. It's an expression that he quickly and deliberately stifles. Peter could go on. He could probably alternate between singing Wade’s praises and apologizing for a few hours and not run out of words, but curiosity is niggling at him. He can’t stop thinking about the way he’d found Wade a few nights ago.\n“So,” he says, when Wade stays silent. “Wanna tell me what happened the other night? You know, right before I walked in on you bleeding out.” That isn’t strictly true- by the time Peter arrived, Wade had already done the bleeding out. He just can’t bring himself to put it in more plain terms.\nWade blows out a breath. “So it’s my turn, huh? You want the short version? After our, uh, talk- I was pretty pissed off. Went home, trashed the place, decided I was fucking done with New York. Then I went out and picked a fight because- I don’t know. Because that’s what I do, I guess. I wanted to punch someone in the face so I went and found someone to punch in the face. And then…” He hesitates.\nPeter nudges his foot with his own, silently urging him to go on.\n“I took a job,” Wade admits. He’s staring hard at his own hands. “Kind of just to spite you. Fucked up, right? But it was a bad dude, a guy I thought deserved to die. I figured someone should hurt him before he could hurt anyone else. So I was getting all set up to take him out. Doing all the research, planning all the plans- the boring stuff you have to do before you can actually make the hit. But I just kept thinking about you. About how you’re the only hero who’s ever treated me with any goddamn respect. About the way you look at me. Like- like I’m-“ He glances over. “Like that.”\nPeter can feel himself blushing. He wasn’t aware he looked at Wade in any kind of way that could be considered special. He tries to school his expression into something more neutral and, if the way the corner of Wade’s mouth quirks up is any indication, probably fails.\nPeter clears his throat. “Did you go through with it?”\nWade scoffs. “Nah. Thinking about your dumb puppy eyes took all the fun out of it. So I backed out. But the guys who hired me- they didn’t like that. They came around to try and talk me into it. But I… was still feeling… Uh, kinda low. Might’ve run my mouth a little bit, goaded them into a fight.”\n“A fight that you lost.”\n“There were a lot of them,” Wade says, defensive “And I was trying not to kill any of them. But- yeah. I lost. Had to teleport out of there once I got hurt bad enough because fuck knows what they would’ve done with my corpse.”\n“So you came back here?”\n“It was the first place I thought of… And I guess I kinda missed it.” He pauses, flicks another glance in Peter’s direction, and admits, “And you.”\nPeter hums. “You didn’t kill a guy… because of me,” he says. \n“Basically. Which is stupid, right? Cause we’ve got no chance. Doesn’t matter how many I guys I don’t kill, you’ll just bolt the next time I fuck up-“\n“Who says there’ll be a next time?”\nWade doesn’t so much roll his eyes as he does his entire body, like he thinks Peter is being denser than anyone has ever been before. “There’s always a next time. Have you even met me?” His fingers are tapping out an uneven rhythm against his knee, more rapidly as his agitation grows. “I’ve tried before. To be- better. A hero. But something always pulls me back and I fuck up and suddenly everyone wants to be first in line to say they knew I was no good all along, that I could never change- all that shit. Eventually, you just start to think they’re right, you know?”\nWhile Peter is willing to admit that he’s grown immensely partial to Wade, he’s never felt all that protective of him. Until now. Now he wants to knock the heads of anyone who’s ever been mean to him. It’s a childish impulse, though, and he’s not sure Wade would appreciate the sentiment anyway.\n“I didn’t come here to offer you an ultimatum, Wade.”\n“Then why did you come here?”\n“Hopefully the same reason you wanted to see me. I just… don’t want to lose you. Even if we can only be friends, or-“\n“Even if I keep up the mercenary work?”\n“Don’t get me wrong- if you’re willing to try, that’s great. But unless you start killing the good guys, or you tell me to leave… I’m not going anywhere.”\n“You have no idea how hard that is for me to believe.” With an irritated noise, Wade gets to his feet and starts to pace across the rooftop. Peter stands, too, watches him with arms folded over his chest. He’s clearly having some sort of internal debate. Peter doesn’t push him, just waits it out, but every second that passes leaves him more terrified. Peter has never felt more like an exposed nerve than he does at this moment. He's compromising his own beliefs, putting himself out there in a way he's never done before, not even with MJ. He's not sure he could take a rejection from Wade. Not now.\n“I want to believe it,” Wade says after a moment, coming to a stop just out of arms' reach. “But it seems too good to be true.”\n“So let me prove it.” Peter practically begs. He steps forward, takes Wade by the shoulders. His touch has an apparent calming effect because Wade deflates under his hands, the tension draining from him. That naked hope in his eyes is back, and this time he does nothing to quell it. “I know it’s not going to be easy, Wade. We’re both… We have a lot of issues.” He smiles, to take the sting out of the words. “But I want to try. Don’t you?”\nWade catches his lip between his teeth while he thinks. He takes one of Peter’s hands in his own, threads and unthreads their fingers. Finally, he says, “Yeah. We can try.”\nThose three simple words lift a massive weight from Peter's shoulders. He feels like he can breathe again. “And all is forgiven?”\n“I’ll forgive you for snooping if you forgive me for being an asshole.”\nPeter beams up at him. Wade returns his smile and it's the best thing Peter's ever seen. “Done.”\nWade is still turning Peter’s hand over in his. “So,” he says, trying hard to sound casual. His eyes drop to Peter’s fingers. “About this ‘just friends’ thing…”\nPeter’s grin turns sly. “What about it?”\n“Well, yeah, we could be just friends, if that’s what you want… Or you could take me back to your place and I could finally give you that blowjob.”\nPeter’s nod is perhaps a little too enthusiastic, because Wade laughs at him. It's such a fond, happy laugh, though, that Peter forgets to feel embarrassed.\nPeter has to juggle a plate of fresh-baked cookies and brownies to be able to ring the doorbell. Wade’s idea. A pre-emptive peace offering, maybe. Wade had made them himself. It took a little bit of trial and error but this batch was, in his own words, so good that whoever tried them would fall instantly in love with him. \nPeter glances at Wade, now standing on the stoop beside him and looking anxious. “Would you stop fidgeting? Jesus. You’d think we were going to meet the Pope, not my Aunt.”\n“Basically the same thing,” Wade mumbles. He puts his hood up, then down, then up again. He groans. “Why couldn’t I just use my shiny new image inducer? She’s gonna be so grossed out. She probably won’t even let me come in. Peter- she’s going to think I’m not good enough for you.”\n“She’d probably think that even if you looked like a supermodel,” Peter points out. “But seriously, Wade, you look fine. Everything’s going to be fine. Just be yourself.”\nWade nods. “Right,” he mutters. “Myself. Got it.”\n“Just,” Peter amends. “No sex jokes. Or cursing. And don’t talk about the whole mercenary thing.”\n“Four months and no kills!”\n“Yeah, babe, and I’m super proud of you but please don’t brag about that in front of my Aunt. And maybe use your inside voice.”\nWade makes a show of lowering his own volume. He shoots Peter a thumbs up.\n“Oh,” Peter adds. “And she thinks you were in the army.”\n“The army?” Wade sputters. “Like the American army? Peter, I’m not even American.”\n“… Uh, yeah, don’t mention that, either.”\nAunt May doesn’t even ask who it is before she swings the door wide, catching Wade in the middle of an eye roll. She’s already grinning. She doesn’t immediately acknowledge Peter in favor of greeting Wade, eyes traveling from his head to his feet and back again. She’s been wanting to meet him since Peter officially declared the two of them together months ago. Peter isn’t the least bit surprised at the lack of judgment he finds in her expression, but Wade seems to be. He acts downright shocked when the first thing she’s does after they’ve exchanged pleasantries is pull him into a hug.\nPeter is largely ignored for the rest of the evening, but he’s pretty okay with it. Watching Wade first stutter his way through dinner and then, later, bond with his Aunt over home and gardening television is both adorable and entertaining. Once Wade is sure that Aunt May isn’t going to bite his head off he loosens up and starts cracking jokes. At one point, he has Aunt May doubled over she’s laughing so hard.\nPeter loves his Aunt, she’ll always be his favorite person, and seeing her gush over Wade- who has quickly become his second favorite person- has him feeling all warm and fuzzy and downright enamored. Of both of them but especially of Wade, who’s been trying so hard these last few months. Peter feels a swell of pride and affection when Aunt May passes him on her way to the kitchen and pauses just long enough to wink and whisper, “Good catch, Peter. I like him.”\n“Me too,” Peter agrees, grinning. As soon as his Aunt May is gone from the room, Peter plants himself beside Wade on the couch, eager to be close. “See?” he says. “Told you there was nothing to be worried about.”\nWade obligingly throws an arm over Peter’s shoulders, pulling him closer still. “All part of my plan to supplant you as the favorite.”\n“Shut up.” Peter digs an elbow into Wade’s side. “I’ll always be the favorite.”\n“Give it time. She hasn’t tried the brownies yet.” There’s mirth in Wade’s eyes. It’s infectious and Peter is helpless to do anything but smile back at him. Wade plants a kiss on his cheek and lingers there, nuzzling at him in a way that’s more playful and affectionate than anything. He’s practically exuding happiness.\nPeter loves him.\nThis isn’t news, exactly, but it’s the first time Peter’s thought of it like that. In those words.\n“Uh,” he says aloud. He hadn’t meant to.\n“What?” Wade asks, pulling back, head tilted like a quizzical puppy.\nPeter blushes. “I was just… thinking,” he says slowly. He can’t tell Wade now. It’s- not the right time. Instead, he brings up something else he’s been considering. “You know how you’re at my place most of the time now?”\n“Yeah…?” A worried crease appears on Wade’s forehead.\n“Not that I mind!” Peter rushes to add. “Actually, what I was thinking was… What if you just kinda… stayed there. All the time.”\n“You want me to move in with you?” Peter can’t glean anything from Wade’s tone or expression.\n“Yes?” Peter ventures. “It’s silly for you to keep your place, right? You’re never really there anyway,” he justifies. “And most of your stuff has migrated to my apartment already so it’s not like it’d be that different-“\n“You want me to move in with you?” Wade reiterates.\nPeter shifts around as he tries to fish something out of his pocket. “I kinda already had an extra key made,” he says, holding it up. “It’s cool if you don’t want to, though. You can still have the key, just in case or whatever-“\nWade snatches the key, eyes wide. “Holy shit. Yes. Yes, baby boy, of course I’ll move in with you! What the fuck!”\n“Shh,” Peter hisses, glancing around for his Aunt. He can still hear the faucet running in the kitchen so he figures they’re safe until she gets the dishes done. “Language!”\nWade is holding the key like it’s a sacred artifact. “I’m going to be the best fucking roommate ever,” he says, ignoring Peter’s warning. “This is the second-best day of my life now, oh my god.”\nPeter grins, then falters. “Wait, second best? What was the first best?”\n“Last week, when you finally let me-“\n“Okay!” Peter yelps, cutting him off. “Enough of that!” He pauses, then adds, “But yeah, that was pretty great.”\n“I know,” Wade agrees, giddy. He leans in and kisses Peter properly, the two of them smiling into it.\nYeah, Peter loves him. Though Wade’s never said as much, he’s pretty sure the feeling is mutual."
}