{
    "id": "639852",
    "url": "https://archiveofourown.org/works/639852?view_full_work=true",
    "author": [
        "kalpurna"
    ],
    "title": "Don't Worry Baby",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Teen Wolf (TV)"
    ],
    "relationships": [
        "Derek Hale/Stiles Stilinski"
    ],
    "characters": [
        "Derek Hale",
        "Stiles Stilinski",
        "Erica Reyes",
        "Vernon Boyd",
        "Isaac Lahey",
        "Scott McCall (Teen Wolf)"
    ],
    "additional_tags": [
        "Alternate Universe - Prostitution",
        "Fake/Pretend Relationship",
        "Knotting",
        "Impregnation Kink",
        "Pining",
        "Comeplay",
        "Barebacking",
        "Werewolves",
        "Rimming",
        "Possessive Behavior"
    ],
    "language": "English",
    "series": "",
    "published": "2013-01-15",
    "completed": null,
    "words": "20,276",
    "chapters": "1/1",
    "comments": "863",
    "kudos": "31,731",
    "bookmarks": "7,462",
    "hits": "570,038",
    "summary": "<p>\"You know you're allowed to ask for vanilla sex, right?\" he says, afterwards. \"We can do whatever you want. That's kind of the point.\"</p>\n<p>Derek doesn't respond.</p>",
    "notes": "<p>For drunktuesdays, who not only came up with the idea, and told me which scenes to write, but coaxed out pretty much every sentence of this fic. Beta read and massively improved by the incomparable giddygeek.</p>",
    "text": "The weirdest thing is when Stiles figures out that Derek isn't even getting what he wants, not completely. Who the fuck pays for a hooker and doesn't ask for what they really, truly want? What would be the point? It's the one thing that none of Stiles's clients have ever hidden from him, not the way boyfriends might. He expects lies on every subject except this one. \nStiles doesn’t accept every call he gets, but he specializes in werewolves, so he gets more than his fair share of weird requests. His clients have given him fake names and asked him to degrade them, to piss on them, to do things that Stiles won't do even for his dad's bills, and all of them, even the ones who were ashamed about it afterwards, have known they could be honest with a hooker about what they want in bed. They've gotten their money's worth.\nAnd it's not like what Derek seems to want is unusual, especially for a werewolf. They have rough sex up against walls, biting sex, sex that leaves Stiles with rug burns on his knees and elbows and one cheekbone. Derek seems to like it, always comes. Stiles likes it too and is shameless about showing it, because why not?\nSo it comes as something of a shock to catch Derek's reaction the night that Stiles is too exhausted and bruised to kiss any way but sweetly, to ride him any way but gently. Derek is strangely malleable, stays where Stiles puts him, touches Stiles's hips when he climbs on top of him. He sets a slow pace and Derek doesn't try to speed him up. It's just — easy.\nAt some point Stiles closed his eyes, and he's gone from just bracing both hands on Derek's chest to something that verges on petting. He's touching Derek so lightly, and Derek is being so weirdly quiet, that he suddenly wonders if he's annoying him. Maybe he's ticklish. Stiles forces his eyes open to check.\nDerek doesn't look impatient. He looks lost. His face is so open and young that Stiles has to reach out and cup it in his hands, the way you'd hold something breakable, something valuable. He leans down to rub his mouth soothingly against Derek's sweaty hairline, mindlessly murmuring about how good he feels, how much he likes this. When Derek comes he kisses him through it.\n\"You know you're allowed to ask for vanilla sex, right?\" he says, afterwards. \"We can do whatever you want. That's kind of the point.\"\nDerek doesn't respond.\nStiles isn't good at self-control, and he isn't good at respecting boundaries, but for a few weeks, he actually tries his best with both when it comes to this part of Derek. It's too obvious a bruise, and Derek deserves not to have it poked at. He really, honestly tries.\nBut he isn't good at those things. And besides, it's addictive. One night Stiles slides two fingers into Derek's mouth, not very far, just holds them gently on Derek's warm, velvet tongue. Derek is quiet afterwards, subdued.\nAnd he can't manage to stop himself from blurting things out now that he suspects how Derek will react to them, things like:\nwhile he's sucking him off, he backs up just far enough to say \"I love watching you come, it's my favorite part, your face,\" and Derek's head falls back against the wall, and:\n\"You feel so good in me,\" when Derek is fucking him doggy-style on the acrylic hotel coverlet. \"You feel amazing, you make me feel so — amazing,\" and he can't see Derek's reaction, but he feels his body jerk like he's falling, and:\n\"I don't want you to stop. Ever,\" which is a bit too honest, but worth it for the way Derek's arms shake, and:\nlow, sincere, \"I like you so much.\"\nThat last is apparently a bridge too far. Derek dumps him off his lap, where Stiles has been perched for the last twenty minutes, experimenting with just how long he can keep Derek necking like a teenager before they get down to fucking. He's developed a technique here that he's pretty proud of. Every time Derek's hands get urgent, Stiles uses his fingernails to slowly scratch the back of Derek's scalp, right up under the curve of his skull, and watches him relax like his strings have been cut. But now those strings are all reattached, and tightened to the breaking point, as far as Stiles can tell from his position on the hotel carpet.\n\"Don't do that,\" Derek snaps, looming over him. \"Just, can you fucking shut up, for once in your life.\"\n\"Okay,\" Stiles says, looking at Derek like he's crazy, and then regrets playing dumb. He knew what he was doing. More quietly: \"Okay.\"\nThe second version seems to infuriate Derek more than the first. He actually wolfs out a bit, baring his teeth, and Stiles throws up both hands like he's walked in on a bank robbery. He wonders if his heart rate has picked up.\n\"Okay! I get it, dude, calm down. Message received. I'll keep it to myself from now on.\" Derek looks unappeased.\n\"I never asked you to — \" he snaps, and presses his lips together like he's trying to crush something between them. \"It was fine before. You didn't have to — it was fine.\"\n\"Fine,\" Stiles says, and before he can stop himself, \"I liked that too.\"\nHe's not particularly surprised when Derek leaves, but he's surprised he still pays.\n \nAfter that, Derek stays away for a whole nine days, longer than they've gone in months without that reluctant voice on Stiles’s work cell. Stiles actually wonders, with a sinking feeling he doesn't examine, if he isn't gone for good.\nIt's not like Stiles doesn't have other clients, but some of them are better than others. He's had a few regulars who were a little too sincere about smacking him around, like they think Stiles really is filthy, really does deserve to be punished — although Derek is still the only client he's ever had who can spank somebody and act like he's punishing himself — and he hadn't realized how many of those people he'd dropped since he started seeing Derek more often. Derek is a big tipper, and he's reliable as clockwork.\nBut now the clock has run down, maybe. He lies awake for a while, doing calculations. It hasn't been long enough to say for sure that Derek’s not coming back, but it's getting less and less likely, Stiles thinks. If this break lasts any longer without giving Stiles a chance to refresh Derek's enthusiasm, what started out as anger is probably going to turn into plain lack of interest. And there's rent, and bills. \nHe’s not broke, but he’s also not just doing this for fun. He needs that money. So on the tenth day, when one of those old clients calls, he doesn't let it go to voicemail. The guy sounds no better or worse than Stiles remembers, still kind of a jerk, voice shrill. He wants Stiles to meet him in an alley, rather than a hotel room, and if Derek's not coming back maybe Stiles can't afford to be picky about stuff like that.\n“An alley, really?” he says when the guy arrives, but he doesn’t seem to be in the mood for banter. He listens for footsteps, grabs Stiles’s arm the moment he’s satisfied they're alone, gripping too hard. It's more violent than Stiles really likes his rough sex, even before the guy actually pulls him back from a blowjob to hit him hard across the mouth, splitting his lip.\n\"What the fuck,\" Stiles yells, and the guy groans, fists his dick, and comes all over Stiles's face. He zips up and hurries away, leaves Stiles alone in the alley without another word. It's the worst Stiles has ever felt about who he is and what he does. \nNaturally this is when Derek finally decides to show his face.\nHe doesn't actually notice Derek until he's right in front of him, preoccupied with trying to wipe the come out of his eyelashes. He jumps about a foot in the air at Derek's full-on growl, flailing wildly before he realizes who it is and relaxes back against the wall.\n\"Oh my God, I'm getting you a cat bell,\" he sighs, adrenaline falling again.\nDerek doesn't seem to hear him. He grabs Stiles's face in his hands. It feels like the raged-out version of what Stiles did that first night, less like Stiles is preciously breakable and more like he's the last must-have Christmas toy at a Black Friday sale. \"Ow,\" he says, and Derek's grip eases up minutely.\n\"Who,\" Derek says in a flat voice.\n\"Was that a question?\" Stiles says, raising his eyebrows as high as they'll go. \"Do you know about question intonation? Or are we still reviewing question words? We could do 'how' next.\"\n\"Tell me both,\" Derek says. \"Also, when.\" Stiles glances up at him through his eyelashes, trying to gauge his mood. He's not kidding.\n\"It was some guy,\" Stiles says, blowing out a sharp breath. \"I didn't ask for ID. A few minutes ago, I didn't see where he went. And as far as the other one —\" he folds his arms across his chest. \"If you don't already know it's part of the job, you're too dumb for me to help.\"\nDerek doesn't seem to know what to say to that. \nThe thing is, though, he also won't leave. Not until Stiles throws up his hands and slides into the Camaro, Derek closing the door too quickly behind him, like he thinks he might make a break for it. The worst part is that Stiles doesn't actually want to. There isn't anywhere he'd rather be right now than with Derek, sitting in uncomfortable silence, watching Derek's nostrils flare angrily and wondering how badly he smells of come.\nYikes, he thinks.\nThis is probably the part where he's supposed to break it off, when he knows he’s a hooker who’s getting dependent on his weirdest trick. If he were sensible, he'd let Derek find someone else to throw around, someone who would never cuddle him against his will or tell him he's great, someone who doesn't get overinvested in angry guys with emotional problems. Someone who accepts Derek's terms. Maybe even someone Derek doesn't pay.\nBut God, he doesn't want to.\nA lump actually rises up in his throat. He feels like such a child, exhausted and sick to death, and he doesn't want to let Derek go. The glass of the car window is cool against his cheek and it reminds him of being a kid on a long trip. He wants a nap. He wants a nap with Derek. This is awful.\n\"This is awful,\" he says out loud, and ignores Derek's questioning glance.\nDerek apparently stores wet wipes in his car like a soccer mom, which Stiles considers mocking him for. He cleans his face carefully, taking his time, pressing on his closed eyes so they flash dull colors.\nWhen they get to the hotel, Derek turns off the car, but doesn't make a move to get out. He's glaring at the steering wheel like it sassed him.\n\"So, are —\"\n\"Stop turning tricks,\" Derek says loudly, and then hunches his shoulders like he wishes he hadn't.\nStiles fidgets with the door lock. He isn't sure what to say. Normally he'd be knee-jerk angry, talking about his life and his business, but the truth is he's already on board. He's been thinking it ever since that guy pushed him down, when he realized he didn’t have his taser. There it was, written in neon letters: The End. It was fine for a while, and now it's not fine. All night Stiles has known deep in his bones that he's done, but. But.\nThen Derek adds, \"Just me.\"\nStiles turns his whole body to stare at him like he's crazy, and this time it's not because he's playing dumb. It's because Derek is fucking crazy.\n\"You want me to be your mistress?\" He's man enough to admit that his voice breaks. \"Wait, no, I don't think I used the right intonation there. You want me to be your mistress? Master? Wait, that's wrong,\" he says quickly. \"I mean, yes. Definitely yes, that would be — yes. Are you rich? Is this going to bankrupt you? I really hope not, because man, I have got to stop doing this the way I am. Um, so my answer is yes.\"\nHe can't tamp down his smile, even though it's hurting his split lip. If Derek wants to hire him full-time to do a job he failed at part-time, he's not going to be the one to point out how stupid that is. This is so, so good. Any and all 'yikes' had better go back where they came from.\nDerek looks up, face unreadable. \"Yes?\" he says, softly. Stiles nods.\nDerek straightens his back and starts the car again. He answers a question Stiles didn't ask — \"I don't like the smells here\" — and pulls out of the parking lot with finality. Stiles gives the hotel a surreptitious wave goodbye. He doesn't care what Derek's freaky nose says; that place holds good memories and he salutes it.\nHe reevaluates his fondness for the hotel the minute he walks into Derek's apartment.\n\"So, not going to go bankrupt,\" he says. The hardwood floors are polished enough to blurrily reflect the lights of the city skyline coming through the massive, two-story, floor to ceiling wall of windows, and Stiles toes off his shoes and socks so he won't track in dirt.\nDerek smiles, all teeth. \"Nope.\"\nStiles is starting to feel shivery-good all over, the various emotional swings of the day all crashing down on him at once and prickling up the hair on his arms. He’s not sure how he’s going to feel in an hour, but right now, he feels fucking alive. He gets to keep Derek, he gets to stop answering calls on his work cell, he gets to live here — hmm, actually, does he get to live here? They haven’t talked about any of it, really.\nInstead of talking about it, Stiles turns towards the stairs, pulls his shirt over his head. He climbs the stairs without looking back, stripping efficiently as he goes, not bothering to tease. All he wants is to be naked and in the bedroom now, and every nerve in his body is oriented like an iron filing toward the magnet of Derek’s gaze behind him, Derek, Derek, footsteps heavy on the stairs. When he gets to the second floor and steps out of his underwear, he can’t resist slanting a glance over his shoulder.\nDerek looks — complicated. Turned on, and pleased, and bizarrely sad, as only Derek could be when faced with a hot naked guy who wants to fuck him. And who genuinely likes him, which Stiles suspects is the real problem. Too bad Stiles likes fucked-up. I like you, he mentally blasts at Derek, picturing it knocking him back on his heels, a physical force. You are likeable.\nHe doesn’t know how much of that gets through, so just in case, he also flutters his eyelashes and strokes his cock.\nIn a burst of supernatural speed Derek is on him, grabbing his ass and lifting him up to carry him bodily into the bedroom, which startles Stiles into a peal of laughter. He’s still laughing when Derek dumps him on the bed, and he keeps his arms wrapped around Derek’s neck so he has to fall awkwardly on top of him.\n“Very Rhett Butler,” he says, smiling up at him, thinks you’re really, really not, kisses his beautiful mouth. Derek makes a helpless sound and kisses him back.\nIt’s hard, intense — and then suddenly it’s tender, enough of an about-face that Stiles almost pulls back in surprise before he notices the blood from his reopened cut. Derek breaks the kiss and thumbs Stiles’s damaged lower lip, then sucks it so carefully into his hot, wet mouth, as if he can take Stiles inside and fix him. Stiles groans like he’s dying. He’s pretty sure he is.\nHe breathes in, breathes out, breathes in, controlled, and then Derek’s gaze snags on his, and he can’t help himself. \n“I need you inside me. I love it, I love when you fuck me, I love that. It feels —” he tilts his hips involuntarily, groans just at the thought. Derek looks pinned for a moment, like a butterfly, before he unfreezes and slides down the bed, lifting Stiles’s hips all the way off the bed with inhuman strength. \n“It’s perfect. You’re — oh,” Stiles loses the plot, because Derek’s entire face is pressed against his ass in a nasty, open-mouthed kiss. It’s both gross and awesome, which should really be the motto of werewolf sex in general. \nThis is something Derek loved to do even before the whole scandalous revelation of his secret vanilla kink, one of the few preferences Stiles doesn’t think he was faking. He once held Stiles down and ate him out for so long that Stiles declined to let him fuck him afterwards, already as sore and sensitive as he could handle. Derek didn’t seem to mind, came all over his ass, pushed it inside roughly with his fingers over Stiles’s annoyed noises. \n“You’re seriously lucky werewolves can’t carry diseases,” Stiles had mumbled indistinctly into the pillow. “I don’t know what you’d do otherwise with that barebacking kink.” You weirdo, he added silently.\nNow Stiles wonders what he had really wanted to do. To use his tongue again, maybe, barely touching him, feather-light, not irritating the skin. There’s a whole undiscovered world out there of sex that doesn’t leave Stiles limping, and now he thinks Derek wants to map it all with an explorer's hands, uncover orgasms in Stiles like warm inland seas. It’s a mildly disappointing thought.\nNot that he’s ever going to let Derek know that, because he is supportive of his employer’s emotional development, and there is just no way they are going to keep having sex that Derek doesn’t like that much, not now that this is an exclusive arrangement. Stiles has his professional pride.\nDerek produces lube from a bedside drawer — Stiles wonders who he used it with before, and, with an unpleasant pang, whether he plans to continue — and starts fingering him open forcefully, carelessly, just how Stiles likes it. Stiles heaves a mental sigh.\n“Not that way,” he says, firmly.\nBefore Derek’s expression can finish going blank, Stiles grabs his withdrawing hand. He explains, with perfect truthfulness, “I’ve had a bad day,” and touches Derek’s smooth shoulder, leaves his hand resting there, light, undemanding. “Can we go slow?”\nThey go slow.\nBy the time Derek finally slides inside him, Stiles is a shaking mess. He was strung out and exhausted even before they started, and after what felt like an hour of unhurried, meticulous attention to detail, he’s ready to just come his brains out and sleep. The curtains are drawn, and it’s dark and cool in Derek’s bedroom.\n“Shh,” Derek whispers. “Shh, shh.” His voice isn’t made for cooing but Stiles feels soothed anyway, mouths vaguely at Derek’s jaw because it’s the only thing he can reach and he doesn’t want to move his neck. Derek angles his head obligingly so Stiles can get at his mouth, barely coordinated enough to qualify as kissing, mostly just breathing the same shuddering air as Derek moves inside him in the dark.\nHe comes without being touched, which is a surprise. Derek doesn’t pull out afterwards, which is less of a surprise. He doesn’t always knot when they fuck, but it’s happened before. Stiles strokes Derek’s sides gently, feels his lungs expand, before his arms are too heavy to hold up anymore. Holy shit, I’m in so far over my head, he thinks idly, already sinking into sleep. \nIt’s just a passing thought, though. He’s not backing out.\n \nIn the morning, Stiles drifts awake by slow degrees, rubbing his face against the pillow. He only bothers to lift his head when he reaches out and encounters nothing but rumpled sheets — Derek must already have gotten up. He isn't even sure what time it is, since Derek has blackout curtains over his windows and no clock that he can see. Derek is probably one of those people who wakes up at the same time every day without an alarm, Stiles thinks, unfairly annoyed.\nThe room is decorated in sober, masculine colors, and is mostly tidy, although there's a pair of sweatpants and a t-shirt tossed hastily over a chair. He can't quite bring himself to walk out onto a strange landing naked to get his clothes, so he puts those on. Besides, they smell like Derek, which seems like a good idea. Like camouflage. When in the werewolf's territory, he tells himself in the voice of David Attenborough, you must cloak yourself in his scent.\nThe sun is so strong when he comes out onto the landing that Stiles has to throw his hand up melodramatically and squint like a vampire. He blindly calls out, \"Derek?\" and follows the distant grunt he gets in response.\nThere are two things that are obvious about Derek's kitchen at first glance. It's expensive, and it's rarely used. Copper pots and pans hang from a rack like they're living in a Williams-Sonoma display. Stiles wonders if Derek can't cook, or if he just doesn't. \nThe man himself is standing bare-chested by the sink, looking like he doesn't know what to do with his hands.\n\"God, that's a nice view to start the day with,\" Stiles says. \"Please tell me you have coffee.\"\nDerek, obliging: \"I have coffee.\" He jerks his thumb at a massive, gleaming, chrome-plated espresso machine looming in the corner of the room like an angry bouncer. Stiles thinks he might cry. It's beautiful.\nHe makes himself too busy crooning to his new lover to acknowledge that Derek's uncomfortably shifting his weight like he wants to say something. Saying something seems like it can't end well for Stiles, since the most obvious things to say are things like \"Are you going to leave soon?\" and \"I changed my mind.\" Stiles should be the only one allowed to say things, really, in general. It's not Derek's field.\nBut Derek only says, \"I have to go to work.\" It sounds weirdly like he's asking permission. Stiles turns around, blinking.\n\"Uh… okay? Sure? I'll just —\"\n\"You can — you're allowed to leave,\" Derek says, earnestly. \"There's a key by the door. You can keep it.\" Stiles gives him a skeptical look, eyebrows raised.\n\"Yeah, I wasn't worried about it before you said that. You know there's a difference between kidnapping and… uh, this, right? We have to come up with a name for this. Mistress isn't a good look for me.\" He bites his thumb, considering. \"Am I your kept boy?\" \n\"Look,\" Derek says, which isn't necessary. Derek is shirtless, Stiles is sure as hell looking. \"I'm not trying to trap you here. But there's books, and I think the TV works —\" Stiles isn't going to touch that statement — \"and they bring me groceries, so. You don't have to. I mean.\" He huffs out a breath, almost angrily, and squares his shoulders like he's performing a duty he badly wants to avoid. \nThe whole thing would be insulting if Stiles didn't know that Derek habitually treats pleasure like a horrible burden. And besides, Stiles doesn't have much room to turn down the deal out of pique, even if he wanted to. This is the best option he's been offered in years, and he's not a nice enough person to give it up just because talking about it is making Derek look like he's being tortured slowly.\nDerek shifts his weight and looks away, like he's trying to figure out what’s gone wrong with an argument he's rehearsed in his head a dozen times, which somehow still isn't coming out right. \"I don't care what you do during the day but I expect you here at six, and you spend the night here, every night,\" he says, like throwing down a gauntlet. \"That's not negotiable.\"\nStiles stares at him. This is what Derek was worried about asking for? He doesn't fistpump, but it's a close call.\n\"Not a problem.\" Every night? Stiles may just never leave.\nOver Derek's shoulder, the microwave dings, and he turns around quickly to take out a breakfast burrito. It's surprisingly down-market for a guy with that car and this apartment, but then again he puts it on a plate, so still: relatively classy. Classy for people Stiles has shared living space with. They're lucky if Scott remembers to take things out of the plastic before microwaving them; plates are on a whole other level.\nDerek takes his plate with him upstairs to finish getting dressed, making an abstruse gesture towards the freezer with one bare shoulder which Stiles chooses to interpret as \"make yourself at home and help yourself, for mi casa es su casa, and my only concern is your comfort.\" Stiles prides himself on his creative interpretation skills. If Derek hadn’t told him to stay, he probably could have interpreted his way there anyway.\nWhen Derek comes back downstairs he’s dressed in an immaculately expensive suit, looking like a guy who has never seen a frozen breakfast burrito in all his born days, and might call the cops if he did. It's pretty impressive. Even the stubble suddenly looks like it was hand-shaped by a stylist for the red carpet.\nHis shirt isn't fully buttoned, which is a good, good look for him. It seems possible that Derek is trying to get the upper hand in their negotiations by manipulating him with his rippling pecs and washboard abs, and if so, Stiles will happily accept being on the business end of that tactic. \n\"I'm developing all kinds of perverted office sex fantasies here, just so you know,\" he says, putting down his own breakfast burrito. \"You probably have a desk, right? Do you have a swivel chair? I need to know what I'm working with here.\"\nDerek turns around to face him as he approaches, and Stiles takes a step right up into the warm shadow of his body, where he can bend his head and smell the ghost of shaving cream on the underside of his jaw. \n\"Hey, maybe before you leave, you should give me some incentive not to run for the hills.\" Stiles leers at him. \"Give me a little taste.\"\nWhat Derek gives him is a wet, slow, inappropriate kiss, open-mouthed and filthy, the kind of kiss you give someone when you'd rather be putting your mouth somewhere else. The blood is pounding in Stiles's ears by the time he pulls back. He carefully untwists Derek's hands from where they’ve become tangled in Stiles’s shirt, and holds them for a moment, just watching. \nFor all that he started the kiss, Derek looks dazed, lips pink, blinking like he's been drugged. Stiles licks his own lips, and watches the way Derek's eyes flicker down. He wonders, with a sudden flush of power, whether he couldn't get him to call in sick, stay here all day in bed instead of going off to what has to be a high-powered and important job. It wouldn't be hard, probably. Derek looks ready to be convinced.\nInstead he releases Derek's hands and fastens the last three buttons of his shirt for him, slowly, holding his gaze. He leaves a warm kiss in the hollow of Derek's throat before doing up the last button and tightening his tie.\nIt takes several fumbling grabs before Derek manages to grab his coat and leave. Stiles eats the rest of his breakfast burrito like a conquering hero.\nGetting back to the apartment he shares (shared! Had shared, used to share) with Scott takes almost two hours by public transit, and Stiles has got tension pulling all across his upper back when he finally turns the key in the lock. Scott’s waiting on the couch inside with his hands on his knees and a thunderous expression.\n“Where have you been?” he hisses.\n“Since when can I not go out at night, Boo Radley?” Stiles toes off his shoes. \n“That reference doesn’t make sense,” Scott says plaintively. He follows Stiles down the hall. “I worry when you don’t come home! What happened to your face?”\nStiles gestures vaguely over his shoulder. “Well, you know, shut-ins, and — yeah, it made no sense. I withdraw the reference. I’m fine, Scott.”\nStiles fingers the handle of his battered dresser drawer. Explaining everything to Scott feels like more trouble than it’s worth right now. He didn’t get a lot of sleep. He doesn’t want to deal with explaining this to Scott. If he starts packing, he’s going to have to talk about it.\nOn the other hand, if he doesn’t start packing, the point is kind of moot. He opens the drawer and begins pulling out t-shirts, avoiding Scott’s wide eyes. The duffel bag under his bed is beat-up, but it should do the job.\n“A business opportunity came up, Scott. I’m going to move out for a bit. I’ll keep paying rent, but if you want me to find a subletter for utilities I can —”\n“Move out?” Scott more or less yells. Stiles concentrates on folding his underwear.\nWhen Derek enters into his explanation, it only seems to bring Scott’s defcon level higher. \n“That guy is scary, Stiles,” Scott says urgently. “That one time you had the flu, he came up to me and asked if my roommate was okay, and I started to introduce myself, and he said ‘I know,’ like, in this super creepy voice!” He looks horrified. “How sure are you that he’s not a supervillain?”\n“Batman has a creepy voice, and he’s not a supervillain,” Stiles points out, a helpless smile tugging at the corner of his mouth. Derek is so terrible at the stealth aspect of stalking, it’s hard to find it threatening. It’s like when cats try to hide from you behind a sneaker.\n“Are you trying to convince me that I should let you date Batman?” says Scott. “Friends don’t let friends date Batman.”\n“It’s not dating.”\n“Oh, come on, dude. What part of what you’re describing isn’t actually dating?”\n“The part where he pays me, Scott.”\n“I don’t see any way this ends without you getting hurt.” Scott keeps angling his head earnestly to catch Stiles’s eye. “What does he want from you?”\n“It’s not me, it’s — he’s lonely,” Stiles says, zipping his bag shut. “I think he just wants to wake up with someone for a while.”\n“It sounds like he needs a boyfriend, not —” \nHe laughs, rubs the back of his neck, finally turning to face Scott fully. “Oh, believe me, you have never met anyone who needs a boyfriend more than this guy does.”\n“So I don’t understand,” says Scott.\n“He’s not — he’s pretty fucked up,” Stiles says. “I’m not saying he’d be a good boyfriend, but I think it would be good for him to pretend. Practice. I’m a hooker. It’s not so different now that he’s basically paying to date me, not fuck me —” he catches Scott’s look, and rolls his eyes. “Not that he isn’t going to fuck me, it’s just. I can do this for him. I’d be good at it.”\nScott says, sounding pained, \"Would you be doing this if I —\"\n\"Oh for God's sake,\" Stiles says, turning around. \"How many times, Scott?\" \nScott shrugs defensively. \"I just feel like if I hadn't gotten bitten, you'd never have gotten into this stuff.\"\n\"I like having sex, Scott,\" he says, closing his eyes. \"I like having sex with werewolves. I definitely like having sex with werewolves when that sex comes with piles of cash, so, seriously: how many times are we going to have this conversation?\"\n\"I should never have introduced you to that first guy,\" Scott says morosely, slouching against the wall.\n“You're unbelievable,” Stiles says, not without affection, and slings the bag over his shoulder. \"I'll call you later.\"\n \nHe arrives back at the apartment to discover Derek has cooked dinner for him, which is kind of a shock. \n“Hello?” Stiles calls out, kicking open the door with his foot and thinking better of it a second too late. Instead of stepping in, he lets the door swing back towards him and crouches to frantically rub at the scuff mark he’s just left. His bag falls with a thud next to him. Derek’s totally not going to notice, right? Anyone could have done it. Any one of the thousands of guests Derek never brings home.\nThe door swings silently open again, throwing off Stiles’s balance. When he looks up Derek is looming over him, eyebrows pulled forbiddingly together, mouth like a sideways C, and — the apartment smells fantastic.\nDistracted, Stiles uses Derek’s legs like a handrail to pull himself up — a move that only works because Derek has the thigh muscles of a trapeze artist — and follows his nose. “Did you order in from somewhere amazing?” He kicks his bag over the threshold, clasps his hands to his chest. “Is that my dinner?” \nDerek trails him, arms crossed over his chest. There’s a broiler pan soaking in the sink.\n“It’s nothing special,” he says. “Meatloaf.”\n“You used a broiler pan,” says Stiles. He touches the knife next to his plate with one finger, moves it a little. There are cloth napkins. Wine. It’s a little intense. “I don’t think I know anyone who owns a broiler pan.” \n“Lots of people own broiler pans,” Derek says, mulish. “Shut up and eat your meatloaf.”\nStiles can do that. The food is pretty good. Afterwards he sucks Derek’s cock, and then they brush their teeth, and Stiles scrubs the broiler pan while Derek loads the dishwasher.\n \nWhen Derek comes home the next day Stiles is sprawled almost upside down on the faded leather couch, one leg thrown over the back and his head flopped over the edge. He drops his book onto his chest and smiles at Derek. \n“Are you reading a book about crabs?” Derek asks, in a tone, Stiles feels, of unnecessary judgement.\nStiles slithers into a more conventional position so Derek can get a better look at the cover of Walking Sideways: The Remarkable World of Crabs. \n“I’m learning a lot, dude. Did you know that there’s an actual word in science for the tendency of nature to try and evolve a crab?” He brandishes the book like a missionary tract. “Like, crabs are such a good design concept that different branches of the evolutionary tree are constantly going ‘hey, fuck it, let’s make a crab.’ There are like four totally unrelated species that independently arrived at crabbiness.”\n“How embarrassing for them,” says Derek. “Like they showed up at the party wearing the same outfit.” \nStiles shoots him a shit-eating grin. “I thought you’d be personally interested, since you’re clearly a member of a new fifth species.” \nBut instead of getting pissy, Derek looks weirdly thoughtful. “You like learning about stuff, don’t you,\" he says. “Why aren’t you —”\n“I can’t believe you didn’t know if your TV worked,” Stiles interrupts, digging the remote out from underneath himself. “It didn’t, by the way. But I fixed it.”\nIt turns out The Dark Knight is on. Derek’s sound system is amazing for explosions.\n \nOne day Derek forgets a file on the kitchen table and calls Stiles mid-afternoon to ask him to bring it in.\n\"You have a driver's license, right?\" he says over the phone.\n\"How old do you think I am?\" Stiles asks. He knows he looks young for his age, but geez.\n\"You're twenty-one,\" Derek says. \"Not everybody gets a driver's license.\"\n\"Well, I'm not a virgin, and I can definitely drive,\" says Stiles.\n\"The keys are by the door. Take the Lexus,\" Derek says, unamused, and reads him the address twice before making him repeat it back.\nDerek’s workplace seems kind of stressful.\n“I need that report on my desk when I get in tomorrow, Isaac,” Derek snaps at a curly-headed guy in a sweater vest who is trying to disappear behind the binder he’s clutching. Isaac nods frantically. Derek stalks onward like he thinks he’s wearing a cape.\nThe whole place is painfully stylish. Everything is polished wood and dark, thick, red carpets, and terrified interns trembling in corners. It’s worrisome. Some of them look like if he made eye contact they’d burst into tears. \n“So explain to me again what you do?” Stiles says. He looks back over his shoulder and sees Isaac being comforted by an attractive blonde. \n“...scares me, Erica...” he hears, before they get too far away to hear Erica’s response. \nDerek, obviously pretending he didn’t hear that, hunches his shoulders and says, “I’m a consultant.”\n“Yeah, the giant fuck-off ‘Hale Consulting’ sign tipped me off to that one, but like, what is a consultant? Exactly? Like, what do you actually do?” He waves his arms around. \nDerek needs to stop rolling his eyes like a dickhead at totally reasonable questions.\n\"I'll be ready to go soon,\" Derek says, opening the mahogany door to a corner office. He goes to the desk and starts shuffling some mysterious papers around. \"Come in here and wait while I finish up some work.\"\nStiles says, \"Not that you'll tell me what that work is,\" but he follows Derek in, closes the door behind him. Locks it.\nDerek glances up sharply under his black eyebrows at the sound of the lock catching, and Stiles gives him his best innocent look. He wanders over to the window to look out, hands in his pockets. After a moment, Derek goes back to his files, sits back in his swiveling office chair to read something official-looking. \nThe view is spectacular. Out over the city, a cloud of birds is wheeling, expanding and contracting, flashing black wings against the sky before disappearing behind a stolid skyscraper and reemerging to land, a thousand individual flickers stilling, in the eaves of a chapel. The window glass is thick. They're so high up he can't hear the noise of the street.\nDirectly across from him is another office building. A woman in a skirt suit is leaning against the counter in a break room, alone, reading a book. She scratches the back of one calf with her stockinged toes, one high heel sitting empty on the ground. A man comes into the room and she startles, hides the book behind the microwave and almost falls over. Stiles laughs. \nDerek glances up suspiciously, and Stiles ignores him until he goes back to his papers.\nA few windows down from the woman with the heels, a guy is typing on a computer, and sitting on the desk next to him is an infant carrier with a chubby fisted —\n\"Baby!\" Stiles says, his palm slapping down on the glass of Derek’s window like he could reach out to touch. \"Oh man, that guy’s got a baby.\"\nThis time when he turns around, Derek is definitely, obviously staring at his ass. Catching his gaze, Stiles smirks. The tips of Derek's ears go red.\n\"What?\" Derek says, belatedly.\n\"There's a baby in that guy's office!” Stiles repeats patiently. “I like babies. Those tiny fingernails, and their fat feet, and they always look at you like you're nuts —\" he rambles, imagining the smell of a baby, its weight in his arms. \nHis mom had run a small day care out of their house when he was a kid, before she got sick. There was always milk warming on the stove and fuzzy toys underfoot, and Stiles was only allowed to play with Legos in his room with the door closed, so nobody could choke on the pieces. But when Stiles came home from school she'd shove a baby in his arms, fat and sticky-handed, and she'd kiss him on the forehead, and it felt like family and like being grown up, trusted. To this day he hates coming home to a quiet house.\nSomehow it always feels vaguely like he should be embarrassed about loving babies, like it's too effeminate or something, but fuck that: anyone who doesn't love babies is crazy. Babies are great. \nHe tunes back into Derek to see how he feels about this topic — Derek, whose eyes are glazed, lips parted, staring at Stiles —\n\"Oh my god, are you turned on right now?\" he says, jaw dropping. \"That is not normal! Men do not normally get turned on by other men saying they love babies!\"\n\"I'm not,\" says Derek.\n\"Aroused?\" says Stiles skeptically.\n\"A man,\" says Derek, low and rumbling in a way that sends a shiver up Stiles's spine, and he comes out from behind the desk.\n\"Well, biologically male,\" Stiles amends, leaning back against the window and looking at Derek through his lashes. To emphasize his point he reaches out, rubs Derek through his dress pants; lightly at first, then harder when Derek cats into it shamelessly. Derek's blunt teeth settle on Stiles's neck, breath hot.\nIn the end Stiles blows Derek in his office chair like the worst pornographic cliche. He gets come in his eyelashes, but Derek licks him clean like a gentleman. Or a dog. Both, Stiles supposes.\n\"Are you a dog person? Or are they like, competition for territory?\" he asks. Derek looks up from where he's been putting his mouth to further good use, and sucks tenderly on the head of Stiles’s cock. The desk is hard under his elbows and Stiles gives up, flops backwards so his head falls off the edge. \"Jesus, you're amazing at that.\" It's not false flattery. Stiles knows from good blowjobs, and Derek could go pro. Holy god, how does his temperature run that hot?\nThe blood is rushing to Stiles's face. He can't remember what he was talking about. He's going to lose it in a second. It’s bizarre how intense sex with Derek can be, and still stay entirely vanilla; this is office sex, but it’s just about the least kinky incarnation of it he can imagine, and he’s imagined plenty.\nDerek pulls him forward, hiking his thighs higher on Derek's shoulders, and his hips slide off the desk, and he bangs his head on the edge of the desk, and for some reason that’s what pushes him over the edge, coming helplessly down Derek's throat.\nStiles yells Derek's name when he comes, because he's an asshole. It's totally worth Derek's pissed off, embarrassed face to see everyone else's reactions when they emerge. Stiles is more inclined to consider this a victory march than a walk of shame, and he smiles benevolently around the room. The angle's wrong to see Derek's expression next to him, but whatever it is, it sends people into an frenzy of ostentatious officework. \nThat blonde woman from before catches his eye and mimes a silent round of applause. It's a source of great pride to Stiles that he has the maturity to refrain from taking a bow.\n \n\"So, is this a thing?\" Stiles says, waiting for Derek to unlock the apartment door. \"Should I not walk too close to the baby clothing racks if we’re ever in Target?\"\n\"Stiles,\" Derek hisses, glancing around like someone's going to hear them in the empty hall. He uses his bulk to crowd Stiles through the door.\n\"No, really,\" he says, mock-innocent, hooking his fingers in Derek's belt loops. \"I need to know how big a perimeter I should give strollers on the street.\"\nHe's still snickering at his own jokes when Derek tackles him into bed.\n \nHaving never before shared a bed on a long-term basis, Stiles has been surprised to find he likes it. People have told him he flails in his sleep, but Derek seems to handle it fine — mostly by pinning him down with a musclebound limb or two. \nHe can't stay up until four in the morning reading without feeling like a jerk, since Derek tosses and turns with the light on, so he actually gets more sleep than he ever has before. The morning sun is enough to wake him up, which is a new experience. He always thought he was a heavy sleeper; apparently, he was just sleep-deprived.\nGreeting the morning bright-eyed and bushy-tailed means he gets bored more easily, though. One time he actually starts cleaning Derek's apartment, but the doorbell rings halfway through the morning, and he answers it to find a tiny woman with a bucket and mop regarding him with deep suspicion. \nNo room in the apartment is a safe place to hide from the cleaning woman, he discovers. Everywhere Stiles stands is where she wants to vacuum, and everywhere he sits is where she needs to plump the pillows. He finally flees the field in defeat when she finds the lube bottle next to Derek's bed and lifts it with two fingers like a dead mouse.\n\"Bye, nice to meet you, bye!\" he yells, making for the door. He is staying the hell away until six. \nWith nothing better to do and some money in his pocket for once, he somehow ends up not in the mall or at the movies, but wandering into the community college. His grades had been good enough in high school that the counselor had been talking about Stanford, Berkeley; it's stupid that he's got butterflies in his stomach standing in the doorway of the registrar for a local city school, where you don't even need to apply to sign up for classes.\n\"Are you coming in or not?\" says the woman behind the desk, impatient. \nThere are forms and paperwork, and they ask for a copy of his high school diploma, but apparently he can start taking classes without it if he promises to bring it in as soon as he can. He had graduated high school without applying to colleges — he was going to take a year off, maybe two. Everyone had been very understanding after his dad — well, it didn't matter anymore. Most people he went to high school with are close to graduating now.\nThe registrar’s office is big, bustling with students, and he hunches over the papers, hiding them with his hand before he forces himself to sit up. It's not a test, nobody cares what he's writing down.\nThere's an English course on the Modernist novel that looks good, he thinks, and a lecture on Psych 101. He probably shouldn't take on too much, at first. Who knows if he can even do this stuff anymore? It’s been years.\nHe shoves his schedule all the way to the bottom of his bag before he unlocks Derek's door. No point in raising anyone else’s expectations of him prematurely.\n“There’s a holiday party at work next week,” Derek tells him over dinner. It’s another home-cooked meal, pork chops this time. He seems to enjoy having an audience for his cooking skills, which are, if not gourmet, competent and homey.\n\"It's not worth cooking for just one,\" Derek had said, the last time Stiles tried to call him on it. Stiles had taken a deep breath, wondering, how long had there just been one in this apartment? Derek's never talked about how long he's lived here, but it's been more than a year, at least. It's sad, the idea that Derek was alone so long. But Derek had turned away, back to the beef stew he'd been ladling, and said, \"Do you want some of this or not?\" and Stiles did, so he sat down, and let Derek serve him dinner. And now Derek is telling him about holiday parties? What next, the shopping list?\n“Oh, yeah?” he says politely. Derek ducks his head almost shyly.\n“I thought you might like to get out of the house,” he says. He stabs at his green beans.\n“Oh. Oh! You’re inviting me!” Stiles says, startled, putting down his fork. “Yeah, for sure!”\nDerek looks oddly relieved. \n“You’ll need a suit,” he says, with a disturbing glint in his eye. “Tomorrow we’ll go shopping.”\nStiles doesn't know what he expected, but Derek takes to the mall like a duck to water.\n\"That's nice,\" Stiles says, pointing at a plaid shirt. Derek rolls his eyes so hard they're in danger of falling out of his head. \n\"No, it isn't,\" he says rudely, and steers Stiles towards the really expensive racks. He pulls out something shiny with a three digit price tag and holds it up against Stiles's chest, assessing.\n\"I never understood how a hooker could dress like you do,\" Derek says.\n\"Hey, it caught me you, didn't it?\"\n\"It didn't take much to catch me,\" he says simply, like it costs him nothing to admit it. He’s preoccupied with the suits on the rack, pushing something blue aside with a sneer.\n\"I'm not sure which one of us that's supposed to be insulting,\" Stiles says.\nRather than answering, Derek fills his arms with suits.\n \nThe weekends are easier than weekdays, for both of them. One night, Derek works late, startles Stiles into jumping in his chair when he slams the door behind him. Stiles shoves his psych textbook hastily into his backpack, pulls the newspaper over his notes, but Derek isn't looking at him to see any of it. He’s just standing and staring out the huge window, tugging off his scarf with jerky movements. \n\"I want to spank you tonight,\" Derek says tensely, not turning. Stiles blinks. Something is seriously wrong here.\n\"Are you okay?\" he asks.\n\"Fine,\" barks Derek, finally glancing towards Stiles.\n\"Yeah, sure,\" says Stiles, skeptical. \"But you hate spanking me.\"\n\"I don't hate —\"\n\"You do,\" Stiles says. He's never understood the way Derek treats being rough in bed like it's some kind of punishment — like hurting someone is all he deserves to do — when he so obviously prefers to be gentle. Spanking is fun for Stiles, and that's why he does it. If Derek wants to play, that's great; he just isn’t convinced Derek has figured out how to play with sex at all. Maybe someday, but not yet.\nDerek looms and glares for a while, like that's going to get him out of anything. After a minute he gives it up with a long sigh, rubbing the back of his neck. \n\"It was a bad day at work,\" he admits. \n\"Yeah?\" Stiles says, encouraging. \"What happened?\" He turns to climb the stairs, heading for Derek's master bathroom. Derek follows him like a puppy.\n\"Nothing,\" he says sullenly. Didn't Stiles see — yes, there it is, a bottle of bath oil hiding behind Derek's towels. He sits down on the side of the tub and fiddles with the taps, checking the water temperature with his hand to make sure it's right.\n\"It's not nothing, or you wouldn't be mad.\" \n\"It's like they don't speak English!\" Derek explodes. The little buttons on his shirt are tricky to undo with wet hands, but Stiles manages it. He makes encouraging \"I'm listening\" noises, crouches down to get Derek's socks.\n\"Nothing I say gets through to them!\" Derek says, then takes in his surroundings for the first time. \"Are you taking a bath?\"\n\"We're taking a bath,\" says Stiles, and strips off his own shirt, steps out of his jeans. Derek is flatteringly distracted for a moment, but Stiles redirects his wandering hands. Once they're both settled in the tub, Derek leaning back against Stiles's chest, the rant picks up again.\n\"It's infuriating! I tell people what to do, and they say they get it, but then they don't do it. Then I have to reprimand them and they — cry about it,\" he finishes in defeated tones. Stiles scrubs his fingers through Derek’s hair.\n\"Someone seriously cried at you?\"\n\"Three people.\" The corners of Derek's mouth tick down, disconsolate. Stiles rubs Derek's hairy, muscled arms and laughs out loud. \n\"What delicate flowers.\"\n\"No, I shouldn't have been yelling,\" Derek says, but the corners of his mouth stop pulling down so much, which was really Stiles's goal. Stiles sweeps his palms over Derek's chest tenderly, back down his arms, repetitive and soothing, feeling the muscles let go of their tension. \nSighing, Derek allows his head and wet, spiky hair to fall back onto Stiles's shoulder, eyes closed, exposing his throat inches away from Stiles's mouth. Obviously Stiles doesn't pose much of a threat, but still: for a werewolf, it's like lying down in front of someone's car. It makes something warm expand in Stiles's stomach, hotter than the bathwater. Goosebumps rise on his arms and he shivers. This one, he thinks, and tries to erase the thought.\nHe kisses a drop of water off Derek's shoulder. \n\"We can go have some sex you really hate now, if that'll make you feel better.\"\n\"No, just — this,\" Derek says. \"If that's okay.\"\n\"Yeah,\" says Stiles, smoothing his hair back. \"That's okay.\"\n \nThe decorations for the holiday party are very professional, all Martha Stewart white and silver and evergreen. It’s perfectly empty of personality. Stiles’s idea of a party involves a lot more garish tinsel garlands, and stars listing to the side, and mistletoe pulling free of its masking tape just in time to fall in your drink and ruin your festive sweater. The closest thing to a festive sweater in this room is made out of designer cashmere.\nThe blonde from the other day — Erica? is watching him from across the room, wearing aggressive red lipstick, and when he catches her eye she elbows the fuck out of the black guy standing next to her. She isn’t subtle. Stiles likes that in a person. \nHe gives her a wave, and after a moment, she smiles toothily back. \nIt’s giving him a weird jolt of power, the way everybody at the party watches him like he’s a celebrity, or maybe a terrorist. He resolves to avoid sudden moves.\n“So, who are you?” Matt from Accounting asks, after sidling up to him and introducing himself. His tone is sly, and he smirks at Stiles like they share a secret. “I mean, coming in with Derek...”\n“Yes?” he says, mildly, turns to look at him. You little turd, he thinks. Matt stands up straighter.\n“I just meant... he doesn’t normally bring dates.”\n“Well, he’s pretty private,” Stiles says. Matt raises his eyebrows, then lowers them again at whatever he reads in Stiles’s face. \n“I think some people wondered if there was... anything to be private about,” he says. “Or if he just, like, turned off his batteries at night and powered down.”\nStiles lets his polite smile widen to bare his teeth, and says, “No.”\nMatt looks fascinated. \nStiles doesn’t hear footsteps approach, just feels a wall of radiant heat against his back, and it’s only after he’s already started to lean back against Derek that it occurs to him to look around and check who he’s leaning on.\n“Hey,” he murmurs. “You should fire that guy.” Derek looks attractively confused. \n“Who?” His hands are warm on Stiles’s hips through his dress pants. Stiles tugs Derek’s tie out from between them so he can wrap it around his hand, contemplative.\n“Do you care what any of these people think about you?”\nDerek shrugs. Bullshit, thinks Stiles. \n“Kiss me,” he says, and tugs on the tie. Derek’s gaze slides to his mouth. He tugs again. “Pretend Martha wasn’t too stuck up for mistletoe.” \nDerek says, “I never know what the hell you’re talking about,” plaintive, but kisses him anyway.\nStiles breaks the kiss after a long minute. \"Hey, let's get drunk.\"\n\"I'm at a work party,\" Derek protests. \"These are my employees.\"\nYeah, exactly, Stiles thinks. He's decided to practice wilderness philosophy on Derek: leave your campground cleaner than you found it. Carry out more trash than you carry in. \nBack when he was still living with Scott, he'd never managed to explain his view of Derek well enough to satisfy his concerns. Scott is a worrier by nature, and he thinks Derek is creepy. Derek is creepy, Stiles isn't contesting that; he just has a feeling it's something that's built up over time, not anything wrong down at his core. All he needs is maintenance work.\nIf there's one piece of that work Stiles can do for Derek Hale, it's loosen up his image.\nErica and her friend are presiding regally over the drinks table, along with Isaac, who stifles a yelp into his cup when he sees them approaching.\n\"Hi, everybody!\" Stiles says brightly. \n\"Boyd,\" says the black guy, unruffled. He extends his hand to shake. \n\"Great party, Mr. Hale,\" says Erica, who has one arm clasped across her stomach and the other holding her drink up against her face. It's not clear if she's using it to cool her cheek, or just keeping it as close as possible in case she needs it suddenly.\nStiles leans across the table and beckons her in. \"Erica, right?\" he says, in confidential tones. \"Erica, you look like a woman who knows where to get a strong drink.\"\nErica hesitates. \"What do you like?\" she says, eyes darting from him to Derek.\n\"Surprise us!\" he says. Her smile gains wattage as she reaches for something blue. It could be Windex.\nIt might have been better for his health if it were Windex. \nStiles gets pretty solidly drunk before he remembers how werewolves and alcohol work. God damn it, he thinks, chewing on the curly straw Isaac found for him somewhere. Why does he surround himself with beautiful superhumans? He blows resentful bubbles into his blue drink.\n\"I think I should take you home,\" Derek says.\n\"I think we should do karaoke,\" Stiles suggests.\n\"I think that's my ride,\" Boyd says, unconvincingly. \"Over there. I have to go.\"\n\"Don't go!\" coos Erica, who isn't drunk but isn't letting that stop her. She presses her boobs against Boyd's chest, which is a sight to behold. Fucking werewolves. Boyd stops trying to leave.\n\"I found you another straw,\" Isaac says nervously.\n\"I really only needed — okay, thanks,\" Stiles says, taking the straw and patting Isaac's hand soothingly.\n\"I think we should go home,\" Derek says again. Stiles scoffs.\n\"Dude, why so grim? It's a party!\"\n\"Not anymore,\" Erica says. Disappointed, Stiles looks around the empty room.\nDerek manhandles him to his feet and starts frogmarching him towards the door, callously kicking aside a fallen wreath like the lupine Grinch he is.\n\"We should hang out!\" Stiles calls back to Erica. \"Facebook me!\" \nDerek marches faster.\nHe actually tucks Stiles's drunk ass into bed, as if he's sick; both are foreign conditions for a werewolf, Stiles supposes. When he pulls up the bedding around Stiles's neck, he pauses for a moment with his hands still gripping the quilt, half-pinning Stiles down.\n\"Thanks for coming with me,\" he says gruffly.\n\"Hey, no problem, your coworkers are cool,\" Stiles says. Derek's hands tighten, and release again, smoothing the quilt.\n\"I don't really — know them,\" he says.\nStiles is going to say something about that, but he falls asleep before he can. \n \nThe living room couch is absurdly comfortable, and if Stiles doesn't make an effort to escape it on days that he doesn’t have class, he can wind up spending a whole day curled on the couch, morning to night. He plops onto it with his bowl of cereal and Virginia Woolf and barely stirs until it's so dark he needs to get up to turn on a light. \nHe’s actually already finished the books that were assigned for the Modernism class, but now he’s trying out some of the authors’ other work, for the sake of comparison. He has a suspicion he’s turning into That Guy at school — the guy who sits behind him groaned out loud the fifth time he put up his hand on Tuesday — but he can’t help himself. Shutting his mouth has never come easily to Stiles.\nWhen Derek comes home, he looks judgmental but still joins him, sinking into Stiles's warm lazy nest of blankets — not without effort, as always, since Derek never seems to relax without forcing himself consciously into it, controlling his breathing, willing each muscle individually into peace.\nStiles flips channels aimlessly until he finds some movie from the seventies. Surprisingly, Derek doesn't need to be convinced to watch it. His lap is a little hard for a pillow but Stiles perseveres. \n\"Do you want popcorn?\" Stiles asks.\nA kind of indeterminate grunt is Derek's only response.\n\"What's that, Lassie?\" Stiles says, obnoxious. \"Timmy's fallen down the well?\"\nInstead of another grumpy look, Stiles is surprised to be given a full-throated laugh. He grins up at Derek. It's satisfying as hell to get a real laugh from Derek, since he tends to hoard his happiness like a state secret.\n\"You've been waiting to use that one for a long time, haven't you,\" Derek says.\nThey order takeout to eat on the couch like slobs. There's an odd, tense moment when they're ordering when Stiles tries to shrug off the responsibility of choosing between types of potstickers by saying, \"You're the boss,\" which makes Derek look at the floor. But the tension is gone by the time the delivery guy arrives. Derek gets up to deal with it and Stiles leans his cheek against the warm place where he had been sitting and watches the movie.\nThe main characters are driving somewhere. They seem to be having an argument about their relationship. He hasn't really been following the plot, half-napping, but now he can't look away. It's night, a storm, and the driver takes his hands off the wheel to gesture. At the door, Derek is tipping the delivery guy. Stiles feels like he's dreaming, like he'd really fallen asleep on the couch and this is playing out behind his eyelids. \nWhen the crash comes, like he knew it would, the crunch and squeal of tortured metal feels inevitable, expected. Familiar.\nFrom very far away Derek is saying something, grabbing Stiles's hands, prying his fingernails out of his palms. The shattered glass on the screen is so much realer than the couch under his cheek. The wet asphalt. The open hand, relaxed, splattered with blood.\nThe screen flicks off.\nThe sound Derek makes when Stiles finally meets his eyes isn't quite a sob. He hauls Stiles off the couch and into his lap, surrounding him with his body, stroking his hair shakily. Stiles is actually recovering more quickly than Derek, he realizes. He presses his lips to Derek's collarbone, soothing. The Thai food is lying where it was dropped on the floor next to him, and Stiles reaches out to right a container of soup before it starts leaking.\n\"What was that?\" asks Derek at last. His voice is rough.\n\"I'm fine,\" Stiles says. He pets Derek's arms. \"Don't worry about it. Panic attack. I get them sometimes. It doesn't mean anything.\"\nDerek gives him an incredulous stare, and Stiles meets it steadily.\n\"Don't worry about it,\" he repeats.\nDerek seems to take him at his word, lets it go, but Stiles catches him looking over a few times while they're eating, when he doesn't think Stiles can see. He's getting better at subtlety, maybe. \nHe doesn’t offer to order Thai again after that, but that’s okay; Stiles didn’t like that place much anyway.\n \nErica does facebook him, a few days after the party, and asks if he wants to get a beer.\n\"Hey, Derek, is it okay if I go out Friday night?\" he yells from bed. There's only silence from the bathroom, until Derek appears in the doorway, toothbrush stuck in his frowning mouth. He removes it, swallows.\n\"What?\"\nStiles wouldn't even have asked a month ago for fear of rocking the boat, but their lives have started to fit together in a way that doesn’t feel so precarious, and he’s pretty sure by now that if Derek doesn’t want him to do this, he’ll just say no, not kick him out without warning. He figures it’s worth a shot.\n\"A friend wanted to get drinks, and if I stick to your six o’clock condition, it'll have to be daydrinking. Just this once?\" Clasping his hands in appeal, he squints hopefully at Derek.\nDerek's expression is unreadable. Stiles sighs, defeated.\n\"Look, if you don't want me to go, I won't. I know it was part of our agreement.\"\n\"Yeah,\" Derek says. \n\"Okay, I'll tell her —\"\nDerek cuts him off. \"No, I mean. You can go.\"\n\"Oh, great! Thanks dude, I'll make it up to you,\" Stiles calls at his disappearing back. Derek only grunts in response.\nStiles takes a cab to the bar Erica picked, which turns out to be kind of a dive. She's smiling prettily at him from a booth when Stiles gets there, and he slides in across from her, crumpling his coat next to him on the bench.\n\"Hey, it's great to see you,\" she says, tucking her hair behind her ear. \n\"You too!\" says Stiles. \"Did you want to order a beer or something?\"\n\"Sure,\" she says, and waves to the bartender. \nStiles looks around, taking in the ambiance. There isn’t much to speak of. The beat-up floor is covered in suspicious stains, and the green-shaded lights are strategically dim. At a shadowy table by the door, a large man in an overcoat and a fedora is — reading a newspaper? Oh, for God’s sake. \n\"Derek?\" he calls. The overcoated shoulders jerk guiltily. He’s honestly amazed the newspaper isn’t upside-down. This is a new low. If Stiles can’t manage to socialize Derek better, someday he’ll pull this kind of thing with someone he’s actually dating, and then he’s going to get dumped hard and deserve it. \"Everyone sees you, stop pretending you’re invisible.\"\nDerek gives it up as a bad job and gets up, slinking out of the shadows. \"I just thought I'd —\" He glances around the bar and can’t seem to come up with a plausible explanation for being here. He frowns. \"This is a really crappy bar, Stiles.\" \nThe bartender, affronted, inhales sharply.\n\"Go home, Derek,\" Stiles says patiently. \"I will be back later. Read a book.\" Stymied, Derek transfers his gaze to Erica, who squeaks and shrinks back in the bench. \"Stop terrorizing your employee. Go home.\"\n\"I'll wait up for you,\" Derek says, and hulks his way back into the shadows, glancing over his shoulder a few times as he goes. The door closes behind him with a bang.\nWhen he turns back to Erica, she's ducked behind her hair, chewing on her lip. \n\"Dude, don't worry, I'll talk to him,\" he says reassuringly. \"You aren't going to get fired for being friends with me.\"\n\"I'm not worried about my job,\" Erica says, staring at him. \"Stiles, he followed you here.\"\n\"I know, right? Dude needs to get over his separation anxiety.”\nShe reaches out like she's going to touch his hand, and apparently thinks better of it. \"You know you deserve better than that, right?\" she says. “You can call me any time, day or night.”\nStiles laughs into his beer. \"What, Derek? Seriously, don’t even worry about it.\"\nErica looks judgmental.\n\"I think I would find it more threatening if he could actually be stealthy about it,\" Stiles says, trying to find a way to explain himself without mentioning that they aren’t actually dating. \"It's just that he's so blatant. It's like being stalked by the Rock.\"\n\"The Rock would never stalk anyone,\" Erica objects. \"The Rock is really nice.\"\n\"Exactly!\" says Stiles, but she doesn't seem to follow his logic. \n\"I love Derek like a brother, but —\"\nStiles interrupts her. \"Dude, you were terrified of him before the Christmas party, don't even try.\"\n\"Don't belittle our bond,\" says Erica, taking a big gulp of her beer. \"Derek smiled at me yesterday!\"\n\"It was probably gas,\" Stiles says crushingly. \"Hey, did you know the Rock is Samoan royalty?\"\n\"Why do you know that?\"\n\"Why does anyone know anything?\" he says. \"Wikipedia, duh.\"\n\"Don't try to distract me,\" she says, pointing an accusatory finger at his face. \"That is very interesting information about the Rock, but we were talking about Derek.\" \nStiles rubs his forehead, sighing. \"Look, I'm not saying it's okay behavior,\" he says. \"It's — a problem, but he’s getting better about it, and he backs off fast when I tell him to. He just doesn’t know how to — he doesn't have bad intentions. I know you guys are all scared of him, but his bark is worse than his bite.\"\n\"It's more than that. He's the al — he's our boss,\" she says, and then looks panicked. Stiles takes pity on her.\n\"He's the alpha, I know.\"\n\"Oh thank God,\" she breathes. \"I thought I was going to have to break the whole werewolf thing to you.\"\n\"Nah, old news. Which also helps explain the whole Derek thing, you know? Dude was literally raised by wolves.\"\n\"Yeah, I guess,\" says Erica dubiously. \n\"Anyway, you should be extra glad I know about werewolves, because that means I brought wolfsbane,\" he says, brandishing a little glass bottle. \"The fun kind.\"\nErica looks surprised. \"How did you know I was a werewolf?\"\n\"I'm dating one, you think I don't know how to spot 'em? This is not going to be the Christmas party redux, my friend. We are getting you drunk.\"\n\"I could be on board with that,\" Erica says. \n\"Good,\" Stiles says firmly, and orders them another pitcher of beer.\nThree hours later, the bartender is looking at them like he might cut them off, and they’ve somehow wound up back on the topic of Derek.\n\"We're not that serious, really.\" Stiles pushes his thumb through the ring of condensation his glass left on the table, smearing it into rays. \"I don't — I know he's intense about it right now, but he's — it's just because it's his first relationship. He’s learning. The next person he dates, he’ll be, you know, less —\" His gesture is all-encompassing.\nErica regards him blearily. \"Stiles, if he tells you he didn't already buy a ring, he's lying.\"\nThey both fall on the table laughing about that, although probably for different reasons. Stiles knocks over his glass and has to ask for another one. \nThe bartender's reaction is insulting in the extreme. Stiles and Erica decide to stay and split another pitcher, just to show him. \n\"Take that!\" Stiles yells as they leave the bar, leaning on each other out of companionship and mutual affection, and definitely not because they can't walk straight. They hail a cab, but it's not easy to remember Derek's address when he's this drunk.\n\"It's definitely somewhere fancy, with like, an R. Or an E.\"\n\"Take your time,\" says the cab driver. \n\"You are a very supportive man,\" Stiles tells him.\n\"Don't puke,\" he says.\nStiles and Erica agree to this reasonable condition.\nDerek meets them down in the lobby of the building, probably because he was watching from the window like a creep. How is Stiles expected to get the trash out of Derek's social wilderness if he keeps scattering more? \n\"You always undermine my good work,\" he tells Derek mournfully, then pretends to stagger so that he can snuggle into Derek's side. Well, mostly pretends. Sort of pretends.\n\"Thanks for bringing him home,\" Derek tells Erica, which Stiles feels is severely overstating the case. Derek should go thank the cab driver.\n\"Thanks!\" Stiles yells at the cab, but the driver has the window rolled up and is ignoring everybody.\n“Stiles, where’s your coat?” asks Derek.\nErica drunkenly pats Derek on the cheek and says, \"Don't stalk people, Mr. Hale.\"\n\"Call me Derek,\" he says shortly, then reconsiders. \"Uh, not at work.\"\n\"I'm going to go home, Stiles,\" Erica tells him in what she appears to believe is a whisper. \"Remember you deserve better.\"\nDerek glares at her, outraged. His arm around Stiles tightens into a death grip.\n\"No, this is nice,\" Stiles says breathlessly. \nErica raises her eyebrows and weaves back to the cab without further comment.\nStiles rests his head against Derek's shoulder in the elevator on the way up and peers up at his clenched, stubbly jaw. \n\"What's your deal with Erica?\" he asks, after Derek has closed the apartment door. Derek shepherds Stiles up the stairs and into bed and starts untying his shoes for him. Stiles flops back and stares at the spinning ceiling.\n\"I don't — I just wish you wouldn't —\" Derek says haltingly, not looking up from his task. \"Why were you out with her?\"\n\"Because I like her,\" says Stiles. \"We're friends.”\nFor some reason Derek deflates at that, hands stilling on his shoelaces. \"So it wasn't — you weren't on a date?\"\nStiles props himself up on his elbows to stare at Derek. \"Yes,\" he says. \"I went on a date with your employee while living with you. I thought that would end well.\"\n\"She's a werewolf,\" Derek bursts out, like he's been holding it back all night.\nStiles raises his eyebrows. \"Yeah,\" he says slowly. \"Why does everyone think I don't know that?\"\nDerek looks stunned. \"You knew?\" \n\"I’m a hooker who specialized in werewolves, dude. You think I didn't pick up a few clues about how you guys work? You kind of —\" he demonstrates \"— flex your hands when you're upset, like you're thinking about having claws. Plus you sniff people more than normal.\"\n\"She was scenting you?\" Derek says.\n\"I mean, not like, more than average. But if you were hoping to keep it a secret that we're fucking, then I'd say the cat's probably out of the bag.\"\nDerek looks weirdly pleased.\n“She likes you,” Stiles adds. “You should add her to your pack, her and whatshisname and nervous guy.”\n“I don’t have a pack,” Derek says tersely.\n“You could,” Stiles says. “Just saying. Come to bed, it’s spinny.”\n \n\"You can have your friends over here,\" Derek offers out of the blue, once Stiles's hangover finally subsides enough for him to crack the blackout curtains and make a heroic journey to the living room couch.\nStiles squints at him pathetically. \"It's your house.\"\n\"You live here too,\" Derek says. Which is not exactly the same thing. \n\"Well, it's not like I have some huge social circle I abandoned. It's pretty much just Scott.\"\n\"So have just Scott over for dinner,\" Derek retorts, like it's obvious.\nStiles isn't sure why he's fighting this, but says, \"I can't cook.\"\nDerek's face closes off. \"I was — but of course you want to have him over without — I'll go out for the night,\" he says, and tries to get up from the couch like he’s going to get his coat right now. \n\"Wait, were you offering to cook for us?\" Stiles says, tangling his legs with Derek's so he's forced to sit down or fall over. \"Because if you were, that would obviously be amazing.\"\n\"If you want me to,\" Derek says cautiously.\n\"Of course I do,\" Stiles says. It’s either going to prove to Scott how good a deal Stiles is getting, or make him even more convinced Stiles is going to get his heart broken. Or both, because Scott isn’t dumb. But Stiles is living in the now, so to hell with Scott and his conclusions.\nScott accepts the invitation and asks if he can bring a plus one. So does Erica, when Stiles calls her up. Their responses are actually eerily similar, and both use the phrase “this I’ve got to see,” which Stiles chooses to keep to himself. \nOn the day of the dinner, Derek kicks Stiles out of the kitchen and makes enough food to comfortably feed forty or fifty people. \n“Werewolves eat a lot,” Derek says defensively. The size of the serving bowls on the counter is actually alarming. “I didn’t know how much to make.”\n“Do you think maybe we should freeze some of this before they arrive?” Stiles asks, regarding the beef tenderloin with awe. \n“There’s more in the fridge,” Derek mumbles. Dear God.\nThe doorbell rings.\nIt's Scott and his new girlfriend, who he hasn't been able to shut up about. She's lovely, carrying a bottle of wine in a pretty gift bag that Stiles knows wasn't Scott's idea.\n\"Hi, come in,\" he says, smiling at her and ignoring Scott's glower.\n\"Allison,\" she says, flashing adorable dimples. \"So nice to finally meet you.\"\nErica and Boyd arrive while Allison is still taking off her coat. \n\"Hey, everybody,\" Stiles says. \"We don't really have snacks or anything, so you should come right to the table when you've got your coats off.\"\n\"Were we supposed to have snacks?\" Derek hisses in his ear. Boyd coughs and Erica lifts her hand to her mouth like she's hiding a smile.\n\"It's perfect, relax,\" Stiles tells him. And it is, everybody sitting down together around a groaning table of food. This was a good idea, he thinks. \n\"Hi, I'm Erica Reyes,\" Erica says to Allison. \"I didn't catch your name.\"\n\"Allison Argent,\" she says brightly. Boyd introduces himself next, producing his rare but charming smile, and shakes her hand. Even Scott looks like he's beginning to unthaw.\n\"The food looks great,\" Stiles says to Derek.\nDerek isn't listening. \"I'm sorry, what did you say your last name was?\" he says, suddenly tense as a coiled spring.\n\"Argent, Allison Argent,\" she repeats, smiling.\nDerek shoves back his chair without a word and walks out of the room. Her smile drops.\n\"Uh,\" says Stiles.\n\"What the hell,\" says Scott. Stiles winces.\n\"He's probably getting the, uh, I should probably — one minute,\" he says and follows Derek into the kitchen. Derek is gripping the counter with both hands, head bowed, breathing hard.\n\"Dude, are you okay?\"\n\"You didn't tell me who Scott was bringing,\" Derek tells the countertop.\n\"I didn't know her name,\" he says cautiously, coming up beside Derek, touching his hip. \"I didn't know there was a name I should avoid.\"\n\"It's okay,\" Derek says. It clearly isn't.\n\"I could tell them you don't feel well,\" Stiles says gently. \"We could do this another time, maybe with fewer people.\"\n\"It's fine,\" Derek says, and moves his arm to tug Stiles into the space between him and the counter. His eyes are closed and he rests his head for a moment on Stiles's shoulder, takes a deep breath, lets out some of his tension. After a moment he lifts his head. \"I just wasn't expecting it. Go back out, I'll be there in a minute.\"\nStiles removes his hand from the back of Derek's neck, where it had alighted without his permission. \"Okay,\" he says.\nScott looks less furious than Stiles expected when he sits back down. He has a feeling someone at the table said something to Scott, but he has no idea what, and they all look as innocent as lambs. \nDerek re-emerges a moment later, carrying a basket of rolls. \n\"I forgot these,\" he says gruffly, and sits back down. Under the table, Stiles lets their knees touch.\nThe rest of dinner goes more smoothly, thankfully. Derek looks cautiously pleased at the dent everyone manages to make in his food mountains, and no one loses it about anybody else’s name all the way through dessert.\nAfter the table is cleared, Stiles sees Scott and Allison to the door. He tugs on Scott's sleeve before he can follow her down the hall. Stiles looks back over his shoulder, but Derek's in the kitchen with the sink and the dishwasher running, and he thinks they're safe even from werewolf hearing. \n“That was weird, right?” Stiles whispers. “The thing with Allison?” Scott frowns.\n\"Her family used to hunt werewolves, until her mom got turned. Maybe Derek knew them back then,\" Scott whispers back, glancing over Stiles's shoulder into the apartment. \"You should ask him about it.\" Stiles nods, absorbing this.\n\"So, what did you think of him?\" He could never resist picking at a scab. \"Going to warn me off again?\" But Scott looks surprisingly ambivalent.\n\"It wasn't — like I expected,\" he says. Stiles blinks.\n\"Wait, what?\"\n\"I still don't like him,\" Scott says sullenly.\n\"But you weren't wrong,\" Stiles protests, under his breath, too surprised not to admit it. \"It is going to end badly for me.\"\nScott shrugs one shoulder, backing away. \"Maybe,\" is all he says.\nMaybe? He wants to ask Scott to explain, but he's halfway down the hall, and Derek is going to hear them if Stiles talks any louder. Maybe, he thinks, closing the door and leaning on it. Maybe?\nHe does ask Derek about the Allison thing, a little later, as they’re brushing their teeth. Derek grips both sides of the sink and stares down into the drain, sighs.\n\"There's — bad blood, between my family and hers,\" he says. \"It was a long time ago.\" It doesn’t sound like water under the bridge to Stiles.\n\"You can't pick your family,\" Stiles offers, tentative. \"She seemed nice.\" \nDerek sighs heavily. \"I don't know,\" he says. \"She didn't smell like — she wasn't involved, as far as I know, but if she's dating Scott —\" He looks over at Stiles, eyes dark. \"Warn him,\" he says, voice low. \"They're hunters.\"\n\"He knows,\" says Stiles, touching Derek’s hip. “He told me.” \n\"Okay,\" Derek says, closing his eyes. \"I won't — make it a problem. Unless she does.\"\n\"All right,\" Stiles says, letting it go, and comes up behind Derek, wraps his arms around his waist. Derek doesn't lean into it, but he doesn't push him away, either.\n \nThe leftovers are so intimidating that the next day Stiles impulsively packs some up to bring to Derek for lunch. At the office, he literally runs into Isaac, who looks like he’s just seen a ghost. He apologizes for bumping into Stiles like he’s apologizing for murder. \n“Seriously, don’t worry about it,” Stiles says, as Derek appears in the doorway of his office. Isaac flees.\nStiles watches him go thoughtfully before closing Derek’s heavy office door.\n\"There's something off with that guy,\" he tells Derek, narrowing his eyes. \n\"Who, Isaac?\" Derek asks, surprised.\n\"Yeah. He's too nervous.\"\nDerek shrugs. \"A lot of people are nervous around me. I'm their boss.\"\n\"Not like that, though,\" Stiles says. \"He flinched when he saw you, did you see? Erica says she thinks there's something wrong at home.\"\n\"He smells off sometimes, in the morning,\" Derek says, reluctant, giving Stiles a sidelong look. \"And when he's about to leave.\" \n\"Boyd told Erica that he lives with his dad and doesn't talk about it much,\" Stiles says. He chews on his thumbnail, gives Derek a pleading, squinting look. \"I think — Derek, I really think we need to figure out what's going on. What if there's something really wrong and we didn't do anything about it?\"\n\"It's not appropriate. I'm his boss,\" Derek says, without much conviction. Stiles raises his eyebrows. Derek is also Stiles’s boss.\n\"Oh, now we care about appropriate?\" \nWhich is how they end up on stake-out outside Isaac's house that night after work, in the Lexus, because it's at least less conspicuous than the Camaro. Derek's keeping a werewolf ear out for suspicious noises, which leaves Stiles without anything to do. The silence is only bearable for about five minutes before he has to make conversation or go crazy. \n\"Why do you run this company anyway? You don't seem to like it.\" He props his feet up on the dashboard, then takes them back down at Derek's glare.\n\"It was my family's company. They died.\" Derek clears his throat. \"My — there was a fire.\"\nThere's a long silence, Stiles fiddling with the empty coffee cup in his lap.\n\"My mom,\" Stiles says softly. \"When I was ten. She had lung cancer, she smoked. It only took two months after her diagnosis, before. I think — the doctors said she must have known for a while, just not told anybody. She only came into the hospital after it was already — and she didn't accept any treatment, just painkillers.\n“She said she wanted to die on her own terms. I hated her for that, for a while. We took her home. My dad used to carry her downstairs every morning after she stopped being able to walk.\" He swallows. \"My dad —\"\nThere's a pause. Derek turns his head towards him, but doesn't make eye contact.\n\"I know what it's like,\" says Stiles finally.\nDerek looks like he's working out something to say, but they're interrupted by noises from Isaac's house that even Stiles can hear: shattering glass and raised voices. Derek is out of the car in seconds, not bothering to close the door behind him, and Stiles has his cell phone out before Derek has crossed the street. \n\"Hi, I'd like to call in a domestic disturbance,\" he tells the 911 operator.\n“You piece of shit!” Derek bellows from inside Isaac’s house. \n“You should hurry,” Stiles says into the phone.\nDerek reappears hauling an older guy with glasses by the collar of his shirt. After them comes Isaac, looking freaked out, with a bleeding gash above his eye. Stiles is out of the car and moving before he makes a conscious choice, because he sees where this is going, and where it’s going is jail time for Derek.\nHe successfully prevents Derek from killing Isaac’s dad before the ambulance and police cars pull up, and then everything is chaos for a while.\nWhen things start to calm down, Stiles sits on the back of the ambulance next to Isaac, who is shivering a little in his shock blanket. \n\"Derek's going to offer to pay for you to move out,\" Stiles says, glancing at him sideways. Isaac almost drops the blanket.\n\"He said that?\" he says, shellshocked. He’s got a huge white bandage across his eyebrow, and it’s making him look preternaturally surprised. Stiles shrugs one shoulder.\n\"No, but he will. You can take him up on it if you want, he’ll be serious about it. But on the other hand,\" he says, taking in Isaac's conflicted expression, \"my best friend is looking for a roommate. The place isn't much, but it's cheap.\" Stiles is not going to think about where he's living after this ends. Isaac needs it more than he does right now.\nIsaac doesn't speak for a minute, and when he does, he has to clear his throat twice. \n\"Your friend?\" he asks.\n\"Give me your phone,\" Stiles says. He types in Scott's name and number, tosses it back to him. \"Call him, he'll be thrilled. Doesn't like living alone.\"\n\"Thanks,\" Isaac says, staring down at his phone. \nThey sit in silence for a while, until the police have finished questioning Derek.\n\"Isaac!\" Derek says, once he's finally told he can go. \"You have to move out. I have a place I'm not using over on —\"\n\"No,\" Isaac breaks in, unexpectedly assertive. He smiles shakily at Derek's nonplussed expression. \"I've got somewhere. Thank you for the offer.\" \n\"Then there's something else,\" Derek says, regrouping. He looks over at Stiles, and Stiles takes the hint and slides off the back of the ambulance to go take a walk or something, and not think about how he’s tangling his life up in Derek’s even more, how Isaac’s going to be hanging around Scott’s apartment as a constant reminder after this is over, how hard it’s becoming to imagine this being over at all. Life after Derek. \nWhen Derek finally joins him in the car, he's looking a little shellshocked himself.\n\"Isaac doing okay?\" Stiles asks.\n\"I asked him to be in my pack,\" Derek says slowly. Stiles sits bolt upright, the pleasure of watching Derek make progress instantly wiping away his melancholy.\n\"Dude, that's great! That's fantastic,\" he says, smacks Derek's arm with the back of his hand delightedly. \"You have a pack!\" \n\"I have a pack,\" says Derek, disbelief coloring his voice.\n“Erica’s going to be so mad if you don’t invite her next,” Stiles says. Derek glares at him.\n“This is your fault,” he says accusingly, and accurately.\n“And don’t you forget it,” says Stiles. \n \nA few days later, Stiles asks Derek if he can borrow the Lexus while Derek's at work. He’s done it before, so he tries not to sound nervous about asking now.\n\"I'll be back by dinner,\" he says.\n\"Sure,\" Derek says. \"Don't crash it.\"\nStiles maintains his smile. \"Have a nice day at work.\"\nComing out of the hospital is always a guilty, awful relief. The air is fresh and the sky feels huge and empty, like the world got bigger while he was in there. He parked a good distance from the hospital door, and he takes his time getting there, detours off the sidewalk to walk on the grassy verge, skims his fingers over a narrow tree trunk just to feel the texture of the bark.\nHe's almost to the car when his heart suddenly rises into his mouth, because that's Derek leaning against it.\nIt's not like this kind of thing is anything new, coming from Derek, but for the first time he’s furious about it, anger burning hotter with every step he takes towards the car. Derek stands upright when he sees him, opens his mouth, but Stiles cuts him off before he can talk. \n\"Are you fucking kidding me?\" His hands are shaking, he notices, although they seem very far away. \"Did you follow me here?\"\n\"I —\" \n\"Did you follow me here,\" he repeats too loudly, not asking anymore. Derek is talking fast, getting into his personal space, probably trying to bullshit his way out of it if Stiles could hear him past the ringing in his ears. \n“You think you can just treat me like you own me,” Stiles says. Derek’s face is stricken and pale and Stiles doesn’t care. “You don’t know a fucking thing about me.”\nHe isn't going to be the guy who hits somebody he — but he needs to hit something. He slams his fist into the windshield and elbows Derek in the gut when he tries to catch Stiles’s arm. He has to get the fuck out of here.\nStiles turns around and gets in the driver’s seat, but Derek pushes the bulk of his body between the car and the open door before he can slam it shut. There's a middle-aged woman rubbernecking at them from across the road, clutching her bag with both hands.\nGripping the steering wheel like an anchor, Stiles slumps forward. He rolls his forehead against the backs of his hands, doesn't look up. His throat feels scratchy and swollen.\n“I didn’t, Stiles, I didn’t follow you,” Derek is saying, frantic. \n\"How long have you been here?\" Stiles asks quietly.\nHe can see out of the corner of his eye that Derek's arm is still tensed, knuckles white on the doorframe, like he thinks he's going to hold back the car with his bare hands if Stiles tries to drive away. \"I just — I just got here, I was on my way home —” and this is on Derek’s way home, Stiles realizes dully. He should have remembered. “I saw the Lexus and I thought, I didn't — \"\n\"You never do that again,\" Stiles says, giving every word weight. Derek makes some kind of sound in his throat that isn't language, and Stiles rolls his head to the side, finally, looks up at Derek. \"You don't do that again.\"\nDerek swallows hard. \"Okay,\" he says, hoarse, like he was the one screaming. Stiles turns his face back into his arms, hunches his shoulders hard and then relaxes each muscle deliberately.\n\"Take the Camaro,\" Stiles says. \"I'll see you at home.\" When Derek doesn’t move for a minute, he shoves him, lightly this time. “Go,” he says.\nThe door to the apartment still has the scuff mark on it from Stiles’s shoe. He wonders if Derek’s noticed yet. \nDerek is sitting on the couch, but the tv isn’t on, and he stands up too quickly when Stiles comes in. It’s clear from his expression — before he visibly pulls up his poker face — that he wasn’t sure Stiles was coming back at all. Stiles blows right past Derek without making eye contact and heads for the stairs. \n“Let’s fuck,” he says over his shoulder. \"Do you want me to rim you? A lot of clients like that.\" \nUnbelievably, Derek actually says, \"Only if you — I only want to do what you want to do.\" His expression is earnest. How can anybody lay themselves out there like that, raw and open, and be surprised when they get hurt?\n\"Well, you've got that exactly the wrong way around, don't you,\" says Stiles.\nHe takes in Derek’s tense hands, and blows out a sharp breath, because he hasn’t got the patience tonight to coax Derek through articulating what he wants, like any normal client would, like no one else on the planet has a problem with. It’s infuriatingly clear in Derek’s face that he’s serious, that he’d rather please Stiles than himself, and Stiles doesn’t feel like letting him.\nIn the end they just fuck, because Derek certainly loves that and Stiles knows it. He gets on all fours and lets Derek fuck him so hard the mattress squeaks under their knees, and the headboard starts to bang the wall like a filthy cartoon. It's over faster than usual, Derek shuddering against his back like he's been shot. \nHe crawls closer to Derek after he's pulled out and collapsed on the bed, lies half on top of him, still hard. Stiles hasn't come yet, but he can wait.\n\"You can get hard again, can't you?\" he asks, tugging mercilessly on Derek's cock, which is red, oversensitive. Derek yelps, and Stiles rubs the pad of his thumb right under the head. In his hand, Derek's cock is fattening up again without ever having really gone soft. It looks like it hurts.\nBehind him Derek's fingers are fumbling at his ass where the come is starting to trickle out, feeling at his fucked-open hole.\n\"That's disgusting,\" Stiles tells him. \nDerek flinches when Stiles starts jerking him off, abs tightening in a way that could either be trying to fuck further into Stiles’s fist or curling up in pain. He doesn't try to take control, though, doesn't even put his hands anywhere near Stiles. His fingers curl reflexively in the sheets. Claws, Stiles thinks.\nThis round, Stiles takes it slow, sets whatever pace he feels like. Whenever Derek starts breathing like he's going to come, Stiles stops, holding his fist motionless until he calms down. The fourth time he takes his hand off completely, ignoring Derek's sob.\nStiles rests his cheek on those beautiful abs to watch himself touch Derek's cock for long, easy minutes. He pets it, letting three fingers glide over the slippery skin carefully, delicately. It's soothing, like stroking a small animal or playing with some stress-relief toy. He can feel the tension draining from his shoulders.\nDerek, on the other hand, doesn't seem soothed. His leg muscles are twitching like he's being electrically shocked.\nWhen Stiles finally straddles Derek, he just sits on his cock, barely bothers moving at all. He rocks back and forth a little, enjoying the thickness. Once he's found the right angle, he bounces in tiny movements, uses Derek's cock like a sex toy to rub precise circles inside him, careless of Derek’s pleasure. Derek's eyes are closed, eyelashes wet against his cheeks. It occurs to Stiles that this is probably the most beautiful person he will ever fuck.\nHis orgasm clenches his whole body like a vise. At some point the contractions must bring Derek off like an afterthought, yank his come right out of him whether he's ready to give it or not. Stiles doesn't notice when it happens.\nStiles slides off and flops on the bed next to Derek, not touching him. He should probably go get a washcloth. How Derek manages to store up that much come, he will never understand.\nOn the other side of the bed, Derek is holding himself rigidly still. The orgasm has finally drained the last of Stiles's anger, and he thinks he's made his point anyway, so he relents, tucks himself into the bubble of space Derek is so strictly maintaining, slides his body up against Derek's warm side. \nThere's a pause before Derek's hand comes up to touch the back of his neck so gently that it makes something tighten in Stiles's throat. \n\"Good night,\" Derek says. \nWaking up together in the morning is awkward, weirdly. It's never been awkward before, not even that first day when Stiles wasn’t sure if he was staying or going. The most uncomfortable part is the way Derek seems to be walking on eggshells, apologizing for things like leaving a dirty dish in the sink, like this isn't his house, and like Stiles even cares. \nStiles is inclined to ignore this behavior until it goes away, but he finally breaks when Derek asks politely for him to please pass the salt, instead of sticking out his hand silently and waiting for Stiles to read his mind. \n\"Look, I'm not mad anymore,\" Stiles says, poking at his omelet. \"I just don't want you to do it again.\"\nDerek looks at him for a long time, pensive, like he wants to say something, and Stiles stares him down in return. Whatever it is, Stiles doesn't want to hear it.\nEventually Derek nods, says, \"Okay.\" \nAfter they rinse their plates and load the dishwasher, Derek asks, \"Do you want to go for a walk?\" and Stiles says sure, why not, and they do, just around the neighborhood. It's a great city neighborhood, where Derek lives: the rich lawyer types diluted with enough regular people, a dozen interesting restaurants, local grocery stores with fruit in the window. By the end of the walk they're almost back to talking to each other without hesitating. \nThey finally start bickering like their normal selves once the conversation winds around to the newly minted pack. Derek seems to feel that having asked Isaac, Erica, and Boyd to join him means his work here is done. \n\"Dude, you can't just decree that people are in your wolfy family now and have it be true,\" Stiles says, exasperated. Derek scowls.\n\"What else is there to do?\"\nStiles throws up his hands in frustration. \"A barbeque! A poker game! Macramé! It doesn't matter what you do, you just have to do something.\"\n\"Macramé,\" says Derek, drawing out the word to coat it with maximal sarcasm. \nStiles scrubs his hands over his face and groans, amazed yet again at Derek’s ability to swing and miss at basic rules of human interaction, like not following people to bars uninvited, and asking people to do things instead of ordering them, and actually showing people you want them around instead of assuming they already know.\n\"Pack bonding, man. It needs to happen. Maybe you can cook for them again, or just — a movie night with take-out? A shopping trip?” he says. “Something that lets them know you want them in your life.”\nDerek gives him an unreadable look, but he doesn't disagree.\nOf course it ends up being Stiles who makes the actual plans. He finds one of those places where you paint a piece of pottery and they fire it for you, whose website — crucially — says it's BYOB. Glazed Expressions takes reservations.\n\"Have fun!\" he says, handing Derek a handle of whiskey and a vial of party wolfsbane. Derek stares at him, down at the whiskey, back up.\n\"You're coming,\" he says, not a question. Stiles fidgets.\n\"You want me to? I just figured — it's for pack,\" he says hesitantly. \"I'm not pack.\"\nA whole complicated series of emotions flickers across Derek's face. He opens his mouth, seems to reconsider, closes it again.\nFinally he just says, \"Get in the elevator.\"\nStiles gets.\nThere are a few tense moments: no one bringing any mixers or cups; Derek calling Erica's painted flowers \"amoebas\"; Isaac knocking over a vase and almost going to pieces himself. But they get through it. Boyd turns out to be an invaluable element in the group dynamic for his simple refusal to react to any of this. He also sasses Derek a lot, which is fun.\n\"This was… nice,\" says Derek, doubtfully, as they're hailing a cab.\n\"Duh,\" Stiles says. Everyone needs to learn to accept that Stiles's ideas are the best ideas. He has excellent judgement. Most of the time, he amends, watching Derek's frowning face. At least he usually fucks up with eyes wide open.\n \nIt was only ever a matter of time before Stiles ran into a former client, but that doesn’t mean he’s prepared for it when it happens. Oh shit, Stiles thinks, shit, shit, shit. He was waiting for Derek to finish a meeting. This is Derek's workplace. \nThe guy — Brian, he remembers — is huge, easily 6'5\", and absolutely covered in muscles; not that it's much of an achievement when you have all that werewolf mojo going for you. He's an alpha, like Derek. He'd actually been one of Stiles's favorite clients, which makes this somehow worse. They'd only fucked a few times, but it had been — memorable.\nA slow smile curls across Brian's face. \"Fancy seeing you here,\" he says. \"Are you… working?\"\n\"Uh,\" Stiles says. There isn't anyone in sight, the hallway empty, but someone could come along any minute.\nSex with Brian had always been rough, intense: wild fucking over a desk or on the rug that skirted the delicious edge of painful. He used to like to spank Stiles before fucking his ass, pulling out to come on the stinging red handprints he’d left. It was the kind of thing that had made Stiles’s job fun. \nIn Derek’s office, Brian is getting further and further into his personal space and Stiles, cornered by the filing cabinet next to him, has no way to sidle away. He feels like something small and furry, pinned under a predator's paw. \n\"When do you get off?\" Brian murmurs, smirking at his own double entendre. \"It's been a while. Too long. We should…\" His broad hand closes around Stiles's wrist, pins it next to Stiles's head, firm as a shackle. How the hell am I going to get out of this without making a scene, Stiles thinks.\nThen he sees him behind Brian's arm, looming like certain death.\n\"Stiles,\" Derek says, voice cold as ice. Not rushing it, Brian drops Stiles's wrist and steps back. He looks away from Stiles’s mouth only after Derek makes a furious sound in his throat.\n\"Are you ready to go? I'm ready, sorry Brian, nice to see you again!\" Stiles babbles.\n\"Another time,\" Brian says to Stiles, smooth as butter. \"Derek, we'll talk business again soon.\"\nDerek sweeps him out the front door like a hurricane.\n\"So, you know Brian?\" Stiles asks, weakly, in the elevator. A muscle ticks in Derek's jaw. \nDerek bursts out, \"Was it better with him?\"\n\"What?\" Stiles says, confused. The elevator doors open, but Stiles puts his arm across them before Derek can step out, and after a moment they slide closed again.\n\"Was it better,\" Derek repeats. His voice is raw. \"I saw. With — I know you don't. I know you like it — rough.\" \n\"You think I —\" Stiles shakes his head, suddenly desperate for him to understand. \"Jesus, no. It's never better than it is with you.\"\nDerek laughs sharply. \"I know that isn't true.\"\n\"It is true. It is — no one makes me feel like you do. No one. Comparing him to you is like,\" he can't think of a metaphor, has no idea how to convey that sex with Derek exists in an alternate universe from any of the sex Stiles ever had before, that Brian is no more competition for Derek than a porn DVD. \nThe thing is that Stiles really does think rough sex is great; he always has. He likes how it feels and he gets off on it, and its appeal survived even when he was sleeping with guys he didn't much like. It's only with Derek that he's started to want these other things, too: the soft touch, the slow kiss, the raw, overwhelmed look on Derek's face. \nEven if Derek never does figure out how to be rough and have fun with it, giving that up doesn’t feel like a sacrifice when Stiles gets all this in exchange. He doesn’t know how to make Derek understand that.\n\"Everything is better with you,\" Stiles says, spreading his hands helplessly. \"Not just the sex or the, the money. You make me feel so good. I feel good, being with you.\"\nThe elevator door opens again and a balding man takes a half-step back, surprised, asks, \"Sorry, are you —\"\n\"We're good,\" Derek says.\nThe walk to the car is quiet, but not tense. Warm fingers steal around Stiles's wrist as they walk, covering the place where Brian touched him.\nBefore they get in the car, Derek says, quietly, \"You make me feel good too.\"\nIt’s nothing Stiles didn’t already know. Somehow, it still makes him warm all over to hear Derek say it.\n \nHe was serious about liking more than just what Derek does for him in bed, but the sex itself is actually insanely good. He knew he got off on spanking, but he didn't know he got off on sex with someone who's more than half asleep, barely able to keep his eyes open. There’s a long list of things with Derek that shouldn't be as good as they somehow are, like uncoordinated lazy handjobs on a Sunday morning, and cuddling when they both need a shower, and Derek's idea of dirty talk, which is, to an unbiased observer, awful. He comes out with things like:\n\"I want to put a baby in you,\" which sounds more like a threat than like dirty talk. It takes a moment for Stiles to process that one. When he does, it's like a record scratching. He pulls back as far as Derek will let him go, which is about four inches. Derek stops moving inside him.\n\"Wait, what the fuck?\" Stiles says. \"What the serious fuck. You mean that like, metaphorically, right? Please say yes.\"\nHe's starting to regret all the times he's said 'what the fuck' casually, because by now the phrase has lost some of its impact, leaving him without a way to express his feelings when a situation truly, profoundly, meaningfully begs the question. It's what his fifth grade homeroom teacher told him about cursing, and he offers her a silent apology for not listening. \nDerek's scowl shades into discomfiture. \"No,\" he says. \"I mean, uh, literally. It's not — my instincts aren't that nuanced. I want you swollen with my baby.\"\n\"I don't know how to tell you this —\"\n\"I know, Stiles, shut the hell up,\" Derek snaps. \"I'm not saying it makes sense. I'm saying that's what I want.\"\n\"Hey, I don't know if you should be talking to your baby mama like — okay, okay, calm down.\"\n\"Do you want me to keep fucking you or not?\" Derek says, still looking murderous. Stiles rolls his hips a little to watch Derek's expression flicker, then does it again just for himself, catching his breath at the slide.\n\"Or I could just fuck myself,\" Stiles suggests, already doing it. He tries to brace his feet on the bed but it messes up the angle. On an abruptly cresting wave of frustration, he scoots himself up the bed and off Derek's dick so he can turn onto his knees, fumbling behind him to guide Derek back inside.\nOh, that's so much better, he thinks, fucking himself onto him with short, quick movements. Derek is making little lost irrelevant noises somewhere in the distance. His cock is like an iron bar.\n\"You want to knock me up?\" Stiles asks, pushing back again and again, thighs burning with effort. \"You want me to have your baby?\"\n\"Yeah,\" Derek admits. \n\"So give it to me, give it to me, come inside me, knot me, get me pregnant —\" Stiles says until Derek finally does with a yelp, swelling inside him and coming in long spasms, over and over again. Stiles fists his cock desperately and after a minute he's coming like crazy around Derek's knot. Afterwards he feels wrung out and empty from it.\nSo Derek's weird dirty talk kind of works for Stiles, for some reason. That doesn't make it less objectively bad.\n\"You know, I'm not really buying the werewolf instincts explanation,\" Stiles says afterwards. \"I've fucked a lot of werewolves, and none of them ever told me they were going to get me pregnant.\"\nThis line of questioning seems not to be one Derek wants to pursue, judging from the way he's shifting awkwardly against the sheets.\n\"Hey,\" Stiles says in mollifying tones. He pets Derek's hair a little. \"If any werewolf was going to knock me up with his biologically impossible babies, I'd want it to be you.\" \nDerek just grunts, but his hand, a minute later, steals down to rest on Stiles's flat stomach.\n“Still not getting anywhere near a stroller when you’re around, though,” Stiles murmurs, and closes his eyes.\n \nThe Camaro needs a tune-up, so Stiles is picking Derek up in the Lexus for the next few days. He jangles his keys idly as he waits by the door. Usually Derek is ready and waiting when he gets there, always impatient to leave the office, but today he's caught up in conversation with a pretty dark-skinned receptionist. \nThe shiny reception desk isn't wide enough for her to need to lean over it that far, but it certainly does good things for her neckline. He can't hear what they're talking about, but it must be funny, since she keeps laughing. She has a wicked smile, which Stiles is appreciating in an artistic sort of way.\nSo it shouldn't be such an embarrassing shock when Derek smiles back, wide and toothy. It's not a smile Derek pulls out very often — Stiles has only seen it a half-dozen times, usually when he's inviting Stiles to —\nStiles is suddenly too cold even with his jacket on.\nWhen Derek finally says his goodbyes and turns towards Stiles, he looks kind of zoned out. He almost walks right out the door without putting on his coat. \n\"It's cold out there,\" Stiles says in the elevator, tone casually friendly. Derek startles, then looks at his coat like he's never seen it before putting it on.\nThey don't really talk on the ride home, but once they get into the apartment Stiles can't stand it any longer. \n\"How was work today?\" he asks, quickly, like ripping off a band-aid.\n\"Good,\" Derek says as he hangs up his coat. He says it like other people say \"bizarre.\"\n\"That's nice,\" Stiles says.\n\"No, you don't understand,\" Derek says and turns to him, weirdly intense. \"Work was actually good. Isaac brought me coffee. I ate lunch with Boyd — the leftovers you packed me. Erica and I apparently have an inside joke now.\" \n\"What's the joke?\"\n\"Something about pencils, it doesn't matter.\" Derek shakes his head impatiently. \"The point is that I have friends — a pack, now, because of you. People have stopped looking at me like I'm going to tear out their throats. They smile at me in the halls.\" His expression is baffled. \"They say hi and comment on the weather. Work was good.\" \n\"Oh,\" Stiles says, throat tight. \"You deserve it.\"\n\"I'm trying — Stiles, I'm trying to say thank you,\" says Derek, stepping into Stiles's space, radiating his crazy body heat like always. \"You changed my life.\"\nIt was what Stiles had set out to do from the start. His campground looks to be officially cleared. This moment should feel like a victory.\n\"You're welcome,\" he says. \"You should go for it.\"\nDerek looks blank.\n“Go for what?”\n\"The —\" Stiles gesticulates, but even he's not sure what he's trying to convey with the gesture. \"The pretty receptionist. You should ask her out.\"\n\"I should ask her out,\" Derek repeats.\n\"You're ready.\"\n\"I'm ready.\"\n\"Are you just going to keep repeating everything I say?\" Stiles says, laughing. Nothing like amusement is in Derek's expression, but he laughs too, sharp and short.\n\"Do you really not —\" he says, disbelieving, and trails off. Stiles raises his eyebrows. \"I thought you — how can you not know?\"\nStiles is starting to get a bad feeling about where this is going, but he doesn't know how to derail it. \n\"We should think about dinner,\" he says, weakly. For a minute it doesn't look like Derek is going to take the bait, but he takes a deep breath, then lets it out, nods.\nThey go to the Ethiopian place around the corner. Stiles had never eaten Ethiopian food before he started staying with Derek, but he loves it now, orders it spicy enough to bring tears to his eyes. It's a great restaurant, too; family-owned, comfortable, with art on the walls and curtains hanging between the booths to make it feel private.\nThat doesn't stop him from making fun of Derek when he proposes eating there, most of the time. He always tells Derek it's his instincts calling him to tear into some meat without utensils. Derek’s response is usually to point out that sourdough flatbread doesn't feature in a wolf’s natural habitat.\nThere's not much banter this time, though. Derek slides into the booth next to him instead of sitting across the table. He's oddly quiet, even for him, like he's working out a math problem in his head. It's making Stiles nervous, especially combined with the way Derek's up in his personal space, touching his hand, his knee, the small of his back. \nHe thinks he knows what Derek wants to tell him, but he can't bring it up before Derek does. So it's almost a relief when they're back in the apartment, Derek tossing his keys in the bowl and finally clearing his throat, motioning to an armchair, saying, \"Could you sit down?\"\nStiles sits, and Derek starts to sit opposite him, then awkwardly stands back up, like he has to be standing to say this.\n\"I don't know how you feel about me,\" he says slowly. His eyes are clear, honest, and Stiles wants to look away. \"But I thought you knew — I want you to know. I'm in love with you.\"\nIt's what he expected him to say, but it's still hard to hear. His chest feels tight. It was inevitable; Derek was bound to latch onto the first person he actually connected with, no matter who they were. It’s transference, textbook, just like they learned about in Psych. It’s got nothing to do with Stiles.\n\"You don't love me,\" he says gently. He's trying to be as kind as he can, but Derek looks unexpectedly furious. \n\"You can't tell me how I feel,\" Derek says harshly. Stiles looks at the floor, the familiar bulk of the couch, picks at an unraveling seam on his sleeve. \n“I’m just a guy you hired to do a job,\" he says. \n“Why do you keep throwing that back in my face?” yells Derek.\n\"You can't love me, because you don't know me. I was driving the car, Derek.\" Stiles spits it out, words suddenly coming without his volition. The angry expression on Derek's face is turning to confusion.\n\"I was in the driver's seat, and I wasn't paying attention, and I stepped on the gas at a stop sign, and that's why my dad is in the hospital, Derek, that's why he might never wake up. Because of me. So don't tell me you love me.\" He's trembling all over. \"The guy you think you love doesn't fucking exist.\"\nDerek is frozen, like Stiles knew he would be. Good, Stiles thinks blurrily, good. It's an end to it, finally. He can stop fooling himself. Derek knows the truth, so he's going to stop imagining Stiles is anything more than a —\nBut Derek is moving now, coming towards Stiles, lifting him bodily out of the chair to bring him to the couch and hold him in his arms. Nothing makes any sense, and he wants to cry. Derek kisses him on the mouth, very, very gently, like he might break. \nStiles twists against him, tries to turn the kiss into something biting and harsh, but Derek won't let him do it. He takes in Stiles's aggression and gives him back nothing but sweetness, until it's too much, and Stiles is sighing into his mouth, tension releasing, feeling weak and helplessly cherished. \nAfter a while Derek pulls back and just holds him, steady, solid as a rock. Eventually he says, \"I don't love you any less because of whatever you think you did wrong.\"\nAnd Stiles kisses him for that, whether or not it’s true, gently, sweetly, the way they both like.\n \nHe wakes up alone, like the first morning he ever spent here. This time, when he goes in search of Derek, he finds him in the living room, not the kitchen, and he's — oh God, looking at Stiles's school books, which he forgot to put away before coming to pick Derek up yesterday. \n\"It's just community college,\" he says. Derek glances up and smiles beautifully, face lighting up as if he regrets nothing about the previous night, even though he had to have hoped for a better reaction to his confession than Stiles's crazy meltdown.\n\"It's great,\" he says, touches the big red A on the paper Stiles got back last class. \"Are you taking something next semester?\"\n\"Yeah,\" Stiles admits. \"I might go full-time. They said I'm eligible for loans, and I have savings now.\"\nDerek looks suddenly uncomfortable again.\n\"About the future,\" he says, fidgeting with something in his pocket. \"There's — You probably don’t even — I know this is too soon.\" He says it quickly, defensively, like Stiles is accusing him of something.\n\"What's too soon?\" Stiles asks, confused.\n\"I don't want an answer,\" Derek says, earnest. \"I just don't want to keep it a secret anymore, the way I feel, and I'm still not sure you — I want you to know, I —\"\n\"You have a ring,\" Stiles says blankly. Derek takes his right hand, lays the gold ring on his shocked open palm.\nThere's no inscription. It's perfectly round, featureless, silent. It says nothing beyond the bare fact of what it is, whole in itself, warming slowly in his palm.\n\"You were right,\" says Derek. \"I don't know everything about you. But Stiles, I know you.\"\nFor once in his life, Stiles is entirely speechless.\nDerek speaks again, like he's trying to fill the silence or make his case. \"That night when you. With your fingers,\" he says, and Stiles remembers it, an ordinary night, nothing special except the heat of Derek's mouth, the shadows of his lowered eyelashes on his cheeks. Derek swallows, gaze distant. \"I could still feel your hand afterwards, on my tongue, for hours. There was a jewelry store on my way home, and I just — walked in.\"\n\"That was months ago,\" Stiles says. Apparently all he can do right now is state the obvious. It’s just so Derek, pulling this on someone who hasn’t even said “I love you” back, having a secret ring stashed away for all this time without ever planning to use it. He thinks he keeps himself guarded, but he’s more vulnerable than anyone Stiles knows; when he’s in, he’s all in, without restraint or reason.\n\"Stiles.\" Derek says it simply, like a statement of fact, then seems to give up on words. Instead he lifts Stiles's left hand to pull Stiles's two middle fingers into his warm, wet, trusting mouth. \nThe whole world feels like it's rearranging itself around the point where Derek's lips have closed around his fingers. Nothing is like he thought it was. He told Derek the whole truth and Derek still wants — he still —\n\"You have to give those back,\" Stiles says, \"if you want me to put on the ring.\"\nIt's Derek's turn to go blank, like Stiles saying yes is the last thing he expected, because Derek's an idiot. But he's Stiles's idiot, and he needs to give Stiles back his fingers right now, because suddenly every second the ring still isn't on his finger is agonizing. \"Come on,\" Stiles says, urgent, and Derek lets him go, and Stiles slides the ring onto his spit-slicked finger. \nDerek wraps his arms around his body and kisses him like he's never going to get to kiss him again, which is funny, because he’s going to get to kiss him every day for the rest of his life.\nHe pulls back for a moment to tell Derek, \"I love you. We're getting married,\" two last statements of the obvious.\n\"Can’t say you’re not in my pack anymore,\" Derek says, face lit up like Stiles has never seen. Stiles laughs.\n“Technically, wasn’t the whole pack thing my idea in the first place?”\n“So, I’m in your pack?” Derek says, ducking his head, still smiling up at Stiles as if he doesn’t know how to stop, eyes clear and open.\n“Oh, that’s just what you guys need,” Stiles says.\n“Yes,” Derek says.\nStiles is starting to believe him."
}