{
    "id": "643582",
    "url": "https://archiveofourown.org/works/643582?view_full_work=true",
    "author": [
        "WhoNatural"
    ],
    "title": "Not Like Bond & Moneypenny",
    "rating": "Mature",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Teen Wolf (TV)"
    ],
    "relationships": [
        "Derek Hale/Stiles Stilinski"
    ],
    "characters": [
        "Derek Hale",
        "Stiles Stilinski",
        "Scott McCall (Teen Wolf)",
        "Allison Argent",
        "Lydia Martin",
        "Laura Hale",
        "Erica Reyes",
        "Danny Māhealani",
        "Vernon Boyd",
        "Peter Hale",
        "Jackson Whittemore",
        "Isaac Lahey"
    ],
    "additional_tags": [
        "Ugly Betty AU",
        "Alternate Universe - Office",
        "Slow Build",
        "Pining",
        "Mystery",
        "Corruption",
        "Angst",
        "Angst and Humor",
        "Humor",
        "Human Derek Hale",
        "Derek is a grump",
        "Stiles is a nerd who should not even go here",
        "Alternate Universe - Writing & Publishing",
        "Sexual Tension",
        "Curly Fries",
        "Stiles and Erica are bros",
        "Alive Laura Hale",
        "BAMF Erica",
        "Lydia is judging you",
        "Coffee",
        "Boss/Employee Relationship",
        "assistant!stiles",
        "boss!derek",
        "Peter is Wilhelmina",
        "Alternate Universe - Fusion"
    ],
    "language": "English",
    "series": "Part 1 of Alpha Magazine 'Verse",
    "published": "2013-01-18",
    "completed": null,
    "words": "29,869",
    "chapters": "1/1",
    "comments": "290",
    "kudos": "11,882",
    "bookmarks": "3,410",
    "hits": "247,529",
    "summary": "<p>(AKA, the Ugly Betty AU where Stiles is totally Betty)</p>\n<p>Stiles thinks he’s finally getting a break when a job at the sleek, sophisticated, Alpha Magazine opens up - but soon realises he’s not going to be writing anything and instead is playing tutor-slash-babysitter to their new Editor-in-Chief. Derek’s spoiled, grumpy, in way over his head...and so painfully attractive it makes Stiles want to lick his face. So there’s very little choice in the matter.</p>\n<p> </p>\n<p> <i>“Totally not like that,” he maintains, “It’s not like we’re Bond and Moneypenny.”</i></p>\n<p> </p>\n<p> <i>Scott gives him an excited grin, chuckling. “Dude, you’re totally his Miss Moneypenny!” he says, eyes wide like the world just finally started to make sense. “You’re the only one who won’t sleep with him even though you’re dying to.”</i></p>",
    "notes": "<p>A little reference for the appearances of Stiles and Derek:<br>Stiles:<a href=\"http://i46.tinypic.com/ojiiwh.jpg\" rel=\"nofollow\">1</a> // <a href=\"https://24.media.tumblr.com/tumblr_mdfyw0VmTR1qj68vto3_250.jpg\" rel=\"nofollow\"> 2</a><br>Derek: <a href=\"https://25.media.tumblr.com/tumblr_m8i7l9d31a1rd16e1o1_500.jpg\" rel=\"nofollow\">1</a> // <a href=\"https://25.media.tumblr.com/554b3a56e4ec2684c6f81d0c67cb825e/tumblr_mgub6n9nEY1rnfdloo1_250.gif\" rel=\"nofollow\"> 2</a></p>\n<p>Some amazing people have made cover art and manips which... I just can't deal with how wonderful this fandom is, you guys. I'd love to put them in the text, but it's not helpful if you're like me and download everything to an e-reader so HERE:<br><a href=\"https://mari-mcsly.tumblr.com/post/40868906644/cover-gif-for-not-like-bond\" rel=\"nofollow\">GIF cover </a>by the amazing mari-mcsly<br><a href=\"https://eeames.tumblr.com/post/41689463576/teen-wolf-au-ugly-betty-crossover-inspired-by\" rel=\"nofollow\">Manip</a> by the fabulous eeames</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>I hope you enjoyed my first attempt at slash, an alternate universe... and a Teen Wolf fic. Ever.</p>\n<p>I am <a href=\"https://howlnatural.tumblr.com\" rel=\"nofollow\">howlnatural</a> on tumblr.</p>",
    "text": " \n\n\n I\n\n\"I just don't get why you'd want to work there, man. It's all pouting models and skinny ties. I thought you wanted to write about music?\"\nStiles sighs down the phone over the hum of the elevator. \"It's a step on the ladder, dude. If I get something good published here, then it looks better on a resume, then I don't look like some inexperienced n00b when I finally get an interview with Rolling Stone, become their Editor-in-Chief, and restore it to its former glory.\"\nThere's a snort from Scott. \"Modest, huh?\"\n\"Alright, Alternative Press?\" he grins in response. \"I'm not picky, man. It's just how the industry works. I'm still having a hard time believing I got an interview for something with an actual, honest-to-god paycheck at the end of it.\"\n\"You're not gonna go all 'Manhattan' and start criticizing my choice in coffee and pants, are you?\"\n\"My judgment of your boring americanos and cut-off shorts has been long standing, man. The grease stains alone make me wonder if you've discovered laundry detergent.\" The elevator pings and lights up a bright, red, 85. \"Oh, dude, this is the floor, gotta go.\"\nHale Towers - that's not the actual name, but it fits - reminds him of that one episode of Doctor Who with the futuristic hospital. When the doors open, it's all white floors, bare walls and people who are dead in the eyes. Ridiculously attractive people, but still lacking anything that resembles exuberance. Stiles had stepped in half-expecting a detox shower the moment the doors closed, but all that happened was a stressed-looking kid - intern, probably - tripping over his own feet in some kind of panic. There was a four-inch-thick pile of paper in his hands, and he apologised profusely before someone yelled 'Greenberg!' through his headset and he got out two floors later.\nStiles is hoping that means he and Greenberg don't share a boss.\nThere's a huge, white reception desk right in front of the elevator, and he's starting to wonder if Scott had a point. Everyone here looks like they're dressed for a formal dinner, making him slightly regret his choice of clothes for the day. The strawberry blonde at the desk, leaned back so far she's practically reclining, seems to agree.\n\"Deliveries are ground floor, side entrance,\" she informs after a cursory glance, sounding thoroughly bored and judgemental all at once. Stiles isn't sure that's possible, but she manages it.\n\"Uh, I'm not making a delivery - I'm here to see Ms. Hale? Stiles Stilinski. I have an interview?\" His tone comes out questioning, like he isn't quite sure it's true either. Nervous habit makes him bury a hand in his still-growing-out hair, probably leaving it even more gravity-defying than it was when he left the house, and he sheepishly tries to smooth it back down to normal again before she sees. She's fucking intimidating, and this is just the damn receptionist.\nStrawberry Blonde sits up then, suddenly interested, and for the first time since he was sixteen years old, Stiles has to question his own sexuality. The girl is stunning, but then again he hasn't seen anyone who doesn't look like they belong on the pages of this very magazine instead of producing it. After she scans his appearance with a curiosity he's only seen in Erica's threateningly judgemental cat, Mr. Tabs, she raises a brow. Whatever she's thinking, it isn't voiced, and he doesn't know whether to be relieved or not. It'd probably demolish any and all vestiges of confidence he built up since graduating high school. Once she's let out a thoughtful 'hmm' , her fingers fly over the keyboard in front of her and she presses a perfectly manicured index finger to the earpiece disguised by her fabulous hair.\n\nFabulous? Is he developing a crush?\n\n\"Isaac?\" she says sweetly, \"Ms. Hale's ten thirty is here, will I send him through?\" There's a smirk in response to something Isaac says, and she rakes her gaze over Stiles once more. \"No, he looks like something from The Big Bang Theory.\"\nStiles scowls back at her, mouth gaping and only marginally offended, but then he is wearing his Green Lantern shirt under his favourite plaid, and he didn't have time to change or put contacts in when Erica called.\n\"The agency contacted me less than two hours ago-\" he begins, but is silenced by a dismissive index finger pressed to her lips.\nHe's beginning to freak out once again that only having time to print off a copy of his resume and dash for the subway is going to go against him. An interview with GQ's biggest competitor, looking like he hasn't left his apartment in weeks due to an Xbox tournament - which was, granted, what he did last month - isn't exactly what he had in mind to do today. But Erica said she'd give him first dibs on anything promising that came through the agency, and after five months of being an unemployed Journalism graduate, she'd finally come through.\nStrawberry Blonde hangs up and looks at him. \"Ms. Hale is ready for you now. Through the foyer, turn left, up the steps and it's the last office at the end of the hall. Isaac will send you in.\"\nThere's this calculating look then, and she gives another one of those knowing smirks he's beginning to think is her default expression.\nStiles nods, trying to remember the directions as the mandatory interview nerves kick in. \"Thanks, uh...\"\n\"Lydia,\" she says, already picking up her phone and beginning to text. \"You're welcome, Sheldon.\"\n\"Oh come on, I'm at least a Leonard,\" he shoots back, and she raises her brow, already over it.\n\"We'll see.\"\n.\nIsaac is the first normal-looking person he's seen since stepping out of the elevator, but still he's got this corrupt-my-innocence thing going on and cheekbones Stiles has only seen on Russian supermodels.\n\"Hey, man,\" is the kind greeting, and he's pulling his headset down and actually smiling. \"She's ready for you whenever.\" His eyes flick towards the closed door and he leans in. \"She's a little stressed today, with the take-over and all? So try not to waste her time. She's cool, though.\"\nStiles makes a noise of understanding, even though he's not sure what the hell the guy's talking about, because he has had zero time to prepare for this and makes his way towards the door.\nMs. Hale's on the phone when Stiles makes his way through the door, and he's not surprised to see that she's yet another example of winning the gene-pool lottery. The woman looks about twenty-five, though he knows this isn't true - the way she's dressed and how she's speaking to the person on the end of the line tells him that this is someone who's made it through their twenties and has somehow managed to still keep the body of a nineteen-year-old.\n\"Yeah, well, Peter, you're just going to have to get over it. It's what Dad wanted, and it's the way things are, so stop being a damn child.\"\nThe brows that were furrowed in annoyance rise slightly when she catches sight of Stiles, and she beams, giving him a small wave over to shake his hand before he sits in front of her desk. The office is beautifully decorated, though doesn't exactly look like something chosen by the woman in front of him, and he feels out of place just sitting on the pristine chair\n\"Peter, I have to go. Ye-,\" she growls frustratedly, low in her throat, and looks to the heavens for strength, \"Yes, I know. Look, we'll talk later. Goodbye.\"\nThere's a fierce set to her mouth when she stabs the button on her phone and sets it down on the table.\n\"Sometimes I miss flip-phones. Don't get quite the same satisfaction out of hanging up on people, you know?\" she wearily confides. Stiles offers a soft smile in return..\n\"I don't know, I find throwing it against the nearest hard surface helps,\" he supplies. Ms. Hale is disarmingly warm, and Stiles finds himself relaxing instantly as she turns to her laptop, pulling up some files.\n\"So, Genim?\" she says, and he pulls a face.\n\"Stiles, call me Stiles, please. I feel like you're talking to my grandpa.\"\nShe scrunches her nose. \"Yeah, I did have to double check with Erica that you're really twenty-two,\" she admits, earning a soft laugh from him. \"Stiles, huh?\"\nHe shrugs. \"It's what happens when you let a five-year-old in a tantrum choose his own nickname. I don't even know where I got it from, but it stuck.\"\nShe chuckles warmly and nods. \"Alright, Stiles, your resume looks great. Graduated top of your Journalism class, editor of your high school paper as well as Washington Square News in your senior year at NYU...\" She looks back at him suspiciously. \"The few published pieces included with your file are pretty great, even for a student...so why hasn't anyone scooped you up yet?\"\nHis mouth twists, wondering if the truth will go against him, but screw it - he didn't even know about the position before last night, and it's not like his life-long dream has been to work for Alpha Magazine.\n\"Well, honestly?\" he hedges, and she holds out her hands. He huffs out a resigned sigh. \"I can't afford to work for free - everything else was unpaid internships with web publications - which are great, but I've got an apartment to keep and I've been blogging since I was fourteen. I majored in Journalism because I wanted to write for magazines, you know? Something you can hold in your hand and leave on the subway for someone else to pick up. Something you can rip the pages out of and keep if there's something really cool. It's just not the same making a bookmark on your computer.\"\nHe finishes with an unsure shrug, and leans back in her chair, studying him a little before smiling fondly.\n\"My father used to say the same thing.\"\nShe turns to the left, where several impressive degrees hang on the wall, dated back to the seventies and with the name Bronson Hale on each. Suddenly the out-of-place decor starts to make sense.\nThe name was in the news most of the time he'd been holed up playing Skyrim, but Stiles would have to be completely ignorant not to know who Bronson Hale was. Stiles isn't just in some editor's office who happens to share the name with Hale Publications - this is the new CEO. He wonders obliquely what the hell she's doing wasting her time interviewing college grads as a wistful smile flutters over her expression.\nShe turns back to him. \"He pulled his company out of the gutter when my grandfather retired, turned it around completely in a matter of years. The magazine was founded back in the eighties because he thought there should be a men's answer to Cosmo that didn't exclusively feature women in bikinis and little else.\" Stiles smirks knowingly at the mischievous cock of her eyebrow.\n\"A closet feminist?\" he quips, earning him a chuckle. She shrugs.\n\"He just loved the industry - wanted to do something different.\" She frowns slightly as she turns back to the screen. \"But hey, I'm supposed to be interviewing you here, not providing all the answers,\" she mock-reprimands, remembering herself. \"What do you know about the company?\"\nStiles rattles off the little he was able to glean from the website on his phone on his way there - which is embarrassingly little, since it hadn't been updated yet - and his heart races as he realises that actually, he kind of really needs this job. He's going to be pretty bummed if he doesn't get it. It seems like Ms. Hale, at least, shares his passion for printed media, and these days, that's not all that easy to find. He trails off a little too soon and looks off to the left.\n\"Not a fan, huh?\" she deduces instantly.\n\"I grew up reading music and film magazines... Honestly, Alpha always seemed a little out of my league?\" he replies, gesturing down to his clothes. She lets out a laugh and nods.\n\"We do kind of give off that impression. I tried to change that when I was in editor, but thirty years of branding can't be undone overnight,\" she sighs. \"Geek is in right now, there's a reason they re-booted Spider-Man less than a decade after the first one came out.\" There's a slight crease to her forehead. \"Who doesn't love Peter Parker?\"\nStiles smiles back - this is something he can actually talk about.\"Well, it does help that Garfield's much easier on the eyes than Maguire...\"\nHer perfectly arched brows jerk a little in surprise. \"You sound just like someone else I know,\" she muses with a grin. \"Anyway, you should totally pick up a copy - you might find something you like.\"\nStiles takes that as a sign he won't be reading any of it here - not before print, anyway - and deflates slightly. \"Uh, sure...I'll do that.\"\n\"Besides, I need to be sure all the progress I made over the last seven years isn't undone under the new Editor-in-Chief,\" she confesses. \"Which takes me to your job.\"\nHis head tilts up in surprise. \"My job?\"\n\"Well, yeah,\" she says, holding a hand up to his file on screen. \"I'd be an idiot not so snap you up before Erica finds something else for you... but I gotta be straight with you here.\"\n\"...Okay...\"\n\"It may be a little while before you're getting any bylines.\" She holds up a hand at his confused frown to halt any protests. \"That's not say never, it's just... I need someone with editing experience, who isn't actually an editor.. because the editor we do have is an editor...without any editing experience...\" She sounds almost ashamed, and it just confuses Stiles more. \"But the pay is good, way better than we offer our entry-level positions...and we need something fresh around here.\"\nBefore he can question her further, Isaac has been summoned into the room and he's being ushered out and back down the hall. Stiles suspects this was on purpose, like she thinks that he won't figure out what she seems to be up to and disagree before it's too late.\n\"Welcome to the fold, man,\" Isaac says, clapping Stiles on the back and leading him past the foyer and down another hall.\n\"I don't even know what I'm doing here,\" he replies, half-dazed and replaying everything Ms. Hale said in his mind.\nIsaac snorts. \"Don't worry, most of us could say the same thing, but you seem smart - you'll get it.\" He pauses to pull something out of a drawer at the desk they're standing by, and smiles. \"Just learn his routine, offer a little advice, keep on top of his appointments, don't let Peter in without his say-so...and try not to piss him off.\"\n\"...Him?\"\nIsaac knocks on a door which still reads Laura Hale, Editor-in-Chief, and opens it when a grunt sounds through the wood. The office is empty, but a large closet door obscures the occupant from view as they enter.\n\"Janine? You're late. Like, really fucking late. Get me my coffee before I forget why you work here.\" The voice is rough and cracked, and sounds so annoyed at the world that Stiles feels the need to cower under the large oak desk. Maybe suck his thumb a little.\nIsaac looks uncomfortable, and Stiles notices for the first time that he's holding a headset as well as the one around his neck.\n\"Mr. Hale? Um, your new assistant is here.\"\n\nAssistant?!\n\nIt seems like he isn't the only on receiving the news for the first time. The closet door slams closed to reveal-\n\nThe most beautiful fucking man Stiles has ever seen in real life.\n\nThey're around the same height, but whereas Stiles is slender and toned like most guys his age, this dude is broad and muscled and ohmygod nobody should look that sexy in just a plain white dress shirt and grey pants. There's something familiar about him, which Stiles can't immediately place but then again his brain probably just crapped out at the sight of him. There's forearms and perfect stubble and intense eyes and all of it's kind of an overload. He's fiddling with a tie around his neck, inky black hair all in disarray, and scowling at them both with an irritation that apparently does nothing to deter the instant attraction thudding through Stiles' veins and heading south.\n\"Where the fuck is Janine?\" he demands, and Isaac glances at Stiles nervously.\n\"Ms. Hale thought you needed someone better suited to the position. Who actually, um, went to college?\"\nMr. Hale - suddenly, that last name is about 400 times more sexy - rolls his eyes and flops down on the large leather chair, letting his forehead fall onto his hand. \"Of course she did. And tell me, Isaac,\" he looks back up, \"Did she think to inform me that she fired my fucking assistant?\" he says wearily.\n\"Ms. Hale says that you don't get to make executive decisions about the people you sleep with,\" is the reply, and Stiles doesn't miss the quirk of Isaac's lips.\n\"Yeah, well, you tell Ms. Hale that just because she's my sister, she doesn't get to run commentary on my sex life.\"\n\"Will do,\" Isaac says, and presses the headset into Stiles' hands. \"Good luck, man.\" After that, he's gone.\nFor the first time, Hale turns his scowl on Stiles and it's like he's rooted to the spot. \"You starting today?\" he asks, but it sounds more like a demand than anything else. Stiles nods.\n\"Um, yeah. I got a call this morning - first I heard of it actually, and next thing I knew I was on the subway, googling Hale Publications so I didn't sound like an idiot in the interview. Apparently I did okay. I mean well, I guess I did, because I got the job. Even though this wasn't the job I thought it was going to be, but gotta make that paper, right?\" he laughs nervously. \"And well, uh, here I am.\"\nThe scowl on Hale's face had developed into a full-force frown while he spoke, and he pinches the bridge of his nose. \"You talk too much,\" he observes, and well, it's not the first time Stiles has heard that. Hale still comes across as kind of a dick, though. \"I don't like that.,\" he continues, \"Get me my coffee.\"\n\"Um, sure... I can do that. Maybe a muffin too? If you're hungry that is. You look like you could do with something tasty. How do you want it?\" he asks, and gulps at how dirty that sounded when he's talking to someone who looks like a fucking Grecian statue. He's aware he's been rambling - it happens sometimes when confronted with ridiculous hotness (and lots of other times too) - but every effort is going towards keeping his mouth distracted before he offers his brand new boss a massage complete with a happy ending.\n\"Whatever,\" Hale says, holding up a hand in front of his face, like it would block out the sound of Stiles' voice. \"I got four hours sleep. I just need a damn double-shot, for chrissakes.\"\nHe decides to forgo saying anything else to dart out of the office, pretty sure he passed a break room when he was being manhandled by Isaac towards his doom. Hale is grumpy,, seems like an asshole, and evidently extremely hungover, but Stiles wonders if it makes him completely shallow to find the whole brooding, irritated, do-as-I-say-or-else attitude a complete turn-on. It's not like he hasn't been in the presence of pretty before, but the whole package screams I could take you hard over my desk and I wouldn't be nice about it later. Stiles thinks this line of thought is probably inappropriate new employee behavior.\n.\nIf there's one thing Stiles can do, is make an awesome cup of coffee. One tradition that has never been broken with Erica, Boyd, Scott and Allison is their hangover-fueled trip for sweet black nectar when they're feeling less-than-awesome the morning after a big night. He knows his shit; he worked in Starbucks all through college, only quitting to give himself The Fear to actively go out and look for 'real' work. It's where he met Erica, when they bonded over a mutual love of experimenting with drinks and slacking off. She graduated a year before he did, walking into a cushy position at her father's employment agency, but they kept in touch. If Stiles somehow manages to last longer than a week here, he'll have to thank her for getting him his interview.\nHe's making Hale's non-fat (because there are no other options, unsurprisingly), double-shot (because: cranky) vanilla (he did promise tasty, after all) latte when a voice carries from the doorway.\n\"Holy fuck that smells good,\" the guy says, and Stiles turns to take in tanned skin, amazing dimples, and soulful, brown eyes. Shit, is nobody here just 'okay-looking'?\nThe guy sidles up beside him, peering at the cup. \"Vanilla? Nobody ever uses the good shit in their coffee here.\"\nStiles nods, looking at the masterpiece again. The syrup bottles did look pretty pristine. \"Yeah, got a grumpy puppy to appease on the first day,\" he explains, shooting a smirk back at Brown Eyes, whose eyes widen in realisation.\n\"Oh, so you're Derek's new assistant.\" He gives Stiles a curious look. \"Not what I was expecting.\"\n\"That seems to be the general consensus,\" Stiles nods, before freezing. \"Wait, Hale is Derek Hale? Millionaire party-dude, former model, and the subject of a sex-tape scandal that never actually materialised?\"\nThe guy's brow cocks. \"I would say you've done your homework, but clearly not, given that you're just realising that now...\"\n\"I came here for a writing position, next thing I know, Ms. Hale's hiring me, Isaac's handing me a headset and now I'm making lattes,\" he explains, pouring the frothed milk. Instead of clarifying the last hour he's been here, things are just getting all the more confusing.\nBrown Eyes nods, smile tugging at his lips. \"Sounds about right. So that's all you know about him?\"\n\"Just what my best friend's girlfriend tells me when she's reading tabloids over breakfast and thinks I give a shit. I don't think I've ever seen a photo of the guy before.\"\n\"That's good. You're probably the only person who works here and isn't scarily obsessed with the Hales' private lives.\"\n\"So what the hell is going on?\" he asks, picking out one of the better-looking muffins from the basket. \"I mean, I know that Hale Senior passed away last month, but apart from that?\" Brown Eyes shakes his head, puts the muffin back and picks out a danish.\n\"Long story short, Papa died a month ago. Laura gets bumped up from Editor-in Chief of Alpha to CEO of the company, which Uncle Pete is less than happy about.\"\n\"Peter Hale? As in the guy I'm not allowed to let into Derek's office without permission?\"\nBrown Eyes nods, looking back over his shoulder. \"Yep. Rumour has it he thought he'd just waltz into Bronson's office and title, but Laura's was the name on the will, and she got the backing of all the investors. Not just that, but he requested Derek take over Alpha - because he wants him to 'settle down' after the whole sex-tape thing.\" The guy's now beginning to pour his own cup of coffee as he does his Perez Hilton impression. \"The guy barely graduated college and hasn't worked a job like this since he was in high school and had to help out in the mail room. Peter was pissed. Guy's some kind of power freak, and had wanted a title out of it. Laura, he could maybe deal with, because she's been here ten years - but Derek?\" He blows out a breath through his lips. He has very nice lips. \"All is not well in the boardroom.\"\n\"So why did he take the job? I mean, it sounds like he's allergic to work, so wouldn't it be easier to just let his uncle take over?\"\nA shrug. \"Nobody knows. Maybe his dad's dying words got to him, maybe he just hates Peter - he wouldn't be the only one - but he's here, and he's not been doing so good.\"\n\"That's where I come in, I guess,\" Stiles surmises, looking back at Brown Eyes' expectant expression. Well, the did guy just cram a family history into forty seconds - he's owed at least somewhat of an explanation. \"I'm a Journalism graduate, got some editing experience, and they couldn't hire an honest-to-god editor to just be an assistant, could they?\"\nBrown Eyes brows rise in realisation. \"Huh, well, sounds like Laura. She's got a serious Mother Hen thing going on for her little bro',\" he smiles. \"Good luck with it, man, I think you'll need it.\"\nStiles rolls his eyes, picking up Hale's coffee. \"Thanks.\"\n\"Danny,\" the guy says, smiling.\n\"Stiles,\" he replies, returning it.\nHe gets back to Hale's office to find him, tie finally done up, hair fixed, scowling at his computer like it's personally offended him.\n\"Your coffee, Sir,\" he says, not wanting to linger until the guy has some caffeine in his system, although he has a sneaking suspicion that the dude's hangover has little to do with his overall demeanor.\nHe gets a grunt of thanks as Hale starts tugging pieces from the danish and chewing thoughtfully. When he makes his way to what he assumes is his desk, he slips on his headset and boots up the computer. It doesn't look like it's been used much since Isaac - his name's still on most of the files - and Stiles wonders if the little quip about Derek distracting his assistants was true. It's not like it's any of his business, but still.\nAfter he locates Hale's schedule, he finds nothing until an appointment with the Board at three, and zilch after that. There's a stack of memos for the rest of the week beside the keyboard, and he decides to add them to the schedule because, you know, he may as well do something. Stiles is personally thankful that they're both being eased into their new jobs - he's probably going to have to ask Erica what the hell he's supposed to be doing - and figure out if she knew this wasn't a copy-writing job - before he comes back tomorrow.\nThough tempted to google his new employer, he decides against it - he doesn't know the company policy on monitoring the employees' web habits (yet), and besides, the guy's right there. It feels kind of rude. (Once he's at home, all bets are off). After a few minutes, he's being summoned back in, in that gruff, sexy, do-my-bidding voice. He doesn't stop to think where Hale actually learned his name.\n\"Everything okay, Mr. Hale?\" he asks as he rushes in. He probably shouldn't sound so flustered, but, you know... the guy's got a direct line to his groin and all.\n\"What's this?\" he asks, frowning at his latte.\n\"It's a latte, Sir. Double shot, non-fat, vanilla. My buddy Boyd swears by them when he's feeling, uh,\" - don't say hungover, dear GOD don't say hungover - \"...tired.\"\nHale scowls a while longer at it before looking at Stiles. He seems to take in his whole appearance for the first time, and he swears he can feel heat blooming over his body in the wake of that glare - but it doesn't seem hostile, just... curious?\n\"I like it.\"\nThe sigh of relief leaving Stiles' mouth is almost embarrassing, and he beams. \"Good, I'm a coffee genius. I'm like the freakin' David Guetta of coffee, except replace catchy hooks with flavours. You'd better be open to new things.\"\nHe doesn't know why he said that. He doesn't even particularly like David Guetta.\nHale's mouth quirks slightly at Stiles' posturing, but it quickly disappears. It's even hotter than the glower.\n\"Right.\"\n\"Well, uh, if there's nothing else?\" he asks, torn between wanting to run the fuck out of there and drape himself over the desk and offer himself up as lunch.\n\"Laura says you're here to help me,\" he says, frowning back at the screen. He clicks the mouse a couple of times before looking back at Stiles.\n\"Um, well, yeah, I'm your assistant, and she said-\" he stops, wondering if he should let slip how much he actually knows about his brand new boss' unsuitability for the job. Hale quirks a brow, prompting Stiles to continue, and he sighs. \"She said you might need some help with the editing side of things, you know? 'Cause I did some of that before, in college, and stuff...\"\nThere's no reply, and when Stiles thinks the polite thing to do is stop loitering in the doorway like a fangirl at a One Direction concert, he speaks. \"Know anything about this?\"\nStiles frowns, and makes his way towards the desk to get a better view of the screen. He can now smell Hale's cologne, and that draping scenario is getting a little more real. Thankfully, the computer is displaying a finished InDesign file, and this stuff, he knows.\n\"Sure, desktop publishing. I'm assuming you got this from the layout team for approval?\"\nHale nods, eyes fixed on the screen, and Stiles leans over him, taking the mouse from his hand. It's innocent, really. It's not an excuse to get another whiff of that cologne at all. \"Pretty sweet style. Do you know much about the program?\"\nHale grunts a slightly embarrassed-sounding 'No', and Stiles grins in return. \"No worries. I pretty much gave half my class a crash course in this the week our final projects were due, I can do the same for you, if you want?\"\nHe doesn't imagine the sag of relief that comes to Hale's shoulders, and something in him clenches. He may have looked like he didn't care to be here, but Stiles has a feeling that there's a part of him freaking out over messing this up.\n\"Cool,\" he nods. \"Let your buddy Stiles show you the ways of the Force.\"\nHale frowns. \"Who's 'Stiles?'\"\nHe can't help but laugh. \"I am. No more Stilinski. It's Stiles, okay?\"\nDerek gives him a curious look.\n\"Right.\"\n...\nIt's a week later when Ms. Hale (call me Laura, please) knocks on the office door and lets herself in. Stiles is picking apart Alpha's house style and sticking Batman post-its on the more important pages, outlining the most commonly misspelled proper nouns and misused punctuation.\n\"So the other editors will have caught most of these already, but sometimes there's something tiny that makes its way through the proofing,\" he explains, while Hale watches, with a guarded interest, Stiles' free hand obsessively clicking his favourite pen. \"If you're familiar with it, it should come as second nature after a couple of issues.\"\nThere's another brow-furrow when Stiles finishes, and he picks at one of the post-its. Stiles has come to catalog this particular look as 'begrudgingly curious'.\n\"And the Batman paper?\"\n\"That's just so you know which notes are from me, because Batman is awesome and helpful, and so are my notes.\"\nHale's giving him another look now, and the constant down-turn of his mouth is looking less severe, gently content.\nLaura clears her throat in the doorway, taking in the tutoring session with amusement. \"Learning a lot?\" she asks, looking between them. Hale straightens as if just noticing she was there, and and Stiles holds up the style book.\n\"Today we're tackling house style. I'm just glad he's got a grip on grammar,\" he snorts. \"I graduated with people who still don't know their semi-colon from their exclamation point.\"\nLaura chuckles back, shooting a look at her brother. \"He should - he's got an English Degree from Brown.\"\nThere's an uncomfortable expression on Hale's face when Stiles looks to him, surprised. \"Shit, man, I feel bad for talking to you like an eighth-grader now.\" This had definitely been left out of the who's-dating-who articles which made up practically all of Hale's online presence. The first page of that was depressing enough - Blake Lively, are you kidding me?! - and Stiles hadn't thought to google his education.\nThis is not a reflection on the fact that he's dying to know if Hale has a girlfriend so he can begin loathing the chick before he even meets her.\n\"I still need the help,\" he mutters evenly, shifting in his seat and briefly returning Stiles' stare. \"Could you leave us alone?\" There's another glance then, showing that the request is directed towards him. Stiles jerks up, fumbling for his things with an apology and passes Laura by the door.\n\"I'm going to have to buy Erica a fruit basket,\" she grins, watching Stiles with that annoyingly informed look that all women are born with. \"You're the gift that keeps on giving.\"\nStiles does not blush on his way out.\n...\nHe's there a month before he has his first run-in with someone dramatically demanding access to the office. A blonde guy around Stiles' age who, once again, looks like a freakin' model and has cheekbones to rival Isaac's. He'd thought that those kind of theatrics only happened in movies or on TV - but the dude is adamant.\nStiles stops him on his way into the office, since Hale has nothing scheduled for another forty minutes, and he's never seen this guy before. Stiles knows these things now, because he's actually starting to become good at the job, surprisingly. Even Lydia doesn't speak to him like someone who was dragged in from the street on a charity drive anymore. It was clearly a shock to her when he showed up on the second day, but since then he's become accustomed to her good-natured judgement. She's still not a fan of his clothes though, since he's never been one to adhere to dress code, or his 'hey I'm just going to chill here, sticking out in all directions and hope one of them's right' hair, and she makes it overtly clear that she thinks his thick-rimmed glasses are stupid.\n(You cannot pull the geek look off, Sheldon. Go visit the fashion department.)\nHe still sticks out like a sore thumb among other impeccably-dressed, well-built thumbs, but overall, he's found his job as Derek Hale's assistant-slash-tutor isn't as far out of his comfort zone as he'd originally assumed.\nApart from the whole, imagining him naked 40% of the time thing.\n\"Uh, sir? Can I get your name please?\"\nMr. Cheekbones looks at him like his very existence offends him. \"Jackson Whittemore. Who the fuck are you?\" he says, opening the office door.\n\"I'm Mr. Hale's assistant,\" he responds, getting up from the desk to bodily block him from advancing further, \"...and you don't have an appointment.\" Jackson's eyes rove over Stiles with amusement, and he looks back into the office, where Hale's now standing up from behind his desk.\n\"Alright,\" he scoffs. \"Lesson one, Toots. I don't need a fucking appointment.\"\nStiles looks to Hale for confirmation, but his eyes are fixed on Jackson with a clenched jaw.\n\"Sorry, Sir, I couldn't stop him.\" Hale's eyes flick to Stiles, softening slightly, and he shakes his head.\n\"It's okay, Stiles. Jackson won't be coming here again, so there's no need to remember him.\"\nFar from offended, Jackson smirks. \"Aww, Babe, that cuts me, really.\"\nStiles isn't sure how the hell an assistant - and that's what he is, if the lanyard around his neck is to be believed - gets away with speaking to Hale like that, but he figures he's not going to get the story by standing around gaping at them.\n\"Do I need to call security?\" he asks, speaking to Hale again, who shakes his head.\n\"Just give us a minute,\" he responds, and for the first time, Stiles recognises that same guarded expression from his first day. He hadn't even noticed it was gone until it reappeared.\n\"Sure. I'm right outside,\" he says warily, backing out the door.\n\"Aww, he's like a little guard dog,\" Stiles hears Jackson tease as he pulls it shut.\nThere's a full two minutes of silence before Stiles heads to the break room. Maybe now's the time to break out the peppermint and chocolate reserved for when Allison hates the world once a month.\nHe gets back to the sound of raised voices and Jackson throwing the door open. When he catches sight of Stiles, he schools his face into one of indifference and raises a brow.\n\"See ya later, Scrappy Doo.\"\nDerek directs him in with a tired-sounding \"Yeah\" once he knocks, and looks thoroughly beaten.\n\"Brought you coffee,\" he announces, holding it up as he reshuffles the tablet in his grasp. It's awkwardly quiet, since something unpleasant has obviously gone down, but Stiles knows they're not at that point in their professional relationship where it's appropriate to ask. He's not sure that Hale will ever be the kind of boss who gets familiar with his assistant... no matter how familiar that assistant wishes things would get. He clears his throat once before launching into shop-talk.\n\"You've got the budget meeting with Finstock in twenty minutes, that's down on twenty-six, then Daehler wants your input on the cover shoot with Ryan Gos... Holy shit... Ryan Gosling?\" He clears his throat again and sets down the cup in front of Hale. \"Um, anyway.. yeah that's at two thirty. Your sister wants to stop by at four to talk to you, and then I was thinking we could pick up on the Photoshop tutorial after she leaves. Sound good?\"\nHe looks up when Hale doesn't respond, to find him nodding distractedly and studying the coffee mug. Screw it.\n\"Mr Hale? Everything okay, man?\"\nIt seems to break his reverie and he looks up, blinking. \"Why'd you bring me coffee?\"\nStiles gapes for a second; it had been a gut reaction that he hadn't exactly thought about. \"Uh, well it didn't look like that Whittemore guy was gonna be much fun, so I thought...\" he shrugs, \"My stepmom, Melissa says there isn't much that chocolate doesn't cure.\"\nThere's a slight jerk in Hale's brows and he looks back down at the cup, all kicked-puppy eyes and dejection. Then he sips it and holy shit, almost smiles?\n\"It's good,\" he comments, making eye-contact once again. Stiles still hasn't figured out what colour Hale's eyes are, but figures that getting close enough to investigate is just asking for a chance to get himself fired. \"Thanks, Stiles.\"\nHe can't help the soft smile he gives in return. \"No problem, Mr. Hale. I'll give you ten while I get the stuff you need for the meeting,\" he says, turning towards the door.\n\"Derek,\" Hale says, just before it closes. Stiles stumbles back, brows raised.\n\"What?\"\n\"It's Derek. Mr. Hale was my...\" he trails off, a pained look coming over his features before he schools it away. \"Just call me Derek, okay?\"\nStiles beams. \"Sure thing, Derek.\"\nLater, Stiles will decide that he was thoroughly doomed the moment he witnessed the Derek Hale Smile.\n\n...\n\nIt's been six weeks when Derek asks for Stiles opinion for the first time. Deadline for the debut issue bearing his name on the mast-head is in three days, and though Daehler made it seem like he was trying to do him a favour, leaving the choice of cover photo up to Derek when he has to pick one of sixty-seven is just a panic-attack waiting to happen. Not just that - but it's their special November issue, a tradition started by Bronson Hale himself. This is just too much pressure to handle.\nThere's a lot of glaring, too many pictures of Ryan Gosling's face (and Stiles didn't even think that was possible, but it kind of is), and furious clicking between mock-ups.\n\"He's supposed to narrow it down, Derek.\" Stiles grumbles, reminding himself that kneading the boss-man's shoulders may constitute sexual harassment. He should really be reserving a table for some executive dinner with Harris and the rest of Legal right now, but Derek looks like he may burst into angry, macho tears at any moment. The part of Stiles that always drove his dad crazy, rescuing abandoned kittens and taking in the odd lost puppy, has officially kicked into overdrive. \"It's some kind of pathetic initiation. Send them back and make him choose.\"\n\"And let the first issue look like shit?\" Derek grunts, speaking for the first time in sixteen photos. Even his voice sounds strained. \"No. I'm gonna pick one.\"\nStiles lets out a sigh, rakes a hand over his hair and sets down his tablet. \"Alright, step away from the mouse.\" Derek barely acknowledges him, still furiously clicking and refusing to blink. \"Dude, either you let me help you, or I leave your ass here to slowly lose your sight. 'Blindness by Gosling'. It's a thing.\"\nDerek casts a glance at the take-no-shit glare Stiles is rocking and sighs, letting his chair run back from the desk. Stiles pulls the arm, angling him away from the monitor and grabs the mouse.\n\"Alright, you read the interview already, right?\" he asks, and Derek gives a nod. He's blinking thickly with one eye, adjusting to the parts of the world which are not on a computer screen. \"Okay, what was the tone? Was it serious, revealing, funny, quirky-\"\n\"Kind of tell-all. Funny and revealing. His new film's an indie comedy,\" he answers, and Stiles gives a soft smile because, of course, he's read it too - just to be sure the editing's up to par for print - and Derek is right. Behind his back, Stiles selects all of the pictures where Gosling looks serious, and deletes them from Derek's drop-box.\n\"Good. Now, what's the focus? Is it fashion oriented, emphasising his movie career, or just an in-depth character piece?\"\n\"It's a little 'career',\" he begins, and Stiles waits, because he knows the main reason Gosling had agreed to the interview - Rachel had sweet-talked the agent with a promise to include his charities of interest. It's the Giving Issue, after all. \"But it was more personal than that. About his philanthropy.\"\n\"So if it's not fashion,\" Sitles leads, \"Do we really need a full-body shot of the Armani suit on the cover?\"\nDerek shakes his head. \"No, go with a portrait,\" he says, and Stiles deletes around thirty pictures of Ryan Gosling's torso. It's almost a tragedy. Finally turning, Derek takes in the screen with a raised brow. \"You got it down to twenty five already?\"\nStiles gives a proud smile. \"Process of elimination. Once you know what you want the cover to represent, it's not so hard. The spread's been done for weeks, so it's not like they didn't use some amazing shots inside.\"\nDerek nods, interest piqued once again, and takes the mouse back. \"I guess since it's a Thanksgiving issue, the grey suit with the orange and brown tie is a little more... fitting?\" he muses quietly, looking to Stiles for confirmation, and getting it. There are now twelve photos left, and Derek is squinting again. \"What's the quote we're using on the cover?\"\nStiles swipes at the screen of his tablet, pulling his own files up and reciting. \"Um, 'Outdoorsy? I signed up to climb K2 and then threw up on my trainer'...\"\nDerek now has three photos on screen, all equally as pretty, equally as suitable, and any one would do. \"Hmmph,\" Derek grunts, studying them again. \"It could be any of these. Which one do you like best?\"\n\"Me?\" Stiles asks, and coughs so his voice once again sounds like he went through puberty at some stage of his life. \"Um...\" He leans over Derek's shoulder, face burning as the guy bores a damn hole in his cheek with his stare. After a minute of deliberation, managing to ignore the perfect, dark thickness of Derek's eyelashes as he blinks so close to Stiles' face, he selects the third. \"I like this one,\" he says, leaning back. \"It's the most mischievous - he looks approachable, like you could have a beer with him. We're trying to be approachable, right?\"\nDerek seems to ponder it for a second, before deleting the others, leaving Stiles' choice on screen and letting his mouth quirk.\n\"That's our cover,\" he says.\n...\nWhen Derek's first official issue is back from print, there's a soft smile on his face the whole day.\n\"This is so cool, man! I don't know if I'm ever going to get used to seeing my name on a mast-head,\" Stiles gushes, flipping through the pages.\nDerek eyes him silently for a beat, before awkwardly reaching out and squeezing his shoulder. \"Thanks for your help, Stiles,\" he says, not looking at his face, \"Probably would have crashed and burned without you, so... yeah. Thank you.\"\n\"Aw come on, it wasn't just me - I let you choose the colour of the cover logo when Design asked 'your' opinion,\" Stiles teases, earning what looks dangerously like a smirk from Derek. \"It's called teamwork. But maybe next time I could let you come up with a few ideas.\"\nThere's a roll of Derek's eyes as he turns to go, and he's shaking his head. \"Learn how to take a compliment, or it's the last one you'll get.\"\nStiles manages not to do a victory spin on his chair until Derek has closed his office door.\n...\n\"I didn't even know you could get curly fries within a four-block radius,\" Derek comments, watching as Stiles crams another handful in his mouth. They're some of the last ones in the office and most of the lights have been shut off - but Derek needed a cramming session on the magazine's budget before a meeting tomorrow, and asked for help.\nStiles doesn't even know much about finance or budgeting or advertising revenue but he figured moral support, second pair of eyes and all that. Not an excuse to spend more time with Derek at all.\n\"You wouldn't think so, but this,\" Stiles replies, tapping his nose, \"Better than a bloodhound when it comes to sweet, golden-fried manna from heaven.\"\nDerek looks skeptical. \"They have the nutritional value of a shoelace. How can you eat like that and not look like a 'before' for Proactiv or Slim-Fast?\"\nStiles gives him a smirk. \"Why Derek, I didn't know you'd been checking out my desirably svelte figure,\" he teases, watching an uncomfortable look come across Derek's face. \"That could constitute sexual harassment, you know. You talking about how hot I am all the time?\" Derek looks back at the spreadsheet awkwardly, eye's wide.\n\"I just meant-\" he starts, and shakes his head, When he notices Stiles laughing, he shoots a death glare his way and squares his shoulders.\n\"Here,\" Stiles says, feeling a little guilty. He holds out the carton of fries and shakes it in front of Derek's nose until he tears his gaze away from the monitor. The scowl's back and Derek looks at the fries, unsure.\n\"What are they like?\" he asks, picking one out and sniffing it. Stiles is horrified as he just stares at it and drops it back in the box.\n\"You are not trying to tell me you've never had curly fries before...\" he practically wheezes, and Derek's brows rise defensively.\n\"I haven't had actual fast food since I was fourteen... I guess I never thought to try them before that.\"\n\"You... what? What do you live on?\"\nSure, Stiles was aware that there were actual food groups and it was possible to cook something without plunging it in oil - hell, Stiles was a pretty fantastic cook himself - but even his dad, with his strict no-cholesterol diet, got to cheat every now and then.\nA shrug. \"I hadn't had a latte in about six years before the first one you made me,\" he confesses, and Stiles' face just radiates terror. \"I started modelling in high school, and my agency were kind of dicks about body fat vs. muscle tone.\"\nStiles feels almost emotional, trying to imagine a life like that. He can't - it's too upsetting. Of course, the constant opportunities to get laid and having a body like an extra from 300 might help, but still.\n\"Take the fries,\" he says sadly. Derek shoots him a confused look and he thrusts them into his hand. \"I can't just sit by and let someone I know live a life without curly fries. What kind of person would I be if I didn't help the needy? With great junk food comes great responsibility,\" he says seriously.\n\"I'm not needy, Stiles...has anyone ever told you you're kind of dramatic?\"\n\"All the time,\" he responds easily. \"My life is a constant barrage of hyperboles. Now take the damn fries before I have a nervous breakdown.\"\nDerek gives him a hooded, weary look, but takes them, pulling a particularly curly one out and popping it in his mouth. Stiles watches with rapt interest as the taste filters through, and Derek starts chewing. There's caution, surprise, curiosity all splayed out on his face before it melts into a hint of genuine pleasure. When he swallows and licks his lips (ohsweetjesus), he gives Stiles a small smile, reaching for another one.\n\"They're good,\" he says, and Stiles grins.\n\"Dude, you haven't even lived yet,\" he replies. \"I am going to make you so damn fat.\"\n...\nIt's a Saturday, Stiles has been give the whole day off, and has actually been invited to coffee with Lydia, Danny, and Isaac. Since he still hasn't thanked her for getting him the job, Stiles asks Erica along (and not just because she's been guilting him about not having seen each other for well over a month). They're taking their seats with the others when Stiles hears a familiar name being mentioned.\n\"What's the deal with Jackson anyway?\" he interrupts, much more enthusiastically than intended. All he'd been able to glean from snooping is that Jackson is Personal Assistant to Peter Hale, did some modelling in college, and not much else. Lydia smirks over the rim of her cup and and throws Danny a conspiring look. Isaac grins and raises a brow at Stiles.\n\"Got a little crush there, Stiles?\"\nErica smacks Stiles as he balks. \"I knew you met someone, you dick!\"\nIsaac's brows crease as he pauses his cup on the way to his lips.. \"Wait, I was kidding. You're into guys?\"\n\"Um, yeah...he's kissed boys and everything,\" Erica teases, with a sarcasm Stiles would never be able to pull off without being labelled a dick. \"I was there the first time it happened.\"\nShe raises a brow at Stiles, who winces at the memory of his first night at a gay bar in college. Erica and Allison had dragged him there soon after coming out, trailed by Scott, who felt the need to remind him that 'You're my best friend, man. Whatever makes you happy, I'm cool with!' every ten minutes.\n\"Totally called it,\" Danny cuts in, so smug it's almost maddening.\n\"You're the worst gay guy ever,\" Lydia comments, almost sounding horrified as she takes in Stiles' grey beanie hat, blue plaid button-down, jeans and ratty converse sneakers. He's slightly offended since he's not even wearing his 'Drew Carey Glasses' today. Days off are for contacts.\n\"Gee, Lydia, tell us how you really feel,\" he whines.\n\"I'd rather hear about your feelings,\" Erica cuts in, smacking him on the arm once again. \"You know I'm practically engaged and live vicariously through you. You're supposed to tell me when you meet someone you like!\"\nHe turns to her, holding his hands out helplessly. \"I didn't! He's a giant asshole.\" He turns back to the others, shaking his head. \"He barged past me into Derek's office, acting like he owns the fucking place. He's just an assistant, right? Where does he get the balls to do that?\"\n\"It's probably the ex-boyfriend privilege,\" Danny informs, and Stiles' jaw drops.\n\"Him.. and Derek?\" There's a creepily synchronised nod in return, watching carefully as Stiles' entire world reshuffles beneath him. \"But... he's not gay... he's got like, a reputation for sleeping with the model of the week.\"\nThe world slows down to a crawl, as Stiles recalls every single inappropriate, pretty embarrassing thing he said to his boss when he was sure the guy was straight. He wouldn't have openly flirted with him if-\nOh, god.\nLydia mouth twists, and it's all lip gloss and conniving information. \"Actually, his reputation is more like anything with a pulse, but let's not be picky here when Derek isn't,\" she snorts. \"As long as it's pretty, Derek Hale's interested.\"\nStiles decidedly does not feel a slight stab of jealousy that he's the only assistant thus far that Derek Hale hasn't made a move on. Especially now that he knows Derek's not interested exclusively in women. He doesn't.\n\"So he's what, bi?\"\n\"How did you not know this? You're like the worst journalist ever,\" Erica teases.\n\"You knew this?\"\n\"Uh, yeah... who do you think sparked Allison's addiction to TMZ?\"\n\"Huh.\"\n\"Well, we're not being fair,\" Danny, King of all Gossip, interjects. \"Derek hasn't been seen with anyone since he and Jackson broke up, and it was just Jackson before that. Looks like the guy tried to hop the monogamy train and got ran over.\"\n\"Poor baby,\" Lydia croons. \"I'd clearly offer myself up as comfort, if it wasn't awkward as hell...\"\nStiles frowns at her, and Isaac explains. \"Lydia and Jackson used to date.\"\n\"Like a hundred years ago - back when he still thought he was straight. Guess after me, no woman will ever measure up,\" she says flippantly, tracing the rim of her cup with a middle finger. Stiles can't help but find her giant ego somehow endearing.\n\"So what happened? With Derek, I mean,\" he asks, feeling a slight pang of guilt that he's gossiping about his - admittedly - pretty okay boss, but he can't help himself. He's just found out that the subject of many (read: all) of his recent filthy fantasies isn't as completely unavailable as once believed.\n\nNo. Bad thoughts. That's your employer. Your source of employment. The guy making sure Scott doesn't have to look for a new roommate while you learn how to make a bed out of soggy cardboard boxes. Think of Scott.\n\nDanny shrugs. \"Not exactly sure, but the rumour is that the Sex-Tape-That-Never-Existed featured Jackson as co-star. There was never any proof, though. They claimed it was a leak and Bronson Hale paid off whoever was blackmailing them before it saw the light of day. It would explain why Peter got left out in the cold on the will-front.\"\n\"Because Peter had something to do with it?\" Erica asks, riveted.\n\"What an evil prick,\" Stiles spits, frowning at the table as he listens.\n\"Well, there's very little that Jackson does without Peter's say-so. As I said, total speculation and no confirmed sources.\"\n\"You are such a journalist,\" Lydia mocks, elbowing him lightly.\n\"I'm a Reviews Editor,\" he replies, scrunching his brow.\n\"Whatever, stop hiding behind the legal crap when you know it's more than hearsay. You and your little gay gossip mill sees and hears all.\"\nDanny shrugs, smirking. \"I can't comment either way.\"\n.\nStiles has another coffee with Erica after the others leave, taking the time to catch up. It feels like his whole life revolves around Derek these days. This has been the first year Stiles ever missed a Halloween party, but granted, he didn't have much chance to notice; all his time spent ensuring Derek gets to his meetings on time, shows up at the right executive dinners, picking up his lunch and dry-cleaning, and even fielding an adorably panicked call late before the morning of deadline, when Derek freaks that he's deleted the entire magazine before it goes to the printers.\n(He hadn't, and Stiles tried not to laugh as he explained how that wasn't even possible).\nThere's a strange trust building between them, even though a good 70% of the time Derek's still campaigning to be the next Oscar The Grouch, and Stiles is shoving his foot in his mouth for the sake of the small smiles he seems to draw out of Derek. They're getting to know each other, at least professionally, and it hasn't gone unnoticed that Stiles has now replaced Laura as number one on his speed-dial.\n\"So, are we going to talk about the giant crush you're harbouring for your boss?\" Erica, the She-Demon probes. It's seemingly out of nowhere, and sadistically just as Stiles has taken a giant mouthful of Mordor-hot coffee. He swallows the burning fires of hell, and glares at her, eyes watering.\n\"Mean,\" he snarls, only to be met by her satisfied smile.\n\"Don't try to veer off-topic. I've never seen you so protective over someone you've known less than six months. Come on, what's going on?\"\nStiles' eyes widen. \"Nothing... nothing at all. I'm a professional, I'll have you know.\"\n\"So you're pining,\" she sighs. \"Always a healthy approach to any new relationship.\"\n\"I am not-\" he chokes out, before realising this is Erica, and besides Scott, nobody in the world knows him better. \"Okay, so maybe he's the sexiest fucking thing I've ever had the pleasure of cry-maxing over, and he's not as much of a dick as he initially seemed, but that's it. It's a teeny crush, nothing more.\"\n\"Apart from the fact that you just found out he likes boys.\"\nHe attempts to look innocent. \"I'll admit, that was somewhat of a surprise-\"\n\"You were about eight seconds away from leaping for joy-\"\n\"But it doesn't change anything, because he's my boss, and ridiculously, heart-wrenchingly out of my league.\"\nShe gives him a look of sympathy. He hates that look, because it reminds him of Sophomore year when she told him that David had been seen out with his TA. \"Baby, nobody is too good for you. Believe me, if I wasn't with Boyd-\"\n\"Nope..\"\n\"And you liked girls-\"\n\"Nope, not going there...\"\n\"I would totally be all over-\"\n\"Erica. No, we're practically related, you do not get to bring up the idea of us having sex. Ever,\" he shudders exaggeratedly.\nShe's laughing now, her mission to distract him fully complete. \"I know, you're like my tragic little brother.\"\n\"Why are we friends again? You're not even nice to me.\"\n\"My tragic little brother who's in love with his hotter-than-fuck boss.\"\nStiles sags, defeated, and looks at her with a pathetic little crease in his brow.\n\"He's so beautiful, sometimes it makes me want to eat my own face. Or weep and the sight of his.\"\nShe scoots closer and buries her head under his chin, laughing softly. \"I know, Baby. You'll get through this, I swear. Next month you're going to be on to someone else, and I'll still be yelling at you for not having told me. \"\n\"What if I can't get over it?\" he laments, smoothing her hair down and away from his mouth. \"I see him every day. It's starting to infringe on my concentration when he's talking and I'm trying to take damn notes but I can't because of his stupid, flawless stubble and stupid, preternatural eyes and stupid, please-Stiles-bite-me-right-now lips.\"\n\"I can see why,\" she comments, and he sighs wistfully, nodding.\n\"No, Stiles, I can see why. Isn't that him standing by the counter?\"\nHis breath leaves him as he follows her gaze, only to realise that fate is a cruel, cruel mistress.\nThat is, in fact, Derek standing by the counter, waiting for his coffee and dressed only in sweatpants and a criminally fitted tanktop. Biceps Stiles had stroked himself thinking about are now on full display, and are even better than his pitiful imagination had dreamed up. The sweats are so low he can plainly see an irresistible-looking happy-trail into the waist band, and it's all he can do not to openly pant. Derek's sweaty, like he's just been running, and suddenly the urge to weep is warring with what's going on south of Stiles' Avengers belt buckle.\n\"Oh my GOD,\" he cringes, turning to Erica. \"Does he know I'm here? Has he seen me?\" He's trying his best not to look back at the most ridiculously pornographic sight he's seen without actually paying for it. \"I cannot be expected to hold a coherent conversation when talking to that,\" he whines, and she gives him a thoroughly entertained smile.\n\"Um yeah, he was staring at us before he realised I could actually see him. You're both about as subtle as each other,\" she laughs, pressing a kiss to his forehead and pulling his beanie down over his eyes.\nWhen he pulls it back up, Derek is now looking straight at him, an unreadable look on his face. Stiles can't help it; he waves and shoots a nervous smile, which seems to make Derek snap back to reality. His coffee is set on the counter beside him, and he picks it up, looking once again at Stiles. There's an oddly withering glance thrown at Erica before he's nodding once and heading straight to the door.\n\"Shiiiit,\" Erica mutters after the door is closed. \"Dude, I know you're convinced that homeboy's out of your league, but I know a jealous glare when I see one.\" Stiles frowns at her, finally tearing his gaze away from the doorway. \"Is my face melting off?\"\n\"Homeboy? What are you talking about?\" he asks genuinely perplexed.\n\"He's totally got a thing for you, come on.\"\n\"He always looks like that. I showed him a video of a kitten wearing a top-hat and he still looked like that.\" he says irritably. \"Although, granted, that was a little worse than normal.\" He frowns, then, looking back towards the door in thought. \"Believe me, as someone who spends up to nine hours a day with the guy, he's more likely just pissed that I have actual friends outside work,\" he points out, raising a brow. \"He's surprisingly needy.\"\nStiles knows this because Isaac does, and Isaac knows this because Laura and Isaac speak like best friends more than employer/employee. Stiles had entertained the idea of being Derek's BFF, but soon after decided that BFFs don't fantasize about giving each other blow jobs.\nErica shakes her head, smirking in that Oh, Honey way that the women in his life seem to be so good at, and pulls his hat down again.\n \n \n \n\n\nII\n\nOn Monday, after an entire weekend of trying to figure out if Erica's imagining things, Stiles gets his answer, because Derek acts shifty the entire day and bails on their tutoring session for, what he informs Stiles rather gruffly is, a date.\n\nA date.\n\nYeah, seems real hung-up over Stiles, alright.\nHe decides not to go down the road of trying to figure out if it's with a girl or a guy, because that way leads insanity, but instead spends the evening voluntarily playing third wheel to Scott and Allison when she comes over for pizza and 80s movies. He spends the first half of Back To The Future resolutely telling them that nothing is wrong.\nOn Thursday he's at his desk, spending the tail-end of his break texting Allison about Scott's upcoming birthday celebrations and laughing at the prospect of bringing him to a drag show, when a shadow appears over him. It's Derek, and oh, hey, the glaring's back.\n\"Shouldn't you be, I don't know, filing or something?\" Derek asks, dripping sarcasm. He's been like this all week, date or not, and Stiles certainly hasn't been wondering who the hell goes for a date on a Monday anyway.\nStiles darts his gaze to the clock on his monitor, barely acknowledging the Cloud of Grump which is his boss. \"Still got five minutes left, man. Just let me finish this text to Allison.\"\n\"We're not paying you to text your little girlfriend, Stilinski,\" is the gritted reply. He'd stopped calling him 'Stiles' on Monday, apparently. Stiles wouldn't really know, because it's not like he obsesses over things like that, or anything.\n\"I need you to pull up the interview from last year with Kings of Leon.\"\n\"It's already on your desk, Derek,\" he grouses, frowning up at him. Shit, they're like, two colours, maybe three. Damn it, stop staring lovingly into your boss' eyes you idiot. \"And... 'girlfriend'?\"\nDerek straightens up, looking off to the side. \"I assumed... the girl you were with in the-\" he starts, before huffing. \"It doesn't matter, I need to get back to work.\"\nStiles is still squinting into space when the realisation comes to him. \"You think Allison is Erica, and Erica is my girlfriend?\" he asks, twirling his finger as he connects the pieces. Derek's already beginning to walk away as Stiles' brain catches up. He laughs, causing Derek to freeze and shoot a glare over his shoulder. \"Dude, Erica's practically my sister, and Allison's disgustingly in love with my step-brother. Also? I'm gay. I thought you knew that.\"\nDerek's face registers what can only be described as shock before he trains it into indifference.\n\"Your personal life is of no concern to me, Stiles,\" he says stoically. \"And your five minutes are up.\"\n...\n\"I would do dirty, dirty things for frosting this good,\" Stiles moans.\nHe's sitting on his desk, feet planted on his swivel-chair, and it must be fucking Christmas or something because Lydia has just placed half a box of cupcakes in front of him. Turns out that sending someone at Alpha baked goods is not the way to show appreciation - Sandra had pulled a disgusted face and told Lydia to get rid of them, which, well... she didn't have to go very far. He's half-way into his second one and it's so good he thinks he got just a tiny bit aroused.\n\"Questionable things,\" he elaborates. \"Things that are illegal in twenty-seven states.\"\n\"Oh my god, it's like you've just discovered that it feels good when you touch yourself,\" Lydia grouses, rolling her eyes before staring at the cupcake in his hand. Stiles gives her a calculating look.\n\"Jealous?\"\nShe darts her gaze back to him, flicking her hair back over her shoulder. \"Don't be ridiculous. I'm on a cleanse. Get chunky all you want, see if I care!\"\nStiles fakes indignation \"Chunky?\" he flails, as she gives him a challenging nod, stepping backwards. \"I'll have you know that this bod is a gift from Mother Nature herself. In fact, I'll just sit here and enjoy my half a box of cupcakes and revel in the fact that you can't have any.\"\nShe's already walking away when he finishes, but he goes back to destroying the thing of beauty in his hand. He closes his eyes, moaning loudly for Lydia's benefit.\n\"Hnnnng, it's so fucking good,\" he says, grinning around the sponge, \"It's better than sex!\"\nOf course, this would be the moment Derek chooses to arrive back from his three o' clock. He's standing off to the side silently when Stiles opens his eyes, like some huge creeper, and all he can do is freeze with his last bite mid-way too his mouth.\n\"Hope not,\" Derek says, taking in the picture Stiles makes with a masked look of disapproval. He supposes he could be looking a little more professional and business-like right now.\n\"Huh?\"\n\"You said it's better than-\" he starts, before he kind of lets his eyes wander away and shakes his head. It's the most they've spoken in a week that wasn't about work. \"Nevermind. \"Where did those come from?\"\n\"Sandra in Fashion got them from,\" he closes the box, reading the card slotted on to the outside. \"Adam Levine? Ugh,\" he says pulling a face. \"I wish they weren't so good, now.\"\n\"Not a fan?\" Derek enquires, doing that begrudgingly interested thing again.\n\"I prefer my bands where the whole band is the focus and not the guy douching it up out front.\"\nDerek nods, a slight smirk pulling at his stoicism. \"Didn't know you were such a music critic.\"\n\"Well it is my chosen vocation. Believe it or not, this wasn't my planned career when slogging through a degree and killing myself with deadlines.\"\nThere's a thoughtful expression on Derek's features then, and Stiles goes back to organising the remaining cupcakes by flavour and colour. He watches curiously as Stiles concentrates, letting the quiet calm that comes over him when he finds focus tune out the last vestiges of embarrassment. He picks up one and holds it out\n\"What?\" Derek says flatly, eyeing the treat like it's going to explode in his face.\n\"I believed I promised obesity in your future. Cupcakes could be a leading factor in that.\"\nDerek shakes his head. \"I'm good.\"\n\"Dude... the frosting alone-\" he says, pulling it back towards him and smelling it. \"It's like sweet, buttery crack.\"\nHe rakes a finger through the blue swirl, burying it in his mouth before pulling it out with an audible pop.\n\"Sweet Willy Wonka...\" he mutters, going back for more. Out of the corner of his eye, he sees that Derek's focus is fully and unrelentingly on the finger disappearing past his lips. He's got him. \"You know you want a taste, man.\" Derek gulps, saying nothing until Stiles cocks one eyebrow. \"Don't you?\"\nDerek meets his eyes at last, blinking twice, three times before leaning over and pulling a vanilla cream out of the box on Stiles' lap.\n\"Fine,\" he says.\nStiles can't help but smile triumphantly as he disappears back behind his office door. When he comes back out later and says goodbye for the day, there's yellow frosting on his upper lip.\n...\nIt's two weeks later, and Stiles is IMing with Erica while Derek's in a meeting.\nER: so how's operation I'm Not In Love With My Boss coming?\nStiles rolls his eyes before replying.\nSS: I'm not in love with him. I just find him aesthetically pleasing. In my pants.\nER: so I imagined the fact that you blew off Beer Jenga night with Scott and Boyd on Thanksgiving weekend to go and help him with layout shit?\nSS: we were on a deadline! I have to keep my job, you know.\nER: at 8.30 on a Friday?\nSS: shut up, Erica.\nER: you looooove him. *hearts*\nSS: ERICA!\nER: it's ok, he looooves you too. *hearts* *hearts*\nThe next thing to come through is a crudely-drawn Paint file, which is revealed to be two stick figures, one with glasses, one with scowling brows, biceps and pecs which look alarmingly like breasts, holding hands and surrounded by love-hearts. Stiles is still laughing into his hands when Derek appears, frowning over his desk. He's been slightly less of an irritable dick this week, but Stiles can't help but feel like any progress they'd slowly been making has taken two steps back. They still know next to nothing about each other, and he finds himself slightly jealous of the relationship between Isaac and Laura, who are almost too close.\nHe flails once he sees him, moving to click out of the conversation before he decides to get curious about Stiles personal life which is none of his concern and peer at the screen.\n\"Something funny?\" he asks, brow raised, but with less of a glare. He's still so ridiculously attractive that the urge to nuzzle his face is as strong as ever. The stubble looks fun.\n\"Stupid web comics, you know,\" he breezes, picking up his frappucino which is now more liquid than anything. \"Meeting go okay?\"\nDerek nods, jerking his head towards the office for Stiles to follow. \"Yeah, Laura reminded me of some things, though,\" he says cryptically, taking a seat behind the desk.\n\"Oh?\" Stiles frowns, not sure where this is going. He sips on the straw of his drink, waiting expectantly for Derek continue, but all he seems to be doing is stare at Stiles' mouth. \"Derek?\"\nHe jerks slightly, clearing his throat as he braces both palms on the desk. \"Yeah, right...\" he says, collecting his thoughts. \"She said that she promised you that you'd get some experience for your resume, and so far it's been nearly three months and you haven't gotten any.\"\nHis brows rise - he'd kind of assumed that they'd forgotten about that, but it's a pleasant surprise that Laura, goddess of all that is great in his life right now, didn't let it slip her mind.\n\"Wow, yeah, that'd be great!\" he says, gesturing his hands out in disbelief. \"Feels like forever since I got anything published.\"\nDerek's mouth twists. \"Well, actually, the first assignment doesn't come with a byline,\" - Stiles smirks, because he totally taught Derek what a byline is - \"But you're gonna be heading out to a listening party with Kings of Leon.\" He looks up, gauging Stiles' reaction. \"You like them, right?\"\nStiles gapes, brain trying to catch up. \"Uh, yeah - how did you know that?\"\nThere's an awkward shrug. \"It's your ring-tone. Um... one of their songs?\"\nHe laughs, because he'd assigned Sex On Fire to Erica because of that time she thought she had Chlamydia in college. They're not his favourite band, sure, but it's kind of fucking endearing that Derek noticed enough to care.\n\"Sure, I like 'em,\" he smiles.\nDerek looks extremely pleased with himself. \"Good. You're heading there tonight with Danny from the entertainment section around eight fifteen.\"\n\"Danny's coming? Awesome!\" he beams, \"I love Danny. That's even better.\" The pleased smile on Derek's face dims slightly.\n\"Um, okay,\" is the mumbled reply. \"Lydia's going to drop a pass by your desk later. I, uh, hope you have fun.\"\n\"Great! Thanks, man,\" he says earnestly, already pulling out his phone to make everyone who cares jealous of his awesome life, and just gets a quiet nod in return. It's uncomfortable for a moment, and Stiles starts to back out of the office slowly.\nDerek nods, refusing to look up from the desk.\"Sure.\"\n..\nDanny parties like a motherfucker, even on work nights, and Stiles learns that the guys from Kings of Leon are chill as fuck.\nHe's nursing one sneaky little bastard of a hangover the next morning, when Derek walks by his desk without a word. There are about a thousand other things Stiles would rather be doing than running errands - top of the list is lying face down on the floor and making dying frog noises - but the guy did give him a sweet opportunity, and it's Friday. Only eight more hours until freedom.\nWhen he brings Derek his coffee, he realises he's not the only one worse for wear - Derek has dark circles under his eyes, is squinting at his monitor like its mission in life is to hurt him, and is chugging water like he's just come first in a marathon.\n\"Man, I thought it was just me and Danny who felt like we've been trampled by a herd of wildebeest. Serious sympathy for Mufasa right now,\" Stiles quips, setting the coffee - cinnamon and caramel - down on Derek's desk.\nHe doesn't say anything, but there's a soft grunt before Stiles launches into the day's schedule. It's not too bad, but right now anything that isn't lying down and crying into a pillow sounds like torture. When he finishes, Derek's watching him from the corner of his eye.\n\"Anything you need before I head out for your dry cleaning?\"\n\"Have a good time last night?\" he mutters, not exactly looking interested, but Stiles has been around the guy long enough to know when he's fishing around for information.\n\"Oh my god, the best! I had no idea Danny was so crazy! After the press bit we-\"\n\"Good,\" Derek cuts in, before Stiles gets to tell him about Danny getting hit on by one of the band's agents - Gloria - and using his masculine wiles to wrangle an invite to the secret show that weekend. \"That'll be all, Stilinski.\"\nDerek's already reverted to glaring and grumpy cat impressions by noon.\nDanny stops by while Derek's off seeing Laura for the obligatory I'm-dying-please-tell-me-you-are-too update. Or maybe it's just a last-night-was-awesome-let's-reminisce talk? He looks impossibly smug when Stiles glares at him from under the over-iced Coke Zero (third one today) pressed to his forehead\n\"Dammit, man, can you at least try to look like you're feeling as disgustingly bad as I am?\" Stiles whines, because Danny looks like he barely missed an hour's sleep. There's a small bottle of eye-drops deposited on to his desk as he grumbles, and Danny points to it.\n\"Secret weapon. Your eyes look like you washed them out with bleach or injected heroin straight in there.\" He waves his hand in front of Stiles' face, and is sudden vertigo a thing?\nHe gets a particularly cold Stilinski glare in return. Stiles likes to think it's the same one his dad uses in interrogations, but Allison usually laughs and kisses his cheek when he inflicts it on her. Maybe he should ask Derek for pointers on looks-of-death.\n\"Well excuse me for not being able to look good after five hours' sleep and four Jagermeisters. Night cap? I was already two rum and cokes deep, man.\"\n\"It was five, and you're still alive aren't you? Anyone would think you'd never been to college,\" Danny grins. \"So, ready for round two tomorrow night? We have to be at the Highline Ballroom at ten to get in, and you need to wear something that doesn't have a cartoon character on it.\"\nStiles rolls his eyes, not bothering to correct the fact that The Flash is on no planet simply a 'cartoon character', but gives a reluctant nod, just as he spies Derek arriving back. He's wearing a black sweater over his shirt and tie today, and Stiles is pretty sure that Shannon from Editorial just walked into a desk from craning her neck at how fucking delicious he looks.\nStiles feels Shannon's pain.\n\"Sure,\" he says, only marginally distracted, \"But you'll probably have to call me at seven because once I get home I'm going to sleep until then.\"\nDanny laughs. \"Alright, lightweight, I'll call you tomorrow so we can talk about it when you're less woe-is-me.\" There's a judgemental raise of his brow as Derek reaches the desk beside him. \"Anyone would think I'm forcing you to come out and spend time with me.\"\n\"I'm perfectly okay with being a shut-in, thank you very much,\" he gripes, letting his gaze slide over to Derek, who is making a piss-poor attempt at nonchalantly listening in. \"Hey, Chief, ready for lunch?\"\nHe's studying Danny contemplatively as he nods. \"Yeah.\"\n\"'Chief'?\" Danny asks, and Stiles shrugs, a twist on his mouth.\n\"Yeah, thought I could pull that off, but it came out a little too Jimmy Olsen, right?\" he cringes, earning an amused nod from Danny and concurring grunt from Derek.\n\"Alright, looks like you need to do some actual work. I'll see you tomorrow - I'm done for the day at two,\" Danny informs with a smirk, because he's an asshole.\n\"I hate you,\" Stiles groans, and Danny just laughs.\n\"Stop lying to yourself, Stiles.\"\nHe's gone after that, and Derek's still hovering around, just looking. Stiles flinches back to action once he remembers that he's actually getting paid to be here.\n\"Okay, I was thinking of picking up a Franco's today. Something about a gourmet meatball sub on a Friday gives me heart-flutters,\" he smiles. Derek just shrugs and makes his way back towards the office.\n\"Whatever.\"\n...\nThey're hovering around the back of the crowd, waiting for the band, and Stiles is actually having a pretty great time. It's almost midnight, he's barely tipsy, and Danny's a lot of fun - even when he's not pouring drinks down Stiles' neck.\n\"So you wanted to get into music journalism after you graduated? How come you took the job at Alpha?\" he asks, sipping his drink and looking at Stiles like he's the most interesting person in the room\nHe shrugs. \"Well, it started out because I needed the money... now, though? I don't know, I guess I like it there. Most of the people still look at me like they're not sure how I function... but I'm sort of used to that.\"\nDanny's dimples are back full-force as he leans against the bar. \"Yeah, you're pretty unique, alright,\" he says.\n\"I'll take that as a compliment,\" Stiles smirks.\n\"It was meant to be,\" Danny replies easily, as if people say stuff like that to each other all the time.\nStiles busies himself with his drink as he contemplates whether he's still terrible at realising when he's being flirted with. Sometimes, he wishes people would just come out and say 'I like you and want in your pants', because one can never really tell.\n\"So how come you're not seeing anybody?\" Danny enquires, breaking his concentration. He's standing close and contemplating Stiles with a soft smile on his face. It's not unpleasant, but he can feel his cheeks flushing slightly under the unusual scrutiny - Danny is gorgeous, and it's not like Stiles hasn't noticed. He gapes for a few seconds before shrugging shyly.\n\"Don't know, man. Guess nobody's realised how fantastic I am yet,\" he jokes, because it's downright depressing that Stiles' last steady relationship was in sophomore year of college. \"One day my prince will come.\"\nDanny rolls his eyes, giving him a light shove as he turns back towards the stage. In his pocket, there's an insistent vibration which Stiles is just now realising is his phone, and not the final sound-check going on in front of them vibrating through his pants. He frowns at the screen - it's Derek - and he holds it up to Danny with a scowl as the crowd begins cheering. The band's about to come on, so Stiles points towards the smoking area with an apologetic look on his face. Danny just shrugs and gives him an easy smile.\n\"Derek?\" Stiles asks as soon as he answers, trying to keep the irritation out of his voice. It's Saturday night, dammit, and it's not like Derek's been inviting any favours with the way he's been acting since Thursday. \"Why are you calling me?\"\n\"Is this Stiles?\" and unfamiliar voice says, and his heart starts pounding.\n\"Yeah, who's this?! Is Derek okay?\"\n\"Don't worry, technically he's fine - just drunk as shit,\" the guy snorts, and Stiles frowns. \"I'm Ben, I bounce at Narnia, in the Meatpacking district?\"\n\"Sure, I know it,\" Stiles replies, now more confused than anything. It does not escape his attention that Narnia is a gay club, either. \"Why are you calling me, Ben?\"\n\"Because your friend Derek tried to get in tonight, but he's so wasted he can barely stand and there's nobody with him.\" Stiles finds his body relaxing a little, but it still doesn't clarify why this guy's calling him. \"He got a little mouthy too, but I know him through some mutual people, so I didn't really want to have to call the cops on him,\" Ben explains, and Stiles' confusion ebbs away. \"He's coming around, but it'd be great if someone could take him the fuck home.\"\nStiles sighs wearily as his hand finds his hair on reflex. \"Sure, I'll come get him, he's safe, right?\"\n\"I've got him propped up inside the doors, it's fine. Just ask for me when you get here.\"\nHe sends Danny an apologetic text on his way, explaining what's going on and feeling like a complete asshole. After a few minutes, the reply comes.\n\nFrom: Danny\n\n\nDon't worry about it, Cinderella. Shouldn't have asked if you're seeing someone...Clearly you're already in an extremely serious relationship. ;)\n\n\nTo: Danny\n\n\nDerek? Please. It's professional.\n\n\nFrom: Danny\n\n\nNobody ditches a night off for a favour, no matter how much they're getting paid. I know married people who wouldn't do it. It's okay, I'll keep your secret...\n\n\nTo: Danny\n\n\nThink you're clever?\n\n\nFrom: Danny\n\n\nHey, my sort-of date bailed on me for another guy. I'm allowed to interfere a little.\n\nStiles hadn't been aware that it was even kind-of-a date, but then again, Danny hadn't written it across his forehead in red marker.\n\nTo: Danny\n\n\nNothing's happening with us, but I'm sorry, man. :(\n\n\nFrom: Danny\n\n\nNothing YET. And it's fine. Go pick up your boozy floozy.\n\n\n..\n\nDerek has his head resting back against the wall and looks oddly pleased for someone with a busted lip. Stiles throws a glare at Ben when he comes to a stop in front of him, crouching to get a better look at the cut, and Derek fixes his eyes on Stiles' face.\n\"Thought you said he was fine?\" Stiles demands, straightening back up and gesturing towards Derek, who's just watching the flail of his hands lazily. Ben is around the same size as Boyd, but it doesn't mean he should get away with hitting anyone.\n\"I said he was drunk and mouthy,\" Ben shrugs. \"It's not my fault he talked someone into socking him in the face before I got to him.\"\n\"Stiiiiles,\" Derek slurs, swaying forward in his seat to pull Stiles' attention away, and fix his eyes on him again. They're definitely two different colours; brown leading outwards into blue-grey - like Derek Hale needed any more defining characteristics to enhance his looks. He's devastatingly gorgeous in pressed black pants, a white shirt and black skinny-tie, but worst of all is the leather jacket. Stiles never told anyone about his classic bad-boy fetish, but with the tousled hair and stubble...everyone has to have a self-destructive tendency, right?\nDerek points an accusing finger towards Ben. \"They wouldn't lemme in to thuh-\"\n\"I know, man,\" Stiles sighs, completely sober after the cab over here - which he's totally charging to the company on Monday - and still feeling guilty about Danny. \"Come on, I think you're done for the night.\"\nThere's a small crease between his brows as he looks up, and his gaze is wide but sleepy, like freakin' Boo from Monsters Inc. \"B'you just got here. Don'tcha wanna stay?\"\nStiles doesn't think it's fair that Derek manages to be sexy as all hell some days, and remind him of the cutest Pixar character ever on others. Like he could even stand a chance against that face.\n\"I want to make sure you get home safe, is what I want,\" Stiles says irritably, wrapping Derek's arm around his shoulders and grabbing his waist. It's completely inappropriate how distracted he is by the thickness of the arm and how warm and firm Derek's torso feels under his jacket, but powering through is a little difficult. Especially when he looks up, and Derek's smiling dopily down at him like he's a really nice present he wasn't expecting. He rolls his eyes, throwing Ben a wave of thanks as they're let out the door of the club to the waiting cabs\n\"You're a good guy, Stiles,\" Derek observes, and Stiles looks back up to see him now watching fondly. They're so close that Stiles can smell the whisky on his breath as it blooms over his face.\n\"Yep, so I've heard,\" he says tightly. making their way to the top of the queue of taxis.\n\"I told that guy... that guy Ben? I said-\" Derek begins, his head lolling with emphasis on his sentences. \"I said 'call Stiles'. Because he'll get me. Stiles is awesome-\" he stops to raise his brows earnestly at him, \"'Cuz you are...like like Batman.\"\n\"Christian Bale's Batman?\" Stiles asks, trying to keep Derek's attention while he manoeuvres him around. He actually looks thoughtful for a second. \"Kinda.. little Adam West too, though. No Clooney.\" He actually seems to find that funny, and the dopey grin becomes amused.\nThe bad mood Stiles has been in threatens to lift at how earnest Derek sounds, stalwartly maintaining eye contact now (and seemingly there's at least a passing interest in Batman, which, ugh), but he shakes his head as he sets the inebriated idiot down on the back seat. He then circles around to get in the other side, closes the door, gives the driver Derek's address and turns to him.\n\"Damn right, I'm Batman. I'm already giving up any hopes of a love life to help the poor, drunk-off-their-ass citizens of the city,\" he grouses, but Derek's frowning through the windshield.\n\"Takin' me to my home?\" Derek says, his head cocking to the side. Stiles wrinkles his nose, holding out his hands.\n\"Well, yeah. I'm hardly taking you to my home,\" he responds, and Derek's brows lift. \"Dude, I live in Brooklyn, why the hell would I take you there?\"\n\"Dunno,\" Derek shrugs. before seeming to realise what Stiles had said. He leans his head back on the seat and sends a sour look out of the corner of his eye. \"You were out with uh,\" he says, \"with Danny,\" like the name tastes bad.\n\"Maybe? I thought it was none of your business.\" Stiles retorts stiffly, because there is no way Derek dislikes Danny - everybody loves Danny. There's a shrug in response.\n\"'S'not,\" he says, turning his face out the window. \"He called The Flash a 'cartoon character'.\" There's several minutes of silence while he mulls over that one, and where he thinks Derek's fallen asleep. Suddenly the drunkard turns, regarding him curiously, and then cocks his brow. \"Still came, though.\"\n\"Huh?\" Stiles replies, realising that without alcohol, staying up past one a.m. isn't all that easy anymore.\n\"You came,\" Derek says, closing his eyes. That jawline is worthy of sonnets, and Stiles tries not to let his gaze linger too much, but Derek's face relaxes in sleep in a way that doesn't seem possible when he's scowling. It's impossible to look away. \"Came t'get me.\" And then he's out.\nWhen they pull up outside Derek's Upper East Side apartment building, Stiles helps him out of the cab, pays the driver, and introduces himself to the door man. He's never been here before, but figures this might not be the last time he has to visit Derek at home.\n\"Yes, you're already on the list for approved access, Mr. Stilinski,\" Doug, the elderly guy says, shooting Derek a glance as he sways on his feet. \"It's nice to see someone taking care of him.\" Derek's already standing by the elevator, trying to shrug off the leather jacket that Stiles will probably imagine tugging on the collar of later when he's alone and it's safe. \"There's been a lot of unsavoury sorts swarming around him lately,\" Doug confides.\nStiles wasn't aware anyone used the word 'unsavoury' any more, but it's pretty sweet how concerned the guy seems. He smiles warmly and makes his way to where Derek is stabbing the button repeatedly and grunting at it, trying to make the elevator speed up.\nThe door opens and he walks in, turning to Stiles, who is following. \"Coming up?\" he says, swaying and still not quite on top of the whole walking thing yet, but his speech is clear. Stiles nods.\n\"I have to make sure you get in okay, don't I?\" he says, a little harsher than he means to and turns to face the doors. Derek is staring again. Stiles lets it go for a few minutes before the tension gets to him, and he glances back. \"What?\"\n\"You gonna stay?\" Derek asks, and he's looking at Stiles, openly cataloging his face and his body in a way that can only be interpreted as want.\nThe doors open, and he steps backwards out of the elevator into a beautiful, avant-garde foyer. It's not quite minimalist, but still modern, masculine and lived-in, and there's raw art on the walls instead of ornate frames. One wall has been stripped bare to the brick-work, giving the place a loft-like feel, and the furniture is plain and functional, but looks comfortable. There are books everywhere, shelved in different cubbies and in cases. Of course, it's the penthouse, and Derek's got the entire floor. Stiles finds himself involuntarily entering; the sights of that stunning apartment and the gorgeous man within - who is now dropping various pieces of clothing as he walks - taking over control of his feet.\n\"This place is-\" he turns his gaze away as Derek gets down to his undershirt and grabs the hem. \"Dude, what are you doing?\"\nIt's looking dangerously like a strip-tease and Stiles is dangerously close to fainting.\n\"Gettin' ready for bed,\" he says easily, giving Stiles another one of those looks, but he drops his hands. \"You're staying, right?\"\nStiles jaw gapes. \"Um, I wasn't planning on it,\" he replies. voice tight, and Derek takes a deliberate step closer.\n\"Why not? Want you to,\" he says, breath on Stiles' face, letting his mouth quirk up on one side, an expression that makes his heart pound - but it feels wrong. The whole thing feels too easy, planned. Does everything in Derek's life come like this?\n\"How did you know I was out 'with' Danny tonight?\" he asks as Derek reaches a finger up to lightly trace his cheekbone, and the dopily pleased expression melts back into confusion. He pulls his hand away.\n\"Y'told me?\"\n\"No, I didn't - because I wasn't even aware it was a date until I was on it.\"\nDerek takes a step back and throws out a shoulder; a defensive shrug . \"Guess I heard him talking to you...at the office? Sounded like a date, I dunno... look, you gonna stay?\"\n\"People don't say 'no' to you very often, do they?\" Stiles blurts, instantly cringing that he'd voiced the realisation the second it went through his head - but there was something in it. Derek had taken Stiles away from what he knew was a date, and been in the kind of situation where he couldn't be left by himself, all so Stiles would look after him. With his looks and money, it didn't seem like Derek was ever turned down much, and he used it to his advantage - like he was trying to now.\nDerek's face darkens. \"'S that supposed to mean?\"\n\"Why am I here, Derek? You've had me all over this island tonight and now you want me to stay... but why?\"\nThere's a pregnant pause while Derek just blinks at him, microexpressions forming on his face as his mouth begins to form aborted words. After a strange second where Derek's eyes roam over his face, he shrinks backwards to lean on the back of his couch. \"This place is too big.\"\nA frown covers Stiles' features for a beat, and he shift his feet, closing his arms. \"What are you talking about?\"\nA look of pain comes over Derek's face and his mouth contorts in thought. \"Bought this place for me and Jackson. Thought we-\" There's a heavy sigh, and then he's looking at his feet. \"B'he's not here, and I fucking hate coming home when he's...\" he trails off, squeezing his eyes shut and buries a hand in his hair. He 's still slurring a little, the more he talks, and swaying where he leans. \"I'm so fucking drunk.\"\nThere's something melting inside of Stiles at the display, and he finds himself unzipping his jacket, taking it off and laying it over the back of the couch. Derek watches him with interest, eyes darting back up to his face with a question in them.\n\"If you're lonely, all you had to do was say.\"\nDerek's eyes squeeze shut and he shakes his head. \"'m not lonely, I-\"\n\"Do you want me to stay, or not?\"\nDerek is quiet then, just giving him a curt nod of agreement.\n\"Okay, then. But there's no funny-business. I'm a person of virtue - plus I'm mainly here to put you to bed and make sure you don't attempt to go back out and pick up some loose-moraled socialite. You can't be trusted.\" Derek pulls a face, and Stiles is only very slightly disappointed that he doesn't protest the no-funny-business rule. Slightly.\n\"Hmm, thanks...\"\n\"Which way's your room?\"\nWhen Derek collapses on to the bed, miraculously wearing clothes, he thanks Stiles genuinely.\n\"Sorry...ruined your date,\" he murmurs sleepily, but Stiles doesn't correct him. So maybe he'd realised he wasn't exactly into Danny like that, but it was still wrong of Derek to interfere. \"Went out t'see some friends, but he was there. 'S like he got 'em all in the divorce.\"\nStiles frowns, and his brain slots together the fragmented pieces of information Derek's drunk mind is revealing.\n\"So I just started drinking, wasn't really thinking straight,\" he says, shifting in the sheets. Stiles is just hovering near the light, not ready to turn it off when this is the most information that's been volunteered in all the time they've known each other. \"I like you, Stiles. Even though I don't get you, mostly.\"\n\"There's not much to 'get',\" he replies confusedly, watching Derek's face even out into sleep.\nHe gives a half-hearted shrug. \"Thought I got Jackson. Was wrong. He jus' wanted my sister's...wanted my job.\" There's a span of silence punctuated by Derek's relaxed breaths, and he moves his arm up under the pillow. \"Thought he loved me.\"\nStiles isn't sure what he's supposed to say, but doesn't get much of a chance before Derek drifts off to sleep.\n...\n\"I deserve a fucking medal,\" he groans the next morning, as Allison sets breakfast down in front of him. Scott's sitting opposite, already shovelling bacon into his mouth and chewing with all the grace of a llama.\n\"So you just slept on the couch?\" she asks, pulling out the chair next to him and sitting down. \"Wasn't it awkward when you woke up?\"\nStiles is sheepish. \"Well, I kind of bailed before daylight, just left some aspirin and water by his bed and a got the fuck out of there.\" She gives him a disapproving look over her coffee cup. \"I didn't want him to be embarrassed!\" he flails.\n\"Won't it be kind of weird when you go to work tomorrow?\" Scott asks, pointing out the obvious as usual.\n\"Very weird,\" Allison agrees, turning back to Stiles. \"How are you going to handle this?\"\n\"I thought I'd just ignore it and see where that gets me...\" Even Scott looks judgemental now. \"Alright, so I didn't really think that far. I'm just going to see how he sets the tone and take his lead.\"\n\"Well at least you didn't let him bone you,\" Scott, ever Mr. Brightside, points out. He squints. \"You sure you didn't let him bone you?\"\nStiles is aghast. \"Dude! Give me some credit - I actually want to keep my job.\"\nScott holds up his hands placatingly. \"Just checking. I mean, come on, you've talked about nothing but how hot this dude is for months.\"\n\"The sexual tension alone must be choking your co-workers,\" Allison teases, but Stiles shakes his head.\n\"Totally not like that,\" he maintains, \"It's not like we're Bond and Moneypenny.\"\nScott gives him an excited grin, chuckling. \"Dude, you're totally his Miss Moneypenny!\" he says, eyes wide like the world just finally started to make sense. \"You're the only one who won't sleep with him even though you're dying to.\"\nStiles rolls his eyes, begrudgingly proud that Scott made the connection all by himself, as Allison joins in laughing.\n\"Come on, guys, he's actually a pretty good guy... I think. I didn't wanna fuck things up and sleep with him just because he didn't feel like going home alone one time. Even if he was totally DTF. I have some self-respect.\"\nAllison smirks. \"So tell us again about how you figured out his brand of cologne?\"\n\"You're a mean one, Ms. Argent,\" he grouses, betrayed.\n...\nIt turns out that weird, overly-revealing conversations are the least of their problems on Monday, when Stiles meets a thoroughly-freaked Isaac by Lydia's desk.\n\"What's with the security detail?\" Stiles asks, approaching them. \"Bomb threat?\"\n\"Someone broke into Laura's apartment last night. They're checking the office to make sure nothing happened here,\" she supplies.\n\"Shit, that's gotta suck. She alright?\"\nIsaac nods. \"She wasn't home, but nothing was stolen, so the police think they were there for her, and not your average burglary.\" He gives a shrug, eyes wide. \"Cameras didn't pick up anything, and it was when the security in her building went on break, so it looks like whoever it was planned it out.\"\n\"Alright, officially creeped out,\" Stiles shudders. \"They have any leads?\"\n\"Not that we've heard,\" Lyda informs. \"Ugh, it's like just when things here have settled after Mr. Hale, this happens.\"\nLaura passes then, talking quietly to Derek and giving the three of them a wan smile. Derek follows her gaze, quickly averting it when he sees Stiles and following his sister through the foyer.\n\"What was that about? And was that a busted lip?\" Lydia probes, eyeing Stiles in that if-you-dare-lie-to-me-I-will-hurt-you way.\nStiles mouth dips on one side. \"Uhh... nothing?\" Isaac folds his arms and leans back, a small frown on his face. \"Alright so I may have had to go pick up a certain drunk Editor-in-Chief on Saturday night and put him to bed. I think he's having flashbacks.\" He takes in the gleeful expression on Lydia's face and points at her warningly. \"And if you so much as breathe a word I will replace all your shoes with Crocs. Do not test me.\"\nShe smirks and holds up her hands. \"Fine, chill. I won't say anything. So is that all that happened?\" she probes, and the image of Derek leaning over him, almost nose-to-nose filters in and out of his mind.\n\"Yep,\" he replies tightly. \"I guess he's just kind of embarrassed.\" Lydia doesn't look sold, but the phone's ringing and she leans back in her chair to answer it. Stiles avoids Isaac's curious expression and makes his excuses to leave.\nDerek's talking to one of the new security agents when Stiles brings his coffee, and he nods distractedly as he sips at it. He looks stressed and uncomfortable, and the look on his face is one that Stiles has come to really hate.\nWhen the guard leaves, Stiles takes the opportunity to ask about Laura.\n\"She's pretty shaken up. I guess she was lucky. I just wish the fucking cops had more to go on,\" he snarls, fierce protection coming out in his voice.\n\"My dad's a detective,\" Stiles volunteers. \"I'm sure they're doing everything they can.\"\nDerek looks slightly ashamed as he nods. \"Yeah, sorry. I just don't like this. It's just me and her, you know?\" he says, slumping into his chair. Stiles nods, understanding. For a long time, it was just him and his dad before he married Melissa, and Stiles spent too many sleepless nights waiting for him to get home.\n\"You weren't there when I woke up yesterday,\" Derek says, his gaze drawn to the computer.\nStiles scratches the back of his head nervously. \"Uh yeah, I had to get home, you know? Plus, I wasn't sure how much you'd remember, and I didn't want things to be...\" he trails off, and Derek nods, mouth pulled taught.\n\"Yeah. Thanks, though, for... you know.\"\n\"Sure, it's my job, right?\"\nDerek looks at him. \"Right.\"\n...\nHarris is on the warpath when he shows up at Stiles' desk a week later.\n\"Are you completely fucking incompetent, or did you just screw your way into this job like every other assistant Hale has?\" he demands, and Stiles can do nothing but blink at him as everyone passing by stops to look.\n\"Excuse me?\"\n\"The Dior files,\" he grounds out, like Stiles is deaf or maybe just stupid. \"Finstock in Accounting and I were supposed to have a copy of the amendments a fucking week ago, they tell me, and we never got them because they came in through this office, and you, you little prick, never sent them on!\"\nStiles is just frowning in shock when Derek steps out of the office. \"What the hell is going on?\" he booms, causing Harris to bolt upright.\n\"I'm exposing your little secretary here for the dumbass he is. We're being threatened with legal action from one of the most important accounts we have for breach of contract,\" he seethes, stabbing the air by Stiles' face.\nDerek frowns, throwing a disbelieving look towards Stiles. \"Which account?\" he asks.\n\"Dior. Even if they don't sue our asses, we're probably going to lose thousands of dollars in advertising for one monumental screw-up,\" Harris fumes.\nDerek's face pales, and he pulls a hand to his forehead. \"Holy shit- It isn't Stiles' fault,\" he says, eyes glazing over and a pinch appearing in his brow. \"I finished with the contract and sent them on to Finstock's assistant myself - I must have forgotten to CC your department in the mail... It's my fault, my screw-up.\"\nHarris gapes, not exactly brave enough to insult his boss, and the CEO's brother. Still, Greenberg was so getting chewed out for this. He should have at least gotten the contract - and caught the mistake and sent it on to Legal.\n\"Stiles, get me on the phone with them right away, I'll see how I can handle this,\" he says distractedly, before turning to Harris once more. \"But you? Where the fuck do you get off speaking to another human being that way? Regardless if we dropped the ball, shouldn't someone from Accounts or Legal have followed up on the contract before going to print?\" he demands, and Harris seems decidedly less articulate. Derek leans a hand on the back of Stiles' chair and fixes a harsh look at the other man.\"Screw-up or not, we treat everyone here with a little fucking respect. I expect you to apologise to him for what you said.\"\nStiles hands freeze over the keyboard as he looks back up between Harris and Derek. Harris is practically puce under the collar of his shirt. \"It was an easy assumption to make-\" he starts, but Derek just glares back. After an uncomfortable moment, her looks back at Stiles. \"I apologise for what I said.\"\n...\nStiles is catching Erica up with events over lunch a few days after the Harris thing.\n\"Sounds like you bring out the alpha male in him,\" she teases around her sandwich, eyes bright.\n\"Oh ha-ha, I was wondering how long the puns would take,\" he retorts, giving her a narrow-eyed smile. \"He was just being a good boss, taking responsibility for the mistake. Any decent human would.\"\n\"You'd be surprised,\" she comments, sipping on water. \"So things are alright between you two after the whole sleep-over?\"\n\"Yeah, seem to be. He's been less growl-y around me lately. He's even set a couple assignments for the January issue so I can build up my portfolio...and he always seems to magically need to be somewhere else when Danny comes up to talk to me.\"\n\"Like it makes him uncomfortable?\" she asks, her face calculating, but Stiles shakes his head.\n\"I think it's more like he's trying to make up for ruining our 'first date', like he's giving us privacy because he's cool with it.\"\n\"So you haven't bothered telling him that you and Danny aren't together?\"\n\"Tried to,\" he shrugs, \"But any time I try and weave Danny into the conversation he just changes the subject. I'm not sure what more I could do.\"\nErica's chewing thoughtfully when Stiles notices something at the corner of his vision. It's Jackson, across the street in a heated argument with an older man. He's gesturing wildly and holding his phone, voice obviously raised but out of hearing-distance. The guy is latino, tough-looking, and is glaring back at Jackson like his eyes alone could kill him.\nShe follows his gaze in the silence until her head jerks back in confusion. \"Isn't that Derek's ex?\" she asks, and Stiles nods distractedly. \"Who's the serial killer?\" she quips.\n\"No idea, but it's weird, right?\" he asks, and she's nodding as she stares. Her eyes widen slightly and she turns back. Stiles follows suit and sees the moment Jackson spots him, stiffening slightly and saying something before the two separate.\n\"Crap, Machete's coming this way,\" she says, picking up her water. They're sitting by the window, so are close enough to the sidewalk to get a good look at the guy as he passes the cafe. Stiles glances up, and catches sight of a tattoo on the man's neck - one he's seen before. His eyebrows rise.\n\"Holy shit, that guy's in a gang,\" he hisses, and Erica's mouth forms an 'o'. \"I've snooped on enough of my dad's case reports to recognise that tattoo on his neck,\" he explains, hands fluttering over the area by his collar. \"Those guys don't fuck around, either.\"\n\"Shit,\" she says, \"What do you think it means?\"\nStiles is thoughtful for a moment, vague facts and suspicions clicking into place. \"I'm not sure, but I get the feeling that the break-in at Laura's definitely wasn't random,\" he says gravely.\n \n \n \n\n\nIII\n\n\"Are you sure you're okay?\" Danny asks, genuine concern coming through his tone. He's sitting on the other side of Stiles' desk, backwards on a stolen chair and stabbing at a salad half-heartedly. Stiles looks up, giving him his best impression of a smile.\n\"Of course, dude. I'm just-\" he circles his forehead with his finger, \"- in my head, y'know?\"\nDanny doesn't look like he does, but nods reluctantly. \"Sure. So did you say you're doing a piece on cosplayers?\"\nStiles' smile is genuine this time. \"Yeah, I pitched it and got the go-ahead... even though I don't think Derek's 100% sure what cosplay is.\"\n\"Please, he's as big a dork as you are - but that's not it...it's because he's got the hots for you, that's why,\" Danny grins. \"You could have suggested an investigative piece on knitting and the dude would have said yes. He thinks the sun shines out of your firm little ass.\"\nThe eye-roll Stiles gives can't be helped, and he gives up on the sandwich he's been half-heartedly pretending to eat for the last fifteen minutes. \"Don't mistake guilt and embarrassment for attraction, man. He's still barely able to look me in the eye since I rescued his drunk ass.\"\nDanny holds up his hands innocently. \"I'm just saying, you don't seem to notice the way he looks at you.\"\n\"And how's that?\" Stiles can't deny his heart has started racing a little, but he's trying to look disbelieving.\n\"Like you're some great mystery that he really wants to figure out. And then fuck,\" he teases. \"Erica thinks so too.\"\n\"Oh jeez, she saw him once,\" Stiles whines, and freezes. \"Wait...you've been talking to Erica?\"\n\"Facebook is a valuable tool in modern society,\" he lectures. \"Plus she said you can't be counted on for gossip since you're the subject of said gossip.\"\n\"Well then, you're both deluded,\" Stile grouses, just as Derek rounds the corner, talking to Hot Jeremy from Editorial.\nThe pounding of Stiles' heart is back, but it's nothing to do with the sight of Derek in a shawl-collar cardigan and tie (well, not completely to do with that. Sue him, Derek's gorgeous). He's been agonising over telling him about seeing Jackson talking to Shifty Tattoo Guy for days, thinking that the botched break-in may have bought him some time at least. They'd be stupid to go after Laura again straight away unless their plan was foolproof, and few are. Regardless, this morning he'd given himself until quitting time to say something.\nStiles had called his dad up once he got home from work, telling the story as it was - but Detective Stilinski spent most of Stiles' teenage years reprimanding him for trying to 'expose' everyone from the Russian guy who ran the local fast food joint for serving dog meat (Stiles is positive he found an ID chip in his taco - cows don't have those, okay?) to Mrs Feltzman down the street for running an underground gambling ring ('Bridge Night', sure), so he's not so quick to believe his investigative skills anymore. His dad had acknowledged that a jock pretty boy talking to a gangbanger was a little odd, but didn't constitute an arrest, or even questioning and besides, it wasn't his jurisdiction. Let the Manhattan guys handle it - they probably knew more than Stiles did anyway, and there was no point in trying to jeopardise a delicate investigation involving some of the most powerful people in New York media.\nThere was also a very aggravating moment where his dad clarified that this was the same Derek Hale that Scott had been teasing him about having a crush on, and then gave a frustrating little snort before he changed the subject. Stiles wishes evil things on his family sometimes. Like itchy underwear, and getting the wrong pizza delivered when they're really looking forward to a certain type of pizza. Sadistic stuff like that.\nBut Stiles can't stop thinking about it. There's Danny's suspicion that the leaked sex tape was leaked by Jackson himself (probably under the influence of Uncle Pete), plus the fact that Peter has made no secret of his anger at Laura for getting the CEO position. He's been asking around about Jackson and Peter innocently, but everyone either clams up or doesn't know anything of value. The only question is, is the guy willing to whack his own niece for it? That's why he needs to talk to Derek... but how the hell do you bring something like that up? It's not like Derek has much family left... and if he's wrong, Stiles is for sure out of a job. If Derek doesn't make sure of it, Peter will.\nHe's standing up before he realises it, and Derek catches sight of him, giving him a soft smile before looking away. Ugh. Eye contact. No fair.\n\"Derek, can I talk to you real quick?\" he asks, as Jeremy give Stiles a knowing smirk and takes back the printed copy he'd been asking Derek's opinion on.\n\"Sure,\" Derek smiles at him - it's small but genuine - and nods, clicking his pen closed before he throws it on Stiles' desk. He seems to notice Danny for the first time, and gives him a curt nod, jaw tightening. \"Danny,\" he says.\nDanny closes the top of his salad container and smirks. \"Mr. Hale,\" he says, before turning to Stiles. \"I'll talk to you later okay? Don't forget what I said. Everyone loves a mystery.\"\nStiles rolls his eyes at him before he and Jeremy walk off.\nDerek's almost-smiling again as he turns to sit at his desk. Stiles closes the office door behind him and raises an eyebrow. \"You're in a good mood,\" he observes.\nDerek gives an excited little grin - and holy fuck nothing should feel like a kick in the chest as much as that does - before he shrugs. \"Had a progress meeting with Laura, and it seems like readership is up on the December issue. Looks like some of the changes we made really paid off. The board members are pretty shocked.\"\nStiles matches the smile and walks closer. \"Are you serious? That's awesome!\"\nDerek nods, waking up his computer and inserting the password. \"She says we make a good team,\" he confides, almost shyly \"You're doing a great job, Stiles.\"\n\"Hey, it's both of us, right? Like Batman and Robin - though since I've got dibs on Batman, that makes you the boy-wonder,\" he teases back, and Derek hides a smile behind a shake of his head.\nHe leans back in the chair and gives a sigh of relief. \"I know everyone thought I was going to fuck this up so bad... But it feels like this kind of proves them wrong, right? Now things are going the right way,\" he says, before leaning forward, giving a thoughtful chew of his lip and picking up some of the letters Stiles left for him to sign off on. \"So what did you want to talk to me about?\"\nStiles falters, studying him a moment. It's the happiest he's ever seen Derek, and it's all because he's feeling good about his life for the first time since losing his father. He hasn't even shown up hungover in days. How exactly does one crap all over that with 'Hey, I'm pretty sure your uncle is trying to bump off your sister, and is being helped by the guy who broke your heart - but I don't have any proof and I'm pretty sure the only reason I'm so invested in this is because I'm in love with you.'\nSo all he says is. \"Uh, I was wondering if I could take one of Daehler's photographers to the convention this Friday. You know, for the cosplay piece?\"\nDerek gives a little frown, like Stiles is crazy for even bothering to ask. \"Of course,\" he says, before eyeing him further. \"You sure that's all?\"\nStiles shrugs. No. \"I'm sure.\"\n...\n\"No, Sheldon, just no. You're cute as hell, I know you have some abs hiding under that... that Tinman-\"\n\"Ironman-\"\n\"-shirt, and you're not going tonight dressed like the guest of honour at a Bar Mitzvah.\"\n\"Lydia, I'm not going to let you play Ken Doll with me just because you think I'm a project,\" Stiles grounds out. \"I'm putting my foot down.\" He debates over whether to actually stamp his foot down, but he's pretty sure that will have the same effect as his version of the Stilinski Glare.\nLydia gives him a look like oh-my-god-I'm-so-over-this-and-you and places her hand on her hip. \"Not even if you get to wear Spiderman's suit?\" she asks, raising her brow.\nIt's a trap, he knows it is, but he can't help but look interested. He's pretty sure she's not going to pull out this glorious, spandex masterpiece with webslingers and some kind of moulding that will make his butt look delicious... but he's a fanboy, okay? It's not fair to toy with him this way. Isaac is no help, he just smirks knowingly and shrugs.\nStiles gives her a narrow-eyed look and says, \"What do you mean, Spiderman's suit, exactly?\"\n\"Andrew Garfield was our July cover,\" Sandra from Fashion supplies. They're in - what seems to be - a giant closet with about half a million dollars' worth of designer men's clothing that he's been informed is the Fashion department. Lydia dragged him here after asking him what he's wearing to tonight's office Holiday party - 'pants, shirt whatever' - and shoved him down on the plush couch. He's pretty sure Isaac's just here to revel in Stiles' discomfort. Or maybe he's the muscle? Nah, Lydia's got that covered on her own. \"Calvin Klein sent us some suits for him to wear and they're all here - even the two he wore. \"\nStiles mouth gapes. \"Are you kidding me?! Spiderman's suit is here?\"\nLydia nods, giving him a perusing gaze. \"You both look about the same size to me,\" she says getting a nod of confirmation from Sandra. Stiles is beaten, he really is, and throws his head back on the couch.\n\"Fine,\" he groans, throwing his hands out to the side. \"You had me at Spiderman.\"\n.\nTwo hours later - because apparently that's how long it takes Lydia to wrestle him out of his converse and into his contacts - Stiles is wearing the most expensive pants he's ever had on his body and a matching grey button-down vest. Even the underwear is designer. His tie is basic black with silver edging, as is the pocket square he has to wear and he'd be more upset if he hadn't found out that he and Andrew Garfield have the exact same measurements. He should apply to be his stunt-double.\nThe party has already begun in their absence - the office has been decked out with more blue fairy-lights and silver-white decorations than he thought existed and there's a bar that would keep Colin Farrell happy for a week. There are Christmas songs playing from somewhere and it seems like it's later than he thought because a few people are dancing like they're five drinks in, at least. It's only a little unnerving when a couple of them turn to outright stare.\n\"Shit, kid, who's the fairy godmother?\" Shannon from Editorial says, as he enters with Lydia on his arm. She does a little curtsey, flicking her strawberry blonde hair and shoots him a proud smile. He has a feeling she wouldn't be seen even talking to him if she hadn't waved her magic wand (or brandished her fist, whatever).\n\"Cleans up well, huh?\" she replies, running her knuckles down his face, fixing his tie and showing him off like her greatest achievement. There's a low whistle from Danny as he edges toward them.\nHe gives Stiles a filthy smile and raises his brows. \"If you weren't practically spoken for, I'd be hitting on you so hard, it'd make your head spin.\"\nLydia scoffs. \"Like you don't do that already.\"\n\"What can I say? I'm a compulsive flirt,\" he says with exaggerated sleaze, eyeing Stiles all over. \"Sue me, the guy looks good enough to eat.\"\nStiles gives him a bashful smile as he reaches up to rub his hand through his hair nervously. Lydia slaps it away, glaring to remind him how long she spent perfecting the 'side-parted pompadour, they're so hot right now' that's artfully coiffed on his head. It just looks like Justin Bieber's latest 'do to him, but what does he know?\n\"Alright guys,\" he sighs, \"I know - I'm sexy as fuck, now if you could all stop salivating over me, I'll be at the bar.\" He's playing it off as a joke, and being honest, he feels a little uncomfortable with all the primping - but he knows he must look pretty good. The people here aren't the type to just dole out compliments about, well, anything.\nHe's pouring himself a drink when he hears an unfamiliar voice off to his left. The dude's clearly not aware he can hear him speaking - or doesn't give a shit - because he says, \"Who's the sexy little jailbait?\"\nStiles smirks and turns with his drink, one hand nonchalantly stuffed in his pocket, to see an older guy - in and around his forties, with piercing blue eyes and dark hair - eyeing him from a few feet away. He's classically handsome, in a Patrick Dempsey kind-of-way, but there's a calculating up-turn to his mouth that makes it look like he's hiding a thousand secrets and enjoys holding them over everyone else. The man next to him turns, scoffing.\n\"Aren't you a little old to be checking out-\" the guy begins gruffly, and Stiles loses the smirk, because it's Derek, and, shit, he's fucking edible.\nHe's in grey-black ('charcoal', he hears his inner Lydia sigh) with a blood-red shirt beneath his jacket, and it's all fitted and strained and hinting at what's underneath. The best part is, he's not wearing a tie, his skin is practically luminous...and Stiles kind of wants to run his tongue over the dip of his collar-bone and the Adam's apple above it, leave bites and nips in his wake; put his claim on that skin.\nIt takes a second for their eyes to meet, because Derek's staring back at him, his gaze raking over the vest, the pants, the hair - but when those impossible eyes reach his face, his jaw snaps shut, one expressive brow rising, and his chest sinks as he lets out a breath.\n\"Stiles...?\"\nAlright, so Stiles hadn't exactly felt truly hot until that moment - but right now, taking Derek Hale's breath away? Would a victorious punch to the air be too much, or...?\n\"You've been hiding this one from me?\" the older man says, taking a step forward and holding his hand out to shake. His suit is immaculate, there's a pretty expensive watch peeking out from the cuff of his shirt, and Stiles straightens up, guessing this is some kind of big deal Board-dude.\n\"Peter Hale,\" the man introduces, flashing a predatory grin. \"And you are?\"\nStiles stomach drops, but he masks it with a falsified smile and shakes his hand firmly. This is the guy - the one Stiles has heard nothing but scathing gossip about, and he's fighting the urge to grab Derek's hand and just pull him away, drag him out of there, tell him everything.\nBut he's looking closer now, and he sees the similarity of their jaw-lines, the shape of their shoulders; how Derek still stands close to the older man, like he's known him his whole life, like they're familiar, despite what may have happened between them. It feels as though his conscience is cracking down the middle all over again, all the effort to build up courage after the last failed attempt at honesty crumbling in the face of a broken, damaged family. Stiles knows all about loss and destruction. Derek's lost his dad... is it worth risking driving away his uncle too, over speculation?\nIt is if it saves his sister, Stiles' inner-voice says, but this time, it's not Lydia - it's all him.\n\"This is Stiles, my assistant,\" Derek supplies, before Stiles even draws breath to reply. His gaze is seared on the join of their hands, and that's when Stiles pulls his away, creeped out a little at how long Peter held on.\n\"My, my. I heard you were a little nerd kid, all mouth and glasses. I'm afraid my sources have sold you short,\" Peter says, eyeing Stiles like he knows so much more than he's giving away.\n\"What can I say, I can't show up to the office all the time looking like this - it'd be unfair to everyone else trying to get some work done,\" he grins back, throwing a nervous glance at Derek. His face is still thoughtful and he can't seem to stop looking.\n\"How considerate of you,\" Peter smirks, \"I like when the pretty is accompanied by a sharp sense of humour.\" He turns. \"Derek, I hope you've thoroughly thanked your sister for finding him.\" He rakes his eyes over Stiles again, bottom-to-top. \"He's like a little Christmas present.\"\nWell that's not creepy or anything, Stiles thinks, until Derek breathes, \"Yeah...\"\nHe can feel his ears turning pink just as the younger Hale seems to remember himself and grabs Peter's elbow, glaring at his uncle. \"I'm sure Stiles doesn't want to be stuck talking to his bosses all night,\" he says tightly, trying for an easy smile but failing. \"Come on, I think I saw some of the Board come in just now.\"\n\"Trying to get me away from him or something?\" Peter smirks, but Derek stands in front of Stiles. It's almost protective. He shakes his head.\n\"Course not... lets go.\"\n\"I apologise for my nephew's lack of manners, Stiles,\" he says, \"I hope you won't see it as a reflection on the family.\"\nStiles raises his glass politely, the need to break the tension rising in his gut.\n\"No, it's fine, I've only got a few hours before I'm drunk enough to be convinced to sit on top of the Xerox machine with my pants down anyway,\" he quips, eyes widening as he instantly wonders what the fuck he just said, and it kind of looks like Derek's choking or something.\nThankfully, Peter just laughs over Derek's shoulder, but it soon it settles into another knowing smirk. \"I'm sure I'll be talking to you soon, Stiles,\" he says, and it's chilling.\n\n.\n\nA couple hours later, and Stiles has danced with at least someone from every department, he's buzzed, having taken a hefty gulp of his drink every time Creepy Fucking Peter Hale came back into his mind or his line of vision... and he feels awesome. No less because Derek's been silently glancing at him all night. Alright, so the looks are probably more curious than Stiles is imagining, because he's made it clear that he's a professional and he was basically hired so that he wouldn't sleep with his boss... but the way Derek can't keep his eyes off him, it's okay to pretend like he wants him, right? It's okay to feel a little ego-boost, right?\nProbably not, okay - it's probably all in his head, and a product of whatever the fuck Lydia put in his glass last time - but just let him have this.\nHis bladder decides to buckle under the pressure of all that ass-shaking and vodka-gin-whatever, and he shuffles off to the bathroom, chuckling at the reflection of himself in the mirrors that are - for some reason - situated above the urinals. Hey, he's dressed like some kind of shallow pretty-boy, it doesn't mean he has to act like one. Honestly, if it hadn't been for the way Derek had looked when he realised that it was Stiles, he'd probably have peaced out to change already.\nIt's around the time he realises he's smiling at himself in a goddamn mirror that he thinks he may be a little more drunk than he thought.\nHe swaggers back out, all exaggerated bravado (and, if he's being straight here, a little genuine, alcohol-fueled confidence) only to get grabbed on his way and manhandled into one of the offices. Stiles heart is beating so fast it's on the verge of stopping, and he tries to make some sort of sound to alert everyone else that he's totally being kidnapped or something. The door slams shut, leaving him and whoever it is in darkness, and as soon as the hand over his mouth is taken away, he starts swearing.\n\"What the fuck is-\" he starts, and the light switches on, and the words die in Stiles' throat. \"Jackson?\"\n\"Oh, so you do remember me, huh?\" he asks, crowding Stiles against the wall and peering down at him. It's only as his eyes adjust that he realises it's Derek's office. \"Seems like you've got a mind for faces. Should I be worried about that?\"\nStiles stares up at him, the need to bolt rising in his chest but he keeps his calm, somehow. \"I'm not sure I know what you're talking about.\"\nJackson gives a bitter chuckle, the sneer distorting his good looks, but somehow it kind of suits him. Stiles kind of hates himself for even thinking it. \"Don't play dumb with me, Toots. I hear you've been asking a few too many questions around here, and we both know you saw me. The only question is, what's your price?\"\n\"Huh?\" Stiles says dazedly, staring at Jackson's mouth like it'll help the words make sense. He'd hit his head off the wall when he was shoved into it, and the alcohol probably isn't helping matters. \"Price for what?\"\n\"To keep you quiet. About what you saw?\" he says, raising a patronizing brow. \"Everyone has one. The Hales have more money than you've seen your whole life, kid.\" He snorts confidently, leaning back to stare. \"You're probably neck-deep in student loans, and trying to keep that little apartment you have on an assistant's salary can't be easy... so tell me. What's your price?\"\n\"I'm not taking anything from you,\" Stiles spits, feeling angry now. \"Look, I haven't said anything, okay? But that doesn't mean I won't- just, leave me alone, leave Derek and Laura alone and I won't say anything.\"\n\"You know I can't do that, Stiles,\" Jackson says, edging ever closer, laying his hands on the wall either side of his head. \"I'm sure we can work something out.\"\nStiles does his best to glare. \"Pretty sure we can't.\"\n\"How come you're so quick to protect them? You're just an assistant. You know he went through three before you, and that's just since he's been here.\"\nStiles seethes, and the smirk on Jackson's face widens. \"Because I'm a decent fucking human being?\"\nJackson's brows jerk, and he looks at him like he's thoroughly entertained. \"Think someone's been reading too many comic books,\" he mocks, then it seems like something occurs to him. His eyes roam over Stiles' face as he studies him. \"Unless, there's another reason you care about your boss so much. But that can't be it.\" Stiles can only frown in response, head jerking back and hitting the wall again. He hisses in pain.\n\"What the fuck are you getting at?\" he spits, brain desperately trying to catch up with what's happening.\n\"Because if you were into him, he'd have had you already... he's kind of forceful like that. He likes the chase, likes to take control...but now, the way you've been looking at me since I got you in here tells me you haven't exactly been getting your share of that kind of attention. That's okay, Babe,\" he smirks, \"That's a price we can negotiate.\"\nStiles snorts turning his face away. \"Please, you're hardly my type.\"\nJackson grabs his chin and turns his face back toward him. \"Please,\"he mocks, \"I'm everyone's type.\" And then they're kissing, and it's harsh and bruising and Stiles is too shocked and wasted to do anything for a few seconds, but it's too late, because the door opens and-\n\"Stiles? Are you..\"\nJackson pulls away with a look of triumph, and they both turn to see... Fuckshitfuck. It's Derek, face blank and mouth softly gaped, taking in the scene. Stiles is still pushed against the wall, bracketed by Jackson and he knows from the tingle of his lips that they're swollen and red. He blinks at Derek, trying to claw back his breath, and the shock on his face goes tight and stoic.\n\"Derek,\" he begins, but Derek's expression falls to such hurt at the sound of his voice that it's like his heart is sinking to the pit of his stomach. He feels sick and dizzy and it's all just so fucked up that he wishes he'd just stayed home, just kept walking when Jackson grabbed him, fought back better - anything that would take that look away. Derek just takes a step backwards, shaking his head and training his eyes on the ground.\n\"I... no. I'm sorry... should've knocked. I'll-\" he buries a hand in his hair, eyes dazed as he turns. \"I should go.\" There's a small, forced smile then, and it's worse than the hurt.\nStiles shoves Jackson backwards angrily once he's gone, practically vibrating. \"You fucking asshole,\" he snarls, holding a hand out the door. \"Is that what you wanted, huh? Him to see?\"\nHe can barely believe it as it sinks in - for Derek to see him kissing his ex, the guy he's clearly not completely over is the single worst thing he can imagine happening. Stiles is supposed to be his friend, at least. They'd gotten that far.\nJackson has a strange, thoughtful look on his face for a second, almost sorrowful, before he blinks a few times and trains his face back into a triumphant, shit-eating grin. \"Not exactly, but I guess it works.\"\n\"You're a piece of work, you know that?\" Stiles spits, shaking his head. \"Not bad enough that you did what you did to him, but this? Get the fuck away from me.\"\nAs Stiles leaves the office, he hears Jackson shout after him, \"Good luck getting him to trust what you say now,\" but it doesn't sound like he's as pleased with himself as he's letting on.\n.\nHe races back towards the party, finding Danny on his way.\n\"Dude, did you see where Derek went?\" he pants, and Danny's brows furrow.\n\"Yeah, he just went through the foyer a second ago... he didn't look good,\" he says, staring at Stiles, who is clasping his hands on top of his head. \"Did something happen with you two?\"\nStiles' eyes widen. \"He walked in on me and Jackson- we were...\" Ugh, he can't even say it, he needs to find Derek.\n\"Shit, Stiles, that's fucked... you know their history..\"\n\"I know, alright?\" he snaps, \"It wasn't- Look, there's stuff happening I haven't told you, but I would never make a move on fucking Jackson... Do you know where he was headed?\"\nDanny nods, lifting a finger. \"I think he was going towards Laura's office... there's not much else up that way.\"\n\"Okay.. okay thanks,\" he nods, swallowing thickly. \"If you see Jackson, I don't know... just try not to let him through, okay?\"\n\"Okay.\"\n.\nHe's not in the office, but on the end of the corridor is a balcony overlooking the street below. He can see the outline of Derek's shoulders through the glass door, hands braced on the railing and head hung. He opens the door carefully, seeing Derek stiffen slightly at the sound.\n\"Derek?\" he says tentatively. He has no idea how this is going to go down but the lead weight in his stomach seems like a pretty good indicator. \"Look, about what you saw-\"\n\"It's not any of my business, Stiles,\" is the even response, and Stiles lets out a sigh. Their breaths are plumes in the December chill, and it's like it's filtering through to his bones, because Derek's locking down all over again.\n\"No, look you need to know some things. You need to know that I would never-\"\n\"Never what?\" he snaps, turning around, \"Because I'm pretty sure you just did.\" His face is closed off and angry, but his eyes are pained and there's an itching in Stiles' fingers to reach out, smooth it away, kiss it away, anything. \"Why the fuck are you here? Why do you even give a shit?\"\n\"Because it's you!\" Stiles yells, the frustration bubbling over to rage, \"How the fuck can I not care... I give a shit about you, okay?\" He huffs out a short, humourless laugh. \"All I ever fucking do is give a shit about you. Every day of my fucking life, it's like you opened me up and crawled inside and I can't fucking breathe when you're looking at me like you are now.\"\nDerek is staring, the look of disgust fading away as his eyes dart between Stiles' like he'll get all of the answers he needs, but Stiles is drunk and this is such a spectacularly terrible idea but he just can't seem to shut the fuck up.\n\"I would never do something like that to you. I know some of what happened with you and Jackson, alright? Not all of it, sure, but I know what he must have meant to you once. I'm just not that guy,\" he implores. \"Even if I wanted him, you mean too much to-\" his breath hitches, and he buries his hand in his hair. Lydia's going to kill him at the rate he's tugging at it.\nThere's a bitter snort from Derek and he shakes his head, like Stiles is an idiot.\n\"You just don't fucking get it do you?\" he says, stepping closer. \"It's not that you were kissing him... it's that he was kissing-\" he lets out a grunt, shaking his head once more as the words die, and Stiles breath leaves him as Derek fists one hand in his collar, pulls him close, and their lips meet.\nIt's chaste and soft at first, like Derek hadn't exactly thought through the part after all the tugging, and Stiles takes over. He feels the moment Derek melts into it, shoulder sagging as Stiles' rise to his ears, his arms winding around Derek's neck. It's hot and filthy, like they're both starving for it, and soon Derek's making broken little sounds like there's something inside him tearing apart. Rearranging.\nThey're short of breath and there's a clash of teeth and an exploratory meeting of tongues, but it's real and actually happening and Stiles is starting to wonder if he should ask for some kind of signed statement to prove that this is a thing that really occurred.\nDerek's all coiled muscles and hidden strength. His lips are slightly chapped, his hair is deceptively soft and his stubble makes a delicious little burn on Stiles' chin as he pulls away, nipping at his lips before he angles his head for more.\nAnd then comes the wake-up moment, because Derek freezes, pulls back and stares at him in shock like he can't believe he did that. His fingers rise to meet his lips and he squeezes his eyes shut, turning his face away as if to hide it.\n\"Fuck, I-\" he says, his voice hoarse and wrecked and it's not helping the situation that's beginning in Stiles' pants when he realises he did that. He made Derek sound like he's on the verge of collapse in the best possible way. \"What the fuck am I doing?\"\nStiles' breath leaves him, and he just watches. He watches the moment the regret filters into Derek's expression, chest heaving, and the moment he looks back at him like there's something terribly wrong.\n\"I can't believe I...\" he starts, faltering. \"I was still hating Danny, all because... and then five minutes ago, you were in my office kissing my ex and now you're saying shit like this to me... showing up here looking like that, like all I've ever wanted- and... and all I've been able to think about all night was dragging you away and getting you out of that fucking suit-\" Derek rambles, and there's this tiny, microscopic ball of hope forming in Stiles' gut. \"I don't even know what the fuck is going on,\" he says, pained and radiating confusion.\nStiles gulps thickly. His legs feel like they're about to give out and there's this incessant pounding in his ears as the panic starts. The words are disjointed and perfect and he's probably going to pass out from hearing them, but he needs more. He can't let this go, not now that he knows that there's something actually something to let go of. It's like a thousand possibilities opened up when he'd resigned himself to none at all.\n\"Derek, I swear to you, it's not what you think. I'm not- I didn't plan this, okay? I just wanted- I came to tell you that what you saw back there wasn't what it looked like, and I just can't deal with you hating me over something like this.\"\nHis voice is gruff, like he's losing it, and he thinks maybe he is. Losing his mind; because the beautiful man in front of him is hurting and he feels like it's all his fault.\nThere's a frustration coming out on Derek's face again, and he throws up a hand. \"Well then fucking enlighten me, Stiles, because I have no fucking idea what happened tonight.\"\nStiles draws a deep breath, wishing he could lie his way out of this, wishing he could do anything but what he's about to.\n\"Listen, I'm not just trying to pass blame here, okay?\" he begins, watching the face before him for any hint of understanding. \"But... okay. Okay, last week I saw something - something I clearly shouldn't have, and Jackson got desperate. What you saw was his sick attempt at - fuck, I don't even know - buying my silence?\"\nDerek's head snaps back at that, his eyes narrowing like he's trying to detect any hint of a lie, and Stiles steps closer, hands held out, holding eye-contact, willing him to believe. Derek's watching unflinchingly.\n\"What do you mean, you saw something?\"\nStiles chews on his lip.\n\"I wasn't sure what it was at first,\" he says, and he's obliquely wondering if he's having a Mean Girls moment and this is word vomit, if he should shut the fuck up and just let Derek hate him, but there's something about the way he looked at him - like every ounce of trust had disintegrated - that takes over Stiles' mouth. \"He was talking to this man - a guy that someone like Jackson shouldn't even know. It was a member of the Panchitos. They're this gang out of Brooklyn - my dad's had run-ins with them before. Really dangerous guys.\"\nDerek's face is pinched, trying to comprehend what Stiles is getting at. \"What's this got to do with anything?\"\nStiles gives out a sigh, pressing his thumb and forefinger into his eyes.\n\"I just thought, maybe it's completely off-base, but it's a little bit too much of a coincidence that there's some kind of hit out on your sister, and then suddenly the assistant of the guy who wants her job is talking to one of the most dangerous men in the city.\"\n\"And you think my uncle... and Jackson have been trying to kill her?\" he says, brow furrowed. His lip curls abhorrently. \"Jesus Christ, Stiles... where do you even get this shit?\"\nHe's angry, and this is the opposite of how Stiles wanted this to go.\n\"Look, I just know what I saw, and I know that Jackson was pretty desperate just now to make sure I didn't tell anyone else.\"\n\"So he tried to fuck you into submission? Use sex to get what he wants?\" Derek's guarded and sarcastic and Stiles hates it.\n\"Would it be the first time?\"\nIt's a low blow - he knows it from the second the words leave his lips, when he sees the way Derek's face contorts like Stiles has just rammed his fist into his chest - but he's not just going to stand there and let Derek think he's someone he isn't. Not when he's just trying to help him. When he's the only one trying.\n\"Fuck you,\" Derek says, with such venom he's pretty sure he can feel his insides burning. \"I can't fucking listen to this. Just-\" he turns away again, shaking his head. \"Get the fuck away from me.\"\nStiles is pretty sure his heart is sinking out of his ribcage, the lead weight in his stomach attached to it and dragging.\n\"Derek, I-\"\n\"I can't listen to this, okay? I can't deal with someone else fucking with my head for their own... Just go,\" he says, back fully to him now. \"I can't.\"\n...\nHe gets the call from Human Resources as he enters the building on Monday.\n...\n\"He fucking fired you?\" Erica seethes from her perch on the end of the couch. She's reading through the paperwork and frowning at it with an intensity that would make Derek proud (if he cared... which he would not). \"'Unresolved grievances with co-workers'. What a fucking bastard. You know you could have him for this? Kissing you and then firing you? It's got to be sexual harassment.\"\nStiles stares blankly at the TV - it's Spongebob, he thinks - and shakes his head.\n\"No.\"\n\"What do you mean, 'no'? You're out of a job because of this prick. You didn't even do anything wrong and you're the one who suffers? I'm calling Laura.\"\n\"It's not going to help.\"\nLaura had been just as shocked as he was (though, admittedly, probably more), promising to talk to her brother and cursing him out before demanding to know what happened. Stiles had refused to tell her - at least let him save a little of his pride, okay? He'd given her his best smile, re-shuffled his pathetic little box of belongings and told her that talent like his wasn't out of work for long. He'd already outgrown the place. 'A peacock needs space to strut.'\nIt's amazing how well he could lie to protect anyone but himself.\nIt had already been a week, and he'd specifically held off on telling Erica because he was pretty sure that moping around like 'The Dude' Lebowski didn't really give off a great first impression in new employment. Just a little wallow time, that's all he needs. It's been a tough week. Oh yeah, and it was Christmas, too. He'd kind of faked his way through Holiday cheer at Dad and Melissa's.\n\"Boyd's got a buddy who's with this pretty great law firm. He can get you in touch with them and go toe-to-toe with these assholes,\" Erica announces, before placing her hand on his socked feet. \"Stiles, why aren't you angry about this?\" she probes, \"It's fucked up, and you're not to blame. Scott? Help me out, here.\"\nScott gives him another one of those sympathetic puppy expressions and buries his hands further in his pockets. \"I tried, Erica. If he says no, he means it. Lay off him, okay?\"\nStiles loves Scott. In fact, it's times just like this one that Stiles remembers why they're best friends.\nErica looks betrayed, but sneaks another look at Stiles and sighs. \"Fine. I won't go after pretty boy's balls with a wrench,\" she says, before raising a brow. \"But at least let me find you something else? Get you out of those fucking sweatpants?\"\nStiles pulls a face. \"Not yet, okay? I've got freelance stuff with some independent music sites lined up, and I still have my Holiday bonus. I just need to...\" he trails off, then sighs. She squeezes his foot and then nods.\n\"Alright, Baby,\" she soothes. \"I'm not even going to ask about getting you laid.\"\nHe shoots a glare at her as she kisses him goodbye, before sashaying out the door. It takes a full six seconds before Scott throws himself, face-down, on top of him, pretty much planking and lets his dead weight squeeze the air from Stiles' lungs.\n\"She's right, you know,\" he mumbles, voice muffled into Stiles sick-day comforter. He presses himself up on his hands and somehow manages to manoeuvre in between Stiles and the back of the couch. \"It was a dick move for him to do that.\"\nStiles presses his hands into his eyes wearily. \"I know, okay? It's fucked... but I pretty much humiliated myself and accused his uncle of plotting murder. I just- He doesn't need this in his life, and I'd rather not have to see him again. Any of them.\"\nScott nods. \"I get it. Last thing you want to do when you're dumped is see the person who hurt you. Just make sure you're doing it to protect yourself, not him.\"\nStiles levels a withering glare on his friend. \"I wasn't dumped.\"\n\"Dude, you were a little dumped. It's okay, though, I'm here for you. I understand.\"\n\"You've never been dumped, Scott. Not permanently.\"\nScott shrugs. \"No, but you have, and you're my bro. I've picked up a few things over the years.\"\n\"Oh great, bring up my failed love life while you're at it.\"\nThere's a shit-eating grin from Scott, and Stiles pushes his face back into the cushions. \"Well, I know that Netflix just updated, pretty much making it zombie-central... and there's a six-pack and a couple industrial-sized bags of Cheetos in the kitchen with our names on 'em.\" He says, wiggling his shoulders and pushing Stiles further off the couch. \"Pizza place is two-for-one, plus my girlfriend who I adore and love seeing always isn't coming over tonight - she's doing thesis stuff, so... guys' night?\"\nHe can't help but let a responding smile tug at his mouth. \"You know she can't hear you, right? That it's okay to be happy to have a night apart?\" he asks, shaking his head fondly. \"Alright, maybe I won't revoke your best friend card just yet.\"\n\"Dude, our parents are married. You're stuck with me for life.\"\n\"Is it sad that you're my longest successful relationship?\" Stiles asks, trying not to sound too depressed by it, and Scott grins.\n\"No way, man. I loved you even before Allison,\" he says, smoothing Stiles' hair roughly down over his forehead, and things are already feeling a little better. \"And for the record, I think it sucks he's not really James Bond.\"\nStiles gives him a confused look as Scott settles back down into comfort, picking up the remote.\n\"You do...?\"\n\"If he was, it totally wouldn't look suspicious if someone were to just shoot him in the nuts.\"\n...\nIt's two weeks before he gets a Facebook message from Lydia.\n'His new assistant is a dumbass who tries too hard. He's pining. Horribly. It's pretty obvious he misses you. We all do.'\nStiles debates whether to reply or not, because the very idea of Derek pining or unhappy has hit him like a fucking train. But he gives in.\n'He doesn't want me,' he writes, before adding, 'working there anymore.'\n\n...\n\nIt's the end of January when the news of Peter Hale's arrest breaks. Jackson's on screen, trying to hide his face, but he's clearly not important enough to mention more than in passing. The major twist, though, is one of the city's leading cardiologists being brought in for questioning regarding suspicious events surrounding the death of media mogul, Bronson Hale.\n...\nHe gets a brand new MacBook, a tailored, Hugo Boss suit that he's assuming would fit Andrew Garfield like a glove, an Ipad, an Xbox with a hard-drive that makes the one he and Scott had been using look like something rescued from a landfill, and a selection of games that aren't out for at least six months, all delivered on a Tuesday. He tried to tell the guy he'd got the wrong place, but the man just shrugged, handing him an envelope. Inside was expensive-looking stationery, letterhead reading 'From The Desk of Laura Hale, CEO, Hale Publications', and two words, handwritten neatly in the blank space.\n'Thank you.'\n\n...\n\nIt's barely a week after that when Erica calls with the offer of a staff-writing position with Billboard magazine. She assures Stiles that his resume hadn't even been put back in circulation with the agency, just like she'd promised. They asked for him specifically. He's practically been head-hunted.\nHe debates calling Laura to tell her that the gifts were enough - he doesn't need any more favours (and Scott had threatened to bite him if he so much as thought about sending them back) - but there the underlying fear that she'll somehow try to talk to him about Derek, and he's just not that okay with everything yet. But he takes the job, because... why the hell would he turn that down?\n...\nHis new job is amazing, okay? He met more of his heroes in the first two weeks than in his whole life prior. His editor is chill, his desk is huge and he's even got a super-comfy chair with lumbar support. Not only that, but everything he writes is eaten up by his superiors and he's getting paid a real, grown-up salary. It's like he's finally getting somewhere.\nThe coffee isn't quite as good as some he's had, and okay, he kind of misses having Isaac's quiet company, or the entertainment of Lydia, or Danny's TMZ-level insight into how the other half live for lunch. Facebook chat just isn't the same, and it kind of cuts their conversation in half when they catch on how he always needs to 'go do something' when they start talking about anything which may lead to Derek, and stop bringing him up altogether. But it's still amazing.\nHe tells Deaton so when they're both left at the end of an editorial meeting.\n\"We're happy to have you, Stiles. In fact, from what I gather, we're lucky to have you.\"\n\"I wouldn't go that far, Sir,\" he grins, enjoying the whole treated-as-a-colleague thing he's got going on with the other editors and department heads. He definitely doesn't miss Harris. \"I think giving me a chance to interview Mumford &amp; Sons is a pretty good way of swaying me.\"\nDeaton laughs kindly. \"Even still, you're fitting in well here. Hale was right when he said you're innately likeable.\" Stiles smiles back, sliding the strap of his laptop bag over his shoulder before he hesitates.\n\"Did you say, 'he' said?\" Stiles asks, frowning. \"He as in Hale?\"\nDeaton raises his brow. \"Yes, he as in Derek Hale. He was your former superior, right? A lot of people in the industry were keeping a close eye on Alpha after he took over. What he managed to do in the first three months for their turnover was nothing short of miraculous.\" he gives Stiles a calculating look. \"A feat he attributed to your influence, when he called.\"\n\"Derek called you?\" Stiles chokes out. It feels like the first time he's openly said his name in months. He'd even managed to proudly wean himself off googling the society pages. He's never in them anymore anyway.\nDeaton nods.\n\"About two days before we hired you. It's always a little easier to find someone when you put the word out through the grapevine that you're looking. The reference was so glowing - and of course your work was so impressive, even for your limited experience, that we knew we couldn't see the position going to anyone else, really.\" He studies him a little. \"You didn't know?\"\n\"No,\" Stiles says, feeling that pressure in his chest again. \"No, I didn't.\"\n...\nHe doesn't call Derek. It's not like he owes him anything; it's the guy's fault he needed a job in the first place. Plus, Deaton said it was down to his talent, too, so he can't feel like the only reason he's got the job of his dreams is down to that one phone call. That one phone call where he made Stiles sound so brilliant that one of the biggest music publications in the country hired a graduate with little-to-no experience as a staff-writer.\nSo he doesn't call Derek.\n\nWhat would he even say, anyway?\n\n\n...\n\nHe lets Danny persuade him to come out for Valentine's Day. They've barely had a chance to hang out together, and if they're both going to be single and miserable then they may as well do it looking delicious (since Lydia's nagging has actually started to take root, and Stiles grew a sense of fashion. Well, he's at least ditched the casual-look for nights out) and getting hit on, right?\nStiles pointedly refuses to go to Narnia - it's not like New York is short on gay bars, right? It's actually pretty fun, once he lets loose a little - but then, every night out with Danny is a freakin' exercise in liver damage and questionable decisions. Stiles kind of wants to make questionable decisions - in fact, it's probably pretty important that he does. He needs to feel that it's okay to leave his brain at home, and it's okay to use the loneliest holiday of the year to flirt and maybe fuck and push the fact that he can't stop over-analysing what the call Derek made means.\nJust forget about it all, for one night. Forget about Derek Hale and harsh words and impossible looks and irresistible mystery.\nThat's what he reminds himself, anyway, when he gets drunk off his ass and recieves some of the best head of his life from a guy with dark hair, broad shoulders and blue-green eyes in the club bathroom.\n...\nIt's almost March when he's asked to come along to the annual Media Summit. Deaton says most self-respecting Editors-in-Chief send their staff along because conferences are boring as hell and he has stuff to do. Stiles doesn't mind - some of the others on the staff going are pretty cool guys, and he's never been to one before. Plus he gets a day or two out of the office - paid - which is always nice.\nA week later, and he's slouch-sitting at a subdued, slightly empty seminar on web-based publishing when O'Reilly leans over.\n\"You owe someone money, man?\" he hisses, his face pulling up in a smile. O'Reilly never stops smiling - Stiles mentally named him 'Smiley' the whole first week he worked at Billboard.\nStiles frowns. \"What are you talking about?\"\n\"McBroody over there. Guy looks like he just about lost out on the part of Angel and he's still not over it. He's boring a hole in the side of your face.\"\nStiles freezes. There's only one person who would match that description, and he'd placated himself with Deaton's claim that editors didn't go to these things unless they had to. He'd fucking told himself that there was no need to be mentally prepared for seeing Derek because it wasn't going to happen - and if he prepared himself, it was the same as getting his hopes up. It just wasn't going to happen, okay?\nExcept it was.\n\"Is he sitting close?\" Stiles can't look.\n\"Hmm,\" O'Reilly ponders, \"About fifty feet, give or take. Shit, do you really owe him money?\"\nStiles gives him an are-you-kidding-me look and shakes his head. He still can't look around. \"He's just someone I used to work with. We didn't end things well.\"\nO'Reilly looks all-knowing now. \"Ah, workplace hook-up. Never a good idea. You've seen the way Janet from Accounts still looks at me.\"\n\"She told me you threw up in the drawer on her night-stand and never called her again.\"\nO'Reilly pales, and it's pretty fucking entertaining. \"She's telling people about that?\" he gulps, and then studies Stiles' chuckling, an expression of fondness coming over his face. \"Hey, you're still my friend even though you knew? And you didn't say anything? You're a good guy, man.\"\nStiles sighs, getting Scott-inspired deja-vu and finally gaining the courage to look around, He can't see a sign of him anywhere, but there's an empty chair a few rows back, in the direction O'Reilly had indicated. Stiles lets out a breath, not sure if he's disappointed or relieved.\n\"Yeah, so I've heard.\"\n.\nHe feels like the rest of the day is spent in complete vigilance. Every time he enters an auditorium or goes to the damn bathroom or passes through the reception bar, it's like Derek's about to just show up, completely unannounced and squeeze the breath from his chest. It's a terrible feeling.\nIt's later on when he hears his name being called by a guy's voice across one of the function rooms.\n\"I know you're not trying to blank me, Stilinski,\" he says, and Stiles has never been so simultaneously happy and devastated to see Danny before. It's mostly to do with the fact that when he looks up, Danny's flipping him off with a mischievous smile- and Derek's standing to the left of him.\nHe's got his head bowed, frowning uncomfortably into the completely interesting cup of water he's got in his hand. The cup's obviously some kind of asshole, the way Derek's glaring at it.\nIt's like someone took a sledgehammer - or Mjolnir or something - and just full-on slammed it into Stiles' sternum. Like they just left it sitting on his chest so that he can't recover.\nDerek looks just as good as ever, the dick, and he's dressed a little more casual than Stiles remembers. Which isn't fair, because it's like they've got that tiny bit more in common. Like they're better suited; like it wouldn't look so crazy and mis-matched if they were together. Ugh. There's that fucking leather jacket again.\n\nCan he curl up in a ball on the carpet now, or...?\n\nHe pastes on a little grin and turns to O'Reilly, who is pretty much engrossed in conversation with a gorgeous black girl. \"Hey, those are some friends of mine, I'll be back in a sec,\" he says, and O'Reilly follows the jerk of Stiles' thumb to see Derek. He raises an eyebrow back at him.\n\"Sure thing, Stilinski.\"\nIt's like his feet have weights attached to them as he walks, looking around and pretending not to care that this is the first time he's seeing Derek in three months. That the last time he did, they'd kissed in a way that, in theory, should have had no right to be re-visited every time Stiles closed his eyes with his hand inside his boxers - but he's not getting over it any time soon. He's pretending not to care that he's had this weight inside of him since that night, because he knows things aren't right between them.\n\"I thought I was seeing things,\" he quips reflexively, nearing Danny. \"Who'd you have to sleep with so they'd let you in a fancy place like this?\"\n\"Oh, the kid's got jokes I see. Nice to see your brain's still functioning after Valentine's. You were supposed to call me when you got home safe, you dick.\"\nDerek's head jerks up, clearly surprised that they've both kept in such contact, as Stiles gives a shrug. \"Dude, I put it on Facebook. And you saw what I was like. Scott found me on the couch in my underwear with half a bucket of fried chicken.\" As Danny throws his head back in laughter, Stiles gives Derek a soft smile, mirroring the one on his face, and a nod. \"Derek.\"\n\"Stiles,\" he says, eyes suddenly apprehensive at being addressed, and voice low. He clears his throat nervously. \"How do you like the new job?\"\nStiles shrugs, going for calm, which is the exact opposite of what's going on inside of him. \"It's pretty great. It's nice to feel like I know what the hell I'm talking about a whole 60% of the time.\"\nDerek presses his lips together, hiding a smile as he looks down. \"I'm sure you're great,\" he says. Stiles tries not to break down crying or something.\nDanny smirks and rolls his eyes. \"So I hear you beat us out for the Lana Del Rey interview. She's only giving select ones when she's here next week, and you fucked me over, man.\"\nStiles grins, grateful for the change in subject. \"What can I say? I've got a silver tongue.\"\nDanny laughs, but Derek's just gone back to smiling softly at his cup again.\n\"Nobody here wants to know about your tongue, Stiles,\" he says, and Stiles tries not to flail when Derek's brows rise and he shoots him a knowing look.\n...\nIt's the next evening, and Stiles pulls the collar of his duffel coat up around his ears as he watches the rain come down in sheets. He's been standing outside the hotel where the conference is being held for five minutes already, trying to pick up the courage to make the dash through the downpour to the subway. The MacBook in his bag may have been free, but it doesn't mean he wants to drench the fucking thing.\nA town car pulls up to the sidewalk, and the window rolls down. Stiles thinks a part of him is just making shit up when Derek's face appears. \"Need a ride home?\" he asks.\nStiles hasn't seen him all day, not that he was looking or anything, and he'd started to think he'd skipped out like Deaton had.\nHe shakes his head. \"It's fine dude, I'm not going to have you take me all the way out to Brooklyn,\" he calls over the rain. Derek just rolls his eyes and opens the door, scooting backwards on the seat to make room. This is probably a really terrible idea but he's already running now and ducking his head. He shuts the door and lets out a sigh, wiping rain from his face.\n\"Thanks, man... I owe you one,\" he says, finally turning and blinking to see Derek watching him. He turns back at being caught, nodding forward.\n\"Damian, can you make a run towards Brooklyn please?\" he asks through the divide.\nStiles looks around, raising his brow. \"A town car?\"\n\"Laura's. She lent it to me for getting to the conference,\" he explains, and Stiles nods.\n\"Of course it is. I forgot that she's Blair fucking Waldorf,\" he laughs, and Derek looks confused. \"Trashy TV reference... I'd probably erase all of my cool factor if I explained it to you.\"\nDerek smirks back and shrugs. \"It's not like you have much to begin with,\" he says, and ohmygod that's actual flirting. Stiles laughs quietly and busies himself with swatting rainwater off his laptop bag as he calms down. There's silence for a few moments, and there's about a thousand questions he wants to ask, things he wants to say, but the biggest one comes to mind.\n\"So that must have been one hell of a phone call you made to my boss to get me this job...\" he begins, and Derek's head snaps back, almost guilty. He clears his throat and looks down before retraining his gaze out the window.\n\"I didn't think you knew about that,\" he says quietly.\n\"I didn't, until about a month after I started,\" he replies. \"I'll be honest, I didn't really know what to think. What was it? Guilt over firing me for no good reason?\"\nHe doesn't mean it to come out as harsh as it sounds, but there is a little part of him that's angry at Derek for taking the coward's way out. For pushing him out of his life.\nDerek shakes his head. \"I wanted to offer you your job back... but I just- You were wasted being my assistant. You deserved so much better than that.\" He meets Stiles eyes. \"It was a thank you. For what you told me. I'm- I shouldn't have shut you down like that. Not when you were right all along.\"\nStiles nods into his lap. \"I saw about Peter on the news. I'm sorry.\"\nDerek shrugs, but it's all bravado. \"I had my suspicions about him. He was always talking to Dr. Arvelle when my Dad got taken into hospital, and it's like, every time someone else came within hearing distance, they'd separate. I didn't want to believe there was something going on.\"\nHe pushes his head back onto the headrest and sighs heavily. Stiles is too busy chewing his lip to really fixate on the bob of his throat or how his eyes are tired and sad. Okay, well he does - because it's Derek.\n\"How did he get caught?\"\n\"Because of...\" he sighs again. \"After what you told me, I couldn't stop thinking about it. It's like, everything that seemed wrong over the past year led back to Peter. So... I had him followed.\"\nStiles eyebrows rise. \"And they found something?\"\nA nod. \"Yeah.. you were right about the hit out on Laura. It was only after digging that the truth came out about my father.\" His jaw hardens. \"Ten million dollars. That's the cost of my dad's life. \"\nStiles head is swimming as he looks out at the other cars. They've barely made it off the street where the hotel was, and he's, for once, glad of the traffic.\n\"I'm sorry,\" he says. \"I didn't want to be on to something.\"\nDerek gives an understanding bob of his head. \"I know, but I'm glad you were.\" There's a snort, then and he looks at the ceiling. \"God, I felt like an even bigger piece of shit when you were proven right.\"\n\"It's okay,\" Stiles shrugs. \"I don't think I would have believed me either.\"\n\"It's not that I didn't believe you,\" he says with conviction. \"I knew deep down you wouldn't lie to me about something like that, but I just... I got scared.\"\n\"Scared?\"\nDerek's eyes roam over his face, and he nods. \"I was scared of you. Of what I was feeling.. and what you were-\" he takes a breath. \"Stiles, I spent so long wanting you from a safe distance, and believing that I couldn't have you because of Danny, so it was okay - I couldn't get hurt. But when you told me you wanted me back... it was... terrifying.\"\n\"Because of Jackson?\" Stiles asks, feeling breathless, like all the air has been sucked out of the car and there's no sound anywhere on earth.\nA nod.\n\"I'm not Jackson, Derek.\"\n\"I know that. Believe me, I know.\" He looks at Stiles curiously. \"He told me he offered you money to keep quiet. That you threatened him right back.\"\nStiles head dips self-consciously. Who knew Jackson would come clean in the end? He'll probably have to send him a present or something - although it'd be pretty great if he never had to lay eyes on him again. \"I wasn't interested in that... and I was pretty gone on you. I just wanted you safe.\"\n\"Was?\" Derek asks. Stiles frowns back, shaking his head for clarification. \"You said you 'were' pretty gone on me. Past tense.\"\nHe chews on his lip. \"Am,\" he says, meeting Derek's eyes. \"I'm so fucking gone on you it's hard to function someti-\"\nHe doesn't get to finish, because Derek's lunging across the seat and crashing their lips together.\nIt's like hunger and passion and need, all fighting for each other, and Derek's hands fist into his hair like he's trying to absorb him, keep him close and never break apart again. Their hands cling and their bodies gravitate, until Stiles is pulled on to Derek's lap and Derek's palming him all over, exploring everything they've been denied. It feels like gravity's ceased to exist and there's nothing holding him to Earth save for the hands clutching him and the lips on his own.\nIt's timeless and freeing, and there's just a brief pause as Derek tells the driver to take them to his apartment before his face is buried in Stiles neck, sucking bruising kisses and heaving hot breath over energised skin as he peels his jacket off.\n\"Is this okay?\" he asks into his clavicle. \"I just, I don't want to let you go this time. I can't-\"\nStiles hushes him with another kiss, pulling his feet back and nodding into his mouth. They're side-by-side again when Stiles pulls away. \"Yeah. Yeah... are you sure?\" He's still half-leaned over him, the distance too great, too soon.\nDerek's eyes dart between his own. \"Never more sure of anything.\"\nStiles has to kiss him again, just because... but it's hot and dirty and he's really starting to think they're not going to make it to the apartment. Derek's hands are blazing over his skin beneath his shirt, grasping and holding and Stiles is so hard he thinks he's about to embarrass himself.\n.\nIt's a close call when they pull up to the apartment building, and he's probably not going to remember even seeing the door man because Derek stands behind him and mouths at his neck obscenely while they wait for the elevator.\nOnce inside, he's pressed against the wall and ravaged for a full minute before either of them thinks to press the button.\nThere's a jumble of limbs and stumbling once they reach the penthouse, a shoe outside the elevator doors, jackets flung over the couch, shirts and pants somewhere on the stairs.\nAnd then he's on Derek's bed, and he's hovering above him like a predator about to strike. He's laving at Stiles body, mumbling promises and approval, all perfection and lust-hazed eyes, and Stiles comes barely a minute after Derek wraps his mouth around him.\nThey're kissing again, and Stiles is discovering how hot it is tasting himself on someone else's tongue - on Derek's tongue - when he starts opening him up, grinding against him, confessing how he's wanted this since the first day you came in and he was dying to just fucking take you somewhere at the conference yesterday and fuck Stiles your mouth, your fucking mouth-\nStiles is making desperate noises of need and then Derek's inside him, and the burn is now an ache and would you just fucking move Derek, Jesus Christ. There's a filthy smile in response and Stiles is biting his lip and turning his head to the side, mouth pressed to the pillows because he doesn't trust what the fuck would come out of it right now but he knows Derek wouldn't care.\nAnd Derek's holding his hip, keeping a hand on Stiles' jaw so he can pull him back to face him, kiss his mouth, lock their eyes together as they climb towards the same goal.\nThere's a burst of white, and a slew of curses, and Stiles is half-sure he left his body for a second, but Derek's collapsing on top of him, hair damp and nose buried beneath his jaw, and there is not a single thing wrong in the world.\n.\nIt's 3am when Stiles wakes, TV flickering soundlessly on the wall opposite the bed, and there's an ache in Stiles body from various repeat performances which is dulling at the kisses Derek's pressing into his spine.\n\"I think you broke me,\" he murmurs sleepily, a lazy smile spreading over his face where it's pressed into the pillow. Derek's forehead leans into the muscles of his shoulder blades and a soft bloom of breath - a laugh - chases the chill from the cracked window away.\n\"You broke me first,\" he replies, lips against skin. \"'S like, you took one look at me and cracked me open and I haven't been the same since. I'll never be the same again.\"\nStiles eyes close contentedly, his smile fading as sleep begins to reclaim him. \"Think I was right the first day you smiled at me,\" he confesses into the silence. \"Really am doomed.\"\n...\nIt's eighteen months later, and Stiles is standing in the break room at Alpha, studying the abandoned selection of syrups above the coffee machine. He feels Derek's arms wrap around his middle before he even hears him, a kiss pressed to his temple by smiling lips.\n\"Need me to give you a tour, or do you remember your way around?\" he asks, nosing the skin behind his ear.\n\"I think I can handle it. As long as no-one picks on the new guy.\"\nDerek laughs. \"If they do, you send 'em straight to me.\"\n\"I love it when you get all protective alpha-wolf on me. It's hot,\" he says, turning in his arms. Derek raises an eyebrow.\n\"Oh yeah?\" he says, kissing him. \"I'll have to remember that one. So how's Danny settling in at Rolling Stone?\"\nStiles shrugs. \"Oh, you know, probably infiltrating intelligence to take down their management, usual Danny stuff,\" he says. \"He left big shoes to fill.\"\n\"You're going to be fine,\" Derek soothes, hands trailing up and down Stiles arms. \"You were practically running this place when you worked with me.\"\n\"Are you trying to butter me up or something? What brings you to the break room, Mr. Hale?\" he asks suspiciously. Derek grins and pulls a coffee cup off the shelf.\n\"I kind of missed those lattes of yours while at work...\" he says innocently, and Stiles gives him a withering look.\n\"Don't you have an assistant to do that?\"\n\"Lydia's coffee sucks,\" he complains. \"And I'm still kind of hungover from my engagement party.\" He gives him one of those fucking puppy looks he must have picked up from Scott and dips his head, and clearly using the reason for his hangover is some kind of diversionary tactic. Stiles rolls his eyes and takes the cup, turning back.\n\"Fine, but this is the first and last, I swear. It's only because I love you.\"\nDerek kisses the back of his head, resting his forehead there.\n\"And I'll never get tired of making you tell me that.\"\n \n \n \n\n\nFIN\n\n\n \n\n \n \n \n\n\n \n\n "
}