{
    "id": "6632965",
    "url": "https://archiveofourown.org/works/6632965?view_full_work=true",
    "author": [
        "aloneintherain"
    ],
    "title": "Always Glad You Came",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Spider-Man - All Media Types",
        "Marvel Cinematic Universe",
        "Fantastic Four"
    ],
    "relationships": [
        "Peter Parker/Johnny Storm"
    ],
    "characters": [
        "Peter Parker",
        "Johnny Storm",
        "Susan Storm",
        "Reed Richards",
        "Ben Grimm"
    ],
    "additional_tags": [
        "Hurt/Comfort",
        "Puppy Love",
        "Fluff",
        "Emotional Hurt/Comfort",
        "Johnny is a giant Spider-Man fanboy",
        "overprotective Fantastic Four",
        "Misunderstandings",
        "teenage spideytorch"
    ],
    "language": "English",
    "series": "",
    "published": "2016-04-23",
    "completed": null,
    "words": "13,290",
    "chapters": "1/1",
    "comments": "337",
    "kudos": "21,141",
    "bookmarks": "5,031",
    "hits": "191,433",
    "summary": "<p>Spider-Man is a relatively new, controversial vigilante, and Johnny has a crush the size of the Empire Building. The Four - operating under the assumption that Spidey is an adult - do not approve.</p>\n<p> </p>\n<p>“I just happen to think Spider-Man's cool,” Johnny says, matter-of-factly. “A hero can think another hero is cool without making it weird. I admire his aloofness. And his badass-ness.”</p>\n<p>“His <em>aloofness</em>,” Ben repeats, chuckling into his mug of beer. It’s roughly the size of Johnny’s head. “Yeah, <em>sure</em>, I bet that’s all your admire, right?”</p>",
    "notes": "<p>I don’t write romance often, and I don't really have one OTP for Spider-Man, but I enjoyed writing this because of how innocent and fun teenage!spideytorch is. These kids are adorable and weird and I had so much fun writing their banter. Also: it's well know that I prefer NYC to love and accept Spider-Man, but I do actually see them hating him when he first starts out. Like, trash throwing, Daily Bugle supporting kind of hatred.</p>\n<p>Most people in this fic are operating under the assumption that Spider-Man is a grown adult, definitely more Sue’s age than Johnny’s. Warnings for consequential crappy behaviour towards a disguised!minor.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>I know Johnny is often a lot older in canon (and fanon), but teenager Johnny Storm is my lifeblood. And at first I was very critical of MCU's 15yo Peter, but I've decided that I really, really like it. </p>\n<p>This fic was supposed to be 5k at the very <em>most</em>, but it somehow tumbled into this. I don't know. I'm sorry. I'm usually a strictly gen writer. I definitely will be doing more family!team fics in the future, but maybe, maybe, more romance, too? Maybe.</p>",
    "text": "Spider-Man is a mysterious, shadowy figure in the eyes of the public. All footage of him is blurry or captured from a great distance—climbing and swinging and moving in a way that doesn’t seem human.\nRumours had begun to circulate of people being pushed out of the way of trucks, of muggers and rapists strung up in webbing, and people caught safely in midair before they could hit the asphalt. But even then, the Daily Bugle and the obsessed NYPD shout over the top of those claims. Louder. Drowning them out.\nIt’s easy to see how a city might come to hate a hero. Spider-Man is this otherworldly, controversial figure.\nJohnny thinks he’s the coolest thing ever.\nSo maybe he harbours some small measure of hero worship for the vigilante. Johnny has watched shaky YouTube videos of the guy righting tipping buses and flipping high into the air, swinging so fast and so recklessly it looks like he’s flying. And Spider-Man does all of this while being slim and silent, a dark protector of New York City. Not wanting fame, but wanting to keep his city safe.\nCool. So impossibly cool.\nSlowly, other people began to think so too. Spider-Man memorabilia starts popping up; t-shirts and bedspreads, little necklaces and wristbands that proclaim the wearer’s support for the masked vigilante. The city hates him for the most part, but there are some that don’t. A niche who fervently support Spider-Man.\nAfter the very public, very awesome defeat of the Lizard, Johnny is officially hooked. Posters are hung on his walls, t-shirts stuffed inside of his already full drawers. Spider-Man becomes his incontestable favourite.\nHis teammates don't agree with Johnny’s enthusiasm, however.\nSue purses her lips when he comes down for dinner, his t-shirt red, an increasingly infamous symbol on his chest.\n“Is that appropriate?” she asks, carrying a large salad bowl from the kitchen.\n“What, my t-shirt?” Johnny glances down at it, as if to check that it hasn’t suddenly sprouted swear words or pictures of naked women in his trek down the stairs.\nBen barges his way past Johnny, taking a seat at the end of the table. “She’s talking about your school girl crush on that Spider-Guy, squirt.”\nJohnny splutters. “I don’t have a crush!”\n“Who does Johnny have a crush on?” Reed asks as he pops out from the kitchen, platter of skewed chicken in hand.\n“Spider-Man,” she says, fetching a pitcher of juice.\n“Sue! I do not—”\n“No? Then explain the t-shirt, and the posters, and the way you freeze whenever Spider-Man comes on on the news.”\n“I just happen to think he’s cool,” Johnny says, matter-of-factly. “A hero can think another hero is cool without making it weird. I admire his aloofness. And his badass-ness.”\n“His aloofness,” Ben repeats, chuckling into his mug of beer. It’s roughly the size of Johnny’s head. “Yeah, sure, I bet that’s all your admire, right?”\nReed sits down on Ben’s right, cutlery in hand. “I’ve seen the videos, too. I know he does look rather fetching in that spandex.”\n“He does have a nice ass, doesn’t he?” Sue agrees.\nJohnny makes a disgusted noise in the back of his throat, and clamps his hands over his ears. It’s hard enough to live with his three adult teammates, but it’s even harder to hear them talk about things like attraction and sex.\n“La-la-la! I can’t hear my sister talking about other hero’s asses!”\nBen throws a balled up napkin at Johnny’s head. The teenager catches it in one hand.\n“Sit down,” Ben grumbles. Johnny makes a face, but obliges, taking a seat beside his sister.\n“I think he’s a bad influence,” Sue goes on. “We don’t know anything about him.”\n“I agree,” Reed says. “He doesn’t adhere to local government like we do. He could very easily turn to villainous activities without having to face the consequences. We don’t know anything about him, not his name, his face. We don’t know what he’s doing—he could already be committing crimes without anyone being any wiser. Like the Bugle said, he could very easily be a menace.”\nEveryone at the table makes a face at that.\n“You can’t trust anything in that paper,” Ben says. “But sorry, kid, Reed’s got a point.”\nSue takes several chicken pieces before passing the tray to Reed. She at least has the decency to look sympathetic, as she says, “I just think your crush should stay only a crush, Johnny. Don’t try and get close to him.”\n“Okay,” Johnny says, if only to put this conversation to rest. He munches on his chicken, a little put out. “I’ll stay away from Spider-Man.”\n \n \n \n \nIn Johnny’s defence, he does try to stay away from Spider-Man.\nEven if he wanted to track him down, Johnny doubts he could. If the entirety of the NYPD hadn’t had any luck in pinning Spider-Man down, Johnny wouldn’t either.\nThe Four continue to disapprove, and Johnny continues to watch the vigilante on YouTube and news broadcasts, and be completely unsubtle about his admiration.\nBut New York is only so big. The city is riddled with super-villains, destructive and loud and drawing the attention of every superhero in a five mile radius. Johnny’s met a bunch of colleagues that way, introducing himself over the sound of gunfire, shaking hands between dodging plasma blasts. Bonding experiences in their line of work.\nHe’s flying late at night. The others are tucked away in the Baxter Building, but Johnny is lead outside by an itch under his skin and clear, seductive skies.\nA big, beefy guy in a rhino costume, is doing his best to tear New York a new one. Someone barely half the villain’s size flitters above him, strings of web following his arching swings—\n“Spider-Man!” Johnny shouts, hands cupped together. “Dude!”\nThe vigilante looks up at the sound of his name. Rhino sweeps a broad hand into the air, and Spider-Man, still looking up at Johnny, flips horizontally in the air, curling into an impossibly small ball as he soars over the villain’s head, dodging a hit he hadn’t even been facing.\nJohnny watches as the other hero uncurls and dropkicks the villain across the face.\n“Oh, my god,” Johnny whispers to himself. This is why Reed needs to hurry up with that fireproof phone; this would be so amazing on YouTube.\nSpider-Man uses the momentum from the kick to jump back into the air, twirling away, like a puppet on strings.\nHe flies closer. Whether it’s to join the fight or introduce himself, he’s not sure. He hovers above them, and the Rhino scowls.\n“Go home to the Fantastic Four, child,” he rumbles. “This is not your line of superhero-ing.”\n“Human Torch,” Spider-Man says, and Johnny almost drops out of the sky. He’ll admit, this is a little much, even for him, but Spider-Man. Right there. In front of Johnny.\n“I just want to say—” Johnny starts. Spider-Man’s attention turns to him. He focusses on Johnny, like a moth drawn in by Johnny’s brilliant flames, and misses the Rhino’s next punch.\nJohnny’s warning shout comes too late. Spider-Man tumbles out of the sky, unconscious.\n \n \n \nSpider-Man is hurt, and Johnny’s not a monster. He’s not about to leave someone unconscious in the middle of New York City. Especially not someone like Spider-Man, who has a gallery of villains and a secret identity to maintain.\n“Whaa…?” Spider-Man sits up, hand pressed against his masked temple. He tries to climb to his feet, but wobbles dangerously. Johnny gently guides him back onto the bed. “Where…?”\nSue clears her throat. The vigilante looks up, catches sight of Sue’s Disapproving Mom face, and makes a choked, terrified noise. Johnny doesn’t really blame him, honestly.\n“You’re Sue Storm,” Spider-Man says. He looks at Johnny next. “And you’re Johnny Storm. Ohhhhh noooooo—”\n“Oh no is right,” Sue begins hotly.\n“Sue, come on, the guy’s injured! I helped him home and let him crash on my bed—”\n“On your bed, huh?”\nJohnny glowers at her, for once ignoring the innuendo. “What, so I’m not allowed to have people over? I’m not allowed to have free reign over who comes in here—”\nSue sounds a tad hysterical as she says, “No, not when they’re dangerous adults with questionable morals! You don’t even know who he is behind that mask, Johnny!”\n“Um,” Spider-Man says. “Where am I?”\n“The Baxter Building,” Johnny tells him, ignoring Sue’s worried, scowl-y face. Big sisters, what can you do. “My room. I carried you here after you got KO’ed by Big, Bad and Ugly.”\n“Carried me here,” Spidey repeats.\n“You’re welcome,” Johnny says. Sue glares at him from the doorway. “Hey, if it wasn’t for me, he would’ve been smushed by the Rhino! He would’ve been road-pizza!”\n“You shouldn’t have intervened,” she argues.\n“Thanks for not letting me not be road-pizza,” Spidey says. Finally, some gratitude. “But I should really go.”\nBefore Johnny can grab him, the other hero clambers over the bed frame and towards the window. Johnny has never regretted owning convenient manual windows before, but as he watches his idol climb onto the windowsill, he definitely does.\n“Please don’t kidnap me while I’m unconscious again,” Spider-Man says.\n“Wait—” Johnny starts, but Spider-Man is jumping out of the window before the words have even left Johnny’s lips. He stares after him. The little twirling figure of Spider-Man slowly gets smaller and smaller as he swings deeper into the sprawling city.\n“I love you,” Johnny whispers quietly. Reverently.\n“I’m not sure if this is creepy or pathetic or just plain sad,” Ben says. “Probably a sick mixture of all three.”\nJohnny scowls. Ben has joined his sister in judging him not-so-silently from the hallway.\n“It’s worrying, is what it is,” Sue corrects. “New house rule—no sneaking dangerous vigilantes into the house without the team knowing.”\n \n \n \n“When I told you not to kidnap me when I was unconscious,” Spider-Man says, “did you think I was joking?!”\n“You said that?” Johnny squints at his pizza slice, trying to recall their last encounter through the haze of admiration. “Huh.”\n“Dude,” Spider-Man says. “Not cool.”\n“Saved your life, though. Those super-villains were about to start ripping your unconscious body apart with their bare hands.”\nSpider-Man regards him with those unnerving googled eyes for a long moment. It’s the longest the other hero has looked at him; last time, two weeks ago ago, the guy had bolted for the window as soon as he’d woken up. Now, he seems halfway willing to talk with Johnny. He counts it as a win.\n“Yeah,” Spider-Man says, “they all probably would’ve, if you hadn’t got me out of there. So thanks, I guess.”\nJohnny slides the open pizza box towards the other hero. “Want some?”\n“Yes,” Spider-Man says immediately, reaching out to scoop up a slice that’s mostly just slippery cheese and pepperoni. He rolls his mask to his nose with one hand. Johnny goes still.\nSpider-Man’s jaw line isn’t defined, not like Reed’s, and nothing like Ben’s. There’s none of the dark stubble he’d expected, no hints of badass scars or shaving nicks. His lip is split, though, bloody and puffy and definitely sore looking.\nHe’s pale. Paler than Johnny. His skin is smooth. A nasty bruise is purpling along his chin.\nSpider-Man seems to realise mid-bite what Johnny is staring at. He drops the pizza back into box like it burnt him, shoves his mask back down, and jumps to his feet.\n“I should go,” Spider-Man says quickly. He sounds nervous.\n“No, stay!” Johnny tries to look honest, trustworthy, but he knows he probably just looks desperate. He’s usually so good at making friends. People flocking to him both in and out of the suit. He’s never tried to socialise with someone like this before—someone mysterious and paranoid and being hunted like a dog by the NYPD, reporters, and half the super-villains in New York City.\n“I hadn’t even thought about—” Johnny gestures at Spider-Man’s masked face. “—when I bought us pizza. I just thought that I was starving, and that you probably were, too. I promise not to stare, but. But I think you should stay.”\nSpidey takes another small, anxious step back. He doesn’t trust Johnny.\nJohnny’s not offended. Not really. The guy doesn’t seem to trust anyone, and that’s not a surprise. Lone heroes are often paranoid and distrustful. If Johnny had the same reputation as Spider-Man, and the same kind of nut jobs after him, he’d be a little paranoid, too.\n“I carried your unconscious body, dude,” Johnny says, not unkind. “If I wanted to see what was under the mask, don’t you think I would’ve already peaked? I mean, I didn’t, but I could’ve.”\nSpidey exhales noisily. He sits back down.\n“So,” Johnny begins, looking off into the night’s cityscape, millions of lights winking against the starless backdrop, “why are so many super-villains gunning for you? And the cops, and the Bugle, and—”\n“The universe just hates me,” Spider-Man says. “It’s a thing.”\n“The universe can’t hate you. It’s not a thing.”\n“It is a thing! I’m just doing my thing—”\n“Your spidery thing,” Johnny interrupts.\n“—my spidery thing,” Spider-Man agrees, “and next thing I know, a bunch of old guys in weird costumes are trying to kill me.”\nJohnny raises an eyebrow. “Just like that.”\n“Well, I mayyyyybe got between them and their crimes, but what was I supposed to do? Let them rob those banks and destroy the city?”\n“From their point of view, yeah, you should’ve just watched from the sidelines,” Johnny says, laughing.\nSpidey makes a breathless noise in his throat, like all the air has been punched out of him. “If you think I should’ve stood back and let them just—just go around and hurt and kill innocent people—”\n“Whoa, whoa, I was totally not implying that. You’re cool for helping those people. I just mean the super-villains probably aren’t so keen on your heroic deeds, man.”\nSpidey’s indignation simmers and settles into embarrassment. The vigilante ducks his head, shoulders curling, and says, “Ah. Right. Sorry, I just—I thought—”\n“It’s cool,” Johnny dismisses. He picks up a pizza slice. He takes his time chewing it, Spidey squirming a little beside him, while he thinks. So many questions. The perfect opportunity to ask the older, mysterious hero something no one else can.\nFinally, Johnny asks, “So. Avengers or Fantastic Four?”\nSpidey starts a little. “Um. Avengers.”\n“Seriously? I’m sitting right here.”\n“It’s not my fault they’re cooler! They just are!”\nJohnny pulls the pizza box a little closer to him. “I should take this back, you ungrateful—”\n“No, nono—” Spidey scoops up three slices, layering them over each other like the world’s greasiest sandwich, and takes a big bite. His mask is up, and there’s sauce on his cheek. Johnny does his best not to stare.\n“Pizza or burgers?” Johnny asks next.\n“Pizza,” Spider-Man says through his full mouth. Johnny, who’s lived with Ben for far, far too long, barely flinches at the bad manners.\n“Pirates or ninjas?”\n“Ninjas.”\nJohnny gasps. “No! Spidey, I thought I could trust you.”\nSpidey laughs and takes another huge bite of his pizza stack. He smiles, and his cheeks bulge, and Johnny feels accomplished, somehow. At making the other hero comfortable in his presence.\nHe’s a lot skinner up close. Johnny had thought the guy would be all rock-solid-Batman muscle, but he’s not. He’s lean, limbs almost delicate, hiding that ridiculous, inhumane strength.\nHe can feel his crush worsening. He can’t bring himself to regret it.\n \n \n \nJohnny finds Spider-Man sat on the ledge of an apartment building, legs tucked under him, chin on his knees.\nHe hovers over him. His flames are bright in the nighttime, licking up his body and sending orange flickers over Spider-Man’s suit.\n“Looking a little lonely, webs,” Johnny says. “Need some company?”\n“Not really,” Spidey says. He sounds exhausted.\n\u2028Johnny lands anyway, flames giving way to tan skin and his blue suit. He collapses down next to Spidey, legs dangling over the edge. There’s space between them. Spidey is tightly coiled, like a spring, or a gun about to go off; Johnny doesn’t want to accidentally set him off.\n“What’s up?” Johnny coaxes. Spidey’s shoulder lifts into a stiff, unhelpful shrug. “Okayyyy. Well. Ben broke the couch this morning.”\nSpidey doesn’t move closer, but he cocks his head, confused, intrigued. Johnny takes it as permission to go on.\n“Yeah, he was sleepwalking. He doesn’t do it much now days, not since his, er, rockification. He got up at like 8am when Sue was making breakfast, wondered out into the living room, and threw himself onto the sofa. It splintered under him.”\nSpidey makes a soft, breathless sound and tucks his face into the crook of his arms, as though to hide a smile. “Yeah?”\n“Oh, yeah,” Johnny says. “I mean, I didn’t see it, because I’m sane and don’t get up before 9, but when I came out the couch was in pieces and Ben was all grumbly and Sue wasn’t talking to him, so. I got Reed to tell me the story with enough badgering. He was there. Saw the whole thing.”\n“Dr. Richards woke up at 8am?” Spidey whisper is tentative, a little low. It makes Johnny’s heart twist.\n“Reed? No way, man. He’d pulled another all-nighter and was either getting scolded by Sue or was fetching more coffee.”\nSpidey loosens the longer Johnny sits there and talks to him. Once he’s thawed out, almost as talkative as the infamous rumours are beginning to say, Johnny springs to his feet.\n“Are you hungry, man?”\n“No.” Spidey’s stomach gurgles at the thought of food. Spidey ducks his head, and corrects, “Okay, maybe.”\nJohnny laughs and hauls the other guy to his feet. Spider-Man is cold to the touch—most people are to Johnny, but the vigilante seems especially so. He lets his hands linger over silky spandex, feeling warmth flare in his stomach, spreading out over his torso, up into his face and down into his very fingertips. Spidey doesn’t snatch his hand away. Johnny supposes it’s just because of how warm he is to the frozen hero.\n“Let’s go get something to eat,” Johnny says, and goes. Spider-Man, after a hesitant, bewildered pause, follows.\n \n \nThe door jangles when Johnny pushes it open. The shop inside is small, cosy instead of cramped, with Christmas lights dripping from the ceiling in shimmering, ropey vines. The brick walls give way to faded, outdated bands posters. The counter is weighed down by clear jars of coffee, teas, biscuits, paper mixes of hot chocolate.\nSpidey pokes a hanging plant—leaves drooping, only one of many within the store—and levels a glance at Johnny. “This place doesn’t look like your scene.”\n\u2028“My scene?” Johnny repeats. “What, cause it’s not a nightclub?”\nSpidey shrugs. Johnny waves off the brief flash of hurt; for some reason, he thought Spidey would be different. Like Spidey doesn’t live in the same city as everyone else, with its constant swirl of invasive press and celebrity speculation, where Johny is just a pretty face or a reckless partygoer.\n“It guess I expected better of you,” Spidey says at last, and this time, Johnny can hear the smile in his voice. “This place is just so… hipster-y.”\n“Like you’re not even a little bit hipster-y.” Spidey squirms a little. Johnny guesses he was exactly on the mark, on that one. “You totally are, aren’t you? I bet you secretly love this place, you big old snob.”\nSpidey fiddles with a succulent growing out of a fractured teacup on one of the tables. “Maybe,” he allows.\nJohnny’s laugh is cut off by an elated cry as Carry exits the kitchen, spots him, and swoops him up into a hug.\n“Johnny!” she says, her German accent and dark makeup as thick as he’d remembered. “You’ve come for visit!”\n“Hey, Carry,” Johnny says, squeezing her gently before letting her go. She beams brightly at him. “I brought a friend.”\nSpidey peeks out from behind Johnny, shy under the soft lights of the restaurant and Carry’s sharpening gaze. “Um, hey, pleased to meet—oof!”\nShe sweeps Spidey up into a hug as enthusiastic as Johnny’s. He has to admit, he’s a little jealous; he hasn’t had the chance to hug Spider-Man yet. Carrying his unconsciousness body away from murderous super-villains does not count.\n“Spider-Man,” she greets. “It’s so good to meet some of Johnny’s superhero friends. I’ve seen the things you’ve done for this city. Wonderful. Wonderful.”\nSpidey squirms a little. “It—it wasn’t anything.”\n“It was,” Carry insists. “You’re the hero this city needs, even if it hasn’t recognised that yet. Some of us have already begun to see that, yes?”\nShe gestures to the cork board framed between a hanging jade plant and an advertisement for a concert long since passed. It’s filled with photos—places from around the city, food vans and steaming meals, polaroids of smiling people, and newspaper articles of the Avengers, of the Fantastic Four, Daredevil. Spider-Man.\n“O—oh,” Spidey stutters. “That’s…”\n“It’s the Board of New York,” Carry says. “We put all of our favourite things there. This city is full of great people, and food, and places, and superheroes. So many wonderful heroes, but it is you that I am most excited about, Spider-Man.”\n“Me?” Spidey asks, faintly.\n“You. You are new, but you will grow, yes?”\nJohnny huffs, offended, while Spidey drifts away and touches the board with feather light, reverent fingers.\n“I thought I was your favourite,” he whines to Carry.\nShe laughs. “I love your team, Johnny, but they are more for space threats, right? Weird alien things coming to eat the planet? I prefer heroes who work in the streets for the common peoples.”\n“Like Spider-Man,” Johnny grumbles, though he can’t be too mad. He understands. Spider-Man is his favourite, too.\n“Like Spider-Man,” she agrees with a laugh. “Speaking of: you two go sit down. I’ll bring you pasta. It’s our special tonight.”\nJohnny drags Spidey away from the cork board, just as the vigilante finishes snapping a photo on a cracked phone. He pulls the hero into a small booth, and doesn’t comment as Spider-Man makes the cork board his wallpaper. To each their own.\n“Now do you see the appeal?” Johnny says. “I’ve lived in New York for ages, but I still feel like a stranger half the time. This place is just so big. You’ve got to have those places that are just welcoming.”\nSpidey hums under his breath. “Sometimes you want to go where everybody knows your name. And they’re always glad you came.”\n“Exactly.”\n“You wanna go where people know our troubles are all the sammmme—”\n“Is that singing…?”\n“It’s Cheers, dude.”\n“What?”\nSpidey stares at him from across the tiny, rickety booth. “Cheers? No? Darn, I really need to thank my Au—erm. My family-person for making me watch that.”\n“I have no idea what you’re talking about,” Johnny informs him.\n“Drinks!” Carry announces. She puts mismatching cups in front of them, a spoon and tiny biscuits stacked on the accompanying plate.\nJohnny takes a testing sip and scowls. “Hot chocolate? Carry. Not cool.”\n“Is late! No caffeine. You should be heading to bed after this.”\nJohnny bickers with Carry and Spidey relaxes more and more into the soft back of the booth. This time, when he tucks his mask to his nose, no one stares at him. The other occupants ignore them, even dressed in bright spandex as they are, too focussed on late night caffeine fixes or the laptops pulled in front of them.\nThe lighting is dim and the atmosphere is soft, welcoming. Spider-Man is curled close by, and Johnny feels like he could stay in here all night, warmed by a slow influx of drinks, and pasta, and Spider-Man’s presence.\n \n \n \nJohnny’s ankle is sprained. He’d dropped from the sky, fire spluttering and streaming behind him like a falling comet, and landed wrong. He’d survived, sure, but his head had met the asphalt hard. Blood drips into his eyes, his temple screaming at him, and he can’t stand. Every time he tries, the dizziness rushes up and tips him back to the ground.\n“Little firefly,” Doom taunts, “your family isn’t here to protect you. What will you do now that I’ve clipped your wings?”\n“Crr—cree,” Johnny stutters. “Creepy.” Curse his concussion for taking away Johnny’s fantastic wit. If there was ever a situation that called for snappy one liners, it was this.\nA gauntlet extends. Metal fingers brush against his wet cheek, up his temple, and fists in his blond hair. Johnny’s head is pulled back tight, and he screams from behind clenched teeth as his head wound is jostled.\nThe other hand brushes against his throat. “First I’ll kill you, and then I’ll go after your sister—”\n“How about you start with me?!” That echoing voice, and then the sound of something slamming roughly into metal. The gauntlet retreats. Johnny slumps against the pavement.\n“Ow,” he says.\n“Ow is right.” Spider-Man’s mask swims into view. The vigilante is crouched nearby, inches from Johnny. He cocks a head. If Johnny didn’t know any better, he’d think the guy was smiling. “You okay, flame-brain?”\n“I left okay behind with my ribs about half an hour ago,” Johnny says.\nSpidey laughs. He disappears for a few seconds, and Johnny hears the distinct thwip of webbing and Doom’s swearing, and then Spider-Man’s back, scooping Johnny up and carrying him away.\n“We have to go,” Spidey explains. Johnny gasps as Spidey throws them into the air, airborne and tumbling through the city, so different from flying. The buildings swirl around them in a haze of colour.\n“Go?” Johnny repeats, nauseous and concussed.\n“Doom’s an A-lister, dude, and I’m just one very inexperienced, very alone spider. If the Four can’t take him down, I sure can’t.”\n“But you’re Spider-Man,” Johnny gasps into his shoulder. “You’re. You’re Spider-Man.”\n“The webs and the giant spider symbol kind of give it away, don’t they?”\n“Now, I mean—you’re special. You’re a badass.”\nSpidey laughs, and it sounds a little awkward and off-kilter even to Johnny’s ringing ears. “Thanks,” he says, “but I’m really, really not.”\nJohnny’s hand tightens on Spidey’s shoulder. The spandex is too tight for Johnny to grasp at it, to curl his shaky fingers in it like he wants to, but Spider-Man is reassuringly solid beneath him. He’s smaller than Johnny, shorter and thinner and nothing like he imagined, but he’s here. He’s real. He had Johnny’s back; and by extension, he had the Four’s back. Sue’s back.\n“You’re a hero,” Johnny slurs, ears already gone deaf to Spider-Man’s response, before passing out.\n \n \n \nJohnny wakes to Sue’s voice. Sue’s loud, frustrated, scared voice.\nHe bolts up and immediately regrets it when the world spins and he retches.\n“Oh, thank god. You’re awake. Please convince your family not to chop my head off, and put it on a spike in the front of the Baxter Building to ward off all the other vigilantes who might want to befriend you.”\nJohnny squints. Spider-Man is stuck to his ceiling, tucked into a gravity defying, nervous little ball. Sue and Reed are stood at the end of his bed, arms crossed and looking the very picture of disappointed parents. They’re both beat up, post-battle bloody, but that does nothing to soften their glares.\nHe collapses back onto the mattress. His head is screaming at him, and his ankle feels stiff, his whole body aching like he’d been thrown through another building.\n“What happened?” Johnny groans out.\n“Doom happened,” Ben rumbles from Johnny’s bedside. Unlike Sue and Reed, he isn’t casting suspicious glances at the person on their ceiling, all his focus pinned keenly on Johnny.\n“Fuck that guy,” Johnny says.\n“Fuck that guy,” Ben agrees, over the sounds of Sue chiding Johnny about his language.\n“I punched him in the face for you,” Spider-Man says. And oh right. Spider-Man had come to his valiant rescue before Doctor Doom could pummel him into dust. That was an actual thing that had happened. (Johnny’s definitely going to tweet about this when he gets his energy back. His followers are going to lose their collective minds.)\n“We could’ve handled it,” Reed insists.\n“Um, no, you couldn’t’ve,” Spidey says. “Not in time to save Johnny. You’re welcome, by the way.”\n“My knight in shining armour,” Johnny says drily.\n“Hey, just returning the favour.”\n“I saved you twice, if I remember correctly, so you’re returning one half of the favour.”\nSpidey snickers into his gloved palm. The sound is so easy, reflective almost, that it makes something satisfied bloom warmly in Johnny’s chest. He did that. He drew that sound from the reclusive, lonely vigilante.\n“I’m sure I’ll have many, many opportunities to return the second half of the favour,” Spidey teases, “considering how often you’re in trouble…”\n“Is that a promise?” says Johnny.\n“You provide the pizza, I’ll provide the butt-saving,” Spidey says.\n“Okay, no,” Sue interrupts. “No. Family meeting. Outside.”\nJohnny starts to argue, but Reed twists a frown and shakes his head Johnny’s way, and he knows he can’t worm his way out of this one. Ben is already rising out of the too-small chair.\n“Nice to meet ya, webs,” Ben tells Spider-Man.\nThe vigilante waves his hand awkwardly at his huge, departing back. “Nice to meet you too?” he says, like he’s not entirely sure.\n“Thanks for coming to my assist,” Johnny says with an apologetic smile. His body is stiff, aching, but Johnny’s fought harder feeling worse, and pushes himself out of bed and limps after his family.\n \n \n \nWhen they’re all in the living room, Sue whirls on him, arms crossed. The Disapproving Mom face is out again.\n“We didn’t die!” Johnny tries, throwing his hands up in the air. “Yay for that!”\n“What the hell, Johnny?” Sue hisses.\n“I’m so glad you’re not dead, Johnny,” he mocks in a high-pitched voice. “Whatever would I do without you? The light of my life, my perfect little brother—”\nBen whacks him over the head. It’s gentle, for someone who’s essentially a mountain of solid rock. Johnny clutches at his head and whines in pain anyway, because concussion.\n“I think you should explain to us why Spider-Man is in your bedroom,” Reed interjects.\n“You heard the man. He saved my life. Brought me here. End of story.” That doesn’t seem to be enough, judging from the matching frowns his teammates aim at him. “He’s a superhero, guys! Like us. It’s his job to take down super-villains and save people, remember?”\n“He’s a vigilante. I wouldn’t go as far as to call him a superhero,” Reed says.\nSue focusses all her worry and disapproval and anger at Johnny. He squirms under the weight of it, feeling nauseous in a way that’s more than just the concussion. “We’ve been over how dangerous and untrustworthy he is. Why is it sounding like you two have spent a lot more time together since the last time we saw him?”\n“…because I have?”\n“Johnny!”\n“It’s mostly just been us saving each other. Or me saving him,” Johnny says, proud; he’s not embarrassed to admit he looks up to Spider-Man. The hero is badass, and Johnny’s been able to save him, so that kind of makes him a badass by extension.\nHis words doesn’t change how unimpressed Sue looks. Johnny sighs and scrubs a hand through his hair. “New York isn’t that big of a place, okay? We run into each other. We’re both in the same line of work, it makes sense that I’ve helped him out when I’ve seen him in a tight spot. You might not think much of him, but I’m a superhero, and we help people, remember? All people. Illegal, vaguely creepy vigilantes included.”\nThat makes Sue relent, deflating with a sigh, crossed arms slipping undone. Ben watches over the proceedings as though he’s detached, like he doesn’t quite have an opinion on this ongoing disagreement. He isn’t siding with Johnny, but at least he isn’t siding with Sue and Reed. Going up against his three adult teammates in an argument is far from new to him, but it never gets any easier. Johnny never wins.\n“Please don’t seek him out,” Sue says, her voice a near whisper. All her anger is washed away by this quiet sadness, this worry that pulls her shoulders down and makes her look at Johnny like she’s scared he’s going to vanish, like so many people in their lives have before.\nJohnny’s righteous anger melts with hers. “You don’t know him, Sue…”\n“No one knows him, Johnny. That’s what I’m worried about.”\nJohnny stares at his barefeet, cold against the hardwood of the living room. He wonders if Spider-Man knows they’re discussing him. Probably. For a sickening, stomach swooping moment, Johnny wonders if he’s among the superheroes who have super-hearing, but quickly dismisses it. The guy can stick to walls and shoot webs and flip through high rising buildings with more grace than most flying heroes Johnny knows; he can’t possible have more superpowers on top of that. That would be ridiculous. Excessive.\n“I understand,” Johnny says, without meaning it. “I’ll… I’ll stay away from him.”\nSue pulls Johnny into a hug that he squirms against. She reaches a hand, snags Reed, and pulls him into the hug too. She doesn’t have enough arms to drag Ben into the awkward hug, but when they pull away, Ben ruffles Johnny’s still bloody hair and tells him he looks like shit. That’s as close to I love you and I’m glad you’re okay as Ben gets.\nWhen Johnny returns to his bedroom, wind howls past his open window. Spider-Man is gone.\n \n \n \nJohnny doesn’t see Spider-Man again for a while. A long, painful while.\nSpider-Man is as active as always. The publicity around him remains as bleak and offensive as ever—save for the brief, positive blip in the wake of Spider-Man rescuing the Human Torch, media darling, from Doom’s clutches. But even that had been layered in speculation about the vigilante’s motives. Full of maybe Spider-Man’s trying to get into powerful heroes good graces, we should all be wary and Spider-Man only active because he thinks proper heroes aren’t good enough, look how he interrupted the Four’s battle with Doom!\nThe Bugle had implied that Spider-Man had kidnapped Johnny. That had made Ben cackle and Johnny’s cheeks flush.\nJohnny’s not sure what Spidey did to warrant all the bad press. He vows to ask him next time he sees him, but the time between their last interaction stretches on and the question fades and becomes irreverent.\nAnd then, almost a month after Spidey came to Johnny’s aid, the Baxter Building’s alarms scream to life. Everyone jumps to their feet immediately, their dinner left cooling and forgotten on the dining table.\nBut it’s only Spider-Man that calls out, “Whoa, whoa! I came in peace!”\nSue looks ready to defend their building to the death. Reed purses his lips, his disapproval burning cool, while his wife’s simmers red hot and dangerous.\n“What are you doing here?” Reed asks. Spider-Man, dangling from the ceiling with hands spread in surrender, has the decency to look embarrassed.\n“Um,” Spider-Man says. “I need a favour.”\n“A favour,” Ben says flatly.\n“What is it?” Johnny asks eagerly. He ignores the glares the others shoot him. Spidey lands flat-footed and squirming on the hardwood floor, and Johnny bounces over to meet him.\n“I know I’m not your favourite person,” he begins quickly. “I know you’re with the rest of the city in the Spider-Man must burn for his crimes crusade, but you’re a team of superheroes, and superheroes are strong and powerful and help people and—” Spidey falters. His shoulders dip, his voice grows small. He admits, “I didn’t have anywhere else to go.”\nSomething in Johnny’s stomach twists at the way Spider-Man looks right now, tugging anxiously at his fingers, shoulders dancing around his ears, casting nervous looks at the rest of the Four.\nHe sounds scared, Johnny realises. Spider-Man sounds scared.\nHe casts a glance at his family. They look reproachful. Wary. Don’t they hear how frightened Spider-Man sounds?\n“What do you want us to do?” Sue asks.\n“Help? There’s this villain, Green Goblin. He’s crazy, he’s dangerous—”\nSpider-Man’s voice pitches high, crackling under his panic. Johnny seems to be the only one that catches it. Spidey’s a little weird, he’ll admit, and he can be skittish, but he’s not like this. Johnny knows Spider-Man’s not this easily rattled.\n“Is he attacking anyone right now?” Reed asks.\n“I don’t think so—”\n“And have you told the authorities? The Avengers, maybe?”\n“Well, no… That’s why I came to you…”\nSue’s face softens, if only a little. “It was the right thing to do,” she says, “coming to us.”\nSpidey perks up. “So you’ll help?”\n“We’ll look in to it,” Reed promises, like that’s not the most bullshit cop out Johnny’s ever heard.\n“Oh…” Spidey says. “But he’s super, super dangerous—I really need to search him out and take him down now—”\n“That’s not how the Four operates,” Reed cuts in sharply. Johnny winces; he knows how much the others think this is an issue. How Spider-Man conducts his business—or, rather, how he makes everyone else’s business, from super-villains with secret identities to purse snatches, his business—rankles something for the Four.\n“I know, but the Goblin is—is—he’s savage and psychotic, and I thought—”\n“I’m sure he is. We’ll look into him,” Reed says. “Legally. Through all the proper channels. You can’t just barge your way into other people’s business and take the law into your own hands.”\n“And if he comes after me?” Spider-Man challenges. The panicked fear is gone from his voice, replaced by fresh, hardening steel and the kind of anger born from too many cold, lonely nights with bruised knuckles and villains thirsty for blood nipping at his heels.\n“You’ve proved that you’re capable of handling yourself,” Reed says. “If this villain is too much, call for help.”\n“Call who for help?” Spider-Man asks bitterly, mostly to himself. He shakes his head, and takes several quick, scuttling steps backward.\n“We’ll look into this Green Goblin, Spider-Man,” Sue says, voice pitched soft and reassuring. Spider-Man does not look reassured.\nBen snorts. “You’re a grown man,” he says with his usual tact. “Grown spider. Whatever.”\nThe corner of Reed’s lip quirks up in agreement. “You do seem very keen to prove your capability to the whole city,” Reed reminds the vigilante.\nSpidey looks to Johnny, now. He can’t see the other man’s face behind that big-eyed mask, but his voice is a little raw, desperate. “Johnny?” Spider-Man pleads.\n“No,” Sue cuts in.\u2028\n“I think you should go,” Reed says.\nSpidey casts one last look in Johnny’s direction, before jumping out the way he came.\n \n \n \nJohnny sits at the dinner table with his family, finishes his meal, excuses himself to his bedroom, and jumps out the window.\nHe flies and loops around the block several times, careful to avoid the Baxter Building and its broad, telling windows.\n“SPIDEY!” he shouts into the echoing silence of the night. “DUDE, I’M SORRY!”\nA web snags on his blazing ankle and quickly yanks, spinning Johnny around in mid-air before the webs can melt. Spider-Man, crouched on the shadowy side of a rooftop, hisses, “Shut UP, flames-for-brains!”\n“Listen, man, I’m sorry about what the Four said, I just froze and—”\n“I said shut up.” A second spray of web, and the vigilante successfully drags Johnny onto the rooftop. “Flame off before someone sees you.”\nJohnny’s flames extinguish. Spidey helps him stand on wobbly barefeet. He shivers in a tattered pair of jeans and a pyjama top.\n“Next time you sneak out to apologise, wear a sweater, you moron,” Spidey whispers to him.\n“Thanks, mom, but I’m not just here to apologise. Here to help you. What exactly are we doing, by the way?”\nSpidey turns to look at Johnny properly, head cocked just so. “You should go back,” Spidey tells him after a pause. Johnny thought he might be grateful to have company, grateful that Johnny took this risk to help him out. The flat, disapproving quality of his voice says otherwise. “You shouldn’t be here.”\nIndignant heat flares in Johnny’s stomach and flushes through his cheeks; he went against his family to be here, in the cold and the dark with someone who, according to the larger populace of the city, doesn’t deserve anyone’s gratitude or help.\n“What’s that supposed to mean?” Johnny demands. “I’m here to help you. I want to help you—”\n“You’re supposed to be staying away from me, aren’t you? Your team don’t want me near you.”\nJohnny falters. “They don’t,” he allows, “but I can make my own decisions.”\n“Sure,” Spidey says, and doesn’t rebuke Johnny’s claim and bring up Johnny’s age like a dozen heroes have before. It’s a small mercy. “But they’re your family, right? You should… you should listen to family, when you can.”\n“This is the right thing to do. I want to do this. You’re my friend, Spidey.”\nJohnny knocks their shoulders together. Spidey is stiff under Johnny’s weight, like he’s not quite used to people coming so close for friendly reasons. Johnny throws an arm around his bony shoulders, and he loosens, warms under Johnny’s blazing touch. Leans into it.\n“Thank you,” Spidey murmurs, low and raw in its gratefulness. Then, louder, lighter: “Does Sue make you wear sweaters when it’s cold?”\n“Ugh, shut up.”\n“I knew it; she totally does!”\n“I said shut up.”\nJohnny pounces on Spidey, throwing all his weight onto the vigilante, feet fully leaving the ground. His weight doesn’t bother Spidey, laughing and swinging them around. Johnny hangs on tight. An enthusiastic, wrestling leech.\n“Are you sure you want to be here, Johnny?” Spider-Man asks, like Johnny isn’t slouched and struggling over him. It’s a little awkward, Spidey shorter and thinner than him, but the other hero is so strong, an immovable pillar, one hand under Johnny’s knee to keep him from slipping off.\n“I’m sure,” Johnny tells Spidey’s back. “Are you sure you want me here?”\nInstead of answering, Spidey steps off the rooftop and into free fall. Johnny shrieks and clings, but Spidey holds him tight, shifting until Johnny is wrapped around him. Their pendulum movements are exhilarating; a long, plummeting fall, and then a sharp pull upwards, stomach swooping, wind wrapping around them, like its helping their flight rather than struggling against them.\nIt’s the adrenaline of flying for the first time. It’s the relief of being caught by a teammate the first time after he’d fallen without his flames. It’s amazing.\n \n \n \nThey swing around the city for what must be hours. Spidey doesn’t share any of his overarching plans with Johnny. He suspects Spidey is forgetting his plans anyway, caught up in this easygoing, addicting thing they have between them.\nSpidey lets Johnny look at his web-shooters up close. He was right; they’re not organic. Take that, people on the internet!\nJohnny takes them to late night food vendors. He buys them burnt coffees, and the guy manning the stall gawks at them. Or rather, gawks at Spider-Man, hovering shyly behind Johnny. The Fantastic Four are familiar faces, appearing on news segments and magazine photo-shoots, but Spider-Man? He’s new. He’s unknown. He’s a walking, controversial myth.\nJohnny’s lucky he has a bigger-than-normal ego. This is enough to give a guy a complex.\nBut the Goblin does find them, eventually. Their coffees have long since been drunk, and the new thrill of web-slinging is beginning to ebb. Johnny’s just starting to feel the itching burn of tiredness when Spider-Man stiffens, like a sniffer dog catching a scent. Then something on the street explodes in a fizz of brilliant light, chased by the screaming of terrified pedestrians.\n“Show time,” Spider-Man says, rising to his feet and bolting in the direction of the explosion. Johnny scrambles after him.\nSeveral quick pops of colour and sound follow as small explosions litter the street. People run in all directions. Cars swerve to avoid hitting them. The Green Goblin rocks above the mayhem, bent over laughing on his spluttering glider.\n“We should call the Four,” Johnny decides.\nSpidey looks ready to argue, but the Goblin cackles and launches a much bigger bomb at the street. This time, the asphalt cracks and bends under the force. People shriek in fear.\n“Okay,” Spidey says, “okay. Call them. It’ll be nice to fight with a team on this one.”\nJohnny gropes for his fireproof comm but finds his ear empty. He fumbles with pockets for a phone. He finds nothing.\n“Um,” Johnny says.\n“Oh, no.”\n“The shoes aren’t the only thing I left behind?”\nSpidey sighs, weary and already tired from what’s about to come. “We’ll do this the old fashioned way, then.”\nJohnny’s never fought the Green Goblin before, and he never, ever wants to again. The villains is more than just dangerous, he’s reckless and erratic and willing to pull random civilians into their scuffle to get Spidey to back off. Gaudy pumpkin bombs are dropped and thrown, sending Johnny scrambling after them. He’s stuck on bomb duty, destroying them before the can hit the ground and erupt. He feels like he’s in the world’s sickest game of catch.\nSpidey goes after Goblin, dodging and swerving swipes and thrown projectiles, managing a few times to clamber up onto the glider, only to get knocked back off by a meaty fist or a sharp bladed knife. Johnny knew Spider-Man was strong, but he hadn’t quite realised how much abuse the little guy could take. No matter how many times the Goblin backhands him off the glider, and he collides hard with the asphalt or a high rising building; no matter how may slices of those quick blades he suffers; no matter how many bombs land too close to the vigilante and scorch his suit, Spider-Man keeps getting back up.\nJohnny is kind of in awe.\nThey’re both still amateurs, though. Sure, Spidey doesn’t have the drawback of still being a teenager like Johnny does, but he’s new to the superhero game. Newer than Johnny.\nThey give it their all, but it’s not enough. It’s not enough.\nBombs are missed and punches are taken fully to the mouth. Three civilians have to be taken away in an ambulance. Spidey is shaking where he stands. Johnny feels like he’s been hit by a truck.\nThe Goblin gets away.\n \n \n \nThey rest on the bridge. No one can see them up there, perched where only birds dare go. Spider-Man settles in like its an old couch, worn and shaped to him, and Johnny follows suit. Heights are a familiar friend.\nThe sky lightens, dawn threatening to bloom on the horizon. Johnny needs to head back soon, before the Four wake and discover he’s missing. But not yet. Not yet.\nSpidey’s knuckles are bleeding when he peels his gloves off. He winces as the spandex pulls on drying blood, catching on his open knuckles. The bruises look nasty, sore-looking, blooming deep and purple.\n“I heal quickly,” Spidey reassures when he catches Johnny staring. “I usually wear fingerless gloves during the day to hide them just in case, though.”\n“Smart,” Johnny says. He watches as Spidey pulls the mask to his nose, revealing his grin and split, puffy lip. It’s hot. Oh, god, bloodied knuckles and that cheeky, full lipped smile should not be hot.\nIt’s just before dawn. Everything feels soft and fresh so early in the day. The traffic is far off. The city is an afterthought. Johnny is focussed only on Spider-Man, sat so close beside him, warm and real and smiling so perfectly at him.\nAlmost instinctively, almost without thinking, like they’re magnets gravitating in, they lean closer until their lips brush. It’s hesitant and shy at first, before Johnny dips in fully, and they’re kissing properly, his skin burning and Spider-Man soft beneath him. He doesn’t feel like he’s kissing his idol. He’s kissing his crush. His friend.\nThey pull away. Spider-Man’s breathing heavy, though the kiss was hardly exhaustive enough to warrant that kind of panting. It’s adrenaline, Johnny thinks, his own heart beating an erratic tempo in his chest. He feels light-headed. Giddy. The kind of rush he only gets when he flies.\n“Holy cannoli,” Spider-Man whispers.\nJohnny stares at him. “Holy cannoli? That’s what you say after The Johnny Storm kisses you?”\n“Well, if you’re gonna be all arrogant about it…” Spidey huffs, but he’s smiling.\n“Someone alert the media about your success,” Johnny teases. He licks at his lips; the taste of copper is faint of his tongue. Fresh blood wells from Spidey’s lip, pooling over his spit red mouth.\n“Yeah,” Spider-Man says sarcastically, “because that would make the city like me. The Bugle would have a field day, Jameson screaming about—about how I’m some monster that defiles poor unsuspecting teenagers—”\nJohnny goes still. He stares at Spider-Man and considers a question that he hasn’t thought about in a while. Not since he first started having pizza with the vigilante. It had all seemed irrelevant after he’d gotten his attention and tentative friendship.\nSpidey pauses. Looks at Johnny searchingly. “Everything okay…?”\n“How old are you?” Johnny asks hoarsely.\n“Um…” Spidey ducks his shoulders, rubbing at the back of his neck. He looks embarrassed, not exactly caught out. Not like how Johnny would expect from someone who’s been caught kissing underage kids.\nNot—not that Johnny has ever really cared about that before. He’s made out with people over 18, as uncaring and reckless as everything he does, partway because he can, partway to piss everyone off. To prove he’s more than just a dumb kid.\nBut Spider-Man is something different. With a sinking feeling in his stomach, Johnny realises just how much he’s come to trust the other hero. His crush is still there, red hot and yearning in his stomach, but it would disappoint him to find out someone close to, like, Ben’s age went around kissing teenagers.\n“Spidey,” Johnny says again, slow and sure, “how old are?”\nSpidey shuffles. Ducks his head and looks at his hands, fidgeting in his lap.\n“I’m fifteen,” Spidey says. Johnny stares. Spidey waves a hand in front of him. “Hello? Johnny? Did I break you?”\n“You’re not a pervert,” Johnny whispers. “Thank god.”\n“Johnny, what?”\n“The Four thought you were creepy and weird,” Johnny says. “Erm. No offence.”\n“None taken? I think? Why did the Four think I was creepy and weird? I mean, outside of my costume, and nighttime actives, and generally strange personality and many, many flaws—you know what? Never-mind. Don’t answer that, I understand completely why they thought I was weird—”\nJohnny places a hand over Spider-Man’s mouth, smothering the nervous babbling. It’s a little weird, he has to admit, but it’s endearing as well. Cute, almost. Spidey’s mouth quirks into a smile underneath Johnny’s palm, and he feels his stomach twist at the small point of contact. Johnny had kissed plenty of people before, but there’s something about Spidey, something about his soft lips against his hand, that makes him feel lightheaded all over again.\n“They thought you were older,” Johnny clarifies. “Like, full adult older.”\nJohnny removes his hand, revealing Spidey’s frown. “Hey, plenty of superheroes are older,” Spidey says. “Most, actually, which is why they thought I was older, I guess. Why would that make me weird—”\n“Because I’m sixteen.” Spidey stares blankly at him. Johnny assumes the stare is blank. The mask makes it difficult to tell sometimes. Johnny adds, “And they thought you were an adult? And they realllllly didn’t want their infatuated sixteen year old teammate hanging out with a much older and very dodgy vigilante?”\n“I’m not dodgy…” Spidey says, a touch defensive. Then, his smile blooms, broad and excited, and he repeats, “Wait. ‘Infatuated teammate’, huh?”\nJohnny shoves at him. “Shut up,” he grumbles over the sound of Spidey’s laughing.\n“Nuh uh! You have a crush on me! That’s so embarrassing!”\n“Dude, we literally just kissed.”\u2028\nSpidey laughs and teases, “Stilllll. You like-like me.”\nJohnny groans. “Shut up.”\n“Make me.”\nJohnny leans in. Spider-Man’s mask sits on his nose, showing off his teasing smile, his already healing split lip, the very faint freckles Johnny can only see inches from his face. Spidey’s neck is long and pale and swanlike, and Johnny cups a tentative hand there. When Spidey doesn’t flinch away from his touch, he slides it up to cradle the other teenager’s jaw.\nThey’re both sore and beaten from the Goblin. Neither of them had slept. Both of them needed breakfast. Neither of them cared.\n \n \n \n“Is it because of how gorgeous I am?”\nSpidey pulls his attention away from the screen to glare at Johnny. Without his attention, his car slides off the cliff in a whirl of pixels. This is their tenth consecutive game of Mario Kart, and it’s beginning to lose their attention.\n“Why would it have anything to do with how gorgeous you are?” Spidey asks slowly.\n“You admitted it! You think I’m gorgeous!”\n“Johnny, we’re dating—”\n“Exactly!” Johnny points his controller at the other teenager. His own kart has stopped, the other racers whizzing past as they overtook him. “We’re dating,” Johnny continues, “so you know I already like you. It doesn’t matter much what you look like underneath your mask. You don’t need to be shy just because I’m, like, a male model.”\n“First of all,” Spidey says, “full of yourself much? And second: you just admitted that it doesn’t matter what I look like underneath my mask. So drop it.”\nJohnny throws a handful of marshmallows at him. The candy bounces off of his mask and rolls across the carpet. Spidey, with all the concern for sanitation a teenage boy playing video games at 3am can possess, picks them off the chip littered floor and crams them in his mouth.\n“It matters,” Johnny insists. “Dating you would be so much better if I knew what you looked like. A face to put to my many, many fantasies about you—”\n“Not sure if that’s flattering or gross, honestly.”\n“—and actually have something to call you that’s not so impersonal. Come on, babe. Don’t you trust me?”\nSpidey squirms, fiddling with a half empty bowl of Doritos rather than meeting Johnny’s gaze. “I trust you, I’ve just never told anyone…”\nJohnny stares at him. “No one? At all? So—so your family doesn’t know their fifteen year old is Spider-Man?”\nSpidey laughs, high and a little panicked. “Nope.”\n“Dude,” Johnny says lowly, “all of New York is after your blood. That’s messed up.”\n“Which is why I can’t tell them. It’s for their own safety.” Spidey huffs and stands, exhausted by this argument.\nJohnny’s never had a secret identity, and from the slump in Spider-Man’s shoulders, the way he runs his fingers over the crown of his mask, as though he has a nervous, unshakeable habit of scrubbing his fingers through his hair, he’s very, very glad for the privilege of a public persona. For the umbrella of protection offered to him by older superheroes and the public’s favour. Spider-Man doesn’t have that.\n“You can tell me,” Johnny says softly, like he’s coaxing a stressed, hunted animal. “Your family might be ordinary joes who can’t protect themselves, but I’m not like that. I already have super-villains gunning for me. And the Four. The Baxter Building. Superpowers.”\nSpidey bits at his exposed lip. Johnny’s stomach swoops at the action, but squashes the urge down. The time for attacking his boyfriend with surprise kisses will come later.\n“I don’t know, Johnny…”\n“Come onnnnn,” Johnny whines; serious conversations are boring. He’s provided the logic, he’s refrained from changing the subject with kisses. What more does Spidey want?\n“Johnnnny,” Spidey whines back.\nJohnny flails back, like a grumpy toddler who needs a nap. “Tell meeeee.”\nSpidey flops onto his side, mirroring Johnny. “Noooooo.”\nSpidey rolls onto his stomach, all relaxed limbs and stretched out spandex, and Johnny pounces. A spider-sense works on super-villains and police officers armed with bullets, but not on rogue boyfriends, apparently. Good to know.\nJohnny straddles Spidey and tugs at the mask. “Show me!”\nThe laugh is caught in Spidey’s throat. He twists out of Johnny’s grasp, using his legs to flip Johnny off him. “Ugh, Johnny, you’re heavy!”\n“Are you calling me fat?”\n“Well, if the pants don’t fit…”\nSpidey rolls away, and Johnny races after him. Chips and marshmallows are squashed under their weight, crushed into the carpet.\n“You’ll pay for that!” Johnny promises. Spidey shimmies teasingly, encouragingly, and Johnny lunges. He grips skinny wrists and secures bony hips between his legs, and Spidey lays pliant, letting himself be pinned.\n“Oh, no,” Spidey says dramatically. “I’ve been caught. Whatever will I do.”\n“Give up the identity, webs. Show me how cute your face is!”\nSpidey rises up, pushing Johnny off of him as if the older teenager was weightless. Johnny yelps, flailing and falling onto his back with a thump.\u2028 Spidey climbs over him with a triumphant grin. It’s Johnny’s turn to be pinned. Spidey holds him easily, like Johnny’s wrestling hands are nothing to him; he supposes that they aren’t, not compared to the younger’s super-strength.\nHands hold Johnny to the carpet, and strong, bony knees bracket his hips. Peter smirks, leans down, and teases, “Proportionate strength of a spider.”\n“Man, that’s cheating!”\n“Nope,” Spidey decides. “Totally fine. All’s fair in love and war and secret identities and stuff—”\nJohnny groans in his impatience, throwing his head back against the carpet. His mission has been forgotten, his determination to wheedle the secret identity from Spidey completely gone. “Will you just kiss me already?”\nSpidey goes red. He seems to release their position, how confident and pushy he’s been, and turns shy in a sudden fit of self-consciousness. “Oh, I…”\n“Dude, don’t get all nervous on me now. Kisses! I deserve them!”\nJohnny wriggles in the unbreakable hold, impatient. Spidey laughs, the sound quiet, breathy. He leans in. His lips skim Johnny’s.\n“Like this?” he teases. His breath washes across Johnny’s face, all sugary pepsi and tangy pizza. It should be gross, it should be embarrassing, but Spidey makes Johnny feel flushed in a way his flames never could. The only thing he can focus on is the feel of strong, skinny fingers and the feather light brush of their lips.\n“Spidey!” Johnny complains. He struggles in the other teenager’s grip, wanting to get up, to crash their mouths together, but Spidey keeps him firmly pinned. “Spidey, c’mon, no—”\n\n“Get your hands off of him!”\n\nSpidey freezes. Flushed together, still laying amongst littered chips and game controllers and pizza boxes, they peer guiltily up. The Fantastic Four loom in living room’s threshold, all gritted teeth and furious, balled fists. Johnny hasn’t seen them this angry since the last time a super-villain had tried to kill him.\nIt’s Sue that had spoken, but it’s Ben that strides forward, thundering steps loud against the carpeted ground. Spidey flinches as though to dart away, to scurry up the ceiling, but Ben grabs him around the neck and hauls him bodily off of Johnny.\nProportionate strength of a spider, maybe. Proportionate strength of a mountain? Not so much.\n“Whoa!” Johnny says, fumbling to his feet. Spidey dangles in Ben’s tightening grip, legs struggling for purchase against Ben’s rocky torso. “Ben, let him go—”\n“What are you doing in our building?” Reed demands. His limbs have gone long and unnaturally wobbly around his anger, powers bleeding under his fracturing control. Experience tells Johnny that this is a very, very bad thing.\n“Reed!” Johnny yells, grabbing one jellylike shoulder and hauling him back.\n“I can make him talk,” Ben promises, tightening his grip even further. Spidey splutters, his gasps for air silenced around granite fingers. “Or I could make him never talk again.”\n“Put him down,” Sue orders. Spidey wheezes into the silence her voice creates.\n“Sue,” Ben begins, “you saw what he was trying to do to Johnny—”\n“Put him down,” Sue repeats tersely. Her voice leaves no room for argument.\nBen’s grip loosens enough for Spidey to tumble away. The vigilante scampers under Ben and up the neighbouring wall, not stopping until he’s crouched protectively in the corner, bracketed by two walls and the ceiling, chest heaving.\nJohnny follows him. He hovers protectively at the bottom of the wall, listening to the rough, panicked breathing of his boyfriend and keeping his eyes on his teammates.\n“Johnny,” Sue begins, “what the hell did we just walk in on?”\nJohnny studies his serious family. He can’t lie. Not now.\n“A sleepover, I guess,” he says. “We were wrestling.”\n“It wasn’t trying to hurt him,” Spidey says, loud with desperation, hoarse from being strangled. “I swear, Johnny started it, and —”\n“It doesn’t matter who started it,” Ben grumbles, the words echoing through him like reverberating thunder, “I’m gonna end it—”\n“We’re dating!” Johnny says loudly. All eyes gravitate towards him. “That’s why we were. Um. About to kiss.” He doesn’t want to admit these things, doesn’t want to talk about them in front of his adult friends, but if it saves Spider-Man from being ripped to pieces by vengeful superheroes, then it’s worth it.\nBut the Four don’t back down. If anything, Johnny’s declaration makes them even madder. Both men seem to grow bigger and angrier like territorial birds puffing up their feathers.\n“I’m gonna kill him,” Ben decides, and Reed echoes the sentiment. Spidey shrieks a little, the sound cracking and shrill, as he shoves himself even tighter against the corner, limbs curling in like a dying spider.\n“If you think you can take advantage of a teenager’s crush—” Reed begins, stepping protectively in front of Johnny. He’s stopped by Sue’s hand on his chest.\nShe doesn’t look at her teammates. Instead, she studies the huddled vigilante, and asks, calmly, “Spider-Man, how old are you?”\nReed and Ben falter. Spidey’s breath remains rough and too fast, and he stays silent against the ceiling.\n“Sue, why would you think—” Reed begins.\n“Look around you,” Sue says, gesturing at the messy living room. He does, taking in the haphazard stack of video games and split chips with a frown. “Now, Spider-Man. How old are you?”\nSpidey shakes his head, no. It’s Johnny that answers; “He’s fifteen, Sue.”\n“Johnny!” Spidey hisses.\n“Fifteen,” Sue sighs.\nReed stares at Spider-Man like it’s the first time he’s seen him. Ben slumps, all the fight draining out of him whiplash fast.\n“Fifteen?” Ben asks. The hardness is gone from his voice, replaced with defeat. Ashamed guilt.\n“They were play-fighting,” Sue says. Johnny quickly nods, yes. “Not—not—”\n“He would never,” Johnny vows.\n“Fifteen,” Ben says again. “Fuck, I need a drink.”\nSpidey shifts out of the corner. He drops flat-footed to the ground, but when Johnny reaches out to touch him, he flinches away. Takes several quick steps backward. Glances towards the door.\n“It’s late. You should stay the night,” Sue offers.\nSpidey splutters, still nervous, still choked out. Ben cuts in, “Stay, kid. It’s the least we could do after we freaked out on you like that.”\nReed hangs his head. “I’m so sorry, Spider-Man.”\n“It’s okay,” Spidey says quickly. “You don’t need to apologise, you don’t like me, it’s fine, no one really does, and you were just looking out for Johnny. It’s good to see he has people to take care of him. I mean, goodness knows he needs it.”\nJohnny squawks. “I do not need it!”\n“You totally do, dude,” Spidey teases, snickering. “You need three super-powered babysitters to keep you in line.”\n“I want a divorce,” Johnny tells him.\nSpidey gasps. “Baby, no! What about our dreams? Our mortgage? Think of our children!”\n“I have fallen in love with another,” Johnny says. “I’m going to quit my boring job at the office and run away with her.”\nSpidey wails and slumps against Johnny, pretending to cry into his shoulder. Johnny stares out the window, as though detached from a loveless marriage.\n“Oh, no,” Ben says. “There’s two of them.”\nSue looks as though her entire world view is being reconstructed. She’s staring at Spidey in the same way Johnny’s seen her stare at the especially cute children that waddle around the local parks. Like she wants to snatch them up and keep them. Protect them.\n“Reed,” she whispers, tugging on her husband’s arm, “I was wrong. I was so, so wrong; they’re perfect together.”\n \n \nSpider-Man sits stiffly at their table during breakfast. The awkward silence that fills their living room is heavy. Anticipating.\nSue lays a platter of fried eggs and toast in the centre of the table. Johnny reaches for them, and encourages Spidey to do the same. The teenager pulls his mask to his nose, but flinches and tugs it back down when Sue gasps and puts a hand over her mouth. Reed stills. Ben’s cup shatters in his fist.\n“Jesus Christ,” Ben swears.\n“I—I—” Spidey squirms like he wants to get up and run. Johnny puts a hand on his thigh under the table, and lets his palm warm, unnaturally hot. Spidey relaxes minutely under his touch.\n“You need to see a doctor,” Sue decides. “You should’ve already seen one, what were we thinking—”\n“You were thinking that it wasn’t that bad,” Ben says. He looks angry. Sickened. “That what I did wasn’t—wasn’t that bad—”\nSpidey fiddles with the bottom of his mask. “What is it?”\n“You have bruises on your throat,” Reed tells him, grimacing.\nSpidey’s shoulders curl again, that familiar, nervous gesture that makes Johnny want to wrap him into a hug. “Oh,” he says softly.\nJohnny rubs circles into Spidey’s leg with his thumb. He’ll admit, the bruises were bad. Ringed around the teenager’s pale throat, a necklace of sore, splotchy purple. At least Ben’s hand is too big to leave bruises that resemble fingerprints.\n“I’m sorry, kid,” Ben says. He looks lost. He knows his words aren’t enough, not to erase the bruises he’s left on the teenager, but he’s faltering. Unsure what else to do with the regret. The guilt.\n“It’s fine,” Spidey says. “Really. I heal fast; the bruises will be gone by tonight. And I’ve taken a lot worse from super-villains, so, um. I’m used to it.”\nSue takes a seat across from Spider-Man. She tucks her hair behind her ear, steadies her breathing, and says firmly, “I would like to apologise on behalf of all of us. We haven’t been fair to you.”\nSpider-Man starts at that. He seems honestly surprised by the apology. “What do you mean?”\n“We’ve been treating you badly without knowing anything about you. We thought you were some rogue adult butting into business you had no place in being. We turned you away. We thought you were taking advantage of Johnny.” There’s the Sue Johnny knows, all hard-edged concern and intense blue eyes. It’s kind of nice, seeing that worry directed at someone other than him. “I’m sorry, Spidey.”\n“You’re forgiven?” Spidey says, obviously at a loss.\nReed collects two glasses of juice. He gives them to the teenagers, lays a hand over Spider-Man’s shoulder, and says, “Let’s go get those bruises looked at, okay?”\n“My mask—”\nSue bites at her lip, stopping herself from blurting out the many questions Johnny knows she has. Where her questions would once be probing, now they’re directed by her concern. Once Spidey’s gone, he has no doubt that her barrage will be directed Johnny’s way. Not that he’ll tell her anything about his boyfriend, of course.\n“You can keep it on,” Reed says kindly. “Come on.”\nSpider-Man nods. He obediently follows Reed to the Med Bay.\n“He’s so little…” Ben says, following Spidey’s exit with his eyes. “How did we miss that?”\nSue casts a glance at Johnny, weighing up Spider-Man against her little brother. Her lips purse, wobble. She sees it, he knows. She sees that Spider-Man is smaller than even him.\n“We had assumptions,” she says. “We didn’t want to look past them.”\nThe living room falls back into that weighty silence. Johnny reaches for the plate of eggs and begins piling up Spidey’s plate. It feels like all he can do for the other teenager now.\n \n \n \nWhen Johnny wants to invite Spider-Man over next time, he doesn’t have to wait until the Four have gone out. He doesn’t have to hide it.\nThis time, when Spider-Man swings into his bedroom, the younger shouts a greeting to the others. Sue, embarrassingly enough, makes them keep the bedroom door open. When they venture out to grab soda, Spidey offers up several scientific questions he’s kept firmly tucked away, and Reed answers them honestly, eagerly. Ben good-naturedly teasing about them being boyfriends and makes them splutter and flush.\nIt’s not perfect, but it’s a start.\n \n \n \n \nThe next time Doom and his infuriating, endless army attack the city, Spider-Man swings around to meet up with the Fantastic Four. Rather than sneaking around shadowy buildings and hissing quietly to catch Johnny’s attention, the teenager flies through the air between Johnny and a stretched out Reed, laughing and webbing Doombots as he goes.\n“Spidey!” Johnny says happily. He burns a Doombot into a bubbling, warping husk, before flying higher, admiring his boyfriend’s fluid flips and twirls.\n“Spider-Man,” Reed greets.\n“Hey, Johnny,” Spidey says, like he’s not twisted upside down and wrapped around a thrashing Doombot. “Hey, Dr. Richards. How are you doing?”\nReed throws a Doombot at Johnny, who destroys it in a burst of flame. “Oh, good, good. Yourself?”\n“I’m good. Kind of bummed about this invasion though; I had literally just sat down when I saw the news.”\n“Hey!” Johnny interrupts. “Boyfriend, here! Don’t I get a kiss or something?”\n“A bit busy, dear,” Spidey says. He kicks one Doombot in the head, twists, and shoves his fist through the neck of another, spraying sparks and exposing ropy wiring.\n“Spidey and Torchy,” Ben heckles, “sitting in a tree!”\n“How OLD are you?!” Johnny demands.\n“K-I-S-S-I-N-G!”\n“Ben, you motherfu—!” Johnny throws a blast of lukewarm flame that bounces off of Ben’s thick skin as easily as water off a duck.\n“Don’t make me come up there,” Sue warns over the comm. Johnny can’t see her, but he knows she’s somewhere on the ground, kicking ass and taking names.\n“Is this is what superhero teams are really like?” Spidey wonders.\n“Like what?”\n“Straight out of those funny, vaguely dysfunctional family sit-coms.”\n“We’re not always like this,” Reed tells him gently.\u2028 “Yes, we are!” Sue says.\n“We aren’t,” Johnny defends. Why did he think it was a good idea for his boyfriend to get within ten feet of his family. Why.\n“We totally are,” Ben says above the sound of screeching metal and dying Doombots.\nJohnny throws another handful of flames at him. “Ben!”\nSpidey’s laugh is high and carefree, like a bell. It makes Johnny feel lightheaded. “No, no, I like it,” he insists. “I’m kind of jealous, actually.”\nJohnny’s reply is lost. A Doombot launches itself at him, and he’s too busy wrestling it off and trying to stay airborne.\nThe wave of Doombots grows thicker. Sue disappears into the subway stations when the Doombots worm their way down there, following the fleeing New Yorkers into the dark. Reed heads after her.\nBen stays flat-footed on the ground, battling dozens of them at once. Johnny and Spider-Man are pulled higher, deeper into the city, as the swarm thickens.\nUntil a Doombot catches Johnny unawares, hitting right over the head, and he tumbles toward the asphalt, unconscious.\n \n \n \nJohnny wakes up to a haze of blue. He’s tangled in something that’s soft and smells warm—a little of sweat, the faint tang of blood, but something spicy that makes him bury in deeper. His head is throbbing, but it’s easily ignored. He’s too comfortable, cocooned amongst blue sheets and blue comforters and faded blue pillows.\nDistantly, he can hear the buzz of a TV. The walls are thin; Johnny can hear kids shouting and playing somewhere outside. A dog barking. The faint whirl of police sirens.\nThe Baxter Building is soundproof. That realisation, if anything, pries his eyes open.\nThis bedroom is nothing like Johnny’s. The posters crowding the walls are all wrong, for alternative bands, or photography, or science mumbo-jumbo. A Fantastic Four poster lounges opposite the bed, the paper a shiny, quality gloss, his family and Johnny’s face blown up in detail. Johnny’s face.\n“Um,” Johnny says. He sits up. The bedding pools around his lap. The bedspread isn’t just blue—it’s Fantastic Four themed. “UM.”\n“Johnny?” calls a voice through the house. The bedroom door creeks open, and Johnny stills. “Hey, you’re awake.”\nJohnny doesn’t recognise the face peeking shyly at him from the doorway. He’d obviously been kidnapped by an insane fan. This is the only answer to the sleep hazy situation he’s found himself in. Damnit, the Four had warned him this might happen.\nAt least Johnny has superpowers, and the guy across from him doesn’t look like he does. The very cute, very nervous looking guy.\nThe stranger sidesteps into the room. His hair is dark and wild, fluffed around the top like he’s been pulling at it, flattening it, scrubbing those bony fingers through it. He’s skinny in the way only teenager’s can be, all sharp elbows and a waist that dips, collarbones sharp against his faded t-shirt.\nHe bites at his lip, and Johnny’s traitorous, traitorous breath stutters. He has the puffiest, pinkest lips.\n“You doing alright there, flame-brain?” asks the kid. He offers a teasing, crooked smile, and Johnny almost flames his way out of the bed; he knows that smile.\n“Spidey?!” The other teenager pushes him back down with a firm hand. Proportionate strength. Definitely Johnny’s Spidey. “You’re… You’re cute!”\nSpidey swats him over the head and scowls, but Johnny can see the pleased flush that climbs up his neck. He takes in that smooth jawline and those faint, faded freckles he’d glimpsed before. Now, he can see so much more; the dark sweep of lashes, eyes brown and warm, his brows bold and thick. A red indent on the arch of his nose, where glasses must have sat not too long ago.\n“Spidey!” Johnny repeats. He doesn’t try and get up again. This time, he wraps his arms around Spidey and tugs at the boy until he tumbles, spilling over Johnny and into the bed.\nJohnny buries his face in Spidey’s fluffy hair. It’s dark, and thick, and so soft. He exhales and squirms closer.\n“This isn’t how I thought introductions would go,” Spidey says into Johnny’s neck. Johnny shushes him.\n“We’re already been introduced, webs,” Johnny mumbles. His concussion is still there, making his thoughts soupy and his sight wobbly, but Spidey is warm and real, mask-less and in jeans, Johnny tucked up in his soft, blue bed.\n“Yeah, but—”\n“Also, no offence but where are the others? You’re not a Doombot crafted into a teenage boy, are you? Not some trick of Doom’s?”\n“I’m a real boy,” Spidey promises. “The Four got separated from us, so I kidnapped you when you fell unconscious. I shot them a quick call, don’t worry. They’re all safe. The Avengers have taken Dr. Doom into custody.”\n“We’ve really got to stop kidnapping each other.”\n“We’re really got to stop passing out in fights, more like.”\n“We’re a couple of fainting damsels,” Johnny says mournfully.\nSpidey snickers, and Johnny grins, letting his eyes slide past his boyfriend and onto the room around him. He doesn’t let go of Spidey, but he does sit up a little. He squints at the bedspread. The posters. The stupidly fond expression on Spidey’s face.\n“You’re a Fantastic Four fan,” Johnny says slowly.\nSpidey looks away. He rubs at the back of his neck in a painfully familiar way, only this time, he can see the way Spidey’s brown eyes flit down and his hair flops over his forehead.\n“I don’t know what you’re talking about.”\n“There’s literally a poster of my face across from us. Dude, you sleep covered in my team’s symbol.”\n“I’ve never seen that poster before in my life,” Spidey lies. “And—and you happen to share the same symbol as these scientists from Korea, total misunderstanding, I can see how you’re confused—”\nJohnny kisses him, just to shut him up. He keeps his eyes open, if only to watch the way Spidey’s face melts under Johnny’s touch.\n“You’re my biggest fan,” Johnny teases.\nSpidey hides his face in Johnny’s neck. “You guys are so cool,” he complains, shy and soft-voiced. Johnny smile broadens; he has the cutest boyfriend. A cute, infamous boyfriend who could dead-lift trucks. Woof.\n“I would feel weird about this, but I was a few YouTube videos away from building a shrine to you when we first met, so. It’s nice to know the sentiment is returned.”\n“First of all,” Spidey says, rising onto his elbows, “totally not going to build a shrine. Not even to you. I’m a fan of all superheroes. Did you miss the Avengers posters? My Black Widow lampshade? And second of all: it’s not the same. I’m the bane of New York, and you’re—” Spidey gestures at Johnny, sprawled out invitingly on his bed, blond hair tasselled and long, tan limbs on display. “You’re that.”\n“Whoa, whoa!” Johnny surges up from the bed. He grabs Spidey around the shoulders, grounding him, making him look at Johnny as he carefully says, “Spidey, you’re amazing, okay? You’re this strong, butt-kicking badass. You’re out there doing the right thing despite the fact that this city is so mean and ungrateful. You’re so kind, and cute, and kissable, and—mmm!”\nSpidey doesn’t move his hand from Johnny’s mouth. Not even when Johnny squirms and tries to lick him. “Shut up,” he tells him.\n“Mmm,” Johnny complains\n“And it’s Peter. Peter Parker.”\nJohnny goes still. Spidey retracts his hand, and Johnny stares at him, blue eyes wide, lips parted. Spidey grins.\n“Did I break you?” Spidey teases.\n“Spidey,” Johnny says. He shakes himself, and corrects, “Peter?”\n“I thought you should know. This way you’ll know which last name to use, instead of just signing your name ‘Future Mrs. Spider-Man.’”\nIf there was any doubt that the person in front of him was Spider-Man, it promptly vanishes with the appearance of that cheeky grin.\n“You little—” Johnny begins.\n“Now you can sign your name ‘Mrs. Peter Parker’, right? Or: ‘Jonathan Parker.’”\n“From the state of your room, I bet I’d secretly find ‘Mrs. Johnny Storm’ graffitied somewhere, you giant fanboy.”\n“You might find ‘Mrs. Reed Richards’,” Peter admits, and Johnny gasps like he’s been struck. “I went through a phase, okay!”\n“Okay, now we really need to get a divorce.”\n“I’m sorry, but he’s so smart! And kind of dreamy!”\nJohnny puts both hands over his ears. “La-la-la, I can’t hear you!”\nPeter pulls Johnny’s hands away. There’s a bruise blooming along his temple, and a scrap healing on his chin. Peter has mask hair. Johnny’s head throbs.\nHe hasn’t been this happy in a long, long time.\nPeter presses a soft kiss to the corner of his mouth. “Forgive me?” he murmurs, barely audible.\nJohnny pulls him in, deepening the kiss. When they draw away, beaming, Johnny says, “I guess I forgive you. Just never tell me you, like, think my sister is hot, okay?”\n“Well…\"\n“That’s it, you’re not getting the kids in the divorce.”\n "
}