{
    "id": "666525",
    "url": "https://archiveofourown.org/works/666525?view_full_work=true",
    "author": [
        "The_Bookkeeper"
    ],
    "title": "No Difference",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "Supernatural",
        "Criminal Minds"
    ],
    "relationships": [
        "Dean Winchester & Sam Winchester",
        "Derek Morgan & Spencer Reid"
    ],
    "characters": [
        "Dean Winchester",
        "Sam Winchester",
        "Derek Morgan",
        "Spencer Reid",
        "Aaron Hotchner",
        "Emily Prentiss",
        "David Rossi",
        "Jennifer \"JJ\" Jareau"
    ],
    "additional_tags": [
        "Crossover",
        "Hallucinations",
        "Angst",
        "Psychobabble",
        "Season/Series 07",
        "Drama",
        "Cave-In"
    ],
    "language": "English",
    "series": "",
    "published": "2013-02-02",
    "completed": null,
    "words": "5,685",
    "chapters": "1/1",
    "comments": "235",
    "kudos": "15,815",
    "bookmarks": "3,241",
    "hits": "124,027",
    "summary": "<p>Derek has been in a lot of bad situations. This one easily makes the top five. Or would, if Dean and Sam Winchester were actually acting like the sadistic psychopaths he expected them to be. Instead, Dean is referencing Star Trek, Sam is comforting Reid, and Derek has never been more confused.</p>",
    "notes": "<p>Title comes from a poem of the same name by Shel Silverstein. </p>\n<p>Set early season seven for both shows, before Slash Fiction. Contains minor spoilers for season eight of Criminal Minds in regards to some of Morgan's backstory. Most of my knowledge of psychology comes from Criminal Minds, so I apologize if my psychobabble is horrendous. Enjoy!</p>",
    "text": "  Derek Morgan had been in a lot of bad situations in his life, from finding himself speechless at his father’s funeral to the unspeakable things which had poisoned his adolescence to being put under the infallible microscope otherwise known as Aaron Hotchner when he was late for a meeting. He liked to think he could deal with almost anything life threw at him. Not necessarily easily, not even always well, but he could deal.\n   For instance: he could deal with being trapped by a cave-in. He was uninjured, he had space and air and some level of light, and Hotch knew more or less where he was and would probably have him freed within a few hours, a day at the most. He wasn’t even worried. Not looking forward to spending an indeterminate amount of time covered in whatever it was that had exploded and caused the cave-in in the first place, but not worried.\n   He could deal with having lost track of Reid. He wasn’t happy about it, and his brain kept cycling through all the things that happened to the kid when he was out of sight or even when he was right there in front of him but just beyond his reach, but he wasn’t panicking. Reid was too smart for anyone’s good and way stronger than he looked. No matter what, he would, eventually, be fine, or as fine as he ever was. And probably, hopefully, he was fine right now, so Derek wasn’t going to worry about that yet.\n   He could even deal with Dean Winchester pointing a loaded gun at his head. Talking down armed psychopaths was part of his job, after all. Of course, usually he had backup. And usually it wasn’t his own gun which was being aimed at him.\n   Also, he usually wasn’t dealing with all three of those things at the same time.\n -----------------\n\n \n24 hours earlier:\n\n   “Alright, Hotch, what’s so important you had to drag us in on a Saturday night?” Rossi asked what everyone was thinking. “I’ve got a half-finished lasagna in my fridge.”\n   Morgan had been half-finished with something else entirely, but the next words out of Hotch’s mouth drove all thought of that from his mind.\n   “The Winchesters are back.”\n   The screen blinked to life, displaying two mug shots, both young Caucasian men. One in his mid-to-late-twenties, short hair, blatantly irreverent; the other a few years younger, long hair, looking resigned and vaguely embarrassed as if he and his brother had been arrested for public indecency and not several counts of murder. Both were handsome, and pages and pages of witness reports, school records, and other documents said that they were intelligent, charismatic, and resourceful.\n   They also said they were dead.\n   “A sighting was reported in a diner in Kentucky, just outside of Mammoth Caves National Park. A security camera outside a nearby bank confirmed it,” Hotch explained. “It appears that they faked their deaths. None of the remains from the police station explosion could be positively identified, so it is quite possible that the Winchesters escaped beforehand or even caused the explosion themselves.”\n   “Fire has been used in the past as a forensic countermeasure to prevent accurate body identification in the past,” Reid offered. “In 1994 Marine staff sergeant Arthur Bennett burned his trailer with a body inside after he was charged with child molestation. The fraud wasn’t discovered until three years later, during which time he continued to prey on children under an assumed identity.”\n  What happened to the police station in Colorado hadn’t been so much a fire as an impossibly contained nuclear explosion, but nobody mentioned that.\n   “What about these two?” Prentiss questioned, nodding at the screen. “What have they been doing all this time?”\n   “By the looks of it? Everything,” Penelope answered. “When Hotch told me they might be back I crosschecked their prints with old cases, things in smaller towns which wouldn’t be hooked up to the national database, and let me tell you, these boys have been busy.” A flick of her fingers and the image on the screen changed, the mug shots replaced by crime scene photos. A man with multiple knife-wounds sprawled in a motel room, a living room furnished with a body charred beyond recognition, a young woman shot in the stomach on a wooden floor.\n   “M.O. and victimology are all over the place,” said JJ, flicking through the files. “There are women shot, men stabbed, visa versa, lawyers, bartenders – some are quick and clean, others have obviously been tortured – am I reading this right?” she asked, frowning at her tablet. “This woman was exsanguinated, and they couldn’t account for most of her blood?”\n   “Yeah,” said Penelope with a grimace. “The theory is that they, uh, drank it.”\n   “Not ‘they,’ he,” corrected Derek. “Only Sam’s fingerprints were found at the scene.” His stomach turned as he went even farther back in the records. These two had stabbed a middle-aged couple to death with their own Christmas tree. In what twisted delusion did that make any sort of sense?\n   “Wasn’t he supposed to be the submissive, bent under his brother’s oppressive thumb of sadism?” Rossi asked dryly.\n   “It’s always the quiet ones,” Prentiss muttered.\n   “We’re operating on the assumption that all previous profiles are wrong,” Hotch said. “We’ll be building a new one from scratch. Wheels up in thirty. These guys move fast. We have to move faster.”\n ---------------\n Present moment:\n   “Put the gun down,” Derek said, in the most reasonable voice he could manage.\n   “Why the fuck would I do that?” Dean snapped back, and began to call for his brother without waiting for a response. “Sam? Can you hear me? Sammy!”\n   There was muffled groan on Derek’s right, from what appeared, in the small amount of sunlight which filtered into the cavern, to be a solid wall of rock.\n   “Dude, you don’t have to shout,” came Sam Winchester’s voice, slightly impeded by the rock but easily understandable.\n   “You okay?” Dean demanded.\n   “Can’t see a damn thing, but yeah, I think so. You?”\n   “Fine. We’ve got some light over here, but the entrance is stopped up pretty good. Doesn’t look like we’re going anywhere.”\n   “‘We’?” Sam repeated.\n   “Yeah, one of the feds is in here with me,” Dean told him, shooting a glare at Derek. “I got his gun off him.”\n   Derek tensed, waiting for the inevitable ‘so shoot him already’ – but it never came.\n   “What about him, is he okay?”\n   “I’m fine,” Derek spoke up, not shifting his gaze from the older Winchester and trying not to show how much the question surprised him. “My name’s Derek Morgan. I’m with the Behavioral Analysis Unit.”\n   “Yeah, well, wish I could say it was nice to meet you,” said Sam, while Dean rolled his eyes. “I’m guessing you know who we are.”\n   “You guess right,” Derek replied, and he couldn’t suppress the rage which roiled up in him as he thought of exactly what he knew. The owner of that deep, slightly sheepish voice had tied down a pediatric nurse, put his mouth to her severed artery, and drank her dry.\n   Dean must have seen the shift, because his gaze hardened. However, whatever he might have said was forestalled by a sudden, urgent “Dean.”\n   “What is it, Sammy?” Jerking to attention like a guard dog, every nerve instantly alert. There was that infamous protective instinct. Dangerous, irrational, codependent.\n   From this angle he just looked like a worried big brother.\n   “There’s someone else in here.”\n   Derek’s heart leapt into his throat. Reid.\n   “Reid!”\n   “Shut up,” Dean ordered. “Sam, are we talking actual someone else?”\n   “Um. Yeah. I think so.”\n     That exchange was an interesting tidbit if it meant what Derek thought it meant, but that really wasn’t what he was concerned about at the moment.\n   “If you hurt him –”\n   “I said shut up,” Dean growled, grip tightening on the gun. “That’s the other fed, Sam.”\n   “Okay. Hang on. I’ve got a pulse,” said Sam, and Derek let out a breath in relief. “He’s unconscious and . . . yeah, there’s definitely a head injury, but I don’t think it’s that bad. He’s waking up.”\n   There was a moan, then a gasp, and then Reid’s voice.\n   “Wha – what’s –”\n   “Reid! Reid, it’s me; it’s Morgan.”\n   “Morgan? I – I can’t see! I can’t –”\n   “Whoa, calm down.” This time it was Sam’s voice, soothing and steady, easily switching roles from confused little brother to calming companion. “There was a cave-in. You can’t see because it’s dark.”\n   “Hotch knows where we are,” Derek said. “He’ll get us out.” It was a message to both Reid and the Winchesters, and judging by the look Dean shot him it was received.\n   There was a pause, and when Reid spoke again his voice was calmer, though only marginally. Reid was impossibly good at working through his terror. He was terrible at hiding it.\n   “I can’t move my legs and my gun’s gone.”\n   “I have your gun,” came Sam’s voice, still gentle, not remotely threatening. “I’m going to unload it and hand it back to you, okay?”\n   “Sam,” said Dean sharply.\n   “Dean,” Sam replied exasperatedly. “He’s concussed, pinned, and it’s pitch black. He’s not going to pistol whip me into submission.”\n   “Just pinned, Reid?” Derek asked. Confirming that Reid was more or less whole was the most immediate priority. The fact that their profile (never very solid to begin with) was unraveling more and more every minute could wait.\n   “Yeah,” Reid replied tightly. “I can feel everything.”\n   Derek winced. It was better than the alternative, of course, but the kid’s lower half was riddled with old injuries which had to ache something awful, and it would only get worse the longer he was trapped.\n   “And your head?”  \n   “I – I don’t know.” There was a pause. “I was knocked out, so I almost certainly have a concussion, but other than that – it’s just – it’s really dark, Morgan.”\n   Shit. Derek had forgotten. It seemed like lifetimes ago that they had sat in a cabin in Texas and teased each other about irrational fears. Before Hankel and Foyet and Doyle and dozens of other all-too-real monsters. Maybe Reid’s fear of the dark wasn’t irrational after all.\n   “I know, kid,” he said, wishing he could do more, wishing Dean Winchester wasn’t watching him like a hawk, wishing he were on the other side of that wall instead of Sam.\n  “Not gonna tell you the dark’s nothing to be scared of,” Dean cut in, “‘Cause there’s stuff out there that would make you shit yourself, but we already ganked the one fugly in here, and if there’s anything left it should be scared of us.”\n   If looks could kill, Derek’s would have incinerated Dean by now. The smirk which curled the other man’s lips said that he knew exactly how unreassuring his little speech was.\n   “Dean, shut up,” said Sam. “Don’t listen to him,” he continued, to Reid.  “He’s just being a dick because he’s pissed off.”\n   “Hey!” Dean protested. Sam ignored him.  \n    “Reid, is that your first name or your last?”\n   “Last. I’m, uh, Dr. Spencer Reid.”\n   “Okay. You’ve hit your head pretty bad, Doctor; you need to keep talking. Can you do that?”\n   “I –”\n   Derek could hear the confusion in his voice, the internal struggle to reconcile the contradictions which were flooding him. Sam Winchester was a dangerous killer. Sam Winchester had surrendered a weapon to him for the sole purpose of making him feel more secure. Sam Winchester was speaking gently and warmly and reprimanding his brother for trying to frighten him.\n   “Reid,” Derek said warningly. Many psychopaths were capable of feigning or even feeling compassion. It didn’t mean that they weren’t dangerous. It certainly didn’t mean that Reid should give Sam any more information than he already had about them.\n   “You don’t want to tell us about yourself,” Sam deduced. “That’s okay; I get that. So tell us about us. You guys are profilers, right? Give us the profile.”\n  “Doesn’t make sense,” Reid muttered.\n   Dean snorted. Everyone ignored him.\n   “Why not?” Sam prompted. Reid’s words filtered through the rock, stilted at first but building speed as he delved into what was, perhaps, the greatest of his many areas of expertise.\n   “Most killing teams, there’s a clear power dynamic; one partner is partner is completely dominant over the other . . .”\n ----------------\n 16 hours earlier:\n   “Sam isn’t the submissive,” said Prentiss. “He can’t be. The only advantage Dean has over him is age. Sam is bigger, academically more intelligent, better educated, just as charismatic –”\n   “He’s proved that he’s perfectly capable of operating on his own,” Hotch agreed. “He was the first to escape in Baltimore, and there are whole stretches of time when Dean doesn’t appear to be active at all.”\n   “If anything, his crimes are more brutal during those periods,” Reid put in from where he was poring over hard copies of the files which Garcia was still rushing to compile.\n   “Could we have it backwards?” JJ asked. “Maybe Sam’s the sadist and Dean’s just catering to his little brother’s needs. Dean could see it as taking care of him.”\n   “But Dean’s clearly an active participant,” Hotch pointed out. “He was the one who tortured the women in St. Louis, and all the video footage and witness accounts say that he takes the lead when they’re together.”\n   “So maybe they’re both dominant personalities,” Derek said, biting back a growl of frustration. The past eight hours had only uncovered a mess of half-baked witness accounts and contradictory evidence. Each new piece of information only made things more confusing.\n   According to what they had found, Sam had gone from a loving boyfriend who didn’t speak with his dysfunctional family to a mission-oriented killer who would do anything for his brother to a violent sociopath who was into rough sex with married women. Dean was an alcoholic sexual sadist who at one point had spent six months as a middle-class, suburban stepfather without committing a single crime. Not including the police station explosion, both had died at least once.\n   “Wait, guys, I think I’ve got something here,” said Reid eagerly. “The deaths all stop after they leave town, right? But they start before they arrive.”\n   “Vigilantes?” Prentiss said, her eyebrows rising.\n   “It would explain why the witnesses have been so reluctant to talk to us,” JJ said. “They’re not scared; they’re indebted.”   \n --------\n Present moment:\n   “Damn right,” growled Dean. Near the beginning of Reid’s explanation he had lowered the gun and settled onto the ground, warning Derek “try anything and I’ll shoot you.” Derek had followed suit after a moment of hesitation and now they sat about ten yards apart, leaning against opposite walls of the cave. The gunk which Derek had tried (in vain, with Dean watching him amusedly) to rid himself of was beginning to dry and flake off. The air was still heavy with tension, but it was no longer filled with the electric current of impending homicide.\n   “Dean,” Sam chided.\n   “No, dammit, I’m not going to sit here and listen to them talk about us like we’re murderers or something!”\n   “We are murderers,” Sam answered flatly.\n   Dean made a face.\n   “Yeah, fine; we’re murderers. But we’re not fucking psychos. I don’t get off on this shit, and you’re not a sociopath.”\n   “Yeah, sure,” said Sam, his voice exaggeratedly agreeable. “Except, y’know, when I was.”\n   “Oh, come on, do we really need to go over this again?” Dean questioned rhetorically. “Look,” he said, suddenly addressing Derek. “You guys are shrinks, right? Settle this for us. If there’s this guy, and he’s kind of you, same body and everything, but he’s not you you – he’s like, your clone, or your evil twin – no, you know what he’s like? He’s like Kirk in that one Star Trek episode, when the transporter splits him into two people.”\n   “‘The Enemy Within,’” Reid responded. “Kirk is split into his ‘good side’ and his ‘bad side’. His bad side seeks out hedonistic pleasures and wreaks havoc on the ship while his good side fields the accusations, unaware of the transporter malfunction.”\n   “Right,” Dean said firmly. “The good Kirk had no idea, and once he gets put back together what the bad Kirk did isn’t his fault, because it wasn’t really him.”\n   “Well –” Reid began, and Derek could sense the upcoming lecture on moral complexities and the philosophy of self, but the young doctor clearly thought better of it. “That’s a perfectly sound assertion,” he said instead. “And it’s worth noting that the ‘good side’ of Kirk was actually incapable of functioning without his more aggressive ‘bad side.’”\n   Sam heaved a long-suffering sigh which Derek could hear even though the rock.\n   “Shut up, Sam,” Dean said irritably. “You’re not a sociopath, okay? End of story.”\n   Sam didn’t protest any further, but he didn’t agree, either. Derek got the sense that this argument had occurred more than once. He wondered what it was that had caused the sudden change in behavior Dean was implying (in keeping with what they had managed to piece together). An addiction? A brain injury? Whatever it was, Dean clearly believed it was outside of Sam’s control, and Sam clearly felt differently.   \n   “Reid, how are you doing?” was all Derek said aloud.\n   “Fine,” said Reid, tense but no longer terrified. Apparently, a chance to discuss Star Trek could do wonders for his mood no matter what the situation. “My head’s clearer.”\n   “Good,” said Derek. No mention of his knee, which had to be killing him by now (he tried to hide it, but Derek had seen him limping on cold and damp days), but Derek wasn’t going to bring it to his attention if he was trying to ignore it.\n   The sun was beginning to set, the light which filtered into the cave becoming redder and dimmer.\n   “You got a flashlight?” Dean asked, obviously noticing the same thing.\n   “Yeah,” Derek answered, reaching for it.\n   “No, no; leave it,” said Dean, reaching into his own pocket. “We should use ‘em one at a time,” he explained, withdrawing his own flashlight and flicking it on. “Don’t wanna waste the batteries. Hey, Sam, don’t suppose you’ve got your flashlight, do you?” he called to the wall of rock.\n   “Yes, Dean,” came the sarcastic reply. “I’ve been sitting in absolute darkness for the past hour because I like it.”\n   “Okay, fine,” said Dean, looking almost comically taken aback. “You don’t need to be a bitch about it.”\n   The silence stretched. The sunlight was almost entirely gone now, and Derek suppressed a shiver. The temperature was going to drop like a rock. Dean had about five different layers on, and Reid would probably be okay in his sweater vest, but Derek’s t-shirt meant he was in for an uncomfortable night. Judging by Dean’s furrowed brow, he was having similar thoughts and trying to remember what his brother was wearing.\n   “Dean.” Sam’s voice had a new note in it, on the verge of shaking and edged with something which wasn’t quite fear, yet. “It’s, uh, it’s getting kind of chilly in here.”\n   Dean closed his eyes for an instant, mouth moving in a silent curse. He shot Derek a glare as if daring him to comment, and then leaned closer to the wall to address his brother, his voice low as if he could keep Derek and Reid from hearing.\n   “Listen to me, man,” he said. “You gotta hold it together, okay? We’ll be out of here before you know it.”\n   And into police custody and probably solitary confinement, as Derek was certain they were both well aware, but nobody mentioned it.\n   “Yeah,” Sam agreed, but he didn’t sound as if he believed it. “It’s just, it feels like . . .”\n   “I know,” said Dean, and the pain on his face was so raw and intimate that Derek looked away. “But you’re not there, Sam. You gotta hold onto that.”\n   There was only ragged breathing in reply. “You’re not there.” Flashbacks, it sounded like. PTSD. Maybe the trauma had caused the behavior shift, multiple personalities or some kind of fugue state. Derek wondered what kind of trauma could splinter a man who was so twisted already.\n   Dean spoke again, this time with an edge of desperation.\n   “You used to be so scared of the dark, remember that, Sammy?”\n   Sam gave a sharp burst of laughter, harsh and verging on hysterical.\n   “Yeah, it’s kind of hard to forget Dad shoving a gun into my hands and explaining that the thing in my closet could smell fear.”\n     “C’mon, man,” Dean cajoled, looking pained. “Is that all you remember?”\n   A pause, and then . . .\n   “No,” Sam admitted. “I remember you taking the gun away.”\n   “Your hands were shaking so bad I thought you were going to shoot me.” Dean’s face was softening into something wistful, almost nostalgic, and Sam’s voice matched it when he answered. For the first time, Derek felt his stomach twist with pity. What sort of lives had these men had, that they looked back on their hellish childhood with longing?\n   “You stayed home that weekend and taught me how to shoot, even though Dad was going to let you go to that game.”\n   “Worth every minute,” Dean replied, and then his lips curled into a smirk. “Though you’re still a crap shot.”\n   Sam laughed again, more genuine this time.\n   “I’ll remind you of that the next time my crap shooting saves your ass.”      \n   “Bitch.”\n   “Jerk.”\n   Another beat of silence, and then, more urgent this time, pleading –\n   “Dean.”\n   “Sam, listen to me, there is no one there. It’s just you and the fed, man.”\n   “Reid, what’s going on in there?” Derek asked, ignoring the death glare Dean shot him. The gun was lying harmlessly at his side, and Reid’s safety came first.\n   “I – I think –”\n  Sam whimpered, and Reid’s voice shed its uncertainty.\n   “He’s hallucinating.”\n   Derek swore under his breath.\n   They had gotten it all wrong.\n ----------\n\n \n4 hours earlier:\n\n   “So what have we got?”\n   Even Hotch was beginning to look frustrated, now. Derek half expected a hair to fall out of place any minute. After working late into the night, sleeping on it, and working all of the next morning, they had –\n   “A pair of codependent sociopaths who somehow manage to spend months apart.”\n   “In other words, contradictions,” Rossi re-interpreted.\n   “In other words, nothing,” Prentiss growled. “We don’t even know if they’re still here, and even if they are they’re going to blow town sooner rather than later.”\n   “Alright,” Derek sighed, leaning forward. “So maybe we’ve been coming at this from the wrong angle. They’re task oriented, right?” he said in response to the circle of questioning looks. “High-functioning, completely sane within the rules of their delusion. So if they’re here they’re here for a reason.”\n   “So we think like them,” said Prentiss with dawning realization. “We hunt what they’re hunting.”\n   The team burst into action with new energy, Hotch dialing Garcia, Reid flipping through files, JJ sticking her head out into the main room of the station –\n   “Garcia, I need records of all suspicious deaths in the immediate area within the last few months.”\n   “A lot of the deaths the Winchesters follow actually aren’t murders; most of them seem to be freak accidents and animal attacks –”\n   “Sheriff, has anything unusual been happening around here lately? Anything that’s made the papers?”\n   “Well,” said the Sheriff thoughtfully. “Couple people got killed by a coyote or somethin’ up in the park. Happens, I guess, but not often it’s fatal. Ranger’s the one to talk to about that.”\n      “Morgan, Reid, you go to ranger station, see if anyone’s been asking around,” Hotch ordered. “Prentiss and I will head down to the morgue. Everyone else see what they can dig up here.”\n   “C’mon, Pretty Boy,” said Derek, ruffling Reid’s hair as he passed. “I’m driving.”\n ----------\n\nPresent moment:\n\n   “Oh, Sammy,” Dean said, almost too low for Derek to hear. Sam had stopped responding several minutes ago, and now Dean sat slumped with his forehead pressed against the rock, repeating his brother’s name like prayer. “Sam, Sam, dammit Sammy . . .”\n   “Stop it.”\n   Sam’s voice was flat and so sudden that Dean jerked in surprise and gave a hiss of pain as his skin scraped against rock.\n   “Sammy!”\n   “I said stop it,” Sam said, still toneless. “I’m not falling for it again. He’s not there.”\n   “No,” Dean whispered. The flashlight threw the lines of pain and horror on his face into stark relief. “No, dammit! Listen to me, Sammy, you are not in the Cage. It’s just some cave. You’re not. In. The Cage. I got you out, Sammy. I got you out.”\n   Sam let out an empty, mirthless sound which might have been a laugh.\n   “Fuck you,” he said, with more exhaustion than venom, and then fell silent again.\n   Dean choked back a sob. There was a beat of heavy silence. Dean’s eyes cut to Derek, and that was all the warning he had before his own gun was once again pointed at his face.\n   “Help him,” Dean ordered, despair burned away by fury, voice hard and eyes harder.\n   “Morgan?” Reid questioned sharply. “What’s going on?”\n   “You’re going to help my brother,” Dean responded, eyes never wavering from Derek, “or I’m going to put a bullet through your friend’s head.”\n   “It’s alright, Reid,” said Derek evenly, keeping very still. For all the confusion and contradictions which surrounded the Winchesters, one thing was still clear: Dean was never more dangerous than when Sam was in trouble. “It’s a flashback. Try to talk him out of it.”\n   It was clearly more than a flashback, and even if it weren’t, Sam was so deeply entrenched that it was probably too late to do anything but wait it out. Derek knew that, and he knew that Reid knew it, too, and he suspected that beneath his rage, so did Dean. But Derek’s gaze remained steady, and so did Dean’s aim.\n   Reid’s voice didn’t, quite.  \n   “Sam? Can you hear me? I – I don’t know where you think you are, but I promise you, it’s only a memory. You’re in Mammoth Cave National Park, Kentucky.”\n   There was a pause which seemed to stretch for ages, and then –\n   “Who’s that supposed to be?” Sam’s voice was still dead and hollow, but at least he was responding.\n   “Dr. Spencer Reid. I’m with the FBI’s Behavioral Analysis Unit.”\n   “. . . what?” asked Sam, seemingly startled out of whatever stupor he had fallen into.\n   “I’m with the FBI. We’ve been looking for you and your brother.”\n   “Me and my . . . you mean . . . Adam?” Sam asked, confusion clear in his voice. Dean flinched.\n   “Who’s Adam?” Reid asked.\n   “I – he’s – he’s the only other – Dean isn’t here,” Sam insisted. “He not, he’s alive, he got out –”\n   “Yes, he did,” Reid agreed. “And so did you. You’re in Mammoth Cave National Park, Sam.”\n   “Mammoth Cave . . . Kentucky? But – there was – what –”\n   Derek could hear the realization dawning. Dean still stood tense as a bowstring, as though afraid to let himself hope.\n   “Can you remember?” Reid prompted.\n   “We were hunting a . . . a Wendigo. But it was – sick, or something, not finishing off its kills. Dean –” He faltered. Dean stood frozen, barely breathing. Sam started again, stronger. “Dean made some stupid pun about bad apples, but it must have actually eaten something weird, because it was super slow, barely even faster than a human, and when we shot it – it . . . exploded.\n “And . . .\n  “There was a cave-in.\n  “. . . Dean?”\n   Dean sagged, the gun falling back to his side, and what washed over his face was more than relief, more than love, more than any combination of the two.\n   “I’m here, Sammy.”\n   “Dean,” Sam repeated, and his voice matched his brother’s face. “How long . . .?”\n   “Not long,” Dean replied, sinking back down against the other side of the cave, walls sliding back into place. “Fifteen, twenty minutes.”\n   “Okay,” said Sam. “Okay. Sorry. And thank you, Dr. Reid. You doing alright?”\n   “Yeah,” Reid answered. “Yeah, I’m okay.”\n   Silence threatened again, but Sam spoke before it could overtake them, his voice shaky and very young.  \n   “Dean. Could you – could it not be quiet? Please.”\n   “Yeah, Sam. Of course,” said Dean. He forced a smile, as if he’d forgotten that his brother couldn’t see him (or as if he knew his brother could sense it anyway). “Just remember you asked for it.”\n   Derek let his head fall back to the sound of Dean Winchester vocalizing AC/DC guitar riffs and his brother laughing softly.    \n   He wondered if this could get any more surreal.\n ----------\n\nThree hours earlier:\n\n   Derek and Reid pulled up to the ranger’s station and were greeted with the sight of a classic car glinting in the afternoon sunlight.\n   “That look like a ’67 Chevy Impala to you?”  Derek asked darkly as he parked. Reid opened his mouth, but caught himself and closed it again. The kid was improving.\n   Communicating in looks and gestures, they advanced on the small structure, drawing their weapons as they moved. Derek kicked the door in without hesitation – and found a single room, empty save for a very startled ranger.\n   “Where did they go?”\n   “North,” the ranger answered. “Towards the caves. It’s not far.”\n    Derek glanced at Reid. They both knew how dangerous it was to go after an UnSub without backup, let alone two, let alone the Winchesters. They also knew that if they didn’t go after them now, chances were the brothers would be tearing a red path across the country again within the next hour.\n   Reid set his jaw and gave a small nod. Derek shifted his grip on his weapon.\n   “Let’s go.”\n ----------\n\nPresent moment:\n\n  “Can you hear that?” Dean questioned abruptly, cutting himself off in the middle of You Shook Me All Night Long. Derek pulled himself upright and listened. It was distant and faint, but getting louder . . .\n   “Morgan! Reid!”\n\n \n  “Agent Morgan!”\n\n\n \n  “Dr. Reid!”\n\n   “Over here!” Derek called, springing to his feet. “Hotch! Over here!”\n   (“Dean? What’s happening?”\n   “The other feds are here, Sammy. They’re gonna dig us out.”)\n   “Morgan!” Hotch’s voice was much closer now, flashlights visible through the thin gaps in the rock. “They’re over here!” he called back to the others, before addressing Derek again.\n   “Morgan, is Reid with you?”\n   “Yeah. He’s banged up and pinned, but he’s fine. We both are.” He paused, glancing at Dean, who waved his hand in an exasperated ‘well, go ahead’ motion. “The Winchesters are here. Uninjured. Dean’s armed.”\n   Dean climbed to his feet, holding up Derek’s gun with his finger held away from the trigger.\n   “I’m unloading the gun and sliding it over to your man now,” he said, to Hotch, his eyes on Derek. He did as he said, pocketing the magazine. “Now mine,” he continued, pulling another gun from where it was tucked at the small of his back, still carefully nonthreatening. He performed the same operation with this one, though he was obviously more reluctant to give it up.\n   “Alright, Hotch,” Derek said, holstering his own gun and stowing Dean’s as the Winchester had. “Get us out of here.”\n ----------\n   It took twenty minutes for the slapdash task force to clear away the stone from the main entrance. Dean accepted the handcuffs which were immediately slapped onto him without even a token protest, only insisting (demanding, proclaiming, pleading) “You don’t take me anywhere until you get Sam out.”\n   Hotch glanced at Derek, met his eyes, and allowed Dean to stay.\n   It took another hour to get Sam out. He cried out in something which sounded a lot like pure terror when the first beam of light hit his eyes and flinched from the hands which reached to pull him out, but allowed himself to be handcuffed and led over to his brother. When they finally caught sight of each other it was as if they’d been separated for years rather than hours. It looked as though it physically pained them that they were still unable to touch.\n   After that, Derek was thoroughly occupied with Reid’s extraction, which took longer as they struggled to free him without causing any damage to his pinned lower half. At last they managed it, and he hobbled out, stiff and wincing but fine, fine, just fine. He leaned against Derek’s shoulder on the way back to the ranger’s station, and laughed breathlessly.\n   “When we get back to the hotel,” he panted. “I am turning on every light in the room.”\n   By the morning, the Winchesters had long since been transferred.           \n ----------\n   They got the call three days later. After a grand total of sixty-five hours in high security solitary confinement, the Winchesters had escaped. Again. No one had any idea how they did it. It seemed that Dean had spent the entire time pacing back and forth and cursing between demands to see his brother, while Sam alternated between sitting tense and terrified, flinching at nothing, and slumping exhaustedly against the wall, eyes closed, repeating something in Latin over and over again. The guards assumed that it was some sort of demonic chant, but Reid took a look at the tape and said,\n   “It’s Pater Noster. The Our Father.” His eyes were a swirling mess of emotions as he looked to Derek, who spoke through the inexplicable tightness in his throat.\n   “He was praying.”\n   The Winchesters left no trace behind, nor did the unidentified bearded man who apparently had some hand in the escape. Not even cold, the trail was nonexistent. All they could do was wait for another sighting – and somehow, Derek doubted they would get one. The Winchesters’ faces had been plastered across every television in the country before and no one had reported them. It was as if the entire population had a psychological block preventing them from seeing anything but two charming young men when they looked at them.\n   (Reid had expounded at length on something called a Perception Filter. One of the local cops had put it more succinctly.\n   “Don’t know if it’s God, the Devil, or what,” he had said with a shake of his head which was half disgust and half awe. “Them boys’ve got somethin’ looking out for ‘em.”)\n  The Winchesters were long gone.\n   For many reasons, a number of which he didn’t care to examine, Derek hoped he never saw them again."
}