{
    "id": "6832576",
    "url": "https://archiveofourown.org/works/6832576?view_full_work=true",
    "author": [
        "pristineungift"
    ],
    "title": "The Dragon of Moria",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Harry Potter - J. K. Rowling",
        "The Lord of the Rings - All Media Types"
    ],
    "relationships": [
        "Legolas Greenleaf/Harry Potter"
    ],
    "characters": [
        "Harry Potter",
        "Kreacher (Harry Potter)",
        "Legolas Greenleaf",
        "The Fellowship of the Ring",
        "Gandalf | Mithrandir",
        "Gimli (Son of Glóin)",
        "Aragorn | Estel",
        "Frodo Baggins",
        "Pippin Took",
        "Sam Gamgee",
        "Merry Brandybuck",
        "Boromir (Son of Denethor I)",
        "Balrog(s)",
        "Goblins - Character"
    ],
    "additional_tags": [
        "Crossover Pairings",
        "Crossovers & Fandom Fusions",
        "Crack Treated Seriously",
        "Fluff and Crack",
        "Dragons",
        "Animagus Harry Potter",
        "BAMF Harry",
        "BAMF Legolas Greenleaf",
        "Elvish"
    ],
    "language": "English",
    "series": "Part 2 of Harry Potter AUs & Crossovers",
    "published": "2016-05-12",
    "completed": null,
    "words": "5,200",
    "chapters": "1/1",
    "comments": "432",
    "kudos": "13,989",
    "bookmarks": "3,248",
    "hits": "139,316",
    "summary": "<p>After the Battle of Hogwarts, Harry Potter helped with the rebuilding and then went back to school, sitting his NEWTS and graduating with the rest of what <i>The Daily Prophet</i> called ‘The Disrupted Class.’ Following that, everyone expected him to become an auror. Harry himself expected it, right up until the moment came to apply to the academy.</p>\n<p>He takes up a hobby instead, and it leads him to a whole new world.</p>",
    "notes": "<p>This is really dumb.</p>",
    "text": "\nAfter the Battle of Hogwarts, Harry Potter helped with the rebuilding and then went back to school, sitting his NEWTS and graduating with the rest of what \n\nThe Daily Prophet\n\n called ‘The Disrupted Class.’ Following that, everyone expected him to become an auror. Harry himself expected it, right up until the moment came to apply to the academy.\n\n\nHarry found himself standing and staring at the Ministry of Magic’s rebuilt atrium. The statue of wizards and witches dominating the other races that had been put there by Voldemort’s followers was long gone. Instead, there was a statue of Harry.\n\n\nHarry hadn’t known they’d done that.\n\n\nHe was standing tall, shoulders squared, the Sword of Gryffindor held high over his head in a dramatic pose. A heroic pose. His cloak flared out around him, his hair fluttering majestically in the same imaginary wind. On his face was a look of grim determination combined with an unshakable conviction.\n\n\nHarry didn’t think it looked a thing like him. In fact, he was certain that he’d never looked like that, and never would. And, with a sinking feeling, he realized that this was how the wizarding world saw him, and he could either start trying to live up to it right now, and accept the backlash when he inevitably faltered, or he could dig his heels in and adamantly refuse.\n\n\nHarry was already in the floo back to Grimmauld Place before he registered his decision.\n\n\n-l-\n\n\nIn the next three years, Harry became something of a recluse. He was never seen in public, and could only rarely be coaxed into a Weasley family dinner. He didn’t like to go to those too often, as Ginny seemed to still be waiting for him, and he didn’t think it was fair to pursue a relationship with her when he barely ventured into the wizarding world.\n\n\nOf course, his hermitism seemed to have just increased the public’s fascination with him. Rumors abounded that he was traveling and learning rare and wonderful magic, or else had become an Unspeakable, or else was hunting down rogue Death Eaters, or gone to find the fabled High Elves and marry their princess or something. The harder he tried to make himself forgettable, the more wizards everywhere were determined to regard him as the return of Merlin.\n\n\nThere was some truth in the rumors. He was learning rare and wonderful magic, if only for something to do. He’d worked his way steadily through Grimmauld Place’s library, and whenever he found a subject that caught his fancy, he’d send Kreacher ‘round to the other properties he’d inherited to find more books on the subject. Ron thought he’d gone absolutely mental, while Hermione despaired that he’d lacked this drive while they were in school. And then she huffed when he refused to let her help with whatever his latest project was, and would start chattering about her work at the Ministry.\n\n\nHarry’d found that when he wasn’t in a ‘learn or die’ situation, that he much preferred moving at his own pace, and got a certain feeling of satisfaction in having sorted something out for himself.\n\n\nHis project at the moment was learning the animagus transformation, which Hermione would have kittens about if she knew, as all his references advised against attempting such a thing without another witch or wizard supervising. But Harry figured he was safe enough with Kreacher keeping an eye on him, as they’d grown quite fond of each other, and he wanted to do this for himself. In a way, this was his tribute to the Marauders. To his father and Sirius. He’d show Ron and Hermione once he’d managed it and had enjoyed his form for a bit.\n\n\nHe was hoping to be something inconspicuous so that he could go out without the possibility of people recognizing him.\n\n\n“Alright, Kreacher, you know what to do,” Harry said, as he sat in a room he’d cleared of all furnishings. He wanted to give himself plenty of space, in case he was something large. He doubted he’d be too big for the room, unless he was an elephant. But really, what were the chances of that?\n\n\nOf course, he wasn’t counting on the Harry Potter Factor.\n\n\n“Kreacher is to make sure Master stays in the house, in case Master is overwhelmed by his animal instincts. Kreacher is not to let Master hurt anyone, even Kreacher, because Kreacher is Master’s very favorite thing in the house, and Master would be upset if Kreacher was hurt. Kreacher is even to knock Master out if he has to, or run away if he can’t knock Master out,” Kreacher recited, his eyes shining with devotion, and what might be tears.\n\n\n“Excellent as always, Kreacher,” Harry complimented, and then downed his transformative potion and closed his eyes, attempting to reach a meditative state.\n\n\nAs instructed in his books, Harry cleared his mind as best he could (he still hadn’t mastered Occlumency) and then started contemplating what his defining traits were.\n\n\nThe first thing he thought of was his love of flying. Surely, whatever his form was would be able to fly. In the air was the only time he was truly free, nothing but him and the sky, no expectation, no prophecy… He supposed he was stubborn as well. He’d had to be, just to stay alive, and now he was in the habit of it - see his determination to do this and all his other projects himself, despite Hermione being desperate to help him. \n\n\nAnd on the heels of that thought, he could admit he was rather solitary. He’d never grown comfortable with crowds or being the center of attention, and really if Ron and Hermione visited more than twice a week he began to feel stifled. That was quite enough interaction. He liked being left to his own devices. Probably had something to do with spending his early years in a cupboard, come to think of it.\n\n\nHmm… what else? Well, he could admit to having a fiery temper, though he felt he had reason for it. And he could get quite fixated on things, if he was going into his bad traits. Look at how he’d been in school, with the Philosopher’s Stone, and then the various times he’d insisted on tailing Draco Malfoy for one reason or another, and how he’d been with the snitch Dumbledore left him and well… now with his quest to become an animagus all on his own, no matter how dangerous, or how many attempts it took. \n\n\nAnd then there was the thing he didn’t like to think about. But he supposed, if anything was a defining trait, being a Parselmouth was. He’d thought it was to do with being connected to Voldemort, but even though the horcrux in his scar was gone, he could still do it.\n\n\nSo...love of flying, stubborn, solitary, (justified) bad temper, tendency towards obsession, and ability to talk to snakes. He should probably add recklessness in there somewhere…\n\n\nAs if that thought was a key fitting into a lock, he felt something inside him \n\ntwist\n\n, and then his body was changing too.\n\n\nHe grew to an enormous size, far larger than the room he was in. Walls splintered and cracked as he expanded, the floor giving way and the ceiling pulverized as his head went up and up, and up… Wings sprouted from his back, further wrecking the house, and a tail extended from his spine, whipping around behind him. His mouth was filled with deadly fangs, and his face ballooned out into a serpentine snout. Scales sprouted from his skin, flowing over his body in a wave. Black scales, that gleamed like jewels. Like obsidian.\n\n\n\nBloody hell!\n\n said an inner voice that sounded a lot like Ron. Followed by a Hermione voice that babbled, \n\nBut I can’t be a dragon! The book explicitly states that wizards cannot become magical creatures!\n\n\n\nWhat Harry did not know, of course, was that wizards of sufficient power, wizards who had been touched by destiny and experienced more than one plane of existence were the reason for the old tales about intelligent dragons, who could speak and perform magic.\n\n\nHe was one of the Oriental types of dragons, long and serpentine like a Chinese Fireball, though larger than most and solid black. His eyes, he could see reflected in a bit of shattered glass, were as green as emeralds, and in fact had taken on the aspect of multifaceted jewels.\n\n\nHis last coherent thought, before the dragon instincts rose up and consumed him, was that he hoped Kreacher would be alright.\n\n\nThen he trumpeted his rage at being stuck in a funny cave, and proceeded to smash the house to smithereens, flaming more than once to express his displeasure.\n\n\nHe was distracted soon enough by something shiny, however, for while he was an adult in terms of humans, he was but an infant for one of the Old Dragons, and so had a short attention span. When wizards began to pop into existence around him, he paid them no mind, busy picking through the rubble of the house for things he thought pretty, so that he could make a pile of them and sit on it.\n\n\n“Harry! No, no no no no, \n\nHarry\n\n!” someone yelled, and he looked up, annoyed. He was busy!\n\n\nThere were a bunch of those two legged people standing around him and pointing sticks at him. He gave a draconic shrug, not finding them very interesting, and went back to digging for treasure.\n\n\nBut then the sticks shot red lights at him, and it \n\nhurt\n\n! Not a lot mind, but it wasn’t very nice, and he instinctively raised a pearlescent shield before those nasty people did it again. He ignored their dumbfounded reactions to this, deciding that this place wasn’t fun anymore and he didn’t want to be there.\n\n\nNot quite sure what he was doing or why, he filled his chest with magical fire to help him rise and sprung into the air, spreading his wings wide. All the two leggers started shouting, but he ignored them because they were stupid and he didn’t like them, and started flying in a spiral. \n\n\nHigher and higher he went, always spiralling tighter and tighter in the same direction, until at last he couldn’t wind himself any tighter and something seemed to \n\npop.\n\n\n\nHe grew dizzy for a moment, but it was better when he started descending, spiraling in the opposite direction this time, in ever widening circles. Suddenly the air smelled different - cleaner, better - and no one was shouting, and he knew he was in a different place now. \n\n\nHe broke through the clouds and saw a mountain below him. And within the mountain, he could smell something nice. Something he wanted. Something he instinctively knew was treasure that he should like to gaze at and contemplate and lay upon and maybe every once in a while he would roll around on it and it would be lovely.\n\n\nDecided, he landed and looked for a way into the mountain, too stubborn to give up until he found one.\n\n\nOf course, once he was inside the mountain he found it was infested with goblins. But he remembered not liking goblins very much, and something about traps and betrayal and \n\nclankers, \n\nso he didn’t feel very bad about chasing the goblins away and breathing fire at them when they wouldn’t take a hint.\n\n\nAnd his fire woke something else in the mountain, something that lived deeper and smelled foul and dark and \n\nevil\n\n to the baby dragon who had quite forgotten that his name was Harry. And it was covered in cursed flames, what his mind whispered was \n\nFiendfyre\n\n, but he was not afraid, because he was a dragon and fire couldn’t burn him, not inside or out. So he chased the fire shadow thing around the mountain, and when he cornered it he wrapped it in his coils, and he squeezed and rolled until he put the fire out, and then he pushed it over the edge of a cliff so that it’s body wouldn’t stink up all his lovely treasure.\n\n\nContent that he was now the only one in the mountain, he set about dragging his treasure into a pile and getting it just right before settling down on top of it and, as dragons were wont to do, spending many a year gazing at and contemplating his hoard, and himself, and his memories, and anything else that came to mind really.\n\n\n-l-\n\n\nThe Fellowship was running through the Mines of Moria, after discovering the bodies of Gimli’s kin, a host of goblins on their tail. Legolas ran backwards, taking shots with his bow where he could, but there were too many of the foul creatures for him to have any hope of winnowing the ranks to a manageable level. Unless they could find a place narrow enough to force the goblins at them one or two at a time, they were likely lost.\n\n\nCurse the dwarves for building everything so wide!\n\n\nThey turned, going deeper into the mountain, heading for the bridge Gandalf had spoken of, when suddenly the goblins stopped, looks of glee on their twisted faces, and began chanting a single word.\n\n“What are they saying, Gandalf?” Frodo asked, panting for breath, the blade of Sting glowing blue in his hand.\n\nGandalf had gone pale, unless it was a trick of the witchlight from his staff. “It can’t be,” he murmured, as if to himself. “Smaug was the last.”\n\n\nLegolas felt a chill go down his spine, but he refused to give into dread. He was the Warrior Prince of Mirkwood, and if he died here, he would die fighting and proud.\n\n\n“Gandalf, what are they saying?” Aragorn repeated Frodo’s question.\n\n\nGandalf drew himself up, bracing himself against what he was about to tell them. “One word, repeated over and over. ‘Dragon.’ They are saying ‘Dragon.’”\n\n\nGimli cursed, and Legolas joined him within the confines of his own mind. What could they do against a dragon? None of them had the necessary weapons to even injure one, even Gandalf. Magic would flow off the dragon’s hide like water, and those hard scales would be pierced by neither axe nor sword, and Legolas might as well save his arrows. Perhaps, if he was unfortunate enough to get close, he could aim for the eyes or the inside of the mouth, but he doubted it would do anything but annoy such a monstrous beast.\n\n\n“Our only choice is to go forward,” Gandalf said. “And hope that we don’t attract the dragon’s attention, if indeed there is a dragon within Moria. We must be swift and quiet, and, if the worst happens, we must all focus on helping Frodo get past the wyrm. The ring must be destroyed.”\n\n\nAt that moment, they heard a clamor of drums. The goblins were trying to wake the dragon.\n\n\n“We must fly,” Gandalf said, and led the way.\n\n\nLegolas put an arrow to his bowstring, and kept to the rear, his elf eyes allowing him to pierce the gloom and be sure that the goblins were not trying to catch them unawares. He subtly glowed with the light of all elves, illuminating the path before and behind him, and considered lowering his bow for a moment in order to pull up his hood. While the light of the elves was beautiful, it was inconvenient when one was trying to be stealthy in the dark.\n\n\nHe had just lowered his bow to reach behind for his hood when he saw it out of the corner of his eye. The darkness around them \n\nmoved\n\n.\n\n\n“Gandalf,” he said softly, never stopping his strafing steps. “There is something there. Something that blends into the darkness. We are being watched.”\n\n\nNot just watched. They were being stalked.\n\n\n“Keep moving,” Gandalf ordered before anyone could panic.\n\n\nLegolas could see the sense in that. So long as the dragon did not attack, they should not press matters. Perhaps their luck would hold and the beast would simply watch them until they exited the mines.\n\n\nBut it was not to be. At that moment, a massive black claw with three toes, like the foot of a bird, reached out and attempted to snatch up Legolas. At the same time, a deep voice with a surprisingly proper accent reverberated around them. “How lovely.”\n\n\nLegolas leapt from the path of the dragon’s claw, diving and rolling, but before he could come to his feet, ready to let an arrow fly, another claw caught him about the waist, and almost delicately held him suspended in the air, flailing for purchase.\n\n\n“Careful,” that same voice said. “You almost fell off the ledge then, and that would have been a right shame. I don’t often have guests.” Taking that as a threat, Legolas stopped squirming, not wanting the dragon to drop him into the abyss if the situation could still be resolved in their favor.\n\n\nThe Fellowship, all of whom had been scrambling for their weapons, paused as Gandalf stepped forward. “Guests?”\n\n\n“Oh yes,” the voice went on. Legolas could see the massive bulk of the creature moving in the darkness. It was long and coiled, like a snake, though there was something to the left that seemed to be part of a wing. “Usually only goblins come down here.” The voice became hard. “I don’t \n\nlike\n\n goblins. They’re not \n\nnice\n\n. They smell and they’re always waking me up and leaving mess everywhere and they have clankers.” The dragon said this last part as if it was the most horrible thing imaginable. Legolas had no idea what clankers were, but he vowed to remember it, in case it was some kind of weapon dragons feared.\n\n\n“What of the dwarves who lie dead in the chambers above?!” Gimli demanded before anyone could stop him. Legolas couldn’t decide if the dwarf was addled by grief or always so foolish as to demand answers from dragons. “Was that you, dragon? Speak!”\n\n\nThe darkness moved again, and suddenly Legolas could feel the dragon’s breath stirring his hair, the exhalations warming him and smelling of wood smoke. The creature had brought its face close now. He turned his head and found himself staring into a massive eye that seemed to be made of hundreds of emeralds, each of them as green as the forest in spring.\n\n\nHe’d never expected anything about a dragon to be beautiful.\n\n\n“Oh, is that what happened to the dwarves?” The dragon sounded regretful. “I’d wondered why they stopped carving such lovely tunnels. I thought they’d just gotten scared and left. Marvelous creatures, dwarves, very good at digging tunnels and making treasure even shinier, but quite shy. Poor, nervous little things screamed and ran every time I said hello.”\n\n\nAn incredulous giggle sounded from one of the hobbits. Legolas suspected Pippin. \n\n\nFortunately, Aragorn silenced Gimli before he could make a reply to that.\n\n\nThere was a long pause  in which Legolas could feel the dragon staring at him, and then Gandalf ventured forward. “Great Dragon, would you mind terribly putting our companion down, and allowing us passage through your mountain?”\n\n\n“Mmm? I’d like to hold him a bit longer, if that’s alright.” The dragon said. Legolas could feel its gaze turn to Gandalf. “Oh, how rude of me! We haven’t been introduced, have we? Oh, and can you see? \n\nLumos\n\n!”\n\n\nAt that unfamiliar word magic filled the air, and a light like that of the full moon illuminated the cavern, revealing that they were standing on a large shelf of rock that met the wall on one side and ended in a sheer drop on the other.\n\n\nThe dragon could do magic.\n\n\n“Of course I can. Can’t you?” the dragon answered, making Legolas realize he’d said his last thought aloud.\n\n\n“No,” he replied, seeing the dragon’s eyes on him again and trying to be polite lest he stir the dragon’s ire. “Among us only Gandalf can do magic.”\n\n\nNow that the cave was illuminated, he could see that the dragon was as black as the night sky, and as easily as big as Smaug, though it carried its bulk differently, being built like a serpent with wings, as he’d noted before. Its coils were looped and piled around them, so that it was difficult to tell how long it really was.\n\n\n“Oh,” the dragon was saying. “Well, I’m sure you’re all good at other things. Now why don’t you come over to my hoard and we’ll have a proper chat, and then I’ll show you how to get out of the mountain, if you like.” Then the dragon was swinging its head on that long neck, and suddenly its snout was so close that Legolas could reach out and touch it if he had been inclined. “And what is your name, Treasure?” the dragon addressed to him.\n\n\n“I am Legolas, Prince of the Woodland Realm,” he replied. “And you?”\n\n\n“I had a name long ago,” the dragon said. “But it’s been so long that I’ve quite forgotten it. You can call me whatever you like.” And here, the dragon ducked its head, somehow giving the impression of being bashful.\n\n\nLegolas was starting to feel that the dragon was young. Not a child, but not far into adulthood. And that it was lonely, and had perhaps gone a little mad.\n\n\nHe thought a moment, and then said, “Then I shall name you friend, and call you Arveldir.”\n\n\nThe dragon smiled at him, causing the Fellowship to go for their weapons again before they realized that it wasn’t an expression of aggression. \n\n\nThough there were whispers amongst his companions that this was all a trick, and the dragon just wanted to lure them into comfort before it ate them and took the ring, they stepped forward one by one and introduced themselves, Legolas still clutched in the dragon’s talon.\n\n\nFrodo went last, and when he stepped forward the dragon moved its head and narrowed its eyes to scrutinize the hobbit. “Frodo, did you know that you’re wearing a horcrux around your neck? It might try to choke you and take over your mind. You should destroy it, or at least take it from around your neck.”\n\n\nLegolas did not know the word ‘horcrux’ but he knew the dragon meant the ring, and for a moment all he could think of was what would befall the land if a dragon, even a seemingly friendly dragon, fell to the ring’s influence. It was all he could do not to shudder in horror.\n\n\n“We’re on our way to destroy it,” Frodo said after another awkward pause, apparently deciding to trust the great wyrm. Legolas had misgivings about that, though he had to admit that the dragon had been nothing but gracious. Still, dragons were supposed to be sly and terrible, so how could they know that this was not some convoluted plot?\n\n\n“Oh good,” the dragon said. “That’s alright then. Nasty things, horcruxes. Can’t imagine wanting to split off a piece of your soul like that. And hard to destroy too. Though I suppose if you’re on such an important mission you don’t have time to stop for tea and a chat?” And now the dragon was looking at Legolas mournfully, and he actually felt sorry for it.\n\n\n“You know how Sauron created the ring?” Gandalf demanded, sounding shocked.\n\n\nThe dragon - Arveldir, Legolas reminded himself - cocked its head. “Never heard of Sauron, but I imagine one Dark Lord is much like another.”\n\n\nThe more the dragon - Arveldir! - spoke to them, the more its - his! - mystery deepened.\n\n\n“It is a shame you can’t stay for tea, Treasure,” Arveldir was saying to him, adjusting his grip so that Legolas was sitting more comfortably in the juncture of the dragon’s toes. “I’ve a golden throne with a red cushion that you would look wonderful sitting on, oh, and a crown! You are a prince, aren’t you? Maybe you can just try the crown on, before you go?” he suggested eagerly.\n\n\nAragorn snorted, and then covered his mouth with one hand to hide his laughter, turning his face away. Inexplicably, Legolas felt himself blush.\n\n\n“Sounds like the elf has an admirer,” Gimli grunted.\n\n\n“Well don’t you admire him?” Arveldir asked Gimli, and Legolas wondered if he could possibly be as guileless and genuine as he sounded. “Look how his skin glows. And his hair is the color of new gold, and he smells like the sky does when I fly. I’ve never encountered a living treasure before.”\n\n\nLegolas flushed again as his companions openly laughed this time, flattered at the compliments and yet uneasy that Arveldir considered him to be treasure. What if the dragon tried to keep him in its hoard?\n\n\nAbruptly he found himself moving through the air as Arveldir carried him over to the far side of the ledge they were all standing on and dispelled an illusion that had been hiding a pile of jewels and gold. Not noticing the gasps of amazement that came from the Fellowship, Arveldir started digging through the pile, muttering to himself until he came up with a golden crown that was studded with rubies. Gently, and far more nimbly than Legolas would have thought possible, Arveldir placed the crown upon the elf’s head, and then reared back to admire the effect.\n\n\n“Sapphires would be better, I think,” the dragon mused.\n\n\nHe went digging through his hoard again, this time coming up with an elven made circlet that held an enormous star sapphire at its center. Arveldir exchanged the crown Legolas was wearing for the circlet, and then made a purring noise of satisfaction, his multifaceted eyes spinning. Settling down, he propped the claw holding Legolas up in front of his face, and simply stared.\n\n\nLegolas stared back.\n\n\nThe rest of the Fellowship looked on, some amused, others tense. Gimli was glancing at the dragon’s hoard, but had retained enough sense not to try to touch it.\n\n\n“Arveldir?” Legolas said.\n\n\nThe dragon gave a happy sigh. “Yes, Treasure?”\n\n\n“You’re staring.”\n\n\nArveldir didn’t so much as blink. “No, I’m gazing. Gazing and contemplating.”\n\n\n“Contemplating what, if I may ask?” Gandalf cut in.\n\n\n“Whether the sapphire brings out the blue of my Treasure’s eyes,” Arveldir answered without breaking eye contact with Legolas. “Or if it is the beauty of his eyes that make the sapphire seem blue.”\n\n\nMore laughter at his expense. Legolas sighed. “Thank you, my friend. But would you put me down now? As you said before, we must destroy the ring Frodo bears, and it is an important task.”\n\n\nThat seemed to bring Arveldir out of his trance somewhat. He looked around the members of the Fellowship, and then canted his head to the side, lowering it so that he was peering up at Legolas. “Do all of you need to go? Could maybe you stay here, and the others pick you up on the way back? I’d like to gaze at you for a while longer, you see. There are so many things about you to contemplate.”\n\n\nThat said, Arveldir did grant Legolas’ wish to be set down, though he didn’t put Legolas on his feet. No, the golden throne the dragon had spoken of before was brought out, and Legolas lowered onto it. Arveldir gave another happy little sigh, his warm dragon’s breath blowing Legolas’ hair back. Contrary to many a story, the dragon’s breath did not smell especially horrible. In fact, its smoky flavor reminded Legolas of nights spent camping with his companions.\n\n\n“I would like to stay and speak with you more, my friend,” Legolas said. “But I have given my word to see Frodo complete his mission. I cannot break a promise, you understand.”\n\n\nArveldir laid his great serpent head on the floor, his strange whiskers twitching. “Oh. Of course. I wouldn’t want you to break a promise on my account.”\n\n\nThen he slithered around his pile of gold and buried his head beneath a cascade of bejeweled goblets.\n\n\nThe dragon was sulking.\n\n\nThere was another awkward silence, in which his fellows indicated through gestures that Legolas should do something about the pouting wyrm, and Legolas spread his hands as if to ask what, exactly, they wanted him to do.\n\n\nEventually he found himself standing and laying a hand against those obsidian scales, making his way slowly toward Arveldir’s head so as not to startle him. “Arveldir?”\n\n\nThe dragon raised his head. “Oh, that’s me, isn’t it?” He sounded delighted to have a name.\n\n\n“We still need help with the way out, my friend. And do not be sad. Perhaps we’ll see each other again.”\n\n\n“Oh, right. The way out. Well, follow me then. Actually, you’d better go first and I’ll give you directions. I wouldn’t want to hit anyone with my tail. Damn thing has a mind of its own sometimes.”\n\n\nLegolas felt his lips twitch into a smile, and he consented to let Arveldir carry him toward the exit, if only because the winged serpent seemed to be comforted by it.\n\n\n-l-\n\n\nIt took them another half day, but they eventually emerged from the Mines of Moria, a jet black dragon behind them, his scales sparkling in the sunlight. Once outside the tunnels, they all turned to bid their new friend goodbye. But Arveldir interrupted their leavetaking. \n\n\n“Can I come with you?” he blurted. “I won’t be a bother, I promise. I don’t want to leave my Treasure just yet, you see. And you can all ride on my back if you like, and I’ll fly you to wherever it is you’re going.”\n\n\nGandalf’s mouth fell open. He wasn’t the only one.\n\n\n“He could fly above Mount Doom, and we could simply drop the ring from a height!” Frodo gasped, not quite willing to believe it was true.\n\n\n“It’s a trick! It can’t be that easy!” protested Boromir. \n\n\n“Someone named a mountain ‘Doom’?” Arveldir asked. “That seems a bit silly.”\n\n\n“Never would I have thought to see a dragon oppose the forces of Mordor,” Aragorn breathed.\n\n\nArveldir chuckled, the sound like a rockslide. “You can’t have met many decent dragons then.”\n\n\nLegolas was beginning to wonder if he’d been injured in their skirmish with the goblins, and if all that followed was some kind of dream brought on by blood fever.\n\n\nIn the end it was, as always, up to Frodo.\n\n\n“We will take Arveldir up on his offer,” the hobbit declared.\n\n\n“Brilliant!” the dragon smiled. “Let me just go tuck some things into my belly scales. Be right back!”\n\n\n-l-\n\n\nThree days later, as the dragon flies, the One Ring was tipped into the fires of Mount Doom, and the black tower that supported the Eye of Sauron collapsed.\n\n\n“There are still the black armies and Saruman to contend with,” Gandalf said.\n\n\nLegolas wasn’t worried. It was a novel feeling.\n\n\n“What now, my Treasure?” Arvendil’s voice floated back to them on the wind. They were all seated in a row just behind his head, clinging to the spines of his back.\n\n\n“To Imladris, if you would not mind, my friend,” Legolas answered.\n\n\nArvendil banked into a turn. “Which way is that?”\n"
}