{
    "id": "688853",
    "url": "https://archiveofourown.org/works/688853?view_full_work=true",
    "author": [
        "weathervaanes"
    ],
    "title": "Bones Straining Under the Weight",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Teen Wolf (TV)"
    ],
    "relationships": [
        "Derek Hale/Stiles Stilinski"
    ],
    "characters": [
        "Derek Hale",
        "Stiles Stilinski",
        "Scott McCall (Teen Wolf)",
        "Erica Reyes",
        "Isaac Lahey",
        "Vernon Boyd",
        "Laura Hale",
        "Peter Hale"
    ],
    "additional_tags": [
        "deaf!derek",
        "Food Blogger!Derek",
        "Alternate Universe - Human",
        "Alternate Universe"
    ],
    "language": "English",
    "series": "",
    "published": "2013-02-17",
    "completed": null,
    "words": "15,645",
    "chapters": "1/1",
    "comments": "660",
    "kudos": "24,567",
    "bookmarks": "6,840",
    "hits": "307,033",
    "summary": "<p>One of Stiles' favorite things about life is Derek Hale's food blog. He never expects to meet the man in person.</p>\n<p>~</p>\n<p>“Derek,” he says again, and the name feels very strange on his tongue. “You don’t mean Derek Hale.”</p>\n<p>His professor’s eyebrows reach up, eyes widening. “You read his blog?”</p>\n<p>\"Uh. Worship. Would be a better more descriptive word. That is Derek Hale?\"</p>\n<p>Jimmy chuckles. \"Good-looking guy, huh?\"</p>\n<p>\"You mean to tell me the Food Network hasn't snatched him up to dethrone everyone else from daytime TV.\"</p>\n<p>Jimmy smiles a small private smile. \"I don't think TV is his medium.\"</p>\n<p>Stiles raises an eyebrow. \"Shy?\"</p>\n<p>The man laughs heartily at that. \"No, I wouldn't say that. He just has particular forms of expression, like eyebrows and chili powder.\"</p>",
    "notes": "<p>For the prompt: Derek is deaf and Stiles takes care of him.</p>\n<p>So, we didn't answer it exactly (because Derek is a strong, powerful human who don't need no man to take care of him), but we did our best.</p>",
    "text": "You want to impress him/her, right?  You want wine and soft jazz and, eventually, sex.\nBecause isn’t that always the end goal?  Here’s a secret: if you want to get them into bed, you cook for them.  That’s always been the way.  But then there are the guys (and girls) who don’t know how to cook, who fumble and fall over themselves and end up burning water or failing to preheat because “it’s all the same”.  So, to make life easier, here’s the simplest, best-tasting thing you can do to get laid:\n \nLinguini in Clam Sauce.\n \n \n \nTry it and thank me later.  And remember to allow thirty minutes for digestion before engaging in vigorous activity.\n \nStiles chuckles to himself while he jots down the recipe. He doubts even Derek Hale's magic clam sauce is going to get him laid after five months of nothing but it looks like good food. And Stiles loves good food. He makes a mental list of what he'll have to go out and buy and where he can get fresh clams so he can test it out before writing it carefully into his steadily growing collection of Hale's recipes. Someday he'll have kids who he can lie to with a straight face and pass off the entire cookbook as his own silent genius.\nHe remembers when he’d found the famous food blog three years ago.  He’d been a sophomore in college, stuffing his face with minute-rice and Cup o’ Noodles—he’d been filling his body with such terrible food that a rare salad was a joy.  And then Stacy, mid-lecture, had leaned over and shoved her phone at him, showing a recipe for raspberry chocolate cake with layers of real fruit, decadent chocolate sauce, and raspberry drip.\nAfter that, he was hooked.\nHe followed Derek’s chicken recipes, made his shepherd’s pie, his pot pie, his apple pie—he has a whole page devoted to pies, actually.\nStiles had simply fallen head over heels in love with Derek’s food.\nHe’s a little bit in love with Derek but in the kind of way he’s in love with Ellen. He’s blunt and hilarious, always assumes his readers are inept in the kitchen (like Stiles had been when he first began, so that helped) and has tags on his blog that label 'pre-orgasmic', 'post-orgasmic', 'comes with its own orgasm' dishes.\nStiles, more often than not, finds himself staring at his computer screen and wishes he had the balls to comment like some of these other people do.  There are loads of women (and even though there’s no picture of Derek on the blog, his info says he’s only 30 and he’s a California native, so he’s pretty popular with the ladies) who compliment him and make flirty suggestions.  There’s the occasional dude, talking about how Derek’s latest dish helped him land a hot date, and then there are the moms. \nThe moms are Stiles’ favorite.  They’re sweet and homely and they call Derek “hun”, but honestly Stiles would probably enjoy them a lot more if he didn’t feel like he would be one of them if he ever got the guts to type something in.\nHe’s made almost every single one of Derek’s dishes.  And, for some reason, he feels like that’s something he wants people to know.\nHe doesn’t write it, though, because he feels stupid.  So he shuts his laptop and turns towards the center of the apartment, staring at how his roommate is thumbing through a book on animal life.\n“You don’t even like fuzzy things,” he tells Scott.\nScott frowns at him.  \"Are you high? My entire line of work is fuzzy things. I put a brace on a bunny last night, Stiles.  A bunny.\"\n\"Yeah, but aren't you like a lady doctor dealing with lady parts? Don't you get tired of looking at them even though they're amazing and wonderful and beautiful?\"\n\"Oh, God, you're actually high.\"\n\"No, I'm hungry.  I'm going to the hippies for fresh clams.\"\n\"Oh, dude, get me some star fruit, I freaking love the market's star fruit.\"\nStiles still has no idea how he’s doing this, going to grad school for his master’s, being a substitute teacher whenever the opportunity arises, plus being paid to edit undergraduate student’s essays—it’s a miracle he has time to cook.  And he loves it.\nHis mom loved to cook, had a few hastily-scrawled recipes, but she mostly just stored things in her head.  And now, Stiles kind of feels like this is a way to connect to his mom again.  It’s how he’s felt for the last four years.\nThe only problem: his favorite professor, Dr. Church (who insists on being called “Professor” in the classroom, or just “Mister”), apparently believes in him so much that he’s been working Stiles to the bone for the last few weeks to help him come up with an idea for his thesis.  He’s 5 months away from summer and he hasn’t made a Derek dish (shut up, it’s an adorable alliteration) in almost a month and a half.\nThis clam sauce, Stiles tells himself, is going to be his revival.\nIt's beautiful. It's delicious. He wants to sing to it. Unlike his early attempts he's learned to pay attention and do as he's told when it comes to cooking. He thinks back to the blog entry and how pathetic cooking for one is and about what a good bro he is so he calls Allison. She and Scott can enjoy the aphrodisiac effects Derek meant for the dish. He'll just have some of this now and leave the rest for them. He likes doing that, sometimes, letting others enjoy what he makes. His favorite part is making the dish, feeling like he's following someone's instructions because he actually feels a little less eternally single and alone. After that it just feels sad, sitting on his own with elaborate meals and no one to flirt with over them.\nMaybe that’s his problem.  Maybe he needs to go on a date.\nOr better yet, maybe he just needs to get laid.\nIt’s been way too long since he’s even gone to a bar, let alone a club, danced with someone, made out with someone.  It’s Scott’s fault, he thinks.  Friends are the ones who are supposed to help friends get significant others, but Scott’s so busy being wrapped up in his own girl that he doesn’t even think about helping Stiles out.\nAnd he’s in a rut.  A really, really bad rut.\nBut, he figures he’s just going to do what he always does: study until he needs a drink, go out, get plastered, and then sleep off all of the heavy feelings in time for his classes.\nHe's actually downing one of Derek's hangover recipies - The Zombie Raiser, cute little Tabasco-fueled nightmare Derek posted on November 1st to help with the Halloween hangovers - when he stumbles into his Early Visual Expression and Stimulation class. Apparently there's more to lighting munchkins' brains up than plastering your room with solid primary colors and making them draw their dog. It's a hell of a class to have in the morning because stimulation was the name of the game. He shuffles into one of the front seats so that his professor can get the hint about the state he's in and avoid judgment from the sorority sisters that rule the middle aisles, and then he sees him. He's laughing, though Stiles didn't catch whatever joke Professor Church must've thrown at him, and he's shoving at the man's shoulder, his whole face emoting the general “you're a jerk” concept. He's probably about to drool when Isaac shoves his adorable but impertinent ass in front of his face.  \"Sorry, dude, sorry, scoot would you?\"\nStiles sighs and stands up, trying to figure out this awkward dance with Isaac and, well, that’s when the stranger talking to Professor Church decides to turn and exit, and smacks right into Stiles.\n“Sorry!” Stiles says quickly, holding his hands up.  “I’m so—so sorry.”\nThe stranger is about Stiles’ height, has dark hair, scruff on his face, and deep green eyes.  If he hadn’t seen the dude smiling a few seconds ago, Stiles would think he was absolutely terrifying.  But he’s mostly just insanely gorgeous.\n“Wow, that was—totally my fault, I’m so sorry—I didn’t, like, hurt you, did I?  ‘Cause I know I’m a klutz but I’ve never actually maimed anyone and, well, hey, there’s a first time for everything, right?”  He laughs anxiously, his heart pounding out a samba.\nThe dude simply nods, gives a little smirk/smile thing, and heads towards the door, raising a hand to Professor Church as a goodbye.\nIsaac grins at him when they fall back into their seats.\n“Nice one,” he says.  “Very smooth.”\nStiles grumbles and takes another sip of his portable soup.  \"Shut up.\"\nThroughout the lesson and the rest of the day, he can't get the sight of that man out of his head. It's like coming face-to-face with something out of a magazine, those people that every body-positive lecture he's ever listen to has assured him doesn't exist. But there he had been. And there Stiles had barfed the entirety of his hungover brain onto the beautiful man and made an ass of himself and tonight he is going to make warm chocolate pudding with caramel swirl and not share it with anyone.\nBecause that’s how he rolls.\nThat’s exactly what Stiles does, actually, and maybe he gets a little bit of caramel on an essay, but it was pretty terrible anyway, so he figures it won’t make that much of a difference.\n \nThe next morning Stiles has a full speech ready in case the dude happens to be there again, but no dice. He makes sure to pay attention and participate in the lecture so that it isn't absolutely awkward when he approaches the professor after class. Professor Church is Jimmy after class because his actual passion is teaching five-year-olds and the five-year-olds always called him Jimmy and he misses that, protocol be damned.\n\"Hey, Jimmy, quick question?\"\n\"Mr. Stilinski.”  The older man smiles.  He reminds Stiles of a thin Santa.  “Glad you're back with the living this morning.\"\n\"Yeah, I was a mess yesterday, sorry about that. But uh, I hope this isn't creepy…  The guy you were speaking with before class yesterday…”\n\"Oh, yeah, Derek. He's a great guy, he was dropping off some pictures that I wanted to show you all this week but I'm still working on the lesson.\"\nStiles nods slowly.  \"So he's a photographer?\"\n\"No, no. Blogger. Internet sensation, he was dropping off some shots of the dishes he puts up with his posts.\"\nStiles blinks, trying to absorb all of the information as quickly as possible.  “Derek.  Who blogs.  Food.”\nJimmy nods, sitting up straight his chair and turning towards his computer.  “Yeah, you wouldn’t think it, looking at him, but he’s a huge foodie.  He wanted to be a chef for a while, but, uh, it didn’t really work out for him.”\nThere’s a jumble in his brain as he tries to work around everything.  “Derek,” he says again, and the name feels very strange on his tongue.  “You don’t mean Derek Hale.”\nHis professor’s eyebrows reach up, eyes widening.  “You read his blog?”\n\"Uh. Worship. Would be a better more descriptive word.  That is Derek Hale?\"\nJimmy chuckles.  \"Good-looking guy, huh?\"\n\"You mean to tell me the Food Network hasn't snatched him up to dethrone everyone else from daytime TV.\"\nJimmy smiles a small private smile.  \"I don't think TV is his medium.\"\nStiles raises an eyebrow.  \"Shy?\"\nThe man laughs heartily at that.  \"No, I wouldn't say that. He just has particular forms of expression, like eyebrows and chili powder.\"\nStiles goes through nearly 80 pages of Derek’s blog that night, wondering in his new ability to put his sarcasm and wit to a face.  And it just makes it better.  He’s…  He’s like chocolate mousse.  Decadent.  The way he talks—or types, Stiles guesses—is endearing and exciting, and suddenly he’s no longer a mom-commenter (if he commented, that is).  No, now he’s one of those women who want nothing more than to let Derek pamper them with good food and a really, really good night.\nJesus, he’s gorgeous.  But his face is quickly slipping from Stiles’ memory.  And he needs a reminder.\nHe spends a week with his fingers crossed, listens to Professor Church rant on and on about Derek’s pictures, prays for him to appear.  He doesn’t.\nUntil one Saturday afternoon when Stiles is heading into Jimmy’s office because his laptop is being repaired and he knows the man holds office hours so that he can ask him a question about his weekend assignment.\nAnd there Derek is, sitting across from Jimmy at his desk, moving his hands in front of his chest.\nJimmy grins and shakes his head, his hands waving vigorously before they start moving in swift purposeful shapes. It takes a minute for Stiles' brain to catch up and tie information together. Right. Why are they signing at each other? He knocks quickly and pretends to not have been gawking at them for the last twenty seconds.  \"Hey, Jimmy.\"\nThe professor looks up at him and smiles. \"Mr. Stilinski,\" he says, but his hands are still moving, \"what a coincidence. Please, come in. This is my friend Derek Hale.\"\nStiles licks his lips and takes a step into the office, stopping dead on his tracks when Derek turns around with his hand outstretched and his bright beautiful eyes laughing at him. Jimmy had blabbed.\nHe blushes a little and shakes Derek’s hand.  “Wow, I’m sorry about whatever he told you—I promise I’m not as creepy as I seem.  Most of the time.”\nDerek gives a short, harsh laugh and turns to Jimmy, hands moving quickly.\n“Uh, he says it’s nice to meet a fan who isn’t middle aged or trying to push their breasts into his face.”  Jimmy grabs Stiles’ shoulder, turning his attention away from Derek—which, what, is he, really, oh my god—so he can ask, “What can I help you with, Stiles?”\nStiles blinks, looking from Derek to Jimmy.  “Um.  I just had a few questions about the visual project, and I tried shooting you an email but my roommate spilled beer on my laptop and…”  He huffs out a sigh.  “Long story short, it’s in the shop so I figured I’d just come in.”\nJimmy nods for him to go ahead and he rattles off his silly questions and feels Derek Hale judge him for being a dweeb even though all evidence seems to suggest that Derek Hale can't actually hear a word he's saying. Jimmy tells him to relax with the specifics, to Skype with his younger cousins over the weekend and ask them about what sort of images make them most excited or happy. Then when Stiles' questions are answered he turns back to Derek who apparently wasn't so much judging him as texting.\nA few seconds later Derek glances up and holds a finger up as he finishes a text before putting the phone in his pocket and throwing his hands into something that looks like interpretive manual dance to Stiles. Jimmy smiles and signs something back that makes Derek glare at him.\n\"Stiles, Derek and I were just heading out to lunch, you should join us. I know that my class asks for a lot more artistic endeavor than your average education lecture, maybe Derek has some ideas for you.\"\nStiles’ first instinct is to say yes.  But he sees Derek roll his eyes and something heavy settles his gut.  “Uh, maybe another time?” he says, but Jimmy has this thing with people speaking in questions that are not meant to be questions.\nSo, on cue, he lifts an eyebrow and asks, “Was that a question or an answer, Stiles?”\nStiles laughs nervously.  “Look, I don’t want to intrude—”\n“It’s not an intrusion!” Jimmy exclaims, and he signs something to Derek.  Derek cracks a smile and signs something back that makes Jimmy laugh and Stiles decides he absolutely needs to learn sign language.  “Derek’s cool with it.  Let’s go.”\nStiles has had lunch with Jimmy and other professors before. The early education graduate route is a tight group and a very relaxed one at that. Now though, Stiles is everything but relaxed. He is sitting across from Derek Hale and he doesn't know what to say. But even if he did, Stiles has no idea how.\nJimmy takes a seat beside Derek but at an angle so that Derek can see him as he signs.  “Don't panic, Stiles, just speak as you normally do.  Derek can understand you perfectly.\"  Derek snorts and signs something which makes Jimmy grin.  \"Well almost perfectly.\"\nStiles licks his lips.  “It is, uh, better if I talk, like, slower or something?”\n“No, just normal pace, he’ll ask me if he needs clarification.”  He orders beers for the three of them and immediately tries to drag Stiles into a conversation about Derek’s blog.  He’s halfheartedly signing as he does it and Stiles can see that Derek’s eyes remain on his lips most of the time anyway, but it’s still terribly embarrassing, because he can’t stop talking about Derek’s rating system.  “I think the orgasm rating scale is very clever.  I keep telling him he should patent it before the next Rachel Ray steals it.”\n\"I still think you should have a show on the Food Network,\" Stiles says, because he doesn't feel right addressing Jimmy when he's talking to Derek.  “It could be like double education. Teaching people to sign and cook.\"\nDerek smiles and signs and Jimmy looks pleased for some reason.  \"He says the Food Network wouldn't appreciate his rating system and his food doesn't taste the same if it isn't accompanied by sarcasm.\"\nStiles grins, nodding.  “Yeah, I could see that. Well, at least write a book or something—I mean, the age of technology is great, but you can’t be making a lot of money.”\nDerek shrugs, makes a quick sign.\n“Some,” Jimmy translates.  “Enough.”\n“Well.”  Stiles shrugs.  “I’d buy the book.”\nThey actually have a great meal, the highlight of which is when Derek spends a moment in a signing ramble to Jimmy, who communicates to Stiles, “He says his Carbonara is better, but he likes what they do with the bacon—only, he thinks you can never go wrong with extra meat.”  He laughs at the end, and Stiles blushes bright pink.\nIt’s different, he realizes, then reading the innuendos, actually looking at the man who comes up with them.  And, oh my God, the man is gorgeous.  Honestly, out of how many ways Stiles had pictured him…  Drop dead sexy was definitely not one of them.\nOh, and deaf.  He hadn’t really thought about that one, either.\nIt adds something, though.  It adds mystery and excitement and it makes Stiles ridiculously impressed, because he never would have guessed.\nFor some reason, it doesn’t freak him out.  Initially, sure, it had been a little surprising, but…  But, no, it’s not scary.  It just makes him a little nervous that he’s going to fuck up like he always does and do something terribly offensive.\nThen Jimmy excuses himself because there are papers that need grading and stuff to be procrastinated on and Stiles' eyes go wide with panic. Jimmy laughs and pats his back, pulling his part of the bill out of his pocket and putting it on the table.  \"You want to teach the people of the world, Stiles, you're going to have to immerse yourself in experiences you've never considered. Derek here has been dealing with Hearing people all his life, I'm sure you won't be much of a bother.\"  He leans over and gives Derek a quick handshake, signing something with a wink, and Derek simply flips him off in response.\nYeah, Stiles decides.  He definitely needs to learn sign language.\nStiles gnaws on his lower lip for a second.  “Wow, okay.  Uh, is this awkward?  ‘Cause we just met and I’m a giant loser?”\nDerek smiles softly and shakes his head.\n“You know, when I was growing up I kind of wanted to learn sign language.  My high school offered it as a class and it seemed easier than Spanish, but things got all jumbled and…”  He shrugs.  “Never happened.  Was it hard to learn?”\nDerek smirks.  He shakes his head no.\nStiles licks his lips.  \"I just…never thought about it, never considered, you know, that some people can't hear. It's kind of blowing my mind because, I mean as you can tell, I read your blog religiously and I never thought, well I don't know what I thought you would be like.\"\nDerek looks at him without giving him a single hint and then pulls a pen out of his pocket, dragging the napkin Stiles was torturing away from his fingers and under his pen.\nHe slides the paper back to Stiles. Disappointed?\nStiles laughs, rubs his hand over the back of his neck.  “No, not disappointed.  Not at all, actually.  Intrigued.  And, uh, a little bit excited.  I mean, your food is how I survived college—literally.  I thought I was going to die with the bad food I was eating.”\nDerek smiles and scribbles down on the napkin again.  I take that as a compliment.\nStiles grins.  \"It is. Though I have to call you on the false advertising, good food alone will not get you laid. I think you're giving your work too much credit for your conquests.\"\nDerek laughs at that.  He lifts his hands up, as if to sign, and then looks down at the napkin and laughs again.  Sorry, old habits.  So you read the clam sauce recipe, huh? Nobody throwing themselves at your feet?\n“Well, no, but that’s also not what I meant—I just.”  He laughs trailing the fingers of one hand down the damp side of his water glass.  “You’re, uh.  Not what I think of when I imagine a 30-year-old food blogger.”\nDerek runs a hand through his hair, still smiling and grabs a new napkin. You have to stimulate the senses when you're trying to seduce someone. How you look won't do it.  Hearing people won't appreciate me reciting poetry in their ear, so I feed them instead.\n“Well,” Stiles says, and plucks out his wallet from his jeans, “I might argue with the looks part.  I think if you stared at a girl long enough she would probably just jump you.  Or, uh—a guy?  I don’t—I don’t know.”\nDerek arches an eyebrow.  He nods.\nWell, if that isn’t ambiguous.\n“But food is definitely the best way to get into someone’s pants.  Even if it’s because their button popped.”\nDerek smiles graciously and makes a grab for his own wallet.\n“No way, dude,” Stiles protests.  “Theoretically, you’ve made me a ton of meals—let’s consider this is first step to repayment.”\nWhile Stiles pays Derek grabs one more napkin and slips it beside Stiles' hand.  I'll have to actually make you a meal then, make sure you're doing it right.\nStiles bites his tongue and tries not to blush.\n“I, uh…  I think you may have just asked me out on a date, but I kind of have this weird thing where I overanalyze things a lot and so maybe you could just tell me whether or not that’s what you had in mind so I don’t actually make a total jackass out of myself like I’m doing right now.  Shutting up.”\nDerek looks down at the napkin and nods.\nStiles grins.  “Okay.  Yes.  Here.”  He grabs the last napkin on the table and Derek’s pen and scribbles down his number, writing his name on top of it.  He watches Derek frown at the letters and waits for him to look up.  “I know, my name’s confusing.  Sorry.  But, uh, text me?”\nDerek manages to fold the napkin neatly with just the fingers of his right hand and smirks when he sticks it in his pocket. When Stiles gets home he throws himself on the floor and tries to process his afternoon.\nHe's probably there for about ten minutes before Scott walks out of his room, \"Uh...dude? Stiles, bro, are you okay?\"\nHe blinks up at Scott, a dopey smile still on his face.  “I’ve had the weirdest morning.”\n“Good weird?”\nHis smile grows.  “Fantastic weird.  I’m talking life-changing fantastic weird.  Like…”  He laughs and heaves himself up off the ground halfway, sitting with his legs played in front of him and his weight on his hands behind him.  “I met someone.”\n“No way, dude, that’s great!”\n“Yeah,” Stiles agrees, nodding.  “He’s…  He’s awesome.  He’s funny and smart and handsome and he cooks, Scott.  He fucking cooks like a master chef.”\n\"Man, if you guys like get married I'm going to get super fat. Do you think Allison will agree to being fat with me?\"\nStiles punches his knee.  \"Would you shut about Allison for a minute? I'm serious, this guy is like the whole package.\"\nScott kicks at him.  \"You've got it bad, dude.\"\n\"Yeah,\" he sighs, dropping back down to the floor.  “Yeah I do.\"\nScott cocks his head.  “So, you just met him today?”\n“Well, we had an informal meeting about a week ago,” Stiles says lightly, head lolling against the floor, “but we actually had, like, conversations today.  He’s Jimmy’s buddy.”\n“Ah.”\n“He’s very flirty.  Which I was not expecting—at all.  But I’m gonna go with it.”\n\"You should, cause you look really happy. Now can you take your happy and make me some special grilled cheese because I can't do it like you do it and then it tastes like bitter disappointment.\"\nStiles laughs and Scott helps him up.  “Sure, dude.  Cheesy, buttery sandwiches, coming right up.”\n \nHe gets a text that very night with an address and Tuesday 7pm, come hungry. He maybe kicks around in bed and gets told to shut up by Allison so he makes pathetic noises into his pillow instead. He sits up late with his laptop and a mirror practicing basic things, hello and thank you, good to see you, how are you, real polite stuff. Then he spends the next night practicing kitchen talk that he doesn't master but he's pretty sure he can ask Derek to pass him the pepper so he's going to try not to make an innuendo out of that. He has no idea how to start teaching himself a whole new language but he hopes Derek gives him enough of a chance to try. That of course would require that Stiles not make a total ass of himself the next night so he'd still have to see about that.\nDerek greets him at the door and smiles at him, beckoning him inside.\nBefore Stiles can control himself, he’s prattling on about how beautiful Derek’s loft is and, quick, where’s the kitchen because it must be amazing—and then he remembers that’s he’s not even facing Derek so that he can read his lips.\nHe blushes slightly and turns to Derek.  “Your place is beautiful,” he says.\nDerek lifts his hand to his chin, touches it briefly, and lowers it again.\nStiles knows that one.  It means “thank you.”\nHe signs “you’re welcome” and Derek’s eyes light up.\n“I may have invested some time in online video over the weekend,” Stiles confesses.  “Just in case.”\nDerek gives him a look, one that’s sly and flirtatious, and then he ducks around a corner for a second and comes back with a mini whiteboard and an attached pen.\nUntil you master the language, he writes.\nStiles smiles.  “Deal.”\nHe jerks his head and Stiles follows him to the most perfect kitchen he's seen outside of television. It's all stainless steel and polished shining black stone. It is, without a doubt, the most bad ass thing that could produce pies that Stiles could never have imagined. Derek slaps the whiteboard onto the fridge and it looks awkward in its pathetic, bland, plastic existence. A bit like Stiles, out of place in a dream kitchen with a dream man and it's all such a dream that he's going to wake up any minute now.\nDerek has his chin in hold, then, and Stiles blinks at him.\n“What?” he asks.\nDerek smiles, leans back, and scribbles on the board, Watch and learn.\nHe makes Carbonara, which makes Stiles think back to lunch, and wow, things are…happening.  Just two weeks ago he didn’t even know Derek Hale legitimately existed (people put crazy shit on the internet), and now…  Now he’s in his kitchen.  Watching him cook.\nAbout ten minutes into a companionable silence, Derek brings out a bottle of champagne.  And Stiles feels his stomach burst into little warm bubbles.\n\nYou drink champagne?\n\nStiles nods, signing, Thank you.\nDerek pours.\nHe's given up on deciding whether or not it's all a dream and concentrates his efforts on not waking up. Derek puts him to grating cheese and after three strokes shook his head vigorously and demonstrates it. Stiles, of course, doesn't have Derek's male model muscle build and does a less than satisfactory job. What he doesn't expect is Derek lowering the heat on the stove and standing behind him, demonstrating the short smooth shaves of cheese he wants on the dish by placing his hands over Stiles' and showing him. His back is pressed up against Derek Hale's chest and Stiles is about 29 seconds from collapsing.\nHe manages to survive, though, even if he’s a little shaky afterwards.  Derek’s phone buzzes on the other side of the counter while he peeks in on his noodles.  Stiles sets a hand on his shoulder.\n“Phone?”\nDerek looks over at it and shakes his head.\n“Might be important.”\nJust another shake.\nStiles, in his entire life, has never felt like this.  And nearly everything inside of him is telling him what a terrible idea this is—they’ve only just met, Stiles probably has a severe hero complex with the guy that could totally skew whether or not they’re a good match, it’s nearly impossible for them to communicate…  But there’s something else inside of him that makes him feel like he’s glowing.  And it’s knowing that Derek flirted with him, that Derek wanted to eat with him, that Derek is seeking out more of his time.  And that’s enough for him.\nThey eat and Derek writes on the whiteboard.  He pours more champagne, Stiles gets giggly, and it isn’t until he’s actually eating that he realizes—holy crap.  It’s even more incredible than it smells.\nHe says as much to Derek, except with more colorful language and lots of adjectives.  Derek just sits there looking pleased.\nFour glasses of champagne later and dishes cleared, Stiles pulls on his jacket and says, “This was…a lot of fun.”\nDerek smirks.  He holds up a finger and then writes something on the board.  When he turns it around, Stiles can read that it says,\n\nSo, I guess the pasta didn’t work.\n\nStiles arches an eyebrow.  “Oh?”\n\nDon’t you remember?  Food = seduction.\n\nStiles has a terrible feeling in his chest suddenly, a knot squirming together, something that’s telling him that that’s all this was, a chance for Derek to get laid, but his disappointment must play out on his face because Derek puts the board down in a hurry and shakes his head, smile falling off of his face.\nHe keeps shaking his head, walking towards Stiles, and Stiles just smiles softly and puts his hands on Derek’s chest.\n“Hey, relax.  I know you were just—it’s okay.”  He licks his lips.  “I’m sorry.  You know, for all the jokes I make, I guess I’m not really very good at taking some.”\nDerek blinks at him, blinks at his eyes and then at his lips, and Stiles feels his breath catch.\nStiles nods to his unasked question.\nAnd then they’re kissing.  It’s long and slow and Stiles wraps one arm around Derek’s shoulder, the other going around his middle.  Derek’s hands are on his ribs, holding him close, and his mouth…  His mouth is perfect.\nDerek pulls back suddenly, making a swift signing movement with his hands.\n“I—I’m sorry.  I don’t—”\nDerek copies the gesture again and lunges in for another kiss, this time more heated and frustrated.\nStiles goes with it.  Because why the hell not?\nWhen Derek breaks the kiss again, however, Stiles just laughs and drags him back towards the table so he can write it down.\n\nI want to see you again.\n\nStiles grins.  “Good.  Because I want to see you again too.  Text me.”\nDerek nods.\n“Thank you for dinner.”\nDerek’s response is another kiss.\n \nThey text a lot.  It’s nice, having a conversation with Derek where he doesn’t have to just listen to the sound of his own voice, and when they make plans to have lunch after one of Stiles’ classes the next Friday, Stiles can’t help but be ridiculously excited.\n“I hear your dinner on Tuesday went well,” Professor Church says at him as he walks in the door on Thursday morning.  “Except for the part where you took a joke too seriously and Derek made a fool out of himself trying to prove to you that he wasn’t in it only for the sex.”\nStiles sputters, trying to come up with an appropriate response, but Professor Church just waves him off.\n“Relax.  Derek’s harmless.  He acts cocky, and he is sometimes, but he’s mostly just flirty, and he likes you.  I know he likes you.”  He spreads his palms.  “So.  You gonna see him again?”\n“He didn’t tell you?”\n“Of course he did, are you crazy?”  He leans back in his seat, grinning.  “Tomorrow for lunch.  He already told me what he’s gonna make you.”\n“More cooking?” Stiles laughs, his cheeks burning red.\n“Hey, enjoy it.  He stopped cooking for me years ago.”\nBy the time he sees Derek again, he knows a few more words in ASL—and knowing the appropriate term makes him feel pretty accomplished, too—and he thinks he might even be able to hold a conversation with Derek.  It would have to involve family members, colors, or basic types of food, but he could do it.\nDerek walks him through his favorite way to make Greek salad and then cooks him lamb.  Like, really good lamb.    There’s pita bread and homemade hummus and—\n“We’re going ethnic, huh?”\nDerek grins, nodding, and then scribbles, That’s okay, right? on the whiteboard.\n“Absolutely.”\nDerek kisses him again when they’re clearing their plates in the kitchen, presses him up against the counter and kisses him long and deep and slow, and Stiles feels like he’s going to melt into the sink.\nThis would usually be the part—in the few number of romantic encounters that Stiles has had—where they make out for a really long time and Stiles whispers, “Don’t stop.”  A lot.  But he realizes very quickly that he can’t do that.\nSo when Derek breaks the kiss, he figures he’ll have to accept that for now.  Besides, Derek is looking at him with a sense of wonderment, so he’s pretty sure he’s not really in danger of being thrown to the side.\nHe clears his throat.  “Can you teach me how to sign your name?” he asks.\nDerek smiles and lifts his own hand.  He lifts his forefinger up, the other three fingers making a circle with the thumb.  It looks like a D.\nStiles mimics it and lets Derek adjust the placement of his fingers.  Then Derek folds his four fingers so that the tips of them are pressing against the top of his palm and his knuckles are sticking straight out.  His thumb is folded in front of his palm.\nStiles can vaguely see the E it makes.\nThen, Derek twists his forefinger and middle finger together, and Stiles assumes it's an R.  Another E follows and then Derek spreads his middle and forefinger into a V-like shape and puts the tip of his thumb between them.  Stiles guesses it’s a K.\nDerek gives him a thumbs up and then points directly at his chest.\nStiles arches an eyebrow.  “Me?” he asks.\nDerek nods and lifts his hand.  It’s a closed fist with the thumb folded across the fingers.  Stiles blinks at the motion, confused, and Derek grabs his hand to make him mimic it.  Then he lifts his forefinger and slides his thumb between it and the middle finger, setting his forefinger down over it again.  Stiles can feel his confusion growing to the point of rapid embarrassment.  And then Derek sets his thumb to the side of his fist again and lifts his pinky.\nStiles knows that sign.  It’s an I.\nWhich means Derek has been signing his name.\nHe makes an L then, with his forefinger and his thumb, and an E like he did earlier, closing it with his first confusing sign, the fist with the thumb across it, an S.\nStiles copies the hand gestures slowly again, and gets a kiss for his success.\n \nSo I recently met someone who is still kind of shocked that I'm not an overweight balding mess. It's all about staying active. Sometimes (when you really like someone and you're taking it slow) you even have to get out of bed to get your exercise in. But everyone needs a snack to keep them going, right? Trust me, that protein crap you're getting from the vending machine isn't doing you any favors. So here's a quick snack with zero risk of setting your kitchen on fire but a kind of huge risk that you'll sit on your couch eating them in one go and avoiding the gym.\n \nNo-Bake Balls of Energy\n \nPrep Time: 10 minutes\nYield: About 20-25 balls\n \nIngredients\n \n1 cup (dry) oatmeal (I used old-fashioned oats)\n2/3 cup toasted coconut flakes\n1/2 cup peanut butter\n1/2 cup ground flaxseed or wheat germ\n1/2 cup chocolate chips (optional)\n1/3 cup honey or maple syrup\n1 Tbsp. chia seeds (optional)\n1 tsp. vanilla extract\n \nStir all ingredients together in a medium bowl until thoroughly mixed. Let chill in the refrigerator for half an hour. Once chilled, roll into balls of whatever size you would like. Store in an airtight container and keep refrigerated for up to 1 week.\n \nStiles stares at the new recipe, grinning from ear to ear.  He knows Derek works out—he has to, with everything he’s got going on—but that’s not even the best part of the post.\n“I recently met someone.”\nThat’s what it says.\nDerek recently met Stiles.\nIt makes him giddy, even a vague little mention, and he shoots Derek a text to say they should make those things together some time.\n \n\nFrom Derek (2:45 PM):\n\n \nBefore or after exercising?\n \nHe kind of slaps his face and tries not to make odd squealing noises as he texts back.\n \n\nTo Derek (2:46 PM):\n\n \nDuring?\n \n\nFrom Derek (2:48 PM): \n\n \nWhen can I see you again.\n \nStiles does make weird noises this time that make Scott poke his head out of his room. Stiles loves that Derek sometimes refuses to punctuate the way he \"should\" because he can sort of imagine him saying things.\n \n\nTo Derek (2:49 PM):\n\n \nMy roommate’s out tonight with his girlfriend. Want to come over?\n \n\nFrom Derek (2:49 PM):\n\n \nText me the address.\n \nHe does, plus what time, and Derek’s only response is:\n \nDon’t make food.  I’ll bring something over.\n \nAnd Stiles melts again.\nDerek arrives with two glass pans covered in foil, one hot and one chilled. There are bright green post-its on top of each one which he shows Stiles. One of the pans is labeled 'The Best Macaroni and Cheese You Will Ever Experience' and the other reads 'Sex in a Pan'.\nStiles grabs Derek's shoulder and kisses him. He pulls away and shakes his head at Derek's self satisfied smirk.  \"Well looks like someone has plans tonight.\"\nDerek simply grins.\nThe macaroni really is amazing, and by the time Stiles has had his fill, he feels awesome.  Slow and lazy and cheesy and he really wants to make out with Derek right now, because apparently good cheese can do that to a person.\nAnd then comes the Sex in a Pan.  Apparently it’s a recipe Derek found online and made his own changes to.  It’s basically a cake with pudding with cream cheese and everything delicious and Derek pushes him up against the kitchen counter and feeds him a bite.\nStiles moans.\nDerek grins and it's a little bit predatory and a lot sexy. They work through a bit more of the dessert before they get way too distracted by the kissing. He could lead Derek to the couch, it's closer, but he really, really wants Derek in his bed. It's a tough choice and he wants to ask but that would mean pulling away and he really can't make himself just yet. He pulls Derek close because communication, as he's quickly learning, is so much more than words.\nDerek lifts him up and Stiles laughs into his mouth as he lands on the counter, his legs wrapped around Derek’s waist.  Derek kisses him like he can’t get enough, like he wants to savor Stiles forever, and that’s exactly what Stiles wants too.\nHe squirms down off the counter after a moment and grabs Derek’s hand, tugging him towards the bedroom.  Derek is the one who presses him against the door to close it when they get there.\nHe loves the way Derek's eyes stay on his, the way they dart back when he inevitably gets distracted kissing his neck or tugging his shirt off. He loves it because Derek is telling him something with every glance. Something like, Is this okay?, and, I want you. So Stiles nods, a lot. He pulls Derek onto the bed and then starts shoving uselessly at his shirt, blushing when Derek laughs and pulls it off himself.\nHis laugh is so…him.  He loves it because it’s deep and throaty and unabashed and he kisses Stiles with a smile on his face.  And it’s wonderful.  They undress frantically, never separating their mouths, and it’s not until they’re naked that Stiles wonders—what do they do now?  He hasn’t learned the signs for “Do you want a blowjob?” and he doesn’t think he wants to see if he can mime it.\nHe can do this though, he just needs to relax. Derek pulls his chin up and looks at him with clear concern. Stiles shakes his head.  \"I'm alright.\" Derek's lips quirk in a smile and then he runs his hand slowly over Stiles' chest and then down trailing over his thigh in a careful tease.\nHe pushes Derek onto his back, kissing him deeply, and then squirming his way down his body, kissing his neck and his chest and his stomach, and he can hear Derek’s soft sighs and moans, involuntary things but they let Stiles know that he’s doing a good job.  And he’s very, very thankful.\nSucking Derek into his mouth is heady.  It makes him harder than he’s ever been in his life, makes his entire body tingle, and Derek shoves his fingers through Stiles’ hair—that reminds him, maybe he should get a haircut—and holds on carefully while Stiles does his thing.\nEventually, Derek starts making wordless, desperate noises and Stiles looks up.\nDerek’s shaking his head.\nStiles pulls away and licks his lips slowly, leaning forward to lays his hand over Derek's cheek until he opens his eyes.  \"Are you going to come?\"\nDerek breathes deep and nods before pushing himself up and kissing Stiles deep and hungry like he wants to taste himself and Stiles and the combination of them together. He shifts and pulls Stiles under him, crawling between his legs. He moves his hands over Stiles' ass and raises an eyebrow in question. Stiles can't nod quickly enough. \n\"Yes. Yeah. Yes.\"\nThey do it face-to-face, which is something Stiles never would have considered a luxury, but he can’t remember the last time he got laid, let alone the last time the person he was with actually cared enough to want to kiss him during.  And so when he’s all prepped and panting, feeling like he’s going to come any second, Derek kissing him as he slides inside is suddenly the greatest thing in the world.\nStiles’ head falls back against the pillows, his shoulders arching up and his mouth falling open.  It’s good.  It’s so good.  He’s hot and hard and perfect and he’s trembling, just a little bit, so Stiles wraps his arms around his shoulders and nods.  “It’s okay,” he says.  “Move.”\nStiles gasps and moans and shouts out because he can't help it and he shivers when Derek puts his hand between them pressed up to his chest. He can feel the way his chest moves and vibrates when he makes sounds, he can feel it because Derek is showing him that he can feel it too.\nThey’re together for a long time, moving and grinding and moaning, and Stiles feels like he’s going to pass out any second—or at least come his brains out.  Derek is fucking him nice and slow, relishing in it, and Stiles…  Stiles is rolling with it.  He moves with everything Derek does, kisses him, arches up against him, laughs and moans and feels fantastic.  And then Derek speeds up, grunts into his mouth, and Stiles feels a little lightheaded.  Good thing he ate so much food.\nStiles knows Derek is about to come because his thrusts turn deep and sharp and Derek leans into him and pulls him closer. Stiles can hear his ragged breathing at his ear and feel the way his body tensing above and then he can hear his name. Derek saying his name, moaned and broken and raw, whispered in his ear, probably unintentional but perfect.\nHe reaches down to jerk himself off, feeling strung out with his name on Derek’s lips, but before he gets the chance to come, Derek is pulling out of him and sliding down, going to suck his cock into his mouth.  He comes down Derek’s throat, shaking.\nDerek crawls back up his body, then, and kisses him even though he’s still come-dumb.\nStiles has a hundred thousand words drumming against his skull. He wants to tell him it was amazing, the best in his whole life, that he never wants to get up, that he loves the way Derek says his name, and that he might be in love with him. But they're just words.  They aren't, when it comes down to it, all that important. So he pulls Derek up even though he's heavy and lazy and he kisses him nice and slow and promising.\nHe looks terribly embarrassed.\n“Don’t be shy now,” Stiles laughs.  “You’re wonderful.”  He kisses Derek again and again, wrapping his arms around him.  “Will you stay?” he asks.\nDerek blinks at him.\nStiles repeats, “Will you stay the night?”\nDerek nods.\n \nMorning After Cupcakes\n \nKeep yourself busy while they sleep off your skills and make your lover some breakfast like a man (yeah you too, ladies, like MEN). By which I mean, quick, easy, and involving bacon. These are great because it takes you like 20 minutes, half an hour if you're a slowpoke, so just about enough time for your side of the bed to get cold and smoke them out of the room, lured by the smell of eggs, bacon, and if you want them to love you forever, coffee (link to some of my better coffee experiments here).\n \nINGREDIENTS\n6 slices of bacon\n6 slices of bread\nShredded cheese\n6 eggs\nSalt and pepper\n \nDIRECTIONS\nPreheat the oven to 400° F. Grease 6 wells of a muffin pan with butter. In a frying pan, cook bacon about 3-5 minutes, until partially cooked but not completely crispy. Transfer to a paper towel-lined plate. Cut out rounds of bread (I used a 3.5-inch round cookie cutter, but a drinking glass would be fine.) Press the bread rounds into the greased muffin wells. Curl a piece of bacon around the periphery of each piece of bread, positioning it between the bread and the muffin tin to help keep it in position. Sprinkle a small amount of shredded cheese in the center of each piece of bread. One at a time, crack an egg, removing about half of the white, and dropping the remaining white and yolk over each piece of bread, being careful not to break the yolks. Once all the bread pieces have been topped with eggs, bake until eggs are cooked through to your liking (about 6-10 minutes) and bacon is crispy. Run a knife around the edge of each muffin well and pop the egg cups out.\n \nYou can serve them in bed as well, so you can refuel for round two.\n \nStiles rolls over to the smell of bacon.\nHe laughs to himself and curls up in the blankets, grinning into the pillow.\n“I had sex with Derek Hale,” he whispers to himself.\nHe pulls on a pair of sweats from his half-open drawer—he hopes that means that Derek borrowed a pair, too, because it would be ridiculously hot to see him in his clothes—and walks out to the kitchen, scratching at his hair.\nDerek is standing at the counter, reading the newspaper.\nHe looks up when Stiles walks in.\nHe smiles and waves for him to come closer and Stiles loves the feeling of being held by Derek more than anything right now, except maybe the smell of whatever Derek made this morning. He bites into it and moans softly, actually finishes chewing before he grabs Derek face.  \"You are actually perfect.\"\nDerek rolls his eyes and grabs a pen, scribbling on the margin of the newspaper. I have to meet with some friends today, do you want to come with?\nStiles takes another bite of the cheesy monstrosity and shrugs.  “I don’t have anything else to do—but I don’t want to intrude.”\nDerek shakes his head and yanks him into a kiss.\nStiles takes that as a good thing.\nThey shower together and get a little distracted so that by the time they actually have to go meet Derek’s friends, they’re starving again.\nThe blonde one will be Erica, Derek writes down on a scrap piece of paper while Stiles is driving them to the restaurant.  And her friend is Boyd. He can hear you, so you won’t be too bored.\n“Oh, shut up,” Stiles says with a smirk.  “I’m not bored with you and you know it.”\nDerek scribbles that he won't be making out with Erica and then winks at him.\nIt's a cute little cafe that Stiles remembers Derek blogging about a few months ago and it looks like Derek's friends are already there. He introduces himself and shakes their hands and tries not to feel awkward as Erica watches him with measured calculated looks. Like she's waiting for him to do something. Boyd seems a lot more laid back and falls into easy conversation with Derek. Stiles marvels at how his hands and his spoken words seem perfectly timed.\nThen Erica sits up straight and taps Derek’s shoulder, signing something to him.\nDerek shakes his head and signs something back, to which Erica arches an eyebrow, obviously judging him.\n“What are they saying?” he asks Boyd.\nThe man, who’s literally tall, dark, and handsome, clears his throat a bit awkwardly.  “Erica wants to know why you’re not signing.  Derek just told her you don’t know how.”\n“Oh.”  He feels tense under Erica’s harsh gaze, so he signs something simple.  Hi, I’m Stiles.  I’m learning ASL.\nShe looks vastly unimpressed.  But nothing is worse than when Derek writes something down for him and slides it over.  It’s very nice, the little note saying not to worry and that he absolutely has to try the mahi-mahi, but it just makes Erica more upset.\nBoyd sucks in a quick breath.  “Uh, now she’s insulting him,” he relays to Stiles.\nStiles blinks and actually slides back a bit at how aggressive they both suddenly look. It's actually just as alarming as watching two people scream at each other which seems to be just what they're doing. Boyd lays a hand on Erica's shoulder and she actually elbows him, continuing to sign what Stiles guesses is abuse at Derek. Boyd gets up and pulls Stiles up by the arm.  “Walk with me.\"\nStiles keeps looking over his shoulder at the other two who are still at each other's throats in the table.  \"What the hell is going on?\"\n\"Look, it isn't your fault. Sometimes people in the Deaf community can get upset when they feel that they or someone else is pandering to a Hearing person.”  He sighs.  “See, for a long time deaf people have had to bend over backwards to fit into the auditory world like they were born wrong or something. But they weren't, they're proud of who they are. They're proud of their language and their culture and Derek making efforts for you, while it's sweet and by the way he's totally head over heels for you, it rubs Erica the wrong way. That's who she is.\"\nStiles nods slowly.  “Okay, I…  I understand that.  And I’m sorry, but I—I’m learning.”\n“And she’ll come to appreciate that later, but right now she thinks Derek’s given up.”  He shrugs.  “It’s how she is.”\nStiles cocks his head.  “So, how do you—you’re not—you can hear me.”\nBoyd nods, smiling.  “My younger brother is deaf.  I learned it growing up so that we could communicate.  Then I met Erica and…”  He trails off with an amused look on his face.\n“You love her,” Stiles guesses.  He doesn’t think it’s that much of a stretch.\nBoyd looks sheepish.  “We’re not like that.”\n“But you want to be.”\nBoyd looks back at the restaurant and they can both see Erica and Derek through the window.  They seem to have calmed down a bit by now, just barely. \n“She’s my best friend,” Boyd says.  “And I love her, but she doesn’t see me like that.”\n“I got lucky, I guess,” Stiles sighs.  “I mean, you wouldn’t exactly expect Derek Hale to be into me, but…  That’s just how it worked out.”\n“Do you love him?”\nStiles blushes slightly.  “Uh, you know…  That’s a really good question.”\nBoyd smiles at him like he knows.  \"Erica used to have a thing for him, and, you know, I had known all about it, but she's past it now. She's kinda like a loving Jewish mother.  She wishes Derek would just find a nice deaf boy or girl and settle down.\"\nStiles laughs, watching Derek through the window until apparently the other man feels eyes on him and glances over.  He gives a slight wave, smiling, but Erica smacks his hand down.\nBoyd sighs.  “Maybe we should go back in.”\n“Do you really think she doesn’t like me dating Derek because I’m not deaf?”\n“I think she doesn’t like the way Derek’s making things easy on you—but the fact that you’re learning ASL…”  Boyd shrugs.  “She’ll like you more now, I promise.”\nDerek looks disgruntled again when they walk back in.  He signs something viciously sharp at Erica and Boyd chuckles.\n“He’s telling her to be nice,” he informs Stiles.  “Keep him.  You have him trained.”\nThey eat, Boyd and Stiles ordering for Erica and Derek—which Erica apparently accepts because she doesn’t fight Boyd when he decides to order for her, and only looks mildly affronted when Derek points to something that Stiles reads out for him.\n“Erica wants to know what you do for a living,” Boyd says as Erica signs.  She looks bored.\nStiles glances at Derek just for a second, who nods, and then Stiles faces Erica.\n“I’m going to Berkeley, actually.  But I substitute teach sometimes when the opportunity arises, like with SAT dates and stuff, and I might be teaching a summer school class once June rolls around this year.”\nErica purses her lips, signs again.\n“You want to be a teacher?” Boyd translates.\nStiles nods, \"I do. It's like, the only job I think I could ever do.\"\nErica signs again and Boyd nods. \"So you like kids?\"\nStiles smiles.  \"Yeah, I mean, they're bratty and crazy and kind of like the best people in the world, you know? They've got such amazing ideas in their heads and we can never get that back, not unless we try to see things the way they do. Like one of my professors once told me you can live in a thousand different worlds if you pay attention to how other people see things. I think kids are really great at that.\"\nHe hadn't realized he'd signed a few words here and there, but he’s glad to know that he’s getting in the habit.\nErica sits up straight.  She signs something and Boyd snickers while Derek looks affronted.\n“She says your signing needs some work and that if you spent more time having actual conversations with Derek instead of screwing around, you’d know more by now.”\nStiles almost wants to be offended, but he can kind of see how she’s loosening up, plus he’d made sure to learn the worst words first, so he knows that Erica said “fuck” in there somewhere and Boyd’s just leaving it out.  But he’ll accept it.\nHe’s still smiling a little bit when he nods.  “Agreed,” he says.\nDerek kicks him under the table.\nAfterwards, when they're back in Derek's apartment, Stiles tugs on his arm and sighs.  \"Are a lot of your friends not going to like me because I hear?\"\nDerek makes a face and shakes his head before he grabs a piece of paper from his printer.  For the first time, Stiles feels really bad about it.\n\nErica isn't the norm.  Yeah, we're proud of who we are and we've got a community and we don't actually enjoy speaking most of the time, but not everyone is like her and she'll get over it. Besides, even if they didn't like you I wouldn't care.\n\nStiles closes his eyes and leans into him, bending his neck so he can squirm his eyes under Derek’s jaw.  He stays there a moment, letting Derek hug him, before he leans back and asks, “Why do you like me?”\nDerek rolls his eyes.\n“Hey, I mean it.  I just—you have to know that you’re way too good for me.”\nDerek takes the paper and scribbles quickly that he doesn't know that because he isn't and does Stiles want a list of the things Derek loves about him?\nThe word love raises his pulse and he bites his lip but nods.\nDerek rolls his eyes and lifts his hands. So Stiles guesses it's time to practice his ASL. Derek raises one finger to his forehead and moves it like a salute.\n\"I'm smart?\"\nDerek smiles and nods, then goes on to scratch at his nose with two fingers. That one takes Stiles a second.\n\"I'm funny.\"\nHe's rewarded with a kiss for his cleverness. Derek looks at his eyes for what feels like forever and not enough time and then kisses him one more time before fanning his fingers in a circular motion over his face. Stiles scoffs and shoves at his shoulder.  \"Beautiful?\"\nDerek nods and kisses his cheek but Stiles pushes him back again.\n\"I am not. You just want to get into my pants again.\"\nHe leans in to kiss Derek and gets swept up and practically manhandled into the bedroom where he very happily jumps in bed.\n“Thank you,” he says, signing along with the spoken words.  “You’re beautiful, too.”\nDerek grins and tackles him against the pillows, eyes bright and mischievous.\nStiles has never felt so happy in his life.\nThey make love this time, slow and careful and Stiles rides him, keeping their hands clenched together.  Stiles can’t keep his mouth off of Derek’s for more than a minute—it’s just too good, his kisses and his breath and the way his hands spread out over his ribs, then his hips, holding him as he lifts up and falls back down.\nAnd it’s wonderful.\nThey shower together again and curl up in front of the TV, subtitles on in case Derek cares, but he’s already lying there with his eyes closed, so Stiles figures he’s about to conk out any second, and Stiles is just about to join him when his phone starts buzzing on the coffee table.\n“’lo?” he mutters, squirming back into Derek’s arms.\n“Dude, where the hell are you?  It’s poker night and you’re in charge of the pizza.”\nStiles closes his eyes tightly.  “Oh, shit, dude, I totally forgot.  I—I’m over at Derek’s.”\n“…and you’re staying there?”\n“Uh, yeah.”\nScott laughs triumphantly.  “Yes!  Way to go, dude, finally ended the dry spell.”\n“Shut up, douchebag.”\n“I’m just saying, man, it’s been a while.”  He sighs.  “Alright, good luck and congrats and all that junk, bring him by the apartment tomorrow and let me give him beer, I gotta order food for the guys.  Talk to you tomorrow?”\n“Sure.”\nStiles sets the phone down with something heavy weighing on his heart.  When he turns in Derek’s arms, the other man is blinking at him calmly.\n“Do you want to meet my friend tomorrow?”\nDerek cocks his head and then nods slightly.  He signs S, C, O, and two Ts, and Stiles laughs, nodding.\n“That’s the one.”\nHe nods again and scoops Stiles closer, nuzzling at him, and that’s how they fall asleep five minutes later.\n \nStiles is still grinning like an idiot at the closed door five whole minutes after Derek has left.\n\"Dude. Stiles, snap out of it,\" Scott says, tugging at his arm.\n\"Oh, shut up, will you? You kiss your phone after Allison hangs up. After, Scott.\"\nScott looks like he's thinking over his words as he shoves Stiles into taking a seat.  \"I get it that you like him a lot and he's super hot and everything but…doesn't it get really awkward?\"\nStiles frowns at him.  “Like how?”\n“Well, you can’t go out to movies or plays or anything—what do you guys do?”\n“He cooks for me.  And we talk.  It’s a thing human beings do, Scott.  They use their words.”  He shrugs.  “In this case, he just makes words with his hands.”  He grins evilly, arching a ridiculous eyebrow and waggling it.  “In more ways than one.”\n“Dude,” Scott laughs, “c’mon, you know what I mean.  You don’t know sign language, not as well as he does, and how are you supposed to get his attention if you need him?  How do you call him?”\n\"You're so ridiculous. I walk to him or I text him if he's too far away. Which he usually isn't. Why are you so freaked out about this?\"\n\"I just I mean it's hard to wrap my head around how you can have a real relationship like that.\"\nStiles frowns at him again and Scott looks down at his feet.  \"Scott, if Allison were really French you'd have the same issues, you realize that right? He's not sick or impaired, he's just living in a world that works in a different language. One he understands, by the way.\"\n\"I'm sorry, I'm not trying to be douchebag, I guess I just don't get how he works.\"\nStiles takes a second to think about it.  \"It's all about translations, okay? I mean, He can't use his ears, so the stuff we get from hearing he gets other ways. Like music, you know how music is awesome, but he doesn't. And sure he can feel vibrations but it doesn't do it for him, so he has to get that sort of artistic awesomeness from elsewhere. Like food. Food is probably like music to him. All the different flavors like different notes.\"\n“You really like him, don’t you?” Scott asks, but it doesn’t sound like a question.\nStill, Stiles nods.  “Yeah, I do.”\n“He’s old.”\nStiles laughs, shoving at Scott’s shoulder.  “He is not!  We’re just, like, six years apart.  So, shut up.”\nScott’s smiling when he looks up and meets Stiles’ eyes.  “I’m happy for you, dude, honestly.  And I want you to be happy.”\n“I am.”\n“So then…”  Scott shrugs.  “Then enjoy it.”\nStiles grabs a pillow and hugs it.  “I plan to.”\n \nWhen Stiles gets to Derek's apartment on a bright morning a few weeks later, he's eating a bowl of cereal. Just. Cereal.\nHe drops his bag and takes a seat across from him, snatching his hand and stroking his thumb over it until he looks up.  \"What's wrong?\"\nDerek shakes his head and continues to poke at his bland bowl of corn flakes.\n\"Derek,\" Stiles grabs his chin and raises his eyebrows.  “What is it?\"\nDerek's eyes look up like he's praying for patience and he sighs, pulling the whiteboard close to him.  My family is coming. My whole family.\n“Whole” is underlined.\nStiles blinks.  “How many?” he asks.\nHe holds up both hands, fingers spread apart, then drops one hand and holds up three fingers.\nThirteen.  Thirteen people.\n“Okay,” Stiles says slowly.  “Okay, so…  Are you gonna cook or do you need me out of your space or what?”\nDerek shakes his head immediately, grabbing at his hands desperately.\n\"I'm here, whatever you need help with. How are you even going to fit thirteen people and you and me in here?\"\nDerek sighs and leans back shaking his head because nope, he has no idea either.\n“Well, your apartment’s not that small,” Stiles amends, “and we just have to make a ton of food, right?  We can do that.  We’re awesome at that—well, you’re awesome at that and mostly I just stand there in awe.”\nSmiling, Derek pushes himself up and leans across the counter to kiss him before signing, Thank you.\nStiles grins and signs, No problem.\nSpanish omelets are fairly simple and freaking amazing. They make ten of them, ready to be stuck in the oven for reheating as soon as everyone gets there that afternoon. Stiles really had never thought to ask about Derek's family and now feels really stupid about it, especially because while they're busy cooking he's not about to ask Derek to stop and write him a play by play about his family history.\nSo Stiles just does whatever Derek needs him to do, then watches the door while Derek’s in the shower.  He’s almost tempted to follow him in and try to make him relax, but he thinks that might just make things worse.  He doesn’t want Derek to be too distracted that he ends up mad at Stiles later.\nAnd Derek, for all of his stress, is still managing to be wonderful.  Because when he’s dressed and they probably only have a few minutes of alone time left, he still manages to scrawl, “They’re going to love you,” on the whiteboard.\n“I hope so,” Stiles sighs.\nDerek leans in to kiss him when his eyes snap up. Stiles turns and sees the bright LED light flashing in the kitchen, which he knows is the silent doorbell. Derek closes his eyes, takes a deep breath, and kisses him before getting the door.\nA tall, slender woman with long, dark hair is the first one in the door and she immediately hugs Derek, grinning at him.  She signs something—Stiles recognizes it as, Hello, I missed you, you look well, and then a few quick signs that he’s not familiar with—and kisses his cheek.  But before he can respond, the woman looks over his shoulder and sees Stiles.\nShe pulls away and grins.  \"Oh, he is adorable!\" Her hands keep moving even as she walks away from Derek as she talks.\nBehind her the people start filling in. There is an older couple hugging Derek who Stiles can only assume are his parents, another couple who look just a bit older than Derek signing to each other rapidly, two teenagers who look remarkably like each other although one seems to be a boy and the other seems to be a girl and then kiddies. Stiles grins, he loves kiddies.\n“Derek cannot stop talking about you,” the woman sighs at Stiles, smiling.  “I’m Laura, his sister.”\n“Stiles,” he introduces himself, shaking her hand.  “It’s very nice to meet you.”\n“And you!  Jesus, I feel like I already know you so well—but Derek did not tell me how cute you were.”\nStiles laughs, flushing.\n“C’mon,” Laura says, tugging on his arm, “I’ll introduce you to everyone.”\nShe starts with their parents.  Their mother hugs him, puts a hand on his cheek and tells him that she could just kill Derek for not telling them about him sooner, and their father shakes his hand firmly, smiling.  Then there’s the uncle, handsome and broad-shouldered, who introduces himself as Peter and gives Stiles a look like he knows exactly what he’s thinking.\nThey all sign like speed-racers, but it’s clear to Stiles that it’s only for Derek’s benefit.  He’s the only one of them who can’t hear.\nStiles is stuck in a small crowd of people he doesn’t know and he’s trying to find Derek again when he feels someone tugging on the bottom of his jeans.\n“Who are you?” the child asks, his face twisting into a frown.  He has floppy brown hair and green eyes like Derek’s.  He’s absolutely adorable.\nStiles smiles because not on is he adorable, his tiny little hands sign along with his spoken words too. Even though his own signing is clumsy he thinks the kid won't judge him too hard.  \"Hey. I'm Stiles, who are you?\"\nThe little boy sticks out his tongue as he signs out a few letters and looks proud of himself.  \"I'm Ethan.\"\nStiles kneels down next to the kid, signing as he speaks.  “How old are you?”\nEthan holds up four fingers.\n“Wow, that’s awesome.”\n“My mommy’s teaching me sign language because Uncle Derek can’t hear,” Ethan explains, but his hands don’t move.  “Do you know Uncle Derek?”\nStiles smiles, nodding.  “Yeah, I do.”\n“My mommy says I can practice talking to him.”\n“I’m sure you’re gonna be great.”\n\"Are you learning too?\"\nStiles nods.  \"Yeah, it's slow going but I learn a little more every day. Maybe we can learn together.\"\nThe boy grins.  \"Cool. My cousins won't help me. They're fourteen.\"\nStiles feels a shot of pain for the boy.  He doesn’t seem to have a lot of relatives his age.  There’s a man standing with Laura who looks like her husband, but he’s holding a child who can’t be more than two years old, if that.  And the next youngest, after Ethan, looks like she’s probably eleven, and she’s too busy trying to make the fourteen-year-olds pay attention to her to care about him.\n“Well, then,” Stiles decides, “you and I can help each other out.”\nThey sit in the kitchen, on the floor in the corner behind the counter, and sign at each other.  Stiles teaches Ethan a few things, Ethan teaches Stiles a few things, and by the time Ethan’s mother comes to find him, they’re in the middle of signing a nursery rhyme that Ethan learned.\n“Mommy!” the boy shouts, jumping up.  The woman who grabs him looks like a young Laura, except with lighter hair, more like her father than her mother.  She can’t be older than Stiles, at least not by much, and Stiles wonders how that happened, that the youngest members of the Hale family (not including the fourteen-year-olds) procreated before Derek and Laura.\nAnd Derek seems to be the only one past drinking age who’s not married\n\"Hi,\" the woman smiles, \"you must be Stiles. I'm Bridget.\"\nStiles shakes her free hand.  “Your son is brilliant. Taught me a lot more than YouTube does in a day.\"\nShe pats his shoulder and even though she's about his age it feels maternal.  \"You'll be fluent in no time.”\nHe grins.  “I hope so.”\nBefore she can add anything else, Derek walks into the kitchen.\nHe signs something, looking exasperated.\nBridget laughs.  “I’m not going to interrogate the boy, Derek.  Stiles was just playing with Ethan.”\nEthan looks shy and sticks his tongue out of the corner of his mouth as he signs, Hello, uncle, at Derek.\nDerek smiles like the sun just rose and signs, Hello, Ethan, back. The boy claps and Derek plucks him out of his mother's arms, raising him up in the air and nuzzling the boy's stomach making him bubble up in giggles.\nBridget laughs, turning to Stiles.  “Derek loves the little ones, but he’s still very closed off, you know.  Sometimes it harder for them to understand the complexities.”\n“Well, I think Ethan’s understanding just fine,” Stiles says with a smile on his face, watching as Derek sets the boy on the counter and signs slowly at him.\nThey sit around the table and it's loud, really loud. They sign at each other but only one at a time when directing themselves to Derek. It seems that no one in the family can help signing while they speak. Sometimes they get Derek's attention by throwing rolls of bread at him and Stiles tries not to look startled because he's pretty sure it would be offensive coming from anyone but family. All things considered Derek throws the roll way harder on the way back and he's smiling.\n\"So, Derek,\" Peter starts once he's got Derek's attention.  “Finally ready to leave your bachelor ways and settle down? When's the wedding?\"\nStiles doesn’t know why he laughs.  Maybe it’s because he assumes Peter is joking—and he had been, he’s sure, because that goofy smile on his face is nothing if not amused—but either way, Derek can still see him, and so when Derek’s eyes turn on him, he feels waves of guilt.\n“Well, I think it’s a little soon for that,” Stiles says sheepishly.\n“Ah, true,” Peter says, and he looks directly at Derek as he signs along with his words, “wouldn’t want another Kate fiasco, huh?”\n\"Peter,\" Derek's mom hisses at him. He can see Laura bang her head on the table and the twins perk up at the sound of drama.\nStiles isn't exactly sure what to do because Derek isn't looking at anyone and when he reaches over to tap on his shoulder he flinches.\nDerek's dad is berating Peter when Derek finally looks up and Stiles recognizes the signs as 'move on' and 'now'.\nSo they do, and even though they eat a lot of good food and talk about a lot of different things, Stiles can’t shake the terrible feeling in his stomach, and Derek’s been forcing a smile since Peter opened his mouth.\nFinally, when everyone’s done eating, Stiles grabs Derek and takes him into the bedroom.\nTalk to me, he signs.\nDerek shakes his head.  Peter’s being stupid, it’s nothing.\nBut Stiles knows that’s not true, so he grabs Derek’s face in his hands and kisses him, kisses him deep and longing, kisses him so that he knows he’s loved.\nDerek ends it after a moment and signs something that Stiles doesn’t recognize.  When Stiles stares back blankly, he clenches his fists and grabs the notepad he keeps at the side of the bed.\nDo you not see a future with me?  Be honest.\nStiles frowns and grabs Derek's face.  \"Of course I do. Of course I do, Derek. I was just caught off guard.\"\nDerek closes his eyes and takes a deep breath. Then he turns around and leaves the bedroom. Stiles feels like the floor has been taken from under him. He inhales through his nose and exhales through his mouth and then goes out to say goodbye to everyone. They all promise to meet the next morning and go to the organic market together, make a big messy lunch. Derek smiles and nods and gets them out the door in as little time as possible.\nWhen they’re alone, Stiles knows he has to ask.\n“Who’s Kate?”  He signs it too, his hands caught up.\nDerek bites the inside of his cheek, runs a hand through his hair.  I don’t want to talk about her, he signs back, and starts to head towards the kitchen to clean up.\nStiles watches him clear things away and wraps his arms around his waist when he starts on the dishes. He leans his forehead between Derek's tense shoulders but they don't relax.\nHe waits for Derek to finish, waits for Derek to dry off his hands and turn around, and then Stiles signs, I’m sorry.\nDerek shakes his head.\nSo Stiles repeats the sign and kisses him, holding onto his shirt.  “Please,” he whispers.  “Talk to me.”\nDerek shakes his head again and heads back into the bedroom, pulling off his shirt and crawling into bed.  Stiles sighs and pulls his shoes off, climbing in behind him. It's more difficult than he would have imagined, because he would whisper and blab until he was listened to, but not with Derek. If Derek doesn't want to listen he doesn't have to, never does. All he has to do is turn his back.\nSo Stiles crawls on top of him and forces him onto his back, straddling him.\nI know you don’t want to talk, Stiles signs, but I also know you’re hurting.\nDerek blinks.  Peter is an idiot, he signs.\nWe don’t have to talk about Kate.  He opens his mouth when he doesn’t know how to properly sign the next part.  “Just tell me how to make you feel better.”\nDerek looks almost angry and he sits up, knocking Stiles on his back. He starts signing quickly, way too quickly for Stiles and he knows it. Stiles frowns up at him.  \"Would you slow down?\"\nDerek stops altogether and points at the door.  \"Go home, Stiles.\"\nStiles stops at the sound of Derek’s voice, broken and slow and frustrated.  And Stiles doesn’t ever want Derek to have to feel that way, to have to feel like he needs to be uncomfortable in order to make Stiles understand.\nSo Stiles stands up off the bed and comes around to where Derek is sitting at the foot of it.  He grabs Derek’s outstretched hand and fixes their fingers together.\nDerek yanks his hand away.\nNow, he signs, and Stiles thinks there would be an exclamation point at the end if he were writing.\nSo Stiles gets angry, sets his shoulders and signs, No.\nNo, I won’t leave.  Not until you calm down.  I hate seeing you so upset.\nIt’s my house, Derek responds, and points to the door again.\n\nYes, and you gave me a key.\n\nDerek scoffs, looking down at his lap.  Stiles grabs onto his chin, though, and forces him to look up, but before he can say anything else, Derek shoves past him.  He pulls on a sweatshirt without tugging on a shirt and just heads for the door.\nHe slams it behind him.\nStiles calls Scott. He doesn't know what else to do.\n\"So his uncle brought up some chick and he got moody? That sounds like an ex to me.\"\nStiles groans.  “I know.\"  He sighs.  “And he just—he won’t talk to me and he’s angry and he just stormed out of his own freaking apartment.  He’s worse than moody, Scott.  He’s just pissed.”\n“Well, if he doesn’t want to talk about his ex, you can’t really make him, dude.”\n“I’m aware.”\n“I know you want to help but maybe you should just…calm down.  And wait for him to come back.”\nAnd so that’s what Stiles does.  But it isn’t the only thing Stiles does.\n \nDessert: The Forgive-Me-Please Edition\n \nLet’s be honest here, relationships aren’t easy.  And if they are, it’s because you’re 21 and having so much sex that there’s no room for any conversations beyond, “Did you restock on condoms?”  So, when you’re in the doghouse, this is what you do:\nYou make them chocolate.\nBut I’m not just talking chocolate, no.  I’m talking chocolate-dipped stuff.\n(Feel free to use the melted chocolate later when you’re in the bedroom, but make sure it’s cooled down by then, otherwise you’ll have way more to apologize for later.)\n \nNow, the easiest way to do this is to have a fondue dish, but if you’re lacking one, you can also just put a bowl of cut up chocolate over a pot of boiling water.  Works a little slower, but you achieve the same result.\nThen, use fruit, cakes, and peanut butter squares (honestly, they’re delicious, try to find them in your local health-food store), dip them with whatever you have, like sticks for marshmallows or even chopsticks.  It all tastes good in the end.\n \nHe sets the chocolate covered bits on a large platter and things about maybe spelling something out but instead he places them in a circle and leaves a note inside it. He keeps it simple.\n\nI don't know who Kate was or what she did. I don't know what you think about me right now. I just know I love you.\n\nHe leaves it out in the countertop and goes to sleep on his side of Derek's bed.\n \nWhen Stiles wakes up in the morning, Derek’s not in bed with him.\nAnd his side of the bed is cold.\nHe wants to roll over and go back to sleep, wants to curl up into a ball and cry, but he just doesn’t know how to do either of those right now.  Because it hurts.\nHe wanders out into the living room.  He sees Derek’s sneakers by the door and his sweatshirt flung over the couch.  And then, in the kitchen, there’s Derek, leaning against the counter with Stiles’ note in his hand.\nWhen Derek looks up Stiles asks, “Did you just get home?”\nDerek blinks.  Nods.\nStiles licks his lips.  \"Where did you sleep?\"\nDerek spells out Erica's name and Stiles feels a slight pang of silly jealousy.  \"Oh.\"\nDerek lifts the note and waves it slightly and Stiles blushes.\n“Wow, okay, so maybe I shouldn’t have written it down in a note first, huh?”\nDerek looks at it and shrugs before signing, I think it’s romantic.\nStiles smiles softly and signs as he speaks, “I made chocolate-covered bacon for Scott once.  He cried a little bit.”\nI like bananas, Derek signs.  But I can see that you know that.\nDerek takes his hand and then makes him sit beside him while he pulls up his laptop. He types because it's quicker.\n \nI met Kate when I was 16, she was one of the speech therapists who wanted some of us at my school to try to speak fluently enough to stop signing. She strung me along for years and I would just do everything she asked. My friends warned me, you know, that I was just her pet project. She'd ignore me when I signed even though she knew what I was saying. She'd never look at me so I had to call out to her. But I loved her. I thought she loved me, too but then when I graduated—from Berkley because she talked me out of going to D.C. to Gallaudet—I asked her to marry me and she just. She just laughed at me. Said what everyone had told me, that I was just a project, that she'd had all these other guys while she was with me and I was just an experiment on motivation. Like if I wanted her to love me badly enough I'd turn away from my community and try to fit in with the rest of the world.\n \nStiles buries his face in Derek’s neck, holding onto shirt.  After a moment, he leans back and signs, Don’t you dare ever change yourself for me.  Do you understand?\nDerek nods.  His eyes are watery.  He lifts up his right hand and bends his ring and forefinger towards the palm.  It’s the sign for I love you.\nStiles mimics the sign and looks at his eyes as he takes Derek's hand and presses it to his heart and says it as well, so that Derek can see and feel and know that Stiles loves him in every way it can be said.\n \n \n \n \nEPILOGUE\n \nThree Years Later\n \n“First day at a real job,” Scott mocks him.  “How will you ever survive?”\nBut that’s exactly the question Stiles is asking himself.  He has no idea what he’s doing at a too-big high school in southern California, but that’s how his life has apparently worked out.\nAnd now he’s joyously stuck.\nDerek, who’s standing by the door, grins at him and reaches forward to straighten his tie.  You look great, he signs.\nI look like a hipster, Stiles signs back.\nDerek laughs and kisses him, signing where Scott can’t see, They're going to love you because you're hot; you know they will.\n“Alright, alright,” Scott sighs heavily, “let’s get this show on the road.  We all have places to be today, and I can’t be stuck in the living room of some fancy apartment with a huge kitchen all day, watching you two communicate.”\nStiles flips him off and goes in for another kiss with Derek.  “Do you understand this sign, Scotty?”\n“I understand that you’re going to be late for your first day.”  Scott grabs his collar and pulls him towards the door, signing at Derek something Stiles had taught him a month ago.  Keep it in your pants.\nNone of his 5th period students are deaf. They're all a really verbal bunch, but when they settle in, they calm down much more quickly than his three previous classes of English Literature. They're anxious too, he's sure, and they're in this class because they're curious or vaguely interested or just think it's easier taking ASL than an “actual” foreign language.\nHe starts by throwing them off the deep end.  Derek thought it'd be funny so he signs, Good afternoon, hope you liked the tater-tots at lunch. He watches them blink at him and laughs.  \"Imagine you're a little kid and that's how everyone tries to tell you things. You see movement but you don't understand anything. That's what deaf people have to deal with especially when they're very young. They see our mouths moving and our faces of expectation. They have to learn how to interpret the way our mouths form the shapes of words. They have to do that because the world is built around people like us, Hearing people. But here, for one period a day, the world will be upside down and you are all going to learn how to fit into their world. Are you ready?\"\nAnd apparently they are.\nHe signs while he talks.\n“Okay, so you’ll each find a syllabus on your desk—I won’t go over it now because you’re all high school kids and you should be able to read it on your own.  In this class, you will learn very quickly that it works just like any other foreign language class.  How many of you took a different language last year?”\nA dozen kids raise their hand.\n“Granted, this is still English so to your standards it might be a little simpler, but you will still have to ask to use the restroom in ASL, as well as other simple things to start off.”  He spreads his arms, smiling.  “So, let’s start with something fun.”\n \nDerek doesn't want to go to the signing. First of all, he lists with his hands, it's such an ironic thing to call it. Second of all, his readers don't know he's deaf and he doesn't want his food to be popular because he's \"different\".\nStiles plays with Derek's tie and props his chin up.  \"So if they tried your food and bought your book because you're ridiculously sexy you wouldn't want any of that either?\"\nDerek kisses him to shut him up.  And then he ends up just a little bit late to the signing, with his tie crooked and his hair messy.\nThere are lots of grinning faces when he walks in with Boyd (who’s agreed to be his translator for the day), lots of women who grin at him and wave, and it’s as if his secret is out: Derek Hale, food blogger extraordinaire, is ridiculously sexy.\nAnd then comes the hard part.\nThere’s a podium next to the table and the woman in charge of the bookstore gets up there to say a few words about Derek and his book before he actually steps up.\nHe doesn’t go to the podium.  He stands behind the table and signs, Hello, I’m Derek, and this is my friend, Boyd.\nHe watches Boyd’s mouth as he says it out loud to the throng of people waiting.\nThirty-three years ago, Derek continues, I was born deaf, and have, shockingly, been born deaf ever since.  He sees a few people chuckle.  This has not, however, done anything to harm my cooking skills.  In fact, it increases my sense of smell particularly well, which is a huge help, just in case I ever burn anything.\nHe licks his lips and looks down the stack of books sitting in front of him.\n\nFinally, after three years of pestering from my boyfriend, this book has come into existence.  And I would love to tell you guys about it and then sign some copies, if that’s something you’re interested in.\n\nHe watches as people nod, smile, and clap, and then he grins at Boyd, who claps him on the back.\nAlmost the entire line is made up of middle aged women and a couple of chuckling college kids. Nearly everyone who comes in front of him and offers up their book is blushing. Stiles would say it was his fault and technically it is, because the full title of the book is All of These Recipes End in Kitchen Sex but the words “Kitchen Sex” are really quite big on the cover.\nHe survives the whole line, up until right towards the very end, where a woman in her mid thirties stops and signs at him, My daughter is deaf, and I just wanted to say thank you for giving me hope that people who can’t hear can fit in and succeed just as well as people who can.\nHe stands up and hugs her.\nWhen Derek gets home he makes spinach grilled cheese and the light on the toaster goes off just as Stiles opens up the door.\nHe goes straight for the plates but Derek catches him around the waist and turns him in for a kiss. Stiles pulls back and asks him about the bookstore. Derek rolls his eyes but let's him know it went well before asking about his classes.\nStiles grins.  \"They keep bugging me about meeting you.\"\nYou need to stop bragging about me, Derek responds.  He shoves the sandwich into Stiles’ hand and leads them towards the table.\n“But I want to,” Stiles laughs.  He sits down across from Derek, signing, They’ve never actually met someone who couldn’t hear.  It would be good practice.  Plus you would make everyone swoon.\nNo more than you do, Derek counters.\nPlenty more than I do, he signs before taking a huge bite.  You're like tall, dark, and beautiful.\nYou mean handsome, Derek corrects.\nNo, I mean beautiful, Stiles signs again with a wink.\nDerek leans across the table and steals away Stiles' plate.  Just for that, he signs, and his hands seem sassy and sarcastic, you don’t get this sandwich, and you definitely don’t get the banana and Nutella ice cream I made last night.\n“Whoa, whoa, whoa.”  Stiles stands up and steps to the other side of the table, dropping onto Derek’s lap.  “Don’t be rash there, babe.  You’re handsome, too, I promise.”\nDerek wraps his arms around his waist and pulls him close; he doesn't sign anything, just looks at Stiles like he's the entire world.  He leans up and kisses the breath right out of Stiles before leaning back and tapping his cheek.  Well you're delicious.\nStiles sticks his tongue out.  \"Pre-orgasmic or post?\"\nDerek tugs him closer and kisses at his collarbone. Both, he signs, all of the above."
}