{
    "id": "6996898",
    "url": "https://archiveofourown.org/works/6996898?view_full_work=true",
    "author": [
        "TheFeistyRogue"
    ],
    "title": "Snapped",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "F/M"
    ],
    "fandoms": [
        "Harry Potter - J. K. Rowling"
    ],
    "relationships": [
        "Hermione Granger & Harry Potter"
    ],
    "characters": [
        "Albus Dumbledore",
        "Harry Potter",
        "Draco Malfoy",
        "Severus Snape",
        "Gilderoy Lockhart",
        "Minerva McGonagall",
        "Lucius Malfoy",
        "Baneofallrodents",
        "Hermione Granger",
        "Ron Weasley",
        "Sirius Black",
        "Peter Pettigrew",
        "George Weasley",
        "Fred Weasley",
        "Voldemort",
        "Remus Lupin",
        "Nagini (Harry Potter)",
        "Ginny Weasley"
    ],
    "additional_tags": [
        "Alternate Universe - Hogwarts",
        "Humour",
        "Crack",
        "But I'll probably try to continue it as a story",
        "Ding",
        "Bullshit detectors",
        "Slytherin Harry",
        "Gryffindor Harry",
        "He's a snake in lion's clothing",
        "Intelligent Harry",
        "Badass Harry",
        "Grey Harry",
        "Lockhart's a prat",
        "So Is Ron",
        "BAMF Hermione Granger",
        "Powerful Harry",
        "Book 2: Harry Potter and the Chamber of Secrets",
        "Romance",
        "Manipulative Dumbledore",
        "Ron Weasley Bashing",
        "Dumbledore Bashing",
        "just a little",
        "ManipulativeOverworkedNegligent!Dumbledore",
        "let's make that a tag",
        "Crazy Dumbledore",
        "Crack Treated Seriously",
        "Good Severus Snape",
        "Alternate Universe - Canon Divergence"
    ],
    "language": "English",
    "series": "Part 1 of Seriously Snapped",
    "published": "2016-05-28",
    "completed": "2017-01-16",
    "words": "19,478",
    "chapters": "13/13",
    "comments": "1,260",
    "kudos": "15,571",
    "bookmarks": "3,226",
    "hits": "335,769",
    "summary": "<p>“Scared Potter?” Malfoy sneered, and Harry snapped. He was done, finished, fed up with playing the innocent little Gryffindor with no common sense and a microscopic amount of intelligence. He rolled his eyes.</p>\n<p>“Why yes Malfoy, I’m terrified, can’t you see me quaking in my boots? You, a second year child armed with a stick is the scariest thing I’ve ever seen. Please, please don’t fatally injure me in front of three hundred witnesses and two teachers with your mean words and nasty smiles. Whatever shall I do?” The entire hall fell silent and Malfoy gaped. Harry smirked. Lockhart looked entirely bemused, and he thought Snape might be holding back a laugh.</p>\n<p>Harry spent his first year hiding his intelligence and playing the role of the Boy Who Lived. However Lockhart and Malfoys' combined presence finally causes him to snap, and chaos ensues from there.</p>",
    "notes": "<p>This is crack story with some plot where Harry is actually intelligent and sassy and spends his life trying to make Snape laugh and/or have an aneurysm.</p>\n<p>I would also like to make it clear that there are only three horcruxes in this version of the story, because I can't be arsed to write about seven, plus find an ethical way to kill Harry off. So:</p>\n<p>Diary - given to Ginny by Lucius Malfoy, Ginny threw into Myrtle's Toilet, Harry found it and sent it to Sirius<br>Locket - hidden in Room of Requirement found by Hogwarts Wards<br>Gaunt Ring/Resurrection Stone - hidden in Gaunt Shack found through Dumbledore's research</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Did you like this? If so, you may also like some of my other crack stories.</p>\n<p><a href=\"https://archiveofourown.org/works/7121026\" rel=\"nofollow\">Insane Lord Mortem</a> - silly DarkLord!Harry</p>\n<p><a href=\"https://archiveofourown.org/works/12052887\" rel=\"nofollow\">Save the World, Get the Girl</a> - James/Lily superhero!AU fluff</p>\n<p><a href=\"https://archiveofourown.org/works/5407409\" rel=\"nofollow\">Temport</a> - TimeTravelling!Luna nonsense</p>",
    "text": "“Scared Potter?” Malfoy sneered, and Harry snapped. He was done, finished, fed up with playing the innocent little Gryffindor with no common sense and a microscopic amount of intelligence. He rolled his eyes.\n“Why yes Malfoy, I’m terrified, can’t you see me quaking in my boots? You, a second year child armed with a stick is the scariest thing I’ve ever seen. Please, please don’t fatally injure me in front of three hundred witnesses and two teachers with your mean words and nasty smiles. Whatever shall I do?” The entire hall fell silent and Malfoy gaped. Harry smirked. Lockhart looked entirely bemused, and he thought Snape might be holding back a laugh.\n“On the count of three, then,” Lockhart said. “One, two, three.”\n“Serpensortia!” Malfoy cried, and a large and certainly venomous snake poured out from his wand. An eastern brown snake, Harry thought.\n“Where am I? Attack!”  it cried, and lunged toward him.\n“Stop,” Harry commanded, deciding to see if he could give Snape an aneurysm. The snake rose to inspect him.\n“A speaker?”\n“Yes. I will provide you with food and warmth, and in return you will not bite me.” The snake uncoiled, then slithered toward him.\n“Agreed.”\n“Don’t worry my boy, I’ll sort it out!” Lockhart cried. He raised his wand.\n“Expelliarmus,” Harry hissed, and snatched Lockhart’s wand out the air. “You really are a fool.” Lockhart looked gobsmacked and he could almost hear Hermione’s gasp of horror. He knelt before the snake and it coiled around his arm and up his body.\n\"Male or female?” he hissed.\n\n“Female. Obviously.”\n\n“Thank you Malfoy. I’ll be keeping her.” Malfoy was gaping. “Expelliarmus,” Harry said again, and received Malfoy’s wand for his trouble. Snape pursed his mouth. Harry threw their wands onto the floor.\n“I win.” He grinned and hopped off the duelling platform.\n“My name’s Harry,\"  he told the snake. “What’s yours? What do you like to eat?”\n“I am Baneofallrodents,” Harry was summarily informed. “I eat rodents.”\n“Harry!” Hermione cried. “How could you disarm and insult a teacher?”\n“Lockhart is an imbecile, not a teacher,” he said with a smirk, and she gaped.\n“Harry! You can’t say that!”\n“I can. I just did.”\nShe pouted.\n“Heya mate! You’re not actually keeping the snake? And why didn’t you tell us you could speak parselmouth?” Ron said.\nHarry rolled his eyes. “I am a parselmouth, and I speak parseltongue. And you never told us that you spoke idiot, yet you manage to prove it every time you open your mouth.”\nAs if to prove him right, Ron frowned, and then gaped as he figured out the insult. “Hey!”\n“Is for horses.” Out the corner of his eye Harry could see Hermione giggling.\n“Huh?”\nHarry sighed. “Don’t you worry your pea sized brain. To the common room?” They strode off. It was rather easy to make way through the crowds with a snake wrapped around him. People seemed to be afraid of it, for some reason.\nHarry was later summoned to the Headmaster’s office, whereupon he was faced with McGonagall, Snape and Dumbledore.\n“Harry, Harry, it’s good to see you. Are you well and keeping up with your studies?”\n“Yes, thank you,” Harry replied, rather suspicious as to why he was there.\n“An excellent defeat of young Draco in duelling club I must say.” Harry kept silent. “And impressive skills subduing the snake. But I’m afraid I must tell you that you cannot keep it.”\n“Her,” Harry interrupted. “She’s female.” Snape’s mouth twitched.\n“Ah yes, very good,” Dumbledore said with a twinkle in his eye. “But my point still stands. She’s not on the list of permitted pets and so I’m afraid she must go.”\n“Ding,” Harry said. Dumbledore fell silent and frowned at him. “That’s my bullshit detector,” Harry explained, and McGonagall gasped. “Ron has a rat, Lee has a tarantula, and therefore I can only conclude that the reason you don’t want me keeping a snake is because it’s a snake, and thus has ominous connotations with Slytherin and everything ‘evil.” Snape’s mouth twitched again.\n“Frankly, I suspect that snakes once were on the permitted pets list. A cat for Gryffindors, an owl for Ravenclaws and a toad for Hufflepuffs, and therefore snakes for Slytherin.” Dumbledore blinked.\n“Five points from Gryffindor for your cheek, Potter,” Snape snapped. Harry rather felt that it was because the man was jealous that he couldn’t call Dumbledore out on his bullshit, being employed by him and all.\n“Be that as it may, your snake is an Eastern Brown Snake, one of the most venomous in the world, and potentially a danger to students.”\n“Ding,” Harry said again, once more shocking the adults judging by their shocked expressions (gasp!). “Lee’s tarantula is venomous, and I haven’t heard a word of complaint against it. And Lee can’t even communicate with it. Baneofallrodents has promised not to bite anyone who’s not trying to kill me.”\nDumbledore smiled. “What did you call it-her?”\n“Baneofallrodents. Oh. Sorry. Baneofallrodents.”\nDumbledore’s eyes twinkled again.\n“Bane of all rodents? What an unusual name. I suppose you have a point. Very well. You have a week long probationary period, and if it proves to be that you can control her you may keep her.”\n“Thank you.”\n“Now, my boy, I would like to reaffirm that you will be safe at Hogwarts. Nobody will try to kill you here.”\n“Ding,” Harry said, and noticed McGonagall cover her mouth with her hand and exchange an amused look with Snape. “Enormous three headed dogs. A troll. An insane genocidal lunatic who taught Defence Against the Dark Arts. To mention a few.”\n“Ah, yes.”\n“Will that be all, Professor?” he said, pasting on his sweetest and most innocent expression. Snape rolled his eyes and Harry cheered silently in victory.\n“Yes Mr Potter. That will be all.”\n \n“Arrogant little twerp,” Severus muttered once Potter had left.\n“I don’t know what you mean,” Dumbledore said, twinkling away.\n“Ding,” Minerva said, a sly grin on her face. “Oh my, the power’s gone to my head.”\nSeverus swept away and into his office and threw a handful of floo powder on the fire.\n“Malfoy Manor.”\nLucius was sitting in his office and nodded a greeting.\n“Ah Severus, I thought I might be hearing from you. I just received a rather interesting owl from Draco. Do come through.” Severus stepped into the floo and joined Lucius at his desk.\n“You will not believe the conversation I just witnessed,” he said, finally allowing his mirth at Potters audacity to show.\n“After Draco’s letter I’m sure you could tell me that there are pigs with wings and I'd stand and take a look out my window.”\n“Draco told you about Potter adopting the snake? Being a parselmouth?”\nLucius nodded.\n“Well, Albus was of course having none of it, wanted Potter to have as little ‘Dark’ influence in his life as possible, and told Potter he couldn’t keep the snake, on the grounds that it wasn't on the list of permitted pets. And Potter then goes ‘Ding. That’s my bullshit detector.’” Severus laughed and Lucius snorted. He filled the other man in on the rest of the conversation.\n“Albus did a one eighty when he realised that it was an argument he wasn’t going to win. Presumably to continue being seen as the benevolent all-knowing grandfather figure, although I rather suspect that Potter's got him sussed out.”\nLucius looked thoughtful. “That suggests the boy is more independent than we previously thought. Sounds like there’s a bit of Slytherin inside him. I wonder if we can sway him to our side.”\nSeverus privately agreed, which worried him slightly. He’d misjudged the boy greatly. He’d hidden his entire personality, made himself to be the image of a perfect Gryffindor. He’d seen Potter roll his eyes the moment he’d given up. Draco had taunted him, and Potter had found it to be so hilariously stupid that he couldn’t help but say something.\n“Would you like to know the snake’s name?” Severus said with a chuckle, dismissing his current thoughts to dwell on later. Lucius raised a brow. “Bane of all rodents.” Lucius smiled.\n“Most humorous,” he agreed.\nHarry strode into Transfiguration, Baneofallrodents wrapped around his neck. There had already been one incident that morning with Scabbers, but Ron had managed to snatch the rat away just in time. “You should be a keeper, with those reflexes,” Harry had remarked, and Ron had been so astounded by the sudden compliment that he forgot to berate Harry for allowing his snake to attack Ron’s rat.\n“You look nice today,” he said to Hermione, seating himself next to her. She blushed. Harry smiled inwardly. Point to him.\n“Quiet please,” McGonagall said. “Today we shall be learning how to turn a rabbit into a slipper.” There was a flick of her wand and a rabbit appeared on each of their tables. Baneofallrodents lunged forward, biting the rabbit. Everyone stared. Baneofallrodents began the slow process of swallowing it. Harry smiled sheepishly.\n“Sorry. She’s hungry. Next time give me a warning, and I’ll tell her not to eat it,” he told McGonagall. “Naughty. I told you not to bite anything!”  he hissed.\n“You told me not to bite any human,\" she replied, rather smug to have found a loophole. Harry sighed.\n“Well now I’m telling you not to bite anything unless I tell you that it is food.” \n“Fine,\" she replied in a resigned tone.\nHarry smiled winningly. “She won’t do it again.”\nMcGonagall stared at Baneofallrodents, a perturbed expression upon her face.\n“See that she doesn’t,” she said, and with a wave of her wand Harry had another rabbit.\n“Now, the incantation is ‘Lepmutavsol’, and the wand movement is this.” She demonstrated. Harry grinned. It was time to start demonstrating to the world that Harry Potter was not an imbecile.\n“Lepmutavsol,” he murmured, flicking his wand. Instead of a rabbit sat a pair of fluffy white slippers. McGonagall looked startled, then beamed.\n“Very good Mr Potter! Five points to Gryffindor.” Ron was gaping (he did that a lot), and Hermione looked frustrated. He slid his chair closer to hers.\n“When you perform a spell, what do you feel?” he asked.\nShe frowned. “A rush of magic,” Hermione said.\nHarry nodded. “Okay, now, before you perform the spell, try and pull that feeling to you.”\nHer forehead crinkled as she focused. “Okay?”\n“Now perform the spell, visualising the outcome.”\nShe did, and there sat a lovely pair of slippers.\n“Thanks Harry,” she whispered. He grinned. He could practically feel Malfoy’s glare. He turned and winked at the blonde, who nearly fell off his seat. Merlin, but idiot baiting was so much fun.\nThey were sitting at Gryffindor table for lunch when Harry actually began to take note of the whispers surrounding him. They focused on one thing: Harry was the Heir of Slytherin. He tried not to chuckle at the absurdity of that suggestion. People were sheep. Harry decided to take his turn at being shepherd.\n“What’s this about me being the Heir of Slytherin, then?” he asked his part of Gryffindor table. A number of them blushed, or looked away. He could feel the rest of the Hall quiet. Ah, the profits of being famous.\n“Slytherin,” he instructed the table, as if the entire Hall wasn’t listening. “Slytherin is the house of cunning. If I was the Heir of Slytherin, why on earth would I demonstrate that I was a parselmouth, and have a pet snake? It’s far too obvious. Besides, those of you who have done your research know that the Chamber of Secrets was opened fifty years ago, and I wasn’t even alive then. So it’s obviously not me.”\n“Who is in then?” someone cried, and he saw Snape wince. Hehe. He turned to the rest of the hall, not even bothering to pretend that he wasn’t addressing them all.\n“Well that is the question. Who was alive when it first opened? Who would we least expect it to be? And who is a powerful enough wizard to open the Chamber?” They waited with bated breath. Harry smirked.\n“Professor Dumbledore, of course.”\nSnape looked resigned. Dumbledore looked surprised. Hagrid looked angry. McGonagall looked amused. The students gasped, and as one turned to look at the teacher’s table. Harry supressed a giggle. What a load of idiots.\n“Harry,” Hermione hissed to get his attention. Students began running out the hall, likely to inform their parents. Oh he was good, he was so good.\n“Come along minions, off we go to Potions,” Harry said, and led the way.\n“Harry!” Hermione hissed even louder. “Firstly, I object to being called a minion, and secondly, you can’t just say that about a teacher!” Harry rolled his eyes.\n“Hermione your unfounded respect and slavish devotion to figures of authority is going to get you into trouble one day, and I’ll be there to tell you I told you so,” he told her. “Besides, if I was a normal student I’d be feeling horrible about the fact that people suspected me of attacking their friends, and that the teachers have done nothing to dissuade them of the idea. So I merely gave them a new one. It’s a load of bollocks, of course, but so is the suggestion that I’m to blame.”\nHermione wrapped him into a hug.\n“Oh Harry! Why didn’t you say you were feeling bullied.”\nEh? How on earth had she drawn that conclusion? He shrugged, and let her believe it.\nHe sat next to Hermione in Potions.\n“Aw come on mate, we always sit together,” Ron said. Harry smiled viciously.\n“Yes, you’re the reason our potions are what some might call disastrous, or others might call catastrophically awful. You lack the fortitude for hard work and concentration that Potions requires, and the mental acuity to understand the interactions between ingredients that is essential for the completion of any potion harder than a cure for boils. Don’t worry, you can partner with Seamus, perhaps that way only one cauldron, instead of two, gets blown up.”\nRon frowned. “So we’re making new friends? Okay!”\nHarry stared. How had he put up with that imbecile for over a year?\n“You really shouldn’t be so hard on him,” Hermione told him snottily, but he could see a faint glimmer of amusement in her eye.\n“I’ll stop being mean when he stops being an idiot.”\n“Ah, I see. So never?” she said. Harry beamed and patted her on the head.\n“Hurrah, you’re learning!”\nSnape swished in with his swishy robes swishing about. He watched Harry curiously for the entire lesson, and barely did more than sneer at him. Then Harry felt a light probe of Legilimency. His drew up his barriers, leaving only a message in burning letters. Legilimency on a minor is illegal. Snape pulled out of his mind and gazed at him with wide eyes. Harry smirked, and turned in a perfect potion.\n“Good day sir!” he said cheerily as he walked out the room. They retreated to the common room before dinner, where Baneofallrodents slithered up to him.\n“Master, master!” he cried. (For Harry was unpronounceable in parseltongue.) “The rodent turned into a human when I tried to eat him!”\n“Baneofallrodents, what have I told you about not eating other people’s pets?” Harry hissed, then froze as he realised the implications. “Does he know that we can communicate?” he asked, looking around for Ron’s rat. There it was, dozing in Ron’s hands. Oh holy fuck that was a human. An animagus.\n“No,” Baneofallrodents hissed. Harry collected Hedwig’s cage.\n“Hey Ron,” Harry said, casual like. “Do you mind if I take Scabbers to get some food. He’s looking a bit peaky.” Ron peered at Scabbers, and shrugged.\n“Yeah, whatever,” Ron muttered. Harry took the rat, which was still asleep, and debated the best course of action as he placed it into the cage, which he shrunk slightly. Snape or McGonagall. Or both? He raced down the corridors and to McGonagall’s office, wand ready to Stupify the rat before it could do anything.\n“Hi Professor!” he said with a gasp as he entered the room. Luckily for him they were both present. “Would you mind charming this cage unbreakable?” he asked with a cute smile. McGonagall narrowed her eyes, but muttered the incantation.\n“Stupefy,” Harry muttered, pointing it at the rat.\n“What is the meaning of this, Mr Potter?” she asked, and Snape stood with folded arms.\n“Well, Baneofallrodents was trying to eat Scabbers, and then she told me that he turned into a human.”\n“What nonsense is this?” Snape growled.\n“The Weasley’s rat has lived for eleven years! Don’t you think that’s rather suspicious for a rat? And I swear it’s not a joke. He slept in Ron’s bed!” McGonagall and Snape exchanged glances.\n“We better take this to the aurors,” McGonagall murmured, and Snape muttered an agreement.\n“If this is a prank…” Snape left the rest unsaid. Harry snorted.\n“If I was going to pull a prank I’d do a much better job than this, and it would be much funnier.” Harry scoffed. McGonagall and Snape fixed him with glares. “Not that I would,” he said brightly.\nIt was Snape's turn to scoff.\n “Dumbledore is the Heir of Slytherin?” McGonagall reminded him.\nHarry looked affronted. “Ding!” he said. “Dumbledore’s not the Heir of Slytherin. Don’t be ridiculous.”\n“Just like your father,” Snape muttered. McGonagall gave him an amused glance.\n“Of you go, Mr Potter. I’ll let you know what we discover.”\nHarry met Malfoy on the way back to Gryffindor tower.\n“Potter. I’d like to offer you a truce,” he said stiffly.\nHarry grinned. “Your father finally write back to you then?”\nIf possible, Malfoy stiffened further. “I don’t know what you’re talking about.”\nHarry scoffed. “If you say so. Right, you’re a Slytherin. Are you the Heir?” he asked.\n“What? No! I thought it was Dumbledore?” Malfoy said, brow arching as if he disdained the very thought.\n“Ha! What gave you that idea? Of course it’s not Dumbledore.” Harry frowned. “Damn. We had such a great plan. Hermione’s brewing Polyjuice, and we were going to kidnap Crabbe and Goyle and pretend to be them to get the information out of you. I guess we don’t have do to that now.” Then Harry narrowed his eyes. “Or have we done it already? Is Crabbe really Harry, and Goyle really Ron, and I’m really Hermione?” Malfoy glanced at him suspiciously, then at the two lumps by his side.\n“Or maybe we haven’t done it yet, but we will soon. Keep your wits about you! And watch out for Lockhart. Last year the incompetent teacher was actually Voldemort in disguise. Why not this year?” Malfoy looked horrified. “Alright Malfoy, I suppose, after all your begging and pleading, I can accept a truce. See ya later!” Harry said, and ran off, stifling a laugh.\n“Hermione my darling!” Harry cried as he entered the common room. She gazed up warily. He didn’t blame her.\n“Malfoy’s not the Heir of Slytherin, I asked him, and then told him about our plan, so we can’t use the Polyjuice for that.”\n“Harry!”\n“What? It’s not like I actually ever thought he was the Heir. He’s just too much of an idiot, and besides, he’s got alibis.”\n“What if the Heir commanded the monster to act after he left?”\nHarry shook his head. “You’re giving Malfoy far too much credit. However, I do have an even better idea for what we can do with the Polyjuice,” he said, an evil grin upon his face.\n“Oh no,” Hermione muttered. “Why does this always happen to me?”\n \nSeverus sighed after Potter left the room. Bloody Potter. Minerva threw floo powder into the fire.\n“Auror’s Office,” she cried. Kingsley Shacklebolt waved them through.\n“What can I do for you today?” he said jovially. Minerva placed the cage on his desk.\n“One of our students has claimed that the Weasley’s pet rat is an unregistered animagus, and has been sleeping in Ron Weasley’s bed,” she said with a growl. Kingsley frowned.\n“That is suspicious. Let’s take it to a holding cell.” The rat was deposited into a cell, and Minerva cast the animagus revealing spell. There was a flash of light, and instead of a rat there was a human. Even worse, that human was Peter Pettigrew.\n“Oh dear,” Kingsley said, and Severus rather felt that was an understatement. After a very enlightening veritaserum interview, repeated two times in front of Amelia Bones, and Rufus Scrimgeour, a task force was assembled to retrieve Black from Azkaban.  Bones was storming around the office.\n“Never had a trial!” she cried. “Get me Crouch in here right now! Bring up the all of the transcripts of these supposed imprisoned Death Eaters! I want answers people, and I want them right now!”\n“Well, Mr Potter does seem to like causing trouble,” Minerva observed. Severus thought back to the floods of owls Dumbledore was dealing with, questioning their children’s safety.\n“You can say that again,” he muttered. \"Bloody Potter.\"\nThe headlines were rather impressive, that morning.\nMINISTRY SCANDAL\nPETER PETTIGREW FOUND ALIVE AND MASQUERADING AS A FAMILY PET\nSIRIUS BLACK INNOCENT\nCROUCH SUSPENDED: INVESTIGATION INTO POST WAR TRIALS PENDING\nSirius Black, renowned criminal and mass murderer, accused of the homicide of Peter Pettigrew and twelve muggles has been found innocent of all crimes! The handsome Lord of the Black family tells all in exclusive interview to this privileged reporter, me; Rita Skeeter! Black was also believed to be the Secret Keeper for the Fidelius Charm surrounding the Potter’s house in 1981, and the one who betrayed them to You Know Who, resulting in their murder. (For more information on the Fidelius Charm turn to page 12.)\n“It was that piece of vermin, Peter Pettigrew who was the real Secret Keeper! I was just a decoy.” Black’s stunning blue eyes fill with tears. “He betrayed my best friend and his wife. When I discovered they were dead I gave my godson, Harry Potter (the Boy Who Lived) into Hagrid’s safe keeping, and chased after him.” He pauses, shaking with emotion. “I found him, but he got the better of me, and blew up the street, yelling that it was me who had betrayed them.” Black’s eyes flash with righteous anger, and this reporter grips the edge of her seat in anticipation. “He then transformed into his animagus form, a rat, and disappeared into the sewers, and that was when the aurors found and arrested me.”\nA thrilling tale indeed!\nLuckily for Black, Pettigrew, who had been masquerading as a pet rat for the eleven years while Black resided in Azkaban was found by none other than the Boy Who Lived: Harry Potter, who discovered that Pettigrew was an illegal animagus. Potter brought this to the attention of his Head of House, who brought said rat to the aurors. Our young hero strikes again for justice! Black has been freed, and Pettigrew imprisoned, to the relief of all.\nOne can’t help but wonder how the Ministry could have failed so badly? What other injustices have occurred?\nBlack is currently residing in medical facility to aid his recovery from years of incarceration. A Wizengamot meeting will be held on the 14th to determine Pettigrew’s sentence, and reparations for both Black and the Weasleys, with whom Pettigrew hid.\nCurrently under investigation is Bartemius Crouch, whom was responsible for Black’s long stint in Azkaban without a trial. All post war trials are to be reviewed and evaluated. Questions are being raised about the competence of both the current and last administration.\n“Who else may be residing in Azkaban without cause?” Lucius Malfoy asks. “Sirius Black is the Head of an Ancient and Noble House, yet he was tossed away as if he was trash. It is discomforting to consider that I could be in his very position.”\nArthur Weasley, whose son Percy first owned the rat before it was passed onto Ronald, claims ignorance of the rat’s true form. “It is very worrying that he’s lived in my house all this time. I am very grateful to Mr Potter for discovering his deception.”…\nHarry glanced around. The Hall was hushed as each person read the paper. Those that didn’t own their own copy were reading over other’s shoulders. Percy looked like he was going to be sick, and the twins were comforting Ron, while Ginny… Ginny was absent. Harry frowned. He’d hardly seen her at all this year. Every time he did she seemed to be getting paler and paler.\n“Baneofallrodents, would you mind keeping an eye on Ginny Weasley. The ginger one.”\n\n“There are many ginger ones.”\n\n\n“The female.”\n\n\n“Of course master.”\n\nHarry frowned. It seemed that some of his Boy Who Lived persona had rubbed off on him.\n“Mr Potter,” Percy said pompously. “You have my gratitude for uncovering this deception.”\n“Thanks. But really it was Baneofallrodents. She saw him transform from rat to human, and then informed me.”\nBaneofallrodents hissed her appreciation. Percy eyed her nervously.\n“Thank you hisssss,” he said, still pompous. Harry chuckled.\n“Sorry. Her name is Baneofallrodents. It just sounds like a hiss when I say it in parseltongue.”\n“Ah. Thank you Bane of all rodents. An apt name indeed.” He nodded to them both, and retook his seat.\n“Pompous prat,” Harry muttered to himself. The Weasley twins, although still pale, grinned, and gave him a thumbs up.\nA few weeks later Harry was sitting in the Headmaster’s office, and Sirius Black tumbled out the floo.\n“Harry!” he cried.\n“Sirius,” Harry said with a nod. Sirius scooped him up into a hug and Harry froze. Right. Affectionate caregivers. Harry was going to have to get used to that.\n“So nice to see you again,” Sirius said, looking like he was going to start crying. “I can’t thank you enough for discovering Pettigrew and uncovering the truth.” He squeezed Harry’s shoulder, eyes bright but clear and sharp.\n“Headmaster,” he greeted cordially. Harry hid a smirk. One of the many things they’d discussed over letters was the fact that Dumbledore, as Chief Warlock of the Wizengamot, had had ample opportunities to get Sirius a trial. Another was Harry’s treatment at the hands of the Dursleys, which he’d hinted at carefully. Suffice to say, Sirius Black was not a fan of Albus Dumbledore. He was not the naïve follower that had existed twelve years ago.\n“Splendid to see you again my dear boy! And once again I must apologise for not realising the truth and getting you a trial sooner.” Dumbledore hadn’t been told until the day of the trial. Why should he be? He was only Chief Warlock, and therefore required to preside over trials to ensure justice, not interfere with them.\n“Hmm,” Sirius said. Harry resisted the urge to ding. He was saving it for later.\n“Yes, well I asked you to come through my office before having your chit chat with young Harry to explain a few things to you. You plan on taking his guardianship?” Sirius nodded. Dumbledore affected a saddened look. “I see. As it stands at the moment, with Voldemort already having tried to attack Harry, I must tell you that you need to leave Harry as he is, with his family. I’m sure he’ll understand.”\n“Ding! Ding ding ding!” Harry cried. Dumbledore sighed.\n“What?” Sirius asked.\n“It’s my bullshit detector,” Harry explained. Sirius grinned, then chuckled, then coughed, obviously trying to hold in his laughter. “I do not understand! I hate my family, and they hate me, and don’t even try and tell me the wards there are better than anywhere else, because they’re not.”\nDumbledore frowned. “Now Harry, I’m sure that’s not true. They’re your family, after all.”\nHarry scoffed.\n“They loathe me! Family don’t lock you into a cupboard for ten years of your life. Only an imbecile could have missed the signs of abuse when they came to deliver my Hogwarts letter, so of course you sent Hagrid, who couldn't comprehend abuse if it sat on him. There is no way I’m staying with the Dursleys now I have a caring and competent guardian, one whom my parents originally intended me to live with.”\nSirius was bristling beside him.\n“My dear boy, I understand that you are not happy with them, but they are your mother’s blood, and I’m sure they love you. There are blood wards around the house that power the protection granted to you the night your mother died.”\n“Ding. The wards around the house are barely there. Check.” Dumbledore narrowed his eyes, and pulled a device from a drawer.  He tapped it, and it span once, then puttered out.\n“What? That cannot be possible. The only way for them to fail would be if…” He stared at a device in his hand.\n“If they don’t love me?” Harry asked. “Well done. They don’t. Never have, never will.”\nSirius patted Harry on the shoulder.\n“It seems to me, Headmaster that you’ve been interfering where you shouldn’t have. I will be applying for Harry’s guardianship, and he will never see the Dursleys again. Frankly, you’re luckily I’m not bringing both you and them up on charges. Now, will that be all?” Sirius asked. Dumbledore nodded, still staring at the device. Harry and Sirius left the office, and found an empty class room. Sirius smirked.\n“Bullshit detector? I like it.”\nHarry shrugged. “Would you like to meet your saviour?” he asked. Sirius frowned, and Baneofallrodents poked her head out of Harry’s shirt.\n“This is Baneofallrodents. This is Sirius. She’s the one who noticed Pettigrew was not just a rat.”\n“Nice to meet you,” Sirius said, a bemused expression upon his face. “A snake? And I didn’t realise parseltongue was a Potter trait.”\nHarry grimaced. “I have a sneaking suspicion it’s from Voldemort. I have a strange connection to him. He possessed a professor last year, and every time I was near him my scar hurt.”\nSirius frowned. “Strange. I’ll look into it. So, tell me about this year. There’s a monster loose in the school petrifying people?”\n“It’s a basilisk I think. It fits the criteria. Every time it kills only I can hear it talking, and a basilisk’s gaze turns people to stone, or petrifies them if they see it in a mirror, or through something else. I’ve no idea how it’s getting out though, but it’s definitely something to do with Voldemort again.”\n“Be careful then. Hopefully the Headmaster will sort it out soon. Now, how’s your year going? Pulling some Marauder worthy pranks?”\nHarry grinned. “Everyone thought I was the Heir of Slytherin, so I told them that it was too obvious, and that it had to be Dumbledore, because he was powerful and was here last time it opened. He’s been having some trouble since them.”\nSirius laughed. “Good job Pronglet.” He ruffled Harry’s hair. “Mischief managed indeed.”\n“I know. Hey, I perfected the stupid little Gryffindor act for over a year, I’m practically one of you.”\nSirius looked affronted. “Stupid Gryffindor? I don’t know what you mean.”\nHarry laughed. “You will take over my guardianship though, won’t you?” he asked, trying to hide his anxiety.\nSirius’ gaze softened. “Of course pup. I’ve got a clean bill of health, and the entire Ministry running around trying to make amends. I’ve already lawyers working on it.” Sirius made a face. “I’m taking up the mantle of Lord Black. I’ll probably need it I’m going to be protecting such a scrawny thing as you.”\nHarry pouted. “Meany.”\nSirius flicked him on the nose. “Squirt,” he retorted.\nHarry and Hermione grinned at each other, then downed the Polyjuice. Harry couldn’t actually believe Hermione was joining him, but he wasn’t one to look a gift hippogriff in the mouth. They ambled into the Great Hall, arms linked. Fred and George were sitting side by side, focused on their food. A few people glanced up, then frowned as they noticed there were two sets of Weasley twins, and the whispers began. Harry sat next to twin one, and Hermione sat opposite him.\n“Hello Fred,” he said. Twin one looked up and grinned.\n“Hello George,” came the instant reply. Then twin one glanced either side of him. “We’ve multiplied!” he cried. Harry grinned.\n“I thought I was George?” Hermione said.\nHarry frowned. “No. I’m George.”\n“No, I am!” Twin two declared.\n“You can’t all be George!” Twin one insisted. Hermione pouted.\n“If I’m not George, then who am I?” she asked.\nOut the corner of his eye Harry caught a flicker of movement.\n“Uho! Bat incoming!” he yelled. “Scatter!” All four of them jumped up from the Gryffindor table and ran in different directions. Hermione had evidently embraced her role, and had jumped onto the Hufflepuff table, and was charging down it, sending platters of food crashing to the floor. Twin two was crawling under the benches.\n“To the window,” twin one cried as he ran frantically toward the window behind the teacher’s table.\n“To the wall!” Harry threw himself against the stone wall of the Great Hall. Snape paused, glaring at all of them, trying to decide which one to go after.\n“Til the sweat drips off my-“\n“WEASLEY!” Snape bellowed.\n“RUN!” twin two screamed, wriggling out from between Angelina’s legs, and they all legged it out the hall.\nThey ended up in an unused classroom, giggling on the floor.\n“That was brilliant!” twin one said. “Now, let’s see.”\n\"Who our fellow troublemakers could be,” twin two finished. He whipped out a piece of parchment. “I solemnly swear I am up to no good,” he muttered.\n“That’s the Marauder’s Map!” Harry said. Both twins looked up and frowned.\n“Harry?”\n“Hermione?”\n“No way!” they exclaimed in unison.\n“Wait, how did you know?” twin one asked.\n“Moony, Wormtail, Padfoot and Prongs were four Gryffindors called Remus Lupin, Peter Pettigrew, Sirius Black, and James Potter. Sirius was telling me about it in his last letter. Where did you get it?”\n The twins grinned.\n“Seriously?”\n“We owe them so much.”\n“Found it in our first year.”\n“Nicked it from Filch’s office.”\n“It’d be a wrench to give it to you.”\n“But it’s your birth right.” They beckoned him over.\n“Do you know how to use it?” Harry nodded. He tapped the map.\n“Find Severus Snape,” he instructed it.\n\nMessers Prongs would like to inform you that Snivellus is rapidly approaching.\n\n\nMessers Padfoot agrees and hopes you’ve set up a prank.\n\n\nMessers Moony thinks Messers Padfoot ought to watch out as he might get pranked himself.\n\n\nMessers Wormtail would like to remind you that you better scramble unless you want to get caught. \n\nSnape’s dot was rather close.\n“Wait, nobody move,” Harry said. “Dissolute,” he muttered, tapping his wand on each of their heads. When he tapped his own it felt like an egg was being cracked open upon him. They all faded from sight and not a moment too soon. Snape pushed the door open, slamming it into the wall behind it. His beady eyes scanned the room, then he strode back out. His footsteps echoed down the hall. When they faded Harry removed the disillusionment charm. Fred and George were beaming.\n“Brilliant!” they declared. Harry tapped the map.\n“Mischief Managed. You guys are welcome to borrow it whenever, you know.” A few moments later the Polyjuice wore off. Harry flicked his wand, resizing his robes. Hermione grimaced.\n“I’m going to get changed. See you later.”\nHarry pocketed the map.\n“I’m off for breakfast.” He trotted out the room.\n“Wait! You didn’t tell us how you managed it.” The call came from behind him. Harry grinned, and sped away. He entered the hall, which was in uproar, and seated himself next to Neville.\n“What happened?” he asked. Neville looked rather surprised at being addressed.\n“Fred and George managed to duplicate themselves so there was four of them, and then ran around the hall while Snape chased them. They’ve just left,” he whispered. Harry chuckled.\n“Damn. I can’t believe I missed it,” he said with a shake of his head. He grabbed a piece of toast, and began composing his letter to Sirius in his mind. A very successful morning.\n \n“Those darn Weasley twins!” Severus raged, striding back and forth. Minerva hid a smile behind her hand, and Albus hadn’t even bothered trying to hide his amusement. There was a knock on his office door. He wrenched it open to find Draco, accompanied by Dumb and Dumber. Just his luck.\n“Yes?” he growled. Draco paled.\n“It was Potter! He’s made polyjuice. He told me the other day!” Draco said, his grey eyes bright and irritating. He was practically bouncing with energy. Severus rolled his eyes.\n“If you’re going to try to get Potter into trouble you may as well come up with a better lie!” he hissed, and slammed the door shut in Draco’s face. Bloody Weasleys! Bloody Malfoys! Bloody Potter!\n“Come now Severus, there may be a hint of truth in what he was saying,” Albus said. “Weren’t you telling me the other day that some boomslang skin had gone missing?”\n“As if Potter could brew Polyjuice. Next you’ll try to tell me that Granger helped him! That rule abiding know it all wouldn’t pull a prank to save her life,” Severus growled. He clenched his fists and took a breath to calm himself.\n“I want them punished!” he hissed.\n“They didn’t actually do anything wrong,” Albus pointed out.\n“Disruption of a meal!” Severus cried.\n“Very well,” Minerva said. “Five points-“\n“Five! Fifty points from Gryffindor for disruptive behaviour,” Severus said.\nAlbus raised a brow. “Forty five points to Gryffindor for ingenuity. Now, that will be all,” Albus said firmly.\nSeverus sighed and collapsed into a chair. Bloody Gryffindors.\nHarry spent his first Christmas hols with Sirius, singing carols and eating mince pies, while plying Sirius with mulled wine. Drunk Sirius was the funniest thing he’d ever seen. He kept shifting into Padfoot as he fell asleep, and Sirius could barely coordinate two legs, let alone Padfoot’s four. Harry would douse him with water, and Padfoot would chase him around their cottage, crashing into walls and at one point running straight into a pane of glass he hadn’t realised was there. As he fell back he shifted back into Sirius with a groan.\n“My nose!” he cried, groping around for his wand. Harry had just kicked it under a sofa when there was a knock at the door. “Moony!” Sirius said, jumping up and then tripping over his own feet. Harry smirked, and opened the door. He recognised Remus Lupin from photographs, although he looked older and wearier.\n“Hello. I’m Harry Potter,” Harry said.\nRemus smiled. “Remus Lupin. Call me Remus, or Moony, as I'm sure Sirius has told you to. It’s wonderful to see you again after all this time.”\n“Moony!” Sirius groaned. Harry beckoned him in.\n“You’re just in time for Christmas dinner. Mimsy’s setting the table.”\n“You’re evil!” Sirius said. “Harry, where’s my wand!”\nHarry grinned. “How would I know?” he asked innocently.\n“Harry!” Sirius yelled. Harry ignored him. He led Remus past the lounge and up the stairs.\n“Sirius decorated for you…” The room they’d allocated was covered with reds and golds. Remus chuckled.\n“It looks wonderful,” he said. “Let’s go find Sirius, shall we?” He placed down a briefcase, and they found Sirius lying on the floor, whinging about his bloody nose.\n“This is all Harry’s fault!” Sirius cried. Remus frowned.\n“Sirius!” he admonished. “You can't blame your twelve year old godson when it's you that's been drinking too much.” Harry smirked at Sirius from behind Remus’ back while Remus fixed Sirius up. Sirius narrowed his eyes.\n“I can if he’s laced my mulled wine with fire whiskey. I know you did it.,” he hissed. Harry blinked, his green eyes innocent and wide.\n“What’s firewhiskey?” he asked.\nRemus flicked Sirius on the nose. “Behave.”\nThey sat around the table, upon which sat a feast. It smelt delicious.\n“Crackers!” Sirius declared. Sirius and Remus held one, and Harry offered his to Mimsy, who squeaked in delight.\nBANG. Harry pulled his with Mimsy and the usual fireworks appeared. He gave her the crown, and placed the chocolate frog beside him. They exchanged a sly glance.\nBANG. Sirius’ cracker was pulled, and red and green glitter exploded over him and Remus. They both spluttered. He turned to face them. Sirius wiped glitter away from his eyes, before turning to glare at Harry.\n“Was it supposed to do that?” Harry asked guilelessly. Every inch of them was covered. They shimmered as the moved. Sirius shook his head like a dog, and only managed to shake more glitter onto Remus.\n“Sirius! I’m going to kill you!” Remus said.\n“It wasn’t me! It was Harry!”\n“Don’t blame your innocent godson!” Remus hissed. Harry kept a straight face, and exchanged a wink with Mimsy.\n“Honestly Sirius I’m so disappointed in you,” Harry said, shaking his head. He bit his lip to keep himself from laughing.\n“Scourgify,” Remus muttered, and the glitter poofed! and multiplied.\n“Evanesco,” Sirius said, and all of his glitter turned pink. Harry couldn’t help it. He snorted, then spluttered with laughter.\n“Merlin your faces,” he chuckled. Both adults turned to face him.\n“Harry?” Remus said curiously. Suspicion crept into his eyes.\n“Harry,” Sirius said.\nHarry grinned. “Mimsy?”\nThe house elf clicked her fingers and the glitter vanished. He held up his hand and she high fived him.\n“Oh Merlin, you’ve corrupted the elf,” Sirius groaned, while Remus looked resigned.\n“There’s two of them,” he muttered.\n“Happy Christmas!” Harry said in delight. They proceeded to have a Christmas even better than Harry could have imagined.\nBack at school Harry happened upon a very curious diary. It absorbed ink and wrote back to the author, and Harry had brushed off a pesky compulsion to continue writing, and never let it go. He remembered distinctly something that Arthur Weasley had said. ‘Never trust anything that can think for itself if you can’t see where it keeps its brain.’ And the diary was certainly suspicious. He packaged it up, and sent it off to Sirius with a note, and thought nothing of it. So he was rather surprised by the emphatic and slightly deranged reply he received.\nA red letter hovered in the air before him.\n“A howler!” Ron said, almost in delight. “Better open it, or else it’ll explode!” Harry raised a brow, and opened it with the tip of his wand. He still remembered Mrs Weasley's scolding.\n“HARRY JAMES POTTER.” Sirius’ voice boomed around the hall, which subsequently fell silent. “WHERE DID YOU FIND THAT ITEM? DO YOU HAVE ANY IDEA HOW DANGEROUS IT WAS? REPLY IMMEDIATELY, IMMEDIATELY, DO YOU HEAR ME, AND TELL ME EVERYTHING YOU KNOW ABOUT IT!” Harry blinked in surprise.\n“TELL NOBODY!” He rather felt writing a howler with that directive was something of an oxymoron.\n“AND TO THOSE OF YOU BUGGERS WHO ARE LISTENING IN -PPHHHHHH.” Sirius had blown a long and loud raspberry. Harry bit back a giggle. “Love you Pronglet.” And the letter disintegrated. Harry reckoned he could still hear echoes of it bouncing around in his head.\n“So…” he said. “About those Cannons.” Ron grinned. Hermione glared at him with disapproval.\n“I reckon they’ve got a chance this season!” Rom exclaimed, utterly oblivious to the silence.\n“I agree,\" Harry lied, and jump to his feet. \"I just remembered that I need to… urm… one sec.” Harry sprinted out the hall, racing toward the Owlery. What on earth had he found?\n“What do you suppose that was about?” Minerva asked, infringing upon the silence that surrounded his corner of the staff room.\n“Nothing good,” Severus muttered as he marked the fifth years’ homework. ‘Is there anything other than air inside your head, Johnson?’ he scrawled in blood red ink.\n“That’s a wee bit harsh.” Minerva commented, having read over his shoulder. He set down the papers and narrowed his eyes at her.\n“What do you want?” he growled.\n“For you to come with me when I go to confront Sirius Black about his rather curious howler to young Mr Potter,” she replied calmly. Severus groaned, pinching the bridge of his snose.\n“Why me?” he mumbled, then louder, “No! Absolutely not. I’ll go nowhere near that mutt. I want nothing to do with him.”\n“Aren’t you at all intrigued?”\nHe crossed his arms. “Irrelevant.”\nMinerva cocked a brow, then smirked.\n“Ding,” she said. Severus sighed, very loudly, in an attempt to get his frustration across to her. Her smile only grew wider, like that of the Cheshire cat.\n“Come along now,” she said, as if she was corralling a child. “I’m sure Lily would be interested in what ‘dangerous item’ her son had happened across.” Severus glared at her, before snarling and getting to his feet.\n“Fine! As it seems to be the only way I can get you to shut up and go away,” he hissed, and stalked off to get his outer robe. He chose to ignore Minerva’s stifled snort of laughter.\n“Minnie!” Severus heard Black cry, and wondered how the man hadn’t been slaughtered already. To his shock Minerva merely huffed. He could imagine the affectionate eye roll that accompanied it. Minerva stepped inside, and Black looked startled.\n“Snape,” Black said, eyes flicking between the two of them. “Please, come in.”\n“Black,” Severus replied, barely keeping the disdain from his voice. If Black could be civilized, well, so could he.\nHe stiffly seated himself in the parlour of Grimmauld Place, and sat in silence while Minerva and Black exchanged pleasantries. Eventually, they got to the point.\n“You’re not just here for a social visit,” Black observed.\n“Obviously,” Severus replied, biting back further vitriol. Black grimaced.\n“It’s about that howler, isn’t it?” Black shook his head. “I must admit… I wasn’t thinking clearly when I sent it.”\n“That is quite evident... Well? Out with it! What dangerous item had Harry encountered?” Minerva demanded. Black, for the first time in his entire life, looked entirely serious. Severus was well aware of the irony. He contemplated the both of them, his eyes narrowed as they settled upon Severus.\n“Would you both be willing to take a vow not to wilfully disclose this information to another person without my permission?” Black asked. Severus raised a brow, but agreed. Black had been a formidable Auror, even in his youth, loathe as Severus was to admit it. He wouldn’t ask such lightly.\nOnce they had taken their vow, Black exited the room, and returned with a safe. He tapped it, muttering a password, then dripped blood onto it before it opened; a decidedly dark ward that Severus was reluctantly impressed by. From within Black withdrew an innocuous black book.\n“This is the diary of Tom Marvolo Riddle… and I also believe it to be his horcrux.”\nMinerva paled, but Severus merely frowned. He’d heard of neither.\n“Well?” he hissed, when the both looked at him.\n“Tom Marvolo Riddle… that’s a name I’ve not heard in a long while,” Minerva said quietly. “I suppose it is likely easier to show you…” She traced the name in the air, so that the letters were burning as she wrote them.\nTOM MARVOLO RIDDLE\nThen, with a flick, the letters began to move, rearranging themselves.\nI AM LORD VOLDEMORT\nSeverus recoiled, looking at the diary in horror.\n“The Dark Lord’s diary,” he whispered.\n“It gets worse,” Black said. “A horcrux is a dark object that contains a piece of its owner’s soul, torn apart through murder.” Silver eyes met his own. “In theory, even if the body were destroyed, the soul would live on.”\nSeverus wanted to flee, to leave the room, to storm back to Hogwarts and lock himself away. He didn’t want to be in the same country as part of the Dark Lord’s soul, let alone the same room.\n“You may be interested to know that the last time the Chamber of Secrets was opened, Tom Riddle was a student at Hogwarts.”\n“You’re not saying…” Minerva said, covering her mouth with her shaking hand. “This diary… is responsible?”\nBlack nodded.\n“A horcrux is a piece of human soul. It wants a body, to be let free. It was likely possessing a child. I suppose we’re lucky that Harry found it.”\nSeverus snorted. “Luck! Luck has nothing to do with it! That boy is a magnet for trouble.” Black glared at him. “Don’t give me that look! You know it’s true!” Black sighed, looking his age.\n“You’re right, of course. Only Harry would find a part of You Know Who’s soul and send it to me in the post.” Black huffed a laugh.\n“If that is what is keeping him alive, then why haven’t you destroyed it?” Minerva exclaimed, having recovered from her shock. Black grimaced.\n“I’ve tried! Nothing I can do will destroy it. I’ve tried to burn it, to tear it apart, curse it! Nothing!” Black lamented. Severus eyed the diary. It sat on the table, mocking him in its innocent appearance.\n“I have an idea,” Severus said, even as he shied away from it.\n“Do tell,” Black growled. Severus ignored him.\n“Is there somewhere any backlash can be contained?” he asked instead. Black huffed, but led him to a ritual room.\n“Here.”\n“Stay back,” Severus warned them. He looked at the diary, and thought of his pain when he had learned Lily was to die, the feeling of betrayal, of hatred toward his former master, his utter loathing of the Dark Lord. His hands shook as he raised his wand.\n“Avada Kedavra!” The room was lit up in a flash of green light. The diary hissed where the curse struck it, and black smoke poured out, writhing and screaming, before doubling in on itself.\nBANG. The diary exploded, throwing him into the wall. His vision blurred, and spots of light swam before his eyes. His ears were ringing as he scrambled to his feet, and stalked over to the remains of the diary. It was just burnt paper and ash. He kicked it, and the remains disintegrated.\n“Done,” he muttered, pushing past Black. He couldn’t bear to look at Minerva, not now.\n“Severus,” she called out. He spun to face her, glaring at her shoes. She placed a hand upon his arm. “Well done,” she said quietly. He glanced up, but none of the revulsion he imagined was in her face, just sadness. He nodded sharply, and stalked out the house. He needed a firewhiskey.\n \n“Master master master master.”\nHarry groaned and rolled over in his bed. He was back in school for the spring term, unfortunately. It was also the middle of the night.\n“What is it Baneofallrodents? I’m trying to sleep.”\n\n“Master! I have found the King Snake.”\n\n“What?”  Harry grumbled\n“There is another snake, the King Snake.”\n“The King Snake?”  Harry rolled over. “Not now,” he hissed, and fell back to sleep.\nExam season was nearing. Half the school was mad with revision fever, and Hermione had reached new levels of crazy. He was conscripted into studying every spare second, and one time she’d even followed him into the toilet. Harry had taken to hiding from her in the most unusual of places, which is how he'd ended up under Lockhart’s desk.\nThe office had been empty. Unfortunately, Lockhart followed him in moments later.\nHis shoes were gold velvet, and twinkled as he walked. Harry could only see the bottom half of his robe, and it was cream, embroidered with portraits of Lockhart in golden thread around the edges, and they waved at Harry, beaming wildly. Lockhart was standing at his desk, humming Madonna’s ‘Like A Virgin’ to himself. Harry stuck a fist in his mouth to prevent himself from laughing.\n“Mirror mirror, on the wall, who’s the fairest of them all?” Lockhart suddenly sang.\n“Why, you, of course, you handsome scallywag,” Lockhart continued in a lower voice. Harry bit down so hard he tasted blood. “If only I wasn’t a mirror…”\n“Oh please, you flatter me!” Lockhart said in his usual voice.\n“Not at all. Your hair is like spun gold, and your teeth are as white as pearls and shine like diamonds!”\nHarry choked upon his spit, and Lockhart stopped.\n“Who’s there?” he called, and almost tripped over his shoes as he spun. Harry glanced at the door, but there was no way he’d make it without being seen.\n“Baneofallrodents. Help!”  Harry hissed. Baneofallrodents unfurled herself from Harry’s shoulders.\n“Open,” she hissed sleepily, before curling back up.\nTo Harry’s surprise, the stone wall began unfolding, sliding back like the bricks at the entrance to Diagon Alley. Harry glanced up at Lockhart, who was brandishing his wand at the door, oblivious to the drama behind him, and scrambled through it. “Close!” The stones moved again, and as the last one fitted into the wall, Harry was left in darkness.\nHarry blinked, but his vision didn’t clear. He scrambled for his wand.\n“Lumos.”\nSlime dripped from the ceiling of the tunnel Harry found himself in, joining the muck the covered the floor. Harry sniffed, and regretted it as the stench of waste filled the air.\n“This better not be a sewer,” Harry growled. Baneofallrodents declined to reply, only furthering Harry’s suspicions. He picked a direction, and began walking.\nAs Harry walked, the tunnel began steeping down, trickles of water preceding him like a small filthy brook. He muttered the parseltongue for ‘open’ every couple of steps, but no exit appeared. Down and down he walked, and the further he walked, the colder it got. Occasionally things crunched beneath his feet, but the only time he’d glanced down he’d seen the bones of a rodent long gone from this world. Harry didn’t look down again.\nOccasionally the tunnel changed direction, but never at sharp angle. It meandered like a river, and the stone walls were smooth as if water, or some other substance had eroded them. The tunnel itself was circular, more like an enormous pipe, and Harry hoped he wasn’t about to be washed into the Black Lake.\nThe tunnel got steeper, and Harry seriously considered turning back. Surely Lockhart must have left his office by now? But his curiosity had been piqued, and he never had been one to go back on a challenge. He was bracing his hands against the walls in an attempt to keep his balance, but really, when it happened, he should have realise that it would have been inevitable.\nHe slipped.\n“AAAAHH!” Harry yelled as he slid down the pipe like it was a disgusting water slide. He’d dropped his wand when he’d fallen, and all he could do was brace his head as he shot down the tunnel, picking up speed until the drop was almost vertical. He could see nothing but darkness ahead.\nA crunch of bones broke his fall. Thankfully, he didn’t think they were his own. Harry moaned, not moving, his glasses gripped so tightly in his hand they’d broken in half.\n“Ouch,” he hissed as something landed on his face. He blinked, peering at the shining tip… of his wand!\n“Reparo,” he muttered, and slid his fixed glasses on.\nIf anything, the room he was in was even creepier than the tunnel. He couldn’t see the floor for all the skeletons that lay on it. What had once been green tile on the walls was now covered in black mould. The only source of light was his wand tip, throwing eerie shadows about the room.\n“Master…!” Baneofallrodents slid out the tunnel. Harry snatched her out the air with lightning quick reflexes honed by Quidditch. She curled so tightly around his neck he almost couldn’t breathe.\n“Too fast,” she scolded.\n“Where the hell am I?” Harry muttered, before catching sight of a pillar, on which a stone serpent was curled. He snapped his eyes shut, heart rate, which had only just recovered, rocketing sky high once again. A half-remembered dream flashed before his eyes… Baneofallrodents talking about a ‘King Snake’.\n“Baneofallrodents. Where, exactly, did you find the…” He choked over the word. Apparently, Basilisk didn’t translate into Parseltongue well. “The…basil… lisp?”\n\n“Master?”\n\n“The bastille licks! The battle lists! Fuck. The basil licks!” \n“Are you well, master?” Harry grimaced. He opened one eye, then the other, preparing to snap them shut at the first sign of movement.\n“The King Snake?”\n\n“Here, Master!” \n\nGreat. Harry was stuck in the Chamber of Secrets, with Salazar Slytherin’s hungry basilisk on the loose. And, judging by the tunnel Harry had just tumbled down… it was enormous.\n“It’s very friendly, master,” Baneofallrodents said. Somehow, that didn’t reassure Harry one bit.\n \n Severus was minding his own business, patrolling the first floor, definitely not thinking about the ‘horcrux’ he’d destroyed a few weeks ago, when he caught sight of an irate Lockhart. He promptly turned on one foot and took off in the other direction. Unfortunately, it seemed lady luck was not on his side.\n“Severus! Severus! Just the man I was after.” Lockhart’s usually pristine hair was mussed, and there was a wild look in his eye. Severus bit back a sigh.\n“There was someone hiding in my office!” Lockhart proclaimed. Severus reluctantly followed the man in. Every single portrait was scanning the room, although one slipped him a wink. He raised his wand in warning and it hurriedly turned away from him.\n“They escaped out a hole in the wall! Right there.” Lockhart pointed halfway up the wall. Severus tapped it with his wand. It was stone, a foot deep, as to be expected for a castle. There was nothing magical about it.\n“How big was the… hole in the wall?” Severus asked, narrowing his eyes at Lockhart. Lockhart waved his arms around wildly. Severus raised a brow. Lockhart eventually settled upon a holding his hands about a foot apart.\n“There was a person hiding in your office, who escaped through a hole in the wall the size of a shoe box that was at least a meter off the ground, all while you were present…”\n“Yes, that’s it entirely! Of course, I had my back turned when they escaped, but they must have been hiding under my desk,” Lockhart agreed with a beam. \"Obviously they were too cowardly to face me.\"\n“Where they, perhaps, invisible, as well?” Severus drawled. Lockhart failed to notice the danger, and continued to blather on.\n“Yes, of course, you’re completely right! How on earth will we find the culprit?”\n“That is beyond me. Of course, you are the Defence Against the Dark Arts teacher… are you not? Shouldn’t finding people versed in the art of espionage be your speciality?” Severus smirked as Lockhart paled, and swept out the room before he could hear a single word more.\nDraco fell into step beside him. Damn his luck.\n“It was Potter,” Draco hissed, glancing about in suspicion. “I saw him go in there, and he never came out!”\n“Silence!” Severus growled, and Draco took a step back. “First dragons, then polyjuice, now this! Making up lies about Potter will get you nowhere! Get out of my sight.” Draco scarpered.\n“Ten points from Gryffindor,” Severus muttered as he walked past the House point hourglasses, and was rewarded by a groan of despair from a student in a red and gold tie as they watched the rubies trickle down. Severus smirked, his mood lifted. Now if only to catch Potter actually breaking the rules… that would be the cherry on top.\n“How do we get out of here?” Harry asked Baneofallrodents.\n“Through that door,” Baneofallrodents nodded toward a circular wooden door. It was covered by engravings of snakes, and several years’ worth of grime.\n“Great,” Harry grumbled. “Open.” Nothing happened. “Open up. King Snake. Salazar. Salazar Slytherin.” The snakes on the door came to life, and one by one slithered off the doorway, unlocking with several ominous snicks. The door creaked open. Harry watched warily for even a flicker of movement that might suggest there was an enormous basilisk waiting to petrify him with its gaze, or just eat him, and stepped through.\nOn the other side was a long, dimly lit chamber. Stone pillars entwined with serpents towered above him, the ceiling lost in darkness. There was an occasional plop of dripping water, and a rasping noise that echoed, amplified by the vast space.\n“Who dares enter Salazar Slytherin’s sacred study?” a low voice hissed. Harry froze, jamming his eyes shut, heart pounding in his chest.\n“Hello Sally! It’s Baneofallrodents, and my human.” There was a long pause.\n“Oh hey Baneofallrodents. Did you bring me any snacks?”\nHarry burst into hysterical laughter.\n“What’s wrong with your human?”  the basilisk – Sally – asked.\n“He’s always like this.”\nIt took Harry several moments to catch his breath. Eventually he got a hold of himself, and nodded in the direction of the voice.\n“Hello Sally,” Harry hissed. “My name is Hassa.”\n“I call him master.” Baneofallrodents informed Sally.\n“My only master is Salazar Slytherin, and his heirs. Hassa will suffice,” Sally hissed. “You may open your eyes, little human. Mine are shielded and will not harm you.” Harry opened his eyes, and stared at the floor. Slowly, he raised gaze to first take in Sally’s enormous length, easily thirty feet in length, her scales a vivid iridescent green. He forced his eye up further, warily noting Sally’s teeth, as long as any sword. Then, he met her eyes.\nHe could immediately see that there was a thin veil over them, and he bowed without a thought. He’d met a basilisk’s gaze and survived!\n“You are magnificent,” he said honestly. And terrifying, he added in the privacy of his own mind.\n\n“Thank you, little human. Next time you come, you may bring me snacks.”\n\n“I’ll do that.” Harry wondered what a basilisk liked to snack on. “Why did you attack those children?” Harry asked cautiously. Sally roared and he immediately flinched back.\n“I was commanded by Slytherin’s heir. I did not kill them. They will recover!” Harry bowed again.\n“Of course. My apologies.” Sally’s tail flicked, and then moved slowly toward him. Harry kept very still. Sally wrapped it around him, like it was another snake.\n“Slytherin’s heir has not come in a long time. All is well,” she soothed him.\n“I told you she was friendly.” Baneofallrodents hissed from where she was hidden beneath Sally’s tail.\n“It was lovely to meet you, Sally, but I’m afraid my friends are probably missing me. Is there any way for me to get out of here?” Harry asked the thought that had been plaguing his mind since he’d fallen down the tunnel. He was hungry. Sally hissed in what sounded like amusement.\n“Come.” He followed her through another set of tunnels, until they reached a pipe like the one he’d fallen down. “Perch on my head, and I shall lift you up.” Harry cautiously climbed up her frame, and Sally lifted them up through the tunnel.\n“Open.” Harry scrambled onto a tiled floor. He turned back to look Sally in the eye.\n“Harry!” someone shrieked.\n“Thank you,” he hissed. Sally disappeared back down. “Close.”\n“Harry! Was that a basilisk?” Hermione yelled. Harry grinned sheepishly at her.\n“Yeah. She’s called Sally. We’re friends now.”\n“You can’t befriend a basilisk!” Hermione exclaimed. Harry shrugged.\n“We’re in a crack fic, Hermione. It’s expected.”\n“What?” Hermione said, her brow wrinkled. Harry shook his head.\n“Don’t worry dear. Oh, look! A stack of books!” Hermine perked up, and her nose flared, like a hound with a scent.\n“Books?” She swivelled around and broke the sound barrier to reach the pile of tomes upon the floor next to her.\n“You must have dropped them.” He helped her pick them up. A glance around showed that he was in a bathroom.\n“Oh my! A boy in a girl’s bathroom! You shouldn’t be here.” Moaning Myrtle floated out of a toilet and Harry bit back a sigh. At least that answered the question of which bathroom.\n“I was looking for you,” Harry lied. “I heard that there was a beautiful ghost haunting one of the bathrooms, and I just had to see for myself.”\n“Oh my!” Myrtle moaned. She blushed, and flew into the toilet, splashing water everywhere.\n“You’re a fiend, Harry Potter!” Hermione cried with a huff, flicking water out of her eyes, and stalked out of the room. Harry grinned, and trailed after her, winking at Malfoy who was gawping at them as they left the bathroom.\n \n“Sir! Potter just come out of a girls’ toilet! A girls’ toilet!” Draco cried. Severus hit him with a silencing charm, and walked away. Someone would remove it… at some point. Wouldn’t they?\nHe continued on his way to the Headmaster’s office. The gargoyle stepped aside after he snapped out the password. “Acid pops.” Minerva and Black were already waiting for him.\nAlbus was sitting at his desk, looking omniscient as always, stroking his beard.\n“Well Severus, this is an unexpected surprise. I must I never thought I’d see the day that you would voluntarily spend time in close proximity to Sirius. Lemon drop, anyone?”\n“None of your nonsense Albus!” Minerva snapped, and wacked Albus over the head with her wand. “I’ve just about had enough of your foolish behaviour lately.” Severus hid a smirk as Black gaped. Albus merely blinked in surprise.\n“Apologies, Minerva,” Albus said, although he seemed unsure as to what he was apologising for.\n“Harry found this in a girls’ toilet,” Black said, and placed the remains of the horcrux diary on the table. Albus’ grandfatherly facade vanished in an instant. “It was a horcrux, and we think it was responsible for possessing a child and opening the Chamber of Secrets.” Albus began casting several diagnostic spells, a frown firmly fixed upon his face.\n“What I would like to know is how the wards failed to detect such a dark device!” Minerva growled.\n“Alas, of late the Board of Governors has refused to allow me to update the wards, and as such, they are falling into disrepair. We don’t have the budget for it.”\n“Well that’s a load of bullshit,” Black said, echoing Severus’ thoughts.\n“That’s outrageous!” Minerva exclaimed.\n“I believe Lucius is likely to have had a hand in this,” Severus murmured.\n“Really…” Black muttered, then an evil grin spread over his face. “Well, I suppose we’ll just have to beat him at his own game. Leave this to me.” Severus shuddered as Black stalked out of the room.\n“Harry seems to be a positive influence on him,” Minerva remarked fondly. “Wouldn’t you agree?”\n“Certainly,” Albus said.\n“I suppose Black is minutely less odious than he was in his youth,” Severus allowed.\nHarry snatched up a copy of the Prophet at breakfast, and promptly choked on his pumpkin juice.\n\nBOY WHO LIVED SAVES THE DAY ONCE MORE\n\n\nHOGWARTS BOARD OF GOVERNORS ENDANGERING STUDENTS\n\n\nCURSED OBJECT FOUND AND DESTROYED\n\n\nOver the course of this academic year something terrifying has been stalking our students in the very halls we have all once called home; Hogwarts School of Witchcraft and Wizardry. Children have been petrified: literally! Ominous messages written in red paint were displayed upon the walls for all to see, claiming the Chamber of Secrets had opened once more.\n\n\nThe origin of these terrible tragedies was a cursed object that was attacking students. Luckily, one clever and brave child faced down the cursed device, and recognised it for what it truly was! Harry Potter, the Boy Who Lived, wisely sent the cursed object away from Hogwarts and into the care of his guardian, Lord Black, who promptly destroyed it, thus ending the reign of terror.\n\n\nBut how, you may ask, did the object enter Hogwarts in the first place? Hogwarts, allegedly the safest place in Britain has not had its wards renewed for nearly ten years! This reporter is scandalised to discover that the Hogwarts Board of Governors has refused to pay for curse breakers to renew the ward schemes, claiming budgetary deficiencies despite the Headmaster’s yearly requests.\n\n\nI ask you, wise and caring wizarding folk: would you put a price upon the safety of our children? \n\nHarry cackled aloud, and several classmates slid further down the benches to get away from him.\n“This is shocking!” Hermione exclaimed, reading the paper over his shoulder.\nA flurry of ginger hair and freckles barrelled into him.\n“Thank you thank you thank you!” Ginny Weasley cried, hugging him so tight he could barely breath. Then she blushed bright red and sprinted out of the Great Hall.\n“She’s totally mad,” Ron commented around a mouthful of food, baring the mush for all to see. Harry exchanged a grimace with Hermione.\n“Ready Potter?” Wood called. Harry stood up and saluted him. Time for the final Quidditch match of the year.\n“Yes sir, captain sir!” he cried, and followed the Gryffindor team toward the changing rooms. Hopefully he’d be able to avoid any rogue bludgers or bucking brooms.\nThey were playing Ravenclaw today, and the Gryffindor team was frankly superior. Fred and George were menaces on brooms, the three female chases were ruthless and fast, Wood was so determined to win he would block the quaffle with his face if he had to, and all that was left for Harry to do was stop the Ravenclaw seeker, Chang, from getting the snitch.\nHarry was flying loop the loops when he saw the snitch. It was hovering by Chang’s left ear. If she turned even slightly, she’d immediately see it. So, Harry performed the most logical action that he could think of.\n“Wooo!” he yelled, tilting his broom forward and accelerating toward the ground. He could hear shouts of glee as the Gryffindors thought he’d seen the snitch. He shot past the Ravenclaw keeper, causing him to spin wildly on his broom.\n“Oi!” he yelled, but Harry was gone. The ground was drawing nearer and nearer. One glance was all it took to note that Chang was hot on his heels, and he abruptly drew up.\n“Hi!” he said. She stopped next to him.\n“Did you catch it?” she asked, bemused as the game continued playing.\n“Catch what?” Harry asked.\nShe stared at him. “The snitch…”\nHarry waved his empty hands at her. “No.”\nChang narrowed her eyes. “Bloody hell,” she hissed, and flew away. Harry grinned. He glanced about the field, noting the snitch had moved once more.\nThere!\nIt was hiding behind the Gryffindor goals. He casually flew up over the other players, starting a loop of the pitch. When he deemed that he was sufficiently close he spun, speeding toward the tiny golden ball. The snitch ducked and dived but Harry was determined, weaving in and out of the goals and colliding with a quaffle that had made it past Wood. Harry dove, this time for real, getting closer and closer.\n“Yes!” He snatched it out of the air, holding it up for all to see, and the stands erupted.\n“Harry Potter has caught the snitch, Gryffindor win, 260 – 80! What a brilliant game that was, brought to you by the handsome Lee Jordan, and let me tell you that we all know who the real star player is! Angelina, light of my life, Quidditch Queen and chaser supreme, will you go to Hogsmede with me?” Lee boomed over the speaker phone.\n“Jordan!” McGonagall could be heard over the sound of laughter. Angelina hovered in mid-air, posing thoughtfully. Students stamped their feet in the stands as they waited for her to make up her mind. Finally, she waved at the commentary booth and held out both hands, thumbs up. The crowd cheered, even the mopey looking Ravenclaws.\nHarry swooped down to the ground.\n“Good game Harrikins!” twin one cried.\n“Excellent flying!” twin two agreed.\n“Bloody brilliant!” Ron said around a mouthful of unknown edible substance. Harry beamed as Gryffindor stormed the pitch, lifting him onto their shoulders. Now all he had to do was get through the end of term exams.\n \n“Weasley, what would I get if I added powdered gundleroot to a shrinking concoction?” Weasley gaped at him, and Severus rolled his eyes. “Nothing to say? I suppose it was optimistic to hope for an intelligent response.” He spun to face the Slytherin side of the room.\n“Mr Malfoy?” Draco glared at him, and crossed his arms. Severus frowned. Draco could usually be counted upon to answer. “No?”\nDraco opened his mouth to speak, and nothing came out.\n“Someone silenced him, sir, and no one can remove it,” Greengrass explained.\nSeverus wondered if he should feel guilty for leaving Draco silenced for nearly a week, but found it rather amusing that none of the older students had felt inclined to help.\n“Finite.”\n“About time!” Draco hissed, and every face in the room fell as he regained his voice. Not even a single Slytherin seemed pleased that he could speak once more. “And it would explode… obviously.” \n“Five points to Slytherin,” Severus awarded. Draco might have been a little twerp, but at least he knew his potions.\nHarry flopped onto a seat on the Hogwarts Express, feeling like he been runover by a dragon.\n“That potions exam was vicious,” he muttered.\n“Oh, I can’t remember if I included the fifth step in creating a forgetfulness potion!” Hermione worried, rifling through a book.\n“Eh,” Ron said. “At least they’re over now.”\nThey were done. It was end of term, they’d finished exams, and Harry was about to spend his first summer holiday with Sirius. He couldn’t wait.\n“Isn’t there a quicker way to get back to London than this?” he complained. Hermione opened her mouth to speak, but surprisingly it was Ron who answered.\n“The Knight Bus will take you anywhere really fast, but not everyone would fit on it. Mum used it a lot when we were kids. You just raise your wand, and think of trying to get somewhere.” Ron shuddered. “It’s a right joke though, though I was gonna die last time I was on it. Not worth it.”\nHarry huffed. “Stupid magical transportation.” Baneofallrodents stroked his cheek with her tail to soothe him.\nThe mirror in his pocket buzzed, and Harry withdrew it.\n“Sirius?” His godfather was looking entirely too panicked for anything good.\n“Pettigrew’s escaped!” Sirius growled.\n“Oh no, oh no, oh no!” Ron shrieked. “He’s coming for me! After all this time sleeping in my bed, he’s coming for me again, oh no, what am I going-“\n“Stupefy,” Harry muttered, and Ron collapsed to the floor. “Please, Sirius, continue.”\nSirius’ lips twitched in what Harry thought was amusement. “Did you just stun Ron?”\n“If I say no, will you believe me?”\nSirius grinned. “I suppose I’ll have to.” Hermione was quietly snickering in the corner. She levitated Ron onto a seat so that he was slumped over ‘asleep’. “Now, be on your guard when you get off the train. Remus and I will be waiting for you under the sign for the platform, so come straight over, okay?”\n“Roger that,” Harry said, and slid the mirror away. Hermione picked up a book, and Harry grabbed one of his own, hoping he’d be able to enjoy a peaceful ride back to London before becoming immersed in the chaos of living with Sirius.\n“Potter!” Malfoy spat, barging unannounced into their carriage. Harry sighed.\n“We’re busy right now, Malfoy, so just go away.” He made a shooing motion with his hands. “We’ll assume that whatever it was that you came in to say was suitably witty and your goons cackled in amusement while I flushed with indignant embarrassment and rage.”\n“I-what?” Malfoy said.\n“Yes yes, you’re very scary, off you pop now.” Harry flicked his wand and a blast of wind blew Malfoy out of the room and into the corridor, slamming the door shut behind him. “Colloportus,” Harry muttered and the lock clicked shut. The door knob rattled several times, but eventually Malfoy stalked away.\nHermione gave him an appraising look.\n“You’ve really improved with your studies lately.” Harry flushed. “Were you holding back before?”\nHarry smiled weakly. “Well. I wouldn’t say holding back… exactly,” he hedged.\n“Harry James Potter!” Hermione growled, and Harry was lectured about academic achievement and reaching his potential all the way to Kings Cross. He even considered waking Ron up, but realised that just meant two of them would have to suffer. He then considered jumping out of the carriage window, but figured he was just making Voldemort’s job easy for him.\nBy the time they reached the station Harry was more than ready to get off the train. Ron had woken up halfway through the rant and was curled up in a corner with his hands over his ears, whimpering. Harry wasn’t far from that state himself.\n“See you in a couple weeks!” Harry yelled, and grabbed his trunk, running off the train.\n“Sirius, thank Merlin, you have to save me!” he cried as he almost instantly ran into his godfather. Sirius sneered and Harry frowned. “Wait-“\n“Morsmordre!” Sirius cried, pressing a scarf to Harry’s neck. Immediately it felt as if something had hooked about his navel and yanked. Harry yelled as he was pulled through space, and he landed on the ground with a thud. He rolled with the movement and came up with his wand in his hand.\n“You’re not Sirius,” Harry said. Polyjuice, perhaps? Sirius’ doppelganger grinned, and licked his lips. A jet of light flew from his wand and Harry ducked, hiding behind a massive stone. As Harry glanced about he realised he was in a graveyard, nowhere he’d ever been before.\nSuddenly, there was a burst of pain on his forehead and Harry screamed, clutching his scar.\n“Master?” Baneofallrodents hissed. Harry fell forward and curled up on the ground. The pain was fading but it was still there, as if his scar was being created anew, splitting his skull apart.\n“Run and hide,” he replied through gritted teeth and she slithered away.\nHis wand was snatched from his grasp, and Harry was bound to a stone angel. He squirmed, but the ropes only tightened, almost choking him. A cauldron bubbled before him and Pettigrew approached, holding something in his arms.\n“Ah!” the Sirius doppelganger cried, and clutched his leg. “A fucking snake bit me!”\n“There are only adders and grass snakes in Britain,” a sibilant voice hissed from the bundle in Pettigrew’s arms, and if Harry hadn’t guessed it was Voldemort before, he knew now for certain. “You will survive.”\nHarry squeezed his eyes shut and tried to ignore the blinding pain.\n“Eep!” Pettigrew shrieked. “It bit me too!”\n“Stop this nonsense!” Voldemort roared, although as he was currently inhabiting the body of a small child it was more of a squeak. “Ignore the bites, and return me to my former glory.”\n“Of course, master,” the Death Eaters replied and bowed to Babymort, then deposited him in the cauldron. Harry really hoped Babymort drowned.\n“Bone of the father, unknowingly given,” Pettigrew rasped, and a thin trickle of bone rose from the ground and flew into the cauldron.\n“Flesh of the servant, willingly given.” Pettigrew raised a knife, and his own hand, and sliced it off. Harry flinched and looked away from the bloody stump.\n“Blood of the enemy, forcibly taken.” Pettigrew dug the knife into Harry’s arm, even as his own fingers trembled.\n“I give it freely!” Harry cried, but Pettigrew merely snarled at him, dripping the blood into the cauldron. Immediately it began to boil.\nThe Sirius doppelganger was swaying on his feet, and Pettigrew had already collapsed.\n“Baneofallrodents, get my wand!” Out of the shadows Baneofallrodents appeared. She tripped the doppelganger, then wrapped her tail around Harry’s wand and slithered over to him. Harry grabbed it.\n“Diffindo.” He cut the ropes and scooped Baneofallrodents up. While he’d been planning his escape, Voldemort’s body had been forming from the cauldron.\n“Robe me,” Voldemort demanded. Harry sprinted away toward the nearest country path. “Wormtail? Barty! POTTER!”\nHarry raised his wand. “The Knight Bus!” he yelled, hoping it would work.\nWith a loud honk an enormous purple double decker bus appeared from out of nowhere.\n“Welcome to the Knight Bus. Emergency transport for the stranded-“\nHarry leapt on board. “Go! Go! Go! He’s trying to kill me.”\nThe conductor blinked, looking up from the notecard he was reciting from.\n“Wut?” A flash of red light flew toward them. Harry ducked and it crashed into the seat behind him, which shrivelled and curled in on itself.\n“Oh bloody ‘ell, go Ernie go!”\n“Take it away Ern!” Was that a talking skull?\nBANG.\nHarry was thrown to the floor as the bus shot forward.\nThe conductor sniffed. “As I was sayin’. Welcome to the Knight Bus. Emergency transport for the stranded witch or wizard. My name is Stan Shunpike and I will be yer conductor for this evenin’,” he said in a nasal voice. “Now, where is it that yer goin’?”\nHarry blinked. “Ministry of Magic, please.” He suddenly realised that his mirror was buzzing frantically, and had been for some time now.\n“Sirius.” Sirius’ eyes were wild, but a massive grin split across his face when Harry answered.\n“Harry! Oh Harry, thank Merlin you’re all right!”\nHarry grimaced. “Relatively... I was kidnapped! I’m on the Knight Bus to the Ministry. Shall I meet you there?”\nSirius nodded. “I’m there already!”\nThey jerked to a stop, and Harry handed over payment. He sprinted off the bus and into Sirius’ arms. Sirius squeezed him tight, and Harry hugged back. It felt like home.\n“You’re safe now,” Sirius muttered and patted Harry on the head. Harry took a deep breath and disentangled himself. Behind Sirius was a massive group of people including the Minister for Magic, Dumbledore, Snape, and the Weasleys.\n“Mr Potter,” said a woman Harry didn’t recognise, wearing a monocle and a stern look upon her face. “If you wouldn’t mind, I’d like to hear what happened to you. My office is just inside the building.”\n“Oh yes, excellent idea Amelia,” Minister Fudge said. Harry realised that she must be Amelia Bones, Director of the DMLE. He nodded. Sirius and Dumbledore followed hot on their heels.\nDirector Bones’ office was a tight fit, but Dumbledore conjured enough chairs for everyone. She called for a healer, and St. Mungo’s sent one right over. Harry’s arm was healed, and he was given a blood replenisher. Finally, they were all settled, and she gave him an expectant look.\n“It’s all right Harry,” Sirius whispered. “Just take your time.”\nSlowly, quietly, Harry regaled his tail.\n“Codswallop!” Fudge announced at the end.\n“Are you accusing the Heir of House Black and House Potter of lying?” Sirius hissed.\nFudge gulped. “It can’t be true! He can’t be back!”\n“May I inspect your memory?” Director Bones asked, ignoring their arguement. Harry nodded, and tilted his head. She withdrew a silvery stream of liquid from his mind and placed it into a vial.\n“I refuse to believe You Know Who is back!” Fudge cried.\n“He might not be,” Harry spoke up. Fudge gazed at him, an expectant look upon his face. “It was definitely him, but my snake had bitten both Pettigrew and Barty, that’s why they collapsed. She’s an Eastern Brown Snake, and the venom is quite fatal.” Baneofallrodents chose that moment to poke her head out from underneath his shirt and Fudge jumped back in surprise, nearly toppling to the floor.\n“They tasted like rotten rodents.”\n“Pettigrew used his hand to regenerate Voldemort… he may have passed the poison in his blood stream onto Voldemort.” Director Bones gave both him and Baneofallrodents an appraising look.\n“There you go, Minister. Perhaps we should put the Aurors on high alert, just in case.”\nFudge huffed. “Do as you wish,” he snarled. “But I will not believe that You Know Who is back.”\nHarry glanced at Sirius and raised his brows. Sirius rolled his eyes.\n“My Heir, Harry Potter, The Boy Who Lived, was still kidnapped. So, regardless of whether You Know Who is back, we need better security. The public will think you wise for putting precautions in place,” Sirius said. Fudge nodded, his forehead creased into a frown.\n“Yes, yes, the public will think that won’t they... Yes, Amelia, put the Aurors on high alert. We cannot have an incident like this happen again!” Fudge bid them all good day, and stormed out of the room.\n“Come on Harry,” Sirius said. “Time to go home. May we use your floo?” Director Bones nodded, a frown upon her face.\n“Dark times are upon us,” she muttered. “Stay safe.”\n \nFor the first time in eleven years Severus felt something that chilled him to the bone.\nHis mark was burning.\nHarry ambled down the stairs for breakfast, Baneofallrodents curled around his waist. She refused to leave him alone since his kidnapping. He wasn’t going to object. She had likely saved his life.\nMimsy had cooked pancakes for breakfast, and Harry tucked in. There were loads left, and he realised he must have beaten Sirius to the table, an unusual set of circumstances. There was a slam of a door, and Harry grinned. He hoped into the pantry, pulling the door shut behind him. He’d wait until Sirius was sitting down, then jump out and surprise him.\n“Please, take a seat,” Sirius said, and Harry froze. “Coffee, tea, anyone?”\n“I’ll have tea, milk, two sugars,” Dumbledore said.\n“Black coffee,” Snape snapped.\n“Coffee for me as well, thank you Sirius,” McGonagall said. Harry debated his options. Jump out, or listen to them?\n“So, Severus, what’s your report?” The decision had been made for him. How could Harry resist such an enticing invitation to eavesdrop?\n“The Dark Lord called me two days ago. Both Pettigrew and Barty Crouch Jr were dead.”\n“Crouch Jr?” McGonagall exclaimed.\n“The Dark Lord did not see fit to elucidate me on the means of his survival and escape of Azkaban, and it is currently irrelevant,” Snape drawled. “I believe Potter’s snake poisoned them both, and the Dark Lord too. However, Nagini’s venom was used in the Regeneration Potion, so he has a small immunity to poisons, which is why his body has not entirely deteriorated. He believes Pettigrew screwed up the ritual, and the fumes from the potion killed him and Crouch. Obviously, I have not disabused him of that notion. I have been providing him with various potions, but none of them should counter the venom, and so he will remain weak. He has called no one else to him, but Lucius is getting suspicious as the Mark has darkened.”\n“Serves the wanker right,” Sirius growled. “Teach him to kidnap my godson.”\nHarry grinned. Go Sirius!\n“So, Albus, are you finally going to tell us your ideas on the remaining horcruxes?” McGonagall said. Harry frowned. What on earth was a horcrux? Whatever it was, it couldn’t be good.\n“Now Minerva, it is essential that Harry be the one to find these items, even if we must guide him down that path.”\n“DING!” Sirius shouted. “Ding-a-ling-ding.”\n“Unfortunately, I agree with Black. Hunting down pieces of the Dark Lord’s soul is no job for a child,” Snape interjected. Harry bit his lip to keep himself from shouting out in agreement. Dumbledore was completely barmy! He hadn't even realised it was possible to lose pieces of his soul.\n“Don’t you dare try to feed us some cock and bull about a prophecy,” Sirius snarled. “Tell us, or I’ll feed you truth potion myself.”\nThere was a long pause in which Harry could imagine Dumbledore’s outraged look. He almost hoped they did feed him veritaserum.\n“And I’d help him,” Snape said, and Harry grinned.\nDumbledore sighed. “Very well. The new wards have detected the presence of a horcrux with in the school.”\n“And you didn’t think to tell us!” McGonagall screeched. “You’ve finally lost it!”\n“We’ll collect that later. Continue,” Sirius said.\n“I believe them to be items from Voldemort’s past, stored in places of great importance to him. Most likely three; the book, a locket that once belonged to his mother, and a ring that belonged to his grandfather. The book was given to his most trusted follower, Abraxus Malfoy, passed onto his son, Lucius. One item is evidently stored in the first place he called home, and one item stored somewhere relevant to his history. Perhaps the town his parents grew up in…”\n“You’re a bloody fool, Albus Dumbledore, keeping this to yourself,” McGonagall growled. “Let’s go get them.” There was a scraping of chairs, and the four of them left the room. Harry waited until he heard them all leave, and he sneaked out of the cupboard.\nSoul pieces, a prophecy, and an interfering old man. Harry had some research to do.\n \nSeverus eyed the locket, sitting proudly on a podium in what the elves called the Come and Go Room. They’d had to enlist their help, unable to find the specific part of the castle the wards indicated.\n“Do the honours, Snape?” Black said. Severus sneered.\n“I think, perhaps, we should examine it before attempting to destroy it,” Albus said.\n“Avada kedavara,” Severus growled, already fed up with Albus’ nonsense.\n“Oh!” Albus said. The locket screamed, black smoke exploding from it, filling the room, before tearing itself apart, throwing them all to the ground in the process.\n“Severus! I am most disappointed – ouch!” Albus said. Minerva had flicked her wand, and hit him with a stinging hex.\n“You shut your big gob else it gets you into some more trouble you obnoxious arrogant senile fool!” she spat, her Scottish accent more pronounced than usual. Severus raised a brow, quietly impressed.\n Black grinned. “Nice work,” he said. Severus sneered.\n“Always,” he retorted, but his disdain didn’t diminish Black’s cheer.\n“Two down, one to go!” Black remarked gleefully. “Come on then, let’s go explore his parents' digs.”\nSeverus rolled his eyes but followed Black out the room, Minerva and Albus hot on their heels.\nIt took very little time to exit the school and apparate to Little Hangleton, and Severus realised with horror that he recognised the area. He disillusioned himself immediately.\n“Albus! The Dark Lord inhabits the Manor across from here!” he growled. Black and Minerva moved closer and they hid themselves in the shade of an oak tree.\n“Ah, yes, I suspected as much,” Albus said, eyes twinkling merrily. Severus cancelled the disillusionment charm so as to glare at Albus properly.\n“And you didn’t think to warn us!” Black hissed, and Minerva had a similarly incredulous look upon her face. Severus took several deep breaths to gain control of his emotions.\n“Well, it’s not as if we’re going to be knocking on his front door,” Albus replied.\n“Near enough,” Severus muttered. “Just lead us to the bloody horcrux.” Why did their only source of knowledge have to be an insufferable, delusional old man?\nThey followed Albus up a winding dirt path that lead away from the village. It was over grown and had obviously not been used in some time. Eventually they came across a small, rundown shack. Severus fancied he could feel the malevolent aura of the horcrux even from outside. There was a dead snake nailed to the doorframe, and as Albus stepped toward over some unseen barrier it came to life.\nWith a flick of his wand Albus dispatched it before it could do more than hiss, even the bones disintegrating to ash.\n“Both of you wait outside,” Severus instructed. He cast several detection spells, but the only ward he could find was the one that activated the snake. He followed Albus into the shack.\nMould covered the walls, and the furniture was in rotten disarray. Albus had his wand raised in silent detection spells, and he eventually pointed to an unassuming piece of floor. With a jerk of his wand the floorboard was ripped up, and there sat a steel box. Severus levitated it out of the hole and began slowly breaking down the curses that it was covered with. Finally, he got the container open.\n“Ariana!” Albus cried, and fell to his knees, scrabbling at the box. Severus reacted instinctively, summoning the horcrux toward him and banishing Albus away from it.\n“You cannot have it!” Albus growled, and lightning crackled toward him from the end of Albus’ wand. Severus threw himself to the side. He crashed into the shack wall, breaking through the rotten wood.\n“Get a hold of yourself!” Severus cried. He got to his feet and threw up the most powerful shield he knew, barely deflecting the next curse that came his way. Black and Minerva were at his side in an instant. Albus staggered out of the shack, wand raised. Another curse lanced toward them, but fizzled out halfway. Albus was staring at his wand in horror. He threw it away from himself, and his questionable sanity seemed to have restored itself.\n“My apologies. It seems I am unusually susceptible to compulsion of that kind,” Albus said quietly. Severus took a moment to get this breath back before casting several containment charms upon the steel box.\n“Of what kind, exactly?” Black questioned suspiciously. Albus’ shoulders sagged. With a wave of his wand the shack was restored to its previous state.\n“Perhaps I should inform you after it’s destruction?” Severus huffed, but didn’t disagree. “Although… I don’t suppose you’ll allow me to examine it?” Severus narrowed his eyes.\n“I think, perhaps, you ought to leave, Headmaster, as you seem to be unable to fully resist this object’s charms,” Minerva said.\nAlbus nodded sharply, and with one last glance at the box Severus was clutching to his chest, he disapparated.\nSeverus placed the box on the dirt, and in one instant, removed all the containment charms and opened it up. In the middle sat an ugly ring, with a gold band and a large brown stone set into it.\nGrey smoke poured out of the stone, slowly forming a body.\n“Oh Sev, don’t you want to see me again?” Lily asked as her features formed. “All you have to do is put on the ring.” Severus stared at the beautiful features of his one true friend, the only woman he had ever loved, and the mother whose child he was protecting. Surely it was only right that Severus saw her every day? Black made a choking noise and staggered forward, and the inhuman apparition twisted in on itself and reformed.\n“Padfoot! So good to see you old chap. Can’t stay for long, but you’ll always be able to see me if you just put on the ring,” James Potter remarked cheerfully. “Don’t you think Harry would like to see his parents?” Severus shook himself, and narrowed his eyes at his hated enemy. Black was sobbing, and he lurched toward the ring even as Minerva attempted to hold him back.\nHow dare the Dark Lord use their losses against them.\n“Avada kedavra!” Severus snarled. Green light lanced toward the ring and the apparition screamed. Black smoke boiled out of the ring, reaching toward them before wailing as it converged into on itself and exploded.\nThe ground where the horcrux had laid was brown and barren. At the very centre was the stone that had been set into the ring, and it twinkled at them eerily. Severus didn’t dare pick it up, but it levitated it into the air and blasted it away from them. It flew into the foliage behind the shack, and Severus turned his back on it.\nBlack was a sobbing mess, and Severus wasn’t far behind him.\n“Let us reconvene in 24 hours,” Severus said stiffly, and he disapparated back to the castle, in desperate need for a glass of whiskey and a good night’s sleep.\nHarry tried researching horcruxes, but could find absolutely nothing about them, so he gave it up as a lost cause. He trusted Sirius to keep him informed if necessary, and that was all he could do. The rest of Harry’s summer was rather uneventful, although he caught Sirius looking at him with tears in his eyes a few times. Harry made sure to prank him extra hard on those days, and he soon cheered up. As much as Harry loved messing around all summer, he missed his friends and he missed Hogwarts, and so he was delighted when September 1st came around.\nHarry was seated next to Remus, who was apparently teaching Defence for the year.\n“Harry!” Hermione screeched as she entered the carriage and threw her arms around him. Harry patted her on the back awkwardly.\n“Hey Hermione. Hey Ron!” he said, spotting the other boy over Hermione’s shoulder. Ron grinned and waved back, throwing himself into a seat. It didn’t take long for them to settle and begin sharing stories about their summer.\nThe sorting felt as if it was taking forever, and he joined Ron, for once, in groaning with joy when the food arrived at their tables.\n“Bout time,” Ron muttered around a mouthful of potato he’d picked up with his hands and jammed into his mouth. Globs of gravy ran down his face, and Harry couldn’t look away, watching with morbid fascination at the amount of food he managed to consume within seconds.\n“Ron! Mind your manners!” Hermione scolded. Several first years were also transfixed, and one particularly small girl looked as if she was about to faint.\nBANG! The explosion drew the attention away from Ron. Seamus was grinning ear from ear, his eyebrows burnt to cinders and parts of his hair and uniform still flaming. He held up a goblet.\n“Finally!” he cried, and took a swig.\n“Mr Finnegan!” Professor McGonagall appeared behind him, and despite the scorched appearance Seamus still managed to pale. “What in the name of all things do you think you are doing?”\nSeamus took another swig of his goblet before turning to face her. McGonagall’s eyes narrowed as she inspected the cup clasped in his hand, and she swiped it up and away from him.\nShe took a sniff. The entire hall watched with bated breath.\n“An excellent water to rum transfiguration,” McGonagall allowed. Harry cheered, even as Hermione glared at him. “Unfortunately, consuming alcohol is illegal for minors. Twenty points from Gryffindor. Don’t do it again.” Seamus turned back to the table, a mischievous grin upon his face. Several upper year students were eying him contemplatively, and Harry used the following uproar as they tried to buy the spell from Seamus to slip away.\n“About time, Master,” Baneofallrodents hissed from her perch on his shoulders.\nHe raced towards Moaning Myrtle’s bathroom, and opened the passage to the Chamber of Secrets with a hiss.\n“Sally! It’s Hassa and Baneofallrodents!” There was the faint sound of scales scraping on stone, and Sally poked her head out of the pipe, her second eyelids firmly shut.\nThere was a loud scream behind them. Harry turned, wand drawn. Malfoy had both hands clasped over his mouth, but it did nothing to diminish the girly shriek. His eyes rolled up into his head, and he collapsed into a dead faint. Harry poked him with his foot, but he didn’t move at all.\n“Oops!” Harry muttered, and levitated Malfoy out of the bathroom. “Forgot to lock the door,” he realised. “Colloportus.” He turned back to the basilisk.\n“How was your hot season?” Sally asked.\n“Fun and filled with lots of food. Did the elves bring you the snacks I asked them for?”\n\n“Yes, although they ran away whenever I tried to speak to them.”\n\nHarry barely manage to contain a laugh.\n“I can’t imagine why,” he replied. He stroked her large nose. “I’ll come and talk to you when I’m next free, but I better go before Malfoy wakes up.”\n\n“If he gives you any trouble, send him to me, and I shall eat him for you.”\n\nHarry grinned. “Thanks Sally. See you soon.” Her head retreated and Harry closed the entrance up once more. He could hear the sound of voices outside, and so pulled on his cloak before leaving the bathroom.\n“For the last time Draco, what have I told you about telling tales about Potter?” Snape growled. Malfoy was quivering under his glare.\n“But sir, I’m telling you, it was a basilisk!”\nHarry crept past them so that he was behind Snape’s back.\n“Enough!” Snape roared. “Detention!”\nHarry lowered the hood of his cloak, and winked at Malfoy. Malfoy gaped.\n“He’s right there!” Malfoy cried. Harry pulled the hood back up and Snape spun around. He narrowed his eyes and turned back to Malfoy once more, who’d gone paler than snow.\n“Detention for the rest of the week,” Snape said quietly in a voice more terrifying than when he shouted. “Now begone!”\nHarry sneaked away, laughing silently to himself. Served Malfoy right for being such a prat.\n \n“I’m worried about Draco Malfoy,” Severus admitted at the first staff meeting of the year. “His jealousy of Potter knows no bounds. Several times he’s come to me with fabricated excuses for getting Potter into trouble, and although you all know how much I’d like that to be true, the stories he comes up with are ridiculous.”\nAlbus frowned. “Like what, my dear boy?”\nSeverus sneered at him.\n“The dragon that in first year Potter was apparently smuggling off the grounds. The polyjuice Potter had apparently brewed. The time Potter apparently hid in Lockhart’s office and escaped through a hole in the wall that disappeared before I could even see it. The girl’s bathroom Potter apparently spends his time in. The basilisk that Potter apparently has at his disposal! It’s ludicrous. He’s seeing Potter when he’s not even there. I think he might be delusional,” Severus concluded.\n“That is most worrying,” Albus agreed. “Perhaps we should have a discussion with him this evening?” Severus nodded his approval. “Now, moving on. Any other matters we need to discuss?”\n“Seamus Finnegan has finally discovered how to transfigure water into rum,” Minerva said. Severus bit back a groan. Every few years a dedicated student managed to create alcohol, and the resulting year was chaos.\n“Obliviate him,” Severus suggested. Albus frowned at him over his half-moon glasses in disappointment. Minerva pursed her lips, and Severus was certain she was holding back a smile.\n“That’s unethical, I’m afraid,” she said.\n“You’ll all have to keep an eye on your older students this year,” Albus said. “And Minerva, please impress upon Mr Finnegan the importance of keeping that spell to himself.”\n“Fat lot of good that’ll do,” Minerva muttered.\n“Did anyone see where Harry disappeared to during supper?” Lupin piped up. Severus turned to glare at the werewolf. Lupin smiled mildly back at him.\n“Probably getting up to some sort of mischief,” he growled.\n“Undoubtedly. He’s a thirteen-year-old boy,” Lupin agreed.\n“I saw him in the Gryffindor Common Room earlier,” Minerva offered. “Whatever he was doing, it was brief.”\n“Thank you, Minerva,” Lupin said.\n“Is there anything else that ought to be brought to my attention?” Albus asked, and a litany of denials answered him. “Very well. Thank you all for coming, and good luck with your first set of lessons tomorrow. Poppy, would you mind staying behind? And Severus, would you be as good as to fetch Draco for us?”\nSeverus nodded and departed to find his troublesome student.\nPoppy was waiting quietly in one corner and she cast a few subtle diagnostics as Draco walked in. Severus glanced at her, but she shook her head; nothing wrong with him, as far as she could tell. Draco was glancing nervously about the office, his eyes darting between the three of them.\n“You asked for me, Headmaster?”\n“Yes, my boy. Please, take a seat,” Albus said. Draco settled into the seat before the desk, looking tiny against the large wooden chair. “Now, Severus has come to me with concerns that you’ve been seeing things that aren’t there.”\nDraco’s jaw dropped and he turned to glare at Severus.\n“No sir! It’s all true! I’m not imagining things, I know it!”\n“Perhaps the best way to settle this would be for us to view the memories with you?” Albus suggested. Severus nodded. A sound idea.\n“How?” Draco demanded. Albus frowned, but stood to retrieve his pensieve.\n“This is a device that will allow us to extract your memories and view them as if we were standing next to you. Think of the times you believe to have seen something that no one else has.” Draco grimaced, obviously deep in thought. Albus placed his wand against Draco’s forehead, and withdrew a long string of memories, placing them into the pensieve. Both he and Albus plunged forward into the liquid.\nAs Severus watched each memory, inspecting it for signs of duplicity, his anger grew and grew. Eventually he fell out of the pensieve to be greeted by Draco’s smug grin.\n“I told you so,” Draco said, while Severus was still trying to find words to describe his anger. Albus was chuckling beside him.\n“POTTER!” he bellowed. “I’M GOING TO KILL HIM!” He could feel his eye twitching, and his blood boiling, and his heart felt like it was going to explode. There was a piercing pain skewering his mind and he was swaying where he stood.\nHe took a step forward. The pain reached a crescendo, and his brain was shrinking, compressing, dying. His vision tunnelled, and then everything went black.\n“You killed Professor Snape!” Malfoy bellowed as Harry walked into the Great Hall for breakfast. The whole room fell silent, and expectant eyes turned upon him.\n“I have an alibi for the last 24 hours,”  Harry said quickly, but then he smirked at Malfoy. “But please, elaborate.”\nThe morning post arrived before Malfoy could continue, and Hedwig swooped down with a letter, landing on his shoulder.\nIt was a howler. Harry nudged it open with the tip of his wand.\n“I’M SO PROUD OF YOU!” Sirius’ voice boomed. “SNAPE’S IN THE HOSPITAL WING AND YOU LOST MORE POINTS IN A DAY THAN I MANAGED IN A YEAR. KEEP UP THE GOOD WORK, KIDDO.” It burnt itself to pieces.\nA great cheer erupted around the room, and Fred and George set off some fireworks that exploded in red and gold sparks. People ran over to him, clapping him on the back; Oliver Wood and another sixth year boosted Harry up onto their shoulders. Harry accepted their tributes, as was his due.\nThere was a loud bang, and all the fireworks vanished; the Weasley twins booed their dismay. Dumbledore was standing at the podium in front of the teachers table.\n“If I may have your attention.” Reluctantly the room fell silent, and Harry jumped back down to the floor.\n“Professor Snape is merely suffering from a brief illness. He will be back to teaching classes in no time, as I’m glad you will be happy to hear.”\n“What a let-down!” someone from Hufflepuff yelled, and sniggers echoed around the room.\n“Now, if you could please return to your breakfast in an orderly and well-mannered fashion, that would be much appreciated.”\nDespite their disappointment in discovering that Snape was still alive, all the Houses bar Slytherin were celebrating, and Gryffindor didn’t even care that Harry had lost over five hundred points for keeping a basilisk in the school (amongst other things). He was being treated like a hero, and while he felt vaguely guilty he was also smug that he’d finally gotten to Snape.\nIn fact, he felt like a true son of a Marauder. Following the Howler, Sirius had written him a long and flowery letter singing Harry’s praises. So, of course, that meant it was time for another prank.\n“Harry, they’re saying Snape’s in the hospital wing because of you! He had an aneurysm,” Hermione exclaimed. She’d been late to breakfast, and had missed the announcement.\n“I know, isn’t it great!” Harry replied. Hermione recoiled, and Harry thought back on his last sentence.\n“What, no!” she cried.\n“I know, isn’t it awful!” Harry corrected, crossing his fingers behind his back. Hermione narrowed her eyes at him, but didn’t say anything. “So… I’ve been thinking…”\n“Oh no,” Hermione groaned.\nHarry huffed. “Rude,” he muttered. “Anyway, I’ve been thinking, that with a little help from Fred and George...” He wiggled his eyebrows at Hermione, who sighed.\n“Prank time,” she said, sounding about as unenthusiastic as Ron faced with homework.\n“Prank time?” one twin said, popping up next to Harry.\n“Sound like our kind of thing,” the other twin said, from next to Hermione. They grinned, and Harry grinned back.\n \nSeverus had been out of the hospital wing for two days, with instructions to keep his blood pressure down. He fumed at the utterly useless advice, stalking back and forth within his quarters. At least it gave him an excellent reason to quit his job as a teacher once the Dark Lord was finally dead.\nSeverus patted the vial of basilisk venom hidden in his front pocket. He’d had Albus instruct Potter to extract it, the one good thing to come of the entire situation. The boy had barely been punished! He’d been all for letting Filch get out the thumbscrews.\nPain lanced up his side and Severus hissed, clenching his left forearm with his right hand.\nThe Dark Mark was burning.\nSeverus flooed Albus. “He’s calling.”\n“Good luck,” Albus said, a solemn look in his eyes.\nSeverus flooed to the Three Broomsticks, then apparated to Little Hangleton The Dark Lord’s wards prickled as he passed through them, testing him for the Mark. He swept up three dusty stair cases, the once red velvet runner tattered and worn, and into the master bedroom. The Dark Lord was sitting as his desk, looking as if he’d just forced himself from bed.\n“Ah, Severus. You have my potions? How was the first week back with those miserable little cretins?” he drawled.\nSeverus bowed, and the Dark Lord graciously allowed him to his feet. “I have your potions, my lord,” Severus said. “Dumbledore and his ilk are as annoying as usual, and Potter is being his normal spoilt self.”\n“They’ll get theirs… all in good time,” the Dark Lord hissed and he fingered his wand. Severus took a deep breath, and handed the Dark Lord his first potion.\n“Blood Replenisher, Pepper Up, Strengthening Potion, and a Nutritional Supplement.” The Dark Lord swiped each potion from him and drank it down quickly, grimacing at the taste. Severus clenched his hands behind his back as he handed the last one over. He could feel a bead of sweat forming on his brow.\n“Very good, Severus… you are my most faithful – ARK!”\nThe Dark Lord was clutching his throat, the empty vial of basilisk venom in his hand.\n“Expelliarmous!” Severus cried, and snatched the Dark Lord’s wand away as he fumbled with it. The Dark Lord – Voldemort – stared at him incredulously.\n“Severus?” he croaked.\n“All your horcruxes have been destroyed!” Severus gloated. Voldemort paled, and his eyes bulged.\n“Nooo!” Voldemort gargled, collapsing to the floor. “It burns, it burns!” he hissed, writhing about and scratching at the carpet, his breath coming laboured pants. Severus watched with distaste, and vague amusement.\n“Mummy!” Voldemort cried. And then he died.\nSeverus took his time walking back down the stairs. He was admiring his forearm; pale, unmarked skin, a little red, perhaps, but it was free from the vile design that had covered it for so many years. He sent off a spell that would alert the aurors to trouble, and sat on a bench in the garden and waited.\nA girl with bubblegum pink hair and a loud voice arrived with Kingsley Shacklebolt.\n“Voldemort’s body,” Severus said carefully, “is in the master bedroom of this house.”\nThe girl’s hair turned bright green, and her jaw dropped. Shacklebolt, luckily, was more professional.\n“Go get Madam Bones,” he snapped at the girl. Severus recognised her now; Nymphadora Tonks, mediocrely good at potions for a Hufflepuff.\nSeverus proceeded to engage in a staring competition with Shacklebolt that he knew he was going to win. He’d stared down Voldemort, Albus, and Minerva. Shacklebolt simply wasn’t intimidating. Shacklebolt sighed as if he’d realised that, and looked away.\nCRACK!\nMadam Bones, Nymphadora Tonks, four other aurors, Minister Fudge, Rita Skeeter and her photographer arrived. There was an extremely put upon expression on Madam Bones’ face.\n“It was merely a potions mishap,” Severus began, “gone awfully wrong…”\n \nYOU-KNOW-WHO GONE FOR GOOD!\nINTERVIEW WITH THE HEROIC SEVERUS SNAPE\nTHE POTIONS MISHAP THAT SAVED US ALL!\nBy Rita Skeeter\n\nUpon arriving in Little Hangleton, a small muggle village in Yorkshire, I was greeted by the hero of the hour, Severus Snape. He looked at me, and I swore I could feel him gazing into my very soul, his fathomless eyes so full of emotion it made me shiver. \n\n\nHe painted a striking figure, dark robes draping off his broad shoulders that set off his roguish good looks and smouldering charm. Of course, dedicated journalist that I am, I knew I needed to dig deeper than superficial impressions to discover the truth about You-Know-Who’s defeat.\n\n\nRS: “How did you come to know the location of He-Who-Must-Not-Be-Named?\n\n\nSS: “As recorded in the transcripts for my trial in ’81, I have spent the last twelve years working as a mole for Albus Dumbledore. When He-Who-Must-Not-Be-Named regained a body, I returned to his side as a spy and he thought me his most faithful. Unfortunately, I swapped out a simple Nutritional Supplement for a vial of Basilisk Venom I was carrying around with me, quite by accident, and so he perished.”\n\n\nRS: “By accident!” I was in shock when the daring Professor Snape finished his story. “Surely you don’t mean to tell me that you mistook Basilisk Venom for a Nutritional Supplement by accident.” \n\n\nSS: “That’s exactly what I said.” I fanned myself; Severus was so brave he hadn’t even meant to defeat You Know Who; it had just happened! I found myself to be flustered by his very presence. Finally, I pulled myself together in order to ask the question we’ve all been wondering:\n\n\nRS: “Did he have any final words?”\n\n\nSS: “He merely expressed his regrets that he did not get a chance to spend more time with his family.”\n\n\nA motto that I think we would all do well to adhere to, I’m sure my kind readers would agree!\n\n\nRS: “And what are you going to do with your life now?” Severus had only just turned down Minster Fudge’s offer of a position with the aurors, and my own suggestion that he hire me to write his biography.\n\n\nSS: “I’ll finish the term at Hogwarts, then retire somewhere no one like you can ever find me.” I laughed gaily.\n\n\nRS: “You wound me!” I joked, throwing him a coquettish glance, which he seemed entranced by.\n\n\nSS: “I’d like to,” he muttered, and I chuckled. Severus was such a joker!\n\n\nMe, myself and I have formed a special sort of bond with Severus Snape, and I can tell that’s he’s going to be a regular heartthrob. Ask yourself, ladies; has your hubby ever defeated a Dark Lord? Severus Snape has! And he’s still at Hogwarts until Christmas. But get in line: I saw him first!\n\nAlbus smiled to himself as he set down the paper, and twirled his beard around his fingers.\n“Pigs will fly the moment Severus Snape is declared a hero!” Harry Potter announced, as he burst into the Great Hall. The students fell silent, waiting with bated breath as they watched Severus fume, and Harry grin.\nMoments later, the screaming began as all the work Harry and his friends had put into their latest prank paid off, and hundreds of pigs flew into the Great Hall, white feathered wings letting them take to the air.\n“POTTER!” he heard Severus bellow, followed by the sound of giggling children fleeing the room.\n“Save us, my devastatingly dashing hero, with your roguish good looks!” Minerva cried. Albus shot her a disapproving look even as Severus huffed and stalked away from the staff table.\n“Was that really necessary?”\nMinerva grinned. With a flick of her wrist she expanded the article and pasted it to the wall for all to read.\n“I am feeling rather flustered,” Pomona added, a gleam in her eye. A flying pig swooped low overhead and she banished it without bothering to look.\n“I rather think I’d suit coquettish,” Filius squeaked.\nAlbus sighed. He checked to see if Severus was still in the room; he wasn’t. Then he brandished his wand, and conjured a fan for each member of the faculty, including himself.\n“To Severus Snape, the hero!” Albus flicked the fan open, and waved it, allowing the breeze to blow his beard over his shoulder.\n“I think he’s finally snapped!” Minerva not so subtly whispered.\nAlbus merely smiled. Perhaps he had."
}