{
    "id": "7018549",
    "url": "https://archiveofourown.org/works/7018549?view_full_work=true",
    "author": [
        "supercrunch"
    ],
    "title": "May I take your order, dipshit?",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
    ],
    "relationships": [
        "Bakugou Katsuki/Midoriya Izuku"
    ],
    "characters": [
        "Bakugou Katsuki",
        "Midoriya Izuku",
        "Todoroki Shouto",
        "Kirishima Eijirou"
    ],
    "additional_tags": [
        "pizza delivery au",
        "deku attempts to flirt and surprisingly succeeds",
        "bakugou is salty and kirishima deserves an award"
    ],
    "language": "English",
    "series": "",
    "published": "2016-05-29",
    "completed": null,
    "words": "6,373",
    "chapters": "1/1",
    "comments": "778",
    "kudos": "16,485",
    "bookmarks": "3,319",
    "hits": "143,672",
    "summary": "<p>So, like, maybe Bakugou wasn’t really the best choice for this whole pizza delivery shindig. </p>\n<p>(Midoriya in love, Bakugou in denial, and way, way too much cheese. </p>\n<p>A BakuDeku romance in thirty minutes or less. )</p>",
    "notes": "<p>i like my fic how i like my pizza</p>\n<p>incredibly cheesy with a little bit of sausage.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>and they all lived happily ever after! at least until deku accidentally said 'kacchan' in front of kirishima. now everyone calls him that. deku's not allowed to call the restaurant again.</p>\n<p>anyway, i have no explanation for the blood orange thing. i just think todoroki'd be the kind of pretentious art student that would dye his hair in weird hipster colours to match his heterochromia and somehow manage to make it look cool.</p>\n<p>a note about the jordans: i'm not saying i'm obsessed with deku's shoes. i'm also not saying that i think they're 1984 retro air jordan 1's in red, premiering in 2008 with leather upper lining, tonal inset suede at the toe, lacestay and collar, and contrast grey on the inner-lining and chenille Swoosh, retailing at $115 at time of release</p>\n<p> but that's definitely what i'm saying.</p>\n<p>while i was writing this i had such a strong craving for pizza that i ended up calling Domino's. except, i wanted the two for tuesday deal, so i ended up ordering two large pizzas by myself, and long story short i think there's more pepperoni in me than blood.</p>\n<p>EDIT: PLEASE GAZE UPON <a href=\"https://msleilei.tumblr.com/post/145531842859/youre-unbelievable-you-know-that-first-a\" rel=\"nofollow\">THIS</a> WONDERFUL FANART! thank you so much, Lei!</p>\n<p>EDIT 2: alright okay you know what somebody asked me about Kacchan's stupid combat boots and i wish i had more pictures of it besides that ONE COVER ART but i did a bit of digging and to me it looks like they COULD be nike original special field boots in sage, mainly because of that fancy detailing on the side. Kacchan's look a little darker of course, but maybe that's the lighting??? idk.</p>",
    "text": " \n \nSo like, maybe Bakugou wasn’t really the best choice for this whole pizza delivery shindig.\nFucking whatever. It’s not like there’s anywhere in town that actually sells good food, so nobody’s expecting the local pizza joint to produce anything more than slightly edible. This whole stupid city is all skyscrapers and busy roads, but the only people who actually live here are either students or poor people. Usually both. Like Bakugou, really. Which is basically the only reason he’s standing here staring at a patch of mould on the ceiling instead of lounging around at home, a warm pizza box balanced in his hand as the other one pounds on the door.\n“Pizza,” he says very loudly. Doesn’t yell, because he’d yelled during a delivery yesterday and some old lady had come out of her house to hit him with a broom. Not that there are any old ladies here, probably. This looks like one of those shitty apartment buildings near UA campus that’s occupied mainly by undergrads. Bakugou knows this because it looks like his own shitty apartment building, which is also near UA campus and is occupied by Bakugou, an undergrad.\nHe bangs on the door again. He’s knocked like, three times in the past two minutes, and it’s only now that he hears a voice from inside. Briefly, he wonders if he can get away with knocking even after the door’s opened. Probably not. His manager puts up with his abysmal customer service because he’s being paid almost nothing, but even Aizawa might draw the line at rapping your knuckles against a customer’s face.\nThe door finally, finally swings open to reveal a boy on the other side of it looking harried. He’s got a mess of wild hair and bright green eyes. Seems a bit young to be a UA student, but whatever. “Sorry, sorry! I didn’t hear you coming.”\nBakugou wrinkles his nose at the earbuds wrapped around the boy’s neck. What kind of dumbass listens to music when he should be listening for the delivery guy, he wants to say, but decides it’s not worth the effort. “One large cheese pizza,” he drawls instead, looking at the receipt taped to the top of the box. “For Midoriya,” he squints at Kirishima’s shitty handwriting, “Deku.”\nThe guy at the door blinks. “It’s, uhm, Izuku, not Deku.”\nBakugou hands him the pizza. “Don’t care.”\n“…right. Right, yes, okay.” Somewhat hesitantly, Midoriya Whatever takes the pizza that’s shoved into his hands. “How much did I owe you?”\n“Hell if I know, check the receipt.”\nHis eyes really are very green. Bakugou notices this because he’s fixing him with a pretty stupid look, one that’s really perplexed but also sort of reminds Bakugou of a deer just about to be run over by a pick-up truck. “Are you not worried about me short-changing you?”\n“No, because I know where you live and I have no problem beating those cutesy freckles right off you.”\nWeirdly enough, the corner of Midoriya’s mouth quirks upwards. “Wow. Did you, uh. Do you know what customer service is?”\nBakugou snorts. “Not a fucking clue. You gonna pay me or what?”\n“Sure. Wait right there.” Still not-quite-smiling, Midoriya shuffles away from the door and goes off to set the pizza somewhere safe. Bakugou nudges the door open a little further with a foot; from what he can see, one side of the studio apartment is immaculately neat, and the other looks like a wardrobe threw up on the floor. “Right, here’s your cash. I have to tip you in coins, though, sorry about that.”\n“Money’s money.” Honestly, Bakugou’s surprised he’s getting a tip at all, seeing as he’s consistently horrible to everyone he meets, but he’s not about to look a gift horse in the ass. “Thanks. Enjoy your food poisoning.”\nMidoriya jolts a little. “Food poisoni—what’s that supposed to mean?”\nBakugou laughs at him and leaves.\n \n \n \n \n \n \nIn all honesty, he never expected to end up here again.\n“I’m actually kind of impressed,” he says to the squishy face poking out from behind the door. Midoriya’s in a bright blue hoodie today. Bakugou’s a little jealous. His uniform is a frankly itchy grey shirt with the company’s ugly logo on the front. And a cap, which he refuses to wear because it gives him hat hair that Kirishima never shuts up about. “Nobody’s ever ordered this shit twice. Did you actually eat the pizza or did you just give it to someone you don’t like?”\nMidoriya accepts the box with a grin. “It’s cheap and I don’t have a stove. I can suffer through a little food poisoning.”\n“You some kind of masochist?”\nMidoriya looks him up and down thoughtfully. “You know what, maybe I am.”\n“The fuck are you looking at me for when you say that?”\n“No reason.”\nHis smile is a little unreadable, and Bakugou wants to punch him. Which isn’t saying much, really, because Bakugou wants to punch most things, but right now Bakugou specifically wants to punch Midoriya. Only a little, though, because he still wants a tip. “If you’re gonna torture yourself, you might as well be a man about it. Get a real pizza, not one of those pussy cheese ones.”\n“I like cheese,” Midoriya says mildly. He wanders away from the door to get his wallet, just like last time, and Bakugou pokes his head in uninvited. Midoriya doesn’t seem to mind. He sets the pizza on the kitchen counter and picks up the wallet. “Plus, the cheese pizza is the cheapest one, you know?”\nBakugou calls bullshit. There are a pair of bright red Air Jordans sitting by the door, and those things cost half a month’s pay. Bakugou knows, because he’d been planning to get some himself. “Jobs are a thing that exist.”\n“Ah, yeah, I know. But I kind of prefer to live cheap and spend my free time studying, since working can be pretty tough.”\n“You can do both, you lazy ass. I do, and I’m doing just fine.”\nMidoriya grins at him again. It’s still annoying, making his eyes crinkle at the corner, and the stupid bastard looks like he’s about to fucking giggle as he wanders back to the door. What a loser. “Wow. That’s really impressive, actually. Are you in UA? What do you study?”\n“Chem eng,” Bakugou says without really thinking. “I like making shit go boom.”\nMidoriya’s weirdly happy about that. “Oh, cool! I guess that would explain why I’ve never seen you on campus, since I’m always on the other end. I do government planning and econs. Are you a second-year?”\n“Third.”\n“And you’re holding down a job? You’re good at this whole adult thing. I’m a third-year too and I can barely drag myself out of bed most days.”\nBakugou raises an eyebrow. “Huh. Looks like the whole Deku thing really suits you, huh?”\n“I told you, that’s not my name,” Midoriya says, although he doesn’t seem particularly upset. He’s taking his own sweet time fishing through his wallet, too, and Bakugou taps his foot impatiently. “But I feel like you don’t really care, somehow.”\n“Astute.” Bakugou takes the money, plus tip, and stuffs it into his back pocket, glancing at the red shoes appreciatively one last time before he has to leave. “Okay, now go away. I have a job to get back to, unlike some people.”\n“Oh, don’t let me stop you,” Midoriya says pleasantly. Bakugou steps away from the door and turns to go, and Midoriya waves him goodbye. The lights of the dilapidated corridor flicker on slowly as he makes his way to the equally dilapidated staircase. “Bye, Kacchan.”\nBakugou nearly falls down the stairs. “The fuck you just call me?”\nMidoriya’s still half-hiding behind the door, stupid face clearly pleased with itself even as Bakugou whips around so hard he feels his neck crack. The boy reaches up and taps his chest with a finger. “You have a nametag, you know.”\nBakugou glances down. The little black nametag he barely wears is inexplicably on his shirt today. He stares at it, mystified, and it seems to stare back. Bakugou Katsuki, it tells him. “The fuck is a Kacchan?”\nThat Cheshire kitten smile widens. “If you’re gonna call me Deku. I think it’s only fair.”\nSeriously, what the fuck. “I’m not a pet dog, Jesus.”\n“I prefer Deku to Jesus.”\nWow. “You know what, give me that pizza back so I can hit you over the head with it.”\n“Don’t be like that! It’s cute, I think it suits you.”\n“I’m gonna hit you twice as hard now.”\nMidoriya laughs. It’s a fucking stupid laugh, all high-pitched and snorty and whatever, and it echoes down the corridor even as Bakugou stands at the top of the stairs like an idiot. “Sorry, you’ll have to come back with another pizza if you want to hit me with it. I look forward to it, though.”\nBakugou makes a face. “What makes you think I’m coming back?”\n“Just a feeling,” he says, and manages to get the door shut just before Bakugou can wrench it back open and strangle him.\nHuh.\nBastard.\n \n \n \n \n“How is it,” asks Aizawa, “that there have been three orders from the same address in as many weeks?”\nBakugou looks up from his magazine. It’s something about cars, he thinks, although he can’t really be sure since he’d just snagged it from Kirishima’s backpack. “Is that not, like, a normal thing that happens in restaurants sometimes?”\nAizawa turns to look at him. His scarf is pulled tight around his neck even though the heat from the kitchen has spread to the front of the shop, so his voice is a little muffled. “Not this restaurant. This restaurant is a shithole.”\nKirishima pops his head out from the window to the kitchens. “It's your shithole.”\n“No, I’m just the manager. I refuse to take responsibility for the actual food,” says Aizawa. He’s still got the receiver of their landline in his hand, and he sets it down next to the cash register where it belongs. “I refuse to believe they genuinely want to eat what we give them. What’s going on?”\nKirishima makes a wheezy noise as he laughs. “Uhm, they obviously like my pizza.”\n“Nobody likes your pizza. Your pizza is disgusting and so is Kaminari’s. The only person here who can cook is Bakugou, and I don’t like him being in the kitchen because then I have to deal with him.”\nIt takes a lot of willpower for Bakugou not to hurl a chair in the old man’s direction. “You know, you’re the reason this business is suffering.”\n“I receive at least one new complaint about you every day, Bakugou, I think you deserve at least some of the blame.”\n“Fine,” Bakugou replies, exasperated. “We’re the worst possible combination of pizza dudes, fucking whatever. But we have a regular, so we can’t be completely hopeless. Let me guess, one large cheese pizza?”\nAizawa blinks. “How did you know—”\n“Because I’m your best employee.” Sliding off his stool, Bakugou shoulders his way through the heavy kitchen door and shoos his co-worker out of the way. “Get lost, I’m cooking this time.”\nKirishima stumbles a little on his way to the door, dusting his hands off on his apron. “What, you want me to deliver?”\n“Nah, I’ll do it. I got us our regular, and I’m gonna take care of him.”\n“Shit, I’m not complaining,” Kirishima shrugs. He leaves Bakugou to his work and Aizawa slithers back into the shoebox of an office he came from.\nBakugou, slapping a ball of pizza dough onto the table with far more force than probably necessary, looks at the ingredients station and grins.\nHell, he’s their star employee. It’s time someone got creative with the menu.\nMayo and pineapple go together, right?\n \n \n \nMidoriya’s apartment building is exactly as ugly as Bakugou remembers it, although he raps on the door with a lot more enthusiasm than he did the last time. A bit of paint crumbles under his fist, and he surreptitiously wipes his hand on his jeans when Midoriya opens the door. “Hi.”\nMidoriya blinks at him. “Hey, Kacchan,” he says. Emphasises the Kacchan, like he’s ready to bolt back into the apartment the moment Bakugou yells at him.\nBakugou does no such thing. Instead he picks up the receipt taped to the top of the pizza box in his hand and clears his throat. “One large cheese pizza for Deku.” It’s not a cheese pizza. It’s covered in questionable ingredients and suspicious bits of seafood, and at this point it barely qualifies as a pizza. “The usual.”\nDeku tilts his head like a puppy. “You’re awfully chipper. Did something happen?”\n“It’s a beautiful day,” Bakugou smiles at him. Grimaces, probably, judging by Deku’s resulting expression. Also, it’s not a beautiful day. It’s raining. “Don’t you love being alive?”\n“…yes? Did you hit your head?”\n“I’m just in a good mood,” Bakugou says, handing over Deku’s pizza and waiting patiently for payment in return. Deku glances at the box and then back at Bakugou, clearly a little suspicious. Bakugou keeps his smile (grimace) where it is. “Enjoy your food.”\n“What, you’re leaving already?”\n“Places to see, work to do,” Bakugou says, practically bouncing away from the door. “Have a nice life, Deku, see you next time.”\n“Hey, wait,” Deku’s voice floats down the stairs, ignored. Bakugou’s footsteps echo as he basically skips down the stairs to his scooter, and he straps on his helmet and swings himself into the seat. The engine starts up with a hum, and Bakugou accompanies it with a little hum of his own.\nA window slides open somewhere above him. “Kacchan, get back here with my pizza!”\nBakugou cackles and drives off.\n \n \n \nThe next day, Aizawa pokes his head out of the manager’s office to tell him that he’s just got a call from the regular. “He wanted me to tell you that whatever you gave him was actually pretty good.”\nBakugou frowns. Deeper than usual, since he’s literally always frowning, but he steals into the kitchen when Kirishima isn’t looking to poke around in the fridge. There’s a leftover container of whatever he’d used yesterday. It’s off-white and slightly solid, and it looks like it would eat whatever spoon Bakugou tried to put in it.\nThen again, if Deku ate it, it can’t be that bad.\n \n \n \nTen minutes later, as he’s still trying to scrape the taste off his tongue with a toothpick, he decides that it is, in fact, that bad.\nEh. Okay. He probably deserved that.\n \n \n \n \n \n \n“You’re not Deku,” says Bakugou.\n“No,” says the man at the door. “I’m not.”\nHe’s got a ridiculous dye-job; half his hair is white and the other red. His eyes are different colours, too, and they’re currently narrowed at the pizza box held protectively in front of Bakugou’s chest. “What’d you do with Deku?”\n“Izuku is visiting his mother,” says the man testily. “Give me my pizza.”\n“What are you doing in his house?”\n“It’s my house too. I live here, I’m his roommate. Give me the pizza.”\nBakugou gives him the pizza. Reluctantly, mind you, but he can’t really think of a good reason not to hand the stupid thing over. He’d been half-expecting Deku to yell at him about the experimental pizza thing, but he’s not even here. Unless he’s hiding in a cupboard somewhere, maybe, but there are no Jordans by the door. “Don’t you think it’s kinda weird to get food under someone else’s name?”\n“What does it matter as long as I paid for it?” says the stupidly bi-coloured customer, leaning against the doorframe. He’s got the door fully open, unlike Deku. Deku likes to keep the door just slightly ajar so he can peek through it like a little kid. “Anyway, you’re the one who assumed it was Izuku calling when you took my order.”\nAs if. This guy sounds nothing like Deku, but Bakugou hadn’t been the one answering calls since it’s Aizawa’s turn today. Easy mistake to make. The restaurant has his details saved with his phone number, but still. “He never mentioned having a roommate.”\n“No, because he insists on answering the door every time you people come here. I don’t know why he won’t just let me get Dominos. Your pizza tastes slightly worse than cardboard, I’d be better off just eating the box.”\nOh. Huh. That’s...kind of flattering, actually. The Deku part, not the pizza part, although the pizza part isn’t really much of a surprise. “Well why the fu—heck did you order it then?” Customer service, Bakugou. You want a tip, remember? \n“I was curious.” Half-and-Half stares at him with suspicion in his eyes. His left eye, specifically, seems to be telling Bakugou to fuck off, and the right one looks like it’s considering calling Dominos after all. “There has to be a reason he keeps subjecting us both to your cardboard pizzas.”\n“Could it be my stunning good looks? My sparkling wit? My riveting personality?”\n“I suppose. Izuku does have a fondness for collecting mangy strays.”\nBakugou rolls his eyes. His hands stay resolutely in the pockets of his jeans instead of wrapping themselves around Not-Deku’s neck where they should be, because Bakugou is a fucking saint with a willpower of iron. “You know that includes you, right, asshat? And I’m not the one with a head that looks like a red and white candy cane.”\n“It’s blood orange.”\n“It’s fucking red, you pretentious ass.”\nHalf-and-Half’s eyes narrow further, like a testy house cat. Bakugou wants to splash water at him. “I don’t want hair styling tips from an angry dandelion.”\n“Angry dande—okay, fucking Christ, I’m outta here. Are you gonna pay me or am I gonna have to stand here and listen to you all day?”\nNot-Deku makes a noise that could be loosely transcribed as harrumph. “I have absolutely no clue what he wants with you,” he mutters under his breath, shifting the box around so he can get a couple of bills out of his back pocket. It’s a precarious balancing act, and Bakugou makes no move to help. “Why is it always you who comes here? Do you really not have any other employees?”\n“Probably because I’m the only one willing to come all the way here to deal your half-and-half dairy substitute ass?”\nNot-Deku holds out the money, but Bakugou has to practically wrestle it out of his grip. “I’m not sure I like you.”\n“I definitely don’t like you,” Bakugou retorts, turning on his heel to leave. “Call me when Deku gets back so I don’t have to deal with you again.”\nThe door snaps shut with an air of wooden finality. Striding towards the stairs, Bakugou takes a look at the money in his hand and grumbles all the way back to the parking lot.\nIt’s exact change. Bastard didn’t even tip him.\nFuck customer service, honestly.\n \n \n \n \n \n \n \n“Jesus Christ, come on, Deku,” Bakugou says, banging on the door for the third time. Somebody shushes him from the floor below, and he leans over the balcony to yell back. “You shut up! Hey, Deku! I’ve been waiting out here for ages, how dare you order a pizza and then not collect it?”\nThe person shushes him again, and Bakugou just barely manages not to leap onto the lower floors so he can clobber them to death with his pizza. It would be a waste, anyway. Bakugou made this one himself, to make up for the other one. It is, naturally, fucking delicious. He shouldn’t damage it.\nDamaging Deku, on the other hand, would be great. Huffing, Bakugou parks his ass facing the door and stretches his legs out, box balanced in his lap. It’s warm and heavy, and it smells good. “Deku, you better come out of there.”\nDeku does not come out. For a brief minute, Bakugou’s tempted to just leave. Go back to the shop and give the pizza to Kirishima, even though Kirishima did nothing to deserve it. But he made this for Deku, damn it. If Deku doesn’t eat it, nobody’s eating it.\nExcept Bakugou, maybe, cause he made it.\n \nOh.\nActually.\nEh, fuck it.\n \nIt’s weirdly satisfying, eating a customer’s pizza right in front of their house. He’s right, of course; his pizza is fucking delicious, and he’s glad he took the trouble to make it properly. It’s cheesy and rich and thick, and he polishes off a slice in about three minutes. Cicadas chirp at him from somewhere in the distance. It’s a nice night. Warm and dry even if he is sitting on a concrete floor staring at a doorframe that has mildew growing around the edges.\nMight as well eat another. “I swear to god, Deku,” he mutters around a mouthful of crust. “If this is some stupid prank from your half-and-half boyfriend, I’m gonna kick his ass. I’ll kick your ass too for messing with me. Hell, I’ll kick my own damn ass, I’m an ass-kicking machine and nobody makes me come all the way out here for no good reason just so I can sit here like a homeless person, who do you think you are— ”\n“I don’t have a boyfriend,” says a voice behind him, and Bakugou almost loses his shit, and the pizza.\nDeku’s standing above him, plastic bag in one hand and the other held up in what he obviously thinks is a calming manner. He’s in cargo shorts and an awful t-shirt, and from this vantage point, Bakugou notes that the Jordans are even nicer up close.\nBut no time to comment on that, because there’s a chunk of pizza crust lodged in his windpipe. “What the fuck are you sneaking up on me for?”\n“I wasn’t sneaking!” Deku protests. “I just went out to get some soda, I didn’t think you’d be here this early since it’s been like, what, ten minutes—are you eating my pizza?”\nBakugou dares him to argue, eyes watering. “You were taking forever and I got hungry.”\n“So you just helped yourself?”\n“Well I’m fuckin' suffering for it now.”\nDeku stares at him. For a really long time, blinking slowly, and then he just sighs and slides onto the ground next to him. “You’re unbelievable, you know that? First a radioactive pizza, and now this.”\nBakugou hands him the pizza box.  “Ah, shut up. I made this special for you, you know.”\n“You did?” Deku perks up considerably. He inspects a slice at close range for a second, and Bakugou rolls his eyes.\n“It’s not toxic. I was just eating it, wasn’t I?”\n“I’ve seen what you’re capable of. I had to throw that last pizza out, you know. I missed dinner because of you.”\nBakugou doesn’t mention that he hadn’t wanted dinner after trying that shit either. “If it makes you feel any better, there’s some of that stuff left over in the fridge. I’m thinking it might gain sentience if I leave it in there long enough.” He’s not kidding. He’d opened the fridge to steal some salami slices yesterday, and he could have sworn the Tupperware was watching him.\n“That doesn’t make me feel better and I still don’t trust you,” Deku says, but nibbles at it all the same. Almost immediately, his face lights up like a Christmas tree and half the slice disappears in one bite. Something flutters in Bakugou’s chest. Might be satisfaction, might be fading adrenaline from having almost choked to death. “This is good!”\n“Don’t talk with your mouth full, you’re so gross,” Bakugou wrinkles his nose. Deku’s big, stupid smile is infectious, so Bakugou turns his attention to the 7-Eleven bag on the ground instead. “Were you raised in a barn? Hand me some of that soda.”\nDeku hands him the soda. It’s Coke, which Bakugou will accept even though he prefers Pepsi. “Did you really make this, Kacchan? For me?”\n“Yes, buttface. Your—who was he? The Harvey Dent knockoff— insulted our pizza, so I obviously decided to show him what for.” He takes a swig directly from the bottle. Deku observes him, eyebrows furrowed a little as Bakugou wipes his mouth with the back of his hand.\n“Who, you mean Shouto? My roommate?”\n“Yeah, him.”\n“Oh. Huh. When did you meet him?” Deku asks. His cheeks puff up like a hamster when he eats, and Bakugou pokes his face on impulse. “Ah, no, your fingers are greasy!”\n“Too fucking bad,” Bakugou wipes his hand on Deku’s sleeve anyway, earning a very loud whine in response. “He got pizza once when you weren’t here. Didn’t even tip me, the asshole.”\n“To be fair, you don’t usually deserve a tip,” Deku says. Bakugou pinches him, but only slightly. “Though like I said, he’s not my boyfriend, he’s just a friend of mine from high school. I don’t have one. Uhm. A boyfriend, I mean. I’m, like. Available. You know. If you were wondering.”\nBakugou was wondering, actually. Deku’s studying his dinner pretty intently. Without that bright green gaze boring into him, Bakugou feels free to grin. “You’re fucking weird, dude.”\n“What! Why am I weird? You’re the one eating a customer’s pizza right in front of his apartment!”\n“And you’re just rolling with it,” Bakugou says. He leans back against the short wall behind them. It’s solid and immovable, and he bumps Deku’s shoulder as he settles into a comfortable position. “I get a customer complaint literally every day, and yet here we are. Eating pizza at each other in the corridor like a couple of idiots.”\nDeku appears to consider this. He’s chewing a lot slower now, head canted a little like he’s thinking very hard. “I guess it is pretty weird.”\n“So why, then? I know you’re not in this for the pizza.” He turns his head slightly to watch Deku out of the corner of his eye. The boy’s pretty fidgety, wiggling his feet, seemingly unable to sit still for too long.\n“I dunno, really. I guess it just made sense, ‘cause you’re pretty weird too. I’ve been told I keep weird company.”\nHe’s not lying, if Half-and-Half is any indication. “I’m not weird. I’m a fucking model citizen.”\n“Mm, yeah, and I’m a superhero. I have super-strength and everything, wanna see?”\nBakugou pinches him again, this time on the wrist. Deku wriggles and complains, but doesn’t actually try to escape. “Guess I don’t blame you. I’m god damned delightful, so it’s pretty understandable that you’d try to spend as much time with me as possible.”\n“You’re not wrong about that,” Deku turn to him and smiles. It’s frankly disarming, and Bakugou, for reasons he can’t discern, can’t look away. “Guess you’ve figured out my ulterior motives, huh?”\nSomething squeezes his palm, and Bakugou looks down. Sneaky bastard’s managed to lace their fingers together when Bakugou wasn’t looking, and he jerks back in surprise. “What are you doing?”\n“Keeping you captive so my pizza’s safe?”\nBakugou makes an odd noise. It’s caught in his throat, halfway between a choke and a laugh, and he bats Deku’s smaller hand away so he can smack him on the shoulder instead. His palm tingles from the discovery that Deku’s got a weird number of callouses. “You’re ridiculous. I should have known not to trust you, pervert. I’m leaving.”\nDeku pouts at him theatrically, and Bakugou resists the urge to pinch his lips together with the tips of his fingers. “What, already? I was having fun.”\n“Believe it or not, I do actually need to get back to work at some point,” Bakugou says and stands. “I’ve already been out here for half an hour, my boss is gonna kick my ass if I’m not there to make the next order.”\n“Alright,” Deku sighs. He sounds genuinely rueful, and Bakugou tries not to look too pleased at that. Groaning like an eighty-year-old, he wobbles to his feet and scoops what’s left of their dinner up in both hands. “I guess I’ll see you next week or something?”\n“Maybe. You better not give any of that to your gross roommate, I made that shit for you.”\n“He’s not gross, but I won’t give it to him,” Deku says with an impish grin. “I’m selfish, y'know.”\nAnd, well. Bakugou can’t really not smile at that.\n\n \n\n \n\n \n\n\n \n\n \n \n“You should bang him,” says Kirishima, and you know what, Bakugou was so close to not having a meltdown at work today. So close.\nHe stops cleaning the counter and turns around. Very slowly, maybe to give Kirishima some time to really think about what he’s saying, maybe to give him time to scuttle back into the depths of the kitchen from whence he came and maybe leave Bakugou the fuck alone. “Excuse me?”\nKirishima doesn’t get the hint. “I’m talking about the guy who always gets delivery. You won’t let anyone else take his orders, so you should bang him.”\nHe doesn’t sputter. He would, normally, except it’s actually taking quite a lot of concentration to figure out how the fuck Kirishima went from point A to point B. “Excuse me?”\n“Yeah! I mean, like, you know where he lives, and stuff, and it’s pretty obvious he wants to see you.” He leans forward a little over the sink so his head is just poking out from the little window between the kitchen and the front. Nobody’s here except Aizawa, who’s probably napping in the manager’s office. Business is slow, for a Friday night. Slower than usual, anyway. “Not that I can tell why. You’re literally the worst delivery guy on the planet.”\n“I’m a fucking amazing delivery guy. How about I deliver my fist into your face? 30 seconds or less, or the next one’s free.”\n“It’s definitely not the pizza,” Kirishima continues, ignoring him completely. Rude fucker. “I mean, Aizawa was right. I’ve tried our pizza. Nobody with tastebuds is gonna wanna eat our pizza a second time, not unless they’re desperate.”\n“You’re the one making it, dipshit,” Bakugou says. “God. I keep saying I should handle the cooking around here, but does Aizawa listen? No.”\n“Nobody wants you in the restaurant, that’s why,” Kirishima says. “But the regular likes you. Sounds like a catch, man, you should date him while you have the chance.”\n“How would you know he’s a catch? You’ve never even seen him. For all you know, he’s a creepy middle-aged dude with a hundred cats.”\n“If he’s willing to put up with you, he’s probably an angel.”\nBakugou tosses an elderly bit of pizza crust at him. It goes sailing over his head and onto the floor somewhere, but Kirishima makes no move to pick it up. “You saying he’s too good for me, punk?”\n“Satan would be too good for you, which is why you should date the regular. Or at least bang him, or something.”\n“I’m not doing it just ‘cause you tell me to. Also, fuck you, I’m the most eligible bachelor in this joint.”\n“That’s not saying much.” Kirishima ducks out of the window and reappears in the front of the restaurant so he can lounge on one of the barstools. He’s not wearing his apron, seeing as neither of them have actually done anything today. “What’s the matter?”\n“Nothing’s the matter. Deku’s a loser, and he’s not too good for me.”\n“His name’s Deku? That’s weird.”\n“His name’s Midoriya Izuku, but Deku suits him better,” Bakugou replies. Hands on his hips, he surveys their surroundings. Spotless. “Because, like I said, he’s a loser. Whatever sexual tension you’re seeing here isn’t real.”\n“Yeah, I never brought up sexual tension,” Kirishima points out. Seems smug about it too, the bastard.\nBakugou huffs. “Well, so what? He’s kinda cute, in a dorky way. What’s the big deal? Lots of people are cute.”\n“Yeah, but not lots of people are simultaneously cute, available, and interested in the likes of you.”\n“Fucking rude.”\nKirishima hums noncommittally and leans his chin against his palm. His expression is thoughtful, for once, a little like Deku’s is sometimes when he thinks Bakugou’s not paying attention. “Well, I guess it’s too much to expect.”\n“The fuck is that supposed to mean?”\n“Dunno,” Kirishima shrugs. “Not even you’d shoot that far out of your league, huh?”\nBakugou stares at him. “Do you think I don’t know what you’re doing?”\n“I dunno what you’re talking about.”\n“Mhm, really. So you’re not trying to goad me into wooing the fucking regular? You’re not trying to bruise my pride so I’ll get angry and ask him out? Is that what you’re saying, Kirishima?”\n“Nope, not at all. Yes? I dunno. Whichever one means I’m agreeing with you.”\n“I see. And you’re not giving me that fucking look, which I can see, by the way, you’re not sneaky, because you think you’re gonna succeed in manipulating me into your bullshit? You don’t think you’re winning?”\nKirishima smiles at him beatifically. “Now, we all know I’m not smart enough for that.”\n“Damn straight,” Bakugou snaps, throwing his cleaning rag at Kirishima’s face. “Now get that dumb fucking smirk off your ugly mug, I’m gonna go make Deku a pizza and then I’m gonna go give it to him.” Turning on his heel, he ignores Kirishima’s sniggering and stalks off to the kitchen, slamming the door extra hard before he gets to work.\nHe karate-chops Kirishima on the back of the head once he’s done for good measure. And then he changes his shirt, gets on his scooter and heads to Deku’s ramshackle apartment building.\nAfraid? Fuck that shit. Bakugou is Baku-gone. \n \n \n \n \nThat door. That same mouldy door with the crumbling paint and cheap wood, and it makes the same awful noise when Bakugou pounds his fist on it. He probably should have called. There’s no way of knowing if Deku’s even home, or if he’s got someone over, or if he’ll be happy to see Bakugou on his doorstep with a pizza in one hand and a nothing but a sweaty palm on the other. Is he appropriately dressed? Does he smell like pizza? Should he have gone home to make himself pretty first?\nCicadas sing at him somewhere in the night. A part of him, the small part that he’s been silencing ever since he was four years old, wonders what he’s going to do if Deku turns him away.\nAnd then he promptly squashes that thought with the heel of his left foot, because haha, nope. Bakugou Katsuki does not get nervous. I don’t care how much you like him, digest those butterflies. \nThe door opens.Bakugou opens his mouth to say something, and then deflates.\nIt’s just stupid Not-Deku. Lame.\n“I don’t remember ordering a delivery,” Half-and-Half says. Mismatched eyes take in the pizza box and Bakugou’s slightly disheveled appearance, and then he glances back up to raise a perfectly-shaped eyebrow. “I don’t remember inviting you, either. Why are you here?”\nBakugou ignores him. “Is Deku home?”\nHalf-and-Half continues staring. His gaze is cool and impassive, and sweat prickles on the back of Bakugou’s neck. For a second he actually thinks it might be a good idea to leave. “What are you planning?”\nBut he stands his ground. “It’s a pizza, not a bomb. I’m not gonna steal him away from you, if that’s what you’re worried about.”\n“You couldn’t if you tried,” Not-Deku snorts at him. It’s a soft, elegant sound, and it’s also incredibly irritating. Thankfully, though, he seems to find whatever answer he’s looking for, and he breaks off the staring contest to finally holler out over his shoulder. “Izuku?”\nA voice responds from somewhere inside. “Hmm?”\n“The angry dandelion is here to see you.”\nFeeling very generous, Bakugou decides not to give him a black eye. “Thanks, candy cane.”\n“You’re welcome.” Half-and-Half swings the door wide open and shoulders past him, sighing like he’s being put-upon. “I’m going to Iida’s. Don’t make a mess.”\n“Don’t come back,” Bakugou retorts, but is distracted halfway by Deku’s face at the door. He’s all flustered and his mop of curly hair is a little windswept, which makes no sense because it’s not like there’s much of a breeze inside the apartment. “I’m not here just to spite Kirishima,” he says, and then winces. “Uh. I mean. Hey.”\n“Hey!” Deku says brightly. “I didn’t expect you. Did I buttdial you or something? I’m sorry, I swear I’ll pay you, let me just get my wallet—”\nBakugou cuts him off. “You didn’t order a pizza.”\n“Okay?”\n“It’s on the house. I made it.”\n“Oh. I…okay?”\n“We’re gonna eat it.”\n“We are?”\nBakugou feels like he’s talking to a slow and remarkably sticky toddler. “Yes. It is a romantic dinner that I made for you and me. And then we’re gonna try dating, which will also involve you and me. Do you need instructions? Should I write this down?”\n“Oh. Oh. I, no, I mean,” Deku flaps his hands around uselessly for a second. “No to the instructions. Yes to the dinner. Definitely yes to the dating. Yes. Yes, okay, cool.”\n“Okay,” Bakugou repeats. “Cool. Okay.”\nA tiny smile starts to bloom on Midoriya’s face. It’s a fucking stupid smile, all freckly and soft and shit. Bakugou kinda wants to punch it. Gently. With, like, his mouth. “Would you like to come inside? I still have soda left over from last time, if you want.”\nBakugou wants. It’s a little scary how much he wants, actually, but then again he’s always been the kind of person to take whatever catches his fancy. And right now, illuminated by the light of his apartment and drowning in a shirt at least three sizes too big, Deku is quite definitely catching his fancy.\nHe steps inside.\n \n \n \nThe cicadas shut up, Half-and-Half leaves them alone, and Bakugou’s worn out sneakers, as it turns out, look pretty good sitting by the door next to a pair of bright red Air Jordans.\nThe pizza is, predictably, fucking delicious.\n \n \n \n(A little less delicious is kissing a guy who’s just eaten half a pizza, but Bakugou’s pretty tough. He figures he can deal with it just fine.)\n \n \n "
}