{
    "id": "7352212",
    "url": "https://archiveofourown.org/works/7352212?view_full_work=true",
    "author": [
        "ghostcribs"
    ],
    "title": "we'll make it, you and me",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Voltron: Legendary Defender"
    ],
    "relationships": [
        "Keith/Lance (Voltron)"
    ],
    "characters": [
        "Keith (Voltron)",
        "Lance (Voltron)"
    ],
    "additional_tags": [
        "Hurt/Comfort",
        "Major Character Injury",
        "First Kiss",
        "Angst",
        "Fluff",
        "this was for a prompt but was also entirely self indulgent",
        "should probably go with my other prompt fills bUT it's getting its own instead"
    ],
    "language": "English",
    "series": "",
    "published": "2016-06-30",
    "completed": null,
    "words": "6,421",
    "chapters": "1/1",
    "comments": "199",
    "kudos": "17,766",
    "bookmarks": "1,956",
    "hits": "156,864",
    "summary": "<p>\"Keith, if we make it out of this alive, I'm going to kiss you.\"</p>",
    "notes": "<p>lol goodbye</p>\n<p>(warning for almost-graphic-but-not-quite description of injury)</p>",
    "text": "\n“Keith.”\n\n\nHis hands are sweating in his gloves, slippery on the controls he’s holding in a death grip. He glances up to the screen and sees Lance’s image. His eyes are hard and focused under a pinched brow, entirely focused on maneuvering his Lion through the maelstrom. Keith has never seen him look so serious.\n\n\n“Keith, if we make it out of this alive, I’m going to kiss you.”\n\n\nAnd then his feed blinks out, leaving Keith feeling awfully and terribly alone.\n\n \n\n——\n\n \n\nWhen he opens his eyes, everything is bathed in a red haze. There’s a distant beeping that’s just loud enough to be annoying, and it’s what Keith latches onto to pull himself into consciousness. He’s sprawled out across the floor, head bent at an uncomfortable angle up against the control panel, torso facing up while his lower half is twisted to the side. And he has absolutely no will to get up. Even without moving, he feels stiff and sore and who knows how long he’s been lying here like this?\n\n\nIt’s when he feels a tug at his consciousness that he actually realizes he should probably try to get up. “Red…?”\n\n\nHis Lion is prompting him. He can feel the waves of concern lapping over his mind like a balm. After a few minutes of deep breathing, he’s able to muster enough strength to twist his legs into the proper position and sit up. He groans and rubs at his neck, which aches with the worst crick he’s ever had. \n\n\n“You there, buddy?” he asks his Lion. \n\n\nThere’s a soothing hum in reply, but the ominous beeping continues and it’s obvious that everything is not all right with the machine. From the slight tilt to the floor, Keith thinks that they’ve landed lopsided. Wherever they are…\n\n\nWith a jolt, the disastrous escape from the Galra command comes back all at once. The wormhole malfunction… Keith’s hand flies up to his comm and activates it. “Hello? Shiro? Allura? Is anyone there?”\n\n\nHe’s answered by static.\n\n\nHis stomach gives a violent lurch. He has to get out and see where he is. He can’t panic yet. \n\n\nBut when he climbs to his feet, pain sears through his middle and he doubles over with a groan, latching onto the chair for support. Well, this isn’t good. Hope nothing’s broken. It takes a minute or two, but the pain eventually dies down and he’s able to straighten up. His side throbs but he figures if he doesn’t move too quickly it’s bearable at least.\n\n\nFirst thing’s first, he needs to run a diagnostic on Red. The screen lights up under his fingers and he breathes a sigh of relief. While the diagnostic is processing, he opens the visuals screen and finds himself looking out at a forest landscape. Red’s head is nestled in a copse of tall, vine-like plants and Keith can’t see very far out due to all the foliage. \n\n\nHe sits back in the accelerator chair and gingerly presses against his ribcage. There’s definite bruising. At worst some cracked ribs, but nothing gives under his fingers so it’s probably safe to say nothing’s broken. He can deal with that. When he takes stock of the rest of his body, he discovers blossoming bruises and aching joints, and his neck is sore beyond belief, but nothing is terribly alarming. \n\n\nHe tries the comm link two more times before the diagnostic check is complete with no success. \n\n\nThe list is…not as bad as he’d feared. But it’s certainly not good. Namely, the main power feeds to the engine were damaged in the crash which means he won’t be flying Red Lion anywhere anytime soon. And while he’s got the basics of mechanics down, he’s no genius like Pidge and he doesn’t trust his skill enough to mess with the Lion’s inner workings. \n\n\n“Looks like I’m going to have to get us out of this,” he mutters. \n\n\nAs a bit of an afterthought, he tries the comm one more time through the screen. His gut’s already sinking at another failed attempt when he receives nothing but white noise in return, but then… He hears something vaguely resembling a voice through the crackling. \n\n\nHe pulls in a sharp breath, two fingers flying up to the earpiece in his helmet. “Hello? Is someone there? Hello?”\n\n\n“…eith…k…s—at you?”\n\n\nBlood is rushing in Keith’s ears. He moves around the cockpit slowly to see if he can pick up a better signal. “Hello? Hey! Who’s there? I can’t…”\n\n\n“K…Keith!”\n\n\n“Lance?” Keith is so relieved to hear him he’s actually smiling. When did things get so bad that even Lance’s voice would bring a smile to his face? “Oh, thank god. Where are you?”\n\n\n“I…I don’t know. Somewhere in a forest, I think.”\n\n\nKeith sinks into his chair in relief. “Okay. Good. Me too. You must not be too far off.”\n\n\n“Keith…”\n\n\nHe taps on his screens. “Can you activate your tracking signal? I’m turning on my scanner. I’ll see if I can find you.”\n\n\n“I don’t…Keith, I’m…” \n\n\nKeith pauses. Now that the signal’s clearing up, he can hear Lance’s voice better. It sounds strained, breathless. And not at all like Lance’s usual tone.\n\n\n“Lance?” A feeling of unease settles in his gut. His newly settled heartbeat begins to race again. “What’s going on? You okay?”\n\n\n“I can’t—I can’t get to the control panel. My leg is—I think my leg is broken. I can’t move it.” He’s breathing hard, his panting coming in harsh, crackly puffs over the mic. “Keith, it hurts.”\n\n\nShit. A sick feeling rolls through Keith’s gut. Lance sounds scared, and that’s probably the most unsettling thing. He can hear his pain through the rickety comm connection—he sounds like he’s in agony. It’s so unlike him that Keith feels tingling panic creep up his spine, making a sweat break out all over his body. It must be bad. \n\n\nKeith takes a deep breath in through his nose. If Lance is panicking that means he has to be the one to keep his head. Good thing he’s never had a hard time staying calm even when he’s terrified. “It’s—it’s okay, Lance. I’ll find you. You just sit tight and don’t move. I’ll come get you.”\n\n\nHe hears Lance take several steadying breaths as well. “Okay. Okay.”\n\n\n“I’m doing a long-range scan. Trying to see if Red’ll pick you up.” \n\n\n“Don’t… Just stay on the comm, okay?”\n\n\nKeith swallows hard. He sounds so frightened. Keith’s overcome with the need to put his mind at ease. “Why? You miss the sound of my voice?”\n\n\nLance huffs out something resembling a laugh. “Something like that, I guess.”\n\n\nKeith hums. Meanwhile his eyes are trained on the red waves on the screen, looking desperately for any indicator that something’s out there.\n\n\n“Hey, Keith, how’re you? How’s Red Lion?”\n\n\n“I’m, uh. I’m a little banged up, but I’m okay. Red’s not getting up, though.”\n\n\n“I don’t think Blue can get up either. I can’t feel her.”\n\n\nAnd that’s, well, that’s equally as unsettling. If Lance can’t even feel Blue Lion’s connection, their crash must have been really, really bad.\n\n\n“Have you heard from any of the others?” Lance asks. \n\n\n“No.” He taps out a few more commands. “You’re the only one I’ve gotten through to.”\n\n\n“Wh…where do you think they are?”\n\n\n“I don’t have a clue.”\n\n\n“How’re we gonna…how’re we gonna find ‘em if our Lions aren’t working?”\n\n\n“We’ll find a way, Lance. Everything’s gonna be fine.” Keith’s fingers beat incessantly on the panel. \n\n\nThen, at long last, the scan picks up a signal and he sits up straight in his chair reflexively. And then he stifles a groan and cradles the ache in his side. \n\n\n“Okay,” he says through gritted teeth. “I locked onto your signal. It looks like you’re a mile or so away, so I’m gonna pack a few things and start heading over there.”\n\n\n“Sounds great.” \n\n\nThey fall into silence while Keith rummages through the stores and fishes out a med kit, an emergency pack, and all the spare rations he can find. He stuffs them in the pack, takes another good look around to make sure he isn’t leaving anything important, and opens Red Lion’s hatch. \n\n\nGetting down is a bit more daunting than he expected. Every sudden movement sends pain jolting through his torso, and it’s all he can do to keep from grunting. He can hear Lance’s heavy breathing through the mic and aggressively tries not to think of how bad a situation they’re in, or how much worse it could become. \n\n\n“How you holdin’ up, Lance?” Keith asks after he’s been trudging through underbrush for a solid five minutes.\n\n\n“I’m great. Just dandy.”\n\n\nKeith frowns. “Seriously. How are you feeling?”\n\n\n“My leg’s pretty numb now, so I guess that’s an improvement.” More ragged breathing. “But I’m tired. Like, really, really tired.”\n\n\nKeith swings his Bayard at another branch. “Stay with me ’til I get there.”\n\n\n“Yeah,” Lance gasps, and then grunts like he’s shifting his weight. “Just hurry up.”\n\n\n“Doing my best.”\n\n\nIt’s hot. Keith’s hair is damp with sweat and is clinging to his neck and face. He kind of wants to take his suit off, but figures it’s not a risk worth taking. For one, he needs to keep his helmet on to talk to Lance. For another, who knows what kinds of things these weird alien plants could do to him if he touched them with his bare skin. He can feel the back of his spandex suit getting soaked, but he’ll put up with it. It’s only a mile. \n\n\nThat’s what he keeps chanting in his head as he continues to trek through dense foliage. A new ache has started up in his shoulder and his neck won’t stop hurting no matter which way he turns it and the pain in his side has gone from a dull throb to a sharp stabbing. He probably should’ve checked it out before he left his Lion, but he’s eager to get to Lance, who’s in a much worse condition.\n\n\nIt takes longer than he’d like, but eventually the little blip on his visor’s tracker comes into range. He catches glimpses of blue between the leaves and feels a new surge of energy. \n\n\n“Lance, I’m here. I’m outside,” he says as he carefully climbs over a giant root and finally enters the clearing.\n\n\nHe freezes.\n\n\nThe Blue Lion looks terrible. It’s lying on its side, face and body covered in dirt and uprooted plants. Keith doesn’t even have to get close to see the gashes and dents in the metal and places where the paint is chipped off. It’s a sickening sight. \n\n\nHe limps as quickly as he can to the Lion’s mouth. “Can you open the hatch?”\n\n\n“I…I’m trying.” Lance’s breathing is picking up again, punctuated by grunts of pain. “This isn’t—augh!”\n\n\n“Lance?” Keith stares up at the robot, feeling incredibly helpless. “Are you okay?”\n\n\nFor a few moments he doesn’t answer, and Keith has to listen to his labored breaths as he tries to get the pain under control. Then he hears Lance groan and hiss. “Oh, god, I—ah, fucking shit—m-my leg isn’t…numb anymore.”\n\n\nKeith’s hands curl into fists. “Be careful. Take it slow.”\n\n\n“Yeah.”\n\n\nListening to Lance drag his injured body across the floor is hard and sets Keith on edge. When the hatch finally opens, he has to force himself not to sprint inside. As much as he wants to, sudden movements aren’t a good idea for him either. So he gets to the cockpit as quickly as he can.\n\n\nAnd freezes again. This time panic spikes through from his chest all the way down to his feet. \n\n\nHe was not prepared for how bad Lance looks.\n\n\nHe’s barely sitting up, upper body leaning heavily against the dashboard, one hand still resting on the button for the hatch. His right leg is stretched out before him awkwardly, bent at an unnatural angle. The armor there is smashed in and cracked along the shin. The rest of his suit is scuffed and dented…and spattered in blood. When Keith looks closer, he can see trails of it on the accelerator chair and various parts of the cockpit. \n\n\n“Lance!” He quickly removes his helmet and tosses it to the side before rushing to the injured boy and dropping to his knees. He helps Lance take off his helmet as well and is instantly struck by how pale and sweaty his face is. There’s a trail of dried blood leaking from his nose. “How are you doing?”\n\n\nHis eyes are half-closed. He seems dazed. “Better, now that you’re here.”\n\n\nKeith has to forcibly keep himself from brushing back short locks of damp hair. If these were normal circumstances, Lance would never hear the end of it for making a comment like that. Now, though, all Keith feels is a concerning tug in his chest. “It’s all right. You’re gonna be okay.”\n\n\n“‘Course I am.”\n\n\nKeith’s eyes roam over the blue paladin’s prone form, trying to decide the best course of action to take. Nothing about this is going to be pleasant. “We need to get your suit off.”\n\n\n“I was afraid you were gonna say that.”\n\n\nIt’s a slow and painstaking process, but they manage to remove it piece by piece. The blood, he discovers, originated from multiple lacerations at various places on Lance’s body where the plating was punctured. He’ll need to patch them up, but for the time being they’re not too concerning. When Keith moves to his injured leg, however, Lance reaches out a hand to stop him.\n\n\n“Wait. Can’t we just…leave that part on?” His voice is weak and trembles at the end of the sentence.\n\n\n“I have to get to your leg to treat it, idiot,” Keith says. “I’ll be careful. Take a deep breath.”\n\n\nLance does. His hands clench into fists and he bites down on his lip. When Keith’s fingers grip the warped material, he lets out a pitiful whimper and Keith almost lets go, but steels his nerves at the last second and lifts off the armor. \n\n\n“Mmmmph,” Lance groans, doubling over.\n\n\nKeith is sweating. “You okay?”\n\n\nThe taller boy breathes unevenly for a few moments before giving a shaky thumbs up. \n\n\n“Okay.” Keith turns his attention to his injured leg and winces at the sight of it. It’s definitely broken. Thankfully there’s no exposed bone, but there is a noticeable bend in the shin a few inches below the knee and it’s swollen and purple. \n\n\nHe must be making a face, because Lance is watching him closely. “How bad is it?”\n\n\nKeith pulls his lip under his teeth. “It could be worse, but…I’m gonna have to set it.”\n\n\nLance’s eyes widen in what looks very much like terror and his chest begins to heave. “No. No, Keith, please, it—it really, really hurts. Please don’t touch it. Please.”\n\n\nIf Keith was told that one day Lance would be begging him for something, he never would have believed it. He hates that his pleading, desperate tone makes his heart feels like it’s tearing in half. Lance is outright shaking and Keith knows he’s not exaggerating at all.\n\n\n“I have to. You know that.”\n\n\nLance looks sick. He’s paler than Keith has ever seen him, but he swallows and sets his jaw firmly. “I know, I just… Oh, fuck. O-okay. Just…just do it fast.”\n\n\nKeith nods. His heart is pounding. He set his own finger, one time, when he was out in his shack and tripped and fell on it wrong, and he’s taken enough first aid to have a good idea about what to do, but actually doing it to someone else… Well, it’s not like he can do more damage. It’ll be…fine.\n\n\nThe med kits are well-stocked, fortunately. He finds something to splint Lance’s leg with and sets it down at the ready beside him. Then he positions his hands on either side of the break. He’s always prided himself on being able to do what needs to be done, even if it’s hard, so he digs down deep to find that resolve, to forget about who he’s about to do this to, and to forget the terror thrumming in his veins. He takes a deep breath. And then he snaps the bone back into place.\n\n\nLance screams. \n\n\nAnd god, Keith would trade anything to be able to forget that sound. \n\n\nHe splints the leg and wraps it up as tightly as he can, as quickly as he can, because Lance seems nearly delirious with pain and he won’t be able to keep his hands steady much longer. He fishes out painkillers and water, but he no longer knows what to do. Lance is making wounded sounds, head pressed back against the dash, fingers clenching and unclenching on the floor at his sides, chest heaving tremendously and his eyes clamped shut. And—\n\n\nOh, shit, there are tears streaming down his face. \n\n\nKeith is suddenly struck with the desire to pull him into his arms. He blinks, utterly confused as to where that came from. Absolutely not. Instead he scoots a bit closer and puts a hand on the blue paladin’s shoulder. “Lance? You okay?”\n\n\n“Peachy,” he gasps. His brow is knit and his skin glistens with sweat. \n\n\nKeith pushes the sick feeling of guilt deep, deep down. “Well, at least that’s over with.”\n\n\n“You’re not—ever—doing that—again.”\n\n\n“You’ll thank me later when your leg doesn’t heal crooked.” He holds out a hand with the painkillers. “Here. Take these.”\n\n\nLance pours them in his mouth, but his hands are shaking so badly he can’t grip the water bottle. It’s strange to see him acting so weak and pitiful, and Keith doesn’t want to admit that he’s currently filled with concern and sympathy, so he counteracts it by rolling his eyes before he takes the water bottle and holds it up to Lance’s lips. \n\n\n“Thanks,” Lance breathes once he’s swallowed. \n\n\n“D-don’t mention it.” Keith busies himself with tending to the multiple gashes Lance is sporting, tearing open a packet of antiseptic wipes with his teeth. \n\n\nLance groans when he presses it to the slice on his arm and lets his head fall back again. “Man, this sucks.”\n\n\n“Yeah.” \n\n\n“How long do you think we’ll be stuck here?”\n\n\n“I’m not sure,” Keith says. “Hopefully not too long. Allura and Coran’ll be looking for us. The castleship has that long-range scanner, and with both our Lions on this planet I don’t think it’ll take them long to find us.”\n\n\nThis seems to set Lance’s mind at ease a little bit. “Yeah…yeah. You’re right.”\n\n\n“Never thought I’d hear those words come out of your mouth.”\n\n\n“Yeah, well, I never thought I’d be stranded on an alien planet and have you nursing my wounds.”\n\n\nKeith smirks a little as he tapes a patch of gauze over the cut. “Fair enough, I guess.”\n\n\nHe finishes tending to the rest in silence. Once the last bandage is on, he sits back and blows out a long breath. Now that things are calming down a bit, he can feel his own injuries aching more prominently. \n\n\nLance suddenly wraps his arms around himself and shivers. “S’cold in here.”\n\n\nAnd that brings them to a new problem. “We need to make a fire,” Keith says. “But for that we need to go outside.”\n\n\nLance pales again. “I’m not…I don’t know if I can…”\n\n\n“Can you try?” Keith doesn’t mean for his voice to come out sounding so soft, but it does. “You need to keep warm.”\n\n\n“Aren’t you, like, not supposed to move broken limbs? I think I remember that from class.”\n\n\n“I think it’s more important to make sure you don’t die of hypothermia.”\n\n\nLance heaves a pained sigh. “You’re…probably right. God, I can’t believe I just said that again.”\n\n\nKeith laughs softly. “Remind me to hold it over your head later.” He heaves himself up, concealing a wince when the movement pulls at his side. “I’m going to scope out a place to make camp. Be right back.”\n\n\nHe’s almost to the hatch when Lance calls out after him. “Keith?”\n\n\nHe pauses to look back. “Yeah?”\n\n\n“Can you, uh…bring your helmet with you? Just in case.”\n\n\nKeith opens his mouth, intending to tease him about getting lonely, but stops when he sees the blush spread over Lance’s cheeks and he realizes, oh, he’s still scared. And he just…can’t bring himself to tease him like this. A rush of warmth pools in his stomach and for a split second he acknowledges it as affection. \n\n\nHe ends up blinking awkwardly. “Uh, y-yeah. Sure, no problem.” He scoops up his helmet from the ground and puts it on. “Be back soon.”\n\n\nThe night air is colder outside Blue Lion. Once he’s out and away from Lance, he realizes that his heart is beating fast. At first he thinks it’s because of the intensity of what just transpired. He’s certainly shaken—seeing Lance in this condition is way more unsettling than he could’ve imagined. Lance, who’s usually so cocky and energetic and cracking bad jokes every ten seconds, trembling and terrified and in so much pain he can’t even put on a brave face, let alone criticize Keith about anything. It…makes Keith feel weird. \n\n\nThat isn’t all of it, though. He can still feel the warmth of Lance’s skin on his fingertips, smell the faint scent of exhaust and sweat emanating from him—which should’ve been disgusting, but for some reason he wasn’t disgusted. He wanted to run his fingers through Lance’s hair, wipe away his tears and smooth the distressed wrinkles between his brows. He wants to comfort him, protect him, make sure he knows that he won’t let anything happen to him. And that’s…that’s concerning. He isn’t sure when he started becoming endeared by Lance’s smile instead of annoyed by it, or when he’d come to look forward to their bickering, or when he’d stopped thinking of the blue paladin as an asshole and started noticing little indications of insecurity and doubt instead. It must have been very recently. He’s always thought Lance was attractive, but actually being attracted to him is something else entirely. \n\n\nA memory suddenly strikes him, something Lance had said. But that couldn’t be right—\n\n\n“Keith?”\n\n\nHe stops in his tracks. “I’m here. You okay?”\n\n\n“Yeah. Just wondering if you’ve found anything yet.”\n\n\nRight. Campground. “Uh, not yet. Still looking.”\n\n\n“Hurry it up before I f-freeze, will ya?”\n\n\nThe introspection will have to wait until later.\n\n\nHe ends up finding a nice spot where the roots of a massive tree form an overhang. At least, he hopes it’ll be nice. He still doesn’t know anything about the planet they’re stranded on, and he doesn’t really want to learn the hard way. But right now, their options are very limited. \n\n\n“Okay, I found a place. I’m coming back now.”\n\n\n“‘Bout time.”\n\n\nOn his way back, he grabs a long, sturdy stick with a fork at one end and thinks it might work as a crutch. He’s apprehensive about moving Lance, but as long as they do it carefully, there shouldn’t be too much issue. \n\n\nWhen he returns, Lance takes off his helmet and gives a tiny smile. There’s a fluttering in Keith’s belly that he adamantly ignores. “Ready?”\n\n\nLance shrugs. “As I’ll ever be.”\n\n\nKeith kneels beside him and hands him the crutch, which he takes without comment. Then he loops one arm over his shoulders and braces himself to stand and support Lance’s weight. His side gives another tweak, but he ignores that too. “I’m gonna stand up now.”\n\n\nLance exhales slowly. “Okay. Okay. Let’s do this.”\n\n\n“We’ll go slow.”\n\n\nLance’s hair tickles the side of his face as he nods. Keith can feel the taller boy’s lean muscles contracting under his hands as they stand together, and he pretends like he doesn’t notice. \n\n\nLance grunts in pain as his leg slowly moves from lying horizontal to vertical. He tucks the stick up under his armpit and shuffles a bit until he’s adequately supported, breathing harshly all the while. “All right. I’m good.”\n\n\nThey set off. Keith underestimated just how slow a pace they’d have to keep. Not that he’s complaining, necessarily. Lance’s breath comes in damp puffs against his neck and his torso is solid and warm beneath the black spandex suit. He hasn’t ever been so close to Lance for such a long period of time before. It feels strangely intimate.\n\n\nThe hardest part is getting down the ramp. They’re both concentrating so hard that Keith can’t even be distracted by Lance’s tall body pressing against him. Once they’re on the ground, though, the going is a bit smoother and it only takes a few more minutes before Keith is helping lower Lance to the ground under the roots.\n\n\n“Fu-huh-huuuck,” Lance whispers on an exhale as he stretches his leg out again.\n\n\n“You good?”\n\n\n“Mhmm.” \n\n\nHe’s not; Keith can see that, but Lance has taken such a big blow to his pride today already that he lets it go. Instead he runs back to get the kits, shoves a ration bar and a water bottle into Lance’s hands, and goes about making a fire. \n\n\nHe’s kneeling beside a pile of dry tinder and twigs to light it with some futuristic space lighter he’d found in a pack when he can’t hide it anymore. One wrong move sends pain stabbing through his middle and before he knows what’s happened, he’s letting out a strangled cry and hunching over himself, lighter dropped in the wood. \n\n\n“Keith?” Lance shuffles in the leaves like he’s trying to get up. “What’s wrong?”\n\n\nKeith rolls back onto his ass and cradles his ribcage. “Nothing. I just…I think I bruised something in the crash.”\n\n\nIn the light provided by Keith’s helmet, he sees Lance frown. “You better let me take a look.”\n\n\n“Let me finish this first.” He picks up the lighter again and manages to get a fire going this time. He nurses the flame into a small blaze before packing up the supplies and scooting himself gingerly back towards Lance. \n\n\n“Now it’s time for you to take off your suit,” Lance says.\n\n\nSomething about his expression causes Keith to blush. He undresses quickly down to his under-suit and rolls up the hem of his shirt. They both wince when his ribcage is uncovered. There’s a long gash along the left side, surrounded by dark, red-purple bruising that mottles the majority of his torso. The swelling makes it look downright nasty.\n\n\n“Dude,” Lance says. “How the heck have you been carrying me around like that?”\n\n\nKeith shrugs. “You do what you gotta do. I don’t think anything’s broken.” \n\n\nLance raises his eyebrows, and if Keith didn’t know any better he’d say he looks impressed. He mutters something under his breath that sounds an awful lot like, “You should’ve told me.” After staring at the wound intently for a few seconds, he holds out a hand. “Hand me the first aid kit.”\n\n\nKeith huffs, but does as he asks. “I can just patch it up myself, you know. You need to be taking it easy.”\n\n\n“Nah, I gotta return the favor or this’ll be hanging over my head forever.”\n\n\n“Have I ever told you that you’re fucking weird?”\n\n\n“Once or twice.” Lance pulls out an antiseptic wipe. “Hold still.”\n\n\nKeith sucks in a sharp breath when the cold, wet fabric touches his exposed skin. It stings like hell and he grits his teeth. \n\n\n“Sorry,” Lance murmurs. \n\n\nHis fingertips brush over Keith’s side and Keith hopes to high heavens he won’t notice the goosebumps breaking out over him, which he probably will because they’re everywhere. But then again, Lance is an idiot. And Keith hates himself for actually enjoying this. There are more important things to be concerned with, but Lance is so close and he’s touching his naked torso and shit, Keith never thought he’d be in this situation, ever. He was not prepared for feelings about Lance to suddenly assault him, and now of all times. \n\n\nLance seems to take his sweet time wiping down the cut and bandaging it. Keith watches the way he focuses closely on what he’s doing, brow furrowed and gaze glued to his hands, with a hot face and a chant of he is not cute he is not cute he is UGLY playing in his mind. \n\n\nWhen he ties off the bandage and draws back, Keith is almost disappointed. Almost. \n\n\n“There,” Lance says, looking quite pleased with himself. “I think you’ll live.”\n\n\nKeith rolls his eyes and pulls his shirt back down. “What would I ever do without you.”\n\n\n“You’d be really lonely right now, that’s for sure.”\n\n\n“Hmph.” Keith’s about to dismiss the comment (however true it might be) before he notices the sag around Lance’s eyes and the odd tightness to his mouth. And that’s, well…that’s not normal. He doubts it can be attributed to physical pain alone, either. \n\n\nOh, great. He regrets the words before they’re even out of his mouth. “I…I am glad you’re here, Lance.”\n\n\nThe blue paladin’s eyes widen marginally as color rushes to his cheeks. His head snaps up and he scratches the back of it, a motion Keith has come to learn means he’s feeling uncomfortable. “Yeah, well…I’m glad you’re here too. I was—I was really scared when I first woke up and Blue had no power and I couldn’t get in touch with anyone.”\n\n\nThe thought of Lance being stuck here, injured and alone, makes Keith feel kind of sick. I’m glad I’m here for you, he thinks, and wishes he could find it in himself to say it aloud. Damn. He’s really not good with all this sappy, emotional stuff. He was in the same position in the castleship not too long ago when he’d run to Lance’s side and watched him smile bravely and speak his heart despite being gravely injured and in pain. Keith could only reply with a smile then, and he can only reply with a smile now. \n\n\n“Thanks, Keith.”\n\n\nThat makes him pause. He looks at Lance quizzically. “For what?”\n\n\nLance’s face is blazing now. “For…taking care of me. I couldn’t…I don’t know what I would’ve done if you weren’t here.”\n\n\nKeith’s heart flutters uncomfortably in his chest. This—this is what he finds so endearing about Lance. It must be. That underneath that self-assured, cocky facade, he’s uncertain and sincere and so, so kind. Underneath his flaws is the kind of character that Keith’s always wished he had. He doesn’t get many glimpses of it, but he must have seen just enough to make him care more than he ever wanted to about this stupid, lanky boy. \n\n\n“Well,” Keith says, trying desperately not to let on how warm he’s feeling. “It’s the least I can do for a teammate, yeah?” Teammate. Yeah, sure.\n\n\nLance gives a short laugh and looks down at his lap. “So…I told you something. Just before the crash.”\n\n\nKeith tilts his head. “Did you?”\n\n\nThe blue paladin’s eyes flicker between Keith’s face and his hands uncertainly. He shuffles a bit and clears his throat. “I guess you don’t remember. That’s okay. It wasn’t…important.”\n\n\nKeith thinks back. Honestly, the most he remembers before the crash was flashing lights and wailing alarms and spinning and screaming and chaos. But…he does remember Lance saying something. He’s remembered it before, but he thought there was no possible way he could be remembering it right. The more he concentrates now, though, the clearer he can hear Lance’s voice cutting through the pandemonium. He’d said—\n\n\nOh, god.\n\n\n“You said you would kiss me, if we made it out alive.”\n\n\nLance is blushing to his ears, but he nods and meets Keith’s eyes. “Yeah. And we’re alive.”\n\n\nKeith is breathing hard, now, and his stomach starts turning somersaults in his gut. “I’d say that’s pretty important.” \n\n\nAnd before he can lose his nerve, he leans in. One hand curves around the back of Lance’s neck to draw him closer. He sees Lance’s eyes flutter closed right before their lips press together firmly. It’s a sloppy kiss, desperate and eager, but nothing has ever set Keith on fire like this before. He hadn’t realized just how hungry he’d been for physical contact. And judging from the way Lance is kissing him back, he feels the same way. \n\n\nThey’re anchored to each other in this moment, both physically and emotionally. Twenty-four hours ago, Keith might’ve gagged if he’d known he would ever have to rely on Lance for anything. But now he can’t think of anyone he’d rather be stranded with, and he wants to be close to him. \n\n\nHe’d be lying if he said he’d never thought about kissing Lance before. He’d never thought seriously about it, of course, because that would have been stupid. But when he had thought about it, he’d imagined their first to be slow and gentle, unsure and experimental, the way first kisses usually are. He should’ve known better. There is nothing slow and gentle about this. It’s not aggressive, really, but it is hungry, and passionate. Like they’ve both been waiting for this for so long that they can’t hold back. There’s a lot more tongue and teeth and saliva than Keith would have thought. He chalks the way he grabs at Lance’s face and neck and arms up to the fear that’s been sitting under his skin since he woke up from the crash, the need for reassurance and comfort. The kind he’s been wanting to give to Lance. \n\n\nThey pull back when one of Lance’s hands grabs his ribcage and accidentally presses on the tender bruising there. Keith instinctively backs up and gasps in pain.\n\n\n“Oh, shit, I’m sorry,” Lance says, breathless and wincing. “I’m sorry, I—”\n\n\n“It’s fine,” Keith says, panting for air. \n\n\n“I ruined it—”\n\n\n“Lance, it’s okay.” He cups the back of the taller boy’s head and draws it forward until their foreheads are pressed together. “You didn’t—ruin it, I—”\n\n\n“Um.” Lance’s eyes, up close, are dazzling, especially when his pupils are blown so wide that Keith can see stars in them. “I’ve…been wanting to do that for a while.”\n\n\n“Could’a fooled me.”\n\n\nLance laughs. His entire mouth is wet. “I’m sorry. Was that…okay? I mean—”\n\n\n“Yeah.” Keith nods a little. “Yeah, it was—good.”\n\n\nThe other boy lets out a loud sigh. “Oh, man.” Then he pulls Keith forward and wraps his long arms around his shoulders tightly. “You know, I’ve never actually hated you.”\n\n\n“That’s good to know.”\n\n\n“I might think I do, sometimes, but I…I don’t.” \n\n\n“You’re such a romantic.”\n\n\nLance’s back shudders as he laughs. “I’m really scared, Keith.”\n\n\nKeith breathes out, long and slow, and winds his arms around Lance’s waist. “Me too. But we’ll—we’ll be okay.”\n\n\n“You don’t know that.”\n\n\n“Yes I do. We’ve got a universe to protect. We’re too important to die here.”\n\n\n“And you call me arrogant.”\n\n\nKeith squeezes him and draws back. Lance looks shaky, but he’s still smiling despite the terror in his eyes. Keith smiles back, reassuring and confident. “You are arrogant.”\n\n\n“Well, so are you.”\n\n\nHis heart isn’t in it, but the fact that he’s back to arguing is comforting. Keith leans forward to kiss him again, quick but meaningful. “You know, you scared me earlier. But if we’re back to insults now, I guess that means you’re going to be okay.”\n\n\n“Of course I’m going to be okay.” This time, he’s the one that leans forward to kiss Keith. \n\n\nWhen they pull back, Keith places a hand on his chest. “We should probably get to sleep.”\n\n\nLance nods, a bit reluctant and a bit relieved. If Keith’s feeling this worn out, he can only imagine how exhausted Lance must be. \n\n\nHe rolls out the sleeping bags from the emergency packs and arranges them next to one another by the fire.\n\n\n“Why two?” Lance asks. \n\n\nKeith unzips one. “One for each of us, stupid.”\n\n\n“We can’t…I don’t know, share?”\n\n\nHe makes a face. “No. You smell.”\n\n\nLance gives an offended noise. “You just made out with me!”\n\n\n“That’s how I know you smell.” With a sigh, he sits back and rests an arm on his knee. “Look, we’re both injured, and you’re probably one of those people who move around a lot in your sleep. I don’t want you to hurt yourself.”\n\n\nAnd just like that, the irritation melts off Lance’s face and is replaced by a corny grin. “Aw, you’re worried about me.”\n\n\n“No, I’m not.” \n\n\n“Yes, you are.”\n\n\n“Lance, get in your sleeping bag and go to sleep.”\n\n\n“Okay, okay. Jeez.”\n\n\nKeith ends up having to help him get his leg situated inside. He really is concerned about Lance jostling it in his sleep, but there’s not much he can do. Once he’s settled, he crawls into his own bed and zips up the flap. \n\n\n“Goodnight, Keith,” Lance says, smiling over at him childishly. \n\n\nKeith rolls his eyes at the dorky expression. “Goodnight, Lance.” He closes his eyes, looking forward to getting some sleep after such a rough day.\n\n\nUntil Lance clears his throat. \n\n\n“Um. Keith?”\n\n\n“What?”\n\n\n“Can we, like…hold hands?”\n\n\nKeith’s eyes fly open. “Hold hands?”\n\n\n“I, uh…” \n\n\nWhen he looks over, Lance is red again, which he thinks is a bit ridiculous since they just spent so much time locking lips, but there’s something else. Something that reminds Keith of a small child, asking his parents to sleep in their bed during a thunderstorm. \n\n\n“I just would—I think I’d feel better. If we did. But if you don’t want to—”\n\n\n“No, it’s…” Great, now Keith is blushing again, too. This is utterly ridiculous. “It’s fine. I don’t mind.”\n\n\nAnd so he reaches out and his fingers find Lance’s, calloused and spindly. They twine together, and Keith won’t admit that he instantly feels better like this, too. \n\n\n“Goodnight, Keith.”\n\n\n“Goodnight, Lance.”\n\n\nKeith falls asleep with hope in his chest and the sense that everything really will be okay. They’ll find the rest of their team, and eventually they’ll save the entire universe. It’s all stemming from the warm hand that’s wrapped around his. They’re scared, but they’ll make it. \n"
}