{
    "id": "7502169",
    "url": "https://archiveofourown.org/works/7502169?view_full_work=true",
    "author": [
        "MilkTeaMiku"
    ],
    "title": "My Youth Is Yours",
    "rating": "General Audiences",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Voltron: Legendary Defender"
    ],
    "relationships": [
        "Keith/Lance (Voltron)"
    ],
    "characters": [
        "Keith (Voltron)",
        "Lance (Voltron)",
        "Shiro (Voltron)",
        "Pidge (Voltron)",
        "Hunk (Voltron)",
        "Allura (Voltron)",
        "Coran (Voltron)"
    ],
    "additional_tags": [
        "Fluff",
        "Domestic Fluff",
        "Age Regression/De-Aging",
        "Space Dad Shiro (Voltron)",
        "Hurt/Comfort",
        "Kid Fic",
        "Don’t copy to another site"
    ],
    "language": "English",
    "series": "Part 1 of Seven Days",
    "published": "2016-07-16",
    "completed": "2016-07-25",
    "words": "29,980",
    "chapters": "10/10",
    "comments": "1,133",
    "kudos": "11,810",
    "bookmarks": "1,629",
    "hits": "158,858",
    "summary": "<p>An unforseen blast in the middle of a battle de-ages Lance into a child for a week. </p>\n<p>Keith does not understand babies.</p>",
    "notes": "<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>guessibetter / cosu drew some super cute <a href=\"https://twitter.com/guessibetter/status/754852484317847552\" rel=\"nofollow\">fanart</a> ❤</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_9_endnotes\">notes</a>.)\n</p>\n<p>I had planned for this to only have nine chapters, but it's not finished I'll add one more tomorrow :) This turned out far longer than I expected it to be (mostly because of all the kind responses I've been getting ❤)</p>\n<p>More adorable fanart by <a href=\"https://twitter.com/looz_y\" rel=\"nofollow\">looz_y</a> on twitter <a href=\"https://twitter.com/looz_y/status/757549134718971908\" rel=\"nofollow\">here</a><br>by <a href=\"https://goggles-mcgee.tumblr.com/\" rel=\"nofollow\">goggles-mcgee</a> on tumblr <a href=\"https://goggles-mcgee.tumblr.com/post/149105665198/finished-him-awww-my-cutie-baby-keith\" rel=\"nofollow\">here</a><br>and<br>by <a href=\"https://thecozyscrapheap.tumblr.com/\" rel=\"nofollow\">thecozyscrapheap</a> on tumblr <a href=\"https://thecozyscrapheap.tumblr.com/post/147983990750/has-anyone-read-my-youth-is-yours-by-milkteamiku\" rel=\"nofollow\">here</a></p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_10_endnotes\">more notes</a>.)\n</p>\n<p>Thanks for giving this story so much support! It really means a lot to me to have such positive responses ❤</p>\n<p>I was thinking of maybe doing a baby!Keith version of this, if there's interest? It'll be much shorter than this, just to explore Keith as a child ^^\" I'm also open to other suggestions for what to write next! I do write (and like to upload) every day so suggestions here or on my <a href=\"https://milkteamiku.tumblr.com/\" rel=\"nofollow\">tumblr</a> are more than welcome ❤</p>",
    "text": "It hadn’t been anyone’s fault, not really. None of them quite knew how it had happened, or exactly  what  had happened in the first place, but what’s done is done and it didn’t seem like there was anything they could do to change it. At least, they didn’t think they could.\nLance was a baby.\nNot as in acting like one or being immature – Keith thought that that was always the case with the Blue Paladin – but as in he had somehow been de-aged quite a number of years, like time had been rewound. They’d been fighting on the furthest outskirts of Galra territory against a monster that they’d never seen before when Lance and Blue had been caught up in a self-destructive blast. They hadn’t known the monster was purposefully luring them in to catch them in the blast, but Lance had somehow realised it last minute, and drive Blue into the monster, sending them both careening far away from the other Paladins.\nHe’d saved them, yeah, but at what cost? It was stupidly infuriating to feel so damn  worried  when Keith just didn’t want to care. It was a nagging thought in the back of his head that only appeared when Lance got himself into serious danger, and it was infuriatingly distracting. \nThe first sign of trouble had been when the Blue Lion hadn’t gotten up after the blast. While their Lions weren’t exactly indestructible, Keith knew for sure that a blast with the radius he’d witnessed wouldn’t have done crazy damage. Lance should have been more than capable of shaking it off and returning back to them, like he always did. They could still reach him through the communications system and the Lion hadn’t turned itself off, but Lance wasn’t answering, not even when Shiro ordered him to report back to them.\nAnd then they’d heard it – a child’s cry.\nShiro had been the one to investigate, his metal hand held poised and glowing. They’d dropped their Lions beside Blue once everyone had returned to the Castle and waited on the ground in the hangar for Shiro to re-emerge. His small sound of surprise was noticeable through their helmets and Keith couldn’t help but tense, instinctively reaching for his bayard. \nBut nothing dangerous had come out after Shiro. Instead, Shiro had walked out of the Lion's mouth with a tiny child cradled in his arms, wrapped up in the shirt Lance wore under his suit.\nKeith didn’t think anything weirder could have ever happened. \n“How did this occur?” Allura demanded as she paced behind the couches in the common room. Keith wasn't sure if it was a question she really wanted them to answer. \n“We don’t know,” Shiro answered. They didn’t have any clothes that would fit Lance as he was, so he was wearing of Pidge’s smaller shirts. Shiro had him held in his lap on his crossed legs, and for now Lance was quiet, content to let Shiro wrap the shirt around him securely. “But it was probably because of that blast at the end. It was designed to incapacitate us like… well,” he held up Lance a little higher, “like this.”\nAllura leaned closer to peer at Lance. “I’ve never been this close to a human child before,” she said. Her eyes were alight with rapid curiosity. “May I hold him?”\nShiro hesitated for a moment, then frowned to himself, and carefully handed Lance over.\nLance’s big eyes drifted up to Allura’s face. He glowered at her furiously, like he was confused by her open expression or by the way she looked, and it made Keith tense again. Then, without any warning, Lance began to wail. His cries were high and sharp and they echoed around the room and cut straight at Keith’s heart like nothing else ever had. \n“Oh no, what have I done?” Allura worried, her eyes widening. She rocked Lance in her arms like a mother would but he only cried louder, his cheeks going splotchy and red. “Shiro-”\nAt Allura’s insistence, Shiro took Lance back. Lance seemed to fit in Shiro’s arms better, and he didn’t shy away from the metal one. Somehow, he looked more natural there. Maybe it was Shiro that looked comfortable with a child. When Shiro rocked Lance he quietened until he was only whining softly. \n“You’re good with children, Shiro,” Coran pointed out. \n“Am I?” Shiro asked, flustered. “I haven’t had much experience with them before...\" \n“I’m not sure how I upset him,” Allura said. She held her hands to her chest as though they had been burned, her face full of guilt. \nShiro frowned a little. He didn't really seem like he'd stopped frowning since they found baby Lance. “I don’t think it’s anything you did. We’ve connected by Voltron, so maybe he recognises us Paladins a little better. Either way, we have to figure out how to fix him,” he said. “There’s no way we can form Voltron like this. Lance is far too defenceless.”\n“The Castle should be equipped with an incubator that can run diagnostic scans on him,” Allura said. “It’s down in the infirmary. We used it to help ill children.”\n“Alright, we’ll take him there,” Shiro said, standing. “The next time we come across a peaceful planet we’ll have to pick up children’s clothing, too. I doubt he can go around wearing Pidge’s clothes until he returns to normal.”\nIt sounded rational coming from Shiro when he said it like that, but some part of Keith said it definitely wasn’t. Lance was a  baby  and they had to get him  baby clothes.  What could possibly be rational about that? Nothing, that’s what. At least he wouldn’t have to listen to that idiot’s rambling for a while.\nStill, he followed the rest of the team down into the infirmary, reluctant to miss anything important. He didn’t have any siblings and he’d never really been around children; they were more alien to him than actual aliens. Still, his eyes were drawn to Lance’s chubby little face the same way his eyes were drawn to something particularly disgusting – he just couldn’t look away. \nLike Allura had said, the infirmary did have a small incubator. It looked like it was made for newborns, which made Shiro hesitate again. “He’s probably been de-aged back to between eight and sixteen months old, I can't quite be sure. Is he going to fit in there?”\n“I’ll make it bigger,” Allura answered. When the incubator had been expanded, Allura turned it on, and it powered up with a soft whir. Shiro gently lowered Lance in, who only continued to scowl and flail, looking like a fish out of water. How did babies survive into adulthood? They looked so vulnerable. Keith didn’t understand it.\nA soft, blue light engulfed the ends of the incubator as a ray of light passed over it. Pidge crept closer, intrigued by the machine, and they all stood silently as it ran scans on Lance. Transparent screens detailing the results began to fill the air as the scans were each completed. Some flickered in and out faster than others, which made Allura raise her brows. \n“What is it?” Shiro asked. \n“His vitals are all normal,” Allura answered, surprised, “but it seems that this form is only temporary.”\n“How long?”\n“A week, perhaps?” She frowned once, and flicked a few of the screens away with a wave of her hand. “His cells are rapidly expanding and compressing, which indicates growth, but as you can see he isn’t getting any bigger. I’m sure he will revert to his normal age once the effects of the blast have worked their way through him.”\n“Is there any way to help him?” Hunk asked. He had a concerned pinch in his brows. “I mean, babies need a lot of care, right?”\nAllura made a contemplative noise. “I think we can only wait it out and hope that no Galra fleets come hailing us,” she said, “but I think it would also be beneficial not to let Lance stress himself out. Crying, for example, should probably be avoided if at all possible.”\nShiro nodded. “Alright. Can I take him again?”\n“Go ahead.”\nShiro picked Lance back up as the incubator turned off. “We’ll have to find somewhere for him to sleep and see if he can stomach your food. This is certainly going to be an interesting week...”\nThe Castle of Lions was equipped with a nursery for children located close to the infirmary, but it hadn’t been attended to since Allura and Coran had awoken. Since Lance started to cry when Shiro tried to pass him over to Allura, it was up to the Paladins to clean up the room. They didn’t know how the Altean people originally organised the nursery, but they made do. Shiro watched over them as they righted what looked like knocked over cribs and cleared away dust and debris.\n“I don’t see why we have to do this,” Keith muttered to himself. \n“Lance needs it,” Shiro reminded him, voice gentle but insistent. “Even if he is technically our age, in this form, he’s much more vulnerable.”\nIt was the same thought that Keith had had earlier that day. He didn’t know much about children, but he knew they got sick a lot easier than adolescents. Must be their weaker immune system, or something. Would Lance be susceptible to things like colds and fevers? More importantly, why did he care?\n“These cribs look like they’re in pretty good condition, though,” Hunk, ever the pacifier, said. He heaved one upright and dusted it down with a spare cloth, looking pleased with himself. “This is what babies sleep in, right? Lance will be fine in it?”\nShiro nodded. “I think so,” he said. “I really don’t have much experience with children, though…”\n“Doesn’t seem that way,” Hunk said, laughing. Keith was inclined to agree. “Lance likes you the most!”\nA small smile came to Shiro’s face. “I’ve only tried to give him to Allura,” he pointed out. “Who knows, he might end up liking Keith the best.”\nKeith grimaced. “What? Please, no. I hate kids.”\nHe only received laughter for his distaste. He went back to repairing panels on the wall that had been dislodged with a sour scowl. Why didn’t they believe him? He hadn’t made any move to touch Lance, and he’d never been particularly friendly with anything smaller than him, Pidge excluded. The only reason he was helping clear out the nursery was because Shiro had told him to.\n“There we go,” Shiro said, gently lowering Lance into the clean crib after they’d finished clearing out the room. “How’s that, Lance? All good?”\nLance whimpered when Shiro drew his arms away. It was a strange sound to hear, one that drew immediately Keith’s attention. Did all babies make such sad sounds? Was it a Lance thing? He thought babies were meant to be happy and drooling, or something. Not sad.\n“Doesn’t he like it?” Hunk asked, peering over into the crib. Curious, Keith crept closer, giving the crib an analytical look. Lance was looking up at them all, eyes wide and watery, as they watched him sit in the crib. He didn’t seem to hate it, but he didn’t seem to like it, either. It made Keith’s head hurt just thinking about it.\n“Maybe he’s just tired,” Pidge said. He reached in a hand to rub his knuckles over Lance’s cheek and grinned when Lance’s attention turned away from the lack-of-Shiro to him. “My neighbour had a kid recently, and she always cries when she’s tired.”\nA beeping through their helmets signalled Allura opening the communication lines. “We’re approaching a planet where we can gather supplies,” she said, “but we cannot dock near them, and we cannot stay for long. You’ll have to take a passenger pod to the surface.”\n“Alright,” Shiro answered. “Hunk, do you know what food we can give a child?”\nHunk nodded. “Should do.”\n“Then you’ll come with me,” Shiro said. “Pidge, do you remember what clothes your neighbour’s child wore?”\n“Yeah, I’ll come with you.”\n“What about me?” Keith asked.\n“You stay here with Lance,” Shiro answered. \n“What? Why?”\n“Someone needs to,” Shiro said. “Don’t worry Keith, you’ll have Coran and Allura with you. You’ll be fine.”\n“Actually, I’ll come with you,” Coran interjected. “We need more supplies for us, as well.” \nKeith frowned. “But Lance doesn’t even like Allura!” He said. He winced at the wording – he wasn’t good at  feelings  and making sure not to hurt them – but shook it off. “Not to mention he probably doesn’t like me, either. He only likes you.”\n“You’ll be fine,” Shiro repeated, firmer. “Just hold him if he cries, and if that doesn’t work, try feeding him or changing him-”\n\n “Changing?” \n\n“We don’t have time for this,” Allura said. “Get to the passenger pod and I’ll send you down. Hurry now.”\nAfter casting Keith a last look, Shiro and the others left. Keith was filled with a weird, uncomfortable feeling as both he and Lance watched the rest of the team exit. Soon enough, the only people in the room were them. Could people leave babies alone? Would Lance die if he left him to sit in the crib until Shiro got back? Just thinking about it made him wince. \n“Allura, do you know how to take care of children?” He asked.\n“I’ve been around Altean children, if that is what you’re asking me,” she answered. “Human children seem far… fussier.”\nHe groaned. “Well, I don’t know what to do,” he said, frustrated. “You come take him.”\n“Calm yourself, Keith,” she advised, sighing. “Is he causing trouble?”\n“No, he’s just sitting there,” Keith groused. “Are children meant to just sit there? He looks like he’s going to start crying.”\n“Bring him up into the control room,” Allura said. “He’ll probably be calmer around more people.”\n“How am I meant to do that?”\n“Pick him up.”\nKeith was silent for a moment. “How?”\n“Keith do not make me come down there just to show you how to hold a child.”\n“What if he cries?”\n“Then  comfort him,”  she huffed, before disconnecting the communication line. Keith gave the quiet line an irritated scowl before turning back to face Lance. He was startled to find that Lance was staring at him. In any other situation he would have thought he had something on his face.\n“Alright,” he said quietly, “let’s make a deal. You don’t cry, and I won’t drop you. How’s that sound?”\nLance’s gaze only became more persistent. A pucker appeared in his brows as he stared, utterly focused. \nKeith hesitated once before leaning over the edge of the crib. “Easy, easy,” he muttered, slipping his hands under Lance’s armpits. He was surprisingly  soft  – sure, Lance had a beauty routine to rival all beauty routines, but this was different. When he lifted Lance, he was heavier than Keith had expected, and there wasn’t any muscle tension in his little body. “Floppy,” Keith said to himself as he lifted Lance to his eye level. “Why are you floppy?”\nLance frowned at him and whined. His limbs flailed and it was so unexpected that Keith nearly dropped him. His grip tightened on Lance and Lance let out an uncomfortable cry that made a deep, hidden part of Keith panic. He didn’t want Lance to cry because of  him.  He quickly readjusted his grip on Lance, trying to mimic the way Shiro held him. He supported Lance’s head when he felt like it would just roll off and settled him in the crook of his arm. Lance didn’t fit there as well as he fit in Shiro’s arms, but it was workable. \nIt was hard to walk and carry a squirming child at the same time. Lance kept making these noises and Keith didn’t know what they could possibly mean. Eventually he shifted his hold on Lance, settling him on his hip instead. That seemed to please Lance a bit more, who then returned to staring.\nIt was reassuring to know that even as a child, Lance was the weirdest person Keith knew. \nAllura was standing by the control panel as she watched the pod descend into the atmosphere of the planet they were docked near. It was nothing but a small, glowing light now. “He seems calmer,” she remarked as Keith walked closer.\n“Then take him,” Keith said, irritated. \n“Will he cry?”\n“How am I meant to know? Just take him.”\nHesitantly, Allura took Lance into her arms. He let out an unhappy noise but quietened when Allura rocked him. “At least he didn't cry this time,” she said, relieved. “I must admit, he is rather cute, don’t you think?”\nKeith flushed. “What? No. No, definitely not.”\nAllura chuckled. “If you say so,” she said as she turned back to face the view outside the castle. “See out there, Lance? Isn’t it pretty?”\nKeith frowned. That was baby talk. They were talking to a baby. He just couldn’t wrap his mind around it, and as much as he was constantly irritated by Lance, the sooner he returned to normal, the better.\n \nShiro, Pidge, Hunk and Coran returned from the planet later that evening. They carried in bags of clothing and food and things to restock the Castle’s nursery, like bottles and blankets and even a few, small children’s toys. \n“Why is he crying?” Shiro asked. He dumped the bags by the entryway into the common room in favour of scooping Lance up from where he was seated on the couch.\n“How am I meant to know?” Keith growled back. “He just won’t stop.”\n“What happened?”\n“We tried to place him down and he starting crying,” Allura explained. She looked a little frazzled, though not as much as Keith surely did, and worriedly fiddled with both her hands. “I tried feeding him and holding him like you said, but he hasn’t stopped.”\nA frown touched Shiro’s face. He heaved Lance higher up into one of his arms and reached for the bags again. “Alright, I’ll go change him and see if that helps,” he said.\nSilence finally reached the room and Keith couldn’t be gladder. He fell against one of the couches and groaned, rubbing his temples. Lance’s cries were loud and piercing, but there was something more than that that bothered him. Those cries clawed at his mind and persisted in his ears and he felt a surge of helplessness overcome him, one he hadn’t ever felt before. He felt incredibly  responsible,  and it wasn’t pleasant, because he didn't know why he felt that way.\n“Is Keith alright?” Hunk asked Allura quietly. “He seems upset.”\n“Well, I… I am unsure,” Allura answered, just as quiet. “I think this situation is just very taxing on him. Lance kept reaching out for us as well, and neither of us knew how to react… I feel very useless. I wish to help Lance, but I do not know how.”\n“It’s alright,” Hunk comforted, “we’ll figure it out.”\nHunk and Coran disappeared into the kitchens to put away the food and Allura took care of the things that went to the nursery. Pidge took a seat across from him and tossed him a water bottle that he’d grabbed from one of the bags. “You alright?”\n“My head hurts,” Keith muttered. He drank half the water bottle before recapping it and putting it aside. “Lance is louder than ever.”\n“I think he’s just scared,” Pidge said. “I mean, who knows if he still has his normal mind or not?”\nKeith hummed.\n“Hey, do you remember when we were sharing memories,” Pidge hesitated before shaking his head. “Do you remember what Lance’s was?”\nKeith frowned. He hadn’t paid much attention to Lance when they were doing that, and he hadn’t been interested in rooting around in Lance’s head. The pressure of learning to form Voltron had been distracting, but still… There was a faint memory in his mind of a family. “Yeah? What of it?”\n“Well, do you think that Lance was ever left alone as a kid?” Pidge asked. “I mean, his family is  huge.  He has a lot of siblings, and aunts and uncles and stuff. Maybe that’s why he doesn’t want to be put down.”\nKeith didn’t understand that. He didn’t really have a family, and the concept of living with such a large amount of people was very foreign. He appreciated his alone time and didn’t understand why people would willingly give theirs up to extensively socialise. Besides, why would a baby want that? Keith thought that a baby would want to be put down so they could crawl around and destroy things.\nHe didn’t say any of that, though. He didn’t think it would be well received.\nA moment later, Shiro came back into the room carrying Lance, who was now wearing a tiny sweater and striped pants. Shiro had slanted a beanie on his head to keep his ears warm and little socks on his feet, though one had been half wrestled off. “The clothes fit well,” he remarked, pleased, as he took a seat beside Keith. “He seems happier now.”\nLance craned his head back to peer at Pidge. He seemed surprised to find himself back in the room he was in before, and squirmed in Shiro’s grip. Shiro held him by the waist as Lance stood in his lap, and then suddenly Lance’s head whipped to the side and he resumed his furious staring at Keith. \n“Why does he do that?” Keith demanded. “He keeps staring at me.”\nShiro laughed. “Maybe he just doesn’t like your hair,” he teased. \nKeith held back a glare. \nLance only made a huffing noise at him, squirming in Shiro’s grip again. He didn’t seem like he wanted Shiro to let go of him – more like he was content to be held. Keith thought that out of all of them, Shiro was probably the most parental. Somewhere along the way he’d slipped straight into a leader role for the Paladins and he did tend to have the calmest temperament. \nWhen dinner time rolled around, Shiro held Lance on his lap as they sat around the dining table. Hunk had prepared the food they bought for Lance and as it cooled down they ate their own meals. Shiro had tried to feed Lance a spoonful of the green goo that Alteans favoured but Lance had rejected it with a disgusted sound.\n“What exactly did you buy for him?” Allura asked after Lance had rejected the food. \n“Well, on Earth, infants and young children are mostly fed breastmilk, pureed vegetables and fruit, and sometimes soft solids like bread and biscuits. For mothers that don’t breastfeed there is a powdered formula with the same nutritional content that can be mixed with water to form milk,” Hunk explained. “And before you ask, I did have to look that up.”\n“We feed our children something similar, I believe,” Allura nodded.\n“We found something like baby formula that he might be able to stomach,” Hunk said, gesturing to the bottle being cooled on the tabletop. “And we found these weird alien fruits that I’ll puree tomorrow, too. He should like them, and I already tried one, so they’re safe to eat.”\nWhen the bottle had finally cooled enough so that it would not burn Lance’s mouth, Shiro pushed his plate away and had Lance sit on one of his knees. While Lance did seem strong enough to hold the bottle up on his own, he didn’t seem to have the energy to do so, and instead Shiro did. Thankfully, Lance drank from it with nothing more than a scrunched up nose at the taste.\n“The nursery is set up, right?” Shiro asked.\nAllura nodded again. “Yes, there is a crib and blankets waiting for him,” she said. “I repaired one of the security cameras to monitor him and hooked it up to feed straight into your helmets in case he starts to cry. Do you think he is old enough to sleep through the night?”\n“Well, we’ll find out,” Shiro said. \nDinner passed relatively uneventfully after that. Lance drank the whole bottle before dozing quietly in the crook of Shiro’s elbow while the rest of them finished their meal. Even though Keith kept telling himself he didn’t care, he couldn’t help but watch Lance out of the corner of his eye. When he wasn’t crying or whining, he looked kind of… kind of cute?\n\n Alright, let’s not go there. \n\nStill, when it came time for them all to go to bed, Keith found himself following Shiro and Allura down to the nursery. Lance was all but asleep in Shiro’s arms but he stirred when Shiro lowered him into the crib. He made a small, inquisitive noise and reached out a little hand for Shiro again, but Shiro only pulled the blankets up over him and straightened.\nAs he walked out of the nursery to join Keith and Allura, Lance started to cry. At first they were tentative, searching sniffles before they became outright wails that produced the same, clawing effect in Keith’s brain. It had him wincing, and for some strange reason, he was reminded of how Lance’s weight had felt in his arms.\n If he held him, he would stop crying, right?\n\n No, no that’s not my job. He’ll just cry himself to sleep, that’s what babies do. \n\n“Will he cry all night?” Allura asked, concerned, after they’d waited several minutes outside the door. “He’s really working himself up…”\nShiro frowned. “You said we should avoid letting him cry, right? Maybe it would be better if we moved the crib into one of our rooms for the night.”\nAllura hummed thoughtfully. “That might work, actually, though I do not think it would be wise to leave him with either Coran or myself. You said it yourself – we do not share the same bond that you, as fellow Paladins, do. Would you be willing to take him, Shiro?”\n“Of course, but I don’t think I can take him every night,” Shiro said. “I’m still unsure about this whole situation myself, and…”\n“It’s alright,” Allura said.\nKeith was pretty sure he knew what Shiro was going to say. Shiro still experienced stress from what had happened to him while he had been captured by the Galra, and he probably had nightmares. If he had an episode while Lance was crying he might not be able to help, or he might unintentionally lash out. \n“We’ll make a roster system, then,” Allura said.\n“Wait, what?”\n“Everyone will have to pitch in, Keith,” Shiro reminded him gently.\nKeith wanted to argue more, but another loud wail from Lance made him shut his mouth.\n“I’ll take him tonight,” Shiro said. “Allura, can you go tell the others what we’ve decided? Pidge and Hunk will need to know.”\n“Alright.”\n“Keith, you’ll need to carry Lance,” Shiro said. “I’ll carry the crib.”\nKeith winced. He probably should have gone to his room, but some part of him was glad he had the opportunity to hold Lance again. He would be sure to bury that part into oblivion later, but for now he silently followed Shiro back into the nursery.\nShiro lifted Lance out of the crib and soothed him until his cries became nothing more than petulant grizzles. He wiped Lance’s damp cheeks dry with the edge of his shirt before carefully passing him over to Keith. “Make sure you support him,” Shiro said, “so that he doesn’t feel like he’s doing to fall. Hold his head if you can.”\nAs Shiro put extra blankets in the crib, Keith adjusted his hold on Lance. He ended up supporting Lance against his chest as he leaned back a little, with Lance’s head resting on his collarbones. Soft tufts of Lance’s hair were ticking his cheek but he paid no mind to it. With one arm he supported the majority of Lance’s weight and with the either he used his hand to cradle the back of Lance’s head.  His hair really is soft…  \nShiro carried the crib through the hallways with little effort. “I know you and Lance don’t always get along the best,” he started, “but I really appreciate your help, and I’m sure he will too.”\nIt was an odd thing for Shiro to say, so Keith gave him a considerate look. “You feel responsible,” he concluded.\nShiro sighed. “I should have known that the monster was going to explode,” he murmured. “Lance knew, and he threw himself over it. If he hadn’t we all would be like him and Allura and Coran would have no way to care for us.”\nKeith was quiet for a moment. He didn’t know how to respond to that, so he didn’t. “I’m not changing any nappies,” he said.\nShiro laughed. “Alright, alright,” he said, before grinning. “We’ll make Coran do it.”\nEven though Lance had slept in Shiro’s room throughout the night – and consequently cried in Shiro’s room – Keith got little to no sleep. He blamed it on Lance’s crying, but he knew that that wasn’t the reason why he’d been unable to sleep. Sure, he could hear Lance’s crying through the walls of the rooms, but it was very muted. \nHe didn’t really know why sleep evaded him, but he couldn’t stop thinking about Lance. It felt different to spend a day without Lance’s constant commentary and tasteless jokes and his general harassing of Allura. Keith couldn’t say he missed it –  he definitely didn’t miss it  ¬– but the castle seemed very different without it. Empty wasn’t quite the right word, because there were certainly enough people around to make it seem full, but Keith didn’t know how else to describe it. He couldn’t explain what it felt like, and it was frustrating.\nWhen morning came, he was grouchy and unrested but desperate to see Lance again. Just like everything else that desire was unexplainable, and after a while he just stopped questioning it. He wanted to eat and train and get back to doing what he was meant to as the Red Paladin.\nHunk was already serving breakfast with Coran’s help when Keith finally took his seat. Allura was seated at the head of the table as per usual, and Pidge arrived soon after Keith. “I wonder how Shiro is doing,” Pidge said as he slid into his seat. “I wonder if he got any sleep. I heard Lance cry a few times during the night.”\n“So did I,” Keith grumbled. Maybe if they thought he was angry over his lack of sleep they wouldn’t realise he was angry because of Lance’s current state.\nShiro came in just after Coran had finished laying out the food. He didn’t look exceptionally tired but he wasn’t wearing his uniform and his hair wasn’t as brushed as he usually kept it. He carried Lance in his arms, who was now dressed in a blue shirt and black pants. Somehow Shiro had managed to wrestle him into a tiny striped sweater with a little hood to keep his head warm, but Lance had already pulled it down.\n“Good morning, Shiro,” Allura greeted him. “How did the night go?”\n“Alright,” Shiro answered. “He had a tough time going to sleep and I think he got a little frustrated with himself. He woke once for food but after he had been fed he slept better. I think he’ll only wake once a night so long as he gets to sleep okay.”\n“That’s good,” Allura said, sighing. “I’m glad. I created the roster last night, and I thought it might be best if we keep a schedule of the times we feed him. I looked into human children a little and although my resources were slim, it seems that they function better emotionally when placed in a structured routine.”\nThe data screen flickered out of a projector that appeared from the arm of their chairs. Keith leaned forwards to read it. Shiro was scheduled to take Lance first, which he had, and then it was Pidge, Hunk, and himself. Why was he last? It meant that for the seven nights they predicted Lance would be stuck like this, everyone would have him for two nights, except for Keith. Did they not trust him, or something? \nHe didn’t like being last, even in matters like this.\nAt least he didn’t seem like the only once concerned. “I don’t know if I’m going to be able to care for a child properly,” Pidge said, frowning. “I don’t have any experience…”\n“It’s alright,” Shiro said. He took a seat and rested Lance on his knee again, who instantly started reaching across the table to paw at Shiro’s breakfast. “As long as he doesn’t start to cry, he’s actually quite placid. He just wants to be around people.”\nPidge made a disbelieving noise but didn’t speak on the matter again. \n“Shiro, what do you think would be best for us to do while we wait for Lance to return to normal?” Allura asked. “You can’t form Voltron without him, but you can still train without Lance, if you are willing.”\n“I think it would be best to carry on as usual,” Shiro said. He absently pulled his bowl out of Lance’s reach and instead took the bottle of baby formula Hunk offered him. “At least, as much as we can.”\nAllura nodded. “Alright. We’ll have breakfast and then you can return to the training deck.”\n“Who’ll mind Lance?” Keith asked. He flushed when all eyes turned to him and forced a frown. “I mean, it’s not like we can take him into the training room. He’s useless.”\n\n Way to go, Keith. Now you sound heartless. Great. \n\n“Well, I’ll watch him while you all change into your suits,” Allura said, “and then we’ll see how he reacts to being in the control room.”\nIt was a sound plan, so with that decided they returned to eating their meal. It was as strange as ever, Keith thought, even with Hunk’s cooking. He missed the food from Earth, however tasteless and bland it had often been. He didn’t like that he was getting used to alien food, even though he didn’t have a choice in the matter.\nAt least Lance didn’t seem to mind. Keith glanced at him as much as he could while remaining subtle about it and found that Lance seemed perfectly content with what he was being given. Shiro fed Lance first, making sure he’d had the whole bottle before touching his own breakfast. It was hard to believe he’d never had experience with children before with the gentle way he cared for Lance. \nBreakfast continued on relatively uneventfully. Lance was passed to Allura with only a minimum amount of sniffles and unhappy noises, but he quietened when she distracted him with a dangling bracelet she wore. \nAfter changing into his suit, Keith returned to the training deck. When everyone had arrived, Shiro gestured them all over. “Let’s treat this as a good opportunity to practice without the entire team present,” he said. “We won’t always be close to each other in battle, after all. Allura is going to send the combat dummies down and we’ll see how it goes, okay?”\nKeith glanced up at them through the windows into the control room. He could make out Allura and Coran’s figures as they stood before the control panels. Allura was clearly holding Lance and Keith had to fight back the bitter feeling that rose in him. Why couldn’t he hold Lance instead? He trained more than the other Paladins, he could afford to miss one training session.\n\n Wait, no, that’s not right. I don’t care about Lance. I can’t miss a training session! \n\nThe dummies were lowered onto the deck a moment later. There were five – one for each of them, if Lance wasn’t currently being useless. He probably would have been just as useless if he were there anyway, in Keith’s opinion. \n“This is only training level one, so you should just breeze through it,” Allura said over the speakers. “As each simulation is complete, the difficulty will rise. Good luck, Paladins.”\nKeith activated his bayard. The weight of the red sword was comfortable in his hands and he found that holding it helped clear the jitteriness in his head. As the training dummy raised its own weapon, he struck. The clash of the blades rang in his ears but it sounded far away; his body fell easily into the routine of battle.\nHe swung his bayard up through the chest of the dummy and instantly it was swallowed by the floor. He heard the sounds of the other dummies falling and spun to see that four had already been taken care of. The last was taking a swing at Pidge so he ducked forwards and drove his sword through its stomach.\n“Thanks,” Pidge said, breathless, as he lowered his bayard. \n“No problem.”\n“Training level two is beginning,” Allura said.\nSeven dummies dropped from the ceiling this time. They were faster to attack and swung wide blows packed with more weight so Keith didn’t hesitate. He ran for the nearest one and with a cry he swung his blade up. The dummy blocked it but wasn’t fast enough to deflect Keith’s second blow aimed beneath its raised arms. It went down with a loud thump and was swallowed by the floor just like the first had been.\nA second came after him when his back was turned. He let out a grunt as it knocked him across the floor and scrambled to get his feet back under him. Shiro had already taken out two of them and both Pidge and Hunk had taken care of one each, leaving just the last dummy that was now advancing on Keith. He gritted his teeth and charged at it, raising his bayard to block its swing. When he suddenly spun away the momentum caused the dummy to tip forwards, and before it could regain its footing he thrust his blade through it.\n“Well done,” Shiro said as they caught their breath. “Allura, we’re ready for training level three.”\n“I- I apologise,” Allura’s voice came out strained through the speakers. “It seems like Lance is not pleased with it.”\nShiro frowned. “What’s he doing?”\nAllura opened the speakers again and through them came Lance’s unhappy cries. Keith couldn’t see him or Allura that well anymore but he had no doubt that Lance was doing that flailing thing again. “He’s getting too worked up,” Allura said, tense. “I think he believes you are in danger. I cannot distract him any longer.”\nShiro sighed. “Alright, one of us is going to need to babysit him while we continue training,” he said as the glow in his metal hand disappeared. “We’ll take turns throughout the day – I’ll go now, so make sure you continue training, alright?”\nKeith hid a frown as Shiro left the training deck. That weird, bitter feeling was coming back but he shoved it down again.\n“Uh, are we going to be fine on our own?” Hunk asked, concerned.\n“We’ll be fine,” Keith snapped. “Just don’t mess up.\"\n \n“Keith, make sure you  focus,”  Shiro said through the speakers. “You’re not maintaining awareness of your team.”\nKeith growled under his breath. “I am!” He argued. “They’re not paying enough attention to me!”\n“You’re going too fast!” Pidge shouted back at him. “You can’t take on all of the dummies by yourself!”\n“You’re going too  slow.” \n“Keith! Don’t lose focus!”\nKeith let out an irritated growl as he swung his bayard around. It carved up through a dummy but the momentum of it had him stumbling and he hit the ground hard. Another dummy slammed its blade straight into the floor and Keith only narrowly dodged it before Hunk took the dummy out. \nHe didn’t know why he was distracted, but it was pissing him off. Every now and then he’d hear Lance garble something over the speakers and it drove him insane. Why couldn’t Shiro just keep him quiet? \n\n “Keith!” \n\nHe let out a sharp cry when a dummy sent him flying across the room. The blow seemed to shake him to the very bones and although he’d certainly suffered worse he knew get an ugly bruise by evening. It only served to make him more irritated at himself.\nThe training simulation was turned off after that. Keith was left riled up and full of unfocused energy, and without anywhere for it to go he went one more round once everyone had cleared out. By the time he had finished and cooled down, the rest of the team had moved to the dining room for lunch.\n“He just wouldn’t settle down,” Allura was explaining as they sat around the table. “I think he was frightened.”\nShiro nodded. He was standing by the table but Lance was sitting in his seat, oddly quiet. “Maybe he doesn’t like violence.”\n“That’s quite possible,” Allura agreed. “He is just a child, after all. We shall try the maze exercise after lunch, instead.”\nHunk cooked pureed fruits for Lance this time. Shiro sat Lance on his lap so that Lance could reach the table and gave him a little spoon to play around with. Keith petulantly stirred around his own food as he watched Lance make a mess of himself. Were babies always like that? He didn’t know, but he couldn’t look away. He didn’t even care if anyone noticed him staring – glaring – anymore.\n \nThe maze exercise went just as badly as the training dummies. It was Hunk who held Lance this time as Shiro tried to fit in extra training and Allura returned to the main deck to take care of the castle’s travel. Lance simply wouldn’t settle, no matter how much Hunk distracted him. Any time one of them ran into a wall he would only get more and more upset.\nThey didn’t usually run into walls anymore, not since they’d starting forming Voltron and their teamwork had improved. Keith wouldn’t admit it, but he seemed to be the only one distracted enough to actually get shocked. By the third time he’d shocked himself, Shiro decided to call it off. \n“Let’s return to the common room,” he sighed. “We’ll find something else to do.”\nKeith wasn’t the only one agitated. They all liked to do their own thing – train, cook, mess around with machines in the lab – and this Lance situation wasn’t making it any easier. \n“We have to figure out what’s bothering him, fix it, and then return to normal,” Pidge decided as they all took a seat on the couches. “He wasn’t like this yesterday.”\nLance had been set down on the couch between Shiro and Keith. He was frowning at them all furiously and making these noises that almost sounded like words. His eyes were still watery and his cheeks were red, like he was going to start crying again. He’d pulled one of his socks off and was working on the other as they talked, completely oblivious.\n“He’s not hungry,” Pidge said, ticking it off with his fingers, “he won’t sleep, and he doesn’t need to be changed. What else could it be?”\nLance made a troubled noise again and turned his big blue eyes on Keith.\n“What?” Keith demanded. “Why do you keep staring at me like that, huh?”\nShiro just shook his head. “Maybe we can use those memory helmets to see what’s bothering him,” he suggested. “Though I don’t know if Lance will appreciate us rooting around in his mind like that.”\n“Would that even work? He has to be thinking about it for us to see,” Pidge pointed out. “I might be able to fiddle with it, though.”\nShiro glanced away.\nIt did seem like a real invasion of privacy. Lance’s memories were probably very unguarded and unfiltered, and there might be things he didn’t want them to know laid out plain to see. As much as Keith was irritated by Lance, he didn’t feel all that comfortable breaching such an impassable line. \n“Eif!” Lance suddenly cried.\nKeith jumped at the sudden shout. Lance was still staring at him, mouth puckered into a pout.  What the hell was that? \n“Did he just talk?” Hunk asked, eyebrows raised in surprise. “Can he talk?”\n“I don’t know,” Shiro frowned. “Children that age should be able to vocalise things though, right?”\n“What’s he saying?” Keith demanded. “And why won’t he quite staring at me? It’s creepy!”\n“Eif!” Lance cried again. He pushed himself upright and wobbled on his feet, ignoring the way Shiro’s hands jumped to support him around the waist. “Eif!”\nIt didn’t make sense. That wasn’t a word, was it? It just seemed like a sound. \n“Is Lance speaking?” Allura asked as she walked into the room. Her eyes were wide with surprise. “He can stand, too?”\nShiro turned to glance at her, his hands cautiously lowering away from Lance. “We don’t know what he’s saying,” he explained.\nLance startled to wobble across the couch. The cushions were stiff enough to offer some support and although his first few steps were shaky he quickly gained confidence. Keith stiffened from his head to his toes as Lance toddled towards him before abruptly falling against his thighs. “Keif!” He declared.\n“He’s saying your name,” Allura exclaimed. “Did you teach him that, Shiro?”\n“No,” Shiro shook his head. He had this weird smile on his face that made Keith feel flustered and irritated. “He must have heard me shouting it out all day and associated it with Keith.”\nLance reached for the sleeve of Keith’s jacket and feel across his lap with a quiet oof sound. “Keif, Keif.”\nKeith’s hands twitched. “What do I do-”\n“Just play along,” Shiro laughed. “See, I told you he’d like you the best.”\nKeith scowled. “It’s because I kept messing up today!” He argued. “He would learn anything being repeated a dozen times.” To prove his point he tilted Lance’s chin in his direction. “Say Pidge, Lance.  Pi-dge.  Pidge.”\n“What? Why me?” Pidge complained.\n“Idge,” Lance repeated, before scowling. “Keif.”\n“He’s just copying you now, Keith,” Hunk chuckled. “Look at that, he likes to copy you! You’re even wearing the same expressions.”\nKeith’s scowl worsened.\nSo did Lance’s.\n“Stop staring at me,” Keith said to Lance. He didn’t like all this attention being placed directly on him. It was embarrassing. “Shiro, take him back, I don’t want him anymore.”\nShiro laughed again. “He’s harmless, Keith.”\n“Take him!”\n“Alright, alright, hand him over.”\n \nShiro pushed the crib into Pidge’s room after dinner. Keith trailed along after him without meaning to, silently eyeing Pidge. He’d been given Lance to hold for the first time as Shiro moved the crib, and Keith had to hold back his urge to correct Pidge’s grip on Lance. Didn’t he knew he needed to support Lance’s head better? It was too floppy on its own.\n“Alright, he should go to sleep easy now that he’s had something to eat,” Shiro said as he took Lance from Pidge. He cradled Lance in the crook of his arms until Lance’s eyes began to drift shut. “As long as nothing wakes him, he should wake up once at three for another feed and then go back to sleep until morning.”\n“Why does that sound like that could go wrong really easily?” Pidge muttered.\n“Because it can,” Shiro said calmly, “but we’ll try our best to make sure it won’t. If you need any help just come get me, alright? Hunk said he left a bottle of formula in the kitchen so it just needs to be reheated and cooled.”\n“What if it’s too hot and I burn his mouth?”\n“Test it against your inner wrist.”\n“What if he gets cold?”\n“He won’t; he’s dressed warmly and he has his blankets and the interior temperature of the castle is regulated. You know that, Pidge.”\n“But what if-”\n “Pidge,”  Shiro said, “you’ll be fine, don’t worry. It’s just one night.”\nPidge didn’t look convinced. Keith knew that Pidge probably slept the least out of all of them – he was always down in the lab or in the hangers working on something. He seemed more in tune with machines than with children, and even Shiro’s reassurance wasn’t comforting him. Wouldn’t it be easier for someone else to take Lance for the night? Someone who was a little less worried about the fragility of him?\nSomeone like Keith, perhaps?\n\n I must be tired if I’m thinking that… Why am I thinking that? \n\nKeith shook his head at himself. Shiro was lowering Lance into the crib but Lance’s eyes hadn’t completely shut yet. They were a darker blue than they had been before, coloured with tiredness, and they watched Keith as he retreated from the room. With one last look at Lance, taken when he knew no one was watching him, Keith left.\nSomething woke Keith during the very early morning the next day. At first he couldn’t figure out what it was that roused him, but as he fully emerged from sleep he realised that there were noises in the corridor. They were muted at first, but they became clearer the more he listened. He instinctively reached for his bayard and kept it held tightly in his hand as he slipped out of bed.\nThe sound of footsteps echoed through the door when Keith pressed his ear to it. They were familiar footsteps, ones that he’d memorised since he starting living in the castle, and with an exhale Keith lowered his weapon. He knew who belonged to those footsteps and when he opened his door, his thoughts were confirmed. “Pidge, why are you wandering around out here in the middle of the night?”\nPidge stiffened at his voice and cast Keith a wary glance. “Nothing,” he said. “I didn’t mean to wake you.”\nKeith frowned. “Where’s Lance? Why aren’t you with him?”\nPidge scowled. It was a look that held the same kind of nervous tension Pidge used to get before officially announcing that he was not born as a male to them. That look that made Keith back off, made him let Pidge move down the hallway without any more questions. “Shiro has him,” was all Pidge said as he left.\nKeith watched him leave in the direction of the labs before turning back to his own room. If Pidge didn’t want to tell him what had happened, that was fine. Keith had a feeling that Pidge was just too nervous to be responsible for Lance. He didn’t blame him; Keith himself still felt a little like that, too. Keith had fallen asleep easier that night, but now he felt wide awake. Even when he laid back down in bed and closed his eyes his thoughts would not still. Had Lance been crying? Was he sick? He was safe, wasn’t he? Of course he was, Shiro had him. But… He shook his head.\nThey  weren’t  his problems to worry about, so he tried to sleep instead.\n \nBreakfast came and went the next morning and Shiro did not appear. Keith ate with more aggression than usual and scowled into his food like it had offended him. No one asked him why he was agitated, but he thought it was frustratingly obvious. Why hadn’t Shiro come to eat with them like he always did? He’d never missed a meal before, at least not without telling them. More importantly, why hadn’t he brought Lance back to the group? Lance needed to eat, too.\n“Perhaps we should go check on him,” Allura suggested as they cleared away the plates. Shiro’s was left full and untouched.\n“I’ll go,” Keith said without thinking. He received surprised stares for his efforts but left before anyone could mention it. He didn’t need them making him feel any more awkward than he already did. \nShiro didn’t answer when Keith knocked on his door. Keith waited several moments just for propriety’s sake before entering. He expected to see Lance’s crib pushed into the room, but it wasn’t there. Shiro was stretched out across his bed on his back, and that was where Lance slept, too – curled up on Shiro’s chest with a tiny blanket thrown over him. Shiro had one arm stretched behind his head and the other holding onto Lance like a second blanket. His hand encompassed the entirety of Lance’s back.\nKeith felt odd, like he was intruding, and tried not to wince. “Shiro,” he said, reaching for Shiro’s shoulder, “wake up. It’s past breakfast time.”\nShiro woke with a startle, blinking sleep out of his eyes. “Keith…? Oh, I overslept.”\nKeith nodded. He hesitated for a moment, heart racing, before asking, “Want me to take Lance?”\n“Thanks, Keith,” Shiro sighed as he lowered his hand away from Lance. Keith watched it move before his eyes went back to Lance, who hadn’t stirred. Was he meant to just pick him up? What if Lance started to cry? He didn’t want Lance to cry.\nLance felt exceptionally warm when Keith gripped him under the armpits. He made a quiet, mumbling noise as he was lifted but didn’t sniffle. His knees curled up and his hands closed into fists as his eyebrows began to draw in. As quickly as he dared, Keith pulled Lance up into his arms, resting Lance’s head in the crook of his neck. Lance fidgeted once and gripped a fistful of Lance’s shirt before settling again.\n“Okay, okay,” Keith muttered to himself as he carefully walked out of the room. “Same deal as before. You don’t cry, and I won’t drop you. Sound good?”\nLance only made another noise at it. There weren’t any discernible words in his mumbling, but Keith still felt like it was more of a conversation than what he usually got with this particular Paladin. \n“Is Shiro awake?” Allura asked.\n“Yeah,” Keith answered. “He’s coming down now.”\n“Here,” Hunk passed Keith the bottle of formula he’d prepared. “Make sure he eats something.”\nKeith fought down the  I don’t know how to  building in his throat and instead took the bottle. He’d watched Shiro do this enough, surely he could do it too. It didn’t seem that hard. “It’s cool enough for him to drink, right?”\nHunk nodded. \nKeith adjusted his grip on the bottle. Lance was more awake now; he blinked owlishly at Pidge over Keith’s shoulder, but he didn’t stare like he stared at Keith. His attention was easily diverted to the bottle as Keith shifted him around. Keith’s heart was still beating wildly as he carefully fed Lance the bottle. He didn’t know why, but a strange, nervous excitement built in him at the thought of caring for Lance the way Shiro had been. \nShiro wandered in and took his seat when Lance was half down with his bottle. “Sorry about missing breakfast,” he said as he rubbed the back of his neck, “it was a long night.”\n“What happened?” Keith asked, dragging his away from Lance’s peaceful face to look at Pidge. “I thought it was your night.”\nPidge bristled. “I can’t handle kids,” he muttered. “I panicked.”\n“It’s alright, Pidge,” Shiro said. “It’s not your fault. I told you to come to me if you had trouble, and you did. There’s nothing wrong with that.”\n“There is,” Pidge muttered. “Now you’ve had two restless nights and I haven’t done anything to help Lance. Even Keith is doing more than me.”\n“Hey!” Keith protested.\n“Pidge, it really is alright,” Shiro insisted. “Not everyone can handle kids, and that’s perfectly fine. It was a lot of responsibility for us to place on you. It’s cool.”\nPidge sighed. “I’m too used to working in the labs all night,” he explained. “I just couldn’t fall asleep, and because I was awake, so was Lance. He got cranky and kept asking for Keith.”\nKeith’s eyebrows went up. “He did?”\n“Don’t look so happy over that, it’s the only word he really knows.”\nKeith scowled.  You’re just upset he didn’t ask for you,  he thought sourly. Some part of him that he didn’t want to see was smug that he’d been the recipient of Lance’s attention.\n“I want to run another scan on Lance today, if you are agreeable,” Allura cut in. “We should be able to monitor the progress of his cells better now, and find out if he’s healing.”\n“Sounds good,” Shiro agreed. “We’ve been lucky to stay out of the range of the Galra these last few days, but I’m concerned our luck won’t last for much longer. It would be good if we could fit in some training…”\n“But Lance, as he is, is proving to be problematic,” Allura concluded. She gave Lance a contemplative look. “Perhaps two of you can practice hand-to-hand combat while the other two pacify him?”\n \nOddly enough, Allura’s plan worked. Shiro and Pidge paired up to train while Keith and Hunk watched over Lance. With the two of them there, Lance seemed rather content. He was easy to occupy when Keith wasn’t on his own and didn’t have Lance’s unwavering attention focused solely on him. Allura returned to navigating the ship once she was sure everything was going smoothly, and Coran overwatched the training deck. \nLance was seated on the couch between Keith’s legs, playing with one of the toys they’d bought from the last planet. Every now and then he’d abruptly stop and turn to stare at Keith real hard, like he was making sure he was still there. \n“He’s pretty cute if you think about it,” Hunk said. He was messing around with one of Pidge’s laptops. It made a beeping noise every few minutes that surrounded suspiciously like a camera clicking. “I though you said you weren’t good with children.”\n“I’m  not.” \nHunk glanced at him, silent for a moment. “You know, there’s nothing wrong with wanting to spend time with him,” he said. His voice was careful and gentle and somehow, Keith didn’t feel upset by the comment like he thought he usually would have. “I kinda feel the same, like I want him to like me like this, you know?”\nKeith wanted to nod, but he didn’t. He stared at the back of Lance’s head instead.\n“Kids always seem to be the most honest with their feelings,” Hunk continued. “And if one likes you, it feels really good, like you’re a good person. I know Lance – the normal Lance – does care for us all, but I sometimes wonder. He gets real homesick, like he wants to leave and never look back, and I know he wouldn’t ever do that, but I feel bad for him.”\nKeith hummed. He hadn’t thought about it that way. Out of all the Paladins, Hunk was probably the best one to talk to. He was never judgmental and always honest, and he never had anything but their best intentions in mind. \n“Do you miss the normal Lance?” Hunk asked. “Because I do. It seems a lot quieter without him around.”\n“I don’t miss him-”\nHunk gave him a look. “You don’t?”\nKeith baulked and covered Lance’s ears with his hands. “Okay, I do, but you can’t tell anyone! I swear, if this idiot gets any bigger of an ego he’s not going to fit into his Lion.”\nHunk laughed. “Alright, alright, I won’t tell. You know its okay to want to be friends with him, right? Like, that rivalry thing he has going with you is just his way of trying to make friends.”\n “But he doesn’t have a rivalry with you,” Keith pointed out.\n“Yeah, but Pidge and me – we’re different,” Hunk explained. “We’ve all been lumped together since school and our personalities aren’t like yours. Lance likes to rile you up and make you react.”\n“But why?”\nHunk shrugged. “I guess he just wants to be your friend,” he said. “Lance is good at drawing people in, and he does a lot of it purposefully. I think he’s scared of being lonely.”\nHunk’s words certainly gave Keith something to think about. He’d been alone for a long time, but he didn’t know if that meant the same thing as being lonely. He knew Lance was homesick, but he liked to cover it up, and Keith never mentioned it because he knew how vulnerable it made Lance feel. Like rooting through his memories, it was a line Keith knew to never cross. \n“I wonder if Lance will remember any of this,” Hunk mused. \nAt the sound of his name, Lance’s head whipped up. He turned to give Keith that incredibly unnerving stare of his, flailing his little fists wildly. “Keif,” he said, reaching up a chubby little hand. “Keif!”\nKeith only stared. “What do you want now?”\nLance stared back at him.\n“He must find something about your face so interesting,” Hunk laughed. He crossed the room and took the toy from Lance’s hands to wiggle it in front of his face. “Want to play, Lance?”\nLance reached out both hands for the toy, making a small, surprised noise to find it out of his grip. “Keif!”\n“No, I’m Hunk,” Hunk said, pointing to himself. “Hunk.”\n“Hun,” Lance repeated. \n“That’s it,” Hunk grinned. He handed Lance the toy and stood. “Coran should be making lunch by now, I’m going to go check on him real quick. Who knows what he might try to feed Lance.”\n“Wait, you’re going to leave me alone with him?”\n“I think you’ll be fine,” Hunk said. “Lance likes you. Just don’t panic.”\nEasier said than done. Hunk was a calming, solid presence in the room and without him Keith floundered. Lance didn’t seem to mind as much as Keith expected him to and instead turned to clamber across Keith’s lap. He was talking to himself, making sounds and noises that weren’t exactly words. Almost instinctively Keith nodded his head, just like he would if he were listening to a real conversation. \nMaybe he did miss Lance – the normal, talking, chatterbox one, however annoying he happened to be. It would explain why he wanted baby Lance’s attention so much. Was he jealous when other people had it? Maybe that’s why he felt so bitter. It made him feel weird to think it, but it was something to consider. Being better friends with Lance would help their teamwork, too. It wasn’t like they still couldn’t have a rivalry. \nKeith sighed. “Maybe I just don’t want to be alone, either…” He murmured to himself. He’d been afraid of getting attached to the people here, and he tried to keep the idea of alone time as something to look forward to. And sure, while he still liked the idea of having his own company for a little while, he  did  enjoy spending time with his teammates. Could that be called a friendship? Lance called them friends often enough.\nSpeaking of Lance, he’d gone back to doing his staring thing. He stood up on those wobbly legs of his, feet digging into Keith’s thighs, and touched his little hands to Keith’s face. It was such a weird thing for him to do that Keith didn’t react. Eventually Lance’s hands found his hair and, satisfied, he promptly relaxed against Keith’s chest. He amused himself by pulling on the strands, but it didn’t hurt.\n“You’re so weird,” Keith complained. “Even as a baby, you’re weird. What is up with you and your obsession with my hair?”\nLance giggled. It was a pure, tiny bubbling sound that seemed to come straight out of nowhere, and Keith was so surprised by it that he became the one who was staring. \n“Why are you laughing at me?” He demanded, frowning. Lance’s eyebrows drew down into a frown too, and then he was giggling again, pulling on Keith’s hair while he did. \n“You’ve gotten him to laugh!” Allura exclaimed, surprised, as she entered the room with Shiro and Pidge. “How did you manage that?”\n“I didn’t do anything, I swear-” Keith said, flustered. \n“It’s not a bad thing, Keith,” Shiro chuckled. “Laughter is better than crying.”\nKeith didn’t answer. It felt good that  he  was the one to get Lance to laugh first, the same way it was  his  name that Lance first said. It was another one of his embarrassing  I cradled you in my arms  moments, but he found that he didn’t care too much. Lance wasn’t really around to tease him about it, after all. \n \nThey performed the scan on Lance before lunch. It seemed that his cells were repairing themselves well and Allura assured them that as long as Lance didn’t become too stressed that he would return to normal soon. \nLunch was fairly uneventful. Shiro held Lance like usual and fed him spoonfuls of pureed fruit and vegetables that Hunk prepared. They listened to Pidge as he explained what he’d been working on the previous night – an adjustment to the equipment used in their psychic training that would allow them to project memories onto a screen. \n“It’s just in case Lance starts getting worked up and we can’t calm him,” Pidge explained. “That way we can use the new equipment to figure out what’s bothering him.”\nKeith still felt uncomfortable with the idea of seeing something Lance might not want them to see, but it would only be necessary in an emergency. They just had to make sure Lance never cried himself sick, that was all. In theory, it sounded easy enough. Lance hadn’t ever really cried when Keith held him and Shiro had always been able to calm him down within moments, so they should be alright. Lance seemed to have settled down more now that a few days had passed.\nThat evening, before bed, they gathered in the common room. Allura hesitated before picking up Lance again, but Lance seemed used to her now and he only giggled as she poked at his stomach. \n“Human children are very endearing,” she said as Lance grasped one of her fingers. “He seems very happy to be around people.”\n“I think that’s just Lance,” Shiro said, amused. “He’s like that normally.”\n“That is true,” Allura laughed. She smiled as Lance yawned widely and carefully slid him back into Shiro’s arms. “But I do hope he returns to normal soon. As much as I don’t miss his strange jokes, the castle is much quieter without him.”\nEveryone nodded in agreement. Keith was oddly relieved to find out he wasn’t the only one who missed Lance like that. \n“Hunk, are you alright with having him tonight?” Shiro asked. “It’s alright if you don’t want to.”\n“No, it’s alright,” Hunk said. “You deserve a night’s rest.”\n“Thanks,” Shiro sighed. When Lance sleepily called out Keith’s name again, Shiro stood. “Keith, you hold onto him while I move the crib.”\nKeith didn’t argue. Even though holding Lance for a long time hurt his arms he found that the ache was oddly comforting. The only other time he’d ever held Lance was when-\n\n Yeah, okay, not going back to that memory. No thanks. \n\nLance stared at him as Keith followed Hunk to Hunk’s room. His eyelids were getting droopy but he stubbornly fought sleep as though he could actually win. Knowing Lance, he probably could, if he tried hard enough. \n“If you need anything, just come and get me, alright?” Shiro said after pushing the crib into Hunk’s room. “He should wake up once for a feed, but I think you know the drill. That schedule Allura made is really handy.”\nHunk nodded. “Got it.”\nShiro placed his hand on Keith’s shoulder on the way out. “Alright, I’ll leave you to it. Goodnight.”\n“Goodnight,” they repeated.\n“You can hold him for a little longer if you want,” Hunk said once the door had automatically shut behind Shiro. He took a seat on his bed and let out a relieved sigh. “Combat training with you is hard. I’m picking Pidge next time.”\nKeith absently rocked Lance in his arms. “You need to stop staring and go to sleep,” Keith told him. Lance frowned but his eyes obediently drifted shut. Keith lowered him into the crib and fussed over the blankets for a moment before drawing away. “I still don’t know why he stares so much.”\n“Like I said yesterday,” Hunk murmured, “Lance likes to copy you.”\n \nHunk’s easy going nature regarding Lance led Keith to falling asleep rather easily. Unlike the previous night, Keith didn’t worry about Pidge’s hesitance and instead found his mind occupied by Hunk’s words. He really knew the right things to say, but Keith felt like they were pointless when aimed at him. He didn’t know how to take them on board or how to act on them. It felt like a waste.\nRegardless, he found sleep easily enough. He probably would have slept throughout the night like he usually did if an alarm hadn’t suddenly ripped through the castle only a few hours later.\nThey were under attack.\nKeith pulled on his suit and helmet as the alarm began to insistently ring through the castle. The lights in the hallway turned red as the main power generator switched to energy-saving mode. Keith was usually comforted by the colour but tonight it was nothing but background noise.\nAllura’s voice crackled over the speaker in his helmet. “Get to the hangers,” she commanded. “A Galra fleet is fast approaching us.”\n“What about Lance?” Hunk asked frantically. “He’s started crying, I think he’s scared.”\n“Well we can’t take him with us,” Keith snapped. He felt jumpy just as the  idea  of Lance being anywhere near the Galra like he was. That simply wasn’t an option. It was way too dangerous. \n“Bring him to the observation deck, I’ll have Coran secure him in the nursery,” Allura said. “We might be able to put him in a static sleep for a few minutes. He won’t like it, but he’ll be safe. You will have to return as soon as possible.”\nInducing sleep in a child didn’t feel like the right thing to do, but Keith knew it would keep Lance from having a panic attack. Any time they could save by putting him in stasis would be a benefit to his health. Regardless, that wasn’t currently something he could focus on when he had to get to his Lion. \nWhen the team was buckled in, Allura opened the hanger gates and they were ejected out into the open. Keith kept a tight hold on his controls as his eyes roamed the stretch of space before them. A Galra ship twice the size of Allura’s castle loomed before them, steadily pressing closer and closer. Battle ships were being deployed from its ports even as the castle raised its particle barrier behind the Lions.\n“Even though we can’t form Voltron we’ll still need to work as a team to take out the ship,” Shiro told them. “We’ll move in together and try to hold formation for as long as possible, got it?”\nThey did as they were told and intercepted the battle ships before they could reach the castle’s particle barrier. Keith tried to keep his fellow Lions in mind but it was hard when he himself was busy defending the castle. He propelled his Lion forwards, crashing through a line of ships that promptly burst into flames behind him. Debris clattered off the side of his lion but it was undamaged. As the smoke cleared, he spotted Hunk tackling a handful of ships that were shooting at the shield on Pidge’s back. \nShiro’s Lion was the largest and it could barrel through the enemy ships with more weight than the rest of theirs. It swooped down to crush the ships that took aim at Hunk while Hunk shielded Pidge and suddenly they were all grouped together again. “Keep going!” Shiro shouted through the communication lines.\nKeith urged his Lion forwards once more. Pidge took out the ships ahead of them and Keith took the chance to dive through the opening they created. He swerved down the side of the main Galra ship and released a burning jet of flames that scorched its surface. The machinery beneath its surface exploded at the rush of heat, smothering anything that happened to be chasing after him.\nOn the other side of the ship, Hunk took out one of the engines. His Lion’s claws pierced the hull of the ship and tore away the protective metal sheeting, leaving it vulnerable. Keith watched him dive out of the way before the engine blew and then the yellow Lion was drifting beside him, its tail raised. \n“Uh, a little help here!” Pidge shouted. The green Lion appeared out from under the ship followed by at least a dozen battle ships. The shield on its back was raised but it was clearly weakened and so Keith twisted his Lion down into a sharp nosedive. Another burst of flames engulfed the ships closest to Pidge before Keith had to turn them off and duck out of the way of the blasts himself.\n“I’ve got the rest,” Shiro called as he activated his blasters to speed across the back of the ship. An explosion followed him along the ship’s edge, tearing through the metal and what lay beneath it. “Allura, how are the castle’s defence systems going?”\n“They’re almost fully charged,” Allura said. “Thirty more ticks.”\n“Alright, fall back to the particle barrier,” Shiro ordered. “I’ll clean up behind us.”\n“That felt surprisingly easy,” Hunk muttered. “Was it always that easy?”\nKeith frowned, and glanced back at the Galra ship as Shiro fell into line beside them. Those ships were built for war and battle, and were equipped with a large number of weapons and drones. Why hadn’t they been shot at by the main ship? Why hadn’t its commander come out to fight them, or sent something bigger and meaner than a small fleet of beatable battle ships? It didn’t make sense, unless…\nUnless it was a distraction.\nA sudden explosion rippled through the particle barrier behind them. A shockwave washed over the castle and suddenly all its lights went out, the particle barrier included. Keith let out a shout as static burst in his helmet through the communication line. The power in his Lion flickered briefly but it did not turn off. “What was that?” He demanded. \n“A wormhole appeared behind the ship!” Allura’s voice crackled through his helmets. “They’re boarding the castle!”\n“What?”\n“That ship was just a distraction, we have to get back!” Shiro shouted. \n“Hurry!” Allura said. “They’ve blocked the flow of energy from the main control room and cornered off the lower levels. I’m doing everything I can to get the power back but it won’t be long before they overrun the castle!”\n“The lower levels?” Keith repeated. “That’s where the nursery is! Allura,  tell me  you have Lance with you still.”\n“I- I’m sorry, Coran has him down in the incubator-”\nA shock of anger rocked through Keith but it passed as quickly as it came. No one was at fault for endangering Lance right now except the Galra. “We have to go get him,” Keith said. “Shiro, we have to go get Lance-”\n“Calm down, Keith,” Shiro said evenly. “We’re going to protect Lance and the ship, you hear me? You need to stay calm.”\nKeith was calm, that was the problem, but he didn’t say anything. He hadn’t felt this riled up since they went to rescue Allura from Zarkon. Even then he hadn’t felt the same swelling panic in his chest like he did now. He knew Allura could take care of herself, knew that she wasn’t defenceless, but Lance was so vulnerable it was completely maddening. If Coran had gotten him into the incubator then it was very possible he was already in an induced sleep and he wouldn’t even cry if someone took him.\n“Allura, is there any way for you to open access to the lower levels?”\n“Give me a few ticks to get the power up again,” Allura said. “The hangers are still open, you can get in through there.”\nKeith directed his Lion back down to the hangers before Allura finished her sentence. He slipped in before the others without his usual carefulness and exited his Lion in a rush, making sure to take his bayard with him. Shiro jogged over to meet him with Pidge and Hunk in tow and together they forced the hanger bay doors open.\nThe lights flickered on to reveal an empty hallway. “I’ve turned the power on again,” Allura informed them. “The lower level is still blocked off but that means the automatic door hasn’t locked. You should be able to pry it open.”\n“Alright,” Shiro said. “Let’s go.”\nThey followed Shiro down the hallway and into the lower levels of the castle. Like Allura had said, the automatic lock on the door wasn’t in place and with the help of Hunk’s bayard they were able to force it open. Galra soldiers greeted them on the other side but Hunk took them out with ease.\n“The particle barrier is raised again,” Allura said. “I’ve taken care of the Galra ships, but the soldiers on our castle need to be disposed of before we can jump through a wormhole. We can’t have them knowing our new location.”\n“Copy that,” Shiro answered. “They’ve obviously come here thinking we were all affected by the blast. I don’t know what they’ll do to Lance if they get him, but I know it’s nothing good. We have to go to the nursery and find him.”\nKeith went ahead first this time. His heart was racing and his hands felt ridiculously sweaty as he gripped his bayard. Galra soldiers swarmed them whenever they turned a corner but with all four Paladins together they were never overpowered. \nWhen they reached the hall where the nursery was located, they found door blown wide open. Coran lay slumped against the floor, unconscious. Keith felt that anger surface in him again at the sight of his friend like that. When he reached Coran’s side he bent down to feel for his pulse and let out a relieved sigh when he found it. “He’s fine, just out cold,” he told the other Paladins. \n“Pidge, you stay with him,” Shiro said. “Hunk, Keith, we’ll go to the nursery-”\nA sudden, strained cry echoed out from the nursery. Keith’s head whipped up as his breath seemed to leave his lungs.  That’s Lance. Lance is crying. \nHe was standing in the doorway before he realised he’d moved, staring at the scene that greeted him with wide, furious eyes. The nursery had been completely destroyed; the cribs they’d fixed had been turned over and everything had been pulled from the shelves and uncaringly trodden on. There was a squad of Galra soldiers holding weapons standing around the incubator, which had been torn open. \nOne had its cold, metal hands reached into it to haul Lance up. \nKeith saw red. “Let him go!” He yelled, raising his blade. He lunged across the room and cut down the first soldier he reached, dragging his blade through its chest. They were the same robotic soldiers that he’d seen time and time before and he held no compassion for them, not when they were hurting Lance.\nShiro rushed passed him straight for the soldier holding Lance. His hand made a glowing arch through the air as he attacked but Keith was too distracted to watch him. With Hunk and Shiro helping, it was easy to defeat the soldiers. They only managed to fire off a few shots that singed the walls of the nursery before they were nothing more than a crumpled pile of metal ready to be disposed of.\nWhen Keith turned around, Shiro was holding Lance. “He doesn’t look injured,” Shiro said. He sounded out of breath. “Keith, you take him. Try and get him to stop crying.”\nKeith deactivated his bayard and immediately took Lance from Shiro. Lance felt heavier and more sluggish than usual, and Keith knew it must be because of the induced sleep. It mustn’t have worked properly, but he was kind of grateful for that. At least Lance didn’t have to suffer through the stress of an induce sleep, too. \nSuddenly exhausted, Keith slumped against the wall. He slid down until he was sitting and he could support his shaky arms on his knees. Lance was crying but Keith could hardly hear it, not with the rushing of blood in his ears. He was babbling something –  you’re gonna be alright Lance, don’t worry, noting’s gonna get you, I’m here  – and he couldn’t bring himself to stop. He didn’t care if the others saw him; he held Lance close and didn’t let go.\nHe’d never been so scared to lose someone he cared about.\n \nLance didn’t stop crying for a long time after that. He wore himself out of the big wails eventually, but the sniffling and grizzling didn’t stop for hours. He wouldn’t eat lunch or dinner and if anyone so much as left the room he only got worse. Eventually he became so tired that he didn’t notice when they started to carry on with their duties and instead only sat quietly.\nKeith couldn’t blame him. The team had never really had anything to protect other than Voltron and each other, and even then they were all capable of defending themselves. They could fight, and think for themselves and find a way out. Lance couldn’t. He was helpless and weak and could be seriously injured by things that didn’t matter to them anymore, like cold weather or a fall or even alien food. If it hadn’t been for him back when that blast had hit, they would all be like that.\nEventually it was Shiro who managed to quieten Lance. He held Lance in his arms as they sat on the couches after Allura had taken the castle somewhere safe. Coran had been healed and everyone was okay and it felt good to just  breathe  for a moment.\n“We’ll have to repair the nursery tomorrow,” Shiro said. He spoke quietly so that his voice wouldn’t disrupt Lance who was currently on the losing side of a battle with exhaustion. “Hunk, Lance’s crib is still in your room, right? Can you check to see if it damaged?”\nHunk nodded, and stood. “Be back in a minute.”\nPidge wandered over to sit next to Shiro. He’d been tinkering with the controls of the incubator and had managed to link them to a wireless scanner so that they could check on Lance’s health. He let the scan run over Lance before handing the data screens to Allura who silently read them.\n“He does not seem physically injured,” Allura finally said, “but the progress in his cells has rapidly decreased. He needs to regain his strength so that he can continue to heal. Do you think you can convince him to eat tonight, Shiro?”\nShiro shook his head. “He’s way too tired. I’ll have to feed him after he sleeps, I don’t think he has the energy to do anything other than rest now. I can’t imagine how frightened he would have been…”\nKeith winced. He’d had the same thoughts roving around his head for hours after the attack. He couldn’t take his eyes off of Lance, but he didn’t really care. No one had said anything about it. Hunk had told him that it was alright for him to want to be Lance’s friend, and if this was how he showed that he wanted that, then it didn’t matter, did it? At least, he didn’t think it did.\n“Keith, are you still alright with having him tonight?” Shiro asked. “I don’t mind taking him, if you want to rest.”\n“It’s fine,” Keith said quickly. “I’ll take him.”\nIt felt strange for him to want to spend time with Lance, but after tonight he was just too tired to argue with himself over it anymore. He felt much better when Shiro gently passed Lance into his arms and couldn’t help but sigh at him. Lance’s face was splotchy and red and his eyes were still watery but regardless of that he returned to his weird, persistent staring. It was comforting for him to do something so seemingly normal after all the mayhem of the day. \n“I’m going to bed,” Keith decided. \nShiro stood. “Alright, that’s a good idea,” he said. “I’ll go find Hunk and help him move the crib to your room.”\nKeith nodded. He said goodnight to the others, who were all turning in for the night, before leaving the common room. He took Lance to his room while Shiro went to track down Hunk and rested Lance on his bed, being extra careful not to jostle him. He made sure Lance was distracted by Keith’s blanket before changing into a loose shirt to sleep in. They’d all squeezed in quick showers after securing the castle but Keith had been reluctant to give up his jacket and bayard. \nShiro arrived with the crib after Keith had changed and gathered Lance in his arms again. He set it up and adjusted the blankets before taking Lance from Keith and lowering him into it. “You know the drill,” Shiro said. “If you have any trouble, just come find me. I don’t know how much sleep either one of you are going to get tonight.”\n“I know,” Keith said. “I’ll be fine.”\n“Alright,” Shiro sighed. “If he does wake up for a feed, Hunk said he left a bottle of formula in the cupboard. You just need to add hot water and wait for it to cool.”\n“Got it.”\nShiro reached into the crib and adjusted the blankets again. “I hope Lance is alright,” he murmured. “I’m worried this whole de-ageing ordeal is going to hurt him.”\n“He’ll probably be fine,” Keith said, though he didn’t sound very convinced.\nShiro only hummed and bid him goodnight before leaving. Keith waited a moment before carefully pulling the crib closer. When he laid in bed he could reach through the bars and keep his fingers resting against Lance’s tiny hand. It was the only way he could convince himself to fall asleep.\n \nFor the third night in a row, something unexpectedly woke Keith. He reached for Lance’s crib without thinking. “Lance?”\nHe was making quietly huffing noises that made Keith frown. He pulled Lance from the crib and wiped away the tears on his chubby cheeks. Did Lance usually cry by himself at night? Somehow, just thinking that Lance was shouldering that ache by himself made Keith upset. Before Lance had been de-aged, he’d never stopped to consider that Lance might be more than just homesick. None of them deserved to be sad like that.\nGently, he set Lance down against his chest and laid back against his pillows. Lance gripped a fistful of Keith’s shirt and continued to sniffle, even when Keith rested a hand on his back like he’d seen Shiro do. \n“It’ll be alright,” he told Lance. “Tomorrow will be better.”\nUnbidden, his mind strayed back to Pidge’s modifications on the psychic equipment. They could use it to see which memories bothered Lance the most. If they did, then they could help him. Would it be so bad to know how he felt when he was alone? Maybe it wasn’t his place to know, Keith thought. If Lance wanted to tell them he was lonely then he would, wouldn’t he? He seemed the type. It wasn’t like he had exactly hidden his homesickness. \n“Maybe it would be better if we saw what was going on in that empty head of yours,” Keith mused. “Though you might kill us for it. What do you think?”\nPredictably, Lance didn’t reply. He probably didn’t understand what Keith was really saying, though he seemed comforted by the sound of Keith’s voice. His grip on Keith’s shirt slowly loosened, and his sniffles began to die down. He lifted his eyes once to peer up at Keith before closing them again, content.\nKeith sighed and lowered himself down onto the bed properly. He carefully pulled the blankets up over them and rested his nose in Lance’s hair. It was surprisingly soft and not as unpleasant as he might have once thought it to be. He wondered what Lance would think if he knew what Keith was thinking about him when he was stuck in this form.\nSleep was easier to find after that.\nKeith overslept. He couldn’t remember the last time he hadn’t woken up at the crack of dawn, and even without the light of the sun to wake him his internal clock had still worked. That morning, however, it seemed to go on strike and he only woke when someone entered his room.\n“Rise and shine, Keith,” Hunk said as the door slid open. “You still sleeping?”\nKeith mumbled out an answer and lifted his free arm to cover his eyes. “Did I miss breakfast?”\n“Yeah,” Hunk said. He straightened Lance’s crib and moved it out of the way. “I take it he didn’t wake up for a feed during the night?”\nKeith shook his head. “Woke up and he was crying to himself. I don’t think he slept much until I took him out of the crib.”\nHunk took a seat on the edge of Keith’s bed. “Is he awake?”\n“No,” Keith shook his head. “He’s still sleeping.”\n“Want me to take him to the dining room?”\nKeith hesitated. A part of him still felt possessive over Lance’s attention, but it wasn’t like Hunk would do anything to him, so he nodded. He had to get dressed anyway. “Yeah.”\nHunk stood again. When he reached for Lance, he began to stir. As he was lifted from Keith he suddenly let out a shattering cry that shocked Keith right into wakefulness. He’d reached up to snatch Lance back into his hold before thinking about it and held him close as Lance grabbed tight fistfuls of his shirt again. \n“Well that settles that,” Hunk sighed. “He’s really attached to you.”\n“Is he?” Keith asked, surprised.\n“You’re as oblivious as him sometimes,” Hunk snorted. “I’ll go make the bottle, you just bring him down to the dining hall. Sound good?”\nKeith nodded. He waited until Hunk had left the room before turning his attention to Lance, who was steadily making a wet spot on Keith’s shirt with his tears. Although he’d be embarrassed about it later he couldn’t help but rock Lance in his arms and press his nose into Lance’s silky hair again. At least it seemed to comfort him – Keith, too, if he were being honest. \nEventually Lance settled and his cries became nothing more than soft whimpers. Keith set him down on his bed and changed as quickly as he could before Lance started crying again. It was awkward to change with Lance staring at him but he didn’t think it could be helped. He shook it off and got it done and then picked Lance back up, breathing out a sigh of relief when another crying fit was avoided.\n“You gotta calm down, Lance,” Keith said, voice quiet and soothing. “Nothing’s going to happen again, I promise.”\nLance huffed against Keith’s collarbones and let out a watery, miserable, “Keif.”\nIt hurt Keith’s heart. He really did miss the usual Lance, and although it was a thought that made him sigh in resignation, it was an honest one. “I’m here, buddy,” he finally said. “Let’s go get you something to eat, alright?”\n \nNo one mentioned Lance’s strange attachment to Keith over breakfast. Lance wouldn’t eat for a while but after Keith had finished his meal he diverted his attention to making sure Lance had at least half the bottle. It took a lot of patient prodding before he finally convinced Lance to cooperate. He was just as stubborn as ever, it seemed.\n“What do we do now?” Keith asked as Hunk took away the half-finished bottle. \n“Clean up the nursery, for a start,” Shiro sighed. “Then finish repairing the ship and get back to training.”\n“I want to perform another scan on Lance later today, too,” Allura said. “I’m worried about his progress after all this stress.”\nKeith nodded. He was absently stroking his fingers through Lance’s hair as he mulled over his thoughts. Lance had settled more after eating but he still seemed upset. “Maybe we should use the psychic headgear Pidge modified,” he suggested.\nShiro frowned. “It seems invasive,” he pointed out.\n“I know,” Keith said, “but I have thought about it for a while, and I think it’s a good option. Limiting how much stress he’s under will help him return to normal faster, right? Wouldn’t seeing his memories help us do that?”\n“He has a point,” Pidge said as he turned to face Shiro. “It’s not like it would hurt Lance, and if it helped us figure out what he’s feeling and how to avoid stressing him out any further…”\n“I’m not saying it’s not an option,” Shiro relented, “but I don’t want Lance to be upset when he returns to normal. Allura, what do you think?”\nAllura hummed to herself for a moment. “I admit, I do not know Lance as well as some of you,” she said, “but it does not seem like he’s retained any of his normal thoughts as he is now. I cannot say for sure whether he will remember any of this, but regardless, we must help him as best as we can. If that means using Pidge’s invention, then so be it.”\nThey took the day to think it over. In the meantime, the Paladins set to cleaning up the nursery again. Lance would cry if Keith put him down so he couldn’t do much, but he didn’t leave his fellow Paladins to do it alone. He held Lance in one arm and helped as much as he could, but eventually his arms became too sore to do much more than support Lance. \n“Do you think he’ll remember any of this?” Hunk asked just before they took a break for lunch. “I mean, he’s going to be super embarrassed if he does.”\nKeith flushed. He would be embarrassed too, but that didn’t discourage him from holding Lance. If anything, he only held him tighter, absently rocking from side to side. It still felt good to have Lance’s weight in his arms even if it was tiring to hold him for so long. At least he wasn’t crying anymore. \n“He might,” Shiro said, “or he might not. It doesn’t really matter as long as he’s alright.”\n \nLance ate lunch, thankfully, and then Allura scanned him again. It seemed that his cells were beginning to regenerate at a faster pace again, which was good. Allura assured them that he would be back to normal within the next few days. It was comforting to hear, no doubt, but it did bring up strange feelings in Keith that he hadn’t expected to feel.\nDid he want Lance back to normal? He knew he did, but the thought of losing this Lance saddened him. He felt like he’d made a real connection with Lance like this, that for once someone needed him as much as he needed them and was willing to show it, and if Lance went back to normal then Keith would lose that. He didn’t want to lose it. Who’s to say the normal Lance would ever want anything to do with him again outside of Voltron when he found out about how much Keith had hoarded his attention?\nHe didn’t want to think about it.\nAfter lunch, they finally decided to look through Lance’s memories. It was a group decision, one they only came to after everyone agreed to it. If Lance became angry over their actions, then the blame would be placed on all of them. It was fair that way.\nThey did it on the training deck like they had last time. Pidge adjusted the headset to fit Lance’s tiny head, and with Lance sitting in Keith’s lap he turned the equipment on. Lance let out a worried noise but he quietened when Keith instinctively offered him his hand to latch onto.\n“Alright,” Pidge murmured. “It should project whatever Lance is remembering through the holographic receptor on the headset.”\nAs Pidge had said, a screen began to flicker forth from the headset. Lance’s attention was drawn to it and he let out a curious noise as an image of the training deck appeared. \n“He’s thinking of the training deck?” Hunk asked, puzzled.\n“No, it’s what his current thoughts are on,” Pidge said. “When we did this exercise before we consciously thought of things that were dear to us and used that to transform the image into our lions. We need to prompt Lance into remembering the moment he was upset so that we can find the source of it.”\nKeith frowned, his grip automatically tightening around Lance. He didn’t like the sound of it. He didn’t want Lance to be that upset again. “Is that necessary?”\n“Unfortunately, yes,” Pidge said. “Lance isn’t old enough to follow commands or directions, especially not regarding things like emotions or memories. The question is, how do we prompt that in him again?”\nShiro glanced at Keith. “You won’t like it, but you might have to let him go,” he said. “He gets upset when he’s put down, doesn’t he?”\nKeith cringed, and pulled Lance closer. “Why?” He asked defensively.\nShiro sighed. “I don’t like it either,” he said gently, “but it’s the easiest way. It’ll only be for a little while, Keith.”\nKeith bit the inside of his cheek, frowning. He knew what Shiro was saying was the truth and that he was just being…  protective,  but that didn’t make him feel any better about it. Rationally, he knew that Shiro was the most protective of them all and that he’d never put them in danger, so he slowly began to loosen his grip on Lance. \nWhen he sat Lance on the floor and they all stood to stand back, Lance’s eyes started to turn watery. “Keif,” he whimpered, reaching out with a chubby hand. The image from the headset changed to one of Keith wearing his suit and helmet. It was strange seeing himself from Lance’s point of view – he didn’t look as tall as he thought he was, and his face didn’t have its usual grouchy expression. Why did Lance think of him looking so… soft? \nThe longer they stayed away from him, the more upset Lance got. He started to whimper and his face scrunched up and he tried to stand, but couldn’t. Keith moved to go to him, feeling his heart start to race, but Shiro held him back with a cautious hand to his shoulder. \n“Keif,” Lance whimpered again. He reached out a hand and let out a small cry when Keith didn’t go to him. “Keif, Idge, Hun…”\nKeith winced, and shared a glance with his fellow Paladins. They looked just as distraught as he felt. Even if Lance didn’t really know what he was saying, the way he said their names pulled at a deep, hidden part of Keith that he desperately wanted to respond to.\nThe image from the headset abruptly changed as Lance got more upset. At first it was the Paladins standing together, their lions in the background, but it quickly expanded to include Allura and Coran, too. Keith watched it with sharp eyes, trying to discern any meaning from it. Even as he watched the image began to shift and their figures fell away into nothingness. \n“He dreams of losing us,” Allura whispered. “He fears it.”\nWhat replaced the image of them was an image of Lance’s family. It was like the one Keith had seen before when they first used this technology. Keith had never seen such a big family – Lance had many brothers and sisters, some older and some younger, as did his parents. Keith could only assume that all the people who filled the projection were his uncles and aunts and grandparents. He probably had nieces and nephews by now, too, and looking at them-\nKeith could suddenly understand why Lance felt so homesick. If all the people in Lance’s family had the same, cloying air to them that Lance did when he was a child like this, how could anyone ever stand to be away from them? Lance had grown up surrounded by all those people and all that warmth and now he was stuck in space fighting aliens. It hurt Keith just to think about it.\nThe images that Lance brought forth began to change. There were moments when his mother appeared – cooking with her back to Lance, holding a bouquet of flowers, waving a wooden spoon at a handful of her children, even tightly hugging Lance despite the mud and dirt caked on Lance’s cheeks. Other images of his siblings appeared – they caught beetles together and made sandcastles and blew out candles on birthday cakes. \nMixed in with those images were the images of the Paladins. There was Pidge on the roof of the garrison listening for alien chatter and Hunk eating the food Lance would nab from the kitchen for him and even Keith across the classroom from when he still attended. Unsurprisingly there were no images of Shiro but that did not mean he was absent from Lance’s memories; he was there in news articles and online posts that Lance searched for. They were all there, parts of Lance’s small world, and they remained there even as that small world expanded to encompass the entire universe.\nIf those were the only memories Keith had to deal with, then he thought he would be alright. He could cure Lance’s homesickness; they all could. Affection and comfort and steady reassurances would be enough to placate Lance as he was. They could be enough.\nBut Lance had other memories. He would curl up in his bed for hours trying to find sleep and fail. He could lose his grip on his Lion’s controls for a second because his hands were too shaky. He would look at the alien food they were served and even though he appreciated it he couldn’t help but miss his father’s cooking and the cutlery from his house and even the plates and their chipped paint.\nLance was  lonely.  Bone-deep, achingly lonely and none of them had done enough to fix him. He was always there for them, lightening the mood with jokes and making them laugh. They’d mistaken his energy for contentment. \n“That’s enough,” Keith finally snapped. He took several large strides to reach Lance and pulled the headset from him. Lance was crying still, reaching up for Keith with a desperation Keith had never seen him display before. He heaved Lance up into his arms and held him tightly even as Lance slobbered all over his neck. “That’s enough,” he repeated, quieter this time.\nThey now knew what made Lance upset, and so they had to fix it.\n \nLance refused dinner that evening. He napped after Keith took him from the training deck and woke up grouchy and tireder than before. Keith made sure that no one put him down if they held him, but eventually it became easiest just for Keith to have him all day. He didn’t mind holding Lance, even if Lance cried or drooled. Shiro was still the one to change him – for Lance’s sake, it was better if only one of them saw him exposed like that – but Keith found that he was more than capable of doing the rest of it himself. \nEventually he convinced Lance to eat a few spoonfuls of pureed vegetables. He grumbled and scowled the entire time, but he still ate it. “There you go,” Keith said, “you finally finished the whole bowl.”\n“I’m going to scan him one last time before we retire to bed,” Allura said after she had finished her meal. “I’ll go fetch the wireless scanner now.”\nKeith nodded and absently wiped Lance’s mouth clean with a napkin. “He ate enough today, right Shiro? He won’t get sick or anything?”\n“I believe so,” Shiro said. He was leaning against the table, silently watching over everyone as they slowly wound down from dinner. “He’s settled down now, but I think you should make sure he eats at least once during the night.”\nKeith nodded again. “Alright.”\nAllura scanned Lance once more before everyone went to bed. Keith moved into the common room where he could lounge around on the couches, Lance tucked away in his arms under a blanket. He would have thought Lance would have fallen asleep by now, but he didn’t. He watched Keith with those big blue eyes of his like he was trying to tell him something, but he didn’t speak anything past quiet whines and nonsensical murmurs.\nKeith could do nothing but sigh. “I’m sorry,” he whispered. “I don’t know if you can understand me, but I am. It was partially my idea to root around in your head, and it’s partially my fault that we never realised what you were going through. We suck as a team, don’t we?” He laughed humourlessly. “We’ll get better, I’m sure of it, Lance.”\nSometimes Keith forgot that he’d never been around children before. It felt so easy to care for Lance, so natural that he could forget about his insecurities and his hesitance with little problem. He didn’t know if he’d be like this around all children, or if it was because it was  Lance.  Somehow, he thought it was the latter. Lance was different, and he always had been. It had just taken this for Keith to realise it.\n“You know, I don’t really have a family like you do,” Keith said quietly. “In your memories, there were so many people, Lance. I don’t know how you remember all of their names. You grew up surrounded by energy and clutter and noise and I just can’t comprehend it. It’s no wonder you get lonely without a lot of people around, without socialisation. I think we all do, in varying degrees, but you’re the type of person to suffer without it.”\nHe paused for a moment to run his fingers through Lance’s hair. He felt unexpectedly small in Keith’s arms tonight even though he hadn’t physically shrunk at all. Only when Lance made a small, inquisitive noise did he continue talking.\n“I’m… I’m not that type of person,” he confessed. “I like to be alone; I thrive on it, in fact. I work better in silence and solitude and it’s like I know loneliness better than I know any of you. It’s not like I want that sort of life, it’s just been all I had, but it’s different now.”\nLance reached up a hand to touch Keith’s cheek. It was an affectionate, unexpected gesture that brought a strange sense of warmth to him.\n“It’s different now,” he repeated, “because you guys are always around. I don’t always like it and we don’t always get along, but I don’t want to go back to the way it was before. One day this whole Voltron thing is going to end and I don’t know what I’m going to do and I’m scared.”\nIt was more than he’d ever admitted to before, even to himself. Somehow, he felt better for it. Telling Lance those things about himself made him feel better.\nHe hoped he could still do the same for Lance when Lance returned to normal.\nThe next day, Lance was surprisingly… okay. He woke once during the night for a feed, which Keith gave him. It hadn’t taken as long as he’d thought it would have; he leaned against the counter in the kitchen, yawning, and gave Lance his bottle, then walked around the castle until Lance drifted back to sleep.\nIn the morning he woke Keith with needy cries that stopped the moment Keith’s eyes opened. Lance was more observant than usual as Keith carried him to the dining room, and he curiosity held onto a fistful of Keith’s hair like he’d never seen it before. “Again with the hair,” Keith had said, though he hadn’t made a move to untangle Lance’s fingers. “What is with you and my hair?”\n“He seems better this morning,” Shiro remarked. He smiled when Lance gave him an observant look and took him from Keith with practiced ease. Keith only let him go because he wanted to make up Lance’s bottle again. Hunk had explained to him how to do it and Keith had made sure to listen well. He knew exactly how much formula was needed and how much water the bottle required to be appropriately filled. \nShiro handed Lance back to Keith when he returned with the bottle. Lance was very interested in eating and did so with a hand wrapped in the ends of Keith’s hair again. \nWhile he ate, Allura performed another scan. “He seems much better now,” she informed them with a satisfied smile. “What did you do, Keith? Lance is far calmer today than I expected.”\nKeith flushed. “I didn’t do anything!” He said.  I only told him what I’m afraid of.  “Lance is just being weird again.”\nAllura laughed quietly. “Well, this change certainly does seem to fit his personality,” she said. “I’m glad he is feeling better now. It should not be much longer before he returns to normal, if all goes well.”\nShiro nodded, pleased. “That’s good,” he said. He turned to face the Paladins. “What do you want to do today? We could try training again but I don’t know how well we’ll be able to do it.”\n“I for one want to work in the labs some more,” Pidge said. “I’m working on some modifications for my lion. I want to see if I can extend the amount of time it goes invisible.”\nShiro nodded. “Sounds good. What about you, Hunk?”\n“I’ll probably help Pidge out,” he said with a shrug. Keith sometimes forgot how good Hunk was with machinery – he was smarter than he looked. “At least until lunchtime anyway.”\n“What about you, Keith?”\nKeith hesitated. Usually when they had free time like this he always went to the training deck. He didn’t like lounging around like Lance did and if he wasn’t being productive then he was irritated and full of too much energy. Today, however, felt different. Why would he give up time with Lance to go to the training deck? He surprised himself by thinking it, but accepted it for what it was. He was doing a lot of that lately. \n“Will you watch over Lance?” Shiro asked as he noticed Keith’s indecision. “He seems to like you the best. It might be good for you to relax a little, too.”\nKeith nodded. It was easier when the decision was taken out of his hands. “Alright.”\nWhen breakfast had finished and everyone had disappeared into the depths of the castle to do their own thing, Keith took Lance into the common room. A few of Lane’s toys were on the floor from a few days ago so Keith set them down beside Lance on the couch. Lance seemed more than happy to play around with him while Keith simply watched over him. \n“Keif,” Lance said, holding up one of the toys expectantly. “Play.”\nKeith’s eyebrows went up. He didn’t know Lance could say other words, and he didn’t think any of the Paladins did, either. He smiled a little when he realised it was a secret only he shared with Lance and took the toy from him. “Alright,” he said, “I’ll play.”\nLance giggled. He probably didn’t have a clue what Keith was saying but Keith guessed it was all in his tone of voice. Keith thought that Lance probably would have been happy with anything he said as long as he said it nicely.  Maybe that’d work on the normal Lance, too? It was a funny thought. \n“Here, hold that one like this,” Keith said. He turned the toy in Lance’s hands the right way around. The toy made a jingling sound as the bell in it rattled and Keith couldn’t help but laugh quietly as Lance’s eyes went wide in surprise. “It makes a noise if you shake it,” Keith told him. He gripped Lance’s tiny hand in his to help him shake the toy.\nHe was rewarded with a sharp, refreshing burst of laughter. Lance made this happy, huffing sort of noise and flailed his arms but he didn’t dislodge Keith’s hand. “Keif play,” he repeated, grinning broadly.\nHis smile was infectious. “Keith,” he corrected gently. “Can you say it properly, Lance? Kei-th.”\nA contemplative furrow appeared in Lance’s brow as he stared at Keith. “Keif,” he repeated.\n“Keith,” Keith said.\n“Keith,” Lance repeated. “Keith!”\n“That’s it!” Keith exclaimed. A grin tugged at his lips and he helplessly let it encompass his face. “You did it, Lance!”\nLance screeched with laughter, his toy rattling again. “Keith!”\nKeith couldn’t help but laugh too. Being around a child like Lance made him feel focused and invigorated; he had a set goal laid out before him and he knew how to achieve it. Sure, there were many things he was still hesitant about, but he wasn’t frightened of them. He thought that if Lance started to cry again he would be able to handle it without Shiro’s help. \n“What about Pidge?” Keith asked. “Say  Pidge,  Lance.”\n“Idge.”\nKeith laughed again. “No, Pidge. Pi-dge.”\n“Pid- Pidge,” Lance repeated, frowning.\n“Yes, that’s right! What about Hunk? Can you say Hunk, Lance?”\n“Hunk!”\n“You’re not so bad at this,” Keith said.\nLance just giggled. He was thriving on the positive attention. \n“Now say Shiro,” Keith said.  “Shiro.” \nLance frowned at the wording. Shiro’s name was the only Paladin name he hadn’t said before – Keith thought it might have been because of the pronunciation. Lance had trouble with the  th  sound that was in Keith’s name, so it was reasonable to think that the  sh  sound in Shiro’s name would cause him to have similar problems. \n“Shi-ro,” Keith said slowly.\n“Ro,” Lance repeated, his voice shaky. “Si- Siro.”\n“Almost,” Keith encouraged. “Shiro.”\nLance frowned again, though perhaps it was more of a pout than anything. “Siro,” he repeated, before finally squeezing out, “Shiro.”\nKeith grinned again, pulling Lance into his arms to hug him tightly even as Lance giggled. “Good job, Lance! They’re gonna be so surprised at lunchtime, just you wait.”\nEventually Lance grew bored of his toys and learning words, so Keith decided to take him around the castle. He held both of Lance’s hands in his and helped him take slow, wobbly steps down the hallway. Lance was babbling things that didn’t exactly made sense sprinkled with words that did, often including Keith’s name or even one of the other Paladins.\n“I think you can walk on your own,” Keith said. He crouched down beside Lance and held his hands to steady him. “Though you’re really floppy still.”\nLance just babbled at him, looking between his own feet and Keith like he couldn’t decide where to stare. \nKeith inched back a bit so that his arms were stretched out, but did not let go of Lance’s hands. “Come on, now,” Keith said, “I know you can walk.”\nLance struggled for a moment, whining, as his fingers tightened around Keith’s. He took a step forwards and stumbled, but Keith held him upright. Lance was never the type to give up, not even now, and at Keith’s gentle insistence he tried again. This time, knowing that Keith could catch him if he happened to fall, Lance began to walk.\nThat strange, prideful feeling saturated Keith again. It hadn’t been Shiro or Hunk or Allura that helped Lance like this, that knew these new things about Lance first – it was him. Out of all the people Lance had chosen to favour, he’d picked Keith. Maybe it was luck or coincidence or just Lance copying the way Keith had watched him, but that didn’t matter at all. \nKeith didn’t think he’d ever had a bond like this before. He didn’t think it was just because Lance was a child, either. Even before that they’d been something that wasn’t quite friends and wasn’t quite true rivals, but it wasn’t anything more, either. Lance always maintained they were rivals, but that was mostly on his half – a one-sided thing. Keith didn’t think of Lance as a rival until Lance provoked him into some stupid competition, and he was always stupid enough to rise to the bait. \nThis situation had made Keith realise a lot of things. He didn’t know what to label his relationship with Lance, and didn’t know how to label what he wanted his relationship with Lance to be, but somehow that was alright. Maybe Lance would know. Maybe he’d want the same thing, whatever it was. It seemed like something that the normal Lance would know in that random, spontaneous way of his.\nAt lunch, after they’d all eaten, Keith wanted to show off Lance’s new skills. Lance had been babbling from the moment they entered the dining room but none of it was anything truly coherent, so the surprise hadn’t been revealed. After pushing away Lance’s empty bowl, Keith pointed at each of the Paladins and asked Lance what their names were. Like clockwork, Lance repeated their names almost perfectly. He recognise Hunk and Pidge easily enough and paused for a moment at Shiro before confidentially declaring his name, too. Although he still stumbled over Shiro’s name like he had before he didn’t seem to notice, so Keith didn’t mind. He was just glad Lance hadn’t forgotten anything they’d done earlier that morning.\n“You taught him so much,” Allura said, surprised. “Human children learn at a remarkably fast rate, don’t they?”\n“I think that’s just Lance,” Shiro chuckled. “He likes to be right.”\n“He can walk, too!” Keith said. “He was doing it before, all on his own. Well, sort of.”\n“Is that so?” Allura asked.\n“Yeah,” Keith nodded. “I’ll show you.”\nHe set Lance down on the floor and shifted a few paces back before holding out his arms. Lance wobbled for a moment like before, gripping the leg of the chair beside him to keep himself balanced. “Keith,” he said, holding out a hand.\n“Come here,” Keith said, gesturing for Lance to come closer. \nLance hesitated for a moment, gauging the distance between Keith and the chair, before slowly letting go of his support. He took one step and almost stumbled again, but then he took another, and another, and he didn’t stumble anymore. A triumphant look came to his face as he pushed himself straight into Keith’s arms. “Keith!” \n“See? I told you he could walk!” Keith said as he scooped Lance up into his arms to stand again. “Did you see?”\nShiro laughed. “We saw,” he agreed. “That’s great, Keith. He must really like you, huh?”\nKeith flushed and didn’t answer. He didn’t deny it, either. He hoped Lance liked him, even if it was just this Lance and not the normal one. It was a step in the right direction, wasn’t it? A baby step. Literally. \n“He should be back to normal sometime tomorrow, right?” Shiro asked. “It hardly seems like it’s been a week with everything that has happened.”\nAllura nodded. “Yes, I must agree with you there. The scans are indicating that the blast from that Galra monster has almost worked its way out of him.”\n“Is he suddenly going to just puff back into the normal Lance?” Hunk asked, concerned. “Because that seems a little out there, even for alien magic. Also, that seems like it would be painful. Is it going to be painful?”\nKeith’s arms tightened around Lance at the mention of pain. He didn’t want Lance to be hurt. He hadn’t even thought about how Lance would return to normal; none of them had seen him change size the first time and so they had no idea how it would happen now.\n“I think it would be best to put him in the healing pod,” Allura said. “I do not think he will just…  puff  back into his normal size as you said, Hunk, but his growth rate will suddenly increase when the time comes.”\n“And what does that mean, exactly?” Shiro asked. “Will he be in pain?”\n“Possibly,” Allura said. “As much as I do not wish for Lance to be hurt, it certainly seems like a progress that may cause him some form of pain. It won’t only be his cells that become incredibly active – his bones will have to grow again, as will his organs and his skin and his brain.”\n“Will putting him in the healing pod help?” \nCoran nodded as he listened to the conversation. “The healing pods are designed to induce a coma-like state in those who use them, as you are well aware,” he said. “In such a state it is unlikely that Lance will feel pain as he won’t be awake for any of it. Essentially, he will be numb to it all.”\n“And when he wakes up?” Keith asked. “What then? That sort of pain doesn’t seem like the type to just disappear, healing pod or not.”\n“I imagine he will be very exhausted,” Allura said. “Dehydrated and hungry, too. If he is in pain we can extend his stay in the healing pod until his body completely recovers and then wake him. I’ve never come across this sort of illness before so I cannot say for sure what will happen, but we must be prepared for all outcomes.”\nShiro made a noise of agreement. “We’ll cross that bridge when we come to it,” he decided. “For now, Lance seems perfectly fine. He didn’t start crying at all did he, Keith?”\nKeith shook his head. “Not even once.”\n“That’s a good sign,” Shiro said. “He would cry if we left the room before, so it seems that he’s settled now. If we can keep him calm until it’s time for him to go into the healing pod he might be in less pain.”\n“How will we know when it’s time?” Keith asked. He absently held Lance a little tighter and tried to fight away the thoughts in his head that said he was losing Lance. He wasn’t losing him at all; he was getting him back. He hoped that by the time Lance had returned to normal that he’d remember that.\n“I’m sure it will become clear to us,” Allura said. She turned to Coran. “How long do you think the process will take? The blast that turned him into this form was almost instantaneous, was it not? It couldn’t have been more than a handful of ticks before the other Paladins reached him.”\nCoran frowned thoughtfully. “Well I image re-aging will take much longer than de-aging,” he said. “The healing pod will alert us when he’s ready to return to consciousness again so we’ll have to wait until then. It could be a few hours, or even a few days. There’s no way of knowing until he’s in there.”\nKeith scowled. That wasn’t reassuring at all. What if Lance was in there for weeks and the Galra attacked again? They barely managed to get away last time, and even then the Galra were almost successful in kidnapping Lance. What would happen if the Galra sent more than one fleet? What if they sent a dozen? A hundred? More? They couldn’t do anything without Lance there to form Voltron. For once, Keith felt utterly helpless. He couldn’t help Lance heal and there was no way he could speed up the healing pod even if he desperately wanted to. \n“We’ll figure something out,” Shiro reassured. He glanced at Keith as if he could read Keith’s thoughts and gave him a sympathetic look. Keith wasn’t upset by it. “It’s useless for us to worry about it when we have at least another day to go before it becomes a real problem. For now let’s focus on what we can actually do, alright? And that’s make sure Lance is safe and secure and that he isn’t stressed.”\nKeith nodded. He could do that. That was definitely something he could do. \n“Just keep Lance occupied like you have,” Shiro said, placing a comforting hand on Keith’s shoulder. “You’re doing well.”\n \nKeith did as he was told. He liked spending time with Lance and the time between lunch and dinner passed with ease. He taught Lance to say  Allura  and  Coran  – he called Coran “corn” for the first few tries and it took a while for Keith to stop laughing after that. Lance wasn’t doing too well with ‘L’ sounds and he kept saying “Arura” but he was cute enough to let it slide.\nIt was worth all the trouble to see Allura’s face light up when Lance yelled “Arura!” from across the hallway when they entered the dining room. \nLance ate dinner well and soon started to drift to sleep in Keith’s arms. It was Shiro’s night again and although he offered to let Keith take him, Keith shook his head. \n“Don’t get me wrong, I want to,” Keith had told Shiro as they moved the crib to Shiro’s room, “but I think it’s best that he spends time with others, too. We… We still don’t know what he’s going to remember and I don’t want him to hate me. Besides, if he does like me best then he likes you second best.”\nShiro rubbed the back of his neck sheepishly. “You think?”\nPerhaps Keith wasn’t the only one who enjoyed Lance’s attention. Children really were quite amorous and forthcoming with their affection, and to gain it certainly gave a person a good feeling. Not even Shiro was immune to that.\nKeith still reluctantly said goodnight to Lance as he tucked him into his crib. “I can take him if he starts to cry…” He offered weakly.\nShiro put his hand on Keith’s shoulder again. “I know,” he said, smiling gently. “Don’t worry Keith, he’ll be fine.”\nKeith scowled again. “Alright, alright, I’m going now.” He cast one cast glance at Lance before sighing. “Night, Shiro.”\n“Goodnight, Keith.”\n“Keith,” Lance whined sleepily. Keith tensed at the sound of his name but didn’t turn around. \nHe’d see Lance in the morning.\nWhen Keith made it to the dining hall the next morning, many of the others were already awake and present. Allura had taken her seat at the head of the table, though Coran wasn’t around – he was probably in the kitchens. Hunk and Pidge hadn’t yet arrived but Shiro was seated across from Allura with Lance in his lap. It didn’t look like breakfast had been served yet so he was banging around with a rattling toy that Shiro had probably given him.\n“Good morning, Keith,” Shiro said as he spotted Keith enter the room. \n “Keith!”  Lance cried out, reaching out his little hands to grab for Keith, giggling. “Keith, Keith!”\nA small smile came to Keith’s face, unbidden. “Alright, hold your horses,” he said as he heaved Lance up into his arms. Lance instantly reached out to hold fistfuls of Keith’s hair, grinning like mad. “Why’s he so hyperactive this morning?”\nShiro laughed quietly. “He’s only just become like that,” he said. “Lance is just excited to see you, Keith. He’s been waiting for you to arrive since he woke up.”\nKeith’s eyebrows went up. “Has he?”\n“Of course.”\nThat feeling of pride came back to Keith again and he turned his gaze away from Shiro and Allura to hide it. It felt good to be the one who finally shared a connection with someone else like this. He’d never had it before, not like he had it now, and it made him feel good. Even better than that was the fact that Lance reciprocated it, too. Sure he was just a child, but that didn’t matter to Keith. A connection was a connection and that was that.\n“We should keep a close eye on him today,” Allura said. “It’s been seven days since he was hit with that blast, so the effects of it should have almost finished running their course.”\n“I’ll watch him,” Keith said. He was always watching Lance, it seemed. He did little else, especially after Lance had been hit with that blast. “What are the plans for today, Shiro?”\n“Same as yesterday,” Shiro said. “I don’t want anyone to get worked up or tired in case something happens to Lance. We should all be ready for when he needs us.”\nKeith nodded. That sounded like a reasonable plan to him. There was no way for them to predict what would happen to Lance but it was simple to know that he would need them when he woke up. Even if he didn’t remember what had happened, his body would go through enough to exhaust him, just like Allura had said.\nHunk and Coran entered the dining room with breakfast soon after that. Pidge appeared when they did. Breakfast was much was it always was; a peaceful, social event. Now that they could work as a team well enough not to need to sling food around, everyone left the table with full stomachs. Keith used one arm to hold the bottle Hunk made for Lance while he used the other to eat his own breakfast. It was a little fiddly but he worked it out alright. \n“I’ll be opening a wormhole to transport the ship to a safer location later today,” Allura informed them. “Coran located a small, isolated pocket where there are no colonised planets or Galra bases anywhere close by. We should be able to station ourselves there safely for quite some time.”\nShiro nodded. “Alright, sounds good,” he said. “Come find us if anything changes in Lance, alright Keith?”\nHe didn’t need to be told to do that but took it for what it was. Everyone dispersed from breakfast with a sort of reluctant languidness, and Keith didn’t blame them. He supposed he was lucky that he was the one who got to hold Lance all day – they were just as worried as him. The others, especially Pidge and Hunk, had known Lance for a lot longer than he had. More intimately, too. They’d been in the same team back at the garrison after all. Maybe it was a little selfish of Keith to want Lance’s attention all to himself so badly, but even knowing that he still couldn’t give it up. \nHe spent much of the morning lounging around in the common room with Lance again. Although his mind told him he shouldn’t be wasting time outside of the training deck, the other parts of him were more than comfortable resting on his side against the couches as Lance entertained himself with his toys. \nAbsently, Keith fixed Lance’s sweater. Every time Lance flailed his arms or turned around to stare at Keith as he often did, his clothes would become twisted or ride up. Shiro had put him in a red sweater with a collar today, paired with black pants and matching black socks. “You look just like a Red Paladin today,” Keith told him, poking Lance in the arm once. “See? Our clothes match.”\nLance just giggled, shaking his rattling toy again as if to agree with Keith.\nKeith allowed himself a small smile. He poked Lance in the stomach and enjoyed the giggle he got in return. Maybe Lance was ticklish, and as Keith skittered his fingers along Lance’s chubby side, Lance positively screeched with laughter.  So you are ticklish, then. \n“Keif, no!” Lance said, huffing around his giggles. “Keif!”\n“It’s Keith,” Keith said, a grin pulling at his lips as he pulled more laughs from Lance. Was the normal Lance ticklish? For a moment he thought he could just poke his fingers into Lance’s side to see if he was, but then he shook his head.  I can’t do that! Why did I think I could do that?  \n\n I bet he is ticklish, though. \n\nSighing, Keith finally relented. He rested his chin in his hand, the other loosely resting on his side, as he watched Lance. Lance’s giggles died down into breathless little noises as he stared at Keith. It wasn’t as off putting as it had been before. Keith guessed he was used to it.\n“Keith,” Lance corrected himself. He wiggled closer and leaned over Keith’s head, resting back against the top of Keith’s chest as he did. \nKeith lifted his free hand to wrap around Lance’s waist just in case he toppled over; he’d rather not have Lance fall on his face. “What are you looking at?” Keith asked. \nLance just babbled at him. It was the same, mindless chatter as before but it was oddly pleasing to listen to. He didn’t have a clue what Lance was saying but he didn’t think it was too important. He nodded and hummed as much as he would have if it were a two-sided conversation. \nEventually, Lance’s chatter seemed to quieten. Keith gave him a frown as Lance sat down on the couch in front of him to rest himself up against Keith’s chest. “You sleepy, Lance?” He asked quietly, reaching up to run his fingers through Lance’s soft hair. Lance didn’t usually fall asleep at this time of day, and he certainly shouldn’t be sleepy after eating breakfast. That knowledge made Keith’s chest tighten.\nLance was beginning to re-age.\nKeith knew he should tell Shiro and the others, if just to inform them that Lance was starting to behave different, but he couldn’t bring himself to. He wanted to keep Lance to himself for a little while longer. “You can sleep for a bit if you want,” he told Lance, “but you gotta wake up later, alright? Deal?”\nLance nuzzled his nose against Keith’s collarbones and promptly fell asleep, fingers tangled in Keith’s hair. Keith sighed at him. Of course Lance would still be as frustrating as always, though he didn’t feel the same irritation that he used to. Perhaps he just felt resignation. He didn’t want to give this Lance up, not just yet. Part of him was afraid that Lance wouldn’t remember this bond and part of him was afraid that he would. They couldn’t guarantee that Lance would wake up himself, either – with everything that had happened to him it was possible that he wouldn’t ever be his normal self again.\nAnd even though Keith and the normal Lance hadn’t always gotten along well, Keith didn’t want him to disappear forever. If possible, he would have liked to get to know that Lance the same way he knew this Lance. Would it be possible for them to replicate the bond he had now? Would Lance even want that?\nThinking about it hurt Keith’s head. He liked spending time with Lance like this – was that bad of him? He’d become accustomed to Lance’s attentions and it had only been a week. He was annoyed at himself for letting that attachment grow, but when he glanced down at Lance’s sleeping face pressed against his chest, the irritation dissipated. Running his fingers through Lance’s hair calmed him and after exhaling once, he was able to put those thoughts behind him. They would do him no good now. Instead, he focused on enjoying Lance’s company, even if he was sleeping. \nAgain, Keith sighed. He closed his eyes, just for a moment, hoping to enjoy Lance’s closeness for a little while longer. Before he knew it, he was sleeping, too.\n \nWhen he woke, Shiro was leaning over him. “Wake up, Keith,” he murmured quietly. “You’ve missed lunch.”\nKeith let out a groan as he sat up. Lance was still curled up against his chest and Keith slipped an arm under him to keep him in place. “Did I? Sorry.”\nShiro shook his head. “Nothing to apologise for. You seem tired.”\n“I didn’t mean to fall asleep,” Keith said. “Lance did and I was laying down and I just…”\n“It’s alright,” Shiro repeated. He took a seat beside Keith and gave Lance a searching look. “He doesn’t usually sleep at this time of the day.”\nKeith winced. “I know. I think he’s starting to re-age now,” he admitted. “I just wanted to let him sleep for a while.”\n“Keith, you know you can talk to me if you feel worried,” Shiro said gently. “I may be able to help.”\nHe glanced away. Shiro didn’t sound pitying; if it was any other person with perhaps the exception of Hunk, Keith would have been offended. But this was Shiro, and Keith knew that Shiro would do anything to protect them. He was just like that. “I am worried,” Keith said slowly, “but I just… I like this Lance,” he said. “I want the other one back too, of course, but. I don’t…”\nHe didn’t know how to say it. The words were getting stuck in his throat and it was endlessly frustrating. He just didn’t want Lance to be alone anymore, and if in doing so he gained some sort of bond with Lance, then even better. \n“Keith, there’s nothing wrong with wanting a connection with Lance,” Shiro said, placing a hand on Lance’s shoulder. “If he could get past his whole rivalry mindset, I’m sure you two would be unstoppable. You have a connection with him that the rest of us don’t.”\n“I don’t,” Keith said, turning his head to look at Shiro. “I don’t have any connection with him, not like I do now.”\n“And you don’t want to lose that,” Shiro concluded, sighing. He paused for a moment to gather his thoughts. “I can’t say for sure what’s going to happen, but I know Lance will appreciate you being there for him. You never know, he might remember everything.”\nKeith flushed. “That might be even worse than if he forgets,” he said, miserable.\nShiro laughed. “Whatever the outcome, I’m sure you’ll be fine. We all will. I’ll make sure of it, okay?”\nWhen Shiro said it, Keith felt inclined to believe him. He nodded. “Okay.”\n \nLance was grouchy at lunch. He almost fell asleep face-first into his bowl of pureed mush and after a while of struggling to get him to eat Keith just gave up. Lance would start to get teary-eyed if Keith put him down, but it wasn’t the same kind of teary-eyed as before. This time it was more desperate, more frightened. Keith knew it was because of the blast.\nAs the day progressed Lance started to fidget and whine. His fingers would periodically tighten in Keith’s hair to the point of pain before he’d let out a whimper and go still. He was in pain and there was nothing Keith could do about it other than hold him and comfort him as best as he could. He rubbed Lance’s back and smoothed down his hair and shushed him when his whimpers became loud.\nTowards the end of the evening, after she had relocated the ship to a safe space, Allura did another scan on Lance. This one took longer than the previous ones and the screens that appeared to show his diagnostics were longer and full of more information. Keith didn’t understand much of it but he didn’t really need to – Allura did.\nShe frowned as she read it over. “His progress has definitely accelerated,” she said. “It’s causing him pain as his nerves begin to stimulate augmented growth. I would not want to leave him out of the healing pod for much longer, but the longer we wait so that the blast properties can fully disintegrate, the better. When the pain becomes too uncomfortable for him he will have to go in.”\nKeith nodded and continued to rock Lance quietly. He was in the middle of another uncomfortable bout of pain but as Keith rocked him, he slowly relaxed. “Keif,” he whined miserably, huffing wet puffs of air into the crook of Keith’s neck. Keith didn’t bother correcting his pronunciation anymore.\n“How much longer?” Shiro asked. His arms were crossed and there was tension in his shoulders but his voice was still nothing more than gentle and concerned. \n“A few hours, at best,” Allura said. “I wouldn’t risk much more than that.”\nIt didn’t seem like all that long to Keith. He wouldn’t hand Lance over to anyone who came to see him, but he did let them hold onto Lance’s hands and smooth down his hair. If they did lose Lance, then it wouldn’t only be Keith who suffered. As if sensing their concern, Lance would reach out to pet the faces of the other Paladins and babble their names at them. He was weak and tired but he still tried to cheer them up and it made Keith’s heart hurt.\nNo one ate dinner that night. They all sat in the common room spread out across the lounges, talking quietly. No one made a comment when Lance let out pained whimpers and cries of their names. Perhaps Keith shouldn’t have taught him them, after all.\nIt was nearing the time they usually retired to bed when Lance’s discomfort became too much. He started to cry – at first, they were only small, staggered cries, but they became big, heart-shattering wails within moments. No matter how much Keith comforted him, he wouldn’t stop.\nKeith had never been so helpless. There was nothing he could do and no way for him to ease Lance’s pain, no matter how hard he tried.\nThey moved him into the healing pod shortly after. Shiro folded one of his jackets around Lance as they set him on the floor. When Lance had first been transformed his clothes had not shrunk with him and it was unwise not to believe the same problem wouldn’t occur. Shiro’s jacket would be long enough to cover Lance’s modesty with ease when he turned back to normal.\n“You’ll be alright,” Keith whispered to Lance as he gently set him down. \n“Keif,” Lance whined, reaching out of him.\nKeith closed his eyes tightly as he cautiously untangled Lance’s fingers from his hair. “You’ll be alright,” he repeated. Lance just stared at him, eyes wet and cheeks red. Keith hesitated, glancing over his shoulder to make sure no one was watching him before carefully bending down to press a chaste kiss to Lance’s forehead. “I’ll be here when you wake up, okay?”\nAllura turned the pod on after Keith had moved away. Keith couldn’t bear to watch it freeze over so he didn’t, turning his face away. His arms felt oddly empty and light without Lance’s weight in them. He’d gotten used to carrying him around and having his warmth pressed against his chest and the quiet sound of his breathing. What was he meant to do with himself, now? \n“The pod will tell us if something happens, right?” He asked Allura.\nShe nodded. “Yes, it will,” she said. “I’ve programmed it to give me hourly updates so that if anything happens we’ll know straight away.”\nKeith was tempted to ask her to program it to give him updates as well but he held his tongue. He would drive himself crazy if he had that. It was better if he didn’t no matter how much he hated the feeling of having to wait in the dark.\n“I think it would be best if we got some rest,” Shiro finally said after they spent a moment standing in silence. “If no one wants to eat, then go to bed. It will do us no good if we’re tired in the morning, so don’t go wandering, either.”\nKeith nodded. Not even Hunk seemed to have an appetite so after a round of quiet goodnights they each disappeared into their rooms. Keith sat on his bed after he’d gotten changed, wondering what to do with himself. He didn’t feel tired. He kept staring at one of Lance’s blankets – it was thrown onto his desk from where it had probably fallen out of the crib a few nights ago. Shiro had probably forgotten to take it with him.\nHe could hear Shiro moving the crib now. He was probably taking it back to the infirmary. Keith was tempted to see if he wanted help, but stopped himself. They were all dealing with the anxiousness of Lance’s situation and Shiro probably wanted to be alone for a bit. Keith didn’t want to disturb him. Instead, he tried to rest, but even with the lights turned off and his blankets pulled over him he found himself too restless to sleep.\nEventually he started to wonder if it would be better for him to watch over Lance for a little while longer. Maybe if he stayed up for a while he would become tired enough to sleep for a few hours. He was only putting himself on edge with those kinds of thoughts so with a scowl he kicked off his sheets and made his way back to the healing pods. \nIt had been at least an hour or two but Lance hadn’t changed. Keith stood in front of the pod, arms crossed, and watched him with a frown on his face. There were hardly any signs that Lance was alive – his skin was pale and his eyes were still. If not for the steady, albeit subtle rise of his little shoulders Keith would be far more concerned. \nHe sighed.  What am I doing?  He knew he should go back to bed and try to sleep, but his feet wouldn’t cooperate. He wanted to stay with Lance. Even pressing his forehead against the glass of the healing pod didn’t do much to alleviate his concern.\nAt least standing there did ultimately tire him out. “I hope you wake up soon,” he whispered to Lance. “I don’t like it when the ship is so quiet. Everyone misses you, you know. I… I do, too, so wake up soon, okay?”\nLance couldn’t hear him but it still made him flustered and embarrassed to say such things. After sparing Lance one more longing look, Keith turned away. He just wanted Lance back, no more pain or loneliness or quiet suffering. Lance needed better – deserve better.\nHe’d make sure those things never came back to haunt them.\nLance didn’t wake up the next day, or the next. Keith was wearing holes into the ground as he paced before the doors into the healing pod room. After the first day Allura had gone in to check on him and come out wearing a wince.\n“What? What’s wrong with him?” Keith had demanded.\nAllura had only shaken her head. “This process looks very uncomfortable,” she had murmured. “I think it is best that you do not see him until he has completely grown.”\nHer comments made grotesque images flood Keith’s mind. Lance wasn’t awake for any of it but that didn’t mean he couldn’t make expressions, not to mention the scans would display his heart rate and his brain activity. He couldn’t help but think something was going wrong – were his bones growing at different rates? Where his limbs awkwardly proportioned? Was he in pain?\nAs if she could read his mind, Allura had pulled him aside later that evening. “It is not as bad as you think,” she said, “but he is in pain. He has many years to regrow and its straining his body.”\n“But what’s happening to him? What does he look like?” Keith had asked her, gripping her shoulders tight without really meaning to. \nAllura had only hesitated a moment before sighing. “He’s uncomfortable, and bruised.”\n\n “Bruised?” \n\nAllura nodded. “His joints in particular – elbows, knees, wrists – are bruising significantly. I half expect his skin to split in some places, but I don’t think it will. He’s taken good care of it.”\nKeith had wanted to laugh at that. A dry, humourless laugh. He could picture Lance in his head, skin practically glowing. His skin care routine was probably longer than everyone else’s, and he was going to be so smug when he realised how important it had come to be.\nAfter that, no one had been allowed into the healing pod room. Not even Pidge could crack the code, though Keith didn’t think he tried as much as he could have. Allura was protecting them from seeing their friend in pain when they couldn’t help and that was something to respect. It didn’t, however, stop Keith from pacing in front of the door like a frantic mother. (He wouldn’t have ever called himself that, but Hunk had and now everyone was doing the same. Keith just scowled at them until they stopped. He was  just worried, okay, I’m just worried so shut up!) \nHe kept thinking that there must be something they could do, but there simply wasn’t. He’d known that this process might take longer than a day, but it was driving him mad. He couldn’t sleep for longer than a few hours at a time and he trained until he was sweating through his suit just to try and burn off some of his restless energy. The entire castle was suspended in a tense, tightrope situation and Keith was afraid that if he crumbled, or if anyone crumbled, then they would all fall. \nIt was hard to be happy without Lance. Without any of them, he was sure, but Lance was different. They needed him.  I need him. \nAnd not just for Voltron.\n“Come on, Keith,” Shiro said from the end of the hallway, “let’s eat. Glaring at the door won’t help.”\nHe knew it wouldn’t and having that pointed out to him was irritating, but he didn’t say anything. He wasn’t mad at Shiro and snapping at him would only make everything worse. Shiro was just trying to help.\nAlthough he wasn’t hungry, he did follow Shiro to the dining hall. Hunk was distracting himself by making food and there was so much that Keith didn’t think they’d ever finish it, but that didn’t matter. They could use it as leftovers. If Keith happened to notice that much of the food made was Lance’s favourite, then he didn’t mention it. No one did.\nHe managed to make himself eat that night. Rationally, he knew the food must taste good, but he could hardly get himself to swallow more than a handful of mouthfuls. He felt incredibly mindful of his actions, like the others were watching him, waiting to catch him when he broke down, and although he felt closer to them after this whole incident, that was going a little too far. He didn’t want them to think he was weak, that he needed coddling. \nSo he ate. That way Hunk wouldn’t worry over him, and if Hunk didn’t worry over him, then Pidge wouldn’t. He ate and he looked like he was managing to control himself, because that way Shiro was satisfied, too. Keith didn’t think he could trick Shiro properly, but Shiro knew when to hold his tongue, and Keith was grateful for that. He didn’t think he could track Allura either, but she was easier to avoid than Shiro.\nThat evening, Keith got a few hours of sleep before waking again. It had been happening ever since they’d put Lance in the healing pod, but usually if he walked around for a while he’d become tired enough to sleep again. That was what he did again that night – walk around. It was a little colder in the hallways than he expected but his skin was still warmed from sleep so it didn’t bother him too much. \nSomehow, he found himself walking back towards the healing pods. Allura had kept the room locked up tight since the first time she checked on Lance, and every time Keith had walked past it or gone to glare at it, it had been shut. Tonight, however, was different. As he rounded the corner he spotted a wedge of light spilling across the floor. His body jerked at the sight of it and he was struck with the urge to peer in, but he held himself back and swallowed heavily.\nHe did walk closer, but he didn’t enter the room. “Allura, are you in there?”\n“Keith? Yes, I’m here.”\nKeith bit his lip and leaned against the wall. “How… How is he?”\nAllura was silent for a moment and it worried him. Then, she spoke. “You may come in.”\nHe hesitated, but then shook his head. He didn’t have anything to be afraid of; he couldn’t be the type of person to become frightened over something like this. It just wasn’t  him.  \nOnly Allura was in the room when he entered. She was standing before Lance’s pod, staring at it with a small frown on her face. “His growth is going well, before you ask” she said as Keith slowly came to stand beside her. “Can you not find sleep?”\nKeith shook his head. His eyes were intensely focused on Lance – he was much bigger now, and the change suddenly felt so abrupt that Keith could hardly comprehend it. Gone was the baby he’d left in the healing pod, replaced with a bigger, early-teenaged Lance who lay slumped against the back wall. Like they’d predicted his old clothes hadn’t fit; they lay in tatters across his thighs. Thankfully, Shiro’s jacket had stayed slumped around shoulders, covering everything that needed to be covered.\nIt wasn’t Lance’s clothes that Keith found himself stuck on, however. It was the bruises.\nLike Allura had said, they were mainly on the joints of his body. His elbows, knees and wrists were splattered with dark blue stains that were clearly visible even with his dark skin. Not only that, but they were scattered across his shoulders and ribs where his bones were expanding and growing faster than the rest of him. For a moment, Keith had a fleeting thought that puberty must have been a strange time for Lance where he spent years awkwardly growing into his features, but the thought was quickly dashed away with by unhappy feelings. \n“Is he in pain?” Keith asked. His voice sounded oddly calm, even to his own ears.\n“Yes,” Allura answered. \nKeith appreciated her no-nonsense attitude. With a deep inhale that seemed to make his lungs shudder, he dragged his gaze away. “There isn’t anything we can do, is there?”\nAllura winced. She looked more upset that Keith had seen her in a while. “No.”\n \nHe didn’t sleep that night, or the one after. He trained until his arms shook and he ate until he felt full but it didn’t help. Allura had told him the password into the healing pod room in case he wanted to go check on Lance, but he never did. Before, his feet had carried him there without him meaning for them to, but now he avoided it at all costs. He would walk around the entire castle as long as it meant he didn’t need to pass through that hallway.\nThe others noticed, but he didn’t let them say anything about it. He knew they must know he’d seen Lance, but he wasn’t willing to talk about it, so he didn’t. \nThe next night he went to the observation deck. He wasn’t sleepy, but he was tired. When he stood before the great, domed window that gave him a look out into the galaxy, he felt a little better. Seeing such a big, endless space before him made him feel like he was floating, like all his thoughts could drip out of his ears like running water and be forgotten forever. Sometimes, when he looked out at the universe, he missed earth. Other times he only wanted to get further and further away. \nShiro came to find him after a few hours. Keith was drowsy, but not enough to sleep, so he didn’t mind the company. He knew Shiro would come to talk to him eventually, and as Shiro took a seat on the floor beside him, he was kind of glad to have someone else around.\n“You feeling alright?” Shiro asked. \n“I’m fine,” Keith said, though he wasn’t. He just didn’t know what he felt. “Lance isn’t.”\nShiro pursed his lips. He turned his head to watch the stars like Keith was. “He’s growing, isn’t he?”\n“Yeah.”\n“That’s good, at least.”\n“Yeah.”\n“What are you going to do when he wakes up?” Shiro asked. Keith half expected him to ask more about Lance, or about how Keith was feeling. Funnily enough, the change in conversation topic was rather relieving. \n“I don’t know,” Keith answered. “I don’t know what he’s going to remember.”\nShiro hummed. “I know this is hard for you,” he said, “and I want you to know that the rest of us are going to be there for you just as much as we’ll be there for Lance. You don’t need to be afraid of anything you want from him, Keith.”\nKeith glanced at him, eyebrows furrowed into a worried frown. “I don’t know what I want,” he said. “How can I tell him when I don’t know?”\n“Maybe…” Shiro paused, “Maybe show him, instead? I don’t think you give him enough credit. If you show him, he’ll know.”\nKeith’s heart was lodged in his throat. When had it gotten there? He couldn’t remember, but it was racing like crazy. “What if I still don’t know?”\nShiro gave him a small, comforting smile. “I have a feeling it’ll come naturally to you. Most things do, Keith, even if you don’t notice. Take it one day at a time, okay? Just one day.”\nHe nodded once, then nodded again. One day at a time. He could do that.\n \nFive days after being placed in the healing pod, Lance showed signs of consciousness. Allura’s alert went off as they mulled over breakfast. It was only a short, quiet beeping noise but it still buried its fingers into Keith’s brain to make a permanent space for itself.\nAs a group they went to the healing pods. It reminded Keith of when Lance had been in a coma and he’d impatiently wanted to get Lance out. Even back then he’d wanted Lance’s attention, it seemed. He’d just never realised.\n“Alright, let's get you out of there,” Coran said as he fiddled with the controls for the healing pod. After a moment the front screen lowered and puffs of cooling air wafted out. Lance had completely returned to his normal age but his joints and his face was still littered with bruises. Keith guessed that his facial features had been the last of him to settle after puberty. No one mentioned that Lance was all but naked. \nFor a moment, nothing happened. Then, Lance’s eyes peeled open and he let out a pained whine. Without any strength in him he stumbled straight out of the pod and Keith leapt forward to catch him, grabbing him under the arms in an attempt to keep him upright. “Lance!”\nLance was panting against Keith’s neck. His brows were pinched and his limbs were shaking uncontrollably. From where Keith’s hands pressed against his sides his skin felt dangerously cold.\nHe was still in pain and it was so evident that Keith like the air had been punched from his lungs.\n“We need to get him back in the pod,” Allura commanded, moving forwards to help Keith lift Lance. He almost wanted to yank him away from her but she was right – Lance needed to go back in the pod until he finished healing.\nLance cried out in pain when they wrestled into back into the healing pod. As Keith was drawing back Lance’s fingers suddenly found a fistful of his hair. “Keith,” he whimpered.\nKeith jerked back as if stung, his grip on Lance’s waist going limp. Allura muscled Lance into the healing pod and then the front screen was sliding upwards and frost was creeping up along Lance’s skin. Knees suddenly weak, Keith toppled backwards, landing heavily on his hands. He couldn’t breathe.\n“Keith? Keith! Get up,” Shiro said, but his voice sounded distant, as though he wasn’t standing right behind him. Even when Shiro pulled him to his feet Keith hardly realised it. \nLance’s words were as deeply ingrained in his mind as Allura’s beeping alert had been. He’d only said one thing, but his tone and the frightened look on his face were burned behind Keith’s eyes and no matter how many times he blinked they wouldn’t go away. Lance had only said one thing, just one, but it had been enough to render Keith completely useless.\nLance had grabbed his hair.  Lance grabbed my hair. He grabbed it just like he did when he was a baby. \nDid he remember?\n \n“He’s in shock,” Shiro murmured to Allura, “or something.”\n“I’ve never seen him like this,” she whispered back.\n“Neither have I.”\n“Should I… embrace him? Feed him? How do humans offer comfort?”\n“It’s usually different for everyone… Probably don’t hug him.”\n“I can hear you,” Keith said, scowling. “You’re not being very quiet.”\n“Sorry, Keith,” Shiro said. \nIt wasn’t Shiro’s fault, and like before, Keith wasn’t angry at him. He didn’t know who he was angry at, or if he was angry at all. He felt cold on the inside, and his mind was fuzzy. He tried to distract himself or convince himself to go do training simulations again, but he couldn’t move. He was just  tired. \n“Now that he’s awake he shouldn’t be in the healing pod for much longer,” Allura said. “His vitals are all improving and the bruises are starting to disappear. He will be alright.”\n“How long until he wakes up?” Hunk asked. “Coran and I have to cook enough food for him again.”\nNo one mentioned that he’d never stopped doing so.\n“A day, perhaps? I’ve upped the pain medication levels to help.”\nPidge cleared his throat. “I’ve been working on something this week to modify our lions,” he said. “I took the battle record from the Blue Lion and separated the code it recorded from the moment the blast hit. I think I’ve made something that will prevent anything like that from happening again – a jamming box, you could say, to stop blasts and waves from entering the cock pit of the Lions.”\n“That’s incredible, Pidge,” Shiro said, pleased. \n“Of course, I can’t actually test it out with the specific technology that will turn us all into babies,” Pidge continued, “but I’m pretty sure it’ll work. When can I install it in everyone’s Lions?”\n“Whenever you’re free, go ahead,” Shiro said. Hunk and Keith nodded in agreement. \nPidge’s distraction was welcome. It was easier to listen to the Paladins discuss Voltron and their Lions rather than listen to the nagging doubts in Keith’s head. \nThat evening, Keith snuck back into the healing pod room. He knew he wouldn’t be able to sleep and just the thought of being trapped in his room by himself made him feel revolted. He wouldn’t be able to stand the heavy, pressing loneliness that had begun to suffocate the room. \nHe sat with his side resting against the healing pod. It was cold to the touch, but bearable. There was a slight humming from it that filled the silence of the room and like this, he felt a little more at ease. Sure, the floor was hard and uncomfortable and he kind of wished he’d brought a blanket with him, but sitting next to Lance calmed him down. Allura had been right when she had said Lance was healing – his bruises were slowly but steadily disappearing and the tightness in his shoulders was unravelling. \nKeith didn’t sleep, exactly, but surely something close enough to it to make him feel more rested than he had before. His eyes were closed and his breathing was even and the hours passed quicker than usual, but he was sure it wasn’t sleep. He was still awake enough that when the front screen of the healing pod opened to spill cold wisps of air across him his eyes were open and he was conscious. \nIt must have been early morning for sure, if the aches in Keith’s shoulders and neck were anything to go by, but he didn’t care. He watched Lance stumble out of the healing pod and fall to his knees beside Keith, wobbly on his feet. He was groaning and holding his head, and then his hazy blue eyes lifted. “Keith? Why are you on the floor?”\nIt was a stupid question and definitely not the first one Keith would have asked, but that didn’t matter. Lance’s voice was a soothing balm to an ache in his head and his eyes were  definitely not wet  as he gaped at Lance. “You’re normal,” he finally choked out.\nLance’s head tilted to the side. He looked kind of dopey like that, which made a harsh, short laugh come from Keith. Lance always looked dopey. “Why am I on the floor?” Lance asked next. “Why you looking at me like you’re gonna cry?”\nKeith couldn’t help it, he threw his arms around Lance and barked out that breathlessly relieved laugh again. “You’re awake,” he said, voice shaky. Lance’s weight wasn’t exactly back in his arms but it was definitely close enough.\n“Okay man, you’re being weird now,” Lance slurred. “What are you doing?”\nKeith paused, and hesitantly pulled back. “Don’t you remember?”\nLance gave him an oblivious look. “Remember what? Why are you hugging me?”\n“You’re don’t remember,” Keith said, heart abruptly sinking. The words didn’t feel like they came from his mouth. “You don’t… Don’t remember.”\n“Don’t remember what?”\nHe didn’t remember.\nKeith, with his arms crossed tightly against his chest, anxiously watched Coran move around the infirmary. If he lowered them, he was sure they would show that he was shaking. He couldn’t get them to stop no matter how hard he tried.\nLance was asleep, neatly tucked into one of the infirmary beds. An IV needle fed fluid into his system and senses monitored his heart rate. He was sleeping but he looked restless, like he might wake at any moment. They’d moved him into the infirmary after he’d woken from the healing pod and would keep him there until he woke properly.\nThe other Paladins knew what Lance had said, that he didn’t remember. Lance had muttered as much when they’d rushed into the room shortly after he’d woken. At least Keith didn’t seem to be the only one shaken up by Lance’s strange ramblings. \n“He’s not acting like himself,” Hunk said, a worried frown on his face. “Don’t you think he’s acting weird? What if his head didn’t get fixed, or something?”\n“Hunk, calm yourself,” Allura said. “All scans are indicating that his re-growth process was completely successful. His diagnostics are similar enough to the ones recorded from before the attacks that I am sure his  head,  as you say, is perfectly fine.”\n“Then why is he all loopy?” Pidge asked, tilting his head to the side curiously. He leaned across Lance to poke at Lance’s cheek. “He doesn’t normally act so clueless.”\nAllura gave them a puzzled look. She clearly didn’t understand earthen terms, but the meaning was fairly discernible. “Well, I did up the dosage of his pain medication… It’s likely he’s still working through his system. It is Altaen, after all.”\n“Wait, wait, wait,” Keith said, shaking his head as he stepped forwards. “You’re saying Lance is drunk on alien pain meds?”\n“Yes, quite possibly-”\n“Are you  serious?” \n“Well, yes-”\n“What the  hell,  Lance!”  I’m so going to punch him when he wakes up for this. \n \nKeith lay in bed brooding for a long time that evening. He skipped dinner and couldn’t be lured from his room, not even by Shiro, who knowingly didn’t pester him for too long. He felt far too frazzled to be around anyone at the moment and much preferred his own silent company. There was too much going on in his head for him to focus any amount of attention on the others.\nIf Lance’s mind was being muddled by the medication, did that mean he might still remember everything that had happened when he was stuck as a child? A deep, lonely part of Keith hoped so, even if Lance only remembered bits and pieces. He never felt alone on Allura’s ship and the Paladins had certainly offered him a place amongst them, but he was still unable to make emotional connections with them, and it left him lonely in the face of their companionship.\nWhen he was with baby Lance, it had been different. For the first time, Keith had felt like he was truly needed for something other than Voltron. That if he were to leave, someone would throw a fit and act relentlessly to get him to return. Somehow, the fact that it was  Lance  of all people, even as a child, made his face burn. He never would have thought he’d make such a bond with the Blue Paladin. They were almost designed to not get along – fire and ice, red and blue, good and bad. \nBeing away from everyone helped clear his head. He supposed not all habits could be shaken off so soon – that he’d still crave complete silence every now and then. Tonight was just one of those times. If nothing else, it did give him a time to think everything over. Mostly, he thought about Lance. He still couldn’t put words to what he was feeling, so he tried to put words to what he didn’t want instead.\nHe didn’t want to lose Lance.\nThat was obvious enough, he thought, so he tried again. He didn’t want Lance to be in pain. He didn’t want Lance to hide his homesickness from him anymore. He didn’t want Lance to be lonely. When it came down to it, there were a lot of things he didn’t want Lance to be (and in a roundabout way, that he wanted Lance to be – content and healthy, for example). Even if he wanted all of that, he couldn’t control Lance, or the way Lance felt.\nHe could, however, control himself. Deciding what he wanted was harder, but knowing what he wanted for Lance helped. He supposed that a lot of it came down to Lance, in the end – if Lance would want his help, if Lance would accept any feelings Keith had for him, if Lance would want a bond or something more with him. If Lance did want it then- well, Keith did too.\nIt seemed ridiculously simple when he thought of it like that. How infuriating.\nSurprisingly, he slept fairly well that night. When he woke the next morning he suffered a brief bout of disorientated confusion in which he searched his room for Lance’s crib – it had been happening for a while, but less commonly now – before waking completely. It was still hard to shake off those feelings; the ones that told him he should he looking after a child that was no longer around.\nWith a resigned sigh, he slipped out of bed. It would do him no good to mull over it for any longer, not when he’d spent the night doing exactly that. Instead, he forced himself to get changed. Lance should be awake today, and Keith didn’t want to linger in his room for longer than he needed to. \nHe was in the middle of pulling his undershirt over his head when his door suddenly hissed open. He jerked around, expecting to find Shiro or maybe Hunk peering it, but it was Lance that shoved his way through the doors. \n“Lance?” Keith asked, shocked. “What are you-?”\nBefore he knew it he had Lance’s arms thrown around him, half-pulled on shirt be damned. It took him an extravagantly long time to realise that the warmth he could feel on his chest was coming from Lance, and that the thing tickling his cheek was Lance’s hair, still baby-soft and irresistibly silky. It took so long that Lance tensed and began to pull back, but Keith shifted, gripping the back of Lance’s shirt as tightly as he could as he bit his lip hard enough to sting so that he wouldn’t cry. \n“Why are you here?” Keith whispered.\nLance shrugged. His shoulder awkwardly bumped Keith’s chin, but Keith didn’t care. “I snuck out when Shiro wasn’t looking,” he said, sounding oddly proud of himself despite his quiet tone. “He told me what I said when I was off my head on pain meds.”\nKeith stiffened. He stubbornly stared at the wall over Lance’s shoulder and hoped that Lance couldn’t feel the way his hands had started to uncontrollably shake again. \n“You know I didn’t mean any of that, right man? I didn’t even know what my name was,” Lance said. His hands tightened around Keith, flattening across his back to make warm patches.\nKeith exhaled shakily, and forced his mouth to move. “Do you remember anything?” He asked. “Anything from when… when you were de-aged?”\nLance was quiet for a moment. “Kinda,” he eventually murmured. His hand slid up Keith’s arm, his touch feather-light, like he was trying to recall something by touch alone, until he finally came to rest it tangled in locks of hair at the base of Keith’s neck. It sparked shivers that raced along Keith’s skin. “Bits and pieces, like flashes of memories or something. Everything… everything that I remember feels really  raw,  like a fresh burn, but not bad. It’s like everything I felt from then has been put under a microscope.”\nKeith swallowed heavily. “Was… Was it bad?”\nLance shook his head.\n“Was- was I… bad?”\nLance tightened his grip, and shook his head.\nKeith felt like sagging and it was only through sheer will power that he made his knees keep him upright. What was he meant to do now? He didn’t know what the next step was, what his next action should be, what he needed to do to make the racing of his heart settle.\nEventually, however, the strength seemed to slowly leave Lance. He was starting to shake with effort and if Keith had not had such a tight grip on him then he surely would have sunk to the floor. “You should probably go back to the infirmary,” Keith said quietly. \n“Yeah,” Lance agreed.\nNeither one of them moved.\nWhen Lance’s knees finally did give out, Keith held him up. Lance’s arm was over his shoulders and his arm was around Lance’s waist and he felt so incredibly close to him that it was overwhelming. Sure, Lance didn’t smell the best after being in a healing pod for a week, but there was something undeniably familiar about him that unravelled an ache in Keith’s chest. For the first time in what felt like ages, he wasn’t worried.\n \nIt only took half a day for Lance to regain his usual energy and attitude. Keith thought he might have been embarrassed over anything he did as a child, but he took it in his stride. In fact, he encouraged the others to tell him exactly what he’d done when he realised how embarrassed it made  Keith. \n“So my first words were his name?” Lance asked, grinning broadly even as Keith scowled at him. “And I took my first steps towards him?”\n“Not to mention the staring,” Pidge groaned. “You never stopped staring at him!”\n“That’s true,” Hunk laughed. “You were always so focused on Keith’s face!”\n“Oh boy Keith, what were you brainwashing me with?”\nKeith only scowled harder. “Like I needed to. You were obsessed with me.”\n“I think I’d use the word  smitten,  instead,” Pidge cut in.\n“Still am,” Lance grinned wider.\nKeith flushed, glowering furiously. It was unfair that Lance could still tease him like this when Keith could feel the lingering warmth of Lance’s weight pressed against him. It felt just the same as it had when Lance was a baby. \n“Alright, alright,” Shiro said, chuckling, “how about we go get something to eat, then? Lance, you must be hungry.”\nLance groaned. “Starving!”\n \nKeith thought about what Shiro had told him later that evening. He sat in the observatory room watching the stars and thought about how he could possibly show Lance what he was feeling rather than saying it. What action said  I want you to hug me more because it makes me feel less lonely, but only if you want to? \n“You’re really good at disappearing, aren’t you?” Lance said as he suddenly appeared beside Keith. His voice wasn’t cold and he had a warm look to his eyes that put Keith at ease.\n“When I want to,” he answered.\nLance huffed out a small laugh. He took a seat beside Keith and stretched out his long legs and for a moment, they were both blissfully quiet. Then, Lance mumbled, “Thanks for looking after me.”\nKeith startled at the comment and gave Lance a confused look. “You don’t need to thank me,” he said.\nLance unexpectedly leaned forwards, pressing his forehead against Keith’s chest to hide his expression. “I do,” he said, “so don’t say I don’t. Allura told me that if I had gotten stressed or hurt then I might not have turned back normal. You kept me safe.”\nKeith swallowed heavily.  Show, if you can’t tell.  Tentatively, he lifted hand to rest his palm on the back of Lance’s head. His hair was still irresistibly soft, even more so now that he had showered, and Keith couldn’t help but press his nose into it just like he had when Lance was a baby. “The others helped,” he pointed out.\nGently, Lance’s hand came to rest on Keith’s waist. The touch didn’t startle him anymore. “Not in the way you did,” Lance insisted. “The way you helped was different. Wasn’t it?”\n“I… think so,” Keith nodded. He sounded more sure than his words implied him to be.\nLance’s hand pressed up against his chest. “Your heart is racing,” he murmured. His breath was hot against Keith’s collarbones.\nKeith nodded.\n“Is it because of me?”\nHe nodded again.\nIt was with an incredible amount of gentle but swift prodding that Lance managed to pull Keith down onto the floor. Keith suddenly found himself staring into beautifully dark skies surrounded by a halo of stars only to realise that, with a small noise, the skies were in fact found in Lance’s eyes.\nLance’s hands were pinning Keith’s down, but his grip wasn’t tight. He seemed just as surprised as Keith was as he loomed over him. Their faces were close enough that Keith could feel the warmth of Lance’s breath and see the incredibly faint shadows his eyelashes cast across his cheeks. \nFor a moment, Keith thought Lance would kiss him.\nBut Lance didn’t, and Keith was glad. That was going too fast not only for him, but for Lance as well. Instead, Lance let out a happy bout of relieved laughter. He stuffed his face in Keith’s neck and collapsed across him, his knees planted on either side of Keith’s hips. “Your heart is still racing,” he said.\nKeith hummed. Lance’s weight was pressing him down, anchoring him. Lance’s hands had come up to pillow Keith’s head against the cold, hard surface of the floor. It was quiet except for the exhilarated breathes and the ever-present humming of the castle. Then, Keith spoke. “Lance?”\n“Yeah?”\n“Can… Can we be boyfriends?”\nLance smiled into his neck; Keith could feel Lance’s lips taking shape against his throat. “Yeah.”"
}