{
    "id": "7571629",
    "url": "https://archiveofourown.org/works/7571629?view_full_work=true",
    "author": [
        "fatal (cumrich)"
    ],
    "title": "if i get in, i just might drown",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "방탄소년단 | Bangtan Boys | BTS"
    ],
    "relationships": [
        "Jeon Jungkook/Park Jimin"
    ],
    "characters": [
        "Jeon Jungkook",
        "Park Jimin (BTS)"
    ],
    "additional_tags": [
        "Alternate Universe - Domestic",
        "Established Relationship",
        "Alpha/Beta/Omega Dynamics",
        "Mating Cycles/In Heat",
        "Rutting",
        "Knotting",
        "Self-Lubrication",
        "Consensual Somnophilia",
        "Breeding",
        "Feminization",
        "Consensual Non-Consent",
        "Come Inflation",
        "Rimming",
        "Felching",
        "Cum Play",
        "Ass Play",
        "Ass to Mouth",
        "Fingerfucking",
        "Anal Fingering",
        "Anal Sex",
        "Biting",
        "Bruises",
        "Marking",
        "Dirty Talk",
        "Public Sex",
        "Scent Marking",
        "Grinding",
        "Rough Sex",
        "Possessive Behavior",
        "Come Eating",
        "Come Swallowing",
        "Come Marking",
        "Intercrural Sex",
        "Oral Sex",
        "Face-Fucking",
        "Face-Sitting",
        "Wall Sex",
        "Overstimulation",
        "Multiple Orgasms",
        "Dry Orgasm",
        "Facials",
        "Snowballing",
        "Teasing",
        "Nipple Play",
        "Nipple Piercings",
        "Butt Plugs",
        "Aftercare",
        "Fluff and Smut",
        "Plot What Plot/Porn Without Plot",
        "unrealistic amounts of cum"
    ],
    "language": "English",
    "series": "",
    "published": "2016-07-25",
    "completed": null,
    "words": "12,438",
    "chapters": "1/1",
    "comments": "375",
    "kudos": "12,812",
    "bookmarks": "3,838",
    "hits": "818,842",
    "summary": "<p>fucking jimin has always been jeongguk's favourite hobby. ruts just made it that much more <i>special</i>.</p>\n<p>translated to vietnamese <a href=\"https://my.w.tt/HudNabVRu0\" rel=\"nofollow\">here</a>.</p>",
    "notes": "<p>\n<b>DO NOT REPOST OR TRANSLATE</b>\n</p>\n<p> </p>\n<p>this is for the one, the only, erika, my sinster (sin sister), whom i luv n adore~ ♡♡♡~ i hope you enjoy n____n</p>\n<p>i really have nothing else to say for myself, except that we have star trek fandom to thank for this. and yes, this really is 12k of porn. just porn. there isn’t even a plot if you look sideways and squint. thank you so much to rina, frances, and aren for cheering me on through this!!!</p>\n<p>please make sure to carefully read the tags on this and just as a precaution, here's a list of warnings i just want reiterated: <b>jeongguk fucks jimin non-stop, no breathers, barely any sleep for 3 days (yes, i know, it's impossible but this is omegaverse and depravity knows no bounds), somnophilia, feminization, breeding kink, inflation, consensual non-consent</b></p>\n<p><b>EDIT:</b> thanks jaykay for giving this fic a <a href=\"https://www.youtube.com/watch?v=QU9c0053UAU\" rel=\"nofollow\">soundtrack</a>. stream seven.</p>",
    "text": "Waking up to your mate’s body flush against yours has got to be on Jeongguk’s list of top ten favourite experiences. Jimin’s frame is smaller than his own, always fitting into Jeongguk like it’s the only place he could possibly belong. But even higher up on Jeongguk’s list is that he loves fucking Jimin awake. Loves how Jimin falls apart quickly, easily, how Jeongguk doesn’t have to work past his stubbornness.\n \nLying in the sunlight cascading into their room, Jeongguk pulls Jimin closer, hand smoothing down his side until it settles on the jut of his hip, marveling at the softness of his skin. Jimin curls into him, back pressing into Jeongguk’s chest and Jeongguk can’t help but lean in closer, kissing the back of Jimin’s neck, right above his mole. One kiss turns into two, into three, Jeongguk’s mouth working its way down the ridges of Jimin’s spine until the angle is too awkward to keep going.\n \nHe switches track, teeth biting gently into the juncture between Jimin’s neck and his shoulder, right where he’d marked Jimin as his two years ago. The reminder sends a rush down his spine, want burning hot in his gut, hand digging into Jimin’s hip possessively. Jimin’s scent is sweet, always alluring, and it’s curled around Jeongguk, cradling him.\n \nJeongguk laves at his bite, sucking the mark from a bright red to a deep purple, cock twitching as he scoots closer, snug against Jimin’s ass. Groaning, Jeongguk rubs his cock against the plush softness of Jimin’s ass, hand working his dick right between Jimin’s cheeks. Jeongguk huffs, hand inching from Jimin’s hip to his soft cock, fingers wrapping around the length loosely, tugging on it softly as his mouth continues to suck bruises against Jimin’s shoulder.\n \nThere’s a lick of heat in his belly, something animalistic that just wants him to devour Jimin, but the feeling fades quickly, leaving Jeongguk drowning in his own lust. Jimin smells so good, skin smooth and soft, body curling into Jeongguk, seeking comfort. Jeongguk relishes it, can’t seem to ever wrap his head around the fact that Jimin picked him.\n \nWhen he’s worked Jimin semi-hard, his fingers travel down, massaging Jimin’s balls, and the reaction is so immediate, Jimin arching into the touch, soft gasp escaping him. Jeongguk loves Jimin like this, so pliant in his hands, completely under his control, every reaction to his touch honest. He rubs a finger against Jimin’s perineum, inching toward his hole, the taste of his arousal seeping into the air slowly, something to be savored. Jeongguk’s hips grind against Jimin’s ass, seeking friction, cock harder, but he wants Jimin dripping wet, slick pooling out of him, wants Jimin to wake up with cock up his ass, fucked to consciousness.\n \nWorking his free hand under Jimin’s slim body, Jeongguk pinches at Jimin’s nipple, smirking when Jimin shudders, breath catching in his throat. Jeongguk’s teeth sink into Jimin’s shoulder, cock snug between Jimin’s ass cheeks, hips rocking back and forth, the friction too dry to be satisfying. He works Jimin’s nipples into hard little nubs, flicking the metal rod through the one on the right and smirking when Jimin lets out a pathetic whine, ass grinding back into Jeongguk.\n \n“Hyung,” Jeongguk murmurs, nose nuzzling into Jimin’s neck, scenting him, knows Jimin isn’t awake just yet, his reactions too small to be anything except subconscious. Jimin shifts forward, lies on his belly, and Jeongguk takes the opportunity to spread his legs further apart, revealing his asshole. “Fuck.”\n \nSucking a finger into his mouth, Jeongguk rubs the spit-wet finger against Jimin’s entrance, pushing past the ring of muscle just slightly. He knows Jimin could easily take in a single digit, they’d fucked last night, Jeongguk’s sex drive shooting through the roof lately, but he likes drawing it out when Jimin’s sleeping, likes to touch, taste, know Jimin’s body.\n \nJeongguk shifts, rolls Jimin down completely onto his stomach, mouth working it’s way down Jimin’s spine, tasting skin and the cloying sweetness of Jimin’s scent as he licks and bites Jimin’s skin. He wants to cover Jimin with marks, leave his skin a mess of reds, blues, purples, mottled artwork. Jimin groans when he bites down on his ass, teeth sinking into the flesh easily, and Jeongguk wants to spank him, watch Jimin’s ass bloom bright red under his hand. Instead, he sucks a second bruise, two fingers rubbing insistently at Jimin’s entrance, the scent of Jimin’s slick nearly knocking the breath out of him. It’s not until he’s covered Jimin’s ass in marks that Jeongguk lets himself think of tasting Jimin’s wetness, admiring how Jimin’s ass blooms purple.\n \n“Fuck, hyung,” Jeongguk groans, spreading Jimin’s ass apart, mouth gravitating toward Jimin’s hole. Jeongguk licks at his entrance, tongue flat as he tastes Jimin’s wetness, groaning. He teases for a bit, enjoying the little jerks in Jimin’s body as he pushes past Jimin’s asshole with his tongue just a little, never enough to fuck him open.\n \n“So fucking good,” he mumbles to himself, hands squeezing Jimin’s ass, kneading the plump flesh. His cock twitches, Jeongguk’s hips grinding down against the mattress, seeking friction.\n \nWhen he pushes his tongue past the ring of muscle, Jimin keens, hips jerking upwards, body twisting in on itself, and Jeongguk follows, fucking into Jimin’s hole with vigor. Hooking a thumb against the rim, Jeongguk laps at the slick that pools out, tastes his own cum from last night, swallowing down everything. It’s not until he’s got two fingers fucking into Jimin along with his tongue that Jimin’s whine is too loud to be subconscious, ass pushing back into Jeongguk’s mouth.\n \n“J-Jeongguk,” Jimin breathes, curling down to see him but Jeongguk doesn’t stop, can barely bring himself to spare a second to look at Jimin’s sleepy, aroused expression but he does, satisfaction gripping his heart as he sees the want on his face. He fucks his tongue into Jimin harder, slurping at Jimin’s juices, fingers rubbing insistently against Jimin’s  prostate. Jimin shies away from the touch, always too sensitive, thighs twitching as his hand grips the bedsheets, back arching and Jeongguk knows how close Jimin is.\n \n“Jeongguk, please,” Jimin whines, hips grinding down against the mattress desperately and he knows before Jimin manages to tell him aloud that he’s coming, his body pulsing around Jeongguk’s tongue, his fingers.\n \nJeongguk pulls out only when Jimin’s trembling, flipping Jimin onto his back easily. He always loves watching cum drool out of Jimin’s spent cock, the way his belly quivers post orgasm, barely able to keep his eyes open. Wiping slick off his face, Jeongguk smirks, “Good morning, hyung.”\n \nJimin only whines, hands pulling Jeongguk closer, mouth seeking Jeongguk’s and he’s never been able to say no to Jimin yet, he’s not about to begin here. It’s less a kiss and more Jimin insistently pressing his mouth against Jeongguk’s, tongue delving in to taste himself in Jeongguk’s mouth. Jeongguk let’s himself lie down next to Jimin, pulling Jimin half on top of himself, hissing when Jimin’s thigh brushes against his cock, still hard.\n \n“You’re a bad boy,” Jimin murmurs, finally seems to be in control of his senses and Jeongguk can’t help but grin, unrepentant. He looks cute, sleep mussed, hair disheveled, skin glowing. Sometimes Jeongguk thinks he’s mated to the sun.\n \n“Am I?”\n \n“Yes,” Jimin answers, grinding his thigh down against Jeongguk’s cock, and Jeongguk can’t help it, hand smoothing down Jimin’s back to squeeze his ass again. “Bad boys don’t get to come.”\n \n“Then I should never let you come,” Jeongguk tells him, fingers rubbing at Jimin’s entrance insistently. Jimin’s eyes flutter shut, mouth hung open, a feathery gasp escaping him. Jeongguk takes the opportunity to darken one of the hickeys he’s already left on Jimin’s neck.\n \n“I’m not the one,” Jimin starts, whining when Jeongguk teases at his entrance, fingers slipping in just a centimeter before pulling back out. “I’m not the one fucking people awake.”\n \n“Thought you loved that,” Jeongguk retorts, already sucking a new mark against Jimin’s neck and it was probably an understatement, how much he liked Jimin looking like he belonged to him. “Loved waking up with your ass full, cock hard and dripping all over yourself. Don’t lie, hyung. Good boys don’t lie.”\n \n“I’m not ly ― ah,” Jimin’s voice cracks, Jeongguk pushing two fingers into him, slick making the entry easy. He buries his face into Jeongguk’s neck, hips jerking back into Jeongguk’s fingers, seeking more.\n \n“Hyung,” Jeongguk drawls, “you just came and you’re already so desperate for more? If you were a good boy, you wouldn’t be such a desperate little slut, would you?” Jimin whines, teeth sinking into Jeongguk’s neck, as if a punishment and Jeongguk loves it, yanks Jimin’s head back with a fistful of his hair. Jimin’s flushed, pretty and pink, mouth parted. “Want me to fuck you, hyung?”\n \n“Please,” Jimin agrees eagerly, Jeongguk loosening his hold so he can kiss Jimin properly, licking into his mouth, teeth sinking into his bottom lip and tugging. Jimin moans through all of it, fucks himself down on Jeongguk’s fingers, the obscene squelch filling the silence of the room.\n \n“Ask me properly,” Jeongguk orders, breaking away only when Jimin’s panting into his mouth, lips swollen and red. Squeezing a third finger inside of Jimin, Jeongguk groans at the breathy gasp he gets out of Jimin, like music to his ears. His cheeks are flushed, eyes heavy with want.\n \n“Please fuck me, Jeonggukkie,” Jimin whines, hips rolling against Jeongguk’s, his cock hard as he rubs himself down against Jeongguk’s thigh. Jeongguk’s fingers work him open, his free hand nudging Jimin’s legs further apart. “Wanna feel you inside me.”\n \n“You are feeling me inside you,” Jeongguk grins, laughing when Jimin can barely manage a scowl, pushing back desperately against Jeongguk’s fingers.\n \n“Want your big alpha cock, Jeonggukkie, please,” Jimin begs, and he’s giving in so easily, too wound up to put up a fight. Jeongguk smirks, satisfied beyond belief. He rolls Jimin onto his side, presses kisses against Jimin’s lush mouth, before manhandling him onto his side, his back against Jeongguk’s chest.\n \n“This okay?” He asks, and Jimin just hums in response, Jeongguk lifting Jimin’s leg up before he works his cock into him, tight heat engulfing him quickly. They moan in unison, Jeongguk muffling his voice into Jimin’s shoulder as he pushes all the way in, cock throbbing inside of him.\n \n“Fuck fuck fuck,” Jimin breathes, hands scrambling for purchase and one winds up in Jeongguk’s hair, grip tight. Leaning back into Jeongguk, Jimin shudders against him and it’s enough to get Jeongguk moving, pace slow, hand gripping Jimin’s thick thigh to hold it up. Jimin sounds beautiful when he’s getting fucked, moans and whimpers mixing in with the slap of Jeongguk’s balls hitting Jimin’s ass. The position lets Jeongguk pinch and tease Jimin’s nipples endlessly, his breathy moans interrupted by little hiccups.\n \n“You feel so good, hyung,” Jeongguk tells him, fucking into Jimin harder and that earlier heat is back under his skin, searing through him as he fucks Jimin harder, pulling Jimin’s leg up higher. Jimin only whines, hand tightening in Jeongguk’s hair, as he presses back into Jeongguk’s chest. “So fucking tight, smell so good, hyung. Hyung, you like that, right? Like it when you’re stuffed full of cum, when my cock’s pounding into you?”\n \n“Yes ― please, Jeongguk ― ah, Jeongguk, love your c-cock,” Jimin gasps out and Jeongguk only fucks him harder, mind nearly numb with his desire to fuck Jimin senseless. He pulls out completely, pushing Jimin onto his stomach before fucking back into him in one quick thrust, grabbing Jimin’s hips to tug him up onto his knees. Jimin’s hands fist into the sheets, Jeongguk’s hips hammering into him, hands digging into his hips.\n \n“Fuck,” Jeongguk groans, hips stuttering as he feels his balls begin to tighten up and it’s instinct that has him falling forward, teeth sinking into Jimin’s mark as he fucks his own cum into Jimin. He only knows Jimin’s come, too, from the way his body pulses around Jeongguk’s cock, hips fucking into Jimin in little jerks, cock milked dry.\n \nThey’re panting, Jimin’s scent so thick, Jeongguk can taste it on his tongue. He places a kiss behind Jimin’s ear, shifting back up.\n \n“You didn’t knot me,” Jimin says, finally, sounds like he’s pouting and Jeongguk, in his daze, only just clues in.\n \n“Yeah,” he replies, pulling out of Jimin and it’s kind of weird, not being locked into place inside of him, held together for hours. Collapsing next to him, Jeongguk pulls him flush against him, kissing Jimin anywhere he can, and he doesn’t think he’s normally this clingy but right now, he just wants Jimin’s body against his, skin against skin.\n \n“How come?” Jimin asks, cuddling into Jeongguk’s embrace, fucked boneless.\n \n“Dunno, it just didn’t happen,” Jeongguk answers, carding his hand through Jimin’s hair. He doesn’t have to see Jimin’s face to know he’s probably frowning.\n \n“You okay?” Jimin mumbles, the drowsiness of sleep sticking to his voice. Jeongguk kisses his forehead, pushes sweat soaked hair back.\n \n“’Course hyung.”\n \nExcept he knows what this means, but it’s too early, he still has a few months and that thought has him dismissing the idea completely. Jimin groans, forcing himself up and Jeongguk’s really done a number on his neck, a swell of possessiveness bubbling under his chest.\n \n“I need a shower,” he mumbles, leaning down to kiss Jeongguk before climbing over him toward their bathroom. Jeongguk uses the opportunity to admire Jimin’s back and ass, both covered with dark marks, the contrast beautiful against Jimin’s skin. There’s a particularly big one on his ass, the sight making his cock twitch in interest.\n \nJimin walks into the bathroom and Jeongguk counts down to three, two, one.\n \n“Were you fucking trying to eat me?”\n \nHe laughs.\n \n \n \n \n \nJeongguk knows he’s being difficult, pressed up against Jimin’s back as they make their way down the aisle, but he can’t seem to stop himself, hands seeking to touch, body yearning for Jimin’s. There’s this itch under his skin, the air conditioned store suddenly too warm.\n \n“How, exactly, do you expect me to do the grocery shopping with you clinging to me like a koala bear?” Jimin huffs, irritated. He pushes back against Jeongguk, glares when Jeongguk doesn’t even budge, and Jeongguk doesn’t blame him, knows Jimin probably thinks he’s just trying to tease him. He’s not, mind hazy, narrowing in on just Jimin’s scent and how small and compact he feels flush against Jeongguk.\n \nJeongguk noses along the back of Jimin’s neck, breath puffing against his skin and Jimin shivers despite himself, scowl something ferocious as he spins around in Jeongguk’s hold. “We’re at a grocery store!”\n \n“I know,” Jeongguk grins lazily, peeling himself away from Jimin, just a little afraid of the way Jimin’s eyes narrow at him. He knows better than to piss off his mate. Or well, he should. Park Jimin’s wrath isn’t very merciful. His mouth isn’t quite on his side though, “It’s not like I’m the only alpha who can’t keep his hands to himself.”\n \nJeongguk takes Jimin’s chin, turning him toward the couple at the very end of the aisle by the wall of dairy products. The couple is handsy, can’t seem to stop giggling as they sneak in kisses and Jeongguk can’t help but grin as he watches Jimin turn pink.\n \n“What, hyung,” Jeongguk says, very purposefully, knows how much Jimin likes it when he actually calls him hyung, “Cat got your tongue?”\n \nWhen Jimin looks back at him, his eyes are kind of glazed over, and it’s not until Jeongguk lets go of his chin that Jimin snaps out of it. “You’re burning up.”\n \n“What?” Jeongguk blinks.\n \n“You’re running a fever, Jeongguk,” Jimin repeats, hand coming to touch Jeongguk’s forehead, Jimin worrying his lips into a pout, brows knit together. “We ― we should go home.”\n \n“But what about the ― “ Jeongguk doesn’t get to finish the sentence, Jimin grabbing his hand and heading straight for the store’s exit, cart abandoned. He has his phone pressed to his ear in the other hand, and Jeongguk can smell the spike of worry. \"Hey, Hobi-hyung, do you think you can swing by my place with some supplies. I think Jeongguk’s ― his rut is early.\"\n \nHearing Jimin say it out loud clicks everything in place: the neediness, how he can’t keep his hands off of Jimin lately, how he never feels satisfied after fucking Jimin just once, wants to keep going and going and going.\n \n“Thanks hyung,” Jimin smiles into the phone, slipping it back into his pocket. They exit the store, muggy summer weather hitting them instantly like a brick wall, and Jeongguk feels like his body’s on fire. Jimin’s not close enough, his hand tightening around Jimin’s, the reaction instant as he pulls him in even closer. His body sighs in relief when he has Jimin bodily against him, can inhale deep lungfuls of his scent.\n \n“I’m right here,” Jimin assures him, hands smoothing down Jeongguk’s side, quick kisses pressed to Jeongguk’s jaw in comfort and he feels dazed, like there’s a haze settling over all his thoughts. Even still, he knows his rut’s early, three months early to be exact, and they’d both saved time off from work to make sure they’d be ready for it. Jimin’ll be lucky if he can stay conscious for more than a few hours once Jeongguk’s rut ends, let alone get up and make it to his job.\n \nThe worry doesn’t stick though, not like he knows it should. He can’t seem to settle his thoughts on anything except the building urgency, the need for him to bend Jimin over the first available surface and fuck him full of cum.\n \n“Home, we ― we gotta get home,” Jeongguk manages, willing himself to back away from Jimin. They won’t make it far if he keeps touching him, the distance will do them some good and it takes physical effort for Jeongguk to let go of Jimin’s hand. For the first time, he can smell the arousal in his own scent, smothering him in his need and Jimin looks anxious, pupils already blown wide. Jeongguk’s not sure he’ll be able to keep his hands to himself if he manages to get a whiff of Jimin’s slick, the scent of his arousal especially potent.\n \n“Right,” Jimin nods, blinking himself out of his own rut induced stupor and then he’s leading them back to the subway, feet light and quick as he winds them down the street. The humid weather seems to mask Jeongguk’s steadily increasing lust, but he catches the half-dazed expressions on some of the betas and omegas he walks past, worry beginning to gnaw at his insides, renewed.\n \nSomehow they make it into a train, Saturday afternoon rush crammed in there with them, and Jeongguk curses under his breath, unable to keep his hands from pulling Jimin in closer. They shuffle into a corner, Jeongguk pressed against the closed doors, Jimin tucked into him, body pushed against his as more people pile in. Like this, Jeongguk can’t focus on anything but Jimin’s cloying scent, or the soft press of his body, how he fits right against Jeongguk’s hips, ass plush.\n \nWithout meaning to, he rolls his hips up, cock hardening rapidly and Jimin has to clasp a hand over his mouth to stop the small yelp of surprise that escapes him. Jeongguk winds his arm around Jimin, holding him in place tighter and Jimin worms closer, head falling back to rest against Jeongguk’s shoulder.\n \nIt reminds Jeongguk of one of Jimin’s first heats, when they’d been coming home from a day spent holed up in the library and Jimin’s heat had hit him in the middle of an empty subway car. He’d rubbed Jimin off right there, lap full of whining, needy omega, Jeongguk’s palm working him to release right over the fabric of his jeans.\n \nThis time, they don’t have the luxury of an empty train car, bodies packed together tight in the afternoon rush. Jeongguk bites down on the juncture of Jimin’s revealed neck, Jimin’s fingers lacing between his own over the hand he has spread flat against Jimin’s stomach. His other hand squeezes Jimin’s ass, the scent of his arousal mixing in with the crowd’s combined scent but Jeongguk could pick it out anywhere. He feels drunk on it, the sweetness spreading out over his tongue and as the train jostles forward, the force of it pushes Jimin into him harder.\n \nHis hands travel to Jimin’s hips, squeezing, unable to keep himself from rocking against Jimin’s ass. The haze burns through him stronger as he gives in, world narrowing down to just Jimin, just his scent, his body, the width of his hips. Just the idea that anyone could see Jimin right now unfurls something nasty in his chest, like they could possibly deserve him when every inch of Jimin belonged to Jeongguk.\n \n“J-Jeongguk,” Jimin whines, trying desperately to get Jeongguk’s hands to loosen up on his hips. “We’re on the t-train.”\n \nJeongguk’s rut addled brain barely registers Jimin’s words, hips grinding against Jimin’s ass. He nuzzles his nose against the back of Jimin’s neck, cock hard as it rubs insistently against his ass, teeth nipping at Jimin’s skin. The train is crowded, which works to both their benefit and detriment and Jeongguk just can’t seem to ―\n \n“Mine,” he growls, hands digging into Jimin’s hips so hard, Jimin whimpers, body curling in toward Jeongguk.\n \n“Yours,” Jimin agrees, biting back a moan as Jeongguk nearly lifts him right off his feet in an attempt to pull him in even closer, hips never stopping as they grind into him. Jeongguk’s teeth snag on one of Jimin’s piercing, tugging, and he wants to slip his hand down Jimin’s jeans, jerk him off, rough and quick, his come coating Jeongguk’s hand. “Yours, Jeonggukkie, just yours, but ― ah ― ”\n \nJeongguk’s hand slips up Jimin’s shirt, Jimin’s stomach soft under the palm of his hand, fingers dipping ever so slightly past the band of his underwear. Jimin grabs his hand and Jeongguk growls, teeth nearly snapping but the subway’s come to a stop, their bodies lurching forward. Jeongguk curls himself over Jimin’s smaller frame. \"Come on, hyung,” he whispers into Jimin’s ear, sucking on the lobe, “Lemme fuck you right here, lemme show everyone you’re mine, you’d like that, hyung, I know you would.”\n \nJeongguk follows the request by palming Jimin through his jeans, his cock just as hard as Jeongguk’s own, listening to Jimin’s quiet shudder, how he trembles in Jeongguk’s hold. Jimin’s got a hand pressed to his mouth, quickly turning around when the car frees up a little, face immediately burying into Jeongguk’s chest.\n \n“Jeongguk, please, we’re almost home, you can do this,” Jimin assures, begs, and he knows it’s just one more stop, but in the press of the crowded train, Jeongguk can’t focus on anything except Jimin. How much he wants to make Jimin his, how much he wants to be inside Jimin, fucking him open and he doesn’t really care if anyone sees. He’d never let them lay a finger on Jimin.\n \nNew people pile into the car, Jeongguk’s hand twisting into Jimin’s hair, mouth finding mouth as he kisses Jimin hungrily, nearly groaning at how his body sings. It’s automatic from there, how Jeongguk works his thigh between Jimin’s, grinding it up against Jimin’s cock, the little cut off moans from Jimin going straight to his own cock. He licks into Jimin’s ready mouth, breaking away only when the need to undo Jimin’s jeans frustrates him, fingers fumbling. The subway jostles them again, Jimin shoving Jeongguk’s hands away, the glazed look in his eyes mirroring Jeongguk’s.\n \n“Ju ― July 14th,” Jimin breathes, the doors opening next to them but everything short circuits in Jeongguk’s mind, coming to a halt. As people leave the car, Jimin pulls himself out of Jeongguk’s hold, leaving with the swell of the crowd and Jeongguk follows helplessly, finds himself standing on the platform, eyes and nose seeking Jimin.\n \nWhen he spots him, Jeongguk moves forward so quickly he doesn’t even notice his surroundings, nearly bumping into three different people. There’s an apology ready on his lips, haze clearing out as worry seeps in. Jimin had to use their safeword.\n \nJimin had to use their safeword and Jeongguk’s near panicked when he finally makes it to Jimin, careful to keep his distance, a shaking hand reaching out tentatively. Jimin takes it almost immediately, guiding them to the exit and Jeongguk drags behind him, eyes wide. Their apartment is five minutes away, the walk somehow too long and too short at the same time.\n \nJimin heads straight for the elevator and Jeongguk pulls his hand away, palms rubbing at his eyes, the burning feeling still simmering under his skin. He couldn’t hurt Jimin, that was unacceptable. Not his Jimin, his ―\n \n“Hey, hey, Jeonggukkie, it’s okay, I’m fine,” Jimin says, his hands tugging Jeongguk’s away. His lungs feel too small, air coming in short gasps and Jimin’s so beautiful, so kind, Jeongguk can’t hurt him, he needs to ―\n \n“Breathe, baby, I’m fine, I’m right here. You didn’t do anything wrong,” Jimin assures, voice soft and sweet, cupping Jeongguk’s face, his touch soothing the heat boiling through Jeongguk. “I had to get you off the subway and you stopped right away, just like you promised you would.”\n \nJimin crowds into his space, and Jeongguk doesn’t expect the kiss, blinks back the sting of tears as Jimin’s touch turns from tentative and reassuring to something harder, insistent. The heat licks under his skin, fingers clutching at Jimin’s shirt, tugging him in even closer. “I’m sorry,” he hears himself say, so desperate, voice thick with helplessness, “I’m so sorry, Jimin. I don’t wanna ― ”\n \n“Shh,” Jimin comforts, still on his tiptoes to reach Jeongguk’s mouth, face nuzzling into the crook of Jeongguk’s neck, small kisses pressed against his mark. “I’m okay, you didn’t hurt me, you’d never hurt me.” Jimin’s smile is so sure. “Come on, let’s go home.”\n \nJimin pulls back after giving Jeongguk another kiss, tugging him toward the elevators. Jeongguk follows, swallowing down guilt, head swimming with want even now. He tries to keep his distance, but Jimin pulls both his arms around his waist, leaning back against Jeongguk’s chest as they wait for the elevator. Jeongguk can’t help it, face burying into the crook of Jimin’s neck, his scent like a wave of relief. He feels like a lost boy who’s found home.\n \nThe elevator doors ding open, and Jimin waits as a family walks out. Jeongguk can smell them, but doesn’t care to look, his mind refusing to focus on anything except Jimin Jimin Jimin. The thought is followed by a resurgence of desire, Jeongguk’s grip around Jimin’s waist tightening. Somehow Jimin maneuvers them into the elevator, twisting around in Jeongguk’s hold once they’re inside to hit the button to their floor, head resting on Jeongguk’s chest. He kisses Jeongguk’s mark, hand cupping Jeongguk’s neck, sliding down Jeongguk’s chest. He can’t help rolling his hips up, rutting against Jimin’s thigh.\n \n“Hyung,” he breathes, head tilting back to give Jimin an easier angle, mouth sucking against the skin of Jeongguk’s neck. Jimin’s distracted, grinding against Jeongguk, hips stuttering as Jeongguk palms at Jimin’s ass, unhurried for the first time. And it’s not that he doesn’t want to pin Jimin against the elevator wall and fuck him into oblivion but that he has to be sure. His ruts weren’t easy on Jimin. “Hyung, are you sure?”\n \nJimin snorts, pulling back just enough, eyes half lidded and Jeongguk can see the desire there but it’s not enough to just see it. “I’m not going to break, Jeongguk.”\n \nJeongguk’s eyes close, the words sinking in and it’s like a fire’s been lit under his skin, growl ripping out of him as he hitches Jimin up, hands on his ass. Jimin’s legs lock behind him, mouth finding Jeongguk’s and it’s less a kiss, more teeth and desperation and every cell in Jeongguk’s body begging for Jimin.\n \nThe elevator doors slide open, Jeongguk carrying Jimin out easily, tongue licking into Jimin’s mouth, swallowing moans with every step. Somehow Jeongguk manages to get their front door open, and all his control slips right out of his hands as he slams Jimin against the nearest wall, door swinging shut behind them.\n \nJimin groans, Jeongguk’s mind hazy, the swell of possessiveness rising with every breath. “Mine, mine, mine,” he chants, teeth sinking into Jimin’s mark, laving at the bite he leaves behind, and it’s like he can’t get close enough to Jimin, isn’t satisfied with having every inch of him pressed against him. Jeongguk lets Jimin go, pulls back just enough to see the dazed expression on Jimin’s face before he’s spinning Jimin around, pinning him to the wall. He nearly rips off Jimin’s jeans, hears a button clatter to the ground and Jimin whines, arching into Jeongguk’s touch.\n \n“Those were my favourites, you ass,” he pants and Jeongguk noses behind his ear, shoving the jeans down along with Jimin’s underwear, and they snag mid thigh but Jeongguk doesn’t really care. Jimin’s slick fills the hallway, dizzyingly sweet and Jeongguk groans, can’t help but spread Jimin’s ass apart to watch the slick drip down his thighs. His cock twitches.\n \n“I’ll buy you another pair,” Jeongguk grunts back, hissing when he gets his own cock freed from his jeans, lining it up with Jimin’s dripping wet hole. “However many you want,” he adds, slamming into Jimin all the way, tight heat enveloping his cock. Jimin chokes on his retort, falling back against Jeongguk’s chest as he breathes in deep and heavy.\n \n“Fuck, Jeongguk,” he heaves bodily, like Jeongguk’s stolen the breath right out of him. Jeongguk’s teeth scrape against Jimin’s earlobe, sweat slipping down his back and he wants to move, wants to fuck Jimin so hard he can’t stand up and then fuck him again.\n \n“Feels so good, hyung, so tight, your pussy’s always so tight,” Jeongguk groans, hips canting upwards and Jimin whines, Jeongguk’s thrust pushing him up against the wall. “So fucking wet for me, too. You got such a greedy lil cunt, hyung, always wanna be filled up, right? Don't worry, I’m gonna fill it up with cum, hyung, just like you want. Fuck you pretty with my cum.”\n \n“J-Jeongguk,” Jimin cries, face flush against the wall and Jeongguk’s set a brutal pace, Jimin’s moans vibrating through him and it’s not enough, even like this. Jimin’s jeans have his legs trapped in place, his hole so tight, Jeongguk can barely squeeze his cock back out of him. Not that he wants to. Just wants to fuck him and fuck him and fuck him. The need is insatiable and so is Jeongguk’s cock.\n \n“Hyung, hyung you feel so good ―  So tight, so good for me, taking me in so good,” Jeongguk praises, relishing the whimpers that fall out of Jimin’s mouth, set to the rhythm of his thrusts. His hands squeeze harder on Jimin’s hips, pushes Jimin up against the wall harder, fucks him as hard and fast as he can. “You like that, right, hyung? Tell me.”\n \nJimin whines, head falling back against Jeongguk’s shoulder, practically bouncing on Jeongguk’s cock. “Yes, yes, Jeongguk, want your cum, p-please ― ah ― ”\n \n“’Course you do,” Jeongguk smirks, Jimin’s sobs mixing in the squelch of Jeongguk’s cock sliding in and out of him. “Just like a good lil slut.”\n \nJimin grabs a handful of his hair at that comment and something electric shoots down his spine, hips fucking into Jimin quicker, stomach clenching up as he orgasms, completely unsatisfied. There’s a pulse of pleasure, ebbing through him far too slowly and then gone completely, cock still hard inside of Jimin. He slumps forward and Jeongguk knows he hasn’t come, didn’t feel him clench up on his release.\n \nJeongguk lets Jimin catch his breath, collapsed against the wall as he pulls out, watches cum and slick pool out of Jimin. He catches some of it on two fingers, thrusts it back into Jimin’s hole, loves the way Jimin whines, his scent overpowering. Jeongguk’s always love the taste of Jimin’s slick, loves how Jimin always tastes like he’s ready to be fucked and bred, fucked and bred.\n \nWorking off Jimin’s t-shirt, he sinks to his knees without thought, shoving down Jimin’s jeans in the process and to Jimin’s credit, he steps out of them, slipping off his shoes. The bruises Jeongguk left on Jimin’s ass a week ago are faded yellow, to his annoyance, teeth sinking into Jimin’s ass to revive them.\n \n“Fuck,” Jimin gasps, Jeongguk sucking the bite to a bright red, fingers fucking Jimin open, purposefully rubbing at his prostate. His legs are shaking, and Jeongguk thinks nothing of it, slips his fingers out of Jimin’s ass to flip him around. Jimin’s cock meets Jeongguk’s eyes, hard and red and drooling precum. Jeongguk licks a fat stripe along the underside, suckling on the head as he pushes one of Jimin’s thighs up, lifting Jimin’s leg off the ground and secures it over his shoulder. He sinks down on the rest of Jimin’s length, Jimin’s cock smaller and shorter than his own, pushing Jimin’s other leg up and over his shoulder too. Like this, Jimin’s forced to sit on Jeongguk’s shoulders, feet dangling somewhere past Jeongguk’s back, back pressed up against the wall. His thighs squeeze around Jeongguk’s head.\n \n“Jeongguk,” Jimin whines, hands twisting into Jeongguk’s hair as he swallows around the head of Jimin’s cock, eyes finding Jimin’s. “Jeongguk, p-please.”\n \nJeongguk wants to ask what Jimin’s begging for but he wants Jimin to come, at least once before the rut’s fervor completely takes over Jeongguk’s senses and he can’t think beyond filling Jimin up with so much cum that it just pools out of him sloppily. The thought has Jeongguk pulling off of Jimin’s cock entirely, kissing down the length as Jimin whines, his hands on Jimin’s plush ass. Jeongguk sits back on his haunches, taking Jimin farther away from the wall, his shoulders just barely touching it, mouthing at Jimin’s balls.\n \n“Want,” Jeongguk breathes, “want me to eat your cute lil pussy out, hyung? It’s so wet for me, fucked full of my cum.”\n \n“Jeongguk,” Jimin pants, keening, the hands in Jeongguk’s hair tightening. “E-eat me out, make me come, please, Jeonggukkie, wanna come ― ah.”\n \n“Anything for you,” Jeongguk murmurs, tongue licking at Jimin’s entrance, tasting cum and slick and he groans, relishing the taste, mouth watering. Jimin’s hole stretches around his tongue easily as he pushes in, his airy mewls like music to Jeongguk’s ears. Jeongguk swallows down cum and slick as it pools out of his hole, Jimin grinding his ass down on Jeongguk’s face, begging to be fucked harder, thighs squeezing around Jeongguk’s head. Jeongguk fucks his tongue in and out, pulling Jimin even farther from the wall, one of Jeongguk’s hands on Jimin’s lower back holding him upright.\n \nHe manages to work a thumb into Jimin’s entrance, pushing it in down to the knuckle, allowing him to push his tongue in deeper. Jimin’s sobbing above him, a hand against the wall behind him, keeping him from falling down entirely, and Jeongguk feels his ass clench up, body shaking as Jimin comes, tightening around Jeongguk’s tongue.\n \nJeongguk pulls back, knows there’s cum in his hair but doesn’t care, nosing along the length of Jimin’s cock before taking the head into his mouth, the last few spurts landing on his tongue. Jimin’s gone completely lax, held up only by Jeongguk’s hands on his waist, whining as Jeongguk continues to suck on his softening cock.\n \n“You taste so good, hyung,” Jeongguk murmurs, letting Jimin down gently. When he’s got Jimin in his lap, Jeongguk kisses him softly, his own cock still hard and begging for round two. The haze hasn’t consumed him entirely yet, Jimin's soft whines enough of a reminder to wait. He’s thankful just kissing Jimin, his arms wrapped around Jeongguk’s neck weakly.\n \n“Aren’t you gonna fuck me again?” Jimin asks, tongue licking into Jeongguk’s mouth, and as if to make a point he grinds his hips against Jeongguk’s cock.\n \nJeongguk hisses, nails digging into Jimin’s hips, head falling forward onto his shoulder. “You have to stop that.”\n \n“Stop what?” Jimin whispers, voice raspy from overuse. “Aren’t you gonna fuck me full of cum, Jeongguk? My pussy’s waiting.”\n \n“Shit,” Jeongguk growls, teeth snapping over Jimin’s neck and he just bares it, head falling back willing to let Jeongguk sink his teeth into his throat. “Always ready for cock, aren’t you, hyung?”\n \n“Only yours,” Jimin answers, adam’s apple bobbing as he swallows and Jeongguk doesn’t have the patience, lifts Jimin up easily only to have him sink down on his cock. Jimin’s breath catches in his throat, hole swallowing up Jeongguk’s cock like it was made for it. Jimin’s as tight as ever, the slide in easier now that Jimin can spread his legs but the heat makes Jeongguk’s head swim all the same. Jeongguk still hasn’t managed to take off his clothes but first, he wants them on their bed.\n \n“Only mine,” Jeongguk echoes, the dark bruises blooming along Jimin’s neck mesmerizing. “Only my cock could satisfy your greedy lil pussy, right, hyung? Fucking slutty cunt, gonna fuck it loose and sloppy.”\n \nJimin only mewls, cheeks flushing pink as his mouth finds Jeongguk’s. “Please Jeonggukkie.”\n \n“Bed,” Jeongguk tells him, hefting Jimin up easily. He gets Jimin up against the wall before tugging off his t-shirt and leaving it in the pile of clothes they’ve started by their front door. Jimin’s nails rake down his chest, legs locked around Jeongguk’s waist. The rut has him fucking into Jimin again, Jimin whining as he’s bounced on Jeongguk’s cock, little whines slipping past his lips. Jeongguk rolls his hips in slow, listening to Jimin’s needy moans, face buried in Jeongguk’s neck. He peels Jimin away from the wall, carrying him to their bedroom, still stuffed full of Jeongguk’s cock.\n \nTheir bed’s neatly made, Jeongguk’s doing, but as Jeongguk pulls out of Jimin to drop him onto the mattress, he knows they’ll be throwing their sheets straight into the garbage once he’s done with Jimin. Jeongguk makes easy work of his jeans, stepping out of his Timbs, before he climbs up and on after Jimin, kisses Jimin’s thigh, sucking a hickey there before pushing his legs apart. Jimin’s hole clenches, so pretty and ready for Jeongguk’s cock. Lining himself back up, Jeongguk slides right back in, Jimin’s entrance easy and wet, watches Jimin’s kiss swollen mouth fall open, eyes squeezing shut. He’s so pretty when he gets fucked, so eager.\n \nSweat drips down Jeongguk’s back, hips rolling forward into Jimin, and the pace has to be fast, has to be brutal, nothing else feels satisfying enough. The need burns under his skin, Jimin’s tight heat sucking in his cock, ready for him. He wants to defile him, fuck him full of so much cum, his belly swells with it. He’s done it before.\n \n\"Hyung,\" Jeongguk starts, bending Jimin nearly in half as he leans forward, licks at Jimin's pierced nipple. He tugs on the metal bar with his teeth, Jimin's back arching as he cries out. Jeongguk knows how sensitive Jimin's nipples are, all the more so after he got them pierced and he waited nearly a year to get his mouth on them. “You’ve got such pretty tits, hyung. Gonna let me come all over them later, aren’t you? You’d love that, wouldn't you?”\n \n“F-fuck, yeah ― ah, anything you want,” Jimin rasps, voice high pitched as he sobs out Jeongguk’s name when Jeongguk sucks on his nipple, fucking into Jimin shallowly. He can’t help it, sucking bruises on Jimin’s chest, teeth digging into skin until it leaves marks. Jimin writhes under him, panting and the way his body shudders under Jeongguk has him fucking into him harder.\n \n“I just want to fuck you, hyung, over and over and over again,” Jeongguk tells him, licks at the sweat cooling along Jimin’s collarbones. “Fuck you full of cum, just like you deserve.”\n \n“Shit,” Jimin hisses, hands holding his legs up and spread for Jeongguk as he slams into him, relentless. It’s easier like this, Jeongguk has better access and it only fuels the heat, the delirious want running through his veins. Jimin Jimin Jimin it chants at him, Jeongguk’s mind completely blank of everything else. There’s just the sound of him fucking into Jimin, obscene squelch mixing in with Jimin’s breathy moans. He sounds pretty, so pretty.\n \nSweat drips down Jeongguk’s face, lands in drops against Jimin’s chest, and Jeongguk can’t wait to cover every inch of Jimin with bites, with his cum, mark him as Jeongguk’s.\n \n“Mine,” he growls, hand fisting into Jimin’s hair, teeth sinking into Jimin’s shoulder. His hips buck forward, slamming into Jimin hard enough to shake the bed and Jimin gasps out his name, hands frantic as they each for Jeongguk’s shoulders, arms slipping around his neck.\n \n“Yours,” Jimin echoes, chest heaving, “yours yours yours, please Jeongguk.”\n \nJeongguk sucks in a deep breath, Jimin’s scent drowning out his senses, the rut claiming him as he fucks into Jimin, relishing the way Jimin whimpers into his ear. It’s with a single minded determination that he pounds into him, body throbbing with need, with want. He gets Jimin’s arms off of him, pushing them down against the bed, a hand pinning down each wrist. Jimin whines, body arching up into Jeongguk as he kisses him, nips at Jimin’s eager mouth.\n \n“Please,” Jimin gasps, “please Jeonggukkie, wanna ― ah ― ”\n \nJeongguk grunts, licks at the bite he's left on Jimin’s shoulder, sucking the blood to the surface.  Taking Jimin’s legs, Jeongguk pushes them upwards, knees against his chest and Jimin whines, gasping as Jeongguk leverages himself against the angle. Jimin’s bent in half, hands fisted in the bed sheets and Jeongguk is relentless, wants to make Jimin come untouched, wants to fuck him through his orgasm right into the next one. Jimin sobs, and it sounds something like Jeongguk’s name, desperation clinging to the way his body shakes, ass clenching around Jeongguk’s cock, tighter.\n \n“I’m ― I’m coming,” Jimin pants, and Jeongguk lets go of his legs, spreads them apart to watch cum splatter across Jimin's abdomen, cock twitching as cum drools out. Jimin shudders bodily, eyes half lidded as he lies boneless against the mattress. Jeongguk just scoops him upward, sinking Jimin down onto his cock.\n \nJimin lets out a pathetic whine, head lolling forward, resting against Jeongguk’s shoulder. Jeongguk doesn’t stop, sits back against his haunches and pounds into Jimin’s fucked out body, so close.\n \n“One more, hyung,” Jeongguk tells him, despite Jimin’s cries, his hisses of overstimulation. Jeongguk knows the angle has his cock rubbing right against Jimin’s prostate, likes how it forces Jimin to bounce on his cock, pliant and yielding.\n \n“Jeongguk, please,” Jimin sobs, clinging to Jeongguk's shoulders. “Please, please want your cum.”\n \n“It’s all yours,” Jeongguk groans, feels himself spill into Jimin’s tight heat, hips stuttering as he fucks it into Jimin’s hole. He’s still hard and there isn’t a cell in his body that's too tired to fuck Jimin again so he does.\n \nJimin only whines.\n \n \n \n \n \nBy the time Jeongguk notices that their room’s gotten dimmer, he’s fucked three more orgasms out of Jimin, two of them dry. There’s cum coating Jimin’s back, from when Jeongguk had pulled out, Jimin’s whimpering too much to bear. His mate is teetering on the edge of unconsciousness, Jeongguk’s cum slipping down his thighs, too much to plug inside of Jimin’s hole. He’s got Jimin on his side, enough slick and cum between his thighs that Jeongguk can easily slide his cock through the mess, Jimin’s thighs squeezing together.\n \nJeongguk nips at Jimin’s ear, hips thrusting between his thighs, hand holding his thigh down, grip firm. Jimin’s letting out these soft groans, Jeongguk’s cock rubbing against his balls on every thrust inwards. He sounds so pretty, Jeongguk’s teeth sinking into his shoulder.\n \n“Jeongguk,” Jimin whines, a hand twisting into Jeongguk’s hair. It’s the first coherent thing he’s said since Jeongguk fucked him on all fours, hand fisted in his hair as he’d pounded into him.\n \n“Yeah, hyung?” Jeongguk breathes, kisses along the curve of Jimin’s shoulder, nose nuzzling right behind Jimin’s ear. “You still with me?”\n \n“Y-yeah,” Jimin gasps, voice hoarse. It’s sore from overuse, Jeongguk knows; he’d had Jimin screaming in their last round, lucid enough to hold Jimin upright, as he’d fucked up into him, relentless. Jimin can barely keep his eyes open now, let alone hold himself up, his thighs had been shaking when Jeongguk had had him riding his cock.\n \n“You good?” Jeongguk murmurs, tastes the sweat on Jimin’s skin, imagines Jimin covered in his cum, reeking of Jeongguk.\n \n“Good,” Jimin replies, little gasps escaping him as Jeongguk continues to fuck his thighs, obscene squelch filling the room.  His cock’s soft between his legs, but Jeongguk can’t help but wrap his hand around it, Jimin’s breath catching, painful whine escaping him as Jeongguk rubs the head.\n \n“If you need me to stop, what do you say, Jimin?”\n \nJimin's body jerks in Jeongguk’s hold, hand tightening in his hair. “July 14th.”\n \n“Good boy,” Jeongguk praises, the rut’s heat at bay for the time being. Jimin’s never used their safeword in any of his heats or in Jeongguk’s previous ruts but Jeongguk knows nothing else would really snap him out of it. He’d proven as much earlier, and the thought squeezes at his heart, his hold on Jimin’s thigh tightening. It helped that Jeongguk knew Jimin liked the overstimulation, liked being able to say no but not have Jeongguk stop. The knowledge has him relaxing again, the heat in his belly coiling tighter, right on the edge of release, desperate for some respite.\n \nIt doesn’t come, Jeongguk’s cum spilling out, right between Jimin’s thighs. Jimin groans, hand loosening in Jeongguk’s hold. Jeongguk pants, frustration welling up as he finds his cock still painfully erect. If he fucks Jimin again, he knows he won’t last through it.\n \n“K-keep going,” Jimin breathes, as if he can read Jeongguk’s mind and it’s all he needs, cock burying into Jimin’s heat in one quick push. Jimin cries through it, pushing back into Jeongguk as he thrusts into Jimin in earnest, hand still rubbing the head of Jimin’s cock. Jeongguk likes the desperate whines Jimin gives him, likes how he gives himself up so easily. All for Jeongguk.\n \n“So good for me,” Jeongguk tells him, lifts up Jimin’s legs to open him up, pull Jimin down onto his cock faster. Jimin gasps with every thrust in, Jeongguk fucking into him harder, balls slapping against Jimin’s ass, Jimin’s cock hardening in Jeongguk’s hold. The way Jimin sobs, body trembling in Jeongguk’s hands, gives away his arousal, slowly building as Jeongguk’s cock drags along his prostate. “You gonna come for me, hyung?”\n \n“G-gonna,” Jimin rasps, fingers digging into Jeongguk’a forearm as his thumb slides over Jimin’s slit, attention focused solely on the sensitive tip. “Wanna ― ah ― c-come for ― ”\n \n“You're such a good boy,” Jeongguk grunts, relishing Jimin’s tight heat, slick dripping down Jeongguk’s cock, wet and messy. “So, so good, hyung.”\n \nJimin keens at the praise, and Jeongguk rolls them over, gets Jimin onto his belly. He slips out of Jimin momentarily, stares at Jimin’s hole, fucked open, rim swollen and puffy, groaning at the sight. He can’t help it, pulls Jimin up onto his knees, mouth eagerly lapping at the cum and slick pooling out of his ass. Before he pulls away, tongue fucking into Jimin just to hear him sob, Jeongguk bites into Jimin's ass, growling. He pushes right back into Jimin seconds later, thumb rubbing over the indentations he’s left on Jimin's cheek, satisfaction wrapping around his heart. From there, it’s easy, fucking into Jimin, holding him up as his legs shake. Jeongguk wraps his hand around Jimin’s cock again, lets Jimin fuck into it, hips jerking forward every time Jeongguk thrusts into him.\n \n“Can’t ― Jeon ― Jeongguk, p-please,” Jimin cries, and Jeongguk only slams into him harder, wants Jimin to come while he’s inside him. Fisting Jimin’s cock, Jeongguk angles himself to hit Jimin’s sweet spot better, feels the way Jimin’s body tightens up, ass clenching as he comes, so so tight around Jeongguk, his own orgasm spilling out of him. Cum oozes past Jeongguk’s cock, drips down Jimin’s thighs, pooling onto their bed, and Jimin’s still shaking, gasping out Jeongguk’s name.\n \nJeongguk’s chest heaves, fingers rubbing against Jimin’s entrance. Leaning down, Jeongguk lets his head rest against Jimin’s back, his knees giving out under him. Jeongguk kisses along Jimin’s spine sweetly, cock barely softening before the rut has him hard and ready to go.\n \nIt doesn’t take long before his mind’s clouding up again, the urge to fuck Jimin, claim him as his own, own him, over-riding his exhaustion. He pushes a finger in alongside his cock, rubbing it insistently against Jimin’s walls, listens to Jimin’s cry before he pulls it out.\n \n“You take everything so good, Jimin. Your cunt’s so slutty,” he says, pulling out of Jimin before he can scoop him up, get him in his lap. Jimin’s head falls back against his shoulder, eyes shut, mouth parted. Jeongguk trails a hand down his chest, avoiding Jimin’s cock as he lets his fingers find his hole.\n\n“Please,” Jimin whispers hoarsely, winces when Jeongguk pushes three fingers into him, and it’s not until Jeongguk pushes his cock in, too that Jimin passes out entirely.\n \n \n \n \n \n“J-Jeongguk,” Jimin whines pitifully, pressed into the mattress. Jeongguk’s paused long enough to catch his breath, head resting against Jimin’s shoulder, his scent keeping Jeongguk steady. He reeks of Jeongguk now, the thought curling possessively around him.\n \n“Yeah?” Jeongguk mumbles, winces when Jimin’s ass clenches around his cock, already hardening inside of Jimin.\n \n“Hurts,” Jimin manages, and Jeongguk knows what he means, needs to get off of him, needs to pull out. Willing himself to move, he slides out of Jimin slowly, cum pooling out of him and he knows from Jimin’s pained groans that his ass is too raw for another go. He rolls Jimin over, hands running up Jimin's small frame, straddling him. Jimin’s mouth is swollen, lips puffy and pink and Jeongguk leans down to suck Jimin’s bottom lip into his mouth, listening to his whine.  It’s less a kiss and more of Jeongguk licking into Jimin’s mouth, sucking on Jimin's tongue.\n \nShuffling up, Jeongguk lines his cock up with Jimin’s mouth, dragging the head over Jimin’s lips before pushing inside. Jimin takes him beautifully, jaw slack, can barely keep his eyes open. Jeongguk’s hand fists into his hair, pace slow as he fucks into Jimin’s mouth, focusing hard toward keeping himself from losing control. Even still, Jeongguk fucks into Jimin’s mouth until his cock hits the back of Jimin’s throat, groaning every time the tight heat squeezes around his head, almost painful.\n \nJimin moans around him, his hands coming to rest on Jeongguk’s thighs and Jeongguk’s hold in his hair tightens appreciatively. “Such a good boy, you’re so good for me hyung. The best.”\n \nWith every concession Jimin yields, nails digging into Jeongguk’s thighs, throat swallowing around Jeongguk’s cock, Jeongguk fucks his mouth harder. Jimin lets him fuck his mouth as if he were a toy, to be used and abused, filled up, and Jeongguk gasps at the sight of it, Jimin’s plush mouth stretched over his girth, spit dribbling down his chin. He looks so pretty, always so pretty, and Jeongguk imagines he’ll look even prettier when Jeongguk’s painted his face with his cum, marked him as Jeongguk’s.\n \nHe growls at the thought, feels the burn of his release running hot through his veins, and he doesn’t pull back quick enough, comes with Jimin suckling on the head of his cock, catching him off guard. Jimin can’t swallow it down fast enough, drools cum and spit, gasping for breath as Jeongguk pulls back, splatters his ready face with what’s left. Streaks land in his hair, across his cheeks, and eyes and suddenly it’s not enough, Jeongguk fisting his cock, hissing as he wills himself to come again, just to coat Jimin’s face.\n \nHis hand works furiously, Jimin licking his lips clean, swallowing down Jeongguk's spunk, willingly waiting for more, mouth still hung open. Jeongguk finds himself leaning forward, a hand bracing against the headboard as he jerks himself off. Jimin lies there, drops of cum clinging to the lashes of his left eye, streaks of white decorating his cheeks, and Jeongguk wants to lick it off, taste himself in Jimin's mouth, mind clouding as desperation has him rocking his hips forward into his fist. He shifts his weight back, wipes cum off of Jimin's face, fingers pushing into Jimin's ready mouth. Jimin sucks them clean, tongue working over Jeongguk's fingers and the way he sucks on them has Jeongguk releasing onto Jimin's face, moan caught between his teeth. Fisting a hand into Jimin's hair, Jeongguk holds his head in place, cock slapping against Jimin's cheeks, rubbing his cum into Jimin's skin. This time he gets more on Jimin's face, less in his mouth, but it's easy enough swiping it to Jimin's parted lip, his tongue licking everything in, swallowing down all of Jeongguk's cum like a good boy.\n \n\"So pretty, hyung,\" he murmurs, chest heaving as he steadies himself. Jimin moans at the compliment, eyes fluttering as they look up at him. \"Fucking gorgeous.\"\n \nJeongguk doesn't hesitate, licks his own cum off of Jimin's face, laps at it as it drips down Jimin's face, sliding down to his neck. It's thicker, not as heavy a load. He doesn't know how long it's been, just that he needs to knot Jimin soon. Neither of them were going to last a lot longer.\n \nJimin whines, efficiently capturing Jeongguk's attention, hand reaching for Jeongguk and he can't deny Jimin anything, mouth finding Jimin's, cum and spit pushed from one willing mouth to the other.\n \n \n \n \nAt some point, dazed as he is, Jeongguk realises they need to eat something. The thought of water has him swallowing down, throat dry. Jimin’s unconscious again, Jeongguk rubbing one out against his chest, leaving cum splattered across his tits, the marks he’d left earlier covered by the sticky white substance. He’s got cum everywhere, in his hair, across his face, all over his torso, dry in places and slick and wet in others. His thighs are the worst, the sight leaving Jeongguk breathless.\n \nFood, he reminds himself.\n \nStumbling out of the room, he notices that the bedroom door's been open this entire time, dazed. The semblance of lucidity he has tells him Hoseok was supposed to bring them supplies and Jeongguk finds a bag left on the kitchen counter. He beelines for the fridge, grabbing the bag along the way, dropping four water bottles into it as he heads back to the room.\n \nSomehow he doesn't collapse along the way, sticky with sweat and his own cum, shivering in the cool of the apartment. Their room is hotter in comparison, stinks of sex and cum and their combined scents.\n \nJeongguk leaves the supplies next to their bed, heading for the bathroom. He wets a washcloth, bringing it back to Jimin to clean up his face, the cool cloth bringing him some relief. Jimin stirs as he wipes away at dried cum, eyes flickering open and Jeongguk has a water bottle at the ready.\n \n“Water,” Jeongguk offers, pulling Jimin up gently. He maneuvers himself behind him, Jimin’s back flush against his chest before bringing the water bottle to Jimin’s lips, keeping it steady. Jimin drinks greedily, the washcloth settled around his neck, still wet and cool.\n \n“More?” Jeongguk asks but Jimin shakes his head, leaning against Jeongguk’s body as he rests. He feels hot to the touch, fits between Jeongguk’s legs easily, eyes fluttering shut. Jeongguk pushes his hair out of his face, listens to Jimin’s groan, eyes travelling down Jimin’s body. There are bruises everywhere, dark marks the shape of Jeongguk’s hands on Jimin’s hips. His cock twitches at the sight.\n \n“Food,” he tells himself, chugs down a bottle of water himself before grabbing the protein bars Hoseok’s left them. Jimin is less willing to eat, protesting as Jeongguk presses the bar to his lips. Jeongguk shifts Jimin to the right, tilts Jimin's head so it's at an easier angle before taking a bite of the protein bar himself, closing the distance between himself and Jimin. He feeds him the entire bar like that, small bites broken off and passed between his mouth to Jimin’s, turning to sweet, sticky kisses, Jimin’s tiny moans spurring Jeongguk on.\n \nThis time, Jeongguk moves Jimin around, has him straddling Jeongguk’s thighs as he lifts him up, lining up his cock with Jimin’s entrance. Jimin sinks down easily, arms tight around Jeongguk’s neck. He nuzzles into Jeongguk’s neck, sucks against the skin of his neck, teeth nipping at the mark Jimin’s left on Jeongguk. The swell of pride that blooms in Jeongguk’s chest is ferocious, the kiss he gives Jimin equally so.\n\nJimin rocks down slowly, and Jeongguk almost feels like they have the luxury, but the rut’s desperation burns through him quicker, has him pistoning his hips upwards. Jimin gasps, bounces on Jeongguk’s cock and for now, this is better than good.\n \n \n \n \n \nJeongguk doesn’t know how long it’s been anymore, can’t think beyond Jimin Jimin Jimin, how much he wants to fuck Jimin full of cum until he’s swelling with it, unable to move. Everything in him wants to own Jimin, wants to break him down until he belongs completely to Jeongguk.\n \n“Gonna breed you, hyung, gonna fuck you full of so much cum, it’ll be spilling outta your ass for days. Knock you up, belly full of my pups, just like a good lil bitch,” Jeongguk snarls, has Jimin’s wrists pinned to the bed with one hand. Not like Jimin’s going anywhere, his pathetic sobs hardly audible over the sound of Jeongguk’s cock slamming into him. But the thought is nice, Jimin bound to the bed, unable to go anywhere, just Jeongguk’s to fuck and fuck and fuck.\n \n“Such a good fucking pussy, swallowing me up,” Jeongguk tells Jimin, watches as his mouth hangs open, leans down to lick into it, Jimin whining. “Fuck, hyung, your belly’s gonna be so swollen, just from my cum. Gonna fuck you pregnant, hyung, and then I’m gonna fuck you again and again and again. Breed you like a good lil omega bitch, you’d like that, right hyung? Fuck your pretty lil hole full of my cum.”\n \nJimin’s responding whimper is music to his ears, hips unrelenting as they fuck into him, unable to think beyond anything except fucking Jimin into oblivion. He wants to see Jimin’s stomach inflated, wants to know what Jimin’ll look like when he really is carrying Jeongguk’s pups, bloated and big and so fucking needy.\n \n“Jeongguk,” Jimin gasps, pushing against Jeongguk’s hold on him. “Can’t ― please ― ”\n \nEven through the haze, Jeongguk’s gritting his teeth, willing himself to slow down, stop. Jimin’s been slipping in and out of consciousness and he just needs to know if he has to stop. “Safeword, Jimin, what’s the safeword?”\n \n“N-no,” Jimin says, head shaking, panting.\n \n“Jimin, hyung, you have to ― ”\n \n“Don’t wanna,” Jimin insists, and Jeongguk can’t hold himself back anymore, not when he’s this close. Almost there, hips snapping back into Jimin brutally, Jimin's body arching off the bed as he cries out. “Ah!”\n \nJeongguk’s cock snags against the rim of Jimin’s entrance, the swell of his knot finally, finally forming, and there’s sweat dripping down his face, Jimin’s whimpering suddenly louder. He fucks into Jimin deeper, groaning at how tight Jimin feels, sloppy and wet and so so so good for Jeongguk.\n \n“Fuck, hyung,” he hisses, pushes Jimin’s leg up and out, watches his cock get swallowed up by Jimin’s hole. The knot grows bigger and Jeongguk’s so close, so near actual relief, he can barely stand it.\n \n“Jeon ― ” Jimin starts, voice croaking, eyes fluttering open. “Jeongguk, pl ― please, too much ― ” He’s gasping, wrists straining against Jeongguk’s hand, legs tightening over Jeongguk’s shoulders, as if drawing him in closer. “‘S too much,” he slurs, tears spilling from his pretty eyes and Jeongguk only fucks him harder, knot so heavy inside of Jimin, he knows it’s rubbing insistently against Jimin’s prostate.\n \n“Gonna break you, hyung, fuck your pussy open, fuck fuck fuck,” Jeongguk growls, knows there’s no stopping now. He’s already locked in place.\n \nJimin’s shaking, cries openly, hands clenched into fists as his chest heaves. “Hurts, Jeongguk ― can’t,” he begs, cuts himself off as he screams, body arching off the bed. The orgasm has to be painful, Jeongguk knows, but Jimin’s ass clenches around Jeongguk’s cock, squeezing his knot and it’s too much, Jeongguk fucking into Jimin so hard, the headboard thuds against the wall. “S-stop, stop, Jeongguk, can’t ― ”\n \n“‘S’all most over,” Jeongguk assures, grinds into Jimin’s ass, balls clenching and then he’s spilling into Jimin, relief washing over him in waves but there’s too much cum, the knot isn’t enough to hold it all in. It spills past Jeongguk’s knot, gushes out of Jimin’s hole and still, Jeongguk pours into him, barely holding himself upright. Jimin’s gasping, hair matted to his forehead, sweat and cum coating his skin and Jeongguk drops his head to rest against Jimin’s chest, watches as Jimin’s belly swells, Jeongguk pouring more seed into him.\n \nHe’s got Jimin bent in half again, feet nearly touching the mattress and Jeongguk needs to move, needs to get Jimin in a more comfortable position but the exhaustion is settling into him like a flood, everything else washed away. When he manages to lift his head up, he finds Jimin unconscious again and it’s well enough. It’ll hurt less.\n\nJeongguk pulls back, hisses as his knot shifts inside of Jimin, pushing against Jimin’s entrance. He eases Jimin’s legs down, brings Jimin’s arms down, too, before rolling Jimin on top of himself. Like this, Jimin wouldn’t be trapped under his weight and it’s the most he can do, eyes slipping shut as his hips twitch upwards, a new wave of cum spilling into Jimin.\n \n \n \n \n \nJeongguk wakes up first, cock painfully hard again, and he groans, adrenaline spurring him to move, exhaustion forgotten as the rut clouds his mind. Jimin's curled up on top of him, still sleeping, maybe even just unconscious and Jeongguk just wants to go again, wants to pound into him, hump him, take Jimin anyway he can get. He's not picky.\n \nRolling Jimin off, Jeongguk pulls out of him, watches cum and slick pool out of him and the sight never ceases to excite him, how Jimin was fucked full of Jeongguk's seed, how his belly was swollen, how no one could mistake Jimin as anything but his. Jimin's body glistens with sweat and cum, and it has Jeongguk growling, mouth latching onto Jimin's nipple, sucking the bud into his mouth, hands all over him. He ruts down against Jimin's soft belly, licks away cum around Jimin's nipples only to sink his teeth down onto unmarred skin. There isn't much left, and that fills Jeongguk with pride, satisfaction, grinding down on Jimin to get off. Jeongguk works his way up, cock rubbing against Jimin's tits, brown buds bite swollen, bruises red and purple around his areolas. Jeongguk loves Jimin's tits, can't wait to see them swollen and puffy, belly fucked full of Jeongguk's pups. Jimin'd glow, so pretty, fucked and bred and Jeongguk can barely keep his hands off Jimin now, he's not sure he'll let Jimin off his cock after he's knocked up.\n \nArousal ignites under his skin, has him rubbing his cockhead against Jimin's hardened buds, precum leaving them glistening as his balls drag across Jimin's chest. Setting an easy pace, Jeongguk rocks against Jimin's chest, twists Jimin's nipples as he ruts against him, like a dog in heat.  He comes quick, breathing hard and his cock barely softens, ready to go for another round in a matter of seconds. Cum's splattered across Jimin's chest, droplets smattering Jimin's neck. Jeongguk licks those off, wants to apologise as he buries himself back into Jimin, ready to go again.\n \n \n \n \n \n\nJeongguk has Jimin half on the bed, half off, his knees against the carpeted floor as Jeongguk fucks him from behind, Jimin’s hands fisted in their soiled sheets, begging and begging and begging. Jeongguk won’t touch him, Jimin’s cock hanging between his legs, neglected, precum dribbling down onto the carpet, cum and slick dripping out of Jimin’s hole, pooling on the floor. \n\n \n\nJimin’s barely holding himself up, Jeongguk knows, is sore all over and every time Jeongguk’s cock rubs against Jimin’s prostate, his mate whimpers, desperate for relief. Jeongguk can’t help it, just wants more and more and more, even the relief of finally knotting Jimin not enough. Nothing felt like enough, as if even consuming Jimin whole would leave Jeongguk unsatisfied, desire like a forest fire, consuming everything in its wake.\n\n \n\nJimin’s waist is slim, hips curving out, ass plump and round, and Jeongguk will never get enough of this, seeing Jimin like this, small frame made for Jeongguk. He fucks Jimin so thoroughly, unyielding in his pursuit of release, in filling Jimin up, bone deep desire to breed him, have him hanging off his knot, belly heavy with Jeongguk’s seed pushing everything else out of his mind.\n\n \n\nTo his credit, Jimin takes everything, the way Jeongguk licks and bites and manhandles him, the perfect fucktoy, body shaking every time Jeongguk reminds him what a desperate little slut he is.\n\n \n\nJeongguk’s cock snags against Jimin’s rim, knot inflating as Jeongguk pushes his length back into him. Jimin screams, scrambles forward, shoulder blades rising up as he bows his head, chest heaving.\n\n \n\n“You can take it, hyung, I know you can,” Jeongguk murmurs, bends forward until he’s got Jimin’s body covered with his own, hands finding Jimin’s in the sheets. “You’re so good for me Jimin, I’m so lucky. Love you, love you so much.”\n\n \n\n“L-love you, too,” Jimin breathes back, voice hitching as Jeongguk grinds into him, knot growing fuller and fuller. Jeongguk kisses along his neck, hips stuttering forward, Jimin’s ass getting tighter as Jeongguk’s knot pushes against his prostate. It’s overwhelming, Jimin crying out as he comes, shakes underneath Jeongguk and he can’t do anything except fuck into Jimin harder, chasing his own orgasm. Jimin’s ass squeezes it out of him, going limp in Jeongguk’s hold, cum milked out of him as Jimin clenches around him harder. \n\n\n“Fuck, fuck, \n\nfuck\n\n,” Jeongguk hisses, teeth sinking into Jimin’s shoulder as relief pours over him, cum shooting hot and thick into Jimin. He manages to drag a pillow of their bed, before the two of them collapse right there on the floor, Jeongguk spooning Jimin, barely able to stay awake.\n\n \n \n \n \n \n\nIt takes longer and longer between rounds for Jeongguk to get hard, Jimin more or less asleep or unconscious or something in between, too tired and spent to keep up with Jeongguk. He’s buried inside of Jimin again, Jimin’s legs swung over his shoulders as he fucks into him slowly, exhaustion coursing through him and yet still no match for his hunger. \n\n\n \n\n\nSomewhere in between he’d fed Jimin again, his own desire for food completely gone. There was only room in his head for Jimin, a burning need to consume him, take him, have him every and any way he can. The edge hasn’t worn off, just turned down to a simmer and Jeongguk thinks he’ll scorch through it, kisses along the inside of Jimin’s knee, up his thigh. He’s unmoving, fucked out completely beyond belief and Jeongguk’s previous ruts had never been this long, this drawn out.\n\n\n \n\n\nStill, he thrusts into Jimin, the sight of his mate before him like a cool wave of relief. Jimin is his, bears Jeongguk’s mark, reeks of his scent, of his cum. Exhaustion drags him down, and Jeongguk’s so sure this is it, hips working into Jimin steadily. His release doesn’t come easy, drags out, Jeongguk milking Jimin’s body for everything’s worth, still tight, still so wet, so satisfying, the heat of him around Jeongguk’s cock like a reassurance.\n\n\n \n\n\nWhen he comes, knot forming smaller this time, Jeongguk practically topples over, wincing as his knot jostles inside of Jimin, their position not ideal. It takes an inhuman amount of effort for him to shift them around, Jimin half on top of Jeongguk before he passes out completely.\n\n\n \n\n \n \n \n \n\nThe next time Jeongguk wakes up, it’s Jimin who’s awake, a finger drawing something against Jeongguk’s skin. He’s still on Jeongguk’s cock, soft inside of Jimin.\n\n\n \n\n\n“Hey,” he croaks, hand winding into Jimin’s hair. He touches dried cum along with soft locks, suddenly apologetic for everything he’s demanded out of Jimin.\n\n\n \n\n\n“Hey,” Jimin murmurs back, voice still scratchy. Jeongguk did that, too.\n\n\n \n\n\n“Sorry.”\n\n\n \n\n\n“For what?” Jimin asks, head still resting on Jeongguk’s chest. Jeongguk wraps his arm around Jimin tighter, feels gross and in desperate need of a shower. “You didn’t do anything I didn’t want.”\n\n\n \n\n\nSomehow that doesn’t make him feel any better. He’d fucked Jimin without pause, rough and desperate and so fucking possessive. Jimin’s shoulder, the one Jeongguk can see, is covered with Jeongguk’s bite marks.\n\n\n \n\n\n“I always thought \n\nI\n\n was insatiable,” Jimin continues, finger rubbing against Jeongguk’s nipple. “But you’re a machine.”\n\n\n \n\n\n“You are,” Jeongguk mumbles, knows what Jimin gets like in his heats. Jeongguk tires out before Jimin is satisfied nearly every time, cock milked dry, and Jimin always wants to go again. The hormones help, alpha biology somehow keeping up with his omega’s demands. “Your heats last even longer.”\n\n\n \n\n\n“I don’t even know what day it is,” Jimin mutters and Jeongguk thinks he should get them both to the bathroom. He shifts, Jimin immediately hissing and Jeongguk stills, sinks back down onto the bed.\n\n\n \n\n\n“You okay?” he asks, concern flaring through him. “Lemme pull \n―\n ”\n\n\n \n\n\n“No,” Jimin hurries to say. “I tried, earlier, but it feels horrible. Too empty.”\n\n\n \n\n\nJeongguk doesn’t question it, hand stroking down Jimin’s back, ignoring the filth he’s left along Jimin’s skin. “We can use your plug,” he offers, Jimin finally looking up at him. There’s a sleepy look in his eyes, and Jeongguk wants to kiss him, tugs Jimin’s head back to do just that.\n\n\n \n\n\n“‘Kay,” Jimin mumbles into the kiss, lets Jeongguk scoot them both closer to the nightstand next to Jeongguk’s side of the bed. Their sheets are disgusting and Jeongguk was right when he’d said they’d have to burn them. Or at least throw them away.\n\n\n \n\n\nIt takes him some careful maneuvering to get to Jimin’s plug, tapered at the tip with a flared base. Jeongguk slides out of Jimin painstakingly slow, cum dripping out of his hole almost immediately, hole fucked raw. Jeongguk’s jaw clenches as he pushes the plug in.\n\n\n \n\n\n“You good?” he asks, watching Jimin for any sign of discomfort.\n\n\n \n\n\n“I don’t think I’ll walk ever again,” Jimin answers, smiling fingers dancing along Jeongguk’s shoulders. “Good thing I know you’ll carry me around.”\n\n\n \n\n\n“Anything for you, hyung,” Jeongguk promises, kissing Jimin again. It takes some convincing but Jeongguk manages to get Jimin to agree to a bath before they both pass out again. Jeongguk picks Jimin up easily, legs not nearly as wobbly as he’d expected. Jimin’s smiling up at him, Jeongguk’s arm hooked under Jimin’s legs, the other firm around Jimin’s back.\n\n\n \n\n\n“Gimme a sec,” Jeongguk tells Jimin once he’s got Jimin in the bathtub, water already running. He wanders back out to find his phone, ignoring missed calls to take in the date and time. It’s Wednesday. Jeongguk’s not sure if they just slept that long near the end or if his rut’s really lasted nearly three full days but he’ll think about that later.\n\n\n \n\n\nThere’s a jar of lavender bath salts in the bag Hoseok’s left them and Jeongguk knows they could both use something relaxing right now. He doesn't head to the bathroom until he's ripped all their sheets off, leaves them in a pile next to the foot of the bed.\n\n \n\nJimin pushes himself up when Jeongguk gets back into the bathroom, and Jeongguk doesn’t have to be told that he wants Jeongguk in the bath with him, the panic in his eyes telling enough. Jimin didn’t do well with distance after their heats and ruts.\n\n\n \n\n\n“I’m right here, hyung,” Jeongguk reassures, slipping into the water with Jimin once he’s grabbed a bottle of shower gel and shampoo. Jimin takes the bath salt from him, pours out two handfuls, before settling back against Jeongguk’s chest.\n\n\n \n\n\nFor a while they both just sit there, the scent of lavender seeping into the air, bathtub filling up. Jimin turns the water off with his foot, sinking down lower as he sighs, one of Jeongguk’s arms wrapped around him.\n\n\n \n\n\n“How long?” Jimin asks, head resting against Jeongguk’s chest. \n\n\n \n\n\n“Almost four days,” Jeongguk answers, pouring the shower gel onto a washcloth. He starts at Jimin’s neck, massaging it into Jimin’s skin, kneading his muscles. Jimin groans appreciatively, pliant in Jeongguk’s hands.\n\n\n \n\n\n“That’s a record,” Jimin murmurs, letting Jeongguk lather up his chest, rubbing dried cum off as gently as he can. To his credit, Jimin doesn’t so much as wince, eyes shut as Jeongguk continues lower. When Jeongguk gets to Jimin’s cock, he gets the hiss of pain, working as gently as he can around it before dipping down lower. Jimin bites down on his lip as Jeongguk wipes between his thighs, even more careful as he works at the caked cum around Jimin’s entrance.\n\n\n \n\n\n“Sorry,” Jeongguk whispers, an arm wrapped around Jimin’s shoulders. “Does it hurt?”\n\n\n \n\n\n“Yeah, but it’s okay,” Jimin answers, eyes half lidded as he looks at Jeongguk. “Don’t care.”\n\n\n \n\n\n“Hyung \n―\n ”\n\n\n \n\n\n“It’s okay if it’s for you,” Jimin interrupts, cheeks flushing and Jeongguk’s heart twinges in his chest.\n\n\n \n\n\n“You’re so ― ,” he starts, words dying in his mouth, worries that he’s gone equally pink in the face. “Thank you.\"\n\n \n\n\"Mmm,\" Jimin hums, turns in Jeongguk's hold for kisses. Jeongguk gives them readily, and between all of them, somehow manages to get Jimin clean and sleepy. He needs his rest and Jeongguk gets him out of the tub, drying Jimin off tenderly before getting him under their blanket. Jeongguk goes back and takes a shower himself, washes away sweat and cum, his own muscles aching in protest.\n\n\n \n\n\nJeongguk collapses next to Jimin, pulls him in tight against himself, face burying into Jimin's wet locks. \"Love you, Jimin.\"\n"
}