{
    "id": "7609768",
    "url": "https://archiveofourown.org/works/7609768?view_full_work=true",
    "author": [
        "astolat"
    ],
    "title": "Erosmancy",
    "rating": "Mature",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Harry Potter - J. K. Rowling"
    ],
    "relationships": [
        "Draco Malfoy/Harry Potter"
    ],
    "characters": [
        "Blaise Zabini",
        "Mrs Zabini",
        "Draco Malfoy",
        "Harry Potter",
        "Albus Dumbledore",
        "Narcissa Black Malfoy",
        "Hermione Granger"
    ],
    "additional_tags": [
        "Consent Issues",
        "Hogwarts Era",
        "Alternate Universe - Canon Divergence",
        "Hogwarts Sixth Year",
        "Erosmancy"
    ],
    "language": "English",
    "series": "Part 8 of Harry Potter works",
    "published": "2016-07-28",
    "completed": null,
    "words": "11,057",
    "chapters": "1/1",
    "comments": "349",
    "kudos": "13,973",
    "bookmarks": "2,335",
    "hits": "169,150",
    "summary": "<p>Blaise was immune to whatever it was people usually felt around his mother, for which he was profoundly grateful, since no one needed an Oedipal complex on quite that spectacular a scale, but that didn’t mean he didn’t have a thorough respect for her gift.</p>",
    "notes": "<p>With heaps of thanks to julad and Cesperanza for beta!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>All feedback loved! If you like, <a href=\"https://astolat.tumblr.com/post/148101362243/erosmancy-11057-words-by-astolat-chapters-11\" rel=\"nofollow\">reblog!</a></p>",
    "text": "Blaise was immune to whatever it was people usually felt around his mother, for which he was profoundly grateful, since no one needed an Oedipal complex on quite that spectacular a scale, but that didn’t mean he didn’t have a thorough respect for her gift. So when she paused in the middle of hugging him on the station platform and pushed him out to arm’s length, frowning a bit, and said, “Darling, you must tell me at once: who have you been entertaining yourself with this term?” it didn’t occur to him to lie.\n“Lucille Fitzcarrow and Draco Malfoy,” he said immediately.\n“I don’t know her; point her out, please,” Mother said. Lucille was with her mother and father not far along the platform. Mother left his trunk where it was and swept over to them, accidentally brushed Mr. Fitzcarrow’s arm and pulled him round. “I beg your pardon—why, you must be Lucille’s parents,” Mother said. “Esther Zabini, a pleasure.” She made a little chit-chat, smiled at Lucille and shook hands with her, and disengaged quickly—Mrs. Fitzcarrow already had that narrow, anxious look coming in her eye, at about the same speed as the faintly glazed one in her husband’s. \n“It’s not her,” Mother said. “You’re sure Draco’s the only other one, darling? Has anyone else approached you, perhaps, even if you didn’t take them up on it?”\nBlaise shrugged. “Everyone’s always approaching me.” Mother had picked a really good-looking man to sire him, of course, as well as rich and clever, and even if he didn’t have the gift himself, you could still learn a lot of the techniques. “But nobody else in particular, not last term.”\n“Well, this will certainly set the cat among the pigeons,” Mother murmured. “All right, we’d better have a look at Master Malfoy.”\nDraco was stalking away from the platform already, pulling his trunk, at his mother’s side. People were eddying out of their way. It was all over the papers, of course, that his father had been arrested yesterday along with an entire pack of Death Eaters, in some enormous disaster of an attack on the Ministry.\n“Mother, are you sure about this,” Blaise said almost under his breath, as she set an intercept course. There wasn’t going to be any talking to the Malfoys right now without taking a side. Blaise belatedly had to regret the messing around. It made things a bit awkward. Draco wasn’t the sort who’d lower himself to push, of course—he wouldn’t so much as glance in Blaise’s direction again without encouragement. But lack of it would be remembered. Draco held on to grudges like a toddler with an ice cream, and he wanted people to belong to him. He sulked when they unaccountably insisted on signing up for a class he didn’t take or refusing to go out for sweaty pointless Quidditch, much less not taking his side in a war. However, Blaise was entirely prepared to have Draco permanently angry at him rather than walk himself and his mother onto a battlefield.\n“There’s no help for it, darling,” Mother said, however, and didn’t slacken her pace, so evidently they were taking a side. “Narcissa,” she said, raising her voice a little, and the Malfoys paused and turned. Draco’s face was hard, his mouth turned down, a few bruises along his jaw and his clothes not quite up to snuff. Blaise had heard from Pansy that he’d got into a fight with Potter and his whole crew on board the train, with only Crabbe and Goyle at his back—more stupid than Draco was inclined to be, even where Potter was concerned, but circumstances obviously weren’t calculated for him to be thinking clearly.\nHe looked at Blaise, frowning, while Narcissa just held herself stiff and cool. “Esther,” she said. She wasn’t the sort of woman who got anxious around Mother. She was the sort who just brought out the Dark magic and the knives when and if they should ever be called for, and you could always see the suggestion of them lurking under the polite smile.\n“It’s been too long. I hope we’ll see one another over the holidays,” Mother said, offering her hand. Blaise barely controlled a double-take. Draco blinked himself, although Narcissa didn’t so much as bat an eye. “I was so sorry to hear about Lucius. Those people in the Ministry have really begun to get the most extraordinary jumped-up notions. Jackals at the heels of a lion, darling.”\n“How kind of you,” Narcissa said after a moment, allowing her smile to warm to just a fraction above polite, and took her hand.\nDraco was staring at Blaise, a wary animal sort of hope in his face—obviously wanting the support, and not quite believing in it, which was fair enough, since Blaise himself didn’t believe in it. Hundreds of wizarding families in Britain had someone on this platform right now, and a considerable number of those were watching. Mother might as well be taking out an advertisement in the Prophet announcing her support for the Death Eaters. \nBut then she turned and offered her hand to Draco, who reached out to take it, and just before they touched, he jerked back as if she was running a live current. And Mother had pulled her own hand back, too—more controlled, a flinch that Blaise only saw because he was looking for it, but there.\nMother instantly turned back to Narcissa. “Keep smiling, darling,” she said, very quietly, her own smile fixed in place. “Your son’s in extraordinary danger. If you want him to live to come of age, you’ll come with us right now. Must you go straight home?” she continued, letting her voice rise back to normal levels, something one of the handful of people going past might overhear. “Perhaps you might join us for tea before the journey to Wiltshire.”\nDraco darted a shocked look at his mother, betraying himself. Narcissa still had that perfect mask in place, but her eyes had hardened. Blaise could see those knives just below the surface now, and they were sharpened. After barely a pause, Narcissa said, “How kind of you. Shall we take our carriage? It’s waiting just outside, of course.”\nShe offered it in a faintly challenging way. “Certainly,” Mother said, which got a tiny furrowing of Narcissa’s brow in return, as if she hadn’t expected Mother to accept. “Blaise, darling, go and get your trunk.”\nBlaise made a dash for it and came back in a hurry. He didn’t like leaving Mother alone with the Malfoys. Mother rarely cast spells for herself—she said it disrupted her stored power—and while there were plenty of men on the platform, they were with their wives and children and moving, not easily pulled. He liked even less getting into the Malfoys’ enormous coach with them, especially after the smile fell straight off Narcissa’s face the instant the door closed. “Explain yourself,” she said, coldly.\n“Your son’s an erosmancer,” Mother said.\nNarcissa blinked at her, as if she hadn’t even understood. Draco’s face had screwed up with half-offended confusion. “What?” he said. “Is this some sort of—”\nMother looked towards him and her eyes filmed over solid white, glowing out of her face, and then she deliberately leaned over and reached a hand out towards Narcissa’s knee. Draco jerked up off his seat so fast he nearly fell, a snarl on his face and a silver wash coming over his eyes—not quite opaque, but visibly shining in the dark of the coach, and put out a hand to bar her.\nMother sat back at once, letting her eyes fade to normal again, and Draco collapsed back onto his seat gasping and shaking his head, blinking hard. “What—what did—”\n“I’m sorry, my dear, it was the quickest way to pull it to the surface,” Mother said. “We’re territorial, you see.”\nNarcissa was staring at Draco, shocked. Blaise couldn’t help staring himself, too, although of course he’d already half-guessed, back on the platform. But if erosmancers were one in ten thousand, male ones were one in a million. The Malfoys were an old family though, and so were the Blacks—old and rich and powerful, the sort that a smart erosmancer might choose to ally herself with. It wasn’t impossible that he’d got it from both sides sometime in the last four or five generations.\nBlaise still didn’t understand just why that had made Mother decide to throw herself into the middle of a brewing war, though, and then she turned back to Narcissa. “I hope you’ll forgive me for being quite blunt,” Mother said. “There’s all sorts of ridiculous ideas about erosmancy, and you may have quite the wrong notion of what it means.”\n“We’re perfectly capable of finding out what it means ourselves,” Narcissa said. She’d recovered, her face gone hard again; she had put a protective hand on Draco’s arm. “All I want you to explain right now is how this puts my son in danger.”\n“I can’t do one without the other,” Mother said. “You see, what people misunderstand is that the sex is actually incidental. Any wizard can throw together a sex ritual and raise power. But for most it’s not worthwhile—you can only throw the power into a spell you cast right in the moment, and even then most of the power goes spilling off. Our trick is storing it. And once you’ve got all that lovely power stored up, you can give it to someone to use. It’s most effective if you have someone bonded, but anyone close will do—Blaise, would you mind?”\nHe put his wand away. Mother put her hand on his shoulder. “Just a light spell, darling,” she said, and pushed. Blaise swallowed—it was always a bit of a jolt—and then he said, “Lumos,” and watched the whole carriage fill with a wincing blaze of light.\nMother took her hand off and the light faded out. “It makes us very useful allies, as you can imagine.”\n“I can,” Narcissa said, her eyes narrowing.\n“Unfortunately,” Mother added, “an untrained and unbonded erosmancer is vulnerable to—exploitation, shall we say.”\nNarcissa darted a glance at Draco. He was still glaring at Mother suspiciously—he’d been seething over in the corner ever since she’d pushed him. “And just why are you telling us all this?” he spat.\n“Well, darling,” Mother said, letting a bite into her voice, “if your loyalty to the Dark Lord is so great that you’re willing to spend the rest of a brief life being raped continuously so he can extract staggering amounts of power from you until he burns you out, I suppose I can’t stand in your way, but I would rather he not get the chance to work out the technique. If you think it over, I’m sure you’ll understand why all of us try to discourage that sort of thing. Erosmancy’s hereditary, after all.”\n#\nBlaise could see Draco was doing his best to pretend everything was perfectly under control and he wasn’t at all terrified to the point of nausea, but it wasn’t working very well. Blaise felt a bit sick himself. Mother had always told him that he’d have to watch any daughters he had, and make sure to get them trained early and properly if they inherited the gift, but she’d never explained exactly why.\nThe carriage had brought them straight to the Zabini house. It turned out Lord Voldemort was literally waiting at Malfoy Manor, and already livid about Lucius having got himself arrested. In other words—words that Narcissa didn’t say but all of them understood—not in the least in a mood where he’d be inclined to spare Lucius’s son the charming fate of fueling his complete conquest of Britain. He’d evidently already ordered Narcissa to bring Draco to him for some sort of special assignment.\n“I’ll be perfectly frank, I don’t see that you have any choice,” Mother was saying. “Dumbledore’s the only one who can protect Draco. The quicker he’s back behind the wards at Hogwarts, the better.”\n“And what price do you suppose the old man will extract for that protection?” Narcissa snapped. She was too controlled to pace, but she was standing column-rigid by the fireplace in their living room with her hands clenched over each other, white-knuckled, her eyes following Draco as he paced. “Not to mention what He will do, when he is victorious.”\n“I realize this is heresy in your circles, but he isn’t going to defeat Dumbledore overnight, if ever,” Mother said. “In a year, Draco will be trained and in command of his power, and it won’t be possible to abuse him the same way. If you choose to return to his service then, I doubt his Lordship will cut off his nose to spite his face. As for what price—well, my dear, I think that’s quite obvious. Dumbledore’s going to demand that Draco bond one of his people. But that’s the best protection for him now anyway, and there’s no harm in it either, if you take the long view. After all, the Dark Lord means to kill all of them anyway. In fact, you ought to offer it, with the condition that Draco can take his pick of the candidates.”\nDraco whirled round from the window. “You’re actually suggesting that I—what, fuck one of Dumbledore’s pets?”\n“Yes, of course,” Mother said prosaically, which made Draco gawk a bit, like he’d expected to get a rise out of her over it or something. “But don’t worry about that part, darling. We’re not like ordinary people, you know. I dare say you’ve already been finding that it all comes naturally to you.” Draco went red, darted a look at his mother, and stopped arguing.\nBlaise could attest to that much from very pleasant personal experience, but the rest of what Mother was saying was outright rot, of course. An erosmancer could shag half a dozen people in a night and call it a pleasant evening among friends, but bonding was no joke. All his life, Mother had been really careful to only take really elderly wizards, who popped off peacefully after a few happy years of overexerting themselves and left her all their money. And even that was rough going for her when she lost them. “All he wanted was to feel young again,” Mother had wept to him at Uncle Flewellyn’s funeral, six years ago, while the rest of the extended family scowled at her resentfully: he’d left her the current residence. “At least I could give him that.” Then she’d sobbed without stopping for a week solid and had needed a month lying in dark rooms to recover. All this, even though Flewellyn, despite being a good old fellow Blaise had liked quite well himself, had been a hundred and ninety-six and overdue.\nAnd that was Mother, who’d never been either sentimental or exceptionally possessive. Draco himself was already inclined to the feudal anyway. Crabbe and Goyle were useless clods who lost house points on a weekly basis: pureblood or not, they would’ve been outcasts in Slytherin if Draco hadn’t rammed them down everyone else’s throats. But they were his loyal vassals, so everyone else was going to put up with them, or else.\nIf Draco bonded one of Dumbledore’s overzealous do-gooders—and wasn’t that going to be fun for one of them, getting the full force of a possessive erosmancer centered on them—there definitely wasn’t going to be any convenient switching to Voldemort’s side later on, complete with discarding the inconvenient baggage. If anything, it was going to be the other way round. Draco would probably go spare over the prospect of anyone so much as daring to suggest he give up his prize.\nWhich of course was a feature as far as Blaise was concerned. He and Mother certainly didn’t want Voldemort winning now, what with them outright betraying him. He’d been anxious enough the other way round, but at least Dumbledore’s crowd wouldn’t murder you out of spite. The sooner Draco was bonded off to some excessively noble Auror, the better. They could take all that nice power and make themselves a much more compelling target for Voldemort’s wrath than, for instance, a merely interfering erosmancer and her son.\n#\nUnfortunately, that very sensible plan got derailed as soon as they called Dumbledore. He did at least have the meager wit to recognize exactly how bad it would be for his side if Voldemort got his claws into Draco right now, and promptly whisked them all back to Hogwarts and installed them securely behind the wards. “We have safehouses where you can be concealed even from Voldemort’s reach,” Dumbledore told Narcissa, “and I will speak with Scrimgeour. There is no sense in keeping Lucius in Azkaban under these circumstances, and likely much danger. We will have him join you.”\nDraco’s head jerked up at that, nakedly hopeful, and Narcissa stiffened. “You’re too kind,” she said coolly. Her hand hadn’t left Draco’s shoulder; it tightened on him visibly. “Naturally, Draco is prepared to—offer his bond to your side, under the circumstances.”\nThat of course was when the old idiot said, “That will not be necessary, Narcissa. I do not propose to force a child into a terrible perversion of what ought to be a natural and joyous partnership. Erosmancy is a rare gift. When Draco enters into a bond to share his life and power with another, it must be by his own free choice. Until then, I will see him protected while he completes his training.”\n“Mother,” Blaise said to her in horror, after they’d gone to the apartment Dumbledore had assigned her: she’d be staying at Hogwarts to train Draco.\n“Yes, darling, utter twaddle,” Mother said grimly. “And after we’re already committed. But of course Draco’s not going to give away his bond to one of Dumbledore’s side if he doesn’t have to.” She drummed her fingers on the desk. “Unless we can force the matter. Darling, would you say Draco’s in love with anyone?”\nBlaise thought about it—he didn’t give much thought to his house mates’ love affairs ordinarily, when his life didn’t depend on them. “I don’t think so,” he said reluctantly. “He goes with Pansy more than anyone, but I think that’s just him letting the sufficiently attentive subject kneel at the throne, that’s all.”\n“Just as well, the Parkinsons are on the wrong end of things,” Mother said. “Does he hate anyone? Passionately, I mean.”\n“Oh, does he,” Blaise said.\n#\nMother spent the holidays teaching Draco the basics while they waited for the next term to start. She roped Blaise in, since there wasn’t anyone else for Draco to practice on. His job was to sit there saying no while Draco tried to pull him into it—easy enough, since he was immune, even if not particularly fun. Except for the entertainment value of watching Draco get massively annoyed as the weeks went on. Which was quite substantial, actually. Draco had always been ridiculous—he’d never been trained out of the idea that anything nice really ought to belong to him, and it was some sort of oversight if it didn’t—but now his territorial instincts were sending him completely out of his head. And Blaise had shagged him a couple of times last term, so Blaise ought to be his, body, mind, and soul, and Draco couldn’t bear that he was refusing to acknowledge that obvious fact.\nAbout a week before term started, Draco started really getting impatient and snarled at Mother, “He doesn’t feel it, what’s the point, I’m not wasting my time any further!”\nMother just said in her most cool, bored tones, “Darling, don’t fuss, it’s the practice that matters. Try again, do,” and Draco flushed up furiously and whirled on Blaise and his eyes went solid mercury and then he said, “Honestly, Blaise, aren’t you getting bored? Let’s just forget all this and go and have a shag for the hell of it,” which to be fair made perfect sense, and Blaise was rather in the mood. Irritation looked particularly good on Draco.\n“Oh, all right,” he said, standing up, and then Mother snapped, “That’s enough!” and her hand was on Blaise’s shoulder, jerking him away just before Draco touched him.\nBlaise shook himself and stared at Draco, shocked. Draco was busy glaring furiously silver-eyed at Mother. Her hand was claw-tight on Blaise’s shoulder, gripping hard enough to hurt. “Well done, darling,” she said to Draco after a moment. Blaise could hear the tension in her voice; she was fighting to sound cool. “Now, let’s see if you can back off on the pull. Deep breaths, please. You might need to close your eyes.”\nDraco just stood there a moment longer with his hands clenched, shivering, and then he did shut his eyes, and started breathing deeply. Mother relaxed after a few minutes, just as he opened his eyes and was back to normal.\n“Well, I’m afraid Blaise won’t be able to help us any more,” Mother said in calm tones that Blaise could tell were entirely artificial. “But fortunately, the rest of your classmates will be arriving next week, and I’m sure we’ll be able to find a volunteer or two to assist us. Why don’t you take the week as a holiday, and we’ll begin again after classes start.”\n“How did he do that?” Blaise demanded, as soon as Draco had stalked out the door after one last lingering look in his direction that made something shiver pleasantly in Blaise’s gut. “I thought I was immune.”\nMother had sat down and was summoning up a pot of tea, which meant she still felt ruffled herself; she poured Blaise a cup, too. “It’s my power that protects you,” she said, low. “And it seems—his is greater. Male erosmancers are supposed to be extremely strong, but I’m afraid I didn’t quite anticipate the degree. I’m sorry, darling, you’d better not mess about with him recreationally anymore, and I’ll give you a protective amulet in case he decides to have another go at you. The last thing I want is to provoke a territorial dispute with him. He might rush off the grounds and straight into the Dark Lord’s arms.” She sat back with her cup of tea and sighed. “The sooner we have him bound up, the better.”\nDraco did have another go that afternoon, down in the Slytherin common room. The amulet worked, although Blaise had to admit his own inclinations weren’t helping. He could tell it would be stupendous. When an erosmancer promised you a good time, they kept the promise, and frankly, it’d been a good time even before Draco’s full powers had woken up. “Ugh, Malfoy, don’t make it worse,” he said however, because he wasn’t an idiot. “The last thing we need is for you and Mother to end up in a territorial squabble over me. Do you want to end up chained in a dungeon at You-Know-Who’s tender mercies?”\nDraco shuddered a bit, involuntarily, and sulkily threw himself into one of the armchairs. “I’m going mad,” he whined, letting his head fall back. “She’s had me slaving at it for months, and the first time I can really use it, there’s no one to use it on.”\n“There’s always Filch,” Blaise said.\n“Are you trying to make me vomit or something?” Draco demanded.\n“Or Hagrid’s out there on the grounds, I suppose,” Blaise added in thoughtful tones. “Oh, and of course, there’s always Dumbledore. Mother says she can’t pull him because he’s gay, but I bet you could land him in a minute—”\n“Zabini, I take it back, I wouldn’t shag you if you got on bended knee and begged,” Draco said, glaring.\nSo that got them a bit of breathing room, and six days later the rest of the students all showed up at last, streaming into the hall like a rescuing tide. But Crabbe and Goyle both made a bee-line straight for Draco, and they slipped him a letter, which couldn’t be good. Voldemort probably hadn’t been able to work out yet exactly what was going on—Mother had hoped that he might think that Lucius had cut a deal with Dumbledore for his freedom, which would only have made him angrier with the Malfoys. But if the letter was what’s the matter, all will be forgiven, only come back to the fold, and Draco decided to spill the beans to the Troll Twins, the next letter was certainly going to be how could you imagine I would ever treat the child of my ally with such cruelty, your place is by my side, Draco Malfoy, we’ll conquer all the world together and I will heap honors upon you etcetera.\nDraco wasn’t going to swallow the bait instantly and hand himself over, he wasn’t stupid, but the offer would certainly be to his taste. Mother thought Voldemort couldn’t bond himself—“I met him once, darling, before you were born, and there’s nothing in him to pull. I think he’s dislocated his soul somehow,” which sounded uncomfortable—but that only made things worse. If Draco had the bright idea to bond, say, Crabbe or Goyle, to protect himself…Blaise grimaced at the thought, which certainly wouldn’t appeal to anyone of taste. But there wasn’t going to be any way to stop Draco if he decided to take the plunge, and Voldemort wouldn’t even object. You could still give power to other wizards even if you were bound to another one in particular, it was just easier if you had the direct line.\nFortunately, Potter was over at the Gryffindor tables with his mates, scowling over at them. Blaise nudged Draco. “Someone isn’t happy to see you,” he murmured, and Draco promptly turned away from whispering with Crabbe and looked right back at Potter, his own eyes narrowing. They spent the rest of dinner glaring at each other the way they always did, which for once Blaise found a tremendous relief.\n“Yes, we’d best move quickly,” Mother said, when he reported to her that night. “How difficult do you think it will be to get Harry in here for one of our training sessions?”\nAs it turned out, not at all: Harry literally turned up at their first new training session the very next day, like he didn’t have anything more urgent to do on the first day of class but follow Draco round the castle. He was wearing his Invisibility Cloak while he did it, but that sort of thing couldn’t hide a teenage boy from Mother; she opened the door and paused, looking into the hallway behind Draco’s back narrowly, and then said to a patch of thin air, “Dear, it’s quite rude to skulk about,” in a mildly reproving tone. Draco jerked round as the air gave a sort of guilty twitch. “Besides,” Mother added, “there’s no need. You’re quite welcome, if you’re curious. We need volunteers, as you can see.”\nHarry slowly pulled off the cloak, looking wary. “Not him!” Draco said to Mother.\n“Whyever not, darling?” Mother said innocently.\n“That’s Harry Potter!” Draco hissed.\n“Are the two of you particular friends?” Mother asked. “Have you ever had sex before?”\nHarry’s eyes popped. “What?” he said, just as Draco yelled, “No!”\n“Excellent!” Mother said, and held open the door. “Come along, both of you. Thank you, darlings, we’ll try the two of you next week,” Mother added to Pansy and Crabbe, who were the ones Draco had brought along, and waved them off. “Blaise, you’ll come and be our control.”\n“I am not going to—not Potter!” Draco snarled.\n“Darling, that is exactly what makes him the challenge you need,” Mother said in lecturing tones. Harry was darting a look down the hall like he was considering a run for it, but Mother crooked a finger at him and said, “Right in here, darling, take a seat on the sofa. I’m sure you’d like to know what’s going on,” a gentle suggesting pull in the words, and Harry’s eyes unfocused a bit and he came in.\nFor all Draco’s objections, what he actually did was flush angrily, then stalk into the room right on his heels and plant himself in front of the sofa, blocking Mother’s view of Harry and glaring at her. Mother kept her expression serene, but Blaise could tell she was highly pleased. They couldn’t have asked for better: Harry was evidently lured and Draco was already territorial over him, even if he was snapping, “If you imagine I’m going to give Potter a go—”\n“Wait, what?” Harry woke back up at that and shot to his feet. “Give me a—what? With Malfoy? Not if he put a wand to my throat—!”\n“As if I’d want to get close enough,” Draco hissed, turning on him. And yet somehow they’d both managed to end up in spitting distance of each other, again.\nMother clapped her hands, beaming upon them both as they jerked back round. “Splendid! Please keep that up, Harry, that’s exactly right. Very helpful.”\n“Er,” Harry said, darting a sideways look at her.\n“And Draco, really, there’s no need to be alarmed,” Mother continued blithely to him. “You’re not going to be able to pull someone who actively dislikes you, not yet—that’s very advanced erosmancy and takes enormous power,” ladling it on a bit thick, Blaise would have said, but Draco scowled. “Now, go on, darling, just give it a try. Just imagine that—oh, that Harry here is rejecting you, how dare he—”\nIt wasn’t a shot at random—Blaise had filled her in quite thoroughly on their shared history, of course, which he himself knew about because Draco had recounted it with violent rancor at least a dozen times over the last six years. And then Harry helped things along by folding his arms and saying in the most snide way possible, “You don’t have to imagine too hard or anything, Malfoy.”\nDraco whirled on him, silver climbing over his eyes. “As if you wouldn’t be pathetically grateful if I wanted you, Potter.” His breath was coming in furious pants. “No one ever has, have they—no one’s ever wanted you,” he spat, and then he stopped short with a sudden wondering expression dawning over him as Harry flinched back violently, his whole face as dazed and wounded as if someone had just cut him wide open, straight across the front.\nBlaise gawked. He’d seen his mother pull people before, tugging out the needs in them that she could answer, but he’d never seen anyone hooked that deep. It hadn’t occurred to him at all—Harry Potter, of all the people to feel unwanted, with half the wizarding world ready to hoist him to their shoulders as a savior—\nDraco took a step towards Harry, reeling in his catch. His own face was coming alight, dazzled; his eyes were shining so strongly they were casting shadows on the wall. “It’s true, isn’t it. No one at all—no one’s ever really wanted you,” he breathed out, obviously feeling the line taut in his hands. “They all admire you, or want things of you—not Dumbledore, he doesn’t want you, he wants the Boy Who Lived, isn’t that right? No one wants all of you. Not even your best mates, your best friends—they want each other more than they want you. Not even your family—? Oh—oh, they don’t, do they. They can’t even stand you. Your own parents—left you—”\nHarry looked gutted, his jaw clenched tight over agony, like Draco was pulling his innards out of him. “Shut up,” he rasped out, his voice raw and barely over a whisper. “Shut up, you don’t—you don’t understand anything—”\n“You don’t understand anything,” Draco said, and his voice was changing, going low and soft and liquid, so deeply potent that Blaise felt shivers running up and down his own spine. “I want you.”\nHarry’s mouth stopped on a breath, half-open, as he made the mistake of locking onto Draco’s eyes. His pupils caught silver reflections, going glassy as Draco took another step towards him, slow and cautious and prowling, closing the trap on them both. They both looked transfixed. “I want all of you,” Draco said. “I’ve wanted you all along.”\nHis eyes were almost too bright to look at now, even from the side, but Harry was frozen, fixed on him completely, not even blinking. There were tears sliding from the corners of his eyes. Draco was on him, sliding his hands into Harry’s hair, taking hold of his head, and Harry just shut his eyes, shivering, and tilted his own head up invitingly for the first kiss, the second, the third. Blaise was finding it hard to breathe himself, watching.\n“I want to own you,” Draco said, almost a moan, between kisses, nipping at his mouth. “I want everything—why haven’t you let me,” reproachfully, nuzzling at Harry’s throat.\nHarry groaned and actually said, “I’m sorry, I’m sorry, I didn’t know, Draco,” and then he started grabbing at Draco’s clothes, clumsily but with total determination.\nDraco had no problem with clumsiness: he ran a single finger down the front of Harry’s robes, and they all opened themselves up and fell off him obligingly. “It’s all right, I’ve got you now,” he said, sounding intoxicated, sliding his arms round Harry’s body, stroking his hands all over him. “Oh, you’ve no idea what it’s going to be like. I’m going to have everything. Every part of you,” and he was catching Harry’s hand in his, bringing it to his mouth, taking the top of the little finger into his mouth for a slow lingering taste. Harry’s head rolled through a wide wobbly circle like his neck couldn’t hold it up straight, his eyes gone utterly glazed.\n“And I’m never going to let go,” Draco said, vowing, almost savagely. “I’m going to give you so much power no one’s ever going to be able to part us, ever,” and he pressed a kiss into Harry’s palm, and on pure instinct somehow managed to push him a taste of power with it. Harry cried out, shaking through waves of shudders, and as soon as he caught his breath with three enormous gasps, he seized Draco and dragged him towards the sofa. Everything was going magnificently, and then out of nowhere, Mother said very loudly, “Darlings, I don’t think—boys, you mustn’t—Draco, you must stop at once.”\nBlaise stared at her. She wasn’t actually doing anything to stop them, of course, but he couldn’t understand what she was saying it for, and then the door flew open and Dumbledore rushed in.\n“Albus, they’ve got to be separated at once or they’ll bond, but I can’t touch Draco,” Mother said quickly to him, her hands held out ineffectually towards the two of them as if she wanted to stop it, but she just couldn’t.\nDumbledore shot a hard look at her, but he went to Harry at once anyway. “Get away, he’s mine,” Draco snarled at him, pulling Harry closer, and Harry himself said furiously, “No!” and shoved back when Dumbledore tried to draw him away, clinging to Draco just as determinedly.\n“Somnolens,” Dumbledore said, and both of them blinked and sagged slowly to the floor, unconscious and still in a tangle.\n“So, Albus,” Mother said to him in asperity, as she sent Blaise over to drag Draco away, which wasn’t easy, because even asleep he tried to keep clutching Harry tight, “I gather that when you told Narcissa you’d wait for Draco to make a perfectly free choice, what you meant was, of Harry Potter?”\nDumbledore was kneeling by Harry. He looked up at her, and after a moment he said, “I cannot claim to have had any such insight.”\n“You’ve had them under your eye for five years, and you’ve never noticed that?” Mother said in tones of deep skepticism. “That was an Antagonist Binding they were about to form—their fundamental needs are perfect opposites! They must have been fighting like cats and dogs since the first minute they walked in the doors. And you didn’t think it worth mentioning? Seconds from bonding, in a minor training exercise—I dare say it’s going to be all but impossible to keep them from finishing the job. What Narcissa will say to me, I don’t like to think.”\nThe best defense was a good attack, Mother always liked to say, and Dumbledore did pause, frowning, as he looked down at them. “If so,” he said finally, “it must still be their conscious choice, not an accidental one.”\n“Well, now that I know about it, I’ll certainly be sure not to let Harry into our training sessions again,” Mother said coolly. “Perhaps you might take him away at once: it would be best if they didn’t wake up together.” Dumbledore was still frowning as he floated Harry out of the room, obviously dissatisfied, but not quite ready to accuse Mother of anything.\nAs soon as he was gone, Mother waved her wand over Draco. “Finite Incantatem,” she said, and he came awake and up on his feet with a jerk, looking round wildly before he wheeled on her flushed and panting, his robes half hanging off one bare shoulder and threatening to slide further.\n“Where is he?” he snarled. “Where did you take him, he’s mine,” taking a step towards her.\n“I haven’t done anything, darling, do calm down,” Mother said. “Dumbledore took him back to his dormitory. But you didn’t want him really, did you?” she added, as Draco clenched his fists. “Which is just as well—it’s not like Dumbledore’s going to let you have his golden boy, of course,” with just a hint of emphasis, and Draco stood there trembling for a solid five minutes of jealous rage before the silver left his eyes.\n#\n“As setbacks go, darling, it’s not a bad one,” Mother said, after Draco had got hold of himself and put his clothes straight and cleared out, announcing that he couldn’t believe she’d set him on Harry Potter of all people, as though he’d ever lower himself so, and it was an outrage. \n“I’d be happier to have them sewn up properly, but I think they’ll be very cooperative the rest of the way,” she continued. “I’ve never seen quite such a perfect fit between hungers. Draco’s just starving for total possession, and evidently Harry Potter is equally starving to be completely possessed. It wouldn’t have occurred to me either, but there you have it. And they seem to be a match on power as well—of course Harry has quite a compelling need for more power, but evidently Draco’s just as eager to give it to him. Is Harry everything the rumors have it? I’ve always assumed his reputation would be quite inflated.”\n“I don’t know how talented he is, exactly—he’s not a shining star in class or anything,” Blaise said. “But he ran a duelling school underground last year, for the other students, and he’s absolutely deadly as Seeker—I suppose it’s massive reflexes or something.”\n“Splendid,” Mother said. “We couldn’t really ask for better.”\nBlaise went into Potions class the next day with orders to try and nudge things along if he could. The opportunity wasn’t immediately obvious, because Harry kept his head bent over his station and didn’t so much as look up even when he was called on, just mumbled some wrong answer and took Snape’s points-off-Gryffindor in silence, his whole back and neck held rigidly so he couldn’t possibly turn his head and sneak a look over at Draco, who for his part stared fixedly at Harry the entire class. That wasn’t really anything new, but the degree of the phenomenon was, since he completely forgot about doing any of his work and when Snape came by at the end of class, Draco jolted out of his mesmerized state and just stared up at him blankly when Snape asked where his potion was. Snape stared down, obviously expecting some sort of answer, and when he got none said rather indignantly, “I will see you for detention tonight, Mr. Malfoy, and you can make it up then.”\nHe started to turn round to the Gryffindor side. Blaise immediately dropped his wand to the floor and bent down to get it, and as he came up aimed a subtle jinx at Potter’s cauldron and made it tip forward, spilling all over his station. “Detention for you as well, Mr. Potter,” Snape hissed at Harry, who looked up from wiping up the mess and then involuntarily glanced over at Draco—\nHe jerked his head back away looking dazed, while Draco’s eyes had gone distinctly shimmering, so Blaise congratulated himself on a job well done, then grabbed a handful of ingredients off his station and threw them into his own cauldron. It promptly erupted. Snape was looking murderous as he ordered Blaise to detention as well—and then on the other side of the room, Granger said loudly, “Well, perhaps if we’d been told to prepare it with the hucklethorn base, half the class wouldn’t have had trouble,” and Blaise scowled as she got detention, too—especially as she was looking right at him, with cold narrowed eyes.\n“I don’t know what game you and Malfoy think you’re playing, Zabini, but you’re not getting anywhere with it,” she hissed to him in the corridor as they spilled out. “Come on, Harry, we’ve got to get to Charms,” she said, turning away and taking Potter by the arm and pulling him away, Ron Weasley scowling protectively at their heels, while Crabbe and Goyle kept their stupid lumbering selves blocking Draco’s line of sight to him.\nDraco was sulky after, which was something, but not much consolation when Blaise headed to the common room after lunch and overheard Pansy murmuring, “Ooo, Draco, aren’t male erosmancers really rare?” Draco was sitting with her and Crabbe and Goyle in the corner, smirking with obvious satisfaction and making Pansy go heavy-lidded and nearly orgasmic just by stroking a finger along the back of her neck, so the cat was thoroughly out of the bag there.\nBlaise counted on detention, but it didn’t work. Granger planted herself between Harry and them and kept talking to him quietly the whole time, doing half his potion for him. Draco did his own with a cold furious expression the entire time, as if he was angry that Potter wasn’t coming over and throwing himself at him. He probably was, the unreasonable bastard. Blaise finally tried to push things: he nudged Draco and murmured, “Do you think Potter told Granger all about it?”\n“What, that all it took was one little tug and he was ready to bend over for me like a whore?” Draco snapped viciously, loud enough to be overheard. Potter flinched, and his jaw tightened as Hermione darted a startled look over and back at him.\nThey came out into the corridor after, and Potter abruptly halted and turned round to face them. Draco stopped short, staring at him, his face going hungry, and Harry swallowed visibly, his throat working. When he spoke, his voice shook, but what he said was, “I don’t know what the hell you did to me, Malfoy, but you know what, it doesn’t count. It’s not anything real. It’s what we choose that matters, and I wouldn’t choose you if—if my life depended on it,” before he turned and walked away with his head bent and Granger at his side, and bully for him, since it probably did.\nDraco whirled away snarling, “As if I’d let that pathetic halfblood wanker anywhere near me,” and stormed back to the Slytherin dungeons. When he burst into the common room, he stood on the threshold panting and swept his gaze round the place, killing every conversation dead. All the girls in the room turned to stare at him—even the queer ones—along with a good three-quarters of the boys. Draco stood there a moment, trembling, his fists clenched, and then he stalked through the room. He glanced at Pansy as he went, and also at Wanda Rowlands and Jeremy Talbot, barely a flick of his eyes, and all of them got straight up and followed him down the corridor to the dorms.\nBlaise groaned and let himself fall into an armchair, where he’d probably be sleeping that night. Shit.\n#\nIf anyone in the entire school hadn’t yet noticed what was going on with Draco, there wasn’t any missing it by the next morning. He was practically advertising, like an enormous billboard flashing: endless torrents of power and also all the sex you could ever want, on offer right here! Everyone at the Slytherin table who was old enough to have a sex drive was glaring hatefully at everyone else, with special rancor reserved for the three Draco had pulled last night, who were the only ones not glaring because they were all but toppling into their porridge.\nEven people at the Gryffindor tables were staring hungrily over, except not Potter, who had sat down with his back to the Slytherin tables and didn’t so much as lift his head from over his plate the entire meal. Blaise looked over at Mother in alarm. She was sitting at the head table and talking with Madame Hooch with a serene expression on, but when she met his eyes, he could tell she was just as concerned.\n“Potter rejected him?” she said, when Blaise managed to get away and get to her in private. “Wonderful. And Voldemort’s certainly going to know everything before the end of the day, if he doesn’t already.” She folded her arms and stood tapping her foot. Abruptly she said, “Dumbledore may be a romantic idiot, but not everyone on this side is, you can be sure of that. I’ll write to Scrimgeour and see if I can’t persuade him that Draco’s got to be forced to bond.”\nWhen Draco came for his training session that day, Pansy was with him, clinging to his arm and still wearing a look of smug satisfaction. “Very good, darling, you’ve been practicing,” Mother said to Draco.\n“I want to learn how to do that thing again, the one you did with Blaise,” Draco said imperiously. “When you gave him the power.”\nOf course Mother didn’t want to teach him anything of the sort, but she said thoughtfully, “It’s a bit early in your training, but I suppose it’s all right to give it a try,” and had him light Pansy up, which made her squeal a bit, and then look even more smug.\n“By the way, darling,” Mother murmured to Draco on his way out, catching him when Pansy had left the room, “do keep in mind that not all wizards are powerful enough to be worthy of an erosmancer’s strength. You can’t make a teacup bigger by filling it from a gallon jug.” Draco frowned at her. “Also, it would be best if you don’t do too much power-sharing yet,” she added. “Eventually, of course, the goal is for you to develop conscious control over the flow of power. But until you reach that stage, opening the pathways only makes it easier to—well. To take the power against your will.”\nDraco repressed a shudder and shot out of the room in a hurry.\nMother was frowning after him as soon as the door closed, though. “He’s not going to listen for long. His instincts are pushing him too hard. And I doubt it’ll take him more than a week of practice to establish total control over the flow. He’s just far too strong. Oh! What a relentless idiot Dumbledore is. As if his protégé wouldn’t be deliriously happy right now, not to mention enormously more powerful, if he’d only waited ten more minutes to come in.” She looked at Blaise. “Is it worth telling Harry so?”\n“Potter?” Blaise said. “I doubt it. He’s got the self-preservation of a lemming as far as I’ve ever noticed.”\n“Right, he’s one of those Gryffindor sorts,” Mother murmured. “All right, no, he won’t do it to save himself, will he? He’ll do it to save Draco.”\n#\n“And I’m going to believe anything you say why exactly?” Potter had his arms folded across his chest.\n“Because we’re on the same side,” Blaise said. “You do understand there are sides here, right? There’s his side, and they want us all dead?”\n“I’ve got the sides straight, thanks,” Harry said. “What I don’t understand is when you landed on ours.”\n“My mother got Draco away from him!” Blaise said.\n“Since when does Draco need to be rescued from Voldemort? His dad is one of them!” Harry snapped. “His aunt murdered Sirius!”\n“Potter, this conversation’s going to take a lot longer if you insist on pretending you don’t understand what’s going on with Draco,” Blaise said, doing his best to sound like Harry was an idiot who didn’t understand the basics as well as any child. That sort of thing always worked well on Muggle-raised wizards.\n“Er,” Harry said.\n“He’s an erosmancer! If You-Know-Who gets hold of him before he’s bonded, he’s going to spend the rest of his life being gang-raped in shifts so the Dark Lord can raise power on his back.”\nHarry stared at him in stark horror. “What?”\n“But nevermind, he deserves it because his family picked the wrong side for him to be born on, is that it? Right, sorry for bothering you,” and Blaise turned to walk away.\nHarry sprang after him and grabbed his arm. “No! That’s not—I didn’t know, all right!” He looked positively stricken. Mother was brilliant. “Stop assuming I understand this stuff and just tell me. You said—you got him away, he’s here, he’s safe, isn’t he?”\n“Oh, yeah, really safe,” Blaise said. “As long as Draco’s unbonded, he’s still vulnerable. Lucius and Narcissa are in hiding, but if You-Know-Who gets one of them—or if Crabbe and Goyle knock Draco over the head and drag him out to Hogsmeade one weekend—or if the Dark Lord manages to get enough of a Persuadable Potion imbued into a letter—”\n“Fine, I get it!” Harry said. “What d’you want me to do?”\nBlaise just stared at him.\nHarry stared back, obviously baffled. “What? I don’t know—”\n“‘I want to own you,’ and you don’t know?” Blaise said. Harry’s whole face flushed scarlet and just as quickly bled white again, that desperate hungry look flashing over him; he swallowed. “You’re the one, Potter. He wants to bond you! No accounting for taste, obviously.”\n“He—he doesn’t!” Harry said. “He hates me!”\nBlaise folded his arms and put on a deeply unimpressed expression. “Oh yes, he hates you loads, just like you hate him, right? It’s not at all like you’re lying awake at night wishing he was there.”\nHarry looked away, his mouth trembling. He shoved both his hands in his pockets. “That’s not—he did that to me! He was just fucking with my head,” he said, but he might as well have tacked on but please convince me otherwise to the end.\n“Ugh, you should know better,” Blaise said. “Have you slept through every Potions class about love philtres? You can’t make someone keep feeling something that isn’t real. Erosmancy’s about finding what’s there.” Fortunately, there was a lot there in any average person, and you could usually find something to work with as long as you were the least bit flexible, Mother liked to say. Not that Draco had needed to do a lot of digging in Harry’s case, obviously. “Anyway, it’s not like it’s an enormous secret that Draco’s mad for you. He’s been yanking your pigtails since we were eleven years old.”\nYanking on them hard enough to pull them out by the roots, but that could be glossed over, and by the startled look Potter gave, he was glossing away right now.\nBlaise went on, “After you spat in his face last night, he went straight to shagging his way through half of Slytherin House to try and pretend you didn’t make him miserable,” because no sense in letting Potter raise that point. “And if you suppose he told any of them that he wanted to own them, you’re right out.”\n“Oh,” Harry said in a stifled voice. He swallowed and looked away. “And—and if—I bond with him—he’d be safe?” Oh yes, completely ready to make the noble sacrifice.\n“From getting turned into a power supply, yes,” Blaise said. “You’d still be on the hook for actually beating You-Know-Who, though.” Which would be just the least bit easier once he’d bonded the strongest erosmancer in the bloody world, but that was far too sensible to work as an angle on Potter.\n“And—he really wants—”\nBlaise rolled his eyes. “Well not right this minute he doesn’t, after that performance you put on last night with your ‘I wouldn’t choose you if my life depended on it.’ He’s not getting over that anytime soon. You know him, Potter, he’s an egotistical bastard who thinks he’s Merlin’s gift and us lowly plebeians ought to be grateful to be blessed by his presence.”\n Harry eyed him. “Aren’t you supposed to be his friend?”\n“I am his friend,” Blaise said. “He’s clever and charming as hell when no one is sticking pins in his pride, not that you would know. But he can’t help how he was raised, and right now he’s not going to admit he wants you without instruments of torture involved. He might even let the Ministry ram some senior Auror down his throat, first.”\n#\nThe senior Auror showed up the very next morning—four of them, actually, and a grim-faced Scrimgeour at their head. They walked down the middle of the Great Hall, and Blaise was cautiously pleased to see Harry staring at them with worry and looking over at Draco, who was eyeing them narrowly at the same time: he’d got another letter that morning.\nThe Aurors closeted themselves with Dumbledore all morning, and one of them appeared in Potions class. “We’ll be needing Mr. Malfoy,” he said.\nDraco stiffened, and Snape said in a cold voice, “Will you. And where precisely is he needed?”\n“Headmaster’s office,” the Auror said. “Come along, boy.”\n“Mr. Malfoy,” Snape said to him, “a friend may go with you.”\nEvery Slytherin in the room turned to Draco, offering. Blaise leaned over through the crowd and hissed, “Take Potter!” Draco shot a startled look at him. “You know you can pull him if you have to, and Dumbledore won’t let them shut him up!” Draco darted his eyes at Harry, who was glaring at the Auror in the door with an expression Blaise could only call rabid jealousy. He jerked round and stared straight at Draco, like he felt Draco looking.\n“Potter,” Draco said out loud, staring back at him.\n“As if,” Hermione said, reaching out, but Harry shook her hand off his arm and stood up, somehow managing to look glad and nauseated with terror at the same time, and walked out with Draco without hesitation.\nThere really wasn’t any paying attention to classroom work after that. Blaise barely even bothered to try, yearning with his entire being to know what the hell was going on in Dumbledore’s office. It could work out either way. If Draco pulled Harry to stop them forcing him to bond, they’d probably tip over into bonding themselves, and if not, one of the Aurors might get him—but what if Dumbledore stopped it again? And he had no idea if Mother was with them or not. Ugh.\nFortunately, Snape never got the chance to inspect his potion. Ten minutes before the end of class, there was a boom of an explosion somewhere overhead, and the lights all trembled and dust came drifting down over their heads. Snape shot to his feet as everyone in the class yelled and started talking at once, and in the confusion, Blaise managed to slip out into the corridor. He ran upstairs to the corridor outside the Headmaster’s office, which was full of smoke and debris, and one of the Aurors came limping out covered in soot, helping Mother, who was a bit disheveled herself.\n“Blaise, darling, did you see them?” she asked.\n“Draco?” Blaise said.\n“And Harry,” Mother said. “Thank you, darling,” she said to the Auror, “perhaps you’ll go start looking? I’m very worried about those poor boys, please do let me know as soon as you’ve found them?”\n“Yes, of course,” the Auror said earnestly, and dashed off at once eager to impress, and Mother turned to him.\n“What happened?” Blaise said.\n“Dumbledore, of course!” Mother said in exasperation. “Come, we’d better start looking for them ourselves.” She shut her eyes and stood for a moment, reaching, and then she said, “This way.”\nThey headed off towards the Astronomy Tower. “Of course Scrimgeour meant to make Draco bond one of those Aurors on the spot,” she told him, as they ran, “and Harry promptly offered himself up instead—well done there, darling. Dumbledore immediately said he wasn’t having Draco pressured into any of it, but Scrimgeour, being a man of sense, told Albus that he didn’t care to have the son of a convicted Death Eater get himself trained up properly just to run off to serve You-Know-Who, and two of the Aurors took hold of him. They had a vial of Bottled Bewitchment.”\n“And Draco pulled Harry?” Blaise said hopefully.\n“If only,” Mother sighed. “He didn’t have a chance. Dumbledore knocked them all flat straightaway. Fortunately, that charming blond one you just saw landed close enough to me that I was able to shove him a good helping of power, and he got up and knocked Albus down in turn. But then Dumbledore’s pet phoenix screeched like a flight of banshees and exploded itself violently, flinging open the door, and Draco ran away at once with Harry right on his heels.\n“I would hope that they’ve found themselves a nice quiet corner to bond in, but we can certainly rely on Albus to interrupt them again if he finds them first—he dashed out after them immediately. He really hasn’t any excuse being so spry at his age,” she added bitterly.\nBut by then they’d got to the Astronomy Tower, and as they climbed up the first turn of the stairs, Blaise in alarm heard Draco snarling, “You think I need your pity? I don’t need you at all, any of you, not anymore. Voldemort’s sworn an Unbreakable Vow to my Aunt Bellatrix—if I go to him, he’ll let me finish my training. I won’t have to bond anyone at all. He’ll pardon my parents, raise us all back to his inner circle—”\n“Blaise,” Mother said quietly, looking up through the spiral of the stairs, “I’ll give you power. You’ll have to stun him. If you can knock him off the building…”\n“Mother!” Blaise said, feeling sick.\n“I know, darling. But he’s too powerful. We can’t let Voldemort have him.”\nBlaise swallowed hard. She was right, of course she was right, but—\n“Fine!” Harry shouted. “If that’s what you want, fine, go! Look, there’s the practice brooms, you can take one. If you’d rather run back to Voldemort and help him, when you know what he’d have done to you if he’d had the chance, what he’d do to anyone else—go ahead, I’m not going to stop you,” because he was a blithering idiot, obviously. “Who cares about you anyway, you miserable lying bastard—”\nBlaise crept up the spiral stairs on his mother’s heels. Harry and Draco were all the way up at the top, he could see them through the gaps of the viewing apparatus. Draco was standing right next to one of the open walls, his fists clenched and his face twisted in fury. “Not you, that’s certain,” Draco hissed. “Not Dumbledore. All of you hate me and my whole family, you always have! Two days ago you swore you wouldn’t come near me if your life depended on it. Why should I care about any of you!”\n“I reckon you shouldn’t,” Harry threw back savagely. “You should go help Voldemort kill Dumbledore, and me, and all of us who won’t bow down to the Death Eaters—and then you can get started on the real fun, throwing out all the Muggle-borns, murdering and torturing anyone who gets in your way, turning Muggles into slaves—sounds nice, does it? If that’s what you want, you’re right, I don’t care! I—I won’t care! You can just—” His voice cracked, and he stopped talking and turned away.\nDraco whirled away from him. He snatched one of the practice broomsticks off its rack and stalked to the open wall. Blaise shut his eyes as his mother put her hand on his shoulder, the power flowing into him, swelling. Draco was right at the edge. Hit him with a Stunning Spell right now, he’d topple right off. Blaise looked down. His hands were shaking. “My darling,” Mother whispered, her voice breaking. “I’m so sorry. It’s the only way I can keep you safe.”\nAnd it was the only way he could keep her safe. Voldemort would come after her right away—partly for vengeance, as soon as the Malfoys told him the whole story, and partly to make sure that she didn’t bond one of the Aurors herself, to help Dumbledore’s side. He took his wand out and started raising it.\nA hand abruptly seized his wrist, and Blaise jerked, staring right into Dumbledore’s stern, grim face. Mother stiffened. “Draco’s going to the Dark Lord!” she hissed desperately at Dumbledore. “Albus, don’t be a fool, you don’t know how strong he is! What that kind of power will let Voldemort do!”\n“That is true,” Dumbledore said quietly. “I only know what I will not let you do. Either to Draco, or to Blaise.”\n“Blaise will be killed!”\n“Esther,” Dumbledore said, almost gently, “there are worse things by far than dying.”\nMother straightened up, her eyes going solid white, and then she said, “Worse than watching your child die? Than—watching a sister die?” Dumbledore flinched hard, although he didn’t let go his grip on Blaise’s wrist. “Don’t you dare tell me to do it. Don’t you dare—”\n“Esther,” Dumbledore said, slowly, a twisting struggle on his face—Mother was pulling with everything she had, Blaise could tell. He didn’t know if he wanted her to succeed or not. He felt like crying. He looked up, desperately—\n“Mother!” he said, and Dumbledore shook his head free of the pull as she jerked and looked up.\nDraco hadn’t got on the broom. He’d turned round. Harry was leaning on one of the stone columns, his face buried in the crook of his arm against it, his shoulders bowed. Draco took a slow, jerking step towards him—and then another, and then he’d dropped the broom with a clatter and crossed the room to him. Harry pulled up out of his arm, tear-streaked, staring at him. “Draco?” he said, his voice cracking, and Draco said, “You’re an idiot, Potter,” just as brokenly, and they were kissing.\n “You didn’t go,” Harry gasped out. “You stayed.” \n“I told you I’d never leave you,” Draco said, which landed so squarely on Potter’s id that he let out a noise like a sob. Draco’s eyes were going silver again, and the star-viewer crystals up in the tower were catching the light and magnifying it, going so horribly bright that Blaise had to wince away from it until Dumbledore threw up a Dimming Veil between them and the apparatus. “I’m never going to leave you. You’re mine. Say it. Say you’re mine—”\n“I’m yours, I’m yours,” Harry said, descending straight to babbling. “Yes, please, Draco…”\nMother heaved an enormous sigh of relief and leaned against the railing. “Thank heavens,” she said, shakily, and then she shook herself and turned to Dumbledore, who was also looking up, a faintly sentimental expression on his face. “Well, Albus, I suppose you could try interfering again, but I’m fairly certain they’d knock you off the building at this point.”\nDumbledore sighed deeply himself and looked at her. “I see no reason to interfere now,” he said pointedly. “However, perhaps I should make alternate arrangements for the remainder of Draco’s training.”\n“For Merlin’s sake,” Mother said severely. “Anyone rational could see that now my incentive is to see him trained as well as possible. You Gryffindors are simply incomprehensible sometimes.”\n“Mother,” Blaise said, still feeling a bit shaky and also somewhat plaintive, “do you suppose we could go now? It’s getting a bit soppy in here.” Blaise had a lot of tolerance for listening in to people having ecstatic sexual experiences, and he wouldn’t have minded if they had just got right down to some enthusiastic fucking, but in between ripping each other’s clothing off they were also saying horribly saccharine things like I’m sorry, I didn’t mean it, I never meant any of it, you’re amazing, I want you, I love you, all of it right out loud, which was conveying far more than Blaise needed to know about their innermost desires, although he did highly approve of the bit where Harry swore I’ll disintegrate Voldemort before I ever let him lay a finger on you, even despite the way Draco cooed at him over it.\n“Yes of course, darling, you must need a cup of tea badly,” Mother said, putting her arm round his shoulders. Blaise leaned against her gratefully. “When I think that all this could’ve been settled peacefully and happily in exactly the same manner, three days ago.”\n“You must forgive me,” Dumbledore said dryly, as they left the tower. “I think there was a slight but crucial difference.”\nHe glanced up as they went out the door. Faintly from above Blaise heard Harry saying in fervent tones, “Oh God, Draco, yes, everything, yes, yes, yes.”\n# End"
}