{
    "id": "7637665",
    "url": "https://archiveofourown.org/works/7637665?view_full_work=true",
    "author": [
        "minverse"
    ],
    "title": "Inc.",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "방탄소년단 | Bangtan Boys | BTS"
    ],
    "relationships": [
        "Kim Seokjin | Jin/Min Yoongi | Suga",
        "Kim Taehyung | V/Park Jimin"
    ],
    "characters": [
        "Min Yoongi | Suga",
        "Kim Seokjin | Jin",
        "Jung Hoseok | J-Hope",
        "Kim Taehyung | V",
        "Park Jimin (BTS)",
        "Kim Namjoon | Rap Monster",
        "Jeon Jungkook"
    ],
    "additional_tags": [
        "Alternate Universe - Office",
        "Eventual Smut",
        "Eventual Nasty Smut",
        "Humor"
    ],
    "language": "English",
    "series": "",
    "published": "2016-07-31",
    "completed": "2016-09-18",
    "words": "43,001",
    "chapters": "6/6",
    "comments": "1,301",
    "kudos": "19,465",
    "bookmarks": "6,997",
    "hits": "334,787",
    "summary": "<p>Corporate Relationship Disclosure Form -- Human Resource Coordinator: Jung Hoseok<br><i>Section to be completed by Employees Involved:</i><br>Names: Min Yoongi, Kim Seokjin<br>Job Titles: Chief Accountant Supreme, Professional Wet Blanket<br>Nature of Relationship:<strike>Friends with Benefits </strike> Sex Enemies<br>Length of Relationship: 4 minutes<br><strike>Please Describe Jin's Dick: </strike> Shut up Hoseok I see you nasty fucker, you just added this fucking question to the form you didn’t even make sure the font was the same as the original you better hold on to your goddamn cat because I’m coming for you as soon as I’m finished getting- <i>oh fucking hell.</i></p>\n<p>In which Yoongi has a conversation with a human and really fucking regrets it.</p>\n<p>In which Namjoon creates a new fetish category on PornHub.</p>\n<p>In which Jin wishes he had never been born, or at least that he had never told Taehyung his birthday.</p>\n<p>In which everyone is going to shit glitter tomorrow.</p>\n<p>In which Jin gets further with a piece of pizza than Jungkook has ever gotten with a girl.</p>\n<p>In which how the fuck did everybody miss that?</p>",
    "notes": "<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>\n<a href=\"https://www.park-loins.tumblr.com\" rel=\"nofollow\">tumblr</a>\n</p>\n<p>((fyi in the course of my research which has made for a really colorful google search history, i have learned that oil-based lubricants like vaseline are not good for penetrative sex because they break down condoms and are generally just a mess and you should use a more specifically designed sex lube that is silicone or water based. their company sells something similar to vaseline, but like... i'm me and too many sex jokes to pass up bye))</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>Dude thank y'all for the awesome comments and kudos, like I myself am a corporate drone who works like 12 hour days and therefore may not have time to individually reply but I fucking love y'all. It makes me excited to post</p>\n<p>(sometimes I post lil tidbits of content early over on <a href=\"https://www.park-loins.tumblr.com\" rel=\"nofollow\">tumblr</a>)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>Sorry this took so long y'all. This is my least favorite chapter and I was just like meh on it for two whole weeks. But anyway all of y'all's comments are just giving me such immense pleasure, like one of these days I'm gonna sit my old dusty tired corporate ass down and reply to all of them, I'm so giddy over them. </p>\n<p>Anyway, Christmas Party shenanigans up next in ch 4!</p>\n<p>Come say hi on <a href=\"https://www.park-loins.tumblr.com\" rel=\"nofollow\">tumblr</a>)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>you really think i could resist the opportunity to reference the vmin leash incident?</p>\n<p>those of you here for the 'eventual nasty smut' tag.... stay tuned for ch 5... wink wonk</p>\n<p>\n<a href=\"https://www.park-loins.tumblr.com\" rel=\"nofollow\">tumblr</a>\n</p>\n<p>WARNING</p>\n<p>over the course of the 4,000 word smut scene that this chapter contains, you will find, to some degree, all of the following:</p>\n<p>rimming. angst. minor breathplay. (like quite minor. like... accidental)</p>\n<p>it's cool to skip it if it's not your thing bro!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">more notes</a>.)\n</p>\n<p>ANYWAY.</p>\n<p>Next chapter (last chapter), serving up hot: the Jammies. Team-Building Seminar. Resolution (????)</p>\n<p> <a href=\"https://www.park-loins.tumblr.com\" rel=\"nofollow\">tumblr</a></p>\n<p>Side note: Be very fucking careful with shit like breathplay! Communicate! During sex! Otherwise it can be dangerous! And unhealthy! Communication! Is key!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">notes</a>.)\n</p>\n<p>I feel like this fic was my baby but now it's all grown up and doesn't need me anymore. Anyway I hope y'all have enjoyed reading! I can't even tell you how much I have appreciated the comments and feedback, like I'm gonna go back and reply to all of them in due time when I get some time outside of the cube. </p>\n<p>If you wanna make my grey little cube-y days a bit brighter, drop me a comment about your favorite parts or what you want to see in upcoming fics!</p>\n<p>And as always come say hey on <a href=\"https://www.park-loins.tumblr.com\" rel=\"nofollow\">tumblr</a> or <a href=\"https://twitter.com/loinzilla\" rel=\"nofollow\">twitter</a>.</p>",
    "text": "There is a sour, stabbing ache somewhere above his left eyebrow, the kind of ache he only really gets when he’s had too much coffee on an empty stomach. The shrill ringing of a phone crawls unpleasantly beneath the surface of his skin. He physically swallows down the urge to rip Hoseok’s phone from the wall and chuck it out the office window, watching with joy as it plummets through the air, down three stories before crashing with a with a satisfying bang into the top of Namjoon’s shiny new Lexus.\nIt’s a Monday.\n“Team meeting,” Namjoon’s deep, groggy voice croaks out over the top of the small sea of cubicles.\nHe is met with a general chorus of discontented groans that grumble up from all around the large, divided room and merge into one collective ‘No.’\n“I brought donuts.”\nThe shift in the atmosphere is disconcerting. There is a clattering of rolling wheels and shifting papers, followed shortly by a dull thud that Yoongi recognizes as the sound of a body hitting a flimsy cubicle wall. The surface of his coffee vibrates warningly.\n“Ouch, fucking watch it, Tae,” Jimin whines from nearby.\nYoongi heaves a bracing breath, pushing himself up unwillingly from his chair and watching the blur that is Taehyung as he races past the entrance of his cubicle. Yoongi, however, takes his time, meandering down the aisle in a leisurely fashion, taking the opportunity to observe the cheap, grey carpet as his feet shuffle unenthusiastically over its dull surface.\nWhen he finally steps into the conference room, he is greeted with the backs of his co-workers as they jostle for position around the small, shaky table in the corner. Jungkook crawls out from between Hoseok’s legs, hands full of donuts, with one more trapped between his rather large front teeth for good measure.\nJimin and Taehyung have long since emerged triumphant, already settled into two chairs in the corner. Yoongi watches with disgust as Taehyung licks the donut filling from finger of an unconcerned Jimin. Yoongi rolls his eyes and plops himself down into a seat on the opposite side of the room.\n“Donut?” Hoseok offers him as he approaches, far too chipper for 9:00am, as always.\nYoongi cringes at the thought of sugar in his raw stomach, and the movement causes the sharp sting in his head to flare up painfully. “No thanks.” Hoseok shrugs and takes a seat next to him. “What do you think this is all about, anyway? We haven’t had a Monday meeting since…”\n“Since the last incident, I know,” Hoseok replies, his cheerful face suddenly a little grim. “Do you think they did something else?” He jerks his head towards the corner of the room, where the three youngest are giggling at something on Jungkook’s phone and apparently taking notes. \n“I feel like we would know,” Yoongi reasons, brushing out a few errant wrinkles in his pants.\nHoseok seems a little lost in his thoughts, and the frightened distance in his eyes tells Yoongi that he’s probably neck-deep in a flashback. “Yeah, we would know.”\n“Okay, sit down everybody. I appreciate your team spirit, Jimin, but we’ve been over this, Taehyung is not a chair.” Namjoon takes his place at the head of the table, straightening his glasses, which Yoongi happens to know are just for show. “So you’re all probably wondering why we’re here.”\n“If this is about the dumpster cat…” Taehyung pipes up from the corner.\nNamjoon’s face goes a little slack. “I’m sorry, what?”\nJimin elbows him hard, and Taehyung’s mouth snaps shut with a comical click, eyes bulging. “Nothing. There’s no pregnant dumpster cat.”\nNamjoon stares at them blankly, looking quite defeated, moving only to rub his temples in frustration. His glasses go a little askew. “Nope. Not today,” he finally decides, muttering it more to himself than to anyone else. He clears his throat and continues as if nothing has happened. “So I got a message from Corporate. According to them, our branch is falling a little behind, so they’re sending in someone from the corporate office to oversee us for a while.”\n“What? Why?” Taehyung demands, brow furrowed. “Our sales are awesome. Jimin and I tear that shit up.”\n“Yes, good, let’s explore that,” Namjoon chuckles with false enthusiasm, and Yoongi notes the change in his gaze, the increased intensity. “Why would Corporate feel the need to throw a wrench into the workings of a beautifully functioning branch? Well, I would posit that we live in a heartless currency-driven world run by bourgeois pigs who are so desperate for an extra buck they’d fuck their own-”\n“Dude,” Hoseok gently reminds him, shaking his head almost imperceptibly. But Jungkook smirks and covertly raises his fist in solidarity.\nNamjoon sighs heavily, his eyes still hard and his mouth a tight line. “Because they want to trim costs and increase efficiency.”\n“I don’t want some old corporate geezer cramping our style,” Taehyung pouts from the corner. “What if he takes away casual Fridays? Or commando Wednesdays?”\nJimin elbows him again, hard, and Taehyung’s breath actually comes whooshing gently from between his lips. “That one’s not office-official, asshole,” Jimin hisses at him in what he apparently thinks is a quiet voice.\n“Look, I know it’s not ideal,” Namjoon presses on, ignoring the exchange. “But we don’t really have a choice here. And if you want to keep your jobs, you’ll keep the oil-based personal lubricant out of it.” He directs his words to the corner of the room, where the three youngest had been whispering conspiratorially. Taehyung looks falsely affronted, hand over his chest and eyes innocent.\n“What about-“ Jungkook begins to say, but Namjoon cuts him off with a growl of frustration.\n“Silicone and water-based personal lubricants are similarly banned.”\n“Well there goes the break-room slip-and-slide,” Taehyung mumbles discontentedly.\n“What’s the point of working for a company that sells lube if we can’t even play with it?” Jimin pouts.\n“Well, Jimin,” Namjoon replies calmly, but his gaze is unfocused, dead. “You are here to make money in exchange for your labor. It is called a job. Furthermore, we’ve been over this. This company sells a wide variety of personal hygiene items, including, but not limited to, a personal lubricating ointment that can be used for anything from dry skin to-”\n“Buttsex,” Jungkook provides helpfully.\nNamjoon takes a very deep breath and seems to physically swallow his words, keeping his face carefully neutral.\n“When’s he coming?” Hoseok asks from beside Yoongi. “The corporate guy?”\nNamjoon hesitates, eyes flicking guiltily away. “Today.”\n“What?” Jimin demands, looking slightly panicked. Taehyung leans over to whisper in his ear, and Jimin nods fervently.\n“May I please be excused?” Taehyung asks with a strange, stilted politeness that reeks of desperation.\n“We’re in the middle of a goddamn meeting, Tae. Why?”\n“I need to… attend to some things. Immediately,” he responds evasively, leg jiggling anxiously like he’s revving his engine, ready to bolt.\nNamjoon stares at the pair of them as they do their absolute damndest to look angelic. “You know, I don’t even want to know. Go.” Taehyung mutters a quick thanks and darts out of the room in another vaguely Taehyung-shaped blur. “And hurry, he’ll be here any minute,” Namjoon shouts after him before turning back to address everyone else once more. “Okay, look guys. I’m going to need somebody to cater to his every need. Kiss his ass. Convince him that everything is great, and get him out of our hair.”\n“Not it!” Hoseok jumps in, slightly too loud. “Just because I’m Human Resources doesn’t mean I’m the goddamn welcome committee. I am not paid to kiss ass.”\n“You’re the office director, Namjoon. Why don’t you kiss his ass?” Jimin asks, eyes darting nervously to the door like the intruder might pop in at any moment.\n“It’s a matter of principle,” Namjoon argues, turning up his nose very slightly. “I will not be a facilitator of corporate greed.”\nYoongi exhales very hard though his nose in a semblance of a laugh. “You do realize you’re like, a vital cog in the capitalist machinery that you so loathe, right?”\n“And thank you for volunteering, Yoongi,” Namjoon says with a light smile, scribbling something down on the paper in front of him.\n“No,” Yoongi says simply, his spine going rigid in indignation.  “I will not.\"\n\"Min....Yoongi... On-boarding Buddy,\" Namjoon mutters as he writes. When he's finished, he looks up at Yoongi with an innocent, dimpled smile.\n\"On-boarding Buddy?\" Yoongi balks in disdain, \"Look, I take it back. I'm sorry! You're a... victim of a rigged society. A true champion of the worker.\"\nNamjoon chuckles. \"Sorry, buddy. I'm just fucking with you,\" and Yoongi relaxes just slightly. \"I actually chose you for this long before now.\"\n\"Me?! Why?\"\n\"Because you two are already going to be working together on the budget and everything. It makes sense.\"\n\"I won't do it,\" Yoongi refuses point-blank, crossing his arms.\n“If you don’t, I’m going to move your cubicle between Jimin’s and Taehyung’s again.”\nYoongi blanches, mouth falling open as he leans forward in his chair. “You’re bluffing.”\n“Try me,” Namjoon declares bravely. “You can say goodbye to their isolation corner.”\n“Hey, you said that was a special-super-awesome-sales-team-only corner,” Jimin protests, jumping to his feet. “What the hell?”\n“It is, it is,” Namjoon assuages him with an appeasing expression, “Of course it is.”\nYoongi’s about to protest further, but the door to the meeting room bursts open, bouncing several times against the wall as a sweaty Taehyung pokes his head inside, eyes desperate.\n“Jimin, Garbage is crowning!”\nThere’s a moment of confused silence where everyone seems to be trying to figure out exactly what they heard.\n“What is what?” Yoongi demands, puncturing the quiet, but Jimin has already disappeared out of the door behind Taehyung. \n“Five bucks says it’s Dumpster Cat.” Hoseok says, pushing himself wearily to his feet as Namjoon bangs his head gently against the table. “Keep up, dude. You’re a little slow today. I think we’re about to witness a live cat birth.”\n“I’ve already seen two live cat births thanks to Kim Taehyung,” Yoongi says distastefully. “I’m just gonna take my smoke break.”\n“Suit yourself. Do you want me to save you a kitten?”\nYoongi scoffs, pulling a disgusted and incredulous face as he slips on his jacket. “Of course I do not want you to save me a fucking kitten.”\nHoseok fixes him with an incredulous stare, and Yoongi relents.\n“God, Hoseok, yes obviously save me a kitten. Shut up,” he half-whispers, exasperated. Hoseok smiles knowingly and jogs lightly from the room to catch up with the others.\nThe smoking patio is a small deck on the third floor. It is completely exposed to the cold, harsh wind, uncovered and so cramped that Yoongi often finds himself rubbing elbows with workers from all over the building, different companies, different offices. So when he sees a new face, hunched over the railing and looking down at the parking lot below, it’s nothing unusual. Yoongi sees new faces all the time.\nThe only unusual thing is that Yoongi usually doesn’t care if he ever sees those faces again, definitely does not want to see them every day for the rest of forever, or perhaps in some really inappropriate dream-type situations. But there’s a first time for everything.\nIt’s the kind of face you might see on billboards or buses or cereal boxes, and seeing it in real life is a little jarring and a lot weird. He’s soft, almost strangely so, his features opulent and curving but delicate, except for his eyebrows, two dark, straight slashes beneath a fine, smooth forehead.  He’s exquisitely lovely in the morning light, little golden rays criss-crossing behind his figure, looking so casually, effortlessly handsome that it’s actually kind of fucking annoying.\nYoongi clears his throat and swaggers over to the balcony, trying to look as utterly bored as possible while simultaneously putting the maximum amount of distance between them. He pulls out his lighter and a cigarette with nervous hands, cursing inwardly, because his lighter has of course chosen this very inconvenient moment to die.\n“Need a light?”\nYoongi resists the urge to flee, because yep that beautiful guy is talking to him. Looking him. Reaching forward, expensive silver lighter in hand, towards him. Yoongi briefly considers turning him down, but the prospect of continuing to make a fool of himself with his own damn lighter urges him to nod, small and silent. The guy smiles and leans closer yet, flicking on the lighter with practiced ease. As soon as his cigarette has caught, Yoongi is leaning away, nodding in acknowledgement.\n“Thanks,” he grunts shortly, and god damn it he sounds like a cave man.\n“My pleasure,” the guy replies, pocketing his lighter and smiling in a way that has Yoongi shifting nervously and looking away. “Good thing I was here, eh? This place is deserted. I guess it’s a little early for a smoke break.”\nYoongi raises his eyebrow as flicks the ashes from the end of his cigarette, hoping that the pause he takes as he mentally prepares himself to sound casual comes across as relaxed. “There is currently a cat giving birth in a file cabinet upstairs. It wouldn’t be too early for a drink.”\n“Your boss is okay with that? The uh… cat birth?” asks the guy, perfectly tailored suit sitting sinfully well on his wide shoulders. He looks frightfully out of place in this frumpy hellhole of a building, where most guys can’t even be bothered to tuck in their cheap, ill-fitting dress shirts.\nMust work for that law firm on the fifth floor.\n“How do you know I’m not the boss?” Yoongi demands, straightening himself up to his full height. His nose bobs proudly just above the guy’s shoulder.\nThe man raises his eyebrows skeptically. “You don’t seem like a boss.”\nYoongi shrugs, once again flicking the ashes off of the end of his cigarette without taking a puff. “Fair. You couldn’t pay me enough to be the boss of those assholes, anyway. Namjoon’s already going a little gray.”\nThose striking, straight eyebrows curve upwards a little in surprise. “Kim Namjoon?”\n“The one and only,” Yoongi confirms. He’s not surprised. Everyone in the building knows about their office. They know, and they keep their distance.\n“Sounds like you all have an interesting office dynamic,” the man says with a wry smile.\nYoongi just shrugs again, stealing a glance from the corner of his eye. The guy’s looking at him kind of intensely, and it stirs his already sensitive stomach with an added dose of anxiety. He nervously shakes his hair from his eyes and tucks his head silently.\n“You guys ever get any work done? You know, between litters?”\n“We do okay. Obviously not good enough for those jerk-offs at corporate, but we do okay,” Yoongi replies, his voice laced with a lazy, simmering spite. He doesn’t know why he’s saying a goddamn thing about it, except that he just kind of wants this guy to keep talking to him. The man straightens up beside him.\n“Oh?”\nYoongi hesitates for only a moment, taken off guard by his own loose lips. “They’re sending in a fucking baby-sitter to tell us how to do our jobs.”\n“Ah, an efficiency expert?”\nYoongi glares a little at nothing in particular. “A professional wet blanket.”\n“How’s that going over? In the office?”\n“That bastard’s gonna have his work cut out for him.” Yoongi gives a short, satisfied laugh at the thought.\n“How so?”\nYoongi considers carefully for a moment. “You know how back in school, people would always try and pull shit on substitute teachers? Tell them the wrong names and put thumbtacks on their chairs and try to get away with murder by claiming that their regular teacher usually lets them do it?”\n“Yeah?” the guy prompts him, his lovely features arranged into an almost comical expression of disbelief.\n“Imagine that, plus lube.”\n“Lube?” the man asks, looking clearly convinced that he had heard wrongly.\n“Industrial-sized containers of lube.” Yoongi makes sure to maintain intense eye contact and really emphasize the word lube, but the guy looks strangely unshaken. “I mean, it probably doesn’t hurt that we sell it and so they have pretty consistent access to the product. But I think you would be surprised how many separate and unrelated lube-based incidents it is possible to have in one workplace.”\n“I daren’t even guess,” the guy says with an amused smile.\n“Seven,” Yoongi informs him. “Seven independent lube incidents. All different.”\n“Impressive,” he admits, and Yoongi just now notices that he’s not even smoking. “That must take some creativity.”\n“You have no idea.”\n“Wait, wait. Let me try,” the guy offers, not missing a beat, biting his beautiful plump lower lip in careful though. “You’ve gotta have the classic lubed doorknobs and lubed toilet seats.” He pauses for a moment, scanning Yoongi’s face before continuing. “Judging by your expression, it was you who went for a little swim courtesy of that one.”\nYoongi makes a noise of incredulous outrage.\n“And I’m assuming there’s been some kind of lube wrestling incident. Another classic, both sexy and ridiculous, and extremely work inappropriate. That one’s easy, though. How about… lube in the soap dispensers. Gross and unexpected. OH. Slip and slide. Duh.”\nIt’s like he’s reading straight from the damn incident reports themselves, and by the time he finishes, Yoongi is looking at him like he has just seen a horse with three dicks. He is also slightly in love and rather distraught about it. “Who are you?”\n“I’m Kim Seokjin,” the man introduced himself, extending his hand. Yoongi takes it hesitantly, halfway convinced that he never woke up this morning, that he’s still dreaming, that he’s not actually living this weird fucking day.\n“Uh huh,” Yoongi replies vaguely and skeptically, face incredulous even as his heart gallops away at breakneck speed. Seokjin smiles at him then, and he knows he’s dreaming, floating away into the nothingness above him. But then he realizes how sweaty his hand is in Seokjin’s grip, and nope, he’s definitely awake. He wrenches his hand away abruptly.\n“What’s your name?”\n“Yoongi,” he responds uncertainly, appraising Seokjin through apprehensive, narrowed eyes. He’s still not really sure that any of this is real.\n“It’s a pleasure to meet you, Yoongi.”\n“Yeah, it’s definitely… a thing.”\n“Anyway, don’t you feel kinda bad for this poor guy? This efficiency expert?” Seokjin continues. “Isn’t he just doing his job?”\n“Eh, he probably goes around laying off innocent old grandmas and slashing vital funds from budgets and jizzing himself over his little power trip. He gets paid to have a stick up his ass.”\n“Good thing you guys sell lube.”\nYoongi cracks a small smile despite himself, extinguishing his cigarette on the railing without having taken a single drag. “The point is, he probably deserves what’s coming to him.”\n“Probably,” Seokjin allows with a small, wry smile. “Well, I’m actually kind of late, so I’ve got to get going. But hey, give him hell. I’ll see you around?” Seokjin’s smile is far too self-satisfied, and Yoongi’s stomach bubbles in annoyance again.\n“Maybe.”  If there is a God.\nYoongi would be a little sorry to see him go, if the back view wasn’t so excellent. He cranes his head as Seokjin retreats back into the building, and Yoongi would like the shake the hand of the tailor that sculpted those pants around that ass.\nHis mind is still wandering when he arrives back upstairs. It’s so rare that Yoongi is even remotely interested in someone that he feels like he’s in college again. Back then, it had been Taehyung, before he’d actually gotten know Taehyung. Thank God he’d actually gotten to know Taehyung.\nJust inside the door of their office, he meets Hoseok on his way out of the bathroom, wiping his hands on his pants with a sickened look on his face.\n“I swear there’s still lube residue in those soap dispensers. I’m all slippery,” Hoseok grumbles, furiously rubbing his right hand against the fabric on his ass. “And right when the guy from corporate gets here, too. Fuck.”\n“He’s here?” Yoongi questions, trying to peer around the corner into the conference room, from which a soft but excited buzz is emanating.\nHoseok opens his mouth to respond, but he is interrupted by Taehyung, barreling out into the hallway and grasping desperately onto the sleeves of Yoongi’s shirt. He takes a few steadying breaths before he can manage to speak. “He’s… so… hot.”\nIt’s that feeling he used to get when the bell rang for class and he realized he had homework the night before. When he remembered that rent was due 6 days ago. When he let his mom borrow his computer and suddenly realized that he never closed out of his porn.\nHe sees the look in Tae’s eyes. He guesses it was a little something like the look in his own just a few minutes ago, down on the smoking balcony.\n“Really?” Hoseok asks, clearly surprised. Yoongi swallows down the vomit that he feels bubbling up in his throat. “How hot?”\n“So… hot,” Taehyung emphasizes. “Not old at all. Michelangelo’s David, but with better hair and probably a bigger dick. No, definitely a bigger dick. Those pants…”\nYoongi’s seen too many bad rom-coms, been dragged to too movie nights at Jimin and Taehyung’s place to not know what happens next.\nAnd so he emerges, every part the David 2.0 that Taehyung had described, looking even taller and broader than before with his arm slung around Jimin’s tiny shoulders. They’re laughing.\n“I take back everything I said,” Hoseok mutters to Yoongi, jaw slack as he stares at the approaching pair. “I would pay good fucking money to kiss that ass.”\n“I didn’t know you were into dudes,” Taehyung says quizzically.\n“I didn’t either, but I would let him bend me over a desk and make a strong argument for it.”\n“You’re like 2 seconds from having to file a Human Resources violation against yourself.” Taehyung informs Hoseok helpfully. “Again.”\n“Worth it,” Hoseok assures him, quiet now that Seokjin and Jimin are approaching. Jimin looks positively gleeful.  Yoongi would normally take this opportunity to roll his eyes, but at the present moment, they are locked unwaveringly on Kim Seokjin, who is looking right back at him, just as smug as the movies suggest that he should be.\n“This is Hoseok, our HR guy,” Jimin informs Seokjin as they come to a stop in front of where they are gathered. “An interesting choice on Namjoon’s part, if you ask me.”\n“Good thing nobody asked you,” Hoseok growls, before flashing a small smile over at Seokjin.\n“And this is Yoongi,” Jimin continues like he hasn’t heard him. “He’s our… entire accounting department, actually. Yoongi, this is Kim Seokjin, from Corporate.”\n“Hello Kim Seokjin from Corporate,” Yoongi growls lowly, and Jimin’s eyes bug slightly in response to the venom in his voice.\n“You can just call me Jin. And it’s a pleasure to see you again so soon, Yoongi.”\n “Again?” Taehyung prompts him, brows furrowed in confusion “So soon?”\n“We met downstairs just now. Yoongi gave me a little run-down of the branch.”\n“You what?” Taehyung demands, spinning to face Yoongi.\n“This is what I get,” Yoongi mutters emotionlessly, fingers massaging gently at his temples. “The one time I speak to a person.”\n“He was extremely helpful,” Jin assures them. “Very welcoming.”\nTaehyung and Jimin stare at Jin blankly for a moment before Jimin speaks. “Who was?”\n“Yoongi.”\n“Yoongi was what?” Taehyung demands, obvious confused.\n“Extremely helpful and very welcoming,” Jin reiterates.\n“Who was?” Jimin repeats, and Yoongi is mentally banging his head against the file cabinet.\n“Yoongi was.”\n“Yoongi was what?” Jimin asks quizzically.\n“I can’t tell if you guys are serious or not,” Jin admits, backing away slightly.\n“That’s a skill that comes with time,” Hoseok informs him off-handedly. “But sorry, actually can we go back to the part about Yoongi being helpful and welcoming?”\n“Yeah, you know,” Jin starts, eyes sparkling impishly and gloriously in the ugly florescent light, “I was kind of nervous about coming in here and inserting myself abruptly into the situation, but I think Yoongi really… lubricated this whole transition for me, prepped me well for my entrance to this branch.”\nJimin subtly elbows a snorting Taehyung subtly at the word ‘lubricated,’ and Yoongi blanches a little. Jin’s eyes are sparkling gleefully.\n“What can I say? I’m a considerate guy,” Yoongi confirms, tight-lipped as he stares intently, warningly at Jin. He can feel Hoseok silently questioning him through his gaze.\n“This job can be rough, you know,” Jin continues, and he sounds like he’s having way too much fun. “I usually meet a lot of resistance, have to work my way into things slowly and carefully. And I’m always worried that it won’t be a good fit, that it’ll be a painful adjustment. But thanks to Yoongi, this whole thing has been a very pleasurable experience. I think I’m going to be able to slide right in.”\nJimin and Taehyung glance back and forth between the two of them, between Jin’s charming, easy smile and Yoongi’s carefully blank expression, which very nearly succeeds in hiding his massive unease.\n“This is weird. This got weird. We’re gonna go,” Taehyung tells them very clearly, tugging Jimin away. When Hoseok doesn’t move to leave, Taehyung adds, “Aren’t you coming?”\n“I think I’m gonna stay and see how this plays out,” Hoseok replies slowly, gaze still trained on Jin’s face. Hoseok is appraising him very carefully, eyes squinted in consideration. “You have… quite a way with words, Seokjin.”\n“You’re literally the worst HR guy ever,” Taehyung informs him as his own hand wanders down to gently cup Jimin’s butt to usher him away. They all hear a door click shut down the hall a few moments later.\n“He’s joking,” Hoseok assures Jin with an oily smile. “We joke because we’re close.”\n“Hoseok, come help me with these damn cats!” Namjoon’s desperate voice comes from down the hall. “I can’t find Jimin and Taehyung.”\n“They just walked your way less than 10 seconds ago,” Hoseok shouts right back. “There is absolutely no way you could have missed them, unless they’re in the supply closet.” He pauses for a moment “Actually, they’re probably in the supply closet. They’ve been taking inventory of the sample stock a lot in there lately, like twice a day. Which is weird, because that’s not even their job.”\n“Just get your ass in here!” Namjoon’s voice cracks mid-shout. \n“Fine,” Hoseok grumbles, face brightening a little when he turns to Yoongi. “Don’t worry, I saved you the best cat, Yoongi. Garbage’s favorite. It’s got a heart-shaped patch of white fur around its asshole and it keeps trying to smother its siblings with its body. I call her Murderer.”\n“You guys are very literal with the names, aren’t you?” Jin offers quietly.\nHoseok bursts out into obviously fake laughter and slaps Jin gleefully on the back, and Yoongi rolls his eyes so hard that it hurts. Hoseok’s laughter ceases abruptly as his hand comes to rest on Seokjin’s upper arm, gripping it tightly. “Oh, you work out, don’t you?\n“HOSEOK.” Namjoon’s voice reverberates down the hallway.\n“FINE,” Hoseok screams so loudly that he startles Yoongi and Jin slightly, storming down the hallway after one last lingering look at Jin, leaving the two of them standing there, simmering in their strange tension.\n“You. Bastard,” Yoongi spits bitterly once Hoseok is out of sight, “What the hell are you trying to do?”\n“Oh come on, I was just messing around. I didn’t even tell them anything you said. No harm done.”\n“No harm done??” Yoongi demands, exploding in indignation. “Not only has my reputation been permanently marred by this ‘helpful and welcoming’ bullshit, but there is no earthly way that they didn’t catch those very thinly veiled lube allusions. They have to know I warned you. I am an informant. A traitor to my own.”\nJin just smiles indulgently. “You’re cute.”\nYoongi gapes indignantly. “I am NO such thing.”\n“Hey seriously though,” Jin continues like Yoongi hasn’t spoken, “I owe you for the heads-up. I adjusted my initial approach based on everything you told me, and I think it worked. I think the guys are cool.”\n“I cannot believe you purposefully extracted information from me,” Yoongi pouts.\n“You were pretty damn talkative on all on your own.”\nYoongi splutters in outrage, ears hot. “Only because you were so-…” He breaks off abruptly, tugging his jacket tight around himself, and Jin bites back an amused giggle, pursing his lip to keep from smiling. “I feel violated.”\n“Don’t be dramatic. Look, the opportunity basically fell into my lap. You would have done the same thing.”\n“I think you’re my enemy now. I’ve never had an enemy before,” Yoongi ponders aloud.\n“So you’re not gonna go the ‘don’t be dramatic,’ route. Noted.”\nJust then, a flustered-looking Namjoon emerges from the breakroom, scrubbing violently at a spot on his shirt.\n“YOUR cat pissed on me,” he jabs an accusatory finger at Yoongi.\n“I haven’t even met my cat,” Yoongi mutters defensively.\n“I can’t believe those two assholes ditched me after they caused this whole mess. Do you know that cat’s been living here for a month? It looks like the isolation corner backfired. Too much privacy. I’m getting rid of their cubicles altogether.”\n“If you think a lack of walls will alter their behavior at all, you clearly haven’t met them,” Yoongi tells him as he heaves a deep sigh.\n“Oh, speaking of cubicles…” Namjoon starts, and Yoongi knows it’s bad news by the tightness of his voice and the way he’s avoiding eye contact.\n  \n \n Yoongi sits moodily in his chair Tuesday, arms crossed, glaring hard at nothing in particular as Jungkook carefully works on removing Yoongi’s computer and phone from his old cubicle.\n“Jesus Yoongi, don’t look so fucking wounded,” comes Hoseok’s voice from over his cubicle wall. Yoongi knows that if he turned his head, he would see a the top of Hoseok’s head bobbing up over the grayish padded panel. “Boo hoo, you have to move cubes to go and sit beside the most beautiful human being that has ever existed. I’m so fucking sorry.”\n“He’s my sworn enemy,” Yoongi mutters. “How dare he. Nobody pulls that shit on me.”\n“You’re such a baby. All he did was listen to your whiny, lust-motivated rambling, and now you've transformed into every part the enraged toddler that your size and general appearance have always suggested that you are.”\n“YOU are supposed to be on MY side,” Yoongi exclaims in outrage, straightening up from his slumped position in his chair.\n“I’ve always been on your side,” Hoseok assures him, “Up until now. I’m very sorry. I think I understand the Trojan War now.”\n“Why is there a pillow back here?” comes Jungkook’s slightly muffed voice from where he is bent underneath Yoongi’s desk, only his backside visible. Yoongi resists the urge to give it a swift kick. “Holy shit, there’s a whole little nest. Do you sleep under here?”\nYoongi ignores him. “He’s taken you all in with his good looks and his sparkling personality and his homemade scones, but one day you will realize. And by then it’ll be too late. You’ll find me in the supply closet, drowned. In the lube.”\n“People think you’re so chill, but you are like the least chill person I know. And I work in this office.”\n“Fuck you.”\nHis new cube is in what used to be Jimin and Taehyung’s special corner, the entrance directly across from the entrance of Jin’s soon-to-be work area. If he peeks up over the edge of his wall, he can see the resident troublemakers’ new place of residence, two desks smack dab in the middle of the room, completely exposed to the rest of the office. As Yoongi suspected, they seem utterly unconcerned by this new lack of privacy. Jimin sits casually on his desk as Taehyung feeds him what seems to be cold spaghetti with his fingers.\n“How long have they been a thing?”\nYoongi doesn’t turn to greet him but keeps his eyes trained on the pair in front of him. “What?”\n“Jimin and Taehyung. How have they been together?”\nYoongi spares him a disgusted look. Jin’s hands are full with a box of his things. Yoongi looks away, doing his best to appear utterly bored. “What are you talking about? They’re not.”\nTaehyung lifts one end of a noodle to his mouth and sets the other end between Jimin’s lips, inching closer and closer as they both nibble towards the center.\n“What are YOU talking about?” Jin demands. “They’re like Lady and the Tramp over there. ‘A Thing’ if I ever saw one.”\n“They’re just close. Everybody knows that.”\n“Okay so what do you call that?” Jin asks, gesturing with his head to the brofest.\n“Teambuilding.”\n“How is this shit even allowed?” Jin wonders aloud, setting wandering over to his cube and setting his box down on the desk.\n“Our HR guy is Hoseok.”\n“This is the weirdest place they’ve ever sent me. And one of the sales reps at my last place made me a doll of myself with my own hair,” he mutters, only his head visible over the partial wall. “But you know what? I was taking a look at the numbers, and the sales are insanely good. I don’t know how Jimin and Taehyung do it, honestly. How is this branch not rolling in it?”\n“If we knew that, you wouldn’t be here, would you?” Yoongi busies himself with a spreadsheet that he finished two days ago, but he can still feel Jin’s eyes on his face.\n“Hey-uh,” Jin starts, voice suddenly unnaturally high, “I’m really sorry we got off on the wrong foot.”\nYoongi’s head jerks in Jin’s direction instinctively. “What?”\n“I should have told you who I was. What I did was shady. Hilarious but shady.”\nYoongi glares hard at his computer screen, ready to neither accept nor reject the apology. “How long are you here for anyway?”\n“Two months? Three months? Maybe longer. This place is kind of a mess. Depends on how fast we work.”\n“Interesting. Very interesting.”\nYoongi’s eyebrows crumple in confusion, because neither of them have spoken. There is a moment of silence before Yoongi jumps in shock as he sees the two pairs of impish eyes staring back at him from over his cubicle wall.\n“What the hell? Where did you guys come from?” Yoongi demands, doing his best not to sound out of breath.\n“We were done with lunch,” Jimin says simply.\n“So what you’re saying, Jin,” Taehyung jumps in, voice dripping with mischievousness, “is that the slower you two get shit done, the longer you’re here? Working with Yoongi?”\n“Uh, yeah? I guess?” Jin confirms uncertainly, leaning against his and Yoongi’s shared wall.\n“Interesting… very interesting,” Taehyung repeats, and Jimin accompanying giggle is disturbingly amused.\nThe blood drains from Yoongi’s face so rapidly that he actually feels it happening. “Don’t...” he manages weakly.\n“Veryyyy interesting,” Jimin seconds with a vicious, serrated giggle.\nYoongi knows that the more he fights, the more likely they are to latch onto whatever idea they’re cooking up this time, to dig their heels in unrelentingly.\n“Will you two just go away? Don’t you have kittens to be tending or something?” Yoongi says as calmly as he is able. They can smell fear.\n“Garbage is a wonderful mother. She doesn’t need our help. Plus, we need to allow her time to bond with her children,” Taehyung informs him coolly. “Murderer is still trying to smother her siblings, though. You should really speak to her about that.”\n“Is that cat, by chance, still on company premises?” Jin casually inquires.\n“Whaaaaaaat?” Jimin asks with a stiff, cheesy smile, waving off Jin’s question with a dismissive hand. “Pfffft.”\n“So… no?” Jin tries to clarify.\nJimin’s smile flickers for just the briefest second before it’s back, brighter than ever. “Whaaaaaaaaat?”\n“That means no, right?” Jin asks, slightly more forceful this time.\n“Bye,” Jimin says abruptly, ducking below the cubicle wall and disappearing from sight. Taehyung is gone just a moment later.\n“What is this… this, like, heavy, foreboding feeling in my stomach?” Jin mutters, craning his head to try and get a view of their fleeing figures.\n“Dread?” Yoongi supplies for him. “Oh yeah, you’ll get used to that.”\n“Can you please explain to me how the company managed to spend $1300 last year on the website adamandeve.com?”\nYoongi leans over to get a look at the expense report, careful to preserve a certain distance between them, pointedly ignoring the enticing smell of freshly-baked pastries that is emanating from Jin. “This says it was for ‘team building.’ Checked out to me.”\n“What is it with you guys and ‘team building’?” Jin mumbles, tossing the paper aside carelessly and plucking up another. “Jesus. Okay,” he clears his throat, scooting his chair closer to Yoongi, who stiffens and leans as far away as he can. “A potato gun. Seriously?”\n“If you’ll look, that one is marked under ‘company security.’”\n“And how is that working out for you guys?”\n“Great,” Yoongi assures him, “Just last month, Jungkook almost nailed this stray raccoon that wandered into the building.”\n“This place is unreal,” Jin marvels, shaking his head as he digs deeper into the pile. “Yoongi. This receipt is for Sandals. That is a couples resort.”\nYoongi peeks over, grabbing the paper out of his hands. “No, Taehyung and Jimin marked it as ‘sales trip.’”\n“They ordered porn to the room and expensed us for it.”\n“Look, I don’t know what you want me to say,” Yoongi heaves a great, exhausted sigh. “I do not have the time to pore over every detail of every expense.”\n“Are you telling me you didn’t even look at the receipts?” Jin demands, clearly flustered, holding up handfuls of papers in disbelief.\nYoongi sits up straighter, and if humans had hackles, his would be at full attention. “You know what? When you assholes at Corporate decide to give us the funds to hire another accountant, maybe there will be time to look at the goddamn receipts. I mean, do you know everything that I have to do? I handle big-picture accounting. Sales numbers, projections, budgets. I handle day-to-day accounting. Payroll, expense reports, ordering inventory and supplies. Then on top of that, I am responsible for compiling all of that data and sending it off to corporate each month so they can send in a fucking baby-sitter to tell me I’m not doing my goddamn job.”\n“Whoa whoa whoa,” Jin waves his hands in a manner that is clearly meant to calm him, obviously a little shocked at Yoongi’s outburst. “I get it. I’m sorry, I wasn’t… accusing. I’m just… Have you ever voiced your concerns to Corporate? About needing another accountant?” Jin pries gently, looking vaguely disgusted with the papers in his hands.\nYoongi scoffs viciously. “Only every quarter for the last two years. I doubt they even read my suggestions, though. They only look at the damn numbers.”\n“I had no clue,” Jin marvels, looking at the mess of papers in front of him. “This is too much work for anyone. Like, I can’t believe this branch is even afloat. You’re kind of awesome, Yoongi.”\nYoongi tucks his head, the neck of his dress shirt feeling very tight and hot all of a sudden. “Yeah, well, tell that to your corporate overlords.”\n“I will,” Jin assures him with a soft smile. “You know, this branch actually still brings in more money than the other branches. When I say your sales numbers are insane, I mean it. We were just stunned by the discrepancy in sales and actual profit. But if we straightened out this accounting issue and brought some law and order to this place, I think we could break some records.”\nYoongi chances a glance out of the corner of his eye and instantly regrets it, because Jin’s face is alight with enthusiasm and sincerity, like he is truly, personally invested, and Yoongi is bitterly and absolutely smitten.\n“I’m really sorry we dropped the ball on you, Yoongi. But we’ll figure this out. Starting with…. trying to salvage this year’s budget.” He picks up another piece of paper, then sets it down, eyes strangely blank. “400 Chicken McNuggets, and for ‘reason,’ it just has down here ‘social experiment.’”\n“Okay, wait, that one I caught. I told Taehyung no, and he said he got a full refund.”\nJin buries his head in his hands, and Yoongi hears a sad little groan. “I’m pretty sure McDonalds has a no-return policy, Yoongi. Mother fucking Kim Taehyung.”\n“Um. I’m… just gonna come back… later,” Taehyung’s voice comes from behind them, at the entrance of the conference room. He backs away nervously.\n“No, no, come in Taehyung. What do you need?” Jin asks, sounding like a burdened single father of 12.\n“I just need to drop off this expense report?” he says uncertainly, with a tight, forced smile. “It’s already been approved,” he says hastily. “Yoongi signed off on it earlier this week.”\nYoongi can almost feel the intensity of the suspicion in Jin’s ensuing side-eye. “Hey, I’ve been a lot more careful since you got here,” he claims defensively. “It’s probably legit.” He pauses to think. “Probably.”\nTaehyung delivers the papers to Jin’s outstretched hand and then backs away several steps. “Trophies?” Jin reads off of the paper, clearly confused. “What could we possibly need trophies for?”\n“Our end-of-the-year awards,” Taehyung pipes in with his usual blinding smile. “The Jammies.”\n“Come on guys,” Jin exclaims in exasperation. “This is a business, not a high school. This is exactly the kind of thing they sent me here to stop.”\n“No, you can’t stop the Jammies!” Taehyung exclaims in dismay. “It’s tradition!”\n“It is kind of our thing,” Yoongi admits, shrinking back in his chair under Jin’s ensuing glare.\n“And we can totally justify the expense!” Taehyung continues enthusiastically, jabbing his finger at a specific place on the report in Seokjin’s hands. “Look, I wrote down the reason as-”\n“If this says team building, I’m going to make you eat this goddamn paper,” Jin warns with a deadly calm.\nTaehyung freezes, eyes wide and fearful, then he glacially slips the paper from between Jin’s fingers, crumbling it up into a little ball and stuffing it in his mouth obediently. Jin just makes a disgusted face but doesn’t comment otherwise.\n“I assume you’ve already bought the trophies? Personalized, and unreturnable?”\nTaehyung nods silently, the corner of the paper sticking out from the side of his mouth.\nJin exhales hard through his nose. “Then I guess we don’t have any choice this year. But consider this the last Jammies. I’m sorry, guys.”\nTaehyung looks torn but resigned. “OohHay,” he mumbles around the wad of paper, a little trickle of drool seeping down his chin.\n“And I am going to need that expense report,” Jin says, gesturing to Taehyung’s mouth. Taehyung makes to pull it out, but Jin hurriedly grabs his wrist to stop him. “For the love of god, please print a new one.”\n \n \nEven in the brisk, harsh winter, the smoking deck is greener and lusher than anything Yoongi has seen all day. There are a few hearty bushes and evergreen trees, as well as some seasonal poinsettias braving the inhospitable cold, and they make him feel strangely hopeful.\nIt’s his safe place.\n“Hey,” he hears from behind him, and it takes every ounce of self-restraint not to whip his head around. But he recognizes the voice, and he’ll be damned if he exhibits human emotions like surprise in front of that bastard.\nIt was his safe place.\n“Hey,” he responds nonchalantly, leaning forward on the railing and trying his very hardest to not look like a fucking nerd.\n“What are you doing out here?” Jin asks casually, joining him at the railing. Yoongi slides a few inches to the right, away from danger.\n“Smoking,” Yoongi responds moodily before realizing that he left his cigarettes upstairs. Fuck.\n“Oh. Aren’t you gonna, you know, smoke then?”\nYoongi flushes red. “I… think I forgot my cigarettes,” Yoongi admits grudgingly. \n“I would offer you one of mine, but I don’t smoke,” Jin says, settling more of his weight forward against the rail.\n“What are you talking about? We literally met on the smoking deck.”\n“I wasn’t down here smoking,” Jin clarifies. “I was getting some air. I just find that it’s good practice to always carry a lighter. You never know when you might run into some poor schmuck in need of a light and willing to air his company’s dirty laundry.”\nYoongi seethes quietly, scrambling for a biting retort and coming up empty. After a couple of seconds of silence, Jin continues.\n“Come to think of it, you weren’t smoking last time, either,” Jin observes, and Yoongi flushes with embarrassment and with pleasure that Jin had been paying such close attention to him. “You just let the cigarette burn down.”\n“Yeah well,” Yoongi blusters suddenly, “Last time I was distracted.” When Jin raises his eyebrows significantly in response, Yoongi backtracks, “Not like, distracted distracted. Y-you just wouldn’t shut up…”\nJin doesn’t sway. “You don’t actually smoke, do you?”\nYoongi exhales hard through his nose. “No I do not actually smoke, and if you ever tell anyone, so help me god, I will end you.”\n“Why do you go out of your way to pretend, then?”\n“So motherfuckers like you don’t talk to me when I’m trying to relax. Because when I smoke I look all, like- I dunno- edgy and dangerous, so people leave me alone.” He shoots Jin an unsubtle glare from the corner of his eye. “Usually,” he amends.\nJin actually stifles a laugh. “Edgy and dangerous? You look like that smoking baby from the internet.”\n“You know, if you’re trying to get us back on the right foot this is not the best way to go about it,” Yoongi growls, swallowing down his anger as Jin laughs gleefully in response.\n“I’m sorry, I’m sorry. I couldn’t resist,” Jin apologizes with a lovely smile. “You are unbelievably fun to tease.”\nYoongi has the strangest automatic urge to say ‘Thank you,’ but he bites it back, because that would not actually make one shred of sense. They sit there in benign silence, watching the traffic below the building crawl slowly and loudly down the packed street.\n“Because it’s the only fucking break I get.”\n“What?” Jin asks, clearly not suspecting to have gotten an actual answer.\nYooni’s ears are aflame, and he nervously shakes his bangs over his forehead. “I pretend to smoke because it’s the only fucking break I get.”\n“You can take a break without taking a smoke break,” Jin informs him matter-of-factly. “We do, in fact, have an actual break room.”\n“Yeah, but…” Yoongi starts, then thinks better of it, shaking his head and leaning forward on the railing.\n“Yeah but?” Jin prompts him.\nYoongi hesitates for only a moment, and here he is, talking again. He can’t ever seem to stop talking. “It’s the only time I ever see green,” he explains quietly, self-consciously gesturing minutely towards the terrace greenery. “The only reminder that the color green even exists. You know, beyond the endless seas of padded, gray, chemically-treated half-walls.”\nJin nods silently a few times, chewing on his goddamn lip again.  “Everybody copes in different ways. Just look at your friends.”\nYoongi allows himself a gruff almost-chuckle at that. “They definitely know how to break up the monotony.”\n“That they do.”\nA horn honks insistently on the street below as Yoongi squirms and struggles in his own unsettling cloud of anxiety. “What do you do?” he asks impulsively, wishing he could swallow the words as soon as they leave his mouth. He doesn’t know why he said it, except that he’s not quite ready for Jin to stop talking to him. “Uh, to cope?”\n“I move,” Jin replies simply, stretching out his arms on the railing and leaning low to arch his back, groaning luxuriously at the stretch.  “I like to move.” He straightens up abruptly then, posture once again impeccable as he turns to Yoongi. “Interesting fact: Everywhere’s gray. Everywhere they send me. Every building, every office, floor to ceiling gray. But every time, every single time, it’s always just the slightest shade different. It keeps things interesting.”\n“If that’s your definition of interesting, I have some news for you about the things you are potentially going to witness in the next few months.”\nJin laughs amiably at that, and it’s a goofy, unguarded sort of laugh that Yoongi hasn’t heard before. He doesn’t realize he’s staring at Jin until their eyes meet and he whips his head away nervously. Then Jin’s gentle gales of laughter fade into soft chuckles, and Yoongi swears that he feels eyes on his face, even after the laughter has subsided completely.\n“You could always… I dunno. Get some plants, or something. You know, for your cube,” Jin suggests after a moment.\n“The only plant that’s ever had the misfortune of being mine died long before it ever had a chance to tell its tale of woe. I’m lucky if I remember to feed myself.”\n“God, you know, I don’t think I’ve ever actually seen you eat,” Jin marvels quietly, pulling his coat tight around him.\nYoongi shrugs. “I don’t need much. I strategically conserve energy.”\n“Oh is that what you call it?” Jin elbows him teasingly, and Yoongi tries very hard to scowl. “What are you doing for lunch?”\n“I think there’s a cup of expired yogurt in the breakroom fridge that’s fair game now.”\nYoongi has rarely seen anything but a sweet smile on Jin’s exquisite face, so the ensuing look of disgust is unsettling. “I am almost offended,” Jin admits, lip curling in displeasure. But he seems to snap out of it, gently tugging on Yoongi’s elbow. “Come on. You can have my second lunch.”\nYoongi reluctantly allows himself to be led, with only the mildest of protestations.\n \n \nIt’s true, Yoongi admits grudgingly to himself, that he has noticed a very slight decline in his productivity in the last few weeks, but it has absolutely nothing to do with the presence of his new neighbor. Working across from Jin isn’t distracting at all.\nExcept for when Jin gets a bit restless and stiff after sitting still for too long, stretches in his chair, making the most delicious little groaning sound while extending his hands up over his head, hitching up his shirt and exposing a few inches of pretty golden skin.\nExcept for when he takes his second breakfast of the day at his desk, stuffing full his face of churros or doughnuts or pancakes or whatever tasty treat he has packed away for himself that day. The way that Jin enjoys food, Yoongi thinks, is similar to the way that most people enjoy sex, if the noises that he makes are any indication. One day, the day that Jin brings cinnamon buns, Yoongi mortifyingly gets half-hard at his desk just listening to him.\nAnd then there are the times when Jin puts in his headphones and starts singing quietly and badly and mindlessly under his breath, and that’s actually not hot at all, which is what Yoongi finds most disturbing, because he can’t stop smiling whenever he hears it.\n“What the hell are you smiling about?” Hoseok’s voice jars him from his pleasant little lull.\n“I fucked your mom last night,” Yoongi replies easily, any remnant of a smile sliding from his face in an instant. \n“Buddy, we both know you’d prefer dad,” Hoseok says a little bit too loudly, and Yoongi hurriedly hushes him, pivoting his body subtly to make sure that Jin still has his headphones in. He’s relieved to see that he does, though he’s stopped singing.\n“What do you want?” Yoongi glares at him.\n“Just wanted to come say hello to my good friend,” Hoseok replies vaguely, peeking surreptitiously around Yoongi to catch a glimpse of Jin’s broad back. Yoongi glares. “Oh, damn he’s not even-” he clears his throat, and when he speaks again, his voice is twice as loud, and rather stilted. “I just wanted to bring you some coffee.” He reaches over the low cubicle wall as if to pass Yoongi a cup of name-brand coffee, but as soon as Yoongi reaches his hand forward to take it, Hoseok yanks it away.\n“What the hell, dude?” Yoongi demands, reaching again for the coffee, but Hoseok just holds it further out of his reach, still looking past him, at Jin’s hunched back. \"Give me the damn coffee.\"\n“Shh, just wait a second. God he’s oblivious,” Hoseok insists in a hushed tone, reaching over the wall and onto Yoongi’s desk to grab a piece of paper. He crumbles it up into a tiny ball, and Yoongi lunges at him.\n“That’s an expense report, asshole!”\nHoseok shrugs him off and winds his arm back, lobbing the paper ball forward with maximum force. It whizzes past Yoongi’s face and smacks Jin directly in the back of his head.\n“I JUST WANTED TO BRING YOU SOME COFFEE,” Hoseok repeats louder yet, and so stilted that Yoongi almost actually laughs. Jin has turned around now, rubbing the back of his head tenderly. “Oh, hey Jin. I didn’t see you there.”\n“Hi, Hoseok,” Jin kindly returns his greeting, eyes slightly confused.\n“I was just bringing my best friend Yoongi some coffee,” he says with a stiff smile. “Actually, this is so weird, but I totally have an extra one. So crazy. Do you, uh, want it?”\nJin’s smile is sweet, and Yoongi fights down a surge of irritation. “That’s so nice, Hoseok. Thanks!”\nYoongi purses his lips sourly as Hoseok shuffles over to the aisle between their cubes and politely hands Jin the second cup of coffee.\nJin takes a small sip and makes one of his sinful noises of appreciation, his cup lingering by his mouth.  “Is this Hazelnut? Mmmm, my favorite.”\n“Oh, is it?” Hoseok asks in mock surprise. “I had no idea.”\nYoongi reaches out his hand to accept the other cup, but not before Hoseok brings the cup to his own mouth, instead.\n“Hey, what about me?” Yoongi demands as Hoseok and Jin sip away contentedly.\n“Ah, sorry Yoongi,” Hoseok apologizes unconvincingly, leaning against the entrance to Jin’s cubicle. “I totally spaced. I’ll get you tomorrow.”\nYoongi knows better, though, so he makes sure to buy himself a coffee on the way to work the next day.\nWell, he actually buys himself two coffees. For no particular reason. The order just kind of just comes spilliing out of his mouth when he reaches the front of the line at the coffee shop. Two coffees, room for cream, one pump of Hazelnut syrup.\nHe keeps his head tucked self-consciously as he walks into the office, because he knows that if even one thing is the slightest bit different, two coffees instead of one, someone is going to notice. But he’s lucky today. The office is completely silent, and he seems to be the first one in.\nHe makes his way over to their corner but hesitates in the aisle between the entrances to the two cubicles. He twitches towards Jin’s cube, then thinks better of it, then takes a tentative step, then thinks better of it again. He’s about to try once more when he hears a voice behind him.\n“Is that for your boyfriend?”\nYoongi startles so violently that hot coffee sloshes out of the opening in the lids of the coffees in his hands, and he very nearly loses his tentative grip on them.\n“Fuck!” he swears as the scalding liquid burns his skin.\n“Oh. Sorry,” Hoseok apologizes half-heartedly, starting forward slightly as if to help. He doesn’t.\n“Why did you sneak up on me, asshole?” Yoongi mutters as he appraises the damage. His hands are a tinged pink from the hot coffee, and it looks like he’s pissed himself.\n“Why are you so jumpy?” Hoseok shoots back, looking slightly shocked himself, but mostly triumphant. Yoongi flushes deeply, tenderly holding the cups of coffee so as to make as little contact with his skin as possible. “Wait,” Hoseok realizes with a cruel smirk, “Is that seriously for Jin?”\n“No,” Yoongi denies on reflex. “They’re both for me.”\nHoseok takes a few steps closer, sniffing the air around Yoongi. His mouth drops open in amused shock. “Is that Hazelnut?”\n“French Vanilla,” Yoongi lies instantly and without pause.\n“You-” Hoseok starts with a look of ecstatic wonder, but he is cut off by the sound of another voice behind him.\n“’Morning!” Jin greets them brightly, striding past Hoseok to where Yoongi is standing, frozen, looking like he’s just been caught with his hand in the cookie jar. He takes one look at Yoongi’s soaked pants and raises an eyebrow. “Little accident?”\n“Yeah, he pissed himself when I caught him trying to leave that coffee on your desk,” Hoseok answers helpfully with badly disguised glee.\nJin, however, gently takes one of the cups of coffee from his hands with a kind smile. “For me? Thanks, Yoongi.”\nHoseok stifles a laugh, while Yoongi stares at Jin, mouth slightly agape.\nJin takes a small sip, and there’s that noise again. Yoongi anxiously licks his lips. “Mmm, Hazelnut. This is amazing.”\nYoongi can’t think of a single real word in response, so he just gapes dumbly to Jin’s turned back. He averts his gaze when he sees Hoseok dramatically mouth the word ‘hazelnut’ at him and just shuffles over to his desk chair, flipping Hoseok a casual bird as he sets down his cup of coffee and opens up his email.\nHe doesn’t realize he’s been staring at the same sentence for some time until Jin’s voice snaps him out of his trance. “Hey, do you have that expense report from yesterday? The one for the hover boards?” Jin asks from across the aisle.\nYoongi glances at the balled-up wad of paper underneath Jin’s desk, imagining himself stuffing it down Hoseok’s throat.\n“Uh, yeah. I just need to… print it out again,” Yoongi mutters quietly, turning back to his computer and clicking into Excel to open the spreadsheet.\nExcept it’s not there. Yoongi searches every folder on his desktop, every folder within a folder, but it’s just gone.\nThen someone across the room clears his throat meaningfully, and Yoongi pops his head up over the half-wall of his cube, scanning the room. Kim Taehyung stands facing him, spinning a small keychain with a USB attached on his index finger and looking despicably smug.\nYoongi swells with rage, trying to be as silent as he can as he mouths the words ‘Do you want to die you fucker?’ across the room. Taehyung’s smirk just deepens, and he gestures to Yoongi with his keychain-bearing finger to follow him.\nYoongi hesitates for a moment, chancing a glance at Jin, who is obliviously working away, then locks his computer screen and walks purposefully out of his cube, down the aisle, and into the supply closet, where Taehyung had been headed.\nIt’s almost pitch black when the door swings shut behind Yoongi. He hears a sharp clap clap and a soft, pink light illuminates the small room. Taehyung sits on a chair in the middle, his hands clasped in front of him.\n“Is this clap-activated mood lighting?” Yoongi asks, squinting at the dull pink glowing bulbs, momentarily forgetting his rage. “What do you do in here?”\n“Don’t change the subject,” Taehyung instructs him lazily, twirling that USB on his finger again. Yoongi twitches towards him as if to launch it across the room. “We both know you already know what’s on this USB, Yoongi. And if you want it back, there’s a price to pay.”\n“Tae, that is an expense report. This is not a hostage exchange. Can we dispense with the dramatics?”\n“We cannot.”\n“Fine, what do you want?”\n“I want you…” Taehyung starts, pushing himself to his feet before starting his slow advance on Yoongi. Yoongi swallows his spit on reflex and takes half a step back, “…to come to Karaoke and drinks. Tonight.”\n“Nope,” Yoongi responds flatly, the tension seeping from the air almost instantaneously. “Keep your goddamn USB. Bye.”\n“Think about it, Yoongi,” Taehyung tells him, grabbing his arm gently. “One hour all alone, recreating a spreadsheet you’ve already made, or a night of fun out with your closest, oldest friends?”\n“The spreadsheet one,” Yoongi confirms easily.\nTaehyung stamps his food moodily. “That is not what you were supposed to say. Fine. I’m calling it in. I’m calling in my big favor.”\nThat actually does stagger Yoongi a little. “What?”\n“Let me take you back…..”\n“Tae…” Yoogi warns him.\n“…to the spring of 2012…when a poor, handsome young boy named Kim Taehyung-”\n“I was there, Tae. I remember. Get to the point.”\n“You stole my phone and sent my tasteful nudes to my beloved grandmother, you ass. Do you know how distraught she was? I had to tell her I was sending those pictures to my doctor to get a mole checked out, Yoongi.”\n“I was very drunk, the photos were on Jimin’s phone, and actually you really do need to get that mole checked out.”\n“You’re coming to karaoke whether you like it or not.”\n“You’ve been holding onto this favor for four years and you’re using it for this?” Yoongi demands. “To make me come out for drinks with the same five assholes I’ve been drinking with for years?”\n“Yep.”\n“…why?”\n \n \n It’s drinks with six assholes. And it goes about how Yoongi expects it to go.\nTaehyung has never been subtle about- well anything, really. So as he sits between Yoongi and Jin in the cab on the way to the Karaoke bar with a disturbing, conspiratorial grin, glancing as if on loop from left to right to left back to his right, Yoongi wants nothing more than to melt into the disgusting fabric of the back seat.\nThe whole thing starts out harmless enough, as their gatherings often do. Deceptively harmless.\nFirst up, Taehyung and Jimin sing a suspiciously well-harmonized rendition of Bryan Adams’ Heaven, and Yoongi tries like hell to ignore Jin’s pointed, unmissable look that seems to say ‘are you seeing what I’m seeing’?\nBut then it’s a matter of minutes, and Namjoon’s spiraling fast, even for him. Jimin and Taehyung keep just keep funneling him drinks, pressing shots into his hand with devilish smiles. Then Jungkook orders a round of Jager Bombs and spikes his glass on the floor. Luckily, Yoongi notes with pleasure, the cup is actually plastic, so it bounces back off of the floor and hits him in the dick.\n“How have you guys not been kicked out of here?” Jin shouts over the persistent roar of Jungkook’s screamo ballad.\n“Oh, we have,” Jimin shouts over Taehyung’s twerking form. “The trick is to never let them see your face. The only pics the employees have been able to get for the Wall of Shame are blurry shots of Tae’s bare ass. They never have any clue that it’s us until Yoongi busts out the Celine Dion. Dead giveaway.”\n“Shut the hell your mouth,” Yoongi slurs in warning, but Jimin just giggles impishly and starts smacking Taehyung’s ass.\n“Celine?” Jin demands, looking obnoxiously pleased.\n“It’s always the highlight of the night. I am a fucking delight,” Yoongi growls moodily. “Hey, Tae. How much longer to I have to stay?”\n“I don’t know, Yoongi, how long did it take for my grandmother to forget the sight of my erect penis?” Taehyung yells, still twerking, sweat rolling in delicate beads down his face.\n“With comments like that, who needs context?” Jin adds casually, taking a dainty sip of beer, and he fits in really well, Yoongi thinks, eyes drifting down to watch Jin’s neck when he swallows. Corporate bastard. “Hey, is Namjoon okay?”\nYoongi doesn’t see Namjoon immediately, but then there he is, staring intently at the fake potted plant in the corner of the room.\n“He’s probably just having his bi-weekly existential crisis. It’ll pass,” Yoongi assures him, blindly throwing back whatever shot Hoseok has just thrust into his hand.\nGradually, Yoongi realizes that the room’s a little blurrier than he would like it to be, and everything is happening really fast. He didn’t even feel it sneaking up on him, the slow delicious burn enveloping his limbs, then his head, then his tongue, making it heavy and loose and tingly. One minute, Jin’s sitting right beside him and the next, he’s at the front of the room nervously clutching the mic as Jungkook hangs fondly off of his neck.\nHe’d fully expected Jin to a terrible singer, judging from his cute, awful cubicle mini-concerts, but, okay, he’s actually kind of good, and Yoongi has no clue what song this is, but it’s his new favorite.\n“Ew,” Hoseok says as he plops down beside Yoongi, “I’ve never seen that look on your face before.”\n“What look?”\n“Smitten. Like Taehyung when Jimin wears jeggings.”\n“I hate you,” Yoongi mutters, sinking down in his seat and crossing his arms over his chest. “All of you. Why are you guys doing this to me?”\n“Today in particular? Because we got bored of flicking quarters off of Jimin’s butt earlier. But in the long term? Because we love you and want you to be happy.” Hoseok’s arms snake around him, clinging to Yoongi like a giant, hairless koala.\n“Fuck off,” Yoongi mutters affectionately, the tips of his ears flaming red as he shoves Hoseok off of him and slides even deeper into his seat.\n“Fine, I have to pee anyway. Hey, Tae. Jimin. Kook. Accompany me to the pissroom.” Yoongi eyes him strangely, watching as the three youngest seemingly materialize by his side. “We’ll be right back,” Hoseok assures Yoongi, patting his shoulder fondly. Then they’re gone.\nJin steps gingerly over Namjoon, who is face-down on the floor, moaning miserably into an abandoned microphone.\n“Do they always go to the bathroom together?” Jin questions, ignoring Namjoon, who wraps his arms weakly around Jin’s leg as he tries to step over him.\nYoongi’s phone lights up with a message from Hoseok:\n \nAsshole #1: Be safe ;)\n \n“Only when they’re ditching us,” Yoongi sighs morosely.\n“They probably just didn’t want to have to deal with this human mess,” Jin ventures, gently nudging Namjoon’s butt with the toe of his shoe. Namjoon’s artificially amplified groans echo off of the empty, white walls where lurid lights still flash.\n“Yep. Probably,” Yoongi mutters unconvincingly through tight lips, letting his head fall hopelessly forward onto the table with a dull thunk. “Ow.”\n \n \n“I’m dyiiing,” Namjoon whines into the crisp night air, leaning heavily on Jin and pulling him close. “Wow you smell so good. You smell like a rich person’s bathroom,” he mumbles into Jin’s neck, his face sobering for a moment before it crumples again and he rapidly devolves into a sniffling, leaking mess. “Do you guys… know how much I fucking love you?”\n“That’s very sweet, Namjoon,” Jin assures him, “but let’s just focus on walking for now.”\n“Oh, here he goes,” Yoongi notes almost passively as Namjoon’s already dragging feet come to a halt.\n“No no NO,” Namjoon slurs, eyelids half-closed, “You don’t get it. You don’t understand. You don’t get it. I know I’m like Bleh Mr. Boss-Face all the time but I literally just like… literally love you guys so much.”\n\"I mean, I assumed he would be a mess, but this is wow,\" Jin notes, nose crinkled in mild disgust.\nNamjoon stops swaying then, spine going rigid, and Yoongi knows what that means. “Oh god. Oh fuck. Somebody hold my hair.”\n“He turns into a drunk white girl from a teen movie when he drinks,” Yoongi informs Jin, patting Namjoon’s short, trim hair tenderly the tall blond man abruptly bends double and starts hurling on the sidewalk.\n“When did I eat Spaghetti Os?” Namjoon wonders distractedly when his heaving has subsided, and he sounds a little panicked when he continues. “Guys seriously when did I eat fucking Spaghetti Os?”\n \n \n“What do you do after you’ve seen your boss’ naked ass as he sobs into a can of Spaghetti Os on his kitchen floor?” Jin wonders aloud as he and Yoongi meander down the dark, empty street towards the bus stop.\n“You set the photo you took as his computer background on Monday and ask for a raise,” Yoongi instructs him, scrolling through the pictures on his phone. “This actually looks like some weird, artistic porn or something. I should upload this. Somebody would be into this.”\nJin leans closer to get a better look, reaching over to scroll through the photos himself, and Yoongi conspicuously stiffens. “Wow, you’re right. It’s like… both disgusting and weirdly sensual. You’ve got a good eye for setting up shots.”\n“I knew I should have gone into porn production,” Yoongi laments, deadpan, satisfied when Jin gives a short, high chuckle.\n“Well, the company is very lucky that you decided on a different career path,” Jin says kindly.\nYoongi rolls his eyes. “Yeah I’ve clearly been doing a real bang-up job,” he replies dryly. “That’s why you’re here, right? Because it’s been going so well?”\n“Hey, look. From what I can see, there is a lot of shit wrong with the branch,” Jin starts, eyes widening almost unbelievingly, “Like a lot of shit. I am, honestly, stunned that a place like this even exists, much less functions somehow.” Yoongi thinks he’s done, but Jin’s on a roll. “Like, you guys are the biggest fucking mess I have ever personally seen.”\n“Uh, thanks?” Yoongi says uncertainly, feeling a bit like he’s just been insulted.\n“No, I mean- What I mean is, there are a lot of things wrong with that place. But you’re definitely not one of them.”\n“Oh,” Yoongi mumbles, looking at his feet. They’ve stopped now, having reached the deserted bus stop. “Thanks.”\nJin smiles sweetly at him, rocking back and forth on his heels. “Any time.”\n“Uh, are you taking this bus, too?” Yoongi questions him as Jin leans against the covered bench.\n“Me? No, I’m the other way,” Jin explains, pointing over his shoulder.\n“Then I’ll see you Monday?”\n“I’ll wait with you until the bus gets here.”\n“Oh, no, that’s okay, reall-” Yoongi protests, waving his hands in front of him.\n“You’re tiny, drunk, and pretty,” Jin interrupts him, settling in against the covered bench. “I’m not leaving you alone out here.”\nYoongi swells with indignity and embarrassment. “Excuse me? Tiny? Drunk?” He hesitates, his face aflame as he struggles with the last adjective. “… Tiny?” he repeats, and Jin chuckles pleasantly. “I would kick your ass if it wasn’t an HR violation.”\n“And here I was thinking that you were the type to be down for some major policy violation.” Jin’s smirk is infuriatingly hot. Yoongi just exhales heavily, wondering if he was interpreting that statement incorrectly. “Ah, look,” Jin points triumphantly over Yoongi’s shoulder as the bus roars near. “I guess I win. See you Monday.”\nYoongi stares after his broad, retreating figure so intently that he almost misses the bus.\n \n \nYoongi slams his hands against the desk on either side of Hoseok, leaning intimidatingly close. “Whatever ridiculous Parent Trap bullshit you guys are trying to pull, fucking don’t.”\nFar from looking intimidated, Hoseok looks extremely pleased. “So how did it go? Did you guys fuck in a semi-public place? OH- wait, on Namjoon's bed?”\nYoongi snarls in disgust. “You are so gross. And no. Nothing happened. Nothing is going to happen. He is still my nemesis.”\n“Yoongi, I love and admire you, but you fall in love like a second grade boy.”\nYoongi reels back with the force of his protest. “You- I.. HE.. Oh you just don’t- Look…”\n“Yes?” Hoseok prompts him to continue, wearing a sickeningly satisfied smile.\nYoongi chews his lip in frustration, trying for a few moments to formulate a counter-argument before he abruptly gives up and turns indignantly on heel, retreating rapidly as he stalks back to his corner of the office.\n“Hey guys,” Jin calls gently from near Jimin and Taehyung’s desks, but it still scares the hell out of Yoongi, who hadn’t noticed him standing just 20 feet away. “Quick casual meeting?”\nThe rest of the guys come shuffling out of the woodwork to congregate in the center of the room.\n“Okay, I know I am here to advise in a mainly financial role, but there are some other potentially concerning items that Corporate would like me to address while I’m here,” Jin starts, looking very much in his element.\n“Sometimes I forget he’s a capitalist lapdog,” Namjoon whispers to Yoongi with a pleased smile, who shoots him a skeptical look. “He’s just so damn pleasant.”\n“He’s not that damn pleasant,” Yoongi mumbles under his breath.\n“First of all, I have some bad news that some of you may have already heard,” Jin continues, unaware of the exchange. “This year will be the last Jammies.”\nA collective groan goes up, and Jin tries to hush them with his hands. “What about office morale? What about team building?” Hoseok demands.\n“Teamwork makes the dream work!” Jungkook insists, spine going rigid in outrage.\n“I know, I know,” Jin tries to calm them with a sympathetic tone. “I know how important ‘team building’ is to this particular office. That’s why we’re going to start implementing more low-cost teambuilding seminars, rather than all of these extravagant events. Hoseok, you're Human Resources. Do you have any ideas about who you might want to put in charge of those events?”\n“No brainer,” Hoseok answers instantly. “Sales Team.”\nJimin and Taehyung high-five enthusiastically across their desks. Jin runs his hands through his hair in irritation. “Great. Perfect. Walked right into that one,” he mutters resignedly, “Anyway, issue number two. Casual Friday.”\n“I fucking told you guys he was coming for Casual Friday,” Taehyung gloats.\n“No, no, don’t worry. Casual Friday will still be a thing,” Jin assures them. “We just need to set a couple of limitations. For instance, no jeggings.”\nJimin scoffs indignantly. “I feel like that is an extremely targeted attack.”\n“It’s just… in an office environment, it’s a little distracting,” Jin tells him carefully.\n“Yeah it is,” Taehyung growls with a satisfied smirk, reaching across his desk to give Jimin another high-five, and Jimin looks mildly assuaged.\n“The last item is just more of a general inquiry, but extremely concerning nonetheless,” Jin continues after allowing himself a brief roll of his eyes. “Does anyone have an explanation as to why there is not a single woman who works in this office?”\n“The Patriarchy?” Namjoon offers casually.\n“Wouldn’t that make you The Patriarchy?” Hoseok asks him, mindlessly shredding a post-it note. “You are the boss.”\nNamjoon cocks his head to the side, squinting his eyes in thought. “Oh my God. I’m the problem. I’m The Patriarchy.”\n“No, wait a second guys,” Taehyung cuts in, looking confused. “What about Pearls? Pearls is a woman. And she’s worked here forever.”\nYoongi thinks he’s kidding for a moment, some sick joke, but the genuine befuddlement that graces his features tells him otherwise. “Tae, Pearls is dead.”\nTaehyung waves him off with an indulgent chuckle. “Your black humor is charming as always, Yoongi.”\n“Tae, I’m not kidding. Pearls died like three years ago.”\n“What?!” Taehyung demands, face falling in utter devastation. “Why did nobody tell me Pearls was fucking dead? I loved Pearls.”\n“Obviously,” Hoseok scoffs bitterly. “You never even noticed she was gone.”\n“She was always quiet!” Taehyung insists, looking distraught.\n“Wait,” Jimin says suddenly, looking confused. “If Pearls is dead, who the hell have I been sending our customer complaints to for the last three years?”\n“Jesus H. Christ,” Namjoon despairs, burying his head in his hands.\n \nYoongi arrives a few hours late on Friday, courtesy of a dentist appointment.\nAnd he’s definitely still loopy from the veritable cornucopia of drugs that it had taken for him to let a dentist anywhere near his mouth, but the moment he crosses the threshold into the unnaturally still office, he knows something is up. He can sense it even through his haze. He’s gotten good at picking up on these little atmospheric shifts. He’s had to.\nIt’s the kind of scary stillness that hangs about the air when someone is hiding. The main room is a battlefield, littered with confetti and silly string, with one small clean area on the floor in the vague shape of a human body. Someone’s abandoned coffee lies splattered across the floor, utterly forgotten in the madness. Yoongi stoops down and sniffs the air gingerly. Hazelnut.\nHe proceeds to his desk with caution, shaking off a stray strand of silly string that has adhered to the bottom of his shoe, immensely unsettled that he doesn’t know where anyone is or what they might be doing. Usually, he tries to keep tabs on them all, when he can. It’s a survival instinct. Never turn your back on danger.\nHe scans the area over the top of the half-walls before lowering himself down into his seat. A haunting giggle echoes in the distance, and it sounds like Jimin.\nJust as he is trying to get comfortable, wriggling around in his immensely uncomfortable chair, his foot comes into contact with something soft. Something soft that moves and gently grabs his ankle.\nBefore he can scream, a large hand emerges from underneath his desk and clamps down on his mouth. He panics, kicking out blindly. He hears a soft ‘ouch!’ and then Jin’s face is peeking up at him from the darkness under his desk.\n“Shhhhh!” Jin urges in a desperate, hushed whisper. He looks awful. His hair is a mess, sticking up in all directions, bolstered by the silly string that looks to be matted into it. His eyes are wild and terrified, and his shirt has been ripped so violently that all that remains of the left side is one limply hanging flap that exposes his entire shoulder and a good portion of his chest. Yoongi is at once shocked, concerned, and aroused.\n“What the fuck, dude?” Yoongi hisses right back, confused and disoriented, willing his heart to slow as he recovers from his shock. “What happened?”\n“They fucking swarmed. It was legitimately terrifying,” Jin recounts, eyes darting nervously about. “The second I walked through the door, they were on me. They were everywhere. I… I got away, but I don’t know where they went.”\n“Why? What’s happening?” Yoongi demands, trying to ignore the fact that an utterly debauched looking Jin is kneeling on the floor in front of him. \n “It’s my birthday,” he says with an almost comical soberness, bracing his hands on Yoongi’s knees (fuck) and craning his head to try and peek around the corner of the cubicle wall. Yoongi swallows hard, unable to tear his eyes away from Jin’s slightly parted lips. Jin’s hands slide further up as he positions himself for a better view, and his fingers unconsciously tighten around Yoongi’s thighs.\n“Feels like my birthday,” Yoongi marvels blearily, and a second later, he feels the blood rapidly drain from his face. “Ohhhhh fuck, was that not just in my mind?” he whispers, his panic only intensifying. He slaps himself hard in the face, relieved when the warmth of Jin’s hands has suddenly disappeared from his knees. “Oh my god am I still talking out loud, why can’t I stop-”\nHe’s on the verge of slapping himself again, but Jin’s strong fingers stay his hand. “Yoongi. Calm down.”\n“Sorry, I’m high.” Jin arches one thick, perfect eyebrow, and Yoongi backtracks instantly. “Uh, no, not on real drugs… On dentist drugs.” He is absolutely certain there is such a thing as dentist drugs. “I have... dental anxiety…” He clears his throat in embarrassment. “Uh, go on with your story about things.”\n“Yoongi, they were out of control. I have silly string in places that no human should ever have silly string. And I only just managed to get away before the public birthday lashes. Not spankings. Lashes.”\n“I’m not surprised. They were getting restless. Nobody’s come into work on their birthday in years. We all know better, but it looks like nobody warned you.”\nJin settles back into his safe space beneath Yoongi’s desk. “Not even Namjoon. He just sat there, watching… Yoongi, his eyes were so cold.” Jin shudders at the memory. “And Jungkook! Quiet, sweet Jungkook…”\nYoongi snorts indelicately.\n“You’ve got to help me,” Jin continues desperately, grabbing onto the material of Yoongi’s pants. “Hide me. Please? Let me stay here.”\n“What? All day?” Yoongi demands, trying half-heartedly to pull his legs away from Jin’s iron grip. “You’re going to stay under there all fuckin-”\n“What are you doing?” Taehyung says loudly, peeking over the wall, and Yoongi startles so hard that he’s pretty sure he knees Jin in the face. Luckily, from where Taehyung is standing, Jin’s crouched form is completely obscured.\n“I… am… just… talking to my dick,” Yoongi explains very seriously. He hears Jin heave a great frustrated sigh because, yeah, that’s not great.\nTaehyung appraises him suspiciously for a moment before relaxing into a goofy smile “Aw, you're still dentist high, aren’t you buddy?”\nYoongi nods eagerly, amazed.\n“Well hey, have you seen Jin? We have a birthday present for him, and he’s disappeared,” Taehyung continues, eyes darting around the small space.\n“Uh, no, I haven’t. Maybe he left?”\n“No he’s still in the building. Jungkook says he’s still using the wifi to do his work from his tablet,” Taehyung informs him casually, craning his head to get a look inside Jin’s cubicle. Jin curses quietly under his desk, tossing his now powered-down tablet to the floor beside him.\n“Oh. Haven’t seen him. Sorry,” Yoongi says casually, unlocking his computer and pulling up his email in the hopes that Taehyung will leave.\n“Well if you do see him, just hold him down and shout, okay?”\n“Yeah, sure. Whatever,” Yoongi agrees passively.\n“Well, I’ll let you get back to your conversation,” Taehyung says, gesturing down to Yoongi’s crotch. “But hey, you know whose dick you should be conversing with, right? While you're nice and doped up and forthcoming.”\nYoongi goes rigid, eyes wide as Taehyung waggles his eyebrows suggestively. “Go away!”\n “Ji-”\nYoongi chucks a dense accounting book so hard in his direction that if Taehyung hadn’t ducked, he might have broken his nose. As it is, the book slams into the near wall and clatters to the floor with a dense bang.\n“Bye!” Taehyung trills as he skips away, slamming the door to the breakroom, where the rest of them are presumably gathered.\n“Come on,” Yoongi whispers harshly at Jin, heading off Taehyung’s mortifying comments by pretending they never even happened. “Haven’t you seen movies? Technology is always how they find you, man. They always know. You’ve gotta go off-grid.”\n“Well excuse me, for trying to work at work,” Jin defends himself, nose in the air. “Now go get me a pen and that folder on my desk. Looks like I’m doing things the old fashioned way today.”\n“You’re seriously going to stay beneath my desk all day? Why? Why my desk?\n“Because,” Jin huffs, “It's the last place they would expect.”\nYoongi crosses his arms and tries to shift his head so that Jin can’t see his burning ears. “Why don’t you just make a break for it?”\n“I refuse to lose a whole day of work. Plus, it’s kind of cozy down here,” Jin explains, settling back on his elbows and cuddling up to one of Yoongi’s squishiest napping pillows. “I mean, you’ve got a whole little nest.”\nYoongi just grunts and pushes his chair back as far as physically possible.\n \n11:35am\n \n“Why does your phone keep buzzing?”\n “Jimin is live-tweeting your man hunt,” Yoongi mumbles under his breath, refusing to tear his eyes away from his computer screen in case someone is looking. “They’re paying schoolchildren to check the ductwork since Jimin’s ass couldn’t fit.”\n“Oh. Good. Great.”\n \n12:26pm\n \n“Does this say ‘projectile vomit’?” Jin asks, shoving a form into Yoongi’s lap. Yoongi makes a weird strangled sound as Jin’s fingers brush his thigh, but if Jin notices, he doesn’t say anything.\n“Projected profit.”\n“Do you just, like, scribble in the vague shape of words?” Jin mumbles, slipping the paper from between Yoongi’s fingers and taking a second look.\n“Did you really think I made a graph about projectile vomit?”\n“If somebody in this office has not made a graph about or with projectile vomit, I will eat my own foot.”\n“You totally would,” Yoongi scoffs.\n“Would what?”\n“Eat your own foot.”\n \n1:10pm\n \n“Yoongi, I’m hungry.”\n“You’re always hungry,” Yoongi says soullessly as he tries to focus in the spreadsheet in front of him.\n\"But now I'm really hungry. I think it was all that talk about eating.\"\n\"You mean about eating your foot?\" Yoongi asks with a disgusted grimace.\n“I can’t skip meals,” Jin whines, tugging at his pants again, pouting up at Yoongi endearingly.  “My body is like a delicate microchip. It will be ruined if I don’t carefully maintain it.”\n“Well, your foot's right there. Go crazy.”\n“Yoongiiiiiiiiii,” Jin complains, tugging so hard at Yoongi’s pants that they actually slip down a little. Yoongi banishes a dangerous visual.\nHe huffs hard through his nose, shoving his keyboard away. “Well, what do you want me to do about it?”\n“My lunch is in the break room fridge. Can you go get it for me?”\n“Your assailants are all huddled in the break room at this very moment, plotting your capture. In Jimin’s last tweet, there was talk of a bear trap. You seriously think they won’t get suspicious when I take your lunch?”\nJin waves his hand flippantly. “If they ask, just tell them you’re stealing it because I’m your mortal enemy or whatever bullshit it is you usually go with.”\nYoongi’s cheeks are warm as he rolls back his chair in indignation. He thinks about protesting for a moment, but he deflates embarrassingly fast. “F-fine.”\nHe pushes himself abruptly to his feet, shuffling towards the break room and resting his hand cautiously on the doorknob and pressing his ear to the door. Nothing. Carefully, he fixes his face with an expression of great apathy and turns the knob.\n“I’m telling you, his device has been offline for like an hour now,” Jungkook informs the others, who are huddled around his laptop. Nobody seems to notice Yoongi, who just walks quietly past them towards the fridge.\n“Maybe he actually ditched,” Jimin suggests as Yoongi pulls the fridge door open and rifles around inside for Jin’s meticulously packed lunch tin. It’s obscured behind a jar of salad dressing and an unexplained bottle of lube. He maneuvers the tin around a tray of colorfully-frosted cupcakes that were obviously meant for Jin’s birthday.\n“Maybe he’s dead,” Jungkook contributes helpfully.\n“Knowing Jin, more likely dead than ditched,” Namjoon considers, stroking his chin thoughtfully. Yoongi shuts the refrigerator door as quietly as he is able, backing slowly towards the exit.\n“Wowie, I cannot believe he just poof disappeared,” Hoseok adds in ridiculous, mocking dramatics, turning to wink at Yoongi, who freezes dead in his tracks. He hopes nobody else notices that he is very obviously lying.\n“You sure you checked their isolation corner, Hoseok?” Taehyung asks, eyes still trained on Jungkook’s screen.\n“Of course. It was the first place I looked,” Hoseok bites back, but he looks immensely pleased, making a lewd gesture at Yoongi behind their backs when they look away. “Plus who would actually be dumb enough to hide there, anyway?”\nYoongi glowers silently as he quietly pushes open the door to the hallway, slips through, and shuts it gently behind him.\n“Well? Did they suspect anything?” Jin asks as he tears into his lunch two minutes later, stuffing his mouth with a ludicrously large sandwich and moaning like an amateur porn star. Yoongi crosses his legs nervously.\n“They didn’t even notice me. Too distracted by the hunt. I’m talking full The Most Dangerous Game mode,” Yoongi tells him, watching as Jin’s jaws freeze mid-bite. He omits Hoseok’s weird cover-up. That one is too hard to explain.\n“Yoongi, I like your friends, but they terrify me.”\n \n3:44pm\n \n“Hey, uh... Yoongi?”\n“What?”\n“I have to pee.”\n“I am very sorry to hear that, Jin, because no fucking way is that happening.”\n \n3:56pm\n \n“Why are you dumping that bottle of lemonade down the toilet?” Namjoon asks suspiciously, eyes widening in panic at Yoongi's lack of response. “Yoongi that had better be fucking lemonade.” Yoongi is silent as he slowly closes the stall, watching Namjoon’s disgusted face become smaller and smaller in the diminishing crack of the door. “Fuck, Yoongi! You really can’t even get up to piss?”\n \n5:00pm\n \n“I can’t believe he evaded us the whole day,” Jimin marvels as he and Taehyung pack up to go home. “No one’s ever evaded us the whole day. I know we should be disappointed, but it’s kind of thrilling.”\n“I can’t wait until his next birthday,” Taehyung agrees before pausing for a moment. “I’m thinking we can get one of those tracking devices they put on whales and expand our hunt to the entire city.”\n“Tae, he won’t be here next year,” Jimin reminds him gently, throwing an arm around Taehyung.\n“Shit. I think I’m actually gonna miss that bougie little sellout,” Namjoon adds, bag slung over his shoulder as he joins Jimin and Taehyung in the main room.\nJin accidentally nudges Yoongi’s shoe as he shifts guiltily beneath the desk.\n“Alright, alright, enough of that. You guys go ahead. I’ll be right out,” Hoseok urges, corralling them towards the door. “Working late, Yoongi?” he shouts in the general direction of Yoongi’s cubicle, the smile evident in his voice.\nYoongi startles slightly as he hears Hoseok’s footsteps approaching. “Uh, yeah. Just a bit,” he shouts right back, but there’s no need. Hoseok is already right behind him. Yoongi cranes his head to shoot Hoseok a warning look.\n“What an excellent employee you are,” Hoseok gushes, squeezing Yoongi’s shoulders in a show of support. “Oh, hey, you’re a little far away from your desk there, aren’t you, buddy? You’ll never get any work done like that. Here, allow me.” His hands tighten on Yoongi’s shoulders as he rolls him and the desk chair forward and forward until his knees are on either side of Jin’s body. He tries not to think about how close Jin’s face is to his dick, but his high has long worn off, and the situation is now very fucking real. “There, alllll better. See you tomorrow! Be safe!”\nWhen the door clicks shut behind them, Yoongi launches his chair away from Jin so hard that he crashes into the opposite cubicle wall, but Jin just slumps into a pile of relief and exhaustion on the floor. “What a fucking day.”\n“Uh, happy birthday?” Yoongi tries valiantly as he awkwardly rubs the back of the neck before starting to gather his own things.\n“Thanks. And thanks for sheltering me all day.”\n“Whatever, no big,” Yoongi dismisses him, ducking his head to fasten the buckle on his bag. “Do you, uh, have plans for tonight?”\n“Just my usual birthday routine. Drinking wine in complete solitude,” Jin mutters, crawling out stiffly from beneath Yoongi’s desk. “That’s… not as sad as it sounds. I was thinking about making something nice for dinner, too. A peaceful end to a crazy day.”\nYoongi nods stiffly. “Well. I’ll let you go then. See you tomorrow.”\n“Yoongi, wait,” Jin says suddenly, and his hand is on Yoongi’s sleeve. “Do you… Can I make you dinner?”\n“Make me dinner? Why?”\nJin shrugs shyly. “I dunno. I guess it’s been a while since I’ve gotten to cook for someone. Plus, I was with you the entire day, and I didn’t see you eat one thing the whole damn time.”\n“I licked the icing off of your birthday cupcakes in the breakroom when I went to get your lunch.”\n“You are like literally terrible at taking care of yourself,” Jin informs him distastefully. “You know that right?”\nHe tells himself he’s going for the food.\n \n \n \nJin’s place looks nothing like Jin’s place should look. It’s cold and industrial and kind of empty, but Yoongi supposes that makes sense, considering that Jin has to travel light, that he’s always got to be ready for the next move. Regardless, it’s a little disconcerting.\n“What do you want to drink?” Jin asks, setting down his keys and heading for the kitchen. “Beer? Wine? Liquor?”\n“Yes,” Yoongi replies vaguely, plopping himself down on the couch. He’s been unbelievably tense the entire day, a consequence of both the manhunt and Jin’s consistent proximity to his dick, but now, he can now feel the muscles in his body relax one by one. Jin just chuckles, and Yoongi hears the telltale glug glug of wine hitting the inside of a glass. He glances around the room. A couple of unpacked boxes sit in an otherwise empty dining room, and a generic piece of wall art hangs above the fake fireplace.\n“Nice place,” Yoongi comments politely, not expecting Jin’s undignified snort to echo from the kitchen.\n“Yeah right. It’s shitty. Corporate chose it,” Jin tells Yoongi as he hands him a glass of wine, unbuttoning his ruined work shirt as he makes his way back to the kitchen, stripping down to his white undershirt and slinging a kitchen towel over his shoulder. “So. What do you feel like eating?”\n“Food?” Yoongi offers unhelpfully.\n“Oh come on.  Tell me something you want to eat. I may still be living out of boxes, but you’d better believe I keep a fully stocked kitchen.”\n“Okay, uh. Maybe… Chicken? Fried chicken?”\n“Done,” Jin says with an easy smile, disappearing behind the refrigerator door, a comforting clinking sound coming from the kitchen as he rummages around inside.\nThere is something deadly attractive about Jin cooking. He moves with assurance and grace. He even converses more easily, though Yoongi thinks that maybe he could also attribute that to the wine. Jin is pleasantly flushed as the room fills with the thick, intoxicating smell of frying chicken, and cooking onions, and garlic, and something more savory, and god knows what else.\n“Where did you learn to cook like that?” Yoongi wonders, mouth watering at the smell alone. Well, the visual doesn’t hurt, either.\n“I like to eat,” Jin replies simply. “Gotta cook to eat.”\n“You would make an excellent trophy husband for some rich older woman.”\nJin cringes lightly as he tends the frying chicken. “Eugh.”\n“What? You don’t date older?”\n“I don’t date women,” Jin replies casually, though his eyes dart nervously towards Yoongi before flickering back to the task at hand. Yoongi’s mouth falls open with a small popping noise. Jin must hear it, because he glances back over and laughs delightedly. “Though there was this one time in college.”\n“Ah,” Yoongi breathes uncertainly, trying to mask his shock and glee.\nJin look very pleased with himself. “You know, for someone who’s apparently got a thing for Hoseok’s dad, you look pretty shocked.”\n“You heard that?” Yoongi demands, standing abruptly, and wow he didn’t feel buzzed when he was sitting down, but now, wow.\n“Among other things. Your friends like to talk a lot.”\n“Why. Why do I bother. What is the point of friends?” Yoongi despairs, taking an extraordinarily large sip of wine.\n“I think they’re just trying to help… in their way. Is it bad that I’m still really jealous of you guys?” Jin asks as he plates up the chicken and moves to stir a delicious looking white sauce in its pan.\n“How could you possibly be jealous of the dysfunctional clusterfuck that is our friend group?”\n “They’re kind of great, actually. Plus, it’s just too hard for me to maintain a friend group at all, dysfunctional clusterfuck or otherwise. The company recruited me straight out of college, and I’ve been on the move ever since. Hard to maintain much of anything.”\nHe carefully spoons the sauce into little ramekins and begins plating up some delicious looking greens.\n“What’s the longest you’ve been in one place?”\n“Uh. Here. Already,” Jin confesses with an uncertain smile. “It’s been almost two months now. I usually have the job done in one.”\n“And you still haven’t unpacked your boxes.”\n“Not much point unpacking if you’re just going to have to pack again,” Jin shrugs, grabbing the golden brown biscuits from the oven and sliding them onto the plates.\n“Not much point living if you’re just going to die,” Yoongi prods teasingly, taking a big gulp of wine. Jin looks at him strangely then, the hot metal cookie sheet still clasped in his pink oven mitt. But the heat must seep through after a second, because he curses and hastily sets down the hot metal sheet on the stovetop.\n“Ouch. Uh, you ready to eat?” Jin asks, and Yoongi nods eagerly. “I don’t have a dining room table, so I hope the couch is okay.”\n“My dinner is usually ramen in bed, so a couch is actually a big step up for me.”\nThe only problem with the couch is that it is a very squishy couch, so squishy that they both kind of sink into it when Jin sits down beside him. They both end up with their thighs touching in the middle, a problem that is only exacerbated by the fact that neither of them seem to fucking care. Yoongi blames the wine.\n“Jesus. This is the best thing I have put in my mouth since 2012,” Yoongi informs him very seriously, slowly and peacefully chewing a bit of the fried green tomato.\n“What did you eat in 2012?” Jin asks, curious as he stuffs an entire biscuit in his mouth.\nYoongi chokes on his food, coughing on reflex. “Oh, right. Food. It was definitely food.”\n“Oh, God,” Jin moans with realization, face scrunching up like he’s trying to erase a metal image. “Gross, Yoongi.”\nYoongi can’t help but chuckle at the look on Jin’s face, and pretty soon Jin’s laughing, too. It’s a wonderful laugh. They’re both probably laughing a little too hard, but they’re tipsy and tired and Yoongi doesn’t care. He wouldn’t mind if the Earth stopped spinning, as long as Jin’s warm, soft thigh was still pressed against his.\n“Hey, can I ask you a question?” Jin says, wiping the tears from his eyes as their laughs subside. Yoongi’s stomach clenches anxiously as he shrugs in passive agreement and buries his gaze in his plate. “Why are you an accountant?”\nHe bristles at that, for some reason. “What do you mean ‘why am I an accountant?’ I am kick-ass accountant.”\n“No, I know you are,” Jin assures him quickly. “It’s just… I’m sure you’re kick-ass at other things, too.”\n“Of course I am. I’m a genius.” Yoongi is far too tired for modesty.\n“So… Why are you an accountant?” Jin repeats.\nYoongi shrugs again, setting his clean plate down on the coffee table. “It’s not like, some story of crushed dreams or anything like that. It was just a matter of compromise.”\n“What do you mean?”\n“I mean… There are things I always loved to do. And I still love to do them. I just decided not to dedicate my life to doing them. I decided it wasn’t worth it.”\n“Worth what?”\n“Health. Happiness. I dunno. Whatever the hell else I’d have to give up. Back in my first year of college, I really fucked off, barely went to class. I didn’t care about school, because I was giving the whole ‘dream’ thing an honest go. But… it wasn’t good for me.”\n“What was the dream?” Jin asks, straightening up.\n“I am not telling you that,” Yoongi says without hesitation.\n“Oh come on.”\n“No fucking way.”\n“Fine,” Jin pouts, “I’ll just ask Tae.”\n“Go ahead. He would never betray me like that, and even as I say those words I realize how untrue they are,” Yoongi admits, staring off into space as Jin chuckles delightedly, settling back into the couch. “Anyway,” Yoongi continues, “When I started going to class again, I met a couple of jackasses you may know in Business 101 and realized how good I am with numbers. And so I had friends, and I had a pathway to a well-paying job, and I still had the things I loved to do, even if it wasn’t how I’d always imagined doing them.”\n“So you’re happy, then?” Jin asks, swallowing visibly as he pivots his body to Yoongi.\n“Sometimes,” Yoongi admits, looking past Jin, at the ugly art on the wall behind his head. “What about you?” he asks in an attempt to shift the focus of the conversation. “Living the dream?”\n“I guess,” Jin contemplates quietly. “I never really wanted to be anything specific, just… successful. Drifted in the direction of corporate finance based on the promise of vague success, accepted the first job I was offered after graduation, and never left,” Jin says simply. “It’s been… Wow it’s been six goddamn years.”\nYoongi whistles and raises his eyebrows. “Six of your best years,” he notes helpfully.\n“Shut the hell up. I’m only getting better with age,” Jin shoots back, shaking the hair off of his forehead.\n“Honestly, I don’t know how you lasted six years with this job. You, of all people,” Yoongi ponders aloud, feeling himself slide right into that sweet spot in his alcohol consumption, the spot where he’s confident and insightful and uninhibited.\n“Why ‘me of all people?’ I’m good at what I do.”\n“Sure you are,” Yoongi allows, circling the edge of his wine glass with his finger. “It just doesn’t seem very good for you.”\nJin swallows visibly, looking down as he wipes his hands on a paper towel. “What do you mean?”\n“I mean, do you like your job?”\nJin scoffs and smiles. “What kind of a question is that?”\n“A really straight-forward one,” Yoongi says with furrowed brows. “So do you?”\nJin clicks his tongue and rolls his head back in irritation. “It suits me very well.”\n“That is not a ‘yes.’”\n“Well, what do you want me to say?” Jin bursts out in indignation.\n“I want you to say that you hate your job. Which you clearly do.”\n“It suits me,” Jin repeats, glancing down as his fingers play with the stem of his wine glass.\n“It does not,” Yoongi retorts. “The constant moving, the drifting? No way does that suit you.\"\n“Hey, what’s wrong with drifting?” Jin counters loudly, the wine clearly having taken control of the knob on his volume control as he settles back into the couch. “Drifting is nice. A new city every month. Life just makes the decisions for you. Well, Corporate does, anyway. It’s simple. Easy.”\n“Maybe it’s easy for a reason,” Yoongi mumbles into his wine, and he feels rather than sees Jin’s eyes on his face. Yoongi’s eyes flit up nervously over his wine glass, and sure enough, Jin is looking right into his face.\nHis eyes sparkle black in the dimly lit room, and Yoongi almost thinks he’s made a mistake. But then Jin smiles, a weird tension lingering around his eyes, though his laugh is light.  “Well aren’t you just a regular Dr. Phil when you’re drunk?”\n“I’m not drunk,” he replies, prickling up defensively. The space between them is dense, smaller than he had originally thought, and Yoongi realizes how tense his body has become. He licks his lips nervously, heart thrumming to life through his clothes when Jin lowers his eyes to Yoongi’s mouth to follow the motion. The movement of his eyes is lazy, glazed and honest with alcohol. “I’m just not bullshitting you. You’re probably not used to the feeling.”\n“And what is that supposed to mean?” Jin demands, an incredulous smile on his face.\nYoongi scoffs, hiding his discomfort in his wine glass. The dry red is just on the side of too dry, a little bitter on his tongue. “Nothing.”\n“No, please do go on, Doctor,” Jin encourages him, forcing a chuckle and encroaching further on Yoongi’s space.\n“Oh come on,” Yoongi blusters a little, “That face? That smile? God- even the nature of your job. You think that anyone around you is ever willing to tell it to you like it is? You think anyone even looks hard enough or long enough to see anything but-” he waves his hand flippantly in the direction of Jin’s generally stunning visage “- all of this? They’re all under your little spell.”\nBut Yoongi thinks that maybe he really did fuck up this time, because there is a harsh ugly line marrying the soft planes of Jin’s face, a crack in the smooth marble of his forehead, a crease between his brows. Yoongi can’t tell if Jin is just drunk, or mad, or horny, but the intensity of his gaze stirs a fire in his stomach. “But you’re not?”\n“No,” he declares, and he wishes his voice hadn’t chosen that exact moment to waiver. Jin smiles then, but it’s not his usual kind smile. It’s lop-sided and smoldering and just on the side of too bitter, like the wine, and something in his black gaze looks like it wants to test Yoongi’s defiant statement.\n“So then,” Jin says shortly. “Go ahead.”\nFor one terrifying, fleeting second, Yoongi thinks that Jin has just given him permission to kiss him, before he realizes how ridiculous that would be. “What?”\n“Tell it to me like it is.”\nYoongi hesitates, because Jin isn’t relenting in his intensity, isn’t backing away. “You told me that you move to cope. You drift. But everything about you- everything- screams roots.”\n“Roots?”\n“Roots,” Yoongi confirms. “Like... friends. A community. A home. A purpose. A goddamn Karaoke Bar. I don't know. Stuff you can’t really when you’re drifting from place to place.” He still can’t read Jin’s expression, so he just goes on, and his tongue has run away with him again. “I mean, I guess some people can, but not you. You’re like... detached. Completely mobile, ready to pick up and leave at any time. You don't bring anything or anyone with you when you go. And that just doesn’t seem like you.”\n“Well I guess you’d know better than anyone, right? Since you’ve known me for all of two months?”\n“I’m just saying,” Yoongi persist, “If you’re unhappy, do something about it. Don’t just drift along waiting for it to get better.”\nJin’s face is carefully blank. “Who said I was unhappy?”\n“I …You- You didn’t,” Yoongi backtracks, stomach flipping in panic. “Sorry.”\n“No, it’s fine,” Jin insists with a cheap, artificial brightness, and Yoongi tries not to read too much into his weird smile. “Really, it is. It's an interesting perspective.”\n“Just ignore me. I think I must be drunk after all,” Yoongi says before taking a deep, calming breath. “Uh, I should get out of your hair. It's late. Thanks for dinner.” He braces his hands on the couch, preparing to push himself to his feet, but then there is the softest, warmest feeling of skin on the back of his hand, and he knows logically that there is no way that it’s Jin’s hand, but it is.\n“Wait,” Jins whispers, like he’s afraid that if he says it quietly enough, it won’t be as humiliating. And Yoongi knows Jin is drunk now, because sober Jin would never allow himself to sound that fucking wounded. “Can you just stay for one more drink? I don’t want to go to sleep yet.”\nHe should leave. He knows that. He also knows he won’t.\n“Sure.”\n \n \n \nJin snores lightly with his head resting on Yoongi’s lap and his mostly empty glass of red wine balanced precariously in his left hand.\nIt feels a little illicit, watching Jin sleep like this. Too intimate. Even though Yoongi sees his dumb, remarkable face daily, he is constantly aware of keeping his gaze light, of stopping his eyes from lingering too long. He is always pulling his focus away, to the dull gray wall, or to Hoseok's face, or to his own chewed nails, like he’ll be burned if he allows himself to look, really look.\nThis is all for good reason, Yoongi thinks. Because now he is drowning in a dangerous haze of red wine and Jin, and he was right. It burns.\nHe shifts to leave, because he has to, but of course Jin's eyes flutter open blearily, and Yoongi is caught.\n“Hey. Thank you,” Jin mumbles thickly, eyelids heavy.\n“For what?” Yoongi asks quietly, watching intently as an impossibly soft smile graces Jin’s delicate features, his lashes fanned out pretty against his skin when he blinks.\n“For today. It was actually an unusually good birthday.”\n“Despite the manhunt?”\n“Despite the manhunt,” Jin confirms, his eyes gently closing again.\nYoongi doesn’t know why he says it, but he can’t stop himself. “Jin?”\n“Yeah?” Jin mumbles, his lips barely moving as he slowly drifts back towards his deep wine-induced sleep.\n“Are you?” Yoongi asks, slightly startled when he realizes that Jin cannot in fact read his mind and so he should probably clarify. “Happy?”\nJin snuggles into Yoongi’s thigh, his wry smile rather out of place alongside his otherwise peaceful expression. “Sometimes.”\n \n \n“I DID IT.”\nYoongi startles so hard that he emits an embarrassing high-pitched squeak, knees crashing against the bottom of his desk as he twitches in shock. His heart rate does not slow when he sees who it is.\nJin looks like he hasn’t slept since Friday, his usually carefully-pressed clothes wrinkled and his hair uncombed.\n“You did… what?” Yoongi asks in the steadiest voice he can manage. He had fully expected their Monday morning to be awkward, considering the events of the Jin’s birthday.\nBut if Jin is content to pretend that they didn’t wake up in an embarrassingly intimate embrace on Saturday morning, so is he.\n“I got a meeting with the CFO.” Jin’s eyes are shining in a scary, intense way.\n“Oh… good?”\n“Not just good, Yoongi. Great. We can pitch her the idea of another hiring another accountant. I was thinking about it, and honestly, if we just funnel all of the wasted profits into the salary for another accountant, I think we could make this work.”\n“O….kay,” Yoongi agrees uncertainly, his enthusiasm tempered by his concern for Jin. “Are you… good?”\n“Me?” Jin demands, unblinkingly, his right eye twitching tellingly. “I’m great. This is great. Today is the future. Tomorrow is now.”\n“You’re freaking me out,” Yoongi tells him honestly, rolling back his chair a few inches cautiously. “You seem… not okay.”\n“Sorry,” Jin seems to realize, backing away slightly. “I haven’t slept in a while, and my brain is floating above my body.”\n“Hey, why don’t you like… sit down for a second.” Yoongi gently guides him to his cubicle. “When’s the last time you ate?”\n“Like…” Jin ponders as he flops into his rolling chair, which wobbles slightly under his weight. “Holy hell, Yoongi. I skipped first breakfast.”\n“It’s okay,” Yoongi reassures him hurriedly, seeing the panic in Jin’s eyes.\n“It’s not okay,” he moans, eyes wild. “I told you. I don’t skip meals. My body…”\n“Yeah, yeah. Microchip. Right. It’s gonna be fine. I, uh, I think there are some pastries in the vending machine downstairs. I’ll… I’ll be right back. Don’t move.”\n“Now that I’m down, I don’t think I could move even if I wanted to,” Jin mutters, looking utterly dazed. “The most important meal of the day… I can never get that meal back, Yoongi…”\n“Just… stay…” Yoongi urges him, backing away worriedly, then taking off at a light jog towards the stairs.\nAs it turns out, there are several kinds of pastries in the vending machine, and Yoongi impulsively shoves a $20 into the machine, fingers flying as they drop one by one into the retrieval slot. Arms overflowing, he walks briskly up the stairs, too impatient to wait for the elevator even as his legs burn.\nHe bursts through their office door as casually as he can but still breathing hard. Jungkook gives him a suspicious look but thankfully says nothing as Yoongi retreats to their isolation corner. Jin is still right where he left him, leaning back in his office chair and groaning lightly. Adorably pathetic.\nYoongi allows the small avalanche of pastries to spill onto Jin’s desk, grabbing a promising looking Danish and tearing open the wrapper.\n“Here,” he says as he offers it to Jin, whose head rolls forward at the crinkling sound of the wrapper. Jin takes it weakly, but after only a moment’s hesitation, he heatedly crams the entire thing into his mouth. Yoongi just watches, awed at the sheer volume of Jin’s oral cavity. “Better?”\nJin just groans affirmatively around the pastry.\n“Aren’t you the one who usually lectures me on taking better care of myself?” Yoongi asks, brushing a few crumbs from Jin’s rumpled shirt, then jerking his hand away when he realizes how strangely intimate the gesture seems. His eyes dart up to gauge Jin’s reaction, but if he finds it similarly strange, he conceals it well. “I mean, don’t get me wrong, I appreciate you getting the meeting and everything, but… Is it really that important?”\n“I just…” Jin starts when he has swallowed enough of the pastry, “Really want to make it better for you... y-you guys,” he adds hastily. “Do some good before I leave.”\nYoongi swallows hard. “Yeah, I guess that’s pretty soon, isn’t it?”\nJin’s chewing slows, his eyes finding Yoongi’s. “Yeah.”\n“I suppose we’d better get to work, then,” Yoongi reasons, eyes flicking down to Jin’s plump, pink lips where a single crumb clings.\nJin straightens up, brushing the crumb from his mouth and turning to shuffle through some papers on his desk. “I’m thinking that we should have a working budget, a budget history, and a visual presentation. I’m heading up to meet her in a couple of weeks. I guess we'll officially be done, then.”\n“A couple of weeks?” Jimin exclaims, but all that’s visible of him from over the half wall is his tiny nose and wide, dismayed eyes. “You’re leaving in a couple of weeks?”\n“Jesus, don’t you people knock?” Yoongi demands, hand clutched over his racing heart.\n“You want me to knock on your half-wall?”\nYoongi splutters, ignoring the comment. “How would you like it if I just barged in on you and Tae?”\nJimin considers him seriously for a moment. “Sounds kinda hot.”\n“What do you want, Jimin?”\n“I just wanted to give you these,” Jimin replies, reaching over the cube wall to hand them two envelopes. “Your invitations or the Jammies. Congratulations, you have both been nominated! Jin, you’ll stay long enough to come, right?”\n“I should be able to make it,” Jin reassures him kindly.\n“Good! It’s gonna be lit!” Jimin’s eyes crinkle in glee, and it's clear that he’s beaming even if they can’t see his mouth. “Seeya!”\nWhen he’s gone, Jin opens the envelope in his hand, looking gleeful. “My first Jammies. I’m both excited and terrified.” His eyes skim the paper then roll back briefly in his head. “It’s at the Karaoke bar, and the dress code is ‘Black Ties, Zipped Flies.’ Do they really have to specify?”\n“Have you met us?” Yoongi asks dryly.\nJin considers for a moment. “True.” He carefully slides the paper back in its envelope. “Actually, this works out really well. The Jammies are right after the big meeting, so it’ll be a good opportunity to say goodbye to everyone. It’s kind of perfect.”\nYoongi swallows down his bitter disappointment, turning back to his desk so that he doesn’t have to see Jin looking so utterly okay with the prospect of leaving.\n“Perfect.”\n \n \n“The Party Planning Committee humbly requests additional funds to help spread Christmas cheer and turn the fuck up.”\nTaehyung is wearing a red, blinking Rudolph nose and antlers, and a leash hangs loosely from his neck. Jimin clutches the end of it proudly in his tiny hand.\nYoongi blinks once, lazily. “The Party Planning Committee can suck my massive-”\n“Hey guys, what’s up?” Jin says, appearing in the entrance to Yoongi’s cubicle behind Taehyung and Jimin.\n“Oh, hey Jin,” Jimin greets him with a sweet, dangerous smile, shooting him an obnoxious pair of finger guns. “Looking good. Interesting sweater choice.”\n“Uh, thanks, Jimin. You guys look…. Festive.”\n“Just trying to bring a little Christmas spirit into this sad, cube-y little world,” Jimin says, giving Tae’s leash a little tug. “Actually that’s what we wanted to talk to you about. We need more money for the Christmas party.”\n“You do realize that he’s the guy who came here to cut our budget, right?” Yoongi drawls passively, flicking the head of his little Kumamon bobblehead with one finger.\n“What happened to the money we already gave you?” Jin questions them, expression cautious, borderline suspicious.\n“Those funds have been exhausted,” Taehyung says with a shrug, the movement rattling the metallic closure on his leash.\n“On?” Jin presses.\n“Christmas-related office expenses,” Jimin replies vaguely.\n“Can you be a little more specific?” Jin requests politely, and honestly Yoongi is impressed with his patience. If this was Namjoon, that little vein in his forehead would be throbbing by now.\n“Not at the present moment,” Taehyung informs them with a serious nod.\n“How much do you need?”\n“$300?” Taehyung asks, his smile cringing and fearful.\n“What the hell do you need $300 for?” Yoongi demands, accidentally flicking his bobblehead too hard and sending it careening across the surface of his slick desk.\n“Food, drink, hookers, blow?” Taehyung ticks off the items on his fingers like it’s the most obvious thing in the world. Jin squints, cautiously appraising Taehyung’s unchanged expression.\nJimin giggles nervously and pats Taehyung gently on the shoulder. “He’s kidding. What he means to say is that, well… Ever since the whole thing with Corporate- no offense Jin- the guys have been feeling a little down.”\nHis statement is punctuated by Hoseok’s obnoxious, screaming laughter as it echoes across the office walls.\nJimin pointedly ignores this as he continues. “The future is just… so uncertain, so we just wanted to make this an extra special Christmas. I mean, who knows?” His tiny, square eyebrows crinkle sadly, and he looks rather like a kicked puppy. “Maybe this could be our last Christmas together.”\nYoongi rolls his eyes and leans back in his chair. There are a few moments of silence where Jin carefully chews his bottom lip, eyes flicking back and forth between Taehyung and Jimin, then finally over to Yoongi.\n“I can’t justify more money from the company budget,” Jin says carefully, now looking solely at Jimin and Taehyung, whose faces fall spectacularly. It might even be a little sad if it wasn’t so comical. Taehyung’s still-blinking nose has slid part-way down his face, “But maybe I can help a little.” He reaches into his back pocket, pulling out his wallet and fishing around inside. He holds out several large bills, and Jimin and Taehyung’s faces light up like Christmas trees. “Here. Take it. Merry Christmas,” Jin says sweetly and with a smile that makes Yoongi’s insides feel like warm applesauce.\n“Oh, come on!” Yoongi exclaims, eyes trained on the cash in Jin’s hand.\nTaehyung snatches the bills without a second thought and marvels, “Damn, are you looking to adopt a 25-year-old man, Daddy Warbucks?” Jimin elbows him sharply in the ribs, and Taehyung clears his throat. “I’m sorry, make that two 25-year-old men.”\nJimin at least has the decency to look marginally guilty. “Are you sure? That’s a lot of money.”\n“A small price to pay for a bit of Christmas cheer,” Jin assures him with another sweet smile, one that Jimin and Taehyung return tenfold. “But hey, only booze, okay? Pinky swear?”\n“Pinky swear!” they should in tandem, raising their pinky fingers in a solemn oath before retreating quickly to their desks, like they’re afraid that if they stay a moment longer, Jin will change his mind.\nYoongi scoffs half-heartedly, significantly less annoyed than he wishes he was. “You know they’re playing you, right?”\n“Of course. But it’s Christmas, so I’ll allow it,” Jin replies good-naturedly.  “Plus, the company pays me pretty well to do what I do. Believe it not, there aren’t actually all that many qualified people who want the job.”\nYoongi is on the verge of biting back with something brash, but Jin’s smile is a little sad, so he swallows down his words.\n“You coming to the party, then?” Yoongi asks, trying not to sound too interested.\n“I wasn’t sure I was invited,” Jin says cautiously. “I’m not really one of the gang.”\nYoongi spins around in his chair so that he’s facing away from Jin and hunches over his desk, opening up a random spreadsheet and clicking around without purpose. “It’s an office party. You’re an employee of the office, aren’t you?”\n“Yeah… I guess I am,” Jin confirms hesitantly.\n“Then… whatever…” Yoongi gestures vaguely, his back still turned, face aflame with embarrassment. “You’re one of the gang.”\nIt’s a moment before Jin speaks. “Thanks, Yoongi.” Yoongi scowls at the computer screen when he hears the smile in Jin's voice.\n“Yeah, thanks Yoongi.” It’s Hoseok, looking smugger than any man wearing a sexy Santa outfit over his business suit has a right to look. “I was actually on my way over to invite Jin myself, but it looks like you beat me to it. So, you’re coming, right?” He addresses Jin this time.\n“Oh, uh. Yeah, if that’s okay. It’s not like I have anywhere else to be.”\n“Great! It’s tomorrow night at Jimin and Tae’s place, so just be as ready for that as you can be. And make sure you come ready to overconsume in every possible way. Oh and I will have HR relationship disclosure forms at the party just in case-…. just in case,” he finishes with a saucy wink at Yoongi. “Okay, see you then!”\nYoongi half-rises from his seat as if he’s about to chase Hoseok down and beat his ass, but he ultimately decides against it. As he settles uneasily back into his chair, his eyes happen to catch the clock on his computer.\nIt’s 5:02 pm. On a Friday. He is free of his sexy, unbearable cube-shaped prison. He lunges for his bag without another word, logs out of his computer, and makes blindly to exit from his cubicle.\nAnd collides with something very warm and solid.\nHe stumbles back a few feet, heels catching on the edge of his ugly plastic floor mat, and he’s pretty sure he’s about to get a mouthful of desk until a pair of soft hands steady him.\n“Shit, I’m sorry!” Jin apologizes, hands tightening around Yoongi’s arms as Yoongi reels back violently, a natural reaction to physical contact with Kim Seokjin, and succeeds in dragging Jin backwards with him as his ass comes into contact with the surface of his desk. The resulting position finds Yoongi seated on the desk, legs wrapped around Jin, whose hand is splayed on the cube wall to steady them and whose face is far too close for comfort. There is a sharp, biting pain in his ass, but he finds that Jin’s facial proximity is much more immediately pressing issue.\nFor a moment, it’s easier not to move. It’s easier to just sit there and pretend he’s not enjoying the feeling of Jin’s solid body hovering over him, because he knows the second they move, one of them will have to say something, and he has no fucking clue how to walk away from this situation unscathed.\nSo Yoongi says the only thing he can think to say.\n“I stapled my butt.”\n \n \n“I hate him,” Yoongi seethes, a glass of eggnog clutched tightly in his fist. Taehyung buzzes around him in a little apron, straightening up the place. “He laughed so hard.”\n“Can you blame him? You stapled your own butt. That’s like top 5 best ass-related office incidents of 2016.”\n“How did that even happen?” Hoseok calls from the kitchen, where Jimin is making him taste the punch. “That does not seem physically possible.”\n“It happened,” Yoongi mutters venomously. “That’s all you need to know.”\n“He and Jin were totally going at it on his desk,” Jimin explains gently to Hoseok, who is cringing at the taste of the punch. “I saw them before Tae and I left go to buy the booze. Talk about abusing the isolation corner.”\n “Oh fuck off. That would never happen. Sworn enemy, remember?”\n“Ah, of course. That explains why you invited him here,” Hoseok reasons. “And why you bought that expensive cast iron skillet for the Dirty Santa gift exchange despite the fact that a solid majority of our office has been effectively banned from all kitchens, everywhere.” Taehyung high-fives Namjoon in the corner of the room. “Yes, it’s all making sense now.”\n“A cast iron skillet is a perfectly reasonable gift with extremely generalized appeal,” Yoongi maintains, inconspicuously shifting the oddly wrapped gift underneath his chair with his foot.\n“Yeah and there’s no way you just happened to overhear Jin in the break room last week talking about how he had lost his precious cast-iron skillet in the move.”\n“I don’t need to explain myself to you,” Yoongi pouts, taking a very large sip of his eggnog and subsequently choking on it. “Wow, what the fuck is in this shit, Tae?”\n“I dunno, I just bought store eggnog and poured like two bottles of Everclear in there,” Taehyung says unconcernedly.\n“It’s… gritty,” Yoongi marvels, staring at his fingers after picking little bits of something off his tongue. “Is this glitter?”\n“It’s edible glitter,” Jimin assures him from the kitchen. “You’re very welcome for that, by the way, it was a close call.”\n“It’s aesthetic,” Taehyung defends himself, apron ruffling his hair as he pulls it off and tosses it into the corner. Jimin picks it up without a word of complaint, brushes it off, and hangs it up on a hook.\nA sharp knock on the door shuts them all up. Taehyung bounds for the door, all the while making a lewd gesture directed at Yoongi. He swings the door open with so much force that it the doorknob slams into the wall. (“Watch it, Asshole,” Jimin scolds him.)\n“Seokjin!” Taehyung greets him in what is obviously meant to be a dignified tone. “So glad you could make it.”\nYoongi’s stomach clenches uncomfortably. Jin’s chic black sweater and leather jacket stretch across his broad shoulders, hair pushed carefully back. His sparkling eyes sweep the room with caution, finally settling on Yoongi, and Yoongi has no choice, he has to look away. He finds temporary comfort in the subtly shimmering drink in his hand. It’s strangely pleasing. Aesthetic, he thinks absently.\n“Hey, guys,” Jin says, raising his hand in awkward greeting. He’s got a weirdly wrapped gift tucked under his other arm. Yoongi shifts again so that the very obviously pan-shaped gift behind his feet is obscured further from view.\n“You look like you need a drink,” Taehyung says, grabbing his arm and leading him to the kitchen. Namjoon switches on some music, and now it feels a little bit more like a party and less like seven guys just sitting the house. Jungkook and Namjoon start bickering quietly over the music selection.\n“I really do,” Jin declares, setting down his gift on the table and glancing nervously at Yoongi. Jimin is by his side in a moment shoving a small cup of lurid, red liquid into his hand.\n“Here, have some punch,” Jimin urges him. “I made it myself.”\n“Oh, thanks Jimin,” Jin says as he takes the cup and brings it cautiously to his mouth. A small, anticipatory smile from Jimin has Jin flashing a nervous but accommodating grin and tipping it back into his mouth. For a second, he looks like he’s about to throw up, but he manages to swallow it down politely. “Jimin, I say this with a great deal of affection, but what the fuck did you just make me put in my mouth?”\n“It’s Christmas punch,” Jimin tells him, looking proud.\n“It’s vodka and red food dye,” Hoseok supplies helpfully, throwing back a cup of Christmas Punch himself and cringing delightedly as it hits his throat.\n“Well, this evening is going to devolve spectacularly,” Jin states with a wild, fearful smile.\nHe’s not wrong. They don’t quite make it to Dirty Santa.\nThe closest they get to Dirty Santa is Jimin drunkenly tearing open his own gift, an edible candy thong, and flinging it at Taehyung’s face. This prompts Taehyung to break down into ugly tears, snacking on the underwear as Jimin pats his back consolingly and presses a little kiss to his forehead and the party rages around them.\n“Are you sure they’re not a thing?” comes Jin’s voice from close behind him. Yoongi fights the impulse to turn around.\n“They’ve been like this forever,” he tells him, watching as Jimin wipes the dripping snot from Taehyung’s face, “Since college. Believe me, I would know.”\n“What does that mean?” Jin asks, intrigued. Yoongi spares him a glance and immediately regrets it. His cheeks are flushed an attractive pink, and his eyes are sparkling. It’s like magic, or alcohol.\n“It means I used to have a thing for Taehyung,” Yoongi admits, and he know he wouldn’t have said a goddamn thing if it wasn’t for the Christmas Punch. “So I like to think that I was pretty well aware of his relationship status. They are honestly just friends. Close friends.”\n“You used to have a thing for Taehyung?”\nYoongi nods solemly. “I also used to wear a trucker hat. We all make mistakes.”\n“You know, I actually feel like you and Taehyung would kind of work,” Jin muses, “In like, a hot, chaotic kind of way.”\n“Well then, you think a lot like 20-year-old Min Yoongi,” he muses before pausing confusedly. “Wait… hot?”\n “Guys, me and Jimin have to give you your Christmas presents before I go throw up,” Taehyung insists, throwing an arm around their necks. “Come with me.”\nJin shoots Yoongi a wary look before reluctantly allowing himself to be led back into the bedroom.\n“Is this Taehyung’s house?” Jin whispers covertly to Yoongi once they are free of Taehyung’s sweaty grip, huddled into the dim bedroom.\n“Jimin and Tae both live here,” Yoongi whispers right back, glancing around the dark room. A flurry of vague movement and a medley of other hushed voices tell him that the rest of the guys have joined them.\n“There's only one bed.”\nIt’s an interesting point and one that Yoongi’s brain honestly considers entertaining, until Jimin’s voice jars him from his borderline contemplative state.\n“I guess you’re wondering why we brought you here,” Jimin announces grandly, face obscured in the darkness.\n“Turn on a fucking light,” Hoseok whines beside him.\n“We will turn on the lights when we damn well feel like it,” Taehyung mutters defensively from the back of the room.\n“Hey Tae?” Jimin’s voice comes from in front of him.\n“Yeah?”\n“Turn on the lights.”\n“You got it, boss.”\nThe brightness is blinding. At first, all Yoongi sees is wriggling little green and red shapes.\nThen there is an affectionate cry of “Garbage!” from somewhere to his right, and Yoongi knows instantly what he is seeing.\n“Did you buy tiny cat sweaters with company money?” Jin asks in quiet wonderment.\n“That depends on how adorable you think this is,” Jimin replies evasively obviously trying to gauge Jin’s reaction.\nJin doesn’t respond, just gazes on at the squirmy, sweatered little mass of kittens. One in particular stands out, sprawled horizontally across its siblings’ faces as they try to quietly feed. “Aw, look, it’s Murderer,” Jin points out softly, and Yoongi feels a swell of affection.\n“We have now reached the point in kittenhood where you may touch and love the babies,” Taehyung tells them with a gooey smile. “Please, go forth, and bond.”\nEveryone lunges enthusiastically forward to play with the kittens. Hoseok seems to be offering his uninterested kitten a sip of Christmas Punch, while Namjoon’s sits calmly atop his head. Jungkook just stares at his, until he gets a little teary-eyed and has to look away.\n“Poor Garbage looks like she could use a break,” Jin gently elbows Yoongi, gesturing down to where the remaining squiggly little kitten is currently thrashing gently on her mom’s face.\n“Oh, right,” Yoongi starts a little, reaching down and carefully scooping up the warm little ball of cat into his hands. Her thrashing only escalates. “Wow, she’s a fiery little one.”\n“It’s usually the little ones you have to worry about,” Jin muses from beside him, extending a cautious finger to gently scratch at the top of Murderer’s tiny head. Yoongi glares with all of the intensity that he can muster but feels himself physically deflate when he gets a good look at Jin’s affectionate smile. Jin plus kittens is a lot.\nHe’s also the only one without a kitten of his own, Yoongi realizes as Murderer sinks her tiny, razor-sharp teeth into his thumb. Jimin, Taehyung, and Garbage already look like a little family, and the rest of the guys are already paired off with their own tiny balls of fluff. Murderer is still thrashing dangerously in Yoongi’s hands, and Jin’s just looking on, affectionately, but at a distance.\n“Do you, uh, want to hold her?” Yoongi offers quietly, extending his hands towards Jin.\n“Yeah,” Jin responds with a lovely smile, and yep, Yoongi would do anything to see that smile again. Jin reaches forward to carefully cup the kitten in his hands. “Thanks.”\nTo Yoongi’s complete and utter surprise, Murderer’s violent thrashing ceases with a surprising haste in Jin’s firm but tender grip.\n“What the hell…” he breathes as Jin brings the now serene animal to his cheek and nuzzles it tenderly.\n“I think she likes me,” Jin giggles as the little kitten nuzzles him right back.\n“Not even a fucking murderous cat is immune,” Yoongi mumbles grumpily, but with an edge of awe.\n“Huh?” Jin asks, head snapping up to look at Yoongi.\n“Nothing.”\n“Aw look at you guys,” Hoseok observes loudly and mockingly from across the room. “Bonding over pussy. Nobody would have expected that. Literally nobody.”\nYoongi gropes around for the nearest throw pillow and is about to chuck it in his general direction, until Hoseok clutches his kitten and raises it in front of him like a shield.\n“You’d better carry that kitten around on a full-time basis, fucker,” Yoongi swears, glaring daggers.\n“It’s uh… getting a little crowded in here. I think Murderer needs some air,” Jin says significantly, clearly trying to diffuse to situation. “What do you say we show this little killer the world beyond Jimin and Tae’s sex den?”\n“Their what?” Hoseok scoffs in amused disbelief, resting his arm on one of the company’s industrial-sized containers of lube. The movement jostles the metal fastener of the reindeer leash, which hangs loosely from one of the bed posts.\n“Come on, Yoongi,” Jin urges, gently tugging him away, stepping gingerly over the rest of the guys, who are sprawled out on the floor, kittens crawling all about. Yoongi allows himself to be led, staring intently at his own hand in Jin’s. Hoseok wolf-whistles mockingly, and Yoongi kicks out on instinct, his foot narrowly missing Hoseok’s face because Jin yanks him away just in time.\nJin pulls the door shut behind them, and the loud chatter from inside the bedroom dulls slightly.\n“I know you probably weren’t actually going to fight him but I figured better safe than sorry.”\n“You have no clue what I am capable of. I gave him an honest-to-god swirlie once.”\n“That’s gross, Yoongi.”\nYoongi just shrugs and subsequently trips over the corner of a rug. Jin’s hand on his elbow steadies him, and he waves him off. “I’m fine, I’m fine. I’m not drunk.”\n“…is exactly what a drunk person would say,” Jin adds quietly, stepping carefully over the wreckage of the living room and making sure that Yoongi doesn’t trip as they make their way towards the balcony door. He slides open the door, and the two off them step out into the brisk night. Jin gently plucks Murderer off his shoulder and tucks her securely into his jacket to shelter her from the cold and wind.\n“You guys sure know how to throw a party.”\n“You should see our Easter bash. Utter debauchery,” Yoongi swears, huddling his jacket closer around his thin body and leaning on the railing in front of him. “You ever seen a man in a giant carrot costume taking a body shot off of the Easter Bunny?”\n“I can’t say I’ve had the pleasure.”\nYoongi flips through a few of the albums on his phone until he finds what he’s looking for. He angles the screen towards Jin. “Now you have.”\n“Why do all of the photos you take look vaguely like fetish porn?” Jin marvels as he tilts his head to get a better look.\nYoongi just shrugs, pocketing his phone. “It’s a gift, I guess.”\nJin stifles a chuckle. “You seem to be a man of many gifts,” he says, an odd tone of superiority in his voice, “Gloss.”\nYoongi’s head whips around so fast that his neck actually cracks. “Those bitches.”\nJin cackles gleefully, clapping his hands like a seal.\n“Who told you?”\n“Nobody, actually. Tae was actually listening to some of your tracks in the breakroom one day, and I asked who it was. His face told me enough.” He pulls out his own phone now, fingers flying for a second before he offers the device to Yoongi. “I found your SoundCloud.”\nYoongi groans, draining his drink in one go. “Fuck.”\n“It’s really good, Yoongi,” Jin assures him, trying to catch his eye to emphasize his sincerity. “Really good.”\n“I know it’s good,” Yoongi snaps. “Genius, remember?”\n“There’s nothing new on here since 2012. Is that when you stopped?”\n“I didn’t… stop,” Yoongi grunts, “I still write and produce. Just, not for myself.”\n“Spotlight wasn’t for you?” Jin asks, and it would be very easy to think that Jin was teasing him, if Yoongi didn’t know better. He makes the mistake of looking at Jin, whose gaze is heavier and more appraising than his tone would suggest.\n“I don’t have the temperament for it,” he acknowledges, careful with his words. “I’m hyper-critical, antisocial, and prone to obsession.”\n“Sounds like a lot of artists.”\n“Yeah, and why do you think so many artists self medicate?”\n“True,” Jin allows. Then, with a forced air of lightness, “Is that, uh, what you did?”\nYoongi takes a larger than necessary sip of his heinous drink to buy himself just a few extra seconds. “I wasn’t suited for scene like that. Especially since I was going it alone and refusing to ask for help.” He pauses, picking hard at his nails. “It was brutal and volatile and just…wild. Too many bad ways to cope. But people don’t throw around serious terms when you’re young, you know? You’re just young. Enjoying the life.”\nJin just nods understandingly and subtly shifts a little closer. Yoongi appreciates the barely-there contact, but he hopes his face doesn’t betray him.  “And now?”\n“Now… I’m not alone.” He says simply, jerking his head in the vague direction of the apartment behind them. Yoongi can hear Hoseok's muted screaming coming from inside, followed by a screeching laughter. His heart gives an affectionate pang. \n“They really do love you, you know,” Jin adds softly, shifting so that the kitten in his jacket is no longer slipping. “Plus, now you’ve got this little one, too.”\n“She is pretty cute, isn’t she?” Yoongi coos, turning towards Jin so that he can scratch the head of the tiny dosing kitten, as it peeks out from Jin’s jacket. If he was sober, he would probably be cognizant of the fact that he is, in fact, too close to Jin, but as it is he remains ignorant. That is, until Jin cranes his head down to try to get a better look for himself, and wow he’s close.\n“I’ve always wanted a cat,” Jin confesses, and maybe he’s ignorant of their proximity too, because neither of them is moving away.\n“Why don’t you get one?”\n“Why else? My job. I travel too much.”\nYoongi feels his lip curl in displeasure, turning away to face the balcony as he grumbles under his breath.\n“Yoongi, you are not grumbling nearly as quietly as you seem to think you are.” Yoongi’s ears are on fire, the cold breeze licking bitterly at them, and it's a strange sensation. “Come on, out with it,” Jin prompts him.\n“Not my business,” Yoongi refuses shortly, remembering the last time they had this conversation.\n“Oh, come on,” Jin prompts him. “You’re my friend. I value your opinion.”\nYoongi is very conscious of the fact that Jin can probably hear his audible gulp. He heaves a great sigh, the cold air burning his lungs. “Well, you already know my opinion on this.”\n“On what? Roots?” There is a clear, teasing tone in Jin’s voice, so Yoongi just twitches a stiff, awkward nod in response. “This sounds suspiciously a lot like caring, Min Yoongi,” Jin goads him gently.\nYoongi rolls his eyes and scuffs his foot against the concrete. “It's just fucking dumb is all.” He can feel Jin staring at him, and he feels like he’s melting into a tiny useless puddle on the floor. “I mean, dude, you’re basically built for roots. People like you, you just like… fell into our group like you’ve always been there. You could have a real home… with a stupid cat. You could have-” He breaks off with an impulsive, dangerous word on his tongue.\n“What?” Jin pushes, still smiling, but his eyes have gone very sharp and serious as he orients his body towards Yoongi.\n“Nothing,” Yoongi says quickly. “I dunno.”\n“I could have what, Yoongi?” Jin breathes, and his smile is gone. The air around him feels less bitterly cold, and Yoongi realizes it’s because Jin is so close now.\n“I mean, haven’t you…” Yoongi starts. He knows he’s staring at Jin’s lips, but he has a feeling that looking into Jin’s eyes would be even more dangerous. “Haven’t you ever been tempted to try?” Yoongi probes in what the Christmas Punch assures him is a subtle approach. “To just… try?” he ends lamely.\nJin seems to be considering something carefully, and the silence is maddening. He chews on his bottom lip, and that’s officially too much. Yoongi balks, panicking, and he’s looking into Jin’s eyes. Trapped.\n“Of course I have,” Jin confirms after what feels like an eternity.\n“Then why don’t you?” Yoongi asks him, shuffling a half-step forward and fully expecting Jin to back away. He doesn’t.\n“Well,” Jin almost whispers, his faces suddenly much closer than Yoongi had thought it was, and if anyone had told Yoongi that he would ever see these lips this close up, he would have called them a liar. “I’m a fucking coward.”\nJin's going to kiss him. Even as he warns Yoongi off, pushes him away, he’s going to kiss him, and Yoongi knows it. Jin’s breath puffs hot against his mouth, even hotter in the frigid air around them. Yoongi is terrified, frozen in place, closer to Jin than is physically comfortable. This is distinctively uncomfortable and wonderful and terrifying.\nA jarring squelching noise like skin against glass startles them, and they scramble madly away from each other before turning to see five desperately interested faces pressed against the sliding glass door. Their audience scatters comically fast, tripping over each other in a drunken effort to get away. Jungkook does a lop-sided somersault and goes crashing into the coffee table.\n“Fuck. Um. I’m actually gonna get going,” Jin says abruptly, pulling the kitten out of his jacket and handing her to Yoongi hurriedly. He sounds slightly out of breath.\n“What?” Yoongi mumbles, hands scrambling to secure Murderer in his grasp.\n“Yeah, uh. Sorry, just. S-see you Monday,” Jin stutters, striding past, head tucked.\n“Oh hiya, Jin! So weird running into you like this-” Hoseok’s muted voice comes from inside when Jin slides open the door and steps through. Then there is a click, then there is silence. He leaves one impossibly confused and conflicted Yoongi in his wake.\nYoongi allows himself a few moments to collect himself, petting his cat mindlessly.\n“Now listen,” Hoseok cautions him, his own kitten raised in front of him like a protective barrier as Yoongi enters the apartment, “I know we basically just collectively cock-blocked you, but hear me out.”\nYoongi heaves a great sigh and collapses weakly onto the couch. “It wasn’t gonna happen anyway,” he admits, letting his head fall back onto the cushion.\n“What?” Hoseok demands, hopping eagerly onto the couch now that he knows Yoongi’s not mad. “Why?”\nBecause Yoongi is a fucking idiot. Because that asshole has fucking commitment issues, and because even if he didn’t, several hotness leagues would still separate them. Because on what planet would Kim Seokjin ever be into him. “Because he’s my mortal enemy,” Yoongi bluffs unconvincingly, and Hoseok pats him sympathetically on the shoulder.\n“Sure he is, buddy.”\n“Hey, who brought this present?” Namjoon asks, clumsily shaking a weird, shittily-wrapped gift. Without another moment of consideration, Namjoon tears through the paper, shredding it into tiny, useless pieces that litter the floor. Inside is a box, and inside the box is-\n“A fucking plant?” Namjoon whines in disappointment, pulling a small, spiky green thing out of the box. Yoongi’s throat is tight, and his heart flutters away like a hummingbird. It’s just a plant, he tells himself. It could be for anyone. It could be from anyone.\n“Who the hell would bring a plant to Dirty Santa?” Hoseok demands, squatting to get a better look at the tiny pot in Namjoon’s hand.\n“Jin, I think. I'm pretty sure his present was the only one unaccounted for,” Jungkook adds from the corner, legs slung over the armrest of a chair as his kitten snuggles into his chest.\nDoesn’t mean a thing, Yoongi assures himself. They had one conversation about plants. Once. Doesn’t mean a thing. Probably.\n“What the hell is wrong with it? Is it fake?” Jungkook asks, snatching it from Namjoon’s hands an examining it.\n“No, it’s real. Just weird looking. It’s a succulent,” Namjoon clarifies. “It’s kind like a cactus. You barely have to water it.”\n“It’s like the Yoongi of plants,” Jimin pipes up from the kitchen, where he is washing dishes. “Small, tough, and weird looking.”\nYoongi reminds himself give Jimin a swift thwack to the back of the head later, but right now, he is in the process of trying and failing to suppress his glee, because Jin bought that dumb fucking plant for him. He bought him a dumb fucking plant which even Yoongi couldn’t kill, because Yoongi had said he missed the green. Which means that Jin was thinking of him, which means… What the hell does it mean?\nRather than pondering the question, Yoongi finds himself shoving a still-drowsy Murderer into Hoseok's hands and wrenching open the front door before anyway can stop him.\nIt’s freezing, colder than the balcony by far, and he’s left his jacket inside, he realizes. But the important thing is that Jin is stepping into a taxi, and Yoongi’s going to miss him.\n“Hey asswipe!” Smooth Yoongi, real smooth. But it works. Jin freezes as he’s lowering himself into the cab, squinting hard to see who is heckling him. Yoongi takes the opportunity to trot over and put his hand on the door to keep it from closing. “Escort me home.”\n“What?” Jin asks, baffled.\n“I’m tiny, drunk, and pretty. Escort me home.”\nJin can’t help but laugh, stepping out of the way and motioning for Yoongi to get into the cab. “Where to, tiny drunk one?”\n \n \n“Do you want to come up for coffee?” Yoongi asks delicately. He vaguely remembers that his place is an actual mess, but that seems unimportant at the moment. They are idling outside his apartment as the taxi driver eyes them suspiciously in the front seat.\n“I… I don’t think that’s a good idea, Yoongi.”\nYoongi heaves a sigh, trying to read Jin’s face for any sign of relenting. He doesn’t find one. “You think too goddamn much,” Yoongi mumbles grumpily, fumbling for the door handle. “Whatever. Bye.”\nHe steels himself for the cold and slams the car door behind him, bracing himself against the wind as he trudges up to the entrance of his apartment building. It is several moments before he notices the sound of another pair of footsteps in addition to his own, and then a wide shadow joins his own on the building's wall.\n“God it's cold,” Jin complains as Yoongi struggles with his keys.\nEven in the warmth of his apartment, Yoongi’s hands still shake. They shake as he tosses his keys into the bowl on the front table, and they shake as he flips the light switch on, revealing a nervous looking Jin loitering in his doorway. The door is still slightly ajar behind him, like he knows that the minute it closes, something will change.\nYoongi is not accustomed to sudden bursts of courage, but he guesses that he has the Christmas Punch to thank for this one.\n“For fuck's sake,” he mutters, striding over to where Jin stands and slamming the door behind him. And then somehow Jin’s back hits the wood with a gentle thud, and his beautiful leather jacket is in Yoongi’s hands, then on the floor.\nYoongi hesitates only long enough to locate Jin's lips.\nAnd then Yoongi is moaning openly into Jin’s mouth as his hands scramble for a grip on those shoulders, pulling their bodies flush and feeling the heat radiating from Jin’s core even as his ice cold fingers grip at the back of Yoongi’s neck. And thank god, Yoongi must have actually read the situation right, because Jin's nails are digging into his skin as his tongue drags hotly against Yoongi’s.\nYoongi would be embarrassed of how fast he gets hard, if he didn’t feel Jin's own throbbing hardness pressing into his thigh. He shifts so that their erections are pressed together, and the sound that Jin makes in the back of his throat makes Yoongi want. Yoongi just wants and he wants, and he never wants to stop kissing Jin, until he realizes that there is actually one thing he actually wants a hell of a lot more.\nHis knees hit the wood floor so hard that he knows he is going to bruise tomorrow, but the anticipation of having Jin's cock in his mouth is more than enough to distract from the pain. Jin seems momentarily confused about what is happening, but by the time that Yoongi has undone his belt and ripped down his zipper, he seems to have caught up.\n“Fuck, Yoongi…” and Yoongi takes that as encouragement, yanking down Jin’s underwear, watching with delight as his thick, pink cock springs free. His mouth waters at the sight. “Yoongi, stop.”\n“What?” Yoongi asks, bewildered.\n“I can’t,” Jin mutters, face splotchy and hands trembling as he tucks himself back into his pants and zips them up. “I'm sorry.”\n“I’m… confused,” Yoongi says, rocking back on his heels. “Did you think we were actually going to have coffee?”\nJin shakes his head. “No, I just… I’m leaving. In a week.”\n“Yes. A fact that we were both well aware of prior to now,” Yoongi scoffs, pushing himself to his feet and feeling his erection straining almost painfully against his jeans. “Right?”\n“Yes, but-“\n“So what's wrong?”\n“I just… I don’t think it’s a good idea,” Jin says vaguely, trying to smooth his ruffled hair.\n“Okay,” Yoongi growls, heat prickling around his ears. “So why the hell did you even come up here?” he demands, but Jin just purses his lips, stuffing his hands into his pockets and rocking back on his heels slightly. Yoongi knows he’s not going to get an answer, and he swallows down a surge of anger. “It’s not like I’m asking you to fucking marry me. This is not a big deal.” He feels kind of ugly as he says it, and Jin actually seems to bristle, straightening up to his full height, his swollen lips pursing together primly.\n“Then I guess it won’t be a big deal if I leave.”\nIt’s like a cold, unpleasant stone dropping in his stomach, but he maintains his stony mask. “Be my goddamn guest.” He gestures to the door dramatically, ignoring the pang in his chest.\nJin just stands there for a moment, uncertainly chewing his lip, hair still adorably ruffled. “Yoongi…” he starts, but then he seems to think better of saying whatever it is he was about to say. Instead, he picks his jacket up off the floor and shrugs it on in the smothering silence. “Never mind,” he mutters, and his voice is unbearably hard.\nYoongi just opens the door in silence and stares hard at the wall, hating himself even as he does it. Jin hesitates, clearly wanting to say something more, but Yoongi won’t give him the satisfaction of anything that could be construed as encouragement. Finally, he sighs heavily and seems to give up, walking out through the door, head tucked, without another word.\nYoongi makes sure to slam the door loudly behind him.\n \n \nYoongi hasn’t been in a mood like this in years, and everybody knows it. On Monday morning, when he opens the door so hard that it slams against the wall, trudging through the entryway with his head down and headphones in, Hoseok breathes a small ‘Uh oh.’\n“What is it?” Namjoon questions him quietly as they watch Yoongi toss his bag into the corner of the cubicle, not sparing a glance to a rigid-backed Jin.\n“Remember the narrowly avoided Taepocalypse of 2010?” Hoseok asks them, craning his head to get a better look at Yoongi as he stomps to his cubicle.\n“Who could forget that fucking disaster?” Jimin mumbles, nuzzling his head into Taehyung's shoulder.\n\"Well I think we're too late to head off Hurricane Yoonjin.”\n“Noo,” Jimin whines, “All that work for nothing?”\n“Are you guys thinking what I’m thinking?” Taehyung pipes up from beside Jimin, clasping his hand gently.\n“That we have meddled too much already and need to let this ship die a dignified death?” Hoseok asks hopefully.\n“Hell no,” Taehyung exclaims, looking offended. “Don’t you want him to be happy? This is happening. We just need to take it up a notch. We've barely scratched the surface here.”\n“Be careful, Tae,” Hoseok warns. “I’m all for meddling, but he’s my best friend and he’s much more delicate than he looks.”\n“He’s my best friend, too, asshole,” Tae growls, ignoring a pointed elbow from Jimin. “So leave me to my work.” He switches his focus to Jungkook, who is leaning against his cube, pretending that he isn’t listening to the whole exchange. “Hey, you. Young one. I require your expertise.”\n \n \nDay one post-Christmas party is awkward at times and excruciatingly awkward at others. Apparently, Yoongi learns with dismay, he and Jin have synced up piss schedules, leading to two separate but equally awful trips to the bathroom where they stand side by side, holding their dicks in a thick, tense silence.\nWorse yet, they still have to finish the budget. Yoongi may be pissed and bitter, but he recognizes that he still needs Jin to talk to Corporate on their behalf. So instead of opting to be the bigger human by sucking it up and walking over to Jin to ask him how he wants to divvy up their remaining work, he decides to send a short, frigid email outlining the remaining tasks. To a man sitting 8 feet away.\nWhen he hears the little ping of Jin's email go off, he freezes, straining his ears for a reaction. He hears nothing for a few seconds, then there’s the sound of Jin’s chair rolling abruptly back, his heavy, angry footsteps becoming gradually quieter as he wrenches open the door and presumably disappears from the office.\n“Damn dude. What the fuck happened?” Hoseok asks, appearing suddenly at his cube entrance.\n“Nothing happened. Nothing was ever going to happen, and nothing will ever fucking happen again,” Yoongi growls through gritted teeth.\n“Again? I thought you said nothing happened.”\nYoongi just buries his head in his hands and exhales hard. “Please go away.”\n“Come on, dude.”\nYoongi slams down his pen and scoots his chair back abruptly. “JESUS fuck, Hoseok. Can you just let me be for once in your goddamn life?” he snaps, brushing past a shocked looking Hoseok. “Tell Namjoon I’m working from home,” he mumbles as he heads off to find Jungkook so that he can check out a company laptop.\n \n \nAt least he doesn’t feel quite as ridiculous emailing Jin from the comfort of his blanket burrito at home. Well, he still feels ridiculous, just in a different way.\nHoseok shows up that night with McDonalds and beer. Yoongi mumbles an embarrassed apology for snapping at him earlier, but Hoseok has long forgiven him.\n“So why the hell did he even go to your place?” Hoseok asks him, mouth full of fries, after Yoongi has recounted his story.\n“I don’t fucking know. At least he stopped me before I actually had his dick in my mouth.” He pauses, then adds “Though it would not be the first time I’d been dumped with a dick in my mouth.”\n“Maybe he’s just really conflicted. Like his dick says yes but his brain says no?”\n“His dick was definitely saying yes,” Yoongi confirms, flopping over onto the couch with a groan and retreating into his burrito. “Hoseok, he has a really nice dick.”\n“Can you be a little more specific? Girth? Color? Length? Veins?”\n“You are fucking disgusting,” Yoongi spits, sitting up abruptly, his hair a wreck from the static of his blankets. He sighs and glances at Hoseok, looking guilty. “So let me be clear that I’m only telling you because I really want to talk about it.”\n \n \n Namjoon rarely plays the boss card, but he makes Yoongi comes back to work that Thursday so that they can have a meeting about the presentation before Jin leaves.\n“I promise I’ll be there. To mitigate the awkwardness,” Namjoon assures him over the phone. “I wouldn’t ask if this wasn’t important, Yoongi. We need this. And look, Jin’s leaving like immediately afterwards so that he has time to drive up and check into his hotel before the meeting with the CFO tomorrow.”\nYoongi makes sure to look extra hot on Thursday morning, wearing his most apathetic mask and his tightest pants. Nothing bothers Min Yoongi. Except these pants. They kind of crush his balls. Worth it.\nYoongi comes in late then spends the first hour of his day hiding in Hoseok's cubicle. “Buddy, it's already two minutes past nine. It's about that time. I think they're waiting for you,” Hoseok says as he pushes Yoongi’s butt off of his desk with his foot. Yoongi groans but allows himself to be pushed, catching himself with his feet at the very last moment before he falls. He grabs his laptop and halfheartedly kicks the wheel of Hoseok's chair before shuffling towards the meeting room.\n“Fuuuck,” he groans to no one in particular, shuffling his feet as he trudges miserably down the bleak hallway.\nJin looks put-together as always, though a little tired. Namjoon is there, smiling brightly, and wow does he look uncomfortable. His smile is big and fake, and his eyes are wide as they dart back and forth between Jin and Yoongi.\n“How’s my dream team doing?” Namjoon asks jovially as Yoongi plops into the seat next to him, the chair creaking violently. Jin just grimaces in the vague form of a smile, and Yoongi rolls his eyes. “Okay, great,” Namjoon continues bravely in the hostile silence. “So what have you guys got?”\n“Uh, well I outlined the budget, and Yoongi's got the presentation,” Jin says stiffly, and Yoongi’s stomach clenches at the sound of his own name. “Let me just pull it up.” A couple of seconds pass, then his brow creases in confusion. “Okay… that’s weird. Where’s the file?”\nYoongi’s blood runs a little cold as he scrambles for his own laptop, clicking into his documents tab and knowing full well before it even opens that he is not going to find what he’s looking for.\nThe folder is empty. It was not empty last night.\nRage swells within him.\n“KIM. TAE. HYUNG.”\n“Yoongi, no. Yoongi, sit down,” Namjoon urges him, tugging insistently on his arm. “We don’t know anything yet. Let’s just get Jungkook in here so he can figure out what’s up. Maybe the company drive is down. You saved it on the company drive, right?”\n“They company drive is not down, Namjoon! Everything else is here, and he has pulled this shit before. That little fucking monster, I’m going to strangle him with his own goddamn tie.”\n“Jungkook?” Namjoon calls loudly, clearly afraid to let Yoongi out of his sight. “Can you come in here for a second?”\nThirty seconds later, Jungkook wanders in looking bored as hell. “What?”\n“Uh, we seem to be experiencing some technical difficulties.”\n“Did you try turning it off and turning it back on?” Jungkook asks dully, looking at his nails.\n“Do you want to die too, kid?” Yoongi snarls as Namjoon's grip on his arm tightens.\n“Yoongi, chill,” Namjoon urges him, before turning back to Jungkook. “Uh, Jungkook, it's not really that kind of problem. I think it might be something with the company drive. Yoongi and Jin can’t find their budget report for the big meeting tomorrow.”\nJungkook's eyes widen, and he doesn’t look bored anymore. “Oh. Is that what that was?”\n“Is that what WHAT was?” Yoongi mutters through his teeth.\n“The thing that Taehyung had me hack in and delete,” Jungkook says sheepishly, the usual gold of his cheeks glowing a dull red.\n“KIM TAEHYUNG.”\nNamjoon can’t hold him back this time. Yoongi wrenches his arm from his grasp and is out the meeting door before anyone can stop him.\nHe catches a glimpse of Taehyung's pant leg before it disappears around the corner, and Yoongi has no clue why he’s running, because that’s a dead end. Taehyung seems to have just come to this realization himself when Yoongi rounds the corner. Taehyung catapults himself into the supply room, and before he can close the door, Yoongi is there, wincing as Taehyung tries desperately to close to door on his foot.\n“You little fucker!” Yoongi yells, prying open the door in an amazing show of strength.\nTaehyung crumples, scrambling backwards on the floor, and Yoongi steps inside and slams the door behind them, locking it for good measure. Yoongi grins at the sound of bodies thudding against the other side of the door.\n“Yoongi, don’t kill him! He’s the face of the company!” comes Namjoon’s muffled voice through the wood.\nYoongi launches at Taehyung, and roll messily on the floor as they struggle for the upper hand. They don’t struggle long.\n“How are you so tiny and strong?” Taehyung despairs as his arms are pinned down by Yoongi’s hands. Yoongi is breathing hard, but now that he’s got him here, he doesn’t know what to do with him. He settles for flicking him hard on the forehead. Apparently the sound it makes is loud enough to trigger the clap-activated mood lighting, and Taehyung giggles before screwing up his face in pain. “Ouch! Stop! Can we just talk about this?”\n“Talk about what, Tae? Talk about how you have just single-handedly fucked over this entire branch? How you have just single-handedly fucked me over? You wanna talk about that?” he emphasizes his words with another powerful flick to the forehead. The room goes dark.\n“Look, okay, when you put it that way, it sounds really bad, but listen. Can I just tell you why I did it?”\n“I fucking know why you did it, Tae! Because you can’t leave well enough alone. Because you have some weird guilt about breaking my heart and now you think it's your goddamn life's mission to fix me. Well guess what. Stop. Trying. To. Help!” He punctuates ever word with a flick, and the lights are going crazy. It's so ridiculous that Yoongi wants to laugh. He also wants to cry.\nTaehyung looks he actually might.\n“I’m sorry,” Taehyung murmurs, his lip trembling pathetically. And God, even if Yoongi is mad, he can’t tolerate seeing Kim Taehyung cry. He is poised to flick again, but his hand falls limply by his side as he rolls off of Taehyung and slumps against a fall, breathing hard.\n“Why, Tae? It was such a long time ago. I’m over it. I am… so far beyond over it.”\nTaehyung actually sniffles, and Yoongi swallows down his guilt. “I just want you to be happy. I haven’t seen you smile like you do around Jin since…since…”\n“Since college,” Yoongi supplies for him, saving them both the embarrassment. “But come on, what did you think was going to happen?”\nTaehyung bites his lip. “I just thought, you know, maybe you two would have to stay late to finish everything, and then you’d be such a good team and you’d be so swept up in the romance of the situation that you would realize you’re in love with each other and make tender, kinky love on Namjoon's desk.”\nYoongi doesn’t know why he’s feeling sorry for Taehyung right now, when every instinct tells him he should be feeling sorry for himself. “Tae I already tried. He doesn’t want me.”\nTaehyung's mouth falls open very slightly. “Oh.”\n“Yeah.”\n“Well, he’s an idiot if he doesn’t want you,” Taehyung assures him.\n“You didn’t want me either,” Yoongi mutters, and Taehyung's lip trembles again. Yoongi backtracks immediately. “Hey, no I’m not… I really am over it. I’m just… Fuck, I don’t know why I said that. I’m sorry.”\nAnd Taehyung looks so endearingly distraught when he says, \"You know it's not that you weren’t… I mean. It's just…” Taehyung struggles, breathing a shuddery breath, “I already had him.\"\n“Him?” Yoongi pauses, his breath catching in his throat. A million things fall into place at once. A million things that were so obvious, so impossible to ignore, a million things that he somehow managed to pretend weren't happening, suddenly make a hell of a lot of sense. And god, Yoongi’s an idiot. God, they all are. Yoongi just nods, smile soft but wry around the edges. \"Ah.”\n\"But you’ve always been one of my very favorite people. You know that, right?” Taehyung insists, hand clutching at Yoongi's knee.\nYoongi heaves a great sigh. “I know, Tae.”\nThey sit in silence for a moment as Taehyung sniffles again, his fingers digging into Yoongi’s leg.\n“Since this is my fault, can I at least stay and help you tonight?” Taehyung asks pathetically, eyes large and sparkling.\n“Please do not try to help me with anything ever again. No more meddling. I mean it. If you see me bleeding in a ditch, walk away very slowly.”\n“I love you, too, Yoongi.”\nThey emerge from the supply room several minutes later to a crowd of faces frozen in concern.\n“He's alive?” Jungkook shouts from his cube, removed from the madness.\n“Yep,” Hoseok shouts back, and Jungkook just responds with a thumbs-up before sinking back down behind his wall.\n“Uh, Taehyung, did you really delete those documents?” Namjoon questions him seriously. “That’s kind of a big deal. Like a ‘report to HR’ kind of big deal.”\n“Uh, no. I accidentally did it,” Yoongi lies smoothly. “I thought I was backing them up, but I must have deleted them somehow. Sorry.”\n“And Jin's?” Namjoon pushes. Taehyung is uncharacteristically quiet.\n“Oh. I think I did the same thing,” Jin confirms, though his lie isn’t as seamless as Yoongi’s. “That new system is really confusing. I get the H-drive and the J-Drive mixed up.”\n“What an amazing coincidence,” Namjoon says dryly. “Are you guys going to be able to get this shit done? It's a lot of work, and the meeting is tomorrow.”\n“We won’t be starting from scratch. I have some of the older printouts lying around here somewhere,” Jin tells him with a reassuring smile. “We'll get it done, no problem. We'll stay all night it we have to.”\nYoongi scowls at Taehyung, who tries rather unsuccessfully to look small. “Yep. All night,” he growls through his teeth.\n \n \nThey work in relative silence, speaking only to clarify or confirm. It's not uncomfortable, exactly. Since the incident with Taehyung earlier, they have managed to shellac a fine layer of bullshit over the deep, simmering tension. Every once in a while, it threatens to bubble up through fissures and cracks in their otherwise meticulously kept façade.\nBut they’re making progress. Jin was right, they aren’t starting from scratch. Even so, it's still a hell of a lot of work. Yoongi has to remake some of the figures for the PowerPoint, the spreadsheets and the graphs. Jin is behind him, in his cubicle, typing away furiously and silently.\nTaehyung at least has the decency to bring them dinner, long after everyone else has headed home for the night.\nIt's great, because Yoongi realizes belatedly that he hasn’t eaten all day.\nIt's not so great, because he is alone in the office with Kim Seokjin, who not only looks deliciously disheveled with his sleeves rolled up and his hair rumpled by nervous hands, but who also makes sex noises when he eats. It also doesn’t help that Yoongi has also heard his real life sex moan and can attest to the similarity.\nSo he sits there, simmering in his cube, trying in vain to concentrate. Trying desperately to ignore what sounds like Jin going to third base with a piece of pizza.\n\nProjections show that the benefits of an expanded accounting department will far outweigh the costs of...\n\nIt's too easy to imagine. Jin gripping Yoongi's hair and moaning lewdly as Yoongi swallows around his cock.\n\nProjections show that the benefits of an expanded accounting department will…\n\nJin bending him over his desk and groaning in satisfaction as he pushes into Yoongi's tight heat, so fucking slowly.\n\nProjections show that…\n\n“Oh my god, will you shut the fuck up?” Yoongi explodes, shoving his chair back from his desk and storming off without a look back at a presumably shocked Jin.\nHe flings open the bathroom door and locks himself, steaming, in one of the stalls. He unbuttons his pants and yanks them down furiously, and yep, he’s as hard as he thought he was. Painfully hard, his cock red and throbbing and leaking, and there’s no way he’s going to jerk off in the office, but what the hell is he going to do?\n“Uh, Yoongi?”\nFuck fuck fuck. He hadn’t even heard the door open.\n“What?”\n“Is everything… okay in there?”\n“Jesus Christ, will you please stop pretending to care?” Yoongi mumbles, wincing as he tucks himself back into his pants and tries to situate himself in the least painful position.\n“Are you fucking serious?” Jin demands, scoffing indignantly. “Look, can you at least come out so we can have this conversation?”\n“No,” and Yoongi knows he sounds like a petulant child, but he really doesn’t want to have this conversation at all. Much less rock hard, in the gross office bathroom.\n“Open the goddamn door, Yoongi. We're talking about this.” He sounds angry. Yoongi throbs in his pants.\nHe doesn’t say a word but reluctantly swings the stall door open. Jin takes one look at him, his bite-swollen lips and his mussed hair and the swell of his pants, and he seems a little at loss for words, too.\nFinally, Yoongi breaks the silence, trying to offer an explanation for his appearance, and he sounds like he’s about to cry. “You eat pizza like a goddamn porn star.”\nJin looks utterly torn between wanting to laugh and something a lot darker. “Fuck,” he sighs heavily, digging out his phone from his back pocket and bringing it to his ear. Yoongi has no clue what he's doing, until he hears who he’s calling. “Hoseok?” he asks calmly, and Yoongi hears Hoseok respond affirmatively on the other end. “Where are the HR Relationship disclosure forms?”\nYoongi's mouth goes very dry.\n“Of course they are.”\nAnother pause.\n“Of course you did.” What’s scariest to Yoongi is that Jin’s face does not change when he says, “Because I’m going to fuck Yoongi on his desk.”\nYoongi is floating outside of his body. He is not completely convinced that this is not just the most realistic sex dream he has ever had.\n“I will absolutely never do that for you,” Jin concludes calmly. “Okay. Thanks. Bye.”\nHe taps his screen and slips the phone into his back pocket, staring up at Yoongi expectantly.\n“Um. What?” Yoongi asks dumbly, shifting his weight nervously and feeling how hard his dick still is.\n“Hoseok has the forms already filled out for us in my desk. They’ve been there for months. All we have to do is fill out our part, sign, and date.”\n“And?”\n“He asked me to ask you to film it POV style. I told him no. Obviously.”\n“…And, uh, that other part?”\n“Oh,” Jin realizes, like he genuinely forgot. “And I’m gonna fuck you on your desk. If that’s okay.”\n“That’s… yeah?” Yoongi says dreamily, like it's a question. “Yeah, that’s okay.”\n“Are you sure?” Jin asks, taking a step closer, then another, and Yoongi’s dick throbs again in anticipation.\nHe swallows hard. “Pretty goddamn sure.”\n“I’m… I’m still leaving,” Jin clarifies, and the gap is closing between them.\n“You can stop saying that, you know. I told you. I’m not asking you to fucking marry me.” He ignores the part of him that screams in protest of the statement, and he focuses instead on the fact that he is about to get a very, very small part of something that he wants very badly.\nJin smiles a little bitterly at that, and Yoongi thinks that he still sees a spark of anger in his gaze. “Don’t worry. I hear you loud and clear.”\n“So…” Yoongi prompts him uncertainly as he cranes his head up to look at Jin.\n“So…I guess there’s just one thing left to do,” Jin says, and now he’s close enough that he can reach out and hook a long finger in the waistband of Yoongi’s pants.\n“Y-yeah?” Yoongi stutters unconsciously leaning forward into Jin’s magnetic pull.\n“Form time!” Jin releases his waistband with a loud painful snap, before grinning mischievously and playfully patting Yoongi’s aching cock. “See you in the cube.”\nYoongi feels annoyance lick hot in his stomach, but not nearly as hot as his arousal. “Dude are you fucking serious?” he calls after Jin, who just continues out the bathroom door.\nHe is very fucking serious.\n“Fill it out,” Jin orders him as he slides the form towards Yoongi on the desk and kicks his rolling chair out of the way.\n“What? Why me?” Yoongi demands crossly.\n“Because I’m busy,” Jin tells him, gently pushing Yoongi so that he is leaning over the desk. His hands glide lightly over the surface of Yoongi’s clothed body, reaching around, hands coming briefly to a rest on his crotch and giving his rock-hard bulge a curious squeeze. “Wow.”\n“I think you underestimate how attracted I am to you,” Yoongi gasps as he tries not to press his hips forward into Jin’s grasp.\n“Take off your shoes.”\nYoongi kicks them off distractedly, frantically searching his cluttered desktop for a pen. He swears that there are usually nothing but pens on his desktop every day, so many goddamn pens, and yet the one time he needs one…\nBy the time he finds a pen, sticking out of a long-dead plant, his pants are around his ankles, his bare ass exposed to the cold office air as he leans over his desk.\nJin groans quietly, hands coming to rest on Yoongi’s ass, massaging it gently, and yep that’s pretty similar to his pizza groan.\n“Step out,” Jin tells him, yanking his pants off of his feet when Yoongi obliges. Then he peeks around Yoongi’s shoulder to see what progress he’s made. He clicks his tongue in annoyance. “Hurry up, Yoongi. You stop, I stop.”\n“You stop what?” Yoongi fires back, weirdly okay with being sprawled out, buck-ass naked, leaning over his desk in the middle of the office. “You’re not even doing any- JESUS.”\nIt takes a second for Yoongi to register the hot wetness on his hole and another second for him to realize exactly what is happening, but when he finally does, his pen goes clattering loudly to his desk. “Oh,” he moans, voice embarrassingly high as he braces himself against the desk, form all but forgotten. “Oh fuck.”\nThen the heat is gone, and Jin slaps his ass playfully. “Hey. What did I say? Form. We do this right.”\n“How am I supposed to fill out this stupid form with your tongue in my ass?”\n“I guess you’d better figure that out,” Jin replies simply, gently fondling his balls, breath ghosting over his hole. Yoongi whimpers.\nIt takes every ounce of focus and determination he possesses to pick up the pen again. He falls forward on his elbows when Jin resumes his work, tongue insistently circling his entrance before flicking inside. “Oh sweet fucking hell.”\n\nWhat is the nature of your relationship?\n\n“Um, Jin?” Yoongi swallows hard, grimacing as he tries to ignore the way that Jin’s tongue is fucking into him. “What are we?”\nStillness. A complete absence of motion and heat.\n“Is this really the time, Yoongi?” comes Jin’s voice from behind him, the grip on his hips a little tighter.\n“It’s on the form,” Yoongi says quickly, crumpling the paper with the force with which he grabs it to shove in Jin’s face.\n“Oh. Right. Uh, just put… ‘friends with benefits?’”\nSex Enemies, Yoongi scrawls disdainfully, falling back down onto his elbows.  \n“Are you done yet?” Jin asks impatiently. “God your ass looks so good,” he breathes, massaging Yoongi’s flesh greedily.\nHe has to repress a shiver at the huskiness of Jin’s voice. “Uh, yeah. All done. Just sign here.”\nJin is suddenly beside him, tugging the pen from his hands and scribbling hastily on the paper. “Fucking finally.”\nThe moment he lifts the pen from the paper, Jin slings the form off of the desk, grabbing Yoongi so abruptly that it startles him and shoving him so that he’s sitting on the desk. “Don’t staple your ass this time,” he quips as he fumbles with the buttons of his own shirt. Yoongi takes the liberty of attacking his belt for him, whipping it out of the belt loops with such fervor that it smacks hard against Jin’s side. “Ouch!”\n“Oops. Sorry,” Yoongi apologizes in the most unapologetic tone he can muster.\n“You little…” Jin starts, weaving a hand through Yoongi’s hair and gripping it hard, and goddamn that feels good. Yoongi swallows down his moan, watching Jin hungrily. His eyes are black, pupils huge, and the color high on his cheeks, his hair mussed perfectly and his lips swollen. He looks like some kind of deity of fury and sex. His expression is completely at odds with his seemingly playful demeanor, and Yoongi is thrown by it. He is thrown by Jin’s hand in his hair, guiding his head in an excruciatingly slow, small semi-circle, like he’s trying to see Yoongi’s every angle. “Yoongi, I…”\nYoongi swallows hard, the action almost painful with his head pulled back. “What?”\nHe never finds out exactly what, because Jin answers with his mouth against Yoongi’s. It’s hot and dirty and demanding, and Yoongi doesn’t mind one bit, licking eagerly into Jin’s mouth as he reaches forward to shrug off his unbuttoned shirt. The nails of his thumbs rake over the silky smooth skin of Jin’s arms as he peels away the fabric, and Jin shudders beneath his fingers.  \nJin shoves down his own pants and underwear as gracefully as he is able, kicking them aside carelessly as he grips Yoongi’s hips and slides him further forward on the desk so that Yoongi’s has to spread his legs to accommodate him. Their cocks only just brush, but Yoongi’s exhale sounds more like a whine than an exhale regardless. Yoongi chances a glance down at Jin’s pretty pink dick, licking his lips subconsciously. Jin doesn’t miss the movement.\n“You really want to suck me off, don’t you?” Jin asks him, sounding extremely satisfied.\nYoongi’s face flushes with heat. “What?” he panics, “No.”\nJin smirks, reaching up to cup Yoongi’s face. Yoongi thinks, for a moment, that it’s going to be something tender, but then Jin runs his thumb along Yoongi’s lips, pressing down lightly before slipping it inside his mouth. Yoongi’s tongue curls up to meet him on instinct. “Are you sure about that?” He presses his thumb further inside, and Yoongi moans around it, flushing all the brighter. Jin withdraws his thumb, eyes sparkling darkly as he drags his spit-soaked digit down Yoongi’s lip, then chin, gripping it tightly. “Drop to your knees. Like last time.”\nYoongi sets his jaw defiantly, but his dick gives a traitorous twitch. Jin’s eyes light up in a dark kind of glee, his left eyebrow quirking victoriously. “Go on.”\nHe’s torn, momentarily, between maintaining his pride and really wanting Jin’s cock in his mouth. But before he knows it, his ass is sliding off the desk, knees hitting the rough, cheap carpet with a dull thud.\nAnd there he is, face inches away from the most beautiful dick he’s ever seen, and he can’t pretend anymore that he doesn’t want it. His nails dig into the sides of Jin’s soft thighs as he pulls himself closer, dragging his knees harshly against the carpet. Jin’s fingers card though his hair as Yoongi leans forward and licks a thick stripe up Jin’s cock, only stopping to envelop the head in his mouth. It feels even better than it looks. It’s firm and warm and so thick that it stretches the corners of his lips when he bobs his head down to take more in. Jin’s precum is salty but pleasant on his tongue, and he turns his attention back to the head to try and get more of it. He laps at the tip, and Jin groans throatily, his grip tightening in Yoongi’s hair.\nYoongi can’t help it, spurred on by the noise, wanting so badly to hear it again. He overzealously tries to swallow down Jin’s cock and ends up choking on it, his throat contracting and his mouth watering in protest. His eyes prickle slightly, and his scalp burns at Jin’s unrelenting grip.\n“Fuck, Yoongi,” Jin breathes, his voice heavy. “Come here.”\nYoongi makes a noise of disagreement, trying to swallow him down again, but Jin pulls him off and tugs him back into a standing position, before spinning them around so that Yoongi’s ass is on the desk once again.\n“Where do you think they keep the lube around here?” Jin asks, eyes darting down to Yoongi’s crotch.\n“I think the better question is, ‘where don’t they keep the lube?’” Yoongi replies dryly, his voice rough now. “Check in my drawer.”\nWith one hand remaining on Yoongi’s thigh, Jin reaches over and slings open Yoongi’s desk drawer, fumbling around for only a second before his hand emerges triumphant. “Seriously?”\nIt’s a bright blue bottle of lube, the good stuff, not the industrial sized jars their company sells, and there’s a small pink post-it attached.\n\n‘Tell Jin hi ;)’\n\n“Your friends are disturbingly involved in your sex life,” Jin informs him, tearing off the post-it and uncapping the bottle.\n“You’re telling me,” Yoongi agrees, watching in anticipation as Jin squirts a small amount of the lube into his hands. He then yanks Yoongi the last few inches forward so that their cocks are finally touching and lines them up, wrapping his now-glistening hand around both of them, grip firm as he slides it upwards, coating their lengths. Yoongi’s mouth falls open, cock jerking forward into Jin’s grip as his fingers caress both heads. He strokes them like that a few times, and Yoongi can’t help but shut his eyes, his head thunking back against the padded wall.\n“What do you want to do?” Jin asks, his hand running down the length of Yoongi’s dick, down past his balls, teasing at the skin beneath them. Yoongi tries not to roll forward into the touch.\n“I thought you were going to fuck me on my desk,” he says through teeth gritted with effort.\n“Is that what you want?” His slick finger teases at the edge of Yoongi’s hole.\n“God yes.”\nJin’s eyes widen just the tiniest bit, then without another word, he slowly eases that finger inside of Yoongi, just a fraction of the way. Then he withdraws it, repeating the motion at a delicioulsy slow pace. It’s been a while since Yoongi’s had anything up his ass, so he’s torn between being thankful for Jin’s careful touch and being very, very ready to be face down on his desk as Jin fucks him to hell and back. Jin distracts him from his inner struggle with gently nips to his neck, dragging his tongue over each bite as if to soothe the sting. Yoongi squirms and lets out a soft, gruff sound of pleasure. He shuts his eyes and leans back against the wall, trying to ignore the very conspicuous and very intent way that Jin is gazing down at him. \n“Stop… staring…” Yoongi mumbles before exhaling a whine.\nJin licks his lips hungrily, reaching down to drag his finger across Yoongi’s slightly slack lips. “I don’t think I can.” Yoongi flushes with incredible heat, rolling his hips down on Jin’s other hand.\nAnd yet, even in the midst of all of this, in the midst of Jin, Yoongi can’t silence the obnoxious, over-analytical part of his brain that needs to know what’s happening. Why it’s happening. What’s going to happen after this. He doesn’t even know what this is. He can’t pin it down, can’t pin Jin down. Jin, who craves roots but won’t stop moving long enough to let them grow. Jin who pushes him away, tells him he’s leaving even as he pulls him closer. Jin, who is staring at him with the strangest mix of anger and adoration. There is a molten intensity to his gaze. It’s liquid stone. It’s scalding and hard and yet undeniably soft.\nYoongi reaches out, needing to touch. He runs his shaking hands down the silky flushed skin of Jin’s chest, down the soft skin of his flat stomach. He wants to feel, kiss, love, remember every part of Jin. He wants to commit it all to memory while he has the chance, and he knows he doesn't have long. \nYoongi winces then, at two fingers.\n“Shit. Sorry,” Jin mumbles, flinching away slightly, but Yoongi grabs his hand to hold it in place.\n“Don’t stop,” he insists. “I’m fine. It feels good, too. It’s just been a while. Please. Don’t fucking stop.”\nJin nods faintly, concern still evident on his face. But he obviously still feels guilty, feels the need to distract from the discomfort, because he pulls tugs Yoongi towards him to press wet, open-mouthed kisses to his neck, working his way down to his chest, where he grazes his teeth lightly over a nipple. Yoongi gasps, partly in surprise and pleasure, and partly because Jin is continuing lower, down his abdomen, nipping at the sensitive skin above his hipbone, and down even further still.\nIt’s when Jin’s nose grazes his inner thigh that Yoongi can’t help but thrust forward towards his face.\n“Be patient,” Jin chastises him, grasping his hips tightly to hold him down.\nYoongi groans in frustration. “I have been thinking about your mouth on my dick since the day we met. Now it’s finally happening, and you’re telling me to be fucking patient?”\nJin smirks then, glancing up at Yoongi through his eyelashes. Without removing the hand currently inside Yoongi, Jin reaches over and pulls the rolling chair towards him so that he is no longer hunched. And when he sits, his face is exactly level with Yoongi’s crotch.\nYoongi has seen Jin put a lot of things in his mouth. Yoongi has even gotten hard watching Jin put things in his mouth. (“You’re eating that banana like you’re getting paid to do it,” Taehyung had informed Jin casually one day at lunch before elbowing Yoongi conspicuously underneath the table.)\nBut nothing could ever have prepared him for the actual sight of Jin’s thick, spit-slicked lips stretched around his cock. It takes every ounce of self-control that Yoongi possesses not to come right then and there, especially as Jin’s fingers find a new angle that rubs him just the right way. Yoongi hears an embarrassing whine coming from somewhere, then he chokes on the sound when he realizes it’s him.\nJin is at once gentle and ruthless, his fingers fucking faster into Yoongi now that the slide is easier. But his mouth is warm and soft and wet, and nothing has ever felt better than this. Yoongi is sure of it.\nJin bobs his head low, taking in as much of Yoongi as he can, the motion of his fingers making Yoongi squirm in desperation. Whether he's squirming away or desperately closer, he has no clue. All he knows is that Jin can fit a lot into his mouth. He takes Yoongi in so deep that his nose brushes the skin between Yoongi's hips, and when he moans around Yoongi's cock, Yoongi almost loses it, because that's Jin's infamous red velvet cake moan. He is so utterly distracted that it takes him a second to realize that there's a third finger inside of him. \n\"You can't keep... I'm gonna...\" Yoongi murmurs, feeling a bead of sweat drip down his temple. \n\"No you're not,\" Jin mutters after he has pulled away from Yoongi's dick. \"I'm not done with you yet.\"\nJin withdraws his fingers slowly, and Yoongi cringes as he is left empty, clenching around nothing. He hears the plastic rumpling of a condom wrapper, and he shifts anxiously in anticipation.\nPart of Yoongi wishes Jin would flip him around for this. Bend him over the desk, shove his face away, and fuck him until he screams. This is too intimate, the way Jin's soft hands grasp at Yoongi's hips to pull him closer. The way Jin so carefully lines up the head of his cock with Yoongi's entrance. The way his eyes flutter shut and his beautiful swollen lips part gently as he slowly pushes inside. The hand that comes up to cup Yoongi's cheek as Jin pauses to gauge his reaction. Yoongi swallows it down, shuts it away to deal with later.\nThey sit there like that, for a moment, as Yoongi adjusts. He can see Jin's chest heaving, can feel the warm puffs of breath on his face, can see the glistening of his brow. Those black eyes are boring into his, like neither of them will dare to look away. Yoongi is burning up in his own skin. Too much Jin, in front of him, around him, inside of him. \nThe tentative roll of Jin's hips forward has him groaning. The stretch is a little painful, but the idea of this, of Jin fucking him, is more than enough to make up for it. Part of him likes the burn. It makes it real. Jin is really here, fucking him, looking at him, only him, and Yoongi is content with that. \nJin's nails dig into his hips as he presses his forehead against Yoongi's their noses touching, lips hovering inches apart as Jin withdraws slightly and then thrusts forward, deeper this time. It's only a few more rolls of his hips before Yoongi really adjusts, before he can really get lost in it. He can feel Jin staring down at him, so he shuts his eyes, turns his head away. Then there is a hand on his chin, guiding his face back up, and when his eyes flutter open, Jin is there, a strange, pleading look in his eyes. And Yoongi can't deprive Jin of something he wants, so he obliges. He stares right back as his ass shifts against the desk with the force of Jin's thrusts. He reaches down to brace himself against the slick, hard desk, all the while meeting Jin's intense gaze. The air between them sparks and crackles, and Yoongi feels like one second more of this and he will combust. Jin's breath is coming in ragged waves and throaty sounds as his pace quickens, as his fingers tighten around Yoongi's hips so hard that his skin will probably bruise.\n\"Jin.\" He doesn't even realize he's said it until he registers the change in Jin's eyes, the look of quiet surprise. It spurs him on as he fucks himself down on Jin's cock. Jin's eyes are wide, his hips slowing for a moment as Yoongi drags his hands in a light ghosting touch over Jin’s back, his ass. Closer, always closer. \"Please,\" Yoongi repeats, and he doesn't know exactly what he's asking for. He just wants as much of Jin as he is allowed to have. Jin chews hard on his own lip as his eyes dart across the planes of Yoongi's face. \nThere is an unpleasant void as Jin withdraws, hands rough on Yoongi's skin as they flip him around, push his body down over the desk, and jerk his hips backwards so that he can push inside of him again. And yes, this is how it should have been from the beginning. Impersonal, unrelenting. Jin's grip is in his hair is firm, pulling his head backwards so that Jin can attack his exposed neck with lips and tongue and teeth. Yoongi is so close, has been close for so long, and the illicitness of the rough treatment has him teetering so close to the edge that he is about to go tumbling over when there is a sudden loud bang as the wood of the office door hits the wall. \nJin's hand claps over Yoongi's mouth as they hear the sound of rolling wheels against the cheap carpet. \"Shhh,\" Jin urges, ears perking up to the sound. \n\"Janitor?\" Yoongi mouths, dragged rather unwillingly back to reality as he hears the whistle of a cheerful tune accompany the clattering of a cart and the rolling of wheels. \nJin nods solemnly, gaze flicking back to Yoongi. \"Should... should we stop?\"\nYoongi hesitates, turning his head back towards Jin, knowing that the answer is 'yes,' but when he shifts and feels Jin's dick, still hot and throbbing inside of him, he can't force himself to utter the word. Jin's eyebrow twitches upwards, but his hands tighten around Yoongi's waist, pulling him back on further on his cock. A soft moan spills from Yoongi's lips, and there's Jin's hand hushing him again.\n\"We should stop, right?\" Jin repeats, this time subtly rolling his hips forward into Yoongi, not sounding one bit like he actually wants to stop. His hand falls away to allow Yoongi to whisper his answer.\n\"Um,\" Yoongi ponders quietly as his head slumps forward, forehead resting against the desk. \"That is certainly... an argument that one could make.\"\nJin's fingers thread, snakelike, through his hair, gripping hard, and Yoongi's mouth pops open, a low growl emitting from his throat. \"You don't want to stop, do you?\" Yoongi shakes his head violently, and Jin's hand closes even more firmly around the strands of his hair. \"Good. Keep quiet.\"\nThat is easier said than done, as Jin rocks his hips forward, gasping quietly into Yoongi's ear. Yoongi's nails drag across his desk in an effort to maintain his silence, but when Jin gives a particularly well-angled thrust, he can't stop the strangled sound that he makes in his throat. At once, Jin's hand is back to silence him, sprawled across Yoongi's mouth and nose and making it harder to breathe. He could turn his head, easily break free if he wanted to, but he doesn't. \nHe's close. He's been close. But he's waiting for Jin. He knows Jin is close, too, the way his body tenses, the way his breath hitches in his throat, the way his hand tightens on Yoongi's mouth. Yoongi’s ability to remain upright is fading fast, and he can no longer brace himself as steadily against Jin’s thrusts. Jin must sense this, because in a moment, his hand is there, at the place where Yoongi's shoulder meets his neck, to prevent him from being pushed forward into the wall each time Jin fucks into him. It’s probably unconscious, Yoongi thinks, the way Jin’s fingers curl around the left side of his neck, the way his nails dig into Yoongi’s skin, the way he is pressing down with just enough pressure to impede the flow of blood and air to the rest of his body. It’s probably unconscious, but that doesn’t mean that Yoongi isn’t enjoying it, the way his world is blurring slightly around the edges, the way everything feels very surreal and warm and tingly. His hand finds his own cock, and just a couple of distracted strokes is all it takes.\nIt's a white flash of heat that he can simultaneously see and feel and hear. It floods the tips of his toes and fingers, tingling with impossible warmth, and Yoongi's throat is burning in the most delicious way, and he is spiraling into nothingness. Jin stiffens behind him, nails digging into the soft skin of Yoongi's cheek as he comes silently, hips stuttering and fucking forward with one long, deep thrust. Yoongi is floating and burning and flying, the ugly speckled gray desk swimming in front of him as Jin's hand falls away from his mouth. Yoongi gasps for air, limbs still tingling as he coughs and falls forward limply, legs giving out. Jin catches him under the armpits and hauls him back up, slumping him in the office chair. \n\"Hey, shit, you okay?\" Jin questions him, slapping his face lightly as Yoongi's head lolls back. “What the fuck, Yoongi?”\n\"’M fine,\" Yoongi croaks out, ears ringing as his head swims in a post-orgasm haze. \"So fine.\"\nJin sighs in exasperation. \"Well, I’m glad to hear that, because you probably have about a minute to put your pants back on before we have company.\"\nWhen Yoongi makes no movement towards his pants, Jin groans curses, stooping to fetch them. He shoves Yoongi's legs mercilessly into the pant legs and tugs on his shirt, completely mismatching the buttons, before he attends to his own nakedness. \n\"Oh, hello,\" Jin greets the janitor over his shoulder a minute later, when the rolling of wheels ceases outside Yoongi's cubicle. \"Just, uh, just working late. You can skip this area for now.\"\nYoongi is still too fucked-out to do anything other than remain still in his chair, slumped over his desk, shirt still haphazardly buttoned, hair still an utter nest. He hears the janitor grunt and grumble as the clacking of wheels retreats further and further from their corner. \n\"That was ridiculously close,\" Jin mutters, jogging over to his own cubicle for several moments before re-appearing back in front of Yoongi. Yoongi feels something cool and wet on his hand, and he looks down to see Jin kneeling as he carefully wipes down Yoongi’s cum-covered skin with a wetwipe. He's doing it with a tenderness that makes Yoongi's insides churn, and when he's done, he moves to fix the buttons on Yoongi’s shirt. “God, you’re a mess. Are you… um. Are you sure you’re okay?”\n“Never better,” Yoongi grumbles, pushing Jin’s hands away and swiveling his chair so that he doesn’t have to look at him.\n“Good,” Jin replies, and it sounds like he has pushed himself to his feet. There are a few moments of silence, then, “Oh, did you finish that 3-year projection graph?\"\nAnd that's it, Yoongi supposes. Back to work.\n\"Yeah,\" Yoongi manages, leaning forward to grab a paper from his desk and wincing as his oversensitive dick brushes against the rough fabric of his pants. \n\"Great. Thanks,\" Jin replies, patting him on the shoulder before he plucks the paper from Yoongi's hands. \nThey finish around two. The janitor is long gone, having skillfully avoided their little corner, like he knew. He probably did, Yoongi realizes as he stands and stretches, preparing to leave. His underwear is crumpled near the wall at the entrance of his cube.\n\"I have to be on the road in three hours,\" Jin laments with a groan, shrugging on his jacket as Yoongi gathers his things. \nYoongi just raises his eyebrows in what he hopes is a sympathetic response, because he really can't muster words right now. A quiet, inconspicuous escape may be his best option, he decides, head tucked as he goes to exit his cube. But of course Jin is there, blocking his path. \n\"Uh, hey,\" Jin starts, and Yoongi can't focus on anything except the gap in his shirt where his buttons are still improperly fastened. \"I think we made a good team. You know, the last few months.\" Yoongi nods neutrally, just wanting to leave before he starts getting too emotional. He already feels it, bubbling up like bile in his throat. \"I'll... I'll text you? To let you know how it goes?\" Jin asks uncertainly, and Yoongi is staring very hard at the wall over his shoulder. He nods again, shortly. \"See you at the Jammies, then.\"\nYoongi is dying to look at his face, to try and get a better read on the situation, but he can't tear his eyes away from the safety of the gray wall. Jin lingers for just a moment more, then he is gone, and Yoongi's legs finally give way as he stumbles back into his chair.\nNot a big deal. His own words.\nHe looks down at his phone. Three missed calls and 47 messages from Hoseok, most of them lewd improvised emojis. One weirdly chill message from Taehyung asking Yoongi if he wants him to bring dessert, followed by one not chill at all message making a lewd allusion to Jin’s dick and dessert, followed by one chill-again message in which Taehyung apologizes for letting Hoseok get a hold of his phone.\nHe sits there for another 15 minutes before he can muster the willpower to move, to push himself to his shaky legs, ass aching, and walk out the door. \n \n \nThe office is as loud and chaotic as usual, but the empty space in the cube behind Yoongi makes the place feel weirdly deserted. \nHis ass hasn't been in his chair for 10 seconds before there is a pair of clasping hands on his shoulders, whirling his seat around. Yoongi reels back as Hoseok's face hovers inches from his. \n\"What. Happened,\" Hoseok demands, a scary glint of intense interest eyes. \"You never texted me back, you dick! Details of every kind. Sight, touch, sound, smell, come on. Let's go.\"\nYoongi groans lightly. \"Nothing happened.\"\nHoseok's expression turns the strangest mix of sympathetic and sharp. \"Buddy, there's a used condom in your office trash can, and this cube smells like a teenage boy's unwashed sheets.\"\n\"Fuck.\"\n\"Come on. Give me the full experience. Start from the beginning, and don't leave out a single detail.\"\n\"Please fuck off,\" Yoongi grumbles, trying to turn back to his work. \n\"You owe me this! I can't believe you refused to take video. After everything I have done for you.\" Yoongi's laser death glare is enough to have Hoseok sliding off of his desk, backing away slowly with his hands in the air. \"Fine, bitch. I'll just check the security cam footage.\"\nYoongi's forehead hits his desk with a gently thunk. \nJin's meeting with the CFO is late, at four, and Yoongi is painfully aware of the passage of time as the day drags on, the Friday that never ends. \nHe gets the text at 5:05. His pocket vibrates while he is sitting at the bus stop with Taehyung and Jimin, waiting. The message is short and sweet, and it makes his stomach twist in the most incredible fashion when he sees who it's from. \n \nSeokjin From Corporate: Approved. We did it. :)\n \nYoongi can't help his smile, the grip on his phone tightening as he exhales slowly. \nHe types twenty different responses and deletes them all. Nothing seems like the right balance of just enough and not too much. After almost fifteen minutes of deliberation, he settles on a \"thumbs-up\" emoji. \nOn the bus, on the way home, Taehyung chuckles beside him. \n\"What?\" he questions insistently, elbowing his friend in the ribs. \n\"Nothing. Just Jin. Snapchat\"\n\"What... What's he doing?\" Yoongi questions as casually as he is able. \n\"He's getting drunk off his ass to celebrate. With a bunch of people from Corporate. I guess he has friends, after all.”\n\"Oh,\" Yoongi remarks, suppressing his jealous pangs as he imagines Jin enjoying cocktails with a crowd of fashionable, professional city folks. \"Good. Great.\"\nHe surreptitiously checks his phone, unsurprised but still kind of bitter when he sees no new notifications. Taehyung's phone buzzes happily, and Yoongi stands up abruptly, getting off the bus one stop too early. \n \n \nAfter the second Jammies, at the insistence of Jimin and Taehyung, Yoongi had given in and purchased a tuxedo, figuring that biting the bullet and buying one would make more sense than paying to rent one annually. And this year, he has almost gotten over the utter mortification of walking into a shitty Karaoke bar dressed in a full tuxedo. It probably doesn’t hurt that he is completely absorbed in hypothetical after hypothetical about what's going to happen when he sees Jin again. \nHe stands on the street outside the bar in the fading sunlight, ignoring the inquisitive stares of passers-by, scuffing his shiny shoe against the concrete as he contemplates going inside. \nSomebody elbows him harshly in the ribs, and he startles, but it's just Hoseok. \"Hey.\"\n\"Don't scare me like that, dude,\" Yoongi scolds him, hand fluttering to his heart. \n\"Why are you standing out here when waiting inside for you are both alcohol and that supremely hot piece of ass you somehow managed to trick into sleeping with you?\"\nYoongi is so anxious that he doesn't even glare. \"I was just about to go in,\" he claims falsely, skeptically eyeing the door and startling once more when it swings open and a middle-aged woman and her son step out. \n\"Sure you were,\" Hoseok appeases him, patting his arm sympathetically. \n\"I just...\" Yoongi starts quietly, \"I just don't know how to act. Like, we had weirdly intense sex. In our place of work. And not a minute after we were done, he was asking me for the goddamn projections, like nothing even happened. I’m not kidding, Hoseok, it was weird fast,\" Yoongi's eyes lose focus, the world going a little blurry. \"What if it didn't actually happen? What if it was all some crazy dream fueled by too much pizza and sleep deprivation?\"\n\"It was real, buddy. Believe me.\" And Yoongi does muster a suspicious glare for that one.\n\"Please tell me you did not actually watch the security camera footage,\" he pleads.\n\"Oh I definitely did,\" Hoseok promises. \"But you couldn't see shit in your actual cube. Only the walls shaking slightly as you presumably got your ass pounded, then one very disturbed janitor fleeing the scene. But it most certainly happened.\"\nYoongi groans lightly, turning away and vaguely considering taking off at a sprint. \n\"Hey, hey, it's okay,\" Hoseok reassures him, grabbing lightly onto Yoongi's sleeve to keep him from booking it. \"Look, I'll be right there beside you. I've got your back.\"\n\"I am not remotely comforted by that.\"\nThey have rented one of the larger rooms in the place, and Jimin and Taehyung have decked it out with decorations from what looks like the clearance bin at a party store.\nUpon entry, Yoongi does a quick scan, counts the bodies in the room, and yep, there are five, in addition to Hoseok and him. All accounted for. \nNamjoon and Jungkook are already engaged in a spirited rap duet, and Jin's head is thrown back in laughter at something that Jimin just said. When the door shuts behind them, Jin's head jerks in their direction, and he stiffens visibly. Yoongi takes a deep breath and steps forward. Jimin and Taehyung somehow melt into the shadows, and suddenly it's just him and Jin. \n\"Hey!\" Jin says with an obviously forced enthusiasm. \"So... Congratulations?\" He extends his hand, and Yoongi's heart plummets even as he reaches forward to take it. Back to Business. \n\"Uh, yeah,\" Yoongi agrees with a fake-ass smile. \"Great work. Thanks for all your help.\"\n\"Just doing my job,\" Jin replies stiffly, and that kind of stings. \n\"Right.\"\n\"Okay everybody sit the fuck down and pay attention to me,\" Hoseok's voice rings out, too loud, over the totally unnecessary microphone. Yoongi averts his eyes from Jin's gaze and makes his way over to the bench. Jin takes a seat on the far side. “Welcome to the annual year-end Jammies, the most anticipated event of the year. I am your host, the delightful, delectable Jung H-, ”\n“Get on with it,” Jimin groans, leaning his head on Taehyung’s shoulder.\n“Wow Jimin, kindly dig your thong out of your ass and get into the holiday spirit, would you?”\n“Fuck off, Hoseok, I like my thong right where it is,” Jimin bites back, rising halfway from his seat as Taehyung restrains him.\n“Okay pissy pants,” Hoseok replies with his eyebrows raised, “Simmer down. We’re here to celebrate the year’s end and the departure of our good buddy, Jin.”\nJimin just pouts harder, sinking deeper into his seat. “Why should we celebrate either of those things? I love Jin, and 2016 was fucking amazing. I had my first threesome, and my pit hair really filled in. 2017 is going to be shit in comparison.”\n“Just-” Hoseok interrupts, massaging his forehead with his fingers, “-chill. Would you? Just fucking chill. Let me do this. This is my time.”\n“I told you we shouldn’t have let him host it,” Taehyung complains to Namjoon. “Jimin and I were way better. He has the sex appeal of a beached dolphin.”\n “Anyway, I’m speaking,” Hoseok says loudly, ignoring Jimin and Taehyung’s fierce whispering. “Now before we get started with the presentation of awards, I have created a compilation video of this year’s very best office hi-jinx. A year-end review of our very best moments.”\n“Hoseok, this feels like not a good thing to do. This feels like a getting fired thing to do,” Namjoon warns him solemnly.\n“Nams. Chill, buddy. Would I, the HR guy, put all of our careers at risk by parading our blatant flouting of company policy and providing substantiating video evidence for several misdemeanors, one with trial pending?”\n \n \n“For the security of all of your jobs, I was did not officially attend this event, and I never saw this video,” Jin remarks decisively when the lights flicker back on and the screen goes black.\n“How did you even get that footage? Who has been filming us?” Namjoon asks in dismay, then he stops himself. “Never mind. I don’t want to know.”\n“We should sell this to MTV. We would make a great show,” Taehyung ponders seriously. “They could call it The Office.”\n“I think that one’s already a thing, buddy,” Jungkook says, patting him on the back consolingly.\n“And now back to me, everyone look at me,” Hoseok screeches into the mic, which screeches right back. Yoongi covers his ears.\n“Hoseok, enjoy this,” Namjoon warns him, jiggling his leg anxiously in his seat, “Because you are never hosting again.”\n“You forget, Namjoon, this show dies with me. That sexy bastard over there cancelled it.” He points accusingly at Jin, whose head jerks from side to side to see if everyone is looking at him. They are. “Anyway, we will now start the presentation of the awards. When I call your name, please come up and accept your trophy. Unfortunately, as we only have the room until 11 and that video was slightly longer than I recalled, we will not have time for acceptance speeches or indignant denials this year. Accept your award and sit your ass down.”\n“You’re the one who argued for twenty minutes last year how you weren’t the ‘Most likely to end up in the ER with something weird stuck up his ass.’ And look how that turned out,” Namjoon argues, folding his arms in front of him. “Take me off your fucking emergency contacts, by the way. Never again.”\n“Well excuse me if I have been exploring my sexual boundaries. There is nothing wrong with a little creativ-”\n“Boo, time’s ticking, asshole,” Yoongi heckles him from the corner.\n“Fine,” Hoseok huffs. “This first award is a new category this year, but one of my personal favorites. The award for ‘Brightest future in Amateur Fetish Porn’ goes to our own Kim Namjoon!”\n“Fuck no,” Taehyung and Namjoon say in unison.\n“I was a shoo-in for that one!” Taehyung demands, gripping his beer in outrage. “This is bullshit, Spaghetti-Os aren't even a real fucking fetish.\"\n\"Speak for yourself,\" Hoseok mumbles, flipping through the note cards in his hand.\n“I refuse to accept this award,” Namjoon says, settling back in his chair.\n“I refuse to not accept this award,” Taehyung demands, beating his fist on the shaky table.\n“Well, whether you accept it or not, Namjoon, you're the winner,\" Hoseok tells him matter-of-factly. \"And if you change your mind and decide to embrace your destiny, I know a guy who would be very interested.”\n“Gross.”\n“Okay, moving along,” Hoseok continues. “This one is an old favorite. Most HR Violations in one year.” He slides the envelope open with one finger, his face a mask of mock surprise when he sees the name on the card. “Now this is a real shocker, the award goes to-”\n“You,” come six unamused voices in unison.\n“Wow you guys really know how to suck the fun out of a thing,” Hoseok pouts, tossing the envelope over his shoulder.\nAnd he’s right. There is the feeling of a weird dark cloud hanging above the whole event, and Yoongi doesn’t know if it’s just him, or if the rest of the guys pick up on it, too. Maybe it’s because it’s the last Jammies, maybe it’s because Jin is leaving, or maybe his own negative energy is just rubbing off on all of them. Hoseok seems to be trying to keep the whole thing moving, but even Jimin only puts up a mild fight when Jin takes the award for “Most Likely To Make a Straight Man Realize He’s Not That Straight.” Hoseok’s hand lingers on Jin’s as he passes him the trophy.\nBeside him, Jungkook scoffs audibly. Yoongi whispers him a hushed, “What?”\n“If you weren’t totally into Jin, Hoseok actually would have tapped that,” Jungkook hisses back at him.\n“I’m not… into him,” Yoongi whispers back, tucking his arms in front of him protectively.\n“Okay,” Jungkook says by way of appeasement as Hoseok announces the next award, “Most Likely To Leak His Own Sex Tape To The Entire Company.”\n“Taehyung, this award is for Jimin,” Hoseok insists into the microphone, his voice echoing and distorted as Taehyung moves to accept the trophy.\n“We have asked you several times to refer to us as ‘Vmin,’” Taehyung responds, trying to pry the award from Hoseok’s hand. “And I accept this award on his behalf.”\n“He’s ten fucking feet away,” Hoseok says incredulously.\n“Respect my choices!” Jimin shouts from the back of the room, his feet propped up on the table.\n“Hey,” Jungkook murmurs softly in his direction while Hoseok and Taehyung struggle over the trophy. “You know he likes you, right?”\n“What are you even talking about?” Yoongi mutters as Taehyung lets go of the trophy and Hoseok consequently hits himself in the eye with it.\n“Jin. He likes you,” Jungkook confirms. “I see things. I hear things.”\nYoongi rolls his eyes, gaze darting nervously over to Jin, who is focused intently on the conflict before him. “He likes my ass.”\n“He likes you,” Jungkook insists. “You are the two most oblivious fucking humans…”\n“Look,” Yoongi bites back quietly, “We are adults. Adults can separate the sexual and the emotional.”\n“But only fucking dumbasses think that they have to,” Jungkook trills, his voice almost obscured by Hoseok’s scream as Taehyung wrestles him to the floor.\n“Oh shut up,” Yoongi hisses, slumping deeper into his chair. “What do you know? You’re like two.”\n“I may be two, but at least I’m not a fucking dumbass.”\nYoongi jumps to his feet in righteous indignation, and everyone is too distracted by the continuing scuffle going on up front to notice him leaving the room. He paces angrily out front of the Karaoke Bar for a few minutes, before the door swings open, and suddenly Jungkook is beside him.\n“What are you doing out here?” he demands as Jungkook leans beside him against the brick of the building.\nJungkook shrugs, placing a cigarette between his lips. “I’m having a smoke. What are you doing?”\nYoongi plucks the cigarette from Jungkook's mouth, ignoring his protestations, and tosses it to the ground. “Smoking is bad for you.”\n“You smoke.”\n“I do no such thing.”\n“Whatever,” Jungkook pouts, kicking the ruined cigarette out onto the road. “Fuck you, that was my last cigarette.”\n“Good,” Yoongi grumbles, wrapping his coat around him as the wind picks up.\n“Hey…” Jungkook starts, glancing to the left and right to make sure that no one else is listening. “You know that you’re a pretty cool dude right?”\nIt’s the closest thing to praise from Jungkook that Yoongi has ever heard. “What?”\n“Don’t make me say it again, asshole,” Jungkook says in annoyance.\n“Okay, what’s your point?”\n“My point is…” Jungkook struggles. “Jin’s a pretty cool dude, too.”\nYoongi chances a glance at Jungkook, whose hair has fallen in front of his eyes. “What are you-”\n“Oh my god,” Jungkook bursts out suddenly, “Just get married and have babies, I don’t fucking know. Fuck off.”\nWith that, he shoves himself away from the wall and wrenches the door open, disappearing inside. Yoongi is confused and stunned for a moment. He is also touched. It’s very possibly the longest conversation with Jungkook he’s ever had.\nHe meanders back inside after several moments, and he sees that Taehyung is now pouting in the corner.\n“Come on guys, can we get a little pep in our step?” Hoseok tries to enthuse them, as Yoongi settles back into his seat. But his audience is completely unresponsive. Jimin drains his drink, and Namjoon yawns widely.\nThe last straw seems to be when Yoongi, too, refuses to accept his trophy. It bears the title “Best Ass-Related Office Incident of 2016.” (“Originally it was for the staple thing, but you actually out-did yourself this week…” Hoseok tells him later.)\n“Maybe we should just call this one, Hoseok,” Namjoon says quietly, pushing away his half-full beer.\n“I… But it’s the last…” He sighs heavily, his face falling a little as he looks out into the unenthusiastic faces before him. “Okay. Fine. There’s just one more award, anyway.” He picks up the last trophy and holds it so that he can read the title. “It’s ‘Bro of the Year.’ It’s for our newest bro. Jin. Unanimous votes. Whatever.”\nIf Yoongi wasn’t sure whether atmosphere was down before, he certainly is now. He thinks he hears Jimin sniffle quietly. Jin rises quietly from his seat and takes the trophy from Hoseok with a gentle smile, patting his shoulder with his free hand.\n“Uh, thanks, guys,” Jin says quietly, and Yoongi isn't sure if his voice is husky or if it's just his imagination. “This is really sweet. And really fucking lame. But mostly sweet. And thanks for making me an honorary member of the gang. It really… It means a lot. Uh. Yeah.”\nWith a stiff nod and pursed lips, he retreats to his seat, and Hoseok grabs the microphone again, shrugging. “Well, that’s it, I guess?” It’s utterly anticlimactic. Everybody moves to start gathering their things and straightening up. “Jesus people, I’ve seen more cheer in an airport security line.”\nJin is among the first ones ready, trophies slipped into his shoulder bag, phone in his hand. “I’ve got an early flight,” he says awkwardly. “So… It’s been fun?” Jimin steps forward to hug Jin sweetly, but besides that, they are silent. \"See you around, I guess.\"\nYoongi searches for any sign of additional acknowledgement in his face as Jin's eyes sweep over the group, any lingering glance. But there’s nothing. With a small wave, he turns to go, and Yoongi can’t believe he’s actually leaving. The door to the Karaoke bar swinging shut behind him, leaving nothing but a burst of cold wind from the outside.\n“Are you fucking kidding me?” Hoseok bursts out the second the door clatters shut. “That’s it?”\n“What?” Yoongi asks defensively, even though he knows exactly what.\n“Wow,” Hoseok marvels, staring at Yoongi like he truly can’t believe it. “You guys are the biggest fucking idiots.”\n“I’m sorry, what exactly did you expect to happen? At this very public company event?” Yoongi pouts.\n“I don’t know, I guess I just hoped that one of you would realize that you’re madly in love with each other.”\nYoongi scoffs. “Are you eight years old? Hoseok, we fucked. End of story. What would possibly make you think that he’s in love with me?”\n“Um, I don’t know, Yoongi. He bought you a dumb plant. He worked his ass off and called in like all of his favors to make your job easier,” Hoseok counts off the reasons on his fingers, “He spent much of his birthday two feet from your dick instead of making a break for it. And he turned down one very eager blowjob because he knew he was leaving and didn’t want either of you to get hurt. Not that that turned out, but, still…”\n“This is ridiculous, Tae,” Jimin says loudly, pushing past Taehyung to address Yoongi. “I’m telling him.”\nTaehyung grabs his arm and growls, “Jimin, do NOT-”\n“Jin drunk texted Tae that he was in love with you last night,” Jimin blurts out before Taehyung can stop him.\nThere are about three seconds of silence, then, “What.” Yoongi stares, frozen mid-snarl, refusing to believe.\n“Wait, seriously?” Hoseok asks, peeking around Yoongi and looking floored.\n“Thanks a fucking lot,” Taehyung spits at Jimin. \n“Tae, did he really?” Hoseok demands.\nTaehyung pouts. “He kind of got drunk after the meeting, and he told me.”\nYoongi lunges, snarling, but Hoseok is too fast, catching his arm. “Why the hell didn’t you say something?” Yoongi spits, struggling in Hoseok's grip.\nTaehyung looks genuinely surprised, spine going rigid, eyebrows disappearing into his fringe. “Oh, hell no. No. No, you don’t get to give me shit for this. You’re the one who explicitly told me no more meddling. You said don’t help you ever, ever again. So fuck that.”\n“Taehyung, this is-“ He grips his hair and throws back his head, groaning loudly. “Taehyung, this is- this is SO… that is- You-“\n“You said do not help you, even if you’re bleeding in a ditch!”\n“This is clearly not what I meant!”\n“How else what I supposed to interpret that? You said never again!”\n“Kids, now is clearly not the time to be arguing semantics,” Hoseok interrupts them, pushing Yoongi towards the door. “Yoongi, go.”\n“Go where?” Yoongi asks, though he knows.\n“Go after him!”\n“N.. No way!”\n“Yoongi,” Hoseok sighs, giving him that knowing look. “Just go.”\n“Ffff…uck.”\nThen he's charging towards the door as the cheers of his friends resonate behind him.\nOutside, the streets are dark and empty, and Yoongi's first thought is that he waited too long. But there's a flicker of movement, and Yoongi spots a pair of broad shoulders in an expensive coat hunched under the bus stop shelter. The figure checks his watch, before straightening back up and pulling his coat tighter around him.\n“Hey!” Yoongi shouts, too loud in the quiet streets. Jin turns then, and thank god it actually is Jin, because Yoongi is already jogging towards him determinedly. He’s out of breath by the time he reaches him, a combination of being extremely out of shape and also about to barf from nerves.\n“Yoongi,” Jin asks, concerned, turning to face him as he approaches. “What’s wrong?”\nYoongi reaches him finally, shoes slapping hard against the pavement as he comes to an abrupt stop.\n“Uh,” he wheezes, “You. I. You…. I need to sit down. Wow, I’m gonna barf for so many different reasons.”\nJin guides him to the bench, looking endearingly concerned, and Yoongi's stomach wriggles uncomfortably inside if him. “Hey, chill. You’re fine. What’s up?”\nYoongi swallows hard, the mucus sticking in his throat as he looks at Jin. “I think you should stay.”\nJin stiffens where he stands, taking an automatic half step back, and that is not a good sign. “What?”\nYoongi cringes both internally and externally, suddenly less brave. “I don’t think you should go. I think you should stay here.”\nJin looks pityingly at him, and Yoongi’s heart clenches painfully. “Yoongi, my apartment is rented. My ticket is booked. I’m going.”\n“Yeah well, there’s always going to be another apartment, another ticket, another city. It’s not going to stop unless you stop it. So stop it. And stay,” he hesitates before he adds, “With me.”\nJin lets the statement hang unresolved in the air for a few moments before he sighs. His fingers delicately find his temples and massage them gently. “Look, Yoongi. I thought I was clear going into this. I was always going to leave. I thought you knew that.”\n“I did know that. I mean, I do know that,” Yoongi stutters, heat flooding his face and ears. “But… I like you. So I’m trying. I’m making an absolute ass of myself trying. One of us has to.”\nJin sighs deeply, shifting his bag in his shoulder. “I don’t know what you think-“\n“Taehyung told me.”\nJin's mouth snaps shut with an abrupt clicking noise, and his eyes are suddenly hard, his lovely mouth pulled into a strangely harsh line.\n“What you said last night,” Yoongi continues, still trying to catch his breath, knowing that he sounds a little desperate now. “He told me.”\nJin’s blink seems like more of a twitch, and his mouth is tight as he takes a deep breath through his nose, nostrils flaring slightly.\n“I’m leaving, Yoongi,” he says finally, his voice disturbingly flat. “I don’t know what you want me to say.”\nYoongi deflates slowly, his stomach sinking through the floor as he chews so hard on the inside of his cheek that his tongue tastes bitter and metallic. His heart is galloping away at breakneck speed, adrenaline and anger surging in his blood. “Nothing, I guess.” His eyes are prickling in warning, and he bows his head to ensure that Jin can’t see. “But hey, you were right.”\n“About what?” Jin asks quietly, like he already knows. Yoongi swipes covertly at his eyes before pushing himself to his feet and staring into Jin's reluctant gaze.\n“You are a fucking coward.”\nWith the nastiest glare he can manage, Yoongi pushes past him, stuffing his hands into his pockets and hunching his shoulders against the wind. He makes it about ten feet before his neutral expression crumbles pathetically, and Yoongi has no choice but to walk back into the karaoke bar, because he knows Jin is still watching his retreating figure.\nHoseok understands the situation first, of course, heads off the premature chorus of ‘how did it go?’s and ‘what did he say?'s with a stern shush, rushing forward to divert a distraught Yoongi into the restroom, where he ushers out one guy mid-piss and locks the door behind them.\n \n \nYoongi gives himself the rest of the weekend. He allows himself to mope and cry and eat and whine and lay completely still, not saying or doing anything, just pitying himself.\nBut on Sunday, from the safety of his blanket burrito, he hears his front door clatter open against his wall, and he would be worried if he didn’t already know that Hoseok made a copy of his house key a few years ago, very much without his permission. For safety, he said.\n“Turn on your phone, you asshat,” Hoseok blurts out from the entryway. “It's going straight to voicemail.”\n“Euhhhhhgh,” Yoongi groans through four layers of blankets. Last he saw his phone, it was stuffed in his sock drawer so he didn’t have to think about people.\n“I assume you haven’t been out in public this weekend, so brought you groceries.”\nYoongi buries his head further into his blanket pile. “Jin loved food.”\n“He’s not dead, Yoongi. He’s just an ass.”\nYoongi grunts as Hoseok slides the bags onto his countertop. “He had a great ass.”\nHoseok plops down on the couch directly on top of Yoongi's feet, forcing him to grunt and draw them up into his chest. He slaps Yoongi’s ass affectionately. “How are you feeling?”\n“Fuckin great, never better.”\n“Okay, buddy.”\nHoseok just sits with him for a while as The Bachelorette plays in the background. Yoongi sniffs a little and snuggles into the couch, eyes trained on the TV. “He’s playing you, JoJo, don’t trust his fake-deep ass!” Yoongi explodes quietly but intensely, lobbing a used tissue at the TV, and Hoseok pats his blanketed ass affectionately.\n“Hey, Yoongi?” Hoseok asks after several minutes, and he sounds a little insecure.\n“What?”\n“I’m really sorry. If I pushed you too much with this whole thing.”\nYoongi struggles to sit up without the use of his hands, which are trapped in his burrito. “It’s… whatever dude. Not your fault it turned out like this.”\n“I know, I know. I just… I still feel bad. We all just want you to be happy.”\n“I am well aware,” Yoongi assures him with raised eyebrows. “And it’ll be the death of me.”\n“But really. How are you feeling?” Hoseok repeats, gentler this time.\nYoongi hesitates, collapsing back into the couch and exhaling hard through his nose. “Honestly, it feels worse than with Tae. Way worse than Tae. Why does it feel so much fucking worse than with Tae?”\nHoseok shrugs, snuggling a little closer to him. “I think maybe because you and Tae were never going to work. You knew that. He knew that. We all knew that. But you and Jin…” he trails off.\nYoongi feels nauseous.\n“But hey, I'm really proud of you, though. For putting yourself out there. I know that wasn’t easy for you. And look, just because you and Jin may have worked doesn’t mean he’s the only guy who will ever work for you. You’re a catch, my friend. And we will not rest until we find you a man. I promise.”\n“Hey Hoseok?”\n“Yeah?”\n“Come here,” Yoongi says, arms open wide.\nHoseok looks shocked but pleased as he clambers forward for a hug. “Aw, reall- OUCH!”\nHe recoils as Yoongi’s vicious flick resonates against his forehead. “Not even if I’m bleeding in a motherfucking ditch.”\n \n \nCome Monday, he is back, like nothing ever happened. Everyone gives him a wide berth, except Hoseok, who seems to be physically unable to not try and cheer him up, and Taehyung who very obviously feels responsible for the whole catastrophe.\n“Do you want a refill?” Taehyung asks him as he is perched on Yoongi's desk, gesturing at a mostly full mug of coffee.\n“No.”\n“Do you want some lunch? I can order lunch.”\n“It's nine in the morning, Tae.”\nTaehyung looks desperately around him, clearly determined to find something he can help with. His eyes skim over Yoongi himself, then he does a double take, gaze drifting down slightly. “Blowjob?”\n“Go away!” Yoongi explodes, chucking a pad of post-it notes at Taehyung's face and rising from his chair. Taehyung startled at his advance and scuttles away, looking fearful.\n“Hey, he’s just trying to help,” Hoseok says loudly from where he sits in Jin's old cubicle, empty except for a chair. He is tossing a stress ball repeatedly in the air, feet propped up on the desk.\nYoongi rolls his eyes. “Your proper response, as an HR guy, should be, ‘Well done for rejecting that inappropriate sexual proposition in the workplace.’”\n“I never discourage team building, Yoongi.” The stress ball finally stills in Hoseok's hands, and Yoongi tenses, because he knows that it means Hoseok wants to talk to him about something. “Uh hey. Are you going to those interviews today?”\nYoongi plops down in his seat and whirls away from Hoseok, crouching over his desk. “No.”\n“Ah. Right. Well that’s fine. I mean, it's not like you’re literally the only person in this office who can do it- Oh wait.Yep. You are.”\n“Why can’t you and Namjoon just do it?” Yoongi groans dejectedly.\n“Because we are hiring another accountant, and neither of us knows shit about accounting. If we aren’t careful, we'll end up with another me. And there is only room for one of me.”\n“You are literally the worst HR guy ever,” Yoongi allows, pouting.\n“Exactly. I am completely unqualified for the job,” Hoseok agrees. “But hey, don’t you want to choose who you work with? Unlike… last time…”\nYoongi is very still, scowling at his desk as he hears Hoseok shift nervously behind him. “I’m busy.”\n“Yes. Exactly. You are extremely busy. And that is why we are hiring another accountant. So come on,” Hoseok claps his hands expectantly. “Let's go.”\nYoongi just grunts, and Hoseok sighs in frustration behind him.\n“Fine, be that way,” Hoseok says, determined, and Yoongi thinks that maybe he’s given up. Until he feels something tight around him. He looks down and sees Hoseok's sweater wrapped around his chest, and it pulls tight as Hoseok uses the sleeves of his sweater to drag his rolling chair backwards, away from his desk.\n“Hey! Stop, you ass!” Yoongi demands, struggling feebly against the fabric. Hoseok ignores him, the chair bumping into the cubicle wall as he drags it out.\n“Nope. Not letting your breakup blues fuck up anything else your life. This will be good for you.”\nYoongi sighs and slumps as Hoseok drags him and his chair through the office, ignoring his friends' snorts and chuckles as they watch the pair roll slowly across the room.\nWhen they make it to the meeting room, clattering and jolting through the door, Hoseok pushes him into place beside Namjoon and knots the sweater around the back of his chair.\n“Stay,” he commands, taking his own place on the other side of Namjoon.\n \n \nYoongi watches the ashes on the end of his cigarette as they grow precariously long and start to lean low. The door clatters open behind him, and he startles, the ashes jolting loose and swirling down and down, over the side of the balcony. He whirls around, only mildly disappointed this time when he sees a balding middle aged man with an ill-fitting shirt.\nAll of the candidates had been extremely well-qualified, of course.\n“This one,” Yoongi had said when Namjoon had asked for his top pick, tossing at random the first folder on the pile in Namjoon's direction.\nNamjoon and Hoseok had given each other a badly disguised skeptical look. “Fine,” Namjoon had allowed, and that was the end of it.\nThat had been a month ago.\nNow, it's the new hire's first day, and Yoongi is putting off going upstairs. She had been nice enough, quiet and friendly. She had also looked mildly terrified of her surroundings, and who could blame her honestly, when the only view from the window separating the meeting room from the main office was a screaming Jungkook rocketing past on what Yoongi could only assume was an engaged fire extinguisher strapped to a rolling chair.\nSo he figures he'll give her some time to get a little acclimated to her new environment before he throws his own grumpy ass into the mix. If he was a weaker man, his reluctance might also have something to do with seeing Jin's cubicle occupied by someone other than Jin. But Min Yoongi is not a weaker man.\nHis phone buzzes obnoxiously in his pocket. He wonders who would be texting him so early in the morning, but of course it's Hoseok.\n \nAsshole #1: hottie alert in the accounting department\n \nYoongi scoffs, extinguishing his cigarette in the nearby ashtray and wondering when Hoseok developed a thing for (much) older women.\nBut he is far too tired, too curled in on himself to notice the weirdness in the air or the lingering scent of something sweet and familiar. He is simply as determined as possible to make it through this day with as little interaction with anyone as possible, especially his new cube buddy, Helen.\nHe tucks his head, fumbling with the box of cigarettes and lighter in his hand in an effort to look busy, eyes trained on his own fingers as he blows past Helen’s cubicle. From the sound of it, she isn’t in. Probably off doing orientation or paperwork with Hoseok. Yoongi slings his bag moodily to the floor, opening his email and quickly scanning through to delete the spam of daily lewd comics from Hoseok and Taehyung.\n“Hey.” Hoseok’s head appears over the top of his wall.\n“Hey,” Yoongi replies, looking confused. “Shouldn’t you be doing orientation stuff with the new hire?”\n“I mean, we already had most of his stuff on file from before, so there wasn’t much to do.”\n“What are you talking about?” Yoongi asks evenly, trying to ignore the unpleasant sensation of blood draining from his face.\n“Jin. Duh. How did that go by the way? The reunion? Was it totally fucking awkward? Have you guys already re-christened the cube?”\nYoongi is at once keenly aware of his surroundings. The sweetness in the air, that’s Jin’s disgusting, too-sweet coffee. The box sitting on the chair in the cube across the row is filled with neatly-organized file folders and topped with a precarious mountain of wrapped pastries. And that dorky laugh coming from somewhere close by is the same one he’s been hearing in his dreams and nightmares for the past few months.\n“Oh. Shit. Has it not happened yet?” Hoseok asks, looking abruptly fearful.\nYoongi is out of his seat, out of his cube, out of the office before he can even make the conscious decision to leave.\n“Yoongi, wait!” he hears as the door swings shut behind him, and waiting is the last thing he wants to do, especially when he recognizes that voice. He jogs lightly down the hall, jamming the button for the elevator so hard that it hurts, or it would hurt if he could register anything other than the raw, electrifying panic that is coursing through every vein in his body.\nLuckily for him, the doors slide right open, like the lift was waiting for him. He throws himself inside, urgently pressing the Door Close button. After an eternity, the doors finally start to rumble closed, and Yoongi breathes a sigh of relief.\nUntil his heart is in his throat. Until the doors jolt open as a shoe appears in the very last crack of space, and suddenly there is Jin. Yoongi feels like his heart has just fallen straight out of his ass.\nJin is breathing hard as he steps inside with Yoongi, allowing the elevator doors to close, leaving them utterly alone.\nYoongi’s taken aback, because Jin looks intensely vulnerable, so uncharacteristically uncertain, and that softness makes him so painfully beautiful that Yoongi’s heart aches. If he didn’t know he was in love with him before, he sure as fuck knows it now.\n“Um. Hi,” Jin greets him lamely. “That was… not how that was supposed to go.”\n“What the fuck are you doing here?” Yoongi swallows hard, trying to wrap his mind around the situation.\n“I-… I work here,” Jin says tentatively, with a frightened but hopeful smile.\n“No,” Yoongi replies, pleased at the anger in his own voice. “No, you used to work here. So what the fuck are you doing here now?”\n“Well. I, uh, took the accounting job. At the branch.”\n“You sure don’t look like the middle-aged woman we hired.”\nThe elevator doors slide open to reveal a small crowd of waiting strangers.\n“Sorry, this one's full,” Jin apologizes, mashing the Door Close button violently and ignoring their confused and mildly offended expressions. He presses the button for the highest floor. He turns back to Yoongi once they’re moving again. “Tae and Jimin scared her away.”\n“And why would they do that?” he demands, arms crossed defensively across his chest.\n“Because I asked them to?” It sounds like a question, and Yoongi can see the apprehension in his expression.\nHe bristles in anger. “So let me get this straight.” He licks his lips in annoyance, trying to figure out where to even start. “I haven’t heard from you in over a month, and now you’re just back? For good? With not so much as a heads-up? Who fucking does that?”\n“Okay,” Jin allows, nodding as he chews his lip. “That’s fair. This was probably not the best way to go about this whole thing, but-”\nYoongi scoffs viciously. “That is an understatement.”\nJin is quiet as he mumbles, “Taehyung said I should make a big gesture.”\n“Big gestures make me panic.”\n“Right. Of course they do. That would be why you ran. This was all one big, dumb thing to do. Motherfucking Kim Taehyung.” It’s Jin who looks angry now, at least for a moment, until his anger fades into something softer that looks like fear. “I bought a house here. I bought a fucking house.”\n“So I’m just going to let you languish in your buyers’ remorse while I get the fuck out of here, okay?” Yoongi says, turning to the door as the elevator slows once more at another floor.\n“Wait! Please just wait,” Jin begs him, grasping onto his sleeve. “At least let me apologize. I probably should have, you know, led with the apology. But I am an utterly clueless, endlessly selfish coward of such immense magnitude. Please?”\nAs Yoongi is pondering, the doors clatter open to reveal a single young woman, clutching a newspaper, who seems to pick up on the weird atmosphere, and after a few moments of awkward silence, she mumbles, “I’ll get the next one.”\n“Well at least you’re self-aware,” Yoongi glares at him as he turns away from the door as it closes once more, and Jin looks very determinedly at his feet. For a few seconds, the only sound is the mechanical clunking of the elevator as it makes its way up several floors. “Jin, why are you here?”\n“Because,” Jin struggles for the right words, “Because usually, when I move, it’s like this feeling of relief, like a fresh start. But the second my plane touched down, it was different. It wasn’t exciting or new. It was just… stale and ugly and shitty. And all I wanted was to be back here. Yoongi, sorry doesn’t even cover it. I owe you a hell of a lot more than an apology.”\nYoongi shifts uncomfortably as the elevator moves between floors 3 and 4. “You don’t owe me shit. You were always clear with me about what you wanted. Or didn’t want, I guess.”\n“No, but that’s just it. I do want it. I want it all,” Jin insists, and his eyes are a little desperate now. “I want the house and the cat and the friends and the job. And god, I want you.\" Jin pauses, clearly trying to read Yoongi's reaction. Yoongi tries to keep his face as expressionless as possible, but his insides feel like fireworks and jello. \"I just... didn’t realize how much until I left, and you weren’t there anymore.”\nYoongi eyes him carefully and skeptically, chewing very hard on his lip. “How… how do you want me?” he asks, hating how vulnerable it sounds, but he continues regardless, “Because I can’t… do what we did before and act like I don’t care about you. I mean, Jesus, you were asking me for those projections before I could even wipe the fucking cum of my desk.”\nJin cringes visibly at the memory. “That’s- that’s not what I want. That wasn't even what I wanted at the time, I just panicked, and it was such a shitty thing to do, and I'm so fucking sorry. I just want to be with you however you’ll let me.” His hand twitches towards Yoongi for a moment, like he is going to take his hand, but at the last minute, he doesn’t. “I’m… I’m here until you tell me to leave.”\nYoongi feels himself softening, but part of him is still very bitter. “So if I tell you to leave right now?”\nJin’s face falls pathetically, and Yoongi is both regretful and extremely satisfied. “Then you have my word. I’m gone.”\nYoongi stands up straighter, and there’s no Christmas Punch on which he can blame this burst of courage. It’s all him when he reaches forward to grab Jin’s hand. Jin looks surprised and flushed and immensely pleased. “And if I never tell you to leave?”\nJin smiles then, blinking hard in that cute way that he does, and his eyes look a little sparkly as he squeezes Yoongi’s hand. “Then I’m yours.”\nYoongi allows himself to crack a smile himself, pulling Jin even closer. When the elevator doors open again a moment later, he feels Jin stiffen perceptibly in front of him, and when he follows his gaze, he sees why.\nThe janitor is standing behind his cart, framed by the elevator entrance, looking extremely unamused. The three of them stand there for a moment in an intensely uncomfortable silence, until the doors do them a great mercy and slowly, so slowly rattle shut.\n“We have really got to stop living out our drama at work,” Yoongi says emotionlessly.\n\"Yeah, can I just reiterate what a bad idea I now recognize this to be?\" Jin replies sheepishly, rubbing his neck.\n\"God you're a dumbass,\" Yoongi says affectionately before dragging Jin's head down to capture his lips in a heated kiss. Yoongi realizes after a moment that they must not have pressed a button, because there is a sea of quiet gasps as the elevator doors slide open, but Yoongi just gropes for the Door Close button and opens his mouth to deepen the kiss. The doors do close, luckily, but a second later, his hand hits another button, and the elevator comes lurching to a stop, the alarm ringing insistently. Yoongi looks over and sees his hand on the Emergency Stop button. \nHe looks back at Jin, who just quirks an eyebrow and pulls Yoongi closer. He's hard. \"We should like… stop living our drama at work tomorrow, right?” Jin says lightly, testing the waters.\nYoongi sighs hard through his nose. “Throw your jacket on the security camera and take off your pants.”\n \n \n \"Okay, so against my better judgement, this is happening. Welcome everyone to the first and possibly last team-building seminar, led by our illustrious Sales Team,\" Namjoon says soullessly. \"Before we start to engage in whatever team-building activity you two have planned, I figure we could all get some general pointers from you two, as you are, somehow, the most successful Sales Team in our entire corporation. So. What's the secret to your teamwork?\"\nJimin and Taehyung look at each other and shrug, then Jimin speaks up. \"I guess I would have to say... sex?\"\n\"Okay,\" Namjoon nods, brows furrowed but face otherwise unchanged. \"Interesting metaphor. So what you're saying is that teamwork is a lot like sex. Mutually beneficial.\"\n\"Usually,\" Jimin mumbles, eyebrow quirked, and Taehyung gasps like he's been slapped. \n\"So what kinds of things do you guys do as a team to maintain that bond?\" Namjoon prompts them further, resting his chin on his folded hands and leaning forward. \n\"Lots of oral mostly. Like insane amounts of oral,\" Taehyung shrugs. \"Luckily, we're both really into it.\"\n\"Oral communication,\" Namjoon mutters seriously, still nodding. \"Good, good. Yes, communication is key to teamwork. We could all engage a little more orally around here.\"\nJungkook stifles his laughter, and Jimin and Taehyung just look at Namjoon with vague, confused smiles. \n\"Uh... right,\" Taehyung continues. \"But I would also say that it's important to do a lot of like... emotional and spiritual maintenance. Sex is one thing, but at the end of the day, marriage is impossible if you don't constantly do work on that emotional bond as you both change and grow.\"\n\"Yes, yes, the closeness required between teammates for the honest exchange and marriage of ideas,\" Namjoon agrees, and Yoongi rolls his eyes so hard that it hurts. \"Collaboration. Trust. All of these things are key. Anything else?\"\n\"Uh.... Assplay?\" Jimin adds, looking to Taehyung for confirmation. Taehyung nods vigorously. \nNamjoon's expression remains unchanged, but his eyes are suddenly unblinking and wide. \"Excuse me?\"\n\"Yeah, like, mutual assplay. We find that it preserves our power dynamic and keeps us on equal footing sexually,\" Taehyung explains very matter-of-factly, Jimin nodding quietly beside him. \n\"And by assplay you mean...\" Namjoon prompts them, and Yoongi sees the fear in his eyes now. \n\"...Assplay,\" Jimin confirms. \"Wow, I really can't believe we are allowed to talk about this at work.\"\nIt's silent.\n\"I'm sorry, I'm not following. That sounds... sexual,\" Namjoon shakes his head, face crumpled in confusion now. \n\"It is very sexual,\" Taehyung clarifies, \"It's... assplay.\"\n\"You mean...\" Namjoon starts, the horror setting in on his face. \"You... and Jimin... do assplay… with each other?”\n“Uh… yes,” Taehyung confirms. “We also do lots of other sexual things. That’s… what couples do.”\n“Couples?\" Hoseok asks, eyes wide. “You guys are a couple?”\n\"Are you fucking kidding me?\" Jimin demands, springing to his feed in indignant anger. “We have been married for two fucking years.”\nTotal silence.\n“Wh…aaat?” Hoseok breathes from beside Yoongi, and Namjoon is just silent now.\n“You guys were at the goddamn wedding!” Jimin fumes, and Taehyung is just shaking in silent laughter beside him.\n“You mean the friendship ceremony?” Hoseok asks, and Jimin throws up his hands in exasperation.\n“Wow, you guys are unbelievable!” Jimin exclaims, pacing now. “We have been fucking in the supply closet at least once a week for the past several years. Jungkook, how many times have you walked in on me with Tae’s dick in my mouth?”\n“The… brojobs?”\nThe conversation quickly devolves into confused squabbling, and Yoongi just sits back in his seat, leaning lightly against Jin as the chaos unfolds before him.\n“Can I just take this opportunity to say ‘I told you so,’” Jin whispers to him as Jimin and Taehyung re-enact an obvious sex act in way of explanation. When he doesn’t receive a response, he looks at Yoongi quizzically. “Okay, you are like weirdly quiet and chill about this.”\n“I already knew,” Yoongi tells him with a small smile. “Or at least I guessed, that time I almost killed Tae in the supply closet. He said something that kind of explained everything that’s happened since 2010. I guess I was willfully blind.”\n“Well we’re all guilty of being willfully blind sometimes,” Jin says gently as he entwines their hands together and strokes the skin of Yoongi’s hand with his thumb.\n“On my DESK, Tae? Seriously?” Namjoon explodes.\n“Hey, it wasn’t just us! They did it, too!” Taehyung defends himself, pointing his finger at Yoongi and Jin, and Yoongi just smirks at the memory. That had been a good day.\n“Hey, don’t put this on us,” Jin says calmly. “Raise your hand if you have not had sex on Namjoon’s desk.”\nNot a single hand.\n \n \nYoongi thinks that Jin has never looked as beautiful as he does in the soft, orange light emitting from the bonfire made from Namjoon’s desk.\n“You want to get out of here?” Yoongi asks gently, leaning forward to press his forehead against Jin’s. Jin nods, shutting his eyes and sighing contentedly. “Hey guys, we’re out.”\n“What? No way! This is a mandatory post-hours social event,” Hoseok argues, and the marshmallow that he is roasting over the burning leg of the desk busts into flames.\n“First of all, that is not a real thing and second of all we are leaving to do something very important and work-related,” Yoongi protests, holding Jin’s hand defiantly. “Accounting Department Stuff. Vital to the functionality of our branch.”\n“Say team building,” Namjoon dares him, eyes hard. “Say it.”\nYoongi chews his lip in contemplation. “I was gonna go with Oral Communication Seminar.”\nNamjoon collapses into a folding camp chair that someone had dug out of their car. “Go. Just go.”\n“Hey, wait a second,” Hoseok calls after them. “What do you say you guys let me film your session for this little HR Training video that I’m working on? Very tasteful. Jimin and Taehyung have already contributed.”\n“I wouldn’t say ‘contributed’ so much as I would say that he found our pornhub channel,” Taehyung clarifies as he gently cups Jimin’s butt.\n“You literally have a link to it in your email signatures,” Hoseok points out.\n“You WHAT?” Namjoon demands, marshmallows spilling from his mouth.\n“It’s only for internal branch emails,” Jimin assures them calmly.\n“And you did didn’t see this as an HR issue? Or like, a potential lawsuit?” Namjoon groans, now slumped in his lawn chair, head thrown back in despair.\n“No,” Hoseok scoffs. “You heard the man. Internal emails only. We’re safe. Like, no one in this branch would rat us out.” After a moment, he adds, “Except Jungkook. Jungkook might rat us out.”\n“That’s true, he tried to sell me to a hotdog vendor when he was drunk last week,” Jimin reveals.\n“Fuck you, I’m ride or die!” Jungkook says indignantly.\n“You are all fired. Every single one of you,” Namjoon tells them very seriously.\n“No we’re not,” Hoseok says without shame or hesitation.\n“Anyway, what’s wrong with wanting to share our love with our closest friends?” Taehyung says, entwining his fingers with Jimin’s. “Plus, we’re actually married, which makes what we do in those videos basically wholesome.”\nHoseok chokes on a marshmallow that he has jut shoved in his mouth. “I would not call what you were doing to Jimin ‘wholesome.’”\n“Hi, can we leave now?” Yoongi asks.\n“No,” several voices shout in unison.\n“Okay well we are leaving anyway because we are adults who do not require your permission so fuck you guys, and also Hoseok’s sleeve is on fire,” Yoongi informs them, dragging Jin behind him, back into the building so that they can grab their bags from upstairs before they go. Hoseok’s scream echoes off the side of the building, followed shortly by a roar of intense laughter.\nThey’ve just stepped through the door into their office when Yoongi’s phone chimes.\n“Who is it?” Jin asks. “Is it them? Hoseok didn’t actually die, right?”\nYoongi’s brow furrows in confusion. “It’s a blank email from Jimin.”\n“A blank email?”\n“Yeah there is literally nothing here except- oh.”\n“What?”\n“Except his email signature,” Yoongi says evenly, thumb hovering uncertainly over the link.\n“Holy shit,” Jin breathes, pulling Yoongi’s hand closer to get a better look. “Hoseok wasn’t kidding. Look. It’s right there.”\nYoongi scoffs but does not move his finger. “Gross… right?”\n“Oh, completely.” Jin says just a little too loud. A pause. “Right?”\n“Totally,” Yoongi confirms, then quieter, “But like… What do you think he was doing to Jimin?” He looks at Jin, who looks right back.\nThey have a moment of silent communication, and then Yoongi’s mumbling an unconvincing “Oops” as his thumb clicks the link. There are a few seconds of familiar giggling, then that giggle dissolves into a moan, and they are officially in too deep.\n“Is Namjoon’s office still unlocked?” Jin asks casually, eyes trained on the small screen in front of them.\n“Yep,” Yoongi says, jaw slack as his eyes are trained unwaveringly on the screen in front of him.\n“Do you wanna…” Jin trails off raising his eyebrows suggestively.\n“Yep.”\n“Are you bringing the pho-”\n“Yep.”\n“We are going straight to hel-”\n“Yep.”\n \n "
}