{
    "id": "7680397",
    "url": "https://archiveofourown.org/works/7680397?view_full_work=true",
    "author": [
        "aknightley"
    ],
    "title": "so why don't we fall",
    "rating": "Explicit",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Voltron: Legendary Defender"
    ],
    "relationships": [
        "Keith/Lance (Voltron)"
    ],
    "characters": [
        "Keith (Voltron)",
        "Lance (Voltron)",
        "Pidge (Voltron)",
        "Hunk (Voltron)",
        "Shiro (Voltron)",
        "Allura (Voltron)",
        "Coran (Voltron)"
    ],
    "additional_tags": [
        "Fluff",
        "5+1 Things",
        "Established Relationship",
        "Fluff and Angst",
        "non-binary Pidge",
        "Sex"
    ],
    "language": "English",
    "series": "",
    "published": "2016-08-05",
    "completed": null,
    "words": "8,218",
    "chapters": "1/1",
    "comments": "360",
    "kudos": "19,756",
    "bookmarks": "3,219",
    "hits": "248,824",
    "summary": "<p>Five times Lance used a pet name for Keith, and one time Keith used one for Lance.</p>\n<p> <em>Keith has no basis for having a relationship with someone, so he's trying to follow Lance's lead. </em></p>",
    "notes": "<p>This turned into a lot more than I meant for it to. I literally just started off wanting separate scenes, a drama-free little one-shot. Oh well. </p>\n<p>Title comes from \"Touch It,\" by Ariana Grande. I've decided every Klance fic I ever write is going to take its title from a girly romantic pop song, and I'm sticking to my guns.</p>\n<p>ETA: <a href=\"https://ficbook.net/readfic/4637346\" rel=\"nofollow\">This fic has been translated into Russian!</a> Many thanks to <a href=\"https://archiveofourown.org/users/like_special_K\" rel=\"nofollow\">like_special_K!</a></p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p><em>cariño</em> - honey/love/sweetie<br><em>aein</em> - sweetheart/lover</p>\n<p>Just so we're all aware, I personally think Lance would use 'babe' all the time for Keith in public, and then stick to sweetheart in private. Just my personal thoughts. </p>\n<p>You can find me at <a href=\"https://apvrrish.tumblr.com\" rel=\"nofollow\">my tumblr.</a> Also I'm trying to use my twitter again, find me <a href=\"https://twitter.com/apvrrish\" rel=\"nofollow\">@apvrrish</a>.</p>",
    "text": " \n \nKeith has no basis for having a relationship with someone, so he's trying to follow Lance's lead. He's had crushes, obviously, but he's never really been with anyone before, so being with Lance is taking some getting used to. They've been dating for several weeks now, for whatever it means to be dating while you're on a mission to save the entire universe from some galactic genocidal maniac, and it seems to be going well? Keith isn't sure. They haven't really done anything different than they were doing before, except now they make out a lot and hold hands and sometimes Keith gets the urge to lean up against Lance while they're sitting on the couch and he can actually do it instead of just wishing for it. \nBut as far as being a couple otherwise, he's not really sure how he should be acting. \nLance seems to be a natural at it, not that Keith is really surprised, given how open and flirtatious he is. Lance is the one to initiate their hand holding, or to absently kiss him on the top of his head when they're brushing their teeth in the morning, or to ask him if he wants to walk around the observation platform late at night so they can be on their own together. Lance can keep their conversations going for hours, and kisses him like he's dying to touch Keith forever, which is just -- so overwhelming, and wonderful, and more than Keith knows how to handle. \nKeith is just trying to keep up, honestly. \nThey're in a bar on Rafl'xas, a planet on the edge of the solar system where there's a decent amount of anti-Galran empire activity, waiting on information on Zarkon's military bases from an informant. They've done this several times now, and Shiro seems to think they can handle the responsibility, so it's just him and Lance and Hunk today. They're crowded around a small, round table in the busy bar, and Hunk and Lance are arguing about pretzels. Lance is also trying to trap Keith's leg between his own legs, something Keith is struggling not to smile about.\n\"I'm just saying, soft pretzels come with different flavors of dipping sauce. Think about it, Hunk! This is a no brainer,\" Lance says, even as he maneuvers a foot around Keith's right leg and pulls. Keith halfheartedly struggles away, but he's kind of enjoying the distraction of a dumb game of footsie while they wait. This informant is never on time, and Keith likes the way there's a soft grin curving Lance's mouth, the way he keeps flicking glances Keith's way to make sure he's paying attention.\n\"Um, Lance, I don't know if you knew this, but you can dip hard pretzels in stuff too. Like chocolate,\" Hunk says, shaking his head. \"Plus, they're crunchy. Who doesn't like the crunch?\" Keith kind of can't believe he's listening to this, but he also knows that Lance and Hunk seem to miss Earth more than anyone else on the team -- certainly more than Keith does -- and if they want to have ridiculous conversations about food from back home, then they should be able to. \nKeith is nudging his heel playfully against the back of Lance's calf when a mug slams down in front of him, startling him a little. The dark green liquid sloshes slightly, sending off the strong scent of gasoline and something like mint, making him dizzy. He looks up at the alien who had set it down and is now looming over him, smirking vaguely. \n\"Hello,\" they say, and he notices how their tongue is forked on the end. \"I am Yrba. You looked a little thirsty.\" Yrba has tall, pointed ears, a long, fuzzy blue tail, and completely black eyes. They're vaguely beautiful, in the way that deadly snakes are sometimes beautiful. Keith feels himself tense automatically, but he can already hear Shiro's voice in his head, telling him that they're diplomats for Altea now, and they can't risk starting an intergalactic war because they couldn't be polite for five minutes. He swallows down his frown and smiles vaguely at the alien.\n\"Thank you,\" Keith says, nodding a little but making no moves to pick up the drink. Yrba doesn't seem bothered, just leans in closer. \n\"What's a pretty morsel like yourself doing all the way out here, hm?\" Yrba says, setting a hand on the table next where Keith's hand is resting. Keith can't help the slight frown this time, but he doesn't pull away. You're welcome, Shiro, he thinks flatly. \n\"Bar hopping,\" Keith says briefly, hoping to end the conversation before it begins. \n\"Well I'm glad you chose this bar to hop to,\" Yrba says, making a low noise that almost sounds like a purr with a slight hiss on the end. Keith's fingers clench automatically. \"You know, handsome--\"\n\"Hey baby,\" Lance says, \"How are you doing over here? Making friends?\" Lance had been across the table from him a second ago, but now he's pressed up along Keith's side, slinging an arm over his shoulder.  Startled, Keith shoots Lance a look, but Lance is staring straight at Yrba with a very rigid smile. On the other side of the table, Hunk is quietly groaning into his hands. \n\"Um,\" Keith says, \"This is Yrba?\" He leans into Lance a little, trying to get him to stop glaring at the alien, but Lance refuses to break eye contact with them. His fingers tighten on Keith's shoulder. \n\"What's up, Yrba? You out making friends?\" Lance says. \"My boyfriend here just loves meeting new people, isn't that right, Keith?\" \n\"Y...es,\" Keith lies, catching Hunk's eyes in an attempt to understand what's happening. Hunk is shaking his head regretfully, apparently not interested in saving Keith from this horrifying conversation. \nYrba is standing up straight now, tail whipping back and forth in agitation as they look at Lance, who keeps smiling coldly at them. \"Very well,\" they say with that same weird hissing noise.\"I shall see you again, pretty one,\" they add, stroking Keith's forearm with their tail as they walk away. Lance makes a muted noise of outrage, still holding Keith against him. \n\"Can you believe that?\" he asks indignantly. \"I'm right here!\"\n\"What's your deal?\" Keith asks, jabbing Lance with his elbow gently. This close, he can smell the cinnamon-scented shampoo that Lance uses, covering the murky scent of bar smoke and whatever passes for alcohol at this place. He kind of wants to bury his face in Lance's hair, but his head is buzzing a little at what just happened.\n\"I wasn't rude to them,\" Lance protests. \"Hunk, tell him!\" Across the table, Hunk makes a small noise of assent, but he isn't looking at either of them, deliberately avoiding their eyes. Keith doesn't entirely blame him.\n\"Not that,\" Keith says, flushing. \"You called me baby.\" He can feel his ears turning red just saying it out loud.\nLance stares at him. \"Um, yes? We're dating, I thought you knew that? We've been making out for weeks now, Keith.\" \nKeith elbows him harder this time and Lance lets out a small oof. \"But baby?\" No one has ever called him a pet name before. He doesn't know quite how to feel about it.\n\"Oh my god,\" Lance says, grin slowly widening into a smirk. \"You're embarrassed! That's adorable.\" He tries to plant a kiss on Keith's cheek but Keith leans away sharply, scowling. Lance laughs.\n\"Fuck off,\" Keith snaps, definitely blushing now. \n\"It definitely is adorable, dude,\" Hunk says from the other side of the table. Lance points to him triumphantly, and Keith is just about to open his mouth to argue with them, when a huge cloaked figure drops into the seat next to Hunk, startling him into a yelp. It's the guy they've been waiting for, sporting a bulging black bag and a harried expression. \n\"I am here to deal with the Paladins of Voltron?\" the informant says, so Keith has to swallow back his arguments and get down to business. Lance removes his arm from around Keith to lean forward as he speaks to the informant, something that Keith does not miss at all. He puts the incident at the back of his mind to deal with later. \n \n \nKeith is kind of pleasantly surprised to find that he gets along really well with Pidge. They tend to sit quietly together in the common room, both content to be absorbed in their own activities, but they also have easy conversations, something that Keith hasn't really ever had with other people. At Garrison, he'd been so caught up in classes, and then caught up with losing Shiro; he'd never bothered to make connections, not even with the others assigned to his group. Having the team, having Lance, has completely changed the way he looks at relationships and his own feelings. So it's nice, to be able to sit with Pidge and just talk.\n\"Maybe we'll get to go back to that planet with all of those islands,\" Keith says, teasing. \"I don't think you got enough sun the last time we were there.\" Pidge had been varying shades of red and pink from head to toe by the time they'd left that planet, and the team had put up with a week of the green paladin stalking around annoyed and covered in some kind of Altean gel that was meant to soothe burns. The gel had been a startling shade of lime green, and Pidge had looked completely ridiculous. Lance still gets tears in his eyes, thinking about it.\nPidge raises an eyebrow, unimpressed. \"I wouldn't want you to die of dehydration though, Keith.\" When Keith just looks confused, they clarify: \"I mean, I know Lance looks good in a bathing suit, but that kind of thirst was just--\" They break off into laughter when Keith flushes and lunges forward to tackle them, both of them rolling over the couch in a tangle of limbs.\nHe digs his fingers into Pidge's sides, laughing with them as they shriek and try to squirm away, kicking their feet out. Sometimes, Keith thinks, they forget that Pidge is the youngest -- they shoulder so much responsibility, they act older than they really are, but they've had to deal with so much and they're only fourteen. Keith is no stranger to losing family, but he understands that it's almost worse when there's the hope that you might recover them. Keith has already accepted that he'll never get to see his parents again; he has a small measure of closure, knowing that he has to move on. Pidge doesn't have that yet, and they might never get it if they don't find out where Sam and Matt are, even if they do manage to defeat Zarkon.\nSo when he gets the opportunity to make Pidge happy, especially when it's like this, uncomplicated and silly, Keith can't help but feel warm. He's never been able to be this kind of person for someone, to have these kinds of relationships. Voltron has changed that. \n\"Mercy, you jerk,\" Pidge wheezes, landing a solid kick against's Keith's stomach. He winces, pulling back and rubbing at the spot, then gives Pidge an appraising look.\n\"Have you been practicing?\" he asks, surprised when they flush a little. \n\"Yeah,\" they say, tucking a lock of hair behind their ear. \"Uh, Lance and I are working on our close combat together. Since we don't have as much experience as the rest of you.\" They look faintly embarrassed. \n\"Lance?\" Keith asks. \"How come no one knows?\" Why hadn't Keith known, considering how much time he spends with both of them? He and Lance are practically sharing a room at this point. \n\"It's not a big deal,\" Pidge shrugs. \"Just helping each other out. Lance is easy to work with, when he's not being ridiculous.\" \nKeith can picture it, the two of them sparring when they have a free minute, practicing their skills on their own to keep from being a burden on the rest of the team. He thinks of Lance, of the times he's caught him coming out of the shower with bruises on his back and legs, assuming they were from missions or his own clumsiness. He feels his heart do a slow roll in his chest at the thought of Lance working so hard to get better at something on his own. \n\"You're blushing,\" Pidge says gleefully. \"You two are disgusting.\" \n\"Shut up,\" Keith says, rolling his eyes. \n\"Lance is worse,\" Pidge assures him, leaning back and setting their feet in his lap idly. Keith pinches their ankle but doesn't push them away. \"It's like, because he can't say anything to your face since he's a child, he's a hundred times gushier to other people. If I have to hear about how hot you are with your hair up one more time--\"\n\"Pidge.\" They both look up to see Lance and Hunk in the doorway; Lance is scarlet while Hunk is smothering his laughter into his fist. Pidge looks mischievous but not particularly apologetic. Keith is torn between amusement and embarrassment. \nLance stomps into the room and points accusingly at Pidge. \"How could you, Pidge! We swore an oath--\"\n\"We did not,\" Pidge interrupts.\n\"--that we would keep all our training session conversations between us! How could you sell me out like this?\"\n\"How could I tell your boyfriend that you think he's hot?\" Pidge asks, deadpan. \"I'm a monster.\"\nLance throws himself next to Keith on the couch, burying his face in Keith's neck. Keith stiffens before he can help himself, but then relaxes again as Lance tucks himself under Keith's arm. Lance either doesn't notice or pretends not to, which Keith is grateful for. He's still learning to let people into his space like this, but it's easier and easier with Lance. \n\"Don't ever listen to what Pidge says, cariño. They only tell lies,\" he says petulantly.\n\"Sure,\" Keith says, scrubbing a hand through the hair at the base of Lance's neck, wondering what Lance had called him. Some kind of term of endearment, probably, but also maybe something rude. It's sometimes hard to tell with Lance. He'll have to look it up later. Cariño. \"Do you guys want me to help out, when you're training?\" Pidge gives him a quizzical look; Lance is still rubbing his face into the crook of Keith's shoulder. When neither of them immediately responds, Keith flushes and stammers, \"I mean, if you want--\"\n\"Sounds good, Keith,\" Pidge says, nudging him with their foot. \"Right, Lance?\"\n\"Mmm, yeah, that's fine. I mean, apparently I can't use our time together as a gossip session anymore, so why not?\" Lance finally lifts his head to glare at Pidge. \n\"An unexpected side benefit,\" Pidge says seriously, and then laughs when Lance immediately starts trying to drag them off the couch. Keith leans back from the explosion of energy, laughing, peaceful despite the chaos.\n \n \nKeith gasps for breath, pressing his face down into the pillow, futilely trying to smother some of the noises he's making. Sweat is sliding down the back of his neck, meeting where Lance has a hand against his shoulder blades, holding him down as he writhes into the sheets. His entire body is aflame, burning him from one end to the other, especially in the places where Lance's sticky skin is against his own. He's almost dizzy with the heat and the overwhelming feeling of Lance inside of him, opening him up and pinning him in place. \n\"Keith,\" Lance murmurs, pressing in deeper, \"Keith, Keith.\" He sounds almost delirious with pleasure; Keith stifles a sob, turning to hide his face in the crook of his elbow when Lance rubs his thumb soothingly at the base of Keith's spine, dipping down over and over again. Lance is going so slow, they've never gone this slow before, it's driving him crazy to have the stretch and the heat and that hiss of pleasurepain but drawn out, dragging. He's afraid he's going to turn into ashes in Lance's arms.\n\"Keith,\" Lance says roughly, \"Let me hear  you.\" He takes his hand from Keith's lower back and reaches up to pull Keith's arm away from his face, and Keith flushes even hotter as the sounds he's been muffling filter out. He's keening, breath hitching into little whines as he tries to leverage his hips up into Lance's slow grinding, and Lance rewards him with a vicious thrust that has him frantically scrabbling for something to hold onto, curling his fingers into the sheets.\n\"Fuck,\" he chants feverishly, \"Fuck fuck fuck.\" \n\"Mmm,\" Lance hums, slowing down again but still pushing as deep as he can, adding an extra twist at the end that has Keith seeing stars. This is going to kill him, Keith thinks wildly. Lance is going to kill him with his dick, and he's probably going to like it. \"Doing okay, sweetheart?\" \nThe pet name, sliding out of Lance's mouth like honey, makes Keith's face burn hotter, as if that were possible, and he clenches down on his dick without even thinking about it. It sends electricity racing hot through his body, makes his toes curl against the bed. Lance groans low in his throat, and then leans down, pressing his mouth against the back of Keith's neck. Keith can feel him smiling. \n\"You like that, sweetheart?\" Lance is smirking now, and his hips are slowly, slowly speeding up. Keith hisses through his teeth, struggling to push back into Lance even as he revels in being held down like this. \"Keith, come on, talk to me.\"\nKeith swears viciously, which makes Lance laugh. He can't believe how hot he is, like he's imploding, a dying star collapsing in on itself. He just wants to come; he never wants this to stop. \"Yes, yes, I like it,\" he pants, \"Come on, Lance, stop teasing me, please fuck me, please.\" He tightens as hard as he can around Lance's dick, trying to convey how desperate he is, and Lance freezes in place. \nThen he pulls out completely.\nKeith immediately sobs, lifting his hips back up, trying to get Lance back inside of him, so close to just begging for it, and then quiets when Lance's hands on his hips push him over and onto his back. He barely has time to focus on the image of Lance, sweaty and red and determined, looming above him, before his legs are shoved back against his chest and Lance is slipping back into him in one smooth motion. Lance's eyes are blown out, black pupils and faint blue-rimmed irises, and his gaze never strays from Keith's as he fucks into him over and over and over. \nKeith cries out, practically wailing, his whole body shifting up the bed as Lance presses against him. The sounds of their bodies colliding is a wet slap, brutally loud despite the noises Keith is making. Keith stretches his hands above his head, trying to keep from sliding into the wall,  spreading his legs wider so that Lance can lean down and kiss him. Lance tastes like sweat and cinnamon, and his tongue is warm and rough as he licks into Keith's open mouth. Keith's eyes cross staring at him, but he doesn't want to close them, wants to absorb every grunt and curse and dirty sound coming out of Lance's mouth and keep them in his mind forever. He's never been looked at like this before, like he's the beginning and end of the world. He wonders desperately what his own face looks like, hopes he doesn't look as fractured and overwhelmed as he feels, because Lance will never let him live it down.\nHe can feel it stirring in his stomach, this liquid warmth that's been boiling for what feels like hours. Above him, Lance is muttering in Spanish to himself, running his mouth absently over Keith's forehead and cheeks. He can't even push back against Lance like this, can't touch himself or do anything but hang, trembling in Lance's grasp. His legs are pressed up tight against his chest, and there's sweat at the back of his knees where Lance is holding him down, and every time Lance grinds down into him he feels like he's breaking apart. His entire body is a mess of feelings, and he can't separate them out into coherency.\n\"Lance,\" he says frantically, because it feels like the only word he knows.\nLance focuses on him again; he doesn't stop fucking into Keith but he does let go of one of his legs to reach down and wrap a hand around Keith's dick, which has been dripping slick over both of their chests this whole time. Keith stiffens at the feel of Lance's hand gripping tight around him, balanced precariously on the edge of coming.\nLance, his eyes wild and his mouth curved wickedly, leans down and whispers into Keith's ear, \"Come for me, sweetheart.\" \nKeith's whole body goes hot and then cold, and he arches up off the bed as he comes explosively, shooting out over Lance's fist. Lance keeps stroking him through it, prolonging the orgasm into something almost painful, but Keith doesn't ask him to stop. He struggles to breathe around the choked noises that keep issuing from his mouth, barely aware that Lance is still fucking into him, edges of his vision going fuzzy.\nHe lays there, floating, absently shivering when Lance buries his face in Keith's neck and pushes hard into him, coming in a series of long, slow thrusts that leave him trembling. He's going to be so sore, he thinks vaguely, a little bit pleased about it. His legs are still pushed up against his chest, starting to ache a little, but Lance's collapsed body weight feels nice. Comforting, he thinks, running his fingers through Lance's sweaty hair.\nThey lay there a minute, catching their breath, until Lance starts snickering into his chest. Keith rolls his eyes. \n\"So. Sweetheart, huh?\" Lance asks, lifting his head so he can look at Keith, smirking. His pointy chin is digging into Keith's collarbone, which kind of hurts, so he pinches Lance's neck until he sits back up again. They both groan when that causes Lance to shift inside of Keith, so Lance gingerly pulls out, carelessly removing and tossing the condom off onto the floor. Keith sighs.\n\"Don't even start,\" Keith warns him, lowering his legs and stretching out, wincing as his joints pop. His whole body is still warm and faintly buzzing; he languidly feels like he could sleep for days, as long as Lance were curled up next to him. He immediately resolves to never say something like that to Lance, ever. He's already embarrassed remembering everything he's already said.\n\"It's okay, sweetheart,\" Lance says, throwing himself back down next to Keith, curling a hand around the top of his head. His fingers comb through the sweaty mess of hair on Keith's nape, and he leans into the touch, struggling not to fall asleep. \"It can be our little secret.\"\nKeith grabs for a pillow behind him and tries to smother Lance, resulting in a weary but hilarious wrestling match that leaves Keith with a fresh kick to his shin and Lance with a red face and terrible bedhead. They're both laughing, but then Lance breaks off to yawn. \n\"Go to sleep, jackass,\" Keith says, maneuvering them so that he's pressed up behind Lance, tucking his face over his shoulder. Lance wiggles back against him to fit their bodies together more neatly, tucking his leg between Keith's calves. He sighs deeply, and Keith buries a smile into his shoulder. He's never felt so warm and calm and happy before. \n\"Love you,\" Lance murmurs, drifting asleep, and Keith sleepily absorbs that, content, and then freezes, wide awake again. What.\n \n \nLance clearly doesn't remember saying it, because he's just as chipper and generally sunny in the morning as usual; Keith, on the other hand, had stayed up half the night, quietly panicking with his forehead pressed to the back of Lance's neck, afraid to move. He had never been a morning person to begin with, but between the sex and the lack of sleep, he was practically dead on his feet in the morning.\nIt's not just the morning after, either. He isn't quite avoiding Lance, they still spend time together and kiss each other hello and hold hands when they walk to breakfast, but he can't help but feel embarrassed and awkward, thinking of Lance sleepily confessing that he loves him while Keith just lay there like an idiot.  For a few days after that night, he spends all of his free time on the training deck on his own, practicing until he's nearly unable to move, thinking he loves you he loves you he loves you and completely terrified. He fights like maybe he can defeat his own thoughts, ripping holes and severing limbs and accumulating bruises and scrapes with increasing regularity. He knows everyone can tell something is wrong, especially Lance, but he can't stop. If he stops then he has to think about everything and it's just -- too much.\nKeith had just been getting used to accepting how much he liked Lance, how he was so happy to just be with him in any way that he could. It had taken a lot of headbutting and fighting and agonizing for them to even get together in the first place, and now he's having to put love into the equation. \nHe knows he likes Lance a lot. More than a lot. Keith spends more of his day thinking about Lance's smile and laugh and bright eyes than he cares to admit. It's honestly baffling that he's gone from someone who spoke maybe twice to other human beings within a six month period to someone who spends literally all of his time with another person -- especially when that person is Lance, who literally never shuts up. But he's been happy, up until now.\nNot that the idea of Lance loving him makes him unhappy, exactly. It's just overwhelming, knowing that someone cares that much about him. Keith has been swallowing around butterflies in his stomach for days now, thinking of those sleepy words falling off Lance's lips, thinking of hearing them again at some point when Lance is awake and he'll have to respond. What is he supposed to say?\nHe slices the training robot in half and collapses as it disappears, sprawled onto the ground and panting for air. He doesn't feel any better, but at least he's too exhausted to obsess too much over it. \nSomeone slow claps from the other side of the room. Keith jerks his head around, freezing when he spies Lance leaned against the wall. \n\"Impressive,\" Lance drawls. There's something combative about the way he's casually propped up, something predatory in his gaze. Keith shivers a little, trepidation creeping down his spine. \"You should go again, see if you can actually train yourself into a coma.\" His words are light, but when he pushes off the wall, Lance looks anything but friendly. \n\"What's up?\" Keith says, sitting up and wincing when his lower back twinges. His arms feel like soggy limp noodles, and his head aches faintly from a bad fall earlier. He hurts all over, but none of that compares to the sharp pain of knowing that he put that look on Lance's face. Lance stops several feet away from him and crosses his arms.\n\"Thought maybe you could tell me,\" Lance says. He's not frowning, exactly, but his expression still makes Keith tense. He's not sure he'll win in a battle of wills against Lance right now, especially when he's so strung out. \"You've kind of been weird, lately.\"\nKeith shrugs, avoiding Lance's gaze. \"Just trying to keep in shape, I guess. Allura says we've almost located that military base, so I just wanna be ready.\" It would sound like a good excuse if Keith weren't terrible at lying. Lance scoffs.\n\"Dude, I can tell when something is up. I know you.\" The problem is, Lance does know Keith. Keith is struggling to understand himself, which is the problem. How is he supposed to know if he's in love with Lance or not? What if he tells him that he is, and it turns out not to be true? If he says that he doesn't, what if Lance doesn't want to be with him anymore? He doesn't want to hurt Lance, and he doesn't want to lie, which leaves him right back where he was. He swallows hard.\n\"I just -- you just--\" Keith stutters, uncertain. Lance doesn't even remember saying it. What if he didn't mean it? What if Keith brings it up and Lance assumes that Keith wants him to say it again? \nThey should never have done this. They're going to ruin the team before they've even gotten a good start at defeating the Galran empire. Keith and his stupid idiotic teenage feelings are going to single-handedly be responsible for the destruction of the universe. Fuck.\n\"Do you not like me anymore? Is that it? Because I need you to tell me that shit to my face, Keith. I'm not gonna be in half of a relationship just because you don't wanna man up and have a conversation with me.\" Lance's tone is firm but his voice wobbles slightly in the middle of his sentence, the only sign that he's really, truly upset. Keith's stomach drops, and he stands up immediately, ignoring the screaming pain in his legs to reach out and grab Lance by the shoulders. Lance doesn't pull away but he does turn his head slightly.\n\"I do like you, I promise, I'm not trying to end it,\" he says desperately, tugging gently when Lance won't meet his gaze. \"Lance, I swear.\"\n\"Okay, so what the fuck is going on, then?\" Lance looks back at him, and Keith sees up close the red rimmed eyes, the dark shadows under his lashes; he feels a pang of startled guilt. He hadn't known that Lance had been this upset; he hadn't even noticed that he hadn't been sleeping, or taking care of his skin the way he usually did, or crying. What kind of boyfriend didn't notice something like that?\n\"I...\" Keith says, opening and closing his mouth around words he still doesn't have. Lance just looks at him, disappointment clear in his eyes. Keith slumps, and then squares his shoulders. He just has to say something. He has to admit it. Lance deserves that much. \"Lance,\" he says, \"The other night--\"\nThe alarm goes off above them, flashing red lights and siren blaring. They both jolt, automatically shifting their hands to their sides to grab their bayards. \n\"Paladins!\" Allura's voice booms over the speakers, and Keith curses. Her tone has the severity of a real attack. \"We are under attack. Everyone to their lions, now!\"\nKeith looks at Lance, wants to grab him again and explain everything before they have to go their separate ways, but Lance backs away from him, an unhappy smile on his face. \n\"Great talk, hun,\" Lance says, sarcasm edging the words into something sharp. He's never sounded like that before, and Keith's heart sinks like a stone. \"Later, I guess.\"\nHe runs out of the room without looking back. Keith wants to drop to the ground and breathe for a minute or two, wants to smother himself in a pillow until he figures out what the fuck he should have done instead, but he doesn't have the luxury. He shakes his head to clear it and runs out after Lance, hoping that he'll be able to make it right after they deal with this.\n \n \nIt's a fucking mess. \n\"Allura, we're trapped out here, what's going on?\" Shiro's voice is steady but showing signs of strain, the only indication that their leader is getting frustrated with how little progress they're making. They're stuck inside a particle barrier around the battle cruiser that targeted them, similar to the one around Zarkon's main base, except this one is much smaller and has them basically pinned to the ship, which keeps spewing more fighter ships relentlessly. The worst part is, Pidge is stuck on the outside of the barrier, which means they can't form Voltron.\n\"We have no means of penetrating this barrier, Shiro,\" Allura says tightly; onscreen, her face is grim and pale, and the screen fizzles as the castle takes another hit. Pidge is hissing expletives over the comms, alone in defending the castle and clearly overwhelmed. \"You'll have to go inside the ship and take down the controls yourselves.\"\n\"Okay,\" Shiro says, after a beat of heavy silence. \"Lance, Keith, you're the fastest. Hunk and I will hold them off as long as we can; Lance, you make sure Keith gets in there.\"\n\"Got it,\" Lance says, steering Blue toward the cruiser immediately. Keith's heart surges and he rushes to follow him, weaving his way through the ships and beams of light that try to intercept them. There's a helpful beacon onscreen guiding their way to where the computer should be on the ship, probably courtesy of Coran. \n\"Behind you,\" Lance shouts, and Keith instinctively pulls Red down, avoiding the ship that had been sneaking up on him. \n\"Thanks,\" Keith says, blasting it to pieces as it spins past. Lance doesn't reply, but he keeps Blue trained at Keith's back, watching out for him. Keith grits his teeth against the ache that rises in him, aiming Red for the opening into the cruiser. He's gonna have to trust that Lance will watch Red while he goes in to try and find whatever's powering the barrier. \nHe slams the lion into the opening, barely even taking the time to pull it to a stop before he's out of his seat and hurling himself out of the mouth, pulling his bayard out in one swift movement. He thinks he hears Lance inhale sharply, but when he chances a glance out of the corner of his eyes, Blue is busy freezing ships that fly near them in place, placed protectively in front of Red.\nThere are droids guarding this area of the ship, thankfully, which means they're easy to take down. Keith slams his way through wave after wave, still tired from his training session but reveling in the feeling of destroying whatever's in his path. He glances at his wrist, where a hologram is steadily showing his progress toward the control panel that will shut down the barrier. He's almost there when a door slides open and about half a dozen Galra soldiers thunder into the hallway he's in.\nHe wants to stand and fight them, but he remembers all too well the last time they tried to take on a Galra soldier -- thankfully, none of them seem to have Sendak's enhancements, but they're all carrying long range weapons, which means Keith essentially can't fight them. He wishes fervently that Lance were here, because Lance is actually an ace shot, but then dismisses that immediately, because he definitely didn't want Lance here, in the middle of what was looking to be a suicide mission. \nHe ducks past the first shot, pushing through them -- they clearly don't expect him to run at them, so half of them are still facing the wrong way as he barrels past. He weaves his way through the hallways, trying to keep his eye on the beacon and edge his way closer. They pursue him, feet pounding behind him like a stampede, occasionally firing blindly at him. He's about thirty feet away from the chamber when he's struck in the back.\nIt feels like being stabbed with a hot poker, and he cries out before he can stop himself. His suit has blunted the impact somewhat, but he can feel the heat spreading like fire down the back of his shoulder blades.  He hurls himself into the room where the controls are and spins around, swinging his sword blindly at where the closing mechanism should be. He manages to hit it, but not before another shot goes off, slamming him directly in the chest. \nHe goes flying back as the doors shut, sprawling across the ground. In his ears, the comms are going crazy. He can hear Shiro shouting, asking what's going on, can hear Pidge's cursing climbing in pitch, can hear Hunk tentatively calling his name. But over that, he can hear a fervent, terrified Lance saying over and over again, \"No, no, no no no, Keith.\"\nHe struggles to pull himself up straight; there's blood seeping out around the hole in his suit, but he doesn't feel anything. He's vaguely surprised, but pushes it aside, turning so he can crawl toward the panel. His body collapses mid-turn, and he gasps for breath when the movement makes his wound gush slickly -- he's starting to realize that not being able to feel anything probably isn't good, but he can't focus on that. \n\"Keith, babe, come on, say something, please!\" He's never heard Lance sound like this before. It's like he's in pain himself, like he's being torn apart. Keith hates being the one to hurt Lance, but this time there's nothing he can do about it. He pushes himself up again, dragging himself hand over hand closer to the controls. There's a screen flashing with an image of the  barrier surrounding the ship. He debates briefly and then just uses his bayard to smash into the panel, holding himself up against the wall with a hand covered in blood. He can hear Allura confirm in a shaky voice that the particle barrier has fallen, and he slumps in relief. The Galra soliders outside are hammering on the door, but it seems to be holding for now.\n\"Get out of there, Keith,\" Shiro commands, and Keith huffs a weak laugh. He can't even lift his hand off the ground, much less fight his way back out through the swarms of soldiers and off the ship.\n\"Sorry, sir,\" he says. Lance makes a choked noise like it's being ripped from him, and Keith remembers their conversation before the attack, remembers all the things he hasn't said or done. Keith has never given much thought to whether he lives or dies; it's not like he has a death wish, but the idea of dying, especially dying saving something or someone he cares about, has never really frightened him. All pilots go into training knowing they could die. Keith accepted that a long time ago.\nBut Keith realizes now, with his customary poor timing, bleeding out on the floor of some spaceship a million miles away from home, that he really, really wants to live. He wants to spend time growing and learning with the other paladins, he wants to help save every colony and planet that's ever been taken over by the Galran empire, he wants to spend more time just flying around with Red, and he wants, more than anything else, to wake up each morning looking at Lance sleeping next to him. He wants to kiss him goodnight and bicker incessantly with him and curl up on the couch and just be with him. \nHe should have had this realization hours ago. Days ago. He should have savored every moment he got to be with Lance, but he'd spent his time panicking and worrying instead. He's such a fucking idiot.\n\"Lance,\" he says quietly. He can feel warmth at the corner of his mouth, seeping down his chin. Everyone on the comms goes completely silent, but he can hear them breathing. Lance's breath is loudest, like he's hyperventilating. Keith wants to tell him to be calm, that it's gonna be okay, but he doesn't want to lie. \"I'm so sorry, Lance. About -- this last week--\"\n\"Don't,\" Lance says, furious, \"Don't you fucking dare--\" \n\"I was scared,\" Keith continues over him, \"Because I realized how real it was, you know, between us.\" He pauses for breath -- in the silence, he can't hear the others anymore, which means they've separated the communications out, which makes him feel slightly better, because this is really just for Lance. \"And I wasn't sure -- I wasn't sure how I felt. You -- you know me.\" He coughs a little; there are black dots swimming in his vision. \"But you should know--\"\n\"Keith, if you fucking say it right now I'm gonna come in there and kill you myself.\" Lance's voice is shaking still, but there's a new edge of firmness to it. Keith realizes that he's running, which means he's out of his lion, which means he's on the ship. His heart pounds against his rib cage. \n\"Lance, what are you doing?\" he says weakly, trying to push himself up. He can't do more than get a few inches off the ground before his strength gives out, falling back to the floor. He clenches his hands against the sudden blinding horror of knowing that Lance is on the ship and being unable to do anything about it. \n\"Saving your stupid ass, idiot,\" Lance snarls. In the distance, Keith can hear shouts and sounds of gunfire, and the whole ship is rocked by an explosion. His vision whites outs completely, and he gasps out Lance's name one more time before everything goes dark.\n \n \nKeith wakes up.\nFor a moment, he struggles to remember why that feels important, and then he's falling down into something warm, something that smells vaguely of cinnamon. Lance. Lance's arms are around him, holding him up, clinging; everything comes flooding back at once, the ship, the barrier, being shot, Lance coming to rescue him. He stiffens in Lance's grasp.\n\"Are you okay?\" he asks, trying to pull away, running his hands down Lance's sides to see if he can feel anything. Logically, he knows Lance would have been in a healing pod if he had been seriously injured, but he can't keep himself from looking anyway. Lance feels unusually warm, especially because his own hands are so cold, but he seems to be fine. \nLance laughs incredulously, wildly, fingers tightening around him. \"Am I okay, he asks. Keith, you were just in a healing pod for five days. Five days.\" He lets Keith lean back a little so they can look at each other properly. Lance's eyes have huge dark circles underneath, worse than before, and he looks exhausted. The clothes he's wearing are wrinkled and stained and his hands shake a little when they cup Keith's face. \"You died, Keith,\" he whispers, sounding pained. \"When I was flying you back, your heart stopped. Coran didn't know if they could revive you when we put you in the pod.\"\nKeith closes his eyes and breathes evenly, reeling from that knowledge. They stand there silently for a while, gripping each other tightly, while Keith struggles to sort through everything. When he opens his eyes again, Lance is watching him warily. His eyes look wet, red-rimmed, and Keith reaches up to thumb over Lance's cheekbone. Something warm and soft is settling in his chest; he's alive. He's alive, and so is Lance. \n\"I'm fine, aein,\" he says, pressing his forehead to Lance's. \"Honestly. I promise.\" Lance makes a small hiccuping noise, like an aborted sob.\n\"I don't want to go through that again, Keith,\" Lance murmurs. His voice sounds like the aftermath of a car crash, wrecked and broken. \"Don't make me go through that again. I thought -- I thought my last memory of you was going to be us having some stupid fight.\" \nAt the reminder of the fight, Keith tenses again. Feeling him go still, Lance pulls back, shaking his head. \"I don't care what it was, Keith. I just want to move on--\"\n\"You told me you loved me,\" Keith blurts out. Lance goes pale and then flushes pink; despite the clear signs of exhaustion, he looks really, really cute, except for the part where he's starting to look a little terrified. Keith's heart is pounding in his chest, but he keeps talking. \"The other night, after we -- you were falling asleep and you said it, and I just -- panicked.\"\nLance breathes in and out, once, twice. He still looks dazed. \"So that's why you...\"\n\"Yeah,\" Keith says miserably. \"I just. I've never done this before, Lance. And I was confused, and I didn't want to hurt you.\" \nLance's hands slide down from Keith's face, dropping at his sides. He looks resigned. \"I understand. I didn't mean to pressure you or--\" \n\"I love you too,\" Keith tells him breathlessly. As soon as he says the words, he can feel how true they are; his mouth is slipping into a smile, his face is turning red, and he's embarrassed but he's also really, stupidly happy. Lance looks stunned, mouth dropping open. Keith kind of wants to laugh, can feel it bubbling in his throat. \"I really, really love you,\" he says again, \"And I just wanted you to--\"\nHe's cut off by Lance lunging forward and kissing him; he stumbles a little bit, but Lance grabs hold of him, pushing him back so that he's pressed up against the healing pod. Lance's mouth is soft and sweet on his; a hand comes up to angle his head a little, so that it turns deeper, wetter, and Keith makes a small noise in the back of his throat, pleased. Lance pulls back, chuckling a little bit, running a thumb over Keith's lower lip.\n\"Pidge is right,\" Lance murmurs. \"We're really gross. And cliché. I can't believe how cliché we are.\"\nKeith rolls his eyes. He can't seem to stop smiling. \"What, the whole 'confessing our feelings after a nearly fatal injury' thing? Doesn't the fact that we're saving the universe in giant robotic space cats make up for it?\"\n\"The giant robotic space cats are the most cliché thing of all,\" Lance says seriously. He cups Keith's face in his hands again, staring at him quietly, mouth crooked slightly in a half-smile. He looks like he's committing Keith's face to memory; neither of them say anything for a minute. \n\"Ew,\" someone says, and Keith looks over Lance's shoulder to see the others spilling into the room. It must be the middle of the night, because most of them are in pajamas, although Pidge, whose scrunched up nose indicates that they're the one who spoke, is still dressed normally. Pidge looks just as messy and tired as Lance, with wild hair and sleepy eyes, although the rest of the team are showing signs of weariness too. Keith feels a flood of warmth, incredibly grateful to be here with all of these people he cares about so much, unsure that he deserves for them to care so much about him. \"Good to see you awake, Keith,\" Pidge continues. \"Glad Lance let the rest of us know.\" Lance flips Pidge off without bothering to turn around, still holding onto Keith's face with one hand. Keith quirks a smile at Pidge. They smile tiredly back, rubbing at their eye with the heel of their palm, waving their other hand absently hello. \n\"Lance,\" Keith whispers, \"We should go go talk to them.\" \nLance sighs. \"If you say so, sweetheart. Oh, hey, that reminds me.\" He suddenly looks mischievous, and Keith has to swallow back a groan. \"What did you call me earlier? Ai--something?\"\nKeith flushes; he hadn't been aware that he'd done that, but he remembers calling Lance aein now. It's something he vaguely remembers hearing his mother call his father when he was very small. \"It's, um. Aein. It's a -- a term of endearment. In Korean. Kind of like sweetheart.\" \nLance smirks, and Keith can pretty much bet on a solid week of teasing, but the tips of Lance's ears a little bit red, and he seems pleased underneath the coy look. \"Aww, babe, that's so cute.\" Keith automatically jabs his elbow into Lance's side, flustered, and then rolls his eyes when Lance yelps dramatically.\n\"Let go of him, Lance,\" Pidge yells, stomping their foot. \"We all wanna hug him, get to the back of the line.\" Lance finally lets him go and turns around; Keith is amused to find that they actually have formed a line -- Pidge is in front, followed by Hunk and then Shiro and then Allura and Coran. \n\"Boyfriends get special access,\" Lance says, taking Keith's hand and helping him down the steps from the pod. Keith tightens his fingers around Lance's as they make their way over to their friends. Shiro is smiling softly at Keith, and Hunk looks a little teary-eyed. \"We're in love, I can do what I want.\" \n\"That's not how that works,\" Keith tells him, but Lance just beams at him and taps his nose. Well, he reminds himself, Lance knows more about this relationship stuff than he does. He threads his fingers through Lance's, smiling as his friends sleepily bicker and laugh with each other. Keith glances sideways at his boyfriend, who is gesturing wildly with his free hand as he talks, beautiful despite the tired eyes and the messy hair. He trusts Lance, he thinks, with everything, including his heart. \nHe'll just have to keep following his lead. "
}