{
    "id": "7769080",
    "url": "https://archiveofourown.org/works/7769080?view_full_work=true",
    "author": [
        "MayMarlow"
    ],
    "title": "Don't Fuck With Florists (They'll Fuck You Up)",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Harry Potter - J. K. Rowling"
    ],
    "relationships": [
        "Harry Potter/Tom Riddle"
    ],
    "characters": [
        "Tom Riddle",
        "Harry Potter",
        "Mr Borgin (Harry Potter)"
    ],
    "additional_tags": [
        "Time Travel",
        "flower shop",
        "MoD!Harry",
        "1940s",
        "Don't copy to another site"
    ],
    "language": "English",
    "series": "",
    "published": "2016-08-14",
    "completed": null,
    "words": "13,944",
    "chapters": "1/1",
    "comments": "862",
    "kudos": "32,617",
    "bookmarks": "7,466",
    "hits": "290,908",
    "summary": "<p>Unsatisfied with his post-war life, Harry decides to get to the root of all of his problems when that root was still working at Borgin and Burkes shop in the late 40s. He’s the Master of Death, damn it, he can do what he wants for once in his life.</p>\n<p>Tom Riddle isn’t particularly happy about working at a small, dingy shop for magical artifacts, no matter how interesting those artifacts are. He’s even less happy when an insufferable stranger sets up the most obnoxious flower shop right across the street.</p>\n<p>What follows would be a romantic comedy, if it weren’t for politics.</p>",
    "notes": "<p>This fic is my contribution to the Tomarry Big Bang 2016. The artwork is by <a href=\"https://archiveofourown.org/users/You_Light_The_Sky/profile\" rel=\"nofollow\">You_Light_The_Sky</a>, and more art by her will be posted <a href=\"https://youlighttheskyart.tumblr.com/post/148941921759/here-is-the-title-page-i-worked-on-for-maymarlows\" rel=\"nofollow\">here</a>!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
    "text": "There was someone digging through his trash.\nTo be more specific: there was a man in front of Harry’s house. He was holding a camera in one hand while quietly trying to dig through the rubbish bin in front of the house with the other. Harry couldn’t for the life of him remember the man’s name, but recognized him from one of the numerous press conferences he had been forced to attend. And he had been forced to attend quite a few ever since Voldemort’s downfall and the end of the war.\nHarry… didn’t like it.\nHe didn’t like the press conferences, the attention or the journalists hounding him. He downright hated the articles posted about him going out to buy groceries, the speculations about his relationship status or how much money he had or even the silly articles about people somehow reading his current life situation from the state of his hair – which was ridiculous! He washed his hair almost every day, why would he need to brush it that often too?\nHarry had wards preventing people from entering his house unless specifically invited, but apparently being a sought-after celebrity wasn’t enough reason to warrant a Fidelius Charm to prevent people from finding him in the first place. According to some it was getting special privileges, or something.\nWhich, well. Thanks, Hermione.\nThe man digging through the trash suddenly froze, and looked up from what he was doing. He glanced towards the front door to confirm that it was still closed, and tried to see if there was anyone watching him from inside. Harry’s windows, charmed to allow people to look out but not in, appeared dark and empty. It was a bit... scary, really.\nSo focused the man was on the seemingly empty windows that he didn’t notice the slight movement behind him. From the darkness there, a tall skeletal figure emerged. The thing, not affected by mortal magic, cast an accusatory look to where it could see Harry standing.\nHarry gave a tight-lipped smile and gestured for the thing to continue its task. It did. Unhappily.\nThe journalist took a step back from the trash, unable to shrug off the feeling of being watched. He could’ve sworn that the night hadn’t been this dark mere moments ago, and Merlin – how uninteresting was Potter’s trash? There was nothing worth writing about!\nShaking his head in disappointment, the journalist turned, only to come face to face with something he had never seen in his life. Something terrifying. It wasn’t a Dementor, but blessed Circe did it look like one!\n“No,” the man whimpered, taking a step back and nearly dropping his camera.\n“Hey,” the thing said, its voice deep and gravelly. It got no further than that, however, before, in a bout of courage, the journalist gathered his wits, ducked to the side and ran. His camera, by some miracle, was still held tightly in his hands.\nA moment of silence reigned, before the thing turned to where Harry was still standing. It squared its bony shoulders and floated in through the door.\n“You have to stop making me do this,” it said. “I am Death. This is undignified.”\n“It’s a change of pace for you,” Harry replied. ”Consider it a growing experience. A warning for future generations: don’t force the position of Master of Death upon people who do not want it, because you never know what they’ll do with it.”\n”I didn’t force it on you,” Death said. ”I never told you to collect the Deathly Hallows. You did that on your own.”\n”I couldn’t not do it, you know,” Harry said, thinking of his last two years at Hogwarts. ”Either way, you said I can’t hand over the position to someone else, and so we’re stuck together. Much to our shared delight.”\n”I object,” Death said, gliding across the room to stare at Harry from a much closer distance. ”Something must be done. I have too much work to do to waste time scaring off the pests giving you trouble.”\n”My problems come in many shapes and forms,” Harry sighed, not particularly happy about this situation either. ”Not much I can do about it, really.”\n”What if you could?” Death suddenly said, a small blue fire burning bright in its otherwise hollow eyes. ”Most of the woes in your life - the people, the hounding, the attention... your childhood, all the battles... every single wound you have... There is one thing they all share in common.”\n”I don’t like how pleased you sound about it,” Harry said. ”But tell me the details anyway.”\n”The deceased one,” Death continued. ”Tom Riddle. He is the true source of every trouble you’ve gone through.”\n”I’m not arguing against you, but he is, as you said, deceased,” Harry said, unsure of where this was going, but curious to hear the rest of it. ”I made it happen, if you recall.”\n”Your friends are settling down, aren’t they,” Death suddenly said, sounding far too satisfied for Harry to feel comfortable. ”Steady jobs, children, routines. You, on the other hand...”\n”I’m aware of my own situation,” Harry muttered, reluctant to acknowledge the flash of hurt he felt about the matter. ”How does that have anything to do with Voldemort and my problems?”\n”There’s nothing holding you back here,” Death said. ”There’s nothing stopping you from dealing with your problem directly. I need time to do my job, you need something to do in order to leave me alone, Tom Riddle needs to be stopped before he even began—”\n”Oh,” Harry said. ”Oh no.”\nHe bit his lip, considering the situation and his options. How on earth could he leave Ron and Hermione behind like this? Sure, he hadn’t seen them in two weeks – not after Hermione had shot down his suggestion of additional wards to his home – and it wasn’t as if they needed him around. He didn’t yet have a job although he had numerous options to choose from. He had friends. He had a life. It wasn’t perfect, but it was safe and familiar. Leaving it all behind would be an irresponsible thing to do.\n”What a horrible suggestion,” Harry muttered. What would be the consequences of him going back, anyway? Would history just rewrite itself? What would he even do there? Besides - when exactly would he be going to? What could he do about Tom Riddle of all people? Harry shook his head, and turned to Death. He stood still for a few moments, before nodding his head slowly. He had often come face to face with mistakes, but none of them were quite as interesting as this.\n”Let’s do it,” Harry said. ”I’m in. Let’s go.”\n*\n\n\n\n\n1946\n\n”Well now I’ve bloody well seen the worst of it,” Borgin sneered, peering out through one of his shop’s front windows. ”Look at that! This is ridiculous!”\nKnockturn Alley was known for being a rather... risky place to be at. Even its business streets with shops and stores of all kinds were often viewed with alarm and suspicion - and not entirely for no reason, either. Dark Arts were discussed in these parts far more frequently than elsewhere, and although Theobet Borgin maintained that his shop simply offered confidential valuation services for unusual and ancient wizarding artefacts, it wasn’t uncommon to engage in some trading alongside the consultation.\nBorgin liked the street his shop was located at. A narrow alleyway with a questionable law office to his left, an abandoned office space across the street and nothing but a gaggle of begging hags roaming the streets and scaring away the people who had no business in Knockturn Alley anyway. That was how everything had been up until now. In fact, for the past year business had been even better, what with young Riddle - a clever snake with remarkable friends - coming to work for him.\nNow, however, something had changed.\n”Whoever that bloody lunatic is, he better pack up and leave fast,” Borgin said. ”Disgusting!”\nRight there across the street - where previously there had been a perfectly gloomy abandoned office space - was now a flower shop. And what a flower shop it was! The broken windows were now fixed and sparkling clean, allowing anyone to see the wealth of colours inside. There were flowers and plants of all colours and sizes - most of them were inside the shop, but some were positioned outside in the most obnoxious way imaginable.\nBy the door there were two skeletons wearing orange aprons, one holding a bouquet and wearing a wreath and the other holding up a sloppily written ”Welcome!” sign.\n”Tom!” Borgin yelled, and the young man in question looked up from the accounts he had been going through. Dressed in a set of robes far too proper for a place such as this, with his hair combed neatly to the side and a pleasant smile on his handsome face, Tom Riddle would have fit right in with the folk working at the ministry. Why he chose to work at Borgin and Burkes, Borgin didn’t know. He didn’t particularly care, either.\n”Yes?” said Riddle, and the older wizard knew better than to mistake the pleasant tone for respectful.\n”Do you see that?” Borgin asked, pointing at the flower shop. ”Tell me, do you see it?”\n”It’s hard to miss,” Riddle replied, not quite sure what to think of the appearance of the flower shop across the street.\n”I want you to go there – yes, right now – and convince whoever the owner is to move somewhere else,” Borgin said. ”I don’t care how you do it. Bribe, threaten - I don’t care. Just get them out and away. This is appalling!”\nTom nodded, though he wasn’t sure if he quite agreed. A flower shop across the street could be anything from a sad attempt at entrepreneurship to a scheme hatched by aurors to snoop around. Either way, it wasn’t the kind of a problem that they needed to worry about. Despite this, however, he was quite eager to step outside the stuffy shop for a moment and breathe a bit of fresh air. If doing so came with the price of convincing some bright-eyed florist to move somewhere else... well, Tom was fine with that.\nCrossing the street, Tom noticed a few hags that usually patrolled the area eyeing the flowers on display with varying degrees of confusion. There was no way the shop owner hadn’t seen them while setting up the display outside. Why would they still go through with this move?\nInside, the flower shop was bright and clean. The place smelled great, the floor was polished and the whole place was far too pleasant to fit into Knockturn Alley. If the owner of this place had planned on fitting in, they had obviously failed.\n”Can I help you?” someone said, and Tom turned to see a man - around his age, if not a little bit younger - wearing what was without a doubt a muggle attire consisting of grey trousers and a dark blue blouse, with an orange apron thrown on top of it all. The man’s eyes were unusually green, and his black hair was in a mess that made Tom’s blood itch with anxiety - couldn’t he have brushed it, at least?\n”I’m looking for the owner,” Tom said, plastering on his face a polite smile. ”I’m Tom Riddle. I work across the street.”\n”Oh, Merlin,” the man muttered with a heavy sigh. His hands were muddy and he didn’t bother to wipe them before reaching out to shake Tom’s hand. ”I’m the owner. Name’s Harry.”\n”I see,” Tom managed to say, casting a cleaning charm on his hand the moment Harry let go of him. Honestly, what kind of a name was Harry, anyway? ”Pleased to meet you.”\n”Here to buy some flowers?” Harry said, continuing his way to the sink behind the counter, and couldn’t he have washed his hands before reaching out to Tom? ”Something to cheer up a gloomy day in this lovely part of town?”\n”Not exactly, no,” Tom said, his blue eyes narrowing with feigned amusement. ”As I said, I’m from the store across the street, and I couldn’t help but notice a newcomer in the neighbourhood. This is an unusual place for a flower shop, and it made me curious… so I decided to stop by and welcome you to the area.”\n”Oh,” Harry said, smiling cheerfully. ”That’s good. I mean, I thought for a moment that you had come here to feed me some story about this place not being the right one for my business. I’m glad that’s not the case.”\n”Right,” Tom said, after a heartbeat of silence. ”That... that is not the case at all. It’s good to have you here, Harry.”\nLess than five minutes later Borgin looked at Tom as he returned, and knew immediately that something had gone wrong. ”The, uh, eviction didn’t go as planned, I suspect?” Borgin said carefully. ”It’s all right, I suppose. The shop is bound to close down when no customers appear. In fact, in a matter of a few weeks of no customers I am certain that the owner will be more agreeable to the concept of relocating.”\n”There’s no need to wait that long,” Tom said, the tone of his voice calm and collected while the look in his eyes spoke of curses twice as cutting as the sharp smile on his face. ”Don’t worry. I’ll take care of it.”\n*\nPlaying dumb while lying straight to someone’s face was a form of entertainment Harry had rarely indulged in before. Seeing young Voldemort’s face twitch in barely controlled anger made Harry think of all the other ways he could be a nuisance to the man.\n“You keep staring across the fucking street,” said a zinnia from a small pot on the counter. “Is there something I should know about, son?”\n“Normal flowers don’t speak,” Harry murmured, still staring through the window at Borgin and Burke’s. “Not that I mind.”\n“Well, I’m not a fucking normal flower, now am I?” the zinnia snapped back. “I’m a reaper!”\n”Can you really call yourself that when you’re not, you know, reaping anything?” Harry asked. ”Death gave you strict instructions to stay here with me. And I recall something about being quiet, too.”\n”If I had known I’d end up becoming this... weed with a red face and leaves for arms, I’d have declined the fucking honour of receiving a solo mission,” the zinnia said, twisting to look at Harry with a pair of invisible eyes. ”You and I are stuck together from now on, pal, so you’re better off just telling me all about this boy you kept eyeing up earlier.”\n”I wasn’t eyeing him,” Harry said. ”He’s the enemy. We’re here for the sole purpose of making life a little less comfortable for him.”\n”Really,” the zinnia said sceptically. ”Death said that you have unresolved issues that you should be projecting at the rightful target rather than innocent bystanders.”\n”That man is the rightful target,” Harry assured the flower. ”Besides, you needn’t worry about him. He doesn’t deserve it. Not to mention that I doubt he’ll be coming back here anytime soon. I’ll probably have to visit him to establish contact again, and you won’t be bothered by our… conversation.”\n”I have a strong feeling inside of me,” the zinnia spat angrily. ”I feel that you’re wrong.”\n”I’m not,” Harry said.\nHe was. Of course he was.\nA day later, around lunchtime, Harry was drinking a cup of tea while reading the newspaper - to think that he could read the news about Grindelwald’s defeat like this, fresh off the press, rather than through history books and archived newspapers! - when Tom Riddle stepped back into his shop. Tall, well-dressed and handsome, Riddle was clearly the kind of a man who knew exactly how good he looked.\nHarry sighed.\n”That’s not the kind of a sigh you were going for,” the zinnia whispered furiously. ”You said he’s the enemy! Remember? Be frustrated! Not smitten!”\n”Harry,” Riddle said, and Merlin, it was very different from the times Voldemort had used his first name. ”I came by again - I hope you don’t mind - to discuss your relocation plans.”\n”I have no such plans,” Harry said. ”Would you like to buy a flower? Roses are popular these days.” Harry quite honestly didn’t know whether they were popular or not, but it wasn’t as if Riddle would know that either.\n”No,” Riddle replied. ”No thank y-- is that today’s paper?”\n”Yes,” Harry said, skimming through the last few lines of the article. ”They’ve written quite a bit about Grindelwald, and the man who defeated him.”\n”Dumbledore,” Riddle said, his voice carefully neutral. ”Who knew he’d manage such a feat.”\n”I don’t know the man, but isn’t it great?” Harry said cheerfully, leaning closer to Riddle with a bright smile on his face. ”Who wants a Dark Lord running around, anyway? Can’t Grindelwald tell how much of a hassle that would be?”\n”Why on earth would it be a hassle in his eyes,” Riddle asked. ”He’d rule the entire wizarding world! There are bound to be strong wizards wanting that.”\n”Yes, sure,” Harry agreed. ”But it’s not just a matter of being strong, right? Running a government is exhausting. Can you imagine having to keep track of every single governmental aspect and negotiations and decisions.... not to mention that Dark Lords tend to rise to power through very illegal means. They’ll have enemies trying to get in their way at every turn. Outlaws and organizations working to bring him, uh, them down.”\n”I’m sure he was prepared for such things,” Riddle said, sounding wholeheartedly unimpressed with Harry and Harry’s opinions. ”Not that it matters now, anymore.”\n‘You could just let this conversation go,’ Harry thought, though his thoughts sounded a lot like Hermione. ‘You can be a bit overwhelming when you bury your dates under your opinions sometimes, Harry. I know you’re passionate… but maybe build up to it? Wait until the third date at least?’\nIt was sound advice, but this wasn’t a date, and so Harry continued:\n”But how can he truly be prepared to lead a country - even more than one considering his area of, uh, operation - without having ever been in a position of governmental leadership?” Harry asked. ”Why couldn’t he just become the Minister of Magic of his country - I’m sure they have that position, or at least something like it? If he could rally up supporters to overthrow an existing government, he could have made them vote him into power!”\n”It’s not that simple,” Riddle said, rolling his eyes.\n”And becoming a Dark Lord is?” Harry shot back instantly. ”Being a ruler and leading wars and changing laws may sound appealing to some, but could Grindelwald actually sit down and discuss issues such as education and employment and taxes and who knows what else? Could you?”\n”You don’t… understand - sometimes the entire system needs an overhaul, and doing it by getting elected and having to appease politicians who actively work against you is a serious hindrance.”\n”Then at least try being the minister for a year or two to get a proper idea of what ruling is like! What if you hate it? Are you interested in discussing funding for agriculture or the breeding restrictions for kneazels threatening to overpopulate Wales?”\n”You know what, yes, I would be interested,” Tom replied, and he wasn’t even lying. ”Besides, it’s not as if the minister of magic would be running the government alone. He’ll delegate tasks to competent people. That’s how it is.”\n”Ideally, sure,” Harry said, rolling his eyes. ”But who actually does that? The previous minister - Fawley - was quite the disaster in the office. Now that’s a man who shouldn’t have been anywhere near that position to begin with. Imagine if he had decided to become a Dark Lord instead?”\n”That’s not a sound comparison at all,” Tom said dismissively. ”Fawley was forced out of office and suffered for his incompetence. Now we have Minister Spencer-Moon and he’s known for his excellence and is likely to win the upcoming elections again.”\n”He is very well respected and liked,” Harry agreed. ”Except by the purebloods who still keep bringing up how he started out as a tea-boy in the Department of Magical Accidents and Catastrophes. Either way, we digress. The point isn’t how good or bad someone is as a minister, but rather that aspiring Dark Lords should perhaps try their hand at less destructive methods of gaining power.”\n”I don’t think that we will be reaching a point of agreement on this subject anytime soon,” Tom said stiffly, taking a step back. Somehow, despite their conversation and everything that Harry knew of the man, the smile on Tom’s face was almost lovely. Merlin’s balls, Harry was not used to dealing with attractive people. ”I wouldn’t wish to waste your time more than I already have. Good day.”\n”Visit again!” Harry yelled after him cheerfully. Circe, he should have known that Voldemort would be such a huffy person. ”Off he goes.”\n”I don’t like him,” the zinnia on the counter said darkly. ”I hope he dies in his sleep. After a nightmare.\"\n*\n”With the amount of time you’re spending here, I’m beginning to feel bad for Mr. Borgin,” Harry mused aloud while treating a sick dandelion with some ointment. The poor thing was wilting fast, presumably of a broken heart.\n”Don’t,” Riddle replied. ”I do more in an hour than that man does in a week.”\n”Cute of you,” Harry said, smiling when Riddle shot him a glare. ”Did you read the paper this morning? Grindelwald’s trial date has been set. Although I’m not quite sure why he’s going to be tried here, and not in Germany where he’s actually from and where he did most of his, uh, work.”\n”Likely because of Dumbledore,” Riddle said. ”Perhaps they think that he’s the only one capable of handling him—”\n”But that doesn’t make any sense either,” Harry protested. ”They could’ve just invited Dumbledore to the trial in Germany. He wouldn’t have refused. And if they’re that worried about their capabilities of keeping Grindelwald contained, how have they been able to jail him so far? He’s been in custody for months!”\n”If Dumbledore’s the one who asked for Grindelwald to be tried here, the German Ministry of Magic could hardly refuse,” Riddle said. ”Considering that Dumbledore is the one who defeated him.”\n”That would explain the date, I suppose,” Harry acknowledged. ”The first of August. Well before the school year starts at Hogwarts.”\n”Indeed,” Tom muttered, frowning a bit. ”I wonder how many people will manage to attend it - it’ll be quite the event, I expect.”\n”Well, it’s not every day that a Dark Lord gets sentenced to life imprisonment.”\n”Life impri— Surely he’ll be sentenced to death! Who in their right mind would allow such a risk to live?”\n”I really doubt that he’ll be executed,” Harry said. ”Despite the Ministry’s numerous shortcomings, I do believe they’re trying very hard to maintain a strict no-execution rule. Minister Spencer-Moon would never let it happen.”\n”Perhaps he should,” Riddle replied right away. ”Allowing Grindelwald to live brings up plenty of unnecessary expenses. The Wizengamot will surely push for the death penalty. Besides if Spencer-Moon is aiming to win the re-election, he can’t be seen as soft.”\n”I’m not saying that a Dark Lord doesn’t deserve the death penalty,” Harry said pleasantly. Because, honestly, he’s been there and done that. ”After all, killing so many people and doing so much harm to the society... it does deserve a severe punishment, doesn’t it? However I doubt that that will be the sentence Grindelwald will be receiving in the end.”\n”I can only wonder about your confidence regarding his sentencing,” Riddle said, then waved his hand dismissively when he saw Harry about to say something. ”Don’t bother. I hardly care. What I am interested in knowing more about is whether or not you’ll be going to watch the event.”\n”Who knows, really,” Harry sighed. ”I’m really not in the mood for Dark Lords.”\n”Met a lot of those, have you?” Riddle said dryly.\n”Oh, sure,” Harry replied. ”Egomaniacs, the lot of them. Obsessed with immortality and revenge and taking over societies without any solid ideas of how to run their new governments – honestly, it’s a mess of mismanagement. Dark Lords are overrated.”\n”That’s a rather narrow-minded opinion, isn’t it,” Riddle said, his voice strained. “Immortality? Revenge? Where did you get those from?”\n”Do you disagree?” Harry asked, his voice light. ”Perhaps you’re interested in becoming a Dark Lord yourself?”\n”Hardly,” Riddle replied immediately. ”However what I am, is a man of logic. Your sweeping generalisations of what Dark Lords are like are inaccurate and not at all beneficial. Do you even know what Grindelwald aimed to do? I, for one, haven’t heard a thing about wishes for immortality and revenge.”\n”I must have confused him with another Dark Lord, then,” Harry said with a shrug. ”Are you planning on going to watch the sentencing?”\n”Yes,” Riddle said. ”Come with me. Perhaps if you actually listen to his list of crimes, you’ll see that becoming a Dark Lord is quite different from becoming a Minister of Magic.”\n”But did he become a Dark Lord in order to commit those crimes,” Harry said, ”or did he commit those crimes in order to become a Dark Lord? There’s a big difference, you know, and if he became a Dark Lord in order to gain power, he’d be able to gain that power even as a Minister of Magic. In fact, there’s not much an intelligent and a powerful wizard wouldn’t be able to do in that position. Those German wizards, you know. He’s a Durmstrang graduate. If anyone can do it, it’d be him. He’s handsome, too. Now imagine if a Dark Lord came out of Hogwarts. That’d be hilarious.”\nRiddle stared at him for a few long moments, before he took a deep breath and pushed himself away from the counter.\n”Since you’re showing no signs of moving to better areas for selling flowers, I trust you’ll be here a week from now on?” Riddle said. ”I’ll pick you up from here and we’ll go watch the sentencing together. I’m sure it’ll be very informative for you.”\n”Sure,” Harry said. ”Don’t wait a week before you visit me again, though. I’ll grow lonely.”\n”If you had more clients, which you would have in Diagon Alley,” Riddle said, heading towards the door, ”you’d be too busy to miss me there.”\n”You might just underestimate your impact, Mr. Riddle,” Harry yelled, just as the door swung shut. He then sighed, and shook his head. ”And going by how frequently you visit me, you’d miss me too.”\nIn all honesty, Harry wasn’t entirely sure as to why Riddle kept coming back. His attempts at convincing Harry to leave for Diagon Alley or another, allegedly better, place for business were half-hearted at best. Something, however, kept bringing him back. Whatever that thing was, Harry hoped it’d continue attracting Riddle back to the store - the man was interesting company, in spite of, well, who he was.\nIf nothing else, he was at least a better conversationalist than a zinnia with anger issues.\n*\n\n1st of August\n\n”I still don’t understand why this couldn’t be done in Germany,” Harry muttered as he pushed through the gathered crowds, Riddle leading the way right in front of him. ”Are you sure we can just muscle our way to the front like this?”\n”Not if you’re alone, no,” Riddle replied, pulling Harry closer as they kept moving. ”But I happen to have friends in high places. Certainly in places high enough to get us seats, rather than leave us standing among all these people for hours to come. All we need to do is get to the front, find a— you know what? Just follow me.”\nAs odd as it was to voluntarily follow Voldemort’s orders, Harry agreed to do so. In perhaps half an hour they were both seated at a booth high enough for Harry to be able to see the platform clearly without having to stand up. Grindelwald was nowhere to be seen yet, but Dumbledore was easy to recognize.\n”These are quite the seats you got us,” Harry said. Riddle shrugged with a smug look on his face.\n”Naturally,” was all he said, before a sudden rise in the noise around them made Harry look back down at the stage. A man, standing tall and proud despite the shackles on his wrists and ankles, was being led by a team of aurors to some sort of a public holding cell. The air around the thing rippled, indicating the presence of a protective shield, intended to prevent any vengeful viewers from cursing the prisoner.\n”That’s him,” Riddle murmured, leaning closer. ”Gellert Grindelwald. The greatest Dark Lord ever, according to history writers.”\n”Of course they’d call him that,” Harry replied, thinking of the devastation Voldemort had left behind. ”They have to sell their books somehow. If dramatic declarations are the way to do it, then hey, why not?”\n”You’re really not impressed by his... actions as a Dark Lord, are you?” Riddle asked, turning to look at Harry with a contemplative expression. ”Look at the people around us. Look at the judge, for Merlin’s sake. Even the jury are shaking under their ridiculous hats.”\n”Of course he’s fearsome,” Harry admitted, strangely enough sounding as if he didn’t consider Grindelwald fearsome at all. ”But what finesse does being a Dark Lord require? It’s such blunt, rough business. Brutal. You kill hundreds, if not thousands, of the people you could have ruled. You blow up a couple of places, stage a hostile takeover at a ministry or two, win everything at a wandpoint - and that’s actually the easiest part, so far! He failed at taking over the societies he tried to enslave, and is now going to lose his freedom for it. If you lose a political race, you can always try again.”\n”You’ve really thought about this, haven’t you?” Riddle said, shaking his head before turning back to look at the events unfolding below. ”You consider leading a revolution the easy part? What then, in your opinion, is the hard part?”\n”Maintaining order,” Harry replied instantly. ”Convincing the thousands of people who hate him for his actions to see him as a legitimate ruler without losing them and ending up a king to a wasteland. Well, in his case that is not going to happen anymore. They could have sentenced him in Germany. Or even here, but privately. They could have declared his sentence after all the evidence had been reviewed and the trials were over. But no, instead we get this... spectacle. This show. His crimes are listed to an enormous audience to make sure we’re properly offended and shocked, and then his sentence will be read aloud. Ridiculous.”\n”Well, as you said, it’s all over for him now,” Riddle said. ”Consider this his last show. No need to worry about Dark Lords after this, right?”\n”I doubt it,” Harry said, leaning suddenly closer to Riddle, who could smell the scent of flowers on him now. It was slightly distracting in ways Riddle wasn’t sure how to deal with. ”Dark Lords come and go. I guarantee you that unless Britain’s next minister is someone who’s capable of being an actual ruler, we’ll be stuck with another delusional, illogical and reckless wizard aiming to become a Dark Lord.”\n”That’s quite the prediction,” Riddle murmured, with a new kind of tension in his demeanour. ”Oh, look, they’re done with his crimes now. Let’s see about that sentence.”\nHarry focused on the judge who, for some reason, kept glancing at Dumbledore as he was about to reveal the sentence. Harry sighed, relaxing enough to lean more against Riddle, who didn’t seem to either care or notice. He hadn’t intended on trying to make becoming a Dark Lord sound unappealing to Riddle - he wasn’t here for that. But... well, his own reality was already part of a different universe, so why couldn’t he try and make things better for the future of this world?\n’Then again, Riddle as the Minister of Magic,’ Harry thought, shuddering. ’Merlin knows how that would end up.’\n”Look at that, you were right,” Riddle said suddenly. ”Life sentence in Nurmengard. Idiots.”\n”Dumbledore is a fan of mercy and second chances,” Harry said, straightening up in his seat. ”He wouldn’t allow Grindelwald to be killed.”\n”Second chances shouldn’t matter in a scenario involving big risks like him,” Riddle hissed, clearly annoyed. ”He’s a loose end.”\n”You know, it doesn’t matter what you think,” Harry said, patting Riddle’s cheek in a condescending manner. ”After all you’re not a law-maker. You’re not part of the ministry. If you were the minister himself, well, you could change things. But as you are now... get used to complaining, dear.”\n”Why would I want to become the minister?” Riddle scoffed. ”The campaigns that I’d have to run. The speeches. Putting up with the pompous idiots who believe their ignorant ideas to be worth something... Who’d want to voluntarily subject themselves to that?”\n”Whether or not you want to is up to you, of course,” Harry said. ”I’m quite sure, however, that if you put your mind into it... you could.”\n”Such confidence,” Riddle said, shaking his head. ”Come on, the ordeal is over. Lunch? At Diagon Alley, of course.”\n”Would be great,” Harry agreed. ”And don’t try to lead me past available spaces for shops. I’m not moving from Knockturn Alley.”\n*\nAt this point in life, Harry didn’t regret many things.\nOne of the things he did regret, however, was thinking that Tom Riddle could ever be a likable person.\nIt was well into August, and there were plenty of shoppers heading to the area for various purposes. Even Harry’s little flower shop had gained unexpected popularity, for some reason among hags in particular. He didn’t question it, of course - simply did his business with a pleasant smile and a cheerful suggestion to come back soon.\nOn that particular day, for some odd reason, Harry’s first client didn’t step into the store until noon. Harry, who had been working at the backroom, greeted the unkempt looking man with a bright smile.\n”Hello! Are you looking for anything specific?”\n”Just something nice for my wife,” the man replied, taking off his hat and scratching his head. ”That poor fool, the past few years were quite tough on her.”\n”Indeed,” Harry said with a sigh. He knew the stress a war could have on people, even if they weren’t fighting in the front lines. Especially if the woman had any children in the army. ”Quite rough on most of us, I believe, but parents especially. Have you got a particular flower in mind?”\n”Nah, not really,” the man said. ”Something pink, I suppose, she likes that colour. I hadn’t planned on even getting a flower, you see.” He then gestured towards the window. “But the crowd outside caught my attention, and I saw your shop and thought – hey, what the hell. Might as well cheer her up, you know?”\n”Crowd?” Harry murmured, and turned to take a look from the window. He was surprised to see people swarming outside Borgin and Burkes, lining up to enter the place and blocking the way to Harry’s shop while doing so. No wonder there were no clients coming in! What on earth was going on?\nDoing his best to refocus on finding the perfect flower for his customer, Harry tried to ignore the commotion going on outside, and push his curiosity aside. This couldn’t be a coincidence – somehow, he wasn’t yet sure how, this must have been Riddle’s move. Why, though? Sure, he wanted Harry away from Knockturn Alley, but why increase his efforts now? Harry had thought that they had begun to actually, perhaps, get along to some degree. Why would he want Harry to leave, anyway? He had no reasons to be suspicious or wary of him!\n’Figures,’ Harry thought bitterly. ’Can’t trust a man with a pretty face like that. It’s Voldemort, for Merlin’s sake.’\nDone with his client, Harry stood behind the counter and began taking care of the injured leaves of a rare Amazighian cactus from the desert of Libya. The number of people walking in and out of Borgin and Burkes didn’t’ seem to decrease as the day went on, preventing Harry’s clients for coming in at all. It was frustrating, and it had to stop. Harry couldn’t waste his entire day waiting for a miracle to happen - he had to go and do something, clearly.\n”Hoe don’t do it,” the zinnia on the counter croaked. ”Don’t pick fights with neighbours. Even us reapers know that.”\n”I’m not picking a fight with my neighbour,” Harry replied. ”I’m merely... going to investigate as to why my neighbour is picking a fight with me.”\n”This doesn’t sound good at all,” the zinnia protested. ”Listen, I know he’s—oh, what the hell. Fine. Go kill him.”\nThough he closed early, Harry waited until the afternoon to cross the street and enter the dark and dingy store, only to see most shelves empty and Riddle standing by the cash register with an annoyingly self-satisfied air about him. When he saw Harry walking towards him, the man smiled.\nFuck. He had dimples.\nFuck.\n”Didn’t expect to see you here,” Riddle said. ”Anything I can help you with?”\n”Not really, no,” Harry replied. ”Couldn’t help but notice the sudden popularity of your shop. Are you selling something new or did you bother advertising somewhere?”\n”Neither,” Riddle replied. ”We’ve got a sale going on. The storage is overflowing and it was a good time to clear up the shelves for new items.”\n”Lovely,” Harry murmured, narrowing his eyes at the man. ”I’m sure your clients are happy.”\n”Oh, they are,” Riddle assured him, before moving to stand next to Harry, and then leading him further into the shop with a hand pressed against the small of his back. ”Could I interest you in any of our items? This decorative crystal drop, for example. As you can see, a human fetus has been immortalized inside it. It’s one of a kind.”\n”I do hope it’s one of a kind,” Harry said with a grimace. ”Who on earth would want to make a second one of those?”\n”You’d be surprised,” Riddle replied with a grin. Even his teeth were nice, Harry thought. Merlin, how infuriating.\n”How long is this... sale going to last?” Harry asked then, taking a step away from the other wizard and closer to the exit. ”Is it only for today? The weekend?”\nRiddle shrugged, feigning nonchalance. ”Well, at first we thought it’d only be for the weekend,” he said, brushing his perfectly neat fringe to the side a bit. ”But this has been such a success and we’re getting rid of so many unnecessary items that we’ll extend the sale by a few days. Until Wednesday, I believe. I hope it’s not interfering with your business?”\n”You know bloody well that it is,” Harry hissed, scowling at the man. ”But if you think this is your victory, just you wait, Riddle. You haven’t seen anything yet.”\n”Goodness, and here I thought we were friends,” Riddle said mockingly. ”Can’t we just get along? As neighbours in this very pleasant nook of Knockturn Alley?”\n”Oh, sure, if you want to leave it at that,” Harry replied, wanting nothing more than to wipe that confident look off the other man’s face. He plastered on a sweet smile and continued: ”This killed just about any ounce of attraction I had towards you. Goodbye.”\nHe then left, slamming the door shut and leaving a wide-eyed Tom Riddle behind him.\n*\nRiddle’s sale did, indeed, continue until Wednesday. Thankfully by then the number of clients had returned back to normal for both Harry’s shop and Borgin and Burkes despite the reduced prices. Riddle hadn’t come to visit, and Harry wasn’t sure how to feel about that. Unexpectedly, he had grown quite used to the man’s visit, despite knowing who he was and what he was planning on doing. Not to mention that Harry hadn’t exactly lied when he had called Riddle handsome.\n“You wish it had been a lie,” the zinnia said, packing an unfair amount of judgement into those words.\nWhat Harry was sure about, however, was that he would need to strike back one way or another. What Riddle had pulled with that sale of his had seriously made Harry’s business suffer for those few days, and if he hadn’t been lucky enough to have his own money in the bank as a back-up, he’d be in quite the pinch with his bills. Harry couldn’t let this slide, and frankly… hadn’t he come back in time specifically to make Riddle a little bit less comfortable with his life?\nOn that week’s Friday Tom went to work with a strange feeling at the pit of his stomach. When he opened the store early in the morning, he saw that the flower shop was still closed. Not only that, but the skeletons guarding the door were dressed in black robes, and there was a large black ribbon hanging off the window. It wasn’t a sight Tom was used to, but he wasn’t sure what it meant.\nWhen people, well, hags, streetrats, beggars and all sorts of oddities began gathering in front of the shop, Tom noticed immediately. What he also noticed was that everyone was, without exception, wearing mostly black. Some had obviously used a little bit of coal to aid them in matching what seemed to be the chosen colour of the day. They walked in and out of the flower shop, and strangely enough, didn’t leave the area despite exiting the store.\nIt took Tom a few moments before he noticed that the ones who exited the flower shop were holding cups and small platefuls of what looked like pastries.\n’What on earth is going on?’ Tom thought, hesitantly heading towards the door. The last customer had dropped by a long time ago, and it was clear to him that whatever Harry was up to, it wasn’t good for the store’s business. Borgin wouldn’t be pleased. It was quite lucky that the owner had a trip that kept him away from the shop for a few days, and the thought of putting up with his whining wasn’t appealing in the least. ’There’s no way he’s having a sale. These things wouldn’t gather here for cheap flowers.’\nAfter a brief moment of hesitation, Tom pushed the door of the store open, and stepped outside. Right away he almost bumped into a pair of hags occupied with shoving a mountain of pastries into their mouths, making a right mess out of it with no shame. Despite the disgust Tom felt, he mustered up a charming smile and turned to the one standing closer to him.\n”Excuse me,” he said. ”Quite the gathering you all seem have going on here.”\n”Excused,” the hag replied, partly chewed food visible as she spoke.\n”I was wondering what has brought on this… lovely meeting?” Tom asked. ”Is it a sale of some sort?”\n”I’m here for the food,” the hag said, and wiped her mouth with a tuft of her hair before continuing: ”It’s a party. We’re celebrating the death of Mister Harry’s pet.”\n”Funeral,” the other hag said. ”I think it’s called a funeral. The food is great. Didn’t like the drink at all, though. Too watery and hot.”\n’His pet died?’ Tom thought. ’I didn’t even know he had a pet.’ Somehow Harry didn’t seem like the kind of a man to keep a pet around, what with him spending most of his days tending to flowers.\nStill deep in thought, Tom retreated back into the store as fast as he could without making it too obvious. He didn’t particularly care about animals, although the thought of losing his own did make him frown a bit. Perhaps he could allow Harry his time to grieve, even if it came at the expense of his clients for one day. It was fine. One day was fine.\nBesides, after the hustle and bustle of the previous weekend and the few days following it, the comfortable silence was a pleasant change. He could spend the hours inspecting the new items on the shelves, perhaps read a book or two that he wouldn’t be able to buy for himself. It was only for one day, and Borgin wouldn’t even need to know.\n*\nThe following Friday arrived, and with it another crowd of oddities interrupting the best business hours of Borgin and Burkes. Unlike the previous week, however, now Borgin was present, and he was far from amused and understanding.\n”What in bloody Circe’s name is happening,” the old wizard wheezed in rage. ”Is it that florist? Is he the one who— of course it’s him. Tom! Go and put a stop to this! The audacity of this fool. This is ridiculous.”\n”Yes sir,” Tom replied, keeping his own temper in check. ”Should I finish going through the inventory first, or...?”\n”No, no, I’ll do that this time,” Borgin said. ”Off you go.”\nTom stepped out of the store fully intending on not only ignoring the pair of trolls fist fighting over a plateful of some sort of sweets, but also going nowhere near the gaggle of hags playing a game that involved far too many broken bones for Tom to find it remotely interesting. As soon as he entered the flower shop, he saw Harry by the counter, staring a small coffin on the table. The other wizard was dressed in all black, the only splash of colour coming from a lily tucked into his hair.\nHe was… he… well, he wasn’t particularly not pretty, Tom noted.\n”Is it a bad time?” he asked, walking closer towards the counter. Harry looked up and shrugged.\n”It’s always a bad time in my life,” he said morosely. ”What do you want?”\n”To find out what’s happening here.”\n”A funeral. My beloved pet passed away.”\n’Again?’ Tom thought, feeling slightly sceptical about the situation. ”Didn’t that happen last week?”\n”Wow,” a, uh, was that a... well, a flower suddenly said, its tinny voice full of contempt. ”You brazen hussy.”\n”Pardon?” Tom asked, stunned, before shaking his head and turning away from the flower to stare at Harry instead. And Merlin, standing so close to him made it even more obvious that the man looked irritatingly good in his black robes. And he smelled good. Really good. Why. ”Explain.”\n”Flowers die every week, Thomas,” Harry sniffed.\n”That... is not my name,” Tom said. ”Tom is not short of anything. Besides, what does that have— oh, no.” He then took a deep breath to calm down, before reaching for the small coffin on the table. If his assumption was right, then Merlin be damned, he was going to pull out his wand and hex this irritating man regardless of how pretty or entertaining he was.\nWhich he wasn’t. Pretty. Or entertaining. He wasn’t.\n”Some people keep rocks as pets,” Harry hurried to say. ”Anything can be a pet if you love it enough.”\n”That is not how it works,” Tom hissed, and the few other people who had been loitering in the flower shop seemed to finally sense something amiss, as they hurried outside with alarmed looks on their faces. ”That is. Not. How. It works.”\n”That’s how I work, mate,” Harry replied. ”I’m a sensitive soul, you see. I cherish all my pets and grieve when I lose them.”\n”You and I both know what this is about,” Tom said, resisting the urge to slam his fist on the counter and chuck the little coffin outside. ”All this for the sale that I had? This farce in response to a perfectly legitimate business event?”\n”Oh, but you and I both know that’s not the whole situation,” Harry replied. ”Context, my dear friend. Context is important. That sale wasn’t just a sale, but a ploy to make my earnings plummet. Knowing that makes the situation a bit different, doesn’t it?”\n”Isn’t this a bit excessive?” Tom insisted. ”Don’t you think you’re overreacting a little bit?”\n”You’d know about that, wouldn’t you,” Harry snorted, and what did he even mean by that? ”Feel free to host another sale if you wish. My business is blooming, and I have no reason to leave this place.”\n”You know what? Fine,” Tom relented, scowling as he stepped away from the counter. ”Do what you wish. Let’s see for how long you can survive here. These tricks will not be enough to keep you in business for long.”\n”Let me worry about that,” Harry said. ”You can go back to doing, well, whatever it is that you’re doing when you’re not trying to defend dark lords to me.”\n”I have not defended—”\n”Sure.”\n”No, listen,” Riddle insisted, leaning closer again. Merlin, his hair looked great. Harry found that really annoying and, to some degree, distracting. Just a bit. ”I do understand your point of view. I simply do not think that being a Dark Lord and being a Minister of Magic are that similar.”\n”They’re not identical,” Harry agreed, ”but what would you, as a Dark Lord, wish to do that you wouldn’t be able to achieve as a Minister of Magic?”\nRiddle shot him a dark look, before he sighed heavily and closed his eyes, clearly exhausted. ”You wouldn’t understand. What’s your interest in understanding his logic, anyway? He failed, he’s no longer a Dark Lord.”\n”And who’s to say that another Dark Lord won’t pop up right after him?” Harry asked. ”And then we’re back to a cycle of death and terror.”\n”That’s a bit unrealistic, isn’t it,” Riddle replied. ”You’re making it sound as if the next Grindelwald will bring war upon us. That’s a bit of an exaggeration, isn’t it? Especially considering that there’s no way to know what the future will bring.”\n’You arse,’ Harry thought. ’We both know what you’re aiming for.’ It wasn’t that Riddle appeared to be particularly supportive of Grindelwald, or zealously against him. On the contrary, if Harry didn’t know the things he knew about Riddle, he’d simply assume that the man was like any other wizard, at times playing the devil’s advocate and attempting to study the situation from different angles. Someone simply trying to analyse the actions of a Dark Lord while woefully ignorant of the devastation he had brought.\n”Well, I don’t have time to discuss this with you again right now,” Riddle said. ”I have work to do. Just... no more funerals, all right?”\n”Don’t tell me what to do,” Harry said. ”I greet death like an old friend, every week if I have to.”\n*\nThe next funeral took place exactly a week later.\nTo be quite honest, Harry had already grown tired of the whole thing, and had Tom not told him to not do this again, he wouldn’t have bothered. At least more people kept coming quite regularly to the flower shop now, and Mr. Borgin seemed to have given up on trying to chase him away - at least the man didn’t glare at him as much as he used to, anymore. Curiously, Riddle didn’t turn up at all for a while either.\n’Did he give up?’ Harry thought suddenly. Surprisingly, the thought of that wasn’t quite as satisfying as Harry had expected it to be.\nIt was two days later when Riddle stepped in through the door. Unlike the previous times, however, now there was... something different about him. Seemingly calm and composed, it took Harry a moment to realize what exactly had changed: unlike before, when Riddle had wandered in full of confidence and misplaced anger and unexplored issues, now he came in like a man on a mission.\n”I’m here to buy a flower,” Riddle said, and Harry, in his shock, almost dropped the possessed zinnia he had been holding. The other wizard didn’t appear to find anything wrong in his request, and quite frankly - there wasn’t. It was just odd to have a future Dark Lord buying flowers. Harry couldn’t imagine Voldemort doing such a thing.\n”Careful,” the zinnia snapped, its tinny voice barely audible. ”I might be a reaper but I can’t survive a fall like this.”\n”A flower,” Harry repeated, wondering who the flower could be for. Voldemort hadn’t... dated anyone, had he? Wait, really, had he? Dumbledore had said that Riddle hadn’t had a single meaningful relationship in his life, but how true was that, really? ”Sure. Anything specific in mind?”\n”Point me to the flower you consider your current... pet,” Riddle said, clearly up to something. ”I want to buy it. Name your price.”\n”Four galleons, seven knuts,” Harry replied after a moment of silent contemplation. He then pointed at cluster of lilies, preening by the window and seeking sunlight. ”That one, yes, the white one that’s drooping a little bit. That’s my favourite. And she costs four galleons and seven knuts, but you know what? We’re friends, so I’ll give you a special price: six galleons.”\n”Are you out of your mind?” Riddle snapped. ”That’s not how— that’s an outrageous price for a single flower!”\n”The times are hard,” Harry replied easily. ”Besides, it’s my beloved pet, Thomas. How dare you ask me to sell my pet? It’s like my own child.”\n”You already gave me a price – as ridiculous as that price is. It’s too late to pretend to mourn over that thing now.”\n”If you’d rather not pay, you’re free to go and pick your own flower off a field. I’m sure you’ll find plenty.”\n”I’ll take it,” Riddle said, rolling his eyes in a gesture that reminded Harry strongly of Ron, of all people. Riddle was nothing like his best friend, however, and the resemblance faded into nothing in an instant. ”But I want it in a pot, not cut. You can do that, can’t you?”\n”Yes I can,” Harry replied, moving to prepare a pot before extracting the lily from its current place. ”I use magic, you see.”\n”I hate you so much,” Riddle hissed, dropping six galleons onto the counter. ”Just... get it done. Don’t pretend to get emotional over this - we both know you’ll just switch to a different flower once I walk out of here.”\n”Well, actually,” Harry said, ”lilies are my favourites. I’ll wait until you tell me that this one passed away before I pick my next one.”\n”You have a favourite flower,” Riddle said, sounding strangely... disapproving? ”Merlin, did you actually grow up surrounded by girls or what exactly happened to make you this interested in flowers?”\n”Firstly, it’s perfectly normal for men to be interested in flowers. Secondly, my mum’s name was Lily,” Harry replied easily. ”She died when I was one. I grew up at my aunt’s place, and she often sent me to take care of the garden.”\n”Delightful,” Riddle said, clearly not moved by what he had heard. ”Try to hold off on the funerals until this one dies, will you?”\n”Of course,” Harry agreed, wrapping the base of the pot with some paper. ”Let’s see how long it’ll survive in your care. Do drop by again in a couple of days. I’m thinking salty treats for the next funeral.”\n”Don’t place any orders yet,” Riddle said, reaching for the now ready-to-go lily. ”I’d hate for you to waste your money.”\n”No need to worry about my money, darling,” Harry said. ”And hold it from the bottom, yes, like that. Thank you for your patronage and have a good day, sir!”\n”That is the least sincere thing you’ve ever said to me,” Riddle told him while heading towards the door, walking backwards to keep facing Harry. ”Be kinder to your neighbours.”\n”I don’t want to hear that from you,” Harry yelled after him, and sighed when the door swung shut, leaving him alone in the flower shop once again. His friendly relationship with Riddle hadn’t been what he had expected to develop when he had come to this time and day, but he didn’t mind it, really. He had already killed Voldemort - who had been responsible of his parents’ deaths - once, and found it alarmingly easy to separate who Riddle was and who he would become.\nNow if only Harry could manage to convince him of the merits of being a Minister of Magic, instead of a Dark Lord. But really.... how likely was that to succeed?\n*\nAnother few days passed without Tom dropping by to visit. All Harry saw of him were glimpses of whenever he left the store, either to go back home - wherever that was - or to run some errands. It didn’t seem that he was ignoring Harry, though. Rather, he seemed to be deep in thought and constantly preoccupied with something. Was he, perhaps, re-evaluating his goals?\n”Don’t get your hopes up,” the zinnia said, flexing its leaves casually. ”Remember who he is. Voldemort was nothing but a series of disappointments. Even his dad didn’t want him.”\n”That... is complicated,” Harry replied, unsure of how to defend a mass murderer. If he even wanted to. ”You’re taking things out of context. What did Death leave you here for, anyway?”\n”To offer you guidance and wisdom,” the zinnia replied instantly. ”Neither of which you’re willing to accept into your life, so here we are.”\n”Did Death really expect me to learn wisdom and guidance from you?” Harry asked, deeply sceptical about these claims. ”None of that has been forthcoming from your corner, anyway.”\n”I resent your attitude, friend,” the zinnia said. ”Besides-- oh, look who’s coming back. Speak of the devil and he shall appear, hair combed to slick perfection as always.”\nHarry turned when he heard the door being pushed open, and, much to his delight, it was Riddle. The man was dressed in his usual robes, his dark hair neatly combed back. It was odd, in Harry’s opinion, how a man who looked like he’d much rather study dusty tomes in libraries than fight the world with his own hands could be capable of causing not one, but two wars. He didn’t look violent and dangerous, the way people like Fenrir Greyback and Bellatrix Lestrange had looked.\nNow he was back, and he was holding a very healthy potted lily in his hands.\n”I see that’s still alive,” Harry said, wiping his palms against his apron. ”Something wrong with my darling pet?”\n”Nothing’s wrong with it,” Riddle said, and set the pot down on the counter. ”No need to arrange another funeral.”\n”Well, that’s a good thing, I suppose,” Harry sighed. ”What can I help you with, then?”\n”You said this is your, well, favourite flower,” Riddle started. ”You also said that this is your pet. I know it was a lie, that you’re simply doing this to irritate me, but you also said that you won’t hold another funeral as long as this thing lives.”\n”Yes, I did say that,” Harry agreed, wondering where this was going. Had Riddle done something to the flower to keep it so fresh? Why had he brought it back to the store?\n”I want you to keep this on that shelf behind you,” Riddle said, pushing the lily forward. ”Don’t sell it. It’s still mine. Or rather, it’s ours. It’s mine enough for you to not sell it, and yours enough for it to be a pet.”\n”And when it dies?” Harry asked, not against the idea of co-owning something with Riddle, strangely enough. Perhaps he could use this new connection as another way to shift him towards a life of less crime? ”Will you attend the funeral?”\n”It won’t die,” Riddle replied confidently. ”I charmed it myself. It won’t die.”\n”So let me get this right,” Harry replied, feeling some strange fluttering inside of him. The last time he had felt like this had been years ago, when he had injured his foot in a Quidditch match, and Ginny had picked him up and carried him to the closest chair to sit down and rest. ”You’re giving me a flower – my favourite flower – that you’ve charmed to never wilt?”\n”Don’t make it sound like, well, that,” Riddle snapped, a pinkish hue appearing on his face. Was he blushing? ”I simply don’t want to see another one of your funerals disturbing our business again.”\n”This kind of magic is quite incredible,” Harry sighed, poking the lily with his fingertips. ”I’m impressed.”\n”Plants are easy to immortalize,” Riddle said. ”They’re simple enough, their functions easy to strengthen and maintain. But animals? Much harder. And quite pointless.”\n’What about people?’ Harry wanted to ask, but couldn’t bring himself to do so. Instead he looked at Riddle and said: ”You sound quite knowledgeable of these things.”\n”I know plenty more,” Riddle replied. ”I enjoy learning about magic, that is all. And you never know when a spell is needed to make roses last forever. Or well, lilies, in your case.”\n”That would be such a romantic thing to hear if you weren’t the source,” Harry sighed. ”Unless there’s someone you are trying to woo?”\nAt that, Riddle looked at him with a deeply unimpressed expression. ”No,” he said, with sudden aggression in his tone. ”Merlin, there’s absolutely no one I’m trying to... woo... with flowers and halfway interesting conversations.”\n”You know, you’re quite handsome,” Harry observed. ”If you actually did give someone flowers and talked to them about interesting things, I’m pretty sure you’d be doing quite well.”\n”Imagine that,” Riddle said flatly. ”I suppose politics aren’t just interesting enough for some people.”\n”Sorry to hear that,” Harry said, full of sympathy despite how it bothered him to think of Riddle having a love interest somewhere. ”Have you tried asking this person for an outing of some sort? Lunch? Dinner?”\n”I’d much rather attend the minister candidates’ debate than simply have lunch or dinner,” Riddle said. ”You’ve heard of it, haven’t you? The ministry is hosting an event of some sort in which the two remaining candidates for the position of the next minister of magic will be debating on some issues. It’s going to be open for public and the fastest people will get seats.”\n”Oh, right,” Harry realized. ”I had forgotten about that. Merlin, I wouldn’t mind watching that. Did you know someone in the ministry had suggested foregoing the elections and just giving the position to Dumbledore? For defeating Grindelwald? He declined, of course.”\n”I did hear about that, yes,” Riddle said with a grimace. ”I’m glad he declined. But say, the debate is on next Saturday. Would you like to come with me?”\n”Yeah, sure,” Harry agreed. ”If you don’t mind going with me instead of whoever you’re interested in. If you are, that is. Interested in anyone. You never really said.”\nRiddle sighed.\n“I’ll pick you up,” was all he said.\n*\n”So Spencer-Moon is running again, we know that for sure, right?” Harry asked, settling down onto his seat. Next to him Riddle was already scowling at the still empty stage. Around them countless people were talking loudly and doing their best to find someplace to sit at. ”Who’s the other candidate?”\n”Curtis Punnet,” Riddle replied. ”A spineless vermin of a person. He’s Fawley’s nephew, and shares plenty of traits with his uncle.”\n”You know him?”\n”We’ve met.”\n”Spencer-Moon is likely to win, right? The people trust him and he has done quite well so far as a minister,” Harry said. ”What could motivate people to leave that and pick Punnet instead?”\n”Punnet is a pureblood who doesn’t particularly like Muggles or muggle-borns,” Riddle explained. ”He’s wealthy, easy to manipulate by smarter and stronger purebloods and would happily attempt to pass some very controversial laws if he got the chance.”\n”How do you know this?” Harry asked, curious. ”You said you’ve met... did you talk?”\n”He visited Hogwarts a few years ago, when I was still a student” Riddle said. ”Gave an alumni speech of sorts at an event. Slughorn invited him back when Punnet was, well, the nephew of the minister. After that we spoke a bit, yes. He was very impressed by Malfoy, and agreed with him on everything despite being much older. The curious thing about always agreeing with others is that... it doesn’t really give a particularly smart idea of someone.”\n’Impressed by Malfoy, but not by you,’ Harry thought. ’No wonder you’re mad. That would hurt your pride, wouldn’t it?’ ”Does this mean that wealthy Purebloods will be voting for Punnet, then?”\n”Not just the wealthy ones,” Riddle replied, pulling Harry closer as the noise around them increased. ”Even the poor, the trash of society, the ignorant and the uneducated who blame their failures on others. And worst of all – the narrow-minded academics who live in a delusion of being far more intellectual than they actually are. The ones who parade their prejudice and pretend it’s backed by reason. It never is. Those people will vote for Punnet, because they think he’ll somehow benefit them.”\n”Will he?”\n”No, of course not. He’ll settle into his seat, cater to the rich at the expense of everyone else, and the people wanting to vote for him now will slowly realize that he brought them no solutions. Only bad management, and a probable financial crisis.”\n”What about Spencer-Moon, then? Why wouldn’t people vote for him?” Harry wondered, allowing himself to be pulled even closer to the other wizard. Shifting to get into a more comfortable position now that he wasn’t sitting upright, Harry ended up simply relaxing his posture and leaning against Tom, not minding at all the man’s arm around his shoulders. ”Surely the majority is sensible enough to vote for the better candidate?”\n”There are people who think that Spencer-Moon is a bit too close to the Muggle Prime Minister,” Tom told him quietly, and abruptly fell silent when a wizard dressed in dark green robes appeared on the stage. His hold on Harry tightened a bit, perhaps unconsciously.\n”Thank you, ladies and gentlemen, for your presence here with us today,” the wizard said, wiping the sweat off his forehead. His voice, obviously magically enhanced, carried easily over the crowd. ”In a few moments our two remaining candidates will be right here, in front of all of us, discussing matters that concern them and us. Please keep your spells to yourselves, and keep in mind - vote for the candidate you would be proud to call the British Minister of Magic!”\n”That’s Augustus Snell. He’s actually a journalist,” Riddle said, his mouth right by Harry’s ear. ”A pureblood, and doesn’t look like much, but he’s known to be very critical towards other purebloods.”\n”Why are you not building a career in politics?” Harry hissed, turning his head towards Riddle and nearly moving back when realizing how close they were. His mouth ghosted over Riddle’s cheek as he continued: ”You clearly know these people. You know their tricks. Why are you in a shovel of a shop in a dark alley instead of there, on that stage, convincing people to vote for you?”\n”Politicians need quite a bit more than convincing speeches, despite what is claimed by many,” Riddle said, although he didn’t sound as opposed to the idea as he had before. Now both Spencer-Moon and Punnet had taken their seats on the stage, and the debate was just about to start. It was an event very different from what Harry had seen back in his original time. In fact, he hadn’t heard of any debates among candidates.\n”Are you telling me that you wouldn’t be able to succeed at it?” Harry asked, knowing already that that couldn’t be the case. Besides, if Riddle could convince the purebloods to back up his attempt at taking over the wizarding world, why wouldn’t he succeed in convincing them to help him with this? ”Find sponsors. Make connections. Be a better minister than Punnet and Spencer-Moon.” ’Just don’t become a Dark Lord, for Merlin’s sake.’\n”Look at him flounder,” Riddle muttered, watching Punnet struggle with outlining his plans for the society he was aiming to become a minister of. He gestured widely, spoke at length, and showed off his robes that, according to him, had been handmade in Italy by an army of enslaved Muggles.\n”The beauty of me, you see, is that I’m very rich,” Punnet said, and Harry’s face twisted in disgusted disbelief. ”I can make you, all of you, rich too. I can make our society rich. I can make the Wizarding World of Britain truly great again.”\n”And how were you planning on achieving that?” Spencer-Moon asked, clearly unamused and unimpressed. ”You’re yet to share a single goal that you’re capable of achieving, Mr. Punnet.”\n”Of course I can achieve what I promise, I don’t lie,” Punnet instantly said. ”Let me tell you, I’m a really intelligent man. I know how to make things great. I know how to make us great again. Some people call me lucky, but I know better. But what I also am - what I am, ladies and gentlemen - is a concerned man. I am a concerned wizard. I’m concerned about you, I’m concerned about me, I’m concerned about all of us. I’m concerned about every muggle-born entering our society. Now – let me tell you, experts have kept me well informed on these matters. Muggle-born people have quite the advantage in our society—”\n”Mr. Punnet, that is not true,” Spencer-Moon interrupted, but sighed heavily in irritation as Punnet continued.\n”I’m not a prejudiced man,” Punnet insisted. ”I’m the least prejudiced man you’ll find. What I am is critical. I criticise things. And I know these muggle-born folks. They’re lazy. They have the advantage, their mistakes are forgiven, and they blame their laziness on others. You know why nobody has stopped them? You know why? Because we have too many nice people! That’s right! And you know what I know? I know that people are tired of nice people!”\n”Tom,” Harry hissed again, this time horrified. ”Are you telling me that this man could become one of the two last candidates, and you wouldn’t be able to do the same? Really?”\nRiddle was silent for a few long moments, before he took a deep sigh, full of what would’ve been resignation had it been done by anyone else. ”I’ll think about it,” he finally said. ”The next elections will be in six years. I’ve got time to think about it.”\n*\n”If I consider your suggestion seriously,” Riddle said, leaning against the counter and watching Harry work. ”It’d mean a significant change in my current... ambitions.”\n”Is that a bad thing?” Harry asked. ”The things you planned on achieving, whatever they are, wouldn’t you be able to achieve them as the minister?”\n”I could, but there are significant obstacles in my way,” said Riddle - well, Tom. Harry really couldn’t help but to refer to him by his given name. ”While I have managed to acquire quite a few potentially beneficial connections, it’d take quite a bit of manoeuvring to have those connections step into the public eye while professing their support for me.”\n“Are you a muggle-born?” Harry suddenly asked, despite already knowing the answer. ”You never said.\n”No,” Tom replied. ”I’m a half-blood. And while the wizarding family my mother came from is quite... noteworthy, it is not information I was preparing to reveal to the general public. Especially in the beginning - it would escalate things far too fast.”\n”Don’t reveal it, then,” Harry told him, his heart beating fast. This wasn’t the reason he had travelled in the first place, but Merlin... the thought of being able to nudge Riddle - Tom - to a path of less death and destruction was unbelievable. ”Tell only the people who need to know in order for them to support you. Once you have the situation in your control, only then release the information. I’m sure you’ll figure it out well when the time comes.”\nTom remained silent for a few long moments, watching Harry tending to his flowers. The unusually sunny day made the shop brighter than it tended to be, and with no customers in sight, Harry was free to focus on him.\n”Shouldn’t you be working right now?” Harry asked. ”You’ve been here all morning.”\n”Borgin is taking care of it,” Tom replied. ”He won’t need my help until after lunch.”\n”Did he send you to get rid of me again? Is that why he’s not here to take you back?”\n”Hmm-m. Perhaps.”\n”Have you read the Daily Prophet?” Harry suddenly said. ”Yesterday’s, I mean. Punnet is accusing Snell of setting him up.”\n”For what? Failure?” Tom sneered. ”Punnet is doing that all by himself.”\n”He said that Snell led the discussion in a way that made Punnet appear in a less than favourable light,” Harry said, rolling his eyes. ”As if that fool’s speech didn’t do that already.”\n”Punnet is the kind of a minister who’d allow men like Grindelwald achieve their goals as Dark Lords,” Tom said suddenly, making Harry shift nervously behind the counter. ”A man like him being in charge of our society - imagine! How can anyone be blamed for wanting to take over that disaster and steer our society to better avenues?”\n”I don’t think a hostile takeover is the way to go,” Harry argued. ”Not when you, for example, would be capable of doing it by gaining the favour of the public without forcing them into submission.”\n”You know, Harry,” Tom said, giving Harry a dark, assessing look. ”Sometimes submission is a good thing.”\n”Not when it’s not genuine,” Harry replied. ”Then it’s just... another risk you’d be distracted by.”\nTom shook his head and ran his fingers through his hair in a gesture that spoke of impatience. Seeing Tom’s hair this messy and the sleeves of his shirt rolled to his elbows made Harry really— ”I need to plan this,” Tom said, startling Harry out of his thoughts. ”I need to plan this carefully, and it’ll be quite the thing to try - I didn’t expect to do this at all - but... perhaps I could. I’ll consider it.”\n”Did you have some other grand plans in the making, then?” Harry asked, wondering if Tom would actually reveal anything to him. No such luck - not that Harry had really expected him to.\n”None particularly grand,” he replied. ”Working my way up to a management position, perhaps.”\n”At Borgin and Burkes?” Harry snorted, before shaking his head. ”I’m sure you’ll figure out a way to benefit from that, too, in the future.”\n”Easily,” Tom instantly said. ”People – even some old fashioned purebloods who think they worked hard for their inherited money – enjoy stories of underdogs working their way up from irrelevancy. It gives people the illusion that their environment doesn’t hold them back as much as it really does - after all, if someone can do it, why can’t they? See, I’m not the problem here - there’s nothing about me that people can use to hold me back. What I do need however, is someone knowledgeable about the political circles, not just the public figures.”\n”You said you were a Slytherin, once,” Harry pointed out. ”Surely you know someone who could help you?”\n”Oh yes, I know a few,” Tom muttered, and conjured a piece of parchment and a quill out of thin air. Merlin, Harry found even that attractive now. Conjuring things out of thin air, as if he wasn’t able to do the same. ”I need to write down a few things. I’ll also need to establish good connections with journalists and acquire some references.”\n”I’m sure you professors from school would help with those?”\n”Oh yes, Slughorn definitely will. Perhaps Dippet, although he retired recently.”\n”Not Dumbledore?” Harry asked.\n”No,” Tom said. ”Not Dumbledore.\n*\n”He’s quite stubborn, isn’t he?” Borgin said one day, slyly looking up from the inventory report he was going through. Riddle didn’t react, perhaps unsure of what the older wizard was talking about. Borgin elaborated: ”That florist neighbour of ours. Rather stubborn, isn’t he? Unlikely to move to Diagon Alley?”\n”Hm? Oh yes, quite stubborn indeed,” Riddle agreed. ”Oblivious and dense as well. Although our initial concerns of him being a ministry spy or an auror were thankfully misplaced, I could... keep convincing him to leave if you’d like.”\n”Oh, no, no need,” Borgin sighed, still keeping an eye on every reaction he could spark out of Riddle. ”It’s fine. He stopped with his funerals and doesn’t particularly bother us. You, too, needn’t go there every day. I know you hate having your work disturbed.”\n”I do consider dealing with him a part of my job as well,” Riddle said, his usual narrow-eyed smile fixed on his face. ”One can never tell, really, with people like him.”\n”I think he’s just fine,” Borgin insisted. ”I’ve spoken to him a few times, actually. He seems pleasant. He’s certainly hardworking and halfway decent. I was considering introducing my daughter to him. ” Not that he had a daughter, but Riddle didn’t know that, now did he?\n”That... is... quite a leap of faith,” Riddle said. ”I’m surprised.”\n”You don’t consider him a decent wizard?”\n”I don’t think I know him well enough for that, really.”\n”Well, isn’t that something a few good meetings could solve?” Borgin asked. ’Circe knows you’ve been meeting him far too often.’ ”Who knows, if they get along well enough, he might end up being my son-in-law! Young men his age - and yours too, Tom - are seeking to marry. Better settle down early and have some kids and get your life started.”\n”Perhaps it’d be better to... not count on that,” Riddle replied, the smile on his face void of any amusement. ”He doesn’t seem like the, well, marrying type.”\n’The way that lad’s been looking at you, I can’t say I’m surprised,’ Borgin thought, shaking his head. ”Who can tell for sure, really? Might as well give it a shot and see where that goes. Unless, of course... he’s already in a relationship?”\n”He’s not,” Riddle replied. ”Say, people have been recently asking for more goblin-made items. Should I go scouting? It’s unlikely that any will come our way if we just wait.”\n”Too risky,” Borgin dismissed. ”With the new restrictions on trade, it’s too risky to try and look for the kind of items our clients want. How do you know he’s not in a relationship?”\n”I— what? Oh, you mean the florist?”\n”Harry, yes. That’s his name, isn’t it?”\n”Being in a relationship is not something he has mentioned before,” Riddle said, his nonchalant shrug only halfway convincing. ”We’ve spoken quite a few times, and I’m sure he would’ve mentioned a significant other if he had one.”\n”Depends on the rest of the conversation, now doesn’t it?” Borgin said, before sighing and giving up on the subject. He wasn’t used to doing this, and while he wouldn’t have bothered for someone else, seeing Riddle act a bit more like a human was quite entertaining. ”Mrs. Shelley sold us a cursed quill a while ago, do you remember where that is? Hicks from two streets down told me to reserve it for him, and paid half in advance.”\n*\n”Harry,” Tom said, stepping into the flower shop. Harry, who had been dangling a wildly cursing zinnia above the rubbish bin - Tom wasn’t going to ask - turned to look at him with a bright smile on his face.\n”Hello,” Harry said, and set the zinnia on the counter. The thing clutched its pot with shaking leaves, sobbing loudly. Again, Tom chose to ignore the scene and focus on what was relevant. ”You look, um, not particularly happy today. What’s wrong?”\nHarry wasn’t incorrect in his assessment. The expression on Tom’s face indicated very clearly that he was upset about something, and the younger wizard couldn’t, for the life of him, guess what it could be. When no explanation was forthcoming, he let Tom sulk in silence for a few moments while preparing some tea. Soon he set down two steaming cups of Earl Grey between them on the counter, and sat down.\nTom looked at him for a few long moments, and sighed heavily.\n”Go on,” Harry urged. ”If you need to talk, just spit it out.”\n”I’m not sure how,” Tom admitted. ”I spoke with Borgin earlier today, and he expressed interest in introducing you to his daughter. I’m... I find the thought of that extremely unsettling. I’d rather not have you engaged in any long-term commitments that limit the time you can spend with— the time you can spend at the store.”\n’Borgin has a daughter?’ Harry thought, before shaking his head. ”I wouldn’t be interested in meeting Mr. Borgin’s daughter anyway, so there’s no reason to worry.” Why would he worry, anyway? Unless... perhaps Tom was interested in her?\n”I’m not worried, really,” Tom replied. ”While I have never met the lady in question, her father is not the sort of a man I would want in my family. You see, he was already speculating whether or not you’d become his son-in-law, and that’s—”\n”Oh, no, that’s out of question,” Harry replied, not understanding how Borgin could even consider that an option. Or was it common in this time and age? Harry had never spoken to the man, let alone spent enough time in his presence to leave a strong, positive impression. Why on earth would he— unless... Unless it was a lie meant to irritate Tom somehow? It had obviously succeeded, but how? Why would Tom feel annoyed by the thought of—\nOh.\nWhat if...\nMaybe?\n”If you don’t know the lady in question, then is what annoys you, perhaps, my part in that scenario?” Harry asked slyly. Tom twitched, and scowled again. He remained silent, and so Harry continued: ”What if I want to be engaged in a long-term commitment with someone?”\n”Then you should think carefully of your options,” Tom said. Harry laughed, and almost elbowed the possessed zinnia off the counter as he leaned forward, closer to Tom.\n”I think there’s only one option I’m really interested in,” he revealed, feeling far too delighted to be nervous. ”I’m not sure if that option wants me, though. All we do is disagree about things—”\n”That’s not quite true, is it,” Tom hastily interrupted. ”You already know that I’ll be, well.. I’ll be aiming for a career in politics soon enough. Aside from the whole Dark Lord issue, we haven’t disagreed much, have we?”\n”You’re right,” Harry said agreeably, unable to stop smiling. ”Are you going to ask me out for another unofficial date?”\nTom looked at him for a long moment, his eyes wide, and wow - even his eyes were pretty. It was unfair, in Harry’s opinion, because it was really hard to say no to that face - especially knowing the person it belonged to. Tom then coughed, and said: ”How about dinner? Tonight?”\n”I thought you didn’t do dinners,” Harry said, and the other man rolled his eyes, clearly unimpressed.\n”It didn’t think I did commitment either, but I would mind it with you,” he said. ”How about it? Deal?”\n”All right,” Harry replied, feeling light and bright and all the things he had thought weren’t for him to feel. He felt happy. ”Deal.”\n "
}