{
    "id": "784235",
    "url": "https://archiveofourown.org/works/784235?view_full_work=true",
    "author": [
        "determamfidd"
    ],
    "title": "From One Age to Another",
    "rating": "General Audiences",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "The Lord of the Rings - J. R. R. Tolkien",
        "The Lord of the Rings - All Media Types",
        "The Hobbit - All Media Types",
        "The Hobbit (2012)"
    ],
    "relationships": [
        "Gimli/Legolas",
        "Gimli & Glóin",
        "Legolas & Thranduil"
    ],
    "characters": [
        "Gimli",
        "Legolas",
        "Glóin",
        "Thranduil",
        "Dwalin",
        "Galion",
        "Thorin III Stonehelm"
    ],
    "additional_tags": [
        "drunk elves are the best okay",
        "gimli is a BAMF",
        "not a clown",
        "Legolas is also a BAMF",
        "The Company is ooooold",
        "Interspecies"
    ],
    "language": "English",
    "series": "",
    "published": "2013-05-04",
    "completed": null,
    "words": "12,118",
    "chapters": "1/1",
    "comments": "340",
    "kudos": "12,179",
    "bookmarks": "2,430",
    "hits": "122,985",
    "summary": "<p>Upon their return to Eryn Lasgalen and Erebor respectively, Legolas and Gimli each have a new adornment. Their fathers would like an explanation. </p>\n<p> </p>\n<p>(They're not going to like it.)</p>\n<p>L/G, mostly bookverse, some movie elements.</p>",
    "notes": "<p>\n<i>Sooooo. I know it's not Avengers-fic (more of that soon, guys!), but The Hobbit dredged up all my old Dwarf-feels from where I'd left them approximately one zillion years ago. So it's not my fault. Blame PJ and New Line and all those other guys. </i>\n</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> <i></i></p>\n<p> </p>\n<p> <em>Not mine, and ohboy I get snippy about it. Very snippy indeed.</em><br><em>Written from <a href=\"http://hobbit-kink.livejournal.com/2320.html?thread=10638864#t10638864\" rel=\"nofollow\">a kinkmeme prompt</a>. I seem to make a habit of that. </em></p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n<i>I'd love to hear what you think! Kudos, comment, <strike>brick through my bedroom window</strike>...</i>\n</p>\n<p>EDIT: the lovely KariDei Uchiha has <a href=\"http://www.fanfiction.net/s/9505774/1/De-una-Edad-a-Otra\" rel=\"nofollow\">translated this into Spanish!</a> Enjoy :D</p>",
    "text": "\nFrom One Age to Another.\n\nWhen Legolas returned to Eryn Lasgalen, he was much changed. His father embraced him gladly, and then pulled back to study his face. His eyes were deeper, and filled with the joy and sorrow and yearning of the Eldar who have walked too closely to mortality.\n\"My son,\" Thranduil said softly. Legolas' eyelids closed, and his body relaxed infinitesimally.\n\"It is good to be home,\" he replied, equally soft, and bowed his proud head.\nMany things had happened to him, this was certain. His son was no longer the quick and darting, carefree and laughing ellon of yore. He had grown. He had seen mortal death; he had known and loved mortal life. He had lived too near to that fierce, mesmerising, unhappy flame. \"Come,\" Thranduil said, and took his son's shoulders. They were strong and hard and unyielding, a yoke to carry the burdens of the world. \"You should bathe, and rest. It is a long road from Gondor.\"\n\"It is,\" was the reply, and Legolas allowed himself to be steered towards his old rooms. Thranduil gently led his son to the familiar chamber cut near the top of the caves, filled with warm green and golden light that spilled through open windows. Legolas looked around himself, his eyes alighting on old treasures and moving on without a word. The trappings of his princedom, the detritus of his old life – they appeared a little too small for him now.\n\"I will sleep for some time,\" Legolas said, and clasped his father's hand warmly.\n\"As you will,\" Thranduil allowed, before hesitating. His son is one of the great of Middle-Earth, and he is strange to him now. The laughing child seems to have disappeared inside this hardened warrior, swallowed up by knowledge and wisdom and grief. \"Legolas, iôn...\"\nFinally, a smile broke across the wise, pale face. \"Forgive me my weariness, father,\" he said. \"I am tired, and I am without my dear companions of the last year. It is a new and strange hardship to so suddenly be without those with whom you have fought beside, and seen so much. I will sleep, and rise, and become myself again.\"\nThranduil reached out to touch Legolas' bright hair. \"No. You are not the son I sent to Imladris,\" he said, and smiled sadly. \"You never will be that Elf again.\"\nA glint of something mischievous sparked deep in Legolas' eyes. Ah, so the laughing child was not wholly gone. \"No, that I am not.\"\nThranduil clasped his son close again, and then left him to bathe.\nGlóin shifted from foot to foot as he waited impatiently. The traveller was sighted a day from the Mountain, and he knows, he knows it is Gimli. A direct order from King Thorin Stonehelm himself was the only thing stopping the old Dwarf from riding out to meet him.\nThe figure was barely discernible as it approached through the lush green valley that was once the Dragon's Desolation, moving steadily and tirelessly towards the Great Gates. They remained closed as the guards would not open them for a stranger. Dwarves have long memories, and do not forget.\nThe traveller was nearly close enough for Glóin's eyes to make out when a deep, booming, familiar voice cried, \"Ho, the Mountain! Is this any way to welcome one of Durin's sons, home from a long journey?\"\n\"Open the doors!\" Glóin shouted, and raced as fast as old bones would allow from the parapet to the inner bailey. When he arrived the Gates were creaking shut behind a road-stained Dwarf in a fine grey-green cloak, his ruddy hair and beard done up in travelling braids and a walking axe clasped in one hand. \"Gimli! Gimli-lad, where is my son, where is...\" he puffed, pushing through the bodies of the curious guards who were staring unashamedly at the Dwarf's odd cloak and the peculiarly graceful brooch that clasped it.\n\"Now then,\" the Dwarf was saying as he shifted his pack to one shoulder, shaking out heavy muscles made stiff from long walking, \"I would like a flagon of fine Dwarvish ale, news of my family, and sleep, in that order! Where might I find...\" he stopped as Glóin made his way through the crowd, and a beaming smile crossed bearded lips. \"Da!\"\n\"Gimli, my boy, my...\" Glóin tugged the lad close, and brought their foreheads together hard. Gimli laughed, deep and rich and full.\n\"It seems I have been missed!\"\n\"Fool boy,\" Glóin said in a thick voice. \"I heard – we heard...\"\n\"I am well,\" Gimli answered, and his hands gripped his father's bony shoulders. \"Be comforted. I am well, and I am home. It has been a long and strange path I have wandered, but it has led me back to my hearth and kin.\"\n\"Aye,\" Glóin said, and his son's face was all he remembered. His eyes were still dark, his beard red as Glóin's once was, his smile ready and his laughter quick. Yet there was something deeper in all of these, as though his son had somehow become more himself.\nGimli turned to a guard who handed him a tankard. Gimli smiled broadly and thanked him, before he raised it in a salute and drained it. \"Now there is a taste that my tongue has sorely missed!\" he exclaimed, and wiped off his mouth. He moved with a solid, easy confidence that made Glóin's heart swell. His son had walked among Kings and Wizards, the great and the good, and had been accounted one of them. His son is all a Dwarf can and should be. His son.\n\"My sister? My nephews? My cousins?\" Gimli asked, handing the tankard back to the guard with a nod of thanks.\n\"They are well. Grisin is impatient for news of you! She has been bending my ear and those of her husband and sons for weeks with her badgering.\"\n\"What of the battle?\" Gimli asked as they left the bailey and moved towards the inner courts.\n\"Ah,\" Glóin said sadly. \"You have heard, then, about Dáin?\"\n\"Aye,\" Gimli said, and bowed his head.\n\"It was a fine death, and will be remembered,\" Glóin sighed, and stopped to close his eyes briefly. \"The rest of our family is as whole and hearty as they ever were, save...\" He stopped.\n\"Da,\" Gimli said softly, and pulled a tattered book from his pack, the leather scored and stained with blood, \"I sent you word from Rohan.\"\n\"Aye.\" Glóin cannot yet face his brother's death. Cannot yet mourn him, not without the bones that should be buried according to custom and ceremony. Óin is devoured in a pool of filthy water buried under the broken doors of Moria, and cannot even be named a Burned Dwarf of Khazad-Dûm. His cousin lies alone in state in the ruins of the Dwarrowdelf, and Dwalin cannot now make the journey to retrieve him. A dear friend is a mouldering corpse, exposed to orcs and air and time without even a stone to mark his passage; his quarrelling brothers Dori and Nori at last brought together in their grief. \"Not yet, my lad,\" Glóin murmured, and squeezed Gimli's hand over the swift, practiced lines of Ori's penmanship. \"Not yet. Let me find gladness in your return before we speak of sorrow.\"\nGimli looked at him steadily for a moment, and then his thick shoulders straightened. \"Aye, if you will,\" he said, and for a moment he seemed to be carven from stone as all the old tales said. His face had lost all its laughter and he was proud and still, tall and broad as a Dwarf-Lord of old, brave and fearless and terrible even in his stained travel-gear. His eyes spoke of the loss of his uncle and cousin and friend, and he showed none of Glóin's own hesitation.\nGimli was not afraid to face sorrow. He did not seem afraid of anything anymore.\nThranduil could not stomach holding court while his son lay sleeping only a few rooms away, and so he sat in his antechamber and listened to the leaves and the birds and the voices of his people as they sang of light and trees and joyous things. Such things had comforted him in times past, but now they seemed hollow and shallow when compared with the depth in Legolas' eyes and the light in his face.\nHis two elder sons, worried and cautiously joyous, approached him one by one and asked for Legolas with their eyes. He smiled at them in turn and told them that he slept. Their brother would rise and break his fast with them, and they would speak and laugh and sing together, as in days gone.\nLegolas would not be as he was in times past, but he did not mention that.\nNews had filtered through to the Elvenking even in the midst of battle. Thranduil knows of the Paths of the Dead, of the death of the King of the Rohirrim, of the sacrifice of Boromir son of Denethor. He has heard tales of a great chase through the plains of the Horse-Lords and of a mighty battle before the gates of Minas Tirith. He has received word of the deeds of the Nine Walkers; of the burden borne by the Periannath, kin to Bilbo Elf-Friend, and of the death and renewal of Mithrandir. He knows of the treachery of Curunir, and of the passing of the Black Ships. He knows something of the weight that crouches in his son's heart.\nThe wine of Dorwinion at his hand brought no comfort, and the singing was beautiful and pleasing and entirely meaningless - even frivolous. Lost in thought, Thranduil considered Legolas' words. He missed his dear companions of his quest – the Wizard, the Man Aragorn, the Periannath... the Dwarf. The Man was now the King Elessar, the Elfstone of Gondor, and the Periannath travelled once more to their green and peaceful lands in Eriador. The Dwarf must have made his way back to the fastness of Erebor to be with his stone-headed and stone-hearted kin. Such diverse companions, and so strange that one of the Eldar should love and miss them so. Mortals all, save the Wizard. Of course, Legolas was young and he had never seen the light of Aman. He was an Elf of the Twilight, and Middle Earth and its mortals were all he knew.\nSuddenly restless, Thranduil stood and made his way back to Legolas' rooms. He needed to see his son, touch his hair again and reassure himself that he was at last home with them.\nGlóin watched in wordless wonder as Gimli calmly answered the King's questions, handing over the tome of Mazarbul and bowing his head. The answers grew more and more unbelievable as he continued: the Dishonoured Dead, the Nazgul, Uruk-Hai, Ents, Wizards, Hobbits, shieldmaidens, Mumakil and Men and more. And Elves – always, always so many cursed Elves. Gimli spoke with worshipful reverence of the Witch of the Golden Wood, and his hand travelled to the brooch upon his cloak in an unconscious gesture. His dark eyes glittered as he spoke of his Elvish companion, the son of Glóin's jailer of old. His hand did not falter from its position.\nGimli appeared more kingly even than the King, though he wore but mud-spattered leathers, battle-scarred mail and his helmet, and the Lord Thorin Stonehelm was clad in velvets and mithril and jewels. Glóin was speechless with pride. Behind Thorin, the blocky form of Dwalin hovered. Glóin met the eyes of his old friend, and in silence they marvelled at this change.\nDwalin had taught Gimli the axe in his youth in Ered Luin, and remembered the small lad with fiery hair and an even fierier temper just as clearly as Glóin. Their lad had been tempered in the fiercest of forge-fires and had emerged with wisdom and power shining in his face. It was enough to bring his father close to weeping.\nFinally Thorin seemed satisfied, if stunned by what his questioning had brought forth. Gimli bowed low, before turning and striding from the audience chamber, his worn boots barely echoing against the long stone walkways. He walked more lightly than any Dwarf ever born, thought Glóin in his shock, and then he shook the thought from his mind.\nDwalin followed. \"Gimli,\" he said, his voice gruff.\n\"Hmm?\" Gimli paused, and for the first time his great weariness could be seen in his face. \"Ah! Forgive me, my teacher. I am nearly asleep standing up! You look well.\"\n\"I look old, cousin,\" Dwalin snorted, and his grizzled eyebrow rose. \"You look...\"\nGimli seemed amused. \"Aye, well, most of it should wash off, and the rest is as Mahal made me.\"\nDwalin snorted, and shook his white beard.\n\"Dwalin,\" Gimli said then, his face grave, \"I am sorry for Balin.\"\nDwalin's bare pate lowered a little, and his eyes unfocused. \"Damned brother of mine,\" he said in a rough voice. \"Too clever for his own good, that one. Wouldn't listen. Never did.\"\n\"I saw the casket in the Chamber,\" Gimli said. \"It was dark, but it was yet beautiful. He lies in stone in the greatest of the halls of our forefathers. It was fitting. What more could one ask for?\"\n\"Aye, he would have liked that, at least.\" Dwalin said low, before grasping Gimli's forearm. \"You have done us proud.\"\n\"I only did as you have taught me,\" Gimli answered as he returned the grip of Dwalin's arm, no longer burly after almost two hundred and fifty years of life. To the astonishment of both Gimli and his father, the old warrior then bowed deeply over their clasped arms before abruptly turning and stumping back to the audience chamber, closing the door behind him.\n\"Odd.\" Gimli looked sidelong at his father. \"Well?\"\nGlóin found his voice. \"Ah, my boy,\" he sighed. \"I am so proud of you. So proud. Your mother would be too, Mahal keep her.\"\n\"That is not precisely what I meant,\" Gimli remarked, though he was smiling. \"But I thank you!\"\n\"Oh? And what did you mean?\"\n\"You do not intend to protest my friendship with Elves? For they have named me Elf-Friend, and I have found peace and companionship amongst them where I sought it not.\"\nGlóin harrumphed, his brows beetling. \"I can hardly prevent a deed already done, can I?\" In truth, he was not sure what to think.\n\"Nay, that you cannot,\" Gimli said, and his eyes twinkled knowingly. \"Well, I have had two of my wishes come to pass. I have had a good Dwarvish ale, and I have news of my family and they are well and hale, save Dáin our King who died with honour and courage. Now I should attend to the third wish, and sleep!\"\n\"Aye, I'll wager you are tired, at that,\" Glóin said and his voice was faint. \"Come, you should wash the travel-stains from you before they mark your hide permanently. I'll ask Grisin to put a meal together for you, and you can greet everyone when you wake.\"\n\"Good!\" Gimli said, and yawned. \"I could sleep anywhere at this time, such is my weariness, even in one of those tiny Galadhrim cockleshells.\"\n\"Don't you fall asleep in the water!\" Glóin admonished, and one hundred and twenty years fall away with those words and he can remember a twenty-year-old Gimli, all reddish curls and downy chin and wide eyes, peering at him from amidst the suds.\nGimli laughed loudly, his head thrown back and his white teeth flashing. \"That would make a fine end, after all I have seen!\"\nThranduil pushed the door open as softly as stone allowed. His son was stretched out on top of the bed, legs drawn out and head propped up against the wall. His hand was clasped beside him as though around his bow, and a white knife could be seen poking from underneath his pillow. A watchful position, and one he must have adopted many times whilst on his journeys, Thranduil surmised. His son has developed cautious habits.\nHis eyes were open and glassy in the reverie of Elvenkind, and his hair was wet from his bath and streaming over his bare chest.\nWith a father's eye, Thranduil began to catalogue the changes in his child. Legolas was thinner than he was a year hence, though his shoulders were both denser and hard-carved. He had rarely been without an arrow to his string, then. He did not have the weight to spare before the Quest, and he looked older, in the manner of Men, for the loss. His face was harder, the mouth set and firm and full of strength and yet kind, for all that.\nThe light in his face did not dim with the onset of sleep. With a jolt of wonder, Thranduil realised whom Legolas resembled – the wall tapestries hanging in his many-pillared throne room told the tales of Gil-Galad and Eärendil. Their faces were similarly kind, and stern, and filled with both sorrow and light. The recognition filled him with both joy and loss.\nSitting beside his sleeping son, Thranduil moved to smooth Legolas' golden hair back from his forehead, and paused. There beneath the bright tresses was a mark on his son's flesh. There was a stamp, a tattoo, strange if pleasing to the eye, inked into Legolas' left breast.\nGimli moved through his ablutions with steady, economic movements, stripping and washing without preamble. He yawned frequently, and his motions spoke of long practice at washing in a state of complete exhaustion. Glóin sat with him to keep him awake. He was already speechless, but he found new ways in which to be silent when he saw the new scarring along Gimli's hide and how the already massive muscles of arms, shoulders, belly and thighs had further thickened and hardened. They were etched as though with diamond from long privation and from wielding his grandfather's heavy axe every day for a year. His son had lived through much, and he found he could not think of how to speak to him. And even his thoughts grew still when he noticed the new symbols marked over Gimli's heart, darker and clearer than the coming-of-age tattoos marching over his arms and shoulders. These had barely healed, they were so recent.\n\"What's that?\" he asked, blunt in his astonishment.\n\"Ah.\" Gimli glanced down at the marking; an elegant representation of a crown of leaves surmounted with antlers, all surrounded by the graceful curling of letters. \"I'd almost forgotten that was there. Pay it no mind.\"\n\"Gimli,\" Glóin growled, and Gimli just shrugged and tipped his head forward, the spill of his wet hair obscuring his face. \"Tell me.\"\nA sigh, and Gimli pushed back the coppery fall as he smoothed soap into it. \"It is a promise, Da, and a pledge.\"\n\"A pledge? To whom?\" Glóin stood, a terrible suspicion building in his mind. The symbol was vaguely familiar to him, which would be concern enough. But more – the script surrounding the symbol was definitely Elvish.\n\"A... companion. The dearest of companions.\"\n\"Who?\" Glóin peered at the mark, dark and black against the brawn of his son's chest. \"That is Elf-work. What Elf would dare or deign to mark a Dwarf?\"\n\"Peace! It is not like that!\" Gimli said, and rinsed out his beard. \"It is a symbol, nothing more.\"\n\"Of whom? Who is this dearest of companions who writes pledges in Elvish on your skin? The Man from Gondor? I hear tell he was raised by them.\"\n\"Nay, not he.\"\n\"Gimli,\" Glóin said in the warning tone that had so often worked when Gimli was naught but a child.\n\"It is the sign of Legolas,\" Gimli murmured, and touched the tattoo with thick, powerful fingers made gentle. \"Legolas Thranduillion of Eryn Lasgalen, and my... friend.\"\n\"Your friend,\" Glóin said stiffly, before controlling himself with a vast effort. \"And does this Elf bear any such pledge, or is this a burden he generously permits a Dwarf to bear alone?\"\n\"Do not speak of what you do not understand,\" Gimli said in a low voice.\n\"An Elf, marking you like a piece of property! Nay, no Elf would suffer to be marked thus. But you wear his mark like a badge! The son of that...!\"\nGimli looked up, and there is a fire in his expression. \"He too bears my name, and the crown and seven stars of our forefathers,\" he snapped in crisp Khuzdul.\nGlóin fell back onto the stool in shock. \"Your name,\" he said in a faltering voice.\nGimli looked back at his father, his mouth a grim line. \"My name.\"\n\"Your... Gimli, you did not. You did not.\"\n\"Aye. I did.\" Gimli turned back to his bath, pouring a dipper of water over his head to wash the soap away. Even as Glóin wrestled with his anger and outrage, Gimli calmly wrung out his long hair and beard, wrapped his hips in a cloth, and knelt before his father. He said nothing, and simply waited.\n\"Gimli,\" Glóin said weakly, and then reached out to touch his son's fiery hair. \"Your name...\"\nGimli waited some more.\nThere was only one reason why a Dwarf would ever give another their true-name, their secret name, the name forged for them alone. No Elf, Man, Ent, Orc or Hobbit had ever heard such a name spoken in all of the life of Arda. Not from the dim mists of time when the Seven Fathers woke amidst the light of the Trees unto to the very hour in which they stood had a Dwarf ever shared it with another kindred. Glóin remembered teaching as much to Gimli, remembered his pride as his son underwent the secret ceremonies and completed the ancient, sacred rituals that no other eyes had ever seen. His mouth formed the shapes of his son's secret name, and Gimli's eyes softened.\n\"Aye. Even so,\" he said gently, and his fingers touched his father's knee warmly. \"Where he goes, I shall follow. I have held his life in my hands, even as he has held mine. All that I am is his. All that is Legolas is mine. He risks the life of the Eldar for love of me. Shall I not give him the means to find me in the Halls of Mahal ere Arda is remade? Shall I be so craven as to never let him know all that I am?\"\n\"My son,\" Glóin moaned, and his fury and grief battled in his heart.\nHis son has given his love to an Elf, and he will be lost to his people. His son, this new hero of the Third Age, has given the gift of a Dwarf's one love to a creature who will outlive him by centuries, will never understand his secret, ancient Dwarvish ways, will discard him in his withered old age. He will leave them to follow this Elf, and the Elf will leave Gimli to his regret and solitude. What life is this for the mightiest Dwarf of their days?\nGimli watched his father with deep, patient eyes, and did not comment on the storm he must have seen brewing in his face. He allowed Glóin the time to absorb the full implications before he took a deep breath.\n\"I did not ask for it and nor did he,\" he said quietly, and his voice was a smooth rumble reverberating from the stone walls of the washroom. \"It came upon us all unawares. We began much as you saw in Rivendell, with barely-concealed suspicion and Ages of hatred and mistrust riding in our hearts. Yet I saw strength in him, even then, and later he told me that he admired my own in those tense days.\"\n\"How could this come to pass?\" Glóin croaked, raising his wet eyes to meet his son's face. Astonishingly, Gimli smiled once more, a full glad smile warm as a summer's afternoon or a banked forge fire.\n\"Through pity, and understanding, and fellowship. We lost Gandalf in Moria, or so we thought. In Lothlorien, we walked for long hours alone as we wrestled with our grief. I too mourned for my kin and for the befouling of once-beautiful Khazad-Dûm. Legolas saw, and understood. His pity reached me and filled me with shame. An Elf, offering comfort to a Dwarf! I could not do less for his grief for Gandalf, and so our solitary walks became joined. Thus we reached out to each other, and a strange and cautious friendship began. Oh Da, it is a place outside time, that enchanted Wood. We drifted together amongst golden mallorn-trees and spoke of our families and of Gandalf and of the things we feared for the Quest and of the dangers that beset our homes. He offered me his sympathy for Óin, Balin and Ori. I listened to him sing his lament for Mithrandir against the sound of the rushing Nimrodel. It seemed that I looked into the heart of an enemy and found there sympathy and understanding. When we left that place, like it or not, we were friends.\"\n\"But not yet...?\"\n\"No,\" Gimli shook his head, red hanks of hair sliding over his shoulder. \"Not then. Not yet.\"\nSuch a strange symbol. Thranduil bent over the prone body of his son and studied it carefully. It was marked over Legolas' heart, and seemed to be made up of a knot of bold, sweeping lines surmounted by a crown and seven stars, surrounded by Cirth runes. He peered at it, but he could not read what the letters denoted. Cirth was not a script he had cause to read often, and he preferred his scribes to translate it for him. It was, however, much in use by Dwarves.\nDwarves.\nStanding swiftly, Thranduil stole from his son's side and closed the door of the chamber behind him. His hands fumbled with the latches. Then he made his way as quickly as he dared to the library.\nHis son was engraved with a Dwarvish symbol of some sort. He would discover its meaning, and find the mortal who dared to so alter one of the First-Born. The stone-grubber would come to sorely regret its actions.\nThe custodian of the library took one look at the face of his Lord and fled as Thranduil made his way to the shelves containing the Dwarven genealogies, such as they were. Record keeping had been somewhat... inconstant in this area. That secretive people rarely allowed others to collect information on their kind. Further, many of the Dwarves' own records were lost to time and tragedy forever, what with sorrowful wars and Dragons and Balrogs constantly forcing them from place to place as their people slowly diminished in number. Still, there was enough here for Thranduil's purpose.\nIt was the son of Glóin, he remembered, the child of one he had imprisoned before the war in the North. A Naugrim assigned to the Nine Walkers, a token nod to that other eldest race of Arda, the ones unwanted and unasked-for. A son of Glóin, son of Gróin, a Dwarf of high standing and a Lord of his people, descended from Durin himself through the line of his fathers, a cousin of kings.\nHe opened the tome concerning the Longbeards, the folk of Durin, of Khazad-Dûm and the Lonely Mountain.\nEach line had some distinguishing pattern, and many of the sundered branches had their own sigils. Thranduil found the match to the one inked on his son's pale skin almost immediately, and closed the book. A grim smile crossed his lips.\nAs he thought.\nGimli led his father to the inner chamber, where sleep-clothes had been set out for him. His bed had been aired and the coverlet turned back, and he eyed it longingly before sighing and assisting the dazed Glóin into his chair. His father slumped back, his gnarled hands clenched until his knuckles showed up white against the deep blue of his tunic.\n\"I cannot understand this,\" Glóin said, shaking his head slowly, before looking up at his son with pleading eyes. \"Gimli, my boy, tell me what this is. What are you telling me?\"\nThe younger Dwarf pulled the cloth from his hips and used it to blot the moisture from his beard, before sitting on the bed and dragging on the sleeping tunic. It was an old one, and now too large for his travel-hardened frame. It made him look younger and softer compared to the worldly, seasoned traveller at the Gate or the carven warrior of the washroom. \"I am telling you the truth of this,\" he said, and began to wind his hair into a thick braid to keep it under control as he slept.\n\"Then finish the tale,\" Glóin snarled, and his hands flexed involuntarily, as though grasping for the neck of the Elf that had so ensnared his son. \"Tell me how this obscenity came to pass.\"\nGimli's lips tightened and his fingers halted in their weaving. \"You will not refer to us, nor him, nor any part of it, as an obscenity.\"\nGlóin fell silent, though he could feel his glare heat. Gimli paid it no mind.\n\"We lost Boromir at Amon Hen,\" he began, \"and we thought the Hobbits far beyond our reach. We pursued them – ah, I will not speak long of that chase! Days and nights without rest and food, and moving ever onwards into Rohan only to discover what we believed to be their pyre. All through it, Legolas and I... we watched, and learned. He learned of the endurance of Dwarves; I learned of the fleetness of Elves. And then, Helm's Deep. We fought together, Elf and Dwarf, bowman and axeman, and I passed his score by one. It was a proud day!\" He smiled at the memory.\n\"Your scars...\"\n\"Nay, that was later. I was wounded at that battle, but t'was only a slight head wound. Not serious, though to hear Legolas fuss you would have believed I was at death's very door! As though such simple stonework as raising a bulwark after a mere insignificant orc-scratch could ever sap my strength. Ha! Dim-witted Elf!\" And here Gimli laughed, as though expecting a cheerful rejoinder.\nGlóin felt his teeth grit. \"Move to the meat of the matter,\" he growled.\n\"As you will,\" Gimli said, and settled back into the bed with another yawn. \"I would have left you to your - how did you put it? - gladness in my return. Had you not insisted on sitting with me as I bathed, you would not yet know. That would have been my wish, truly.\"\n\"You would not have told me?\" Glóin almost sprang from the chair in rage. \"You would have played the part of such an undutiful, disloyal...\"\n\"I am not the one shouting at my family,\" Gimli said pointedly, and Glóin subsided slowly, his rage at a gentle simmer. \"And aye, I would have left telling you to some later stage, once you had met Legolas and found that a son may not be his father, nor old hatred a fit guide to judging someone's worth.\"\nThe rebuke was gentle, but it was still there. Glóin could feel his resentment building. \"Get on with it,\" he said, and fixed his son with a fierce glower.\n\"Very well. After the battle, we repaired to Edoras once more and Legolas and I rode together. Incidently, I am still not fond of horses, no matter how passionate Éomer's arguments! Legolas and I were friends at that time, and we made it well known. We shared lodgings, a horse, a bench at the table. He did not wish to be parted from me, nor I from him. I knew something grew between us, though I could not name it.\n\"He saw my fear upon the Paths of the Dead. I saw him shrink back from the black trees of the Dimholt. He saw me crawl upon the ground undone by fear of death, watched me master my terror at the Stone of Erech. I saw the awakening of the Sea in his blood at the gull's cry, saw him wrestle it aside for love of Middle-Earth and for his friends. He became the dearest sight these eyes have ever beheld. When we found and faced each other victorious on the plain of Pelennor, orc-blood staining us very nearly black and our hands slipping in it, he out of arrows and my axe notched, we fell into an embrace, and he confessed his fear and his love. I could not.\"\nGlóin could not help but watch the fire flicker over his son's face as he spoke; the love and regret and longing. The Elf... he was indeed Gimli's One. There would be no other. Gimli would be bound to him for the rest of his life. \"Go on,\" he said heavily, and Gimli looked up, his eyebrow quirking.\n\"You are impatient! Or perhaps I have grown more patient. Well then, Legolas told me his heart, but I held back. I could not believe an Elf could truly care for a Dwarf. We are not as the other Children of Illuvatar. We were made by other hands, and they do not understand us. We are apart, and we are stronger for it. And furthermore Legolas had heard the cry of the gulls by then, and longed for the Sea.\n\"He set about trying to prove himself to me,\" Gimli said, and his gaze was fixed on a time and place far away. \"I would not relent, and he muttered often about my stiff neck.\" He laughed softly. \"Then he offered to have my mark inked into him, to remain there in his flesh until it joined mine in death.\"\n\"Death,\" said Glóin flatly. \"An Elf.\"\nGimli closed his eyes and lay down in the bed, his limbs slowly loosening into relaxation. \"Aye. But that I learned from another.\"\nLegolas slept for six hours – a long time for an Elf. Thranduil spent the time brooding. His son wore the brand of a Dwarf over his heart. There were any number of things it could mean, and he misliked all of them.\nHis son announced his presence by a knock on the door, and Thranduil told him to enter, even as he rose and poured two cups of the heady Dorwinion wine. He would need it, no doubt, for the conversation to come.\nLegolas immediately sensed his father's mood. He stopped, an alert wariness in his look, and sat slowly and cautiously in the proffered chair. Thranduil handed him a cup and seated himself opposite, arranging his silvery robes around his crossed legs.\n\"Adar?\" Legolas ventured, his long fingers wrapping around the cup.\nThranduil took a long breath, before meeting his son's grey eyes. \"I will not dissemble; I will say it outright. You bear the sigil of the line of Durin on your breast. Tell me, the Runes around the outside of the design, what do they say?\"\nLegolas paled even further, but his expression did not change. \"That I cannot tell you,\" he said, and took a sip of the cup, \"save that I alone may know their meaning. No translator would give you the answer you seek. It is not a tongue known to Men or Elves.\"\n\"Or to Dwarves?\" Thranduil immediately retorted, and Legolas smiled faintly.\n\"I have said all I may.\"\n\"Why the House of Durin?\" Thranduil demanded, leaning forward in his chair. \"What manner of hold does the Dwarf have over you?\"\n\"Nothing he has sought for himself. Nothing I would not gladly give him,\" Legolas said softly, and he looked down at his cup. To his father's eyes, he leaned slightly to the north-east, towards the Mountain.\n\"Explain.\"\nLegolas looked up. \"You will not like the explanation.\"\n\"I do not ask to like it, only to have it,\" he said, and his fingers gripped the stem of the glass tightly. \"I must know, iôn. Tell me why Legolas Thranduillion, a Prince of Eryn Lasgalen and the grandson of Oropher, would mark himself thusly with the symbols of a royal house of the Naugrim.\"\nLegolas' head snapped up. \"You will not refer to them as such,\" he said in a sharp tone. \"The Dwarves are the work of Aulë. It would not be wise to call them stunted or misshapen, lest you feel it your place to criticise the work of a Vala.\"\n\"And here you defend them!\" Thranduil stood in one fluid movement to tower over his son. \"I do not know what change this Dwarf has wrought in you...\"\n\"Alas, I fear I am most to blame. He refused me.\" Legolas' mouth twitched, and he sipped from his cup once more. \"Many times. My persistence is what led to any lasting changes.\"\nThranduil's mind blanked entirely. \"Refused you? Refused you what?\"\nLegolas' gesture was airy and graceful and entirely too descriptive.\nIcy shock peeled his mind of thought, and Thranduil sat heavily, staring at his son. \"You wish to bind yourself to him.\"\n\"Not wish to,\" Legolas said, and he was grimly amused, Thranduil realised. \"Have.\"\n\"A... A Dwarf. This son of...\"\n\"Gimli,\" Legolas corrected, and drained his cup. \"He is known as Gimli, son of Glóin, of the line of Durin. A lesser branch, to be sure, of that great tree, but he is descended from kings nevertheless.\"\nAn advantageous match, Thranduil's political mind whispered, and then he threw the thought far away. \"A Dwarf!\" he repeated, dismay rising in his heart. In all his imaginings, he had not thought of this.\n\"Yes,\" Legolas said, and inclined his head. \"He is a great soul, and a mighty heart, and unmistakeably he is a Dwarf.\"\n\"Ai, Legolas!\" he cried in horror. \"Legolas, what have you done? You must undo this before it is too late!\"\n\"It is done and there is no undoing it. I have chosen, Adar,\" he said, and stood to take his father's long-boned hands in his own. \"I have chosen to follow him, to love him and to be loved by him.\"\n\"You have chosen only death!\" Thranduil exclaimed. \"This is the path of Tinuviel you tread! Your Dwarf, even if he loves you, is a mortal - you will be bound to his fate!\"\n\"Oh, he loves me,\" Legolas murmured, and smiled with such radiance that Thranduil's own heart beat painfully in his chest. \"From stone his kindred came and like stone he loves, immovable and adamant and everlasting. But yes, you are right. To stone he must return, one day. And I will follow.\"\nThranduil turned away with a cry of grief.\n\"No, Adar, no,\" Legolas said gently, and clung tightly to the hands in his. \"Do not mourn me before I must depart! For his will be a long life. He is of the Khazâd, and the short span of Men is not his. We will travel, and build, and I will live for Ages in his eyes and in his arms. We will settle in the green gardens of Ithilien and the jewelled splendour of Aglarond, and there we shall work such marvels as to live on in memory forever! I do not regret my choice, Adar. Do not regret that it is mine to make.\"\n\"I must regret that my son may die, as few of the Eldar must die,\" Thranduil said amongst bitter tears, \"and all for the jealous and proud heart of a Dwarf.\"\n\"Aye, jealous he is,\" Legolas said, and he smiled once more. \"And proud, justly so.\"\n\"Proud! You take pleasure in this? This creature is the son of one who nearly brought the North to war for pride!\"\n\"Would you blame Gimli for his father's doings?\" Legolas' eyes turned cool in a fashion learned from his father. Their resemblance had never been so apparent, now when they were so much at odds. Legolas had never had the look of his mother, long since called to Mandos. Yet his smile sometimes caused Thranduil to halt, stricken and pierced by the memory of hers. \"He was not yet come to adulthood then, and worked in the iron mines of far Ered Luin in his father's absence. I do not see how he can be held responsible. Do you even blame him for the actions of his dead cousin who was to be King?\"\n\"I do and will! A branch of that stunted, withered tree, you say! Indeed, and bearing the same poisonous fruit!\" bellowed Thranduil.\n\"His own father's captor is my sire. He could do as you do, and blame me for it,\" Legolas said, and his voice was cold and lordly. \"I thank Elbereth and Aulë he does not, and never has. He does not deserve such a vicious slur. He is wholly good, loyal and noble, and you do him a disservice.\"\n\"They are Dwarves!\" Thranduil hissed. \"They have brought nothing but pain and misery to Elvenkind.\"\n\"Can you say that the Elves have always treated fairly with the Naugrim?\" Legolas near-spat the last word, and then visibly calmed himself. \"No. If all the wrongs between Elf and Dwarf were listed, we should still be here arguing as the Mountain crumbled. I do not hold Gimli apart from his people, but neither do I blame him for their wrongdoings. Neither does he hold me accountable for the evils Elves have wrought.\"\nThranduil's thoughts turn to a day, cold and crisp, in which dragonfire seared the sky and a young Dwarf Prince screamed for aid even as Thranduil turned aside with regret in his heart. \"He lies. No Dwarf would forgive and forget. They hold to their grudges as to their gold and jewels.\"\n\"Gimli is a tremendously bad liar.\" Legolas said, a smile tugging the corner of his mouth. He sat back on his heels and tilted his head. \"His ears turn scarlet and his silver tongue turns to lead. He is the most honest being I have ever met. As for grudges, the Lady of the Galadhrim herself named him Elvellon, and gave him three strands of her hair. At his request.\"\nThranduil gaped.\n\"Aye,\" Legolas said, a most Dwarvish answer, and laughed aloud. \"He does not know the significance of the gift, but he treasures them as he would a child simply for love of the giver. He has the Lady's favour, and her blessing.\"\n\"But... but he is a Dwarf!\" Thranduil protested, even as this last news sent him reeling. Galadriel, most powerful of the Noldor yet living in Middle-Earth, had given the gift she had once refused to the mightiest of her kin... to a Dwarf. A Dwarf!\n\"I believe we have ascertained that,\" Legolas said, and rose gracefully, releasing Thranduil's hands after a firm squeeze. \"He is a Dwarf, and he is my Dwarf. He is all I wish for, and I will never turn aside. With your blessing or without, my King and father, I will be his.\"\n\"Without my blessing,\" he repeated dully, and then fisted his hands in his robes. \"Yes, so it shall be!\"\nLegolas regarded him with an even stare, his eyes shuttered. \"And without your love?\"\n\"If my love cannot turn you from this folly, then what use is it to you?\" Thranduil raged. \"Will he keep you in a stone tomb with the rest of his treasures, do you suppose? My son, and a Dwarf! A Dwarf who marks you as though you were livestock! Will you be his chattel, a prized possession amongst many? Will your chains be gold and mithril?\"\n\"Be silent! You do not know what you speak of,\" Legolas said in a dreadful voice, his eyes flaring. \"You speak with the madness of grief. He would never chain me. Rather, it is I who hold his bonds! He will never love another. He can never turn aside from me. Dwarves love one and only once, and that love is selfless beyond compare. If I had not spoken he would have loved me from afar and never sought to change me. He would rather spend his life amongst the trees and never work iron and stone again than see me wither. His mark I bear of my own will and my own resolve. He would not have had it so.\"\n\"But...\" Thranduil spluttered, \"why, then? Why such a mark?\"\nGlóin pulled his chair closer to the bed and looked down at the face of his child. His heart was full and heavy as lead, and his rage had all but run its course. What purpose could he put it to? He was old and could no longer swing his axe, and besides, it was far too late. Gimli's heart had been given, and there would be no going back. Sadness welled in him for this, his splendid child, and this foolish, fond love.\nGimli's brow had smoothed out as his eyes closed, and his fingers rested over his heart lightly. \"Tell me, lad,\" Glóin said, and reached out to smooth back the damp snarls of hair from the tanned and weather-worn cheek. \"Why must an Elf die to love you?\"\n\"He needn't,\" said Gimli, and he yawned once more. \"But he is determined, that one. Stubborn as any Dwarf, I should think! It was Aragorn who told me what it meant for Legolas to bind himself to me. What words could I speak? What could I do? The deed was done, and I only had to open my hands to receive it. And in truth, I could not resist the promptings of my heart much longer. The Lady told me that gold would have no dominion over me, but ah, she was wrong. The gold of his hair is more beautiful than any mined from the bones of the earth.\"\n\"Enough of your loving nonsense,\" Glóin grumbled, and his son chuckled and opened his eyes. It was madness, but this... the Elf...\n\"You truly are impatient! Very well, I will tell it, but forgive me if I fall asleep in the telling!\n\"Legolas does not have the choice given to Arwen Undomiel. He has none of the blood of the Half-Elven to tie him to the life of mortals. We will be parted. The choice of our final fate is this: that Legolas fades from grief after my passing, or that he makes sail for ancient Elvenhome across the seas before I die. There his woe may be washed from him over time, though he has an Elf's uncanny memory and may never wholly be without it. He would mourn in the midst of peace for the rest of his days, and never join in the bliss that is his birthright. His love for me, either way, will bring a sundering from his people.\"\nGlóin sat back, his mind awhirl. \"He chooses this?\"\nGimli smiled sadly even as his eyes slid shut once more. \"He chose it, long before I ever agreed.\"\nAll the breath left in the body of the old Dwarf escaped in a loud whoosh! \"Now that is something indeed!\" he muttered to himself. That an Elf could love another race, he had no doubt – there were long and tragic tales of such love between Elf and Man – but such love directed towards a Dwarf he had despaired of. Now, he had no such doubt.\nGimli's devotion would not be cast aside, and he would be cared for all his days, no matter how strangely they ended. Elf or no, Thranduil's son or no, this Elf loved Gimli more than his immortal life.\n\"Gimli, my lad,\" he murmured, and smoothed out his son's ruddy beard. \"Forgive me. You were right; I did not understand.\"\n\"Sometimes I feel I don't understand it myself, and so you are entirely forgiven,\" Gimli said around a yawn, and fumbled for his father's hand. Upon finding it, he held it tightly. \"Elves are flighty creatures, wild and fey, but he is all I wish for and all I desire. Maddening thing that he is! He teases and sings and cossets and talks to trees, Da; it is all most ridiculous, and I cannot help but be charmed. Then he turns and he is a tall warrior, a slim and deadly blade tempered in the fiercest of fires, and I am left in awe. Then he turns again and he is wiser than Wizards and cloaked in all the sorrow of the Elves, and I forget myself entirely. In all things, he is fair beyond measure. I am lost, and glad to be. I wear his brand in my skin and my soul.\"\nGlóin let him talk and recognised the fervour of a new lover. He smiled despite himself. It was long years since the sight of a Dwarf-maid all clad in the soft fall of her hair and beard had made his heart stop, but he still carried the memory of her in that moment, his Vilís, the mother of their magnificent son. \"Why the tattoo?\" he asked gently, and Gimli touched it again.\n\"After,\" he said in a voice blurred with sleep, \"after we had spoken long into the night and exchanged words, and embraces, and vows... I made the offer to match his previous suggestion. I felt such guilt that I had wasted months – months! – of our allotted span with such foolish fears. I could give no less than he.\n\"Legolas laughed that bright laugh of his, and nodded. I gathered what we needed, and taught him how to make his mark. Once he had done so, he placed a fresh needle in my hand and told me to make mine. I refused; he insisted. I roared; he kissed me. Our game was done and our competition over, he told me, and I was struck to the heart. I drew my name and the symbols of our line on his skin, and then we laughed and wept like a pair of moon-struck children. Legolas asked me what the runes said. And I told him my name.\"\nGlóin could almost see it – the broad and sturdy Dwarf and the pale, slender Elf, the ink and the needles and the lamplight spilling golden in the depths of night. \"This was in the White City?\"\n\"Aye, after the fall of the Black Gate of Morannon,\" Gimli mumbled, and shook his head. \"That reminds me: I need to design gates. Aragorn needs new gates, mithril and steel, the best that can be forged. Don't let me forget.\"\n\"I won't,\" Glóin said, and squeezed the rough, axe-calloused hand.\n\"Why mark me?\" Legolas touched the skin above his heart with tender fingertips. \"He did not want to. He said it would be a crime to so mar my shining Elvish skin with such a dark and Dwarvish adornment. I had to convince him.\"\n\"Why?\" Thranduil's mind was adrift. \"Why would you wish for such a thing?\"\n\"He wears the leaves and antlers of the Greenwood for me,\" Legolas said, and his eyes grew distant. \"He chose to bear them as penance for his doubts and as proof of his love. I could not have such a thing between us. There need be no guilt, no penance or proof in what we share. I insisted he mark me in turn, to transform his gesture from one of apology to one of love. We both carry the other wherever we may go in this way.\"\n\"Wherever you go,\" Thranduil snarled, and turned his eyes up to his slender son, tall and elegant in the green light of the room. \"Why is he not with you, then? Why are you not with him?\"\n\"He is,\" Legolas laughed. \"Even now I can hear his grumbling answers to all we say! But I take your meaning. He himself travels to his kin in the Mountain, to speak with his family just as I do here. We will meet again soon. He must return to Minas Tirith ere long, and I would begin the work in Ithilien. Then there are the glittering caves of the White Mountains that require his careful hands. Our meetings will be made all the more joyous, and they will never be long apart. I will content myself with the gardens and the work and the sweet anticipation of his tread at my doorstep.\"\n\"You will be apart long years,\" Thranduil said, his anger coalescing. \"He would not give up his caverns for you?\"\n\"No more than I would give up my trees,\" Legolas said, raising his chin. \"I would not ask that of him, nor he of me. But I would share them with him, and gladly.\"\n\"Legolas,\" Thranduil said in a tone of iron, \"this is unheard of, and altogether wrong! You risk your birthright for a creature that will not live an eyeblink in the span of Elvenkind, who will leave you alone for his dark holes and hoarded treasures for years upon years of that short stretch! This is an abomination in the sight of all the Eldar, of Eru Illuvatar himself! What you do is unnatural, evil!\"\n\"Evil?\" Legolas' face became thunderous, his rage a palpable force. When he spoke, his voice was dangerous. \"Gimli, evil? When the Ring of Sauron was placed before him from the hand of a Hobbit, ripe for the taking, he smote it with his axe then and there! If what we do is evil, it is not of his doing. If what we do is unnatural, then let me be swallowed by the sea as Númenor of old! If you must disown me in the name of your disgust and prejudice, Adar, then do so and I will bear it. But you may never call Gimli Elvellon, Lockbearer and my beloved, evil. I have faced the Balrog; I have seen madness in the face of a Maiar; I have passed under the black wings of the Nazgûl. Now I hear foul poison in the mouth of my father! I know evil when it nears me, Adar. Gimli has none of it.\"\nThranduil fell back in speechless horror. \"My son-!\"\nLegolas met his eyes, and some of his towering fury left his gaze. \"This is hard news to hear,\" he said in a calmer voice. \"You speak now from shock and rage and concern for me. I know this, and I thank you for your care. But I will suffer no hard word against Gimli. I would have killed the Lord of the Eorlingas for an idle threat: I will not hesitate to remove myself from your fatherhood, though it rends me inside. I will allow you to think on it.\"\nThe tall Elf, proud and unyielding as a spear, bowed slightly before moving from the room as silently as a ghost. All the air was stolen from Thranduil's lungs, and he placed his head in his hands as the sweet singing from without the chamber rose to envelop him once more, a mocking counterpoint to his dark thoughts.\nThe silence in the bedchamber was warm and close, and Glóin mused for long minutes as Gimli slipped ever further towards sleep. This alliance, strange as it was, made Gimli happier than anything Glóin had ever seen. He could not be the one to step between his son and such joy, not even for long Ages of mistrust and the shadows of old grudges. Not that he could, he thought ruefully. Love of an Elf or no, Gimli was Khazâd through to his bones. He was stubborn, and would not be deterred from the treasure of his heart. No Dwarf would. What use, then, were any protestations? His only course was to accept it. He scowled at the thought of meeting the Elvenking upon these new terms, and then sighed. Gimli had braved dangers and had forgiven slights and bridged prehistoric mistrusts to find his one love. He would not prove a faithless father to his son. He would be civil to Thranduil, though at the first mention of dungeons he would... well, he would say something cutting, to be sure!\nWhere was his rage? Only fifty years ago Glóin would have been crazed with fury, roaring his anger to make the very Mountain shake with it. Ah, but he was old now. Age brought wisdom, or so he'd always been told. In truth, he felt more foolish than ever.\nThe younger Dwarf stirred slightly, and Glóin was thrown from his thoughts once more.\n\"Da?\" Gimli rolled over so that his dark eyes met those of his father.\n\"You should be asleep, lad.\"\n\"In a moment. I must tell you this first. My love for him does not mean I love you less, nor my people. I am the son of Glóin, and a Dwarf of the line of Durin. I take great pride in both.\"\n\"Ah, fool boy,\" breathed Glóin. \"I know that.\"\n\"That eases me, truly,\" Gimli said, and brought Glóin's wrinkled hand to his lips and then to his heart to rest over the Elven symbols that marked him as another's. \"I was afraid of what this news could bring, of what it could wreak in you. I feared your wrath would send me away from my family and my people forever.\"\nHis fearless son, afraid? Of him? Glóin's breath stopped. \"No, Gimli,\" he said, and then he spoke his son's true-name aloud. \"You are my son and you have done deeds that will live in song forever, and I am fair bursting with pride at it. If my son loves an Elf, then... why, then I must learn to be as brave as he is - and accept it.\"\nGimli's eyes warmed. \"Thank you, my father.\"\n\"Fool boy,\" Glóin said thickly, and then leaned over to kiss his lad's brow. \"Sleep.\"\nGimli slept. And, Glóin noticed with an affectionate, sorrowful lurch, he still snored like a thunderstorm.\nThranduil spent long days in his solar, seething.\nLegolas did not approach him, but spoke to his brothers and cousins with loving words. A feast was suggested, but Legolas turned down the notion. \"I would not celebrate my homecoming if my father feels my return unworthy of such an honour,\" he said, and smiled just as merrily as before. Thranduil watched from behind his curtains and from atop his woodland throne as Legolas told his tales of the Quest and of his companions and of the Dwarf. Of their closer companionship, he said no word, and Thranduil raged internally at it.\nFinally, Galion, the wine-soaked old rogue, knocked perfunctorily on Thranduil's door and pushed in without ceremony. \"My King,\" he said shortly.\n\"Leave me, Galion,\" he replied, just as shortly. \"I would have no company.\"\n\"No, none save the wine you drink, night after night,\" Galion retorted in a supremely blithe display of hypocrisy. \"No wonder you are losing him.\"\n\"Of whom do you speak? Be clear, or get out. In fact, do that! I do not want you here!\" Thranduil snarled and lunged towards the butler, but his movements were sluggish from the Dorwinion draught and from days without rest or food. Galion sidestepped him easily and shook his head.\n\"Your son, of whom else would I speak?\" Galion crossed his lanky arms and tutted. \"You are acting like a fool.\"\n\"You know nothing of which you speak,\" Thranduil growled, \"else you would not speak such treason!\"\n\"Treason, is it? Treason, to tell a father to act as one?\" Pouring a cup of water, Galion held it out to his King. \"No matter the discord between you, Legolas is our Prince and a hero of all free folk. He should be celebrated by his people and welcomed by his King. You do him dishonour, and yourself. What I do now is from the promptings of friendship and long service.\"\n\"Dishonour! He dishonours himself, stooping to the level of those... those...\"\n\"Ah.\" Galion sighed. \"So it is the Dwarves again. My King, your guilt should not be taken out on those who had no part in it. You refused to aid the Dwarves against the Dragon to save your own people. Well enough. You imprisoned their party from caution. Again, well enough. Both actions were in our interests, if not in those of the Dwarves themselves. It was long ago for a mortal, and the one Legolas speaks of so often holds no ill-will towards us. Galadriel herself-\"\n\"Do not speak to me of it!\" Thranduil roared, and knocked the cup aside. \"Galadriel herself could not have forseen what could come to pass between my son and the stone-grubber! She would have kept her golden hairs to herself. Better that he had been slain in battle than so befoul Legolas and steal him away!\"\n\"You are not yourself,\" Galion said sadly. \"A friendship is not a theft.\"\n\"The Dwarf,\" Thranduil said, his chest heaving. \"He claims Legolas' love. Legolas has bound himself to it for all his days, and he will not be turned aside by any words.\"\nGalion's jaw dropped.\n\"Now do you see?\" With a bitter laugh, Thranduil turned away. \"I mourn my son, my glorious son, that he must be so sundered from his people.\"\nGalion stared at him for a long moment, before grasping the neck of the wine-jug and slumping beside his King. He let out a long, slow breath and took a long gulp.\n\"Hand it over,\" Thranduil said, scowling.\n\"You've had plenty. I'm likely to need more than this,\" Galion snapped, and pulled at the jug once more. He drank down more than half the wine before wiping off his mouth and sighing loudly. \"Well.\"\n\"I said, hand it here!\" Thranduil snatched the jug back and glared at the old sot. \"You are not the one whose son forsakes his life for a Dwarf. What need have you of wine?\"\nGalion did not answer immediately, but pressed his hands over his face. Then he sat up straighter and said again, \"Well. If there is to be a parting, then there will be a parting. But it can come soon or late.\"\nThe Elvenking fixed his butler with the long, cool stare that Legolas had inherited. \"Explain yourself,\" he said in a dangerous voice.\n\"If there is any sundering between Legolas and his kin,\" said Galion, and deftly filched the wine jug back, \"the time of it will be your doing. You must accept Legolas and his Dwarf if you are to have your son in the years that remain to them, or else never know him again.\"\n\"Accept his Dwarf,\" Thranduil said hollowly, and suddenly the truth of the matter buried him under its great weight. He could lose his son now through his anger and revulsion, or lose him years from now at the Dwarf's death. He sagged, his proud shoulders rounding. \"I will lose my son either way.\"\n\"Yes, or you gain another for a short while,\" said Galion with a shrug and shook the jug beside his ear. \"Empty, a pity. I will get us another. To be sure, your new son may not be all you hoped, but he is from all accounts not without his merits.\"\nAn ache rising within him, Thranduil remembered the tales of the Fellowship that had filtered through to Eryn Lasgalen. Indeed, the Dwarf was not without valour and wisdom.\n\"You have never met him,\" Galion continued, \"Perhaps he is a worthy companion to your child.\"\n\"What Dwarf could be worthy of the life of Legolas?\" demanded Thranduil, though his voice held only melancholy.\n\"Send for him,\" Galion suggested, and rose to cross to the door. \"Find out.\"\nThe butler left Thranduil alone to his thoughts. The Elvenking sat in the deepening twilight, his mind awhirl and his heart sorely conflicted.\nGimli slept for almost a day. Glóin could barely restrain himself from peering in at the chamber door every hour. A great procession of visitors and friends arrived at the door to leave their greetings and good wishes. Dori, Nori, Bofur and Bifur called in quick succession and were followed by Bombur's panting son Bomfur who had apprenticed with Gimli in their youth. The ancient lady Dís sent her regards with a small emerald brooch that had belonged to her father. Many of Gimli's fellow students from his training days with Dwalin also called to leave their congratulations. All were disappointed to learn that the subject of their excitement still slept soundly, snoring as though to wake the dead.\nFinally his daughter, her husband Thrívi (a jeweller from the Blacklock clans of the Iron Hills) and her children arrived, breathless and shouting and joyous. Grisin tutted at the state of Gimli's gear, and her young sons Thesin and Thrísi demanded to know when their uncle would wake. Glóin set them to cleaning Gimli's worn boots and mail, and turned to Grisin and Thrívi with a sigh.\n\"He sleeps still,\" he told them, and eased himself down into a chair. \"He was very wearied. I do not think the past year has allowed for much in the way of rest.\"\nGrisin tugged at her braided beard, her eyes thoughtful. \"Da, is aught the matter? You do not react the way I thought you would.\"\n\"I do not bellow and weep in joy, you mean,\" Glóin replied drily. Then he sighed again. \"Gimli is changed. He has grown deeper and grimmer than he was, and yet wiser and more fair. He has changed, and I have not.\"\nHis daughter looked at him with her piercing dark eyes, the twin of her brother's. \"That is not all.\"\n\"No,\" he allowed. \"But it is all I may tell you, without Gimli's permission.\"\nShe nodded thoughtfully, and Thrívi glanced between them. \"Well,\" he said briskly, jerking his black-haired head towards the kitchen area, \"let us prepare everything for when he wakes. No doubt such a journey has left him hungry as a Hobbit!\"\nGlóin smiled, remembering Bilbo's wasted face and warm smile in the gardens of Rivendell. \"No doubt,\" he said to his practical son-in-law.\nHis other son-in-law.\nThrívi smacked his hands together and nodded to his wife. \"Come on, then!\" he said, and drew her close. \"Let us ease the wait with work.\"\nGrisin eyed her husband with amused exasperation. \"Always it is work with you!\"\nHe pulled her close. \"Not always,\" he murmured into her ear, tucking a ruddy lock behind it, \"but your brother will not wake for our wishing it.\"\nShe rolled her eyes and dragged him to the pantries. \"He always was contrary.\"\nAs Grisin and Thrívi prepared the meal, Glóin gave into temptation and peered into Gimli's chamber yet again. Upon opening the door, he was surprised to see the glimmer of eyes blinking back at him. \"Da?\" came the rumble of his son's voice and the rustle of the bedclothes as Gimli struggled towards wakefulness. \"What is all the commotion? Are we under attack?\"\n\"Yes, we are beset by a horde of savage nephews,\" replied Glóin, and lit the candles to see his son sitting up and rubbing at sleep-numbed lips and eyes. \"What woke you were their dreadful battle-cries.\"\n\"Ah, such fearsome foes,\" Gimli chuckled, and pushed himself from his bed with a limber stretch. Then he pulled on a pair of breeches and shucked the sleep-tunic for a shirt in a rich, deep blue bordered in golden knotwork. Glóin purposely did not avert his eyes from the symbols marked into Gimli's skin that so briefly saw the light. \"Well, let us sally forth and meet the enemy.\"\n\"I warn you, they come armed with food and drink,\" Glóin told him, and Gimli laughed again.\n\"Such weapons may fell the doughtiest warrior! I fear I may be overcome.\"\n\"Son,\" Glóin said then, and put his hand on Gimli's broad and hard-muscled shoulder, \"what do we tell them? About you, and Le... Legolas?\"\n\"Legolas,\" Gimli confirmed, and under Glóin's hand his shoulder straightened. \"I never intended to hide our bond indefinitely, just for a small time. I confess I was more afraid of your reaction than those of Grisin, Thrívi or the lads.\"\nThese words sent a pang through the old Dwarf's heart, but he had to acknowledge the truth in them. His shrewd and perceptive daughter would be overjoyed that her brother had also found his One, the ever-practical Thrívi would remark that there was naught to be done and there was an end to it, and the boys would be far more interested in tales of battle than in tales of love. \"Aye, I can understand that.\"\nGimli's hand rose, and he cupped Glóin's head and brought their foreheads close. \"I will tell the truth, and we will see,\" he said softly. \"If my lord father can learn to accept this, I have naught to fear from any Dwarf living.\"\n\"I can think of a few who may have a choice word or two for you,\" Glóin muttered.\nGimli grinned. \"Doubtless they will tell me I am mad. I leave the telling of the Company to you. Respect for your long years of friendship may halt them from calling me a fool right to your face.\"\n\"So kind,\" Glóin growled. Gimli laughed at his father's surliness and stepped back, scanning the floor.\n\"Where are my boots?\"\n\"Therin and Thrísi have them. I predict they may not be long for this world.\"\n\"Alas for my poor boots. They have done good service and withstood orcs, fire and ruin,\" Gimli said, shaking his head, \"but a horde of nephews may prove too much!\"\nThranduil dressed as though for a funeral, laying out his finest clothes, his most cunning and beautiful jewels, and his fine tall summer crown. He ate sparingly, bathed himself with slow and careful motions, and donned the garb with purposeful movements. Meeting his eyes in the glass, he beheld the King of the Woodland Realm in all his splendour. Then he swept from his chambers to the throne room, his head high even though his heart was ashes.\nAscending the dais, he turned and met the faces of his people. His eldest, Baimellon, inclined his head with concern in his eyes, and Thranduil returned the gesture calmly. Next to him his middle child Tinnuon surreptitiously worried at his lip with his teeth. Then Thranduil turned his gaze to Legolas.\n\"I here welcome,\" he said, and his voice faltered. He steeled himself. \"I here welcome home my son, Legolas Greenleaf of the Nine Walkers, home after his long Quest. May he be celebrated by his people and renowned as a hero of all free folk.\"\nA cheer rose from the throats of the assembled.\nLegolas' eyes were wide, and he took a step towards his father.\nThranduil let all the pride and grief of his heart flood his voice as he continued, \"I would further make it known that his father and King also welcomes his son's companions who shared in his great deeds. May all of Arda witness that Eryn Lasgalen does all due honour to those who so richly deserve it,\" here Thranduil paused, and took a deep breath, though he thought the words might choke him, \"regardless of race or long enmity.\"\nWhispers broke out through his court, but Thranduil only had eyes for Legolas. His face shining like a star, Legolas bowed with heart-stopping grace. When his eyes rose to his father's, they were wet.\n\"I thank you, my father and King,\" he said softly. \"I thank you with all my heart.\"\nGlóin asked and received permission to send Froäc, grandson of Roäc, to the Elves. The raven carried a stiffly-worded, if polite, invitation to one Legolas Thranduillion to visit Erebor and meet his companion's family. His father-in-law and sister-in-law were eager to know him, and Gimli's two nephews, in particular, had many questions. For instance, had he really slain an Oliphaunt?\nThorin III Stonehelm, King of Erebor, was nonplussed. After the conclusion of their business, Thranduil's latest envoy had tentatively enquired after the health of the King's young kinsman so recently returned home from his great Quest. Old Dwalin had scowled so furiously and with such suspicion at the messenger that the poor Elf turned red with fright and worry.\nOutside the woodland realm, where the spume and froth of the River Running met the whispering of the trees and the stone bones of Middle-Earth ran deep and solid beneath their feet, a Dwarf met with an Elf. They embraced fiercely as around them the birds shrieked and cooed.\nAs a Dwarven hand brought an Elven head close and their breath mingled between them, the world slowly began to turn from one Age to another.\nEND"
}