{
    "id": "7903858",
    "url": "https://archiveofourown.org/works/7903858?view_full_work=true",
    "author": [
        "ShanaStoryteller"
    ],
    "title": "Solstice",
    "rating": "Not Rated",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "F/M",
        "M/M"
    ],
    "fandoms": [
        "Naruto"
    ],
    "relationships": [
        "Uchiha Itachi/Uzumaki Naruto"
    ],
    "characters": [
        "Uzumaki Naruto",
        "Uchiha Itachi",
        "Uchiha Fugaku",
        "Uchiha Mikoto",
        "Uchiha Sasuke",
        "Hatake Kakashi",
        "Hyuuga Hanabi"
    ],
    "additional_tags": [
        "Natsu Nami Collection",
        "Genderfluid Naruto",
        "although i guess in this fic it's basically just trans naruto",
        "if you havent read ais this wont make any sense to you",
        "AU of AIS after Chapter One",
        "Hanabi/Sasuke if you squint"
    ],
    "language": "English",
    "series": "",
    "published": "2016-08-29",
    "completed": null,
    "words": "6,797",
    "chapters": "1/1",
    "comments": "131",
    "kudos": "6,522",
    "bookmarks": "1,492",
    "hits": "63,810",
    "summary": "<p>An AU oneshot based off of my fic \"An Invincible Summer\"</p>\n<p>The Massacre was prevented, and some things stay the same, but a lot of things are different. </p>\n<p>Mostly that Natsu ends up with a different Uchiha.</p>",
    "notes": "<p>hi everyone! sorry this took so long, i'm a trashcan. </p>\n<p>once again PLEASE NOTE: this is based off of my fic \"An Invinsible Summer\" if you haven't read at least the first chapter this wont make any sense to you. you can read it here: archiveofourown.org/works/4525815/chapters/10297434</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>i know you're wondering: does everyone ever find out that natsu is also naruto in this au?? the answer is yes they do, but that another fic for another time</p>\n<p>i hope you liked it! as always, feel free to follow / harass me at: shanastoryteller.tumblr.com</p>\n<p>Do not add this work to Goodreads or any similar sites.</p>",
    "text": "It’s the night before Natsu is set to leave for Suna for her chunin exams, and Itachi shouldn’t burden her with this, she’s just a kid. But he doesn’t have anyone else to tell, and maybe the right thing to do, the strong thing to do would be to stay silent, but he can’t. He’s not that strong.\n“Natsu-chan?” he says softly, precariously balanced on her windowsill. He really wishes she’d lock the damn thing.\nHer breathing shifts, then she’s awake, pushing her blanket off of her and dragging herself to her feet. “Senpai?” she yawns, rubbing at her eyes. “What’s going on?” She looks even younger standing there in a too big t-shirt that he’s certain is Kakashi’s, and he almost changes his mind, tells her to go back to sleep and forget about it. But she crosses her room and holds out her hand, “Itachi, come here.”\nSo he does. He sits down at the edge of her bed, and tells her everything. She paces and scowls, and when he finishes she crosses her arms and says, “Well, it’s obvious what we have to do.”\nHe blinks. “It is?”\n~\nThey’re sneaking back out of his house as Root surrounds the home. Natsu’s hand is clenched tightly around his own as they move silently through the forest, and he’s still in shock of what they’ve done, of what she risked for him without a moment’s hesitation.\nThat said, he really hopes that killing Danzo in the middle of the night and committing treason is the worst thing she talks him into. Also, that they don’t get caught.\nSomehow, he doesn’t think her assertation of “Danzo started it” would hold up under questioning.\n~\nShe offered to help with this part too, but he refused. For one, he didn’t want her missing her chunin exam. For another, killing Madara would be dangerous enough but he’s going to try and capture madman, and he doesn’t want Natsu anywhere near him for that part. He’s grateful she’s going to be in Suna – putting a country between them is honestly the only way he can be sure she won’t interfere and give him a heart attack.\n~\nItachi gives it a day. It takes less than that for the news to spread throughout the village. But he slides through the hokage’s window, going into a low bow. “I’m sorry for interrupting, but there’s something I have to tell you.”\nShikaku and Ibiki are there. Good. He’s kept Madara unconscious, but they’re the ones that are going to end up having to deal with him.\nHe’s a loyal shinobi of Kohonagakure. He would have slaughtered his clan if his village required it – he still might, if his father and Sarutobi cannot reach an accord. But maybe – maybe there’s another way.\n~\nThey reach an accord.\nIt is not one that Itachi expected them to reach.\nHe’s in his room, giving in to rare moment of weakness. He sits there with his head in his hands, and for his villaage he would sacrifice everything. Comparatively, this is nothing. And yet, it’s somehow so much more terrifying.\nThere’s a nearly-silent displacement of air, and his kunai is already in his hand by the time he recognizes the chakra signature. “You’re back early,” he croaks. He hopes his eyes aren’t red.\nNatsu throws herself at him, and it’s such a relief to fold his arms around her waist and rest his forehead against her shoulder. “Itachi-senpai! I was so worried, I could barely concentrate the whole exam. I was so scared I would come back, and you would be – I mean that there would be – you know.” Natsu runs her fingers through his hair, and Itachi almost smiles, the closest he’s come since Danzo first approached him.\n“How did your exam go?” he asks.\n“I’m a chunin!” she says excitedly, and she’s the youngest chunin to be promoted in the last fifty years besides himself and Kakashi.\nHe pulls away from her and absently straightens her tunic, “I’m very proud of you Natsu-chan. I knew you could do it.”\nShe beams at him, but grabs at his hands, holding them in her own and refusing to let go. “Senpai. Is everything okay now? With – everything?”\nHe opens his mouth, and this is a secret. Only three people know besides the Uchiha clan elders, and he’s under strict orders to keep it that way.\nBut it’s Natsu. The only reason his family isn’t dead and he isn’t on the run is because of her.\n“I’m going to be hokage.”\nNatsu blinks. “What the fuck?”\nHe doesn’t blame her at all. He had the same reaction.\n~\n“So I heard you’re going to be hokage.”\nItachi freezes halfway through his kata and slowly turns his head. Kakashi doesn’t look up from his book. “Excuse me?”\n“Natsu didn’t tell me, if it makes you feel better.” It does, actually. “Shikaku told me.”\n“He shouldn’t know either,” he snaps.\nKakashi shrugs, “It’s Shikaku. Knowing everything is his job. Or well, maybe that’s Inoichi’s job. Point being, they all know. So they’ll tell the other clan heads out of courtesy, except maybe Hyuuga. Who will tell their heirs.” Dear god, this is all going to spiral out of control so quickly. “I told Gai, by the way. He’ll probably tell Anko, who will tell Kurenai. That is, if she hasn’t already heard from Asuma. Who I’d guess already knows, because his father definitely told him.”\nThis is the worst day of his life. “Did you need something, Kakashi?”\n“Actually, I wanted to thank you.” He finally looks up from the book, and even under the mask Itachi can tell that he’s beaming. “Sarutobi’s been pressuring me to take the hokage position. Now that you’re next in line instead I won’t have to!”\nWorst. Day. Of. His. Life.\n~\nHe’s thirteen, it’s not like they’re going to shove the pointy hat on him and call it a day. No, they’re going to wait. Sarutobi had proposed eighteen, while surprisingly his father had fought for at least twenty one. “The villagers won’t respect a child, Sarutobi. No matter how gifted.”\nThey hadn’t decided. They’d play it by ear.\nSo sometime in the next five to ten years, assuming he doesn’t die, he’s going to be made hokage.\nFuck.\n~\nEveryone starts treating him differently. He’s the shining hope of his clan now, and it’s almost physically painful, how they all look at him. Shinobi who were wary of him and avoided him are now friendly.\nHe hates it.\nHe’s just returned from a mission, and he doesn’t want to go home but he doesn’t want to go to the training grounds alone either. He can’t even be surprised with himself when he ends up Natsu’s apartment. Her and Anko are sitting cross legged on the floor, a large sheath of paper spread out on the ground and a half sketched seal taking up most of it. At first glance it looks like a summoning seal, only – not. He honestly doesn’t want to know.\n“I didn’t mean to intrude,” he apologizes, mentally kicking himself. Natsu’s a chunin now on an indefinite research mission. Just because she’s not with her team or on patrols doesn’t mean she’s free.\nNatsu beams and pats the space next to her, “Come on Senpai! You can help.”\nAnko smirks at him. That woman unnerves him, but she’s certainly not going to start being nice to him just because he’s the next hokage, so there’s that. “Okay.”\n~\nThe next ten years pass thusly:\nSasuke qualifies to graduate from the Academy early at ten years old. Both he and Natsu advise against it. Sasuke listens to them, and one day he’ll lose his starry eyed adoration for Itachi and crush on Natsu, but until then.\nItachi studies, and trains, and there’s no doubt in anyone’s mind he’s the strongest ninja in the village, Sarutobi included. He still doesn’t think he’s ready.\nNatsu becomes a jounin at the age of fifteen. The next day, she takes a C ranked mission to Wave. She comes back two months later the most injured Itachi has ever seen her. She won’t speak to Kabuto for three weeks. Hana doesn’t speak to him for over a month. He never finds out what exactly happened on that mission – he’s already decided his first act as Hokage will be to read that particular mission scroll.\nBut truly, it is a good ten years.\nThen his mother tells him it’s time for him to get married.\n~\n“Aniki is getting married?” Sasuke demands over dinner. Itachi’s frozen and his dumpling is stuck in midair two inches from his mouth.\nMikoto raises an eyebrow, “Your brother is to be made hokage in the next month.”\nHis dumpling falls from his chopsticks and onto his lap. “What?”\n“We’ve put it off long enough,” Fugaku sighs, “Itachi, you’re twenty three years old. It’s time.”\n“But what does that have to do with him getting married?” Sasuke insists. Itachi loves his brother.\n“Our image is very important right now,” Mikoto smooths out the napkin on her lap, “We need to make the right connections. Now, there aren’t many suitable young woman from strong clan families. I personally would have preferred Hana Inuzuka, that relationship you two had was quite nice,” she says to him. Personally, he thinks relationship is a strong word for something that not only lasted less than three months, but also consisted purely of them having sex and complaining about Natsu. “However, she’s the heir to her clan and Tsume won’t be persuaded to name her son instead.”\nSasuke frowns, “Kiba’s a good leader.”\nFugaku clears his throat. It has been a sour point in the household when Kiba had been named team leader and Sasuke had refused to contest it. “Anyway, our options are limited. We’re considering Hiashi’s youngest, in which case of course we’ll simply announce the engagement until she’s of age.”\n“Hanabi?” Sasuke repeats, and he and Itachi make a pointed effort not to look at each other. “She can’t marry Itachi!”\n“Why ever not?” their mother asks.\nItachi tries to think of a way to tell them that Hanabi is heading a coup of the Hyuuga clan without ruining years of work and revealing both himself and Sasuke as conspirators against one of the most powerful clans in Konoha, and fails.\nThe entire thing is Natsu’s fault, and she’s inordinately proud of her scheming little protégé.\n“It’s an unsuitable match,” he settles on finally. “I would prefer a different bride.”\n“Well who would you pick?” his father snaps, “It’s not as if we’re overflowing with options.”\nThis entire thing is giving him a headache. “Perhaps a foreign bride to cement trade relations? From Suna?”\nFugaku scoffs, “As if there’s any need to strengthen our relationship with Suna. Nami has done that quite well herself.”\n“How is that young man of hers?” Mikoto asks, nearly cutting off the beginning of yet another argument about the flighty jounin.\nSasuke puts his elbow on the table and rests his chin on his hands. It’s a testament to how frazzled their parents are that neither of them call him on it. “Gaara is currently engaged to Mei Terumi of Kirigakure. Now that’s a political match.”\nItachi hadn’t known that. “Who’s moving where?”\n“They set up a revolving system,” he answers, “Kiri isn’t stable enough to lose it’s jounin commander, so Gaara will be living there for the next few years. After that they’ll move to Suna.”\n“This must be difficult for them,” he says after a moment, “considering.”\nSasuke shrugs, “Gaara says there’s sand in the ocean and water in the desert. They’ll adapt.”\n“Is Natsu upset?” Mikoto asks. Fugaku’s mouth tugs down at the corners in irritation. This conversation has gotten away from him. “Those two have been dating for over a year now.”\n“Uh, no,” Sasuke says, “She’s the one that arranged it.”\n“Back to the matter at hand,” Fugaku snaps, “Itachi, you must take a bride of respectable station before you become Godaime Hokage. That is an order.”\nSasuke’s eye flash red, but Itachi kicks his little brother’s seat and says, “Yes father.”\n~\nThe next day the Nara heir intercepts Itachi on his way to the mission assignment office, “Team Natsu is returning today. We just got the notice from the border guards.”\nHe doesn’t do anything so obvious as sigh in relief, but he’s tempted. He’d been – upset, when Natsu had been sent on a mission without him. They were partners. They were supposed to run missions together. Now, of course, he understands it’s because they’re prepping him to finally take over as hokage. But that doesn’t mean watching her go off alone had been easy. “Thank you.”\nShikamaru rubs the back of his neck, and a low pit of dread forms in Itachi’s stomach. “According to reports they don’t look so great. Something happened in Kiri. I’m telling you now so you don’t overreact.”\n“I never overreact,” he says automatically.\nHe raises an eyebrow. “Right,” and then shunshins away.\nItachi has a meeting with the hokage that it would be incredibly inappropriate of him to miss. He considers this for a moment, and then turns on his heel and heads to the border.\nHe gets there just as they’re arriving. Natsu is blood covered and limping, her uniform in tatters. Her arm is hanging at an awkward angle at her side, and she’s practically carrying Hanabi at her side. Hinata and Hanabi are equally cut up, although all their limbs seem to intact. However both of them have bandages wrapped around the top halves of their faces. “Their eyes?” he asks, reaching out to help but not knowing where to touch without doing more damage. If enemy ninja have gotten their hands on two pairs of Hyuuga eyes –\n“Intact,” Hanabi croaks, “only damaged. It’s temporary.”\n“Hey Senpai,” Natsu smiles and her mouth is full of blood. Her words are coming out slurred, and Itachi steps closer. If nothing else, at least if she falls she’ll land on him and not on the ground.\n“What happened?” he demands, “This was supposed to be a reconnaissance mission!”\nThey don’t have chance to explain before Kabuto and Hana body flicker besides them. “Hyuuga first,” Natsu commands immediately.\nThey throw her sour looks, but Kabuto gently eases Hanabi from Natsu’s side and his hands flare green. “Why did Sensei name you team leader again? All you do is stick your nose where it doesn’t belong, and then Hana and I have to clean up your mess.”\n“At least she’s conscious this time,” Hana adds.\n“That was one time,” Itachi and Natsu protest in unison. It hadn’t been their proudest moment.\nHana frowns as her chakra coats Hinata’s face. “Kabuto, I think you’re going to have to handle their eyes on your own. Or I can grab Sakura, she has some experience with eye based bloodline limit injuries thanks to Sasuke.”\n“No, that’s fine,” Kabuto says, “You just take care of the muscle tears and skin abrasions and blood loss.”\n“Oh, just those,” Hana mutters, rolling her eyes.\nNatsu sways on her feet, and Itachi reaches out, placing one hand on her good shoulder and the other on the opposite hip. She sighs and leans forward enough to rest her head against his shoulder, and lets him take most of her weight. “What happened?” he repeats. Her hair is streaked with blood, too much of it for it to be her own. He thinks. He hopes.\n“Just a few complications,” she says, and he has to wind an arm around her waist to keep her steady against him. That’s not an answer, but Hana comes over and with a painful sounding crack shoves Natsu’s arm back in place, healing the damage with a wash of healing chakra. It happens so quickly that Natsu doesn’t even think to go “OW! Hana!” until it’s already over.\n“If you don’t like being healed, you should stop getting hurt so often,” the older girl says firmly. “Itachi, take her home, the rest of her injuries can wait. One of us will be over once we get Hinata and Hanabi sorted out.”\n“You’re so mean to me,” Natsu pouts. Hana rolls her eyes and goes back over to help Kabuto. Natsu starts to pull away, like she actually expects Itachi to let her walk home like this, and in one smooth motion he’s lifted her into his arms. Her blood is going to completely ruin his uniform. Well, it won’t be the first time, nor the last. “Hey!”\n“Be quiet,” he orders, although she’s never obeyed him once, and starts walking.\nShe grumbles, but her protests are completely invalidated by the way she curls against him. “My apartment is the other way, you know.”\n“I’m aware,” he says dryly. It should probably be concerning how many people see him carrying his injured partner through the village and don’t even give them a second glance. He carries her through the window of his room, and walks her to the bathroom, gingerly setting her down on the edge of the tub. “You need a bath.”\n“Thanks,” she says sarcastically. But now that she’s not running on the adrenaline of getting herself and two blind Hyuugas home she’s wilting. He runs the water this side of too hot to be bearable, and dumps in the bath salts that he keeps specifically for her.\n“Let me,” he murmurs, taking out a kunai and carefully cutting away her clothes. The sandals are salvageable, so takes those off and slides them in the corner. They’ve treated each other’s wounds and been running missions together for too many years to get embarrassed by each other’s bodies. He offers her his arm and Natsu slides into the hot water, twisting her body so her back’s to Itachi. She unwinds her breast band and tosses it behind her. It lands neatly in the trash. Itachi takes off his shoes and shirt – they’re just going to get in the way. “Natsu, what happened?”\nHer back has deep, long cuts that are about an inch into the muscle. That would be one thing, but they’re black around the edges – burned closed. Natsu is hardly the most skilled with healing chakra, but she’s certainly accomplished enough that she shouldn’t need to cauterize a wound. Which means whatever did this to her was also on fire. “Don’t worry about it,” she says, twisting to dunk her hair underneath the water.\n“Don’t worry about it,” he repeats flatly. Natsu’s an incredibly intelligent woman, and that’s the dumbest thing she’s ever said. She doesn’t answer him, but she does hold out his shampoo bottle. He sighs and squirts it into his hands, beginning the long process of working it into her ridiculously long hair. Her skin is warm and soft and she came back to him alive, which is all he has any right to ask of her. He is, however, sick of cleaning his best friend’s blood from his clothes. The bath water is tinged pink, and the salts have to be stinging her open wounds. But Natsu only leans into his hands and tilts so he can gently wipe the grime from her skin.\nShikamaru was wrong. It’s not an overreaction when Natsu keeps coming back from missions looking like this.\n~\nNatsu is wrapped in on his spare shirts and sleeping in his bed by the time Kabuto knocks on his window. “You know,” he says, gently easing the blanket down so he can get to her wounds, “I just have her keep extra sets of clothes at Hana’s place for when she shows up bleeding and falling asleep on our couch.”\n“Oh, she does,” Itachi confirms. “She has her own drawer of them.”\nKabuto flashes him a grin, “Yeah, she never uses them at ours either. Last time she walked naked from her room to ours to steal a set of Hana’s pajamas instead.”\n“I can hear you,” Natsu grumbles, opening up a single dark eye to glare at them. “Took you long enough. I could have been bleeding out.”\nKabuto rolls his eyes. “Yes, I’m sure,” his hands glow green and he reaches under Natsu’s shirt, running his hands over her and healing as he goes. The discomfort in her face lessens by degrees, until she’s basically asleep again, her breathing deep and even in a way it hadn’t been before. Kabuto runs his hands over her arms and legs, quickly healing other minor injuries and muscle tears.\n“Do you know what happened?” Itachi asks softly as Kabuto drags the blankets up over Natsu’s shoulders.\nHe hesitates, brushing the hair from Natsu’s face. “It’s not my place,” he says finally. “I’ll see you around, Itachi.”\nItachi grabs his arm when he tries to leave, tight enough to break it. “You saw her back. She’s my partner.”\nKabuto scowls and twists out of Itachi’s grasp only to push himself into the other man’s face, “Don’t you dare talk like that to me, Uchiha. Natsu was my teammate for years before joining Anbu, she’s family to me, asshole. Hana and I have seen her in worse shape more times than we can count, and we’ve healed her. Every time. Including all those times when she comes home limping and half dead from whatever insane mission the two of you have been on.”\n“I don’t choose our missions,” he says, because Natsu is one of the most skilled ninja in the village, and one of the few people who can keep up with him. But seeing her hurt makes his lungs constrict.\nKabuto pokes him hard in the shoulder, and Kabuto is another person that doesn’t give a crap that he’s the future hokage. Usually he’s grateful for that, but this time he has to resist the urge to tear off his hand. “Well, what makes you think she chooses hers, dumbass?”\nItachi doesn’t have a response to that. Thankfully, Kabuto doesn’t wait for one.\n~\nHe’s downstairs eating breakfast with his family when Natsu comes down the stairs, bright eyed and moving easily. “Good morning!” she says cheerfully.\n“Good morning Natsu,” Sasuke greets, hiding a smile behind his glass of orange juice. Fugaku is staring and Mikoto’s hand is already half raised to rub at her temples.\n“Didn’t feel like getting dressed this morning?” he asks. He’s long been resigned to this.\nNatsu is still in his shirt, her ash pale hair piled in a messy bun on top of her head. She’s not wearing any pants, her long legs bare as she goes on her tip toes to snag herself a coffee cup. “Well, you ruined my clothes last night! What am I supposed to wear? Your pants are too big on me.” His father turns to glare at him. Itachi refuses to blush. Natsu pours herself a cup of coffee and chugs all of it one go, then pours herself another. “Do you have any plans today?”\n“I’m meeting with the hokage,” he answers calmly.\nNatsu’s nose scrunches and she wanders over, leaning against his back and reaching over to steal some of his bacon. “Bummer. I have to leave on another mission tomorrow.”\nItachi frowns and leans back in his chair so he’s looking up at her, “You just got back. Who are you going with?”\n“It’s a secret,” she stage whispers, eyes wide. Itachi glares at her and she giggles and leans down to kiss his forehead.\nSasuke coughs and puts his napkin on top of his plate before standing, “Natsu, I wear my pants tighter than Aniki. You can borrow a pair of mine.”\n“Thanks Sasuke!” she beams and lets his little brother place a hand on her back and guide her upstairs, coffee cup still held in her hand.\nBoth of his parents are staring at him. He stares back and pretends he doesn’t miss the warmth of Natsu against his back.\n~\n“Are you getting married to Senpai?”\nItachi despairs of ever arriving to his appointment with the hokage on time, and turns to look at the teenager. “No,” he pauses, “Why?”\n“She’s been walking around the village wearing the Uchiha crest,” Hanabi says, “and everyone who’s not an idiot knows your parents are pushing you to get married. Natsu is the obvious choice.”\n“She’s wearing the Uchiha crest because she’s wearing my shirt,” he sighs, “and actually, you were my parent’s first choice.”\nHer face twists. Itachi decides not to be offended by that. “Whatever. Natsu-senpai won’t wait around for you get your shit together forever. You’re lucky she didn’t accept Gaara’s proposal.”\n“Gaara proposed?”\n“Well, he offered to,” she says, “He needed to make a political marriage, and Natsu was a perfect choice. She set him up with Mei instead, but Gaara would have been good for Senpai. They could have loved each other.”\n“What’s your point?” he asks. He can’t believe Natsu didn’t tell him that Gaara offered to marry her.\nShe rolls her eyes. “You’re not her only option. In fact, I don’t even think you’re her best option,” she sniffs. “So I would get your shit together if you don’t want to lose her to someone who’s less of an idiot.”\n~\nThe number of people he can ask this to are limited. It’s a Saturday, so he’s lucky enough to find Kakashi and Iruka together.\n“Itachi,” the Academy teacher says warmly, “Natsu’s not here, if you’re looking for her. I believe she’s with Anko.”\n“No,” he says, gaze quickly flickering between him and Kakashi, “I was just wondering – am I in love with Natsu?”\nKakashi snorts, then drops his orange book to slap his hand over his face in an attempt to muffle what is clearly the beginnings of hysterical laughter. Iruka stares at him as if he’s a particularly slow student.\n“Right,” he nods, “thank you.”\nHe goes to Shikamaru next. He finds the jounin training his brats, which mostly means cloud watching while his genin attempt to kill each other. He bends at the waist so he’s looking the other man in the face. Shikamaru opens his eyes. “I’m in love with Natsu.”\n“The sky is blue,” he responds. Itachi raises an eyebrow. “What? I thought we were saying obvious facts that everyone knows.”\nItachi doesn’t respond to that. Instead he body flickers home to where his parents are pouring over clan lineage books. “I’m in love with Natsu.”\nHis parents share a glance, but don’t seem surprised by this at all. If he finds out Sasuke knew about this and didn’t tell him, he’s going to be down one little brother. “We know, dear,” Mikoto says finally. “You know we don’t approve of her – flaunting herself at you, after she’s already rejected you.”\nHe stares. “She hasn’t rejected me. I haven’t told her yet.”\n“What,” Fugaku blinks, “Itachi, you have to have told her. You’ve been half gone over that girl since basically the two of you met. You call her Natsu-chan!”\n“Well, I wish someone had told me that,” he says, frowning.\nHis mother puts her face in her hands. “Fugaku, he can’t become hokage. Our son’s an idiot.”\nItachi considers getting offended, but he needs their blessing more than his pride. “I want to ask her to marry me.”\n“Good,” Fugaku says firmly, “Take my mother’s ring so she knows you’re serious.”\nToday is a day of surprises. “You don’t have any objections?”\nMikoto huffs and counts off on her fingers, “She’s a special Anbu, arguably the best seal master in the elemental nations, considered a close personal ally of no less than eight major clans. She brokered treaties with three other ninja nations on behalf of Konoha, and is comfortable and trusted enough as diplomat to arrange the marriage of nobles from two other ninja villages.”\n“She’s the perfect choice to be your wife,” Fugaku concludes. “A bearer of your children is nice and all, but a true partner is someone you can share your burdens with. She half runs this village already.”\n“Oh,” he says. He expected this conversation to be a lot more difficult. “Okay then.”\n~\nThere’s one more person he has to visit before he tracks down Natsu. It’s too early in the day for the Flower District to be busy, but a beautiful young man answers the door anyway, robes low around his shoulders to display the koi fish tattooed on his chest. That’s not surpring – what is surprising is the other boy’s dark eyes, pale skin, and very distinctive bone structure. He knows all the Uchiha, and he’s never seen this boy before in his life. “Uchiha-san,” the man murmurers, “I don’t suppose you’re here to sample the wares?”\n“I am not,” he says. “I’m sorry, but are you – you look familiar.”\nHe doesn’t glare, koi don’t do anything as uncouth as glare, but he does somehow give the general impression that he considers Itachi to be worth less than they dirt under his shoes. “You may call me Sai, Uchiha-san.”\nHe knows for damn fact that no one had a kid named Sai. But there’s no way this boy isn’t one of them. But this isn’t what he came here for. “I wish to speak to Madame Koi.”\nSai doesn’t move to let him in. “You know all of your family have been banned from our business. For obvious reasons.”\n“It’s about Natsu,” he says. “Please.”\nSai wavers. Natsu may not work in the brothel, but she wears her koi tattoo just as proudly. “If I’m fired for this, I expect you to find me a rich woman to service indefinitely,” he warns.\nItachi almost smiles, “I’ll do my best.”\nHe’s led through the house, and more than one koi gives him a strange look. They all know Natsu, so they all know him, but they know that Uchiha aren’t welcome here. He’s never had the need to break the rule before know. The man leads him to an oak door, and calls out, “GRANDMOTHER! You have a visitor!” before tapping him twice on the back for good luck.\nHe takes a deep breath before stepping inside. He’s not surprised at all to find a blade pressed to his neck. Madame Koi looks so much like her sister it’s terrifying. Except that Grandma had been happy to remain a moderately skilled chunin at her husband’s side – something the woman in front of him never would have been happy with, no matter her path in life. “I should slit your throat, boy.”\n“Hello Aunt Kiyomi,” he says evenly. “I assume I just met my cousin?”\n“Don’t call me that,” she snaps, not moving the blade. “What do you want? Did your father send you?”\n“I’m not here as an Uchiha,” he says.\nHe doesn’t say anything else. Kiyomi is as intelligent as the best of their clansmen, and it only takes her a handful of seconds to figure it out. “I don’t make Natsu’s decisions for her. I never have.”\n“I still ask for your blessing,” he says. He really does wish she’d put down the sword.\nShe snorts, “Why ask? I’m not the girl’s mother.”\n“You’re the closest she has,” he answers, “Please, Madame Koi.”\n“I don’t make her choices for her,” she repeats, but finally lowers the sword. “Natsu is no fool. If she accepts your offer, then she’ll do it knowing exactly the type of family she’s marrying into. My opinion doesn’t matter.”\n“You did raise her,” he says softly, “You’re not so different from the rest of us.”\nHer face twists and she raises her sword again, “Oh, no, I’m just like the rest of you. I’m just honest enough not lie about what I am.”\nThere’s irony in that, that she refuses to answer to the name Uchiha when her identity is less a mystery and more a high level secret. But he knows what she means. A large part of being an Uchiha is living under a microscope for your village, living under a type of scrutiny that no other clan is put under. It twists people, and maybe Kiyomi’s whole life is a performance – but she doesn’t pretend it’s anything else. “Thank you,” he settles on.\n“Get out,” she answers. She doesn’t lower her sword.\nHonestly, he was expecting it to go worse.\n~\nFinding Natsu, ironically, leads him straight to the Hokage tower. He slides in through the window, and has to blink at the odd group gathered there.\nThere’s Natsu and Sarutobi, of course, but also Anko, Hanabi, and Sasuke. “Shit,” his little brother says, eyes wide.\nThey’re in a circle around what looks like him to a modified portal seal. “What are you doing?” he asks.\nNatsu doesn’t answer. The seal is already glowing, and she slams her hands down on the edges to complete it. Itachi doesn’t know what he was expecting to come out the other side, but it’s certainly not who does.\nOrochimaru and Kisame of the Seven Swordsman are standing in the middle of the office. “Brat,” Orochimaru greets fondly, reaching out a hand to pat Natsu on the head. Anko takes the opportunity to duck under Orochimaru’s arm and snuggle against his side. He obligingly folds his arm around her shoulders and kisses her on the head. “Where’s Kabuto?”\n“He and Hana had an emergency at the hospital to take care of,” Natsu answers, glancing nervously at Itachi. “Do you have them?”\n“My debt is repaid,” he intones dramatically, before unsealing a large blood stained sack and handing it Sarutobi, who takes it with an exasperated sigh. “Those are the heads of all your bounties. Can I go back to running my village now?”\n“I’m head of Torture and Investigation,” Kisame reminds grumpily, “I’m not supposed to leave the village. When I’m not there, Haku is in charge.”\n“Your subordinates must weep with gratitude when you return,” Hanabi says.\nKisame grins, “They do, actually. Underneath all the pretty, that boy is terrifying.”\n“Excuse me,” Itachi says, louder than strictly necessary. “But what the fuck?”\nOrochimaru blinks. “This is the kid we’ve been running around nearly getting killed for?” He looks Itachi up and down and then says to Natsu, “He better be good in bed, because it doesn’t seem like he’s that bright.”\nAnko and Sasuke snort at the same time and Natsu is pulled between exasperated and mortified. “I should have left you crazy.”\nThe missing nin sniffs and attempts to look unaffected with Anko cuddled into his side, “Darling, it’s adorable that you think I’m not just as crazy now.”\n~\n“So what you’re saying,” Itachi says slowly, and he understands completely how Natsu had basically turned Inoichi into an alcoholic, “is that you’ve been systematically taking out missing nin and providing covert aid to other villages … why exactly?”\nHanabi and Sasuke trade uncomfortable looks. “We all know how you feel about war,” Sasuke says, “and I could see how worried you were about taking over, and so could Natsu.”\n“I just helped out because it would benefit the village and Natsu asked me too,” Hanabi shrugs.\nNatsu takes her hair out of its bun and starts braiding it. It’s what she does when she’s nervous. “I didn’t mean for it to get so huge,” she confesses, “but I was going through Danzo’s files, and after I found Sai and he helped me figure out some other things, so I started – investigating, I guess. Then there was the mission to Wave, and that where I met Haku and Zabuza.”\n“Wait,” he holds up a hand, “Zabuza, as in the current mizukage?”\n“No, the other one,” Hanabi snarks. Sasuke kicks her in the shin.\nNatsu smiles, “Yes, that one. That was my idea, I’m afraid, but I think it’s working out well to be honest.”\n“She also found out about Orochimaru on that mission,” Sasuke adds, “Danzo had given him a seal too, and when he died it had mostly degraded. Enough so that Orochimaru was sane enough to track down a seal master that could help – Natsu.”\n“Orochimaru is the Otokage,” Hanabi adds, and Itachi gets the impression that the girl is laughing at him. “In case you didn’t know.”\nWhat the fuck. “Okay,” he says, “so what you’re saying is you’ve all been going behind my back to subtly manipulate and sometimes outright wage war against all the other elemental nations.”\n“Well, it was really Natsu,” Sasuke says, rubbing the back of his neck. “We just helped.”\nIt occurs to Itachi that Natsu is probably the most politically powerful person in the world. He shudders to think about what someone like Danzo could do with her influence. But it’s Natsu, so instead of trying to put herself in a position of power or amassing wealth for herself or anything normal people do when presented with that kind of opportunity, she actively worked to make the world a better place. Because she wanted Itachi to have a village he could lead without worrying, so she changed the world around them to make it safer for their village, at least in part so Itachi wouldn’t have to be afraid about war on his doorstep.\n“Natsu,” he says, and she cringes like she thinks he’s going to be mad at her. He reaches into his pocket, and pulls out a ring, His grandmother’s ring is gold inlaid with sapphires, and he stands and pulls her up with him. “I think this is long overdue. Will you marry me?” She’s staring at him open mouthed, and he ignores Hanabi and Sasuke high fiving behind him. “I know dating first is – traditional, but –”\n“Screw that,” Natsu croaks, “We’ve basically been dating for ten years anyway.”\nShe takes the ring and throws her arms around his neck. She angels their faces together, and he doesn’t hesitate to kiss her back. It’s a rush, exhilarating and wonderful and like falling from a too tall building before the chakra cushions your fall. But it’s also like coming home too, and he’s such an idiot.\n~\nThey get married as week before Itachi is set to officially become hokage. If he’d thought normal weddings were complicated, that had nothing to weddings that not only had guests from multiple elemental nations, but were also hosting three different kages and their high level ninja. Even the Water daimyo had apparently wanted to attend, although she hadn’t been able to for security reasons. She’d sent her sincerest regrets along with a casket of sealing scrolls salvaged from the Uzugakure that had been sitting in the royal library. They were worth a fortune, and she’d just given them to Natsu. Unbelievable.\nThis was all made extra hilarious of course, since besides all the dignitaries and aristocrats Natsu was friends with, the majority her other friends were high class prostitutes. Shikamaru was currently deep in conversation with a young Madame who’d traveled all the way from Water to be here.\nEven Aunt Kiyomi and Sai had shown up, although they were pointedly not speaking to any of the Uchihas.\nHanabi is the maid of honor, and of course Sasuke is his best man. Kakashi is the one that walks Natsu down the aisle, and Itachi knows that her dress was hand stitched by all the koi of Kiyomi’s parlor, as is tradition, and she looks beautiful in it. She always looks beautiful.\nThey get married in front of what feels like half the world. After the wedding and the party, Itachi and Natsu go home. Fugaku and Mikoto had already moved out earlier that week, but that’s not the point of the tradition. His parents bow to him, and he and his wife bow in return. Mikoto hands over the keys to the Main House to Natsu, “This home is now your home, daughter.”\n“I will keep it well, mother,” she beams. As is tradition, Natsu unlocks the door and steps inside, her first steps in this home an Uchiha. Itachi bows to his parents once more and takes a step toward the door.\n“Good luck,” Fukaku says with a wink. Mikoto slaps him in the shoulder, and Itachi follows his wife inside before they can embarrass him anymore.\nThen, finally, a week later he takes the vows he’s been building up to take for a decade, and becomes Godaime Hokage.\nNatsu is at his side, beaming with his ring on her finger. He’s not going to do this alone, he has Natsu – his best friend, the smartest woman he knows, and his wife at his side.\nHe puts the hokage hat on his head. The crowd of villagers and ninja cheer, but he only has eyes for Natsu. Her eyes shine with pride and love, and this life is a happiness he never thought he’d have. He’s not scared anymore."
}