{
    "id": "8024368",
    "url": "https://archiveofourown.org/works/8024368?view_full_work=true",
    "author": [
        "decompositionbooks"
    ],
    "title": "Nu ABO: A Memoir by Park Jimin",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "방탄소년단 | Bangtan Boys | BTS"
    ],
    "relationships": [
        "Jeon Jungkook/Park Jimin",
        "Jeon Jungkook & Park Jimin"
    ],
    "characters": [
        "Park Jimin (BTS)",
        "Jeon Jungkook",
        "Jung Hoseok | J-Hope",
        "Kim Seokjin | Jin",
        "Kim Taehyung | V",
        "Kim Namjoon | Rap Monster",
        "Min Yoongi | Suga",
        "Im Jaebum | JB"
    ],
    "additional_tags": [
        "Alpha/Beta/Omega Dynamics",
        "Alpha!Jungkook",
        "omega!jimin",
        "sort-of-not-really-omega!jimin",
        "pretty much everybody loves jimin",
        "Lots and lots of Pining",
        "A little bit of angst",
        "Mating Cycles/In Heat",
        "Self-Lubrication",
        "Sexual Content",
        "Idol-Verse",
        "Knotting"
    ],
    "language": "English",
    "series": "",
    "published": "2016-09-12",
    "completed": "2017-02-04",
    "words": "34,478",
    "chapters": "6/6",
    "comments": "769",
    "kudos": "19,809",
    "bookmarks": "4,572",
    "hits": "360,108",
    "summary": "<p>The world didn't think it was necessary to give him a guide when it shoved all of these omega hormones at him, so here it is, Park Jimin's handbook on dealing with heats, unrequited love, and Jeon Jungkook.</p>",
    "notes": "<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>DON'T HATE ME, I'M WRAPPING UP \"I'VE BEEN DRINKING\" AND WILL POST THAT SOON.</p>\n<p>I hope you enjoy it! &lt;3<br>I greatly appreciate all kudos, comments, and suggestions.</p>\n<p>Also, please follow me on jiminnieharem.tumblr.com in which I fangirl about Park Jimin and wax on about how everybody loves him <s>probably because he's an omega irl</s></p>\n<p>Shout out to <a href=\"https://spicybara.tumblr.com/\" rel=\"nofollow\">spicybara</a> on Tumblr for being such an amazing person and sending me a rough sketch of the infamous Kitchen scene in chapter one. omg i was so touched, what did i do to deserve people like this.</p>\n<p>check out her sketch <a href=\"https://gyazo.com/8cebb8fae3a042f665277ad20aea308a\" rel=\"nofollow\">here</a>! it's awesome!! and make sure to check out her tumblr too. her stuff is good. like. really good. i'm so proud to be part of such an amazing, creative community of armys.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>oh my fuck. writing is so hard. I know you all waited so long and I'm sooooo sorry because I'm an avid fanfic reader and I hate unfinished works too. My life's been a mess and it's been getting really hard to write. sometimes it just doesn't come out sounding right when you put it down on paper, y'know? i need to hire someone to yell at me to write and to stop nitpicking at every single word. BUT ANYWAY. I hope you're not too disappointed with the way the second chapter is-- the first chapter got so much love and support that i'm worried about not meeting your expectations. OTL</p>\n<p>im sorry if you hate jbxjimin. i didn't tag them as a pairing because SPOILER: nothing really happens to them and they're not a romantic couple. it's not a love triangle is basically what i'm trying to say.<br>anywho, the jaemin (?) moments the fic includes are based on the moments <a href=\"https://chimharem.tumblr.com/post/152658405833/\" rel=\"nofollow\">here</a> and <a href=\"https://chimharem.tumblr.com/post/152145204886/\" rel=\"nofollow\">here</a>. It's so cute. i ship them so goddamn hard (why idek).</p>\n<p>stay tuned for the next chapter!!! which includes special commentary from jungkook!!</p>\n<p>sorry for the angst. yell @ me on chimharem.tumblr.com</p>\n<p>lina (aka spicybara) is so goddamn talented, she drew the shirt-sniffing scene from the second chapter. you can find it <a href=\"https://twitter.com/pocaari/status/800577654315511808\" rel=\"nofollow\">here</a>! Please give her love and support!!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>Sorry it's taking so long. I've been in such a slump lately. I'M JUST NOT HAPPY ABOUT WHAT I WRITE. But it's okay, I'm writing to improve also.</p>\n<p>But yeah, Jungkook's dealing with his Alpha side, Jimin's dealing with his omega side, they're both stupid about their feelings. WHAT COULD GO WRONG??<br>I increased it to 5 chapters because I'm going to upload the next chapter within the week. It'll be very very very short, but it'll set the tone for the final chapter. </p>\n<p>talk to me! <a href=\"https://twitter.com/chimharem\" rel=\"nofollow\">twitter</a> &amp; <a href=\"chimharem.tumblr.com/\" rel=\"nofollow\">tumblr</a></p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>sorry for the cliffhanger.</p>\n<p>double sorry for not being able to update for at least a month. u___u</p>\n<p>but get ready for conflict, resolution, and porn.</p>\n<p>thank you to my wip prostitution crew, as always, and ty to lee for being my ultimate hypewoman with her <a href=\"https://twitter.com/chimharem/status/823950690741456896\" rel=\"nofollow\">promo posters</a></p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">notes</a>.)\n</p>\n<p>thank you so much for joining me on this journey!!! i hope you enjoyed the chapter(s)!!</p>\n<p>i'm auctioning my works on btsrelieffund.livejournal.com. there's a ton of great writers and artists participating, so please be sure to check it out!! the last day for bids is february 7th!! my entry can be found <a href=\"http://btsrelieffund.livejournal.com/2776.html\" rel=\"nofollow\">here</a> but pls be sure to check out other writers' entries as well! it's for a good cause!</p>\n<p>you can find me on <a href=\"https://twitter.com/chimharem\" rel=\"nofollow\">twitter</a> &amp; <a href=\"https://chimharem.tumblr.com\" rel=\"nofollow\">tumblr</a></p>",
    "text": "He must have done something bad in his past life—maybe he was a thief or an Alpha supremacist or something—because sixteen-year-old, brushes-his-teeth-with-two-toothbrushes Jungkook presents as an alpha. He returns from his vacation taller, broader, and surrounded by a thick cloud of alpha pheromones and the hyungs slap him on the back, grinning and cooing, “our cute little Jungkookie grew up.” Jimin forces himself to join them, pulls himself off of the couch in order to congratulate Jungkook but it’s a slap in the face to Jimin who has only ever seen Jungkook as his “little Jungkookie,” when Jimin has turned eighteen and still didn’t pop his knot yet. He’s seen the speculations all over the fancafe—Armys threw their money in the cash pool betting on the outcome, some even going as far as to dig up the genetic tree and draw outrageously inaccurate Punnett squares that clearly confirm that Jimin was indeed homozygous recessive for the Alpha trait. They really only got the “homo” part right.\nEverything changes after Jungkook becomes an alpha. He starts doing weird, supposedly-alpha things like puffing his chest out all the time and collecting definitely-not-unisex scents. He gets bigger too, goes to the gym everyday to put on some size. Worst of all, he refuses to call Jimin “hyung”. Like he doesn’t take Jimin seriously anymore. Jimin just laughs and mutters, “you brat,” ignoring the way his chest falls. It’s different now. It’s not just Jungkook’s height that changes, or his muscles that grow; he gets bolder, a little more aggressive. He also gets too attractive for his own damn good. Jimin realizes that he can’t see Jungkook as a maknae anymore, but as a man.  His crush only grows from there.  When Jimin turns twenty, the cash pool empties out and Armys and Jimin both resign themselves to the fact that Jimin is, unfortunately, a beta. If Jimin were to be honest, he’s okay with it because he’d rather not be one of the lust-driven, hypermasculine Alphas he reads about in the “trashy omega harlequin novels” (as Yoongi calls them). Somehow the beta-ness and his hyung status evens out, makes him not above, but equal to Jungkook. That’s good enough for him.  But no, the ever-loving cosmos decides that Jimin deserves more than being a dime-a-dozen beta. In fact, the world thinks he’s so damn special, it decides to have Jimin, at the young, young age of twenty, present as one of the 6% of omega males in the population of South Korea. Fucking fantastic. The least the world could do is to give him some how-to guide or self-help book, something like “A Guide to Being an Omega Male” or “What to Do When You Present as an Omega and End Up Lusting After Your Bandmate” but all the world gives him is a headache, a heartache, and too many damn hormones.\n \nIt happens about two months after his birthday. A day like any other. They’re drilling the choreography again; they’re about four hours into practice and the room gets stuffy and unbearably hot, but it’s nothing out of the ordinary, even when it’s December and less than five degrees outside. About two hours in, Jimin starts getting a little lightheaded. It normally wouldn’t be a big deal, but his body heats up more than usual and he doesn’t think it’s possible to feel so suffocated in a flimsy cotton T-shirt. And then he feels it—there’s a distinct feeling of slick coming from his lower half. He almost brushes it off as the typical sweat pouring from a grueling practice, but everyone’s heads whip towards him—he hears a choked “hyung” from the corner and Yoongi’s staring at him like he’s sprouted two heads. Beside him, Namjoon whispers with incredulity, “Jimin, y-you’re—” and he doesn’t need to finish because everything comes crashing to a halt and it dawns on him.  I’m an omega.  Then it’s like a switch is turned on and his senses are magnified a thousandfold, like he’s a blind person who’s regained his sight. He smells everything in the room: the sweat on their skin, the makeup on the noonas watching, Yoongi’s campfire smoke, Namjoon’s soft pine, and then something so, so good it makes his head reel. Before he could figure out where the scent is coming from, the room fades to black and the last thing he sees is Jungkook’s wide eyes. In the background, Sungdeuk-hyung calls for one of the omega noonas.\n \nWhen Jimin comes to, he’s surrounded by mounds of blankets and pillows saturated with Hoseok’s scent and he blearily looks up to see the rungs of what appears to be the bottom of his bunk. The room’s bright; not from any lamps but from the gray winter light. He must have been out for a few hours at least.  Across the room, Jimin sees Taehyung’s familiar lump on the bed with an arm and a head sticking out from where he’s cocooned in his blanket. A thumb lazily scrolls through the phone he holds overhead.  “Tae?” Jimin rasps, the sleep not clearing from his throat.\nTaehyung looks over at him, the surprise on his face lit up in blue light.  “You’re awake!”  Taehyung plops down from his bed, wraps his comforter around his shoulders and wears it like a turtle shell. He shuffles over and squeezes himself in the little space left on the twin bed, wiggling as he makes himself comfortable.\n“Tae, it’s hot.”  Jimin whines but makes no move to push Taehyung off.  Taehyung ignores Jimin’s complaints anyway, pulls Jimin into his body and crushes him to his chest.\nAs talkative as Taehyung tends to be, he never really talks about his feelings. It drives Jimin nuts sometimes, makes him think that Taehyung’s just gonna burst one day, like there’s going to be one breath too many and it’s going to pop the balloon. Jimin’s realized though, that Taehyung shows it through other ways, through a not-quite joke, through a soft touch or a small sigh.\nJimin relaxes into the hug, thankful for Taehyung’s quiet comfort.  Taehyung pulls away just as fast though, eyes drooping into something more serious, the way they do when Taehyung finds out Jimin hasn’t eaten all day or practiced with no break in between. Jimin wants to tickle him to get rid of it; he hates seeing that worried expression, hates the coddling that comes after it. It makes him feel weak—makes him feel like he’s not cut out for this industry. His grandma told him back then, that the entertainment industry was an Alpha-dominated world (as though the rest of the world isn’t). Maybe she knew he’d end up an omega, the only one in an all-Alpha family.  “You okay?” Taehyung whispers.  “Yeah, it just—caught me by surprise.”  Taehyung snorts. Understatement of the century.  “Yeah, we were all pretty shocked. I mean, Namjoon-hyung was blabbing on and on about how he should’ve seen it coming, like, ‘no wonder everyone’s so charmed by him’ and ‘no wonder he’s so small’—” Jimin lets out an affronted noise and Taehyung hurries, “—no offense, Jiminie. Anyway, it really came out of nowhere.”  The fan hums lowly in the background while Jimin lets all of the information sink in. Maybe it did explain some things—a lot of the older Alpha hyungs and noonas always seemed to dote on him, cooing about his charm, his “natural aegyo,” and at that time, Jimin didn’t think much of the attention. Namjoon had said that Jimin had some sort of je ne sais quois—Jimin had no clue what the hell that meant, shrugging it off as another one of Namjoon’s big, foreign words that he throws out in order to win arguments. It turns out that the je ne sais quois was his latent omega hormones. Super.  “Earth to Jiminie—”  Taehyung pinches his nose and Jimin splutters, smacking Taehyung on the shoulder.  “What the hell was that for?!”  Taehyung retreats into his blanket cocoon but frees a hand in order to rub Jimin’s forehead and Jimin relaxes, eases into his touch.  “Stop thinking so much,” he murmurs, his thumb moving in small circles between Jimin’s brows, “—you’re going to end up like Yoongi-hyung at this rate, all bitter and pessimistic with life.”  Jimin laughs, shoulders shaking, and Taehyung grins mischievously.  “Better to think too much than not at all,” Jimin shoots back.  “Are you insulting me?” Taehyung gasps.  The big hand that was on Jimin’s forehead flies to his chest and Taehyung clutches it in mock pain.  “I came to comfort him and this is what I get,” he laments.  Jimin rolls his eyes at Taehyung’s dramatics but Taehyung just giggles, cheeks smushed up where he’s burying his face into the pillow.\nThey settle into a comfortable silence and Taehyung scoots closer, nuzzling into Jimin’s side like a child. Jimin’s thankful that biology hasn’t pitted them against each other. He’d miss this too much.\nBut does that mean that things will change between him and Namjoon? Him and Yoongi? Him and Jungkook?\nThe living room door slams open then, and Jimin feels it before he smells it. The minute the door opens, the pheromones roll in like a heat wave and he breaks into a sweat. His body burns up like a fever, skin flushing, heat pooling in his gut. Jimin whines somewhere in the back of his throat and kicks at the sheets in distress. Fuck, he’s burning up. It’s so hot he wants to peel off his skin.\n Taehyung notices the abrupt change and shoots up, droopy eyes gone, hands hovering in the air like he’s not sure whether or not to reach out to Jimin.  “Jimin—what’s going on? What’s up with you?”  Jimin grunts, tearing off his shirt in a daze.   “H-hot.”  “Hot? What are you talking about—it’s like less than 10 degrees in here—”  Taehyung’s voice is drowned out by the pounding in his ears, but dully, Jimin hears him mutter, \"shit- shit, shit, shit” before the bed dips and rises.  “OUT. Get OUT.”  Taehyung bellows so ferociously, it slices through the heat-fuddled haze in Jimin’s head and idly, Jimin wonders who he’s talking to, but he can’t think for long because the heat feels so thick and heavy that Jimin feels the weight of it on his body. There’s a shuffle of noise on the other side of the wall and then a deafening slam that reverberates through the whole bed.\nSlowly, the heat dulls to a low simmer.\nThe bedroom door clicks and Taehyung sighs and shuffles over, flopping down onto Jimin’s bed in exasperation, muttering something about “stupid Alphas” and “put him on a goddamn leash” but Jimin’s too tired to push further. He closes his eyes and sidles closer to Taehyung despite the heat, tucking his nose into Taehyung’s side in order to drown out the scent that just settled in. Something sweet and warm. Like hot cocoa.\nAfter a bit of silence, Taehyung clears his throat.  “Uh, did you… want some alone time or something?”  “Hm?”  “I can leave if you want.”  Jimin opens an eye. Taehyung’s staring up at the rungs, pointedly avoiding Jimin’s gaze.  “What are you even talking about?”  Taehyung clears his throat again.  “Aren’t you supposed to be like, crazy horny right now? Because if you are, I’m gonna go.”  “…Tae… what are you even— the fuck?”  “—I don’t know, isn’t that what happens during a heat? That’s like the basic premise of 70% of the porn that Namjoon watches—” and damned if Jimin didn’t know what he was talking about, because he knows for a fact (i.e. accidentally walking in on Namjoon with his hands down his pants) that Namjoon’s favorite videos involve sex-crazed female omegas begging for Alpha cock.  “Taehyung, I really don’t want to talk about this right now,” he groans, planting his face into the pillow. “And besides, I don’t even know if that was a heat.”  He doesn’t think it is. He’s heard about heats—the way they can drive omegas insane, how they can turn them into nymphomaniacs, into incubi hungry and desperate for sex. Maybe those were just rumors spread by the old Alpha and beta population as a way to scare their children away from “seductive” omegas, to promote Alpha-Alpha, Alpha-beta, beta-beta monogamy or whatever, but Jimin’s sure that a heat—if it does exist—would be more than just a kick to the thermostat. If only the world would give him a damn reference manual so he can confirm it.  “Jimin-ah, I have a right to know what’s going on with your body at all time because if—god forbid—we both end up single, I’m the one that’s gonna have to deal with you.”  Jimin groans.  “Dear lord, not again.”  Taehyung sits up suddenly, posture comically straight, and he eeks out a high-pitched voice that’s supposed to be an imitation of Jimin.  “I, Park Jimin,” he says, palm by his face like he’s taking an oath, “promise to marry Kim Taehyung if we both don’t find someone by the time we’re forty.”  Jimin’s head throbs painfully and he’s not sure if it’s an aftereffect of the heat or whatever it was, or if it’s just because Taehyung’s an annoying piece of shit. Probably the latter.  “Tae,” he intones. “I was drunk. And besides, that’s if gay marriage is even allowed by then.”  Taehyung shrugs, “so we’ll just marry in the U.S. or something,” as though he’s thought about this a million times before, and honestly, nothing ever seems to faze Taehyung. Even back when Jimin drunkenly confessed that he was gay, all Taehyung did was say “okay” before he went on to talk about his dog again. Jimin was so dumbfounded he repeated it again, louder (much to the other diners’ chagrin), clarified that “Taehyung, that means I like boys,” and Taehyung shot back, “I know, I know, I heard you the first time, you have a crush on me, I get it.” (It took a few months for Taehyung to get in his head that Jimin really, really does not have a crush on him, and even then, Jimin’s not too sure.)  Taehyung reaches for him, large hand patting tap, tap, tap against his cheek.  “It’s not the end of the world, Jiminie. So you’re an omega now, so what—?”  Jimin sighs.  “People are gonna treat me differently. Because I’m an omega.”  Taehyung hums to himself.  “Well, I think you can count on us to treat you the same.”\nTaehyung’s a goddamn liar.\n \n Case Study #1:  In the middle of the night, Jimin peels himself from Taehyung and stumbles to the kitchen. The cold is finally starting to settle in but the night sweats had left him dehydrated, waking him up with a parched mouth and a fog in his head. He tiptoes past Namjoon who’s snoring on the couch, long limbs sprawled out on the cushions, and Jimin’s chest tightens a little to see their leader exiled by night owl-Jungkook who stays up too late watching anime and listening to music.\nWith a light touch, Jimin flips on the lowest of the kitchen lights and begins searching through the cupboards for a clean mug.\nThen he smells it again, thick and cloyingly sweet. It smells like home, like his mother’s hot cocoa with a splash of whiskey, and it makes his head spin.\nWhen he turns around, Jungkook is standing by the counter with his hair sticking up in all directions, staring at Jimin with a crazed look.  “Jungkook?” he whispers, careful to not wake Namjoon up.  Jungkook’s expression is wooden, words not reaching him, and he steps closer and closer with dazed eyes, pupils blown wide like he’s stuck in a trance.\nJimin’s heart picks up speed.  “Jungkook, cut it out—this isn’t funny,” he hisses, eyes flitting over to Namjoon who shifts, disturbed but still asleep.  Jungkook takes a few more steps, backing Jimin into the sink until the edge of the counter digs into Jimin’s back.\n“Jungkook, what the hell—”  And then Jungkook descends like a vulture swooping in for prey, neck bent, nose tracing the skin behind his ear, inhaling Jimin as though he’s been underwater all his life and Jimin’s his first breath of air. Jungkook makes a ragged, needy sound in the back of his throat, burying his nose into Jimin’s neck and Jimin’s so sensitive he shivers at the touch, grips the counter so hard his knuckles turn white. Jungkook’s nose travels lower, so gently that Jimin has to close his eyes in order to feel it, but it’s there tracing his vein like a map all the way down to his collarbones, a live-wire he feels from his spine down to his fingertips. Jungkook’s smell is so overwhelming that Jimin has to breathe through his mouth. It makes his skin heat up, sends all of the blood rushing to his brain.\n“Jungkook,” he breathes.\nJungkook continues unflinchingly, arms caging Jimin in, warm body pressed up against him from head to toe, thigh pressing close, so awfully close to him that Jimin could probably grind against it if he just—\nHe shoves at Jungkook, who shakes out of his stupor.\nJungkook blinks, light coming back into his eyes as he sobers up. Expressions play across his face—confusion, realization, distress.  “Jimin, I—” and then he stops himself, mumbles an apology, and flees to his room.  Jimin is left in the kitchen, disoriented, struggling to get his heart rate back to normal. Namjoon mumbles something and turns on the couch.   After a moment, Jimin crawls back into his own bed, water forgotten, hands shaking as he grabs at his sheets.  Jungkook had looked at him like he was a piece of meat; had wanted to devour him. A sick part of Jimin liked it, wanted Jungkook to claim him and eat him up (god, what the hell was wrong with him?). But then Jimin remembers the way Jungkook had looked when Jimin shoved him and brought him back to reality, remembers the panic and the distress on his face like Jungkook couldn’t believe what he had done. Couldn’t believe it was Jimin.  Jimin can’t get Jungkook’s horrified expression out of his head. It makes his chest ache.   He can’t go back to sleep after that, and when he finally does manage to knock out from exhaustion, he has vivid dreams of large hands rubbing his body, gripping him everywhere, his waist, his thighs, his ass. When he wakes up, he’s hard and his boxers are wet like he’s thirteen and experiencing puberty all over again. He peels them off and buries them under the other clothes in his hamper, hoping to god that everyone else’s nose isn’t strong enough to pick up on the scent.\nHe swallows down his shame and cleans himself off in the shower.\nThe milky sweet smell of cacao doesn’t seem to disappear no matter how hard he scrubs.\n \nIn the morning, the hyungs don’t greet him with pats on the back or coos of “our Jiminie grew up” but with some shoulder squeezes (from the alphas) and tight hugs (from the betas) that are meant to be reassuring but feel more condescending than anything.\nWhen they gather for breakfast, Namjoon says with good intention, “you know this doesn’t change anything right? You’re still the same Jiminie to us.”\nJimin grunts around a spoonful of cereal because really, that would have been believable if Jungkook didn’t refuse to look at him all morning. Even from where he’s sitting he can smell Jungkook’s warm sweet smell, so distinct from everyone else’s, and it makes him remember the hot vivid dreams with callused hands running up and down his skin. The thought makes him flush red-hot but his stomach turns.\nJimin hates that he’s been reduced to some hormonal, lovesick mess because his omega hormones decided to focus on Jungkook (Jungkook, for christ’s sake) when Jungkook can just munch on his toast like his smell doesn’t make Jimin’s belly ache. Maybe last night was all a dream—maybe Jungkook didn’t corner him in the kitchen, didn’t lose himself in Jimin’s scent like he imagined, because Jungkook looks entirely unaffected.\nLike Jimin didn’t even exist.\n“Still the same Jiminie,” his ass.\n \n\nCase Study #2\n\nFor as much muscle control and bodily awareness that Jimin has from years of dance, he still manages to trip on goddamn everything.\nUsually he trips over his own feet, falls flat on his ass and just laughs at himself while the rest of the members groan and roll their eyes at him lovingly. But this time, when he so gracefully stumbles over the cables and falls to his knees, everybody comes rushing over like he’s royalty or something and it’s fucking weird.\n“Oh my god, I’m fine.”  “Jimin, take the ice-pack.”  “Namjoon-hyung, I just tripped. I do it all the time.”  “Just put it on your damn bruise so it stops the swelling,” Yoongi says, tossing the pack in his lap.  Jimin throws his hands up in exasperation.  “You guys are ridiculous.”\nThey all crowd around him, pulling him up by an arm and sitting him down in the corner. It’s just Jungkook that stands off to the side, staring at him, but not coddling him like the rest of the members. It kind of hurts, actually—he doesn’t know why. Maybe it’s the omega in him wanting the Alpha’s attention or some twisted sick thing like that. He tries not to think about it.\nJimin ends up having to ice his knees while the others practice the choreography. He gets antsy just watching them and he tosses the pack to the side (he needs to practice and get better, can’t get left behind), but Yoongi just tells him to sit his ass back down. He does so only after he’s made his voice heard, because he really is okay, goddammit, but he can’t win against the members who lord their hyung status all over him (Taehyung is another story).\nWhen Taehyung asks if he needs some aspirin for the pain, Jimin nearly throws the ice-pack at him.\n \n\nCase Study #3\n\nJimin always watches what he eats a few weeks before their comeback. He wants to look good on camera so he eases up the carbs and eats a little less.\nThis time though, it’s nearly impossible because the members keep on shoveling extra food onto his plate when he’s not looking. Seokjin even pretends to be filming some Eat Jin episodes in order to get Jimin to join in when come on hyung, the red light isn’t even on. \nAfter Jimin catches Hoseok spooning some more rice into his bowl, he’s decided he’s had enough.\n“Hoseok-hyung. I’m trying to diet.”  “Don’t do that, I like you with some meat on your bones,” he says over a mouthful of rice.  “Hyung, I’m serious.”  “But you’re so much cuter with some fat in your cheeks!”  He coos and pinches Jimin’s cheeks with one hand but Jimin bats it away in annoyance.  “Are you trying to fatten me up so you can eat me?!”  The laughter he gets in return is a tiny bit alarming, but Yoongi cuts in for Hoseok’s sake and says in that half-scolding tone of his, “you need to eat in order to get energy to practice.”  The others nod in agreement and put some more meat into his bowl. As much as Jimin tries, he can’t find any way to argue against them because they guilt trip him by saying how hard Seokjin worked to make dinner and god, wouldn’t it be a complete waste if Jimin didn’t eat his share?\nJimin grumbles and shovels more of the pork belly into his mouth. Namjoon pats him on the head and praises him with a “good boy” and Jimin kind of hates the way he preens at that.\nJungkook just eats in silence.\n \n\nCase Study #4\n\nBeing one of the 6% of omega males in South Korea means you get attention. A lot of attention.\nWhen Jungkook presented, his name was printed in the newspaper the next day, third line down in a tiny box in the entertainment section.  Jimin gets an entire page.  Hoseok points it out to him during breakfast, a blown-up photo of his grinning face printed in grayscale. Above it, big block letters read “Bangtan’s Park Jimin presents as an omega.” Hoseok reads the article aloud but Jimin has to tune out his voice halfway through because the clear invasion of privacy makes him nauseous. He doesn’t want to know about the reporters that probably lurked around the entertainment studios, sniffing at the hormones in the air. Jimin remembers bumping into one last year as he was leaving BigHit, a round-faced, messy-haired man who sniffed at him and then walked away, seeing (or smelling, to be more accurate) that Jimin wasn’t worth his time.  Hoseok skims through the rest of the article and then clicks his tongue.  “Be careful Jimin-ah, you’re gonna have a line of suitors.”  Seokjin chimes in, “more like an army,” and cracks up at his own joke.\nThey weren’t kidding.\nAfter the article was published, gifts came flooding in: clothes mainly, but there were also a lot of questionable presents that slipped through the first security screening.\nTaehyung never lets Jimin forget about the time he shrieked and threw one of the packages into the air. In Jimin’s defense, he wasn’t expecting to see a 10-inch dildo in the box.  BigHit stepped up their screening process after that.\nYoongi and Namjoon always eye the gifts warily, especially the clothes, a few of which have already been worn and drenched in another Alpha’s scent. Jimin is just amazed at how differently they all smell, like he’s inside a perfume shop and his nose is being bombarded with different notes and oils and essences. It makes him a little lightheaded. Some smelled amazing, like fresh cut grass or spring dew or some other scent he’d probably find in a Yankee Candle store. Some of them made his gag reflex kick in.\nNone of them compare to the smell of hot cocoa.  Jimin hates that it’s the first thought that pops into his head.\n \n\nCase Study #5\n\nDuring his grandma’s time, entertainment industries scoped out Alphas only—maybe it’s because the omega population was larger back then (about ten times the size than it is now) and supply and demand and all. But there’s also the stereotype that only Alphas could survive in a cruel industry like that. It’s complete bullshit, but the effects of it are long-lasting since there’s still a disproportionate number of Alpha idols.\nThis means there are more eyes on him than usual—he might be delusional, but he feels them all watching him during the rehearsal, their gaze a hot weight on his body. Maybe it’s the suit, maybe it’s the new orange hair, maybe it’s his stage presence. Still, Jimin can’t help but to think that his biology’s the correct answer. It leaves a bad taste in Jimin’s mouth. He wants attention because he’s good at what he does—because he earned it. Not because his omega pheromones make people horny.\nBefore they go onstage, one of the newer idols sidle a little too close to him—Jimin doesn’t remember his name (or even his face to be honest), but he does remember the way he caged Jimin in with his body, giving Jimin no room to escape while he waxed on about how much money he has and how beautiful Jimin was and how they were meant to be. Jimin bristles, uncomfortable, not knowing if he should call him out and cause a scene or just grin and bear it until the guy leaves. Before Jimin could respond, Namjoon’s already by Jimin’s side, glaring the guy down. The guy rises to the challenge, cracks his neck and meets Namjoon’s glare, but Namjoon grips Jimin tight and bares his teeth. After a few moments, the guy skulks away, tail between his legs.\nJimin thanks Namjoon by smacking him on the arm.  “Hyung, I’m not some damsel in distress, I can take care of myself.”  Namjoon rubs at the spot where Jimin hit him, whines like a hurt puppy.  “I was just looking out for you,” he says. “You have to be careful around them.”  “Why? Because I’m an omega?” Jimin spits.  Namjoon sighs. He rubs his neck with one hand, embarrassed.  “Jimin, it’s not like that.”  “Then what? Did you think I was seducing him?”  He knows Namjoon means well, but the words spill out before he can bite them back. He’s bitter; he sees the way the betas grip their Alphas more tightly when he walks by, he hears some of the lewd comments Alphas mutter when they don’t think Jimin’s listening. Everyone seems to think he’s some siren, luring sailors to their death.  Namjoon flinches at Jimin’s harsh tone and Jimin apologizes quickly.  “Everyone’s treating me differently and I don’t like it,” he confesses quietly. “I want to be liked for me.”  “Jimin.”  Jimin excuses himself and leaves before Namjoon can stop him, making his way onstage.  He gets a few glances as he heads up; he challenges all of the leers with a polite bow, greets them sweetly. They shamefully avert their gaze.\nAfter the performance is over, they bump into Got7 on the way down.\nNamjoon laughs loudly, bickers with Jackson while Mark and Taehyung chat happily on the side. Jimin sees Jungkook shoving at Yugyeom, doing some weird Alpha posturing where he juts out his chin and squares his shoulders. He acts like an Alpha to everybody except Jimin, like Jimin isn’t even worth his time. He doesn’t growl low in his belly at how cute Jimin is, the way Yoongi and Namjoon do from time to time. He doesn’t initiate skinship anymore. Ever since the kitchen encounter, there’s been nothing.\nWhat the hell are omega pheromones good for if the one alpha you liked wasn’t even affected by them?\n \n\"Oh, it’s Jimin.”  Jaebum greets him with a smile; his smudged eye makeup makes his eyes look more striking than usual. He doesn’t know if Jaebum’s wearing any cologne or not, but he smells good—like a forest right after a spring rain. Some faint woodsy scent. Jimin can’t help but smile back.\n“Good job on your performance today. You looked really good up there,” Jaebum says with his low voice.  “Oh, were you watching?” Jimin grins cheekily.  “It was kind of hard not to.”  Jaebum chuckles deep in his chest and some part of Jimin curls up a little, gets all shy and embarrassed. He looks at Jimin with his sharp eyes, his teasing grin almost wolfish.\n“You’re a bit… different somehow,” he continues.  Jimin tilts his head.  “What do you mean exactly?”  Jaebum takes a step back, surveys him. His gaze trails up Jimin’s body, so slow it makes Jimin flush.  “I can’t really put my finger on it,” he says.  The lights casts a shadow on his jawline, makes it look sharper, more defined than Jimin remembers. Jimin can’t help but to sneak a glance when Jaebum folds his arms across his chest and rolls his shoulders back, looking so broad in his black suit.  “…you just have a different aura,” Jaebum says, low in his throat.  “Do I really?”  “Yeah.”   Then there’s a hand on Jimin’s upper back, pushing him slightly. Jungkook looks down at him.  “We have to go,” he says.  Jungkook bows to acknowledge Jaebum’s presence but doesn’t stay to make conversation. He makes his way over to Namjoon who’s still talking to Jackson. Namjoon’s eyes keep flitting over to Jimin even while he’s talking. Yoongi stands beside them, less abashed about his gaze. Maybe being an omega also means you’re a teenage girl with two dads who chaperon every interaction, who knows.\n“I’ll see you later?”  Jimin refocuses his attention to Jaebum who offers a disarming smile.  “Hit me up sometime,” he adds.  He pulls Jimin in for a hug, his muscles firm and warm against Jimin’s body. It might just be Jimin’s imagination but he swears Jaebum sniffs him a little.\n“Jimin-hyung.”  Jungkook hasn’t called him that in so long, it catches him off guard. Jaebum nods at them both and leaves with the other Got7 members.  When Jaebum’s out of sight, Jungkook says, “you should be careful.”  Jimin bristles. It sounds more condescending from Jungkook than it did from Namjoon. Like Jungkook can’t take him seriously, treating him like a child despite the fact that Jungkook’s younger.  “Because I’m an omega?” Jimin bites.  Jungkook’s jaw stiffens and he stares Jimin down. Jimin refuses to give in, meets Jungkook with his own steady gaze.  “Yeah,” Jungkook says lowly.  Without another word, Jungkook heads to the van.\nFuck it, omega pheromones or not, Jimin’s going to show him just how much of an Alpha he can be.\nWhen Jimin was five, he learned that boys and girls were different, learned it the hard way when he accidentally played too rough with a girl in kindergarten and the teacher scolded “Jimin, that’s inappropriate” and “girls are delicate.” He burst into tears, not understanding what he did wrong, why it was okay for him to play with Junho but not Soomi, why he was getting scolded when Soomi clearly started it, she pushed him down first. The teacher took one look at his tears and told him, “men don’t cry”. Needless to say, his exposure to the standards of masculinity started real young. It snowballed from there, baring its teeth in subtle ways, in his gym teacher’s tsks when he preferred to sit on the bench, in his parents’ raised eyebrows when he told them he wanted to pursue modern dance. They didn’t bat an eye when Jimin wanted to do sword fighting. For whatever reason, they thought sword fighting was a lot more realistic and relevant than modern dance was when, hello, sword fighting’s basically the same thing but with a sharp phallic object.\nA few years later, Jimin learned through a poorly taught sex-ed class (read: abstinence class), that it wasn’t just males and females that were different, but also alphas, betas, and omegas. The teacher had only touched upon omegas briefly, with more than a little disdain, but made it clear that alphas and omegas were on complete opposite sides of the spectrum. Unfortunately, Jimin’s own recent ethnographic research kind of supports the teacher’s argument, says that he differs from Alphas in at least four distinct ways—not including the molecular and anatomical ways of course, but let’s not get into that because Jimin’s sources are probably inaccurate anyway (courtesy of Namjoon’s alpha/omega porn and Korea’s own poor sexual education system).\nIn a nutshell, Alphas were masculine. And, as luck would have it, society claims that being a gay omega male makes Jimin as far removed from masculinity as possible. So of course, the only way for anybody (Jungkook, his mind offers) to take him seriously is if he became a manly, take-no-shit-from-anybody Alpha.\nEasy.\nUnfortunately for him and his efforts in reclaiming his manhood, his dignity, and subsequently his hyung status, what Jimin has in mind goes completely against everyone else’s plans for him.\n\nTrial #1:\nHis size is apparently a dead giveaway for his non-Alphaness.\nIt makes no sense because Yoongi isn’t much taller than him, but the universe has also given Yoongi athletic skills and a deep husky voice—neither of which Jimin has. The coordination that Jimin’s gotten from dance doesn’t transfer over to sports, so that’s out of the question. And when he tries to lower his voice, all he gets is a sore throat and a few laughs from the other members. BigHit always put him on the falsetto notes anyway. Maybe they’ve somehow molded his vocal cords from a young age, unwittingly played with his omega hormone receptors and altered his genome.\nWell, two can play that game. If he can’t do anything to fix his voice or his athletic abilities, he could at least change his height. Sort of.\nTaehyung’s the first to comment when Jimin slips in an extra insole (or two).\n“What the hell—were you always this tall?” he says when he tries to rest his elbow on Jimin’s shoulder only for it to crook up awkwardly. Jimin pretends not to notice and shrugs Taehyung’s elbow off, scoffing, “obviously. Don’t tell me you just noticed now.”\nTaehyung looks at him, scrutinizes something on his face, and then he says, “can I see your shoes for a second?”\n“What?” Jimin blinks, caught off-guard.\n“Take off your shoes.”\nJimin’s cheeks burn.\n“No.”\n“Jiminie-hyung.”\n“I said no.”\nTaehyung breaks into a grin and then he tilts his head slightly, gears churning, completely unfazed. His eyes flash like he’s got something planned, the way they do when he’s about to jump scare Hoseok or tickle Jungkook. Jimin takes a step back out of reflex.\n“You asked for it,” Taehyung singsongs.\nThe next thing Jimin knows, he’s on the floor with an oof and Taehyung is straddling a leg, holding one of the shoes like a victory torch. Jimin slaps him repeatedly on the back to get him off, “Tae, you’re crushing me,” but Taehyung doesn’t even wince, too used to the abuse.\n“Knew it,” he says, pinching one of the insoles between two fingers. He flops it around like it’s a dead fish and gives Jimin the most unimpressed look.\n“Really, Jiminie?”\nJimin’s face reddens in embarrassment and he shoves Taehyung off of his lap. “We weren’t all blessed like you,” he grumbles, snatching the insole and stuffing it back into one of his loafers.\nTaehyung frowns then, not replying, just sitting cross-legged in his stage outfit, watching Jimin tie his shoelaces like it’s the most interesting in the world. Jimin can’t get used to that yet—the way everybody seems to stare at him like he’s an art exhibit, entranced by his every action. When Jimin finishes knotting the laces into a tiny bow, Taehyung gets back on his feet and pulls Jimin up by a hand. He starts dusting Jimin off, circling around to brush off the rest of the invisible dirt.\n“I like your height,” Taehyung mutters. “You’re no fun to hug when you’re tall.”\n“I’ll have you know, I’m just as much fun to hug, tall or not.”\nAs if to prove his point, Taehyung latches his arms around Jimin’s waist and pulls him back into his chest. The squeeze around his stomach is so tight and sudden it makes Jimin wheeze.\n“See? You fit all wrong.” Taehyung spies Jungkook sitting in the corner, occupied with his phone and ropes him in with a “right, Jungkook?” and Jungkook’s head shoots up from where he was studiously studying his screen, eyes big and wide like a deer caught in headlights. It’s endearing and cute and so not-Alpha that Jimin’s chest tightens. It reminds him of his “maknae Jungkookie,” of their younger days when hormones didn’t turn things to shit.\n“Y-yeah,” Jungkook replies. And then he straightens himself out and says, “But if he doesn’t wear insoles, then I can’t see him.”\nThe fucking audacity. It’s like being an omega means the two years (2130 bowls of rice) he has above Jungkook are gone.\nTaehyung cackles loudly, right in Jimin’s ear, and Jimin takes the opportunity to wrench himself away from Taehyung’s strong grip. He leaves with a huff, making sure to send Taehyung his best annoyed look, but all Taehyung does is give him a dopey-looking grin.\nJimin’s learned the hard way that being an omega means you’re as threatening as a teacup bunny.\n\nDespite Taehyung’s protests, Jimin leaves the insoles in. It doesn’t seem to be a problem. In fact, he’s fifteen minutes away from performing, so close to getting away with it—but then Hyunjoo-noona calls him with a “Jimin-ah” from across the room, standing imposingly with an arm folded across her chest, beckoning him with her other hand. Her small red lips droop as he walks over.\n“What are you doing?” she scolds with a hard voice.\nJimin blinks owlishly at her but she just quirks a well-groomed brow and flits her eyes down to his shoes. She reminds him of his mother sometimes. Maybe it’s the alpha side in them both, the way their eyes seem to watch him like a hawk. Nothing ever seems to get past them.\nStill, he tries to milk it for as long as he can, answering her with a petulant, “I don’t know what you’re talking about.”\nShe gives him a cool stare.\n“Don’t you dare lie to me, Park Jimin,” she says, exactly like his mother.\nHe pouts, grumbling, “why can’t I add an extra one? It’ll look fine for pictures.”\nShe just quips back at him, “Jimin, use your height to your advantage\"  and Jimin can't suppress a scoff because what advantage? Being able to fit in small spaces? Having to jump in group photos in order to be seen? Getting picked on by the maknae?\nJimin protests, argues that the insoles aren’t a big deal (seriously, it’s just a few extra centimeters) but she doesn’t budge, just plays with the chandelier earring peeking out from underneath her bob. After a moment, she purses her lips and says, “we’re doing something differently this era.”\nJimin counters, “Different how? Like me not being allowed to wear insoles different?”\n“Yes,” she replies.\n“Why?”\nAnd then she gives him a dead stare, tired eyes peering up from behind her dark eyeliner.\n“You really want me to spell it out for you?”\n“Yes. Please.”\nHyunjoo-noona pinches her nose bridge for a second and furrows her brows. Jimin’s seen this before, when Namjoon accidentally ripped one of the stage outfits right before they went onstage, when Taehyung fidgeted too much in her makeup chair and she had to redo his eyeshadow for the fifth time. It happens when she’s about to reach for a pack of smokes, when she’s moments away from Hyunjoo: Uncut and Uncensored. As expected, she lets out a long, chest-heaving sigh and says, “Jimin-ah, you’re an omega. You can’t be more of an alpha than your hyung,” and even without saying his name, he knows she’s referring to Yoongi.\nJimin does his best to look like a kicked puppy, complains and (shamefully) tries to aegyo his way out of it. Her face softens a little (the omega pheromones do come in handy sometimes), but just when he thinks he’s won her over, she sticks out a manicured hand. Jimin groans and toes off his shoes.\n\nLater, he learns about the “advantage” on Twitter, when he sees Armys squealing about how small (underlined, bolded, in all caps) he looks standing next to Namjoon and Taehyung and Jungkook. Jimin’s not that much smaller (it’s just a few centimeters for crying out loud), but it must fuel some protectiveness instincts in everybody because all he sees is the word “precious” and “cute,” and, well, if it makes the fans happy, he’ll work with it.\n\nTrial #2:\nSince he can’t fix his height (or his vocal cords, or his tiny hands, or his goddamn genetics), he can at least put on some muscle. Bulking up would be a straight shot to manhood. Nobody can mistake him for an omega if he looked like he stepped off of the front page of a Men’s Health magazine.\nIt’s too bad the universe chooses to leave out one tiny detail:\nOmega hormones have an adverse effect on muscle mass. (And facial hair. But it was already pretty hard for him to grow it out before the omega hormones hit, so maybe it’s just a Jimin-thing.)\nHe notices this inconvenient little fact about a month or so into his new lifting routine, when Jungkook seems to grow biceps at twice the rate that he is. It’s really unfair, especially since Jimin takes his diet much more seriously than Jungkook does (the kid practically lives on junk food). Jungkook can eat nothing but bags of Banana Kick and still bench press more than Jimin can on a good day. At this point, Jimin doesn’t even care about getting the same body as “muscle pig Jungkook” anymore. He’d be content with getting his debut muscles back, as fluffy as it made him feel. Unfortunately for him, debut Jimin was young and yet to be pumped full of omega hormones so it’s ten times harder for newly-presented Jimin to get even close to No More Dream-Jimin. Right now his upper body leaves a lot to be desired, but his ass and thighs seems to grow much faster than before. Jimin tries not to think about the possible evolutionary benefits of that.\nIt doesn’t help that the gym’s no longer a safe space for him. He didn’t notice it before, when he was living a false life as a beta, but as an omega, he’s come to realize that the gym is the watering hole of the Alpha community—the amount of competitive tension and testosterone in the weight room practically turns the place into a college sports bar. Which means the minute Jimin steps foot into the gym, it’s like a rabbit walking into a wolf den. The grunts get ten times louder and everyone starts flexing in the mirror like they're bodybuilders.\nThis time, Jimin ignores all of the eyes on him and makes his way over to the squat rack, only for the top-heavy, beanie-wearing Alpha on the nearby machine to approach him. Without asking, the guy puts the plates on the barbell for him, slides the green 10KG ones on both sides and Jimin’s right eyebrow twitches because he could lift at least four of those, thank you very much.\n“Are you gonna do my workout for me too?” Jimin blurts, hiding his annoyance behind a smile.\nThe guy has the decency to flush a little at least, and he mutters, “I just thought it’d be nice to help out. Don’t want you to get hurt.”\nJimin chirps a “thanks,” forces a grin and then puts on two extra plates on either side.\nThe guy keeps on talking though, leaning against the rungs of the power rack with an arm propped up, obviously flexing as he chats Jimin up. Jimin answers politely and gives the guy half-hearted laughs while he gets himself situated underneath the barbell, trying to tune out the guy’s humble-brags about “powerlifting on the side” and being able to “bench twice your weight if you wanna try”. Before Jimin could even start on his set, another Alpha in the power rack beside him comes lumbering over, black-gray tattoo peeking through the armhole of his muscle tee.\n“This guy botherin’ ya?” he asks Jimin, head jerking towards the guy with the beanie. Jimin doesn’t even have a chance to say anything before the other guy snarls back, “I was just helping him out, what’s your problem?”\nTattoo guy takes it as a threat, growls and shoulders himself forward. “Seems like you were bothering him to me.”\nTheir chests both puff out as they size each other up and Jimin’s reminded of a nature documentary he saw when he was young, of some male elephant seals wailing and thrashing their bumbling bodies against each other. Jimin always thought the clumsy flailing looked ridiculous, like hippos trying to do ballet, but the monotone humdrum of the narrator said that the fighting always ended in death.\nWith a resigned sigh, Jimin heads to the next empty squat rack, ignoring the stupid display of dominance behind him. He hitches the plates onto the barbell, clips them in place and then starts on his set, only for the sound of bickering to stop. Jimin looks up from where he’s squatting to see the two of them surreptitiously staring at his ass in the reflection of the mirror.\n\nOh for the love of—\n\n“Jimin-hyung.”\nAnd of course, it’s Jungkook, who has a penchant for showing up at the most inconvenient times.\n“What do you need?” he grunts, securing the bar back onto the rack.\nJungkook just shrugs and rubs the back of his head with an arm but then drops it quickly as though he caught himself doing something he wasn’t supposed to. He rolls his shoulders back and says nonchalantly, “just thought you’d want a spotter or something.” He looks entirely non-threatening in his large T-shirt and baggy gym shorts, but his presence is enough to deter the other Alphas who leave the squat rack to look for some easier prey. Thank god for the little things.\n“I’m good, thanks,” Jimin says, settling back under the barbell.\nJungkook looks lost for a minute, his head whipping around as though he’s not sure what to do with himself. He nods and leaves, only to return shortly after with a pair of dumbbells that he uses for some bicep curls. He sets them down on the floor first, shakes his arms out before he picks them back up and starts on his set, huffing with every rep, contracting his biceps slowly, neck and jaw tensing as he lifts the dumbbells. Jimin pointedly ignores the fact that Jungkook’s curling 30’s which is almost twice the weight of the ones that Jimin normally uses.\nJimin is four reps in when he realizes he’s stopped watching his own form in the mirror and is instead entranced by the way Jungkook’s arm muscles flex and the way his veins pop out in blue-green rivers down his forearms. Jimin almost fails pushing the weight back up because his body feels weak and loose-limbed all of a sudden. He can’t tell if the heat in his chest is arousal or jealousy or what, but he does know that Jungkook’s presence is distracting. Jimin’s not a child for god’s sake, Jungkook doesn’t need to stand right beside him, Jimin can survive without a chaperone at the gym because he’s clearly been doing that for the past five years of his life. And yet, Jungkook has been making it a point to go at the same time Jimin’s been going, always doing his own thing but never really staying out of sight, just hovering somewhere in Jimin’s peripheral like Jimin’s delicate and might break a nail or something. Jimin can deal with rude Alphas himself—he doesn’t need Jeon Jungkook to come to his rescue like some buff knight in shining armor. What kind of hyung would he be?\nStill, Jungkook’s at least started calling Jimin “hyung” again, started doing it about a month into Jimin’s Alpha Mission, so maybe Jimin’s getting a little bit closer to earning Jungkook’s respect back.\nWith a breathy grunt, Jungkook switches to some shoulder raises and Jimin can’t help but glance down at his hips, at the strip of skin that flashes every single time Jungkook lifts the dumbbells in front of his chest. The air around Jimin gets hotter, and Jimin feels the sweat pooling, dripping down his neck. Jungkook is far enough that Jimin can’t smell him too much, but after two more sets of the shoulder raises, the velvety sweet smell of cacao gets stronger and stronger and— does physical exertion and sweat increase pheromones or something? Because the smell starts clouding his senses, blurring his vision and fogging his head, and it’s too much, he can’t take it, he can’t even focus and he really doesn’t want to learn firsthand what would happen if you put an aroused omega in a room full of testosterone-pumped Alphas.\nHalfway through his set, Jimin re-racks the barbell with a clatter and leaves. He mutters a goodbye to Jungkook but can’t look him in the eye.\n\nAbout four months after starting the lifting routine, he’s managed to get some of his muscles back. He’s not as buff as he was during the debut years, but it’s still a pretty decent size even with biology working against him.\nIt doesn’t get the approval of Sunghyun-hyung or any of the other stylists.\nThey take one look at Jimin’s muscles and instead of praising him, they frown.\n“Jimin-ah, let’s go with a different image this time,” Sunghyun-hyung says in his soft melodic voice.\nSungkyung-noona pokes her cheek with a tongue, eyes Jimin up and down like he’s a block of clay that she’s figuring out how to sculpt and she nods, agreeing with the others. “Yes, something softer.”\nThey give him a soft fuzzy sweater, one that doesn’t quite fit him, hem dipping below his waistline, sleeves blanketing his hands. He looks in the mirror and sees himself engulfed by the fabric, tiny head floating above the neckline, fingers barely peeking out underneath the sleeves. He looks like a girl who borrowed her boyfriend’s sweater. What was the point of working so hard to get these damn muscles if the stylists cover them up anyway?\nWith her long nails, Hyunjoo-noona tousles his hair and makes it cover his eyes, bangs falling softly over his forehead.\n“Much better,” one of the noonas coo, “you look so much cuter now.”\nJimin looks over to where Jungkook’s sitting, wearing a nice leather jacket that’s true to his size. It makes his shoulders look good, leather stretching over his arms until Jimin can see the bit of definition there.\nJimin hates it. This is discrimination, it’s got to be. Omegas have the right to be manly hyungs too.\n“Aw Jiminie, you look so cuuute- c’mere—” Hoseok makes grabby hands at him from the couch and pulls him down into his lap. He pinches his cheek, pokes him everywhere with a finger and Jimin flails in his hold, trying to get away from Hoseok’s wriggling fingers.\n“Hyung—” he gasps when the fingers poke at his ribcage “—hyung, stop- stop—” With a heave, he breaks free, smoothing his sweater down and glowering at Hoseok who’s looking awfully smug and only a little bit disheveled. “You’re not really helping me with my manly image right now.”\nNamjoon says in passing, “masculinity’s overrated,” but Namjoon’s an Alpha, what would he know?\n\nSure enough, Armys fawn over this too, loving the way he’s swallowed up by the sweaters, the way the fabric makes him look soft and huggable. They rave about the “sweater paws,” the way the sleeves drape over his fingers when he holds onto his mic. The comments say they want to eat him up because he’s all cute and squishy like a rice cake, like manggaddeok, which should not be the case since he has muscles, thank you. And besides, where was this same infatuation when all of the other members wore sweaters?\nShortly after the pictures go around, Jimin starts getting boxes and boxes of sweaters in the mail, all of the clothes designer and two sizes larger than his own. The ones that smell like another alpha are tossed, largely due to Yoongi and Namjoon’s complaints of it “stinking up the room” (which is fine since he doesn’t really want to wear someone else’s clothes anyway), but all of the other ones he keeps. He wears them because they’re gifts from his fans and they’re cozier and warmer than he’d like to admit. It also gets the members to fawn over him, especially Seokjin, who rubs his face into Jimin’s fuzziest sweater and calls Jimin his own personal blanket. Jimin hates the attention and loves it at the same time (stupid omega hormones messing with his brain).\nThe sweaters drop his masculinity by a few points, but who cares anyway? It’s winter and the long sleeves keep his fingers warm.\n\nTrial #3:\nEven if he can get himself to look like an Alpha, he can’t get himself to smell like one.\nThat’s because he doesn’t know what it means to smell like one exactly. They all smell so different—it’s like some invisible fingerprint each one of them has, a tag that allows him to recognize Alphas out on the street. He doesn’t really smell anything coming from betas (and thank god for that or it’d be like living in a perfume shop everyday), and from what little he learned from that abstinence class, betas can’t really smell the differences between Alphas and omegas either. Even so, they at least know what smells bad to them and omegas will always, always smell good. Seokjin definitely proves that right, judging from the way he sniffs and gnaws at Jimin’s shoulder like Jimin’s some kind of chewtoy.\nJimin has tried smelling his own clothes, sniffed his arm to see what his own fingerprint is, but all he gets is the salty tang of sweat and skin. Apparently, everyone else gets something different because their eyes kind of glaze over when he walks by. Namjoon’s one of them—he dazes out when Jimin’s talking and scoots closer to him when they’re all sitting on the couch. Yoongi has a bit more self-control but Jimin still catches him staring at him from time to time. He catches Jungkook watching him the least, but when he’s lucky, the fancams show Jungkook's big eyes peering at him from the sidelines. He doubt it means anything though.\n\nJimin remembers to ask the members about his scent when they’re all gathered around a camera screen after some group photos. Namjoon ends up bumping right into Jimin and smothering him with his looming figure and normally Jimin doesn’t mind all the skinship, but three Alpha scents in one contained space is a little overwhelming, especially since Jungkook’s chocolate is already muddling his senses and Namjoon’s heavy pine just keeps getting stronger and stronger for some reason. It’s like someone waved the scent right in Jimin’s face. When Jimin hears a clear sniff right above his head, he instinctively jerks up from where he’s kneeling and the top of his head bashes against Namjoon’s jaw. Namjoon recoils with a whiny “ow”.\n“Namjoon-hyung, what were you even doing?” Jimin grunts, rubbing the sore spot on his head.\nNamjoon looks away sheepishly, the ruddiness of his cheeks matching the red of the impact blooming on his jaw.\n“Sorry. That was kind of weird. You just smelled good.”\nNamjoon gives him an embarrassed grin and then pats Jimin on the head apologetically, being careful not to press too hard on the crest of his skull.\nLater, Jimin pulls Namjoon aside. Namjoon’s eyebrows draw together in concern when he sees the way Jimin’s fidgeting with his sleeves and Jimin doesn’t even know why he’s so nervous—it’s not like they’re discussing sex or porn or something. Get yourself together Jimin, stop acting like an omega.\n“Hyung,” he forces out, “what do I smell like?”\nFor someone who spouts about sex positivity and can watch porn in public without batting an eyelid, Namjoon gets a little red in the face. He can’t even look Jimin in the eye, just scratches his jaw with a hand and mumbles, “I can’t really explain it. You just smell good. Really good.”\nJimin’s not satisfied with the answer because duh, he figured that out himself when he had to push away the third camera guy that got a little too close.\n“But good like what? Cologne good? Laundry detergent good?”\nNamjoon huffs. “God- Jiminie, you’re really putting me on the spot here.”\nHe sucks his cheeks in and then after a bit, he says in a strained voice, “you smell like… caramel. Or like milk candy. The kind that Sungkyung-noona usually keeps in her purse.”\n\nGreat, so he’s basically a walking bakery.\n\n“It’s more than that though,” Namjoon continues, rubbing the back of his neck with a large hand. His eyes dart towards the ceiling as he shuffles the words around on his tongue. “It’s probably the pheromones. I don’t even like those sweet smells but something about your scent’s just— it’s like Alphas are starving men and you’re this giant buffet placed in front of them. You’re kind of hard to resist.”\n“So Alphas want to eat me. Got it.”\nNamjoon opens his mouth to protest but then he knits his brows together.\n“I guess that’s not exactly wrong.”\n\nThey don’t sell Alpha-in-a-bottle so Jimin has to improvise. He douses himself in cologne that should at least blur out the blinking billboard sign that flashes “eat me, I’m an omega” to any Alpha within smelling distance of him. The cologne definitely smells like man, like a smelly potpourri of musk, patchouli and the inside of the men’s locker room, all packaged in a sleek black bottle.\nIt doesn’t work. The oils don’t counteract his intrinsic omega-ness. All it does is make Jungkook and Sungkyung-noona sneeze. Hyunjoo-noona grabs him by the wrist when he goes a little overboard with the spray one day, nails digging into his arm as she pleads, “no more cologne.”\nAfter her insistence that the staff are gonna have to swallow allergy medicine by the handful, Jimin throws the bottle away.\n\nJimin asks Yoongi about his scent a few days later when Jimin ends up lying on the couch next to him, waiting for the shower to open up. With each passing minute Jimin’s eyelids are growing heavier and heavier. It takes all of his willpower to keep his eyes open; any longer and he might just knock out right here on Yoongi’s shoulder, shower or not. He blames it on the calming scent of Yoongi’s smoke and teakwood that wraps around his body, lulling him to sleep. Ever since he presented, he feels different around Yoongi and Namjoon—they have a comfort to them that Hoseok and Seokjin, and even Taehyung don’t have. It’s probably the Alpha pheromones soothing the restless omega blood inside of him (stupid biology), but if that’s the case, then he shouldn’t be feeling this jittery nervousness around Jungkook. His head shouldn’t be cloudy at the smell of him and his body shouldn’t feel so hot and cold all at once.\nRight when Jimin’s about to doze off, he feels a nose digging into his temples and a sniff that happens with no stealth whatsoever. It jolts him awake and he jerks away from Yoongi, laughing with embarrassed shock.\n“Hyung, were you… were you sniffing me?” Jimin rubs the side of his head absently, still feeling the warm imprint of Yoongi’s nose on the side of his skull.\nYoongi squints and has the nerve to look affronted.\n“I was just rubbing my snot on you, don’t feel so flattered.”\nJimin knows it’s bullshit but he lets it slide—\n“So what do I smell like, anyway?”\n—kind of.\n“I don’t know,” Yoongi grumbles, “I’m sick and I can’t smell a thing.”\nJimin whacks him with one of the sofa pillows.\n“You’re such a liar. You were just fine at dinner.”\n“I mean it, my nose is all stuffed up.”\nYoongi coughs exaggeratedly.\n“See?” He throws in an extra cough. “I’m sick.”\n“Hyung, that’s a cough. If you were really sick—”\nThe bathroom door clicks open then and Yoongi springs up with a jerky movement, exclaiming, “shower’s open, I’m next.”\nJimin shouts after him, “don’t shower too long or you’ll get sick!”\n“I’m already sick!” Yoongi yells back with a very non-sick voice.\n\nJimin doesn’t know he fell asleep on the couch until he’s woken up by a wet towel dropped on his face, courtesy of Yoongi and his undying love for Jimin.\n“You’re next,” Yoongi grunts, picking the towel back up and rubbing it through his wet hair. “Jungkook stole your spot real quick but he’ll be out in a second.”\nJimin bats him away, trying to get in as much sleep as he can, but the door creaks open and Jimin forces himself to get up before anyone else steals the shower. He yawns and drags his body off of the couch, shuffling his way over to the door, still drowsy from his ineffective nap. When he bumps into Jungkook, it’s like a caffeine rush hits him. He wakes up in an instant.\n“Sorry, hyung,” Jungkook mumbles, “all yours.”\nJimin nods dumbly and maneuvers himself around Jungkook, closing the bathroom door behind him. Big mistake. He unwittingly trapped himself in here with Jungkook’s rich, milky sweetness, the scent clinging to the humidity in the air and underlying the perfume of shampoo. He must be going crazy, he must be, because Jungkook’s not here but he keeps smelling this stupid chocolate smell.\nAnd then he sees it, Jungkook’s white shirt swung over the towel rack, hastily stuffed in the crack between the metal bar and the wall and, fuck, he reaches for it without even realizing what he’s doing. He has half a mind to berate himself—a voice in his head is shouting at him, chanting Jimin, dont do it— don’t do it don’t do it don’t do it but he does it. He fists the shirt in his hands and breathes it into his lungs. Jimin can’t stop the whine that bubbles up in the back of his throat. Namjoon’s and Yoongi’s scent relaxes him, rolls tension off of his shoulders like a warm blanket and a hot cup of tea. But Jungkook’s—god, Jungkook’s was like a high, like some drug pumped into his veins that got his blood rushing and set his nerves on fire. Jimin wants to bathe in the scent, wants to be covered with it and burn it into his skin. This was wrong. So fucking wrong. It takes all of Jimin’s self-control to tear himself away enough to shower. It’s not just an omega thing—it can’t be. It’s a stupid-crush-on-Jungkook thing, with his omega hormones as the cherry on top.\nTen gallons of water later, Jimin finally manages to cool down. Jimin’s feet and fingers are pruny by the time he emerges from the shower and he quickly towels himself off, only to get distracted again by Jungkook’s shirt still hanging innocently on the towel rack.\nJimin takes one last shameful whiff and it breaks him.\n\nTrial #4\nWhen you’re an idol, you have to be conscious of every single muscle movement. You watch the way you smile and control all the nervous tics of your body because you have to prepare yourself for a life on camera. After nearly three years of it, it’s not hard for Jimin to fix his own body language anymore. Now he uses that knowledge, makes it a habit to catch himself doing non-Alpha things. When he notices that he’s shrinking in on himself, he puffs his chest out and makes himself look bigger than he really is. He manhandles his members to show everybody that he’s not a shy little omega who can get walked on. He reasserts himself with an arm slung over everyone’s shoulders, never mind that Taehyung’s about a head taller. He does the same to Jungkook (only after plugging his nostrils), making it clear that his position hasn’t changed, omega or not.\nNo one calls him out on it, especially because a lot of it’s cut from broadcast anyway, but he’s pretty sure it gets Jungkook’s attention because Jungkook doesn’t fight it. He dutifully calls Jimin “hyung,” doesn’t look at him head-on like before. His gaze lowers every time Jimin looks at him and he pulls himself in, becomes softer, reminding Jimin of “maknae Jungkookie,” and it hits Jimin like a punch in the gut because Jimin realizes this is not what he wants at all. For fuck’s sake, he knew it- knew it when Jungkook hungrily breathed him in, knew it when he buried his nose in Jungkook’s hanging shirt with a sob- knew it from the start, because the minute Jungkook walked through the door reeking of “alpha,” Jimin no longer saw him as a little brother. Jimin deluded himself into thinking that’s what he wanted, put on a little Alpha show thinking that he can be a hyung again, told himself that he just wanted to get Jungkook’s respect as a dongsaeng back but who’s he kidding? He doesn’t want Jungkook to see him as a hyung or as an alpha.\nHe wants Jungkook to see him as a man.\n\nIt hits him especially hard when they’re at the opening of the KBS music festival and Jungkook is joking around with Yugyeom again, shoving at Yugyeom when he says something stupid, slinging an arm around Yugyeom’s shoulder. Jimin can’t even pay the crowd any attention because he’s too busy flitting his eyes over to them, studying their easy smiles and casual touches. Jimin’s throat tightens when he watches them. It makes something in his chest constrict, squeezes the air out of his lungs, but he just can’t stop looking out of some deep-seated masochism, doesn’t stop watching even when his brain’s taunting him, telling him look at what you can’t get. The distance between hyung and dongsaeng is wide already but the distance between Alpha and omega is even wider.\n“Hey, what’s with that face?”\nThere’s the smell of cool rain and a warm hand on his shoulder and Jimin tears his eyes away from Jungkook to see Jaebum standing next to him with a sharp grin.\n“Nothing,” Jimin replies with a smile, “just got distracted.”\nHe must have known what Jimin was looking at because his gaze flickers over to Yugyeom and Jungkook briefly. He quirks an eyebrow and says offhandedly, “they’re close, huh?”\nJimin’s stomach drops and he strains some words through his closed throat.\n“Yeah. They are.”\nAnd Jaebum’s throwing his arms over Jimin’s shoulders, pulling Jimin into him until Jimin’s back is pressed flush against his firm chest. Jimin’s heart skips from shock, his blood races, not because he likes Jaebum or anything (he doesn’t think), but because Jaebum walks a fine line between “familiar alpha” and “strange alpha” and Jimin doesn’t know how to deal with it. Jimin’s used to the comfortable, domestic touches of Yoongi and Namjoon and can ignore the bawdy approaches of alphas he doesn’t know, but Jaebum’s neither of that and it makes him nervous. The fresh iciness of Jaebum’s scent confuses him.\n“Hope your dads are okay with this,” Jaebum whispers. The warm puff of his breath against Jimin’s ear makes him shiver.\n“My dads?” Jimin breathes.\n“Namjoon and Yoongi-hyung,” he chuckles lowly.\nThe tension eases and Jimin relaxes with a small laugh. When he glances up, sure enough, he sees Yoongi’s stony face observing them from a distance. He seems to motion something to Namjoon because Namjoon turns around also, watching the two of them intently. He lifts an eyebrow but doesn’t say anything.\nA few more seconds and the opening ceremony’s over. When the MCs are done talking, Jaebum’s hands lower to Jimin’s wrists. He grips them tightly and brings Jimin’s hands up to make him clap like a marionette doll and then his hands drop and the heat radiating against Jimin’s back is gone. Jaebum stands in front of him smiling with teeth that look sharp and blindingly white under the stage lights.\n“See you after the show,” he says, patting Jimin’s arm. He dips his head and bows to Yoongi and Namjoon before he heads to the other side of the stage, tugging a distracted Yugyeom behind him.\nNamjoon sidles over once Jaebum’s gone, escorting Jimin off the stage with an arm on his lower back.\n“Don’t say it,” Jimin tells him under his breath.\nNamjoon turns to him, bewildered.\n“Say what?”\n“You know what.”\n“No,” Namjoon stresses, “I don’t.”\n“I mean the lecture about protecting my virtue or something. Or staying away from dangerous alphas.”\nSomething flashes across Namjoon’s face, his face looks pinched for a second, but it passes so quickly Jimin might have imagined it.\nNamjoon shakes his head minutely and sighs.\n“Just be careful. People are watching.”\n\nPeople?\n\n“The media doesn’t know I’m gay,” Jimin contends, “it’s just skinship.”\nNamjoon explains, “I don’t mean the media.”\nJimin’s blood freezes. He doesn’t understand. Is he caught in the middle of a courtship he doesn’t know about? Does Jaebum have a jealous beta on the side?\nHe’s about to ask for clarification but Namjoon just shakes his head again, guiding Jimin back to the dressing room. Jungkook glances at them when they walk in but he quickly shutters his eyes and turns the other way and Jimin willfully ignores him too, cheeks blooming with shame when he remembers the bathroom incident, the way he needily gulped in Jungkook’s scent. He’s going to ignore this, beat his feelings into submission if he has to. Jungkook doesn’t need a shameless hyung who lusts after him because he can’t get some stupid hormones under control. It’d be the biggest breach of trust and Jungkook doesn’t deserve that.\nAfter getting dressed, he makes up his mind and walks over to where Jungkook’s sitting on the couch, stage makeup done, hair artfully styled. He’s so handsome in his fuzzy sweater, Jimin can’t help but to conjure up domestic fantasies of cuddles on a winter day, a mug of hot chocolate in the cold, drunken giggles from imbibing too much whiskey and Kahlua. He chases the thoughts away.\n“Jungkookie,” he says. It feel foreign on his tongue and Jungkook must think so too because he blinks up at him, staring back with a dumbfounded face. Jimin grimaces. He shouldn’t have let it come to this point. It was never supposed to be this awkward.\nJimin clears his throat and pats him on the shoulder. “You’ll do great,” he says. “No one can sing Yanghwa Bridge as good as you. Not even Zion T.”\nJungkook’s mouth falls open but clams shut just as quick. There’s a hint of a smile tugging at his lips when he says, “thanks hyung,” but it looks odd somehow. It looks stiff. It doesn’t reach his eyes.\n“Good luck on your solo too. You’ll do great,” Jungkook says in his smooth voice.\nJimin ruffles Jungkook’s hair without even thinking and Jungkook looks up with a sad smile.\nIt’s better this way.\nJungkook wakes up one night in a hot sweat—his body always ran hot but something’s different this time. Something’s off. There’s some residual shame burning deep in his gut, like he dreamed something he wasn’t supposed to, and when he closes his eyes, he can see hazy snapshots of it, of some person underneath him on all fours, twitching around his cock and gasping filthy phrases. Jungkook still feels the heat of the words; his cock is hard and aching and the burn is coiling low in his belly. He just wants to get himself off, do it quick so he can go back to sleep, but when Jungkook reaches a hand down, he feels something that wasn’t there before.\nHe shoots up out of bed, heart pounding, head racing, and he thinks, “oh my god, I’m deformed, it’s a tumor, I’m gonna die.”\nIt’s not until he pulls the blankets off that he realizes what it means, and the implications of it makes his stomach roll.\nHe doesn’t see it coming, never imagined it would happen to him. He’s awkward and dorky and quiet and doesn’t have Yoongi’s stoic, masculine calmness or Namjoon’s wise, quietly-commanding presence. If he had to place a bet on anybody it would have been on Jimin—short-tempered, flirty Jimin whose stage presence fills up a room. But god, it’s him, of course it’s him, he’s not called the goddamn Golden Maknae for nothing.\nNo one seems to be as surprised as he is, which makes him think that everybody seems to be in on it, like it’s some elaborate prank he doesn’t know about. He’s just waiting on Taehyung to pop out somewhere and say “got you!” as though it’s a long con he’s been planning for months, complete with a realistic-looking knot at the base of Jungkook’s dick. (Jungkook’s not going to question how it managed to get there. Taehyung could do anything he sets his mind to.)\nBut it’s true. He’s an Alpha. Even a fake prosthetic knot couldn’t give him super smelling senses overnight. It’s obvious when he wakes up and smells his father’s musty scent permeating through the halls of the house. He can’t smell anything from his mother or his brother, probably because they’re both betas, but his dad’s smell is practically soaked into the walls, penetrating the wood and marking the place as “home”. It’s the same when Jungkook comes back to Seoul and opens the door to the dorms—he’s hit by the overwhelming scent of smoke and pine and figures it’s the pungent scent of one of Yoongi’s bath bombs, trickling in from the bathroom. It’s only when Namjoon and Yoongi greet him at the door that he realizes the scents belong to them. The other hyungs pile in soon after, greeting him with hugs and pinching his cheeks. Taehyung puts him in a chokehold, gives him a noogie and growls, “of course it’d happen to you, you lucky brat” and Jungkook laughs, elbowing Taehyung in the stomach in order to escape.\nAnd then Jungkook looks up and sees Jimin sitting on the couch, hair all mussed from sleep, pulled out of bed just for this occasion. Jimin’s looking at him with an odd look on his face, like Jungkook’s a lock he’s trying to pick, a jigsaw puzzle he’s trying to put together. His brows are furrowed, lips turned down the way they do when Sungdeuk-hyung shows them a dance move that Jimin just can’t get. It’s weird because Jimin’s always the first to coo over him, to sing “my cute little Jungkookie” and ruffle Jungkook’s hair like he’s a little kid. But he’s not this time and Jungkook’s not sure what to make of it. It feels odd. Unnerving.\n“Jimin-hyung. Hi,” Jungkook offers. Jimin blinks and his eyes refocus, back from whatever daze he was stuck in. With a tiny shake of his head, Jimin pushes himself off of the couch.\n“Congrats, Kookie,” Jimin says. He pats his shoulder and something in Jungkook’s stomach tightens. He had expected Jimin to throw an arm around his neck, to fawn over him like the others did, to say embarrassing, mushy things and provoke him until Jungkook gets so fed up with it he ends up shoving at Jimin in annoyance, tweaking his nipples in order to shut him up. Instead, Jungkook gets this, some half-assed congratulations, the equivalent of a gas station birthday card.\n“Thanks,” Jungkook returns with a tight grin.\nJimin gives him a half-smile, patting him on the shoulder a bit more before he excuses himself, claiming a headache he needs to sleep off. If the other hyungs think something’s off, they don’t mention it. They just rub Jimin’s neck and tell him to sleep well.\n The next day, Bang PD-nim calls Jungkook into his office to congratulate him on his newly-found alpha status. Jungkook’s sucking on the little mint candies that Bang Sihyuk keeps on his desk when the man suddenly leans forward in his seat and tells Jungkook through steepled hands that Jungkook needs to play up his alpha traits. Jungkook spends the rest of the time trying to clear mint-flavored spit from his trachea.\n“Alpha idols are popular for a reason,” Bang PD-nim says, handing over a box of tissues. Jungkook takes one, coughs a “thank you” and waves off the rest of the box. “Think of it as a new image we’re trying promote, for the Dark &amp; Wild era.”\nEverything becomes white noise after that. He remembers nodding a few times and answering everything with “yes sir’s”, but all he could think about was how the hell he was supposed to “play up his Alpha traits” when he’s probably the most defunct Alpha to have ever existed. Taehyung could be a better Alpha than he could, which is saying a lot because that guy is as domineering as a puppy, i.e. not at all. Or maybe only a bit.\nJungkook doesn’t have to worry about it much longer because somehow, his body solves that issue for him.\nTaehyung is the first victim. He commits the horrible crime of interfering with Jungkook’s victory when he yanked the controller out of Jungkook’s hands. “Hyung- what the hell!”\nTaehyung gleefully smashes some random buttons and sends Jungkook’s character on a misguided rampage, and when Jungkook tries to lunge for it, Taehyung just veers away from him with ease, cackling the entire time. The slow simmer of irritation starts creeping in under Jungkook’s skin, bubbling and roiling until Jungkook finally feels the heat of it in his fingertips. “Hyung— give it back—” Taehyung just laughs deep in his chest, one hand keeping the gamepad out of Jungkook’s reach, the other one skillfully rotating the analog stick of his own controller, leading his character to victory—and Jungkook honest to god growls and bursts forward, agitated, wrestles Taehyung to the ground and forces him in a headlock.\n“Okay-okay I’ll stop!” Taehyung gasps, kicking his legs, neck caught in the guillotine of Jungkook’s arms. Taehyung doesn’t sound apologetic yet so Jungkook doesn’t let go, won’t do it until he really regrets it.\nJimin steps out of his room at that moment, freezing when he sees them all tangled up in each other, and for some reason Jungkook’s face warms up, blushing in shame, as though Jimin’s about to tell him off in his mom-voice, “Jungkook, don’t fight with your brother”.\nBut Jimin just wheels himself around, spinning right back into his room and closing the door behind him, and Jungkook, stupefied, lets Taehyung go.\n“That was weird,” Taehyung wheezes, massaging his neck with a hand.\nJungkook doesn’t know if Taehyung’s talking about him and his sudden flare of aggression or if he’s talking about Jimin, but “weird” is definitely it.\n The “weirdness” manifests slowly, steadily. He catches himself jutting his chin and puffing out his chest like a peacock, finds himself addicted to certain scents and smells. His temper’s cut short, his blood runs hot, and his competitive streak somehow runs even hotter, and Jungkook feels strange, foreign, like he’s just inhabiting this body, like it’s not him that snaps at his hyungs (it can’t be, he wouldn’t do that because Namjoon and Yoongi raised him with their own two hands for fuck’s sake). He thinks he’s going crazy because there’s this wild burn at the pit of his stomach, something primal in him that flares and flames up when someone’s overstepping their boundaries. He can’t sleep because of it. He’s scared that the embers will blaze up and erupt in a flash of heat, that it’ll scorch and devour him whole.\nAnd god, the dreams. They’re worse than the ones he got during puberty. They all feature him pinning someone down, marking them and pushing them into the sheets. Jungkook never sees their face, doesn’t know if it’s a girl or a guy; it’s just a lightly muscled back, shifting and flexing while Jungkook takes what he needs. It’s always so rough and hard and fast and it just seems so wrong, like he’s forcing someone into this, but his body betrays him and gets aroused, knot swelling up every time he dreams of it. It makes him not want to sleep at all.\nAfter another sleepless night, he brings it up to Namjoon, asks if all Alphas are holding on to this thin thread of control because he’s gripping his so tight it’s cutting off his circulation. Namjoon’s face is fond when he explains, “all humans have that, Jungkook,” and seriously? Everybody feels like this? Like they don’t even know who they are? Don’t know right from wrong, don’t know if these thoughts are really theirs?\n“Yeah,” Namjoon says, “Freud says we have something called an id, it’s your instinct, your impulse—”\n“So everyone’s got this bad side? Even Mother Teresa? Even like, Gandhi or something?”\nNamjoon’s expression twists and he sighs wearily, “I wouldn’t call it bad. Just because it’s primal doesn’t mean it’s bad.”\nBut somehow it feels that way, because everyone treats him differently. Jimin treats him differently. Ever since he presented, the casual, doting touches don’t come. Jungkook gives it a week or two but Jimin doesn’t snap out of it. He doesn’t blatantly flirt with him in front of the camera as much, doesn’t sing “Jungkookie” in search of him like he used to. He never thought he was looking for Jimin’s attention—he just got it without even trying, it came so easily that Jungkook took it for granted. But now it’s gone and Jungkook’s confused, doesn’t know what he did wrong.\n \nAfter dinner, Jimin leaves with Hoseok to go to the studio, something he used to do with him, and Jungkook can’t suppress his hurt.\n“Hyung,” Jungkook says to Seokjin when they’re on dishwashing duty, “do you think—” he reorganizes his thoughts, “—has Jimin-hyung said anything to you?”\n“About what?” Seokjin asks, scratching his face with a gloved forearm.\n“I don’t know. Was just wondering.” Jungkook lowers the temperature of the faucet when Seokjin’s not looking, trying to save his skin from the pelt of the scalding water. Alpha or not, he still doesn’t have Seokjin’s mom hands. Seokjin doesn’t even notice, just starts humming a tune that Jungkook can’t make out while Jungkook shuffles the words in his mind until it becomes a little bit more coherent.\n“You don’t…” Jungkook clears his throat, “don’t you think Jimin-hyung’s been acting a bit weird lately?”\n“Not particularly.”\n“I mean towards me. You don’t think he’s any different?”\nSeokjin purses his lips and looks at him with the concern of a grade school teacher. “Jungkook,” he sighs.\nThe faucet still runs. Seokjin’s nose wrinkles up, hands unmoving on the soapy plate, and then he says decisively, “don’t mind him, you know he can be pretty temperamental.”\nThey continue washing the dishes. Seokjin says something barely audible over the running water, it takes Jungkook a while to realize that it’s directed to him, but Seokjin’s eyes flit to the side and he says lowly, “it might be different now that you’re an Alpha. He doesn’t know where he stands with you.”\n“—then wouldn’t you be the same?”\n“Let’s be real here,” Seokjin says with a huff, “you’ve always been disrespectful to me even though I’m the oldest.”\n“Not my fault you don’t act your age,” Jungkook mutters, not so quietly.\nSeokjin glares and flicks soap water at Jungkook with his long fingers and Jungkook laughs, wipes his wet hands on Seokjin’s sleeves and remarks, “you’re just proving me right.”\n“I don’t know why I put up with you,” Seokjin grumbles.\nJungkook responds, a little too smug, “because you love me,” and Seokjin jabs him in the ribs with an elbow, the exasperation coming off of him in waves. “Put this in the damn dishwasher,” he says, which Jungkook takes as, “yeah, I do love you, you brat.” They finish the rest of the dishes without a word; Seokjin’s back to humming that unnameable song and Jungkook’s distracted, thinking over every single interaction he’s had with Jimin since he presented.\n“So Jimin-hyung feels weird because I’m an Alpha?” Jungkook asks, breaking the silence.\nSeokjin shrugs lazily, “don’t take my word for it. But yeah, I mean, you’re not a kid anymore. No matter how much you act like one.”\nJungkook sprays him with the sink hose in retaliation.\n The easiest way to get Jimin to talk to him is to tease him. Jungkook knows for a fact that the only thing shorter than Jimin’s fingers is his temper (it gives Alphas a run for their damn money) so it’s not difficult to get Jimin riled up. All Jungkook really has to do is a) forget his honorifics and b) comment on Jimin’s height. It’s successful at first and Jungkook can’t suppress his glee, smile cramping up his cheeks because Jimin is responding and fuming cutely when Jungkook refuses to call him “hyung”, lips pouting and feathers all ruffled. But Jungkook doesn’t know if he’s pushed too far because one day, Jimin says in that whiny, petulant tone of his, “it’s like you don’t even respect me anymore.” Jungkook doesn’t know how to respond because Jimin has this way of talking sometimes that’s part-joke, part-truth—the members don’t know they’re doing anything wrong until they poke too hard, until they shake him and Jimin bursts like a bottle under pressure, storming off only to come back half an hour later, all-smiles as though nothing even happened.\nBut he keeps doing it, keeps teasing and provoking Jimin because even that tiny bit of attention is better than nothing. The conversation doesn’t flow as smoothly as before, but Jimin’s not ignoring him at least. He’s starting to think that Seokjin might be right after all, because Jimin keeps watching Jungkook, studying him, always catching Jungkook in the act of doing another heinously Alpha thing, commenting when Jungkook brings more nicely-scented things home, staring when Jungkook can’t keep his temper in check. Seokjin’s words keep resonating in his head, about Jimin not viewing him as a little kid anymore—which is good, right? Because he wants Jimin to take him seriously, can’t have him be the doting older brother forever. He wants them to be equals at one point. Or at least, have Jimin to view him as something a little more serious than just a “dongsaeng”.\nJungkook gets more than he bargained for.\nTwo years later, Park Jimin presents as an omega and what little control Jungkook has is shot to shit.\nHe just remembers running through the eight-count for the hundredth time that day, trying to sharpen his moves but unable to keep his eyes off of Jimin who’s also watching him through the mirror. He tries to pull his gaze forward, focus on himself, but then he smells something, it’s milky and buttery sweet and every part of his body just pricks up, electrocuted, and god where is that coming from? Yoongi must have sniffed it too because he’s standing at attention and his head jerks over, turned to where— Jimin is.\n“Jimin, y-you’re—” Namjoon gasps, and Jimin looks over with wide eyes and flushed cheeks, catches Jungkook’s eyes briefly, and Jungkook gasps a “hyung” without even knowing, air punched right out of his lungs.\nJimin goes down like a bridge, collapsing to his side, and Jungkook instinctively lunges for him only to be held back by a strong grip on his arm.\n“Down, boy,” Yoongi says, fingers digging into Jungkook’s biceps. Jungkook’s muscles tense up, ready to throw a punch, blood searing in his veins from being challenged, but Yoongi’s grip doesn’t loosen. He fixes his gaze on Jungkook, lets Jungkook play out all of the tension in his body until he finally slumps and caves in with a weary sigh.\n“Sungdeuk-hyung’s got him.” The hand that was on his bicep travels up, strong and warm, massaging the back of Jungkook’s neck. “He’s fine,” Yoongi says.\n But Jungkook’s not. Fuck, Jungkook’s not fine at all, because there’s a fishhook in his stomach and he keeps getting reeled in by Jimin and his stupid, stupid smell. It happens first when he stumbles back to the dorm, feeling disoriented and completely overwhelmed when the milky sweetness hits him—all he could think about was getting closer, breathing that scent in and tasting it. He’s trekked across the living room without even realizing it, his consciousness lighting up only when Taehyung pops up in front of him, guarding Jimin’s room with a wild look on his face, growling and bellowing at Jungkook more ferociously than a mother bear. Jungkook is so stunned he flees, tripping over his shoes on the way out.\nIn the hallway, Jungkook sags against the door, heart beating hummingbird fast. What the hell? What the hell was that? Is this what the movies and TV shows talked about? The irresistible smell of an omega?\nJungkook shakes his head, trying to clear his thoughts, forget about it, it’s nothing. He heads back to the studio to kill some time.\n In the middle of the night, it happens again. He hears a door creak open and then he’s pulled away from his laptop because this stupid smell just hits him like a ton of bricks, bypassing his nose and going straight for his blood. He can’t think of anything except for getting more and more of that high, tears himself out of bed like a chainsmoker needing another cigarette. And then he blacks out, his body’s just moving on pure instinct, moving on that stupid fucking id, hunting down that sweetness until he finds it in the form of Park Jimin reaching for a mug in the kitchen. He must have made a noise because Jimin turns around, eyes wide and pretty lips parted in surprise, and something about him and that smell of his just drives Jungkook nuts. Jimin’s brows furrow and he says something, some muffle of noise that just flies past Jungkook’s ear, he doesn’t know what Jimin’s saying but his cute Busan lilt draws Jungkook closer like a moth to a flame and Jungkook wants to hear it moan, hear it scream, wants to eat Jimin up and swallow him whole. Jungkook’s drugged-out body steps closer, only content when it’s finally pressed up against Jimin’s heat, when the sugar and cream of Jimin’s scent is so concentrated Jungkook can gag on it. He breathes Jimin in, from the base of his ear all the way down, drinking up the milky syrup, burying his nose in that scent until it’s imprinted in every nook and crevice of his mind. The body underneath him shudders and the embers in Jungkook’s gut catches fire. Jungkook wants to take that body apart, wants it trembling beneath him and begging for Jungkook to wreck it—\nThere’s a firm shove against his chest and the world reorganizes itself in a flash of white light. Jimin’s in front of him looking flushed and disheveled and scared, and Jungkook feels sick to his stomach. He stifles all of his alpha instincts telling him to mark Jimin, to see just how far down that pretty little blush goes—and Jungkook does the most non-alpha thing ever and flees. Again.\n Jungkook wants to apologize but doesn’t know how to do it, so he does the next best thing and pretends like nothing ever happened.\nIt’s impossible.\nIt’s like his brain finally has a face to match up to the headless bodies in his dreams—it’s not just faceless people he’s fucking anymore, it’s Jimin. As in, Park Jimin, his hyung, his bandmate, the person he’s known for over three years, who has seen Jungkook hit puberty with a fucking sledgehammer, not once, but twice. Every morning, he wakes up hard and ashamed and aroused as all hell because it’s not just a body anymore, it’s Jimin with his intoxicating scent, legs spread, cheeks flushed, sweet voice begging for Jungkook to break him.\nJungkook can’t even look Jimin in the eye, too ashamed of his thoughts, chest swollen and tight from the guilt. He can’t think of Jimin like this. Jimin looked traumatized, he pushed Jungkook away, for fuck’s sake. That was so wrong of him to do, wrong wrong wrong.\n“Hey, you okay?”\nA nudge at his ribs jolts him out of his thoughts and Jungkook catches Seokjin’s eyes briefly. Seokjin lifts an eyebrow, chopsticks dangling from his mouth, but Jungkook’s attention gets stolen by Hoseok who’s cooing and pinching Jimin’s cheeks across the table. Beside him, Yoongi is transferring some pork belly from his own bowl to Jimin’s, and some part of Jungkook gets irritated, wants them to cut it out—and what the hell, did he seriously just think that?\n“Jungkook—” Seokjin hisses, elbowing him again.\n“Yeah, sorry, ‘m fine.”\nSeokjin’s eyes narrow in suspicion, parts his lips like he’s about to say something, so Jungkook shovels some rice into his mouth even though he doesn’t have an appetite. Seokjin lets out a displeased hum but returns to his earlier conversation with Namjoon and Jungkook unenthusiastically chews, swallows down the clump of rice with some water. Someone’s gaze is on him, he thinks it’s Jimin, but when he looks up, Jimin’s studying the meat in his bowl.\n If he thinks he’s preoccupied with Jimin, then everybody else is completely obsessed.\nEvery single day, he comes to the BigHit office to see another mountain of gifts for Jimin, snacks and clothes and jewelry and, god, let’s not even talk about the dildo. That damn dildo was featured in Jungkook’s dreams every night for an entire week.\nOutside of the studio, people stare and ogle at Jimin like he’s the best thing placed on this earth. Jungkook had always known Jimin was handsome—he has pretty eyes and full lips and this captivating energy about him that just drew everyone in—but now he’s straight up bait for Alphas and betas alike. Everybody’s finding all sorts of reasons to get close to Jimin. Seokjin buys him snacks, Taehyung and Hoseok latch onto him like baby koalas, Yoongi and Namjoon shuffle closer to Jimin whenever they get a chance, and hell, even MCs try to find any way to praise him. Heechul and Daejun even goes as far as to kiss him as “punishment,” sneaky bastards. And when Jimin casually remarks that he’s craving something sweet, one backup dancer literally drives home and bakes him a goddamn cake. Poor guy looked so helpless when Jimin stuck a finger in the frosting and sucked it off with relish (not that Jungkook was watching).\nMost of the attention is annoying but harmless. But some of them look at Jimin like he’s a piece of meat and it disgusts him, Jungkook nearly punches a guy’s face in when he overhears the guy remark, “I wanna try out that omega ass.” Namjoon has to dig his nails into Jungkook’s shoulders in order to keep him grounded.\n“That guy’s a piece of shit,” Yoongi comments. “You’d just be wasting your time.”\nNamjoon lifts an all-knowing eyebrow at Jungkook but doesn’t comment which is even worse because that means Jungkook’s being psychoanalyzed or something. And alright, fine, Jungkook admits it—what’s the quote that Namjoon says all the damn time? “You hate something in him that is part of yourself?” Maybe Jungkook hates the fact that he wants “that omega ass” too.\nIt’s not his fault. Everyone and their goddamn mother wants that omega ass, tripping over themselves trying to get Jimin’s attention. The audio director’s chatting him up right now; Jungkook overhears him going on in great detail about some mansion he owns in the middle of nowhere, with an infinity pool and the nicest jacuzzi Jimin’s ever seen, and Jungkook gets the urge to tear Jimin away from him. There’s a possessiveness clawing at the walls of his stomach, wanting him to claim Jimin and show everybody just who Jimin belongs to and—what the hell, Jungkook. Jimin doesn’t belong to him. He’s his own person. He can flirt and talk to whoever he wants.\nJungkook heads outside to get some air, tries to ignore this unbearable tug that pulls at him every single time he’s near Jimin. He’s better than this, he can’t be another possessive Alpha who thinks with their dick instead of their brain. He can’t have a repeat of the kitchen incident—his fingers are trembling just thinking about it, about how powerless he was against his own debased needs, about the horror painted on Jimin’s face.\nSo Jungkook stays far, far away, hoping it’s enough to quench that thirst inside of him, just gritting his teeth and watching from the sidelines.\n Jungkook learns it might be more than just alpha hormones when Jaebum comes into the picture.\nJaebum’s the textbook Alpha, with intense eyes and a strong jaw and a lazy confident stride that turns heads. And when Jungkook sees him, his shoulders hunch reflexively, readying for a fight, because Jaebum just sidles up to Jimin without a single care and Jimin doesn’t treat him like the rest of the alphas. He smiles and flushes a little and something about it just pisses Jungkook off. Jaebum makes the control look so easy when Jungkook can’t even keep his alpha side in check. Jungkook oversteps all of Jimin’s boundaries, terrifies him with his lack of control. Up against Jaebum, Jungkook’s like a little kid, just wearing these alpha pheromones like daddy’s suit.\n“You’re being obvious.” Namjoon’s standing next to him with his arms folded, slicked back hair complementing his cheekbones.\n“About what?” Jungkook grits.\nNamjoon smiles that infuriating “I know all” smile and says, “you look like you’re about to commit murder.”\n“It’s that stupid id thing that you were talking about,” Jungkook mutters, still watching the way Jaebum leans towards Jimin, eyes flicking up and down Jimin’s body like he wants to eat him. “Why aren’t you doing anything? You don’t feel this urge to just—” his fingers twitch in irritation, god, he can’t even find the damn words.\n“Jimin might be an omega, but he’s an adult.”\n“I know, what I’m trying to say is—” he rubs the back of his head in frustration. “Doesn’t Jimin drive you crazy? I feel like his omega-ness is getting to me and I just- it makes me feel like I’ve gone insane. And all of these alphas are going crazy over him too and—”\n“So you’re jealous.”\n“No, I’m not jealous,” Jungkook protests.\nNamjoon cocks his head at him and Jungkook feels the need to defend himself. “It’s the alpha thing, okay?” he hisses, “it makes me all territorial and—don’t look at me like that, I know you and Yoongi can’t stop sniffing him either.”\nThere’s some weird twinkle in Namjoon’s eyes that’s off-putting. “You should go save him,” Namjoon says, his low voice raising like he’s singing falsetto. He juts his chin over to where Jimin and Jaebum are standing, still chatting, and then he leaves before Jungkook can say anything, finding company in Jackson instead. Jungkook heads over without a second thought, shakes Namjoon’s weird expression out of his head, tells Jimin that they have to go. They both look at him, skeptical, but Jungkook walks off before Jimin can protest.\nWhen Jaebum finally leaves (thank fucking finally), Jungkook makes it a point to warn Jimin. Alphas are terrible people with no self-control, especially Jungkook, and he doesn’t want people treating Jimin like some sort of conquest, some piece of ass. He expects Jimin to thank him and be grateful for Jungkook’s concern but Jimin just bristles, hackles rising.\n“Because I’m an omega?” he bites, and of course it’s because he’s an omega, everything would have gone just swimmingly if Jimin wasn’t an omega. Jungkook wouldn’t be going batshit crazy about Jimin’s scent and his cute mannerisms and the fact that everyone in the damn world seems to want him, including Jungkook for some unexplainable reason.\nJimin doesn’t seem to appreciate Jungkook’s answer though because he scowls, upper lip curling furiously, but Jungkook just leaves before Jimin’s stupid milky sweetness gets even stronger, before he gives Jimin a reason to be careful. Jimin’s still glaring at him when Jungkook heads towards the van and idly, Jungkook suspects that he must have said something horribly, horribly wrong.\n When they come back, Jimin disappears to the studio with the rest of the members following him. Jungkook hugs his stomach with a hand and groans, tells them he doesn’t feel too well, but Jungkook just doesn’t want to go—Namjoon’s cheshire grin keeps flashing in his mind and he still doesn’t know what he did wrong because Jimin had refused to look at him the entire car ride back. He just wants to go sleep it off, have everything correct itself when he wakes up in the morning.\nHe kicks off his shoes in a hurry to get to his bed, but on the way there, he passes by the open door of Jimin’s room and his muscles tense, entire body freezing like a block of solid ice. His head turns, catching a glimpse inside, sheets rumpled and clothes strewn all over, Hoseok’s side the only part not in disarray. A whiff of Jimin’s scent hits him then, like sugar dissolving into his lungs, and his heart stops. Before he knows it his feet are pulling him inside, body moving in some stop-and-start motion, his head’s scolding him, he can’t do this, open-door policy or not, but his legs don’t listen, too steadfast in its pace, stopping only when he’s right by Jimin’s bed.\nJungkook goes up the ladder and sinks into the mattress with the satisfied sigh of someone who’s finally gotten their fix. His body slumps in relief but his fingers tremble and curl in the bedsheets—he wants to tear it off the mattress and wrap it around himself like a blanket, until the scent soaks into his skin, bleeds into his veins. His head falls back onto the pillows.\n“…what are you doing?”\nJungkook jolts awake (when did he even fall asleep?) and sees Taehyung closing the door with a hand, staring at him with raised eyebrows and, shit, this doesn’t look too good. He turns away from him in shame.\n“Uh. I just—” His cheeks feel hot under Taehyung’s scrutinizing gaze. “—I was just… looking for something. That Jimin-hyung borrowed. From me.”\nTaehyung’s expression doesn’t change, daring him to say something, to incriminate himself in some way, and then Jungkook’s pulled into this standoff with Taehyung staring him down and him staring back, he grits his teeth, refusing to chicken out even though his ears are flushing red.\n“Mmkay, whatever you say,” Taehyung hums. He belly flops onto his bed and whips out his phone.\nJungkook swings his legs over the rungs and peeks over, gnawing on the inside of his cheek while he waits for Taehyung to say something further. He doesn’t get anything other than some electronic clacking as Taehyung types something. Taehyung doesn’t ever turn off the damn keyboard clicks like everyone else does—like he wants some audible acknowledgment for each letter he presses. Annoying, but unapologetically Taehyung.  “Where’s Jimin-hyung?”\n“Still at the studio,” Taehyung replies, eyes not leaving his phone.\n“…when’s he coming back?”\n“I dunno, prob’ly in like half an hour or something.”\nJungkook breathes a sigh of relief and hops off the bed, trying to leave the crime scene as soon as possible, but is stopped in his tracks when Taehyung gives him a sideways glance and drawls with absolutely no subtlety, “you’ve been really interested in Jimin lately.”\nJungkook must have responded with a haunted look because Taehyung offers in sympathy, “don’t worry, I won’t tell him.”\n“Uh. Thanks?”\nTaehyung tilts his head and smiles, eyes gleaming, and Jungkook’s scalp prickles. Interested in Jimin? Of course he is, Jimin’s an omega for fuck’s sake, and Jungkook is an Alpha with the self-restraint of a toddler.\nJungkook shakes off his unease and slinks out the door in order to avoid Taehyung’s smug, knowing gaze, only to get stopped by Yoongi who’s holding a mug of tea in one hand, other hand perched lightly on his headphones like he just pulled them off of his head. He raises an eyebrow and Jungkook splutters, “Before you ask—”\n“I wasn’t gonna say anything.”\n“But you were going to—” Jungkook scrunches his face. “Forget it.”\nYoongi shrugs halfheartedly and puts his headphones back on before disappearing to his room. Jungkook’s about to follow him but there’s the rattle of a doorknob and Jimin and Namjoon appears, stumbling over each other in the entryway. They’re caught up in some conversation. Jimin’s giggling that sweet, high-pitched giggle of his and Namjoon’s steadying him with a hand on his waist while Jimin struggles with his Timberlands, too stubborn to bend down and untie the shoes like normal people do. Namjoon’s not as touchy with Jimin as Hoseok and Taehyung are, but something about that hand resting so comfortably on Jimin’s waist makes Jungkook see red. Jungkook’s palms start sweating; he grinds his teeth and stares at that hand with tunnel vision, can’t look at anything but that damn touchy hand until he growls without even knowing. Namjoon must have heard because his head jerks up and he peers at Jungkook in interest. The hand retreats slowly, lifting in a gesture of surrender, and Jungkook’s vision clears.\nJesus christ, he just challenged Namjoon. Over Jimin.\nHe darts his eyes over to Jimin whose face is tight, lips pressed together in annoyance, and he’s not sure if Jimin caught the growl or not but the thought’s enough to make him curl up in shame. He escapes to his room in a panic, breathing out only when the door’s finally shut behind him. He throws himself on his bed, clenches his eyes shut to forget everything and swallows back the salt that comes when he’s about to be sick.\nThe door clicks open.\n“Hey, you alright?”\n“Fine,” Jungkook grits, refusing to look Namjoon in the eye.\n“You sure?”\n“Yes,” he says. Moments later, a “no.”\nHis bed dips but Jungkook’s turned to the wall, curled up in a fetal position. He’s still fucking pissed about the hand on Jimin’s waist, what the hell is wrong with him.\n“You wanna talk?” the voice asks.\nJungkook can’t find it in him to respond but Namjoon must know because there’s a strong grip on Jungkook’s shoulder, a large hand squeezing and rubbing his muscles in a poor attempt to massage him. Namjoon and Yoongi aren’t always the touchiest, especially when it comes to him (maybe it’s the Alpha thing) but they always give him support when he needs it. The thumb digging into his back gives him enough energy to speak.\n“I hate being an Alpha,” he mutters.\n“Hm?”\n“I hate it,” Jungkook says again, voice muffled by the pillow. “Alphas are supposed to be strong, right? The movies make them all heroes and stuff, but I just—” He breathes. “—I just feel so weak. I don’t know what’s wrong with me.”\nThe hand keeps going, rubbing small circles in his back. “What do you mean?”\n“There’s just- so much anger and I just feel like a bad person all the time. I’m so damn tired of it.” He doesn’t get any verbal response from Namjoon but the hand doesn’t stop moving so Jungkook takes it as encouragement to continue.\n“Hyung, I was ready to fight you,” he confesses, fiddling with the pillowcase. “I saw your hand on Jimin’s waist and I— I got so angry. All I was able to think about was moving your hand and—dammit, I sound insane.”\n“No, you don’t. Nothing’s wrong with you.” Jungkook has to resist the urge to scoff. Worst fucking lie Jungkook’s ever heard. “Hold on a second, I’m gonna need some reinforcement.”\nJungkook peeks over his shoulder to see Namjoon fiddling with his phone, one hand still absently stroking Jungkook’s back. There’s a swoosh of a text message being sent before Namjoon turns to him again, his face open and understanding, calm smile devoid of any judgment.\n“How do you deal with it? I can’t- I can’t just devour Jimin-hyung or something. I spent the last hour just lying in his bed and sniffing like some crazy person.”\n“Wow,” Namjoon says.\n“Yeah. Wow. How do you do this? Jimin-hyung just smells so—” So damn good.\n“I think…” The door opens and Yoongi slips through. “I think I’m gonna have Yoongi-hyung answer this for me.”\n“What’re we talking about?” Yoongi asks, plopping down on Namjoon’s computer chair. He grabs one of Jungkook’s pillows, just to have something to hold, and Jungkook feels like the entire thing just turned into some teenage girl’s sleepover. Embarrassing.\nNamjoon says tellingly, “Jungkook. And Jimin.” And Jungkook tries to ignore the way Yoongi’s lip quirks in recognition.\n“Shoot,” Yoongi says. With a sigh, Jungkook divulges everything again, trying to explain himself but leaving sentences half-finished, starting and stopping because he gets so frustrated. The only thing that keeps him going is Namjoon nodding his head emphatically with each word that Jungkook says, offering his support the way he does when Jungkook struggles to speak on-camera.\n“Whoa. Lots of feelings there, kiddo,” Yoongi says when Jungkook finally finishes, out of breath.\nJungkook forces a laugh but he doesn’t find it funny, especially not since his well-being—since Bangtan’s well-being is at stake.\n“Okay, I’m gonna go ahead and say what we’re all thinking.”\nYoongi leans over, gaze fixed on Jungkook with determination.\n“I’m pretty sure you like Jimin,” he says bluntly.\n“Oh my god, hyung,” Namjoon groans, rubbing his face into his palms like he can’t bear to look at the mess Yoongi caused. But Jungkook doesn’t even notice, doesn’t hear anything past “like Jimin,” coldness hitting at his core.\n“What?” he stammers.\nWith a low, steady voice, Namjoon says, “what he’s trying to say is that alpha hormones only go so far.”\n“So…”\n“Look, Jimin smells good,” there’s a wince on Yoongi’s face like it pains him to admit that, “but what I— what we feel towards him is different from what you’re feeling.”\n“But… that’s just because you’re not interested in guys, right? It’d be different since I’m—” Jungkook doesn’t even finish, too unnerved by their blank stares. He pulls the sheets closer to him, folding it under his armpits. Something in Namjoon’s expression changes. He ruffles Jungkook’s hair like a dog and in that soothing bass of his, says, “it’s okay,” but what’s okay? What are they trying to say?\n“Omega or not, Jimin’s like my younger brother, y’know? He’s cute and everything, really cute, but I’m not possessive over him. I don’t think of… claiming him or anything.”\n“Same with me,” Yoongi adds.\n“And Jungkook, I…” he trails off, wets his lips a little, “—are you sure you’re not interested in Jiminie? Even before he presented, you were always sort of watching him and seeking him out. And now, you’re like some jealous lover—”\n“—you’re obvious. I saw you glaring at Jaebum when he was talking to Jimin—”\n“—and you talk about him all the time,” Namjoon adds, sharing a glance with Yoongi, “even if it’s to complain about him lagging or about his smell or whatever it is.”\n“But that’s just—” Jungkook can’t even argue back, the realization hits him, leaves him breathless. God, was that what it was? It wasn’t just his hormones?\nHe curls in tighter, knees pulled into his chest, and drags the sheet over his head in embarrassment.\n“Hey, it’s okay.” A hand tugs the sheet down but Jungkook throws his forearm across his cheeks in its place, trying to hide the flush rising up cheeks.\n“So you mean you don’t feel anything towards him? Like you don’t feel this need to- to mark him?” To wreck him? Swallow him whole?\nNamjoon’s back straightens and his brow furrows, pensive. “Think about it this way. When you’re drunk, you don’t do anything outrageous, right? It’s not like it makes you commit crimes or makes you want to kiss me or Yoongi or anything.”\n“—gross.”\n“The hormones are working off of some-” his hand flops animatedly, “some interest, at least. Romantic or otherwise.”\nJungkook’s dumbstruck.\n“Oh my god, he’s- he’s my hyung,” Jungkook gasps. “I can’t just—I mean, crush or whatever, I still have to control myself around him. I don’t want this to—” he breathes, chest shuddering, “I don’t want this to change us.”\nNamjoon gnaws on the inside of his cheek before he speaks. “Don’t worry about it. You’re a good kid. You’ll be okay.”\n \nThe slapdash intervention he had with Namjoon and Yoongi was supposed to answer his questions but really, it ended up leaving him more confused than ever. After they listed all of the symptoms for his little crush, Jungkook notices just how bad he’s got it. He's never realized how often he unconsciously searches Jimin out, never noticed the way he stares at Jimin, like he's studying every strand of hair on his goddamn head.\nBut nothing’s ever going to happen.\nJimin just views him like a little brother.\nEven now, Seokjin’s words are still ringing in his ear. The alpha hormones ruined everything. Jungkook grew too fast, couldn’t control his stupid, growly predator tendencies or something, and Jimin didn’t know how to deal with it—that’s what Jimin's inquisitive little stares were about. That’s why he keeps on watching, waiting for Jungkook to pounce like a pet gone feral. It was like watching his younger brother become a monster, falling down this rabbit hole.\nWhat happened after the whole Jaebum incident only reinforces it. Jimin’s been putting on this alpha facade as though he’s reminding Jungkook just where he belonged. The touches are aggressive, domineering, like he’s forcing Jungkook into submission, reminding Jungkook by saying, “I’m your hyung, right?”, “call me hyung”, speaking some sense into Jungkook like he’s some beast, reprimanding him for all of the inappropriate thoughts he’s had of them together.\nIt’s a lost cause.\nJimin just views him as a little kid—he can't be anything more than a dongsaeng. Jimin needs someone better than him, not the poor excuse of an Alpha he is.\nSo Jungkook swallows his pride and calls Jimin his “hyung,” gulps down the bitterness in the back of his throat. \nBut he can’t keep his eyes from flitting over to where Jimin is, orange hair a lighthouse in a sea of black, eyes sparkling as he laughs, milky sweetness luring every single one of these goddamn Alphas towards him, especially Jaebum who’s draping himself all over Jimin’s goddamn back, arms flung around Jimin’s neck so casually. Something about seeing them together makes his gut turn rancid. The other Alphas were annoying, but Jaebum was—he was nice. Calm and confident. Good for Jimin. It makes Jungkook dislike him even more. Because Jungkook can't compare.\n“He’s really popular nowadays, huh?” Yugyeom asks, catching the direction of Jungkook’s gaze. Jungkook responds with a grunt, doesn’t want to talk about it, but Yugyeom doesn’t stop. “I feel like he’s different somehow. Was he always this… pretty?”\nPretty doesn’t cut it. Jimin’s not just pretty, he’s captivating. He commands the attention of everybody around him, even before he was an omega, and the ones who just want to conquer him don’t know the way his teeth flash when he’s finally perfected a move, the way he flings himself all over when he laughs, the way he gnaws on his lip when he’s deep in thought, and—fuck, definitely not just hormones.\n“Yeah. I thought he was,” Jungkook says.\n \nEveryone claps when Jungkook comes back to the greenroom.\nNamjoon whistles through his fingers and Hoseok shouts praises from the makeup chair. Jungkook beams, cheeks pink and flushed, and Jimin can’t look away. The stylist noonas usher Jungkook to the side in the midst of all the commotion, shoves some hangers in his hands and pushes him down into the nearest chair. There’s a flurry of hands over his face while they fix Jungkook’s makeup, sponges dabbing at his forehead, rushing to touch him up before they have to get back on stage.\nJungkook glances up in the mirror and their eyes catch. It sends a jolt through him, Jimin’s heart lurches like he missed a step.\nJungkook hastily looks away and Jimin does too, ignores the nervous thrum of energy running through his body from just a small little glance. He smooths his shirt down and heads off to the corner, makes himself run through the choreography again, struggles to get his little crush under control.\n  When they’re lined up to perform, the usual adrenaline is pumping in his veins, tingling in his fingers. His hands are cold and clammy and he folds his arms, grips his biceps in a subtle attempt to wipe off the sweat. Years of performing and he still gets nervous.\nJimin drowns out the chatter of the idols around him by running through the moves in his head. He can’t afford any distractions right now, not when he’s about to do a solo stage, so he puts himself in the middle of the crowd with his members flanking him on all sides, his own personal wall against overzealous Alphas.\nBut then there’s a presence behind him. Jimin feels the heat radiating against his back even though no one’s touching him.\nA pair of hands grip his waist and Jimin stiffens. He knows who it is just from the smell alone but he turns around just to be sure, and yeah, it’s Jungkook who’s staring straight ahead, chin hooked over his shoulder, watching the performance onstage with a blank face like nothing’s out of the ordinary.\nJimin’s heart pounds in his ears. Hazily, he thinks he’s swaying, or Jungkook’s swaying, but he can’t focus on anything except for that sweet, rich smell and his skin tingling with warmth underneath the pads of Jungkook’s fingers. His entire body sags, leans back against Jungkook’s firm chest and loses himself in it, lets himself relish in this heat, in Jungkook’s smell that seems to blanket him. Fuck the consequences. Jimin’s been trying to suppress his omega hormones for so long, he’s tired of it. He’s just going to give in, deal with it because that’s what he’s been born with. Jungkook may not like him—not in the way that Jimin wants—but the pheromones make it possible for a little bit. They can play pretend.\nThe song ends and the hands at his waist are gone and Jimin feels colder than ever. He blearily opens his eyes, turns around to see Jungkook avoiding his gaze, busying himself with his suit, acting like nothing even happened, like he didn’t go all alpha-stupid on him just a minute ago.\nIt throws Jimin off. His heart drops, thoughts stuttering, too confused and dismayed to call Jungkook out on it. He can’t find a good reason for why Alphas do half of the things they do anyway.\nJimin shakes off his daze and breathes deep in his chest, long steady breaths. He ignores the members’ fleeting glances and tries to calm his body down, get his pulse under control. He needs to get used to this, it’s bound to happen. Alphas are going to sniff him, his hyungs are going to dote on him, and on rare occasions, Jungkook will be touchy with him too. It doesn’t mean anything.\nJimin reminds himself, repeats it like a mantra, you’re an omega.\n As if he could forget. As if his body would ever let him fucking forget.\nHe’s reading some webcomics on his phone when something makes him all agitated. He rearranges himself restlessly on the bed, fidgeting and tossing around until he feels at ease, blames the hard springs in his mattress for making him all achy. The room gets stuffy too, the air is both hot and cold, heat rolling in like the tides, coming and going in small bouts until the giant wave finally hits him. The sudden flash of heat leaves him breathless, makes him hunch over in his bed from the shock.\nAnd then he knows. His body burns up, droplets of sweat forming on the back of his neck, slick pooling in his briefs. His fingers twitch like they want to grasp something. He feels itchy. Irritable. All of the myths and hearsay about omega heats couldn’t prepare him for this. It’s like nothing he ever imagined. There’s a slight dizziness in his head, like what happens when he finishes a bottle of soju by himself and stands up too quickly—but he’s not drunk. Not mindless enough to want anybody to fuck him, still need at least two more bottles before he’ll run off into the streets and beg for alpha cock (Namjoon’s porn wasn’t that accurate).\nBut god, he just—he feels empty. He can’t even describe it, but there’s this hollowness inside of him, this need to be filled. He wants someone here, wants a warm body on top of him and pinning him down and using him until he forgets how to speak. Wants somebody to stuff him up. His cock is getting hard just thinking about it. It’s not what he feels before he goes to bed, not something that can be easily fixed by a quick jerk off session. The itch is deep inside of him, clawing at his gut, flooding him with fire.\nJimin tears the blanket off. It’s hot, too fucking hot—he can’t breathe.\n“—Jimin. Jimin—”\nHis name hits him like a splash of cold water. He turns away from the wall, peers down to see Hoseok’s lips droop in concern. Hoseok takes it as an invitation and steps on the frame of the lower bunk in order to reach him, pulling himself up until his arms are folded across the rungs of Jimin’s bed. His brows furrow, usual grin gone.\n“You okay?” Hoseok asks, voice hesitant but soft and soothing. “Do you have a fever?”\nJimin wants to laugh. He must be fucking delirious. It’s a fever alright.\nA warm hand floats over him, it looks like Hoseok wants to check his temperature but Jimin doesn’t want to be touched. Not right now. Not unless Hoseok can do something about it, fix the emptiness inside of him. “Hyung, I think- I think you should leave,” he groans, shifting away from Hoseok’s touch.\nThe hand stills, drops to the side.\n“Jimin-ah, are you…?”\nJimin holds his breath, doesn’t want him to finish that, doesn’t want to admit it.\n“Hoseok-hyung, please,” he squeaks. His eyes are clenched so tight they hurt and he curls in, hides his red face in his arms. His hands are trembling, palms warm and clammy, and he wants to crawl out of his own skin. When he peeks over the crook of his elbow, Hoseok’s face is pinched, expression drawn tight.\n“I’ll get everybody else to leave. Text me if you need anything.”\nHoseok raises his hand again like he’s about to pet Jimin, so used to touching for comfort, a habit of his. But it retracts as quickly as it extended and Jimin’s thankful that Hoseok understands, that Jimin doesn’t have to spell it out for him.\nThere’s a thud on the carpet and then a click of a button. The low steady whir of the fan comes on and as Hoseok exits, Jimin hears the fuss outside, the Alphas probably already smelling his slick through the crack in the door. It makes him curl in tighter, heat up even more—not out of arousal this time, but shame. Namjoon’s deep voice murmurs “is Jimin— is he—,” sentences unfinished like he’s too embarrassed to say it out loud. There’s no verbal acknowledgment from Hoseok, at least, not what Jimin could hear—but they must know because Taehyung calls out “Chimchim, feel better! Text me!”\nSomewhere in the commotion, Seokjin asks “where’s Jungkook?,” words ringing before the bedroom door finally closes, and fuck. Jungkook. Even that slight mention sends his body into overdrive, makes him drip like he’s been conditioned just by hearing his name. He can just smell the cloying sweetness of his slick coming out of him, stinking up the room, and he can’t stop thinking about Jungkook and his stupid scent and his goddamn muscles and those long thick fingers that would feel so fucking good inside of him, shit. He should have stolen that white shirt from the bathroom, should have stuffed it in his pillowcase, keep it here so he can breathe it in until he’s dizzy. He wants that scent all over him, wants Jungkook to fuck him—\nA low whine builds in the back of his throat.\nNo. He can’t do this, he told himself he wouldn’t. Jungkook’s just his dongsaeng, just his dongsaeng, and Jimin is his hyung. Jungkook might be genetically predisposed to want him, to want an omega, but that doesn’t mean he’s going to want Jimin, fuck, he can’t do this.\nBut the thoughts keep coming, vivid images of Jungkook grabbing him all over, large hands running up and down his sides, and Jimin’s gone. When the front door slams shut, Jimin frantically pulls off his boxers, tears off his shirt and reaches down to grip at his cock. It’s already hard and dripping on his stomach and he tugs on it, desperate, hands circling it and pulling from the base all the way to the tip, up and back down, again and again, but it’s not enough, not fucking enough, his omega body is wired to want more.\nHe forces his other hand down, bypassing his cock and going straight for his hole. He’s experimented with this before, on the rare occasions he had both time and privacy, but it was never like this. He never felt this desperate, clawing need to have something- someone inside of him. He wants to get fucked so bad it hurts.\nJimin can't hold back the groan when his finger dips in, breaches his entrance and rubs the slick into his skin. It’s good, so fucking good, but still not enough. His fingers are too short, they can’t fill him up, can’t scratch the mindnumbing itch inside of him. He’s losing his mind, wishes BigHit didn’t throw that dildo away, he should have kept it, stupid Jimin, way to think in advance—\nJimin jerks himself off quick, tries to calm down the fever by getting it out of his system, but when he finally comes, his body feels even more restless. More irritated. Like it’s saying, “this isn’t the alpha knot you promised me.” He’s never been more frustrated in his life. Maybe there’s a little bit of truth in the “sex-crazy omega” rumor after all. He’s about to go insane.\nHis phone buzzes beside him but Jimin ignores it, tries to force another orgasm out of himself, sanity already halfway out the door. He just wants to get rid of this goddamn itch, drain all of this manic energy from his body.\nBut the vibration keeps coming, buzzing in quick succession, and Jimin bites the inside of his cheek and snarls, grabs the phone to see who the hell decided to bother him when he’s so strung out of his damn mind.\nAnd it’s Taehyung. Goddamn Kim Taehyung.\nFrom: Kim Taehyung (16:08) its a heat right? ㅠㅠ  (16:08) dont forget to drink water and stuff  (16:09) feel better ChimChim~ &gt;3&lt; (16:09) im rooting for u (16:09) lemme kno when its ok to come back\nWhen Jimin’s done reading, two more texts come.\nFrom: Kim Taehyung (16:11) oh if u need condoms and stuff theyre in my drawer (16:11) don’t ask me where i got them. they were free and i didnt wanna throw em away  Jimin can’t find the energy to respond, Taehyung’s texts just suck the life out of him somehow. What the hell is Tae even saying? Who does Taehyung think he’s going to use the condoms on? He doesn’t even have that damn 10-inch dildo.\nFrom: Kim Taehyung (16:12) if u use my bed ur paying for dry cleaning\nJimin’s brows knit together and he tosses the phone back down with a huff. Taehyung’s being ridiculous. It’s not like he has anybody—Jungkook’s out of the question, can’t do Jungkook, no way—and Jimin doesn’t have a lot of Alpha friends he can rely on or ones that he’s even remotely attracted to. The only other person he could think of is—\nHe grabs his phone, desperation clouding his judgment. It takes three rings for the call to get through but when it does, Jimin can’t suppress the nervous shudder that goes through him. He can’t believe he’s doing this.\n“Jimin? What’s up?”\nThe low velvet of his voice makes Jimin hot and Jimin remembers how hard his cock still is, the way his hole’s still dripping. Jimin’s hands can’t stop wandering down.\n“Hi- uh. Hey. Do you— do you have a minute?”\nHis hands don’t stop moving, fingers ghosting over the head of his cock, thumb smearing precum all over the tip. His body jerks. Jimin reminds himself to put some clothes on before he lets him in, can’t greet him at the door like this.\n“Yeah, of course. What do you need?”\n \n \nJungkook is in the studio when he gets the texts.\nHe usually doesn’t bother checking his phone, but his legs could use some rest. He’s already run through the piece for the past two hours, trying to get Jimin out of his head, and his muscles are tense, calves tightening like they’re about to cramp up.\nIt’s been a week since KBS Gayo passed and Jungkook can’t get himself under control. He wasn’t supposed to grab Jimin’s waist like that, wasn’t supposed to rub his cheek against Jimin’s face like some—some animal, but Jimin just smelled all wrong. He smelled like Jaebum and it blew out all the circuits in Jungkook’s head, made him want to pull Jimin close to him so he can fix it. When Jungkook finally came to his senses, he couldn’t find it in himself to push Jimin away. He played along, memorizing the way Jimin’s body seemed to brand him, the way they scalded his skin the longer he touched. Jungkook breathed in and burned Jimin’s milky sweetness into his nostrils, studying every layer and note so he can recreate it in his head later, alone in his room.\nWhen the song ended, Jungkook couldn’t even look at Jimin. Nothing changed. Alpha or not, Jungkook’s still as awkward as ever, can’t deal with confrontation unless his hormones blind him and he becomes all rage-y and growly.\nHe grabs his phone from where it’s plugged into the speakers and unlocks it, plops down while the chatroom floods his screen.\nFrom: Hyung. Hobi-hyung (15:57) Jungkookie, come eat with us~ (15:57) are u at the studio??\nFrom: Hyung. Jin-hyung (15:58) come eat come eat!!!!\nNamjoon doesn’t say anything in the chatroom. He sends Jungkook a direct message instead, straight to the point as always.\nFrom: Hyung. Rapmonnie-hyung (16:02) Where are you? (16:03) Don’t go back to the dorm yet.  (16:03) I’ll tell you later.\nAnd Jungkook's heart races, extremities growing numb from the cold trickle of fear.\nWhat's happening? What's going on?\nHe checks his other messages, sees Taehyung's and he can’t shake off this unease because Taehyung’s message says something completely different.\nFrom: Hyung. Taehyungie-hyung (16:06) theres a surprise for u back at the dorm lolol (16:07) r u at the studio?\nHe actually responds to Taehyung—if anyone’s going to tell him the truth, it’d be Taehyung. Not because he’s bad at keeping secrets, but because he doesn’t think there’s anything worth hiding.\n(16:08) yeah. (16:09) what is it?\nFrom: Hyung. Taehyungie-hyung (16:09) not telling lolol\nJungkook can’t contain his annoyance, huffs even though Taehyung's not even here.\n(16:10) ...  (16:10) well can i at least head back and shower first?\nFrom: Hyung. Taehyungie-hyung (16:10) sure (16:10)  wouldnt be the worst idea lolol\nPrank or not, Taehyung’s smart. He wouldn’t say things just to say it—his methods are unconventional, but not stupid, and Jungkook knows he (usually) has Jungkook’s best interests in mind. How bad could it really be anyway? Someone probably just clogged the toilet again—or burned the kitchen down. Or there’s some big spider set loose in the dorm that they just can't kill (wouldn't be the first time). He should at least find out for himself.\nJungkook pulls at his shirt, uses the hem to wipe at the sweat on his forehead.\nHe could really use a shower anyway.\nHis palms are damp from the nerves, the anticipation makes his fingers numb. He can barely hold himself upright; his legs are weak, knees threatening to cave in. Even though he’s changed boxers, the slick is still dripping out of him, wetting his new pair, threatening to soak through and dirty the sweatpants too. Jimin stares at himself in the mirror, sees the way his cheeks are flushed, his eyes glassy like he’s been crying. Fuck, it’s so obvious that he’s in heat.\nJimin uses his hand as a makeshift comb, rakes his fingers through his hair, trying to fix it from where it’s been molded by the pillow, dampened from his sweat.\nThe doorbell rings then, the chime echoing into the open door of the bathroom, and Jimin stiffens. The hair on his neck prickles, body jolting alert like he’s a dog waiting for its owner.\nJimin fusses with his hair one more time, brushes it back with shaky hands to make himself look just a little less disheveled, and he pads over to the door, takes in one giant breath before he reaches for the doorknob.\nHe opens the door.\nJaebum looks different offstage, a little more tired without the makeup, dark eye circles a shadow underneath his pale skin—but nevertheless handsome.\n“Damn,” Jaebum hisses. “You smell—” he trails off, doesn’t finish it, but Jimin doesn’t miss the way his eyes seem to darken, pupils blowing wide. Jimin can’t help but shiver.\nHe quickly looks away, wipes his hands on the cotton of his sweats.\n“Um. Hi. Come in,” Jimin waves his hands in the vague direction of the dorm. “Sorry for the mess.”\nThere’s a gust of air as Jaebum passes him, Jaebum’s cool scent invading his senses, so good that Jimin has to suppress a groan. It’s not the dark bittersweet smell of cocoa, but it still makes his mouth water, makes the slick ooze out of him, wet and hot. Fuck.\nHe swallows down the desperation and follows Jaebum into the living room.\nFor some reason, he can’t get himself to look at Jaebum—as though looking at him would bring him back to reality, would wake him up and force him to realize the bad decision he’s about to make. He knows he’s going to regret this in the morning, when the itching is done and over, but right now, he wants it. He wants it so fucking bad.\n“Do you—” Jimin clears his throat. “Do you want anything to drink?”\n“I’m good.”\n“Y-you sure?” He can feel the slick running down, the way his chest seems to burn. He hopes to god Jaebum can’t smell it.\nJaebum’s eyes flicker.\n“Some water would be nice, actually,” he says, voice gravelly like he’s gone through a pack of cigarettes.\nJimin flees, paces over to the kitchen in a hurry. The pounding in his ears is deafening, disorienting him as he walks. He can’t believe he’s doing this. Really, Jimin? You’re gonna let Jaebum fuck you in a dorm that you share with three other Alphas?\nHe shakes off his unease, looks for a glass on the top shelf, but as he reaches up, his mind conjures up the memory of Jungkook cornering him in the kitchen, caging him in with his body. Jimin suppresses the shudder that comes when he remembers the light trace of Jungkook’s nose against his neck, the heady smell of cocoa crowding around him.\nHe takes a centering breath, tamps down the memory, forces himself to refocus his attention on the ‘now’. He’s got a willing Alpha in the room next to him and here he is pining over his bandmate, Jesus.\nWhen he finally pulls himself together, he heads back to the living room.\nJaebum is glancing around their dorm like he’s at a zoo, studying the organized mess on the shelves.\n“Here,” Jimin says.\nHe hands over the glass, jolting when Jaebum reaches for it, when his fingers graze against his Jimin’s, electrocuting him. Jimin nearly drops the glass from the shock.\n“Thanks.”\nJimin takes a seat, not on the same couch but on the armchair to the side, away from Jaebum’s smell, just enough of a distance so that his head is still clear.\nHe tries to think of something to say. Doesn’t look at Jaebum but stares at his trembling hands. His limbs are all jittery from the heat, his knees bouncing up and down unconsciously. He hopes to god he’s not leaking through to the armchair.\n“There’s no one here?”\nJaebum’s low voice brings Jimin out of his thoughts.\n“There’s… there’s nobody here.”\n“You didn’t wanna ask your members to help you?”\nJimin looks at him in disbelief.\n“That’s—it’d make things a little weird, don’t you think?”\n“I don’t think it’d be a big deal. Any Alpha will do, right?”\nHe’s got to be joking. Any Alpha will do? Is that what Jaebum thinks of omegas?\nJimin’s baffled, can’t find anything to say, stomach hardening at the words. He might just be overreacting, maybe it’s the heat that’s making his temper even shorter—but hearing that pisses him off. Like no matter what, he’ll just be a slave to his hormones, just some desperate little omega.\nJaebum doesn’t make anything of the silence. He hums, taking a sip of his water, and Jimin’s leg doesn’t stop bouncing. He can’t help but glance over, eye the way Jaebum’s adam’s apple bobs as he swallows, and the heat flares, makes Jimin wipe the sweat off his forehead with a hand. When their eyes catch, Jimin quickly looks away. His body’s still hot but there’s an acid building, festering sour in his gut. A bad omen.\n“I’m flattered that you chose me though,” Jaebum says further, voice a little sly. “Especially when you have so many Alphas trailing after you.”\n“Yeah,” Jimin breathes. But he doesn’t add anything else, sucks his cheeks in and keeps his mouth shut. It sounds like any other compliment, but there’s something off about it, like Jaebum’s really just treating him like a conquest, just something Jaebum can brag about. Jimin’s heat doesn’t give a damn, just wants any Alpha he can get, but he knows his shame would eat him up alive.  “To be honest, I always thought you and Jungkook had a thing.”\nJimin’s head shoots up, stunned, catches the stony expression on Jaebum’s face.\n“We don’t.”\nHe doesn’t miss the way Jaebum’s face seems to relax like he’s pleased. It makes something rise up in the back of Jimin’s throat, harsh and bitter.\nHim and Jungkook? A thing?\nJimin grimaces, stops that line of thinking before it gets out of control.\n“I’m gonna—” He clears his throat, wipes his palms on his sweats and gets up from his seat. “I’m gonna go to my room.”\n“I’ll be right behind you,” Jaebum says.\nJimin’s head jerks in a nod and he heads to the bedroom.\nJaebum doesn’t come yet, which he’s thankful for. He just—needs a breather. Now that he’s away from that stupid alpha smell his head’s a little less cloudy, his judgment a little better. His body seems to be sobering up too, judging from the way his stomach knots up, the regret setting in.\nIs he really going to do this? He knows it’ll make the music shows awkward from now on—he won’t be able to look at Jaebum in the same way. God, this might fuck up things between them and GOT7 forever.\nAnd Jungkook.\nShit.  Jungkook. \nHe can’t stop thinking about him. Even though there’s another Alpha here, Jimin wants Jungkook. He wants Jungkook’s scent all over him, his body pinning him down, his knot inside of him. Jaebum wouldn’t be the same, not even close. God, what is he doing?\nJaebum raps on the door even though it’s already open.\n“Hey.”\nThe door closes behind him, clicking shut as he enters, and Jimin’s chest starts pounding. The panic hits him. Jimin feels trapped, like a rabbit cornered in its den, and his knees lock up, pulse racing when he sees the way Jaebum stares at him. Maybe this whole thing wasn’t such a good idea.\n\n Jimin, what the hell did you get yourself into? \n\nJaebum strides through the room, covers the distance between the door and Jimin in no time at all, and Jimin’s legs go weak, limbs shaking like he’s a newborn foal still learning how to walk.\n“Jaebum-hyung,” he says frantically.\nJimin stumbles back onto Taehyung’s bed, his own bunk too far away.\nJaebum’s eyes are dark, searing hot, hard and determined as he presses closer, pushing Jimin until his back is flush against the mattress. Jaebum crowds Jimin with his body, cages Jimin in with his arms, and Jimin’s breath stutters.\n“Hyung—” Jimin stammers, heart pounding in his ears. Jaebum’s face is predatory like he’s readying himself for a meal, gaze raking down slow, inching down Jimin’s body like he’s trying to figure out what part he wants to eat first.\n“You smell  so fucking good,” Jaebum groans.\nHis head dips down to the crook of Jimin’s neck, nose grazing against his vein and Jimin’s stomach tenses. The feel of it makes something inside him quiver, body heating up, legs parting despite himself. When Jaebum grazes his teeth against Jimin’s neck, Jimin’s chest hiccups, stuttering as he tries to breathe. The omega in him wants it, just any alpha knot, but there’s a voice in his head that’s telling him it’s not as good—not the same. Jaebum’s smell is nice but too different: acidic while Jungkook’s was sweet, cool while Jungkook’s was warm. It’s not the same jittery high that Jungkook gives him. Fucking Jaebum would be like having a snack in place of a meal and Jimin’s greedy. He wants the whole goddamn buffet.\n“Jaebum-hyung,” he stutters, too meek of a warning.\nJaebum keeps going, nipping at Jimin’s neck with his sharp teeth, lapping at his skin. He moans, low and throaty, still mouthing at Jimin’s neck like he’s famished—and Jimin breathes in that icy scent of a forest rain and knows that he doesn’t want this anymore, wants someone else.\n“Jaebum-hyung, wait—” The bites don’t stop and Jimin starts panicking. He brings his arms up, shoving at Jaebum’s chest, “—hyung!”\nJaebum pulls away, lips pursed in annoyance.\n“What is it,” he grits.\n“I’m sorry. I don’t—I don’t think is a good idea.”\nJimin winces at the way Jaebum’s face seems to twist. He tacks on another “sorry” for good measure, hopes that it’ll be enough.\n“You called me all the way over here… just to tell me you’ve changed your mind?”\nJimin’s face grows hot and he turns away, averts his gaze from Jaebum’s accusing scowl. But even if he doesn’t see it, he still feels Jaebum’s hard store boring into him, piercing through his skin. The guilt makes his stomach burn.\n“Sorry. I think my heat just—made me a little desperate.”\nJaebum is quiet, just sits back on his heels and studies him, eyes probing, like he’s trying to analyze every single microexpression that flits across Jimin’s face. Jaebum’s not stupid, Jimin knows he can read between the lines, that he hears the “I want you to leave” that Jimin can’t seem to say out loud. But Jaebum doesn’t move.\n“I can smell you dripping,” he says. “And you’re telling me you don’t want this?”\nJimin flushes in shame, eyes still fixed on the wall. He knows he dug himself into this mess so he bites his tongue, takes the berating because it’s the least of what he deserves right now.\nGod, he was so stupid. So desperate and stupid.\nThe silence stretches between them, heavy and tense, and Jaebum shifts on the bed. He thinks Jaebum finally gets the hint, that he’ll leave and they can just pretend the whole thing never happened. But then there’s a pair of hands on his thighs, large, strong hands that burn hot through his sweatpants. They just rest there, right above his knees, flaring against his skin even through the thick cotton, and Jimin’s stomach flips.\n“Park Jimin,” Jaebum says, voice low, so deep that Jimin feels it resonating in his chest, like the rumbling bass at a concert.\nJaebum doesn’t say anything else but his hands move, slithering up Jimin’s thighs, and Jimin draws back, his breath hitching, legs twitching as the hands creep up.\n“Hyung,” he gasps. “Hyung, I mean it.”\nThe fingers inch their way up to Jimin’s stomach and Jimin’s pulse spikes. His hands dart down, grips Jaebum’s wrists like handcuffs and holds onto them tight, keeping them from trailing up any further.\n“Jaebum-hyung,” he says firmly. “Please. Leave.”\nJaebum doesn’t even get a chance to answer before the door bursts open without warning. The slam makes Jimin spring up, startled, and his mind races, heart thudding furiously.  Who the hell could be home at this time? \nJimin peers over Jaebum’s shoulder and recognizes the looming figure with a start.\nJungkook’s standing in the doorway, his eyes wild, knuckles clenched bone-white around the doorknob. Jimin can smell Jungkook’s scent even from the bed, fuck—it’s making his body tingle, slick leaking out of him. He knows Jaebum smells the change because his nostrils flare, fingers twitching uselessly in Jimin’s grasp.\n“Hyung,” Jungkook says from the doorway. His voice is smaller than Jimin expects and he realizes with stunning clarity how bad this must look: him all alone in the dorm, Jaebum halfway on top of him.\nJimin lets go of Jaebum’s wrists, his cheeks burning.\n“Hyung,” Jungkook says again. “What’s he doing here?”\n“He  was invited,” Jaebum drawls, as though Jimin didn’t tell him to leave just a few minutes ago.\nJungkook doesn’t budge from the doorway. His lips are pressed thinly together and he looks past Jaebum, his eyes fixed accusingly on Jimin instead. That look makes Jimin want to curl up, but he can’t get himself to look away. He swallows, guilt lodged in his throat, face still hot from the shame.\n“Jiminie-hyung,” Jungkook says, barely above a whisper. “You know we’re not allowed to bring anyone back to the dorms.”\n“I  know, dammit, I just—” He breaks off with a snarl, frustrated with himself. The disbelief on Jungkook’s face makes him feel pathetic. He didn’t want Jungkook to see him like this—desperate and heat-ridden and stupid for alpha cock, just like the omegas that everyone talks about. This heat makes everything a mess.\n“Jaebum-hyung. I’m sorry. Can you… please leave?” he asks, his voice strangled and weak, more unsure than he wanted it to sound.\nJimin knows he hit a nerve, calling Jaebum out with another Alpha in the room. He’s fucked up. He could see it in the way Jaebum’s jaw juts out, his lips curling derisively. There’s a visible tension in Jaebum’s muscles. His shoulders roll, languid, reminding Jimin of a jaguar with its head low and its teeth bared like it’s ready to pounce. Jimin holds his breath, stills his body and does his best not to provoke him further.\n“He asked you to leave.”\nMotherfucking Jungkook.\n“What,” Jaebum jeers. “Are you gonna take care of your hyung instead?”\n\n “Jaebum-hyung.” \n\n“As if  you  could,” Jungkook bites.\n“I could do it better than you, little baby Alpha.”\nJungkook bares his teeth.\n“Don’t call me that.”\n“Oh, did I hit a nerve?” Jaebum taunts.\n“Jiminie-hyung’s not thinking straight and you’re taking advantage of him, so leave.”\n Taking advantage of, what the fuck? Jungkook thinks he’s this helpless?\n“Really? Because he was moaning out to me over the phone,” Jaebum retorts, his chin high.\nJimin shrieks,  “Jaebum-hyung!”  His face is boiling, humiliated. He can’t believe Jaebum just said something like that—he looks so bad in front of Jungkook, so damn pathetic, desperate and needy from the hormones. Fuck, he just wants to die. He’s so mortified.\nJungkook doesn’t take it too well. He sucks in his cheeks, jabs his tongue against the side of his mouth like he’s biting on it with his molars. Jimin could see the tremble of rage in Jungkook’s arms, the way his fists clench and unclench, shoulders stiffening, so close to throwing a punch.\n“He just told you to leave,” Jungkook stresses, words harsh and sibilant. “He doesn’t want you.”\n“That doesn’t mean he wants you, baby Alpha.”  And Jimin’s fucking tired of this. Their playground fight is giving him a headache and he’s not about to be fought over like some piece of meat. He’s done being some goddamn trophy, done with all of these Alphas and their stupid sense of pride.  “Get out.”\nTheir heads whip toward him, squabble interrupted.\n“Both of you,” Jimin snaps. “Get the hell out of my room.”\n“You’re in heat,” Jaebum says, dumbfounded “You can’t go through one without an Alpha.”\n“I can. And I will!” he barks. His face is tightening like a clay mask, the flush of anger itching under his skin.\n“I don’t want to drag this out any longer so please. Leave.”\nJaebum gawks at him, doesn't believe what Jimin’s saying. When he starts gnawing on the inside of his cheek, Jimin readies himself for another argument. Jimin’s temper is short and he knows Jaebum’s isn’t much better. But Jaebum is more receptive than Jimin expects him to be—maybe it’s because Jimin told both of them to leave, called the battle a draw. Alphas were always so petty.\nWith a growl, Jaebum tears himself off of the bed, brushes his shirt down like he’s trying to salvage that last bit of pride.\n“Make up your mind next time.”  He bulldozes through Jungkook on the way out, knocking into him with his shoulder, and Jimin holds his breath, prays to god Jungkook can hold back his temper. He doesn’t want to sit through another one of these Alpha competitions.\nBut Jaebum leaves with no other complications. When the front door slams, Jimin flops back onto the bed with a heavy sigh.\nHe fucked up.\nIt’s going to be awkward from now on, no doubt about it. Even if he didn’t fuck Jaebum, it’s never going to be the same. He can just imagine the lecture that’ll be waiting for him when Namjoon finds out, when word eventually gets out to Jackson. He’s just hoping the whole thing won’t blow up and involve the company too. He doesn’t need this to turn into some big scandal, doesn’t want to make the omega name worse than it already is.  Jimin pulls at his shirt, itchy from where it’s damp and clinging to his skin. He’s still feeling restless from the heat and Jungkook’s presence is driving him nuts. He can still smell him from the doorway. He needs Jungkook to leave. His temper’s getting shorter by the minute, his sanity dangling by a thread.\n“Jungkook, I told you to get out,” he says tersely, clenching his eyes shut, breathing as shallowly as he can, tries not to inhale that rich, dark cacao.\nJungkook stays rooted to the ground, body blocking the doorway. Even without looking he can tell Jungkook didn’t leave yet—his smell still lingers heavy in the air, like a candle that’s been left burning, forgotten.\nJimin peeks up and sees the lost expression on Jungkook’s face. His eyes are wide and bulging like a deer in headlights and his hands are fisted, gripping the fabric of his jeans so tight his veins pop out.\n“Jungkook,” Jimin says, exasperated. The heat’s building again in his stomach, his body seems to twitch like it’s begging for it.\n“Hyung, I’m sorry, I—”\nHe finally shifts, walks over step by step, his feet dragging like his legs are somehow moving of their own volition. His face is still blank. Stunned.\n“Hyung,” he says again, voice wrecked and torn out of his throat.\nThe cacao gets stronger with each step that he takes and Jimin’s breath gets heavier, his legs draw up of their own accord, closer to his body, curling in. His palms are sweating, fingers numb and buried in the sheets. He can’t—he can’t do this. Can’t do this to Jungkook.\n“Jungkook,” he chokes. “Jungkook, if you come any closer I’m gonna punch you.”\nJungkook stops in his tracks but his face contorts, distraught.\n“I’m sorry,” he says, nearly a sob. “I just—you just—you smell like him and I can’t take it. I need to fix it.”\n“Fix it?” Jimin asks in a daze, blood rushing in his ears.\n\n\"Please.” \n\nHe doesn’t know what “fixing” means exactly, but Jungkook looks so pained and desperate that Jimin gives in with a barely a nod of his head.  Jungkook collapses on him with a sigh of relief, squeezes all of the air out of Jimin’s lungs with his weight. He cloaks Jimin’s body with his own, presses up against him from head to toe, heavy and hot and smelling so good that Jimin whimpers.\nIt’s like the kitchen incident again. Jungkook’s nose brushes against his neck, slow and deliberate, painting in short strokes, lines that lead all the way down to his collarbones. The warm puffs of air as Jungkook breathes against him makes him shiver, and his pulse stutters at the way Jungkook’s nose traces lower, tickling him with its light touch. Jungkook’s scent is like a cloud around him, a fog of warmth and sweetness that surrounds him and makes his cock hard, makes the slick drip out of him again, like his body suddenly remembers just how badly it needs a knot.\n“Hyung,” Jungkook says, voice tight. “Jiminie-hyung, I’m sorry. I can’t—you just smell so—”\nJungkook’s teeth are at his neck now, biting at his skin like he’s trying to erase any traces that Jaebum may have left behind. It’s hot and wet and Jimin trembles, feels the stinging jolt of the bites all the way down to his fingertips.\nHe was right. It’s so different with Jungkook—it’s a jittery high that makes his head teeter close to insanity, makes his body itch for more.  Jimin’s breaths start coming faster, harder, like his lungs are trying to inhale as much of Jungkook’s scent as possible. He doesn’t even know how far he’s gone until he feels the sharp nip of nails digging into his palms from where he’s fisting the sheets.\n“Jungkook,”  he gasps.\nJungkook groans, still licking at Jimin’s neck, and Jimin hisses at a particularly hard bite at his jawline. It’s like Jungkook’s trying to eat him, tear him to pieces with every peck like some bird of prey.\nJimin loves it. The fever’s coursing through his veins like rapids. He’s so fucking wet and desperate and he can't help but want more.\n“Jungkook,” he shudders, lets out a shaky moan when Jungkook’s tongue trails up to his ear, “—Jungkook, I need—” I need you to fuck me.   Jungkook must have guessed what he’s trying to say from the way his head reels back, mouth gaping like a fish out of water, snapped out of his spell. Jungkook’s face pales, eyes running up and down Jimin’s body frantically as though Jimin’s a mistake, as though he’s a crime Jungkook just committed and the realization finally hit him cold.\n“Jiminie-hyung,” he stammers, distressed.\nHis hands retract so quickly it’s like Jimin burned him. And fuck, Jimin should have known. It’s just his omega pheromones turning him into Alpha bait again.\n“Hyung, I’m—I’m so sorry,” Jungkook babbles. “I just—I can’t.”\nHe shrinks back, pulls himself off and flees before Jimin can stop him, disappearing to his room faster than Jimin can blink.  And Jimin is left on the bed, dizzy and hurt, slick still leaking out of him. His gut twists, acid rising up his throat.\nHe can’t believe Jungkook just got up and left. Ran away because Jimin couldn’t keep his hormones in check, because he got too fucking desperate, just like every other pathetic omega.\nFuck, he’s already messed things up with Jaebum. Jimin knows this is going to be it for them too—that Jungkook’s just going to ignore him again, forget that anything ever happened.  And it might be the heat that cuts his temper even shorter but Jimin’s had it. He’s so tired of the way these hormones are tugging him around on a leash, tired of these Alphas that can’t control themselves around him, tired of Jungkook walking on eggshells around him.\nThe rage barrels through him like a storm.\nHis vision clouds, irritation licking at him, itching at the pads of his fingers. He flings himself off of the bed and stomps over, doesn’t even bother to knock on the door, just slams it open, fuck courtesy.\nJungkook freezes from where he’s pacing, hair frazzled and mouth agape, wide eyes staring at Jimin in disbelief. That dumb look on his face makes Jimin snap.\n“Are you fucking serious?” Jimin snarls.\n ”Hyung,”  Jungkook croaks.\n“I’m sorry I’m just some pathetic little omega,” Jimin says, seething.\n“I—wait, what?” He frowns, face twisting in confusion. “What are you—”\n“You just—you just  mauled  my neck and then left. What the fuck, Jungkook?”\n“Hyung,” Jungkook stammers in distress, his face paling, shoulders hunching inward. “That’s not—I—”\n“—I’m sorry I don’t have any goddamn control over my pheromones but you can’t just—sniff me and freak out—”\n“—Jiminie-hyung, I’m not—”\n“—NO. Shut up and listen. I’m tired of everyone treating me differently just because I’m an omega. I’m not some fucking prize to be won or some new toy to try out. I’m your fucking hyung—”\n“I  know  that,” Jungkook shouts. “You think I don’t know that?!”\n“You’re treating me like I’m beneath you! You don’t even—” The words come out faster, like smoke spewing from a volcano. “—either you treat me like I don’t exist or you just hover around me like I’m pathetic and can’t take care of myself or something—”\n“That’s not what I was—”\n“And Jaebum-hyung!” Jungkook stiffens, cheek protruding from where Jungkook’s tongue pokes against it, so lousy at hiding his annoyance. Jungkook’s silent competition with Jaebum somehow incenses Jimin even more, makes Jimin foam at the mouth. “You’re always such an asshole to him—and to all of these other Alphas that come within smelling distance of me. I’m not some—some princess  that needs your protection. I’m a grown ass man—”\n“I  know—”\n“Then stop it!” Jimin shrieks, his temper spiraling out of control. “God, as if it’s not gonna be awkward enough. You just had to be a dick to him—”\n“Why’d you even invite him?!” Jungkook fumes, his neck muscles tensing, vein popping as he clenches his jaw.\nJimin glares at him.\n“I was in heat,” he seethes, baring his teeth. “And what does it fucking matter?”\nJungkook scowls and crosses his arms like a petulant child.\n“Why didn’t you call—”\nHe spits, “Call who?!” Because god forbid if Jungkook thinks he should have called Yoongi or Namjoon for help.\nBut Jungkook has the sense to keep his mouth shut.\n“Yeah, that’s what I thought,” Jimin says, his voice coming out more abrasive than he expected. “I’m just sick of you treating me like a child—”\n“You’re  the one treating  me  like a child! I didn’t even—I wasn’t even trying to, I just—I can’t fucking help it and—goddammit hyung,  stop coming closer.”\nJimin freezes, grinds to a halt right at the foot of Jungkook’s bed. The panic rushes in like a cold chill when he realizes how close he’s gotten, how far he’s moved without even knowing. Even when he’s pissed off the omega in him still drags itself over to Jungkook like a magnet. Fuck, he’s never felt so out of control.\n“Fuck—fucking—” Jimin breaks off into a sob, just collapses to the floor, boneless, fight draining out of him like water through an open hand. “This is such bullshit.”\nJungkook doesn’t say anything, doesn’t even look at him. He just sits down at the far end of his bed, his entire body so tense Jimin can see the strain in his muscles. Jungkook’s hand is rubbing at his scalp in anguish, digging through his thick hair like he’s trying to massage away a headache.\nJimin’s so sick of what the hormones have reduced them to, just two horses on a carousel, constantly running in circles around each other.\n“I’m tired of this,” he says.\nJungkook grunts in return.\nAnd Jimin doesn’t know why he says it—maybe it’s the irritation from the heat, or maybe the way all of his frustrations have been building up like a tower of blocks, layer upon layer until it sways, seconds away from toppling over.\nHe blurts, “Why’d you have to be a goddamn Alpha out of all people?”\nJungkook’s head jerks up and he sends Jimin a nasty glower.\n“I didn’t ask for it,” he snarls.\n“That’s not what I—” Jimin stops himself and breathes in slow, clenches his fists in his sweats to keep himself from snapping again. He knows he’d be fighting a losing battle. He doesn’t even remember what this whole argument is about anymore.\n“Forget it,” he says with finality. “This is ridiculous. I’m going.”  He pushes himself up and makes a move for the door but there’s a sudden grip on his arm that tugs him back, firm and tight, keeping him from leaving.\nJimin twists his head back to see the way Jungkook’s face is slack, mouth gaping in shock.\n“Shit, I—”\nThe hand recoils, flinching back, and Jungkook makes a noise of despair.\n“I’m sorry, I don’t know why I—” He stops and squeezes his eyes shut, clamps his lips tight as though he’s trying to hold back a scream. “Hyung, you should go,” he rasps.\nThe anger rushes back with a vengeance, temper building up higher than the pressure inside a whistling kettle. “What, so you can pretend like nothing happened again?”\n“Jiminie-hyung,” he stresses, hissing through the front of his teeth.\n“This is what I’m talking about—you just sniff me and then pretend like I don’t exist. I get that you Alphas can’t control yourselves but—”\n“That’s right,” Jungkook barks, his own patience wearing thin. “I’m just a poor little baby Alpha with no restraint.”\n“That’s not what I said.”\n“It basically was,” Jungkook scoffs.\n“You’re being such a goddamn child!” Jimin shouts, fed up. “When did you get so—”\n“So—so what, hyung?” he goads.\n“Unruly! Like some—some—” Jimin growls, hates how ineloquent he is, how he can never find the right words to say.\n“Some monster?” Jungkook spits.\n“What?” Jimin squints.\nSince when did this entire thing get so out of control? He feels it slipping between his fingers, bolting out of his grasp like a runaway train.\nJungkook stares at him unflinchingly, his jaw set, eyes cold and defiant.\n“I’m a monster, right? Just some animal? Some beast that can’t control himself?”\nAnd Jimin hates the words that Jungkook’s putting in his mouth. His fingers are flexing in irritation, itching to punch that condescending glare off of Jungkook’s face.\n“You’re being ridiculous.”\n“Hyung,” Jungkook says sharply, clutching the edge of his mattress like it’s the only thing keeping his self-restraint in check. “Leave.”\nJimin’s reached his breaking point, sick of Jungkook treating him like a child, shooing Jimin away when he’s done with him.\nHe growls and storms over, furious, grips Jungkook’s shirt before he can hold himself back. “Don’t you fucking tell me what to do,” he hisses in his face. \nJungkook’s eyes flash as though he’s been challenged.\nHe utters, low and dangerous, “Jimin-ah. If you don’t leave, I’m really not gonna control myself.” \nFor some reason, Jimin can’t get himself to move. His hands are still fisted in Jungkook’s shirt, his feet glued to the floor. His heart is pounding like a bass drum and he stands stock-still, petrified, like some caught prey.  And then he’s being tugged down into Jungkook’s bed, his back pushed into the mattress. Jungkook’s scent is soaked deep into the sheets, the smell so thick that Jimin swears it’s woven into every thread. The cloud of cacao envelops him, cloaks him like a down blanket in the middle of summer, and his irritation melts right off. A low whine bubbles up inside of him, lodged in his throat.\nHe hates the way his body gives in so easily when he was so pissed just seconds before. But Jungkook has always done that, bends Jimin just like a reed when Jimin’s redwood to everyone else. Thaws him like ice.\nThere’s a long, shuddering breath coming from above. Jungkook hovers on top of him, not touching him in the slightest yet still managing to twist and churn the heat simmering in Jimin’s gut. In the corner of his eyes he can see the way Jungkook clenches at the sheets, his veins bulging, raised under his skin.\nWhen Jimin glances up, Jungkook’s eyes are scrunched tight like he’s in pain.\n“It wasn’t supposed to go like this,” Jungkook says, voice strained, thick-sounding like he’s trying to hold back his tears. “Not—not when you’re in heat.”\nBut even as he says that, he presses his hand hot against Jimin’s chest, dragging lower and lower, searing Jimin even through his shirt. Jimin’s in a daze, can’t find it in him to respond.\n“I’m sorry, hyung. Really am a monster,” he mumbles. “The shittiest Alpha in the world.”\nThe hand is splayed flat against Jimin’s hips now, slowly creeping up beneath the hem of his shirt. His stomach quivers when he finally feels the burning press of Jungkook’s fingers against his bare skin. Jimin’s head is foggy, high from the heat and from Jungkook’s smell—but somewhere through the blurry haze, he hears the apologies tumbling out of Jungkook’s mouth, pleading and desperate: “—sorry—I’m so sorry. You should’ve—you should’ve called Yoongi-hyung or Namjoon-hyung. I’m sorry—”\nHe doesn’t get why Jungkook’s apologizing so much—even through the fog he knows Jungkook’s being stupid, can’t believe Jungkook would even consider those two. Dully, Jimin mumbles to him, “You’re an idiot,” though he can never help the fondness laced in his words.\n“Fuck, you’re just so—” Jungkook breaks off, voice on the edge of a sob, and he dips his head to the crook of Jimin’s neck. He nibbles at the skin exposed by Jimin’s low shirt, mouths at it hungrily, and Jimin does a full-body shiver, feet flexing against the sheets. Jungkook’s breath is warm, caressing his skin as he speaks. “I’m sorry, hyung—I’ve tried. I’ve tried so fucking hard to control myself but I’m just so—” Sentences unfinished again.\nJimin frowns.\n“What are you…?”\nA particularly hard bite to his collarbones makes him gasp, question forgotten. The hand is moving up his chest, slow and torturous, sliding up his body before it settles on gripping his side tight. A thumb rubs against his nipple, massages it in rough circles, and Jimin can feel himself getting hard again. Fuck, he’s dripping right into the sheets.\n“Hyung,” Jungkook says it like he’s praying. “Hyung, you’re driving me crazy. You smell so good I just wanna—devour  you.” And Jimin wants it too, wants Jungkook to drain him completely. Eat him up until there’s nothing left. “—I wanna mark you up. Want all the other Alphas to smell me on you.”  His shirt is hitched all the way up, scrunched underneath his armpits. Jimin’s torso is exposed to the cold air but he’s feeling overheated, his body shivering at the way Jungkook nips at his chest, a thumb still pressing firmly on his nipple. When Jungkook sucks at the other one, tongue flicking over the bud, Jimin can’t help but whine, shoots a hand up to grasp at Jungkook’s hair. He knows he’s pulling hard but Jungkook doesn’t stop. He just moans when Jimin squeezes the strands between his fingers, tilts his hips towards Jimin and grinds his cock against Jimin’s leg.\nJimin gasps, oversensitive and dizzy. The hands feel so good, so large and hot against him, and Jungkook’s cock rubbing against him is making his own twitch in need. Jungkook grabs and pulls at him, slides his hands all over Jimin’s body, and Jimin moans, blood buzzing in his ears, arching towards Jungkook. He’s so needy it’s embarrassing but he wants more. Wants to feel full.\n“Jungkook,” he calls noisily, voice pitched in desperation. “Jungkook, fuck me.”\nJungkook’s hands grip him on reflex, a clamp around his ribs. “Jiminie-hyung,” Jungkook groans. “You’re heat-drunk, you don’t—you don’t know what you’re saying.”\n“That’s not a thing, stupid,” Jimin murmurs, body lurching when Jungkook pinches at his nipple a little too hard, when he bites deeper than necessary.\n“I can’t,” Jungkook moans against his chest, low and ragged. “Hyung, you’re in heat. You’re—”\nJimin grips Jungkook’s hair tight, pulls his head back until he’s looking Jimin in the eye, and Jungkook looks just as gone as Jimin probably does right now, his pupils dilated, face a little pink.\n“I want it,” Jimin pleads. “Jungkook, I want you to fuck me.”\nAnd he knows he might regret it later, that Jungkook might avoid him again despite the stupid argument they just had, that it might fuck up things between them forever—but his chest is squeezing so tight that he can’t breathe and right now, his rationality is gone. He’s so strung out, just wants to be as close to Jungkook as possible, wants Jungkook’s scent to bleed into his skin, wants Jungkook so deep inside of him that he would end up aching for weeks.\nJimin doesn’t expect Jungkook’s face to crumple up like he’s about to cry.\n“I’m sorry—I like you—I really  like you, hyung. I’m sorry—”\nJungkook kisses him like he’s starving, teeth clicking when he swoops in too quickly. He dips his tongue in and tastes Jimin wherever he can, and Jimin’s body tingles at the way Jungkook kisses, impatient just like him, wet and hot and frantic, as though he’s scared Jimin will change his mind.\n“—I like you, hyung,” he breathes, words lost through the kisses. “I like you.”\nHe says it over and over, and Jimin’s pulse flutters when it finally sinks in, his lungs constricting at the strain in Jungkook’s voice, the desperation. But he brushes it off with a grimace and reminds himself not to get his hopes up. It’s just a side effect of the hormones, he should know better—\nBut he doesn’t want to think about that right now. Not when Jungkook’s tongue is sliding against his own, wet and hot.\n“Jungkook,” he gasps. ”Hurry.” \nJungkook lets out a weak groan, fingers digging into Jimin’s shoulders like he’s trying to restrain himself, but he still kisses Jimin, nips at his neck like he’s starving.\n“Hyung, I—I’m so sorry it has to be like this.”\n ”Shut up,”  Jimin says, throat closing up at the agony in Jungkook’s voice, tight and pained like he’s been punched in the gut. It’s all his fault.\n“I’m the one who should be apologizing, stupid.” Jimin’s voice cracks. “It’s these goddamn pheromones. I’m sorry.”\nThe kisses stop and Jungkook rears back with his brows furrowed.\nAnd there’s a sting at the back of his eyes, a sharp pulling sensation that burns when he sees Jungkook’s face in front of him. God, he can’t believe it ended up like this, when Jungkook doesn’t even want it.\nJimin tips his head back towards the ceiling, blinks hard to keep the tears from coming but it’s no use. It’s like all the tension culminated in this, building high until the tower finally falls, until Jimin breaks down, shoulders racking as he cries.\n“Hyung!” Jungkook hisses frantically, cupping Jimin’s cheeks with his hands. “Hyung—hyung, please.  Please  don’t cry.”\nThe concern in Jungkook’s voice makes Jimin sob even more. It reminds him of when they first debuted, when he kept on messing up, not as  perfect  as he needed to be, and Jungkook caught him crying in the middle of the night, saw him berating himself for not being better, broken under the pressure. Jungkook has always sucked at feelings so he didn’t say anything. Just crawled into Jimin’s bed and slept right next to him.\nBut everything’s so different now and it hurts. They’ll never have that same comfortability again. Jungkook hardly even comes near him now, not unless the pheromones make him, when it drags him like a prisoner to his cell.\nThese hormones just turned everything to shit.\nJimin brings his palms up to his face, presses them hard against his eyelids in order to stop the tears, but they keep bursting through.\n“Hyung,  please. I’m sorry—I’m so sorry. I don’t want you to cry.”\n“Stop apologizing!” he yells.\nHis lungs are faltering like someone popped them, he can’t get any air in, just keeps gasping and gasping. He hates this, wants it to stop, wants everything to go back to the way it was. But he knows it’ll never be the same, not when he’s an omega, when he’s—practically in love  with Jungkook.\n“I don’t want this.”\n“Jiminie-hyung?” Jungkook whispers.\n“I just—I  hate being an omega. Look at what these stupid pheromones did to you,” he wheezes, voice pitching in a whine. “I hate it.”\nJungkook grips Jimin’s wrists, pulls Jimin’s hands away from his face.\n“Hyung, what are you talking about?”\n“My omega pheromones are making you crazy!” he says, hysterical. Jimin forces himself to breathe but his lungs still feel like they’re collapsing in on themselves. “You don’t—you don’t know what you’re doing. I didn’t wanna force you into this.”\n“What?! If anything,  I’m  the one forcing  you  into this! Jiminie-hyung, you’re—” Jungkook’s voice gets smaller, sounding more broken. “You’re heat-drunk and I’m just—I can’t even control myself around you.”\nHe doesn’t expect Jungkook to break down too. He’s always managed to stay strong, never cries if he can help it—always tells them, “hyung, I’m fine,” an Alpha through and through. But now, Jungkook sounds so distraught that Jimin’s chest feels heavy, heart aching at Jungkook’s stifled sobs.\n“Hyung, I’m sorry—I tried  so hard. I didn’t—I didn’t want it to be during your heat. Didn’t wanna take advantage of you. Hyung, I  really  like you.”\nJungkook’s head drops onto Jimin’s chest, shoulders slumping, cheeks wet with tears. But Jimin’s dazed, stuck on Jungkook’s words.\nHe doesn’t want it during Jimin’s  heat.\n“Jiminie-hyung, I like you so much,” he cries. “I know I’m just some fucking kid—I’m the worst Alpha in the world, but—Jiminie-hyung, I like you so fucking much.”\nAnd the mask finally cracks. He can’t hide it any longer.\n“I like you too, stupid,” he spills, voice shaky from relief. He combs through Jungkook’s hair with a hand, clutches Jungkook to his chest, makes sure he’s not dreaming. He’s so damn happy.\nAnd Jungkook laughs. A laugh that’s pitched high in disbelief, one that makes his shoulders quake, sending vibrations through Jimin like a bow gliding over a cello string. Jungkook hugs him with all of his strength, arms squeezing around Jimin’s ribs, and the tension rolls through him. Jimin feels boneless, like he’s about to sink through the mattress.\n“God, I’m—” Jungkook’s smiling and breathless, eyes watery from the tears, shining so bright that Jimin’s heart jumps to his throat. His chest is so full it’s a breath away from bursting.  He pulls Jungkook down, kisses Jungkook without hesitation, hard and bruising, desperate to make up for all the missed opportunities. He tastes salt when he sucks at Jungkook’s lips but it slowly melts into something sweeter. It’s so much better, so much more  real.\nJungkook moans into his mouth, licks against his tongue, and Jimin shifts on the bed, the embers in his gut still burning low, so close to catching fire again. He can’t help but squirm at the wet slide of Jungkook’s tongue against his own. The kiss is still just as desperate before but it’s slower now. Deeper. Like Jungkook’s trying to savor every bit of him, make the meal last as long as possible.\n“Do you know how good you smell, hyung?” Jungkook growls, pulling at Jimin’s bottom lip with his teeth. “It drives me insane.”\nOf course he knows. He could see it in the glossy, hypnotized eyes of the Alphas all around him, in the way they lean in when he passes. But nothing could ever compare to hearing  Jungkook say it out loud. It makes something inside of him purr, makes him curl up in satisfaction from being praised.  He tugs at Jungkook’s shirt and Jungkook gets the message, breaks the kiss to strip Jimin of his tee before he pulls his own off right behind it.\nJungkook’s skin is damp, cooler to the touch than Jimin expected, but maybe it’s because  he’s  the one burning up, body on edge from the emotions, from the hormones. His heat’s been wavering all day, rising and falling like a rollercoaster, but he can tell from the way his fingers tingle that it’s building up again, so close to reaching the peak.\nMaybe Jungkook smells the change in him too because he bites his way down again with a fervor, desperation rekindled. He’s grabbing at Jimin everywhere, sucking at every inch of skin like he’s trying to paint Jimin with bruises. He takes his time at the ‘v’ of Jimin’s hips, enamored by the way Jimin twitches with every nip there. And then he moves lower, mouths right at Jimin’s cock through his sweatpants, and Jimin jolts.\nJungkook groans, ragged and deep in his throat as his tongue laps wide over the cotton, licking like he can’t get enough, and Jimin whimpers at the feel of his tongue, his breath, so warm even through the fabric. The heat’s licking at his stomach, surging through him like a torrent branching into streams, flames blazing down lines of petrol. His hands flounder, scrabbling for the pillow resting beside him.\n “Jungkook,”  he whines, breath hitching.\nJimin can’t do anything but watch, glassy-eyed, as Jungkook pulls down his sweatpants and briefs in one go before he dives back in again, burying his nose at the crook where Jimin’s thigh and pelvis meets.\n“You smell so good,” Jungkook groans, nibbling at his inner thighs, and Jimin’s so tender and sensitive, his breathing quickens, cock pulsing as Jungkook gets closer. And then Jungkook takes one long kittenish lick at his cock and Jimin’s body jumps, hips bucking up from the bed.\nHe moans, a hand fumbling down, clutching at Jungkook’s hair frantically, the other hand gripping at the pillow next to him. His chest hiccups at every lick, toes flexing, body twitching at the slide of Jungkook’s tongue against him, so firm and wet.\nAnd then Jungkook swallows him whole, overzealous, taking in as much as he can with a glint in his eyes, and Jimin’s body is strung taut like a fishing line, so close to breaking.\n“Oh—oh,  fuck,” Jimin whimpers, hips snapping when Jungkook’s tongue swirls around his cock. The head of it keeps grazing the roof of Jungkook’s mouth and everything’s so warm and wet and soft, so good that his toes curl, calves tight and close to cramping. He keeps bucking up with every suck, out of pure reflex, and Jungkook gets fed up with it, shoves Jimin’s hips down into the mattress with a forearm.\nJimin whines and glances down, only to meet Jungkook’s eyes.\nThe plain hunger on his face reminds Jimin of the “starving Alphas” that Namjoon talked about. His eyes are dark and predatory, like a lion playing with its dinner, toying with its prey before it devours it whole. That intense look makes Jimin’s heart race, blood rushing through his veins at a dizzying speed. He can’t help but squirm in Jungkook’s grip, clutches the pillow closer to him for comfort, the only thing keeping his sanity in check.  “Can you smell me on that?”\n“What?” he stutters, head still in a daze, can’t think of much else but the soft lips rubbing down the side of his cock, the flicker of tongue against the head.\n“On the pillow,” Jungkook murmurs, low in his throat.\nJimin couldn’t even tell, so surrounded by Jungkook’s scent it’s like he’s been gassed. Everything becomes a blur—\nBut he grabs the pillow just to make sure, turns his head towards his shoulder and sniffs it in, and  fuck  it’s so good. He knew nothing could even compare to Jungkook’s smell, so sweet and warm and dark, like chocolate melting on his tongue. He wants to suffocate on it. His nerves are sizzling, the smell making him so heady he feels like he’s floating.\n“God, I can smell you dripping even more,” Jungkook rasps. “You like it, hyung? My scent?”\n“You’re so annoying,” Jimin grits, cheeks burning, too embarrassed to answer his question. He wants to toss the pillow away just to spite him but he can’t let go, the scent so goddamn good that he presses it closer, breathes it in like an oxygen tank, his lungs already bursting full but still not satisfied. He wishes they didn’t have a limit—that he can just breathe Jungkook’s scent in full. A second away from it and it feels like he might drown.\nJungkook doesn’t seem fazed by his non-answer. He just grips the back of Jimin’s knees, rolling him all the way back until Jimin’s hips are off the bed, his body folded nearly in half. Jimin whines, flushing in shame at the way he’s exposed for Jungkook to see. But Jungkook doesn’t give a damn about Jimin’s modesty. He just stares at Jimin’s ass, eyes glazing over at the way the hole twitches so hungrily for him.\n“Fuck, just look at you,” Jungkook says thickly. “You’re so wet for me, hyung.”\nHis fingers rub through the slick, massaging it against Jimin’s skin before he wets his palm with it, uses it as lube to jerk off Jimin’s cock. “So wet and messy everywhere. So pretty.”\n“Jungkook,” he keens, high and breathy, muffled through the pillow. His thighs shake when Jungkook focuses too much on the head, when his palms roll around it, rubbing circles against the tip.\n“Good?”\nJimin nods, doesn’t trust himself to be coherent right now, just tosses his head back and holds on tight.\n“Is my scent making you feel good, hyung? Making you drip?”\n“Jungkook— god, just—shut up and  fuck me already. ”\nJungkook groans, stops teasing Jimin’s cock to grab at his ass instead, squeezing it and spreading his cheeks wide. “I really don’t think I’m gonna last,” he admits, voice a little scratchy. “I’m gonna come any second now.”\n“So come first and then fuck me,” Jimin says needily.\nJungkook snarls and nips at his ass, tiny stinging bites all over his skin before he uprights himself, stroking his leaking cock. Jimin’s so gone he doesn’t even remember when Jungkook took off his pants.\n“Fuck, why do you have to be so—and your smell—”\nJimin’s breath is short from being folded over, gets even shorter when he sees the way Jungkook looks at him, intoxicated, pupils so blown it’s like he’s high. His knees are almost touching his shoulders from Jungkook rolling him back but he doesn’t give a damn anymore. He just holds onto his thighs and puts himself on display, his shame completely out the window.\nJungkook hisses through his teeth as he strokes, gripping Jimin’s ass with the other hand.\n“Wanna mark you. Wanna—wanna come all over you,” he gasps, fingers digging into Jimin’s skin. Jimin stares up at him, dizzy and breathless, head a little drunk from the heat.\n“Do it,” Jimin moans. “Come on me.”\nJungkook grabs his ass so hard Jimin thinks he’ll see bruises in the morning.\n“Shit, I’m gonna—”\nThe squelches get louder and wetter. Jungkook’s neck is straining as he pumps, his muscles tensing up, sweat glistening on his skin. Jungkook’s so attractive Jimin’s cock twitches just looking at him.\n“Jungkook,” he mewls. “Come on.” \n“So demanding,” Jungkook grits.\nJimin scrabbles to get a better hold of his thighs, fingers slipping from the sweat, and he fumbles down, spreads his ass instead, presents himself to Jungkook. Jungkook reaches his limit. He groans, positions his cock over Jimin so that he comes all over Jimin’s ass, his cum pumping out hot and wet, mixing in with Jimin’s slick.\nJimin’s body curls in with how good it feels, how satisfied the cum makes him, like the omega in him is purring from being properly marked.\n“You smell even better with me all over you,” Jungkook says raggedly, struggling to catch his breath.\nHe eases Jimin’s body down, rests Jimin’s ass in his lap as he takes a moment to recover. With a hand, he rubs his cum against Jimin’s hole, massages it into Jimin’s skin like he’s painting with it. The look on Jungkook’s face is reverent, almost entranced. Something about it makes Jimin’s body stir, and he blurts out, “Lemme taste.”\nThe hand stills and Jungkook’s head whips up.\n“Fuck,” he breathes.“This is like a dream.”\nThe fingers are damp with a mixture of cum and slick when he brings it up to Jimin’s mouth. He doesn’t let Jimin taste it yet, just smears it across Jimin’s bottom lip like it’s lip balm before he finally dips his fingers in.\nThe cum doesn’t taste the way Jungkook smells—he doesn’t really know what he was expecting. But the idea of tasting Jungkook still gets him hot, and Jungkook’s fingers rubbing against his tongue makes him burn even hotter. Jimin sucks on the fingers like he’s sucking cock, shows Jungkook just how hungry and desperate he is. He swirls his tongue around the tip of Jungkook’s fingers and Jungkook sucks in a breath. Jungkook stares at Jimin’s lips, punch-drunk, entranced, and Jimin is pleased to no end.\nThe fingers leave his mouth too quickly, reaching down to rub at Jimin’s entrance instead.\nJungkook’s index finger breaches him first, slow and tentative, like Jungkook’s not sure it’ll fit. But Jimin sucks it up greedily, takes it all in with a low needy whine. His thighs are shaking, head swimming from how good it feels to be filled up.\n“Sorry, I don’t—really know what I’m doing,” Jungkook confesses as he adds another finger. Jimin can’t help but prickle in annoyance because of course the golden maknae is good at sex too—god forbid there’s even one thing he sucks at. But he’s grateful, that Jungkook can push aside his pride just for a little bit and be honest instead.\n“S’good,” Jimin mumbles, feet planted on the mattress but knees buckling, legs spreading apart even wider. “Your fingers feel good.”\nJungkook gnaws on his lips like he’s trying to bite back a moan, eyes glazing as he watches the way Jimin swallows up his fingers. His eyes keep flickering between Jimin’s face and Jimin’s ass, like he can’t decide which one makes for a better show.\nWhen Jimin moans, high and breathless, Jungkook settles on watching his face.\n“Good?” Jungkook breathes, awed. Jungkook's fingers are still thrusting in and out of him, prodding against his insides, nice and slow. “Here?”\n“Ah,  fuck—” Jimin keens, chest lurching, body strung so tight he’s about to snap. Jungkook’s fingers keep on grazing something as it pushes inside and the constant pressure builds up so good that Jimin’s stomach spasms, legs drawing up.\n“I can feel you tighten around my fingers,” Jungkook rasps, lifting one of Jimin’s legs up so he could watch the fingers go even deeper. He kisses the side of Jimin’s knee and Jimin just stares up at him, dazed and helpless, shivering at the press of Jungkook’s long fingers inside of him. The heat’s built up so high now, the rollercoaster done with its ascent, teetering at the top of the peak, nowhere to go but down. Jungkook’s fingers are bringing him so close to the edge.\n“God, I’m—” His arms are flailing, gripping at the pillow, at the sheets, at the arm that’s holding up his thigh. His breath is coming faster and faster, a whine building in the back of his throat.\n“Wanna see you come all over yourself,” Jungkook murmurs, low and husky, fingers twisting as he thrusts. He puts a hand back on Jimin’s cock but Jimin pushes the hand away with a whimper.\n“Not—not yet.” He tries to get his point across but Jungkook’s fingers are so damn distracting. “Jungkook—Jungkook,  hold on,” he says, voice cracking.\nJungkook doesn’t stop, fingers still fucking into him with vigor. But Jimin doesn’t want it like this, doesn’t want the itch to return once he comes. He wants Jungkook’s cock inside of him, his knot stretching him out.  He growls and shoves at Jungkook until he falls backwards.\n“Hyung, what—”\nHe loves the gasp that comes when he straddles Jungkook and reaches back for his cock.\n“Hyung, are you—are you sure?”\nJimin doesn’t answer, just jerks Jungkook off, memorizes the way his cock feels, so hot and heavy in his hands. It’s thick and veiny, curving towards Jungkook’s stomach, and Jimin can just imagine how good it’ll feel inside of him. He wants it so bad his hands are trembling.\n“Hyung, what about—”\n\n“Shut up.” \n\nHe lines Jungkook’s cock against his hole and sinks down slowly, lets gravity help him take it in, gripping his own cock with a hand to keep himself from coming too quickly. And god—this is what he’s wanted, what he’s been gagging for.\nJungkook’s mouth is slack, lips parted as Jimin takes him in bit by bit. Jimin wants to burn that awestruck look in his mind forever.\n“God, you’re so  tight,” Jungkook says, voice straining. His hands are gripping Jimin’s hips and his eyes flicker down, watches the way his cock disappears inside.\nAnd Jimin bottoms out with a gasp, body shivering when his ass is flush against Jungkook’s thighs. It’s so fucking deep and Jungkook’s cock feels so good, filling him up in a way that makes all of his nerves light up.\n“You okay?” Jungkook rasps, even though he’s the one that looks overwhelmed. His neck is corded, teeth clenched tight.\nJimin rolls his hips and shows Jungkook just how okay he is, earning himself a ragged moan. And it’s like Jimin comes unleashed, his mind shutting off, losing himself in the sound of Jungkook’s low breaths, in his scent, in the way Jungkook’s cock fills him up. He finally lets himself go, bounces on Jungkook’s cock in a drunken haze, completely lost. His legs want to give out but he keeps going, keeps fucking himself on it, fast and desperate, over and over, just wanting to feel it breach him again and again. It rubs inside of him so good he shivers and throws his head back, chest panting, moaning so loud he hears his voice echoing in the room.\n“Ji—Jiminie-hyung,” Jungkook groans, hands fumbling, grabbing onto Jimin’s hips. “Goddammit,  slow down.” But Jimin doesn’t hear him, completely drugged out, heat finally boiling over. He just wants to fuck himself on Jungkook’s cock forever, feel it imprinted inside of him.\n “Jimin,”  Jungkook growls in frustration, fingers digging in deep. “If you don’t stop, I’m—” he moans low in his chest, breath faltering, and his hands grip Jimin’s hips even tighter in an attempt to still it.\n“Jungkook,” he whines, leaning back on his palms. His back arches, stomach quivering at the new angle, and his thighs are burning from the way he’s working himself on Jungkook’s cock, riding him frantically. “Come on. Fuck me.”\nJungkook bites his lips so hard they look like they’re about to bleed. His eyes are clenched shut, like he’s trying to dissociate, struggling to keep himself in check. But Jimin doesn’t understand, doesn’t get why Jungkook’s holding himself back when all he wants is Jungkook’s knot inside of him.\n“I’m not gonna break, just—fuck me,” Jimin says breathily. “Please. Want you to wreck me.”  And Jungkook pushes him down in a split second, spreads Jimin’s thighs apart as he snaps his hips and Jimin keens, hands scrabbling at the sheets.\n“You drive me  crazy,” Jungkook groans, fucking into Jimin at a brutal pace, and Jimin just whines and takes it, jolting when Jungkook rubs against that spot again.\n“Oh god—oh fuck,” he heaves, spreads his legs even wider for Jungkook who pounds into him, grabs Jimin by the hips and pulls him down to meet his thrusts. Jimin’s body is burning up so bad it feels like he’s running a fever.\nJimin catches Jungkook’s hands and places them on his chest, wants to feel them grip him all over, wants the rough calluses on his body while Jungkook fucks him, and Jungkook moans, hands moving from Jimin’s ribs, smoothing down his sides, squeezing at his ass. Jimin’s nerves are tingling, toes curling. He feels it building up inside, coiling in his belly.\n“Jungkook,” he mewls, his legs shaking. “Jungkook, I’m—”\nJungkook doesn’t stop, hips still snapping, rutting into Jimin so hard Jimin feels like he’s going to break. Everything’s shattering in front of him and his body’s unraveling like a ball of yarn.\nJimin comes with a high breathy moan, chest heaving as the tension rolls through him, entire body flexing like a bow.\nJungkook just fucks him through his orgasm, harder, deeper, and Jimin gasps with each thrust. He’s starting to feel sore inside but the ache just incites him further, makes his stomach hot, boiling over. Jimin holds onto Jungkook’s shoulders and whines as he takes it, his cock twitching limply with every snap of Jungkook’s hips. Jimin’s body rocks with the force of each thrust, bed creaking, the slapping of skin so loud it’s embarrassing.\nJungkook drops down on an elbow, smothering Jimin with his body before he kisses him, all tongue and teeth, as deeply as he fucks him.\nJimin’s not as edgy as before but he still doesn’t feel satisfied. Won’t be until Jungkook stretches him out with his knot.\n“Want your knot,” Jimin gasps through the kiss, needy and shameless. “Knot me.”\nJungkook groans, cursing as he pounds his hips even faster, relentless.\n“Just wanna wreck you,” Jungkook says deep in his chest. He sucks at Jimin’s neck, thrusts getting sloppier, hips stuttering as he gets close, but even then he manages to hit something that makes Jimin’s body shudder.\n“Gonna knot you,” Jungkook rambles. “Gonna fill you up with my cum. Make you mine.”\n“Please,” Jimin begs.\nHe snaps his hips one last time before he groans, body stilling at the base of Jimin’s ass. Jimin can feel the way Jungkook’s cock pulses inside of him as he comes, and then slowly, there’s the pressure against his rim, the knot growing right at the base.\n“Ow, ow— fuck,” Jimin hisses, wincing as the knot expands, burning him as it stretches.\nJungkook’s breathing heavily on top of him, crushed chest-to-chest.\n“Sorry,” he sputters. “I’m sorry I couldn’t—”\nHe sounds distressed and Jimin’s irritable, overwhelmed from the knot growing inside of him. “I told you to stop apologizing,” he says, words broken as the knot stretches him further.\n“I don’t know, I should’ve—controlled myself better at least,” he says, muffled against Jimin’s neck. He’s still struggling to catch his breath but after a moment, he continues, more tentative than Jimin expects. “I just—I have no clue what I’m doing. But I like you, hyung. And not just because you’re an omega.”\n“But the omega part doesn’t hurt, right?” Jimin says with a snort.\nJungkook’s voice is small when he answers, “But that’s not why I like you. That’s not all you are, y’know?”  And it’s like the fog has cleared. Jimin realizes with stunning clarity that he’s been judging Jungkook a little too quickly.\n“You’re a good Alpha,” he says, hoping it makes up for all the words he spewed earlier, when he was too caught up in his own anger.\nJungkook’s head lifts, face still flushed from orgasm. His eyes are tender, soft, like that’s all he’s been waiting to hear, but his lips betray his eyes. They’re still pursed. Skeptic.\n“Are you sure?” he says with a self-deprecating laugh. “Because I feel like I fuck up so much. I don’t know what I’m doing half the time.”\n “You don’t know what you’re doing? At least you have people showing you. I’ve got nothing. It was all trial by fire.”\n“I think you’re doing fine,” Jungkook says gently.  He gets on his elbows, rearranges himself so that he can see Jimin’s face more clearly, but his knot shifts in the process, sending a spark through Jimin, awakening his nerves. He gasps, tightening around the knot involuntarily, and Jungkook groans back, grinds his hips against Jimin even more.\n“Hyung, we’re not gonna stop at this rate.”\n“Feels too good,” Jimin mumbles with a roll of his hips. His body’s finally sated, no longer itching, but he’s getting aroused again from the way the knot rubs up against him, the pain of the stretch receding, melting into something so good that his brain short-circuits. He can’t help but grind against it again, relishing in the feel of Jungkook’s cock—and the idea of Jungkook pumping cum into him, marking him from the inside out, fuck. He just felt an excited tremor run through his chest.\n“Hyung, I’m trying to be  serious  here, and you’re—you’re so distracting,” he grits, gripping onto Jimin’s hips again to keep him from thrusting.\n“I was thinking about your cum,” Jimin says, overheated. “Marking me inside.”\n“God, how am I supposed to control myself around you?” Jungkook groans.\nJimin replies, “Don’t,” but Jungkook just looks down at him, stunned.\n“You’re heavy,” Jimin complains after a minute. “Roll over.”\nJungkook sighs exaggeratedly but does it anyway, wraps his arms around Jimin’s waist and flips them until Jimin’s lying on top of him.\n“How much longer are we stuck for anyway?” Jimin asks, circling his hips.\nJungkook gasps, looks up glassy-eyed as Jimin clenches around him, rutting back against Jungkook’s hips.\n“I—don’t know,” Jungkook says, gripping Jimin’s thighs. “How much longer is your heat?”\n“Dunno,” he says, words slurring, head rolling back from the pleasure. When Jungkook drives his hips up, his body jerks, overstimulated, and Jungkook gives him a smug little grin.\n\"Let’s find out then.”\n\nThey say that Alphas differ from omegas in at least four distinct ways. And begrudgingly, Jimin has to agree, because his own ethnographic research kind of supports it.\n\n\n\nCase Study #1:\n\n\nHis size is a dead giveaway for his non-Alphaness.\n\n\nHe’s the same height as Yoongi, but the Alpha hormones must fuck with Yoongi’s spatial skills because he teases Jimin about his height along with the rest of the members.\n\n\nJungkook teases Jimin about his height the most, never lets Jimin forget about the size difference, jokes about it with the biggest smile on his face.\n\n\nBut in private he says that Jimin’s the best size for a backhug. He says it’s because his head can rest so comfortably on Jimin’s shoulder, right at the base of his neck, the part that Jungkook likes the most.\n\n\nAnd Jimin rolls his eyes, but he has to admit that he likes the way he fits against Jungkook too, likes Jungkook’s body draped over his own.\n\n\nWhen Jungkook’s smothering him in bed, a heavy arm draped over his side, Jimin asks somewhat seriously, “What if I was a tall omega?”\n\n\nJungkook pulls him in tighter and mumbles into his neck, “Don’t care as long as I’m the big spoon.”\n\n\n\nCase Study #2:\n\n\nOmega pheromones have an adverse effect on muscle mass.\n\n\nExcept when it comes to his ass, much to Jungkook’s delight, who grabs it and pats it whenever he gets the chance.\n\n\nAnd when the noonas give him yet another oversized sweater, Jungkook bites his lips and says to Jimin, “I want you to wear my sweater instead,” and Jimin slaps him on the arm, tells him to get lost.\n\n\nBut Jimin grabs one of Jungkook’s sweaters to wear anyway, just because he likes the scent wrapped all around him.\n\n\nAnd it doesn’t hurt that Jungkook’s eyes track him whenever he has it on. \n\n\n“Like it when you wear my clothes,” Jungkook murmurs, after he’s jerked Jimin off, made him come all over the sweater. “You smell like you’re mine.”\n\n\nCase Study #3:\n\n\nEven if he can get himself to look like an Alpha, he can’t get himself to smell like one.\n\n\nBut that’s fine, because he likes the way Jungkook gets lost in his scent—the satisfied sigh he breathes out whenever they’re hugging and Jungkook buries his nose in Jimin’s neck, forgetting to control himself on camera.\n\n\nHe still doesn’t know what he smells like, but apparently, he’s starting to smell more and more like Jungkook, because the hyungs know what happened the second they came back to the dorms.\n\n\nJimin had wanted to keep it a secret for a while (much to Jungkook’s chagrin), but that was shot down pretty quickly after Yoongi took one whiff of him and said, “You reek of Jungkook.” And frankly, after the frantic heatsex they had, he’s not surprised.\n\n\nJungkook overhears and smiles triumphantly, chest puffing out in pride. Jimin shoots him a dirty glare, but ends up wearing Jungkook’s shirts and sweaters anyway. Likes the way the scent soaks into him, bleeds into his skin.\n\n\nAnd Jungkook likes it too, tells Jimin he smells the best when he wears Eau de Jungkook.\n\n\n\nCase Study #4:\n\n\nJimin has made it a habit to catch himself doing non-Alpha things, throwing an arm over Jungkook’s shoulder, ordering him around on camera. And Jungkook’s okay with it, doesn’t let his Alpha pride get in the way.\n\n\nIn private, Jungkook’s the one ordering him around, pinning him on the bed and talking to him in a way that’s way too comfortable (and explicit) for anything on broadcast. And Jimin lets him do it because he doesn’t mind bending to him, too eager to please. \n\n\nBut Jungkook’s getting bolder and bolder, holding onto Jimin possessively, saying dangerous things on camera, and when Jimin calls him out on it, all Jungkook does is say, “Why do I have to be careful around the person that I like?”\n\n\n“You don’t like me,” Jimin goads. “You just want me because I’m a yummy little omega.”\n\n\nJungkook stares at him incredulously.\n\n\n“You and I both know you make a terrible omega. So that’s definitely not it.”\n\n\n“Well—you’re not that much of an Alpha either,” Jimin sputters.\n\n\nSurprisingly, Jungkook just beams.\n\n\n“That’s okay,” he says.\n\n\nJimin thinks so too.\n"
}