{
    "id": "8071780",
    "url": "https://archiveofourown.org/works/8071780?view_full_work=true",
    "author": [
        "andromeda3116"
    ],
    "title": "such selfish prayers",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "F/M"
    ],
    "fandoms": [
        "Avatar: The Last Airbender"
    ],
    "relationships": [
        "Katara/Zuko (Avatar)"
    ],
    "characters": [
        "Katara (Avatar)",
        "Sokka (Avatar)",
        "Aang (Avatar)",
        "Toph Beifong",
        "Suki (Avatar)",
        "Zuko (Avatar)",
        "Ty Lee (Avatar)"
    ],
    "additional_tags": [],
    "language": "English",
    "series": "Part 1 of such selfish prayers",
    "published": "2016-09-18",
    "completed": "2016-11-14",
    "words": "47,565",
    "chapters": "4/4",
    "comments": "750",
    "kudos": "14,841",
    "bookmarks": "4,212",
    "hits": "206,918",
    "summary": "<p>Katara's ambition, so long set aside for the good of others, breaks free and sets fire to her soul. Or, Katara has a vision of her canon future, casts it aside, and becomes a world-changing politician instead.</p>",
    "notes": "<p>many, many thanks to mechanical-orange for beta-ing this for me! also i haven’t read the comics and so they aren’t officially “canon” for this story, but i did pick and choose parts of them to incorporate, essentially wherever they would suit my purposes, and then discarded what didn’t.</p>\n<p>okay so in truth i intended this to be a one-shot, and then it ballooned out of my control so i said it would be a three-shot and then it continued to balloon out of my control, but i truly do believe that the next part will wrap it up.</p>\n<p>This chapter was hard for me to write. At first, I was too anxious about the upcoming election, and then it actually happened and I was too devastated to consider writing fanfiction. But then I stopped and thought about it, about the role of fiction in helping us -- both writer and reader -- process emotion, about how it teaches us how to get into the head of another person, about how cathartic it can be, how hopeful. And then I received a review where the person mentioned how important this story -- this Katara -- is to them, particularly after the election, how it lifted their spirits to see her being independent and strong and fearless.</p>\n<p>All of this led me to restart this chapter and take it in a slightly different direction than I had planned, to delve into a lot of the things I'm feeling and I've heard from others about what they're feeling. I have, here, established a politician-Katara who stands for all that we lost on Tuesday, and who -- if she were real and living in America now -- would never for a second consider giving up. She would stand and fight and never be silenced.</p>\n<p>And so I want to say -- if you're afraid right now, if you're hurting, if you're worried about the future, you are not alone. Don't give up hope, and don't lose faith. Not in yourself, and not in other other people. It seems insurmountable, it feels like things are going in an awful direction, and I'm not going to pretend that it's all magically going to be okay. But I am going to promise that you aren't alone. However alone you feel, however silenced, however afraid -- you are not alone. </p>\n<p>Let us come together, let us take Katara's words to heart, and never, ever turn our backs on people who need us. We need each other now more than ever. Stand together, hang in there, and hold on. It isn't okay now, but we will make it be okay in the future. Just hold on.</p>\n<p>If you ever need someone to talk to, send me a message. I can't promise that I'll have answers, but I will have a listening ear and a shoulder to cry on. And never, ever, ever, ever forget, I cannot stress this enough: <b>you are not alone.</b></p>",
    "text": "act one: this will be my last confession ('i love you' never felt like any blessing)\n.\n.\nKatara sits at the temple under the tree while Aang teaches his new people and tries her hardest to be content, but something inside boils and burns and seeps into her bones, and the thought falls into her head almost of its own accord.\nWhat if she just… left? Surely he would notice, right?\nSo she leaves, without fuss or fanfare, and wanders around the temple for a while that turns into a long while that turns into a very long while that settles on her heavily.\nAfter two hours, she begins packing.\nAfter three, she goes back to the tree, to see the crowd a little more dispersed, apparently beginning meditation, and Aang there among them, helping adjust this acolyte’s back and that acolyte’s arms. And she has a vision of her future, which is this.\nJust… this, all the time. Standing off to the side, unnoticed, apart. Of course, Katara can’t really contribute to the Air Acolyte’s lessons, so it’s not as though she could be doing anything else, except everything that isn’t right here. She could be doing something, helping people at least, and instead she’s sitting here – chained to Aang, useless.\nIt is, very suddenly, not enough to be with him. She isn’t sure it ever was, or if she was simply so desperate to be the person he saw when he looked at her – angelic, perfect, beautiful and shining and pure – that she stuffed all of the things that didn’t fit in with him and his schedule for their future down deep into her heart, and convinced herself that this was love.\nBut it’s so clear and so solid and so cold, that this is not where she should be. It’s taken nearly two years to come to this point, but it’s like she’s suddenly fallen off a cliff she’s refused to see coming: she does not belong here.\n“Hey, Katara!” Aang says, coming over to her, bouncing and bright and for a moment her resolve falters because he is so unaware that she is going to shatter him and she doesn’t want to break him like this, but it’s just not working. She loves him, she wants the best for him, but she also wants the best for herself, and this is not it, even a little bit. But at the same time, he looks so innocent and happy, and as sure as she knows herself, she knows: she is going to smile and nod and go along with it and ignore this little epiphany – until: “Did you like the lesson today?”\nHe didn’t even notice that she was gone for three hours.\nIt’s not – it’s not like it’s evil, it’s not like it’s a terrible thing. He was simply so engrossed in teaching the Air Acolytes and bettering the world that he never thought to look up to see if she was there. It doesn’t make him a bad person, but it does make Katara certain that this is not how she wants to live.\n“I wasn’t here, Aang,” she hears herself saying, a bit distant, almost like she’s watching the scene unfold as though they’re actors on a stage. She can hear the audience begging her not to do it, but her story ends here if she doesn’t. He looks confused, and she sighs. “I… I can’t do this, Aang. I’m sorry. I can’t just sit here and watch you all day, doing nothing.”\n“You’re… welcome to join,” he starts hesitantly, so confused.\n“I’m not an Air Acolyte, Aang, and I don’t want to be. I’m Water Tribe, and I’m going home.”\n“Well,” he says, worrying his lip. “I’ll get my things – ”\n“Don’t do that,” she cuts him off. “Don’t. You’re doing great things here, the Acolytes need you, and the world needs you and them.”\n“And I need you,” he says earnestly, and it tugs at her and twists at her but she can’t do this anymore.\n“No, you don’t,” she replies. “You didn’t even notice that I wasn’t here. I’m not criticizing you!” she cuts in suddenly, seeing him opening his mouth to retort. “It’s not your fault. You’re a teacher, and you were focused on your students. That’s a good thing. But you don’t need me.”\n“You don’t want to be with me anymore?” he asks in such a small voice that it threatens to dwarf her. She hesitates, and closes her eyes, and her resolves stiffens from coal to diamond.\n“I don’t want to spend the rest of my life sitting off to the side, watching you and doing nothing. I don’t belong here, Aang. I’m sorry.”\n“We don’t have to stay here – ”\n“Aang!” she cries, because can’t he see that he’s making this worse? But then she thinks that no, no he probably can’t. Aang has never exactly been the best at seeing the world through other people’s eyes. “You belong here. This is where you are doing so much for the world. But I don’t. I’m not doing anything except following you around. This isn’t what I want, this isn’t the life that I want.”\nThe audience in her mind weeps, and curses her for her cruelty, but this is no one else’s story.\n“You’ve done plenty!” he says, and she shakes her head.\n“No, I’ve been your girlfriend, that’s all. I think… I think we shouldn’t have gotten together in the first place,” she sighs, and he looks so hurt that she can’t look at him anymore. “We weren’t ready. I wasn’t ready, but I felt like I was… supposed to. Like it was my destiny. Maybe in the future,” she concedes. “Maybe then we can… work together. But this isn’t a partnership, Aang. Neither of us know how to be.”\nShe’s lying, a bit – she thinks she could probably figure it out a lot better than he can – but it makes it seem less like it’s all his fault.\n“I don’t understand,” he stammers, and she has reached the breaking point within the breaking point, and she cannot stand to do this anymore.\n“I’m sorry,” she repeats, choking back tears, and leaves. He calls after her, but she ignores him.\n.\nShe makes a stop in Kyoshi, but Suki is in the Fire Nation, being Zuko’s bodyguard, so the only person she really knows is Ty Lee. And it’s not like they’re friends, or like she wants to confide in the other girl at all, but when she steps off the boat, alone, Ty Lee locks eyes with her and seems to know.\n“Tell me,” she gasps, leaning forward and taking her hand. “What happened?”\nShe spent most of the boat ride crying alone in her room and feeling like The World’s Worst Person – not helped by the glares she started receiving as soon as word got around who she was and what she did to the Avatar – so she’s all out of tears.\n“I broke up with Aang,” she says, without inflection or emotion. “I told him that I didn’t want to be an Air Acolyte, and I left. Like a coward,” she adds to herself, miserably.\nShe’s been veering wildly between regret and relief, and she’s landed hard on the regret side this morning. But Ty Lee, for all of her bubbliness, seems to see things differently than other people.\n“Your aura is all one color,” she replies slowly, apropos of nothing, and Katara furrows her brow, confused, so she goes on. “It’s blue, which means you’re sad, but it’s not conflicted. You were always conflicted before.”\n“Why didn’t you say anything?” she asks quietly, face burning with shame from so many directions she isn’t even sure where to start untangling it. Ty Lee makes a face.\n“You didn’t want to know,” she answers, and shrugs, pulling her along with her into a small, one-room house that must be hers. “I have a policy of not telling people things they don’t want to know, especially if it’s about themselves. Wait here,” she adds, plopping Katara down at a little table and going over to a big box with a door, opening it and pulling something out.\n“What is that?” she asks, and Ty Lee glances back at her before shutting the door and beginning to rummage through a drawer.\n“It’s an icebox. Your brother came up with it! It’s really smart, he had this idea about storing food on ice to make it last longer, and I got the first prototype. Well, actually,” she adds thoughtfully, looking up, “Suki got the first one but then she had to leave for the Fire Nation so she gave it to me. It’s great, and it means that I can have things like this!”\nShe whirls around and brandishes a bucket of… something, with two spoons. Katara, who has never been fully at-ease around Ty Lee on the best of days, is on immediate alert, but she just sighs.\n“It’s ice cream, Katara,” she sighs, shaking her head and walking over to the table and setting the bucket in the middle of it. “It’s made with vanilla and matcha and cream, it’s amazing.” She holds a spoon out to her. “Here.”\nKatara hesitates, but then… word got around so quickly that she broke the Avatar’s heart, and she’s received a lot of ugly glares in the couple of short stops between the Air Temple and Kyoshi, and a lot of stony silence from the people on the boat.\nTy Lee is the first person who has been on her side.\nShe takes the spoon, and gingerly scoops up a little of the stuff and tastes it.\nIt is good.\n“Right?” Ty Lee gushes. “I’ve been experimenting with flavors, but this is my favorite so far. It’s the perfect cure for heartache. Well, except wine, but this is healthier.”\nShe’s not sure if it’s the ice cream or the friendship, but she does feel a lot better already.\n“I just… wasn’t happy with him,” she sighs, as though Ty Lee asked. “I tried so hard to convince myself I was, but it never… worked.”\n“I understand,” she replies, taking a big bite of the ice cream herself. “Sometimes you try your best not to hurt someone, but then it all comes out and you end up hurting them more than you would have if you’d just been honest from the start.” Ty Lee sighs. “I wish I had advice, but I don’t know how to fix it.”\n“I don’t need advice,” she says honestly, clenching her jaw and blinking back tears. “I know I did the right thing, eventually. We shouldn’t have gotten together in the first place,” she mutters, and Ty Lee gives her a thoughtful look.\n“No,” she muses. “You needed to learn what you wanted and didn’t want out of a relationship. I don’t believe that any love is wasted, even if it goes bad. You learned a lot about yourself, and you had fun, right? It’s worth it, then. Even if the end sucks.”\n“No offense, but when did you become the Relationship Guru?”\nTy Lee laughs. “Since I had to coach Mai through her and Zuko’s last breakup, and then her whole fling with Kei Lo. And I’ve had a couple of relationships myself, nothing as serious as you and Aang, but I know how much breakups suck, even if you know you did the right thing.”\nKatara pauses, taking a bite of the ice cream and savoring it for a long time. “You know,” she says finally, quietly, “you’re the first person who hasn’t hated me for breaking his heart.”\n“Don’t worry about everyone else,” Ty Lee replies seriously. “You made the best choice for yourself. They’ll come around or they won’t, but you shouldn’t wait for them to get on with your life.”\n“I just feel like…” she starts, still half-caught between that swing of regret and relief, “I feel like it was sudden, you know? Maybe we could have worked it out, but it was like… all of a sudden, I couldn’t stand it anymore.”\n“The lies we tell ourselves are the ones that hurt us the most when they break down,” Ty Lee says, as though quoting someone. “Your aura was always so close to you, and muddled. It wasn’t a healthy aura.”\n“Is it healthy now?”\nTy Lee tilts her head. “It’s healthier than it was before. I don’t think there’s anything wrong that time won’t fix,” she adds, as though she’s a healer diagnosing Katara’s death rattle as “a little cough, just rest up and you’ll be fine in a jiffy”.\n“I don’t think Aang will ever forgive me.”\n“Give him time,” Ty Lee says sympathetically. “You’ll see. It’ll all be okay.”\nKatara, in spite of herself, smiles.\n.\nIt’s surprisingly hard for her to leave Kyoshi the next morning, and she finds herself giving Ty Lee – Ty Lee! of the Fire Nation! that girl who stole her bending that one time! – a hug before she gets on the boat.\n“Thank you,” she says, feeling a little ashamed and a lot weak. “I really needed to talk to someone about it.”\n“You’re always welcome here!” Ty Lee chirps, hugging her back tightly. “I love having friends over, and you’ll have to help me make ice cream one of these days.”\nKatara laughs a bit. “I will. Keep in touch.”\n“You too!”\nShe gets on the boat feeling lighter than she has in, if she’s being honest with herself, nearly two years. Ty Lee’s words echo in her head – It’ll all be okay, and Don’t worry about everyone else.\nShe holds them close to her like a shield, and goes back home.\n.\nSokka welcomes her into the city with worry all over his face.\n“Katara, what happened?” he asks.\n“Nothing,” she answers, and it’s truer than he knows. “Nothing happened, and I left.” She sighs, and it’s the opposite of yesterday with Ty Lee, when she couldn’t stop the words from pouring out of her mouth; she does not want to open up to Sokka right now. “What needs doing down here?”\nHe watches her for a moment before apparently deciding not to push, and scratches the back of his head. “Well, we just got a shipment of marble in from the Earth Kingdom, Toph came along to help us build the pavilion. You can definitely help us there.”\n“What kind of pavilion?” she asks, already walking past him and dreading seeing Toph; if Ty Lee could tell she was lying to herself from her aura, who knows what secrets Toph knows.\n“Well,” Sokka starts, “we were thinking about a meeting place, I can show you the blueprints. Someplace where everyone can congregate and discuss politics, you know?”\n“Right, like a town hall.”\n“Pretty much, but we also want it to be, like, a place where people can go and learn about the tribe and the world and stuff. Dad wants to hire a painter to paint a bunch of cool things from history and hang them on the walls, but wow they do not come cheap.”\n“You don’t have to start off asking for all the paintings at once,” she chides, smiling a little.\n“Yeah,” Sokka says, drawing out the word like he really doesn’t like the suggestion. “But how lame would it look, one really nice painting and then a bunch of blank wall space like, hey we know there’s nothing actually here right now, but just wait!”\n“It’s a work in progress,” she laughs. “Isn’t that what we all really are?”\nBut he isn’t convinced, and anyway, she sees his point, and so she mulls it over for most of the walk to the skeletal frame of what will be the town hall, someday, until she sees a couple of children playing by a fire pit, and the idea strikes.\n“What about a mural?” she asks, and Sokka looks at her quizzically, so she goes on. “The kids,” she prompts, gesturing to them. “Get the kids to paint the wall with pictures of things they know, or like. They don’t have to paint all of it – in fact, it’s better if they don’t, because then the next generation can add on to it. It’s still a work in progress,” she adds, the inspiration coming over her like a warm blanket, “but it’s supposed to be. It’s always looking toward the future.”\nSokka thinks about that for a moment, then nods slowly. “I think you’re on to something here,” he says, and opens the door, in spite of the unfinished walls. She thinks privately that that says a lot about the kind of person her brother is. “Because, like, we’re the ones building it, but it’s really for them, the next generation. So they get to paint it. I like it.”\nA warm glow invades her chest, but before she can put her finger on why, they meet Toph and the glow abruptly shuts down in the wake of cold dread.\nBut Toph just tilts her head.\n“Long time, no see, Katara!”\n“You too,” she says warmly, and then groans. “Right, that was a joke.”\n“And a greeting, don’t sell me short!” she cries, acting offended, but Katara doesn’t believe a word of it.\n“It’s good to see you,” she drawls instead. “Have you been helping a lot with the city?”\n“Not really,” Toph replies, shrugging. “But Sokka and Dadkoda wanted marble floors in their palace, I think they’re jealous of Zuko.”\n“It is not a palace,” Sokka growls, through clenched teeth, and Katara rolls her eyes. “It’s a meeting hall, for the – ”\n“And so you got them the marble?” she cuts in, determinedly ignoring Sokka’s sputtering.\n“Yep,” Toph says. “Even offered out of the kindness of my heart to come all the way down here – to the middle of icy nowhere – to install it for them, free of charge. Because I’m an angel.”\nKatara blinks.\n“Your parents must have been really overbearing,” she deadpans, and Toph makes a face.\n“Ugh, you have no idea. I’m never going back.”\n“Didn’t you say that the last time?” Sokka asks airily, but Toph shudders.\n“Mom wanted to prep me for a real debut, with a party and dresses and shoes and manners. I don’t know how to break it to her that I’m never getting married.”\n“I wouldn’t say never,” Katara says, and Toph raises an eyebrow.\n“Yeah, no. I’m not ever getting married. You’re the one who convinced me of that, Sugar Queen.”\nThis brings her up cold, and even Sokka looks surprised.\n“What do you mean?” she asks hesitantly, and Toph scoffs, crossing her arms.\n“You stopped being Katara the second you hooked up with Aang,” she replies, and Katara feels her face heating up. “That’s why you dumped him, isn’t it?” she adds on the last with a bit of hesitancy, like she was all prepared for a good old-fashioned roast but realized belatedly that maybe no one else was with her.\n“Dumped is… a strong word,” she stammers, even though it’s not.\n“Well, he thinks he’s been dumped, so if you’re planning to get back together, you know, do… that.” Toph sounds a little let-down, and terribly awkward, and Katara looks away.\n“I’m not getting back with him,” she mutters. “Because… yeah, you’re right.” There’s more, about how she felt like she was just being dragged along with destiny, and how she spent the last year and a half feeling like an accessory, but she doesn’t really want to open up to Toph right now, either.\n“Good,” Toph says firmly. “You were disappearing.”\n“Yeah,” she mumbles, and isn’t sure she believes it. “I was.”\n.\n“I mean,” Sokka says to her later that night, holding out a cup of tea and taking a seat with her by the fire, “Toph was right. You weren’t really yourself when you were with Aang.”\nShe takes the tea and allows him to sit by her. He’s been treating her like she’s about to shatter all day, ever since Toph made that comment about not getting married, and she doesn’t really know how to respond.\nKatara has always been the rock. She doesn’t know how to be the person who needs support; it’s uncomfortable and awkward, and she wishes Sokka would just leave well enough alone.\nBut he won’t abandon his baby sister.\n“Why didn’t anyone tell me?”\nSokka sighs, and shrugs expansively. “You seemed happy,” he says, but almost like it’s a question. “And anytime someone said or did anything to Aang you didn’t like, you just blew up at them, nobody wanted to make you angry.”\n“I was angry,” she says, empty of emotion. “At myself, more than anything. I was angry because I wasn’t happy and I thought I was supposed to be. Everyone said I was supposed to be, but I wasn’t.”\n“What happened?” Sokka asks quietly, and she heaves a sigh.\n“I just…” she starts, unsure how to word it – when she’d been talking to Ty Lee, she’d barely had to say anything, and Ty Lee hadn’t pressed her for details. Because, she thinks traitorously, Ty Lee actually knew how to talk to someone who was going through a rough breakup, whereas Sokka is clueless on that front. “I had this moment where I realized I didn’t belong there. He was teaching all his new Acolytes and I was just sitting off to the side and I realized that if I didn’t leave now, this was where I’d be for the rest of my life. And I didn’t want that.”\n“He’s really confused,” Sokka says, as though easing out onto a precarious branch. “He thought everything was going perfectly. He was, um,” he coughs and winces. “He had a pendant all carved for you. He doesn’t know why you left.”\n“Of course he doesn’t,” another voice interjects, and Toph takes the other seat by Katara. “You spent all that time protecting him from the world, he has no idea how to take a hit. You always told him it was never his fault.”\nHer own words, when she’d left him, rise up in her mind at that, how desperate she’d been to make him think he wasn’t to blame.\n“It wasn’t his fault,” she says, a bit obstinately, because she’s bristling at Toph’s tone. “It was mine, I wasn’t – ”\n“It was both of yours,” Toph cuts in. “You weren’t right for each other, you just enabled each other’s worst tendencies. Both of you were in the wrong.”\nShe doesn’t have a good response to that, so for a while she says nothing. Finally, she sighs again and runs a hand through her hair. “It seems like everyone knew we weren’t right for each other, except us.”\n“It’s not that,” Sokka says slowly. “I mean, when you first got together, I thought it’d be great, but you just… weren’t yourself. It was weird.”\n“And you’re lying if you say that you didn’t know you and Aang were wrong for each other,” Toph adds, but softer. “You did know, but you didn’t want to hurt him, so you stuck with it until it drove you crazy.”\nShe laughs a bit, hollow. “I would have married him,” she says honestly, eyes burning with unshed tears. “If he’d proposed to me a week ago, I would have said yes.”\n“I know,” Toph sighs. “I’m just glad you came to your senses before you got in so deep that there was no getting out.”\n“I just had this vision of myself,” she goes on, as though Toph didn’t speak, “where I was fifty years old and bitter and lonely and still just – sitting there, watching him do everything and just – just having his babies and sitting there being pretty and doing nothing for anyone except him. And it was awful.”\nNobody says anything in response to that. Katara suspects there isn’t any kind of response that would suffice.\n“You did the right thing,” Toph says finally, in a low voice, and Sokka makes a noise of agreement.\n“I know I did,” she snaps, starting to crumble at the seams. “I just wish the \"right thing” didn’t hurt him like that, or make me a horrible person for just dumping him out of nowhere.“\n\"At some point, you’ve got to be selfish, Katara,” Sokka says. “You weren’t happy. You didn’t want to spend the rest of your life with him. That’s a good enough reason to walk away.”\nShe takes a deep, shaky breath, and Sokka puts an arm around her shoulders.\n“It takes a lot of strength to leave,” he goes on. “You both would have been miserable, you did him a favor in the long run.”\n“No,” Toph starts, and Katara can feel the glare that Sokka shoots her over her shoulders, but if Toph notices, she doesn’t care. “He would never have known better, to be miserable with you. He would have thought that it was just how love is, you go home to your doormat wife and you never wonder if maybe you might have been happier with someone who actually challenged you. He would have thought he was perfectly happy, and he would have been living an empty life.”\nSomehow, this does make her feel better – she actually did do him a favor, really, by leaving. She helped him to grow as a person, which, as Toph said (and was painfully right about), he wasn’t doing a whole lot of while she was there to shield him from anything that might hurt.\nIt doesn’t feel like much of a favor, though.\n“I mean, don’t get me wrong,” Toph goes on, with some trepidation, like she’s been itching to say this for a long time but doesn’t know how Katara will react, “you definitely deserve better than to be his accessory wife, but he deserves better, too. Aang can be better than he is right now, but not while you’re there to coddle him. Aang deserves to be happy, really happy, not just going through the motions and thinking that’s how it’s supposed to be.”\nShe mulls over that for a moment.\n“You’re right,” she says finally. “When did you get to be so wise?”\n“I pay attention to people,” Toph replies seriously, as though the question was not intended as a joke to lighten the mood. “And I know a lot about being miserable in something that’s supposed to be perfect.”\nKatara identifies with that on a deep and fundamental level, but it also breaks a dam within her and the tears she’s been fighting back come out with violent force. Sokka pulls her into a hug, and then, after a moment, Toph joins in and wraps her arms around her, too.\n“You’re gonna be okay,” Sokka murmurs. “You’re both gonna be okay.”\n.\nLittle by little, she moves on. At first she’s consumed by guilt, and starts several letters to Aang, explaining herself, but she always gets frustrated with them and tears them up or throws them away. A small part of her thinks that it’s probably not the kind of thing you explain in a letter, anyway.\nShe just has no idea when she will see him again, or how to be ready if she ever does.\nTo fill up the time, she sets her mind to do all the kinds of things she never would done with Aang, starting with regular trips to Kyoshi to visit Ty Lee and, when she’s there and not guarding Zuko, Suki. On those trips, Sokka comes along and they inevitably reconnect before having to separate again; no one, least of all them, really know where they stand – officially not together, because Suki’s work takes her so far away for such long stretches, but even when they’re separated it seems like they never take an interest in anyone else.\nSuki never asks why she broke up with Aang. If that’s because Sokka told her, or because she somehow just knows without having to ask, Katara isn’t sure.\nSomehow, Ty Lee becomes a real friend, by sheer force of personality and by simply being there for her when she’s overwhelmed. They sit in her little house and drink wine sometimes and make ice cream (some delightful batches, some less-than) and talk about a lot of things and a lot of nothing; she starts to view it as a safe haven, a place to go when the stress and the guilt get to her.\nAnd there is stress – she throws herself into the Tribal council and sets herself to bettering the place, starting in little ways. Her first suggestion is the mural, which receives unanimous support, and her second is the establishment of a bending school.\n“We’ll have both healing and fighting techniques,” she says, and gestures to Grand-Pakku, sitting across from her at the table in the still-drafty, unfinished pavilion. “Master Pakku has already agreed to work with me on blending Southern and Northern fighting styles, and he knows of a healer in the North who has expressed interest in coming here.”\n“How many amateur waterbenders are there in the tribe?” her father, of all people, asks, but he sounds more curious than accusing. It’s Grand-Pakku who answers.\n“Only a handful as of yet, but the number will only increase as time passes. And it’s better to start a school when you only have a handful of students you need to accommodate.”\n“And we’ll be able to grow the school with the students,” Katara offers, and Hakoda shrugs.\n“I’m all for it.”\n“Question!” Sokka chimes in, holding a pencil and looking over a map of the city. “Where are we going to put it?”\n“It needs to be somewhere pretty central,” she muses, walking over to look at it with him. “But it doesn’t have to be smack in the middle. Just easy for everyone to get to.”\n“How about here?” Sokka offers, pointing a spot nearer the coast. “It’s not quite within the city limits, but it’s not like we’ve built walls yet, and it’s pretty much surrounded by water.”\n“It’ll melt in summer,” Katara counters, and Sokka blinks, looking back at the map and making a face.\n“Right, it’s on the ice shelf, dang.”\n“I suggest the top of the glacier,” Grand-Pakku says, raising an eyebrow. “The entry requirement is being able to reach it.”\nKatara furrows her brow. “No…” she starts, and looks up. “Because these are going to be little kids when they start. Two, three years old. We can’t make them hike up a glacier just to learn.”\n“Surviving on the ice would be a great final test, though,” Sokka says thoughtfully. “For both being a waterbender and just being a tribesman or -woman.”\n“Besides, glaciers move,” she goes on, ignoring Sokka entirely. “We can’t build a foundation on a moving target.”\nSokka looks at her oddly when she says that, and it will be much later before she realizes how that sentence applies to her in more ways than where she wants to build a school.\n“Why not attached to the pavilion?” Hokada suggests, and they both look up at him. “We designed this place to be for everyone, so it’s easy to get to. Everyone already knows where it is, so they won’t get lost trying to get to school. And adding an east wing will be easy since we don’t have the walls for that side yet.”\nKatara mulls it over, before, “Okay. But we have to cut canals into the ice around it.”\n“Won’t that be difficult,” Grand-Pakku says blandly, and she gives him a look.\n“So, it’s settled,” she says, clapping her hands. “We’ll add the school on as a new Eastern Wing to the pavilion.”\nAnd the Western Wing, she thinks but doesn’t say because she’s already winning and she knows to quit while she’s ahead (at least for now), we can turn into a healing hut.\n.\nThe day of the painting, nearly six months since she left Aang, she’s unreasonably nervous – what if it doesn’t look right? what if the kids just sling paint all over each other until their parents take them back home? what if nobody knows where to start? – but it turns out to be unwarranted. Her father gives the kids a few ideas of things to paint, such as otter-penguins and their houses, but one particularly-artistic child takes it upon herself to paint the aurora.\nKatara helps the little girl, first by holding onto the ladder so she doesn’t fall and then by holding her paints and suggesting little ways to make the colors blend better. It’s definitely the best part, although some of the otter-penguins look pretty realistic and the one little boy who drew Sokka managed to somehow capture her brother’s essence while absolutely failing to paint a recognizable portrait.\nSome of the kids, less-confident in their art or just unsure what to paint, leave their handprints, which gives Katara the idea for everyone who’s there to do the same, and sign them – we were here.\nIn the end, when they’re all covered in paint and Gran-Gran and Grand-Pakku are bringing out food for everyone, it looks a little haphazard and amateurish, but it’s beautiful, maybe because of that.\nSokka claps her on the shoulder and grins.\n“This was a really great idea,” he tells her seriously. “I’m glad you came home.”\n“Yeah, me too,” she replies, and for the first time she thinks it’s unambiguously true; at this time, in this place, she has no regrets about leaving Aang and coming back here. She’s known it was the right choice for herself, but it wasn’t until right now that she genuinely believed that it was the right choice for other people, too.\nShe is going to be okay. It’s the first time that she really, honestly knows this to be true.\n.\n“So now you want to build a hospital onto the west wing of the pavilion?” Sokka asks incredulously, and she nods like it’s obvious.\n“For all the same reasons that it was a good idea to build the school here,” she explains, as she and a Northern waterbender work on cutting the canals into the ground. “It’s easy to get to, everyone knows where it is, and it’s still not complete.”\n“What’s next?” Sokka says airly. “A marketplace?”\n“Don’t give me ideas.”\n.\n“So about that marketplace,” she starts a few weeks later, and Sokka waves a rolled-up blueprint at her.\n“Way ahead of you, sis.”\n.\nSoon, the Water Tribe isn’t big enough to contain her.\nIt starts, then, if there can be a definite place where it starts, at a Council of Four, based in the Fire Nation, marking three years of peace.\nIt’s the first one that she’ll be going to as an ambassador and politician, representing her people alongside Sokka – they’ve become something of a dream team, he argues from the practical perspective and she argues from the compassionate one, and where they meet, great things happen, and the Southern Water Tribe is (albeit slowly) gaining a reputation as an excellent place to live, if you can handle the cold – and she’s nervous, but not because of the meeting.\nShe’s nervous because this will be the first time she’s seen or spoken to Aang since she left him at the Air Temple that day – only a little more than a year, but what feels like a lifetime ago.\nThe one who surprises her when she arrives, though, is Zuko; he surprises her both with his presence and with his closed-off expression.\n“Zuko!” she says, stepping off the boat and opening her arms for a hug. “It’s great to see you.”\n“Good to see you, too, Katara,” he replies tightly, giving her a perfunctory, quick hug, and something is definitely off, but she can’t put her finger on what, and he doesn’t give her the time to. Before she can ask him anything, he’s moved on to greet Sokka with significantly more cheer than he greeted her with.\nShe feels betrayed for a moment, but then she thinks about it, about how badly she treated him while she was with Aang, how dismissive, how she didn’t even respond when he wanted to go find his mother, and she thinks that maybe she deserves his coldness.\nBut before she can come up with a way to apologize, or at least broach the topic of her needing to apologize, Aang is walking up and her breath catches in her throat.\nShe’s spent the whole journey trying to think up how to talk to him again, but nothing ever seemed adequate. There just isn’t anything to say, at the same time that there’s too much to say.\n“Katara,” he says, with a smile that looks forced. “I hear you’ve been doing a lot in the Southern Water Tribe.”\n“I have,” she replies, and the silence is so awkward she wants to sink through the docks and down into the swirling ocean, but before Aang can make things worse, Zuko either takes pity on her or decides that they have more important matters to discuss.\n“We need to get to the meeting room, Toph and Suki are already there, along with the ambassadors from the Earth Kingdom. You were the last ones we were waiting on.”\n“Yeah, sorry,” Sokka says, glancing openly between her and Aang like he’d rather be anywhere else. “We got delayed, Yakone kept fighting us about the Equal Opportunities Act Katara introduced, he kept saying it wasn’t necessary. You shoulda seen Katara go to town on him, though,” he adds, grinning. “All about how the Northern Tribe is still so sexist that a bunch of women have already moved to the Southern Tribe, and how women get pigeonholed into these roles and it’s ultimately a detriment to society because you’re blocking half the population from contributing. It was pretty great.”\n“I had notes,” she chimes in, because, honestly, if she says so herself, it was pretty great. “I did a ton of research, the exact number of women immigrating to the Southern Tribe per year, testimonials from those women about why, and a great line about how \"if a woman is good enough to be an Avatar, like Kyoshi, a woman is good enough to be a hunter.” I got applause.“\nIt’s Zuko who looks most interested in the conversation, actually laughing at her airy confidence and appearing appreciative. Aang has a strange look on his face, and she thinks maybe he’s realizing that she really has been better off without him.\nIf that is what he’s thinking, though, he doesn’t say anything about it, and they go into the meeting room to discuss the fate of the world.\n.\nAfter the first day of the Council is adjourned, Aang seeks her out where she’s standing on a balcony looking out over the docks. She cringes to herself when she hears the door open.\n\"Are you planning to ignore me this whole time?” he asks, sounding hurt.\n“Aang…” she sighs, running a hand over her face. “I just don’t know what to say.”\n“I don’t even know what happened,” he says in a small voice, and she turns away from him, to look at the railing. “Everything was going fine, we were happy. And then you just… left.”\n“It wasn’t fine, Aang,” she says quietly. “I wasn’t happy. I was trying so hard to be, but I wasn’t.”\n“But why?” he asks, coming around to stand beside her and trying to make her look at him, but she can’t.\n“I told you, Aang,” she replies. “I didn’t want to spend the rest of my life watching you do everything.”\n“But why didn’t you say anything?!” he cries, and she flinches. “We could have fixed it, you didn’t have to leave!”\nShe takes a deep breath.\n“We might have been able to fix it,” she starts in a measured voice, stepping out onto thin ice even within herself, “if I had been able to bring it up when it first became a problem. But I didn’t want to hurt you, so I kept just bottling it up, and by the time it all came out I was so angry that I couldn’t stand to be around you anymore.”\n“When did it first become a problem?”\nShe winces, and admits miserably, “Before we started dating.”\n“I don’t understand,” he says, and tries to reach out to her, but she turns away.\n“I could never be honest with you, Aang,” she sighs. “I always felt like I had to be someone I wasn’t, I had to be your perfect angel and protect you all the time. I wasn’t myself, everyone else could see it, but I was so determined to make myself be happy that I didn’t notice how badly I was treating all my friends. It wasn’t fair, to either of us.”\n“Why didn’t you think you could be honest with me?”\n“Because you thought I was perfect!” she cries, finally turning to look at him. “You had it all planned out and I thought it was my destiny. But I didn’t have any room to breathe when I was with you. I couldn’t be myself, because I always had to make sure I was doing what you wanted, being who you wanted me to be.”\n“I wanted you to be yourself!” he counters, taking a step toward her. “I love you, Katara. You, the good and the bad!”\nThe tears well up in her eyes and she shakes her head, stepping away from him and toward the door. “No, Aang,” she chokes. “You didn’t know how bad I could be. You didn’t see it. You didn’t understand. You never could.”\n“So, you left me because you – you think you’re not good enough for me? Is that it?”\n“I left you,” she starts thickly, voice rough with both tears and anger, “because you didn’t see me when you looked at me. Part of that’s my fault,” she adds, choking back a sob, “because I didn’t want you to. I didn’t want you to be disappointed. So I pretended to be someone I wasn’t, I pretended to be happy just sitting there watching you do everything. I should have been honest with you from the start, but I never could. I was selfish.”\nShe thinks of Toph telling her that this is part of her problem, that she’s always trying to make him think that it’s never his fault, that she’s preventing him from growing as a person.\nBut even here, even now, she doesn’t think she has it in her to be completely honest with him. He just looks so hurt and lost, she wants to bundle him up in her arms and tell him that everything is going to be all right.\n“I’m sorry, Aang, I can’t do this,” she chokes, and leaves him, again, calling after her to explain herself.\n.\nShe feels better the farther she is from him; it’s like he projects some sort of unconscious aura that makes her weak.\nInstead of thinking about it, she throws herself into working out the details of the Water Tribe’s new trade proposals with Sokka, who either heard about it from someone else or knows her well enough to guess, and so doesn’t ask why it looks like she’s been crying.\n“You think Zuko’s ministers will go along with it?” she asks, still breathing heavily as though she’s been running, and in some ways maybe she has.\n“Oh, yeah,” Sokka replies. “It benefits all of us. They’ll get preferential deals from the South on our fishing and hunting goods, and we’ll get them on their technology. The Fire Nation gets new food imports, which they need since the Earth Kingdom wants to retake all the Fire Nation colonies and stop them from sending any food back here, and we finally get to enter this century. Win-win.”\nKatara makes a face. “I’m just not sure how I feel about us selling meat to other nations. Hunts are sacred.”\n“People are starving,” he says seriously. “When the Fire Nation’s farms get back in condition and their ships finish getting re-converted for fishing instead of killing people, we’ll be able to trade back and forth, and work together. But I put in a bit here about protected waters, so Fire Nation ships have to get permission to fish in Water Tribe territory. I mean, nobody’s gonna get, like, arrested, but we reserve the right to escort any trespassers out of our waters.”\n“It just leaves a lot open to abuse,” she muses. “Overfishing, I mean.”\n“But look at what we could get in return,” Sokka counters. “By opening our arms to them, to help them get back up on their feet, when it gets to be winter and we’re all on the verge of starving, they’ll have incentive to help us.”\nIt’s true that the Fire Nation has been in something of a food crisis, as the shift from a military industry to a production industry lags in the wake of civil wars and rebel factions trying to take down Zuko. Katara wishes she could collectively shake the entire country by the shoulders, and yell at them that it would be better for everyone if they would just work together – if you’d just stop fighting and plant a damn crop, you wouldn’t have to fight over food!\nBy opening up – conditionally – Water Tribe territory to peaceful Fire Nation fishers, and by selling their own surplus catches at a discounted rate to Fire Nation citizens, they can make a lot of headway into helping Zuko feed his volatile nation. She knows Zuko will be all over it, but his ministers are small-minded and conservative and she suspects that half of them have supported at least one or more attempts on his life; they may oppose it just to be obstinate, and claim the whole way that it’s about Fire Nation pride.\nNational pride be damned, she thinks bitterly, your people are starving.\n“It is a good deal,” she says, “but I’m not sure all of those stuffy politicians will go for it.”\n“They will,” Sokka says firmly. “If they care at all about their people, they will.”\n.\nThe next day of the Council threatens to rekindle the war.\nThe Earth Kingdom dignitaries and the Fire Nation ministers argue over colonies until Katara is genuinely afraid that it’ll come to blows, and Aang – clearly still stinging over their conversation – isn’t exactly doing a great job of being the objective arbiter of peace that he’s supposed to be.\n“Gentlemen, Ladies, please!” Zuko yells, composure slipping as he tries to be heard over the arguments. “Enough!”\nNobody except Katara, Sokka, and Suki seem to hear him; Toph is getting particularly heated with Aang, about how he’s not doing his job, and Aang is yelling back at her about how there’s not an easy solution here. They all look from Zuko to each other and then back, and something within Katara snaps.\nWithout stopping to think about it, she stands up and tries to call for order and then, when no one pays attention to her, she growls and brings all the water out of the humid tropical air and straight onto everyone’s heads. “We are not accomplishing anything like this!” she shouts, over the chorus of startled yells, and silence descends. “Clearly, we are at an impasse,” she articulates, and then gestures to Sokka. “How about a change of subject? The Water Tribe would like to propose a series of trade deals with both the Fire Nation and the Earth Kingdom.”\nSokka looks alarmed; there’s nothing in there about the Earth Kingdom, but if Katara proposes anything that even smells like preferential treatment to one of the nations right now, the Earth Kingdom dignitaries will eat her alive.\n“Sokka will explain the aspects of the deal with the Fire Nation,” she says pointedly, and adds to herself and I will come up with something for the Earth Kingdom while he talks. Sokka nods, covers up his anxiety, and begins to talk to the seething, steaming silence about their idea for opening their waters to fishers – he adds in that Earth Kingdom fishers will, of course, be allowed as well, because he’s no fool – and about working out discounted rates in exchange for technology.\nZuko looks so relieved it almost makes her laugh.\n(And also wet. Her dumping-water-over-everyone trick hadn’t spared him.)\nBy the time the Fire Nation ministers are finished hashing out their deals with Sokka, she’s come up with the sketches of a plan for the Earth Kingdom.\nThe thing is, the Earth Kingdom doesn’t need anything the Water Tribe can offer – they have plenty of farmland, plenty of waters with fish and ships to catch them. But there is one thing.\n“Hospitals,” she offers. “There are no better healers in the world than waterbenders. I have a school for benders in the South, and Yugoda in the North has spent decades training healers. We agree to send some of our healers into the Earth Kingdom to build hospitals and help the places hardest-hit by famine and war. Plus, we can help with irrigation and rebuilding the farms that have been damaged by the skirmishes that are still breaking out.”\nShe bites her tongue and hopes they accept it. They seem uncertain, so she plows on.\n“Like Sokka said, we will open our waters to Earth Kingdom ships as well, and we can build some hospitals in the Fire Nation – we don’t want to leave anyone out.”\n“And what do you get in exchange?” a sharp-looking woman, representing Ba Sing Se, asks.\n“Food,” she replies simply. “The summers at the poles are too short for farming, and if we’re opening our waters, we’re reducing our own supplies of food. We allow you to fish in our waters, and in exchange, you sell us food so we can make it through our winters. We can also trade in goods – whalebone weaponry, whale oil for lamps, furs and artifacts.”\n“Hmm,” the Ba Sing Se lady says, watching her calculatingly, as though she can tell that Katara made this up on the fly. But it’s a solid offer.\n“Water Tribe textiles are some of the best in the world,” Sokka chimes in. “When poorly-made clothing means you die of frostbite, you have to be really, really good at sewing. And summer berries make unique dyes, you can’t get anywhere else.”\nShe can see the cogs turning in the lady’s head, as she’s imagining how new clothing styles and rare dyes could make her a lot of money in the Upper Tier of the city, and Katara knows they’ve won.\n“All right,” the lady says finally. “I, for one, can agree to those terms. We all benefit from a more cosmopolitan world, after all.”\n“Sounds good to me,” Toph says, and then tacks on, “and, you know, Gaoling.”\n“Works for Omashu,” another dignitary, sent by Bumi, says. “We do need a hospital, badly.”\n“And Kyoshi is always open to trade with the Tribe,” Suki adds, smiling at Katara.\nZuko also smiles at her, and mouths thank you. Katara glows inside, and pretends not to feel Aang watching her.\n.\nThey hold a little party – “More of a soiree,” Sokka, ever-pretending-to-be-a-cultural-authority, explains – on the last night of the Council, in spite of the fact that nothing has really been solved between the Earth Kingdom and the Fire Nation, and now would be the perfect time, she thinks, to maybe hash things out with Aang, but, dammit, she’s happy.\nThe wine is good and the food is rich and seemingly endless and she’s improved her country by leaps and bounds in the past year and now improved their trade relations with the other countries; she’s flying high, and she doesn’t want her tangled history with Aang to bring her down.\nShe’s explaining the Equal Opportunities Act to an extremely-interested Suki when Zuko joins the conversation and they both stare at him. He looks a bit harassed.\n“Sorry,” he winces. “Mai just got here.”\nSuki nods in understanding, and even though Katara doesn’t know all the details, she knows enough about awkward reunions with exes to show him the same courtesy he showed her when she arrived.\n“We were just talking about the Equal Opportunities Act we just passed in the Tribe,” she tells him helpfully, and he actually – again, like when she arrived – looks interested.\n“What are the details of that, by the way?” he asks, and it doesn’t sound like he’s just trying to come up with conversation to look too busy to talk to his ex.\n“It’s pretty nebulous, honestly,” she admits, and he raises an eye at the word, but Katara refuses to notice. “But it basically states that, if you’re hiring someone to do a job, you can’t exclude women. The Water Tribe has a bad history of that, although the North has always been worse.”\n“So, it’s been a segregated society?” Zuko asks, and she nods. “That seems weird to me, the Fire Nation has always been a lot more equal.”\nIt’s Suki who scoffs at this, and Zuko looks to her, surprised, so she explains. “Zuko, the Fire Nation is Equal In Name Only,” she says, with pointed emphasis. “Women still have to be twice as good as men to get half the respect, sex workers are treated with total disdain – prostitution is illegal, for example – and women are still expected to be no more than wives, supporting their husband’s careers.”\n“To be fair,” Katara interjects, because Zuko looks like Suki has just kicked his puppy, “that is still a lot more equal than the Water Tribe has been. It’s not perfect, but what is?”\n“It’s a work in progress,” Suki agrees, shrugging. “Don’t think it’s all taken care of, is my point. There’s still a long way to go before you’ve got an equal society, and it’s not gonna happen in our lifetimes. But,” she goes on brightly, “the first step to solving a problem is acknowledging that there is one.”\n“I had never… actually thought about that,” Zuko says hesitantly. “I don’t understand, why is it bad that prostitution is illegal?”\nKatara – who was discussing this with Suki before they got into talking about the Act – mulls over how to explain it, helped along by the wine which loosens her tongue and makes her less concerned about how awkward the conversation would be otherwise. “It’s like… you criminalize the person selling her body, but not the person buying it. So you lock up the woman who asks for money in exchange for… sex – ” she still says the word quieter, because she is not as open and forward as Suki “ – but not the man who pays.”\n“And more than that,” Suki cuts in, “you can buy an hour of a person’s time to do anything except have sex. You can pay them to paint your roof or build you a shed or even just sit and talk to you, but not to have sex with them. It’s a double standard.”\n“And you can give it away freely,” Katara adds, motioning with her glass. “Legally, at least. But you can’t sell it.”\n“And – ” Suki goes on, seemingly uncaring that they’re probably totally overwhelming Zuko, “ – it makes it so much less safe. You can’t make prostitution go away by banning it, but when you do make it illegal, they don’t have anywhere to go if they get sick, or if someone hurts them, because they’ll get arrested for prostitution.”\n“Why haven’t you ever told me this before?” he asks, and Suki makes a face.\n“I’m your bodyguard, not your adviser,” she replies, drunken interest already drifting over to Sokka. “And you have a lot on your plate already.”\n“But I care about all of my people,” he insists, “not just the men or the rich ones.”\n“Yeah, but try passing the \"Make Prostitution Legal Act” and see how far you get in the Council,“ Suki drawls, but it’s Katara who takes offense at that defeatist attitude.\n\"So don’t start there,” she suggests. “Start smaller, by decriminalization – like, it’s not condoned, but you’re not going to get arrested if you go to a hospital because the guy beat you up. Argue from the perspective of the woman who’s lost everything and has to resort to prostitution, how awful it is for her to be abused and then, when she asks someone for help, she just gets arrested and abused even more. We could sell that to your Council.”\n“You could sell that to the Council,” Suki corrects her.\n“You could definitely sell that to the Council,” Zuko chimes in, and it’s so tempting, but her people need her.\n“Maybe in a year,” she laughs. “When I’m sick of the South Pole.”\n.\nZuko tells her, when she leaves with Sokka to go back home, that she’s welcome to return at her leisure, and to keep in touch, and she promises to take him up on the offer, sending the first hawk – “Just checking to make sure it knows where to go. If you’ve received this message in error, please send me a better hawk.” – the hour she arrives.\nBut the seed is planted, now, and she can’t stop thinking about all that she could do from the Fire Nation – not just for the isolated tribe on the end of the Earth, but for the world as a whole. Katara’s ambition, so long set aside for the good of others, is breaking free and setting fire to her soul.\nSokka, of course, is the first to notice it, even before she does.\n“You’re ready to move on,” he tells her, one sharp spring day, in the weak sunlight of the beginning of the season.\n“What do you mean?” she asks dumbly. “I’m already home.”\n“Yeah, but the Water Tribe has never been big enough for you,” he explains.  \"You’re pushing for bigger and bigger ideas, things that integrate us more into the world, but the Tribe doesn’t need to be that integrated. Isolation has always been our policy, and you’ve done a lot for trade, but we still don’t get involved if we can help it. But you get involved. You can’t not.“\nShe doesn’t know what to say, and after a moment, he continues.\n\"How much do you write to Zuko?” he asks, and she blinks.\n“I don’t know, whenever I receive a letter, I write back.”\n“And he asks you for advice?”\n“Sometimes, yeah…” she starts, unsure where this conversation is going.\n“You drop almost everything to answer those letters,” he says. “I mean, you don’t leave Council meetings or family dinner, but just about anything else, you drop and you reply to him. And you spend a long time replying.”\n“Are you suggesting I go to the Fire Nation and offer myself as adviser to Zuko?”\nSokka looks at her in a weird way, but whatever he’s thinking, he doesn’t let on. “I’m just saying, I bet he’d like to see you in person. He could use the help, now that Suki’s back at Kyoshi. He’s all alone there.”\nShe thinks about it for a moment. “I can’t just leave the Water Tribe,” she starts in a small voice, and Sokka sighs.\n“Yes, you can,” he says. “You’re itching to. How many projects do you have left to finish?”\n“Not many,” she answers slowly, and the more she thinks about it, the more she realizes that she has been unconsciously drawing things here to a close. “Just this semester at the school, and finish building the ice gardens.”\n“Ice gardens,” he repeats, exasperated like he has always been every time she brings it up. “You’re so desperate to get out of here you’re trying to build gardens on a glacier.”\n“There are plenty of – I’m not having this argument again.” She takes a deep breath, the cold air searing her lungs. “I could stand a holiday,” she finally concedes.\n“Right,” Sokka says, and she looks at him oddly.\n“Why are you so eager to get me out of here?” she asks, a bit accusing, but he looks almost affronted, and it takes him a moment to respond.\n“I don’t want you out of here,” he replies quietly. “I want you happy, and doing what you love. And you’re not happy here anymore.”\nThe question “Will I ever be happy anywhere?” falls out of her mouth before she can stop it, her mind locked on her inability to be happy with Aang, and her brother’s eyes soften.\n“I don’t think anyone except you can answer that,” he says. “I think you just keep trying things on until you find what fits.”\n“You would use a shopping metaphor,” she deadpans, and he glares.\n“I was trying to have a brotherly moment with my baby sister, but I guess not.”\nShe laughs and punches him lightly in the arm.\n.\nBut he’s right.\nOnce the school is closed for the semester, and – in spite of Sokka’s protests about how useless they are – the ice gardens finished, she sends Zuko a letter asking if she can take him up on his offer of hospitality, and, when he replies that she’s welcome to come right away, makes for the Fire Nation.\nIt seems like she’s been coming this way for a long time.\nact two: it started from your arms (and it's a catalyst)\n.\n.\nThe first few days are a bit awkward.\nIt's just that she doesn't know how to talk to Zuko anymore, if she ever truly did – they had their moments, under Ba Sing Se and here at the palace on the day of Sozin's comet, and they used to be friends, but all that's left now is a couple of years of silence and, she's beginning to suspect, more than some bitterness.\nAfter all, they  used to be friends.\nHe introduces her to his ministers, and some of them are friendly or at least polite, but others look at her with something close to scorn. Surprisingly, it's  not the ones she doused at the last Council of Four – in fact, they're generally warmer to her, since she can take half the credit for their trade deal with the Tribe, and they know that she's not some clueless teenager.\nIn the first meeting, she keeps her mouth shut and mostly observes, more concerned with paying attention to who supports what (and what kind of) proposals, who seems to have the best interest of the Fire Nation at heart and who seems to care more about their own wealth, who oppose Zuko on principle and who oppose him because they disagree about the best way to govern and who agree with him on altogether  too many fronts to be anything but a brown-noser.\nWhat she comes away from the first meeting with is this: Zuko, more than Sokka knew, really is all alone here.\n Well, she thinks,  not anymore.\nExcept as soon as they leave the meeting, when she's trying to catch his attention to discuss a few things with him, he all-but flees from her. She's pretty sure he heard her say his name, but, she muses, maybe she didn't speak loud enough – the hall  is  pretty noisy, and she  was  one of the last to leave.\nOr maybe he really doesn't want to talk to her in private.\nA week later, in the second meeting, she tentatively offers her opinion on a few safe things – an older female minister, perhaps taking pity on her, brings up whether or not they can afford to expand their trade with the Southern Water Tribe, and she's able to work out what sorts of imports the Tribe might need, versus what sort of exports they would be able to offer during the summer months – but still feels like an outsider.\nThis time, she's certain that he hears her on the way out – he hesitates – but he doesn't turn or wait for her.\nIn the entire week, she's only seen him a few times, and he was friendly enough, but when she offered, once, to have a cup of tea with him, he declined with what looked like discomfort and promptly disappeared.\nIt's making her feel pretty unwanted and miserable, and she's laying awake in her room (probably used to belong to Azula, come to think of it) trying to figure out how to tackle this problem, when it hits her –\n\n What ruined your relationship with Aang? \n\nUltimately, it was the fact that she never told him when she wasn't happy. She was never willing to have hard conversations with him, never willing to be up-front and honest. And this situation with Zuko is different, sure, but at the same time, it'll get sunk by the same problem if she doesn't nip it in the bud right here and now.\nShe has to  make him communicate with her. Even though it is definitely going to suck, she can't do anything for him if they're just tiptoeing around each other, never acknowledging the elephant in the room that is how she threw him away when she got with Aang.\nShe figures he's probably still up – she glances at the moon, the sun’s only been down a couple of hours, of  course he's still up – and so she throws herself out of bed and dresses hastily, because she knows that if she waits until morning, she won't have the nerve to corner him and get him to admit that he's upset with her.\nHe's in his office, or at least there's light under the door, and so she marches up to it and knocks, hard, before going in without waiting for a response.\nZuko looks up from the desk with bleary eyes and stares at her for a moment.\n“Knocking generally has a  purpose, you know,” he drawls, and she shakes her head.\n“What's going on here?” she asks, sitting in the chair opposite his desk. He makes a face.\n“What do you mean?”\n“I  mean, you sent me letters all the time that made me feel like I should be here to help you in person, but now that I am, you won't even talk to me.”\nHis expression seems to freeze in place; it's the kind of dangerously neutral expression that could be hiding any kind of depths or demons. The silence stretches for a moment, and she takes a deep breath.\n“Is it because of how I acted when I was with Aang?” she offers quietly, cringing a little, and he glances away, so she continues. “I know I wasn't myself. I already got it from Toph and Sokka. And I treated you really bad,” she went on, the words pouring out of her, chased into sound by her own shame and need to fill the crushing silence. “I should have come when you asked me to help you find your mother. I  really should have.”\n“You didn't want to,” he says, in a thinly neutral tone, and she looks down. It's true and it's not true at the same time: she didn't want to, yes, but not because she didn't want to help him.\n“I had it in my mind that I had to be there for Aang all the time,” she admits. “That I could never leave his side, and he had other things to do so I went along with them.”\n“That just doesn't  sound like you,” he bursts out suddenly, and she resists the urge to pull her knees up to her chest like a child.\n“I was trying really, really hard to be someone I wasn't,” she says quietly. “I felt like it was my destiny to be his wife, and I had to make myself be happy with it. I just had to... get over anything else.”\nHe's quiet for a long moment, and then, in a very low voice: “I needed you then.”\nThe memory – a memory he wasn't a part of, can't know he's dredging up – rises in her,  I will never, ever turn my back on people who need me!  Except she had. She'd turned her back on everyone else who needed her because she had herself convinced that Aang needed her more.\n“The lead's gone cold,” he goes on, adding insult to injury, because he's hurting, and the only thing pain ever wants is to be shared.\n“I'm sorry, Zuko,” she breathes, and wishes that she had better words to say, some way to make him understand how awful she feels – how much more awful now, actually looking at him and  seeing how much she failed him, even after all he did for her – but there's nothing that will be enough. And even if she could express it, it wouldn't bring his mother back. “I'm so sorry.”\nToph and Sokka both told her that she wasn't herself, that she was disappearing into that relationship, that she stopped being Katara the moment she got with Aang, but they hadn't been as  directly hurt by her throwing everything else aside to be his forever girl.\n“I know,” he replies finally, but he's not looking at her. “And I know what it's like to try and be someone you're not for someone you love, how… important it seems. And I know you're trying to fix things. I know.”\n“But you can't forgive me.” It's not a question, although she wishes it could be.\nHe still won't look at her, and she knows he's not the sort of person who will say that outright, even though it's true.\n“I understand,” she says, because she  does , even if she doesn't like it. And, well, last time, she was on his side of it, and she was a lot nastier about it. She starts to stand. “I can... I can go back to the Tribe in the morning, I just –”\n“You don't have to  leave, Katara,” he blurts out, looking up at her, alarmed. “I meant what I said, you're welcome here and I think you can do a lot of good. You've helped me a lot in your letters. A  lot,” he repeats, with emphasis, and she sits back down. He looks away again, uncomfortable. “I keep thinking I'm ready to see you again,” he goes on, in a low mutter, “but I'm always not.”\nShe decides not to examine why that might be.\nEven though she came here to have this conversation, knowing full well how much it was going to suck, she thinks that she'd really like to turn into a bird and fly right out the window and away from this forever.\n“I'll be fine,” he says, as though reading her thoughts through the top of her head. “I really enjoyed our conversation at the party last summer, it really made me think about a lot. I  do want you here,” he adds, but it's as though it causes him physical pain.\n“Okay,” she replies hoarsely, unsure of her ability to say anything else. She feels awful, somehow even worse than she did when she broke Aang's heart, because at least then she'd had the fact that she did the right thing to carry her through; this time, she's coming face to face with the fact that she abandoned and blew off a friend who had risked his life for her and to help her find closure, and she was absolutely, without question, wrong to have done so.\nAnd worse, she did it a long time ago, and hadn't realized how bad it was at the time.\n“I really  am sorry,” she settles on, and Zuko – for all his faults, Zuko with the heart too big for his own good – smiles at her, if a bit tightly.\n“I know,” he repeats.\n.\nThe air between them the next day is still cold, but at least it's clear.\nHe turns her down when she offers to have a cup of tea with him, but he at least gives her a legitimate-sounding excuse and a promise to actually take her up on it sometime.\nReally, he's being far kinder to her than she deserves, considering that his mother might be here to help him (them) if not for her carelessness, considering that he might have found the closure that he helped her find once, but instead here he is, alone in the Fire Nation except for Katara, the reason he’s alone.\nThen she thinks that maybe she's being a little unfair to herself.\n Aang was her boyfriend at the time, not Zuko. All that Zuko did for her was given freely, without any promise or expectation of recompense, and she did not, strictly speaking, owe him her time.\nBut even so… Katara, the Katara that had fought his sister with him, the Katara that had transferred all of her hatred for her mother's murder onto him in the wake of his betrayal, the Katara that had donned the mask of a ghost to save a town, the Katara that he had known – she would never have thought twice about helping him find his mother, never would have considered not going with him.\nSo maybe the root of it is less that she had abandoned him as it is that she abandoned herself, or that she isn’t who he thought she was.\nIt… stings to think of.\nSo she makes up her mind to stop dwelling on it. She thinks of Ty Lee's words to her, all the way back at Kyoshi when she was still reeling from what she had done to Aang:  Either they'll come around or they won't, but you shouldn't wait for them to get on with your life.\nEither Zuko will forgive her or he won't, but she shouldn't wait for it to get on with things here.\nShe'll just have to be here for him now, and somehow be here for him hard enough that it undoes the damage she did by not being here then.\nInstead of trying to get him to talk to her alone, she'll simply focus on the proposals brought up in their weekly meetings, and work things out from there. He'll come to her if he ever wants to. It's not like he doesn't know where to find her – either the expansive palace library or his sister's old room.\nIn fact, that might be part of her problem, come to think of it: she's cooped up in this place with Zuko's uncomfortable silence and a bunch of servants who are too terrified of her, for some reason, to stop and talk. Besides, she thinks that half the problems Zuko is having could be solved if he could just get a perspective that wasn't coming from a rich old noble with his or her own agenda.\nShe makes up her mind to start going into the city, to talk to people who aren't still pretty (justifiably) mad at her or possibly plotting her death or seventy years old and half-senile. Katara has never exactly been a loner; all this being alone with her thoughts will drive her mad before too long.\nThe first time she goes into the city she briefly thinks that it is, perhaps, a mistake.\nShe isn't sure what she expected; perhaps gossip, or glares, or even nasty mutters behind her back – but not total ignorance.\nNobody here knows who she is. Nobody, it seems, cares.\nIt's more uncomfortable than she expected; she got used to being recognized in the Southern Water Tribe, as both a war hero and a leader, and to come here and find herself anonymous is… unfamiliar. Still, she gamely decides to go have a cup of tea and some conversation with some strangers, in the hopes that maybe they'll have something interesting to say, or maybe some kind of secret wisdom to help her deal with her problems.\n“Hi,” she says brightly, at the first respectable-looking tea shop she comes across. The server smiles at her, although it looks a bit brittle. “Do I seat myself, or should I wait to be seated?”\n“You can seat yourself,” the woman replies. “There's a bar if you'd prefer sake, or I can bring you a selection of our finest teas.”\n“Tea, please,” she says, and takes a seat near the open window, looking out onto the street. “And food?”\n“Of course,” the server answers, with a sweet smile.\nShe ends up with a pot of jasmine green tea and a plate of boarpig dumplings, both of which are delicious; the dumplings are just a bit spicy, complemented by the delicate sweetness of the tea. She makes a mental note to bring Zuko here someday, although hopefully without too much fanfare, if such a thing is possible for the Fire Lord.\nMaybe he can dress down, like they did before he was crowned.\n“Would you like anything else?” the server asks, and Katara glances up, making a split-second decision.\n“I'd love some conversation, if you're not too busy.”\nIt's not unreasonable; at this hour of the day, it's slow enough that she's alone in the teashop, and she thinks that the server is probably about to be finished with her shift anyway. The woman tilts her head, a bit confused.\n“What did you want to talk about?” she asks, but doesn't take the seat.\n“What's your name?“ Katara offers, as a somewhat awkward conversation-starter.\n“Chunhua,” the server replies amiably. “It means spring flower.”\n“It's beautiful,” she says. “Mine is Katara, but I don't know if it means anything. I think my parents just liked the sound of it.”\nChunhua laughs a little, and glances behind her, to see if anyone is watching, before she takes the seat opposite her. She refuses the tea that Katara offers, although she thinks that's perhaps going a bit too far anyway.\n“You don't look like you're from around here,” Chunhua says, “if you'll forgive my mentioning it.”\n“I'm not,” she replies. “I'm from the Southern Water Tribe. I came here on… business.”\nShe isn't sure why she feels the need to, for the moment, hide the fact that she's – at least ostensibly – a close adviser of the Fire Lord. Maybe it's because she feels like the server will run away from her if she does, or choose her words more carefully.\n“I've heard great things about that place,” she muses. “It's supposed to be one of the best places in the world to live, but I don't know if I could handle the cold!”\nKatara laughs. “It  does get pretty ridiculously cold,” she admits, and can't stop smiling at the fact that her home's reputation has filtered down this far. “But it is a wonderful place to live. And you do get used to it, although I guess I had an advantage, since I was born there.”\n“Does that mean you're a waterbender?” she asks eagerly, and Katara grins.\n“I am. I helped Master Pakku found the waterbending school there, in fact.”\n“Can you show me something?” Chunhua leans forward, eyes alight with wonder, and Katara draws the tea out of her cup, forming into an ice flower. Her new friend gasps in delight. “That's so cool,” she gushes. “I've always wished I was a bender, but I'm not.” Her face falls a little at the words, and Katara feels bad for her.\n“My brother was always the same way,” she says, leaning on her chin. “But if you ask me, he's smarter than I am. He never had an easy way out. I respect him a lot,” she adds, and it's truer than she meant.\nShe misses Sokka. Somehow, she didn't expect to.\n“Benders have it a lot easier than non-benders,” Chunhua says, and Katara nods in sympathetic agreement, because she's self-aware enough to see that it's true. “The only public school around here just teaches benders, they don't take in non-benders.”\n“So, if you're not a bender, you don't get any education?” Katara asks, tilting her head, and Chunhua shakes her head.\n“Not except what your parents can give you. The nobles have their own academy, but you have to pay a lot of money to get in, so if you don't have it…” \n“You're left out in the cold,” she finishes, and what neither of them say: and you're left finding low-paying service jobs to make ends meet.\n“It's not bad,” Chunhua says, although Katara thinks she's just trying to make her feel better. “I mean, my parents taught me a lot. They own this place,” she adds, indicating to the teashop, and it's probably intended to make her feel better, but it has the opposite implication to Katara:\n\n I might have been able to be something more, but I was born to the owners of a teashop, so all I could learn was how to serve tea. \n\nAnd that's fine, if what you want to do is make tea and meet people – she thinks of Iroh, how happy he is in his teashop – but what if Chunhua had dreams like Katara's, once, only she didn't have the means to make them happen? Owning a respectable teashop is hardly a shameful fate, but if it's not the one you want, then it's awful all the same. And if you never get the chance to choose, you never get to know if maybe you would have been able to do more – for others, and for yourself – if you'd chosen another path.\nKatara doesn't know how to make things better for Chunhua, but she  does know that she owes it to her and others like her to do the most that she can with the opportunities that she does have.\n“Maybe we should open a school,” she muses, and Chunhua smiles wanly.\n“That takes a lot of work.”\n“Work isn't the problem,” Katara counters honestly, and Chunhua tilts her head. “We can do the work. I'll have to fight the council on funding, I'm sure,“ she adds, a bit darkly, thinking of how much they're gonna  love this one, “but people who aren't nobles deserve the opportunity to learn. Everyone benefits from expanding education.”\n“What do you mean?” Chunhua asks, with some trepidation, “that you'll have to fight the council?”\nKatara blinks, and decides to dive in. “Zuko's – the Fire Lord's – Ministers,” she clarifies, and Chunhua's eyes slowly widen. “We don't agree on much, but I think a lot of them  do want the best for the country. I just have to convince them of it. But you've given me a lot to think about.”\n“You're on the Fire Lord's Council of Ministers?” Chunhua breathes, backing away as though she's afraid Katara will explode, and she's suddenly missing her earlier anonymity.\n“Yes,” she says. “Zuko's an old friend,” she adds, although it's only half-true. “I decided to come here to help him, he seemed… over-stressed.”\n“Does that mean…” Chunhua starts, sounding a bit faint, “that you're the waterbender who fought with the Avatar to end the war?”\nShe winces, in spite of herself. “I am,” she replies, a bit tightly, and Chunhua stands rapidly, face pale.\n“I've been so rude, I didn't mean to –!”\nKatara starts. “You haven't been rude at all!” she says, aghast. “Why do you think you've been rude?”\n“You’re a hero,” she breathes, hands over her mouth. “I had no idea you were here now!”\n“Well, I've only been here a couple of weeks,” she mumbles, feeling a little embarrassed. “Please, don't treat me like I'm some kind of… like I'm special. I just want to know how I can help you.”\nChunhua stares at her blankly, for almost too long, before asking, “Why?” like it's genuinely strange.\n“Because that's why I'm here,” she answers, also confused. “To help.”\n“But nobody on that council cares about us,” Chunhua says. “It's all big politics, like trade with the Earth Kingdom and deals with each other about who gets to rule over what. They just tell us what they're going to do.”\n“Well,  I  care,” Katara says firmly. “And I want to know what you need.”\nThe silence that falls hard after her statement is long and tense, and after a moment, she decides that she's had enough, and stands.\n“I'll come back in a few days,” she says, laying a few coins on the table to pay for the meal. “I promise, I'm not just saying that. I really  do care.”\n“They usually say that,” Chunhua replies softly, guarded. “That they care about us, and then they  don't. They get us into wars and get our  families killed –” this she says with such pointed, emotional emphasis that it can't be anything but personal “– and they tell us it was for our own good.”\n“I'm not starting any wars,” Katara says, matching her tone, heat and water rising behind her eyes. “I lost my mother in the last one, I'm  not getting behind any more fighting. I want to make things better for people.”\nChunhua tilts her head, eyes softening. “I think I believe you,” she says, and Katara smiles. “I hope to see you again soon.”\nShe nods. “I'll be here. I promise.”\n.\nShe returns in two days, and Chunhua smiles with a sort of uncertainty when she walks through the door, as though she's been burned so many times that she's afraid to hope.\nAnd Katara knows for certain that she has done the right thing by coming here.\n.\nShe writes to Ty Lee that second week, and gets a surprisingly helpful response.\n The ministers are mostly old nobility, Ty Lee writes,  but a few of them actually fought in the war. They’ll be your biggest allies, some of them really lost a lot, they'll support anything they think might end the fighting for good. \nAnd also,  Mai thinks you’re crazy, but she says good luck, but Katara doesn’t know what to make of that. She knows that Mai left the Fire Nation altogether shortly after last year’s Council of Four, and on somewhat-sour terms, although Zuko was never forthcoming in his letters and she didn't really know how to phrase the question; all of her asking-without-asking questions had received perfunctory answers with no details, and she couldn't press for more without coming off as nosy. Suki was a dead end, too, since while Katara  deeply suspects that she knows, she’s always insisted that she has no idea what happened, that Mai just up and left one day.\nSo Mai could have any number of reasons – good or bad – to think that Katara is crazy for trying to help Zuko.\n(The ‘good luck’ was nice, though, even if it  was probably sarcastic. However, Katara has made it one of her life goals to see the best in people, so she’s going to choose to believe that Mai sincerely was wishing her luck.)\nShe’s not sure where to start on opening a public school; she’d like to ask Zuko, but they’re still not really talking, and Ty Lee, for all of her helpful insight into the council, didn’t really know either, and finally, in a fit of mild homesickness, she writes to Sokka, and receives a reply only a day later – he must have gotten her letter and responded immediately, the way she did when Zuko would write her for advice.\n I wouldn’t go that far this soon, he writes.  You’ll need allies on the council before you can make something like that happen. I think you’ve had the right idea so far, just watch and don’t push. \n Not that you’ve ever been great at not pushing, he adds, and she can almost hear him rolling his eyes.  But it’s you and Zuko against all those ministers right now, the last thing either of you need is to make anybody mad. How is he, by the way? \nShe doesn’t quite tell him the truth; she’s still too ashamed to admit it. Instead, she tells him that Zuko is doing all right, but he really, really needs all the help he can get.\n Good thing he’s got you, then, Sokka writes back, with a little smiley-face drawn next to it, and her heart sinks.\n Yeah, she replies, glad he can’t see her face.  I’m really glad I came here.\n.\nShe tries to take Sokka’s advice, because it’s good advice and because he’s usually better at this kind of subtle pragmatism than she is, but she mentions it anyway at the next meeting, albeit off-hand, as though it’s not that big a deal.\nOne of the ministers, a man about Iroh’s age, scoffs.\n“A  school?  ” he sneers. “For the  masses?  Please, my lady –” this with ironic emphasis that makes her blood boil “– we are here to discuss serious matters, not those befalling  peasants.”\n“Those  peasants  are the backbone of your country,” she counters, through gritted teeth. “They till the fields that feed your family, they man the ships that catch the fish on your plate, they fire the porcelain you drink your tea from, they  pick  the tea you drink! You don’t have to agree with me,” she continues, voice low with rage, “but I  demand that you show respect to the people you claim to speak for.”\n“You demand?” he snarls, eyes alight, and she’s so angry she could  hit him – angry because that is what he responded to out of everything she said, angry because they’re even having this argument, angry because she’s alone and she made this bed for herself years ago – but Zuko steps in.\n“Minister Xu,” he says sharply. “The Lady Katara has a point. We can discuss whether or not a public school is a practical undertaking, but the people deserve respect, and I will stand behind her demand that you treat them with such.”\nHe won’t look at her, even as he speaks in her defense. It makes something inside of her cringe.\n“Of course, my lord,” Minister Xu says, although it sounds pained. “I do not believe that a public school is a practical undertaking at this time.”\n“She never suggested that it was,” Zuko counters, raising an eyebrow. “Simply that it was something the people may want in the future. We can revisit the topic at a later time when it may be more practical. I, for one, think it’s something worthy of consideration.”\nShe isn’t sure if he really does think it’s worthy of consideration, or if he’s simply angry with Minister Xu; either way, she’ll call it a win, for now.\nThe meeting ends shortly after that, with little ultimately being decided, but Katara does manage to catch Zuko afterward this time.\n“Thank you,” she says, a little ashamed at inadvertently turning the meeting into a scene.\n“It’s a good idea,” he replies, shrugging, although he looks far more uncomfortable than his flippant tone would suggest. “Xu was wrong to dismiss it out-of-hand.”\n“Still,” she sighs. “I appreciate it.”\nHis eyes soften, but then he looks away. “Katara, I asked you to come here so you could help me make things better. Of course I’m gonna have your back when you want to do that.”\nShe smiles at him, a bit tentatively, and he even returns it, although there’s a sort of closed-off sadness in his eyes.\nHe won’t say it, but she hears it all the same:  even though you didn’t have my back last time.\nBut it’s sadness there on his face, not anger, and Katara isn’t sure if that’s better or worse.\n.\nThis time, she goes to the market; it’s a sprawling, disorganized, open-air affair – clearly something that sprang up on its own, rather than a planned sort of thing like the market back home – filled up with people and things to be bought. Some of the shops are centered in buildings, and probably stay there full-time, things like butchers and candle-makers and herbalists, and some of the shops have been set up right there on the street; she sees a woman selling Genuine Southern Water Tribe Textiles in a loud voice, and has to stop herself and her homesickness from going over and buying things she doesn’t need.\nThere are people selling foods she’s never eaten, books she’s never heard of, clothes more exquisite than anything she’s ever dreamed of, silks and satins and brocade, with unfamiliar names like  tomesode  and  aodai; it’s a loud and bustling place, but in between the dazzling array of goods, she sees the beggars and the prostitutes and the buskers.\nThe market attracts all sorts, after all. She gives a handful of silver coins to a woman playing a shamisen, and asks after her story.\n“Oh, the usual, I suppose,” she replies, waving a hand airily. “My husband got sick and died, my son was killed in the war, and I couldn’t run the farm all alone. I heard that there was opportunity in the city, so I sold the farm and came here.”\n“You live in the area?” Katara asks, and the woman laughs, a harsh sort of bark that speaks to the kind of humor you have to make for yourself sometimes, in the dark places.\n“I live right here, friend. I didn’t have enough to pay rent, and nobody would take me on as a maid, so I used the last of my coin to buy an instrument and now this is how I make my living.” She pauses, sighs a bit, and then gives Katara a more genuine smile. “It’s not all bad. I always wanted to be a musician, and I  do make enough to get by.”\nThere’s a sort of resigned hope in her eyes, the sort that’s long-since given up on a better life, but merely hangs on to the belief that things might not get worse.\n“Others have it much worse than I do, my dear,” she goes on, seeing the expression on Katara’s face. “At least I had a skill I could use to make money, I never had to resort to crime.”\n“You’re happy, then?” she asks softly, and the woman glances away.\n“After my son died, I gave up on happiness as a goal,” she answers. “I get by. That’s enough.”\nThe last is more than just a comment, it’s a gentle admonition, telling Katara to stop pitying her and stop prying.\n“Thank you for speaking to me,” she says, a bit lamely, because there’s little she can say to help the lady, and less she can think of to do.\n“Thank you for asking,” the woman counters, smiling. “Not many care to.”\n.\nShe gets into it with Minister Xu again at the next meeting, although she tries not to. But he makes a comment about needing more oversight in the marketplace and her visit there is still so fresh and so vivid in her mind – the beauty, the sprawl of it – and he backs up his claim with a mention to “the people who beg on the streets” and it rubs her the wrong way.\n“The people beg on the streets because they don’t have enough to pay rent or buy a house,” she counters, biting back a righteous fury as she remembers all the kindness the people on the street showed her – far more, she thinks sourly, than what most of the ministers have.\n“Now you speak for beggars, as well as peasants?” Xu scoffs, and Katara resists the urge to ice over his mouth so he’ll shut up.\n“I speak for the people who have no voice,” she hisses. “The ones you would never deign to ask, never lower yourself so much as to speak to.”\n“That sort of bleeding-heart philosophy may work in your… tribe,” he starts, and she can almost hear the word  savages in his tone, and her hands curl into fists entirely without her input, “but you are not in the Southern Water Tribe anymore, you cannot simply come into our country, wielding your culture like a cudgel, and remake it all in your image.”\n“Someone has to speak for them,” she snaps, rising in her seat, and maybe Zuko can see this ending badly, because he stands up fully.\n“That’s enough,” he says sharply. “This meeting is adjourned.”\nShe’s still fuming when one of the other ministers – the older lady who discussed trade with her at that second meeting, a woman named Minister Lian – pulls her aside.\n“Minister Xu may allow his emotions to get the best of him, my lady,” she says, and the epithet honestly sounds sincere, “but he  does have a point. The Fire Nation does not work the same way that the Water Tribe does, and while your perspective as a member of a different culture is valuable, I do believe that it would be good for you to learn more about the country before you try to make sweeping changes.”\nShe takes a deep breath, in a somewhat-failed attempt to calm herself. “Thank you,” she says through gritted teeth, because the advice is meant in kindness, even though a part of Katara wonders just why this woman has decided to be on her side. “I haven’t explored the library nearly enough, I admit,” she goes on, with a forced laugh, and Minister Lian smiles. “I’ll start tonight.”\n“I suggest starting with the history,” Minister Lian says, and her kind smile becomes a bit more wry. “The scrolls of law are… no small undertaking.”\n“I appreciate your advice,” Katara replies. “But what made you decide to speak to me?”\nThere’s an odd sort of knowing in the older woman’s face, but Katara can’t place it. “You have more power than you know, Lady Katara,” she answers enigmatically, “and you have a good heart. I hope to see you at these meetings for years to come, and I would aid you in being the best… you can be.”\nShe wonders what Minister Lian was going to say after ‘best’, but isn’t sure she really wants to know.\n“May you have a good evening,” Minister Lian says, bowing slightly. “I will see you here next week.”\n“Yes,” she replies. “I will be here.“ And then, remembering her manners: “Good evening to you as well.”\nMinister Lian smiles, and then walks away, leaving Katara alone in the meeting room with her thoughts.\n.\nShe goes to the library straight away, pulling out the scrolls of law even though Minister Lian warned her against them, along with scrolls and books on history, and sets herself up at a small table with a little lamp, and it’s a nice, cozy nest of information, but then she actually starts to read them.\nAnd she realizes that the Fire Nation  really did not choose their historians based on their ability to write engagingly.\nShe makes it through one arduous, painfully-boring scroll before she decides that this little nest will be the scene of her death unless she makes a change, but there’s no way around it – Minister Lian (and, she cringes, Minister Xu) was right, she  has to read these and understand them. But, she thinks obstinately, she doesn’t have to do it here, in the dimly-lit, quiet, and very sleepy library.\nAll of which leads her to a small, private garden near the center of the palace – Zuko had breezed by it when showing her around the palace, although he had breezed through most things in that tour, but he did say that she was welcome to come here and “use the pond” (he winced when he said it and then tried to clarify that he meant for waterbending practice, and he stumbled over himself to the point that he just gave up and went on to the next hall). And she really doesn’t intend to do any waterbending right now, but she  does think the cool night air and the proximity to her element might help her focus.\nIt does, and almost too well; she doesn’t hear the door slide open or Zuko walking through it.\n“What…” he starts hesitantly, and she jumps, “are you doing?”\nKatara looks up, blinking back to the world around her. “I'm reading up on Fire Nation law,” she replies, as though it's obvious, but he looks confused.\n“Why?”\n“Because Minister Xu was right,” she sighs. “I started looking so I could prove him wrong, but he  wasn't. I can't just come into your country, wielding my culture like some kind of – of cudgel. If I want to help you – and I  want to help you – I need to actually understand your country.”\nZuko stares at her for an uncomfortably long moment, and finally she shifts.\n“What?”\nHe makes a face. “I don't think any of those ministers have actually read those scrolls. They teach some of it in school, but  nobody reads the scrolls themselves. They're… dry.”\n“Well, I didn't go to your school,” she shrugs. “And I can tell nobody’s read these. There are so many laws that contradict each other, or just don't make sense. Did you know,” she starts, because it's so bizarre and, in her mildly sleep-deprived state, hilarious, “that under the reign of Fire Lord Haulo the Second, it was made illegal to ride ostrich-horses on the palace roof? Why is that a law? Did he  honestly have so many people doing it that he felt the need to make a law?”\n“I'm more concerned with how,” Zuko muses, and she glances up to see him peering at the roof, which is very high up and sharply angled. “How do you even get an ostrich-horse on the roof?”\nThey look at each other, and the decision is made.\n“Somewhere there has to be a roof access,” she says, at the same time that he says, “There's gotta be a trapdoor or something, big enough you can get one through.”\nHe helps her to her feet. “Now,” she starts, hands on her hips, “if I was a giant trap-door to the roof, where would I hide?”\n“Probably the south wing,” Zuko suggests. “It doesn't get used as much.”\nEventually, they find it in the north wing, behind a secret passage that Katara stumbles upon entirely by accident.\nIt's very simple, just an opening in the wall that leads to a staircase up to a platform and a well-concealed door that opens up to a parapet on the roof.\n“Yep,” she says, to a bemused-looking Zuko (who is apparently learning far more about the kind of people who built his nation than Katara is at the moment), stepping out onto the clay tiles and looking out over the sloping palace and far-below Caldera, “you could definitely ride a flock of of ostrich-horses through here.”\n“But why would anyone  do that?”\nShe thinks about it for a moment. “My theory is, a couple of kids figured out about this passage and decided to have fun with it.”\n“Where would they get the ostrich-horse?”\n“All they'd have to do is rent one for a while,” she suggests, and he seems to think it over before shrugging agreeably.\n“I could see that,” he replies, and then hesitates for a moment, before: “My theory involved crazy assassins.”\n“Also a possibility.”\n“Don't say that,“ he says, with an exaggerated shudder. “I can't walk out of this place without a half-dozen daggers flying at my face, the last thing I need is for them to find a way into my palace.”\nShe laughs, in spite of the dark subject matter. “I take it back, then. Totally assassin-proof.”\nHonestly, it probably is; the only access is from inside the building, and if you were already inside, why go all the way to the roof? Privately – although things between her and Zuko are too strained for her to dare bring it up – she thinks that it was probably built-in as a place for the Fire Lord to get away from the rest of the court, perhaps with his or her lover.\nA quiet, secluded place where they could stargaze and look out over the city. It's actually kind of sweet to think about, the Fire Lord (and if it was the one who built the palace – she cringes internally at the fact that she now knows this – it would have been Fire Lord Amaya the First) specifically building in a secret place where she and all of her descendants could go for a private, romantic moment.\nIf she was Haulo the Second, she thinks she might have been upset, too, if some snot-nosed prince used this as a way to play pranks on his dad.\nShe takes a seat near the edge, where she can look out over the city, and Zuko joins her after a moment.\nThe Caldera is beautiful from up here, spread out underneath them, a bunch of tiny lights and stars reflected off the calm ocean, and for a long time they just sit in companionable silence, until Zuko takes a deep breath.\n“I appreciate that you're reading up on our laws,” he says abruptly, and she glances at him, so he continues. “I mean, it means a lot to me. Those scrolls are  dense.”\nShe smiles. “Promise me something, Zuko,” she sighs, with more drama than is necessary. “When you hire historians to write about all that happened in our lives, make sure they can write a good story. Your sages somehow made the history of  dragon-riding  boring. I wouldn't have thought that was possible.”\nZuko laughs outright at this.\n“But seriously,” she goes on, leaning back onto her hands. “I meant it when I said I wanted to help you. You've been under  way too much stress.”\n“Thank you,” he says quietly. “And…” he hesitates, then rubs the back of his neck. “I'm sorry for being… mean to you when you first got here.”\nShe looks at him. “Zuko, when I felt like you'd betrayed me,” she begins softly, “I threatened to  kill you. You weren't mean, you were just honest. I deserved it.”\nHe looks like there’s something more he wants to say, but whatever it is, he shakes his head and glances away. “Still. I was mad at you for caring more about your boyfriend than me, and that wasn't fair.”\nShe shakes her head, but doesn't press it; Zuko seems to believe that anything that goes wrong is because of his failure, never because of someone else's failings or because the world sometimes just isn't fair.\n“I forgive you,” he says finally, in a bit of a rush, “is what I'm trying to say. Not that… I don't really think you… I mean, you said you didn't think I could ever forgive you, but it's not like… that.” He winces hard and looks away, and she pokes him in the arm to bring his attention back to her, but she doesn't really know how to respond.\nSo, she takes a leaf out of Toph's Method of Dealing With Life, and makes a joke of it. “And we didn't even have to go on a life-changing field trip this time!”\nHe laughs, so she calls it a win. “Are you kidding?” he asks, looking at her with a smile on his face. “This  was life-changing. I know how to get an ostrich-horse on the roof now.”\nKatara laughs.\n.\nHe suggests a cup of tea the next morning, and she smiles.\n.\nThings do begin to improve; the air between her and Zuko is warmer now than it was before, and she has a better grasp on the nuances of the Fire Nation, even though she's only part of the way through the scrolls she's borrowed from the library. In spite of their dryness, each one she reads makes her more determined to read the next one, to  understand, to find a way – either hidden in the old tomes or of her own making – to help Chunhua and the shamisen-player and all the others like them.\nShe surprises Minister Xu at the next meeting, when they revisit the topic of “cleaning up” the marketplace, and she cites a Fire Sage's writings about how fire has the power to warm those without coats and bring light to those without lamps, how it is their duty, as leaders, to be warmth and light when there is little to be found elsewhere.\n(Minister Lian seems to have trouble concealing a grin.)\n“I disagree that that is our job,” Minister Xu says thoughtfully, but sounds significantly more respectful than he ever has previously. “People can find jobs, if they simply expend the effort to look. There is plenty of work to be done, after all.”\n“But if you can't get on your feet in the first place, who would hire you?” she counters. “And that brings me to my next point, actually, thank you, Minister,” she says, nodding at him and glancing to (an amused-looking) Zuko. “You have a point, that there  is plenty of work to be done, but there's no organization. People don't know where they can find work. They come to the city because they've heard there's opportunity here, but they don't have anywhere to start. I'd like to propose a sort of… connecting agency, that finds people who are looking for jobs, and pairs them with people who need help.”\nThere's a short pause as that sinks in, and Zuko nods. “I like it.”\n“I would like to join in this,” Minister Xu says, glancing from her to Zuko, who raises an eyebrow. “I know a number of people who have jobs which need doing, and if the lady can connect them to people needing work, I think we can all benefit.”\n“I have no objection,” Zuko says, but sounds a bit hesitant, and glances at her. She has serious reservations about working with Xu, but, well, everyone  does stand to benefit from this.\n“Neither do I,” she replies, and forces herself to smile.\n.\nLater, she wants to discuss with Zuko how to go about making this agency happen, but he isn’t his office, and the servants tell her that he hasn’t yet gone to bed, and he isn’t in the kitchen or the garden or the library…\nIt hits her while she’s standing in the empty, dark library, trying to figure out where Zuko might be.\nOf course.\nSure enough, he’s on the roof, laying on his back and looking up at the stars, and he starts when she walks through the door, then relaxes.\n“You found me,” he says bluntly, and she laughs a little.\n“Well, you weren’t anywhere else,” she replies, and lays down beside him; he doesn’t look at her. “If I was a really serious minister trying to talk to you about serious stuff, I would have given up.”\n“Good.”\nThey lay there for a long moment, and she figures that the politics can wait until tomorrow; in fact, she decides, right here and now, not to talk policy at all up here. She isn’t sure what Fire Lord Amaya the First really intended when she built this place, but  Katara decides that it is going to be a safe haven from all the stresses of being in charge.\nThe night sky is brilliant, this far up above the rosy lamps and bustle of the streets, and it’s a new moon, so there’s nothing up there to see except the stars and the milky white splash near the eastern horizon.\nShe points at it.\n“You know what that is?” she asks, and it’s only half a question. Zuko glances at her.\n“What?“\n“It’s Torgarsuk’s paint well,” she tells him, turning her head to look at him and catching his eyes for a second before looking back up. “My mother told me the story, how he painted the sky with stars to please his sister the moon, and we know this because he left his paint on the edge of the canvas of the sky. He also painted the constellations,” she goes on, still feeling his eyes on her and willing herself not to blush. “The bear, the iceberg, the koi and the penguin-otter and the tiger-seal. All so she’d have company up there.” When Zuko doesn't respond, she prompts him: “What stories did you hear?”\n“Oh,” he says, a bit uncertainly, “nobody ever told me stories about… constellations. But,” he adds thoughtfully, “my mother  did tell me the story of how the first dragon breathed fire into the sun.”\n“Oh?”\nHe glances at her. “That's… that's the story,” he mutters lamely, and she snickers at his tone. “The first dragon breathed fire into the sun to light up the world, it… it wasn't exactly in-depth.”\n“My mother told me that the sun and the moon were twins, two sisters,” she says slowly. “They got into a fight one day, and the sun, Siq, ran away from her sister, Tui, but Tui gave chase, unwilling to give up the fight, and she's so single-minded that she forgets to eat, and that's why the moon wanes. And when Tui catches up to Siq, there's a solar eclipse. That was… before I knew about the spirit oasis,” she adds, wincing.\nBut Zuko is smiling. “That doesn't mean it didn't happen, once,” he suggests, and she looks at him, returning his soft smile.\n“Sokka says it's nonsense,” she says, sighing and looking back up. “But I  like  the thought. I  like living in a world where the sun and moon argue, and where a spirit painted the stars to make his sister happy. It makes me feel… I don't know, less alone.”\n“You feel alone?” Zuko asks, sounding genuinely concerned, and she bites her lip.\n“My mom was my best friend when I was little,” she replies, without looking at him. “When she died, I felt like… nobody would ever understand me like she did, or be there for me. I was wrong,” she adds unnecessarily, glancing sideways at him. “But I guess those feelings die hard. I just like to believe that I live in the world she told me stories about, it… it sort of keeps her alive to me.”\nThey fall quiet for a long time, until Zuko glances at her, biting his lip.\n“Do they have different constellations down there?” he asks, and she shakes her head.\n“No, it's mostly the same stars,” she replies. “In the Northern Tribe, they're all different, but there's plenty of the same ones here. Why?”\n“Because I'm trying to find  any of those that you mentioned, and I've got nothing.”\nShe laughs. “I think you have to have a  really vivid imagination,” she concedes. “I mean, I've never seen a bear,” she says, pointing at it. “I always said it was a pot.”\nZuko nods slowly. “I've always seen a cart,” he admits, and she tilts her head.\n“Yeah, I can see that,” she muses. “You've got the lead for the ostrich-horse, and then the cart itself. I don't really know how they got a bear.”\n“I did see the dragon,” he says, pointing at the constellation which is, to her, the koi. If she puts herself into the shoes of a little Fire Nation kid, growing up on tales of dragons setting fire to the sun, she can see where he's coming from.\n“I see the koi,” she tells him, and he shrugs.\n“They do have the same kind of shape,“ he says, and then adds, “at least when you're connecting dots. Not… in real life, they're not really the same shape.”\nKatara laughs, because now she's picturing little dragon-koi in the spirit oasis, and it makes her happy.\nThe silence that settles in after that is warm and light.\n.\nShe and Zuko are both bleary-eyed and nursing large cups of strong black tea in the morning, having spent  entirely too long on the roof discussing constellations, although weirdly enough, he looks less tired than he did when she first got here.\n.\nThe agency doesn't quite go off without a hitch, but it does go a lot smoother than she would have expected, and although she  does receive a few glowers from some of the less-helpful ministers, Xu is a surprisingly enthusiastic coworker. And then, while they’re going over a map to find a place to base the agency out of:\n“I apologize for my rudeness,” he tells her abruptly, and she looks up, startled, so he continues. “You must understand my perspective. The Fire Lord brought an old friend with very little political experience into his council of ministers and she immediately set about to telling us how we've done things wrong. I thought you naive and arrogant,” he admits, without any apparent shame or compunction. “But I see now that you do have the best interests of the nation at heart, and so I apologize for being rude.”\n“Thank you,” she replies slowly. “And… I apologize, too, for not taking the time to learn about the nation's laws and history. And for losing my temper.”\nHe smiles thinly. “You're a passionate young woman, Lady Katara. Perhaps Lian has a point,” he adds, rubbing his beard thoughtfully, “that such passion and drive to improve the world could be a good thing.”\nSo Lian and Xu have been talking about her? Interesting.\n“However,” he goes on, raising an eyebrow, “simply because I respect you does not mean I agree with you in all things.”\n“Nor do I expect you to, Minister Xu,” she says, and smiles. “You're a pragmatist, I wouldn't think you'd agree with all of my ideas.”\nHe sighs and glances out the window. “I was once an idealist, my lady,” he says, apparently out of the blue. “I fought at the Siege of Ba Sing Se,” he goes on, which surprises her, because she had Xu pegged as someone who never fought in the war, “under General Iroh, when he was still the crown prince. We had great dreams of bringing the light of our civilization to the backwards Earth Kingdom, making things better for everyone by bringing them all under one rule.”\nShe isn't sure how to respond, but he doesn't really give her the opportunity to.\n“I lost my son on that battlefield,” he says softly, “as did the General. I didn't see it happen, I only found his body among the dead later. All that my fighting for a better world accomplished was my son's body in a mass grave.” He looks down, and then back at her. “So now I confess that I have little patience for ideals, and less for fighting unwinnable battles.”\nKatara thinks over that for a moment, before biting her lip. “Do you know a man named Yon Ra?” she asks quietly, and he raises an eyebrow.\n“I've heard of him,” he replies. “Former leader of the Southern Raiders, if memory serves.”\nShe nods. “He is. I tried to kill him four years ago,” she says simply, and Xu actually laughs once at that, although it sounds more surprised than amused.\n“He stopped you?”\n“I  stopped me.” She pauses for a moment, weighing how much she really needs to tell him to get her point across. “The Southern Raiders attacked my tribe many, many times,” she sighs. “Yon Ra killed my mother. I wanted him dead, I wanted him to  suffer. But when I actually had him at my mercy, I couldn't bring myself to do it, no matter how much I hated him. My point is,” she goes on, looking up, “I didn't come to my idealism from a place of naivety. It's a  choice  I've made, and still make every day, to believe that the world can be  better than the one I grew up in.”\nXu watches her critically for a long moment. “The Fire Nation killed your mother and destroyed your home,” he murmurs, “and yet you came here with ideas of helping us?”\n“Yes,” she answers, nodding. “Because a better world starts with  me. I can't sit here and preach about peace and a better world if I'm not willing to let go of my own anger. How could I expect anyone else to, if I don't do it first?”\nHe tilts his head. “If you were anyone else,” he says slowly, “I would expect that you were secretly trying to destroy us from within.”\n“But you trust me?”\n“Trust is not a word I like to use in the high court,” he counters, raising that eyebrow again. “But I do believe you when you say that you want peace. We have the same goals, Lady Katara, and I hope that we can work together to bring them about.”\nShe smiles. “I do, too, Minister Xu.”\n.\nThe Fourth Annual Council of Four is coming up much quicker than she thought it would, and the plans for that soon eclipse all other discussion; it'll be in Ba Sing Se this year, and, unfortunately, they're expecting to be revising many of the things that didn't get resolved at the last one, mainly the issue of the colonies.\n“I just have no idea what to  do,” Zuko groans, over a pot of tea in the kitchen late one afternoon. “I get where the Earth Kingdom is coming from, but some of those people have been there for a hundred years. I can't just kick them out and make them come back here.”\n“Especially when there isn't much  for  them here,” Katara adds, and he looks up at her with something akin to desperation in his eyes. “Our job-finding agency has been pretty successful, but it's not  creating work, just connecting people to it. What we need is some kind of… I don't know, project that we can hire people to work on, and maybe entice people from the colonies to come back and work there. That way, they'd have a good reason to return, and something to come back to.”\n“But  what? ” he asks, and she sighs.\n“I don't know. I'll think about it, though,” she says, and shrugs. “And I'll bring it up in the next meeting. There are a lot of businesspeople on your council, maybe they'll have ideas.” Zuko makes a face, and she leans in over the table. “Hey, that's what they're there for. To advise.”\n“They think they're there to make themselves more money.”\n“Not all of them,” she counters, thinking of Lian's advice and Xu's admission about his son's death. “Some of them really  do want peace and prosperity for the country.”\nHe runs a hand through his hair and drains his teacup, and he looks so frustrated that her heart goes out to him.\n“Zuko, it's gonna be okay,” she says seriously, and pours them both another cup. He looks up at her. “I  mean  that. It's going to work out. I'm here, and I'm on your side.  We are going to make this work.”\nHe watches her for a moment with an unreadable expression, before taking a deep breath. “Okay,” he breathes, nodding. “Okay. Just… think positive.”\n“Don't strain yourself,” she says, smirking, and he gives her a mock-glare.\n“I mean, I can be doom and gloom, if you'd prefer.”\n“Please, I've seen you at your angstiest,“ she retorts, waving a hand. “That doesn't scare me.”\n“No,” he counters, with feeling, and she laughs. “No, trust me, you have  not.”\nA servant comes in with a letter in-hand, and walks up to them with what appears to be apprehension. “My Lord?” he says, and Zuko looks up. “It's for you.”\nZuko takes it but doesn't look at it, simply setting it down on the table and thanking the servant, who looks oddly relieved.\n“You're not going to read it?” Katara asks, and Zuko shakes his head.\n“It's probably some political drama about the Council of Four,” he replies. “It can wait.”\nKatara smiles, and sips her tea. “No crappy politics during teatime?” she suggests, and he snickers.\n“I'm going to make that a new official proclamation. Whatever it is, it can wait until I've finished my damn tea.”\n“I'm all for it,” she says, raising her cup to toast, which he returns, smiling at her. He really looks so much younger when he smiles, she thinks, younger and brighter.\n“To dealing with it later,” he toasts, and she laughs.\n“To dealing with it later,” she repeats, and they drink.\n.\nIt must have been something more serious, though, because Zuko doesn't come to dinner and she doesn't see him at all afterward, so she goes looking.\nShe finds him on the roof, holding the letter and looking up like the stars will answer his questions.\n“You know you have an early meeting, right?” she asks, as a bit of an icebreaker as well as a reminder. Zuko glances at her.\n“I couldn't sleep,” he replies softly, and she sits next to him, waiting. She thinks she knows Zuko pretty well by now: if he didn't want to talk about the letter, he would have put it in his pocket when he heard the door open. But at the same time, he won't want to be asked. He's strange like that. (Or maybe not; she recalls how she spilled everything about her break-up to Ty Lee, who barely asked her anything, but clammed up when Sokka did the same. Maybe there's something in the both of them that feels more need to fill up silences than answer questions.)\n“Something on your mind?” she prompts, but pointedly keeps her eyes on his face rather than calling attention to it. He sighs.\n“It's from Mai,” he says, holding up the letter. She does not want to examine the emotion that rises up in her at his wistful tone. “Apologizing.”\n“For what?” she asks, with no small amount of trepidation.\nHe runs a hand through his hair.\n“Her father tried to have me killed last year,” he answers, in a strange sort of tone that makes her think of herself, almost two years ago, wishing that Sokka would just leave her alone, even though it was all threatening to burn her up from the inside out. “She told me about the plot, but she lied about her father's involvement. Said he was innocent.” He laughs, mirthlessly. “Now she's saying that she made a mistake, and asking me to understand.”\nKatara lets that sink in and roll around in her head for a moment, before forming a response.\n“Understanding isn't the hard part,” she muses, and when he looks at her, eyebrow raised, she goes on. “It's  not. What she did is completely understandable, it's just wrong. I feel bad for her,” she goes on, glancing away. “That's an awful place to be stuck, and a terrible choice to have to make, but she still made the wrong one.”\n“She tried to be neutral,” Zuko says, voice deceptively even, and she doesn't know if he's agreeing or disagreeing with her. When he doesn't go on, she feels that powerful need, again, to pour something of herself into the silence.\n“But sometimes neutrality is  wrong,” she says deliberately. “If you're walking down the street and you pass someone beating another guy up, and you just say “well I'm neutral on this,” you've just helped the attacker by  not helping the victim. You might have good reasons not to get involved, but you've still implicitly supported the guy doing the attacking.”\n“She  did help me, though,” he points out. “She warned me.”\n“And left you with a traitor among your staff, who you didn't know you couldn't trust,” she counters, with feeling. “What happens next time, when he keeps her in the dark about it because he figured out that she warned you? Then what?”\nZuko looks away. “Then what, indeed,” he murmurs, almost too quiet to hear, and shakes his head. “You don't really understand Mai,” he says, louder, and she looks at him, a bit affronted. “She tried to be neutral because that's what she  does, it's what she was taught to do. Be a mediator, keep things running smoothly. She tries to be neutral on everything.”\n“But you  can't  always be neutral. Sometimes you  have to pick a side.”\n“Forgive me,” he says, with a wry, tired-looking smile, “but I don't think you've ever been neutral on anything in your entire life.”\nShe laughs a bit at that. “I can't think of much I don’t have an opinion on, that's true.”\n“It's easy for you, is what I mean,” he adds, more serious. “It's not easy for Mai. She was brought up to never rock the boat.”\nKatara thinks about it for a moment before replying, in a measured voice, “Then she wasn't right for you.”\nZuko tilts his head. “You think I don't need someone who's been trained to make things stable?” he asks, and his tone is almost rhetorical; she wonders who he intends to convince.\n“I think you don't need someone who's been trained to maintain the  status quo,” she clarifies. “Maybe if you were crowned in peacetime, when things were already going pretty good for most people, then you'd want someone who keeps things running smoothly. But, Zuko,” she sighs, runs a hand through her hair, and winces at him, “things kinda  suck  for a lot of your people right now. I mean, people are starving, watching their  children starve, because a lot of the men and women in power aren't willing to let go of the war. You don't need to be compromising with people who would let your citizens starve to death in the cradle.”\nThere's something written in his expression, something she doesn't want to read just yet, something about longing.\n“You really care about them,” is all he says, though, in a strange voice.\n“I do,” she replies simply. “I care a  lot about them. I've spent a lot of time in the city and the markets, talking to people about what's wrong, and they're good people, Zuko.” She looks at him fervently. “They deserve better, and if I can help give it to them, I'll do whatever it takes.”\nHe's still looking at her with that odd expression, and she turns away, feeling a bit awkward and unsure of her footing.\n“Why?”\nShe looks up at the question. “Why?” she repeats, a bit dumbly, and he shrugs.\n“Why do so much for us? For  me?  You could have had the easiest life,” he goes on, sounding a bit agitated. “You could have married Aang and never had to get involved in any of this. Why did you  choose all this stress and drama?”\nShe turns away from him again, but this time to the sky, the stars, her mother’s story of the paint echoing her in her mind, but it's less the tale that she's listening to, than it is her mother’s voice. It's so far gone to time that it sounds like her own, but she can still close her eyes and  be there  all over again, in the hut during the long, dark winter, listening with her head in her mother’s lap, to the story of how the stars came to be.\n“I have the means,” she answers slowly, after a while. “I can  help them. And if I don't, who will?”\n“The rest of us,” he replies, but it sounds almost teasing. “You know things would probably have been just fine, eventually,” he goes on, and she refuses to look at him.\n“Just fine  isn't good enough,” she replies, with force that seems to startle him. “Just fine  would have been my life with Aang, your life with Mai. We would have been  just fine  every day,  just fine  going about our business, going to sleep every night,  just fine. All four nations,  just fine. But not  great,” she continues, hugging herself around the middle. “Not even  good. Not fulfilling, not with the most opportunities, not with real peace and safety.” She pauses for a moment, biting back a hard knot of emotion low in her throat. “My mother didn't die for me so I could have a  just fine  life.”\nThey're both quiet for a long time, and then he says, in a low voice, “You know a lot of those ministers don't agree with you.”\n“I'm not going to apologize for doing what I believe to be right,” she replies simply. “If something happens to prove me wrong,  then  I'll apologize and change what I'm doing, but  only  then. People deserve a better world. I don't care if they worship me or execute me for it, I'm going to  fight for that.”\n“Well,” he says after a moment, looking down toward the city, “if they wanna execute you for it, they'll have to get me first.”\nShe smiles at him and he returns the smile, albeit a bit uncertainly, like he's not sure he's supposed to.\n“What are you going to tell Mai?” she asks quietly, and he takes a deep breath as the moment dissolves between them. She isn’t sure she wanted it to.\n“I don't know,” he answers. “She's at Kyoshi with Ty Lee, but I don't think she's training to be a warrior, I think she's just… waiting for me to tell her she can come home.”\n“Why?” Katara asks, and when he gives her a  really?  look, she goes on. “I thought she hated it here.”\n“She didn't hate me.”\n“So?” she counters, and she knows she sounds a bit callous, but that's sort of the point. “Trust me, Zuko, she  will. If you're the reason she has to spend her life trapped in a place she hates, it doesn't matter how much she loves you at the start, she'll hate you eventually. She may never tell you,” she adds, glancing from him to the letter and then away, “just like I never told Aang. But if I had stayed with him, I would have grown to hate him.”\nIt's the first time she's ever said it out loud, even really formed the thought in so many words, but it's so blindingly true that she can't imagine why she never saw it before. She would have hated him in the end – she would have been fifty, sixty, seventy years old and bitter and feeling like she'd wasted her life, and she would have hated him for being the reason for all of it.\nEven the sweetest fruit turns sour if it's planted in poisoned ground.\nHe doesn't answer for a long time, and so she takes a deep breath, steeling herself for something she won't even think of too clearly, before asking, “Do you miss her?”\nHe seems to hesitate, still watching her even though she won't look directly at him.\n“Not really,” he admits finally.\n“So be honest,” she says, and won’t acknowledge the relief she feels when he says that. “Tell her the truth.”\nHe laughs, a bit bitterly. “And what is that? That I don't hold it against her, but I don't really care if she comes back here or not? I don't think that'll make her feel better.”\n“Better an unpleasant truth than a sweet lie,” she counters, but still, she sees his point. “You don't have to be  mean about it. Just say that you don't hold it against her, but you think it's best if the two of you stay apart for a while.”\nHe seems to be undecided, so she stands up.\n“Worry about it in the morning, okay, Zuko?” she suggests softly, reaching out a hand to help him to his feet. He looks at it for a long,  long moment, long enough that she starts to feel uncomfortable, before he smiles like some kind of weight has lifted, and takes it, standing up beside her. He seems reluctant to let go of her hand, or maybe she's just projecting.\n“Right, early meeting,” he says, nodding and running a hand through his hair, before making for the door. “We should both get some sleep.”\n“Wait,” she starts, a bit alarmed. “You say that like I'm supposed to be there with you. I didn't think I was supposed to be there.”\nHe glances back at her, a genuine, if tired, smile on his face. “I thought you wanted to help me improve the country,” he teases. “We've gotta get an early start on that.”\n“I'm not a firebender,” she counters, hands on her hips, “I do  not  rise with the sun.”\n“You're in the Fire Nation, though,” he says, and he looks entirely too amused for her tastes. “It's a meeting with an ambassador from Ba Sing Se, I think you met her at the last Council. It’s just about the itinerary, it'll be fine, you'll do great.”\nShe sighs, mentally rewriting tomorrow's plans. “Fine, but you're coming with me to discuss expanding the job agency with Minister Xu.”\n“I thought you two hated each other.”\n“Nah, he's all right,” she shrugs. “We don't agree on much, but he can be pretty sensible. We really connected while we were working on the first agency.”\n“Huh,” Zuko muses, lingering on the roof as she walks through the door. “Looks like you're settling in.”\nKatara smiles. “I am.”\nact three: and it’s my whole heart (burned but not buried this time)\n.\nKatara receives a letter from Aang a few days later, a week to the day before she and Zuko and a few others will leave for the Council of Four. It’s fairly short, merely talking about matters he intends to bring up at the council, but he also asks if she would speak to him in private after she arrives.\nIt’s with some trepidation that she agrees, although she thinks it’s probably a step in the right direction, and it’s nice that he asked this time, instead of waiting for the Council to start and then ambushing her.\nShe’s not quite as anxious on the boat ride over this time as she was the last, and anyway she’s got more to think about, since she’s in something of a unique position this time – as an ambassador for two countries simultaneously, she’s going to be occupying a place similar to Aang’s, as a mediator and peacekeeper.\nToph greets them when they get to Ba Sing Se, waving at them to follow her.\n“We’re still waiting on your brother,” she tells them, “and Aang. But Aang sent word that he was held up by something at the Air Temple, he shouldn’t be much longer.”\n“And Sokka?” Katara asks, but a bit deadpan, because she knows her brother, and she knows how he gets so invested in things that he loses track of time. Toph shrugs.\n“I think his story is that the ship ran into trouble right around Kyoshi.” She marks the word  trouble with air quotes and an eyeroll. “Even though Suki’s gonna be here, too. I guess he couldn’t wait.”\nKatara smiles; Sokka has been keeping her (somewhat) abreast of things, and apparently now that Suki doesn’t have to go to the Fire Nation all the time, they’ve been able to really rekindle their relationship. He’s been really happy about it, and even confided in her that he’s been trying to carve a pendant, only he is “not the greatest carver in the world, I know this shocks you to hear”.\nShe really can’t wait to see him again. It’s strange, and it isn’t at the same time, how much she’s missed her big, goofy brother.\nThey've got a few hours to kill, since half the crew has yet to arrive, and after Toph gives them a somewhat-suspect tour of the Earth King's palace (“Bathrooms are over there, the East Wing is where the King lives so don't go there because the Dai Li will probably eat you, we'll be having all the meetings in the South Wing and the festivities in the West Wing, here are the kitchens and here is the wine. This concludes your tour.”) they split up, Zuko saying that he's going to go check out the meeting room.\nAs such, Katara finds herself wandering around the place for the better part of an hour, a bit lost.\nIt's not quite as big as Zuko's palace, but it's more open, so it feels larger and more inviting; the color palate is also greener and bluer, but it somehow seems colder to her, with hard stone floors and sheer stone walls instead of the rugs and tapestries that adorn the palace at the Caldera. The art is pretty, though, with ink-and-water paintings that, although less colorful than Fire Nation art, have their own sort of beauty in their austerity.\nShe's admiring a painting of what is probably Oma and Shu, when Zuko startles her.\n“That was quite the tour Toph gave us,” Zuko says in a strange voice, as he walks up to her from another hall. “Turns out, the palace is circular. You can  think you're walking to the meeting hall but find yourself standing outside King Kuei's door and getting ambushed by him. He likes bears.”\nKatara can't help it; she laughs out loud at this, a full-on, throwing-her-head-back-and-cackling peals of laughter. Zuko looks so blasé, and at the same time so harassed, that it brings tears of mirth to her eyes.\n“At least you didn't get eaten by the Dai Li,” she chortles, and he shakes his head.\n“I  did almost get eaten by Boscoe. Kuei mistook my manners for interest. Did you know that brown bears eat as much as 90 pounds of food per day?” he asks, with an expression of pure fascination. She bites her lip, trying with little success to restrain her laughter. “Boscoe doesn't have to eat as much, because he doesn't hibernate through the winter, but he makes up for it by eating all the time. In fact,” he goes on brightly, “King Kuei spends more on feeding Boscoe than he does feeding himself.”\n“How fascinating,” Katara squeaks, and Zuko lets out a long-suffering sigh.\n“I had to fake an allergy,” he deadpans, running a hand over his face. “If Kuei asks, I'm deathly allergic to bears.”\n“Got it.”\n“You laugh,” he says darkly, “but wait until he catches you.”\n“I  like bears,” she counters, shrugging airily, but he shakes his head.\n“Nobody  likes bears enough to listen to Kuei go on about them,” he says, with feeling. “I never  thought I hated them before a half-hour ago. Now I think they should be outlawed.”\nShe laughs, and he rolls his eyes, but it’s with over-exaggerated exasperation, and he can't quite hide his smile.\n“Boscoe's sweet,” she says, trying to contain herself, with more success than earlier. “And Kuei means well. He's just… not good at talking to people.”\n“No, Katara,” Zuko counters, raising an eyebrow. “I'm not good at talking to people. Kuei is an alien.”\n“He's not an alien,” she sighs, rolling her eyes. “He's just sheltered.”\n“You always see the best in people, don't you?”\nShe glances at him, and the humorous mood seems to evolve. “I try to,” she replies simply. “Some people make it hard, but I like to see them for what they mean to be.” She pauses, and thinks about this. “Sometimes that's “a huge jerk” but, well,” she shrugs, “you can't win all the time.”\nZuko laughs at this, the kind of sweet laugh that starts in the eyes and gravitates outward, and it's so warm in here, so she links arms with him and walks toward the nearest balcony.\n“You see the best in the ministers,” he suggests as they step through the doors. “Even though some of them were huge jerks to you at the start.”\n“It's okay, you can say Xu,” she says lightly, and he snickers. “But it's just a matter of perspective,” she goes on seriously, thoughtfully. “I thought at the start that none of them were loyal to you.”\n“They're not,” he sighs. “I've tried to weed out everyone who sided with my father, but it's hard to know who to trust.”\n“I can't speak for all of them,” she muses. “But I think mostly, they're loyal to the nation. It's… both good and bad.”\n“Loyal to the Fire Nation but not to the Fire Lord?” he challenges, but he doesn't sound particularly questioning.\n“Exactly,” she says, deliberately ignoring his tone. “They want the best for the nation: peace, prosperity, qualified freedoms. As long as that's you, they'll support you. But they'd turn on you if they thought someone else would be better.”\n“And you think this is a good thing?”\nShe looks at him, startled. “Well, yeah,” she replies, a bit blunt because it's so obvious to her. “Because you are. The best for the nation, I mean,” she adds, and turns away, looking out over the city. “They'll support you as long as you have the best interests of the Fire Nation at heart. And you do. So they'll be loyal to you.”\n“You don't think they could be convinced that, say, Azula would be better?” he counters, looking a bit sour, but she shakes her head.\n“No,” she says firmly. “Azula thrives in a war zone. The people on that council who've watched their children die in war, they don't want someone who doesn't know how to be at peace. They're  desperate  for peace, but they don't want it to come at the expense of their country's honor. That's where you come in,” she goes on, tilting her head and looking back at him. “You set out on a journey to regain your honor – which, by the way, your father never had the power to take from you –” his face comes over sort of queer when she says this, but she barrels on without examining it “ – by bringing back the Avatar, which you did. But on  your terms, not his. You saw a warmonger deposed, and took the throne on the platform of stopping the fighting for good. Look, Zuko… \n“You're approaching this the wrong way,” she says, turning full-on to him. “You think that it's you against them, and  trust me, I can see why, but it's not really. They  want  you to be the answer,” she says very deliberately, leaning forward and making sure that he is listening to every syllable she is saying. “They  want  you to be the Fire Lord who brings the nation to peace and stability. Not just the ministers, but the rest of the nation, except for a few jerks in the nobility. They  want you to be the one who saves them and their place in the world. All you have to do is hang on and keep doing what you believe is right.”\nHe doesn't reply for a while, and when he does it's in a strikingly small voice. “I haven't exactly been the answer for them so far. That's why they don't really have faith in me.”\n“Well,  I  do,” she snaps, with righteous force, and he looks up at her. “I  believe in you. And I  know  that you are the answer they've spent a century looking for. You just have to know it, too. That's your biggest problem, Zuko,” she adds, much softer. “You think you're not worthy of their faith, but you  are. You just have to trust yourself. You know what the right thing is. You know what they need. Maybe you don't know how to go about it,” she goes on, agitated, gesticulating wildly, “but that isn't the important part, not really. We can figure  that out. What matters is that you have the right goal.”\nZuko watches her for a moment longer, before turning away, blinking rapidly and swallowing hard. “You really believe in me?” he murmurs.\n“I really do,” she replies quietly. “I wouldn't be here if I didn't.”\n“Yeah, but,” he starts, looking away from her, “how  long will you be here?”\nShe blinks, the only answer rising in her at the same time that she knows exactly what sort of thing she's getting herself into by saying it. “As long as you need me,” she answers, and he glances back at her, then to the railing. “I promise, Zuko,” she goes on. “I'm here, by your side, as long I have to be to see the world through this and onto a better future.”\n“It may be a while,” he says enigmatically.\n“Then I'll be here a while,” she replies, and meets his eyes.\n.\nAang ends up arriving just before dinner, and although he joins the group at the table, he sits far from her and doesn’t look at her, instead conversing with Toph about something that appears to be serious, judging from their expressions.\n“What do you think they’re talking about?” she asks Zuko, who’s sitting beside her and looking kind of underwhelmed by the Earth Kingdom food.\n“Who? Aang and Toph?” he asks, glancing down the table and making a face. “Looks serious. Probably something about the colonies, again.”\nShe makes a face. “Ugh. Remember that “no crappy politics at teatime” rule? I think it should apply to all meals.”\n“I would be completely on-board with that,” Zuko replies evenly. “Actually, I’d be completely on-board with a “no crappy politics, period” rule, but I don’t think I could get away with it.”\nShe snickers. “Yeah, I think you’re kind of stuck with it at this point. At least you’ve got me,” she adds, a bit more flippantly than she feels. “I like the political stuff. Usually.”\n“I don’t know what I’d do without you,” he replies, with an over-dramatic sigh and a sidelong smirk at her. “Besides go nuts.”\nKatara glances at him, feeling the lightening of the mood but also the serious tone underneath. “You’d be just fine,” she says, and he glances at her.\n“A wise person once told me that just fine isn’t good enough,” he replies, and she smiles.\n“Once?” she scoffs, nudging him with her shoulder. “That was like two weeks ago.”\n“You did say it once,” he counters, lightning-fast, and she shakes her head, laughing a bit, “it still counts.”\nShe rolls her eyes, but can’t stop smiling.\n.\nSokka is, of course, the last to arrive, just as the sun is setting on the western horizon. She greets him when he gets off the boat, shielding his eyes in the fiery light and scanning the docks until he sees her, and his face splits into a huge grin.\n“Katara!” he cries, dropping his back and opening his arms wide for a hug. She tries to maintain her stern, hands-on-hips glare, but she can’t help but step forward and let him pull her into his arms.\n“You’re  late,” she accuses when she steps back, but the bite is taken away by her smile. “You missed dinner!”\nHe rolls his eyes. “I know, I know. But we really did run into trouble.”\n“Uh-huh,” she replies, raising an eyebrow and he scoffs with exaggerated offense.\n“I mean it! The Unagi hit us, I think it was hungry,” he explains, picking his bag back up. “It didn’t do a lot of damage, but we stopped for repairs anyway, because I have this thing where I don’t like my boats sinking and drowning everyone.”\n“Sure,” she says airily, “and it just  happened that you took damage right by Kyoshi.”\nHe gives her a mock-glare, but it’s ruined by his grin. “Maybe the Unagi knew that true love was about to be reunited, and it couldn’t wait.”\nKatara laughs, and glances back up to the boat where Suki is still waving her warriors into formation.\n“So…” she starts, leaning forward, “have you done it yet?”\nSokka winces, and pulls out a misshapen lump of wood. “No, because this is how far I’ve gotten on the pendant.”\nShe bites her lip, trying not to laugh because she knows this is important to him, but it really does look rather sad. “What were you going for?” she asks, and he sighs, stuffing it back into his pocket.\n“It’s supposed to be a fan, you know, for Kyoshi, with the symbol of the Water Tribe under it, but… It’s bad. You can say it, it looks awful.”\nKatara hesitates, then reaches up to touch their mother’s pendant at her own throat. She’s not really using it, she thinks, and their mother would… she’d like that.\n“Why don’t you give her this one?” she offers, and he looks surprised, then touched, but he reaches out a hand to stop her from taking it off.\n“I appreciate it, Katara,” he says sincerely, “but that’s yours. You should keep it, and give it to your own kids someday.”\n“It’s as much yours as it is mine,” she counters. “Mom would have loved Suki, she would have been happy to see you give it to her.”\n“Katara,” he says, taking her by both hands. “I know how much it means to you to offer it, and I really do appreciate it, but I’m not gonna take that away from you. I don’t mind waiting until I’ve carved the right pendant for Suki. Keep it.”\n“Well,” she replies, “if you change your mind… the offer’s open.”\n“It means a lot to me,” he says, and gives her a slightly watery smile.\n“What are you two over here talking about so seriously?” Suki asks loudly, shouldering her own bag and walking down the gangplank to meet them. Sokka jumps, and Katara makes a face.\n“Well, it’s gonna be a serious few days,” she says, extracting herself from Sokka – who, she can’t help but notice, takes the opportunity to discreetly brush a tear away – and walks over to hug Suki. “Not much room for fun, at least unless we have another party this year.”\n“You say that,” Suki counters, laughing, “but I have good money on you dousing the Council again. Sokka thinks you won’t do the same thing two years in a row, but I think you won’t change a good thing when you find it.”\nShe laughs out loud, shaking her head. “I’m hoping I don’t have to!”\n“And I’m hoping a thousand gold coins fall on the ground in front of me,” Suki says, with a smile and an eyeroll. “But you know how all these stuffy ministers get. I hear you’ve had your hands full in the Fire Nation with them, yourself.”\n“It’s getting better,” she replies, and Suki makes a face.\n“You’re a better woman than I,” she shudders. “I thought I was going to punch some of them in the face more than once.”\n“Believe me, I wanted to,” she laughs. “But they’re not as bad as I thought when I first got there.”\n“Maybe they just like you,” Suki says, raising an eyebrow, and glances back at the boat where her warriors are filing onto the docks. One of them, which she recognizes as Ty Lee, standing next to a non-uniform-wearing Mai, waves with over-exaggerated motions, and Katara waves back. “I gotta say, you did me a huge favor by going over there full-time. I never felt like I was actually accomplishing much except beating up terrible assassins.”\n“I actually haven’t seen any assassins yet,” she muses, wondering at that a bit, but Suki gives her an aside glance.\n“Yeah, well, you’re famous, not just as a waterbender powerful enough to stop Azula, but also as the world’s best healer. I doubt they’ll stay gone for good,” she adds, more seriously, “but they’re probably walking more carefully with you there.”\n“Do you think the council is clear?” she asks, and Suki sighs.\n“As far as I can tell,” she replies. “It took a while for me to snoop on all of them enough to figure out where their loyalties are, but I think, between me and Zuko, and Mai for a while, that we got rid of all Ozai’s fanatics. I mean, they’re not all great,” she adds, shrugging, “but I went out of my way to find people Ozai had dismissed. Some of those were because, you know, they weren’t  incredibly competent, but mostly it was just because they’d been loyal to Iroh. I figured that was a safe place to start. What do you think?”\n“I think you made the right call. At worst, I think some of them are, yeah, incompetent, or power-hungry, but at least they’re probably not plotting his death.”\n“Of course,” Sokka cuts in, joining them, “there’s still a lot of people in the nobility who aren’t on that council.”\n“One thing at a time, Sokka,” Katara says fervently, and Suki smiles, patting her on the shoulder.\n“You’ve got this,” she tells her, with firm confidence that she isn’t sure she deserves, and walks back to her warriors.\n“If you say so,” she mutters to herself, and Sokka throws an arm around her shoulder.\n“If you won’t trust Suki,” he says softly, “then trust  me. You’re doing great. You’ve got this.”\nKatara smiles.\n.\nThis time, it's Katara who finds Aang at the balcony two hours after dinner, looking over the city.\n“Hi,” she says quietly, a bit hesitantly. He's grown a lot in the past year, she thinks; he's taller than she is now, and even has the start of a beard going. He looks at her with a slightly pained smile.\n“Thanks for coming to see me,” he says, and she shrugs like it's nothing, it's easy. “I wanted to…” he makes a frustrated noise and runs his hand over his head, and then goes on in a bit of a rush, “I wanted to apologize for how I acted when we were together.”\nShe tilts her head. “Aang, it wasn't your fault. You didn't do anything wrong.”\n“Don't say that if it's not true, Katara,” he counters, sighing. “You always tell me that things aren't my fault, even when they are. I didn't realize I was holding you back, but I was. I'm really sorry about that. I hope you can forgive me.”\n“Of course I forgive you,” she says, walking forward to join him, leaning against the railing. “You never meant anything but the best, and I should have said something a lot sooner,” she says softly, and he nods, glancing away.\n“Yeah,” he replies, sounding kind of hurt. “You really should have. It really hurt when you said that you thought we never should have gotten together in the first place.”\n“I was wrong about that,” she says, closing her eyes. “Just because it didn't work out doesn't mean that it was a mistake. No love is wasted,” she adds, thinking about Ty Lee's words and how true they were.\n“You really did love me, then?” he asks, and she glances at him.\n“Of course,” she replies simply, and he takes a deep breath.\n“You said that,” he starts, sounding hesitant, and something in her sinks right through the stone floor, “in the future, maybe we could  work  together.” He turns to her, eyes wide and imploring and reaching right into her heart and tugging with all their might. “Maybe that future is now,” he says softly, and it reverberates in her head like a glacier cracking into a thousand icebergs. “We know where things went wrong in the past,  I  know where  I went wrong. We won't make the same mistakes, we're older and I think we've both learned a lot about ourselves and our place in the world. I still love you, Katara,” he goes on, looking down and looking so nervous, so vulnerable, that it rips her insides to shreds all over again. “I've missed you so much, I just… I just want to be with you, always.”\nMaybe he can see her hesitation, maybe he can sense it, maybe he always knew he was just getting his hopes up to have them dashed, because he sighs and reaches out, taking her by the hand. She lets him, but doesn't return the pressure.\n“At least consider it, Katara, please?” he implores, voice cracking a little on the  please and cracking her heart.\nShe is so, so tired of hurting him.\nHe squeezes her hand once more and lets go, starts to walk away, to give her the space she once asked him for, all those years ago on Ember Island, the space he hadn't given her then – and a tiny part of her thinks that maybe it's a sign, he really has learned, he really does mean it.\nBut she promised Zuko she would be by his side for the duration, and she's not foolish enough to believe that such a promise can coexist with a relationship with Aang.\n(Part of her thinks she's using that as an excuse for the more primal reason: she simply doesn't want to.)\n“I don't need to consider it,” she tells him, clenching her jaw and hearing him stall at the door. “I already know.”\nShe doesn't look back, but she can see him turning in her mind's eye, see the hope she's about to crush in his eyes, and it  hurts .\n“I am happy where I am now,” she says deliberately. “I don't want to go back. I'm sorry, Aang,” she chokes. “I will always love you, but I don't think it's the same way you love me.”\n“You won't even consider it?” he asks, voice breaking with tears she can't wipe away. “It wouldn't be going back, it would be  starting over  . We could start over, on the same page this time. You and me, side by side, making the whole world better. You're so good at this, Katara,” he chokes, and she bites her lip, eyes burning and vision blurring as she wills herself not to cry. “You're such an amazing diplomat, I can't believe I never saw it before. If we were together, we could be… we could be  incredible, for the whole world. Why won't you even  consider it?”\nThe half-lie about her promise to Zuko is on her lips, but she makes the mistake of turning to him and seeing the devastation in his eyes, and she knows that there is no sense in false hope. It was her being weak then and giving him false hope that led them to this in the first place.\n“Because I don't want it, Aang,” she breathes, closing her eyes and feeling the hot tears run down her face. “I don't want to be your girlfriend. I don't want to spend my life in your shadow.”\n“I wouldn't overshadow you!” he cries. “That's what I'm trying to  tell you! I know I did before, I know it was wrong!”\n“You would still overshadow me, Aang,” she chokes. “You wouldn't mean to, but you  would.”\n“Why do you think that?”\n“Because I want to say  yes!”  she cries, finally looking at him and wishing there was still an ocean between them. “But not because it's what I want, just because I'm sick of hurting you. I  do  love you, you're the person who taught me to have hope and be free and enjoy life, you'll always mean the world to me. But I don't  want  to be in a relationship with you,” she articulates, swallowing hard and taking a deep, ragged breath. “I  can't be in a relationship with you, I'm always ceding ground to you.”\n“You won't even  try?” \nShe closes her eyes tight and shakes her head, thinking of her own words: better an unpleasant truth than a sweet lie. “I would have hated you, Aang,” she whispers. “If I had stayed with you, I would have hated you in the end, because I barely had the strength to leave then, even though I was miserable. I can't be honest with you, I know you say that I should be able to but that doesn't  matter  because I  can't. I can't even  look at you right now.”\nThere's a pause, before he says, in a cold and watery voice, “I never had you pegged for a coward before, Katara,” and leaves, shutting the door behind him with a resounding  bang that makes her flinch.\n There it goes, she thinks darkly.  There goes the one person who believed you were perfect.\n And good riddance, another part of her hisses.\nShe thinks, a bit traitorously, that she should have lied.\n.\nToph didn't give them much information about the upper floors of the palace, because they wouldn't be open to the council members, but this is why Katara goes to them: probably no one will be there, and she will be able to be alone.\nShe's halfway to hysteria as it is, and the  last thing she needs is for someone to see her like this.\nShe finds a drawing room in a secluded corner of the north wing, and barrels through it like an avalanche, so quickly and with so much force that she doesn't even realize someone is already there. She's standing at a little table, taking in deep lungfuls of air and choking on her own sobs, when the other person speaks.\n“I'll just go, then,” Mai says, and Katara jumps, looking up at her with an expression that she's sure looks completely insane, before turning back away, horrified that  Mai of all people is the one who saw her.\nIn retrospect, it makes sense: Katara came here to be alone; it's not unreasonable to think that Mai, trying to be fine in the face of Zuko's presence here, might have had the same goal.\nShe hears the footsteps retreating, but out of the corner of her eye, she sees Mai hesitate by the door.\n“What… happened?” she asks tentatively, and Katara runs a hand over her face.\n“It's… Aang,” she chokes, trying to breathe but finding it unreasonably difficult.\nMai pauses. “He… didn't want to get back together?” she offers, sounding uncertain, and Katara shakes her head.\n“He  did,” she replies, sniffling. “He wanted to try again, to…  start over,  ” she spits the words out with more force than is necessary. “I don't  want  to start over. I  like my life just the way it is.”\nThere's another pause. “So… you're crying because…?”\nShe looks up, gaping at Mai, who is standing beside the door with one eyebrow raised, the only concession someone like Mai could give to confusion.\n“I'm so  sick  of hurting him!” she cries, choking on her tears. “It's like that's all I've done, he saved the world and all he ever wanted was me and I just can't  stop hurting him!”\nIn the ringing silence, she runs a shaking hand through her hair, and Mai makes a strange noise.\n“Let me get this straight,” she drawls. “You're upset because he wanted to get back with you, which you  don't want, and you turned him down, which hurt him. And now you're crying alone in a tacky drawing room because you chose not to be someone else's prize for saving the world?”\nShe swallows hard and glares, wondering why she expected Mai to understand.\n“I do  care  about him, you know?” she snarls, taking in a deep, shaky breath. “Caring, it's something most  humans do.”\nMai doesn't take the bait, and Katara is a bit irritated by this, since she's now itching for a fight. “For the love of Agni and all his dumb children,” Mai snaps, rolling her eyes, “he's  sixteen. When I was sixteen, the guy I thought was the love of my life dumped me in a  letter. He'll get over it.”\nKatara hesitates, feeling a bit stupid in the face of Mai's deadpan deconstruction of the thing that's currently turned her life upside-down.\n“And,  furthermore,” Mai goes on, folding her hands into her sleeves, “he was a real jerk for dumping all this on you right now.”\n“What do you mean?” she asks, and Mai raises that eyebrow again.\n“It's the Council of Four, in case you hadn't noticed,” she says sardonically. “It's the single most important three days of the year, at least for people like you and Zuko and Aang, and the  last  thing anyone in the  world needs is for anyone to be distracted by their dumb personal crap right now.”\nShe wants to say something about how it's  not  dumb personal crap, it's love and the whole future, but at the same time… it  is kind of dumb in comparison to the things they're supposed to be here to discuss.\n“Look, Katara,” Mai continues, stepping forward, “you don't have time for this. The Fire Nation – the  world   –  needs you to be  on  tomorrow morning, no matter how late you stay up tonight crying over some stupid teenager with delusions of true love. That's what you signed up for when you shacked up with Zuko,” she adds, and heat rises to her face at the implication, but Mai doesn't give her the opportunity to deny it. “If you're not willing to do it, then you need to get the hell out of here  now, because you're just gonna make everything worse.”\nAlmost against her will, the antagonistic, “Is that what  you did?” slips out of her mouth before she can stop it. She's just stinging from Mai's tone, and still from Aang's when he left her on the balcony.\n(It seems so long ago, when she and Zuko were laughing about Boscoe.)\n“Yes,” Mai replies simply, shrugging. “That  is  what I did. I didn't want to be Fire Lady, I hated everything about it, and loving Zuko wasn't enough to justify staying there and doing all that crap. But you're all about the political stuff,” she goes on, rolling her eyes again and waving a hand irritably. “You've got all these  plans  about improving the world. I really thought  better of you than this.”\nIt hits her like a slap in the face.\nShe wonders distantly just what Zuko decided to write in his letter to her.\nShe swallows hard, looks away, and takes a deep, even breath. “You're right,” she says, rubbing at her face angrily. “I need to be focusing on the Council, not on Aang. I… I just didn't expect this.”\n“Which, again, makes  him  the asshole here, not  you.”\n“Aang isn't an asshole,” she says, kind of dejected, and Mai shakes her head. “He just loves me more than I love him.”\n“Love makes people do stupid things,” Mai tells her. “It even makes nice people act like assholes.”\nIt's an entirely different perspective than anything she would have even dreamed of, and although she definitely still feels like a horrible person for shutting him down, it  was kind of short-sighted on his part, to dump all this on her right when she most needed to be focused. Maybe he just couldn't wait; but then, even if she had just fallen right back into his arms, she would have had to jump straight back into politics and ignore their romantic reunion, so what was he really hoping for here?\nStill, the image of his face – crushed and shattered, with his image of her on that pedestal he'd always kept her on crumbling to the ground – haunts her.\n“He'll get over it,” Mai repeats, opening the door. “But even if he doesn't, his feelings aren't your problem.”\nShe looks up.\n“Thank you,” she says suddenly, and Mai raises an eyebrow. “For listening.”\n“Whatever,” she sighs. “Just don't let this get in your way tomorrow.”\n“It won't.”\nMai looks at her, sizing her up for a moment, before giving her the tiniest of smiles. “Good.”\n.\n\n He'll get over it, but even if he doesn't, his feelings aren't your problem. \n\n\n Don't worry about everyone else. They'll come around or they won't, but you shouldn't wait on them to get on with your life. \n\n\n I never had you pegged for a coward before. \n\n\n You did him a favor in the long run. \n\nIt all echoes in her head and drowns out the exhaustion that lurks under her skin once the tears have washed themselves out. Everyone has an opinion, everyone has advice, everyone has something to tell her about how she should respond.\nIt's all meant well, sure, but it's driving her slowly insane.\nShe gives up on sleep altogether – it's closer to dawn than midnight, anyway, she'd be doing more harm than good trying to rest at this point – and goes to the kitchens Toph pointed out, taking care not to wake any of the servants as she makes herself a pot of tea, but she's brought up short by the fact that the kettle is already hot.\nSomeone else is awake.\nBut the kitchen is deathly silent, and anyway, she doesn't really want to talk to anyone right now, so she decides not to question it, not to go looking. Just drink her tea and maybe eat a mango or something and begrudgingly decide to welcome the dawn.\nShe gingerly sets the pot and cup onto a tray and takes it out into the nearest courtyard, but her luck is both with her and not with her – the early-rising tea-drinker is sitting out there, obvious in silhouette.\nReally, she should have expected it as soon as she noticed the kettle.\nHe turns, hearing her before she can sneak back out, and his face splits into a jovial grin.\n“Lady Katara!” Uncle Iroh beams, beckoning her over to him, and his good cheer is infectious enough that she's torn between wanting to join him and wanting to leave him so she can sulk in peace. “You're up early this morning.”\n“So are you,” she replies, giving up and walking over to sit next to him. “I only brought one cup,” she starts, but he waves her off, and anyway he has his own cup and pot of tea next to him.\n“At my age, sleep neither comes easily nor lasts long,” he says, and pours himself a cup from his own pot. It smells much better than the tea she's made for herself – a simple collection of as many black tea leaves as she could cram into the basket – but of course, it would. “But you should be abed! You've got quite the day ahead of you.”\n“I… couldn't sleep,” she answers, hoping that the low light is sufficient to hide her puffy eyes. She hasn't really thought about what she's going to do about that in the actual morning, when the sun is up and everyone can see her. “Nerves, I guess,” she goes on, laughing and hoping it sounds more convincing to him than it does to her.\n“Nonsense,” he says, waving a hand. “You've nothing to be worried over. According to my nephew, you're the best thing that's happened to the Fire Nation in centuries! Not in so many words, of course,” he adds, eyes twinkling in the dim torch- and starlight, and she can't help but smile. “But he speaks very highly of you and your prowess as a politician.”\nThere's some sort of undercurrent to his words, something in the vein of  I know you're lying, and she wonders if he can tell she's been crying.\nShe looks down and pours herself a cup of tea, drinking it probably faster than she should. And that's when she knows that he's waiting for her to open up to him and explain why she’s upset, because Uncle Iroh would  absolutely have commented on her shooting dull black tea like it's hard liquor otherwise.\n“Aang wanted to get back together,” she finds herself telling him, even though it wasn't quite what she opened her mouth to say. The tea has left a bitter sensation in her mouth, burning and drying at the same time.\n“Ah,” he replies, drawing out the syllable and taking a sip of his tea. “That is the peril of young love: it does not understand letting go.”\n“I really wish he would get the picture,” she sighs, shivering in spite of the warm weather. “I'm so sick of hurting him.”\n“Some hurts are unavoidable,” he says. “He will learn peace in time, as will you.”\n“That's what Mai said,” she mutters, a bit mulish in her determination to be upset still. “That he'd get over it. But I thought that two years ago, and here we are. He thinks we're destined for each other.”\n“Destiny is a funny thing,” he replies thoughtfully. “What may seem so clear to you at dawn may turn out to be an illusion by midmorning.” He looks at her sideways. “Take my nephew, for example. For years, he was convinced that his destiny was to capture the Avatar for the Fire Nation and regain his place beneath his father's iron fist. It took a great deal of upheaval for him to realize the truth. Those sorts of revelations never come painlessly, my lady,” he adds, somewhat apologetically. “But in the end, we are always better for having had them.”\n“Everyone's full of advice,” she grumbles. “But it seems like they don't really know what I'm feeling.”\n“Ask Zuko,” Uncle Iroh says seriously, and she glances at him a bit critically. “I am serious, Lady Katara, Zuko  does know this pain. He and Lady Mai spent years trying to force their relationship to work, ultimately hurting the both of them far more than they would have had they walked away when it first failed.”\n“Mai didn't seem to understand very well,” she counters, but then she thinks about it a bit more, and wonders if maybe she did, and maybe that was  why she was harsh.\n“Mai herself is difficult to understand,” he says, as though reading her thoughts. “I doubt she would be very open to discussing such a painful time with a near-stranger. But you and Zuko are close, from what I hear,” he goes on, and she tells herself that she's imagining the slight innuendo in his tone. “I think he would be open to discussing this with you.”\nBut talking about romantic entanglements with Zuko seems… dangerous.\n“I feel like this is the wrong time for all this,” she mutters, Mai's words about Aang being an asshole for bringing this up now ringing in her ears. “We shouldn't be focused on… personal stuff, there's so much more going on.”\n“Alas,” Uncle Iroh sighs, “the heart is a selfish beast. It does not choose an appropriate time to make its demands.”\n“The heart may not, but  Aang should have,” she cries, louder and with more feeling than she intends.\n“Avatar Aang is a young man ruled by his heart,” he counters softly, without any apparent reproach. “It makes him an effective peacemaker and well-loved by the people, but it is not without its downsides.”\nShe doesn't want to let go of the anger that Mai gifted her with – when she's angry with him, she doesn't have the space in her head to remember how crushed he looked. But all of her anger crumbles in the face of Iroh's good-natured kindness.\n“I thought he wanted to make amends,” she says quietly, running her hand over her face. “When he wrote to me asking to speak in private, I thought it was because he was ready to be friends again.  I was ready to be friends again.”\nUncle Iroh pats her sympathetically on the knee. “It will pass, Lady Katara, and you will find yourself stronger for it.” Maybe he can see that she’s in no mood to be comforted, because he gives her a soft smile. “You should rest. It will be a long day.”\n“Breakfast is only a couple of hours away,” she sighs. “I’d just be doing more harm than good.”\n“Ah,” he counters, raising a finger, “but the meetings do not start until after mid-morning. You could still achieve four or five hours of sleep.”\nShe thinks about it for a moment, but she isn’t sure; although she doesn’t feel much better, she does feel less scattered and stretched-thin, so maybe she will be able to fall asleep. But she doesn’t want to waste hours trying, only to get a half-hour of sleep and wake up feeling worse.\n“Take it from an old man,” he says softly, “you  will feel better after sleeping.”\nShe takes a deep breath and runs a hand through her hair. “I guess you’re right,” she mumbles. “I don’t want to be falling asleep in the middle of a meeting, after all.”\n“Exactly,” Iroh says, and then waves her off as she starts to gather up her teapot. “Allow me to take care of this, my lady. I’ll send someone to wake you in time for the meetings. Get some rest, now.”\nShe smiles at him a little wanly, and goes back to her room; she doesn’t change clothes or even turn down the blankets again, instead kicking her shoes off and falling onto the bed, where she holds the spare pillow to her chest like a lover, and falls into a deep and dreamless sleep.\n.\nThe first thing she becomes aware of is the knocking on the door.\nThe second thing is that her mouth feels like it’s filled with dirty cotton, and the third is that she is fully-clothed on top of the covers of her bed. It takes her a moment to remember why: the tea, Uncle Iroh’s advice… Aang.\n“Come in,” she says muzzily, sitting up and blinking in the bright morning sunlight. The door opens tentatively and – of course, she thinks, she should have expected this from the meddling old coot – Zuko leans in a little bit, keeping his eyes carefully averted.\n“Katara?” he asks, and she staggers to her feet, taking a bit longer still to return to consciousness. “Uncle asked me to wake you, he said you were up really late.”\n“Yeah,” she replies, shaking her head and still blinking rapidly. “You can come in.”\n“I saved you breakfast,” he says, stepping through the door and holding out a tray with a pot of tea and a cup, as well as a plate of fruit and rice balls. “Are… you okay?”\nShe looks up a bit dumbly at his tone, and then down at herself, wincing: her dress is rumpled from sleeping in it, her hair feels as though a bird or seven set up a nest near the back of her neck, and her eyes are still swollen from all of last night’s crying. She definitely doesn’t look like she’s having the best day ever.\nBut on the other hand… the tea smells sweet and strong, undoubtedly one of Iroh’s recipes, and there’s what looks like a whole mango sliced on the plate, and the rice balls are dusted with lotus seeds and stuffed with red beans, and the morning air is breezy and the sky is bright blue and wide open through the window… And damn him, Iroh was right, she  does feel better.\n“Yeah, I’ll be fine,” she replies, taking the tray from him with an awkward cringe, “once I clean up a little, sorry.”\n“Uncle… said you seemed upset,” he starts hesitantly, looking concerned. “Is something wrong?”\nShe looks up at him, hesitates a half-second, and then smiles. “I’ll tell you about it later,” she replies quietly. “We’ve got more important things to deal with today.”\nZuko doesn’t seem convinced, but he lets it go. “At least we’re not dealing with the colonies until tomorrow.”\n“And thank  all of the spirits that have ever been for that,” she says fervently, popping a rice ball into her mouth and setting the tray down on the bedside table. Zuko laughs a bit, and rubs the back of his neck, watching her with what looks like trepidation as she pours a cup. She raises a questioning eyebrow at him, and he coughs, wincing.\n“I made the tea,” he admits. “It’s Uncle’s recipe, so it’s probably fine, but… it may not be great.”\nShe lets out a small laugh. “It can’t be worse than the tea I made myself this morning,” she says, and takes a sip. It is good, some kind of earthy, vaguely floral black tea. “What kind is it?”\n“Jasmine and ginseng,” he replies, still rubbing the back of his neck nervously. “Uncle swears by it.”\n“It’s good,” she tells him, and he smiles. “I’ll see you in the meeting hall,” she goes on, gesturing at herself to indicate the need to dress appropriately, and he starts.\n“Right, yeah. Don’t, um… Don’t get lost.”\nKatara laughs a bit at that. “I won’t,” she says. “Thank you for the breakfast, and the tea.”\n“You’re welcome,” he replies, still looking awkward, and backs out of the room, wincing a little.\nAlone in the room with her thoughts, she stands still for a long moment, closing her eyes and centering herself.\n Don’t let this get in your way, Mai warned her.\n“I won’t,” she says again, to herself, and nods firmly.\n.\n“I’m sorry,” Toph murmurs to her as they take their seats at the table. Katara glances at her, surprised. “I tried to talk him out of it.”\n“Oh,” is all she can think to say, and then: “How is he?”\nToph shrugs, a bitter twist to her lips. “Upset. Said some things I doubt he really means, but…”\n“He doesn't want anything to do with me,” she finishes for her, and Toph winces.\n“Give him time,” she says. “He  will get over it.”\nShe hesitates, glancing down the table to where Aang is sitting, and although he isn't scowling, he isn't smiling, either. Mai’s words rattle around in her head.\nBut instead of everything she'd like to say, she settles on, “I hope so.”\n.\nUltimately, it's better than last year, when Aang was so frustrated with her that he couldn't focus; instead, he treats her like a stranger, which hurts Katara more but is better for everyone else.\nThe first day of the Council runs relatively smooth, since the main focus is on trade between the nations, and mostly a simple task to hash out. The first tentative year of open-borders trading has been pretty successful, although not as wildly as she and Sokka sort of hoped it would be, and the Earth Kingdom – this being their first real meeting with the Water Tribe since the last council – is eager to discuss the expansion of their textile trade, whereas Katara and Minister Lian have pretty much handled the Fire Nation’s trade already.\n“It seems a bit unfair, really,” Lady Jiayi of Omashu points out, glancing sideways at Minister Lian, “that the Fire Nation has its own live-in Ambassador from the Water Tribe, whereas the Earth Kingdom has to make do with these yearly meetings.”\nKatara hesitates, unsure how to tackle this (particularly with her sleep deprivation starting to catch up with her), but Lian takes the lead on it.\n“The difference lies in centrality,” Minister Lian responds smoothly. “The Lady Katara is only one person, and can only be in one place at one time, whereas the Earth Kingdom would require her presence in several major cities at once, or, alternatively, a series of ambassadors to work with each city individually, thus depriving the Water Tribe itself of many of its own key politicians.”\nShe wants to point out that, also, Zuko really needs her help a lot more than the Earth Kingdom does, but that would make the Fire Nation appear weak; she has to go at it from another angle.\n“Moreover,” Katara adds slowly, “the Fire Nation is in the middle of a transition from a military industry to a production industry, which is a delicate process. Fire Lord Zuko –” she nods at him “– and I both thought that the inclusion of a member of another culture may help aid in smoothing that transition, as well as showing the world as a whole that the Water Tribe does not bear ill will toward the Fire Nation for the war.”\n“I note that he never requested the aid of any Earth Kingdom diplomats,” Lady Jiayi starts, but Zuko, apparently thinking fast, steps in.\n“As a matter of fact,” he says, glancing down the table, “I have actually recently requested the aid of Lady Bei Fong, although I’ve yet to receive a response.”\nKatara is surprised; if he actually did this, and isn’t lying through his teeth to prevent any more fighting with the Earth Kingdom dignitaries than tomorrow is sure to bring, he never mentioned it to her.\n“Yeah, about that,” Toph drawls, waving a hand in front of her face. “I couldn’t exactly read the letter myself, and my mother took issue with the idea of me leaving the Earth Kingdom. It turned into a fight. In other news, I’m going back to the Fire Nation with you.”\nZuko pinches the bridge of his nose; Aang, she notes, does almost the exact same thing.\n“We don’t wish to cause any tension with Gaoling…” Katara starts, hoping to convey through her tone how bad an idea this may turn out to be, but Toph shrugs.\n“I mean, they already know I’m doing it,” she replies, and Katara glances sideways at Zuko, inadvertently catching his eye, and his surprise.\nHe totally  was bluffing. But now the ball is in Toph’s court, and while Toph can certainly be counted on to have their backs – she didn’t rat him out, for one thing – she isn’t exactly the reigning champion of tact or discretion.\n“Well, in that case,” Zuko says brightly, all traces of surprise and concern gone by the time he looks up to the rest of the table, “I would be happy to have you accompany us to the Caldera. If the present ministers have no objection…\"\nXu glances between Katara and Toph, then takes a deep breath. “I will admit that I objected to the addition of the Lady Katara, and found myself proven wrong, so, in the interest of not making the same mistake of mistrusting the Fire Lord’s judgment, I have no objection this time.”\nKatara bites her tongue and wants to melt through the floor.\nBut Toph gives Xu a beatific smile. “I promise,” she says fervently, “you won’t regret it.”\n.\n“So,” she murmurs to Zuko at the dinner table after the day’s meetings have concluded, “that went… well. It’ll be nice to have Toph around.”\nZuko coughs, and winces. “It was a few months ago, but I  did  actually ask her to come and stay for a while,” he says, as though defending himself, “to help deal with the assassins. She said she couldn’t leave at the time, but she’d come visit whenever she got the chance. So. It wasn’t entirely a lie.”\n“Hey, I’m not judging,” she replies airily, and then cringes. “I do worry about her on the Council with Xu, though.”\n“I was trying very hard to forget all about that, thanks.”\nKatara laughs a little, and pats him on the shoulder. “It’ll be all right. Toph can be… well, Toph, but she knows how to act like an adult, too. And hey, it does send a strong message about unity, like I mentioned.”\n“Nice save there, by the way,” he comments, and she makes a face.\n“Thank you, it was made up entirely on the spot.”\n“Well,” he says, smirking at her sideways, “wasn’t that the same way it was with your trade deal with them last year?”\n“I have no idea what you’re talking about,” she deadpans, struggling not to laugh, and he nods once, slowly.\n“Sure you don’t.”\n“Nope, not a clue.”\nThey fall into a companionable silence as the servants bring out the first course: a light, clear soup with Earth Kingdom vegetables, paired with a yellow wine she’s never heard of before but finds herself falling in love with all the same.\n“You like this stuff?” Zuko asks, delicately placing his glass back down with what looks like intense effort not to wince.\n“I do,” she replies, with some defiance.\n“It’s… very dry,” he says magnanimously, and she shrugs.\n“I like dry wines,” she counters, glancing around to see if anyone is watching before pouring the contents of his glass into her own and taking another drink. The reason is twofold: for one, she likes the taste, but also whenever her mind stops, the image of Aang’s crushed expression rises up in her eyes.\nZuko watches her for a moment, and she gives him a (slightly-exaggerated, she can admit) look of offense.\n“What? You didn’t want it.”\nHe meets her eyes, and she knows he’s thinking of how disheveled she looked this morning, and how she wouldn’t tell him what was wrong, and how his uncle had told him she was upset but now she’s pretending that nothing is wrong…\n“Later,” she murmurs, and takes another drink, looking up and away to prevent the tears from coming back.\n“If you say so,” he says, but still sounds concerned.\nThe next course comes out with a wine that Zuko likes too much to let her take, or else he’s just pretending to enjoy it so as not to inadvertently enable her bad decision; it’s a little sweeter than the previous, but a deeper orange-red color that she is – in her tipsy state – fascinated with.\nBy the time the main dish comes out, Katara is drunk enough to talk to him about it. After all, Uncle Iroh had said he would understand, right?\n“Aang wanted to get back together,” she tells him in a low voice, and he looks at her with an unreadable expression.\n“But you promised me that you’d stay in the Fire Nation,” he infers, sounding somewhat dejected, but if there’s a good reason for it, it goes over her head.\n“That’s not it,” she sighs. “I just didn’t want to. I probably should have told him that instead, though,” she goes on, picking at her plate a bit miserably. “I decided to be honest with him, and now he hates me.”\n“I doubt very much that Aang could ever hate you,” Zuko says, and she shakes her head.\n“You didn’t see the look on his face,” she mutters darkly. “Like I… wasn’t who he thought I was.”\n“Well…” he starts, rubbing the back of his neck and taking a large gulp of wine himself, “Aang has never exactly had the most… accurate perception of you. Not that you’re bad, or anything, I didn’t mean…”\nHe looks away, cringing hard, but she just sighs again.\n“No, he thought I was perfect,” she says. “And… it was just too much pressure. I couldn’t go back to… pretending. Even though he seemed to think it wouldn’t be that way anymore,” she goes on, agitated, waving a hand and snatching her glass back up. “But the fact that he was so upset when I was honest with him tells me it would have been. Right?”\n“Maybe?” he replies uncertainly, wincing again. “He may have thought he had it figured out, but that kind of thing is pretty hard to get over. Or he may have just been upset because you turned him down. It’s hard to say.”\nShe glances at him. “You’re supposed to say yes,” she mumbles, the alcohol chasing the words out, and Zuko raises an eyebrow. “You’re supposed to make me feel better.”\n“How’s this?” he offers, face softening as he leans in a little bit. “You made the right decision. You break up with someone, then you remember how much you cared about them, and so you get back together only to remember why you broke up in the first place, but now it hurts more because you both had all this  hope riding on it. You thought you could beat the odds and get it right this time, but it never seems to work like that. It’s better to just let it go when it’s over, because you’ve already lost what you had, and you can’t get it back.”\n“But I  really hurt him,” she whispers, and her vision is blurry, so she tries to clear it with another drink; it doesn’t work.\n“It would have hurt him more if you’d gotten back together, only to break up again later.  Trust me on that, Katara,” he adds, with feeling. “Aang will be okay. He’s stronger than he looks.”\n“I don’t think he’ll ever forgive me for this,” she says, thinking about exactly what she said to him, that she would have hated him in the end – and why, why,  why did that seem like a good idea? – but Zuko simply nudges her with his shoulder.\n“You said the same thing about me,” he counters, and when she looks up at him, he gives her a hesitant smile. “And Aang is  way more forgiving than I am.”\nShe returns the smile, albeit weakly. “That’s true,” she replies, although she doesn’t quite believe it. After all, Aang’s feelings run a lot deeper than Zuko’s did when she hurt him.\n“You remember how you told me that everything would work out?” he goes on, apparently hearing her hesitation in her tone or seeing it on her face. “Because you were on my side, I wasn’t alone in the Fire Nation anymore?”\n“Yes…” she mumbles.\n“Well, it goes both ways,” he says. “You’re on my side, I’m on yours. We’re in this together.”\nShe sighs. “This is a lot… less important than all of that.”\n“Not really,” he replies. “I mean, to them, maybe,” he adds, gesturing around the table, “but to you, it’s just as important, and it affects you just as much. It doesn’t matter any less just because it’s personal.”\n“It’s the wrong time for all this, anyway,” she says, a bit hastily, and takes a gulp of wine to drown out an unidentifiable emotion rising in her chest. Zuko shrugs.\n“Maybe, but when would be a good one?”\n“Never?” she suggests, laughing with some desperation, and Zuko looks at her sympathetically but doesn’t comment on it. She bites her lip. “I was trying to be honest with him,” she admits shamefully, “but I think I went too far in the opposite direction. I can’t seem to get it  right with Aang. I never have.”\n“Well…” he muses, rubbing the back of his neck again, and she wonders what he’s thinking. Probably what Uncle Iroh would say right now, but she doesn’t want Uncle Iroh’s advice, she wants Zuko’s understanding. But what he says instead of any adage or teaching is, “You got it right with yourself, that’s the most important part.” He takes a deep breath and looks at her with a wry twist to his lips. “Trust me, once you get yourself where you’re supposed to be, everything else falls into place a lot easier. Aang will see that, sooner or later, he’ll realize that you’re better off this way, you both are. That process, though, it’s… not something you can have a part in. He’s got to figure it out on his own, and you’ve got to walk away and leave him to it.”\n“It’s not easy,” she says softly.\n“No,” he sighs, glancing down the table to where Mai is sitting with the Kyoshi Warriors, “it’s not. And I don’t know anything that makes it easier. It’s hard to walk away from someone you love but just can’t be with, when it  should  work on paper, but it just  doesn’t and you can barely even put your finger on why. It’s better in the long run, but… it really hurts in the now.”\nA silence falls as the servants make a pass around the table, picking up plates, and Katara hands hers over even though she’s barely touched it, making a half-hearted comment about filling up on the soup. When they’ve gone, she looks back to Zuko, struggling to find the words in a way she’s unused to being.\n“Thank you,” she says, feeling lame that that’s all she can come up with, but he smiles at her instead.\n“It’s nothing,” he replies, shrugging like this emotional interlude really wasn’t difficult for him, even though Katara knows that’s not true, that Zuko struggles with this sort of thing: he’s a great person and has many great qualities, but he’s not much of a speaker. “I mean, we’re friends, right?” he adds, although a bit delicately.\n“Right,” she agrees, and wonders why it doesn’t  feel right.\n.\nAt breakfast the next morning, they all (including Aang, although he sits by Toph and doesn’t look at her) all congregate together, and drink a couple of pots of strong black tea, none of them appearing to have slept very well, Katara included.\n“So, how are we tackling this?” Sokka asks, leaning in. “The colonies are pretty much everyone’s business at this point, after all.”\n“The best we’ve been able to come up with,” Katara replies, gesturing to herself and Zuko, “is a sort of public works program in the Fire Nation, to hopefully entice the colonists to return home. I don’t know if the Earth Kingdom will accept that as a total solution, though.\"\n“It’s not one,” Aang interjects, but he doesn’t sound hostile. “It will  help, but it’s not the whole solution. We need to come at this from another angle.”\n“What have you been thinking?” she asks, and he looks up at the group, but not at her.\n“I was thinking about establishing a new nation,” he says. “Under its own governance, not subject to any nation’s rule.”\n“But will the Earth Kingdom give up their land for that?” Zuko asks, and Aang takes a deep breath, glancing at Toph, who gives him an encouraging gesture.\n“They don’t have to,” Aang replies. “The Air Nomads are gone, and the temples are just gathering dust. I… well, Toph and I were thinking about making a trade with them, for the land around the Northern and Eastern Air Temples in exchange for at least some of the land that the colonists are occupying, and we could build a major city there. She said… well, I’ll let her tell you.”\n“I ran it by my dad, actually,” Toph admits, wincing. “I figure, there’s no one more  quintessentially Earth Kingdom than Lao Bei Fong, so he’d be able to tell me if they’d totally hate everything about it, but he thought about it for a long time and said it might actually be a feasible idea. So I think we’ve got a chance of selling it to them.”\n“That would actually work as an answer for our problem, too,” Katara says, glancing at Zuko. “If we’re going to build a new city-state, we’ll need buildings, homes and shops and, well, a city. That would be an effective public works project, and if the Earth Kingdom was willing to help pay for it… would they be willing to help pay for it?”\n“Unlikely,” Suki offers. “As far as they’re concerned, they’d be completely in the right to eradicate the colonies altogether. I doubt they’d help pay for it.”\n“Leave that up to me, then,” Katara says, eyes narrowing. “I’ll see if I can convince them. But I think it’s a really good idea, Aang.”\n“Thanks,” he replies, but still doesn’t even look at her.\n.\n“You expect us to simply give up our land, so that the invaders can have it?” Lady Jiayi asks, eyes ablaze, and Aang takes a deep breath.\n“In exchange for half of the territory traditionally belonging to the Air Nomads,” he replies, showing an impressive degree of patience, even for him. “It’s been terraced in many places, and there are many orchards and rare fruits. Overall, the land you receive in this deal is more than you cede.”\n“All so that you can build a new, happy little nation of colonial  monsters?” she counters, blinking rapidly in false interest.\n“All so that we can take this problem  out of your hands,” Zuko cuts in. “The colonists are, ultimately,  my problem. The Avatar has gone to great lengths to come up with a solution that benefits the greatest number of people with the lowest amount of sacrifice –”\n“Because  your people eradicated the Air Nomads!”\n“With all due respect, Lady Jiayi,” Toph snaps loudly, “ get over it. Your pride will be the death of thousands and thousands of people if you don’t –”\n“Our  pride is all that those firebending dogs didn’t take from us!”\n“That’s wrong,” Katara says quietly, but it lands on the table like a thousand-ton boulder, and Jiayi has the self-awareness to look a bit ashamed. “The Southern Water Tribe could say that our pride was all that the Fire Nation didn’t take from us, but  not the Earth Kingdom. Your cities are intact, your people thrive, whereas I am the last native waterbender of the Southern Water Tribe,” she adds deliberately, voice wavering slightly with rage as her hands clench into fists under the table. “But none of the people responsible for that are here today. None of them still hold power, none of them are on Fire Lord Zuko’s council of ministers. It’s in the past. We must deal with the future.”\nA ringing silence falls.\nLady Qiaolian of Ba Sing Se coughs lightly. “King Kuei,” she says, looking to the King seated beside her, although he looks like he really wishes she wouldn’t, “this is up to you. Will you agree to the Avatar’s deal?”\nKuei looks from Qiaolian to Aang to Katara to Zuko, and then back. “If you think it is a good idea, then I have no objection. The people of those colonies, obviously they will have the opportunity to emigrate or return to the Fire Nation, right?”\n“Of course,” Aang replies. “No one is going to be forced to live somewhere they don’t want to be.”\n“How will you pay for it?” Jiayi interjects, apparently willing to take this fight to the grave. “If you believe that Omashu will put forth the funding –”\n“Actually, I believe King Bumi would be quite supportive of the idea,” Aang counters sharply, and Katara can see the  yes but he’s a very old man forming on Jiayi’s lips, but she must see the look on Aang’s face, and decides not to press it.\n“Not that I disagree with the Avatar,” Lady Qiaolian says, subtly inching her chair away from Jiayi’s, “but I do have to wonder at how he plans to fund this operation. Do you really feel it morally justifiable, to have us pay for your colonies, Fire Lord Zuko?”\n“I would have us both pay,” he replies, although he glances at Katara when he says it. “Many of those people consider themselves practically of the Earth Kingdom –” he starts, but it’s the wrong thing to say.\n“They are  invaders, Fire Lord,” Jiayi snaps. “They are  not  our people. They are  yours, and  your  problem alone.”\n“As the Lady Bei Fong said earlier,” Katara cuts in, “get over it. The Fire Nation has its own concerns to deal with, it cannot fully fund this project on its own. Everyone stands the opportunity to benefit from this deal.”\n“You expect us to just let this go?” Jiayi snarls, and Katara gives her a look of pure, icy steel.\n“Why not? I did,” she says sharply. “Aang did. Sokka did. Toph did. Or do you mean to tell me,” she goes on, with false fascination, “that a group of  teenagers is capable of greater cultural empathy and forgiveness than grown adults with decades of experience who purport to speak for thousands of people?”\n“That’s… different,” Jiayi replies, although she seems to know she’s reaching.\n“Please, enlighten me as to how,” Katara counters.\nOut of the corner of her eye, she sees Ministers Lian and Xu exchange looks of what might just be amusement.\nJiayi clearly knows that she has no ground to stand on in this argument, at least not with Katara, but she’s also too stubborn to let it drop without a fight.\n“The Fire Lord is a personal friend of yours,” she lands on, and Katara raises an eyebrow.\n“He wasn’t when we first met,” she says simply. “But I’m not here on behalf of the Fire Lord. He can speak for himself. I’m here on behalf of the people who otherwise have no voice. You can ask Minister Xu about my feelings on this topic,” she adds, and he pinches the bridge of his nose in irritation, but she also notices that it’s hiding a small smile. “This is a solution which will benefit us all, as well as create a large number of jobs as the city requires building and maintenance. Jobs which are desperately needed. The Fire Lord has said he will offer half of the required funds, all we ask is that you meet us there.”\n“And how much would that  be?” Qiaolian asks, striking for an artery and, unfortunately, drawing blood: none of them actually did that research. Katara glances at Minister Lian – a businesswoman with long years of experience in managing construction, albeit mostly on weapons of war in the past and now on technology – for help.\nLian rises magnificently to the occasion.\n“In terms of manpower,” Lian starts, writing a few figures down on the paper in front of her, “to build the bare bones of a city – a residential area, a market, and an administrative district – we would require a few hundred civilians, or half that if earthbenders were involved. In terms of gold…” she pauses, doing a few figures on the paper. “Perhaps 62,000 pounds, all told. That covers the cost of material as well as wages for workers. Beyond that, the city  should be able to fund itself.”\n“So you want us to supply you with 31,000 pounds of gold?” Qiaolian asks, raising an eyebrow, and Lian looks from her to Zuko.\n“If the Fire Lord is willing to supply his half, I see no reason why the Earth Kingdom could not do the same.”\nZuko, Katara notes, looks a bit alarmed at that figure.\n“I would hesitate to set the number at that,” Xu interjects, glancing down at Lian’s notes. “62,000 may cover the cost if nothing goes wrong, but we must consider that things may not go according to plan. I would set the beginning cost at 70,000, myself.”\n“Yes, well, you’re a pessimist,” Lian mutters, and Xu raises an eyebrow, but doesn’t comment.\n“35,000, then,” Qiaolian says, crossing her arms. “That’s 35,000 pounds of gold  out  of the pockets of  our  people and  into the pockets of a new nation, with no guarantee of payoff.\"\n“But look at what you stand to gain,” Sokka counters. “A new nation means new trade, new cultural developments, new technology. For everybody. We all stand to benefit.”\n“I do not believe you know just  how  much 35,000 pounds of gold  truly is,” Qiaolian deadpans, but Kuei steps in.\n“I will fund it,” he says quietly, and everyone looks at him. “I have at least most of that in my own personal coffers,” he goes on. “If Omashu and Gaoling and Kyoshi are willing to supply, perhaps, a thousand pounds apiece, I can cover the rest without inconveniencing the people in any way.”\nAnother hard silence falls, and Qiaolian bites her lip. “Ba Sing Se – independent of the King – should also be included,” she says, apparently somewhat ashamed by her king’s generosity. “In fact, I would say that we could spare two thousand.”\n“A thousand pounds is a lot easier to come up with,” Suki muses. “But I’ll have to talk to the Elders at Kyoshi before I can say for sure.”\n“As to that,” Xu cuts in, steepling his fingers and peering at Zuko. “How do we intend to come up with 35,000 pounds of gold for this?”\nZuko gives him a blank look. “My own coffers,” he replies, like it’s obvious. “We have a lot of gold, passed down through generations of royalty, and all it’s doing is sitting around in the vaults. I’m  sure we can make 35,000 pounds out of that.”\nKatara notes the  passed down through generations of royalty, and she hopes that it’s the truth – the idea of using gold stolen from other cultures to fund this sits wrong with her, and she knows it sits wrong with everyone else, too.\n“We will perform an inventory upon our return to the Fire Nation,” Lian adds helpfully.\nJiayi looks very much like she wants to disagree, but now that she’s been thoroughly outnumbered – and now that Kuei has proven his own intent to side with this – she simply purses her lips.\n“I will discuss this with King Bumi,” she says finally, begrudgingly, and Katara knows they’ve won.\n“Of course,” Aang replies, smiling, and for all the world, it looks completely genuine. “I hope to discuss this with you further, when we begin moving forward with construction.”\n“That’s settled, then,” Kuei says, with a tremulous smile. “We will take the land surrounding the Northern and Eastern Air Temples, and contribute half of the funds to building a new nation for the colonies to inhabit.”\n“Everyone wins,” Sokka says, sighing in relief, but Katara thinks – everyone except the Air Nomads.\nBut they lost a hundred years ago, and if it bothers Aang, he won’t show it to these people; or, for that matter, her, not anymore.\nThis is what Zuko was talking about last night; although she wants more than anything to reach out and ask him if he’s  really okay with this, she can’t. He said that he discussed it with Toph, and at any rate, Katara has done nothing but hurt him for two years running. He won’t want to talk to her anyway.\n You’ve got to walk away and leave him to it.\nOh well, she thinks. Oh  well. \nHer own words rise up in her mind:  it’s in the past. We must deal with the future.\nShe smiles at Zuko, and he smiles back.\nact four: this is as good a place to fall as any (we will build our altar here)\n.\nPerhaps not to be outdone by the Fire Nation, Kuei hosts his own party after the final meetings have adjourned, with musicians and an overabundance of food and that dry wine that Katara liked so much and decides to imbibe perhaps entirely too much of.\nAang attends the party, but avoids her in a way that's so painfully obvious that it cuts her – at this point less because he's avoiding her, than because he doesn't even try to hide it.\n“It'll be fine,” Suki says with a shrug, and Katara sighs.\n“Yeah,” she replies. “It'll  be fine.”\n It's just not fine now, she wants to say, but lets it go. Now is a time for celebration, for talking about all the good things they have accomplished, for planning ahead and getting a jump-start on the future. What's done is done. All she can do is work with what hasn't happened yet.\nSuki looks at her with a sympathetic quirk to her lips. “I know how much this sucks,” she says quietly, “but… I want you to know, I'm  really impressed with you.”\n“What do you mean?” she asks, and Suki smiles.\n“Until Sokka told me this morning, I had no  idea  Aang tried to get back together with you,” she explains. “I would never have guessed that you were hurting, or struggling. You had a job to do and you did it, and you were even better than you had to be. It's really impressive. I'm really,  really proud of you.”\nShe's taken aback by Suki's frank praise, and she knows it's clear on her face. “Um… thank you. I just… People are depending on me, I couldn't let them down.”\n“Yeah, but it's harder than it looks, I know,” Suki replies, draining her glass. “I had to be the leader of the Kyoshi Warriors after me and Sokka broke up the first time, it was rough. I didn't do it as well as you did. You nailed it, Katara. You absolutely  nailed this council, and I think it's amazing that you did it while you were reeling.”\nKatara hides her emotion behind a deep drink of wine. Hearing it actually said to her in so many words is… overwhelming, so she tries to laugh it off a bit. \"Well… I know you had good money on me dousing everyone again, so I doubt you're one-hundred-percent happy with me right now.”\nSuki pauses, perhaps sensing that Katara doesn't really know how to respond, and then laughs. “That is true. I lost five gold pieces to Sokka because of that, so, you know. Thanks,  Katara.”\nShe snickers into her glass. “I'll pay you back.”\n“You'd better.”\nBoth of their glasses are empty now, so she offers to get the both of them another drink, but Suki shrugs it off, insisting on joining her. It feels… strange, she thinks, in some small way, to know that Suki – the proud warrior, the impossibly unshakeable woman, the person who survived being Azula's favorite prisoner at the Boiling Rock when she was sixteen – is proud of her. It's sort of how she feels when she sees her with Sokka: a bit bewildered at how much Suki softens when she's around someone she loves. It's easy to forget how compassionate the other woman is, when she covers her face with the heavy warpaint and fights with such a deep well of conviction that it's impossible to imagine her ever giving up.\nBut Suki is a person, a woman only a little older than Katara, who has been through awful things and come up out of each and every one of them swinging, who has a heart that's big enough for the whole world.\nSuki wouldn't be upset with Sokka's awful pendant; she'd wear it with pride, because she'd know it was made with love, by someone who loved her so much that he tried to do something he knew he wasn't any good at just to show her how much he cared. Katara makes a mental note to point this out to him.\nThey're at the drinks table, waiting on a new bottle to be opened, when the conversation drifts in from the nearby balcony, and they both freeze.\n“– all due respect,\" Mai is saying, \"I don't plan to return anytime soon.”\n“Well,” Zuko replies, “you're welcome to, whenever you want. You're not exiled, I mean.”\n“I appreciate that,” Mai says, and Katara can practically hear her raising an eyebrow. “I know more than a few people were telling you to do it.”\n\"They're not the Fire Lord,  I  am.\"\n“No one does it alone, Zuko, not even you.” There's a pause, and she thinks they really ought to go now that their glasses have been refilled, but she meets Suki's eyes, and neither of them move a muscle. “Don't shut her out like you did me.”\n“It's not – it's not like that,” Zuko stammers, and even to Katara – who knows for a  fact that it's not like that – it doesn't sound convincing. “I mean –”\n“Stop,” Mai snaps. “You’re a terrible liar. Everyone can see it, and they won't  shut up  about it. I'm not upset, but I  do really wish they had something more interesting to talk about.”\nZuko groans. “Mai…” he starts, and then sighs. “I'm sorry.”\n“For what?” she counters. “I told you, I'm not upset. I don't want to go back to the Fire Nation, and what we had…” she sighs, “it was good while it lasted, but it's long gone now.”\n“That's true,” he replies, but it sounds a bit forced, or maybe just awkward.\n“I…” Mai starts, and then lets out a long sigh. “For everything we had that was good, I thank you,” she says in a low voice, almost as though the words are rehearsed. “And for all we had that was bad, I apologize. It's over now, and it's long past time for us to move on.”\n“You're right,” Zuko says slowly. “And I apologize, too. I… wasn't a very good boyfriend to you.”\n“You were exactly as good a boyfriend to me as I was a girlfriend to you,” Mai replies evenly, and then takes a deep breath. “You meet people, Zuko,” she says in a strange voice, as though speaking something aloud she's never really thought about before. “You rise as high as they expect you to. I didn't ask much of you. I didn't believe you'd give it to me if I did, and that was wrong. I was wrong not to have faith in you. But she has faith, just like your uncle does. They believe in you, and it'll make you a better person and a better ruler in the long run, because you'll never let them down again.”\nSuki reaches out and touches her shoulder, and she jumps, glancing aside to catch the other girl's gaze.  We should go, she mouths, and Katara nods.\nThe whole walk away, Suki is watching her out of the corner of her eye, perhaps waiting for her to confirm or deny anything going on between her and Zuko, but Katara wouldn't even know how to answer that question if she was asked. Is there something between them? He was non-committal, but was that because he wasn't interested, or because he was talking to his ex-girlfriend?\nIs this what she wants? To be Fire Lady, the way Mai clearly thinks she will be, and rule by Zuko's side?\nIt has a certain appeal, she can't deny it – to be the Fire Lady, the second-most powerful person in the nation and, officially, one of the most powerful people in the world. It's a position traditionally associated with social action; Fire Ladies of the past have usually invested in social welfare, in hospitals and schools and safety nets for the poor – it's actually generally been considered the Fire Lady's job to care for such things, while the Fire Lord concerns himself with foreign policy and defense and the economy.\nIn a successful reign, the Fire Lady is the one who cares about the small-scale, while the Fire Lord is the one who cares about the large. When they work together to bring everyone up, they have, historically, found great success. The position is associated with great influence over social and domestic affairs.\nBut it's not the political part that really occupies her mind.\nShe's thinking distantly of all that she could do as Fire Lady, but she's thinking much more personally and clearly about all the times she's sat with Zuko on the roof and talked about things – sometimes important things and sometimes about pictures in the stars. She's thinking about having tea with him and assuring him that they would work together to make things right. She's thinking about how they laughed about Boscoe and how he understood her conflicted feelings about Aang.\nShe's thinking about a  partnership, being seen as an equal rather than a perfect goddess who could do no wrong.\nIt's even more appealing than the power to affect great change.\nBut there's something else lurking under the surface of her mind, something that's slowly wrapping its vines around her heart and  squeezing, and she can't put a word to the emotion; it's not jealousy, not really, but it's something like it, something that keeps going over the conversation she's overheard and seething inward. It's upsetting, both at herself and at Mai's calm words, and she can't identify it clearly.\n“You okay?” Suki asks, and Katara jumps, then gives her a brittle smile.\n“I'm fine,” she lies. “I was a little surprised to hear… do you think me and Zuko are an item?”\n“No,” Suki replies in a measured voice, watching her carefully. “The rumor mill has been going, that's true, but I always figured you would have told me, or at least Sokka.”\n“I would have,” she says, almost automatically.\n“Is something wrong?” Suki asks her again, concerned. “Don't worry about what people are saying.”\n“I'm just –” she starts, but doesn't know how to articulate her emotions, so she changes tack to something else, which is only a lie in the sense that it's only just now crossing her mind for the first time: “I don't want Aang to think I turned him down to pursue Zuko. That would hurt him a lot.”\nSuki hesitates, then reaches out to turn Katara so that they're facing each other. “Is that why you've stayed single since you left him?” she asks seriously. “Because you don't have to wait until he's over you to move on. You don't owe it to him to stay single until it won't hurt him to see you with someone else, even if that someone is a friend of his.”\nKatara takes a deep gulp of wine to hide, again, the startling feeling of transparency, and settles on jokingly-aloof as a solid way to respond. “For your information,” she says archly, “I've stayed single because I've either been in the Water Tribe with my brother or in the Fire Nation with a bunch of people three times my age. I'm too busy for romance, anyway.”\nThere's a beat, where Suki seems to decide not to press her for more details. “Fair enough,” she sighs, holding up a hand in apology. “I just don't want you putting your life on hold because you’re afraid to hurt Aang. You deserve better than that.”\nShe takes a deep breath and gives Suki a brittle smile. “I'm not, I promise,” she says, and wonders distantly if it's a lie.\n.\nHer mood doesn't improve as the party progresses, and she finds herself unconsciously avoiding the people who would make her feel better. Uncle Iroh is organizing the musicians into playing some sort of upbeat dance piece, while Zuko stands beside him with his head in his hand and Toph appears to be trying to convince one of them to teach her to play the drum – it's like a little pocket of people who would make her happy, but she doesn't want to be cheered up right now.\nThe only person she'd really like to talk to right now is Sokka, but for all that she's scanned the room, she hasn't seen him in a while, and wonders if maybe he left early. Come to think of it, Suki seems to have melted out of the party as well, which probably explains it.\nShe's just about to call it a night so she can go sleep off her bad mood, when Mai's voice surprises her for the second time tonight.\n“You did good,” she says, and Katara jumps.\n“Pardon?” she replies, a bit dumbly.\n“I said, you did good,” Mai repeats, evidently thinking that Katara didn't hear her, rather than Katara doesn't know why she's being complimented. “At the Council. If I didn't know you were a wreck at the start of this, I would never have suspected it.”\nShe blinks. It's a kind thing to say, and it's meant as a compliment, and not even a backhanded or half-hearted kind of one, either, but her mind sticks on  you were a wreck, and she bites her tongue.\n“Thank you,” she says instead, with a thin smile, but Mai doesn't seem to be paying very close attention. In fact, she looks agitated, as though she's steeling herself up to say something she doesn't want to say. “Sleeping on it helped.”\n“I'm sure,” Mai replies, with a fleeting, insincere smile. “Look,” she starts, taking a deep breath and glancing away, “take care of Zuko, all right?”\nKatara flinches in spite of herself. “It's not… I know people are gossipping, but –”\n“I don't really care about your denial,” Mai cuts her off, and Katara finishes her wine with alacrity. “I just care that he's okay. He'll work himself to death if you don't watch out. He has to have  someone there to give him a break sometimes.”\n“Yeah,” Katara stammers, distantly wishing that she hadn't drank so much. “I mean, he'll have both me and Toph there, we'll make sure he doesn't get overwhelmed.”\nMai gives her a deadpan look that nevertheless laughs at her incredulously, and she tilts her chin up against both it and that dark, clawing emotion that threatens to choke the air out of her lungs. It's so much stronger now; she'd almost forgotten about it until Mai decided to be nice for once. She still can't identify it, what exactly it is about Mai right now that is so upsetting to her, why she wants to grab her by the shoulders and scream – something, something at her, but she doesn't know what.\nMai lets it go first.\n“Good,” she says evenly. “He should be happy.”\nAnd then it hits her, what it is she wants to scream – why do you get to be at peace when I can't be?\nIt's  envy, the emotion sucking at her like a whirlpool; envy, raw and running deep, she  envies Mai for being at peace with her past relationship, while Katara's won't stop haunting her. Mai can have a normal conversation with her ex-boyfriend – someone she loved, and sacrificed for, and lived with, and believed she would spend the rest of her life with – without either of them leaving in tears or lashing out, and, in fact, both walk away from it feeling better and lighter and calmer.\nEveryone says that peace will come with time, but she doesn't want it  in time, she wants it  now.\nShe wants it three days ago.\n“Yes,” Katara says, swallowing the emotion hard, and if Mai can tell that she's a tangle of dark emotion right now, she doesn't give any indication of it, merely giving her a small smile with more sincerity than before, and that smile – meant in kindness – fills her with the need to leave the room, now. “He really should. If you'll excuse me,” she adds, and gives the other woman a slight bow, which Mai returns, before she flees the party entirely.\n.\nIt’s Ty Lee who finds her in Kuei’s private garden, and the all-too-casual way she slinks in makes Katara think that someone – probably Suki – told her that she needed a friend right now.\n“Hi,” Katara says tightly, “sorry I haven’t had much time to talk.”\n“It’s fine,” Ty Lee replies, waving it off with a smile, “everybody’s been super-busy.”\nThere’s a stretched-thin pause, and Katara sighs. “Did someone tell you to come looking for me?”\n“No,” she says, shaking her head. “I saw you leave the party, you seemed kind of upset. Mai told me about Aang. Did he try to talk to you again at the party?”\nShe bites her lip, considers lying – but Ty Lee would probably know, and, worse,  not say anything about it. They would just both  know that she lied to a friend who left a party to make sure she was okay, and Katara isn’t sure she can be that kind of person.\n“No,” she answers, sighing. “He’s pretending not to know me at all. I… overheard Zuko and Mai talking, and…”\n“You know they’re not getting back together, right?” Ty Lee says fervently, and Katara shakes her head.\n“It’s not – I mean, yes, I know, and I wouldn’t be upset even if they were,” she replies woodenly, knowing deep down that that part is absolutely a lie, but at least it’s the sort of lie she won’t be judged on. Ty Lee keeps her expression very carefully still. “It just made me think… I wish I had their peace. I wish Aang and I had that peace. I… I don’t usually envy other people, it kind of hit me like a ton of bricks.”\nSilence falls, and Ty Lee bites her lip.\n“It didn’t happen overnight,” she says softly, after a moment. “Trust me, however nasty things got between you and Aang, it was nastier between Zuko and Mai. She said and did a  lot of things she regrets, and I know she feels like she’ll be apologizing for how she acted to him for a long time, no matter what he may say about forgiveness. It’s taken them both a long time to get here.”\n“I know,” Katara replies, running a hand through her hair. “And I know, it just takes time. I know it’s not fair to expect Aang to – to wave his hand and be over it. I know.”\n“Yeah,” Ty Lee says, nodding sympathetically. “Just because you know a feeling is wrong doesn’t mean you stop feeling it.” Katara buries her head in her hands, half in frustration and half in a sort of raw, seething resentment that’s directed inward, at herself for feeling such stupid things, and Ty Lee rubs her back. “Look at it this way, you’re hurting because you care, and your caring is your biggest strength. If you were the kind of person who was okay with hurting Aang, you wouldn’t be the kind of person who inspires worldwide change.”\nKatara’s hands tighten in her hair.\n“Don’t wish for not caring, is what I mean,” Ty Lee adds, striking at something Katara hadn’t even thought of in so many words.\n“It seems like it would be easier,” she mutters, and Ty Lee tilts her head.\n“For who?”\nKatara opens her mouth to say me, obviously, but then closes it again: if she didn’t care, didn’t hurt for others, if she could just magically – right now – make her compassion leave her, then she would be leaving the Fire Nation and the world to hang. Chunhua would never get her school, because no one would argue for it; the poor people in the city would never have a voice in the council to speak for their concerns, because no one would care to listen; the Water Tribe’s place in the world would diminish, because no one would be fighting to include them.\nAnd maybe it would all work out eventually… but, after all, what didn’t,  eventually, work out for some people?\nAccording to the writings of the Fire Sage Lao Shen, nations weren’t built on the force of ideas or might or power, they were built on the force of  personality. They were built, not because they were necessary or pragmatic or strategic, but because one person stood up and said  I will build this, join me, and people joined them. That was what made the difference between a decent ruler and a great ruler: the ability to say  follow me  and be followed.\nAnd that ability  required  you to care. No leader could be great without compassion, no great things could happen without someone who  cared pushing them forward.\nKatara looks up at Ty Lee, a different sort of unidentifiable emotion rising in her chest: a strange, heavy calm, like the sort that falls after the storm has swept the land clean.\n“You’re right,” she says slowly. “It wouldn’t be easier for anybody.”\nTy Lee gives her a wry smile. “You’re gonna be okay, and so will Aang. And you’re gonna do it without blowing each other to bits and regretting everything you’ve done. And then you're gonna go make the world a better place for everyone. If you won’t trust yourself, trust me.”\nKatara returns the smile, albeit with some water, and gives her a tight hug.\n“Thank you,” she says quietly, and Ty Lee squeezes her back.\n“You're not alone, you know,” she replies. “We're all rooting for you.”\nShe closes her eyes and breathes deep. “I know,\" she says. \"I know.”\n.\nThey're all ridiculously hung-over on the trip back to the Fire Nation in the morning. Katara is lucky – being a waterbender who grew up half in kayaks, she's never in her life gotten seasick, even when the hangover is threatening to evacuate her brain from her skull – and Zuko spent three years on a ship when he was younger, so he has ironclad sea legs, but Toph is not so lucky.\n“Why didn't you stop me from drinking all that wine?” Toph moans, leaning heavily on the railing, and Katara sighs.\n“I didn't see you for half the night,” she replies, gingerly holding the younger girl's hair back as she starts dry-heaving again. “And I was too busy drinking myself into oblivion, too, anyway.”\n“I'm never touching wine again.”\n“At least not for a while,” she agrees.\n“Look on the bright side,” Zuko says from Toph's other side, “you don't have to see your parents for a long time.”\nToph simply groans, and Zuko pats her on the back sympathetically. Katara leans her forehead on the cold railing and takes a deep, steadying breath.\nIn spite of the hangover, she feels better today than she has since walking out onto that balcony to speak to Aang.\nIt will be okay, she thinks, even if it isn’t right now. Just keep moving forward. The only way out is through.\n.\nThe first day back in the Fire Nation, they don't have any meetings – figuring that they would all need a day to recover from traveling, everyone had agreed not to schedule anything – but Katara has a few stops she intends to make.\nChunhua smiles at her when she walks into the teashop, and a few people wave. She's become a regular now, and has gotten into a few spirited conversations with Chunhua, her parents and young sister, and other regulars at times, about what the country needs, what the workers and the builders and the artisans need – although Katara has kept quiet about who she actually is, doubting that people would be quite so open to discussion if they knew that they were speaking with someone who had some measure of real power to act.\nKatara wants to be seen as one of them, a person first and a council member second – she wants to know what they say to each other, what they think and want, not what they think is pragmatic to ask for, or what they think is realistic to hope for.\nShe wants to know what they  want, not what they'll settle for.\n“How'd the vacation go?” Chunhua asks, with a twinkle of amusement in her eyes at being in on something secret, bringing out a pot of tea for her. “This one's on me, I think you'll like it.”\n“I think it went pretty well,” Katara replies, smiling. “I feel like we got a lot done, it was… refreshing.”\n“That's great!\" Chunhua says. “It's always good to get away for a while. How was the city?”\nKatara laughs. “I didn't see much of it, unfortunately. But I'm glad to be back here.”\n“I'm glad to see you back here, too.”\n“Yes,” she says evenly, feeling energized. “I have work to do.”\n.\nThe first thing the Council decides is to make a separate, offshoot committee for working on the new city, a committee that will work with Aang and the Earth Kingdom as they move forward, and Katara thinks long and hard about it before deciding, with some internal defiance, to add her name to it. She was sort of expected to, unofficially, but her delicate history with Aang made her hesitate.\nBut the world is more important.\nToph is sort of taking the lead on it, and Katara suspects that she had more than a little to do with its inception in the first place – at any rate, as their resident Earth Kingdom expert, she’s going to be doing a lot of heavy lifting in making arrangements with the stubborn people who never much wanted this to begin with and are likely to fight her every step of the way. She can’t wait to see one of them try to argue Toph down, though; Toph has pure steel in her backbone, and she believes in this, probably more than any of the rest of them except maybe Aang, if Katara is being honest.\nKatara will help her, if she needs it, but Katara has work to do in the Fire Nation, first.\nAs such, the next thing she proposes is a hospital.\n“We have “Healer’s Row” off the marketplace, but it's diffuse and fragmented,” she explains, “and their skills can only go so far. I know there are a few barber-surgeons, if we brought a couple of them together with the herbalists and bonesetters and such, we could have a central place where people could go when they need medical help. Plus, building a hospital would provide jobs, at least for a while.”\n“We’ll need to consider the cost,” Xu, of course, says, and Katara nods.\n“Absolutely,” she replies. “I just wanted to put the proposal out there, so we can begin moving forward on it.”\n“Minister Lian,” Zuko says, nodding at the older woman, who returns the nod and shoots Katara a smile, “can help you draw up a full proposal, and we can discuss it at length in next week’s meeting.”\n“I would be glad to, Fire Lord Zuko,” Lian says, with a small bow.\n“And the secondary committee will meet in three days to begin moving forward on the issue of the colonies and Avatar Aang’s city,” Zuko says to the assembly. “I want a tentative plan of action on my desk that morning, along with a preliminary breakdown of the cost and what we will need to come up with to break ground. Toph, you’re in contact with Aang and King Kuei, right?”\n“Right,” she replies, fingers tapping on the desk nervously. “Aang is staying in Ba Sing Se for the next few weeks, at least, to work out details on that end. I’ll be the go-between for you. Kuei said he would come up with their own estimate for how much we’ll need and send it to me once they’ve got something worked out, so we can compare ours to theirs.”\n“Good, that’s a good start. Does anyone have anything else to ask, or propose?”\nA general murmur of agreement and settling-up passes over the table, and Zuko nods.\n“All right, let’s get to work,” he says firmly, and they all stand to mosey out of the room.\nToph sighs heavily and runs a hand over her face, and Katara glances at her.\n“The work never stops,” she mutters, as an explanation. “One day of rest and then back to the grind.”\nKatara smiles. “That’s how it goes, I guess,” she says wryly. “The world never stops moving, so neither can we.”\n“I know,” Toph sighs. “When did we get to be adults, with all this dumb responsibility?”\n“When we stepped up,” she replies, patting Toph on the shoulder. “Hey, you could have stayed in Gaoling and had servants feed you grapes all day, you know.”\nToph shudders. “Yeah, trust me, I’ll take these meetings and boring reports any day of the week. They kept trying to wash my feet.”\n“It gets easier,” she says, and Toph shrugs.\n“I guess. I can count on you to help me write out the first draft of my plan?” she asks, and Katara nods.\n“Of course. When do you want to discuss it?”\n“Tomorrow?”\n“Sure,” she replies. “I’ve got some meetings in the morning, but we’ll have tea in the afternoon and hash it out.”\n“Sounds great,” Toph says, and laughs a little, almost at herself. Katara tilts her head.\n“What’s so funny?”\nToph pauses, then makes a face. “I sound like my mom, making political meetings. I was always against authority, now I am one.”\nKatara hesitates, then sits back down. “That’s a good thing, Toph,” she says seriously. “You can stand up for things you believe in, rein in people who try to control you, and help people. You have the power to change things for the better.  We  have the power to change things for the better.”\n“I just never really cared about all this stuff, you know?” she replies. “I just wanted to cheer Aang up, and now I’m in charge of making a city out of nothing. I never asked for this. I just wanted to be left alone, myself.”\n“Apathy has never accomplished anything,” Katara says, in a measured tone, and Toph tilts her ear toward her. “You stepped in when you ran away from your parents to join us and teach Aang earthbending – have you ever regretted it?”\n“No,” she answers immediately.\n“Of course not. Nobody who ever stands up and acts for something they believe in  ever  ends up regretting it,” she says, with feeling. “Even if it’s hard, and boring, and you have to deal with tedious little details like how many bricks you’ll need to build a city and how much public restrooms will cost and who to bill for them – one day, you’ll look back on all you’ve done and all the  incredibly boring meetings you barely managed to stay awake in, and you’ll know that you made something amazing happen.”\nToph pauses, apparently mulling it over, and then smiles, punching her lightly in the arm. “I’m gonna make you sit through all these boring meetings with me, you know.”\n“Yeah, I know, and we’ll complain about them later,” she laughs. “But we’ll get things done.”\n“Yeah,” Toph replies, standing up. “We’re gonna get it done.”\n.\nKatara finds Zuko in the private garden late the following afternoon, sitting on a little stone bench, watching the turtleducks with a sort of blank expression.\nShe sits next to him, and he glances up at her, blinking rapidly in apparent surprise.\n“You were very engrossed with the turtleducks,” she says, and immediately feels a bit stupid for it. He laughs, rubbing the back of his neck.\n“I think one of them has a nest somewhere,” he replies, pointing at a turtleduck that, to her, looks no different than any of the others, except maybe a little bigger. “He keeps going back and forth to those reeds on the other side of the pond, I think he's bringing food for his mate.”\n\"You study turtleduck mating behavior?\" she asks, deliberately deadpan, and he gives her a look of mock-affront.\n“I  like turtleducks,” he says. “If you're gonna be like that, I won't let you see any of the babies.”\nShe has to admit, that actually sounds unpleasant – they're pretty damn cute as adults, she can only imagine how adorable turtleduck chicks must be. “Okay, okay,” she sighs, holding her hands up in supplication and snickering. “I apologize for pointing out how  huge  a  dork you are.”\nZuko tries to hold onto the affronted look, but he can't hide his amusement. “Hey, now,” he says anyway, but she just shoves him lightly in the shoulder.\n“How many do they usually have at a time?” she asks, and he shrugs.\n“I've only seen a couple of broods hatch before,” he answers, wincing at her and rubbing the back of his neck again, which must be a nervous habit. “Maybe nine or ten?”\n“Are they as  stupidly adorable as I think they will be?”\n“Even cuter.”\n“When will we see them?”\n“Whenever they're big enough to learn how to swim, their mother will bring them out into the pond,” he replies. “All the turtleducks know me,\" he admits, a bit sheepishly, and she has to admit to herself that that is – although incredibly dorky – really, really sweet, “so she probably won't get upset if I pick up one of her ducklings.” He must feel her amusement, because he looks up at her, and then away. “What?”\n“Nothing,” she replies airily. “I think it's sweet. You're friends with the turtleducks.”\n“I know it's not the most… um, manly thing,” he winces, coughing a bit and cringing, but Katara simply shrugs.\n“I can't think of anything better in a guy,” she says, leaning in a little, “than a nurturing personality. Women don't want a guy who will bail on them,” she goes on cheerfully. “They want someone who stays and cares for small things, like turtleducks, and children.”\nHe laughs a little, and it sounds kind of nervous.\n“I read your proposal for the hospital,” he says, apparently out of the blue, and she blinks.\n“Oh,” she replies dumbly, but catches herself and shifts gears back into politics-mode. “Do you think there's anything I've missed?”\n“Xu is gonna say you're lowballing the cost,” he says, shrugging, “but I think we could handle it if it goes over what you've planned for.”\n“Xu is a pessimist,” she scoffs. “I worked that out with Lian, she thinks it's reasonable.”\nHe holds up his hands. “I didn't say I disagreed,” he says lightly. “Like I said, I think we can handle it if it goes over, so we can cover Xu's definite argument. My only concern…” he trails off, wincing, and then looks at her. “Do you think a healing waterbender from the North will agree to come to the Fire Nation on a permanent basis?”\nShe hesitates. “Honestly?” she replies, sighing. “Not really. Not at first, at least. But…,” she goes on, biting her lip, “I think I can do it, at least to get things started. I could go for a few hours a day, I have that time. And, as we grow, and things improve… well, I think there are some healers in the South who are getting pretty good, and they're young so they probably want to travel… I think we can make it work.”\n“That's a lot of responsibility to take on,” he says, in a deceptively neutral tone, and she tilts her head.\n“What, you think I can't do it?”\n“No!” he cries, surprised. “It's not… I just don't want you to get overwhelmed. You're already doing a lot, I just... don't want you to get overwhelmed,” he repeats, a bit lamely, and she wonders what he was going to say.\n“Like I said, I don't have to be there all day, every day,” she shrugs. “There are herbalists and healers in the Caldera already who can deal with the normal things, I'd just be there to handle things that are beyond their skills.”\n“I… You're doing a lot for us,” he says quietly, “that's all. You don't have to, you know.”\nShe looks away. “I don't do things halfway, Zuko,” she replies deliberately. “Either I'm here completely or I'm not here at all. I'm not going to stand here and not help to the fullest of my ability just because I don't have to.”\n“I know,” he says, rubbing the back of his neck again and glancing down. “I guess I'm trying to say thank you. For everything you've done when you didn't have to do anything.”\nShe looks back at him and tilts her head, before catching his hand and stopping him from that nervous tic. “I came here to help, Zuko,” she says softly. “I'd be betraying you if I didn't do everything in my power.”\nHe meets her eyes for a second, then looks away. “I mean…” he starts, sounding nervous, “I could never talk to anyone like this,” he goes on, in a bit of a rush. “Mai always thought that… we couldn't talk about anything serious when we were alone, I think she thought… she was trying to get my mind off of things and help me relax, but… I don't stop being the Fire Lord when the sun sets. It's my  life, not my job. And… it's been really helpful, to me, that I can talk to you, and you're always willing to listen and respond.”\n“Of course,” she replies, because she's not really sure how else to respond. He seems agitated now.\n“So…” he starts, although it sounds slightly disappointed, “um, thank you.”\n“Well…” she says slowly, and then glances away, to the turtleducks. “Thank  you. I feel like I’m actually making a difference, making the world a better place. I feel like I’m in a better place since you offered me the position, so. Thank you.” She looks at him again and smiles, and he returns it, albeit tentatively.\n“How is Toph doing?”\nKatara laughs a little. “Complaining about the boring work, but I think she likes feeling involved, too, although she’s too proud to admit it.”\nZuko snickers. “That sounds like Toph. I will say this,” he adds, leaning back on the bench and stretching his legs out, “it  is nice to have someone I can trust who can take over a lot of the details on the new city, it’s a weight off my shoulders.”\n“It’s nice to have someone else we know we can trust here,  period,” she says, leaning back and almost – but not quite – against him. “I think the ministers are fine, but it’s nice to have a friend.”\nHe glances at her. “Yeah,” he replies in a strange voice. “It really is.”\n.\nXu, predictably, complains about the cost of the hospital, but agrees that they’ve worked out a reasonable proposal, and pledges to commit some funds to its building, so Katara figures it’s as close to an unqualified win as she’s likely to get, well, ever. The planning for the new city goes less smoothly, because now that they aren’t there in person to argue over it, Kuei (or, more likely, his ministers) is being a little more reluctant with funding and preparing.\n“We agreed on a fifty-fifty  split!” Toph yells, after Katara has read to her his latest, frustrating letter. “It’s not my fault that the cost is higher than expected! He can’t just say he agreed to pay however much money, he agreed to pay  half!”\n“We can talk to Suki,” Katara soothes. “And you can talk to your parents. If Kuei isn’t willing to pay any extra, or if he can’t pay any extra, we can talk to other Earth Kingdom cities. This was always going to be the hard part. We can work this out.”\nToph lets out a scream of frustration and punches a hole in the ground. “Politics are  stupid!” she shouts, and Katara tries not to laugh, because she knows that Toph is truly upset over this stumbling block, since it throws a wrench into her delicate planning. But Toph is the quintessential earthbender – she never gives up, and she knows how to deal with stumbling blocks. Once she calms down, she’ll realize that there are other ways to handle this setback, and that it’ll be okay.\nIt’s just that right now, she is not calm, and Katara is, unfortunately, the punching bag.\nBut she figures that she knows how to deal with an angry Toph, too, and better than pretty much anyone else here, so it’s better her than them. Toph won’t actually hurt her, at any rate. She’ll yell and throw things and make a bunch of holes in the ground, but she won’t do anything that will actually cause lasting damage.\n“Deep breaths, Toph,” Katara says. “These things happen. Two steps forward, one step back. We just have to keep moving forward.”\nToph growls and throws herself to the ground sullenly. “Those grapes and footbaths look really good right now,” she mutters, crossing her arms, but Katara rolls her eyes.\n“I mean, I can get the servants to arrange that.”\nToph shoots her a glare, but Katara is utterly immune to those by now, so she simply raises an eyebrow. “Fine. Fine! Let’s compose a letter to my parents. I think I can pull out of my inheritance to make up the difference,” she adds in a low voice, as though the idea just occurred to her, and Katara inwardly sighs in relief.\n“Exactly,” she replies, pulling out another sheaf of paper. “That’s a great idea for another way to fund this. Do we address it to your mom or your dad?”\n“Mom,” Toph answers shortly. “She always wants to hear from me anyway, we can fill it with a bunch of nonsense and then tack in the request for money at the end.”\n“All right,” Katara says, writing  Dear Mother  at the top of the page. “Let’s get started.”\n.\nShe’s standing on the edge of Healer’s Row, looking at the frame of the building that will be the hospital in a few more weeks, while Toph inspects one of the market stalls, when she hears the shout.\n“Katara!” Toph screams, loud and frightened enough to be heard over the sounds of the city. “Duck!”\nThere’s a split-second where it processes – Toph  never sounds that scared for nothing – and then she drops to the ground and covers her head as something clatters to the ground not far from her, but before she can look up to see what it is, the earth itself is rising up around it, not two seconds before it explodes, and little pieces of shrapnel and dust shudder off of the box Toph must have bent.\nShe’s shaking uncontrollably as Toph runs up to her, breathing heavily, panic clear on her face.\n“Are you okay?” she cries, and Katara nods, numb. The noise it made, even boxed in by the ground, even though Toph contained it – the  noise it made.\nSomeone just tried to kill her, and they tried to take out a whole city block – along with the new hospital that she’s building – to do it.\nShe looks around, but the crowds are gathering to see what the commotion is about, and there’s no telling who threw the bomb, from here.\n“Do you know who did it?” she asks, but Toph shakes her head.\n“I just felt someone throwing something at you,” she replies, and Katara sees that she’s shaking, too, maybe even harder. “I didn’t follow them, I wanted to make sure nobody got hurt.”\n“Why would someone do this?” she asks, but there are a lot of possible answers to that question. Maybe they take issue with the way they’re handling the colonies, maybe they don’t like a Water Tribe woman being involved in their politics, maybe they wanted the healer out of the way so they could take out Zuko. Maybe they just hate her, personally.\nA better, and at the same time worse, question is: how many people feel this way?\nShe scans the crowds for any familiar face, but doesn’t recognize any of them, and in spite of Toph standing next to her with her hand on her shoulder, she suddenly feels very alone.\n.\nZuko is angrier about it than she is. Maybe he’s taking it personally – that they attacked her because of him – she isn’t sure, but it’s been a long time since she’s seen him this angry, yelling at his police force to find out who did this and find out where they’re hiding.\n He’s not taking it well, she thinks distantly. He’s scared, and he’s overreacting, and at the wrong people.\nToph hasn’t left her side, although Katara isn’t sure if that’s because she’s afraid they’ll target her (as another foreigner in the Fire Nation’s top leadership) or if that’s because she wants to be able to protect Katara if they try again. If Toph hadn’t been nearby, near enough to shout, near enough to act…\n Toph saved my life, she thinks in that same distant way. Toph was terrified that she hadn’t gotten there in time.\nToph, who always seems so unshakable, even when she’s complaining about boring meetings or yelling about politics being stupid, Toph is still shaking.\nKatara closes her eyes and centers herself, then stands up.\n“Zuko,” she says sharply, and he looks at her, paler than usual. “They already know what they have to do. You can’t yell at them until it un-happens. Calm down.”\nZuko takes a deep breath and looks away, hands clenching into fists. The policemen look uncertain, like they don’t know if they’ve been dismissed, and Zuko doesn’t look like he’s about to say anything, so she takes charge.\n“You’re dismissed,” she says, as calmly as she can. “We don’t have any leads yet, unfortunately, but I trust you to do the best you can to find the culprit.”\n“Yes, milady,” the leader – a young man by the name of Lu Ten, apparently named in honor of the then-crown-prince – says, bowing sharply and marching out with his men.\n“Zuko,” she repeats, and he flinches.\n“After  everything  you’ve done for them,” he growls in a low voice. “For  us .”\nShe isn’t sure what to say. That change happens like this – like she told Toph, two steps forward and one step back – that no one is universally popular and people lash out when they feel unheard? She doesn’t even know  why they did it, if it was against her specifically or against the color of her skin and the country of her birth. Ozai’s poison runs deep in this country, and she’s managed to – surrounded by people who were cast out by him or who openly supported Iroh – somehow forget just how entrenched his views on Fire Nation superiority really are out there.\nPeople aren’t always grateful of change, especially when that change is perceived as coming from outside – in this case, she’s both a woman wielding no small amount of political power, and also unmistakably foreign, an outsider, identifiable from a distance. Spending time with Chunhua, with the ministers, with people who treat her like an equal, she’s managed to forget the fact that Ozai and Azulon and Sozin spent a full century telling the people of this country – the one she has adopted, intentionally or not – that everyone who isn’t a native member of the Fire Nation is the enemy, is barbaric, is to be eliminated.\nThese waters run deep. It’ll be long after all of them and probably all of their children are dead before it can ever run clear.\nBut that’s no reason not to try.\n“We’ll catch him, Zuko,” Toph pipes in, standing up and cracking her knuckles. “I’ll go out there and help them. I’ll be able to keep them safe, too.”\nHe nods tightly, and Toph starts to leave, hesitates, then comes back and gives Katara a tight hug.\n“Stay safe in here, okay?” she says quietly. “Don’t go  anywhere alone.”\n“I’ll be safe, Toph,” she replies, and Toph nods shortly before leaving, still visibly anxious.\nThere’s a long, taut pause.\n“I’m not going anywhere, Zuko,” she says finally, and he takes a deep breath.\n“Maybe you should,” he replies darkly. “If it isn’t safe –”\n“I don’t give a  damn  about safe,” she snaps. “I have  work  to do here, and I’m not leaving until it’s done. I’ve promised you, I’ve promised the people. I’m not breaking those promises. I’m not letting them run me off. I’ve never backed down from a fight before,” she goes on, crossing her arms. “I said once that I would never turn my back on people who need me, and I’m not about to start now. People are depending on me. On  us. The future is in our hands, and I’m not about to drop that because I’m  scared.”\nZuko looks at her with an unidentifiable emotion in his face, jaw clenched. “I can’t believe someone would do this,” he says through gritted teeth, and she shakes her head.\n“I can,” she replies, a bit softer. “Your father, your grandfather… they spent a hundred years telling the people that the Fire Nation was superior to everyone else, and I’m a walking symbol of  everyone else . I can’t change that, and I wouldn’t even if I could,” she adds, even though there’s a part of her – the small, frightened part of her that feels, right now, like she did when her father walked into their home to find her mother’s body, like the world is falling apart and full of evil people who want to hurt her, specifically, because of who she is – is thinking about how much easier it would be if she could, or if she could just leave this all behind. But that part of her hasn’t been in charge for a long, long time, and she’s not giving it control today.\n“I’m not going anywhere,” she repeats, placing a hand on his shoulder. “None of this is going to go away overnight. You can’t make a hundred years of propaganda vanish in five. We’ll be fighting this for the rest of our lives, that’s how it’s going to be. But the only way to make it ever get better is by standing our ground and fighting it and never giving up.”\nZuko nods, swallowing thickly, and then pulls her into a tight hug, tighter than Toph’s was.\n“Promise me you will stay safe,” he says seriously, and she nods into his shoulder.\n“Of course,” she replies. “Just because I plan to stand up to it doesn’t mean I’m gonna be stupid.”\n“If you leave the palace,  please take Toph with you.”\nKatara laughs a little, although she knows it sounds as forced as it feels. “As if she’d let me leave without her now.”\nHe laughs with her, in that same forced, clipped way, and his arms tighten around her. They stay like that for a long time, until she isn’t sure who’s being comforted here, anymore.\n.\n“Did you find them?” she asks Toph later that night, but Toph scowls into her bowl of soup.\n“No,” she growls. “We did find some things, though,” she adds, sighing. “Signs point to the attackers being involved with the New Ozai society. Opinions on the force are divided between them trying to get you out of the way so they could go after Zuko, and them wanting to “purify” the Fire Nation leadership.”\nKatara flinches at the word  purify, in spite of the fact that she knew this was possible, even likely. It’s probably both, she thinks. “If it’s… that second one,” she says delicately, “then you’re a target, too.”\n“Yeah,” Toph replies, but then squirms a bit. “But… well…”\nShe catches on. “From a distance, you can pass for Fire Nation,” she infers, and Toph looks away miserably. “Still, you’re not exactly unknown. Just because your skin is paler than mine doesn’t make you safe.”\n“Zuko said you were really adamant about not leaving,” Toph says quietly, and she nods.\n“I can’t solve anything from a hiding place,” she answers. “I’m not gonna take any stupid risks or anything, but I’m not backing down, either.”\n“You want to move forward on the hospital?”\n“Of course I do,” she replies. “Someone targeting me doesn’t make it any less necessary.”\n“Don’t you  dare go out there without me.”\nKatara tries to smile. “I just said, I’m not gonna take any stupid risks. You saved my life,” she adds softly. “Thank you for that.”\nToph, to her slight surprise, doesn’t respond with something light-hearted – it shows just how seriously she’s taking this. “You know I’m not gonna stand aside and let somebody hurt you,” she says, still scowling and picking at her soup without any apparent desire to eat. “We’re in this together.”\n“Right,” she replies, reaching out and taking Toph’s hand. “We’re in this together.”\n.\nShe determines not to even hesitate, not to give them the satisfaction of thinking that she’s been cowed, and so she and Toph go out the very next day to pick up where they left off, on getting the hospital building finished, and then moving forward on setting it up.\nPeople are whispering all around them, watching her carefully, and she holds her head up high even as a small, frightened voice in the back of her mind wonders how many of them think it’s a tragedy that she wasn’t killed yesterday.\nSun-Li, Chunhua’s young sister – twelve years old a few weeks ago – runs up to her, braid flapping behind her. There’s a blue ribbon in her hair, and her hands are full of groceries.\n“Katara!” she cries, and Katara gives her a strained smile.\n“Hi, Sun-Li,” she says with forced warmth, and then gestures at Toph. “Toph, this is Sun-Li, she’s a friend of mine. Sun-Li, Toph.”\n“Hey,” Toph says, and Sun-Li pauses, bowing low. “Nice to meet you.”\n“Nice to meet you too, miss. Are you going to oversee the building?”\n“We are,” she replies. “Is the teashop doing okay today?”\nIt’s a belated reaction – if they’re going after her, they may also target places that she frequents – but it turns out to be premature, when Sun-Li grins.\n“We’re great! Sister was really worried about you after yesterday, she’d be happy to see you.”\nKatara smiles with a little more ease. “I’ll make sure to stop by,” she replies, and Sun-Li nods, holding up the bags in her arms.\n“I’m going that way right now, if you wanted to walk with me?”\nShe glances at Toph, who shrugs, and then nods, saying, “Okay,” even though she isn’t quite sure why the young girl wants to walk with her.\n“We were all  really upset by what happened yesterday,” Sun-Li says, as though making light conversation, as they walk up to the teashop. “Chunhua was crying, she said she was scared you’d gotten hurt, or that you’d think everyone in the Fire Nation wanted you to leave.”\n“It… has crossed my mind,” she admits, and Sun-Li looks up at her with wide, bright eyes.\n“We don’t!” she cries. “We  love you. You’ve really listened to us and we really believe in you. That’s why I’m wearing the ribbon,” she adds, swishing her head so that her braid swings back and forth, showing off the blue ribbon. “We started passing them out this morning, so that you’d know you have people on your side.”\nKatara freezes mid-stride and looks around – now that she’s looking for it, there are a good number of people wearing blue ribbons, either tied into their hair or around their upper arm or woven into their belts. It’s not everyone, or even most people, but there  are a lot of them, and not all are familiar faces.\nHeat rises to her face and prickles behind her eyes, and her vision blurs.\n We really believe in you.\nChunhua steps out of the teashop, face lighting up as she sees her, and she’s wearing blue ribbons in her hair, too. The teashop seems to be a nexus of them – everyone inside, that she can see, at least, is wearing one.\n We love you.\n“You’re okay,” Chunhua gushes, but Katara can’t seem to form words. “We were so  worried!  I can’t believe somebody tried to hurt you! After everything you’ve done for us!”\n“I –” she starts, but her voice catches in her throat. “I didn’t realize I had this much support,” she manages to choke out, and Chunhua smiles.\n“You like the ribbons?” she asks brightly. “They were Sun-Li’s idea, she said we should show you how many people in the Fire Nation are on your side.”\nShe covers her mouth with her hand, unsure how to even begin to articulate what she’s feeling. It runs deeper than simple gratefulness; it’s security, she realizes slowly. Katara always knew how to protect herself, but there’s something about knowing that she is surrounded by friends, by allies, by people who are openly supporting her… it’s heartening, after a very, very disheartening day yesterday.\n“Can I have one?” Toph asks, and Katara glances at her. “Actually, make it two, Sparky will want one once he hears about this.”\n“Of course,” Chunhua replies, grinning.\nOf course Zuko will want one, she thinks distantly. Except for maybe Sokka, he’s her biggest fan.\n“You okay, Sugar Queen?” Toph asks, tacking on the nickname in a transparent attempt to lighten the mood.\n“I’m…” she starts, but doesn’t know how to finish the sentence. “Thank you,” she tells Chunhua, instead of trying to come up with an answer to Toph, as her eyes fill and brim over with tears. “Thank you.”\nChunhua smiles. “I don’t want you to ever feel like you’re not welcome here,” she says seriously. “You  are. You’re here to help us, of course you’re welcome here. I don’t care what any old Fire Lords of the past have said. You’re my friend, and I’m going to support you.”\nKatara gives her a watery smile, and then a tight hug, which is returned with force.\nIt isn’t much – they still haven’t caught the guy, they still don’t have much in the way of leads to even start – but it feels like a big step in the right direction, anyway.\n.\nShe walks away from the teashop feeling energized, feeling less alone; Toph has already tied a ribbon around her arm – when Katara commented on being a little surprised by her openness, she had actually gotten a little offended, saying, “Just because I make fun of you and yell at you sometimes doesn’t mean I don’t support you,” like she was genuinely upset at the thought that Katara might not know how much she cared.\n“Seriously, though, this’ll really cheer Sparky up,” Toph says lightly, as they walk to the building site. “I think he’s more upset than you are.”\n“I think so, too,” she replies.\n“Why do you think that is?” Toph asks, in a strange sort of tone, almost prodding. Katara glances at her sideways.\n“I have no idea,” she deadpans, and Toph sighs, giving no indication of having any ideas as to why that might be, herself.\n“Seriously, though,” she goes on in a lower voice, “he’ll be really happy to know that at least a lot of his people love you as much as he does.”\nShe pauses, the breath in her lungs suddenly becoming so much thinner. “What did you just say?” she asks, but Toph doesn’t give an inch.\n“I  said , he’ll be really happy about this,” she replies in a louder voice, then beckons her to follow. “Come on, I don’t have all day. Let’s get this inspection over with.”\nHealer’s Row isn’t far, and they’re there soon, where it’s going pretty smoothly, but Katara is a bit preoccupied by Toph’s too-casual-to-be-really-casual words, and can only focus so much on how things are progressing. The frame is fully complete, and about half of the inner structure has been finished, and the workers comment to her about how relieved they are to have a decent job right now, does she know what the next building project will be?\n“Not yet,” she replies, with some apology, “but I was thinking about a school.”\nA school would be good, she thinks, looking at them. Something else they could build, another job they could take on, and which would need near-constant upkeep, guaranteeing them at least some form of work, for quite some time.\nPlus, she promised Chunhua a school, and she’s more determined than ever before to ensure that it happens.\n“Let’s get back to the palace,” she says, and Toph nods, waving at the construction workers as though they’re friends. “Do you know them?”\nToph shrugs. “Sort of. I talked to a bunch of them yesterday, to see what they knew. They’re not bad people.”\nKatara looks at her carefully. “You liked that, didn’t you?” she muses, and Toph gives her an affronted look, so she clarifies: “Not – I mean, not the attack, but the investigation. You seem… I don’t know, it just seems to suit you.”\n“It’s definitely more interesting than politics, that’s for sure,” she mutters, but seems to be mulling it over. “That’s for  damn sure.”\n“Yeah, the day-to-day of politics is pretty boring,” she concedes, stretching her arms out and looking around. There are so many people wearing blue ribbons, so much more than she would have guessed. She supposes that she’s been more visible than she’d thought. “It’s worth it, but it gets tedious.”\n“Understatement of the  century,” Toph replies, and as openly relaxed as she seems, Katara can see her tilting her head this way and that, still looking out for threats and, perhaps, seeing if there’s anything familiar from yesterday. Toph is playing calm, for Katara’s benefit, but Toph is still on-edge.\nIt’s not as though Katara is fully relaxed, herself, but she feels a lot safer with Toph by her side, and with all the blue ribbons around her, than she did right after the attack, when she’d felt completely alone, a blue-and-brown spot in a black-and-white world.\n.\nThe letters start coming in that afternoon.\nThe first one she receives is from Sokka, which is full of freaking out and  tell me you’re okay tell me it’s okay tell me you’ve got Toph by you 24/7 tell me you drowned that guy in his own body fluids tell me you are okay  – so much of it, in fact, that she’s almost surprised that the words don’t leap off the page and actually yell at her. The second is from Ty Lee, which is almost identical to Sokka’s, and the third is from Suki, which asks if she wants her to come back to the Fire Nation for a while.\nThe fourth is from Mai:  Congrats, it says,  you had your first assassination attempt. Get used to it. It means you’re doing something right. \nThat’s a bit ominous, she thinks.\nThe fifth is from Aang.\n Katara, he starts, and she can almost hear him taking a deep breath while trying to think of what to write,  I’m so sorry this happened to you, and I’m glad to hear that you’re safe. Please stay safe. You’re too important to the world for us to lose. \n\n I also wanted to apologize for what I said in Ba Sing Se. You’re the bravest person I’ve ever met, please don’t ever think otherwise. I hope this finds you safe, and happy. \n\n\n Your friend, always, Aang. \n\nAfter replying to all of them – some with a lot more comforting required than others, and she isn’t entirely certain that Sokka isn’t already on a boat over – except the last, which she thinks she’ll need much more time to process and think up a response to, she goes up to the roof. It’s been a while since she’s been up here, too busy with the planning and yesterday too anxious to dare go out in the open, and she’d almost forgotten how calm it is, how peaceful.\nShe’s beginning to think that Amaya the First didn’t make this as a romantic getaway, after all. Maybe she just built it as a place to hide, for a little while, when things got too scary or overwhelming or heavy down below in the palace.\nThe letter from Aang is what she wanted to hear on the balcony, now several months ago, and she wonders how much of it was motivated by the fear of her dying before he could make amends – even so, she thinks, it’s nice to know that he wants to make amends at all.\nIt’s nice to know that maybe they can repair things, at least enough that they can talk to each other again.\n“I wondered if I’d find you here,” Zuko says, startling her a bit, since she hadn’t heard the door open, but she shifts over to give him room to sit down all the same. He stays standing.\n“I needed to get some air,” she replies, smiling wanly. “Toph seems to be getting along well with the police force.”\n“I think they’re more afraid of her than they are me,” he deadpans, running a hand through his hair.\n“Something on your mind?” she asks, and he laughs a little, sort of desperately.\n“A lot of things,” he replies, but holds out a hand. “Right now, I just wanted to show you, the turtleducks have hatched.”\nShe bolts upright without stopping to let him help her up. That, she thinks, is  exactly what she needs right now: ridiculously-adorable baby animals. He snickers at her enthusiasm, but looks tired.\nThey arrive in the private garden to the sound of quiet, high-pitched quacking, and Katara melts inside when she sees them – they’re so tiny, and so downy, with orange-brown fluff sticking out all around their little shells as they swim around their mother, begging her to feed them.\n“You’re right,” she says faintly, “they  are even cuter than I thought they’d be.”\n“I felt like we could both use this,” he replies, snickering again. “They’re soft, too,” he adds.\nAnd alive, she thinks, as he picks one up and hands it to her. Soft and alive and quacking and nuzzling her hand, totally unaware of how ungrateful and awful the world can be sometimes, but also unaware of how wonderful and rewarding it can be, too.\nZuko has a blue ribbon tied around his wrist.\nMaybe they’ll catch the guy – actually, no, she knows Toph won’t stop until she has him wrapped up in rock and behind bars, so they’ll definitely catch the guy, but it’s only maybe that they’ll catch the rest of whoever he was working for. Or maybe they’ll just disappear into the jungles until they fade away.\nMaybe she’ll live to see the Fire Nation fully accept her the way Chunhua has. She’s off to a great start, if the number of ribbons is any indication; maybe there will always be people who hate her based solely on where she came from and the element she bends, who will never, ever give her a chance.\nBut eventually, they’ll fade away, too, even if it’s long after she’s gone and all that’s left is her legacy, her hospital and her school and whatever else she pushes for, whatever else she leaves here. Maybe that’ll only be policy and a few buildings. Maybe that’ll be more.\nThe turtleduck waddles up her arm and sits itself on her shoulder, snuggling up against her neck, its down tickling her and its light warmth spreading much further than its size would suggest.\nMaybe she and Aang will be real friends again someday. Maybe they’ll just be co-workers in rebuilding the world.\nPeace isn’t something that falls on you, she’s slowly realizing, it isn’t something that just happens when the fighting stops – peace is something you  build, brick by brick by tedious brick, until finally you look up and you’ve got a foundation of something solid and lasting. Peace isn’t something you find; it’s something you make for yourself, out of the ruins left behind by war and heartbreak and loss. It’s something you put together, out of what’s left after the storm has passed.\nShe reaches out and takes Zuko’s hand, then, on impulse, leans up and kisses his cheek, being careful not to disturb the turtleduck.\n\n He’ll be happy to know that a least a lot of his people love you as much as he does. \n\nToph  would know.\n“Katara…” he says softly, and she smiles, and he seems to lose track of his thoughts. “Thank you, for everything.”\n“I told you,” she replies, “I’m not going anywhere.”\n“You promise?” he asks, squeezing her hand tightly.\n“Yeah,” she says, leaning her head on his shoulder. “I promise.”\n.\n.\n coda   – \nThey're all there for the ground-breaking ceremony, just before the sixth Council of Four is scheduled to take place, on what they've (reluctantly, in some cases; Sokka in particular was pushing for something related to a fifth element) decided to call Republic City. \"Because it will  be a republic,\" Aang had explained. \"A place where everyone is represented and everyone has a voice.\"\nSokka, Katara suspects, was simply bitter about not being able to include his puns on national scale.\n“Come  on, Katara,” he grumbles to her, crossing his arms. “We had the perfect opportunity to place my wit on the map for all of history. I can't  believe you've betrayed me like this, siding with 'Republic City'. That's so boring!”\n“Wit?” she counters, hands on her hips. ““Aether City” is your definition of wit?\"\n“Well, if anyone had even  considered any of my other ideas…”\nBehind him, Suki rolls her eyes and makes a hand motion to imitate a flapping mouth, and Katara snickers.\n“How much of this have you had to listen to?” she asks, leaning around Sokka.\n“You would not  believe,” she replies fervently.\nSuki sighs heavily in exasperation, but she fingers the pendant on her neck all the same. It’s not perfect, but he put a lot of work into it, and it suits her – it suits  them, and not just Sokka and Suki. It’s imperfect, but it’s made with love and care and hope, and so it’s something to be proud of.\nAang walks up from behind her and sighs. “He won’t let go of “Aether City,” will he?”\n“I’m pretty sure he’ll have it carved on his grave,” Katara replies. “How are things at the Air Temple?”\n“Pretty good,” he answers, smiling. “I think some of the Acolytes are pretty much masters at this point, they’re starting to take Air Nomad philosophy and apply it to the modern world. They’re excited about the city.”\n“That’s great!” she says, and means it. “I’m really happy for you.”\n“Yeah,” he says slowly. “I hear there’s reason for congratulations to you, too.”\nHer breath catches in her throat a bit, but she’s wearing the headpiece in her hair – it’s not like she came here to hide it.\n“Fire Lady Katara,” Aang muses. “It’s got a good ring to it. I’m glad you’re happy,” he adds in a quiet voice. “I really am.”\n“Thank you,” she says, matching his volume. “It means a lot. I know we’ve had a rocky path, but… I’m glad we can stand here, as friends.”\n“Me too,” he replies, with a genuine smile. “You’re gonna be an amazing Fire Lady.”\n“All right,” Toph cries, joining them and barging into the conversation with all the subtlety of a mallet, “let’s get the future started!”\n“Yeah,” Katara says, as they walk forward to join Zuko and the builders at the site. “Let’s get the future started.”"
}