{
    "id": "8091886",
    "url": "https://archiveofourown.org/works/8091886?view_full_work=true",
    "author": [
        "RayShippouUchiha"
    ],
    "title": "Hide A Heart Of War",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Marvel Cinematic Universe",
        "The Avengers (Marvel Movies)",
        "Iron Man (Movies)",
        "Captain America (Movies)"
    ],
    "relationships": [
        "James \"Rhodey\" Rhodes & Tony Stark",
        "James \"Bucky\" Barnes/Steve Rogers",
        "James \"Bucky\" Barnes/Steve Rogers/Tony Stark",
        "Endgame - Stuckony",
        "Steve Rogers/Tony Stark",
        "James \"Bucky\" Barnes/Tony Stark"
    ],
    "characters": [
        "Tony Stark",
        "Steve Rogers",
        "James \"Bucky\" Barnes",
        "James \"Rhodey\" Rhodes",
        "Clint Barton",
        "Natasha Romanov",
        "Thor",
        "Sam Wilson"
    ],
    "additional_tags": [
        "Implied/Referenced Child Abuse",
        "Howard Stark's A+ Parenting",
        "soul marks",
        "Flowers",
        "So many flowers",
        "seriously",
        "Angst",
        "Tony Feels",
        "Tony Stark Needs a Hug",
        "Language of Flowers",
        "Pining",
        "Protective Rhodey",
        "Rhodey is the best bro",
        "Oblivious Tony",
        "Self-Esteem Issues",
        "Fluff and Angst",
        "Angst with a Happy Ending",
        "Tony Stark Has A Heart",
        "Heart-Flower AU"
    ],
    "language": "English",
    "series": "Part 1 of An Ever Growing Garden",
    "published": "2016-09-20",
    "completed": "2016-09-27",
    "words": "13,617",
    "chapters": "2/2",
    "comments": "1,292",
    "kudos": "26,223",
    "bookmarks": "8,674",
    "hits": "328,332",
    "summary": "<p>“You’ve got <i>war<i> in your heart boy,” Howard sneers, “don’t ever try and pretend to be anything but what you are.”</i></i></p>\n<p>\n<i>\n<i>Tony feels the familiar burn of a flower mark being etched into his skin but he doesn’t look, doesn’t try and check to see what it is. Instead he keeps his eyes on Howard and his hands cupped around his bleeding mouth and nose.</i>\n</i>\n</p>",
    "notes": "<p>So this is pretty rough but I needed to get the idea out. I've tried to put context clues as to what each flower means but I'll also include a link to the site I got my translations from so everyone can be on the same page.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Edit: The site I used for flower meanings no longer exists but if you pay attention each flower's meaning is stated in text as they appear.</p>\n<p>Holy shit you guys. Just wow. I never thought this story would get this kind of response and this kind of interest. Seriously, never. I've been blown away by the response I've been getting and I hope the second half will be up to standard.</p>\n<p>Also I've been blessed with fic for this verse by the lovely Eunoiabound that I highly recommend you guys check out.</p>\n<p>Finally though I'll be posting a list of Tony's flower-marks and positions at the end of this chapter in the AN so be on the look out for that.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>Tony's flower-marks - be sure to remember that a lot of these are woven around each other on his body:<br>Heart-flower = Yarrow flower – directly over heart and on right wrist<br>Walnut flower - behind right ear<br>Sycamore flower – behind left ear<br>(Multiple) Yew/Hand/Syringa/oleander/helenium/Judas flowers – woven across right rib cage/side<br>Judas flower (1) – specifically beneath right underarm<br>(Multiple) Citron/cardamine/morning glory vines – across the tops of both shoulders<br>Red Chrysanthemums (3) – left pectoral<br>Clematis flowers – back of neck<br>Red Balsam flower – right palm<br>Burdock flower – left palm<br>Narcissus flower – left hip<br>Sorrel flowers (4) – left thigh<br>(Multiple) Yellow carnations – back<br>Marigold – right side<br>(Multiple) Yellow roses – wrapped around both ankles<br>Hemlock – encircling arc reactor<br>Cranesbill – hollow of left wrist<br>(Multiple) Fish geraniums – left ribs<br>(Multiple) Cypress flowers – collarbones<br>Pear flowers – down spine<br>Yellow acacia (2) – right knee<br>Yellow Tulip (2) – top of right foot<br>Juniper flower - high on right thigh<br>Deadly nightshade flower – hollow of throat<br>Flowering almond –right side of neck<br>Black poplar – left ribs<br>Bluebell – right hip<br>Violets – toes and back<br>Red and pink roses – ribs and shoulders<br>Myrtle – collarbones<br>Honeysuckle – encircling arc reactor<br>Forget-me-nots – left side of chest and ribs, entwined throughout the other flowers and in any clear space, spreading down the backs of his hands as well.<br>~~~<br>What did you guys think? Did you like it? I hope everyone who reviewed on the first chapter will come back and tell me what they think.</p>\n<p>http://rayshippouuchiha.tumblr.com/</p>\n<p>Also, come scream at me on Tumblr if you'd like</p>",
    "text": "Every child, without fail, is born with a mark, a swirl of color that takes the shape of a perfectly formed blossom nestled directly over their hearts and echoed on their right wrists.\nTwin blooms etched into their skin by some kind of cosmic force.\nHeart-flowers, they’re called, those first blossoms to be etched on a person’s skin, the ones gifted to them at the moment of birth no matter what.  More flower-marks can follow in time, depending on a person’s life, but the heart-flower pair is always the first.\nThe thing is, no one knows what causes them.  No one knows where they come from or why they show up.  No one really remembers how their meanings were divined, just that they were.  It doesn’t really matter though because even if there weren’t classes and books and studies done on the meanings people would still know.\nSomehow people can always tell what the marks mean, what they stand for even, without being told.\nIt’s a universal language, a shared constant of sorts, and everyone knows that the heart-flower, beyond the other flower-marks a person might gain during their lives, is always the most important.\nThe heart-flower is the one that speaks the loudest, the one that represents just who a person is deep inside.\nSo when Anthony Stark is born with a large clump of yarrow flowers etched into his skin directly over his heart and mirrored on his right wrist, the petals red as blood and the centers little sunbursts of yellow, there’s a deathly kind of quiet in the delivery room.\nNo one, not even the Howard Stark, wants a child with war in his heart.\n~~~\nUnlike most people Tony’s heart-flower isn’t alone for long, his first flower-mark shows up by the time he’s a year old.\nA sprig of tiny, delicate white walnut flowers etch their way onto the skin behind his right ear with a frigid kind of burn.  A ball of crimson sycamore blossoms find their way onto the skin behind his left not ten seconds later.\nHis intellect and curiosity etching themselves in turns across his skin for the entire world to see.\n~~~\nNeither Howard with his grandeur filled ash blossom, nor Maria with the magnificent beauty of her calla flower, because they’ve never been Father and Mother, not for him, not for Tony, have much to do with him as he grows.\nThe most they do is shove a thick leather band at him to cover his wrist and make sure he knows just how much trouble he’ll be in if he lets anyone see his heart-flower.\nIt doesn’t take him long to realize that, to know with a deep kind of certainty, that they don’t particularly care for him.\nBy the time he’s four, his first circuit board in hand and a freshly slammed door in his face, Tony knows it for truth.\nThe freshly blossomed yew flower that burns its way onto his rib cage is proof of his sorrow.\n~~~\nHe’s six when Howard shoves a tumbler of scotch into his hand and tells him to drink.\nTells him it’ll put hair on his chest.\nTells him it’ll make a man out of him.\nTony doesn’t want to be a man, he just wants to build, wants to create, wants to be Tony.\nHe drinks it anyway though because he’s also still desperate for Howard’s approval.  For Howard’s anything.\nThe vibrant red hand flower that burns its way into existence underneath the sorrow of his yew blossom is a warning all on its own.\n~~~\nHe builds his first engine at seven but it isn’t good enough for Howard.\nNothing ever is.\nThe small white syringa flower he finds later on that night nestled beside the yew and hand flowers is to be expected.  Disappointed expectations are their own kind of pain after all.\n~~~\nTony tells Howard he doesn’t want to build weapons one day.  He tells him that he wants to make robots, wants to make planes and computers and a million other useful things.\nHe doesn’t want to hurt people.  Instead he wants to be a hero, like Captain America and his Commandos.\nHoward’s ring splits his lip and Tony tastes blood seconds later, thick and heavy in his mouth, bitter and biting on his tongue just like the scotch had been.\n“You’ve got war in your heart boy,” Howard sneers, “don’t ever try and pretend to be anything but what you are.”\nTony feels the familiar burn of a flower mark being etched into his skin but he doesn’t look, doesn’t try and check to see what it is.  Instead he keeps his eyes on Howard and his hands cupped around his bleeding mouth and nose.\nHe’s young but he’s smart and Tony knows better than to take his eyes off of a predator.\n~~~\nLater that night is when he finds it.\nA Judas flower has burnt its way onto the skin beneath his right underarm and Tony isn’t even sure why.\nYou have to have faith in someone to be betrayed in the first place.\n~~~\nCitron flowers woven between cardamine and morning glory vines settle across the tops of his shoulders like a cape by the time he’s nine.  A garland of sadness woven between paternal error and extinguished hopes for all the world to see.  A testament to the fact that he’s a disappointment, that the war in his heart has eaten away at even the love his parents might have had for him otherwise.\nTony stops taking his shirt off unless he’s alone in his room with the door locked and always makes sure his cuff is tight and secure.\nHe’s not sure if it’s out of a need to hide his flower-marks or the bruises.\nNeither are something he wants anyone else to see.\n~~~\nJarvis is his only true solace, him and the fleeting figure of Aunt Peggy who whirls in and out of his life over the years.\nJarvis who’s heart-flower is a cress flower, a sign of stability in Tony’s rough world.\nAunt Peggy carries a clover flower and wears the dignity it foretells like a shield.  But she always has a smile and a hug for Tony when she comes around.  She always has time for him, has soft, caring hands and warm, safe arms.\nThe twin red chrysanthemums that blossom across his left pectoral at ten are a relief.\n‘I love,’ they scream to the world, ‘I love, I love, I love.’\nAnd he does, God he does.\nHe loves them both.\nAnd it’s a relief because he almost wasn’t sure if love was something he could feel.\nBut he does.\n~~~\nTony grows.\nHe graduates high school and goes off to MIT, too young and too small in so many ways but far older in all the ones that really count.\nClematis flowers burn their way across the back of his neck at fourteen and Tony laughs and laughs and laughs because his mind is a lot of things but beautiful isn’t one of them.\n~~~\nRhodey is though.\nRhodey with his cactus flower that screams of his endurance.\nRhodey who pulls him out of frat houses when he’s had too much to drink.  Rhodey who stops dozens of hands from touching him when he’s too out of it to know better.  Rhodey who keeps him fed and relatively in one piece.\nRhodey who ruffles his hair and laughs at his jokes and doesn’t ask anything from him except for Tony to eat and sleep and generally try and take care of himself.\nRhodey who asks him once what his heart-flower is because Tony refuses to take his shirt or his cuff off around him.\nRhodey who goes quiet and kind of sad when Tony pushes back his shirt sleeve and rips his cuff off only to throw it onto the ground between them like a gauntlet as he turns his exposed wrist over and shows him.  Rhodey who pulls him close, who touches him without hurting him, who never looks at him different even after he finds out that Tony’s heart is filled with war.\nRhodey who takes him under his wing and makes those two red chrysanthemum blossoms become three.\n~~~\nThere are scars on the palms of his hands beneath the flower-marks that’ve unfurled there.\nRed balsam blooms across his right palm and burdock across his left.\nTwo different ways to convey the same message.\nTouch me not.\nTony doesn’t like to be handed things anymore.\nHoward made sure of that.\n~~~\nBy the time Howard and Maria die, by the time Jarvis goes with them, Tony’s a tapestry of blossoms.\nHis entire right side is covered with blooms whose meanings he wishes he could erase.  Yew and oleander mixing with helenium and Judas tree flowers until there’s barely any blank skin left from his shoulder to his waist on that side.\nSometimes he wonders if there’ll ever be anything else for him, if he’ll even have room for anything else, filled up half way as he is with sorrow and pain, with betrayal and tears.\nTony can’t help but wonder if there will ever be love for him.  If he’ll ever find someone who’ll make the forget-me-nots of true love flow across his skin even as filled as his heart so obviously is with war.\nHe’s almost sure that he wouldn’t deserve it anyways so it doesn’t really matter in the end.\n~~~\nTony builds DUM-E six days after the funeral.\nHe painstakingly etches a volkamenia flower onto DUM-E’s base with hands that shake.\n‘May you be happy,’ is what the heart-flower means and it is Tony’s fondest wish for his new and undeniably quirky son.\n~~~\nAt twenty-one the company is his.\nAt twenty-two a narcissus flower blossoms across the arc of his left hip and for the first time in his life Tony seriously considers trying to carve off one of his flower marks.\nHe remembers the narcissus that had swept across the entirety of Howard’s right forearm, a testament to his ego.\nTony doesn’t want to share a blossom with Howard even if the bastard is long dead.\n~~~\nU gets a patient galirum.\nButterfingers a fraxinella for his fiery nature.\nAnd JARVIS, when he comes, gets a ragged robin flower coded into his sequences because he’s filled with wit.\n~~~\nBy the time he’s twenty-five Tony’s biggest secret, besides his heart-flower, is the large cluster of sorrel flowers that takes up the entirety of his left thigh.\nThere are four large blossoms, one for each of his bots and JARVIS.\nThey’re his children and he loves them.\n~~~\nTony has more flower-marks than any one person he’s ever met.\nThey spill out across his skin in swirls of colors and shapes, paint his past and his heart across his skin in a million, revealing ways.\nHe wears long sleeves and pants most of the time because of that and a specially designed body paint when he goes out to party that makes his skin look blank and clean.\nThere are rumors that he doesn’t have a heart-flower because of that.  Rumors that he’s soulless on top of everything else.\nThey’re obviously ridiculous though because he wears a cuff and he does have a few flower-marks that he doesn’t bother to hide, mainly the ones on his hands and behind his ears, the cluster of blooms on the back of his neck.\nIt doesn’t stop the whispers though.\nBut then nothing ever really does.\n~~~\nPepper is beautiful with her purple columbine blossom and her matching resolve to win.\nFor a while Tony thinks he could love her, could have forget-me-nots spill out across what’s left of his skin for her.\nBut then he sees the way Happy with his hardy cranberry flower looks at her and he lets the thought go.\nShe’s too good for someone like him anyways.\nToo good for a wreck of a man with war in his heart.\n~~~\nAfghanistan comes and with it all of the horror that Tony knows will haunt him for the rest of his life.\nHe feels the icy burn of new flower-marks being etched across the skin of his back every time they force his head beneath the water.\nYinsen with his dignified clove flower holds a mirror for him later so he can look and see what they are.\nA small ocean of yellow carnations are spread across his skin.\nThey echo the ‘no’ he’s been screaming in his head ever since all of this started.\n~~~\nHe isn’t surprised in the least when his grief over Yinsen is written out across his skin.\nA single marigold burns into existence, fitting naturally into the tapestry of pain Howard had left him with.\n~~~\nTony builds the suit from the ground up and by the time the Mark III is ready to go he has a burst of joyous yellow roses wrapped around each ankle.\nFlying is like nothing he’s ever experience before in his life and he relishes every second of it.\n~~~\nIn hindsight Tony should have known Obi-Stane was behind it all, should have at least suspected the man with the bilberry heart-flower.\nTreachery was, after all, painted across his skin.\n~~~\nHemlock flows around the reactor but the flowers do little to disguise the palladium that’s worming its way through his system.\nAll they do is announce the death he knows is coming.\n~~~\nEven when he makes the new element, even when the reactor stops poisoning him and Vanko is dead, the hemlock haunts him.\nBecause now he think he knows just what they mean.\nThis, the armor, the fighting, the violence.\nIt’s going to kill him.\nBut Tony?\nTony doesn’t care.\nHe’s still forget-me-not free so he has nothing to lose.\nNot really.\nSo … it’s worth it.\n~~~\nForget-me-nots spill across Pepper and Happy’s hands and when they entwine their fingers they look like one entity, one continuous ocean of blue.\nA tiny cranesbill blossom etches itself into the hollow of his left wrist but Tony just rubs the burn away and ignores the way his envy’s been splashed across his skin.\n~~~\nLoki comes and Tony’s called to help, called to join the group he’d been deemed unsuitable for.\nHe meets Steve and nothing goes like he wanted it to go, nothing goes like he’d hoped it would in some distant, soft part of his heart and his mind.\nSteve’s words echo in his head because in that moment Tony could swear he hears Howard laughing in the background of his mind.\nHe doesn’t focus on that though.  Can’t.  There’s too much happening, too much to do.  So instead he buckles under and ignores the way the cluster of fish geraniums on his rib gains another bloom.\nHe’s used to it by now though, has had disappointment and broken expectations etched onto his skin for as long as he can remember.\nWhat’s one more in the scheme of things?\n~~~\nHe goes through a worm hole.\nHe falls.\nThe cypress flowers he finds scattered across his collarbone aren’t a surprise.\nHe did die after all, if only for a too short moment.\n~~~\nIt’s strange afterwards, gathering his new team together and pulling them all to stay under one roof with him.\nStrange but good.\nIt doesn’t take long for pear flowers to dot their way down his spine, a testament to his affection for this mismatched and raggedly little family he’s somehow found himself a part of.\nThere’s Bruce who swears he lost his heart-flower when he gained the Hulk but Tony knows better.  Bruce’s skin might be clean now but the Hulk’s isn’t.  The juniper blossom that spreads itself across his great chest is a testament to how he protects Bruce even if Bruce doesn’t see it that way.\nThor’s people don’t have heart-flowers at all, which is strange and vaguely unsettling, but they all move past it when he tells them of auras and how he sees them all crowned in robes of light.\nClint has a smattering of marks, nowhere near as many as Tony does but more than a handful.  His heart-flower is a hawkweed blossom and the quick-sightedness it signifies suits him so well it’s almost ridiculous.\nTony had thought Natasha would be the most difficult to deal with but she isn’t.  Her red peony stands for devotion and when he sees the way she looks at Clint … well Tony finds that he isn’t that surprised at all.\nPlus the matching strands of forget-me-nots they both have across their trigger fingers says a lot even if they both insist that love is for children.\nIn the end it’s Steve that gets to him the most, because of course it is.  His black poplar flower suits him well, his courage written out across his skin.  The swathes of marigolds that cover his biceps suits him far less.\nThe sight of his grief, his loss, makes Tony’s own stomach twist because he would take that pain from Steve if he could, would give him back his life and Bucky and all that he’s lost if it was possible.\nBut he can’t.\nAnd hell, Steve probably wouldn’t accept it from him even if he could.\n~~~\nSix months in and Tony ignores the yellow acacia flower that blossoms across his right knee.\nHe doesn’t have time for a secret love.\n~~~\nA yellow tulip etches itself across the top of his right foot and Tony ignores that one too.\nHe already knew his love was hopeless because he knows that Steve will never love him back.\nSteve’s got courage in his heart and grief on his arms and no interest in Tony beyond their slowly growing almost friendship and their flawless teamwork in the field.\nNo matter how his heart skips a beat when Steve smiles at him, no matter how Tony finds himself taking every opportunity he can find to spend time with him just for the chance that he’ll do it again.  None of that matters.\nBecause Tony carries war in his heart and too much sorrow to ever share.\nHe knows better than to get his hopes up.\nForget-me-nots are not for him.\nAnd they never will be.\n~~~\nThen, things change.\n~~~\nSHIELD falls and Steve limps back to the tower with a new friend under one arm and an old one under the other.\nSam Wilson has an osier blossom and the frankness it stands for fits him to the tee.\nBucky Barnes is the even bigger surprise even if Tony has to admit that his bluebell heart-flower is more than a bit ironic given the fact that it stands for constancy.\nStill Tony takes them both in, gives them rooms in the Tower without a second thought.  He wanders back down to his workshop after the introductions are done and pulls up a new folder for each of them in his project queue because they’re his now and that means he needs to make sure they’re outfitted.\n~~~\nThe two new guys slot seamlessly into place in the Tower.\nSam gets on with Clint and Natasha like a house on fire and Tony’s never seen Steve as happy as he is when he’s with Bucky.\nIt hurts in an absent sort of way, the way that Steve smiles at Bucky, brighter and happier than anything Tony’s ever been able to draw out of him.\nIt doesn’t help that Tony can’t bring himself to hate Bucky either, can’t bring himself to dislike the guy at all.  Once he’s shaken the majority of HYDRA’s programing he’s a spitfire, equal parts charming and sarcastic and right up Tony’s alley.\nHe seems to like Tony in turn too which is just as bad because now Bucky spends a good chunk of his free time in Tony’s workshop, playing with the bots or reading on the couch.  With him comes Steve, sketchbook in hand and the smile that hasn’t left his mouth in weeks firmly in place.\nThey settle in like they’ve always been there and Tony just watches them out of the corner of his eye with something like disbelief and awe warring inside of him.\nHe’s not sure why they’re there, he just knows it’s going to hurt when they leave.\n~~~\nThree months later and the yellow acacia has another bloom as does the yellow tulip.\nIn this, as in all things, Tony’s apparently set on being outside of the norm.\nWhy else would he fall into a secret and hopeless love twice?\nEspecially with two people who so clearly love each other despite all the things that’ve passed around and between them.\nThere’s no room for Tony there, no room for him between the two of them.\nSteve’s heart is filled with courage and Bucky’s with constancy.\nThere’s no room there for the war that Tony carries with him everywhere.\n~~~\nThor’s back in Asgard and Sam’s out on a date but the rest of them are all settled down in the common floor’s living room when the questions Tony’s been subconsciously dreading the entire time finally get asked.\n“You know we’ve all been together for a while now and I don’t think any of us have seen your heart-flower Tony.”  Clint’s the one to bring it up because he’s never met a sensitive subject he didn’t like to tap dance on even by accident.  “I mean we’ve seen some of your flower-marks, but you normally wear that cuff and sleeves and pants all of the time.”\n“Why Birdbrain if I didn’t know better I’d think you were trying to get me to take my clothes off.”  Tony tries to deflect because the last thing they need to see is what he carries on his skin.\n“He’s right you know?”  Steve chimes in with a small grin.  “You’ve practically seen all of ours by now Tony.  I don’t think we’ve even seen you in short sleeves yet.”\n“Shame too,” Bucky quips in his direction, that smirk Tony’s grown to equal parts love and hate tugging at his lips, “I bet you got a real fine set of marks beneath all that silk Stark.”\n“Careful Barnes or you might make me blush.”  Tony kicks back in his chair, legs spread wide and deliberately nonchalant.\n“SHIELD never was able to get a full accounting of your marks.”  Natasha puts forth.  “Used to drive Fury crazy that he couldn’t find a single person to confirm your heart-flower.”\n“Ah the joys of SI’s standard water proof body paint.”  Tony raises his glass in her direction.  “Foiling spies and paparazzi since its inception.”\n“But you do have other flower-marks besides the ones we’ve seen don’t you Tony?”  It’s Bruce who asks the question.\n“Sure do.”  Tony answers him automatically because he’s always had a soft spot for Bruce.\n“How many?”  Steve cuts in.\n“A lot.”  Is all Tony says.\n“Five?” Clint asks, brows arching when Tony shakes his head no.  “Ten?  Fifteen?  Twenty?  Fucking more than twenty?”\n“Way more than that Katniss.”  Tony finally admits because everyone is staring at him in surprise and interest and while he’s used to that he’s also not particularly enjoying it at the moment.  “And no I’m not gonna strip down and show you so don’t even bother asking.”\n“You suck Tony.”  Clint’s practically pouting.\n“Not for you I don’t.”  Tony grins.\nThere’s some grumbling but eventually everyone turns back towards the movie.  Everyone but Bucky and Steve.\nTony can feel their eyes on him for the rest of the night.\n~~~\nTwo months later he steps into the kitchen for coffee and stares in something like horror at the sight of forget-me-nots spilling out over both of Steve’s hands as well as Bucky’s real one until there’s not a single spot of clear skin left to be seen.\nTony turns on his heel and goes back down to his workshop, coffee forgotten.\n“Lock it down JARVIS,” he rasps.\n“Of course Sir.”\nTony dry heaves over his workshop sink as mourning bride flowers burst into existence across his left ribs.\nThey suit him perfectly because his … affection for Bucky and Steve both is indeed an unfortunate attachment to which he has lost all.\n~~~\nTony doesn’t come out for days after that.  He ignores the way the team comes down one after the other and knocks on his door.  He ignores the way Bucky and Steve both show up over and over again, frowns on their faces and food in hand.\nInstead he just works, buries himself in upgrades and SI projects and does his best not to feel, not to think.  He wields his blow torch until the sparks sting and JARVIS is practically yelling at him to put it down.  Then he just picks up a hammer and beats uselessly at some scrap steel he has laying around.\nAnything to keep him occupied.\nAnything to keep him from remembering.\nAnything to take his mind off of the fact that he’s finally, officially, lost the both of them even if he never really had them to begin with.\nIt doesn’t work.\n~~~\nHe’s covered in grease and oil and God knows what else when he finally drags himself out of the lab and up to his floor and the shower JARVIS already had running for him.\nHe stumbles into his bathroom bleary eyed and exhausted and barely remembers to strip before he steps beneath the spray.\nHe scrubs absently at the oil that soaked through his shirt and onto his arms and chest and hands before he realizes that not all of it is coming off.\nUntil he realizes that what’s been left behind is blue.\n~~~\nStanding naked and clean in front of his mirror Tony stares at his body with a rapidly growing sense of horror mixed with desperation.\nForget-me-nots.\nHe’s covered in them.\nThe left side of his chest and down his ribs, across his back and down both of his arms.  The blue flowers spread across every spare inch of skin they can find, twining amongst the other flower-marks that cover him.  They come down and cover the backs of both his hands in a way he’ll never be able to hide unless he wears gloves all of the time or breaks his body paint back out again.\nThe only open spaces left are the blank spots on his right hip and the space high on his ribs on the left side of his chest, right below the mourning bride flowers.\nTony bites down on the inside of his cheek until he tastes blood because this … this is fucking cruel.\nHe finally has forget-me-nots and they’re worthless.\nHe finally has true love’s mark and there’s nothing he can do about them because there’s no room for him between Bucky and Steve.\nTony slides down until he’s sitting on the cold bathroom floor, buries his face in his hands, and cries.\n~~~\nHe pulls himself back together of course.\nBecause, above all else, that’s what he does.\nHe pulls out his paint and makes sure he’s covered half way up to his elbows before he snaps his cuff back in place and then goes to get dressed.\nHe’s Tony Stark after all.\nHe has war in his heart and in his blood and bones and he can’t, won’t, let this break him.\n \nTony strides into the kitchen, a fresh suit on and sunglasses firmly in place even if he is still indoors.  Thankfully it’s bright enough in the kitchen that it won’t look too odd as long as he doesn’t stay.\nWhich he won’t be.  He’s leaving as quickly as possible but he needs all the protection he can get at the moment.\nHe’d learned long ago that, besides his flower-marks, his eyes were his biggest tell and they could give him away at a glance if he wasn’t careful.\n‘Soft’, Howard had called them, face twisted in a sneer.\n‘Expressive’, Aunt Peggy had always said with a fond smile.\n‘Weak’, was what they’d both meant, Tony knew.  A chink in any armor he might create.\nAnd Tony’s already so very weak where they’re concerned, already so vulnerable and defenseless when it comes to this team, to Steve and Bucky.  To these people who’ve invaded his home and his heart and ripped him apart in a way that Tony hadn’t thought was still possible for him.\nSo.  Sunglasses it is.\n“He lives!” Clint crows from where he’s perched on top of the refrigerator.  He’s eating a pancake folded like a taco out of one hand and holding a waffle like a piece of toast in the other because he’s only a functioning adult when he’s fighting and even that’s debatable at times.\nClint insists that it’s part of his trademark charm.\nTony thinks that’s debatable too and on most days Natasha seems to agree.\n“Hey Tony,” Steve turns and smiles at him, “we were starting to worry.”\n“Yeah Stark,” Bucky drawls as he leans back in his chair, metal hand curled around his coffee cup and eyes bright as he stares at Tony, “another day down there and me and Stevie were gonna see just how much force those walls of yours can stand.”\nTony bites back a semi-hysterical laugh because if only they knew.\nTony has no walls left where they’re concerned, not really, and that’s his entire problem in the first place.\n“Now, now,” Tony quips even as he takes the cup Bruce puts on the counter in front of him and drains half of it in one burning gulp, “property damage doesn’t make anyone like you more Barnes.”\n“Yeah right, that’s not what you said when I drop kicked that AIM goon through that storefront last month.”  Bucky reminds him with a snort.  “I think the words ‘fucking awesome’ were used at one point.  Correct me if I’m wrong here doll.” \n“In my defense I didn’t know a grown man’s voice could go that high or that loud so I’m gonna have to chalk that up to a scientific discovery and we all know how I feel about science.”  Tony says as he puts his now empty mug down and ignores the way Steve frowns at him when he shakes his head at the offered plate of pancakes.\n“You need to eat something Tony,” Steve’s at his side then, voice low and soft and just a shade off coaxing in that way he gets when he thinks Tony’s a hair away from being spooked.  He’s so close that Tony can feel his warmth and it hurts to have him right there and yet so far away in all the ways that matter.\n“Not hungry Cap-Attack,” Tony smiles at him when he says it but he’s careful to keep his eyes up and off of Steve’s hands just as he’s been avoiding looking at Bucky’s flesh hand too.\nHe can’t handle having their forget-me-nots shoved in his face right now.  Not so soon.\nHe’ll get over it in time, or he’ll bottle it up better because honestly that’s what he does, but right now he just … can’t.\n“Hey Stark,” Bucky grabs his attention again.  Tony turns towards him only to realize that Bucky’s attention is focused firmly on his hands and the now smooth, clear skin he’s sporting thanks to a liberal application of body paint.\n“What’s up buttercup?”  Tony asks and Bucky only looks up again when Tony shoves his hands into his pockets.  Even then Tony can see the question in his eyes, the question he refuses to answer or even acknowledge.\n“You need me and Stevie to get you anything?  We’re gonna make a game day run in a few hours.”  Bucky quirks a smile at him.\n“Ah,” Tony can’t help but wince as he purposefully turns his attention to where Thor and Sam are engaged in what looks like a stare-off over the last of the few waffles on the table.  “I’ve got to take a rain check boys.”\nThe entire room freezes.\nTony never misses game day and the entire team knows it.  Baseball has somehow become his and the Brooklyn Boy’s thing, even if he’s never had a real interest in sports in his life, and now it’s a standing not-date of sorts for them on Fridays.  Loaded down with junk food they sit together and slowly work Steve and Bucky up through every World Series game they’ve both missed out on over the years.\nIt’s slow going but fun.  Tony relishes every night spent with the three of them packed together on the couch in the common room, Tony in the middle watching amused and delighted as Steve and Bucky hurl abuse at the screen.  Sitting there and watching them bitch about calls made decades ago in games long since over is a gift he’d never thought he’d get.\nThey’ve ended battles with extreme prejudice in order to make game day.  Bucky once told a crowd of reporters to go fuck themselves to get out of an interview because of game day and Steve hadn’t even blinked.  Tony’s missed board meetings and galas for game day.  He’s told Pepper no for game days.\nTony hates to even think it but he knows that might have to change now, at least for a little while.  At least until he’s gotten a better handle on things.  Being there with them, safe and warm between them, is too much for him to handle at the moment.\n“Hey doll,” Bucky’s up and out of his chair then and crowding into Tony’s space just like Steve is, face creased lightly in concern, “what’s the matter?”\n“Nothing,” Tony shakes his head and keeps his expression as even as possible as he backs away from the both of them slowly, “don’t get your panties in a twist Coldstone, I’ve just got to head out of town for a bit.  I’ve got to see a Rhodey about a War Machine is all.”\nThat seems to make the both of them relax a bit even if Steve’s still frowning and Tony can see the rest of the kitchen watching the three of them like they’re a fucking soap opera or something.\n“We’ll wait then,” Steve tells him decisively as he and Bucky share a look.  “It wouldn’t be the same watching without you Tony so we’ll just wait until we can do it together.”\n“Sounds good,” Tony agrees softly before he clears his throat and reaches up to straighten his tie because he needs something to do with his hands before they do something stupid.  Like reach out to the two of them.\nOf course Steve’s eyes zero in on his clear hands just like Bucky’s did.\n“JARVIS is in charge while I’m gone so you all be good.”  Tony tells the room at large.  “And J you’ll keep everyone in line won’t you buddy?”\n“After years of practice at your side Sir I’m sure it’ll be simple enough.  You do, as they say, take so much looking after.”  JARVIS deadpans and Tony can’t help the genuine grin that breaks across his face because that’s his boy.\n“Lies and slander J, lies and slander.”  And then, with one finally wave, Tony beats a hasty and strategic retreat to the elevator and the promised safety of his more tangible armor.\nSteve and Bucky watch him go, identical frowns on both of their faces.\n~~~\nHe half lied to them of course.\nRhodey doesn’t need his help.  War Machine is up to date and fully functional.\nBut Rhodey’s his destination anyways.\nBecause when Tony’s lost, when he’s drifting and wounded and afraid, Rhodey’s where he goes.\nRhodey’s his safe harbor, his best friend, his brother.\nHe’s the one who knows just what Tony carries across his body.\nRhodey’s the one person with whom Tony’s never had to hide the fact that he carries war in his heart.  Not since that day so long ago at MIT when Tony had thrown his cuff down on the ground between them like a challenge.  Not since the day he’d stood trembling in front of Rhodey, ready to fight, to hurt and be hurt in turn, and Rhodey had reached out to him with gentle hands instead.\nNot since Rhodey saw him for what he was and still is and didn’t judge him for any of it\nSo, with forget-me-nots sprawling across his skin and a heart that feels cut to bleeding, Tony wraps himself in the armor and flies.\n~~~\n“What’s wrong?”  Rhodey asks as he takes one look at his face and steps to the side to let Tony inside, the door swinging shut behind the two of them.\nTony leaves the armor outside in sentinel mode although he isn’t really worried about the place’s security.  JARVIS has a remote uplink to Rhodey’s system and monitors the area constantly.  He’ll see any attack before it happens.  Tony’s always made sure that Rhodey would be as safe as possible wherever he stays when he isn’t with Tony and this is no exception.\n“Can’t I come see my favorite platypus without something being wrong?”  Tony wanders around Rhodey’s living room, hands drifting over the back of his couch as he makes his way over towards the bookcase on the far wall.\n“Theoretically?  Yes.”  Rhodey follows on his heels, chasing Tony just like he always seems to.  “But we both know something’s wrong so don’t bullshit me Tones.  Don’t think I didn’t notice that your hands are painted either and you haven’t done that in a long time so just spill already.”\nTony’s silent for a long moment as he stares at the picture frames that dot the bookcase, the same collection that travels with Rhodey wherever he goes.  There’s a lot of them too, more than most people would think Rhodey would have.  There’s his parents and his academy class, Pepper and Happy and various war buddies, old and new.\nMostly though there are pictures of him and Tony standing side by side, shoulder to shoulder, over the years.\nThere’s Tony at seventeen, a boy already half-destroyed, pressed against Rhodey’s side in front of the fountain at MIT.  One of Rhodey’s arms are around his shoulders and even Tony can see the way his body curves oh so protectively around Tony’s own.  Can see the way he’d pressed closer to Rhodey in turn, like a flower seeking out the sun.\nBeside it is another picture of the two of them, Rhodey dressed in his dress blues and Tony in a ridiculously expensive suit as they stand together.  Their smiles are practiced but their body language is still comfortable, their eyes are still warm.\nIt’s a pattern that repeats in all of the photos.\nComfort.  Safety.  Love.\nBecause God Tony loves him, loves him wholly and deeply with a red chrysanthemum kind of certainty, because Rhodey has always had his back.\nEven when Tony was lost in the desert, even when the rest of the world had been ready to count him out and write him off, Rhodey had still come for him.\n“I just need a few days,” Tony finally sighs as he turns back towards Rhodey, some of the composure he’d pulled around himself earlier that day finally cracking and falling down around his feet.  “Just … please Rhodey.”\n“Hey,” Rhodey’s face soften as he moves into Tony’s space to wrap a large, warm hand across the back of his neck, palm covering the clematis flowers that bloom there.  “Of course you can stay Tones.  Whatever you need.  You know that.”\nTony lets out a shuddering breath as his shoulders slump.\nHe leans forward until his forehead is pressed against the solid weight of Rhodey’s shoulder and tries his best to just breathe.\n~~~\nRhodey keeps him company the rest of the day and resolutely doesn’t ask what’s wrong again even though Tony can tell that he wants to.\nInstead they watch shitty movies and drink beer and banter back and forth.  The sun’s started to peek back over the horizon by the time they finally fall asleep, Tony sprawled across Rhodey’s chest on the couch just like they used to back at MIT.\nTony sleeps deeply because he’s warm.  Comfortable.  Safe.\nHe’s always safe with Rhodey.\nHe has a small juniper flower tucked away high on his right thigh that proves it.\n~~~\nIt’s afternoon before they wake up and Rhodey stumbles towards the kitchen to make coffee and lunch.  Tony heads for the bathroom for a shower because it’s been over twenty-four hours and his paint is beginning to flake off.\nPlus he won’t hide this from Rhodey, can’t.  Doesn’t want to.\nHe needs someone else to know.  Needs someone else to see the forget-me-nots on his skin.  He needs it in order to make this all feel a little more real and a little less like some kind of horrible fever dream.\nSo Tony scrubs himself clean and then wraps himself up in some of Rhodey’s clothes, a sweater and sweatpants that bag on him, before he shuffles into the kitchen.\n“Hey Ton-,” Rhodey turns, coffee cup in one hand and spatula in the other, only to freeze when he catches sight of Tony’s now clean hands.\nSilently Rhodey puts down the mug and his spatula, flicks the stove off and then moves around the counter until he’s hovering beside him.\n“When?”  The question’s as soft as the way Rhodey touches him, as gentle as the way he reaches out and takes Tony’s hands in his own, thumbs smoothing over his knuckles and the multitude of blue blooms he finds there.\n“About a week ago.”  It feels like both longer and less so all at the same time.  Like a lifetime ago compressed down into seconds somehow.\n“Rogers or Barnes?”  Because Rhodey knows him well enough that it’s a question of which one instead of a flat out who.\n“Both.”  Because Tony never could go small, especially not with things that had the power to destroy him.\n“You never could go small could you?”  Rhodey smiles but it’s soft and just a hair off pained.  “You three talked yet?”\n“They’re together.”  It hurts to admit it, to say it, but Tony’s used to pain by now and he has the flower-marks to prove it.  “There’s no room for me there Rhodey.  They’re better off without me trying to butt in on them.”\n“That’s bullshit Tony.”  Rhodey bites the words out, soft but fierce.  “That’s bullshit and you know it.”\n“They’re happy Rhodey,” Tony whispers with a shake of his head, “they’re so happy together and I don’t want to ruin that.”\n“You wouldn’t ruin it Tony,” Rhodey insists as his grip tightens just a bit on Tony’s hands, “you could be happy with them.  The three of you together.  These are proof that you would.”\n“I can’t.”  Tony tugs his hands away, takes a step back and rakes them through his hair as he begins to pace.  “I can’t … I can’t do that to them.  I’m not … you know what I am.  You know why I can’t.  No one wants somebody like me.  No one wants somebody with a heart filled with war.  Not for real.  Not for keeps.”\n“I do.”  Rhodey snarls as he steps forward, hands cutting a sharp line through the air between them.  “I do Tony, and so would Pepper and Happy and the rest of the team if they knew.  So would Barnes and Rogers.  We love you, you stubborn son of a bitch, and one day you’ll get that through your thick skull.”\n“That’s different.”  Tony scrubs his hands across his face roughly.  “That’s … that’s not the same Rhodey.  It’s not.  It’s not forget-me-nots love.”\n“It’s really not that different Tony.”  Rhodey denies.  “And I hate the fact that you’ll never believe me.  That no matter how long we’ve been friends, brothers, this is the one thing I’ll never get you to see.  I don’t want to watch this tear you apart Tony.  Please don’t make me.”\n“I’ll fix it.”  Tony reassures him.  “No one else has to know.  No one else will know.”\n“That’s not going to work forever Tony.”  Rhodey protests.  “Somehow, someway, someone’ll find out eventually and that’ll change things.”\n“I’ll keep it a secret.  Nothing has to change.”  Tony vows and he feels the icy burn of a flower-mark being etched into his skin but he ignores it.  Tony sounds desperate even to himself because he knows Rhodey’s right and all he’s doing is lying to himself if he thinks otherwise for even a second.  It’s that future change that scares him though because when he thinks about it all he can see is loss.\n“You’re wrong about them Tony.  About this whole thing.  But I also know I can’t change your mind.”  Rhodey finally sighs and it sounds fond and exasperated and just a bit sad all at the same time.  “You’re right about one thing though.  I do know what you are, who you are.  I’ve always known.  It’s you who doesn’t see it Tony.  It’s you who doesn’t have a goddamn clue about who or what you really are and I’ll hate Howard Stark until the day I die for doing that to you.”\n~~~\nLater that night Tony goes to the bathroom and tugs the collar of his stolen sweatshirt down.\nThere, nestled in the hollow of his throat between the death filled cypress flowers that dot his collar bones, is a single perfectly shaped deadly nightshade blossom.\nA testament to his silence.\n~~~\nTony stays with Rhodey another night.\nThere’s sixteen missed calls on his phone and thirty text messages split evenly down the middle between Steve and Bucky both.\nTony doesn’t answer any of them.\nHe can’t.\n~~~\nIt’s the middle of the night when Tony’s finally gets ready to leave and fly back to the Tower.\nRhodey stops him at the door.\n“You remember what I’ve got right here don’t you?”  Rhodey asks him as he takes Tony’s freshly painted hand and presses it against the curve of his right shoulder.  “What showed up when you were missing?”\nTony nods silently because he still remembers how he’d felt the first time he saw the large zinnia that dominated Rhodey’s shoulder after he’d escaped and Rhodey had found him.\nThoughts of absent friends, proof that Rhodey had searched for him endlessly while he’d been missing.\n“And here?”  Rhodey moves his hand, presses it against his shirt, high up on his left rib cage.\n“Yeah.”  Tony swallows hard because he knows that Rhodey has a huge bundle of alstroemeria flowers there, the colors brilliant against his skin.\n“They’re yours.”  Rhodey tells him gently.  “Showed up the night after you showed me your heart-flower.  They’ve always been yours Tony and they always will be.”\nTony blinks back the tears in his eyes.\nAlstroemeria.\n\nDevotion.\n\nAt least he’ll always have this.\nAt least he’ll always have Rhodey.\nGod knows what he’d do otherwise.\n~~~\nTony arrives to a quiet Tower.  It’s late and he’s unsurprised by the fact that everyone’s more than likely asleep.\nHell he’s almost grateful.\nIt’ll give him just a little more time to pull himself together.\nStill he’s sort of unsurprised to see Natasha sitting at the kitchen bar when he wanders in for something to drink before heading down to the workshop.\nShe watches him pour his cup of coffee in silence for a long moment before she finally speaks.\n“You’re painting again.”  She stares at him over the rim of the mug he knows holds her favorite jasmine tea, eyes flicking between his hands and his face.\n“Tasha.”  Tony says her name softly but the warning, the plea, it holds is clear.\n“Tony,” Natasha sighs and it might be the look in her eyes but in that moment Tony knows that she knows.  She knows about the forget-me-nots even if she doesn’t know about the rest.\nShe’s always seen far more than any of them, even Clint who can be shortsighted in the simplest of ways at times.\nShe slides off her barstool, sits her cup down on the bar with a quiet clink, and pads her way over to him.  She stares at him for a moment before she brings a hand up and carefully, gently, cups his cheek in her palm.\n“You shouldn’t hide Antoshka,” Natasha tells him softly as she smooths the pad of her thumb across the arch of his cheek, “not from us.  Not from them.”\nHer hand lingers on his face for a moment as she steps away from him.\nTony watches her leave in silence.\n~~~\nTony barely sleeps that night, only catches a few restless hours filled with haunting dreams.\n\nIn his dreams he sinks further and further beneath ocean waves tinted forget-me-not blue.\n\n\nAbove him Steve and Bucky dance across the surface of the water, hands entwined and eyes only for each other.\n\n\nTony breathes deep and lets the water take him.\n\n~~~\nTony walks into the kitchen late the next morning just in time to catch Steve and Bucky kissing, their forget-me-not covered hands entwined as Steve leans back against the counter with Bucky pressed against his front.\nTony’s heart clenches because they look so good together.\nThey look like everything he’s ever wanted.\nAnd everything he’ll never have.\nIt hurts.\nSteve sees him first and the way he smiles, bright and warm, feels like a blow to the chest.  The way Bucky turns in his arms and does the same hurts just as bad.\n“Tony, you’re back.”  Steve’s the one who calls his name but the both of them move together like they planned it.\n“’Bout time too,” Bucky’s the one who gets to him first though, is the one who slings an arm around his shoulders and pulls Tony close to his side.  “Thought we were gonna have to send out a search party doll.”\n“How’s Rhodes?”  Steve asks as he reaches out and ruffles Tony’s hair.\n“Rhodey’s fine, still the apple of my eye, the wind beneath my wings etcetera, etcetera.  But, enough about him because I’ve got work to do so I’ll see you two later.”  Tony reassures them as he ducks out from under Bucky’s arm and away from Steve’s reaching hands.\nHe can’t handle the way they touch him right now, all soft and casual and goddamn torturous because they’re both surprisingly handsy little shits and it doesn’t mean anything.  He might not ever be able to handle it again.\n“Stark?”  Bucky’s voice calls after him but Tony doesn’t stop.\nHe can’t.\nIf he does he’s sure he’ll do something he’ll regret.\nLike beg them to love him.\n~~~\nIt goes on like that for a while.\nTony does his best to put some distance between himself and the two of them.\nHe skips game day again the next week, spends every waking moment they’re not on call in the workshop buried in one project or another with the music turned up to screaming.  He skips meals and movie nights and when Natasha or Clint or Bucky threaten to physically drag him out he sits beside Bruce or Sam or, on one memorable occasion, Thor instead of between the two of them the way he normally does.\nHe does his best to ignore the way they stare after him, their expressions just a bit confused, just a bit hurt.\nThey’re all courageous black poplar and constancy filled bluebells through and through.\nHe’s war-torn yarrow down through to his soul.  He has battles written out across his skin and etched out onto the very heart of him.\nIt’s better this way.\nFor him.\nFor them.\nIt’s just … better.\n~~~\nBut, just like Rhodey said, no matter how hard he tries Tony can’t keep the secret forever.\n~~~\nTony’s fresh from the workshop shower, because DUM-E had gotten a bit too enthusiastic with the fire extinguisher again, when the call to assemble comes.\nIt’s HYDRA and Tony feels a chill shiver down his spine the way it always does when they come up against them.  All he can think about is Bucky and what they’d done to him, what they’d do if they got their hands back on him or on any of the team they could successfully subdue.\nTony can’t, won’t, let that happen.\nHe doesn’t waste time reapplying his paint, or long-sleeves.  Instead he just steps into the armor in only his jeans and t-shirt and flies.\nGetting there quickly, making sure his team is safe, is more important than hiding at the moment.\n~~~\nThe battle’s brutal.\nHYDRA unleashes a wave of some kind of new mechanical menace on them that they’ve never faced before.  The things are like something out of an old H.G. Wells novel, all long thin legs and optical centers that shoot fucking lasers.  Obviously words like subtle and original are not bullet points on their engineering sector’s ‘Indoctrination and You’ slideshow.\nTony zips around the battle field calling out numbers and formations that are supplemented by Hawkeye and Falcon both as he fires repulsor blasts and smaller caliber armaments.  Thor is all booming laughter as he fights side by side with a roaring Hulk.  Cap and the Soldier fight back to back as always while Widow darts in and out of cover with a grace to be envied.\n‘Beautiful’, Tony can’t help but think as he swoops down to grab Hawkeye right before his position can be compromised.  Hawkeye barely even acknowledges him and keeps on shooting even as Tony grabs him by the back of the harness he wears for just this reason and lifts him up.\n‘Yeah,’ Tony thinks again at the blatant show of trust, ‘beautiful.’\nHis team is a bunch of gorgeous fuckers and the way they move on a battle field nowadays is nothing short of poetry in motion.  They’re like one large well-oiled machine, each part working in tandem in a way that makes Tony’s engineering heart sing.  Each one of them is necessary to the flow and rhythm of the team now, even him, and that’s something he would have never thought possible.\nThere’s very little that Tony wouldn’t give to keep this, to keep them.\nThat, among other reasons of course, is why when he sees the laser cutting through the ground in Cap and the Soldier’s direction, he doesn’t even hesitate.\nHe just moves.\nTony has to bite back a scream at the pain as the laser clips him in the side and sends him flying.\nHe hears a familiar roar, feels hands pulling at his faceplate, feels the sun on his face and a hand cupping his cheek.\nTony manages to pry his eyes open but when he looks up all he sees is blue.\nThen black closes in around the edges and he doesn’t see anything at all.\n~~~\n “-ony.  Stay still.”  The voice is familiar, comforting, but Tony can’t place it for some reason.  His head hurts too bad and the lights and the noise are only making it worse.  He wants it to stop.  “No, Tony, don’t move.  We’re gonna get you to a doctor.  You’ll be okay Tony, just … just stay still.”\nTony feels panic shoot through him.  He can’t go to a doctor.  They’ll see.  He can’t … they can’t … no one can …\nThere are hands on him again, three warm and one cool, they press him back down and hold him there and Tony’s just too tired to fight them, too tired to win.\n“It’s okay sweetheart,” the voice is rough but the hand that runs through his hair is gentle, careful.  “Everything’s going to be okay, we’ll take care of you.”\nTony sleeps again.\n~~~\nTony wakes slowly.\nHis head hurts but it’s not the vicious, sick pounding it was before.\nStill, for a long moment, he’s confused as to why he’s lying in what’s obviously his bedroom without being able to remember how he got there.\nThen, in a rush, it all comes back to him.\nThe battle, the laser, jumping in front of Steve and Bucky.\nThe pain.\nThe voices and the hands, gentle as they held him down, kept him from moving and smoothed back his hair.\nTony blinks once, twice, squeezes his eyes closed hard to try and fight the way sleep clings to him and then forces them back open again.\n“Stevie, he’s awake.”  Bucky’s voice, low and hoarse, comes out of nowhere.\nTony jolts, hisses out a sharp breath when his ribs flare in pain and turns to look towards his right.\nThere, sitting on the floor beside his bed despite the perfectly good couch pressed against the window on the far side of the room, are Steve and Bucky.\nThey’re both red eyed and tired looking, Bucky’s hair is down from the bun he normally wears it in and Steve’s is falling across his forehead like he hasn’t bothered to brush it back.\nThey’re so beautiful it makes Tony ache.\n“Tony,” Steve sighs his name out and both of their shoulders seem to slump in relief as they push up off of the floor and move until they’re standing together at the side of his bed.  “It’s good to see you awake.”\n“You’ve got a couple of cracked ribs,” Bucky cuts in, blunt as always, “and a busted suit.  What in the hell where you thinking you idiot?”\n“Buck.”  Steve scolds halfheartedly but Bucky shoots him a dark glower and keeps on going.\n“You know I’m right Stevie.  He could’ve got himself killed.  We could’ve lo-”  Bucky cuts himself off but Tony sees the way Steve nods just so at Bucky’s words, sees the anger and the worry that are plain on both of their faces begin to rise.\n“Had to keep you safe,” Tony rasps out before they can get any more worked up.  He’s too tired to be anything but honest at the moment.  Too tired to even try and hide from them on this like he normally would.  He’s just … tired.\nThe fight seems to leave the both of them as quickly as it had come.\n“We know Tony,” Steve sighs as he sits down carefully on the edge of the bed by Tony’s hip.  Bucky presses closer to his side until Steve can rest his head against his stomach.\nTony forces himself to look away and when his eyelids begin to droop again he welcomes the feel.\n“Go to sleep doll,” Bucky tells him softly, “we’ll take care of you.”\n“Hmm.” Tony hums and does just that.\n~~~\nTony’s clear headed when he wakes up again and horribly/blessedly alone.  He grits his teeth against the pain in his ribs when he struggles his way upright until he’s propped against his pillows.\nOf course that’s when the panic hits him hard.\nHe’d been in a t-shirt when he’d suited up, he’d been cuff-less and unpainted, vulnerable and open and they would have all seen …\nTony looks down at his hands and his brain stalls out for a moment because they’re blank below the sleeves of the long sleeved undershirt he’s wearing.\nHis clothes have been changed and his hands have been painted.\nThere’s a small knock on his door just then and it opens slowly when Tony calls out for whoever’s there to come in.\nIt’s Bruce, hair fluffy as always and glasses perpetually askew.\n“Hey Tony,” his slight frown eases when he sees Tony sitting up and so obviously alert.  “It’s good to see you awake.”\n“Good to be awake again.”  Tony hesitates for a second before he raises his hands up to flash his nicely painted skin in Bruce’s direction.  “You got an explanation for this?”\n“We managed to pack the fight up pretty quick after you went down,” Bruce shrugs as he moves closer to Tony and settles down on the side of the bed.  “The Other Guy wasn’t happy with his favorite person getting hurt.”\n“What can I say,” Tony can’t help but tease, “he’s got excellent taste.”\n“Yeah he does,” there’s something soft and gentle in Bruce’s expression when he agrees.  “Anyways, JARVIS was still operational in the suit so he tapped the com, told everyone you were fine according to his scans except for your ribs.  It was a close call though Tony, a few inches deeper and that beam would have sliced right into you.”\n“Better me than them,” it’s all Tony can think to say because to him it really is that simple.\nBruce sighs, reaches up to pinch at the bridge of his nose beneath his glasses, and shakes his head slightly.\n“We got you back to the Tower and me and Thor got you out of the suit, got your ribs wrapped, clothes changed and hands painted.”  Bruce admits.\n“So are you … are you the only ones?”  Tony clears his throat roughly.  “The only ones who knows?”\n“Yes.”  Bruce ducks his head in a slight nod.  “The others … well no one wanted to leave you but we all know how secretive you are about your flower-marks so we figured it would be better that way.  Thor can’t read them the way we can and you know I won’t say anything.”\n“Oh.”  Tony feels a rush of relief that’s mixed with wonder.\nThey’d all had the opportunity to look, to see what they’ve all been so curious about, and they hadn’t.  He’d been injured and unconscious and conveniently bare in a way he so rarely was and they hadn’t looked.\nThey hadn’t taken that choice from him.\nOnly Bruce and Thor knew.  Tony was positive that Bruce would hold the secret for him and Thor lacked the proper context to truly understand what he’d saw, only that it was private.  Tony knew that the god, for all his open and jovial demeanor, knew how to keep a secret as well.\n“I would’ve stayed with you last night just to be sure you didn’t have any problems but well …” Bruce looks slightly sheepish then as his gaze flicks down towards Tony’s covered chest, “I needed some time in the containment room afterwards and Steve and Bucky were happy to volunteer to keep an eye on you.  They’d still be here now if Natasha and Sam hadn’t dragged them away.”\nThere’s a long beat of silence as Tony absorbs the information that’s just been dumped on him.\n“I’m sorry,” Tony says the words slowly, hesitantly, “that you had to see that.  I know it’s … I know I’m … I’m not …”\n“There’s nothing wrong with you Tony,” Bruce’s tells him as he pushes back up onto his feet and begins to pace, voice hard and certain in a way that Bruce rarely is in casual conversation.  But then this is the furthest thing from casual.\n“How can you say that?”  Tony asks him, taken aback and just the slightest bit angry because he hates being lied to.\n“Because it’s true.”  There’s the slightest flush of green on Bruce’s cheeks.  “You took me in when most everyone else would have run screaming in the other direction.  You gave me a home Tony, a family.  And not just me either.  You did that for all of us.  Monsters, murderers, soldiers and gods alike.  Do you think any of us are going to care what heart-flower you carry?  What kind of flower-marks you have?  We all know exactly what and who you are and nothing is ever going to change that.”\nAll Tony can do is stare up at him as the burn of a new flower-mark etches its way across his skin.\n“We’re in this together now Tony,” Bruce says once he’s calmed down a bit, “and hopefully one day you’ll trust us all enough to see that.  But until then we are, all of us, willing to wait.”\n“Bruce …”\n“Don’t.”  Bruce holds up a hand to head him off.  “I don’t need an explanation right now.  I’m smart enough to connect a lot of dots Tony and it … well I’d rather you tell me on your own time.”\nTony swallows hard, nods, and ignores the way his eyes feel just the slightest bit moist.\n“But Tony?”  Bruce waits until he looks up at him again and then he reaches out and presses his fingers to the back of Tony’s hand where they both know forget-me-nots are hiding beneath his paint.  “I really do think you should tell them.  Both of them.  I think it might go better than you’re expecting.”\n~~~\n“Are you in need of assistance Sir?”  JARVIS asks softly but Tony just waves him away as he slowly, carefully, levers his way up and off of his bed after Bruce leaves.\nHe shuffles his way into his bathroom and towards the giant mirror that dominates the wall.\nThere on the right side of his neck, too high for his shirt collars to completely cover, is a single perfect flowering almond.\nHope.\n~~~\nTony keeps to his bed for the next two days.\nNormally he’d be going out of his mind but he finds himself distracted.  There seems to have been a rotating door installed in his bedroom because the team comes and goes constantly while he’s in bed.  Beyond that there’s the constant presence of Steve and Bucky who very rarely leave once they come back to distract him.\nStill, long sleeves in place, hands and neck carefully painted, Tony’s mind whirls.\nAnd, despite his best efforts, hope continues to unfurl in his heart.\n~~~\nIt takes two more weeks before Tony finally breaks.\nHis ribs are only mildly sore and he’s finally well enough to shower freely thankfully.\n“Sir Captain Rogers and Sergeant Barnes are requesting entry to your room.”  JARVIS grabs his attention where he’s standing in front of his mirror.\nTony hesitates for a long moment.\nHe’s naked except for the red silk boxer-briefs he’s wearing that ride low on his hips.  All of his clothes are all in his closet but all of his paints are in the bathroom.  He could easily tell the two of them to wait, could easily take the time to dress and cover up and keep his secrets for another day.\nTony almost tells JARVIS to have them wait when he looks at himself again in the mirror.\nThe hopeful flowering almond on his neck seems to mock him.\nAnd that’s when he remembers that they hadn’t taken his choice from him when he’d been hurt.  They’d made sure his secrets were still his own despite their curiosity.\nThat’s more than most would have done.\nAnd, truthfully, Tony’s tired.  He’s tired of hiding, tired of lying, tired of running.\nHe carries war in his heart and pain on his skin and forget-me-nots that he has no right to and he’s just so goddamn tired.\nMaybe this would be best.\nMaybe letting them see would end all of this suffering.\nMaybe they’d leave him alone, would stop inadvertently tormenting him with something he’ll never have no matter what Rhodey or Natasha or Bruce says.\n“Let ‘em in J.”  Tony says even as he wraps his towel loosely around his waist.\n“Very good Sir.”  Tony knows he isn’t imagining the hint of approval he hears in JARVIS’ voice.\n~~~\n“-ay something to him Stevie.”  Tony can hear Bucky when he gets closer to the bathroom door, voice low and harsh.  “We’ve waited too long.”\n“I know Buck,” Steve sounds earnest.  “I just didn’t want to rush him is all.”\nTony takes a deep breath and pulls the door open before they can get any further into the argument they’re having.  He wants to do this quickly, wants to get it over and done with so he can go somewhere and lick his wounds in private.\nBucky and Steve both turn towards him when he steps out into the room.\nFor a moment both of their faces are a study in surprise at the sight of him shirtless, skin and all it bares uncovered and there for the viewing.\nTony sees it the moment his heart-mark and the flower-marks he’s covered in register with both of them.\n“Tony,” there’s a catch in Steve’s voice and his eyes are glued to the swath of yew and oleander mixing with helenium and Judas tree flowers that dominates his right side, his own personal tapestry of sorrow and pain mixed with betrayal and tears.\nA childhood, a lifetime, written across his skin in too honest colors and blooms.\nHis entire history there for the world, for them, to see.\n“Doll,” Bucky’s face is blank and almost cold except for how his pale eyes burn when they rake their way over his skin.  Over the citron flowers woven between cardamine and morning glory vines that are settled across his shoulders.  Over the cypress blossoms that highlight his collarbones, the deadly nightshade nestled in the hollow of his throat.\nSadness woven between paternal error and extinguished hopes.  Death framing his throat with delicate little blooms and his vow of silence forever held between them.\nHe sees the shock and horror etch themselves across their faces in real time.\n“So.”  Tony tilts his chin up, squares his shoulders, and braces himself as best he can.  “Now you know.”\n“Who?”  Steve’s the one who chokes the question out while Bucky stands at his side, hands curling and uncurling into tight fists.\n“Howard didn’t like me much,” Tony tells them with a small shrug because it’s the truth and an understatement all at once but he doesn’t know what else to say.  Doesn’t know if there is anything else to say.  He just … doesn’t know.  “He liked to make sure I knew it.”\n“Howard … he did this to you?”  There’s something like shock and rage mixed on both of their faces as Bucky grits the question out.  “Why?  Why the fuck would he?  How could he?”\nTony gives him a slightly sardonic smile and raises a hand up to tap a forget-me-not covered finger against his heart-flower.\n“He had his reasons.”  Tony presses a palm over his heart-flower, covers the yarrow blossoms with a hand that shakes just a bit.  Tries his best to hide his heart of war.  “I would have changed it if I could of course, but that’s obviously not possible.”\n“What?”  Steve looks stricken and Bucky doesn’t look much better, face twisted into a scowl.  “Why?”\n“No one wants someone like me,” Tony tells them the truth that’s haunted him his entire life.  “No one wants a kid with a heart filled with war.  It’s something Howard and Maria could never forgive me for.  Especially Howard.”\n“Fuck that.”  Bucky spits and then he’s moving.  He strides across the room until he’s right up in Tony’s face, until Tony can feel his warmth like a solid wall against his front.  Bucky brings a hand up and grips his hip softly.  “That’s bullshit doll because I want you and so does Stevie.  We both do and I’m tired of waiting.”\nAnd then Bucky kisses him.\nTony’s frozen for a moment, unable to process what, exactly, is happening.  A part of him is crying out that this is wrong, that he needs to back away, needs to stop this from happening because Bucky belongs with Steve and there’s no room for Tony between the two of them.\nBut then Bucky sucks at his bottom lip, scrapes it gently with his teeth, and Tony is gone.  His mouth opens beneath Bucky’s with a low moan as Tony leans forward into his warmth.\nIt’s good, so good.\nThe press of Bucky’s tongue, the taste of him, the plush feel of his lips.  His heat, the way he groans low in his chest when Tony sucks ever so lightly on his tongue.\nTony loses himself to all of it the way he’s never allowed himself to with another kiss.  He kisses back with a desperation he’s never felt, with a hunger he’s never had because if this is his only chance to have this then he’s going to take all he can with him when he goes.\nBucky goes to pull back a long moment later but Tony can’t help but lean forward some more, to press up onto his tiptoes and chase after him.\nBucky husks out a chuckle and kisses him again, languid and deep like he can’t help it any more than Tony can.\nMovement catches Tony’s attention and he breaks the kiss with a sharp breath because it’s Steve.  Steve who has come up to them now, who’s hovering by Tony’s side, face flushed and blue eyes wide.\nTony takes in a deep breath, tries to gather his thoughts, tries to apologize, to say or do anything but Steve doesn’t give him a chance.\nInstead Steve steps forward and slots himself against Tony’s back, hands gripping his ribs lightly, carefully, as he pulls Tony closer, until Tony’s pressed snugly between the both of them.\nAnd then Steve leans down and kisses him too.\nWhere Bucky was languid and deep Steve is brazen and bold.  He nips where Bucky had sucked, presses deeper into Tony’s mouth with a rough kind of abandon that threatens to sweep Tony away.\nTony presses up onto his tiptoes again, desperate to get closer as he brings a hand up and back to tangle in Steve’s hair.\nBucky isn’t idle either, he presses closer to Tony’s front, hands still on his hips, and leans down to latch his mouth onto the vulnerable curve of Tony’s neck and suck.\nTony breath hitches and he shudders as his knees immediately go weak.\n“Bucky’s right.”  Steve rasps when he finally breaks the kiss.  “We both want you Tony.”\n“You can’t.”  It’s one of the hardest things Tony’s ever said because he wants this.  God he wants it so bad.  “You can’t.”\n“Why not?”  Bucky pulls back and away from his throat then so he can look down at Tony too, face flushed and eyes blown wide.  “Why can’t we have this, you, each other?”\n“I’m no good.”  Tony’s heart feels like it’s going to beat out of his chest.  “I’m no good for either of you.  Just look at me.  Look at what I’ve been carrying around since I was a kid.  I’ve got war in me and you two deserve so much better than that.  Better than me.”\n“We’re looking and you’re beautiful Tony,” Steve presses his lips softly against Tony’s temple, “God you’re so fucking beautiful.  You feel so much, so deeply, and it’s all right there on your skin.  I’ve never seen anything like it.”\n“My heart-flower,” Tony tries to protest.\n“Is perfect Tony,” Steve cuts him off again.  “You’re so strong and that’s proof of it.  You’ve fought so long and so hard sweetheart.  You’ve fought so many wars on so many different fronts.  It’s no wonder why that’s the heart-flower fate chose for you.  But you don’t have to do it alone anymore.”\n“You’ve got us now,” Bucky agrees, “the team and me and Stevie in particular.  Besides, these right here,” Bucky raises a hand off of Tony’s hip and uses it to trace a path down a line of forget-me-nots that’ve wound their way down Tony’s arm, “these are one of the most beautiful things I’ve ever seen doll and I’m willing to go back to war if I have to in order to keep them.  Do you wanna know why?”\nIt takes all Tony has to nod in answer.\n“It’s because I think these belong to me and Stevie,” Bucky tells him with a wicked smile, “because I know mine and his belong to you just as much as they belong to each other.”\nTony’s entire world freezes.\n“What?”  The questions little more than a whisper because he can’t believe what he’s hearing.  He can’t bring himself to because if he’s wrong, if it’s a dream or a hoax, then Tony will break in ways that’ll never be fixed.\n“You heard me Stark,” Bucky’s eyes are intense but there’s a small smile flirting with the corner of his mouth as he glances up and shares a look with Steve over Tony’s head.\nThey both press closer to him until there’s not an inch of space left between them and together they lean down until they can both speak directly into one of his ears.\n“I love you.”  Steve and Bucky say together, the words presses as soft and gentle as flower petals against his skin.\n“Oh God,” Tony practically sobs, “I love you too.  I love you too.”\nTony jolts just a bit as the familiar burn of flower-marks begin to etch themselves across his skin.\nHe ignores them though.\nHe’s too busy being kissed again.\n~~~\nLater, a long time later, when the three of them are sweaty and sated, Tony lays on his back in the center of his bed.\nSteve and Bucky are on either side of him and their attention is firmly on his skin.\nBut they aren’t focused on his heart-mark.  They aren’t focused on his countless flower-marks and the pain a great deal of them speak of.\nNo, instead Steve’s brushing his fingertips slowly, reverently, across the newly blossomed black poplar flower that’s been etched onto the previously blank spot high on Tony’s ribs.  Bucky’s stretched out on his other side and is busy brushing his lips across the bluebell that’s unfurled across Tony’s right hip.\nCourage and constancy amidst the forget-me-nots of true love.\nSteve and Bucky etched out across his skin.\nHis.\nBecause he can have this apparently.\nBecause it’s always been his, just waiting there for the taking.\n~~~\nThe next morning Steve kisses the both of them goodbye when he slips out of bed.  An hour or so later Tony and Bucky cling to each other as they stumble into the kitchen where Bruce and Steve are cooking breakfast and the rest of the team, his family, is already huddled around the table.\nTony’s shirtless just like Bucky is, flower-marks on full display, but for once he doesn’t care.\nNo one says a word.\nThey all just smile at him, some of them sadder than others when their eyes trace over what he’s bared.\nBut no one sneers, no one turns from him in disgust or fear or hatred.\nNo.\nInstead they smile, they welcome him with warms eyes and bright laughter and gentle hands.\nTony feels as if he’s just come home again for the first time in years.\n~~~\n“You were right,” Tony tells Rhodey one night over a video call and even he can hear the awe in his own voice.\n“I normally am Tones,” Rhodey’s smile is soft and loving and everything he’s always been for Tony, “I normally am.”\n~~~\n“I love you,” Tony whispers the words one morning weeks later, “both of you.  So much.”\nThe sun’s streaming in through the windows and its pouring beams of light across his, their, huge bed.  Still asleep and sprawled out on either side of him, Steve’s all warm Irish skin and Bucky’s a sweetly tanned light bronze.  Each one of them has a hand stretched out in his direction like even in their sleep they want to touch him.\nTony’s never loved anything or anyone like he loves the two of them in this moment.\nHe knows that he’ll never love anything or anyone like he’ll love the two of them in the next either.\n“I love you.”  He says it again, louder this time but just as true even if they are both still asleep.\nThe way matching vines of honeysuckle blossom across Steve’s left rib cage and Bucky’s right shoulder makes him sure that they hear him anyways.\nBonds of love indeed.\n~~~\nThat night Tony throws all of his paints away.\nHe has nothing left to hide.\nHis heart walks on either side of him every day now anyways.\n~~~\nMonths later Tony spends hours bent over Bucky’s arm painstakingly etching delicate forget-me-nots one by one into the metal with steady hands.\nBucky kisses him between every one while Steve sits on the couch in the corner watching them, sketchbook in hand.\nWhenever he looks at the two of them huddled together by Tony’s workbench he smiles.\n~~~\nTony has yarrow in his soul, has a heart filled up with war beating fast and hard in his chest.\nThere’s no denying that.\nHe was born with it and he’s carried it his entire life.\nBut he has other things now too.\nHe’s a tapestry of blooms, an ocean of blossoms.\nAn ever growing garden.\nBecause every time Steve and Bucky kiss him another tiny blossom etches its way onto his skin until some of his flower-marks almost overlap.\nBecause Steve and Bucky carry war on their skin now too, yarrow flowers blooming around both of their heart-flowers like a protective wall.\nBecause every dark and painful memory he has isn’t gone, flower-marks can’t be erased after all and the past can’t be changed, but they’re all touched by something lighter, something brighter and better now.\nNow faithful violets sprinkle their way down each of his toes and mingle almost playfully with the sea of yellow carnations that scream denial across his back.\nNow the pure and ardent love of roses both red and pink twine their ways across his ribs and shoulders, poking through decades of sorrowful yew and mourning filled cypress and sad citron flowers.\nNow tiny myrtle flowers shout their love as they twine delicately between the death filled cypress blossoms that dot his collarbones.\nNow honeysuckles sneak out between the hemlock that encircles the reactor, bonds of love etched out and around what had once been the source of his certain death.\nAnd, above all else, he has the one thing he’d never thought he’d have.\nForget-me-nots, an ocean of blue intertwined throughout everything else.\nMore of them than even he could ever count.\nTrue love etched out across his skin for all the world to see."
}