{
    "id": "818371",
    "url": "https://archiveofourown.org/works/818371?view_full_work=true",
    "author": [
        "apocryphal"
    ],
    "title": "Daddy Do's",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Teen Wolf (TV)"
    ],
    "relationships": [
        "Derek Hale/Stiles Stilinski",
        "Kate Argent/Derek Hale",
        "Allison Argent/Scott McCall"
    ],
    "characters": [
        "Derek Hale",
        "Lydia Martin",
        "Stiles Stilinski",
        "Erica Reyes",
        "Laura Hale",
        "Jackson Whittemore",
        "Vernon Boyd",
        "Isaac Lahey",
        "Talia Hale",
        "Scott McCall",
        "Allison Argent"
    ],
    "additional_tags": [
        "Kid Fic",
        "Single Parents",
        "Flirting",
        "Fluff",
        "Crushes",
        "YouTube",
        "Epilepsy",
        "Hand Kink",
        "kid!Lydia",
        "Kid!Erica",
        "Daddy!Derek",
        "daddy!stiles",
        "Hair Braiding",
        "Podfic Available"
    ],
    "language": "English",
    "series": "Part 1 of Our Four-Stranded Braid",
    "published": "2013-05-27",
    "completed": null,
    "words": "8,065",
    "chapters": "1/1",
    "comments": "363",
    "kudos": "8,498",
    "bookmarks": "1,405",
    "hits": "133,130",
    "summary": "<p>“Hi Mr. Stilinski!” Lydia said pertly. “My name’s Lydia, and this is my daddy. His name is Derek Andrew Hale and he watches all of your videos on YouTube a lot, but he still can’t braid.” </p>\n<p>[Stiles is a celebrity YouTube hairstylist. Derek may or may not have a crush. Lydia just wants a French braid for school picture day.]</p>",
    "notes": "<p>Daddy Do's is a term a stolen from <a href=\"http://www.cutegirlshairstyles.com/\" rel=\"nofollow\">Cute Girls Hairstyles</a>, which is actually the YouTube channel that this story is based off of. They have a lot of super-cute, easy-to-do hairstyles, and I definitely recommend that you check them out.</p>\n<p>Beta'd by the ever-wonderful <a href=\"https://archiveofourown.org/users/verity\" rel=\"nofollow\">verity</a>, who betas for all the cool famous people on AO3 and for some reason me too.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Jackson was very insistent that he was old enough to not use the child potty seat attachment. Turns out, he was definitely not.</p>\n<p>(Come say hi on <a href=\"https://the-apocrypha.tumblr.com/\" rel=\"nofollow\">Tumblr</a>!)</p>",
    "text": "“And you add in another section of hair to the right side, bring the whole thing into the middle—just like your normal, three-strand braid—and switch hands because we’re moving to the left side now. And add in another section of hair from the left, bring the whole thing to the center. And repeat. Over and over and over, all the way down.”\nThe camera focused in on the long, nimble fingers braiding the little girl’s blonde hair, creating an even, tight, straight French braid down the back of her head. It was hypnotizing.\n“And then when you’ve got all of her hair in the braid,” Mr. S continued, “just start braiding it like you would a normal, three-strand braid all the way down to the bottom. Then tie it off with a hair tie, and you’re done! Go you!”\nMr. S was in his late twenties or early thirties, with brown eyes, devil-may-care brown hair that never had a strand out of place, a stupidly bright smile, and long, graceful fingers.\nHis young daughter, Little S, was seated on the counter of the bathroom as her father braided her hair. You could see her own bright grin and matching brown eyes in the mirror. She held up a polk-adotted blue ribbon, waving it back and forth until Mr. S took it from her.\n“And—just because Little S loves her bows—I’m going to tie her a nice big blue one at the very end,” Mr. S added, tying the ribbon into a perfectly balanced bow with his stupidly magic fingers. “And that’s it! The French braid. Be sure to check out our channel for other basic braiding videos, or for some more advanced stuff if you’re feeling up to the challenge. Thanks for watching Daddy Do’s!”\nThe video ended, and squares of other YouTube videos popped up on the now-black screen.\nDerek stared down at his own daughter’s hair in despair.\n  \nHe could braid.\nOr, well, he’d thought he could braid. He’d learned to do a three-strand braid with strips of leather in Cub Scouts, and it transferred to hair easily enough, so that was that. Braiding. But then Lydia had started kindergarten and all he’d been hearing for the last month was, “I want princess hair. The other girls have princess hair, and I want princess hair, too, because I’m a princess! Aren’t I a princess, Daddy?”\nSo Derek found himself plunged into a world of hair-braiding. And Jesus Christ, who knew there were so many different types of braids? French, Dutch, lace, waterfall, fishbone, English, rope, twists… And then you could do them in all manner of patterns and directions across the scalp.\nThen he’d found Daddy Do’s.\nDaddy Do’s was a YouTube channel made by a cute guy under the pseudonym Mr. S, and his daughter Little S, with over a hundred videos on “hairstyles made easy, so even we dads can do them.” His videos ranged from simple how-to-French-braid to elaborate wedding hairstyles that Derek had no hope of ever creating (but he’d still watched the videos, ostensibly for Lydia but actually because Mr. S had ridiculous, hypnotizing, magical fingers).\nMostly, he stuck to the “cheat hairstyles”, which were designed for people like Derek who could not master anything more complicated than a ponytail or a simple braid.\nUnfortunately, Lydia was no longer satisfied with that.   \nAnd Derek was going to learn to French braid if it killed him.\n \n“Ow, ow, ow, ow, OW!” Lydia screeched. She tried to yank her head away, but Derek’s fingers were hopeless tangled in the fine red strands and it only made her shriek in pain and then burst into tears.\n“Sorry, sorry,” Derek muttered, frantically trying to finger-comb the rat’s nest out.\n“I’m never gonna have princess hair!” Lydia wailed, scrambling off the couch and down the hallway, tiny feet pounding on the hardwood floor. Seconds later, her door slammed shut.\n“Crap,” said Derek, and then went to find the Daddy Do’s video on detangling children’s hair.\n \nLaura knew how to French braid, but was sadly thousands of miles across the country in California, giving lectures on safe, sane, consensual BDSM practices (“The only good part of Fifty Shades of Grey is the part where it got me a job,” was one of her favorite opening lines).\n“She won’t let me try again,” Derek informed Laura. “She says she’s been traumatized, and requires at least a week to recover from my blundering attempts at princess hair.”\n“In those words?”\n“In those words.”\n“Christ,” said Laura. “You really need to get her IQ tested.”\n“Yeah, yeah,” Derek said impatiently, because he’d heard the same thing from Lydia’s teacher just last night at parent-teacher conferences. “Look, I just—do you have any advice? Friends in New York?”\n“Who could… teach you to French braid?” Laura asked slowly.\n“I’ve tried everything,” Derek said, sighing. “I even—there’s this YouTube video, I’ve watched it probably a thousand times. I know intellectually how to do it, I just can’t figure out how to hold the damn hair. It keeps getting tangled instead of braided.”\n“Do you think maybe you’re making this out to be a bit of a bigger deal than it really is?” Laura suggested tentatively.\n“It’s—” a parenting thing, he almost said, but Derek caught himself at the last minute. At last update the fertility treatments had been oh-for-twenty for Laura.\n“Yes?” Laura asked.\n“School pictures are coming up,” Derek finally said, which was also true.\nLaura snorted. “Derek, I know we haven’t been in school for a while, but I’m pretty sure they still photograph your face, not the back of your head.”\n“Shut up,” Derek replied.\n\"Uh-huh. I really don’t know what you want me to tell you, little brother. I can’t Apparate over to New York, braid Lydia’s hair, and then Disapparate in time for On the RACK: Is It Stretching Ethics to Its Limits?”\nDerek rolled his eyes. “I can’t believe people actually hire you.”\n“Shut your face, my titles are the best.”\nWhich reminded him.\n\"Speaking of titles,” he said, “did Mom tell you Uncle Wilbur’s decided to pass his retirement years by writing a book?”\nLaura groaned “Oh, God. Yes. We’re going to have to read it, aren’t we?”\n“Probably.”\n“Ugh. Can’t someone just, like, tell him that there is no need for another eight hundred page book about the planes of World War I?”\n \nHe attempted to corral Lydia into another French braiding trial, but she flat-out refused. Derek tried not take it personally, and kept a wide berth from the cabinet with the photo albums, where Kate’s face was waiting to remind him of all his failures.\n \nIt was t-minus five days to picture day when Derek got home late from work—he’d been at a bike factory an hour out of the city, and they’d had a string of EPA violations so long Derek had had to use notebook paper to finish listing them—and was immediately accosted by his daughter.\n“DADDDYYYYYY!” Lydia squealed, leaping at him and climbing up his body like he was her own personal jungle-gym. “Daddy, Daddy, Daddy, Daddy!”\nBoyd, the babysitter, smirked languidly from the couch.\nDerek scrambled to get a hold on her before she accidentally kicked him in the nuts.\n“Guess what?” she demanded, levering herself up so her face was inches from his own. “Guess what, guess what, guess what? Little S, from Daddy Do’s, she’s in my class. Her name’s Erica Stilinski and her daddy is Mr. S because he’s Mr. Stilinski, get it? And she had the best princess hair ever today, she had a heart in her hair made out of braids and pink lace. Pink lace, Daddy.”\nDerek had watched the tutorial for that hairstyle. At least five times. Mr. S had kept up a spirited debate with his daughter throughout the video on whether Batman or Spiderman would win in a fight.\nBut, wait.\nLittle S was in Lydia’s class?\n“Is she new?” Derek asked, frowning.\nLydia gave him an impatient look. “Duh. She moved here from Michigan. She said sometimes it snowed so much that she and her daddy would have to use a snowmobile to get to school, but I think she’s lying.”\nDerek swallowed. “Depends on which half of Michigan they’re from.”\nMr. S—Mr. Stilinski, apparently—had moved here, to the suburbs of Albany. He probably lived within twenty miles of Derek’s apartment.\nGod, that was… weird.\n“Mr. Hale?” Boyd said, having dragged himself off the couch and slung his backpack over his shoulder.\n\"Right,” said Derek, letting Lydia down and taking out his wallet. “It was, what, two hours? What did I pay you last time?”\nWhy had Mr. Stilinski moved here?\n“Twenty,” Boyd replied.\nDaddy Do’s uploaded a new video every Saturday night, and Derek had just watched the latest one yesterday. There had been no signs of Mr. Stilinski and his family picking up and moving across the country in it—no boxes or bins, all clutter and homeliness and—\n“Actually,” said Boyd, “I just remembered. It was thirty.”\n“Sure,” said Derek vaguely, and pulled out an extra ten.\nChrist, he’d probably run into their family at Whole Foods or Target or something. Would it be weird to say something? Would Mr. Stilinki’s wife think it was weird?\nThe door shut behind Boyd.\nWhat was his wife even li—\n“You paid him twenty last time,” Lydia piped up helpfully.\nDerek blinked. “I—”\nCrap, he had.\nHe glared half-heartedly at his daughter. “And you didn’t say something because…?”\n“Mistakes are just another way of learning,” she said, wide-eyed and serious.\nDerek groaned and toed off his shoes, moving into the kitchen to stare mournfully into his alcohol-free fridge.\n“Is Boyd gonna watch me tomorrow? Lydia asked, following him.\n“No, I’ll pick you up from Latchkey like normal,” Derek said. He glanced back at her. “I thought you liked Boyd?”\n“I do,” Lydia said innocently.\nDerek frowned harder.\nLydia skipped away, humming.\n \nDerek spent all night convincing himself not to rewatch the entirety of the Daddy Do’s channel.\n \nHe discovered what, exactly, the fruit of his loins had been up to when he went to pick her up from Latchkey the following day.\nUsually when he came to pick up Lydia, she had everything ready to go and only had to pull on her coat before they could leave. Today, though, she seemed to have taken every single item out of her backpack—and papers out of their folders, eraser caps off of their pencils—and waited for Derek to arrive before starting to put it all back in.\n“Lydia, we have to get home and start dinner,” Derek reminded her.\n“I know,” Lydia said sweetly, carefully slotting the next piece of paper into the pocket of her folder.\nDerek held in a sigh. “Lydia.”\n\"If you’re going to do something, then you should do it right, Daddy,” Lydia informed him, smoothing down another piece of paper.\nDerek resisted the urge to beat his head against the wall.\nTwo minutes later, the door to the gym opened and Mr. Stilinski strode in, flushed and windswept, grinning hugely.\nDerek froze.\nLydia shoved all of her papers into her folder, slammed it shut, and swept everything into her backpack in less than five seconds. She zipped it up, hooked it over her shoulders, and skipped over to where Mr. Stilinski was kneeling to give Little S—Erica a bear hug. Her blonde hair was done up in two little worm buns with purple ribbons around them.\nDerek’s stomach flipped. His chest felt funny.\nHe raced after his daughter.\n“Hi Mr. S!” Lydia said pertly, in a voice that made her actually sound her age instead how she usually spoke. “My name’s Lydia, and this is my daddy. His name is Derek Andrew Hale and he watches all of your videos a lot, but he still can’t braid.”\n“Lydia,” Derek said, ears burning, as he came to a stop behind her.\nMr. Stilinski raised his eyebrows and looked up at Derek, expression somewhere between amused and bewildered, before focusing on Lydia again.\n“Hi, Lydia,” he said holding out a hand. “It’s nice to meet you.”\nLydia shook his hand solemnly. Then she looked up at Derek and announced, “I have to pee!”\nShe ran off, hair streaming behind her because Derek had overslept this morning and hadn’t even had time to put it in a simple braid. Crap. He should have done it while she ate her cereal, because what Lydia had said wasn’t true. He could braid. A little.\n“Well,” said Mr. Stilinski, and Derek suddenly realized that he was still there.\n“Uh,” said Derek. He resisted the urge to rub the back of his neck. “Sorry about that.”\nMr. Stilinski grinned, getting to his feet. “It’s okay. I wouldn’t say I’m famous or anything, but this definitely isn’t the first time I’ve been recognized. Though it’s usually by women—which is weird, since I meant for Daddy Do’s to be for, y’know, dads, but maybe they’re just embarrassed? Which I’ve always thought was dumb, because a) there is nothing emasculating about braiding hair, and two, if you’re more worried about your image than making your daughter happy—”\nErica tugged subtly on Mr. Stilinski’s hand, and he cut himself off.\n“Right,” he said. “Uh. Sorry. I ramble when I’m ner—uh, yeah. Anyway. I’m Stiles?”\nIt was said like a question, so when Stiles held out a hand, Derek didn’t immediately register it. By the time he processed the fact that Stiles wanted to shake hands, Stiles was letting out an awkward laugh and lowering his hand.\n\"No!” said Derek, quickly grabbing Stiles’ hand and shaking it, probably too hard. “Sorry. I’m not—worried about my image.”\n“I can see why,” Stiles said, and then went wide-eyed. “I mean—”\n“It’s okay,” Derek said instantly.\nHe realized, abruptly, that he was still holding Stiles’ hand, and dropped it.\n\"So, um,” said Stiles, stuffing his hands into the pockets of his coat, “is it just you and Lydia? Or is her mother also not hairishly-inclined?” He winced. “Sorry, that, uh, sounded better in my head.”\n“Just us,” Derek said, heart pounding.\nKate? What Kate?\n“Oh, man,” said Stiles, face breaking into another huge grin. Videos had not done it justice. “As a fellow single father, I’ve definitely got to help you out, then.”\nSingle father?\n\"But—” Derek started, but realized too late that it would be weird to ask about the woman who was sometimes in his videos. What if she was Stiles’ ex-wife? What if that was why Stiles had moved here?\nCrap.\n“I don’t… have to,” Stiles said slowly, looking a bit crestfallen despite his obvious efforts not to.\n“No—I mean, yes!” Derek said hastily. “Yes, I’d like you to help me out.”\nAnother blinding smile. “Awesome! Do you—here, let me get my phone, we can work something out. Do you have texting? I’m a huge fan of texting. Here, just—”\nHe held out his phone, and Derek awkwardly fumbled it before getting the keypad sorted out.\n“Thanks,” Stiles said, when Derek handed the phone back.\n“I have texting,” Derek told him. “So—that’s fine. If you do that.”\nLike magic, Lydia appeared at his side again, practically bouncing on the balls of her feet.\n“The bathrooms are in the other direction,” said Erica.\nLydia gave her a filthy look.\n“We should get going,” Derek said hastily, placing a hand on Lydia’s back.\n“I’ll text you!” Stiles promised, wiggling his cell phone.\nDerek tried to smile, but it felt like all of the muscles in his face had gone offline, so he thought it probably came out as something of a grimace. There was a weird buzzing throughout his body as he guided Lydia toward the doors to sign her out, like he was hooked up to a live wire. Halfway there, he tripped over absolutely nothing and almost knocked her over.\nHis ears burned.\nLydia waited until Derek was unlocking the car to speak up.\n“You like him,” she said accusingly.\nDerek almost dropped the keys. Luckily, he recovered.\n“I do like him,” he agreed. “He seems like a nice guy.”\n“No, you like like him,” Lydia informed him, climbing into the backseat.\n“You’re not supposed to say that until you’re at least eleven,” Derek muttered, sliding into the driver’s seat and turning the ignition.\n“Daddy.”\n“Seatbelt?” Derek asked, checking her in the rearview mirror even as Lydia replied with a longsuffering affirmation.\nA glance at the car’s dashboard clock revealed that there was now no time to make dinner before Girl Scouts, which meant that Derek would have to fall back on the bag of oven-ready chicken nuggets in the freezer.\nHe eyed his daughter in the rearview mirror suspiciously.\nShe’d probably planned that, too.\n \n\nHey! It’s Stiles!\n\nDerek waited an hour before he replied, then spent another twenty minutes trying to figure out what to say. He ended up sending a simple, Okay, and then cursed himself and sent another one that read, Are you going to pick Erica up tomorrow at the same time?\nYep! I’ll see you then, and we can talk about getting together? Stiles texted back, almost instantly.\nYes, Derek replied, and then cursed himself some more.\n \nThe following day, Derek made sure to arrive at Latchkey exactly on time, and sure enough Stiles was there. And no, his stomach did not flip at the sound of Stiles’ laughter when he walked into the gym.\n“Hey!” Stiles said, waving him over to where he was sitting with Erica and Lydia on the bleachers.\n“Hey,” Derek replied.\n“We’re discussing Halloween costumes,” Stiles told him.\n“Oh yeah?” Derek asked, turning to Lydia. “Did you make up your mind yet?”\n“A fairy princess demon witch,” Lydia replied. “With nunchucks.”\nCrap.\n“Not a ladybug?” Derek asked hopefully, because it had been her other choice. It was also the one that didn’t require Derek to be dragged to seven different costume shops in order to acquire all the necessary props.\n\"Nope,” Lydia said happily.\n“I’m gonna be Merida from the Brave movie,” Erica informed him eagerly. “I can even shoot real arrows, ‘cause Aunt Allison got me my own bow before we came here.”\nStiles rolled his eyes. “Yes, she did, didn’t she?”\nDerek knew the feeling.\nLaura had gotten Lydia some sort of child’s science kit for Christmas, which mostly seemed to consist of different ways to make the world’s least carpet-friendly slime. There were now strategically-placed rugs throughout the living room.\n“So I was thinking,” Stiles said, as Lydia and Erica devolved into a discussion on their favorite parts of Brave. “Picture day is on Friday, right? Erica brought home a three-inch stack of papers on Monday and I’ve only worked through the first inch, but I think I remember the principal’s secretary saying something while I was filling out paperwork last week? But I could be wrong, last week is kind of a blur of boxes and sweat and—”\n“It’s on Friday,” Derek confirmed.\nStiles let out a breath, looking relieved. “Thanks, man. Rambling is, like, my worst enemy. I’ve got Erica trained up—right, you saw her do it yesterday—but just, like, jump in and interrupt if I ever get going.”\n“Uh. Okay,” Derek said, and then mentally kicked himself for sounding like a monosyllabic idiot. “So, picture day?”\n\"Yeah!” Stiles said, lighting up again. “Right, so, I was thinking that we should maybe try to get together tonight? It’s Wednesday, so that way if you’re still struggling, we can try again tomorrow night too. Unless you’re busy tonight, which I totally understand, or if you don’t want—”\n“Tonight is good,” Derek said quickly. \nStiles beamed. “Oh man, it’s like you’ve known me forever. Ramble averted, two for two.”\nThat was definitely a stomach flip.\n“I hate to put you on the spot or something, but our place is kind of a hot mess right now because we’ve unpacked like three boxes and there was a mix-up with our utilities and we’ve been showering at the neighbor’s all week—” Stiles’ eyes went wide and he quickly changed tracks. “Uh. But. Anyway. Would you mind horribly if went to your place?”\n“No problem,” said Derek, and then remembered the strategically placed rugs, the Lydia-sized pink handprints painted on the leather couch, and the bleach stains on the front door.\nWhatever. At least they had running water.\n \n“Are you pretending to not know how to braid just so Mr. Stilinski has to come over?” Lydia asked suspiciously, when they were in the car to go home.\n“No,” Derek said incredulously. “Where do you even get these ideas?”\n“You’re right,” Lydia agreed, looking at him with eyes far too critical for a six-year-old. “You’re not good enough at planning things to be doing that.”\n“Thanks,” Derek replied faintly. “I think.”\n \nStiles called just as Derek was pulling the green beans off of the steamer.\n“Hey,” he said as soon as Derek picked up. “Do you have a minute?”\n“Yeah,” Derek said, abandoning the green beans in the sudden rush of nerves—then remembering that they were done, and hastily pulling them up again. Crap.  \nHe hadn’t acted like this since he was sixteen.\n\"Great,” said Stiles, and Derek suddenly realized that he sounded a little… tense. “Um. Okay. I didn’t want to do this in front of Erica, and I’m sorry for springing this on you right now, but—”\nDerek felt a low, terrible swoop of dread in his stomach, and steeled himself for rejection.\n“Erica has epilepsy,” Stiles said.\nDerek blinked.\nRelief flooded him for approximately five seconds, and then he realized what Stiles had said beyond the level of not cancelling, and immediately felt horrible.\n“I—” He fumbled for something to say and dumped the green beans into a bowl. “That’s—”\n“No, no, I know,” Stiles said immediately. “Don’t—that’s not why I told you. It’s just that there are some things that she isn’t allowed to do or eat, and I wanted you to be prepared. Talking to Lydia about it would probably be a good idea, too.”\n“Absolutely,” Derek said instantly, moving away from the sink over to his laptop. “What does she need?”\n“So, uh, I don’t know how much you know about epilepsy, but the first thing to know is that the whole flashing lights thing is super rare as a seizure trigger. There’s, like, a whole list of things that can set people off. Erica’s mostly triggered by sleep deprivation, hyperventilation, and if she eats anything with Red Dye 40, we think—she was only diagnosed a year ago, so it’s still kind of new.”\nDerek tapped keys frantically with one hand, using abbreviations left, right and center.\n“I’m a little… overzealous when it comes to treatments,” Stiles said, with a small, self-deprecating laugh that made Derek do something crazy like hug him until he stopped feeling like he should ever do that again. “So we cover all the bases. That means she’s on a ketogenic diet—no carbs, and nothing too high in table sugars. String cheese, most fruits as long as it’s in small portions, seeds and nuts are all good, and she had a small dinner so we don’t have to stress about calories tonight. No caffeine. Erica gets an hour of screen-time a week, to be used at her discretion, and she hasn’t used any this week so that should be okay. Nothing too active, though, because if she gets out of breath—”\nDerek dutifully took notes until Stiles finally finished.\n“Wow,” Derek said when Stiles went quiet, staring at the messy list on his computer. “That’s incredible. That you do all that. I—can’t imagine.”\nStiles blew out a breath. “Yeah, it’s not easy. But, I don’t know, I don’t think of it as an achievement or anything. I hate it when people are like, ‘Oh, you’re so strong’ and shit like that, because—she’s my kid. It’s not about being strong, it’s just what I have to do. You know?”\n“Yeah,” Derek said.\n“Sorry,” Stiles said, and there was that stupid, self-deprecating laugh again. “I didn’t mean to—”\n“No,” Derek said quickly. “No, it’s just that—they thought Lydia had Down Syndrome. She tested positive in utero. Kate—her mother—wanted an abortion, but I didn’t. We broke up over it. She didn’t end up…” He trailed off and swallowed. “She’s not a part of Lydia’s life. Either of our lives.”\nStiles was quiet.\n“Sorry, I know it’s not the same—” Derek started, suddenly feeling like an ass, when Stiles cut him off.\n“No! No, no,” Stiles said hastily. “I was just processing. I’m sorry about her mom flaking on you. That must have been rough.”\nDerek shrugged. “It’s fine. We’re better off without her.”\nHe wondered what had happened to Erica’s mother. Was she the woman in the videos? Did she live here in Albany? Was Stiles still in love with her?\nBut Stiles offered no information. Instead he just said, “Good.”\n\"Daddy, I’m hungry,” Lydia announced, walking into the kitchen. She narrowed her eyes at Derek. “Who’s on the phone?”\nDerek ignored her, because they’d had the conversation about Lydia interrupting him on the phone at least a thousand times already.\n“I’ll talk to her,” Derek promised. “Over dinner. Which she’s now demanding.”\n“Oh, well then,” Stiles laughed. “Far be it from me to get between a child and their dinner. Thanks so much, Derek, I really appreciate this. I’ll see you soon?”\n“Yeah,” said Derek, and then listened to Stiles hang up before he hit END.\n“You like him,” Lydia declared, hands on her hips.\n“Dinner,” Derek replied, handing her the bowl of beans. “Put this on the table, and then get the silverware, okay? We have some things to talk about before Mr. Stilinski and Erica get here.”\n \n\nWhat are Lydia’s feelings on Barbie dolls?\n\nMostly that she doesn’t have enough, Derek replied, and felt inordinately proud of himself for a whole minute for being witty before he began to wonder if that made Lydia sound too much like a brat.\n \nThe evening was not a complete disaster.\nStiles and Erica arrived, and there was no visible judgment passed on the bleach-stained door, or on the pink handprints Derek hadn’t quite managed to cover up with pillows. Lydia did not throw any temper tantrums, and played agreeably on the floor of the living room with Erica—though Derek did notice that she kept an eye on Erica’s mermaid Barbie all night. He really, really hoped that this was because she wanted one too, not because she wanted to tack ‘mermaid’ on to the end of her already ridiculous Halloween costume.\nThere were no seizures or snack mishaps, and luckily, unlike the neighbor boy Jackson who was the same age as Lydia, Erica did not have a propensity for falling in toilets (don’t ask). Stiles had even brought some string thing for Derek to learn on, so he wouldn’t have to abuse Lydia’s scalp any more than necessary.\n(Lydia was initially disappointed about that; in preparation for Stiles’ visit, she had laid out on the coffee table what was quite possibly every single hair-related item they had in the apartment, including Derek’s razor and multiple bottles of Strawberry Smoothie L’Oreal Kids 2-in-1 Shampoo. She quickly got over it when she saw Erica’s mermaid Barbie, though.)\nSo it was all going well, with no imminent disasters on the horizon, until they actually sat down to do the braiding bit—which was when it became readily apparent that Derek had not thought through this idea at all.\n \nThe string thing was a square of white fabric about a foot wide, with rows of red and yellow strings affixed to it in two columns that were an inch apart. Stiles swore it was an unpatented miracle worker.\n“I made this to teach my friend Scott how to French braid,” he told Derek, as Derek tried to decide whether to keep holding it or set it on his lap. “He’s kind of sickeningly in love with his wife and wanted to learn as some kind of present to her? I really don’t understand it because Allison knows perfectly well how to braid her own hair, but whatever. I don’t even ask with them, anymore.”\n“Allison, as in bow-and-arrow Allison?” Derek asked.\n“None other,” Stiles confirmed. “You might have seen her—I use her as a model for my more adult hairstyles on my channel. I mean, probably not. You seem like you’re kind of stuck on the whole basic braiding thing, so there wouldn’t be much point in watching more complicated hairstyles, right? It’s not like—anyway. Uh. Yeah.”\nDerek didn’t know how to tell Stiles that actually, he’d probably watched every video on his channel at least three times without sounding like a creeper.\n“Okay,” said Stiles, with a look like he was sizing Derek up. “Let’s… get started?”\nDerek nodded.\nAnd it was fine for the first minute or so, where Derek began muddling through the strings by himself. He’d practically memorized the audio from Stiles’ video tutorial. But then—\nThen—\n“Oh, no, no, no,” said Stiles, reaching over and grabbing Derek’s hands.\n\nGrabbing Derek’s hands.\n\n“This is where you’re going wrong,” Stiles told him, wrapping his hands around Derek’s. “Here. You want to take the red bunch here, and hold it like this, between—yeah, like that. And then you’re free to add hair—or, well, string—from the right side, see?”\nDerek nodding, trying very, very hard to look at the string and not at the hands that were covering his own.\nJesus, those fingers.\nThey were exactly as warm and soft as he’d imagined they’d be. Long. God, so long. Pale, contrasting with Derek’s more olive-toned skin beautifully. And though Stiles wasn’t gripping him very hard, the pressure and the heat and the weight of Stiles’ hands on his own felt incredible, intimate, made him wonder about the way that they might feel—\n“Derek?” Stiles asked. “You okay, man?”\nDerek’s ears flamed, and his stomach twisted with sudden shame.\nShit.\nHere was Stiles, the single father of a child with a disability, possibly recently divorced, going out of his way to help Derek be a better dad, and what was Derek doing? Sitting here like an asshole and objectifying him. Fantasizing about his hands.\n(But, Jesus, those hands, seriously—)\n“Sorry,” Derek said, inhaling and using guilt to make himself focus on actually braiding. He valiantly attempted to figure out where Stiles had been pushing his fingers moments ago. “So, uh—like… this…?”\nHe twisted the bundles of strings in his hands awkwardly, right over left, and that was weird. Bad. His hands felt wrong, without a trace of the surety that they had when doing a normal, three-stranded braid.\nHe glanced at Stiles, feeling like an idiot.\n“Yeah!” said Stiles, and Derek barely noticed the hands sliding away from his own as a brilliant smile lit up Stiles’ entire face. Warmth pooled in his stomach. “You’ve totally got this,” Stiles said encouragingly. “Do it again.”\nDerek had no idea what he’d just done.\n“Uh,” he said, and pulled the next section of strings between random fingers.\n“Other one,” Stiles hinted.\nOther what?”\nDerek moved the new chunk of strings to two new fingers.\n“Yeah, ah… Here,” said Stiles, pressing his body right up against Derek’s to get the right angle as he grabbed Derek’s hands again. “Let’s go through a few stitches together, okay?”\n“Okay,” Derek said faintly.\nHe really, really hadn’t thought this through.\nAnd then Stiles was literally manhandling his fingers, pressing and pulling and tugging, and Derek focused on keeping his breathing even. Stiles’ fingers were like magic, working Derek’s to create a perfect French braid down the piece of fabric. And the weight of his body against Derek’s—\n“So how did you learn to do this?” Derek blurted out.\n“What, braid hair?” Stiles asked.\nDerek nodded. “Yeah. Did you—do you do this for a living?”\nStiles grinned. “No. That would have been awesome—playing with hair and having someone stuck in a chair, forced to listen to me talk for hours on end? Sign me up, yo. But, no, I work for a company contracted by the Navy. In an office. Nothing dangerous or anything. Basically, it’s my job to sit around and plan out hypothetical responses to crises the Navy think might happen.”\n“So where did braiding come from?” Derek asked, while privately wondering exactly how smart you had to be to land that sort of job.\nNow Stiles looked sheepish. “Honestly? YouTube. Erica was practically bald until she was three, so when she finally lost the dandelion look I decided to learn braiding to celebrate, and… yeah. Here we are. Plus, once you’ve got the basics down, it’s pretty easy to just start inventing. Pinterest is a treasure trove of inspiration. Plus, my mom had a little side business doing prom hair when I was little, so I have a lot of her old magazines and stuff.”\n“But you didn’t go to her to learn?” Derek asked, raising an eyebrow.\n“No, she actually died when I was a teenager,” Stiles said, making a face.\nDerek’s eyes widened. “I’m so—”\n“Don’t worry about it,” Stiles interrupted, flapping a hand at him dismissively. “I’ve had, like, more than a decade to get used to it. I mean, not used to it, because you really don’t ever get used to it, but you know. S’cool. What about you, huh? Mom, aunts, sisters… you too embarrassed to ask them for help?”\n\"They don’t live around here,” Derek replied. “But Laura—my sister—has been getting a real kick out it. Every time I call her, she asks for an update on my ‘hairy situation’.”\nStiles laughed. “Yeah, well, next time, maybe you can tell her that you’ve got the hairy situation completely untangled, so she can get out of your hair about it already?”\nDerek groaned. “You two should never, ever meet.”\n“Would it be punfortunate?” Stiles asked, smirking.\n“You are officially banned from speaking,” Derek replied. “Especially to Laura.”\nStiles rolled his eyes. “Whatever, man. Everyone loves puns. Don’t even try to front with me. Now let’s see you braid those strings again.”\nDerek stared at the perfectly-done French braid that Stiles had somehow manipulated out of Derek’s fingers, and slowly, with great reluctance, began to undo it.\n \nBy the end of the night, Derek had graduated from the string thing to actual hair. He finally ended up with an uneven, lumpy French braid that was missing a chunk on the right side, braided all the way down to the bottom of Lydia’s hair with bits sticking out, and tied off with a fuzzy pink hair tie.\nDerek wanted to rip it out and never look at it again.\nLydia nearly dropped the mirror she was holding when she lined it up with the bathroom mirror to get a look at her hair.\n“I HAVE PRINCESS HAIR!” she shrieked, and practically leapt at Derek, crushing him in a hug with her tiny, bony limbs. “You’re the best daddy ever.”\n“You look beautiful, Lydia,” Stiles told her, grinning widely.\nDerek stared at him incredulously.\n“Can we take a picture? You have to take a picture, Daddy,” Lydia instructed, wriggling out of Derek’s arms. “I’m gonna wear my tiara and my princess dress and my wand, and you can put it on your Facebook so Aunt Laura and Grandma and Grandpa can see, and I can be a real princess for Halloween now, and…”\nHer voice disappeared down the hall.\n“It’s hideous,” Derek said to Stiles.\n“It’s awesome,” Stiles corrected, looking like he absolutely, completely believed it.\nDerek’s stomach flip-flopped, and he was fairly certain his ears were burning. Again.\n \nThey decided that since Derek had the basics down, Erica had a doctor’s appointment right after school and Lydia had dance class the following evening, that Derek would just practice on his own from there on out.\n“You’ve got this,” Stiles told Derek confidently, as Erica finished putting her Barbies back into her Dora the Explorer satchel.\nDerek looked at Lydia’s crooked braid that was literally falling apart with every step she took, and then looked back at Stiles doubtfully.\n“I have faith in you,” Stiles said. “I’ll even leave you the Stringamajig.”\nDerek blinked. “The what?”\n\"The Stringamajig—it’s what I call the string thing. It’s like thingamajig, but with string, get it?” Stiles beamed. “It’s brilliant.”\nNever, ever, ever meeting Laura.\n \n\nLydia’s ‘princess hair’. She cried when I made her take it out for her bath.\n\nLaura Hale, BenandTalia Hale and 5 others like this.\nLaura Hale Derek! I’m so proud! I take it you finally found someone to help you?\nBenandTalia Hale wow she’s getting so big derek!!! so beautiful. when are you coming home? we miss you!!\nIsaac Lahey Not bad, bro. Is this from last night, with the dude you have a crush on?\nLaura Hale WHAT CRUSH. DEREK.\nDerek Hale Nothing. Isaac’s making things up.\nIsaac Lahey That’s just what Lydia told me when I dropped her and Jackson off at school this morning…\nLaura Hale I’m calling tomorrow night, Derek, and you’d better answer.\n \nThe following day, Derek picked Lydia up from Latchkey and found himself looking around for Stiles before he remembered that he’d picked Erica up right after school for her doctor’s appointment. He wondered just how much school Erica missed for her epilepsy. It had to be hard for her and for Stiles, especially since it sounded like Erica saw doctors pretty often.\n“Daddy!” Lydia called, skipping over to him and abandoning her clapping game with Jackson.\nJackson burst into tears.\nLydia was happily oblivious.\n“Daddy, Daddy, guess what?” she demanded, grabbing his hand and pulling him out of the gym. “Erica doesn’t have a mommy either. I asked.”\nDerek stopped walking. “You what?”\n“I asked,” Lydia repeated obviously. She turned around and tugged on his hand impatiently. “Daddy…”\n“Lydia, you can’t ask people questions like that,” Derek groaned.\n“There’s no such thing as a bad question, Daddy,” Lydia informed him, rather righteously.\n“Yes, there is,” Derek told her. “Questions like that are rude.”\nLydia glared. “She answered.”\n“That doesn’t matter. You can’t ask people questions like that, Lydia. It’s not nice. Do you understand?”\nLydia looked like she would rather stomp her foot and say no, but instead she replied with a somewhat mutinous, “Yes, Daddy.”\n“Thank you,” Derek said, and started walking again.\nIt was quiet as he signed her out and walked down the hallway.\n\"Erica says her daddy bought her,” Lydia piped up, as Derek pushed open the door to the parking lot. “She says he saved money for lots of years, and then he bought her, and that’s why she doesn’t have a mommy.”\nDerek sighed. “Somehow, I think Erica’s missing a few details.”\n“Erica says she thinks her daddy likes you, too,” Lydia added pointedly.\n“That’s enough, Lydia,” Derek said firmly.\n“She says—”\n“Lydia,” Derek interrupted.\nLydia huffed, but went quiet.\n \nLaura called him, but Derek silenced his phone and texted back, in Lydia’s dance class, call you back later.\nHe didn’t.\nHe was busy braiding and rebraiding Lydia’s hair, trying to get it to look even half as good as the ones that Stiles seemed to do without any effort at all. After Lydia sat through the entirety of The Little Mermaid, though, her patience was tried and Derek was forced to stop for the night.\nIt was fine, he told himself. It wasn’t like they were going to photograph the back of her head tomorrow.\nStiles would see it, though.\n \nLydia waited until after her bedtime story, kiss on the forehead, smoothing of the covers, and the flipping off of her bedroom light, to speak up.\n“Daddy?” she said.\nDerek turned around and saw that she had sat back up in bed. “What?”\n“You really like Mr. S, don’t you?” she asked.\nDerek sighed, and held in a groan.\n“Yeah, I do,” he said, because there was really no denying that he had a massive crush on the man at this point. Especially to Lydia. Lydia was to lies as sharks were to blood in the water.\n“I like him, too,” Lydia said, very serious. “But you shouldn’t like him just because you think I need a mommy.”\nDerek blinked, feeling like he’d been punched in the chest.\n“I—Lydia, that’s not—”\n“Do you like him ‘cause he makes you happy?” Lydia asked.\nDerek inhaled. “Yes. Yes, that’s why I like him.”\n“Good,” Lydia said, and laid back down to go to sleep. “Night, Daddy.”\n“Good night,” Derek answered, automatically. “Don’t let the bed bugs bite.”\n“And if they bite, bite ‘em back,” Lydia mumbled in reply, already drifting off.\n \nPicture day dawned… grey and wet. Derek had numerous text messages on his phone from Laura, informing him that she was expecting a phone call tonight, and there would be trouble if he ignored her for a second time.\nHe spent nearly thirty minutes fussing over Lydia’s hair, going so far as to stand behind her as she ate her breakfast, trying one last time to get her braid to be as perfect as possible. Lydia did a lot of eye-rolling, convinced that every braid that Derek did was perfect and there was no need to start over again, but patiently endured it.\nThe end result was decent. It was nowhere near as good as Stiles’, and Derek knew that he’d done one or two that had been better last night, but they couldn’t delay any longer or they’d be late.\nAt the drop-off line at school, Lydia waited until Jackson had already run inside to unbuckle herself. She scrambled to her knees and tumbled forward, wrapping skinny arms around Derek’s neck.\n“Thank you for the princess hair, Daddy,” she said, and planted a wet kiss on his cheek. “You’re the best.”\n“You’re welcome,” said Derek with a bemused grin, turning around to watch her put on her backpack and pull the hood of her raincoat up.\n“Love you,” Lydia said, hand on the door.\n“Love you too,” Derek replied, as she threw open the door and sprinted for the school. “And don’t make Jackson cry today!”\n \nDerek arrived at Latchkey ten minutes late, dripping wet and out of breath because he’d been worried that Stiles would have left with Erica before he got there. Luckily, that was not the case, and Stiles was listening to Lydia rant about something when Derek walked in the door.\n\"Daddy!” Lydia said shrilly, turning to face him. “Look what stupid Jackson did!”\nShe thrust the hem of her dress forward, displaying a large pink stain.\nDerek suspected that Lydia had not, then, made it through the day without making Jackson cry. Oh, good.\n“Don’t call people stupid, Lydia,” he said. “It’s not nice. Was it an accident?”\nLydia folded her arms over her chest. “Maybe.”\n“Did he say sorry?”\n“Only ‘cause I made him.”\nDerek held in a sigh.\n“I was just telling Lydia that I’m sure that the stain will come out in the wash,” Stiles put in, rising to his feet. “We’ve got some pretty awesome stain-remover at home, if you need it.”\n\"We’ve got some, too,” Derek assured him. “But thanks. And thanks for staying with her—I was running late at work.”\n“Yeah, no problem. What is it you do, anyway?” Stiles asked.\n“Nothing really exciting,” Derek said. “I inspect companies for EPA violations.”\n“Whoa,” said Stiles, looking impressed. “You are… not the kind of person I pictured doing that type of thing.”\n“Physically intimidating was literally written in the job requirements,” Derek told him. “Apparently, we’re less likely to be bribed that way.”\nStiles’ eyes widened. “Has anyone ever tried to bribe you?”\nDerek grinned. “Nope.”\n“Well. Solid theory, then,” Stiles said, eyebrows raised.\nDerek nodded, and looked down to find Lydia missing. He panicked for the half a second it took for him to look to the left, and find that she was playing some sort of clapping game with Jackson and Erica. He also noted with some relief that Erica’s hair was not done in any fancy, overly-complicated style, but simple pigtails with ribbons.\n“Lydia’s hair looks really great,” Stiles commented, drawing Derek’s attention back to him. “You did an awesome job.”\n“Thanks,” said Derek, casual-like.\nCool. Suave.\nThat was Derek.\n“Oh, and before I forgot,” Stiles said, “I, uh, I wanted to clarify. Erica told me that she and Lydia were talking about their mothers yesterday, and apparently Erica took my explanation of her birth a little… capitalistically?”\nOh.\n“Lydia mentioned it,” Derek said, even more casually, like he wasn’t desperate to hear about Erica’s mother.\nStiles laughed, looking a little embarrassed. “I guess I just wanted to make sure you didn’t think I stole her or something. You know? Anyway. What happened was I sort of did buy her. Or, well, I paid an arm and a leg to have a surrogate carry her for me. I’d always wanted to be a dad, and the chances of a young, single, mostly-gay dude who lived alone acquiring a kid are, like, slim to none—”\n“Stiles,” Derek said, only half registering his words. His brain was still stuck on single and mostly-gay.\nStiles broke off, looking relieved. “Right. Anyway. Trying to explain all of that to a five-year-old is a complete nightmare, and I apologize for whatever butchered version Lydia came home with yesterday.”\n“Not a problem,” Derek said, staring at Stiles.\n“Sorry,” Stiles said, blushing slightly. “I know it’s a really obnoxious story to tell to parents who aren’t single parents by choice.”\n“No,” Derek said, eyes widening. “No, I wasn’t—just—it’s only you and Erica, then?”\nStiles grinned. “Yep, it’s just us. Well, we’ve gotten a lot of help from my dad, and Scott and Allison, but they’re all back in Michigan. We moved here because there’s a really great epilepsy center, with lots of trials and pediatric experts and stuff. Kind of sucks, losing the support system, and I still don’t know what I’m going to do about Daddy Do’s since Scott was my cameraman. I guess we could go to a stationary camera for a while? Get a tripod or something? We’ve got a backlog filmed, but—”\n“I could do it,” Derek blurted out.\nStiles shook his head. “Oh, no, I wasn’t saying that so that you’d—”\n“No, I want to,” Derek said, heart hammering. “I do. I want to help.”\nStiles stared at Derek with a hesitant smile on his face. “Really?”\n“Yeah,” said Derek. “Just call. Text. Whatever. Whenever. Not whenever, actually, Tuesdays, Thursdays, and Sunday nights are bad, but other than that, whenever.”\nHis ears were burning again. He just knew it.\n“That’s—awesome,” Stiles said, face breaking out in another blinding smile. “You’re—yeah. Thank you! So much.”\n“Yeah,” said Derek, grinning stupidly right back.\n“Would you… um. Well, we usually film Saturday mornings. You could—I mean, you and Lydia, obviously—you guys could stay for lunch?”\n“Yes,” Derek said immediately. “Saturdays are great. We don’t do anything. That sounds great.”\n“Okay,” Stiles said, slightly wide-eyed, still beaming.  \n“Okay,” Derek said, with a terrible, distant feeling that his face was much the same way. “I’ll. Text you.”\nStiles nodded.\n“Time to go!” Lydia announced, magically appearing at Derek’s side with Erica in tow. She grabbed Derek’s hand. “Bye, Erica, bye, Mr. S!”\n“Bye, Lydia!” Stiles called, as Lydia all but dragged Derek away.\nDerek let himself be led away, every inch of his skin tingling, his head buzzing. He signed Lydia out practically on autopilot.\n“I knew you liked him,” Lydia said, as they walked down the hallway. “I told you.”\n“You did,” Derek agreed.\n“You should listen to me more often,” Lydia informed him, tossing her braid over her shoulder.\nDerek grinned, slowed so that he was a step behind her, and grabbed her around the middle to lift her up and flip her upside down. Ignoring her shrieking laughter, he grabbed an ankle in each hand, and proceeded to let her dangle all the way out to the car. "
}