{
    "id": "8268668",
    "url": "https://archiveofourown.org/works/8268668?view_full_work=true",
    "author": [
        "MilkTeaMiku"
    ],
    "title": "Fever",
    "rating": "Not Rated",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Yuri!!! on Ice (Anime)"
    ],
    "relationships": [
        "Katsuki Yuuri/Victor Nikiforov"
    ],
    "characters": [
        "Katsuki Yuuri",
        "Victor Nikiforov",
        "Yuri Plisetsky",
        "Makkachin (Yuri!!! on Ice)"
    ],
    "additional_tags": [
        "Fluff",
        "Angst",
        "Fluff and Angst",
        "Smut",
        "Fluff and Smut",
        "Eventual Smut",
        "Domestic Fluff",
        "Alpha/Beta/Omega Dynamics",
        "Alpha Victor",
        "Omega Yuuri",
        "Mating Cycles/In Heat",
        "Knotting",
        "Praise Kink",
        "Hurt/Comfort",
        "lots of fluff",
        "Don’t copy to another site"
    ],
    "language": "English",
    "series": "",
    "published": "2016-10-12",
    "completed": null,
    "words": "15,830",
    "chapters": "1/1",
    "comments": "433",
    "kudos": "11,396",
    "bookmarks": "2,239",
    "hits": "196,677",
    "summary": "<p>Yuuri had always known he was a little bit <em> different </em> when compared to other figure skaters. Of course, the fact that he was socially awkward and rather ungraceful kind of made him stand out anyway, but it was more than that.</p>\n<p>It was biology.</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a>.)</p>\n<p>This took so long, I haven't edited it properly aha ^^\"</p>\n<p> </p>\n<p> <a href=\"https://twitter.com/fairydens\" rel=\"nofollow\">my twitter</a><br><a href=\"https://milkteamiku.tumblr.com/\" rel=\"nofollow\">my tumblr</a></p>",
    "text": "Yuuri had always known he was a little bit  different  when compared to other figure skaters. Of course, the fact that he was socially awkward and rather ungraceful kind of made him stand out anyway, but it was more than that.\nIt was biology.\nOne would think a pretty sport like ice skating would appeal to omegas, and while there were other omegas famous for the sport, it was predominantly an alpha’s game. That’s not to say omegas and betas, too, weren’t welcome (as was still the case with other dominant sports, despite more modern social standards now dictating that discrimination between secondary genders was frowned upon) but one was more likely to see a gorgeous alpha dominating the rink than a pretty omega.\nTake Victor Nikiforov, for example. He was the absolute perfect example of alpha greatness, and even someone who wasn’t as biased in their affections as Yuuri would be able to see that. Victor was tall and handsome, and he had a smile that could send an entire stadium full of people swooning, as it had many times before. He had an alluring personality and a charming way of speaking, not to mention his prowess in the rink was stunning and completely captivating. He was graceful, and strong, and anybody who looked at him could see the years of hard work and dedication dictating his form. He was the kind of star that was impossible to hate.\nWas it so hard to believe an omega like Yuuri was infatuated? \nHe wasn't the only one. There were thousands upon thousands of dedicated fans that flocked to Victor, people of all genders and secondary genders. Victor need only smile to have entire crowds fall under his charm and wit. Of course, not all those people got to skate on the same ice as Victor, not like Yuuri did. \nHe'd completely messed that up, though. Just thinking about it made him cringe. Even the events immediately after the Grand Prix made him want to cower - he'd just stared at Victor, and hadn't even replied to his photo offer. What had Yuuri been thinking? Nothing, that's what. After a crushing defeat, from which he only had himself to blame, he couldn't stand the thought of being around the alpha.\nVictor was his idol, the person whose footsteps he tried so hard to follow. How could he taint that with his defeat? It was humiliating, and he was mortified just by the thought of it. Escaping back home and eating his worries away seemed like a good option. Not good for his waistline, but omegas were meant to be a bit softer, anyway. \nDespite his embarrassment over his loss, he still found himself drawn to the ice. His local ice rink had been the place he practiced, and returning there brought him a strange sense of relief. Skating for Yuko, too, had brought him that same feeling. Her eyes on him felt like a safety net, and without her gentle guidance he probably wouldn't have ever been able to skate like he did. She was probably his closest friend, and her neutral, beta scent had always been a comfort. Her alpha husband, Nishigori, not so much.\nYuuri liked to skate Victor’s routines. They made him feel closer to Victor, and closer to his ideal self – the Yuuri who could stand on the same ice rink as someone like Victor and be proud. Skating them for Yuko at his hometown ice rink was just a bonus. \nOf course, the triplets had to go and record it. If they'd just kept the video to themselves for entertainment he probably could have handled it, but they  uploaded it to the internet.  And it went  viral. \nOnce again, he was humiliated. He hid away in his room and ate far too much katsudon to be considered normal because he was upset. Skating Victor’s routines was a secret pleasure, just like having Victor’s posters stuck up on his walls was. Now that pleasure of his was exposed to the entire world. People would call him an obsessive omega, for sure. No alpha would be pleased with his actions, let alone anyone in the ice skating community. God, what if Victor saw it? That thought alone made him want to cry. He'd never be able to face Victor again if Victor knew how much Yuuri liked him. \nAnd yet, he still wanted to skate. He still wanted to be on the same ice as Victor. He went out in the early mornings to do his exercises and visited the ice rink when no one was around to see him. He worked in the onsen and ate his mother’s delicious food and tried not to let himself get too down about anything. If he wanted to skate with Victor one day, then he'd need to be positive, right? He liked to think so, even if he struggled to actually go through with it. There was only so far a fake smile could stretch, after all. \nBut then the unexpected had happened – the day after the video went viral, Victor appeared in Japan. Not just anywhere in Japan, either, but in Yuuri’s home, in the onsen,  naked. \nYuuri had never had all the blood rush to his head quite so fast. \nAnd now Victor wanted to be his  coach.  Yuuri’s coach! How could such a thing even be possible? He couldn't wrap his mind around it, much less the fact that he'd seen almost all of Victor’s body. God, Yuuri always knew Victor’s physique would be more than appealing, but what Yuuri saw was greater than even his wildest dreams (and there had been some pretty wild ones). How would he ever be able to look Victor in the eyes?\nTo make matters worse, it didn't seem like Victor knew that Yuuri was an omega. Not many people did, he supposed – secondary genders were withheld from the media, and Yuuri had been on suppressants during the Grand Prix. He wasn't exactly as physically appealing as most omegas, either; he could pass for a quiet beta with ease. Some part of him was disappointed. Maybe he'd draw more positive attention if he was a pretty omega, like all the alphas wanted. \nBut this alpha wanted to coach him. And he’d offered to do so while  completely naked.  Had Yuuri mentioned that before?\n“I- I don’t know if-” Yuuri stammered, mouth dropped open, cheeks flushed. What was he meant to say to  that?  To Victor’s charming little wink and outstretched palm and generous offer? “O-okay.”\n \nThey started the next morning, though it was not by Yuuri’s choice. The only way he could get Victor to stay out of his room – where all his embarrassing Victor posters were hung up – was to rise out of bed and join Victor at the rink. Of course, showing off his small, hometown ice rink wasn’t exactly what Yuuri wanted to do, but Victor seemed so enthusiastic that Yuuri couldn’t deny him.\n“I’m excited to see where you performed my routine,” Victor said, his blue eyes bright, as they trod through the snow-filled path. “You skated so wonderfully!”\nYuuri held back a groan. He still felt humiliated by the fact that Victor had seen the video that the triplets uploaded to the internet. His fascination with the Russian skater couldn’t have been more obvious, could it? \nThey were the only ones in the rink. Yuko was around, though her fascination for Victor most likely made her too nervous to appear. Regardless, the rink was open, as was the locker room where Yuuri kept his personal skates. Victor had disappeared down to the rink while Yuuri tied his skates, and when Yuuri found him, it was to see Victor holding up his phone.\nOn the screen was his video. Yuuri turned horribly red, and nervously wrung his fingers together. “What are you watching?” He asked, voice nervous. He’d left his scarf and coat in the locker room, and absently wished he’d at least kept one of them to bury his nose into. At least his own scent would help to muffle Victor’s incredibly tempting one.\n“Ah… here!” Victor said, adjusting his grip. As Yuuri stood on his toes to peer at the phone, he saw that Victor had perfectly aligned Yuuri’s skating figure with the ice rink in front of him. It made Yuuri feel incredibly embarrassed, but Victor was grinning. “See? Isn’t it wonderful? It’s almost like I can see it in person!”\nYuuri wanted to point out that he was, in fact, right in front of Victor, but he didn’t think he could perform Victor’s routine in front of the Russian skater. He would be nervous, and everyone knew what happened to him when he got nervous – he failed. It didn’t matter what he was doing, but if he was nervous, he was surely going to mess it up. It was why he had placed last in the Grand Prix, and why he had never really had a proper girlfriend, and why he ate so much and gained weight so quickly.\n“Tell me, Yuuri,” Victor said, lowering his phone, “do you like ice skating?”\nYuuri frowned, and absentmindedly rubbed his arms with his hands. The rink was chilly when he wasn’t moving. “I do,” he finally said. “I love to skate.”\nVictor nodded, looking pleased. “That’s a good answer. I re-watched your routine at the Grand Prix.”\nYuuri’s heart twisted a little.\n“You looked nervous,” Victor continued. “Is that it?”\n“Was it that obvious?” Yuuri mumbled. He supposed it would have been. All the other skaters had been so confident, and so dominating. Their presences were impossible to ignore, Victor’s especially. Compared to them, he was… he was nothing, really. Nothing special, nothing outstanding. His skating and his score had reflected that. He still didn’t really know how he made it as far as he did, considering how poorly he performed.\nSometimes, he wished he didn’t love skating.\n“Cheer up,” Victor said, stepping closer to place a large hand on Yuuri’s shoulder. His fingers were long and pretty, and curled around the ball of Yuuri’s shoulder like it could fit perfectly into his palm. From this close, his scent was even stronger. “This video proves your passion. I’ve never seen anyone skate so beautifully.”\n“I just… just copied your routine,” Yuuri said, nervous. “It was meant to be performed by you. It was a winning routine when you danced it.”\nVictor smiled, that same charming smile that seemed to reach right into Yuuri’s heart. “I think that if you skated it like you did here, in this rink, then you would have won. Someone with your charm, your aura… This routine was meant to be performed by someone just like you, Yuuri. You did so well.”\nOmegas sometimes had this  thing,  see. Or at least Yuuri did. He didn’t exactly know why, but when praised, he just got really…  omega.  Praise made him needy and desperate to please, especially when it was from an alpha. From his parents and friends, too, but differently; when they did it, he felt useful. When an alpha did it, even unintentionally like Victor, he just felt submissive. It was one of the only other times outside of his heats that he was unable to control his biology. And hearing praise like that come from Victor, the person he idolised, the most beautiful person on the planet – it did things to him, made him short-circuit. \n“Yuuri?” Victor’s brow puckered into a concerned frown. His hand dragged up from Yuuri’s shoulder, his fingers just a hair's breadth away from Yuuri’s skin, to rest against his forehead. “Your face is quite red. Are you feeling well?”\nHe was feeling something, but it certainly wasn’t what Victor was implying. “I’m fine, I’m fine,” he said, flushed and nervous, as he took a step back. He felt like he couldn’t breathe without sucking in an entire lungful of Victor’s intoxicating scent. \nAnother concerned look touched Victor’s face. “Alright, if you’re sure,” he said, lowering his hand. He seemed to shake his thoughts away, and offered Yuuri a stunning smile. “Shall we get started? Show me what you can do, Yuuri. I’m eager to see you perform!”\nYuuri didn’t exactly think he could “perform” in loose pants and a simple shirt. He certainly felt more comfortable skating in front of someone like Victor when he at least looked the part in a beautiful, flowing costume. His exercise clothes just didn’t measure up, did they? Definitely not.\n“Off you go,” Victor said, as his wandering hands found the small of Yuuri’s back to usher him into the rink. “Skate for me, Yuuri.”\n I always do.  Hearing those words come from Victor made Yuuri flush again. He’d learned to skate by copying Victor’s routine, and although he knew he skated first and foremost for himself, Victor was always in the back of his mind. How could he not be? Yuuri admired him so much, admired his skating so much. It was impossible not to think of Victor, even just a little, when he skated.\n“O-okay,” he mumbled instead. He gripped the top of the wall and stepped onto the ice, and after shifting his feet to get a proper grip, he glided into the centre of the rink. He spent a minute or two warming up, making sure his legs and arms and back were stretched; he was glad he’d done a bit of stretching in the locker room. When he returned to the centre of the rink, he peeked a glance at Victor. He didn’t exactly know what to skate and turned to ask Victor about it, but Victor switched on music from his phone, and the gentle sound of  Stay Close To Me  echoed around the rink.\n\n Victor wants me to skate his routine? Why? \n\nBut the music had started, and like a puppet on a string, Yuuri started too. He tried to block out Victor’s presence and the weight of his stare, but it was hard. He could smell the lingering scent of Victor on his clothes, and the more he spun and danced and stretched, the worse it became. He could feel his heart starting to race, his nerves uncontrollable. He wanted to dance perfectly, to copy Victor perfectly, but as he stumbled through a trick the music stopped.\n“Yuuri,” Victor called, “come over here for a moment.”\nHis heart sinking, Yuuri did. He was panting already, and no doubt his face was red from the cold. “S-sorry,” he said, as he nervously gripped the hem of his shirt. “I- I can’t…”\n“Nonsense,” Victor said, waving a hand. He leaned against the railing, his arms crossed, seemingly uncaring about how close it brought their faces together. “You’re nervous, no?”\nHe flinched, eyes fluttering, and nodded. “I- I get nervous really easily,” he admitted in a quiet voice. “I can’t skate when I’m nervous, but I can’t stop it.”\n“I understand,” Victor nodded. “I used to get really nervous, too. One time, when I was younger, I fell flat across the ice in front of an important scout.”\nYuuri’s eyes widened. “You did?”\nVictor nodded. A smile that, to Yuuri, seemed rather fond was twitching at the corner of his lips. “We all get nervous sometimes,” he said, “but the trick to performing is controlling it. What was different about this performance,” he held up his phone, “and the one you’re showing me?”\nThe difference felt very clear, but Yuuri didn’t know how to word it. “I was skating for Yuko, before,” he said, twisting his fingers in his shirt again. “She used to be my skating partner.”\n“Oh?” Victor said, tilting his head to the side. “Your girlfriend?”\nA small laugh bubbled up in Yuuri’s throat. The thought of dating Yuko was quite funny, though not unfounded. Many people used to say they would end up together, though Yuko’s affection for him had always bordered on maternal, rather than romantic. Yuuri had crushed on her hard when he was little, but somewhere along the way that had turned into platonic, albeit affectionate, feelings. He couldn’t imagine being with her romantically at all, despite the fact that she was mated, married, and with children.\n“No, she’s my friend,” Yuuri said, smiling. “The last time I saw her before going to Detroit was at her wedding. I missed skating with her.”\nAnother dazzling smile crossed Victor’s face. “I see! That’s quite sweet, isn’t it? No wonder you skate so beautifully for her.”\nB-beautifully? Did Victor think his skating was beautiful? Again, Yuuri felt himself getting flustered at the praise. He really hoped it didn’t show on his face.\nVictor was staring at his phone again, smiling. “Do you think you can skate like this, but for me?” He asked, glancing up at Yuuri almost bashfully. “I know I’m no childhood friend, but I’d really like to see it. Can you do it for me?”\nYuuri really wanted to please him. It wasn’t just because he was an omega, and it wasn’t just because this was his idol. It felt  different.  “I can try,” he said, glancing down. “I’m just nervous.”\n“Don’t be nervous, Yuuri,” Victor said. He reached forwards, and touched his fingertips under Yuuri’s chin to tilt his head up. “I have confidence in you. I can’t wait to see you skate.”\nYuuri’s heart thumped. His skin felt electric where Victor touched him, and it was an addicting feeling. He desperately wanted to lean into Victor’s touch, to feel  more,  but he didn’t. Instead he only nodded, and returned to the centre of the rink. Victor wanted to see him skate. Was  excited  to see it, said that he had confidence in Yuuri. \nWhen the music started and the weight of Victor’s gaze fell to him again, he found that his nerves began to melt away. Victor’s steadfast confidence in him was like a safety net, and when he closed his eyes, the heavy nervousness he felt before vanished. He could hear the music, and the scraping of his skates against the ice. He could feel the cold chilling his cheeks, the tip of his nose, the slip of skin at his waist that was exposed when his shirt lifted. When he jumped and spun, Victor’s scent wrapped around him like a blanket, and it balanced him.\nHe skated for a reason. Before, it had been to impress Yuko, to feel like he was home, to remember the nostalgic feelings he had as a child when he was first learning to skate. This time it was to prove that he could, to impress Victor, and to feel something  new. \nHe had done it. When the routine stopped and he found himself striking the final pose, his chest heaving, he felt good. He’d done something right and he’d done it well, and an immense feeling of pride swelled in him. He turned to face Victor, his eyes wide and excited-\nAnd he was blinded by Victor’s overjoyed expression. Victor’s eyes were big and glittering, so blue Yuuri could see them even from across the ice, and his cheeks had turned red. Victor lowered his phone into his pocket as the music tapered off and shouted something elated in Russian before exclaiming, “Yuuri! Yuuri, that was so wonderful!” \nAnd he fell a little more in love.\n \nA week and a half later, he moved to Russia. It wasn’t exactly a move, per say, but it was the same thing he’d done when he went to train in Detroit, only now he was on a plane to Russia with Victor Nikiforov. It had been at Victor’s insistence that they return to his homeland, though Yuuri didn’t protest too much. He liked to travel, and as much as he would miss Japan, going on an adventure like this with Victor was an exciting idea.\n Victor also insisted that Yuuri stay with him. His house was large and spacious, and his poodle would miss Yuuri terribly if he wasn’t around all day. Without anywhere else to go, Yuuri couldn’t refuse him. Victor lived close to the Olympic ice rink and had enough space for him, so it worked out alright. Yuuri had his own room and bathroom and everything. \nThe only thing Yuuri worried about was his heats. He’d been on suppressants for the Grand Prix and during the year before it, but it wasn’t healthy to stay on them for too long, so after the tournament he’d gone off them. He hadn’t expected to move to Russia, either, and while he didn’t think he’d spontaneously fall into his heat he was a little concerned. He couldn’t go back on suppressants now that he’d committed to being off of them for at least a year, and there was only so much scent-hiding that his special omega soaps and body scrubs could do. \nDealing with the people at the Russian training rink was intimidating. Yuri Plisetsky was particularly difficult. He was an aggressive little thing, and he didn’t seem to like Yuuri much. Victor said it was because Yuri saw him as a rival, and that Yuri would warm to him eventually, but Yuuri was doubtful. He couldn’t help but remember the first time he’d spoken to Yuri – when he’d been sobbing in the bathroom after his defeat. He didn’t like remembering that.\nIt didn’t help that Yuri was only fifteen. He seemed like a pure baby alpha to Yuuri, though he couldn’t be sure. His nose couldn’t quite catch Yuri’s scent, and it was always harder to tell with younger kids, though sometimes it was incredibly obvious. \n“Don’t worry about it too much, Yuuri,” Victor said one evening as Yuuri stepped off the ice. He could feel Yuri’s glare from across the rink. “He’s just grouchy.”\n“Are you coaching him, too?” Yuuri asked. He was panting, and absentmindedly wiped sweat away from his face. Victor’s coaching was extensive, and very hands-on. Despite the other skaters in the rink, including Yuri, he felt like Victor’s eyes only followed him.\n“At times I do,” Victor said. He handed Yuuri a small towel, and smiled brightly when Yuuri took it to clean his face. “But he’s just normally this grumpy. Does he make you uncomfortable? He’s not shouting at you when my back is turned, is he?”\nYuuri thought of the bathroom incident, and cringed. “No, it’s fine,” he said, shaking his head. \n“I can speak with him if it really bothers you,” Victor said, his brow furrowing in concern. “You’ll tell me if anyone troubles you, won’t you, Yuuri?”\n“A-alright,” Yuuri said. Victor seemed so concerned about him, and it made Yuuri’s heart flutter. He felt like he was being taken care of by an alpha that was courting him, rather than his ice skating coach. Did Victor know what his caring words did to Yuuri? Surely he must.\n“Good,” Victor said, as another one of his spectacular smiles came over his face. “Shall we head home, now?”\n“Eh? I can keep going,” Yuuri said, blinking. The other skaters wouldn’t leave the rink for at least an hour, and even then they would probably do cool down exercises in the adjacent gym.\nVictor shook his head. “Rest is important!” He declared. “You started far earlier than the others today, and I know the jetlag must still be affecting you. Come, we’ll go home now, and I’ll cook you something nice for dinner, hmm? Besides, I’m sure Makkachin is missing you very much!”\n“Okay,” Yuuri said, as a small smile touched his face. “I miss Makkachin too.”\nVictor grinned.\nOddly enough, Yuuri and Makkachin got along very well. At first Yuuri was worried he would only see Vicchan in Makkachin, but he didn’t. Makkachin’s sweet personality and cuddly nature were things that Yuuri liked very much. Many omegas loved nothing more than to cuddle and be affectionate, after all, and even getting that from a dog was comforting. \nAfter doing a small run through of cool down exercises and showering away the sweat from his body, Yuuri returned to Victor’s house. Yuuri was quickly starting to think of it as  home,  and he knew that wasn’t wise. For one, it wasn’t his home, and he wouldn’t be living there indefinitely. The other problem was his heat; if he viewed Victor’s home as safe, then he might accidentally build a nest for his heat there, and being removed from that nest would be quite traumatising. He had to be careful not to nest there, and tried to remind himself to find a heat hotel close by.\nWhile Victor began dinner, Yuuri took a proper shower. Victor’s cooking was… interesting, to say the least. Sometimes the bottom was burnt, or the flavours were a little off. Often the kitchen smelt quite funny after he was done. He didn’t think Victor had ever really cooked before Yuuri started living with him, and while Yuuri really wanted to offer to cook, he didn’t want to intrude. \nStill, being fed and cared for by an alpha was quite pleasing to the omega instincts Yuuri had. He didn’t want to view it as courting, as it often would have been in any other situation, but he liked to imagine that maybe it was. Victor would be a really good alpha, wouldn’t he? He cared for Yuuri, offered him a home, wanted to protect him from the others at the rink. Unbeknownst to Victor, of course, Yuuri viewed his concerned offer as something a little different – all the others in the rink were alphas, or betas, and to be protected from them (even though he doubted anything would happen) made him flush.\nHe wondered how close his heat was. It must be getting closer, if he was thinking things like that. He’d only been in Russia just under a month, so he would have to start thinking about what he was going to do. As he leaned his forehead against the cool tiles and let the warm water wash away the aches of the day, he thought about his last heat.\nHe’d spent it at his home in Detroit, though it was the first heat he’d had there. Usually he went to a heat hotel, where omegas like him could be safe throughout the duration of their heat, but he’d felt comfortable enough to have it at home that last time. He’d locked all the windows to keep his scent from escaping and had air fresheners spraying nullifying scents just for extra measure for about a week before, during and after his heat. He’d made a nest in his bedroom and had everything he needed stashed away in his drawers and on his bedside table. It had been comfortable, he thought, despite the fact that he still craved an alpha during it all.\nJust thinking about it made his stomach coil. Even with toys and stimulants, he’d wanted an alpha's knot. It was always like that for him. Some omegas forgot about it when they had toys around, and some didn’t crave knots at all, but he did. He’d never spent his heat with anyone other than himself, let alone an alpha. He’d never even really done anything with one, other than kissing and light touching. He’d always been content with his own company, but that felt different now.\nHe thought it felt different because of Victor.\nThinking about Victor when he could feel warmth curling through his stomach wasn’t a good idea. He bit his lip, and pressed a hand over his cock, wondering just how long he’d been in the bathroom. Even though this bathroom was technically his now, it had been stocked with all the same products that Victor used. It wasn’t hard for him to imagine that Victor had stood where he stood, maybe even done what Yuuri was considering doing. If he used Victor’s products, would he smell like Victor?\nJust thinking about it made his cock jerk. In the spur of the moment, he gripped himself, and closed his eyes. He could be quick. He hadn’t done this for ages, maybe only once or twice since his Grand Prix defeat, and he knew he would be sensitive because of it. Even just touching himself for a moment was bringing him to full hardness, and it was making his knees tremble. \nHe wondered if Victor had a girlfriend. He’d never mentioned it, and all the gossip blogs Yuuri followed said that he was single. He could have had anyone he wanted, so why didn’t he? \nVictor would be a good lover. He was already quite touchy, always holding Yuuri by the waist or arms to correct his positioning. Would he let his lover touch him, or prefer to do all the touching himself? Would he use just his hands, or his mouth too? Yuuri felt like he could feel those fingers at his waist again, at his shoulders and neck. He tilted his head to the side and lifted his free hand to touch his scent glands, jerking when a spark of pleasure rattled down his spine. He could feel his thighs becoming wet with slick, and was glad the water was there to wash it away before its scent got too prominent. When had he gotten so wet? Was it because he was thinking about Victor?\nHe flushed, and let out a whine. He was thinking about  Victor  while he had his hand around his cock. He knew he shouldn’t, knew he wouldn’t be able to look Victor in the eyes again, but that didn’t stop him. He squeezed his hand tighter, and trailed his other down from his neck to his nipple, and whined again. Everything was so sensitive, but it felt good. Really good. \nHe was so distracted by his pleasure that he didn’t hear footsteps coming up the stairs.\n“Yuuri?” Victor called. “Are you almost done? Dinner is just about ready now.”\nYuuri jumped, his heart hammering. Victor’s voice calling his name sent tingles through his body, and he shakily fell to his knees, pressing his hand to his mouth to cover his panting breathes. “A-almost done!” He called as loud as he dared. He really hoped Victor couldn’t smell his aroused scent.\n“Alright,” Victor answered. “See you in a moment, Yuuri.”\nAnd there it was again, Victor saying his name in that voice. Yuuri whined again, biting down harder on his knuckles as he frantically jerked his cock. His skin was prickling, and heat was pooling heavily in his stomach.  Yuuri, Yuuri, Yuuri.  It was all he could hear, and as he twisted his hand around his head he suddenly came. \nA strangled gasp fell from his lips, one that sounded suspiciously like Victor’s name, as he threw his head back. He was glad he was already on his knees or else he surely would have collapsed. His body twitched as pleasure rushed through him for what felt like ages before he finally came back down. He was covered in his own sticky mess, and couldn’t help but feel a flushed sense of guilt go through him. He’d jerked off to the thought of Victor, and made himself come to the sound of Victor’s voice in his head. It had been so  easy.  He really was infatuated, wasn’t he?\nAs quickly as he could, Yuuri washed himself off and layered his skin in scent-nullifying soap. His face and neck were still flushed, and he knew there would be no way to get rid of it, but he could blame it on the hot water. His thighs were sticky as well, and it made him wince. His heat must be closer than before.\n \nThere was a pharmacy around the corner, and while Victor was distracted with his work, Yuuri snuck out to go to it. He told Victor he was going to the grocery store and insisted he could walk when Victor questioned him, but he was out the door before Victor could really give him more than a curious look.\nAfter being in Russia for more than a month and a half now, Yuuri knew he’d run out of time. His heat wasn’t supposed to be due for another month, but he thought that being around Victor, an alpha he admired so much, was hurrying it along. He couldn’t get the idea that Victor was single out of his head, and his body wanted to entice Victor closer before that changed. Yuuri had already almost finished all the bottles of soap he’d brought along from Japan, so he knew he’d have to get more of them, too.\nFor what it was worth, his training was going well. Victor seemed impressed, and was very keen to push Yuuri even further. They trained almost every day, and Victor had even helped him shed a little weight. Yuuri knew that it all wouldn’t disappear because of his heat, but if he had been on suppressants it would have by now. No one else at the rink seemed to notice that he was an omega, which was good. They just thought he was chubby.\nHe’d learned basic Russian while he was living with Victor too, which was helpful. His English had gotten better as well, which is why he had finally plucked up the courage to go to a pharmacy. Just in case, he had translations ready on his phone, and pictures of the products he wanted.\nThankfully, the pharmacy was empty when he entered. There was a younger girl behind the counter; she smelt like an omega, and Yuuri felt a flood of relief go through him. She greeted him in Russian, but at his panicked look, she switched to English.\n“How can I help you?” She asked.\n“U-uh,” Yuuri fumbled for his phone, flushing. “My heat is approaching, and I need c-contraception.”\nHer eyes widened with understanding, and she nodded. “No problem,” she said, moving around the counter. “Are you spending your heat with anyone?”\nIt took him a moment to work out what she was asking, but he shook his head. “Probably not.”\n“Well, just in case, I recommend this,” she said, pulling a box off of one of the shelves. “It acts like a contraception, and will help with cramps.”\nEven though Yuuri knew he wouldn’t spend his heat with anyone, he always took contraception. It was a form of safety, and most contraception brands helped ease cramps. All of the omegas he’d ever spoken to took contraception when they weren’t trying for a baby and had to go through their heats. The positive effects were worth the pricey medication.\n“Anything else?” The girl asked.\n“O-oh, right, I need scent cancelling soap, too…”\nShe nodded, and found a brand close to the one he’d been using from Japan. “Can I suggest this, too?” She asked, fishing another small box out from under the front desk. “You may not need them, but they help in lessening your scent in the week up to your heat. If you’re not taking time off work for it, then these may help. They lesson the amount of slick your body may prematurely produce, too.”\nHe nodded several times, thankful that she’d offered them. He didn’t know how he’d get away for the week of his heat, but there was no way he could take the one before it off, too. He certainly didn’t need any slick stains on his training outfit. \nWith his purchases in tow, he started heading back home. He was sure to stop at a convenience store on the way back to buy something, just so Victor wouldn’t ask why he didn’t bring any groceries home.\n“Ah, Yuuri, there you are!” Victor exclaimed as he eventually shuffled back in through the front door. Makkachin was woofing excitedly, and almost toppled Yuuri over in excitement – Yuuri had eventually gotten used to that. “I was getting worried.”\nYuuri checked his phone, and winced when he noticed he’d been out for longer than expected. “Sorry,” he said, “I got a little lost.” It wasn’t exactly a lie, he told himself. The way Russian streets were set out were very different from Japanese ones, and he hadn’t quite gotten used to them yet.\nVictor set his face as sternly as he could, and placed his hands on Yuuri’s shoulders. “Next time, I’m going with you, no arguments,” he said. “I don’t want you getting lost ever again!”\nYuuri flushed. Victor was being a protective alpha again, and the omega inside of him preened at the idea of that. He wanted to burrow into Victor’s arms and never go anywhere without him ever again, but that was irrational. Yuuri was an adult, and he could take care of himself. He had done just fine in America, and he would do just fine in Russia, heat or not.\n \nA week passed. Yuuri guessed his heat was only another week away, and was frantically trying to distance himself from Victor’s home. He was getting nesting instincts – staring at cushions for a little too long, sniffing jackets to see how much of his scent had saturated them, searching the house for extra quilts – and it wasn’t good. He’d searched for local heat hotels on his phone during a quick bathroom break (one of the only times when Victor didn’t peer over his shoulder to curiously stare at what he was doing) and found one that was only half an hour away. He could take the train there.\nScheduling time to actually get there, however, proved difficult. For the week after he bought his new medication and soap he tried to find time to get away, but between training and sleeping he just didn’t have any time at all. When he eventually did find time, however, it was on the weekend. Victor got called in to mentor Yuri on their day off – “Honestly, does he have to bother me when I’m relaxing? I want to spend time with Yuuri today!” – and he would only be gone for a few hours, but it left Yuuri with time to himself. \nAfter bundling himself up in two jackets and saying goodbye to Makkachin, Yuuri set off for the heat hotel. He was already starting to feel off, and leaving the house alone made him feel weird. He knew he was getting attached to it, and to Victor too, and it made him feel upset. It wasn’t like he could ever be with Victor, not like that. Victor was just his coach, and maybe his friend.\nThe heat hotel was discreet, and when he stepped through the front door, he was welcomed by gentle, unobtrusive scents and the quiet hustle and bustle of staff members. Only omegas and incredibly neutral betas were allowed to step foot in heat hotels so the space was never tainted by a strong, alpha scent. It was comforting, and cooled the ache in his stomach.\nThere was a quiet omega male behind the front desk that came over to greet him when it became clear that Yuuri was clueless. “Hello,” he said in Russian. He gave Yuuri an inquisitive look and then, surprisingly, switched to Japanese. “You’re Katsuki Yuuri, right? I watched you skate at the Grand Prix. I thought you were a beta.”\nYuuri flushed, and shrunk into his shoulders. He didn’t need to be reminded of that.\n“Ah, sorry,” the omega said, “I didn’t mean anything by it. Is there something I can help you with?”\n“My heat is coming up,” Yuuri mumbled. “I don’t want to nest in the home I’m staying at…”\n“Say no more,” the omega said, offering him a comforting smile. “Want me to show you around? If you feel safe enough to possibly have your heat here, then we can set up the room. There’s no obligations, though. Just a look around.”\nYuuri nodded. “If you don’t mind.”\nThe hotel itself was very nice. It wasn’t as traditional as the ones in Japan and was decorated in a more western style, but Yuuri liked it well enough. The rooms he was shown were soft and smelt bare, which was good. Everything looked very comfortable, and it reassured him that this would be a nice place to spend his heat. The omega explained all the rules to him the company had – one could bring in their toys and supplies, but basic rations and several bottles of water would be supplied, enough for an entire week. Omega staff members would come through twice a day to check on the patrons, and a safety number could be supplied to them in case something went wrong.\n“So what do you think?” The omega asked.\n“I like it,” Yuuri said. \nThe omega nodded. “Alright, do you want to pick a room? You can put down a deposit for the time frame you think your heat will hit, and we’ll keep the room free for a few days beforehand, just in case. If you decide not to come here, the deposit will be completely returned.”\n“R-really?”\n“Yeah, there are a lot of rooms here, so we’ve always got some spare in case a client backs out. Heats can be unpredictable, you know? Sometimes you nest in a place where you feel strongly attached to, and even if you have a room here, you just can’t leave. It happens to all of us at times.”\nYuuri nodded in agreement. He was worried about that, and was glad he’d get his deposit back, just in case he did end up stuck somewhere else for the duration of his heat. After choosing a room – a small one, on the cheaper side, with a nice bed and adjacent bathroom – he put a deposit down and started on his way home. He had to get back before Victor did.\n \nSkating during a pre-heat week was not fun. Usually, when he had his heats back in Japan, he only skated at night time when he had the rink to himself. It let him work through his cramps at his own speed, and he could control how much he spun just in case he felt sick. He couldn’t do that here.\nHe could feel Victor’s concern from across the ice. It was almost palatable. He was staying away from the other skaters, and taking less risks in his jumps. He skated in smaller circles, with less speed, and maybe they thought he was afraid or intimidated, but it wasn’t that. He’d forgotten to take his medication before getting on the ice, and he thought he’d be fine, but already the heat was starting to mess with his balance.\n“Yuuri, try again!” Victor called, as Yuuri backed out of doing a jump. “You can do it!”\nHe really wanted to, for Victor. At that point in time, he’d do anything Victor said, so he started to build up the speed he’d need. From the moment he took off he knew something wasn’t right. Spins and jumps usually happened in a flash, and he was able to control himself well enough through them that they felt slowed down. While this one was still like that, he knew the second he hit the air that he was going to fall.\nHis stomach cramped. It was a strange, unpleasant feeling, to be suspended in the air and have his stomach twist like it did. He flailed for a moment, and when his skates hit the ice, the blades hooked into the surface wrong and he was sent sprawling across the floor. The impact made his head spin, and he let out a pitched whine as his ankle suddenly twisted. His stomach lurched and for a moment he was sure he was going to throw up, but he gasped it down.\n“Yuuri!” Victor shouted. He was skidding across the ice, and then his hands anxiously pulled Yuuri upright. “Are you okay? Where does it hurt?”\nYuuri just groaned. Victor’s scent was clouding his head, and he woozily leaned into it. His instincts were screaming at him to nuzzle in, to surround himself with Victor’s scent and whine needily until Victor comforted him, but with a jerk he pulled himself away. “I’m fine,” he gasped, pushing himself upright. He wobbled on his skates and felt his left ankle buckle out from underneath him. \n“Yuuri, wait,” Victor said. He stood too, and gripped Yuuri by the waist to help him off the ice.\nEveryone had seen him fall. God, Yuuri could feel their eyes on him, and it made his cheeks burn with humiliation. Even with all of Victor’s coaching, he still messed up on a simple trick. \n“You wait right here,” Victor said, helping him to a bench, “I’m going to go fetch a doctor to look at your ankle. Don’t move, alright?”\nYuuri didn’t answer. As soon as Victor was out of sight, Yuuri was ripping his skates off and hobbling towards the locker rooms. He needed to be out of sight, and he needed his medication.\nThe locker room was empty when he stumbled in. He took a moment to shove his skates into his bag after scraping the ice off the blades and putting covers on them. As he did so, his medication toppled out of an open pocket, and he cringed as it noisily hit the floor. He zipped shut the pocket with his skates and turned to pick up the medication, only to find that someone else already had.\nYuri was looking at the medication label with raised eyebrows. He glanced back at Yuuri as if he couldn’t quite believe what he was seeing. \nYuuri snatched back the medication and shoved it as deep into his pocket as he could get it. “Tell Victor I’m going home,” he muttered, before pushing past Yuri. It seemed like the young Russian was too stunned to say anything, but Yuuri wasn’t complaining. He just wanted to go home.\n \nVictor arrived home not long after Yuuri did. Yuuri had only had a short while to shower off his sweat, and he’d buried himself in as much scent-masking soap as he could before crashing on the couch. He thought he’d have longer before Victor arrived, but Victor burst through the front door in a flurry of worry and questions.\n“Yuuri!” He cried, dropping down beside Yuuri to touch his cheeks. “Are you alright? Why did you run off? I was getting a doctor!”\nYuuri’s brow furrowed in a guilty frown, and he turned his head away. He couldn’t lie to Victor, not anymore, so he said nothing instead. \n“You need to elevate your ankle,” Victor said, standing again. As gently as he could, he wrapped his fingers around Yuuri’s ankle and slipped a pillow under it. Just his touch sent Yuuri’s head spinning again. “I’m going to go get pain medication and an icepack, okay? Don’t move this time.”\n“I won’t,” Yuuri whispered. He didn’t think he could. He was just so  exhausted.  He kind of missed home.\nVictor returned a moment later. He carefully placed an icepack across Yuuri’s bruising ankle, and offered him tablets and a glass of water. “Take this,” he urged.\nYuuri could barely sit up, so Victor held the glass to his lips. Yuuri tried to wave him away, saying he could do it himself, but Victor insisted. \n“I’m sorry, Yuuri,” Victor said, as he took a seat on the edge of the couch. He placed the glass of water on the table, and fixed the blanket Yuuri had dragged over himself. “I shouldn’t have pushed you so hard.”\n Does he think this is his fault?  “It’s not your fault,” Yuuri said, eyes wide. “I just… landed wrong, that’s all.”\n“I pushed you,” Victor frowned. He touched Yuuri’s cheek again. “Anyone can see that you look a little unwell, and I ignored it. You should tell me if you’re feeling unwell.”\n“I- I’m not…”\nVictor only shook his head. “You’ve been working very hard lately,” he said, voice soft, “and I’m very impressed. You should rest for a while, hmm? I’ll take care of you.”\nAs Victor stood to leave, Yuuri reached out to him. “Ah, Victor…”\n“Yuuri?”\n“Have you spoken to Yuri?” He asked hesitantly. \nVictor frowned again. “I did speak to him before I came home, yes. Why?”\n“Did he… did he say anything strange?”\n“No. Has he been saying mean things to you again? I know he does when I’m not looking.”\nIf Yuuri were being honest, he actually thought that Yuri was getting used to him. He hadn’t been as grouchy looking as he was two months ago when Yuuri first arrived in Russia. “No, just wondering.”\n“Alright,” Victor said. He leaned down to pat Yuuri’s hand. “Get some rest now, okay? Call me if you need anything, I’ll just be in the kitchen.”\nYuuri dozed for a while, content to listen to Victor wander around in the house. He always woke when Victor came to check on him, but he wasn’t fussed by that. Victor didn’t let him do anything – not even reach for the glass of water on the coffee table – and if he heard Yuuri start to shift around then he was peering in to make sure he was okay. \nYuuri kind of enjoyed it. He felt taken care of, and knowing that he didn’t need to do anything other than rest was reassuring. Sure, he knew he had to get to the heat hotel sooner rather than later, but he didn’t have the motivation to move. Victor had tucked him in and brushed his hair away from his eyes and folded his glasses up neatly. He just felt really at ease.\nWhen he was woken later that evening, it was to Victor’s fingers gently carding through his hair. “Yuuri,” Victor murmured, “would you like some tea?”\nYuuri let out a small huff at being stirred, and blurrily blinked up at Victor, who was leaning over him. How long had he been sitting there, playing with Yuuri’s hair? It felt so good…\nVictor chuckled at his blurry-eyed look. “Tea?”\nBlinking, Yuuri tried to process the question. It was getting harder and harder to do that these days. Tea sounded good, yes, but caffeine did not. It aggravated his stomach, as it did for many omegas approaching their heats. “Do you have anything herbal?” He asked, voice croaky with sleep.\nVictor hummed. “No, but I’ll go out and get some. What do you like?”\n“N-no, it’s okay…”\n“It’ll only take a moment. Come now, tell me what it is you would like.”\nYuuri hesitated, before quietly murmuring, “Peppermint…”\n“I’ll be back in a few minutes, then,” Victor said. He lingered for a moment, his fingers still in Yuuri’s hair, before he sighed and turned away. \nYuuri waited until he heard Victor’s car pull away before hesitantly standing. His ankle was still sore, but it would be fine tomorrow. He shuffled around aimlessly for a moment before finding himself at the front door – he must have followed Victor’s scent without realising. It was quite strong here…\nAfter a second, he realised why. Victor’s jacket was hanging on the hook by the door. He must have placed it there when he rushed in earlier and forgotten about it. When Yuuri plucked it off the hook and brought it to his nose, Victor’s powerful scent filled his head. He let out a happy purr as he buried his face in the jacket, rubbing Victor’s scent across his cheeks.  This would make a good addition to a nest,  he thought. He already had blankets, and towels from Victor’s washing machine, but he wanted this more than anything. Before he knew it, he’d stashed the jacket in his room and returned to the couch, sitting himself down as though he’d never moved.\n \nHe returned to skating the next day, despite Victor’s reluctance. He watched Yuuri like a hawk, and never let him stray. He even followed Yuuri into the locker room, where Yuuri put on his skates and left his bag. \nThey took it easy that day. Yuuri was glad; his thoughts were focused on his impending heat, avoiding Yuri’s stare, and how he would get to the heat hotel. He really needed to go there today, he thought. His heat might come even earlier than he expected, especially with so many alphas around. \nIn fact, he was in the middle of a routine when he suddenly felt a sharp jab of heat go through his stomach. He stopped right away, stumbling off the ice with a hasty, “Bathroom!” thrown over his shoulder for good measure. When he escaped to the bathroom in the locker rooms, and after putting his skates in his bag, he immediately went to the sinks to shove his hands under cold water. He splashed it on his face to cool his cheeks before glancing at his reflection.\nHe looked awful. His cheeks were unnaturally red and his eyes looked unfocused. Skating had made his hair a mess, and even when he jerked a hand through it, it only became messier. He was too close to his heat to be out and about like this, he knew, but he just didn’t want to disappoint Victor. Absentmindedly, he lifted the neck of his shirt and took a sniff. His scent was definitely getting too strong for his soaps to hide. It was a miracle Victor hadn’t scented him yet, but Yuuri was layering it on kind of thick. Still, he’d probably have to at least wash his hands with it before going out again.\nThe sound of people walking in had him jumping. He could smell they were alphas straight away, but they didn’t look like anyone he recognised from the ice rink. They must have been from the adjacent gym, and when he caught sight of them, he cowered. It was expected that alphas were taller and broader than him, but these ones looked like weight lifters. \nOne scented the air, and then their eyes were on him. He shrunk into his shoulders and kept his eyes firmly on the mirror, but he could hear them approaching, and could smell their scents saturating the air. He knew he would be vulnerable to any alpha scent and tried hard to hold his breath, but he couldn’t manage.\nThey were talking in Russian. He only knew a few words – like “omega” and “alone” – and it frightened him. His own scent was turning sour, and he flinched when an alpha grabbed him by the elbow.\n“P-please, don’t,” he whimpered. His Russian was too broken to come across strongly, and it just made the alphas laugh. Yuuri knew his scent was getting to them, was making them pump out enough hormones to saturate the bathroom, and it made him panic. He tried to pull his arm back, feeling too vulnerable in his workout clothes, but the alpha’s grip on him only tightened.\nAbruptly, his arm was yanked up. He let out a whine as the alpha pulled him forwards, making him stumble. Other hands tugged at the hem of his shirt, slipping under to grab at his stomach and chest. He tried to squirm away, but their grip on him tightened.\n“Stop!” He cried. He jerked his elbow back and it connected with one of the alphas, who let out a wheeze before snarling. Fingers tightened in his hair, yanking his head to the side, and he let out a petrified yelp as his neck was exposed. Someone’s breath ghosted over his skin, but it only made him fight harder. He didn’t want to be marked by these strangers, didn’t want to be bitten or touched by them. They were trying to make him submit.\nThe bathroom door was suddenly flung open again, and an irritated growl cut through the air. Yuri looked absolutely  murderous  as he glared out from beneath his fringe. He snarled something in Russian, and almost instantly the offending alphas had their hackles raised. They said something back, and Yuri’s face twisted.\n“Victor!” Yuri shouted over his shoulder. \n Victor can’t see me like this! Can’t see me- see me being so weak!  Yuuri, panicked, pulled his arm free and pushed the alpha off of him. The other’s hand tightened in his hair, and he let out a weak growl. \nBut then Yuri was in front of the alpha he’d pushed away. Before Yuuri knew what had happened, the alpha was on the floor clutching his nose, and Yuri had his fist raised. He sent another thunderous glare to the two alphas still crowding around Yuuri, but they only snarled.\nVictor appeared in the doorway, looking frantic. His eyes searched the room before landing on Yuuri, and Yuuri couldn’t help but freeze under that piercing gaze. He’d never, ever seen Victor looking angry, but right then he looked downright  cruel. \n“V-Victor,” Yuuri whimpered, eyes teary. He couldn’t even smell Victor’s scent over the repugnant smell of the alphas. \nIn a rush, the alphas holding him still tossed him aside. Yuuri stumbled back under the weight of their movements and cried out as the back of his head smacked against the edge of the sink. He hunched over, his hands finding the back of his head, as his eyes stung. \nThe room was filled with growls and the angry scent of alphas. It was almost suffocating, and Yuuri gasped as it sunk into his skin. He cowered under the sink, his hands clasped over his nose, his eyes squeezed shut. It couldn’t have lasted more than a minute before hands were grabbing for him. He flinched again, a full body movement, but then someone was cooing.\nIt was Victor reaching for him. Yuuri stared, eyes wide, and allowed Victor to coax him out from under the sink. He could smell Victor’s scent now, strong and overwhelming, but it didn’t frighten him. He was pulled into Victor’s arms, tucked into his side, and ushered out of the bathroom. Yuuri snuck a glance over his shoulder and saw Yuri standing over the alphas – they were knocked out cold. Yuri wandered out of the bathroom a moment later, his phone pressed against his ear, with Yuuri’s bag in his hand.\n“I called the police,” Yuri said, handing Yuuri’s bag to Victor, who shouldered it. “Coach will make sure the media doesn’t get wind of this.”\nVictor nodded, his hand tightening on Yuuri’s waist. He murmured something low and quiet in Russian that Yuuri couldn’t quite understand, but it made Yuri’s eyebrows rise.\nWhen Yuri said something back, the only thing Yuuri understood was “omega”, and the last “dumbass” that Yuri threw in, in English, for good measure. \nIt made Victor startle, and glance down at Yuuri, his eyes wide. He lowered his head and pressed his nose into Yuuri’s hair, and a low noise built up in his throat. Yuuri shrunk away from it, mortified. Victor knew he was an omega now, right? Would he even want Yuuri to stay with him any longer? \n“We’re going home,” Victor murmured. “Come on, Yuuri. Let’s go.”\nYuuri didn’t protest. He tried to take his bag back from Victor, but Victor wasn’t having it. He was taken to Victor’s car, and settled in the back seat. Victor gave him his bag to hold, which somehow made him feel better, before laying his jacket across Yuuri’s lap.\n“We’ll be home soon, okay?” Victor said, smoothing his fingers through Yuuri’s hair. “You’ll be alright, Yuuri.”\nIn Victor’s car, surrounded by his scent, Yuuri felt a little better. He shook his head to clear his thoughts and gathered his wits. He wouldn’t let himself be some pitiful omega, and after sucking in a huge breath, he calmed his trembles. “Victor,” he started.\n“Are you alright?” Victor interrupted. He glanced at Yuuri in the rear-view mirror for a moment. “They didn’t touch you, did they?”\n“N-not really…?”\n“Where did they touch you, Yuuri?”\nHe swallowed, and clenched his fists. “M-my stomach, and chest,” he admitted. He rubbed his neck, where his muscles had been stretched too far. Victor’s eyes followed the movements of his hand. “They pulled my hair.”\nVictor gritted his teeth, and took a deep breath. The tension in his jaw and scent began to ease away. He was quiet for a moment. “Are you an omega, Yuuri?”\nYuuri stiffened, and lowered his head. “Yes…”\n“I thought you were a beta.”\n“I’m sorry.”\n“Don’t apologise,” Victor said, as he steered his car into the driveway. “You did nothing wrong.”\n“I lied.”\n“I didn’t ask. I just assumed.”\nHe felt bad. Yuuri felt like he’d somehow disappointed Victor, or that he’d done something really wrong. This close to his heat, he was far too hormonal to sort through his emotions rationally. He just wanted to make Victor happy. Why did his biology have to ruin everything that he enjoyed?\nVictor exited the car, and came around to Yuuri’s side to open the door. “Yuuri, come here,” he said.\nYuuri did. He hadn’t expected Victor to bundle him up again, but the alpha did. Being tucked under Victor’s arm was comforting, just like his eyes on Yuuri when Yuuri skated were. Victor reached for his bag, too, before leading him to the front door, but Yuuri’s legs unexpectedly crumbled out from beneath him. “S-sorry,” he said again. \n“Don’t apologise,” Victor reminded him. He adjusted his grip on Yuuri’s bag, slinging the strap over his shoulder, before reaching down to lift Yuuri from the ground. Yuuri let out a surprised yelp, his fingers digging into Victor’s shoulders as he suddenly found himself pressed chest-to-chest with Victor. “It’s okay,” Victor said when Yuuri started to protest. “Please let me take care of you, Yuuri.”\n“Why?” Yuuri mumbled. \nVictor bit his lip, and glanced away. His cheeks looked red. “I like you,” he whispered. \nYuuri blinked at him, confused. Had he heard right? “Why?” He repeated, his heart hammering. He felt small, even though he wasn’t. “Is it because I’m an omega?”\n“No!” Victor exclaimed. “No, I thought you were a beta, and I still liked you.”\n“But why?” He was getting desperate, he knew, but he just didn’t understand. “Why would someone like you like someone like me?”\n“What do you mean?” Victor frowned.\n“You’re… you’re an alpha,” Yuuri said helplessly. “You won at the Grand Prix. Everybody loves you, and you’re- you’re perfect, but I’m…” He shrugged, uselessly gesturing to himself. “I’m overweight, and I can’t skate as well as you, and-”\n“Yuuri, please don’t speak like that,” Victor pleaded. He left Yuuri’s bag at the front door, and carried him to the couch. “I don’t want to hear the person I love speak so poorly of himself. You must know by now that I don’t think any of that, right?”\nYuuri didn’t answer.\n“Oh, Yuuri,” Victor said, voice dismal. He curled his fingers behind Yuuri’s ears, his palms cradling Yuuri’s chin as though he might suddenly break. “I like your body how it is, no matter the size, and there’s nothing more I enjoy than seeing you skate. Watching you do my routine… It’s what drew me to you, what made me seek you out.” He took Yuuri’s hand, and pressed it over his chest. “Your skating makes my heart flutter.”\nHe didn’t understand how such a thing could be possible. His skating was nothing special, not compared to Victor’s. What about him could make Victor say such things? \n“Let me see your head,” Victor eventually murmured. He stood and leaned over Yuuri, carefully parting his hair to see where he’d hit it on the sink. “I’ve never been so scared in my life.”\nThat made Yuuri paused. “Scared?”\n“Seeing you trapped by those- those  monsters,”  he said. A tremble went through his body, but he kept it under control. “I was so angry, I’ve never wanted to hurt someone else as much as I did then. I shouldn’t have let you out of my sight.”\nYuuri flushed.\n“Your head seems okay,” Victor said. “Do you feel dizzy? Does it hurt much?”\n“No.”\n“I’m glad.” \n“Thank you for helping me,” Yuuri whispered.\nVictor took his hands again, and sat down beside him. “I’ll never let anyone hurt you again, I promise,” he said. His eyes were dark with determination. He was quiet for a moment, before taking a deep breath. “Yuuri, how close is your heat?”\nYuuri jumped, his eyes going wide.\n“I need to know,” Victor explained, his voice careful. “As an alpha, there are things I must do depending on how comfortable you are around me. Not only is it my moral duty as an alpha, but it is as someone who cares about you very deeply, too.”\n“It’s… its closer than it should be,” Yuuri finally said. “It’s not meant to come until next month, but I was on suppressants during the Grand Prix so I haven’t had one since then, and being around so many alphas… I didn’t expect it after I went off the suppressants, so I wasn’t taking any medication.”\n“Are you taking any now?”\nYuuri nodded. “But I think it’s going to happen this week,” he said quietly. “I-I booked a room at a heat hotel, I can go-”\nVictor let out a strange noise. “You can stay here!” He said, his hands tightening around Yuuri’s. “Have you started nesting? Do you feel safe here, around me?”\nYuuri flushed, and nodded again. His room was a mess of fabrics at the moment, and it was quite embarrassing. \n“Then you should stay here,” Victor said firmly. “Please, Yuuri, it would make me feel much better.”\nHearing that made Yuuri want to comply, without even thinking about it. He wanted to be good for Victor, to please him. “But what about you?” Yuuri asked. “I don’t want to make anything bad for you.”\nVictor stroked his hand. “I doubt anything you could do for me would be bad,” he said. “We have a while, don’t we? We'll figure it out later. Rest is more important now, no?”\n“Alright…”\n“Come, I’ll take you to bed,” Victor said, standing.\nYuuri flushed again. “Y-you don’t have to!”\nVictor paused. “Oh! Is your nest there? I’m sorry, I don’t mean to intrude…”\n“No, it’s okay, you’re not intruding,” Yuuri said. Most omegas became defensive when someone found or mentioned their nest before their heat, but Yuuri felt ridiculously comfortable around Victor. “I just don’t want to cause you any trouble.”\nVictor grinned. “It’s no trouble at all!” He exclaimed, opening his arms wide. \nIt was embarrassing to be carried by Victor, and Yuuri was pretty sure he could walk fine just now, but he didn’t protest. He enjoyed being so close to Victor’s scent, and the warmth of his body was unlike anything else. Even if it meant exposing his nest, he wanted to be closer to Victor.\n“Your nest looks cosy,” Victor said, as he pushed the door to Yuuri’s room open. His eyes were alight with curiosity, and he paused in taking Yuuri to his bed so that he could look around a little more. “Is that the cushion from the couch? Oh, and that’s the missing towel from my bathroom! Yuuri, you’ve amassed such a wonderful collection.”\nHe could feel a purr starting to build in his throat. With every word of praise Victor gave to him – about his  nest,  his nest! – Yuuri felt himself become more languid. “Thank you,” he said, cheeks flushed. \n“Oh! And there’s my jacket!” Victor chuckled. He set Yuuri down and walked closer to the bed, plucking his jacket up. “Did I even wash this?”\nYuuri whined. That was a part of his nest, Victor couldn’t wash it! He wanted it just like it was. \n“I’m sorry, I’m sorry,” Victor chuckled again, putting his jacket back down. “But Yuuri, you’re just so cute. If you wanted my clothes for your nest, you could have just asked! I’ve been blaming Makkachin for that missing jacket, you know.”\n“Sorry.”\n“Nonsense,” Victor waved a hand, “it makes me very happy to see a part of me included in your nest. Shall I bring you more things with my scent?”\nYuuri’s eyes widened. More? He definitely wanted more. “C-can I have them…?”\nVictor’s eyes brightened, as did the smile spreading across his face. “Of course!” He took Yuuri by the hand and led him to the bed. “Rest, now, I’ll go grab some things.”\nWhen Victor left the room, Yuuri changed into more comfortable clothes and laid out on his bed. He felt relaxed to be in his nest, and comforted by all the things he’d collected in the past week or so. A minute or two later, Victor returned, his arms laden with clothes. Yuuri just gave him a raised-brow look, which made Victor grin sheepishly.\n“I didn’t know what you wanted,” he said, “so I grabbed whatever I’d left out. Can I put them in your nest?”\nYuuri flushed. He didn’t think Victor knew what offering that meant to omegas. Usually, omegas were fiercely protective of their nests. If someone found it before it was finished, the omega would likely dismantle it and move it elsewhere, albeit irritably. Letting someone help build the nest, however, was even worse. Omegas only let bonded mates build their nests, and usually only when they trusted their mate an incredible amount. \nBut Yuuri trusted Victor, so he nodded, and Victor gave him another handsome grin. How was it possible for anyone to be so beautiful? Yuuri didn’t understand it, couldn’t help but stare at Victor in wonder as Victor arranged his clothes around Yuuri’s bed. \n“Do you need anything, Yuuri?” Victor asked.\nYuuri shook his head. He was quite content, actually, more so than he’d felt in a while. If he could stay in his nest for his heat he would feel even better. He didn’t have anything prepared, but he thought he might have a little time left tomorrow to make preparations. He felt okay with drifting off to sleep, now.\nAt least, he did until Victor moved to leave the room. That made Yuuri’s heart twist in worry, and when he peered over at Victor, he found Victor lingering at the door. \n“Yuuri, can I stay…?” Victor asked, hesitant. “I won’t do anything to disturb you, I promise, but I still feel… riled up. I don’t want to leave you.”\n“Please stay,” Yuuri whispered.\nVictor smiled. “I’ll go get changed, alright? I won’t be gone longer than a moment.”\nYuuri nodded. \nLike he’d said, Victor wasn’t gone for more than a few minutes. He came back in wearing a loose shirt and pants, the same thing he often wore around the house. It was different seeing him in such casual clothing when Yuuri was used to his extravagant costumes, Russian uniform and tailored dress clothes. Different, but not unwelcome.\nHe didn’t move when Victor climbed into bed beside him. The weight of Victor pressing down on the mattress sent flutters through Yuuri’s heart. He could smell Victor’s scent permeating his room, and it made a nice warmth pool in his stomach.\n“Yuuri?”\n“Hmm?”\n“Can I put my arm over you?”\nYuuri flushed. “Mmm.”\nVictor inched closer and gently settled his arm around Yuuri’s waist. “Will you spend your heat here?” He asked, pressing his forehead against the back of Yuuri’s head.\n“I-if it’s okay with you…”\n“It’s  more  than okay with me.”\nA giddy smile touched Yuuri’s face. “O-okay. I will, then.”\nVictor nuzzled the back of his neck, humming cheerfully. “Can… Can I spend it with you? If you don’t mind.”\nYuuri’s eyes widened. He rolled over, peering at Victor. “You want to?” He asked, voice quiet. “It’s not just because I’m an omega?”\n“I want to,” Victor said. “I really want to. But only if you want to, as well.”\n“I do!” Yuuri said, breathless.\nVictor gave him another grin, but this one seemed slier than his other ones had been. “Good,” he cooed, trailing his nose along the curve of Yuuri’s cheek and jaw. \nA purr built up in Yuuri’s throat. It was embarrassing, but he didn’t stop it this time.\n“Purring already?” Victor asked, surprised, as his hand swept down to dip underneath the neck of Yuuri’s shirt, finding the spot where his purr would reverberate the most. “What a pleasant surprise, Yuuri.”\nThe praise only made him purr louder. He felt spoiled, and he’d only been resting in Victor’s arms for a moment. “Victor?”\n“Hmm?”\n“Before, did you… did you say ‘love’?”\n“Yes, I did.”\nEmbarrassingly, his purr only increased. \nVictor let out a pleased rumble in response. It was such an alpha sound that Yuuri almost swooned. “Rest now,” Victor urged, lightly tracing his fingertips across Yuuri’s chest and stomach. “I’ll watch over you.”\n \nYuuri slept surprisingly well that evening. He woke up once to the soft sound of Victor snoring behind him, and after meticulously adjusting his nest, he returned to sleep again. The next time he woke up, however, he knew something was wrong.\nHe felt  hot.  Not just because he was under the covers and under Victor’s arm, but because of a different reason. There was heat prickling at his skin and causing sweat to dampen his hair and even when he squirmed into a new, cool spot, it didn’t abate.\nHe let out a weak huff, and squirmed again. “Victor…” He whined, rutting his hips against the mattress. It sent a spark of pleasure through him, and he couldn’t help but whine again. He needed more. “Victor…!”\nVictor stirred, and his blue eyes slowly blinked open. “Yuuri? Are you alright?”\n“Alpha, please,” he whimpered. \nThat seemed to wake him up. Victor sat upright, his brow furrowing, as he touched a hand to Yuuri’s face. “You’re hot,” he said. His eyes widened. “Yuuri, are you in heat? I thought it wasn’t supposed to happen yet.”\nHe huffed again. Rationally, he knew the stress of yesterday and his closeness to Victor must have moved it forwards. He knew that could happen, but it hadn’t even crossed his mind. Now, however, he just wanted his alpha to touch him.\nQuietly, Victor shushed his whimpers. “Calm down, Yuuri,” Victor said. He had a rather affectionate look in his eyes, and it helped relax Yuuri. “I’m going to go and get everything we need, alright? I’ll be back in just a moment. I’m not leaving you.”\nIt was reassuring to hear that, so Yuuri didn’t put up much of a fuss when Victor left. He rolled over onto Victor’s side of the bed and pressed his face into Victor’s pillow. His scent, pure and unmasked, made Yuuri’s body stir more than it already had.\nVictor returned with a box of things a moment later. Yuuri could see ration bars and bottles of water, as well as tissues, lubricant and towels. It was all the basic things he’d need to stay comfortable and healthy during his heat, and knowing his alpha had remembered it all pleased him greatly.\n“I think I’ve got everything,” Victor said. He placed the box by the bed, and crawled over to sit beside Yuuri again. “Yuuri, are you sure you want me to stay for your heat? You can say no, if it’s not what you want. I need your consent to stay.”\n“I want you to,” Yuuri said. “I’m still coherent enough to say that.”\nVictor smiled, and laid down beside him. He tossed his arm over Yuuri’s back and nuzzled against Yuuri’s cheek. “I’m glad,” he said. “Is there anything you don’t want me to do?”\n“Like what?”\nVictor hummed. “Well, I want you,” Victor said. He shifted, shifting his leg in between both of Yuuri’s pointedly. “All of you. And if you don’t want that, I need you to tell me now.”\nYuuri flushed. “I’ve- I’ve never…”\n“Had sex?”\nHe let out a mortified moan. “Yes.”\n“It’s fine, Yuuri,” Victor said. “I quite like the fact that I’ll be the first to experience such a lovely sight.”\nYuuri buried his face in Victor’s pillow again. “I want it,” he mumbled. He peeked at Victor, unable to help himself. “If that’s okay.”\n“More than okay,” Victor purred. He shifted closer, nuzzling Yuuri’s cheek again. It was making the scent glands on Yuuri’s neck go crazy, and Victor seemed to enjoy it. “How far have you gone with others?”\n“Not very far…”\n“Kissed?”\n“Yeah.”\n“Touched?”\n“Sort of.”\n“But not sex?”\n“No,” Yuuri answered. “Victor, this is embarrassing.”\n“I know,” he chuckled, “but I need to know your boundaries. I don’t want to frighten you, Yuuri. I’ve heard that heats can get very intense.”\n“You’ve never…?”\n“Not with an omega, no.”\n“So it’s your first, too? Sort of.”\n“It’s my first with an omega, and my first with someone I care very much about,” Victor said. “I’m quite happy you’re letting me share this with you.”\nYuuri made a pleased sound without quite meaning to. The omega part of him that was lurking right beneath the surface was overjoyed to have such an attentive alpha. “I don’t want my first time to be in the haze of a heat,” he mumbled.\nVictor’s eyes flashed. “I can help with that,” he said, smiling a cheeky smile. “If you want, that is.”\nYuuri shifted his hips. He definitely wanted that. He’d never imagined that his first time would be in a heat, and he’d rather remember how it happened without the heat affecting him too much. Even more so because it was with Victor. \nVictor pressed his fingers under Yuuri’s chin to tilt his head up. “Let’s start with a kiss, shall we?”\nYuuri whined as Victor claimed his lips in a sweet kiss. It was gentle and tender and everything he wanted, but it only made the heat in his stomach intensify. He’d never been kissed so passionately in his life. \n“That okay, Yuuri?” Victor asked, pulling back an inch. \nYuuri could feel Victor’s breath brushing against his lips. It was intoxicating, and for a moment he couldn’t form words. “’S good,” he finally murmured, eyes hooded. “More…”\n“Your wish is my command,” Victor said, voice low. He leaned down and kissed Yuuri again, but this time he was less gentle, and more fervent. His fingers cupped Yuuri’s face, changing the angle as he wished, and he let out a pleased rumble as Yuuri whined. “Open up for me, Yuuri,” he whispered. \nYuuri couldn’t help but obey. When Victor kissed him again, his mouth opened, and Victor’s tongue slipped inside. It wasn’t as gross as he’d imagined it would be, and he instead found himself pressing his thighs together to stop from coming too fast. Victor had hardly done anything to him and he was already too far gone.\n“Good,” Victor murmured, pulling back again. He ran his thumb over Yuuri’s lips and shushed him when he whined. “I’ll please you yet, Yuuri. No need to rush.”\nHe huffed. “Don’t tease me…”\nVictor chuckled, and gave Yuuri a fond look. “But this expression of yours is so cute.”\nYuuri pouted.\n“And now you’re even cuter,” Victor declared. He inched closer into Yuuri’s space, urging him onto his back, before laying half on top of him. He shifted his leg and grinned when his knee rubbed against Yuuri’s crotch. “Feel good?”\nHe nodded, and tentatively lifted his hands to grip at Victor’s shoulders. “Hurry…”\nVictor chuckled, and kissed him again. He wasted no time in prying Yuuri’s mouth open this time, and slipped a hand down to rub at Yuuri’s scent glands. Almost instantly the smell of pleased omega burst into the room, and it made Victor groan. “You smell so good, Yuuri,” he gasped between kisses. “You’ve always smelt so good.”\n“A-always?”\n“Mmm.”\nYuuri moaned when Victor’s hand travelled lower. He felt too hot in his clothes and wanted to take them off, but the thought of Victor seeing him naked made him nervous. He’d already seen Victor named in the onsen, and Victor’s body was absolutely perfect. Yuuri’s own was not.\n“Can I take this off?” Victor asked, tugging at Yuuri’s shirt. “I want to see you.”\nYuuri hesitated, biting his lip. “I’m not… I still haven’t lost all the weight I gained.”\nVictor hummed, and sat up. The warmth of his body left, and Yuuri sorely felt its absence. “I want to see you,” Victor repeated. “I love your body. I watch you skate, and every time your shirt lifts during a jump I’m positively enraptured.”\nHis breath got caught in his throat. Victor was watching him like that? Just the thought of it made his cock twitch. Although he was still nervous, he let Victor remove his shirt. He had to sit up to get it over his head, which left him with a lapful of Victor. For what it was worth, Victor seemed just as excited as Yuuri felt.\n“You’re beautiful,” Victor said. He ran his hands down Yuuri’s shoulders, and then his arms and across to his chest. His touch sent shivers down Yuuri’s spine. “I want to see more.”\nYuuri nodded to that, too, but he tugged on Victor’s shirt first. He didn’t want to be the only one naked and vulnerable.\n“Alright,” Victor laughed, leaning back. “All clothes off then.”\nSomehow, Victor’s teasing nature relaxed Yuuri enough to laugh. Even when all his clothes were gone and he was left bare to Victor’s eyes, he felt safe. Sure, he was embarrassed over his clearly slick thighs and how evidently aroused he was, but he could blame it on his heat.\nVictor cupped his face and lowered him back down again. “Better now?” He said, smiling against Yuuri’s lips before kissing him again. Yuuri nodded his assent, but coherent thought was lost as Victor really started to get into it. Yuuri moaned as Victor trailed his lips down his neck, and jumped when he started laving his tongue over Yuuri’s scent glands. It sent them into overdrive, and he couldn’t help but cry out as Victor started sucking a bruise into that spot. \nYuuri wanted to reciprocate. He pressed his hands into Victor’s shoulders and trailed them down his arms, trying to memorise every dip and curve of the body he’d admired for so long. When he buried his face in the crook of Victor’s neck and nuzzled against Victor’s scent glands he was rewarded with a breathless little moan from the alpha. Victor smelt so good too, and the more Yuuri nuzzled at him, the stronger his scent became. \n“You’ll make me come too soon if you do that, Yuuri,” Victor said. He threaded his fingers through Yuuri’s hair and drew his head back, exposing his dark eyes and flushed cheeks to Yuuri. \n“That’s not a bad thing,” Yuuri said.\nVictor’s eyes flashed. “I suppose not,” he said, grinning coyly. He pressed his face back into Yuuri’s neck and licked a line down to his scent glands, making Yuuri cry out. “But I’d much rather make you come, first.”\nVictor’s hand ran down his chest again. He followed its path with his mouth, ignoring the way Yuuri arched and jerked at each wet kiss. Victor seemed intent on marking Yuuri’s chest and throat with bruises and did so readily. “Victor,” Yuuri whined, tangling his fingers in Victor’s soft hair. “Victor, Victor…”\n“I could listen to you say my name like that all day,” Victor murmured, “but I’d like to hear you make other noises, now.”\nYuuri gasped as Victor dragged his tongue over his nipple. He was gentle for a moment before he set his teeth to it, switching between biting and sucking in a way that had Yuuri squirming uncontrollably. Once he was done with the first he moved to the second, and let his hands play as freely as he wished. Yuuri couldn’t help but whine and huff as Victor left bite marks in the soft flesh of his chest. \nSteadily, Victor moved lower. Yuuri’s hips twitched as Victor neared his cock, but he lingered at Yuuri’s stomach instead, giving if the same treatment he’d given Yuuri’s chest. “You’re so soft,” Victor murmured, more to himself than to Yuuri, as he focused intently on what he was doing. \n“Victor,” Yuuri whined again. Victor had moved past his cock, completely ignoring it, in favour of biting at his inner thighs. He was laid flat against the bed now, and was using his hands to spread Yuuri’s legs wider and wider. He lifted one over his shoulder so that he could bite at the inner crease of Yuuri’s thigh, which made Yuuri cry out. \n“Yuuri, you smell so good,” Victor murmured. “Can I taste?”\nYuuri just moaned. His mind was hazy with pleasure, and he couldn’t feel anything other than Victor. He didn’t exactly register what Victor was doing until his leg was pulled higher, completely exposing him. “V-Victor?”\n“It’s alright,” Victor cooed. He licked at the slick on Yuuri’s thighs and moaned, before biting at the flesh just hard enough to leave a bruise. Yuuri jerked in his grip, and threw his head back when Victor’s tongue moved lower and lower. When it touched his leaking hole, he practically arched right off the bed. Victor let out a muffled sound and pressed his hand firmly against Yuuri’s stomach, keeping him still. He dragged his tongue across Yuuri’s hole again, licking up his slick, and Yuuri couldn’t help but thrash.\n“Victor, Victor…!” He gasped, twitching. He threw his head to the side, and tightened his fingers in Victor’s hair. “I’m going to…!”\nVictor redoubled his efforts. He pressed in closer and pushed his tongue past the tight ring of muscle, then moaned.\nYuuri arched again, his mouth falling open as he came. He felt a rush of slick come from him as his cock spurted across his stomach, and after a breathless moment, he got his breath back. When he opened his eyes again and looked to Victor, feeling embarrassed at how quick he’d been, he found that Victor had fixed his eyes firmly to Yuuri’s face.\n“Beautiful,” Victor murmured. He licked his lips once, making Yuuri whine, before leaning up to capture his lips again. “You’re so beautiful, Yuuri. You’re being so good for me.”\nYuuri whimpered, and hid his face in Victor’s neck.\nVictor’s hand came down to swipe through the mess on his stomach before his fingers wrapped around Yuuri’s cock. “You taste so good,” Victor whispered into his year. “I could listen to you make such pretty noises for me all day.”\nYuuri’s cock twitched again. He’d only just come, but he was still hard, and at Victor’s words he started to pant. “Victor,” he whined.\n“Oh?” Victor teased. “Do you like being told you’re a good boy, Yuuri? That you’re so beautiful it takes my breath away? That I could look at you all day and never get bored?”\n“Victor!”\n“Alright, alright,” Victor chuckled. He gripped Yuuri’s hand, and pulled it down to his crotch, making Yuuri squeak. “See how hard you make me, Yuuri?”\nYuuri let out a nervous stutter, his eyes locked on Victor’s cock. It was bigger than he expected, and hard in his hand. He followed Victor’s movements for a moment before rubbing it himself, his eyes wide. Victor’s hips twitched at his touch, and he groaned. \n“Sit up, Yuuri,” Victor urged. He leaned back against the headboard and pulled Yuuri into his lap so that they were face-to-face before kissing him again. Victor’s large hands skittered down his sides before reaching for his ass, gripping him tightly. Yuuri moaned against Victor’s mouth, and sucked in loud gasps of air when Victor trailed kisses down his throat again. When Victor’s fingers pressed against his hole, he cried out.\nIt felt good. Better than good. Yuuri had fingered himself during his heats before, but to have someone else doing it felt completely different. Even more so because it was Victor. When Victor’s finger first breached him, he couldn’t help but whimper. It didn’t hurt – he was really slick from his first orgasm – and it only felt good. Victor seemed encouraged by his reactions and pushed in another, scissoring them gently.\nThat burned a little bit more, but not badly. Yuuri rocked back into his touch, all but fucking himself on Victor’s fingers as he did. He couldn’t help but whine and thrash as Victor’s fingers got close to his prostate.\nVictor seemed to notice. He watched Yuuri’s face closely as he pressed a third finger in, but Yuuri hardly felt the stretch as Victor’s fingers grazed his prostate. He cried out and arched against Victor, grinding their cocks together as he did so. \n“Found it, did I?” Victor murmured.\n“M-mm…”\n“Good,” Victor purred. He pressed against that spot again, and if Yuuri hadn’t just come he certainly would have then.\n“Victor!” He whined. “Please.”\nVictor hummed, and shifted them again. He laid Yuuri down on his bed and stretched out on top of him, his hands on either side of Yuuri’s shoulders. When he lowered his hips to press their cocks together Yuuri cried out. He could feel slick rushing down his legs, and the heat was really started to get to him. He didn’t know how much longer he would be able to remember his own name.\n“Please,” he whined again. \nVictor cooed at him. He reached a hand down to push Yuuri’s thighs apart again and tested his entrance once more before lining up his cock. “Breathe in, sweetheart,” he murmured, leaning down to nibble at Yuuri’s scent glands again.\nThe distraction of it was enough to muddle Yuuri’s mind as Victor pressed in. But the size of him was unmistakable, and Yuri couldn’t help but wince as it started to burn. There was a weird pressure that filled him, but as he breathed out, it lessened. Victor continued to lick and suck at his neck until he had fully pressed in, and even then he didn’t relent.\nOnly when Yuuri was squirming and mewling did Victor start to move. He was slow at first, just to let Yuuri adjust, but soon enough he seemed to lose himself. Yuuri reached up both hands to cup Victor’s cheeks, his eyes glued to Victor’s face as Victor started to thrust. “Victor…” He whimpered. \nVictor growled. It was a low, possessive sound that send ripples of pleasure through Yuuri. Victor gripped his hips hard enough to bruise as he thrust, almost like he was pulling Yuuri back onto his cock. “Mine,” he snarled, his eyes jerking between the place they were connected and Yuuri’s face. “Mine.”\nYuuri whined, and tightened his fingers in the loose strands of Victor’s hair. Victor’s eyes had gone dark with arousal, and his scent had completely saturated the room. As Victor adjusted his angle he was suddenly hitting Yuuri’s prostate head on, and Yuuri couldn’t help but cry out. He tossed his head to the side, exposing his neck, and arched when Victor leaned down to bite into his skin. It wasn’t hard enough to bond, not just yet, but just the thought of made Yuuri’s brain go haywire. \nHis orgasm was unexpected. Victor didn’t even need to touch his cock or his nipples before he was coming, his back arched so hard it felt like it would almost snap. Yuuri cried out Victor’s name, his arms tightening around Victor’s neck as he did so. It was like his mind checked out for a moment, and when he came back down Victor was thrusting his hips harder, growling and snarling and pressing bruises into Yuuri’s skin.\n“Victor,” Yuuri whispered, his voice croaky from moaning and gasping. He met Victor’s eyes and kept them, even as he felt Victor start to swell inside of him.  Is that… is that his knot? \nVictor started to whine, and Yuuri knew he was close. He pulled Victor down to his chest and kissed him until they were both panting and breathless.\n“Victor,” Yuuri whined. Victor’s rhythm stuttered, his knot catching on Yuuri’s rim. He ground it in, thrusting particularly hard, hard enough to move Yuuri up the bed. Yuuri cried out as his cock spurted weakly again. “Ah, Victor! Alpha!”\nVictor snarled and choked out a strangled, “Yuuri,” before he was coming, too. Yuuri felt it inside of him, felt the swell of Victor’s cock and the rush of his release. It made Yuuri come again, too, even though he didn’t think he could. It took several moments for Victor to gather his thoughts, and only then did he gently manoeuvre them around so that he was lying with Yuuri on his chest. They were still connected, and would be for quite some time, but Yuuri found that he didn’t mind. \nYuuri was still panting when Victor called his name.\n“Yuuri,” Victor said, his voice hoarse, “are you alright?”\nNodding, Yuuri hummed. “Really alright,” he said. “I feel good.”\nVictor laughed. It was a carefree sound. “I didn’t hurt you too much, did I? You’re covered in bite marks.”\nHearing that made Yuuri shiver. His cock twitched in interest, and he couldn’t help but shift. It didn’t help that he was laying on top of Victor, and his release was drying between them. At his movements Victor groaned, and his cock pulsed in Yuuri once more.\n“You didn’t hurt me,” Yuuri said. “Felt good.”\nVictor hummed. He ran his fingers through Yuuri’s sweaty hair and drew patterns on his back. After a moment, Yuuri realised he was tracing out the  Stay Close To Me  routine. “Was it what you imagined?”\n“Better,” he admitted.\n“So you’ve thought about it?” Victor teased.\nYuuri nodded, unashamed.\nVictor raised a brow. “Do you masturbate to thoughts of me?”\nYuuri flushed, but nodded again. Might as well get it all out. “In the shower,” he admitted.\n“Me too,” Victor grinned. “I could smell it on you – arousal.”\nYuuri flushed. “R-really? I used a lot of soap…”\n“Yes, well it clearly masked your omega scent, but not the rest,” Victor chuckled. “Every time I smelt it I got aroused straight away. It was terribly embarrassing.”\nYuuri laughed quietly. He didn’t think anything could be embarrassing with Victor still knotted inside of him. “Victor?”\n“Yes, Yuuri?”\n“You said you loved me before.”\n“Mmm.”\n“Do you?”\n“Very much.”\n“Me too.”\nVictor gave him a wide-eyed, flustered look. “Really?”\nYuuri nodded, flustered. “Yeah.”\nVictor let out a happy rumble and drew Yuuri as close as he could.\nHe couldn’t help but purr. It was a sound that rumbled out of his chest – the sound of a happy, sated omega.\nVictor sighed. “I can feel you purring,” he said, pleased. “I love hearing it.”\nYuuri only purred louder.\nIt made Victor chuckle. “You’ve got quite a thing for praise, haven’t you?” He teased, ignoring Yuuri’s flushed expression as his hand snaked down to rest on the place Yuuri’s ass met the back of his legs. “It’s good that I have an endless list of compliments ready to give you, starting with your soft, delectable thighs.”\n\n “V-Victor!” \n"
}