{
    "id": "835829",
    "url": "https://archiveofourown.org/works/835829?view_full_work=true",
    "author": [
        "renne_archive"
    ],
    "title": "this city bleeds its aching heart",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Captain America (Movies)",
        "The Avengers (2012)"
    ],
    "relationships": [
        "James \"Bucky\" Barnes/Steve Rogers"
    ],
    "characters": [
        "James \"Bucky\" Barnes",
        "Steve Rogers",
        "Phil Coulson",
        "Jasper Sitwell",
        "Nick Fury",
        "Original Characters"
    ],
    "additional_tags": [
        "Fake/Pretend Relationship",
        "Unrequited Love",
        "Resolved Sexual Tension",
        "Undercover",
        "Canon Universe"
    ],
    "language": "English",
    "series": "",
    "published": "2013-06-09",
    "completed": "2013-06-29",
    "words": "34,537",
    "chapters": "5/5",
    "comments": "1,039",
    "kudos": "26,624",
    "bookmarks": "6,441",
    "hits": "503,822",
    "summary": "<p>The one where Steve and Bucky pose as a happily married couple while on a mission for SHIELD, to catch an international arms dealer hiding in a suburban neighbourhood.</p>",
    "notes": "<p>Thank you to This Girl Is for the beta and plot hole help and to beardsley for the cheerleading without which this would never have been finished. Jasper Sitwell in this fic is strictly the version from the MCU from Avengers and prior. If you're expecting CA:TWS and later compliant canon/characterisations don't, because it was written well before that movie came out. </p>\n<p>Also <a href=\"https://archiveofourown.org/users/deducingalldaylong/pseuds/deducingalldaylong\" rel=\"nofollow\">deducingalldaylong</a> has made a mix which can be found on 8tracks <a href=\"http://8tracks.com/chvystiel/to-show-you-love\" rel=\"nofollow\">here</a>. &lt;3</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">notes</a>.)\n</p>\n<p>Thanks to everyone who read and commented and clicked kudos for taking a chance on a silly fic of two idiot boys trying to figure out how feelings work. Thanks always to brumous, without whom this fic would not even exist. &lt;3</p>\n<p>This is also a blanket thank you to everyone who still takes the time to comment on this all these years after it was published. I'm sorry I can't reply to everyone anymore, but know that I still see your wonderful comments and they make me very happy so honestly, THANK YOU.</p>",
    "text": "Bucky calls in to SHIELD headquarters. \"So it turns out I need someone to act as my significant other on this mission.\"\n\n\"I'll call in Natasha,\" Fury says.\n\nThere's a delicate pause. \"Not that kind of significant other.\"\n\nThere's another pause for it to sink in exactly what kind Bucky means. Fury sighs in irritation. \"He's not the best at espionage, you know.\"\n\n\"He'll be fine,\" Bucky says. \"I've been teaching him a few things. Besides, all he needs to do on this mission is look pretty.\"\n\n\"Well, he can do that,\" Fury says sourly.\n\n\n\nSteve's called into SHIELD headquarters and given a briefing file. \"Barnes needs support on his current mission,\" Coulson says.\n\n\"Mm-hm,\" Steve says as he reads through the file. \"Seems straightforward enough.\" While Steve's given the file and briefed on the mission, he won't find out until much later that his SHIELD briefing neglected to inform him on one very, very important fact.\n\nHe's given an address and told to expect to be there for a month at most. It'll be kind of like a holiday, they tell him. Only light work.\n\n\n\nBucky, of course, expects Steve to be fully briefed on the nature of his involvement in the mission—support and making nice with the neighbours while undercover—so he thinks nothing of bounding down the steps to meet Steve on the pavement, throwing his arms around him and giving him a big ol' kiss right on the mouth.\n\nSteve recoils for half a second and Bucky maybe panics a little that Steve actually hasn't been briefed at all, but then Steve drops his bag, wraps his arms around Bucky and kisses back with astounding enthusiasm.\n\nPerhaps Steve just wasn't expecting such an emphatically touchy-feely welcome.\n\n(What Bucky's not expecting is the hint of tongue from Steve, and okay for a \"just for pretend\" relationship that seems a little committed for a first kiss. And yeah, okay, he'd not expected the thrill of electricity, because Steve's a really good kisser; and if he presses in a little closer, it's just for the benefit of the people ogling their hot new neighbours, right?)\n\nIt's easy to look love-struck as he pulls away and picks up Steve's bag, taking his hand and leading him to the front door.\n\n\n\nSteve's head spins from the unexpected welcome as he follows Bucky into the narrow, two story, red brick town house that's meant to be their home for the next month. He'd expected Bucky to be happy to see him, since between Bucky's missions and everything that Steve's been dragged out on, they're lucky to have seen each other for two weeks worth of days in the past six months. But a greeting like that?\n\nHe touches his mouth, where he can still taste Bucky on his lips. He'd been surprised, of course, but more than happy to return the kiss. Maybe because he's only been wanting to do that since he first ever realised he might want to kiss someone.\n\nAs soon as the door shuts, Bucky says, \"Sorry if that was a little full on, but I've been telling the neighbours how much I've been missing you since I made the request to Fury, and they're under the impression we're completely mad for each other. Here, you'll need this. I now pronounce us husband and husband.\"\n\nHe flicks something to Steve that glimmers gold and white in the air. Steve catches it. It's a wedding band and he stares at it. It takes him a moment to connect Bucky's words with the ring with the kiss with the reality that this is something that could happen now. Two men, married in the state of New York, who could be open and out and in love, the way they couldn't have—had they even wanted to be—back in the 30s and 40s. Him and Bucky. Except they're not married, they're not even—\n\nIt doesn't make sense.\n\n\"You—you are okay with this, yeah?\" Bucky asks anxiously. \"I mean, the whole pretending to be married part? You're not here as Captain America, so it shouldn't impact on your whole—\" he waves his hands, \"thing, and Fury said that if you were needed you could be pulled out and—\"\n\nSteve stares at him. Pretending to be married? Oh hell, is that what this is all about? It makes sense now; the kiss that is, not why him, why they pulled out the SHIELD agent who was assigned to this mission and trained Steve up to be the support Bucky would need and—\n\n\"Steve?\"\n\n\"What? Yeah, yeah, I'm fine with it,\" Steve says, forcing a smile. He hides his discomfort as he slides the ring onto his finger, thinking that it sure would've been nice if he'd been given some kind of prior warning in any of the hours he spent in briefing. Then he thinks that the ring looks rather nice on. Shame.\n\nBucky gives him a weird look, but doesn't push it.\n\n\"So,\" Steve says. \"What now? I mean, I've been briefed on your mission, but we should probably talk about... this.\" He gestures between them, then touches the gold band on his finger. While he doesn't think he has much of a choice, he doesn't want to suffer a reenactment of the kiss on the pavement if he can help it.\n\nNot unless it's real.\n\nGod, he wants Bucky to kiss him for real.\n\n\"Um, god.\" Bucky scrubs his hand through his hair. \"I dunno, I thought maybe some hand-holding, a little PDA. This community is big on community, if you get what I mean. I get invited to a lot of things.\" And Steve, god, he can't help but smile at the uncomfortable look on Bucky's face, because ever since—well, ever since Bucky came back to him, Bucky's been no good at social things. \"It's part of the reason I asked for you.\"\n\n\"Oh?\"\n\n\"You're just so... good with people, Steve,\" he says earnestly. \"In a way I'm not.\" The smile he gives Steve is flirtatious which, no, clearly it's not and Steve is just imagining things. \"Anyway, our bedroom is upstairs and your workstation is set up in the backroom. Just check that everything is where it should be, okay?\"\n\n\"Okay,\" Steve says obediently. He picks up his bags and heads upstairs. He's surprised at how cosy the house looks. He'd expected it would look more like something out of a catalogue, but it's very homey. It's comfortable. He likes it.\n\nIt doesn't occur to him that Bucky had said 'our bedroom' until he pokes his head into the master bedroom, notes that Bucky's things are in there and wanders down the hall looking for the other one, only to discover it's set up with his workstation and there's a distinct lack of bed.\n\n\"Huh,\" he says. Then: \"Oh shit.\"\n\nOne bedroom, one bed.\n\n\n\nIt's only once Steve's left the room that Bucky exhales. He thinks of the way Steve went a little weird when Bucky gave him the ring. Maybe Steve's a lot more old-fashioned than he lets on, he thinks. Sure, they've both adapted to the 21st century well enough, but maybe this whole 'pretending to be gay married' thing is too much, but he didn't want to say no because he never said no to Bucky. (No really, he never said no to Bucky. Not anymore, here in the present, anyway. Bucky tries not to exploit it too much, but sometimes he wonders.)\n\nHe absently turns the gold band on his own finger and thinks of the way Steve had kissed back. The sudden flush of heat flusters him and he rubs at the back of his neck, because kissing Steve and Steve kissing back is not meant to push his buttons quite this hard. Because Steve is off-limits, because Steve is Steve.\n\nExcept it has pushed all kinds of buttons, and now Bucky's going to have to live with this hole he's dug himself, which will no doubt involve more kissing and touching. Jesus.\n\nIf he'd been thinking about anything other than the possibility of getting his hands all over Steve, he'd expect the knock at the door that makes him jump. He opens it to see Jim and Janine, the almost-but-not-quite-retiree couple from next door (the invite to Jim's retirement dinner is stuck on the fridge). Janine smiles, while Jim tries to surreptitiously peer past Bucky, no doubt looking for Steve.\n\n\"Hello, Jan, Jim,\" Bucky says.\n\n\"James, hello! We couldn't help but notice that your—your—I'm sorry, what is his name again?\"\n\n\"Steve,\" Bucky supplies, \"my husband.\" It's stupid how the word sends a delighted shiver up his spine when it means nothing, really.\n\n\"Yes! We noticed that your husband, Steve, has finally arrived.\"\n\nBucky coughs. \"Sorry about the, uh, welcome home show—\"\n\n\"Oh, no no, that's fine, we understand you missed him! Young love is wonderful and there's nothing wrong with showing someone how much you love them!\" Janine beams and Jim nods enthusiastically. \"What we wanted to know,\" and Janine gestures between herself and her husband, \"was if you and your Steve wanted to come over for dinner tonight, if you haven't already made plans. For dinner, that is.\"\n\n\"Yeah, we'd love to,\" Bucky says. \"Me and my Steve.\" He's made it procedure to accept every invitation, and even extend a few of his own.\n\n\"Excellent,\" Jim says. \"We'll see you at six, then.\"\n\nSix. That gives him four hours to nut out his history with Steve. Plenty enough time. And it's fun, too, making up a back story. Steve wants to go with them both being ex-vets fighting to hide their feelings for each other in the face of DADT, and the repeal wiping away the internalised shame of being in a relationship with another man while in uniform.\n\n\"Who knew you were such a romantic?\" Bucky teases.\n\n\"You want romantic? I can show you romantic.\" The glow from the workstation computer—because the blinds in the spare bedroom have been replaced with black out curtains and are always drawn—lights the smile on Steve's face.\n\nIt's not a threat Bucky takes particularly seriously. Steve is a sap, always has been. \"I don't think I'd be ashamed, though,\" Bucky points out.\n\n\"You liked being in the military. You'd never be able to stand a dishonourable discharge.\"\n\nThere's something in Steve's tone that hits Bucky entirely the wrong way and Bucky goes from playful to pissed off in a heartbeat. \"Yeah,\" he snaps, \"well, I've learned that there's worse things in this world than that.\" He throws down the pencil he'd been toying with on the desk and stands. \"Like me.\"\n\n\"Buck, wait—\"\n\nHe's downstairs and out into the tiny little backyard before he even knows where he's going, gasping for breath. He'd liked being in the military, up until he'd been captured and used as a guinea pig for god knows what. He'd liked being in the military, until the Russians had turned what was left of his brain inside out and made him into a murderer. He'd liked being in the military, because even with all the blood on his hands, he'd still been welcomed home like a long lost son.\n\n\"Bucky, hey.\" Steve's standing in the doorway, his expression soft. \"Hey, I'm sorry,\" he says, and it only takes a few steps before he's there, and Bucky lets Steve pull him close and wrap him up in his arms. (Hates himself a little for it too, because he likes it so much and because it's a cheap distraction from the hurts; so easy instead to think about how simple it would be to kiss Steve again, now, without having to put a show on for anyone.)\n\n\"I'm sorry,\" Steve repeats.\n\n\"Yeah, I am too.\"\n\n\n\nIt's better between them, when they go over to Bucky's—no, to their neighbour's place for dinner. Better, but not perfect, and Steve feels guilty because he couldn't help the dig, even though he should have been able to, even though he should have known how it would hurt Bucky.\n\nHe'd been thinking instead of himself and his own selfish feelings. The better part of a lifetime is a long time to carry a torch, notwithstanding 70 years under the ice. Bucky had liked being in the military so Steve had never said anything, even when Bucky had looked at him sometimes (like maybe...) and looked at him even more after the super serum. Then he'd fallen and Steve had thought that was that. Except he wasn't gone, he was here.\n\nAnd now he's here and Steve is meant to pretend to be his husband and utterly in love with him.\n\nHe has the second part down pat, at least.\n\nBucky's stiff and awkward at first at Janine and Jim's place, but he loosens up with Janine's easy chatter. It's such a lie, Steve thinks, that Bucky's bad with people. He has these two completely charmed, and when Bucky curls his hand over Steve's where it rests on the table and smiles winsomely at him, Steve doesn't imagine anyone else on the street could be any different.\n\n\"That didn't go badly,\" he ventures tentatively, later, as they head back into their house, Bucky heading straight for the stairs. \"You seem happier.\" Is he opening the can of worms again? Maybe.\n\n\"We'll do a trial run, tonight,\" Bucky says decisively, like Steve hadn't said anything at all. \"See how SHIELD trained you up for the job. I need to relocate the bug in Cohen's office.\" He ducks into the bedroom—their bedroom—and shucks out of his shirt and jeans, quickly stuffing himself into the uniform he pulls from the wardrobe. Steve maybe spends a little too long in the doorway staring at him getting changed before he realises he's even staring. Bucky tucks in his earpiece, then looks at Steve where he still loiters in the doorway, his expression inscrutable. \"Best get to it,\" he says.\n\nSteve slides into the chair in front of the workstation Bucky set up for him in the back bedroom, pulling on the headset. \"Can you hear me?\" he asks as Bucky slips out of the house.\n\n\"Mm,\" he hears Bucky say shortly, \"not so loud, Steve.\"\n\n\"Sorry.\" When he speaks quieter, it seems more intimate, Bucky's voice a lower murmur in response. Even in the quiet moments, when Bucky goes silent, he doesn't feel alone. He imagines Bucky in his dappled grey stealth gear slipping unseen through this suburban neighbourhood, a deadly shadow in the night and such a contrast to the helpful, cheery ex-vet with a surprising knack for DIY their neighbours know.\n\nSteve's not sure which version he prefers better. His deadly friend, or his pretend husband. (He knows he should prefer his friend, but there's just something about husband that hits him right in the gut.)\n\n\"Seems like an odd neighbourhood for your local friendly arms dealer,\" Steve says. \"Very... suburban.\"\n\nBucky chuckles. \"You'd be surprised what people like these can get up to. Cohen's been maintaining this cover for years now without activity—no one would expect anything suspicious.\"\n\n\"You, on the other hand...\" Steve hesitates. \"New to the neighbourhood—\"\n\n\"That's why I called you in. No one turns on the charm like you. And who's gonna suspect a couple of happily married queers of getting up to funny business even if they're just new to the neighbourhood?\"\n\nThe word sits uneasily in Steve's chest. \"You sure you're supposed to use that word?\"\n\nBucky laughs softly. \"If I can't, then who can?\" Steve's about to ask Bucky to explain when Bucky says, \"I'm going in.\"\n\nThere's a long silence on the other end and even though Steve knows Bucky's done this before, he still feels his heart claw up into his throat at the thought of Bucky in this guy's house. Cohen might look benign, but who knows what he might get up to if he found an agent of SHIELD in his house.\n\n\"Everything okay?\" he says, trying not to sound nervous, his eyes glued to the screen in front of him, with the little glowing dot that represents Bucky inside Cohen's house. There's a double pip in response. Yes.\n\nA ping on Cohen's phone line has Steve reaching over and turning up the volume on the audio tap Bucky had previously placed. He can hear the chime of the phone, the click of the answering machine and then a mechanical voice reels off an alphanumeric list. It recites twenty odd digits before hanging up. \"Sending through to SHIELD,\" Steve murmurs. \"Any sign of Cohen?\"\n\nA single pip. No.\n\nAfter another breathless moment, Steve hears Bucky say, \"All done. Sleeping Beauty didn't even roll over at the call.\" Bucky yawns suddenly.\n\n\"Maybe you should come in now?\" While Steve has the final say on whether or not to bring Bucky in, he'd like to give Bucky the illusion of autonomy. It was one of the few conditions Steve stipulated for this mission, because he knows what Bucky can be like, and with just an ordinary SHIELD handler running at his heels for the past three weeks, Steve has no doubt from the dark circles under Bucky's eyes that he's been pushing himself harder than he should have.\n\n\"Mm, it's done anyway, no point staying up. Go to bed, Steve. I'll be in soon.\"\n\nBed. The one, lonely bed in the house that they're going to share. It's a big bed, but then again, Steve isn't exactly small himself.\n\nIt's 2am when Bucky comes into the bedroom, crawling under the sheets with another sleepy yawn. Steve rouses when the mattress shifts and can't help his murmur of surprise when Bucky cuddles up. He shifts his arm so Bucky can curl against him, head pillowed on his chest. And if he presses a kiss to the crown of Bucky's head, well... he's sleepy is all he'll say if Bucky calls him on it.\n\nBucky doesn't call him on it, he just makes a soft, content noise in the back of his throat and pushes in closer.\n\n\n\nThey settle into a routine: rising at 6am for a morning jog, the pretense throughout the day of a work-from-home couple hopelessly besotted with each other interspersed with Bucky on reconnaissance and tailing missions or napping and reviewing data with Steve from the bugs planted in Cohen's house. Evenings regularly involve dinner with neighbours, and then some nights between midnight and 5am Bucky might be out doing more reconnaissance on any new leads to do with those on the other end of Cohen's deals, who keep far less convenient 9-5 hours than a suburban psychiatrist.\n\nBucky's upstairs napping when there's a knock at the door, and Steve leaps out of the armchair he'd been trying not to snooze in himself and hurries to the door. It's Samara, one of the young professional couple who live two doors down, and opposite. \"Steve, hello!\" she gushes as she brushes past him and into the house. It had taken him a little while to realise that when she stood a little too close and flirted outrageously, it wasn't because she was trying to start something with him, it was just the person she was.\n\nShe looks around brightly. \"Is James not in?\"\n\n\"He's upstairs... having a nap.\"\n\nHer eyes widen like saucers as she takes in his rumpled clothes and she lets out a chirrup of a laugh. \"I'll be quick then,\" she says and the look she gives him is frankly naughty. \"Let you get back to your... napping.\"\n\n\"I... okay?\" Then he realises what she's implying and can't help the hot blush that scalds his cheeks. \"No, he is actually asleep,\" he protests. \"I swear.\"\n\nSamara laughs again and pats his hand. \"Sure he is. Anyway, Jason and I are hosting a picnic at the park tonight and everyone in the street is invited. Even Albert's coming and he rarely does! We'd love to see the two of you there. When you've finished napping, of course.\" She winks.\n\n\"Um,\" Steve says helplessly. \"Sure. We—we'd love to.\" He was under strict instructions from Bucky to accept all invitations, and if Albert Cohen said he'd be there wild horses couldn't keep them away. \"Did you want us to bring anything?\"\n\n\"Ooh,\" she flutters, \"if it's not too late notice, we do love James' potato salad. If he could bring some that would be fantastic, but if not we'll have plenty of food to go around anyway.\"\n\n\"Sure,\" Steve repeats. \"I'll see if it's not too late notice.\" Potato salad? Bucky makes potato salad?\n\nSamara pats his hand again. \"Excellent! We'll see you around 7pm then,\" she says and breezes out.\n\n\n\nSteve's at the table sitting in front of the fan when Bucky comes downstairs rubbing at his eyes sleepily. He's poring over the codes left on Cohen's answering machine. \"No noise from SHIELD?\" Bucky asks. He doesn't even think twice before trailing his fingers across Steve's shoulders, from left to right as he pads past to the kitchen and puts on the kettle.\n\nSteve drops his pencil and scrubs his hand over his face. \"I thought fresh eyes might've helped with looking for a pattern, but I can't see anything.\" He props his chin on his hand, and Bucky can sense him watching.\n\n\"You want...?\" Bucky gestures with a glass and a raised brow. Steve nods and smiles. Instant coffee makes a terrible cup of joe, but with some ice in it it's not so bad, and they've both drunk far worse in their time. To be honest, Bucky's never had much of a taste for fancy coffee, so he never thought to requisition a coffee maker for the house.\n\n\"I'm going to call and see if I can't get someone to come and fix the air-conditioning,\" Steve says as Bucky sits the cup in front of him, the ice cubes clinking against the glass.\n\nBucky slides into the seat next to him, grimacing as he takes a deep drink. He sits his glass down away from the papers and picks up one covered in Steve's scribble. \"Anything new?\"\n\nSteve shakes his head. \"Makes as little sense to me as it does to the SHIELD cryptographers. Oh,\" he says, \"Samara came by before, invited us to a picnic tonight.\" He has an odd flush across his cheeks that Bucky's pretty sure isn't because of the heat. \"Cohen's going to this one.\"\n\n\"Excellent, he never seems to go to any of the street gatherings. I take it you said yes?\"\n\n\"I said yes.\"\n\n\"What else did she say?\"\n\nSteve ducks his head. \"Nothing.\"\n\n\"This isn't nothing.\" Bucky reaches out, dragging his fingertip across the blush that paints Steve's cheekbone. He leans in close. \"She try and hit on you? Do I have to play the jealous husband tonight?\" If his voice pitches weird and low at the thought, he hopes Steve doesn't notice. He can imagine playing the jealous husband, all handsy and possessive in front of their neighbours, staking his claim with his hands and mouth—\n\n\"No!\" Steve says suddenly. \"No,\" he repeats, in a calmer tone. He hesitates, wets his lips. \"She thought—she thought she'd interrupted us.\" If anything his cheeks go redder. \"Upstairs. Together.\"\n\n\"Ohh,\" Bucky breathes. It doesn't take much effort to imagine them 'upstairs, together'. Steve gives him a sharp look and he reaches for his glass, taking a deep drink to cover the fact that what she suspected is exactly what he wants to do. He laughs lightly. \"That's what we want her to think, right?\"\n\nSteve breezes right past that and says, \"She also said something about potato salad.\"\n\nBucky snorts.\n\n\"I didn't know you could cook anything, much less potato salad.\" Steve gives him a suspicious look. \"You don't just buy it from the deli do you?\"\n\n\"I'll have you know I make that shit from scratch,\" Bucky says defensively. He's offended by Steve's implication that he can't cook. \"Besides, you know I can cook. Unless you've gone all senile on me and can't remember what happened before the war anymore. I hear that happens to you old folk at this age,\" he says with all the authority of four official years difference in their age, leaning across the table and patting Steve insultingly on the cheek.\n\n\n\nAlbert Cohen is a portly man with greying hair and a sun-aged face that's a roadmap of wrinkles. He doesn't look like any kind of arms dealer with extensive terrorist links that Bucky's ever seen before.\n\nAside from the bugs and the tailing to his office and his secret meetings and spying through a high-powered scope, this is only the third time Bucky's seen him out in public for anything unrelated to his work—both legal and illegal—and the first time at one of the community events (the social event that is buying groceries in this neighbourhood doesn't count). He seems quite at ease with his neighbours and the comfortable way everyone greets him indicates to Bucky, at least, that this isn't a man who is a recluse.\n\nIt's easy enough to work his way through the gathering to say hello to Cohen, since Steve is flavour of the week now and all their neighbours flock to his side. (Perhaps it was a little mean of Bucky not to give Steve a heads up on what to expect from this kind of gathering. Perhaps not.)\n\nThey exchange small talk for a while—Cohen lies and says he's been out of town a lot lately, which is why he's been missing from the community gatherings, Bucky smiles and says it's a pleasure to finally meet him, he's heard so much—when Cohen glances over to Steve, chatting easily with Adrian and Reena Michaels, the second newest couple on the street, with their daughter Lily.\n\n\"You two make such a happy couple in public,\" Cohen says.\n\nBucky throws Steve his best puppy-in-love look. Steve's gently tossing Lily, three years old and already a little heartbreaker, into the air now. Her screeches of delight echo across the park. \"He's made me the happiest man in the world,\" he says, with a besotted smile. Steve's grinning broadly and looks happier than Bucky's seen him since—well, since long enough ago that Bucky doesn't like to remember.\n\n\"Mm,\" Cohen says, but he doesn't seem impressed. \"I can see that. In public,\" he repeats. Bucky gives him a sharp look. \"Now I know it's not my place to comment, but you don't seem to have the... glow I would normally associate with such a happy couple.\"\n\n\"Glow?\"\n\n\"Again, I know it's not my place to comment, I wouldn't want to embarrass you, but I associate the glow with a couple who have a regular sex life—\" Bucky nearly chokes, \"—and I get the feeling you are two healthy young men who are not having as much sex as you're used to. Perhaps it has to do with the move and the time you've spent apart, it's completely understandable. If it's not too forward I would suggest taking some time to get to know each other again in your new home.\"\n\nBucky blinks. \"Um, gee, Albert.\" What the hell do you say to that, Bucky thinks, casting about for something appropriate to say. \"Thanks for the advice? I mean—I don't mean that in a sarcastic way, I mean—you might be right, maybe we could spend more time, uh—\"\n\nAlbert laughs and pats Bucky on the arm. \"I'm sorry, my dear boy, I've made things awkward. Sometimes I can't help it when the inner professional comes out. Think about what I've said. Maybe all you need is less time out gadding about at night and more quality time in.\"\n\nIt's all Bucky can do not to blank out right there. An off-the-cuff comment doesn't mean he's been made. He laughs instead and shrugs. \"It's not easy, where we come from, to reconnect sometimes,\" he says instead, because that's no lie.\n\n\"Ah yes, the military. Well, it's clear to anyone looking at you that you're deeply in love, which is exactly what I like to see in a young couple. Just ensure that you don't neglect any aspects of your life together and I am sure you'll have a strong marriage for decades to come.\" Cohen beams at him.\n\n\"Thanks, Albert. I'll, uh, I'll think on what you said—\"\n\nCohen winks. \"Don't be afraid to talk over these things with Steve,\" he says and gives Bucky a nudge with his elbow.\n\n\"What and ruin the surprise?\" Now why did he say that?\n\n\"Oh ho ho, you mean a seduction!\" Cohen crows and that's... that really not what Bucky meant, and he's a little disturbed that's the first place Cohen's thoughts go. If this isn't the weirdest conversation Bucky's ever had he doesn't know what is. \"All the best, James,\" Cohen says, excusing himself. \"I must go ask Alia about her delicious quinoa salad.\"\n\nHe must look out of sorts when he heads back over to Steve, who gives Lily back to her parents when he sees the look on Bucky's face. \"Is everything okay?\" he asks seriously, guiding Bucky away with a hand on his elbow.\n\n\"I forgot our resident arms dealer was also a certified psychotherapist specialising in couples counselling,\" Bucky says sourly, unable to help wondering what Cohen would make of this courteous, considerate behaviour.\n\nSteve perks up. \"Couples counselling? Is that something we could use to get closer to him?\"\n\n\"Probably not. I think we're projecting the whole happy couple vibe a little too well. His only advice was to make sure we have a... a healthy sex life. He doesn't think we're as 'active in the bedroom' as we should be.\"\n\nSteve swallows a little convulsively. \"What does that mean?\"\n\n\"That for an arms dealer he's very perceptive?\"\n\n\"Bucky—\"\n\n\"Well, he has a point.\"\n\n\"Bucky!\"\n\n\"What?\" Steve's cheeks are flaming and Bucky thinks perhaps it's mean to tease him like that, when all Bucky really wants is a healthy sex life with him. \"Sorry,\" he says, but Steve's quickly over his embarrassment. He is Captain America after all, it's probably a talent.\n\n\"From the angle of the houses, he could see right into our bedroom,\" Steve points out. \"Maybe he... maybe he watches? These nights it's been hot we've had the window open, and those curtains don't really do a whole lot to block out Peeping Toms.\"\n\n\"I knew I should have gotten better curtains,\" Bucky mutters.\n\n\"Sorry?\"\n\n\"Nothing. Okay. Maybe he can see into our house, and is judging us on the one thing that might trip up this whole happy couple cover we've got going on. He made a comment about me being out and about which leads me to think he might've seen something. We've gotta put him off his guard, make him think we've taken his advice to heart.\"\n\n\"So... you're saying that we should pretend to have sex in case he's spying on us?\"\n\n\"It's not the most ridiculous thing I've ever suggested,\" Bucky protests.\n\n\"It's terrible how true I know that is.\" Steve laughs and that's not the response Bucky would ever have expected. When he says, \"Okay, we can try that,\" it's even less the response Bucky expects and he has to tell himself that when it comes actual time to go through with this, Steve will back down. Totally.\n\n\n\n\"So,\" Bucky says, leaning against the doorframe. Steve's already in bed, sitting up with his pillow propped up behind his back studying the tablet linked in with the workstation.\n\n\"I don't think there's any need to go out tonight.\"\n\n\"Of course not,\" Bucky says.\n\n\"A full night's sleep should be nice.\"\n\nHere we go, Bucky thinks. \"So, about that...\"\n\n\"Tonight?\"\n\n\"Yeah. I think if he's watching any night it'll be tonight.\" Bucky absolutely does not let a hint of eagerness creep into his tone at the thought of laying hands on Steve, even if it's just in fakery. \"He'll want to see if I take advantage of y—of his suggestion.\"\n\nSteve raises a brow and sets the tablet aside on the bedside table. \"Okay,\" he says, looking up at Bucky expectantly. \"How do we go about this?\"\n\n\"Um. I didn't think that far ahead?\" Any thinking Bucky had been doing had been solely concentrating on the actual real sex he wanted to have with Steve and not the fake stuff.\n\n\"Well, I've had sex before,\" Steve says with a hint of a grin, \"and I'm reasonably sure you've had sex before, so it shouldn't be too hard, right?\"\n\nBucky's never been nervous about sliding into bed with Steve, and he doesn't want to think anything about performance anxiety, but well... performance anxiety. He's pretty sure he has it. He shrugs out of his clothes down to his boxer shorts and crawls under the sheet.\n\nIt turns out he shouldn't have been worried about the show, he should have been more worried about his own physical reaction. After all, with Steve rubbing up against him, cheek to cheek to simulate some enthusiastic making out while pressing him into the mattress, thigh wedged between his, his dick does the one thing it's a star player at whenever it comes to Steve Rogers.\n\nBucky lets out an explosive noise of frustrated embarrassment. \"This is ridiculous,\" he says, not sure if he should be apologising for the erection Steve couldn't possibly avoid feeling poking him in the hip.\n\n\"What, that we're awkwardly rolling around simulating sex for some creepy Peeping Tom who may or may not be actually watching us fake it, or...?\"\n\n\"Well... that's not what I was talking about but yeah, there's that.\"\n\n\"What were you talking about then?\"\n\nSteve shifts a little and everything Bucky was going to say like, \"We should really stop doing this before I humiliate myself further,\" is completely blown out of the water because holy shit how was Steve hiding the fact that he's hard too?\n\nChanging tack, Bucky hesitates, unable to look Steve in the eye. Fuck it, he thinks, and takes the plunge. He stares up at the ceiling. \"I was... I was talking about the fact that with all this rolling around it’s pretty obvious to me that you—that you're—well, y'know, and I know it's gotta be obvious to you that I am too, so... why are we faking it? I mean, it doesn't have to mean anything, it's just gonna be, y'know, getting each other off. And if friends can't get each other off then who can, right?\"\n\nThere's a long pause and Steve goes utterly still over him. Cursing himself for playing the idiot, Bucky opens his mouth to take it back, to ask Steve to forget he even said anything, when Steve says, \"Okay. Sure.\"\n\n\"Sure,\" Bucky echoes, hoping it doesn't come out as strangled as it feels by his heart flip-flopping around in his chest like a landed fish. He's pretty sure his expression gives him away though. \"We don't have to do anything that's not you—\" god, Buck, what does that even mean, he curses himself, \"—we don't have to, uh, fuck, or anything, we can just...\"\n\nWords are too difficult, so Bucky turns to actions and flips them so he's the one on top; suddenly, electrifyingly aware of Steve's skin, his touch, when he settles his hands on either side of Bucky's ribcage. He presses down against Steve, against the full length of his body, and can't help his shaky sigh of pleasure as he feels his dick press up against the hard length of Steve's. He feels Steve's fingers tighten, and the soft, shaky \"Ah...\" he lets out goes straight to Bucky's dick. He rocks his hips tentatively and Steve's grip tightens more.\n\nHe finally looks Steve in the eye. \"Just because we're doing this, Steve, doesn't mean you're... y'know.\"\n\n\"I know.\" Steve smiles encouragingly up at him, breathless and bright-eyed. Then he says, \"Maybe we should be naked.\"\n\nLater Bucky won't actually remember taking his shorts off, but he will remember the way Steve pushes him into the mattress, and hot, sweat-slick skin against hot, sweat-slick skin. He slides his hands down to grip Steve's ass, groaning at the bunch and relax of muscles under his hands, trying not to imagine what Steve would feel like inside him, what Steve's ass under his hands would feel like when he was fucking him. Except it's all he can think about, besides white-hot need.\n\n\"Oh fuck, Steve, want you in me, I want—god, wanna feel you inside me, want you to fuck me, want you to fuck me 'til I come, then fuck me 'til you come too...\" He's babbling, Jesus Christ, he's babbling and he can't seem to turn his mouth off, as an embarrassingly explicit litany of what he really, really wants Steve to do to him falls from his lips.\n\nHe's shut up a moment later when Steve kisses him, really kisses him, like the x-rated version of the way he'd kissed Bucky out on the pavement two weeks ago. There's something desperate in the way Steve rocks against him and Bucky responds, arching up and pushing back, digging his fingers into Steve's shoulders like he's holding on for dear life. Maybe he is, as his orgasm hits him, hard, crashing through like a wave. He shakes under Steve, gasping and whimpering, a bundle of raw nerve endings as Steve continues to move against him.\n\nSteve braces himself on his elbows and the intensity of the look on his face is just—Bucky desperately wishes Steve was inside him, was fucking into him with that look on his face, and he clamps his thighs around Steve's hips tightly, holds Steve close as he starts to shudder and Bucky says, \"come on, Steve, you can do it,\" and \"come on, Steve, want you to come all over me,\" because the thought of being all marked up makes him so hot he almost can't breathe.\n\nIt must do something for Steve too, because he stiffens, says, \"Oh god, Buck—\" in a shocked, reverent tone, eyes wide and glazed, and hell, if that's not the most beautiful sight Bucky's ever seen, Steve coming over him, hips jerking spasmodically. Then he groans, deep and satisfied, pressing his face against Bucky's neck.\n\nBucky's happy to have Steve lying there over him for as long as he can, but eventually the ache in his hips and the inability to breathe properly makes him shove gently at Steve's shoulder, hands still lingering. \"C'mon Stevie, off you get.\"\n\nIt's only once Steve peels himself off Bucky, that Bucky really realises how sex-and-sweat sticky they are. \"Urghh,\" he says, and, \"I call first dibs on the shower.\"\n\n\"Only if you get there first.\"\n\nBucky sometimes forgets Steve's competitive spirit, and he ends up with his feet swept out from under him as he falls back onto the bed with a startled yelp. He's not letting Steve get away with it and manages to maneuver himself into the shower anyway.\n\nThe look on Steve's face when he turns and sees Bucky, barely inches away is worth the price of admission. \"I'm not leaving,\" Bucky says, raising his chin belligerently.\n\n\"Well I'm not leaving, either,\" Steve says.\n\nThey're a match in stubbornness, Bucky thinks. He's okay with this. Both of them still all naked and it's not awkward. Yet.\n\nIt's not the first time they've showered together, but it's the first time they've been jammed together in a cubicle slightly too small for two grown men who've just had their first time at any kind of sex with each other. It's not as difficult as Bucky would have imagined, as they carefully maneuver around each other—not to avoid touching, because there's plenty of that, even if it's not deliberate, but to avoid elbows digging into ribcages and shower screens and walls.\n\nEven once they've finished, towelled off, and climbed back into bed—clean shorts for Steve, and Bucky naked but for the defiant look he throws Steve, challenging him to make something of it—it's not awkward like Bucky would have thought it should be, and Steve automatically moves to the middle of the bed so Bucky will curl up against him and use him as a pillow as has become habit.\n\n\"Damn you have a dirty mouth on you, Buck,\" Steve says sleepily, curling his fingers through Bucky's damp hair.\n\n\"Sorry,\" Bucky mumbles, \"I get a bit like that sometimes when I'm getting off. If it helps, it means I'm really enjoying myself?\"\n\nHe feels Steve's hand tighten in his hair a moment and then Steve laughs. \"Yeah, I'd guessed you might've been.\"\n\n\"Think he was fooled?\" Bucky asks, and he feels a little squirrelly at the thought of Cohen watching.\n\nSteve yawns and mumbles, \"Could've fooled me.\" Bucky has no idea what that means.\nTry as he might, Steve can't help the utterly dopey look on his face the next day when he heads out to do the weekly shop. He manages to keep from looking utterly smitten around Bucky, because that would give the game away completely, and is relieved when Bucky doesn't act awkward at all.\n\n(Relieved and also a little disappointed, because there's no sign from Bucky that it meant anything at all, which would be just Steve's terrible luck.)\n\nSteve had to jerk off twice in the shower just so he could even vaguely think about what happened without getting hard, damn his super soldier metabolism. It's difficult to think about anyway, even without the inconvenience of getting an awkward erection like a thirteen year old, because he's Steve and of course he ends up over-thinking it. Bucky had been the one to initiate whatever it was that had actually happened and Steve couldn't forget the explicit obscenities falling from his mouth as they'd moved together. He'd... he'd wanted Steve to fuck him.\n\nHe'd wanted it, and surely it wasn't just something someone would say when they were getting off? You didn't just say you wanted someone to put their dick in you if you didn't want it, after all.\n\n...Did you?\n\n\"Morning, Steve,\" he hears Daryl-from-across-the-street-and-three-doors-down bellow across the vegetable stand, and realises he's been standing there fondling the cucumbers.\n\n\"Good morning, Daryl,\" Steve says politely, trying not to snatch his hand back and look guilty of molesting the vegetables. \"Lovely morning, isn't it?\" The air is crisp because it's still early, but the heat in the sun promises it'll be another scorcher.\n\n\"Great morning to be alive,\" Daryl booms and grins (and Steve agrees wholeheartedly). \"You need some help with the fruit and veg this morning?\"\n\n\"Oh no,\" Steve says, shaking his head. \"Not today.\" He remembers when he'd first come to the street, and actually buying his own fruit and vegetables for the first time since before the war had been an ordeal. He was spoiled living in Avengers Tower, where everything was done for him.\n\nHe hadn't been much for cooking there any more than he was with the poor ingredients they'd been able to afford back before the war, but he's since discovered on this mission and having to fend for himself that he quite enjoys cooking for himself and Bucky. He'd hit up the internet for a bunch of recipes to start with, but the best part about being regularly hauled off to dine with the neighbours is that no family recipe is safe from the lovely Steven Buchanan from 616. There's something about him that makes people just want to give him anything he asks for. \n\nHe exploits it shamelessly.\n\n\"You give 'em one look with those irresistible blue eyes and they just fold,\" Bucky grumbles good naturedly each time Steve secures a new heirloom recipe.\n\n\"Please,\" Steve always wants to say, \"tell me more about my irresistible blue eyes.\" He doesn't though, because it treads too close to that thing he tries to ignore about himself and the way he feels about Bucky; that thing he can't ignore anymore because of what this mission has turned into.\n\nSteve picks over the apricots and wonders when Bucky might want another go at pretending to have fake sex. Should he say something? Or wait until Bucky says something? He'd want to do it again, right? Just in case Cohen's spying on them? \n\nSteve thinks he probably should be more self conscious about that fact than he is, but it turns out he kind of likes the thought of someone watching. It gives him a zingy feeling in his gut, which almost outweighs the embarrassment, but he's mostly sure if he knew Cohen was definitely watching he wouldn't like it so much. Then he realises he's zoned out by the stone fruit, cupping a pair of furry, juicy apricots in one hand.\n\nSteve knows it had been a while since he'd had sex with anyone other than his right hand, but fondling genitalia-shaped fruit and veg when he'd gotten laid the night before is plain ridiculous. Still, he can't help but wonder if Bucky would suggest it again, and if so, when.\n\nIt's not, unfortunately, that night, because a transmission comes through that Cohen's set up a meet with one of the persons of interest in another SHIELD operation, this one to do with the smuggling of ivory.\n\n\"Looks like Cohen is branching out even further,\" Bucky said disapprovingly. Steve remembers from the briefing that Cohen had made connections with the Jersey mob as well as the representative of a particularly heinous Colombian drug lord. He's remarkably well connected for his suburban cover.\n\nBucky tails Cohen to a disappointing meet at 1am where neither of the teams assigned to the cases get any information of value. It's nearly 4am when Bucky comes in, and Steve knows there'd be no excuse this time, not with both Bucky and Cohen retired to their respective beds. Steve joins Bucky in bed after an embarrassingly quick orgasm so he'll be able to bear Bucky cuddling up to him in the bed they'd had sex in only the night before.\n\nAnd cuddle up Bucky does, sleepily content. And naked. Again. Fuck, what if Bucky normally sleeps in the all together, and this is how it's going to be for him from now on?\n\nSteve lies awake, feeling a little like he's waiting for the other shoe to drop. Surely it couldn't have been that easy. Surely he couldn't be the only one feeling like a randy teenager.\n\nGah.\n\nHe has to force the thoughts away from that line—not just so he can sleep, but to remind himself that they're in the middle of an operation. This is about a man selling very large volumes of very illegal weapons to very bad people, not about Steve being very much in love with his best friend and any ensuing sexual escapades they might have.\n\n\n\nTwo hours sleep doesn't seem like much but when you're a super soldier or an ex-brainwashed assassin, getting up at 6am for your morning run through the friendly suburban neighbourhood you find yourself temporarily living in isn't that much of a hardship. No one is shooting at them, for starters, and nor is it likely that it'll be something they'll have to face later in the day.\n\nIt's nice. Steve could get used to it.\n\nAfter their run, Bucky heads to the main Manhattan SHIELD office for a debrief of the previous night's operation and for his monthly psych evaluation. Steve's a little nervous, because what if Bucky tells SHIELD they slept together? Would he even do that? Steve doesn't think he would, but what if. Steve's not exactly ready to deal with SHIELD's scrutiny over that—and he has no doubt they'd scrutinise the hell out of that kind of behaviour. Because if Captain America is in some kind of big ol' gay thing with the Winter Soldier, he's sure they'd peg it as something sinister to do with sleeper programming in Bucky's head, and nothing to do with the real reason.\n\nExcept he knows he's overreacting, because Bucky is Bucky and he'd move heaven and earth to keep Steve safe. So instead of dwelling, Steve buries himself in reviewing the data they've retrieved from Cohen's house, one eye on the data streaming from the bug in Cohen's home office, to ensure he remains where he should be, doing what he said he'd be doing. They know Cohen's an arms dealer, but they just can't seem to pinpoint any information about this rumoured meet with Damion Parenelli, a notorious merchant with suspected links to almost every major terrorist organisation worldwide and not a shred of proof of any of it. (Steve wonders for a moment if he's jinxed since all the information gathered had been before he came onto the case.)\n\nReviewing data keeps him occupied until he hears the key scrape in the lock and the front door open. Bucky looks tired and hot and sweaty and out of sorts. He heads through to the kitchen, throwing his keys on the bench, and pulling open the fridge. Steve props his chin on his hand and watches Bucky bask in the cold coming from the fridge. \"You'll let all the cold out,\" Steve reminds him after a minute.\n\nBucky grunts. \"It's a fridge,\" he says. \"It'll make more.\"\n\n\"How did it go?\" Steve asks. He's got a jug of iced water on the table beside him, resting on a tea towel to catch the condensation, and he slides his full glass across the table to Bucky. While it's warm in the house, it's not unbearable, because Steve's left the curtains and doors closed all day to keep the heat out.\n\nBucky slumps down in the chair opposite. There's a long moment where he just looks at Steve in such a way that makes Steve wonder self-consciously if he's spilt something down his front, because Bucky sure as hell wouldn't be ogling him, right? \n\n\"Sitwell thinks we're missing something important,\" Bucky eventually says. He drains the glass and reaches over for the jug, pouring himself a second one. \"I agree. Cohen's too careful. We have to be missing something.\"\n\n\"I meant...\"\n\n\"Oh, the psych eval?\" Bucky snorts and presses the damp glass to one cheek and then the other, and Steve has to swallow as his eyes track a droplet of water that slowly rolls down Bucky's cheek. He'd really like to lick that off.\n\nSteve finds hot, hot weather like this filthy sexy. The hotter the better, dripping sweat in a darkened, close room, skin slipping against skin, slow and languid; mouths and tongues and the taste of salt and sex. No rush to get off, but a slow, slick roll of bodies and hands sliding—\n\n\"Steve?\"\n\n\"Sorry!\" Steve says hastily, rubbing his hand over his face. \"Zoned out a little.\"\n\n\"Um,\" Bucky says with a peculiar expression on his face.\n\n\"What did—what did you say happened with the psych eval?\" Steve fights the urge to fidget, cursing his foray into sexy daydreams for the too predictable results.\n\n\"They're mostly happy with my brains, so they don't think I'm gonna snap and kill everyone, but apparently—\" and Bucky barks a laugh, \"I need to work closer with my handler, more like the way I work with you.\"\n\nSteve thinks about Bucky working with his handlers the way he's worked with Steve. He doesn't like it. He knows it's not what Bucky meant, but he still doesn't like it. \"And what did you say to that?\" he asks and his tone is almost neutral. He's proud of his restraint.\n\n\"I told 'em if you were my handler all the time then I'd be happy to, otherwise I'll keep working with 'em the way I always have.\"\n\nWhat on earth does that mean? Steve wonders. Just that he'd be happy to keep going on these kinds of missions with Steve, or is it something more?\n\n\"Anyway,\" Bucky says, \"enough about that. Anything from our friend?\"\n\nSteve shakes his head. \"Just a few in house appointments, nothing unusual.\" For a while they'd thought the appointments that Cohen took in his own home and not at his office could be related to nefarious activities, but so far none of the visitors—all thoroughly investigated by SHIELD—have turned up anything any more suspicious than unpaid parking tickets and the kind of privacy that wealthy people prefer visiting someone at their house for therapy, rather than an office with a big sign in the window.\n\n\"So he's home then?\"\n\nSteve nods. \"Last appointment left about half an hour go. He called into the office to say he wasn't going to be in, that he was saying at home to finish some files.\"\n\n\"We gotta get eyes on those files, just in case.\"\n\nSteve nods. \"Nothing we can do about it right now, though.\"\n\nStretching, Bucky pushes to his feet. The movement causes his shirt to ride up a little and Steve tries not to openly ogle the strip of bared skin (which is ridiculous, since Bucky has such a penchant for not wearing a shirt that Steve hardly has to hoard these little glimpses). \"Gonna go have a shower and a nap,\" Bucky says.\n\nNow Steve would sign a statutory declaration to say that he didn't deliberately plan to be in the bedroom when Bucky came out of the bathroom, naked but for the skimpy little towel clutched around his waist. But he was there, rummaging in the bedside table on his side of the bed for his phone charger when Bucky comes in, and he tries not to stare too hard at Bucky barely managing to maintain his modesty.\n\nIt's distinctly unfair.\n\nSteve's about to beat a retreat downstairs when Bucky says suddenly, \"Cohen's curtains are open. His office is upstairs.\"\n\n\"So?\" Steve says. He only says it because he knows he should, not because he's completely oblivious to where he thinks Bucky might be going with this. His dick knows. Steve glances over to where Bucky stands by their bedroom window.\n\nBucky drops the towel and Steve swallows hard.\n\nThe other night they'd talked about it, and eventually having sex had seemed a natural lead in from the silly fakery they'd been indulging in. There's no fakery in this.\n\nHe keeps his gaze resolutely on Bucky's face. \"How do you feel about having more fake sex?\" Bucky asks playfully, one brow raised, a sly twist to his mouth like he expects Steve to say no.\n\n\"I feel... okay with that,\" Steve says, hoping he sounds more casual and less breathless than he thinks he does.\n\nBucky's grin is sudden and bright. \"That's what I wanted to hear. C'mere.\" He holds out his hand.\n\nSteve goes.\n\nSteve doesn't want to be accused of mauling Bucky straight out if, when Bucky says 'fake sex', he means actual fake sex and not pretend fake sex. So he moves slow, as slow as the heat in the air warrants, letting Bucky peel his singlet off over his head before leaning in. There's an uncertain moment when Steve noses at Bucky's neck, at damp skin, before Bucky turns and chases Steve's mouth with his. Steve can't help the relieved groan he lets out, because he's not sure he could tolerate actual fake sex now he knows what Bucky's body feels like pressed against his.\n\nHe slides his hands down Bucky's sides to his hips, pulling him close and they kiss for a long, long moment.\n\nThen Bucky shoves him, and he falls back on the bed. He expects Bucky to climb over him, a snake-hipped prowl that'll really wind Steve up, but instead Bucky sinks to his knees. Steve pushes himself up on his hands and stares. There's nothing subtle about the way Bucky's looking at him, lips wet, eyes intense. His fingers hook over the waistband of Steve's shorts and Steve obediently lifts his hips.Bucky pulls them down and off his legs, throwing them aside. Steve's pretty much hard by now, just at the sight of Bucky on his knees in front of him.\n\nHe sees the flick of Bucky' tongue wetting his lips, and then Bucky's—\n\nAnd then he's—\n\n\"Close your eyes,\" Bucky says after a moment, leaning back on his heels, still working Steve's saliva-slick dick with his hand, \"and I can be anyone you want.\"\n\nSteve wants to grab him, wants to demand to know why Bucky thinks he'd ever think of anyone else, except Bucky leans forward again and Steve has to grip the edge of the mattress hard so he doesn't grab Bucky instead and fuck into his mouth. Steve breathes out shakily when Bucky runs his tongue up the length of his shaft, when he laps against the head, glossy with spit and pre-come. Steve can't look away.\n\nHe'd never fantasised about Bucky sucking him off before. \n\nNow he thinks maybe he'll never be able to think of anything else.\n\nSteve unclenches a hand from the edge of the mattress and reaches out, curling his fingers through Bucky's damp hair, then sliding his hand down to cup his cheek. He can—god, Bucky turns his head a little and Steve can feel the shape of his dick through Bucky's cheek. It's obscene. It's perfect. He slides his fingertips around, pressing against the stretch of Bucky's lips around his shaft, slipping a finger into Bucky's mouth alongside his dick. The helpless little moan Bucky lets out, his eyes fluttering shut, makes Steve's dick twitch in Bucky's mouth.\n\nThen Steve has an idea. \"Wait, wait, wait,\" he gasps. Bucky swallows and Steve's hips jerk. \"Stop.\" It's half an order, half a plea and Bucky slowly slides off him, his mouth separating from Steve's dick with a wet pop.\n\n\"What?\" Bucky says and he looks like—like he thinks Steve is going to tell him to—\n\n\"Want to fuck you,\" Steve blurts, because he can't stand the thought that Bucky might think he's changed his mind. He's desperate that Bucky think it's anything but that. \"Like you—like you said the other night. Want—I want to come inside you. Can I?\" He'd be mortified by the desperation in his tone, by even saying the words, if it wasn't for the way Bucky's face lit up.\n\n\"Yes,\" Bucky says, scrambling up onto the bed. \"Fuck, Steve, yes.\"\n\nThere's lube from somewhere, and a condom from somewhere else. Bucky just... produces them out of thin air, it seems, and Steve doesn't even have time to think. He rolls the condom onto himself with shaking hands, distracted again and again as Bucky preps himself eagerly, fingers glistening with lube as they slide in and out of his body, then Bucky's twisting around and wrapping his slippery hand around Steve's sheathed dick to slick him up—not stroking, because Steve's already too fucking close just from watching Bucky—as he wraps his other hand around the back of Steve's neck and leans in, kissing him hard, hot and wet.\n\nSteve slides his hand down the curve of Bucky's back where sweat beads on his skin. \"Steve—\" Bucky says, pulling back, his voice sharp in anticipation.\n\n\"Shh...\" Steve leans forward, licking at the skin of Bucky's shoulder where the skin is marred with scar tissue as flesh gives way to metal. The metal arm is cloaked as a facsimile of a real arm, but they both know better. Steve mouths his way across Bucky's shoulder and up his neck, nosing in behind his ear. Bucky braces himself on the bed head, looking back over his shoulder a moment. \"You have no idea,\" he says, \"how much I want this.\"\n\nOh, Steve's got a pretty good idea, since he feels that way himself.\n\nSteve's never fucked a man before, but he's done some painstakingly thorough research. His hands only shake a little as he guides his dick up against Bucky's slick hole. The soft whimper Bucky lets out is like music to Steve's ears as Steve slowly, carefully pushes into him, and Bucky pushes back onto him without halt until Steve's settled deep inside. \"Fucking hell, Steve, fuck—you feel—\" Steve rocks his hips and Bucky chokes to a halt.\n\n\"You okay?\"\n\n\"Nngh,\" Bucky breathes out lustily. \"'M better'n okay.\" Steve thrusts again and Bucky says, \"Oh god, that feels good.\"\n\nSteve grins. He doesn't know the words to describe how Bucky feels, tight and hot around his dick, but 'good' would be the least of it. \"You ready?\"\n\n\"Been ready for you—for this for a long time. Want you t' make me feel this tomorrow, Steve...\"\n\nJesus, Bucky knows what to say to push Steve's buttons. He takes no time to ponder Bucky's stutter as he grips Bucky's hips, fingers slipping on sweat-slick skin as he drives into him. Bucky's hand is white-knuckled on the bed head as he pushes back to meet Steve's thrusts, and the ragged way he gasps Steve's name and harder is enough to push Steve over the edge. His hips jerk as he empties himself, pressing deep into Bucky as he shudders.\n\nBucky snatches his metal hand away from the bed and jacks himself raggedly, urgently.\n\n\"No, wait, I want to—\" Steve says as he reaches for Bucky's dick, and his fingers barely graze skin before Bucky swears, slaps Steve's hand away, and comes wetly against the sheets.\n\nSteve holds him tightly for as long as he can, still pressed deep inside as Bucky shakes through his own orgasm, before slowly and reluctantly pulling out. He can't stop touching Bucky, sliding his hands over damp skin, pressing kisses against the back of his neck and along his shoulders. Eventually, though, Steve settles back on his heels and strips the condom off. When he comes back from the bathroom, Bucky still hasn't moved, braced against the head of the bed and his arms now folded on the iron rail, head hanging between them. He looks vulnerable in the curve of his naked back, his knees still pushed apart on the dishevelled sheets. \"Buck?\" Steve leans in, presses a kiss to his shoulder. He receives a grunt in reply.\n\n\"Come on,\" Steve says. Bucky's sweetly pliable in his hands, and when Steve pulls aside the dirty top sheet he lets Steve push him down flat. He smiles, a shadow of that familiar sleepy-drunk smile he used to give Steve when they shared an apartment before the war, when he'd come home late in the night stinking of booze and crawl into bed with Steve.\n\nLike this it's easy to remember he's loved Bucky ever since he met him, that under everything he's still the same guy who stepped between Steve and the bullies.\n\n\"Go to sleep,\" Steve says, forcing himself to stop touching Bucky.\n\n\"Need 'nother shower.\"\n\n\"Mm-hm, you can have one later.\"\n\nSteve's the one who has a shower now, the water ice cold against his skin. Bucky's passed out face down on the bed and Steve can't help pressing a kiss against the skin between his shoulderblades as he crawls back into bed. Bucky doesn't stir.\n\n(Steve is a little disappointed.)\n\n\n\nIt's not easy to get up and go to work, and Bucky has to remind himself half a dozen times between the bed and the shower that they're here for work, and he should really stop conniving to get Steve back into bed (he thinks he can still taste Steve in his mouth and god, he can't believe he got to suck him off and then Steve—Steve asked to fuck him, Stevefucked him). Once he's spent long enough under the cold water that his skin is starting to wrinkle, though, he's in a more workman-like state of mind.\n\nOf course, he's still painfully aware when Steve leans over his shoulder, where he sits at the workstation, and points at the screen. \"What's that?\" Steve asks. He smells like soap and acts like nothing has changed.\n\n\"Spam email. There's nothing to it. We've had the SHIELD eggheads go over it.\"\n\nSteve frowns. \"Now, I'm no expert at all the new-fangled technology of this age,\" and Bucky snorts, because if there's anything Steve's taken well to since thawing, it's modern technology, \"—but why would he be holding a spam email in his inbox? I delete all mine. I'm sure you do too.\"\n\nBucky doesn't.\n\n\"You don't.\"\n\n\"I... uh, don't check my email that often anyway.\"\n\n\"That's pretty obvious.\" Bucky wonders what Steve's sent him that he hasn't seen. Maybe he should check. Jesus, can he even remember his password? Most of his passwords were Russian. It's probably Russian. \"Do you have a print out?\" Steve asks.\n\nBucky rustles through the pile of papers by the keyboard. Steve's really let the tidiness of this workstation go to pot since Sitwell swapped out. \"Here. It's bullshit, I'm telling you.\"\n\nThe noise Steve makes is non-committal and he takes the print out and the file of Cohen's alphanumerical voice messages and heads out of the room. Bucky twists to watch him go and if his gaze lingers on Steve's ass, well. He's only human. Mostly. Human with cybernetic arm. Which is not the point.\n\nBucky shakes his head. He can't believe only hours ago Steve fucked him, Steve goddamn Rogers actually fucked him, and it was like all his filthiest sex dreams all rolled up into one.\n\nWhile he knows it wouldn't mean what he wanted it to mean to Steve—he hadn't lied when he told Steve to imagine it was anyone he wanted it to be sucking him off—he still remembers Steve's hot gaze on him the whole time Bucky was on his knees. Christ, Steve was too good. Bucky all but ordered him to close his eyes and imagine it was anyone else in the world and instead Steve looked at him like he never wanted to be anywhere else.\n\n(He'd thought Steve would falter at fucking him, but instead he remembers the break in Steve's tone when he'd said he wanted to; god, Bucky had been so turned on, his dick as hard then as Steve's had been earlier in his mouth.)\n\nJesus, he really needs to stop letting himself get distracted from the mission like this. This is serious business. This is something he has been working on closing down for a month now, and wasting his time thinking about how he can con Steve back into bed with him is not even remotely useful. If Cohen even is a Peeping Tom—and really, how creepy does that make them, fucking in case some guy is watching?—then he'll have gotten his eyeful. Bucky really needs to focus.\n\nHe keys to the last known communication between Cohen and his buyer. It had been an encoded message sent out under the guise of a money transfer by Cohen's receptionist nearly two weeks ago, just before Steve arrived. The money had been traced through a number of seemingly innocent hands, just to return back to Cohen doubled.\n\nSHIELD had thoroughly investigated all of the individuals who'd received and passed on the money, and the only one that had come up as suspicious was Dorren International, a shell corporation based out of the Cayman Islands. Bucky's not exactly up on illegitimate business, so he'll take their word on it. The code had come back too, also doubled, but instead of something SHIELD could crack, it was more of the alphanumeric garbage that is left on Cohen's answering service at all times of the night.\n\nHe gathers up that information too, and takes it down to Steve.\n\n\"Here,\" Bucky says, putting it down on the table. \"This is more of the same to check over if you want to keep wasting your time.\"\n\n\"I'm not wasting my time,\" Steve says, frowning. \"There's something. There's definitely something.\"\n\nBucky rummages around in the fridge. \"It's just spam, Steve. It's not going to sell you prescription drugs, it's not a Nigerian prince who wants to give you 40% of his fortune if you'll just give him your bank details, and it's not going to offer to make your dick bigger. Which you don't need, by the way.\"\n\nSteve's staring at him when he turns back, unscrewing the lid from the orange juice. \"What?\" Bucky says defensively. \"You don't.\" He chugs directly from the bottle, knowing it'll annoy Steve.\n\nIt does.\n\n\"Bucky,\" Steve says with exasperation.\n\n\"What?\" Bucky says innocently.\n\n\"There are glasses in the cupboard. Who knows where your mouth has—\" Steve suddenly clams up tighter than a drum and Bucky's never, ever seen his face go that particular shade of red before. It's rather heroic the way Steve manages to pull it together. Bucky guesses that's why he's Captain America.\n\n\"This is a key,\" Steve says, sounding almost like he's in pain. \"I think.\"\n\n\"Mm-hm,\" Bucky says. He licks his lips and Steve stares at his mouth a long moment before swallowing convulsively and dragging his gaze down to the page in front of him.\n\nBucky chooses to take Steve's reaction as encouragement that, while it might not mean anything emotionally, he might at least get another chance to take Steve apart with his mouth. He's definitely okay with that. He slides into the seat next to Steve. \"So, you think it might be a key?\"\n\n\"Yeah, uh... yes, I do. If you look at this here,\" and Steve indicates a string of numbers and letters, \"and at this,\" he points to a series of letters he's circled on the spam email, \"I've been able to detect a pattern.\"\n\n\"Uh-huh,\" Bucky says doubtfully. He can't see a pattern, but Steve obviously can.\n\nSteve grins at him, like that was the exact response he'd been expecting. \"What if I did this,\" he says, jotting down a series of letters.\n\nBucky recognises it. \"It's a poem code,\" he says immediately. \"Like what we had in the war.\"\n\n\"That's exactly what it is,\" Steve says, sounding satisfied by Bucky's recognition.\n\nBucky remembers a fragment of something from a lifetime ago. \"'The life that I have is all that I have, and the life that I have is yours',\" he recites, suddenly remembering the woman who was to take that poem to war.\n\n\"'The love that I have of the life that I have is yours and yours and yours',\" Steve murmurs in response. He holds Bucky's gaze for a long moment, expression undecipherable, and it's Bucky who has to look away first.\n\n\"I wonder what happened to her.\" Bucky hates that he knows that it would likely be something awful. Allied agents behind enemy lines didn't have much of a life expectancy.\n\nSteve shakes his head. \"I... I don't know.\" They'd met her in London, not long before—well, not long before Bucky had taken a dive from a train in the Swiss Alps. No, Allied agents behind enemy lines didn't have much of a life expectancy.\n\nSteve's fingers curl around Bucky's for a moment, squeezing gently, like he knows what Bucky's thinking. Bucky clears his throat and says, \"So if it's a poem code, how did SHIELD fail to decipher it?\"\n\n\"Three reasons: one, only these parts of it are encoded that way; two, it's a modified version of a poem code that I only managed to crack by accident; and three, it's one of the worst indecipherable messages I've ever seen. The transposition the operator is using is an absolute nightmare.\"\n\nWhile Bucky had been passable at encoding messages with worked out keys and one time pads and poem codes, it had been Steve, Jim Morita and Gabe Jones who'd excelled, and Steve's super-enhanced tactician brain had given him an edge on code breaking indecipherables that no one else in the team could quite replicate.\n\nHe remembers the coding training they'd been given in London like it was yesterday; between the SSR and SOE, nothing was to be left to chance. Bucky and the rest of the Howling Commandos had been shuttled by SSR around England to various Special Operations Executive stations—usually country manors requisitioned for the war effort—for the more specialised training agents to be dropped behind enemy lines received. Steve had all the training already, so he'd stayed in London, making nice with the SSR. And Peggy Carter, no doubt.\n\nBucky can't help but remember, too, how relieved he'd been to be sent for training away from the prying SSR staff who'd run almost as many tests on him as Zola had when he'd been strapped to the table in some Italian hellhole. How relieved he'd been to be away from Steve and his new body and new popularity, And Peggy Carter.\n\nThe twist of jealousy from a time long gone surprises Bucky with its intensity. Steve had been so into Peggy, and Peggy had been just as into Steve, while Bucky was—\n\nHe'd said it was like he was invisible and maybe he was, maybe that's who he'd become after his time under Zola's ministrations. Dames certainly didn't flock to him anymore to provide him a good distraction from what he could never have. When Bucky went out with the Howlers or when he went out alone, without Captain America to make him invisible, the English girls who loved Yankee soldiers would never spend more than a drink with him—\n\n\"It wasn't easy,\" Steve says.\n\n\"Huh?\" Bucky starts and blinks. Drawn sharply back to the present by Steve's idiot earnest face and the background hum of the refrigerator.\n\n\"Decoding it. It wasn't easy. It was luck mostly, at the start.\"\n\n\"Okay,\" Bucky says, perplexed by Steve's insistence.\n\n\"You're not—am I reading this wrong? I thought you were annoyed that I cracked it.\"\n\n\"...Um, no? Isn't that why we—why you're here?\"\n\nThey stare at each other a long moment before Steve laughs. \"Sorry, I don't know why I thought you'd be annoyed, I just—there was something in the look on your face. You looked—what were you thinking about?\"\n\n\"Some of the stuff we did for SOE training,\" Bucky says because it's not a complete lie. \"The time we were sent to Ringway for jump training while you got to stay all cosy in London.\" Ringway was where he finally realised that it wasn't everyone else that was the problem, that it was him (it had always been him). He'd tried to pull this pretty little thing (tiny and blonde), too drunk to read her body language and Tommy had rightfully taken exception to Bucky's insistence and bloodied his nose. Gabe and Dum Dum had to physically drag him off the guy to stop Bucky killing him.\n\nHe could have, he thinks. He would have. Bucky recognises now what was in him then. Before the war, defending Steve from the dropkicks and losers who thought Steve a soft target, he'd been content to bust a nose or loosen a few teeth. After Zola though, Bucky didn't know how to stop.\n\nHe realises Steve's frowning at him, echoes of the same frown Bucky remembers from when they'd returned to London, Bucky's nose looking worse for wear and with two black eyes. \"Ringway,\" Steve says. \"Why—\"\n\n\"Don't know,\" Bucky says shortly, because he can't exactly say he thought of Ringway only now, when Steve had asked, and he can't say what he was really thinking about—how much he resented Peggy every time they left Steve behind, and every time he was there too; how happy Steve looked because of Peggy and how Bucky had held onto that bitter jealousy because that was easier than letting himself remember what happened with Zola. Because he remembered. He remembered everything.\n\nSteve looks stung by his tone. He's about to say something when the monitor by his hand, hooked in to the work station upstairs, chirps to indicate Cohen's making a call.\n\nBucky hates when Steve has that kicked puppy look and he reaches out, squeezing Steve's hand. \"I'll go and check it out,\" he says, trying for a lighter tone.\n\nHe hates the faint furrow between Steve's brows too and gently smoothes it away with a fingertip. The unexpected gesture makes Steve smile and even Bucky feels better as he jogs up the stairs.\n\n\n\nSteve's carefully typing the information he's found regarding the code left on Cohen's answering machine into the SHIELD issue laptop as Bucky plops down on the couch next to him. He watches Steve carefully peck out each letter.\n\n\"Coulda sworn you can type better than that,\" he says curiously.\n\nSteve makes a growly noise in the back of his throat. \"SHIELD gave me this—this piece of garbage computer where the keyboard is half-broken and doesn't type half the letters I press and I have to be really specific because of what the information is and—\"\n\n\"Why don't you use the workstation?\"\n\n\"Well... you were up there and I didn't want to bother you.\" He's stupid-earnest as he looks at Bucky. \"I thought you might have needed some quiet time.\"\n\nBucky's sure he'd find that kind of consideration smothering from anyone else, but it's a sign how gone he is on Steve that he's touched more than annoyed. It's sweet. So much for his reputation as a certified badass, he thinks, if anyone finds out about this.\n\n\"I also guessed if you didn't come straight back down, then Cohen's call mustn't have been relevant.\"\n\n\"Relevant, but there's no rush.\"\n\n\"Oh?\"\n\n\"Cohen's going out on a date tonight with Deidra from the end of the street—\"\n\n\"Deidra...? Wait, Dee-dee? The one with the little yappy dog?\" Steve asks and Bucky nods. \"That's sweet, she deserves a bit of happiness—\"\n\n\"You forgetting he's a wanted criminal?\"\n\n\"Oh. Right.\"\n\n\"Yeah,right.\" Bucky rolls his eyes. If anything, Steve's getting more into this community than Bucky is (and Bucky will be the first to admit that even though they're overwhelming, and sometimes he needs the silence and to be alone, he really likes these people and wants the best for them). \"How about we find someone to set her up with who isn't an incredibly dangerous man?\"\n\nStraight away Steve says, \"What about Assan in Tony's R&amp;D Department? He's about Dee-dee's age and he's got that little chihuahua dog he dotes on.\"\n\n\"...You've thought about this before, haven't you?\"\n\nSteve beams at him. \"A little. She is a lovely woman, and she's been incredibly lonely since Bill died. I see her a lot when I do the grocery shop.\"\n\nBucky can't help the stupid well of affection at his idiot best friend and reaches out, pulling Steve into an awkward one-armed hug. \"Okay,\" he says after he clears his throat because he did not choke up, \"we should, uh, probably get someone to keep an eye on Cohen while he's off on his date because this'll be the best chance for me to get into his place and get eyes on his files.\"\n\n\"I've just pinged Coulson,\" Steve says, tapping a few keys. \"He'll be here shortly.\"\n\n\"Oh, well aren't you Mr Organisational Skills.\" Bucky suddenly grins. \"Last time he came by I called him Uncle Phil and made out like he was Sitwell's—cousin Jasper's—father. But by marriage. Because of the whole, y'know, Sitwell and Honduras thing.\" Bucky learned a lot about Sitwell while they were working together and while he mightn't be an interrogator of Natasha's level, he's sharp enough when he needs to be and it's good to keep his soft skills polished.\n\nSteve looks confused. \"But they're both the same age.\"\n\n\"I know! It's that receding hairline. Really ages a man. At least Sitwell's graciously bald and doesn't look nearly as old in civvies.\"\n\n\"You shouldn't laugh, Buck,\" Steve admonishes. \"Agent Coulson can't help his genetics.\"\n\n\"Steve, he showed up wearing an Hawaiian shirt like that was his idea of subtle. What else was I meant to do?\"\nCoulson shows up fifteen minutes later, not, thankfully, wearing an Hawaiian shirt this time. \"Uncle Phil,\" Bucky says when he opens the door, throwing his arms around the agent in a slightly malicious, slightly too tight hug. \"So great to see you.\"\n\nCoulson's scowling when Bucky pulls back.\n\n\"Phil,\" Steve says, shaking Coulson's hand. His cell phone pings. \"Ah, you're just in time. Reena and Lily have invited us to the park for a picnic.\"\n\n\"Reena and Lily?\" Coulson asks suspiciously.\n\nBucky beams at him. \"You'll love them. Lily'll take a particular shine to you.\" He can't help his gaze flicking to Coulson's hairline and Coulson scowls. Ah well, let him think whatever he's gonna think; all Bucky meant was that Lily had a penchant for indiscriminate swinging from neckties.\n\nSteve says, \"I'll grab the blanket,\" just as Bucky says, \"I'll grab the wine.\"\n\n\"If they've invited you, why—\"\n\n\"We bring the blanket—\"\n\n\"And wine,\" Bucky adds. \"We need wine—\"\n\n\"You need wine.\"\n\n\"I need wine.\"\n\n\"—And Reena brings the food,\" Steve says.\n\nThey've done this enough times before that it's only a couple of minutes before they're out the door, Phil trailing along with a perplexed look on his face that, and Bucky's not ashamed to admit it, gives Bucky a sense of satisfaction. He's had enough of this guy turning the tables on him in the short time he's been with SHIELD—it's nice to get some of his own back.\n\n\"This seems like a good spot,\" Steve says, shaking out the blanket and smoothing out the wrinkles when he places it on the grass. He sprawls out on it and pats the ground next to him. Bucky sets the wine down and sits. Steve's hand is warm where he rubs his knuckles against Bucky's knee. He doesn't have to, but it's nice that he does; there are other families in the park, but no one close enough to see such a small gesture, and Bucky can't help but smile down at him. Steve smiles back. \n\nYeah, it's nice.\n\nCoulson clears his throat awkwardly. \"Shouldn't we discuss—\"\n\n\"Plenty of time for that,\" Steve says, not looking away from Bucky and Bucky desperately wonders what's going through his mind right now. This is not a staring competition, after all.\n\nBucky's the one who breaks his gaze away first.\n\n\"Hey James, hey Steve!\" someone says. It's Jan and she's kitted out for jogging, sweat marks on her shirt and glistening on her forehead, glueing the curls from her perm to her skin. She stops by their blanket, puffing a little.\n\n\"Hello, Jan,\" Steve says. \"How are you? How is Jim?\"\n\n\"Oh, we're good.\" She beams. \"And who is this?\"\n\n\"This is James's Uncle Phil, he's come to visit for the day,\" Steve says.\n\nShe turns her smile on Coulson, who is looking decidedly disgruntled. \"You must be so proud of your nephew and his wonderful husband,\" she says warmly. \"They've really made themselves a part of this community.\"\n\nCoulson manages a smile. \"Yes,\" he says, his tone strangled. \"Very... proud.\" Bucky shares a glance with Steve and is glad he's not the only one fighting back a smirk.\n\nIf the way Bucky leans over and gives Steve a long, lingering kiss as Jan leaves, and the way Steve catches him with a hand at his nape to stop him from pulling back just to kiss him again makes Coulson uncomfortable, well, Bucky doesn't care and he's pretty sure—for the sake of keeping cover—Steve doesn't either.\n\n(Bucky cares even less about Coulson's reaction, because even if Bucky initiated the kiss, Steve was the one who reeled him back in. He thinks it's the first time outside of the bedroom and their adventures in pretend fake sex Steve has done something like that. He wants to push Steve flat on the rug and kiss him stupid, he's so pleased.)\n\n\"Uncle Steve!\" he hears Lily scream, and Bucky pulls back to see her pelting across the park towards them. Bucky's not exactly well versed in small children—he's been exposed to them more on this mission than all the rest of his life combined, it feels—but she seems surprisingly coordinated for a toddler.\n\nThat, of course, goes out the window when she launches herself at Steve and lands with both feet and her entire weight on Steve's crotch. Steve's eyes bug out and he goes first white, then red, as he bites back a curse too heinous to ever pass Captain America's lips.\n\n\"Lily!\" Reena says, aghast. \"Oh my god, Steve, I'm so, so sorry.\"\n\n\"What's wrong with Uncle Steve?\" Lily asks as Reena sets the basket down and sweeps her up into her arms.\n\nBucky, god, he knows how much it hurts to be kicked in the crotch but the sight of Captain America undone by a three year old, Steve trying to regain his composure and not obviously cradle his abused junk in one hand, makes him smile. He's polite enough to cover his mouth with his hand though.\n\nCoulson looks just as horrified as Reena (though given his borderline creepy obsession with Captain America, probably for an entirely different reason), and Bucky can't help himself when he leans over and says in Steve's ear, though none too quietly, \"It's okay, baby, I'll kiss it better for you later.\"\n\nSteve blurts out a laugh followed by a choked groan, pressing his face against Bucky's neck. It seems like such a natural, comfortable gesture; it's just a shame it took Steve being stomped in the dick to make it, Bucky thinks. He curls his fingers through Steve's hair, pressing his lips to Steve's temple.\n\n\"Come on, Phil,\" Reena says, \"I've forgotten to fill the jug, we can go and get some water.\"\n\n\"Do I have to—\" Coulson stops. \"I'm sorry, that was extremely rude of me. I'd love to.\" He throws a glance at Steve and Bucky, waggling his eyebrows. Bucky has no idea what that means and a glance at Steve makes it pretty clear he doesn't either.\n\nOnce they've headed away from the blanket, Lily firmly ensconced between Coulson and Reena, gripping their hands tightly, Bucky turns to Steve. \"How are your—\"\n\n\"Tender,\" Steve says. \"But I'll be fine. I'm Captain America,\" he adds. \"I can take a kick in the balls.\"\n\n\"Yes, you are and yes, you can,\" Bucky says fondly.\n\nSteve chuckles and shifts so his head is pillowed on Bucky's shoulder. It's... it's nice, Bucky thinks. It's better than nice, even. It can't be so comfortable for Steve, since it's Bucky's half-metal, half-flesh shoulder, but Steve doesn't complain.\n\nBucky closes his eyes.\n\nAfter a while, he can hear Coulson and Reena and Lily approaching. \"Lily, don't put that in your mouth, it's not candy, sweetheart. Sorry, here, Phil—\"\n\n\"My fault, I should have kept a closer eye—\"\n\n\"She's three, she's old enough to stop sticking things in her mouth and slobber all over them. Let me just get a wipe.\"\n\nBucky's sure Steve can hear them approach too—he's Captain America, how could he not?—but that doesn't stop him from shifting, pressing his mouth to Bucky's neck, jaw and then—\n\n\"Oh hello,\" Bucky murmurs against Steve's lips. He feels Steve's smile and then the pressure of his mouth again in slow, lazy open mouthed kisses. He can't help the small flinch when he feels Steve's fingers creep up under the hem of his singlet, and his own fingers curl over the collar of Steve's shirt. If maybe he lets out the tiniest of breathy little groans, well who could blame him?\n\nCoulson clears his throat.\n\nSteve ignores him and inches his hand up under Bucky's shirt a little higher, hand pressed flat against his skin, and Bucky just wants to arch into his touch.\n\n\"Don't mind them, Phil,\" Reena says. \"They're still in the honeymoon stage.\" She pauses. \"Though I don't recall me and Michael lasting even half as long.\"\n\nSteve raises his head and slowly (reluctantly?) pulls away from Bucky. \"His loss,\" he tells her. \"I'd think you should still be.\"\n\nShe laughs. \"After a kid it's hard to keep up the momentum, and she came along early. Lily, please stop hassling Steve.\"\n\n\"No, it's okay,\" Steve says as the little girl crawls into his lap. She has her mother's brown skin and her father's curly hair and she's cute in the way tiny children you can give back to their parents are cute. Bucky's not usually a fan of kids, but he's willing to make an exception, given how Steve fawns over her.\n\n\"You two gonna have kids?\" Reena asks slyly.\n\n\"No,\" Bucky says instantly just as Steve says, \"We've talked about it.\" Steve makes a face at Bucky. \"And that's how most of the discussions go, right there.\" He reaches out and wraps his hand around Bucky's nape, and Bucky feels a shiver skitter up his spine as Steve gently scrapes his fingers through the short hairs there. Bucky's pretty sure his expression goes a little dopey as he looks at Steve, but he can't help himself.\n\nCoulson clears his throat. \"James, a word please.\" He crooks his finger to indicate they should walk.\n\nThey're possibly out of Steve's earshot when Coulson says, \"You're aware this is just a mission, right?\"\n\n\"What do you mean?\"\n\n\"The two of you all... touchy-feely—\"\n\n\"You got a problem with queers?\" Bucky asks pugnaciously. He doesn't give a shit if Coulson is SHIELD, if he's being homophobic, Bucky's more than happy to teach him the wrongness of his ways. With his fists as necessary.\n\n\"No, no,\" Coulson says hastily. \"It's just—he's Captain America, so—\"\n\n\"So what? So he can't be happy?\"\n\n\"Oh,\" Coulson says. \"Oh. I thought it looked too good to be an act.\"\n\n\"Well, it is, 'cause we're not, but if we were, doesn't he have the right to be happy with someone, Captain America or not? He's not a pop star or an actor or someone who has to appear to be single or the teenyboppers won't buy into his hype.\"\n\n\"Teenybopper?\" Coulson says. \"You know that term?\"\n\n\"I was an international assassin for the Soviets, Coulson. Contrary to popular opinion, I wasn't dead, I wasn't in deep freeze all the time and I'm not an idiot. I know all about pop culture. But that's beside the point. Why should it matter to you how we act on this mission? Fury was briefed, he knew what it was about. That you thought it was... something more means the cover is solid, right? What is there to worry about?\"\n\nBucky knows there's plenty to worry about, but he's pretty sure Fury, Coulson, and SHIELD will give zero fucks about the state of his heart once this is all over. At least he'll know what it's like, he thinks, if they really were together. He'll know what he's missing. He'll know what it is he's pining for.\n\nHe knows the feel of Steve's skin against his.\n\n\"I'm just concerned about future missions, that's all. The two of you work extremely well together, and SHIELD doesn't want to see that compromised because of any complications arising because of a—a gay tryst.\" Bucky's not sure he's ever seen Coulson look this uncomfortable.\n\nBucky suddenly wonders if SHIELD knows more than they're letting on; he'd requested Steve for an op where they needed to pretend to be married, with the understanding that it would require some public actions to maintain the cover. But maybe they know about what's going on in the bedroom too.\n\n\"A gay tryst?\" he asks suspiciously, thinking about pretend fake sex. The fact that Cohen might be watching them in their bedroom at night is not really a motivation that holds up well to too much scrutiny. He and Steve have never really talked about it and Bucky wonders if that's why. It's a flimsy excuse to fuck that, at best, doesn't bear to look at too closely.\n\nBucky knows what his motivations are. But what could Steve's possibly be? Steve couldn't—\n\n\"Don't underestimate the ability of... Cap's fans on the Internet to find everything to do with their idol. This public canoodling may come back to bite you.\"\n\nBucky blinks. That's not the way he'd thought that would go. \"On the butt?\" he asks, to cover his confusion (and tries not to imagine exactly that).\n\n\"What?\" Coulson looks confused too.\n\n\"Never mind.\" Bucky shrugs. Public canoodling. Jesus, Coulson is more prehistoric than Steve and Bucky combined sometimes. There's been nothing in Coulson's tone to indicate that he knows squat about any bedroom shenanigans, which Bucky is relieved about. \"While I think your concerns are valid,\" he says carefully, \"Steve and I are both adults and we understand that this is merely a mission. If assholes on the Internet want to make something about Steve's sexuality, I'm sure he'll be perfectly capable of dealing with it.\"\n\n\"And you?\"\n\n\"No one's gonna talk jack about me.\"\n\n\"But if they do?\"\n\n\"I'm perfectly comfortable in my sexuality. If the Internet wants to speculate it's up to them but it's still none of their goddamn business.\" This is probably one of the most surreal conversations Bucky has ever had, and given who he is and everything that's happened, Bucky's had some fucking surreal ones in his time.\n\nCoulson looks at him intently, before finally saying, \"If you say so.\"\n\n\"I say so,\" Bucky says firmly. \"Now can we drop it?\"\n\n\n\nIt's about the same time as Coulson reports that Cohen is leaving the restaurant after his date with Deidra that Bucky trips a silent alarm on his stealthy once over of Cohen's home office. He's sure there has to be information of value hidden there somewhere after finding absolutely zero information of worth in his files.\n\n\"Keep it calm, Buck,\" Steve says as Bucky swears vociferously right in his ear, even as his own heartbeat kicks up a notch. \"Coulson has eyes on him. ETA eight minutes.\"\n\nHe listens to Bucky's under-his-breath grumbling, one eye on the clock, the other split between Coulson's updates on the bottom screen of the workstation, and the top screen with it's little glowing spot on the floorplan of Cohen's house that represents Bucky.\n\n\"There's an alarm installed in the study on the south wall,\" Bucky murmurs. \"Let me just fiddle with... this. There, how's that?\"\n\nSteve scans the screens in front of him. \"It's stopped the alarm from going out. Coulson says Cohen's reached the corner, and he's walking fast. ETA five minutes.\"\n\n\"You told me eight,\" Bucky grouses.\n\n\"Yes, and like I said: he's walking fast. You need to get out of there.\"\n\n\"In a minute—\"\n\n\"Bucky—\"\n\n\"Just let me... ahh, here we go. Holy hell,\" Bucky's whistle is distorted through Steve's headset, \"would you look at this...\" There's silence on the other end as Bucky's voice trails off.\n\n\"Buck?\"\n\n\"You're gonna love this, Stevie.\"\n\nSteve glances to Coulson's screen. \"Three minutes, and don't call me Stevie. You need to get out of there now.\"\n\n\"In a minute.\"\n\n\"You don't have a minute.\" On a third screen there's grainy footage of a little camera that had been mounted to spy on comings and goings from Cohen's front door and Steve can see Cohen appear at the end of the street. He's clearly hurrying, a deep frown on his face.\n\nIs he out? Coulson asks.\n\n\"Bucky, he's at the front door,\" Steve says urgently when he realises Bucky still hasn't moved. He holds his breath as he watches Cohen hurry in through the front down door and then the glowing dot that is Bucky is finally moving. Steve can only imagine Cohen rushing upstairs as Bucky darts to the window, and his overactive imagination is fueled by all kinds of horrible scenarios on what could happen.\n\nIt's not like he thinks that Cohen would win a physical throwdown with Bucky, but they know he has weapons—albeit legal ones—stashed in his house, and Bucky's not invulnerable to bullets. But on top of that, he knows how furious Bucky would be if this mission was botched, all his hard work gone to waste.\n\nHe watches as Bucky's out the window and then into the small yard at the back of the building, a mirror to their own; there's a loud pained grunt in his ear and the glowing dot is still for an agonisingly long time. \"Bucky?\" Steve says. He almost misses the shush of response, it's so quiet.\n\nCoulson's returned by the time Bucky's started moving again, and Steve steers him towards the workstation before he takes the stairs two at a time and darts out into the backyard.\n\nThere's a carefully hidden panel in the fence that provides an entrance to the narrow lane that runs along the back of the property, and just as Steve crouches down by the fence, Bucky tumbles through.\n\n\"Jesus Christ,\" Steve swears, simultaneously relieved and furious. He grabs Bucky by the shoulders. \"You cut that far too close.\"\n\nBucky looks up at Steve and grins, happy and victorious and Steve can't remember when he last saw that kind of light in Bucky's eyes (not this century, he thinks). \"Was completely worth it though,\" he says, holding up the little document scanning device he's carried since his first SHIELD mission, wanting for a chance to use it. Even with twigs and leaves in his hair and dirt on his face and clothing, Steve just—he wants to kiss Bucky so badly right at that moment he doesn't know how he manages to restrain himself.\n\n\"C'mon in and I'll show you.\" They slip back into the house and Steve follows Bucky up the stairs.\n\n\"Here,\" Bucky says, pressing the scanner into Coulson's hands. \"Take it and decode it. It'll give us more information than we know what to do with if your brains can decipher it.\"\n\nSteve's happy to see he's not the only one looking at Bucky with confusion, and Bucky grins and leans past Steve, hooking the scanner up to the workstation. He brings up the first documents.\n\n\"They're invoices,\" Coulson breathes.\n\n\"Yeah. There's a couple of manifests as well, for cross-reference. I couldn't scan everything, but I did what I could and then I re-rigged the alarm to look like—\" He's interrupted by the tap on Cohen's line.\n\nCohen's calling out, but the number doesn't amount to much; one of the burner phone numbers Cohen's been occasionally in contact over the past two months, where he never receives an answer, just leaves a voice message. This time is no different. \"It appears to be a false alarm,\" Cohen says. \"A poorly maintained wire set it off. I am convinced there is nothing to be concerned about.\" He hangs up.\n\nSteve glances at Bucky who shrugs deprecatingly. \"I recognised the alarm type,\" he says. \"I've reset them before. It's a notorious flaw in the brand, and the corrosion on the end of the wire was a dead giveaway. Even if I hadn't set it off, it was bound to trip itself eventually.\"\n\nSteve can't help grinning at him even if its more relief than anything and he reaches up to pluck a twig and a leaf from Bucky's hair, pressing it into his hand.\n\n\"Use the codes Steve sent through to decipher this. I can guarantee these guys won't go out of their way to be any more creative than they absolutely have to be.\"\n\n\"Invoices, though? For something this illegal?\" Steve asks dubiously.\n\n\"Cohen's anal enough to want to keep records, and arrogant enough to think his code is unbreakable.\"\n\nSteve knows it mightn't be useful in the meeting with Parenelli, but it'll be helpful in building a case against Cohen; establishing exactly what kind of clients he's selling to and with any luck maybe their details too, while the manifests would help make a case against the shipping companies bringing the weapons into the country.\n\n\"The documents were carefully hidden,\" Bucky continues, \"and I missed them in my previous sweeps, but the silent alarm gave it away that there was something hidden.\"\n\n\"How come you didn't realise it was there before?\"\n\nBucky scrubs his hand through his hair and looks sheepish. \"I tripped over,\" he muttered.\n\nCoulson clears his throat and looks away, but Steve just stares at him, unable to help the smile turning up the corner of his mouth. Bucky shrugs and gives Steve a sly sideways look. \"Happens to the best of us, though, don't it? Like dropping the shield—\"\n\n\"Yes, well,\" Steve says hastily and he can't believe Bucky is even joking about that. \"Enough about that, good thing you found it, well done, Buck.\" He claps Bucky on the shoulder, goes to remove his hand and then with a second thought leaves it there. Bucky doesn't seem inclined to duck away.\n\nIt's late when Coulson leaves, picked up out the front by a nondescript car, the scanner and copies of the documents Bucky found hidden in a leather satchel. \"I'll let you know what we find out,\" he says as Steve shakes his hand. He manages to escape into the car before Bucky gives his 'Uncle Phil' another of those hugs, and Steve laughs at the relieved look on Coulson's face as he pulls the car door shut behind him.\n\n(Later when they're getting ready for bed, Steve sees the bruising on Bucky's shoulder and hip. \"I fell off the roof,\" Bucky says, annoyed. Steve can't help running his fingers lightly over the mottled flesh and Bucky closes his eyes and turns his face away.)\n\n\n\nJim's retirement party is held at a fancy mansion that belongs to his boss, and while Steve's all for calling in a SHIELD car to drive over there, Bucky points out that at no point have either of them ever indicated they own a car. Steve arrived in a cab, after all.\n\n\"Oh,\" Steve says sheepishly. \"Right.\"\n\nThey take a cab and Steve feels completely awkward climbing out in his formal wear. He's sure people all over the country do exactly that, but whenever he's had to turn up to a formal do in this century it's always been in a limousine.\n\nGod, he's getting as spoiled as Tony, he thinks, as he and Bucky head towards a set of heavy iron gates set into a high brick wall.\n\nSteve is an idiot, so he can't help the little flutter of joy in his chest at the ease in the way Bucky slides his hand into Steve's, linking their fingers together. It's not because of the mission, or even because he's been head over heels for Bucky for as long as he can remember. It's because he knows under that apparent skin is metal, and because for a long time after Steve got him back, Bucky wasn't willing to touch or be touched. It's the casualness of this gesture that makes Steve grin like an idiot and want to pull Bucky in and kiss him hard.\n\nInstead he curves his fingers around the back of Bucky's neck and kisses him because they're pretending to be married and stupid in love, and for some reason Bucky had decided, back when Steve arrived, to make this cover about their public affection.\n\nOf course, the first thing Bucky then does is reinforce Steve's insecurity. \"What was that for?\" Bucky asks suspiciously.\n\n\"Can't I kiss my husband?\"\n\n\"Oh.\" He can almost see Bucky change up a gear, as a winsome smile breaks across his face. Steve wishes it could be for real, just for once. One time. That's all it would take. For Bucky to look at him like that and mean it.\n\nThey stop outside the gates for a moment for one last once-over, and Steve can't help how thorough his once-over of Bucky is, because he is truly a sight for sore eyes when he's dressed up. He reaches out and straightens Bucky's tie, fingers brushing against Bucky's neck and smiles.\n\n\"You look great.\"\n\nBucky grins back at him. \"I know. C'mon,\" and he slips in under Steve's arm, hooking his own around Steve's waist, \"we got a party to attend.\"\n\nThere are ground staff waiting just inside the gate, and they're politely ushered around the side of a large, fancy building to an open-front marquee where a small crowd is milling. In the background a quartet plays hits from the decade Steve and Bucky went to war.\n\nHe turns to say something to Bucky, and finds him standing by his side with a glass of champagne in each hand. \"Drinking problem?\" Steve asks.\n\nBucky grins and presses one of the glasses into Steve's hand. \"Mingle,\" he orders.\n\nAfter an hour of free booze and mingling (Steve mingling, Bucky propping up a wall and watching, chatting with Reena as her husband did the same) they're ushered from the grounds and into the main building.\n\nBucky seems fairly relaxed about their surroundings, but Steve gawks around the mansion as they pass through the entrance foyer. \"It's impressive,\" Bucky says quietly, grinning, \"but I've seen better.\"\n\nSteve rolls his eyes. \"Of course you have. What did you say Jim does—did—again?\" \n\n\"His boss owns the largest juice box plant in the tri-state area. Jim's been with him since the start, which is why his shindig is here.\"\n\n\"You know, I think we're in the wrong line of work, Buck.\"\n\nBucky smirks. \"You're only just realising that now?\"\n\n\n\nBucky smiles politely at the other guests as they're lead into a large dining room, where the centrepiece is a long mahogany table that can seat twenty-six. When they take their seats, Bucky's already identified three exits and another two that could be used in a pinch. It takes him a moment to realise what he's doing and he sighs in annoyance. Steve covers his hand. \"Everything okay?\" he asks quietly.\n\nBucky lets the frown smooth away at Steve's touch. \"Yeah.\" He reaches out to pick up the little name tag at his setting. The name, James Buchanan, is embossed in gilt. \"Look,\" he says, smoothly diverting Steve's attention as he sits the little cardboard tag next to Steve's. \"We match.\"\n\nSteve glances at Bucky's nametag and then his own and his smile is a mix of embarrassment and something else Bucky can't quite identify. (It warms him, though. Jesus, it warms him, like not a lot of things do in this decade.)\n\nHe sees the way Steve worries at the wedding band with the pad of his thumb, an unconscious gesture and this isn't the first time Bucky's seen Steve do it. Then Steve's smile goes a little misty, a little distant, and Bucky wonders what—or who—he's thinking of.\n\nHe's distracted from asking about it (\"Penny for your thoughts?\") when a waiter appears at his elbow, waiting politely for a drinks order and the thought goes completely from mind when he sees the familiar face of their target further down the table.\n\nBucky elbows Steve in the side and gestures towards Cohen. Steve nods.\n\nThe meal they're served is suitably lush, full of things Bucky can't identify and probably wouldn't be able to pronounce even if he could. It's good though, except for a weird jelly fish thing from the entree that he foists off on Steve.\n\nAt some point between the speeches and dessert, a woman from Jim's office sitting opposite and two seats to Bucky's left leans forward and says to Steve, \"You know, you really remind me of that Captain America fellow. His name is Steve too, right?\"\n\nSteve's not good enough to hide his freeze, but Bucky leans back in his chair (the movement draws the eye away from Steve's painfully frozen expression) and then reaches out to tenderly cup Steve's cheek. \"You get that a lot don't you, babe?\" he says. He cuts a smug and mischievous glance towards the woman. \"Why d'you think I married him?\"\n\n\"Hey,\" Steve protests, like his brain has finally kicked into gear. He covers Bucky's hand with his. \"You told me it was for my killer lasagna.\"\n\nBucky laughs and leans in to him. \"And your killer abs.\" Steve is the one to initiate the kiss, something perfectly innocent for the company they're in. There's that something in his eyes again when he pulls back and Bucky desperately wishes he could decipher it. He thinks it's important.\n\n\"I wish I was Captain America,\" Steve says earnestly to the woman. \"Can you imagine how great that guy's life must be? Not having to work for a living, getting to beat up aliens. I bet Captain America has working air-conditioning!\" There's a smatter of laughter from their section of the table.\n\nPleased, Bucky sits back and watches Steve win over yet another group of strangers.\n\nHis cell phone chimes softly in the middle of dessert and glancing at the screen he politely excuses himself, angling the screen to Steve at his querying look to show him it's Sitwell.\n\nHe's just finishing up the call when Steve comes out into the foyer, raising a brow questioningly. Bucky reaches out and tugs Steve in close by his lapels and even though there's no need, even though the only people fluttering around are the catering staff who are completely ignoring them, Bucky leans in and kisses Steve.\n\nHe tastes like lemon tart and raspberry sorbet and it's everything Bucky can do not to chase the taste right out of his mouth. Reluctantly he pulls back and says quietly, \"We have a time and a location. You were right, the spam email was the key to the code on Cohen's answering machine.\"\n\n\"Where?\"\n\n\"At the Moore warehouse, at around 2am. Sitwell says Parenelli is flying into the country next Tuesday under a false name. He'll be here for two weeks before he heads on to South Africa.\"\n\nSteve frowns. \"That's still not very specific.\"\n\n\"Nope. But it's a firm lead at least, better than anything else we've got. SHIELD is going to set up surveillance on the warehouse in the meantime so we—I, at least, don't have to prowl around in the middle of the night for two weeks.\"\n\n\"That's nice of them,\" Steve says. \"We'll just have to sit in a surveillance van instead.\" He frowns down at his chest for a moment before his head suddenly comes up. \"There was a second spam email.\"\n\n\"What?\"\n\n\"In the trash of Cohen's email, there was a second spam email.\" Bucky's dialling almost before Steve's even finished talking, making shooing gestures for Steve to go back into the party. When they'd taken a complete copy of all of Cohen's emails, he hoped they'd remembered the trash, too.\n\nSitwell dryly comments that SHIELD isn't as stupid as Bucky would like to think sometimes and he will look into it immediately. Bucky likes Jasper Sitwell, likes his humour and his professionalism.\n\nAs much as he's glad Steve is with him now (and oh, he is glad), he hopes Sitwell will be there for the final bust. They've both been on this case since the start, after all: Bucky's first significant mission and first undercover since he got his brain back, and Bucky recognises how much of an impact the agent has had on his own attitude and self worth.\n\nHe thinks, as he returns to the dining room, that they might even be friends. He likes the thought; he doesn't have a lot of friends anymore.\n\n\n\nBucky's bored once dessert is done and the evening turns to tea and coffee and mingling.\n\nHe leans towards Steve, slides his hand over Steve's thigh and murmurs, \"Meet me upstairs.\" He doesn't miss the flicker of a smile on Steve's face as he slips away. He also doesn't miss that his exit is noted by several guests at the table—including Cohen—and then that's about as much professional notice he takes of the evening.\n\nHe jogs up the staircase, smiles politely and not at all with anticipation at the liveried attendant coming down the stairs. A quick check reveals a bathroom—which he disregards because it's tacky to fuck in the bathroom—a sitting room and a small board room. The board room has a shiny oak table and a lock on the door.\n\nHe's a little hard already just at the thought of Steve bending him over that table. If it's anything like the way Steve fucked him the other night, he's gonna head back downstairs looking like one of the blowsy whores he used to rent in Paris during the war. He's okay with that.\n\nExcept.\n\nIt's been more than ten minutes when Bucky realises that Steve's not coming upstairs. His anticipation has turned into nerves has turned into anger has turned into embarrassment at the thought that Steve might not want—\n\nHe wonders if he could sneak down and pretend nothing had happened, except he's already flushed with mortification at the thought, because he knows Cohen made his intention, and the touch on Steve's leg didn't go unnoticed.\n\nBucky allows Steve another agonising five minutes to come upstairs before he concludes that it's just not going to happen. Well, fuck.\n\nThe window from the sitting room opens onto a small balcony, and it's a piece of cake to flip over the edge and drop down to the ground. Evading the security staff on the grounds is something he could have done with a blindfold on, and he vaults easily over the fence into the street, without even dirtying his suit.\n\nThe short train ride home he spends in sulky silence, glowering at anyone who even thinks of sitting near him.\n\nHe's home for almost an hour and a half before Steve returns. He has to knock, because they'd only taken the one set of keys.\n\n\"Where did you go?\" Steve says crossly, as soon as Bucky opens the door. Bucky stares at him. Steve's only saved from having the door slammed in his face when he uses his stupid super soldier reflexes and jams his foot into the doorway before it can close.\n\nBucky releases it and steps back, not trusting himself to speak.\n\n\"I asked you a question,\" Steve snaps. Bucky just shakes his head and turns away. He's stopped by Steve grabbing his arm. \"Hey, answer the question—\"\n\nBucky jerks his arm away. Yeah, no, he really doesn't appreciate being manhandled like that. \"I'm not one of your little soldiers,\" he snarls, \"to be ordered about.\"\n\nHe storms up the stairs because he can't stand to look at Steve, because he's tired, because all they can do now is wait for the meeting to happen and now he can sleep eight hours if he wants without worry, and he just doesn't have time for this bullshit with Steve when he could be sleeping.\n\nSteve follows him up the stairs.\n\n\"What have you got to be angry about?\" Steve growls, though he doesn't look even half as angry anymore, instead mostly perplexed.\n\n\"Nothing, don't worry about it,\" Bucky snaps. He's embarrassed because he'd wanted Steve to come upstairs at the dinner, thought he would because he thought he'd read Steve correctly, that maybe the feelings Bucky had for him were mutual, except—\n\nSteve hadn't followed him and Bucky was just left feeling like a giant idiot who wasn't about to make it worse by spilling his guts to Steve now, like a lovesick teenager. He knows when things aren't worth it, and this? This is not worth it. He doesn't for the life of him think Steve would ever reject him for his inappropriate feelings, because Steve is Steve and he's so noble and nice it makes Bucky's teeth hurt sometimes.\n\nBut here, now, if he told Steve he might lose the right to touch him like they're really in love, like they're married. Steve would pull out of the mission to save Bucky pain (because noble, etc) and they're so close to the end Bucky couldn't bear it. And if he's completely honest with himself, Bucky knows he's selfish, just as he knows that if he told Steve he was in love with him there would definitely not be anymore pretend fake sex. There's no way on this green earth that Steve would ever let someone have sex with him when the feelings about the situation weren't mutual. (And Bucky knows he's running out of time, that in a week, maybe two at the outside, this will be all over and done with and there'll be no more chances to—)\n\nIt all makes Bucky laugh a little hysterically. \"Nothing,\" he repeats. \"I'm angry about nothing.\" Because it's true. He's angry over nothing and he can't help himself.\n\nHe slams the bedroom door behind him, stops, thinks a moment, and yanks it back open. Steve's still standing at the top of the stairs, looking utterly dumbfounded. Bucky can't help himself. He jabs his finger at Steve, saying, \"And you're sleeping on the couch tonight!\" before slamming the door shut again.\n\nIt's... he's embarrassed at how good it feels to indulge in those kinds of theatrics, like this is a real relationship. And being embarrassed about that certainly alleviates some of his embarrassment about the whole situation with Steve.\n\nThere's a tentative knock on the bedroom door and he jumps back in startlement. He cracks the door open and eyeballs Steve. \"What?\"\n\n\"Um,\" Steve says. \"Do you mind if I grab my toothbrush?\"\n\n\"Yeah.\" Bucky can't help himself. \"But don't—you can... you can sleep up here, I was just being—\"\n\n\"No,\" Steve says. \"We've had a fight and you want me to sleep on the couch and I'll do that.\" Bucky hates him a little for his placid acceptance. Except he realises it covers guilt, because Steve feels guilty even though he has no idea what he did and—\n\nSteve's eyes widen. \"This is because I didn't come upstairs, isn't it?\"\n\nBucky snatches up Steve's toothbrush and shoves it into his hand. \"Get out,\" he shouts. \"Out!\" Steve goes, closing the door behind him.\n\nBucky doesn't move for a long moment as he hears Steve's footsteps descending the stairs, and then he sinks down onto the bed, head in his hands. This was not what he wanted. Having a stupid fight like they were actually married or in a relationship or something wasdefinitely not what he wanted.\nThe atmosphere is decidedly cool the next morning as they set out for their morning jog and Bucky ignores Steve's tentative attempts at conversation. Steve lets him set the route and duration of the run—it turns out to be an hour longer and harder than usual, but Steve's a super soldier, so it's not punishment for him, he knows that—and by the time they get back to the house, Bucky seems to have thawed somewhat.\n\nThey get the bad news shortly after returning that SHIELD hadn't collected the spam email in Cohen's email's trash, so they still have no date more specific than within a two week period. But even with that news, Steve's still kind of glad in a childish kind of way that even though Bucky's annoyed, it's not at him anymore.\n\nHe's more than happy to band together with Bucky bitching about SHIELD if it means Bucky will smile at him again (and he does, wryly, and Steve's heart skips a beat).\n\nTheir run of luck is up. Nothing gleaned from the bugs in Cohen's house or office gives them any further information about the date of the meeting, and they're left waiting for Parenelli's arrival in country instead. \"It'll be okay,\" Sitwell says. \"We have contingencies. And we're working on accessing Cohen's deletion records.\"\n\nContingencies involve stepping up surveillance—but by random SHIELD agents, and not them so as not to risk their cover—which that means there's less work for them to do now that they're on target for the meeting between Cohen and Parenelli; SHIELD takes over monitoring most of the traffic, and their cryptography teams are on standby with the codes Steve deciphered in the event of any new messages coming in. All that remains for Steve and Bucky to do is to show up where needed when the meeting happens.\n\nSteve's kind of bemused how quickly they've gone from fairly intensive mission work to hurry-up-and-wait.\n\nIt gives them a lot more free hours per day, and Steve's finding the whole being a man of leisure thing quite enjoyable. Bucky's a little antsy though, and picks the stupidest fights with Steve with a stir-crazy kind of regularity. It reminds Steve of older days, a century before—of Brooklyn winters and Bucky unable to bear the days he was stuck without work and the weather keeping him in.\n\nSteve thought he must have annoyed Bucky silly back then, with his brittle health, hacking winter coughs and the way Bucky always stayed in with him even when Steve said he didn't have to, letting Steve draw him to pass the time. Except now, the weather's good and they don't to do anything to fill the days but laze about, Bucky lets Steve draw him still, sprawled out in their tiny backyard or on the couch, or on the grass in the park where he dozes in the heat. Sometimes when Bucky's napping and not able to demand to see Steve's work, Steve will flip to the back pages of the sketchbook where he articulates his memories of Bucky's skin against his in pencil lines and charcoal.\n\nIt's eight days after Parenelli arrives in country when something finally happens.\n\nSteve's upstairs at the workstation, revising information for the inevitable reams of paperwork SHIELD will ask for—also known as daydreaming—when Bucky pokes his head around the doorframe and asks if he's coming to bed. \n\n\"I'll be through in a little while,\" Steve says, so distracted by his 'how to woo Bucky' thoughts, that he completely misses the implications of Bucky's comment for entirely too long. Not that it would necessarily mean further sexy adventures, but Bucky wanted to know if he was coming to bed too. With him. At the same time.\n\nOn one level he knows that he shouldn't be using a mission to try and convince Bucky that a) they should have (more) sex because yes, and b) that they should be having (more) sex not because of some mission, but because Steve is in love with Bucky and he's beginning to suspect that he mightn't be the only one with feelings here.\n\nThe way he'd reacted when Steve didn't come upstairs at Jim's retirement dinner, after all, it wasn't just anger that Steve hadn't gone along with the game they were playing to convince Cohen they really were who they said they were. He hadn't just been expecting to hang about upstairs to allow for sufficient time to pass.\n\nHe'd—oh hell, he'd expected Steve to come upstairs and pass the time in exactly the way Steve wants to do with him now. Steve pinches the bridge of his nose. He's angry with himself too. He'd let Cohen talk to him, convinced it was more important, and Cohen had engaged him deliberately then in the smallest of small talk, because he'd seen Bucky leave the table.\n\nSteve was an idiot.\n\nIs an idiot.\n\nAnd he's even more of an idiot for sitting in here now when Bucky's asked him to come to bed. He flicks everything non-essential for monitoring Cohen and to standby and heads through to the bedroom.\n\n\"Y' not coming to bed without a shower,\" Bucky says, smothering a yawn. Steve wonders if he looks pleased Steve hadn't lingered at the workstation. He thinks he does.\n\n\"I need a shower?\" Steve sniffs at himself. Yeah, okay, fair point. \"I... think I'll take a shower.\"\n\nBucky grins, rolls over and tugs the sheet up around his ears. The weather's finally broken in sensational style, and it'll be nice, Steve thinks, to sleep with sheets on and the window closed and not wake up in a sweat from where Bucky's glued to his back, nose tucked against Steve's neck.\n\n(He never thought he'd be sick of hot weather, but there you go. Even after seven decades under the ice, he'd still prefer a New York winter. He's okay with people thinking he's mad for it; he appreciates the cold now in a way he couldn't when winter meant pneumonia or death.)\n\nHot showers though... he turns the hot water up as much as he can bear. Hot showers are like sex and Steve always jerks off in the shower when the water's hot enough to scorch his skin red. He knows Bucky'll comment on how warm he is after, he always does.\n\nThoughts of Bucky while he soaps himself up lead down an entirely predictable path, and he lets himself remember what it was like to fuck him, the feel of being inside his body.\n\nBucky had been so hot for it, so desperate for Steve to fuck him, and Steve wonders what it might be like—\n\nHe wonders for a moment before he braces his legs apart and reaches back and—\n\nIt's not comfortable, not much, not like this, but Steve persists and his dick seems to like it and then—wait, and then—\n\nOh. Oh, okay, that's exactly what it's about, he thinks, and leans against the tiles, water beating down on his shoulders as he fucks himself with his fingers, his ragged gasps drowned under the weight of the water. It doesn't take him long to get off, because he's good at this, at getting himself off in the shower quick enough that no one will notice he's taken more time. And besides, his fingers help.\n\nHe comes, hard and wet against the tiles, before rinsing his hand and sloughing the come away quickly. He's not ashamed, it's not that. He just... he's not keen on leaving a mark.\n\nSteve's thoughts drift back to Bucky as he washes himself, hands lingering on his sensitive dick for just as long as he spends washing his hair. He thinks about Bucky's body pressed against his, and the things Bucky says while they're having sex.\n\nLike Bucky's weird insistence that everything Steve did 'for the mission' didn't make him gay. So he could rub against Bucky 'til he came, have Bucky jack him off or blow him, could fuck Bucky until they both saw stars, but it didn't once impugn on some kind of epic straightness Bucky seems to think Steve has. And okay, he's never looked at (many... any?) guys other than Bucky, and he's sure as hell never had sex with any of them, but he's pretty sure that having lots of enthusiastic sex with Bucky makes him something other than straight, right?\n\nOr is Bucky clinging to the fact that Steve's never really laid a hand on Bucky's dick, so it's all okay? Well, Steve can change that. He's more than happy to lay hands all over Bucky's dick if that's what it takes.\n\nHis mouth suddenly goes dry. What if—\n\nWhat if he blew Bucky? The thought, once it sinks its little claws into Steve's brain, refuses to let go. The thought of wrapping his mouth around Bucky' dick, maybe sliding his fingers into Bucky's body at the same time like he's just done to himself... He could waste himself on another orgasm thinking about it.\n\nInstead he takes a mouthful of the water and spits, before turning the taps off and snagging a towel.\n\nBut Bucky's asleep when Steve finally makes it to bed. Of course he is, Steve thinks, annoyed at himself for taking so long in the shower (nearly a whole two minutes longer than usual) and brushing his teeth, but never annoyed at Bucky for being tired.\n\nFor the past eight days they've been getting up at midnight to spend hours camped out near where Cohen's meeting with Parenelli is going to be, on the off chance that it would turn out to be the night of the meet; between that and attempting to maintain their normal social life, Bucky had been almost asleep at the dinner table tonight at one of their few meals home alone.\n\nEven asleep Bucky senses the shift of the mattress when Steve slips between the sheets, cuddling up to him, a familiar warm weight against his side. Steve's surprised by how used to this he's become; as surprised as he was when Bucky pressed in close in the first place and slept through the night—and every night with Steve since—without nightmare.\n\nHe knows how bad it can be for Bucky, because he saw it too often when Bucky was still locked up in SHIELD custody.\n\nThat Bucky sleeps through the night now has everything to do with personal safety, and the fact that Bucky feels safe with him like this catches up Steve's breath in his throat. If there's only one thing that has ever been a truth, it's how much Steve loves him and would do anything to protect him, and this from Bucky now just makes Steve love him all the more.\n\nSteve gently cards his fingers through Bucky's hair, slides his hand down Bucky's neck and over and down his back. Bucky makes a sleepy noise of pleasure, his fingers tightening a moment on Steve's side. Steve's sure—almost sure—Bucky's still asleep, but he can't help repeating the gesture and gets the same response, this time Bucky turning his face in against Steve's shoulder, his lips brushing against Steve's skin. He's still asleep though, and regretfully Steve leaves him be.\n\nHe can't sleep himself, though, but if he can lie there with Bucky tangled around him, with his super soldier constitution he won't regret still being awake come midnight. Then after ten or maybe twenty minutes he feels Bucky shift restlessly.\n\nIt's a dream, not a nightmare, and Steve's gone through this before with him, except—\n\nThe lights are out and there's no excuses this time. Steve bites down on his lip as Bucky sluggishly rolls his hips again and again.\n\nHe gently shakes Bucky's shoulder. \"Buck,\" he says. \"Hey, wake up.\" He doesn't know what he's going to do when Bucky's awake, all he knows is that whatever he does, he's doing it with Bucky alert. He's certainly not going to stiff upper lip through Bucky having dream sex with his leg.\n\n\"Huh?\" Bucky says sleepily. There's a long pause and neither says anything—as Steve waits for Bucky's brain to catch up—and then Bucky's swearing and apologising softly as he tries to push away.\n\n\"No,\" Steve whispers. \"No, it's okay, c'mere, let me just—\" He searches out Bucky's mouth in the dark and when he eventually finds his mouth makes sure there's no mistaking the intent of the kiss. Bucky relaxes immediately, and Steve rolls over him, framing Bucky's face with his hands and deepening the kiss.\n\nBucky seems to go with him gladly, and then Steve knows for sure as he feels Bucky's hands sliding over his sides and then up over his back to his shoulders. He's lightheaded from the rush of blood and knows Bucky will be able to feel the thick weight of Steve's dick alongside his own.\n\nSteve kisses Bucky on the mouth and the jaw, then on the throat and collarbone. \"Steve—\" Bucky says uncertainly, but Steve shushes him. He slides down Bucky's body, leaving a trail of kisses in his wake, shrugging the sheet from his shoulders.\n\n\"Steve,\" Bucky repeats urgently.\n\n\"It's okay,\" Steve says against Bucky's skin and he smiles when he feels Bucky's hand on the back of his neck, fingers scritching through the short hairs at his nape. But he doesn't push Steve away, even as Steve presses a wet kiss to the jut of Bucky’s hipbone, and nuzzles down the crease of Bucky's thigh, feeling the nudge of Bucky’s hardened dick against his cheek, and the prickle of Bucky's body hair against his skin.\n\nHe wishes he could put the light on and see Bucky, but then the excuses would come into play, and he wants to leave Bucky with no doubt that this is something he wants to do, that this isn't about the mission, or Cohen, or any of the things that have consumed their lives since Steve got Bucky back.\n\nThis is about Steve doing something to Bucky he wants to do and, he hopes, Bucky letting him because he wants it too.\n\nNo, he can't put the light on; his night vision is perhaps better than most with the moonlight in the window, he has his hands and his mouth and he thinks touch will be more than adequate to replace what he can't see properly this time.\n\nHe curls his fingers around the shaft of Bucky's dick—hears Bucky's sharp inhalation, like he hadn't really thought that they might.. and when he takes the head into his mouth (hot and slick and heavy against his tongue, the taste sharp) Bucky says his name for a third time, on the back of a curse that to Steve's ears sounded more like a blessing.\n\nSteve's tentative and Bucky's patient. He figures out how to keep his teeth out of the way (unless he wants to use them, so, so gentle and teasing) and how best to use his tongue, and what makes Bucky cry out and jerk up against his mouth and tighten his fingers against Steve's skin. When his jaw grows tired and he uses his hand instead, Bucky still makes those pleased moans; when Steve licks and sucks at the head of Bucky's dick, damp with saliva and wet with precome, it's his name on Bucky's lips, again and again.\n\nHis tone turns desperate and rough as Steve sucks him down again, his hips jerking against Steve's mouth. \"Steve,\" Bucky gasps, \"fuck, Steve, I'm gonna—\"\n\nSteve grips Bucky's hips, shifting to take him as deep in his mouth as he can; feels Bucky's fingers tangle in his hair and god, he wishes he could see what Bucky looks like, arching under his mouth as he comes. Steve gags a little and swallows convulsively before he eventually, slowly slides his mouth off Bucky's dick in a way that makes him tighten his grip on Steve's hair. (Steve can't help a few playful licks that make him writhe and gasp, and he grins, pleased.)\n\nHe slithers back up Bucky's body, tugging the sheets back up over them both. In the gloom he can see Bucky's blissed out expression in the way he turns to Steve and curls an arm around the back of Steve's neck. Steve licks across Bucky's bottom lip then kisses him, deep and warm.\n\nWhen he pulls back, Bucky gives him a dazed look. \"D'you want me to—\"\n\n\"It's not a favour you have to return, Buck,\" Steve says fondly, pressing his mouth against Bucky's temple. He'd rather curl around Bucky like this than have Bucky think he's obliged. Bucky gives him a wide-eyed look of surprise and Steve kisses his cheek and then his lips. \"I wanted to get you off.\"\n\n\"Oh,\" Bucky says.\n\n\"I liked getting you off.\" Steve bites his lip because he's not sure if that's going too far. If that isn't, then saying, \"And I wanted to make you come without an audience,\" has to be.\n\nBucky stares at him for a long moment, gaze scorching hot, before he shifts, flipping them over. Steve loves the weight of Bucky over him. Bucky opens his mouth to say something, before he's interrupted by the rude buzz of his communicator on the bedside drawers. He looks annoyed (and Steve can relate, because he desperately wants to know what Bucky has to say) and when it stops, he opens his mouth to speak again. This time it interrupts him with the high alert tone and he swears, rolling off Steve and snatching up the communicator.\n\n\"Fuck,\" he says then. \"Fuck. Cohen's meeting is tonight.\" He's over to the wardrobe and tugging out his uniform before Steve's even out of bed.\n\nSteve rummages for his own uniform, while trying to haul his mind back onto the mission. It's hard for him when he's still lit up under the skin, and he glances sideways at Bucky, who's pulling on his all black one that doesn't remind Steve so much of the Winter Soldier but still makes Steve a little bit light-headed because of the way it clings to Bucky's legs and ass. \"Cohen's pushed the meeting ahead. It's going down in two hours.\"\n\n\"Two hours?\" Steve says, alarmed. The mood is completely shattered. \"Same location?\" They wouldn't be able to make it to the initial location in two hours and get it prepped in time for the meeting, before anyone else arrived.\n\n\"Nope, down near the waterfront. There's a warehouse. SHIELD will be here in eight minutes for pick up.\" There's nothing at all subtle about the way Bucky's arming up and he can't help his shiver as Bucky slips a knife into the sheath at the small of his back.\n\n\n\nIt's been eight minutes since Bucky's radio went dark and ten minutes since he was set on by Parenelli's thugs. Steve curses every minute wasted, waiting for Bucky to come back online, as he sprints to the location of Bucky's GPS, the light on the screen of his handset flashing and ominously still.\n\nEven though he knows it's only psychosomatic, he presses the heel of his hand to his side, against the phantom cramp that catches his breath up in his chest.\n\n\"A diversion,\" Bucky had said.\n\n\"I'll be fine,\" Bucky had said.\n\n\"Geez, Steve, you worry like an old mother hen,\" Bucky had said.\n\nWhen the earpiece had gone offline, Bucky had been taunting the thugs, and Steve could imagine the way he'd be bouncing about like a prize fighter, daring them to come at him, more Bucky Barnes circa 1939 than anything Steve had seen since.\n\nBut then the connection had gone offline, and hadn't come back, and Steve gave Bucky as long as he could bear to before panicking—no, not panicking, because Bucky was... well, Bucky was Bucky and he was something else too, but even as Bucky he'd been able to look after himself. He might have gone in there to distract the guards, unarmed, at the last minute—\"No use provoking them,\" he'd said, \"and the longer we can keep Cohen and Parenelli in the dark the better.\"—knowing his unmarked outfit would make him look less like a government agent and more like an interested third party. But truth be told, Steve was a little scared of that something else that was in Bucky, because they needed the thugs alive and Steve had seen Bucky with that cold, hard look in his eye more than once when his back was up against the wall.\n\nHe's worried about the wrong things, he realises, as he pelts around the corner of the warehouse adjoining the one where the SHIELD agents were taking down Parenelli and Cohen and all their little arms dealing friends. There's another group of officials—a mix of agents and local LEOs—in the car lot arresting a cadre of thugs who've seen better days. There's no sign of Bucky, though, where the GPS says he should be waiting.\n\nSteve snags the sleeve of one of the agents, for the life of him unable to remember her name, but she hasn't seen Bucky. \"We caught these ones when they tried to run,\" she says. \"Agent Barnes wasn't with them.\" Yet the GPS light says he's right here, and it's the personal tracker Steve had acquired for Bucky per his request, not long after he came back to himself. Bucky had it embedded in his dog tags and Steve thought it a bad idea, and he thinks it again now, when he sees the broken chain hanging from a thug's pocket.\n\nBucky's always been his greatest weakness, though, and his brain goes to white noise. \"Captain!\" someone shouts. \"Captain!\" And he realises he's got the man slammed up against the wall, hands fisted in the his shirt, knuckles jammed so hard into the man's throat the guy is starting to turn blue as Steve screams \"Where is he? Where is he?\" over and over.\n\nThey peel him off the guy and he snatches the dog tags from the man's pocket. There's blood on the chain and it's only the thought of Bucky being hurt that stops him from putting even more blood on it as he beats the thug around the parking lot.\n\n\"He's in there,\" the thug croaks, clearly terrified of Captain America in his avenging angel mode, pointing a shaking hand at the warehouse. Steve doesn't need to be told twice.\n\nThe warehouse is open and empty and reeks of engine oil. Not far from the door there's a lump on the floor. Bucky. He skids to a stop beside him and drops to his knees.\n\nThere's a lot of blood. \"...Buck?\"\n\nHe sees Bucky twitch a little, draw in on himself like a crab and mutter thickly to the bloody concrete, \"S'okay, m'okay, Steve... y'know, had 'em on the ropes 'n all that,\" and Steve shudders and breathes out, hands moving gingerly as he reaches for him.\n\nSteve helps him roll over onto his back, cradling Bucky's head in his lap. He runs his gaze over Bucky's body to take stock of any injuries and inhales sharply. Bucky glances down and his eyes flicker with surprise. \"Oh,\" he says woozily, \"that's where that is.\" His knife is embedded in the meat of his thigh, the jagged wound still oozing blood.\n\n\"Bucky,\" Steve says stupidly. \"That's your knife.\" It's a dumb thing to say, but he remembers Bucky once boasting that no one had ever managed to take his knife from him. And that's his knife.\n\n\"Hahahaow,\" Bucky says, pressing a hand to his gut, the other hovering over the handle of the blade. \"Thanks, Captain Obvious. I fell on it, 'fore you ask. No one took it off me.\" He scowls at Steve's but the scowl is marred by his wince of pain.\n\n\"What possessed you to take all of them on?\"\n\n\"Well, there weren't that many of 'em to start with,\" Bucky says, \"but then the other six showed up. It's been a while an' I'm a little rusty on large groups.\"\n\n\"We'll have to make sure that gets added to your training then, hey?\"\n\n\"We'll take it from here, sir.\" Steve's surprised when he looks up to see three paramedics have followed him into the warehouse, he's been so focused on Bucky.\n\nThe second one says, \"They've arrested Parenelli and Cohen, if you wanted to go out and—\"\n\n\"No,\" Steve says immediately, seeing the way Bucky's eyes have fluttered shut. \"I'll stay here with Buck—with Agent Barnes.\"\n\nBucky's put on a gurney and loaded into an ambulance. They let Steve climb in behind him without a word, pulling out and heading for the SHIELD Medical Centre. Sitwell calls him just as the ambulance arrives at the medical centre, asking after Bucky.\n\n\"Yeah, he'll be okay. He's a bit beaten up, but there's nothing serious.\"\n\n\"He's done well,\" Sitwell says. \"I'll be recommending him, after this.\" There's a pause and then he says quietly, seriously, \"And you didn't hear it from me, but someone really dropped the ball on his safety, which I'll be investigating thoroughly.\"\n\n\"What? You mean—\"\n\n\"Just because Director Fury signs off on a reclaimed agent's status, doesn't necessarily mean that the rest of the organisation will accept it. I wasn't in charge of organising the takedown part of this operation, but if I was, rest assured you would never have been left in a position where you were unable to provide support to Agent Barnes when needed. I'll get to the bottom of this and guaranteed there will be some thorough disciplinary action taken. Give James my best.\" He ends the call and his hard tone leaves Steve no doubt he'll sort it out.\n\nIt angers Steve that there could still be people who distrusted Bucky's loyalty, and that such distrust could result in a risk to his life like this. Steve might have blinkers when it comes to Bucky, but even he knows that Fury would never have signed off Bucky for field work if there was any doubt whatsoever over his loyalty.\n\nIt's an hour before he's allowed through to see Bucky, who's sitting on the edge of a hospital bed, waiting for him. At first appearance, the worst of his injuries could either be the heavy bandages around his thigh, or the splint for two of his fingers and his wrist. But bruising has started to come up on his face and there's a few butterfly bandages holding his eyebrow and cheek together, so Steve peeks around the door to make sure he's not going to be sprung before he picks up Bucky’s chart.\n\n\"So how do you feel?\" he asks, flicking through the pages. He's surprised how simplistic SHIELD's medical charts for superhumans are and has no problem deciphering the doctor's scribble.\n\n\"I feel fine,\" Bucky says, cranky like he always gets when he's injured. Steve remembers that tone well. He might have been the one copping a pounding for being a little guy unable to back down from a fight, but Bucky took his fair share of scrapes defending him. Steve used to think it was his guilt that Bucky was angry about, because he always felt bad when Bucky got hurt breaking up a fight he'd started. But after they'd both gone to war he'd learned the hard way that it wasn't him; it was just how Bucky was when he was hurting. \n\n\"Uh... huh,\" Steve says, running down the short list of injuries. Cuts, abrasions and contusions, the knife wound is deep but clean, his fingers are broken and his wrist sprained, and he has a concussion leading to 'some amnesia about the event'. \"Some amnesia?\"\n\n\"I've got a pretty big lump on my head, Doctor Steve.\" Bucky's refuge is in sarcasm now. \"You try getting whacked on the head and remembering what you had for breakfast.\" There's no dig about super soldier Steve not having to worry about that happening, so Steve knows it's not personal and smiles fondly. \n\n\"You had toast,\" Steve says, hanging the chart back up on the end of Bucky's bed just as the doctor opens the door.\n\n\"I always have toast,\" Bucky mutters.\n\nBucky mightn't have the super serum Steve's got in his veins, but he's got a pretty decent knock-off version so even with the concussion he's not kept in recovery for long. \"You won't heal immediately, or in the next couple of days like Captain Rogers would,\" says the doctor, \"but after a few weeks you should be back to mission-ready status. There may be some minor memory issues for up to 24 hours either side of the event, due to the effects of these injuries on the existing damage to your brain—\"\n\n\"What?\" Steve says. \"Could something like this have any affect on the... on what happened with his brain with the whole... brainwashing thing?\"\n\n\"I treated Agent Barnes after his retrieval, sir, and I can assure you that this nature of concussion will have no long term effect on his psyche.\" \n\nWhen Bucky clears his throat pointedly and says, \"If you've finished talking about me like I'm not here, I think I'd like to go home now,\" Steve can't help but glance to the doctor and Bucky makes a huffy noise of annoyance. The doctor nods anyway, passing over a treatment and therapy schedule. Predictably, Bucky refuses the wheelchair, hobbling to the elevator and then to the car under his own steam.\n\nHe doesn't get out though, when Steve pulls the car up to the entry to Avengers Tower in the underground car park. Instead his shoulders sag a little and he looks... disappointed?\n\n\"What?\" Steve says, holding the car door open for him. He thinks Bucky might appreciate the gentlemanly gesture. He doesn't. He just sighs and if anything his shoulders sag further. It's all a little theatrical.\n\n\"No, really. What's wrong?\" Steve asks as Bucky makes no attempt to climb out.\n\nThe look Bucky gives him borders on mournful, but Steve thinks it might not be entirely put on. \"This wasn't what I meant,\" Bucky says.\n\n\"I don't—\"\n\n\"When I said 'home'. My home. Not—I don't live here, I've just been staying with you.\"\n\nSteve doesn't understand. \"Bucky, don't be silly. Your home is here with me. It's always been with me, you know that. You're welcome no matter where I am. Come on, let me help you inside. You're just a little dopey from the drugs and coming off a long mission...\" He trails off. \"Oh. Oh.\" Because there's a house Bucky's been living in for months, a place Bucky might not have chosen, but he decorated it and filled it with the things he liked. Bucky—even before the war, he hadn't really had a home.\n\nWhen Steve had been pulled in for this mission it had really struck him, on entering the house, how much it had felt like a home. Bucky's home. He didn't doubt it was where Bucky lived; there was nothing about it that made it feel like it was a farce, or pretence, just another link in his cover.\n\n\"Buck,\" he says gently, \"you know they're not going to let you keep the place.\"\n\n\"Why not?\" Bucky says mulishly, crossing his arms across his chest. \"Why can't I have it? I got enough cash in that account they gave me that I could buy it in a heartbeat.\" Steve has an account too. Backpay from the Army, they told him, since he hadn't actually died. Steve suspected it had been a little more complicated than that, but at the time hadn't felt up to arguing. It was enough trying to accept that money came on little plastic cards now, and on a computer money was little more than changing numbers.\n\n\"This is true, but... these people—the neighbours—they don't know who you are and you living in the middle of them is dangerous. Our lifestyle is dangerous,\" he says rather idiotically, given that Bucky's covered in wounds and swathed in bandages.\n\n\"Please,\" Bucky says. \"Can we just go back there? If only for tonight? Now that everything's done with we don't have to worry about dropping cover or the fact that an arms dealer lives in the neighbourhood anymore. We gotta go get our stuff anyway, when SHIELD... when they move me—us—out of there, and I'd just like to spend one last night in my place before it's not mine anymore.\"\n\n\"Sure,\" Steve says softly, touched by the sadness in Bucky's tone. If he's honest with himself, he wishes Bucky could keep the house, not just because he wants it and Steve would give Bucky the world if he could, but for his own selfish reasons too.\n\nThere's an empty car park in the street right out the front of their house and Steve's glad of it, because Bucky's exhausted, leaning reluctantly but heavily on Steve's arm as he helps him inside.\n\nAs Steve pushes the door shut behind them, he can't help but press a gentle kiss against Bucky's temple. When Bucky looks at him with a puzzled expression, he says, \"What?\" in his most innocent voice.\n\nBucky shakes his head. \"Nothing. I'm tired,\" he says, \"I must just be tired,\" slumping down in one of the kitchen chairs, head in his metal hand (the camouflage is gone now and Steve... in all honesty, he kind of misses it). \"I might head upstairs in a minute for a lie down.\"\n\n\"Of course,\" Steve says. He hesitates a moment—wants to say something, anything—before he heads upstairs himself, knowing what he's going to find. And looking at the bed still all mussed from the previous night, he doesn't have to torture himself to know the scent of sex still clings to the disheveled sheets. He wonders if Bucky even remembers what happened. His memory of the main event of the night before is coming up spotty because of the hit on his head, and the doctor said the amnesia could affect more than just that. Could his memory of something that happened when he'd been half asleep less than two hours before be gone too?\n\nHe sighs. Maybe Bucky won't remember. Just like maybe Steve had been deluding himself when he'd thought that Bucky might have had feelings for him too.\n\n(He strips the bed and dumps the sheets in the hamper and tries to let his mind clear as he remakes the bed with nice, tight hospital corners.)\n\n\n\nWorkers from SHIELD arrive early the next morning to empty the house, drawing curious and concerned looks from the neighbours.\n\n\"Oh my god, James!\" Jan exclaims when she sees him hobble out of the house, Steve at his side, all gentle hands. \"What happened to you? What's going on? Are you moving?\"\n\nBucky doesn't even know what to say to her, looking helplessly at Steve for an assist. SHIELD hadn't included any information that was to be passed on to the neighbours—since he and Steve weren't even meant to be there—and clearly news hadn't spread about Cohen's arrest. Bucky knows Cohen's house will shortly be ransacked and packed up too. It doesn't make Bucky feel any better about what's happening to his own place.\n\n\"He was in a car accident, Jan,\" Steve lies gently. \"And I've had an update from work and they've requested an emergency relocation.\" Then Steve reaches out and tucks Bucky's hair behind his ear and gives him a warm look that makes Bucky shiver right down to his toes. \"It's just all happened at the same time, unfortunately.\"\n\n\"Oh no,\" Jan says, her eyes welling up. \"Will you at least be around for tonight to say goodbye to everyone? We could organise a gathering.\"\n\nSteve looks to Bucky and Bucky shakes his head, not doubting in the slightest that Jan would get on the phone tree the moment she left and a picnic would be organised in half an hour flat—he's seen it happen before. But he feels like shit and given that they're packing up his house even as they speak, he can't stomach sticking around and trying to say goodbye to these people. He knows it's cowardly, but that's how it is. How he is. A coward.\n\n\"Do you have a forwarding address?\" Jan asks and Bucky turns away as Steve gives her one—he doesn't know what address it is, but it's not Bucky's either way. She takes Bucky's hand—camouflaged again—and kisses his cheek, then hugs Steve before she goes, and he suspects that even if a gathering isn't organised for that night, the phone tree will be in action to notify everyone of their departure anyway.\n\nHe feels Steve's fingers curl around his elbow. \"You're moping,\" Steve leans in and says, his lips brushing against Bucky's cheek. \"I'll help find a special place just for you, I promise.\"\n\n\"Yeah,\" Bucky says shortly. \"Come on, we have to go to the debriefing.\"\n\nBucky's energy is running low by the time they make it to the SHIELD offices, and he promptly dozes through most of the debriefing, his pain pills making him sleepy. It's only when Steve nudges him awake that he realises Sitwell's stopped speaking at the front of the room and the other agents involved in the case are noisily filing out.\n\nThen Sitwell's standing in front of him. \"James, how are you feeling?\" he asks. \"I noticed you drifted off for a bit there.\" He grins good naturedly. \"Got a bit boring?\"\n\n\"Y'know,\" Bucky says, \"you do tend to go on a bit.\"\n\nSitwell's grin widens, because Bucky used to complain that there was such a thing as too much silence on his ear piece when he was out doing reconnaissance. Then Sitwell turns to Steve. \"The situation has been resolved.\"\n\nSteve straightens. \"Good,\" he says shortly. \"I assume it won't be an issue again going forward?\"\n\nSitwell shakes his head and Bucky looks between them, mystified. \"What happened?\" he asks.\n\n\"Nothing you need to worry about,\" Steve says, just as Sitwell says, \"We had a situation with agents acting outside their parametres. It's been resolved. Thoroughly.\"\n\nBucky raises a brow at Steve because clearly it's something to do with him and Steve obviously thinks it's for the best that Bucky be kept in the dark, whereas Sitwell is at least being honest. Sitwell glances at Steve and Steve says, \"You won't be left without back up like that again.\"\n\n\"Of course not,\" Bucky says mildly.\n\nIt'd be a lie to say Bucky's surprised. He's the one who's had to deal face to face with his fellow SHIELD agents after his custody ended. He's had the threats of being put down the moment it looked like he was going off mission. He never took the threats very seriously, because there was no chance any of them had the skills to do it.\n\nFury gives him two weeks leave; it's standard, he tells Bucky, for an undercover mission of that duration. Bucky knows it has to do with immersion in his mission identity and recovery, but he doesn't want time off to spin his wheels. He'd rather go straight into something new, because he knows himself, knows that he's just going to relive every moment of his mission once Steve arrived.\n\nEvery touch, every kiss, every—\n\nHe thinks there might be something missing though; he knows the feeling of his own brain when something's missing and he's sure the beating he got from Parenelli's thugs has something to do with it. Bucky's missing bits and pieces of that too, but it's the hours before they got the call about the meeting that bother Bucky the most. He's—he thinks he remembers Steve's mouth on his skin, but it's just like after images of a dream in his memory. He wants to remember—\n\nFury dismisses him the second time he zones out with an annoyed sigh.\n\n\"Make sure you go by Supply to ensure any requisitions from the mission are signed off,\" Coulson says, as Bucky leaves Fury's office. \"Captain Rogers will meet you there.\"\n\n\"Thanks, Uncle Phil,\" Bucky mutters as he hobbles past. He thinks maybe he can hear Coulson's teeth grinding. Small pleasures.\n\nBucky makes his slow way to the Supply office where Steve is waiting, idly leafing through an old Guns &amp; Ammo magazine. \"She says you've just got to sign off on the requisitions,\" Steve says helpfully.\n\nBucky's glad Steve has done all the talking; early on in the mission Bucky had a run in with this Supply office over the amount he'd spent on furnishing his house and things had been tense since. They'll be happy to get the refund on his belongings recycled back into the SHIELD expense account.\n\nBut the SHIELD lackey behind the desk, Agent Burr, isn't one Bucky's encountered before and he flashes her a charming smile. She looks a little flustered in response. It's cute. It makes him feel a little better. \"If you could please sign here and here,\" she says, indicating on the paperwork. \"And that's it done, thank you.\"\n\n\"Wait,\" Steve says as they turn to leave. \"What about the rings?\" Bucky watches as Steve carefully, gently slides the ring off his finger and holds it out to Agent Burr.\n\nShe looks over the mission requisition paperwork and Bucky holds his breath. \"We don't have any record of wedding bands—oh wait, there's a note here that says Agent Barnes is dealing with it?\" The agent leans to look past Steve. \"It doesn't appear you've placed a claim for expenses, sir,\" she says to Bucky. \"Were you looking at returning the items to the point of sale?\"\n\n\"Something like that,\" Bucky mumbles, rubbing his thumb against the band on his finger, the synthetic nerve endings embedded in the metal of his thumb detecting the ridge of metal and his brain filling in the rest. He'd thought maybe he'd just keep it. Steve's too, if he didn't want it. The irritatingly romantic part of him thought he might string it on the chain with his official dogtags, so he wouldn't lose it, but that made about as much sense for a covert assassin as the polished steel of the first useless arm SHIELD had designed for him.\n\nYou'd never survive for long trying to hide away in the dark if you covered yourself in shiny stuff.\n\nInstead, he'd thought of the safety deposit box he has with a few keepsakes he'd never been able to part with. A wedding band from his fake marriage to the best friend he's been stupid in love with all his life seems like a prime item for deposit.\n\n\"You'd best take this,\" Agent Burr says, holding out the ring to Bucky and he limps forward to take it, not missing the weird, searching way Steve looks at him, or the smallest flinch he makes as she drops it into Bucky's hand, like he might want to reach out and take it himself.\n\nBucky closes his hand around the band and he imagines it clinking softly against the ring still on his own finger. Steve's not looking at him anymore, just looking down at the ground with no expression and Bucky desperately wonders what he's thinking.\n\n\"Is everything okay?\" he asks Steve, knocking their shoulders together as they leave Supply, slipping Steve's wedding band into his pocket.\n\nHe reluctantly slides his own off as Steve says, \"Huh?\" and \"No, everything is fine. I just didn't realise you'd taken care of the rings, is all.\"\n\n\"Yeah.\" Bucky shrugged. \"Seemed easier.\" Easier and more personal, because this was Steve and even if it meant nothing, Bucky liked the idea of picking out this obvious symbol himself. He'll never mention that he spent an hour at the jewellers agonising over his choice because that's no one's business but his own. \"Figured since I know my ring size and I know yours, it'd make more sense—\"\n\n\"How do you know my ring size?\" Steve's hand goes out and supports him under the elbow as they have to dodge someone hurrying down the corridor in the opposite direction and he doesn't let go after. It's nice.\n\n\"Dunno,\" Bucky says vaguely. \"I think it's just something I've always known.\" He's not about to tell Steve that his ring size is similar to the size of the bore of a 10 gauge shotgun, and he could tell that just from looking.\n\nSteve just laughs fondly. \"C'mon, let's go get some lunch.\"\nAs Steve's not solely employed as a SHIELD field agent and he's got his Captain America duties to attend to he doesn't have the kind of leave Bucky has, so Bucky doesn't see Steve at all after he's moved into some SHIELD-sanctioned apartment that evening after his medical follow up.\n\nBucky doesn't see Steve the next day, or the day after that, and finds himself at ends for things to do. He's come into leave at a time when anyone at all he might want to spend time with is off on their own missions. Natasha is somewhere classified as are Clint and Sam, and Bucky's not about to drop in on Tony Stark for some social time. Bruce he hardly knows and Thor is off doing whatever it is that alien thunder gods do, Steve is Captain America-ing and even Sitwell has been rotated onto a new mission (something to do with money laundering for child prostitute rings via child care centres and Bucky wishes him all the luck with that).\n\nWhen Bucky calls Sitwell to complain how bored he is, Sitwell tells him to take up a hobby, to get out and socialise. Bucky scoffs when he suggests a cooking class, laughs when he suggests the SHIELD book club, and flat out hangs up on him when he suggests taking up yoga.\n\nThe longer things go on though, the worse Bucky becomes. He's run out of the SHIELD office by Coulson when he pops in just to see if there's anything he can help out with, and told that if he shows his face again it'll be a month of leave and Bucky even believes he'd do it. He has to find some cheap and nasty way of getting back at Bucky for the Uncle Phil jibe.\n\nBucky's lonely, but that's not the real problem. Or the only problem, anyway. Without anything to fill his days and help him fall into an exhausted sleep, his nightmares have returned in force, just as insidious and twice as disturbing.\n\nThere's a bottle of whiskey on the table and he doesn't even think twice about reaching for it. He might have been dumped in some shitty apartment with his belongings from the house—not even the things he chose to furnish the house with, just his clothes and a few small items the SHIELD staff had deemed 'personal'—but at least they restock the fridge and the liquor cabinet.\n\nDrinking isn't the best way to fill his days, but given the lack of distraction, knowing something isn't a good idea doesn't stop him from climbing into the bottom of a bottle for ten days straight to compensate for a lack of sleep. Because without the self-medicated oblivion of booze, every time he lies down to sleep, he's tormented over and over by nightmares he'd never had sharing a bed with Steve.\n\nThe part of his brain that is mostly still functioning tells him he should head into SHIELD and see if they can help him, but instead he ends up on an entirely different doorstep.\n\n\"Bucky?\" Steve says, staring at him in disbelief. \"You look terrible.\"\n\n\"Oh good,\" Bucky says sarcastically. \"I'd hate to look great when I feel this shit.\"\n\n\"You're drunk.\"\n\n\"Yes!\" Bucky raises his hands. \"Give the man a medal!\"\n\nSteve sighs. \"You want to come in?\"\n\n\"Yes,\" and Bucky barely waits for Steve to step aside, brushing past him and into Steve's apartment. It has a comfortable, lived in feel, the way the shitty little apartment SHIELD gave Bucky doesn't. \"You said you were going to help me find a place to live,\" he says. Tries not to aim for accusing with his tone and probably fails dismally, given the way Steve winces.\n\n\"I know,\" Steve says apologetically. \"I haven't had much time—\"\n\n\"It's okay, I've had time. Two weeks, nearly. Of time. In some run down little shithole your SHIELD buddies gave me.\" Bucky slumps down on the couch rubbing at his leg. There's still an ache where he accidentally knifed himself, and the doctor had needed to order him to keep to a stricter physio routine since he kept overdoing it in an attempt to wear himself out. \"I have no hot water. Or heat, half the time. It's great. Just... great.\"\n\nHe looks up and Steve is still standing there staring at him. And okay, Bucky knows he's drunk, but it's rude to stare. Eventually Steve sinks down on the couch next to Bucky, and Bucky's suddenly hyper-aware of how close Steve is, of the warmth he imagines he can feel radiating from Steve's body, of the scent of his soap. \n\n\"Are you okay?\" Steve asks. \"You know, apart from the terrible apartment and no hot water or heat... Buck, are you okay?\"\n\nThe genuine concern in his tone heads off another drunken retort and, momentum broken, Bucky sags a little. \"I'm... I guess I haven't been sleeping so good,\" he says ruefully, rubbing at the back of his neck. \"Among other things.\"\n\nSteve inches closer. \"Nightmares?\"\n\nBucky sighs, annoyed, and nods. \"Didn't have one of 'em the whole time we were undercover, then the moment the case is over I'm back to the same ol' problems.\" It's not true that he didn't have one; the night he'd made Steve sleep on the couch it was like the good old days again, but he doesn't want to admit to that. How could he? So, it turns out I don't have nightmares when I have you pressed up against me, or, There's something about you being around that makes me feel safe when I'm asleep.\n\nNo. God, no.\n\nSteve shifts on the couch next to him and the movement brings him even closer and Bucky's just... he's too drunk for this and Steve's too close. His head swims at Steve's proximity and he could lean over and kiss him, he could, if that's what they did.\n\nBut they don't, it was just for the mission. And the irony of Bucky's life now is that when his missions are done there is no one to scrub away his memories anymore, something he'd hated but had always taken the nightmares away. But now Bucky can still remember exactly what Steve tastes like and thinks about the smell of Steve's skin to distract himself when he wakes from his nightmares, wet with sweat and stinking of fear.\n\n\"Would you like to stay here with me tonight?\" Steve asks gently. One arm is now across the back of the couch behind Bucky and he lightly touches Bucky's arm, his fingers warm against Bucky's skin.\n\nYes. Bucky closes his eyes. \"No,\" he says, \"I shouldn't, it's a bad idea,\" even though he knows it would work, even though he knows, in all honesty, that it's exactly why he came here.\n\n\"No, I think you should.\" Steve leans in even closer and all Bucky can focus on are his blue, blue eyes; the care and intensity in his gaze is almost hypnotic. \"I want you to. I know you never had any nightmares when you slept with me.\"\n\nBucky blinks. Oh, he's just too clever by half. \"Shut up.\"\n\n\"Make me.\"\n\n\"Steve—\"\n\n\"C'mon, Buck, tell me why you think it would be a bad idea,\" Steve cajoles softly.\n\nHe's stroking Bucky's arm now and Bucky feels like he's been narrowed down to that one point where Steve's touching him. Steve, who is everything Bucky ever remembered, even when he could remember nothing. \"Steve,\" Bucky repeats and he feels like the air has been sucked from his lungs. \"Steve, I'm—\" He can't. He can't say it. How can he throw away the one relationship that's kept on keeping on no matter how many times he's fucked up?\n\nJust because they had sex for the sake of the mission doesn't mean a goddamned thing. It was only ever for the mission—\n\n\"Buck?\"\n\nHe makes a soft noise as he sinks back into the soft couch cushions, pained because Steve is too close and he can't hold out any longer. Not when all his protective walls are down from the alcohol in his veins. Not like he could hold out when it comes to Steve anyway. And again, \"Steve,\" he says, squeezing his eyes closed so he doesn't have to see the look on Steve's face, \"I'm in love with you. I think I've always been in love with you.\"\n\nThe words are difficult and foreign on his tongue, but no less true for it. There's no response from Steve, his fingers stilled on Bucky's arm.\n\nMaybe if he keeps his eyes closed Steve will think he's fallen asleep. Maybe if Steve thinks he's fallen asleep they can pretend this never happened. That it was only the booze and loneliness talking.\n\nOr maybe Steve'll say his name and he'll open his eyes, because what else is he meant to do when Steve says his name like that? So he sighs and opens his eyes. \"And that's why it would be a bad idea,\" Bucky says, looking down at his hands twisted together in his lap, \"I'm sorry, I never shoulda said anything.\"\n\n\"No,\" Steve says helplessly. \"No, you should have--you should have said something sooner. Or I should've. I'm an idiot, Buck, for not saying anything to you myself.\"\n\n\"What?\" Bucky says dumbly, raising his gaze to Steve's face. \n\nBut Steve's clearly not keen on repeating himself and instead he leans in, closes that small distance between them and he—\n\nSteve frames Bucky's face in both hands and kisses him. Steve's mouth against his, the way he slowly coaxes Bucky's lips to part, shouldn't taste so familiar, Bucky thinks. It should be new, because this is something new, but then... if Steve's not jerking him around, they both would have had these same feelings the last time they kissed. And the times before that.\n\nSteve kisses him on the mouth and the jaw and the throat and—\n\n\"Did we do this?\" Bucky asks, shuddering as Steve's hand slowly slides up his side, rucking up his shirt as he goes. He should touch Steve. He really should. It's stupid that he's nervous doing it now, when he'd had no problem before. \"The night of Cohen's takedown, did we—\"\n\nSteve pulls back a moment, and his mouth is red and wet and Bucky can't help reaching up to pull him back in, his metal hand cupped around the back of his neck, the other with the fingers curled over his waistband. He can feel the way Steve's stomach moves against the back of his fingers as he breathes heavily. Bucky bites at Steve's lower lip and then runs his tongue across it soothingly.\n\n\"We did,\" Steve says against Bucky's mouth and Bucky can feel his smile. Can see it too when he pulls back, wry and sweet. \"Thought you might have got knocked on the head too hard by Parenelli's thugs to remember.\"\n\n\"I don't remember a lot,\" Bucky admits. Bucky wants to believe that the thought of moonlight shining on Steve's blond hair, Steve's head between his thighs is a memory and not wishful thinking. Except Steve would never do that... Or would he? God, Bucky just doesn't know. He'd never thought Steve would fuck him either, would want to, would even ask. Maybe he doesn't know Steve as well as he thinks he does.\n\nMaybe this is all a terrible mistake.\n\nNo. \n\nNot 'maybe'. \n\nHe knows it is. It has to be, it's too easy otherwise, and Bucky's learned not to trust 'easy'.\n\nThen Steve says, \"If you want, I could jog your memory,\" with a charmingly coy smile and god, if this is a terrible mistake all Bucky can think is how awful a person he is for still wanting to push through with it, feelings be damned when it all goes to shit.\n\n\"Yeah.\" But the doubts have set in, and there's nothing that crushes the libido like fear. \"Yeah, I'd like that,\" he says, hoping that he doesn't sound as uncertain to Steve as he does to himself.\n\nExcept Steve sits back and studies his face for a long moment. \"You're not going to regret any of this tomorrow, are you?\" he asks, biting his lip, and it's rare to see this kind of vulnerability. Bucky's pretty sure he's one of the lucky few to ever have witnessed it. Maybe that's what made him fall in love with Steve all those years ago.\n\nHe thinks Peggy must have seen it, too, to fall so quickly for a good man, and as much as he'd resented her and resented Steve, that was something he'd understood at the very least. Because it was far harder not to love Steve Rogers, both the man he was and the man he became, when Erskine gave the rest of the world the chance to see what Bucky saw.\n\n\"Why would I?\"\n\n\"Because you're drunk and I know you.\"\n\nBucky scowls. Even drunk he knows Steve's right. What drunk in-the-moment brain thinks is a great idea, sober hindsight brain will regret, no matter how into it Steve might have seemed at the time. Because Steve is Steve and Bucky knows that means he wouldn't have considered the consequences.\n\nBecause Steve is Captain America, and can Captain America even be gay? It's one thing to play at being something for a mission, and Bucky was under no illusion it was something that could ever be kept going after, even if Steve was on the same page as him. It's another thing for Steve to think that Captain America, should he be allowed to be gay, could be with with someone with the dubious honour of being number one most wanted in SHIELD's sealed files and the biggest traitor America has known.\n\nHis history, which starts not with the birth of a boy, James Buchanan Barnes, in a hospital in Brooklyn, but with the birth of a weapon in a secret Soviet lab in occupied Poland, will always preclude this being any more than a secret fling.\n\n\"You're regretting it already,\" Steve marvels. \"Oh, Buck, this has to be a record.\"\n\n\"Shut up,\" Bucky mutters. Steve cups his face and kisses him again, even as Bucky half-heartedly tries to resist. But then, when has he ever been able to resist Steve?\n\n\"Why would you regret it? And don't say because of who you were, you know that doesn't matter to me—\"\n\n\"To you, maybe, but to the rest of America? The public might be able to stomach Cap being queer, but fucking a traitor?\"\n\n\"Are you scared?\"\n\n\"What? No,\" Bucky says furiously. He's—he's not scared—\n\n\"Sounds like you're scared.\" Steve sits back. \"Too scared to risk it actually working out and having to be happy for once.\"\n\nBucky swears and shoots to his feet. He doesn't have to stay and listen to this. He came here for—he doesn't know why he came here... for Steve, for succour, maybe. He sure as hell didn't come for this bullshit. He'd rather go home and face up to another night of terrors and sweats than put up with this.\n\nBut Steve is quicker and he gets between Bucky and the door. \"You might be okay with never getting what you want and being unhappy for the rest of your life because of it, Buck, but what about me?\"\n\n\"What?\" Bucky asks stupidly. Steve's got his little clubhouse of friends now, he doesn't need Bucky in his life to be happy. He could have anyone in the world. Actually literally anyone. Why should he want the only one who'd tarnish his reputation—\n\n\"Don't I deserve to be happy? To get what I want?\"\n\n\"Of course you do.\" The reply is automatic, and Bucky would do everything in his power to make sure Steve was—oh. \"That's not fair.\"\n\n\"If I deserve it, why won't you let me?\"\n\n\"That's not fair,\" Bucky repeats, feebly. \"This is bigger than just us and what we want.\"\n\n\"But it doesn't have to be, this is what I'm trying to tell you. I know there are risks and I'm not naive, but the benefits of two people loving each other have to outweigh that. Being happy outweighs that.\" Steve's closed the distance between them, and he reaches out, his hands curling over Bucky's shoulders and Bucky's completely helpless but to let himself be reeled in.\n\n\"After all we've been through to get here, what isn't fair is to expect us to give each other up again. We both deserve this.\"\n\n\"But—\"\n\n\"I'm not going to let you do penance for the rest of your life, because you don't think you deserve to be happy. Risk it with me, Buck,\" Steve whispers against his mouth and all Bucky can do is close his eyes and sway into the kiss.\n\n\"You gonna give me a choice?\" Bucky asks eventually (but he's lost already, he knows, and drowning because this is Steve, and Bucky would do anything for him).\n\n\"Not if I can help it. Promise me you'll let us be happy. That you'll let yourself be happy.\"\n\n\"Steve—\"\n\n\"Promise me.\"\n\nBucky knows what Steve's asking and Steve knows it too. Bucky doesn't break his promises—can't, not to Steve—not unless it's for a reason far beyond his control and it's only been beyond his control twice in his entire, long life.\n\nThen Steve says, \"Please,\" and what else is Bucky meant to do?\n\n\"I promise,\" he says and the words don't taste like ashes in his mouth.\n\n\"Good.\" Steve kisses him again, tenderly, and he doesn't taste like ashes either. Then Steve cheats and goes the one route Bucky's physically incapable of turning down. \"Now come to bed with me,\" he whispers, \"and I'll show you just what happened that night.\"\n\n\"Yeah, okay,\" he says, trying to sound like this was no big deal. The look Steve gives him is amused and knowing, because this is Steve. How could Bucky even think he could dissemble in front of Steve like that?\n\nHe's never been in Steve's bedroom before and it's nice, it's comfortable and it's familiar. It takes Bucky a moment to realise why: like the bedroom at the house they shared for the mission, it's lived in and comfortable. There's a sketchbook on the table by the bed, and a box of tissues, and an empty glass. A pair of jeans and a shirt are thrown casually over the chair in the corner that Bucky's sure Steve was told he should have, but has never actually sat on. There's a pressed shirt on a hanger, hanging from the closet door handle and a novel on the bed—made, but rumpled, like Steve's been lying on top of the covers.\n\nBut it's more than that, something that takes Bucky back even further to a time before the war: Steve's art, some framed this time, but others stuck in place with poster putty, where decades before they'd been taped to the wall.\n\nSteve's not interested in waiting for Bucky to look around and hustles him to the bed, pushing him down. Bucky wonders if Steve's rushing so he won't have time to change his mind. As Bucky toes his shoes off, Steve climbs over him, pushing him flat as his mouth finds Bucky's in a long, deep kiss.\n\nIt's excruciating to wait as Steve slowly unbuckles his belt, flips open the button on his jeans and tugs down the fly. \"So you were sleepy,\" he says, picking up his story again as he tugs Bucky's jeans from his hips. Bucky's not wearing anything underneath and he doesn't miss the way Steve's brows quirk when he realises and wets his lips. \"You fell asleep while I was in the shower.\"\n\nBucky props himself up on his elbows, attention arrested because Steve's just started stripping off his own clothing. It's not like he's being a tease, but Bucky's pretty sure he'll never get sick of watching Steve take his clothes off. \"I remember that much.\"\n\nThen Steve's back on the bed, tugging Bucky's shirt up over his head. \"You were naked—\"\n\n\"Yeah, but that wasn't unusual,\" Bucky interjects. \"You gotta admit.\"\n\nSteve grins. \"Not after that first night of pretend fake sex. Do you normally sleep in the nude? I don't ever recall—\"\n\n\"As if I would when I have visitors,\" Bucky scoffs. He'd made the decision, after that first night when they'd put on a show for a creep who may or may not have been watching, that he might as well be a creep too and go with it. \"'Sides, you never said anything.\"\n\n\"Why would I? I got to sleep with each night with you all naked and pressed up against me. Something—one of the things—I'd only wanted since approximately forever.\" Then Steve slides over him, skin against skin and Bucky loses the thread of the conversation as he reaches up and curls his hand around Steve's neck and pulls him down. Steve's pleased noises whenever Bucky kisses him will never get old.\n\n\"You were naked,\" Steve repeats, \"and curled up against me and you must have been dreaming about something—or someone—real nice, 'cause next thing I know, you're getting all cosy with my leg—\"\n\n\"What, like this?\" Bucky asks, rolling them so he's lying over Steve, one of Steve's thighs between his. He's half hard already from Steve's little story and from the aroused burr in Steve's voice, and when he rolls his hips Steve groans. It's delightful and Bucky's sure it's not part of the story but he leans down and kisses Steve again, long and deep and punctuated again and again with slow thrusts of his hips.\n\n\"Yeah,\" Steve eventually says, breathlessly. He sweeps his hands up and down Bucky's back, over and over. \"Just like that.\"\n\n\"Then what?\"\n\n\"Then I woke you up.\"\n\nBucky can't help his soft laugh, because he knows himself, he knows how he would have reacted. \"Bet I took that well.\"\n\nSteve smiles up at him and reaches out, touching Bucky's cheek. \"You weren't very impressed with yourself, no.\"\n\n\"Hey, in my defence you wouldn't be either if you'd just woken up and found out you were getting all handsy with the guy you were head over heels for in your sleep.\"\n\n\"And who's head over heels for you,\" Steve reminds him.\n\n\"Yeah, well, I didn't know that at the time, did I? Then what?\"\n\nSteve rolls them again, and god, his weight bearing down over Bucky feels amazing. Bucky hates feeling trapped, but he thinks Steve could pin him immobile to the mattress and do whatever he wanted and Bucky wouldn't even care. Steve kisses him again and again, then like out on the couch, he kisses Bucky's jaw and throat and collarbone.\n\nHe slides down further and Bucky closes his eyes because—\n\n\"Steve,\" he says, \"are you—\" Then he stops with a shaky inhalation as Steve kisses him just below his navel and then lower, nuzzling his cheek against Bucky's dick, and he is, he is and Bucky can't even breathe as Steve mouths at the head of his dick, hand wrapped around the shaft.\n\n\"Fuck,\" he breathes, fingers gripping the bed covers tightly as Steve shifts, takes Bucky's dick deep into his hot, wet mouth, his hand shifting to massage Bucky's balls. He's a gifted amateur, sheer enthusiasm making up for a lack of experience and it's clear he fucking loves sucking dick. All Bucky can wonder is why the hell he ever tried to stop Steve from touching him like this before that night. He knows he thought Steve wasn't—that he couldn't be queer like Bucky, because he was Steve, like that made him magically queer-proof, and if he just fucked Bucky or if Bucky sucked him off he could then pretend it wasn't another guy in his bed.\n\nBut Steve had rejected that idea, unable to tear his eyes away as Bucky did this same thing to him, the way Bucky can't look away now. If he'd looked even half as breathtaking as Steve does now, sucking Bucky down like he's hungry for it, then Bucky couldn't blame him.\n\nSteve is fucking beautiful like this.\n\nThen Steve does this thing with his tongue and Bucky gasps and twists beneath his mouth. He does it again and again until Bucky's a shaking mess, feeling the build of his orgasm in the lightning in his spine and the tightness of his balls. \"Steve,\" he says urgently, \"Steve, you gotta stop, I'm—\" His fingers curl in Steve's hair and this is—this is familiar, this, Steve sucking him down so when he comes it's in Steve's hot mouth and down his throat—\n\nHe shudders and cries out, hips jerking as Steve swallows; panting as Steve continues to torment him, his tongue finding every single sweet spot. Eventually he slides his mouth from Bucky's dick and slowly crawls back up his body, looking smug and satisfied. \"An that,\" he says, \"was what you forgot.\"\n\n\"Musta been one hell of a punch to the head,\" Bucky says breathlessly, as he tugs Steve down so their mouths meet. He can taste himself in Steve's mouth which is about a hundred times hotter than it should be. \"Can't believe I forgot that. Jesus, Steve, that was fucking magic.\" Even though the strength of his orgasm has to have clued Steve into how good it was, the idiot still grins at Bucky like he's just told him that actually, now that you mention it, Santa is real.\n\nHe can feel Steve hard against him and reaches between them. Steve's dick is silky-hard in his hand and he can feel the wet at the tip slick against his palm. \"And what did I do about this?\" he asks, letting the roughness of his hand, the catch of dry skin, tease Steve.\n\nSteve laughs and rolls off to the side a little, so Bucky can touch him so much better (and he licks his palm and spits on his hand and when he strokes Steve again, Steve groans and pushes forward into his fist). \"Nothing,\" Steve says eventually, eyes half-closed and his expression one of bliss.\n\nBucky stops stroking him. \"Nothing?\" He wouldn't do nothing. He's an equal opportunity lover, he wouldn't have just left Steve metaphorically swinging in the breeze.\n\n\"I told you that you didn't have to. I didn't want you to think you had to do it just 'cause I did. I wanted you to know I did it 'cause I could, not—not for the mission or anything.\" Even though they're both butt naked and Bucky's still got his hand wrapped around Steve's dick, Steve manages to look like noble fucking Captain America, always doing the right thing.\n\n\"You... you're ridiculous.\" Bucky shakes his head, neglecting Steve's dick in favour of kissing him thoroughly. \"Like, genuinely ridiculous. And also hot.\" \n\nSteve grins. He looks so happy it almost hurts.\n\n\"So, d'you have lube in this place?\"\n\n\"I—maybe? Do... we need lube right now?\"\n\nBucky laughs at Steve's perplexed expression. \"D'you wanna fuck me? Gotta make up for what you missed out on that night.\"\n\nSteve stares at him a moment. \"Oh! Yeah, okay, we need lube right now,\" he says firmly. \"Let me just—\" He rummages around in the drawer by the bed, eventually dumping the contents on the floor. \"Ah-ha!\" he crows, presenting Bucky with a whole tube of the stuff.\n\nIt doesn't take Bucky long to get himself slicked up—and Steve helps too, sliding a finger into Bucky's body alongside Bucky's own fingers (Steve's more curious and adventurous than Bucky expects, wanting to get his fingers and mouth into everything)—then Bucky pushes Steve flat against the bed and with little ceremony straddles him, reaching back to guide Steve's dick against him and sliding down onto it in a smooth movement. He can't help his groan of pleasure.\n\n\"Fuck, Bucky,\" Steve manages to say.\n\n\"You might wanna hold on,\" Bucky says with a grin because he doesn't mess about, and Jesus, Bucky'll never get over this, the feel of Steve deep inside him.\n\nIf that isn't enough, if him riding Steve's dick until he's hard again isn't enough, then Steve flips them, driving himself back into Bucky's body the moment his back hits the mattress. \"Steve—\"\n\nSteve's mouth crashes down over his in a hard kiss, hard like the way he fucks into Bucky, so terribly good, and Bucky clings to him, Steve's muscles surging under his hands. Steve bites at his lips and his jaw, kisses down his neck and Bucky throws his head back, moaning and helpless underneath—\n\nHe knows what Steve's doing—\n\nSteve's the one in control now, completely, where before it had been always been Bucky, from the first time in their borrowed house when Bucky had turned to Steve and proposed they fuck. \n\nBecause Steve wants all of this, and he's making sure Bucky knows it too.\n\n(Oh, Bucky knows it.)\n\n\n\nSteve's sitting cross legged, his sketching pad in his lap, filling Bucky's body out in broad strokes as Bucky dozes next to him. He's drawn Bucky a hundred—no, a thousand—times before, but never like this. Never captured in a serene post-orgasmic haze, pliable and sleepy. He'd never dared to when they'd been in their house for the mission, for the feelings unspoken: why should he want to commit Bucky to paper after they pretended to have fake sex for the purpose of deceiving their target? Instead he'd drawn fragments from memory: the curve of Bucky's eyelashes against his cheek, the light curl of his fingers in the rumpled sheets.\n\nAnd more, hands on skin and bodies moving together. He'd drawn sex before, a long, long time before, when there was nothing to identify the stronger frame curled around the skinnier one as Bucky. But those sketches from the mission filled in scars and hurts, a prosthetic arm and hand cloaked in reality, but captured in careful detail on the page. This time there was no mistaking who the man he drew was.\n\nHad Bucky ever flipped through Steve's book in secret maybe they'd have reached this point a lot sooner. Or maybe not, Steve thinks, given how difficult it had been to get them here as is. Bucky's regrets had nearly been too much, and Steve had been terrified that even after Bucky's confession of love, this thing that Steve had wanted all his life would still be taken away from him.\n\nThe doorbell rings and Bucky starts awake. Steve watches as he establishes his location and relaxes again.\n\n\"Go on, 'way you go,\" Bucky mutters into the pillow.\n\nSteve is pretty sure he's never been so happy as he climbs out of bed (after leaning over and pressed a kiss against the corner of Bucky's jaw). \"Money's in my wallet,\" Bucky says. \"Wallet's in my jacket. Jacket's on the couch.\"\n\n\"No, I can pay—\"\n\n\"Steve.\" Bucky rolls over, props himself up on his elbows and gives Steve a Stern Look. Which Steve would probably care about more if the sheet clinging precariously to Bucky's hips actually gave Bucky any kind of modesty. Instead he eyeballs Bucky because he doesn't have to hide what he's doing anymore and Bucky grins and preens for him. Then he says, \"Now go and pay. With my money. And put some sweats on before you do it, don't wanna give the poor pizza boy a heart attack.\"\n\n\"I'm sure a naked guy is the least of things he would have seen—\"\n\n\"Put some sweats on.\"\n\n\"Yes, Buck.\" Steve grins and then kisses him again, just because he can, swiping up his sweat pants from the floor. Bucky's jacket is on the couch where he left it when he first arrived, and Steve rummages around in the pockets.\n\nThere's a weird thickness to Bucky's usually slim wallet—he has no cards other than his ID, and the bank card to get money out of the wall and, for some reason, a loyalty card to a hole-in-the-wall coffee place near the SHIELD offices that Steve knows for a fact is terrible. Steve knows he should mind his own business, but look, he tells himself, it's Bucky, and it's not like they have secrets anymore, do they? He ignores the utter sophistry of that thought and opens the wallet.\n\nThere's a small fabric pouch nestled in against the notes, telling himself he would have seen it anyway when he pays for the pizzas, kicks the door closed and shuffles back to where he'd dropped Bucky's jacket on the couch. Setting the pizza boxes down on the coffee table, he slips the pouch out of Bucky's wallet and tugs open the drawstring. There are folded tissues inside, but the weight is more than just paper. Steve carefully unwraps whatever it is and—\n\nHe stops breathing for a moment.\n\nIt's his and Bucky's wedding bands.\n\nOr their pretend wedding bands, rather.\n\nWhatever they are, they gleam against the tissue in yellow and white gold.\n\nNo, what they are, are the rings Bucky was meant to return to the jeweller—the rings that, before this, Steve couldn't understand why Bucky would want to pick out himself. That they're not identical and not just plain gold bands smacks of someone putting a lot of thought into it, and who else could it be but Bucky? Of course, most of it makes sense now he knows Bucky's feelings, and he thinks he might understand why Bucky still has them, as the only real, tactile reminder he'd been able to keep of their mission together.\n\nSteve wants to slide his own ring back onto his finger and feel the metal warm quickly against his skin. He knows—he knows now, that it'll feel right if he did, the way it didn't before, because it means something now instead of wistfulness and longing and future heartbreak.\n\nInstead he palms them and picks up the pizza boxes, padding back through to the bedroom. Bucky perks up as the scent of cheesy goodness wafts in with with Steve and sits up, this time with the sheet more securely tucked around him, more's the shame.\n\nSteve sits the boxes down on the bed and Bucky's reaching for them just as Steve opens his hand, tilting it so Bucky can see the wedding bands resting on his palm.\n\nBucky freezes guiltily the moment he sees them, then tries to act all casual as he picks up one of the pizza boxes. And Steve says, \"You didn't mean for me to see them in your wallet, did you?\"\n\nA series of emotions chase across Bucky's face but the one that stands out most is consternation, and when Bucky says, \"Uh, yeah, sure I did,\" Steve knows he's lying.\n\n\"Bucky.\" Steve has the knack of admonishing Bucky with just the tone of his voice down pat after years of experience.\n\n\"I was going to return them, I just haven't had time...\" He trails off because they both know that for the past 10 days he's had nothing but time.\n\n\"I'm not mad,\" Steve says. He climbs onto the bed and shuffles closer to Bucky. \"I think it's... sweet.\" Sweet's not even the half of what he thinks it is. He holds them out to Bucky. \"You picked them out yourself, didn't you? You weren't about to let some stranger give you a couple of rings for us and just go with it.\"\n\nBucky sets his jaw mulishly, which is as much an admission as anything. Normally Steve would be okay with that, because he knows—has almost always known—what Bucky doesn't want to say, but it's different now. He wants to hear what Bucky has to say, even if he knows Bucky wouldn't be Bucky if he made it too easy for Steve to hear it.\n\nSo he says, \"You know you can tell me these things, right? You don't have to hide it, because you know how I feel, too.\"\n\n\"Except I don't, Steve. All I know is you think you shoulda said something sooner, too. I can guess what you mean, but... I'm no mind reader.\"\n\nSteve blinks. Does Bucky actually doubt that Steve feels the same? Seriously? Isn't 'I'm head over heels' a dead giveaway? \n\nBut he humours Bucky. \"I love you,\" he says, like this should be the most obvious thing in the world. It should be. There should never have been any point in Bucky's life that he's ever doubted it, even if the way he thought Steve meant it might have changed. \"And, god, I've always been in love with you, too.\" Steve rubs his hand over his hair. \"Probably since the day you swaggered into a fight—that I was winning by the way—and slugged a guy so hard you broke his nose, then acted like it wasn't a big deal. Why else do you think I wished I'd said something sooner? We should have been able to do this—\" he can't help leaning forward, and he can feel Bucky's lips curve in a small smile against his own, \"—a long time ago.\"\n\n\"Before the war, you mean.\"\n\n\"Before the war,\" Steve agrees. When he was still small and weak on the outside and Bucky was still the only one who cared to know him—\n\n\"It's better this way,\" Bucky says though, and his eyes are dark and distant, a long, long time in the past. \"If we'd been—if we had done this before the war and then I went and died on you... it would have been so much worse.\"\n\nSteve swallows hard. Bucky bringing that up, that's... it's unexpected. Without any warning, he didn't have a chance to steel himself and he can taste it even now, the bitter grief of his loss. He can't help the rawness in his voice when he says, \"It couldn't possibly have been any worse.\"\n\nBucky sets aside the pizza and crawls across the bed to Steve. He folds Steve's fingers closed around their wedding bands and reaches up to curl his hand around Steve's nape. \"I'm sorry I did that to you. I'm sorry wasn't there with you at the end,\" he says, and before Steve can protest that he's the one who owes the apology, for forever not being able to reach Bucky in time, Bucky presses his mouth against Steve's. \"But I'm here now,\" he says when he eases back. \"And we might have wasted a lot of time back then, but we finally made it, right?\"\n\nSteve nods, his grief eased by Bucky's tone. He doesn't doubt that he'll have to remind Bucky in the future—and the near future, too—of his promise to let himself be happy, that he's not ruining Steve's life with his terrible history. \n\nBut for now Bucky sounds content, and that's all Steve can ask.\n\n\"We've got a lot of time to make up for, but I think we'll have the years to do it.\" Steve can feel the weight of the rings in his hand and opens his fingers. His gaze flicks to Bucky's face. \"And maybe even one day we could...?\" he asks hopefully. He wants it to be real. What they had on the mission, he wants that—to call Bucky husband and have people know that's how it is between them, no matter how sappy it might be. This modern life had given Bucky back to him, and gives him the love he'd never thought he could have. If it's greedy to want more, he doesn't care. He wants more. He wants all of it. He wants everything he can have and he'll take it with both hands if he has to.\n\nBefore this, Steve had never really been interested in marriage. Even back in the war, with Peggy, Steve had thought of marriage as a thing he'd do if she wanted it. He'd loved her and if she wanted him, when everything was won and done, he'd have asked. Bucky, well... he'd assumed Bucky would find one of his ever-present parade of girls to wed and bed once he got back to Brooklyn, because that's what guys did. \n\nHe'd thought maybe he'd be able to get over the ache for Bucky if they both had someone else in their lives. Thought maybe he'd stay in London with Peggy if being half a world away would help and he'd be able to love her the way she deserved.\n\nBut now...\n\nNow it's the future and he could marry Bucky, if it was what Bucky wanted. \n\nIf.\n\nBucky leans over and plucks the wedding bands out of Steve's hand. He holds them in his fist a moment, before leaning past Steve to set them on the drawers by the bed and it's... it's the answer Steve had expected, though he can't lie and say he's not disappointed. But it's not the be all and end all of their relationship. No, because that's just beginning, he thinks as he turns his head, nuzzling against Bucky's shoulder. He can smell sex on Bucky's skin and the last hint of aftershave and Jesus, it pushes his buttons. He wonders if he could just kick the pizza off the bed and—\n\nBucky slides his mouth hot and wet against Steve's, his fingers teasing light as they skim up Steve's side. \"I'll think about it,\" Bucky says when he pulls back, because he hasn't forgotten the conversation even if Steve'd been ready to lose himself in his body. Then he grins a little wryly. \"Wouldn't want to rush into it or anything.\"\n\nSteve laughs softly. \"Buck, pretty sure after all we've been through, nothing we could do would ever be considered rushing it. Even if we got married tomorrow morning.\"\n\n\"A man's gotta get a proper proposal,\" Bucky says loftily.\n\n\"You want me on bended knee? Because I can do that.\" He would too. Right now, naked as the day he was born, if Bucky wanted it.\n\n\"Pretty sure a proposal's not why I'd want you on your knees, Steve.\" \n\nSteve curses his stupid complexion as he blushes at Bucky's lewd tone, because he'd done that for Bucky not even a few hours ago, and he'd do it again in a heartbeat so why is he even blushing? He's about to suggest it, to answer the challenge in Bucky's tone with action, except Bucky's reaching for the neglected pizza boxes and sprawling out across the bed, head pillowed on Steve's thigh. \n\nSteve's stomach rumbles loudly and Bucky snorts, passing him the second box. \"I think this one must be yours,\" he says, shovelling most of a slice from his own box into his mouth, cheese oozing down his chin. He scoops it up into his mouth with his finger, licking at the cheesy grease on his skin.\n\nOh no, that shouldn't be sexy. Not at all.\n\nThe way Steve swallows has nothing to do with the forgotten slice of pizza wilting in his hand and everything to do with the fact he's got Bucky licking his fingers, naked in his bed, and—\n\n\"No,\" Bucky says, reaching up and pressing his finger against Steve's lips. \"Food first, then you can look at me like I'm good enough to eat.\"\n\n\"Not first?\" He catches Bucky by the wrist, wrapping his mouth around Bucky's finger and pressing his tongue against the pad. Steve can tell by the way Bucky's breathing changes that he's got Bucky's attention. \n\n\"Nngh,\" Bucky says as Steve sucks on his finger, before tugging his hand away and pushes aside the pizza box. It falls to the floor with a wet thud when Bucky shifts and slides up against him. Steve thinks he should complain, should pick it up, except he's got a lap full of very naked, very pleased Bucky pressing up against him.\n\nAnd when Bucky wraps his arms around Steve's shoulders and kisses him, Steve finds he doesn't even care."
}