{
    "id": "8513521",
    "url": "https://archiveofourown.org/works/8513521?view_full_work=true",
    "author": [
        "Lissadiane"
    ],
    "title": "Whatever Our Souls Are Made Of",
    "rating": "Not Rated",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Teen Wolf (TV)"
    ],
    "relationships": [
        "Derek Hale/Stiles Stilinski",
        "Allison Argent/Scott McCall"
    ],
    "characters": [
        "Stiles Stilinski",
        "Derek Hale",
        "Erica Reyes",
        "Vernon Boyd",
        "Isaac Lahey",
        "Scott McCall",
        "Melissa McCall",
        "Sheriff Stilinski",
        "Candy the Ghost Retriever",
        "Laura Hale (but still dead)"
    ],
    "additional_tags": [
        "Ghosts",
        "ghost animals",
        "Fluff",
        "Angst",
        "Coffee Shop",
        "College AU",
        "warning for animal death because it's a ghost story",
        "Awkward Derek",
        "Awkward Stiles Stilinski",
        "all around awkwardness"
    ],
    "language": "English",
    "series": "",
    "published": "2016-11-09",
    "completed": null,
    "words": "14,953",
    "chapters": "1/1",
    "comments": "695",
    "kudos": "10,619",
    "bookmarks": "2,806",
    "hits": "66,238",
    "summary": "<p>It's a cold, snowy night and Stiles is halfway through his shift at the campus coffee shop when a tall, dark and handsome stranger walks in, one who seems unaware that he's being haunted by a wolf.</p>\n<p>In which Stiles Stilinski sees the ghosts of animals with unfinished business, and Derek Hale is unaware that his dearly departed sister left a few things unfinished.</p>",
    "notes": "<p>Here it is, at last. This story nearly killed me. Thanks to <a href=\"https://pantstomatch.tumblr.com/\" rel=\"nofollow\">Skoosiepants</a> for patiently reading all 27 different versions of this fic that existed at one point or another and not murdering me for the many frequent times in which I threw up my hands and said there was no help for it, I had to go back to page three and start again. Without her boundless enthusiasm, I never would have started writing Sterek in the first place... or watching Teen Wolf. And I believe I have my brief flirtation with Bandom to blame her for too.</p>\n<p>Dedicated to everyone on my <a href=\"https://lissadiane.tumblr.com\" rel=\"nofollow\">Tumblr</a> who voted in my WIP poll, especially those who voted for \"Stiles sees ghost animals\". To those who voted for another on the list, I'll see what I can do for you as well. </p>\n<p>Warning: This story features the deaths of animals. It's very sad. But that's how you get ghost animals, so it had to happen. Don't worry, nothing gruesome. Mainly they just show up as spirits who insist on interrupting Stiles' attempts to be a normal, functioning member of society. And then they go to Heaven.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
    "text": "He’s six years old the first time Stiles realizes that he’s not quite normal in the strictest sense of the word.\nHe’s sitting at the dinner table, morosely eating his peas and carrots, while his mother and father talk about Grown Up (aka boring) things. \nHe’s got his mouth full of peas when his father turns to him abruptly, with a smile, and says, “How was your day, kid? Mom tells me you made a new friend at school.”\nStiles brightens up with excitement, because he had, in fact, had a marvelous and miraculous day. He starts speaking, forgetting about the peas, and chirps, “Oh, yeah, I did! His name is Scott and he’s the coolest, we played Ninja Turtles at recess and he was Leonardo, which was super cool, because it meant I got to be Michaelangelo, and he’s the funniest, so it was a great day, Dad, even though I have to eat these peas and peas are the worst, but I’m so glad that Candy came back.”\nThere’s a beat of silence, and by the door, Candy’s ears perk up and she lifts her head. Candy is the best dog, she has been part of Stiles’ family since he was a baby, and he’d been so sad the day before, when he thought he had lost her.\nIt takes a moment for Stiles to realize his father is choking on his peas, and that his mother is glancing from him to the door where Candy is still curled up, watching them with a happy, doggy grin on her face. His mother is frowning thoughtfully.\n“Candy came back?” she asks delicately, and Stiles nods, beaming.\n“She came and found me on the playground at school, just like she used to!” he says, before pointing an accusing yet jovial fork at his father and saying, “And you said she wouldn’t come back, Dad! Proves you wrong, huh?”\nAnd Candy starts wagging her tail, and it should be beating against the floor in a familiar rhythm, the way it has since she was small and so was Stiles, before she’d been hit by the car the day before.\nBut it’s silent, and apparently he’s the only one who can see her at all.\n*\nHis mother had been born with a gift as well, though hers was the gift of making a garden grow even in the middle of winter. Her mother had been born with the ability to heal small scrapes and bruises with kisses. Her mother’s father had been born unable to lose a game of cards. Her mother’s father’s mother had been born with super strength, which would have been awesome.\nStiles, apparently, has the ability to see dead animals. Not all dead animals, but those with “unfinished business,” like dogs who were unwilling to leave their hyperactive human boys behind, even when offered an eternity across the rainbow bridge, frolicking with other dogs in Heaven.\nThey don’t get another dog. Stiles is worried Candy would feel sad if she had to watch her replacement get all the snuggles and butt scratches that she couldn’t feel anymore. He doesn’t need another dog anyway, not with Candy following him faithfully, even if Stiles is the only one who can see her.\nAnd so he grows up, easily distracted by ghostly animals that no one else can see, which can be frustrating. He can’t find it in himself to be too irritated by it, however, when his gift means that sometimes frantic dogs or cats who have recently passed on come to him and lead them to where they left their puppies or kittens behind, so he can take them to Scott at the vet’s office, and make sure they find new homes.\nIt also helps him when it comes to meeting new people. It’s much easier to trust a man being followed by the ghost of a trusty golden retriever, or an entire school of guppies and plecostomuses, than it is to entirely trust someone who isn’t followed by a parade of loving animal spirits at all.\nBut other than his knack for saving suddenly orphaned puppies and his ability to make sometimes unfair judgements of people based on their ghostly animal companions, Stiles’ gift doesn’t affect his life overly much. Sure, sometimes he’s startled by the ghost of a silent boa constrictor, or a semi-transparent bird will zip by him and scare the crap out of him, and once, he nearly caused an accident when three ghost deer wandered out in front of his jeep in the middle of the night, but for the most part, by the time he’s 21, Stiles has this shit under control. It’s normal for him.\nAnd then, suddenly, it’s not.\nIt’s a slow day at work at the campus coffee shop on a snowy, cold winter’s day when the door swings open, bells jingling, and the wolf walks in. \nShe’s sleek, black, her eyes glowing gold, and she’s stalking a snow-dusted, dark-haired guy who’s scowling as only a day this cold deserves to be scowled at.\nThe guy ducks into a table in the corner, drops his bag on it to save his spot, and then he comes to the counter to order.\nStiles has never seen him before. He’d remember. If not for the guy’s stupidly hot face, then for the wolf that’s watching from the shadows where the guy has left his stuff.\n“Hot chocolate,” the guy says.\nStiles drags his eyes away from the wolf and says, “Uh, sure!” He rings it up. He carefully writes Derek on the cup, after asking the guy’s name. Derek pays. Stiles makes his drink, hands it to him, and when the guy gets back to his table, the wolf curls up at his feet.\nThey stay for hours. Business picks up and then slows down again, and Stiles serves everyone who comes through the door, mixes up drinks, keeps things clean, and every few seconds, can’t help darting a quick glance at the man and his wolf in the corner.\nIt’s just, he can’t figure it out. How does a dude like that somehow convince a wolf to be that loyal, to love him that much, to stick around after death? \nHe sees wild animal spirits, of course. There’s really no way to tell what unfinished business keeps an animal in this world instead of the next, but he’s never seen a wild animal attached to a person this way.\nMaybe Derek’s a zoo keeper, or a wildlife sanctuary owner, he thinks, mixing up a nonfat latte. He’s only a few years older than Stiles, though, so he’s not sure how likely that is.\nMaybe Derek’s a bush man who lives off in the wilderness befriending forest creatures, he decides.\nMaybe it’s just a dog that looks like a wolf.\nStiles looks again.\nDefinitely a wolf.\nHe’s coming up with a complicated theory involving Derek stealing a wolf cub and raising it as his own semi-feral pet when he glances up again and Derek’s gone. He missed him leaving.\nStiles does his best to forget about it. Unless they seek him out, he can’t really help ghost animals with their unfinished business. It’s not like they can communicate with him.\n*\nIt would be easier to forget all about Derek and his ghost wolf if they didn’t become regulars. They do, though, always coming in alone, ordering hot chocolate, claiming a table near the window, and staying for hours. Candy is always quick to edge away from Stiles towards the wolf, wagging her tail with a doggish hello, and the wolf is just as quick to ignore it. Still, each time, Candy edges closer and closer, determined to befriend her.\nThe best Stiles can tell, Derek is studying some pretty advanced literary stuff – myths and folklore, Stiles thinks. Most of it doesn’t seem to be English.\nIt’s cool. Stiles has taken a lit. elective or two in his time, but the one time he’d tried to make casual conversation with Derek about it, he’d been shut down pretty brutally. Whatever. Stiles doesn’t mind. He’s good with being ignored by incredibly attractive people. Case A? Lydia Martin.\nThe problem is, though, that Stiles has never been able to leave a mystery alone.\nIt’s a few weeks til Christmas and he’s working the late shift, absently swabbing at the countertop while staring at Derek with a thoughtful frown when Erica, his beloved and irritating co-worker, catches him.\n“Ooh, Stilinski,” she purrs, hopping up and putting her ass on his newly cleaned counter. “Totally out of your league.”\nStiles jumps, turns blotchy and red, and says, “You don’t know that—I don’t know what you’re talking about. I was just thinking, that’s all.”\n“About what?” she asks, eyebrow quirked. “Sexual things? Do share. It’s been a fucking boring shift, I could use a little pick-me-up.”\nShe grins, toothy and sharp.\n“No,” he hisses, shooting Derek a glance to make sure he’s not listening. Derek hasn’t even looked up from his laptop. “Nothing sexual. I was thinking about – about –” He reaches blindly for something that’s close to the truth without giving away the fact that he’s constantly surrounded by ghost animals.\nErica’s got six semi-transparent cats circling her legs, bumping up and through her shins. It’s always fucking distracting, and Candy always makes a habit of chasing them, snapping playfully at the tips of their tails while they arch up, hiss, and swipe their paws at her nose.\n“Wolves,” he blurts. That’s not so bad. Nothing incriminating about that. It’s not like he said ghost wolves, or dead wolves or anything at all, so—\nHe glances over and Derek is staring right at him with intense, scowly eyebrows, his mouth tight, shoulders drawn up and hands clenched. At his feet, the wolf just lazily licks at one paw.\n“Wolves?” Erica echoes, sliding off the counter, all of a sudden much more interested. “I didn’t know you were interested in wolves.”\n“I’m interested in all sorts of animals,” Stiles tells her loftily. “I considered majoring in biology, you know, until—”\n“You’re an art major,” she says.\n“Yes, now I am! But animal form is a huge part of my work!” He’s getting flustered. He can still feel Derek staring.\n“Aren’t you, like. Cartoons? How much animal form do you really need to know to—”\n“I have things to do!” he lies, waving his arms aimlessly as if that would make him look more trustworthy somehow. “Excuse me!”\nHe flees to the kitchen and hides there until it’s closing time and he’s sure Derek is gone.\nErica doesn’t bring up that embarrassing episode when he finally creeps out of the back to help her clean up, thankfully. \nInstead, she hums tunelessly under her breath as she runs the last of the mugs through the dishwasher and then declares, “It’s Boyd’s birthday tomorrow, we’re having a thing.”\n“A thing?” he echoes, uncertain and squinting at her. He and Erica are strictly just co-worker friends. Sure, she’s his favourite co-worker, but they’ve never hung out after hours. He’s okay with it – she is hot and a little dangerous and probably gets her kicks singing karaoke at the biker bars across town or something, she wears enough lipstick and leather for it. Stiles, on the other hand, is an art nerd. He’s got a small band of similar art nerd friends, he’s got Scott at the vet college across town, he’s got work, he’s got his studio time, he’s got his ghostly little friends popping up at awkward moments. He’s good.\nSo he’s instantly suspicious of Erica’s motives here. \n“Yes,” she says. “A birthday thing. Just a few friends, some drinks, a few games of pool. Boyd wanted me to invite you.”\nBoyd’s cool. He comes and hangs out sometimes. But he’s never really made any overly social overtures.\n“I might be busy,” Stiles says cautiously.\nShe points one perfectly manicured nail at him and says, “You’re not working. It’s a Friday. Don’t you usually stay home and watch Netflix on Fridays?”\nIt’s possible that Stiles overshares a bit with his co-workers.\n“I can see if I can make an appearance,” he says finally, his mind already working on excuses.\nShe grins. “We’ll pick you up on the way.”\n*\nStiles generally does his best to avoid chaotic, crowded places, because, depending on the crowd and the animals who chose to love them in life, it can be pretty overwhelming.\nThe ceiling of this particular dive bar is crowded with birds of all sorts, and there are phantom dogs chasing each other, snarling and fighting and bursting through tables, chairs and walls. Cats are daintily avoiding the mess by keeping to the table tops, and it’s hard to sip his beer after an orange tabby walked through it, or grab a nacho from a plate where six of Isaac’s hamsters are curled up together.\nBut even the horde of ghost animals seem to give Derek’s wolf space, veering around her as she sits there at his side, coldly watching them and refusing to participate in the frenetic, headache-inducing antics of her fellow apparitions. Candy doesn’t avoid her though; she charges forward, dancing on her paws and wagging her tail, looking to play. The wolf ignores her, nose tipped up, for a little while, but then gets bored and tackles Candy under the table, wrestling and rolling through Derek’s shins.\nBecause of course Derek is there. Why wouldn’t he be? He’s sitting at their table, awkward and uncomfortable and nursing a beer. Apparently he, Boyd, and Erica go way back.\nSo this all was a plot on Erica’s behalf to humiliate him farther. Awesome.\nStiles takes another swallow and slumps a little. Aside from shooting Stiles a quick glare, Derek hasn’t looked up from the bottle in his hand, hasn’t spoken, hasn’t been social at all. It’s awkward as fuck, with Boyd’s usual strong, silent type. At least Erica and Isaac are talking, laughing, buying shots for the table that Boyd downs without a reaction. Derek doesn’t bother. Stiles downs them too but flinches and coughs because, really, tequila’s not his thing. He’s more of a Doritos and video games sort of partier.\nThe whole thing stinks of a set up when Erica drags Boyd and Isaac onto the dance floor, after asking Stiles to watch her purse. She doesn’t bother with Derek, just presses a kiss to his cheek and laughs when he scowls.\nThen it’s just him and Derek. Alone and awkward. Stiles checks his phone and opens his mouth to make up an excuse to leave, but the tequila and the beer have proven too much and instead, he says, with a jerk of his chin, “I know you don’t like me.” He sounds sullen and his cheeks flush with embarrassment.\nDerek frowns at him. “What.”\n“You.” Stiles gestures broadly with his beer bottle. “You obviously hate when I talk to you, or – or try to make small talk or whatever, but if you hate my hot chocolate so bad, why don’t you just, like. Go to Starbucks.”\nDerek blinks. “I like how you make it.”\nStiles squints. It’s very dark and he’s pretty drunk, but he’s pretty sure Derek’s ears are turning pink. “What does that even mean?”\n“I mean, it’s pretty simple to make.”\nStiles slumps. “Oh.”\nDerek looks lost for a moment, and then he looks away, frowning. “I’m not, uh. Good with people,” he says finally. “And you stare a lot. It makes me nervous.”\n“Don’t listen to Erica! I don’t stare at you! I swear! I mean, I look sometimes, yeah, but who wouldn’t? It’s part of my job. Gotta make sure you’re still… you know. Breathing. Not choking. Not stealing anything. Enjoying your experience.”\nDerek looks like maybe he doesn’t know what to make of Stiles, not even a little bit. “I didn’t mean you stare at me,” he says. “You kind of… stare into space a lot?”\n“Oh. Maybe I can see ghosts.”\nDerek sighs. “Listen. I need to get out of here. The noise… Do you want me to take you home? They’ll probably be here for hours and you look like you’re about to pass out.”\n“On one condition,” Stiles says grandly, because he’s a genius – intoxicated, but a freaking genius. “You gotta give me your number.”\nDerek’s scowl is legendary. “Get your stuff,” he snaps. “I’ll tell them we’re leaving.”\nDisappointed, Stiles gathers up his jacket and waits until Isaac comes to collect Erica’s purse before he follows Derek to the door.\n“Sycamore Hall?” Derek asks, after he helps Stiles with his seatbelt—Stiles can’t help it, they’ve gone all clumsy.\n“Mmm,” he agrees, feeling sleepy suddenly. “Erica knew that too.”\nDerek turns on the radio. Candy and the wolf are curled up in the backseat.\n“Just don’t puke on the upholstery,” Derek says with a sigh.\n“One day, you’re gonna have to tell me her name,” Stiles hums.\n“Who?” Derek asks. Stiles doesn’t bother to answer. \nThe next morning, he’ll have vague memories of Derek manhandling him up to his dorm room, unlocking the door, tugging his shoes off, and tipping him into bed. He even drapes a blanket over him and make sure he’s got a bucket nearby in case of emergencies. \nCandy curls up to sleep beside him, and Stiles’ last thought is that he’s probably going to be very embarrassed in the morning.\n*\nStiles wakes up feeling like death. It’s nearly 4 p.m., he’s got to work on his term project before the gallery showing just before Christmas break, he can’t feel his legs, and something must have died in his mouth.\nHe also very carefully doesn’t think about Derek and last night and his embarrassing… everything. Ugh.\nSo he staggers to the bathroom, clutching his loofa and his body wash and his towel, Candy trudging behind him like an exhausted shadow, and afterwards, he feels marginally human. He collapses back on his bed and starts looking for clean underwear and instead finds an old receipt on his nightstand, corner carefully tucked under the edge of the lamp.\nIt’s a phone number, and Derek Hale is written carefully underneath.\nHe yelps. He falls back onto his bed, clutching the scrap of paper and staring at it incredulously. He giggles and not only is that embarrassing, it makes his aching head start to throb.\nHe carefully puts the number in his phone, saves it, and then doesn’t call.\nHe goes to the studio and spends the day sketching and filling in his outlines and trying his best to make oil paints work the way his imagination tells him they should work. He gives up and goes home and doesn’t text or call, and the next day, he goes back to the studio and does his best but oils are the worst. Stiles still doesn’t text or call.\nAnd then he goes back to work on Monday and Derek doesn’t come in. He doesn’t come in on Tuesday, either, or Thursday, or Saturday, or Monday again.\nAnd now things are just awkward.\n*\nOn the Tuesday, though, Erica smacks him upside the head and snaps, “You didn’t call.” Candy gets angry, growling at her, and her cats, perched on her shoulders, all hiss back.\nStiles stares at Erica, hoping to avoid an all-out ghost brawl, rubbing the back of his head. “Ow. What? Ow!”\nShe glares at him, hands on her hips. “You know what I mean!”\nStiles scowls but his best scowl has no effect on her. Finally, he sighs, shoulders slumping. “I didn’t call. I didn’t know what to say. I thought he’d come in and we’d talk and I could ask him what the fuck he was thinking, if maybe the tequila had some sort of debilitating effect on his brain or something, you know? But he didn’t come back.”\n“You didn’t call. Why would he come back?”\nStiles blinks at her. He hadn’t thought of that – he should have thought of that.\n“You’re hopeless,” she hisses. “And your hot chocolate really isn’t good enough for this.”\nShe walks away and Stiles goes back to work, making the drinks she rings up, and it’s moderately busy. It starts to snow, though, and it’s cold out, so eventually, there’s nothing to do but think about how he’s basically useless at social interaction.\nSo he makes a hot chocolate and does his best to swirl the whipped cream up perfectly, finishing it with a little drizzle of chocolate, even if you usually have to pay extra for that.\nHe takes a quick picture before Erica can see, because she’ll definitely make fun of him if she sees Derek’s name carefully printed on the cup.\nHe sends Derek the picture before he can talk himself out of it.\nHe doesn’t get a response, but he really doesn’t know what he was expecting.\n*\nIt’s just past midnight when his phone lights up, startling him from where he’d slumped over in a Netflix-induced haze on the couch. He brushes popcorn off his PJs and grabs his phone.\nWho is this.\nStiles can’t help a small grin. How many baristas do you give your phone number to? he asks.\nThere’s no answer for a while, and when it comes, it just says Stiles.\nStiles deliberates what to say, because it’s becoming apparent – if not for the lack of punctuation, than for the delay in replies and the efficient use of syllables, that Derek is not a prolific typer. \nHe finally goes with, You didn’t come get your drink.\nAgain, an agonizingly long time before Derek replies. Probably cold now.\nA little, Stiles writes. If you come by tomorrow, I’ll make you a fresh one.\nHe waits and he waits and he waits and there’s no reply.\nCandy curls up beside him as he falls asleep, sinking half into his legs, and he grabs another blanket to ward off the chill.\n*\nStiles isn’t sure what to expect the next day, but Derek (and his wolf) come in an hour into his shift. He looks awkward and uncomfortable and like he’s looking anywhere but at Stiles’ face.\nStiles can’t help beaming at him anyway. He can feel a flush high on his cheeks.\n“Derek!” he says. “Hi! I didn’t know if—just a sec!”\nHe whips up a hot chocolate and hands it to Derek with another wide grin and a wink. He’s so ridiculous.\n“Hey,” Derek says, after an awkward pause. Stiles bounces on his heels. Derek takes a cautious sip of his hot chocolate and now he’s got a whipped cream moustache.\nStiles wants to lick it off.\nHe covers his eyes with his hands and can’t help a horrified giggle. “I’m sorry – oh god, I am sorry, about Boyd’s birthday, and about not calling, I got all awkward and –”\n“It’s okay,” Derek says. He looks very serious, but the whipped cream moustache is ruining it.\nThere’s an awkward silence and Derek salutes Stiles with the cup and looks like he’s going to go find a table and that’s the worst, Stiles doesn’t know how to fix this, but babbling isn’t doing it.\n“You guys make me sick,” Erica says suddenly, pushing in front of Stiles. A little parade of cats scampers at her heels. “Stiles, Derek thinks you’re cute. Derek, Stiles has been lusting after you for weeks. I can smell it, I’m sure you can too.”\n“Hey, hey,” Stiles cries. “That’s a bit much, I don’t smell, I shower regularly, thank you very much, and –” He blinks and glances at Derek who is glaring at Erica and steadily turning red. “You think I’m cute?”\nDerek grinds his teeth and doesn’t look away from Erica, who says sunnily, “He wants to ask you out for pizza. Probably tonight, after work.”\n“You do?” Stiles squeaks.\nDerek doesn’t look at him.\n“He does,” Erica chirps. “I told him you’re off at seven and live on pizza.”\n“I do,” Stiles says, nodding seriously. “I do live off pizza.”\nThere’s another awkward pause and this time, Erica just watches impatiently until Derek cracks, clearly reluctant as he turns to look at Stiles. “Stiles,” he growls. “Do you want to go for pizza after you’re done work.”\nHe doesn’t inflect any of it, it’s amazing.\n“Why, I would love that,” Stiles says solemnly, politely.\nDerek’s entire body relaxes. “Okay good,” he says. And then he turns and walks away, back to his regular table. \nErica pats Stiles on the shoulder. “He’s bad with people,” she says.\n*\nStiles finishes his shift in a haze of shaky hands and nerves. He keeps telling himself that it’s just pizza – no big deal, so low maintenance, basically barely a date, but his heart doesn’t care.\nHe takes his time cleaning up after his shift, checking and rechecking everything he’s responsible for and dragging his feet until Erica snaps her teeth at him and shoves him out the door.\nIt’s snowing lazily – fat, slow flakes meandering down to the ground. Derek’s waiting, his shoulders hunched against the chill, hands shoved into the pockets of his leather jacket. The wolf is pacing, staring up at the snow, eyes squinting. Her tail is wagging a bit, and sometimes, she pounces like she can catch the falling flakes. Her paws go right through them.\n“Hey,” Stiles says, shy, as he tugs his mittens on. “I didn’t know you were waiting.”\nDerek shrugs, not looking up from his shoe. “It’s fine. My car’s a few blocks away.”\n“Cool,” Stiles says, feeling a bit awkward. Derek nods and turns to lead the way and Stiles follows, slumping into strained silence. He tries to think of something, anything, to say, but comes up blank.\n“What’s your favourite colour?” he asks finally.\nCandy bounds ahead of him, dashing through the dusting of snow without leaving prints, and tackling the wolf to the ground. Stiles grins a little as the wolf gives into puppyish instinct and chases the ridiculous golden retriever into the darkness, circling around them.\nDerek shoots Stiles a quick look, his mouth quirking with amusement. “Blue,” he says.\n“A classic. Nice. I like —”\nStiles cuts himself off with a yelp, stumbling as a blur of shadow and ghostly fur dashes by his feet, circles around him, before leaping up and scaling his leg. He’s so off balance that he nearly falls, but Derek catches him with a hand on his wrist.\n“S-sorry!” Stiles stammers. It’s hard to focus with a ghostly squirrel dashing down his arm and across Derek’s, hopping up and down on Derek’s shoulder. “Clumsy.”\n“You okay?”\nStiles nods and Derek keeps walking, without letting go of Stiles’ arm, like he’s worried Stiles will trip again. It’s embarrassing, but it also means a bit of physical contact, so Stiles is okay with it. \nHe tries to shoo the squirrel, but it’s pretty frantic and determined to keep Stiles’ attention.\nGhosts usually only seek him out when they need his help to finish their unfinished business. And apparently this ghost cannot wait until after Stiles’ date.\n“My favourite movie is Jaws,” Derek says somewhat grimly. “And I like apple crisp for dessert. I’m studying English lit. I want to be a teacher – elementary school.” He looks at Stiles, eyes narrowed, like waiting for judgement. “I’m good with kids. Hemingway’s my favourite author because he doesn’t waste time with adjectives. I make people nervous — you sound like your heart’s going to beat right out of your chest.”\nStiles looks up at him, startled and guilty. His heart is running a bit fast right now, it’s true, but it’s not because of Derek. It’s because a ghost squirrel seems determined to trip him and keeps scaling him like a tree and Stiles has been frantically waving his free arm around in an attempt to get the distracting animal to back the fuck off. Candy has circled back, caught sight of the squirrel, and keeps launching herself through Stiles’ chest in an attempt to catch it.\n“Hemingway’s great,” Stiles says belatedly. “Love Hemingway. And you’d be a great teacher. I’d let you teach my kids any day of the week.”\n“Do you have kids?” Derek asks, still looking suspicious. Stiles does his best not to react to the spirit squirrel that’s currently glaring from the top of Derek’s head.\n“No,” Stiles says. “But if I did, I’d totally let you teach them.”\nThey keep walking. The squirrel is flopping on Derek’s shoulder now, eyes wide and pleading. Candy looks like she’s plotting the easiest way to scale Derek, and the wolf is watching judgingly from the side. \nStiles is busy -- he needs to eat pizza and flirt awkwardly with Derek.\n“Do you want them?” Derek asks.\nIt takes Stiles to remember what they’re talking about. Kids. Right. “Yeah,” he sighs. “I do.” He imagines little Dereks and Stiles running around in a cute little house in the country, with a ghostly golden retriever galloping at their heels and then he wonders if squirrels should be hibernating in winter, and how long this one had been dead and how it knew Stiles would be able to see it and if there was a nest of baby squirrels somewhere, slowly freezing to death.\n“Can we cut through the quad?” Stiles asks suddenly, because that’s the direction the squirrel came from – the dark expanse of treed greenspace in the middle of campus, currently snowy, unlit, and a little ominous.\n“My car’s that way,” Derek says, pointing in the opposite direction.\n“But a walk through the quad would be nice. Wouldn’t it? Dark. Snowy.” He gestures wildly. “Trees and stuff.”\n“Uh. Sure.”\nThey turn down the path into the quad and the squirrel bounds away in front of them, leading Stiles deeper into the shadows. \nStiles sighs again and follows.\n*\nIt’s not a nest of baby squirrels. It’s not a kid down a well. It’s not anything at all that Stiles feels like anybody should care about.\nBut apparently a walnut partially buried in the snow only a few feet away from a dead squirrel’s winter stash of nuts warrants unfinished business for a squirrel.\nAnd now Derek thinks Stiles is nuts after watching him ceremoniously dig up the freaking walnut and shove it into a hole in the tree.\nThe squirrel dashes around triumphantly before winking out in a small flare of light, unfinished business managed, and the wolf watches it all, eyes narrow, glaring at Stiles with something calculating in her gold eyes. Candy looks absurdly disappointed that she never managed to catch it.\n“Well!” Stiles declares, dusting the snow off his knees. Derek looks like he’s regretting all the decisions that led him here, digging up walnuts in the middle of the quad. “Shall we get pizza? I’m famished!”\n“Sure,” Derek says slowly. “Sure we can.”\n*\nStiles is hanging half upside down off his bed, phone pressed to his ear, eyes squeezed tightly shut, and Candy, used to these shenanigans, is patiently ignoring him.\n“Allison is going to be so excited that you went on a date,” Scott says brightly. \n“A terrible date. He’s probably never going to call me again.”\n“Don’t be negative. It’s possible. I mean, you said the pizza was good, right? So that’s a plus.”\n“The pizza was good,” Stiles agrees, solemn. “But the digging around in the snow after a walnut sucked. Plus, I think his wolf is haunting me. I swear, she followed me home. That’s weird, Scott. They don’t do that, not unless they want something. And how does a guy get a wolf to love him enough to stick around? That doesn’t make any sense.”\n“Probably just a dog.” Scott sounds far too jovial for the shittiness of this situation. “I think you’re losing the big picture here. You haven’t had a date in nearly a year, Stiles. Any date is better than no dates.”\n“But I wanted this to be the best date. He’s so fucking cute, Scott. He growls all the time. He can’t even make eye contact for longer than half a second, and then he starts blushing and stuttering and it’s adorable. He makes my stomach hurt. I barely even know him – all I know is that –”\n“He likes blue and Hemingway and Jaws,” Scott recites. “He listens to classic rock. He refuses to talk about his family. He has the face and body of a Greek God. You told me. Six times.”\n“We could go on a double date,” Stiles says wistfully. “That way, you could cover for me the next time a psychotic dead squirrel decides to drag me off to rescue a walnut it died before stashing away for the winter.”\n“I would totally cover for you,” Scott says, ever the loyal best friend. “But first, you’ve got to convince him to go out with you again. Maybe something with less pressure. Neither of you seem to react well under pressure. Maybe a group thing — you should bring him to Allison’s birthday party on the weekend!”\nIt’s a terrible idea, for so many reasons. He can’t imagine that throwing Derek into a crowded room with all his high school buddies is going to do wonders for Derek’s inability to deal with people, for one. For two, Allison’s birthday party is being held at a roller rink.\nBut Stiles is smitten. And the idea of roller skating in circles under the light of a disco ball to the beloved musical stylings of the BeeGees holding Derek’s hand is too much to pass up.\n“That is amazing,” he says.\n*\n“No,” Derek says, appalled.\n“No, right, of course, it was a stupid idea,” Stiles says right away. And then be bites his lip and tries not to look rejected and hurt but he’s got a very expressive face, okay?\nAnd Erica hisses softly from where she’s mixing up a latte.\nDerek grimaces. “Well. Maybe,” he says.\nIt’s going to be amazing.\n*\nStiles is a terrible roller skater. And it’s made so much worse by Derek’s wolf, who seems somehow determined to get Stiles to react to her. He doesn’t know what she wants from him, but if she doesn’t stop stalking him and jumping out at him when he least expects it, he’s going to have a heart attack. He’s already jumped and yelped and nearly tripped over his own feet half a dozen times and they’re still lacing up their skates.\nWhat if she does it while he’s out there, trying to skate in sedate circles like he’s got any sort of grace at all? He’ll fall. He’ll break his neck. He already feels like he’s on probation with Derek, who is in an entirely different league than Stiles. They may as well be playing different sports.\nDerek is major league baseball and Stiles is tossing beanbags in his backyard. That’s the discrepancy here.\nAnd yet, somehow, Stiles has landed himself a do over after that disastrous squirrel fiasco, and he’s determined to do better this time.\nDerek is glaring down at his rented roller skates like they have personally offended him.\nStiles takes a deep breath, reminds himself to be cool, and then stands up, wobbling a little and abruptly remembering that he is the worst roller skater in history. Shit.\n“This is going to be amazing,” he says grimly. He starts carefully trekking his way to the skating ring.\nDerek looks skeptical but follows him. He is, of course, as graceful as ever. “Are you sure you can do this?” Derek asks. \n“I’ll be fine,” Stiles says brightly. “So long as nothing jumps out and scares me and makes me fall over — ” he shoots a quick glare at the wolf pacing innocently along beside him. “I’ll be good.”\nHe is not good. He hugs the walls, gritting his teeth, struggling with his centre of gravity, with his balance, with forcing himself to go any faster than a dignified shuffle. \nDerek paces him, skating backwards, offering concerned advice that Stiles isn’t skilled enough to follow. Every now and again, Scott or Allison zip by, holding hands and laughing, followed by their friends, all effortless and graceful and dancing on their skates.\nIt’s humiliating.\nAnd then Derek holds out his hands and says, a little shyly, “Here. Hold onto me. I’ll help you.”\nAnd that’s… not the worst way this could go.\nSo Stiles takes his hands and expects Derek to steady him, maybe coax him away from his aggressive lean on the wall.\nInstead, Derek starts speeding up, still skating backwards, dragging Stiles quickly away from the wall and into the crowd, somehow managing to avoid colliding with anybody and making the entire thing look just as easy as anything else.\n“Keep looking at me,” Derek coaxes. “Trust your body. I won’t let you fall. You’ve got this.”\nLooking at Derek is just about the easiest thing to do, and once he stops focusing so much on the imminent feeling of being about to fall and brain himself on the floor, his body relaxes and his balance levels out a little bit. It’s easier to just let Derek tug him along.\nDerek smiles, slow and pleased, and his eyes light up. “You’re doing great,” he says, and Stiles grins back, his stomach all fluttery and his cheeks all blushy.\nAnd then Derek’s fucking wolf jumps through Derek, straight at Stiles.\nStiles shrieks in terror and jerks backwards, pulling his hands free. His feet fly up from under him and he soars backwards, landing hard on the ground, his helmeted head smacking on the floor, the breath knocked from his lungs.\nAnd the wolf stands on his chest, her paws sinking straight through his rib cage, her eyes flaring gold, staring down at him accusingly, with far too much human awareness.\nIn the end, the only thing that prevents Stiles from becoming a safety hazard to the other skaters having to frantically detour around his sprawled, ungainly body on the floor, is Derek.\nHe scoops Stiles up after ensuring he doesn’t have a neck injury, apologizes half a dozen times for letting him fall, and skates him out of the ring, all without even straining to hold Stiles’ weight.\nStill trying to catch his breath, Stiles just clings to Derek’s well-muscled and beautiful shoulders, keeps his eyes clenched shut to block out his humiliation, and goes along for the ride.\nWhen he can finally breathe again, his skates and helmet are off, and he and Derek are sitting in a booth in the concession area in just their socks, and Derek is running his hands all over Stiles’ body, looking for broken bones. He’d bought Stiles a blue raspberry slurpee and it’s sitting untouched on the table, a growing ring of condensation around the cup.\nCandy hovers protectively halfway through Stiles’ shins.\n“Dating is so awkward,” Stiles moans, closing his eyes.\nDerek sits back, hands to himself now, and says, “We’re dating?”\nStiles looks at him, a sick lurch in his belly, and says, “We’ve gone on one and a half awful dates, haven’t we? These are dates. Aren’t they dates? Oh god, if they’re not dates, I am going to be so embarrassed. I mean, I didn’t think we were ‘dating’ but having gone on more than one date, technically we have gone on dates – right? But of course we’re not dating, why would you ever date me, I’m a mess—”\nDerek stares like he doesn’t know where to start, and then interrupts, saying, “But I would. I mean. I am. Dating you. Or, I’ve… gone on dates with you.” He frowns, eyebrows looking particularly intimidating, and then shrugs, looking away. “It is awkward. I’m…”\n“Not good with people,” Stiles finishes.\nDerek grimaces. “Yeah.”\nIt’s quiet for a moment, and Stiles doesn’t know where to go from here. He takes a sip of his slurpee and thinks it over. Finally, he offers, “Well, I’m not good at… pretty much anything else.”\nDerek smiles a little. “You’re pretty bad at roller skating,” he agrees.\n“So maybe… maybe we’re a pretty good match.”\nDerek’s smile grows hopeful. “I think so,” he says.\n“So maybe we should get to know each other. See if we like each other.”\n“I already like you,” Derek says, quickly, like he’s speaking without thinking.\nStiles’ eyes go wide. His heart skips a beat and his breathing goes wobbly and he’s so beyond ridiculously smitten. “Why?” he asks, trying his best to sound appalled. “I’m weird and awkward and accident prone and—”\n“You smell good,” Derek says, face growing steadily pinker. He continues on, grim and determined. “Like sunshine. And summer. Even though it’s winter. And I like your — your face.” He stops there, horrified, eyes wide and dark, and says, “Fuck, sorry, that was stupid, I’m just –”\n“Bad with people,” Stiles says softly, sliding closer on the cheap plastic hair. Derek looks so angry with himself. “I know. You’re doing fine.”\nDerek looks at him, helpless, apparently bad with words and with people too, but honestly, Stiles doesn’t think he’s doing too badly here.\n“I think I like you too,” he says, a little nervous. “Maybe we should just –”\n“Skip this part?” Derek asks, and Stiles was going to say play Never Have I Ever to get to know each other better, but hey, he’s totally on board with skipping this awkward part, especially if it means Derek sliding his hands through Stiles’ hair and tipping his head back and kissing the breath out of him.\nDerek is much, much better at this than he is with words.\n*\n“I’m hyperactive and I can’t sit still,” Stiles says, casual. His licks his lips and shoots Derek a quick look. His face is stinging a little from Derek’s stubble and Stiles wants to rub all over him.\n“I don’t mind,” Derek says, nodding once. They’re sitting in Derek’s Camaro, idling at the curb outside Stiles’ dorm.\n“Good. Good. It’s just… my roommates cared? I had three of them, first year. Not all at the same time, but I kept getting switched. Apparently it’s hard to study or sleep or whatever when your roommate won’t stay still. And talks in his sleep. Which is why, you know.” He swallows and says, oh so casually, “I have a room to myself.”\n“Oh,” Derek says.\nStiles lets out a tight breath and adds, “I mean, if you want to come up. And see it. And, I don’t know. I have a kettle, and some hot chocolate powder, and—”\nThe car’s off and Derek’s out of the car and opening Stiles’ door for him three seconds later. \n“Yeah,” he says, as Stiles climbs out, heart thumping. “I mean. Hot chocolate. Definitely.”\n“Marshmallows too,” Stiles says, a bit breathless and suddenly in a hurry.\nScott had, after all, finally skated his way to their booth and laughingly informed them that they ought to get a room. Luckily, Stiles already has one.\nIt takes a while to make it to Stiles’ room, because they make out in the stairwell for a little while, because getting to know each other is tough, but this is easy – playful kisses between breathless bouts of laughter and hands everywhere.\nHe’s a little worried, as they finally fall onto his narrow bed, that this is too much, too fast. He’s not really one for hook ups, and he’s pretty sure that’s what this is. But it’s hard to hold onto those worries when Derek’s nipping at his shoulder and his collarbone and the side of his neck like he’s showing Stiles exactly what he likes about him, filling in with kisses where the words stopped working.\nSo, yeah. Stiles doesn’t make the hot chocolate. \nThey fall asleep, tangled up together.\n*\nStiles wakes up abruptly in the middle of the night, overheating and confused. It takes a few moments to figure out that it’s because Derek is pressed all up against his back and he’s radiating heat, and once Stiles figures that out, he relaxes into it with a sleepy murmur. He doesn’t even need the extra blanket, even with Candy’s chill pressed up against his chest.\nBefore he can fall back to sleep, though, he feels eyes on him, and squints into the darkness of the room.\nIt’s the wolf. She’s sitting tall across the room, golden eyes fixed on Stiles, body held very, very still.\n“He’s fine,” Stiles mumbles, patting Derek’s shoulder. “I got him. I won’t hurt him. Promise.”\nThe wolf keeps staring for a long, pointed moment, before she carefully lowers herself down, head resting on her primly folded paws. She closes her eyes and Candy slides off the bed, edging closer to her, gradually, until they’re sleeping pressed together. Stiles finally manages to drift back to sleep.\n*\nHe’s pretty sure Derek will be gone in the morning. That’s what hookups do.\nSo when he wakes up to Derek nuzzling and snuffling against the back of his neck, he lets out a tense breath and hides a smile against his pillow and snuggles back against his chest and wonders what this means.\nAnd then his stomach grumbles.\nDerek sits up quickly. “You’re hungry,” he says. “I’ll get you something to eat.”\nHe’s up and tugging on his pants before Stiles can get his mouth to work well enough to say he’d rather more snuggling.\n“And coffee,” Derek mutters to himself on his way out the door.\nThe wolf stays. She’s staring again, head cocked, like she’s trying to think. She’s nearly frowning.\nStiles frowns back and her eyes narrow. It’s altogether too human a response – in fact, Derek’s wolf doesn’t act very wolfly at all.\n“Can you…” he starts, and the wolf gets to her feet, taking a step forward, almost impatient, when he trails off. So Stiles says quietly, “You can understand me.”\nShe holds eye contact for a long, charged moment, and then she nods.\n“Holy shit.”\n*\nDerek comes back with too much food and they have a picnic on the bed.\n“I thought maybe you’d be gone when I woke up,” Stiles confesses as he shoves an entire croissant into his mouth.\nDerek freezes with a spoonful of yogurt in one hand. “Did you want me to be?” he asks.\n“No! I just. I usually don’t do this – I mean, I’ve done it, obviously. Both the sex and a few hookups. It’s just that hookups aren’t really my thing. They make me, uh. Sad?”\nDerek licking yogurt off a spoon is obscene. He swallows and says, “I only do this with people I like.” He shrugs, looking away shyly. “If I don’t have that emotional connection, I just… have no interest. So.”\nStiles feels his cheeks going pink and he smiles, ducking his head. “Okay,” he says. \n“Okay.”\nThere’s silence for a few minutes, but it’s not the awkward kind, and then Derek says, “If it makes you feel better, you can interrogate me again. Get to know me. I don’t mind.”\nStiles beams at him. “Oh man, okay. What’s your favourite animal?”\n“Sea otter,” Derek says easily.\n“Because they old hands when they sleep so they don’t drift away from each other?” Stiles asks excitedly.\nDerek laughs. “They’re just cute. That’s all.”\nStiles glances at the wolf. She’s lying there watching them, the picture of relaxation, sprawled out on her side, Candy curled up with her.\n“Oh,” he says. “Not wolves?”\nDerek shoots Stiles a quick, narrowed-eyed look, and then says, “No? Why would they be?”\nThe wolf doesn’t seem hurt by it, at least, but Stiles still thinks it’s weird.\n*\nHe’s still got a bit of beard burn on his face when he goes to work that afternoon, and Erica mocks him relentlessly.\nHe can’t help being a little smug and pleased, so he doesn’t mind too much.\nIt’s especially cool when Derek comes by to get a hot chocolate right at the end of Stiles’ shift, conveniently timed to drive him home.\nAnd things fall into a pattern – a sweet pattern that makes Stiles stomach hurt with butterflies and his anxiety spike as he waits for something to go wrong, because it has to go wrong. It’s all too easy, too good to be true.\nHe splits his time as best he can between work, Derek, sleep, and somehow dragging himself to class and to his studio to work on his term project for the gallery show just before Christmas.\nAnd the wolf keeps her eyes on him constantly, like she’s Derek’s guard dog, making sure Stiles stays in line. He’s just glad she’s stopped trying to get his attention, like she was trying to prove he could see her and now that she knows he can, she’s just watching, relaxed and attentive, always lurking.\nAnd Derek stays just as sweet and doesn’t get bored or annoyed with Stiles, no matter how many hours they spend watching Netflix together or watching shitty cover bands and dancing together, no matter how many awkward double dates with Allison and Scott that Stiles drags him to. \nAnd things are good. And Stiles starts letting his guard down. Derek has gotten to know him and somehow still wants to be with him and maybe this is all going to work out.\n*\n“Your dad told my mom to tell me to tell you that he’ll kill you if you skip Christmas to stay here with your new guy,” Scott says solemnly. There’s a grin lurking around the edges of his mouth though.\nHe’s helping Stiles hang up his art in his section of the gallery, carefully levelling a chaotic sketch of a phantom stampede outside a slaughterhouse.\nStiles sighs. “I know. It’ll just be tough, you know? What if I go home for the month and come back and Derek’s forgotten all about me?”\n“You’re not very forgettable,” Scott tells him. “It’s not going to happen.”\nStiles isn’t so sure. “It could, though.”\n“Your dad also told my mom to tell me that if you’re that worried about Derek’s memory, you should invite him home with us. We’re pretty memorable.”\n“I totally would! You know I would. That would be amazing. But I’m pretty sure he has plans with his own family.” \nScott looks at him sideways. “Christmas break starts in three days,” he says. “Shouldn’t you know his plans?”\n“I’ve avoided bringing it up,” Stiles confesses. “But he hasn’t said anything either! I just assumed…” but now that he thinks about it, Derek’s never mentioned a family at all. What if he doesn’t have anywhere to go? Maybe Stiles should invite him to Beacon Hills? Sure, it would mean an interrogation from Stiles’ dad, but maybe Derek wouldn’t mind…\nStiles doesn’t have too much time to mull it over. The gallery doors will open for the show in forty minutes and he’s barely even started hanging up his work, so he forces himself to focus. He’s displaying a bunch of what he’s been working on, linked in terms of subject matter but stories told in mixed media. He’s got a few rough sketches, some pastels and water colours, even one oil painting that turned out decently, and a bunch of digital animation pieces, all depicting scenes of ghostly, unseen animals.\nHe’d first gotten interested in art as a way to show his mother the world as he saw it – Candy’s spirit playing in the garden, curled up at the foot of her hospital bed. She’d hung them all up in her hospital room, even the ones that were so bad, the animal’s species was impossible to guess.\nAfter she was gone, he kept drawing.\n“It looks amazing,” Scott says, after the last piece is hung. He gives Stiles a quick hug. “Good luck. I’d love to stay, but I’ve got dinner with Allison’s family.” He wrinkles his nose. “Pray for me.”\nStiles laughs and Scott takes off, and then there’s nothing to do but sip a complimentary glass of champagne to soothe his nerves and wait for the doors to open.\n*\nStiles is halfway through an interview with the Campus Chronicler, trying to explain the story behind his ghostly animal art, when Derek shows up, looking adorably snow-dusted and cold. He waves awkwardly at Stiles as he hovers, waiting for him to finish up, and Stiles grins back.\n“One sec,” he says to the girl interviewing him. He bounces over to Derek, kisses him really quickly, and says, “I’ll be finished in a minute, come check out my stuff, I’m so glad you came, my dad wants me to bring you home for Christmas so he can meet you!”\nHe flashes another bright smile and, while Derek is still looking like a deer caught in particularly obnoxious headlights, he gets back to his interview, waving his arm grandly as he says something particularly brilliant about the overlapping of life and death in his images, and how the echo of the animals who love us last far after they are gone.\nFive minutes later, the interview wraps up, and he spins on his heel to find Derek, hoping he hadn’t scared him off by dropping that whole Christmas/meet the family disaster at his feet.\nHe finds Derek standing stock still, pale, eyes dark, looking… well, looking like he’d seen a ghost.\nHe’s staring at the sketch Stiles had done just last week, the one of Derek, dusted in snow and reading at a corner table by a window at the coffee shop on a snowy night. His wolf is curled up around his feet, her head gracefully resting on his shoe, her eyes wide and staring straight out of the paper. It was all black and white shades of charcoal, but he’d carefully coloured her eyes in bright gold.\n“Derek,” Stiles says, voice cracking a little, uncertain. He should have shown Derek before, but he’d forgotten. It had been so stressful, so rushed, getting ready for the show. He’d been so infatuated with the lines of that picture, with how carefully he’d captured the slope of Derek’s shoulders, the hair curling at the back of his neck, the graceful lines of the wolf, ever vigilant and close.\nEven now, she circles Derek’s legs anxiously, staring between him and Stiles like she expected Stiles to somehow fix this.\nDerek reaches out with one hand and, just before his fingers brush the charcoal wolf, he lets them fall. He turns to Stiles, and he looks broken.\n“What are you?” Derek whispers. He’s so pale.\n“What do you mean? You know who I am. Listen, just let me explain—”\n“Are you a hunter?”\n“I’m not a hunter. I’m a vegetarian, I don’t hunt! Just listen to me, just let me explain.”\nHe reaches out, desperate to touch Derek, to shake that stunned, broken look off his face, and Derek jerks back.\n“Don’t,” he says coldly. “Don’t touch me. I shouldn’t have – stay away from me. And if I find out you had anything – anything to do with any of it—”\n“I don’t know what you’re talking about,” Stiles says, shaking. “Please, Derek.”\n“Just stay the fuck away from me.”\nDerek shoves passed him, storming out of the gallery, and Stiles stares after him, stunned. It hurts to breathe, he wants to cry, he has no idea what the fuck just happened, and people are staring.\nHe turns away, desperately blinking back tears and calls Scott, hands shaking nearly too hard to hold his phone.\nScott answers and Stiles says with a shaky, broken giggle, “I don’t think he’s coming home with me for Christmas, Scott.”\n*\nStiles tries calling Derek and there’s no answer, so he texts him, limiting himself to only three before giving up. The next morning, after class, he takes the bus to Derek’s place, but the car isn’t in the driveway and Derek isn’t home. So he goes to his studio to work on his final project for his oil paint class.\nCandy’s trying to cheer him up, chasing the balled up pieces of paper he tosses towards the garbage and then looking confused when she can’t catch them and bring them back to him. Stiles calls her a good dog, but it still doesn’t help.\nHe’s trying to paint a simplistic landscape – trees, mountains, water. A Bob Ross special. But his trees are too straight and his mountain is the wrong shade of gray and his water looks like an accident in shades of blue. Trying to fix it while distracted and emotional and anxious is not the best idea, and by midnight, he’s pretty much destroyed the canvas and given up. He’s the only one there, everyone else probably already home for the holidays after the big gallery show. Stiles would be long gone by now if he didn’t have to work tomorrow.\nBut his canvas is a disaster. His life is a disaster. And as the day approaches midnight, he falls back into the floor with a moan, flinging his arms up over his eyes, and breathes for a moment.\nThat’s when he feels eyes on him, and Stiles slowly turns his head to look.\nIt’s the wolf. He doesn’t know when she got there or why, but she shouldn’t be there at all. Ghosts haunting people rarely wander off to visit someone else, as far as he can tell. She had stayed near him a few times when Derek had left the room, but she’d never sought him out.\nBut there she is, pacing the far wall, eyes fixed on him, agitation in every step. For the first time, instead of running to greet her, Candy stays close to Stiles, nuzzling against him.\nStiles sits up and rubs at his eyes with the back of his arm. He hadn’t even realized he’d started to cry.\n“What are you doing here?”\nShe stops pacing and takes a step towards him, hackles raised.\n“Derek’s okay… right?”\nShe steps closer.\nHe’s pretty sure she’d be more frantic if Derek were in some sort of danger. Stiles pulls his knees up and looks at her for a moment and then says quietly, “You’re trying to tell me something? You aren’t like any ghost I’ve ever seen. What do you want?”\nHer eyes narrow, she bares her teeth, and then, after a long moment, when her disgust is clear, she throws back and howls. Stiles doesn’t hear a thing.\n“What I need,” he says, exasperated, “is a Ouija board.” He snorts. “If only wolves knew how to spell.”\nBut the wolf goes nuts. She leaps up and dances around in a frantic circle, she nods her head wildly, she seems to bark at him, snapping and snarling, and there is no way a wolf knows how to spell.\nBut Stiles still finds himself tearing sheets out of a sketch book with A, B, C, D written on them in sharpie. When he’s got the whole alphabet, he fans them out, and then looks at her skeptically.\n“Okay. If there’s something—”\nShe carefully, deliberately puts her paw down on the L.\nStiles sucks in a breath but carefully writes it down. She waits until he looks up again, and then she goes to the A, the U, the R, the A.\nStiles dutifully writes it all down. \nLAURA.\n“Huh,” he says. “That’s a strange name for a wolf. I’d have called you Loki, or Lupa, or White Fang or something thematically appropriate.”\nHer paw lands hard on the I. Stiles keeps writing.\nIDIOT.\nHe stares down at the paper and then up at the wolf. “That’s just rude,” he tells her.\nShe grins and slowly fades away.\n*\nStiles waits for the wolf to come back all night, and he’s exhausted when he gets home and collapses into bed. Candy crawls in with him, pushing up close until she’s partially through him and he grabs his spare blanket to ward of the chill and cries into her translucent fur.\nHe’s up bright and early the next morning for his last shift at the coffee shop before heading home for Christmas. Next thing he knows, he’s tying on his apron and taking his place behind the espresso machine and Erica is glaring daggers from him as she takes down the chairs. Her phantom cats are all lashing their tails and watching him suspiciously.\nShe does not speak a word to Stiles until mid-morning near the end of his shift, during a lull between the morning crowd and the lunch crowd. Then, she corners him by the fridge and says coldly, “You were supposed to be easy and uncomplicated.”\n“Excuse me?” he says, trying to edge past her. She doesn’t let him go.\n“A simple, pretty kid from the coffee shop who talks too much, who wants to be an artist when he grows up, who makes a decent hot chocolate and the occasional dirty joke. Someone sweet and uncomplicated and trustworthy so that Derek could finally get over his fucking issues. And you fucked that up, Stilinski.”\nStiles blinks at her, mouth open but unable to find the words. “I don’t know what I did,” he says finally, miserably.\n“What you did,” she echoes mockingly. “What are you?”\nDerek had asked the same thing. “What does that even mean?” he asks, frustrated and blinking back exhausted tears. “I don’t know what you want to know.”\n“And if you had anything to do with what happened to Laura—”\n“Laura,” Stiles says, eyes going wide. “You know Laura?”\nErica stares at him suspiciously, searching his face, and Stiles doesn’t know what she sees, but she frowns. “His sister,” she says. “Older. They lived together until last year, when she went home. She was killed.”\n“Sister?” he asks weakly. “Did Laura—did they have a dog? Or a… a wolf. Is that why he got so upset at my picture?”\nErica hesitates for a moment, searching his face and frowning, uncertain. “You know it’s not a dog,” she says. And then, after a moment, “Don’t you?”\nBut Stiles doesn’t know anything anymore. \n“I have to go,” he says, untying his apron. “I’m driving home with my friend Scott early tomorrow, I won’t be back until after Christmas break. If you see him, tell him I’m really, really sorry, and I can explain everything. He just needs to call me back, okay?”\nHe shoves his apron on its hook and dashes out the backdoor before she can say anything. Candy snaps her teeth at Laura and then follows.\n*\nThe universe does not want Stiles to have a good Christmas. \nIt’s the only explanation for the three feet of snow that gets dumped that night and keeps Scott and Stiles from being able to make the trip home.\nScott quickly makes alternate plans to spend Christmas Eve with Allison and then Christmas Day with her family, and Stiles is invited (probably out of pity), but he tells Scott not to worry about it, pretends he took a last minute shift at work, and sits in his tiny dorm room and mopes.\nHe Skypes with his dad for a while, while he and Melissa make a big show of drinking mulled wine and wrapping gifts that Scott and Stiles won’t get until the day after Christmas, if they manage to clear the highways enough to get out of this god forsaken winter wasteland of a state. They sing Christmas carols and they get progressively more intoxicated, and they’re clearly trying to force a little bit of Christmas cheer through the screen to share with Stiles, but it’s not working.\nWhen Rudolph comes on and they turn the camera to the TV so he can watch with them, he pleads exhaustion and closes his laptop.\nThe sudden dark and quiet is incredibly depressing.\nHe feels like Harry left at Hogwarts.\nHe plays candy crush for a while, and then spins his phone in his hands for a bit as he fights the urge to call Derek again. Derek clearly has better things to do than hang out with Stiles on Christmas Eve.\nStiles sprawls on his back, staring up at the ceiling above his bed, and presses his fists to his eyes. It’s not even dinner time, but he’s exhausted and sad, so he closes his eyes and lets himself fall asleep. Candy paces the room, sad and worried.\nIt’s the worst Christmas Eve ever.\n*\nStiles wakes in the middle of the night with the uncomfortable sensation that he’s being watched. \nHe sits up, flailing and kicking at his blankets, and when he’s finally free of them, he yelps when he sees faint, glowing golden eyes in the corner of his bedroom.\nUsually, when he’s visited by a ghostly apparition in the middle of the night, they aren’t so freaking creepy.\nIt’s Derek’s wolf, Laura, he sees a moment later, when she slinks out of the shadows and steps into the streetlight spilling through the window, making her edges go a little hazy.\nStiles rubs at his eyes. “What is it?” he mumbles, voice sleep-slurred. “Derek trapped in a well?”\nShe bares her teeth and then gracefully turns, steps towards the door, and then looks back impatiently, clearly wanting him to follow. \nThe last time Stiles followed an animal into the dark in the middle of the night, it was a ginger cat who brought him to a ditch a few streets over, where he’d found her body after she’d been hit by a car. It was one of the more gruesome experiences he’d had, but he had carefully collected the cat’s collar and returned it to the house listed on the tags. Apparently they’d been searching for Marmalade for three days, papering Beacon Hills with Missing posters, and they’d been crushed at the news, but appreciative that at least now, they knew what happened.\n“Wait,” Stiles says, stumbling out of bed. “Is Derek trapped in a well? I mean, hurt? Does he need me? Did something happens?”\nLaura looks at him, impatient, and Stiles takes that as a yes.\nHe fumbles with his jeans, a sweater, his puffy winter hat, he jerks his toque on his head and shoves his hands into his mittens, and hurries out the door, following the wolf down the hall. Candy pads along supportively behind him.\nIt’s freezing out and snowing again, and so late that the buses aren’t running. Derek’s place is only a twenty minute walk, though, and if he goes fast enough, he should be able to keep himself warm. The wolf doesn’t seem inclined to wait for an Uber.\nThe streets are empty and the night is hushed. Stiles starts humming Silent Night to himself just to break the silence.\nHe worries about a lot of things as he walks. It helps him ignore the stinging in his cheeks and on the tip of his nose, the numbness in his toes.\nHe worries that Derek has hurt himself and there’s no one around to help. He worries that Derek is alone and sad on Christmas, so sad that Laura got desperate enough to seek out Stiles, the person Derek probably wants to see least, to try to fix it. He worries that Derek has been the victim of a break in, or is lying injured somewhere in a car crash – though Laura does seem to be leading Stiles straight towards Derek’s little house.\nHe worries that Derek is sick and has no one to bring him soup. \nWhen he finally gets to Derek’s house, it’s after having slipped and fallen into three different snow drifts, and he’s shivering so hard, he’s worried he won’t be able to speak.\nThe house looks dark, at first, and Stiles is more worried than ever as he staggers up the front steps, reaching a hand up to knock.\nAnd then he freezes. He had pictured many possible reasons why Laura felt Derek needed him, and in all of them, Derek was alone and hurt or miserable or sad or lost.\nBut now, standing on Derek’s front step, he can see in through the living room window, and Derek’s not alone at all. The TV is on, bathing the room in muted colours, and Derek is crammed onto his couch with Erica, Boyd, and Isaac. They’re watching the Charlie Brown Christmas special, the table in front of them is littered with mugs of hot chocolates and bowls of popcorn. They’re all sleepily tangled together. Even Erica’s phantom cats are curled up and content. And Derek doesn’t need Stiles at all.\nIt’s too much, suddenly. The quiet outside, the lateness, the loneliness, the worry and anxiety that have been tying themselves in knots in his stomach since the art show two days before. The bruises on his heart that were just waiting for an official notice that Derek was dumping him to turn into cracks and broken places.\nHe makes a small noise, just a tiny, soft exhale that catches in a faint whimper in his throat, and he sees Derek’s head snap around to stare out the window.\nBut it’s dark, surely he can’t see Stiles.\nEither way, Stiles panics and stumbles back off the steps, turning to hurry away. He never should have come here.\n“That was cruel,” he tells Laura, who anxiously follows him off the steps. Candy is wandering the snowy drifts, anxious. “He’s fine. He’s good. It’s all…” he trails off and takes a deep, shaking breath that burns in his lungs, and blinks back stupid tears that will just freeze to his eyelashes anyway, and forces his numb legs to carry him across the abandoned street.\nHe freezes when he hears the door open behind him, closing his eyes and exhaling, cursing Derek and cursing Laura and cursing the snow, the darkness, Christmas, his own stupidity – all of it.\n“Stiles?” Derek asks, voice hushed a little in the soft quiet. \nStiles hesitates for a long moment, waiting for the ground to swallow him or some other sort of Christmas miracle to get him out of this, but nothing happens. It’s just him, the snow, a ghost wolf, and Derek.\nHe turns around and forces what he hopes is a bright smile on his lips. He can’t feel his face, so he has no idea how effective it is. “Derek! Hey! Sorry, I didn’t mean to bother you, how are you, you look great, I was just in the neighbourhood. I’ll go now, sorry.”\nDerek steps out onto the step. He’s not even wearing shoes but doesn’t seem to mind the cold. “What are you doing here?”\nStiles lifts both mittened hands helplessly and says, “Your wolf led me here. I thought you were in trouble.”\nDerek crosses his arms over his chest, and the doorway behind him is suddenly filled with Isaac, Erica and Boyd, all standing behind Derek protectively.\n“My wolf?” Derek asks, careful. At least he’s not angry, or at least doesn’t seem it. \nStiles lets his hands fall and his shoulders slump and he glares at Laura and says, “The black wolf that’s haunting you. I see dead animals. Surprise.” He goes for half-hearted jazz fingers and gives up with a shrug, staring down at the snow and kicking his footprint. “She says her name is Laura.”\nThere’s growling suddenly at the name, and Stiles’ head jerks up, staring at Laura, but she’s just looking from him to Derek and back again, silent.\nThe growing is apparently coming from Erica, Boyd and Isaac.\nStiles stares at them, eyes going wide, uncertain. He takes a step back, and Erica’s eyes flash gold.\nStiles panics. He turns and tries to run but he doesn’t get far before he’s hit hard in the back, spilling down into the snow and rolling, breath knocked out of him. Before he can even get his balance back after tumbling, he’s pinned to the ground by some sort of creature with no eyebrows and glowing eyes and he screams.\nHe’s pretty sure he’s about to have his throat ripped out, and then the creature is suddenly shoved aside and Derek is crouching over him, snarling. “Back off, Erica.”\nStiles stares at her, hurt and horrified, and he can see Candy losing her shit, barking and charging at Erica, snapping at her cats and her shins. But Laura is there, and she pins Candy to the ground, nuzzling her soothingly, licking at her muzzle, until Candy calms down and hides her face against Laura’s fur.\nDerek’s eyes are flashing too, bright red, but at least his face is still his face. The other creature – apparently Erica, what the fuck, snaps, “He’s a hunter! He knows about Laura!”\n“Hunters generally don’t shriek and flop around when you come at them,” Boyd says calmly, watching from nearby. “They generally pull out a weapon.”\n“A weapon?” Stiles yelps, voice incredibly high. “I don’t have a weapon! I’m not a hunter! What the fuck, Derek!”\n“You’re fine,” Derek says, not even looking down at him. “Everything’s fine. Boyd, get her out of here? All of you, go home.”\n“I’m not leaving you alone with him,” Erica says, her face slowly melting back into the face Stiles remembers.\n“You don’t think I can take care of myself?” Derek asks, a bit of a growl in his tone.\nShe looks like she’s going to argue, but Boyd and Isaac drag her off. Apparently they live right next door anyway, so chances are, if they hear Derek scream, they’ll be able to come to his rescue.\nDerek waits until they’re gone and then he sits back on his heels, helping Stiles sit up. “Are you okay?” he asks Stiles, after an awkward pause.\n“There’s snow melting down the back of my pants,” Stiles tells him. “And you’re not even wearing shoes.”\nDerek looks startled, like he didn’t even know he was in knee-deep snow with no shoes. “You’re cold,” he says.\n“No shit. It’s a blizzard. I can’t feel my – well, anything, really. But it’s fine, it’s fine, I’ll just head back to campus – I’ll call an Uber. Sorry I broke up the party. I – I just –”\n“Followed the wolf that’s haunting me,” Derek says, mild.\nStiles slumps, staring down at his mittens. “Yeah,” he says. He kind of thought his big ghostly vision confession would go differently. Probably with more, “Oh Stiles, I’m so sorry I accused you of so many terrible things and then stopped replying to your texts and probably broke up with you and forgot to tell you because I’m incapable of dealing with things like a grown up.”\nDerek sighs. “Come inside,” he says. “We should talk.”\n“About the fact that Erica’s a monster?” he asks, letting Derek pull him to his feet. He staggers badly, pretty sure he’s got frostbite on his toes, and Derek catches him.\n“Werewolf,” Derek corrects him quietly. “You knew about Laura, so I assumed you knew about that, too.”\nThey walk across the street, snow crunching under Stiles’ boots as he puzzles over Derek’s words. \nHe’s halfway up the stairs when he gasps and spins around, pointing an accusing finger at Laura. “You’re his sister,” he hisses.\nLaura’s tongue lolls out of her mouth and her tail wags a little. She shrugs a shoulder, like it’s no big deal.\nDerek is staring at him like he’s a crazy person.\n“I’m so sorry,” Stiles says to him, eyes wide. “I didn’t know. I mean, I couldn’t figure out why you had a wolf following you, because wild animals generally only stick around if there was some sort of trauma or if they’ve got unfinished business, like pups somewhere, or whatever. They don’t stay out of love, they don’t attach themselves to people, but she was clearly attached to you, but I still should have said something, I just – usually people think I’m crazy, so I stopped trying to tell anybody when I was a kid. But I should have said something, before the art show. I really messed up.”\nDerek sighs. “You’re turning blue,” he says, opening the door.\nStiles miserably follows him inside. He’s shivering too much to get his boots off but he’s giving it his best shot as he mumbles, “Werewolves weren’t going to be my first guess, though.”\nDerek snorts a little and disappears inside the house.\nBy the time he stumbles on burning feet into the living room, Derek’s back with three fluffy blankets, and Stiles can hear the distant hiss of the kettle.\nStiles gratefully wraps himself in all the blankets and curls up on the couch, shivering and trying not to panic, because werewolves. What the hell.\n“That’s why you walked in the snow without boots,” he says.\n“Yes,” Derek replies. He disappears into the kitchen.\nWhen he comes back a moment later, it’s with a mug of hot chocolate, with a giant pyramid of whipped cream on top. Stiles blinks back tears as he takes it.\nDerek sits on the other end of the couch. The Charlie Brown Christmas special is still playing, muted on the TV.\n“You’re not a hunter,” Derek says, quiet. He’s watching Stiles carefully.\n“I told you. I’m a vegetarian.”\nDerek smiles, just a little. “Werewolf hunter, Stiles.”\nAppalled, Stiles just shakes his head. \n“When I was 15, my family was locked inside our home and burned to death by hunters. Laura and I were the only two who survived, because we weren’t there that night. She became the Alpha – the lead wolf of our pack – and we moved away and tried starting over. We found new pack members – Boyd and Erica and Isaac – and then, about a year ago, Laura went home. She never came back, and a few months later, in the middle of the night…” he shrugs, looking distant. “I woke up to unimaginable pain and the Alpha power. She’d been killed.”\n“Oh my god,” Stiles breathes, but Derek just keeps talking, staring down at his hands, braced on his knees, like this is physically painful for him.\n“So… so Erica says I have trust issues.” Derek grimaces. “And when I saw your drawing, with Laura in it, I thought you had known her. That maybe you had something to do with her death. No one else has seen her full shift. And – and I panicked.”\n“Oh, no, no, no. That’s not what I do at all – I don’t hurt anybody,” Stiles says quickly. “I just see ghosts. But only animal ghosts. And apparently, werewolves. Part animal ghosts.” He frowns. “I don’t know. Most of the children in my mom’s line are blessed – or cursed, depending – with some kind of mostly useless gift. She could garden all year. I can see dead golden retrievers.”\n“But you can’t speak to them,” Derek says.\n“They’re silent. Also, they’re animals. They don’t know English. Sometimes, if they need help, they come to me and they can get me to follow them and help them – usually they’ve got babies, and I take them to Scott at the vet’s and keep them safe and then they’re able to, I don’t know. Find peace.”\n“But not Laura,” Derek says softly. \nStiles flinches. “No. Not Laura.”\n“Is she alone?”\n“She’s with you, always. Though she has come and found me a few times, which is weird, let me tell you. But she’s with you 99 per cent of the time, so she’s not alone.”\n“No,” Derek says. “Are there every any other wolves with her?”\nStiles blinks at Laura, who has curled up very small by the window, watching them. “Oh,” he says, quiet. “No. It’s just her.”\n“The rest of the family is at peace, but she’s not,” Derek says. “Is she – she’s here right now?”\nStiles nods slowly. “By the window,” he says.\nDerek holds out a hand. “Can I – can you feel them?”\n“No,” Stiles tells him. “Just a brush of cold if they go through you. You probably wouldn’t notice it, if you weren’t looking for it.”\nLaura gets up, coming a little closer, hesitating. She gets within a foot of Derek’s outstretched hand and stops, looking helplessly at Stiles.\n“Okay,” Stiles says quietly. “Okay. Close your eyes, Derek.”\nDerek does, letting out a shaky puff of breath as he does. Stiles slides his hand over top of Derek’s, wrapping it around and holding Derek’s hand steady.\n“She’s right here,” Stiles says, soft. “I don’t know if you’ll feel anything, but just… try to focus on your hand, here with mine.”\nDerek ducks his head and Stiles nods at Laura, who steps closer, tipping her head up as she gets closer. She hesitates for a long moment and then arches her head up, so the top of her head brushes Derek’s palm.\nDerek shivers and his breath hitches.\nStiles smiles, slow and sad. “She likes to curl up around your feet at the coffee shop,” he says, as Derek reaches with his fingers, chasing the sensation. His fingertips sink through Laura’s edges. “And curl up with her head on your feet while we watch movies. She – she always made a point of leaving the room, though, if we started, uh. You know.”\nDerek lets his hand fall and opens his eyes. They’re shining with tears that he quickly blinks away.\n“We have to help her,” he says urgently. “We need to help her find peace.”\nLaura backs away, eyes narrowed.\n“How did she tell you her name? We need to find out who killed her. We need to avenge her, so she can be with the rest of our family.”\nThere’s a frenetic sort of energy coming off Derek now, and Stiles hesitates. “Derek,” he says. “Just calm down for a minute. You don’t know if that’s what’s keeping her here.”\n“What else would it be?”\nSo many things. But Stiles can’t argue against Derek’s desperate need to help his sister find peace. So they find a pad of paper and a sharpie and draw out the alphabet, arranging the letters in a fan around them on the floor.\n“Ask her who killed her,” Derek says urgently.\nStiles does, and Laura just blinks at him, shifting from one paw to the other.\n“She’s not doing anything,” Stiles says, gentle. “Maybe she doesn’t know.”\n“Then we’ll figure it out. Ask her what happened.”\nStiles does, and Laura ducks her head and doesn’t do anything at all.\nStiles tries his best but Laura refuses to cooperate, and Derek gets more and more upset. Eventually, Laura lets herself fade away, and Stiles wishes he could too.\nIt’s nearly dawn.\n“I’m sorry,” Stiles says. “She did it before.”\nDerek is sitting with his head cradled in his hands. “I just don’t understand,” he says, voice hoarse. “How can I help her if she won’t tell me what happened?”\n“Maybe that’s not why she stayed,” Stiles says gently. “She’s protective of you, and always near you, always watching over you. I think she stayed for you, Derek.”\nDerek shakes his head. “She can’t,” he says.\n“Maybe – maybe she doesn’t want you to be alone.”\n“I’m not alone. I’ve got Erica and Boyd and Isaac,” Derek says. \n“And you’re… the Alpha. Right? So you take care of them? Maybe she wanted to stay to take care of you.”\nDerek shakes his head again, grimacing as if he’s in pain, and Stiles doesn’t know what to do. Maybe he should go back to school, maybe being here isn’t helping Derek. Stiles doesn’t know where he stands with Derek now, after all this – he’s still struggling with the whole werewolf thing – or if Derek even wants him there, or in his life at all anymore, or if this is all too much for him.\nBut the sun is starting to rise and Stiles aches all over with exhaustion and the idea of walking back to school makes him want to cry.\nIt’s quiet for a little while before he finally says, “Maybe I should go. I could go get Erica to stay with your or something, or—”\nDerek lifts his head, eyes wide. “You want to go?”\nStiles flounders for a moment. “I wasn’t sure you wanted me here.”\n“I—I made you hot chocolate,” Derek says, like that matters – but Stiles remembers that hot chocolate he made as a peace offering to Derek weeks before. He blinks at the empty mug.\n“I thought it was just hot chocolate,” he confesses.\nDerek runs a hand through his hair and looks away. He looks exhausted. “Do you – the picture you drew, at the art show, do you still have it?” he asks.\nStiles nods.\n“It was really nice,” Derek tells him. “You drew her just how I remembered. Seeing it was sort of… like a kick to the stomach. I panicked. And then I was too… afraid. To talk. I thought you were a hunter, that you’d lied, that I was an idiot for trusting you. I should have talked to you.”\n“In your defense, though, ghost animals isn’t really the first explanation that would come to mind,” Stiles says with a weak smile. \n“Neither are werewolves,” Derek says.\n“So… so what do we do now?” Stiles asks. “I could stay. I could sleep on the couch if you want, or—or –”\nDerek takes his hand. “I’m sorry,” he says. “I miss you. Merry Christmas. Stay with me. I’m sorry.”\n“With you?” Stiles echoes.\n“Please.”\n“Yeah,” Stiles says. “Yeah, okay. I miss you too. Obviously. I mean, hot chocolate aside, I haven’t slept since—”\nDerek kisses him, a desperate and aching kiss borne of too many sleepless days and nights spent missing him, and Stiles doesn’t mind being interrupted.\nThey kiss until they’re too sleepy and then they fall asleep tangled together on the couch as the sun rises on Christmas day.\nStiles wakes a few hours later, feeling someone watching him, and when he turns his head, he finds Laura, sitting in the middle of the fan of letters on the floor, watching them both.\n“Hey,” he says, soft. Derek doesn’t wake. “I’ll take care of him,” he promises. “I’ll watch over him and keep him from going off on a suicidal vengeance mission. I’ll love him and make sure he eats his vegetables and that he doesn’t get too lost in his own head or his own guilt. I’ll make sure he goes dancing sometimes, and make him smile, and drag him on adventures whether he wants to go or not. I’ll make sure he’s never lonely.”\nShe stands up, head held high, all her attention fixed on Stiles, and then she glances anxiously over her shoulder, like she can see something Stiles can’t see.\nShe looks back at Stiles, desperate, stepping towards Derek and shuddering. \n“I’ll take care of him,” Stiles whispers. “I promise.”\nLaura relaxes then, her tail wagging a little, and then her edges go hazy and start burning bright. She dances a little on her paws, eyes shining, and spins in an exuberant circle, and then, in the seconds before she fades away in a wash of golden light, her wolf firm shimmers away, replaces by a woman with Derek’s dark hair and gorgeous eyes. \nShe hesitates for a moment, and Candy comes closer, uncertain, her tail wagging slowly. Laura strokes the top of her head and smiles before glancing over her shoulder at whatever she can see that Stiles can’t, and then she fades away and she’s gone.\n*\nStiles drags Derek home with him two days after Christmas, for a belated gift exchange and feast. The sheriff interrogates him while cleaning a gun, Melissa scolds him for it wryly, and Scott is just glad that somehow, it all worked out for the best.\nThe night before class starts up again, Stiles and Derek stay at Derek’s place, sipping hot chocolate and watching Netflix. It’s nearly midnight when Stiles sits up suddenly and gasps.\n“You can turn into a wolf,” he says, accusing, “And you never showed me!”\nDerek lifts a lazy eyebrow and says, “You never asked.”\n“I’m asking now!”\nDerek laughs but obliges, taking off his clothes, which is a treat in itself. And then suddenly, where Derek had been standing, there’s a sleek, gray timber wolf with Derek’s eyes standing there in the middle of the bedroom, like it’s no big deal.\nIt’s amazing.\nStiles insists Derek stay in wolf form when he crawls back into bed, and Derek doesn’t seem to mind. He makes a warm, comfortable pillow, and they fall asleep together that way.\nA warm, golden glow wakes Stiles from his sleep, and when he turns his head, he sees Candy, dancing in ecstatic little circles as she crawls around and through Derek, pawing at his canine form and trying to sniff at him. Her tail is wagging a million miles a minute.\nHer edges are glowing gold.\n“Oh,” Stiles whispers, a pang in his chest, as she starts to shimmer with light. “Oh, that’s what you were waiting for, you silly dog.”\nShe dances around like a puppy. All this time, Stiles had been afraid of replacing her, and she’d just hung around waiting for him to find another canine companion to keep him company.\n“Okay,” he says, laughing and choking back tears. “Okay, Candy, it’s okay. It’s okay. I’m good, I love you, I—tell Mom, tell mom I love her. And tell Laura too. I’ll miss you, I love you, I love you.”\nCandy wags her tail once more and skips in a happy circle and then she’s gone.\nAnd suddenly Stiles’ arms are filled with a warm and very naked Derek, blinking at him sleepily, concerned.\n“What is it, what’s wrong?” he asks, tightening his hold on Stiles.\n“Nothing,” Stiles laughs, wiping away his tears. “But, I think we’re stuck with each other now, though.”\nDerek snuggles him close. “I’m good with that,” he says.\nThe End."
}