{
    "id": "8569036",
    "url": "https://archiveofourown.org/works/8569036?view_full_work=true",
    "author": [
        "anamatics"
    ],
    "title": "Lord, Save Me from Your Followers",
    "rating": "Mature",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "F/F"
    ],
    "fandoms": [
        "Supergirl (TV 2015)"
    ],
    "relationships": [
        "Kara Danvers/Lena Luthor"
    ],
    "characters": [
        "Cat Grant",
        "Kara Danvers",
        "Lena Luthor",
        "James Olsen",
        "Alex Danvers",
        "Clark Kent",
        "Lois Lane",
        "Lucas \"Snapper\" Carr"
    ],
    "additional_tags": [
        "Alien Biology",
        "Alien Culture",
        "Social Media",
        "big bad social media au"
    ],
    "language": "English",
    "series": "",
    "published": "2016-11-16",
    "completed": "2016-12-07",
    "words": "26,830",
    "chapters": "8/8",
    "comments": "625",
    "kudos": "9,515",
    "bookmarks": "1,461",
    "hits": "152,388",
    "summary": "<p>A tumblr prompt, spiraled out of control.</p>\n<p>Kara, perhaps out of a want for thoroughness in her story, perhaps out of a Millennial-born urge to creep on a the social media of a woman she finds intriguing, discovers that Lena Luthor has a pretty active following on Instagram one afternoon not long after their first meeting. She debates it, just for a moment, before following Lena.</p>",
    "notes": "<p>I’ve become fascinated with the bazillion versions of Krypton that exist within the world of the comics. The show’s presented us with an interesting society, one that’s got a lot of culture and passion, but also one that’s clearly rigid in its views on love and marriage. Some versions of Superman present Kryptonian relationships as ruled by the “good matches” described above and reproduction is based on compatibility within the Matrix/Codex/It’s got about 18 different names and all the wiki articles I read were confusing. I liked this but of them though, because it seemed to really jive with the non-familial relationships Kara holds closest to her within the show’s canon. Winn is incredibly smart and technically savvy, James is a well-renowned photographer with several prestigious awards, Lucy’s a high ranking military official, Cat is arguably the most powerful woman in all of popular media, and Lena, while new, also is in a position of great clout within National City. These are people who would be considered “good matches” across the board, people that Kryptonian society, as I’ve imagined it, would approve of Kara having and maintaining relationships with.</p>\n<p>So this is a story that talks about Kara’s regret and grief over losing James, but also about her growing comfortable with someone else.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_8_endnotes\">notes</a>.)\n</p>\n<p>Thanks for coming a long, guys! Hope you enjoyed as much as I did!</p>\n<p>The original prompt for this was \"comfortable kiss\" as you can see, we've become decidedly off message.</p>",
    "text": "\nMonday —\n\nKara, perhaps out of a want for thoroughness in her story, perhaps out of a Millennial-born urge to creep on a the social media of a woman she finds intriguing, discovers that Lena Luthor has a pretty active following on Instagram one afternoon not long after their first meeting. It’s there she discovers a playful side to Lena, kissing girls on cheeks at parties, looking blitzed out of her mind with a bunch of well-dressed men in the back of someone’s car; debauched with heavy-lidded eyes and a knowing smirk in blood red lipstick in the arms of some gorgeous starlet.  There are pictures of her in front of landmarks from all over the world. She looks like a rich man’s daughter in these pictures, playful, bashful, and grinning at the camera. Mixed into the fray of boarding school friends and clear wealth there are some absolutely adorable baby pictures for #throwbackthursday. Those make Kara wish there were pictures of her as a child on this planet. Kal’s scoured his records, but there are no pictures of the extended family at the Fortress of Solitude. \nShe debates it, just for a moment, before following Lena.  \nTwenty minutes later, as Kara’s flipping through her notebook looking for something the mayor’s secretary told her about the new green publishing initiative in the city, a notification appears on her phone.\n\nlenaaaluthor has followed you back!\n\n\n \n\nKara gains 200 followers in a day. There are people from all over the world picking through her feed, commenting on pictures of her with Alex, her with Eliza, her with Kal and Lois at that writer’s conference last Christmas. It’s then she realizes that Lena only follows ten people on Instagram. Kara was the eleventh. \nSo maybe Kara cleans up her feed a little bit, out of paranoia. She takes down the few photographs of herself with Cat Grant that had made it onto her feed, gets a text from Cat demanding to know why (because of course she pays attention to such things), and has to explain that there are strange people from all over the world commenting on her stuff because Lena Luthor added her as a friend on Instagram.\n\nCat – And are you friends?\n\n\nKara – I’m not sure.\n\n\nCat is typing…\n\n\nCat is typing…\n\n\nCat – I worry about you being friends with someone with a name like that. \n\nThe layers of implication are there, the hinting at the fact that Cat knows but will never come directly out and say so, it makes Kara happy and sad, fearful and worried. Cat knowing was never part of her plan, but she hasn’t been exactly subtle.\n\nKara – It’s just Insta, Cat. No need to be worried.\n\nKara deletes a few more pictures, leaving her with a feed of mostly family pictures and the benign documentation of her quest to find the best potstickers in the city back in college – a saga that Alex still gives Kara shit for to this day.\n\n\nFriday —\n\n\nThey don’t every talk about the fact that they’re friends on Instagram now. Kara spends a few hours digging through Friday morning CatCo corporate policy to make sure that she’s totally correct in her assumption that she’s not committing some sort of cardinal sin for being friends with Lena on social media. There’s nothing indicating that her social media, no matter if it’s personal, is under the purview of CatCo – so she thinks she’s okay.  She keeps her friendship with Lena away from Twitter or Facebook, and doesn’t really talk about it to anyone.\nKara’s sent to speak to Lena on some anti-alien rally in the city, get a quote about L-Corp’s new policy toward alien employees and possibly something scathing about her bother in the same breath. She sits and waits dutifully until Lena’s free, fidgeting and reading her Twitter feed – the rally’s got people really worked up. Kara tweets about how she hates that people feel the need to protest the presence of aliens in the city when so many of them are refugees, and sits back. She hates this, hates that she’s send to speak to Lena about this, when L-Corp is doing so much good in for the alien community. Lena is trying to rise above the atrocities committed by a man she loved with all her might, by a family who gave her a name and power when she had none. Kara wants to write about that.\n“Ms. Danvers?” Jess, Lena’s spitfire of a secretary, calls from her desk. “You can go up. Thank you for being understanding…under the circumstances. I know you’ve got carte blanche to run up whenever you want.”\nDucking her head to hide her burning cheeks, Kara gathers her things. When her ears stop burning and she’s able to look Jess in the eye, she nods. “Don’t worry about it. I know she’s a busy woman.”\n“A busy woman who’s allowed you a great deal of access,” Jess answers. She tilts her head to one side and glances Kara’s wrinkled work shirt and blazer with a distasteful curl of her lip. “Make sure you don’t lose her trust, Ms. Danvers, she’d make a powerful enemy for CatCo…and you.”\nKara bristles at the threat, but forces herself to smile sweetly. “It’s the duty of the press to report the truth. If Ms. Luthor – or anyone else for that matter – takes issue with my work, they can speak to my editor or the CatCo legal team.”  She jabs the button on the elevator. It takes a moment to respond and Kara wishes Jess would stop glaring at her like she was some sort of threat.  Kara fiddles with her glasses.  “Besides, Jess, that’s a conversation for me to have with Ms. Luthor, not with you.” The elevator arrives then, and Kara’s smirk is just a little wicked as Jess glowers at her as the doors close.\n \nLena is, interestingly enough, paging through Twitter when Kara gets up to her office.  She’s got a live feed of the #ETGOHOME hashtag projected onto the wall beside her desk and is standing in the middle of her office, arms cross and a scowl on her face.\n“I suppose you’re here for a quote.” Lena doesn’t turn around.\n“Well, it isn’t to ask you to tell your Instagram followers to stop stalking me.” The joke falls a little flat, Kara’s cheeks burn again. She always feels a little awkward, a little uncomfortable around Lena. It’s like how she felt with James, and the girl she liked in college – or all those boys in high school. It isn’t the uncomfortable that comes with the Luthor name or the fact that Kara is keeping secrets from her. It’s the uncomfortable that comes with curiosity and attraction, and that, honestly, is what scares Kara most of all because she’s not supposed to feel this way.\nHer brain isn’t wired this way.\n“Are they?” Lena asks, a little pensive, distracted. She scowls and snaps her fingers, the projector feed goes dark. “I’m sorry about that. I should have—” She looks at Kara then, and her face instantly brightens, instantly goes from annoyed to welcoming. “I should have warned you, they can be—intense.”\n“I’m verified,” Kara answers. Winn did it for her a when she started at CatCo, because Cat Grant also has a lot of social media followers and being able to sort through the crazy was once part of Kara’s job. “So it’s not that big a deal. Just weird. I’m not used to that kind of following.”\n“Is this your, lord, save me from your followers pitch?” Lena grins. “It isn’t very good.”\n“I’ll endeavor to do better, then.” Kara shoots back. She steps a little closer, hands in her pockets. “Was that the protest feed you just closed?”\n“Yes.” Lena rubs at the back of her neck. “It’s disgusting what they’re doing down there.” She glances sideways at Kara. “That’s not nearly scathing enough for Snapper Carr is it?”\n“Probably not.” Kara laughs and moves to the window.  Below, the protest stretches for blocks in each direction. She wonders if Supergirl should make an appearance, if she could find the words to soften the hatred in the hearts of these people. She doesn’t think she can, and she hates it.\n“I’ll have to do better.” Lena comes to stand beside Kara. She presses her palm to the window, her lips pitched downward. “I heard there was a counter-protest.”\n“There is.”\n“Do you think it will turn violent…if they were to meet?”\nKara shrugs. “I don’t know. People don’t talk to each other anymore. Snapper says that’s what sells papers, but I think maybe people should talk to each other, try to understand where the other’s coming from.” \nLena says nothing, but her hand moves from the window to brush against Kara’s, and when Kara glances over at her, her ears are bright red and there’s a flush on the back of her neck as well. “What if L-Corp were to sponsor a round table – a way to bring both sides together? Would CatCo agree to moderate it?”\n“Who? James?”\n“He is your ex,” Lena glances sideways at Kara. “I figure you still have some clout with him. You posted a picture with him just last week.”\n“Oh. That.”  Winn had come for a visit with James mostly, but Kara had stumbled in on them and the three of them had gone out to lunch with Lucy and Alex. Lucy was in from wherever the DEO had sent her overseas, and James had no idea she was in town. Kara loves the picture Alex’s friend Maggie took of all of them. Her arm is slung over James, Lucy on his other side. He’s kissing Lucy’s head and holding Kara’s hand. Alex was giving Lucy bunny ears, and Winn was leaning against Kara so far he was almost sideways. She’d posted it early Sunday morning, sitting cross legged high above the city, alone in her thoughts and the blood red sunrise that reminded her too much of home. They were her home now, her family.\nLena liked the picture, but she hadn’t commented. Kara’s a little surprised she’s brought it up. “Yes that.”\n“Does this mean if I ask you for an exclusive quote from Mindy Sorrenson you could hook me up?” It’s a bit of a dig; Mindy’s been in a few of Lena’s Instagram photos, always looking well-sexed and far too cozy to be anything other than romantically involved with Lena. And Kara isn’t jealous. No.\nLena coughs, and the flush at the back of her neck goes a little redder. “Right, we’ll leave exes out of it then.”\nKara laughs, but inwardly, she’s panicking, because that’s confirmation of something she hadn’t thought of, something that makes this feel a little more real. “I don’t mind asking James, but if you go down this route, you are going to attract a lot of bad press. You can’t be seen to choose a side.”\n“Actually…” Lena taps her chin. “I know you have connections with Supergirl. Do you think you could get her to come visit me?”\nFrowning, Kara tries to follow Lena’s train of thought. “Why?”\n“What if I do want to pick a side?” Lena grins. “Best do it with National City’s own alien hero, right?”\nInwardly, Kara groans.\n\n\nMonday —\n\n\nKara ends up writing a puff piece for the website about herself. Snapper is less than amused by Lena Luthor not playing the villain he’d been trying to set up in the narrative. Kara gets the sense he doesn’t give much of a damn what aliens do in the city, but the picture Lena posted on her Instagram makes it hard to ignore that the powers that be are choosing sides.\nIt’s a picture from the center of the #alienswelcome counter protest to the #ETGOHOME protest. Lena’s got an American flag bandanna around her wrist and t-shirt printed with the L-Corp outreach program’s logo: always welcome National City. Kara, well, Supergirl’s got her arm slung around Lena’s waist. She’s holding a sign that someone handed her that reads: Alien, National City resident, taxpayer. Someone in the crowd took it for Supergirl, using Supergirl’s phone. It isn’t exactly posed, but it certainly isn’t a candid shot either.  Kara stares at it for a long time before sending it to Lena from an encrypted JLA email account late Sunday night, with permission to use it if she wanted. She isn’t sure what, exactly, Lena’s angle is, and the fear of seeing herself – only not herself – on Lena’s Instagram feed with all those intense people scrutinizing her is… well, it’s a bit much.\nLena posts it the next morning with a carefully written caption that Snapper’s pretty damn convinced was written by her press office.\n\n#alwayswelcome is an initiative started by L-Corp close to a decade ago to be inclusive of LGBT individuals working within our organization. L-Corp believes that everyone who comes through our doors is worthy of dignity and respect, and we believe that this protection should extend to those from beyond the confines of our planet. #alienswelcome\n\n“Lena goddamn Luthor isn’t following the script,” Snapper grumbles when he sees the picture. “She’s supposed to be an anti-alien bigot, not some black sheep.”\n“I think she just wants people to get along,” Kara says. Snapper scowls at her, but Kara’s mind is a million miles away. She’s thinking about L-Corp’s alien detection device and how Lena looked at it and saw dollar signs. She’s pragmatic, and her bias is far more subtle. She wonders if Lena even realizes it, if that’s the lesson she’s going to have to find a way to help Lena to see.\n“I want 500 words on the protest, with quotes from Luthor and Supergirl for the website by three so we can hit the afternoon lull and the evening commute.” Snapper rubs his chin for a moment before rounding on Kara. “And Danvers?”\n“Yes, sir?”\n“No bias this time.”\n“Of course not, sir.”\n \n“Quoting yourself in articles now, sis?” Alex says over their private com channel. Kara’s flying, well, more accurately she’s dodging some sort of bright orange beam weapon that packed a punch like the force of a semi and could fire rapidly. There was, naturally, violence at the #ETGOHOME protest. The DEO followed the signal to somewhere in the vicinity of the warehouse district and Kara’s tracked down the source.\n“What the hell was I supposed to do?” Kara demands, rolling to the side and landing a good kick. The guy she’s fighting hisses in pain. Kara cracks an elbow over his head for good measure. “Tell him I couldn’t get a quote? Or that Supergirl didn’t want her to post the damn picture?” Which was not technically true, but made Kara feel better about Alex’s ire.\n“He’s not stupid, he’s going to figure it out.” Alex shouts something unintelligible and Kara has to throw herself to the ground to get out of the rain of bullets the DEO sends in a volley over her head. The guy with the orange beam gun falls to the ground and Kara’s pushing off the ground to grab his weapon and roll to train it on him. He shouts a curse at her, a lewd term in a language she hasn’t heard in over a decade. Kara’s knuckles go white, her finger itches on the trigger of the gun. Her expression is closed, dark.  She wants to pull the trigger and kill this man, and the urge is so strong it takes all she has to break the gun over her knee and throw it to the ground.\n“Why the hell did you do that?” Alex demands, scurrying forward to collect the pieces and scowling at their ruin. “We needed that tech.”\n“You don’t need it,” Kara shakes her head. “You want it, to study it –”\n“To better protect this city from it!” Alex protests.\nKara bites her lip and looks away; she changes the subject because this fight isn’t worth it. “I worry about where it’s coming from. If we have a leak, doesn’t that mean that the DEO shouldn’t house alien tech?” She can’t tell Alex she wanted to kill the man for what he called her.\n“This one is from CADMUS, it has to be,” Alex retorts.  “They’re the ones who are instigating these protests and riots. The DEO is just trying to keep the peace.”\nSwallowing, Kara bends down and flips the gun over.  There, on the side, is a logo, but it isn’t CADMUS, it’s something else entirely. Something Kara recognizes, but she can’t remember where she’s seen it. Her fingers itch. She wants to fly to the moon to get away from all of this – this budding war she’s trapped in the middle of between humans and people like her, people who are just trying to get by in an increasingly hostile world.  “Have you ever seen this before?” she shows Alex. Alex shakes her head, but moves to start getting it into an evidence bag.  She’s exhausted, and it’s getting late. The DEO won't have much until the morning anyway. “I need to get going.”\n“Ok.” Alex says, and lets Kara go.\n \nKara stands in the shower, thinking about that word, and that feeling, the feeling that she hasn’t felt since leaving Krypton. It’s an old insult, a childish one at that – but even the dull knife of long-repressed memory cuts sometimes. She knows what it means, it means that the #ETGOHOME protest has some alien origins to it as well, because who else would know those words, know how to say them in the correct inflection and with the right click to the tongue.  She turns her face to the stream of water and lets it drown out whatever she’s feeling, because that rage, that pain at the loss of billions of souls, it has no place here anymore. Those old conflicts, those old wars are long gone. Non, Astra, they were the last of her people. They’re dead. Now it’s just Kara, just Kal; just the two of them and the baggage of the entire universe—or at least anyone who remembers how to hurt Kryptonians with words alone.\nShe gets out of the shower before she starts to prune, mostly because the hot water is starting to run out. Kara puts on sweats and curls up on her bed, flicking through her phone, before she remembers, with just the barest hint of a groan, that Lena Luthor’s posted a picture of Supergirl on her Instagram feed.\nThe comments on Lena’s picture with Supergirl are insane. There is infighting, insults, and a lot of speculation about how intimately Lena Luthor knows Supergirl. Apparently Lena is a bit of a player, at least according to the comments on the post, and if she’s got her sights set on Supergirl, all bets are off.  Kara has to stop reading them after a while, but it is heartening to watch Lena’s follower count on Instagram go down as all the anti-alien bigots unfollow her.  There’s one comment that gives her pause, another comment, like the one shouted at her in anger today, but she pushes the thought aside. There’s no way to replicate Kryptonese on the iPhone anyway.\nShe’s about to close the app when she notices she has a direct message.  It’s from Lena. She opens it to find a note.\n\n\nlenaaaluthor: \n\nNow that we’ve had the conversation about exes, and have ascertained that we are both attractive, single young professionals, would you be amenable to a drink? \n\nKara bites her lip and curls onto her side, thumbs flying. She decides that if this is going to happen she needs to speak frankly to Lena about how her company is talking out of both sides of its mouth regarding alien rights. Maybe this drink, because she can’t get drunk (a tragedy Alex laments constantly – though this friend of hers with the alien bar hookup might actually change that), is a place to do that.\n\n\nKaraD4nvers: \n\nIs this your way of asking me out? \n\n\n\nlenaaaluthor: \n\nIt could be.\n\n\n\nlenaaaluthor: \n\nIf you’re interested.\n\n\n\nKaraD4nvers: \n\nI would be – I mean, yes, I am interested. Where?\n\n\n\nlenaaaluthor:\n\n  Let me surprise you. Meet me on 7th and Trade at eight tomorrow. I have a meeting that ends at 7 - it shouldn’t run over. I’ll have Jess call if it does.\n\n\n\nKaraD4nvers\n\n: I don’t think Jess likes me.\n\n\n\nlenaaaluthor: \n\nJess doesn’t like anyone, but I don’t pay her to question me. She does what she’s told. She’ll call you if I’m running late.\n\n\n\nKaraD4nvers: \n\nOk. Should I um…dress up?\n\n\n\nlenaaaluthor: \n\nYou’ll be with me Kara, it wouldn’t matter if you had just rolled around in a mud pit.\n\n\n\nlenaaaluthor: \n\nBut please shower if you have to roll in a mud pit.\n\n\n\nKaraD4nvers\n\n: For sure. I’ll see you.\n\n\n\nlenaaaluthor: \n\nLooking forward to it.\n\nKara, on a whim, likes Lena’s Supergirl picture before closing out the app and flopping back, staring up at the ceiling she’s decorated in stars that reflect the night sky she remembers from her bedroom window on Krypton. They’re glowing faintly now, high above her bed. Kara wonders if this is some sort of side effect of growing up on Earth – that she’s so open to this when passion and attraction when such things did not exist on Krypton. That part of her brain, the brain that was going to go into the Science Academy, understands that Lena is a good match, as James was. They’re both in a position of power, with a name that would bring glory to the House of El though the union.\nBut it’s just a date and Kara’s shoving her fist into her mouth and biting down to feel something that will suppress her groan.  Her dueling socializations always escalate things too quickly; always make her feel panicked about the idea of romance. It’s why she’s so oblivious until she finds herself wanting.\nKal once compared Kryptonians to pandas, in the middle of an argument with Kara over a disagreement over his wanting to marry Lois. Kara, at sixteen, didn’t think it was a good idea or a fair match. She was trying to be his parent when he wanted nothing to do with him, when he was an adult, a human adult that Kara could scarcely understand.  “I love her Kara,” he said.\n“Love isn’t something we feel.”\nNow, staring up at the ceiling of her bedroom, Kara feels even more of an ass than she felt then. It’s only nine thirty in Metropolis, she calls Kal.\n \n“Do you ever wonder about what it would be like growing up on Krypton?”\nHe pauses, there’s the sound of dishes clinking, and then a sliding door opening and then closing. “What are you talking about, Kara?”\n“I was thinking about what I said to you, when you told me you wanted to marry Lois. How I thought it would be a bad match.”\n“Yes, because journalists make no money and have to fight and claw for any prestige they have, I remember.” He isn’t being short with her, but rather his tone is gentle, teasing.\nKara’s always had a strange relationship with him, older and younger at the same time, this is when she finds the words choking in her throat. When she wants to tell him what it means to have the memories of two entirely different societies crammed into her brain. So she changes the subject, just a little. “I got asked out.”\n“With someone who wouldn’t be a good match.”\n“No, she would.”\n“But she’s a she.” Kal understands that part better than most. Kara’s always struggled with it, just a little bit. Because she is attracted to girls, and to boys too. Trying to supersede a childhood of socialization that attraction is good matches in terms of the Matrix and not about love or want or desire has been hard for Kara in a way she’d never thought possible. \n“Exactly.”\nKal sighs. Kara can almost picture him pinching the bridge of his nose. “Jimmy’s a guy, but you broke it off with him.”\n“James is a wonderful guy, but it doesn’t change the fact that I...I didn’t see it until people pointed it out to me over and over and over again.” Kara feels like she’s whining. Whining about how she’s oblivious and maybe broken when it comes to this sort of thing. “I wanted him, I was attracted to him, yes, but I wouldn’t ever act on it, not without everyone I know telling me to go for it – that’s not how my brain works, Kal. I wasn’t socialized that way…or at least, I wasn’t, and then I was and now I’m confused—”\n“And this girl…you feel that way again?”\n“I don’t know.” Kara sighs. “I feel something. I think it’s more than just admiration or attraction. It feels like…Like she smiles at me and my whole body catches on fire, I feel her touch long after she takes her hand away, and when she looks at me in certain ways, stars, Kal, my brain short circuits and I want her to consume me. It’s never been like this before. I don’t know what to do.”\nKal chuckles. “You want to have sex with her. That’s a pretty normal human experience, Kara.”\n“I… what?” Kara shakes her head. “No! I’ve had sex, lots of sex, it isn’t like that!” It’s only after the words out of Kara’s mouth that she finds herself wanting to jam them back inside, cram them away where Kal can never know how Kara likes to please and will say yes to the strange traditions of her new home. \n“I really am not the person to be having this conversation with you, let me get Lois.” The sliding door opens, and Kal calls out to Lois. Kara, privately wants to die.\nLois, however, is helpful in her cutting way that makes Kara long for Cat Grant. She talks Kara through the situation asking the same sorts of questions Kara grew used to Cat asking during her two year employment under her. She tells Kara that just because you say yes to someone and consent to the act you engage in doesn’t mean that you want it – like want it, want it. And it sounds like Kara’s experiencing lust for the first time ever, or maybe something’s just clicking where it never clicked before. \nKara, secretly, is probably dead of embarrassment. She mumbles her way through the conversation and tries not to die of humiliation when Lois asks who the lucky lady is. She doesn’t answer Lois because that conversation isn’t one she wants to have on top of the one she’s currently having. She instead steers the conversation to Snapper and how to deal with his insane expectations regarding her ‘Supergirl source.’\nThe next morning, and it’s just barely that when Kara gets a call in to work to cover a massive pile up on the I-5, she has a notification on Instagram: Lois_Lane has tagged you in a photo.\nIt’s a picture of them from the writer’s conference last Christmas, heads bowed together and deep in discussion over, if Kara remembers correctly, Cat Grant’s latest book with a caption reading: Had a great talk with one of my favorite people last night.  Good luck, kiddo, remember to breathe. \nIt’s four-thirty in the morning, but somehow, Lena’s already liked the picture.\n\n \n\nKara spends the day avoiding her phone and the wild speculation going on in the comments of Lois’s Instagram picture about the relationship between that kid reporter working for CatCo and Lois Lane; especially given the relationship between Cat Grant and Lois Lane. Lena’s crazy followers, have, evidently found the photo and are now trying to figure out who Kara really is. There’s a few links to stories with her byline on the CatCo website, but Kara’s forcing herself to ignore them. Or rather, she’s trying, but she keeps getting notifications.\n\n\nSojah.s13 \n\nSo she follows this reporter, who also knows Lois Lane, and then is posting pictures with Supergirl? Coincidence?\n\n\n\nAtttcoconut @\n\nSojah.s13 check her articles linked upthread. There’s a few quotes from Supergirl. Maybe LL is just using her for the connection.\n\n\n\nSojah.s13 \n\n@atttcoconut No one knows who Supergirl really is. Maybe she’s this reporter.\n\n\n\nAtttcoconut \n\n@Sojah.S13 Get real, this kid was Cat Grant’s secretary. She knows Supergirl through Cat Grant. \n\nKara groans and goes into her settings to turn off her notifications. She’s got stuff to do for Snapper anyway after she finishes the accident story for the website. She’s been thrown in to background research into some corruption case involving the dockworker’s union and city hall, trying to find connections in a long string of seemingly unrelated emails. Kara’s starting to discover that she likes this part of the job, where she can dig through pages upon pages of technical information and find patterns and connections.  It’s a very meditative activity, and it gives Kara a chance to quiet her mind.\nBy the time seven o’clock rolls around, Kara’s found two potential leads and has run them by Snapper. He wants her to follow up, but as it’s after business hours it’ll have to be in the morning.  If Snapper’s annoyed about that, he doesn’t so much ire in his grunt of approval at her proposal.\n“You talk to Lois Lane yesterday?” He asks as Kara’s making to leave.\n“I did.” Kara says, because she really can’t deny it.\n“How do you know her – thought Cat?”\nKara laughs, polite. “No sir, she’s married to my cousin.”\n“Who? Wait—Kent? He’s your cousin?”  Snapper shakes his head. “Huh, small world. Always thought she settled.”\n“Don’t let her hear that, sir.” Kara doesn’t rise to the bait about Kal. She can’t. Cat did the same thing with Lois and Kara always bit her tongue. It wasn’t worth it. “Nothing gets her going faster.”\n“Oh, I don’t doubt it. You’re just full of secrets, aren’t you, Danvers?”\nKara shrugs and leaves before he can ask her anything else awkward.\n \nShe stands on the northwest corner of 7th and Trade at three to eight in a slightly nicer red dress than she’d usually wear to work and a sharp black blazer to go with it. Her heels are black, tall, borrowed from Alex (who has kept them for some reason – they’re her getting laid shoes apparently – Kara finds this detail horrifying). Maybe she’s channeling Cat, just a little bit; the woman is a fashion icon, after all. Maybe she just wants to look good for Lena, because if what Lois said to her last night is true, that’s what Kara wants more than anything.\nKara is terrified. Terrified of what it means to act on something like this. This isn’t how she was raised as a child. This isn’t – well, this isn’t something she’s accustomed to wanting.  She thought, maybe, with James, but it never came beyond that intense moment when she did want him and she feels so goddamn awful about it. The sex was okay, but Kara didn’t feel anything at all and it made her feel even worse. The conversation where she explained the Matrix to James was one of the most awful conversations she’s ever had to have. He looked at her with such sympathy and such horror that Kara wanted to claw away the ground she stood upon and fling herself into the earth’s core below.\n“That’s – Christ, Kara, how do you unlearn that?”\nCrying, for what felt like the first time in forever, Kara shook her head. “I don’t know.”\nHe held her afterwards; let her tell him how she saw him, in the eyes of the Matrix. How he was perfect but her mind wouldn’t move past generations of socialization to allow her to experience the desire she knew she should feel for him at this stage in their relationship.  “And with Lucy…”\nJames had gone quiet then, his expression pained. He still loved Lucy, Kara knew that now – he’d said her name, when they were...well, Kara’s pretty sure that’s the biggest slap in the face you can give a girl without actually hitting her. His love of Lucy was what made this easier, or maybe harder at the same time. Kara cried into his shoulder. “I’m sorry,” she said when she ended it.  “I’m so, so sorry.”\nA hand closes on her shoulder and Kara blinks, wills herself not to react, for shrugging her shoulder to get away could lead to whomever is grabbing her being flung into oncoming traffic.  Kara turns, and it’s only Lena, dressed for the office still in killer heels and this silky black blouse that makes Kara’s mouth go dry. Her lipstick is pale today, beautiful, and her hair’s tugged up in some sort of messy updo that looks deliberately messy and low-effort but is actually quite intricate. The pins in her hair catch the light. She looks shiny.\n“You were a million miles away.”\n“Sorry,” Kara says.\nLena’s fingers brush against Kara’s cheek.  “You were crying. Kara, if you’re not up to this…”\nKara swipes angrily at her eyes. “No,” her tone is forceful. “This is what I want.” And when she says it like that, in her Supergirl voice and with all the confidence behind it she can muster, she almost believes it.\n“Alright then, tough guy, let’s go put some alcohol in you and maybe you can tell me why you were crying.” Lena offers Kara her arm, and Kara takes it, still a little sniffily, still a little sad.\n \nThey go to some club Kara’s never heard of. Lena hasn’t been in National City long, but she moves though the spaces of privilege like she’s a native. They bypass the line and go around the back of the club to the VIP section. There are no cameras here, the entrance is well masked.  Lena punches in a number into the key pad and the door slides open to reveal a small space cast in red light.\nLena pays the cover without a word and drags Kara up a narrow flight of stairs into a room full of low couches and tables with little mushroom-like lamps arranged artfully amid rose petals.\n“Those are new,” Lena comments, looking at the rose petals. She leads Kara through the room, her hand hot in Kara’s palm, and sitting down in a loveseat tucked into an alcove farthest from the door. “Romantic.”\n“Lena there’s no one here,” Kara says, because it’s weird. It’s late enough that there should be people here.\nShe laughs and pulls Kara to sit down beside her. “The club doesn’t officially open until next month. This is the soft opening. I’m an investor.”  Lena eyes the door. “There should be people filtering in, but if you’d prefer, we could go downstairs and mingle with the common folk.”\nKara swallows. Lena’s thigh is pressed against her own, and the fabric of Lena’s slacks is silky soft and Kara wants to touch it with her fingertips, but she’s too afraid to move. \nThe door to the stairs opens, and a couple, and then a second couple filter in.  Kara exhales, shakily, and shakes her head. “No, this is fine.”\n“Are you sure?”\n“Yes.” Kara’s tone has bite to it. The bite she felt yesterday when fighting that guy. Lena’s eyebrow quirks, but she doesn’t say anything at all, instead reaching for the cocktail menu from where it’s perched amid the rose petals.\n“What do you want to drink?” \nKara reads the menu quickly, and wonders if it’s Cat’s influence that’s coloring her when she selects the driest martini she can find. She, unlike Cat, orders it with orange peel – olives are disgusting. Lena goes for something that appears to be about 98% bourbon and 2% some fruity mixer Kara’s never heard of. The waitress is discrete, in and out in under three minutes. \n“As an investor, is it a conflict of interest to plug your own club?” Lena wonders, arranging her drink so it catches the light and the rose petals and snapping a picture with her phone.\nKara looks up, she’s worrying a nail, and Lena’s captured the moment on film: alien girl; just come from work, chewing on her nail in low light, martini cradled in her free hand, forlorn. Lena’s got a knack for photography, Kara will give her that.  She’s captured how nervous Kara feels, and how apprehensive she looks.\n“Can I post this?” Lena asks, staring down at the photograph. Her fingers pinch and zoom, contemplating a crop before deciding against it. “This… Kara you look beautiful… a little lost, but beautiful.”\nSwallowing, Kara thinks about it for a moment before nodding. “Go ahead.” She’ll deal with the fall out in the morning.  She tips her martini back and takes a larger sip than perhaps a human would, and swallows without coughing.\nLena, for her part, looks impressed. “Wanna be tagged?”\n“Sure.” Maybe she’s being agreeable, maybe it the vermouth talking now. Kara can’t get drunk, but if she drinks quickly enough, she’ll attract a temporary – and by temporary she means like less than two minutes in duration – buzz that settles out the jitters. Enough for her to start to talk to Lena about things they both care about.  She’s spoken to James about the round table discussion on alien rights that L-Corp wants to sponsor, and he’s amenable to the idea, with a few stipulations, which she lays out to Lena in quick succession.  Lena listens, asks questions, and allows Kara to steer the conversation, for which Kara’s grateful.\n \n“So what happened with you and James?”\nThey’re three drinks in now, and Kara’s definitely not drunk but is relaxed enough to allow Lena lean against her. Lena can also hold her alcohol, but she’s looking a little unfocused now, her fingers playing with a curl of Kara’s hair.  Every time her fingers get too close to Kara’s neck, there’s this moment when Kara’s breath hitches. Kal was right. This is want, desire, everything she didn’t think herself capable of feeling. It’s terrifying.\n“What happened with you and Mindy?” Kara asks.\n“Touché.” Lena nudges Kara with her knee. “You go first.”\n“There isn’t much to tell,” Kara says. “He was still hung up on his ex and I… It didn’t work, like, I thought it could, he’s a good match…we like each other, like a lot. The sex was okay… But I’m just not… my brain…” She waves her hand and looks down at her knees, wondering if this is the moment when she tells Lena she’s an alien and broken because she can’t really feel desire the way humans do.\nAnd somehow Lena knows, in that moment, Kara doesn’t even need to tell her and somehow it’s the freshest breath of air that Kara’s ever tasted.  “Do you usually feel that way?” she asks. “When you’re in relationships?”\n“Yes.” Kara says, her cheeks burning. She isn’t ashamed, it’s her culture, and she has to keep it alive. There are people like that on Earth too, she’s seen them at parades – but it isn’t the same, not really.\nLena’s fingers close around Kara’s hand, a tactical action that can in no way be read as anything other than gentle friendship. “Do you feel that way now?”\nThere’s a lump in Kara’s throat that feels the size of her fist. She pushes back against it, swallowing hard and meeting Lena’s gaze for the first time. Her eyes are soft in the low light, warm, understanding. They tell Kara that if she says yes, Lena won’t hold it against her. But Kara doesn’t know if she feels that way now. She doesn’t know at all. “I don’t…” Kara swallows again. “I don’t know.”\nSo Lena moves even closer and her breath smells like bourbon and sweet juice and Kara is the one who closes the distance between them. It’s a brief, gentle kiss, and Lena pulls away before Kara can decide what she wants to do next.  Her fingers brush against Kara’s cheek. “You’re crying again.”\nKara’s fingers are trembling when she raises them to touch her cheek. They come away wet and streaked with black. Her mascara’s run. She exhales shakily. “I guess I am.”\n“Why?”\n“Because that…” Kara stops, because she realizes what she wants to do more than anything else is kiss Lena again. So she does, this time with her fingers cradling Lena’s cheeks, and Lena nipping at her lower lip. This sort of kiss – she’s choking on the emotion of it – because the emotion is telling her this is right like a switch being flipped.  Lena’s warm and soft and when she moves to settle in Kara’s lap, Kara doesn’t fight it. Because this is what you do in the VIP section of a private club, and this is what you do when something actually fits for the first time in your life.\n \nThey’re waiting on their shared uber when Kara remembers: “You never told me about Mindy.”\nLena shivers in the cool evening air off the hills and scoots closer.  Kara throws an arm around her shoulder. Lena relaxes, then, as though the protective circle of Kara’s arm actually can do anything to keep her warm. “She wasn’t out.”\n“Ah.”\n“Which wasn’t really a problem, until I wanted to go with her when she was up for a Golden Globe last year and she wouldn’t let me.” Lena shakes her head. “I really didn’t want it to end…but everything with Lex was blowing up then too, and I couldn’t handle her fear on top of everything else going wrong in my life.” Lena goes quiet for a moment, relaxing against Kara. “Does that make me a bad person?”\n“No.” Kara says. “That just makes you capable of taking care of yourself.”\nLena bites her lip and looks down at her feet. “I feel awful about it, though. I could have actually loved her.”\n“I did – do – love James.” Kara exhales. It feels so good to say it. “He was a good match.”\n“You keep saying that… this isn’t the 1600s where they’ll sell you off for the highest dowry.” Lena giggles. “Though, I think I could match anything James Olsen has to offer.”\n“I’ll have your people call my people,” Kara counters, before going quiet for a moment. She’s searching for the words to tell Lena what a good match is. Lena doesn’t have to know everything, but she could know this. This probably won’t change how she feels. “Where I grew up, we were raised to view relationships very differently than they’re viewed here.” She looks at Lena, watching her for a reaction, but Lena got this unreadable, probably thoughtful, maybe apprehensive, look on her face.  Like she’s waiting for the other shoe to drop.  “Marriage was about status and advancement. Love was never a part of it. Only if the match was truly deemed good would the possibly of children be discussed. We don’t… experience attraction, love, desire, like most.”\n“Are you saying what I think you’re saying?” Lena asks.\nKara shrugs. “I could be.”\n“Oh.” Lena says. She swallows, a little panic creeping into her voice. “I’m not like Lex.”\n“I know.” Kara says. “I would never… if you were.” She exhales, and her fingers twitch, curl into a fist. “But you have your moments. Your alien detector?”\n“It didn’t work on you.” Lena’s eyes narrow, but Kara can see the hurt she’s hiding behind the scowl. Maybe she shouldn’t have said anything. “What are you?”\nThat stings.\n“It doesn’t matter. We don’t exist anymore.”  Kara sighs, fiddles with her glasses. Where the hell is the uber? “I broke it, so it wouldn’t work on me.”\n“Why not just tell me?”\n“Because…” Kara trails off.  Because Lex is your brother and I can’t count how many times he’s nearly killed Kal. Because I hate the idea that you feel the need to out aliens to the rest of the world. Because I hate that you talk out of both sides of your mouth on alien-human interaction. Because I know you’re trying to unlearn that prejudice and I wanted to give you a chance. \n“Because of my fucking brother.” Lena digs in her purse and pulls out a cigarette, lighting it and taking a long drag. Kara blinks. She had no idea Lena smoked.  “Oh this? I quit. Or I keep trying to. Never seems to take.”  She takes another long drag and holds it out to Kara. Kara shakes her head. “Well, I don’t really blame you for being cautious, but Kara, I don’t…” she trails off.\n“Stop making those things. Destroy the blueprints.” Kara swallows. “Think about Mindy. She wasn’t ready to come out. Not everyone is ready for the people around them to know who they are or where they’re from. So many of us are just trying to get by on this strange world. So many of us are refugees.”\nThe uber pulls up and they get in. Lena is silent for a long time, almost the entire trip back to Kara’s apartment. \n“Okay,” she says as they turn onto Kara’s block. “I’ll do it. It’ll be a nightmare for R&amp;D, but maybe we can figure out some other use for the technology.”\nKara feels her face light up. “Really?”\nLena’s head dips. “Yes. Really.”\nWhen Kara kisses her this time, she tastes like smoke, and maybe a little like remorse.\n\n Wednesday— \n\nThe picture of Kara on Lena’s Instagram of Kara has over 700 comments by the time Kara wakes up the next morning. Kara has close to 500 new followers, which is a little intimidating. But she ignores the new faces in favor of reading the comments. The speculation that Kara might be the new lady in Lena’s life is intense. She’s a little concerned at how many posts are already debating why she looks so sad.\nShe calls Alex.  “I told Lena.”\n“Told her what?” Alex asks. There’s rustling in the background. She’s getting ready for work.  “That you think her Instagram followers are scary?”\n“That I’m an alien.”\n“You WHAT?” Alex shouts.  Kara pulls the phone away from her ear. Alex, when alarmed, is capable of deafening pitch. “I’m sorry, I think you just said you told Lena fucking Luthor that you’re Supergirl.”\n“No! I didn’t tell her that.” Kara protests. “Just that I’m not human. I was trying to explain what happened with James and it just sort of… happened.”\nAlex groans. “I’m coming over.”\n“You’ll be late for work.”\n“This is more important than J'onn chewing my ass out for tardiness.”\n \nKara’s doing her hair when Alex lets herself into the apartment.  She’s got three bobby pins in her mouth and just sort of glares at Alex, who glares right back, arms crossed and scowling. “Do you even like her?” Alex demands.\nSpitting out the bobby pins, Kara retorts: “Of course I do, otherwise I wouldn’t have said anything!”\n“So you were what, trying to explain how you and James were perfect and then you just ended things?” Alex runs a hand through her hair, messing it up, realizing what she’s done and groaning. She storms across the room to grab Kara’s hair brush and flat iron. “Is this still hot?”\n“Yes.” Kara says shortly. She picks up her bobby pins. “No, I told her how my I liked James and how I couldn’t – you know what Krypton was like.”\n“Clark was right, fucking pandas, all of you.” Alex mutters. “So you told her about how you’re wired a little different, maybe a little asexual, and somehow the alien thing just… came up?” She tugs the bit of hair that’s stubbornly sticking forward and attacks it with the flat iron.  Kara pins the rest of her hair back and says nothing. Alex pushes, because Alex always pushes. “You wanted her to understand if you have to end it.”\n“I don’t think I will.” Kara swallows, just a little nervous. “She’s… I don’t know… when she kissed me, it didn’t feel like kissing James. Or Charlie or Jenna or Adam.”\n“Wait, you kissed all those people?”\n“I did more than kiss,” Kara mumbles, her cheeks feel like they’re on fire. Alex doesn’t know that. Kara hasn’t really talked about it with anyone.\nAlex’s hand is warm on Kara’s back. “Why didn’t you tell me?”\n“Because they weren’t going to last, I knew that.”\n“But you slept with them anyway?” Alex looks flabbergasted, flat iron in one hand, hair spray in the other. “Kara, you shouldn’t feel pressured –”\n“Isn’t that what humans want in relationships?” Kara moves to the kitchen to get her lunch together.  “Sex doesn’t bother me, it’s good for stress relief and if it’s what they want, I can do that. It’s just… one of those things that I think I’m not as into as most people.”\n“So it’s different with Lena Luthor?”\n“I don’t know,” Kara admits. “I think it might be, though. Kissing her felt different, I felt something that I’ve never felt before. I was too little when I left Krypton to really understand how that worked, but Kal thinks that it is actual attraction. That’s why I told her, because I wanted her to know going into this that it could get… intense for me.”\n“I think it does a disservice to asexual people everywhere if you suddenly stop being ace…ish just because you met the right person.” Alex shuts off the flat iron and sprays her hair once more with hair spray. “Isn’t that exactly what they hate hearing. It’s like you telling me to find the right guy.”\n“I never said that,” Kara points out, Alex rolls her eyes. And okay, maybe Kara implied it. And she definitely feels guilty about it. “I don’t know if that’s it, though… ” She shoves her lunch into her lunch bag and glances at Alex. “Like, I don’t even think I am… like that. It isn’t that, it’s the years on Krypton telling me that relationships are about power, not love or desire.”\n“Well, she is powerful.”\n“So was James! So was Adam! Jenna was the student body president!” Kara could tear her hair out, but she doesn’t mention Cat, because that never happened, but that would have sealed the deal. “It just never fit because I was fighting so hard against that instinct.”\n“And now it does fit.” Alex sighs. “I don’t know what to tell you.”\nKara bites her lip. “I don’t know either.” And somehow, that admission feels hollow.\n \nThere are two press conferences to cover before lunch, and it isn’t until Kara gets back to the office that she finds Snapper Carr leaning against her office door with a cup of coffee and a pensive look on his face. “Lena Luthor isn’t following the script again.”\nWhat now? Kara frowns. “What do you mean, sir?”\n“She’s called a presser, three-ten this afternoon. You’re covering. It’s about some alien detection tech she’s developing.”\nKara feels the lump reappear in the back of her throat and she coughs before nodding. “Of course. How many words?”\n“Depends on what she has to say.”\n \nLena is wearing all white when she steps up to the podium in the L-Corp building’s lobby.  All white and bright red lipstick to go with her bright red nails.  It’s the nails Kara’s drawn to, and how bright they look against the white of Lena’s knuckles against the podium.  Lena is hanging on so tight, and Kara has no idea why. Her face is impassive, though, and it’s only in her fingertips that Kara can sense the trepidation in Lena.\nShe launches into a discussion of the previous quarter’s gains and pauses for questions. Kara gets one in about charitable donations, which were clumped together in Lena’s run down and in the print out distributed by Lena’s secretary.  Lena runs through the list off the top of her head and Kara jots everything down. There’s a few organizations she doesn’t recognize, and a few more she wants to check into before she decides that they’re all above-board.\n“And secondly, I want to discuss a new piece of research that we think could prove very exciting.  Next week, the journal Science is going to be publishing a peer-reviewed article about an alien-detection device that we’ve been working on developing for some time.”  Lena pauses, and her eyes seek out Kara.  Kara feels her blood go cold. She couldn’t – she wouldn’t. Lena inhales, and continues. Kara snaps her pen in half. “While this device was created with good intentions, L-Corp has come to believe that this technology could be used for ill in its current state.  We are going to be pulling the researchers who conducted the peer review into a few meetings to determine if there is a potential future for this technology and research, potentially within the medical field. The article in Science was perhaps allowed to go forward too early, before the events of the past few weeks here in National City took place. I cannot, in good conscious, allow this study to be published without addressing it first. I would like to take the opportunity to assure any alien resident of National City, or the world, that this device in its current form will never see the light of day.”\nKara, covered in ink and scribbling furiously with a borrowed pen, meets Lena’s eyes and nods, just once. Lena’s grip on the podium relaxes. She takes questions.\n \nIt… isn’t a good press day for L-Corp. Kara writes a pretty scathing article and Snapper approves it with only minor edits.  The company stock dips a bit and then a lot. Cat sends an annoyed message about her investment portfolio hidden in a compliment about the bite to the article.  Kara sends her a polite one back citing anti-alien bigotry in her investments and Cat responds with a series of emojis that sort of make sense but mostly just confuse Kara.\nSo Kara calls her.\n“Forgive me for having a diverse portfolio.” Cat says it in lieu of a greeting. “But rest assured, if you want it dropped, I will call my broker as soon as we’re through.”\nKara doesn’t really know what to say, because Cat’s offering her something Kara never thought possible or reasonable: humanity without even an ounce of judgment.  She knows how Kara feels about alien rights (probably because she knows Kara is Supergirl and is just … not mentioning it) and she’s respecting that though her actions. Kara doesn’t want Cat to stop investing in Lena’s company though, because Lena did the same thing, she took a massive hit in the press in order to keep a promise to Kara. So she settles on the background because that, at least, feels safe. “She showed me it, ages ago. Last night, I told her to destroy it.”\n“And she just did it?” Cat sounds amused, interested. “Little Kara Danvers, got the elite of National City wrapped around your finger now, don’t you? A regular Lois Lane.”\n“I think her relationship with those in power is much more hate than love, Ms. Grant.”\n“Be that as it may,” Cat says. “I’m impressed that you’ve managed to gain so much clout with a Luthor in such a short time.  You Millennials and your social media-based friendships, I always forget how easy it is for elbows to rub across social class.”\nKara bristles at the insinuation, but that’s just how Cat is, she’s pretty used to it. But she doesn’t want Cat to get any wrong ideas about these things, so she says, perhaps all in one breath: “Well, that and Snapper’s been having me cover her and L-Corp a lot.”\n“Oh, so it’s not just an Instagram friendship of convenience now?” Cat is actually laughing now.  “Good for you, Kara. She’s a lovely girl, perhaps a step down if you look at your past relationships, though. She’s still wet behind the ears.”\nAnd Kara, feeling suddenly emboldened and just a little curious, asks a stupid question. “You being that past relationship, Ms. Grant?”\n“Perhaps,” Cat says and she sounds nostalgic. “Call it a might-have been. I—I miss you, Kara. It’s very quiet in my life without you zipping in and out.”\n“What are you up to then?”\n“Can’t exactly tell a reporter just yet, now can I?”\n“Could you tell a friend?” Kara tries not to sound hopeful. “I mean, if you wanted to?” She’s kept far bigger secrets for Cat than this.\n“Maybe,” Cat says. “But it’s too soon, and you’ve got something else brewing, don’t you?”\n“I’m so-sorry?” At this point, Kara’s completely lost. Cat’s speaking in layers and it drives Kara up the wall when she does that. Mixed signals. Kara chews on her fingernail.\n“The Luthor girl. She put that picture of you up on her picture feed for a reason, Kara. It’s staking a claim. Ballsy, but not without merit.”\n“Ms. Grant, I...”\n“I’m merely concerned, Kara. She’s a Luthor, and you’re, well...” Kara does, but she’s grateful that Cat doesn’t voice the truth.  “She took a risk for her company, and she did it just for you. That’s interesting. Wonder who’s side she’s on.” And Cat hangs up, leaving Kara confused.\n \n“I think Ms. Grant knows.” Kara ducks under a beam and peers through the gloom.  There’s supposed a CADMUS weapons cache somewhere around here, according to the guy they caught the other day who shot up the #alienswelcome protest. The guy who knew old Kryptonese insults and how to hurt someone from Kandor with just a word. Kara’s still very suspicious of him, but J'onn won’t let her into the interrogation room to find out more about him.\nAlex trains her flashlight against the wall, and Kara looks past the walls to see if there are any chemical signatures still radiating that suggest off-world technology. She stares through them and sees the grains in the wood, the clapboard and the molecules of atoms vibrating, locked in tight concert to create steel beams. There’s nothing alien here, just lots of slur-laden graffiti.\n“Damn, you’re just a parade of telling secrets today, aren’t you?” Alex grumbles. She pans her flashlight over the graffiti. “Also, you’re still talking to her?”\n“She’s a friend.” Kara shrugs. “I talk to her from time to time. She doesn’t approve of my being friends with Lena Luthor.”\n“The woman has sense.” Alex mutters.\nIgnoring Alex, Kara contemplates the red paint on the walls. #ETGOHOME is everywhere. She touches it, and her fingers come away wet. “Do you think it bothers Spielberg that they’re stealing a line from his movie for their protest?”\n“I don’t think he cares one way or the other. He’s been noticeably mute on this issue. But he’s also got buckets of money to put toward the cause, if he’s so inclined.” Alex pulls out her camera and passes Kara the flashlight.  “The DEO used to be this bad, you know. Before –”\n“Before Superman?”\n“And the JLA.” Alex snaps a photograph of the wall. Kara, after a moment’s thought, pulls out her phone from the pocket in her lower back and takes a few of her own. She’s got an idea for a story that might pique Snapper’s interest, and having the documentation isn’t a bad idea.  “When J'onn took over, hell, when I started, we’d just lock up any alien we encountered. I sometimes wonder what side we’re on.”\n“Well, the president, she—”\nAlex holds up her hand, unclipping her gun and drawing it in a fluid motion.  Kara passes her back the flashlight wordlessly.  There’s movement, somewhere on the edges of building. A chain-link fence rattling.  Kara glances at Alex, who nods, before lunging forward, pushing her body faster and faster into action.  She lives for moments like this, when she can spin through spaces at speeds that make her mind dizzy. Kara draws breath, her hand shooting out, grabbing the collar of the interloper – slim, dark hair, feminine build, carrying a signal jammer and…\n“Lena?”\n\n\nThursday – \n\n\nIt’s after midnight and Kara is pacing the length of the DEO bullpen, back and forth, back and forth, glaring down the hallway to the interrogation rooms. She wants to be in there, she wants to know what the hell Lena was doing in there.\n“You’re going to wear a hole in the floor,” Winn comments from where he’s paging through Lena’s life. He’s got the L-Corp holdings pulled up on his computer and is bumping them up against a list of known CADMUS sympathizers. “Which probably isn’t going to improve Henshaw’s mood.”\nKara’s fingers flex and she spins, splintering the linoleum under her toe.  J'onn can just try with her after what he said to her when Alex called in the intruder to the compound.  He can just try.\n\nWe’ve been waiting for this.\n\nA frustrated sound escapes Kara’s lips.\nWinn sighs and sits back, playing with his pen. “Do you want to talk about it?”\nKara exhales heavily through her nostrils. They flare.  Winn eyes her, skeptical. “I just want to know why she was there. She has no business being there. Not with what she was carrying. Not dressed like a cat burglar.”\n“Ah yes, the signal jammer and the collection of surveillance equipment that’s so cutting edge that we don’t even have some of it.” Winn lets out a low whistle. “If she was the one who built it, I would love to pick her brain.”\n“No.” Kara says just a little forcefully, just a little rudely. She doesn’t want Winn to spend time with Lena if she’s about to get locked up. That isn’t fair – she’s Kara’s – and wow if that thought isn’t just a little too intense and primal for Kara’s liking.\n“Fine,” Winn grumbles. “Well, I couldn’t tell you what she was up to, but it doesn’t seem to be… like, bad bad?” He clicks his pen. “I’m more concerned about how there’s someone on her social media who knows how to stay words that really push your buttons and how they’re bandying them about like slurs for anyone who’s pro-alien. The #ETGOHOME guys are clearly in the loop when it comes to alien knowledge. They could even be aliens.”\n“How could aliens want that?” Kara says. But she’s already thinking about it. It’s the same, age-old issue that’s been at the edge of her mind since she first started to realize that there were other aliens running around on earth besides herself and Kal. There are good ones, and bad ones, and folk who fall somewhere in the middle of both of those two extremes. Kara knows this. She’s known this for ages and yet somehow, what Winn’s suggesting seems almost comically implausible. Like the sort of thing that could only happen in the movies, never in real life. Aliens protesting against an alien presence? That’s farcical. \n“Maybe they’re just sick of the Fort Rozz types going around and messing things up for them?” Winn suggests. “It can’t be easy, just being an average Joe sort of alien and not being able to just be because people are too obsessed with the scary ones.”\nKara sucks her lower lip into her mouth and scowls. Because it makes sense. \n“I guess. I honestly haven’t ever really thought about it… or my role in all of that.” Kara runs a hand through her hair and it gets caught in a tangle. She winces. And tugs it out. “But Lena… she was in a place with that – those – that’s where the #ETGOHOME idiots have set up their home base.”  Kara gestures helplessly. “That isn’t good, Winn. How the hell did she even know about it?”\n“I followed you there, well, I followed Agent Danvers.” Kara and Winn turn as one, to see Lena standing beside J'onn and Alex, looking tired with her hands jammed into her pockets. J'onn's got the grim sort of look on his face that says that he’s had far, far too long a night and Alex just looks exhausted. But Lena hasn’t been thrown in a cell somewhere, which Kara thinks is an improvement.  She brightens, but then remembers that this is Supergirl, not Kara, so she coughs.\nLena looks up at Kara through her lashes, and her lips quirk and her tone turns flirty. “I hope that was alright, Supergirl.”\nThere’s something about the way that Lena says ‘Supergirl’ that tells Kara that the cat’s out of the bag, and Lena’s playing coy with the truth.  Kara looks to Alex for confirmation, but Alex is busy with something on her phone. Kara’s cheeks burn and she coughs to cover the awkward silence that’s brewing. “It probably isn’t a good idea for a civilian to enter an area like that.”\n“I was armed.” Lena points out. Kara resists the urge to roll her eyes.\n“Why did you do it?”\nLena moves to stand behind Winn. “May I?” she asks, gesturing to the computer.\nWinn throws a nervous glance over his shoulder at J'onn, who nods, just once. “Don’t break anything.” He says, getting up. “And don’t adjust anything.”\n“Wouldn’t dream of it.”  Lena closes out of his program in a few clicks and Kara loses track of what Lena’s doing after she inserts a flash drive and starts to open files. She runs the DEO's software through some sort of encryption algorithm before she pulls up a series of email accounts and… her Instagram feed? Kara takes a step forward, arms wrapped around herself.  “I’ve been tracking the #ETGOHOME protests for some time, ever since the first one.  I wanted to be able to bring the correct people to the CatCo symposium…provided that’s still on?” Her gaze slides to Kara and Kara groans inwardly. She totally knows.  Fuck.\n“I’ll er—ask Kara about that.”\n“I’ll probably see her before you do, don’t worry about it,” Lena keeps going, conversationally. Alex coughs. Kara looks over her shoulder, and Alex is glaring at her.  Told you so her expression says. Kara turns back to Lena and pretends not to notice. “A few weeks before the first #ETGOHOME protest in National City we had a small hack down in R&amp;D. Nothing too major, but that was when the news of alien detection device first started to leak to the fringe parts of the Internet. We had a full lid on that device. The NDAs we had the peer reviewers sign were unbreakable. So when word started to get out about it, and after the hack, I assigned some of the more ah, skilled members of our IT department to look into it. I knew, given the nature of the protests cropping up ever since the president’s law passed, that there’d be a connection between those protesters. So I assigned our IT crew to keep closer track of who’s posting in the #ETGOHOME hashtag and who’s geotagged as being at the protests via social media. They found an interesting connection.”\nLena pauses, opens a video file. Winn leans forward. “That’s when the protests turned violent.” Kara’s seen this video before. They had it on loop over the weekend, watching over and over as the two protests clashed, looking that the concussive force of that weapon and trying to figure out where it came from.\n“Look who started the initial fight.” She opens a window and zooms in on a young woman’s picture and a collection of social media accounts.  Then she flips back to a frame grabbed from a video clearly clipped from Snapchat.  “Same girl.”\nKara’s eyes go wide. “That’s one of your Instagram followers. Like one of the five you follow back.”\n“I suppose I should be flattered that you read my feed so closely, Supergirl.” Lena’s tone is still light, still flirty. Kara can practically feel Alex glaring at her, admonishing her in her mind. Kara’s screwed up, she knows it now. “But I actually follow eleven people.”\nWinn tilts his head. “Is that a facial recognition algorithm that interacts with Snapchat? Because if so… can you tell me how it works?”\n“Trade secrets, I’m afraid,” Lena says. “The DEO is welcome to bid on the tech when we release it.” She’s looking Kara as though daring her to comment, daring her to say anything that’d be confirmation.\n“So what do we do about it?” Alex asks. She’s moving forward now. “Print that.”  Winn leans forward and shows her where the printer key is on his self-built system. “If this girl is who you claim she is, Ms. Luthor, we’ve got a bigger problem.  She’s got an alien connection of her own, or she could be one herself, that weapon she used to start the first series of fights wasn’t something to play with.”\n“Well, I think the first thing is to go back to that warehouse and put in my surveillance equipment.” Lena says. “That’s their base of operation.” She picks up Winn’s pen and tugs a sticky note off of the stack by his desk.  J'onn’s been on Winn about leaving company secrets on sticky notes, but for now, Kara actually appreciates it, as Lena’s writing down her number for Supergirl and pressing it into her hand. “I figure that you’ll want to be in touch.”\n“I could just get your number form Agent Danvers,” Kara says, tucking the sticky note into her sleeve. “But I agree with you that if that is the base of operation, we need to keep an eye on it.” She looks to J'onn. “Are you comfortable using Ms. Luthor’s equipment?”\n“We’ll discuss it.” J'onn steps forward and takes control of the situation, barking out orders and telling Kara to take Lena home, but not before Winn checks her cell phone and ensures that the DEO has tracking on it.  Lena’s not too keen on that, but surrenders the device without much of a fight. Winn chats with her, smiling at her. Kara’s fingers twitch and she wants to tell him to go away, the words struggle to escape her throat and she’s just… she can’t get it out.\n \nKara ties a blindfold around Lena’s eyes, her fingers gentle. “I’m sorry I have to do it this way… but you can’t know where the base is.”\n“It’s fine,” Lena says. “Better than the bag over my head when we came here.”\n“Are you okay with me flying you back to your office?” Kara asks. “Because we can drive too. Or go to your apartment… but you’d have to tell me where it is.”\n“I’m having a hard time picturing Supergirl in a car.” Lena chuckles.  She fiddles with the blindfold. “I don’t care much for flying, but I suppose it is quicker than trying to get an uber at this hour.”\nKara’s fingers twitch. She wants to kiss Lena like this, to see if she’d be able to tell. To actually feel compelled to kiss someone is alarming for Kara, but not… all together unpleasant.  She puts away the information and takes Lena’s hand, pulling it gently away from the blindfold.  “Well, I’m happy to be of service.” She really does like to please.  “I’m going to put my arms around your waist, alright? I want you to keep your head down, because I don’t want to hurt you when I turn.”\n“G-forces?” Lena asks.\n“Yeah,” Kara says. “I like to go fast.”\n“Sounds fun, minus the whiplash.” Lena steps forward in the general direction of Kara. Her hands rest on Kara’s shoulders, sliding down across the insignia of the House of El. It’s such an intimate gesture, that when Kara’s trembling hands settle on Lena’s hips and pull her even closer, the urge to kiss Lena is so strong that Kara feels as though she’s going to die if she doesn’t do something. Lena’s fingers come up to grip the edges of the cape that falls around them both.  “Kara,” she whispers, and her tone is so insistent, so pleading, that Kara aches inside for want to kiss her. “I’m not going to tell.”\nShe can’t though. She can’t kiss Lena. Can’t do anything other than grip Lena tighter and pull her from her feet to fling them both from the waiting window. Lena can’t know about Supergirl, even if she’s guessed.  Confirmation isn’t an option. Not until Kara’s sure.\n(And Kara isn’t sure she’s ever going to be sure.)\n \nWork is slow, it drags on a scant few hours of sleep. Kara’s still looking through that data for Snapper and emailing back and forth with James and Lena about the round table CatCo’s still going forward with on alien rights.  Lena supplies the troubling details regarding the involvement of her Instagram follower, and Kara has the good sense to pretend to be horrified. It’s pretty transparent, and James IMs her privately to tell her that she’s about as obvious as snow on a mountainside.  Kara tells him that she doesn’t know what he’s talking about. \nOlsen, James: You really shouldn’t be talking about that stuff over company computers. Think about how easily they could be hacked.\nDanvers, Kara: You forget that the guy who built our security currently works for a top secret government organization.\nOlsen, James: I know, but I worry. Especially given the apparently technical prowess of L-Corp. I don’t want any corporate espionage.\nDanvers, Kara: You’re being exceptionally paranoid.\nOlsen, James: Once a Luthor, always a Luthor. They’re bad eggs.\nDanvers, Kara: I happen to like that egg.\n\nOlsen, James is typing…\n\nDanvers, Kara: In a totally platonic, in-no-way-did-she-kiss-me sort of way.\n\nOlsen, James has entered text.\n\n“Shit,” Kara says. Maybe that wasn’t the best thing to tell him, but she’s never been particularly good at keeping secrets from people. And it’s so different with Lena that she forgets that maybe not everyone is going to be supportive.  It’s almost cruel to James, to make it worse in trying to counter the awkwardness of this.\nDanvers, Kara: I’m sorry.\n\nOlsen, James is typing…\n\nOlsen, James: I suppose we were going to have this conversation sooner or later. I wasn’t expecting it to be about her, gotta say.\nOlsen, James: Does Clark know?\nDanvers, Kara: That depends on if you’re going to tell him.\n\nOlsen, James has entered text.\n\nTime stretches on, on and on and on. James doesn’t say anything.  Kara twitches, fidgets, stares at the time stamp, breaks her pen in half.  Finally, after going to the bathroom to wash off her hand, she pulls up the IM window and types a short message.  She will not be ignored.\n\nOlsen, James has entered text.\n\nDanvers, Kara: I’m coming upstairs.\n\n \n\nIt is, Kara will admit to Alex later, the first real fight she’s ever had with James.  They didn’t even fight when they broke up. She goes up to Cat’s old office and pulls him out on the balcony so they can yell at each other without anyone knowing.  Kara yells.  She punches a hole in the railing and James throws a flower pot. Kara was never there when it was bad with Lex, he says. Kara was never there when Clark almost died, he says. Kara never knew about how shit it was for Clark watching his best friend turn into the monster that is Lex Luthor, how could she, she was squirreled away on the other side of the country.  That family is poison, awful toxic kryptonite that will destroy her if she lets them get too close.\nKara pushes back, because it isn’t fair of him to tell her who she can and cannot see.  They broke up, didn’t they?  That’s when James throws the flower pot, tells Kara that he’s still upset about it when Kara thought they were cool.  The railing crumbles under her hands.  Cat’s going to murder her when she gets back, but Kara can’t get her hands to stop shaking. She swallows. James is making this about him and about Clark. “Clark shut me out, James. He left me with the Danverses because that was where he thought I could be safe. He was 25 and in no position to parent someone older than him!” Kara draws a breath, and then another. “I’m not him, James. Lena’s not Lex.” She scowls. “Defining women by the men in their lives when the men in their lives threw them away when they were needed the most – that’s cold, cruel.”\n“That’s not what I’m doing.”\n“Think about your words.” Kara grinds out.  She stands well away from anything, because the anger is back, and it isn’t about James. It really isn’t. “Think about what you’re saying. You know how hard this is for me, James.”\n“It’s hard for me too.”\n“You have Lucy.”\n“That doesn’t mean I don’t feel sad about losing you.”\nThe fight isn’t about Kara or James, or Clark or Lex or Lena. Or Lucy Lane and her pretty smile and the fact that James was probably still in love with her the entire time he and Kara had their thing. It’s about so much that they’re not talking about and Kara goes home feeling absolutely miserable. About the clash between their two cultures that’s resulted in protests and violence in the streets, in twitter wars and controversial new laws. James isn’t anti-alien by any means, but the tension is still there, still simmering. There’s a cultural clash. And it cuts Kara up inside, because James was supposed to get it.  She calls Alex, who comes over with pizza and holds her while she cries great shaking sobs into her clenched fists, grinding the smooth stones Alex tucks into her hands into dust. \nLater, when Alex has dozed off on the couch and Kara’s tucked her under a blanket and moved her so she’s curled on her side, Kara calls Lena.  She goes up to the roof of her building, where she can see the L-Corp building and stares up at illuminated lights of the executive floor, one of the few still illuminated at this late hour. \n“I had a fight with James.” Kara says. Lena is typing.  She pauses when Kara’s voice hitches. \n“What about?” The concern that seeps into her voice is gentle, kind, and exactly what Kara wants to hear.\n“You.”\nLena sighs. “Had you not mentioned us to him?”\n“No,” Kara screws up her face.  “Look – could I come over? You’re still at the office. I just… need a neutral space.”\n“How did you—”\n“Your building is pretty close to my place, I can see your lights on from the roof.” Kara says. “With the hit you guys took yesterday, I figured you’d still be working.”\n“You’re not wrong.” Lena’s typing again. She pauses, hits the spacebar on her laptop loud enough to be heard across the line. “My office is my turf, Kara, that’s hardly neutral.”\nBut Kara’s already pushing off her feet and drifting into the sky. “It’s what I need, right now.”\n \nJess is watching the football game on one of her monitors. She barely glances up from her stack of paperwork and outgoing mail that makes Kara wince with sympathy when Kara drifts into the reception area of the L-Corp offices.  “You’re up late.” She says, tone deliberately mild. Distaste colors her features for a moment, but that could have something to do with the play on screen.  National City is playing the Metropolis Sharks tonight.  If she hadn’t had that awful fight with James, she might be out with him and Winn, watching the game in a bar somewhere. “This isn’t a good time.”\n“She knows I’m coming,” Kara answers, crossing to the elevator and pushing the call button.  “I called ahead.”\n“You didn’t call me.” Jess scowls. “I keep her schedule.”\n“Well, I doubt she’s got meetings scheduled at eleven o’clock at night.” Kara steps into the elevator when it arrives. It’s with a wicked, slightly mischievous smile that she certainly does not feel beyond a want to annoy Jess, that she says: “Goodnight, Jess.”\nJess just glares as the elevator doors close.\n \nLena is bathed in a pool of lamplight when Kara arrives in her office. She’s curled up at her desk, her shoes off and cup of steaming coffee beside her. The throw blanket from the couch is around her shoulders and her feet are tucked up under her. She looks frazzled, but alright, as tired as Kara feels.\n“I almost expected you to just materialize,” Lena says, reaching for her coffee. There’s a lipstick stain on the lip. “Or is that not what you do?”\nKara shrugs. “That’s never really been my thing.” She steps forward, and then, faster than she should move, she’s behind Lena, staring out the window. “I can move quickly, though, when motivated.”\n“To look at my view?” Lena gets to her feet.  She seems unbothered by Kara’s rapid movement, but when she comes to stand beside Kara, her fingers brush up against Kara’s forearm, as though to make sure she’s still there, still real. They stand there, for a moment, Lena just barely touching Kara, looking down at the city. The throw is discarded on her chair. “Where’s your building?” Lena asks.\nIt takes a minute of looking through the buildings to find Alex, sleeping on her couch. Everything looks a bit different from this position. When she has her bearings, Kara points. “There. I left my sister sleeping on my couch.”\n“So you can’t stay long?” Lena asks. There’s something about her that makes the hairs on the back of Kara’s neck stand on end, the way she leans in, just a little too close, the way she smells like old fashioned perfume and just the hint of a bad decision.  It all settles at the pit of Kara’s stomach like something forbidden and tantalizing.\nAnd maybe it’s Kara who bobs to Lena’s weave, or maybe it’s the other way around, but Lena’s kissing Kara gently, her fingers twining with Kara’s. She’s soft with exhaustion. Kara can feel it in the way she takes shortcuts, tugging and pulling until she’s sitting back in her chair and Kara’s pulled into her lap.  When they break, and Kara’s got lipstick smeared across her mouth and Lena’s looking up at her like she’s the entire sun, Kara bumps their foreheads together.  “You work too much.” She rubs her thumb across Lena’s lower lip, fixing where her lipstick is smudged.\n“So do you,” Lena points out, and there’s a layer of implication there that makes Kara’s stomach flutter uncomfortably. “But I have to work. I’m the only person who can make this company profitable again.” She doesn’t mention the stock hit she took on Kara’s behalf, or the series of interviews she’s done on a few local radio stations, and a few senior CatCo reporters trying to undo the damage she did at Kara’s behest. Kara doesn’t mention it either. “Sacrifices of sleep can be made, I think, once and a while to do a job well.”\nLena’s fingers are on Kara’s hips, holding her steady, dipping just below the thin cotton of her shirt. Kara curls into her shoulder, lips brushing against Lena’s neck, marveling at how Lena shivers at the contact.  “Am I distracting you?” she asks.\n“You’re a welcome distraction.”\nLena’s desk chair rolls then, and they both lurch to the side.  Kara laughs, pressing a kiss to Lena’s nose and getting off her lap. “We’re going to die if we stay in that chair,” she says.\n“You might be right.” Lena’s powering down her laptop and stacking papers on top of it.  She leans over her desk and her necklace trails down almost brushing the clean white surface of it. Kara’s filled with this incredible urge to reach forward and wrap it around her fingers, to use it to bring Lena back to her.  She tucks her hands into the back pockets of her jeans, biting at her lip while Lena shoves the stack of laptop and papers into her purse.  “Do you want to get out of here?”\nThere’s nothing Kara wants more. She pulls out her phone and texts Alex that she’s gone out and not to worry. Lena puts her shoes back on and rises to almost Kara’s height before getting her coat and putting the throw back on the couch. Kara follows her out of the office, waiting while Lena turns off lights and locks up. Lena hands her a tissue as they get on the elevator. “For the,” she gestures to Kara’s lips. “It isn’t a good shade on you.”\nKara had completely forgotten. She scrubs dutifully, and is mostly put back together by the time the elevator opens. Jess is still scowling when they go past her desk, but she’s wrapping up.  Lena asks her about the outgoing reports, and what the numbers are looking like in Tokyo and Shanghai; Jess replies promptly and Lena brightens a little. Good news, it seems.  She glances over her shoulder at Kara at something Jess says and shrugs.  “I’ll see in the morning.  Come in at eleven. It’s been a long night and I can manage without you for a few hours.”\n“You should sleep too, Ms. Luthor.” Jess glares at Kara.\nKara turns bright red, the implication lays heavy in the air around them.  The back of Lena’s neck is red. Jess begins to get her things together, her hair falling into her face.\n“I intend to, Jess,” Lena says curtly. She pulls her ID out of her purse and turns to Kara.  “Shall we?”\n\n\nFriday - \n\n\nLena’s apartment is a loft in the arts district and is smaller than Kara expected. Its cozy, decorated in the same clean, sleek way her office is. Everything in its place, but with a far more homey touch than her austere workspace.  Lena leaves her things by the door and yawns.  Kara toes off her sneakers.\n“I just want to sleep.” Lena says. “If that’s alright. It has been a very, very long day.”\nIt’s honestly the nicest thing anyone’s ever said to her in a situation like this. A lifeline, something she doesn’t need to take, but at the same time, one she definitely will. “That’s all I want too.”\nLena sets her keys in a dish on the breakfast bar and scoops up her mail, crossing to a device tucked away in the corner of her kitchen.  Kara leans on the breakfast bar and watches as Lena runs each piece of mail through the device – a scanner - and then checks each piece of junk mail and catalogue over for signs of tampering before throwing them into recycling bin.  “Do you want this Bed, Bath and Beyond coupon?”\nKara shakes her head. She’d never get over there before it expired. Lena shrugs and pitches it as well. Lena sets her actual mail beside her keys, presumably to be looked at in the morning and glances around.  “Okay.” She seems to come to a decision, seems to settle herself to the point where she can relax. “Do… you need anything special to sleep?”\n“Are you going to care if I take off my pants? I get hot.”\nLena gives Kara a look that strips her naked. “No,” she says, rolling the words. “I wouldn’t mind at all.”\nThe bedroom is behind a half-wall to provide the illusion of privacy.  Lena rummages in a few drawers and under the bathroom counter before finding a spare tooth brush for Kara and changing into her pajamas. Kara brushes her teeth and then vacates the bathroom to inspect Lena’s bookshelves. She pulls books off at random, noting that the books on electrical engineering and architecture seem to be the most well-read. There are only a few novels. Most of the fiction Lena keeps are short story anthologies.  There are a handful of family pictures around.  Kara stares up at a smiling Lex Luthor with his arm around Lena, clad in a graduation cap and gown, her expression growing dark.\nMaybe this isn’t a good idea.\nBut then she remembers Astra, she remembers Non. Is that not the same? Wouldn’t Kara kill for some sort of documentation of the better times she’d shared with them?\n“We can’t choose our family.” Lena says, eyeing the photograph when she comes back in from the bathroom.  “That’s one of the happiest days of my life, one of my happiest memories of Lex… yet I know who he is and what he’s done.”\nKara nods and turns away.  Lena’s face is scrubbed free of makeup and her hair’s braided loosely down her back. She’s wearing a t-shirt with the MIT crest printed on it and leggings and is turning down the bed.\n“I um, I sleep on this side.”\n“Okay.” Kara sits on the edge of the bed and shimmies out of her jeans and unclips her bra underneath her shirt.  She leaves both in a pile on the floor, retreating under the covers before her semi-nakedness can draw wandering eyes.  Not yet, not yet. But she wants it. She’s exhausted now, and it’s really hitting her. Lena’s bed smells good, Lena smells good, and this is… this is what Kara wants.\n“You said you were a refugee,” Lena says, drowsily, turning off the light. “Say something in your native language.”\nKara rolls over onto her back, staring up at the blackness above them.  She looks up, through it, into nothing. “Goodnight, Lena,” she says quietly. Lena’s name with Kryptonian inflection is beautiful.  She follows it with a prayer – a call to Rao to rise again on the morrow – and it’s as Lena’s fingers tangle in Kara’s hair and tilt her head sideways to press a sleepy, gentle kiss to Kara’s lips that Kara realizes that she hasn’t said this prayer since she arrived on earth.\n \nIt’s Lena’s phone that wakes Kara up in the morning, vibrating gently under the pillow. Lena stirs, curls further into Kara, and goes still once more.  Kara doesn’t dare breathe for fear of waking her.  She stays perfectly still, allowing herself to relax into the slow, steady breathing of sleep once more. Lena’s fingers are fisted in Kara’s shirt, she got her other arm tucked under the pillow and her lips are parted. Kara wants to kiss her, but not without her consent. Not without her being awake to say yes.\nThe phone buzzes again and this time Lena makes an annoyed grunt, fumbles for it under Kara’s pillow, and silences it.  She rolls onto her back and blinks at the screen. It’s six-thirty. Someone’s sent her a direct message on Instagram.\n“’s too early,” Kara grumbles, turning over. Lena’s crazy followers can wait until Kara’s feeling less groggy. And after she’s consumed at least a pot of coffee.\nBut Lena’s prodding her in the side. “Can you get in touch with Supergirl?”\nKara’s eyes fly open, because that’s not something she’s been expecting. “Why do you need her at stupid o’clock in the morning? She could be sleeping. I could also be sleeping.”\nLena passes Kara the phone.  Kara squints at it, willing the letters to come together into something that makes sense. The message is short, from an account with no followers and no posts. Kara has no idea how they even managed to message Lena. “Aren’t your—”\n“Yes, my privacy settings are like Fort Knox. I’m not stupid. This – this is something that Supergirl is going to want to know about with the protests in town.”\n“I can see that.” Kara mumbles, turning back to the message.  “Your disloyalty to the cause will come with a heavy price – dramatic, don’t you think?”\nLena purses her lips, looks down at her hands.  “Can you call her?”\nKara shakes her head, hating the lie, hating that it’s so transparent. “I can’t call her, but I can call my sister. She’s probably better connected to help you out. Is that okay?” Lena’s head dips once. Kara leans over the side of the bed.  She pulls her phone out and punches in Alex’s number. “Hey – it’s me,” she says when Alex answers.\n“Do I need to go buy Plan B?” Alex’s tone is teasing. Kara’s cheeks burn.\n“Not how it works,” Kara points out.\n“You just left Kara, where the hell are you?\n“I’m with Lena.”\n“You’re where?”\n“I was wondering if you could get some guys from work and come over,” Kara says, hoping – praying that Alex follows. “Lena’s just gotten a creepy message on her Instagram, and she’s freaking out. It… apparently isn’t the first.”\n“I can do that. Dark glasses and combat gear works wonders on anxious women with nothing to worry about.” Alex is the actual best; Kara exhales, thanks her and hangs up.\n“She’s coming over…” Kara trails off, glancing at Lena. “Is this the first time it’s happened?”\n“No,” Lena says, just a bit too forcefully. Her shoulders are shaking, trembling. “Usually I can figure out where they came from. Usually I know before they come.”\nKara takes Lena’s phone from her and sets it and her own on the bed side table.  She pulls Lena close and holds her. “Who sends you these messages, usually?”\n“Lex,” Lena says. “Who else?”\n \nLena takes a few minutes of lying in Kara’s arms to pull herself together before she disappears into the shower. Kara gets up and attempts to figure out Lena’s coffee situation before she gives up and retreats into her twitter feed. Kara fidgets with her phone, debates calling in sick, and nearly jumps out of her skin phone when it rings. Snapper’s on the line, tells her that she doesn’t need to come into the office today because she’s been put on the protests with a more senior reporter because his usual print counterpart is out with the flu. She’s to meet Jefferson Kingston at a coffee shop on 5th in an hour and they’ll plan their attack there.  “And Danvers?” Snapper says as Kara makes to hang up.  “Make sure to bring an extra battery for your phone. This could be a long night.”\n“Yes sir, of course sir.”\nKara sits at Lena’s kitchen island and drags a hand through her hair.  Her phone is half dead as it is. She checks her twitter feed again, eyeing the protest hashtag that’s already exploding.  This is day six. She would have assumed it’d’ve died down by now. And damn, her phone is going to die if she doesn’t do something about it. She gets to her feet and goes to knock on the bathroom door. She waits a second before cracking the door open. “Hey Lena?”\n“Mn?” Lena sticks her head, dripping wet and with a toothbrush hanging out of her mouth.\nThe flush that colors Kara’s cheeks is so hot it burns. Lena pulls her toothbrush from her mouth and flashes Kara an encouraging grin.  Kara remembers what she’s barged in to ask, and holds up her mostly dead phone. “Do you have an iPhone charger?”\n“Check my laptop bag.” Lena says, and retreats.\nLena’s laptop bag is by the door, and Kara’s just found the cord in the tangled mess of wires Lena keeps in the front pocket of the bag when there’s a knock on the door.  Alex is there, with two DEO agents that Kara recognizes in passing but doesn’t know well enough to be on a first name basis with them as Kara Danvers.  Kara opens the door, cord still in hand.  “Hey – Lena’s in the shower, come in.”\nAlex gives her a once-over. “You look like crap. Did you sleep in your clothes?”\n“I took my pants off.” Kara scowls. “Like a normal person.”\nAlex’s grin turns a little wicked. “That it?”\n“Oh my god.” Kara throws up her hands. “Not right now, Alex.” She shoos Alex and her DEO agents, Marcus and … maybe Jamie (she can’t remember) into the apartment before going to plug her phone in. She tells Alex about the message and how Lena’s pretty shaken up – she doesn’t show it to Alex because there’s a passcode on Lena’s phone and while Kara’s pretty sure she knows what it is through simple elimination and mathematical probability, she’s not about to violate Lena’s privacy like that.  So instead she tells Alex that she’s been assigned to cover the protests, so she’s glad Alex is there, because she’s going to have to run home and get ready and she doesn’t want Lena to be alone.\nThe shower’s off, and Lena appears a few minutes later, hair still damp and frizzing in the early morning light as it starts to dry.  She’s dressed for work, a dark colored dress that offsets the casual nature of this encounter. Kara’s impressed by how calm she is, how unfazed she seems after the conversation they shared earlier. “Agent Danvers,” she says. “Good morning.”\n“Ms. Luthor.” Alex says, and the entire tenor of the room shifts from casual to business like. “Kara was telling me that this isn’t the first time you’ve received a message like this.”\nLena nods. “The messages aren’t a new development. My brother – well, his surrogates – have a knack of hacking through my encryption. He thinks it keeps me on my toes, much like the assassination attempts.” There’s a moment then, when Kara looks up from tying her shoes, when Lena looks so small and so worried, that makes Kara’s heart break a little inside. All she wants to do is stay and make sure that Lena’s going to be okay – but she can’t. Snapper wants her and Jefferson Kingston is probably waiting for her at the coffee shop already.  “Though,” Lena continues, “I have to say I do prefer the threatening messages over the near-death experiences.”\nAlex lets out a little grunt of laughter. “Can you show me the message?  I want Agent Rameriez to have a look at it.  Jamie, get the laptop too.” She turns to Rameriez – Jamie – and seems to have a silent conversation with her before her gaze wanders down to Kara. “Are you headed out?”\n“Yeah,” Kara gets to her feet. “I have to cover the protests today with Jeff Kingston; Cassandra Mullen is out with the flu. I would stay a little longer, but I need to… you know, get my things.”\n“You’re leaving?” Lena looks so betrayed, so hopeless, that Kara’s fingers flex with the urge to go to her phone and call Snapper back and tell him she’s got the flu too.  But she knows she’ll be more useful at the protests, because if they’re already active at just barely seven in the morning, she needs to be there – both as Kara and probably as Supergirl as well.  There’s no way that it isn’t going to turn ugly tonight.\nA weak smile pulls at Kara’s lips. “I wish I could stay. I was debating calling in sick when Snapper called and this – well, this is a big deal and after the fight I had with James, I don’t think it’s smart for me to avoid the office on personal grounds.”\n“Because it’d look like you’re hiding.” Lena moves closer, taking Kara’s phone from where it’s charging and passing it back to her.  “Agent Danvers, do you mind waiting a moment while I speak to Kara outside?”\n“I don’t think it’s advisable for you to leave the premises until we can ascertain the threat.” Alex says from where she’s reading Rameriez’s laptop screen.\n“I’ll be careful,” Lena promises, “It’s just the hallway.”\n“Fine.” \nKara fidgets when they’re outside and alone. She adjusts her glasses and checks the time on her phone. She’ got forty-five minutes now, and a shower seems like a distant possibility.  “This um – this isn’t how I envisioned this morning going.”\n“Tell me about it.”  Lena steps into Kara’s personal space, her fingers running over Kara’s shoulders. She hesitates, just for a moment, before rising up on her bare toes and pressing her lips to the corner of Kara’s mouth.  Kara turns her head to catch Lena’s lips, her fingers resting on Lena’s hips and drawing her in closer. This kiss tastes like a promise, and Lena’s warm and slightly damp and a little freaked out. This is moving fast, too fast for Kara. Lena’s pushing her backwards, back against the wall of the hallway outside of her apartment door. Her tongue is in Kara’s mouth and her fingers are splayed across Kara’s stomach and pushing up to the underside of her bra. Kara lets Lena take the lead, lets herself be kissed to the point where her brain short circuits and Lena’s drawing back, lips kiss-swollen and her eyes hooded. \n“When this is done,” Lena says, taking her hands away. Kara feels cold, misses Lena’s touch. “When whatever this crazy Instagram follower is caught. You and I are going to do this again.” She sucks her lower lip into her mouth and looks hopefully up at Kara.\nKara nods, her fingers brushing some frizzing, drying hair from Lena’s forehead. “You should go back inside and let Alex help you. I need to go possibly get sprayed by NCPD teargas.”\n“God, I hope not.”\n“With this sort of a thing, and the way that reporters are treated by the police when covering a protest? I wouldn’t be surprised.” Kara says. “I’ll bring some milk with me.” Lena looks worried. Kara smiles at her. “Don’t worry about me.”\n“I do.”\nKara presses a kiss to Lena’s lips. “I worry about you too, so we’re even.” And Lena lets her go, lets her get in the elevator, and doesn’t wave when the doors close. \n \nJeff Kingston is older, with gray around his temples and an imposing figure offset by his friendly smile that instantly puts Kara at ease.  He’s the eleven o’clock anchor usually, but since the protests have started, he’s been reporting from the heart of the protests while the six o’clock guy pulls double duty as anchor. Kara’s known him for two years now; Cat actually liked him, which couldn’t be said for most of the reporters CatCo employed.  “I hear you’re here to cover the print side of things. Since Cass is out.”\n“Well, I don’t have a face for TV,” Kara answers, shifting her backpack straps forward under her thumbs. “I’m just grateful for the opportunity.”\n“We’re going to use the McDonalds up the street as a base of operations, they have free wifi and the folks there are willing to let us use it provided we aren’t obtrusive to their customers.” Jeff slings his bag over his shoulder. “This is Hieu, he’s camera 1 today.  Hieu, this is Kara Danvers. She’s our Cass for today.”  Kara shakes the guy’s hand and he smiles tiredly at her.  “Do you have the passwords for the CatCo Twitter feed?”\n“I was going to use my personal feed,” Kara answers. “And I created the CatCo Facebook live account, so I’ve got that and Periscope on the official Twitter if we need it.” That’s how Cassandra was handling it, and Kara thinks the consistency would be good.\nJeff nods. “Alright. How about a battery pack?”\n“Got two.” Well, technically she has one but its DEO standard issue, so it’s a lot more powerful than the standard Wal-Mart portable charger fare.\n“Sounds like you’re as prepared as you can be. I warn you, some of the stuff being said here is nasty… I know that Snapper was concerned that you were too sympathetic to be impartial.”\n“I’m fine, sir.”\nHieu flashes Kara another week smile, slings his camera over his shoulder, and nods to Jeff.\n\nOnce more, into the break.\n\n\n \n\n@KaraD4nvers – Protests now moving toward midtown. Crown calm, lots of discussion and chanting. #nationalcityprotest #ncprotest #catcolive\n@KaraD4nvers – Counter protest slowly gathering steam. Conversation shifting to sustainable extraterrestrial resettlement practices. #nationalcityprotest #ncprotest #catcolive\n@KaraD4nvers - .@jeffKingst0n speaking to anti-alien resettlement activist and US Congressman, @TomUnitas. bit.ly/5ujk34 #ncprotest #catcolive\n@KaraD4nvers – NCPD is on the scene and has set up barricades to keep the two sides from clashing. #nationalcityprotest #ncprotest #catcolive | @LenaLuthor_ - @KaraD4nvers are you behind a press barricade? | @KaraD4nvers - @LenaLuthor_ They haven’t set one up as of yet. Currently speaking with anti-resettlement folks. | @beccajkf89 - @KaraD4nvers @LenaLuthor_ Get a room. | @jaji123 - @KaraD4nvers @LenaLuthor_ MOMS | @raddd_af - @KaraD4nvers @LenaLuthor_ Hypocrites. Your bleeding hearts for alien scum have no place at such a righteous event. #ETGOHOME | @LenaLuthor_ - @KaraD4nvers – Be careful out there, okay? | @jaquilter - @beccajkf89 IS THIS CONFIRMATION?!?! @LenaLuthor_ @KaraD4nvers | @beccajkf89 - @jaquilter ummmmmmmmm idek but I AM SHOOK.\n \nNational City PD does end up shuffling them behind a makeshift police barrier, and Kara checks her twitter mentions to see that it’s Lena’s crazy followers, rather than anti-alien trolls, who are blowing her up.  She sighs. Lena shouldn’t have done that, shouldn’t have brought their relationship into the forefront of her social media like that. That sort of polite concern, should it catch Snapper’s attention, might lead to Kara getting into trouble. \nJeff glanced over at her. “How ya holding up?”\nKara shrugged. “Alright. I don’t like the really xenophobic mentions in my twitter mentions, but I’ll cope.”\nHer phone dings.  The protest is at a strange lull. It’s lunch time, and Kara’s stomach is growling. Alex has sent along a message.\n\nAlex: \nLL gone to work, still a bit shaken. Sent Jamie with her to keep an eye on things there. Tracked the message back to the girl from Wed. night. Winn trying to locate now. May be at protest.\n\n\nKara: \nDo you want me to look for the stalker?\n\n\nAlex: \nThat depends on what you want LL to know.\n\nFrowning, Kara types back a quick message.\n\nKara: \nWhat do you mean?\n\n\nAlex:  \nShe isn’t stupid. You told her half the story, and I’m sure she’s put it together with Wednesday night. If you find the girl – you’ll be telling her you know about her stalker, when you have no way of knowing.\n\n\nKara: \nSo what should I do?\n\n\nAlex: \nThat’s entirely up to you.\n\nShe’s stuck, stuck until these protests dissipate at this rate.  Kara jams her phone into her back pocket and moves to stand near Jeff.  “Are these barricades normal?”\n“Only when they’re worried,” Jeff answers. \nHieu nods his agreement. “After this past weekend, with Supergirl coming to the pro-alien side, the cops are jittery.”\n“Has anyone spoken to them about their preparedness?” Kara asks. It seems the sort of angle that Snapper would be interested in getting up on the website as soon as possible, especially with the confusion over why the police presence is so strong after nearly a week of peaceful protests after the weekend’s violence.\nJeff rubs his growing beard.  “I think Cass had started on something, but you’d have to confirm with Snapper if it ever got up onto the website.”\nKara nods, and pulls her phone back out of her pocket, calling Snapper and getting his assessment of the situation.  He agrees with her that the story should go up as soon as possible, but that he had no idea if Cass was writing anything. She hadn’t mentioned to him, if she was.  “Good instincts, Danvers,” Snapper says when he hangs up.  Kara feels like she’s fit to burst with pride. She tells Jeff what she’s doing, and then slips out of the back of the press corral.\nShe moves between the two sides, speaking to the uniformed SWAT officers and the sergeant in charge of holding down the barricade.  The SWAT guys are disinclined to speak to her, but she’s got a pretty smile and can be exceptionally sincere when she wants to be.  The sergeant gives her more information, before directing her to the NCPD press liaison.  Kara retreats to the McDonalds to call her and to write. \nKara gets fries after dashing off a quick 500 words and confirming with the press liaison that her facts are correct, and sits charging her phone for a few minutes when she looks up to see a girl with close cropped ashy hair and a thick army surplus jacket slipping off her shoulders.  Kara does a double take. And when the girl turns to stare at Kara, it’s like she looks straight through Kara’s work clothes to see her alien core.  Her lips curl in a hateful expression, but she says nothing, takes her coffee when it comes up, and ambles closer.\nFingers shaking, Kara reaches for her phone, texts Alex from her lap.\n\nKara: \nShe’s here. Trace my phone.\n\n“So you’re the newest member of our elite club,” The girl plops down opposite Kara. She sprawls in the chair, kicking out Doc Marten clad feet and drumming her fingers on the table.  Her coffee is all sugar, and Kara can smell the hint of alien on her.  She isn’t human, not fully at any rate. Passing though. Kara wonders where she’s from – what she has against Kryptonians.\nIt’s almost a compulsion at this point, but Kara reaches up and fiddles with her glasses. “I’m sorry?”\n“You’re Lena Luthor’s newest conquest.” The girl flashes a toothy smile that is more predatory than friendly.  “Wonder what she’ll do when she finds out that you’d sell her cause out for a handful of clicks.”\nThere are several ways to play this. Kara eats a fry, watches this girl warily for a moment before she exhales and lets the girl who has spent two years idolizing Cat Grant come to the surface.  “Don’t you read your own Instagram feed? Lena Luthor picked her side, like a week ago. Or have you not been paying attention.”\nThe girl’s lip curls. “She threw her lot in with that ja’klen. Her loss. She’s a traitor to the cause. She’ll pay.” She gets to her feet and takes her coffee with her. Kara tries to place the world.  She’s heard it before, but not for a long time.  She thinks it means something like traitor, but she can’t place the planet or country of origin. “But she is a Luthor and that name means something. She’s a fool if she thinks she can bury that tech behind a late-developing conscious.”\n“The alien detector?” Kara asks, her tone deliberately mild.  Her phone has buzzed four times in short succession.  Alex is on her way. “When she showed me how it worked, I passed the test.”  She looks up through her lashes at the girl, daring her to act, daring her to fight back.  “Would you?”\nThe girl opens her mouth, tongue – her forked tongue – running over her lower lip. The biting curse word at her lips cuts Kara to the core. It’s the same as the comments on Lena’s Instagram feed, as Kara’s twitter mentions. It has Kara’s lips moving, without thinking, retorting in Kryptonese before she can even think about it too hard. The words are viscous, cutting, and definitely not beautiful like the words she spoke to Lena. They’re meant to hurt, all guttural stops and cutting across Kara’s tongue in a way that feels so, so good. She misses this language. She misses speaking it.\nEven if she should not be speaking it now.\n“Now who’s lying?” The girl says.\nKara hesitates. “I think we both are.”\n“Are you one of the good ones?”\n“Are you?”\nThe girl sighs, fiddles with her coffee. “I don’t know where you come from, but you’re deluding yourself if you think that there’s such thing as a good alien.  We’re invaders, we come here expecting to blend, but we don’t. We speak different languages, we don’t believe in the same things the people here do. We have different values. We’re socialized differently.”\n“I don’t think I can justify that much self-loathing,” Kara says quietly. “There are good aliens. Look at Supergirl.”\n“She saved the city from a problem of her own making. By rights she should have never been here in the first place. Her planet is gone and she should be too.” The girl checks her watch, and gets to her feet.  “Now, if you’ll excuse me.”\n“Wait—” Kara gets hurriedly to her feet.  “Why are you trying to incite these people into violence that could be directed at you?”\n“Where did Lena find you, Christ you’re naive.”\n“I—”\n“Save it, girlscout. If you can’t figure it out, I’m not going to tell you.” She turns and leaves, Kara watching her with a baffled expression on her face. \n \nAlex arrives right at the time Snapper calls Kara after having read her copy with a few clarifying questions.  Kara tells him she just spoke to an alien who was against the president’s law while Alex fans out her plain clothes DEO operatives to try and find out where she went. \n“Did you get any good quotes?” he demands.\n“More like threats,” Kara says. “I think we need to make sure that we follow any movement by this protest.”\n“So charge your phone.” Snapper says, and hangs up.\n \nIt’s nine-thirty when a hand closes on Kara’s shoulder. A lot of people have gone home now, and the feel of everything has turned intense, charged with an energy fueled by resentment and compassion.  Kara’s still documenting it, but she’s exhausted at this point, the bags under Hieu and Jeff’s eyes are equally bad.  So when the hand closed around her shoulder, Kara just about jumps out of her skin. She turns and it’s only Lena, with Alex a few steps behind her. \n“What are you doing here?” Kara asks.\nLena holds up a bag of something that smells goddamn delicious and Kara’s stomach lurches uncomfortably.  Alex has a fond smile on her face.  “I figured you probably hadn’t eaten yet?”\nJeff and Hieu are looking at Kara as though she’s a crazy person, so Kara steps back.  “Guys, this is Lena, and my sister Alex; Alex, Lena, this is Jeff and Hieu. They’re on the broadcast side of things.” She’s minimizing the importance and social clout of everyone in the conversation.\nIt’s Hieu who recovers first. “Ms. Luthor. I didn’t expect you to venture out of your tower to mingle… it probably isn’t safe.”\nLena shrugs. “Neither are starving reporters. If you’re not fed, you might report fake news.”\n“Pretty sure that’s written into the job description,” Jeff answers.  He holds out a hand.  “Jeff Kingston.”\n“Lena Luthor,” Lena answers. “You’re the eleven o’clock anchor, yes?”\n“You caught me.” Jeff smiles. Lena grins up at him.  “Any chance there’s enough to share in there?”\nKara looks at the food, she mourns the food that could have all been her’s, but Alex has an eyebrow cocked and Lena’s laughing behind her hand. “There should be enough. Agent Danvers – Alex – she suggested we get enough to feed a small army.”\n“Or at least the CatCo contingent,” Alex says. She tilts her head to one side, and Kara follows her out of ear shot of Jeff and Hieu. \n“What’s happening – Lena shouldn’t be down here. That girl – I don’t know where she’s from, but she’s definitely got a grudge.”\n“We’ve got a plan,” Alex explains. “This is part of it. I’ll keep her safe, I promise.”\nKara bites her lip, and Alex just looks so self-assured that Kara can’t help but feel a little better.\nSo maybe Kara lets Lena snap a picture of the two of them with Jeff and Hieu, eating Chinese takeout from a far nicer restaurant than any of them can afford with the lights of the NCPD cars in the background. Kara’s got chopsticks halfway to her mouth, and Lena’s reclined back against her. Hieu looks tired and Jeff is grinning like a fool.\n@LenaLuthor_ Dropped off dinner for some friends tonight, they’re doing good work, keeping National City in the loop about what’s going on in Midtown. pic.twitter.com/DJ292ujqy7\nAnd maybe she lets Lena pull her into an alleyway for an openmouthed kiss, her back pushing against the filthy wall and wanting Lena to touch her everywhere and knowing that they cannot – not yet.\n\n Saturday –  \n\nIt’s after midnight when the protests get bad. Kara’s phone is at 20% battery and both sides are pushing against the NCPD barricades set up to keep them separate and safe. Kara’s jittery, her fingers shaking as she tweets, staying half a step behind Hieu and his camera. Jeff’s pushing through the throng of the anti-alien protest, speaking to anyone will listen to him.  Kara’s dismayed to see two California congressmen, as well as a few state assembly members and local government officials in the crowd. She makes sure that the #CatCoLive hashtag identifies all of them.\nPeople are bumping against her, pressing in on her at all sides. Kara backs out slowly, careful not to touch anyone. She’s not used to crowds like this, not used to being surrounded by people and knowing that all she has to do is move wrong and she’ll send someone flying.  There was a reason she never went to a concert again after that MCR one Alex dragged her to in high school, it was too claustrophobic, too intolerable.\nWhen she breaks free, she calls Alex.  Fidgets until Alex picks up. “This is a situation for her but I can’t get away,” she says.  She’s not going to say Supergirl in a place so crowded. \n“We don’t want her to show up,” Alex answers.  “It’d fuck up the plan.”\n“Who are we?”\n“Your girlfriend and I.” Alex’s grin is evident in her voice.\nThe force of the flush that covers Kara’s cheeks then, in the middle of all this hatred and combativeness.  She swallows down the urge to correct Alex – because she and Lena haven’t had that conversation yet.  She wants it to be the case, but she doesn’t – not without being completely honest with her. Kara’s still afraid of that. She’s not even completely honest with Alex most of the time. “Look, I’ve got no battery left, Alex. What’s the plan?”\n“Well, we know that the girl you talked to isn’t alone. She’s got at least a few other people she’s working with to incite the violence.  I – we – think it’s better if Supergirl doesn’t appear, but rather that they’re caught on camera as aliens trying to get humans to riot. Lena thinks you could write a really good think piece about it.”\nKara bites her lip, glancing toward the sky. She doesn’t like this. Doesn’t like the idea of the violence taking place at all, or the idea that they’re deliberately trying to bait it into happening again.  Plus, if she were to broadcast it live, it would look really bad for the alien community of National City, and Kara’s pretty sure she’s got an ethical obligation as a member of both the press and as an extraterrestrial who has considered registering to present this in a way that isn’t going to incite violence against her community.\nBut then it hits her, the implication behind Alex’s comment.  Lena’s figured it out. And Alex has confirmed it to her.  Kara swallows, fidgets. “Then she knows.”\nThere are sirens now. The NCPD is trying to keep people separate and it isn’t going great.\n“Christ, Kara she figured it out ages ago.” Alex sighs. “I took care of that NDA as well, while we were at her place.”\n“I didn’t answer her, when she asked.” Kara says.\n“She doesn’t need you to, if you don’t want to.  Wasn’t that how Clark and Lois were for ages?” Alex shakes her head. “I never confirmed it at any rate, just operated on her assumption that Supergirl wouldn’t be available. Anyway, we’ve got their home addresses too and are waiting for their return to black bag ‘em and figure out why they’re so angry, but Lena’s convinced that if you can use your social media presence to sway public opinion.”\n“You want me to get her on CatCo Live.” Kara puts it together.\n“With Jeff, if you can.”\nKara bites her lip, looks down at her feet and scuffs the pavement with her note.  A piece of asphalt splinters off and ricochets into the side of a building, shattering on impact and leaving a dent.  Kara sighs. “I can’t.”\n“Why not?”\n“Alex, think about it. You want me to out her.” Kara puffs out her cheeks. “I can’t do that. I don’t want to set that precedent.”\nAlex is silent for a moment.  Behind Kara, the sirens mix with a bullhorn chant of “ET GO HOME.”  It’s awful, making Kara want to curl into herself and stick her fingers in her ears. How can people be so hateful? How can aliens participate in this hateful rhetoric?\nAn explosion rocks her sideways.  The line goes dead.  Kara looks up to see the alien girl from earlier standing in the middle of a circle of fallen people, her hands clutching a decide that doesn’t look earth-made, save for the LuthorCorp branding on the side.  She’s grinning, wide and wicked, and her eyes meet Kara’s across the chaotic scene.  Kara makes a decision then, amid the chaos, with Hieu and Jeff somewhere under a crush of fallen people. \n \n@KaraD4nvers is currently broadcasting on Periscope! #nationalcityprotest #ncprotest #catcolive\n \nShe’s never gone to journalism school, or even followed the news all that closely.  She’s watched Lois broadcast from warzones all her life.  Kara speaks clearly and concisely, explaining what’s happening as she helps people to their feet.  Alex tries to call her back, she ignores the call until Alex patches in on the DEO radio and demands to know what the hell happened.\n“Explosion,” Kara says. “Some sort of sonic boom.  Knocked a lot of people in the area down; people close to the epicenter are hurt.” She puts her finger over her phone’s speaker and adds, just to Alex, “It’s LuthorCorp branded.”\n“L-Corp?”\n“No,” Kara says. “LuthorCrop. The old logo.”\n“I’ll have Lena look at it.” Alex says quickly, but Kara’s pretty sure they don’t need to. The LuthorCorp tech is there to make sure that this is somehow connected back to the nation’s most staunch anti-alien activist.  And it’s in the hands of an alien herself.  “She’s worried about you, you know.”\nRao, Kara thinks. What a mess. She can’t stomach the idea of Lena worrying about her, or the idea that Lena wanted her out this girl as an alien on what would be national TV.  Lena’s smart, too smart sometimes, but that outing – that’s the same sort of behavior as her alien detection device.  Another fuck up; another red flag.  She’s been raised in an environment so hateful toward aliens that these will come.\nKara swallows, hating that she’s making excuses for Lena and her attitudes.  She wonders if this can even work between them. This girl has also threatened Lena. Threatened her and made her feel so frightened that Kara’s hooked her up with Alex to keep an eye on her. So she asks, rather than asking why Lena cares, if Kara’s an alien and no better than these other aliens.  “Is she safe?”\n“She’s fine,” Alex says. “Literally crawling up my ass to make sure that you’re okay. Are you okay, Kara?”\n“I’m fine.” Kara says. “Are you coming?”\n“We have to get through the traffic first.  The roads are clogged with EMS.”  Alex falters.  “Kara… are you sure you’re okay?  Fly out of there if you’re worried. Come back as her.”\nBut Kara’s ignoring her.  Jeff and Hieu are getting to their feet. The camera’s lens is smashed. They can’t broadcast.  Heiu thinks he has another in the truck and starts picking his way through the crowd of stunned people to see if he can find it.  Jeff gets in front of Kara’s feed and starts his broadcast.  Kara’s gotten the camera steady now, and she holds it while Jeff tells what’s happened.  And then, in the middle of all of it, the girl with the forked tongue walks over to them.  She’s grinning, blood splattered down her cheek. \n“Now people know,” she says. “Aliens are dangerous. They don’t belong on earth.”\nJeff’s eyes go wide, Kara tilts her phone.  They stare at her for a moment, before Jeff goes into reporter mode and asks if she’d like to comment further. Kara holds the camera steady and feels the chill settle over her bones.  This isn’t how this should be, how this should go. Aliens should want to be accepted, not be treated as others.  This girl is passing, she could have a job here, work here; but nothing is stopping the vile words spewing from her mouth. It isn’t like she’s unable to blend in.\n“The president’s law is dangerous, the corporations of National City taking a stance on aliens in our midst is dangerous.  Alien technology created that device, it was used by Lex Luthor to attempt to murder Superman, and with it all of Metropolis.  Why should we accept that just because we are not dangerous that others won’t be?  Our technology is years ahead of Earth’s, our people are smarter, better evolved, and yet we’re stuck here. We need to go home if we can, assimilate if we can’t.”\nHieu appears beside Kara, turning the new camera on and starting to document the scene.  Kara’s phone starts to blink a low battery warning, before it goes blank.\n \nKara doesn’t go home.  She goes to CatCo and sits in Snapper’s office and explains the article she wants to write, the article that asks the questions that have been swirling in her mind since the girl with her forked tongue and anti-alien rhetoric stepped in front of her at the McDonalds. He asks questions, tells her that she can’t do it, and then lets her argue with him until she’s convinced him.  She has to be the one to tell this story. \nHe gives her his blessing and Kara writes it, sends it to Snapper, and does his edits.  It’s eight-thirty in the morning by then, and Kara’s running on coffee and adrenaline. She posts it to the website and stumbles out of the office, making sure to retweet the article to her personal account before sleepily calling an uber and telling the driver Lena’s address. She wants a shower and bed.  She’s covered in Lex Luthor brand EMP dust, it’s in her hair and her lungs and she’s exhausted.\nLena answers when Kara knocks, sliding back the bolt on the door.  “Are you alright?” she asks.  Her laptop is open on the kitchen island.  The CatCo website is pulled up, and the byline on the article says Kara wrote it.  Snapper’s headline – The Anti-Alien Alien – isn’t great, but it’ll get the clicks that they want to drive ad revenue. “You wrote that.”\n“I did.”\n“Do you believe in it?”\n“Not all of it, but enough to feel like it was necessary.” Kara answers.  “I’ve single-handedly set the alien rights cause back fifteen years, easily.”\nLena closes the door behind Kara and hesitates, just for a moment, before speaking:  “You’re right to question how someone who is a member of a community can hate themselves so much.”\n“I don’t understand it!” Kara blurts out. “How can she be like this? How can any alien who’s got a chance at a good, happy, peaceful life here on earth be so hateful about others who want that same choice?  We’re not violent, not all of us.  We should be allowed to be here and be peaceful.”\nLena says nothing.\n“But she’s your follower, isn’t she? That’s why you followed her, because she was a self-loathing alien who wanted to use your brother’s technology to prove her point that aliens don’t belong in National City. You looked through her feed and saw someone who was a risk to your business. You looked at her and didn’t see someone who needed help, but rather a PR nightmare.”  Kara pulls off her shoes, and then her dirty jacket and shirt.  When she’s in her tank top and her filthy jeans, she looks up at Lena, still silent. “Alex told me that you wanted me to out her.”\nLena bites her lip. “I did.”\nKara feels boneless.  She rubs at the back of her head, her eyes sting with barely repressed tears of anger and relief.  They’re talking about this. It’s good.  “Do you know why I couldn’t do it?”\nLena’s head dips in acknowledgement.  “I didn’t want you to be put in that position, Kara. It just seemed like the most logical solution to a larger problem. She’s outed, the protests realize they’ve got a PR nightmare, I’m saved a PR nightmare. Everyone wins.” Lena shrugs. “Besides, your sister and her black ops friends have her now.  Does it matter if I may have considered a more extreme solution?”\nSwallowing. Kara bends to remove her socks, one hand on the counter.  “We’re not all like that.”\n“I know.”  Lena closes her laptop, closes the article that is probably going to end Kara’s career before it even begins.  “You’re mad.”\n“I am.”\n“I’m sorry.” Lena steps forward, she takes Kara in her arms and holds her as tightly as she can. Her cheek rests on Kara’s shoulder.  Kara doesn’t hug her back, not at first.  She has to convince herself to relax, to allow this embrace when she’s a mess of jittery nerves and fear.  “If we continue on this path together, I’m going to mess up. I’m going to fall into old habits and attitudes. I’m trying to be better Kara. I’m trying to unlearn everything I ever was taught as a child. I want you to tell me when I fuck up, okay?”\nKara’s hands close around Lena’s back. She’s warm, steady, soft in her sleep clothes, and looking as tired as Kara feels.  “Do you think, had your follower—”\n“Her name is Emily Martin.”\n“Really?”  Kara shakes her head. “That’s so—”\n“—normal? I thought so too.” Lena steps backwards.  “I’m going to make some coffee, do you want some?”\nKara shakes head. “I want a shower. And then to sleep.”\n“So you came here?”  Lena’s smile is small, private. She doesn’t move toward the coffee maker. \n“Maybe I wanted you too.” Kara looks down at her hands, at her filthy jeans and tries to ignore the fact that they’re shaking.  “Even if I am mad. It was a good plan. I just didn’t agree with it. And I wrote the piece anyway.”\n“It wasn’t just aliens who were having their name dragged through the mud,” Lena points out.  “Even if she made a point of calling out my brother, it’s still my name on that tech. I built it.”\nKara knows this. Knows that Lena’s company identity is so wrapped up in the hot, miserable mess of Lex Luthor’s legacy; she hates it. “I think you surprised her, by signing on to #alienswelcome.”\n“I think that’s what started this whole thing with her.” Lena looks Kara over for a moment, careful consideration on her face.  “I’ll get you a towel.”\n“Will you um…” Kara fidgets. She doesn’t know how to say that she wants Lena to stay with her while she catches a few hours of sleep, or that she came here because she doesn’t want to be alone and Alex is working so her only other option is off the table.  “You’ve been up all night too.”\nLena’s eyes are soft. “If you’ll have me.”\n“It’s your bed.”\nLaughing, Lena takes Kara’s hand and draws her into the apartment.\n \n@rider78 It seems that @KaraD4nvers is speaking out of both sides of her mouth on the #alienrights issue.        \nRT: @CatCo_Mag  The Anti-Alien Alien, National City Protests, and the place of aliens in society. @KaraD4nvers reports. Bit.ly/83Kuv7t\n|\n@ujit82 @rider78 Who’s side is she on?\n|\n@rider78 @ujit82 How Lena Luthor wastes her time with such a hateful person is beyond me.\n|\n@ujit87 @rider78 Right? Lena could do so much better than this bigot.\n \n@ThereisnoEnd SHUT UP YOU DUMB FUCKING BLONDE BITCH\nRT: @CatCo_Mag  The Anti-Alien Alien, National City Protests, and the place of aliens in society. @KaraD4nvers reports. Bit.ly/83Kuv7t\n \n@Jojoohno10 Stick to puff pieces and eating Cat Grant’s snatch, Kara Danvers\nRT: @CatCo_Mag  The Anti-Alien Alien, National City Protests, and the place of aliens in society. @KaraD4nvers reports. Bit.ly/83Kuv7t\n|\n@CatGrant .@jojoohno10 Kindly remove me and my various parts from this narrative.\n|\n@Oakbanter @jojoohno10  She’s fucking blind if she thinks that this is an acceptable response to what’s been happing in #nationalcity #ETGOHOME\n|\n@Oakbanter @jojoohno10  Aliens are in such horrible positions within society, none of them could ever be so self-loathing to as to advocate for basically closeting themselves.\n|\n@Oakbanter @jojoohno10  To not be out and proud is a crime against everyone who wants good representation.\n|\n@jojoohno10 @oakbanter – RIGHT? @KaraD4nvers is stupid af if she thinks this is acceptable.\n|\n@jojoohno10 @oakbanter She should be put in check. @CatCo_Mag should fire her for writing something like this.\n \n@CatCo_Mag – A note on our recent article – ed. Bit.ly/8275jiTk\n|\n@unicorntears CatCo should stick to entertainment. No place writing about the morality of such events or comments by one member of a community.\n|\n@jiltedrose @unicorntears The alien was on NATIONAL TV saying that she hated aliens. There’s nothing wrong with reporting the truth.\n|\n@jiltedrose @unicorntears Especially when they were first on the scene. To ignore that and the context is dumb af.\n \n“My mentions are a disaster.” Kara mumbles into Lena’s shoulder four hours later.  The day has turned bright and sleep is illusive.  Lena’s warm and working on her tablet. Kara has absolutely zero desire to drag herself out of Lena’s bed and face the music of the fall out of her article. “That article needed to be written, and I think it was best that I wrote it. But I didn’t—well, I didn’t anticipate that they’d freak out like this.”\n“You’re a reporter, Kara. You’re just there to tell the truth, doubly so since you were there when it happened.  This wasn’t an opinion piece.” Lena’s fingers tangle in Kara’s hair.  “It was a hard thing for you to do, given how you felt. I think you were really brave to do it.”\n“This one says I should stick to eating Ms. Grant’s—OHMIGOD SHE REPLIED TO IT.” Kara lets out an embarrassed noise and buries her face in the pillows. When her cheeks cool, just a little bit, she continues: “Where do these people get that idea?”\nLena raises an eyebrow, nudging Kara so they’re look at each other. “That never happened?”\n“No!” Kara says.  Her cheeks are bright red. “It, well, it maybe could have in another life…but she was my boss! I could never have done it.”\n“You know, when I moved here, my mother told me to watch out for Cat Grant and her hapless crush on Supergirl. She thought it would turn into a vendetta.” Lena’s finger nails scrape at the skin at the base of Kara’s neck, scratching, gentle.  Kara likes the sensation.  She leans into it.  “Because of the family name.”\n“I think Ms. Grant likes you,” Kara says quietly. “She was worried, when I started talking to you, but I think she’s come around.”\n“How very… maternal of her.” Lena says. There’s a hint of a grin on her face, but she’s turned her attention back to her work before Kara can comment on it further. \nKara goes through her mentions and frowns at a few of them, mutes a few accounts that have said particularly nasty things, and replies to some of the more reasonable and constructive criticisms.  She’s grateful that Snapper’s standing by her and what she had to say.  She’s hoping that Jeff’s piece, which follows in a similar line of questioning, will be up for the 6 o’clock news segment so she’ll stop taking all the heat. \n \nLena has to go into the office after they eat a lunch of yogurt (Lena) and pancakes with yogurt, half a package of bacon and three apples (Kara). Lena laughs about how much Kara eats, and Kara explains to her that her metabolism works about ten times as fast on earth as it did at home, near as she and Alex can figure.  It’s strange, to have a conversation about her alien nature without actually feeling like a science experiment.  Lena doesn’t really ask a lot of questions about how Kara’s body and biology work, but rather asks her if she’s eaten enough. \nKara refuses her in the traditional way, almost without thinking about it, and Lena looks at her, puzzled, just for a moment, before shaking her head.  “I assume that’s meant to be a polite refusal?”\n“It is,” Kara says. She’s in a borrowed pair of jeans that are a bit long for Lena (she’s been meaning to take them in to be hemmed) and t-shirt that feels nicer than anything she owns, it smells like Lena and her old-fashioned perfume. Kara likes it. “I feel bad; I haven’t fallen back into these patterns in years. Not since I got here.”\n“Why should you feel bad?” Lena zips up her laptop case. “Be whoever you want to be around me. You’re allowed to show who you are, aren’t you?”\nKara shifts from foot to foot.  “I’ve spent a long time repressing it and pretending to be well, human. Earth’s customs are a bit different about well, everything.”\n“Dating especially, or so it seems” Lena says. She slings her laptop case over her shoulder.  “Am I… stepping on toes if I ask if that’s what we’re doing?”\nHer hand flies up to her glasses, fidgeting with them for lack of a better thing to do with her hands.  “You’re a good match,” Kara says. In her heart she knows Lena’s different than just a good match. James was a good match, all of her previous entanglements have been good matches.  Lena is just there, she allows Kara to relax enough to be herself.  She fits easily into places in Kara’s life that she didn’t know she needed someone to slot into.  “Better than anyone I’ve had before.”\n“Then it isn’t rushing to ask you to come back later.” Lena’s flushed. Her skin is blotchy with her blush and Kara wants to kiss every inch of that exposed skin and make the red come to the surface and stay. \nShe puts her hands in the pockets of her borrowed jeans and slings her reusable grocery bag full of dirty clothes closer to her body to keep from reaching out, from grabbing Lena and pulling her back toward the bed and to a place where they don’t need to go face the music of their lives.\n“Are you asking?”\n“If you want.” Lena’s flushed redder now. “We don’t have to do anything, I just want you here tonight.”\nKara’s blushing now too. “My houseplants will worry about me, spending three nights away.”\n“Go see them now then,” Lena laughs.  She steps forward and kisses Kara’s cheek, rising on her toes. “Or go see your sister and her black ops buddies – which is what you’re actually going to do.”\n“I’ll come back.” Kara says. “I promise.”\nLena kisses her on the lips this time, full of a promise and a smile. Her fingers tangle in Kara’s hair and pull her down, biting at Kara’s lower lip and licking gently into her mouth once, then twice, until the bag falls from Kara’s shoulder and she’s breathing heavily for want to stay right here until the end of time.\nShe pulls away because she has to.  She fiddles with the hem of Lena’s sweater.  “I’ll call you if I’m going to be late.”\n“Okay.” Lena says.\n \nThe DEO is quiet for a Saturday afternoon.  Winn takes one look at Kara’s jeans and wiggles his eyebrows. “Had a sleep over, did you?”\n“More like I never went to sleep,” Kara says, moving to where the coffee maker is tucked into an alcove behind his desk.  She gets a cup of coffee and smiles at J'onn when he appears, looking every bit as exhausted as she feels. \n“I trust you got some sleep, Supergirl?” J'onn asks.\n“I did,” she answers.  “Did you?”\n“No, we were running an interrogation.” He shakes his head, crossing his arms and staring out into the middle distance. “I don’t know what happened to her,” he adds, in a lower voice. Kara knows that voice, it’s the voice of a man who’s spent so long pretending to avoid the alien conversations that come with his job that when he does have to have them, they come off as a secret, almost fearful thing. \nKara moves closer, it’s what J'onn wants, because Winn is attempting to listen in. Kara doesn’t think J'onn particularly cares if Winn is listening in, but rather is bothered by the overt nature of his eavesdropping.\n“She told me she’s from Metropolis. Born there.”\n“But she’s—”\n“Not from here, yes. We ascertained that her parents emigrated when her mother was still pregnant.  Her kind has a long gestation period, evidently.”  J'onn puts his hands on his hips. “They really bought into the assimilation thing, to the point where I don’t know if she even thinks of herself as alien to earth – or rather just struck with an unfortunate series of birth defects that render her different from the average human.”  He sighs. “We were able to find out that much at least.”\n“And her radicalization?” Kara asks. That’s the part that interests her, because she’s really curious how anyone who lives in the US these days could develop such a sentiment, when identity is so important to all the aliens Kara’s ever met.  Even those who hide are torn, they hate that they have to hide, because they’re proud of who they are… to spit on that legacy is unconscionable for Kara.\nWinn sighs. “Not that I’m listening in or anything, but I have an answer to her radicalization.” He sits back, hands bridged behind his head.  The circles underneath his eyes are nearly as dark as his hair.  He yawns.  Kara sips her coffee.  “I was following Lena Luthor’s investigation, and looking at Emily Martin’s, I think we’ve uncovered a whole network of disaffected second-gen aliens. They’re talking to each other. Mostly on Twitter, but there’s a pretty active Facebook network as well.”\n“Nothing on Instagram?” Kara asks.  “Because that’s where Lena found her.”\n“That might just have been the easiest one for Lena.  Anything she tweets is connected to L-Corp, as she uses her twitter mainly for business related PR stuff. It isn’t as personal as her hedonistic den of sin of an Instagram account.”\n“Oh come on, Winn, it isn’t that bad.” Kara laughs. \n“Saw a pretty nice picture of you on there,” Winn points out. “And Emily posted some rant in the comments before Lena removed the comment – perks of being verified I guess – about how Lena was abandoning her convictions by getting with a new girl.”\n“I… I never saw that.” Kara says.\n“Lena took it down almost as soon as it went up. I think because they were mutuals it showed up on her feed and she didn’t want you to see it. It’s still in the metadata though.”  Winn frowns. “I think that was when Emily’s twitter conversations started to light up with mentions  of Lex Luthor and his technology. Before they were just using whatever cast off alien tech they could get their hands on.”\n“So when you appeared on Ms. Luthor’s social media feed,” J'onn, bless him, plays the part of a confused dad so well. “Ms. Martin took it and the press release of the development and then retraction of L-Corp’s alien detection technology as a sign that Ms. Luthor had abandoned the cause.”\n“But…” Kara frowns. “Lena was never involved in the cause in the first place.”\nWinn nods. “That’s where the crazy comes in.”\n“That’s awfully ableist of you,” Kara mutters. Winn glares. Kara crosses her arms and glares back.  They’re both exhausted.  Kara feels like snapping.  It’s a bit of a mess.  “So, are we good to consider this threat handled?” she asks. “Are there others like Emily Martin that we should round up?”\n“It’s like a hydra,” J'onn answers.  “Cut off one head and two more take its place.  We’re aware of the situation now, I think this may become a long-term monitoring project for the DEO.  But for now, the protests may continue, but there won’t be any more alien-made violence at them for the foreseeable future.”\nKara sags. It’s a relief, a huge one slipping easily from her shoulders. “That’s a relief.”\n \nAlex lets herself into Kara’s apartment carrying a box of pizza and a six pack.  “I didn’t get two, so you have to promise me you won’t inhale the whole thing.”  Kara’s picking through her clothes, trying to find something to wear.  She’s in her bra and underwear, Lena’s borrowed shirt and jeans are neatly folded on the end of her bed.  Alex comes to stand beside her.  “I thought we were chilling, it’s Saturday night. Are you going out? Did I waste 20 bucks on a pizza you’re not going to eat?”\n“Lena asked me over.” Kara says.  “I have to return her jeans anyway.” She turns, smiling cheekily at Alex, “And besides, you know I’m always down for pizza.  She’s going to call when she gets home – she went to the office.”\n“What is with you and workaholic women,” Alex mutters, pawing through Kara’s clothes and finding a soft baby blue v-neck t-shirt.  “Wear that.”\n“It’s just a t-shirt.”\n“It’s the best color on you, and it’s soft.” Alex raises an eyebrow. “And you’re not going to be wearing it for very long.”\n“Alex!” Kara hides behind her fingers. “What if we’re just going to like, hang out, eat dinner?”\nSniggering, Alex holds the shirt out between two fingers.  “Put it on. We can’t all be blinded by your radiance.”\nSnatching the shirt away and scowling, Kara does. She pulls out a pair of battered-looking jeans so old they’ve gone white in places and tugs them on too.  “Happy?”\n“Yes.” The grin on Alex’s face is warm.  She reaches over and musses up Kara’s hair.  “Being this into someone looks good on you Kara.” Kara sticks her tongue out at her.  Alex shoves her and Kara’s got the good grace to remember to stumble, just a little bit.  But when she stops laughing, Kara watches her, watches her carefully.  Alex looks like there’s something on the tip of her tongue, the sort of look she gets before she segues into the more serious things she wants to have conversations about.  “I read your article.”\n“Oh.”\n“It must have been really hard to write.” Alex drifts back to the kitchen and collects plates and paper towels.  “Like, I know you were first on the scene and it was your periscope that got picked up by CNN and Fox, but for your first piece to be about the self-loathing alien who started this whole thing?  That… must not have been easy.”\n“Snapper didn’t like the idea,” Kara confesses.  “At least, not at first.  He wanted me to write about the L-Corp connection, but I told him I couldn’t.  Not with whatever Lena and I are doing.” Snapper had nearly gone postal at that, but Kara talked him down. “So I wrote about this instead. Because I didn’t want Jeff to do it. I had to be the one, Alex. Because at least I could temper the rhetoric that was bound to come out after she got caught on camera.”  She takes the slice of pizza that Alex offers her and goes to sit on the couch.  “I hate this, Alex.”\n“Why?”\nKara shrugs. “It’s so divisive. The idea of an alien not wanting aliens on earth – I don’t get it either, but she needed someone to speak for her. Now I’ve spoken for her and…her assimilation agenda and people hate me for it.” Kara tries to eat the pizza, but it tastes like cardboard.  “Was that wrong?”\n“Because you were fair?” Alex sighs. “No, you did what you had to do in order to control that narrative before it ever got legs under it.  It was a remarkable bit of PR, honestly. I’m sure, somewhere Cat Grant is proud of it.”\n(She is, she texted Kara a thumbs up emoji an hour ago. Kara doesn’t mention it.)\nAlex pulls Kara close, hugs her. “Turn off your notifications on your phone.”\n“But how would I know when Lena’s crazy followers call me Mom then?”  Alex bumps Kara’s shoulder with her chin.  Kara giggles.  “What? It’s funny.”\n“You’re far too much of an alien disaster to be trusted around children for prolonged periods to time, sister mine.”\n“Thanks,” Kara says in mock indignation.\n“I was right,” Alex mutters a minute later.  “This shirt is really soft.”\n \nLena calls around nine.  Alex and Kara have watched half a season of Portlandia and have paused it to debate whether or not the Womyn in Womyn First skits are really as hilarious as they both find them.  Kara feels uncomfortable because of Fred Armisen in a dress, Alex is more concerned that the skit is mocking a safe women’s space. In the end, they’re interrupted by Lena, and Alex steals the phone to demand to know what Lena thinks of Women in Women First.  Kara just about dies of embarrassment, before promising Lena that she’s on her way over, glaring at Alex and telling her to make the bed if she’s sleeping over.  Alex has had three beers now. She probably should sleep over.\n“Will you be back?” Alex asks.\nKara’s cheeks color. “I don’t know.”\nThey both know the answer is no, but Alex lets her pretend and Kara’s grateful. The idea that she’s going over to Lena’s place because they’re both so – as Lena’s followers put it – thirsty for each other is silly. She wants to see Lena, to decompress and tell her about Emily Martin and what they were able to find out. \nWhen Kara gets to Lena’s that’s what they do. Lena cooks some soup and makes a salad for herself, Kara eyes the soup hungrily until Lena gets down a second bowl and tears Kara off a hunk of thick sweet-smelling bread from a braided loaf that’s still only half eaten. “Leftover, from yesterday?” Kara asks even though she hadn't noticed it.\n“It’s an old habit.” Lena says. “I always have other things happening on Friday nights. This is my way, I guess. An indulgence and a gesture all at once.”\nKara nods, eats her soup. She tells Lena about what Winn was able to dig up, and how the LuthorCorp tech that they found was old, at least five years by the looks of some of the chem signatures on it.  Lena’s eyes go a little wide at that, and she wants to know how they managed to date something like that.  Kara shrugs, because she’s not going to share DEO secrets with Lena, but she could tell her – tell her in Kryptonian science that Lena won’t be able to understand.  Kara’s sure, though, now that the idea’s in Lena’s head, that it’ll only be a manner of time.\n“So they’re going to monitor?”\n“Yeah, Winn says thanks for the tip off, it really helped.” Kara rolls a piece of the bread into a ball and pops it into her mouth.  “Your IT folks are on point. Also a quote.”\n“I’ll tell him thank you then,” Lena says. “Next time I see him.”\nKara’s phone beeps. It’s another notification. Another piece of hateful BS about her pro-alien stance on a perceived terrorist.  Kara turns the phone over.\n“Your article?” Lena asks.  She chews a cucumber thoughtfully.\nKara looks down, hiding behind her hair. She hates this. Hates it so much. “Yeah.” She says. “People are being awful.”\nLena wipes her mouth and fiddles with her casual work shirt for a minute before seeming to come to a conclusion.  “Let’s give them something else to talk about.”\n“What?” Kara frowns. “I don’t follow.”\nLena takes her dish and Kara’s away, sets them in the sink and runs water into the bowls.  “Can you start a Periscope?”\n“Uh, sure.”  Kara says.  “What do you want to talk about on it?”\n“I want.” Lena slides forward, into Kara’s space, until she’s insinuated between Kara’s knees. “To give them something to talk about.” Her hands are on Kara’s shoulders, on the soft blue v-neck that Alex liked so much. She rocks forward, her forehead bumping gently against Kara’s, her breath hot on Kara’s lips.\nThere’s this moment, this moment when Kara’s realizing that Lena’s too close and that this is wrong wrong wong for her to want it. She panics. Her hands clench into fists, tight, too tight on the table.  She inhales slowly.  Lena’s breathing on her, this split second where she’s waiting for a kiss.  Kara knows she has to kiss Lena, but it’s pushing past that freak out. That moment of this isn’t right to realize that yeah, it is right.\nWhen she was a child, Astra used to tell her about these moments, when she’d realize that there was something more important than anything else in the whole universe.  “You have to grab those moments and hold them dear. You have to live in them.”\nBut Astra was gone and Kara had no one else that she could talk to about this aching feeling of wrong-rightness in her stomach.  Her mother was a hologram, her cousin was human in all but biology. She is the last Kryptonian, and it’s this, this realization that she wants to do kiss Lena Luthor that’s going to push her over the edge of whatever bullshit the Matrix and all her mother’s stories from her childhood from her mind.\nShe’s kissed people before, kissed them and had sex with them and it’s been nice, but she’s never wanted it. Not like this, not like her fingers twitching for want to reach out and grab Lena and push her up onto the counter and eat her out until she screams. Kara’s never… wanted before. Alex had said being into someone looked good on her. Maybe Kara just had no idea what that meant.\n“You’re a million miles away, Kara,” Lena says.  She pauses, brushes a finger against Kara’s cheeks, her thumb on Kara’s lips. “We don’t have to… I know you said – with your upbringing…”\nAnd it’s Lena. Lena who never has pushed and has always listened when Kara’s said things like how she doesn’t feel comfortable or she isn’t sure she’s wired the same way humans are. Lena, who makes Kara feel like she’s on fire when she smiles, blessed by Rao’s light.\n“I’m fine…” Kara says and she’s breathless.  “I want… to do the Periscope later.”\nLena draws back. “Are you sure?”\nKara smiles at her. She wraps her arms around Lena and pulls her closer still. “I’m sure.” The kiss that comes is desperate. Lena gasps at Kara’s fingers tangling in her hair, and tugging, gentle, firm. It feels a little backwards, but good. Kara likes it, but likes it more when Lena pushes back. Her hands grip Kara’s shirt and she’s kissing Kara with abandon, drawing her in, holding her close. She sucks on Kara’s tongue, bites at her lip and moves down Kara’s neck to confidently run her hands over Kara’s chest. The sensation is so much. Lena plucks Kara’s glasses from her face, sets them on the counter.  Her hands come back, her tongue licking into Kara’s mouth, Kara sucks obediently. It’s what feels right.  She kisses Lena and lets Lena grope her like some teenage boy, fingers flicking over her nipples through her shirt and bra.\nIt’s only when Lena moves to unclasp Kara’s bra that Kara pulls back. “The stool is going to fall over.”\n“Then we can do this on the floor.” Lena mutters. “If that’s what you want.”\n“I’d rather your bed.”\nLena steps back, her fingers trailing over Kara’s forearms, before resting on her thighs. In that one moment she looks so uncertain that Kara wants to pull her back in. She bites her lip. It’s kiss swollen. The look of it makes Kara’s mouth go dry. “Would you?” Lena asks. “I’m fine here.”\nKara flushes. “It’s a nice bed. Where there isn’t a stool that I could fall off at any moment.”\n“Good point.” Lena says.\nThey go. Lena gets Kara out of her shirt and bra in the ten steps it takes for them to tumble onto the bed together.  Kara has Lena’s shirt rucked up and is pulling it over her head when the fall, but Lena’s on top of her and staring down through a curtain of black hair and she’s so, so gorgeous in her lacy black bra that Kara can’t help herself.  She reaches up, cupping Lena’s breast.\nLena’s eyes flutter shut.  Kara moves her thumb in a slow, easy circle. Lena’s breath comes in a slow shudder.  She relaxes her elbows and bends her head to kiss Kara, this kiss is slow, opened mouthed passionate.  Kara reaches around her and unsnaps her bra.  Lena pulls back to throw it away.  She wraps her arms around Kara’s head, kissing her, their bodies pressed together, rocking into each other.  Lena’s so warm, so kind, so gentle when she doesn’t need to be.\nKara moves her leg, gingerly, carefully, until she has enough leverage to roll them over without using her powers.  She wants to be on top, to control the flow of this in case she freaks out. It’s happened before – with James – with her first boyfriend. She has to dictate this if it’s going to happen.  She wants to kiss Lena all over, see her lose her composure and see her debouched. And it frightens her, because this isn’t what she’s supposed to feel.\nBut this isn’t Krypton, and she’s not ever going to have to deal with that again. Lena is something, something Kara wants to have, to taste, to fuck. And Kara’s going do to it.  Matrix be damned.\nShe presses open mouthed kisses onto Lena’s neck, pausing when Lena lets out this little whimper, her fingers tangling in Kara’s hair and tugging, pressing her mouth harder to the point where her shoulder met her collarbone.  Kara bites, gentle, Lena gasps. Kara grins. She bites again, this time harder, and Lena’s hand trembles on the back of her head.\nThere’s an echo in Kara’s ears as she lowers her lips to tease at Lena’s collarbone, at her nipple, the rushing sound of her blood racing through her body.  She bites again, and Lena’s pushing her down. “Please Kara,” she says. She sounds so desperate. Kara unbuttons Lena’s pants, slides them and her underwear off at once.  Lena’s in her socks, which she toes off, her pupils blown and her chest heaving. There are marks on her chest, on her neck, on her breasts. \nKara swallows down the feeling of pride and scoots forward. “What do you like?” she asks. This is the first time. “Other than pulling my hair.”\nLena flops back on the pillow. Kara runs a finger over the glistening hair between Lena’s legs.  She’s wet. Kara catches the moisture on her finger and brings it to her lips. Lena watches her through hooded eyes. “That.” She says. “I like that.”\nKara nudges Lena’s ass. “Scoot up.” She says.  Lena does, until she’s propped up on pillows and looking down at Kara.  “I gotta say,” Kara says. “This is really different for me.”  She dips her lips to kiss at the juncture of Lena’s thigh and hip.  Her jeans feel uncomfortably tight.  Kara’s pretty sure she could grind against the seam and come.\n“How?” Lena asks.\n“I don’t often… do this. Like this. I’ve never….” Kara bites her lip, looks away. “I’ve never wanted it so badly.”\nLena smiles, wicked as can be with kiss swollen lips. “So indulge yourself. I don’t mind.”\nAnd Kara does.\n \n \n\nSunday - \n\n@KaraD4nvers is currently broadcasting on Periscope!\nKara holds the phone up with a grin on her face.  “Hey Lena,” she says. “Do you want to come say hi to everyone?”\nThe feed explodes. Hearts are everywhere.  Kara props her phone up against the bowl of fruit on Lena’s kitchen counter and scoots over so Lena can get into the frame of the camera beside her. Someone comments: MOMS ARE BROADCASTING YASSSSSSSS, and Lena raises an eyebrow before nudging Kara. “Hey, Kara’s followers.”  She turns to Kara, a slow smile sliding across her face. “Hey babe.” She leans in then, brushes her lips against the corner of Kara’s mouth.\n@hiruuuummmn – A KISS!\n|\n@uriq – omg I cannot right now.\n|\n@karalena4eva I AM FREAKING OUT\n|\n@asdlfkkjiiu SAME THOOOOOOOOOOOOOOOOOOOOOOO"
}