{
    "id": "8572348",
    "url": "https://archiveofourown.org/works/8572348?view_full_work=true",
    "author": [
        "firethesound"
    ],
    "title": "Lift Your Open Hand",
    "rating": "Mature",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Harry Potter - J. K. Rowling"
    ],
    "relationships": [
        "Draco Malfoy/Harry Potter"
    ],
    "characters": [
        "Draco Malfoy",
        "Harry Potter",
        "Ron Weasley",
        "Hermione Granger"
    ],
    "additional_tags": [
        "Accidental Bonding",
        "Bedsharing",
        "Forced Proximity",
        "Bickering",
        "Banter",
        "Community: hd_erised",
        "maybe slight dub-con for drunken snogging",
        "Consensual Canoodling",
        "Auror Training",
        "bookshops",
        "Bars and Pubs",
        "Harry's Canonical Chest Monster",
        "Semi-Public Frotting",
        "First Kisses",
        "Domesticity",
        "Unexpected Nicolas Cage"
    ],
    "language": "English",
    "series": "",
    "published": "2016-12-27",
    "completed": null,
    "words": "18,752",
    "chapters": "1/1",
    "comments": "331",
    "kudos": "9,736",
    "bookmarks": "1,773",
    "hits": "119,889",
    "summary": "<p>With Draco Malfoy as his assigned partner for the next six weeks of Auror training, Harry had been prepared for things to go poorly. But getting themselves accidentally bonded to each other in the first twenty minutes of their very first assignment seemed going above and beyond, even for them.</p>",
    "notes": "<p>Thank you to R for the beta, M for the cheerleading, and D for the vodka. Title is a line from Sixpence None the Richer’s “Kiss Me” because I worked on this in a coffee shop that was embracing the 90s and this came on. My dear who_la_hoop: I hope that this story brings you even a fraction of the joy I felt when I opened up my assignment and saw that I’d be writing for you this year. &lt;3</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Nicolas Cage movie quotes come from, in order: Leaving Las Vegas, Face/Off, Snake Eyes, and Vampire's Kiss. Who_la, you can blame Birds for this.</p>\n<p> </p>\n<p>Thank you so much for reading! You can show your appreciation for the author in a comment here or on <a href=\"http://hd-erised.livejournal.com/80535.html\" rel=\"nofollow\">Livejournal</a> . ♥</p>\n<p>This story is part of an on-going anonymous fest hosted at hd_erised @ livejournal.com. The author will be revealed January 9th.</p>",
    "text": "Harry had been certain that things would go poorly from the very instant he found out that Draco Malfoy would be his partner for the next six weeks, because when had anything involving him and Malfoy ever gone well?\nBut even knowing that from the very beginning, when he later looked back on all of this, he would still find himself surprised—and vaguely impressed—that he and Malfoy had somehow managed to make a total cock-up of it within the first twenty minutes.\nIt was even more impressive when he took into consideration that their assignment wasn’t supposed to be at all dangerous. By now, six months into their training, The Magical Law Enforcement Patrol had begun shunting over some of their least perilous assignments so that the Auror trainees could go out and get a little bit of practical experience to go along with the endless heaps of coursework they were assigned. Harry had been looking forward to this for months, and he and Ron exchanged eager grins at the thought of finally getting out of the classroom and into the field.\nBut Harry’s excitement rapidly collapsed into limp resignation when the instructor announced that instead of being allowed to choose their own partners, as they’d been previously allowed to do for classwork and training assignments, they were to be put in pairs alphabetically. Ron gave Harry a pitying look at that, because their class of trainees was fairly small, and that meant that no one came between Malfoy and Potter. And while they’d all mostly put their differences aside and did their best to put the past behind them, they still didn’t particularly like each other. It was only the smallest consolation that Malfoy didn’t look any more pleased about their assignment than Harry felt.\nAnd so now here was Harry, trapped with Malfoy in a cramped evidence room, sorting through a trunk full of magical miscellanea that had somehow ended up in a Muggle charity shop. Two more trunks sat stacked in the corner, and Harry’s afternoon stretched interminably before him. Sighing, he set aside the hand mirror he held, and dutifully marked it down on the inventory sheet.\n“This is all junk,” Malfoy complained, pulling out a handful of photographs. The people in them—at a wedding, judging from the young witch’s elaborate white robes—waved and smiled. Malfoy tossed them carelessly into a nearby evidence box, then reached for his quill and added the photographs to the list of inventory.\n“Yeah, but it’s obviously wizarding junk,” Harry told him evenly. It helped a little that Malfoy had so far only complained about the job and not about Harry himself, but the constant griping was still beginning to wear on Harry’s patience.\nHe pulled out a small brass music box that, when opened, played a tinkling rendition of ‘You Charmed the Heart Right Out of Me.’ That might make a good Christmas gift for Molly, Harry thought as he shut the music box and put it in with the other things they’d already looked through. She loved Celestina Warbeck. He’d have to see if he could find one of those that wasn’t evidence in an active investigation.\n“So what?” Malfoy said sulkily, sifting through the trunk and coming up with a huge floppy-brimmed hat trimmed with blue silk ribbon rosettes and taxidermied puffskeins. He held it out consideringly, and for one wild moment, Harry thought he was about to try it on. “It’s not as if Muggles will be able to tell the difference.”\n“Malfoy,” Harry sighed. “You are holding a hat decorated with actual magical creatures. Right in your hands. I’m sure that Muggles would be able to figure out that puffskeins are a sort of animal they’ve never seen before. They’d be falling all over themselves to discover a new species, and the absolute last thing we need is an uproar in the scientific community.”\n“There would be no such thing,” Malfoy said as he crammed the hat into the box with the photographs, shoving down hard to make it fit. He folded the box flaps down and sealed them with a spell. “They’re all willfully ignorant. Muggles don’t believe in anything that doesn’t fit with their astoundingly narrow little world view.”\n“Know that many Muggles, do you?” Harry asked, resisting the urge to roll his eyes. He handed over the inventory sheet and Malfoy slapped it on top, affixed it with a Sticking Charm, and covered it with another charm to protect it.\n“I don’t need to know them,” Malfoy said loftily. A swish of his wand sent the evidence box to the far corner with the rest of the boxes they’d filled so far. “Everybody knows how Muggles are.”\nHarry bit his tongue as he looked into the bottom of the trunk while Malfoy got a new evidence box and a blank inventory sheet. Continuing this ridiculous argument wouldn’t do either of them any favors, and the afternoon would go faster if they kept working and didn’t allow themselves to become distracted by bickering with each other.\nThey were nearly halfway through this trunk, and that hadn’t taken long at all. There were two more trunks so they could be done in about another hour. Then all they had to do was take the boxes and empty trunks down to Evidence, submit their inventory lists to the Patrolmen who were investigating where these magical items had come from, and then they’d be done. Harry could put up with Malfoy for that much longer. They’d be finished before he knew it.\nWillfully ignoring that tomorrow he’d have to come back and face another full day of Malfoy, Harry bit back a sigh and took out a silver compact with a cabbage rose etched into the top. He just had to get through this afternoon. Small goals. Reasonable goals. He could do this.\n“You look lovely, dear!” trilled the little round mirror inside when Harry flipped the lid open, and Malfoy snorted.\n“Well that’s obviously defective,” he said. “Make sure you note that in the inventory, will you? Enchanted mirror can’t tell the difference between an attractive person and a speccy git. Maybe you ought to give it your glasses.”\nAnd, wonderful. They’d now moved on to personal insults.\nHarry resisted the urge to throw the compact right at Malfoy’s head. Instead, he snapped it shut and dropped it in the evidence box. He very deliberately ignored Malfoy and reached down into the trunk for a length of braided silk cord that he saw sticking out of the rest of the junk, preparing to pull it loose, and didn’t realize that Malfoy had grabbed the other end of it until a sudden crackle of magic flared to life between them, and the cords glowed gold and wrapped themselves around Harry’s and Malfoy’s wrists.\nHarry jerked back in surprised, wrenching his arm free. The glow faded and the cords slipped from around Malfoy’s wrist and fell limply to the ground.\n“What the fuck was that?” Harry asked, looking from the cords to Malfoy’s face, and his heart sank like a pebble tossed into a pool. If the stricken expression on Malfoy’s face was anything to go by, then whatever had just happened was very bad indeed. “Malfoy?” he asked, rubbing idly at his wrist where a lingering trace of magic made his skin tingle. “What just happened?”\n“It would appear that those are handfasting cords,” Malfoy said shakily, pushing up his sleeve. And there, around his right wrist, was a dark brown mark like a coiled rope. “And we’ve just bonded ourselves to each other.”\nAlarmed, Harry pushed up his own sleeve and found the same mark on his own wrist. He rubbed at it. “We’re bonded?” he blurted out, panic rising.\nMalfoy cast a slew of spells at himself and Harry, and whatever he saw in the results made him sag in relief. “Temporarily,” he said. “It’s only temporary. It appears to be a type of spell that’s sometimes used in political marriages, or to marriages arranged to solidify relations between two families. It encourages the newlyweds to spend time together. You know, really make a go of it. Typically, the spell will only last about a month.”\nMake a go of it? What did that even mean? And a month? Harry had to make a go of it with Malfoy for a whole month?\nMalfoy heaved a theatrically large sigh. “You needn’t look so alarmed. This is inconvenient, but hardly an emergency.”\n“Well sorry,” Harry told him. He took a deep breath and tried to will his heart to stop thumping. Malfoy wouldn’t be this calm if there was really something to be alarmed over. Whatever the spells he’d cast had told him, it’d been enough to make him relax about it. “It’s not like they teach this stuff in school.”\nMalfoy leveled a scathing look at him. “You’re an Auror trainee, aren’t you?”\n“Yeah, well, they haven’t taught this stuff here, either,” Harry told him. “Look, instead of going on about how this is something I should already know, why don’t you save us both a lot of bother and just tell me?”\n“Bonds are like any other magic,” Malfoy said, folding his arms over his chest and looking down his nose at Harry. “The stronger the effect of the spell, the more intent they require to cast. This,” He gestured at the handfasting cords, “didn’t require any intent from us. Therefore, it’s not a powerful spell.”\nHe had this I honestly can’t believe I’ve actually got to explain this to you sort of tone to his voice that made Harry want to punch him right in his pointy nose.\nBut alas, punching Malfoy (as satisfying as it’d undoubtedly be) would probably only make him even more inclined to be an arsehole about this.\n“So it can be undone?” Harry asked instead.\n“Of course it can,” Malfoy said, and he still had that infuriatingly superior tone to his voice. “If we went to St Mungo’s, they could have it undone in about five seconds.”\nA great wash of relief swept through Harry. “Fantastic. Let’s go.” It’s not as if sorting through this junk couldn’t wait an hour or so while he and Malfoy got themselves seen to.\n“No,” Malfoy said, bringing Harry up short. “We’re not going.”\n“What? Why?” Harry asked, baffled. “You just said they could undo the bond.”\n“Yes, they can. And if we go, there’ll be a record of it.”\nHarry gaped at him. “Wait, really? You’d rather spend a month stuck together than report this?”\n“As loathe as I am to admit that we fucked up this badly on our very first assignment, no, that’s not what I meant,” Malfoy said. “I want you to think very carefully, Potter. This happened in a matter of seconds. Going to St Mungo’s would involve people finding out what happened. I wouldn’t be surprised if it’d make the papers, seeing as how the entire bloody world is endlessly fascinated with everything you do. Do you really want this to get out into the world where some of your, how shall we say, your more dedicated fans might hear of it and get ideas?”\nHarry’s stomach clenched. He thought of Romilda Vane. All it’d take was one gossipy Mediwitch or Mediwizard, one patient overhearing something they shouldn’t, just one person going to the papers. Even four weeks of Malfoy’s unrelenting company would be better than the sheer ongoing hell that would come of this if the papers ran a story about what had happened, because at least there’d be an end to Malfoy. At least Harry knew that Malfoy wouldn't do anything worse to him than pick a fight or two or twelve, and Harry had plenty of experience with Malfoy acting like a complete arsehole.\nBut why should Malfoy care? He wouldn’t be affected by any of that, if the story got out. And there was no way he was offering to protect Harry out of the goodness of his heart. He’d want something for it. And Harry was willing to bet he already had something in mind.\n“Why would you do this for me? What do you want in return?” he asked.\n“I owe you a Life Debt,” Malfoy said right away. “I want to be absolved of that.”\nHarry had never intended to call it in—the idea of forcing anyone to do his will made him deeply uncomfortable—so it was a small enough price to pay. “Deal,” he said, offering his hand.\nAfter a brief hesitation, Malfoy reached out and they shook. His fingers were cold and a little clammy, and Harry rubbed his hand on his thigh after they let go.\n“Now what?” Harry asked.\n“Now we do our jobs and finish with these bloody trunks,” Malfoy said. He picked up one of the paper envelopes layered with protective charms they’d been given for anything that might pose a threat. He enlarged it with a tap of his wand, picked up the handfasting cords and slipped them inside, sealed it, labeled it, and tossed it in the evidence box. Then he lifted a silver cigarette case out of the trunk.\n“So, you mentioned effects,” Harry said after a few minutes. “What exactly are we facing?”\nMalfoy gave him a put-upon look as he tossed the cigarette case into the evidence box and made an entry for it on the inventory list. Harry clenched his teeth and waited him out.\n“We’re required to spend time together,” Malfoy said. He picked up a fancy crystal inkwell, and held it up to the light to examine a smudge of dried blue ink in the bottom.\n“And that’s all?” Harry prompted when Malfoy didn’t seem inclined to continue. “How much time do we have to spend together?”\n“Enough to satisfy the bond,” Malfoy said. “We’ll have to test it later to see how long we can be apart.”\n“What happens then?” Harry asked, patience rapidly wearing thin. Getting answers out of Malfoy was like pulling teeth.\n“A wide variety of highly unpleasant physical effects,” Malfoy said. “Weakness, fatigue, insomnia, nausea, headache, et cetera, et cetera. The effects get worse the longer the bonded couple spends away from each other.”\nAll of that sounded horrible. “Okay, so we spend time together. That won’t be so hard. I mean, we’re going to be working together for the next six weeks.”\n“We’ll have to live together, too,” Malfoy said. “Sharing a bed is one of the typical requirements of bonds like these.”\nHarry froze. “Sharing a bed?” he echoed.\n“It’s a bond typically used for marriages, Potter,” Malfoy snapped. “Trust me, I’m not thrilled about this, either.”\nIt took some effort, but Harry bit back a retort. He bit back a great load of swearing, too. He took a deep breath, then another, and another, until the urge to hex Malfoy subsided. “So, spending lots of time together, living together, sharing a bed. Is there anything else this bond is going to make us do?”\n“What, that’s not enough for you?” Malfoy drawled, and the last thread of Harry’s patience gave way.\n“I don’t know why you’re forcing me to drag each piece of information out of you, but this is going to be enough of a challenge to get through without you deliberately being an obnoxious dickhead,” Harry told him. \nMalfoy opened his mouth, then shut his mouth again, then very quietly said, “All right.\" And it wasn’t anything even approaching an apology, but Harry had a feeling it was probably the best he could expect.\n“All right, then,” Harry echoed, sitting back in his seat.\n“There’s not much more to it than I’ve already said,” Malfoy told Harry after a moment. He picked up a pewter figurine of a rearing unicorn from the trunk and examined it. “Sharing a bed, keeping close by each other. Sometimes talking can be a requirement, but we shouldn’t have any trouble with that one, as we’ll have to talk for work, at least.” He took a breath. “And touch.” His gaze darted up to Harry and then away again quick as a blink. “They usually require touch.”\n“Wait,” Harry said as an image of himself getting fucked by Malfoy flashed through his mind. “We don’t have to have sex, do we?”\nMalfoy’s cheeks were turning steadily pinker. “Most likely not,” he said, which wasn’t the solid No that Harry had hoped for, but was certainly better than a definite Yes. “The point of this sort of bond is to encourage two people to get to know each other in the hopes that they’ll eventually grow to love each other on their own. Forcing them into doing something they’re not ready for rather defeats the point.”\n“But forcing them to share a bed doesn’t do that,” Harry said skeptically.\n“That’s a different sort of intimacy,” Malfoy said, still not looking at Harry. “Sex complicates things in a way that sharing a bed won’t.”\nAnd Harry supposed he really couldn’t argue with that. Sighing a little to himself, he returned his attention to the job at hand. He reached into the trunk and pulled out a little ceramic bell, and picked up his quill to record it on his inventory.\n- - -x- - -\nEverything went well enough until it was time to leave. Touch, as it turned out, was in fact a requirement of the bond. Thirty minutes after accidentally triggering the spell, a faint itching started up under Harry’s skin, and Malfoy sighed and said, “Bollocks.”\nFortunately, the bond didn’t seem to require skin contact, and was easily satisfied by Malfoy stretching out his leg and resting the toe of his polished leather shoe against the side of Harry’s trainer for a few minutes. By the third time Malfoy’s foot nudged up against his, Harry barely even noticed. They finished sorting through the trunks, delivered the evidence boxes and trunks to Evidence and submitted their paperwork, and they were free to go for the day.\nBut go where was currently the topic of some debate.\n“You live in the old Black place, don’t you?” Malfoy asked, looking down his nose. “Absolutely not. We’ll be staying in my flat.”\n“There’s more space at mine,” Harry tried to argue. “It’s a whole house.”\n“Yes, but we’re going to have to stay close to each other,” Malfoy countered. “Having space isn’t exactly an issue we need to resolve.”\n“Mine’s got a house-elf,” Harry said. He wasn’t sure that Kreacher was truly a selling point, but he was banking on the fact that Malfoy had never actually met him.\n“Mine doesn’t have mice,” Malfoy said.\n“My house doesn’t have mice,” Harry said defensively. Well, it didn’t have many mice. But it was an old house that had been inhabited only occasionally over the last two decades, and Auror training kept Harry busy. He had noticed the occasional scratching sound coming from the walls, and he did keep meaning to do something about it, but he just hadn’t got around to it yet. Besides, winter was setting in and that’s when Grimmauld Place’s annual Doxy infestation tended to flare up, and god only knew why they liked that bloody house so much but each year they swarmed in by the dozens. Really it made sense to wait and then take care of all of it at once, as he’d vaguely been planning to do. And now that Harry thought about it, maybe having Malfoy living with him wouldn’t be the best idea after all. “It doesn’t,” he insisted anyhow.\nMalfoy only arched his eyebrows skeptically. “Generations of Blacks have lived in that house and were unable to get rid of the mice. It’s practically family legend at this point. Yet you expect me to believe that you were somehow able to manage? In, what, seven months?”\n“I’m the Chosen One?” Harry tried. Malfoy gave him a flat look, and Harry sighed, defeated. “Fine. We’ll stay at your flat.”\n“Lovely,” Malfoy said. “So glad we’ve got that sorted.”\nMalfoy gave Harry his Floo address, and then Harry went to Grimmauld Place to pack up his things. He stamped soot from his shoes, then started up the stairs, unbuttoning the heavy robes of his Auror uniform as he went.\nHe’d taken the second largest bedroom in the house, partly because the master bedroom still smelled faintly of hippogriff, no matter what Harry tried to do to remove the smell, and partly because sleeping in the cavernous master bedroom would have only served as even more of a reminder that he was rattling around this big old place all by himself. So he took the smaller bedroom and he tried not to think about the rest of it as best he could. And in any case, this bedroom was on the same floor as the sitting room, which meant that he had to climb up and down less flights of stairs, so using it really did make the most sense.\nAfter he changed into a pair of jeans and a warm jumper, he tromped up to the attic to fetch his old school trunk. Back down in the bedroom, he packed it with his uniform robes, jeans and shirts and jumpers, pants and socks, and a wool peacoat. A flick of his wand toward the bathroom brought a collection of bottles and jars zipping through the air to deposit themselves into the trunk, soap and shampoo and shaving cream and toothpaste, a toothbrush and a razor, and a fluffy white bath towel. He piled in all his textbooks and class notes, quills and ink and parchment, then threw the backlog of Quidditch magazines that’d been steadily accumulating over the last six months on top. Auror training kept him so busy that he didn’t think he’d need anything else while he was staying at Malfoy’s. And even if he did forget something, he could stop by easily enough to get it later.\nAfter a quick trip down to the kitchen to inform Kreacher that he’d be away (Kreacher had been, as Harry had expected, entirely indifferent) and pick up his favorite mug and a box of the tea he preferred, Harry was ready to leave. He hauled his trunk over to the Floo and hesitated. Traveling with a large object wasn’t against the law, per se, but the Floo Network Authority did tend to frown upon it. Baggage-related incidents were the second most common cause of Floo Network injuries, and the whole point of staying bonded to Malfoy was to avoid St Mungo’s.\nBut fuck it, Harry thought to himself as he scooped up a good handful of Floo powder from the repurposed jam jar on the mantel. He was willing to gamble that getting himself accidentally bonded to Malfoy was the worst thing that would happen to him today.\nHe was pleased when that turned out to be true. Harry stumbled from Malfoy’s Floo and managed to get himself out of the way just in time for his trunk to come clattering out behind him, bringing with it a spray of soot.\nHarry supposed he’d feel worse about it if he weren’t so busy feeling impressed with himself that he’d taken his trunk through the Floo and hadn’t earned himself a trip to the hospital. He breathed out a soft sigh of relief and looked around at the place he'd be living in for the next four weeks.\nMalfoy’s flat was not at all what Harry had imagined. He’d expected something like the Manor, cold and formal, all pale marble and high ceilings, and filled with the sort of furniture that people bought more for decoration than comfort. But Malfoy’s flat was warm and surprisingly cozy, with dark wood floors and huge windows. Malfoy had about four bookcases worth of books crammed onto two bookcases, and his sofa and the two matching chairs that flanked it had thick cushions that looked wonderfully soft and inviting. A large Persian rug completed the room, and thank god the soot hadn’t quite made it that far.\nMalfoy came in as Harry was still casting charms to clean the floor. “Good Merlin,” he sighed, sounding enormously put-upon. “Is this what I can expect from you?”\n“Well,” Harry said with very-obviously forced cheerfulness, casting another Scourgify. “Start as you mean to go on.”\n“Brilliant,” Malfoy said, then sighed again. “Bedroom’s through there, I cleared out the left half of the wardrobe and the bottom two bureau drawers for your things.”\n“Oh,” Harry said, caught momentarily flat-footed by Malfoy’s unexpected generosity. He’d been prepared to live out of his trunk for the next month. “Thanks. That’s very thoughtful of you.”\n“Hardly,” Malfoy said. “I just didn’t think I’d be able to stand looking at you in wrinkled robes. Come into the kitchen when you’re done. I’ve got dinner on.”\n“Thanks,” Harry said to Malfoy’s retreating back. He grabbed his trunk and lugged it into the bedroom.\nMalfoy had painted his walls a soothing shade of blue and decorated them with what looked like illustrated pages from his old Hogwarts Astronomy textbook enlarged and framed. A plush navy blue area rug covered most of the floor, with a soft, thick pile that just begged Harry to dig his toes into it. The furniture was all plain, dark wood, and there was a heavy ceramic lamp in the shape of a Romanian Longhorn on the nightstand, with jewel eyes and an upturned snout and the white lampshade bent into a whimsical shape that looked like a puff of smoke being exhaled.\nAnd then there was the bed.\nObjectively, it was a very nice bed; it looked soft and inviting, with a puffy duvet in a crisp white cover and a whole heap of fluffy pillows piled up against the headboard. But to Harry, knowing that in a few short hours he’d be climbing into it with Malfoy, together, the mere sight of it made his nerves tie themselves up in knots.\nHarry did his best to put it from his mind, and quickly put his things away, hanging his robes in the wardrobe and putting stacks of tee-shirts and trousers and socks and pants neatly into the bureau drawers Malfoy had cleared for him. When he finished, he closed his trunk and put it against the wall under the window. He didn’t see any reason to unpack the rest of it right now.\nThen, bracing himself, he turned and went to join Malfoy in the kitchen.\n- - -x- - -\nLater that evening, Harry lingered in the bathroom as long as he could reasonably get away with, dawdling as he washed his face and brushed his teeth and changed into his pajamas. \nThen, when he could put it off no longer, he shut off the light, stood there in the darkness for a moment to gather his nerve, and then opened up the door.\nMalfoy was already in bed when Harry stepped back into the bedroom, curled up on the right side and facing the wall, leaving the left side of the bed empty for Harry. He stared at Malfoy—the shape his his shoulder made under the covers and the way his hair looked almost gold against the crisp white of the pillowcase—and forced down a fresh wave of panic. He’d been nervous enough about this when the bed was empty; facing the bed with Malfoy in it, with the corner of the sheets on Harry’s side turned invitingly down, ready and waiting for him to get in, well. Harry wasn’t at all prepared for this.\nHe swallowed hard and told himself he was being ridiculous. There wasn’t anything worse than a bit of awkwardness that could possibly come of this. This would be fine. There was nothing at all to be worried about.\nHarry got into bed, leaned over to turn off the lamp, slid his glasses safely under his pillow, then settled stiffly on his back.\n“Turn over,” Malfoy said without moving. “We can put our backs to each other. That ought to suffice for contact.”\nHarry thought about asking Malfoy to swap sides with him—he normally slept on his right side and lying with his back to Malfoy would put him on his left—but in the end he didn’t say anything, just turned obediently over and scooted back, and his arse bumped against Malfoy’s. Malfoy quickly shifted away, resettling himself so that their backs pressed together and there was space between the rest of them. Harry wanted to pull the pillow over his head and smother himself with it, because his arse had just touched Malfoy’s arse. Touching of arses had just occurred, and worse, Harry’s stupid brain refused to stop replaying how it had felt warm and surprisingly soft against his own, and now he was thinking about touching Malfoy’s arse with his hands and oh god that was worse.\n“Nngggh,” Harry said and clasped a hand over his face as a wave of cringey shame washed over him.\nMalfoy shifted around again, the warmth of his back against Harry’s disappearing for a moment before he settled against him again. “Are you quite all right over there?”\n“Fine,” Harry said, and was pleased by how totally and completely normal his voice sounded. “I’m fine.”\nIt had only been surprise, he decided. Because Malfoy’s arse was warm and soft while the rest of him was sharp and bony and cold. That’s all it was. Harry was just caught off guard by how touchable Malfoy’s arse felt.\nWait. No. That wasn’t—\nExcept oh god it was.\n“Nngggh,” Harry said again, this time with feeling.\n“Potter,” Malfoy said sharply.\n“Sorry,” Harry muttered, squeezing his eyes shut.\nHe thought he would have a hard time falling asleep, between lying on his left and lying next to Malfoy and the whole arse thing, but barely ten minutes later, he was out.\n- - -x- - -\nOn the first morning of their forced cohabitation, Harry awoke to an empty bed. Yawning, he sat up and looked around, and found the bedroom quiet and dim. He hadn't even considered how bloody awkward it would feel to wake up next to Malfoy, but it looked like he would get to put off that particular experience until tomorrow.\nHe pushed himself out of bed and stretched, then pulled the covers neatly over the bed before he shuffled blearily out into the kitchen in search of his morning cuppa. He found Malfoy seated at the table with both hands curled loosely around a steaming mug, still wearing his green and white plaid pajama bottoms and a soft grey shirt. He had his long legs stretched out under the table, his bare feet looking very pale against the white tile floor, and the sunlight slanting in through the high window backlit his sleep-tousled hair bright gold.\nOh fuck, thought Harry when his heart gave a funny little shiver at the sight of Malfoy looking so soft and gentle and unexpectedly approachable. This is going to be a problem.\nMalfoy startled a little when he finally noticed Harry, tugging the sleeves of his shirt farther down over his wrists.\n“Morning,” Malfoy said, his voice still mellow with sleep, and the sound of it sparked a little flutter in the pit of Harry’s stomach. The bright wash of sunshine made his eyes look very clear and strangely colorless. “I thought you’d sleep for a while yet.”\n“Oh,” Harry said, looking quickly away. “Well. Here I am.”\n“There’s still hot water in the kettle,” Malfoy said after a moment.\n“Oh,” said Harry. “That’s, erm. Thanks. Thank you.”\nMalfoy was looking at him oddly, and Harry gave him a weak smile before he escaped to the other side of the kitchen. Malfoy had taken Harry’s mug and set it beside the kettle for him, and that unexpected bit of thoughtfulness made the flutter in Harry’s stomach grow more intense. \nBecause Malfoy was an attractive person, Harry couldn’t deny that. He’d known for years that Malfoy was exactly his type. But for years that knowledge had only remained an idle observation because Malfoy was horrible and it was really hard to be properly attracted to someone when you also wanted to punch them in their stupid pointy nose all the time. But this Malfoy? Who was still a little sleepy and still a little rumpled, warm and loose and relaxed and for once not being a total arse?\nYeah. Harry could already see this was going to be a problem.\nHe took his time making his tea, lingering over it until the fluttering in his stomach slowly faded.\n“Do you have anything you need to do today?” Harry asked as he took his mug over to the table. He hoped some conversation would distract him from himself, or that Malfoy would say something to remind Harry just how much he disliked Malfoy.\n“You mean besides go into the Ministry?” Malfoy asked dryly. He stretched out his feet under the table as soon as Harry sat down so that they were touching. His toes were cold even through the warm layer of Harry’s socks. “This morning's thrilling lecture topic is Application Requests for the Submission of Evidence Confirming Uncorroborated New Testimony. And why they think we need to know that, I haven’t the faintest. Aurors have nothing to do with trying criminals. That’s all the Wizengamot.”\n“I guess they want us to know all the aspects of how a case proceeds?” Harry offered even though he also thought it was ridiculous. Harry shifted his foot so it sat partially atop Malfoy’s, covering up his cold toes. His heartbeat quickened and he did his best to ignore it. This was just Malfoy’s foot; no reason to get worked up over that.\n“Bloody waste of time,” Malfoy muttered into his mug.\n“So, if all you’ve got planned today is training, would you mind going out this evening?” Harry asked, opting to move the conversation along.\n“We’ve got lecture again tomorrow morning,” Malfoy said, frowning.\n“I know, I know,” Harry said. “It’d just be for a little while, we wouldn’t be out late. It’s just that I had plans to meet Ron and Hermione at a pub. Hermione’s so busy with her job with the Department for the Regulation and Control of Magical Creatures that I hardly get to see her anymore. I mean, even Ron hardly gets to see her and they live together.”\nMalfoy grimaced. “Fine,” he said. His foot twitched beneath Harry’s. “But you’re paying for my drinks.”\n“Deal,” Harry said quickly.\nMalfoy looked at him suspiciously. Had Harry said that too quickly? He’d probably said that too quickly. But Malfoy shook his head and went back to his tea, and Harry let it go.\nHe’d figure out how to convince Malfoy to go to a pub in Muggle London later. Harry had the whole day to work on that problem.\n- - -x- - -\nIn the end, the way Harry got Malfoy to go along with it was by Side-Alonging him to the alleyway and ushering him quickly in through the back door of the pub. Then, by the time Malfoy realized that Harry had brought him to a Muggle pub, they were already there and it was too late to do anything about it.\nComplain, yes, and Malfoy did so at great length, starting with blurting out, “You’ve brought me to Muggle London?” as loudly as if he'd never even heard of the Statute of Secrecy. But he didn’t argue. And he mostly shut up once Harry bought him a pint.\n“Come on,” Harry said, leading the way to a corner table.\nIt was early enough that there were only a handful of other patrons scattered throughout the pub, and a mild Muggle-Repelling Charm cast around their corner ensured that anyone who came near would suddenly decide that a table on the other side of the room looked much more appealing. Harry wasn’t entirely sure it was necessary, but he didn’t quite trust Malfoy to behave himself amongst Muggles.\nMalfoy took the seat that put his back against the wall, and Harry sat down in the seat beside him, and jumped a little as Malfoy scooted his chair closer and pressed his knee lightly against Harry’s. Malfoy gave him a sour look, then glanced around the rest of the pub, took a sip of his pint, tapped his fingers against the table, took another sip of his pint, and regarded a couple who’d just walked through the door with deep suspicion.\nThis went on for about fifteen minutes, while Harry quietly gritted his teeth and drank his pint and ignored Malfoy as best he could, and then he couldn’t stand it anymore.\n“Will you stop that?” Harry told him when Malfoy started tapping his fingers again.\n“Stop what?”\n“That,” Harry said, putting his hand over Malfoy’s and trapping his tapping fingers against the tabletop. His hand was startlingly cold against Harry's, and for an instant Harry was overcome with the urge to take Malfoy’s hand in both of his to warm it up.\nThen Malfoy pulled his hand free and the strange urge passed.\n“Well pardon me,” Malfoy said sullenly. “I won’t move at all, since it seems to bother you so much. Shall I hold my breath as well? Am I breathing too loud, do you think? I wouldn’t want to annoy you.”\n“You could stop talking,” Harry said. “That’d be a great start.”\nPredictably, that earned him a glare. “You ought to be grateful that I agreed to come here at all,” Malfoy said. “Or that I didn’t walk straight back out when I saw where you’d brought me.”\n“And you could be grateful I didn’t force you to live in Grimmauld Place for the next month,” Harry shot back. “We can sit here all night and go back and forth about who ought to be grateful for what, but I think the next four weeks will go by much easier if we don’t spend them keeping score, don’t you think?”\nMalfoy’s lip curled. “You couldn’t have forced me to live in Grimmauld Place.”\n“Could have dug my heels in about it,” Harry pointed out, and wouldn’t that have been a fun adventure, seeing which of them could out-stubborn the other. “And will you stop that.”\nHe put his hand over Malfoy’s tapping fingers again, forcing them still.\nOf course, that was when Ron arrived. Harry didn’t notice his approach until he said, sounding enormously baffled, “Harry? What’s he doing here and why are you holding hands with him?”\nThey jerked apart, startled, and Malfoy gave Ron a narrow-eyed stare. Then he very calmly drained the last of his pint, put the glass down on the table, and turned to Harry and put out his hand. “I’m afraid I’ll need another drink if you expect me to make it through this little outing.”\nHarry obligingly handed over some money, because that seemed to be what would get rid of Malfoy the quickest. Sure enough, after Harry dumped a handful of coins into this palm, Malfoy was up and striding across the pub to the bar. Harry tried his best to ignore the little tingle of worry at the thought of Malfoy going to interact with the Muggle bartender. They’d already had four lectures on how to talk to Muggles, and Malfoy had top marks in their class. He could manage to order himself a pint. Probably.\n“So,” Ron said. “Now are you going to tell me why Malfoy is here?”\n“Well,” Harry sighed, shoving a hand through his hair. “That’s sort of a funny story…” he began.\n“Let me get this straight,” Ron said, looking from Harry to Malfoy and back again when Harry finished explaining it. “You managed to get yourself accidentally bonded to the Ferret on your very first assignment? And now you’ve got to live with him for the next four weeks?”\n“Yeah, pretty much,” Harry said miserably. “And for the love of god, don’t let him hear you call him that. The next month is going to be difficult enough to get through without the two of you at each other’s throats.”\n“I’m not at his throat,” Ron protested.\n“No, but he’ll be at yours if he hears you calling him Ferret.”\nRon snorted. “Well, you can relax. I’m not going to antagonize Malfoy,” he said. Harry must not have looked entirely convinced, because Ron rolled his eyes and pointed out, “Haven’t we been in training together for half a year so far? And no one’s hexed anyone else?”\nAnd really, no one had. In truth, Harry was still faintly surprised that it had all gone this well. The very first day of Auror training, when he’d looked up and seen Malfoy walk into the room, he’d been afraid that they’d end up hexing each other, or worse.\nBut instead, everyone had seemed to independently come to the same conclusion: that they had enough to worry about with Auror training, and it would go much easier if they all agreed to do their best to let go of old grudges. And then by their second week into training, they’d been much too busy to waste time and energy on childish squabbling. Harry had done a mostly-okay job of ignoring Malfoy, at least until they were assigned to each other as partners.\n“So,” Ron said. “Do I even want to know what the handholding was about?”\n“It wasn’t handholding,” Harry said. “He kept tapping his fingers on the table. It was driving me spare so I made him stop.”\nRon gave him a skeptical look, then glanced across the room. Harry followed his gaze. Malfoy had both elbows leaned on the bar as he spoke to the bartender. It made his shirt draw tight across his shoulders, made his lower back curve just-so, made his arse stick out appealingly.\n“You know,” Ron said, snapping Harry’s attention away from Malfoy. He turned back around and tried his best to look like he hadn’t just been staring at Malfoy’s arse. \n“What?” he asked as innocently as he could manage.\n“You know,” Ron said again, “when I walked up and saw you with Malfoy, I thought you were going to tell me that you’d taken up with him.”\nHarry gaped at him. “Taken up with him?” he repeated, because Ron couldn’t be saying what it sounded like he was saying.\n“Yeah, you know. Were fucking him, or dating him, or had gone off and got yourself secretly married to him or something.”\n“What? Why the fuck would you think any of that?”\nRon shrugged again. “Fine line between love and hate and all that? There’s always been this weird thing between you and him. Also, you keep staring at his arse.”\n“I do not.”\n“Mate. I just saw you do it,” Ron said. “About thirty seconds ago.”\nHarry didn’t think there was any way to deny it, so he gave up.\n“Well it’s a very nice arse,” he admitted, and sighed as he slouched back in his seat. “I just wish it weren’t attached to the rest of him.”\n“Because he’s a giant wanker?” Ron asked, a little hesitant, a little hopeful, like he was afraid of the answer he might get but still couldn’t stop himself from asking.\n“Because he’s a giant wanker,” Harry agreed, and Ron clapped him hard on the shoulder.\n“Thank Merlin,” he said. “Just try to keep that in mind while you stare at his arse.”\n“I don’t stare,” Harry protested, because he didn’t. He just looked sometimes, that was all.\n“Because if you do take up with him,” Ron went on like Harry hadn’t spoken, “I’m going to have to do my best to get along with him. Because I am a good and supportive friend. And yes, I know he’s nowhere near as much of a shit as he was in school, but I still don’t want to.”\nMalfoy returned just then with three fresh pints. He kept one for himself, and passed the other two to Harry and Ron.\n“Thanks,” Harry said, faintly surprised.\n“I don’t know why you’re thanking me for it,” Malfoy said as he slid back into his seat. “It was your money.” He paused and gave Ron a dour look. “I didn’t poison it, you know.”\nRon turned the suspicious look he’d been aiming at the pint onto Malfoy instead. “I didn’t think you had,” he said slowly, as if Malfoy had suggested something utterly absurd. “Because I watched you carry them over here.”\n“Congratulations,” Malfoy said dryly. “You’ve got eyes that work.”\nHarry elbowed him. Malfoy elbowed Harry back.\n“I mean, not that I would ever have guessed,” Malfoy continued. “It’s not that you’re actively training for a career where your keen powers of observation will be of utmost importance, or anything.” He shrugged. \"Then again, they let Potter in, didn't they? So who knows.\"\n“Malfoy,” Harry said warningly.\n“Potter,” Malfoy sing-songed back.\nHarry inhaled slowly through his nose. “Don’t be an arsehole,” he said.\n“That wasn’t part of our arrangement,” Malfoy said. “The arrangement was I agree to come here and you pay for my drinks. You never said anything about me having to be nice to anyone.”\n“Wait,” Ron said, cutting in. “Harry. You really gave me a talking-to about being nice to him, but you didn’t give him one about being nice to me?”\n“It wasn’t a talking-to,” Harry said. “I only asked you to not antagonize him.”\n“I was given no such instructions,” Malfoy said smugly.\n“Shut up,” Harry said without looking at him.\n“I’m just saying,” Ron went on. “I’m supposed to be your best mate. If you should be giving anyone a talking-to about being nice to anyone else, you should be giving it to him about me.”\nThere was no good way to explain it. Harry had asked Ron because he knew that Ron would go along with it for Harry’s sake; Malfoy had no such interest in making Harry’s life easier, and depending how much of an arsehole he felt like being at the moment, he might even go out of his way to do the opposite.\nLuckily, he was saved from any sort of reply by Hermione approaching their table, pint glass in hand.\n“Hermione!” he said. “I’m so glad you’re here.”\n“Hello,” Hermione said with a faint frown, looking around the table. “Malfoy, I didn’t realize you’d be joining us.”\n“He and Harry are bonded,” Ron said as she sat down, then leaned over to kiss her cheek.\nHermione blinked. “Bonded?”\n“Accidentally,” Harry said.\n“Temporarily,” Malfoy added.\n“And now they have to live together for a month while the bond fades,” Ron finished. He took a drink of his pint.\n“Really,” Hermione said, looking back and forth between Harry and Malfoy. “How on earth did you manage that?”\n“Accidentally,” Harry said again, because he couldn’t stress enough that this hadn’t been on purpose.\n“Really,” Hermione said again, sounding suspicious now. “And there was no way to undo it?”\n“There is,” Harry said. “But we’d have to go to St Mungo’s, and then there’d be a record, and if other people found out how easily I’d ended up bonded to Malfoy…”\nHermione grimaced at that. “I see,” she said.\n“It’s fine, it’s only for a few weeks. So. How was work?” Harry asked in a desperate attempt to change the subject, because she always had plenty to say about work. Hermione was currently working in the Ministry as an assistant to Baxter Babcock, the current head of the Office for Werewolf Support Services in the Department for the Regulation and Control of Magical Creatures. She’d wanted a position with the Office for House-Elf Relocation—the best way to change a system was from within, she said—but they hadn’t had an open position when she’d applied, so she’d settled for Werewolf Support Services instead.\nShe’d been butting heads with Babcock ever since. According to Hermione, he was insufferably small-minded, unbearably arrogant, and the only reason he even worked in Werewolf Support Services was because he was exceptionally lazy and, due to the stigma that werewolves faced, no one ever came in so he never had to do any work. Ron had stopped suggesting that she quit after the second week, recognizing a lost cause when he saw one. No one could dissuade Hermione from something once she’d made up her mind about it, and at this point, she’d made up her mind to single-handedly destroy wizarding society’s intolerance and bias against werewolves.\nFrankly, if anyone could do it, Harry thought it’d be her.\n“Oh, Babcock,” she huffed. “I’m trying to organize a program with St Mungo’s where lycanthropy victims can register to receive regular doses of Wolfsbane Potion. All he’d have to do is sign off on it; I told him I’d take care of everything myself and he wouldn’t even have to lift a bloody finger.”\n“Let me guess,” Ron said. “He rejected it flat-out.”\n“Well, Miss Granger,” Hermione said, deepening her voice and making her tone go as crisp and posh as she could make it in an imitation of Babcock, “I’m afraid you’re just not looking at it from my point of view.”\n“Of course you’re not looking at it from his point of view,” Malfoy said, and Hermione looked outraged for a split second before Malfoy finished, “To see anything from Babcock’s point of view, you’d have to stick your head entirely up his arse, and frankly I don’t see how there’d be room for you along with the enormous stick he’s got shoved up there, to say nothing of his overblown sense of self-importance and his delusions of grandeur.”\n“That’s what I’ve been saying!” Hermione said, lighting up. “That is exactly what I’ve been saying. It’s absolutely infuriating!”\n“Babcock does tend to inspire that feeling in people,” Malfoy said. “I haven’t been forced to interact with him in any sort of official capacity, thank Merlin. But I’ve been attending Ministry functions with my family since I was old enough to be trusted to tell the salad fork from the dinner fork, and my father has no compunctions about using me as a distraction to get out of conversations with people he’d rather not speak to.”\nHarry tensed, waiting for the inevitable follow-up to that about how those conversations had prepared Malfoy for tonight.\nBut instead, Malfoy regarded Hermione thoughtfully for a moment before he asked, “Have you gone to Curtis Matheson about it?”\n“Matheson?” Hermione repeated. “Why on earth would I go to the Head of the Department of Magical Transportation about a Magical Creatures issue?”\n“Because navigating Ministry politics is a bit like trying to untangle a Venomous Tentacula,” Malfoy said. “There’s a very good reason I went into Law Enforcement instead of following in my father’s footsteps and getting involved in the political side of it. You won’t get anything done without knowing whose arse to kiss and whose arse to kick, the best ways to bribe or put pressure on them, or whom to bribe or put pressure on to do it for you. Getting anywhere with Babcock will be tedious, and there will be a lot of absurd hoops to jump through, but it's doable if you know how to go about it.”\nHermione was frowning a little, but her gaze had gone intense the way it did sometimes in class when she was really focused. “I’m listening,” she said. “You said I need to speak with Matheson in Magical Transportation?”\nHarry watched with some measure of disbelief and no small amount of relief as Hermione and Malfoy settled into their conversation. This evening was going better than Harry had been afraid it would.\n“Hey,” Harry said later that night as he and Malfoy got into bed together. “Thanks for helping out Hermione. You, er, you didn’t have to do that, and I appreciate it.”\nMalfoy went still, one knee on the mattress, one foot still on the floor, and the duvet lifted out of his way. “It was Babcock, Potter,” he said. “The man ought to have retired a decade ago, and if Granger doesn’t have his job by Easter, I’ll gladly eat my words. All I’ve done is point her in the right direction.”\n“Still,” Harry said, sliding into bed in a soft rustle of sheets. “Thanks.”\n“It was nothing,” Malfoy said. He got into bed and turned out the lamp before settling down. “But if you really want to thank me, you can handle figuring out dinner for us tomorrow night. We’ve got a Magical Jurisprudence lecture tomorrow morning and a lecture on International Extradition tomorrow afternoon, and I can only handle one of those on any given day.”\nHarry smiled to himself in the darkness. “Deal,” he said.\n- - -x- - -\nAfter two weeks of bedsharing, Harry was almost used to it. The awkwardness of climbing into bed with Malfoy had mostly faded, excepting two more incidents of accidental arse-touching (one Harry’s fault, and one Malfoy’s) and one morning where Harry had woken up first, and looked over at Malfoy to find that he’d kicked the duvet down past his waist and the soft flannel of his pajamas did nothing to disguise the shape of his hard cock. Cheeks hot and his own morning erection throbbing, Harry had managed to slip out of bed without waking him, and hid in the bathroom until he heard Malfoy up and clattering about in the kitchen. (He felt vaguely guilty for wanking in there, but nowhere near as guilty as he felt for the second peek at Malfoy he wasn’t able to resist sneaking before he left the bedroom.)\nSo, getting into bed and then waking up again had their own sets of challenges, but so far the middle part had been mostly all right.\nUntil now, at least.\nHarry woke up suddenly in the middle of the night. At some point, they’d both rolled over, Harry onto his left side and Malfoy onto his back. His head was lolled toward Harry, and every breath he exhaled puffed a big gust of sleep-sour breath directly into Harry’s face.\nGroaning, Harry reached out and nudged at Malfoy until he rolled his head away.\nHarry settled back down and closed his eyes. He had only a few minute’s respite before Malfoy’s head flopped back the other way and he was breathing right in Harry’s face again. Harry nudged him again, harder this time, until Malfoy pointed his face away once more.\nThe third time it happened, Harry yanked the pillow out from under Malfoy’s head and hit him with it.\nMalfoy sputtered awake and got his bearings remarkably quick. He grabbed for the pillow and wrestled it away from Harry, then lunged forward and shoved Harry out of bed. Harry tumbled painfully onto the floor, then reached up and grabbed hold of the duvet and yanked, and Malfoy yelped and grabbed the edge of it and yanked back. Their tug-of-war was brief but vicious. Harry, having better leverage from his place on the floor, won.\n“You are a child,” Malfoy shouted from the bed.\n“Fuck off,” Harry shouted back, taking his armload of duvet out into the sitting room.\n“Fuck off!” Malfoy echoed. “You’re telling me to fuck off? You’re the one who woke me up in the dead of night by trying to smother me with a pillow!”\n“I didn’t try to smother you with it, but I bloody well should have,” Harry told him, sitting down on the sofa and angrily flipping the duvet open to cover himself. “Would’ve served you right. You were breathing right in my face.”\n“I was asleep!”\n“You were annoying!”\n“Arrgh,” Malfoy said, and the bedsprings creaked as he threw himself down on the mattress. “You’re an arsehole. Come back to bed.”\n“No,” Harry said before he’d even registered it. He knew he was being ridiculous and childish, but when Malfoy started trying to order him around, digging his heels in was second nature. Especially when Malfoy tried to order him around and insulted him in the same breath.\n“Potter. Stop being an arsehole and come here.”\n“No. I’m staying on the sofa.”\n“Arrgh,” Malfoy said again. Then, “Fine. Fine, you absolute shit. Have it your way.”\nThere was a thud as his feet hit the floor. He stalked out of the bedroom and up to the sofa, jerked an edge of the duvet away from Harry and shoved in beside him, his body pressed up against Harry’s side from shoulder to hip to knee. Harry elbowed Malfoy. Malfoy elbowed Harry back.\n“Stop it,” he said. “I’m going to sit here until you come to your bloody senses and get back in bed where you belong.”\n“Then I guess we’re going to be sitting here all night,” Harry told him.\n“Fine.”\n“Fine.”\nThey fell asleep like that.\n- - -x- - -\nHarry woke up the following morning with a crick in his neck and Malfoy drooling onto his shoulder.\nHe made a quiet sound of disgust, then stood up. Malfoy, who’d been slumped heavily against Harry’s side, flopped face-first onto the sofa cushions.\n“Wha…?” Malfoy said blearily, picking himself up.\nBut Harry didn’t look back as he stomped into the bathroom and shut the door.\n- - -x- - -\nBreakfast might have been a tenser affair had either of them been more awake; Harry was still groggy even by the time they took the Floo to the Ministry, and Malfoy didn’t look any more alert. Thankfully, today was another full day of field work, and that gave Harry a chance to insist that they stop for coffee on the way to their new assignment. He didn’t think he’d have been able to manage if they’d had a morning lecture today, gritty-eyed and exhausted as he was. The mere idea of listening to their instructor drone on and on made Harry yawn.\nMalfoy grumbled about stopping on the way to their assignment, but tempted by the blessed pick-me-up of a good cup of coffee, he didn’t argue.\nHe did, however, make Harry pay for his drink.\nTheir assigned case that day was straightforward: an enchanted book had ended up in a Muggle bookshop, and Harry and Malfoy were to go to the shop, retrieve the book, and transport it safely back to the Ministry. Normally in a situation like this where an enchanted item ended up in the hands of a Muggle, a trained Obliviator would be deployed as well. But by sheer luck, this particular item had ended up in the hands of a Muggle whose cousin happened to be a Muggleborn witch, and he’d known to contact the Ministry straight away.\nHarry pushed open the glass door of the shop, setting the string of bells tied to the top jingling merrily, and perked up a little at his first breath. There was something comforting about the way a bookshop smelled, especially ones like this that sold used books, and Harry drew in another, deeper breath as Malfoy stepped inside behind him and the door swung shut in another tinkling of bells.\n“Are you taking lead on this or shall I?” Harry murmured to Malfoy, who gave him a flat look and pushed him forward. “Right then,” he sighed. They were in a Muggle shop; Harry shouldn’t have even bothered to ask. He edged deeper into the shop and raised his voice as he called out, “Hello?”\n“Hello?” came a voice from the back, and a moment later a short man with greying hair and enormous glasses poked his head out from behind a shelf. “Are you from the Ministry? Have you come for the book?”\n“Yes, that’s us,” Harry said, glancing around. The sign on the door had read ‘Closed’ but it couldn’t hurt to check. “Is there anyone else in here?”\n“No, no. I closed the shop until this could be dealt with. Thank you for coming out so quickly.”\n“Just doing our jobs,” Harry said. “If you’ll show us the book, we’ll do our best to get out of your hair as quick as we can.”\n“It’s back there,” the shop owner said, pointing. “The one on the floor.”\nHarry led the way into the corner, where a cardboard box packed full of books sat beside a half-filled shelf. One book lay on the floor, cover lying open to the endpaper so Harry couldn’t see the front.\nCautiously, he picked it up, flipping the cover shut. Uncaged read the book in large green font across the top, and then below that, The Biography of Nicolas Cage. Between the two was a large photo of the man himself, wearing a tight black tee-shirt and making a face that Harry supposed was meant to be smoldering or somesuch, but really just made him look as if he was profoundly uncomfortable. And moderately concerned. And maybe a little sad. It was a very strange expression.\nThis wasn’t a magical book. Harry looked around, but didn’t see another book on the floor, or anything else that was obviously wizarding. Sighing, he glanced down at the book in his hand just in time to see Nicolas Cage’s eyes roll right, then left, and a manic grin spread across his face. “I’m like a prickly pear,” he said with a sort of terrifying intensity.\nMalfoy flinched back, startled. Harry nearly dropped the book.\n“He’s been doing that all day,” said the shop owner from the safety of his position behind the bookshelf. “Unsettling, isn’t he?”\n“I could eat a peach for hours,” Nicolas Cage said, still smiling maniacally.\nMalfoy looked up at Harry, perfectly baffled and more than a little disturbed. “Who on earth is this man and why does he keep talking about fruit like that?”\n“That was the plan,” Nicolas Cage said sagely before Harry could answer. “To give you a boner. And now you’ve got one.”\n“Okay,” said Harry briskly. “That’s quite enough of that.” He shoved the book at Malfoy. “Here, hold him a sec.”\n“It keeps talking as long as someone’s touching it,” the shop owner helpfully pointed out.\n“We’ve worked that out for ourselves, thanks,” Malfoy said, and was nearly drowned out by Nicolas Cage suddenly shouting, “I’M A VAMPIRE!” and oh dear lord, now he was flapping his arms.\n“What the fuck,” Harry said to himself, which was a tremendously unprofessional thing to say while on a case, but he hadn’t had nearly enough sleep to be dealing with this. Who the fuck had done this to Nicolas Cage, and more importantly, why had they thought it was a good idea? He dug a crumpled receipt out of his pocket and Transfigured it into a clear plastic bag. He held it open to Malfoy. “Here, put him in.”\n“I’M A VAMPIRE! I’M A VAMPI—”\nMalfoy dumped him in, and Nicolas Cage’s voice cut off abruptly as Harry sealed the bag with the book inside. Through the clear plastic, Harry could see that he’d gone still and quiet. He breathed a sigh of relief.\nThe shop owner popped his head around the corner. “Is it done?”\nHarry held up the bag as Malfoy heaved a sigh of relief. “It’s done.”\n- - -x- - -\n“Merlin, what a fucking day,” Malfoy said. He looked mournfully down at his shoes, then sighed and Vanished them.\n“You can say that again,” Harry groaned, and couldn’t remember the last time he’d felt so glad to be home. He kicked off his trainers and unbuttoned his robes as he headed to the bedroom to change into something more comfortable.\nAfter they’d dealt with Nicolas Cage, they’d returned to the Ministry and were commended for taking care of it so quickly. Then, as what Harry supposed was meant to be a reward, they’d been sent immediately out on another case.\nAn enterprising young wizard had attempted to emulate the Weasley twins by creating his own line of Skiving Snackboxes and had succeeded in poisoning half his Housemates. Harry and Malfoy had gone to Hogwarts to collect statements from the affected students. It’d taken all afternoon, and one of the kids had puked on Malfoy’s shoes.\nAt least they’d got dinner out of it. Harry had somehow managed to forget how fantastic the food at Hogwarts was. Malfoy wasn’t a completely terrible cook, and Harry did all right in the kitchen. But the Hogwarts house-elves were in another league entirely.\nWhen Harry finished changing into a worn pair of jeans and his favorite Weasley jumper, he headed back out and went straight for the kitchen.\n“Tea?” he called out.\n“Please,” Malfoy replied, disappearing into the bedroom to change out of his uniform.\nHarry put the kettle on and leaned a hip against the counter, waiting for it to boil. A minute later, he heard the bedroom door open, then the dry swish-swish of Malfoy’s bare feet on the floor.\n“Do you feel like International Wizarding Case Law or Magical Jurisprudence tonight?” Malfoy called from the sitting room. “We’ve got exams for both of them next Tuesday, I’ll remind you.”\nHarry rolled his eyes a little bit at that. Malfoy was nearly as bad about studying as Hermione had been during school. He probably knew that Harry was already a chapter and a half behind in it, but the mere thought of his Magical Jurisprudence textbook made Harry want to knock his head against the wall. “Case Law, please,” he called back. \n“Good choice,” he heard Malfoy say to himself. Then came the thump of a heavy book hitting the coffee table, and the creak of sofa springs.\nTea and studying together in the evening had been one of the first habits they’d fallen into, and by now Harry found himself looking forward to it. They didn’t talk much, but having someone near him, steadily working their way through the same material as him, made it a little easier to stay focused.\nAnd in two more weeks, that would be over. Harry would be back to his own home, his own habits, his own life.\nStrange how thinking of that didn’t feel like such a relief anymore.\nHe tried to tell himself that it was because he was lonely. Auror training didn’t leave time for anything else, much less dating. And Harry’s house felt so big with only him living in it. He tried to tell himself that it was just the comfort of living with someone in general, and not living with Malfoy specifically.\nBut sometimes when he looked at Malfoy, his heart gave a little stutter and a strange almost-painful twist went through his stomach. And it was getting harder to deny what that meant.\nThe kettle began to whistle, pulling Harry from his thoughts, and he turned to prepare the tea. A few minutes later, Harry carried the two mugs into the sitting room where Malfoy was stretched out on the sofa, and put them down on the coffee table before he picked up the Case Law book Malfoy had brought out for him. He tapped it lightly to Malfoy’s toes. “Up.”\nMalfoy obligingly lifted his feet, propping them across Harry’s lap as soon as Harry sat down. Harry dragged the throw blanket off the back of the sofa and draped it over Malfoy’s bare feet, then propped his book on Malfoy’s shins and settled in. Malfoy had one arm tucked beneath his head and the enormous Magical Jurisprudence book balanced on his chest, his other hand splayed across the back of it to keep it balanced. His sleeve had ridden up a little, revealing the fading bond mark around his wrist. He had a small mole on the back of his wrist, and the bond mark was now light enough that it had begun to show through.\nHarry swallowed hard and looked away, trying to focus on his own work. After a page or two, he managed to shift his brain into the right gear for studying. The rest of the flat fell away, and even the warm press of Malfoy’s calves across Harry’s thighs faded into the background. He made it through six sections before his eyes began to droop. Just one more and he would have done enough that he wouldn’t feel too guilty about stopping there.\nHis resolve lasted until he glanced over and saw that Malfoy had let his book fall forward and was lying with it covering his face, one finger idly tapping against the spine.\n“You’re not going to learn through osmosis, you know,” Harry said.\n“Probably not,” came Malfoy’s muffled voice from beneath the open book. “But I think I’ll try it a while longer just to make sure.”\nHarry snorted, and reached out to poke at Malfoy’s knee. “Come on, you’ll be better off going to sleep and getting a good night’s rest.\nMalfoy lifted the book enough to peek out at Harry. “You’re done studying for the night?”\n“Yeah,” Harry said, marking his page before he closed the book and tossed it aside. He slapped lightly at Malfoy’s ankle. “Come on, up.”\nMalfoy let Harry up, then pushed himself to his feet and went off to shower while Harry took their empty mugs back into the kitchen. After putting them by the sink, Harry held up his right hand and inspected his wrist to see how his own mark was fading. He didn’t think it would be too much longer until it had faded to a shade that would be indistinguishable from his skin. Malfoy’s would probably be visible for a while longer, since he was so pale. And then it would be gone entirely, and Harry and Malfoy would be free to go their separate ways. Harry dropped his hand and sighed.\nIt was just the comfort of living with someone. That’s all it was.\nYeah. Right.\n- - -x- - -\nLiving with Malfoy was difficult in a lot of ways, but having someone there with him when Harry woke up from a nightmare was a comfort from his Hogwarts years that Harry hadn’t realized how much he’d missed until he suddenly had it again.\nHarry came awake with a gasp, the adrenaline thundering through him forcing him halfway to sitting with his body’s frantic desperation to move! before his brain caught up and he forced himself to stop.\n“Shit,” he sighed, easing himself back down to the pillow.\nThe dream had been intense, made worse by the fact that it was part-memory. He’d been back in the Room of Requirement set ablaze, Malfoy screaming at him for help from atop a teetering stack of furniture. But when Harry tried to pull him up, Malfoy kept sinking, falling closer and closer to the leaping flames, and the handfasting cord that wrapped tightly around their wrists pulled Harry down with him.\nHe could still feel the heat from the flames echoing through him, nightmare and memory twisting up until he couldn’t tell which was which.\n“You’re fine,” Malfoy said sleepily, and Harry hadn’t even noticed he was awake. He reached over and clumsily patted at Harry’s shoulder. “Go back to sleep.”\n“Sorry,” he said. “I didn’t mean to wake you.”\n“It’s fine,” Malfoy said. Then, after a long pause, “Do you need to talk about it?”\n“No,” Harry said. This was old trauma. He knew how to deal with it on his own, how to set it aside and push it back down.\n“Thank Merlin,” Malfoy said with such heartfelt relief that it made Harry laugh. “I’m rubbish at that sort of thing.”\n“Well, thanks for offering anyhow,” Harry said, and immediately hoped that Malfoy was too groggy to notice the genuine affection in his voice.\n“Don’t mention it,” Malfoy said through a yawn. The sheets rustled as he settled down again. “I’m going back to sleep now. Good night.”\n“Good night,” Harry echoed. He listened to the sound of Malfoy’s breathing grow steady and deep, and then carefully, very carefully, shifted over until his shoulder touched the warm curve of Malfoy’s back.\n- - -x- - -\n“So, one week left until you get your life back,” Ron said as soon as Malfoy walked away from their table. “You’ve nearly made it.”\nThey were out in a bar this time. Harry and Hermione liked to try a new place each time they went out, and Ron very indulgently went along with it. This one was a little more club-ish than they usually aimed for, darker and with loud music that meant they had to raise their voices to be heard.\nHarry shrugged. “Yeah.”\nFrowning, Ron exchanged a look with Hermione, then glanced quickly over his shoulder to make sure that Malfoy wasn’t back from the toilets yet even though he’d been gone less than twenty seconds. “You don’t sound nearly as excited about it as I thought you would.”\nIt was Friday night after a very long and trying week, and Harry was enormously exhausted and a little drunk. “I guess I’m not,” he admitted before he could think better of it.\nRon blinked at him. “You’re not?”\nHarry shifted in his seat. “Not really? No?”\nSlowly, Ron’s expression slid from surprise into deep suspicion. “Does this have anything to do with Malfoy’s arse?”\n“I should never have told you about that,” Harry said.\n“You didn’t have to, mate,” Ron told him. “As Malfoy so graciously pointed out the other week, I’ve got eyes that work.”\nHarry groaned. “Is it really that obvious?” He glanced nervously over his shoulder. The absolute last thing he needed was for Malfoy to come back and overhear this conversation. “Please tell me it’s not that obvious.”\n“I’m certain that Malfoy hasn’t noticed you looking, if that’s what you’re worried about; his back’s always to you when it happens,” Hermione said helpfully.\nRon snickered into his pint glass, and Harry put his head down on the table. Hermione patted his shoulder consolingly.\n“I have the worst friends,” he moaned, and Hermione patted his shoulder again.\n“If by worst you mean best,” Ron said, still sounding far too amused about Harry’s discomfort.\n“Harry!” Hermione said suddenly, standing up and hauling him to his feet so suddenly that he wobbled and nearly went down. “Come with me to the bar, I need another drink.”\n“But you’ve got…” he began, grabbing at the table for balance. Guess he was a little drunker than he’d thought.\nBefore he could finish his sentence, Hermione picked up her glass and downed the rest of her vodka tonic in one smooth gulp.\n“Erm,” he said as she put the glass back on the table and looped her arm through his. He looked helplessly back at Ron as Hermione dragged him away.\n“We’ll be back!” she called over her shoulder.\nHarry turned back around just in time to see Malfoy making his way back to the table. He swayed closer as they passed by each other, his hand brushing against Harry's. His knuckles were cold against the back of Harry’s hand.\nUp at the bar, Hermione flagged down the bartender and placed her order. “Do you want anything?” she asked Harry.\nHe glanced over his shoulder at the table where his pint sat half-full and waiting for him. Malfoy and Ron were talking, neither one of them looking entirely comfortable with the other, though they both seemed to be making an effort. Malfoy sat with his back to the wall again, as he’d done the previous two times Harry had brought him out since they’d been bonded, and every so often his sharp gaze swept over the Muggles around him. The bright cyan glow of a neon sign mounted on the wall above him bathed him in cool light and tinted his hair pale blue, made it look very soft and fine, and Harry's fingertips itched so badly to touch it that for an instant he thought it was the bond pulling at him. But no, he’d only just touched Malfoy’s hand; this was all Harry.\nMalfoy looked up just then, and their eyes met. One corner of his mouth quirked up in a small smile before he turned away again, eyes lowered demurely for an instant before he returned his attention to Ron. Harry’s heart kicked against his ribs.\n“Harry?”\n“No. Thanks,” Harry told Hermione, turning back around. “I’m fine.”\n“Just as well. Thank you,” Hermione said as the bartender brought her drink over, then returned her attention to Harry. “I’d only have put it on your tab.”\n“Of course you would have,” Harry said. “You know, just once I’d love for someone to pay for my drinks for a change.”\n“And speaking of Malfoy,” Hermione said, even though Harry hadn’t mentioned him by name, and Harry groaned loudly. “How long have you fancied him?”\nHarry thought about denying it, but he’d already admitted that he wasn’t excited for the bond to end so he didn’t think any denial he attempted would be terribly convincing. And, in any case, he suspected he was a little too drunk to be lying to Hermione at all. He was pretty awful at it even when he was sober and had his wits fully about him.\n“Because you’ve been looking at his arse for years,” Hermione went on, “but lately you’ve been looking at him.”\nHarry swallowed and it took every ounce of his willpower to keep from looking back at Malfoy again. “I don’t know what to do,” he said quietly.\nHe didn’t think Hermione could possibly have heard him over the loud music, but he supposed that the look on his face must have said it all for him anyhow, because her amused expression softened into concern.\n“The way I see it, you’ve got two choices, haven’t you?” she said, leaning in close. “Tell him, or don’t tell him.”\n“It’s not that easy…” he began.\nShe raised her eyebrows and stared him down. “Isn’t it?”\nHarry looked back across the bar. Ron and Malfoy were still talking, and as Harry watched, Ron said something to Malfoy that made him laugh—really laugh; mouth open, eyes squeezed shut, head thrown back—and Ron looked surprised for a moment before he laughed, too. And in that moment, Harry felt like this was really something he could have. That the past three weeks had been the beginning of something wonderfully real. The quiet evenings spent studying together in Malfoy’s flat, falling asleep each night to the soft sound of Malfoy breathing beside him, waking up each morning to sheets warmed by their shared body heat. How their lives had slowly begun to entangle, how Harry’s favorite mug had its own place in Malfoy’s kitchen cupboard, his books stacked together with Malfoy’s on the shelf, his clothes in Malfoy’s wardrobe and their toothbrushes in the same cup by the bathroom sink. It wasn’t much, not yet, but it was enough to make it easy for Harry to envision more.\nAnd sometimes—not often, and only for an instant—Harry caught Malfoy looking at him like maybe he was thinking the same.\nThe thought was at once exhilarating and terrifying, because if this little taste of being in Malfoy’s life already made Harry feel like he’d been kicked in the chest, how much more would it hurt to be rejected by him?\n“It’s not that easy,” Harry said. “But you’re right, it is that simple.”\nBecause as much as rejection would hurt, Harry thought that the not knowing would be worse. If Malfoy made it clear he was uninterested, it would hurt, but then it would be over and done with in one sharp blow, and Harry would be able to start learning how to get past it. But going on like this, with this awful longing and the vague promises of maybe and someday hanging over his head, well. Harry had always done better when he had a clear path before him, hadn’t he? \n“So you’re going to tell him?” Hermione asked with the sort of eagerness that people in happily-committed relationships always seemed to have about them when they saw their friends on the verge of pairing off as well.\n“I think so,” Harry said, the words sparking off a nervous flutter in the pit of his stomach. “Yeah, I think I am.”\n“Should Ron and I head off early?” Hermione asked. “I could make something up…”\n“No, you don’t need to do that,” Harry said. “I’m not going to say anything tonight. No, don’t give me that look, I can’t.”\nHermione arched her eyebrows at him at that, and Harry sighed.\n“I can’t,” he repeated. “Look, the bond’s not worn off completely yet. We’re stuck living together until then, and if he doesn’t feel the same then I don’t want to make things awkward.”\n“And after that you’ll still be training together, and after that you’ll be working in the same department…” Hermione went on.\n“That’s different and you know it,” Harry said.\n“I know,” Hermione said mildly. “I want to make sure you know it, too.”\nHe pulled a face at her, all scrunched-up nose and furrowed brow. “I do know. I’m not going to let it turn into a string of excuses. I just…” Harry blew out a slow breath and shrugged helplessly. “I think that no matter what happens, if he says yes or if he says no, being able to have a little space from each other won’t be such a bad thing.”\nThe corner of Hermione’s mouth quirked up in the smallest hint of a smirk. “That’s rather mature of you to say.”\nHarry shrugged. He’d seen what could happen when a couple let themselves get too close too fast, but Harry didn’t like to bring up Ron and Lavender’s relationship to Hermione. “Well, I’m in Auror training,” he said instead. “They’ve been pounding into our heads the importance of thinking before we act.”\n“Ron must have missed that lesson, then,” Hermione said dryly. “Just the other week he let George goad him into a contest about who could stand to eat the spiciest curry, and then he was up sick half the night.”\n“I heard George was sick, too,” Harry said. Ron had dragged himself into the Ministry the following morning still looking rather peaky, but knowing that George was just as miserable had seemed to cheer him immensely.\n“Yes, well,” Hermione huffed. “I didn’t have to listen to him complain about it all night.” She took a long sip of her drink, then nodded to the table. “Shall we?”\nHarry nodded and let her lead the way back.\n“Potter,” Malfoy said when Harry and Hermione returned to their table. “Thank goodness you’re back. That Muggle over there keeps making eyes at me.”\n“What?”\nMalfoy frowned. “Making eyes. You know.” He raised his eyebrows significantly.\n“He looks like he’s picturing Malfoy without his clothes on,” Ron put in, and Malfoy glowered at him.\n“For the last time, you are not helping,” he snapped, while Ron only looked more amused.\nHarry tried to glance around as subtly as he could manage, following the direction of Ron’s look. Sure enough, standing near the bar very close to where Harry had been standing with Hermione was a tall man with dark hair, his half-lidded gaze fixed very intently upon Malfoy. And Ron’s description had been accurate; he did indeed look like he was picturing Malfoy naked.\nFrom where the man was standing, Harry realized with a little jolt, he’d have seen it a few minutes ago when Malfoy had looked across the bar and his eyes met Harry’s. The man would have seen the sweet tilt of Malfoy’s smile and thought it was meant for him. Harry’s chest monster roared to life at the sight of this person, this stranger, looking at Malfoy like he had a claim to any part of him. Inwardly, Harry knew he was being irrational; Malfoy seemed more fed-up with the man’s attention than flattered by it, and even if he had been receptive, the Statute of Secrecy meant that he wouldn’t be able to show any trace of magic until the relationship became serious, and Malfoy was about as Wizarding as they came. He’d never consider a partner from whom he’d ever have to hide a major part of who he was. This stranger wasn't going to make Harry miss his chance with Malfoy.\nBut knowing all of that didn’t stop the hot swell of jealousy that ballooned through Harry until he nearly couldn't breathe.\n“Merlin, he’s just not giving up, is he?” Malfoy said, interrupting Harry’s thoughts.\nHarry glanced over his shoulder to where the man was still watching Malfoy. “No, apparently not.”\n“Are all Muggles unable to take a hint?”\n“No, most are a lot better than him. But there’s arseholes in every bunch,” he grumbled, taking another look over his shoulder. The man was still staring.\nMalfoy heaved a hugely put-upon sigh, then scooted his chair closer. “Put your arm around me,” he said. “Pretend to be my boyfriend.”\n“Erm,” said Harry, blinking.\nMalfoy frowned at him. “Unless you’d rather I put my arm around you.”\n“Erm,” said Harry again. “Whichever you think is best.”\nHe’d been touching Malfoy for three weeks now; he had no idea why the idea of putting his arm around Malfoy suddenly had his heartrate kicking up, had his stomach tying itself up in pleasantly painful knots.\n“Put your arm around me, then,” Malfoy said, angling his shoulders closer to Harry. “That arsehole’s still looking. It’s probably for the best if you look like the possessive one.”\nRon and Hermione were both watching him with varying levels of amusement. Harry bit back a sigh and put his arm around Malfoy’s shoulders.\nAs he’d feared, Malfoy was warm and solid beneath him his arm, and the rounded joint of his shoulder fit perfectly into Harry’s palm. Then Malfoy leaned into Harry’s side, and he put his hand on Harry’s leg just above his knee, and oh, this was terrible. This was terrible and wonderful all at once.\n“All right?” Malfoy asked.\n“Mmhm,” Harry managed. He could feel his cheeks going warm. He felt too warm all over, and he hoped that Malfoy wouldn’t be able to tell.\nAcross the table, Ron gave Hermione a look that read, Oh good Merlin is this really happening right now, you're seeing this too aren't you? plain as day. Hermione smiled and patted his arm, clearly telling him to just go with it. Malfoy, thankfully, seemed to have missed the nonverbal exchange entirely. Small mercies. \nWas the man still watching them? Maybe this small display of affection had been enough to dissuade him. Then Harry could let go of Malfoy and possibly escape to the toilet to splash some cold water on his face and regain his balance, and then when he returned to the table, they could go back to the innocuous foot-touching that they’d been using thus far to keep the bond satisfied. Harry started to check over his shoulder, but had barely begun to turn his head when Malfoy stopped him.\n“Don’t look at him,” Malfoy said, jamming his elbow into Harry’s ribs, and Harry gave his shoulder a sharp pinch in retaliation. Malfoy elbowed him again. “Stop that! Good Merlin, you are as subtle as a Bludger.”\n“I can tell you when he’s gone,” Hermione offered, and Harry sent her a glare because her innocent tone of voice didn’t fool him at all; he knew exactly what she was doing. “That way you won’t need to check.”\n“Thank you,” Malfoy said, leaning harder into Harry’s side. Then he looked over at Ron. “Now. As I was saying before about that International Wizarding Law lecture we had on Thursday…”\nHarry lost track of the conversation entirely as Malfoy’s thumb moved, stroking slowly up the inside of Harry’s knee, then back down, then up again. Harry’s breath caught, and he glanced over at Malfoy. But Malfoy was looking across the table at Ron, fully involved in their conversation, and gave no indication at all that he was aware what his thumb was doing.\nBut he had to be aware of it. Hadn’t he?\nSlowly, cautiously, and with his stomach flipping over between eager anticipation and sheer nerves, Harry moved his own thumb, rubbing gently against Malfoy shoulder, a small motion that he hoped might be interpreted as accidental. And then very nearly panicked when Malfoy pressed deliberately into the touch. A moment later, his fingers tightened around Harry’s knee before his thumb stroked again.\nMalfoy knew exactly what he was doing, that much was clear. But Harry had no idea. Was Malfoy fucking with him? Or flirting with him? Or… both?\nIt could very well be both; Malfoy was exactly the sort of arsehole who would do both at once. And what did it say about Harry that he sort of liked that about him?\nHarry gave Malfoy’s shoulder another gentle rub with his thumb, and was rewarded with another squeeze to his knee. Malfoy didn’t miss a beat in his conversation with Ron, carrying on as if cozying up to Harry like this was nothing out of the ordinary, and Harry let himself get swept away in a series of what-ifs. Was this what it would be like to date Malfoy? If they weren’t playing it up to fend off an unwanted admirer, would Malfoy still want to engage in this sort of affection in public? If this were something that Harry could have all the time, whenever he wanted, would it still spark this same flutter of excitement in the pit of his stomach? Would it still make his heart beat faster?\nIt was a while before Harry thought to check over his shoulder again, and when he did, he didn’t see any sign of the man who’d been eyeing up Malfoy. Harry looked right, then left, but couldn’t pick him out of the crowded bar.\n“Oh,” Harry said, letting his arm slip from around Malfoy’s shoulders. “I think he’s gone.”\n“Been gone for about twenty minutes,” Hermione confirmed, taking a sip of her drink.\nHarry stared at her, frowning. “You said you’d keep a lookout for us and let us know when he left.”\nHermione shrugged. “Oops,” she said, utterly unrepentant. Beside her, Ron rolled his eyes.\n“Yeah, thanks for that,” Harry muttered. Malfoy’s hand was still on his knee. Harry tried to keep as still as possible in case Malfoy didn’t realize he’d left it there.\n“Just as well that the coast is clear,” Malfoy said, glancing over at Harry. “We should probably head home.”\n“Oh, erm. Okay,” Harry said. This was much earlier than they’d headed out the last two times they’d gone out like this. Maybe Malfoy had plans in the morning he hadn’t mentioned and wanted to make an early night of it.\nMalfoy finally removed his hand from Harry’s leg, leaving it suddenly cold. Harry rubbed at the place where Malfoy’s palm had been pressed, trying to erase the feeling. He’d finished his own pint a few minutes ago, and Malfoy picked up his own glass to drain the last bit. Harry tried to not stare at the way Malfoy’s throat worked as he swallowed, and failed miserably.\n“All right there, Harry?” Ron asked, and if Harry thought he could get away with it, he would have kicked him for calling attention to Harry, because now Malfoy was watching him as well.\n“Fine,” Harry gritted out, pushing himself to his feet. He was still a little wobbly, and Malfoy reached out to steady him with a gentle hand to his elbow. “See you Monday. Goodnight, Hermione.”\nThey said goodbye to him and Malfoy, and then Malfoy led the way out of the bar.\nOutside, the sudden quiet of the street was as much of a shock as the cold night air. A few people stood clustered together under a streetlight, laughing and talking as they smoked, and Malfoy turned in the direction opposite them. Harry hurried to catch up.\n“Erm,” Harry said. “Didn’t you want to go back to the alley?” They’d Apparated into it when they came here; he couldn’t see any reason they shouldn’t be using it to Disapparate home.\n“I’d like to walk for a bit, actually,” Malfoy said, looking over at Harry. They were between streetlights, and Harry was momentarily entranced by the curve of Malfoy’s brow, the straight slope of his nose, the way his eyes looked dark and gentle in the soft, shadowy light of the dim street. “If that’s all right with you?”\n“Sure,” Harry said faintly, then gave himself a mental shake and said more firmly, “Yeah, that’s fine.”\nHe tucked his hands into his pockets and hunched down inside his jumper. He hadn’t dressed for the weather, assuming they’d Apparate straight here and then straight back home, and the short walk from the alley into the bar’s back door wouldn’t be enough time outside for him to really feel the cold. He checked over his shoulder to make sure that no Muggles were close enough to see before he took out his wand and cast. Harry sighed in pleasure as the Warming Charm took effect, slow waves of heat rippling through him before they settled around him like a warm cloak.\n“Would you mind?” Malfoy asked, looking expectantly at Harry.\n“You’ve got your own wand, you know,” Harry said, but he cast another spell around Malfoy.\n“Of course I do,” Malfoy said, smirking a little. “But this way I haven’t broken any laws. Magic in public around Muggles, Potter. For shame.”\nHarry snorted and rolled his eyes. “Going to report me then?”\n“And let another Auror have all the fun of arresting you?” Malfoy asked, quirking an eyebrow. “Hardly. And besides,” He nudged at Harry’s elbow with his own, “you’ve made me your accomplice now, haven’t you?”\nHarry laughed softly and nudged him back. “Alas, you’ve seen through my clever plan,” he said as they came to a stop at an intersection, waiting for the light to change.\nMalfoy looked at him, smiling gently amused. “Of course I have. You’re not so hard to read, you know.”\n“I’m not?” Harry asked, looking over at Malfoy, his amusement fading when he saw the way Malfoy was watching him intently.\n“No,” Malfoy said, his gaze dropping from Harry’s eyes down to his mouth. “You’re not.”\nThere’s a particular moment that comes right before a really good first kiss, like the eye of a storm, where the jittery nervousness had died down but the excitement hadn’t quite hit him yet. All of Harry’s thoughts quieted, the world around him dropped away, and all that was left was a deep sense of calm and the perfect certainty that this is going to happen.\nEvery time Harry had pictured it, he’d assumed their first kiss would be something impulsive, something desperate. The sort of kiss that happened in the movies. That they’d throw themselves into each other’s arms and get swept away by their passions. Harry had expected kissing Malfoy to be reckless and all-consuming, something that would burn him up from the inside out.\nIt wasn’t. The first touch of Malfoy’s lips to his was slow and careful, almost a question. His mouth was startlingly warm against Harry’s, and so soft. Something about the gentle way Malfoy kissed him lit Harry’s brain into a confused mess of want, tore him between the desire for more and the desire for it to go on forever exactly like this.\nMalfoy’s cold fingers were a shocking counterpoint to the heat of his mouth as he slid them around the back of Harry’s neck and up into his hair. His other hand slipped around the small of Harry’s back, urging him in close, and Harry went to him, his own arms going around Malfoy, his hands sliding up the warm expanse of his back. The Warming Charms Harry had cast on each of them fused in a small shimmer of magic, like two soap bubbles merging.\nThe kiss lingered on for another moment, then Malfoy gently eased away.\n“All right?” Malfoy asked, his fingers rubbing lightly against the nape of Harry’s neck. He was still close enough that his words brushed against Harry’s mouth.\n“Yeah, just…” Harry pulled him back in and kissed him again.\nMalfoy let Harry control the pace, his lips parting sweetly as Harry pressed in. His fingers tangled in Harry’s hair and tugged at it as Harry traced the curve of Malfoy’s lower lip with the tip of his tongue, and then Malfoy deepened the kiss in response and then they were snogging, properly snogging, and Harry’s brain spun dizzily at the first touch of Malfoy’s tongue to his, scarcely able to believe that this was really happening, he was kissing Draco Malfoy.\nHe held him tighter, kissed him deeper, and Malfoy made a soft sound of encouragement as he kissed him back.\nThere was a thrill to it, kissing Malfoy in public like this. Even right out in the open, Muggle London afforded them a sort of privacy that the Wizarding section never could. In this moment, Harry was just Harry, and Malfoy was just Draco, and they were just two people who fancied each other without the tangled weight of their past dogging them every step of the way. Malfoy wasn’t a Death Eater’s son still working to restore his tarnished reputation, and Harry wasn’t the Boy Who Lived, wasn’t anyone’s Savior, wasn’t anything more than a boy finally kissing the person he was halfway to being in love with.\nThe low rumble of a passing lorry roused Harry enough to move them away from the street. He broke the kiss just long enough for them to stumble over to the building on the corner, tripping over the step up into a deep, shadowy doorway. Harry hauled Malfoy around and pushed him hard against the glass door of the shop. It rattled in its frame, setting off a faint jingling of bells from inside, and then they were kissing again.\nMalfoy grabbed at Harry’s arse with both hands and dragged their hips together, rocking against Harry so that the beginnings of his erection rubbed over the line of Harry’s hardening cock, and oh, that was even better, so Harry rocked back against him as he moved, did it again, and again, until he was fully hard and so was Malfoy and maybe this should have been awkward, rutting up against each other on a public street, but Harry’s brain was so steeped in pleasure that even this was a thrill. The idea that anyone who happened to walk by could see them, could see what they were doing, only made him feel more desperate and, oh, here was the recklessness he’d expected.\nMalfoy broke the kiss suddenly, dropping his head to rest on Harry’s shoulders as he took Harry’s hips in his hands and pushed him gently back until there was space between them.\n“Merlin,” he breathed, turning his face to kiss at Harry’s neck.\n“What are you…?”\nMalfoy’s breath huffed warm against Harry’s neck as he laughed. “Sorry. I was about to come in my trousers.”\nHarry’s brain nearly shorted out. “Oh,” he managed, still reeling a little, because he’d nearly made Malfoy come in his trousers. Abruptly, Harry wished he were sober for this, but honestly he didn’t think that he’d really be able to handle this any better if he was.\n“It’s only the trousers part I object to, mind,” Malfoy said, nudging his hips lightly against Harry’s, sending another spark of pleasure skittering through him.\nAnd Harry was tempted, enormously tempted. There was nothing more he wanted in this moment than to take Malfoy up on his offer, to take his hands or his mouth or his arse or his cock, whatever Malfoy wanted to do to him or with him. And maybe if he’d had another pint in him, he would have. But Harry wasn’t quite drunk enough to override his common sense. He’d meant what he’d said to Hermione about wanting to take this slower.\n“I want to,” he said slowly, regretfully. “I really do—”\n“Right,” Malfoy said, pushing Harry farther back. He stepped out of the doorway and back onto the pavement. “That’s fine. I suppose we’d best be getting home, then, oughtn’t we?”\nThere was something sharp in his voice, tight and hurt and maybe a little angry, and Harry panicked.\n“Shit,” he said, jogging a few steps and catching Malfoy by the sleeve. “Malfoy, wait.”\nMalfoy didn’t say anything, but he did come to a stop.\n“I really do want to,” Harry said. “It’s not that I don’t want to. It’s just that I don’t think I’m ready to, not yet.”\n“Not yet?” Malfoy repeated, turning back.\nHarry shook his head, then leaned in for another kiss, and could feel Malfoy’s relief in the way he practically melted against Harry.\n“I do like doing this, though. I’d be glad to keep doing this,” he said.\n“Thank Merlin,” Malfoy breathed before he kissed him again. “I thought you didn't want...”\nHe didn't bother to finish his sentence before he kissed Harry again, Harry didn’t know how much time passed after that, but they ended up back in the doorway, and then at some point later, Harry’s Warming Charms had worn off, leaving them both shivering.\nMalfoy pushed Harry gently back again. “Ready to go home?” he asked.\nA little flicker of excitement went through Harry at that. “Yeah,” he said, grinning. “I’m ready to go home.”\nThey took a few minutes to compose themselves, the cold night air helping Harry’s erection to fade a little before Malfoy Side-Alonged him back to his flat. Malfoy didn’t step back immediately, but leaned in again, slowly, and brushed a final chaste kiss against Harry’s mouth.\nHarry caught Malfoy’s wrist in his hand, thumb rubbing gently over his pulse as he looked down at the fading mark, as a terrible thought occurred to him. And he knew it wasn’t true, because Malfoy had said that wasn’t how the bond worked. But he had to ask.\n“Malfoy. Is this…?” Harry began, trailing off. He needed to know this, knew that it’d keep gnawing at him if he didn’t speak up, but a small part of him was still afraid to ask.\n“What?”\n“This is… I mean, what just happened. That was us, right?”\nMalfoy huffed a small sound of amusement, tugged his wrist free of Harry’s grasp and gently pulled Harry’s arm, settling it around himself. “I don’t see anyone else here, do you?”\n“Shut up,” Harry said, shoving at him with his whole body. He should let go, step back and put some space between them. But he didn’t want to. “I mean, it wasn’t the bond that made us do that?”\n“Oh,” Malfoy said, his expression turning serious. “You mean, you’re afraid that I didn’t mean that. Potter.” He leaned in and pressed a kiss to Harry’s mouth, warm and lingering. “I meant that. And I mean for it to keep happening, if you’re amenable. Not because of the bond, and not because I’m a little bit drunk right now.”\nThat hadn’t even occurred to Harry, despite still being a little bit drunk himself. “Oh,” he said.\nMalfoy frowned a little at that. “We can talk about this again in the morning, if you’d like. Or after next week. I promise you I’ll feel exactly the same as I do right now.”\nHarry nodded, smiling. “Yeah, that sounds good.”\n“Good, then. Well. Do you mind if I go first?” Malfoy asked, gesturing toward the bathroom.\n“Oh, no. Go on,” Harry said.\nHe waited an agonizing two minutes, trying not to listen to the soft rustle of Malfoy pulling off his shirt, the faint jingling of his belt buckle, the soft whumph of his trousers hitting the floor. Then the shower started up and Harry had his cock out and in hand in about five seconds flat.\nHe thought he probably ought to feel awkward about having a wank in the middle of Malfoy’s sitting room, but he’d been on edge for ages, and his desperation to come obliterated most of his sense of decorum. It only took about a dozen strokes before he was back on the edge of it. Harry squeezed himself firmly, biting down hard on his bottom lip to stifle a groan as he came, spattering come all over Malfoy’s glossy floor.\nA giddy rush swept through him at that, seeing the white droplets against the dark wood. Several had landed perilously close to the rug. Well. Start as he meant to go on indeed.\nA flick of his wand took care of the mess, and he was perfectly composed and waiting patiently when Malfoy came out of the bathroom, dressed in blue and green plaid pajama bottoms and a soft white shirt. His pale skin was still flushed pink from the warmth of the shower, and he had his damp hair swept back from his face.\n“All yours,” Malfoy said.\n“Thanks,” Harry told him as he passed by, sneaking another kiss from Malfoy before he ducked into the bathroom. He hurried through his own shower, brushed his teeth and washed his face, and then hesitated before he opened the door.\nTonight, the prospect of climbing into bed with Malfoy felt like the first time all over again. Because even though he’d already done this a dozen times before, it suddenly felt so much more significant.\nHarry took a breath and opened the door, and he hurried across the bedroom and slipped under the duvet before he could lose his nerve. Malfoy was already tucked under the covers, curled up on his side of the bed with his back to Harry, his hair gleaming gold in the warm light from the dragon lamp. Tonight, rather than turning over and putting his own back to Malfoy’s, Harry scooted close and spooned up behind him. Malfoy hummed quietly and shifted a little, getting comfortable against him. A flick of his wand turned out the lights.\n“Good night, Potter,” Malfoy said from the darkness.\nHarry pressed his smile against the back of Malfoy’s neck. “Good night.”\nAnd he was so full of sheer happiness to be holding Malfoy in his arms like this that he didn’t even get upset a moment later when Malfoy pressed his cold feet against Harry’s shins.\n- - -x- - -\n\nOne year later…\n\nTheir second year of Auror training was even more gruelling than the first, with longer hours and heavier workloads, but Harry and Malfoy still managed to scrape together enough energy to plan a romantic night in for their one year anniversary. Which wasn’t all that much different from every other night they spent together—they both seemed to exist in a state of permanent exhaustion these days—but Malfoy brought Harry roses, and Harry lit some candles when they sat down to dinner that night, and they had plans for some pretty spectacular sex later.\nHarry was especially looking forward to that part. It’d been at least a few weeks since they’d attempted anything more energetic than half-asleep morning handjobs, and Harry couldn’t wait to have a go at Malfoy’s arse. Or for Malfoy have a go at his. Harry knew he’d get a fantastic orgasm out of it either way, so he’d probably let Malfoy choose; he usually had a stronger preference than Harry did about whether he felt like topping or bottoming at any given moment.\nBut rather than take him straight to the bedroom after dinner, Malfoy detoured into the sitting room.\n“Don’t worry,” he said when he saw the look on Harry’s face. “This’ll only take a minute.”\nBending over, he groped beneath the sofa until he came up with a flat gift wrapped in silver paper.\n“Here,” he said, holding it out to Harry.\n“Malfoy,” Harry said, exasperated, as he took it. “I thought we said no gifts.”\nMalfoy shrugged. “I didn’t spend money on it.”\n“That wasn’t the point,” Harry said, flipping it over in his hands and peeling up the Spell-o tape. The point had been that they were both so busy with work that they’d agreed not to add another thing to their to-do lists. Harry should have known better than to take Malfoy at his word on it.\n“It's fine. I barely even went out of my way for it,” Malfoy said. “Go on, open it.”\n“I am, I am” Harry grumbled, pulling the paper off it, and found himself looking at the back of a picture frame.\nBut when he flipped it over, he saw that it wasn’t a picture frame; it was a shadow box. And carefully pinned to the plush blue velvet interior was a very familiar handfasting cord.\nHarry blinked down at it, then back up at Malfoy who by now looked exceedingly smug.\n“Is this the same one?”\n“The very same,” Malfoy said, and looked impossibly smugger.\n“How on earth did you…” Harry began, and trailed off when it belatedly clicked what Malfoy had meant when he’d said that he’d barely gone out of his way to get it. “Oh no. Oh my god. You stole this, didn’t you?”\nMalfoy shrugged again, careless. “It’s been sitting in Evidence for a whole year at this point. I highly doubt anyone’s going to notice it’s gone. Or care even if they did.”\n“You’re such an arsehole,” Harry said, and by now he was laughing, half in disbelief, half at Malfoy’s sheer fucking nerve. “I can’t believe you stole this. If I were any sort of Auror, I’d arrest you for it right now.”\n“It’d put a bit of a damper on our night, don’t you think?” Malfoy pointed out, then smirked. “Or perhaps not. I can think of several things I’d like to do that involve you and a good Incarcerous.”\n“You arsehole,” Harry said again, and tossed the shadow box aside onto the sofa. “I can’t believe you. Get over here and kiss me now.”\nStill smirking, Malfoy obliged.\nLater, when they lay curled together warm and snug beneath the duvet, Harry nudged Malfoy.\n“So, that cord…” he said. “Did you get it just for our anniversary?”\n“Mm,” Malfoy hummed, nuzzling at Harry’s shoulder. “Why else would I have taken it?”\nHarry took a slow breath. “To use? Erm, for real this time, I mean.” Malfoy was quiet, and Harry rambled on. “Not yet, of course. I mean, I know you wouldn’t mean for us to, not right now, erm, even if you did mean, which I’m not assuming you…” He trailed off when he felt Malfoy trembling against him, and it took him a second to work out that Malfoy was laughing silently. “Oh, fuck off,” he grumbled, jamming an elbow into Malfoy's side.\nMalfoy gave up on laughing quietly at that point, and even through his embarrassment, the sound of his laugh lit something warm and fluttery in the pit of Harry’s stomach.\n“You’re still an arsehole,” he said.\n“But you love me,” Malfoy said, shifting up a bit to kiss at Harry’s neck.\n“Yeah, yeah,” Harry said, grumbling a bit but unable to keep the fondness out of his voice entirely.\nThat fondness lasted all of five seconds, until Malfoy shifted around again so he could tuck his cold feet under Harry’s calf. Harry sucked in a hissing breath and went rigid, gritting his teeth through the shock of it. Groping under his pillow, he curled his fingers around his wand and aimed a Warming Charm downward to counteract Malfoy’s toes. Malfoy turned his head to press a kiss against Harry’s shoulder as warmth bloomed around them.\n“I did think about asking you,” Malfoy said after a minute.\n“You did?”\n“Mmhm.” Malfoy pulled Harry closer, holding him tight for a moment before relaxing against him again. “Of course I did. But I didn’t think it was the right time yet. We’re both so busy right now, and it’s only been a year.”\nHarry took a breath and said, as calmly as he could manage, “That’s very true.” He hoped Malfoy couldn’t hear the way his heart was thundering.\n“Mmhm,” Malfoy said again. “But I thought it would be nice to have the option. You know, for later. If we wanted to.”\n“Yeah,” Harry said, already thinking ahead to when they finished training next year. His hand found Draco’s beneath the duvet, his chilly fingers already warming.\nNext year wasn’t so far away. That'd be plenty of time for Harry to plan."
}