{
    "id": "858763",
    "url": "https://archiveofourown.org/works/858763?view_full_work=true",
    "author": [
        "Ketita"
    ],
    "title": "Playing Favorites",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "Underage"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Shingeki no Kyojin | Attack on Titan"
    ],
    "relationships": [
        "Eren Jaeger/Levi"
    ],
    "characters": [
        "Eren Jaeger",
        "Levi (Shingeki no Kyojin)",
        "Mikasa Ackerman",
        "Hanji Zoe",
        "Jean Kirschstein",
        "Connie Springer",
        "Armin Arlert",
        "Sasha Blause"
    ],
    "additional_tags": [
        "Humor",
        "Fluff"
    ],
    "language": "English",
    "series": "",
    "published": "2013-06-26",
    "completed": null,
    "words": "6,297",
    "chapters": "1/1",
    "comments": "324",
    "kudos": "20,758",
    "bookmarks": "3,453",
    "hits": "212,625",
    "summary": "<p>In which Levi seems determined to spoil Eren rotten, whether he likes it or not.<br>(For the record, Eren hadn't expected his confession to lead to this sort of thing at all).</p>",
    "notes": "<p>Fill for the <a href=\"http://snkkink.dreamwidth.org/524.html?thread=350732#cmt350732\" rel=\"nofollow\">favoritism</a> request on the snk kink meme; got a bit out of hand.</p>\n<p>Slight manga spoilers for when Eren is with the Recon Corps.</p>\n<p><a href=\"http://ficbook.net/readfic/1478181\" rel=\"nofollow\">A lovely translation into Russian</a> is now also available, thanks to the wonderful Kjetel :)</p>\n<p> </p>\n<p> <a href=\"https://www.fanfiction.net/s/10778751/1/Playing-Favorites\" rel=\"nofollow\">Playing Favorites in French!</a></p>\n<p> </p>\n<p><a href=\"http://www.pixiv.net/novel/show.php?id=4684138\" rel=\"nofollow\">Playing Favorite‐偏愛‐</a> Japanese translation.</p>",
    "text": "Eren had tried to hint, in various ways, but he honestly wasn't quite sure what was the proper method to express interest in his superior officer. Mikasa might have an idea, but when asked, she had said that the best way to show affection was to corner the victim, immobilize them, and kiss them. Eren had the feeling that that would end very badly if he tried it with Captain Levi, so he thanked her and returned to his normal modus operandi of following the captain with his eyes and sighing occasionally. And doing his laundry. And carrying stuff for him. \nConnie's suggestion of just confess and get it over with – wait, who do you like? It's Mikasa, isn't it? When will you do it? Can I watch? had more merit, though Eren figured it would probably end with him getting beaten up. Still, at least he'd know, right? \nHe spent probably fifteen minutes fidgeting outside the captain's door, trying to work up the courage, when – \n\"I know you're out there, Eren, are you planning on standing there all day?\"\nAt which point he really had no choice but to enter. Captain Levi glowered at him, but then he mostly glowered at everybody, and Eren liked to think there was something fond about the expression when directed towards him. Maybe.\n\"What is it?\"\nEren gulped. He decided to stay close to the door. There was a (very slight) chance of escape if things got violent, that way. \n\"Sir, I–\"\nThe captain was tapping his pen on the table.\n\"I just wanted to tell you–\" tap tap taptaptap \"-I like you. Captain Levi sir.\"\nThe tapping stopped. Eren tried to breathe. \n\"I suppose you mean romantically.\"\nEren felt his ears heat up. \"Y-yes sir.\"\n\"And have you exhausted all potential liaisons among your peer group before feeling the need to come to me?\"\n\"No, sir?\" Eren's brain tried to make sense of the sentence. \"I like you, why would I want to be with them?\"\nLevi was frowning now, and Eren really had no idea what the issue was. Deciding between beating Eren up and not beating him up for his presumption shouldn't be that difficult. \n\"Why me?\"\nHad he known this was going to be so difficult, Eren might have reconsidered the confession idea. He felt like his face would never regain its normal color at this rate. Well, yeah, he could say that Levi was ridiculously strong but also pretty, and that it made Eren get a fluttery feeling in his stomach whenever the captain paid attention to him, and that his height made him look absolutely perfect for hugging and maybe sometimes he fantasized about kissing him – but he valued his life.\n\"W-well, you're…\" he stammered. He could leave, he thought wildly. The door was behind him. He should run for it while he still could. \"I just…\"\nLevi sighed, and was now looking at Eren with an expression he had no idea how to interpret, but it didn't look murderous so that was a good start.\n\"I understand.\"\nIt was nice that someone understood, because Eren sure didn't. He watched Levi pick up his pen again, and turn back to his papers. \n\"You can go, now.\"\nEren found himself in the corridor, his mind still swimming with confusion. Had he been rejected? It looked like it, but he really couldn't be sure. With a last, slightly dejected look at the closed door, he wandered off. \n---\nHe was sitting with his ex-squadmates for dinner when the Captain came up behind him and tossed something onto the table. Eren jumped, and stared at the round orange ball. \n\"What…?\"\n\"Eat it, dumbass,\" said Levi flatly. \n\"It's food?\" He had never seen anything like it in his life.\n\"It's an orange,\" Sasha said, drooling visibly. \"I had one years ago, they're amazing…! You peel it and eat the inside – you will share, won't you, Eren?\"\nLevi slammed a knife into the table, making her snatch back her questing fingers.\n\"When I want to give you an orange, little girl, I will give you one. This is for Eren. Now eat the damn orange, or do I have to feed you as well?\"\n\"No, sir!\" he managed. Actually, if not for Sasha's endorsement he would have thought this some attempt to poison him. He dug his fingernails into the peel, and tried to tear it off. All the while he could feel the captain's eyes on the back of his neck, as well as the curious looks of his teammates. His fingers roughened with little orange bits, and he managed to squirt juice into his eyes, but eventually got a piece free. Seriously, why was everybody watching him? No way he was that interesting.\nThe first bite proved Sasha right. Tangy sweetness burst over his tongue, and he couldn't resist a small \"mmph!\" of pleasure. Sasha whimpered. He quickly peeled off another slice and stuffed it into his mouth, to the obvious envy of everybody else.\n\"Good?\" Levi asked, his tone making it quite clear what answer he expected to receive.\n\"Yes, sir!\"\n\"Finish it. Alone. And clean yourself up, you're an embarrassment.\"\nThe captain stalked off, leaving Eren to deal with his friends' stares.\n\"What was that about?\" Jean asked.\n\"I'm not sure,\" Eren said, but felt his stomach turn over with excitement. Maybe… could it be that the Captain did like him? He had given him this 'orange', after all (which was really good!). Eren ate another piece and stared after him, unaware of the silly smile on his face. \n---\nEren in the morning was never the most alert. True, years of training had made him perfect the ability to pretend to be awake and aware, but the reality was that he had spent most of the time on a severe sleep deficit. So really, he hadn't been particularly awake at any given moment at all. Nowadays the schedule was much more lenient, but it still took him some time in the mornings to really wake up.\nHe found himself in the bathroom, yawning, wondering sleepily why everybody was just milling around blocking the way to the sinks. For that matter, what were Reiner and Bertholdt doing in this bathroom? Wasn't there one on their floor?\n\"What's the big holdup?\" he asked. \"And what's everybody doing here?\"\nArmin turned towards him.\n\"It's clean,\" he said.\n\"It's what?\" Eren woke up all the way at the unexpected words, and looked around him. Honestly, he wasn't such a stickler for cleanliness. Years of sharing barracks with a bunch of other guys had certainly lowered whatever standards had survived the fall of Shiganshina. But even he couldn't miss the fact that this bathroom positively sparkled. Why, he could probably walk barefoot without having to worry about catching horrible diseases. The normal smell of day-old urine was replaced by freshness, and the spotless mirrors showed their reflections, probably for the first time since they had been hung. Eren joined the other boys in surveying the wonders around them, all thought of cleaning up forgotten.\n\"How did this happen?\" Reiner said, from somewhere behind him.\n\"Well,\" Armin mused. \"There's only one person here who bothers cleaning, and that's Captain Levi. But why would he…?\"\nEren suddenly became aware that everybody was looking at him speculatively. \"What?\" Even Armin. \"What? I don't have anything to do with this!\"\nReiner clapped him on the shoulder, making him jump. \"Sure you don't,\" he said, with a knowing smile. \nThey thought that the Captain had cleaned the bathroom for him? Actually, now that he considered it, it seemed rather plausible, in a weird way. And the hordes of boys showing up was a sign that none of the other bathrooms had been – \"Mikasa? What are you doing here? This is the boys' bathroom!\" \nMikasa strolled in unperturbed, followed by Ymir. \"We heard there was a clean bathroom,\" she said, and pushed her way to the sink. Thankfully, Eren managed to stifle the part of him that wanted to protest but it's my clean bathroom. \nIt was a free-for-all from that moment on. Eren managed to get his teeth brushed and face washed, and couldn't help but notice that the mirrors were no longer pristine, and there were puddles all over the floor. The place was emptying out, and Eren knew he should get going, but… if they were right, and the captain had cleaned the bathroom for him… how could he leave it a mess? Wasn't that kind of ungrateful? \nWith a sigh, he went to find a mop. \n---\nHe was no longer taken completely by surprise when the captain came stalking over at dinner. He also didn't miss the way everybody else got expectant looks on their faces. This time, a bowl of what his nose confirmed to be chocolate pudding was plonked down on the table in front of him. He hadn't had chocolate in ages, and needed no encouragement to dig in.\n\"So unfair,\" Sasha moaned. \n\"How did you get chocolate pudding?\" he couldn't help but ask around a delicious mouthful, only belatedly remembering to tack on 'sir' at the end. \n\"Don't talk with your mouth full,\" Levi snapped. \"I made it from leftover titan parts. I hope you like it.\"\nEren choked. The captain had just made a joke. The sky must be falling. \nWith the spoon, he scraped up as much as he could, then looked mournfully at the bits he couldn't catch. If he just used his finger –\nLevi snatched the bowl away from him before he could do more than twitch. \n\"No,\" he said. \nWell, it had been a nice thought. He licked his lips, the taste of the chocolate still fresh, and couldn't help a smile. The captain scowled and threw a napkin at him.\n\"Somewhere, there exists a food that even as inept an eater as you will manage to consume with some measure of decorum,\" said Levi sadly, before walking off. Eren watched him go, maneuvering gracefully between the tables. He looked as good walking across a room as he did swinging through the air on his 3D gear. \n\"You're banging him, aren't you.\" Jean's voice brought Eren back to the present with a jolt.\n\"I'm not,\" he protested immediately, and wondered if the heat in his ears was visible. \n\"That does make sense,\" Armin said from the other side, and Eren was a bit horrified to see how everybody was nodding along, with varied expressions. Some of the girls looked weirdly interested, which was almost scarier than the dark look on Mikasa's face. A few people looked jealous (Connie? Really?). \n\"Seriously, I'm not,\" he repeated, and tried to keep his voice from tilting towards mournful. That was the problem, he wasn't sleeping with the captain, so what was going on? Was this some kind of test? Because if getting any depended on him matching the captain's standards of cleanliness, he might as well just give up.\n\"Why didn't I think of that?\" Sasha wailed. \"Think I can get any of the others? Who has the most access to food?\"\n\"Commander Pixis,\" said Mikasa.\n---\nEven though he was permitted to see his friends, Eren wasn't allowed to spend much time with the other members of the 104th. Most of his daily contact was with the people in Levi's squad, who were basically tolerant of him. They didn't go out of their way to be friendly, but neither did they treat him badly. Lacking entertainment, Eren spent his time training with the 3D gear. He might be able to turn into a titan, but he didn't want to rely on that ability more than he had to. Besides, it was something to do.\nToday, on the way to the courtyard, he passed by Petra and Erd, who both paused in their conversation to give him suspicious looks. Eren looked away, blushing, and hurried on. They must have heard the rumors (or just seen the captain's really obvious behavior). He wasn't doing anything wrong he told himself. He wasn't actually doing anything at all, because the captain was too busy feeding him for anything to happen between them. \nThe thought made him drag his feet a bit. Maybe after his practice he would go search the captain out, and see if he could carry something for him. Or even just sit together for a bit.\nHe practiced climbing up the walls, dropping and catching himself on the way down. During the repetitive swing and jerk, he found his mind wandering again towards Levi. Levi could do amazing stuff with 3D gear. The way he would whirl, flying through the air with seemingly no support at all. Eren gave an experimental twist, trying to mimic the captain's movements, and went careening uncontrollably towards a wall. He had a split second to brace himself for impact when something hit him sideways, pushing him away from the rapidly nearing stones. He yelped as his entire body jerked then came to a halt in midair, an arm clamped firmly around his midriff.\n\"What the hell were you doing, you stupid brat? Are you so bored you decided to see how long it takes your brain to regenerate?\"\nEren found his breath. \"I-\"\nLevi let go, tossing him to the ground in a heap.\n\"No time at all,\" the captain said, \"because you don't have one.\" He dropped down beside Eren, landing gracefully. Eren picked himself up, wincing at the bruises, though they would probably fade quickly. \nLevi had probably seen the whole pathetic attempt. Eren blushed in embarrassment. He hadn't taken a fall like that since he first tried the 3D gear simulator with his faulty belt. A tirade was surely coming; he could feel it in the air. Why had Levi had to walk by right now? He'd much rather have hit the wall and dealt with the consequences.\n\"You were going about it all wrong,\" Levi said. \"You don't just throw yourself around and hope for the best. You need total control, over the wires and over yourself. But it's a good skill to learn. Saves gas, too.\"\nEren stared, mouth dropping open. \n\"Come on,\" Levi said, and leapt up the wall. It was all Eren could do to scramble after him, hardly believing his good fortune. \nTrue, his failure to learn it immediately resulted in Levi calling him every insulting name under the sun and then some, but Eren didn't care. He was getting private lessons from humanity's strongest.\nActually, he thought, when he landed after executing a near-perfect maneuver and was rewarded with something approaching a smile, he was getting private lessons from Levi. And that was worth more. He grinned back, and Levi's face wiped clear of expression. He landed next to Eren, refusing to meet his eyes, and when he spoke, his voice was rougher and louder than usual. \n\"I'm not babysitting you all day,\" he said. \"You can go back to banging your head against the wall now.\" He stalked off, looking like he was trying not to hurry. \nEren chased after him, and managed to snag his arm. Levi jerked around, visibly startled, and Eren knew he had less than a second before a punch landed.\n\"Thanks,\" he said breathlessly. \"I just wanted to say thanks for showing me.\"\nThe blow never came. Levi looked a bit nonplussed, but he hadn't pulled his arm out of Eren's grasp yet. There was a question in his eyes, and Eren found his heart beating its way into his throat. Something was going to happen, he just knew it, any second-\n\"Eren!\" Hanji's voice came out of nowhere, and he jumped. Levi took that moment to yank his arm out of Eren's grasp and flee. A pathetic call of 'wait…' died on his lips, because Hanji was bearing down on him purposefully.\n\"I need to talk to you,\" she said. Eren tore his eyes away from Levi's retreating back with a sigh, and followed her. Up the stairs and towards her office, and she was probably going to do some testing on his titan form or something. Great. \nHanji closed the door behind him, then whirled on him, her expression uncharacteristically serious.\n\"Eren. I've seen what's going on. It's kind of hard to miss, actually.\"\nEren shifted his weight from foot to foot, worried about where this was going.\n\"I wanted to make sure you know what you're doing, and that you're being careful.\"\n\"The captain wouldn't hurt me, sir!\" He protested before the words had barely left her mouth. \"I mean, the bruises don't count, not really…\"\n\"Pfft, of course he's not going to hurt you,\" Hanji scoffed. \"Look how much he likes you! But that's why I have to know where you stand.\"\n\"He likes me?\" Eren lit up at the prospect, but that second half of the sentence – \"I don't understand.\"\nBehind her glasses, Hanji's eyes flashed threateningly. \n\"What are your intentions towards the captain?\"\n\"What?\"\n\"Levi's heart is like a delicate flower! I won't let you toy with him!\"\nWait, seriously, what the hell. \"I'm not-\"\n\"You have no idea how fragile our Levi is! I won't let him be misled by some scheming little-\"\n\"I swear, I don't know what-\"\nHanji pounced. Eren had managed to forget that beneath her goofy exterior was a skilled member of the Recon Corps; the crack of his head against the floor when she threw him was a sharp reminder. He found himself pinned by the wrists, Hanji looming over him.\n\"Our Levi,\" she hissed, \"is like a kitten. Innocent and sweet. If you break his heart, I will cut out yours.\"\nThere was absolutely nothing to do against such blind insanity but agree. \"Yes sir!\" Eren managed. It was the same thing with the titans, he thought. The more dangerous it was, the cuter Hanji found it. Apparently. \"No breaking hearts, sir!\"\n\"Lovely!\" Before he could blink, Hanji was halfway across the room, leaning nonchalantly against her desk, all smiles. Eren got his feet under him unsteadily.\n\"I'll just go and… shine his shoes,\" he said, backing away towards the door.\n\"Great idea.\"\nKeeping his movements slow and smooth, he inched backwards, pulled open the door, and slipped out. \nAnd nearly had a heart attack when he came face to face with Levi. For once, the dark look on his face wasn't aimed at him – he didn't look like he was even seeing Eren. Eren slid out of the way, letting him into the office. The door clicked shut.\nEren escaped as fast as he could, the sounds of violent battle echoing down the corridors behind him. \n---\n\"So what do you think it's going to be this time?\" Connie asked. \"Cake?\"\n\"Cake leaves crumbs,\" said Armin. \"The captain doesn't like messes.\"\n\"Cookies, then,\" said Connie. \"Little ones you can eat in one bite.\"\n\"You're vicariously living through Eren's food, aren't you?\" Jean accused. \"Maybe juice of some sort.\"\n\"Eren might spill it,\" said Mikasa.\n\"Quit it, guys,\" Eren mumbled. At this rate he was going to be too self-conscious to eat anything at all. Of course, he was ignored, as everybody else chimed in with their ideas.\n\"Fancy bread?\"\n\"Chocolate covered nuts.\"\n\"Ice cream.\"\n\"Lychee!\"\nSasha's outburst was followed by a momentary silence.\n\"You made that up, didn't you,\" said Connie.\nEren sighed, and tried to tune them out. Once again, he found his eyes drawn to the captain's table, where Levi was sitting with the rest of his squadmates. He was deep in conversation with Auruo (or maybe that was Auruo having a conversation, with Levi making agreeing sounds sometimes). Not once during the entire meal had he made so much as a move towards Eren's table. What if the captain was angry at him because of what happened earlier? His stomach shifted uncomfortably.\n\"Doesn't look like you're getting anything,\" said Reiner. \n\"Maybe he's a lousy lay,\" Jean opined.\n\"Shut up,\" Eren snapped, and would have gone for blows if not for the consequences. But maybe Jean was right, some part of him thought. Maybe the captain was expecting something in return, which Eren hadn't yet given him. As if drawn by a magnet, his eyes found Levi's form yet again. Suddenly, Levi's eyes snapped to meet his own, making Eren's heart leap painfully. Levi stood up abruptly, knocking his chair to the floor with a clatter.\n\"Enough with the puppy eyes already!\" he bellowed. \"Do you think I'm a fucking icebox? How much food do you think I have stored away in this goddamned fortress in the middle of nowhere!? Could you pause to engage your brain before making pathetic faces at me? You're not going to starve!\"\nChuckles broke out across the room, quickly stifled by Levi's glare. He straightened his chair, and wiped it off before sitting primly back down and resuming his conversation.\nEmbarrassed beyond belief, Eren slid down in his seat, but couldn't help the way his heart was thumping. After all, Levi had noticed him. Levi had thought of him. \n--- \nThe lower levels were empty. He was no longer supervised when going to bed, and wasn't locked in, as long as he showed himself going to his room obediently. Upon entering the small stone cell, his eyes were drawn immediately to the bed. \nWhere his old, lumpy pillow had been, a pristine fluffy one now lay. Eren went over and picked it up, marveling at the weight of the down filling. Gingerly, he lay down. His head sank into softness, and the smell of clean laundry surrounded him. Heaven.\nHe dozed for a while, and woke up in darkness; his candle had burned down. He stared up into the blackness where the ceiling was, thoughts running circles through his mind. He needed to talk to the captain. \nBefore he could lose his nerve, he was up and padding out of his cell. He walked quietly, alert for any guards, but nobody seemed to be around. His luck held all the way to Levi's room. Outside the door, he paced furiously (and silently) for a whole minute, before gathering up the courage to enter. Holding his breath, he eased the door open, mindful of squeaky hinges. Unsurprisingly, they were in perfect condition; this was the captain's room, after all. Crossing a floor which felt fifty metres longer than its actual length, Eren held his breath, ready to be attacked at any moment.\nBut nothing happened, and the sleeping figure on the bed didn't move even when Eren was standing directly over him. Slivers of pale moonlight from the window cut the darkness, enough to make Levi's strong profile visible. In sleep, he seemed calm, and maybe Eren could kinda-sorta see that innocent kitten thing Hanji had been talking about. Only not, because it was crazy talk. \nWell, he hadn't come all this way to just stand and look at him, even if he was really nice to look at. Eren took the last step towards the bed, and put his knee on the mattress. It was quite a bit thicker than his own, and sank under him.\n\"What are you doing, Eren?\" His voice was quiet, but completely calm, as if his subordinate hadn't just sneaked into his room in the middle of the night. \nMoments like this, Levi was always calm. Just like when Eren had turned titan to pick up the spoon, and everybody had freaked out – except Levi, who stood with Eren at his back, and told the others they were overreacting. Levi wasn't afraid of him.\nEren climbed up onto the bed and swung his other leg over, so he was straddling the captain. Levi rolled over onto his back and looked up at him with the same neutral expression he always wore. His hair was mussed, flopping back against the pillow, and Eren wanted to run his hands through it. Even in the dark, Eren could see that his eyes were alert.\n\"What do you think I'm doing?\" Eren seemed incapable of raising his voice above a whisper. \nLevi sighed. \"If it's about dinner, I'm sorry. I really didn't have anything for you. I'll find you something for tomorrow. You don't have to do this, Eren.\"\nEren's head was spinning, his breath coming heavily. The captain was apologizing? The captain was calling him by his name? Had he fallen into a parallel universe somewhere between his room and here? Was he dreaming? \n\"I know you're lonely, Eren,\" Levi continued, in the same weirdly gentle voice. \"Your friends are afraid of you. Nobody here trusts you. Even I'm supposed to be ready for the moment you go crazy and have to be put down. If my reputation is helping you manage, I'll keep doing it. You don't have to sleep with me to get my protection. You always had it.\"\nEren sat back on Levi's thighs, his hands coming to rest on Levi's chest, then fisting in his shirt. He was shaking all over, and didn't even know why. \nIt wasn't true – it wasn't some kind of pathetic cry for help, he wasn't that lonely – but oh, people had started paying attention to him once Levi did. It was hard to be afraid of somebody that was getting gifts of food from Humanity's Strongest and making a mess of himself. Levi's squad was warming to him, seeing him as more than a potential instant titan. He was becoming normal. \n\"That's not,\" he started, swallowed, and began again. \"I wasn't thinking that. I wasn't trying to get stuff out of you. I just. I like you. I want you to look at me. I want you to see me, not as some stupid kid, I want you to see me as–\"\n\"An adult?\"\n\"As myself.\" Eren took a breath. \"If you don't like me, then tell me. And I'll go. I won't bother you again.\" It was difficult to get the words out. \nLevi was quiet for a long time after that, to the point where Eren started wondering frantically if he had fallen asleep, because seriously, Levi was totally capable of doing something like that -\nHe spoke again, to Eren's profound relief. \n\"I'm quite a bit older than you.\" That small admission was like a breath of fresh air. Levi was actually considering it. \n\"If we're all killed by titans, what does that matter? Can't we just be happy for now?\"\nEren realized that Levi's hands were resting on the sides of his legs, heat radiating outwards from them. Had Levi noticed? He wasn't sure, but he really wanted those hands to do something. \n\"Happiness,\" Levi said softly, making Eren want to drive the sadness from his voice.\nHe sighed, and the movement rippled across his torso and up through Eren. Then his hands were moving, up Eren's sides, coaxing him to lean forward, tugging him gently back down. Eren found himself leaning on his elbows, his face centimeters away from Levi's. It was too dark to see the details of his face, but Eren's mind filled them in. He was drowning in Levi's breath warm on his lips, and this was it, he had won, Levi wanted him –\nLevi was murmuring something which Eren was far too distracted to pay attention to. He could feel Levi's solid muscles all along his body, and he smelled clean but just a little bit musky, and one of his hands was kneading at the back of Eren's neck, tugging on his hair just a bit in a way that made Eren want to arch into him -\n\"I said, did you brush your teeth?\"\n\"I, I think so?\" Eren stammered, and nearly panicked at the completely flat look on Levi's face. \n\"Next time, come ready,\" Levi growled, and pushed Eren's face away. \nEren felt his heart break. No kiss. This world truly was cruel. \nHis expression must have reflected his desolation, because Levi sighed in resignation, fisted his hand in the front of Eren's shirt, and pulled him close again. \n\"Mouth shut,\" he murmured, and pressed his lips briefly to Eren's. They were softer than he had expected, and Eren knew this moment was going to haunt him until he got a proper kiss from the captain. They pulled apart, and Levi yawned, suddenly losing his focus.\n\"Get to sleep, dumb brat,\" he said. \"We've got stuff to do tomorrow. Today.\"\n\"I'll just… go back to my room, then,\" Eren said softly, trying to mask his disappointment. \nLevi groaned. \"Do you need a fucking written invitation? Don't answer that. Lie down and shut the fuck up.\" He rolled towards the wall and closed his eyes.\nHe was going to stay the night. Eren could hardly contain his excitement. But how exactly… the bed was narrow, hardly enough for two people. He carefully clambered off Levi and tried to lie down next to him, keeping as close to the edge as possible. He nearly had a heart attack when Levi grabbed his arm and pulled him closer, pressing his spine into Eren's front. It was the second time he was being presented with Levi's back, and Eren knew he would do anything to keep that trust.\n\"If you kick, I will end you,\" Levi mumbled. He was the perfect size to fit under Eren's chin. Daringly, Eren wrapped his arm around Levi's stomach, and thought he might die from sheer happiness when Levi didn't pull away.\nThere was no way he was going to get any sleep tonight. For all he knew, this magical opportunity might vanish once the light of day had restored Levi's sanity; Eren would have to make as much of this experience as he could.\nWithin minutes, he was fast asleep. \n---\nWakefulness was prodding at Eren's consciousness, but he was more comfortable than he had been in years, curled against a warm body, safe and protected. He hadn't felt protected since… his mind shied away from the thought, and he snuggled closer. He would probably be happy if he never had to move again.\nA loud bang made him jerk upright.\n\"Levi, Eren's vanished, do you know – ha, told you guys he'd be here!\"\nEren stared at Petra, panting, trying to get his heart rate back to normal, completely disoriented. Sunlight was streaming in through a window, and since when was there a window in his basement?\n\"The hell's up with all the ruckus?\" A grouchy voice came from behind him, and Eren nearly jumped out of his skin when a strong arm wrapped around his waist. \n\"You should have told us,\" Petra scolded, and now Gunter and Erd were standing in the entrance as well, badly hidden grins on their faces. \"You know we're supposed to keep an eye on him.\"\n\"I am keeping an eye on him,\" Levi groused, resting his chin on Eren's shoulder. His very bony chin. \"Now get the hell out, I want to get dressed.\"\nThey left, much to Eren's relief. When the door clicked shut, Levi let go of him to stretch, and glanced at him out of the corner of his eye.\n\"Wipe that smile off your face, Jaeger, it makes you look even stupider than usual.\"\nThey were still so close to each other… Before Eren could think of all the reasons not to, he grabbed Levi's chin and kissed him chastely on the mouth (now both of them hadn't brushed teeth yet). It was as nice as he remembered.\nLevi kissed him back, then picked him up and threw him bodily out of bed. Eren hit the floor with a crash, and it took him a moment to figure out which way was up, and to establish that despite the throbbing, he hadn't broken anything. More bruises to add to the collection, though. He had a feeling being with Levi wasn't going to be the healthiest. Lucky he was a titan.\nWhen Levi started getting dressed (giving Eren an eyeful. His first thought was to look away, but if he and Levi were sort-of together now, why shouldn't he look? Levi met his gaze straight on, and didn't seem to mind. If anything, he looked a bit smug at the attention), Eren realized that since his clothes were still in his cell, he'd have to go back to change. And walk across half the base in his pajamas. He just hoped he didn't meet Jean. \n\"I'll… go, then.\"\nLevi didn't look at him, busy with the straps of his 3D gear. \"You should bring your stuff if you're sleeping here tonight. And don't forget your toothbrush.\"\nEren grinned, tackled him with a hug, then escaped before retribution could commence.\n---\nNow Eren spent the day tagging along with Levi wherever he went. Mostly because entertainment was guaranteed (the Recon Corps were headcases, each and every one), but also because it was nice to just have somewhere he sort of belonged, again. Levi even let him hang around his office while he was working. Well, \"let\". It wasn't hard to see that Levi loved having Eren close by. Heck, if Eren hung around him long enough, Levi would start petting him absently, much to everybody's amusement. \nAt dinner, Levi told him irritably to \"go bother your friends, you damn leech, if this keeps up you'll be following me to the toilet\", so Eren went to sit with them as usual.\n(At night, Levi pinned him down in the dark, running his hands over Eren's unscarred body, and whispered hoarsely, you're a titan, you won't go and die, will you. Eren dug his fingers into strong shoulders rough with calluses from the 3d maneuver gear, and for the very first time was fiercely, truly, glad to be a titan. But that was between the two of them.) \n---\n\"The bathroom isn't clean anymore,\" Connie whined. \"Ever since you stopped showing up in the mornings, Eren, nobody's been cleaning it.\"\n\"It's very selfish of you,\" Ymir added.\n\"You could try cleaning it yourselves!\" Christa chirped, and wilted under the flat looks she received.\nEren sighed. True, now he got to partake of Levi's astonishingly clean bathroom every morning. And every other day he got to be the one in charge of maintaining its cleanliness. Aloud, he said, \"If you're so desperate, Connie, I can show you to the captain's secret stash of cleaning supplies. There are plenty of mops.\"\n\"No thanks, I'd rather bitch about it.\"\nHe had forgotten to expect anything special, at this point, so when Sasha perked up and started salivating, he turned around and had a moment of surprise to see Levi bearing down on him. Eren was slowly coming to grips with the various shades of frowns Levi bore, and this one looked positively pleased.\n\"I found it,\" the captain announced. With a flourish, he placed a small paper- wrapped package in front of Eren. As if drawn by a magnet, everybody leaned forward to see what it was.\n\"You didn't have to,\" he said, dithering for a moment, enjoying his own curiosity. A quick cuff on the back of his head made him yelp.\n\"Of course I had to!\" Levi snarled. \"It's perfect. There is no way that even somebody as ridiculous as you will manage to make a mess of this.\"\nWell, if he put it that way… Eren unwrapped the mysterious food, doing his best not to tear the paper (he even succeeded! Ha!), to uncover a small bunch of grapes. Each one was small and perfect, deep purple, not a bruise in sight. Eren inhaled their heady scent appreciatively. How had Levi even gotten his hands on these?\nA soft ooooooooooooh ran around the table, and what sounded like a muffled sob from Sasha.\n\"They're going to rot if you keep contemplating them for much longer,\" Levi said. \"I'm going to rot. Do you need a demonstration? Shall I draw you a graph?\"\n\"That would be nice, sir,\" Eren said, just to see what would happen. There was a gasp of indrawn breath around him, and Eren distinctly heard a mutter of \"he's suicidal!\". \nLevi narrowed his eyes and picked up a knife off the table. \"Very well. I seem to have misplaced my pen. Your blood will do.\"\nEren gulped. \"On second thought, sir, I think I figured it out!\"\nQuickly, before Levi could make good his threat, Eren pulled a grape off the stem and popped it in his mouth. The burst of flavor made the captain's knife slip completely from his mind. The peel was tart, but the inside amazingly sweet. Even more importantly, there was no mess. Not a single bit of juice squirted away, and his fingers remained clean. Every single grape was crisp perfection, and too quickly Eren found himself left with nothing but a forlorn stem. He looked up at Levi brightly.\n\"Congratulations,\" Levi said. \"You have restored my faith in humanity.\" He met Eren's eyes, and Eren could now see the humor lurking in his expression. Eren smiled, excited by the unspoken promise of later, prepared to reply - \nA cheer from around the table cut him off, going on far longer than it needed to, until finally he ducked his head in embarrassment. Seriously? Did they have to? Seriously?\nBy the time he could bring himself to lift his head once more, Levi had stalked off. Eren watched him go, his stomach doing a little flip inside him. Fine, so feeling a sense of accomplishment at managing to eat food without making a mess was silly, but Levi had really high standards. And Levi got him good food, and oil for his 3D gear, and actually liked to cuddle, and…\n\"Hey, Jean,\" he drawled, and smirked when Jean looked at him suspiciously. \"Now I'm banging the Captain.\"\nJean twitched. \"Too much information, Jaeger.\""
}