{
    "id": "8635321",
    "url": "https://archiveofourown.org/works/8635321?view_full_work=true",
    "author": [
        "astoryaboutwar"
    ],
    "title": "i know my madness",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Yuri!!! on Ice (Anime)"
    ],
    "relationships": [
        "Katsuki Yuuri/Victor Nikiforov"
    ],
    "characters": [
        "Katsuki Yuuri",
        "Victor Nikiforov",
        "Yuri Plisetsky",
        "Mila Babicheva",
        "Phichit Chulanont"
    ],
    "additional_tags": [
        "I Will Go Down With This Ship",
        "What Have I Done",
        "Victor is a playboy but not really",
        "Yuuri is clueless but that is not surprising",
        "Mila is my sweet bb",
        "Yurio is a precious chihuahua guard dog",
        "Alternate Universe - Canon Divergence",
        "Now tagging for angst",
        "Because IRL this show is angst-free and a blessing"
    ],
    "language": "English",
    "series": "",
    "published": "2016-11-23",
    "completed": null,
    "words": "14,133",
    "chapters": "1/1",
    "comments": "974",
    "kudos": "15,034",
    "bookmarks": "4,276",
    "hits": "203,216",
    "summary": "<p>It's hardly a secret that Victor Nikiforov is a massive player. </p>\n<p>(In which Yuuri doesn't blow the Grand Prix Finals the first time round, <i>does</i> blow Victor, and everything changes but ends up the same.)</p>",
    "notes": "<p>This was supposed to be 5- or 6,000 words <i>tops</i>, and then I birthed this monster. This thing sat on me until it was complete, so forgive any inaccuracies and assume they're there for Plot Reasons™. </p>\n<p>Title borrowed from Jean Racine's 'Phèdre', Act III, Scene III, Line 853.</p>\n<p>Enjoy!</p>\n<p>(This has now been translated into <a href=\"http://cathyforyoi.lofter.com/post/1ea330f4_d971a4c\" rel=\"nofollow\">Mandarin</a>!)</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Because I'm doofus and forgot to post translations to the scant Russian in the fic (bear in mind that i don't speak Russian myself, everything's lifted from Google), here they are:<br><br><i>moi sladki</i>: my sweet<br><i>pryanichek</i>: gingerbread; used to describe a loved one that has more 'spice'<br><i>kotyenok</i>: kitten<br><i>tigryenok</i>: tiger (pretty much same as kotyenok, just with an edge?)<br><i>hvatit</i>: enough; stop</p>\n<p>As a final request, I'm going to ask that <b>constructive criticism please be withheld</b>. For those of you thinking 'wow astoryaboutwar just wants us to say nice things', that's <i>not</i> what concrit is - it's still entirely your prerogative if you want to comment just to tell me you hate something. Concrit is a pretty specific form of <i>critique</i> (which is NOT the same as criticism), and I've had horrible, awful experiences with it in the past, and I'd rather just not deal with it again in my <i>unpaid</i> writing. Because I've gotten so much unnecessary grief over this, a more detailed explanation of the distinction between constructive criticism (critique) vs. plain criticism and the reasoning behind my request can be found <a href=\"https://astoryaboutwar.tumblr.com/post/154896389040/psa-constructive-criticism-is-a-specific\" rel=\"nofollow\">here</a>.</p>\n<p>Don't get me wrong, though - comments are ALWAYS welcome and much loved. I live for comments!</p>\n<p>I can be found on Tumblr <a href=\"https://astoryaboutwar.tumblr.com\" rel=\"nofollow\">here</a>. I reblog a lot of random ships (I have <i>so</i> many) and shitposts, and I'm not ashamed to admit that. Come join me!</p>",
    "text": "It’s hardly a secret that Victor Nikiforov is a massive player. Yuuri’s not blind, nor is he an idiot. God knows he spent enough years of his life obsessively following the man through the media; he knows Victor goes through his relationships - conquests - with startling frequency.\nHell, Victor had once sent some starlet who was proving reticent to his charms twelve dozen roses, whisked her off to Cyprus for a week, and then promptly ended the relationship two weeks after in an impassioned shouting match at Kafe Pushkin. Media sensationalist reporting aside, Phichit had actually texted him to verify this one - he’d been in Moscow at the time for some physio and had witnessed the tail end of it himself.\nVictor’s relationships are like dynamite: sizzling to the explosive, dangerous finish.\nSo, to reiterate: Yuuri’s not an idiot. He knows how the game goes, even if he hasn’t played it himself.\nWhich is why, when Victor saunters up to him post-Grand Prix Finals, gold medal still looped and glinting around the elegant line of his neck, he’s dumbstruck. Victor reaches out with one long finger and casually flicks the medal around Yuuri’s neck, making a soft clink.\n“Great performance out there,” he says in accented English. “Your triple axel really is impressive.”\nYuuri scrambles for the words, Detroit - and English - feeling ages away, even if he’d flown straight to Russia for the Grand Prix Finals from the States. “Thanks,” he manages to sputter. “Congratulations to you too.”\nVictor studies him for a long moment, and Yuuri’s all too aware that his cheeks are still unattractively flushed from the exertion of his Free Skate, and that he probably reeks of sweat.\n“Have dinner with me,” Victor says, breaking into a charming grin. “Us medallists should stick together, no?” He eyes Yuuri’s medal again, expression sly. “After all, you’ve already got silver, there’s only gold to go for next, isn’t there?”\nThe man is lethal. It’s also short-circuiting Yuuri’s brain, just being in such close proximity to his idol scant minutes after being on the same ice as him. Everything feels surreal.\nCelestino walks up to them before Yuuri can stammer out a reply.\n“Ah, Nikiforov!” he greets, clasping Victor on the shoulder. “Another feather in your cap, great job.”\n“Celestino,” Victor smiles, accepting the praise with a gracious tilt of his head. He gestures to Yuuri with a slight wave of his hand. “I’m just offering to show Yuuri here around Moscow.”\n“Brilliant idea!” Celestino claps Yuuri on the back, pride in his eyes. “Take the night off, Yuuri, you deserve it. Good work on the quad salchow, I’ll see you back at the hotel.” He wanders off into the throng after bidding them both farewell.\n“I - I have an early flight tomorrow,” Yuuri manages to say, all while maintaining the barest minimum of eye contact. God, Victor’s eyes. They’re even bluer in person. He hoists his gym bag further up his shoulder, ready to beat a hasty retreat. Yuuri takes a tentative step forward, but Victor, clearly not ready to give up the chase that easily, refuses to budge. All his attempt at fleeing has achieved is him standing far too close to Victor for comfort.\n“And I promise I’ll have you back to your room by eleven,” Victor says, his grin pure magnetism.\nYuuri’s never been the best at social interaction. He’s anxious, easily flustered, and all too prone to bouts of intense moodiness. What friends he has are because of his figure skating, and they don’t always hang out outside of training, Phichit as his roommate notwithstanding. To sum it up, he’s spectacularly bad at saying no, especially when faced with the full force of his idol in the flesh, megawatt smile and all.\n“I gu-ess,” Yuuri reluctantly agrees, the words drawn out even as he continues to search for a way out.\n“Fantastic!” Victor exclaims, a lone finger coming up to trail softly along his jaw. Yuuri swallows hard, and Victor pulls away, smile just this side of wicked. “Which hotel are you staying at? I’ll come by to get you at seven.”\nYuuri stammers out the address all while the nails of his free hand dig into his palm, pressing deep crescent moons into his skin. Victor keys his number into his phone and is gone with a wink and a flick of his quicksilver hair, stepping out to bask in the lights of camera flashes.\nYuuri stands in the lobby of the rink for several minutes, disbelief running hot through his veins. He thinks back to his room in Hasetsu, with his collection of posters and memorabilia, and the actual man, larger-than-life. Yu-topia feels worlds away. He eyes the silver medal resting against his chest, and hears the din of the news crews beyond the entrance doors, just out of sight. He thinks of Detroit, and Vicchan, and his okaa-san and otou-san and Mari and Yuuko and Minako.\nHe thinks of home.\nToday - this Grand Prix - tonight - he’s earned this. Years spent away from his family, anxious and crying into his pillow when the homesickness became unbearable; days and days spent at the rink and on the ice, falling and getting up and falling and getting up; hours spent at the gym, beating and working his body into submission - he’s spent his whole life building up to this, and today is the first time it’s really felt like it’s finally paid off.\nAnd if Victor Nikiforov wants to take him out to dinner and wine and dine him? Yuuri’s going to let him, and he’s going do his best to blow him away.\n \n \n \n \n_____\n \n \n \n \nThe closer it gets to seven, Yuuri feels his resolve flag in increasing amounts.\nHe hadn’t thought to pack a suit, what with the Grand Prix Finals weighing on his mind and the anxiety in his gut at the time, so all he has on hand are a couple of dress shirts and one pair of trousers which are slightly loose. It’s six-fifty, so there’s nothing to be done for it but to hitch it up with his belt, slick his hair back with some gel, and to fidget with the cuffs of his freshly-pressed white shirt.\nAt six-fifty-seven, he slips on his black leather loafers, grabs his phone, wallet, and room keycard, and slips out the door.\nHe’s tense on the elevator ride down, stiff but twitchy with nervousness.\nThe lobby of the Moscow Marriott Grand is smooth marble and warm lighting, his footsteps loud enough on the tile to cause him to wince as he makes his way through the lift bank.\nVictor’s reclining against a pillar right by the floral centrepiece in the middle of the lobby, a bouquet of red roses in his hand. He’s in a three-piece ensemble, black overcoat dark against the charcoal grey of his suit and waistcoat, the white of his dress shirt a stark contrast.\nHe’s so attractive that Yuuri can almost feel himself having panic attack. Steeling his nerves does little to stop the way his heart pounds when Victor spots him and does a slow once-over as he approaches. This feels almost exactly like the way he feels right before it’s his turn to step out onto the ice, the spotlights and attention of thousands on him.\n“Yuuri,” Victor greets, smile blooming and spreading slow and appreciative across his face. He presents the bouquet with a flourish. “These are for you.”\n“Ah - thank you,” he replies, holding the flowers awkwardly. He’s unsure what he’s supposed to do with them. Does Victor expect him to keep holding them for the duration of this evening? He feels wrong-footed from the get-go, and his resolve dips. Yuuri mentally shakes himself, and rallies. “Give me a moment, I’m going to leave this with the concierge to send up to my room. I don’t want to lose them over dinner,” he says, and his smile is far more confident than he feels.\nA quick, stilted exchange with the concierge in the little Russian he knows has the issue of the roses settled, and Victor leads him to the main entrance and out, pausing to hand the valet his ticket for his car to be brought round. Snow whirls around them, and the streets are bathed in white.\n“So, Yuuri,” Victor says as they wait, eyes alight with interest. “Is this your first time in Moscow?”\nHe can’t help the disappointment that unfurls fast and vicious in his chest, even as he tries to ruthlessly quash it. Victor wouldn’t be the first professional skater he knows of not to take too avid an interest in his competitors - Leo’d always said there wasn’t any point in knowing how many medals or cups someone’d won, since it wouldn’t help you skate any better anyway. It’s a sobering reminder that however tonight might end, there’s nothing long-term about this to look forward to.\n“No,” he says, and is proud that his voice doesn’t waver. “I was actually here for the Rostelecom Cup last month.” Recalling his resolution to make the most of tonight, he quirks a small smile and tries his hand at being as charming as he can manage. “What about you? Have you always lived in Moscow?”\nHe knows the answer, of course - Victor only moved here when he was eleven, when it became apparent to everyone he was going to be huge.\n“Not always,” Victor answers, and Yuuri notes the way he doesn’t elaborate. “But it’s such a gorgeous city to fall in love with, is it not?” He gestures to the snow-covered street in front of them, the streetlights casting an amber glow. “Oh, there we go,” he says, spotting his car.\nVictor’s car is sleek and beautiful, its clean and tasteful lines an echo of its owner. Yuuri doesn’t know anything about cars, but even he knows an Aston Martin when he sees one. Victor tips and thanks the valet in Russian, motioning at Yuuri to get in.\n“Where are we going?” Yuuri buckles in, curious.\n“Not far,” he replies. “About ten minutes from here if traffic is good.”\n \n \n \n \n_____\n \n \n \n \nBon is stylish, edgy, and devastatingly hip. The maitre ‘d ushers them to a small, intimate table at the back, set into a wall and partially concealed from the rest of the establishment by heavy velvet curtains.\nYuuri is led, wide-eyed, past the Kalashnikov lamps, the dark, flocked wallpaper, and intricately dizzying  glass windows. Not for the first time, he wonders what he’s gotten himself into.\nVictor draws his chair out for him, Yuuri blushing as he pushes it in before rounding the table to take his own seat. With a happy glance around, Victor beams. “So? What do you think? It was so difficult to get a table here on such short notice, but I’ve been promised it’s worth it.”\nYuuri feels painfully out of his element. The glossy tableware and fine linen all serve to remind him that he is, at heart, a country bumpkin with little polish, silver medal or no. The restaurant is clearly expensive and exclusive, an enclave for the glitterati and who’s who to gather and mingle, see and be seen. Yuuri would rather be in his hotel room, curled up in layers of jumpers and marathoning Netflix.\n“It’s very classy,” he says, toying with his salad fork, almost wincing at the smudge he leaves behind before he catches himself.\nVictor grins, satisfied, and leans back in his chair to launch into a discussion of the day’s Grand Prix performances, easily and effortlessly drawing Yuuri into the conversation. The food is ordered and arrives - excellent as promised - and the whole affair is incredibly enjoyable. He feels like his heart could burst with disbelief.\nYuuri does his best to be convivial and engaging, and it seems to work, if the laughter he draws from Victor is any indication. The anxiety at being in a setting as fashionable as this even abates a little, and he can almost forget he’s not a fish out of water here.\nThe ball of nervousness returns in force as dinner draws to a close, and all they are left with are glasses of dessert wine, sweet and heady. He’s had two glasses of wine now, not counting the current one he’s nursing, and he can feel the alcohol go to his head and loosen his limbs, even as the tension builds.\nYuuri eyes Victor over the rim of his glass, a small voice in his head wondering at how many others Victor’s showered this treatment on, and how naive he’d have to be to believe he’d be the last. He pushes that voice aside with more violence than necessary.\n“I’ve had a very good time,” he says, his attempt to pitch his voice to a more seductive timbre failing spectacularly, even to his own ears. Victor’s ice-chip blue eyes are a hot brand on him, one corner of his lips quirked slightly upward, his chin resting on a downturned hand.\n“So have I,” Victor says, his voice a low purr. Yuuri can feel his face burn, and knows from experience that an ungainly blush is spreading. The heat behind Victor’s eyes is heavy, and he lifts his head from his hand. “I’m ready to leave if you are, but I’m not ready to end the night yet.”\nYuuri’s blush is out in full force now. He swallows hard, and knows that Victor tracks the movement of his throat as his Adam’s apple bobs.\n“Neither am I,” he replies, and Victor smiles slowly, the blue of his eyes darkening with promise.\n \n \n \n \n_____\n \n \n \n \nThe sex is fantastic.\nIt’s with Victor fucking Nikiforov, Yuuri doesn’t think it could be anything but.\nThey barely make it back to his hotel room, stumbling into the doorway a tangle of limbs and clothes half-shed, lips pressing and gasping and impatient.\nYuuri wrangles his shirt and trousers off, nearly tripping in his haste, Victor tugging and touching and insistent at his back, naked and hard, and oh god is he actually going to be doing this?\nVictor nips at his ear, then his neck, and all hesitation evaporates at the feel of warm, large hands on his skin, stroking and coming up to tease his peaked nipples. Yuuri can’t help the moan that escapes, and bites his lip at the warm huff of laughter this draws from Victor.\n“Ah, moi sladki,” he hums, hands dipping lower, coming to cup at Yuuri through his boxers. “So ready for me. So gorgeous.”\nHe can feel his flush deepen, spreading over his pale skin. Yuuri isn’t ashamed of his body - not when he’s put so much effort into keeping it in shape - but he’s aware that he’s never been considered particularly attractive. He turns in the circle of Victor’s arms, and with an assertiveness that surprises himself, guides and pushes him down onto the bed, leaning over to kiss him long and wet as he disposes of his boxers.\nVictor’s hands come up to cup at his hips, tugging him down to grind their lengths together, their mouths and tongues still tangled and battling. His hands continue to trail down to the curve of his ass, fingers venturing further down, nudging and prodding, a silent question. Yuuri nods, and prays his uncertainty doesn’t bleed through.\n“You have lube, pryanichek?”\nThe Russian sends a shiver down his spine, the foreign word guttural and exotic and a klaxon that yes, oh my god, he really is doing this with Victor Nikiforov.\n“Bedside drawer,” he grits out. Victor moans between his thighs, their cocks still sliding over each other, the friction delicious and not nearly enough. It takes him a long moment to realise he hadn’t said that in English, so he switches and repeats.\nVictor is far too put-together for someone who’s managed to unravel Yuuri to such a degree, the long line of his body stretching up to the bedside table in a graceful arch. Disgruntled, and the wine making him bold, he bends to nuzzle at the divot between his thigh and torso, inhaling the masculine musk and clean sweat. Victor pauses in his quest, eyes hooded, pupils blown.\nEmboldened by the response, Yuuri traces little licks, moving further inward, stopping to nose at the base of his cock before rearing back to take him in his mouth, tugging his foreskin down.\nIt’s - okay, it’s his first time doing this, so he’s working off what he’s seen in porn, but Victor seems to be enjoying it. He curls his tongue over the head, flicking over the ridge of his frenulum, then slides his tongue down along the base as far as he can go, taking him into his throat. Victor makes a short, aborted thrust, one hand curling lightly into his hair, and Yuuri presses on, laving his cock. When he flicks his eyes up to look at Victor, his face is faintly flushed, his eyes heavy with lust.\n“Kotyenok, if you keep doing that, I can’t promise I’ll be able to fuck you,” he huffs, gently pulling Yuuri off his cock. Guiding him into his lap, thighs spread to either side of his body, Victor steadies him with his left hand on his hip, the right coming to close tight around Yuuri’s cock. He tugs at him steadily before switching hands, the left coming back coated with lube, teasing at his entrance and then stretching him slowly, steadily, incredibly. He produces a condom and rolls it on.\n“Come on, on your back, there we go,” he nudges, and Yuuri’s thighs are spread, his arms at his sides and gripping the sheets, and Victor brushes a hand across his inner thigh, cock pressing gently at his hole. He pushes in in increments, swooping down to catch his lips as he bottoms out, and he’s so full.\nYuuri can’t contain the small gasps that fall from his lips, gasps that turn into soft moans, then louder at Victor wraps a hand around his cock and tugs just as his cock nails his prostate, and then Yuuri abandons all pretence of attempting to remain silent.\n“God, yes, yes,” Victor groans above him, his hips snapping, pounding into him, and the crescendo is so near, so close -\nYuuri whites out.\nWhen he comes to, Victor’s pulling gently out of him, then getting up to dispose of the condom. His legs feel like jelly, and his muscles ache with pleasant soreness, the adrenaline of the day slowly leaving him.\nYuuri pushes himself up on his elbows, tracking Victor’s progress around the room. The condom goes in the bin under the desk, then boxers and trousers are pulled on.\nNeither have said a word.\nThis wasn’t unexpected, Yuuri reminds himself. He knew to expect this. Of course he wasn’t going for anything more, and he did get a wonderful night out of it, didn’t he? It’s everything he’s ever wanted. If anything, he can at least say that for one night, he captivated the great and untouchable Victor Nikiforov, and that’s more than most can say.\nVictor finishes with the last of his shirt buttons, tucking the tails into his trousers as he finally turns to Yuuri. The smile on his face is gentle and sweet, but rueful.\n“I really had a lovely evening,” he begins, and Yuuri just holds up a hand. He slides off the bed, the sheets pooling onto the floor, and pads over the Victor stark naked, bending to pick up and shake off his suit jacket.\nHe presses a kiss to his cheek, offering the jacket to him. “So did I,” he says. “Thank you for everything.”\nVictor bends his head and seals their lips together, and it’s still hot and electrifying and tangible. He breaks away to swing his jacket on.\nThe moment is strange, fragile yet unbreakable. It feels like a moment of turning and change. It feel like if Yuuri speaks out or does something, the whole course of his life could alter because of this one moment. He can almost see the threads of different futures spreading out from this single minute in time. The moment crystallises, and in an unexpected burst of confidence, just as Victor reaches the door of the room, he calls out.\n“You know, if we’re ever in the same city again, you’re welcome to look me up. You have my number.”\nVictor throws a glance over his shoulder, face barely lit in the darkness of the room. He catches the edge of a lightning-sharp smile.\n“I do, don’t I? I’ll see you around, Yuuri.”\nThe door shuts behind him, the light of the hallway briefly illuminating the dim room, then fading back to grey.\n \n \n \n \n_____\n \n \n \n \nYuuri trains hard in the upcoming months, throwing himself into training with an abandon that surprises Celestino and is met with raised eyebrows by Phichit. He works on landing his quad salchow, and when he’s landing that a lot more often than not in practice, asks to have the quad flip put on his roster.\nTo say that shocks Celestino is putting it mildly.\n“You can win the Grand Prix without it, you know,” he advises.\n“It’s not enough if I don’t,” Yuuri pushes back, insistent. “I need to get better. Improve. I can’t keep doing triple axels.”\nHis first tries at the quad flip go dismally. He lands on his ass, then on his front, then on his side in a particularly bad fall that requires icing and a week off practice.\n“I can do it,” he still insists. “I need to.”\n“If you’re sure,” Celestino sighs, unused to but pleasantly surprised at his recalcitrance. “We’ll give it another go.”\nHe spends so much time on the ice that he skates even in his dreams, and sometimes he forgets he isn’t in the rink and stumbles on normal ground.\nIt pays off, though.\nFor Yuuri, gifted but without the shining talent that comes with the territory for the true stars like Victor and Jean Jacques, hard work has been his only recourse. Can’t do it on the first, second, or tenth try like they can? It’s alright, he’ll get it on his hundredth.\nThe first time he lands a quad flip, he whoops so loudly that Phichit, who’d been on his way into the rink, told him he’d startled a flock of birds on a tree into flight.\nThen he lands his second, then third, then fourth, and the figure keeps climbing until the competitive season dawns on them, fast and daunting, and he’s confident enough - and Celestino’s confident enough - to add it to his roster.\nWhen it’s announced in a press bulletin, he wonders what Victor’s expression might be, if he could see it. If Victor would have even noticed.\n \n \n \n \n_____\n \n \n \n \n \nWhen Celestino approaches him to talk about his routine for his programmes, he’s struck with a sudden burst of inspiration.\n“I’ve picked out a few songs for your Free Skate here, so you should go through these and let me know which one sounds good by Thursday.” Celestino hands him a memory stick.\nHe musters his courage. “Is it - is it okay if I pick my own music, this year?”\nCelestino blinks several times, clearly taken aback, but he recovers quickly. “Of course, that’s always been an option for you. We don’t have much time left, so can you get a selection together by Thursday? And think about your Short Programme, too.”\nYuuri’s putting through a call to Phichit as soon as practice ends, and after several rapid-fire emails and brazen begging, by the time Thursday rolls around, he thinks he’s got it.\nHe waits anxiously as Celestino listens to the piece, earbuds in either ear. He can see the music winding down on the CD player, and when Celestino removes the buds and doesn’t say a word for several seconds, Yuuri fears the worst.\nCelestino looks at him, and his eyes are searching, measured. “Something’s different about you, Yuuri.” He waves at the Walkman in his left hand. “This is good. Really good. I’m expecting a lot from you this season. We’ll begin work on choreography.”\nRelieved, Yuuri sags. “Thanks. I’ll, uh, keep looking for something for the Short.”\nHe clasps him on the shoulder. “Keep it up. Any idea what you might want to title this?” He holds up the disc in one hand, a Sharpie in the other.\nBlushing down to his roots, Yuuri takes the pen, and with a mounting sense of determination, inks the title that’s been floating around in his mind since he heard the piece.\nCelestino peers at it when it’s done. “‘Yuuri on Ice’,” he repeats. “I like it. Great work. Whatever you’ve been doing, you keep doing it. This season’s going to be yours. I can feel it.”\nThe choreography is demanding, the hours on the ice exhausting. But the first time he completes the whole routine flawlessly, nailing his final quad toe loop, he knows it’s all worth it. The muscle aches and bone-deep tiredness fade under the smooth slide of his blades on the ice, the quiet moments in the air ripe with anticipation as he takes off for his jumps and hangs, suspended for a brief second, and lands in perfect balance.\nAnd when he turns on the radio one morning, eyes bleary as he shuffles into his en suite to brush his teeth, and he hears the piece, his body snaps to instant wakefulness.\nCelestino’s no longer shocked when he brings the music to him, but he’s still slightly astonished, which means Yuuri knows he’s on the right track. He’s going down a different path this season.\n“If you’re sure,” Celestino asks, eyebrows raised.\n“I’ve never been surer,” he reassures, and he can feel the rightness of it settle in his bones.\n \n \n \n \n_____\n \n \n \n \nThe assignments are published in June, and Yuuri’s going to Paris for the Trophée de France, and then back home to Japan for the NHK Trophy, assuming he makes it through the first competition - which he’s going to. He will.\nAs much as he tries to stop himself, he can’t help but search for Victor’s name among the assignments, eyes moving of their own volition.\nHe nearly starts when he sees that Victor’s been assigned to the Trophée de France as well, after Skate America. There’s never been any doubt that Victor wouldn’t make it through the first round, after all.\nParis dawns bright, fast, and unforgiving on the heels of his training and practices. He can’t help but follow Victor’s progress through Skate America  - gold, of course  - his routines flowing and fluid, graceful and effortless.\nIt’s equal parts inspiring and demoralising. So Yuuri keeps his head down, pushes himself on the ice and off, and runs through his choreography so many times that he catches himself doing it subconsciously off practice.\nAnd when Yuuri finally steps off the plane and into the overcast Parisian morning, he can almost feel a shift in the air, a whisper of promise that beckons to greater heights.\nIt’s pushing six in the evening before the Trophée when his mobile buzzes with a text.\nI hear we’re both in town, it reads. It’s from an unknown - foreign - number, and Yuuri almost drops his phone in shock. He recognises the +7 Russian dialling code.\nIt’s - there wouldn’t - it couldn’t be anyone else.\nI’m at the Hilton Opera, he types out, and forces himself to hit send before he can overthink it. He presses a hand to his flushed face, and regulates his breaths. Before he can question his decisions further, he picks up his phone again, and types Room 157. I’ll have the front desk leave a key for you. He sends it, and places a call down to the reception to ask for a key to be side aside.\nStruck by his sudden bravery, he catches sight of himself in his lumpy hoodie and track bottoms in the mirror by the desk. Keenly aware that Victor Nikiforov would soon be making an appearance - at least, he hopes - he leaps into the shower.\nWhen he emerges, bathroom billowing steam, there’s a text waiting for him.\n;) , it reads.\n \n \n \n \n_____\n \n \n \n \nThey don’t actually have sex again - blowjobs before don’t count - until after the Trophée de France, when the silver medal once again hangs low on Yuuri’s chest, the gold adorning Victor’s.\nThere’d been little on his mind since but the look on Victor’s face when Yuuri’d glided out onto the ice, head tilted, hip cocked, arms loose at his sides, and On Love: Eros started playing. He’d shot Victor the cocky smirk he spent hours perfecting in the mirror, and then there hadn’t been anything but the long glide of his blades and the exertion of his body, fluid with the music.\nAnd the next day, when Yuuri’d nailed the quad toe loop at the end of his Free Skate, the lust in Victor’s expression was full-blown.\nThe press went - is still going - wild. New Katsuki Yuuri!!!, headlines proclaim. Has he found a secret passion???\nBut that - all that -\nThere’s nothing on his mind now but the slow burn of Victor in him, pushing and pulling and thrusting in the sweetest, slowest friction.\n“God, tigryenok, you’re perfect, so good, so tight for me,” Victor moans, and his words are a jumble of endearments and praise and Russian that mixes together into a heady combination in his low, smooth voice.\nThey relearn each other’s bodies long into the night, a montage of limbs woven together in embrace, of lips pressing and searching and sucking, of hands stroking and teasing and scratching.\nVictor fucks him on his back, then on his front, and then with Yuuri straddled across his lap, bouncing and sweaty and unravelled.\nHe’s gone by morning, and all traces left of him are pressed into Yuuri’s skin in a collection of bruises that would perfectly fit the curve of his long fingers and match the bow of his mouth.\nIt’s fine, Yuuri never expected anything else.\n \n \n \n \n_____\n \n \n \n \nYuuri blazes through the NHK Trophy.\nHe breaks the 100-point barrier in the Short Programme, and comes so close to breaking the 200 in the Free Skate.\nThe media is going crazy, whipped into a frenzy by his performances, the underdog from out of nowhere.\nHe stands high on the podium - the highest for once in his life - and forces himself not to flinch under the scrutiny. Phichit waves at the crowd next to him, silver medal looped around his neck.\n“I’m so proud of you, Yuuri!” he yells, struggling to be heard over the din of the rink and the shouting of the press. “I knew you could do it!” Phichit’s grin is beatific and infectious, and Yuuri can feel an answering smile break out on his face.\nThey go out for celebratory drinks that night, him and Phichit, Leo, and Guang Hong. They sing shitty karaoke at a bar in Shibuya and go for late night okonomiyaki, drunk on sake and beer.\nIn the privacy of the lift at their hotel, Leo and Guang Hong begging off to their own, Phichit presses a kiss to his lips. Yuuri, stunned, kisses back.\nIt’s nice and pleasant, but it doesn’t make him feel anything.\nPhichit breaks the kiss, leaning back to smile sweetly at him.\n“Ah, that’s what I thought,” he says, shaking his head slightly.\n“I’m sorry,” Yuuri apologises, wrong-footed and not wanting to lose one of his best friends.\nPhichit waves him off. “No, no, I expected it. Can’t blame a man for trying, is all.”\nThe lift dings as it arrives at his floor. “Don’t worry about it, Yuuri - and I mean it. You’re my best friend, nothing’s going to change that. I’m so proud of you today.”\nPhichit steps out, sending a smile his way as the doors shut behind him. As he ascends to his floor, Yuuri feels conflicted.\nHe stumbles to bed in a haze. He fishes his phone from his pocket to charge when he notices he has a new message - a trophy emoji and !!!!! - from Victor.\nShrugging off his clothes and changing into a comfy sleep shirt, he can’t help the small smile that tugs at his lips.\nHe’ll deal with everything tomorrow. It’ll all work out.\n \n \n \n \n_____\n \n \n \n \nWhen he wakes up, it’s to the insistent buzz of his mobile, vibrating a racket and lighting up the dimness of his hotel room.\nHe has eleven missed calls and twenty-one texts from Mari, Minako, Yuuko, and - oddly - one from Phichit that reads I’m so sorry!!\nConfused, he unlocks his phone to scroll through the mountain of messages, all variations of OMG! and Is this for real??!?? Yuuri!!!\nDread curdles at the back of his throat, and he pulls up a gossip site on his mobile browser.\nLOVE BLOOMS ON ICE AND OFF!, the headline on the front page all but yells. The surveillance photo is grainy, but it’s unmistakably of him and Phichit in the low light of the lift, kissing. Instagram photos of their night out follow: a selfie with Phichit, Leo, and Guang Hong at the izakaya, arms slung around shoulders, then a photo of him and Phichit singing some stupid song at the karaoke bar.\nFlopping back onto the bed, Yuuri lets out a low groan of frustration. There’s a voicemail from Celestino instructing him to lay low to avoid the press camped in the lobby, and that he’s in talks with the hotel about the privacy violation.\nVictor doesn’t text.\n \n \n \n \n_____\n \n \n \n \nIt dies down, as it always does, and the news cycle moves on. There’s some gossip on the grapevine that Victor’s been seen about with Christophe Giacometti.\nIt’s not - Yuuri’s not going to say that it doesn’t hurt, because it does, but he knew what he was getting himself into.\nHe gives himself a day to mope, curled up under the blankets of his room and binging on ice cream. He knows how it goes: Victor loses interest as quickly as the tide shifts, and he moves on to someone else. Victor’d probably seen that photo of him and Phichit and figured it was time to cut his losses. There were bigger and more beautiful fish to fry.\nVictor’d made him feel like the centre of his world for two nights, desirable and something to covet. He’d shown him what pleasure truly felt like beyond his own two hands and a dildo. He’d made him feel wanted. He’d made him feel - not on top of the world, not yet, but rocketing there at supersonic speeds.\nYuuri throws himself back into practice, honing his routine into perfection. He lands his jumps with precision, arches his fingers to exact angles, and works out the flourishes that breathe life into his performances.\nThe Grand Prix Finals are only two weeks away.\nEven now, heart slightly bruised and feeling like crap, he can taste victory.\nVictor still doesn’t text.\n(Not that Yuuri’s waiting.)\n \n \n \n \n_____\n \n \n \n \nThe Palais Omnisports in Marseille is a massive building, gleaming glass reflecting the glinting sunlight that peers out from behind clouds.\nIt’s a day to the Final.\nYuuri’s muscles aching from practice, sweat dripping uncomfortably down the hollow of his shoulder blades, Celestino finally gives him leave to take off for the day.\nHe runs into Victor in the locker room by the rink, because it’s just his luck that he would.\nVictor’s expression is congenial enough, a polite smile gracing his lips.\n“Hello, Yuuri, it’s good to see you,” he says, and there’s no warmth behind it, no spark in his glacier-blue eyes.\n“Victor,” he stammers, “I -,” he’s cut off by the sound of approaching footsteps, and they both turn to face the newcomer.\nYuuri recognises Yuri Plisetsky immediately. It would be hard not to, with the sheer amount of animal prints the youth seems set on wearing at any given opportunity.\n“This him?” Yuri says, eyes on Victor and a sharp jerk of his chin in Yuuri’s direction. Whatever Yuri sees on Victor’s face must satisfy him, because he breaks his gaze off to direct it at him.\n“You’re an asshole,” he spits, and there’s far too much venom in his voice for someone who’s only just met Yuuri.\nBewildered, Yuuri takes an unconscious step back, hands coming up to clutch at his chest in a nervous gesture. “Ex-excuse me?”\nVictor snaps something at Yuri in Russian that makes the teen huff and stalk away, but not before sending a glare Yuuri’s way.\n“He’s still young,” Victor says, and it’s not really an apology for whatever the hell just happened, but Yuuri nods along.\nMore footsteps sound from behind them, echoing off the walls of the locker room, and Phichit comes into view, cheerful grin on his face.\n“Hey, Yuuri, Leo was just texting me about - ”\nWhatever Phichit meant to say dies when he spots Victor, standing a few feet from Yuuri, the tension in the air a palpable thing.\nVictor is the first to break the silence, bending to grab his duffel and slinging it over a shoulder.\n“Yuuri, Chulanont,” he bids, tone frosty, and makes his exit.\nYuuri and Phichit are left behind, the former baffled and the latter bemused, to stare wide-eyed at each other. After a good few seconds, Phichit speaks, eyebrows raised high into his hairline.\n“I have no idea what just happened.”\n \n \n \n \n_____\n \n \n \n \nThat night, Yuuri’s phone beeps with a text that nearly sends him into a fit of histrionics.\n\nThe Four Seasons, Room 697. There’s a key at the front desk.\n\nThe +7 number mocks him. Sighing, he finally thumbs at his phone to add it to his contacts, biting his lip as he saves it under ‘Victor’.\nStill. There’s the elephant in the room, and Yuuri’s moving to tug a coat on over his t-shirt and jeans before his mind catches up to the fact that he’s already arrived at a decision.\nHe doesn’t know what this means, that it’s the first text in weeks after their run-in this morning and that it’s the first time Yuuri’s going to Victor instead of the other way around.\nHis palms are sweaty and his pulse rabbits the whole cab ride over.\nVictor fucks him hard and fast that night, hands and lips bruising, careful to mark only below the collar and under any sleeve lines.\nIt’s rough and brutal, a harsh slide inside him that leaves Yuuri gasping and moaning low, drunk on pleasure and Victor.\nHe’s so close to coming, pushing that final, vicious edge of orgasm when Victor deliberately slows his thrusts, barely rocking at all.\n“Please,” Yuuri whines, scrabbling at his shoulders, canting his hips to get at that maddening friction. He’s so close. “Faster, please,” he pleads.\nThere’s something almost cruel in Victor’s eyes when he bends to nose at Yuuri’s jaw, tongue darting out to lap at the tender skin of his neck.\n“Faster, please, Victor,” he demands, unforgiving, still keeping his hips rocking at an unsatisfyingly slow pace.\nFor several seconds, Yuuri’s brain is too caught on the pleasure and the building insistence of his orgasm to understand what Victor wants.\nWhen his mind catches up, he’s nodding furiously, gasping out the words.\n“Faster, please, Vic-tor,” he moans, and chokes out his name again when the hard rush of his release overwhelms him.\nClean up is quiet and slow, Yuuri lethargic and feeling oddly disconnected. When he’s dressed to leave, Victor catches him by the chin, pressing their mouths together in a bruising kiss. His eyes are dark and demanding.\n“Tomorrow,” he says, voice rough, “When you skate On Love: Eros, don’t you dare think of anyone but me.”\n \n \n \n \n_____\n \n \n \n \nOrgasmic night aside, Yuuri’s nerves are back in full force.\nHe’s in a chair in the holding room by the back, eyes fixed on the far wall. He can’t stop his knee from bouncing up and down, and his palms are damp and clammy with sweat. His heart is pounding, and his stomach is in knots.\nTwo performances to go until it’s his turn.\nThis is it.\nHe’s here, at the Grand Prix Finals again for the second year running, and the collective weight of the expectations of his family and country rests on his shoulders. His nails burrow deep welts into his palms.\nVictor’s on screen, gliding and soaring and glorious under the lights and adoration of millions. Yuuri’s not watching, but he can hear the TV behind him and the cheering crowds beyond the doors of the holding room.\nVictor’s sensational. He always is.\nWhen Yuuri steps out onto the ice, his pulse hasn’t calmed, and the butterflies haven’t left. But he spots Victor standing rinkside, just off the Kiss &amp; Cry, gaze intent, and Yuuri thinks that he can do this.\nImage of Victor seared into his mind’s eye, he cocks his hip and angles his head.\nThe music starts, notes high and insistent. He runs his hands down his body in undulating movements, tongue darting out to swipe at his lower lip. He flicks his chin and smiles, weighty and seductive.\n\nDon’t you dare think of anyone but me. \n\n \n \n \n_____\n \n \n \n \nHe doesn’t see Victor that night, at the end of the first day, and Victor doesn’t text. But there’s a tangible sense that something’s shifted between them, a change in their dynamic negotiated in lines on the ice.\nYuuri leads in the rankings, putting up a personal best of 107.61 on his Short Programme, just edging out Victor’s 106.92.\nIt’s the first time he’s ever led Victor on the leaderboard.\nIt’s an exhilarating feeling.\nHe’d never thought he could be here. For most of his life, his one goal had been to skate on the same ice as Victor Nikiforov. There was never any thought of beating him, of even thinking that he - someone as plain and boring and ordinary as Yuuri - ever could.\nThere are texts on his phone from Yuuko and Minako, telling him that they, and all of Japan, are behind him. He calls his parents, and there’s a lot of screaming from Mari in the background, but the message is the same: they’re all so very proud of him.\nCelestino drops by for a quick follow-up before the next day, a bolstering pep talk that’s meant to buoy his spirits and keep his eye on the prize.\nThe din as he exits the hotel the next morning is deafening, reporters shoving their microphones and recorders at him, a million flash bulbs going off at the same time.\n“Yuuri!” one yells. “How does it feel, knowing that all of Japan is watching?”\nHe’s been strangely calm since waking up this morning, a sense of purpose settled into him. “I’m very grateful,” he demurs, and smiles for the cameras as Celestino ushers him away from the press.\nLater, in the locker room, Celestino clasps him by the shoulders.\n“You’ve come so far, Yuuri. You can do this.”\nYuuri clears his throat. It’d been a cathartic night.\n“I know,” he responds, and the pleased grin on Celestino’s face is all the boost he needs.\nIn the holding room, he makes sure to watch Victor’s performance. It’s technically perfect and presentationally beautiful. His jumps are high, hands posed just so, landings steady and sure. Victor is a star sure of his place in the spotlight.\nOne performance later, it’s his turn.\nAs Yuuri glides out onto the ice and takes his place, the noise of the crowd fades.\nHe looks up into the stands, the lights bright, and thinks: I was made to be here.\nThe music starts.\nYuuri’s body flows, whirling and soaring with grace. Every move is exact, every muscle tuned and held under his fine control. As he enters the second half, the notes swelling and rising, his jumps are flawlessly balanced, the sweeps of his arms elegance personified. He faintly registers the commentary in the background - And for his final jump, a quadruple toe loop!\nHe takes the leap, he places all his faith, and -\nHe nails the quadruple flip.\nAs he draws to an end, the paradigm shift is perceptible. The cheers around him welcome and beckon, signalling to everyone: there’s someone new out to make history.\nYuuri is poised, chest heaving, arm still outstretched, fingers posed.\nThe crowd roars, surging to their feet, and flowers rain from the stands.\nRinkside, the commentators go wild, yelling about how unprecedented this was, how remarkable, how game-changing.\nHe breaks the 200-point barrier.\nCombined, he breaks 300.\nHe wins the Grand Prix Finals.\n \n \n \n \n_____\n \n \n \n \nLater, when he finally manages to extricate himself from the media and fans, he finds Victor waiting in his hotel room, sitting on the bed.\n“The housekeeping staff recognised me and let me in,” Victor explains, slight smile on his face. “I hope you don’t mind.”\nIt’s the first time in five years that Victor hasn’t taken home the gold in the Grand Prix Finals - or, in fact, any gold.\nIt’s not - Yuuri wouldn’t call it the end of an era per se, but he’s sure he can give Victor a run for his money in the upcoming years, if this isn’t his last competitive season.\n“It’s fine,” Yuuri says. “Congratulations, by the way.”\nVictor huffs a laugh. “I should be the one saying that.” He stands, almost leonine, and prowls over to Yuuri, intent dark in his eyes. Not for the first time, he’s struck by how much taller Victor is. “You were brilliant out there. I’d thought - I’ve gone so long thinking nothing could surprise me. That quad flip - ”\nYuuri’s pushed backed against the door, mouth pressed to his.\nVictor’s tongue is skilful, teasing and stroking in equal parts, and he can feel himself getting hard. Victor slides a thigh between his legs, and the sudden pressure is glorious against the line of his hardening cock.\nThey fuck long and slow, round one bleeding into two, then three, and then exhausted sleep for the both of them, a tangle of their bodies on the bed.\nIn the light of the morning, soft sunlight dappling in through the windows, the two of them showered and rounds four and five over with, Victor turns to him, expression pensive.\n“Come with me to Russia.”\nPerhaps the most surprising thing is that Yuuri doesn’t immediately say no. Instead, he turns away, head bowed in thought.\n“I’ll think about it.”\n \n \n \n \n_____\n \n \n \n \nThe thought of Russia eats at him, even as he returns to Detroit and figures out what to do for the two months before his training starts in earnest again.\nHe’s won the Grand Prix. He has serious hardware to his name now. There’s next season, sure, but he feels a restlessness in his bones, a yearning to reach for even greater heights.\nHe feels strangely discontent.\nYuuri talks to Celestino, then his parents, and then Phichit. All of them are in agreement, even if some are more reluctant than others. He’s entering a new phase of his professional figure skating career, and Russia is a good idea.\nCelestino is, of course, loathe to lose his star pupil, but he understands that Yuuri thinks he’s come as far as he can with him.\nHis parents want what’s best for him, and if he thinks that whatever’s best is waiting in Moscow, they’ll support him completely.\nMinako yells at him over the phone and asks if this is because Victor trains there too, and it’s testament to how much he’s grown that he tells her that it isn’t - at least, not entirely.\nPhichit just hugs him tightly and tells him he’ll miss him, and not to be an idiot and to stay in touch. They then microwave a shit ton of popcorn and marathon House of Cards on Netflix, the both of them throwing popcorn at the screen when Frank is particularly Machiavellian and making incredulous comments at the ridiculousness of the American political system.\nHe gets in touch with Yakov, which is something he’s incredibly proud of himself for being able to do without chickening out, because the gruff man terrifies him. Yakov agrees to take him on, and they talk terms and fees, and within days he’s emailed a contract. Yuuri signs off on it and couriers it back, and that’s it, that’s a new phase of his life he’s put in motion with his own two hands.\nSo he packs up his things from his half of the room in Detroit, fitting five years of his life onto three A4 pages of a shipping manifest and twenty-two cardboard boxes bound for Moscow.\nIn a moment of weakness, he sends Victor a text: See you in three weeks.\nThere’s no response, but a couple of days after he gets a voicemail from Victor that’s nothing but the background noise of what sounds to be a club, bass thumping and glasses clinking. The message goes on for ten seconds or so without any sound from Victor before it’s cut off.\nYuuri’s disappointed, and it eats at him, but he tells himself not be stupid. What happened after the Grand Prix Finals was an anomaly. They were high on adrenaline and victory and the rush of endorphins. It didn’t mean anything.\nThey have a going-away party the night before he’s set to depart, and Phichit invites Leo, Guang Hong and Seung-Gil. They get roaringly drunk and chased off the campus quad for being too noisy. Phichit sobs into Yuuri’s favourite Mizuno hoodie and Guang Hong pats him on the back, while Seung-Gil hangs out on the periphery and tries not to die of embarrassment from the sheer ruckus they’re making.\nAt the Detroit Metro Airport, he buys a coffee and a copy of the new Murakami book, forcing himself to ignore the bright and lurid headlines of the gossip magazines. He catches sight of Victor’s silver hair on the cover of one of them, and manages to suppress the urge to pick it up.\nJust as he’s by the boarding gate to his flight, laptop stowed away in his backpack and phone about to be put on flight safe mode, he receives a text.\nIt’s simple enough, and Yuuri has to tell himself not to read too much into it, but it makes his heart skip a beat all the same.\nSee you soon, it reads, and there’s secret smile on Yuuri’s face for the duration of the twelve-hour flight.\n \n \n \n \n_____\n \n \n \n \nWhen he lands at Sheremetyevo International Airport, he turns on his mobile to a text from Yakov informing him that he’s sent someone to pick him up.\nYuuri’s sweaty and harried from attempting to wrangle his luggage around the crowds when he finally makes it out the arrival lounge, backpack on his shoulders, duffel bag looped around his arm, and large suitcase painstakingly towed along behind him.\nThe sea of Cyrillic letters is overwhelming and terrifying - he’d tried brushing up on his Russian, but he’d been so caught up packing and sorting out visas and sending his belongings by sea freight - so he’s left craning his neck and tiptoeing to see if he can spot anyone by the doors bearing a sign that even slightly resembles his name.\nIt’s not hard to spot Victor. For one, he’s in the middle of a huge mob of fans, taking photos, smiling, and signing posters and whatever else they thrust at him.\nYuuri’s not going to admit that he spots his hair first, the unique glint of silver haunting his dreams and catching his eye enough to turn his head.\nHe’s pretty sure Yakov would’ve mentioned if Victor’d been sent to pick him up. It’s not the sort of menial task he’d make Victor do, anyway.\nDetermined to make his way through the throng, he hefts all his bags, secures his grip on his suitcase, and lurches towards what he thinks might be the passenger pick-up area.\nHe makes it a good hundred feet before Victor somehow spots him, swooping in to relieve him of his suitcase.\n“Yuuri!” he exclaims. “There you are. I’m glad I spotted you before you vanished, didn’t Yakov tell you he was sending someone?”\n“He-he did,” Yuuri stammers, caught off guard, “I didn’t expect it to be you, though. You must be busy.”\nVictor waves a dismissive hand. “No, no, the season’s over, so I have some time off before training really picks up again, same as you. Is this all you brought?” He gives Yuuri’s three bags a skeptical eye.\nBlushing furiously and unsure why, Yuuri scrambles to explain, “No, I sent most of it ahead, it’ll be here in a week. These are just my skates and some clothes.”\n“Ah, good call,” Victor agrees, nodding, a twinkle in his eye. Yuuri finds himself wondering what has Victor in such a radiant mood.\nWary of the awkwardness of silence setting in, Yuuri rushes to ask, “How’ve you been?”\nThey draw up to the lift bank that serves the carpark, Victor sending a group of fangirls huddled nearby a charming grin. “Eh, mostly just relaxing, spending time with Maccachin,” he replies. The lift arrives, and they pile in along with an elderly lady and her son, who both also get beaming smiles from Victor.\nVictor lights up, as if suddenly struck by a thought, and whips his phone out of his coat. “Oh! Maccachin - that’s right, you’ve not met him. He’s my poodle, he’s so adorable, you’re going to love him.”\nThere’s no way Yuuri can mention that he knows all about Maccachin without it sounding weird. “I’m sure,” he responds, smiling up at him. “I’ve always loved dogs. I had one too.”\n“I want to see your dog! Do you have any photos?” Victor’s far too excited about this, and Yuuri squirms with the knowledge that he can’t show Victor a photo of Vicchan for obvious reasons. There’s little creepier than telling someone you owned a dog nearly identical to theirs and named it after them.\nThe lift dings, and the doors draw open. They trundle out, his three bags less cumbersome when spread between the two of them.\n“No, sorry, I don’t have any photos on my phone,” Yuuri apologises, internally breathing a sigh of relief.\n“It’s okay,” Victor reassures, “You can show me photos next time.”\nThey leave the lift bank and enter the carpark, and Victor’s Aston Martin sticks out like a very sleek, very expensive sore thumb.\n“Here we go,” Victor says, and loads his baggage into the back, waving Yuuri away when he tries to help.\nThey depart the airport and slide onto the highway, joining the hundreds of others journeying into Moscow proper. The quiet in the car isn’t awkward, but it’s not entirely comfortable.\nFidgeting with the door rest, Yuuri takes in the expensive pair of sunglasses that sit on the dashboard, and the tiny figure of a skater hanging from the rearview mirror.\n“I think I’ll be rooming in the same complex as Yuri Plisetsky,” he says, finally settling on a topic. “Are you two friends?”\n“Yuri?” Victor repeats, laughter in his voice. “Sort of, I guess. He’s more like a really annoying younger brother. He’s relatively harmless. Don’t worry about him.”\nFrom Yuuri’s interaction with Yuri in the locker room, ‘relatively harmless’ is not how he would choose to describe the youth.\n“Also, about that - I know Yakov was going to see about settling this, but I thought I’d let you know first - Georgi had a really bad breakup with his girlfriend last week and was kicked out of his flat, so he’s moved into what’s supposed to to be your studio.”\n“Oh,” Yuuri says, lost, all the doubt at the back of his mind about his move to Russia threatening to rear its ugly head. “I could get a hotel?”\nVictor flicks a quick glance at him and clears his throat, and Yuuri could swear he almost looks nervous. “I don’t know how long it’s going to take to sort this out,” he says, “But if you like, you’re welcome to stay at my place.”\nYuuri’s stunned into silence.\n“It’s not very big,” Victor continues, tone apologetic, “Although I do have a sofa that pulls out into a bed, and you’re welcome to that. I just thought it’d be a waste to get something so big when I’m away most of the season and travelling a lot.”\n“It’s fine, it sounds great,” Yuuri hurries to reply, not wanting to sound ungrateful. “Only if you’re sure it won’t be a huge pain. It’s really fine, though, I can stay at a hotel.”\nHe’d rather not, and it’d put a hole in his pocket that he won’t make his parents pay for. His winnings from the competitive season didn’t add up to much, once you took away all his coaching fees, equipment costs, and travel expenses.\n“Not at all!” Victor reassures. “And you can meet Maccachin, I know he’ll love you.”\nThe conversation peters off, and Yuuri relaxes into the idea. After that, it’s embarrassing how quickly the monotony of the scenery and movements of a car in motion lull him into sleep.\nWhen he wakes, it’s to the gentle weight of a hand on his knee and a warm voice in his ear.\n“Kotyenok, we’re here,” Victor says, voice low.\nYuuri opens his eyes in bleary blinks, the fluorescent light from the underground garage harsh and unforgiving on his tired eyes.\nVictor unloads all his luggage from the car, once again waving off any attempts by Yuuri to help. He concedes to Yuuri carrying his backpack, but hoists the duffel on his own shoulder and wheels the suitcase along himself.\nVictor’s flat may not be huge, but it’s an understatement to say it’s small. The living room is large and airy, the furnishing clearly designer and expensive, and the kitchen appliances are all gleaming and top-of-the-line. Yuuri would know, his family does run a restaurant in the bathhouse.\nIt’s clear the neighbourhood’s exclusive and liable to induce no small sense of postcode envy. Victor has a doorman, for crying out loud.\nThe flat itself is cosy and well-loved, but it doesn’t stop Yuuri from feeling out of place. He’d grown up in a sturdy but aged bathhouse, their furniture all worn but painstakingly restored and cared for. Their clothes were never designer, and while they never wore rags, his parents were always frugal. He’s not used to any of this.\nThe dog that comes bounding out of what he presumes to be the bedroom, however, does help. Tail wagging and tongue lolling, Maccachin takes to him as quickly as Victor’d promised, the easy acceptance going far towards putting Yuuri at ease.\nHugging his backpack to his chest, Yuuri ventures towards the sofa. “Can I put my bag here?” he asks, teeth biting uncertainly at his lower lip. The sofa is genuine suede, and there’s a worry that his bag might dirty it.\nThe question seems to spur Victor into motion, jumping to straighten a pile of magazines on a table and bending to scoop a pair of shoes up from their haphazard position on the floor. If Yuuri didn’t find the idea so absurd, he’d say Victor look flustered.\n“Of course!” he responds, “Make yourself comfortable, I want you to feel at home.”\nYuuri sets his bag gingerly on the sofa, pulling out his phone to send a quick text to his parents and Phichit to let them know he’s arrived safely.\nThe sky is black beyond the full-length windows, the lights of the city glowing softly amber. A glance at the clock on the kitchen wall tells him it’s nearly ten at night.\nHe asks if he can grab a quick shower, and escapes to the en suite off the master bedroom to rally and gather his thoughts. The water is searing against his back, turning his skin rosy with the heat.\nIt’s surreal. Two years ago, if you told him that he’d lose his virginity to Victor Nikiforov, win the Grand Prix championship, move to Russia, and then somehow end up invited to live with Victor, he’d have laughed in your face, slapped you for making fun of his dreams, and then probably broken down crying.\nHe shuts off the water, and steps out of the shower to stand by the bathroom sink. Yuuri studies himself in the mirror as he brushes his teeth, wondering what the hell Victor sees (saw?) in him that made him so desirable. His nose is too flat, his eyes a dull brown, his cheekbones non-existent. He exhales, a resigned puff of breath, and pulls on a comfy shirt and some pyjama pants.\nWhen he exits the bathroom, it’s to the sight of Victor reclining on the king bed in the master bedroom, book in hand and held aloft. The low lamplight throws dusty shadows around the room, casting Victor in a gentle, muted glow.\nYuuri’s struck by how much he wants.\nHe must stand there too long for it not to be weird, because Victor looks up, expression concerned.\n“Are you alright?” he asks, and Yuuri gulps, nodding furiously and blushing.\n“Yes! Sorry, I’m just very tired, and I wasn’t thinking straight, I didn’t mean to make you feel awkward.”\nVictor chuckles. “It’s fine, I was worried about you for a second. Do you need anything?”\n“No, but thank you. I think I’ll turn in for the night.” Yuuri turns to leave, damp bath towel clutched to his chest. He’s nearly out the door when Victor speaks, something in his tone that Yuuri can’t quite put his finger on.\n“You know,” he says, “My bed’s big enough for the two of us.”\nYuuri freezes, shocked into silence. He turns back to face Victor, finding him watching with careful eyes. Sensing his indecision, Victor presses his advantage.\n“We had fun at the Finals and Trophée, didn’t we, Yuuri?” he draws down the duvet and sits up slowly, almost as if he’s wary of startling him. Victor’s voice is husky and ripe with promise. “Now that we’re going to be training together, don’t you think we should get to know each other better?”\nIt takes Yuuri two tries to find his voice again. “I - I don’t want to impose,” he says, and his protest is weak even to his own ears.\n‘Never,” Victor insists.\nThey don’t fall asleep until past midnight, Victor teasing him with his talented hands and mouth, tongue showering his cock with attention and bringing him to that climactic, final peak. When Yuuri comes, Victor swallows all of it and presses feathery kisses to the skin of his hip, hand stroking gently as he comes down from the high of pleasure. Yuuri tucks a hand between them to find Victor hard and wanting, and teeth set to his lower lip, tries to replicate everything he remembers he likes, deft touches down his long length and teasing swipes of his thumb and just the barest hint of nails. Victor moans loud and low when he comes, catching his mouth in a deep kiss as his does so, murmuring endearments as they rearrange themselves for sleep.\nWrapped up in Victor, body lax with release and cocooned in the warmth of a body and the duvet around them, Yuuri falls into asleep like a pebble sinking to the bottom of a placid, cool lake.\n \n \n \n \n_____\n \n \n \n \nIn the intervening two months before training starts for the new competitive season, they fall into a comfortable routine.\nYuuri rises first, used to the bathhouse opening hours and early preparation times. He makes himself a cup of green tea, grabs a fruit from the bowl on the kitchen counter, and gets a pot of coffee going.\nGreen tea in hand, he wanders over to the sofa to flip the TV on, usually Russian children’s cartoons, and he follows along, repeating the Russian words as best he can, Japanese-Russian dictionary on the coffee table to look up anything unfamiliar.\nBy then, it’s usually pushing nine in the morning, and Victor meanders out, yawning and stretching. He pours himself a cup of coffee from the pot that Yuuri’s made, adding far too much sugar and just a splash of milk, and then joins him on the sofa.\nThey watch cartoons until nine-thirty, Victor helpfully correcting his pronunciation or explaining some Russian cultural reference he doesn’t get, and by then Victor’s hungry and demanding a proper breakfast. He takes them to the local bakery just down the street, dwarfed by the array of trendy shops and run by a sweet elderly couple. They buy a mountain of freshly-baked vatrushka and syrniki, returning to the flat to eat their spoils slathered in jam and cream.\nBy eleven, Victor’s insisting he has to show Yuuri some attraction or another, so they’re out the door and wandering the Red Square or Kremlin or Gorky Park, Victor taking a million photos like a tourist and making Yuuri pose for a few that all end up on Instagram. Or, if they’re feeling lazy, they skip going out and lounge around at the flat, reading or watch terrible daytime TV with plots Yuuri can’t keep track of, curled up together on the bed or sofa. (He doesn’t tell Victor, but he thinks those are the best days.)\nDinner’s usually around six or seven, and for all his shiny kitchen appliances, Victor can’t actually cook for shit, so Yuuri will throw something together, or they’ll head to the myriad of cafes in their neighbourhood, or if they’re really lazy, they’ll order in.\nAs a special treat a week after he arrives, Yuuri tries his hand at replicating his family’s famous katsudon, and it goes so well that Victor’s swooning and exclaiming vkusno! with every bite.\nThey’ll take Maccachin for his evening walk, and by the time they return it’s nearly ten and Yuuri will begin winding down for bed, and most nights Victor will sidle up behind him, breath hot on his ear, and suggest they do something else instead.\nIt’s all terrifyingly domestic.\nIt’s not that Yuuri minds, it’s that he’s certain that this play at domesticity won’t last, and Victor will soon return to his fast and dazzling lifestyle in the limelight.\nSo he clings to it as hard as he can and ignores the voice at the back of his mind whispering that hope is for fools, and when Victor fucks him at night he gives himself over completely, throwing himself into the pleasure with abandon.\nIf anything, it’s a consolation that the sex never stops being mind-blowing.\n \n \n \n \n_____\n \n \n \n \nHe first runs into Yuri Plisetsky again a week before their training is due to begin. He’s wandering around the rink, familiarising himself with the place, when he spots Yuri lacing up his skates on one of the benches.\nVictor’s wandered off to chat with some of the skaters he spotted on their way in, so Yuuri’s been left to his own devices.\nSummoning up his courage, and determined mend bridges now that they’ll be seeing a lot more of each other, he takes a deep breath and approaches him.\n“Hi,” he greets, the nervousness slightly colouring his tone. “Yuri Plisetsky, right? I think we got off on the wrong foot back in Marseille, so I wanted to reintroduce myself.”\nYuri looks up, expression partially concealed by his hood and fringe. “What are you playing at?” he asks, tone hostile.\n“I’m sorry?” Yuuri sputters, taken aback.\n“Victor may be too far gone, but I’m not an idiot. Fucking him isn’t going to make you a better skater, you know.” His voice is snide, words vicious.\n“Yuri, hvatit,” Victor snaps, drawing up behind them, voice raised.\nYuuri’s hands are trembling, and he laces them together to steady himself.\n“It’s alright,” Yuuri says, trying to intervene to diffuse the situation. “Let’s just go. Can we head back now?”\nYuri’s eyes widen, and his expression grows even stormier. “You’re living with him?” he bites out, tone incredulous, gaze hard on Victor.\nThere’s a heated exchange between them in Russian, too fast for Yuuri to follow or catch, and it ends with Yuri fuming, throwing his hands up in defeat, and stomping off.\nVictor takes his hands, gently unfurling them from where they’re tightly clenched together. Lacing their fingers together, he leads them out of the rink to the car.\n“I’m sorry you had to see that,” he sighs at length. “Yuri can be - he cares, in his own way, even about affairs that don’t concern him.”\nYuuri tries for a smile. “Yuuko’s a little like that, too. When she interferes, that’s how I know she’s looking out for me.”\nAt Victor’s look of relief, he continues, growing bold. “I get it. I know Yuri means well. I just don’t understand why he dislikes me so much.” Flicking a glance at Victor yields little information, his expression shuttered.\n“Don’t worry about it,” Victor says, and the reassuring beam he directs Yuuri’s way isn’t as convincing as he thinks it is.\nIt’s not a sense of foreboding, exactly, that churns low in his gut, but it’s something dangerously close.\nYuuri tries his best to follow the light chatter Victor peppers their ride back to the flat with, but his heart isn’t in it, and in that moment, hurtling along a Moscow motorway, the sky creeping into dark, he thinks he’s never felt so lost.\n \n \n \n \n_____\n \n \n \n \nTraining begins challenging and demanding, the pace Yakov sets barely letting up by the time the third week rolls around.\nHe has a morning run at eight, skating practice from eight-thirty, ballet with Madam Baranovskaya after lunch, and gym from four in the afternoon - six days a week, Monday through to Saturday. It’s a brutal regime that has him stumbling back to the flat most evenings feeling like he’s just gone rounds with a raging bull and lost.\nYuuri makes a few friends in the scant breaks in his intensive training regime. Georgi Popovich mostly hangs around the rink, alternating between being dramatically heartbroken and vowing to have his revenge on his ex, but Mila Babicheva takes an instant liking to him and pretty much adopts him, despite Yuuri being five years her senior.\nTheir busy schedules keep Yuuri and Victor apart most days, only skating together when Yakov calls for it, and the distance between them - and daily banality of living together - begin to take its toll.\nIt’s barely noticeable at first, just small things that niggle at Yuuri, like the way Victor leaves his coffee mugs all over the place once he’s done drinking, mugs half-full with days-old coffee sometimes revealing themselves under the sofa, on random shelves, or once, in the bathroom. And Yuuri, for all his neatness and attempt to keep himself as contained as possible, still living out of his bags and suitcase, twenty-two boxes of his belongings safely stored in a facility somewhere, can’t always keep up with Victor’s quirks.\nVictor, for example, can’t stand it when food in the fridge isn’t arranged just so, and the first time he snaps at Yuuri for placing the butter on the wrong shelf, it’s in March, five weeks since training began.\nYuuri apologises, of course, and resolves to be more careful, but the cracks are appearing faster than he anticipated, and when he offers to make his katsudon for dinner one Saturday night and Victor turns him down, saying he’s going out with some friends, Yuuri can only nod mutely and think, I thought I had more time.\nWhen Victor staggers back to the flat at four in the morning, he reeks of alcohol and general club funk. Unsteady on his feet, Yuuri has to loop a hand over his shoulder to guide him, the two of them shuffling awkwardly to the bedroom.\nTugging off his shoes and jeans, knowing that Victor hates to sleep in restrictive clothing, Yuuri’s about to turn the light off when Victor turns, cheek pressed onto the pillow, to look at him with lidded eyes.\n“Christophe?” he says, voice slurred, words blurring together. Yuuri freezes.\nBlood turned to ice in his veins, Yuuri can’t stop his heart from pounding, the rush of blood loud in his ears. He pulls away from the bed to sit on the sofa, hands balled into fists on his lap.\nIt’s nothing, he tells himself. It could mean a million different things.\nIt’s a sombre reminder that he’s not beautiful or gorgeous or naturally charismatic like the multitude of people who’ve captured and held Victor’s attention.\nHe’s just plain. Plain, anxious, introverted, boring Katsuki Yuuri.\nHe refuses to cry.\n \n \n \n \n_____\n \n \n \n \nIt takes Yuuri another week to muster the courage to move out of Victor’s flat, Georgi finally waking up from his fugue state to get a new flat and move out of Yuuri’s intended studio.\nVictor disappears to parts unknown on the morning of his move, expression stony, and Mila stops by to give Yuuri a lift to his new place so he won’t have to catch a cab.\nThere’s not much by way of belongings to move, given that his twenty-two boxes will be delivered the next day, so once Yuuri stows away all the clothes and toiletries from his suitcase, duffel, and backpack, Mila whips out a bottle of vodka and insists it’s Russian tradition to drink in honour of a new flat. She reminds him so much of Minako sometimes.\nHe’d usually refuse, but Yuuri’s heartsore and broken and figures it can’t hurt things.\nThey’re halfway through the bottle, Yuuri beyond tipsy and Mila looking none the worse for wear, when she brings it up.\n“Soooo,” she begins, “I’m not trying to pry, but Yuri mentioned you and Victor have a thing, and I can’t help but wonder if this sudden move is related to that.”\nYuuri sighs loudly, drunkenly waving a hand around. “Victor’s stupid,” he declares, “And everything sucks.”\nShe takes it as admission, and wriggles closer to hug him, patting him on the back. “Men are stupid,” she agrees, nodding sagely.\n“Hey!” he whines, and then, in a haze of inebriated reason, nods along. “They really are.”\n“Is that why you broke up with Victor?” she asks, voice gentle.\n“I  didn’t break up with him,” he corrects, tone petulant. Struck by a thought, he whips around to face her, overbalancing and nearly face planting on the floor. “Is that what he’s been telling people about why I left?”\nVoice modulated to be careful, she says, “Well, you were the one who moved out. It does look that way.”\n“Ugh,” Yuuri huffs, indignant. “You know,” he says, finger jabbing into the air in emphasis, “He was the one who - who did this, with his supermodels and perfect everything and Christophe and my katsudon. He never wanted to date me, we went to Bon.”\nIt sounded way more eloquent in his head.\nMila parses the ramble of information, nodding slowly along. After several seconds, she clears her throat and prods him into an upright position. “Now, you’re going to listen to me, and I know you’re not sober right now, but you’re going to remember this or I will kick your butt, okay?”\nYuuri querulously agrees, hugging his knees to his chest.\n“Right,” she continues. “I’ve trained with Victor since I was fourteen, and in the four years I’ve known him I’ve never seen him act the way he does with you. He’s never let anyone move in, never wanted anyone to move in, and whatever happened never, ever ended up at his place. I don’t know him as well as Yuri does, but it’s no secret that Victor’s a selfish person, even if he doesn’t mean to be.”\nMila hugs him tightly, and he’s so incredibly grateful to have her with him.\n“I know how you feel totally sucks right now, but I’m on your side. You don’t need Victor to achieve great things.”\nHis smile is tremulous and shaky through the tears, and Mila lets him cry on her shoulder, only leaving when he promises to text her the next day.\nAs she leaves, she makes sure he gets to bed alright and places two aspirin and a glass of water on the bedside table, shutting the light off as she goes.\n“Thank you,” he whispers, right before she gets to the door, and she turns to give him a soft smile before she’s gone.\nCurled under the duvet in another unfamiliar room, he tries to ignore all thoughts of Victor, and of how foolish he was to think he could meet him on the same playing field.\nWhen he finally manages to fall asleep, his dreams are unsettling and hazy, and he can’t recall any of it in the morning.\n \n \n \n \n_____\n \n \n \n \nBy seven in the evening, the rink is deserted, leaving Yuuri alone to skate slow, lazy laps on the ice.\nHis talk with Mila weighs on his mind, her words clear even through the fog of alcohol and tears: I’ve never seen him act the way he does with you.\nHe does a few jumps, a triple Lutz-triple flip combination, and then a quad toe-double toe. He lands them all, but it doesn’t give him the sense of satisfaction it normally does, his thoughts heavy and troubled.\nMila finds him just as he nails a quad flip, and he skates to a stop as she draws up to him on the edge of the rink.\nShe claps at his landing, letting out a low whistle. “I’ve seen you do that on TV, but it’s far more impressive in person,” she compliments. Hand shifting to her cocked hip, eerily reminiscent of Yuuko when she’s chiding, Mila frowns. “Don’t just disappear like that. I was getting worried.”\nYuuri blushes and apologises, chastened.\nWith her arrival, he’s struck by a sudden thought. “Mila,” he says, “There’s something I was working on back in Detroit before I moved here, would you like to - can you - ” he stops, at a loss for words.\n“It’s best if you just watched, okay?”\nMila nods, curious, and Yuuri glides back to the centre of the ice.\nThe music starts loud in his mind, the drifting notes plaintive and true. He slides into the steps, echoing and trailing Victor in his mind’s eye.\nThe melody rises and falls, and he soars and leaps and chases after him, every step lifted from his mind and rendered to reality through the medium of Yuuri.\nVictor’s jumps, glides, landings - even the arch of his fingers and curve of his arms - are perfectly replicated with his body.\nWhen it ends, the crescendo and notes of the music linger plangent and ringing in his ears, the rink silent but for his heaving breaths.\nMila has a hand pressed to her mouth, the other holding up her mobile, camera aimed at him.\n“Yuuri,” she whispers, awed. “That was beautiful.” She beckons him towards her, and he complies, the sound of his skates loud as he slides over to where she’s standing. Mila holds up her phone, pressing the playback button on the video. “Look. Your routine - everything - was flawless. I don’t think Victor could’ve performed a better skate of Stay Close to Me himself.”\nUnsure how to deal with the praise, Yuuri ducks his head and rubs at the nape of his neck. “It’s just something I was doing in my spare time,” he says, downplaying it.\nShe holds her phone up, the recording of him continuing to play on the small screen. “Can I post this online? People will love it.”\nFiguring it won’t garner much attention, Yuuri shrugs, and says, “Sure, go ahead.”\nHe heads back to his studio, and runs into Yuri on the stairwell.\nIt’s a relief that all he gets is a glare and get out of the way, loser, and when he showers that night, under the scalding hot spray, he can’t stop seeing Victor performing Stay Close to Me in his head, his body commanding and graceful and every inch the consummate, perfect figure skater.\n \n \n \n \n_____\n \n \n \n \nYuuri awakens to persistent knocking on his door.\nScrambling for his glasses, he shoves them on and rushes to get it open, taking a disorientated step back when he sees Victor just outside his tiny studio, looking as dishevelled as he’s ever seen him.\n“Yuuri,” Victor says, voice hoarse. “I’m sorry, I had to come to see you as soon as I saw the video. I didn’t mean to wake you.”\nConfused, only half-awake, and too undressed for this conversation, Yuuri gestures him into his flat, shutting the door behind him.\n“What video?” he asks, rubbing at his drowsy eyes and grabbing for a hoodie to pull over his ratty t-shirt.\n“This!” Victor exclaims, brandishing his mobile, and Yuuri spots the tiny figure of himself onscreen, gliding to the Victor’s steps of Stay Close to Me. The music playing over the recording must’ve been added by Mila.\nOvernight, the view count has jumped to over six million.\n“Oh my god,” Yuuri says, dumbfounded.\nComing close, almost toe to toe, Victor’s hand comes up to tuck under his chin, nudging it up to meet his gaze. When he speaks, his breath ghosts minty fresh.\n“Tell me you felt every second of that performance.”\nStill reeling and shaken, pulse rabbiting, Yuuri can’t hold his gaze, not when Victor’s looking him like that. He glances away, and Victor makes a frustrated sound, hand applying more pressure to bring Yuuri’s eyes back to his.\n“Why would you say something like that?” Yuuri asks, distraught. “Is this a test? Are you trying to test me?”\n“Tell me,” Victor repeats, voice riding the edge of dangerous.\n“I didn’t mean to,” Yuuri says, trying to step away. Victor steps after him, face alight with an emotion Yuuri can’t name.\n“Don’t run away from me now, not again,” he says. “I’ve had a year and half of you being distant and skittish, I deserve a straight answer.”\nBewildered by the confession and turn of events, Yuuri smacks his hand away. “I’ve been running away? You’re the one with the - ” he waves his hand at Victor, “ - the fast car, and the designer flat, and the celebrity exes, and the fancy restaurants.” He gestures at himself. “I’m just me, don’t you see? You were the one who kept leaving.”\nVictor runs a frustrated hand through his hair. He turns away from Yuuri, mouth opening, the closing, then opening again. Yuuri's never seen the man at a loss for a smooth line, a press-friendly quip. He whirls back to Yuuri, eyes alight.\n“Only because you never ask me to stay!” Victor jabs a finger at the door. “You think any of that matters to me? I’ve spent over a year trying to make you see that I think you’re special. I think you’re perfect.”\nA hot tear runs down his face, and Yuuri angrily brushes it away with the back of his hand. “I’m not asking you to change - I never - I want you to stay who you are. If I seemed distant, or if I ignored you - I didn’t want you to see my shortcomings.”\nVictor comes up to him, hands cupping his face. He brushes away Yuuri’s tears with his thumb, expression softened. “Don’t shut me out. Open up to me, hold on to me, and I promise I’ll meet you where you are.”\nYuuri’s hand comes up to rest over Victor’s own, and he smiles through the haze of his tears. “I’m sorry. I’ve - This is all so stupid.”\nSwooping down to catch his lips in a devastating kiss, Victor pulls back just enough to say, “No, tigryenok, this is what love is.”\nStunned, Yuuri blinks up at him, wide-eyed.\n“Are you sure?” he asks, voice quivery.\n“I’ve never been surer,” Victor answers, and presses their lips together, warm and firm and right.\n \n \n \n \n_____\n \n \n \n \nVictor goes on to compete in his final competitive season, ending with gold medals in the World Championships, the European Championships, the Olympics, and the Grand Prix Finals. He blazes through records, personal and world, and drives the media wild. When he announces his retirement from professional figure skating, he simultaneously announces that he will begin a career a coaching, starting by taking on Katsuki Yuuri.\nYuuri retires three years after Victor does, two more Grand Prix gold medals to his name and numerous titles in the World and Four Continents Championships under his belt. Between the two of them, they have more medals than they know what to do with.\nThey have a small civil ceremony on a beach in Hawaii, and they honeymoon in Japan, stopping by Yu-topia so Victor can try the original Katsuki katsudon for himself.\nTheir life isn’t perfect, not by a long shot, but it’s wonderful and happy and they’re both in love, and they’re both doing what they do best: staying close to each other.\n \n \n\nFin.\n"
}