{
    "id": "864147",
    "url": "https://archiveofourown.org/works/864147?view_full_work=true",
    "author": [
        "birdsofshore"
    ],
    "title": "Hungry",
    "rating": "Mature",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings",
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Harry Potter - J. K. Rowling"
    ],
    "relationships": [
        "Draco Malfoy/Harry Potter",
        "Hermione Granger/Ron Weasley"
    ],
    "characters": [
        "Harry Potter",
        "Draco Malfoy",
        "Blaise Zabini",
        "Ron Weasley",
        "Hermione Granger",
        "Seamus Finnigan",
        "Dean Thomas",
        "Millicent Bulstrode",
        "Daphne Greengrass",
        "Minerva McGonagall",
        "Theodore Nott",
        "Horace Slughorn"
    ],
    "additional_tags": [
        "Hogwarts Eighth Year",
        "Forced Bonding",
        "Potions Accident",
        "Fluff and Smut",
        "Slytherins Being Slytherins",
        "First Time",
        "Hand Jobs"
    ],
    "language": "English",
    "series": "",
    "published": "2013-06-30",
    "completed": null,
    "words": "24,249",
    "chapters": "1/1",
    "comments": "379",
    "kudos": "19,162",
    "bookmarks": "3,130",
    "hits": "312,481",
    "summary": "<p>The first thing Harry knew about it was when he woke up lying on a bed in the hospital wing, with his arm firmly stuck to the scrawny, milk-white arm of Draco bloody Malfoy.</p>",
    "notes": "<p>Author/Artist LJ Name: <a href=\"http://birdsofshore.livejournal.com/\" rel=\"nofollow\">birdsofshore</a><br>Prompter: meglw0228<br>Prompt Number: 4<br>Title: Hungry<br>Pairing(s): Harry/Draco, Ron/Hermione<br>Summary: The first thing Harry knew about it was when he woke up lying on a bed in the hospital wing, with his arm firmly stuck to the scrawny, milk-white arm of Draco bloody Malfoy.<br>Rating: NC-17<br>Disclaimer: All Harry Potter characters herein are the property of J.K. Rowling and Bloomsbury/Scholastic. No copyright infringement is intended.<br>Warning(s): None<br>Epilogue compliant? No<br>Word Count: ~24,000<br>Author's Notes: Thank you so much to <a href=\"https://archiveofourown.org/users/Omi_Ohmy/pseuds/Omi_Ohmy\" rel=\"nofollow\">Omi_Ohmy</a>, for her sterling work, and patience, as always; to <a href=\"https://archiveofourown.org/users/Geneva/pseuds/Geneva\" rel=\"nofollow\">Geneva</a>, who rescued me from panics and tightened a few things up at the last minute; to the prompter, for this lovely excuse to play around in 8th year; and to the mods, for all their kindness and hard work. I went a bit berserk at the end with last-minute edits, so any errors are distinctly my own.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
    "text": "The first thing Harry knew about it was when he woke up lying on a bed in the hospital wing, with his arm firmly stuck to the scrawny, milk-white arm of Draco bloody Malfoy.\n \n\"What the—?\" He struggled to get up, but only got as far as sitting on the bed, with his arm uncomfortably bent, and still very much attached to Malfoy. \"Get off me, you git!\"\n \nDraco's face curled into a scowl. \"I'd like nothing better, Potter, but unless I cut off my arm – and believe me, I am considering it – we are, literally, stuck here.\"\n \nHarry jerked his arm furiously away from Malfoy, but succeeded only in wrenching both of their arms painfully at the socket.\n \n\"Stop it, you idiot!\" hissed Malfoy. \"Can't you see we're attached? Calm down and stop yanking me around.\"\n \nHarry stared at him in disbelief. He could hardly believe his eyes, but what Malfoy said was true. Their skin was absolutely stuck together, from elbow to wrist, so that when he pulled, the skin stretched in a painful and rather creepy way. Malfoy sat up, with some difficulty, so there was no pull on Harry's arm any more, but they were still joined. Harry shuddered and again pulled violently to get his arm free. Malfoy shouted, a cry of pain and anger, and Madam Pomfrey approached their bed at a half-run.\n \n\"Boys! Boys, stop that! You'll injure yourselves! No fighting!\"\n \nMalfoy's face screwed up in frustration. \"I wasn't fighting; it's Potter here who can't grasp simple facts, as usual.\"\n \nMadam Pomfrey moved closer to Harry, her wand tracing shapes in the air. \"Be still, both of you. Are you senior-year students, or brawling brats? I'll just check you over, Potter.\"\n \n\"What's happened?\" demanded Harry. \"Why are our arms like this?\"\n \n\"Sssh,\" said Madam Pomfrey, concentrating on the pinkish glow her wand had conjured around Harry's head. \"You've been unconscious for nearly an hour, Potter, I need to do some tests. Seems like there's some memory loss, too.\"\n \nHarry quietened reluctantly. The flickering light around his head was sort of relaxing. He found a memory sidling back into his consciousness, as if it had been hiding in the shadows. Potions class... something brewing in the cauldrons... a splash... him leaning over... then an almighty bang, and a searing pain along his forearm.\n \n\"Potions!\" he burst out. \"Was there an explosion?\"\n \n\"Please try to remain calm, Mr Potter.\" The pink light faded to nothing and she tucked her wand away in her apron. \"You're not doing so badly, considering, but getting over-excited is not going to help you recover from the shock. Yes, there was an accident in your Potions class. Professor Slughorn is going to be up in a little while to discuss the matter with you. But meanwhile, as I understand it, you are stuck here with Mr Malfoy for the foreseeable future, so you had better get used to it.\"\n \nShe moved around the bed, arranging pillows and straightening the sheets. \"There! Settle down again, both of you, and try to rest. You can read, or talk quietly. There are magazines and some pumpkin juice on the cabinet, there. But don't get agitated or disturb the other patients. Please act your age, and think yourselves lucky you aren't harmed!\"\n \n\"Not harmed!\" said Harry indignantly, but Pomfrey was already hurrying towards another bed, where a frail-looking first-year was beginning to vomit into a bowl.\n \nHe turned to Malfoy, who was sinking back against the pillows, his eyes closed as if to block out the whole situation. \"Do you remember what happened? Brewing Skele-Gro, weren't we?\"\n \nMalfoy frowned. \"Yes, and your delightful pals decided to play a joke on me. Their wit knows no bounds.\"\n \nHarry got a flash of memory – Dean snatching something from the table and throwing it into the cauldron where he, Malfoy and Michael Corner had been working together.\n \n\"Dean threw something in our potion! What was it?\"\n \n\"It was my family ring with the Malfoy crest. I always take it off when I'm working with Billywig slime – in case it gets discoloured – and he thought it would be hilarious to annoy me by grabbing it and chucking it into the cauldron. What an absolute fuckwit. The dimmest first-year knows not to add random ingredients to what's being brewed. I suppose we're lucky we're not all dead.\" His lips twisted in an unfriendly smile.\n \nHarry looked at his and Malfoy's arms again with a shudder. It was hideous. There was no way to comfortably move his arm at all without Malfoy's arm getting dragged along for the ride. They were completely joined, from the knobs of their elbows, down as far as their wrist bones. Careful to keep his arm still, Harry moved his fingers experimentally; they instantly brushed against Malfoy's in a way that made them both start and shiver. Ugh. Bad enough to be unwillingly attached to anyone like this, but blast his luck, it would have to be Malfoy...\n \n\"So... what did happen? We're not dead, but this isn't much better... \"\n \n\"I can make a guess. My ring is made from iridium, jade, and onyx, so of course the iridium reacted with the Erumpent horn unstably, and there was a violent thermal reaction.\" He regarded Harry's confused look with derision. \"It. Blew. Up. Simple enough for you, Potter?\"\n \n\"We're not hurt, though, just stuck—\"\n \nDraco waved his free hand dismissively. \"Some of the other ingredients must have formed some rogue compound or other. The onyx and the dittany for instance. Whatever happened, we became the target for the adherent agent.\"\n \nWho swallowed the textbook? Harry thought crossly, and Malfoy rolled his eyes at his lack of response. \"Keep up, Potter. We were leaning over the cauldron and it splattered all over us, yes? Your bloody arm was pressing against mine... you never give me enough space to work in.\"\n \n\"There never is enough space in Potions!\" Harry protested. \"It's not my fault. We all need to see what's happening when we're brewing.\" He didn't add that it gave him a shameful feeling of satisfaction to know that it annoyed Malfoy when you jostled him a bit. Well, he deserved some kind of recompense for the fact that Slughorn made them work together nearly every week.\n \n\"Anyway, the potion covered our arm and somehow we're stuck. It's intriguing... I'd like to experiment some more with the onyx and the staghorn... I could be doing it now, if I wasn't tangled up in yet another fucking mess involving our dear Saviour.\"\n \n\"It's not my fault, Malfoy! I didn't touch your precious ring. Anyway, if you didn't wind the others up so much....\"\n \n\"Oh, I see, it's my fault for just being there minding my own business, is it? Well, pardon me for trying to actually study, rather than spending this year pissing about like a complete simpleton.\"\n \n\"That's what I mean!\" Harry twisted around so he could face Malfoy more easily. \"You act so superior, like you're too good to joke around and have a bit of a laugh sometimes. You never join in with anything. We're all meant to be trying to get along!\"\n \nMalfoy laughed, but there was little humour in it. \"Getting along? Yes, that's believable. We all know what people think of Slytherin House, and we're treated accordingly.\"\n \nHarry scowled. \"Some people make it harder than others to like them, Malfoy.\" He tried to get off the bed, but remembered too late he was pinioned there with Malfoy. He tugged crossly, ignoring the vaguely nauseating feeling as their joined arms moved together. \n \n\"And some people think they're above criticism. How nice for you to have won the war, so you can go on bullying whoever you feel like.\" Malfoy tugged his arm back violently, setting Harry off-balance and tipping him face first onto the bed. Harry scrambled to get up, swinging wildly at Malfoy with his free arm. Luckily for him it was his right one, and he managed to connect nicely with Malfoy's pointy jaw, before Malfoy shoved him and pushed him onto his back, with his free arm trapped between them.\n \nHarry felt a bit surprised at how good it felt to be fighting like this with Malfoy again. Infinitely better than the mix of suspicion and tolerance with which they usually treated each other since returning for their final year. Malfoy appeared to be trying, and failing, to get his wand out, while Harry was wondering if he could maybe bite the bastard, when Madam Pomfrey strode over, as cross as Harry had ever seen her.\n \n\"What is the meaning of this?\"\n \nMalfoy still struggled on top of Harry, pulling their joined arm to and fro angrily in an attempt to reach his wand, but Madam Pomfrey drew her wand and pointed it at them. \"Do not make me Body-Bind the pair of you. I will if I have to!\"\n \nMalfoy rolled off Harry awkwardly, panting and red-faced.\n \n\"I cannothave this disruption and lack of discipline in my infirmary,\" Madam Pomfrey went on, glowering at them both. \"You have both had a battering today – being knocked unconscious by a potions accident is no laughing matter – and we have yet to discover if there are other physical effects. You need to rest, and yet you are brawling like a couple of third-years, and disturbing my other patients to boot!\"\n \nProfessor McGonagall appeared at Madam Pomfrey's shoulder. Her look of concern was replaced with one of anger as she took in the boys' dishevelled appearance and antagonistic expressions, along with Madam Pomfrey's stern look.\n \n\"What's this? Fisticuffs?\" she asked with a look of disapproval. \"Really, gentlemen. I thought we had all put such animosity behind us this year.\"\n \nHarry felt shamefaced and glanced at Malfoy, who was lying against the pillows, their joined arms at an uncomfortable angle.\n \n\"Professor Slughorn reports that the effects of this unfortunate incident will almost certainly wear off within forty-eight hours.\"\n \nMalfoy slumped a little further into the pillows. Harry felt a mixture of horror at being stuck like this for a further two days, and utter relief that it wouldn't be permanent. He guessed Malfoy was feeling something similar.\n \n\"'Almost certainly'?\" asked Malfoy. \"Does that mean...?\"\n \n\"You can discuss all the details with Professor Slughorn later,\" McGonagall said briskly. \"Now, can you two be trusted to behave decently for the rest of the afternoon? The best thing would be to get some rest. We've enlarged this bed, so there's plenty of room for you to lie down together—\"\n \n\"But Professor, we can't—\" \"No way!\" Harry and Malfoy protested simultaneously.\n \n\"Oh for goodness sakes!\" McGonagall looked at Madam Pomfrey, who shook her head.\n \n\"I won't have them here disturbing everyone, Minerva. Lucinda Crowley is very unwell and I can't be checking every five minutes to see if these two are about to start mauling each other again. It would be better for them to rest here, but I suppose there's no reason they can't return to quiet activities. Come and see me immediately, boys, if you feel anything other than your usual selves. And no charging about on the Quidditch pitch, or anything like that.\"\n \nHarry and Malfoy both moved to stand up on opposite sides of the bed, but were prevented by their bonded arms. They glared at one another. That was a perfectly good hand of his on the end of that arm, Harry thought. A hand which he needed on a regular basis, like now, for instance. And he couldn't even use it, because it was dangling, just abandoned there next to bloody Malfoy's hand. In the end Harry scrambled over to Malfoy's side, and they both stood up, almost shoulder to shoulder.\n \n\"What classes do you have this afternoon?\" McGonagall asked.\n \n\"Charms,\" Harry replied.\n \nMalfoy shrugged. \"A free study period.\"\n \n\"Very well. You can both go to Charms. Mr Malfoy, you may either study quietly or follow along with the lesson, it's up to you. Are you both right-handed?\"\n \nThey nodded. \"Well, Draco, you have got the worst of it here. Your right arm is unfortunately the affected one, while Harry's is free. I expect you to help him out, Harry, wherever necessary. Magic with your non-wand arm can be tricky, not to mention other activities.\" She looked at them seriously over her glasses. \"You are going to have to learn to work together, you know, unless you want the next forty-eight hours to be a good deal more difficult than they need to be. It strikes me it would have been better for everyone if you had learned this a long time ago.\"\n \n***\n \nEntering the Charms classroom while physically attached to Draco Malfoy was not one of the most enjoyable experiences of Harry's life. The outburst of catcalling, laughter and applause was overwhelming, and he thought about turning around and walking straight out again. Professor Flitwick tried to gently restore order, but in the end it was Hermione getting to her feet and enquiringly loudly \"Have you quite finished?\" that quelled the worst of the ruckus. The whispers, giggles and stares continued throughout the class, however, and Harry felt his skin crawling with embarrassment and tension.\n \nMalfoy was seated next to him, thin-lipped and silent. He had a book perched precariously on his knee and was turning the pages, with difficulty, with his left hand. Their joined arms rested stiffly on the desk in front of them, both being careful not to touch the other with their fingers. Every now and then Malfoy would forget that he and Harry were connected, and his right arm would twitch for a second in motion, then fall back down as if it were a bird discovering that its wings had been clipped.\n \nRon and Hermione sat at the nearest desks and as usual during Charms class, they were all able to talk quietly together.\n \n\"What is Slughorn doing about this?\" Hermione hunted in her capacious bag. \"I've been to the library, and found a few books that might be useful. There's one called Potions Gone Wild, which is about curing accidental damage such as this, and—\"\n \n\"Crikey, mate, talk about rotten luck.\" Ron interrupted. \"Sharing an arm with the Ferret? That's harsh.\"\n \n\"I can hear you, you know,\" Malfoy hissed back. \"My ears weren't affected. And it's not exactly a dream come true for me, either.\"\n \n\"They think it'll just wear off, in a couple of days,\" Harry explained. Slughorn had stopped them on their way to Charms and explained briefly the benefits of simply waiting it out.\n \n\"You're quite right, Mr Malfoy, ten points to Slytherin!\" Slughorn had announced. \"The onyx in your ring reacted with the Skele-Gro. Onyx lends strength or permanence, and dittany is used for regrowth, usually of skin. Together with the staghorn in the base, it's formed a powerful healing agent... the potion has used your proximity and tried to bond your flesh, as if your two arms were a wound that needed healing.\"\n \nMalfoy looked as revolted as Harry felt.\n \n\"The effects of this type of healing potion only last a couple of days, usually... say three at most.\" Slughorn went on. \"Then the body's own natural abilities take over, of course... marvellous, really. Usually your wound would be well on the way to healing by then, and so you'd notice little or no difference when the potion wears off, but in your case, gentlemen, when the potion stops working, the skin will just return to normal, and you'll be free again. Well. We hope so, in any case, or else you'll be stuck like this until we can think of something different!\" Slughorn had let out a long chuckle. Surprisingly, neither Harry nor Malfoy found it terribly amusing.\n \n\"You'll start to see more changes over the next few hours, I would expect. You'll notice that the skin is starting to knit together where your arms are joined.\" He had gestured at the strange new web of skin that was forming in between their two limbs. It was slightly translucent, with veins showing through the surface, as if it belonged to some undeveloped creature that had been born too soon. \"This will increase and become stronger. I can't wait to see if there are any other effects!\" he had continued excitedly, oblivious to Malfoy and Harry's stony faces. \"Quite fascinating.\"\n \n\"I don't think they're planning to do anything in the meantime,\" Harry told Hermione gloomily. \"You know, in case it just prolongs it, or makes it worse.\"\n \n\"Well, I think it's dreadful.\" Hermione frowned. \"They can't just leave you like this. What's going to happen at bedtime?\"\n \nHarry flushed hotly. He had been wondering along the same lines himself. He couldn't imagine he and Malfoy managing to spend the night together without killing one another, but he could picture all too well the horrific teasing that would ensue when it were known that Malfoy and he would be sharing a bed that night. Perhaps they could just stay awake for forty-eight hours. At that moment it seemed the best course of action.\n \nMalfoy leaned over and spoke to Hermione frostily. \"How about you keep your nose out of this? Surely you can see the whole business is troublesome enough for Potter and I, without everyone gossiping and prying into what is clearly a very private affair?\"\n \n\"Private affair!\" Ron snickered at Malfoy's choice of words, but ceased abruptly when he saw not only Malfoy, but also Harry and Hermione glaring at him. \"Er, sorry. It was just... er, never mind. Sorry.\"\n \nHermione nodded solemnly as if making a deal. \"OK, Malfoy. But I'm going to have a good look in these books, anyway. I borrowed Most Potente Potions from the Restricted Section... \" She rummaged in her bag again, and, shockingly, spent the rest of the lesson reading under the desk, instead of revising Memory Charms as they had been instructed to do.\n \nHarry sneaked a look at Malfoy, surprised and grateful that his intervention had led to the subject being dropped. Harry was still accustomed to watching Malfoy – only when he had nothing better to do, of course – and he had noticed how Malfoy had kept himself aloof much more this year, seeming to shy away from the natural banter that came with communal living. Whereas once he would have been the one making others the butt of his jokes, now he frowned and turned away if he witnessed teasing, and if anyone tried to start any kind of practical prank, he usually slipped away out of the room as soon as he could.\n \nAnother member of the Charms class who was not joining in with the laughter on this occasion was Dean. He kept his distance, and looked very subdued, but did take a moment to catch Harry's eye and mouth \"Sorry.\"\n \nHarry wondered what had happened after he and Malfoy were taken up to the Hospital Wing. He knew the staff took an especially dim view, this year, of the kind of pranking that Malfoy often had to endure. In fact they preferred to call it 'inexcusable bullying'. Harry shifted uncomfortably in his seat. Malfoy frowned at the distraction and tried to turn another page. His fingers and thumb fumbled at the corner, trying to separate the leaves. Harry could well imagine how frustrating it would be, with only your left hand. And McGonagall had asked him to help out.\n \n\"Do you want me to do that for you?\" he asked.\n \nMalfoy gave him a particularly nasty look. \"No, thank you very much. I think I can just about manage to deal with the exhausting challenge of reading a book.\"\n \nHarry resisted the urge to bite back with an insult. Malfoy had illustrated the problem perfectly: there were some people that you just couldn't help, no matter what McGonagall had said. He turned his chair slightly away from Malfoy and sat facing as far in the other direction as he could manage. At least if he didn't have to see the prat... unfortunately, as Harry was all too aware, he could still feel Malfoy, the peculiar sensation pulling at his skin every time Malfoy so much as coughed, or moved restlessly, reminding him of their situation and the hours ticking down until, he presumed, they would be forced to be alone together.\n \nHe sneaked another look at the bizarre web of skin bonding them together. It had definitely grown thicker and stronger since they had spoken to Slughorn; in fact it was starting to become more difficult to know where his arm ended and Malfoy's began. Looking at it, he almost imagined he could feel Malfoy's pulse beating alongside his own. He shivered and returned to his work, however not before noticing that goose pimples had broken out not only on his arm, but, as if in sympathy, on Malfoy's paler, narrower arm as well.\n \n***\n \nHarry breathed a sigh of relief when Charms was over, but quickly realised that he and Malfoy had another challenge to overcome.\n \n\"Dinner time,\" he said. \"How are we going to manage this?\"\n \n\"If you think I'm going to walk into the Great Hall attached to you, and sit down at the Gryffindor table, Potter, you can think again. We'll sit with my friends, of course.\"\n \nThe number of Slytherins who had returned after the war was depleted, and those who had resumed their studies tended to stick together in small groups. Malfoy usually sat with Theo Nott, or, if he wasn't around, Blaise Zabini. Harry didn't relish the thought of having to make polite mealtime conversation with either of those two.\n \n\"What?\" Harry faced Malfoy angrily. \"You can't just decide where we're sitting. We need to take turns.\"\n \n\"Yes, well, we've spent the last hour with your charming friends, and we saw how well they treated you. A pack of grindylows would have shown more loyalty and discretion. It's my turn to choose now, and we're spending the rest of today with Slytherin House.\"\n \nHarry was horrified. \"The rest of today! That's not fair. If we sit with your friends for dinner, we should go to Gryffindor afterwards. You can't have the whole evening.\" And night, his mind helpfully added. Where will you be spending the night?\n\n \n\n\"OK.\" Malfoy thought quickly. \"Eat with Gryffindors, then to the Slytherin Common Room after dinner.\" Harry opened his mouth to protest. \"You said to take turns, Potter! I'll eat with all your Weasleys and whoever else you sit with. Come on, we'll be missing the first course.\"\n \nWalking was not a graceful or comfortable undertaking. Every movement tugged at the place where their arms were bonded, and they seemed unable to synchronise their steps. Malfoy wasn't that much taller than Harry, but his legs seemed impossibly long, and his strides left Harry scrambling to keep up.\n \n\"Come on, Potter,\" he urged. \"This won't get any easier by dawdling. Let's get it over with.\"\n \nHarry took a deep breath as they walked into the Great Hall. Nearly everyone else was already seated, and a mass of heads turned to face them as they entered. Harry could feel the tension in Malfoy's arm, and an uncomfortable tug against his skin as Malfoy braced his shoulders and stood very erect.\n \n\"Lead on, Potter. Sit down, for god's sake. We'll be less conspicuous at the table.\"\n \nHarry slipped in less than easily at his usual place, grateful to Ron for moving over to make room for them both. A buzz of excitable conversation rose all around them, but in response to a pointed cough from McGonagall, the hubbub dampened to a murmur, and one by one, people returned to their meals, shooting only the occasional inquisitive look.\n \n\"McGonagall's on the warpath.\" Ron offered Harry a dish of potatoes and helped him to pile some onto his plate. \"Stood up and said anyone caught giving either of you a hard time will be for it.\" He lowered his voice slightly, but not much. \"Eat up, mate. If you can, that is. Never thought I'd be eating dinner with him sitting there.\"\n \nMalfoy clearly heard, but only frowned at his empty plate. He reached for a large serving dish filled with stew, but struggled to use the ladle with his left hand. Some meat dropped onto the tablecloth in front of his plate, with gravy splattered around it. There was a general sniggering, and Malfoy's lips thinned. He put the ladle down with a clatter and placed his free hand in his lap, looking away at a spot on the opposite wall.\n \nHarry looked helplessly at Malfoy, but Hermione leaned over and Vanished away the greasy mess. She took up the ladle. \"Here you are, Malfoy.\" She gave him a generous helping. \"Potatoes?\" Malfoy stared for a moment, then shook his head, a tight little movement that jarred Harry's arm. Hermione filled Malfoy's glass with pumpkin juice, then went back to talking to Parvati about her Charms essay.\n \nMalfoy hesitated, then carefully and painstakingly scooped up a mouthful. After successfully eating a bit of stew, he lifted his glass, and took a sip of juice.\n \n\"You don't like pumpkin juice,\" Harry blurted.\n \nMalfoy's eyebrows, which had been drawn low with concentration, rose up near his hairline. Hermione stopped eating and looked at the two of them, as did several others around the table.\n \n\"I– I just noticed,\" floundered Harry into the sudden silence. \"You never have pumpkin juice.\"\n \nRon had paused mid-chew, and had the unmistakeable look of a man whose mouth is far too full of mashed potato.\n \n\"I just notice stuff sometimes.\" Harry repeated, trying to sound as if he didn't know what people were looking like that for.\n \nMalfoy put down his juice with great care.\n \n\"I prefer water.\" He looked from Harry to Hermione, and gave her a serious little smile. \"But, thank you, Granger. It was kind of you to help me.\"\n \nRon took another forkful of mash and tried to shovel it into his mouth, before realising it was already at capacity. He resumed chewing with determination.\n \n\"Bit awkward, this,\" he managed to say, as soon as he could form words around the mass of potato. He swallowed noisily and waved a fork in the direction of Harry and Malfoy. \"This whole business. Very... awkward.\"\n \n***\n \nHarry was wishing heartily that he had endured dinner with the Slytherins without complaint, as then he would be entering the lovely, familiar portrait-hole about now, rather than descending deep into the castle, headed for the Slytherin common room. He was blowed if he was going to let Malfoy see his apprehension, though.\n \n\"Nervous, Potter?\" Malfoy enquired, looking less anxious than he had done all day. \"This will be a new experience for you, at least.\"\n \n\"Not really,\" Harry said, scrambling to keep stride with Malfoy. \"I've been in your Common Room plenty of times, if that's what you mean.\" It was only a small exaggeration, after all.\n \nMalfoy stopped stock still. \"You've what?\" he asked in complete disbelief.\n \n\"Yeah, I've been down there before,\" Harry shrugged. \"Didn't think much of it, to be honest.\"\n \nMalfoy shook his head. \"No, you have not, Potter. You might think you own this place, and god knows Dumbledore let you do what you pleased, but you have never been in the Slytherin Common Room.\"\n \nHarry was sure he could feel Malfoy's pulse quickening against his wrist. Or was it his own?\n \n\"I have, and so has Ron, and what's more, you let us in, Malfoy, and we sat there and had a lovely chat.\" Harry grinned at the memory.\n \n\"You're delusional.\" Malfoy shook his head.\n \n\"There's a portrait of Salazar Slytherin above the fireplace. And candelabras with snakes twined round the candles. And a dirty great tapestry of a load of people torturing an old man.\"\n \n\"The Trial of Johannes the Muggle-lover?\" Malfoy looked very bemused. \"How on earth do you know about that?\" He shook his head again. \"Anyway, Potter, stop stalling and let's get inside. I can't wait to relax and talk to some sensible people at last.\"\n \nHe tugged Harry towards the stone entrance. \"Inter-house Unity,\" he announced, then sneered at Harry's surprise. \"Whoever thought that password up had a sense of humour.\" They stepped in through the passageway and Harry saw the oppressive, green glow he remembered clearly from second year, and the windows with their view of the Great Lake which dominated the room\n \n\"Draco!\" Blaise Zabini's eyes lit up as he saw them walk in. \"And you've brought a friend. How very nice.\"\n \n\"Evening,\" Malfoy sauntered towards the large leather sofas where Zabini, Millicent Bulstrode, and Daphne Greengrass were lounging together. Harry had no choice but to follow, stumbling a little as he tried to keep pace with Malfoy. Daphne snickered behind her hand, while Millicent stared rudely.\n \n\"Is he really stuck to your arm, Malfoy?\" Millicent asked, with a disgusted expression. \"You both look totally stupid.\"\n \n\"Yes, thank you for that, Milly. It's not the best look I've ever managed, I agree.\"\n \nMillicent leaned closer and peered at their arms. \"Yuck. That's completely gross.\"\n \nHarry could feel Malfoy bristling beside him. Just ignore them, he thought, trying to silently convey his thought to Malfoy.\n \n\"Dear me, dear me, this is very unfortunate. What an unpleasant accident.\" Zabini looked as if he had never felt more delighted.\n \n\"Come and sit down, Draco, and bring your guest. You can tell us all about it.\" Daphne patted the seat beside her. Malfoy ignored this, but leant against the arm of the sofa.\n \n\"Where's Theo?\" he asked.\n \n\"Theo?\" Blaise repeated wonderingly. \"Now, ladies, where would Theo have got to?\"\n \nDaphne looked bored. \"He wasn't feeling well, remember? He's gone to lie down. Hope it's nothing catching.\"\n \nHarry wondered what would happen now. From what he'd seen of Malfoy that year, he mostly stuck with Theo Nott or kept his own company. They seemed an oddly good fit: both wanting to concentrate on their studies, with Malfoy's new seriousness and aloof tendencies mirroring Nott's own personality. Nott's family were Death Eaters, too, Harry recalled. In fact he was pretty sure Nott's father had been sent to Azkaban at the same time as Lucius Malfoy. Perhaps they might leave now, Harry thought hopefully, as Theo was not around.\n \nMalfoy seemed to be pondering the same thing. He looked uncertainly at the door leading to the dorms. Zabini was craning around Malfoy to smile unpleasantly at Harry. Harry, who was standing a little way back, realised this might look as if he was trying to hide behind Malfoy. He stepped forward until he was shoulder to shoulder with Malfoy again.\n \n\"Likes to keep close to you, doesn't he?\" said Zabini with a leer. \"So, are we to have the pleasure of the Saviour's company all night?\"\n \n\"It'll be an awful squeeze in Draco's little bed, won't it?\" asked Daphne happily.\n \nDraco's knuckles whitened as he leant on the sofa.\n \nZabini winked. \"Ah, it surely won't be the first time he's had an overnight visitor in there.\"\n \nDaphne and Millicent smirked, while Zabini leaned back on the green leather, as if settling in for a pleasant evening. \"Oh, but this is not for ladies' ears. You don't want to hear what naughty boys get up to at night behind closed doors, do you, Daphne?\"\n \nMillicent whispered into Daphne's ear and they both laughed. Harry thought he had never heard such a filthy sound in his life. His neck was prickling all over with embarrassment and he didn't see how he could bear another minute of this, let alone the rest of the evening. He could tell from Malfoy's tense arm that he was feeling the same uneasiness.\n \n\"Draco's probably wondering if Theo and Potter would be up for a threesome.\" Blaise let the tip of his tongue poke out from the corner of his mouth. Harry took a sharp breath, about to speak, when the scrape of the stone door made them look round. Slughorn was approaching, looking cheerful and carrying an alcoholic-smelling fug with him. He had clearly been enjoying some after-dinner drinks before coming to the dungeons.\n \n\"Good evening, ladies! Gentlemen.\" He nodded at them in turn. \"Just come for a word with poor old Potter and Malfoy, if I may?\"\n \nHarry and Malfoy stepped towards him, relieved at the interruption. \"Only disturb you for a minute, lads.\" Slughorn nodded happily. \"Time with your pals – very important. Need to wind down and have a bit of fun after a hard day's grind, I know. I just want to check how the skin growth is progressing, and talk about... \" He waggled his eyebrows at them, \"... your nocturnal arrangements.\"\n \nThe trio on the sofa were listening quite openly, and with obvious interest. Malfoy stepped a few paces further away, with Harry attached, and Slughorn following.\n \n\"Could we do this somewhere else, Professor?\" he asked.\n \n\"No need, no need. Don't want to interrupt your precious leisure time. Just let me examine... \" He grasped their arms and squinted at the join. \"Ah, yes. As I thought. The healing elements are doing their job beautifully. Astounding.\"\n \nHarry stared at their arms too. The join was looking more seamless now, less like the repellent webbed skin that had formed earlier, and more like firm, pink flesh. Slughorn bent their arms up at the elbow to view the other side. Harry noticed for the first time that Malfoy's skin was covered in pale, downy hair. It was glowing faintly in the green light, giving him an unearthly look.\n \n\"Yes, just as I anticipated. Now, are either of you experiencing any discomfort, any difficulty at all?\" Slughorn asked.\n \nHarry and Malfoy looked at one another. Harry would bet they were thinking the same thing. The word 'discomfort' didn't really begin to describe what they were experiencing. However, neither wanted to discuss the concept at all, with eager listeners only a few feet away.\n \n\"Er... \" Harry began. Malfoy shook his head quickly.\n \n\"No?\" Slughorn was all concern, but when neither boy spoke, his face creased into a broad smile. \"Splendid, splendid. Just come and see me or Poppy if anything crops up. Meanwhile, you'll be pleased to know that we've sorted out some private accommodation for you, until this little problem wears off.\"\n \n\"P– private?\" asked Harry. Malfoy's arm was rigid against his.\n \n\"Yes, dear boy, some rooms on the fifth floor where you'll be quite comfortable. There's an extra-large bed, and a separate bathroom, so you'll be able to shower undisturbed, that kind of thing.\"\n \nThere was a distinct snorting from the sofa. Harry's face was burning, but he couldn't help looking over, to see Millicent's round face beaming doughily, and Daphne stuffing her fists into her mouth in an attempt to prevent further sounds coming out. Zabini looked like Christmas had come early, and quite possibly his birthday too, and was beckoning other students to gather round and listen.\n \nMalfoy appeared frozen, staring at his feet. Harry realised they just had to get Slughorn out of there before he said anything else.\n \n\"Thank you, Professor. Could you show us, now?\"\n \n\"Now?\" asked Slughorn, very surprised.\n \n\"Yes.\" Harry tried to think of a reason. \"We're... so tired, you see. Can't wait to get to bed.\"\n \nThere was a thump and a gleeful sounding scuffle from the direction of the sofa. Daphne had rolled right off and Millicent was leaning over to haul her up again.\n \n\"You don't want to stay and enjoy these japes with your housemates, Draco?\" Slughorn asked.\n \nMalfoy's face was starting to crumple. Harry imagined the problem. Stay, and let everyone hear more of Slughorn's dreadful pronouncements, or leave, and look eager to be alone with Harry. Harry didn't see how it could honestly get much worse, so he just nodded earnestly at Slughorn's uncomprehending face.\n \n\"We're shattered, Professor. Please... the rooms?\"\n \n\"Oh, very well then... Good night, ladies! Gentlemen!\" Slughorn waved a gallant farewell to the Slytherins, and guided Harry and Malfoy out with one hand on each of their shoulders.\n \n\"I miss dorm living, you know \" he confided with an emotional tremor to his voice. \"Best days of my life. Enjoy it while you're young, my lads!\"\n \n***\n \nMalfoy sat on the bed, holding his head with his free hand. Harry stood by his side, their joined arms twisted between them. Thank goodness they had finally got rid of Slughorn, and his horrifically jocular advice about how to cope with the night ahead of them, but now there was the rest of the evening to deal with. Harry's shoulder ached from the unnatural position, but he was starting to relish the sensation as a distraction. Malfoy was pale and hunched, and looked as if he was going to be sick.\n \n\"Shall I get Pomfrey?\" Harry reached for his wand, thinking he could send a Patronus.\n \n\"No!\" Malfoy's hand hid his face, but his voice sounded as if it was about to crack. Harry looked around the room. This was appalling. The rooms were pleasant enough, and comfortably furnished, but the fact remained that the main feature was a double bed, in which he was going to have to spend the night with Malfoy.\n \nHe tried to sound encouraging. \"Look, I know it's bad, but we'll just have to— \"\n \n\"You don't know anything!\" Malfoy looked up at Harry, with his face screwed up as if in pain. \"Fuck, Potter, was it really necessary to show me up in front of those— in front of my friends, on top of everything else?\"\n \nThe ache in Harry's shoulder was becoming a throbbing. He rotated his arm to get a more comfortable position and felt a grim satisfaction when Malfoy's face twisted in annoyance.\n \n\"What was I supposed to do? Slughorn was making a laughing stock of both of us. Nice friends you have, by the way. That'll be round the whole school by morning, how we have to share a bed, and—\"\n \n\"Yes, and how you couldn't wait to drag me off there, you idiotic half-wit! This is bad enough without you blundering around, making us look ridiculous; you might as well stand up in the Great Hall and shout 'Look at us! And have a good laugh, why don't you?'\"\n \nHarry felt a buzzing in his ears, and realised he still had his wand drawn. His fingers tightened on it and it seemed to rise into position almost of its own accord. Malfoy reacted by scrabbling at his pocket, using his left hand to reach for his wand. Something about Malfoy's frightened face made Harry's stomach churn. It didn't seem right, pointing a wand at someone at such close quarters. He lowered his wand while Malfoy was still fumbling with his clothes.\n \n\"Malfoy, look― for god's sake, we can't keep fighting. We've just got to get through this. It's just as bad for both of us.\"\n \nMalfoy finally found his wand, but rested it on his knee rather than pointing it at Harry. His lips settled into their familiar sneer. \"Oh really? I wouldn't be so sure about that.\"\n \n\"What do you mean?\" Harry asked, but Malfoy just shook his head. His hair was flopping into his face and he brushed it back with difficulty, still holding his wand. Harry thought about Malfoy managing with his less capable hand all day.\n \n\"You've only got your left hand. It is tough, I can see that. But it's not for long.\" Harry wished he felt as optimistic as he sounded. The prospect of having to spend a night... possibly two nights – even three! – with Malfoy, in this room, seemed at that moment equal to any challenge he had faced before.\n \nMalfoy remained silent, his eyes lowered and fixed upon the floor.\n \n\"Why don't we just... get some sleep?\" Harry asked. \"Maybe tomorrow it will have worn off.\"\n \n\"Didn't you listen to anything Slughorn said? The healing agents will continue their action for at least forty-eight hours, maybe longer. So far we've been in this hideous position for approximately ten hours. Do you see the discrepancy?\"\n \nHarry's patience snapped. \"OK, what the fuck do you suggest we do? How about jumping out of the window?” He gestured wildly with his free hand. “Or we could spend a pleasant hour trying to kill each other with our bare hands! Nothing else is currently springing to mind, Malfoy, but I assume you've got a brilliant plan, right?\"\n \nMalfoy's shoulders sagged. \"Of course we'll try to get some sleep. There isn't anything else we can do. It's just that... \" His forehead creased with the effort of trying to express himself.\n \n\"Just what?\"\n \n\"Just, try not to be such a complete and utter fuckwit, would you?\"\n \nHarry gaped, then suddenly, saw the funny side. He hated to admit it, but Malfoy's acerbic way of speaking did sort of tickle him at times, and this whole situation was so bizarre... a laugh started in his chest, making his shoulders shake. Malfoy looked up, surprised, and his face – his grey eyes comically round – made Harry laugh even more. As he guffawed, he could see Malfoy looking by turns angry and astonished. It all seemed completely hilarious all of a sudden. The tensions of the day drained out of his body temporarily; he sat on the bed and gave himself over to a good belly laugh until his eyes were leaking and he felt quite weak with it. Malfoy sat stiffly beside him, but Harry got the impression he might be struggling to keep his haughty expression. Harry lay back on the bed, as far as their joined arms would allow. The bed was quite comfortable – softer, and altogether much better than the ones in the dorm. Maybe this wouldn't be completely terrible.\n \n\"Have you quite finished?\" Malfoy asked primly.\n \n\"Erm, I think so.\" Harry smiled at the ceiling.\n \n\"I want to go to sleep.\"\n \n\"Yes, of course.\" Harry sat up on one elbow, his bubble burst. \"Right. How shall we...?\"\n \n\"I was thinking we could just wear our night clothes with one arm in and one arm out.\"\n \n\"OK.\" Harry thought of his faded old t-shirt and baggy grey boxers that he usually wore. \"Or we could just sleep in our uniforms.\"\n \n\"What? No. That would be disgusting.\" Malfoy's nose wrinkled.\n \n\"Oh, right. Disgusting, yeah.\" Harry hoped he sounded as sarcastic as possible. \"How do we take our clothes off, anyway?\" He looked dubiously at the join which would prevent them from sliding their sleeves off.\n \n\"I think we cut them off.\" Malfoy took a deep breath. \"I won't be able to do it accurately enough with my left hand. I might cut myself, or you, if I try. Can you do it?\"\n \n\"Why don't we just Vanish them?\" Harry laughed. \"Probably safer.\"\n \n\"No!\" Malfoy was looking a little pink. It was quite warm in the room, thought Harry. \"I like this shirt. I don't want it Vanished.\"\n \nHarry shrugged. \"Whatever. Either way it's going to wreck our clothes, right?\"\n \n\"Well, they could be repaired if we cut them. But if you think a simple Diffindo is beyond you... \"\n \nIn answer, Harry took out his wand and pointed it at Malfoy's arm. \"Where shall I do it? About here?\" Both their sleeves were still rolled up, and they were without their robes, as they had been ever since they began working on their Potion that morning.\n \n\"Do yours first,\" Malfoy directed. Harry frowned at him, but moved the wand to his own arm instead. It seemed easiest to do it just below the shoulder. He worked quickly, and the Charm neatly severed his shirt sleeve, which flopped around their joined arms.\n \nMalfoy tutted. \"You should have just sliced it open.\" Harry grunted crossly. It was hard to think properly with Malfoy ordering him about like this. Bugger. He began again, cutting the shirt from collar to shoulder, and then removed the loose sleeve. The shirt hung off his shoulder, and he began to unbutton it one-handed.\n \n\"Do mine next.\" Malfoy was fidgeting on the bed.\n \n\"In a minute.\" The buttons were fiddly. \"This will get in the way otherwise.\" He persevered and was able to slip the shirt off completely at the other side.\n \nMalfoy looked pointedly in the other direction. \"Where are your night things?\"\n \nHarry shrugged. \"I'll get them in a minute. I'll do yours first.\" He aimed at Malfoy's neck.\n \n\"Careful!\" Malfoy sounded squeaky.\n \n\"Yeah, yeah.\" Harry was getting fed up with the whole thing. \"If you don't like it, we can get old Sluggy back up here to help. Diffindo.\" His wand traced a path from Malfoy's collar right down his sleeve, leaving it in two neat sections, with an expanse of pale skin in between. \"There. Pretty good, if I do say so myself.\"\n \nMalfoy stood up, holding the two sections of the shirt together to stop them gaping, and started to move towards their trunks, which had arrived at the rooms shortly after they had. Harry followed, feeling irritated. \"No problem, Malfoy, really, it was a pleasure.\"\n \nMalfoy ignored his comment. They stood shoulder to shoulder, looking at the trunks.\n \n\"Get your things, then,\" Malfoy said. \"Or are you going to stand around all night like that?\"\n \nI might do, if it winds you up, thought Harry. He rummaged in the trunk and found his t-shirt and shorts. \"Sorted. Where's yours, then?\"\n \nMalfoy's night attire turned out to be a long white shirt with loose sleeves.\n \n\"A nightie!\" hooted Harry. \"Nice one, Malfoy!\" He slipped his t-shirt over his head and put one arm in, but the other arm bunched annoyingly at his shoulder, and the shirt rode up over his stomach.\n \n\"What the merry fuck is that?\" asked Malfoy in disbelief. Harry looked down at his chest. The faded, rather tight t-shirt was emblazoned with a picture of a very busty mermaid who smiled and winked at the viewer. Harry blushed a little.\n \n\"Present from Ron. Hey, at least it's not a nightie. Go on then, let's see what that thing looks like on you.\"\n \nMalfoy was still clutching at his shirt, looking ill at ease. His eyes slid across Harry's bare stomach. He swallowed. \"Turn the other way.\"\n \n\"You are kidding?\" Harry looked at him. \"You're not kidding. Er, whatever.\" He turned as far round as he could. There was a great deal of wriggling and tugging. When activity ceased, Harry risked a glance over his shoulder. Malfoy was flushed and his hair was all rumpled. His shirt was even more bunched up than Harry's, and he was still wearing his trousers.\n \n\"This is stupid,\" Harry pointed out. \"It is not going to be comfortable to sleep like this.\" He started to take off his t-shirt.\n \n\"If you think I am getting into bed with you unclothed, Potter, you can think again. Keep that fucking ugly shirt on.\" Malfoy was still working determinedly, with one hand and his wand, muttering spells as he went. Somehow he had got the buttons mostly done, with the shirt off his shoulder on one side, but otherwise properly on. Harry blinked. Malfoy looked... OK in the shirt. It actually really suited him. His hair was in messy tendrils hanging round his face and the shirt had a loose, open neck. He looked very young and less guarded than usual. From close range, Harry could see a dusting of pale freckles on Malfoy's shoulder. He cleared his throat.\n \n\"Nice nightie, Malfoy.\"\n \n\"Stick it up your arse, Potter. Look at that piece of shit you call clothing. What is that vile picture? Do you and Weasley wank to that crap, or something?\"\n \n\"You've got a filthy mind for someone wearing a frilly nightie. Why would you want to think about me and Ron wanking?\"\n \nMalfoy flushed crossly. \"I've told you I want to sleep. For Merlin's sake shut up and let's get this appalling day over with.\"\n \n\"Yeah, sit down a minute then, and I'll get my shorts on.\"\n \nThey shuffled along to the bed again. Malfoy removed his trousers, while Harry changed into his baggy boxers. It was funny. He was totally used to being half-naked around Ron and the others, in his dorm or when changing for Quidditch; it just didn't occur to him to feel shy any more. But sitting here with Malfoy so very close, their arms bound together by the potion, their legs almost brushing together... feeling Malfoy's shoulder trembling a little, alongside his own... well, that did feel weird. He pulled his boxers up quickly, grateful for Malfoy's averted eyes.\n \n\"OK?\" he asked. \"Erm. I suppose we need to use the bathroom.\" He could feel Malfoy's  discomfort quite intensely; the skin on their joined arm was prickling with it. Again, Harry wouldn't think twice about chatting in the loos if Dean or Neville or whoever happened to be standing there, but the thought of doing this with Malfoy was peculiar and unsettling. Maybe it was just second-hand embarrassment from Malfoy, who was evidently rather prudish.\n \n\"Come on.\" He tugged at their joined arm gently. \"I'll Muffliato both of us and you can shut your eyes.\" He grinned, but Malfoy didn't, or couldn't, return the smile.\n \nThey used the toilet in silence, and cast charms to clean their teeth. Malfoy's night-time grooming routine seemed quite complicated and took a few minutes to complete. Harry passed the time by thinking about what this could have been like if his arm had been stuck to Ron's, instead. It would have been a pain, for sure, but it actually could have been quite a laugh, as well.\n \nAs they headed back to the bedroom, Harry found himself feeling a bit choked as he thought fondly of Ron and the others back in the dormitory, missing the ribald, good-humoured messing and joking that accompanied their bedtime routine most nights. He remembered the studied cruelty of the Slytherin common room. Wow, imagine if it's always like that. I knew I was lucky to have such good friends, but... well, wow. \n\n \n\n\"You know what they said about Theo Nott...\" Harry said before he could stop himself.\n \n\"Yes?\" Malfoy looked as if daring him to carry on.\n \n\"Erm... I was just wondering.\"\n \n\"We're friends, Potter. Theo's my friend. OK? Some people just have their minds in the gutter.\"\n \n\"Yes, fine. I mean, it's fine if you're― I mean, I don't care if—\" Harry felt his face reddening. \"I just wondered.\"\n \n\"Thank you for clearing that up.\" Malfoy's lip was curled in an ugly expression.\n\n \n\n\"So.\" Harry tried not to sound as uncomfortable as he felt. Try as he might, he couldn't think of an offhand way to say Let's get into bed together, now. \"Do you need to do anything else?\"\n \n\"Like what, exactly?\" Malfoy was standing as far apart from Harry as he could.\n \n\"I don't know. What do you normally do before you go to sleep?\"\n \n\"Are you trying to be funny?\" Malfoy looked scandalised.\n \nHarry hadn't been, but now thoughts flashed into his mind of what he often did to relax himself before going to sleep.\n \n\"No— I just— are you ready, then?\"\n \nMalfoy was visibly gritting his teeth. \"Yes.\"\n \nThe bed was a generous size, but it suddenly looked very small for two people. Maybe this would be easier with the lights out.\n \nHarry cast Nox, and Malfoy made a surprised sound as they were plunged into darkness. Harry sat down carefully and waited for the corresponding dip of the bed as Malfoy joined him. They shuffled backwards, their joined arm jolting slightly as they went. Their breathing sounded loud in the quiet room as they tentatively lay down next to one another.\n \nThen there was the fumbling with the bedclothes. Thoughtfully, two sets of covers had been provided, and Harry wrapped one around himself. Malfoy took a while to fuss about with his blankets until he was satisfied. It seemed that he had his set wrapped as tightly around himself as possible, from the armpit down. Harry had the thought that he was marking out his territory. Their joined arm stuck out in the middle between them, in a kind of blanket-covered no man's land, their hands lying uselessly in opposing trenches\n \n\"Well,\" said Harry. \"This is different.\"\n \n\"Merlin, I should have known you would be the chatty kind. This isn't a sleepover, Potter. Shut up and go to sleep, for fuck's sake, or I'm going to have to reconsider cutting my arm off.\"\n \nHarry rolled his eyes at nothing, in the darkness. \"Good night to you too, Malfoy.\"\n \n\"Good night. And I hope to god you don't snore. Because you'll wake up with a pillow on your face if you do.\"\n \nIt wasn't the most charming way he'd ever been bidden off to sleep, but it was better – marginally – than the cupboard under the stairs, thought Harry. At least in the morning he could see his friends again, and maybe they could go and ask McGonagall to try to find a way to get them free. He couldn't imagine putting up with this for another... he calculated briefly... another day, a night, and maybe the next day too.\n \nHe could feel Malfoy's arm against his, chilly and bony. Malfoy lay completely motionless but Harry could tell from his breathing that he was far from being asleep. He was taking shaky gulps, as if on the verge of panic. Without letting himself think too deeply about it, Harry reached over with his free hand and briefly patted Malfoy's shoulder. The gulping stopped and Malfoy appeared to be holding his breath. His arm was as rigid as a steel rod.\n \nAlthough the bed was wonderfully soft, and much wider than he was used to, Harry felt supremely uncomfortable. He would never get to sleep... it was impossible... he was going to have to lie here all night wide awake, listening to Malfoy's breathing, which after a pause sounded less frantic and more settled... and the gentle hooting from the Owlery.\n \nHarry thought of Hedwig, as he often did at nighttime. Her feathers were the softest thing he had ever felt, and when she nibbled his fingers, she was always gentle with her beak, so as not to hurt him...\n \n... and then, quite unexpectedly, he fell peacefully and deeply asleep.\n \n***\n \nMalfoy's hair was brushing Harry's cheek. They must have rolled together in the night, to face one another, because Harry's arm was around Malfoy's back, and he could feel the warmth of Malfoy's skin through his shirt, and the bones of his spine. He turned his face so that his nose pressed into Malfoy's hair, which was deliciously soft, almost as soft as Hedwig's feathers, and smelled of apples. Harry's mouth was brushing Malfoy's ear, and he very gently opened his mouth and let his tongue flick out, just along his neck where the pulse was beating...\n \nMalfoy shifted and moaned. \"Potter...\"\n \nHarry brought his other arm up. He realised with delight that they weren't joined any more. He was free to lift his hand to cup Malfoy's jaw, where the skin was surprisingly smooth, and shift his body closer to Malfoy's...\n \n\"Potter!\"\n \n... so he could just rub against his hip, in a way that sent little shocks of pleasure curling along his...\n \n\"Potter. Get the fuck off me.\"\n \nHarry awoke with an abrupt and hideous recollection of where he was and what he was doing. His arm was round Malfoy and his face was in his hair and Malfoy was wide awake and angry and trying to push him off and oh shit.\n\n \n\n\"Sorry! Fuck, sorry. I was dreaming!\" Harry moved as far away as he could. His heart sank still further to realise they were still very much joined, after all.\n \n\"How dare you touch me?\" Harry could see Malfoy's furious, rumpled face in the light which creeping round the edges of the curtains. It must be nearly morning.\n \n\"I was― shit, Malfoy, I was just dreaming. You don't think I wanted to— \"\n \nMalfoy was hunting for something by the side of the bed – his wand, Harry presumed. He grabbed his own wand and Summoned his glasses from the nightstand.\n \n\"Calm down. It was just an accident. I didn't know what I was doing.\"\n \nA little voice in Harry's head pointed out that he had known exactly what he was doing, in the dream. He had known, and he had liked it. He could still feel the soft tickle of hair, smell the warmly-scented skin...\n \nMalfoy had got hold of his wand, and sat up, glaring at Harry.\n \n\"Touch me again and it won't be my arm I cut off, Potter. Is that clear?\"\n \n\"Merlin, yes. It won't happen again, Malfoy. Now get a grip.\"\n \n\"Don't you tell me to get a grip. What bloody time is it?\"\n \nIt turned out it was just after five in the morning.\n \n\"There's no way I'm going to get back to sleep again now. Thanks a lot, Potter. You keep managing to make a frankly impossible situation even more monstrous.\"\n \nHarry was carrying on an entirely different argument in his head.\n\n \n\n\nYou were touching Malfoy. \n\n\n \n\n\nI didn't know it was him. \n\n\n \n\n\nYes, you did. \n\n\n \n\nNo, I –  well, I did, but I was dreaming. I was muddled. \n\n \n\n\nYou were touching Malfoy and it felt fucking great and you wanted to carry on doing it. \n\n\n \n\nI was muddled. That's all. It doesn't mean anything —\n\n \n\n\"Potter? Hello? For crying out loud, in terms of intelligence, it's like being shackled to the bedpost.\" With an effort, Harry gave Malfoy his full attention. \"I said 'shall we get up?' I'll go mad if I have to be with you on this bed a minute longer.\"\n \n\"Yes. OK.\" Harry stared at their joined arm. It was looking more like one very strange arm, now. You could see the join, but only if you were looking for it. The way his arm, with its distinct skin tone, hair and dark moles here and there, morphed into Malfoy's pale skin, with white-blond hair and the palest freckles, gave him the shivers.\n \nThank god it wasn't Malfoy's Marked arm. Harry knew he used Glamours on it, but you could still see the edges of the Mark sometimes, and the blurriness gave it away, anyway. He wasn't sure he could have stood having that next to his own skin, touching it... He wondered, not for the first time, how Malfoy had felt when he took the Mark. He wondered if it had hurt. If they had made him do it, perhaps pinning him down, or if he took it willingly, thinking of it as a mark of honour. He wondered if...\n \n\"Potter! Fuck's sake, man! I need to get up and get some tea.\"\n \n\"Oh, yes. Come on, then.\"\n \nThey managed to get their uniforms back on, and attempted repair jobs on the parts Harry's wandwork had severed, but it didn't look good. Harry was not accustomed to such precise spellwork, and Malfoy's left arm was clumsy, making him swear and scowl as he tried to cast. Still, they were dressed, after a fashion.\n \nHarry wondered if Malfoy would want to shower, but he hadn't mentioned it, using several different cleansing and scouring charms instead, some of which he muttered as if embarrassed. Harry didn't catch all of the incantations, but guessed they dealt with intimate matters. He wondered again how long they were going to be joined like this. Perhaps he needed to get Hermione in a quiet corner and ask her for a few tips. He himself opted for a quick splash of water on his face, while Malfoy looked on disapprovingly, but did not comment.\n \nThey moved through the same awkward routine as the night before, but in reverse. It was like a clumsy kind of dance, thought Harry, when you never knew quite where your partner was going to want to move next. The same bumping and hesitation, then both moving at once, getting in one another's way. A bit like normal dancing, then, the way you do it, at least, said the little voice in his head. He grinned. Unfortunately this coincided with Malfoy leaning in towards the mirror, trying to get his hair the way he wanted it.\n \n\"Something funny, is there?\"\n \n\"Not really.\" Harry looked away as if bored. \"Just, you do take an awful long time mucking about with your hair.\"\n \n\"Some of us prefer not to spend the whole day looking as if we've tumbled straight out of bed.\" He was applying something from a bottle and combing it through with his fingers.\n \nHarry gave his own hair a dispassionate stare in the mirror. He shrugged. \"Mine always looks like this, doesn't matter what I do.\"\n \nMalfoy looked, too. \"You could try this.\" He proffered the open bottle. The unmistakeable scent of apples curled up into Harry's nostrils.\n\n \n\nHarry drew back as if stung. \"No,\" he said, in tones of horror.\n \nMalfoy frowned. \"Just offering.\" He carried on coaxing his hair a bit longer, then nodded at himself in the mirror. It was very sleek and close to his head now. His chin looked the pointiest it had ever been, and you could see that his hair was already receding, just a little, at the front. Harry remembered the loose locks falling forward from last night... his eyes met Malfoy's in the mirror, and he hurriedly looked away.\n \n\"I am ready,\" Malfoy announced. \"Now I need tea.\"\n \nIt was still early, a long while before breakfast would be served in the Great Hall.\n \n\"The kitchens?\" Harry suggested. Truthfully, his stomach was starting to complain about being empty. Waking up early always left him feeling famished.\n \nThey made their way downstairs. The castle was hushed, their footsteps sounding loud in the stone hallways. The light streamed in at the windows, catching specks of dust in the air.\n \nBy contrast, the kitchens were a bustling, noisy hub of activity. Food preparation was already well underway at the rows of tables, and Harry's stomach growled at the smells and sights. McGonagall was next to one of the tables in the corner, standing very upright, her face tired and lined, but her hair and robes immaculate as usual.\n \n\"Good morning, Mr Malfoy, Mr Potter,\" she greeted them. \"You're making an early start on the day?\"\n \n\"We... couldn't sleep,\" Harry answered. \"Thought we'd come down and get some tea.\"\n \n\"Well, now you know that I have the same habit.\" She turned with a small smile to the house-elf who was arranging tea things on a tray for her. \"I like to check how things are going here in the kitchens before I begin the day. And our team of house-elves, here, often know better than I what is going on in the rest of the castle.\"\n \nShe raised an eyebrow. \"So, how are things faring with you gentlemen today?\" She ran her eye over their badly repaired uniforms. \"You don't seem to have had much luck with getting dressed.\"\n \nMalfoy raised their joined arm, as if to explain all their difficulties.\n \n\"Did Horace not tell you how to manage?\" McGonagall tutted. \"He was meant to explain all this, last night!\"\n \nShe fussed at their clothes with her wand, gently smoothing out the uneven parts and putting things to rights.\n \n\"Come to my office and let's have a talk, boys.\"\n \nMalfoy looked unhappily at the busy elves around them.\n \n\"Oh, I'll make sure you get your tea, Mr Malfoy. I can see you and I are the same: no use to anyone without a good pot of the strong stuff to start the day.\"\n \nHarry's stomach chose this moment to grumble again. McGonagall made a wry face. \"Oh dear. Well, we can deal with that too.\" She gave instructions to a nearby house-elf, before leading the way to her office and bidding them to sit down.\n \n\"So, may I see the effects of the potion? How is it looking today?\" She examined their arms as she spoke. \"Very curious. I have only once seen a case like this before, when an experimental healing potion was being tested on a Kneazle. He went straight out and rubbed himself against a tree and somehow fused his skin to the bark. What a mess.\" She shook her head. \"We were picking splinters out for a week.\"\n \nShe turned her attention to the tea things. \"Mr Malfoy. I seem to recall you have a sweet tooth?\" She added several spoons of sugar and a good splash of milk before placing the steaming cup in front of Malfoy. \"And Mr Potter. Not a great tea drinker, but perhaps you'll join us in a cup?\"\n \nThey sat quietly, enjoying the peace and the fragrant, hot tea. McGonagall closed her eyes for a moment, until Malfoy's cup rattled as he placed it down on the saucer. Her eyes flicked open and Harry was reminded of a cat, roused from sleep to complete wakefulness in an instant.\n \n\"So, there are various charms and procedures that will make it more pleasant for the two of you until this wears off.\"\n \nAs McGonagall continued, Harry was reminded of the time he had the facts of life explained to him, by Professor Dumbledore of all people. The Dursleys had never mentioned such sordid subjects, and the scraps of information Harry had picked up at the school he attended with Dudley had just left him feeling confused and alarmed. Dumbledore had guessed this somehow, and made sure that Harry knew at least as much as his peers, a process which left him feeling grateful, but embarrassed.\n \nIt was the same on this occasion. McGonagall explained matters in her brisk, methodical way – dealing with everything from how Malfoy could manage to complete schoolwork with his left hand, to how to manage their lavatorial needs with the minimum of mortification. Harry was particularly happy to learn the charm that would enable them to remove their clothes without cutting them, simply by moving them a few feet away in a variation of the Banishing Charm. It was all terribly helpful information, but Harry wished he didn't have to sit here politely drinking tea with Malfoy and the Headmistress while he learned it. Bacon sandwiches arriving in the middle didn't exactly help, but Harry was hungry enough to tuck in anyway. Malfoy, despite partaking of several cups of tea, only picked at his.\n \nAt last they were dismissed. It was almost time for breakfast in the Great Hall, and they loitered in the corridor nearby, pretending not to notice the curious looks from passing students. Harry peered down the corridor impatiently, waiting for Ron or Hermione to appear; Malfoy looked downcast and did not meet anyone's eye.\n \n\"We'll sit with the Gryffindors again, today, right?\" Harry asked. \"I mean, it's my turn. We went to your Common Room last night.\"\n \nMalfoy opened his mouth as if to argue, then shrugged. \"All right then, if it's so very important to you. It makes no difference to me.\"\n \nHarry was desperate to speak privately to his friends, to tell them how this was turning out to be grim not only in all the ways you would imagine, but also for more unsettling and humiliating reasons. Well. Maybe he wouldn't tell them all that. But he would like to be alone with them, to have a conversation without Malfoy hearing every single word. To vent all of his annoyances and frustrations. To get reassurance that he would be able to get through this. And to tell them what a prat Malfoy was about his hair.\n \nHe also wondered if he could ask Ron if there was any way he knew of avoiding having certain kinds of dreams. He'd half expected McGonagall would bring up the subject, feeling alternately appalled and hopeful, but it didn't crop up, and of course Harry didn't say anything when she asked if either of them had any questions. He supposed he couldn't ask Ron, either, without explaining the whole hideous problem. He'd just have to hope he'd be so tired tonight that he wouldn't dream at all.\n \nWith a rush of relief Harry saw Hermione, her hair bobbing wildly as she hurried towards them. She hugged him tightly, taking the opportunity to murmur privately to Harry. \"How is it?\"\n \n\"Pretty bad,\" Harry replied in a whisper.\n \nShe gave him another squeeze and then broke away. \"Hello, Malfoy,\" she said civilly.\n \n\"Good morning. How are you?\" asked Malfoy in tones of great politeness.\n \nHermione looked pleased. \"Very well, thank you. And you?\"\n \n\"This is all very nice, but can we get some breakfast?\" asked Harry.\n \n\"Oh, Harry!\" Hermione laughed. \"He's always starving in the mornings,\" she confided to Malfoy.\n \n\"You wouldn't think he had just inhaled a large bacon sandwich, would you?\" asked Malfoy, smiling quite nicely.\n \n\"You can stay here and chat. I'm going to have breakfast,\" Harry said, pulling Malfoy in the direction of the Hall, to join the students starting to file in.\n \nRon joined them as they sat down, taking a seat opposite Harry. \"Missed you last night, mate. We were up playing Dragon's Breath till late, and they beat the crap out of me and Neville without you there.\"\n \nHermione squeezed Harry's free hand under the table. \"How was your evening, Harry?\"\n \nHarry thought of Blaise's eyes glittering at Malfoy's discomfort, of Slughorn's sloppy sentimentality, of Malfoy's pale shoulder in his night shirt.\n \n\"Fine,\" he said.\n \nFood appeared on the usual bounteous platters. Hermione, who was next to Harry, helped him to sausages and fried potatoes, but although the table had filled up, nobody had taken the seat next to Malfoy. She looked at Ron, sitting opposite. \"Ron, pass Malfoy the eggs.\"\n \nRon's forehead furrowed, then he reached for the serving spoon with an expression as if his arm didn't want to obey him.\n \nHe put some eggs on Malfoy's plate, rather roughly. \"All right?\"\n \nMalfoy nodded.\n \nHermione gestured encouragement at Ron. He stared back defiantly.\n \n\"Perhaps Malfoy would like some sausages?\" Hermione suggested.\n \n\"He's still got one arm,\" Ron said. \"He's not totally incapable.\"\n \n\"This is fine.\" Malfoy took up his fork. \"Thank you.\"\n \nThe first owls began to swoop into the Hall. Letters and packages dropped into their recipients' laps or bounced off plates, depending on how good the owl's aim was. Ron had a letter; Hermione, a small bundle of letters (\"Oh good! More replies from the Wizengamot about the Magical Creatures Equality Bill!\"), and Malfoy had a letter and a parcel.\n \nHe turned them over with one hand, then put them to the side of his plate.\n \n\"Would you like help opening those?\" Hermione nodded at Malfoy's post.\n \n\"No! No, thank you.\" Malfoy slid the items into his pocket.\n \nThere was a lot of banter going on further down the table. Seamus raised his voice to call across. \"Hey, Harry, got a joke for you. What do you call a man with one head, two legs and two arseholes?\"\n \nHarry's eyebrows drew together. This didn't sound promising.\n \n\"Harry Potter, with Draco Malfoy stuck to him!\"\n \nThere was a muffled outburst of glee from some areas, followed by some disapproving muttering. Malfoy put his fork down.\n \n\"Get it?\" Seamus smirked. \"Two arseholes.\"\n \nHarry felt a clammy nausea rising in his throat at the unexpected cruelty. \"That's disgusting,\" said Hermione, her eyes blazing with fury. Neville and one or two others nodded. Ron, however, was coughing in a suspect manner into his napkin.\n \n\"Ah, come on.\" Seamus screwed up his face. \"It's only a joke. And Malfoy's got Dean into a ton of trouble, all because his poncy ring melted.\"\n \nSeveral people began speaking at once, before McGonagall stood up and cleared her throat. \"Couldthe Gryffindor table be so kind as to settle down, in order to allow the rest of us eat our breakfast peacefully? Otherwise, I think it will be a matter requiring the deduction of House Points.\"\n \nThere were grins and curious stares from the other Houses, but the noise level subsided.\n \nOnly a joke. Harry lowered his head and pushed down the unease bubbling in his stomach. After a minute he was able to fork the rest of his breakfast into his mouth. He noticed uncomfortably that Malfoy had hardly eaten anything.\n \nHermione leaned in at his elbow. \"It's a study morning. Meet you in the library and we can have a talk.\"\n \n\"Talk?\" Harry wondered how they would manage that, with Malfoy approximately a foot away.\n \n\"Well, yes, just a little bit.\" She waved her hand. \"We'll need to do that Charms essay first, and the reading for Herbology, obviously.\"\n \n\"Obviously.\" Harry smiled. The morning wouldn't be so bad if he could be with Hermione, and she, at least, was evidently going to continue as if nothing had changed, which was about the most helpful thing he could think of right now.\n \n\"Are you finished?\" he asked Malfoy, who was gazing out of the window blankly.\n \n\"Yes.\"\n \n\"Then let's go.\"\n \nMalfoy looked grateful, and they left the hall as quickly as they were able.\n \n***\n \nSo how's it going? Are you OK? Hermione's quill moved rapidly over the parchment.\n \nHarry smiled in relief; he should have known Hermione would help. Glancing at Malfoy, he saw the other boy was apparently deep in study, immersed in his book, but he used his body to block Malfoy's view of the parchment, just in case.\n \n\nIt's bloody terrible. I don't know if I can stand another two days of this.\n\n\n \n\nThere's got to be a way to speed things up, Hermione went on in her neat and fluent hand. I asked McGonagall if I could work on it as a project – I've got lots of ideas – but she said not to meddle, and that we had to let magic take its course.\n\n \n\nShe's probably right, Harry wrote. Imagine if we made it worse. At least this way I know it's most likely going to be over by Thursday.\n\n \n\nI don't know, wrote Hermione. I've just got to finish this work for Arithmancy and then I'm going to reread One Hundred Healing Helpers. It's definitely worth trying to see if—\n\n \n\nDon't bother, honestly. Harry's quill blobbed ink on the parchment in his haste to reply. Just help me work out how to survive the next couple of days.\n\n \n\n\nHow's Malfoy being about the whole thing? Is he giving you any trouble?\n\n\n \n\nHarry glanced over his shoulder at Malfoy. He's... not taking it too well. Harry thought about it for a minute. I think he's actually finding it harder than me.\n\n \n\nHe seems to be really trying, wrote Hermione. I mean at breakfast and everything. I could have hexed Seamus and the others!\n\n \n\n\nYeah, I suppose he is trying. Merlin, you've no idea what it was like when we went to Slytherin. Bunch of back-stabbing bastards. I actually felt sorry for the git.\n\n\n \n\nThey're not all like that, Hermione reminded him.\n\n \n\n\nIt only takes a few.\n\n\n \n\nMalfoy cleared his throat, and they both looked round guiltily, but he still had his head in the book.\n \nI'll speak to everyone before Transfiguration, Hermione wrote. See if I can get them all to leave you both alone.\n \nThanks. I don't reckon it will do any good, though.\n\n \n\n\nI've got to get on, now. I've got eighteen inches to hand in to Professor Vector on Friday. You can do it, though, Harry. It'll be over soon. \n\n \nShe tucked her quill away and stood up, hitching her bag over her shoulder. \"I'm going over to the Advanced Arithmancy section to look for something on Cleromancy. We're studying Tibetan dice. Do either of you need anything from there?\"\n \nMalfoy looked up. \"Cleromancy? Have you read Halvorsen?\"\n \nHermione frowned. \"Not on dice specifically, no. I thought she mostly dealt with runic magic.\"\n \n\"Yes, but also an excellent chapter on dice in Mysteries and Magyk. Not a very well-known work, but definitely worth the read.\"\n \nHermione's eyes lit up. \"I'll go and look, now. Thanks, Malfoy!\" She put an arm on Harry's shoulder. \"I'll see you later, Harry. You, too, Malfoy.\"\n \nHarry looked from Hermione's departing back, to Malfoy's head, now bent over his studies again. They're as bad as each other! Book-crazy, the two of them.\n \nMalfoy looked up and caught him staring, and Harry hurriedly opened his textbook, too. Semi-Sentient Plants of the Southern Hemisphere wasn't exactly holding his attention this morning, but at least he could look as if he were reading, while he thought everything through. After a while he noticed that Malfoy had taken out his letter and was surreptitiously opening it, with some difficulty, under the desk. Harry noticed the Malfoy family crest on the envelope – the same one that was on that bloody ring that started all this trouble, he thought. He tried not to look any more, for fear of seeing Malfoy's private letter, but after a minute, found his eyes wandering towards it.\n \n\n... taken rather ill but I don't want you to worry yourself... always so proud of you, my darling; work hard and one day the Malfoy name will...\n\n\n \n\nHarry looked away. He hadn't meant to read, but it was hard not to, when you were sitting virtually on top of the other person. He stared at page 224 of Semi-Sentient Plants determinedly. \"Screechsnaps, on the other hand, can experience both pain and pleasure, and so are generally regarded as having— \"\n \nMalfoy's shoulder was shaking. A fat droplet fell with a splash onto his book. Harry started, and looked up at the ceiling, genuinely perplexed, until he realised that Malfoy was weeping silently.\n \nHe hesitated, not sure what to do. Would Malfoy want him to ignore it? Yes, probably. He carried on looking at page 224. The letter rustled as Malfoy fumbled it back into his robes. Harry turned a page he hadn't read, in order to stare at a different page he wasn't going to read. Malfoy took a choky breath and swiped at his eyes with his free hand.\n \nHarry looked out of the window. The sun was shining on the lake, making the water sparkle. He thought about another afternoon of listening to not-quietly-enough whispered jokes and thinly-veiled animosity to Malfoy.\n \n\"Let's get out of here, shall we?\"\n \nMalfoy looked at him in surprise. His eyes were pink and watery.\n \n\"Let's go out... somewhere. I can't face sitting here all morning, and then lessons this afternoon.\" He didn't need to explain. Malfoy knew exactly how it was.\n \n\"But, they'll notice we're gone. We'll... \"\n \n\"... get into trouble? I don't really give a shit. Do you?\"\n \nMalfoy hesitated. He fingered the letter in his pocket.\n \n\"I suppose... \"\n \n\"Come on, Malfoy. You can say I made you do it. I will make you, if you want. Come on. Pretend I've got you at wandpoint.\"\n \nMalfoy smiled weakly.\n \n\"I'm being corrupted by Harry Potter. Someone had better tell the Prophet.\"\n \nThey bumped into Slughorn as they were leaving the library.\n \n\"I was just coming to find you two. Not finishing work already, eh?\" he asked dubiously. \"It's only a little after ten-thirty.\"\n \nMalfoy spoke up quickly. \"Not at all, sir. We're just going over to the greenhouses to check on our Herbology projects. Then we'll be right back at it.\"\n \n\"Good, good. So, everything's fine, I take it? No problems at all?\"\n \n\"No problems.\"\n \n\"Well, I'll see you later. Potions again, this afternoon, isn't it?\"\n \n\"Ah, yes, Professor. About that. Now you mention it, Potter and I... we're both feeling some after-effects of the accident. A sort of delayed shock, I think. I feel it might be best if we avoided the scene where it all happened, for a day or two. Just till we get over it, you understand.\"\n \nSlughorn looked dismayed. \"Ah. Oh dear. Hadn't you better go and have a chat with Madam Pomfrey about this?\"\n \n\"No, no, it's nothing worth bothering her about. We just wondered if we'd be better off doing some reading, in the library, instead. We wouldn't be able to do any practical work, like this, anyway.\" He lifted their arm in explanation.\n \nSlughorn was undecided. \"Hmm. I don't know... perhaps I'd better check with the Headmistress.\"\n \n\"Oh don't disturb her, sir. We'll be quite all right.\" Malfoy sounded confident and evidently convinced Slughorn, who nodded.\n \n\"Very well, then. You can be looking at Ageing Potions, that's what we're mostly working on this week. Any questions, just find me after dinner.\" He wandered off, in the vague direction of the dungeons.\n \n\"Good one, Malfoy!\" Harry looked at him with admiration. \"We should do this more often.\"\n \nMalfoy gestured modestly. \"Slughorn's piss-easy to fool. He doesn't care what you do, as long as it doesn't mean any extra work for him.\"\n \n\"Right. Next stop the kitchens.\"\n \nHarry found it as easy to wheedle a picnic out of the house-elves, as Malfoy had done to get round Slughorn.\n \n\"How do we leave the Castle, without being noticed?\" Malfoy asked. \"It's going to be fairly obvious we're sloping off: no school books and carrying a picnic hamper.\"\n \nIn answer, Harry beckoned Malfoy into an alcove covered by a tapestry, and pulled out a certain garment, enveloping them both in its folds.\n \n\"What the- you've brought your Invisibility Cloak?\" Malfoy's eyes were like saucers.\n \n\"Well, you know... \" Harry found he enjoyed the attention of an impressed Malfoy. \"No point having these things if you don't use them.\"\n \nMalfoy laughed, a good happy laugh instead of the cruel sound Harry had heard so many times over the years. \"Fuck me, I'm bunking off lessons to go out with the Saviour in his Invisibility Cloak. You'll be telling me next that magic is real.\"\n \nHarry discovered it was easier to move together while under the Cloak, perhaps because he had had practice at it, perhaps because Malfoy naturally shortened his stride and moved more cautiously, so as not to dislodge the fabric. They remained silent until they were a good way from the Castle, but then began to laugh with the relief of having got away with their plan.\n \nIt was one of those startlingly bright days that often come after weeks of grey. It was mild for April, with buds sprouting everywhere, and the air smelled fresh and clean. They walked down the sloping lawn, heading in a vague southerly direction to stroll around the edge of the lake. There was a line of fir trees between them and the Castle, and they felt it was unlikely they would be spotted, so Harry folded the Cloak back into his bag.\n \nAfter about five minutes, Malfoy, who had been carrying the hamper, stopped and looked around. \"How far are we going? This weighs a ton; what do you think those elves put in it?\"\n \n\"Shall we stop here? I'm hungry.\"\n \n\"It seems like you're always hungry,\" said Malfoy, but he put the hamper down without any objection.\n \nThey found a spot where they could lean against the trunk of an enormous oak. The sun was warm, and they removed their robes and undid their ties. They opened the hamper together, using both their free arms and their attached arm in the process. Harry realised with surprise that this was the first time either of them had used their joined arm, since the accident. It had felt like a foreign object, not quite belonging to him anymore. He would no sooner have used it than he would have put on Malfoy's shoes. But it seemed more natural, now, taking turns to use it, or even working together using both, and certainly a lot easier than doing everything with one hand only.\n \n\nI suppose we're just getting used to it. It was bound to feel less weird, after nearly a whole day.\n\n\n \n\nThe hamper turned out to contain slabs of an enormous meat pie covered with glorious golden pastry, a dish of potato salad, ripe tomatoes, and crisp green apples, plus two bottles of pumpkin juice, cutlery, napkins, and plates. Harry ignored the plates and took a generous slice of pie in his hands. Pieces of pastry were strewn across his lap and onto the grass as he tucked in.\n \n\"You really are a barbarian.\" Malfoy watched as Harry took enthusiastic bites.\n \n\"I really am starving,\" said Harry, indistinctly from around the pie.\n \n\"I don't know how you eat so much without ending up the size of Bulstrode.\"\n \n\"Quidditch,\" Harry replied smugly. \"I'm all muscle.\" He demonstrated with his free arm. Malfoy raised his eyebrows, then busied himself with the hamper, getting himself a napkin and some of the pie.\n \nThey munched in companionable silence for a while, and Harry noticed that Malfoy ate with a healthy appetite when away from the scrutiny of the Gryffindor table.\n \nThey both finished their meal with an apple. They were deliciously tart and juicy, and the moment Harry took a bite, he was reminded of the disconcerting smell of Malfoy's hair. Malfoy was crunching his quite happily. He lounged against the tree, taking big bites with his even, white teeth. He tilted his head back, admiring the buds on the oak, which were just bursting into green. Harry let his own head loll against the tree and squinted at Malfoy through half-closed eyes. His shirt was open at the neck, and his throat made an elegant line against the ridged bark of the trunk. His arm felt warm against Harry's... Harry's mouth felt dry and he put the apple down on the grass.\n \n\"This is better than Transfiguration and Potions,\" Malfoy announced.\n \nHarry nodded.\n \nMalfoy finished his apple in three efficient bites and lobbed it into the bushes nearby, then rummaged in his robes.\n \n\"If this is what I think it is...\" He took out the small parcel from breakfast, and used his wand to undo the wrappings. A neat wooden box, the lid inlaid with marquetry, was revealed. He smiled to himself, a private smile of affection and anticipated pleasure, but also a touch of sadness. Harry thought how nice his face looked when it wasn't wearing its sneering or disapproving expression.\n \n\"Here you are.\" Malfoy had opened the box and was offering Harry the contents. Six small, dark, roughly-shaped chocolates lay inside, nestling on red velvet.\n \n\"Chocolates?\" Harry asked. \"Really?\"\n \n\"Of course, go ahead.\"\n \nHarry took one and placed it in his mouth, and immediately got a hit of bitter-sweet intensity all along his tongue. He applied the slightest pressure to the misshapen truffle, and a burst of divine sweetness and creaminess filled his mouth. It swirled around his taste buds, coating them in sheer pleasure, with a heavenly silky texture. He groaned aloud.\n \nMalfoy, who had been watching him carefully, popped a chocolate onto his own tongue. He closed his eyes in bliss as he rolled it around his mouth.\n \nHarry's tongue gently slid about, searching out the vestiges of the incredible taste. \"Merlin, Malfoy, those are good!\"\n \nMalfoy smiled, and nodded. \"Better than Honeydukes', eh?\"\n \n\"A hundred times!\"\n \nMalfoy proffered the box again. \"Another?\"\n \nHarry's mouth was watering, but politeness made him hesitate. \"Are you sure? You've only got a few.\"\n \n\"There are more where those came from. And a little goes a long way, with these.\"\n \n\"What are they called? I've never tasted anything like them,\" Harry admitted.\n \n\"They're by Chrysanthius Lefèvre. Made from the finest ingredients, individually hand-rolled on the thighs of Pureblood virgins—\" Malfoy snorted. \"I'm joking, Potter! You should see your face!\"\n \nHarry blushed, and took another chocolate to distract from his confusion. This one was just as good, and he couldn't help making appreciative sounds.\n \n\"Wow,\" he said eventually. He felt a bit light-headed. Malfoy was regarding him with an oddly intense expression. \"So who loves you enough to send you those, Malfoy?\"\n \nMalfoy's face stiffened. Harry remembered the library and all the reasons they had come away from the Castle, and could have kicked himself.\n \nMalfoy looked away. \"My mother,\" he said, with apparent casualness.\n \nWhat now? It seemed rude not to ask, and he did actually want to know, as well. \"How is she?\"\n \n\"She's... as well as can be expected. Why would you care, Potter?\"\n \nHarry was indignant. \"She helped me! At the end... she was there, when I... when Voldemort...\"\n \nMalfoy turned to face him again. His face was pale, with a spot of colour on each cheek.\n \n\"I know. You said so at her trial.\"\n \nHarry felt lost. Why was Malfoy angry about that?\n \n\"I'm not likely to forget all the things you said,\" Malfoy went on bitterly. \"At her trial, and at my father's.\"\n \n\"I answered their questions.\" Harry frowned. \"What did you expect me to say?\"\n \n\"Oh, nothing but the truth, of course.\" Malfoy spat the words out. \"Justice must be done. And now my father's dying in Azkaban, and my mother's grey and withering away every day with the sheer bloody misery of it all. But at least you answered their questions, so that's all right.\"\n \n\"Do you think I like the thought of it, Malfoy?\" Harry shook his head in disbelief. \"I testified for your mother... for you. But Lucius... the things he did—\"\n \n\"I know what he did!\" The words came out in a sort of snarl. \"The fact remains, he is my father, and, and—\"\n \n\"And what?\"\n \n\"And I wouldn't expect you to understand!\" His lip curled in a fine show of distaste, but his arm was shaky against Harry's.\n \nHarry felt rage building in his chest. \"You mean, I wouldn't understand because I don't have a father? Are you really so low that you'd still mock me for the fact that Voldemort killed my parents?\"\n \nMalfoy's nostrils flared. \"No! I mean, I wouldn't expect you to understand, because all your family are such ruddy saints. The heroic Potters!\" He wrinkled his nose. \"How would you know how it feels to have your family talked about as if they were the lowest form of life? To be shunned everywhere you go because your father picked the wrong fucking side?\"\n \nHarry choked back the retorts that were flying to his lips. It hardly seemed the time to try to score points. Lucius Malfoy had been sentenced to life in Azkaban, and that should be enough. He was by all accounts a sad shell of a man, now: only half-sane and physically feeble. A shiver ran down Harry's back, despite the warm spring sunshine.\n \nMalfoy was chewing at his lip, his eyes full of self-pity. He saw Harry staring, and scowled at him.\n \nHarry exhaled slowly. \"OK, Malfoy. You're right. I don't understand. And I'm sorry about your mother. For what it's worth, I envy you the fact that you still have a mum. One who loves you enough to send you those.\" He gestured at the little box, lying forgotten on the grass.\n \n\"Yes, well.\" Malfoy tucked the box carefully into his robes again, as if it were something priceless. He spoke stiffly, but sounded less angry than before. \"You've got your precious Weasleys; they seem to have half-adopted you anyway, and when you're married to the littlest one, it'll be more or less official.\"\n \nHarry exhaled. \"I'm not marrying her.\"\n \nMalfoy looked up. \"What?\"\n \n\"We're not together any more. I'm not marrying Ginny. Unless you meant Ron, of course.\"\n \n\"You're marrying Ron?\"\n \n\"No, not him either.\" Harry laughed. \"That was a joke. I'm not marrying any Weasleys. Although Charlie is quite fit.\" He waggled an eyebrow. \"That's another joke, by the way.\"\n \nMalfoy wriggled to get comfortable against the tree. He looked a lot more cheerful. \"So... what happened? I thought the hero always got the girl.\"\n \n\"Not this time. Do you think I could get some kind of compensation? Because I was definitely led to believe this bit would be better than it is.\"\n \n\"I did notice you two weren't all...\" Malfoy put his head on one side. \"... smooch smooch any more.\"\n \n\"Yeah, well. She wasn't very impressed at being left behind when I went off hunting— when I was trying to defeat Voldemort. And then, afterwards, she didn't want to be... what you said. Not just the hero's girlfriend. She wants to do her own thing.\"\n \nMalfoy raised an eyebrow. \"Is that so? So you got dumped because you were just too good to be true.\"\n \nHarry stared. \"Thanks for the sympathy. What about you, anyway? What happened to Parkinson? She was here at the start of term, and then vanished.\"\n \n\"Pansy? She couldn't face the fucking ignominy of it, either. All anyone remembers is her standing up and offering to turn you over to the Dark Lord. She tried to stick it out, but it's like torture, you know. You must have noticed half of the Slytherins my age just didn't come back.\" He looked at Harry questioningly. \"All the cunning bastards who didn't completely disgrace themselves are ruling the roost down in the dungeons, and you bloody Gryffindors – well, I know how you feel about us. I'm not even good enough to sit next to at breakfast.\" Harry's stomach clenched at the way Malfoy's face screwed up as he spoke. \"Pansy's working at a florist's in Paris, believe it or not. I last saw her in January.\"\n \n\"Well, there you go; we have got something in common. We both lost our girlfriends because of the war.\"\n \n\"She wasn't my girlfriend, Potter. She was just one of the only decent friends I ever had, that's all.\"\n \nMalfoy leaned over and took one of the bottles of juice. He took long swallows, his Adam's apple bobbing, then looked slyly at Harry.\n \n\"Pumpkin juice,\" he said. \"You see, I will drink it when there's nothing else around.\"\n \nHarry felt a hotness sweeping up from his neck.\n \n\"The looks on their faces at dinner last night!\" Malfoy laughed, a surprising, breathy sound. \"Don't worry, I always used to watch you, too. Becomes a habit after a while, doesn't it?\" He took another deep drink from the bottle. \"I think perhaps we understand each other better than we realise.\"\n \nToday certainly was turning out to be full of surprises, thought Harry.\n \nMalfoy was packing up the remains of the picnic. \"Do you want any more of this?\"\n \nHarry brushed the crumbs from his lap. \"No, I'm stuffed.\"\n \n\"So the fabled appetite does have its limits.\" He shut the hamper lid. \"Shall we walk, now? Can't play Quidditch like this.\" He gestured to their joined arm. Harry realised he had almost forgotten about it, for a while. \"And we wouldn't want those magnificent muscles running to fat, now, would we?\"\n \nHarry laughed, and smacked him on the arm. \"More likely you'll get fat, eating those chocolates all the time.\"\n \nMalfoy gave him a sideways half-smile. \"Malfoys don't get fat. I'd be disowned if I did. Ready?\"\n \nThey stood up together. Harry used the tree for support, but it was definitely becoming more natural to move in unison, their movements starting to flow as they predicted one another's actions, rather than the constant jarring and stalling it had been at first.\n \n\"Where shall we go?\" Harry asked.\n \n\"Oh, just around... \" Malfoy waved his hand airily. \"And shall we leave that there?\" He gestured towards the hamper. \"It's quite heavy, even with most of the pie inside you, and the house-elves can always Summon it later.\"\n \nThey wandered around the perimeter of the lake at a relaxed pace. There was a warm, pleasant breeze blowing a sweet fragrance across their faces.\n \n\"What is that?\" Harry asked. \"I always smell it out here.\"\n \n\"Lilacs.\" Malfoy waved. \"There's one growing next to his tomb.\"\n \nHarry didn't need to ask whose tomb Malfoy meant. He recalled the hardy, vibrant little tree set a little way back from the white stone; he had not realised that it was the source of the delicious scent. He swallowed down a large lump in his throat. It seemed more painful than ever to think of the dead on a day like this, when the sunlight was dancing on the lake, and everything around them seemed to be bursting into life.\n \n\"It's charmed to flower all year round,\" Malfoy continued. \"And the bees adore it, when it's warm like this. It's absolutely alive with them at the moment.\" He seemed to abruptly realise what he had said, and coloured faintly.\n \nHarry thought this over. \"Do you walk out here a lot?\"\n \n\"A fair bit.\" Malfoy shrugged. \"It's peaceful by the lake.\"\n \n\"And... you visit his tomb?\"\n \nMalfoy looked sideways at Harry, then nodded once.\n \n\"Why?\" Harry stopped walking.\n \nA fat bee buzzed past, purposeful yet relaxed.\n \n\"I... have things to say.\" Malfoy looked away.\n \n\"You talk to him?\" Harry's brow creased in puzzlement.\n \n\"Yes.\"\n \n\"What about?\"\n \nMalfoy smiled thinly. \"Surely you can see, Potter, that one of the advantages of talking to the dead is that the topics of discussion remain private.\"\n \nHarry thought about it. \"I suppose so. OK.\"\n \n\"You make it sound as if you're giving me permission.\"\n \n\"Well. Maybe I am. Maybe I don't like the thought of people coming out here... bothering him.\"\n \n\"Oh.\" Malfoy looked grim. \"I'm not good enough to speak to your beloved Headmaster, even?\"\n \nHarry was remembering his own visits to Dumbledore's tomb. He knew other people visited, of course. He had seen flowers... letters... on one occasion a paper bag filled with sherbet lemons: small offerings left on the colourless stone. Had Malfoy been responsible for any of those? Once there was a card which said, simply, \"Forgive me\", in a sloping, elegant hand. \n \n\"No.\" Harry ran a hand through his hair, leaving it in more disarray than before. \"It's not that. Of course you can come and talk to him. I was just... surprised, that's all.\"\n \nThey walked on, the fragrance curling about them, honeyed and soothing. Harry had the fancy for a moment that it was as if Dumbledore himself was smiling approval on the day.\n \n***\n \nThey arrived back to a perfect storm of disapproval. Hermione had become extremely uneasy when they didn't appear at lunch, and when afternoon classes began without them reappearing, had expressed her concern to the Transfiguration Professor. Slughorn was approached, as Malfoy's head of house, and informed everyone that the dear lads were working studiously in the library. When this proved to be incorrect, the alarm was raised. By the time they re-appeared at about four o'clock (driven back partly by Harry's appetite rearing its enthusiastic head again), it was just in time to stop the Aurors being informed, but too late to deflect the deluge of McGonagall's ire, which was poured most thoroughly and effectively on both of their heads.\n \n\n... irresponsible... really thought better of you both... Mr Malfoy, you in particular I would have thought would be keen to keep your nose clean... such immature, selfish behaviour... \n\n\n \n\nIt went on and on. Malfoy set his chin high and his shoulders square, but Harry could feel his arm trembling during some of the more wrathful parts. Without thinking, he felt for Malfoy's hand and squeezed it beneath the cover of their robes. Malfoy's fingers were cool and smooth. Harry suspected his own hand was probably sweaty and calloused, and he dropped Malfoy's pretty quickly, but not before he felt an answering squeeze.\n \nHermione was waiting for them back in Gryffindor Tower, nearly in tears. \"I'm so sorry... I had no idea where you were and I was so worried... why didn't you tell me?\"\n \nHarry patted her on the back as she leant into his embrace. \"It's OK, Hermione. You weren't to know.\" He met Malfoy's eye over her shoulder and grimaced ruefully. \"It was just a spur of the moment thing.\"\n \n\"Sorry, Granger.\" Hermione looked round in surprise at Malfoy's voice. \"I did take good care of him for you. Did you think I'd dragged him into the Forbidden Forest for a spot of Unforgivable practice?\"\n \nHermione gave a half-laugh, half-sob, and buried her face in Harry's shoulder again.\n \nRon came in through the portrait-hole and looked unimpressed at the sight of the three of them. \"Harry! There you are. Decided to turn up at last, then?\"\n \n\"Sorry, mate. Just had to take off for a bit. It's been a tough couple of days, you know?\"\n \n\"Yeah, I can imagine that. Nightmare. I guessed you'd just buggered off for some peace. But... why would you rather be with him, than with us?\" Ron curled his lip. \"That's what I don't understand.\"\n \nHarry looked unhappily at Ron. Hermione straightened up, pushing her hair back from her face. \"You've been no help! I'm not surprised Harry needed to get away, everybody sniggering at him and finding it so hilarious all the time.\"\n \nRon's hands tightened into fists. \"I never! I haven't been laughing at Harry!\"\n \n\"It's the same thing, you absolute clot!\" Hermione gestured angrily at Harry and Malfoy. \"They're both in the same position... you can't make fun of one of them without making the other feel stupid, too. Not to mention, we're meant to be supporting each other, this year. How can we put the war behind us, if we're just carrying on the same petty feuds?\"\n \n\"Petty?\" Flecks of saliva flew from Ron's mouth. \"That bastard's lot killed my brother! And he nearly fucking killed me! There's nothing petty about that.\"\n \nHermione shook her head. \"Do you think it helps anyone to behave like this? We're all quite aware what happened—\"\n \nMalfoy was murmuring in Harry's ear. \"Shall we go? Or will that just make it worse?\"\n \nHarry had no idea, but he thought that if he had to hear any more angry voices after the epic dressing-down they had suffered from McGonagall, that he would go spare. He gestured to Malfoy in the direction of the portrait-hole and they climbed out together.\n \nThey ended up sitting on a windowsill with a view of the Quidditch pitch. Harry looked out towards the horizon. If only they could go for a fly, and forget about all this for a while.\n \nMalfoy was studying his knees. \"I did nearly kill him.\"\n \nHarry felt a shudder at the memory of Ron, lying twitching on the floor. Not unlike another memory of someone helpless, close to death... \"Yeah, well. I nearly killed you.\"\n \nMalfoy winced. \"I am sorry. For all of it. I mean– I wish– \" He covered his face with his hand.\n \nHarry swallowed. \"Yeah. OK.\"\n \n\"She's a bit of a gem, Granger – Hermione. I–\" he swallowed heavily. \"I can see that now. Don't fuck that up. You're a lucky man to have a friend like that.\"\n \nHarry nodded slowly. \"I know it.\"\n \n\"Will you tell her I'm sorry? About calling her– about everything?\"\n \nHarry frowned. \"Tell her yourself.\"\n \nMalfoy thought about this. \"I might. I might do that.\"\n \n\"I know you're going to laugh... \"\n \n\"What?\"\n \n\"I'm bloody starving.\"\n \nMalfoy laughed.\n \n\"I can't face the Hall,\" Harry confessed. \"Can we just eat in our room?\"\n \n\"Merlin. What will McGonagall say?\"\n \n\"She said if we needed some privacy, just to tell her. We can send a message.\"\n \n\"And for god's sake let Granger know this time!\" Malfoy looked doubtful, as another thought occurred to him. \"Weasley won't be pleased.\"\n \nHarry's heart sank. \"No. This year's been tough on him. Tougher than he lets on.” He ran his hand through his hair distractedly. “I'll sort it with him when this is all over.\"\n \nMalfoy grimaced. \"Do you mind not doing that?\"\n \n\"What?\"\n \n\"Mistreating your hair like that.\"\n \nHarry laughed. \"What are you on about?\"\n \n\"It leaves dandruff on my robes. Look!\"\n \nHarry looked. It did, as well.\n \n\"Brilliant. The perfect threat. If you annoy me, I'll flake all over you.\"\n \nMalfoy wrinkled his nose at him. \"You will do no such thing. I'll tell Granger on you if you do.\"\n \n\"You're messing with a hungry man, Malfoy. I advise you to be nice to me, or I might bite.\"\n \n\"Merlin, let's feed the beast. Are you going to get all caveman on me and start beating your chest?\"\n \n\"Would you like it if I did?\" Harry grinned.\n \nMalfoy stood up abruptly. \"Come on then. I could eat something, myself; we must have walked a fair few miles this afternoon. Let's get you back to your cave.\"\n \n***\nIf Harry thought the previous bedtime with Malfoy had been difficult, it was nothing compared to the scene in their shared room as night fell for the second time. The early part of the evening passed quite civilly, even cordially at times; they had played a good dice game Malfoy said was popular with the Slytherin students, then Malfoy rummaged in his trunk for a book, while Harry found a Quidditch magazine to flick through.\n \nMalfoy turned a page of his novel, stretching out on the bed where they had found it most comfortable to lounge while reading. The room was warm, with a fire blazing merrily in the fireplace; Malfoy's feet were bare and he had undone his tie and the top buttons of his shirt again. His long legs sprawled across the oversized bed. Harry's eyes kept flicking to him, drawn as a fingernail is to an itch.\n \nDon't worry, I always used to watch you, too, Malfoy had said. Did that mean that he didn't watch Harry, any more? Harry didn't feel quite sure that he would ever stop watching Malfoy.\n \nMalfoy read on. Harry, however, found he was becoming annoyingly distracted by the fact of Malfoy's proximity. It was somehow leaving him maddeningly on edge. All of Malfoy's movements impacted on his own body and he couldn't help but be intensely aware of exactly how Malfoy was sitting, how he moved.\n \n\"What's the book about?\" Harry asked, seeking a diversion from his strange mood.\n \nMalfoy laughed. \"It's about a man who wakes up one morning and finds himself transformed into a giant beetle.\"\n \n\"Was he Cursed?\"\n \n\"No, he's a Muggle. It's by a Muggle writer, in fact.\"\n \n\"So how does he turn into a beetle?\"\n \nMalfoy shrugged, turning the book over in his hands. \"It doesn't say. It's a metaphor – for alienation, disgust with oneself, you know.\" He looked at Harry. \"No, you probably don't know.\"\n \nHarry's forehead creased. \"Why are you reading Muggle books, anyway?\"\n \n\"Because I like them,\" Malfoy said simply. He met Harry's gaze evenly, as if challenging him to say more. When Harry remained silent, he picked up the book again.\n \nBut when Harry returned to his magazine, he found the words on the page made as much sense as an owl's scratchings on the floor of its cage. His body felt strangely restless and he realised with a sinking feeling what he had been trying to ignore: the fact that he had the beginnings – more than the beginnings – of a decent erection. He tried to focus on other, quite random things: Malfoy's arm pressing against his skin, and the tingling, tormenting feeling of having Malfoy's fingers just millimetres away from his own. They looked smooth, but strong, with their neat, white crescent nails... he had a mad desire to grab Malfoy's hand, to swirl his fingertips over the smooth palm and run them across his skin to stroke the pulse that he could see beating at the wrist.\n \nHarry shook his head as if to clear it. The more he tried to distract himself with these things, the more rampant his erection grew, until he had to use the magazine to cover it.\n \nBrilliant timing, he thought. Of course there'd been other moments since he and Malfoy had become joined, times when he'd – well. He was eighteen, for heaven's sake, and his body worked perfectly normally. But the potential embarrassment and oddness of having Malfoy a few inches away had dampened those errant stiffies pretty quickly. This one, however, Harry recognised as having the solidity and staying power that usually only went away with a firm and decisive wank.\n \nHe looked helplessly at Malfoy, whose lips were curving at something he'd read in the strange Muggle book. There was no possible way that Harry could touch himself without Malfoy noticing. He tried altering his position on the bed; sometimes if he squeezed his legs together really tightly, it helped it go down a bit. The heat from Malfoy's arm was so provoking; it made it impossible to forget he was right next to another person's body, their skin touching, constantly, rubbing against one another.... He wondered yet again why it had to be Malfoy he was stuck here with? They'd always driven each other nuts, and now he, Harry, was finally going to go properly round the twist...\n \nMalfoy's teasing smile as he looked at his book only seemed to make things worse. Malfoy stretched his free arm above his head, yawning, and the smell of spicy, fresh sweat breezed across Harry's nostrils. Malfoy acted so unruffled, but he was human after all, and his body was warm and humming with life. The seam of Harry's trousers threatened to become painful and he had to adjust himself under page 42 of Quidditch Today.\n \nIt's only because I haven't been able to wank for a couple of days, Harry thought. It could happen to anyone in this situation. \n \nMost boys know a few tricks to deal with such occasions. Harry thought about Mrs Figg and the strange and slightly frightening collection of undergarments she would often have drying on a rack in front of her oven. There was always a smell in her house, quite distinctive and like nothing Harry had known before or since. It was a mixture of cats, over-cooked cabbage, and a sickly, rather stale flowery scent which Harry presumed was whatever Mrs Figg used as perfume. Harry's stomach lurched slightly at the recollection of it.\n \nThe candles which lit the room were flickering. It was now quite dark outside, and a breeze filtered in through the window, which Malfoy had opened at the same time as lighting the fire. Harry gazed out at the stars, picking out a few constellations and trying to relax. His mind went to the Astronomy Tower, as it always did, now, when looking at the night sky while at Hogwarts. In his mind he saw a pale arm, shaking with tension; the face distorted with pain and misery; the taunts of the Death Eaters urging him on—\n \n\"Shall we turn in?\" Malfoy asked lightly.\n \n\"What?\" Harry asked, startled back into the room. He realised with relief that he was now only half-hard, at best. Or was it worst?\n \n\"Time to sleep, yes, Potter? It's been a long day since you so thoughtfully woke us up at dawn.\"\n \nHarry felt heat rising along his neck, but Malfoy seemed more amused than annoyed. He nodded, the tension twisting in his stomach once again. \"Sure.\"\n \nThey got changed, Harry wishing more than ever that he had something else to wear other than the mermaid t-shirt. Malfoy seemed quite competent using the spells McGonagall had showed them, even left-handed, but Harry stumbled over the words, and Malfoy had to help him get his shirt off, when he managed to move it a few inches upwards, instead of several feet to the right, getting it stuck round his ears in the process.\n \nThere was something about Malfoy in the floppy shirt, Harry decided, that made it hard to look away: his hair loose once again, his exposed throat, and the shape of his lean body under the flowing material. Perhaps it's because he looks... like a girl, Harry speculated. With his curling blond hair, maybe... and that shirt was a bit like a dress, well, sort of... except Malfoy didn't look like a girl, really, not at all – Harry was well aware of the definition in his shoulders, the narrowness of his hips, the jut of his jaw and the muscular swell of his calves. No, Malfoy didn't look anything like a girl, he just looked like a very... beautiful... boy. Harry swallowed painfully, and tried to breathe normally, to alleviate the tight feeling in his chest. Mrs Figg, he thought. Cats and cabbages.\n \nAfter they used the bathroom, Malfoy busied himself hanging his robes up for the next day, and tucking something into the strange Muggle book, which he placed on his side of his bed.\n \n\"Can we leave the window open?\" Malfoy asked. \"And the fire alight? I always sleep better that way.\" He extinguished the candles without waiting for an answer, and the room was lit only by the low flames of the fire.\n \nTheir bare legs brushed together as they got under the blankets in the darkness. Harry felt heat flare, shockingly, in his belly.\n \nMalfoy stiffened. \"Your feet are freezing, Potter. Kindly keep them to yourself.\"\n \nHarry wrapped the blanket around himself carefully. Their joined arm felt tingly and warm in between them. Again he felt the urge to touch it, to see how it felt to run his hand over his own skin, and then Malfoy's. His fingertips ached to find out.\n \nThere was a shuffling from Malfoy's side of the bed; the hangings opened a little way to let in some light from the fire, followed by a discreet rustling.\n \nHe must be reading his letter again, Harry realised, and then, exhausted, drifted fairly quickly into a light sleep, where images of Ron and McGonagall's angry faces danced in and out of focus; their mouths opened and closed, but only the sound of owls hooting came out.\n \nHe awoke, disorientated. Something was tugging at his arm. No – his arm was shaking – Malfoy was shaking – Malfoy was sobbing quietly and his whole body was shaking with it.\n \nHarry felt as if he were still in a dream as his hand reached out and gently, very gently, touched Malfoy's hair. The softness of it made him want to hold his breath. His senses felt heightened in the humid, dark space inside the hangings and he wasn't sure if he were quite awake. He ran his hand tentatively along Malfoy's head, calming and stroking as he had seen Hagrid do to his creatures, as he had felt his own mother do in dreams. Malfoy seemed completely unaware at first, and the silent sobbing even intensified, but after a minute he took a deep breath and the shaking lessened.\n \n\"Shhh,\" said Harry. He passed his hand over Malfoy's hair again, impossibly daring. There was only a little light from the embers of the fire, but Harry could see his eyes opening, grey and wondering. \"Shhh,\" he said again. \"It's OK.\"\n \nMalfoy trembled and his face screwed up with pain. Another sob escaped.\n \nHarry stroked his hair, moving a little nearer to him on the bed.\n \n\"Sorry,\" Malfoy said thickly. He brought his free arm up to wipe his wet face.\n \nHarry put his arm round Malfoy and pulled him closer. He was shaking, or maybe shivering. Harry took his own blanket and wrapped it over the two of them, before wrapping his arm around Malfoy's narrow back again.\n \n\"It's OK,\" he repeated. He patted Malfoy in what he hoped were comforting motions.\n \nMalfoy choked back a sob and pressed his face into Harry's neck. His skin was hot and damp, and the scent of apples made Harry feel light-headed. He drew back a little.\n \n\"What is it?\" he asked. \"Is it your mother?\"\n \n\"Oh god, don't talk about it,\" stuttered Malfoy. \"Just keep doing that.\"\n \nHarry drew him closer again. He was overwhelmed by the sensation of Malfoy's skin against his. His body felt hard... wiry. He could feel Malfoy's heart thumping against his skinny ribs.\n \nThey lay pressed together, their joined arm trapped underneath them. Malfoy appeared to have stopped crying, but his breathing was still coming in quick bursts. He made a whimpering noise in his throat.\n \n\"It's all right.\" Harry held him tightly. He was a bit trembly himself. His body felt as if it was roaring into life, the embers that had been smouldering all evening now about to burst into flames.\n \nMalfoy's breath fluttered against his neck. It seemed like the most thrilling thing in the world, the moist air blowing across his skin, to and fro. He had not a clue what to do. Holding Malfoy felt like holding his wand: he could feel the power and the thrumming energy within. Malfoy was breathing rather oddly. Harry was about to do – something – he had no idea what – when without warning, Malfoy's mouth opened hotly, moving against Harry's throat. It took Harry a moment to realise what was happening, by which time Malfoy's lips were moving up towards Harry's ear.\n \nThe fire inside Harry blazed brightly and heated every part of him. \"What are you doing?\"\n \n\"Do you want me to stop?\" Malfoy said, suddenly fierce.\n \nHarry's blood was racing around his body. He felt impossibly alive, every nerve ending sensitised and alert. The answer came before he had even time to think. \"No.\"\n \nMalfoy clutched at Harry's hair with his free hand. His lips were sucking, his tongue tasting the skin of Harry's throat.\n \nHarry could feel the tears still dotting Malfoy's cheeks. \"Is this what you want? You're upset,\" Harry said worriedly.\n \n\"Fuck being upset.\" Malfoy sounded almost brutal. He brought his knee up to rest against Harry's hip. Harry could feel the length of Malfoy's other leg, bare against his skin, and a stirring, tingling, everywhere they were touching.\n \n\"But, last night...?\"\n \n\"God, you don't understand anything, do you? Do you want me, Potter?\" Malfoy's eyes were silvery in the darkness. \"I've seen you looking at me.\" It sounded like a threat.\n \nA thousand things were going through his head, most of them along the lines of Just go for it. \"I do... I–\"  Bloody hell. Why not? If it feels good... and bloody hell it feels good. \"Yes.\"\n \nMalfoy ran his hand up Harry's thigh, found his erection and cupped it through his shorts. \"You want me.\"\n \nHoly mother of Merlin. Now he saw what all the fuss was about: why blokes spent half their lives trying to get laid. He felt like he had been too busy dying to find out what it was like to live. \"Yes.\"\n \n\"Say it.\" He squeezed Harry gently and then reached into his shorts, his fingers smooth and clever.\n \nHarry groaned. He thought the flames rippling through him might ignite the both of them. His breath was coming faster against Malfoy's shoulder, and Malfoy's skin smelt almost as good as his hair. \"I want you.\" It felt shocking to say it. He wondered if it was possible to expire from being so turned on.\n \nMalfoy's hand was moving, deft and delicious. Harry felt intense pleasure building, from the balls of his feet up to his spine. Being touched by someone else... the newness, the strangeness of it. This was a hundred times better than the best wank he'd ever had.\n \n\"That feels... so good.\" Harry hips jerked forward as Malfoy twisted his hand just so, watching Harry's face intently. Words were insufficient. \"You're incredible.\"\n \n\"This is just with my left hand, Potter,\" Malfoy murmured into his ear. \"Imagine what I could do with two hands.\"\n \nHarry moaned. This Malfoy, who stroked him like he was born to it, who whispered things to drive Harry insane, this Malfoy was like an unstoppable force. Harry could feel his magic bubbling in his veins and threatening to boil over. He was going to come and there was absolutely nothing in the world he could do to delay it. The whole thing had taken less than two minutes.\n \nHe buried his face in Malfoy's hair and came all over Malfoy's hand, shuddering and crying out. It happened with such force that he felt his balls might actually be turning inside out. He lay gasping, taking breaths of apple-scented hair and wondering what on earth had happened. Was that normal? Did people actually come that hard? He felt he needed to reach down to check if everything was still in place.\n \nMalfoy laughed. \"What are you doing? I didn't Hex anything off, if that's what you're worried about.\"\n \nHarry was dazed and wide-eyed. He ran his hand along Malfoy's arm, from the shoulder to the wrist. He could feel the muscles of his arm, the bones of his wrist, under the thin linen of the shirt. \"Can I touch you?\"\n \n\"I wish you would.\"\n \nHarry reached down and found – God – Malfoy didn't have any underwear on. It felt a bit startling. Malfoy's cock was full, and pressing against Harry's thigh. He didn't know if he could– would Malfoy expect him to–\n \n\"I don't know what to do.\"\n \nMalfoy moved a little, so his cock slid against Harry's fingers. \"Yes you do, Potter.\" There was just a hint of menace to it. \"You know exactly what to do.\"\n \nHarry felt along the length of it warily. It was somehow completely different to holding his own cock. The weight of it in his hand, so solid. There was some moisture at the end. He moved his fingers just a bit, very carefully, setting the velvety skin gliding over the hardness beneath, and getting an instant reaction from Malfoy. He repeated his movement, and Malfoy moaned and bucked his hips. Everything was hot and damp and it felt very strange and quite amazing. Malfoy whined softly and his teeth grazed against Harry's neck, and Harry found that he did, in fact, know exactly what to do, after all. He wondered at first if he was doing the right things, if this was how Malfoy liked it, but Malfoy seemed to like everything that he did, very much, and told him so. \"Yes, yes, just like that, yes, yes, yes... \"\n \nHarry moved his hand down briefly to hold Malfoy's balls, just to feel the weight of them and the hair, so teasing against his palm. Part of him wondered what on earth he was doing, feeling up another boy like this, and, well, loving it so bloody much, but then Malfoy groaned \"Yesss,\" and all he wanted to do was to carry on and make Malfoy say that again. He fumbled with their joined hand, to see if he could go on doing that with one hand, while he stroked and squeezed with the other hand, but it was too tricky.\n \n\"The things I'd do to you, if we weren't stuck like this,\" Malfoy huffed in his ear. Harry felt his own cock stirring and heavy between his legs once again. He wanted to know, he wanted to feel– he wanted to feel everything. He was hungry for it. He grabbed Malfoy's hand where they were joined and held it in his, pinned underneath their hips. Malfoy squirmed and thrust into Harry's fist, dug his nails in to the hand that clasped his, making all kinds of fierce noises in the darkness that had Harry wishing he could see his face better, and then came with a strangled sound, coating Harry's stomach and hand.\n \nMalfoy panted quietly against Harry's neck. A night breeze was coming in from the open window, cooling the spunk and the sweat on Harry's skin. He reached for his wand and cleaned them both up, then lay listening to the silence in the room.\n \n\"Malfoy... \"\n \n\"Mm?\" Malfoy asked sleepily.\n \n\"I really liked that.\"\n \n\"Mmm. Good.\"\n \n\"Can we do it again?\"\n \nMalfoy frowned with his eyes shut. \"What, now? 'M tired.\"\n \nHarry thought. \"Well, now would have been good, but in the morning, then?\"\n \nMalfoy smirked. \"Yes. Perhaps. Now let me sleep.\" He rolled over and lay on his back, face turned away.\n \n\"OK.\" Harry wrapped the blankets around them both again. \"Malfoy.\"\n \n\"What? Potter, you are a menace. A talkative, greedy menace.\"\n \n\"Good night, Malfoy.\"\n \n\"That was it? Good night?\"\n \n\"Yes.\"\n \n\"Good night, Potter. Please remember: any snoring, and it's a pillow on the face.\"\n \nHarry lay watching the fire for a while, as Malfoy's breathing slowed and deepened beside him.  His mind was curiously empty and peaceful. When he drifted off, it was to a healing, dreamless sleep.\n \n***\n \nHe woke up to find Malfoy's free arm flung across him imperiously. Malfoy was lying on his back and snoring like a hippogriff in the soft morning light. Harry watched him for a while, then ran a finger across Malfoy's cheek where his hair was flopping across his face.\n \n\"Wha– Potter? Get off me!\"\n \nHarry narrowed his eyes. \"You were snoring.\"\n \n\"Me? Rubbish. I never snore. You probably woke yourself up, snorting and grunting like the caveman you are.\" He rubbed his eyes and looked around. \"What time is it?\"\n \n\"Early.\"\n \n\"How early?\"\n \n\"Not too early, for this,\" Harry said, with a shy boldness. He pushed his legs against Malfoy's and ran his hand down his spine, to rest on the swell of his arse through the nightshirt.\n \n\"Oh, Potter.\" Malfoy sounded disappointed, but his eyes glittered with mischief. \"What a filthy young Saviour you are.\"\n \nHarry laughed and poked his erection into Malfoy's hip.\n \nMalfoy rolled on his side so he was facing him. \"You're very keen.\"\n \n\"Of course I'm keen. I'm eighteen years old, and last year I sort of died, without even getting a shag first.\"\n \n\"I didn't even think you were gay. Not that I've given it a lot of thought, of course,\" Malfoy's mouth twitched into a smile.\n \nHarry looked serious. \"I don't think I am... I just like you, I think.\"\n \nMalfoy's hand started to explore, under the blankets. \"Well, you feel pretty gay at the moment, to me. This part, especially.\"\n \nHarry pulled Malfoy nearer and nuzzled into his jaw. His faint stubble rasped against Harry's skin. It felt brilliant. \"Seems like today is starting out a lot better than yesterday.\"\n \nMalfoy didn't answer. His hand moved possessively, with fierce concentration, to stroke Harry's legs... the crease of his arse... \n \nHarry licked along Malfoy's chin to the corner of his mouth, then hesitated. His lips looked soft and had a delicious curve to them. Can I kiss him? Merlin, how does this work? Malfoy's fingers were doing wonderful things. Harry groaned, pushing himself against Malfoy's body greedily.\n \n\"I'm going to show you something you're going to love,\" whispered Malfoy. He looked at Harry's mouth, so close to his. \"But first... why don't you go ahead and kiss me?\"\n \nHarry's eyes opened wider and he took a breath before moving his mouth against Malfoy's. He tried to go gently at first, but Malfoy's lips parted and Harry's tongue slipped inside. Fuck. I'm kissing Draco Malfoy. Somehow it felt much more intimate than what they had done the night before. Malfoy's mouth was warm and sweet. Harry moaned against his lips as Malfoy wrapped his fingers around Harry's cock.\n \n\"Show me the thing,\" Harry said. He thought he might go mad if he didn't get to feel it, if he didn't get to try it all, right now.\n \nMalfoy moved his hips, and lifted his shirt up over his stomach, so that his cock was jutting against Harry's. The look of it, flushed and thickened, with a bead of moisture at the end, made Harry's stomach tighten, and his own cock bob eagerly.\n \nMalfoy took Harry's hand, brought it to his face and licked it in a long sweep, from the fleshy pad right up to his fingertips, Harry shivering at the hot, wet, slide of the tongue dragging along his palm. Malfoy wrapped Harry's hand around both their cocks, pressing them together in his palm. This was something Harry had never thought to see; just the sight of Malfoy's cock rubbing up against his own was intensely arousing. The differences in colour and shape fascinated him. It was like looking at their joined arms, but with an added erotic charge that gave Harry an insatiable feeling deep in his belly.\n \nGoing slowly, Malfoy guided Harry's fingers to move up and down their two shafts, wanking them both in tandem. Harry held his breath: he could not believe how amazing it felt. He  wondered why anyone ever bothered doing anything else. When Malfoy cupped the back of Harry's head and wound his fingers into his hair, Harry started to move with less care, and to thrust into his fist as he moved his hand around them both. Malfoy's face was extraordinary. Watching him gradually misplace his composure and start to lose himself in enjoyment was the most riveting thing Harry had ever seen.\n \nMalfoy threw his head back and moved his skinny hips to push into Harry's hand. The sinews of his neck were standing out and his face was slick with sweat. Harry mouthed and bit at his throat, his jaw, then his lips, not really aware of what he was doing, just seeking out contact, friction, pain and pleasure all at once. He felt almost frightened to come, remembering yesterday's experience, but his orgasm, when it came, crashed over him with a intense sweetness. He sobbed his release into Malfoy's mouth, and felt Malfoy coming in his hand shortly after.\n \nHe pulled Malfoy to him, relishing the sticky, sweaty mess they had made.\n \n\"A shower,\" Malfoy said firmly. \"I need a bloody shower.\"\n \n\"Not yet,\" growled Harry. \"In a minute.\"\n \nMalfoy grumbled, but muttered a few Evanescos, and then permitted Harry to wrap an arm around him, and to lay kisses on his pinkened, chafed face, until they dozed off again.\n \n***\n \n\"Potter! Potter, wake up!\"\n \nHis shoulder was being shaken. Both of his shoulders were being shaken. By Malfoy's two hands.\n \n\"The fucking thing has worn off!\"\n \nHarry sat up with a start. Their arms were free. Totally free. Malfoy was looking at his arm in disbelief.\n \nHarry shouted with joy. \"Merlin! It's actually worn off!\"\n \nMalfoy sprang up from the bed. \"I can walk over here! Ha! And I don't have to fucking bring you with me!\"\n \nHarry got up on his knees and started bouncing on the bed. \"They were right! It just wore off.\"\n \nMalfoy did a little lap of the room. \"God that feels good! Freedom.\"\n \nHarry laughed and jumped off the bed. He looked at his arm carefully. \"It looks just the same as before.\"\n \nMalfoy came over and held his arm next to Harry's. \"Mine too.\" His face was lit up.\n \nHarry grabbed him and hugged him with both arms. \"I can do this now.\"\n \nMalfoy pushed him off. \"Sloppy git. I can have a shower!\" He beamed with delight.\n \n\"I can come with you.\" Harry raised his eyebrows hopefully, feeling an unpleasant cold weight in the pit of his stomach all of a sudden. What if Malfoy didn't want to... now they were separated?\n \nMalfoy wrinkled his nose, then laughed. \"Whatever. Come on!\"\n \nThey ran into the bathroom. As well as the toilet, and sink, there was a large shower area running the length of one of the walls.\n \nHarry launched into stripping off his clothes. Malfoy hesitated, then started undoing his shirt. He watched as Harry shrugged off his top and shorts, then began laughing.\n \n\"Merlin's hairy bollocks, Potter.\"\n \nHarry was indignant. \"What?\"\n \nMalfoy stepped closer and placed his hand on Harry's chest, taking in the lean muscles, the curling black hair, the flat stomach. His hand moved lower, skating over his neat waist and round to his bum. \"The way you dress... and all the time this is hiding underneath.\"\n \nHarry smiled, his cheeks pink. He fingered a button on Malfoy's shirt. \"I want to see you.\"\n \nMalfoy frowned, but let Harry undo the shirt and slip it from his shoulders. His narrow chest was sliced across with white scars. Harry winced and shut his eyes.\n \n\"I know how I look,\" Malfoy said coldly. \"No need to say anything.\"\n \nHarry opened his eyes again. Malfoy was holding himself very straight. The scars looked bumpy at the edges and angry-looking in places. Harry reached out to touch one which ran close to Malfoy's nipple.\n \n\"I've got scars, too,\" said Harry. \"I think all of us have, who were in the war.\" He showed Malfoy in turn, the burnt shape of the locket on his chest, the gash on his forearm where Pettigrew had robbed him of his blood, the white tracings of words on his hand.\n \nMalfoy looked, and nodded grimly.\n \n\"I thought he healed you,\" said Harry. \"I didn't know.\"\n \n\"Not even magic can heal everything.\" Malfoy held out the arm with the Dark Mark branded on it, and whispered the words to end the Glamour which partially concealed it. \"This won't go away, either, though it does seem to fade.\"\n \nHarry stepped nearer to Malfoy, his eyes running all over him. The Dark Mark was shocking, yes, with its brutal lines and macabre depiction, but it didn't interest Harry at the moment. The nightshirt had hinted at the shape of Malfoy's body, but now Harry could see the exact contours, the smooth paleness of his skin, and his strong, lean silhouette and the neat swell of his arse. A now-familiar appetite stirred in him.\n \n\"You know when you said the things you would do to me... if we weren't stuck?\"\n \nMalfoy nodded, his face serious.\n \nHarry reached out to touch Malfoy's face. He willed his hand to remain steady, his fingers tracing the line of his jaw. \"Show me, Draco... I need you to show me.\"\n \nMalfoy's face darkened and for a moment Harry thought he was going to need his wand to defend himself, the wand he had stupidly left in the bedroom, but instead Malfoy turned around and set the shower running with an abrupt movement.\n \nHe pushed Harry backwards into the shower and stepped in after him. The water poured down, flattening Harry's hair and spraying onto Malfoy's skin. Harry followed the trails of water over Malfoy's body with his eyes hungrily. The water felt so good and Malfoy was fucking gorgeous, scars and all. Malfoy pushed him back against the wall and leant in, hands either side of his shoulders, to give him a fierce kiss. Then he dropped to his knees and took Harry into his mouth, while Harry watched with a mixture of gratitude and disbelief.\n \nCoherent thought quickly fled from Harry's mind; his awareness shrank to the sensations of his back pressed up against the cold tiles, warm water battering down on his body, and Malfoy's lips wrapped firmly around his cock, but afterwards he remembered thinking that Malfoy's tongue was exactly as wicked as you would expect it to be.\n \n***\n \nThey agreed it would be simplest to go down to breakfast separately. Malfoy was taking his time, doing his thing with his hair, and fussing about with charms for the redness on his face and throat, while Harry was eager to show Hermione the bond had ended, and hopefully straighten things out with Ron. They had agreed this, Harry reminded himself. It was only that his arm felt strange – a little cold, a little exposed – without Malfoy's arm next to it. It was to be expected that he would become accustomed to it, over the course of the few days they had been joined. It just felt odd, not being able to turn and see what Malfoy was doing, guess what he was thinking. Harry rubbed his arm and shivered. He supposed everything would get back to normal now. Kind of.\n \nAs Harry neared the Great Hall, someone called out \"Harry! Your arm's better!\" and the whole group of students about to go in for breakfast stopped and gathered around him with questions and congratulations. Looking past the excited faces, he saw Hermione on her way, and grinned. Things were going to be OK.\n \nHarry was explaining for the third time how it had just worn off, when Malfoy approached, looking tired but cheerful. McGonagall was close behind him, and shooed everyone else away into the Hall.\n \n\"I'm very pleased to see you gentlemen appear to be right as rain again. When did this happen?\"\n \nHarry explained for the fourth time, with Malfoy nodding agreement. McGonagall examined their arms carefully. \"So... no long-term effects, it appears.\" They grinned at each other.\n \nSomething must have caught her attention because she looked at their faces, searchingly. \"Or... are there?\"\n \nHarry squirmed a bit. McGonagall always made him feel as if she knew everything that went on.\n \nMalfoy lifted his chin and met her squarely in the eye. The corner of his jaw was rather grazed.\n \n\"Hmm. Something gives me the feeling, gentlemen, that this unfortunate experience could have lasting benefits for both of you, if you allow it to.\"\n \nHarry's eyes were wide, but he said nothing.\n \n\"You may be right, Headmistress,\" said Malfoy. \"Now, will you excuse us if we go and eat? I believe Potter here will be feeling particularly ravenous.\"\n \nHarry had eaten some breakfasts in his time, but this was an outstanding effort, even for him. It felt odd not having Malfoy next to him, but bloody marvellous to be able to eat with both hands, and to enjoy his food without the awful guilty feeling of people all around him being shitty to Malfoy. He glanced over at the Slytherin table, where Malfoy looked quite contented and was chatting with Theo Nott.\n \nRon sat on his left. In Malfoy's place, thought Harry, then instantly felt disloyal. It was brilliant having Ron here, and Merlin knows he had missed his steady, cheerful company very badly. \"What a relief, eh?\" Ron asked, buttering toast. \"Now we can all get back to normal.\"\n \nNormal. That word, again. There seemed nothing normal about sitting here, eating bacon with the Gryffindors, thinking about Malfoy's mouth on him. Of how he had looked up at Harry, eyes full of devilry, and smirked around Harry's erection as he sucked him. Harry felt his cock twitch again at the memory.\n \nHarry leant forward and took another large helping of eggs, then one of mushrooms. Then two more slices of toast. He caught Hermione staring. \"What?\" he asked. \"Got to keep my strength up.\"\n \nHe glanced at Malfoy again. He was laughing with Nott about something, and picking apart a piece of toast with his clever, long fingers. Harry found he was properly hard under the table again, just looking at him, and thinking about this morning. And last night. He thought this might keep happening, well, forever, really. Thank goodness for robes.\n \nHermione gave him an appraising look. \"It must have been very difficult for you, Harry, the last few days.\"\n \n\"Must have been bloody horrendous, \" said Ron.\n \nMalfoy turned slightly, as if sensing himself being watched. Harry caught his eye and gave him a shy smile. Malfoy smirked back, carefully licking his fingers clean of jam.\n \n\"Oh, I don't know.\" Harry loaded up his fork with more food, and shifted in his seat, trying to adjust himself under the table. \"It wasn't all bad.\"\n \n***\n \nHarry sat with Draco's head cradled in his lap. They had a certain spot where they always liked to stop. The sun was stronger now, and the early foliage of the broad oak tree provided the shade Draco preferred.\n \nDraco twisted his head to look up at him. \"You did tell them, then? And how did Weasley take it?\"\n \nHarry threaded his fingers through the silky strands of Draco's hair. He thought of Ron, the uncomprehending, horrified expression on his dear friend's face, the appalled questions, the tumblers of Firewhisky which had to be drunk before Ron could even bear to think about it without groaning aloud.\n \n\"Well... he was a bit surprised.\"\n \n\"And Ms Granger?\"\n \nHarry smiled, remembering Hermione's words. \"I guessed that day at breakfast, Harry – when I saw the amount you were eating. Even for you, it was impressive. Ron's just the same, when we've been–\" She had broken off hastily and coughed in embarrassment. \"Anyway, I kind of knew.\"\n\n \n\n\"She was fine,\" Harry replied.\n \n\"Yes, well, that's because she's an absolute bloody diamond, that one.\" Draco wriggled his head to get comfortable, and stretched his legs out contentedly.\n \nHarry felt annoyed. \"You always say that as if you think you're the first person to find it out.\"\n \n\"Maybe I am; you're too much of a fuckwit to know these things until I tell you.\" Draco's hand crept into Harry's robes, seeking the warm skin beneath, and softening the insult.\n \n\"So when are you going to tell your friends?\" Harry asked.\n \n\"I rather thought our return visit to the dungeons yesterday was adequate explanation for them. Slytherins catch on a bit quicker than Gryffindors, you know.\" Draco aimed a smirk at Harry.\n \nHarry thought back to how every head had turned as they had entered through the passageway together.\n \n\"It's dear Draco... and Potter again!\" Zabini had greeted them joyfully, from exactly the same spot he had occupied on their previous visit. Harry wondered if his arse was permanently stuck to that sofa, waiting for people to come in so he could make mocking remarks about them. From the practised way he appeared to be holding court, his body sprawled comfortably across the green leather, Harry guessed it was probably the case.\n \n\"Blaise,\" Draco returned with apparent nonchalance, his eyes scanning around the room and flicking over the groups of students reading, talking, or playing games together.\n \n\"Well, well, and to what on earth do we owe the honour this time? You do know where you are, don't you, Potter? You didn't take a wrong turning and end up down here with us snakes by accident?\"\n \n\"You know we're allowed visitors from any house, this year.\" Draco spotted Theo sitting at a table to one side and raised an eyebrow, and one hand, in greeting.\n \nZabini tipped back his head and laughed. \"Indeed, we are allowed! But nobody ever comes here. Far too risky to associate with any of us.\" His eyes gleamed. \"Is Draco going to give you the full tour, then, Potter? I remember you could hardly wait to leave, last time.\"\n \nHarry rested his arms on the back of the sofa where Zabini was lounging. \"I'm hoping he will, yes. I'm very interested in him showing me... everything.\"\n \nBlaise turned to make quite sure everyone was getting the full benefit of this conversation. Most people, though some pretended to be carrying on with their activities, were clearly paying close attention. \"Are you, now? How delightful for Draco.\"\n \nHarry smiled, showing his teeth. \"Well, in fact, it's quite a pleasure for me, actually.\"\n \nDraco stepped in beside him, his mouth close to Harry's ear. \"Shall we?\"\n \nHarry nodded, and made sure to speak loud and clear. \"I've always wanted to see if the Slytherin dorms are more comfortable than the Gryffindors'.\"\n \nDraco laid his hand on the small of Harry's back. \"This way, then. Everyone's busy in here, so we'll have the place to ourselves, Potter. You can take your time and have a good look at everything.\"\n \nHarry grinned at Zabini's astonished face, as he allowed himself to be steered towards the dormitory. In truth all they did was lie on Draco's bed, laughing together quietly, and exchanging the occasional kiss, but Harry had made sure to let his hair stay in its state of disorder when they got up to leave, and deliberately loosened Draco's tie from its usual neat position. The thought of it made him want to laugh, even now.\n \n\"How long till Herbology?\" Draco asked, bringing him back to the gentle sunshine and the solid presence of the tree at his back. \"Do we need to leave yet?\"\n \n\"Nah, we've got ten minutes.\" Harry suddenly remembered what he'd been meaning to ask. \"Did I see you got an owl at breakfast? Any news about your mother?\"\n \n\"Ah, she's a touch better, apparently. It's sweet of you to ask.\" Draco's hand in Harry's robes was searching, stroking... \"I don't want to think about that now, though. I think we should celebrate having told people our good news.\"\n \n\"And what good news would that be?\" Harry teased, letting his eyes travel down the length of Draco's body. He wondered if they could risk... certain activities out here, or not. He hadn't brought the Invisibility Cloak, this time. He thought with longing of the outsized bed they had shared when their arms were joined. The things he would do, now, if he could lay Draco down on it, and...\n \n\"The good news that you're getting a regular seeing to, and are thus no longer such a grumpy arse all the time. What is this under my head, Harry? There's something extremely hard digging into me.\" He rubbed his head against Harry's lap, very pleased with himself.\n \nHarry bent to kiss the smirk from his infuriating face. The feel of Draco's mouth against his never failed to amaze him. The pillowy softness of it, and how Draco could respond at first so delicately, sweetly, in response to his kiss, and then gradually overcome him with sensation, his tongue taking possession of Harry's mouth and leaving him weak and breathless. If their mouths were combatants, Harry took great pleasure in the battle, and was happiest in defeat.\n \nDraco broke away, long before Harry was ready to give up the delight of the skirmish. \"Here's something else I know, that you don't.\"\n \n\"What's that?\"\n \n\"I'm going to make sure we're very, very late for Herbology.\"\n \nCLICK HERE TO RETURN TO LIVEJOURNAL TO COMMENT (or comment below or in both places!)"
}