{
    "id": "8676250",
    "url": "https://archiveofourown.org/works/8676250?view_full_work=true",
    "author": [
        "AgentMalkere"
    ],
    "title": "The Cigarette Case",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Fantastic Beasts and Where to Find Them (Movies)"
    ],
    "relationships": [
        "Original Percival Graves/Newt Scamander"
    ],
    "characters": [
        "Newt Scamander",
        "Original Percival Graves",
        "The Niffler"
    ],
    "additional_tags": [
        "really more pre-Graves/Newt",
        "Very Pre",
        "the niffler and its sticky paws",
        "Newt's Magical Menagerie"
    ],
    "language": "English",
    "series": "",
    "published": "2016-11-27",
    "completed": "2016-12-11",
    "words": "6,764",
    "chapters": "4/4",
    "comments": "476",
    "kudos": "12,652",
    "bookmarks": "2,639",
    "hits": "95,476",
    "summary": "<p>Apparently even Gellert Grindelwald isn't immune to a niffler's sticky paws. </p>\n<p>(In which Newt was not expecting to find Percival Graves in a stolen cigarette case.)</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>This is why you never think to yourself, \"Finally, a fandom I'm not inspired to write for!\" It just provokes the plot bunnies.</p>\n<p>I hope you all enjoy this unanticipated second chapter! It is dedicated to every lovely person who reviewed or left kudos! Thank you all so much!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>There is a distinct possibility that there will be a third chapter if people are interested. I have some ideas.</p>\n<p>Thank you SO MUCH to everyone who reviewed the last chapter! I'm going to reply to all of you individually - but I figured you'd probably want to have the new chapter first. ;)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>You know how I said I had ideas for a third chapter? None of them are in this chapter. I see a fourth chapter on the horizon now that wasn't there before. (It just keeps growing!)</p>\n<p>Also, shout out to <b>allseer15</b> for the wonderful mental image of Newt asleep under all his magical creatures! I just had to include it. &lt;3</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>Every time I think I'm done with this story, I turn around and I've written another chapter. :) At the moment I'm not entirely sure where I'd like to go next with this, though one lovely reviewer has suggested dragons.</p>\n<p>Thank you all for your continued support! You are the reason this story keeps growing!</p>\n<p>This is why you never think to yourself, \"Finally, a fandom I'm not inspired to write for!\" It just provokes the plot bunnies.</p>",
    "text": "The ship was about an hour out from dock when the niffler made yet another bid for freedom.  This time, though, Newt was ready for it.  He caught the little creature by its hind leg just as it finished squirming free of the case and made a mental note to get the latches fixed as soon as possible.  The niffler gave him its best wide-eyed, innocent look which really wasn’t even remotely convincing.\n“Nice try,” Newt informed it and then, out of habit, gave the niffler a shake to make sure it didn’t have anything shiny and stolen in its pouch.  Obviously it wouldn’t, since it had only just gotten ou-\n\nClunk.\n\nThe niffler pouted at him as Newt stared at the floor in surprise.  A stylish, silver cigarette case lay on the floor of his tiny cabin.  It was tastefully decorated with a swirling line pattern engraved in the metal.  Blast.  Where had that come from?  \n“You and I are going to have a chat later,” Newt told the niffler.  The niffler just pouted at him.  Newt returned the creature to his case, latched the lid, and then, after a moment’s thought, sat on it for good measure.  He did not want to be chasing any of his creatures through a boat full of muggles.  Again.  The poor things got so confused and upset when that happened, and after Jacob Kowalski, well… Newt just didn’t have the heart to obliviate anyone at the moment.\nNewt leaned back against the frame of his narrow bed, his knees bent and feet flat on the floor.  It had been very nice of the MACUSA to pay for his ticket – he never would have been able to afford a private cabin on his own.  He glanced down at the cigarette case still lying next to his right shoe.  With a sigh, he picked it up.  It was oddly heavy and made his fingers feel ever so slightly tingly for some reason.  Maybe the owner’s name would be engraved on the inside of the lid.  A lot of people did that.  He could owl it to Tina and Queenie if that was the case, and maybe they would be able to track its original owner down.  Without any further thought, Newt popped open the catch.\nHe had just enough time to realize that the tingling in his fingers had been caused by an almost completely decayed suspended animation hex and then things got very exciting.\nBecause a man popped out of the cigarette case.  A man with a very familiar face who was looking somewhat dazed but also rather livid.\nApparently even Gellert Grindelwald wasn’t immune to the thieving paws of a niffler. \nNewt didn’t have much time to ponder this, though, because a fraction of a second later he was being tackled by an irate auror.\n“Give me your wand, or I’ll kill you before your beloved leader Grindelwald ever has the chance.”  Percival Graves was obviously not at his best.  His normally neat hair was mussed, his suit was dusty and rumpled, and the suspended animation hex hadn’t prevented the beginnings of a beard from growing on his chin.  There was also a slightly wild look about his eyes.  Just how long had he been in that cigarette case?\nNewt made a sound very much like “urk” partially because Graves was putting a bit too much pressure on his throat and partially because there was an attractive, if somewhat feral, man suddenly sitting on his chest.  Newt’s ears turned red, and he desperately tried to break eye contact. \n“I’m Newt Scamander, magizoologist,” Newt finally managed to wheeze.  “My niffler apparently stole the cigarette case you were in.”\nGraves stared at him blankly.  His grip didn’t relax even slightly. \n“Your what?”\n“My niffler.  Magical creature – rather like a magpie.  They love shiny things.”\n“The transportation and importation of magical creatures is illegal in America.”  The response sounded entirely automatic, but Graves was starting to look just a little less wild around the eyes.\n“Ah.  Yes, but we’re not in America any more, and the MACUSA decided not to arrest me since I helped them capture Grindelwald.”  This finally seemed to get through to Graves.  His grip on Newt’s neck finally started to loosen.\n“Grindelwald is in custody?” he asked.  His voice was calmer now, much more similar to the unflappable tone Grindelwald had used when impersonating him.  Then his eyes narrowed.  “I don’t believe you.”\n“Copy of the Magical Times in the left inside pocket of my jacket.”\nGraves fished out the newspaper as Newt’s face grew progressively redder.  He looked at the headlines, looked at the photo on the front paper, and released Newt.  Then Graves looked at the date on the paper and his knees nearly buckled. \n“Three months.”  The words were more like a barely audible gasp.  The newspaper crinkled where Graves’s fingers were clenching too hard.\nNewt fussed with his vest and checked that Pickett was still safely tucked in his collar.  What was he supposed to do in a situation like this?\n“No one was sure when you had been replaced,” he admitted uncomfortably.  “They didn’t even know that you were still alive when I left.”  Tina had told him that.  No one had thought that Grindelwald would keep the real Percival Graves alive.\n“Left,” Graves repeated, looking up from the paper.  “You said before that we weren’t in America anymore.  Where are we?”\n“On a boat.”  Then Newt added, “To France,” because that was probably important information that Graves would like to know.  “We’re more than an hour out from shore – too far to apparate – and also President Picquery made me promise not to come back to America for at least a year.”  Newt frowned to himself.  It was awfully problematic.\nGraves stared at him.\n“Grindelwald took my wand.  Can you make a portkey?”\n“Ah… no.”  Silence stretched between them awkwardly.  Newt fiddled with the button on his coat sleeve.  “I suppose you could sleep on the cot in my workshop until we reach France,” Newt finally suggested.  “We can get you an international portkey home from the Paris branch of Gringotts once we make port.”\n“Your workshop?”\n“Yes,” Newt patted the side of his suitcase.  “Sometimes I sleep there when one of my creatures is ill.”\n“Right.”  Graves eyed Newt’s case uncertainly, and Newt gave him a slightly awkward smile in return.\nAnd here he’d thought that his life was going to quiet down for a bit after that fiasco in New York.  Apparently that just wasn’t meant to be.\nGraves was still staring at Newt like he suspected that Newt’s brain was entirely addled.  Newt floundered for a second and then rallied.\n“It’s quite a comfortable cot.”  Graves still didn’t look impressed.  “It’s only six days until we reach France,” Newt tried.  He glanced at Graves’s face to gage his reaction and then looked away again.  Maintaining eye contact was uncomfortable.  Instead he focused on the pale smear of dust on the left shoulder of Graves’s jacket.\n“You want me to stay in a confined, magically-altered space… after being trapped in one against my will for three months,” Graves stated slowly, his face entirely blank.\nAh.  Newt hadn’t thought of it like that.\n“Well, you don’t have to stay in there the entire time,” he amended quickly, “and it’s really quite spacious.  I spend quite a lot of time down there.  And all of the creatures are spelled to encourage them to stay in their habitats,” he added as an afterthought.  Some people got fussy about that sort of thing.  Newt, personally, didn’t mind waking up after a long night in his workshop with his hair full of bowtruckles.\n“Encourage them to-” Graves started and then stopped as if he couldn’t bring himself to discuss the matter further.  He didn’t quite sigh, but Newt got the impression that he wanted to.  “Do you at least have a communication mirror so that I can let President Picquery know that I’m still alive?”\n“…not anymore.”  Communication mirrors were expensive, and Newt had accidentally crushed his about four months ago when the erumpent had been ill.  Speaking of the erumpent-  Newt checked his pocket watch.  He really ought to head down and feed everyone.  He knelt down and popped the latches on his case.  “Come on.  I’ll introduce you to everyone.”\nNewt climbed into his suitcase, absently tucking the now empty cigarette case he’d still been holding into his pocket as he did so.  After a few long minutes, Graves reluctantly followed him.\n \nEverywhere Percival Graves looked his brain kept pointing out things and categorizing them – illegal, less illegal, incredibly illegal, probably not illegal.  It was easier than trying to come to terms with the fact that he had just spent several months trapped in a cigarette case while the darkest wizard of their age had impersonated him and nobody had noticed.  It probably would have helped if Graves had had friends outside of work… friends in work… friends in general.  He’d spent too much of his life holding everyone at a distance.  It had made him far too easy a target.\nHe pushed that thought aside and focused on Newt who was happily receiving a tentacle hug from the baby graphorn.  There, Graves’s cynical brain decided, is a man who does not have his permits in order.  Oh, he probably had some somewhere, but he looked like the type who would produce a wad of forms when asked and not be entirely certain which one was which.  Normally, this sort of person annoyed Graves to the extreme.  He was, by nature, organized and efficient, but there was something oddly charming about Newt.  Perhaps it was his shear enthusiasm and obvious affection for the magical creatures he smuggled from country to country.  Or their obvious affection for him.\nThe baby graphorn released Newt and went cantering off to join its parents.  Newt smiled after it.\n“They’re really quite gentle if you approach them right.”  Somehow Graves doubted that.  “Here.”  Newt handed him a bucket full of pellets.  “Mooncalves next, and they’re…” he trailed off for a moment and stared down at the bucket.  The corner of his mouth twisted down ever so slightly.  “They’re very accepting of strangers if rather shy,” he finally finished.\n“You want me to feed to them,” Graves stated, a touch disbelievingly.\nNewt brightened up again at this.\n“Of course.  If you’re going to be spending time here, it’s best if everyone gets to know you.”\n“Right.”  He had been an auror for more than a decade.  He could handle feeding a few bizarre, questionably-obtained, magical creatures if it would help him get back to America.  He’d done much worse jobs.\nA small herd of creatures was waiting for them by a rock outcropping under a moonlit sky.  They had thin, delicate legs and massive nocturnal eyes that reminded Graves a bit of an owl.  The tallest of them came up to about his waist.  With a mental shrug, Graves grabbed a handful of pellets out of the bucket and tossed them to the mooncalves.  The pellets floated instead of hitting the ground.  The mooncalves stretched their necks and delicately plucked pellets from the air one by one.  It was actually rather charming to watch.  Graves felt something like a smile trying to pull at the corners of his mouth and squashed the urge.\nNewt was down on his knees examining a mooncalf’s foot.\n“There we go.  You just bruised it a bit – nothing’s broken,” he assured the creature softly.  He produced a tin of salve from his pocket and began carefully massaging a dab of it into the mooncalf’s sole.  It made a very faint noise that sounded sort of like mrrrrrup and rubbed its head against his shoulder.\nGraves looked away and tossed the rest of the herd another handful of pellets.\nIt took another hour to finish feeding all of the creatures in Newt’s case, and if Graves never had to see another swooping evil eat its supper again, it would be too soon.\n“Oh, here.”  Newt pulled a silver cigarette case from his vest pocket and offered it to Graves.  “This is what I found you in, so you should probably have it.”\nGraves eyed the cigarette case for a moment before accepting it with only the barest outward signs of reluctance.  If he’d had his wand handy, he would have been sorely tempted to melt the thing into slag right then and there, but he didn’t have his wand and, besides, that would have been highly unprofessional.  The thing was evidence after all.  He slipped it into one of his inner coat pockets.  It felt like a lead weight.\n“Thank you.”\n“I’ll, uh, just go and get us some supper then.”  Newt was looking uncomfortable again in that way that, Graves was starting to suspect, was reserved only for when he was dealing with humans.  He scurried back up the ladder out of his workshop before Graves had time to respond.\n \nLater that night, Graves was awoken by a slight weight leaning against his ribcage.  His eyes popped open instantly.  The niffler blinked back at him innocently as if it didn’t have a familiar cigarette case clenched in one paw.  Graves caught the creature by the back of its neck in a quick snap of reflexes and plucked the cigarette case out of its paw.  The niffler widened its eyes and attempted to look as doleful as possible.\n“This is evidence,” Graves informed it seriously, and then felt ridiculous for talking to a creature as if it could understand him.  The niffler widened its eyes even further.  It reminded Graves of Walter Flitpenny, a petty thief and pickpocket he had arrested on numerous occasions in his younger years.  Flitpenny had always tried to look innocent when caught red-handed, too.  The niffler looked like a Walter.\nThey stared at each other for a few more minutes.  Walter the Niffler made a soft and incredibly pathetic noise that wasn’t exactly a whine.  Graves glanced at the hated cigarette case in his hand.\n“Fine.”  It was far easier to hand over the cigarette case than it probably should have been.  He knew where the niffler’s nest was.  He could always retrieve the case before he left.  It wasn’t like they were lacking evidence against Grindelwald.  The man’s actions in Europe weren’t exactly what one could call subtle.  Graves let go of Walter and handed it the cigarette case.  Walter reached for the case slowly, watching Graves suspiciously the entire time, and then it snatched it and scuttled away.  Graves watched it go and then turned his gaze to the workshop’s ceiling.\nThree months and nobody had noticed it wasn’t him.  Maybe that was why he wasn’t as eager to get back as he might have been.  Ever since he’d joined the ranks of the aurors right out of school, his entire life had revolved solely around his job.  And he enjoyed his job.  What he did was important.  Why wasn’t he more eager to return?\nGraves rubbed a hand over his face, closed his eyes, and did his best to drift back to sleep.\n \nWhen Graves woke up next, it was to the sound of Newt muttering to himself as he made notes at his desk.  There were several warm, purring weights nestled on his chest.  Graves blinked at the spherical balls of fluff.  What had Newt called them yesterday?  Oh, right – puffskeins.  A long, thin, pink tongue darted out of one of the puffskeins and tried to lick Graves’s nose.  He sat up and the creatures rolled into his lap, still making contented purring sounds.\n“Good morning,” Newt looked up from his writing and smiled.  He was holding something that looked suspiciously like the swooping evil’s pocket-sized form.  “I brought breakfast back for you, but it’s up in the cabin.  The puffskeins are terribly fond of jam and steal biscuits if you don’t keep a close eye on them.”\n“Thank you.”  Graves stood and made a futile attempt to brush some of the wrinkle out of his shirt.\n“You’re welcome.”\nGraves headed up the ladder out of the workshop.  His shoulders felt loose and relaxed in a way they hadn’t felt in years.  It was… pleasant.  And, added a little part of his mind so quiet that it was almost subconscious, perhaps something he wouldn’t mind getting used to.\nNewt was lost in the wonders of swooping evil venom when a hand appeared in his peripheral vision resting on the edge of his desk.\n“Where are your permits?”\nNewt blinked and tried to refocus on the not-magizoological-related present.  Graves was watching him with the serious expression he always seemed to be wearing.\n“Pardon?”\n“Your permits.  Where are they?  I would like to look them over.”\nNewt frowned a touch.  People asking to see his permits was generally followed by a lot of arm waving and shouting and running.  Still, the puffskeins seemed to like Graves, and they were a good judge of character over all.  Newt had yet to meet a wholly unpleasant person whom puffskeins were willing to sleep on.\n“Oh, I keep them in-” Newt had to pause and think for a moment and then snagged his blue tweed coat off the back of his chair, “-here.”  He produced a slightly battered wallet which had a charm on it similar to his case.  He rummaged around in it for a second and then pulled out a messy stack of paperwork.  Oh good – it didn’t look like he had lost anything.  “There you are.”  Newt proffered the papers to Graves.\nGraves accepted the papers with an expression that bordered on resigned. \n“Thank you.”  He flipped through them with the increasing look of pain that most of the customs officials Newt had encountered in the past had shared but he didn’t seem to be about to burst into indignant shouts.\nSatisfied that Graves and the permits could take care of themselves, Newt re-submerged himself into the fantastic world of magizoology. \nSometime later, Newt was roused from an intricate, magnified examination of Pickett’s amazingly flexible finger joints by another question.\n“You don’t have a permit for the nundu.”  There was a pause.  “Nundu… aren’t those the creatures which regularly wipe out entire wizarding enclaves in Africa?”\n“They only wipe out villages if they’re provoked,” Newt corrected automatically.  Then he paused before adding, “And I don’t have a permit so much as a signed proclamation from the Magical Governor of Zimbabwe ordering me not to give it back and promising that he will declare war on any nation which tries to return the nundu to them.  I think it’s a little over the top really.”  Graves was staring at him in that completely blank, solemn way again.  “As long as he gets his peppermint tonic once every other day, he’s no trouble at all,” Newt assured him.  “The peppermint prevents the pestilence in his breath from spreading to humans or other creatures.” \nThe nundu really was magnificent.  It had taken Newt a full month to successfully track and capture him.  His spined neck-sack was one of the most impressive examples that Newt had ever had the privilege to see.\nGraves stared at him a while longer, opened his mouth and then seemed to think better of it and shut it.  Then he opened his mouth again.\n“Your international magical creature importation permit needs to be renewed by the end of the month and your permit for the doxies expired in February,” Graves informed him, handing the papers back over.\n“Really?”  Time just flew, it sometimes seemed to Newt.  He could have sworn that he had another six months before he need to renew his IMCI permit.  He’d have to apply for that while he was in Paris.  “Thank you for telling me.” \nGraves simply nodded.  Newt gave him a brief flash of a smile in return.\n \nGraves was lying on the cot and trying to focus on the notebook full of notes and hand drawn illustrations that Newt had lent him to read.  If it didn’t relate to magical creatures, then Newt wasn’t interested and it wasn’t to be found in Newt’s suitcase.  The only reading material that Newt had with him were the notebooks full of observations and research that he had filled himself.  Graves was currently reading some rather alarming information about nundus.  No wonder the Magical Governor of Zimbabwe didn’t want the thing back.\nNewt was up on deck at the moment, hoping to catch sight of a sea serpent.  Graves was trying not to spend too much time around the other passengers on the ship in case anyone asked to see something awkward like his ticket… or passport.\nSomething snuffled in his ear.  Graves turned his head.\nIt seemed that if you willingly gave a niffler something shiny, then you had a friend for life. \nWalter the Niffler was watching him intently.\n“Can I help you?”  Newt talked to all of his creatures as if they were sentient.  It seemed that the habit was unfortunately catching.  Walter blinked at him and then started patting down his vest pockets with its paws, all the while keeping its gaze firmly locked on his.  Graves raised an eyebrow at it.  “You’re not going to find anything else.  The cigarette case was all I had.  Grindelwald took the rest.”  Even the silver pocket watch that Graves’s parents had given him when he had graduated from the auror academy.  They had both passed away not long after.  He missed its familiar weight in his vest pocket even more than he missed his wand. \nThey would have noticed it wasn’t me.\nGraves pushed the unhelpful thought away and did his best to refocus on the horrors of nundu anatomy and Newt’s speculations on their immune system.\nWalter spent several more minutes patting down Graves’s pockets before letting out an annoyed huff and flopping down on Graves’s chest in an undignified sprawl.  Graves didn’t bother trying to move it.\n \nThere was a heady sort of joy about being able to share his creatures with someone else.  Newt beamed as he watched the occamy chicks slither and flutter as they chased crickets.  Next to him Graves was also watch the chicks with a look of interest.  Every once in a while he’d ask a pointed, well-thought-out question.  Some questions Newt had an answer for, some he didn’t, some he hadn’t even thought to ask, yet.  The last type were the best type and got written down in Newt’s notebook to be thought about later.\nOne of the chicks mistook Newt’s finger for a cricket and snapped at it.\n“How big can one of these grow naturally?” asked Graves as another chick fluttered up to drape across his shoulder.  Graves delicately scratched the underside of its chin with the tip of his finger.  It cheeped contentedly, temporarily forgetting the crickets.\n“Females can reach up to fifteen feet when fully grown without magically altering their size.”\nGraves nodded and all but smiled as the occamy chick slithered down his arm and wrapped around his wrist.  The sight made something in Newt’s chest feel warm.  The first time he remembered feeling like that….\nThe first time he remembered feeling like that, he and Letta had been in their second year at Hogwarts and searching the edge of the lake for plimpies that had had their feet tied together by the merpeople. The memory hurt now, years and years later after all that had happened, but it was still a good memory. \nThis moment, though, might make an even better one.\nAn occamy chick flapped its way up and landed in Newt’s hair.  It puffed out its chest proudly and let out a loud and incredibly self-satisfied cheep!  Newt laughed.  Out of the corner of his eye, Newt thought he saw Graves’s mouth pull up into an actual smile.\n \n\nGrindelwald’s curse flashed forward in a streak of pale blue, and Graves flew through the air.  His shoulder blades hit the brickwork behind him with bruising force.  Grindelwald’s face was pulled up into an awful, smug smile.  He raised his wand again-\n\nSomething poked him in the shoulder.\nGraves awoke with a start.  His hand reached automatically for a wand that wasn’t there before he remember himself and where he was.  Newt was hovering over him wearing an eager, nervous grin.  His eyes seemed to be focused on Graves’s shirt collar rather than his face.\n“Did you need something?” Graves finally asked.  Newt was practically bouncing on his toes.  Something was definitely going on.  Most likely something creature related.\n“There’s something you’ve got to see!” Newt was beaming now.  His enthusiasm seemed contagious.\n“All right then.”  Graves sat up in a miniature avalanche of puffskeins and allowed himself to be dragged off by Newt who looked distinctly like he hadn’t actually slept, yet.  In Newt’s suitcase of varying legality, there was no structured schedule to follow.  Things simply happened when they happened.  Newt seemed to take a similar view of sleep as well.\nNewt’s mad dash of enthusiasm ended in the mooncalf habitat.  He pulled them behind a rocky outcropping and then held a finger up to his lip.\n“I’ve only ever seen them do this once before,” he breathed, his voice barely a whisper. Together they peered around the rock.\nA single mooncalf was standing on its spindly hind legs in a particularly bright patch of moon light, and it was… dancing.  There was no other word for it.  Its feet swept across the ground in intricate little patterns, flattening the long grass as it went.  Its forelegs waved gently in the air as the other mooncalves gathered one by one to watch its progress. \nGraves spared a moment to glance over at Newt.  His eyes were bright in the moonlight, wide with fascination and wonder.  The corners of his mouth turned up softly, and his hair reflected a shattered cascade of silver sparks.\nGraves turned his attention back to the swaying mooncalf.  It now had gained a partner who was dancing intricate loops beside it.\nThis was far preferable to any nightmare about Grindelwald.\n \nGraves woke to natural sunlight streaming across his face instead of the lighting of Newt’s workshop.  What-?  Oh, that was right.  Newt had offered to let him sleep up in the cabin the previous night after the mooncalves had finished dancing.  He had wanted to make notes on his observations.  That explained the natural light.  It didn’t explain the warm fuzzy weights sleeping on top of him.\nThe warm, fuzzy weights turned out to be one completely unrepentant niffler and six purring puffskeins.  Walter must have let them all out.  Oh, hell.  Walter slept without any dignity or shame with limbs splayed everywhere.  The edge of something glittery was sticking out of its pouch.  It had probably robbed the entire boat blind overnight.  Before Graves took his international portkey back to America, he was marching Newt straight to a mechanist’s to get those latches on his case fixed.\nGathering up the snoozing creatures, Graves headed back down into the case.  He paused at the bottom of the ladder.\nNewt was fast asleep at his desk, quill still held loosely in one hand and he was practically buried beneath magical creatures.  Bowtruckles waved gently in his hair, the demiguise was curled up on his lap, occamy chicks were draped across his shoulders like feathery scarves, doxies nestled in the crook of his arm, and the massive nundu of all things had its head resting on the floor near Newt’s feet. The nundu lifted its head and blinked languidly at Graves as if to say, “What are you doing up?  It’s far too early.”  Then it licked its paw, closed its eyes and went back to sleep.  It was, without a doubt, the most ludicrous thing Graves had ever seen.  It looked like an accident waiting to happen.\nHe smiled just a little bit anyway.\nGraves was half way up a tree when he came to the realization that he honestly wasn’t looking forward to going back to America.  Newt had decided that the erumpent really needed to have some mineral supplements, and the erumpent had decided that she emphatically did not want to take them.  Newt and Graves were now waiting out her temper tantrum up one of the trees in her habitat.\n“She’s moody because she didn’t find a mate while she was in season,” Newt informed Graves in a soft voice as if he didn’t want the erumpent overhearing him and having her feelings hurt.\nGraves just nodded.  He was too busy breathing through the breathtaking adrenaline rush of outrunning an erumpent without magic to care about the exact cause.  He’d missed this since becoming head auror.  It had been too long since he’d truly been out in the field.  Graves had never been particularly fond of desk work.  He had, when he was still a young auror in training, blown up one of the origami paperwork rats once after a particularly long and stressful case with an exploding hex.  With age and experience had come unflappability and self-restraint, but Graves was often still sorely tempted when one of the wretched things scampered onto his desk and unfolded right before he was about to head home for the night.  Enjoying order and organization was not the same thing as enjoying filling out forms.\nNext to him, Newt was frowning down at the erumpent with concern.\n“This doesn’t become you at all, you know,” he told the massive beast as she continued to stomp circles around their tree.  “You’ll feel much better with some extra potassium and iron in your diet.  It’ll stop your feet from getting cramps.”  The erumpent let out a trumpeting snort sound.  Newt let out the sigh of a put-upon parent dealing with a particularly temperamental child.\nGraves couldn’t help himself.  The corners of his mouth pulled up minutely.  They’d been doing that an awful lot over the last five days.  Probably more than they had in the past year.\nAnd then the realization hit him.\nOh, hell.\nHe didn’t want to go back.\nHe didn’t want to go back to his cold, lonely apartment and his desk covered in paperwork surrounded by fellow aurors who didn’t know him well enough to spot an imposter.  He wanted to stay here with this mad, British magizoologist and his menagerie of dubiously legal magical creatures.\nAnd that was a problem, because Graves was also aware that he had a duty to MACUSA and President Picquery.  He was the head of the Department of Magical Law Enforcement.  He couldn’t just abandon his position.  He couldn’t stay here.  He had to go back.  They’d be reaching France tomorrow.\nDamn it.\n \nNewt was not looking forward to arriving in France as much as he’d thought he would.  He’d been anticipating sending his first draft of his manuscript onto his publisher and then heading back to Africa or possibly central Europe or Australia to continue his research.  One year in the field was only the beginning.  His contract covered at least another year of field research – possibly two if his first edition was well received – and Newt wasn’t about to waste that time on something as mundane as editing.  But now….\nWell, humans came and went.  Shouldn’t he have learned that by now?  Only creatures stayed.  Either way, they’d be arriving in France tomorrow.\nNewt tried to refocus his attention on the diricawl and her chicks.  He was doing his best to track their progress as they gained a better handle on the apparating.  Pickett was perched on his shoulder and holding onto his earlobe, watching the diricawls distrustingly.  Two of the other bowtruckles, Finn and Poppy, had hitched a ride in Newt’s hair, because in their opinion Newt was a warm, walking tree that Pickett shouldn’t get to monopolize.  Newt’s quill scratched across the page of his notebook.  Three weeks old and the chicks could already apparate two feet in any direction. \nHe’d really been enjoying having someone to share his creatures with.\n \nOn the morning of their arrival in France, Graves awoke to the now familiar, warm weight of puffskeins and niffler on his chest but also to a strangely lumpy mattress.  The workshop’s cot wasn’t the most comfortable thing ever created, but it certainly hadn’t had hard lumps in it when he went to sleep the night before.  What in the blazes?\nGraves shifted and rubbed sleep out of one eye without disturbing the sleeping creatures sprawled across him.  As he shifted his weight, something clinked.  He paused and then reached down and pulled a hard lump out from underneath his ribcage.  The lump turned out to be a gold coin.  Graves stared at it in puzzlement for a moment.  On his chest, Walter stirred.  It lifted its head, squinted at the shiny disk of metal, and then plucked the coin from his fingers and tucked it back beneath his ribcage.  Walter huffed and flopped back down again, knocking a puffskein over and causing the ball of fluff to roll off the cot and bounce across the floor.  Graves sat up.  The rest of the puffskeins rolled away, and Walter plopped into his lap with an indignant noise of protest.\nIn the indent left by Graves’s shoulders and back, there was a small treasure-trove.  Several gold coins and copper no-maj pennies, a costume jewelry brooch, a particularly glittery necklace, a highly polished belt buckle, a bronze statuette of a dog, and a familiar silver cigarette case lay on top of the sheets.  Graves stared at the collection blankly for a moment and then turned to frown down at the niffler still sitting in his lap.  Walter blinked up at him with an expression somewhere between hopeful and sly. \nSeveral minutes later, Graves was fully dressed, and Walter was still watching him with that calculating expression.  There was a rattle from above and then Newt was descending the ladder.\n“Good morning!”  There was a forced sort of cheerfulness to Newt’s voice.  “We’re about two hours from port, and then it’s only a few apparation points to Paris.”  Newt was fidgeting uncomfortably with some of the viles on his desk now.\nGraves crushed the urge to frown at the mention of Paris.  Getting an international portkey back to New York was for the best.  Instead he just nodded in acknowledgement and greeting.\n“Do you know why Walter felt the need to hide things in my bed last night?”\n“Who?”  Newt looked up from his fidgeting, his eyebrows knitting in confusion.\nAh, that was right – he hadn’t told Newt that he’d named the niffler.\n“The niffler.  It reminds me of a petty thief I used to arrest quite often.”\n“Oh!”  Newt turned to look at where Walter was still perched in the middle of the cot, watching Graves intently.  He smiled.  “It does suit him, doesn’t it?  I usually just call him ‘pilfering pest’ or ‘thieving bugger.’”  Newt’s eyebrows rose as he took note of the shiny trinkets lying on top of the blankets.  “I, uh.”  He started fiddling with the button on his coat sleeve. “I think he’s trying to bribe you.”\n“Bribe me?”\n“To stay.”\n“Ah.” \n \nSmuggling Graves through muggle customs was no harder than smuggling his case through muggle customs ever was.  Side-along apparating wasn’t a problem for Newt either, and he had roped his case shut just to be completely sure that no one escaped to run amok in Paris.  Explaining to the goblins at the Paris branch of Gringotts why Graves should be allowed into the bank when he didn’t have so much as a passport to prove his identity was a touch more exciting.  A great deal more exciting than Newt had anticipated, actually.  It took close to an hour of talking and two complicated magical identification spells before Newt finally found himself standing in front of a large communication mirror waiting for someone in MACUSA to answer the mirror’s summons.  Graves was standing off to one side after they had agreed that it probably wasn’t best to completely startle whoever answered the mirror.\nWhat time even was it in New York?  Newt hadn’t thought of that.  Paris was several hours ahead, wasn’t it?\nBefore Newt could ponder this further, the mirror in front of him swirled and three faces were suddenly staring back at him.  Two of them were familiar.\nBugger.  He’d really been hoping that he wouldn’t have to talk to President Picquery.  At least Tina was a friendly face.  The third person was a dark haired man that Newt couldn’t recall meeting before.\n“Mr. Scamander,” President Picquery’s voice was as smooth and calm as ever, “I wasn’t expecting to hear from you for at least a year.”\n“Ah.  Yes.  Well, about that.  It would seem that I found something that you lost.”  Newt shuffled sideways and beckoned Graves over.  Graves squared his shoulders and strode confidently forward.  It struck Newt that he looked far stiffer than he had the past few days.  He nodded to each of the figures in the glass,\n“Madam President.  Goldstein.  Harper.”\nThere was a very long moment of shocked silence.  Tina and the unknown man were both gaping.  Even President Picquery’s eyes had widened slightly.\n“Mr. Graves?” Tina finally managed to choke out.\n“His identity has been has been verified?” asked President Picquery, ever practical, her eyes flicking over to Newt.\nNewt nodded,\n“Twice over by the goblins.”\n“Then I must say it’s good to see you alive, Mr. Graves.”\n“Thank you.”\n \nExplaining to the president of the Magical Congress of the United States of America that you had been held captive in a cigarette case for three months and then accidentally rescued by a magizoologist when his niffler had tried to escape to rob the passengers of the boat the magizoologist was traveling on was just as embarrassing as Graves had anticipated.  He didn’t let any of that show on his face, of course – he was a professional.\n“I haven’t noticed any lingering side effects from my imprisonment and am ready to take an international portkey back to New York as soon as possible.  I’m sure the paperwork on my desk is beginning to acquire foothills,” Graves finally concluded.  Just the thought of how much paperwork this mess with Grindelwald must have created made him internally cringe.\nPresident Picquery hesitated just a fraction of a second before speaking, but Graves had known her long enough to notice the minute tells of discomfort in her shoulders.\n“Percival,” oh, this wasn’t going to be good – she almost never used his first name, “we believed you to be dead.  LeRoy Hunt has been made head of the Department of Magical Law Enforcement.  Your personal possessions were put into storage.”\nGraves stared at her blankly.  The first thought that popped into his head was, Hunt’s not a bad choice.  His interrogation technique could use a little work, though.  His second thought was that his job was gone.\n“I see.”  Well, what had he expected?  For them to wait around for a dead man’s return?  But… it was his job.  For well over a decade now, it had been his entire life’s purpose, what his every waking thought had revolved around, and just like that it was simply… gone.  Cold dripped down his bones until his entire body felt numb.  He opened his mouth, and for the first time in years he floundered.\nSilence stretched out.\n“Um, you know,” Newt finally spoke up.  He was picking at a loose thread on his cuff.  “My research budget has provisions in it for an assistant.”  He paused and shot Graves a sideways glance and then looked away again just as quickly.\n“An assistant?”  Feeling started to leech back into his muscles.\nNewt gave a half shrug.\n“Or a bodyguard.  Professor Dumbledore suggested that.  I’m not entirely sure if he was joking or not.”  Newt straightened up and stopped picking at his cuff.  “All my creatures like you, and you’re good with permits, so why not?”\nThere was that smile tugging at the corners of Graves’s mouth again.  Well, he hadn’t wanted to leave in the first place, had he?  He turned to face President Picquery.\n“If you’d be so good as to have my passport, wand, pocket watch, vault key, and a suitcase of my clothes sent along by international parcel to the Paris branch of Gringotts, I’d greatly appreciate it.  It seems I won’t be coming back to New York for a while.”"
}