{
    "id": "8695081",
    "url": "https://archiveofourown.org/works/8695081?view_full_work=true",
    "author": [
        "tetsurashian"
    ],
    "title": "katsuki_fc wrote",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen",
        "M/M"
    ],
    "fandoms": [
        "Yuri!!! on Ice (Anime)"
    ],
    "relationships": [
        "Katsuki Yuuri/Victor Nikiforov"
    ],
    "characters": [
        "Katsuki Yuuri",
        "Victor Nikiforov"
    ],
    "additional_tags": [
        "Social Media",
        "POV Outsider",
        "Katsuki Yuuri Fan Club"
    ],
    "language": "English",
    "series": "",
    "published": "2016-11-29",
    "completed": "2016-12-31",
    "words": "12,744",
    "chapters": "7/7",
    "comments": "1,051",
    "kudos": "14,807",
    "bookmarks": "3,722",
    "hits": "177,534",
    "summary": "<p>Just because Yuuri isn't big on social media, doesn't mean his fans aren't.</p>\n<p>(aka a social media fic)</p>\n<p>(( <a href=\"https://archiveofourown.org/works/9249239/chapters/20968736\" rel=\"nofollow\">Russian translation by Neer</a><br><a href=\"https://archiveofourown.org/works/10547836/chapters/23294456\" rel=\"nofollow\">Chinese translation by JulianTurnin</a><br><a href=\"https://archiveofourown.org/works/10442112\" rel=\"nofollow\">PODFIC by Opalsong and various</a> ))</p>",
    "notes": "<p>experimental fic i had to get out of my system<br>bc i love the characters using social media and i want to expand it even more</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>oh wao <br>the positive responses to this fic surprised me lol<br>hope you continue to enjoy!</p>\n<p><b>IMPORTANT NOTE: Hover text to see translations of the non-english posts.</b> For those who can't see it, the translations are also at the end notes.<br>Many thanks to prufrocking and jezzberry for the japanese and russian help!<br>Victor and Yuuri are the driving force to this constant updating. I am consumed by Victuuri and I don't ever want them to leave.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>Translations for those who cant see the hover text<br>In Victor's instagram:<br>Вау выглядит очень хорошо - \"Wow it looks really good\"<br>Виктор! вернись в Россию! - Victor! Come back to Russia!<br>In Yuuri's twitter:<br>あっ、ちょっと、言語はまだ決めてないんです ∑(ﾟﾛﾟ〃) 何語で呟きましょうか？日本語？英語？ - Ah, wait, I haven't picked a language yet. Which should I tweet in? Japanese? English?<br>ああ、英語でOKですね。リプありがとうございました！- Aah, English is OK then, right? Thank you for the replies!<br>In Minami's twitter:<br>いよいよ中四国九州選手権大会！！じゃあ、勇利くんはどこかな？（笑）- It's finally the Chugoku, Shikoku, and Kyushu Championships!! Now, where is Yuuri-kun? (lol)</p>\n<p><b>IMPORTANT NOTE: Hover text to see translations of the non-english posts.</b> For those who can't see it, the translations are also at the end notes.<br>Many many thanks to <a href=\"https://archiveofourown.org/users/prufrocking/pseuds/prufrocking\" rel=\"nofollow\">prufrocking</a> for the japanese help!<br>ALSO MANY MANY THANKS TO EVERYONE WHO COMMENTS AND KUDOS my happiness engine goes vroom vroom thanks to you all</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">more notes</a>.)\n</p>\n<p>Translations:<br>Minami's tweets:<br>1. I found him!! I want to talk to him...<br>2. Going fourth for the short program. I need to concentrate and prep for my turn...but Yuuri is going first, so... （*´▽｀*）<br>3. I don't think he remembers me... (´；ω；`)<br>4. It's fine either way! I'm going to make him remember so hard with my short program today that he won't be able to forget ever again!<br>haruka-zen's tweet: Hold up ww doesn't Minami Kenjirou's costume really resemble Katsuki Yuuri's costume from his Lohengrin? wwww</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">notes</a>.)\n</p>\n<p>formatting is hard when ao3 doesnt carry over any underlines from your doc<br>also you guys.. are too good to me... i started this as a throwback/nostalgia fic from lj fandom days and i just.. im so glad you guys like it...</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">notes</a>.)\n</p>\n<p>Translation notes:<br>dame un momento por favor - (please give me a moment)<br>olvidé cómo hablar inglés. estoy demasiado emocionado LOL - (i forgot how to speak english. i’m too shaken LOL) ((THanks to narue_nara_chan and Aicnesua for translation correction :P ))</p>\n<p>the last episode... how am i supposed to go on... pls play the duet at my funeral i am so shook...</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">notes</a>.)\n</p>\n<p>And that's it. Phew.<br>This chapter was kind of hard to write because I wasn't sure how to end it. TBH I'm really bad at endings lol But I think I did well enough?<br>Thank you all for all the comments and kudos and everything. I can't believe how well received and popular this fic became but I'm glad I got to share it.<br>(NOW TO PATIENTLY WAIT FOR S2 PLS)</p>",
    "text": "Yuuri Katsuki Fan Club (katsuki_fc) wrote\n@  2015  -  12  -  xx     08:21 am \nEntry tags: + watch party  +  grand prix 2015 \n \n\n  Grand Prix 2015 Watch Party  \n\nOKAY BOYS AND GIRLS our precious baby is finally competing his first (and hopefully not last) grand prix! Time to cheer him on! 勇利ちゃん、頑張って！！ ｡ﾟ✶ฺ.ヽ(*´∀`*)ﾉ.✶ฺﾟ｡\nRules:\n \n-\n[Page 1 of 20]\n[&lt;&lt; 1 2 3 4 5 … 20 &gt;&gt;]\n(Anonymous)\nI’m so nervous for him ヾ( •́д•̀ ;)ﾉヾ( •́д•̀ ;)ﾉ\n      (toe-looper)\n      Me too, anon, me too ;;;;\n      (Anonymous)\n      Yuuri-chan ganba!! ;;\n      (Anonymous)\n     Prayer circle for Yuuri-chan!! ヾ( •́д•̀ ;)ﾉヾ( •́д•̀ ;)ﾉヾ( •́д•̀ ;)ﾉヾ( •́д•̀ ;)ﾉヾ( •́д•̀ ;)ﾉ\n(Anonymous)\nI hope his jumps go well! :((\n(kuri-ay-z)\nngl tho i dont think his program is strong enough to compete with victor lol\n     (Anonymous)\n     I don’t think anyone is strong enough to compete with victor lmao\n     (pork-bowling)\n     I’ll be happy as long as he places ;;\n     (Anonymous)\n     ^ ANYWAY ITS HIS DREAM TO SKATE THE SAME ICE AS VICTOR SO AS LONG AS YUURI IS HAPPY IM HAPPY\n     (Anonymous)\n      ^^^^^^^^^^^^\n--\n \n[Page 15 of 20]\n[&lt;&lt; 1 2 3 4 …14 15  16 ...  20 &gt;&gt;]\n \n(Anonymous)\nOh no\n(Anonymous)\nNOO ;;;;;\n(Anonymous)\nYuuri-chan hold on!! ;;;;;;;;;;;\n(fruity-loops)\nOh god no his face;A;\n(Anonymous)\nYuuri-chan noooo (´；д；`)\n(toe-looper)\nThis is so tragic ;;\n(iceicecrazy)\nI feel so bad for Yuuri-chan (´；ω；`)\n(Anonymous)\nOh god that was so hard to watch (´；д；`)\n(Anonymous)\nHis face says it all…\n \n--\n \n[Page 20 of 20]\n[&lt;&lt; 1 2 3 4 …19   20  &gt;&gt;]\n \n(Anonymous)\nI’m gonna eat a dozen katsudon in his name and yell at all the people saying he’s retiring with tears streaming down my face\n      (Anonymous)\n      same\n      (Anonymous)\n      ..same\n      (snow-ninja)\n      SAME\n      (Anonymous)\n      same lol\n      (yuuri-chin)\n      Same\n(katsuki_fc)\nI know everyone is upset, but I think it’s very important right now to send Yuuri all our love and encouragement. I don’t think anyone else in the world is more disappointed at Yuuri than Yuuri himself so as his fans, it’s our duty to show all our support and encouragement. Hopefully he makes a comeback, whether its at Nationals or the Worlds or even next year’s grand prix. But it’ll help I think if we let him know that we’ve got his back. Yuuri-chan, ganba!!\n      (Anonymous)\n      Mod-san is an angel and is right as always\n      (Anonymous)\n      bless you mod-san \n \n\ndankness-arises reblogged heart-to-hear\n\n \n\nthree-spins-up\n\n\n2ch Anon Shares Theory Re: Yuuri Katsuki and his Grand Prix Disappointment\n\nNote that I’m just translating a post on 2ch by an anon named hasetsu_fan made last night ( link here ). I tried to keep it true to word but it’s a bit of a read.\n“I’ve been a fan of Yuuri since his “unknown” days, since I have the fortune of sharing the same hometown as him. (Yes, I’ve seen him skate in person. Last time, I was in middle school and just before he left for America.) I’m not an expert in him or anything, but I may be at an advantage here at knowing some things most people aren’t privy too. It’s nothing too explicit, just things that are common knowledge here, so don’t go ragging on me for sharing lol. Because I want to give my thoughts on possibly why Yuuri’s performance in the Grand Prix was as abysmal as it was. Not as an excuse, but as a reason.\nTwo important things to know are:\n“\nGot your attention? Then read on under the cut\nRead more\n \n----------\n\nabsolute-zer00\n\nlmao so he lost bc of a dog? how pathetic\n---------\n\nunderstatedgarments\n\nListen here asshole, to a lot of people losing a family dog is like losing a family member. And from what OP said he’s had him for years. Show some fucking empathy.\n---------\n\nwatash1\n\ndude if my dog died I would break, more so if I wasn’t there for her holy shit\n \nSource: three-spins-up  #poor bby :(\n \n257 notes\n \n \n\nphichit+chu\n\n[ image ]\n1,230 likes\nphichit+chu farewell party for #yuurikatsuki ;A; i’ll miss my bff rinkmate\nanaliz you two are so cute!\nkite-likes oh no, does that mean he’s retiring? :(\nphichit+chu @kite-likes Σ(ﾟДﾟ|||) no!! he’s just leaving detroit to go back to japan\nxkatx he might as well after how bad he did in his nationals :u\nphichit+chu @xkatx don’t be mean :c he’s a rough spot right now, but i believe he’ll make a comeback next year!\n \n \n[ video ]\n\n[Katsuki Yuuri] Tried to Skate Victor’s FS Program [Stay Close to Me]\n\n653,023 views\n \n\nHaruka Yumi\n\n?!?!?!?!?\n!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\nAAAAHHH??????????!!!!!!!!!!!!!\n\nChris Black\n\nThat’s impressive\n\nScenic Chicken\n\nisn’t this the guy that flubbed the last grand prix\n\nYuuri Katsuki Fan\n\nAHHHH!!!\nYUURI-CHAN IS BACK!!\n \n \nYuuri Katsuki Fan Club (katsuki_fc) wrote\n@ 2016-03-xx   05:42 am \nEntry tags: +happy stuff + our bby is back\n \n\n YUURI IS BACK AND CAN SKATE LIKE VICTOR NIKIFOROV \n\nGuys GUYS\nFirst, I love you all that have stayed as Yuuri’s fans through his roughest time yet. I know some of the other skaters’ fans have made fun of us for sticking with the last prix’s “failure” but we all know that Yuuri is anything but.\nCASE IN POINT, ITS 4 AM IN MY TIMEZONE BUT I AM AWAKE BECAUSE SOMEONE LINKED ME TO THIS VIDEO AND I AM LOSING MY MIND\nLast night someone uploaded a video of Yuuri (looking a little thicker, the precious child, but still definitely him) skating at what I’m assuming is t he ice rink in his hometown (edit: 2ch confirmed, its at Ice Castle Hasetsu). What’s more, he’s skating to Victor Nikiforov’s FS program “Stay Close to Me.” You know,  the one that got Victor this year’s record-breaking gold, again .\n\n WHO’S THE FAILURE NOW, HUH \n\nPLEASEPLEASEPLEASE WATCH\nHERE’S THE ORIGINAL UPLOAD WHICH I HOPE STAYS IN THE INTERNET FOREVER:\n[ video ]\n \nEDIT:\nBless twitter user @combi-spin for this side-by-side comparison of Victor’s and Yuuri’s skate videos\n[ video ]\n \nBased on this, tumblr user three-spins-up details on why this perfection is impressive.\n  HOPEFULLY, THIS MEANS A GREAT COMEBACK FOR YUURI-CHAN THIS YEAR. YUURI-CHAN, GANBA!!    \n\n♥ \nChristophe \n♥ @christophegc\n\n\n@vnikiforov Victor~ have you seen this? https://youtube.com/watch?v=n….\n\n\nhot wheels on ice\n @superquad\n\n\n@christophhegc @vnikiforov yuuri’s comeback!!\n\n\nSara Crispino\n @saracrispino\n\n\n@christophegc @vnikiforov wow! I knew Yuuri was good under the all nerves but I didn’t realize he was that good!\n\n\nVictor Nikiforov\n @vnikiforov\n\n\n@christophegc You’re like the thousandth person to link me this video and I just woke up\n\nAmy★ @amyzing\n\n@vnikiforov pls marry me\n\n\nHORA HORA\n @excitedstuff\n\n\n@vnikiforov watch it!! it’s super good!\n\n\nDONE WITH LIFE\n @katusdone\n\n\n@vnikiforov big fan of you and yuuri!! &lt;3\n\n\nthe dank knight rises\n @lohengrins\n\n\n@vnikiforov please support yuuri! he’s a big fan of you!\n\n\nVictor Nikiforov\n @vnikiforov\n\n\nokay okay guys! I’m about to watch it :)\n\n \n \n \n\nYuuri Katsuki Fan Club (\nkatsuki_fc\n) wrote\n\n\n@ \n\n2016\n\n-\n\n04\n\n-\n\nxx\n\n  \n\n02:39 pm\n\n\n\nEntry tags: +\n\ndiscussion post\n\n +\n\nconspiracy theories lol\n\n\n \n\n\n\nDISCUSS: Rumors? about Victor Nikiforov coaching Yuuri\n\n\n\n\nAhh, I love the resurgence of activity! But please, there’s only so many reposts we can have! SO, PINNED DISCUSSION POST UNTIL WE GET CONFIRMATION.\n\n\nFuel to the Fire:\n\n\nBIG EDIT!!! \n\n\nA MORE IMPORTANT EDIT\n\n\nIf anything, I’m glad Victor likes to use his twitter/instagram because I’m thirsty for Yuuri content lol Yuuri-chan, where’s your social media accounts?! ;q;\n\n\nAnon is on, but everyone still has to be in good behavior! NOW DISCUSS\n\n\n-\n\n\n[Page 1 of 13]\n\n[&lt;&lt; 1 2 3 4 5 … 13 &gt;&gt;]\n\n(Anonymous)\n\n\nmod-san strikes again by being efficient lol\n\n\nhow do you do it?!\n\n\n      (katsuri_fc)\n\n\n      By being a yuuri otaku lolol\n\n            (Anonymous)\n\n            #1 Yuuri otaku\n\n                  (jellyfish_songs)\n\n                  the crowned champion\n\n\n(wet_ice)\n\n\ntrying to be positive here, but if this is in fact true, it’s not an inside sabotage job, is it? :( \n\n\n      (Anonymous)\n\n\n      I really dont think so\n\n\n      I mean, Victor doesn’t seem to be that kind of asshole\n\n\n      (Anonymous)\n\n\n      what a stupid idea lol\n\n            (Anonymous)\n\n            Hush you, it’s a valid concern. But I echo the first anon. Victor seems to be a good guy from what you can glean from his interviews and fan interactions\n\n\n(porkcutlet)\n\n\nThat Japanese girl’s tweet says “Famous foreigner alert in Hasetsu! Isn’t that flashy hair unmistakable? He winked at me and I’m in love! #victornikiforov”\n\n\nlol charming the locals already\n\n\n      (Anonymous)\n\n\n      “charming the locals” lol and no one is surprised\n\n      (katsuki_fc)\n\n      Thanks for the translation! I’ll add that to the post :)\n\n\n      (Anonymous)\n\n\n      I want to be winked at by Victor lol\n\n\n            (fruityloops)\n\n\n            I want to be winked at by Yuuri AND Victor ( ͡~ ͜ʖ ͡°)\n\n\n                  (Anonymous)\n\n\n                  thats a double KO\n\n \n \n\njankenponsu reblogged davaidavai\n\n\nyuurikatsuki-fans\n\n\n“Hot Springs on Ice” Yuuri Katsuki vs. Yuri Plisetsky !!\n\n\n\n\n“Yuuri Katsuki and Yuri Plisetsky are going to face off with short programs produced by Victor Nikiforov himself! The face off is going to happen in a few weeks at Ice Castle Hasetsu (Hasetsu-cho, Fukuoka, Japan) and its a public event, though they are taking donations for the skating rink hosting it.” (\n\nlink to full article\n\n)\n\n\nSOMEONE GET IN THERE AND LET ME LIVE VICARIOUSLY THROUGH YOU\n\n\n---------\n\n\ndrunkenmoneys\n\n\n!??!\n\n\nBRB BUYING PLANE TICKET TO JAPAN ASAP\n\n\n---------\n\n\n15berry\n\n\nI will be going! (*≧∀≦*) I am very excited!!\n\n\n---------\n\n\ndavaidavai \n\n\njealous!!!!\n\n \n\nSource: yuurikatsuki-fans  #PICS PLS  #i hope it gets streamed\n\n\n3,429 notes\n\n \n \n\n[Livestream]\n Hot Springs on Ice Megathread (self.katsuyuudon)\n\n\nsubmitted 19 hours ago by sleepyegg[M]\n\n\nLess than a day left until the showdown! Keep discussion here, please, any other threads will be deleted! \n\n\nBe good to each other btw. If you’re from the Plisetsky side of the match, welcome anyways, but we believe in the power of our Yuuri lolol.\n\n\n1329 comments  share  save  hide  give gold  report\n\n\nTOP 200 COMMENTS\n   show all 1329\n\n\nsorted by: best\n\n \n\ndancingwithpandas\n  539 points  3 hours ago\n\n\nI want someone who thinks of me like Yuuri Katsuki thinks of katsudon\n\n\n      PM_ME_IGLOOS\n  782 points   3 hours ago\n\n\n      I want Yuuri Katsuki to think of me like he thinks of katsudon\n\n\n            yu-only-live-1s\n  231 points   3 hours ago\n\n\n            I want Yuuri Katsuki to think of me like someone who thinks of me like Yuuri Katsuki thinks of katsudon\n\n\n      load more comments (25)\n\n\nwheresmyspam\n  492 points  3 hours ago\n\n\nI AM EROS’ED\n\n\n      lilyawns \n 210 points  3 hours ago\n\n\n      fuck you take my upvote\n\n\n      zenzenzense \n 82 points  3 hours ago\n\n\n      I gigglesnorted on my water and choked\n\n\n      load more comments (13)\n\n\npantsutrash \n 403 points   3 hours ago\n\n\neros\n\n\n      dankaimeme \n 32 points  3 hours ago\n\n\n      eros\n\n\n      supersavings \n 26 points  3 hours ago\n\n\n      eros\n\n\n      PM_ME_SOCK_MEMES\n  28 points  3 hours ago\n\n\n      eros \n\n\n      lostdonut \n 12 points  3 hours ago\n\n\n      eros\n\n \n \n\nphichit+chu\n\n\n[ image ]\n\n\n5,921 likes\n\n\nphichit+chu\n watching #hotspringsonice instead of practicing, don’t tell my coach lol I’m cheering for you #yuurikatsuki !! \n\n \n\nayaliz \n i’m watching too!\n\n\nmangotease \n same!! I wanna see yuuri katsuki skate well again\n\n\nphichit+chu\n  @mangotease I think he’ll do great today :D\n\n\nlostdonut\n  fingers crossed &gt;_&lt; \n\n \n \n\nゆか\n★\n\n\n@yuka-tann\n\n\nヴィクトルと勇利は。。。かわいいカップルなるだろう、ね？ｗｗｗｗ\n\n\nView translation\n\n\n-\n\n\nTranslated from Japanese by bing                                    Wrong translation?\n\n\nVictor and i. interest is. Cute couple, would it? wwww\n\n\n-\n\n\n[ image ]\n\n\nRetweets   Likes\n\n\n340           653\n\n\n--\n\n\nクロサキ\n　@kurosaki-5\n\n\n@yuka-tann あああああ！！YES！！ლ(*꒪ヮ꒪*)ლ\n\n\nRUKIO\n  @ruki0zen\n\n\n@yuka-tann ╭(♡･ㅂ･)و ̑̑╭(♡･ㅂ･)و ̑̑╭(♡･ㅂ･)و ̑̑╭(♡･ㅂ･)و ̑̑╭(♡･ㅂ･)و ̑̑\n\n \n \n\nYuuri Katsuki Fan Club (\nkatsuki_fc\n) wrote\n\n\n@ \n2016\n-\n05\n-\nxx\n  \n\n12:51 pm\n\n\n\nEntry tags: +\n\nwatch party\n\n +\n\nhot springs on ice\n\n\n\n\n\nHOT SPRINGS ON ICE: Yuuri vs. Yuri!! Watch Party\n\n\n\n \n\nYUURI-CHAN IS BACK IN THE GAME FOLKS\n\n\nPre-emptively posting this because mod mama has to get SOME sleep so i’m not a zombie when the showdown starts. But sleep might be debatable because I AM VIBRATING IN EXCITEMENT. I so much very wish I was there in person but QQ plane tickets too expensive for me. I’ll just cheer from my room. \n\n\nRemember the rules, kids. Behave while mama is away and don’t give her a reason to take away anon when she comes back.\n\n\nEDIT: ive died and ascended to heaven thanks bye\n\n \n\n-\n\n\n[Page 17 of 36]\n\n\n[\n&lt;&lt;\n 1 2 3 4 5 …16 \n17 \n18 ... 36 \n&gt;&gt;\n]\n\n \n\n(Anonymous)\n\n\nI am dead\n\n\n(Anonymous)\n\n\nmy lady boner is erect\n\n\n(zenseis)\n\n\nthank u god for this \n\n\n      (Anonymous)\n\n\n      *Victor FTFY\n\n\n            (zenseis)\n\n\n            eh, practically the same thing in the skating world\n\n \n\n(Anonymous)\n\n\nthis eros’es me\n\n\n      (Anonymous)\n\n\n      that’s not a word but i agree\n\n\n(katsudone)\n\n\nI’m never looking at katsudon the same way ever again\n\n\n(Anonymous)\n\n\ni think mod-san is dead\n\n\n      (katsuki_fc)\n\n\n      super dead\n\n\n      the deadest\n\n\n            (pork-bowling)\n\n\n            mod-san no pls think of the children\n\n\n                  (katsuki_fc)\n\n\n                  my only child is yuuri-chan and he is my angel leading me to heaven\n\n\n(Anonymous)\n\n\nRIP mod-san\n\n\nv-nikiforov\n\n[ image ]\n10,734 likes\nv-nikiforov   вкусно! )) #ramen with #yuurikatsuki at #hasetsu\n \nbezdelevvvv  Вау выглядит очень хорошо \nnanasenagi  you and yuuri look like you are having fun! enjoy japan!! （*´▽｀*）\nanatasia991 Виктор! вернись в Россию!\nv-nikiforov  @nanasenagi  thank you! i really like staying here )\nmordynka  i’m so glad to see more of yuuri :D\nchristophe-gc  I’m jealous, I want to be with you two too :d\n \n \n \n\nyuurikatsuki-fans reblogged vnikiforov-fc\n\n \n[ image ][ image ]\n[ image ][ image ]\n[ image ][ image ]\n\nthree-spins-up\n\nmy fave instagram pics of my current fave skating duo in the world\nVictor Nikiforov + Yuuri Katsuki\n(all from victor’s instagram)\n----------\n\nlollipopjohnson \n\nI love them\n----------\n\nslayandshake\n\ni ship it\n\nSource: three-spins-up  #yuuri katsuki  ##victor nikiforov  #they’re adorable\n10,215 notes\n\n\n\nnqkamen reblogged teaple\n\n \n\nvictorypirozhki\n\nAll you Yuuri Katsuki fans need to stop.\nIt’s bad enough that Victor is taking the next season off (and to coach the guy who blew last year’s grand prix, really?) but you don’t need to butt in every single one of Victor’s posts in instagram and twitter with Yuuri this, Yuuri that. It’s not all about him, you know. Besides, we all know as soon as Katsuki doesn’t qualify for the final then Victor is going to drop him like a hot potato. Which I’m looking forward to because then Victor can come back and skate on the ice again. He belongs in the rink, not on the side of it.\nAnd don’t even get me started with the shipping. They’re real people, for god’s sake, and they’re NOT going to get together. Stop harassing Victor about it.\n----------\n\nslayandshake\n\ndude chill\n----------\n\nheart-to-hear\n\nlmao someone is salty much?\n----------\n\nnikifaverov\n\nUhm, okay.\nSo I’ve been a long time fan of Victor and there’s something I want to tell you.\nYou’re the one that needs to stop. And I’m going to tell you why.\nIt’s not just you this applies to, though. A lot of Victor and even Yuri Plisetsky fans have been really aggressive and hostile towards Yuuri Katsuki fans and ALL of you need to STOP.  Katsuki won the Hot Springs on Ice showdown fair and square (  a figure skating expert can even tell you why  ), Katsuki isn’t taking Victor away from the sport (and is in fact, showing us all  a new side of him  ), and more importantly,  they’re all friends .\nIf anything, just imagine how disappointed Victor would be if he found out you guys were acting this way. He’s never bad mouthed any of his competitors and neither should any of you do so “in his behalf.”\n----------\n\nrealslimjim\n\nslow\nclap\n\nSource: victorypirozhki  #lol rekt  #nikifaverov best victor fan  #victor nikiforov  #yuuri katsuki\n15,112 notes\n \n \n\nphichit+chu\n\n[ image ]\n9,178 likes\nphichit+chu  facetiming with @yuuri-ktsk #yuurikatsuki who finally got instagram and twitter!! :D\n \nyuuri-ktsk  ?!?! when did you screenshot that!?\nphichit+chu  o3o\nkite-likes  i want to facetime with you two too lol\nridehotdogs  wahhh jealous lol\n+guanghongji+  you two should video group chat with me and leo sometime!\n \nYuuri Katsuki  @yuuriktsk\nFirst Phichit, and now Victor… I finally got twitter and instagram after they kept bothering me about it (´•ω•`๑)\nYuuri Katsuki  @yuuriktsk\n@yuurikatsuki was taken already?? So I had to make do with this. But it’s no problem!\nYuuri Katsuki  @yuuriktsk\n\n あっ、ちょっと、言語はまだ決めてないんです ∑(ﾟﾛﾟ〃) 何語で呟きましょうか？日本語？英語？\n\nYuuri Katsuki  @yuuriktsk\nああ、英語でOKですね。リプありがとうございました！( ´ ▽ ` )ﾉ\nYuuri Katsuki  @yuuriktsk\nTime to start my late social media career. Please take care of me!\nDONE WITH LIFE @katusdone\n@yuuriktsk you’re so cute omg aslkdjlkajsdjgds ;;\nhungover  @moonvolleys\n@yuuriktsk SCREAMING WELCOME TO TWITTERRR\nLyra  @lyrarose19\n@yuurktsk we look forward to your future posts!\n--\nVictor Nikiforov  \n@vnikiforov\n \nmy cute katsudon @yuuriktsk finally connecting online like the rest of us!!\n[ image ]\n \nRetweets     Likes\n2,981          3,192\n--\nVictor Nikiforov  @vnikiforov\nlol you guys are too enthusiastic. I think yuuri got scared from all the attention\nVictor Nikiforov  @vnikiforov\nbut even if he doesn’t post enough, don’t worry!! i’ll share yuuri with everyone )))\nVictor Nikiforov  @vnikiforov\n(I’m his fan too, after all)\nthe dank knight rises @lohengrins\n@vnikiforov one of us ONE OF US\n \n \n \nYuuri Katsuki Fan Club (katsuki_fc) wrote\n@ 2016-08-xx   03:13 pm \nEntry tags: + yuuri watch \n \n\n  YUURI WATCH: JUNE-AUGUST EDITION  \n\nHELLO MY LOVELIES\nITS BEEN AN EXCITING FEW MONTHS AND ITS ALMOST THAT TIME OF YEAR WHEN WE SEE YUURI-CHAN OFFICIALLY ON ICE AGAIN\nAlso can I just say, Victor is a blessing to our cause. I’m so glad he shares as much as he does (and apparently is one of us lolol) bless him.\nYuuri updates!\nLet’s cheer him on with all of our power! (and if someone can pls attend the events in my stead and get his autograph pls and thank)\n---\n[Page 3 of 9]\n[ &lt;&lt;  1 2  3 4 5 … 9  &gt;&gt; ]\n \n(wet-ice)\nI’m so jealous of that waist line\n      (rathofgrapes)\n      me too\n      I say, as I eat ramen noodles for the sixth time this week\n(kayc2)\nmy friend in Japan is going to the domestic championship. i wish i could go too~ ;;\n(pork-bowling)\nAnyone interested in a meet up and watch party in Hasetsu? A bunch of friends and I are going the week of Cup of China, and I just found out a few of the Japanese fans I follow on twitter are doing the same and we’re gonna go eat Yu-topia katsudon and doing a livestream party lol. We’re staying at the Hasetsu Daichi Hotel (apparently Yu-topia is booked that week!) and planning to rent a conference room there for the livestream. Here’s the facebook event page!\n      (zenseis)\n      Oh nice! Where in Japan do you live?\n            (pork-bowling)\n            Osaka! I’m here for work, actually. There’s a couple of us Yuuri fans around here :)\n      (katsuki_fc)\n      I’m sooo jealous ;A;\n            (pork-bowling)\n            COME JOIN US MOD-SAN\n(demiguises)\nI can’t wait to see his free skate program! :D\n(pridebanana)\n*___* YUURI-CHAN IS GONNA DO WELL THIS YEAR I CAN FEEL IT IN MY BONES\n \n南健次郎 @kenjirou-m\nキターー(゜∀゜)ーー!! いよいよ中四国九州選手権大会！！じゃあ、勇利くんはどこかな？（笑）\n \n南健次郎 @kenjirou-m\n\n勇利くん発見！！ ヾ(ﾟ∀ﾟ○)ﾂ三ヾ(●ﾟ∀ﾟ)ﾉ 話しかけたいなぁ\n\n南健次郎 @kenjirou-m\nショートプログラムに４番出る決定。おいらの出番に集中、準備しなきゃ…だけど勇利くんが１番出るので、、（*´▽｀*） \n南健次郎 @kenjirou-m\n\n勇利くんおいらのこと覚えてないみたい…(´；ω；`) \n\n南健次郎 @kenjirou-m\n\nそれでも大丈夫だぜ！今日のショートでずっと忘れられないように覚えさせてやるぜ！\n\n \n\nv-nikiforov\n\n[ image ]\n16,928 likes\nv-nikiforov  dressed for my glorious debut as a coach~\n \nemmylia  looking good!\nhalapenyo  you’re so unfairly hot lol\ndameda  wowwwww\njaguarclassic  pls come to brazil\nmila-babi  good luck to you and your japanese yuuri :p\n \n \n\nteaple reblogged from deresnelssss\n\n \n[image]\n\nyuurikatsuki-fans\n\nVICTOR\nHUGGED\nYUURI\n(from twitter user  @haruka-zen )\n-\n\nwatash1\n\nVICTOR AND YUURI RINKSIDE HUG COUNTER: 2\n-\n\ndenketsu-sann\n\ni wanna know what victor was saying to his ear lolol\n-\n\nslayandshake\n\n“seduce me like one of your katsudon”\nSource: yuurikatsuki-fans  #seduce me like one of your katsudon #lol\n538 notes\n \n \nsandshrew by darude @shrewski\nYuuri Katsuki scored a personal best at the domestic championship! 94.36 grats to him!\nsandshrew by darude  @shrewski\nhe got the audience really fired up\nhungover  @moonvolleys\n@shrewski you’re there? im so jealoussss\nsandshrew by darude  @shrewski\n@moonvolleys lol yea it’s near enough my university so i figured why not\nhungover  @moonvolleys\n@shrewski STILL. i have to wait until youtube uploads because RIP no stream\n \n \nはるか  \n@haruka-zen\nちょっとｗｗ南健次郎の衣装、勝生勇利の「ローエングリン」の衣装と似て過ぎない？ｗｗｗｗ\n\n\nView translation\n-\nTranslated from Japanese by bing                                    Wrong translation?\nKinda like the ww South Kenjiro costumes, costumes of victory raw Isamu Lohengrin, too? wwww\n-\n[ image ][ image ]\nRetweets   Likes\n125            298\n \n \n\nv-nikiforov\n\n[ image ]\n12,359 likes\nv-nikiforov  @yuuri-ktsk looking beautiful in his free skate costume &lt;3\n \nsara-crispino  amazing!\nnanasenagi  aaaa i want to see that in person!\nanaliz  i can’t wait to cheer him on at the cup of china~\nyuri-plisetsky  gross\n \n \nsandshrew by darude @shrewski\nI feel like I intruded in a private moment lol\nsandshrew by darude @shrewski\nvictor touched yuuri’s lips “to apply lip balm”\nsandshrew by darude @shrewski\nanother rinkside hug from these two, i swear to god\n[image]\nDONE WITH LIFE @katusdone\n@shrewski SCREAMING\n \n \n[ video ]\n\nKatsuuki Yuuri’s FS Program at the Chugoku, Shikoku, and Kyushu Championship\n\n24,738 views\n \n\nLauren Vale\n\nwhat’s with this potato quality lol\n\nzenji\n\nwhat’s that music called?\n\n      dreamsicle\n\n      an original composition called “yuuri on ice”\n\nMecha Nima\n\neh, not that impressive\n\nWolfy8710\n\nlol shitty jumps\n\nDenna Wayne\n\nHopefully he refines it by the time the Cup of China happens!\n\nJenny Cooper\n\nyou cut off the best part when victor steps out of the way of yuuri’s jump hug lol\n \n \nYuuri Katsuki Fan Club (katsuki_fc) wrote\n@  2016  -  09  -  xx     08:52 pm \nEntry tags: + grand prix 2016 \n \n\n YUURI ANNOUNCES HIS THEME FOR THIS YEAR \n\nAt a press conference a few hours ago, Yuuri-chan revealed his theme for this year’s grand prix series. AND IM SHARING IT TO YOU ALL BECAUSE I AM SCREAMING\n(Video from niconico and transcript translation provided by the ever helpful  porkcutlet )\n[ video ]\n \n\n “My theme in this year’s Grand Prix series is ‘love.’ \n\n\n I’ve been helped by many people in my competitive skating career thus far, but I never thought about ‘love’ until now. Though I was blessed with support, I couldn’t take full advantage over it. I always felt like I was fighting alone. \n\n\n But since Victor showed up to be my coach, I’ve seen something totally different. My ‘love’ is not something clear-cut like romantic love, but the more abstract feeling of my relationships with Victor, my family, and my hometown. I was finally able to realize that something like love exists all around me. \n\n\n Victor is the first person I’ve ever wanted to hold on to. I don’t really have a name for that emotion, but I’ve decided to call it ‘love.’ \n\n\n Now that I know what love is and am stronger for it, I’ll prove it to myself with a Grand Prix Final gold medal!” \n\n \nTHIS ENTIRE THING STRENGTHENS ME\n \n---\n[Page 1 of 5]\n[&lt;&lt; 1 2 3 4 5 &gt;&gt;]\n \n(Anonymous)\nI WILL GO DOWN WITH THIS SHIIIIP\n      (Anonymous)\n      AND I WONT PUT MY HANDS UP AND SURRENDER\n            (Anonymous)\n            THERE WILL BE NO WHITE FLAG ABOVE MY DOOR\n                  (Anonymous)\n                  VICTUURI IS IN LOVE AND ALWAYS WILL BE\n(rathofgrapes)\nholy shit if that’s not a love declaration idek anymore man\n(zenseis)\nholyyyy shiiiiittttt omg\n(pork-bowling)\ncan confirm,   japanese fandom also losing their shit about it \n(Anonymous)\nBBY IS ALL GROWN UP\n(Anonymous)\nngl at first i was skeptical about all this victor/yuuri shipping going around but now i can totally see it\npls send help\n      (katsudone)\n      sorry bro no help here\n      just let it happen\n      shhh\n \n \n\nthree-spins-up reblogged nikifaverov\n\n \nThe Theory of Victor Nikiforov’s Forehead\n \n[ image ][ image ]\n[ image ][ image ]\n[ image ][ image ]\n[ image ][ image ]\n\nborntobehistory\n\nno listen to me\ntheory #3928309 on why victor is possibly leaving figure skating: he’s balding\n \n---\n\ndavaidavai\n\ncursed post\n---\n\nnikifaverov\n\ni hate and love this website and this post aklsjflkg\n \nSource: borntobehistory  #lmao oh my fucking god #victor nikiforov #burn this post\n1,257 notes\n \n \n\nphichit+chu\n\n[ image ]\n1,291 likes\nphichit+chu  look who I ran into at dinner! #Beijing #VictorNikiforov #YuuriKatsuki\n \nkite-likes  hot pot!! that looks really good!\nlostdonut  TAKE LOTS OF PICS PLS\nmordynka  good luck at the competition!\n \n\nphichit+chu\n\n[ image ]\n412 likes\nphicit+chu coach, hold on!! D:\n \nayaliz is he ok lol\nriloush call 911\n \n\nphichit+chu\n\n[ image ]\n9,180 likes\nphichit+chu Wow!! #phichit #Beijing #YuuriKatsuki #VictorNikiforov\n \ndameda OMFG\nridehotdogs  AHHH?!?!?!?!??!?!\nayaliz  LOWER THE CAMERA PLS\nmordynka  ^^^^^\nyuuri-ktsk  phichit! Oh no, I’m embarrassed now...\nphichit+chu  @yuuri-ktsk sorry, sorry!!! ^^;;\n \n\nphichit+chu\n\n[ image ]\n6,278 likes\nphichit+chu #VictorNikiforov and #ChristopheGiacometti look like they’re fighting over #YuuriKatsuki lol #Beijing\n \nlyrarose  you’re an angel among men\nlawrencecoff  i want to be in yuuri’s place lol\nregolden  is that christophe’s hand on yuuri’s ass??\n \n \nYuuri Katsuki Fan Club (katsuki_fc) wrote\n@  2016  -  11  -  xx     06:31 am \nEntry tags: + grand prix 2016 \n \n\n Cup of China 2016 Watch Party DAY ONE \n\n \nYuuri-chan’s first qualifier is here--!!!\nSince the community has grown exponentially since last year’s grand prix, I made the executive decision to do separate threads for each day of the competition Yuuri is at. (For the other qualifiers, there’s a pinned thread here) SO KEEP THE COMMENTS AND SUPPORT COMING IN.\nWhere to watch:\nUS - NBCSN broadcasts live\n icenetwork  (subscription based stream)\n niconico stream  (thanks to anon for this)\n\n youtube stream \n\n Match Arena  (Russian stream)\n CBC Sports  (Canadian stream)\n Eurosport 2  (British stream)\n \nWATCH PARTY RULES STILL APPLY:\n \nAnon is on, but I can still take it away.\n(I know I haven’t done that before despite my threats but don’t give me a reason to)\nLet’s cheer Yuuri-chan on!  勇利ちゃん、頑張って！！ ｡ﾟ✶ฺ.ヽ(*´∀`*)ﾉ.✶ฺﾟ｡\n \n---\n[Page 10 of 62]\n[&lt;&lt; 1 2 3 … 9 10 11 ... 60 61 62 &gt;&gt;]\n \n(Anonymous)\nSHAAAAALLL WE SKAAAATE\n      (wet-ice)\n      great now the song is gonna stuck in my head for the rest of the night\n(Anonymous)\nphichit is my third fave skater lmao\n      (Anonymous)\n      ikr? lmao precious child\n(Anonymous)\nguang hong is so cute ngl\n      (Anonymous)\n      like a babyyyy\n(zenseis)\nit does look like guang hong still has room to improve\n      (Anonymous)\n      give it a year or two I think and he’ll be a real contender\n            (zensei)\n            yeah he’s still a bit green for the grand prix\n \n---\n \n[Page 12 of 62]\n[&lt;&lt; 1 2 3 … 11 12 13 ... 60 61 62 &gt;&gt;]\n \n(Anonymous)\nIT’S YUURI-CHAN’S TURN\n(Anonymous)\nYUURRRIIIIIIIIIIIII\n(wet-ice)\nYAAAAASSSSS\nEROS TIMMEEEEE\n(Anonymous)\nI’m never gonna get tired of this routine\n      (katsudone)\n      same ^\n(rathofgrapes)\nI WANT TO KNOW WHAT THEY’RE SAYING TO EACH OTHER WHILE THEY HOLD HANDS AND HAVE FOREHEADS TOUCHING AAAAAAAAAAA\n(pridebananas)\noh my godasafj that lip licking tho\n(Anonymous)\n“maybe living with his coach Victor has changed things for him mentally” - commentator on yuuri’s eros ( ͡° ͜ʖ ͡°)\n      (Anonymous)\n      ( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)\n(pork-bowling)\nhe’s on top form today!\n      (katsuki_fc)\n      ikr, he’s landing all his jumps, even the quad salchow!\n \n---\n[Page 15 of 62]\n[&lt;&lt; 1 2 3 … 14 15 16 ... 60 61 62 &gt;&gt;]\n \n(Anonymous)\nLOVE WINS\n(Anonymous)\nthat was his best performance of it yet!!\n(Anonymous)\nPERFECTION\n(demiguises)\nlmao look victor forgot where the kiss and cry is\n      (Anonymous)\n      what a dork\n(Anonymous)\n106.84!!! HOLY SHIT!!!\n(katsuki_fc)\n106.84 NEW PERSONAL BEST AND NOW IN FIRST PLACE\n(porkcutlet)\nYASSS YUURI-CHAAANNN\n(Anonymous)\nGRATS YUURI-CHAN\n(Anonymous)\nVICTOR PLS HUG HIM FOR ALL OF US\n      (Anonymous)\n      ^^^^^^^^^^^^^^^\n(toe-looper)\nomg bby looks completely overwhelmed lmao\n \n \n \n\nslayandshake reblogged actualfigureskating\n\n \n\nactualfigureskating\n\nI arrive at the Cup of China skating rink\n \nskates: on\ntheme: heartbreak\nTEARS: ALL OVER THE ICE\n \n---\n\nactualfigureskating\n\nI AM FORCIBLY REMOVED FROM THE CUP OF CHINA SKATING RINK\n \nSource: actualfigureskating  #PISSING LMAO #poor georgi tho lol\n \n1,523 notes\n \n \n\nwatsh1 reblogged from deresnelssss\n\n \n[ image ][ image ][ image ]\n[ image ][ image ][ image ]\n[ image ][ image ][ image ]\n\nintoxshitcated\n\nchristophe giacometti’s ass shots in his intoxicated short program\n \n---\n\nderesnelssss\n\nTHAT PROGRAM WAS ONLY 2 MINUTES LONG AND I FEEL PERSONALLY ATTACKED\n \nSource: intoxshitcated  #screaming #i feel like i need to file a sexual harassment suit\n \n2,123 notes\n \n \nDONE WITH LIFE @katusdone\n“With my coach, Victor, I’ll win with the power of love!” LOL OMG #CupofChina #YuuriKatsuki\nhot wheels on ice @superquad\n@katsudone SAME LMAO\n \nYuuri Katsuki Fan Club (katsuki_fc) wrote\n@  2016  -  11  -  xx     07:03 am \nEntry tags: + grand prix 2016 \n \n\n Cup of China 2016 Watch Party DAY TWO \n\nIt’s time for the free skate program!\nOur precious Yuuri-chan finished FIRST PLACE yesterday at the short program and hopefully his momentum gets going!! (Yes, we all know he has a problem with nerves and pressure, but send him lots of love to help him through it okay?? ;A;)\n \nWhere to watch:\nUS - NBCSN broadcasts live\n icenetwork  (subscription based stream)\n niconico stream  (thanks to anon for this)\n\n youtube stream \n\n Match Arena  (Russian stream)\n CBC Sports  (Canadian stream)\n Eurosport 2  (British stream)\n \nWATCH PARTY RULES STILL APPLY:\n \nAnon is on, AND YES I STILL HAVE POWER TO TAKE IT AWAY. (don’t mock meeee)\n \n---\n[Page 2 of 107]\n[ &lt;&lt;  1 2  3 … 105 106 107  &gt;&gt; ]\n \n(Anonymous)\nhe’s going last then?\n      (Anonymous)\n      yep, they go from last to first place for the free skate\n(wet-ice)\noh no yuuri-chan looks nervous D:\n(Anonymous)\nYuuri! Hold on!!\n(Anonymous)\nbby doesnt look like he rested well ):\n(Anonymous)\nI HOPE HE’S OKAYYYY ;;;;;\n \n---\n \n[Page 36 of 107]\n[&lt;&lt; 1 2 3 … 35 36 37 ... 105 106 107 &gt;&gt;]\n \n(Anonymous)\nchristophe has a record of catching up with his free skate lol\n      (Anonymous)\n      self proclaimed “slow starter” lol\n(porkcutlet)\n“It looks like Victor is taking Yuuri away from the public eye until his free skate?”  ( original tweet )\nnormally it’s prime material for suggestive jokes but i’m actually worried about yuuri since we know he gets really nervous when the pressure is on\n      (katsuki_fc)\n      Yeah, we’re very familiar with it :( I really hope Victor does something to help him. Yuuri’s been doing so well these past few months\n(Anonymous)\nyuuriiiii ;; we belieeeve in youuuu\n \n---\n[Page 67 of 107]\n[&lt;&lt; 1 2 3 … 66 67 68 ... 105 106 107 &gt;&gt;]\n \n(Anonymous)\nSo i can’t be like the only one who thought georgi’s music was somehow gonna transition to heart’s alone during that violin part, right??\n      (Anonymous)\n      holy shit i cant unhear aklsjfklgj\n      (wet-ice)\n      omfg SAME\n(katsudone)\ndoesn’t yuuri’s eyes look a little red?? ):\n(Anonymous)\nI hope he’s okay now ;;\n(Anonymous)\nIM SO NERVOUS FOR HIM\n(demiguises)\nboop\n      (Anonymous)\n      boop\n      (snow-ninja)\n      boop\n(yuuri-chin)\ni’m completely in love with this track\n      (Anonymous)\n      saaaameee 10/10 would buy it\n(Anonymous)\noh wow he looks completely relaxed\n(Anonymous)\nhe’s smiling too!\n(Anonymous)\nYUURI, GANBA!!\n \n---\n[Page 68 of 107]\n[&lt;&lt; 1 2 3 … 67 68 69 ... 105 106 107 &gt;&gt;]\n \n(Anonymous)\nnice jumps!\n(katsuki_fc)\nyes! quad salchow nailed!\n(Anonymous)\nhe’s looks even more beautiful today than ever omg ;;\n(Anonymous)\nYUURI-CHAN ;u;\n(iceicecrazy)\nhis ballet training is showing so wonderfully\n(Anonymous)\nTHAT POISE\n(Anonymous)\nhe’s beauty he’s grace\n(jellyfish_songs)\nhe’s over rotating a little bit BUT ITS OK HE’S DOING SO WELL\n(Anonymous)\nlmao omg victor’s amazed face\nBOY’S GOT STAMINA TO DO ALL THESE JUMPS YO\n \n---\n[Page 71 of 107]\n[&lt;&lt; 1 2 3 … 70 71 72 ... 105 106 107 &gt;&gt;]\n \n(Anonymous)\nWAIT\nWAIT\nHOLY SHIT\n(Anonymous)\nTHATS A FLIP\nOMFG\nA QUADRUPLE FLIP\n(pork-bowling)\nWE’RE ALL SCREAMING OMG THERE WAS DEFINITELY ENOUGH ROTATIONS FOR THAT TO BE A QUAD FLIP\n(Anonymous)\nAND AT THE END OF THE PROGRAM TOO?? HOLY SHITTT\n(fruity-loops)\nBOYYYYYYYYYYYYYYYYYYYYYYYYYYY\n(Anonymous)\nTHE CROWD IS GOING WILD\n(iceicecrazy)\nALKSJFKLGJALKSDJLK YUURI-CHAN\nAMAZINGLAKSDJ\n \n---\n[Page 73 of 107]\n[&lt;&lt; 1 2 3 … 72 73 74 ... 105 106 107 &gt;&gt;]\n \n(Anonymous)\nWHOA\n(Anonymous)\nSCREAMINGGGGGG\nIS THAT\nARE THEY\n(porkcutlet)\nHOLY FUCKING SHIT ITS A KISS ON LIVE TV\n(Anonymous)\nWAIT WAIT WAS THAT ACTUALLY LEGIT A KISS WHAT\n(katsudone)\nI NEED A REPLAY\nAND A HQ CLIP\nAND A HQ SCREEN CAP\n(Anonymous)\nFURIOUSLY F5’ING TWITTER FEED BECAUSE I NEED CONFIRMATION SO I CAN LEGIT CRY TEARS OF JOY\n(Anonymous)\nPHICHIT PLS TELL ME YOU GOT THAT AND UPLOAD IT TO YOUR INSTAGRAM NOW PLS YOU’RE OUR BEST HOPE\n(katsuki_fc)\nBRB OFFICIALLY DEAD\nFOR SURE NOW THIS IS NOT A DRILL\nI REPEAT THIS IS NOT A DRILL\n      (Anonymous)\n      HOW MANY TIMES HAVE YOU DIED NOW MOD-SAN\n            (katsuki_fc)\n            TOO MANY BUT THIS IS MY LAST DEATH\n                  (Anonymous)\n                  NAW WE ALL KNOW YOU’RE AN IMMORTAL THAT FEEDS ON THE POWER OF YUURI FANS\n                        (katsuki_fc)\n                        REVEAL NO SECRETS AND I SHALL TELL NO LIES\n\njankenponsu reblogged nqkamen\n\n \n\nnqkamen\n\ni will fight anyone who thinks the victuuri kiss was a hug\n---\n\nbitterchocolates\n\nit was a hug\n---\n\nnqkamen\n\nmeet me at the back of denny;s at midnight\nSource: nqkamen  #lol same #it was a kiss fight me\n412 notes\n \n \n[Discussion] Cup of China Victuuri Kiss? or Hug? (self.katsuyuudon)\nsubmitted 4 hours ago by demigodsays\n \nSo we all were shocked and surprised when Victor jumped at Yuuri after his free skate program and I know a lot of people have been rooting for them, and the immediate assumption is that they kissed. And don’t get me wrong, I hope that’s the case but a lot of people are saying otherwise? So now that the flailing and shock is gone by now… Did we really see a kiss?\nNone of the TV cameras were able to get a good angle so we’re left wondering. (Proof: video compilation of all the angles taken, but none of them show anything because Victor’S DAMN ARM) Also, it looked like they shared words after, but again, no one knows what they said for sure.\nWhat’s the consensus folks? Kiss or hug?\nEDIT: o shit hi /r/all\nEDIT AGAIN: how the fuck did this get me my first reddit gold. i was just asking a question.\n4129 comments   share   save   hide   give gold   report\n \nTOP 200 COMMENTS  show all 4129\n\nsorted by: top\n\n \nsleepyegg[M]  529 points  3 hours ago - STICKIED COMMENT\nReminder that we DO NOT tolerate bashing in this sub, whether its regarding the sport, the athletes, or their sexualities.\nAlso reminder that you’re in /r/katsuyuudon, a subreddit for Yuuri Katsuki fans. We’re generally a nice bunch, but we will protect him and our own if it looks like you’re being an asshole.\nI’m serious. Anyone is welcome even if they’re a Yuri’s Angel, or JJ Girl, or whatever fan of any other skater as long as you’re civil.\nI have a banhammer and I’m not afraid to use it.\n \ngeneroussinner  1.4k points  2 hours ago\nOh for fuck’s sake, guys. Why is there even a debate about this. IT WAS A KISS.\nHow do I know for sure, you ask?\nand most importantly\nIf you don’t think it was a kiss either you’re blind and deaf or a fucking idiot sandwich.\nedit: I’m glad I got gold by showing off my no-life skills and defending my figure skating otp.\n      pantsutrash  421 points  2 hours ago\n      /thread\n      getgidditywithit  399 points  2 hours ago\n      I’m sorry I doubted\n            dankaimeme  482 points  2 hours ago\n            as long as you know what that makes you\n            what are you?\n                  getgidditywithit  505 points  2 hours ago\n                  An idiot sandwich.\n      spiritanimal  110 points  2 hours ago\n      ok\nhibiscus-honey  893 points  3 hours ago\nI know nothing about figure skating or these guys but\nthat’s a kiss\n      mirrormirror  910 points  3 hours ago\n      Same.\n      I do like their ship name though, “Victuuri.”\n \n \ncala  @combi-spin\ntrying to add to the “it’s a kiss” argument with this poorly outlined pic because fuck victor’s arm #VictuuriKiss\n[ image ]\ncala  @combi-spin\nthe red wobby lines are where victor and yuuri’s noses and mouths would approximately be from this angle\ncala  @combi-spin\nif it was a hug, either victor or yuuri’s face would be almost completely covered by the other\ncala  @combi-spin\nbut as yoU CAN PLAINLY SEE that’s not the case\ncala  @combi-spin\ntheir faces are right in front of each other and they’re literally forehead to forehead\ncala  @combi-spin\nso it has to be a kiss or it’s one of the weirdest fucking hugs i’ve ever seen\n \n \n\nheart-to-hear reblogged kinzaime\n\n \n\nabsolute-zer00\n\nit’s not a fucking kiss you guys\nshut the fuck up you’re all annoying\ngod it’s like all i ever hear is victor and yuuri\nthere are other ice skaters too you know\n---\n\nintoxshitcated\n\nwhere are you that you’re only hearing about victor and yuuri\nlegit question because uh\nhave you met JJ Girls\n---\n\nkingsglaved\n\nlike no hate on any of the other fans but victor’s fans have always been all over and yuuri’s fans are like ninjas, man\nidk you might want to find another corner of the internet because clearly you’re in the wrong neighborhood bruv\n---\n\ndavaidavai\n\nor you know\nblacklist is a thing\n \nSource: absolute-zer00\n102 notes\n \n \n\nborntobehistory reblogged nikifaverov\n\n \n\nactualfigureskating\n\nwhen your favorite coach-skater pair kisses but a lot of people say its a hug\n[ image ]\n \nSource: actualfigureskating  #actualfigureskating is my favorite #im glad the one time they use the math lady meme is for this #because i am CONFUSED BY THESE PEOPLE\n2,982 notes\n \n \n\nv-nikiforov\n\n \n[ image ]\n16,291 likes\nv-nikiforov #KissOrHug ? why not both? #YuuriKatsuki\n \nphichit+chu  omg!!\ndameda  SCREAMING\nemmylia  aklsdjklhjgalksjfklsadjaslkhgjse\nchristophe-gc  not invited again! I’m starting to think you two don’t like me ;_;\nv-nikiforov  @christophe-gc haha we’ll make it up to you at the final\nyuri-plisetsky  ugh keep this out of my feed\nv-nikiforov  @yuri-plisetsky see you at the rostelecom cup!\nanaliz  YOU TWO GIVE ME LIFE\n \n\nyuuri-ktsk\n\n \n[ image ]\n18,110 likes\nyuuri-ktsk  Victor isn’t allowed to use any social media for the rest of the night &gt;:(\n \nridehotdogs  *WHIPPING SOUNDS*\nnanasenagi  aww poor victor lol\nphichit+chu  LOL! Your pic has more likes than Victor’s\nchristophe-gc  @phichit+chu Yuuri does only post once in a blue moon\n \nAngeline  @angelinesp\nNot the Yu(u)ri I was looking for, but still funny to see Plisetsky running away from his screaming fans lol\n[ image ]\nheal plz  @killerdeeps\nabout to creep around the hotel and see if i can run into any competitors loool\nheal plz  @killerdeeps\nwish me luck guys im going in\n \n \nYuuri Katsuki Fan Club (katsuki_fc) wrote\n@ 2016-11-xx   09:51 am \nEntry tags: + grand prix 2016 \n \n\n Rostelecom Cup 2016 Watch Party DAY ONE \n\nYuuri’s second qualifier is here! How well he does here determines his placement and whether or not he gets to go to the Final. Remember he only has to reach 4th or higher to qualify! So let’s send all our positive vibes at him and cheer him on!\n \nWhere to watch:\nUS - NBCSN broadcasts live\n icenetwork  (subscription based stream)\n niconico stream  (thanks to anon for this)\n\n youtube stream \n\n Match Arena  (Russian stream)\n CBC Sports  (Canadian stream)\n Eurosport 2  (British stream)\n \nWatch rules, as always:\n \nAnon is on, as always\n---\n[Page 3 of 79]\n[ &lt;&lt;  1 2  3 … 79  &gt;&gt; ]\n \n(Anonymous)\nwho’s going first?\n      (Anonymous)\n      Seung-gil Lee from Korea\n(Anonymous)\nomg that costume LOL\n      (Anonymous)\n      ikr LOL\n(demiguises)\nis anyone else having problems with the livestream??\n      (Anonymous)\n      working fine on my end\n      (Anonymous)\n      I’m having problems too\n      (Anonymous)\n      same\n      should’ve just gone to Russia lolol\n(Anonymous)\nhis face is stone cold LMAO\n(Anonymous)\nyou know I forget that Yuuri is actually the second oldest competitor this year\n      (pork-bowling)\n      baby faced Yuuri is presh\n---\n[Page 15 of 79]\n[&lt;&lt; 1 2 3 … 14 15 16 ... 79 &gt;&gt;]\n \n(Anonymous)\nomfg the tie grab move\n(Anonymous) DEAD\n(fruityloops)\nomg he’s blushing lolololol\n(Anonymous)\nI WANNA KNOW WHAT THEY SAID TO EACH OTHERRRRR\n(Anonymous)\nseeing sexy yuuri never gets old ^q^\n(pridebanana)\nyuuri is always eros //////\n(Anonymous)\nFLIRTY BLOW KISS OH BOY\n(katsudone)\nomfg im dead\nSO SO SOSOSO DEAD aklgfjk\n(toe-looper)\nTHIS BOY SLAYS ME\n---\n[Page 21 of 79]\n[&lt;&lt; 1 2 3 … 20 21 22 ... 79 &gt;&gt;]\n \n(Anonymous)\nflawless performance again!\n(Anonymous) YAY YUURI-CHAN\n(Anonymous)\nim so so so proud of him cries\n(porkcutlet)\nhe beat his personal best again!\n(Anonymous)\nyass yuuri! congrats!\n(zenseis)\nLOL VICTOR\n(Anonymous) VICTOR PLS\n(rathofgrapes)\nadjlkasjdljg VICTOR ON HIS KNEES GIVING YUURI’S SKATES A KISS I CANNOT BELIEVE THANKS GOD\n(Anonymous)\nomg victor and yuuri cheering yuri plisetsky on thEY’RE SO PRECIOUS\n \n \n\ndrunkenmoneys reblogged davaidavai\n\n \n\ndavaidavai\n\nok real talk here\ndid anyone else burst out laughing when they saw that literally EVERYONE IN THE CROWD STARTED SINGING ALONG JJ’S THEME SONG\nWHAT IS THIS BOY\n---\n\ndrunkenmoneys \n\nhe’s ours and we are proud and ashamed at the same time\n \nSource: davaidavai  #my cousin goes to the same university as him and he’s pretty much the same off ice as he is on ice #our canadian skating child\n201 notes\n \n \nhot wheels on ice  @superquad\nYuuri Katsuki is at 2nd place at the end of the short programs yaaaaayyy\nDONE WITH LIFE  @katsudone\n@superquad i;m so proud of himm…. bby.,\nmake the ice go loco  @jjlicious\n@katsudone there’s still tomorrow’s free skate yo uknow lol…\nDONE WITH LIFE  @katsudone\n@jjlicious LEA VE ME==ALONW.,..Im drunk\n \nVictor Nikiforov  @vnikiforov\nTo quell the rumors and answer everyone’s questions - I’m going back to Japan for an emergency.\nVictor Nikiforov  @vnikiforov\nUnfortunately, that means I will not be able to be with Yuuri during tomorrow’s free skate. But I have faith in his abilities.\nVictor Nikiforov  @vnikiforov\nI would still appreciate it if everyone can lend their support to Yuuri tomorrow in my stead, though. Let’s remind him that his fans are always there to keep him up!\n \n \nYuuri Katsuki Fan Club (katsuki_fc) wrote\n@  2016  -  11 -  xx     07:19 am \nEntry tags: + grand prix 2016 \n \n\n Rostelecom Cup 2016 Watch Party DAY TWO \n\nFree skate time! Second day of Rostelecom cup, here we go!\nA bit of unfortunate news to those who haven’t heard, but due to an undisclosed emergency, Victor will not be by Yuuri’s side today. ;-; But last night, Victor asked of us Yuuri fans to keep cheering him on and to remind him that we’re here for him! So let’s do our best!\n \nWhere to watch:\nUS - NBCSN broadcasts live\n icenetwork  (subscription based stream)\n niconico stream  (thanks to anon for this)\n\n youtube stream \n\n Match Arena  (Russian stream)\n CBC Sports  (Canadian stream)\n Eurosport 2  (British stream)\n \nWatch rules, as always:\n \nAnon is on, as always\n---\n[Page 75 of 98]\n[&lt;&lt; 1 2 3 … 74 75 76 ... 98 &gt;&gt;]\n \n(Anonymous)\nhe’s messing up a little but I hope he keeps pulling through!\n(Anonymous)\nYuuri-chan, ganba!!\n(Anonymous)\nhe’ll be okay I BELIEEEEVE\n(wet-ice)\nok but seriously though where can I get this song on my everything\n      (Anonymous)\n      ^^^ SAME it really is so beautiful\n(snow-ninja)\nI hope he gets enough points to qualify for the final!\n(Anonymous)\naw shame about that touch down though\n---\n[Page 97 of 98]\n[&lt;&lt; 1 2 3 … 96 97 98 &gt;&gt;]\n \n(Anonymous)\nso who qualifies then? Yuuri or Crispino?\n      (Anonymous)\n      It would be Yuuri since he placed 2nd at the Cup of China\n            (yuuri-chin)\n            oh thank god\n            (Anonymous)\n            i’m so relieved omg\n(katsuki_fc)\nRemember to send some love towards Yuuri’s way! Congratulations to him for making it to his second consecutive Grand Prix Final! He has a real chance for the podium this year, even with the favorites being a combination of Altin, Leroy, Giacometti, and Plisetsky.\nAlso send your well wishes to Victor re: his emergency. We may not know what it is, but considering the tone of his tweets and the rush he had to leave in, we can probably assume it’s something to hope for the best for.\n      (Anonymous)\n      petition to make mod-san an angel\n            (Anonymous)\n            silly anon\n            mod-san already IS an angel\n \n \n\ndankness-arises reblogged lollipopjohnson\n\n \n\nunderstatedgarments\n\n[ video ]\npls watch this video from emil nekola’s instagram \n---\n\nslayandshake\n\nLOL IS THAT YUURI CHASING YURI\n---\n\njankenponsu\n\nomg they’re calling him a hug zombie\nSource: understatedgarments  #omfg this is the yuuri-yuri content i want #also is that sara crispino i hear\n3,839 notes\n \n \n\nnikifaverov reblogged three-spins-up\n\n \n\nthree-spins-up\n\n[ image ][ image ]\n[ image ][ image ]\n[        image        ]\n[        image        ]\n \nTranslating the tweets from @shingeki\n\n “I saw Victor Nikiforov at the airport today. He looked a little tired and gloomy.” \n\n\n “Then his dog perked up and Yuuri Katsuki was at the other side of the glass partition! I was shocked so I couldn’t take a picture.” \n\n\n “Because the next thing I knew, they were running side by side until the arrivals exit. They never took their eyes off each other.” \n\n\n “Everyone stared as they embraced, but all I could think of is ‘Wow, they are so in love.’” \n\njust. I never thought I’d be shipping two people like this but. Just look at that last two pics. Never have I ever felt this emotion so strong just looking at pictures of two people embracing and holding hands.\nA lot of people are doubting their legitimacy but I think these two pictures prove them completely and absolutely wrong.\nSource: three-spins-up  #victuuri #im not crying you’re crying #im so happy for them #speaking as a lifelong victor fan #im glad he finally found someone\n24,907 notes\n \nVictor Nikiforov  @vnikiforov\nwhen you want to ask for something gold for your birthday, and you know he’ll think you mean a medal haha\nVictor Nikiforov  @vnikiforov\nJust kidding! :P\nHORA HORA @excitedstuff\n@vnikiforov SCREAMS ???? ? ??????? !!!!!!!!!!!!!!\ni want the d  @imeanthedice\n@vnikiforov DONT PLAY WITH MY HEART LIKE THIS\n\nv-nikiforov\n\n[ image ]\n15,926 likes\nv-nikiforov  thanks to a local fan for the complementing flower crowns for me and the birthday boy!  ♥ #HappyBirthday #YuuriKatsuki\n \nlostdonut  I AM DYING PLEASE STOP BEING SO CUTE\nrahkasam  this picture has cleared my skin, my crops are flourishing, i am ascending to heaven\nmissmeow  PLS GET MARRIED ALREADY\nmiamia  COUPLE GOALS\n \nYuuri Katsuki  @yuuri-ktsk\nThank you for the well wishes, everyone. I was surprised that so many of you know my birthday!\nYuuri Katsuki  @yuuri-ktsk\nVictor surprised me by hiding and accumulating all the gifts you guys were sending me, then revealing this huge pile of gifts and letters on the morning of.\nYuuri Katsuki  @yuuri-ktsk\nI appreciate all the support you have all given me this year. I’ll make sure to thank you all by winning a medal at the Grand Prix final!\nVictor Nikiforov  @vnikiforov\nCookies a group of @yuuri-ktsk’s fans sent for his birthday! The Victor and Yuuri shaped ones were too cute to eat!\n[ image ]\nya boi coming in  @buttonblanket\n@yuuri-ktsk you are.. a beautiful cinnamon too good for this world.. too pure…\nYuuri Katsuki fanclub  @katsuki_fc\n@vnikiforov @yuuri-ktsk AAAAAA WE’RE SO GLAD YOU GOT THEM! Happy Birthday, Yuuri! Love, your fans worldwide.\n \n \n\nTop 15 Pairs in Sports for 2016\n\nposted on Dec. xx, 2016, at 10:28 am\nMatt Cab\nFuzzBeed Staff\n \n…\n \n \n[ image ]\n(Yuuri on the left, Victor on the right)\n \nA figure skating duo in an article about top pairs in sports? No surprise. A male-male coach-skater pair, however? A little eyebrow raising. Usually we like to stick to two people who compete together in the court, field, rink, or wherever, but we’re bending the rules a little for Yuuri and Victor.\nThe figure skating community experienced a more than mild uproar when Russian living legend figure skater Victor Nikiforov announced taking the season off earlier this year. And when it was found out that he was coaching 2015 Grand Prix Final’s 6th placer Yuuri Katsuki in the meantime, well, didn’t that cause a lot of tongues to waggle.\nBut over the course of the year, the pair’s chemistry became more and more undeniable. From Victor’s constant instagram and twitter posts, to little moments captured on camera (more rink-side hugs than any other figure skating pair this year -- we counted), to Yuuri constantly seducing Victor with his “On Love: Eros” routine -- it was no wonder people (all of us) were starting to think their relationship was more than platonic.\nAnd we were all proven right during the Cup of China, when the viral so-called “Victuuri Kiss” happened.\n \n[ image ]\n(Sweet, sweet  victory  victuuri)\nTrust me, we all screamed when it happened, too.\n \n…\n \n\nFacebook Conversations\n\nSort by: Top\n \n\nKaterina Johnson\n\nSMH Yuuri and Victor should’ve been #1\nLike. Reply. 52 likes. 22 hrs.\n\nLi Sheung \n\nVictuuri only #3? Come on, guys, who are even #2 and #1.\nLike. Reply. 29 likes. 20 hrs.\n \n \n\nv-nikiforov\n\n[ image ]\n10,678 likes\nv-nikiforov  #Barcelona! Poor #YuuriKatsuki is jet-lagged, though haha\n \nlyrarose  Good luck to both of you in the Final!\nhalapenyo  ahhhh jealous!! of the view and location lol\naisha-cc  awww yuuri is so cute\n \n \n\nyuurikatsuki-fans reblogged vnikiforov-fc\n\n \n[ image ][ image ][ image ]\n[ image ][ image ][ image ]\n[ image ][ image ][ image ]\n\nnikifaverov\n\nVictor and Yuuri sightseeing in Barcelona!\n( ★ )\n \n---\n\ndavaidavai\n\nI WISH I WAS THERE RIGHT NOW\n---\n\ndenketsu-sann \n\nthey’re so cute omgggg\n\nSource: nikifaverov  #yuurikatsuki #victornikiforov #barcelona\n12,926 notes\n \n \nkit and kat  @knksanti\nAWLSKDJFLKJASLDJKLFGJDLKASDD\nkit and kat  @knksanti\n\ndame un momento por favor\n\nkit and kat  @knksanti\n\nolvidé cómo hablar inglés. estoy demasiado emocionado LOL\n\nkit and kat  @knksanti\nOK OK JUST\nI WAS WALKING AROUND THE STORES AND\nGUESS WHO I RAN INTO???\n[ image ]\nkit and kat  @knksanti\nI’m crying so much. I can’t believe I met them in person even though I knew they were in Barcelona.\nkit and kat  @knksanti\nThey were so nice! Yuuri actually thought I just wanted a picture with Victor even though Yuuri is totally my favorite this season.\nkit and kat  @knksanti\nYuuri is as precious irl as we all think he is. He and Victor are so cute together I’m actually jealous lol\nAmy★ @amyzing\n@knksanti I./ HATE. YOU…. omg i am so soso so jelly rn\n \n \n[News]The Fairy of Russia, Yuri Plisetsky, rides off on a motorbike with Otabek, the hero of Kazakhstan (skatenews.com)\nsubmitted 30 mins ago by HamelW\nngl, I’m mostly sharing this for that article title\n39 comments  share  save  hide  give gold  report\n \nTOP 20 COMMENTS   show all 39\n\nsort by: new\n\n \ninfernorises  [score hidden]  3 mins ago\nprime material for /r/writingprompts\ngeorgianchanting  [score hidden] 5 mins ago\ncan’t blame the kid, if it’s to run away from his crazy fans\nferreroooos  [score hidden]  6 mins ago\nTAKE ME AWAAAAYY\nA SECRET PLACE\nA SWEET ESCAPE\nA HIDING PLACE\nkigerune  [score hidden]  7 mins ago\nNot exactly the Yuri/Yuuri I wanted to hear about, but that is hilarious\n \n \n\nwatash1 reblogged jankenponsu\n\n \n\nlollipopjohnson\n\noh god ok i swear i don’t want to become that person but- BUT--\nso I was like looking at victor’s instagram feed and he posted this pic of shopping bags because apparently he and yuuri went shopping and im already crying because thats such a couple thing to do\nANYWAY THIS PIC\n[ image ]\nyou can guess what most of tthem are (clothes, some knick knacks, food) and me and slayandshake are no lifers that figured out the brands those bags belong to so we put labels over the pic and show off our elite detective work\nbut what about that one bag at the side thats half cut off from the pic, you say\n[ image ]\ndark blue, “Maria D”\n[ image ]\ni wonder what that store is\n[ image ]\noh maria dolores, you say\n[ image ]\ni wonder what they sell\n[ image ]\njewelry, huh.\nwiTH A SPECIALTY IN WEDDING RINGS, HUH\n[ image ]\nI WONDER..WHAT.. THEY COULD POSSIBLY.. BUYY FROM THERE……………\n \n---\n\nslayandshake\n\nINTERNAL SCREAMING\n \nSource: lollipopjohnson  #I AM SHOOK  #IS THIS REAL LIFE THO #OR IS THIS JUST FANTASY #PLS @ GOD TELL ME ITS TRU #OR PHICHIT SAME THING BASICALLY\n35,029 notes\n \n \n\nphichit+chu\n\n[ image ]\n8,195 likes\nphichit+chu  Dinner with some of the others at #Barcelona!\n \nayaliz  THE DREAM\njelly-will  omg otabek too!!\nregolden SAY HI TO EVERYONE FOR ME\n+guanghoji+ aaaahh I wish me and leo were there too!\n\n\n\nphichit+chu\n\n[ image ]\n26,921 likes\nphichit+chu  Had to be sneaky taking this pic hahahaha #Victuuri\n \nkatsukyuuun  NO. WAY.\nmordynka  WAIT WAIT WAIT IS THAT VICTOR AND YUURI’S HANDS!?!?!!\nphichit+chu  @mordynka :3\nfleur-jens  Did they get engaged!? Or even better, married?!?!?!?!?\nkay-cee  I CANNOT BELIEVE…..\nnandacket  HOLD THE PHONE ARE THOSE ENGAGEMENT RINGS\nuzhaan  PHICHIT PLS WE NEED TO KNOW OUR FAMILIES ARE STARVING\n \n \nYuuri Katsuki Fan Club (katsuki_fc) wrote\n@  2016  -  12  -  xx     01:41 am \nEntry tags: + yuuri watch \n \n\n YUURI WATCH: SPECIAL GPF WEEKEND EDITION \n\nSpecial discussion post for this weekend! BECAUSE OH BOY DID SOME PEOPLE HAVE STUFF TO SHARE\nDISCUSSION QUESTIONS:\n \n---\n[Page 13 of 47]\n[&lt;&lt; 1 2 3 … 12 13 14 ... 47 &gt;&gt;]\n \n(Anonymous)\nI want Yuuri to crush my head like a watermelon with his thighs\n      (Anonymous)\n      same tbh\n(Anonymous)\nENGAGEMENT HYPE\nI CANNOT BELIEVE HOLY SHIT THO\n      (Anonymous)\n      I’M STILL CONVINCED THAT THIS IS A DREAM AND I’M GOING TO WAKE UP DISAPPOINTED THAT THEY’RE NOT GETTING MARRIED\n(Anonymous)\nokay but yuuri pole dancing is something I never knew I needed but now want more of\n      (Anonymous)\n      cinnamon roll more like SINnamon roll amirite\n(rathofgrapes)\nSeriously though, I am legit impressed of Yuuri’s dancing on the floor and on the pole. Our boy’s got moves, yo.\n \nBUT WHO LET HIM DRINK THAT MUCH GODDAMNNN\n(Anonymous)\nPhichit is a hero we don’t deserve but we desperately needed. Thank u so much phichit for confirming to everyone that they got matching rings time for me to go cry tears of joy.\n \n \n\nborntobehistory reblogged three-spins-up\n\n \n[ image ][ image ]\n[ image ][ image ]\n[ image ][ image ]\n[ image ][ image ]\n\nthree-spins-up\n\nSo it was bothering me a little why the moves in Victor and Yuuri’s “dance off” from last year’s banquet looked so familiar, and it wasn’t until I was half-asleep in the shower earlier that I realized it.\n\n Eros. \n\nSo I scrounged up videos of the routine and I cannot believe this two LOL To remind everyone, Eros is about a “seduction game” between a playboy and the most beautiful woman in town.\n\n And Victor Nikiforov based it on his and Yuuri’s dance off. \n\nThe real question is, which one is the ‘playboy’ and which is the ‘most beautiful woman in town’ ;)\n\nSource: three-spins-up  #holy shit LOL #i cannot even believe how the turn tables #victor nikiforov #yuuri katsuki\n \n \nVictor Nikiforov  @vnikiforov\nYuuri beat me to it, in the end :P\n \nVictor Nikiforov  @vnikiforov\nBut I guess I got my birthday wish after all!\n[ image ]\n \nYuuri Katsuki Fan Club (katsuki_fc) wrote\n@  2016  -  12  -  xx     08:39 am \nEntry tags: + grand prix 2016  +  watch party \n \n\n Grand Prix 2016 Watch Party DAY ONE \n\nHERE WE ARE BOYS AND GIRLS AND EVERYTHING IN BETWEEN. Grand Prix Finals 2016! Yuuri-chan’s second consecutive Grand Prix, and hopefully not the last. (PLEAAASE) The season has been an absolutely wonderful dream for us. Let’s keep cheering Yuuri-chan on! 勇利ちゃん、頑張って！！ ｡ﾟ✶ฺ.ヽ(*´∀`*)ﾉ.✶ฺﾟ｡\nToday is the short program and they’ll be skating according to their qualifier rankings!\nSkate order is as follows:\nRules:\n---\n[Page 2 of 65]\n[ &lt;&lt;  1 2  3  …63 64 65  &gt;&gt; ]\n(Anonymous)\nYuuri winning gold would be really, really nice, and he would deserve it, but personally I’d be happy just to see him happy with his performance, whether it gets him on the podium or not. I don’t ever want to see the devastated face he had at last year’s grand prix. It completely shattered my heart.\n      (Anonymous)\n      Same. My mom asked me if I was okay because I was still sobbing into my cereal the next morning.\n      (Anonymous)\n      If he does his best, I think he has a real chance at gold this year.\n(pridebanana)\nPrayer circle time???\n      (Anonymous)\n      PRAYER CIRCLE TIME\n(Anonymous)\nWhen does it start?\n      (toe-looper)\n      30 minutes!\n---\n[Page 6 of 65]\n[ &lt;&lt;  1 2 3 4 5 6 …63 64 65  &gt;&gt; ]\n \n(Anonymous)\nVICTOR IS EMPOWERING THEIR MATCHING RINGS IN A PRAYER FOR VICTORY ASLKFJASLKDJSADSD\n      (Anonymous)\n      I CANT EVEN WITH THIS SHIP\n(fruityloops)\naASLKDJALSKFJ THE RIIIINGGSSSS\nBRB SOBBING ABOUT IT ALL OVER AGAIN\n(Anonymous)\nI cant believe they’re actually engaged what a time to be alive\n(katsudone)\nthe little kiss yuuri-chan gave to his ring alksjlhkgfsf’;\n---\n[Page 26 of 65]\n[ &lt;&lt;  1 2 3 …25 26 27… 63 64 65  &gt;&gt; ]\n(Anonymous)\nomg yuuri looks devastated D:\n(Anonymous)\nYuuri-chan ;; you did so well!!\n(wet_ice)\nyuuri, don’t worry!! ;-; there’s still the FS!!\n(yuuri-chin)\n97.83 is still a high score! don’t feel so down, yuuri-chan :((\n(Anonymous)\na touch down on the landing but a quad flip is still a quad flip! we’re still very proud of you, yuuri-chan!\n \n \nfeel the burn  @threespinsup\nYuri Plisetsky breaks Victor Nikiforov’s World Record in the short program with 118.56 points! Congratulations, Yuri Plisetsky!\ncala  @combi-spin\n@threespinsup it was a flawless performance, the score was definitely well deserved\nfeel the burn  @threespinsup\n@combi-spin yeah, considering Plisetsky has always been a little lacking in his PCS, it’s great to see this kind of growth\nmake the ice go loco  @jjlicious\nis.. jj ok?? :((\n \n \n\nlollipopjohnson reblogged teaple\n\n \n\nsunnyskates\n\n\nThe Grand Prix Pressure\n\nI’m addressing this issue as both a skater and a member of the figure skating fandom. I would like to apologize beforehand if it’s not easy to understand, as English is not my first language and I’m possibly ranting a little bit.\nLast year, a lot of people criticized Yuuri Katsuki for getting the pressure get to him at his (first!) GPF. Today, I’m seeing a lot of the same regarding JJ Leroy’s short program performance.\nIf you didn’t watch today’s performances, JJ is currently in last place at a personal low of 86.71 points after flubbing most of his jumps in his short program. From what we can glean, it seems like he possibly had an anxiety attack early on his program that affected the rest of his performance. To give him credit, it did look like he tried to snap out of it, but as all of us that have experienced it before know, most of the time it’s not that easy.\nI skate competitively in local competitions. I know a lot of skaters. For many of us, the nerves never really go away and the best we can do is skate our way through it. Feeling nervous is natural and nothing to be ashamed of, and nothing to be shamed by. Because imagine this:\nYou’re the top skater of your country. You’re the best your country has to offer. That’s why you’ve been selected to represent your country.\nYour family, friends, and fans - they want and expect you to do your best. They mean well, but the expectations of those you know almost always weigh heavier than of strangers’.\nYou’re in the Grand Prix, and in the Final at that, where only the best of the best can compete in. You’re expected to do your personal bests and make your country proud by performing as perfectly as you can.\nSometimes, something has to give.\nThe pressure of professional sports is hard to comprehend if you haven’t experienced it. So I would just like to remind everyone to take consideration of what the athletes are experiencing before you criticize or explicitly vocalize your “disappointment” (which to what I have seen, is borderline bashing sometimes).\n---\n\nnikifaverov\n\nYour English is fine! I understand how hard it is to express yourself in a secondary language, but I was able to get the gist of it, even as an ESL myself.\nThank you very much for your post though. I hope people take note of it and tone down with the extreme criticism.\n---\n\nunderstatedgarments\n\nI kinda wish this was around last year, but better late than never.\nBut yeah, I’m getting uncomfortable flashbacks to the Yuuri Katsuki hate train last year so I’m glad this is being pointed out. People forget that for some professional sports, it’s not only about physical well-being, but also mental well-being as well. \nSource: sunnyskates #good post #figure skating\n32,091 notes \n \n[Grand Prix Final 2016]SP is over, ranking predictions? (self.figureskating)\nsubmitted 1 hour ago by bumperstickler\nCurrent rankings after SP:\n82 comments  share  save  hide  give gold  report\n \nTOP 20 COMMENTS   show all 82\n\nsort by: best\n\n \njinyan  157 points  50 mins ago\nMy prediction:\nFirst: Plisetsky\nSecond: Giacometti\nThird: Between Altin and Katsuki\nPlisetsky’s FS is insane. He also has a big lead over everyone else after his SP (new WR wtf). If he nails it perfectly like he did his SP, then he’s guaranteed gold.\nGiacometti has a reputation of catching up very well in his FS. He’s been constantly second to Victor for the past few competitions they’ve both been in, and if it weren’t for that 16 point difference between him and Plisetsky, I’d would’ve said he’d take gold.\nNow, Altin is a dark horse but he did get bronze at the last World’s, and he’s currently second place, so it’s an ideal place for him to be at for him to stand on the podium. But, Katsuki’s FS this year is strong PCS and TES wise, so if he nails all his program components - especially the quad flip at the end of his program - then he has a real shot of making up all the points he lost in the SP and at least getting bronze.\nOn Chulanont and Leroy: Chulanont, despite winning gold at the Cup of China, I don’t think can match up the other programs especially since he’s comparatively weaker with his quads. His score is heavily dependent on his PCS. I think he shines when he’s more focused on performing and entertaining the crowd, which won him China in the first place.\nNow Leroy. Oh JJ. His SP was a mess. He did evidently try to recover, but his score suffered poorly by his messed up jumps. Depending on how his FS goes, he maaaaaaay recover and grab fifth or even fourth if someone else messes up worse.\n \n \nYuuri Katsuki Fan Club (katsuki_fc) wrote\n@  2016  -  12  -  xx     08:39 am \nEntry tags: + grand prix 2016  +  watch party \n \n Grand Prix 2016 Watch Party DAY TWO  \nToday is the free program and they’ll be skating according to the short program rankings from lowest to highest score!\nSkate order is as follows:\nRules:\nand most importantly,\n---\n[Page 4 of 137]\n[&lt;&lt; 1 2 3 4 …135 136 137 &gt;&gt;]\n \n(Anonymous)\ni’m not a big fan of jj but i’m rooting for him today\n      (Anonymous)\n      Same. It kinda feels like last year with Yuuri, right?\n            (Anonymous)\n            not OP but I agree.\n      (kayc2)\n      he’s done so well in his qualifiers, it kinda feels bad to see him doing so poorly at the finals\n(Anonymous)\nAnyone else feel like Yuuri and Victor are a little distant from each other today? :(\n      (rathofgrapes)\n      pressure, maybe?\n(Anonymous)\nHopefully Yuuri does a personal best on his FS today!\n---\n[Page 20 of 137]\n[&lt;&lt; 1 2 3 …19 20 21 ... 135 136 137 &gt;&gt;]\n(demiguises)\nwhat i would give… to be able to hear what yuuri and victor talk about so closely…\n(pork-cutlet)\nthat hug awwwww\n(Anonymous)\nI ALMOST THOUGHT THEY WERE GONNA KISS PLEASE\n(Anonymous)\nYUURI-CHAN IS CRYING APPARENTLY AWWWWWW\n(katsudone)\nhave I ever said enough that this is probably my favorite program of his\nthe music, the costume, the beauty of it all\nSRSLY THE BEST\n(Anonymous)\nYUURI-CHAN, GANBA!!\n---\n[Page 26 of 137]\n[&lt;&lt; 1 2 3 …25 26 27 ... 135 136 137 &gt;&gt;]\n \n(Anonymous)\nhe’s nailing all his jumps today ;-; omggg\n(jellyfish_songs)\naaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa\ni love it when his ballet history shows through i love it so muchhh\n(Anonymous)\nIt’s not even over yet but this may be his best performance of his FS yet, at least PCS wise\n(Anonymous)\nYuuri-chan, hold on!\n(iceicecrazy)\nIs he changing some of his planned jumps?\n      (Anonymous)\n      I think he’s trying to rack up as many points as he can to make up for his SP score??\n(Anonymous)\nI actually feel like crying\nseeing Yuuri skate like this is giving me all the emotions\n---\n[Page 33 of 137]\n[&lt;&lt; 1 2 3 …32 33 34 ... 135 136 137 &gt;&gt;]\n \n(Anonymous)\nHE NAILED IT\n(Anonymous)HE DID IT HE DID THE QUAD FLIP PERFECTLY\n(toe-looper)\nI AM LEGIT CRYING YUURI\nYUURI BABY…\n(Anonymous)\nIM CRYING VICTOR IS CRYING WE”RE ALL CRYING\n(zenseis)\nim so proud omg yuurii ;;;;;;\n(Anonymous)\nthis is legitimately the best performance of his career omfg\n(porkcutlet)\nMY GIRLFRIEND IS ASKING ME IF IM OKAY NO I AM NOT OKAY\nYUURI JUST SKATED THE BEST FUCKING FREE SKATE EVER\nI AM EMOTIONAL\n \n \nthe dank knight rises  @lohengrins\nYUURI KATSUKI’S FS SCORE IS 221.58\nthe dank knight rises  @lohengrins\nHE FUCKING BEAT VICTOR’S WORLD RECORD OH MY GODDDD\nthe dank knight rises  @lohengrins\nI AM SO SHOOK\nhot wheels on ice  @superquad\n@lohengrins I CANNOT EVEN.. IM CRYIN I RLY AM\nHORA HORA  @excitedstuff\nHE JUMPED UP ALL THE WAY TO FIRST PLACE AAAAAAAAAAAAAAAAAA #YuuriKatsuki\n \n \n\nborntobehistory reblogged davaidavai\n\n \n\nnikifaverov\n\n\nGrand Prix 2016 Finals\n\nCongratulations to the winners of the Grand Prix 2016!\nFirst place: Yuri Plisetsky (319.53, set new world record for Men’s Singles Short Program)\nSecond place: Yuuri Katsuki (319.41, set new world record for Men’s Singles Free Skate Program)\nThird place: Jean-Jacques Leroy (300.62)\nThe 0.12 difference is unbelievable. SO SO CLOSE. Both Yu(u)ri’s broke Victor’s world records and rumor has it that Victor is making a comeback soon. (I find it a little funny, because Victor choreographed both the programs that beat him lol) And JJ also made an incredible recovery and managed to get bronze.\nThis has been a wild ride. And the season isn’t even over yet! There’s still the respective country’s Nationals, Four Continents, European Championships, and then World’s! Hopefully we continue to see these wonderful people for the next few more months.\n---\n\ndavaidavai\n\nim\nim so torn\non one hand i kinda think yuuri should’ve won gold but on the other hand im proud of my smol angry son\nSO IM JUST GONNA\nWAIT FOR THE REMATCH\n \nSource: nikifaverov  #ah yes the problems of being a yuuri-yuri fan\n12,983 notes\n \n \nYuuri Katsuki  @yuuri-ktsk\nThank you everyone for your support! Next time, I’ll win gold!\nゆか★ @yuka-tann\n@yuuri-ktsk おめでとう！\ncala  @combi-spin\n@yuuri-ktsk  Congratulations! You deserve it!\nVictor Nikiforov  @vnikiforov\n@yuuri-ktsk In the meantime, you have something else for me to kiss in place of a gold medal, right?\nYuuri Katsuki  @yuuri-ktsk\n@vnikiforov VICTOR, NOT ON TWITTER\nPhichit on Ice  @phichit_chu\n@yuuri-ktsk @vnikiforov ( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)( ͡° ͜ʖ ͡°)\n \n \n[ video ]\n\nYuuri Katsuki Exhibition Skate - Stay by Me feat. Victor Nikiforov  [GPF2016]\n\n1,281,922 views \n\nHaruka Yumi\n\nI AM LIVING\n\nJenny Cooper\n\nTHIS IS ALL I EVER WANTED\n\nCherrypie\n\ni can die in peace now kthxbai\n\nwhereismyfork\n\nim\nok\nimdead\n\nRotate Gummy\n\nthank u god for this gift u have given us named victuuri\n \n \nYuuri Katsuki Fan Club (katsuki_fc) wrote\n@  2016  -  12  -  xx     011:52 am \nEntry tags: + thank you  +  mod post \n \n\n MOD POST: THANK YOU EVERYONE \n\nCan I just. Get a little sentimental here.\nBecause this time last year we were a little less than 100 members, and only 20 pages in comments for the entire weekend. In comparison to the other grand prix finalists last year, the collective Yuuri Katsuki non-Japanese fandom was a respectable size, but not comparable to the other skaters.\nAnd look where we are now.\n3,501 members (a lot of you still lurkin’ anons, but I see youuu) and that’s just in this site, which let’s be real, is a dying platform. The /r/katsyuudon subreddit 11,081 subscribers as I type this, and it’s growing each day. Our Tumblr counterpart yuurikatsuki-fc has 41,928 followers. And let’s not forget our fellow fans in Japan - their top Yuuri fansite/forum boasts a fantastic 398,923 followers.\nWe’ve grown as a fandom together with Yuuri this past year, and it gives me FEELS to see how far we’ve gone. I’ve been an unapologetic Yuuri fan since the beginning, and every time I watch and support him through his low and high points with everyone, I feel like will never be anything else otherwise.\nI am so so proud of everyone, and especially of Yuuri. He suffered harsh criticism and people telling him to retire early on this year, but he turned it all around to better himself and started being more open about his struggles with anxiety, showing us a whole new side of him. This season has been a new starting point for both the fandom and Yuuri (and Victor, let’s not forget the man who encouraged the possibility), and I’m crying. Legit tears.\nWhatever happens for the rest of the season, remember how far our favorite skater has gotten, and let’s keep cheering Yuuri-chan on.\nThank you, Yuuri, and keep doing your best!\nEDIT: Sort of related, but a  “Thank You, Yuuri” Project  is being started by the tumblr fc, prompted by  this really moving open letter from a young amateur skater. Please check it out and consider participating. Our boy needs constant reminders that he’s very much appreciated and admired as a skater and a person.\n---\n[Page 1 of 29]\n[&lt;&lt; 1 2 3 4 5 … 29 &gt;&gt;]\n \n(Anonymous)\nMOD-SAN ;A;\nMOD-SAN WE LOVE YOU\n(Anonymous)\noh god now i have ALL THE FEELS ;-;\n(katsudone)\nThank you for everything, mod-san &lt;3\n(demiguises)\nmod-san, you’ll always be #1 yuuri fan in our hearts ((u can fite me, minami kenjirou))\n(Anonymous)\nI’m so glad for all of you. You’ve made 2016 a better year than it could have been for me. Thank you all so much.\n \n \n\nv-nikiforov\n\n \n[ image ]\n109,461 likes\n v-nikiforov  We’ll see you all next time! &lt;3 #Victuuri"
}