{
    "id": "883088",
    "url": "https://archiveofourown.org/works/883088?view_full_work=true",
    "author": [
        "WerewolvesAreReal"
    ],
    "title": "Ni'Var",
    "rating": "General Audiences",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings",
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Star Trek: The Original Series",
        "His Dark Materials - Philip Pullman"
    ],
    "relationships": [
        "James T. Kirk/Spock"
    ],
    "characters": [
        "James T. Kirk",
        "Spock",
        "Leonard McCoy",
        "Gary Mitchell",
        "Talessa (daemon)",
        "Septon (daemon)",
        "Christopher Pike",
        "Sybok",
        "Winona Kirk",
        "George Kirk",
        "Amanda Grayson",
        "Sarek",
        "Kevin Riley"
    ],
    "additional_tags": [
        "Angst",
        "Happy Ending",
        "Spock sort of has a religious crisis",
        "Tarsus",
        "humans have daemons",
        "Vulcans have Katras"
    ],
    "language": "English",
    "series": "",
    "published": "2013-07-14",
    "completed": null,
    "words": "11,318",
    "chapters": "1/1",
    "comments": "293",
    "kudos": "11,141",
    "bookmarks": "2,628",
    "hits": "83,261",
    "summary": "<p>Humans have daemons. Vulcans have katras. Spock, born of both, has neither. Which he's fine with. Really. Meanwhile, James Kirk is a little curious about this whole daemon business, because how the hell can he have two souls - ?</p>",
    "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
    "text": "\nNi'Var\n\n \n Summary: Vulcans have   katras.   Humans have daemons. And Spock, born of both, has neither. Which he's fine with. Really. Meanwhile, James Kirk is a little curious about this whole daemon business, because how the hell can he have two souls - ? (Slash).\n\n For those unfamiliar with the His Dark Materials Trilogy, daemons are essentially external souls in the shape of an animal. Children daemons can shapeshift, but Settle sometime around puberty into a final form. If a human dies, so does the daemon, and vice-versa. Other races/universes may have different 'forms' which their souls take, so daemons are not necessarily found in all races in the same form.\n\n\n 'Severing' refers to cutting the bond between human and daemon, which sometimes leaves them alive but reduces the two to virtual zombies.\n\n\n Daemons are typically the opposite gender, but not always; having a daemon of the same sex is implied to be loosely connected to homosexuality.\n\n\n Daemons can talk, and their actions typically represent what their person is feeling.\n\n\n It is extraordinarily rude to touch another person's daemon. It typically only occurs between couples, and even then in rare and special relationships.\n\n\n ______________________________\n\n \n \n \n\n \n \n \n\n \n \n \n\n \n \n \n\n \n \n \n\n\nDisclaimer; I do not own Star Trek, nor any of the characters, ideas, technologies, or other materials within.\n\n______________________________\nFirst contact is always frightening.\nNo matter how kind or open the species, a race's first encounter with alien life always carries a subtle fear of 'what if'. That fear typically fades into excitement eventually (unless the contacting race is, say, the Klingons, in which case there's just more fear) but initial judgments can still taint relations forever.\nWhen the Vulcans first made contact with earth, people were surprised at how normal they appeared – how similar to humans. Oh, they might bleed green and have pointy ears and funny eyebrows, but overall they looked as though they could have been a race of mildly disfigured people. In that regard, they were actually quite nonthreatening.\nBut their lack of daemons was terrifying.\n Soulless monsters, people whispered. Abominations. And then the humans learned that they were the only race to have animal-like companions from birth, and that fact became fuel for the ugliest supremacist groups of the era. Others races had no daemons, after all, so didn't that set humans apart? Didn't it prove, irrevocably,that they were the only race with souls?\nNot really.\nVulcans, it was explained, had katras. They 'keep their daemons on the inside', as humans put it, and this fact was greeted with suspicion but eventual acceptance. After all, the Vulcans didn't act like they were Severed, cold as they were; they had to have a daemon somewhere.\nOther races have their 'daemons' in different forms. When Andorians are born, shards of something firm and strong and ice-like spring around their necks, and it grows with every child until taking a final, unique configuration at adulthood. Tellarites make theirs, strangely delicate chains pounded into shape to fit around their arms like bracelets. Caitian kits pounce upon their shiny, glittering stones within a week of birth, which unnerves some other races, because what if they don't find the stone? But that just makes the Caitians laughs, because that, after all, would just be impossible.\nSo one day, far after earth's first contact, there is a sort of anxious tension as a mixed family wonders what form their son's soul will take. He will be born on Vulcan, the son of both that reserved race and the lively Terrans with the most animated soul-form in the galaxy. Amanda Grayson's owl daemon Peonessin excitedly picks out names, even as Amanda herself denies caring if her son will take after his human blood, because, of course, she will love him either way.\n“It is illogical to lie,” Sarek chides his wife. Amanda ignores him for a week.\nWhen Spock is born, he looks like a perfectly healthy baby, by either Vulcan or human standards (though the latter might fuss over his greenish pallor a bit). Except for one thing: he has no daemon.\nAmanda hides her disappoint well; Peonessin sulks. And Sarek, unmoved, steps back to allow the curious mind-healers to check that Spock's katra is normal, though without a daemon it seems obvious, right until a healer says,\n“There is nothing, ambassador.”\nSarek goes very, very still.\n“What?” Amanda asks, wide-eyed. “What – you can't mean - “\n“He has no katra.”\nThere is a panic, briefly; Peonessin tears up the room, because there must be a daemon somewhere, but he can't find it. The mind-healers check again and again, but there can be no mistake; Spock, by all accounts, has no soul.\n____________________________\nWinona Kirk, like every human, is intimately familiar with her daemon; it would be hard not to be. She knows every stripe on Nordan's tabby-cat fur, every fleck of brown in his amber-dark eyes. So its understandable that she is rather alarmed to find something attached to her daemon.\n“What on earth is that?” She exclaims, bending down and reaching for Nordan. The next second she jumps back, shocked, as Nordan hisses and scrambles away.\nWinona is dumbfounded. On the other side of their quiet living room, George Kirk pauses to blink at her over a data padd. “Win? Something wrong?”\n“I - He hissed - What is that?”\nGeorge frowns, blinking tiredly; he is on shore leave as of that very day, and more in the mood for sleep than worrying about an irritable daemon, but he stands up anyway. “Kaelon, talk to him, will you?”\nHis mastiff daemon pads over to the cat, who arches his back. “You can't have it,” Nordan hisses preemptively. “It's not for you.”\nKaelon blinks, hurt. “What?” She asks.\nNordan twists cautiously, and shows them.\n“It... looks like a cocoon,” George says, slowly.\n“Not yours,” Nordan mutters darkly.\n“Dear, why do you have it?” Winona asks.\nHis tail flicks, an agitated motion. “It will be needed,” is all he says. “Not now. I don't know. But its not yours, or mine, and you can't have it, okay?”\n“Of course, sweetie,” Winona agrees, agrees because she has to. Something is twisting inside her, dark and writhing at the thought of hurting that little green mass stuck to Nordan's fur, and she suddenly knows exactly what her daemon means. “No one will hurt it.”\n“Win?” George asks, warily.\nShe sits down, slowly. “Don't worry, George.” She stares at Nordan for a long while. “This is not bad. I don't know what's going on, but it's very, very much not bad.”\n_______________________________\nSpock grows up a perfectly normal Vulcan... except, of course, for the fact that he is lacking a katra.\nIt isn't something that can be sensed outside melds. Only his parents know, and the intrigued specialists they visit again and again. “Fascinating,” they say. “Revolutionary.” Papers are written, theories fly about, but no answers. And Spock is, by all accounts, healthy, so eventually the visits stop altogether.\nSpock sort of envies his mother, though that is unVulcan and very unacceptable. But he can't help it. He's read about human daemons, wondering how he can lack both that and a katra, and secretly he has always preferred the idea of the daemons. An unconditional love from another part of yourself, a lifetime companion who never leaves. The mere thought makes something in his chest ache, empty and hollow and grieving, and sometimes he irrationally hates his father just for being Vulcan.\nBut he tries to be a good Vulcan, despite all that, because he can never be human but he can pretend at having a katra, at least. And pretend he does, and if his peers are barely civil at best and typically condescending and disdainful and cruel... well.\nHe's working on that.\n_______________________________\n“It's a boy!”\nThe nurse's exclamation is drowned out by George Kirk's shout of triumph. Winona, tired and a little irritated, smacks his arm hard. “Never again,” she hisses.\n“What should we name him?”\nIgnored by the two adults, a very similar conversation is taking place just feet away.\nA squalling tabby kitten appears from nowhere at all, dropped and formed in a cloud of gold dust that dissipates in a fraction of a second. It mewls, a loud, pained cry, then shifts abruptly to a mastiff puppy. It's whining in confusion. It morphs again - switch, switch, switch - squirming the whole while.\n“You're not allowed to name things,” Kaelon says firmly. “You and Winona are both horrible with names. No.”\n“I think Felekanebuchadnezzar is a great name!”\n“Do you want the baby to be able to pronounce it? Ever?”\nNordan grumbles.\nKaelon stares down at the kitten. It's calming now, blinking slowly to show dark amber eyes. The tiny daemon mreows pitifully, waving a pink paw and gazing up at them imploringly.\n“I think,” she decides slowly, “we should name her Talessa.”\nThe kitten blinks once. And Nordan melts.\n“...Okay.”\nA nurse with plastic gloves carefully picks up the kitten minutes later, and it wiggles in her grasp. She sets it down, gently, on James Kirk's stomach, and it quiets immediately.\nThe baby is being wheeled out in a see-through cribbing. George and Winona are whispering quietly, stars in their eyes, and the two daemons pad over with satisfaction and delight. All is well.\nNo one, however, notices the broken green strands on Nordan's fur. The tiny silver butterfly that fell from it quietly alights on a kitten's paw, settles down, and sleeps.\n______________________________\n \nTime passes. When he is seven, and the kas-wan is passed, Spock gains some new recognition from his peers. “Maybe he is not so human,” they murmur. And if some quietly point out that his lack of a daemon proves that he is more Vulcan, well, he will hardly be the one to correct them.\nThen – T'Pring.\nShe is small and slight but beautiful, a true Vulcan princess, the heiress of one of the noble clans and everything a proper Vulcan mate should be. He is tense with excitement the day they gather on the sand-swept ceremonial grounds, T'Pau standing gravely between them, but forces back the emotion and tells himself that it is quite logical to speculate as to the character of his mate, so as to plan for the future, and that is all he is feeling.\nTheir minds have been confirmed as compatible by healers, so the linking should be swift. Spock feels T'Pau's mind as a gentle torrent, grasping him with efficient delicacy and pulling his mind out, stretching it to grasp T'Pring's sweet-prickly katra - \nSomething snaps.\nWhen Spock comes to awareness he is flat on his back, gasping for breath through sand-gritty eyes, dazed and pained and numb. He rises slowly to his feet, stumbling, and finds T'Pring glowering at him.\n“Bath'paik, vrekasht!” She spits. “Klee-fah!”\nShe stalks off the grounds, seven years old, with all the dignity of a Vulcan queen.\nT'Pau looks at him, appraising him a long moment, and then she, too, averts her eyes.\nSpock has never been so alone.\n_____________________________\nIt takes the Kirk's almost a week to notice James' second daemon.\nWhile the human newborn can't move much, his kitten or puppy-shaped daemon flits about him excitedly, never straying more than a meter or two away. With all the movement, Winona only notices something odd when she stands watching James nap one morning, his daemon curled up against his side, except...\nShe blinks, leans forward. The creature is a mass of orange-striped fur, but – does it have heads on both sides?\n “George!” She shrieks.\nThe baby wakes, crying and wailing, and her husband practically flies through the door. Winona is stuck, staring in horror at the two identical kittens, staring up at her and wailing pitifully.\nThen they change to twin puppies, and then a pair of silver butterflies, and she understands.\n\n“Oh.”\n\nWinona is suddenly sure that the second daemon (whichever it is) is perfectly harmless.\nNot that it stops George from panicking.\n“Win, I think I'm seeing double.”\n“No, dear, there's just two of them.”\n“Oh.” A pause. “Why does my son have two daemons?!”\nThey set up a meeting with a daemon researcher (discreetly, because lord knows old Ms. Taft down the street would call the global news station in a heartbeat if she got wind of this) and the man insists on meeting at their house – the 'natural environment', as he says.\n“You say only one was born with him?” Asks Thomas Fleming, Ph.D, peering at the now squirrel-and-kitten pair thoughtfully.\n“Yes, Talessa.”\n“Hmm. And is Talessa a girl?”\n“Of course she is!” George replies, surprised. “I mean, a boy's daemon is always a girl.”\n“Not always. And one of these is male.”\n“So that must not be his!”\n“Well, it's really impossible to say. Same-sex daemons are rare, but they are found. Did you check at the hospital?”\n“Who would think to do that?” Winona snaps. She's uneasy with this clinical man prodding at her son's daemon – daemons – even if he is wearing gloves. The puppy snaps at him lazily.\n“Exactly, exactly. No way of knowing.” A sigh. “But, they both seem to respond to his emotional state fairly well. And they don't stray?”\n“Of course not.”\n“Well, then your son simply has two daemons.” The man shrugs. “Not something I've ever heard of, but it doesn't appear harmful.”\n“It's not natural,” George Kirk insists.\n“Doctor,” Winona prompts, “Before James was born, for a few years my Nordan had this cocoon stuck to his fur. It went away right after the birth, and they both love turning into butterflies.”\nFleming shows his first sign of interest. “Really? Now, that... that reminds me of something, some old story... I'll have to get back to you... Was it a Chinese tale...?”\nIt is a Chinese tale. It's a story about a peasant boy and a princess, to be precise. The princess is born as her father's only child, his only heir, and yet she is born, appallingly, without a daemon. She is shunned by the community, spurned as a hellsent monster and exiled from her people. She lives secluded in a dark forest, harmless and lonely, but nearby villages whisper of an evil, soulless witch who seeks only to steal the daemons of others, to devour them and sate a longing for what she once possessed.\nBut stories, even bad ones, mutate with distance, and so a young peasant leagues away instead hears the more accurate story of a beautiful girl bewitched to a life of loneliness, bereft of a soul, born daemonless. And this peasant boy is mesmerized for a different reason; he has two daemons.\nHe steals from his village that very night, trekking across the country in search of the beautiful girl. When he arrives at the village outside her forest he is warned away fiercely, for the villagers are sure that his extra daemon will make him irresistible to the bitter witch – but he goes anyway.\nNo one knows what happens in the forest, but the boy and girl walk out hand-in-hand the next day with two newly settled daemons – a lion and a red-crowned crane, both sacred to the Chinese, and they mix with their two humans so often that no one is sure which daemon belongs to whom.\nThe princess returns to her lonely father, and the nation rejoices in their new-found dynasty, surely blessed by the gods. And the crane and lion watch over the land for half a century before dying, happily, together..\nIt's a nice story. A romance. A fairytale. But, of course, quite impossible. After all, no one could survive as long as the princess did without a daemon.\n______________________________\nWhat tentative acceptance Vulcan had possessed for Spock is gone.\nThey say he is an evil abomination, a shaka come to haunt them and steal their katras away, eating them to replace his own lack. His classmates, always distant, cringe away and stare at him as something that is no longer a failed experiment, but a crime against nature. He has no soul, is doomed to die a true death, but more than that he is unnatural. Life without a katra, true life, is scientifically proven to be impossible – and yet, paradoxically, he exists.\nSpock spends much of his time reading earth-novels in his younger years. They are full, of course, of daemon-characters and references; how could they be otherwise? The books hint at a closeness, a partnership, at unconditional companionship and something the humans call love.\nAlone on a planet of fourteen billion, something tiny and repressed aches for that companionship. He reads anecdotes of severed humans who grieve for lost daemons, fading slowly into an agonizing death, an end that is considered a merciful blessing. A relief. Freedom.\nThere is much Spock does not understand about humans, but he can understand that.\n_______________________________\nIt takes Jim a long time to realize that he is unique.\nHe has two daemons from birth, after all. But everyone else in the family, his mother and father and Sam, only have one each. This confuses him, because who wouldn't want two daemons?\nWhen he asks his mother why he has both Talessa and the male daemon now named Septon, she puts aside her work and takes them – Jim and his two curious daemons – into his bedroom, sitting down on his star-covered quilt and gesturing for Jim to take a seat beside her.\n“No one else I've ever met has two daemons, Jimmy. But some people” she neglects to mention that 'some people' refers only to one eccentric scientist-theologist “think that it means one of your daemons is for, well, your soul-mate. Some poor girl missing her daemon. And one day you'll meet her.”\nJim is horrified. “She won't take them, will she?” He cries, unable to imagine anything worse.\n“No!” Winona hastens to assure. “In the story, it's like – you'll be so close, you'll both share your daemons together, and – and you'll have a connection to that person, Jim, true love - “\n“But girl are weird.”\n“Is Talessa weird? Your connection to this person – I bet it's similar to the one you have with Talessa and Septon, if you're as close as the stories say - “\nJim brightens. Like all children, he has a little greed in him. “Like having three daemons.”\n“Better,” Winona compromises, and decides not to explain that, no, it's not the same thing at all.\nEvery night thereafter, Winona recites the story of the princess and the peasant boy to get Jim used to the idea, and Jim, fledgling romantic that he is, latches on to the story eagerly.\nHis daemons are a little more doubtful.\n“I'm not leaving you, ever, even if you will be around this other human a lot,” Talessa declares stoutly, and snuggles closer to Jim as a clinging sloth.\nSepton, today a robin, ruffles his feathers in a dignified manner. “Logically, if one of us is indeed bound to this other human we would be very pleased to go with him after the meeting.”\nSepton seemed to go with all of Jim's moods when they were young, but now he fluctuates between cool, reserved rationality and occasional random outbursts of temper (or, more distressingly, distress and sorrow). Sam says that Septon is something called 'bipolar', and that it means Jim is a little crazy deep down, but Jim finds it endearing.\nTalessa glowers at the bird. “Do you want to leave?”\nMore feathers rustle. “I am merely making a point,” Septon says. He hops forward, landing on Jim's arm and tightening his grip until Jim winces. He adds, with quiet, restrained relief, “But, we do not need to be concerned with that for a long while.”\n_______________________________\nSybok doesn't taunt Spock.\nSybok seems to sympathize, but he never treats Spock like something sub-Vulcan for lacking a katra. Even so, it doesn't diminish Spock's secret envy. He tries to reject the emotion for a time, but Sybok will not judge him for a lack of control, and in any case the point is moot; their arms brush one day whilst Sybok lectures Spock on physics, and the full-Vulcan goes very still.\nSpock's mind had been drifting, as it was wont, onto the subject of daemons and katras. He lowers his head in shame when he notices his half-brother's stare. “I apologize, Sybok, it is poor of me to hold envy - “\n“Do you want to know what it's like?” Sybok blurts.\nSpock blinks, startled and unsure what his brother means. Then Sybok lifts a hand to Spock's face. “May I?”\nSlowly, Spock nods.\nSybok draws him in. It is not the first time they've melded; it will not be the last. But this is different, both wonderful and terrifying, because Sybok is dragging him past thoughts and emotions and behind memory and behind the physical realms, dragging him to some secret inner place that pulses and pounds with life and energy and everything that makes up Sybok.\nIt's writhing and twisting and sparking, dark and light and glittering rays of refracted gold dust, twined in pulsing cords with hazy edges that drift into unimaginable oblivion. It feels of Sybok, is Sybok, and suddenly Spock knows precisely what he is missing when teachers say to center yourself, find yourself, because how could Spock know himself without this?\nIt is not a perfect vision. There are dents and wounds and rents in the katra, and some go so deep  that another Vulcan, knowing better, would recoil from this already damaged man. But Spock is not normal, because he has no katra, and the sight is beautiful.\nHe feels grateful and honored and awed. He is also resentful. He finds suddenly that the envy has not faded – and now, more than ever, he hates Sybok with an unprecedented passion, loathes him for showing this tempting, forbidden thing, and he withdraws from the meld ruthlessly.\nSybok winces at the abruptness of the separation. For his part Spock turns away, closing his eyes and breathing deeply. The simple exercise doesn't hide the shaking of his body, the silent jerking of his shoulders, and he clenches his fists tight enough that his nails draw blood.\nHe is Vulcan. He may not have a katra, but he will have control.\nHe is Vulcan.\nHe is.\n“I'm sorry, Spock!” Sybok cries, and ignores every tenet of Vulcan culture to embrace him from behind. “I'm sorry, I'm sorry - “\n(Somewhere on earth a confused James Kirk consoles his suddenly sobbing daemon, the other fluttering around nervously. Spock suddenly feels much better, and he is very glad to have Sybok.)\n______________________________\nThe other kids at school stare at Jim a lot. It's not too bad, because everyone knows it's exceptionally rude to directly inquire about others' daemons. But daemons themselves talk together all the time.\n“You can't both be his daemon,” A nosy woodpecker insists, twitching his head at Talessa and Septon.\n“We are,” Talessa snaps. She's a grass snake today and hisses each word like a curse. Jim is tense at his deck, likewise agitated, sneaking narrow eyed, suspicious glances at the other 6-year-old  sitting by him that keeps 'accidentally' kicking his chair. “You're just jealous that you're alone.”\nThe woodpecker bristles. “I am not! I have Tessa!”\n“You only have Tessa,” Septon corrects snidely. He's a tiny gecko, clinging to Talessa's scales. “There's three of us. I have a human and a daemon companion, and so does Talessa.” He raises his head, waving it in an arrogant motion. “Jealousy is a natural response.”\nThe woodpecker flaps its wings, agitated. At the desks his human kicks Jim's desk loud enough that a loud THUNK booms out; Jim turns around to glare, and the girl gives him a dirty look.\n“You're not even natural!” the bird squawks. “A male daemon for a boy! You're a fake is what you are, I bet you could die and he wouldn't even care - “\nAnd Septon, unpredictable as always, suddenly morphs into a kitten, and he's crying – not with tears, but with terrible, heart-wrenching yowls and whines, high pitched and desperate.\nIt's a little bizarre, because Jim looks irritated but not really upset, so the woodpecker just stares. But Talessa is furious.\nShe changes into another cat, lunging at the snotty bird with outstretched claws. Both boy and girl cry out at their desks as the two daemons go down in a swirl of feathers and fur, both shifting through shapes as quickly as possible.\nThe teacher finally sees what's going on and separates the two. Afterward Jim takes her rebuke humbly enough, stroking poor Septon kindly, but he's trying not to grin.\nEven through the pain of an injured daemon, one couldn't help but notice that Talessa's shifting had been much more creative than the woodpecker's.\n______________________________\nSpock has always been rather fascinated with Peonessin.\nHis father disapproves of any tactile contact for his son, so Spock was essentially banned from physical contact with his mother after the age of three. But touching animals is something entirely different, and Sarek has never even bothered to stop Spock from touching his mother's daemon.\nIt's incredibly rare to do so, of course, but something about the owl is just fascinating. \nPeonessin is a small tawny owl, striped with brown and gray. Spock has researched the species. They are known for being typically silent, but can be swiftly efficient predators when aroused. They will willingly die in defense of a nest and sometimes even attack humans. Spock wonders if Sarek is aware of this fact, and whether or not it contributes to his silence on the matter.\nAmanda practically beams every time he strokes Peonessin, and the feeling – the strange, indescribable warmth that shudders through him – is indeed very pleasant. Peonessin adores him as well, of course, happily alighting on a shoulder to murmur in his ear after a long day. It doesn't help any with Spock's issue of envy, but he can ignore that when it comes to his mother.\nBut one day, being a curious eight year old Vulcan, he decides to try and meld with Peonessin.\nSpock has melded with every member of his family. Amanda adores melds, and happily volunteered again and again when he sought to master the skill. And of course he has melded with animals; that occurs long before sapient-species melding. But what, he wonders, would melding with a sentient animal be like? Peonessin is curious, too, when Spock presents the idea. They don't bother asking Amanda.\nIt turns out to be a poor choice.\nPeonessin's mind is even brighter than the katra of Sybok, and shockingly intelligent. Every fabric, every scrap of his being is interwoven with Amanda. A thick band stretches between them, a tie that makes Vulcan marriage bonds weak and frivolous. He and Amanda are separate and one; they gain their strength from another, their will, and Peonessin plays off her emotions and is her emotion, and it's all so delicious and complex and bright that Spock burrows in deeper, deeper, deeper -\nHe's pulled from Peonessin's mind with painful force, and looks up, dazedly, into his father's face. For once the full-Vulcan's dark eyes simmer with barely-controlled rage, and the hand gripping Spock's arm feels ready to snap him in half.\nIn the background there is screaming.\nAmanda is rushed to a hospital, but she recovers, curling around her shell-shocked daemon the whole while as her mind slowly returns. Within the week she is back home, and she gives a weak, kind smile every time Spock apologizes. “I know, Spock. I understand you were just curious. You couldn't have known, so don't blame yourself. No, I'm not angry.”\nShe doesn't seem angry. She smiles at Spock and touches his hair when she walks by, and still grows righteously protective over him, and everything seems perfectly normal.\nBut Peonessin stops landing on Spock's shoulder. He stops speaking to Spock entirely, in fact. And, though Spock doesn't yet realize it, he'll never touch the owl daemon again.\n___________________________\nJim is twelve when he first kisses a girl.\nIt's a shy kiss, a childish kiss, a hasty impulse after a day running around the summer carnival. Sandy smells like strawberries and their quick, blushing peck leaves behind the taste of cotton candy. She giggles helplessly when they part, apparently shocked at her own audacity. Her pretty squirrel-daemon, already Settled, flicks his tails around Talessa teasingly.\nHe ignores Septon entirely.\nShe and Jim walk to her home through the quiet evening light, arms swinging blithely alongside swaying Iowan cornfields and placid ponds. When she's safely home Jim makes for his own house, beaming at his daemons.\n“She's great, isn't she?”\n“Her daemon has pretty fur,” Talessa admires. They haven't settled, and she's taken on a squirrel form herself in mimicry, smaller but with almost blackish fur. It shimmers in the dim light.\n“Like Sandy's hair!” Jim says brightly, smiling with child-happiness.\n“She is illogical,” says Septon flatly. “Her laughter is inane and irksome and typically unprovoked, and that squirrel has all the fake and unwarranted lasciviousness of a longtime catamite. She is prone to flits of whim and her presence is not conducive to your emotional stability. It would be logical to desist in your relationship.”\nLogical. Illogical. He uses those words often these days, and his emotional outbursts are rare. His gravity disturbs Jim's family, sometimes, but he doesn't understand why. Septon has plenty of emotions, he just doesn't show them.\nAlthough it is a little weird when he uses words Jim doesn't even know...\nNaturally, Jim takes Septon seriously. “Why?” Even so, he's somewhat put-out. Trying to parse through Septon's odd explanation, he turns to Talessa. “What was wrong with her?”\nTalessa sobers a little. “I don't think her daemon liked Septon very much.\nJim looks momentarily stricken. Then his face hardens. “Well, whatever,” he says. He waves at Septon. The daemon hesitates, then leaps into Jim's hands as a rabbit; Talessa scurries up to Jim's shoulder. “Sandy's stupid, anyway. She hates Starfleet, you know? Wants to stay in Iowa forever.” Jim's scoff gives his opinion of that. “We should ask out Laura. Her daemon's a fox.” Jim waggles his eyebrows. “Everyone wants to date someone with a fox daemon.”\nTalessa blinks at him. “Why?”\nJim tilts his head, frowning. “I'm... not sure...”\n______________________________\nSpock is fifteen when he starts to seriously consider his future.\nHis peers do not mock him openly anymore; it would be petty, and it would indicate harsh feelings, which the others think to be beneath them. But he is still shunned, openly and without care, because they all know that he is empty inside. He thinks the whole planet knows by now; Sarek's son, the half-breed with no katra.\nAnd then Sybok, for lack of a better word, goes mad.\nIt starts slow; religious ramblings. “I have these dreams,” he confesses to Spock. Sybok is odd, having never quite accepted the Surakian disciplines, and he doesn't even bother to hide his emotions around Spock. “Spock, there's a God, I'm sure of it. One god, and he's calling to me.”\n“You are certain?” asks Spock diplomatically. In the spirit of IDIC he would never denigrate the religion of another; he still sometimes prays to the Old Gods, himself, though many modern Vulcans dismiss them as myth.\n“I feel it,” Sybok confirms fervently. Spock rolls his shoulders uneasily at the casual use of that word, but says nothing. “He's calling me, and I have to serve him.”\nTo Spock's surprise, Sybok manages to seek out other 'believers'. They are all searching for this god, Sybok tells him, and the paradise-land in which he lives. Sybok calls it Sha'Ka'Ree. He says the humans call it Eden, the Romulans Vorta Tor, the Klingons Qui'Tu, but it is all the same. Spock accompanies Sybok to meetings sometimes, clandestine visits to a nearby Starbase that is just hours away by shuttle, where a clashing groups of Andorians and Humans and Caitians and other, less well-known races discuss their faith. Though he never pledges to their religion, the members seem to see Sybok as their leader and welcome Spock warmly – soul or no.\nThe meetings also seem to focus as much on Sha'Ka'Ree as on criticizing 'Herberts' – supposedly 'ignorant' heretics. But Spock decides not to point this out to his brother.\nThe encounter is, in many ways, a new experience. Sybok's belief is so strong, so fervent, and the allure of such a comforting faith is tempting. Spock begins, tentatively, to speak up at the meetings, asking question after question, and for the first time starts to doubt logic. Spock wonders if, should such a haven hypothetically be found, this God of Sybok's could explain his lack of katra.\nMaybe even give him one.\nAnd then, horror: Vulcans start to join the group, but it's quickly discovered by the appalled public that they are not doing so willingly. Sybok has used his prodigal psychic gifts to mutilate his followers' thoughts, bending them to his will. Sybok is considered too dangerous to arrest or keep on Vulcan; in a typical gesture, the planet banishes him and pretends the problem never happened.\nAll the members of Sybok's group, now branded a 'cult', are required to attend sessions with mind-healers to remove every trace of Sybok's telepathic touch from their psyche. Spock is suddenly glad that Sybok is family, that Sybok has melded with him since childhood and the healer is destroying Sybok's mark indiscriminately.\nIt prevents anyone from discovering that he has not melded with Sybok for over two years.\nHis sense of belonging is gone. It never existed, Spock realizes. It was a lie, a falsehood perpetrated by his psychotic brother. He fits nowhere – nowhere on Vulcan, in any case.\nHe wonders if Earth might be different...\n______________________________\nJim's first months on Tarsus IV are some of the happiest of his life. The time is laborious and challenging, because the colonists are eking out a rough, subsistence-based living on a raw world, but the sheer rural charm of the place endears it to him. No sprinkler systems or auto-pickers on these farms; in the same fashion that Jim loves bonafide paper books, the place just draws him in.\nTalessa and Septon love it too. They still haven't settled, which is weird for a boy of fourteen, but he doesn't mind. They pull equipment as tiny horse or oxen, or turn into brightly-colored chickadee birds and swoop in to steal seed from farmers who laugh as much as they curse them. Jim works during the day, and some evenings he slips over to the neighbor's house to speak to a woman there, a retired Starfleet veteran. It's Hoshi Sato, crooked and ancient but still capable of smiling. She was a member of the original NX-Enterprise, the first Warp-five vessel in the fleet, and that mission is still legendary. The old Asian woman greets him warmly at each visit, and she's taken to tutoring him in alien languages. She teaches him a little Xindi reptilian (possibly just to see him struggle and laugh, he starts to suspect suspiciously) as well as Orion, Deltan, and Andorian. Not much, of course; just some useful phrases, fun facts. She teaches him Vulcan, too – she always has a grin on her face when she talks about Vulcan – and to their shock Septon seems to pick it up flawlessly. Jim is a genius by any standard, but when Septon starts reciting Vulcan poetry she gets an odd look in her eye, and won't stop laughing to explain.\nHe likes that about her, too. Hoshi Sato never even asks about his two daemons, and her own parrot daemon is just as cheerful and interesting. Hoshi is amazing, Jim decides, and it's her lessons that decide his resolution. He's going to join the Enterprise crew when he's in Starfleet.\nNo; he's going to Captain her.\nThe kids are decent, too. The excitement of living on an alien world distracts them from paying more than a token attention to the boy with two daemons, and by the time that novelty starts to fade everyone is well adjusted to him and largely disinterested.\nJim's aunt and uncle are friends with the Riley family, and some evenings or nights he forgoes Hoshi's lessons to play games with the lonely but energetic nine-year-old boy and his overactive daemon, Persipp.\n(Kevin's daemon is okay with Septon, too. Jim always checks now.)\nJim eventually hears word of a food shortage – something about a fungus? - but the details are fuzzy, and he's not too concerned. His aunt starts locking the cabinets and smacks his hand when he tries to sneak a snack, and it's annoying to go through fields of rotted food looking for something salvageable, but his relatives are just upset that prices are hard. Which is bad, of course, but it's the 23rd century.\nIt's not like they're going to starve.\n______________________________\nSpock enters Starfleet against his father's wishes. The conversation is not pleasant.\n“You are committing yourself to a barbaric, outmoded organization dedicated to military efforts. Your heritage will not concern them. In Starfleet you will be oath-bound to follow the orders of illogical, emotional beings with self-interest at heart.”\n“It is unfair to call non-Vulcans illogical, Father. I am not entirely Vulcan.”\n“I can never forget,” is the cool rejoinder, and Spock manages not to flinch. “You realize that it is almost inevitable you will be forced to kill?”\n“Some sects of Surakian philosophy recognize that the right to self-preservation trumps harm incurred on others - “\n“If you join Starfleet,” Sarek interrupts, quite rudely, “You will be no son of mine. I would have that very clear. No argument will persuade me. If you leave, do not plan to return.”\nClear, direct, simple.\nSpock leaves.\nThe humans stare at his eyebrows, his ears, twitch when he fails to smile or laugh or frown or react as they expect. But there are other aliens on the San Francisco campus, if no Vulcans, so it is tolerable simply because they are not staring at his lack of a daemon, or lack of a katra.\nAs far as they know, he is perfectly normal.\n______________________________\n \n \n \n\n\"...Your lives mean slow death to the more valued members of the colony. Therefore, I have no alternative but to sentence you to death. Your execution is so ordered, signed Kodos, Governor of Tarsus IV.\" \nThe words ring in Jim's ears as he flees with Kevin. Talessa and Septon are a pair of panicked rabbits, bolting ahead of him as far as they can. Phaser fire screeches in the distance behind them.\nSeven others are running behind the pair, crying or gasping or holding a hand over their mouths to stifle their screams. They managed to escape the soldiers Kodos had unexpectedly sent to subdue four thousand – god, it was unimaginable – to kill four thousand members of the colony.\nJim's aunt and uncle are dead. Hoshi Sato is dead. His mind touches the thought, rejects it, slides away. Not now. Not yet.\nHe hears footsteps ahead, pounding steps. “Left! Left!” He hisses, and veers. He hears their quiet steps trailing his turn. He's not sure how he's become the defunct leader of the nine kids who somehow escaped, but he is, and he's a Starfleet officer – or he will be, anyway – so he's going to do this, he's going to help them, save them, even if he dies trying.\nThey don't stop until nightfall, when the double moons of Tarsus are high in the sky. It's a clear night, and Jim's mind, in some absurd sadism, flickers back to a cheery sugar-sweet kiss under the neon flash of carnival lights.\nHe feels like dropping to his knees and just screaming, but he can't. Kevin is clutching his arm and crying silently, in great kid-hiccups, clutching his mouse-shaped daemon to his heart like it's going to be torn from him. And not without reason.\nHe shudders, remembering the oily-dark flash of the soldier's touch on Septon and Talessa. No one should touch another person's daemon, not like those soldiers did; it's a crime tantamount to rape, to do so with malicious intent like that, and the soldiers hadn't even flinched to use the daemons against them. But then, most decent people don't go about committing genocide, either.\nThey might be lucky, though, in a way. The guards were using the daemons as hostages, if brief ones; maybe that's why only the kids survived. Talessa had twisted into a dog and bit down on her guard's snake-daemon, killing them both instantly, and Septon had followed suit, using the shape of a small lion to crunch a rooster between his slavering jaws.\nThey look harmless enough now, meek and rubbing against Jim, running forward now and again to nuzzle Kevin. He sighs.\nThen he realizes the kids are all watching him. He's the oldest; they want orders.\nThey're in a rocky, barren region a few miles out from the colony. It's uphill, and Jim can look down and watch the whole place from that rock. There's still the occasional flare of phaser fire against the dark of the night, flashing and vanishing. He looks away.\n“We'll rest here. But we need to watch for any guards. I'll stay up first. Who's oldest?”\nThere's a thirteen year old, Thomas Leighton, and two twelve-year-old twins. The others huddle together to sleep – god, one girl is five – as they decide watches.\n“Should we try to light a fire?” Thomas asks dubiously, glancing around them. There's a noticeable lack of trees on Tarsus.\nJim has read enough adventure books to know the answer to this. “No. That will give away our position. We need to keep still and quiet. We'll move before it's fully light out.”\nThey nod and disperse.\nWhile the others sleep Jim stares hard at the colony, watching for any shadow of movement. Cunning Septon has shifted to a tawny owl and hovers watchfully over the camp while Talessa shifts into a sleek panther, leaning against Jim to match his gaze into the distance. Her eyes glow gold in the starlight.\n“We'll save them, Jim,” she whispers. “All of them.”\n_____________________________\nSpock's time at Starfleet Academy is not excessively challenging intellectually. He is, admittedly, on a much accelerated course and has already tested out of many required classes. He is aloof from other cadets, but that is not unexpected, and though his Vulcan ears might overhear the occasional specist slur no one harasses him. He is largely content.\nBut there is something strange.\nAs a Vulcan, Spock has superior control of his body as well as the signals he allows his brain to effect. Sensations like fatigue and hunger, for example, are easily dismissed. In any case, Spock should not be hungry; Starfleet Medical monitors the nutritional intake of cadets, and do not account for his difference of race; Spock eats more than is typical for him, certainly well within requirements for a Vulcan of his metabolism\nSo he doesn't understand why he's starving all the time...\n_____________________________\nTalessa has taken the form of a gray wolf, emaciated and covered with patched, matted fur. She hulks by Jim's side, as big as she can make herself, eyes roving over the landscape with blatant hostility. Jim knows she would never hurt him, but he shivers every time he sees her.\nWolf daemons are wrong. Wolf daemons belong to sociopaths, murderers, the insane. Many wild creatures are found as daemons, but something about wolves are just toxic. Looking at Talessa in this form only fills him with more despair. If he does survive this hell forsaken planet, if they all survive, what will happen afterward? Will Talessa stay like this? Will he go mad?\nHe can sense that she hasn't Settled – surely he would know if she had? - but he doesn't say anything to her about the form, either. He's heard that daemon-forms that kids reject the idea of are parts they reject in themselves; often daemons can turn into exactly the opposite of what you want. Daemons don't Settle to make their human happy; they represent the human, simple as that, and god if the feral, starved hunger gleaming from Talessa's eyes isn't exactly perfect. Call it superstitious, but he isn't letting on to Talessa how much he hates the form.\nSometimes Septon is a wolf, too, even thinner and more feral, trotting a half-step behind his sibling and snarling at anything that nears her. But he still holds that queerly bipolar quality, and at safer times he'll twitch into the form of a mouse, a rabbit, a cat, curling up around Jim or nosing at Kevin's Persipp mournfully.\nMore disturbingly, though, Septon's bond is starting to stretch.\nJim isn't sure what to make of that. He's only heard of stretched bonds in old stories about witches, but witches aren't real, and Jim sure isn't one. But one day Septon morphs into a hawk, a dark creature with a wicked beak and far-seeing eyes, and flies up to scan the land around them. But he can't fly far enough, high enough, so he pulls on the bond until the stabbing pain of starvation that is Jim's constant shadow becomes consumed by the pain of separation, and he clutches Talessa's fur and grits his teeth and tries not to scream.\nIt's easier, now. Frightfully easy. Septon can go at least a dozen yards away before their bond starts to twinge. Maybe it's Talessa's presence that makes it easier, but it still disturbs Jim that Septon can bear to leave him.\nHe's never been normal, having two daemons, but now Jim's certain that something is just plain wrong with him.\n______________________________\nSpock collapses during his physics exam.\nIt causes something of a panic. Humans are very emotional when confronted with things they do not yet understand, and no one knows why a seemingly healthy Vulcan would drop unconscious. Personally, he is more concerned with the concussion he gained hitting his head on the desk's corner, but no one else seems to mind that.\n“Exhaustion,” the Starfleet doctors say. “Stress. A psychosomatic reaction.”\n“No,” Spock says. “No. No. I am a Vulcan.”\n“Malnutrition?” They suggest.\nHe pauses.\n“Have you been eating well?” Doctor Temple asks him. Her koala daemon peers at him earnestly.\n“Yes. But - “ he pauses.\n“What?”\n“I have been – exceptionally hungry, despite my mental controls and the fact that I have increased my dietary intake. It is quite painful, constantly, even when eating – I can not account for it.”\nThe doctors hum and ah over him, taking blood samples and asking invasive questions (most of which, predictably, are answered with some variant of no-I-am-Vulcan) and postulating theory after groundless theory, and they all mean nothing.\nThe hunger is constant, though he eats dutifully under their watchful eyes, and when they order him to eat until he feels full he dutifully obeys, until he is physically ill. “A hybrid quirk?” They ponder.\nSometimes, with the worst of the hunger pangs, he feels a sweeping sense of desolation, a dark gloom pulling his mind into a ravaging darkness, threatening to tip him over the edge of sanity.\nHe decides not to mention that.\nThe doctors are right. It's probably just stress.\n______________________________\nJim has been risking solo forays to the colony for a fortnight, just him and his daemon while Thomas watches the camp. But he is coming back empty-handed, and the supply rooms are crawling with Kodos' soldiers. And now he is ill.\nThomas wants to go, but Jim refuses. The thirteen year-old is tall and gawky and too, too clumsy. His daemon, like Kevin and his tiny white mouse, has Settled due to the trauma of the massacre. Unfortunately, his has Settled into a large gray tortoise, and Thomas might be able to hold him while running but Jim really doubts their effectiveness as a stealth unit.\nBut Jim is too weak to walk far, and from the black spots that swim into sight he might faint halfway through the theft. He's been giving his share of the food to the younger children, who don't look too bad, but now he wonders if that decision has killed them all.\nExcept. Well. There's one possibility.\n“Septon. You go.”\nSepton quivers and turns into a mouse, gazing at him pitifully over quivering whiskers. “You can't!” Talessa cries. “He's been Stretching the bond, but that's miles - “\n“He has to, Talessa.”\n“What if they get him?”\nJim is quiet. “What if no one goes?”\nTalessa whines, leans back like she's going to howl, and thinks better of it. She nudges Septon sadly instead. The mouse stares, and then abruptly shift into a small goshawk.\n“It is the only decision,” he concedes, in his reserved tenor. There is no trace of emotion in his voice, but Jim can see how those feathers tremble and twitch, and his heart clenches.\nBut all he says is, “Go.”\nAnd, God, it hurts, even worse than the hunger, the sickness, maybe even worse than watching the massacre. Septon goes to the ninety meters they've managed the last fortnight, then beyond. It starts as a twinge, an ache, and then like a rusty nail twisting through his marrow the pain stabs through his veins, his heart, radiating and growinggrowinggrowing -\nTalessa is laying on top of him, whining and licking his face, but her face is dark and distorted. The kids whisper in the background, a dim babble of sound, and he can't even bring himself to care about them.\n“Come back, come back, come back!” he cries.\nBut Septon doesn't. Maybe he can't hear, but even if he could, Jim later knows, he would recognize that Jim is speaking in delirium. There is no going back.\nIt's an eternity in hell. He's senseless in minutes, just crying and writhing and babbling, and there is nothing but pain.\nGod, why won't someone just kill him?\nThen, slowly, it recedes. A cloudy numbness replaces the ache, a feather-light euphoria, and he becomes aware that he's taking great, shuddering gasps, sweat-soaked. Someone has stuffed a gag in his mouth. Talessa is staring at him an inch from his face, and when he turns his head he sees the younger kids staring at him a dozen paces away, wide-eyed and pale.\nSepton returns in seconds – and he's dragging a full bag of food.\nThe children cheer raggedly. The bag drops carelessly amidst them, and then Septon plows into Jim and Talessa, curling against them in the biggest mastiff-form he can manage.\nJim slowly drifts asleep.\n___________________________\nIt's nighttime when Spock is wracked with the pain. He has no roommate – necessary because of the climate-controlled desert heat of his quarters – but he quickly clamps his teeth shut over his pillowcase, and has time to be grateful for this idea right before he starts screaming.\nWhen he fades back into dim awareness every bone in his body is lax with fatigue. Over half an hour has passed, but Spock's guess would have been in days.\nHe sits for a long while just staring at his ceiling, then turns to gaze at the stars glimmering through the coastal air outside the window. He gives a shuddering breath, then rolls over resolutely.\nNo one needs to know about this.\n____________________________\nWhen the Starfleet officers come, Jim wants to hate them.\nThey just look so appalled, is the thing. They're shell-shocked just as the sight of the kids. Try living it, Jim screams in his head. There's children here, brave children who kept quiet and still and kept their heads and escaped and they've seenmoredonemore than you ever will so stop staring stop staring just fucking stop and feed us already you damn godforsaken sons of a -\n“We've come to rescue you,” a red-shirted officer ventures tentatively.\nJim can't help it.\nHe starts to laugh.\nThe two officers stare at him in astonishment. His kids are gathered behind him with all their daemons. Talessa and Septon stare down the officers. Nine skeletal kids and two beefy adults, and they're saved, this guy says, and it's just the funniest thing Jim's ever heard.\nThe other kids don't move behind him, don't react, because they know. They get what he's thinking, because they're right here, they've lived, and it's all over.\nAnd Kevin starts crying, first slowly, then with great, hysterical sobs, clinging to his prematurely Settled mouse-daemon with tight hands. Glaring daggers at the bewildered Starfleet officer, Talessa shifts from her aggressive wolf form, Septon stepping up to guard her, and snuffles over to Kevin.\nAnd Jim gasps.\nBecause this is it, this is it, her real form, his Talessa, and he stares at her in dumbfounded amazement as she licks at Kevin and he clings to her gold-striped fur with frantic hands. She's a huge honey-badger, with a dark, soft gaze, and he starts to smile through the tears pricking at his eyes.\nHe falls to his knees and tells Septon to stand down.\nEverything is going to be just fine.\n_____________________________\nThe hunger, and the crushing desolation that is its companion, eventually ceases. Spock graduates among the top of his class, scoring high enough that he is immediately promoted to Lieutenant, a rare honor. He is immediately assigned a premier posting, too – the flagship, the USS Enterprise.\nCaptain Pike is purely professional with his crew, but impeccably polite, and he seems to be distantly fond of Spock. He never mocks him for the Vulcan's confusion over the behavior of his human crewmates, and has actually insisted that Spock come to him with questions at any time. For the first time someone outside the family has taken a special interest in Spock, and he treasures that acceptance.\nHe will not abuse it.\n_____________________________\nJim's recovery isn't easy, but he has Talessa and Septon to aid him, so it isn't brutal. Talessa is content in her new form, and if he occasionally discovers that she's hoarded a little food under his bed – well, that's her quirk, not his, and it doesn't really mean anything.\nSepton doesn't Settle, even when years pass and Jim signs up for Starfleet. That's okay, though. It was amazing when Talessa settled, but it's kinda useful to have a shifting daemon along, too. From the speculative looks he gets at his Starfleet interview, others agree.\nCadet Kirk. He likes it.\nStarfleet is a challenge, but he earnestly wants to succeed. He can never think of those officers on Tarsus without shaking his head, but he still wants to do that – to save people, to give them hope. And his gaze inevitably slides to Talessa, furry and content. He wants to do something with meaning.\nGary Mitchell laughs at him, mocks his study habits. Kirk doesn't care. He studies every night and has Septon quiz him, and if that's also a little weird, that his daemon might have a better memory than him, anyone who protests can fuck off.\nIt's not until Kirk's third year that he meets Leonard McCoy.\nHe has a dislocated arm after physical training, and Leonard McCoy grumbles about inane injuries and idiot meat-heads as he resets it. The random tirade sounds so ridiculous that the pain-delirious Kirk starts laughing.\nMcCoy just scowls, which seems funnier. The sparrow-shaped Septon flutters over to perch on Jim's head and blink at his shoulder, and McCoy stops. Looks at him. Looks at Talessa.\nSepton changes to a chinchilla, clings to Jim's scalp with wide eyes, and solemnly stares back.\nMcCoy's confusion isn't helping Kirk calm down, but he smiles. “I have two daemons,” he explains.\n“Oh. Yeah, I heard about you,” McCoy murmurs faintly. “And they – haven't even Settled?”\nSepton's tail swishes. He hops down beside Kirk and turns into a savanna cat, prim and straight, looking at McCoy with faint disapproval. Talessa perks up; she knows lecture-mode when she sees it.\n“It is illogical to assume that both of us are Unsettled simply because one of us is still capable of changing form. While my own shape fluctuates, Talessa has been Settled for five years, two months, one week, four days, eight hours, fifty-seven minutes and 28.9 seconds.”\nA pause. McCoy gapes at him.\n“That is a very unattractive look,” Septon adds.\n“The hell?”\n“Sorry, Doctor,” Kirk says, bubbling with mirth. “He can be a little... mouthy.”\n“I'll say!”\n“He doesn't mean any harm,” Talessa adds consolingly.\nA little mollified; “I like her better.”\nSepton turns into a hedgehog and glares.\n“Personally, I'm fond of both,” Kirk says brightly, testing his shoulder.\n“That one's just damn weird” McCoy mutters. “Unnatural.”\nKirk narrows his eyes, but a quick look to their daemons makes him muffle a sudden laugh, his instinctive anger giving way to amusement. He grins at McCoy.\n“What you smiling about?”\nKirk gestures.\nMcCoy's porcupine is snuggling against Septon, who apparently took such an unprecedented shine to the creature as to mimic its form. They've both somehow huddled atop the back of Talessa in the past few seconds, and she blinks at the two humans smugly.\n“Screw you,” says the man rudely.\nKirk just laughs.\n______________________________\nPike seems to have established himself as Spock's 'mentor', as it is, and fully steps into the roll when the unexpected death of the Science Officer leaves Spock to take the position. Spock takes to the promotion with quiet efficiency, and Pike seems to find something special in him.\n“You have a real talent, Lieutenant. You need to work on your people -skills, but you could go far.”\nIt isn't that odd, Spock decides; the captain has a close relationship with the first officer, known only as 'Number One', and she has an almost Vulcan stoicism about her. Logical, then, that the captain would socialize well with other like-minded individuals.\nWhatever Pike sees in him, the captain likes. He insists on dining with Spock once weekly in his private quarters to just talk, and seems to see the half-human as someone worthy of his sparsely-given trust and confidence. Spock is honored to be given that trust, and he is pleased to find that he can relax, just somewhat, with this odd captain. He still keeps most of his past private, but he does talk about Sybok. It is... oddly cathartic, and for the first time he understands the human method of dealing with problems; instead of inward meditation, they seek sympathy and understanding through an outside perspective.\nFascinating.\nOne day as they dine Pike strokes his bobcat daemon, Beya, and eyes him thoughtfully. “I can't imagine what it would be like,” he says suddenly, “to not have a daemon.”\n“Lacking a frame of reference, that is understandable.”\n“What's it like to have a katra?” the man persists.\nSpock studiously examines his plate, uneasy. “As I said, you lack a frame of reference.”\nPike rolls his eyes. “Just try to explain, please? Even if it doesn't make sense to me.” He smiles.\nBeya purrs, then rises to stretch languorously. He meanders over to twine around Spock's feet. It's a shocking trust, and every time Beya does it he is reminded of Peonessin.\n“I would not know.”\n“But - “ Pike blinks. “But – you don't have a daemon.”\n“I do not.”\n“Then – you have a katra. You're half human and half Vulcan, right.”\n“That is correct.”\n“Then you must - “\n“I have neither.”\nPike stares at him for a long moment. Then he looks down at his own tray. “Oh,” he says lamely.\nBeya walks away.\nPike doesn't treat him any differently on the bridge. He still seems happy to answer Spock's human-related questions, and stops him in the halls to tell wistful anecdotes of old mission. He seems very fond of Spock, in his reserved way, and never mentions what Spock admitted.\nBut Spock can't help but notice that their weekly dinners stop about a month after his admission – abruptly, after half a year of pattern.\nWell, he thinks. That 'friendship' thing had at least been nice while it lasted.\n_____________________________\n“I think Septon's lonely,” Talessa declares one day.\nIt's such an absurd statement that even Kirk has to stare at her.\n“He's a daemon,” Mitchell points out. “How can he be lonely?”\nThey're assigned to the USS Farragut. Kirk glances around, but he can't see Septon anywhere.\nGary catches the look. “Good lord, don't tell me he's not with you?”\n“He does that, sometimes.”\n“It's weird.” Gary shudders a little, hugging his raccoon-daemon.“You have the strangest daemons, Jim.”\nTalessa gives Gary a dirty look, then turns to Kirk. “Jim, I mean it.”\nHe focuses on his bond to Septon, willing him to show up. “What makes you say that?\nTalessa just gives him a piercing stare. “Don't play stupid, Jim. You know.”\nKirk sighs.\nYes, he does. Septon has always been a little reserved, but since joining the Farragut he's been entirely taciturn, typically hiding in Kirk's cabin; he's gone so often at least half the crew probably isn't even aware Kirk has a second daemon.\n“I know he's been a little – down – but 'lonely' is an odd choice of words.”\n“Your daemons are bizarre,” Gary says again. “You should know what each other are feeling, because you both feel it. How the heck can only one of you be 'lonely'? How can you not know?”\n“Shut up, Gary,” he snaps. “C'mon, Talessa. Where is he?”\nThey find Septon hiding in engineering as a muskrat, watching the frantic energy of the room with wide eyes. Kirk frowns at him. “What's wrong, Septon?”\nSepton eyes the engineers gloomily. “That man is about to short-circuit his console.”\nA second later the console indeed starts to emit sparks, and curses rise over the din as a group of  engineers descend on it.\n“Septon. Why don't you join us anymore?”\nSepton is quiet a moment. “It is not sufficient.”\n“What isn't?”\n“Any of it. All of it.” His whiskers twitch. “I am uncertain.”\n“What can we do?” Kirk insists.\nSepton considers this, eyes following the other daemons around the room, and finally decides, “Absolutely nothing.”\n_____________________________\nCaptain Pike is being promoted, Number One is transferring, and Spock will become the new First Officer.\nIt is a dizzying idea, and a distressing one. Spock could have served as Pike's First, he feels, but he somehow doubts his ability to establish a similar rapport with the new captain. James Kirk will be the youngest captain in the 'fleet, only thirty-two. The man is supposed to be a genius, but he also has a reputation for impulsive decisions and a certain salaciousness of character. While most humans give him glowing reports, Spock cannot imagine serving well under such a supposedly emotive man.\nHe considers transferring.\nBut to where? A Vulcan ship, such as the Intrepid, would simply be a misery. Any human-dominated starship or base would likely carry the same problem as with Kirk. No: better to stay on the Enterprise, where he has worked for over a decade, and put up with the change as best he can. Doubtlessly the experience will be trying, but Spock shall adapt. He, at least, can always be counted on to stay professional.\n_____________________________\nPike smiles politely as the silver-blue swirl of the transporter vanishes to reveal Commander Kirk, soon to be Captain. He shakes the man's hand, noting the way Kirk's eyes dart around the transporter room and unable to really fault the other. One's first command is always exciting.\nHe automatically looks to check the man's daemon, wanting to assess this young captain, and he blinks.\n“Ah – may I ask which one of these is yours, Commander?” He asks uncertainly.\n“Both,” is the bright reply.\nA large badger peers up at him from the ground. A sleek black cat rests in the commander's arms, staring at the door -\nAnd then the cat is yowling, throwing itself forward and kicking its back paws at Kirk. The commander yelps, bewildered, and tightens his grasp instinctively. “Septon! What are you doing?”\n“He's here he's here letgoletgo - “\nEven more bewildered by his daemon's use of actual contractions, Kirk just gawks. At the transporter console Lieutentant-Commander Scott starts forward, worried.\nSuddenly the cat turns into a horse, of all things, and Kirk pitches forward. As its feet hit the ground it's a tiny hummingbird, darting from his grip.\n“The Hell?” Kirk gasps.\nThe badger seems amused by the whole thing.\nThe door slides open.\nLieutenant-Commander Spock steps through.\nHe seems faintly bewildered, staring around vaguely. “Curious,” he murmurs. He blinks at the Captain. “I apologize, Sir, but I thought - “\nA blue blur slams into him.\nKirk clutches at his chest, gasping, and Pike stares. Spock for his part seems frozen, holding something tiny and blue in his hands with the most unabashed show of awe Pike has ever seen on the man's face.\n“You're mine,” says the bird fervently.\n______________________________\n“I think you broke your new First Officer,” Pike tells Kirk.\nThe three have absconded to an empty room off the transporter area. Spock still seems uncharacteristically speechless, just staring at the tiny bird as it gazes right back. The badger is investigating the bird, too, which wouldn't be so weird if she weren't also leaning right against Spock as she does so.\nTo his knowledge Kirk and Spock have never even met; why on earth would Kirk's daemon be willing to touch the man?\n“I've had two daemons since I was born,” Kirk explains. “But – Septon was always a little odd.” He grins suddenly. “He's a Vulcan. God, that explains so much, you have no idea.”\n“Vulcans don't have daemons,” contradicts the badger.\n“Half-Vulcan,” Pike corrects distractedly.\n“Oh.” She settles, reassured.\n“This is Talessa,” Kirk adds, absently. “Septon – have you Settled?”\n“Yes,” says the bird daemon. He doesn't look away from Spock, so Pike is surprised when the Vulcan tears his gaze off his daemon to talk.\n“He is a lara,” the Vulcan explains, with a shade of reverence in his voice.\n“What are those like?” Kirk probes, gently.\n“The lara is a docile, shy bird in the wild, but not cowardly. When threatened it imitates the shriek of a le'matya to scare off predators, and it will defend it's family and territory to the death when sufficiently provoked.” He strokes the bird, distantly, absently. “I have a daemon,” he adds, a little lost.\n“Mr. Spock,” Kirk decides, “I think we're going to get on very well.”\n______________________________\nAnd they do. They eat every meal side-by-side, disappearing after shift for sparring matches or chess games, and the crew wonders at the odd pair. Between Captain and Commander there is plenty of work, which should leave little room for a personal life, but on the bridge they work in perfect tandem, perfect trust, and missions aren't so difficult as they should be.\nMcCoy, when he comes aboard, is a little disgusted by the whole thing.\n“A Vulcan,” he says. “It figures.”\nKirk would mind more if McCoy's porcupine daemon, Ashadri, would stop cuddling with Septon.\nSpock is the first non-therapist that Kirk tells about Tarsus; Spock returns the trust by speaking about his disastrous meld with his mother's daemon.\n“But you can still meld with humans, right?”\nSpock can, and he does.\nIt's a dizzying experience. Spock warns him that the meld might be odd, nauseating, but instead it's perfect. Something clicks together in their minds, like pieces of a puzzle, meshing together until even the ending of the meld leaves them linked and entwined. Like one single individual.\n“T'hy'la,” Spock explains, stunned. Kirk doesn't ask for a translation; he doesn't need one.\nThey have a dazzlingly blue desert bird and a stoic honey badger, both able to comfortably accompany either of them, and no one they meet is ever quite sure which daemon belongs to whom. Spock and Kirk know, as do the Enteprise crew, but that's just a technicality. The four of them are, when it comes down to it, one and the same.\n \n \n \n "
}