{
    "id": "890665",
    "url": "https://archiveofourown.org/works/890665?view_full_work=true",
    "author": [
        "otter"
    ],
    "title": "Trust In This (Even If You're Scared Stiff)",
    "rating": "Teen And Up Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Teen Wolf (TV)"
    ],
    "relationships": [
        "Derek Hale/Stiles Stilinski"
    ],
    "characters": [
        "Derek Hale",
        "Stiles Stilinski",
        "Original Characters"
    ],
    "additional_tags": [
        "Kid Fic",
        "Fluff",
        "Flash Fic",
        "Alternate Universe",
        "Discrimination",
        "Alternate Universe - Werewolves Are Known"
    ],
    "language": "English",
    "series": "",
    "published": "2013-07-20",
    "completed": "2013-07-27",
    "words": "10,472",
    "chapters": "3/3",
    "comments": "459",
    "kudos": "17,309",
    "bookmarks": "3,995",
    "hits": "238,169",
    "summary": "<p>Stiles' kid has a tendency to get into fights and possibly has bad taste in friends. Or enemies. Stiles isn't sure yet, but he's pretty sure the other kid's dad is too hot to be human.</p>\n<p>Stiles is maybe more violent to the phone than he needs to be, but he already knows it's Emmy, and sure enough that's her name on the caller ID. Seriously, it's like she has a Spidey-sense, but it's actually a Dad-is-getting-action sense. It compels her to intervene, like some sort of horrible, primordial instinct. Stiles is going to change her name in his contacts list to \"Cockblock.\"</p>",
    "notes": "<p>I asked on <a href=\"https://agentotter.tumblr.com\" rel=\"nofollow\">tumblr</a> for some prompts, and annabethlemorte provided: \"domestic kid fic sterek…first PTA meeting bc their kids were BAD.\"</p>\n<p>I'm not really good at kids or kid fic or accurately writing things like this but wtf, I tried. It's flashfic so unbetaed so... I hope it's not awful. Title is from the awesome Hey Rosetta! song \"<a href=\"https://www.youtube.com/watch?v=IZCJeZw6VpI\" rel=\"nofollow\">Young Glass</a>.\"</p>\n<p>I should probably also warn for some displays of dickheaded prejudice and discussion of bullying.</p>\n<p>I had quite a few requests for more from this universe, and I felt like we could all use a little more fluff in our lives, so here's another piece of it. These are all going to be sort of isolated snippets and not really one structured story, but hopefully it's easy enough to follow along. There'll be at least one more, but I'd also like to invite any of you if you enjoy this particular AU to write some bits yourselves if you're inspired to do so.</p>\n<p>Title again from Hey Rosetta!'s \"<a href=\"https://www.youtube.com/watch?v=WX_Nvm-ZEvY\" rel=\"nofollow\">Young Glass</a>\" and as before this story hasn't been betaed so I hope it makes sense.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>Well, that's probably it. Possibly. At least for now. If anybody else wants to play in this particular sandbox, I do hope you will. I might write another thing at some point, who even knows. I just have a lot of thoughts about how werewolves work in this made-up society. IDEK you guys. Let's talk about it on <a href=\"https://agentotter.tumblr.com\" rel=\"nofollow\">tumblr</a> or something.</p>",
    "text": "It only takes Stiles ten minutes to get to the school, which means there was probably a lot of speeding involved, but it's worth it to know that he hasn't spent an extra ten minutes moving at a lawful speed and working himself into a righteous froth of worry and rage. He thinks he deserves some serious kudos for not turning on the lightbar on his cruiser and screaming through town at eighty miles an hour. So he's only agitated instead of full-on furious when he bangs his way into the middle school's administration office and finds his kid sitting on one of the Chairs of Shame outside the principal's office, holding a wad of tissues to her bloody nose. The expression on her face is one of flushed, practically apoplectic fury, but there's a guy in scrubs crouched in front of her, talking softly, and she's nodding at him like she's receiving some sort of wartime pep talk about keeping a stiff upper lip.\nThere's another kid sitting right beside her, presumably the one who gave her the bloody nose, because he looks like he probably has a low tolerance for bullshit, if the eyebrows are anything to go by. The door to the principal's office is firmly shut, so most likely the principal is waiting for all of the parents to be present before the tongue-lashings commence, but both kids look like they're prepared to settle the matter with an actual fight to the death.\nThe second she sees Stiles appear in the doorway, his kid completely abandons whatever conversation she's having with the school nurse — Stiles didn't even know the school had an actual nurse; when he went here the 'nurse' had just been a vice principal's daughter, who had a degree in physical education and was a closet sadist — and launches in on Stiles, instead.\n\"This is bullshit, Dad,\" she says, and her voice is hilariously nasally, makes the curse come out like budshid. She doesn't seem to notice the way the kid next to her shoots an apprehensive look at the nurse like he's waiting for the nearest adult to go nuts over the curse word and wants to make sure he's not in the yelling radius. Like fist-fights are okay but profanity isn't, which just goes to show what's wrong with the youth of today, as far as Stiles is concerned. The nurse doesn't say anything, though, probably because Stiles' kid is rolling on like it's no big thing. \"Mr. Hollywell said they're going to expel me this time and it wasn't even my fault, you have to do something.\"\nStiles snorts. \"What, like with my dad powers or something? There's only so much I can do when you're determined to start your street-fighting career at the tender age of eleven, Emmy. School's been in session for a month, seriously, what the hell.\"\n\"I didn't start it this time, Dad,\" Emmy says, with the trademark Stilinski whine. Well, it's not really necessarily a Stilinski trait, because Stiles' dad has never whined, possibly in his entire life, was probably perfectly stoic and square-jawed even as a baby, but Emmy takes after Stiles in a serious way, is the point.\n\"This time?\" the nurse says, a disapproving tone in his voice as he smoothly pushes himself to his feet and turns on Stiles like he's going to deliver a lecture personally, before the principal can even bother.\n\"My dad always used to say, once is an incident, twice is a coincidence, three times is a... uh.\"\nHe might've lost his train of thought there, but it's not his fault. Because the nurse has turned completely around and he's... he's kind of... Stiles is having trouble thinking beyond his intense regret that he didn't check out the guy's ass when he had the chance. He was distracted. By a bleeding kid. He's going to make her pay later. Because the nurse is hot. He's got absurd muscles and an attractively bestubbled jawline and eyes that are like a million colors in the most aggressively handsome face Stiles has ever seen.\n\"Three times?\" the guy prompts, when it becomes clear that Stiles is going to continue staring.\nStiles thinks it's a proposition for a second, and he almost says something mortifying about refractory periods, before he realizes the guy's just waiting for him to finish his stupid saying. \"Oh. Three times is, um, a pattern. Probably a pattern indicating that I shouldn't be paying for those martial arts lessons anymore.\"\nEmmy, predictably, goes apeshit. She jumps out of her chair and starts with the one-armed gesticulating and everything. Nurse McHotness actually has to step back to get out of range. \"But Dad you can't! It's not my fault the kids here are douchebags!\"\n\"A month, Emmy,\" Stiles repeats. \"Three fights. You know what Sensei Reyes said after the second one.\"\nOfficially, Erica had given Emmy a hell of a dressing down, started pushing her harder on workouts, given her actual homework to do on her own time, and threatened to kick her out of the dojo if there was any more fighting. Privately, she'd gotten a certain glint in her eyes, made Stiles promise to let Emmy compete in some real tournaments this year to \"put all that pre-teen angst to good use,\" and told him to lighten up because his kid was teaching herself to fight crime.\nTo be fair, her first two targets were fairly deserving of the fist of justice. On the other hand, he isn't sure his kid needs to become Batman at this particular point in her life. She's not even an orphan. Thematically it just doesn't work out.\n\"We don't have to tell her about it,\" Emmy says, slumping back into her seat. \"You have parental discretion, you know.\"\nThe nurse actually snorts at that one. \"I said your nose doesn't seem to be broken, I didn't say you weren't going to have some pretty incredible shiners. Anybody with eyes is going to be able to tell you've been in a fight.\"\n\"Awesome,\" Stiles says, heaving a put-upon sigh because he is so put-upon. His fucking kid, seriously. \"It's going to be the great shunning all over again. You're staying home until your face looks normal again; I don't need anybody judging me like I'm an abusive dad. Again. If you need to leave the house, you're going to have to put a bag over your face.\"\n\"You're the worst,\" Emmy tells him, putting on a sullen face to match the dour little shit sitting next to her. \"You never take my side.\"\n\"I always take your side, when your side isn't stupid,\" Stiles points out, reasonably.\nThe nurse smirks, and it looks unfairly good on his face. He's also standing there watching like their family drama is entertaining to him personally.\n\"So everybody's okay, right?\" Stiles asks him, trying to figure out why the guy's even still there. It's just after lunch; surely somebody's suffering from food poisoning by now. \"Emmy's nose isn't broken, she doesn't seem to have permanently traumatized that kid — at least this one's not limping — so...\"\nThe guy doesn't take the hint, he just raises one of his impressively intimidating eyebrows. \"So?\"\n\"So...\" Stiles says, and can't bring himself to actually say it. 'Don't you have someplace else to be' sounds too douchey, even in his own head. Plus, if the guy left, then Stiles wouldn't be able to look at him anymore. He can take a little extra embarrassment if it comes with that kind of trade-off.\n\"Oh my god, Dad, he's not the school nurse,\" Emmy says. She buries her face in her hands like he's so embarrassing she can't even stand to exist anymore, but it's a short-lived gesture because touching her own face makes her wince and recoil. Yeah, she's going to have awesome bruises later. \"He's Ben's dad.\"\n\"Oh,\" Stiles says, eloquently. He's assuming Ben is the other kid, because said kid scowls and sinks a little deeper into his seat. And yeah, okay, he can see the family resemblance in the eyebrows, definitely. And the ears. On Ben they're huge and kind of adorable, but if he's anything like his dad he's going to wind up looking like he's stepped from the pages of GQ.\n\"Derek,\" the nurse says, and it takes a second for Stiles to realize that that's the guy's name, because usually this is the part where the other parent starts threatening lawsuits or whatever. Stiles is getting really familiar with the routine. Maybe coming straight from work was his most awesome idea ever; he's still in his deputy's uniform, and this Derek dude is being seriously chill about the whole thing. Could be the sidearm. He'll definitely have to come to all parent-teacher conferences packing heat from now on.\n\"Stiles. Uh, sorry my kid tried to beat up your kid.\"\nEmmy says, \"Dad!\" at the same time that Ben and Derek frown simultaneously and say, in eerie unison with practically the same voice (Ben's just hasn't dropped yet), \"She didn't.\"\nStiles is completely, fantastically confused, so of course that's when the principal's door swings open. Dr. Banerjee leans out, with her usual unreadable look, the one Stiles likes to call her thousand-yard stare, like she's been through the education wars and seen horrors they can't imagine. Her voice is just as flat and unimpressed when she says, \"Everyone's here, then? Come into my office.\"\nThere are already people in there, when they file in, so it gets a little tight. Stiles pulls Emmy to one side with him, looping an arm around her shoulders and giving her nose a quick look himself. It looks like it's more or less stopped bleeding — she tossed her wad of bloodied tissues into a garbage can on the way in — although the front of her shirt is pretty much ruined. Stiles has plenty of experience getting blood out of clothes, but he's thinking this one's a loss. Derek and his kid take the opposite wall, Ben looking at the floor with his hands jammed in his pockets, Derek with his frankly massive arms folded forbiddingly across his chest. The guest chairs are occupied by a pair of parents and another kid, maybe a couple years older than Emmy or maybe just an early bloomer. The kid looks worse for wear, though, his face scuffed and blooming with at least one new bruise, his clothes stretched and dirt-stained, like somebody used a grip on his shirt to fling the kid around like a rag doll. Stiles has seen Emmy do it before, in practice. He has no idea what's going on right now.\nThe second Dr. Banerjee closes the door, the kid's mom looks back and forth between the Hale camp and the Stilinski camp, pulls a face like she's equally disgusted with both of them, and says, \"I hope you're prepared to discipline these animals for attacking my son.\"\nStiles can't help but suck in a quick breath, eyes snapping to Derek's face, taking in the way he tenses and bristles. Ben bites his lip and looks like he actually physically shrinks. Derek looks like he's considering ripping throats out first and asking questions later. Werewolves. No wonder Derek's supernaturally attractive. He's Derek Hale, as in the Hales, the biggest pack in the county. As in Laura Hale, who works in the werewolf division at the sheriff's office and likes to butt her nose into Stiles' personal life. God, this is going to be a nightmare.\n\"You do realize that speciesist slurs are legally classified as hate speech,\" Stiles says, casually, leaning back against a bookcase. Emmy squeezes a little tighter into his side in solidarity.\nThe dad's eyes narrow, and so do the kid's; it's obvious where the little shit gets his attitude from. \"Figure of speech, I'm certain that's not illegal,\" the dad says. \"Assault, on the other hand, is definitely against the law, Deputy. Maybe you'd like to take your daughter out of here in handcuffs, because I think we're interested in pressing charges.\"\n\"I have a policy in situations like these,\" Dr. Banerjee interrupts smoothly, before Stiles can cut a bitch, \"in which the parents are not allowed to speak until the children have explained themselves. Mr. and Mrs. Thomas, I've already heard from your son — at length — and I'd like to hear what Benjamin and Emily have to say.\"\nShe looks first, expectantly, toward Ben which is a good call, because once Emmy gets going the kid probably wouldn't get a word in edgewise. Ben freezes like he feels the gaze of a thousand predators, which is kind of silly because he is a predator, but when he finally looks up, it's not his dad he looks to, or his principal: he looks right at Emmy. Huh.\nHe must receive whatever signal he's asking for, because he finally opens his mouth and says, \"Connor was giving me a hard time, and Emily stepped in. Connor threw the first punch.\"\n\"Yeah, and I threw the last one,\" Emmy says, before Stiles can slap a hand over her mouth. She takes after him in almost every way, which is really unfortunate for her and her future.\n\"You're the one who started it!\" Connor shouts at Ben, pointing an accusing finger like he thinks he's in a over-dramatic reenactment of the Salem witch trials.\n\"What, by existing?\" Emmy says, and she probably learned that sneer from hanging around with the Hale kid because it's more impressive than anything Stiles has ever mustered up. He's clearly failed her as a role model. \"You harass him every single day because you know he can't fight back!\"\n\"Please, he's a werewolf, all he knows how to do is fight,\" Mrs. Thomas says.\n\"Yeah, right, because the Werewolf Control Act is no big deal, I'm sure werewolves can do whatever they want,\" Emmy says, her voice dripping unconcealed venom.\nMr. Thomas opens his mouth and Stiles doesn't even want to hear what the guy's going to say, because Derek's starting to look like he doesn't personally care about the Werewolf Control Act at all, and has no concerns about the kinds of stiffer-than-ought-to-be-legal penalties imposed on werewolves implicated in violence against humans. Anyway, Stiles doesn't really want his first up-close encounter with Derek's incredible body to involve trying to physically pull the guy off the bloodied corpses of his enemies. That seems like fifth-date material, at least.\n\"Alright, calm down,\" Stiles shouts in his best cop voice, which is seriously good if he says so himself. He has to clap a hand over Emmy's mouth to stop her talking, but the Thomases shut up, at least, and Dr. Banerjee gives Stiles a cool nod, like they're bros in crowd control.\n\"Thank you, Deputy,\" she says, and then turns back to Ben, who's practically hiding behind his dad, looking like he'd rather be anywhere else. \"Benjamin, were you physically involved in this fight?\"\nA yes would mean mandatory temperament and stress testing, and probably at least three days confinement for behavioral observation. If the kid was mixing it up, he'd be insane to admit it.\n\"No,\" he says, after a long pause. \"I tried to pull Emmy off of him. That's it.\"\n\"And has Connor been harassing you, as Emily says?\"\nThe kid bites his lip, looking back and forth between Emily and Connor, both of whom are wearing thunderous expressions. Pointing to another kid for starting a fight is one thing; admitting to long-term bullying is another. They're only a month into their first year of middle school, with a whole new group of people and a whole different social dynamic. Stiles doesn't envy them; his middle school experience was hell, and he only had to worry about his own social ineptitude and the sudden activation of his hormones. He can't imagine going through all that with discrimination and a monthly furry situation, on top of everything else.\nFor all that Ben seems a little meek, though, he stands up where it counts. He rolls his shoulders back and his chin up and says, \"Every day since the beginning of term.\"\nMrs. Thomas scoffs. \"He's just lying to cover up for his—\"\n\"That's enough,\" Dr. Banerjee says. She doesn't look amused. \"Benjamin, I realize that due to your lycanthropy status you have... limited options, for dealing with bullying. That said, the other young adults here are supposed to be laboring under the same restrictions.\" She turns her withering gaze on Connor, and then Emily. \"It should not be considered a viable option for anyone in this school to resolve disputes through violence. Am I understood?\"\nAll of the kids look at the ground and murmur their agreements with varying shades of surliness.\nDr. Banerjee sighs, looking three thousand shades of done with their shit. \"I expect that if these problems continue, I will hear about it personally. But I also expect them not to continue. Emily, Connor, one week of out of school suspension for the both of you. And your teachers and I will be keeping a very close eye on you. See to it that we don't have any cause to bring you back into this office. That's all.\"\nShe turns back to the paperwork on her desk in the clearest dismissal that Stiles has ever seen, and the way he figures it Emmy's getting off light, this time, so he hooks his arm around his kid's neck in an almost-headlock and drags her out the door. Derek and Ben follow them, and the Thomases file out last, after trying to argue their case again. Stiles can't hear what Dr. Banerjee says in response, but it's brief and steely-voiced. When the Thomases leave, it's with glares and sneers that Stiles ignores completely, because he has that blessed luxury. They slam Dr. Banerjee's office door behind them as they go.\n\"If I'm grounded, I just want you to realize how much enforced togetherness is going to be involved,\" Emmy says, before Stiles can even say anything. \"Also, I'm really super into retro cartoons now. There's going to be a lot of My Little Pony in your future.\"\nStiles props his hands up on his utility belt. It's a classic cop pose, but it's also practically the only pose cops can manage; the stuff on the belt kind of gets in the way of most other things. He could put his hands on his pockets, but then his handcuff case would dig uncomfortably into his forearm and nobody wants that.\n\"Friendship Is Magic?\" he says, raising his eyebrows. \"That's retro now? Oh my god I'm seriously old. I love that cartoon, though. Love, it's not even past tense, I am actively interested in ponies right at this very second. You're going to have to try harder than that if you want to scar me for life.\"\n\"Oh, I will,\" Emmy says, her brown eyes narrowing dangerously.\n\"And anyway, you're not grounded,\" Stiles says, ignoring her frankly awesome threatening stare. He looks over her head at Derek and Ben, who are having their own quiet parent-child conference on the other side of the room. Ben looks dejected as hell, like his whole life is ending and nothing's ever going to be okay again, but it looks a lot like his dad is comforting him rather than berating him, which is good. Guys who are assholes to their kids are not attractive, so Derek's apparent sensitivity means Stiles is free to continue to want to climb all up on that.\n\"I'm not grounded,\" Emmy says, repeating the words like she's expecting them to start making some kind of sense once she's tasted them in her own mouth.\n\"Nope,\" Stiles says. \"You'll have to explain to Sensei Reyes exactly why you were fighting, but I'm pretty sure she'll be understanding.\" She's probably going to give Stiles an embarrassingly drawn-out hug and start getting soppy about how he's raising his kid right and how she should get to take at least half the credit as unofficial co-parent. \"As for your week off, I'll pick up your homework for you, so you'll have that to do. I don't need you driving me crazy all week so you can pick out a few new video games to keep you occupied. And I'm so exhausted by the stress you put me through that I'm definitely not cooking tonight. We'll swing by home and get you cleaned up, then we can go to that pizza joint you like, the one with the arcade and the laser tag.\"\n\"Really?\" Emmy says, and her eyes go all huge and sparkling like a cartoon character. She's ridiculous. Of course she is; Stiles helped make her.\n\"I'm not rewarding you for fighting,\" Stiles points out. \"Fighting is bad. But unofficially I'm proud as hell. There's nothing wrong with sticking up for somebody who needs you, kid. We just have to work on making you more of a sneaky little shit about it.\"\nIt's not exactly a surprise when Emmy throws her arms around his waist and does her best to hug him in half, but it's still awesome, so he bends down and kisses the top of her head, hugs her back, and then says, \"Why don't you go invite Ben and his dad?\"\nWhat with the werewolf hearing, they probably both hear the invitation from across the room, but Emmy still says, \"Okay!\" and races over there like she's afraid they're going to get away. It only takes a few seconds for Emmy to issue the breathless invitation, and Derek spends the whole time staring at Stiles like he's from another planet.\nHe finally leaves the kids to their own devices — Emmy seems to be explaining each of the arcade's games to Ben in detail — and crosses the room, slipping in next to Stiles to lean against the empty reception desk.\n\"You don't have to do that,\" Derek says, apparently referring to the invitation. \"I mean, I appreciate the gesture, but you don't have to.\"\nStiles snorts. \"No, I totally have to. They're friends. You don't get in the way of something like that.\"\n\"No, I guess not,\" Derek says, but there's a soft note in his voice that says plenty of things have gotten in the way of his kid having friends before. Probably things like claws and fangs and people's shitty attitudes.\n\"And anyway, it's my totally underhanded way of asking you on a date,\" Stiles says. \"Did you know I work with your sister Laura? She has this really irritating habit of stopping by my desk to complain about her brother and how moronic and single he is, and I always thought that was just a thing she did but I've just realized it's only a thing she does to me. While asking really invasive questions about my personal life.\"\nDerek sighs like he's been there and done this. \"So you've just realized she's been trying to set us up, and you want to get her off your back?\"\n\"Noooo, I've just realized she's a genius and I want to climb you like a tree,\" Stiles says, and grins his grin that he likes to think is Han Solo levels of cocky charm. \"But I'll settle for a pizza date and a duel at tabletop Pac-Man.\"\n\"Dad!\" Emmy says, and suddenly the kids are right in front of them, red-faced with embarrassment and both wearing sour expressions. \"You are so gross. Can we go before you embarrass me any more?\"\n\"Kid, I'm only just getting started,\" Stiles says, and gives her a shove toward the door. \"Just wait until I convince him to make out with me. Every time you turn around you're going to be scarred by the sight. I'll make sure of it.\" He shoots a look at Derek, wondering if he's gone too far too soon with that, but Derek's actually grinning back at him, fucking licks his lips like he can't wait. Stiles might be in over his head with this guy. \"Meet you there in half an hour?\"\n\"You're on,\" Derek says, grinning, and it sounds like a challenge.\nIt just figures that the phone doesn't start ringing until Derek's mouth is just... it's right there.\nStiles is maybe more violent to the phone than he needs to be, but he already knows it's Emmy, and sure enough that's her name on the caller ID. Seriously, it's like she has a Spidey-sense, but it's actually a Dad-is-getting-action sense. It compels her to intervene, like some sort of horrible, primordial instinct.\n\"I'm going to change her name in my address book to 'Cockblock,'\" Stiles says, and Derek snorts against his thigh, stubble scraping against the sensitive tissues there, and then the asshole goes and licks at the crease where Stiles' leg meets his hip. Derek's fingers are curled around the soft undersides of his knees and Derek's thumbs are sweeping over and over again at the seams of the joints and Stiles feels a little taken apart, already.\nStiles accepts the call, though, because he can't not, that isn't how parenthood works. Or maybe it is how parenthood works, for normal people, but he learned his lesson that time he tried to make a principled stand about not being on-call for his kid twenty-four hours a day, and it turned out she'd actually broken her arm. She's going to be able to use that against him for the rest of time. He doesn't need to give her more ammunition, so: he answers the fucking phone.\nHe doesn't need to be nice about it, though. So after he taps the 'accept' button, he says, \"This better be an actual emergency this time, and not a peanut-butter-shortage type of emergency, or so help me you are grounded until you're forty.\"\nThere's a pregnant pause before the voice on the other end of the phone, which isn't Emmy's voice at all, says, \"I'm still not quite sure where I went wrong with you.\"\nStiles closes his eyes, thumps his head back against the couch. This could be a completely porny position, if Derek was sucking his cock right now, but instead it's the same sort of posture of defeat he's been practicing for a good couple of decades. He's been fine-tuning this particular brand of despondency ever since he learned how to hold his head up on his own. \"Hey Dad,\" he says, and it's almost funny the way he can feel every muscle in Derek's body tense simultaneously. He lifts his head again to look down and sure enough, Derek looks like he's trying to think of the best hiding place in the room. \"Derek, this isn't a horror movie, he isn't calling from inside the house, okay? Chill out.\"\nDerek scowls, turns his head and nips at Stiles' thigh, which actually isn't very good as punishments go because Stiles is really a big fan of the biting. They haven't discussed that sort of thing yet, but Derek's eyes go a little darker when he sees the way Stiles twitches up into it.\nHe needs to think about something that's not cocks. Or Derek. Or Derek's cock, which he hasn't even seen yet because this is seriously the first time they've had a chance to even attempt to get completely naked together. It's profoundly unfair. He squeezes his eyes shut and tries not to dwell on it.\n\"So Dad, not that it isn't great to hear from you, but we were kind of busy?\"\n\"I'll bet,\" Dad says, and how did Stiles never notice growing up what an asshole his dad is? \"I didn't actually call for you, I need to talk to Derek.\"\nStiles doesn't even get a chance to say something smart-assed, because Derek's up and plucking the phone out of his hand without so much as a please or thank-you. The view's not bad, at least, because Derek's lost his shirt somewhere along the way, he's only wearing a pair of worn-soft scrub pants, and the way he's pacing back and forth in front of the couch really puts his everything on display to great advantage. Jesus, the guy's built like a fucking jungle cat or something. And Stiles has definitely noticed that Derek was in enough of a hurry that he didn't even stop by his house to change before they met up at Stiles' dad's house to drop off the kids and make good their escape.\nThey're going to have sex, Stiles thinks, dazedly. Finally. And whatever it is that his dad's calling about, it can't possibly stop them, because his dad is a super-parent. He survived the raising of Stiles himself, and there is absolutely nothing that those two little hellions can throw at him that he can't handle. On his own. Without them. Which is why Stiles talked him into watching the kids in the first place. So he doesn't know what his dad's called about, can't hear both sides of the conversation the same way Derek always can, but he knows they're in absolutely no danger of having to stop with the makeouts and go deal with any parenting.\nDerek doesn't say a whole lot, during the call, but he does end it with, \"Okay, we'll be right over,\" and Stiles is going to die of sexual frustration.\n\"No, we can't be right over,\" Stiles says, despondently, but Derek's already hung up the phone, tossed it back in Stiles' general direction without even looking. He doesn't even have the good grace to offer an apologetic look, just spins away in search of his shirt.\n\"Sorry,\" he says, and his voice has lost that deep, growling edge it had when he'd shoved Stiles against the door with his hands fisted in Stiles' shirt and his dick already a hard line against Stiles' thigh.\nThose were good times, and Stiles misses them already.\nHe doesn't have time to dwell, though, because Derek's already found his scrub top and slipped it back on, and he's gathering up his shoes from the floor. Luckily for Stiles, his own things aren't scattered around, they're mostly still attached to his person; he only has to pull his t-shirt down from where it was kind of awkwardly bunched up under his armpits, and pull up his pants from where they're pooled around his ankles. He handles the shirt first, and stands up to deal with his jeans, because apparently they're going to be leaving anyway, and also it's a little less awkward to get his dick comfortably situated that way.\n\"What happened?\" he says, and Derek stares at him blankly for a moment, like he can't understand why Stiles doesn't already know. \"Human here, no super hearing,\" Stiles points out, helpfully.\nDerek doesn't bother with his socks or even sit down to put his shoes on, he just jams his feet into his sneakers and leaves the laces untied. \"Ben shifted and he's having trouble changing back,\" he says. He moves toward the door like he just assumes Stiles is following, which...\nYeah, Stiles is following. Stiles will always follow him, anywhere, if only because the view is so awesome.\nStiles says, \"Is he okay?\" just as they reach the entryway, and it's deja vu all over again because Derek turns and grabs him, pushes him up against the closed door and mauls him in the really nice way where there are tongues and lips and mouths and a perfectly acceptable exchange of saliva. It's incredible; Derek is like an Olympic-level kisser. He has technique, he gets one million points for enthusiasm, and he somehow kisses with his entire body in a way that shouldn't be legal.\n\"He'll be fine, he just needs me there,\" Derek says, after he's let Stiles' mouth go. He doesn't move back, and instead rests his forehead against Stiles' for a moment, sharing breaths. \"I'm really sorry. We're going to continue this later, I swear.\"\n\"I want you to promise you're going to sex me up. Pinkie swear.\"\n\"I promise,\" Derek says, solemnly, but instead of snagging Stiles' little finger, he runs a proprietary hand over the bulge in Stiles' pants.\n\"It's not fair to punish me just because I'm usually the one running out the door,\" Stiles tells him, as they walk out to street, where Derek's Toyota is parked — a little haphazardly, Stiles is pleased to note, because Derek was apparently in a hurry to get the D. \"It's not my fault I have a high-maintenance kid.\"\n\"I wonder where she gets it from,\" Derek says, dry like the Sahara.\nStiles scoffs. \"If you're going to insult me, you're never going to get the D.\"\n\"I'm not sure I want to get anything from a guy who actually says that unironically.\" Derek puts the car into gear and pulls too fast away from the curb, but he also drops that hand to Stiles' knee and leaves it there, fingers curled around the joint the same way they were a few minutes ago when Derek was on his knees.\nIt's a dirty trick, but it works, because Stiles is constitutionally incapable of staying mad. Or of actually genuinely being mad in the first place. Derek's really the master of the bitchface in their particular relationship — he's genetically predisposed, what with those eyebrows — so Stiles doesn't try to compete.\n\"You want to place money on this one?\" Stiles asks, settling back into the passenger seat, half-leaning against the door. \"Because I know it's Ben this time, and that's a shocking upset in the ongoing cockblock games, but I have a feeling deep in my gut that at the end of the day, it's still somehow my kid's fault.\"\nDerek shakes his head, and he has to take his hand back as he throws the car a little too fast into a corner. It's not quite \"hey there's a deputy sitting right here, don't force me to write you a ticket\" territory. It's not even \"I'm going to risk adding strain to our relationship by backseat driving\" territory. But it's still unnecessary, as far as Stiles can tell, because he's pretty sure this isn't a life or death situation. It's not like Ben's going to eat anybody. So he reaches out his own hand and settles it on Derek's thigh, giving that ridiculous collection of rock-hard muscles a soothing squeeze that means simultaneously \"slow your roll\" and also \"I'm here for you.\"\nStiles is supportive that way.\n\"I'm sure it's not Emmy's fault,\" Derek says, which is frankly really being generous to Emmy, Stiles will have to make her thank him later, even if she doesn't know what for. \"Ben's been having some problems lately, I probably should've known something like this would happen. He's just been so comfortable with Emmy, I thought... well, I don't know what I thought.\"\n\"I thought they were probably secretly hatching a plan for world domination,\" Stiles says. \"But let's be real, that's mostly Emmy. You should give Ben the talk, though.\"\n\"The— you think they're going to have sex?\"\n\"Not that talk. Gross, Derek, they're eleven. I'm talking about the 'don't let other people turn you into their minion' talk. I've tried giving Emmy the one about not being an evil overlord but it just never sticks. Your kid seems like he's more likely to listen.\"\nDerek snorts, and his hands relax a little on the steering wheel. They've rolled to a stop at a red light and the enforced pause seems to be doing his mental state good; he's relaxing by degrees. \"She's a good kid, you know.\"\n\"Yeah, I know,\" Stiles agrees, and waves his free hand like he's physically batting the topic away. He figures it's best not to examine it, because he'd rather they get to keep Ben and Derek both, and if Derek realizes too soon what a genuinely horrible influence Stiles and Emmy are, it'll all be over. He's still thankful to this day that Scott's mom never realized exactly how much trouble he used to get Scott into until it was way too late. \"So Ben's having some problems with his shift, that's not a big deal, right? I mean, puberty. It happens to all of us. Some of us acquire acne and mono, some of us sprout hair and claws...\"\n\"It's kind of a problem for a kid his age,\" Derek says. \"He's supposed to have a handle on it by now; a lack of control is why they still keep human and werewolf kids in separate elementary schools. It's a big deal for him to finally be in an integrated school. He was really excited about it, at the beginning of the year. But if he can't keep a handle on his shift, he'll have to transfer.\"\n\"To where?\" Stiles asks, but before he even finishes saying it he knows the answer. \"Wait, to that institutional school across the river? The one that looks like a prison block?\"\n\"Maybe,\" Derek says. The muscles in his jaw clench and then deliberately relax. They're turning the corner onto Stiles' dad's block. \"If there's actually an incident. But I could just end up home-schooling him. Holding the shift has always been a little harder for him than for the other kids, and then over the summer he started having real control problems. And of course everybody in the family has advice to give him, techniques, cautionary tales... they just freaked him out, kind of gave him a complex. It's why we moved out of the house and into a rental. I just... he needed some space. And I've been doing a lot of one on one with him. He's been getting better. He's certainly never done it in front of humans before.\"\n\"I'm sure he's fine,\" Stiles says, as they pull in behind his dad's cruiser in the driveway. \"Dad's like the master of emergency situations. He'll have it under control.\"\n\"Yeah,\" Derek says, but it doesn't sound like agreement so much as dismissal. He's already thrown the car into park and turned off the engine, climbs out of the driver's seat without a look back.\nDad's already there opening the door as they jog up the front path, and he points Derek toward the stairs, says, \"He's holed up in Stiles' old room, first door at the top of the stairs.\"\nDerek says, \"Thanks,\" and then bounds up the steps three at a time.\nStiles shuts the door behind himself, catches his dad's eye, and sees pretty much everything he needs to see. He meets Dad's grimace with an exasperated sigh, and goes into the living room when his dad waves a vague hand in that direction.\nEmmy's sitting on the couch, her face drawn tight and her eyes rimmed in pink like she's been crying. She's unnaturally still and silent, like she's straining to hear any sound at all from upstairs. With human ears, there's not much to hear, just the indistinct and distant murmur of Derek's voice.\nStiles takes a second just to look at her, to see all the pieces of himself in her brown eyes, her lanky frame, her little square palms, her long fingers twisted together in her lap, her mouth that looks so serious when it isn't grinning. He often thinks it's unfair, how much of him is in her, that she didn't get more of her mother, who was easy-going and calm tempered and didn't share Stiles' tendency to sabotage himself.\n\"Hey, kid,\" he says, and drops down next to her on the couch. She doesn't even look up at him, actually ducks her head a little lower, so he knows his theory is dead-on, but sometimes being right isn't very satisfying. He doesn't pull her into a hug or ask her what she's done — he's got a lot of practice at wheedling information out of her without being accusing — and instead just waits for her to say or do whatever she needs to.\nIt only takes maybe a minute and a half, before she starts fidgeting like she's physically resisting the impulse to crawl into his lap. Her hands curl and fist over the edge of the couch cushion. She finally says, \"I didn't mean to scare him. Well, okay, I meant to scare him, but not scare him.\"\n\"You wanted to see what he looked like as a werewolf,\" Stiles says, and it's a question and a statement all in one, because he knows exactly how she feels. Exactly. He even asked Derek once, and got a flat no and a cold stare, spent that night tossing and turning and wondering if he'd completely fucked everything up. He guesses that's about where Emmy is right now, times ten.\n\"Grandpa said it's rude to ask, so I thought if it just happened like by accident, then nobody would be mad,\" Emmy says. He doesn't need to tell her where the flaw in her reasoning is — her voice is small, miserable, surprisingly contrite — though he wishes he was around to tell her earlier, before she did something she couldn't take back.\nStiles lifts his arm, casually slings it across the back of the couch, and Emmy's tenuous grip on her own control breaks; she scrambles into place against his side like if he isn't holding her she'll fly off into space. He wraps both arms around her tight enough to squeeze the breath out of her, and drops a kiss on the top of her head.\n\"Listen,\" he says. \"I get why you did it. And I think you're understanding now why it was a really wrong thing to do.\"\n\"I'm really sorry,\" Emmy says, and she sounds it too. She's crying, quiet and pitiful, clutching at Stiles' shirt. \"What if he doesn't ever want to talk to me again?\"\n\"Then you'll have to respect that,\" Stiles tells her. He tries to be gentle with his tone, but it probably doesn't work. \"But you made one decision for him already that you shouldn't have, so let's wait for him to decide for himself this time, okay? I mean, you guys are besties, right? He might be able to forgive you. But you let that happen on his timeline, not yours. You've got to let him decide.\"\n\"Okay,\" Emmy moans. The sniffling is seriously breaking his heart. He's pretty sure she's going to vanish into a pit of her own self-loathing if he doesn't distract her.\n\"You know, you never knew your uncle Scott before he took the bite,\" Stiles says. \"Most people didn't even know any werewolves back then. All the schools were separate, and the werewolves pretty much kept to themselves because the laws were so strict that they'd practically be sent to jail just for looking at a human funny. So when Scott was turned I wanted to know like... everything. And Scott didn't get along with his assigned werewolf mentor at the hospital — like, at all — so we did all these stupid things, trying to figure out everything for ourselves. Looking back on it, I'm kind of surprised he still likes me. Some of the things I came up with to teach him to control his shift were... definitely not approved techniques.\"\n\"Like what?\" Emmy asks. She squirms upright enough to look him in the eye, and frankly he doesn't like the look in hers.\n\"Yeah, I'm going to give you ideas, as if,\" Stiles says. \"The point is, you inherited my personality, you poor, unfortunate child, but Scott forgave me for messing with him, so there's hope, right?\"\n\"Scott's like your brother, he has to forgive you for things,\" Emmy points out, skeptically.\n\"He doesn't have to, he chooses to,\" Stiles says. \"That's the kind of thing that makes us brothers in the first place. You get it?\"\n\"Yeah,\" Emmy says. \"But what if—\"\nShe doesn't finish the thought, because Derek's on the stairs again behind them, and there's a second set of footsteps that means Ben's been coaxed out of hiding, too. Emmy takes the direct route, scrambles straight over the back of the couch — they're going to have words later about how furniture is not approved climbing equipment — and then seems to realize that Ben might not want her anywhere near him. She stumbles to an awkward halt in the space between the living room and the stairs, twisting her hands together and shifting from one foot to the other like she's going to explode.\nStiles just stands up and watches from a distance, and he sees his dad doing the same from the door to the dining room, on hand in case anybody needs him but keeping himself out of the way. Sometimes Stiles wishes he could be half the dad that his own is, but mostly he figures he's doing okay. Mostly.\nBen looks exhausted, his face still streaked with tears and his lip ragged, like he's been chewing on it but not quite mauling it enough for his healing to do anything about it. There's a matching set of tears at the knees of his jeans, like he curled his claws into them and held on tight. He's wearing a human face again, so whatever Derek said to him clearly worked to avert that particular part of the crisis, but the kid still looks like he's just had an hour-long panic attack. Stiles can relate.\nOut of all of them, Derek's the one who looks the most tense, and he actually puts a hand on Ben's back and nudges him forward with a sort of go-on motion.\nBen looks at Emmy, then looks away, his face screwed up like he's going to cry again. \"I'm really sorry I shifted like that,\" he says, \"and I promise it won't ever happen again, and—\"\nAnd Stiles can't let this go on. He's a law enforcement official. This is a horrible miscarriage of justice.\nHe doesn't have a chance to put a stop to it himself, though, because Emmy actually flings herself at Ben, wraps him up in a hug he doesn't really have a chance to decline — Stiles' list of things to have a talk with his daughter about are growing by the moment — and bellows, \"Nooooooo, me!\" in a voice that sounds kind of like a wounded wildebeest.\nStiles would really prefer a more well-reasoned apology, complete with a bullet-pointed list of all the things she's done wrong, why they were wrong, and how she's never going to do them again, but the kids have been developing a frankly disturbing level of brain-twin non-verbal communication powers recently. They seem to be doing okay with the kind of reconciliation that involves a lot of tears and wordless blubbering, so Stiles figures he won't get into the middle of a dynamic that apparently works for them.\nDerek doesn't seem satisfied with the result, though; he stares at the kids with a perplexed look on his face, and then he crosses the floor, takes in both Stiles and Dad with a glance, and says, \"Can we talk for a minute?\" in a tone of voice that's not particularly promising.\nIt takes a second for Stiles to say, \"Yeah,\" because he has to swallow down the sudden lump in his throat, because maybe Derek has decided it's for the best all around if they put a stop to things now and Stiles hasn't even seen his dick yet so that seems really unfair and also, basically, he just wants to keep Derek. Like, forever maybe.\nBut he keeps his cool — for a certain value of \"cool\" — and retreats with the other so-called adults into the kitchen.\n\"Look,\" Derek says, and he's wound tight, shoulders stiff, posture straight and almost defensive. \"I know this is a reportable incident, and I'm not trying to influence you, I'm just asking you—\"\nStiles has no idea what Derek is asking them.\nHis dad does, though. \"As far as I'm concerned this isn't an 'incident' at all,\" he says, folding his arms across his chest like he's daring Derek to argue with him. \"It's one kid making another kid cry. That's not an issue for law enforcement or the monitoring service or anybody else. The fact that one of them's a werewolf has nothing to do with anything.\"\nAnd oh, Stiles gets it now, but he doesn't get the other part of it. At all.\n\"You thought we'd report this?\" Stiles says, and if he sounds incredulous it's only because he is, because seriously, what the fuck. \"What, like Ben's out of control or something? He freaked out. My kid freaked him out. On purpose. Because she's a little shit who's too curious for her own good. I called that one, by the way. But I can't believe you'd... seriously, Derek?\"\nDerek's nothing but serious, though. His face looks grave as hell, and he braces himself with his arms against the kitchen island, like he could very well fall on his face without the extra support. \"It's one thing to let your kid hang around with a werewolf. It's just... usually another thing when the fangs and claws come out.\" He looks at Stiles' dad next, can't even meet Stiles' eyes, like he's already convinced himself this whole thing is over, that it's a foregone conclusion. \"But I appreciate your understanding, Sheriff. And thank you for looking out for him. I should really... I should get him home. He's worn himself out.\"\nStiles' dad nods, but he also reaches out, offers his hand, and Derek doesn't have much choice but to take it. \"It wasn't any trouble; you and your boy are welcome here anytime, son,\" Dad says, and then gives them both a nod and retreats into the dining room again, leaving them alone to work out the rest of their shit.\nAnd oh, they're working it out. Stiles isn't going to let this stand. \"So I was thinking.\"\n\"Stiles,\" Derek says, but he doesn't seem to know what to follow it with, because he just stops there, drops his arms to his sides, shoots Stiles a look that's simultaneously defeated and imploring, like he just wants to go and lick his wounds in peace.\nIt's ridiculous, because if anybody's going to be doing any licking of Derek's anything, it ought to be Stiles.\n\"I was thinking, since the kids were going to have a slumber party, and we were going to have our own slumber party, why don't we just combine forces? Take everybody over to your place and have one big sleep-over.\"\nDerek's eyebrows go up, but the tension in his spine eases a little, too, so Stiles is calling it a win.\n\"I know the sex has been called on account of traumatized children,\" Stiles hastens to add. \"But they could hang out in Ben's room and reinforce their freaky soul-bond or whatever they've got going, and you and I could engage in some above-the-belt activities, and—\"\n\"I'm not sure—\"\n\"—I just really don't want you to decide this is over because it's not, okay, I'm exercising my veto power.\"\n\"You think you have veto power for our relationship,\" Derek says, and he sounds completely unimpressed but also at least very slightly charmed.\n\"Hah, you just admitted we have a relationship,\" Stiles crows. He steps into Derek's personal space and it's gratifying the way it opens to admit him, Derek's body unfolding, posture shifting as if to welcome Stiles in.\n\"I guess you've got me there,\" Derek concedes, and he's the one who leans in, presses their mouths together in a soft, uncomplicated kiss.\n\"This is why you didn't want to show me, isn't it?\" Stiles asks, when they finally pull apart. \"Because it's another thing when people see the fangs and the claws, right?\"\nDerek sighs. \"Yes,\" he agrees, reluctantly.\n\"So show me,\" Stiles says, and it's a request and an offer all at once.\nIt only takes a moment, Derek's features rippling and shifting like there's something else beneath the skin coming out. When it's done, he's got a ridged brow, pointed ears, and a pair of serious, spontaneous sideburns.\n\"You're right,\" Stiles says. \"I'm afraid I can't date a man who thinks muttonchops are a valid modern fashion statement. Wait, why isn't it just a full beard? And where did your eyebrows go? And—\"\nDerek cuts him off by staging an invasion of his mouth, which is awesome. The fangs don't even get in the way like he thought they would, and Derek actually whimpers when he runs his fingers down the length of those pointed ears, which is promising.\nThey're still there five minutes later, necking like teenagers — or at least like humans, because Derek apparently also has control problems when it comes to holding a werewolf face during sexy times — when Emmy and Ben find them.\nBen says, \"Oh, gross,\" in a breathy tone of voice, like he's actually a little bit awed by how repulsive the sight of adults kissing truly is, and Emmy says, \"Dad,\" like he's the one who's done wrong today which he so is not, so he takes his time and gives it a little more tongue before he finally breaks away. He's breathing hard, and Derek isn't, which only makes him wonder exactly what it would take to make Derek pant like he's dying. He resolves to answer these questions later, for science.\n\"Okay, kids,\" he says, \"we're moving this party to Derek and Ben's place. Go grab your stuff.\"\nEmmy actually whoops, and she drags Ben away by the hand so presumably they're fine now, in the way that kids often are, arguments and injuries forgotten or at least forgiven with truly breathtaking speed.\n\"Don't think I've forgotten your promise,\" Stiles says, and hems Derek in with his arms while he delivers one last wet, deep, slightly pornographic kiss. \"This is only a postponement.\"\nDerek smirks, grabs two handfuls of Stiles' ass and squeezes, then smoothly disengages himself, sauntering toward the front door like he isn't a complete asshole. \"I never go back on a pinkie promise,\" he says, and Stiles has every intention of holding him to it.\nStiles wakes to crisp sheets, cool morning air, a warm, broad hand spread across his naked lower back, and the sinking feeling that something has gone horribly wrong.\nStill, he's not going to rush to conclusions. It could all have been a dream. He cracks his eyes open slowly, because he's pretty sure the obnoxious chirping of birds nearby means it's morning, and morning means daylight, which frankly he isn't prepared for at all. It's there anyway, though, ready or not; it's streaming in through the half-open windows, it's splashing against the neutral beige carpet, it's just creeping across the foot of the bed and making his toes pleasantly warm. He decides it can stay.\nEverything else is weird, though. Not his windows, not his carpet — way too clean to be his carpet — and not his bed.\n\"Tell me it was all a dream,\" he mumbles, face still half-buried in a pillow that smells like a fabric softener commercial. Derek did the laundry for him. He's like really certain it's love now.\n\"Tell you what was a dream?\" Derek says, his voice even raspier and sexier after sleep, and Stiles didn't even realize \"sexier\" was a possibility with him.\n\"Tell me I didn't actually fall asleep you on you before we could have the sex.\" Stiles turns his face a little more, actually buries it in the pillow because he's thinking about smothering himself. He already knows the answer. It's not pretty.\n\"It was a long day,\" Derek says, graciously. His hand flexes against Stiles' back and then starts moving, in low, widening circles at first, and then in long, delicious sweeps. \"Are you sore?\"\nStiles pauses to take stock. He moves his arms and they feel a little bit like they might fall off. His legs twinge. His back, when he tries to shift, advises against any action whatsoever. \"Yes,\" he says miserably. \"I wanted to be sore in other ways, Derek. Sexier ways. Where did I go wrong?\"\n\"I'll write you a list,\" Derek says, but there's something stupid and fond in his voice.\nStiles turns his head so he can look, because if Derek's voice is stupid and fond then his face is probably making a similar expression. He looks even softer and dopier than expected, though, in the warm light of morning. He's got laugh lines around his eyes and a lopsided grin on his face, and Stiles would kiss each of those things if he had the energy to pick himself up enough. Instead he just worms a little closer, settles his face impolitely close to Derek's face.\n\"Derek,\" he says, and it comes out in the kind of tone that really should preface a declaration of love, but what he actually finishes with is, \"give me a massage.\"\n\"So demanding,\" Derek replies, but it's not an actual complaint. He picks himself up smoothly, throws the sheet back from Stiles' body and settles himself in its place, his weight pressing Stiles' hips into the mattress, his hands already sweeping over the span of Stiles' shoulder blades. \"You think this is going to be how your life works now? I'm just here to give you massages and rub your feet and cook you breakfast?\"\n\"You're going to cook me breakfast?\" Stiles says, and he doesn't hold back the awe from his voice.\n\"No, I'm not going to cook you breakfast. The kids are already doing it, actually, I can hear them in the kitchen.\"\nStiles' alarmed, flailing attempt to spill himself out of bed is a completely involuntary reflex borne of panic and hard experience, but Derek anticipates it, presses a firm hand to the center of his back and keeps him pinned.\n\"Don't worry, Ben knows his way around a waffle iron, he won't let your daughter burn the house down,\" Derek says. \"Although I guess if you didn't want that massage after all...\"\n\"No, I'm fine, I'm good,\" Stiles says, and forces himself to still. \"If you stop I'll actually cry, it'll be embarrassing for everyone.\"\nIt's only partially hyperbole. Derek's hands are strong enough to snap him in two, but instead the pressure is just how Stiles likes it, and his back's already warming with the friction. Stiles groans his appreciation into the sheets, as Derek digs merciless thumbs into the grooves alongside his spine. Derek gives the world's most amazing massages, which is partially because the bulk of his medical training is in physical therapy and rehabilitation, and partially because everything he does is graceful, physical, unconsciously erotic. His massages are almost better than sex. Almost.\n\"I think I'm old,\" Stiles says, when the pressure eases up enough that he can take in a full breath again. \"I just seriously thought that massages are almost as good as sex. That means I'm old, doesn't it?\"\n\"That means I give incredible massages,\" Derek corrects. He effortlessly unravels a knot of muscle in Stiles' back, as if to prove it. \"And you're entitled to a little fatigue. You did spend most of yesterday moving heavy things.\"\n\"Heavy is relative, though, isn't it? You're not sore.\"\n\"I'm genetically blessed with strength and endurance,\" Derek tells him, and it's a toss-up on whether the smugness in his tone is real or just Stiles' imagination.\n\"Yeah,\" Stiles says, with a dreamy sigh. \"I know.\"\nHe does know. Intimately. The first time they actually managed to get down to the sex, it went on for hours. Stiles was a different kind of sore the next day. He also called Erica to get the number of a good yoga studio because he felt like developing flexibility and stamina would be important to this blossoming relationship.\nHe supposes it's paid off, too, because he's here, Derek's skin against his skin, and maybe he's paid a price in pain, but it's worth it. It's always going to be worth it.\n\"Hey, Derek,\" he says, when Derek's hands slow down and things move from massage to mindless petting.\nDerek says, \"Yeah?\" and leans down to kiss the corner of Stiles' mouth, lick the line of his jaw. One of his hands finds Stiles' hand, tangled in the sheets, and traces the shapes of the veins and tendons there.\n\"I live in your house now,\" Stiles tells him. \"You can't get rid of me. I'm going to be around all the time.\"\n\"Hmm,\" Derek murmurs, against Stiles' ear. \"We should've talked about this more before you guys moved in. I mean, I'm okay with having Emmy around all the time, but I was thinking more that you should stay out of sight and out of mind, when I'm not using you for your body.\"\n\"Oh shit, I was planning on using you for your body,\" Stiles says, in a false-horrified voice. He squirms around onto his back so he can kiss Derek's ridiculous mouth and get his hands all over Derek's everything. \"There's a definite problem with our communication.\"\nHe curls one hand over Derek's hip, slips his fingers beneath the band of the boxer briefs that are in his way. His other hand drifts down Derek's chest, pauses to tease a nipple, traces the familiar shape of those literally inhuman abs, then goes lower, finds the hot shape of Derek's cock beneath the cotton.\nHe figures that's pretty clear, as communication goes, but he still says, \"Hey, we missed out on gross sweaty post-moving sex last night, so I propose we do first-morning-as-cohabitants sex right now.\"\nDerek smiles against Stiles' mouth, kisses him again, and then carefully peels his hand away from the genitalia it's fondling. \"Emmy's coming up the stairs,\" he says. \"Breakfast is ready.\"\n\"This is gonna be so great. That kid's going to have to make some serious adjustments to cope with a parental figure with actual superpowers,\" Stiles says. He tangles his fingers together with Derek's, brings them both down to his own dick, and hollers loud enough that Emmy can hear him through the door. \"We'll be down in an hour, after we're done with the sex! Save us some food!\"\nEmmy's voice is muffled through the door, but he can still make out, \"Just for that, I'm going to eat all the waffles!\" and then she literally runs away, pounding back down the stairs.\n\"Parenting tip for you,\" Stiles says, smugly, as Derek takes the hint and starts moving his hand over Stiles' briefs. \"Over-sharing is a natural child repellent.\"\n\"Mm, not really interested in talking about parenting right now,\" Derek says, and then he does a very persuasive thing with his mouth, and Stiles is forced to agree that they have more urgent matters to discuss."
}