{
    "id": "8910193",
    "url": "https://archiveofourown.org/works/8910193?view_full_work=true",
    "author": [
        "GinForInk"
    ],
    "title": "Hercules",
    "rating": "Explicit",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "방탄소년단 | Bangtan Boys | BTS"
    ],
    "relationships": [
        "Jeon Jungkook/Kim Taehyung | V"
    ],
    "characters": [
        "Kim Yongsun | Solar",
        "Jung Wheein"
    ],
    "additional_tags": [
        "Top Jeon Jungkook",
        "Bottom Kim Taehyung | V",
        "Strength Kink",
        "Muscles",
        "Pretty Tae",
        "Panties",
        "Overstimulation",
        "Multiple Orgasms",
        "Prostate Massage",
        "Riding",
        "Fluff",
        "Implied/Referenced Homophobia",
        "Teasing",
        "Light Masochism",
        "Praise Kink",
        "Kink Negotiation",
        "Wall Sex",
        "Manhandling"
    ],
    "language": "English",
    "series": "",
    "published": "2016-12-19",
    "completed": null,
    "words": "11,593",
    "chapters": "1/1",
    "comments": "363",
    "kudos": "19,234",
    "bookmarks": "4,013",
    "hits": "327,954",
    "summary": "<p>Taehyung forgets his strength kink until Jungkook picks him up during a group project meeting.</p>",
    "notes": "<p>This fic has been translated into Russian on <a href=\"https://ficbook.net/readfic/6033793\" rel=\"nofollow\">ficbook</a>.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>And they get an A on the project and become the cutest couple on campus.</p>\n<p>Come visit me at <a href=\"https://ginforink.tumblr.com\" rel=\"nofollow\">tumblr</a><a rel=\"nofollow\"></a> and .</p>",
    "text": "“And I’ll be putting you in groups now,” the professor said, and Taehyung could have sworn she looked right at him, which meant he’d probably be stuck with the calmest, most productive, most boring students instead of the pothead in the corner and the girl with the really crazy teal hair. When last he’d been left to assemble his own group, there’d been tears by the end of class, five college-students bouncing off the walls on a noticeable sugar high, and expo-marker mustaches on half the class.\nHe fidgeted with his pen, trying to figure out how to effectively entangle it in his hair, and by the time he refocused on class, one pen hanging from his bangs, everyone was getting up into groups and he’d completely missed who his teammates were.\n“Um, Karla…”\n“I’m sorry, did someone mispronounce ‘Dr. Jacobs?’”\n“Dr. Karla, dear, which group am I in?”\nShe fixed him with a very tired glare, and Taehyung grinned back. He’d earned a perfect score on every assignment but the last group project, and so she was reluctantly patient with him. “You’re with Wheein, Solar, and Jungkook doing the Hercules myth.” He loved the Hercules myth. Besides being a damn good Disney movie with a killer soundtrack, something about the lion’s coat, the heroic deeds, the fucking muscles on all those old sculptures got him a little hot.\nBut fuck. He had no idea what to make of any of those teammates, the two highly intelligent but wildly personable girls that always sat in the front, and Jeon Jungkook, one of those silent, back-of-the-room jock types that Taehyung loved to fantasize about when he was drunk enough. Jungkook especially tended to draw his eyes in class, long legs sticking out from under his slouch, lots of straight, white teeth visible even when he wasn’t smiling, and over-flowing with the captivating kind of masculinity that was both quiet and gorgeously confident. \nBefore they could even get all together, Solar had a group chat, meeting place, and schedule, as well as the materials they were responsible for during the first meeting. Taehyung felt the odd lightness of realizing he wouldn’t have to carry this group project by himself. \n“Got all of that?” She said. \nWheein smacked her pen on the table. “Got it.”\nTaehyung exchanged a wide-eyed look with Jungkook, and they both shook their heads at once. Jungkook shook his head a little more to get his bangs evenly across his forehead, and Taehyung locked onto that surprisingly adorable tick like a bloodhound with a scent. \n“I’ll email it,” Solar said. “See you both tomorrow.”\nTaehyung bounced and grinned, already revving up for a good, organized project. He hadn’t been on a team with people who cared in quite a while. Jungkook nodded and murmured, “Thanks,” in his steady, quiet voice. His eyes flickered to Taehyung under his bangs, and then awkwardly away. Fucking cute.\nAdorable as he was, Jungkook strode down the hallway like he owned it, shoulders squared, knees wide, hands in his pockets, completely at odds with the way he’d ducked his head when they talked, the way he spoke shortly and softly when the teacher called on him in class. Out of the corner of his eye, he saw Solar and Wheein jostling each other and giggling as they watched Jungkook walk down the hall.\n \nThey gathered in a corner of the library on the floor like permitted obnoxious amounts of noise. Solar immediately took charge, which put Taehyung at a loss, since that’s what he usually did. Her leadership style was all organization, allotting an equal chunk of work to everyone and directing the discussion. \nWithin five minutes, Taehyung could tell that she and Wheein had pretty much already finished the project down to the last detail with the exception of actually doing it. Jungkook kept glancing at his phone and sighing quietly, slouching further in his chair, knees spread wide, one Timberland boot propped up on the central footrests. He had his hair up in a beanie, and god damn he looked good. \nTaehyung tried to propose an examination of Hercules through talking about what he’d be like in a modern setting, and Solar shot it down immediately. “We’re looking at the cultural context that the Hercules myth served, what values he represented.”\nTaehyung slumped. “But everyone does that. That’s easy. We could get more creative with it and talk about what he’d represent in our society and use that as comparison. And it would be fun.”\n“I don’t know,” Wheein said. “That seems kind of, well, trivial?”\n“How is that…trivial. That’d be…” his voice got quieter and quieter, back caving as he sank lower in the seat, pulling himself smaller and staring up from under his lashes, “so much fun.” \nBoth girls leapt up out of their seats and dove on him. “I’m sorry! It’s fine! That sounds super cute, I mean fun, just stop pouting!” Always worked like a charm. Jungkook mouth twitched upwards a little as he watched from behind his phone, eyes warming.\n“I’m so serious though,” he whined from under Solar’s armpit. “Solar, I know you’ve got all this shit planned out and all that, and thank you so much. You’re super responsible. But can we start over for just a minute? Jungkook hasn’t said a single thing since we sat down and it's not really a group project if it's all you. We need to talk this out.”\nNow it was Solar pouting, but Taehyung would not be swayed. From behind their cuddle puddle, Jungkook looked very caught in the headlights, like he couldn’t imagine actually being required to participate. \n“First off, how much does everyone know about Hercules? Is everyone at least familiar with this material?”\nSolar and Wheein were both Greek mythology buffs. Taehyung had seen every Hercules movie ever produced, plus he’d paid attention in high school literature. Jungkook didn’t even know his Greek name was Heracles. “I’ve seen the movie with The Rock,” he said uncertainly. “I think we talked about it in AP Lit last year for like, one day.”\n“Last year?” Wheein asked. “Are you a freshman?”\nJungkook nodded reluctantly, phone tapping against his thigh. \n“Do you play sports?” Taehyung asked. “You look like you play sports.”\nJungkook brows drew together, confused. It really had nothing to do with the conversation, so Taehyung didn’t blame him. “Yeah. Soccer, I think. Some weightlifting. Track. I used to play basketball.” \n“Jack of all trades? You work out a lot?”\n“Yeah, kind of.”\nTaehyung saw the girls’ expressions change from indifference to interest, slight smirks sliding onto their faces, eyes slimming just a little and running up and down Jungkook’s body. You're welcome, he thought. Jungkook didn’t notice, too busy staring at Taehyung as if hoping for an explanation, or at least more conversation, which didn’t happen. \nFor Jungkook’s sake, Solar, Wheein, and Taehyung went into story-telling mode, retelling the myth and how exactly it related back to Greek culture and the hero archetype, a little bit about motifs. Jungkook nodded blankly, mouth hanging slightly open, two front teeth just visible under his arching top lip, adorable. \nTaehyung got to work convincing the group to do something ridiculous with the project. “That’s what everyone’s going to have in their projects. People have looked at this myth a million times in relation to the culture. We could do what we did right now in front of the class and get a pretty good grade. Easy and Boring. Last time I did a group project in this class we made it super weird, had the time of our fucking lives, and scored a B+, and that was with a couple people on the team not helping at all. I think we can do better this time.”\n“B+?” Solar said, looking alarmed, at the same time that Jungkook murmured, “I could really use a B+.”\nThey both looked at him. “Really?”\n“I’m not doing very well. I’m considering dropping it to keep my GPA safe. I’ve gotta pass this class for my literature requirement but I have to get good enough grades to play soccer when the season starts.” \nTaehyung was pretty sure he, Solar, and Wheein had the highest grades in the class. It occurred to him that it might have been Jungkook that Dr. Karla was trying to help when she made this group, and not himself.\n“Then don’t you think we should play it safe?” Solar said. \nHe shrugged. “I’ll struggle no matter what. Just let me know what I need to do.”\n“See, that’s why I think we need to make it weird. If we do this on just book-smart analysis, the three of us are fine, but Jungkook gets left in the dust. If we make it weird, we’re all equally challenged—”\n“Except you,” Wheein said.\n“Oh I don’t know. It’s hard work being this unpredictable.”\nJungkook cracked the real grin that Taehyung had ever seen from him, all pretty white teeth and crinkly eyes, lips curling mischievously up at the corners. Both ladies did the thing again, the slight smirk and wandering eyes. Jungkook remained oblivious, eyes sinking back to his phone, even as the smile remained on his face. Taehyung snickered. \nThey began talking about Hercules in the context of Greek society to try and get a feel for what they could do, and halfway through, Jungkook shrugged out of his hoodie. \nHe was wearing a t-shirt with the sleeves cut off, riding low over his ribs. His incredible, sculpted arms crossed, forearms thick across his thin shirt, which clung to the hard lines of his chest. Solar prompted Taehyung for the answer to a question he’d just ignored.\n“I’m sorry. I can’t possibly be expected to concentrate with Jungkook wearing that shirt. I’m a little wet.”\nHe expected, from the disinterested jock, maybe an expression of alarmed surprise, at best a confident laugh, at worst a look of disgust. He’d gotten worse from that type before. He didn’t expect the wide-eyed surprise, and then the sweetest bashful smile he’d ever seen on any human ever. He glanced up at Taehyung under his lashes and murmured, “Sorry. I’ll cover up again,” and pulled the hoodie back over his shoulders like a cape. \n“Hold on a minute, just because Taehyung can’t handle it doesn’t mean the rest of us should be deprived. Get those back out here,” Wheein said. \nJungkook shook his head, still smiling with his head down. “I’m not gonna be a distraction.”\nThey had no good ideas. “Famous sports figure?”\n“Nah, they had those in ancient Greece. Athletes and stuff. They got a lot more glory and honor than Hercules got.”\n“Mercenary then?”\n“Those only exist in action movies.”\n“Bullshit. Those totally exist.”\n“And we know nothing about them.”\n“It’s myth,” Jungkook said. “Could we compare it to modern fiction, like James Bond or something?” \nSolar and Wheein nodded thoughtfully. “That’s not a bad idea.”\n“That’s not superhuman enough, though,” Taehyung said, lying down and stretching out across his couch. “Hercules is the son of a god. He’s not like James Bond. He’s incredible. He’s got to be physically a step above everyone around him, like Superman. But, like, less than Superman. Batman?”\nHe looked at Jungkook, who was staring blankly at Taehyung’s midsection, eyes glazed. Taehyung glanced down and saw that his shirt had ridden up under his woolen sweater, revealing a strip of tan skin, the dip of his hips, and the edge of his navel. And, oh wow, Jungkook was staring at it. He stretched a little further, arms flat on the couch over his head, knees raising. \n“How much,” Jungkook said, snapping his eyes away from Taehyung like he’d been paying attention the whole time. Maybe he’d just been zoning out. Were his cheeks a little redder than before? “Does everyone know about the WWE? Professional wrestling and all that,” he asked.\n“John Cena!” Taehyung yelled, leaping up from the the couch. “John Cena is Hercules!”\n“I was thinking more The Rock,” Jungkook said. “He’s part of a wrestling dynasty. He has a lot of family in the business, so the son of gods thing can come in there. He’s the people’s champion. He’s suitably super-human. The powers-that-be within the fictional wrestling universe put him up to some pretty impossible odds sometimes, and now he’s one of the god-like legends.”\n“It’s fucking perfect!” Taehyung yelled. “Oh my god, we could have a wrestling match in class!”\n“The fuck?” Wheein said, “No, Tae, that’s kind of stupid and probably not allowed. Or safe.”\n“This is going to be so good.”\n“Tae, get ahold of yourself.”\n“Can you wrestle, Jungkook?”\n“I, um, I could probably learn pretty fast.”\n“Could you be Hercules? Can you pick people up and throw them around or something?”\nJungkook shrugged out of his hoody and lurched forward, shoulder ramming right into Taehyung’s hips, arms closing around his body, and then he stood, Taehyung hooked over his rock-hard, bulging shoulder. He yelped. The ground looked very strange from that angle, straight down Jungkook’s back and over his butt. His hands scrabbled in Jungkook’s shirt and Jungkook jostled him into position. \nTaehyung felt one heavy hand on his hip, the other hot of the backs of his thighs, horribly wonderful. Jungkook swung around to face the girls, easy as anything. Taehyung felt his voice rumble through his back, “Is this strong enough?” like it took no effort at all, and his eyes slammed shut, dizziness rocking through him, the punch of arousal swelling in his cock warring with the gravity rush of blood down into his head. \nIn high school, before Taehyung’s growth spurt really hit, the boys in his class would pick him up and carry him around to show off their strength. Because he was small, crazy, and looked like a kid, it didn’t feel gay to them yet. They did it to impress the girls, to be hot shit, and somewhere along the way his brain had irreparably linked being carried to being sexy. \nIt was a kink he’d forgotten he’d had. Nobody had carried him in years, not since he’d grown almost a foot. Not since Kevin from band class had caught on to the way Taehyung’s cheeks blazed red when he picked him up, the way his breath came short and how he squeezed his legs up closer to his chest. Kevin had thrown him into a pile of chairs like he was a rabid animal. Nobody had really been all that sympathetic about the cracked ribs. \nJungkook was more gentle than Kevin, more self-assured. Stronger. Taehyung felt off-balance and too hot, small in the best way. He made a sound like a scared puppy, a breathless, high-pitched, strangled yelp of a moan. The girls squealed and Jungkook giggled, showing off, basking in their attention as Taehyung clung to his back and gasped. Jungkook felt him slip a little and bounced him up, lifting him easily, so easily, by the hips, and resettled him closer to his neck. His hand slid warm and tingling wonderfully over his ass, and gripped there, squeezing, holding him steady like he didn’t even notice. Taehyung’s hands shook.\nThrough the wild wash of arousal pounding across his system, painfully intense, Taehyung dimly realized he was panting hard, legs kicking uselessly, hands fisted in the fabric of Jungkook’s shirt. He could see Jungkook’s tan skin where it disappeared down into his boxers before is vision started swimming. His dick hardened quickly against the firm pressure of Jungkook’s hard shoulder. \nTaehyung could tell Jungkook felt that awkward bump that shouldn’t be there when he started struggling, because the moment he felt the incredible pleasure of rocking his dick down, even accidentally, a small, high sound squeaked out of his mouth, and Jungkook dropped him back onto his feet so fast it felt like falling. His knees caved. Jungkook caught him and he hung there for a moment, gripping Jungkook’s arms and staring up into his sparkly, dark, incredibly wide eyes, and then his hard dick knocked up against Jungkook’s thigh. He gasped, eyes flickering shut in horror. \nJeon Jungkook, who had begun to seem like the cutest guy on the planet, knew Taehyung had just gotten super hard in under fifteen seconds just from behind manhandled. What a weirdo.\n“Taehyung?” Jungkook said, gravelly and quiet, “what—”\n“I’m sorry,” Taehyung whispered, wrestling his body up onto his feet and out of Jungkook’s grasp. He sat down on the couch and pulled his knees up to his chest, heart pounding. Jungkook hesitated a moment, then flopped back into his seat. \nThe girls stared back and forth between then in cautious silence. Taehyung felt his face burning brighter and brighter. \n“Okay, we should get back to planning. I like the wrestling thing. Maybe we could reinvent Hercules’s quest as a wrestling story-line? And replace Greek social values and the way they understood these myths with more American themes? Any input, Tae?”\nTaehyung cleared his throat. “That sounds good.” His voice crackled quietly anyway. \nJungkook shifted uncomfortably, and a seething pool of shame condensed in Taehyung’s stomach.\n“That’s it? Anything else? What just happened? Are you okay?”\nTaehyung nodded. “I’m sorry. I’m just…never mind. I’m fine.”\nSolar tried to get the planning back on track. She and Wheein outlined a basic storyline for ‘Lion Cena,’ the heavy-weight, Hulk Hogan-esque wrestler, son of John Cena come to claim his father’s legacy, cruelly opposed by the CEO of the company and forced to battle through all his best wrestlers, a series of corporate hoops, and an actual bear in order to get a shot at the Championship belt. Jungkook said nothing for twenty minutes, arms tight over his chest like he wanted to cover himself, and embarrassment gnawed at Taehyung until he thought he might cry.\n“I’m gonna go,” he said eventually, quiet enough that Wheein had to ask him to repeat himself. “I’m going,” he said, a little louder, “I feel pretty useless right now. Can we meet up later?”\n \nHe skipped the next group meeting. He’d rushed out of the first one so fast that he’d left his notebook behind, which Jungkook wordlessly handed back to him in class the next day, expression unreadable. Taehyung quickly averted his eyes.\nTaehyung couldn’t take part in the class discussion. He went back to his room shaky and unhappy. When the group meeting rolled around that afternoon he didn’t go, just curled up on his bed, anxious and tired, guilty for not going, relieved for not being there, embarrassed by how terribly obvious he was being. Jungkook might tell Solar and Wheein what had happened. They’d treat him like a freak for the rest of the semester. He’d gotten so tired of that.\nThe bed felt too short, with his head on the pillow, his toes hung off the end. He rolled over and curled up. He wanted Jungkook wrapped around his back, lips on his hair, telling him that it was okay. Pathetic. Jungkook, who never wanted anything to do with him. Poor Jungkook.\nTaehyung had gotten a single-person room for a reason. The extra five-hundred dollars a year for a room to his own was worth every penny on nights when he just needed a couple hours alone without the hassle of sexiling a roommate with no second person to use an excuse. Sometimes he just wanted to curl up with a hot pink vibrator and silk panties and just feel soft for a little while behind a locked door. \nHe wanted that now. He wanted more than that. He wanted strong arms and a deep voice, and he wanted to be pretty for someone. He got his silk, lilac boy-shorts out of his dresser, tight and soft on his body, and hugged a pillow to try to chase away the fidgeting discomfort gnawing at the warmth licking steadily up from the silk on his skin. This usually ended in him painfully hard with two fingers in himself and his face flushed and hidden in the pillow. He only need to wait. \nIt didn’t come. Jungkook stayed in his mind. The silk hugged him uselessly. The bed was so warm if he stayed still but too cold if he stretched out. \nHe woke up with sunlight angling sleepily down through his curtains and someone knocking on his door. He’d only been asleep thirty minutes. He had just enough awareness to pull a shirt and some jeans on over the lilac silk, though he took a minute to pet it affectionately first, and then opened the door. \nIt was Jungkook, glorious and broad-shouldered slouching, and so lovely that Taehyung’s breath fizzled out of him before he could help it. He was already several paces down the hall, but he whipped around the moment Taehyung’s door opened. Taehyung actually jumped, just a little jolt when their eyes met, and Jungkook tensed up like he’d scared a small animal, hands open reassuringly. “I’m not going to grab you again. Don’t worry.”\nTaehyung mouth went dry, nervous shivers racing down his arms. Jungkook looked so fucking good in dark green flannel. He shouldn’t be in front of Taehyung’s door. Why would he be there? “Hey, um, sorry. I know I missed the group meeting. I’m sorry. I don’t know why I didn’t come. I couldn’t. I’m sorry.” He cringed into the doorframe as Jungkook took a couple tentative steps closer, hands still up cautiously. “And sorry about, you know, making it weird the other day,” he said, voice fading out.\nJungkook shook his head. “Not a big deal. You’re fine. I’m so sorry if I made you uncomfortable. I should’ve asked before, you know, throwing you over my shoulder like a corpse. You seem kind of messed up. I’m really sorry.”\nTaehyung stammered, then shrugged. “It didn’t bother you at all? I thought...” He knocked his head gently against the doorframe. “Wow, I’m just pathetic.”\n“Tae, no.”\n“I’m sorry. I’m really sorry. I know how I am. I have these kinks and I try to hide them because they’re weird, and when things happen sometimes I get embarrassed. And then apparently I hide in my room instead of facing my problems.”\nJungkook shuffled his unnecessarily big boots around for a minute, then pulled Taehyung into a very unexpected hug. They were the same height, but Taehyung felt awkwardly tall, too big in his body. It was still so warm, so sweet and protective, like Jungkook was trying to wrap his shoulders around him. “Stop looking so defeated. It sucks. I don’t get it. You’re fine. What was the kink that I got you with the other night?”\nTaehyung had melted into his arms, breathless, taken aback by his brashness. Jeon Jungkook was hugging him and he could feel the hard rise of his chest pressing against his own. It wasn’t fair. “I think I like being carried. It’s a strength thing, I think? Manhandling? I don’t know. I didn’t mean to drag you into—”\nJungkook locked all his muscles, turning into a hard wall around him. Taehyung shivered. “Oh yeah. That’s,” he got a lung-full of Jungkook’s scent, laundry detergent with a little bit of heady cologne and something human and dark. “Fuck.”\nJungkook’s cheek brushed so lightly against his. “That’s not weird. That’s cute as fuck.”\n“It is?” Taehyung squeaked. Jungkook just hummed and kissed the corner of Taehyung’s lips. Taehyung’s knees shook, chest constricting hard. He hadn’t been kissed in ages, not by someone who mattered. \n“This is okay, right?” Jungkook murmured. “You like me, right? Am I reading this wrong?”\nTaehyung choked, clinging to his shirt, fizzy excitement climbing up his throat. “God, you dumb jock. You’re so hot. Why didn’t you tell me you kissed boys?”\nJungkook giggled. “Didn’t think it mattered. Didn’t expect you to be interested. You’re all so much smarter than me.”\nTaehyung pulled Jungkook’s face away for a moment. “You’re not stupid though.”\n“I make shit grades.”\n“You’re impressive in other ways. Please kiss me again.”\nJungkook smiled happily and kissed him again, a soft peck to the left side of his bottom lip, arms still latched around Taehyung’s back.\nTaehyung pressed back with a groan, lips sloppy and needy. “Come in here,” he said, pulling Jungkook in and shutting the door. Jungkook shouldered him up against the wall, forearms flat behind his shoulders, boxing him in, lips and tongue slick and soft against Taehyung’s mouth.\n“I don’t know much about you,” Taehyung murmured.\n“Business major,” Jungkook said.\n“Of course you are,” Taehyung said. “I’m a psych major.”\n“You’re so precious.”\nTaehyung wiggled happily against him. “You’re amazing,” he sighed. “You’re so fucking hot. Oh my god. When you picked me up. Fuck. You’re so strong.” \nJungkook’s hands slid under his clothes, thumbs petting his stomach, palms sliding over his sides, fingers dipping over Taehyung’s ass, testing.\nHe gasped, jittery with want. Jungkook’s hands did drew back off his jeans, one running up over his chest, the other tight around his back again. \n“Sorry,” he murmured, \"I keep forgetting to ask. I'm bad at this.\"\n“Sorry? You're fine. Keep going.”\nJungkook smiled against his lips and murmured, “Tae,” crushing in closer as Taehyung panted and clung to his wide biceps, chest pressing desperately upwards into Jungkook’s hand where his fingers left pulsing trails over his skin. \n“Please,” he murmured. “Please. Please.”\n“Are you begging already?” Jungkook asked, sounding surprised.\n“Fuck, it’s been so long and you’re so hot. Jungkook, please.”\nJungkook pulled away for a moment, yanked the beanie off his hair and ran a hand through it, looking intently at Taehyung, who sagged, panting against the wall. Jungkook was there, in his room, lips red and wet and fucking kissing him, dark hair swept up off his forehead and eyes hard as they took Taehyung in, panting and needy against the wall of his own bedroom. His knees got a little shaky. “You want this?” Jungkook said. “It’s a little sudden.”\nBlood pounded through Taehyung’s head. His lips tingled. He could still feel the brick-wall feeling of Jungkook’s chest against his. “Yeah. I want this.”\nJungkook lurched forward and reached down, sweeping Taehyung suddenly up into his arms, bridal style. His weight settled, several feet off the ground, the heat of Jungkook’s thick chest against his side. Jungkook walked him towards the bed, but stopped when Taehyung squeaked out a long, airy sound of happiness.\n“Tae?”\nTaehyung gulped, searching for something to stall Jungkook and prevent him from putting him down. “You know that old Gone with the Wind poster? Where she’s in a red dress and there’s a bunch of fire and a hot guy? Scarlet O'Hara? I feel like her.” \nJungkook giggled, swaying back and forth a little, rocking Taehyung in his arms and letting him go limp. He could feel his own weight, feel the way Jungkook’s arms locked to keep him up, and his breath picked up, dick achingly hard already, head swimming with hormones. \n“Fuck. I’ve never read it. I haven’t even seen the movie. Mom had the book, and when I was younger I stared at that picture for hours. I—fuck. I wanted—” He covered his face with his hands. “Why am I telling you this?”\nJungkook curled his arms and pulled him up close, impossibly stronger. Taehyung whined pitifully, the sour ache of arousal twisting in his gut. “Please. Jungkook.”\n“Hands off your face?” Jungkook said, and his voice only shook a little from the effort of holding Taehyung up. “What’s wrong?”\n“I’m weird,” Taehyung said, voice shaking more than Jungkook’s. \nJungkook lay him gently on his bed, leaned down and kissed him again. “It’s cute, Tae. Don’t worry about it. You’re weird but I really like that.” Taehyung fidgeted as Jungkook pushed his shirt further and further up his chest, choking and moaning with every touch of tongue. Jungkook reached a nipple and Taehyung arched up off the bed into his mouth, searing pleasure pulsing down into his dick, and he wondered if he could come in his pants right here under Jungkook’s mouth. His thighs tensed together anxiously, struggling for friction.\n“Please.” He felt like he’d been laid out on an alter, body arching and twitching against Jungkook’s lips as he stood over him. \n“Tae, you have no idea how pretty you are, do you?”\nTaehyung’s brain had already shut down all its processing skills. “Huh? Ah!”\nJungkook’s lovely lips popped off Taehyung’s nipple. “You’re the best part of that fucking class, you know. You’re so gorgeous,” Jungkook’s mouth found his again. Taehyung mumbled wordlessly against his lips, hands coming up to cover his face and stop the room from spinning. “And so fucking cute,” Jungkook giggled, kissing his forehead.\nJungkook drew away, and Taehyung heard some loud clunking, like heavy boots hitting the floor, and then Jungkook climbed up onto the bed over him. “Tae.”\nTaehyung took his hands off his face and found Jungkook’s toothy smile hovering above him. \n“And you’re so funny. I can’t take naps in that class because I don’t want to miss you doing something weird.”\nReally? This beautiful man had been eyeing him all semester? And he hadn’t noticed? “Jungkook,” Taehyung said, voice already raspy, “Have you had a crush on me all semester? And you never said anything?”\nJungkook snuggled down against his chest, weight heavy and tantalizing down on his hips, across his chest, crushing him into the mattress. Taehyung looked down his chest at Jungkook’s happy face. “I’m actually pretty shy, especially about approaching guys, and you’re a hot, smart upperclassman with lots of friends. So no. I wasn’t going to say anything. But then the group project happened and even though I freaked you out, you seemed so turned on, so I figured it might happen if I hadn’t accidentally hurt you. I was really worried.”\nTaehyung buried his hands in Jungkook’s hair, who smiled bashfully. “Jungkookie, you’re fantastic.”\nJungkook’s low hum rattled against Taehyung’s chest, and he scooted back up, body propped over his, and pressed his lips back to Taehyung’s. “Can I take you on a date after this?”\n“Fuck yes. You’re so hot.”\n“Glad you think so.” He shifted uneasily on top of Taehyung. “I don’t want to force this too fast. Should we stop?”\nTaehyung’s dick needed way too much attention. He hadn’t had sex since the first month of freshman year. Jungkook was too close and too warm. “No, no. Please fuck me.”\nJungkook huffed, a little surprised. “Yeah. Hell yeah. How do you want this?”\n“I don’t care. Take charge.”\nJungkook’s gaze turned just a little evil. He sat up over Taehyung’s hips and unbuttoned his shirt, let it slip slowly down his arms. His chest came into view, a vacuum-packed, flat, even six-pack, trim waist, solid pecs, sculpted shoulders, the most mouth-watering dream of a body Taehyung had ever seen up close. He flexed proudly. “Figured you’d like this.” Taehyung moaned before he could help himself, just a soft, breathy sound that he couldn’t control. Jungkook chuckled.\n“Ugh, who even are you, showing up in my room with those,” Taehyung groaned, grabbing for his abs and only reaching the tops of his thighs, fingers brushing lightly at his jeans. Jungkook smiled and slid even further away, lowering himself over Taehyung’s bared chest and kissing down the center line, over his navel.\n“No, no, please come back.”\n“You’re so skinny, Tae.”\n“Don’t eat enough,” he breathed back, “I never have time.”\n“That’s no good,” Jungkook said, mouthing at the sensitive spot beside the crease of his hip that made Taehyung squeeze his knees together and squirm, eyes shutting tight. “I’ll have to feed you.” He pulled down Taehyung’s jeans as if expecting them to slip right over his slim hips with no resistance. \nThe harsh denim scraped over entirely too many inches of bare skin and Taehyung remembered, at the last second, the lilac panties. He had time to suck in a breath through his teeth, and then he felt cool air on his thighs, and his hands were back over his face, and Jungkook sat there for a moment, frozen. Taehyung heard him suck in a breath through his nose and then blow it all out in a whoosh. “Holy shit,” he said quietly, “What the fuck.” \nTaehyung’s entire body felt red-hot, heart pounding with shame, legs trying to pull out from under Jungkook so he could hide himself, and then Jungkook’s thumbs stroked down the dips on either side of his dick, and Taehyung realized his arousal had only spiked, dick painfully hard, as sensitive as if Jungkook already had him down his throat. Taehyung felt soft breath through the silk, then the gentle press of lips to the head, and his back and thighs tensed painfully as he reflexively tried to force closer. “This is fucking me up, Taehyung,” Jungkook murmured. “Holy fuck, do you shave your legs?”\nTaehyung could only grunt back, the swirling shame intensifying. Taehyung wondered if anyone had ever passed out from embarrassment.\n“Is this why you wear long pants all the fucking time? Do you like being feminine?”\nTaehyung giggled, and forced out, through the lock in his throat, “Girls are pretty. I like being pretty.”\nJungkook honest-to-god snuggled up to his dick, rubbing his cheek against the soft silk, and Taehyung’s thighs tensed again, breath fast and rough in his throat. “You’re beautiful.”\n“Oh fuck,” Taehyung squeaked.\nJungkook hummed and traced his thumb around Taehyung’s dick through the silk, the lightest tease, and his whole body seemed to vibrate. Jungkook sat up and pulled his pants the rest of the way off, then rested one of Taehyung’s bare legs over his shoulder and kissed gently down it, hand running so softly over his smooth, waxed skin, and Taehyung stared, arms still tight over his chest, hands over his face, the back of his thigh against the hard angles of Jungkook’s chest, which he still needed to touch. \n“Jeez,” he muttered, “Jungkook, I don’t know what to do.”\nJungkook bit the inside of his knee gently, and Taehyung’s dick twinged nearly painfully with arousal. He gasped and rubbed it. Jungkook gently shoved the hand off. “You have no idea,” he ran a hand down his thigh, “what you do to me. Don’t touch yourself; that’s my job.” Taehyung scoffed weakly, but tangled his hands in the sheets anyway to make sure he didn’t. “Good boy,” Jungkook murmured. \n“You’re gonna kill me,” Taehyung whined.\nJungkook smiled. So many white teeth. His hands were back on the silk panties, thumbs stroking thoughtfully. “I’m trying to figure out what to do with you.”\n“Please hurry. Everything you say makes my dick hurt.” \nJungkook smiled. “Rule number one: Hands stay above your shoulders, no matter which position we’re in, got it?” \n“Rules?” Taehyung said, hands raising slowly over his head, eyebrows screwed up in confusion. \n“Good boy,” Jungkook murmured again, and a moan crackled out of Taehyung’s throat again. He was beginning to sweat from the force of his full-bodied blush.\n“Any more rules?” he asked, voice trembling, remembering what people had wanted from him in the past. “Should I not talk?”\nJungkook shook his head. “Please talk all you want. I love it when you talk. You have a beautiful voice and you say funny things.”\nTaehyung felt one of the nervous knots in his stomach unravel. “You really know how to seduce a man. Keep the compliments coming.”\n“You look beautiful with your hair off your forehead.”\nTaehyung looked up like he could actually see his forehead, straining his head backwards against the pillow and then stopped and pouted, embarrassed. Jungkook giggled at him. \n“You’re so cute.”\nTaehyung hesitated, determined that his face did, in fact, count as being above his shoulders, and then hid his face in his hands.\n“I’m gonna add your face to that rule,\" Jungkook said, tugging his hands away. \"Don’t cover your pretty face.”\n“What are you going to do if I break the rule?”\nJungkook smirked. “I don’t know. Make you wait longer? Do you ever wear those panties around during the day?”\nTaehyung sucked in a breath and shook his head. Even now, the smooth, cool feeling kept a constant stir of sexy down on his skin. He couldn’t help but get hard with that feeling. He’d never dared wear them while out in public.\n“Okay. You don’t follow my rules, and you’re wearing them to class.”\n“Oh no,” Taehyung said, voice strained and high. \nA giant grin split Jungkook’s face. “Fuck, you’re so cute!” He fell on him, wrapping his arms around Taehyung’s chest and nuzzling into his neck. Taehyung giggled in surprise and wrapped his arms around Jungkook’s head to hold him there. It took everything he had not to bring his hands below his shoulders to feel all up Jungkook’s torso. He could at least kind of grind up against Jungkook’s crotch in tiny, tiny jerks of his hips, silk catching on denim. He gritted his teeth and whined. \n“Okay, baby. I got you.” Jungkook sat up and tugged Taehyung’s shirt the rest of the way off, and then kissed over his shoulders, sucked marks into his neck, bit his ears, hands stroking warm and just on the breathtaking side of ticklish over his narrow sides. His big hands covered so much, thumbs parallel to his fingers on both sides of his body. Taehyung felt small and trapped, hands flopped helplessly onto the pillow, twitching fitfully, tiny, quick moans falling from his lips, and Jungkook would not let up. \n“Please, please, please, please, please—”\nJungkook giggled quietly. “So responsive,” he said.\n“It’s been,” he broke off to moan desperately when Jungkook flicked his tongue over a nipple, “It’s been so long since anyone touched me.” \nJungkook finally sat up and looked Taehyung in the face. “How do people keep their hands off you?”\n“I don’t really make myself available,” Taehyung said, “People grab me in clubs sometimes. I’ve fooled around a bit, but it never feels like this.”\nJungkook hugged him around the waist and pulled him upright in his lap as if he weighed nothing, and that swirled right down into Taehyung’s dick. Precome stuck to his stomach. His hands hovered cautiously in the air on either side of his head. “You can touch me, you know,” Jungkook said. Taehyung put his arms carefully on Jungkook’s defined shoulders, traps wide under his palms, and then ran his shaky fingers up into his dark hair. Jungkook’s eyes slipped closed, broad hands still on Taehyung’s hips. He smiled softly as Taehyung scratched his scalp. \n“Your lips curl at the corners when you smile,” Taehyung said. \n“My friends call me bunny,” Jungkook said, opening his eyes, round and dark and sparkly, “Because of my teeth.” \nTaehyung’s mind shorted out a little. “Oh god, please fuck me.”\n“You got lube?” \n“Under—um. It’s…well,” tingling embarrassment burned up through his chest again. His voice got very soft. “It’s under my pillow.”\nJungkook raised an eyebrow, leaned down, one arm clutching Taehyung easily to his chest, and grabbed the bottle, nearly empty, out from under the pillow. “Do you use toys or fingers?”\nTaehyung felt like he might die. “Fingers usually. Vibrator takes too much effort to clean.”\n“Okay,” Jungkook said, and leaned up to tug Taehyung’s lip out from between his teeth with his own mouth. “And you keep everything under your pillow?”\nHe nodded. Jungkook lightly pinched the head of his neglected, sensitized cock through the silk. “Stop worrying about it. You’re fine. That’s sexy as hell.” He pulled the hem of Taehyung’s panties off his cock so he could massage the head, and Taehyung moaned happily. Jungkook’s eyes fluttered away from Taehyung’s, drifting closed. “You’re soft, Tae,” he murmured.\n“Don’t stop.”\n“I’m taking these off,” Jungkook said, lowering Taehyung back onto the bed and stripping the panties straight up off his long legs. Taehyung watched the silk travel slowly up his smooth skin, and then it was just Jungkook’s denim against the skin of his ass, Jungkook’s strong chest braced against his thighs again. Taehyung felt very light-headed. \n“Holy fuck, you wax?” Jungkook said breathlessly, thumb tracing around the hairless base of his dick, the smooth skin around his balls. He almost covered his face, remembered the rule, and let his arms flop around fretfully down beside his head. He needed to come so bad. His brain asked if he might have a humiliation kink, and he made a small noise of frustration and horror. \nThe lube popped open, and Taehyung got a Pavlovian rush of need into his already hyper-sensitive dick. “Please make me feel good,” he whined.\n“Don’t just say shit like that,” Jungkook murmured in awe. Taehyung felt a line of sweat drip down his neck. “Spread your legs, babe.”\nTaehyung dropped his knees wide open and pulled them up, baring himself completely, open, soft, and vulnerable, everything he hid laid out for Jungkook to do whatever with, and he’d never let himself be this open for anyone before, had never had someone ask for it. Jungkook shifted back on the sheets and pushed one finger, easy as anything, up into him. “You’re loose. You do this a lot?”\n“Did it last night,” Taehyung whimpered, “More, please.” \nJungkook pressed his lips to the head of Taehyung’s cock, pink tongue poking out and flicking under the crown. He slid in a second finger and curled them deep and hard, hooking right against his sweet spot like it wasn’t a big deal, like Taehyung didn’t fight for every brush whenever he fucked himself on his long fingers, like he didn’t struggle to find the right angle over his vibrator every fucking time. A deep, desperate, startled, loud moan ripped out of Taehyung’s chest. Jungkook hummed in satisfaction, and Taehyung grabbed the headboard so he didn’t reach down and grab his hair. \n“Good boy,” Jungkook said again, lilting and pleased. His fingers circled harsh and slow, and pleasure bloomed heavy between his ass and the base of his dick, building quickly. Taehyung whimpered so loud he was sure the room next door could hear him. \nJungkook started sucking lightly, fingers thrusting slowly, sliding heavily along his prostate, and Taehyung moaned with each press, sensitivity dialed up to ten and pressing closer and closer to coming. “Are you sure I’m not hurting you?” Jungkook asked after a little while, voice squeaky.\n“Huh?”\n“I’m better with girls. If it hurts, just tell me.”\n“Wha—why would it hurt?”\n“You look like you’re in pain. It sounds like it hurts.”\n“Feels so good, Jungkook it feels so good. Nobody’s done this to me since some guy freshman year, and that felt awful and he was such a shit afterwards and I haven’t done it since. I’ve just been really unlucky until right now and my head’s, like, fucked up, and I’m oversharing. I’m sorry. Why’d you stop? Please keep going.” \n“Tae?” He sat up a little, “Are you sure you’re okay?” His fingers were still tight against his prostate inside him, a dull pressure keeping him desperate and wanting. \n“Please, Jungkook, please, please, I need it. Stop fucking teasing just—” Jungkook pulled out and shoved three fingers back in, Taehyung’s words broke on a deep, shuddering gasp. \n“Pretty Tae. So pretty,” Jungkook whispered, fingers brutal over his prostate, lips soft and light against his thigh. The pressure built and built, aching heat and intensity, halfway to pain, overwhelming and beautiful and too good. Jungkook’s tongue travelled down the crease of his thigh, across his hairless skin, nipping and sucking. The pleasure rushed, a severe extra feel-good tension, and then Jungkook’s mouth met his balls, his fingers flicked fast inside him, and Taehyung felt the tell-tale switch from tension to incredible pleasure. \nHis eyes snapped open. “Kook! Coming! Fuck!” Jungkook blinked up in surprise as Taehyung thrashed and came weakly over his stomach. Taehyung wondered if his skin would cook itself under his blush, if his lips would crack from his shame.\n“Wow.”\n“I’m sorry I didn’t warn you. I’ve never come from that before. I didn’t know that would happen.”\n“Like, from just something in your ass?”\n“Yeah.”\nJungkook flicked his hair out of his eyes, blinking off into Taehyung’s room for a minute, thinking. “We can stop, if you want.”\n“Give-give me a minute. I don’t want to leave you hanging.”\n“You’re good,” Jungkook said, sitting up. “I’m going to go get some water. I’ll be right back.” He cleaned him up first with the tissues conveniently placed beside his bed. “You can move your hands down for now if you want,” he said, scratching the back of his neck shyly. \n“You’re so cute,” Taehyung whined. “You’re a freshman, right?” He nodded. “Oh my god. Adorable. Eighteen? Nineteen?”\nHe looked flustered, like he didn’t know what to do with being called adorable. “Just turned nineteen.” \n“Ugh. Cutie,” Taehyung said. He still hadn’t taken his hands down from over his head. “Water!”\n“Okay. I’m going.” He grabbed a cup off Taehyung’s desk, smell-checked it, and then walked out into the hallway still shirtless. Whoever was walking down the hallway needed to be grateful.\nWhen he came back, Taehyung had stretched out on his stomach on the bed, head lying on his arms. “Can I suck you off?” He asked before Jungkook had even closed the door. \nJungkook’s eyes widened, cheeks flushing as he stared. “Of course. Anything you want.”\n“Oh I could get used to that,” Taehyung murmured. Jungkook looked quietly pleased with himself. \nHe handed Taehyung the water and watched him drink it, eyes on Taehyung’s neck when he swallowed. He unbuckled his belt, eyeing Taehyung down through his eyelashes, brows harsh, jaw set, pecs flexing slightly as he pulled his belt open. “What’s this?” Taehyung asked, “Dinner and a show?”\nJungkook grinned and let his pants fall down his long legs, his wide, solid, thighs. His dark blue briefs fit snugly around his hips, clung to every inch of his cock. Taehyung grabbed one thigh and dragged him closer, hoping Jungkook didn’t feel the way he was shaking. His palm ran stutteringly up Jungkook’s firm ass and then around from to pet his washboard abs, smooth, soft hills under his fingers. “Will you pick me up again, sexy?” he murmured, face hidden shyly in Jungkook’s hip, lips half an inch from his dick, glancing sideways through his lashes to see Jungkook’s shell-shocked face.\n“Right now?”\n“Whenever its convenient,” Taehyung said, and kissed him through his briefs. “Mm, you fill these out.” \n“Fuck,” Jungkook murmured. “How do you keep getting sexier?” \nTaehyung smiled happily against his crotch and then tugged him into bed. “Hands above my head now?” \n“Sure.”\nTaehyung left his hands on Jungkook’s hips and scooted down to keep mouthing at Jungkook’s dick, tongue tracing teasing patterns over the fabric. Jungkook huffed and stripped his underwear off himself. “Aw, you’re no fun,” Taehyung murmured, and swept his tongue up Jungkook’s dick to lick heavily around the head, and then immediately swallowed him down as far as he could. \nJungkook’s thighs tensed. Taehyung flattened his palms as a warning, but his thin forearms looked frail next to those thick, thick thighs. If Jungkook’s hips decided they were going somewhere, Taehyung would just have to choke. He shivered a little, bobbing more slowly now, hands wrapping under Jungkook’s thighs to grab his butt, deliciously firm. Taehyung wanted to bite it.\nTaehyung hadn’t had any real, intimate, bedroom sex in the past two years, but he’d done this more than a few times, found some guy in a party late at night, gay, bi, or just plain curious, and gotten on his knees in the bathroom, in some stranger’s dark bedroom, behind the science building halfway home, staring up from under his bangs, letting them grab and manhandle and moan, and he’d fall asleep warm and excited that night knowing he was pretty enough, good enough to drive someone crazy.\nJungkook sounded crazy enough. Even from his angle, Taehyung could see two white teeth under his upper lip, see the twitch in his arms, his hard pecs and perky nipples. “You look like someone drew you,” Taehyung murmured.\n“What?” Jungkook gasped, hands grasping Taehyung’s shoulders.\n“You look too perfect to be real. Did someone make you out of marble and bring you to life?” Jungkook breathed deep, chest swelling with air, muscles stretched like a canvas over his ribs. Taehyung sucked him down and his hands tightened on his shoulders, whining with every breath. “Want you to fuck me,” Taehyung whispered the next time he came up for air, cheeks burning, unable to look up to meet Jungkook’s eyes. \nJungkook moaned. “How the hell did I get here?”\n“Hm?”\n“Sorry. I’m in shock. Ignore me. This is so good.” \nTaehyung giggled around Jungkook’s dick and worked it lower, brows furrowing as he gulped and opened his throat, humming slightly to ground himself. Jungkook’s back arched beautifully, breath labored, every beautiful swell in his torso in sharp relief. The hands on his shoulders never pressured him, just tightened when he tensed and scratched soothingly. \n“I’m gonna make you come again,” he said when Taehyung took a break to tease and his back had flattened out on the sheets so he could breath. \n“You better,” Taehyung said, and flinched at his gravelly voice, way too low and rough. “Sorry.”\n“Sorry why?” \n“Voice.” He played with the crown, tongue flicking, lips squeezing. \n“What’s wrong with your voice? You sound so hot.”\n“It’s so low though,” Taehyung said, and couldn’t keep the self-conscious whine out, just a little bit hurt. He pulled away, eyes stuck on Jungkook’s abs, and Jungkook sat up, grabbed him under the arms, and hauled him easily up to lie across his chest, like lifting a baby. Taehyung’s dick twitched hard against the crease of Jungkook’s hip. \n“Your voice is so beautiful, especially like this. It doesn’t need to be high to be pretty. I love listening when you talk.”\n“The first guy I was with in high school covered my mouth halfway through sex because he wanted me to shut up,” Taehyung blurted. Jungkook’s entire face twitched in shock, mouth comically struggling to form words. \n“I’m sorry.”\n“Fuck, Tae. Don’t apologize to me.”\nTaehyung dropped his head onto Jungkook’s shoulder, embarrassed. “I just wrecked the mood. I’m sorry. Please keep going.”\n“Your voice is beautiful though.”\n“He didn’t think so,” Taehyung muttered, “And he didn’t like the way I kept talking or something. Said I said really stupid shit.” His stomach burned from embarrassment, and not the sexy kind. “I’m destroying the mood. I’m sorry.”\n“Tae, if I were any happier to be even talking to you, I’d probably actually get high off it. There’s pretty much nothing you could do to make me uncomfortable at this point. I’m here for you. If you want to quit sex right now and talk about, I don’t know, diarrhea or something, it will still be the best day of my college career so far. Except maybe midnight taco night.”\n“Speaking of diarrhea,” Taehyung giggled, “I fucking LOVE midnight taco night,” which was the easiest way around dealing with how wildly his heart was pounding, giddy, pleased giggles fighting their way out of his chest.\n“You’re on par with midnight taco night. Even just being in your room, talking to you with your sexy blowjob voice, is on par with midnight taco night.”\n“Well then imagine how much actually fucking me is going to blow midnight taco night out of the fucking water,” Taehyung said.\n“You’re still up for that?”\nTaehyung ground his rock hard dick into Jungkook’s hip and moaned loud and low, pure relief and need.\n“Yeah yeah,” Jungkook breathed. “Okay. Hands still over your shoulders? Good.” He sat up, grabbed the lube up off the blankets, and then resettled up against the wall, Taehyung’s knees spread across his waist. Taehyung braced his hands against the wall to keep them up, and Jungkook dumped lube all over his fingers. “You’re pretty stretched, right?”\nTaehyung nodded. He felt Jungkook’s wet fingers brushing around his hole and arched, knees spreading slightly, head falling back, forcing himself to relax. The fingers sank into him, stretching hot and heavy, walls opening. He stayed deep for a minute, fingers stroking unerringly over his prostate, lighting sparks up into his stomach again. “How do you do that?” Taehyung gasped. “I can’t ever find it.”\n“Good angle,” Jungkook said. “Practice. I’m even better with girls. You could practice on me sometime, if you want.” Just the thought of fingering Jungkook sent Taehyung into another round of wild shudders. Jungkook’s free hand stroked soothingly along the gentle curve of Taehyung’s waist, thumb pressing gently into the small swell of his tummy. His fingers drew out and then came back with three, and Taehyung groaned, arms tense against the wall. \n“Do you like girls more?” Taehyung said when he could breath.\n“Sometimes,” Jungkook said, “I really like you.”\n“Am I pretty like a girl?” Taehyung asked, and flushed at that question in his way too deep voice.\n“You’re boyish,” Jungkook said, fingers thrusting easily in straightforward pushes that had Taehyung’s mouth hanging open, soft moans bouncing out of him, high in his mouth with every press. “And feminine. Yeah. You look so good in panties. Could I put you in full lingerie sometime?”\n“Oh god yes,” Taehyung murmured. “I’m way too shy to buy that on my own though.”\n“How’d you get those panties?”\n“Ordered them online.”\nJungkook’s strokes were changing, speed constant, but the pressure became more intense, hard and present, prostate near stinging with oversensitivity. Taehyung realized he was curling his fingers, drawing wide spirals inside him. When he looked down, he could see the entire span of Jungkook’s body fit between his legs, a little less defined with how he hunched against the headboard, but the forearms between his legs bulged, veins running along the surface.\n“So good at this,” Taehyung said, hoping he didn’t drool right on Jungkook’s chest.\n“Thanks.”\nTaehyung’s hips were working on their own now, shy little twitches against Jungkook’s hand, and he slowed, made Taehyung chase it. “Please,” Taehyung whispered, staring down at the bulge in the front of his briefs, stretching the fabric out. His dick throbbed. “Get your goddamn cock out.” \n“Be nice. He’s shy.”\nTaehyung groaned and bounced faster. \n“Oh shit. Condom,” Jungkook said.\n“I will ride you bare at this point,” Taehyung said.\n“No way.”\n“Second drawer down on my dresser. You should be able to reach one.” \nJungkook took his hand away entirely, still dripping with lube, and yanked the dresser drawer open. The box sat just near enough for Jungkook to grab, and Taehyung sat and twitched fitfully, aching and clenching and cold. Jungkook managed to yank his briefs off, and his dick, red and hard, bounced against his stomach. He slid the condom on as Taehyung squirmed, and then looked up for permission. Taehyung answered by trying, with determination, to sit on it.\n“Okay, okay! Jeez! Hold still!” Jungkook, with one large hand gripping his hip and the other on his own dick, guided Taehyung down onto the tip, and then grabbed him by the hips and pulled him irresistibly down. \nJungkook’s dick wasn’t even as big as the biggest thing Taehyung had ever shoved up his ass, but the stretch had him gasping with the lingering oversensitivity, the sheer warmth and give to it, the way he didn’t control what it did to him. He couldn’t even move. Jungkook’s hands trapped him, vice-like on his slim hips, so he couldn’t get away from feeling ever inch sink steadily in. He tried to open his eyes. Below him, Jungkook’s arched again the headboard, throat bared, stare deadly sexy, focused and hungry like a snake. Taehyung’s eyes slammed shut again. “Careful. Don’t hurt me,” he whispered.\n“I won’t. I’ll take care of you.” He moved Taehyung’s hips in tiny circles on his dick, fingers digging into his skin, only a thin layer of padding between that and bones, hands covering so much space. His hand twitched against the wall and almost went down and grabbed his dick, but didn’t. Jungkook kept up the slow circles. He pressed against his walls and stretched his hole in the most achingly delicious way, the tingling pulse from his first orgasm still a soft edge in the pleasure in his dick now.\n“Oh, god,” Taehyung whispered, “This is so…it’s so—ah!”\n“Don’t do this very often?” Jungkook murmured. \n“Not since freshman year,” Teahyung gasped. “Some guy I really liked found me at a party. He fucked me on the railroad tracks on the walk home.” Jungkook slowed so he could speak. “Not enough lube. Scared of trains. Rocks and splinters everywhere. Talk about bad at sex. He was pathetic.”\nJungkook laughed. “That sounds awful.”\n“It was,” Taehyung said, snickering. “He sucked! And then he wouldn’t text me back. Made fun of me in public whenever I was around. Bragged to his friends. Told people things about me. Couldn’t look anyone in the eye for weeks.” He trailed off, realizing that the dick in his ass had gone completely still. Jungkook had that shocked, horrified look on his face again. “I’m sorry. That wrecked the mood again, didn’t it?”\n“Fuck the mood. Are you okay? Is that why you don’t hook up with people often?”\nTaehyung sighed and used the moment to shift on his knees, resettle the weight a little. “I’m fine. I’m still bitter about it, obviously, but I’ve worked through it. It’s the reason I usually don’t let people in quickly anymore. Can you keep fucking me?”\nJungkook blinked at him for a moment, obviously gauging if he should continue. “I’m different?”\n“You’re so hot I don’t care,” Taehyung murmured, and then backtracked when Jungkook looked a little hurt. “I’ve been feeling lonely. You don’t give off the same vibe. You’ve been so sweet. I trust you.”\nJungkook gave him an absolutely dazzling smile. “Hang onto my shoulders.”\n“Huh?” He grabbed Jungkook’s shoulders. Jungkook wrapped his arms around Taehyung’s lower back and sat up straight, dick jamming hard inside him. After a little bit of graceful scrambling, Taehyung’s back hit the wall, Jungkook’s carrying him a couple feet up off the bed with his arms under his knees, dick still inside him. Jungkook shifted his knees on the sheets and adjusted his arms, jostling Taehyung’s legs, and Taehyung realized he was about to get fucked against the wall.\nHe gasped at the same moment Jungkook began pumping his hips again, the new position driving him in so much deeper. Jungkook held him up against the wall because he could, strong arms locked under his legs, his weight pinning him down, open, trapped, taken, and so warm and wanted. “More, more, please, Kookie, please!”\nJungkook breathed raggedly in his ear, hips working in smooth, tight circles that punched his dick in deep, sliding hard over his swollen prostate. Jungkook had his entire body weight trapped between his arms and the wall, carrying him like a toy, spread out and willing. Moans ripped out of his chest with every hard thrust, rattling hard against the inside of his ribcage, but he couldn’t hear them over the blood rushing in his ears. \nJungkook murmured right into his ear and he didn’t bother understanding, too focused on the intense ache pulsing into him, the pleasure burning up his dick. Taehyung’s head jerked back and hit the wall. His dick brushed against Jungkook’s abs with every thrust, back stuck with friction, bed rocking, body taught and twitching. His hair trailed into his eyes. \n“…beautiful. You’re so beautiful. Tae, you should see yourself.”\n“Jungkook!” he sobbed.\n“Baby? Princess? You good?”\n“Can you…harder?” he squeaked. Jungkook grunted and hiked him further up, arms bulging as he lifted. Taehyung yelled in pained happiness as his back scraped up the wall and his thighs stretched over Jungkook’s arms. Jungkook had room to really pump now, longer, faster strokes slamming in, tantalizingly close to his prostate, just a teasing note with the fullness keeping him breathless and writhing. Taehyung’s hands dug harshly into his hard shoulders. \nTaehyung swore he was getting altitude dizziness, breath coming short, arousal stinging from oversensitivity. He loved the right-after too-much feeling of post-orgasm, often kept his vibrator in a bit to long, kept playing with his dick as much as he could stand to as it softened, but had never been able to force himself into fighting past it and just torture himself like this, but it felt so absurdly good to have someone else do it.\n“Can you come for me, baby?”\n“Came earlier,” Taehyung gasped. “’S hard. Hands? Can I-hah! Fuck. Use my hands?”\n“No,” Jungkook growled. \n“Ah, fuck you.” Taehyung squirmed, trying to bounce back down on his dick, make it harder and faster. His thighs hurt too much. His abs scrunched uncomfortably, Jungkook still in total control of his body, and damn if that didn’t feel even better. “Can’t. Kookie, please. Please!”\nJungkook lifted him off the wall, hands on his lower back, and tipped them carefully back onto the bed, Taehyung’s dizzy head on the pillow as Jungkook’s arms flexed and took his weight. He kept Taehyung’s ass tipped up on his lap, legs hooked over his shoulders, low and close enough to drip sweat onto his chest. Taehyung shivered.\nHe could pound in even harder now, all his weight thrown into a machine-steady rhythm. Taehyung’s hands flopped on the pillow beside his head, and Jungkook grabbed him by the wrists and held him down. The world became aching thighs, bruising wrists, electric tightness deep between his hips, the desperate pleasure in his dick, consuming and good, painful and wonderful, black and soundless. Jungkook said something, voice vibrating along his neck where his lips were pressed. Taehyung didn’t hear. \nThe punching pleasure in his gut faltered, pressure squeezed his painful wrists, and then became still, a slight twitching and pulsing warmth inside him. Taehyung remembered where he was and opened his eyes. Tears blurred his vision. Jungkook was still, head down on Taehyung’s chest, hands loosening around his wrists. “You came?” Taehyung whispered.\nJungkook nodded. “Sorry. Gonna pull out in just a minute.”\n“Stay in me, please. Feels so good.”\n“I can’t make you come like that.” \nTaehyung whined. “Just give me a handie or something.”\nJungkook shook his head and slowly pulled out, sitting up sluggishly and letting Taehyung’s legs down. His hips popped painfully, over-stretched hips sharply sore, distracting him from the clenching, shuddering emptiness between his legs. He growled out a crackly, monotone, annoyed note of pain.\nJungkook giggled. “Shh, I got you.” He continued to slowly stretch Taehyung’s achy legs out, lowering his mouth to Taehyung’s cock, sticky and weeping with precome. Taehyung gripped the pillow, wrists still stinging pleasantly. Jungkook massaged the crease of his hips for a long minute while nuzzled sweetly up to his cock, kissing gently, each touch sparking wild need into his core.\nTaehyung gasped. “Stop teasing. Touch me, please. Fuck, do something. I need something, anything, please more, please, Jungkook don’t you dare do this to me, you ass.”\nJungkook lifted him and turned him easily on his stomach. He pulled his creaking hips up off the mattress, propping his knees up under him, man-handling him like he was made of air. “Oh, fuck,” Taehyung wheezed. \n“Shh, its okay. I got you,” Jungkook murmured, and Taehyung cut off the deep whine squeezing out of his chest. \nFingers pushed back into him with a soft, wet noise, and Jungkook unerringly pressed into his prostate. Taehyung felt it right up in his teeth. His back bowed hard, trying to move down and away, thighs trembling. Jungkook began a quick, casual circling around his prostate, pressing hard. Taehyung felt his large hand curl around his dick and jerked into it. \n“You’re drooling all over your pillow,” Jungkook giggled. Taehyung managed to crack his eyes open, still blurry and teary, and glared back at Jungkook as he stuck his tongue out and licked the pillow. \nJungkook snickered and pressed down. Taehyung gasped, eyes slamming shut. His body shuddered. He felt seconds away from coming, the wonderful pressure of Jungkook’s hand fighting the awful intensity on his prostate, but he wasn’t, couldn’t get there yet, and then the hand on his dick let go, and Taehyung’s hips jumped, searching for it. \nJungkook was giggling. He poked Taehyung’s tongue. “Babe, get your tongue back in your mouth.” Taehyung huffed and dragged Jungkook’s fingers closer, tongue flicking between them, drawing swirls along the undersides of his long fingers and into the top of his palm. “Fuck,” Jungkook whispered as Taehyung licked faltering patterns all over his palm, matching the slow, sultry pace of the fingers inside him.\n“That,” Taehyung said, taking his mouth off, “Back on my dick. Now.”\n“You’re so needy,” Jungkook said breathlessly, hand sliding wetly back onto his dick, as ordered, and Taehyung gasped and thrust awkwardly into it with his aching hips. \n“I have a high sex drive and no one to help, so yeah,” Jungkook’s hand began a slow slide, and Taehyung’s words trailed off into a heartfelt whine, “Yeah, I’m needy.”\nJungkook softly kissed the dip of his spine. “I’ll take care of you, baby. I promise.” And that felt so good with the strong fingers in his ass, the firm grip around his dick, the broad shoulders hovering low over his back. Taehyung hummed happily, wiggling his butt just a little.\nThe fingers inside him finally sped up, breaking apart the last of Taehyung’s self-awareness, blinding pleasure dragging him in and strapping his body down. He felt ready to burst, trembling lines of stinging arousal racing through his body. He could feel his body tightening up, coiling like a spring, struggling to let go, arousal so heavy it hurt.\nHe came like a cork popping, one second an absolute heaven of tension, and the next a wave of sensitivity and pleasure so powerful his vision went white behind his eyes, throat closing. His knees gave, squeezing together and slipping out from under him. Aftershocks shuddered through him. He lay still and let shivers shake through him for a while, dick trapped between his body and Jungkook’s hand pinned to the mattress, fingers still trapped in his ass, the squeezing pressure just what he needed as a come-down. \n“You okay?” Jungkook asked, voice shaky. Taehyung grunted. “Can I take my hands off?”\n“Uh-uh.”\n“Tae. I need those.”\nTaehyung pressed his hips down further, and another couple quick shocks of pleasure left him gasping. Jungkook’s fingers twitched involuntarily and Taehyung jerked again. \nThey stayed like that, Jungkook kissing his back, hands carefully still, until Taehyung whined, the oversensitivity getting to be too much, and then he pulled his fingers out quickly, like ripping off the Band-Aid, and lifted Taehyung’s hips up off his other hand. Taehyung rolled onto his side and curled up, getting his breath back. His head spun. The room felt suddenly cold now that he was lying sweaty and still on the sheets.\n“Jungkook?”\n“Hold on. Finding something to clean up with.”\n“Later. Come back.”\n“I have jizz all over my hand, Tae.”\n“I’ll lick it off,” he whined, “Come back.”\n“Got the tissues.” He heard some dim rustling, getting louder, and realized his hearing had gone out there for a little while. \n“Think I almost fainted,” he muttered as Jungkook’s weight dipped the mattress and a tissue wiped along his jaw and across his lips. \n“You drooled all over yourself.”\n“Ugh, I’m so gross.”\n“You’re really sexy, actually. Like, holy fuck, I’m semi-hard again and it's only been ten minutes. My dick hurts. You are absolutely shameless.”\nTaehyung cracked his eyes open. “I’m not though. I almost died of embarrassment, like, five times.” He tried to move his legs apart so Jungkook could get at the lube smeared all over him, but Jungkook grabbed it and manhandled him easily.\n“Don’t move. I’ve got it.”\nTaehyung sighed and relaxed, let Jungkook clean him up as he melted sleepily into the bed. “Do you still wanna date me?” he murmured. \n“Yeah.” Jungkook said after a moment, turning one of Taehyung’s bruising wrists over in his hand. “Do you still want to date me though?”\nTaehyung opened one eye. “No way,” Jungkook’s soft lips fell open, sparkly eyes widening in panic. “Fuck, don’t make that face. I’m totally kidding.” \nJungkook looked like a cherub when he pouted. “I didn’t come here for sex, you know.”\n“You can come here for sex any fucking time you want. Holy fuck. I’m never going to be able to use toys again. You’ve ruined me. But on a more serious note, please take me out to dinner. Actually, fuck dinner. Stay in and study with me. Come to the trampoline park with me this weekend. Meet all my friends.”\nJungkook melted in against his side. “I’m going to date the shit out of you, Kim Taehyung.”\n“Kiss me,” Taehyung whispered, and Jungkook’s lips pressed onto his immediately, hungry and careful, a hand cupping his jaw. One strong arm slid under his back and drew his entire body up against Jungkook’s. He moaned into the kiss, hands finally, finally running hungrily over Jungkook’s chest. “It’s so appropriate that I’m doing a project on Hercules with you.”\n“I’m not that strong,” Jungkook giggled, “but thanks. I’ll carry you any time.”"
}