{
    "id": "899930",
    "url": "https://archiveofourown.org/works/899930?view_full_work=true",
    "author": [
        "supernope"
    ],
    "title": "nothing else but us right here",
    "rating": "Mature",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "One Direction (Band)"
    ],
    "relationships": [
        "Harry Styles/Louis Tomlinson"
    ],
    "characters": [
        "Harry Styles",
        "Louis Tomlinson",
        "Liam Payne",
        "Zayn Malik",
        "Niall Horan"
    ],
    "additional_tags": [
        "Kid Fic",
        "Teacher AU",
        "Single Dad Louis",
        "primary school teacher harry",
        "mentions of past louis/eleanor while louis was closeted",
        "gratuitous aquarium scenes",
        "Fluff"
    ],
    "language": "English",
    "series": "",
    "published": "2013-07-27",
    "completed": null,
    "words": "35,313",
    "chapters": "1/1",
    "comments": "523",
    "kudos": "10,605",
    "bookmarks": "3,725",
    "hits": "343,923",
    "summary": "<p>Louis sighs and gives himself a mental pep talk as he smooths his jumper down over his hips. He can do this. He can resist the draw of Harry Styles, because he is a responsible, mature adult, and as much as he wants to tangle his fingers in that mess of hair and map those ridiculous tattoos with his tongue, he does not want to get his daughter’s favorite teacher fired.</p>",
    "notes": "<p>Huge thanks to <a href=\"https://goddamnitharold.tumblr.com/\" rel=\"nofollow\">Michelle</a>, Paula, and <a href=\"https://alwayseven.tumblr.com/\" rel=\"nofollow\">Loey</a> for their help with this thing, and an extra special, massive thank you to <a href=\"https://onewasturning.tumblr.com/\" rel=\"nofollow\">Kazi onewasturning</a>, without whom this fic literally would not exist. This was pretty much entirely plotted out in tumblr asks, and credit for more than half of the plot goes to her! ♥</p>\n<p>I should not have to ask this, but PLEASE DO NOT RE-POST MY FIC ANYWHERE. If I find out that my fic has been re-posted to any site, I will report that person to the site for plagiarism, whether credit was given to me or not.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Somehow I managed to write kidfic without all that much kid in it, oops. Anyway, I hope you guys enjoyed it and if you want to come chat with me/have questions/whatever idek, I am <a href=\"https://supernope.tumblr.com/\" rel=\"nofollow\">supernope</a> on tumblr, as well! ♥♥♥</p>",
    "text": "“Em, you have ten seconds to get in here and sit down at the table, or you’re going to school without breakfast.”\nEmily stomps into the kitchen, bottom lip pushed out into a pout, and Louis sighs. She’s got dark hair and bright blue eyes, a sharp chin and a heart-shaped face, and even when she’s being rotten, Louis loves her so much his chest aches with it. Despite her sulk, Emily clambers up into her booster seat and picks up the cup of chocolate milk Louis had set out for her.\n“Why are you pouting?” Louis asks as he pours himself a bowl of cereal and settles in across from her.\nEmily sighs, like Louis’ asked her the most obvious question in the world, and says, “I don’t want to go to school, Daddy.”\n“What? Yesterday you were so excited! You wanted me to wake you up two hours early, just so you could pick out the perfect outfit.” Emily rolls her eyes, and Louis makes a mental note to thank Lottie personally for that habit. She doesn’t say anything, though, so Louis leans across the table and takes her hand in his. “Why have you changed your mind?”\n“I don’t know anyone,” she mumbles, chin tucked down against her chest so she can’t meet Louis’ eyes.\n“Well, that’s rubbish.” Her head jerks up at that, though she quickly darts her eyes away and stares sullenly out the window as Louis continues, “Robbie from next door is going to be in your class, and so is Bella from swimming lessons. And I’ll be there with you for a little while, meeting your teacher and making sure you’re having a good time. Hey.” He squeezes her hand gently and waits for her to meet his eyes. “I promise, if you don’t like school, we can find you a different one. But you have to try it out first, okay?”\nEmily sucks in a breath, then lets it out on another sigh and nods.\n“That’s my girl,” Louis murmurs. “Now eat your breakfast, and let’s get going. Don’t want to be late for the first day.”\nThe primary school is only a couple of blocks away, so Louis buttons Emily up into her coat, takes her hand, and walks her there. The air is crisp with a dying autumn and the promise of winter, trees already losing their frail brown leaves, sad-looking as their shedding branches tremble in the wind. The school is small, a tidy-looking one-story brick building, surrounded by a wrought-iron fence that makes Louis breathe a bit easier.\nThe classroom door is propped open, and there are already a few kids in there with their parents, sitting at tables and chatting quietly. Emily’s grip on his hand tightens as they walk in, and even Louis feels a bit apprehensive as he looks around for the teacher. He hadn’t been able to make the parent-teacher meeting the previous week, so he’s got no idea who to look for.\n“Hi,” someone chirps from Louis’ left. He turns to see who spoke and comes face to face with a boy. Or at least, he looks like a boy. He’s got a cherubic face, eyes sparkling happily and dimples flirting as he smiles at Louis, then drops into a crouch.\n“Hi,” he repeats, and sticks a hand out for Emily to shake. “I’m Harry, what’s your name?”\nEmily shies back, lets go of Louis’ hand so she can grasp his thigh, and Louis pets his hand down over her hair, murmurs, “It’s okay, Em, tell him your name.”\n“Emily,” she whispers, twirling her hair nervously. She doesn’t shake his hand, but he seems unfazed.\n“Emily, what a lovely name! Well, Emily, I’m going to be your teacher this year. We’re going to have a lot of fun, I promise.”\nShe doesn’t respond, just stares at him with wide eyes, and Louis sighs.\n“She’s usually much more outspoken than this.”\nHarry straightens up out of his crouch and holds a hand out to Louis with another smile.\n“I’m Harry Styles, I don’t believe we’ve met.”\nLouis shakes his head as he places his hand in Harry’s and says, “Louis Tomlinson. And no, sorry, I had a work emergency. Last minute deadline, ensuing chaos, etcetera etcetera.”\n“Of course,” Harry murmurs, still smiling happily. Louis squints at him.\n“Are you a teaching assistant?”\nHarry lets out a surprised laugh, says, “What? No, I’m an actual teacher. The teacher for this class. Why?”\n“Nevermind,” Louis says as he studies Harry. “You just look really young.”\n“I promise I finished uni, Mr. Tomlinson,” Harry says, eyes sparkling with amusement.\n“Ugh,” Louis makes a face. “Please don’t call me Mr. Tomlinson, it makes me feel old.”\n“Right,” Harry laughs. “Well, how about you take Emily to her seat? I believe her name is down on the blue table. We’ll be starting in just a few minutes, so there’s enough time for you to say goodbye.”\nLouis walks Emily over to the blue table and makes a point to introduce her to the other kids already sitting there. Bella from the swimming pool is sitting one seat over, and he watches them talk happily until the room has filled up and the other parents are starting to leave. Nerves settle heavy in Louis’ belly as he crouches down and puts his hand on Emily’s back.\n“Hey, Em,” Louis murmurs, and Emily turns in her seat. Her eyes are wide and bright and she’s smiling happily, and even though he knows that’s a good sign, it does nothing to ease Louis’ worry. “I have to go, monkey. You be a good girl and listen to your teacher, okay?”\nEmily rolls her eyes and says, “I know, Daddy. Look, I’m sitting with Bella!”\nLouis smiles and waves at Bella, then runs his hand over Emily’s hair.\n“Daddy’s gotta go, love, you going to be okay?” Emily nods and Louis leans in to give her an eskimo kiss. “Love you, Em, have fun today.”\n“Love you too,” Emily responds, and she plants a kiss on his cheek, then turns back to Bella immediately. Louis tries not to frown as he walks out of the room, returns Harry’s cheerful wave and offers him a weak smile before turning out into the hallway. It’s ironic, he thinks as he walks toward the front door, hands shoved into the pockets of his jeans. After Emily’s show this morning, he’s the one fighting the impulse to turn back around, grab her, and make a mad dash for the house.\nHe resists the urge to at least go peek in the window of the classroom door to make sure she’s still chatting happily with Bella and not crying for him, makes himself walk out the front door and shut it firmly. He makes it as far as the end of the walkway before his chest gets tight and his throat constricts, sits down right on the curb and drops his head between his knees. He focuses on taking slow, deep breaths and is on number six when he hears someone say, “You alright, mate?”\nLouis takes one more breath, lets it out slowly as he raises his head. There’s a guy standing next to him, looking down at him with concern. He’s got dark hair styled up into a quiff and huge eyes, and there’s a lit cigarette dangling out of the corner of his mouth, a thin curl of white smoke spiraling up into the air before dissipating. Louis gives a half-hearted shrug and the guy smiles, cigarette bobbing with the curve of his mouth.\n“First day of school, huh?” The guy asks, tone warm and understanding.\nLouis nods, then drops his forehead onto his knees and wraps his hands around his ankles. When he speaks, his voice is muffled by the denim of his trousers. “She didn’t put up a fuss at all.”\nThe guy chuckles, then sits down next to him and stubs the cigarette out on the concrete, asks, “Is she your only kid?”\nLouis nods again, denim scratching at his forehead. He lifts his head, presses his chest down over his thighs, and sighs hugely. He tilts his head to the side and rests his cheek on his knee so he can look at the guy, says, “And it’s been just the two of us, really, since she was two. I work from home, I don’t know if I can handle an empty house.”\nThe guy smiles kindly and reaches out to pat Louis on the back.\n“You’ll get used to it, mate. And after three years, I bet the quiet will be nice. I’m Zayn, by the way.”\nLouis straightens up and takes his proffered hand, says, “Louis. Do you have a kid here?”\n“No,” Zayn says with a relieved little laugh. “I teach art. Twice a week for years one and two, and once for years three through six. Whose class is your daughter in?”\n“Harry Styles?”\nZayn’s eyes light up and he sounds amused when he says, “Oh, I love Harry. He’s so strange.”\nLogically, Louis knows that Harry wouldn’t be working with children if ‘strange’ meant anything bad, but Zayn’s words have his stomach swooping nervously and worry weaving its way into his voice when he demands, “Strange how?”\n“Hey, relax,” Zayn laughs. “He’s just kind of...bohemian. He does yoga with the kids and has a feelings circle and makes the kids learn how to take care of pets and shit. It’s cool.”\nLouis relaxes, slumps back down over his legs and picks absently at a loose thread on his shoe. It’s probably time for some new Vans, he thinks. His toes are starting to poke through the fabric. He digs his finger into the barely-there hole as he thinks about Emily back in the classroom, wonders what they’re doing right now.\n“Hey,” Zayn says, and he nudges Louis in the side with his elbow. “Don’t dwell on it, alright? You’ll hear all about her day when you pick her up, just go home and enjoy the quiet, yeah?”\nLouis sucks on his bottom lip for a moment, then sighs.\n“Yeah, I suppose.” He looks back up at Zayn and offers him a smile. “Thanks, man.”\n“Of course,” Zayn says with a lopsided grin. “Trust me when I say this happens to loads of parents, and they always get over it soon enough. You’ll be fine.”\n“Yeah,” Louis grumbles as he pushes unsteadily to his feet. He looks around as he dusts himself off. The car park beside the school is mostly empty at this hour, the far corner filled with what he assumes are the staff’s cars and two huge school buses. Good, maybe no one else saw his embarrassing breakdown. He looks back over at Zayn, who’s now standing beside him, pulling an unlit cigarette between his fingers. “Well, I guess I’ll see you around, then?”\nZayn nods and lifts the cigarette to his mouth, says with a wink, “Enjoy the peace as much as you can, Louis.”\nLouis thanks him again, then turns and heads back toward his house. He pulls his coat tighter around himself as he stares up at the bleak gray sky, makes a mental note to check the weather forecast before leaving to pick Emily up in the afternoon.\nThe house is eerily quiet as Louis pushes the front door open, no faint murmur from the television, no high-pitched laughter, no patter of tiny feet on the floor. He frowns at the empty living room, Emily’s toys scattered about like the debris from a passing tornado. He should probably take the opportunity to tidy a bit. Probably.\nInstead, he toes off his shoes and leaves them by the front door, then unbuttons his jeans as he walks straight back into his bedroom. If he takes a short nap first, no one will have to know.\n;;\nLouis wakes up just after eleven, groggy and out of sorts. He’s not used to sleeping late, and the empty house is disorienting. He eats lunch at the sink and tidies the living room, then sits down at his desk and tries to write. He’s got an article set for the Friday paper about the changes the new Manchester United coach has made to the team and his vision for the upcoming season, and he needs to transcribe the interview he’d conducted over the phone on Saturday, but he’s too distracted by thoughts of Emily to do much more than research for his next assignment.\nBy three o’clock, Louis is antsy. School ends at 3:30 and it will take Louis less than ten minutes to walk to the school, but he’s anxious to see Emily and hear about her day. He’s dressed and sitting on the edge of the sofa by 3:02, legs jittering nervously as he stares down the clock on the cable box. He’s determined to wait until at least 3:15 to leave, so he grabs his iPad off the coffee table and pulls up fruit ninja to pass the time.\nHe makes it to 3:11, and then he’s tossing the iPad aside without even closing the game and heading for the front door. It’s still cold and gray, and even though it hasn’t rained, the wind has picked up. Louis tugs a beanie down over his hair and buttons up his jacket as he walks, and despite the weather, he’s got a lollipop in his pocket and a spring in his step, because he’s finally on his way to pick up his girl. Even though it’s only been seven hours and he regularly spends entire weekends without her when she stays with Eleanor, he just wants to know she’s okay, that she had a good day and didn’t miss him too much. (Although he does selfishly hope that she missed him at least a little bit.)\nHe gets to the school with several minutes to spare, but it’s already teeming with parents queueing to pick up their children. It’s a mess of cars and people on foot, and Louis spots Zayn and another staff member he hasn’t met directing traffic across the car park, as well as a handful of staff by the front entrance, trying to direct the rest of the parents and discourage a small mob scene.\nLouis bides his time, watching the shifting mass of people by the doors, and at 3:29, he slips easily through crowd and makes his way to the front. He’s greeted by a woman with a shock of pink hair and a nose ring, who beams at him and says, “Hello there, I’m Perrie! Which class?”\nNot really sure how to answer the question, Louis settles on, “Harry Styles?”\n“And your name?”\n“Louis Tomlinson.”\nShe flips through a few pages on her clipboard, then taps her finger against it and looks back up at Louis, says brightly, “Go on ahead, Mr. Tomlinson, have a wonderful day!”\nLouis skirts around her with a murmured thank you and pulls the front door open. There are only a few parents wandering the halls, policed by the staff members out front, and Louis is grateful for it, not sure how comfortable he would be, dragging Emily out into a narrow, crowded hallway. The classroom door is propped open again, and the kids are all sitting in a circle on the carpet with Harry. There’s a little boy with red-framed glasses talking quietly, and Louis does a double-take, certain he had imagined -\nHe shakes his head in bemusement. The kid has a circlet perched on his head, made of silk flowers woven together into a brightly colored flower crown. Louis is not sure what to make of that.\n“Hi, Mr. Tomlinson,” Harry says brightly, and Louis tears his eyes away from the bizarre scene and focuses on Harry. He looks decidedly more rumpled than he had that morning, and there’s a smudge of dirt on the elbow of his shirt, but he looks cheerful, and he really is very lovely. Louis had been too preoccupied to pay much attention that morning, but Harry has large green eyes and a mess of curls, and his dimples are stupidly charming, and Louis puts a stop to those inappropriate thoughts immediately.\nHe barely has time to open his mouth before he sees Harry murmur something to Emily, and then she’s scrambling up and rushing over to her cubby to grab her things. “Walk, please, Emmy,” Harry calls from where he’s still sitting in the circle, and Emily slows her pace. “Thank you!”\nOnce she’s grabbed her lunchbox and her coat, Emily crosses the room to where Louis is standing, his hands already outstretched to take them from her. Instead of taking hold of the lunch box, though, he finds himself dropping to his knees and pulling her into a hug. She wraps her arms around his neck automatically, lunchbox banging against his back, but he doesn’t care. She smells like dirt and freshly cut grass, and her voice is muffled by his shirt when she says, “Hi, Daddy!”\n“Hi, monkey.” He pulls out of the hug and tugs the lunchbox out of her hand, then takes her coat. “Let’s put this on, okay? It’s cold outside.”\nEmily turns around so he can slip it on over her arms, and when Louis looks up, he sees the side of her face contorted into a strange expression. When he looks around to see what she’s looking at, he realizes that Harry is pulling faces at her, and he shakes his head in amusement. The faces aren’t really doing much to reassure him that Harry is old enough and mature enough to be teaching his kid, but at least he seems like he’s fun to be around. He pushes to his feet and settles his hand on top of Emily’s head.\n“Ready, love?” Emily turns around, smiles up at him and nods, and Louis gestures at the circle, says, “Say bye to your friends and to Harry, Em.”\nEmily waves at everyone and chirps, “Bye, friends! Bye, Harry! See you tomorrow!”\nThere’s a chorus of goodbyes from the class, and a call of, “Have a great day,” from Harry, and then they’re off. Louis waits until they’ve made it outside and past the throng of still-waiting parents to tug the lollipop out of his pocket. He presents it to Emily, and she eyes it suspiciously, says, “What kind is it?”\nLouis rolls his eyes, then remembers that’s not something he wants Emily to be doing, and says, “Who do you take me for? It’s cherry, of course.”\nEmily reaches up for it, but before he lets go, Louis raises an eyebrow pointedly until Emily says, “Thank you, Daddy.”\nHe lets her take the sweet, then takes her free hand in his and swings their clasped hands between them.\n“So? How was your day?”\nEmily pulls the lollipop out of her mouth so she can speak, looks up at him excitedly as she gushes, “It was so fun! I saw Bella and Robbie and there was Michelle and Sophie and Caroline and Henry and Barney and Poppy and Luke! I don’t remember everyone else. And we have a fish and a hamster named Mr. Whiskers, but he was sleeping all day. And one time, Luke was mean to Sophie and he spilled her juice and Harry made him say sorry and clean it up! And we played outside, but he didn’t let me climb the trees, and we had music time and a boy came in to sing with us and he brought his atar and he sings very nice.”\n“Atar,” Louis questions, and Emily nods and sticks her lollipop back in her mouth so she can demonstrate.\n“He holds it,” she slurs around the sweet, pulling her hand out of Louis’ grasp to mime someone holding a guitar, and Louis hums in understanding.\n“A guitar,” he corrects, but Emily shakes her head as she takes Louis’ hand again.\n“He said it’s a atar,” she says firmly, and Louis gives up with a shrug.\nShe spends the rest of the walk home telling Louis about the frog Barney had found while they were playing outside, and what Harry had taught them about frogs - how they have babies in water and the babies grow legs and hop away, and how they sing when they want to get married, just like in Happy Feet. Louis is pretty impressed with Harry’s interpretation of a frog’s life cycle, it’s a creative take on it.\nThey play with Emily’s miniature football in the back garden for a bit, one of her favorite things to do, much to Louis’ delight, then Louis lets Emily call his mum to tell her about her first day of school while he makes dinner. Halfway through her bowl of pasta, Emily’s energy flags, so Louis sets his own bowl aside and waves her out of her booster seat.\n“Come on, monkey, let’s go take a bath and get you into bed.”\nLouis runs a warm bath for Emily, then lifts her into the tub and sits her down so she won’t fall over. She’s gotten the hang of washing her hair, but she gives up halfway through, suds running down her neck as her eyelids droop with exhaustion, so Louis finishes up for her and rinses it out, scrubs her down, then lifts her out of the tub.\n“Frogs,” Emily mumbles when Louis holds a duck-printed towel out, so he drops it on the lid of the toilet to deal with later and pulls out the frog-printed towel to dry her off. All bundled up in her pajamas, Emily raises her hands toward Louis, and Louis hefts her into his arms. She’s getting a bit too big to carry around like this, but her head lolls against his shoulder immediately and she’s just so sweet when she’s sleepy like this, that even though his arms ache, Louis can’t bring himself to say no. He rubs her back and sings her favorite lullaby as he walks toward her bedroom, trying not to think about the days when she fit right into the crook of his arm.\nHer bedroom is a soft, neutral yellow, walls lined with Winnie the Pooh decals, and it’s furnished in white wicker. The room is bright and lovely, with wide windows and pale green curtains to match Emily’s duvet, and he’s still not quite over the fact that she sleeps in a big girl bed, desperately misses the days when she was small enough for a crib.\nHer eyes flutter open once Louis has set her down on the bed and pulled the blankets up over her. She mumbles, voice thick with sleep, “Daddy?”\n“Yes, love,” Louis murmurs, smoothing her damp hair back from her face.\n“Can you read me a story?”\n“Of course.” Louis settles onto the mattress alongside Emily and sifts through the books on the bedside table. He’s in the middle of reading Harry Potter and the Philosopher’s Stone to her, but she’s too sleepy to really pay attention, so he grabs The Velveteen Rabbit. She’s asleep before he’s even reached the third page.\n;;\nThe rest of the week passes in a stilted pattern of slow and fast, slow and fast; Emily at school, the house empty and silent around Louis, and Emily at home, a whirlwind of energy and endless chatter about school and Harry. The silence during the day doesn’t stop bothering him until Friday, and by then he’s mostly settled into a routine. It’s not a terribly thrilling schedule, and he catches himself calling out for Emily every once in a while, when the quiet has gone on too long. When that happens, that same feeling from the first day washes over him, a desperate urge to go pick her up and bring her back home, maybe lock her in the house with him for a few more years so she won’t grow up so quickly.\nIt’s raining when he goes to pick Emily up Friday afternoon, so he carries an umbrella, a silly, oversized thing with brightly colored polka dots that Em had picked out earlier in the summer. His Vans are water-logged by the time he gets to the school, and they make squelching noises on the polished cement floor of the hallway once Perrie has waved him inside.\nEvery day this week, he’s slipped through the crowd of parents, Perrie’ bright pink hair like a beacon, and she’s let him skirt around her with a wink. One of these days, he’s going to stop and actually talk to her, he decides. Emily’s class is always rounding up circle time when Louis gets there, the flower crown perched on the head of a different kid every time he walks in, and when he steps up to the door, it takes him a moment to realize that Emily is wearing it today.\nThe crown is a bit too big, sitting low on the back of her head, but she looks so bloody cute, like a little elfin princess, that Louis has his phone out before he’s even thought about it and is snapping a picture. When he looks up from his phone, he realizes that Harry is watching him. He gives Harry a little wave, bites his lip around a smile when Harry beams at him. It’s a bit overwhelming, how lovely Harry is and how intensely he focuses on people - to the point that Louis has to drag himself away from their brief conversations every morning after dropping Emily off. It’s just that it’s been so long since he’s even spoken to anyone that attractive, Louis tells himself as he turns his attention to Emily. Right.\n“And I didn’t like it when Henry tried to take one of my cookies, but it was good when Harry made him give it back.” She looks over at one of the boys, a tiny little thing with pale blond hair who’s ducking his head and staring down at the carpet, and says, “If you asked me first, I would have gave you one, Henry, I like to share.”\nPride swells up in Louis’ chest and he makes a mental note to give her extra ice cream after dinner tonight. Emily lifts the flower crown off of her head and hands it over to Harry, and Louis watches in confusion as everyone sits in silence while Harry settles it on his own head. He should look ridiculous, a grown man wearing a flower crown, but he just looks lovely, curls flipping up over the bottom of the crown and tangling around the flowers so it looks like they're woven right into his hair. Harry smiles brightly and says, “Very good, Emily, and that’s very sweet of you to say. You can go get your bags, your dad is here to pick you up.”\nEmily twists around to look back at Louis and waves happily at him before scrambling to her feet. Louis opens his mouth to speak, but before he can say anything, Emily gasps and claps her hands over her mouth, shaking her head frantically. Confused, Louis looks over at Harry, who says, “When it’s time for the feelings circle, you can only speak when you have the feelings crown on.”\nHe points to his head to indicate the circlet of flowers. Louis shakes his head in amusement and turns to mouth ‘sorry’ to Emily before pointing at her cubby. He watches her walk over to it and pull her things out, then skip back across the room. They both turn to wave at the class, and Harry blows Emily a big kiss, calls out, “Have a nice weekend, Louis and Emmy!”\n“Nice green cubby,” he murmurs once they’ve stepped out into the hallway, and he kneels to tug Emily’s coat on over her hands.\n“We got to pick them! I picked green cause it’s my favorite color and Bella has a pink one and Poppy’s is purple! Hey, Daddy? Am I going to school tomorrow?”\n“No, monkey, tomorrow is Saturday. You get to stay home on Saturday and Sunday.”\nEmily’s face falls and she mumbles, “Oh.”\nLouis tries not to be offended that his daughter would rather spend the day at school than with him as he takes her hand and they start toward the front doors.\n“But Uncle Liam is coming over tomorrow, and we’re going to take Loki to the park, doesn’t that sound fun?”\n“Can I climb trees?”\nLouis sighs and says, “Maybe, we’ll see.”\nThe news cheers her up, and she bounces happily on her toes and tells Louis all about her day as they walk back home, umbrella held carefully over both of their heads.\n;;\nLouis is woken up Monday morning by a tiny hand patting his cheek. He groans and rolls over onto his back, squints his eyes open to find that it’s still dark out, the sky not even gray with pre-dawn. He sighs when she pats his cheek again and whispers, “Daddy?”\n“Em,” he croaks out. “Whassit? Time’s it?”\nHe turns his head on the pillow so he can blink at the clock, but the numbers are just a red blur. Louis fumbles around the bedside table for his glasses and nearly puts his own eye out sliding them on, then tries to read the time again. 5:38am. He rolls over to face Emily, the side of his frames digging into his temple. Emily is lying in the center of the bed, but it’s too dark to see her expression. Louis reaches out and pushes his hand through her hair, smooths his thumb across her brow.\n“What’s wrong, monkey?”\nShe shuffles closer on the mattress, until they’re sharing the same pillow, and whispers, “Is it time to go to school yet?”\n“No, love,” Louis murmurs, and he tugs on a lock of her hair. “You can go back to sleep, there’s still lots of time before school starts.”\n“But I wanna go,” she whispers. “I get to feed Mr. Whiskers today.”\nLouis smiles sleepily and tugs her in against his chest, hums happily when she tucks her head up under his chin automatically. He presses his mouth to the top of her head and mumbles, “You can’t go yet, Em, no one will be there for three more hours. Let’s go back to sleep, okay?”\n“Okay,” Emily says quietly, and she snuggles in closer and wraps her arm around Louis, hand only reaching the middle of his back. Louis waits till he feels her eyes flutter closed against his collarbone, then falls back asleep.\n \nLouis’ alarm goes off at 7:15, and he wakes Emily up by murmuring nonsense into her ear so the vibrations of his voice tickle her, then peppers her face with kisses until she’s laughing and trying to push him away. He gives her a piggyback ride to her room so she can brush her teeth and choose an outfit for the day, doesn’t bat an eyelash when she slips into the kitchen fifteen minutes later wearing striped jeans and a flowered jumper. He just says, “Hey, pretty girl,” and drops a kiss to the top of her head as he sets a plate of french toast in front of her, then takes the seat across the table.\nWhen they get to the school, Emily hugs Louis’ leg briefly, then dashes off toward her cubby, only slowing down when Harry calls out, “Emmy, walk please!”\n“You know, it’s funny you call her Emmy,” Louis says as he walks over to Harry. “She called herself Emmy until she was four, because she couldn’t say Emily.”\n“Oh, yeah? That’s cute.” Harry says, amusement coloring his voice. He looks ridiculously pretty this morning, his hair a bit wild, presumably from the hectic wind, his cheeks flushed a rosy pink with windburn. The cream jumper he’s wearing just serves to make his eyes look greener, his mouth redder, and his jeans are so tight Louis isn’t sure how he managed to pull them on himself. Although, now that he thinks about it, he doesn’t know that Harry put them on himself. He knows nothing about Harry, really.\nHe doesn’t realize he’s staring until Harry turns to face him, one corner of his mouth pulled up into a smirk. Louis snaps himself out of it with a shake of his head and almost trips over something when he takes a stumbling step back. He curses quietly, mindful of the children littered around the room, and turns around to glare at the offending object. It’s...\n“Is that a recycling bin?”\n“Astute observation,” Harry teases. “What tipped you off? Wait, was it the giant recycle sign printed on the side?”\nLouis squints over at Harry and sticks his tongue out at him, ignores the swoop in his belly at Harry’s delighted laugh, then says, “Aren’t the kids a bit young to be learning about recycling?”\n“I don’t think so,” Harry muses. “Kids are very impressionable, I think it’s important to start teaching them about the environment as early as possible, you know?”\nLouis sighs.\n“I’m going to have to start recycling, aren’t I?” Harry just shrugs and smiles serenely, and Louis mutters, “You’re a bloody menace.”\n\n\nExactly as predicted, when they get home, Emily immediately sets off looking for the recycle bin so that she can throw the wrapper from her lollipop away.\n“Daddy,” she lectures sternly, “Harry said we are saving the world by cycling.”\n“Recycling, monkey. And I know, I know. I’ll order us a bin. In the meantime, let’s just put everything in a bag and we can put it in the recycling bin at school tomorrow morning. How does that sound?”\n\n\nBy the end of the week, Louis has three different bins in his kitchen in addition to the normal rubbish bin, a key printed out and taped to the wall so he doesn’t mess it up, and Harry to thank for it. Emily is so excited about it when she tells Harry first thing on Friday, though, and Harry looks so proud that Louis just sighs and resigns himself to being made a better person by his five year old daughter and her hippie of a teacher.\nThat afternoon, Emily comes home with a note from Harry about a field trip in two weeks, and a request for chaperones. Louis thinks about spending a few hours with fifteen excitable five year olds and considers claiming he has too much work to do. But then he realizes that also means spending a few hours with Harry - and Emily, of course with Emily - and he finds himself filling out the chaperone form and tucking it into Emily’s lunchbox so he’ll find it when he packs her lunch on Monday and won’t forget to give it to Harry.\n;;\nDespite Harry’s profuse thanks and assurances that chaperoning will be a breeze, Louis spends the week leading up to the field trip psyching himself out. He knows how to deal with children, having raised one on his own, but he’s never really had to deal with fifteen of them at once. Even Emily’s birthday parties have been relatively low-key, just a handful of kids from the neighborhood and her swimming lessons. Logically, he knows that Harry and another parent will be there, but scenarios keep flashing through his head in which he gets stuck watching the kids by himself, or he loses one of them, or they all hate him and won’t listen to him at all.\nBy the time the following Monday rolls around, Louis is a bundle of nerves. He wakes Emily up at 7:15, lets her pick out an outfit while he makes them some French toast, and sets it on the table in front of her once she’s clambered up into her booster seat. He raises an eyebrow when he realizes she’s wearing her fourth orange outfit in a row - he didn’t even know she had that many orange articles of clothing, to be honest.\n“Hey Em, what’s with all the orange?”\nShe looks up from her toast and says, “Harry said my rora is orange.”\nLouis stares at her for a moment, completely stumped.\n“Your what?”\n“My rora,” she repeats, waving her hands around her head like that’ll help Louis understand. It just confuses him even more. “I’m orange! You’re yellow,” she states matter-of-factly. “Harry told me so.”\n“If you say so,” Louis hums, bemused. He tries to puzzle it out while they finish eating and walk to school, nerves completely forgotten in his confusion over Harry’s newest addition to their lives. By the time he lets go of Emily’s hand so she can put her stuff in her cubby, though, he still hasn’t worked out what she meant by a rora. He sidles up to Harry, who’s talking quietly with a woman Louis assumes is one of the mums and their third chaperone.\n“Good morning, Louis,” Harry says brightly as he shoves his hair back off his forehead. His jumper is dark green today to match his eyes, and Louis sighs. It’s sad, really, how Harry reduces him from a 26 year old man with a child to a bumbling 12 year old with a schoolyard crush. “This is Angela, Poppy’s mother. She’ll be chaperoning the aquarium with us today.”\nLouis waits until Angela is distracted to nudge Harry and ask, “So, any idea why my kid has started dressing like a traffic cone?”\nHarry bites his lip around a smile, and he looks so sweet that Louis presses a hand to his stomach subconsciously to try and quell the fluttering of the butterflies that seem to have taken up residence in there. Pathetic, honestly. Harry shrugs and says, tone a bit sheepish, “We were talking about auras last week.”\n“Auras,” Louis deadpans. When Harry nods, Louis says, “I bought your reason for teaching five year olds about recycling, but I know there’s no way they understand auras. I don’t even understand auras.”\nHarry’s expression brightens and he says, “Oh! I have a book on auras, I’ll lend it to you. It’s fascinating, really.” He walks over to his desk and pulls a slim book out from the middle of a small stack and hands it to Louis with a smile and a wink. “Yours is yellow, if you were wondering. You were very easy to read.”\nLouis cocks his head. He’s not really sure if Harry is flirting with him, or if he’s just being earnest.\n“And what does a yellow aura symbolize?”\n“Playfulness, creativity, joy especially. Emily gets all that from you, of course, though hers is a bit different - adventurousness and excitement thrown into the mix, as well. It’s obvious, you know, how much you love your daughter. When you smile at her, you get these little crinkles.” He lifts a hand to indicate the corner of his eye. “It’s lovely.”\nLouis ducks his head as warmth bubbles up in his chest at the compliment. He knows Harry is just being nice, though, mumbles, “Yeah, well, Em is pretty easy to love.”\nHarry’s answering hum is noncommittal, and he says, “I know it’s basically ingrained, love for your child, but some parents don’t show it very well. It’s a nice thing to see. Take the compliment, Louis.”\nLouis shrugs, then looks up at Harry through his lashes.\n“And what color is your aura, then?”\n“Green,” he responds immediately, and before Louis can ask, he continues, “It represents a love for nature and being social.” He seems to realize, then, that they’ve not been paying any attention to the kids. He offers Louis a sheepish smile and says, “Oops,” then turns away to count them. Once all of the kids have arrived and had a few minutes to play, Harry gathers them up and they all walk out to the bus.\nAt the aquarium, they meet up with a guide who takes them through the exhibits. Louis has been meaning to take Emily for ages, and while looking after a group of fifteen children is not the ideal way to do it, the aquarium is lovely and the kids have a blast. The aquarium has a little game to keep them interested, and they each get a pamphlet with pictures of different sea creatures that they have to fill in by finding the corresponding stamp at stamping stations throughout the building.\nLouis walks on the fringes of the group, toward the back so that Emily won’t remember he’s there and will pay attention to the guide. And if he hangs back a bit more just so that he falls into step with Harry, then no one needs to know. They talk quietly and aimlessly as they walk through the aquarium, brief pauses in conversation whenever a kid starts to wander off, or they start to get a bit rowdy. They’re all good, for the most part, though, fascinated by the rippling blue water and bright flashes of color and entertained by the stamps, shaped like sharks and fish and stingrays.\nThey’re standing quietly at a reef tank while the guide relates it to things like SpongeBob and Finding Nemo for the kids and lets them stamp their pamphlets with a picture of a clownfish, when Louis notices that Emily isn’t paying attention. He turns to see what she’s looking at and catches sight of Harry making fish faces at her, eyes crossed and the corners of his lips tucked into his mouth.\nHarry looks absolutely ridiculous, and Louis cups a hand over his mouth to stifle a laugh. Harry’s head snaps up at the noise, and he shakes his head and covers his face with his hands in embarrassment. Louis waits until they’ve moved on and he can drift to the back of the group again, matches his stride with Harry’s and swings his elbow out to nudge Harry’s side.\n“Please don’t,” Harry groans. “No one else was supposed to see that.”\nLouis grins and pokes him again, this time with the tips of his fingers so that Harry giggles and squirms away.\n“You know, you’re pretty weird, Harry Styles.” The look Harry levels him is unamused, but Louis just laughs and continues, “But you’re a really good teacher. Emily doesn’t stop talking about you. On Saturday she asked me if you could come over and play with her.”\n“Oh God,” Harry laughs. “Does that mean I’m not being authoritative enough?”\nLouis shrugs.\n“She’s learning a lot, if that helps. I sit with her and work on her spelling homework every night, she’s gotten all the way up to ‘g.’ She asked me if she could get a pet hamster, because she had so much fun feeding Mr. Whiskers last week, and if I forget to recycle something while she’s watching, she lectures me.” He slides Harry a sidelong look. “My five year old daughter lectures me on recycling. So, you know. Thanks for that.”\nThey hang back as the guide stops the kids at another tank, and Louis watches with interest as Harry scuffs his toe against the carpet, hands clasped primly behind his back. Harry clears his throat, then looks up at Louis through his fringe, eyes dark in the dim lighting of the aquarium.\n“Sorry if I’m overstepping any boundaries, but Emmy never really talks about her mum, and she mentioned going to visit her once?”\nSomething like nerves swoops low in Louis’ belly at the unexpected question, and he rubs the back of his neck while he considers what is and isn’t appropriate to tell your kid’s teacher, no matter how much you might want to shag them. In the end, he settles on a vague, “We had different interests.” He shrugs awkwardly. “She’s a buyer for a chain of boutiques and is out of town more often than not, so me taking Emily was the clear option.”\n“That must have been really hard,” Harry murmurs, and Louis studies him for a moment, relieved when he doesn’t read any pity in Harry’s expression. Pity is the last thing he wants. He loves his life, loves his daughter, and even though it’s lonely sometimes without another adult around, he wouldn’t trade her for anything in the entire world. “How long has it been?”\n“Three years. My mum and best mate helped a lot,” Louis says quietly. “But I figured most of it out along the way.” He looks over at the kids, searching for Emily in the group. He spots her toward the front, her long brown hair pulled back into a braid that he’s spent three years perfecting. “I think I’ve done alright, considering.”\nHe starts a little when he feels a hand on his elbow, turns to look at Harry. Harry is looking at him with wide, earnest eyes, and his voice is a deep rumble when he says, “You’ve done more than alright, Louis. Honestly, Emily is amazing.”\n“Oh,” Louis whispers, a bit overwhelmed by the intensity behind Harry’s eyes and the conviction in his voice. “Thank you.”\n“You’re welcome,” Harry mumbles, and he lets go of Louis’ arm, offers him a small smile. He reaches out and pokes Louis in the shoulder, and the weird tension that had spun out between them fractures, loosens Louis’ chest so he can breathe again. “Don’t doubt yourself, Lou. You have a really great kid. Now lets get the guide to wrap this tour up so the kids can eat. We need to get back to school by a quarter to eleven so we have time for some yoga before their nap.”\n;;\nLouis is halfway to Emily’s school on Friday before he remembers that Eleanor is picking her up for the weekend. He’d left a bag with her stuffed monkey and a couple of orange jumpers he’d bought her earlier in the week in the front office for Eleanor to grab on their way out, so they don’t have to stop by the house. It’s easier for both of them when Emily doesn’t have to say goodbye to him.\nHe turns back around to walk home, annoyed with himself for forgetting. He’s already finished his work for the week, has his cable box set to record all of the important games this weekend, and has tidied the house, and there are still four hours until Liam is supposed to pick him up for pub night. Disappointed with his efficiency, for once, Louis tugs his phone out of his pocket and sends Liam a text, asking if they can start a little earlier so he doesn’t go out of his mind from boredom.\nIt’s been almost three months since he and Liam have had a proper lads night, one that didn’t involve them camped out on his sofa with some beer while Emily slept in the next room, and Louis is so ready for this. He takes his time getting ready with a long, indulgent shower, shaves for the first time in a week, then picks out his tightest jeans. He has to lay down on his bed to button them, but it’s worth it when he cranes his neck so he can look at his arse in the mirror.\nHe decides to further sacrifice comfort for fashion and pulls on a thin, knitted jumper that will do nothing to block out the brisk autumn wind, but frames his collarbones and hugs his hips perfectly. He’s just finished styling his hair when he hears Liam knock on the door, and he slips into his Vans and grabs his pea coat on the way out.\nThe pub isn’t yet crowded when he and Liam walk in, though it’s cheerfully loud, and it’s easy to find a booth away from the bar where they can order food and drinks and converse without having to yell over the small crowd. Louis is working his way through a mountain of chips and a pint of beer when he hears someone say, “Louis Tomlinson!”\nIt takes him a moment to realize Liam isn’t the one who spoke, and when he looks around, he spots Harry walking over to him. Harry, who is dressed in his typical skin-tight jeans, but instead of the conservative jumpers he wears to class, has on a t-shirt that scoops halfway down his chest, showcasing a smooth expanse of skin and a collection of tattoos Louis has never seen before. And he’s going to answer Harry, he is. Once he’s managed to recover the power of speech, seeing as he’s swallowed his tongue.\nHe’s just about to say hello when he hears someone else crow, “Louis!” And when he cranes his neck, he sees Zayn the art teacher following Harry with a blond guy that Louis vaguely recognizes from after school pickup in tow.\nHe finds his tongue just as the three of them come to a stop at the side of their booth, and he blinks up at them as he says, “Hiya Harry, Zayn, person I’ve never met before.”\n“I’m Niall,” the blond guy supplies, and Louis has heard that name before, he thinks.\n“Oh!” He points at Niall. “You’re the music teacher!”\n“That’s right,” Niall says, amusement coloring his tone. “I guess that means you have a kid in the school?” He glances at Harry, then amends, “A kid in Harry’s class?”\n“Emily,” Harry supplies, and he hasn’t taken his eyes off Louis since he spotted him.\nIt’s making Louis’ squirm in his seat, the way Harry is staring at him, eyes bright despite the dim lighting of the bar. He kicks out at Liam’s ankle under the table, desperate for a distraction, and Liam curses quietly, then sticks his hand out and says, “Hi, I’m Liam.”\n\n\nLouis is going to kill Liam, he is. He wants nothing more than to march back over to their booth and strangle him right then and there, except he can’t, because their booth is now overflowing with boys. Louis laughs at himself as he washes his hands and fusses with his hair in the mirror. That’s not something he’d have ever been annoyed about before, except that one of those boys is his daughter’s teacher, who is apparently a very handsy drunk, and he keeps staring at Louis like he wants to devour him. Louis has already had three beers, but he is not drunk enough for this.\nHe is not drunk enough for the way Harry keeps pressing up against his side in the booth, despite the fact that there’s a good foot of space left on the bench, he’s not drunk enough for the way Harry keeps leaning over the table so that his collar gapes, giving Louis and everyone else in the bar a clear view of the fucking butterfly tattooed on his stomach, and he’s certainly not drunk enough for the way alcohol turns Harry’s eyes glassy and his lips a sinful shade of red, the way his mouth looks when it’s closed around the neck of a beer bottle, the way he’s radiating heat like a furnace and smells like Christmas.\nLouis sighs and gives himself a mental pep talk as he smooths his jumper down over his hips. He can do this. He can resist the draw of Harry Styles, because he is a responsible, mature adult, and as much as he wants those cherry red lips wrapped around him, wants to tangle his fingers in that mess of hair and map those ridiculous tattoos with his tongue, he does not want to get his daughter’s favorite teacher fired.\nWhen Louis gets back to the booth, there’s a fresh drink in front of his seat - one that is decidedly not a beer - and Harry is half-lying on the table with his hands wrapped around Zayn’s shoulders as they talk. Louis is not sure why he feels that’s necessary, but as he slides into the booth, he gets a glimpse of the small of Harry’s back where his shirt is riding up. And while he’d already been pretty sure that there’s no way he could get those jeans on with anything underneath them, he is now 98% sure Harry is not wearing any pants, and. He reaches out for the toxic green martini and takes a long swallow, relishing the burn in his chest as he sets the glass back down.\nHarry drops back onto the bench and throws his arm across the back of the booth, turns to Louis with a smile and says, “Do you like your martini? I wasn’t sure which flavor to get, but Liam said apple was good.”\nLouis nods, the combination of beer and vodka swimming happily through his veins, and he leans into Harry a bit and says, “You’re very nice, Harry Styles.”\nHarry positively lights up at that, and they sit there staring at each other for a moment, until Harry leans in even more and breathes, “You have pretty eyes.”\n“You’re pretty,” Louis blurts out, and Zayn and Niall burst out laughing, effectively snapping Louis out of the magnetic pull of Harry’s eyes. He scoots back a bit, so he’s not nestled into the bracket of Harry’s arm, and scrubs his hands over his flushed cheeks, then glares at Liam for letting him admit that. This is all Liam’s fault, every last bit of it, for inviting Harry, Zayn, and Niall to sit with them.\nHe tries to keep a small distance between himself and Harry the rest of the night, engages Zayn, Niall, and Liam in conversation as much as possible to avoid anymore intimate moments with Harry, but he keeps getting drawn back in. He’s three beers and two and a half martinis in when he realizes that Harry is drinking daiquiris. Daiquiris. He’s got two glasses with just a smear of pink at the bottom, and two that are still mostly full, and for some inexplicable reason, he’s got the straws from both full daiquiris in his mouth, is drinking both of them at the same time.\n“You know,” Liam says, “the sugar from those drinks is going to make you sick.”\nHarry shrugs as he slurps at the frozen slush, eyes wide as he looks up at Liam. When he pulls back, his lips are stained an even darker red right in the center, and he pats his chest with his hand, winks, and says, “I’m a big boy. And I’ve been teaching year one for two years now, I can handle a lot of sugar.”\nHis hand is still resting on his chest, and Louis gets distracted by the fact that, heel to fingertip, it nearly spans the width of it. Without thinking, he reaches out and grabs Harry’s wrist, drags it over and lays Harry’s hand flat on the table, palm up. Jesus, his hands are huge. Like bear paws or something, Louis thinks. He lines their palms up, presses his own hand down over Harry’s, and sighs. His looks positively dainty next to Harry’s. He’s not sure whether to feel emasculated or turned on, honestly, because when he lets himself think about all of the things those hands could do...\nNo. He shakes his head and pushes Harry’s hand away, ignores the confused look Harry is giving him as he drains the last of his martini. No more drinks, no more touching, no more Harry, Louis tells himself. Except a waitress brings over another round of drinks, despite the fact that no one signalled her, and well. It would be rude not to drink a cocktail the bartender took time to make, especially when it looks so pretty, the dim bar lights reflecting off the base of the glass and a carefully skewered cherry bobbing across the surface. He’s just being nice by drinking it. Courteous, even. Right.\n;;\nLouis comes awake with a gasp and a whimper. He lies in bed breathing carefully through his mouth until the room stops spinning, then sits up as slowly as he can. His abs protest the pace, but his stomach and head are putting up a stronger case, and Louis doesn’t much fancy having to wash his bedsheets and air out his mattress today.\nHe sits there with his head in his hands, trying desperately to ease the pounding by massaging his temples as he thinks through last night. He had too much to drink, that’s for sure - about four too many appletinis, courtesy of one Harry Styles, and fuck. He’s fairly sure - no, make that completely positive - that he told Harry he thinks he’s pretty last night. He also vaguely remembers holding Harry’s hand for a bit, but after that it’s all a blur.\nLouis loses his train of thought and is just sitting there, staring at his hazy reflection in the television and wishing for death, when he hears a snuffling noise and realizes with a curl of dread that he’s not alone in his bed. Oh no. He closes his eyes and sends up a silent prayer before turning his head, and breathes out a sigh of relief when he sees that it’s just Liam.\n“Liam,” he croaks, and he leans over slowly so he can poke Liam’s cheek. “Liam, wake up. Wake up, Liam.”\nLiam swats his hand away, but squints one eye open so he can glare up at Louis and growl, “What.”\n“How did I get here?”\nLiam sighs and sits up, scrubs the sleep out of his eyes, then says, “Harry carried you.” Louis groans, mortification creeping up the back of his throat. “After you asked him if he wanted to spend the night.”\n“Fuck off, I did not,” Louis gasps, and he relaxes when Liam grins.\n“No, you didn’t. But he did carry you, even though I offered to take you from him. I’m actually quite impressed that he didn’t drop you.”\n“Oh, God,” Louis moans as he drops his head into his hands. “He probably thinks I’m a terrible father.”\n“He does not,” Liam chides. “Especially since he was completely pissed, himself. I told him those daiquiris would do the trick.” Liam clucks his tongue reproachfully, then turns to Louis. “Now make me breakfast, I took care of you last night.”\nLouis just glares at Liam until he sighs and throws the covers off, then rolls out of bed.\n“Fine. I’ll go to the bakery, you make tea.”\nLouis has his cheek resting on the cool granite countertop while the kettle boils and he waits for the three paracetamol he’d swallowed dry to take effect, when his phone buzzes in the pocket of his joggers. He thumbs it open to a text from a contact entered as ‘haryr ❤❤❤,’ and Louis desperately hopes that Harry hadn’t watched him type that in last night. God.\n\n            Last night was fun ;)))) xx\n\nLouis turns his face into the granite and groans. Once the kettle has boiled, he takes a minute to set the tea to steep, then picks his phone back up and types in, ‘My liver disagrees with you.’ He thinks about it for a moment, then figures, why not, adds an ‘x,’ and presses send. Less than a minute passes before his phone is buzzing again.\n            We should do it again sometime? xx\nLouis deliberately ignores the way his stomach flutters and taps out, ‘Yeah, I’ll let you guys know when Liam and I have another lads night x.’ There. He managed to keep it simple and friendly and not suggestive at all. Louis pats himself on the back, then hears the front door open and Liam call out, “I’m back, where is my tea!”\n“God, you’re worse than having a wife, honestly,” Louis answers, then drops his phone into the junk drawer before carrying the mugs to the kitchen table. There are few things in life that are more important to Louis than tea and fresh scones, and he is determined not to let Harry become one of them.\n;;\nLouis manages to do a spectacular job of not flirting with Harry over the next few weeks, if he does say so himself.\nOkay, maybe not a spectacular job, per se, but he does manage to keep the texting to a minimum - though he somehow becomes part of a three hour phone call one Wednesday night, during which he learns every detail of Harry’s life, so. And really, he’s not even sure how it happens. He’s just finished putting Emily to bed and is getting ready to hop in the shower, has his shirt and trousers lying in a puddle on the floor and a thumb hooked in the elastic of his pants, when his phone buzzes in his pocket, ‘haryr ❤❤❤’ lighting up the display. (He should probably change that, he thinks as he accepts the call.)\nIt starts out awkwardly enough, fumbling hellos and overly formal ‘how are you’s,’ but it leads to Louis curled up around a pillow on his bed, smiling into it as Harry babbles in his ear about how his sister used to dress him up in her clothes so they could put on fashion shows for his mum and stepdad. They don’t hit a lull in conversation until just before midnight, Louis’ clock flashing 11:57 at him, and he yawns into his palm, murmurs, “Hey, Haz? Why did you call me, anyway?”\n“Oh. Erm.” There’s an awkward pause, and Louis has to close his eyes against an overwhelming wave of fondness. “Well, I was just. I wanted to let you know that next week is Emily’s turn to take the class hamster home?”\nLouis bites his lip around a grin and has to resist the urge to just bury his face in the pillow and scream, says in the calmest voice he can manage, “Are you asking me if that’s why you called?”\nHe hears Harry snort over the line, a sharp burst of static, and then he says, “No. No, I’m telling you.”\n“Okay,” Louis chuckles. “Noted. I’ll clear a space for it in her bedroom.”\n“Oh, you might not want to do that,” Harry says. “Hamsters are nocturnal, he might keep her up at night, running in his wheel.”\nLouis frowns as he picks at the corner of his pillowcase.\n“Who wants a nocturnal pet?”\nHarry just hums noncommittally, and they sit in comfortable silence for a few minutes, until Louis can’t mask another yawn and Harry says, voice soft, “It’s late. You should go to sleep, Lou.”\n“You too. You’ve a busier day than I do,” Louis mumbles, but Harry just hums quietly. “G’night, Haz.”\n“Night, Lou. Sleep tight.”\nLouis waits until Harry hangs up, then stares blankly down at the screen of his phone, still flashing ‘haryr ❤❤❤’ on the display. He can’t help the little smile that curls his lips as he swipes his thumb over the name. He’s just going to keep it for a few more days. No one has to know.\nSo yeah, the text limit might not hold any weight, in the end. He is reasonably sure, however, that he’s at least got a decent handle on his facial expressions, so he knows he’s not making heart-eyes at his daughter’s teacher when he drops her off in the mornings. Probably.\n \nThe third weekend in November, Emily brings Mr. Whiskers home. Louis clears a space on the entertainment center in the living room and mentally steels himself against the second wave of begging he knows is coming once they have to give it back. He still refuses to own rodents as pets, and no amount of pouting from Emily is going to change his mind.\n“We have this thing for three days, why does it come with so much stuff?” Louis complains as he sets the hamster’s cage down on the shelf and drops the bag Harry had shoved into his hands on the floor.\n“Mr. Whiskers,” Emily corrects, and she bounces up onto her tiptoes so she can poke a finger through the bars of the cage and wiggle them at him. Louis watches the hamster poke its head out of a plastic igloo and scamper over the wood shavings to sniff at Emily’s fingers. “Can you take him out, Daddy? I wanna hold him.”\n“How do you even know it’s a boy,” Louis muses as he unlatches the door and scoops it up. It’s a tiny little thing that fits in the palm of his hand, fur sticking out from between Louis’ fingers as he cups his hands around it so it doesn’t try and jump or something. That’s all he needs, is to kill his daughter’s class pet. As he’s handing it over to Emily, he catches a glimpse of its backside and mutters, “Jesus. Well, I asked.”\nAfter he’s asked Emily to sit down and keep a firm grip on the thing, he tugs his phone out and opens a text to Harry, taps out, ‘Did you know hamsters have balls the size of a human’s ??’ He hesitates for a moment, not one hundred percent sure that’s appropriate to send to your daughter’s teacher, who you definitely do not want to sleep with and are trying not to even consider a friend. Boundaries are important.\nHe hits send anyway, because the thing’s balls are ridiculous and he’s kind of in awe, and Louis’ not sure Liam’s ever even seen a hamster before, so he probably wouldn’t understand Louis’ amazement. Harry has to see that thing everyday, though, so he gets it. Louis chokes on air when he gets Harry’s response.\n            I know, is it weird that I’m jealous of how well endowed a rodent is?\nNow would probably be a good time to take a healthy step back from...whatever he’s got going on with Harry, Louis thinks. The thing is, he’s been trying really hard to keep it professional, because he hasn’t so much as been on a date since he and Eleanor got divorced, and he’s not sure he’s ready yet. Also, Harry is Emily’s teacher, and there are rules about this sort of thing. He hasn’t stooped low enough just yet to check the school’s official rulebook, but he’s had a few close calls.\nThe problem is that Harry makes it really bloody hard to stay professional. He’s come to realize over the past two months that Harry is just a naturally flirty person, but he’s seen Harry around the other parents and even around Zayn and Niall. Louis knows that Harry is different around him, can see that his smile widens and his eyes sparkle and he stands just a bit too close, and it feels good.\nSo instead of backing off, instead of turning off his phone, or telling Harry that yes, that is weird, and leaving it at that, Louis finds himself typing, ‘Come off it, mate, I’ve seen the size of your hands and feet, you’re not fooling anyone.’ He hits send before he can second-guess himself, then shoves his phone between the sofa cushions and turns his attention back to Emily and Mr. Whiskers.\n;;\nOn Saturday, Louis lets Emily put Mr. Whiskers in his running ball. He pops some popcorn and puts Tangled on the telly, and they sit huddled together on the sofa and alternate between watching the movie and watching the hamster wheel his ball around the room. Emily giggles every time he bumps the ball into a piece of furniture, and at one point, Louis has to rescue Mr. Whiskers when he manages to get stuck between the edge of the entertainment center and an enormous planter that Louis’ mum had given him as a housewarming present, complete with a ficus that has honestly seen better days.\nHe takes Emily over to Liam’s for a barbeque that night, pleased when she runs off all of her energy chasing Loki around the yard. She passes out the moment he buckles her into her carseat, and once he’s got her in bed, he crawls into his own without even bothering to wash the smell of barbeque smoke out of his hair first.\n \nLouis doesn’t realize until the next morning that they never put Mr. Whiskers back in his cage. Dread creeps up his spine as he tiptoes out into the hallway, determined not to wake Emily up, just in case. He finds the running ball sandwiched between the ficus and the bookcase again, and curses quietly when he pokes it and the hamster doesn’t move. Of fucking course. Leave it to Louis to kill the class pet. He pads back into his bedroom to grab his phone, calls Liam and begs him to come watch Emily for an hour while he buys a replacement.\n“Liam, please, I know it’s like eight in the morning, but I killed her fucking pet, I have to go get a new one before she wakes up!”\n“Louis,” Liam whines. “What if she wakes up while you’re gone? I won’t know what to tell her! Just text me a picture of the stupid thing and I’ll go get you one instead. I’ll even get dressed right now.”\nLouis hears the sound of sheets rustling over the line, and then a muffled thud, followed by a string of curses.\n“You owe me,” Liam pants into the phone a moment later. “Big time.”\n“Yes, absolutely,” Louis babbles. “Anything, I promise, just please get one that looks the same, and get it fast.”\nAs much as it grosses him out, Louis opens the running ball and snaps a photo of the poor hamster to text to Liam. He’s not really sure what the right thing is to do in this situation. Does he throw it away? Bury it in the backyard? Flush it down the toilet?\nIn the end, he grabs a shoebox from the depths of his closet and shakes the hamster into it, gagging when its body hits the bottom of the box, then wraps it in a garbage bag and sets it by the back door until he can decide what to do with it. Liam shows up twenty nerve-wracking minutes later, and they put the new hamster into Mr. Whiskers’ cage as quickly as possible, then dispose of the little box he’d been given at the pet store.\n“Fuck,” Louis breathes when he hears rustling coming from Emily’s room. He yanks Liam into a hug and murmurs, “Thank you. You saved my life.”\n“Of course,” Liam laughs, hugging Louis back just as tight. “What are you going to tell Harry, though?”\nLouis pulls back, panic setting in again.\n“Do you think I need to? I don’t need to, right? I mean, he’s already seen me drunk off my arse, and I might have accidentally told him he has a big cock on Friday, I don’t know if -”\nHe’s cut off by a bark of laughter, and he scowls at Liam as he shoves at his shoulder.\n“He’s going to think I’m a bad parent,” Louis whines, but Liam clasps his shoulders and shakes him briefly.\n“Louis, he’s not going to think you’re a bad parent. He’s going to think you’re honest, and probably that you’re young and single and Emily was away for the weekend, so you had a bit of well deserved fun. I don’t really know what to say about the cock thing, to be honest, but I’d wager he was pleased. You’re fit and single, he’s fit and single, he apparently has a big dick, what’s the problem?”\n“The problem,” Louis hisses, “is that he’s Emily’s teacher and there are rules. Also, I just killed his fucking hamster.” He sighs. “And dating when you have a kid is... complicated. I don’t want to mess with Em’s head.”\nThere’s a patter of feet behind them, and then Liam is letting go of Louis and calling, “Hey, Em!”\nEmily laughs delightedly when Liam rushes forward and swoops her up into his arms so he can blow a raspberry against the side of her neck.\n“Uncle Liam! Did you and Daddy have a slumber party?”\n“No,” Liam laughs. He shoots Louis a pointed look, then says, “I came to get you guys so we can go eat some donuts and go to the park. Daddy said he’s going to let you climb the trees with me today.”\nAny gratitude and affection for Liam he may have had vanishes in that moment. Louis glares at Liam, trying to convey just how displeased he is through his eyes alone. Traitor, he mouths, but Liam just shrugs and brushes a kiss across Emily’s forehead before setting her down.\n“Go get dressed, Em, let’s go!”\nThe moment Emily’s left the room, Louis grits out, “You are the worst best friend in the world, Liam Payne. If my daughter falls and breaks her arm or, like, her head, it will be all your fault.”\n“Relax, Lou, I’m not going to let her fall, who do you think I am?” He turns toward the hallway to go help Emily pick out an outfit, but pauses so he can look back at Louis, one eyebrow raised pointedly. “And hey, maybe while we’re climbing trees, you can call Harry and tell him about you-know-what. Maybe even some other things as well.”\nHe smirks at Louis, then disappears around the corner. Louis groans and scrubs his hands over his face. What a fucking mess this Sunday has turned out to be. And it’s only...he holds his phone up to his face to check the time. 9:30 in the morning. Great.\n;;\n“Wow, Lou, slow down.”\nLouis drops onto a bench and tucks his head down between his knees. “Sorry,” he mumbles into the phone. “I’m not a bad parent, I promise. I’ve never left Emily in the car, or in a store, or at the park. I was distracted by the cartoon version of Zachary Levi, who knew cartoon characters could be so attractive?” He’s babbling. “I’m babbling, oh god, please make me stop.”\nHarry laughs, and the sound of it ripples down Louis’ spine and raises goosebumps along his arms. It’s low and raspy and tinged with static, and Louis feels his heart rate pick up for an entirely new reason.\n“Louis, I’ve had to replace that hamster three times in the past two years. What did you do with it?”\nLouis sighs and rolls his forehead against his knee, mumbles, “It’s in a box in my back garden. Liam bought a new hamster, Emily has no idea.”\n“Well, can you bring it to school tomorrow? I’ll get Niall to help me bury it in the garden there.”\nGuilt presses on Louis’ chest, and he finds himself saying, “Don’t bother Niall, I’ll help you. What time should I bring it by?”\nHarry hums into the phone, then says, “10:30 should do it. Zayn has the kids for crafts until 11:15.”\nLouis sighs, then twists around on the bench to check on Liam and Emily. Liam is standing under a low-bearing tree while Emily crawls between the branches like a monkey, face lit up in laughter at whatever Liam is saying to her.\n“I can do 10:30,” Louis responds after a moment of watching them. “I’ll see you tomorrow, Harry.”\n“Okay, sounds good. Hey, and Louis?” Louis freezes and presses the phone against his ear, so hard that the edge of it digs into his skin. “Don’t worry about it, okay? It’s just a hamster. Hamsters die, and it has no reflection on your parenting skills, I promise.”\nLouis closes his eyes against the wave of gratitude and adoration that wells up in his chest, has to swallow around a sudden lump in his throat before he can croak out, “Thanks, Haz. Means a lot.”\n;;\nWhen Louis drops Emily off at school Monday morning, he flushes red with embarrassment the moment he catches Harry’s eye. He tries to escape without talking to Harry like he usually does, but then he remembers that he has to give Harry the imposter Mr. Whiskers and all of his stuff.\n“Morning,” he mumbles as he ambles over, cage clutched in his hands like a lifeline. Emily is already off by her cubby, eager to play with her friends and paying him no mind. Strangely, Louis doesn’t really care this morning, desperate to get out of there as quickly as possible, even though he knows he’ll have to come back in two hours anyway.\n“Hi,” Harry says brightly, and he holds his hands out for the cage, then lifts it to his face so he can peer inside. “How’s Mr. Whiskers doing this morning?”\nLouis’ blush deepens, and he shoves his hands into his pockets and mutters, “Low blow, Haz.”\n“Oh, no, Louis, that’s not -” Harry pauses so he can set the cage back on its stand, then reaches out to grasp Louis’ wrist. When Louis looks up, Harry is watching him with wide, earnest eyes. “I didn’t mean it like that, come on.”\n“No, I know,” Louis sighs. He tugs one hand out of his pocket so he can scrub it over his face and scratch at the two-day growth of beard.\n“Hey, how about you stay after we bury the hamster and have lunch with Niall and Zayn, then come by for pre-naptime yoga? You look like you could use it.”\nLouis raises a skeptical eyebrow and says flatly, “Me. Doing yoga. With a bunch of five year olds.”\n“Yeah,” Harry shrugs. “I do it everyday, it’s very relaxing. And the kids are really cute about it.”\nLouis watches Mr. Whiskers the Fifth run in his hamster wheel as he chews on the inside of his cheek for a moment, then sighs.\n“Alright, fine. But if you tell me to ‘relax my inner eye,’ or something, I’m leaving.”\nHarry snorts and squeezes Louis’ wrist, then says, “Lou, I’m doing yoga with five year olds. We practice standing like birds and swaying like flowers in the breeze.”\n“Right,” Louis mumbles. “Well, I guess I’ll see you in a couple of hours.”\nHarry beams at him when Louis looks back up. His eyes are bright in the sunlight streaming in through the windows, the wispy ends of his curls edged in gold, and Louis has to bite back another sigh. He can’t even bring himself to make fun of Harry for being a hippie anymore, he’s just so lovely. Louis takes a step back before he does something stupid, like kiss Harry on his stupid dimpled cheek, doesn’t let himself look back as he walks out of the room.\n;;\nCarrying a dead hamster in a garbage bag feels much weirder than Louis had expected, and he’d been expecting it to be pretty fucking weird. He kind of feels like he’s doing something shady, like he’s getting ready to hide a dead body and he’s making Harry his accomplice. Which is ridiculous, hamsters die every day, and no one has ever gone to jail for killing a rodent. He doesn’t think.\nThe school hallway is deserted and all of the classroom doors are shut, the soles of Louis’ Vans squeaking on the polished cement floor as he walks down the hall. He isn’t used to the school looking like this, and Louis almost walks right past Emily’s class, only realizes it’s the right one because he sees a flash of messy brown curls in the little window. He only has to wait a couple of minutes, leant against the wall with the trash bag dangling from his hand, before the door is swinging open and Harry is squeezing through the gap.\n“Hi,” he breathes as he lets the door snick shut. “Finally. Kids are extra rowdy, I think yoga’s going to be good today.”\nLouis doesn’t respond, just takes a moment to watch Harry collect himself. He looks a bit frazzled, hair more tousled than usual and the collar of his jumper pulled off-center so that the wingtip of one of his sparrow tattoos is visible, but his eyes are still bright and he smiles when he catches Louis staring, tilts his head toward the back of the school and says, “Shall we?”\nHarry makes a pit stop at an unlabeled door, pulls it open to reveal a mess of brooms and a giant floor polisher. There’s a bucket full of gardening tools in the corner, and Harry grabs a spade, then hipchecks the door shut and leads Louis over to the door to the playground. They’ve finally hit winter, it seems. It’s cold out, enough that Louis’ breath mists when he exhales, and the sky is a blinding white, heavy with the promise of oncoming snow.\nThe school’s property is deceptively large, and the playground is spacious, with a small field for the kids to use for football and kickball games, and a sand pit full of playground equipment and two long swing sets. There’s a small copse of trees in the corner, branches bare and stretching toward the sky like spidery fingers. Box hedges line the side of the building, and Harry leads Louis down the path alongside them, fingers resting lightly in the small of his back.\nThey stop at the edge of the trees and Harry says, “This should be fine.”\nLouis sets the bag down on the grass, but before he can ask for the spade, Harry is dropping to his knees and driving it into the ground. Louis settles on the dirt next to him and reaches out, wraps his hand around Harry’s on the handle.\n“Let me?”\nHarry doesn’t relinquish the spade, just looks over at Louis for a moment, then says, “Why?”\nLouis shrugs.\n“Survivor’s guilt?” Harry snorts at that, but Louis just frowns and says, “I did kill the thing. It’ll make me feel better, I guess.”\nHarry sighs, but lets go of the handle and moves aside. They don’t speak for a few moments while Louis scoops out dirt and builds a small pile beside the beginnings of the little grave. He’s managed to make a small round hole before Harry opens his mouth and says, “I told you not to worry about it. You don’t still think this makes you a bad parent, do you?”\nLouis frowns down at the dirt and doesn’t respond. He knows it’s just a hamster, that the kids will never be able to tell the difference, but it had been a helpless little thing, and he feels kind of terrible about it.\n“Louis,” Harry sighs. “Between placements and training and teaching, I’ve dealt with a fair amount of parents. Trust me when I say you’re doing a wonderful job. I know I’ve told you this before, but Emily is amazing, and she just adores you. And the fact that you’re doing it all on your own...”\nThere’s something that sounds a bit like admiration in Harry’s voice, and Louis shrugs it off, mumbles, “I’ve had help.”\nHe can practically feel Harry’s eyeroll.\n“I know, I know. Liam and your mum. You’re rubbish at taking compliments, you know that?” He reaches out to shove Louis’ shoulder gently, and Louis has to bite back a smile. “Hey, I hope this isn’t too invasive of me, but...”\nHe pauses, like he’s waiting for Louis to say stop. Louis is curious about what he wants to know, though, so he doesn’t say anything, just works on widening the hole. When he flicks a quick look at Harry, he sees that Harry is watching him and chewing nervously on his bottom lip. Louis just quirks an eyebrow and waits for Harry to continue.\n“Why did you and Eleanor...?”\n“Split?” Louis supplies, with another glance at Harry.\nHarry nods, then rushes to tack on, “I mean, you don’t have to tell me if you’re uncomfortable. I was just curious, because you don’t really talk about her helping to raise Emily, but you two don’t seem... hostile when you speak about each other.”\nLouis had forgotten that Eleanor has picked Emily up from school a couple of times, and as ridiculous as it is, he scowls at the thought of her talking to Harry, talking about him to Harry. It’s probably not normal, that he’s being possessive over his daughter’s teacher. No, definitely not normal. He scratches his nose, clears his throat while he considers what to say and how to phrase it.\n“When I was younger, I was... uncomfortable with the idea of people knowing I was gay, so I pretended I wasn’t for a long time. The easiest way to hide it was to have a girlfriend, and Eleanor was so lovely. I hadn’t really planned to take our relationship past uni, but Eleanor got pregnant after a drunk - very drunk night at a uni party, and marrying her was the right thing to do.” He frowns, pauses while he gauges the size of the hole relative to the size of the shoebox. It needs a bit of lengthening, he thinks, so he goes back to digging. “I probably would have stuck with her, if I’m honest, but I guess she got tired of me pretending. She’d known for a while, she told me, and thought we both deserved better.”\nLouis settles back on his heels and drops the spade, chances a glance at Harry. He knows it’s not exactly routine, coming out to your kid’s teacher like this, so he’s not really sure what to expect. Harry is watching him, expression unreadable, his eyes dark in the weak winter sunlight. Neither of them speaks for a moment, and then Harry says, voice loud and sudden in the quiet stillness of the playground, “You do, you know. Deserve better, that is. I mean, you deserve to be happy, Louis.”\nLouis sighs, scrubs a hand over the back of his neck. The ground is already very hard, and despite the chill out, he’s sweating a bit from the effort of digging. As hard as he’s been resisting, Louis can now acknowledge that, somehow, Harry has become a friend, that he’s not just offering Louis empty platitudes because it’s the right thing to do.\nBecause he knows this, the smile he offers Harry is small, but genuine, and he means it when he says, “I am happy.”\nHarry doesn’t answer, just keeps staring at Louis, so Louis averts his gaze and grabs the trash bag. He tears it open and pulls out the shoebox, holds it out to Harry and raises his eyebrows in question.\n“Would you like to do the honors, Haz?”\nA smile curls one corner of Harry’s mouth as he reaches out for the box, and Louis knows that the way their fingers tangle briefly around the cardboard is deliberate. He lets go of the box and presses his hand to his stomach to quell the butterflies, watches with amusement as Harry sets the box in the hole, then scoops up a bit of dirt in his hand and sprinkles it over the top like they’re attending a proper funeral.\n“Mr. Whiskers the Fourth was a good hamster,” Harry says in a somber voice as he picks up some more dirt. “He never pooed on the kids and only bit me once. I think that’s about all you can ask out of a hamster, really.”\nLouis snorts, then schools his expression into one of remorse when Harry shoots him a reproachful glare.\n“Erm,” Harry continues, nose crinkled up in thought. “Ashes to ashes, dust to dust, I know there are more words to this, but I’m drawing a blank and it’s just a hamster, so I don’t feel too bad about it.”\nLouis has to cup a hand over his mouth to stifle a giggle, and this time, when Harry looks over at him, his expression is fond and amused. Louis shakes his head, then says, “Alright, my turn.” He reaches past Harry to grab his own handful of dirt, then says, “I only knew you for one day, Mr. Whiskers, but for what it’s worth, you were the best hamster I’ve ever had. And I’m very sorry that I left you in your ball to starve to death. That was not on.”\nHarry elbows him gently in the side, then grabs the spade and scoops the dirt back into the hole, filling it in around the box and patting down the small mound once he’s done.\n“Right,” he says, and claps his hands over his knees. “Ready to head back in?”\nLouis nods as he watches Harry struggle to his feet. He’s noticed Harry’s legs before, of course he has, but he’s never really realized quite how coltish he is. Harry’s knees wobble a bit as he straightens, and Louis has the sudden image of a newborn horse struggling to its feet flashing through his head as he takes Harry’s proffered hand.\n“You know,” he starts conversationally as they walk back toward the door, “I’m having a hard time imagining you doing yoga, seeing as you have so much trouble controlling your limbs.”\n“Hey.” Harry pouts as he holds the door open for Louis. “I manage just fine, thanks.”\nLouis hums, smiles amusedly at Harry as they head down the hall to Harry’s classroom. They stop beside it and Louis leans back against the wall, tucks his hands behind his back and says, “I’ll be the judge of that.”\nHarry just scrunches up his nose in what Louis assumes is meant to be a menacing expression, but just comes off as kittenish and adorable, then says, “Wait here, I’ll send Zayn out.”\nNiall meets the two of them out front, and they walk a couple of blocks over to a cafe for sandwiches and tea. It’s a nice lunch, easy conversation and friendly banter, and Louis is in a much better mood when Zayn and Niall drop him back off in front of Harry’s classroom thirty minutes later.\n“Have fun in there,” Zayn says with a sly little grin. “Harry is very bendy.”\nLouis fights against a sudden barrage of images - Harry in bizarre yoga positions, Harry bent over his desk in yoga pants, Harry spread out on Louis’ bed with his legs folded over Louis’ shoulders. Zayn smirks knowingly when Louis blushes, and Niall reaches out to clap him on the shoulder.\n“Don’t fall over. You don’t need a bunch of five year olds knowing they’re better at something than you are.”\n“Thanks, guys,” Louis says dryly. “Very reassuring, I appreciate it.”\n“Bye Lou,” Zayn calls, already halfway down the hall, and Louis rolls his eyes at Niall before turning to peek in the window. It looks like the kids are tidying up from lunch, so he taps lightly on the door, jumps when it opens immediately to reveal a beaming Harry Styles.\n“Hi, Louis,” he says brightly, then turns to address the kids. “Hey everyone, remember Emily’s father? He’s going to be doing yoga with us today! Everyone say ‘hi Louis.’”\nA chorus of hellos goes up from the kids, and Louis offers them an embarrassed wave. He catches Emily’s eye from where she’s sat at her blue table, sharing a container of carrots with Bella from the swimming pool, and winks at her. She’s not gotten the hang of winking yet, but she tries, scrunches her entire face up and ends up blinking both eyes instead of just one. Louis gives her a thumbs up anyway, because she’s just so cute.\nHe hangs back and waits while Harry helps the kids tidy up, then tells them to grab their mats as he walks over to his desk. Louis’ not sure what Harry is doing as he crouches down to dig through the bottom drawer, then tugs a piece of cloth out and loops it around his neck. His confusion deepens when Harry ties the ends in a knot, but then Harry is pushing it up over his forehead and gathering his fringe back so it’s out of his eyes, and. Oh.\nLouis watches Harry grab two mats from where they’re leaning against the wall, then skirt the edge of his desk and approach him. His jumper is loose today, billowing around his frame as he walks, and his legs look endless in those jeans. He seems to have slipped out of his shoes at some point, socked feet dragging against the carpet, and all of that, combined with the way his hair is pushed back by the headband, is, ironically, making it a bit hard for Louis to breathe.\nHarry hands Louis one of the mats and says, a thread of concern woven through his voice, “You alright, Lou?”\nLouis nods frantically as he accepts the mat from Harry, then takes a step back. Harry smells overwhelmingly like dirt and what he thinks might be gingersnaps, and it’s an oddly heady combination.\n“I’m fine,” he rasps, then waves the mat around and says, “Where should I set up?”\n“You can sit next to me, if you’d like. The kids have today’s routine down, mostly, so this way I can help you out.”\n“Right,” Louis mumbles. He unrolls the mat and sets it on the floor, then toes off his Vans and waits for further instruction. He doesn’t look over at Harry again, doesn’t want to think about what Zayn had said when he’s in a room full of children, instead watches the kids get ready for yoga time. It’s pretty adorable, watching them all take their shoes off by their cubbies, then carry miniature yoga mats over to the center of the room and spread them out. The kids seem to know what to do already, so Louis mimics the way they all sit down in the centers of their mats and cross their legs.\nOnce they’re all seated and waiting, Harry shuts the classroom lights off so it’s lit only by the sunlight peeking through the blinds, then docks his phone in a set of speakers and turns on what sounds to Louis like elevator music. He settles onto his own mat and throws Louis a smile, then turns to the rest of the class and clasps his hands together in front of his chest and says, “Namaste.”\nThe kids repeat Harry’s actions, palms together as they chorus, “Namaste.”\nHarry lowers his hands and says quietly, “Right, we’re going to start with our five breaths, okay?”\nLouis watches as the kids each lift one of their hands and does the same, looking back and forth between Harry and the class.\n“Close your eyes and breathe in,” Harry murmurs, sucking in a breath and lifting each of his fingers in turn. Once he gets to five, he starts to exhale, tucking his fingers back into a fist as he goes. “And two more times.”\nLouis lets his eyes slide shut and does as everyone else is doing, taking in a long, slow breath as he raises his fingers, then letting it go as he lowers them back down. He feels his heart rate slow and his shoulders unknot, takes two more breaths, then opens his eyes and waits for Harry to continue.\n“Today we’re going to go visit the polar bears, alright? So first thing, let’s make a snack for the road.”\nConfused, Louis watches as Harry uncrosses his legs and stretches them out in front of himself, feet pressed together. The kids follow suit, so Louis copies.\n“Turn to the right to get bread from the cupboard,” Harry murmurs, and they all twist their torsos and reach behind themselves, then turn back around and set their invisible bread down. “Now left for some peanut butter and jam. And spread the peanut butter and jam on the bread.”\nEveryone runs their hands down their legs toward their ankles, then sits back up as Harry counts them off once, twice, three times.\n“And put the other piece of bread on top,” Harry continues, bending his knees a bit and stretching over his legs to grasp his toes. Louis pops his knees up and flattens his torso down over his thighs, but only gets as far as mid-calf before his muscles start to protest. He isn’t aware he’s made a frustrated noise until he catches Harry smiling at him out of the corner of his eye.\n“Ready to get on an airplane?” Harry asks, and, even more confused than ever, Louis watches all of the kids scramble up onto their knees, then settle one hand on the mat and lean on it. They each lift one leg and place a foot flat on the mat, then stretch the other leg out behind it and lift their free hand into the air. “Make your best airplane noises!”\nThe kids all start humming and making sound effects while Louis tries twisting his body into the same position they’re holding, but by the time he thinks he’s got it, they’ve all started switching to stretch out on the opposite side.\n“Good,” Harry says with a smile as he gets back onto his knees. “Now that we’ve arrived, it’s time for a sled ride.”\nEveryone lies down on their stomachs and bends their feet back, cups their hands around their ankles and tugs back toward their heads. Louis frowns down at the mat as he tries to grasp his own ankles. He turns his head toward Harry and hisses, “I’m not flexible enough for this, Haz.”\nHe’s about to ask Harry if he can just go when he lifts his eyes to actually look at him and nearly loses his grip on his one ankle. Harry’s got both of his hands wrapped around the tops of his feet, body bowed back into a half moon as he stretches himself out. There are curls flopping over the edge of the headband and his lips are parted just so, brow furrowed in concentration, and Louis is almost positive that yoga is meant to be relaxing, not work him up into a frenzy of lust.\nAs Louis watches, Harry lets go of his ankles and says, “And what pulls the sled?”\nThe kids all push up onto their hands and feet, and alright, this is a position Louis is familiar with. He settles into downward facing dog and smiles down at the mat when the kids start barking happily and stretching each of their legs toward the ceiling in turn. The yoga session continues for another ten minutes, and runs through a bizarre set of actions and poses that make up the story of going to visit a family of polar bears and their penguin friends.\nThe kids seem to enjoy it, even if Louis has no idea what’s going on and can’t get his body into half of the positions, and by the end of it all, he’s a sweaty mess, jumper and jeans clinging uncomfortably to his skin. Louis sighs gratefully when Harry tells everyone to lie down on their mats so they can cuddle with the polar bears and look up at the stars. Louis sinks back into the mat and lets his eyes slide shut as he listens to the quiet murmur of Harry’s voice and the soothing background music.\nThis is a yoga position he has no problem doing, Louis thinks to himself as he starts to drift off. He feels something nudge his ankle before he can, though, opens his eyes to see Harry grinning at him from where he’s lying on his side in the fetal position, arms wrapped around his calves.\n“And sit back up,” Harry tells the class quietly, rolling up onto his knees and settling back down with his legs crossed. He brings his hands back up to the middle of his chest and tilts his head as the kids say namaste, then turns to face Louis as the children get to their feet and roll their mats back up. “Well?”\nLouis shakes his head and pushes his sweaty fringe off his forehead.\n“Nope. Yoga is definitely not my thing.”\nHarry laughs as he twists back to shut off the music. Louis licks his lips subconsciously as Harry’s jumper rides up, just enough to expose a narrow strip of pale skin. No, yoga is not for him, but Louis’ got no problem watching Harry do it.\n“Well,” Harry sighs as he straightens back up, and Louis drags his eyes back up Harry’s torso. “Yoga isn’t for everyone, I suppose. It can be very relaxing, though.”\nHe turns to look across the room, and Louis follows his gaze, watches as the kids drag little cots and blankets over to the carpet and settle onto them. They’re all out within minutes, the room full of the sounds of their slow, even breaths, and Louis shakes his head in wonder.\nHe leans over to whisper to Harry, “Is there some sort of DVD I can buy for Emily? This would be perfect for when I can’t get her to go to sleep at night.”\n“She’s not going to want to do it alone,” Harry reminds Louis, and Louis sighs.\n“Nevermind, I suppose I’ll stick to wearing her out by chasing her around the garden.”\nHarry snorts and shakes his head.\n“You’re terrible. She’s not a dog, you know.”\n“Hey,” Louis says defensively, a smile stretching across his face. “I go with what works, mate. I need my alone time.”\nIt’s amazing how Harry’s eyes twinkle like an actual cartoon character, Louis thinks, as Harry smirks at him again and murmurs, voice pitched low and syrup-slow, “Oh, really?”\nLouis’ face heats up at the suggestive tone and he huffs out a breath as he looks away. He can see Emily halfway across the room, asleep underneath a bright yellow blanket with her little hand dangling over the side of the cot so it drags on the floor.\n“I should go,” he murmurs as he watches her sleep, doesn’t even realize Harry’s gotten up until he’s looming over him and patting him on the shoulder. Louis pushes to his feet and rolls up the mat, then slips back into his shoes.\n“You did alright, Lou. I mean, you can’t do yoga for shit, but you tried.”\nHarry’s smile is disarming, despite his words, and Louis can’t even bring himself to be insulted. He walks over to the desk with Harry so they can put the mats away, watches disappointedly as Harry unties his headband and tucks it back into the drawer. He’s got one lock of hair that’s sticking out at a bizarre angle, and before he realizes what he’s doing, Louis is lifting up onto his toes and dragging his fingers through Harry’s hair.\nHis hair is thick and impossibly soft as Louis tugs the curl into place, and he doesn’t realize until he’s dropped his hand and settled back onto his heels that neither of them are breathing. Harry’s eyes are dark and heavy-lidded as he looks down at Louis, and Louis takes a hasty step back.\n“Right. Well, I’m going to go now,” Louis stutters out. “Um, thanks. For the lesson.”\nHe can feel Harry’s eyes on him as he whirls around and strides toward the door. The moment he’s stepped out into the hallway, he presses himself back against the wall, closes his eyes, and takes a slow, deep breath to try and calm the pounding of his heart. He lets out a frustrated little laugh as he turns down the hall and steps out into the brisk winter air. Apparently, yoga with Harry has the exact opposite effect it’s meant to. With a shake of his head, Louis sets off for home, determined to put the images of Harry contorted into various bendy positions firmly out of his mind and use this burst of frustrated energy for something productive.\n;;\nBefore Louis knows what’s happening, it’s time for Christmas holidays. Harry sends Emily home with a warm smile, wishes for a happy Christmas, and a small packet of spelling homework to practice over the break, and with only three days till his birthday and Christmas, Louis is left scrambling to pack things up to take to his mum’s house.\nThis is something they’ve been doing for the past three years. The weekend before Christmas, Louis stuffs a suitcase with a week and a half’s worth of clothing for the both of them, and they drive the hour and a half to his mum’s house. It’s always a bit mad there over the holidays, house fit to burst, but it’s wonderful to be able to get the whole family together all at once and they all dote on Emily, wear her out with attention and lavish her with silly little gifts, so that Louis has to bring an empty bag with them every year just to be able to fit everything in when they go back home.\nThey spend Christmas Eve with just the family, Eleanor drives up on Christmas day and stays the night, then Louis and Emily head back to Manchester on the first of January so that he can get back to work properly. The neighborhood is quiet when they get back into town, lawns covered in a thin blanket of snow so that it looks like they’re driving through a winter wonderland.\nLiam comes over with Loki the next day to distract Emily, so that Louis can get as much work done as possible. He watches them play outside in the snow in between bouts of transcribing an interview with one of the cricket board members, laughing into his tea when Emily manages to shove a handful of the stuff down the back of Liam’s jumper while he’s tying one of his shoes. Louis manages to transcribe all three interviews necessary for his article on the changes to the cricket regulations by the time the sun is setting, so he pops into the Indian restaurant around the corner and grabs a handful of different curries and some naan for the three of them.\nThe next few days are quiet, spent lounging around the house in front of crackling fires. He gets work done in bursts, settled into the corner of the sofa with his laptop while Emily watches Bambi, hunched over his desk while she naps, propped up on the kitchen counter as Emily practices her spelling.\nIn between bouts of writing, he spends as much time cuddled up with Emily as possible before she has to go back to school. They finish Harry Potter and the Philosopher’s Stone, perched on the window seat in Louis’ bedroom as snow falls quietly outside, Emily’s smile pressed into Louis’ bicep as he gives voices to the characters. Louis lets her crawl into bed with him one night and watch The Little Mermaid, curled up on his lap while he sings the songs into her hair, and every day they get all bundled up like they’re about to go exploring Antarctica and take short walks around the block, wellies crunching through layers of frost that’s built up on the sidewalks.\nOne frosty Tuesday, after Louis’ sent Wednesday’s column in to his editor a full three hours before deadline, he drags on his jacket, then buttons Emily into her winter coat and tugs a beanie down over her hair.\n“Where are we going, Daddy?”\n“We’re going for pancakes and hot chocolate,” Louis says as he helps her pull her boots on. There’s a diner down the street that serves chocolate chip pancakes at all hours of the day and will put Bailey’s in the hot chocolate, if you ask. Louis plans on asking.\n“Pancakes for lunch?”\nEmily’s eyes are wide with excitement when Louis looks up, and he nods, leans in to press a kiss to the tip of her nose.\n“Pancakes for lunch,” he murmurs, and Emily claps her hands excitedly, then lifts them up. “Aw, Em, I think you’re getting a bit too big to carry.”\nShe pushes her bottom lip out in a pout, and Louis sighs. One of these days, he’s going to build up some sort of defense against her puppy eyes, he just knows it.\n“I’ll tell you what. How about instead of carrying you, I give you a piggyback ride?” Emily bounces up onto her toes and opens her mouth to respond, but Louis holds up a finger and says, “But you have to promise you’ll hold on tight and that you won’t wiggle around.”\n“I promise,” Emily says, voice solemn, so Louis nods, then turns around and crouches down so she can hop onto his back.\n“Hold on tight,” Louis reminds her as she winds her arms around his neck and clamps her knees against his sides. It’s a bit of a struggle to lock the front door, once he’s got her on his back, but he manages to balance her well enough. It’s only a five minute walk, and the door of the diner opens just as Louis starts up the front walk. He thanks the woman holding it for him as he squeezes inside, smiles proudly when Emily calls a bright thank you to her, as well.\nIt’s deliciously warm in the restaurant, and there’s an empty booth by one of the windows that Louis lays claim to, backing up to it so that Emily can slide off his back and right onto the bench.\n“Okay, monkey. Do you want chocolate chip or blueberry pancakes?”\n“Chocolate,” Emily says immediately, and Louis laughs.\n“Why did I even bother asking?”\nThe waitress brings Emily a paper placemat with a black and white drawing of some My Little Ponies and a handful of crayons to occupy her while Louis peruses the menu. He’s in the middle of placing their order with the waitress when Emily slaps her palm on the table and says, “Daddy! Daddy, look, it’s Harry!”\nHe swivels around in his seat to see where she’s pointing, and sure enough, Harry’s sitting at a small table toward the back of the diner, head bopping gently to whatever is playing through his earphones as he slurps at a milkshake.\n“Daddy, can I go say hi? I’m going to say hi!”\nShe’s out of the booth and halfway across the diner before Louis can even say no, and he sighs as she runs up to Harry and throws her arms around him without even stopping to warn him first. Harry just laughs, though, and scoops her up into his lap, and if Louis sighs dreamily, well. No one but their waitress has to know.\n“Friend of yours?” she asks, and Louis shakes his head, eyes still on the pair of them.\n“Her teacher,” he murmurs. She’s smirking when he manages to drag his eyes away and look up at her.\n“Hot for teacher, huh?” Louis wrinkles his nose and she just laughs, says, “Want to finish your order, babe?”\nThe waitress is just leaving the table to place his order when Emily walks back over, her little hand wrapped around Harry’s thumb as she drags him behind her.\n“Daddy, I asked Harry if he wanted to sit with us!”\nHarry offers Louis a shrug and a sheepish grin, and embarrassment has heat creeping up Louis’ cheeks as he protests, “Oh, Harry, you don’t have to -”\n“He wanted to,” Emily insists as she lets go of Harry’s hand long enough to clamber up into the booth. Then she’s reaching out for him again and pulling on his hand so that he’ll slide in next to her. Louis drops his head into his hands as Harry sits down across from him, only lowers them when he feels a hand on his wrist. When he looks up from where long, narrow fingers are wrapped around his arm, Harry is watching him, the corners of his lips curved up into a reassuring smile.\n“Really, Lou, I did want to. I was just listening to some music by myself, so this is great.”\nThey sit in awkward silence for a few minutes as they study each other. It’s only been a couple of weeks since they’ve seen each other, but it feels like longer, and Harry looks lovely, skin winter pale against the scarlet of his jumper, eyes luminescent in the light streaming in through the wall of windows. He doesn’t move when he hears the sole of Harry’s boot scuff against the floor and feels it press against the side of his shoe, but warmth pools pleasantly in his gut and after a moment’s hesitation, he presses back gently, ducks his head when Harry’s face breaks out into a wide grin. Emily finally breaks the silence by grilling Harry about how he spent Christmas.\n“I went home to see my mum,” Harry tells Emily as he helps her color in the wing of one of the ponies.\n“Where does your mummy live?”\nLouis opens his mouth to tell Emily that this isn’t an interrogation, but Harry beats him to the punch.\n“She lives in a small village in Cheshire, do you know where that is?” Emily shakes her head no, so Harry explains, “It’s about an hour away, if you drive south, like you’re going to London.”\nEmily’s eyes are wide as she stares up at Harry, and her voice is quietly awed when she asks, “Does your mummy live with the Queen?”\n“No,” Harry laughs. “Unfortunately, she doesn’t live very close to the Queen. She has a normal house, very far from London, just like you do.”\nEmily hums as she picks up one of the crayons and starts coloring again. She asks, “Can I come see it?”\n“Emily,” Louis hisses, mortified, but Harry just laughs again and bows his head over the drawing. He’s got most of his hair tucked up under a beanie, but a few stray locks have escaped and are curling distractingly against his temple.\n“Maybe someday, Emmy, we’ll see.” He flicks a glance up at Louis through his lashes, eyes suddenly dark, and Louis’ breath catches in his throat when he murmurs, “It all depends on your daddy, really.”\n;;\nIt’s not easy, seeing Harry every day again once school starts back up. Every time he drops Emily off or picks her up, he flashes back to that moment in the diner. He hadn’t been prepared for that, for the way Harry had pretty much told his daughter that he’d like to take Louis home to meet his mum. Well, he hadn’t said that in so many words, but it had been implied. Louis thinks.\nHe manages to keep the contact to a bare minimum, out of self-preservation. Brief chats when he picks Emily up and drops her off and the occasional response to a text, though he makes a point of not initiating. Eleanor has to take an unexpected trip to Paris the weekend she was meant to take Emily, so Louis and Liam’s next lads night ends up being pizza and beers on Louis’ sofa while they play FIFA until two in the morning. Perfect excuse to not have to invite Harry out, Louis tells himself.\nOverall, he’s doing a good job of staying aloof, but halfway through February, Harry sends a note home with Emily asking if Louis would like to volunteer to come teach the kids how to play football in a few weeks. Forgetting about his self-ban on initiating text conversations, Louis pulls out his phone and types in, ‘How do you even know I know how to play football?’ His phone buzzes a couple of minutes later with a response.\n            Don’t be silly, Emily talks about you all the time. I know everything about you ;) xx\nOh no. Louis probably needs to have a talk with Emily about what is and isn’t appropriate to tell people. He heaves a sigh and taps out, ‘It’s all lies, I promise. I can play footie with them, though, just tell me when. x’\n \nLouis shows up to Emily’s class on the first Friday in March wearing trackies and a ratty long-sleeved shirt. He’s a bit embarrassed to be seen by Harry dressed like this, but playing football in jeans is incredibly uncomfortable, and even he’s not that vain. The kids have just woken from their naps and are having a small snack while they wake up when he walks in.\nEmily runs over to give him a quick kiss before sitting back down and demolishing her apple slices, and Louis walks over to Harry’s desk. He’s sprawled out in his chair with a bag of celery in his lap, hair still pulled back in a rolled up bandana. His legs are stretched out and crossed at the ankle, and they look absolutely endless like that, and Louis wants nothing more than to crawl into his lap and hitch those legs up around his waist.\nInstead he settles back onto the corner of Harry’s desk and leans over to steal a celery stick. The second he puts it in his mouth, he remembers that he despises celery, but he makes himself eat it anyway, nose scrunched up in distaste. Harry quirks an eyebrow, but doesn’t say anything, just switches his attention back and forth between Louis and the kids while they finish up snack time.\n“Michelle, please don’t put your carrots up your nose,” Harry sighs. Michelle just giggles and pops the carrot into her mouth. Harry turns back to Louis, completely unfazed, reaches out to nudge Louis’ trainer with his boot. “So. How have you been, Lou? Haven’t spoken to you much lately.”\nHe says it so quietly and matter-of-factly that a tendril of guilt curls in Louis’ belly and he scrubs his hand over the back of his neck in discomfort. Louis clears his throat and says, “Yeah, sorry, I just...”\nHe’s at a loss, though, can’t think of an excuse that won’t sound very obviously hollow. He catches a sad little downtilt to Harry’s mouth, and the guilt intensifies when Harry mumbles, “‘S okay. I understand.”\nHe opens his mouth to say something - he’s not sure what, just anything to get that despondent look off Harry’s face - when Harry sits up very suddenly and tosses his celery sticks onto his desk, then calls out, “Alright, kiddos, time to put your snacks away. We’re going to go play some football!”\nThe temperature has been rising steadily as they cruise toward spring, but it’s still brisk out, the air a bit misty, so Harry has the kids put on their coats before leading them outside. He’s got a bag of miniature footballs waiting for them on the field, and when Louis looks over at them, he sees Niall waiting next to them, a cheerful smile on his face.\n“Hey, Louis,” he says as they walk over, herding the kids toward the center of the field. “I’ve got a free period and thought maybe you could use some help.”\n“Yeah, great,” Louis enthuses. “Thanks, mate.”\nThe kids are too small to play proper football, and a few of them know how to kick the ball already, so they take a half hour to split the kids up into pairs and just kick a ball back and forth so they can get used to it. They can’t kick it very far, or even in straight lines, but it’s pretty fucking adorable watching them try. Louis, Harry, and Niall wander between the pairs, praising them and offering encouragement to the ones that seem to be struggling a bit more than the others. Louis stops by a girl named Caroline, who keeps accidentally kicking her ball over to Luke instead of across to Barney, and crouches down.\n“Hey, Caroline, are you having fun?”\nShe huffs out a frustrated sigh and says, “I can’t get it right.”\n“Here, let’s see you kick it.” Louis cranes his neck so he can look for Niall or Harry, holds his hands out for a spare ball and waits for them to toss one over. He sets it down in front of Caroline and says, “Try kicking it to Barney, okay?”\nHe watches as she aims, her brow furrowed in concentration, but the moment she snaps her foot forward, she closes her eyes and ends up clipping it with the side of her shoe, instead. He spends a few minutes helping her out, stays by her side until she’s stopped closing her eyes when she kicks, then rubs her back encouragingly as he pushes to his feet. He catches Harry watching him out of the corner of his eye, expression soft and unbearably fond, and before he can stop himself, he winks at Harry, then continues walking amongst the kids.\nThey start to get bored of kicking back and forth, so Harry and Niall split them up into two teams and use traffic cones as makeshift goals. They’ve got a bunch of well-worn penny jerseys to give each team so that they match, and Louis stands in the center of the little field and says, “Okay, where is my red team?”\nThe kids wearing red jerseys raise their hands obediently, fingers waggling excitedly. Niall is standing between one set of cones with his own red jersey on, and Harry is on the opposite side in green.\n“All you guys have to do is kick the ball over to the green side of the field, okay? Just kick it over to Harry and try and kick it between the two cones. Green team, you need to kick the ball to Niall, on that side. Try not to kick each other, that’s very important, alright? Are you guys ready?”\nA cheer goes up from the kids, and Louis calls them to action while he plays referee. The game is a bit of a disaster. The kids can’t seem to remember which side they’re supposed to be running toward, and Louis tries to instruct them, he really does, but they seem to be having so much fun, running around in aimless circles. His breath catches when Luke manages to get hold of the ball and kick it down the field toward the correct goal, but a little girl named Claire, who’s on the opposite team, catches it and taps it right into her own goal.\nHarry cheers raucously and holds his hand up for a high five from Claire, and Louis sighs and calls out, “That was the wrong side, sweetheart! You’re green, you’re supposed to kick it over to Niall.”\nHarry just grins up at Louis, eyes literally sparkling in the afternoon sunlight, his smile wide and bright like a beacon, and says, “That’s alright, Lou, the point is that Claire-bear scored a goal!”\nBy the end of the game, the field has descended into chaos. Somehow, they’ve managed to get hold of two more balls, and they’re kicking them every which way. Harry and Niall have been trying to keep count of the goals that they let through, and they end up with something approximating to 38 to 27, but Harry just claps excitedly when the he calls time and yells, “Great job, everyone! It was a tie game, congratulations, everyone wins!”\nBack in the room, Louis watches as Harry pulls out an enormous box of first place medals and hands one to each of the kids as they take their seats on the carpet for circle time. He keeps telling them all how proud he is of them, how brilliant they are at football, and fondness swells up in Louis’ chest, threatening to choke him. Fucking Harry Styles and his unbearable loveliness, honestly.\nLouis watches on in confusion when Niall takes Harry’s usual seat in the circle, flower crown in hand, but then Harry is walking over to him, one last medal clasped in his hands. He presents it to Louis with a shy little smile and says, “Coach of the year award. That was really fun, thank you, Louis.”\nLouis laughs and takes the medal from him, rubs his thumb across the face of it as he mumbles, “It was a disaster, Haz.”\n“No, it was wonderful.” He twists around to look at the kids, who are all sitting quietly as Henry speaks, flower crown hanging right over his eyes. “They were brilliant.”\nThe thing is, he sounds so sure of himself, so convinced of their brilliance, that Louis just shakes his head in wonder. Before he can overthink it, he takes a step forward and slips the medal over Harry’s head, instead, and murmurs, “You’re pretty brilliant, Harry Styles.”\n;;\nAfter that, it’s like Louis can’t seem to help himself. He talks to Harry nearly every day, just random, meaningless texts when he has a spare moment or a random thought he wants to share. Emily comes home with a flyer about fundraising for a field trip to the zoo that Harry wants to take at the end of the year, and Louis finds himself volunteering his house to prepare for a bake sale, despite the fact that he’s never baked a cupcake in his life.\nA few of the parents offer to bake pies or cakes from the comfort of their own homes, but Harry insists on helping Louis bake the bulk of it. Louis takes a trip to the supermarket while Emily is at school and buys mass quantities of everything on the list Harry had sent him, along with food coloring and sprinkles so that Emily can help decorate, but Eleanor calls while Louis is sorting everything into rows on the kitchen counter the Wednesday before they’re set to bake it all.\n“Hey El,” Louis greets as he slides a bag of brown sugar across the granite.\n“Hi Louis, I need a favor. My boss wants me to go to New York with her next weekend, so can I have Emily this weekend instead?”\nLouis freezes, a bag of confectioner’s sugar clutched loosely in his hand.\n“Oh. Um, I suppose? We were going to be baking for a fundraiser...”\n“Please, Lou,” Eleanor pleads. “I haven’t seen her in weeks.”\n“Alright,” Louis mumbles. “Sure, I’ll tell her tonight. Maybe I can return all of these sprinkles, then.”\n“Thanks Louis, I really appreciate it. I’ll pick her up from school, will you leave her bag at the front?”\n“Of course. Hey, maybe you could bake something with her, so she doesn’t get upset about missing out here.”\n“No problem. Thanks again, Lou. I’ll see you Sunday, love you.”\nLouis frowns down at his phone once she’s disconnected. This is not how his weekend was supposed to go, he thinks. Now it’ll just be him and Harry, and. “Oh, Christ,” he mutters, and he slumps over the counter and buries his face in his arms. “Perfect.”\nBy the time Harry shows up on Friday night, Louis is an absolute wreck. He’s sure he looks ridiculous, dressed in bum-hugging jeans and a soft, oversized jumper just to bake some cupcakes, but Harry doesn’t say anything when Louis pulls the door open. He just give Louis an appreciative once over, then holds up an enormous tupperware full of what looks like pasta, a canvas bag hanging off his elbow.\n“Ah,” Louis says awkwardly as he steps aside to let Harry in. “Welcome?”\nHarry beams at him as he steps over the threshold and into the house. Louis can smell the pasta sauce when Harry pauses to toe off his shoes, but underneath that, Harry smells like apples and cinnamon, and Louis just wants to burrow into him and his cuddly looking jumper.\n“I brought dinner,” Harry explains as he hefts the container of pasta again, and Louis shakes his head, amused.\n“You didn’t have to do that, you know. I could have ordered something in.”\nHarry shrugs and follows Louis as he starts toward the kitchen.\n“I wanted to, though. I made it just before I came over, so it’s still warm, though you might want to...” Louis looks up when Harry trails off, worries his bottom lip at the expression on Harry’s face. He’s staring around the kitchen, eyes wide in shock as he looks over all of the stuff Louis’ got stacked up on the counters. His voice is faint when he says, “Did you buy out the entire store?”\n“Did I buy too much?”\n“That depends,” Harry muses. “Do you plan on baking enough cupcakes to feed the entire city?”\n“Ugh. I just didn’t want to get too little and have to worry about buying more, so I just -”\n“It’s fine, Louis,” Harry says around a laugh. “We’ll just return what we don’t use. Come on, let’s clear some space so we can mix some batters and get it started before we eat.”\nThey move most of the ingredients into the living room so that they can use the counters, then Louis pulls out all of his mixing bowls and measuring cups and mimics Harry as they make the batter for chocolate cupcakes. Once they’ve stuck the cupcakes in the oven, Harry waves a hand toward the table.\n“Dinner? I brought wine, since Emily’s not here.” Louis’ stomach twists suddenly with nerves as Harry stoops down to tug a couple of bottles out of the canvas bag. Wine. Fuck. “I hope you like red.”\n“Yeah,” Louis croaks, then clears his throat and tries again. “Yes, I like red wine.”\nHe turns to grab plates and wine glasses from the cupboards, flustered as he fumbles them out and tries desperately not to drop them. Homemade pasta and red wine. Two bottles of wine, Louis corrects himself. He can feel nerves churning in his belly as he pulls silverware out of the drawer, then turns toward the table.\nHarry is already seated, hands resting on the top of the container of pasta as he watches Louis quietly. Louis’ nerves intensify as he sits across from Harry at his kitchen table, a sturdy little thing his mum had picked up from a flea market and painted a bright, cheery turquoise. The kitchen is already starting to smell like vanilla extract and cocoa powder, and despite the casual setting, it’s surprisingly intimate.\nThe table is small enough that their feet keep knocking together as they shift about, and even though Louis’ stomach is knotted up, it’s effortless, the way they move together and around each other. Harry hands Louis the pasta to dish out onto the plates while he uncorks one of the wine bottles, then they trade a plate of food for a glass of wine.\nConversation is easy. Louis tells Harry about the one disastrous time he tried baking cookies with Emily and his upcoming article on the World Cup, and Harry talks about his week, silly things the kids said or did and the yoga routine he made up for them on Tuesday about going to the beach. They have to take breaks to take the cupcakes out of the oven and put a batch of red velvet in, and they switch to chocolate chip cookies halfway through dinner, but by the time they’ve eaten most of the container of pasta and polished off one of the bottles of wine, the counters are lined with cooling baked goods and the house smells like heaven.\n“I don’t think there’s any room left to set things to cool,” Harry says as he looks around the room. “We might need to take a break.”\nLouis brushes a bit of flour out of his hair and says, “That’s alright with me. We can go relax in the living room, I’ll put the telly on.”\nHe’s already settled into one corner of the sofa when Harry walks in, one full wine glass in each hand and a bottle cradled in the crook of his elbow. He passes one glass to Louis and sets his and the bottle down on the table, then drops into the center of the sofa with a sigh. Louis’ nerves had settled as the night wore on, but now that Harry is sitting so close, despite the entire half of the sofa that’s been left unoccupied, he feels them start up again, fluttering low in his belly and at the base of his throat. He takes a long sip of wine to try and calm himself down, then tucks his feet up under himself and turns the television on.\nThere’s a football game on, Italy versus Brazil in one of the friendlies leading up to the World Cup, but Harry tugs the remote out of Louis’ grip and turns the volume down to nothing more than a quiet murmur, then swivels around to face him on the sofa, close enough that their knees are pressed together. He props his head up on his hand and takes a sip of his wine, then says, “You know, the kids have been asking if you could come back and play football again.”\nLouis snorts, stares down at his hands as he rolls his glass carefully between his palms. Harry is radiating warmth into the small space between them, his bony knees pressed firm against Louis’ calves when he shifts his position a bit.\n“What?” Harry asks, straightening a foot out to nudge Louis’ thigh. “They had fun, who cares if they played properly? They’re five.”\n“No, I know,” Louis says quickly, and he flicks a look up at Harry. Harry is watching him through heavy lidded eyes, lips stained red from the wine and his hair a disaster of curls, bits of flour woven through the strands. He looks beautiful. Louis takes a careful breath, then continues, “I had fun, too. I’m just not used to seeing people play so...wrong.”\n“They loved it,” Harry insists. “Hey, let’s play. Do you have paper?”\nLouis stares at Harry for a moment, utterly confused.\n“What?”\n“Paper,” Harry repeats. “We’re going to play finger footie, come on. I may be rubbish at actual football, but I’ve got excellent control of my fingers.”\nHe wiggles them to emphasize his point, and Louis is not going there, refuses to think about that in any way other than finger football, no matter how much Harry’s eyes are twinkling, no matter how wide his smirk is. Louis sets his glass down on the coffee table, then heaves himself off of the sofa and pads into his bedroom to grab some paper off the desk. He lets Harry fold it up once he gets back into the living room, watches his fingers move deftly as they crease and tuck, until he’s got a neat little triangle.\n“Okay, come on.” Harry jerks his chin to indicate the floor, then drops off the sofa and onto his knees so he can crawl over to the open space beside it. He flops down onto his belly, then looks up at Louis expectantly. Louis is just sort of frozen, staring down at Harry as he lies there, sprawled out on the carpet with his feet waving in the air and his shirt riding up the small of his back. Harry’s tone is amused when he says, “You alright there, Lou?”\nLouis shakes his head, then shuffles across the carpet so he can stretch out opposite Harry, a few feet of empty rug between them. Harry is pulling the paper football between his fingers as he waits and considers the length of space, and Louis raises an eyebrow, says, “Well? Are you starting, or what?”\nHarry nods sharply, and once Louis has propped his hands up and formed the goal posts with his fingers, ducks his head and takes careful aim. His fingers are long and elegant as he positions the football very precisely, then flicks it firmly out of his own grasp. It goes sailing neatly between Louis’ fingers, and he raises his eyebrows, impressed.\n“Well done,” he murmurs as he tugs the little football out from underneath himself and takes his own aim. They play back and forth, keeping score to themselves as they go. They both keep taking breaks to drink more wine, and they’re getting worse at the game as they go, coordination flagging a bit. As he works his way towards tipsy, Louis gets increasingly distracted by the faces Harry makes when he’s concentrating.\nHarry is trying his hardest, brow furrowed, lips pressed into a firm red line, eyes crossed as he focuses on the paper in front of his face. He’s so stupidly adorable that Louis sort of forgets that they’re in the middle of a game and lets his fingers fall to the carpet once Harry has flicked the paper toward him.\n“No,” Harry gasps, and he scrambles up onto his knees, pointing at Louis accusingly. “You cheated! You moved your fingers!”\n“What?” Louis feels drugged, dazed as he looks up at Harry. The wine is moving sluggishly through his veins, and even though he’s nothing more than a bit buzzed, he feels drunk on Harry, drunk on the intensity of Harry’s focus and how completely he pays attention to everything Louis does. Harry shuffles across the carpet so he can close the gap between them, reaches down to close his hands around Louis’ fingers.\n“You closed your hands before the ball went through,” he says with a little frown, and Louis can’t really help his giggle. “Why are you laughing?”\nHarry’s hands are warm where they’re wrapped around Louis’, the pads of them callused, rough against the soft skin on the tops of Louis’ hands. It’s just that it’s all a bit ridiculous, really, how worked up Harry is getting over finger football. And he looks so adorable, with the flour in his hair and the smudge of cocoa powder on his jumper, lips bright red from the wine, and Louis is so ridiculously gone for this boy.\n“I’m not laughing,” he says around another giggle, and he rolls onto his back so he can rest his head on the carpet and close his eyes. He can’t look at Harry without wanting to either laugh or just surge up and kiss him, so closing his eyes seems like the logical move. The only thing is, with his eyes closed, he only has his ears to tell him what Harry is doing, and he’s got no idea why Harry seems to be shuffling across the carpet until he’s down by Louis’ feet.\nHe feels the press of Harry’s thumb just under the jut of his ankle, and his eyes flutter open reluctantly when Harry murmurs, “Lou.”\nHe lifts his head off the carpet so he can see what Harry is doing. Harry’s just kneeling in the narrow stretch of space between Louis’ feet, hands curled gently around his ankles, and Louis is suddenly having a hard time breathing. This is... The moment feels heavy, dangerous, like Louis’ next move determines whether they move forward or maintain the status quo, and at this point in time, he’s honestly not sure which move he prefers.\nHarry’s eyes are dark, nearly black underneath the fluorescent lights, and his lips are obscene, parted just so as he waits for Louis to say something, do something. Anything. Harry’s tongue flicks out to wet his lips, and want curls helplessly in Louis’ belly, and before he even realizes that he’s made up his mind, he’s spreading his legs to make room for Harry to shuffle forward. He can heard Harry’s sharp intake of breath, is just about to call the whole thing off when Harry lets go of Louis’ ankles and falls forward onto his hands, uses the newfound balance to crawl up Louis’ body.\nThe air has gone thick around them, and Louis feels like everything is moving in slow motion as Harry gets closer, then stops once he’s hovering right over him, knees bracketing Louis’ hips and thumbs just brushing the edges of Louis’ jaw. They stare at each other for a long moment, and then Louis can’t really take it anymore, he just needs to touch. He needs -\nHe surges up onto one elbow and lifts the other hand to curve around the back of Harry’s neck, then yanks. Harry crashes into him with an ‘oof,’ elbows giving out with the force of Louis’ tug, and then they’re kissing, finally kissing, and it’s. Overwhelming. Better than Louis had imagined, and he’s entertained quite a few embarrassing fantasies about Harry’s mouth. He tastes like cookie dough and wine, and smells even better, and his hair is soft underneath Louis’ hand, curls winding around his fingers like silken ropes.\nThe kiss is sloppy and rushed, but Louis doesn’t care, doesn’t ever want to stop, so when Harry moves to pull away, he just lifts his other arm and loops them both around Harry’s neck and tugs him down, down, until Harry is forced to settle over him. And this, Louis thinks, is what he’s been waiting for for months. Harry is warm and solid above him, and his mouth is soft, lips plush and teeth sharp where they dig briefly into his bottom lip, and Louis thinks hazily that he could probably kiss Harry forever.\nHe loses track of how long the lay there kissing, legs tangled on the carpet and Louis’ hands buried in Harry’s hair, but when they finally part, his mouth feels swollen, lips nearly numb, and happiness is bubbling up in his chest until he feels light, like he could just float away.\n“Oh my God,” Louis giggles, and he feels Harry’s lips curve up into a smile where they’re pressed against the side of his neck. “We just snogged on the floor in my living room.”\nHarry hums against his skin, then murmurs, “And I would love to continue snogging, but we should probably go make some more cupcakes.”\nLouis sighs as Harry pushes to his feet, but he lets Harry help him up, giggles again when their feet tangle and he stumbles and falls against Harry’s chest. “Oops,” he murmurs when Harry’s arms come around his waist to steady him. “I fell.”\n“Sure you did,” Harry says with a laugh, and then he pats Louis’ bum and pulls away. “Let’s go finish baking so I can snog you some more.”\nThe baking had been fun before the kissing, but it’s even more fun after. Louis keeps catching Harry stealing glances at him, lips still red and cheeks stained pink, hair even wilder than before, and he can’t really help himself when he leans over and closes his mouth over Harry’s the fourth time he catches him. Harry hums into the kiss and drops his mixing spoon with a clatter so he can turn toward Louis and pin him against the counter.\nLouis forgets that he’d been mixing the cookie dough by hand and slides it across Harry’s back, smearing flour and melted butter into the fabric, and he bursts into laughter when he feels Harry’s nose wrinkle, pulls back and whispers, “Oh, I’m.” He giggles. “I’m sorry?”\nHarry lets out a little growl, but he just drops a kiss to the tip of Louis’ nose, then moves away so he can go back to stirring the cupcake batter. He’s making rainbow cupcakes, has six different bowls set out so he can separate it out and dye each one a different color. Louis washes his hands and gets back to the cookies, manages to get two trays into the oven before Harry is even done dying all of the batter.\nHe hooks his chin over Harry’s shoulder, not caring that he’s getting flour and butter all over his own jumper now, and slides his hands around Harry’s waist, settles them flat over his belly. Harry tilts his head to the side so he can rub their cheeks together, then says, “Do you want to start frosting the other cupcakes?”\n“Sure,” Louis murmurs, turns his face into the side of Harry’s neck and drags his teeth over the skin there. He feels Harry shudder, feels his abs clench underneath his hands, and pulls away with a self-satisfied little grin. There are three enormous bags of frosting chilling in the fridge that Harry had whipped up earlier, so Louis grabs one and moves over to a batch of cooled cupcakes. “Just... swirl?”\nHarry shuffles over so that he can demonstrate on one of the cakes, and Louis nods, takes the bag back and tests one out. It’s not as pretty as Harry’s, but it’s passable, he thinks. He manages to frost over half of the cupcakes by the time Harry’s taken the cookies out and put the rainbow cupcakes into the oven, then he grabs another frosting bag and helps Louis finish.\nOnce they’ve pulled the last of the cupcakes out of the oven and set them down to cool, Louis drops onto one of the kitchen chairs and watches Harry as he settles his hands on his hips and surveys the room.\n“Well,” he announces, “I think we did alright.”\nHarry sniffs as he looks around the room, then freezes and turns to look at Louis. “Do you think we should make a vegan option?”\nLouis narrows his eyes at Harry and growls, “Harry Styles, I swear to God.”\n“Okay,” Harry laughs, hands held up in a placating gesture. “Forget I asked.”\nThey’ve got four different kinds of cupcakes and three kinds of cookies covering every single surface in Louis’ little kitchen, and the sink is piled high with bowls and spoons and measuring cups that Louis absolutely does not want to deal with. He knows he’ll have to eventually, though, so he pushes out of the chair and moves over to rinse some of them out, then stack them into the dishwasher.\n“Handy things, dishwashers,” Harry points out inanely, and Louis snorts, raises an eyebrow at Harry over his shoulder.\n“Really, Haz?” Harry just shrugs and smiles serenely at Louis, and Louis sighs. He turns his attention back to the machine so he can punch in the proper setting, then shuts it and turns back around, eyes Harry up and down. “You’re a mess, Harry Styles.”\n“Well, you’re not much better, Louis Tomlinson.” He points at the front of Louis’ jumper, but Louis just shrugs.\n“Here. I’ll do a load of wash,” Louis says as he holds a hand out toward Harry, and Harry stares blankly at it for a moment, then looks back up at Louis.\n“What? Do you want me to take my jumper off?”\n“Would you rather me wash it with you still in it? Might be a bit of a tight fit, you know.”\nHarry rolls his eyes, but the corner of his mouth hitches up and he closes his hands around the hem of his jumper so he can tug it over his head. He raises an eyebrow while he hands it to Louis, says, “What am I supposed to wear home?”\nLouis shrugs in what he thinks is a good approximation of a casual gesture. In actuality, he’s having a hard time breathing again. He’d known Harry was fit, of course he had, but he hadn’t know just how fit. His abs, good lord. Louis swallows around the lump of desire that’s lodged itself in his throat and lifts his gaze to Harry’s, curls his mouth up into a suggestive smile.\n“I guess you’ll just have to wait till it’s ready.”\nHarry hums and stalks toward Louis, expression predatory as he asks, “And what exactly would waiting entail?”\nLouis grins and tries to twist away before Harry can catch him, but he’s not quick enough, and Harry draws him in close so he can bend over him and bring their mouths together. He doesn’t kiss him though, not yet, and Louis’ breath catches in his throat. Both of their eyes are open, and Harry’s are a dark green blur, the shape of his hand splayed across Louis’ back burning into his skin like a brand.\n“Maybe we should get you out of your jumper as well, hmm?” Harry’s lips drag against Louis’ as he talks, and Louis’ eyelids flutter when the tips of Harry’s fingers dip under the waistband of his jeans. Before he knows what’s happening, Harry is setting him back a step and tugging his jumper up over his head, fingertips trailing over Louis’ skin as he goes.\nLouis shivers. It’s cool in the house, but Harry’s gaze is like fire as his eyes rove over Louis’ body, and Louis has to fight a sudden urge to cross his arms over his stomach. He’s pulled out of his uneasiness, though, when Harry drops his jumper on the floor, then falls to his knees and shuffles forward so he can cup his hands around the backs of Louis’ legs.\nIf Louis had been having difficulty breathing before, now he can’t breathe at all. Harry looks like sin, like a fallen angel as he stares hungrily up at Louis and runs his hands up Louis’ legs. Louis has to steady himself with hands on Harry’s shoulders when he tightens his grip on the backs of Louis’ thighs, and he lets out an embarrassing whimper when Harry leans in and nuzzles against the already desperately hard line of Louis’ cock through his jeans.\nLouis is not ready for this. He’s been thinking about what it would be like to have Harry’s mouth on him since that night at the bar back in October, and now that the moment is finally here, he thinks he might pass out. He digs his nails into the skin of Harry’s shoulders when he opens his mouth and presses his tongue against the fabric over Louis’ erection, spreading damp through the denim and working Louis up into a near frenzy at the heat and pressure and the fact that this is Harry.\nHe almost sobs with relief when Harry lets go of his legs so he can unbutton his jeans and work the zipper down, stumbles forward a bit when Harry gives a sharp tug that has his trousers and pants pooling around his ankles. He feels incredibly exposed, standing there naked with Harry kneeling in front of him, but any embarrassment he might have been feeling vanishes when he catches a glimpse of Harry’s face. He looks -\nHarry looks absolutely wrecked, eyes dark and hungry, pupils blown so wide they nearly eclipse the green. He’s already breathing hard and licking his lips in anticipation, and desire curls so tight in Louis’ belly that he whines and squeezes at Harry’s shoulders to try and urge him on. Harry nods, flicks a quick glance up at Louis, then, without warning, wraps a hand around the base of Louis’ cock and closes his lips around the head.\nIf Harry wasn’t doing his absolute best to suck Louis’ brain out through his dick, Louis would probably have the energy to find the fact that his daughter’s teacher is an expert at sucking cock rather disturbing. As it is, though, he’s barely managing to stay upright while Harry sucks him down, tight wet heat and the swirl of his tongue over the head when he pulls off. Harry keeps looking up at him through his lashes, lips stretched around him, and this is going to be over embarrassingly quickly.\n“Harry,” Louis pants out, fingers scrabbling for purchase against Harry’s skin as he sinks down, and all it takes is the head of his cock hitting the back of Harry’s throat and his orgasm slams out of him, entire body trembling with it as Harry swallows around him.\n“Oh god,” Louis gasps as Harry pulls off, swiping the back of his hand over his mouth. “Oh god, that was.”\nLouis cuts himself off, not sure what he’s even trying to say. He watches Harry struggle to his feet, long limbs awkward and ungainly as he unfolds himself, and Louis doesn’t even wait till he’s settled onto his heels before tucking a finger into the waistband of Harry’s trousers and jerking him forward.\nThey kiss hungrily, wrapped around each other in the middle of the kitchen, until Louis eases back a millimeter and murmurs, “Let’s get you into the shower, babe. You’ve got flour in your hair.”\nAs they walk toward the back of the house, Louis has a moment of blind panic when he can’t remember if he’d tidied up his bedroom and bathroom, but when he pushes the door open, he breathes a sigh of relief. His bed isn’t made, but the floor is free of discarded clothes and there are clean towels in the cupboard in the bathroom. He fiddles with the shower knobs while Harry strips down and they crowd into the tub together as the small room fills with steam.\nLouis wastes no time in getting his hands on Harry, slides them down his chest to cup his hips as he lifts onto his toes for a kiss. He can feel Harry’s chest hitch when he closes a hand around his cock, brings him off slowly as the water streams over them and Harry’s hands clench and unclench where they’re wrapped around Louis’ hips.\nSleepy and sated, they wash their hair and stay huddled together in the shower until the water runs cold, then stumble out and towel off quickly. It’s freezing in the bathroom, and Louis is ready to get in bed and burrow under the blankets. He drops his towel on the tile floor, then takes a running leap onto his bed while Harry laughs at him and ambles in.\n“Come snuggle,” Louis demands as he holds the edge of the blankets up, waiting for Harry to crawl in after him. He doesn’t have to wait long, just enough for Harry to drape his damp towel over the back of Louis’ desk chair, and then he’s slipping into bed with him and pressing close.\nIt smells like cupcakes, even all the way in Louis’ bedroom, and he feels happiness wash over him as Harry curls around his back and fits a hand down over his chest, knees tucked together, and he falls asleep to the slow, even rhythm of Harry’s breaths against the back of his neck.\n;;\nIt takes Louis a moment to remember where he is when he wakes up the next morning. The room is familiar, awash with light, but the weight of another body behind him is not, and he nearly says ‘Liam’ before he remembers. Oh.\nHe doesn’t have time to panic, though, because Harry makes a smacking noise that is stupidly adorable, and then he’s mumbling, “Louis?”\nHarry is a bit devastating first thing in the morning, Louis discovers when he rolls over. His face is soft and sleepy, eyes heavy and lips bubblegum pink, and when he yawns, his tongue curls against the roof of his mouth like a puppy. Louis crawls over him and settles across his chest, stacks his fists so he can rest his chin on them and look down at Harry while he wakes up.\nHarry’s hands slide slowly up his back, and Louis murmurs, “Do you want some tea?”\nHarry hums and smiles, a slow, lazy curl of lips. “Tea sounds lovely.”\nLouis finds a pair of joggers that drag the ground when he wears them and tosses them to Harry before slipping into a pair, himself. The kitchen looks like they’ve raided a bakery, counters littered with multicolored sweets, and Louis thinks it’s probably a good thing Emily isn’t here, in the end, because she would want to eat one of everything.\n“What sort of tea do you like?” Louis turns to look back at Harry as he pulls a couple of mugs out of one of the cupboards. He tugs another cupboard open so that Harry can see what his options are.\n“Jasmine, please,” Harry decides after a moment’s contemplation. Louis scrunches his nose up in disgust, but looks over the boxes in search of the jasmine. He finds it on the top shelf, along with the echinacea, because no one ever drinks them. And with good reason, Louis thinks as he stretches up onto his toes to get the box down. The tips of his fingers barely clear the bottom of the shelf, though, and no matter how much he wiggles them or bounces up and down, he can’t reach.\nHe’s just about to drag the stool he keeps in the kitchen so Emily can wash her hands at the sink over, when he feels Harry crowd up behind him, body pressing him into the counter as he pulls the box down off the shelf and hands it to him.\n“Showoff,” Louis mutters, but Harry just smiles against the back of his head, face buried in Louis’ hair, and whatever, maybe it’s a little bit hot that Harry is so much bigger than him. Maybe. He flicks the switch on the kettle so the water will boil, then turns around in the bracket of Harry’s arms and leans back against the counter.\nHarry smells like Louis’ shampoo, and despite the fact that the joggers he’s got on are too big on Louis, they’re still just a bit too short for Harry, riding low on his hips and brushing against his ankles. They’re both shirtless, and Louis takes a moment to trace his fingers over the tattoos inked into Harry’s skin, up over the wings of the birds and then down the center of the butterfly.\n“You’re rather fit,” Louis says as he smooths his thumb across the curve of the butterfly’s wing. When he raises his eyes, Harry is watching him, the expression on his face achingly sweet, and Louis sighs. As he lifts up onto his toes to fit their mouths together, Louis has a sneaking suspicion that he is rather fucked.\nHarry’s lips part immediately, and Louis smooths his tongue across his bottom lip, vaguely registers the click of the kettle. Instead of pulling away, though, he wraps his arms around Harry’s neck and deepens the kiss. The tea can wait.\n;;\nNow that Louis knows just how deft Harry’s tongue is, how warm his skin is, how he looks when he comes, seeing Harry and not being able to touch feels like torture. It’s amazing, really, that even after he’s managed to actually get laid, Louis has never been more sexually frustrated in his life.\nEvery morning, he chats with Harry for a few minutes after dropping Emily off, tries his best to keep his hands to himself, despite Harry’s determination to make everything he says sound as filthy as possible. The kids need to be watched, though, and it would not be appropriate - or legal, he thinks - to drag Harry off to the toilets.\nDespite his frustration, he’s determined to keep the Harry part of his life and the Emily part of his life separate, so he makes do with those brief moments of contact in the morning and afternoon, texts throughout the day, and lengthy phone calls at night. The only time he gets to see Harry properly is three weeks later, when Emily goes to stay with Eleanor again. Harry shows up Friday evening, and neither of them leave Louis’ house until Sunday afternoon, when Louis has to reluctantly kick him out before Eleanor brings Emily back.\n\n\nApril brings with it a cold front, and Louis wakes up with the sun the last week in April to Emily crawling underneath the covers with him. He opens his arms automatically so she can settle against him, whispers, “Em? What’s wrong?”\n“I don’t feel good,” she mumbles, voice scratchy, and Louis frowns, tilts his head down so he can press his lips against her forehead.\nShe feels a bit warm, but nothing worrying, so he just wraps her up in his arms and murmurs, “I’ve got you, monkey. Let’s go back to sleep.”\nBy the time Louis’ alarm goes off, Emily is running a low-grade fever, so he texts Harry to let him know she won’t be in school and goes to make her some tea. His mum had taught him to stir some medicine into tea and mask the flavor with honey, and even though it doesn’t taste wonderful, Emily usually drinks most of it.\nShe’s still asleep in his bed, arms wrapped around her stuffed monkey, so he climbs in beside her and lifts her onto his lap. “Emmy,” he whispers as he rubs her back. “Em, I need you to drink some tea for me.”\nEmily grumbles sleepily and turns her face into Louis’ stomach, but he’s determined to get some medicine into her so that her fever doesn’t get worse. He gets one arm under her back and lifts her into a sitting position, murmurs, “Emily, if you drink some tea, you can go back to sleep after. Just a little bit, monkey, come on.”\nHer eyes flutter open and she frowns groggily, but she opens her mouth obediently when he holds the mug up to her lips. He manages to get her to drink most of it before she turns her head away, so he sets the mug down on the bedside table and whispers praises at her as he tucks her back into bed and lets her go back to sleep.\nLouis manages to get a bit of work done while she dozes fitfully, but when she wakes up a couple of hours later, she’s crabby and uncomfortable. Louis pulls out a bag of cherry flavored throat lozenges and lets her suck on one while he sits in the bay window and reads to her for a while. Her fever starts to climb again, though, so Louis bundles her up in blankets and settles her on the sofa with The Little Mermaid on the telly as he makes her more tea.\n“I don’t want it, Daddy,” Emily pouts.\n“Does your throat still hurt?” Louis combs Emily’s hair back from her face, then shifts a bit closer when she nods. “If you drink this, it’ll make your throat feel better.”\nEmily scowls, but she closes her hands over Louis on the mug and drinks half of it, so Louis counts it as a win. By the end of the day, he’s managed to get Emily to drink three cups of tea, but she’s still running a fever, so he puts drowsy medicine in her last cup so she’ll sleep through the night. He dresses her in winter pyjamas, wraps her up in his duvet, and reads to her until she falls asleep.\nHe doesn’t sleep much that night, wakes up every hour to check on Emily and make sure she’s still sleeping and that her fever hasn’t gotten worse. By morning, though, it seems to have broken, and when she wakes up and asks for French toast, he knows she’s already feeling better.\nHe still makes her tea with her toast, just in case, then tries to get some work done while she watches SpongeBob, but she’s bored, and Louis doesn’t know what to do with her. She hasn’t been fever-free long enough to take her out, and he doesn’t want her to over-exert herself with too much physical activity. They end up playing with her dolls on the floor in the living room for a bit, and Louis lets her convince him to play football for half an hour in the backyard, but by four o’clock, he’s out of ideas and she’s getting whiny.\n“Hey, Em, do you want to bake some cookies?”\n“Yes!” Emily clambers up from where she’d been sprawled out on the floor drawing and rushes into the kitchen. Louis’ eyes are gritty from lack of sleep, so he takes a moment to go take out his contacts and slip his glasses on before joining her.\nBy the time the cookies are done, the kitchen looks like a war zone and Louis has flour all over himself and a smear of melted chocolate running down the side of his shirt. He’s just about to sit down at the table, where Emily is already biting into one of the cookies, when someone knocks on the door.\nFrowning, Louis brushes Emily’s hair back and murmurs, “I’ll be right back, monkey.”\nTo Louis’ complete and utter surprise, Harry is standing on the front stoop when he pulls the door open. Louis is suddenly extremely aware of the fact that he must look an absolute disaster, dressed in yesterday’s jogging bottoms and a ratty old t-shirt, food all over himself, and his glasses sliding down his nose.\n“Haz? What...”\nHarry smiles brightly at Louis and holds up a bag, says, “I brought over Emily’s spelling, and since she missed crafts today, I thought maybe she would want to make it up. Is everything alright?”\nLouis sighs and steps back to let Harry in.\n“Yeah, we’ve just been baking.” He looks down at himself, then mumbles, “If you can even call it that.”\n“Smells good,” Harry comments as he looks Louis up and down. He reaches out and pushes Louis’ glasses up, says with a little smile, “You look cute.”\n“Shut up,” Louis grumbles, blushing furiously as he tugs at the hem of his shirt. “I haven’t slept in two days and haven’t showered in even longer, and I still have two articles to write.”\nHarry grins and leans in to brush a kiss across his cheekbone, murmurs against his skin, “Well, regardless, you look lovely.”\n“Harry?”\nHarry and Louis both turn to see Emily peeking around the corner. She’s in better shape than Louis is, only a smudge of flour across one of her cheeks, but she’s got chocolate from her cookie all over her hands, and when she moves to come into the living room, Louis shakes his head and points toward the kitchen, says, “Wash your hands first, please.”\n“Hey.” Harry reaches out and cups Louis’ elbow, draws his attention back over to him. “Go write your articles, I can entertain Emily for a couple of hours.”\nLouis wants to cry with gratitude.\n“You really don’t have to do that, Harry. I can work tonight after she’s gone to sleep, it’s -”\n“Louis,” Harry cuts in. “Go work.” He waves the bag he’s still holding, and something inside of it rattles. “I’ve got this.”\n“Thank you,” Louis breathes, and he only pauses long enough to look around and make sure Emily’s not in the room so he can give Harry a brief kiss, then he’s padding off toward his bedroom.\nHe comes up for air two hours later and goes to make some tea, finds Harry and Emily sitting at the kitchen table with a mountain of popsicle sticks and some glue as they construct... well, he’s not really sure what they’re building.\n“Hey monkey,” he croaks, voice rusty from disuse, as he walks over and puts a hand on her shoulder. He bends over to press a kiss to her forehead, satisfied that her temperature is back to normal, then asks, “What are you building?”\n“It’s a house,” Emily says with a sigh, and he catches the tail end of an eyeroll aimed at Harry and Harry’s answering grin. The exchange has something twisting in his belly and tightening his throat, and he has to clear it a few times before he can speak.\n“Do you two need anything? I still have a little bit of work to do.”\n“No, I think we’re good,” Harry murmurs, then looks up from where he’s been carefully gluing two sticks together, brows still furrowed in concentration. He’s got glue drying on his hands and marker all over his fingers from where they had colored in some of the popsicle sticks, lips pressed together in a line, and he looks like the world’s biggest child. Louis wants to crawl into his lap and wreck him.\nHe glances down at Emily to make sure she’s occupied before reaching out and threading his fingers through Harry’s hair briefly. Harry stretches into the touch, eyelids fluttering, and Louis feels an answering curl of affection and lust in his belly before stepping back.\n“Right. I’ll be in my room if you need anything.”\nLouis waits for Harry to go back to the crafts before turning back out of the kitchen, a mug of tea clutched in his hands and his heart lodged in his throat.\n \nLouis loses track of time as he works on transcribing an interview with the coach of the English national football team. He’s about three quarters of the way through it when he hears a tap on his bedroom door. He hits pause on the recording and swivels in his chair, has to blink rapidly to clear his gaze. Harry is standing in the doorway with his hip propped up against the jamb.\n“Hey, love,” he says softly. “Emily’s asleep, I put her in her bed.”\n“Oh. What?” Confusion settles over Louis. “What time is it?”\n“Just after eight,” Harry supplies, and Louis realizes suddenly that it’s dark in the room.\n“Oh my God,” he laughs, then scrubs his hands over his face. Fuck, he’s tired. “I didn’t even realize, I’m so sorry. You’ve been here ages, you should have come and gotten me, I’d have taken over.”\n“Please, Louis,” Harry murmurs as he finally steps into the room. “You needed the break.” He walks over to Louis’ desk and rubs a hand across Louis’ back, and Louis hums appreciatively and leans into him. “How about you take a bath?”\n“I don’t think -”\n“No,” Harry says, voice firm, and Louis blinks up at him in surprise. “I’m going to run you a bath, come on. Take those filthy clothes off.”\nLouis raises an eyebrow, but he’s too tired to come up with a retort, and a bath sounds amazing, if he really thinks about it. So Louis stands up and strips out of his clothes as he follows Harry to the bathroom, watches silently as Harry plugs up the tub and pours a bit of soap in before running the water.\n“Get in,” he instructs once it’s started filling. “I’ll be right back.”\nLouis doesn’t argue, just steps into the tub and settles down on the bottom, relaxes against the porcelain while it fills up around him. The water has reached his chest by the time Harry comes back in, and Louis forces his eyes open so he can stare blearily up at him.\nHarry scrubs a hand over the back of his head and says, “I started a load of wash, I hope you don’t mind. Yours and Emily’s clothes, some tea towels, the blanket that was on the sofa.”\nGratitude wells up in Louis’ chest and he shakes his head in wonder. It’s been a rough two days, but he’s not really sure what he did to deserve Harry. When he speaks, his voice is rough with emotion. “Thank you, Harry. Really, thank you.”\n“Of course,” Harry murmurs, and Louis watches with bemusement when Harry starts taking his own clothes off.\n“Haz,” he starts as Harry works on the fly of his jeans. “I really appreciate what you did tonight, but I just don’t think I have the energy -”\n“Louis.” Louis snaps his gaze up. There’s hurt written across Harry’s face and woven through his tone when he says, “I wasn’t trying to have sex with you. I just want you to relax.”\n“Oh,” Louis whispers, guilt tripping up into his throat. His voice is thick with it when he mumbles, “Sorry, I didn’t mean -” He lifts his hands out of the water and scrubs them over his face in frustration. “I’m so knackered I can’t form complete sentences. I’m an arse. Come on, get in the bath with me. Please.”\nHe scoots forward in the water and waits for Harry to finish getting undressed, then slip in behind him. He’s never taken a bath with another person before, and it’s a bit weird at first, trying to figure out where all of their limbs should go. In the end, he settles back against Harry’s chest and lets his head fall against Harry’s shoulder.\n“I’m so tired,” Louis whispers out into the quiet room, and Harry bends his head so he can press a kiss to the side of Louis’ neck, hands folded down over Louis’ stomach.\n“I know, love. Here, sit up.”\nLouis heaves himself up so he’s sitting upright, hears the snick of a bottle opening, and then there are hands working shampoo in his hair. He moans happily as Harry’s fingers work over his scalp. It feels like heaven.\nHe doesn’t protest when Harry takes his time, working the soap into his hair, then cupping his hands in the water and pouring it over Louis’ head to rinse it out; doesn’t argue when Harry pulls Louis back against him and wraps his arms around Louis’ chest and just holds him, humming quietly into his ear. He’s almost asleep by the time Harry rubs a hand over his stomach and murmurs, “Water’s getting cold. Let’s get you into bed, yeah?”\nLouis just hums and lets Harry manhandle him out of the bath and into a towel. He watches through half-lidded eyes while Harry quickly dries himself off, then walks over so he can scrub Louis’ towel through his hair.\n“Come on, babe.” Harry wraps his hands around Louis’ hips after he’s hung their towels up to dry and says softly, “Bedtime.”\nHe leads Louis out into the bedroom and sets him down on the bed while he rifles through the drawers. Once they’ve both pulled on pants, he shuffles Louis up the bed and crawls underneath the covers with him, folding himself around Louis. Louis burrows into his chest immediately and sneaks a hand up his back so he can tangle his fingers in the damp curls at the base of his neck.\n“Haz,” he mumbles, lips dragging against Harry’s skin, and he feels Harry’s chest rumble in response. His tongue is thick and clumsy with sleep, but he slurs out, “You’re kinda perfect.”\nHe can feel Harry chuckle, vibrations against his cheek and breath rifling through his hair, feels Harry press a kiss to the top of his head and whisper, “Go to sleep, Lou.”\nSo he does.\n;;\nLouis is woken up the next morning by a small hand patting his cheek and Emily whispering, “Daddy. Daddy, wake up.”\n“What is it, Em,” he croaks. When he blinks blearily at the clock, he sees that it’s only 4:30 in the morning.\n“Am I going to school today?”\n“Yes,” he mumbles, “But you still have three hours, go back to sleep.”\nHe’s nearly managed to slide back into sleep, himself, when he feels her hand on his face again and she whispers, “Are you and Harry having a slumber party?”\nHis eyes fly open and he whips his head around. Harry is still fast asleep, laid out on his stomach and taking up three quarters of the mattress. His hair is curling wildly over his face and his lips are parted, breath puffing out quietly every time he exhales. He looks so sweet, Louis wants to turn over and snuggle into his side, tuck his face down into the gap between his shoulder and his jaw.\nLouis clears his throat and turns back to look at Emily, whispers, “Yes, monkey. Harry was here very late watching you last night, so he slept over.”\n“Okay,” Emily whispers. “Goodnight Daddy.”\nShe leans over to press a kiss to his cheek, and then she’s gone. Fuck. He hadn’t been thinking last night, hadn’t even considered that Emily might catch them in bed together. They’ve been so careful up until now, only getting together when Emily is with Eleanor, and the thought hadn’t crossed his mind.\nHe turns to look at Harry again, blinks down at him as he thinks about what he’s going to tell Emily in the morning. With a sigh, he decides he’s got three more hours until he needs to deal with it, so he does exactly what he’d wanted to before - rolls over so he’s pressed up against Harry’s side, slots his face into the crook of Harry’s neck, and falls back asleep.\n \nMorning goes surprisingly smooth. Louis’ alarm goes off at 7:15, and he drops a kiss to Harry’s bare shoulder, then leaves him to wake himself up as he goes to get Emily. She’s already awake, sitting up in bed and flipping through a picture book with her monkey cradled in her lap as she makes up a story.\n“Hey, Em, you ready to get dressed for school?”\nEmily looks up from her book and smiles. She’s got on her favorite Winnie the Pooh pyjamas, but her hair is a bit of a tangled mess, and Louis realizes that Harry must have given her a bath last night. He shakes his head in wonder, heart fluttering at the thought of Harry taking care of his baby girl, then moves to pull Emily’s curtains open and flood the room with natural light.\n“Let’s go brush our teeth,” Louis says as he tries to put Harry out his mind. He’s got a daughter that he needs to get ready for school and breakfast to make. He follows her into the bathroom and watches as she spreads toothpaste onto her Cinderella toothbrush, counts aloud while she brushes. “Good girl, you can rinse. Go pick out your outfit now, monkey, you’ve got fifteen minutes before I want to see you in the kitchen for breakfast, okay?”\n“Okay, Daddy. Is Harry still here? I wanna say g’morning.”\nLouis’ heart stutters in his chest as he has a brief moment of panic when he thinks about how this is going to affect their lives, and he takes a moment to catch his breath, then says, “Yes, Em, he’s still here. You can see him when you come in for breakfast.”\nHe’s almost out the door when she calls after him, “Daddy? Is Harry gonna spend the night again?”\nHe takes a moment to bang his head against the doorjamb, twin spools of dread and irritation with himself curling in his belly, then turns around and says, “I don’t think so, monkey.”\nHe spends the short walk back to his own bedroom trying to figure out what to do about this whole situation. He’s gotten himself into a bit of a mess without realizing it, had never meant to actually get involved with Harry. Now that he is, though, he doesn’t know how to deal with the relationship. It’s been three years since he and Eleanor split up, and he hasn’t been on a single date since. For the most part, it’s because he’s been too busy being a single dad, but he knows from personal experience how it feels when someone important leaves you, and he doesn’t want Emily to have to deal with that again; doesn’t want her to get attached, only to have the relationship fall apart.\nHarry has his jeans on and is making the bed when Louis gets back into his bedroom, and Louis stops in the doorway to watch him, all thoughts about Emily and failed relationships instantaneously forgotten. His jeans are still unbuttoned, riding low on his hips, skin pale in the light streaming in through the windows, and he’s fucking gorgeous.\n“You don’t have to make the bed, Haz, I never do.”\nHarry shrugs as he pulls the duvet up over the pillows, looks up at Louis and says around a smile, “I’m used to it. Hey, do you think I could borrow a jumper or something? The one I wore yesterday is pretty recognizable, and Zayn and Niall will definitely notice.”\n“Sure.” Louis walks over to his closet and sifts through his clothes, finds a jumper that’s always been more like a dress on him, but is too comfortable to throw out. “Try this one.”\nThey finish getting dressed in relative silence, then Louis unwraps a new toothbrush for Harry, watches him in the mirror as they brush their teeth crowded around the sink together. It’s incredibly domestic, something Louis hasn’t had in over three years, and despite Louis’ increasing worry, it feels nice. More than nice, really, when Harry meets his eyes in the mirror and grins dopily at him, mouth foamy from the toothpaste.\nLouis grins when Harry hipchecks him out of the way so he can rinse out his mouth, hums appreciatively when Harry cups his hands over Louis’ hips after relinquishing control of the sink. It’s just another one of those things, Louis thinks, as they move around each other easily, trading places and handing over towels without even speaking. He’s never experienced anything like this, the way they can communicate without words and seem to instinctively know what the other is about to do. It’s dizzying, and even though Louis knows they shouldn’t - can’t - continue like this, the thought of giving it up makes his throat hurt.\nThey get to the kitchen a few minutes before Emily, and Harry starts to work on two mugs of tea while Louis pours a bowl of cereal and a cup of chocolate milk for Emily. Harry is handing Louis’ mug over when she skips in, and she goes straight to Harry and wraps her arms around his legs.\n“Morning, Harry! Was your slumber party fun?”\nHarry shoots Louis a wide-eyed look, and Louis hides his grimace in his tea. Harry keeps sidetracking him everytime he tries to work out a solution, and he’s still not exactly sure how to handle this situation. Harry doesn’t seem to either, though, so Louis saves him by setting his tea aside and saying, “All we did was sleep, love. Come on, go eat your breakfast so we can go to school.”\nHarry shakes his head as Emily walks over to the table and climbs up into her seat. Louis smiles weakly at him and shrugs helplessly, but goes willingly when Harry wraps a hand around the back of his neck and drags him close. He only brushes a kiss against Louis’ forehead, though, mindful of Emily sitting a couple of feet away, then announces, “I have to go get the classroom ready. I’ll see you at school, Emmy.”\n“Bye Harry,” Emily calls after them as Louis walks Harry to the door.\n“So,” Louis starts, scrubbing a hand over the back of his neck. “That was weird.”\nHarry makes a face, then says, “I’m really sorry, I didn’t think last night through very well.”\n“Hey,” Louis says quietly as he loops his arms around Harry’s neck. As much of a mess as this is, he doesn’t want Harry thinking he’s anything less than incredibly grateful. “You were amazing last night. I can’t believe you gave Emily a bath.” Harry shrugs, cheeks flushing pink with embarrassment, but Louis shakes his head and says, “No, really. You’re amazing.”\n“No, you,” Harry murmurs, then ducks his head and closes his mouth over Louis’ in a brief kiss. “I really do have to go,” he mumbles against Louis’ mouth, and Louis sighs.\n“Go on, then, Mr. Styles. Go educate the children, teach them how to save the world. They are our future, blah blah blah.”\nHarry rolls his eyes and gives Louis’ shoulder a squeeze, then slips out the door and down the walk. Louis allows himself one minute. One minute of watching Harry walk away, then he closes the door and goes back to the kitchen.\nEmily looks up from her cereal as he walks in. “Daddy? Can Harry come over after school today?”\nLouis’ heart drops into his stomach. Oh, no. This is exactly what he’d feared would happen.\n“I don’t think so, sweetheart. Harry has to go to his own house today.”\n“Can he come over tomorrow? I wanna have a slumber party with Harry, too!”\nOh, God. Louis grabs his abandoned tea and takes his seat at the table, nudges Emily’s milk closer to her so she’ll drink it. “Em, Harry only stayed here last night because he was here very late. Just like Uncle Liam does sometimes.”\nEmily doesn’t stop asking about Harry as they finish getting ready for school, and Louis feels dread settling at the base of his spine. Harry is great. Harry is wonderful, even, but Louis’ track record with relationships, while short, is not great, and he doesn’t want to put Emily through the pain of another breakup. It’s all good and well when she doesn’t know what’s going on and there’s no chance of her getting attached, but she’s already attached to Harry as her teacher, and the threat of potential heartache when it doesn’t work out is compounded.\nAnd, of course, there’s the fact that what he and Harry are doing is against school rules, and Louis is afraid Emily will tell one of her friends and end up getting Harry in trouble. He spends the walk to school trying to decide what the right thing is to do, and even though the thought makes his heart ache, he comes to a decision as they start up the front walk.\nLouis stops just outside the classroom door and drops to his knees so he’s on Emily’s level, wraps his hands around her wrists and says, “Em, listen to me. You can’t tell your friends that Harry slept over last night, okay?”\n“Why not?” Emily asks, eyes wide.\n“Because he’s not supposed to and he could get in trouble. We don’t want him to get in trouble, alright?”\nEmily only hesitates a moment before nodding. She reaches out to fiddle with the collar of Louis’ shirt and asks, “Why can he get in trouble?”\n“I don’t know why, love. Just remember not to tell your friends, okay? Promise me?”\n“I promise,” she whispers, and Louis nods, leans in to press a kiss to her forehead.\n“That’s my girl. Okay, go on inside. I’ll see you after school.” Louis lets go of Emily’s hands, then rushes to tack on, “I love you, monkey.”\n“I love you too, Daddy,” Emily calls over her shoulder, and then she’s gone.\nLouis spends the walk back to the house trying to think up ways to distance himself from Harry. It’s kind of a dick move, but he’s not sure he’d be able to stick to his decision with Harry in front of him. He shoves his hands into his pockets and hunches his shoulders against the brisk April wind, heart heavy as he trudges slowly down the street. He’s gotten rather attached to Harry. Harry with his flower crowns and his hippie-like ideals, his bright smile and his wild hair, his endless legs and his unfailingly good heart.\nLouis mopes around the house all day, cleaning and tidying up after spending two days cooped up with a sick child. He’s so wrapped up in thoughts of Harry that he doesn’t even pay attention to the cleaning process - his least favorite thing to do - and by the time he needs to leave to pick Emily up, the house is sparkling clean.\nHe doesn’t go into the classroom like he usually does, instead leans against the doorjamb and waves at Emily where she’s sat in the feelings circle. She waits for Harry to tell her it’s okay to go, and Louis deliberately turns to watch Emily walk over to her cubby, despite the fact that he can feel Harry’s eyes on him. He holds his hand out for Emily’s lunch box as she walks up, then offers Harry a cursory wave before they go, ignores the sadness pulling at the corners of his mouth and settling into his chest.\nHis phone buzzes with a text message as he’s making dinner that evening, and he reads the message from Harry with a frown on his face.\n            Everything ok?\nHe pushes away his unease and closes the text without answering.\nThursday and Friday pass very slowly. Louis drops Emily off outside the classroom door again and waits for her in the doorway when he goes to pick her up. She’s headed to Eleanor’s for the weekend, so when he drops her off Friday morning, he sneaks a quick glance at Harry to tide him over until Monday. It’s a bit pathetic, really, but he’s determined to make this work. Aside from the fact that Harry could get in trouble for getting involved with a parent, the last thing Louis needs is Emily realizing what’s happening.\nHe texts Liam that afternoon to see if they can change their plans. He’s not in the mood to go out, so Liam comes over with Chinese food and Louis breaks out a bottle of tequila, and they sprawl out on the floor in the living room and slowly get drunk.\n“Why aren’t we going out again?” Liam asks around a mouthful of mushu pork.\nLouis scowls down at his pad thai and mumbles, “Not in the mood.”\n“You want to tell me why you’re moping, then?”\nLouis snaps his head up. Liam is watching him, a knowing expression on his face, and Louis sighs.\n“‘M not moping.” At Liam’s raised eyebrow, he scowls and says, “Fine, maybe I am. I’m allowed to mope every once in a while, Liam.”\n“I’m pretty sure you’re only allowed to mope if you’ve got something to mope about, Louis, so why don’t you tell me what that is? And will you answer your bloody phone?”\nIt’s been buzzing on and off all night, but Louis knows who it is. He kicks it away with a bit more force than he’d intended and it goes skittering under the sofa. Good. At least he can’t hear it buzzing from there.\n“I can’t,” he snaps.\n“Can’t what? Can’t tell me why you’re sad, or can’t answer your phone?”\nLouis heaves a sigh and pushes his dinner away, then rolls onto his back and whispers, “I fucked up.” He drapes an arm across his eyes and groans. He’s being a bit dramatic, but he thinks he’s allowed, under the circumstances. “I let Harry sleep over on Tuesday.”\nHe hears Liam choke on his food, waits for him to stop coughing and croak, “What? He what? Since when!”\n“March,” he mumbles, guilt settling behind his eyes when Liam splutters at that.\n“Louis, May starts tomorrow.”\n“I know,” Louis whispers. He hears Liam shuffling around, rolls into him automatically when he stretches out on the carpet beside him. Liam wraps his arms around Louis and pulls him close.\n“So what happened?”\nWhen Louis speaks, his voice is muffled by Liam’s shirt. “He only came over when Emily wasn’t here, and it was fine. But Em was sick Monday and Tuesday, right, and he came over Tuesday after school so I could take a break.” He swallows around the lump in his throat and grits out, “He bathed Emily and put her to sleep, then bathed me and put me to sleep.”\n“Wow.”\n“I know,” Louis whispers.\n“D’you think... Do you think he’s proper in love with you?”\n“Oh, God,” Louis whines, panic clawing its way up his throat at the thought. “Please, Liam, I can’t. It’s against school rules and Emily is so impressionable, I can’t -”\n“Right. God, I can’t believe you didn’t tell me, you little shit.” Liam sighs. “Okay, come on.” He pats Louis on the hip and leans back. “Up, come on, let’s get drunk.”\nLouis struggles upright and crosses his legs, then reaches out to grip Liam’s forearm.\n“Thank you,” he mumbles. “I’m just.” He cuts himself off and presses his lips into a firm line. He needs to get drunk and forget about Harry. Now.\n;;\nIt takes Louis all of Saturday and part of Sunday to get over his hangover. He’s dozing on the sofa on Sunday afternoon, Loki asleep in the small of his back while Liam heats up a frozen pizza, when someone knocks on the door.\nLouis frowns and adjusts his glasses so he can read the display on the cable box. It’s too early to be Eleanor, so he’s got no idea who would be knocking on his door on a Sunday afternoon. He’s just about to get up when Liam breezes through the living room and pulls the door open. It only takes a moment, and then he hears voices, and. Oh.\nLouis manages to set Loki down on one of the cushions and struggle up into a sitting position before Liam walks in, looking extremely uncomfortable. Harry is behind him. Louis swallows and shakes his head quickly when Liam mouths ‘sorry.’ It’s not his fault. He looks past Liam to Harry, doesn’t even notice when he walks back into the kitchen.\nHarry looks terrible. He’s got his hair tucked up underneath a beanie and dark circles under his eyes, the corners of his mouth turned down into a frown, and Louis feels misery well up inside him at the sight. No matter how badly he wants to cave, wants to see Harry’s shoulders relax and his lips curve up into a smile, he needs to stand his ground.\n“Harry, what are you doing here?”\nHarry shrugs and takes a step forward, mumbles, “I brought you back your jumper.”\nIt takes Louis a moment to realize that he’s got something in his hands, Louis’ jumper folded into a neat square. He watches as Harry sets it carefully on the coffee table.\n“You could have sent it home with Emily, you know,” Louis says, then winces at how that sounds. He needs to break things off with Harry, not be an arse and drive him away completely. He watches Harry’s Adams apple bob as he swallows, twists his fingers in the blanket draped over his lap.\n“Lou, is everything...” He trails off, then lets out a sharp, humorless laugh, gaze trained on the carpet. “Well, no, everything’s not alright, I know that much.” He glances up at Louis quickly before dropping his gaze again. “Can you just tell me what I did wrong?”\nShit. Louis scrambles up off the couch, tosses the blanket to the side and stumbles to his feet and around the coffee table. He doesn’t let himself touch Harry, even though his fingers are literally itching to reach out and grab. Instead, he tucks them carefully into his pockets and rocks back onto his heels.\n“You didn’t do anything wrong, Harry, I promise. You’re.” He swallows then says, voice thick, “You’re perfect.”\nHarry’s expression brightens for a moment, but then it dims again when Louis doesn’t smile, and he says, “This isn’t one of those ‘it’s not you, it’s me’ speeches, is it? Because really Louis, you can at least be honest with me.”\n“No, it’s not. Really, it’s not.” Louis casts his gaze around the room while he gathers his thoughts, then heaves a sigh. “Look, Emily has to be my number one priority, yeah? She’s only five, and I don’t want to be one of those parents that makes her part of a relationship that doesn’t last.” Harry sucks in a sharp, breath, hurt flashing across his face, and Louis rushes to continue, “Not that I don’t think you’ll stick around, it’s just.” He gives a helpless shrug. “My track record isn’t great, you know? And in a month, Emily won’t be in your class anymore, and I’ll just be another guy with too much baggage.”\nHarry frowns and takes a step forward, opens his mouth to reply, but Louis cuts him off, tries to inject as much finality into his tone as possible when he says, “Plus, it’s against school policy, and if anyone finds out we’ve been shagging, you could get fired.”\nThey’re quiet for a moment while Harry stares at Louis and Louis stares at the floor.\n“So that’s it, then?”\nLouis presses his lips together and nods, eyes still locked on the carpet. He doesn’t let himself look up when he whispers, “I’m sorry.”\n“Right,” Harry mutters. “Me too. I’ll see you around, then, Louis.”\nLouis still doesn’t look up when he hears Harry walk toward the door, doesn’t move until the front door has clicked shut and there’s a hand wrapping around the back of his neck. He sucks in a miserable breath and lets Liam turn him around and pull him into a hug.\n;;\nIf Louis had thought that the past two months had been torture, it’s nothing compared to the last five weeks of school. Being with Harry but not being able to touch him had been hell, but being near Harry and not even being able to speak to him is worse.\nThe weeks pass at a snail’s pace. Louis drops Emily off at school everyday, but instead of stopping to talk to Harry for a bit, he just watches him from across the room for a few moments, then leaves. He gets an occasional perfunctory wave in, when Harry will actually meet his eyes, but for the most part, Harry deliberately focuses on the kids. Louis can’t help noting the despondent downturn of Harry’s mouth, though, and the way his shoulders slump as soon as Louis turns toward the door, like Harry had been hoping he would come over and talk to him.\nBut even with the self-imposed avoidance, he can’t bring himself to delete Harry’s number from his phone, and every once in a while, he’ll find himself tugging it out of his pocket and calling up his contact info, finger hovering over the phone number displayed underneath the word ‘haryr ❤❤❤.’ He can’t even make himself change the name of the entry. God, he’s pathetic.\nBefore Louis realizes, it’s the last week of school. He turns down the offer to chaperone the trip to the zoo on the second to last day, not sure he’d be able to handle an entire day out with Harry. When he goes to pick Emily up that Friday, he waits by the door, but instead of going to grab her lunchbox, she runs over to Harry and throws her arms around him.\nLouis watches, throat aching, as Harry crouches down and returns her hug, then pulls back so they can talk. Emily puts her hands on Harry’s shoulders while they talk, too far away for Louis to be able to hear what they’re saying, but he watches as Harry’s face falls and he says something that makes Emily tuck her chin down against her chest, like she does when she’s upset.\nEven though he knows Harry would never say anything to deliberately upset Emily, he’s just about to walk over there and intervene when Harry pulls her into another hug, then gets slowly to his feet. Louis is so caught up in watching Harry’s long legs wobbling as he straightens up that he forgets to look away, and Harry catches him staring, offers him a sad little wave, then turns to face the back of the room.\nLouis tears his eyes away from Harry so he can look down at Emily, drops to his knees and puts his hands on her sides. “Em, what’s wrong?”\nEmily tucks her head down again and mumbles, “I asked Harry if he wanted to have a slumber party and he said no.”\n“Oh, babe,” Louis sighs. “Harry can’t have a slumber party with you, monkey.”\n“Why not? He had one with you.”\nLouis grimaces and tries to think of a way to explain it to her without confusing her. In the end, he decides to skirt the issue and use a different line of reasoning.\n“Harry isn’t your teacher anymore, Em. It’s summertime now, you get to go to camp, and when you go to school after the summer, you’re going to have a different teacher.”\nEmily’s eyes well up and she casts a glance at Harry over her shoulder, whispers in a trembly voice, “But I don’t want a different teacher, Harry’s my friend.” She looks up at Louis, her big blue eyes brimming with tears. “Can he still come over and play?”\nGuilt churns in Louis’ stomach, and he pets a hand down her hair, murmurs, “I don’t think so, monkey. I’m sorry.”\nHer bottom lip trembles and one fat tear spills over, so Louis lifts her into his arms and carries her home while she cries into his shirt. She ends up falling asleep as he turns up the front walk to their house, so he lays her out on the sofa and covers her with a blanket, smooths her hair back from her face and murmurs, “I know how you feel.”\n;;\nEmily gets a week off between school and camp to do absolutely nothing. It’s weird, not seeing Harry everyday, even though they haven’t spoken to each other in nearly two months, and he spends half of the weekend missing Harry so much he can’t breathe and the other half chasing Emily around the house and the back garden.\nHis mum and twin sisters come down on Monday to spend a few days with them and occupy Emily, and Louis is so grateful for it he could cry. Having them there means he can get some work done before midnight, and that they both have a distraction from missing Harry. Emily still talks about him endlessly, tells Louis’ mum and sisters about all of the things she’s learned and tries to teach them Harry’s yoga routines, but at least she’s not asking Louis why Harry can’t come over every five minutes.\nIt rains torrentially on Wednesday, so Louis camps out on the sofa with Emily and the twins while Jay makes lasagna and cake for dinner that night. They’re watching the Fairy Godmother turn a pumpkin into a stagecoach when Emily buries her face in Louis’ chest and says, “I miss Harry.”\nLouis’ heart aches. He wraps his arms around Emily and whispers into her hair, “Me too, Em.”\nEmily tilts her face back so they’re looking at each other, noses just a few inches apart, and she says, “Then why can’t he come over?”\nAnd when she says it like that, it all sounds so simple. Louis stares down at Emily, her eyes the exact same shape and color as his own, and tries to figure out when his daughter became wiser than him. He thinks it might have something to do with Harry.\nHe fumbles his phone out of his pocket, heart suddenly pounding with nerves as he scrolls through his contacts and hits send. It rings three times, and Louis goes lightheaded with relief when it picks up.\n“‘Lo?”\n“Zayn? I need a favor.”\n\n\nAn hour later, Louis slips into the ratty pair of Vans he still hasn’t replaced and grabs his car keys off his desk as he strolls out into the living room.\n“Mum?” Jay turns around from where she’s standing over the counter, pouring out a marble cake. “Can you and the girls watch Emily for a bit? There’s something I need to do.”\nConcern flits across Jay’s face, and she sets the bowl of chocolate batter aside and takes a step toward Louis.\n“Is everything alright?”\n“Yes,” Louis says, even though it’s not. It’s not, but he’s going to make it alright. “There’s just someone I really need to talk to, and it kind of can’t wait.” His mum opens her mouth to speak, and he knows exactly what’s coming, so he cuts her off quickly with, “I promise I’ll tell you everything when I get back, okay Mum, must go, love you, bye!”\nHe dashes through the living room and calls out a hasty goodbye to the girls, and then he’s running out into the rain and slipping into his car. Harry doesn’t live far away, just on the opposite side of the school, but it’s raining too hard to walk. Louis drives slowly, heart in his throat as he looks out for street names from Zayn’s directions. It takes him three circles around the school to find the turn-off to Harry’s street, and he’s pretty sure he’s parking illegally in front of Harry’s building, but he doesn’t care.\nBy the time he gets to Harry’s floor - honestly, who builds a seven story building and doesn’t put in a lift these days? - he’s out of breath and dripping wet, and he takes a moment to try and catch his breath before knocking on the door. He hears footsteps just seconds later, and then the door is swinging open to reveal a shirtless, baffled looking Harry. Louis drinks him in hungrily as they stand there in silence. He looks amazing - better than Louis remembers, despite the fact that it’s only been five days. His hair is a wild tangle of curls, eyes wide and bright, cherry red lips parted in surprise, and if Louis hadn’t already been out of breath from climbing seven flights of stairs, he would be just from the way Harry makes him feel.\nHarry stares down at Louis for a moment - who’s still bent over, hands on his knees as he works on slowing his heart rate - then says, “Louis?”\n“Hiya, Haz,” Louis says as he straightens up. He runs a hand through his wet hair and offers Harry a lopsided grin. “Surprise?”\nHarry pokes his head out into the hall to peer around, like he’s expecting someone else to pop out at any moment.\n“How do you know where I live?”\nLouis bites his lip and admits with a sheepish shrug, “Zayn.”\nHarry sighs. “Of course.” He looks Louis up and down, eyes lingering on his sodden shoes and the damp material of his jeans, then says, “Do you want to come in?”\nLouis nods gratefully, toes his shoes off in the hall, then slips through the door and follows Harry into the living room. His apartment is small and sparsely furnished, and Louis looks around the open living room and kitchen while Harry disappears down a hallway.\n“Why does your apartment look like this? Did you just move in?” Louis calls out while Harry is rummaging around in the bathroom.\n“Feng shui,” Harry says shortly when he comes back with a towel. Louis isn’t really sure what that means, but it sounds hippie-ish, so he doesn’t question it.\n“Thank you,” Louis mutters as he wraps it around his shoulders. Harry sits down on one end of his overstuffed sofa, set at an odd angle so it’s facing the windows, and Louis stands awkwardly for a moment before sitting opposite him. “I, uh.”\nHarry raises an eyebrow, and Louis lets out an embarrassed laugh.\n“Sorry, I guess I should have thought about what I was going to say before I arrived.” He closes his eyes for a moment so that he can collect his thoughts. He hasn’t seen Harry in several days, and the sight of him shirtless on top of that fact is really not helping matters. “Look, I just wanted to say that I’m sorry for underestimating you.”\nWhen he opens his eyes again, Harry is looking at him with an expression of utter confusion.\n“What do you mean?” He asks slowly, and Louis scoots a little closer on the sofa, close enough that their knees are brushing when he turns toward Harry.\n“Emily loves you,” he starts. Might as well cut to the chase. “She won’t stop talking about you, actually. She cried when you told her you wouldn’t sleep over on Friday.”\nHarry shifts forward and reaches out for Louis, grazes his fingertips across Louis’ shoulder before he seems to remember they don’t do that anymore and pulls back. Louis catches a momentary flash of sadness in his eyes before Harry says, “I’m so sorry, Louis, I didn’t mean to hurt her feelings.”\n“Of course you didn’t,” Louis murmurs, unable to keep the fondness out of his voice. He sighs. “Look, I know I was a bit of a twat when I... ended things the other month.”\nHarry snorts and mutters, “A bit?”\n“Fine,” Louis gripes. “I was definitely a twat. But Emily is my first priority. Emily will always come first. You get that, right?”\n“Of course I get that, Lou. I wouldn’t want it any other way.”\n“I was worried,” Louis admits. “Scared that if I got into a relationship and let Emily get attached, that it wouldn’t work out, and I don’t want her to know what it feels like to have someone she loves leave her. She was too young to understand when Eleanor and I got divorced, but she’s not anymore, and I don’t want that for her. Ever.”\nHarry nods, lips pressed together as he watches Louis, eyes wide and overwhelming in their focus. Louis looks around the room for a moment, needing a distraction from the intensity of Harry’s gaze.\n“The problem is,” Louis continues, “she’s already attached. She considers you a friend, and she doesn’t understand why you’re not around anymore. I had made it this whole complicated thing in my head,” Louis says, waving a hand around to emphasize his point. “But it’s quite simple, really. Emily loves you and she wants you around.”\nLouis pauses then, swallows around the bundle of nerves that has lodged itself in his throat. Harry is still watching him, a somber expression on his lovely face, and Louis braces himself.\n“And so do I. Erm, love you, that is. And want you around.” Harry’s mouth falls open in surprise, and Louis rushes to continue, “And what I meant by underestimating you is that I convinced myself it wouldn’t last, because who wants to date a single parent? But you’re... Well,” he laughs, “you’re kind of perfect.”\n“I’m not,” Harry protests, shaking his head in disagreement. “I’m not perfect.”\n“Maybe I should be a bit clearer,” Louis says. He tosses the towel aside and knees up onto the couch, shuffles across the cushions until he’s straddling Harry. “You’re perfect for me.”\n“Oh,” Harry breathes. Louis can hear him swallow, tracks the bob of his Adam’s apple and waits for Harry to say something. His hands are still resting in his lap, but his eyes are locked on Louis’ mouth. He blinks dazedly at Louis for a moment, then shakes his head as if to clear it and says, “I’ve never dated anyone who has a kid before, but if you’re worried about Emily, I just want to say that I’ve spent the last nine months with her, and I think she’s amazing.” He finally lifts his hands, settles them on Louis’ hips and squeezes. “I think you’re amazing, Lou, and I’ve thought so since the beginning. I can’t promise we’ll be together forever, because who could promise something like that? But I’ve spent the last nine months falling in love with you, and I think that’s worth something.”\nLouis’ heart flutters madly in his chest at Harry’s little speech, but his stomach unknots and his face relaxes into a relieved grin. He leans in and presses their foreheads together, murmurs, “It is worth something. It’s worth a lot of things, Haz.”\nHarry’s hands clench around Louis’ hips and his eyes flutter shut, and he’s missed Harry so much and he’s just so bloody lovely that Louis can’t stand it. He tips his chin forward and lays his mouth over Harry’s, and it feels like coming home. Happy to just be together, they kiss languidly, Louis’ fingers tangled in the curls at the nape of Harry’s neck.\nLouis pulls out of the kiss with a sigh after a few minutes so he can murmur against Harry’s mouth, “By the way, if you were wondering, we have Emily’s approval.”\n“Oh?” Harry asks, tone amused. His eyes are still closed, lashes casting feathery shadows across his cheeks, and his lips are red and swollen, and Louis wants to absolutely devour him.\n“Mm,” he hums, eyes locked on the dip of Harry’s bottom lip. “She said ‘s long as you agree to read her bedtime stories when we have slumber parties, she’s game. There might have also been mention of popsicle sticks, but I think we can negotiate on that one.”\nHarry leans in a bit, so his lips drag against Louis’ when he murmurs, “But what if I don’t want to negotiate?”\nLouis laughs softly, tightens his grip on Harry’s hair and says, “Oh, Haz. Em is going to have you wrapped around her little finger.”\n“Too late,” Harry whispers. “I’m already yours.”\n \n\nfin\n"
}