{
    "id": "9174820",
    "url": "https://archiveofourown.org/works/9174820?view_full_work=true",
    "author": [
        "bixgirl1"
    ],
    "title": "In Evidence of Magical Theory",
    "rating": "Explicit",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Harry Potter - J. K. Rowling"
    ],
    "relationships": [
        "Draco Malfoy/Harry Potter"
    ],
    "characters": [
        "Draco Malfoy",
        "Harry Potter",
        "Hermione Granger",
        "Ron Weasley",
        "Pansy Parkinson",
        "Blaise Zabini",
        "Minerva McGonagall",
        "OMC"
    ],
    "additional_tags": [
        "Hogwarts Eighth Year",
        "Accidental Bonding",
        "Magical Theory",
        "Magical Cores",
        "Powerful Harry",
        "Rimming",
        "Anal Sex",
        "Anal Fingering",
        "Switching",
        "Slash",
        "HP: EWE",
        "Falling In Love",
        "forced bed sharing",
        "Blow Jobs",
        "completed fic",
        "Bonding",
        "Forced Proximity",
        "Sharing a Bed",
        "First Time",
        "Loss of Virginity"
    ],
    "language": "English",
    "series": "",
    "published": "2017-01-03",
    "completed": "2017-01-08",
    "words": "43,747",
    "chapters": "7/7",
    "comments": "1,100",
    "kudos": "30,865",
    "bookmarks": "7,146",
    "hits": "503,940",
    "summary": "<p>When a hex meant for Draco accidentally catches Harry as well, they're forced to learn to understand each other in ways they previously might have thought impossible.</p>\n<p>In which Harry and Draco can't fight, so they fall in love instead.</p>",
    "notes": "<p>All characters belong to JK Rowling and associated publishers.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Um, yeah. I'm not really a slow-burn kinda chick. lol</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">notes</a>.)\n</p>\n<p>Thank you so much for reading. &lt;3</p>\n<p>Thanks for reading. Comments are lovely!</p>\n<p>And come find me on <a href=\"https://bixgirl1.tumblr.com\" rel=\"nofollow\">tumblr</a>, if you like, 'cause I'm over there now, too! :) *waves*</p>",
    "text": "Consciousness returned slowly to Harry.\nThe first thing he became aware of was a strange, rushing sensation like a gust of wind blowing through his chest, or his stomach -- he wasn’t sure which. But it radiated out through his veins and he could sense it in his whole body, from his hair to his toes. It... vibrated, vague and unsettling.\nHis other senses began returning to him, faint voices talking over each other in angry whispers, a sharp potion-like odor that gave cognizance to his surroundings: he was in the medical wing, yes. Madam Pomfrey was one of the voices.\nStruggling a bit against the whirl of his mind, Harry forced his eyes open. He was greeted by the sight of people standing around his bed: Madam Pomfrey was circling his feet with her wand and murmuring incantations and McGonagall was standing close to his head, her face tight with worry. But her gaze was off to his left, on a man standing in between his and another bed.\nHarry cleared his throat, and watched as three sets of eyes swiveled in his direction. The man was Professor Highlash, the new teacher for Advanced Magical Theory, and with a jolt, Harry began piecing together what happened. He jerked, trying to sit up, and was firmly pushed back into the pillows by McGonagall’s implacable hand.\n“Potter. How you do you feel?”\nHarry cleared his throat again, eyes flicking from one face to another. “Bit weird. What happened? I remember…”\n“Yes?” Pomfrey asked, still circling her wand, only now over his stomach. The twisty feeling intensified, verging on discomfort.\n“We were in Advanced Theory…” Harry said tentatively, glancing over at Highlash, who nodded with a severe look on his ancient face, “practicing connecting our minds with our magical cores. And… something happened. What happened?”\nThe adults exchanged looks that he couldn’t interpret and dread twisted inside Harry alongside the new sensation. Was that it? Had something happened to his magic? McGonagall laid a gentle hand on his shoulder, and Harry turned his face up to her in raw panic.\n“There was an… incident, with your magical core,” she told him quietly.\nHarry pushed back a brief wave of nausea and screwed up his courage. “Am I… Am I a squib now, or something?”\nPomfrey, who had finished circling his head with her wand, withdrew it abruptly. Cheerfully, she announced, “All there!” her voice extremely confident and louder than anyone had been yet. Harry sagged against his pillows with relief and began to smile until he noticed another look being exchanged among the adults.\nUncertainly, he looked at Professor Highlash. “What happened?”\nHighlash looked down to the bed next to him silently. McGonagall answered. “You tried to intervene when you saw a student attempt to hex someone standing near you. Unfortunately, your shield charm -- though skillful as ever, Potter -- was not quite quick enough. The hex penetrated its intended target and your shield bounced the hex back toward you.”\nHarry had a sudden blurred memory of Zacharias Smith casting his wand with a muttered snicker in his and Malfoy’s direction, and of his own automatic response. He was astonished his shield hadn’t worked in time, but chose not to comment on it. “\nSmith,” Harry supplied grimly. “Bloody coward.”\n“Indeed.” McGonagall’s lips were pursed tightly. “He has been dealt with.”\n“What was the hex he sent?”\n“Apparently, he thought it would be amusing to bind Mr. Malfoy’s mouth closed. Unfortunately — for many reasons — the binding spell was miscast,” McGonagall said with another glance to the bed next to him. Harry thought for a moment about the funny sensation inside him.\nHe sighed. “It’s Malfoy over there, isn’t it?”\n“Yes. He should wake up shortly.”\nAs if on cue, Malfoy gave a quiet, pained moan and made a bucking motion that Harry could sense even without being able to see him. He saw Highlash murmur something to Pomfrey, who was performing her tests on Malfoy’s midsection. She nodded and removed herself, bustling back quickly with a vial of what Harry recognized as Calming Draught. Pomfrey waited next to Highlash for a moment as the teacher murmured something to Malfoy, and then moved out of the way, no longer obstructing Harry’s view.\nAs Pomfrey handed the potion to Malfoy and resumed her tests, Harry looked long and hard at him. Malfoy gulped down the contents of the draught rather frantically. His face was white and had a greasy sheen to it. He seemed to be attempting to keep still.\nHighlash waited until some of the tension drained from Malfoy’s body, then addressed them both from the foot of their beds, his gravelly voice low and serious. “We wanted to wait for both of you to be awake to fully explain what’s happened.”\nHarry flicked another glance to Malfoy, who seemed a bit steadier, but whose face showed the same fear Harry felt.\nMalfoy gripped the sheets beneath him and licked his lips. “Something is wrong with my core,” he said, voice shaking. “Smith…”\nHighlash nodded. “Not wrong, exactly. Your cores have not been drained. Power remains intact for both of you— Correct, Madam Pomfrey?”\nMadam Pomfrey moved her wand away from Malfoy’s head. “Yes, both fully intact and at full strength. But the initial tests hold true; your theory was correct.”\n“What— What theory?” Harry asked into the sudden pause.\n“Smith sent a miscalculated binding spell that hit you, Mr. Malfoy,” Highlash said with a nod in his direction, “and rebounded to you, Mr. Potter, when it hit the shield charm you had aimed at him. The problem with this is that you both had your guards down and were mentally accessing your cores at the moment, the essence of which drew the binding spell.”\n“Potter’s magic!” Malfoy burst out, squirming with sick realization. He shot Harry a nasty look. “It’s Potter’s magic, what I feel.”\nHarry started, discomfited when McGonagall pressed a light hand against his shoulder again. “Wait, what?”\n“I’m afraid so,” Highlash confirmed. “The tests show that your cores have— Well, fused, for lack of a better word. Magically intertwined. We were hoping that the effects wouldn’t be as strong as they apparently are but if you’re already sensing it, the spell has taken full hold.”\nHarry concentrated on that strange sensation, that silky twisting, like rivulets of water flowing through him. His heart thumped heavily and his voice came out flat. “How long will it last?”\nHighlash splayed his hands. “We can’t be sure. Apparently, Mr. Smith intended his original spell to last for a week. There have been a few instances of this, particularly for Unspeakables and Aurors and those who consciously access their magical cores on a regular basis — so there is a basis for similar occurrences that we’re aware of — but it is still rare. Extremely rare, indeed.\n“It should wear off on its own as soon as the original spell was meant to but there are several different variables to account for to ensure that can happen,” he finished, looking back and forth between them as though he couldn’t figure out where to settle his eyes.\nMalfoy made a disgusted noise in the back of his throat and Harry looked over at him again. “So, what then?\" he scoffed. “We can’t do magic? Maybe that’ll help Potter to reign in his Savior tendencies and ensure no one else gets caught in the backlash of them again.”\nHarry fought back a wave of fury. “I was trying to help you, Malfoy. Merlin knows why. I guess you just need a lot of saving, don’t you? Maybe next time I’ll let you get blasted.”\n“I’d prefer that over this,” Malfoy said, sneering. “This is disgusting, to be forced to feel— to feel…”\n“It’s not a picnic for me, either,” Harry retorted. He shifted uneasily as the vibration, that friction, began to grow and become uncomfortable. It settled somewhere in his ribcage, like heartburn, and almost felt like an itch that had been going on too long.\nMalfoy looked distinctly scratchy too. He pressed his hands flat over his stomach and shot a hateful look in Harry’s direction.\nHighlash stepped forward and held up a hand. “This is exactly what I mean. Not only will you have to learn to work together, you will both need to figure out a way to utilise your cores as one. There could be repercussions for your magic if you’re unable to do that.”\nMalfoy’s sneer dropped off his face and went back to looking scared. “What do you mean?”\n“I mean that not only do you need to continue using your magic to ensure that your cores remain at full strength — think of it as magical exercise — but you need to find a place of connectivity between them. Negative emotions affect your magic in much the same way curses can and when your cores do not act in symmetry, you’re both in danger of shredding them.”\nHarry felt the blood drain from his face. “I don’t— I don’t understand…”\n“Your cores are one now,” Highlash spelled out in a severe tone. “They need to behave as such or else.”\nThere was a long silence. Finally, Malfoy took a deep breath and lifted his face toward Highlash. “His magic is… it’s too strong, too uncontrolled,” Malfoy said grudgingly. “How am I going to get it to listen to me?”\nHarry nodded. “His is strange too. It's too... smooth, too shifty. It won’t stay still.”\nMcGonagall pressed her hand on Harry’s shoulder again and this time he let himself take comfort from it. “There are techniques we will go over shortly. For the time being, you and Mr. Malfoy will be paired in any classes you share, and will have free periods in any that you don’t. During some of these, you will work with Professor Highlash.”\nHarry darted another look at Malfoy, who was staring at him with narrow grey eyes. “Why? Why do we have to partner?”\n“It’s imperative you stay near one another until the binding has worn off. A magical core physically separated from a wizard is a very grave thing. Frankly, being rendered a squib would not be the worst of it,” Highlash said, almost gently.\nHarry latched onto the least frightening thing part of that. “How ‘near each other?’ We’re in different dorms.”\nThe headmistresses shook her head minutely. “You will be rooming together for the duration. The rooms in the guests’ tower are completely empty — one of them will be made up for you.”\nAnother disgusted noise came from Malfoy’s direction and Harry determinedly did not look at him, instead directing his inquiry at Highlash. “Can’t we just… You know, be around each other a lot during the day? Maybe room next to each other?”\n“The effects will get stronger as the spell wears on, I’m sorry to say. While it may be possible for you two to sleep apart, at least tonight, it would not be advisable for either of you to have a distance further than a foot between you. If the spell strengthened while you were sleeping, for example, there could be some severe consequences.”\nHarry nodded dully, picking at a loose thread in his bedsheet and finally McGonagall moved away from his bedside. He looked up at her, noting that some of the tightness of her face had faded.\n“Well, gentlemen, once you’re fully stabilized, I suggest you eat a proper dinner and collect your belongings. I shall meet you in front of the guest dormitories at eight o’clock,” she said. “I trust that you will both have the sufficient sense to adhere to Professor Highlash’s warnings and endure this with the decorum I’m… sure… you’re both capable of.”\nHarry and Malfoy exchanged sardonic glances as she swept out in perhaps the first moment of full agreement between them, ever.\n***\nIt was much harder to walk into the Great Hall for dinner than Harry had thought it would be. He and Malfoy had barely exchanged two words since leaving the medical wing — those two being monosyllabic — and yet Harry could already feel the heightened strain on the connection between them: when Malfoy walked too fast ahead of him on those damned long legs of his, that immense ache would return as a deep itch he could not scratch.\nHarry was pretty sure it was happening to Malfoy, too. Whenever he was too far ahead, he would slow abruptly, waiting for Harry to pull up beside him. It simply became more comfortable to walk shoulder-to-shoulder, so they did that, in silence.\nWhen they finally walked into the Great Hall, a hush swept over the rowdy crowd. Harry had gotten used to stares, even from those classmates who had known him for years, but this felt different -- almost ominous in its completeness. The hush was broken by Ron’s loud, “Harry!” and with relief, he saw Ron and Hermione get up from their seats and run over to his side.\nHermione threw herself into his arms, her thick frizz of curls falling into his face and hiding his view. He clutched at her tightly for a moment. Ron waited until she released him before grabbing Harry’s arm and leading him over to the Gryffindor table. Malfoy stood in place for a split second, then followed wordlessly, which earned him a sneer from Ron.\n“Oi, what d'you think you're doing, Malfoy?”\n“Leave it, Ron,” Harry said tiredly. Hermione gave him a worried look and he shot her what he hoped was a reassuring smile.\n“What happened, Harry?” she asked as they sat. Malfoy took a place at the edge of the long bench, with as much of the foot of distance allowed between them as he could manage. “Professor McGonagall wouldn’t let us in to see you and wouldn’t tell us what had happened. All we saw was you and Malfoy, unconscious, and surrounded by a, a light for a few minutes. They took Zacharias away right after.”\n“I heard he was expelled,” Ron supplied around a mouthful of food.\nHermione nodded earnestly. “Everyone’s talking about it. They said he cursed you and Malfoy, but—“\nHarry began piling his own plate with roast beef, mushrooms, and three different types of potatoes. “He did. He was aiming for Malfoy, and I put up a shield charm that backfired.”\n“Merlin, Harry, why’d you do that?” Ron blurted, eyes wide.\nMalfoy shifted uncomfortably next to him and Harry noticed he hadn’t started eating. Without thinking, he began loading another plate with the roast chicken, dinner rolls, and everything green he could see. He shoved it unceremoniously in front of Malfoy and turned back to Ron with a grimace.\n“Habit, I guess,” he muttered, then turned back to Malfoy, who was staring down at his plate with a look of shock. “You should eat. They said we need to keep our strength up.” Malfoy gave him a furtive glance and nodded once before primly tucking in to his food.\nHarry began eating, as well. Between bites, quietly, he relayed as much information as he knew. Ron’s face bleached itself of color, leaving his freckles standing out in sharp relief when Harry got to the part about his and Malfoy’s cores being entwined. Hermione chewes on her lower lip. When he'd finished talking, both of them were silent.\n“Blimey, that’s bad,” Ron finally murmured, taking a quick glance around to see who was still listening. Harry followed his eyes; a lot of people were. Fortunately, they had been speaking quietly enough -- and were sitting far enough away from the rest of the table -- that everyone would just have to live with their curiosity.\n“So we’ve been told,” Harry said darkly. “But whatever. I lived through last year, I can get through a week of this, right?” He jerked his head in Malfoy’s direction. Malfoy responded by scooting ever-so-slightly closer to him. A tension Harry hadn’t been aware of building inside himself eased off slightly.\n“Harry,” Hermione said slowly, “I mean, of course you can, but I hope you understand the seriousness of this. There are a lot of theories about the magical core of witches and wizards, but it’s not as though they can be fully studied, can they? We know that personal signatures are traceable and are in the blood, but beyond that, it’s mostly guesswork. People have died from depletion of their magical core.”\n“That’s what Highlash intimated,” Malfoy said stiffly, weighing in for the first time. “But he said there’s precedent for this sort of situation.”\nHermione seemed to struggle with speaking to him for a moment before her natural inquisitiveness got the better of her. “With who? When?”\nMalfoy glanced at her and didn’t say anything. Harry sighed. “Aurors,” he said. “And Unspeakables. But he said it should just wear off when the original spell was supposed to, if we’re careful. We’re meeting with him tomorrow.”\nThat itch was back. Harry swallowed hard didn’t wait for Malfoy, scooting closer until their shoulders were brushing again. An immediate rush of calm filled his centre, where Malfoy’s annoying magical core had been squirming in the worst way. It was as though a brewing storm had become a light, spring rain.\nHermione settled back into her seat, casting a questioning look between the two of them. “That’s good to know,” she said uncertainly. “That means there’ll be something I can research on the subject.”\nHarry took a gulp of pumpkin juice and looked down at his empty plate, then at Malfoy’s. Malfoy had eaten maybe half of what Harry had given him, but that was good enough for him. He nudged Malfoy again and got a surprised jerk in response. “You ready?”\n“I suppose,” Malfoy gritted out, “if you’re done stuffing your face.”\nHarry felt a slow burn of anger rise but tamped it down. “Not quite,” he said lightly jusy to irritate him. He grabbed a couple of chocolate pasties with one hand. “But I can finish on the way.”\nMalfoy sneered at him. “You have absolutely no manners, do you? One would think they starved you, growing up.”\nLike a flash, Harry’s carefully reigned anger transformed into embarrassed fury. He found himself stepping closer to Malfoy wand already in hand. Malfoy looked stunned at his reaction and took a quick step away, then another, as Hermione caught Harry’s arm.\n“Harry, he doesn’t know,” she said in a low voice that finally penetrated the fog in his head. “He’s just being nasty.”\nHarry slowly became aware of the buzz of other voices beginning to whisper and with it, the simmering pain of Malfoy’s core reacting with his. Malfoy stood stock-still in front of him, grey eyes wide, mouth agape. With monumental control, Harry took a deep breath. He exhaled harshly. “Just keep your bloody mouth shut, Malfoy, and maybe we can get through this. Let’s go.”\nHarry stalked away, trying to ignore the raw plummet in his chest at separating -- and the effortless settling inside that happened when Malfoy caught up.\n***\nThey made haste to the Slytherin dormitories. The common room was just as Harry had remembered it: stone walls, eerie green cast from the lake, posh fireplace. He avoided looking at anyone as his presence was noticed. Blaise Zabini, one of the few Slytherins to return to eighth year, was sitting with Pansy Parkinson and a slightly younger female student Harry didn’t recognize, on a plush, Chesterfield sofa.\n“So it’s true, then,” Zabini called out. Malfoy headed over to his friends and Harry folllwed. It was only fair, he reasoned reluctantly, trying to hold back his irritation. After all, Malfoy hadn’t complained about sitting with Harry’s friends over dinner — at least not overtly. Zabini was grinning in a way that made Harry uncomfortable. “Slughorn came in and admonished us to give you two an ‘easy time of it,’ and said you’re moving in together. Nott told me he heard Smith had cast a marriage spell at the two of you.”\nMalfoy snorted and perched on the arm of the sofa. Harry stood as close as he could without touching him.\n“You know better than to listen to rumors,” Malfoy said haughtily. “And because of that, I’ll spare you the details. Suffice it to say, I’m stuck with Potter for a few days.”\nParkinson’s eyes were bright with glee. “Oh, but Draco, rumors are so much fun. Why on earth wouldn’t we listen to them?” Her voice became sly. “And maybe add to them if we don’t have enough real information?”\nMalfoy rolled his eyes. “Quit it, Pans. Potter and I are glued together for a week or so. That bitter dolt of a wizard, Smith, thought it’d be funny to try to ruin my life for a bit -- as if he has the talent or power to do so. Just the same shit we’ve been dealing with since… Well. Potter here was trying to maintain his hero status and, shockingly, it didn’t work out this time.”\n“What same shit?” Harry cut in, ignoring the insult. Parkinson looked at him levelly and Harry quite suddenly remembered the note he had received over the summer from her. It had been filled with sardonic comments about his hair and clothing, but somewhere buried in the subtext had seemed to be a genuine apology for attempting to give him up to Voldemort. He had received a few like it, even one from Malfoy, which he immediately dismissed from his mind. He returned her look and gave her a half smile.\nWith a sniff, she looked away. “The same shit all Slytherins have been dealing with from the other Houses and even a few of the professors. A lot of people aren’t too happy that some of us came back, or that they decided to keep this House at all,” she said, casually studying her silver-polished nails.\n“But that’s—“ Harry's objection was cut off by Malfoy.\n“Shut it, Pansy, or he’ll decide we’re another cause,” Malfoy said derisively. Zabini chuckled, watching Harry with a perceptive tilt of his head.\n“Fine, fine,” she said airily, miming locking her mouth and throwing away the key. “Go live your dream, Draco. I’ll stay out of it.”\n“Liar,” Zabini coughed. Parkinson smacked him on the shoulder, flashing a wicked grin.\n“Are you okay, Draco?” The younger girl asked in a pleasantly delicate voice. She was rather pretty, Harry noticed objectively, with deep brown hair, matching eyes, and pale skin. “Do you want to talk about it?”\nDraco tensed up for the first time since returning to the common room. Harry felt it at his shoulder first, where they were touching, that slight clench of muscles and then — strangely — in his midsection, like something unpleasant winding up tightly. He looked at Malfoy in question.\n“Perfectly fine, Astoria,” he muttered, not looking at her. “No need. We should get going.”\nHe grabbed Harry’s arm and began walking off. Behind him, Harry could hear Zabini and Parkinson hoot indecent teases as he and Malfoy ducked into a stone hallway that led to the dorms. When they were out of sight, Draco dropped his arm and pushed open the third heavy stone door they came to. Harry followed Malfoy in and surveyed the room as Malfoy flicked his wand and things began to fly out of his trunk.\nMalfoy’s room was… rather cosy, Harry thought, walking around to keep close to him as he shrank his things and shoved them into a leather tote. Harry could feel Malfoy’s spells like a flicker on his core, but the discomfort of it wasn’t so bad and he continued looking around. The walls were stone and there were still those green shadows on everything, but Malfoy had photos next to his bed of his family and there was a merry fire crackling in the hearth in the corner of the room, warming it up.\n“I like the fire,” Harry said inanely, having had enough of the silent treatment. “We don’t have fireplaces in our dorms -- only the common room. …But I guess you’ll see soon enough, right?”\nFor a minute, Harry thought he wouldn’t answer, but then Malfoy grudgingly said, “It’s the lake. The chill seeps in through the walls and the fire keeps it away. They’re in all the rooms.”\nHarry nodded. He hesitated. “Who was that girl?”\nMalfoy gusted out an irritated exhale. “Friend of the family,” he said curtly.\n“Because I felt… I mean, I could feel…”\n“Merlin, Potter, you think I want to talk about your feelings?”\n“Actually, I was talking about yours,” Harry continued stubbornly. “I could feel your reaction to her. I didn’t know that was a side-effect of— of this,” he finished, gesturing between them.\n“I didn’t either,” Malfoy said grimly. “Just keep to your own business, okay?”\nHarry sighed. “Fine.”\nMalfoy finished up and they made headed to the Gryffindor tower. Harry expected to make short work of getting his things, but got sidelined by Neville, who was, “sure glad this one wasn’t my fault, mate,\" and Ron, who made sure Malfoy heard his gagging noises, and finally Ginny, who glared at Malfoy with implicit threat.\n“Take care of yourself, Harry,” she murmured, clutching tightly at his hands for a moment. He gave her a quick grin and dropped his chin on the top of her head in a light hug, inhaling the scent of her hair — he always had loved her hair — before moving away. He felt the same sense of tightness he had in the Slytherin dungeon, only this time the coil felt ready to spring and Harry threw a look at Malfoy.\n“Will do, Gin.”\n“If you’re quite done groping each other,” Malfoy said in a bored voice, “it’s nearly eight and you haven’t packed yet.”\n“Oh, shit,” Harry blurted. He cast a quick spell to check to ensure Malfoy wasn’t having him on, but no — it was five till. He pointed his wand at the door and sent a Patronus ahead of them to let McGonagall know they were running a behind and heard Malfoy grunt a little at it. He mumbled an apology and led Malfoy to his room.\nQuickly, Harry stuffed his school robes, Invisibility cloak, map, and some random clothing into the little leather bag Hermione had given him for his birthday, which had an undetectable extension charm similar to the one she had made the previous year. He threw in his books, pyjamas, and toiletries, and tightened the drawstring at the top to close it, then looped it around his neck. He turned to find Malfoy immediately next to him, so close Harry could feel the heat coming off him, and an oddly pleanant dizziness stilled him for a moment.\nMalfoy was looking around. “It’s so…”\n“Yeah?” Harry challenged.\n“Red,” Malfoy said, not bothering to mask his disdain.\nMalfoy blinked at Harry's sudden grin, but his mouth seemed to flick up at the corners in a barely-there, return smile. “It is, at that,\" Harry said. \"Come on. McGonagall’s waiting.”\nShe was, in fact. She stood patiently at the door that led to the guest's quarters and gave them a small, approving smile when they reached her. “Thank you for the Patronus, Potter. It was courteous of you.”\n“Sure thing. Sorry we’re late.”\n“How are you both feeling?” she asked.\nHarry and Malfoy exchanged quick looks. When Malfoy was silent, Harry blurted, “We can feel it when the other does magic.”\nShe nodded thoughtfully. “Of course. The link between you ties each of you to the other’s actions. Anything else? Feeling ill in any way?”\n“No…” Harry said, hesitating. “But we can — or at least I can, so far — feel, or sense, what the other is feeling too.”\nMalfoy sighed. “I can, as well. I just chose not to natter on about it like a prat.”\nHarry bristled and McGonagall raised her eyebrow at Malfoy, who dropped his head and shrugged, sort of feebly. “Sorry.”\n“Well, then.” McGonagall turned. She tapped the wooden door twice with her wand and murmured, “Fawkes.”\nThe door opened and they stepped inside to follow her up a long, narrow stone staircase that led to a wide hallway, dotted with doors. She opened the first one they came to and Harry braced himself.\nIt… wasn’t bad, actually. He didn’t quite know what he’d been expecting, but something more like how he'd envisioned Professor's quarters, maybe, filled with bookshelves or strange portraits of disapproving adults. In fact, there was only one painting, above the large stone fireplace, and it depicted a Quidditch match — a historic one, if the uniforms were anything to judge by. The rest of the room was very comfortable-looking. The floors were a polished wood, rather than the stone he had become accustomed to and there was a bookshelf along one wall that had some interesting titles in it like Aurors Through The Ages, Potion Remedies For the Practical Witch or Wizard, and Glamour Charms to Help You Be a New You! There were even a couple of Muggle science-fiction books, which Harry had always had a fondness for. There was a large, comfortably stuffed loveseat in pale brown facing the fireplace with a squashy chair angled beside it, as well as a wizarding chess-set between two chairs in the corner beside a long, highly polished desk.\nHarry and Malfoy wandered around together, taking it in and Harry noted Malfoy’s eyes land on a book title, Making Friends Out of Enemies: Bridging the Gap Between Wizarding Worlds. Malfoy snorted lightly.\n“Guest rooms respond to the preferences of their inhabitants, in a way slightly similar to the Room of Requirement,” McGonagall explained briefly. “The sleeping quarters are beyond that door. They have washroom accommodations attached. The house-elves have been made aware of your occupation here.\n“I’ll leave you to it, Gentlemen. Please attempt to get some sleep tonight, if you can. You're to head to the medical ward immediately if either of you experience core-pain. Send me a Patronus again if you have a need. I’ll see you both in Advanced Transfigurations in the morning,” she said. She hesitated for a moment as though she wanted to say something else, but refrained, leaving quite abruptly.\nQuite abruptly leaving Harry quite alone with Malfoy.\nThe silence was too loud. Harry looked around wildly for a moment. “Want to play some chess? I’m not very good, but we could kill some time before — you know, before bed.”\n“No, I do not want to play chess with you, Potter,” Malfoy said tightly. He thrust a hand through his flaxen blond hair, which had gotten a little longer over the summer. His gesture tousled it attractively and Harry looked away, a sudden heat rising in his cheeks.\n“Well, what do you want to do?”\nMalfoy sighed. “Look, I’m tired. Can we just go to sleep?”\nHarry looked back at him closely. Malfoy’s normally pale skin was slightly waxy and his grey eyes were tinged with red.\n“All right, fine.” He paused. “Do you need to… Er, shower or something?”\nMalfoy bit his lip. “I’ll… We can shower in the morning.”\n“All right,” Harry said with relief, not quite ready to face the idea of sharing a bathing routine yet.\n“But--” Malfoy’s jaw suddenly flexed, and he seemed to force the words out. “I need to use the loo.”\n“Oh.” Heat swamped Harry’s face again, crawling down his neck. “Yeah, me too. I’ve thought about that a little, actually. We can just, you know, put up a Muffliato -- and maybe a Disillusionment charm or something -- and stand close to the other, turned away.”\nSomething akin to admiration flickered on Malfoy’s face. “That should be fine.”\nThey walked through the sleeping quarters to the bathroom, Harry diligently ignoring the massive four-poster bed covered Made up in sumptuous, cream bedcovers with scrolls of gold threading. They each paused for a moment to put down their belongings, side by side, on a trunk at the foot of it, before continuing.\nIn the bathroom, he and Malfoy approached the toilet. Malfoy attempted to put up the quieting charm, with no success. Swallowing hard, Harry tried next, to no avail. They looked at each other nervously. Malfoy cast a Disillusionment charm on himself, which flickered briefly and died. A pit grew in Harry's stomach, a tightness that had nothing to do with their link.\nMalfoy was starting to shift from foot to foot and if Harry was honest, the pressure on his own bladder was not quite comfortable either. With frustration, he growled out the Disillusionment incantation rather loudly, flicking his wand forcefully at himself. Nothing happened but for Malfoy’s sudden, panicked groan.\n“Stop it, stop it, Potter,” he gasped.\nHarry lowered his wand. “What? I’m sorry— Are you okay?”\n“Just feel dizzy.” Malfoy swallowed convulsively several times, bending at the waist. Harry reached out a tentative hand, grasping Malfoy’s forearm to help steady him. After a beat, Malfoy straightened and shook off Harry’s touch.\n“I’m all right. Your magic…”\n“Oh. They said we were supposed to still use it.”\n“I think…” Malfoy tightened his lips. “I don’t think we can use it on ourselves, or each other.”\nHarry fought back an embarrassed cringe — he had shared a dormitory with several boys for whom the word modesty had no meaning for the last seven years. He was quite used to hearing things and seeing too much in the bathrooms. But this was, well, Malfoy.\nHe took off his glasses and rubbed his face. “Fine. It’s fine. It’s nothing. Take your piss, and I’ll do mine, and we’ll go to bed — go to sleep.”\nMalfoy pierced him with a long, narrow look before suddenly swiveling on his heel. Harry did the same, so they were back to back. He edged away just enough so that they weren’t touching. There was a shift of fabric and a zipping noise and, after a moment, the steady stream of piss into the toilets. Malfoy is holding his cock right now, Harry thought out of nowhere, and swallowed hard again, humiliated that it even occurred to him. The whole situation was entirely too intimate for them and Harry stood still, unsure where to put his hands or eyes or brain, obviously, if it was going to go such places on its own.\nAfter several long seconds, Malfoy finished and flushed, and Harry heard the rustle of clothing being done up. Wordlessly, as if with one mind, he and Malfoy rotated so that Harry was facing the toilet and Malfoy, away. With fumbling fingers, Harry undid his own flies, aimed, and peed. He shook off, flushed, restored his own clothing.\nThey walked over to the sink to take turns washing their hands. Without speaking they returned to the bedroom. Harry straightened his shoulders and followed Malfoy to their belongings.\nMalfoy began hunting through his bag, finally finding what he was looking for. He pulled out a silvery set of nightclothes and unshrank it. Harry did the same, searching through his bag blind — the opening was just big enough for his arm to fit through — until he felt the familiar, worn fabric of his Cannon’s T-shirt. He searched for another moment until something flannel slipped through his fingers. He grabbed it gratefully, yanking out his pyjama pants.\n“Turn again?” Malfoy said abruptly, voice oddly rough.\n“Yeah.”\nThey faced away from each other and disrobed and exchanged muttered curses like, “Watch it, Potter!” and “I’m not the one stabbing you with my arse, you bony tosser,” when their arses bumped, until they were finished.\nFinally done, they faced each other again and Harry surveyed Malfoy, whose sleepwear was made of some kind of silky material. The top two buttons of his shirt were undone at the throat. It left Malfoy’s collarbone exposed, as well as the shiny edge of a scar at the top of his chest. As pyjamas went, they were pretentious and stupid and probably not nearly as comfortable as Harry’s tee and flannels, but… They suited him. He looked posh and slightly younger and irritatingly attractive.\nHarry’s eyes flicked up to Malfoy’s face. Malfoy was watching him, eyes compelling and thoughtful. He stood in a shaft of moonlight from the window, which made his hair shine silver.\nHarry turned away with a nervous grunt and was surprised when he was halted by Malfoy’s hand on his arm. “What were you just thinking about, Potter?”\nDefensively, Harry shrugged him off. “Why are you so interested?”\nA crease appeared between Malfoy’s eyebrows and he gestured with one hand. “I felt…”\n“If it’s not my business what you feel, it’s not yours what I do,” Harry muttered, flushing for the thousandth time in thirty minutes. He jerked his head toward the bed. “Let’s just get in.”\nMalfoy's face tensed, his shoulders coming up. They moved in tandem, climbing into the bed from the foot of it and crawling up to the pillows. After slipping under the covers, Harry cast a quick, wordless Nox and felt Malfoy’s surprised intake of breath. There was a heavy pause, and then Malfoy murmured, “You can do wordless, wandless magic?”\n“Well, yeah. For some stuff. Basic spells. I’ve only done the more complicated ones accidentally,” Harry said, feeling more comfortable with the light out, even though he was still too aware of Malfoy, just inches away from him.\n“That’s… uncommon. For most wizards.”\n“Do you know any?” Harry asked without thinking. It was strange how it seemed, in the dark, they were able to have an almost a normal conversation.\n“I can do some wordless and some wandless, but I haven’t done both at the same time,” Malfoy admitted, somewhat stiffly. His disembodied voice took on a sneering quality. “I guess you’re just good at everything aren’t you?”\nHarry’s hands closed in frustration. He ached to give Malfoy a sharp fist to the nose to repay him for the train in sixth year, but he knew it would only lead to more trouble. Even just the tension brought on by Malfoy’s words had an unpleasant effect on Harry’s chest; his fingers twitched and his legs jerked uneasily from it. He rolled to his side, tugging the blankets with him to more securely warm himself and smiled meanly when Malfoy gave an offended yelp and tugged them back. Harry let go of the extra he had taken and felt Malfoy settle back against his pillows with a huff.\nHe couldn’t figure Malfoy out. His mind returned to the simple letter he had received from him early in the summer after the trials, thanking Harry for speaking up for his mother (and himself, although he neglected to write that part), and for the return of his wand, which Harry had shoved into his hands as he walked out of Wizengamot after being declared free on probation. He remembered Malfoy’s startled expression, that split second of shining joy on his face, which had grown much thinner while he waited for his trial. The letter wasn’t detailed and didn’t ask for a response, but Harry had opened and reopened it in the weeks following to look at the precise, flowing script of it and be surprised anew at the kind, grateful simplicity of its contents.\nHe’d thought… Fuck, he didn’t know what he thought. He thought, for the first time, that maybe he and Malfoy could have been friends if their families had been different, if their destinies had led them down alternate paths. He’d wondered what would have changed if he had tried being nice to Malfoy in first year, maybe hadn’t turned up his nose at that handshake, while still figuring out a way to defend his friends from Malfoy’s inherent snobbery.\nUpon coming back for eighth year, Harry had searched for Malfoy, picking out the highlights of his pale hair across the Great Hall and expecting Malfoy to respond well to his friendly smile -- which, of course, he hadn’t. He’d sneered, like always, and Harry had felt like an idiot. The idiocy he could cope with (he had a lot of practice) but the weird sense of… disappointment that had accompanied Malfoy’s sneer had been something else entirely.\n“Malfoy?”\nMalfoy’s voice was rough, on the verge of sleep. “Mm, what is it now, Potter?”\nHarry wasn’t sure. Out of the thousands of things he wanted to say, he finally picked out, “Nothing. Just wondering if you were asleep yet.”\nMalfoy’s voice grew slightly sharper. “I almost was, you annoying tit. Now shut it.”\nHarry did. He willed his thoughts to Quidditch, replaying the most recent match he had attended in his head. Soon enough, Malfoy’s breath turned deep and even, and Harry rolled back over to face him. He studied Malfoy's relaxed features in the shadows, which were strangely beautiful in repose. Malfoy’s face had filled out some and he’d lost the pinched, pointy look that Harry had long associated with him. His nose was long and straight, his cheekbones high and elegant, and his chin — well, yeah, was still a bit pointy. His hair fanned the pillow it rested on. Harry turned onto his back again and stared at the bed hangings in the dark.\nSleep, as it turned out, would not come for a long time.\nUnlike the previous evening in the medical wing, consciousness returned to Harry with a snap the next morning. He had been having a delicious dream about staring out at the beach, bare feet in sand when, suddenly, he was back in his bed, with an armful of Malfoy.\nAlthough armful wasn’t quite right, Harry thought, his jumbled thoughts clearing as he woke. Malfoy was more draped across Harry, boneless in sleep. His chest covered Harry’s and his face pressed into the crook of Harry’s neck, his hair falling in Harry’s face. Oh. That was the beachy, coconut smell. Harry could feel Malfoy’s warm breath puff against his skin with every exhale.\nNot quite sure what to do, Harry stayed still. One of his arms had actually come up to wrap around Malfoy’s shoulders in the night and he removed it carefully. Fortunately, his hips were free because wouldn’t that be awkward. Like any of the rest of this is bloody normal, he thought, irritated with himself. But it wasn’t really his fault, he reasoned -- he was a normal, eighteen-year-old boy and waking up with Malfoy on top of him had nothing, nothing, to do with his... usual morning problem, which was tenting his flannel bottoms quite insistently.\nOn the rare occasion it went away completely by itself, but usually Harry had a good morning wank in the shower to take care of it. He sighed, nibbling on his lip. Obviously that wasn’t going to happen today. He used his free hand to adjust it to a less obvious position and grabbed a handful of covers that had fallen off him in the night to flop them over his groin.\nMalfoy was still out cold. Harry took a moment to see if he could still feel Malfoy's magic. He closed his eyes and focused on the sensation in his midsection.\nYes, there. The link was still strong — stronger than the previous day — but for the moment, Malfoy’s magic seemed calm. Peaceful and... rather lovely. Like a placid lake with a surface that had been warmed by the sun or the gentle lap of waves on a beach. Harry felt settled by it, by the way it almost seemed to glow inside of him. He finally understood what Hermione said when she had told him that they had been bathed in light.\nHis problem wasn’t going away. If anything, focusing on Malfoy’s magic and the link between them had made it more pressing. Harry shifted his hips uneasily, trying to scoot away, and got a sleepily murmured protest for his efforts.\nHe cleared his throat. “Malfoy,” he said, voice low.\nSlumberous, smoky eyes fluttered, blinking up at him. There was a crease on one of Malfoy’s cheeks, from the sheets or pillow, although Harry couldn’t quite figure out because apparently, he’d been Malfoy’s pillow. Malfoy looked up at him, sleep-warmed and relaxed, completely unguarded for once. Harry had time for a single thought, oh, shit, before he saw the click of understanding on Malfoy’s face. His eyes widened and pupils dilated and he sprang away from Harry, tangled in the sheets, to stared across the length of the bed, panting. They both froze at the same time. The distance between them felt like a rope made of razors, pulling at Harry’s insides. Their link gave a sharp, wrenching twist and Malfoy voiced a guttural little mew before moving back closer until the pain eased off.\n“What the fuck were you doing, Potter?” Malfoy finally got out, voice scandalized.\nHarry couldn’t resist a grin. He still hadn’t moved an inch from where he had been. “Acting as your mattress, I guess,” he said, raising his eyebrows.\nMalfoy glared at him and sniffed. “As if I would ever expose myself to secondhand furniture. Merlin, what are you even wearing?”\nHarry glanced down at his worn shirt. There was some loose threading at the hem, a hole in the shoulder seam, and it had been cleaned so often that the Canons emblem was practically worn off, but was all the more comfortable for its age. “My pyjamas. I was wearing them last night,” he pointed out.\n“I must’ve been too traumatized by the thought of having to sleep next to you to notice,” Malfoy grumbled.\n“I guess you got over that,” Harry said with a snicker. Malfoy’s eyes darted up to his and Harry gave a toothy grin at the pink stain spreading ovet Malfoy's cheeks.\n“It must have been the spell,” Malfoy mumbled resentfully. “Or you did something.”\nHarry shrugged. “That’s me, Defeater of Dark Lords and nefarious caster of spells that get people to drool on me in their sleep.” He wiped his neck for effect.\nMalfoy rolled his eyes. “Why am I not surprised. Not enough that they drool on you during all of your waking hours, I suppose?”\nHarry gave a startled laugh. He was pretty sure Malfoy had meant that in a mean way, but there was a lot of truth to his snark. “I guess not.”\nMalfoy’s posture relaxed a little and they sat for a moment in bed, staring at each other. Finally, Malfoy broke their gaze by glancing at the loo in a way that reminded Harry of both the pressure on his bladder and the other… pressing issue. Fuck. \nThey clambered off the bed in unison and made way for the bathroom. Using the previous night as a template, they stood back to back while each of them took care of their needs. Harry’s problem faded a bit, thankfully.\nWhen he was finished with his turn, he looked over to see Malfoy gnawing on his slender lower lip and staring at the shower stall. Harry’s humour of the morning faltered a bit. The stall was more than wide enough for two people, but that wouldn’t matter when they would need to be near-touching for the whole thing.\n“We could, er, cast a cleaning charm,” Harry offered quietly.\nMalfoy’s nose wrinkled in disgust. He gave Harry such a fussy, distressed look that Harry actually felt bad for a minute. Malfoy sighed. \"We can’t cast on ourselves yet. Besides, cleaning charms are superficial. I actually prefer to shower at night, and now it’s been over a day.”\n“I offered!” Harry said. Malfoy shook his head silently, still staring at the stall.\n“We’ll just do it fast,\" he said.\nWith determination equal to that of a Gryffindor, Malfoy strode forward. Harry followed, lingering awkwardly and fiddling with the plush towels hanging by the shower door as Malfoy reached in to turn on the spray and adjust the temperature. Malfoy glanced at him and half turned, fingers dancing down the buttons of his nightshirt and Harry reluctantly began disrobing as well. They made short work of undressing, studiously not looking at each other. Malfoy stepped into the shower and Harry did likewise.\nMalfoy took the first spot under the spray, the extra water bouncing off him and hitting Harry on the shoulder and in the side of his face. Harry hissed.\n“Fuck, Malfoy, that’s freezing!”\n“I like it that way,” Malfoy snapped, facing away.\nHarry shivered while he waited, hopping lightly in place to keep his teeth from chattering. Malfoy soaped up and rinsed off quickly, then used two different hair potions, Harry saw from his periphery.\nThat wasn’t all he could see. Down, shifting occasionally with Malfoy’s movements, was the round curve of Malfoy's pale backside — not actually bony, at all, as it turned out. Harry made an effort not to stare, but it kept drawing his attention like a lodestone. He closed his eyes completely and focused on the freezing water spraying the right half of his body. Malfoy suddenly elbowed him and Harry grunted, opening his eyes. He ticked a glance — keeping his eyes up — to Malfoy’s face, which looked irritated and as cold as Harry was. Merlin, his lips were even turning blue.\n“Your turn,\" Malfoy said, training his eyes on the stall door.\nHarry stepped under the spray, resolutely not adjusting the cold water, which it was actually helping his morning problem quite a bit. He washed himself quickly, rubbing a rough washcloth over his bits and under his arms, and grabbed one of the shampoos Malfoy had left on the shelf -- if Malfoy got pissed, all the better. He scrubbed his head, rinsed, and turned off the water as fast as he could, ignoring the occasional brush of wet skin-on-skin he felt whenever he moved.\nMalfoy grabbed a towel for himself and wordlessly handed over the other. Harry took it, grateful to cover up for a moment. They brushed their teeth like that, side by side, staring into the mirror with towels wrapped around their waists. Then Malfoy began a weird ritual of grooming that rather fascinated Harry, not that he would ever admit it.\nFirst, Malfoy began with some sort of cream, which he rubbed thoroughly into his skin. Following this, he applied two more hair potions. The last step, it seemed, was to stroke his hair with a fine-toothed comb that had a mother-of-pearl handle and appeared to have inlaid drying charms. Harry stopped watching. He didn’t know whether to be embarrassed that it took him twenty seconds to comb his own hair, or annoyed that it seemed to take Malfoy an hour.\nTo distract himself, he closed his eyes again and found the link between them. It was there, a glowing little knot of two different forces wound around each other. Malfoy’s grooming routine seemed to have a calming effect on both of their cores.\nHarry stopped, struck at the realization that he could so closely identify the tangled mess linking their magic. Tentatively, visualizing it as just that — a link — he gave it an internal nudge. A soft gust of air that edged on a whine escaped Malfoy’s throat and Harry opened his eyes to find Malfoy staring at him in shock.\n“Did you do that?”\nHarry nodded, throat throat working. Whatever he had done had felt… good, though strange and perplexing. At least, to him.\n“Yeah. I was just… experimenting.”\n“Go experiment with someone else,” Malfoy snipped, looking at Harry distrustfully in the mirror.\nThe calming glow of the link had ceased, replaced by a frantic little thumpthumpthump, like the throb of a panicked heart. Harry bit his lip, resolving to talk to Highlash about it.\n***\nBreakfast was as bad as dinner had been.\nWithout warning or prior discussion, Malfoy marched to the Slytherin table and sat down on the bench hard, outside Parkinson and Zabini. It gave Harry no choice but to follow, only to be quite thoroughly ignored. Harry caught sight of Ron's outraged face from across the Hall and gave a helpless shrug.\nHe sighed and began filling his plate with nearby sausages and toast. He reached over Malfoy to grab the eggs, purposely bumping Malfoy’s arm and smiling vacantly when it caused Malfoy to spill his food. It earned him a glare from Malfoy and, surpisingly delighted smirks from Parkinson and Zabini. But when no one engaged with him, Harry set to work on his food, deliberately attempting to eat with more reticence. So his table manners might be a little lacking for a pure-blood snob like Malfoy; so what? He ignored the little voice in his head reminding him of Malfoy’s insult from dinnertime -- it certainly wasn’t his fault that he’d been half-starved growing up and enjoyed food whenever he could now.\nHe ate diligently and carefully, as happy to tune out the conversation going on next to him as the people having it obviously were for him not to hear. Still, snippets kept bleeding into his ears. “…thing you thought it would be?” Zabini murmured at one point, and Malfoy rumbled a hushed, angry response.\n“Don’t worry, darling, you’re not going to… although, I’m not convinced he’s not actually a…” Parkinson whispered, and Malfoy's loud hiss cut her off.\nIt went on like that for a bit and Harry was on his second cup of coffee — something he’d recently discovered wasn’t at all atrocious when you added enough cream and sugar — before the sneaky bastards were done talking. He looked down at his plate with a little regret at not finishing everything there but, well, at least Malfoy would have no cause to insult him about his eating habits again. Probably.\n***\nHarry and Malfoy waited in an empty classroom for Professor Highlash to show up. McGonagall had informed them of the time and place during Advanced Transfigurations which had, all things considered, not gone nearly as badly has Harry had expected.\nFor one thing, Malfoy was bloody talented at Transfiguration, Harry had to admit, as good as Harry himself. He knew Malfoy was a better student overall, but Harry had taken a not-insignificant amount of satisfaction in keeping up with him. He even managed to fully Transfigure a live bird in a cage into a fish in a bowl, whereas Malfoy’s fish still had a feather attached to one fin (something he attributed, in a grumble, to being distracted by Harry’s magic).\nOther than that, it had been rather heavy on lecture and light on the spellwork, as classes went, probably out of deference to their problem, but Harry walked away feeling as though it had gone rather decently. If one could define \"decently\" as he and Malfoy managing to not kill each other.\nFollowing that, they had eaten lunch — this time at the Gryffindor table (Harry employed Malfoy’s not-bothering-to-ask approach), and he’d gotten to talk to Ron as well as Hermione, who had already found eight thick tombs on the theory of magical cores, and was researching for medical cases similar to theirs, though she hadn’t found them yet. Harry had listened, trying not to let his eyes glaze over as obviously as Ron’s, when Malfoy had interrupted her steady string of words.\n“Bloodwork,” he’d said suddenly, jerking Harry’s attention back to the conversation.\nHermione had paused. “Excuse me?”\n“You mentioned yesterday that the magical signature is found in the blood. Potions used on Wizards interact with the blood; almost all of them have traces of iron or something with an iron base to allow for easier and quicker absorption into the blood,” Malfoy explained, leaning toward Hermione and lowering his voice. His shoulder brushed against Harry’s, causing an odd little flip in Harry’s midsection that had nothing to do with their link. “I mean, there are a certain few that interact with stomach acid, but even those are eventually absorbed into the blood flow. You should cross-reference any spells that do, as well.”\nHarry exchanged a startled glance with Ron before looking at Hermione, whose eyes were suddenly bright. “Because spells can affect only part or all of the wizard,” she said slowly. “Like glamour spells and warming charms.”\nMalfoy nodded with satisfaction. “Yes. Which is what Smith’s should have done. His hex was meant to bind my mouth closed. Obviously, it affected something in our blood too, which is odd, but also telling. If you insist on researching this, you should be cross-checking medical records with potions or spells that had an immediate effect on the blood content of the wizards.”\n“That’s… That’s rather brilliant, Malfoy,” Hermione said with a wide smile. “Thank you, that should narrow my search quite a lot.”\nHarry could swear he saw colour rising in Malfoy’s pale cheeks and he felt something akin to satisfaction inside — definitely not his — as Malfoy waved a vague hand at her and hesitated. “If you find yourself in need of help…”\nRon’s eyebrows skyrocketed and he choked on his food, but Hermione simply smiled again and nodded. “You would do that?”\n“I don’t mind research,” Malfoy mumbled. With a sneer he'd added, “And I want to get rid of him as soon as possible, of course.”\nHermione sighed. “Of course.”\nAfter lunch had been Advanced Potions, in which Slughorn had been delighted by their pairing. Slughorn had been vaguely disappointed by the lack of potions intuition Harry had shown back in sixth year, but Harry had been applying himself diligently since the beginning of term and, without Snape there constantly making him feel like an idiot, he’d improved quite a bit on his own. Potions was one of the most important N.E.W.T.’s for a potential Auror to pass, as many of their investigations had to do with being able to identify or craft them. And he had gotten much better, there was no doubt about that — a lot of it had to do with actually listening and taking notes, he’d found — but Malfoy… Well, Malfoy was simply brilliant with them.\nThey had been assigned a rather complicated potion designed to make the consumer feel euphoria for an extended length of time. When Harry had accidentally reached for the gold flakes instead of the gold shreds, Malfoy had stopped him with a quiet hand over his, gesturing to the right bottle without a word. It happened again when Harry had taken a silver knife to cut the Campion petal; Malfoy simply tugged the knife away and murmured, “Tearing it into small pieces with your fingers works better.”\nTheir potion had turned out perfectly, much to the delight of both Harry and Slughorn, who had awarded each of their Houses twenty points.\nIn truth, though, Harry had been most impressed by the quiet competence of Malfoy while working together. When once he would have done anything he could to make Harry look stupid -- even at the risk of his own grade -- today he had efficiently and generously lent his knowledge to Harry in a way that made it possible for them both to benefit.\nIt made Harry almost… admire him. When Malfoy wasn’t being an arse.\nWhich was a different problem, altogether.\nHighlash finally bustled in, carrying a pile of books and parchment and tearing Harry out of his reverie. He placed his armful on a nearby desk and leaned on it, scrutinizing Harry and Malfoy in a way that made Harry slightly uncomfortable.\n“All right,” he said finally. “We’re going to begin with some mental exercises, and I have some for you to work on whenever you have a free period and I’m not able to assist. Do either of you have any questions, first?”\nHarry had plenty, but he was surprised to hear Malfoy speak up first. “We can’t spell each other or ourselves.”\nHighlash nodded. “That will come, once you’ve learned how to utilize the other’s core in tandem with your own.”\n“But we can work other spells,” Harry pointed out, confused. “Why can we do those, and not others?”\n“They cause each of you some discomfort, though, when the other casts a spell?” Highlash guessed. They nodded and Highlash clicked his tongue. “Have either of you ever heard of the Devil’s Snare?”\nHarry huffed out a soft chuckle and nodded again, earning him a strange look from both Malfoy and Highlash. After a second, Malfoy nodded too. Highlash continued, “Think of it this way: Anyone unfortunate enough to be caught in it will automatically resist. It’s what we do, as humans. We don’t like to feel trapped. But doing so causes a reaction in the plant — it holds you tighter. It’s only when you relax your body that the snare releases its hold. In much the same way, whenever you cast — which is important to keep doing, understand — the part of your core entwined with another, foreign being, will tighten against the resistance. Once you each learn to work together, to cast together, your cores will relax, and should start responding positively to the other, as an extension of themselves, rather than as intruders they need to fight. t’s a rather intimate thing, I would expect. It might take some time, as I’m aware the two of you are not what most people would call… friendly.”\nHarry saw Malfoy’s mouth drop open.\n“No, sir,” Harry said, too-seriously. “We haven’t been.”\n“Well, you’ll need to work on that. Trust is key,” Highlash said briskly. “Now, then. We’ll be working on isolating the feeling of your individual magic so that you’ll have an easier time separating it, if it comes to that. How much of the lecture do either of you remember?”\n“You were telling us to visualize our core as the Elements,” Malfoy said promptly. Harry didn’t remember that part but he bobbed his head anyway.\n“Yes. All right, as I said, magical energy comes from four of the five elements, Fire, Wind, Water, and Earth; however, there is usually one dominant element in each wizard’s core that is utilized,” the professor said. “I’d like you to close your eyes and search for the connection between you. How easily can you identify it?”\nHarry closed his eyes, focusing, and there it was, pulsing between them. “Very, sir,” he said quietly.\nMalfoy made a little noise in the back of his throat. “Yes.”\nHighlash “mmm”d thoughtfully. “Can each of you discern which is yours and which belongs to the other?”\n“Yeah, that’s also pretty easy,” Harry said, still examining it in his mind. “I mean, there are places in the link that are tangled and I lose sight of what’s his and what’s mine, but for the most part…”\n“A link. Very good way to describe it, Mr. Potter,” Highlash murmured.\n“I can, too,” Malfoy said after a moment’s hesitation. “But it doesn’t seem as easy as he’s describing. It’s… bright.”\n“All right, that’s fine,\" Highlash said. \"Now. Would either of you be able to tell me what the other’s primary element is?”\n“Water and air,” Harry said instantly, the words tumbling out. He opened his eyes, a bit startled, but recognized the truth of it without bothering to examine the tangle of their cores. Whenever he thought of Malfoy’s in any comparative terms, it was always in some form of water or air.\nMalfoy was looking at him, eyes wide. Harry shrugged, a little uncomfortably. Malfoy pursed his lips. “Nice of you to pay so much attention to me, Potter,” he mumbled out of the side of his mouth.\n“I can’t help it, you wanker, you’re inside me,” Harry shot back angrily. His words were still echoing in his ears when the double meaning hit him and his face flamed.\nMalfoy snickered. “You wish, Potter.”\n“All right, both of you, stop it,” Highlash said with an exasperated sigh. “I don’t know how I can make it clearer to either of you the importance of working together. Mr. Malfoy, can you identify Mr. Potter’s element?”\nMalfoy closed his eyes again for a long moment, and Harry studied him curiously. “Fire,” Malfoy said at length. Harry didn’t know why he was surprised. He’d thought to hear Malfoy say Air -- maybe because of Quidditch. Malfoy paused. Then, more tentatively, “But… I think, Earth, too?”\n“Really? Interesting!” Highlash said, moving closer. He absentmindedly scratched at his beard as he studied Harry — again, Harry felt that waver of discomfort at the scrutiny. “Dual primary elements happen, of course, but they’re certainly not common. And to find them in two people who have been Bound… Mr. Malfoy, can you describe why you feel that way?”\nMalfoy flushed slightly, and Harry was so intrigued by the colour in Malfoy's cheeks, he almost forgot to listen to his answer. “It...burns,\" Malfoy said, not looking at him. \"It surges and fades. But there’s something about the replenishment of it that feels… Healthy.”\n“Very interesting!” Highlash murmured. “And Mr. Potter, you? How have you seen his?”\n“Rain. A lake. Ocean waves, calm ones, before he woke up this morning. Once, when it first happened, I thought of wind. And I keep picturing storms,” Harry supplied slowly.\n“Very definitely water and air,” Highlash confirmed. “Well, it’s obviously proceeded much further than I thought possible in a single day if you two have already been able to visualize each other’s Elements. Tell me, can you influence the link at all?”\n“He can,” Malfoy said quietly. “I haven’t tried.”\n“Try,” the professor urged, looking entirely too fascinated.\nMalfoy huffed softly and closed his eyes again. Harry waited and, after a moment, felt a strange, tiny ping inside, like the vibration of a bell.\n“I felt that.” He turned back to the Highlash, who was watching them with an odd little smile. “That reminds me, Professor. We’ve also been able to… Sense each other’s — I guess, emotions? A few times. Is that normal?”\nHighlash had the audacity to laugh. “None of this is what I would call normal, but that, at least, is hardly surprising. The link is going to grow and expand in different ways. Your individual cores are very likely experiencing a lot of negative impact, particularly as you two are not… inclined… toward friendship. The link is making you listen to each other so that your cores aren’t damaged.”\n“How do you know all of this, Sir?” Malfoy asked abruptly. “A friend of ours said that Magical Cores is a highly under-researched area and that hypotheses abound on the subject.”\nHarry goggled at him briefly, almost too distracted by hearing Malfoy describe Hermione as a “friend of ours,” to process Malfoy’s actual question. Once it penetrated, he turned to the Professor with interest.\nHighlash’s expression lost its humour. “I’ve been the leading expert on Magical Core Theory for the whole of my career, young man. Most of the books you read -- at least, the ones which have been written in the last few decades -- will either have been written by me or have me quoted in the text. Furthermore, I worked in Magical Research at the Ministry for my first ten years out of Hogwarts.”\n“Of course, Sir,” Harry said, words stumbling. What had just happened? “It’s good to know we’re in the hands of an expert.”\nHighlash’s face softened. “I understand. This is all academic to me and you two are the one having to deal with the effects of it. Of course you should be interested in my knowledge of the subject.” He cleared his throat. “Now, then, I’m going to be assigning you some exercises to do tonight and anytime you have a free period…”\nHarry turned his ear to listening, but half of his mind remained on Malfoy -- and the roar of the river he could hear inside of himself.\n***\n“All right, do you want to tell me what that was about, with Highlash?” Harry asked.\nHe had tried to bring it up at dinner — at the Slytherin table — and had been silenced by a swift shake of Malfoy’s head. When Parkinson had leaned forward with gleaming eyes, demanding to know what he was talking about, Harry had understood why.\n“Don’t worry your pretty tits over it, Pans,” Malfoy had said lightly, making her laugh, though Harry felt a quick unpleasant thrill over the interaction. It was true that Parkinson did have very nice tits, if one were inclined that way, Harry thought sullenly, eating his dinner as Malfoy began another whispered conversation with his friends. He wondered if Malfoy was still dating her. They were together all the time, obviously, but Malfoy didn’t seem especially nice to her — not that Harry saw him being especially nice to anyone, really.\nMaybe it was a Slytherin thing.\nAfter dinner, Hermione had wrangled an invite for herself and Ron up to their rooms, where he and Malfoy had wedged themselves together on the loveseat. Ron had levitated the chess table over to them and begun a game with Harry while Hermione had sat on the floor in front of them and talked concepts with Malfoy. Never good at chess, Harry played with an ear toward Hermione and Malfoy’s conversation, the rest of his mind wandering. At one point Harry's ears perked up when Malfoy had asked, “Is Professor Highlash quoted in any of those books?”\n\"Oh yes,” Hermione said blithely. “I was only able to locate one of the ones he’s written, but I think there are two more. He’s probably the most knowledgeable wizard in Britain on the subject of Magical Theory and most of his research was done on Magical Cores. Like I said, though, much of it is hypothesis, as there isn't any safe way to really test the magical core — or at least, not any way to recreate tests. But he’s very smart.”\n“Potter, you’re three moves from checkmating the Weasel,” Malfoy said out of nowhere. Harry looked down at the board and then up at Ron’s horrified face.\n“I am?”\n“You are not!” Ron said, affronted.\nMalfoy snorted. “Why am I not surprised that you didn’t know? Check your knight.”\n“Malfoy,” Ron growled warningly.\nMalfoy looked at him for a moment before throwing his head back on a laugh like Harry had never heard from him before. Straight white teeth flashed and the constant tension in the slant of his mouth eased as Malfoy smiled. “If you ever have enough courage to play someone you can’t beat with your eyes closed, Owl me,” he said, still chuckling.\n“I mostly play Harry for practice,” Ron grumbled. Harry glared took his queen, positioning for his first chess win against Ron in seven years. Malfoy had laughed again and Hermione joined in.\nDespite the euphoric — if somewhat stolen — victory of the night, Malfoy’s odd behavior kept returning to him. They’d worked on their homework (eighteen inches on Transfiguring live creatures and twelve on the differences between mood potions and love potions) and had taken another, even more awkward visit to the bathroom before sharing another freezing shower. They were lying in bed when Harry remembered to ask about it.\nHe felt Malfoy shift next to him. There was a long silence. “I don’t know. I felt like he was more interested in learning about us than treating us.”\nHarry had felt that way, too, although he hadn’t realized it until Malfoy said so. He exhaled, thinking. “Well, maybe. But even if he was, he’s still treating us, so it’s all the same, right?”\n“I suppose,” Malfoy said grudgingly. “Not that you’d ever expect a teacher to turn down helping you, Potter.”\nHarry sat up in bed, suddenly bubbling with frustration. It skimmed through his body like a physical entity. The connection between them heightened, bordering on pain, but Harry ignored it. It really, really sucked that they couldn’t just fight, Harry thought with some desperation.\n“Merlin, what is with you, Malfoy?” he demanded. “I try to be nice and you’re an arse. I try to ignore that you’re a arse and you become an even bigger one. I actually start to feel that you might be a bit decent and then out of nowhere you become you again!”\n“I never claimed to be decent,” Malfoy drawled evenly.\n“What was that with helping me with chess tonight? And why are you working with Hermione?”\nMalfoy gave an exaggerated yawn. “I play chess. I simply noticed. Who I hate more has always been a toss-up between you and the Weasel,” he said nastily. “Tonight I just figured it would bother him more to lose; you seemed quite used to it.\n“As for Granger, as I told her, I want out of this situation as quickly as possible and she does seem to have some good ideas,” he continued. “Even if she is a Mu—“\n“Say it and I’ll hex you, I fucking swear,” Harry said dangerously, palming his wand. “I don’t care what the repercussions are, I really don’t.”\n“I was going to say ‘Muggle-Born,’” Malfoy sniggered. “But my, my. It’s not as if I’ve insulted your precious girlfriend. Although — maybe there’s more there than most people know? Does the Girl Weasel know how to share? She doesn’t seem the type…”\n“She’s not,” Harry said curtly. He forced himself to loosen his grip on his wand. “That’s why Dean never looks at another girl, for fear that Gin will hex his bollocks off.”\nThere was a heavy, extended pause. It seemed to stretch like elastic, growing tighter and tighter in the silence, and Harry waited with a gnawing feeling for the snap.\nTo his surprise, when Malfoy finally spoke again, his voice was quiet. “I wasn’t aware. I thought you two were supposed to get married or something.”\n“The war changed things,” Harry said, suddenly weary. “Not that it’s any of your business.”\n“I felt your... affection for her.”\n“I feel affection for her, you idiot,” Harry muttered. “There are lots of different types of affection, in case you didn’t know.”\n“What happened?”\n“Who’s the Greengrass girl?” Harry challenged back, staring at Malfoy in the darkness.\nHis face shuttered. “Fuck off, Potter.”\n“Just stop it!” Harry shouted, goaded. “Look, I got your letter. I got it. I know you’re not always like this. And you owe me a little—“\n“What,” Malfoy said when Harry broke off, his voice going low and cutting, “is it that I owe you? Why don’t you tell me, exactly? A life-debt? Of course. Feel free to take it whenever you want. I’m not able to do much with mine anymore, anyway. Or do you want something more base than that? Just want to see me humiliated? Do you like looking at me across the hall and knowing I could be your house-elf? I'll bet you just love knowing you could have anything, anything you wanted from me with the snap of your fingers, don’t you?”\nHarry’s heart stuttered frantically. Merlin, the images that conjured. He was slightly ashamed of how quickly his body reacted, how quickly his imagination kicked into overdrive.\nMalfoy’s face was pinched and tight, covered in shadows that had nothing to do with the dark of the evening. His eyes were glassy, reflecting moonlight. Harry’s breath caught, and he felt a warm tingling begin in their link. It started where their cores were joined and radiated out in a flush that spread over Harry’s entire body. His cheeks grew hot and he closed his eyes as a wave of liquid want streaked through him. His cock began to thicken.\nMalfoy propped himself up on an elbow. His face had lost its tension, becoming soft and filled with something that looked like astonishment. He reached out a tentative hand and touched Harry on the wrist with two fingers. Harry almost groaned out loud at the amount of pleasure that Malfoy's skin on his wrenched from him.\n“What do you want from me, Potter?” Malfoy asked again, the question quieter and heavy, laced with something Harry didn’t understand — or couldn’t bring himself identify.\nHarry fought for control. That heat that flowed so effortlessly through him dominated his thoughts, but he forced it aside to assess Malfoy, who was looking at him with what seemed to be the same desire Harry felt, although it had to — almost certainly — come from the link.\n“Common courtesy,” Harry said in a low voice, because it was what he had been going to say before Malfoy’s outburst.\nBecause it was the truth.\nJust not all of it.\nBecause while he had, in his smallest and meanest moments -- those moments he wouldn’t admit even to Ron -- contemplated what Malfoy owed him, Harry knew he could never take something offered because of those debts. Could never take something given because it was his right to collect, no matter how much he wanted.\nFor a minute, he hated himself for it.\nMalfoy’s face, so open and almost hopeful only seconds ago, sharpened and shuttered. He drew his hand away, and laid back down before rolling away so Harry found himself staring at Malfoy's back.\n“That’s reasonable,” Malfoy said in a muffled voice after a few moments. “Good night, Potter. Sleep well.”\nHarry’s blood was still pulsing through him. He reached out a hand, stopping just before he could skate his fingers over the slide of those silver pajamas. He laid down as well, stuffing his wand back under his pillow, and closed his eyes tightly.\nAsking Malfoy to be courteous to him, Harry thought the next day, was possibly the stupidest thing he had ever done.\nBecause he was. Malfoy was just so goddamn courteous.\nThey woke up much as they had the previous morning, Malfoy’s body snuggled tight against Harry’s side, one long, muscular thigh thrown over Harry’s legs. He wondered momentarily if Malfoy had owned a giant teddy bear growing up, or if he was just a heat-seeker in his sleep. Not that their room was cold. In fact, the longer Harry stayed in Malfoy’s relaxed embrace, the warmer he began to feel. And his problem was back, apparently loving the pressure of Malfoy’s leg on top of it.  It took all of Harry’s control to not flex his hips upwards.\nDisgusted with himself, he muttered to his erection, “Can’t you give me a break for a single morning?”\n“Wha--?” Malfoy mumbled.  His leg shifted and Harry bit back a groan.\nHe was sorely tempted to go with it. It would be so easy -- he could tighten his arms just a little, could nuzzle his nose into the soft, white-blond hair fanning over his face. Could roll his hips up against Malfoy, checking for a response. He could simply blurt out the truth of his ill-advised attraction and maybe try for a kiss, if he felt just a mote less worried that Malfoy would automatically shove him five feet away, possibly killing them both on the spot.\nUntil the previous night, it hadn’t occurred to Harry that Malfoy might be inclined toward, well. Harry had been vaguely aware of his own interest in blokes but it hadn’t really mattered to him. Not until after the thing with Ginny had really ended and he had been left at loose ends with all of the roads in his life suddenly open and unmarked and filled with wonderful, terrifying possibility.\nHe Accio’d his glasses and shoved them on, looking down at Malfoy’s face. Keeping his eyes trained on the curve of Malfoy’s jaw, the delicate shell of his ear, Harry searched again for their link, wondering if he could sense anything more than surface feelings.\nAll was calm inside of them again. Malfoy’s face faded out of focus as Harry stared. Images of loose, floating white feathers filled his vision, Harry slipping into a languid sort of trance. The feathers swirled in a neat pattern of curlicues, gusting up and down against a blue bowl of sky. Harry pressed deeper, vaguely ashamed of snooping but too curious to stop. He could sense water again, like a deeply shadowed pool, and Harry pictured it, saw himself diving in and slicing through it as he swam to the bottom.\nIt was filled with so many things, sour regrets and fear and hopeless longing and even love -- Malfoy's emotions flowing around him. He couldn’t separate them but realized with sudden, anguished frustration that he would be able to, if he was allowed. He would be able to wade through the dark and light of Malfoy’s magic, to the core of who he was, if only he had enough desire to, -- and if Malfoy had enough courage to let him.\nMalfoy made a little sound. His body pulled away from Harry's and Harry was wrenched out of Malfoy's mind, away from the deep secrets that he was suddenly desperate to know.\n“If you’d let go of me, Potter?” Malfoy asked, voice cool and too-polite. Harry realized that his arms had tightened around Malfoy, whose body had gone stiff. Malfoy pressed his hand against Harry’s ribs in silent entreaty to be released.\nWith some effort, Harry loosened his arms. “I’m sorry. I…”\n“I know,” Malfoy interrupted, frowning. “I'm not sure what you were doing but I’d very much appreciate it if you didn’t investigate our link without my knowledge or permission. It woke me up and, beyond that, is rude.\n“I know. I’m sorry,” Harry said again, a little lamely. “I was just checking, you know, to see if it had grown.” His cheeks heated at the lie.\n“And I suppose it has?”\n“Yeah, I think so.”\nMalfoy stared at him for a moment and shrugged. Harry prepared himself for a nasty comment, but all Malfoy said was, “All right. Shall we?”\nAlthough not looking forward to another cold shower, Harry nodded, and they walked together to the bathroom.\n***\nMalfoy’s polite streak continued, much to Harry’s aggravation. The worst part was that he didn’t even seem to be doing it for amusements’ sake, as he might have done in prior years, if he’d known it would annoy Harry this much. Instead, he was perfectly civil and even solicitous.\nHarry hated it.\nAt mealtimes, Malfoy offered to sit at the Gryffindor table, “if you prefer.” At first, Harry felt vaguely suspicious and muttered something about, “half and half is only fair,” so as to not fall into whatever duplicitous trap Malfoy had in store for him.\nThis led to them swapping tables at each meal, much in the same way as before, but at least it had been agreed upon beforehand. Malfoy would sit at Gryffindor and discuss core theory with Hermione while they ate breakfast. Later, they switched to the Slytherin table, whose occupants seemed to be getting used to Harry’s presence enough that not all conversations immediately fell silent when he and Malfoy approached. Parkinson and Zabini continued teasing Harry in that light, snarky way that he was growing accustomed to and actually found rather funny at times, but the whispered conversations stopped when Parkinson began one over lunch, only to have Malfoy shakd his head at her. His face was like stone, washed of all compromise and lacking both amusement and sneer.\n“It’s rude, Pansy,” he explained levelly.\nAstonishingly, Harry thought it was the look, more than Malfoy’s words that had gotten her to subside. Just as shocking, she did.\nMalfoy loaded a plate of food and handed it to Harry, reminiscent of the first time they had eaten together. Harry looked down and saw all of his favorite things to eat on the plate: two different kinds of roast beef, roasted potatoes as well as mashed with gravy, and a small serving of the steamed and spiced cauliflower, which no one ever seemed to eat.\nNo one but Harry.\nHe threw a swift look at Malfoy and got a patient expression in return. “Did you need anything else, Potter?”\n“Er, no. Thanks. This is great,” Harry said, understanding for the first time Malfoy’s surprise when Harry had piled a plate for him, filling it with his favorite foods. He hadn’t even thought about it, then; it had been simple mechanics. For seven years, he had watched Malfoy. He knew without thinking what foods Malfoy preferred.\nHarry always knew it had been reciprocal but that didn’t explain why he was so stupidly pleased about it.\nAfter another Potions class and Advanced Herbology -- which Malfoy had asked politely that Harry join him in as it was practical work, rather than magical -- they met with Professor Highlash again.\nHighlash instructed them to work on rudimentary spells together, blending their magic as they cast. This was easier explained than done -- there was a constant bristle against each other’s core. When their eleventh Aguamenti had miscast — this time spraying a weird gray sludge into the professor’s face with Harry’s wand and producing an odd little trickle of brown water from Malfoy's — Highlash took off his glasses with controlled patience, cast a cleaning charm, and rubbed his eyes.\n“All right. I can see we’ve been going about this the wrong way,” he finally said. “You two are such a perfect pairing of Elemental Cores that it should be simpler than this. And yet each of you is resisting using perfectly good magic that is lending to your core strength just waiting to be utilized.”\nHarry sighed heavily, already exhausted. “Could it be an issue of… clashing personalities?”\n“It’s doubtful. One of the cases I reviewed was a pair of Auror partners who were incredibly different and in fact had no friendship until after they had been bonded but were quite dedicated to breaking their link,” Professor Highlash said. He flicksd his wand at a bit of sludge sticking to the top of his shoe and continued. “Despite their differences, they had been working together very well for several years. They knew each other.”\n“We know each other,” Harry said, then wondered immediately how true that was. Knowing the things someone liked to eat and the things they had done, wasn’t the same as knowing them.\nHighlash looked at him and tilted his head. “Do you?” he asked, echoing Harry’s thoughts. “Can you?”\nMalfoy shrugged, looking down at the floor. “We’re dedicated to breaking the link,” he said quietly. “Both of us.”\n“All right,” Highlash said heavily. “We need to work on trust exercises, I think. We’ll meet again on Friday. Please work on spell casting whenever you have a free period. If you manage to produce a successful spell together — nothing more taxing than Aguamenti or Wingardium Leviosa, please — you can attempt casting through one another’s wands. By this I mean, one of you casts, the other holds. And for Merlin’s sake, gentlemen, get to know each other in the meantime. Ask questions. Tell the truth. Talk.”\nIn what looked like a fit of stomping out while trying not to seem like he was stomping out, Professor Highlash left them alone together.\nHarry turned to Malfoy. “So, er, what's your favorite Quidditch team?”\nAfter a long inhale through flaring nostrils, Malfoy’s face returned to its composed expression. “I’m fairly certain that’s not what he meant, Potter.”\nHarry floundered. “Well, I mean, it’s not a bad place to start, is it?”\n“Puddlemere,\" Malfoy said with a slight grimace, obviously just giving up.\n***\nThey peppered each other with questions throughout the rest of the day. Harry learned that Malfoy’s favorite dessert was a kind of chocolate truffle from France, that he spoke four languages, and that he had seen a few minutes of a cartoon on a Muggle television once as child when his parents had taken him through London on their way to an Apparition point. When Harry asked, Malfoy politely explained that he took Advanced Herbology because of its importance in relation to potions and that he planned to become a Healer. If they let me, went unsaid but was heard in the lengthy silence after his statement.\nDespite their history together, Harry could quite easily see Malfoy in that profession. He was smart, extremely logical, and worked with a graceful sort of efficiency that Harry thought would probably come in handy for someone in the medical field.\nFor his part, Harry answered any questions that Malfoy had a mind to ask. He liked Treacle Tarts, was going to train to be an Auror, and had only been out of England once before Hogwarts, when he was seven, on a trip to Paris when his aunt and uncle couldn’t figure out a way to lock him in his cupboard for five days in a row. (He left that part out, as well as the part about having to sleep in the closet in the hotel.)\nHe wanted to visit Brazil one day because he was interested in the variety of South American magic he had heard of. He rooted for the Cannons, but mostly for loyalty’s sake because it was the first professional Quidditch Team he had ever been introduced to, through Ron. (He did say that part. He quite liked the Puddlemere United as well.)\nWhenever Harry would answer a question, Malfoy would raise his eyebrows a little and murmur, “Mmm.” Whenever he would answer one of Harry’s, it was always spoken in a very level tone of voice, not quite pompous enough to be dismissive, but only just.\nIt was driving Harry mental.\nHonestly, it wasn’t as though he liked when Malfoy was a git to him (Mostly. Usually. Although it could be oddly funny at times) but at least when he was, there wasn’t this frustrating distance between them. At least then, he was real.  Harry had no clue how they were going to be able to trust each other if he couldn’t dig them out of the mess he’d made by asking for Malfoy’s courtesy.\nIt was unnatural, anyway.\nIt wasn’t until they got into bed that night that it occurred to Harry that the way to push through Malfoy’s rigid propriety might be to just be honest. Or to irritate the hell out of him. That one was better, actually.\nHe waited until they were settled under the covers and swathed in moonlight from the window.\n“Up for a few more questions, Malfoy?”\nMalfoy shifted. “I suppose.”\n“Where is the coldest place you’ve ever been?”\n“Iceland.”\n“The hottest?”\n“Egypt.”\n“What’s your middle name?”\n“Lucius Black.”\n“Who’s the Greengrass girl?”\n“She’s— Fuck off, Potter!” Malfoy blurted.\n“I’m pretty sure she’s not a Potter,” Harry said dryly, trying to contain his glee. “And remember, we’re supposed to get to know each other.”\nThere was another one of those long, controlled inhalations and pauses. Finally, Malfoy said, “It was never going to work, anyway.”\n“What?”\n“Being considerate to you. You’re too…”\n“I’m too…?”\n“Much,” Malfoy said, voice surprisingly sad. “Fine, I’ll tell you if I get to ask you some real questions, too.”\nHarry felt a ripple of unease. “That’s fair, I guess. How many?”\n“Let’s say… We can start with three each?” Malfoy asked, his tone lacking its usual confidence.\n“Okay,\" Harry said. \"Who is she?” \nMalfoy grunted, and rolled over to face Harry. His face had taken on that familiar tightness Harry could feel in their link. “If you really must know, our families are in talks.”\n“Oh.” Harry waited and, when Malfoy didn’t expand, shrugged a little. “About what?”\nMalfoy gave an exasperated sigh. “About us, you nitwit. Her family is one of the Sacred Twenty-Eight, as is mine. It’s a fairly common practice for Pureblood families to arrange marriages for their offspring when said offspring comes of age. Astoria is in sixth year, so I’d still have some time, but…”\nHarry didn’t know what to say. His mouth felt dry and as distasteful as he found the idea of someone else picking who he was going to marry, he had the fleeting thought that that wasn’t why he was so bothered.\n“I’m sorry,” he finally settled on saying. “Do you ever think about saying no?”\n“Is that your second question?”\n“If it has to be,” Harry said, a little startled.\n“Yes, then,” Malfoy admitted. “I think about saying no. Every bloody day. The problem is, I don’t have any real reason to. Even if I did, I’m the sole Malfoy heir, with a duty to produce the next, so there’s that, as well.”\n“That’s… That’s really awful, Malfoy.”\nMalfoy shrugged. His face lost that pinched look and he looked at Harry carefully. “Do you have another?”\nHarry thought for a moment. He immediately dismissed several questions from his mind as either too intrusive or too inappropriate. “How’s your mum?”\n“My mother?” Malfoy’s pale eyebrows inched higher on his brow.\n“Well, yeah. All I know is what I read. And she did, you know, save my life,” Harry muttered. “I thought about sending her a letter, but I know how she feels about--\"\n“You don’t know anything about how she feels about anything,” Malfoy snapped. He stopped and took a deep, calming breath. In a modified tone, he said, “She would almost certainly appreciate that. She sends her regards to you in every letter I get.”\n“Thanks for telling me,” Harry said sarcastically.\n“I just did, so shut it. To answer your question, she’s better. They allowed her to spend her parole, which is almost over, under house arrest. The Ministry chose not to snap her wand and she's allowed quarterly visits with my father. In many ways, she’s doing much better,” Malfoy said, listing off each item as though it were simply raw data. But Harry felt the pull of something deeper in his core, a breeze of sadness and something sweeter, like pride and love combined.\nHe looked over again and found Malfoy staring at him, brows lifted and mouth quirked. He felt the strange urge to skim his fingers across Malfoy’s lips, curled into a smile that wasn’t mocking or cruel. Harry fisted his hands and looked away. “Your turn.”\n“Hmmm,” Malfoy said, voice light and sly. “Let’s see. There are just so many I could choose from…”\nRolling his eyes, Harry fought back a laugh. “Out with it. You get three.”\n“Why did you and the girl Weasel break up?”\nSurprised, Harry opened his eyes. “Really? That’s your first question?”\nMalfoy nodded.\nHarry drew a hand through his hair. He didn’t want to say anything that would make Ginny look bad, or reveal anything that would make their bed-sharing situation more uncomfortable than it already was, but he had promised to tell the truth. He copied Malfoy and took a long, deep breath.\n“It was a lot of things. She… ah… She was thrown together with Dean during the War a lot. While I was gone. And, er, things happen during a war. And when she told me, I didn’t have the best reaction,” Harry admitted, remembering the utter fury that had swamped him when she had confessed her renewed feelings for Dean, right after Fred’s funeral, and how close they had gotten. He remembered the way her eyes had shined with tears.\nHarry’s throat tightened. He coughed to clear it. “It wasn’t all her. I mean, I reacted badly. But it wasn’t like we were together, not really. I left her alone for a really long time. There were times when she thought I was dead; she always knew I could be. And I changed, too, a lot, while I was gone. I don’t think it would have worked out, anyway, really. We’re trying to be friends now. I think we can be.”\nMalfoy was watching him steadily. He looked grave. “Do you still love her?”\n“Is that your second question?”\nMalfoy smiled a little. “All right.”\n“Yes. And no. It’s different now, like everything is. I still feel, I guess, sort of possessive about her. I don’t exactly like that she and Dean really got back together; that makes everything else feel like less of something she fell into and more…”\n“Premediated?”\n“Yeah.” Harry hesitated. “But Ginny’s special. She deserves someone who makes her happy. And I think, you know, I deserve someone who can…”\n“Be faithful during wartime,” Malfoy supplied when Harry wavered.\nHe grunted. “Like I said, we weren’t really together, together. I basically broke up with her at the end of sixth year because I knew a lot of what would be coming. But… yeah.”\nMalfoy gave a little, “Hmmm,” of understanding and fell silent for a few minutes.\n“Last one?” Harry prompted when the quiet had gone on too long for his comfort.\n“Why did you react that way when I commented on your food intake?” Malfoy asked, a little cautiously.\nOh. Harry swallowed and onto his back. He stared at the bed hangings and heard Professor Highlash in his head. Tellthetruth. Tellthetruth. The truth of it was that it still felt raw when Harry thought about the boy he’d been. He didn’t understand why it bothered him so much more now, at eighteen, than it did when he was eleven. But when he woke up from nightmares, they were rarely about Voldemort anymore.\nThey were usually about his cupboard.\n“You asked if they starved me, growing up,” Harry said abruptly. “Well, they did, pretty much. I don’t like to talk about it. It felt low, even for you.”\n“Wait, what do you mean, ‘they did?'” Malfoy said, his voice taking on an odd, choked quality. “You’re Harry Potter.”\n“Right, but I didn’t know that that meant anything until I came to Hogwarts,” Harry said. He closed his eyes. “I was just Harry Potter, who lived in the cupboard under the stairs. I cooked for them and they didn’t let me eat much of it, that’s all.”\n“You… They… You…” Malfoy’s voice was shocked.\n“Look, I’m tired. I answered your questions. I want to go to bed now. We’ll talk about other stuff in the morning,” Harry said. It came out too hard but he couldn’t really help it. He felt too exposed, every word like broken glass was in his throat, and he didn’t want to start crying in front of Malfoy, of all people. No matter how remotely decent he seemed in the dark.\nHe rolled onto his opposite side, pushing away the static of anger and pain that tried to fight to the surface whenever he thought about his childhood lately. He shut his eyes against the tears that prickled, but then, suddenly, there was a palm pressing gently against the protruding angle of his shoulder blade and just as swiftly removed. He felt a rush of something cool and calming inside, like taking a long drink of sweet well-water after having been out in the sun all day.\n“I’m sorry,” he thought he heard, softly. For a moment, for just that night, it was enough.\n***\nThe morning dawned rather like the days before, Malfoy pressed tight against Harry’s body, one arm thrown across his waist. But for the first time, Harry wasn’t startled by this fact upon waking up. It was possible he was just getting used to it but it very likely had something to do with what he could feel pressed against his hip. Seemed like Malfoy might have the same problem he did.\nHe stayed there, cheek resting atop Malfoy’s head, and contemplated the previous night. He wondered if he had imagined -- or possibly dreamed -- Malfoy’s gentle compassion, so different than he’d ever been before upon hearing about one of Harry’s weaknesses. But he could almost feel the press of Malfoy's hand on his shoulder blade, still, warm through his faded shirt. He could feel the flare of their link and the rush of centredness that Malfoy had somehow given him.\nHe wanted to close his eyes and pilfer the link for a few moments before Malfoy woke up and became guarded again, but instead jostled his shoulder a little. “Malfoy.”\n“Merlin, Potter, do you never sleep?” Malfoy mumbled into his chest, not moving.\nHarry blinked. Smiled. “It’s a little hard when someone else is taking up three-quarters of the bed and using me as a cushion,” he whispered back.\nMalfoy woke up at that. He started to pull away, but Harry clamped a hard arm around his shoulders.\n“What are you doing?” Malfoy said suspiciously, blinking sleep from his eyes and trying to squirm away.\nHarry was fully aware of the hard press of Malfoy’s erection against his hip. He blushed a little but didn’t let go. “I want to try something.”\nMalfoy looked up at him with wide eyes, a pink stain spreading across his cheeks, lips parting in disbelief. “What?”\n“With your permission, I’d like to try to explore the link a little. I, I won’t do anything intrusive. Or, I’ll try not to. And, um, you can look too,” Harry offered quietly, when it seemed like Malfoy might say no. “I think it might work best when we don’t have a lot of distractions. When we’re close -- you know, physically -- like this.”\n“All right.”\n“Really?” Harry asked, surprised.\nMalfoy rolled his eyes. “Well, we’re not making much progress doing it in front of Highlash, are we? And we both want our magic to be our own again, right?” Harry nodded. Malfoy sniffed. “Then maybe exploring the combination of our cores will help us better understand them,” he said. “So all right.”\n“Okay. So, I’m not really sure what the best way to do it for you is,” Harry said. His cheeks grew hotter. “What I mean is, because we’re exploring different elements inside each other, it’ll probably be different for you. I just sort of… let my mind go unfocused and hazy, like my eyes when I’m looking for the Snitch, and let it wander into whatever feels… the most you, I guess. That’s what I did yesterday morning, anyway.”\nDutifully, Malfoy closed his eyes. Harry followed suit. A thousand impressions filled his mind at once: Malfoy pressed against him, warm and hard and angled; the smell of Malfoy's hair; the brightness of the sun beyond his eyelids. He let them all come, not picking one in particular, until he felt the cool ripple of water brush against his core. He followed the sensation.\nThe feathers were in flight again in his mind, leading him to the pool. It was bright and clear near the top, the water a shimmering sort of silver that made him think of Malfoy’s eyes, and Harry saw himself diving, stroking against his natural buoyancy to press into the depths. The deeper he got, the murkier and colder the water became. He looked around, feeling the lightness of his body that water created, but could also sense the rise and fall of his lungs. He shivered, wrapped in emotions so deep he wondered just how much of himself Malfoy kept hidden.\nHarry floated for a few minutes, letting the sensations slide around him. Like the previous morning, they were emotions, mostly, hiding in the tiny discrepancies of colour and changes in temperature the water brought. The murky brown-grey was something ugly and frightened. Harry shied away from that. Something dark blue slid against his cheek and, though it didn’t seem to have any overtly hostile overtones, Harry somehow knew instinctively that it was incredibly private. He felt another sweep of water, in shining lavender, against his torso, and without thinking, Harry plucked it up. It felt... innocent.\nIt was like a Pensieve, almost. As soon as he held the swirling liquid in his hand, images filled his mind. He saw Malfoy as a very young boy, maybe four or five. Malfoy's father, younger as well and without the supercilious gravitas Harry associated with him, was holding his hand as they walked through gardens populated with white peacocks and flowers the likes of which Harry had never seen before. As he watched, young Malfoy turned his pointed chin up to Lucius and said something that Harry couldn't hear. Lucius threw his head back on a laugh and swept young Malfoy up into his arms.\nHarry opened his hand and let the water escape, feeling sad.\nHe floated in place for a moment, feeling Malfoy investigate his own inner-workings, a twist inside that was simultaneously blissful and gnawing. At random, he grabbed another swash of water, coloured a pale blue-green. It felt vaguely sad, but also rather settled.\nHe was looking down at a letter.\n\n\n…so it is true, yes, that the Nott family has joined the list of Purebloods whose friends have been getting death threats simply for choosing not to cut off all contact. And yes, it is true as well that the Ministry is overlooking such behavior right now. But, darling boy, this is nothing that should concern you. I’m very glad that you have a friend in Harry who, while perhaps impulsive and poorly-raised in regard to his opinions on blood status, has never has been the sort to frighten easily. Besides which, it is very unlikely (not impossible, granted, but unlikely) that anyone would make an attempt on his life the likes of which happened to the Garnier’s for staying loyal to my acquaintance. \n\n\n\n\nPlease don't worry, Draco. Remember who Potter is and his special status at this current time. It will protect him from much, and by extension you. And please give him my regards as well.\n\n\n\n\n Love, \n\n\n\n\nMother\n\n\nHarry saw a splash of something wet against the parchment. He released the memory, stunned and not a little sad at the mutual deception Malfoy and his mum were engaged in. Then a deep inner-jolt pulled him from his thoughts and he spared a moment to wonder what the hell Malfoy was doing.\nHarry looked around at the water, beautiful, mysterious, and painful with every ebb and flow. He swam deeper until the colours were swalllowed in darkness. Beyond him, there was an orange-gold light and he pursued it, pushing against the stubborn resistance of the tide that was keeping him away.\nAt length, he reached his goal: a strong, pulsing a pillar of light. He blinked against the shine of it and approached cautiously, surveying that it wasn’t alone — it was wrapped around something silky and pale, or perhaps melted together with it. It was breathtaking.\nHarry’s eyes snapped open. His breath came in short, sharp pants. He paused a moment to steady himself and take stock.\nHe was hard and aching, his whole body warmed by the experience and by the pressure of Malfoy against him, who was breathing steadily, as if in a trance. Harry blew out a long breath, heart racing; he was fairly certain he had just seen the place where the cores of their magic were linked.\nAfter a few minutes, he felt Malfoy come back into himself, stirring against him languidly.\n“Malfoy?”\n“Yes.”\n“Were you able to…”\n“Yes.”\n“What’s it like? I mean, mine?” Harry asked hesitantly.\n“It’s like a cave, with dark earth and growing things, and so many trees,” Malfoy said quietly after a moment. “Deep in it, there’s a fire that grew, the closer I got. It was hot, but didn't burn when I touched it.”\n“Yours is like swimming in a pond in the sky,” Harry said. It wasn’t the most accurate description but he had no access to words that would fit.\nMalfoy lifted his head. “Potter—“\nHarry kissed him.\nLater, he wouldn’t be able to decide if he had planned it, or if it had been an impulse based on seeing inside Malfoy and hearing a new tone in his voice that was deep and low and arousing. But as he fit his mouth against Malfoy’s, he had the fleeting thought that he had been waiting for this for much longer than the last several minutes.\nMalfoy made a small noise in the back of his throat and stilled at the contact of Harry’s lips against his own. Harry increased the pressure, just slightly, keeping the kiss soft and questing. Malfoy responded, his lips moving gently, opening when Harry slid his tongue against the seam of them. Harry’s tongue slid inside Malfoy’s mouth and he jerked at the hot slip of Malfoy's tongue touching it. \nMalfoy made another little noise. He rolled them over so he was on top of Harry, legs spread in a straddle over Harry's hips. Harry gripped them, gasping at drape of Malfoy’s slender body over his own as the kiss continued, still gentle, still heartbreakingly sweet. A long, long, time they kissed, and Harry lost himself in it, lost himself in the feel of Malfoy, the taste of him, the tentative wonder of something fitting.\nHe could feel Malfoy’s cock, rubbing against his own with excruciating slowness. He rolled his hips upward in response and was rewarded when Malfoy groaned. Malfoy wrenched his mouth away. He sat up, breathing raggedly, lips swollen and slick, and stared down in astonishment and more than a little anger.\n“What? What did you see?”\nStartled, Harry’s fingers flexed on Malfoy’s hips. “I— I saw a memory of you walking with your father when you were little. I saw you reading a letter. What did you see?”\nSomething in Malfoy’s face relaxed. “Why did you kiss me?”\nHarry shook his head in confusion. “I wanted to.”\nMalfoy gave a laugh like cut glass. “You stupid Gryffindor. You’ll never have any sense, will you?”\nOffended, Harry started to push Malfoy off, but was halted by Malfoy’s hands, batting his away. Malfoy swooped back down, kissing Harry roughly this time. Their teeth clashed and he nipped Harry’s bottom lip just a little too hard before pulling away to rest his forehead against Harry’s with a ragged breath, their gazes locking.\n“This is an incredibly bad idea, you know,” he said in a low growl.\nHarry grinned recklessly and licked his lower lip, tasting copper. “I’m sort of known for them. I’m also known for not caring.”\nMalfoy chuckled, then trapped Harry’s wrists in his hands, pressing them tight against the mattress. Arousal thudded through Harry’s body and he arched up. “What do you want, Malfoy?”\nMalfoy grinned. He pressed an open-mouthed kiss against Harry’s neck, scraping the skin lightly with his teeth, and Harry groaned. “A lot. But as much as I enjoy seeing you pinned beneath me, we have to go. We have to talk to Highlash.”\nDisappointment flooded through Harry as Malfoy climbed off him but he nodded gamely, trying to catch his breath. “Okay. But I don’t think there’s a shower cold enough to compensate,” he grumbled, pleased when Malfoy laughed again.\n“You won’t need it.”\nThey each used the facilities, and it was at once more and less awkward than each time before. As Malfoy began the shower, Harry spared a brief moment to wonder at the massive shift in Malfoy’s, behavior -- whether it was brought on by the link, by Harry’s kiss, or by Malfoy himself.\nThey stepped in and oh, sweet Merlin, the water was blessedly hot. Harry stood back, preparing to let Malfoy to take the lead in washing as per usual, when Malfoy gripped him by the waist and pressed him up against the tile wall. Wicked grey eyes met Harry’s, and then he was being snogged senseless.\nHarry kissed him back, rubbing his tongue against Malfoy’s, gasping as a warm, slick hand trailed down his hips and brushed against his cock. He pushed blindly into the feeling and heard a delighted snicker in return just before Malfoy’s fist wrapped around him. “\nOh, my god,” Harry mumbled. His head fell back against the wall as Malfoy began moving his hand up and down with tight, slow strokes. Harry thrust his hips into it, matching Malfoy's steady rhythm. He reached out instinctively, clasping one hand around Malfoy to grip the slope of his arse and tentatively sweeping his fingers over the head of Malfoy’s cock. He heard a soft hum of appreciation over the sound of the water.\nHarry looked down. Malfoy’s prick was long and hard and slender, rather like Malfoy himself, jutting out from a nest of curls just slightly more golden than the hair on his head. Harry brushed his fingers over the crown, sweeping a curious thumb over the slit, and felt slick moisture leaking there. Malfoy groaned into his ear.\nHarry tried to distract himself from the rather exquisite sensations Malfoy was creating on his cock by experimenting. He wrapped his own fist around Malfoy, leaving his thumb loose so he could stroke the head with on each down stroke, the way he liked doing to himself when he wanked. Malfoy hissed softly through his teeth and Harry loosened his hand.\n“Did I hurt you?”\n“No. Fuck. Do that again,” Malfoy ordered. His hand moved faster and Harry groaned before grasping him again. They set a steady pace, each matching the other’s movements, and suddenly Harry could feel his balls tighten, could feel the rush of pleasure gather at the base of his spine.\n“Malfoy,” he gasped, but that felt weird, felt wrong, when everything else felt so good. “Draco. I’m going to—“\n“Come, Harry,” Malfoy demanded, clenching his fist and picking up speed.\nHelplessly, Harry did, finishing over Malfoy’s knuckles with long, sticky ropes. He panted as the orgasm washed through him, his fingers slacking for a moment before resuming their task with renewed dedication.\nMalfoy leaned against him, pressing Harry hard into the tiles, clutching at his waist and shoulder and shuddering hard breaths into his ear. Harry let go of Malfoy’s backside and reached between his legs, grasping his balls and giving them a gentle tug. Malfoy moaned, low and strained, and came, bucking into Harry’s moving hand.\nThey rested like that for several long, lovely moments. Harry could feel his heart pounding in his wrists, his groin, his chest and throat. The link felt set aflame between them and Harry felt that same gorgeous glow that he had sensed from Malfoy the previous morning.\nFinally, Malfoy lifted his head. Harry smiled, a little uncertainly, pleased when Malfoy’s lips quirked up in response.\n“Fascinating!” Professor Highlash said, looking at them with wide eyes. “You were able to access each other’s memories? Can you validate that they were real?”\n“Well, er, I assumed so, Sir,” Harry said, licking his lips and trying not to look over at Malfoy for fear of giving himself away by blushing. They sat propped against a long desk, the length of Malfoy’s body pressed to his side. “I, um, saw Malfoy walking in a kind of garden when he was little with his father and he said something that made him laugh. His father picked him up, then. There were peacocks there.”\n“That sounds like our country estate,” Malfoy said, nodding “Potter’s never been there. I don’t have a specific reference for that memory, but my father and I often walked through the gardens when I was small.”\n“And you, Mr. Malfoy?”\nFor the first time, Malfoy hesitated. Harry cast him a sidelong glance, curious, and Malfoy bit his lip. “I saw him on his first day at Hogwarts, with the Sorting Hat. He, ah, was almost Sorted into Slytherin.”\nAstonished for a multitude of reasons, Harry nodded dumbly. “You could hear it?”\n“Yes.”\n“I couldn’t hear anything. I only got visuals,” Harry said. He wondered if his near-Sorting into Slytherin might be one of the reasons for Malfoy’s sudden change from cruelty and reticence to the combination of lust and clumsy affection he'd displayed that morning.\n“That’s interesting,” Professor Highlash interjected. “While both senses are important, sight is the most necessary when casting magic. Mr. Malfoy, how much could you see?”\n“A little, here and there. Like bursts of image, just enough that I understood what I was seeing.” He paused. “But, that’s actually what I wanted to ask you about, Professor. Potter’s magic is… It’s very powerful.”\n“Well, one would assume so,” Highlash agreed mildly, glancing at Harry. “The Boy Who Lived Twice…”\nHarry winced. Malfoy shook his head. “No. I mean, he can do wandless, wordless spells. Occasionally accidental, but also intentionally.”  Highlash looked to Harry for confirmation and Harry nodded, confused. Malfoy continued, “And, when I was exploring his core… The fire I mentioned. It was strong. I haven’t felt anything like it before.”\nThe professor stroked his beard thoughtfully. “How would you describe his, Mr. Potter?”\n“I… I don’t know. There’s power there, a deep well of it. But it’s also very calm in places. I think he may have more control than I do,” Harry admitted, a little grudgingly.\nMalfoy scoffed beside him as if to say obviously, and Harry gave a nudge with his shoulder.\n“Well. I appreciate that you two were able to get so well in tune with one another,” Highlash said. Malfoy’s scoff became a snort. Harry’s lips twitched. “So, it seems as though we may have a power-imbalance. One of you has a lot of raw energy, the other, control.” Harry opened his mouth to object that he had control as well, but Highlash anticipated it and waved a vague hand. “That’s not to say that either one of you is magically weak or cannot properly reign in your abilities, but it is something to consider when it comes to untangling that your cores. Have you worked on spells together?”\nHarry and Malfoy exchanged a swift look. The little practice they'd done hadn’t gone well.\n“Not a lot,” Malfoy said. “We’ve been working on getting to know each other, like you told us.”\nThis time it was Harry who snorted. He saw the flicker of a smile around Malfoy’s mouth.\n“That’s quite good,” Highlash said. “As I’ve stated, you two are a perfect pairing of elements. I’d be surprised if you were unable to connect. The elements you draw your magic from indicate who you are, and each of these characteristics can be applied to your personalities as well. For example, Earth, Mr. Potter, indicates that you are strong, that you care for those around you, and that you endure. And the element of Fire in your personality and magic is purifying -- it can create or destroy and speaks of a strong will and courage — no surprise there. Air, Mr. Malfoy, indicates that your primary use of magic is through intellect and creativity. The water indicates extreme adaptability to any circumstance.\n“Each of these characteristics are needed in the use of magic,” Highlash continued. “The complication, I suspect, is that you each rely on your primary elements while overlooking your ability to draw from the others. This is what we’re going to do today.”\nHe began them on tandem casting, working on creating water. Over and over, they recreated the spell until they were each able to produce a gush of water from their wands, while pulling power from the other.  It was a strange feeling; Harry was so accustomed to using his own magic that it felt like trying to produce from nothing until he could focus on that pinpoint breeze inside of Malfoy. In turn, however, whenever Malfoy pulled from him, Harry could feel it hold tight in an attempt to stay. It verged on painful, but he tried to relax, to let it happen.\nThey moved on to trying to cast for each other’s wand. Almost immediately, Malfoy got water to stream from Harry’s wand while Harry held it. Harry, however, was unable to stop the spray of liquid from Malfoy's wand when they tried in reverse, until the water had overflowed in the glass and spread over the whole table, repeatedly.\n“Very good work, Gentlemen!” Highlash said near lunchtime. Harry gave a sigh of relief, glancing over at Malfoy, who was sweaty and tousled and paler than normal. He wondered if he looked just as bad; as simple as the spell was, borrowing from someone else’s core — and allowing them to borrow from yours — was exhausting.  “Please continue your private meditative explorations. Mr. Potter, I want you to be able to fill the water to the top of the glass without spilling any. We’ll meet again tomorrow.”\nHarry and Malfoy trudged out, heading to the Dining Hall. Once they were out of sight, Malfoy stopped and sagged against the wall. “I just need a minute.”\nHarry looked at him in concern. Students milled around them, glancing in their general direction, but Harry ignored their presence. He leaned his mouth close to Malfoy’s ear. “Are you okay?”\nMalfoy nudged him back, glancing around surreptitiously. “I’m fine,” he muttered. “I think you’re used to using more magic than necessary for even the simplest of spells, that’s all.”\nHarry examined him. Malfoy looked more drained than Harry felt -- which was saying something.\n“Come on,” Harry said. “We missed breakfast; you’ll feel better when you’ve had something to eat.”\nMalfoy wearily shoved away from the wall and they continued to the Dining Hall. Harry walked over to the Slytherin table without waiting to have a debate about it. Malfoy’s pale eyebrows climbed up his forehead but he sat down next to Harry without comment.\nParkinson stared at them a moment. “All right, Draco?”\nMalfoy shrugged. “It’ll be over soon. It’s a bit exhausting having to work with someone as thick as Potter, day in and day out.”\nStung, Harry gritted his teeth, but saw a faint smile play with the edges of Malfoy’s lips. He smirked. “Not as exhausting as it is sharing a bed with someone who likes to cuddle.”\nMalfoy’s head snapped up, cheeks blazing, but his retort was cut off by Parkinson and Zabini, who positively howled with laughter.\n“Oh, Potter!” Parkinson hooted, dabbing at her eyes. “Sometimes I actually think you’re not half bad. Maybe we’ll consider keeping you.”\n“We nearly did,” Malfoy said, narrowing his eyes at Harry. “Did you know he was almost Sorted into Slytherin?”\nZabini looked at Harry appraisingly. “Really? The Golden Boy was almost a Serpent?”\nIt wasn’t something he talked about but it wasn’t a secret either and his fears about being the Heir of Slytherin were long over. Harry grinned and nodded, swallowing a mouthful of food. “You say that like not everyone knows I’m a Parselmouth. Was. Am. Whatever.”\n“I really do like you more and more,” Parkinson murmured, keeping a keen watch on Draco, who was deliberately paying more attention to his food than the three of them. She smirked. “So, the bed-sharing is going all right, then? Can we come visit tonight?”\n“Except for that he steals all of the covers, snores like a three-headed dog, and the whole situation is appalling in general, it’s fine,” Draco muttered with a scowl. “And no. You can’t.”\n“Don’t want to share him?” Zabini sent a knowing wink in Harry’s direction. Harry rolled his eyes, tamping down on the urge to blush when Malfoy didn’t say anything.\n“We have to work on an assignment Highlash gave us,” Harry said. “Besides, we haven’t done some of our other homework in days. I thought having fewer classes would mean less homework overall, but…”\nParkinson nodded emphatically, her sleek, dark bob bouncing around her face. “Isn’t it just awful? I know N.E.W.T.’s require a lot of work, but this is mad. I think I’d prefer more class time, honestly. My nails are starting to suffer from neglect.” She held out the forefinger of one hand which, as far as Harry could tell, looked perfect, painted a shiny green.\nAs Parkinson and Zabini launched into a discussion on advanced level courses and the requirements for different subjects, Malfoy shot Harry a grateful look. Harry pressed his pinky against the side of Malfoy’s hand. Malfoy tensed and moved his hand away immediately but underneath the table, Harry felt a single comforting stroke of Malfoy's foot against the back of his calf. Deliberately, Harry nudged the link between them and opened up his side of it, trying to let Malfoy know that it was okay, that if he wasn’t ready to tell, Harry wouldn’t either. He tried to explain without words that he had hopes for later, that the link itself wasn’t so bad, and that neither were Malfoy’s friends. Everything that he didn’t have words for, Harry shoved into the link, splaying his emotions open as wide as he thought necessary.\nHe was wondering if it had worked when Malfoy gave a tiny sound in the back of his throat. A sudden wave of lust hit Harry in the gut. His prick hardened painfully,and he realized that Malfoy had opened up his emotions as well. Harry looked down at his plate, and began eating faster.\n***\nThey barely made it back to their quarters.\nWhen they finished eating, Harry swung with Malfoy over to the Gryffindor table to pass Ron and Hermione. Barely breaking stride, he said, “I’ll talk to you guys later, have to study,” and didn’t slow, though he saw Hermione’s eyes flicker rapidly between he and Malfoy, and Ron had opened his mouth to respond.\nWalking along the corridors, they kept the link open between them, something it was becoming easier and easier to do. Harry was flooded with the warmth of Malfoy’s magic, and with it came a primal need that had them walking in quick-step back to their rooms.\nAs soon as the door shut behind them, Harry swung around and shoved Malfoy up against it. He pinned Malfoy’s wrists against the heavy stone and slammed a kiss down on his mouth. Malfoy’s lips opened and he arched his body into Harry’s as Harry shoved his tongue inside. He felt the vibration of Malfoy’s moan more than he heard it and everything inside him shuddered with want.\nMalfoy wrenched his wrists and mouth away from Harry, grasping a handful of Harry’s robes in one fist and marching him backwards toward the sofa, where Harry toppled backward over the arm. Malfoy fell with him, their bodies in close contact, his mouth scraping over the tendons in Harry’s neck before latching on and sucking. Harry groaned, fumbling with the fastenings of Malfoy’s robes and shirt, shoving them haphazardly off his shoulders.\nMalfoy pulled his mouth away. He sat astride Harry to struggle out of his shirt. Harry stared at his rough, frustrated movements, at the pale expanse of skin being exposed. Even that morning in the shower, Harry had felt too astonished by what was happening to properly look at Malfoy disrobing -- which he regretted immediately because it was a fantastic sight.\nMalfoy was slender, his limbs long and pale and loose. Though he looked skinny with his robes on, without them, he was actually covered in fine layers of sleek, althetic muscle. His skin practically glowed, so pale, the complex web of scars over his chest drew Harry's gaze, competing for Harry's attention against the dark blur of his Mark on the inside of his forearm. Harry felt Malfoy freeze on top of him as he gave it a cursory glance before reaching up with lingering fingertips to trace the lines of scar tissue.\nMalfoy let out a breath and shook his head, platinum hair flying about his face. He started working on his belt. “None of that, now.”\nHarry obediently removed his hands and started tugging off his own clothing. “What do we…?”\n“I don’t know, Potter, you’re the one who started manhandling me,” Malfoy said with a wicked grin. Harry laughed.\nHe bucked his hips up, taking a glance at the tenting of Malfoy’s trousers and licking his lips. “That’s a lie, and you know it. You started this at lunch.”\n“Maybe,” Malfoy conceded with a small smile, climbing off Harry to toe off his shoes and socks, and step out of his trousers and pants. “I just didn’t think it would be so successful.”\n“Well, it was.” Harry’s mouth grew drier as even more of Malfoy was exposed. His cock was impressively stiff, and deep red at the head. Harry kicked off his trainers and socks and clumsily wiggled out of his own trousers and pants from his position on the sofa while Malfoy waited impatiently.\nWhen Harry was naked, time seemed to slow down. Malfoy stared down at him for such a long time that he grew self-conscious. He looked up into Malfoy's face, serious and shameless and, swallowing, took his own cock in his hand and gave it a slow stroke. Malfoy’s pupils dilated and Harry did it again.\nSuddenly, Malfoy was back on top of him, rubbing the length of his body against Harry’s. Harry choked at the sensation, everything coiling blurry and bright around him. Their cores pulsed together in time with their heartbeats, in time with the delicious throb of their cocks, as he rutted up against Malfoy.\nMalfoy kissed him, licking breathlessly into Harry’s mouth. He reached down to take both of their cocks in one hand, starting a maddening friction with each pull and twist. Harry looked down to their cocks trapped together, pressed together, in Malfoy’s tight grip. He’d never felt anything like it, seen anything so arousing in his life. He moaned out a cracked, \"Accio lube,” praying that Malfoy had thought to bring some. When nothing arrived, Malfoy huffed a tense laugh at him and released them both.\nA stifled sound broke free from Harry's throat at the loss of contact. But then Malfoy squirmed down the length of his body and, without warning, took the full length of Harry’s cock in his mouth. Harry heard himself whimper, his hand falling automatically into the shiny strands of Malfoy’s hair. Malfoy’s mouth was hot and silky around Harry's cock and he sucked in long, slow strokes, hollowing out his cheeks and swiping his tongue over the head at regular intervals. Harry thrust his hips to get deeper and Malfoy obliged, pulling Harry so far into his mouth that Harry could feel the tip of his pointy nose buried in the curls at his groin.\n“Oh, God,” Harry whispered. “Draco, I’m going to come.”\nDraco — for he could never be just ‘Malfoy’ again, Harry acknowledged with what little blood was left in his brain — answered by bobbing his head faster, sucking harder. A stray hand slid along the crevice of Harry’s buttocks and one, long finger burrowed in between them. At the shocking pleasure of a finger stroking his arse, Harry fucked up hard, his orgasm hitting him like the detonation of a bomb.\nDraco gentled the movements of his mouth. He swallowed convulsively, swirling his tongue softly around the head of Harry’s prick until it became too sensitive and Harry had to pull lightly on the hair he was still gripping. Draco released him, his mouth shining and swollen and pink, and finally looked up at Harry with an almost tentative expression. Harry smiled, heart still pounding, and was rewarded with a flash of white, even teeth and a little chuckle.\n“I want to— Can I do that to you?” Harry blurted.  Draco blinked a couple of times and nodded wordlessly.\nDraco climbed off of him and Harry stood, guiding Draco nto a sitting position — the sofa was too small, and Harry wasn’t sure how Draco had managed to do… to do that from the position he’d been in. Harry grabbed a pillow and dropped it onto the floor in front of Draco, kneeling on it carefully. He took a deep breath, placing a careful hand on one of Draco’s thighs.\nHarry reach out and grasped the base of Draco's prick. He looked up swiftly to see him chewing on his lower lip as he stared down at Harry’s hand, and Harry slid Draco's foreskin back with one long, tight stroke before dipping his head. Draco’s cock twitched against Harry’s closed lips and Harry darted out a tentative tongue taste him. The gleam of moisture seeping from the slit was warm and salty-bitter and Draco shifted his hips restlessly, placing a hand on Harry’s shoulder.\nHarry took a deep breath and opened mouth, sliding his lips around Draco’s shaft, swirling his tongue around the head as Draco had done as he took more of him in. Draco shuddered, his hand tightening reflexively on Harry’s shoulder. Encouraged, Harry sucked lightly, bobbing his head up and down over the hot, twitching length in his mouth. He experimented by pumping the hand still circling the base of Draco’s prick in time with his movements. After a minute, he pulled away breathlessly.\n“Am I—is that--?” Harry stuttered.\nDraco looked down at him with heavy-lidded, stormy eyes, and suddenly Harry felt a surge of pleasure flow through their link, approval laced with rich want. He lowered his head again, taking Draco in deeper than he had before, enjoying the heavy weight of Draco’s cock on his tongue in a deep, visceral way he hadn’t expected. He moved up and down swiftly, breathing through his nose. When his jaw began to ache, pulled off to begin sucking and licking at the underside of Draco’s erection. Draco gasped.\n“Harry,” he muttered, voice raw. Harry sucked harder, allowing the noises Draco made to lead him in his movements. After several long moments, Draco’s body tightened and he pressed up, gripping Harry’s shoulder with desperate fingers. Harry took his cock in his mouth again just as it began pulsing. Draco cried out and came, shooting salty ribbons against the back of Harry’s throat, and Harry worked to sswallow them all. He took a page from Draco’s book and slowed his motions but didn’t pull off completely until the hand at his shoulder went lax and Draco’s body settled back into the cushions, replete.\nHe climbed back onto the couch, settling himself next to Draco, whose eyes had closed. He put his head back and closed his own eyes.\n“I liked this,” he murmured. He heard a snort.\n“I’d be surprised if you didn’t. It was a blow-job. No one doesn’t like a blow-job.”\nHarry frowned to himself. “I liked it with you,” he tried again.\n“Of course you did. I’m very good at then.”\n“Yeah, you are.” Harry opened one eye and trained it on Draco. “Where did you practice?”\n“Jealous, Potter?” Draco said with a half-hearted sneer. He didn’t bother lifting his head.\n“I was Harry a minute ago,” Harry said.\n“You had my cock in your mouth,” Draco pointed out.\nExasperated, Harry drew a hand through his hair. It was no doubt standing up in every direction, but he couldn’t bring himself to care. “I just mean, I thought — you know, we’re getting to know each other and maybe like each other… I mean, I like you,” Harry said, stumbling over the words. “Now, I do. And I was mostly just wondering.”\nFinally, Draco opened his eyes, his gaze disturbingly gentle. “Wanting each other and liking each other doesn’t have to be synonymous, Harry.”\nHarry felt deflated. “Then what is this?”\n“Fucking,” Draco said succinctly. “Excellently, of course, the way I do everything.”\n“And… that’s what you want?” Harry asked. Draco sighed.\n“I want a lot of things. But, in regards to this… I’d just like to keep doing this while we can, all right? We have a couple of more days. No need to get all Hufflepuff about it and start talking about our feelings. We can enjoy this for as long as we have it, if you can manage a little discretion.”\nHarry thought suddenly about the Greengrass girl, about all of the expectations set upon Draco that he seemed so determined to live up to. Something else they had in common, he supposed. Though he’d never been inclined to discuss his feelings at length, not even with Ron and Hermione, Harry inexplicably wanted to now — wanted to tell Draco how he’d felt about Ginny and how that didn’t compare to this. He wanted to say that everything he’d seen inside Draco had helped him understand him better and had made him like Draco more and more. He wanted to ask if Draco could wait until things fell apart before closing the door on the possibility of more.\nInstead, he reached out and laced his fingers through Draco’s. He was surprised to feel an answering squeeze.\n“Let’s go practice, then,” he said quietly. Draco shot him a suspicious look through long, golden lashes.\n“Practice what?”\nHarry grinned. “Everything. All of it.”\n***\n\nDraco stands beside the cold, imposing figure of his father. He is supposed to walk forward now. He's supposed to do his duty and kneel in front of the Dark Lord, to take his Mark, but his knees are trembling too hard and his feet won’t obey him. \n\n\nThe deformed figure in front of him raises a waiting hand and his father nudges him roughly in the shoulder. Feet dragging, he marches forward and gets on his knees. \n\n\nThe Dark Lord sweeps his wand negligently over Draco’s sleeve and it tears cleanly up his forearm. He shudders, holding himself perfectly still, as icy fingers take his wrist in hand, turning his arm over to expose it. He feels like a rabbit in the jaws of a wolf. He breathes deep and tries to think himself away, anywhere, and suddenly sees a flash of green eyes in his mind. He wonders what he’ll do if he’s ordered to kill anyone.\n\n Anything, he thinks. Anything to protect Mother.\nHarry woke up with a start, heart beating fast. His stomach churned and his arms automatically closed around Draco, who was lying tight against him, eyelids fluttering, forehead wrinkled in distress. Unless he was mistaken, Harry felt certain he’d just been inside of Draco’s dream.\nHe thought about how rarely his dreams featured Voldemort anymore and felt a fiercd sweep of protective sadness at the thought of Draco being forced to make such choices to keep his mother alive. He wondered what he would have done, if he’d been allowed to protect his own.\n“Draco, wake up,” Harry whispered, pressing a nipping kiss against his ear. Draco mumbled something and didn’t wake, but the tension in his body eased and his mouth lost its tightness, curling into the vague shape of a smile.\nHarry kissed him again and this time Draco did wake up, blinking sleepy eyes up at him. Harry pressed a soft kiss against his mouth, opening up the link, flooding it with the way he trembled inside and Draco stroked his back with light hands, returning a feeling of permission and something that felt like relief.\nHarry scooted down in the bed. They had done this several times the previous night, but it felt new every time: touching and being touched, the slippery heat of Draco’s mouth, the salty taste of his come when Harry returned the favor, the feeling of hands that weren’t his own clutching at him, fumbling with excitement.\nThey had missed dinner downstairs, opting to lounge around in their quarters completely starkers — apparently once Draco was comfortable being naked, it was impossible to get him dressed again — so Harry had called for Kreacher, who was working in the kitchens while Harry finished school, and Kreacher had brought them sustenance while they practiced meditation, casting, and other things.\nThe casting had proceeded quite well. Both of them were able to use the other’s magic to cast at this point, though it still caused a grating sort of itch in Harry and seemed to take much more out of Draco. But Harry had been more interested in the deeper intimacy formed when they worked on meditating through their link, sharing the sort of secrets they had never spoken of to anyone else.\nHarry had allowed Draco complete access, even when he could sense he was delving into something private, but had strayed away from memories he’d felt Draco wouldn’t want him to see. Each time they looked into each other, the link had widened and flared, becoming stronger. Harry could sense Draco’s emotions almost effortlessly now, unless Draco purposely closed off his side of internal communication.\nNow he sat and nestled his nose into the hair at Draco’s groin, inhaling the musky scent there and nuzzling the underside of Draco cock. Draco hummed appreciatively, his fingers dipping into Harry’s hair, and Harry took his burgeoning erection in his mouth, sucking hard.\nDraco gave a sharp, “Ah!” and arched off the bed in surprise. Harry smiled around his cock and moved his head lower, mouthing his balls with a questing tongue and gentle lips, sucking softly. Draco opened his legs further and drew them up, resting the high arches of his feet on Harry’s shoulders.\nImpulsively, Harry continued lowering his head. Draco was splayed open in front of him and Harry studied his arse intently for a moment. The crevice of it offered a long swath of pink skin and a furrowed little hole that attracted his interest and he remembered the the sharp lust that flooded him every time Draco’s wet fingers trailed rings around him there.\nWithout letting himself think about it, Harry pressed his mouth against it, flicking his tongue out lightly. Draco made an incoherent sound, like wheezing and choking combined. Harry increased pressure, licking around the skin, then placing his lips over it and sucking gently. Draco arched again, jerking, and Harry clamped an arm across his hips to keep him in place. He continued sucking, relieved to taste nothing more offensive than the flavor of Draco’s coconut soap.\nHis confidence increasing at the rough, abandoned sounds he could hear above him, Harry swirled his tongue around the tight hole and, feeling it loosen, stabbed into it tentatively. He did it again when Draco whined, a little harder, then again and again.\n“Please, please,” Draco babbled breathlessly. Harry wondered vaguely what would happen if he added teeth to the mix, so he did, lightly scraping them over the wrinkled skin his tongue worked. Draco made a low, keening sound, his body strung tight like a bow, and Harry glanced up to see Draco's cock rising from his belly, throbbing and shooting spunk over Draco’s fluttering stomach. \n“Harry,” Draco breathed. Harry looked up, saw Draco’s astonished face, pupils blown so wide that his eyes looked black but for the faint silver rim around the edges. Harry crawled back up and kissed the corner of his mouth, smirking when Draco grimaced.\n“I’d prefer if you used a breath-freshening charm before you kiss me again,” he said snottily, as if Harry hadn’t just been able to make him come without touching his cock at all. Harry snorted, rubbing his erection over Draco’s slowly withering cock in silent entreaty.\n“Can I try something?”\n“You’re full of ideas this morning,” Draco grumbled, but there was a smile in his voice. Harry cast a quick, wandless charm to freshen his breath, and then kissed the other boy sloppily on the mouth. “What do you want to try? Because I’m probably not going to do that to you.”\n“Probably?” Harry raised an eyebrow.\nDraco’s lips quirked. “What do you want, Potter?”\n“Just hold still.” Harry reached out and swabbed a hand over the come still warm on Draco’s stomach. He smeared it over his own aching cock and settled his hips between Draco’s thighs. A mild sense of panic filled him, pushed through the link. Harry shook his head and said, “No, I wasn't going to-- Just…”\nHe slid his cock into the crevice of Draco’s arse, the slide Draco's come and his own saliva creating a lubricant that had his eyes rolling back in his head. Draco, catching on, clenched his buttocks as Harry thrust back and forth in slow strokes between them.\nHarry rutted against him for a few minutes as Draco work his hips upward in time with Harry’s thrusts, dizzily hearing Draco's soft, throaty encouragements. He rocked back and forth, pressing increasingly frantic kisses over Draco's neck and jaw, and began moving faster as he felt his balls tighten in response to the friction, his cock twitching and starting to spasm. Harry buried his face in Dracos throat and came hard, his vision turning gray at the edges, calling out Draco’s name in a voice he didn’t recognise.\nExhausted, he rested against Draco, He turned his head, cheek pressed against the elegant line of Draco's neck and felt the rapid tattoo of his heartbeat against it. He wandered his hands over the jut of Draco’s hipbones, the slender protrusion of his ribs. He sent a wave of satisfaction through the link and felt, rather than saw, Draco’s smile.\nThere was a sudden thunk behind him, followed by a squeak and a rather desolate sound of shock. Harry tugged up the bedsheets to cover them and rolled off Draco.\nRon and Hermione stood there. Ron’s face was washed of all color. His wand was out and his mouth hung open wordlessly. Hermione’s face, in contrast, was bright pink. She tugged on Ron’s arm.\n“I told you we should wait outside!” she hissed.\nRon found his voice. “I thought Malfoy was killing Harry! ...Why the fuck isn’t Malfoy killing Harry?”\nEmbarrassment crawled up Harry’s spine, but it shared space with a burning sort of amusement. He rolled his eyes toward Draco, who was frozen in place, grey eyes huge.\n“To be fair,” Harry pointed out practically, “I’m not indiscrete; they’re just nosy.”\nThat seemed to draw Draco out of his stunned state. He drew up the sheets haughtily and tucked them under his arms, glaring at Ron and Hermione.  “And I suppose you two don’t have sex?”\nIf possible, Hermione’s face reddened even further.\nRon blustered for a moment. “That’s none of your— That’s not even— That’s different!”\n“Because you’re a male and a female?” Malfoy said coolly.\n“Because we’re not Harry and Malfoy!” Ron roared. “Because we’re in love! What the fuck are you thinking, Harry?”\nHarry shrugged, rather enjoying himself. “Waste not, want not?”\nDraco snickered.\nRon looked to be working himself into another fit of yelling, but Hermione stayed him with a sharp hand. \n“Not now, Ron.” She looked at Harry and Draco seriously. “Honestly, Harry, we expect to hear about it later — probably best after Ron’s a bit legless from drink — but we came here because we needed to talk to you both. It’s fairly urgent. If you could, um, get, um, cleaned up and dressed? We’ll wait out there,” she said, jerking her head toward the other room. She tugged Ron out with her. He followed as though sleepwalking.\nFaintly, Harry heard Ron mumble, “It’s a damn good thing you can Obliviate me, ‘Mione.”\n***\nThe silence was thick. Draco sat next to Harry, one arm slung over the back of the loveseat. Harry took a little comfort in every shift of his arm. Ron and Hermione stood across from them.\n“So you’re telling me,” Harry said, “that there’s a potion that can resolve this?”\nHe had mixed feelings on the matter. On one hand, despite the progress he and Draco had made with spell casting, he wanted his magic to be his own again. He didn’t want to constantly have to make the effort to cast, to wonder if he was hurting Draco with every small spell, or to feel the resistant friction of Draco’s magic against his own. On the other hand, the link had given him a depth of insight into Draco that he never would have had otherwise and though Draco insisted that it was nothing but fucking between them, Harry knew himself well enough, at least, to understand that it was more than that.\n“Yes,” Hermione said emphatically. “But you’re not listening. If it was just that, we wouldn’t have… ah… interrupted you.”\n“We were finished,” Draco said with a cool raise of one eyebrow, forcing Harry to elbow him when he heard Ron make that distressed, wounded-Thestral noise again.\nHermione rolled her eyes but her face remained serious. “The problem is that you’ll almost certainly die if you don’t take it. You’ll both, at the very least, weaken exponentially each day you’ve gone without taking it after the original curse has broken. And the potion takes almost three days to brew!”\n“Well, we have just over two left,” Draco pointed out but Harry, having finally caught up with what Hermione was talking them, barely heard him.\nHe felt a rush of hot betrayal flood through him. After everything, how could McGonagall not tell him that his life was in danger— again? “Highlash specifically said that all we needed to do was work on our magic together and that the link would unravel as the curse did. He just told us we needed to stay magically strong, to explore the link—“\n“So I have Highlash to blame for this?” Ron muttered. “Great.”\n“Shut up, Ron,” Harry snapped so viciously that Ron's head snapped up. Ron stared at him with wide, hurt eyes and whatever Hermione had been about to say faded rather quickly. Harry could feel Draco’s confusion and concern nudge him through the link but he ignored it in favor of gripping Draco’s wrist and hauling him off the sofa. “Come on, we need to talk to McGonagall.”\nHe led the way, not releasing Draco’s wrist. Once they were out of the small stairway, Ron caught up with him, keeping in step.\n“I mean, you know, it’s a shock, is all,” he mumbled. “Not that you like blokes, it’s that you like that one.”  Harry gave him a hard glare, still walking fast, and Ron held up his hands defensively. “Not that it’s any of my business who you go with, right. But, I mean, think how you’d feel if you walked in on me and Hermione. And you actually like her…”\nDraco sighed next to him. He’d quit trying to pull his wrist from Harry’s grasp as they marched through the halls toward the Headmistresses office.\n“No need to worry, then, Weasel. He doesn’t like me that way. We were just… taking advantage of an unfortunate circumstance.”\n“You shut up, too,” Harry growled. Draco squawked with indignation and Harry sped up.\nWhen they got to McGonagall’s office, he spared grim thanks that his stupid special status meant that he was always allowed beyond her wards. He pulled Draco in with him and Ron and Hermione tumbled through the door soon after.\nMcGonagall was sitting at her desk, glasses perched low on the bridge of her nose as she worked over some parchment.\nShe looked up in surprise. “Potter! What in Godric’s name… Are you two all right?”\nHarry dropped Draco’s wrist. Draco rubbed it sullenly, shooting Harry a frown.\n“I want to know why you didn’t tell me we could die because of this or that there was a potion that could stop it,” Harry said in a hard voice he was aware of never having used with her before. “Why you would deliberately keep that information from us—from me! If nothing else, I’ve earned the right to be aware that I could die again.”\nProfessor McGonagall half-rose out of her chair, her mouth a little ‘o’ of surprise. “I would never— Potter, what are you talking about?”\nHarry scowled. “Hermione has been doing some research and found—“\n“Ah.” Steadier now, McGonagall’s gaze swerved to Hermione, who stood next on the other side of Harry, looking like she wanted the floor to swallow her. “And if you could explain in more detail, Ms. Granger?”\nHermione bit her lip. “It’s true.” She dug through the bag she was holding and brought out a thick book titled Magical Medical Mysteries and Anomalies of the 20th Century. She stepped forward to offer it to the headmistress. “Page 708.”\nMcGonagall opened the book and flipped through to the correct page. She was quiet for several minutes and Harry watched her narrowly as she read. He could feel Draco nudging him through the link insistently, but he shook his head.\nFinally, McGonagall looked up. She turned to a portrait on her left. “Ambrose, will you please contact the portraits on the east wing and let them know I’m in urgent need of Professor Highlash to join me in my office at once?”\nA wizard with a long, amber beard nodded once and disappeared from sight.\nMcGonagall sighed heavily. Her face was pursed into a strange expression of mingled regret and disapproval. “Potter, I assure you that I had no foreknowledge of the incumbent dangers that accompany the bond between you and Mr. Malfoy other than what could happen if the two of you were separated or chose to use magic against one another,” she said, her voice low. “While it was perhaps a mistake to trust in Professor Highlash’s intended course of action, I did receive owls from St. Mungo’s -- as well as from the Ministry -- which attested to his expertise on this matter.”\nHarry’s heart pounded fiercely. His throat constricted and he felt the sudden, awful urge to cry. He swallowed it back. “Professor—“\n“Furthermore, Potter, I’m surprised that you would ever think me capable of such a thing, particularly when it comes to your — or any student’s — safety,” she continued.\n“I’m sorry to say, I believe that’s my fault, Minerva,” came a quiet voice over her shoulder. Harry looked up.\nMcGonagall turned around. “Albus?”\n“Harry might feel a little… predisposed, shall we say, to jump to conclusions about his mentors’ ulterior motives in regards to his health and security,” Dumbledore explained from his portrait. His pale blue eyes were filled with regret and Harry felt a sting from the truth of his words. “And that, of course, is my doing. Although I have apologized for it sincerely and believe myself to be forgiven, such poor treatment from someone so trusted is bound to leave a lasting mark. I hope you will take that into consideration when pondering Harry’s outburst.”\n“I…I… Of course, Albus.” McGonagall looked confused.\n“Mr. Malfoy,” Dumbledore said out of nowhere. Draco, who had been standing rigidly still since Harry had begun yelling at the headmistress, jerked and looked around swiftly, as if searching for an escape.\n“Yes, Sir?” he said reluctantly./p&gt;\n\n“It’s good to see you again,” Dumbledore said. “You’re looking much… better.”\n“Thank you, Sir.”\n“I find time can do that, to a person,” Dumbledore continued, his voice taking on a bland, relaxed quality. “Time can do a lot of things.”\nHarry and Draco exchanged a swift look.\n“Yes, it can,” Harry said quietly. “I’m sorry, Professor. If I’d taken time to think about it, I would have known that you wouldn’t…”\nMcGonagall shook her head. “Yes, you would have,” she said severely. Her face softened. “But I suppose it can be excused. Although Professor Dumbledore and I will be having a talk about it, later.”\nDumbledore coughed behind her.\nHighlash bustled in and stopped, looking around at the group of people glaring in his direction. “I was told you needed me, Headmistress?”\n“Yes,” she said, her eyes narrowed. She stood with her spine ramrod straight, an imposing figure behind her massive desk. “I believe everyone here is wondering why you didn’t reveal that there was a simple potion solution to the binding of Mr. Potter and Mr. Malfoy’s magical cores? As well as why you didn’t bother to explain the severity of the consequences if they didn’t take this potion?”\nHighlash looked about wildly Harry felt a deep, gnawing anger streak through him but Draco gave another frantic nudge to the link and finally Harry opened up his side of it, relaxing at the reassurance that he was't alone. “I…I… I wasn’t aware of such a thing,” Highlash protested.\nMcGonagall picked up the book on her desk. “So I’m incorrect in saying that you wrote this?”\nHighlash’s face turned an interesting shade of red. “The ah, potion takes only three days to brew. I was on my way to speak with Professor Slughorn when I heard that you wanted to see me.”\n“Three days,” McGonagall repeated flatly. “And yet, they have two left. And I believe your book states that there could be lasting effects from the link if the potion isn’t taken within the first five days upon being cursed?”\nProfessor Highlash wilted. He looked at Harry earnestly and Harry felt a crawl of disgust.\n“You don’t understand,” Highlash breathed, eyes filled with a strange light. “What this could do for our knowledge of Core Magic. You two are a perfect case study. I only wanted to—“\n“A perfect what!” McGonagall cried out, startling all of them. “You’ve been using Malfoy and Potter for research?”\nHighlash continued to address Harry, speaking faster, his voice dropping to a whisper as though not everyone in the room could hear him. “You were never meant to be a part of it. And Draco Malfoy, he’s a Death E—“\nHarry Stunned Professor Highlash so quickly he didn’t have recollection of pulling his wand from his pocket. He automatically lent Draco’s power to his ownas he cast, his ears filled with such a roaring sound that he didn’t know if it came from the Stun blast or his own fury as the professor shot back with the force of his hex. Highlash slammed into the bookshelf against the far wall and thudded to the ground. Books toppled on top of him.\n“Potter!\" McGonagall shouted. “You will put away your wand at once!”\nGrudgingly, still glaring, he did. “He just admitted that he had something to do with Draco getting cursed,” Harry said, not feeling even a little bad.\n“Be that as it may,” Professor McGonagall said with clear exasperation. She pointed her wand at the now-inert form of Highlash and said, “Petrificus Totalus,” then turned back to them again. “I will be alerting the Aurors and will keep you informed of what we find out. I will also be speaking to Professor Slughorn. You two will have that potion as soon as it is fully brewed.\n“Ms. Granger, thank you for bringing this to everyone’s attention. Twenty points to Gryffindor. Mr. Malfoy, I appreciate you keeping a level head; twenty points to Slytherin as well. Now please, all of you — Mr. Weasley, have you been here this whole time? — leave my office at once,” she finished, her voice brooking no argument.\nThey filed out. Harry risked a quick glance back as he and Draco left and caught McGonagall staring down angrily at Highlash’s frozen body. When she glanced back up, Harry could have sworn she shot him a satisfied smirk.\nEveryone was talking over each other.\nAfter climbing back up to their rooms, Harry just wanted to sleep, but Ron and Hermione had trudged after them. After a few minutes of listening to them talk over each other, Draco had tugged on Harry’s sleeve and Harry’d turned to him questioningly.\n“Since it doesn’t look like we’re set to be alone for a while,” Draco said dryly, “would you mind sending a Patronus to Pansy to join us? It doesn’t seem hard for you and I haven’t been able to produce one.”\nSurprised not only by the request but also by the ease with which Draco admitted something he probably considered to be a weakness, Harry cast his Patronus quickly and they had been joined by Pansy, who huffed, \"Salazar's sake, I feel like my father when you call me Parkinson.\" She'd brought Blaise because \"it’d be fun,\" and, and Blaise leered and told Harry to call him whatever he wanted.\nNow everyone was arguing over what should be done about Highlash. Pansy was vying for a poisoned potion, Blaise thought Harry, Ron, and Hermione should use their status to get him sent straight to Azkaban for daring to secretly run tests on the Chosen One without permission, Hermione kept arguing that more research would help, Ron kept darting threatening glances at Draco — and no one would let them speak.\n“Oiy!” Harry finally yelled, fed up. “We’re here, you know!”\nMalfoy shook his head. “It’s no use, Potter. Pansy’s as bad as Granger when she gets on about something.”\n“No one is as bad as Granger,” Pansy said, offended.\n“I am not bad when I get on about something,” Hermione huffed. “I’m just… thorough. Which is a good thing, because it’s not as if your lot has been doing anything for the two of them!”\n“Our lot?” Blaise arched a dark eyebrow and flashed a sly sort of smile.\n“Well, you know… M— Draco’s friends,” Hermione said, flustered.\n“Well, we have so, as a matter of fact,” Pansy said, put out. “I was going to talk to him about it at dinner last night, but they didn’t show up. And then again at breakfast, when they didn’t show up. Speaking of which, why didn’t you show up?” she asked.\nRon coughed.\n“We were working,” Draco said. To his credit, he didn’t blush at all. Harry couldn’t claim the same, heat rising fast in his cheeks. He wondered how noticeable it was.\n“Mmmhmm.” Pansy glanced between them speculatively. “I see.”\n“Wait, what have you been doing?” Hermione asked curiously.\n“Research. I do know how, you know.”\nAt Hermione’s gaping expression, Malfoy grimaced. “It’s true. She’s top in our House in classes.”\n“Among other things,” Blaise said with a grin. Pansy elbowed him in the ribs.\n“Well, what did you find?” Hermione pressed.\n“A footnote in Blood Magic and Mystical Curses,” Pansy said, throwing herself down dramatically into the squashy chair to the side of the loveseat. “Horrible, dodgy old book written in the 1700’s. It was a nightmare to get through. It made reference to a case of Core connectivity, just mentioned in passing, but the footnote said that these types of curses tend to have lingering effects if they aren’t treated immediately.”\n“I found something like that, too,” Hermione said quietly, looking like she was trying not to be impressed. “From a different book.”\n“What kind of lingering effects?” Draco asked.\n“Yeah, what kind?” Ron said, with another suspicious glance at the two of them. Harry resisted the urge to put his arm around Draco just to shine him on.\n“Didn’t say,” Pansy said. She shrugged. “I was going to ask what Highlash said about it but I guess that Thestral has flown now, right?”\n“Right,” said Harry, depressed. Okay, so they probably weren’t going to die now that they knew they needed a potion. They had found out in proper time, after all. Buy the term lingering effects resonated through Harry’s head. Of course there would be lingering effects.\n“All right,” Draco said when the silence lasted more than a single second. “Despite Hogwarts having obviously not learned to do thorough mental background checks on its teachers yet, Highlash was right in that we need to maintain a strong connection to be able to untangle the link, yes?”\nHermione bit her lip. “Based on everything I’ve read, yes. The potion should do it for you, but each of you needs to be able to identify your Cores clearly to best be able to— to unwind them.”\n“Then you all need to get out,” Draco said flatly.\n“We could, help?” Hermione said. “Monitor? I’ve read it could be quite dangerous…”\n“It hasn’t been so far,” Harry said. Then, looking at Ron, “Malfoy and I do it best alone.”\nRon flushed, but there was an answering twitch around the corners of his mouth.\n“Really, Draco, I always knew you wanted to be alone with Potter but that’s just rude.” Pansy sniffed and picked her bookbag up from the floor.\n“It’s necessary,” Draco hissed. The sneaky smile slipped off Pansy's face. “It’s necessary for us to get out of this disgusting curse, so can you please just all bugger off now?”\nBlaise and Pansy exchanged glances and disappeared through the door.\n“I’ll keep looking,” Hermione promised. She tugged on Ron’s arm. “Come on, Ronald.”\nRon resisted. He stared at Harry and Draco and, after a beat, walked up to them. He addressed Harry. “I reckon if you like him enough to… To… Well, if you like him enough, there must be something likable to… like. And, I mean, I’d always support you, so—“ He thrust a hand out, almost hitting Draco in the nose with it. Draco cringed backward to avoid getting smacked and placed his own hand unenthusiastically in Ron’s grasp.\n“You don’t need to worry so much about it, Weasley. And definitely don’t bring it up with anyone else,” Draco said, disconcerted. “It’s not a lasting thing.”\n“Still.” Ron gave Draco’s hand three even shakes, then released it and wiped his palm against his pants.\nHermione was watching from the door, her face rather misty. “Oh, Ron,” Harry heard her say as they left together.\nThe door swung shut behind them and Harry sagged against the cushions. Draco swung himself up and over, straddling Harry’s lap, grinding his erection against Harry’s stomach. Harry drew back, startled. “What are you doing? How long have you had that?”\n“Since you Stunned Highlash,” Draco murmured against Harry’s jaw, catching Harry’s earlobe between his teeth. “I’ve always found these robes useful, haven’t you?”\n“Er, yes.”\nDraco caught his mouth in a hard kiss. Harry felt his own cock twitch and begin to lengthen, and he kissed Draco back. After a minute, he pulled away. “I actually was planning on sleeping a bit before lunch. We didn’t get much last night.” Desire pulsed at him through the link. “But, you know, that can probably wait.”\n“You,” Draco said succinctly, catching Harry’s eyes as he loosened his own tie, “are going to fuck me now.”\n“I— I am?”\n“You are.” Draco pulled away to lean over and drag a thin book from where it was buried deep in the cushions of the sofa. The cover had a man and a woman writhing on it. They kept changing positions. “I nicked this from Pansy’s bag. She always carries it with her.”\n“Why?” Harry asked, confused. It was a man and a woman, after all. Draco grimaced, staring down at the cover. As they watched, the man rolled so the woman was on top of him. He cupped his hands over her bare breasts.\n“She showed it to me fourth year. It was one of the first things that made me admit that I was… Well. But there’s an interesting incantation in it for lubricant -- I just couldn’t remember what it was.”\nDraco began flipping through the pages, his hips still doing filthy things on top of Harry as he casually perused the book. Harry fought to pay attention. He rolled his hips up, hissing at the friction.\n“Wait, that’s why you wanted her here?”\n“I always suspected you weren’t as thick as you looked.” He arched a wicked brow and snickered, pressing down against Harry’s swollen cock. “Well, as stupid. Here it is.”\n“Are you sure you want to do that? Just a couple of hours ago, you…”\n“I’m sure.” Draco pulled off his tie and began on the rest of his things. “I’ll let you do that thing with your tongue again.”\n“Let me.\" Harry snickered, fingers working fast over his own buttons. He removed his shirt and shoved Draco off of him to stand and pull off the rest of his clothes. Draco shimmied out of his pants as well and dragged him into the bedroom, pushing Harry onto the bed and climbing back on top of him. Harry groaned at the feel of Draco’s cock against his own, stuff and already damp at the tip. He grabbed a fistful of white-blond hair and dragged Draco’s face down for a kiss, pressing his tongue inside Draco's mouth, tasting the cinnamon of Draco’s preferred breath potion.\nDraco ground against him, fingers drifting lightly over Harry’s nipples. Harry felt a startling twinge in his cock at the sensation.\n“Roll over,” he muttered.\nDraco complied, letting Harry push him onto his back, and Harry scooted down the bed until he was at eye-level with Draco’s prick. Harry circled it with a light hand and gave it a gentle squeeze. Draco moaned above him. Keeping his hand where it was, Harry lowered his head further. Draco lifted his knees eagerly, reaching down to open his arse cheeks further and Harry huffed a laugh against the Draco's crease, nosing along it.\n“Let me,” he said again, pushing amusement across the link. Harry felt an answering blast of excitement that would have felled him if he'd not aready been laying down. Instead, he leaned in and pressed a strong lick over Draco’s arse, lapping at the hole firmly until Draco was writhing again, tiny squealing grunt issuing from his throat. Draco's hole softened under Harry's tongue, the muscles of his sphincter turning swollen and loose, and after a few minutes, Harry gave a soft nip to the crinkled flesh and lifted his head. “\nAre you sure…?” \nIn answer, Draco curled his fingers in Harry’s hair and yanked him up. He grabbed Harry’s hand and scrambled for his wand. Finding it, he dipped the tip of it into Harry’s palm and muttered an incantation. Slick oil filled Harry’s hand and he looked down at it nervously.\n“Erm, how do I… I mean, I’ve never… Have you?”\nDraco met his eyes. “No,” he admitted. “Not this. But… we’ll just keep the link open and you’ll know if anything goes wrong.”\nRelieved, Harry applied the oil to his fingers. He found Draco’s entrance and slipped a finger inside; Draco closed his eyes and pushed into the feeling. Harry tried another, which went in rather easily as well. Harry pumped his fingers for a few moments, mind focused on Draco's tightness, his heat, until Draco’s eyes fluttered open. “Do it.”\nTaking a deep breath, Harry coated his cock with the oil and settled between Draco’s thighs. He wasn’t sure why but when he’d thought about, it he’d always assumed one of them would have to be on their stomach and he decided he preferred this much better. He concentrated on the link as he lined himself up. Despite Draco’s desire and eagerness, he was nervous too and Harry could feel the deep amount of trust Draco had in him. He sent across his own nervousness, his own excitement, and felt Draco’s fingers grip his waist as he pushed inside, just a little. Draco squirmed under him, but Harry could feel through the link that it felt… good. A little strange and confusing, but definitely good.\nHarry worked his cock in slowly, stopping whenever Draco sent him a wave of discomfort until he felt the signal that it was okay again. And then there was nowhere to go; he was finally seated completely inside of him.\n“What now?” he whispered, holding still even as his cock throbbed dangerously.\nDraco’s brow was as slick with sweat as Harry’s. He nudged his arse up tentatively and Harry bit back a gasp. “Just move, I guess. However feels good.”\nHarry pulled out a little and then thrust back. “Oh, Jesus and Merlin,” he breathed.\nDraco’s arse was silky with oil and so tight around him he worried this would all be over before it really got started. He'd never imagined anything like it. He sent the feeling through the link and Draco’s body, which had tightened up at Harry’s thrust, relaxed a little. He began stroking his cock in and out of Draco carefully. Draco's knee slid up his waist and Harry caught it under his forearm, opening him up further.\n“Does it hurt?”\n“No,” Draco muttered raggedly, eyes screwed shut. “Feels good. Feels really good.”\nHarry took a moment to read the sensations Draco was sending across. Whenever Harry slid in and up, a wave of hot pleasure spiked through Draco. He adjusted his angle, rising higher on his knees, and started rocking steadily. Draco made a raw sound deep in his throat and Harry let the link subside, unable to focus on so many sensations at once. He mindlessly reached between them, finding Draco’s prick and gripping it tight as he pumped his hips to get deeper. He worked his fist in time over Draco and fucked him faster, Draco's fingers digging into Harrys ribs as he rocked up to meet his thrusts and then Draco cried out sharply. His body heaved and his cock began to spurt over Harry's fingers, covering them in wet, sticky streaks.\nAs Draco climaxed, his body tightened, slick inner muscles gripping Harry's cock with such intensity that he felt his balls draw up against his body, felt the orgasm rip its way down his spine to his aching prick. With his last coherent thought, Harry opened up the link so that Draco could feel what he felt as he came.\n I love you, he thought into the void of it, and finished.\n***\n“Why did you say you had died,” Draco wondered aloud, voice sex-drugged and sleepy. Draco head rested on Harry’s chest, his hand splayed across the flat of Harry’s abdomen while Harry played idly with his hair.\n“I did.”\n“No, you didn’t. My mother told me; you were alive in the forest,” Draco said, sounding marginally more awake.\nHarry gave a jaw-cracking yawn. “I came back. I was… I guess, given the option to? It’s hard to explain. But no, I died.”\nDraco looked up, eyes wide and startled. “How doesn’t everyone know about this?”\n“Well, it’s not as if I’m going to run to the Prophet about it, is it?” Harry said practically. “And everyone who was there knew I’d given myself up to Voldemort without fighting -- I announced that part in the middle of the Hall.”\n“But… So you actually died?” Draco asked in a strange voice.\nHarry rubbed a hand over his face uncomfortably, wondering where his glasses had got off to. He couldn’t remember having removed them. “Erm, yeah. Sort of.”\n“Do Granger and Weasley know?”\n“Of course.”\n“Of course,” Draco echoed. He was silent for such a long time, Harry thought he had dropped the subject, but eventually he said, “But they weren’t there with you.”\n“No.”\n“You were by yourself. My mother told me.”\n“Sort of,” Harry said again, awkwardly. “Yes.”\n“What do you mean, ‘sort of?’”\n“It’s hard to explain.”\nThere was another long silence. When Draco spoke again, it was with the tremble of hesitation in his voice. “Can I see?”\n“What?” Harry blurted, shocked.\n“Can you show me? I think if you focused on the memory, I could find it fairly easily.” Draco shrugged, almost nonchalantly, but there was a fine tremor of tension in his hands, which had folded to grip the sheet over them tightly.\nHarry thought about it. To give Draco this memory would be trusting him with more than aspects of himself, Harry knew; it would be giving him a working knowledge of dangerous things like Horcruxes and Hallows -- secrets that were never meant to be shared. It meant showing him Dumbledore’s betrayal, however imperative, and his own uncertainty over how he wanted to proceed at King’s Cross. It meant sharing fear and pain and hope and all of those matters that rarely got talked about, in a way that would give Draco a lot of ammunition if he ever chose to use it.\n“Yes, all right,” Harry whispered.\nThe thing of it was, he didn’t know if they could send actual focused thoughts — beyond sensations or emotions — through the link, but what he had tried to tell Draco had been real. It was fast, he knew, but he’d fallen in love in a way he hadn’t thought possible after the War, after Ginny, after so many years of terror and disappointment. That it was with someone Harry had once considered his enemy just seemed to make it more special. Draco hadn’t responded to his sentiments in one way or another, but that didn’t make them any less true.\n“Really?” Draco said sceptically.\n“You can’t tell anyone,” Harry warned. “Ever.”\n“No, I— I wouldn’t. I won’t,” Draco said, eyes wide.\n“Really, Draco.”\nDraco nodded somberly and Harry settled back onto the pillows with a heavy sigh. Draco put his head back down on Harry’s chest and Harry closed his eyes and thought of the Forbidden Forest, of Voldemort’s scarlet eyes, of that flash of green and the calm, misty train station. He deliberately thought of all of those things that he’d fought so hard not to think about for so many months and as he felt the pull of Draco wandering around inside of his magic and accessing everything that made Harry who he was, he finally allowed his mind to wander.\nHe found himself surrounded by feathers again and he sighed with the peaceful relief of it as he followed them to the pool. He looked down at it nervously. Unlike his previous visits, the water was turbulent and dark. Because of what Draco was experiencing through him? he wondered.\nHarry glided into the water and the waves eased at his presence. He ducked his head under the surface and began to swim. All of the memories that surrounded him, all the colours of the water, had gone murky and frightened. Harry took a deep breath and grabbed one in deep gray, closing his fingers around it.\nDraco was in Azkaban, huddled into the corner of a tiny stone cell with magic-repelling wards over the metal bars. There was a filthy basin in the corner next to an even filthier toilet. On the floor in front of him was the thin mat of a cot. Draco had taken the worn blanket and wrapped himself in it, shivering miserably. Harry looked around; the Dementors had been removed by Azkaban by Draco’s short stay, but Harry could still feel their influence seeping from the walls, the entire room sucking everything happy and hopeful out of him. Harry took another look at Draco, whose face had grown angular and sharp from lack of food and noticed he’d begun to weep silently, burying his face in his arms.\nHarry released the memory, breathing shallowly, in quick pants.\nHe plucked another at random, in a rather sickly green-yellow and was suddenly in Malfoy Manor, watching Draco stare at Harry’s own swollen, unrecognizable face with complete and total recognition. Draco shook his head, mouthing, “I don’t know,” silently, but in a voice that Harry would always be able to clearly recall, and rose to walk quickly away, turning his back to Memory-Harry. He and Ron were quickly dragged downstairs and Hermione was led to the middle of the room. Draco sat down heavily and tried to avoid looking at the scene in front of him, but Hermione’s writhing was so intense, her face so filled with torment that he palmed his wand in a hand slick with sweat and eyed Bellatrix with timid consideration. His mother rested a hand on his shoulder and, reminded of her precarious safety, the fear became too great. He slid his wand away, unseen. He swallowed hard around the lump growing in his throat as Hermione was cursed, as she screamed and screamed. Everything remained silent as Harry watched, but his mind furnished him with the sound of Hermione's anguish, something else he would never forget.\nHarry opened his hand and watched the memory swim away, much to his relief. He grabbed another, and another, and another, filling in the blanks for Draco’s sixth and seventh years. He saw Draco watch him with utter relief, a loosening in his chest as Voldemort fell in the Great Hall, saw him unable to Crucio hostages at Malfoy Manor until he had been given proper incentive by Bellatrix using him as an example over and over. Harry saw him bring extra food to Luna in the dungeon, felt Draco's strange shot of pride as Neville stood up to the Carrows for torturing a second year student, and saw Draco’s silent yell of “POTTER!” get lost amongst the screams of Harry’s friends as Hagrid carried Harry’s limp form back to the castle.\nHarry was so involved in the deepest, ugliest memories that Draco had that it was jarring to realise he was being shaken rather hard. “Harry—Harry!” he heard distantly and then, in a yell, “Potter, get the fuck out of my head!”\nHarry jerked back into himself, a scene of Draco burying his face in the back of Harry’s smoky shirt as they raced away from Fiendfyre dissolving rapidly. Draco was looking at him with irritation that Harry mollified by reaching up to press a soft kiss against his mouth.\n“Merlin, you’re thick,” Draco mumbled. “I was trying to pull you out of that for over a minute. Where were you?”\n“Sixth and seventh year,” Harry told him.\nDraco’s jaw tightened.  “And I suppose you needed to?”\n“I think about as much as you did,” Harry said. He paused. “Well?”\n“I couldn’t… It kept skipping around. I didn’t know.”\n“But now you see why,” Harry said.\n“Now I see why,” Malfoy confirmed, biting his lip. “I really won’t tell.”\n“I know,” Harry said, looking steadily into Draco’s glassy eyes, which. He pushed his knowledge through the link and, for emphasis, said, “I trust you.”\n***\nThey spent the weekend in bed, wrapped around each other, alternately fucking and meditating. Draco seemed almost afraid to leave their rooms whenever Harry suggested it, so they didn’t. Harry sent a Patronus to McGonagall, explaining that they were fine and were working on being able to better access their Cores for when the potion was ready. McGonagall's silver tabbies returned to explain that Highlash was under guard at the Ministry and that they would be furnished with more answers by the time the potion was ready on Monday night. Slughorn had managed to find some Delorant Beetle wings, she said, which had sped up the brewing process by a day, and there should be no ill-effects on either Harry or Draco’s magic. She also excused them from classes on Monday and commended them for working so well together, which made Draco cackle until tears were rolling down his cheeks, and Harry blush — something he was surprised he could still do at this point.\nThey got dressed only when they invited Hermione, Ron, Pansy and Blaise up to their rooms each night to talk for an hour or so before curfew. Harry didn’t feel right just ignoring his friends and Draco pointed out that it was only fair if his friends were invited too. Truthfully, Harry wasn’t bothered by it -- he found Draco truly amusing when he was snarky and he tended to adopt that attitude the most whenever he was surrounded by his friends. He had even managed to curb his insults to level acceptable to Harry’s friends. More than once, Harry had caught Ron trying not to laugh at one of Draco’s jokes, which could be surprisingly bawdy.\nHarry figured it was the principle of the thing.\nWhen their friends left, their clothes would come off and Harry would find himself rather quickly on his knees in front of Draco, or panting above him, Draco's legs locked around his hips, or thrusting into Draco’s hot mouth, or bent over the end of the sofa as Draco worked him open with his fingers before fucking him. He’d been nervous about that one but they had left the link open again and once Draco had figured out the tempo and angles that felt best to Harry, there had been no stopping either of them. Harry couldn’t think of anything they hadn’t done. Nothing seemed off-limits and they got as creative as possible, even modifying ideas from Pansy’s book on more than one occasion.\nHarry was sore everywhere, inside and out, was dehydrated and exhausted, and at times his cock was so sensitive, he felt raw and he wasn’t sure how he could even manage to get hard again. But he did, over and over, persuaded by Draco’s hands or mouth or arse being washed in the shower, or even just a certain glint in Draco's eyes that never seemed to go away. Swayed by his laughter and easy smiles and smirks and the smell of coconuts on his hair.\nIt occurred to Harry that they were two perspectives of one mind about it: Draco seemed to want to try everything, as he was determined to make sure that their arrangement was dissolved when their Cores were untangled, and Harry wanted to try everything, equally determined to prove to him that it didn’t need to be.\nAnd whenever they were sticky with drying sweat and come, temporarily unable to do anything but wheeze heavily into a mattress with sheets that had been torn half-off, they would close their eyes and slip into each other’s minds.\nDraco had asked him to be able to look at his life with the Dursleys, which Harry had allowed in exchanged for being able to rifle through Draco’s memories of his father. Those were confusing. Lucius obviously loved his son, but so much of their relationship was filled with sharp angles: Harry saw the easily demonstrated affection from Draco’s earlier years slowly replaced by a cold expectation that left Draco bewildered and at loose ends for how to please him. And although he didn’t discuss what he had seen from Harry’s childhood, Draco began refilling Harry’s plate when he was done, much like Molly did whenever he was at the Burrow, telling him he needed to “keep his strength up.” Harry watched Dumbledore’s death through a different lens, saw the Headmaster fall and felt the intense churn of shame inside of Draco, both for lowering his wand and raising it in the first place. He saw Snape giving Draco lessons in Potions when he was eight, saw Draco walking in Paris with his mother when he was twelve, saw him wrestling with a half-dressed Theo Nott in the Slytherin showers at fifteen, and saw him sit at a table while Voldemort killed a woman and let Greyback savage her in seventh year.\nHe got out of the last two quickly.\nIn turn, Draco explored Harry’s memories of Ginny — “Redheads are too much trouble, anyway,” he’d sniffed, then goaded Harry to fuck him hard into the mattress — his disastrous memories of Cho, Cedric's death, and Harry's, cold, desolate winter in the Forest of Dean.\nThey rarely commented their thoughts on each other’s memories other than to let the other know what they wanted to look at or had seen, but Harry understood completely how Draco’s primary Elements were Water and Air. He was clever and adaptable to any circumstance, logical to the bone, and cunning and resourceful in the face of terrifying odds despite the fear that often led him to make horrible choices. He was loyal and loving and frustrating and persistant and in no time at all it felt like he was completely necessary for Harry to continue to breathe.\nOn Monday, Harry woke up to the delightfully warm, wet sensation of Draco’s mouth surrounding his cock. The crown of it brushed the back of Draco’s throat. Harry gasped and placed a lazy hand over Draco’s hair, shining white-gold in the sunlight pouring through the window.\nDraco continued bobbing his head up and down in slow strokes, carefully reaching between Harry’s legs to find his arshole and breach it with two slick fingers in one smooth motion that made Harry arch off the bed and hiss, “Merlin, Draco, fuck!”\nHe felt the vibration of a warm, dirty laugh around him and he thrust up helplessly against Draco’s calculated tongue -- much better when used for these sorts of nasty purposes, Harry thought disjointedly. Draco continued working his fingers in and out of Harry and reached up with his free hand, cradling Harry’s balls and giving them a gentle squeeze before circling his cock, tugging around the base of it in perfect rhythm with the slide of his mouth.\n“Please,” Harry gasped. “I want you inside me.”\nDraco pulled his mouth away, grey eyes ablaze, face hungry. He prowled up the length of Harry’s body to kiss him hotly and at Harry’s jaw, scraped his teeth over Harry’s exposed neck. He lined himself up and pushed into Harry slowly, rocking back and forth until he was deeply embedded and Harry could feel Draco's balls resting against his arse. He squirmed, caught like a fish on a hook, adjusting to the burn of penetration, of being stretched wide, invaded in the best possible way. He reached down and fisted his cock slowly, stroking his foreskin back, using Draco's saliva as a lubricant, as Draco fuckdd in and out of him.\nDraco stared down in between them to where their bodies were joined, breathing raggedly, and Harry watched as his face changed, became tense with longing. He wanked himself and wrapped a calf around the back of Draco’s thigh, feeling the rough scattering of hair there bristle against his own. Draco looked up, arms braced on either side of Harry’s head.\nTheir eyes locked. Time stilled. Draco slid closer to him, and the angle of his prick buried deep brushed that bundle of nerves inside Harry. Harry felt his face twist but refused to close his eyes. Draco’s face was unbearably, unbelievably tender, almost broken as he stared into Harry, who felt like he was being accessed without aid of the link, felt like Draco’s magic was his own and his was Draco’s. Draco looked away and the moment cracked in two.\nDraco picked up speed, deepening his thrusts with hard snaps of his hips and Harry jerked his cock eagerly, feverishly, as his orgasm built. Then he was coming over his fingers, all over his stomach and Draco’s too, and Draco gasped and ground his cock deep. His fingers pressed tight into Harry's jaw and he slanted his mouth over Harry's, hips stuttering, to kiss him ferociously. He groaned Harry's name against his lips and he spilled wetly inside him.\nDraco rested against him, panting hard and Harry took a long inhale of Draco’s hair. It smelled like sweat and shampoo, and Harry suddenly, inexplicably, felt like crying.\nDraco disengaged their bodies gently and rolled off of him. “I think we should go to classes today,” he said at length, breat still coming light and quick.\n“Why? We were excused.”\n“There’s already enough gossip about what’s been going on up here,” Draco said curtly. “We should go to classes and meals like normal. We’ll take the potion this evening and be done with it.”\n“Draco…” Harry felt adrift, off-kilter.\n“Come on, let’s get ready,” Draco clipped out. “Breakfast is in twenty.”\nHarry followed him out of bed, baffled. He knew he hadn’t imagined what had just happened between them, but had no idea how to convince Draco that it had.\n***\nThey made it to breakfast and sat at the Gryffindor table just as the food was appearing. Hermione looked at each of them and reached over to tap three different places under Harry’s jaw, then Draco’s neck, with her wand murmuring under her breath. Harry felt a faint tingle and looked at her curiously.\n“There was some… stubble burn,” she explained quietly, a stain of pink appearing high on her cheeks. \"And, um, lovebites.\" \n“Thanks,” Harry said, surprised that neither he nor Draco had noticed.  “Where’d you learn the spell?”\nHer flush deepened and she darted a glance to Ron, who looked like he was trying not to grin around a mouthful of food.\nRon swallowed. “So, er, did you two get any work done?”\n“We can access the link easily now to get to our Cores,” Draco said into his porridge, not looking up. “It shouldn’t be too difficult to untangle them when the time comes.”\n“And, uh, after? Are you going to be coming back to Gryffindor?”\nStumped, Harry looked at Ron. Draco didn’t say anything. “I guess so. I mean, yeah. They probably wouldn't let us…”\n“Which we wouldn’t, anyway,” Draco said, darting a nervous look around. “What you two saw… What you know. That has no bearing on the future. Tell them, Potter.”\n“I’m working on him,” Harry said, ignoring Draco’s cold look. Draco seemed committed to distancing himself from Harry once their cores were separated. Harry wondered how much he could push him.\nAfter breakfast, Harry followed Draco to Advanced Herbology once again and stewed on the subject until class ended, when Draco walked up to Astoria Greengrass and gave her a rather charming smile.\n“Astoria.”\nShe looked pleased. “Hi, Draco.”\nHarry's hands fisted of their own accord. He quite suddenly wanted to punch something.\nHe shoved the link open and poured his dissatisfaction across it. Draco blinked twice and gave a minute shake of his head. He leaned into Astoria's space and she looked up at him sweetly. \n“I still have my notes from Sixth year Charms,\" he offered, in an overly-familar voice. \"I thought they might be useful to you.”\nShe opened her mouth to reply but hadn't got a word out by the time Harry'd clamped an unforgiving hand around Draco’s bicep.\n“Sorry, Astoria,” he growled. \"Draco and I need to talk.\" He dragged Draco away and shoved him into an alcove.\n“What do you think you’re doing?” Draco said with a haughty lift of his chin.\nHarry carded a hand through his hair. “I get it. Okay? I get it. I saw that letter your mother wrote. I know her friends were attacked for not distancing themselves from your family. I know what you’re doing. You don’t need to do it. I can protect myself.”\n“You can protect the whole wizarding world, apparently,” Draco sneered. But he wouldn’t look Harry in the eye.\n“It’s not going to work,” Harry said. He shuffled closer, crowding him, and saw Draco glance over his shoulder, mute panic flashing over his sharp features.\n“I’m trying to do the right thing,” he said.\n“Look, if you don’t want this,” Harry said, gesturing between them, “I’d understand. But I think you do. And I do. I want this. I want you. I don’t want this to end. But you don’t have to be that way to get me to back off. I will. You don’t have to throw it in my face to hurt me.”\nDraco looked hunted. “Then back off. This morning was the last of it. It has to be,” he said, his voice wavering oddly. “I have to be with a pureblood — my father, even my mother, expect... And you’re who you are. And you have to have realised by now that this never would have happened if… If we hadn’t…”\n“Maybe,” Harry conceded through a constricted throat. “You're probably right, it never would have happened. But it did. And not because the spell turned us mad or something.”\n“There’s no way you can know that,” Draco said. “I certainly never would have — with you. I know that much.”\n“So it gave us a leg up. Helped us get to know each other better than we would have, otherwise,” Harry said. “This week has been— I’ve never had anything like it, don’t you know that by now? I didn't know I could, after-- After everything. And this morning,\" Harry swallowed hard, \"you made love to me.\"\n“We were fucking.”\n“It was more,” Harry returned flatly. “And you knew it. We both knew it. There’s been more between us for a long time, even before the link, I think, and if I can’t protect myself from people who are pissed that I care about you, then maybe I deserve to get my legs hexed off or whatever.”\nDraco made a choked sort of sound. He finally lifted his eyes to Harry’s; they were wet. “I have my life and you have yours. They wouldn’t work together,” he said tightly.\n“Neither should we, but we do,” Harry pointed out. He brushed his thumb over Draco’s cheekbone and Draco shuddered, leaning into it for a scant moment before pulling away.\n“You need to respect my feelings on this, Potter,” he said at last. “Can you do that? Or do you really need to save everyone?”\nHarry’s hand fell to his side defeat knotting in his stomach. “Maybe I’m the one in need of some saving, for once.”\nDraco’s breath hitched but he shook his head. “This is the last of it.”\nHarry stepped away, throat tight. “If you’re sure.”\n***\nThey worked through the rest of the day in relative silence, the link lying dormant between them except when they had to cast in classes. Too soon, they found themselves in McGonagall’s office, sitting side by side as Slughorn hunted through his bag and McGonagall detailed the events what had happened with Highlash.\n“Under Veritaserum, he admitted that he’d taken this post to run a test linking two student’s Magical Cores for more extensive research than the Ministry deemed safe,” she explained, bristling. “He apparently thought Mr. Malfoy was a good candidate, based on his… Ah, previous history. He overheard Mr. Smith discussing his plans and took the opportunity to misdirect Smith's hex so they'd be linked, but he didn't anticipate your Shield charm, Potter. It should have worked but your physical presence between Malfoy and Smith gave the curse something to attach to.\n“Mr. Smith is still expelled,” she added, almost as an afterthought. “And Professor Highlash will be facing criminal charges.”\nSlughorn placed two phials in front of them, both bearing up smoke in multiple colors. “Here, now, gentlemen! Thank you for your patience. Of course this would have been completed much sooner had I known that it was needed. It’s quite an interesting potion, you know, with—“\n“Horace, please.”\nSlughorn glanced at McGonagall. “Right, right. Please dip your wands in the phials for a moment.” They did and he nodded. “Good, very good.”\n“Now what?” Draco said, voice dull. \n“Now you drink them,” Slughorn said simply. “You need to focus on your Cores for five minutes afterward to ensure that they are properly disengaged from each other.”\nHarry glanced at Draco holding his breath as Draco picked up his potion and threw it back promptly. Reluctantly, Harry copied him. The potion was peppery on his tongue and he grimaced. He dared another look at Draco, who had closed his eyes immediately. With a sigh, Harry did too.\nThe feathers twirled around him immediately. A gushing breeze swooped and shuddered and Harry found himself at Draco’s pool. He dived in deep, stroking to the bottom in search of the darkness that would lead him to the snarled tangle of their Cores. As he moved deeper, emotions churned around him. Relief, regret, lust, tenderness, anger, resentment. Harry neared the darkness and hesitated on the precipice of it.\nHe looked around, the weight of what they were doing, what they were giving up heavy inside in his heart. All the colours seemed so bright around him and he felt sad at the thought that he'd never see them again.\nImpulsively, he reached up and caught a ripple of water in rich gold. He clasped his hand around it and a rush of different memories spilled into his mind.\n\nWide, emerald eyes — his own — stared at Draco across the cavernous room of the Wizengamot. His heart sped up as Memory-Harry walked across the room with long strides, strangely mesmerising and looking far more commanding than Harry had ever remembered feeling. He got through the clog of people to stand before Draco and pressed something delicate and fine into Draco's palm. Draco’s fingers closed around it, the wood of his wand warming as if recognised him. He looked up with gratitude, eyes lingering wordlessly on Harry’s.\n\n\nGreen eyes, staring at Draco triumphantly, pupils blown wide as Harry held up the Snitch in his twelve-year-old fist. Jealousy and fascination filled Draco with equal measure.\n\n\nGreen eyes, watching him from across the Great Hall. Memory-Harry’s glasses were askew and he gave him a tentative, crooked smile. Draco lowered his head, glowering, angry at the blush that climbed up the back of his neck.\n\n\nGreen eyes, wide with surprise and pleasure as Harry pulled back from a kiss. Memory-Harry’s body ground upwards into Draco’s, and Draco wanted, wanted, wanted him, in all of the ways he couldn’t have. So he would just take this, this, just these few days. He’d take the small, insane bit luck he’d finally been granted and enjoy it for as long as he could.\n\n\nGreen eyes, so scared in the dark, surrounded by the ghosts of those he loved and still Memory-Harry marched forward as Draco watched. Memory-Harry headed toward his own murder so that thousands of others could have a chance to live and Draco ached with it, flush with shame, his pain at sight of the bright green of Avada Kedavra rising in an unvoiced howl of grief.\n\n\nGreen eyes, sparking with rage as Highlash was propelled backward by the force of Harry’s hex. Memory-Harry’s face was red and tight, provocative in its fierce protectiveness and Draco wanted to be under him at once, right then, all the time.\n\n\nGreen eyes, growing dark below him. Memory-Harry from that morning made sounds Harry couldn’t hear. His face was desperate with pending release, soft with affection, and Draco loved him, he loved the stupid git, and now he was the stupid one for letting it get this far when it would be over so soon.\n\nHarry heard sound for the first time in Draco's mind. It was his own voice, strong and sure, sent through the link. I love you.\nHarry released the bit of gold. He shakily wondered how much time had elapsed and swam deeper into the darkness, approaching the bright knot of their magic. He rested a hand against it.  Slowly, it unfurled before him, and he instinctively began to gather his own, glowing colours in orange and green. They licked their way up his hands like a flame and sank into his skin.\nHe watched as the blue colours seeped away from him and felt it like a vague wrenching inside. Draco's magic began an uneasy flight away from him into the darkness and faded from sight. Harry felt a great, unpleasant tear within and then an emptiness. His eyes fluttered opened.\nLooking around McGonagall's office to get his bearings, Harry could still feel the link as he steadied. He licked his lips and gave it a gentle, questing nudge. Draco twitched and finally opened his eyes as well, but Harry couldn’t feel any response through the link. He wondered if this was the lasting effect Hermione had been so worried about and concluded that if it was, it was rather awful. He didnt want to constantly be able to feel a link that connected with nothing.\nHe didn't want the reminder of what he had lost.\n“Do you both feel all right?” McGonagall asked, interrupting his train of thought.\n“Fine,” Draco rasped out after a beat. The headmistress handed him a glass of water and he drank deeply from it.\n“Fine,” Harry said. He took the glass from Draco’s hand without asking and wet his own throat with what was left of the water, then set it down on McGonagall’s desk.\n“Very good,” she said. She asked them to each cast a simple spell to verify that their Cores were their own again. Harry cast a a charm to check the time — it was 7:04 — and Draco cast a quick hair-smoothing charm on himself, something he’d been unable to do correctly for days. His hair ruffled and settled into silky strands, brushed back from his eyes, and Harry couldn't feel the barest trace of his magic.\n“It worked,” Harry said.\nDraco stood. “Thank you for the help, Professor Slughorn. Headmistress. May I go? I’d like to get back into my room.”\n“Yes, that’s fine, Mr. Malfoy. Again, I apologize for the inconvenience,” McGonagall said. Draco brushed his hands lightly over his trousers, smoothing them. He caught Harry’s eyes in a quick, piercing look. He held out his hand and Harry took it. The clasp was tight and dry and over too soon. Draco released him and walked out in long strides, his back held straight.\nHarry leaned back in his chair, feeling nauseated and slightly weak.\nHe somehow felt sure that that had been the last time he would ever touch Draco Malfoy.\nOver the next few weeks, Harry threw himself into his studies, much to Ron’s consternation and Hermione’s delight. It was something to do, to fill the extra time he found himself with. After having moved back into Gryffindor Tower, he was unable to sleep. He’d gotten so used to Draco's warm, lanky body pressed against him, wrapped around him, it felt wrong and off-putting to wake up alone, which made falling asleep hard. \nThen there were the dreams in which he could feel the link flare to life, bombarding him with memories, wants, desires. Sometimes in them, he and Draco were in the shower and Draco was making snide remarks about how even magic wouldn't be able to fix Harry’s hair. Sometimes they were sitting together quietly, reading. Most often, it was the single, shining moment of a kiss that lingered a moment too long in Harry’s mind. He would wake up hard and aching and open up his side of the link to search for Draco, finding nothing but a void. \nMore disturbingly, he dreamed of Draco and Astoria, being walked down a white aisle by their parents, Draco struggling to get away while everyone smiled benignly at him. Once, he dreamt of Draco staring down at his face, a ribbon of blood dripping out of his mouth.\n Better to stay awake, then. \nHe filled in the hole in his schedule left by Advanced Magical Theory — they wouldn’t have a teacher to fill the position until after the winter hols — with Advanced Care For Magical Creatures so he could spend some time with Hagrid. With McGonagall’s permission, he also added Advanced Muggle Studies. It wasn't a required course for him but the extra assignments kept his focus on schoolwork and he rather liked being able to tutor the students who'd been raised in wizarding homes. \nThe only downside was that Pansy was seated next to him in the class. so Harry had a running diatribe in his ear on her opinions of compulsory classes for Slytherins, of Muggles, of her new make-up charms, her wardrobe, whichever wizard she was seeing at the moment, and of course, on Draco.\n “Draco’s visiting his mother this weekend, again,” she complained one day while Harry mixed some cookie dough for the cooking portion of their class and she stood by, refusing to help. “He visits her every weekend now, never spends any time with us anymore.” \nHarry tightened his mouth and told her to hand him a measuring cup.\n They were budgeting for groceries using pounds instead of Galleons when she threw her hands up in exasperation. “I have lots of gold, why do I need to know this? It’s not as if I’m going to run out of money — or have to buy my own supplies, I might add. We’ve all had house-elves since we were little. Draco used to make them pretend to be puppies.”\n Harry shook his head, pressing down too hard with his quill and watching helplessly as ink bled across the parchment. \nThey were cleaning the gloppy mess that the professor had conjured with rags and water and Muggle cleaning products — or, Harry was — when Pansy huffed, “I don’t know why they don’t just use cleaning charms.” \n“Muggles can’t do magic, Pansy,” Harry said, grinding his teeth. \n“Well, they should hire people to do it for them.” She paused to point her wand at a bit of goop on her skirt. It vanished. “Draco always says that the key to living a good life is having the sense to hire people to do the unpleasant things for you.” \nHarry slipped on a puddle of sludge at their feet and went down in a spectacular heap, banging his chin on the edge of the desk as he flailed and dropped to the floor.\nAnd then, of course, he had to see Draco four times per week, in Potions and Transfiguration. Harry swallowed his pride and asked McGonagall and Slughorn if they could avoid being paired. “I think we just need a bit of space, after what happened,” he’d said, his voice sounding strange to his own ears. To his relief, they agreed and didn't ask questions. \nBut in classes, Harry could see Draco, the slender line of him hunched over his parchment to take notes, the graceful motions he made when waving his wand, his thoughtless efficiency as he chopped ingredients in potions with dexterous, elegant fingers. Harry would find himself taking a step in his direction, simply wanting to be next to him, before stopping himself and setting back to his work. It was what Draco wanted.\n But occasionally, his would catch Draco’s gaze on him from across the room and the sleeping link would seem to pulse for a moment before Draco slid his eyes away, the link going as blank as his face. \nWorking with Hagrid was a relief from all of it. Harry found solace in being outdoors, working with creatures that didn’t look at him with worship or questions. It had the added benefit of being away from the castle, where he was unlikely to see Draco in the corridors. Hagrid had been delighted to see him, his Advanced class being quite small and consisting mostly of seventh years from Hufflepuff and Ravenclaw who Harry didn’t know. Still, he worked hard at it and found himself smiling more easily there than he could in any other classes. Hagrid had gotten better at teaching, over the years, teaching them how to uncover a Bowtruckle's nest and watching a Kneazle give birth over a period of fourteen hours — Harry had gotten to miss both Transfiguration and Potions that lucky day, and was able to hold one of the kittens, which weighed over ten pounds. But his favorite was when Hagrid took them out to find Unicorns again. One had walked up to Harry with shining eyes and nudged her velvety, insistent nose against his head, filling him with a sense of piece and calm. It was nice while it lasted.\n Afterward, Harry would go to Hagrid’s hut, where Hagrid would talk about creatures or the weather or possible lesson plans in a rumbly, idle voice while he worked on small items with his giant, gentle hands, and Harry would allow his voice to lull him into a sort of stasis where he didn’t hurt so goddamn fucking bad that he wanted to scream from it, every second of every day for over a month. \nHagrid would stuff rock cake down him with the aid of lots of tea and Harry would finally trudge back to the castle, feeling full and wobbly and tired before settling down to do homework with Hermione or playing half-hearted chess with Ron. \nAnything to busy. \nAs wrapped up in each other as they were, Ron and Hermione noticed. Of course they did; Harry’s luck had never extended that far. Hermione began delicately bringing up the “Malfoy thing,” at regular intervals and Ron had somehow convinced himself it was about the “liking blokes thing.” He told them both to bugger off in the nicest tone he could manage. \nStill, he knew them well enough to figure out what was coming when Hermione put down her quill one night with a click and said, “There’s a boy in Ancient Runes I think you’d like, Harry.”\n Harry groaned, taking off his glasses to rub his gritty eyes. He was only halfway through twenty inches on the wand motions for conjuring live creatures based on size and he wondered briefly if he was going mental or if Hermione was just planning on driving him there. “I’m fine, thanks.” \nShe nudged Ron with a sharp elbow. Ron gave a low ‘oof’ before looking up. “No, it’s true. Name’s Robert Sheffield. Nice. Blond, since you, you know… Go for that. Quite fit.” \nThe name sounded familiar and after a moment, it clicked. Robert Sheffield: quiet, tall boy with dark blond hair in Hagrid’s class. A Hufflepuff. Harry had caught his sideways glances, filled with curiosity but none of the vapid hero-worship that gave Harry a headache. \n“I know him. He’s in Magical Creatures with me,” Harry said. “But I’m not into — you know, blond blokes.” He scrubbed a hand over his face. “I don’t know what kind of blokes I like. There’s just been the one.” \n“Even better! Now you have the opportunity to find out,” Hermione said brightly, cringing when she was promptly shushed by Madam Pince. She lowered her voice. “Unless, you know, you and Draco were…” \n“Were what? He’s done with it. Done with me. He didn't believe me that it wasn't all because of the spell, and anyway, he made it clear he needs a pureblood in his life. His family’s going to marry him off to someone in the Special 28,” Harry muttered. He knew it was unfair but he was too tired to care.\n Ron made a weird bleating sound. “Sacred 28. But ew. Did he actually say that to you? What a right arsehole, not that we didn’t know that about him already. You’re well rid of him, right ‘Mione?” \nHermione was quiet. Harry glanced at her and was surprised to see her gazing at him thoughtfully. “Well…” \n“What?” Harry looked around as if the books on the shelves might be able to explain the odd expression on Hermione’s face. \n“Well, I mean, yes. Of course, it’s an awful thing to say,” she said slowly. “But, it sort of matters to him, a bit, right? Family obligation. Or it must to the people he loves. I mean, he’s obviously changed since the War. I think even before that.”\n Harry's mind flashed to the memory of Draco pointing a tentative wand at Bellatrix Lestrange as she tortured Hermione.\n “Anyway,” Hermione said. “The thing of it is, though you might technically be a halfblood — although really, that's debatable because your mother was a witch even though she was Muggle-born. It's actually a really interesting argument about the perspective of what constitutes 'pureblood,' when you think about—\"\nHarry coughed and she coloured.\n\"Anyway,\" she continued after a beat, \"your magical heritage is more pure than most, Harry.” \n“My mom came from Muggles, like you said,” he said, confused.\n“Well, yes. But she was a witch. And your dad… Well, haven’t you ever researched his family line?” \n“I know he was a pureblood,” Harry said defensively. “I know about his family.” \n“Right, but if blood status means something to Draco — and don't get me wrong, I don't think it should, but, well, you know that the Sacred 28 should be the Sacred 29, right?” \nHarry stared at her, confusion mounting when Ron’s expression cleared and he nodded with understanding. “Oh, yeah.” \n“What are you two on about?” Harry asked, rapidly losing patience. \nRon shrugged. “We don’t pay much attention to the list. I mean, you know Dad. And Mum, too. S’all rather stupid, if you ask me, because pretty much every wizarding family has diluted its blood line somehow by this point, right?” Hermione nodded, and Ron continued. “But I guess the Potters were on the list, too. They got removed a long time ago, not sure why. I think one of them was after reform towards Muggles and it pissed everyone else off or something. Dad used to joke about it with Mum when I was a kid. 'Maybe if we’re lucky enough with this one, they’ll kick us out of the Sacred 28.’”\n Harry took that in. “Doesn’t matter,” he said at last. “There’s the whole producing-an-heir thing he mentioned, and obviously — us being blokes—“\n “Actually,” Ron said with a strange smile before promptly shutting up and rubbing his ribs where Hermione had elbowed him.\n “Don’t freak him out.” She turned to Harry. “It’s nothing. But I mean, the other thing is something to consider. If it matters to him. If that’s the real reason why you guys aren’t seeing each other anymore.”\n “It’s one of them,” Harry mumbled. His head was starting to hurt. “Also the spell. He thinks it happened because of the spell.”\n “Well, didn’t it?” Hermione said briskly, parroting Harry’s thoughts. “But that doesn’t mean…” \n“Try telling him that,” Harry said sullenly. \nRon scoffed. “Blimey, I can’t believe I’m encouraging this.” He shook his head. “You try, Mate. You’re the one who matters to him. You’re the one who cares.” \nHermione gave him another elbow to the ribs. “We care, Harry. We just don’t want you to be so… Sad all the time. And if it’s not Draco, there are plenty of other boys — or girls — who’d be happy to go out with you.” \nHarry slammed his books shut a bit harder than necessary. “I really don’t need your help,” he snapped. Hermione looked down, her mouth trembling. Harry looked away, feeling like a dick — even worse when Ron glared at him. “I’m sorry. I’m just not… I guess I’m not there.” \nHermione looked up, firming her chin. “Then that should tell you something, Harry.” \nYeah. He guessed it did. \nHe just didn’t know what he could do about it.\n *** \nThe following day in Transfiguration, Harry allowed himself to watch Draco more carefully than he had for over a month. Though Draco didn’t look up at him once, Harry had a feeling he could feel Harry's eyes on him by the bracing of his shoulders, by the tension in the back of his neck. His wand movements were clipped almost to the point of being jerky and he had to Vanish more than one attempt at Conjuring the miniature, palm-sized Erumpent they'd been assigned. \nAfter class was over, Harry took a deep breath and walked over to Draco’s desk, crouching as if to tie his shoe. As he fumbled with the laces, he shoved open his side of the long-dormant link. It felt rusty from lack of use but undeniably there. Into the void, Harry concentrated on funneling a feeling through: I miss you, all the time. It wasn’t just the spell. \nDraco stood and Harry looked up hopefully, but Draco didn’t even bother glancing down at him as he stuffed the rest of his books into his bag and circled around Harry, who by now probably looked daft in his current pose of fake-tying-laces. Harry stood up slowly, his eyes trailing after Draco out of the doors of the classroom, where Astoria Greengrass was apparently waiting for him. \nSick with jealousy, he watched Draco’s head dip to say something near her ear, his white-blond hair glinting in the sunlight. Astoria smiled up at him in a friendly fashion and the nausea in Harry’s stomach transformed into gnawing pain. He stumbled out of the classroom amongst the rest of the students, nearly tripping when grey eyes caught his with a level gaze. Draco gave him a cautious nod, then went back to talking to Astoria, face intent. For a bizarre, tilting moment Harry debated running over there and dragging Draco off again, just abducting him away — he closed his eyes and remembered kissing him and being kissed by him — but his legs were rooted to the spot. \nStudents filed passed him and it seemed like everything was going in slow-motion, a blur of colour and noise, none of which reached him but those two heads, one dark and light, close to each other, whispering things he couldn't hear. He startled at the feel of a hand on his arm. \nHermione stood there, looking at him sympathetically. “Time for lunch, Harry.” \nHarry swallowed thickly and nodded, never less hungry in his life. He followed after her and picked at his food, watching the doors the whole time for Draco, who never arrived. \nAfter lunch he trudged to Muggle Studies. Pansy was waiting at their shared desk, flicking through what looked like a Muggle fashion magazine. She glanced up at him with a sardonic smile. \n“We’re studying something called Popular Culture today. It’s weird how the pictures don’t move,” she said, looking back down at the magazine. “The clothing would probably sell better if people could see how it flowed.”\n Harry grunted, sliding in beside her. There was a stack of other magazines and newspapers from varying years: The Daily Mirror, The Sun, Glamour, The New York Times. He grabbed one of the newspapers and leafed through it listlessly.\n “Of course, it doesn’t matter to some people how they look,” Pansy continued with a pointed eyeroll in Harry’s direction. “But for some of us, style comes very naturally. Take Draco for instance — the pleat in his trousers always falls just right. So does his hair. I’m sure you’ve noticed.” \nActually, he'd noticed him more naked, Harry thought, his hands tightening on the newspaper. \n“And he always smells so good.” Pansy gave a little sigh of delight. “His hair potions come from France, you know.” \nHarry did know. Once Draco had discovered that Harry liked it when he spoke French, he’d murmured filthy little words in his ear while fucking Harry hard from behind. It was only later, when Harry had asked him what he had been saying, that Draco had laughed and admitted to listing what ingredients he could remember from his shampoo potion.\n “And then, of course, there’s his body,” Pansy said and Harry cut her off with a snarl. \n“Fine! Fucking fine! You want to talk about Draco?” His heart was beating too fast. \nPansy came immediately to her feet. “Professor? I think Potter here is feeling sick. May I take him to see Madam Pomfrey?”\n The professor nodded in a rather vague way and Pansy grabbed Harry’s arm, hustling him out of class. Once they were in the corridor, she let go and threw her hands up in the air with a great, gusting sigh. “Finally!” \n“What the fuck, Pansy,” Harry said angrily. “What are you doing, going on about him? What do you expect?” \n“I expect you to act like the bloody Savior and go save him from himself!” she snapped. \nHarry drew back in surprise. “He doesn’t want me to be his savior, whatever that means. He specifically told me that.”\n “No, you utter twat, he wants you to be his boyfriend. So grow some balls, already. I’m sick of this shit.” Pansy matched his glare with one of her own. \n“You’re sick of it? You’re not the one who got shoved aside for his his parent's expectations, or because he was afraid something would happen to you if…” \nPansy looked at him shrewdly. “If you dated a Death Eater?” Harry nodded and she gave a humorless laugh. “Merlin, that’s rich. Like his life wouldn’t be in ten times the amount of danger yours would be in if you guys went public.”\n Harry sucked in a breath. “Would it really?”\n “Come on, Potter. I know you’re oblivious to practically everything and that you handled the Dark Lord with pretty much a wand and a prayer, but think about it. Of course he would be. But I’m guessing you’d let him make that decision for himself.” \nSomething unpleasant turned over in his stomach at the idea of people threatening Draco for being with him but Harry had to admit she was right. He was all-too-aware of what it was like when other people decided what was right for you. He nodded again.\n “Well, then, you’re going to have to convince him that what you want is enough.” \n“How do I do that? I’ve done everything I can think of,” Harry said. \nPansy sighed again, a gentler sound. “Persevere, Potter; that’s what you do, right?. Nothing will get through his wily Slytherin brain better than convincing him that you’re just not going anywhere, that it’s more advantageous for him to just give in than to know you're out there, disrupting his calm all of the time. Besides,” she added, almost sadly, “people never fight for him. Even his parents didn’t, before. Not enough.” She looked away. “I’ll leave the details of what to do up to you.” \nShe turned to go and Harry snapped a hand around her wrist to stop her. She turned back, raising her eyebrows. \n“How is he?” Harry asked, unable to help himself.\n Her face twisted. “Not good. He walks around like a wounded kitten all the time. Blaise told me he doesn’t sleep. He won’t talk about it, so we don’t know exactly what happened although I have a guess — Blaise found my book in Draco's trunk and returned it to me, thankyouverymuch. I’m tired of being worried about him. He’s my oldest friend and I’ve spent the last two years terrified for his safety and I thought I was done with it. So you need to fix this, already.” \nShe pulled her wrist out of his grasp and began to flounce away. \n“Pansy?”\nShe turned back around, irritated. \n“Yes?” \n“Can I borrow your book again?” \nPansy stared at him. Slowly, her mouth curled up in a devious little smile. \n***\nThe following day in Potions, Harry decided to start out small. He clutched the crumpled note in his hand nervously, waiting for the right moment to send it over. \nIt seemed like he would never get a chance, but near the end of the class, when Slughorn was busy rooting for something in his cabinet and Draco was half-turned away from him, Harry whispered a charm and watched the little ball parchment zoom over to Draco and drop onto his desk. Draco turned in surprise and picked it up, glancing around suspiciously. His eyes landed on Harry who looked back at him with as bland an expression as he could manage.\nDraco dropped his eyes to the note and shoved his hands under his desk as he fumbled it open. A moment later, his pale face went Gryffindor-red and he snapped accusing eyes up to Harry, who grinned, showing lots of teeth. \nHe had hoped for a reaction half as good as he watched Draco shift uneasily in his seat and even reach down to adjust himself furtively. He didn’t look in Harry’s direction again. \nThe scrap of paper with the single word, Lubrico on it, written in Harry’s spiky hand, was now clutched in Draco’s tight grip. He’d needed Pansy’s book to look up the spelling of the lubrication spell, but Draco, of course, recognized it immediately. \nHe knew he was pushing it but he tore off another bit of parchment from the bottom of his homework and scrawled, Wish I was that paper. He levitated it quickly over to Draco, relieved when Draco snatched it out of the air with his free hand before Slughorn saw it. \nDraco looked down, eyes moving. His mouth tightened and he dropped both notes like they burned him. He sent Harry a warning glare, pulled out his wand, and Vanished each note in turn.\nHarry shrugged, wiggling his eyebrows. He opened his side of the link and sent a shot of attraction through it. Startled triumph took his breath away as something like alarm coursed back at him — his first confirmation that both sides of the link could still be used — a split second before Draco shot out of his seat. He stalked up to Slughorn and held out a hand with his stoppered phial to the surprised professor, slammed his homework down, and stalked out.\nHermione half-turned in her seat, watching Draco go, along with everyone else. Ron leaned over to him. “Was that you?”\n Harry felt a bit like cheering. “That was me,” he confirmed. \n“And you think making him mad is going to… get him back?”\nHarry snorted. “Probably the only thing that will,” he said with certain amount of satisfaction.\nThat night, Harry slept harder than he had in almost five weeks. He had a dream where Draco shouted at him for a solid hour before snogging him senseless and Vanishing their clothes and when he woke up, he was hard and restless. \nHe poked at the link experimentally. Since the Potions incident, it had been annoyingly silent. But he could always feel it, even at rest, which meant that Draco could too — even though he avoided using it. Maybe Harry just needed to bother him enough.\nHe opened up his mind and allowed images of Draco to fill his head: on all fours in front of Harry, washing Harry’s cock with a light hand in the shower. Harry glanced around to make sure his curtains were shut, then slipped a hand into his pajama pants, closing it tightly around his morning erection. As he tugged on it slowly, winding himself up, he made sure to send as many memories and sensations through the link as he could conjure and he could feel the exact moment that Draco got curious enough to open up his side because Harry was suddenly blasted with a wave of angry arousal. \nHarry moved his hand faster, gasping and unbearably turned on by just the idea that Draco knew what he was doing. Gonna come thinking about you, Draco, he thought breathlessly and promptly did, spurting into his frantic hand.\nThe link closed so hard it practically made a noise and Harry leaned back against his pillows, panting. All in all, he thought that had gone well.\nAt breakfast, he sent over another little note, this time with a picture copied from Pansy’s book, the man and woman charmed into a slender blond leaning over grabbing his ankles as a darker haired man knelt behind him, face buried in his arse. The blond man leaned into it, his face tight with near-release.\nHarry’s wand twitched a little with nerves when Draco glanced up and Harry cringed, hoping it wouldn’t affect his aim. It did, but just barely. The picture landed in front of Pansy, who picked it up and opened it, ignoring Draco’s panicked reach for it. She stared down in silence, clapped a hand over her mouth to muffle her laugh, and looked up to find Harry with bright, approving eyes.\nHe gave her a small, embarrassed smile.\nHer face relaxed. She shrugged nonchalantly and said something to Draco as she tossed the note at him. He scrambled for it and tore it back open, hunching over it to shield its contents. \nAs Harry watched, Draco froze. He swallowed convulsively, shaking his head in disbelief. When he finally looked up, his face had gone rigid. He met Harry's gaze and jerked his head to the doorway before getting up and leaving the room. Harry followed him.\n Draco was waiting in a stone nook twenty yards away. Harry ambled up to him, finally feeling truly uncertain since he had talked to Pansy. He took a deep breath; nothing to gain by not trying, and all that. \n“You beckoned?” Harry asked, trying for a casual tone.\n “What the fuck do you think you’re doing, Potter?” Draco hissed, complexion white with rage. “Sending me this… this…” \nHarry stepped closer. “I thought maybe you had forgotten. I haven’t. I think about it all the time. In fact, this is the best I’ve felt in weeks,” he said, leaning close and breathing in the smell of Draco’s aftershave. It was spicy today, with that lingering tropical scent that probably came from his hair. \nDraco batted him away. “Are you smelling me?” \nHarry sighed. “Get over it, Draco. I miss you, okay? And you miss me, too. I know you do. I’ve been trying to stay away but that’s not making either of us happy, so you should get used to me again. We’re still linked and that’s not going away, either, is it? You like taking advantage of circumstance? I’ll make sure you have to, every morning, and night, and sometimes in the middle of the day, until you start being reasonable about this.”\n He turned to walk away and was halted by Draco calling after him. “It’ll go away if you stop using it. Stop using the link, Potter!” \nHarry turned back and smiled. “No.” \n*** \nTrue to his word, Harry instituted an all-open, all-the-time policy when it came to the link. \nSince sexual intent seemed to have the easiest time getting through — or at least, that was what Draco was most responsive to — Harry used it when he wanked in the morning, flooding the link with memories of things they had done and ideas of things they could try. He began having a wank at night as well, sometimes two. And, just for good measure, had excused himself from a couple of classes for several minutes, only to come back and find Draco sweating and nervous, face flushed, his eyes shooting daggers at Harry’s suddenly relaxed figure. (That part was difficult. Harry had never done it in the middle of a school day before, let alone during class time. The first time, he felt sure that as soon as he came back in, everyone would know what he had been up to. When no one but Draco seemed to suspect anything, it got easier.) \nConstant masturbation aside, Harry found himself floundering for ideas for how to reach Draco, who studiously ignored him whenever he wasn’t sneering in Harry’s direction. It felt like the beginning of eighth year all over again except that, sometimes, Harry could feel a shudder of release spiral through Draco’s end of the link when Harry’s constant teasing got too much for him. Sometimes, Harry could sense Draco’s frustration bleeding across the link before Draco got it under control and snapped his side closed. \nAfter a week of it, Harry was almost sure that Draco would snap, resulting in an either extremely dead or extremely satisfied Harry, but nothing happened.  He stopped sending notes when Draco began simply Vanishing them without looking at them first and reconsidered.\n He detained Pansy on their way out of Muggle Studies. “How’s he doing? Has he said anything?” \nShe shrugged, feigning disinterest, but her eyes were sly. “A bit more like himself. When he’s pissed off about something, which is never something I want to be around. Liked the picture, by the way.” Harry flushed; he should have known she'd comment on it eventually. “So that’s it?” she prompted. “Dirty pictures?” \n“I’m doing other things,” Harry grumbled. “He just won’t talk to me about them.” \n“Have lunch with us,” she said suddenly. \nHarry’s head jerked up. “What?”\n “No, really. Have lunch with us. I mean, you used to, before. I’ll take the blame, if you need me to,” she offered.\n “Why?”\n Pansy snorted inelegantly. “Well, if nothing else, it should be amusing.” \nHe followed her to the Slytherin table, a tentative idea forming in his mind. Draco looked up with shocked eyes as Harry sat down next to him, but Blaise grinned. “Oh ho, Harry! Thought you didn’t like us anymore now that you two had parted ways.”\n “Can’t stand you lot,” Harry said with an answering grin. “I’m just here for Draco.” \nBlaise and Pansy laughed. Draco's glare promised all three of them death, which made his friends laugh harder. Harry pressed the length of his thigh against Draco’s under the table and frowned when Draco pulled away at once. \n“I could tell you another way,” Harry suggested under his breath and opened the link. He wondered if maybe focusing on the sexual aspect of their relationship had been going at it all wrong. This time he pushed through the ache he’d been carrying around for too long, the loneliness that he felt without Draco’s snide remarks and unexpected affection. \nDraco made a small noise in the back of his throat and Harry’s mouth ran dry. He felt an answering nudge of raw pain, almost like a thought. Stop it. Please. It won’t work. \nHarry exhaled slowly. Maybe. But you won’t even try.\n Too dangerous, please. \nHarry snorted. For me, or you?” \n“Fuck you!” Draco blurted. Pansy and Blaise paused, mid-chat, to look at them strangely, and Harry realised he and Draco had been staring at each other in silence for who knew how long. \nHe took a deep breath, rattled. “Well, I’m open to that again, whenever you’re ready.” \n“Shut your mouth, Potter,” Draco hissed. His wand was suddenly in his hand but Harry didn’t flinch from the sight of it. What did bother him was the whiteness of Draco’s face and the way his hand was shaking. “Don’t you have any sense of self-preservation?” \nHarry paused and considered it. “I guess it depends on what I think will hurt me the most,” he said, filling up his plate. “Hey, did you all know that my dad was one of those Sacred Family people? Sort of, I guess.”\n Pansy and Blaise exchanged a disbelieving look. “Of course we know about the Potters. Technically you’re not on the list anymore, though.”\n “Does that matter if your bloodline is pure?” Harry wondered aloud vaguely, feeling a bit like Luna. He stuffed a forkful of food into his mouth and watched Draco’s face.  Draco didn’t say anything, but Blaise lifted his shoulders. \n“Maybe not. Maybe so. Depends on the reason. Why?” he asked, blinking at the venomous look Pansy shot him through her lashes. \nHarry swallowed. “Dunno. Might just be important for some people to consider. For some reason. Even though it’s stupid.” He ate another bite — really, the food at the Slytherin table was pretty excellent — and kicked bumped Draco’s shoe with his own. “Do you know anyone who that would matter to?”\n “No,” Draco said coldly. \n“Oh. Want to go to Hogsmeade with me this weekend?”\n “Have you gone completely mental without sex, Potter?” Draco whispered spitefully, too low for anyone else to hear. “Is that what this is about? You want me on my knees one last time, maybe? What are you angling for, here?” \nHarry stopped, meeting his eyes. He ignored the sudden throb in his cock and focused on the anger instead. “You. I’m angling for you. Because you don’t get to decide what’s safe for me or not. You know how it’s been for me, Draco, you of all people have seen—“ He broke off, his throat tight. “You know that I know what it is to be an instrument. And I won’t be yours, even for my own protection. Not in a way I don’t choose.”\n Harry stood up, appetite gone and opened up the link as wide as he could. He pushed everything he was feeling into it, all of his confusion and loss and pain and need. “So say what you want to other people about us,” he said quietly. “But I’m not pretending anymore. If someone asks me out, I’m going to say no — because I’m taken. Then it’s not on you if someone gets mad about it, is it? It’s a choice I made. You can make your own and I hope you’re smarter than you’ve been about them in the past.” \nPansy and Blaise, as well as a tight knot of younger Slytherins and a small group of Hufflepuffs that were sitting nearby, were staring at Harry with identical expressions of shock and interest. Harry walked passed them, shaking and sat down heavily at the Gryffindor table, where Ron patted his shoulder clumsily. \n“All right, mate?” \nHarry stared at the table, stomach roiling. “Not even a little.”\n “If the stupid bastard won’t reconsider, there’s always that other guy,” Ron mumbled. \nHarry nodded glumly. “I’ll think about it,” he said, knowing that he wouldn’t. \nHe didn’t want anyone else; he just wanted Draco back.\n ***\n Harry’s first chance came two days later, when a reedy girl from Ravenclaw with glasses and dark hair down to her waist approached him with that certain look about her.  Autograph or date, he wondered. A group of her friends stood ten yards away and Harry braced himself. \n“Hi, um, Mr—Harry?”\n He stalled in the corridor, trying not to cringe. It wasn’t her fault that he was so stupidly famous that people got the idea they knew him. Plus, she was young — Merlin, she couldn’t be more than fifteen, which made him uncomfortable on a completely different level.\n “Hi, er…” \n“Amelia,” she said, casting a wide-eyed look behind her to her friends. They looked like they wanted to giggle. “I, um, I heard that you… I mean, I heard that you and Ginny Weasley weren’t… I was wondering if you might fancy going out sometime?” \nHarry sighed. More often than not, they lost their courage and scampered away before it got this far.  “I appreciate it, but…” \nHer face screwed into an overly-sympathetic expression and she put her hand on his bicep, giving it a light squeeze. She actually squeezed his bicep. Harry stared at her, numb with surprise. Merlin, the girl should’ve been Housed in Gryffindor. Or possibly Slytherin. “I understand. Breaking up can be hard, right? But if…” \nHarry shook her hand off, sympathy vanishing with his patience. “Thanks, but I’m bent,” he snapped. “And taken.” \nHe walked away, ignoring her shocked intake of breath and the way she ran back to her friends. \nNews apparently travelled fast, because that night during dinner, two more girls approached him, ostensibly to ask him out but really to gather verification for the rumour. A sixth year Hufflepuff boy tried as well and when Harry repeated his line about being taken, was the only one who bothered to ask by whom.\n Harry stalled, thinking of Pansy’s prediction of how dangerous it might be fore Draco to be associated with him but Ron had no such compunction. He waved his fork in the direction of the Slytherin table. “Malfoy,” he announced. “They’re on the outs right now, but he’ll come around. Harry’s daft over him.”  Harry kicked him under the table and Ron winced. “But, you know, not like love-potion daft.” \nThe boy nodded with good grace and quirked a crooked smile at Harry that he found himself returning. “I’m sure he’ll come around. You’re… um… very fit.” \nHarry was startled into a laugh. “Thanks.”\n He felt an unpleasant tug inside and glanced over to find Draco staring lividly at the retreating student, upper lip drawn back into a silent snarl. Draco finally tore his eyes away and stabbed at his food. He jerked away from the light touch Pansy pressed to his forearm. \nHarry smiled. \n*** \nThe following morning, Harry was dismayed but unsurprised to find that his face was splashed all over the front page of The Prophet with the headline, SPECIAL EDITION! THE BOY WHO LIVED TO LOVE ANOTHER WIZARD: A HEARTBREAK FOR WITCHES EVERYWHERE. It seemed like every student was reading it. \nHe held his head high as he walked through the dining hall and grabbed some toast, munching on it as he skimmed through the copy Hermione handed him silently. It was a fairly standard rundown of Hogwarts gossip, although there was a section filled with conjecture about how fighting Voldemort might have changed his “natural” inclinations to what they currently were. There was also a full page dedicated to how devastated Ginny must be over the news. \nHarry glanced at her. Her eyes gleamed with amusement as she perused the article in question and she sent him a swift, sympathetic little smirk. Harry grinned and continued reading. \nThere was a bit at the end speculating over who he was dating — someone in Slytherin, their anonymous sources claimed — but strangely, no actual mention of Draco even though everyone around them had heard Ron announce it the previous night.\n “Check out the Slytherin table,” Ron snickered suddenly.\n Harry put down the paper and looked over. \nOwls had begun streaking in, dropping piles of mail on pretty much every Slytherin boy, even some of the younger ones. Draco was practically covered in them, trying to Vanish the whole lot even as more fluttered down. Harry heard the sudden snap of windows shutting and a felt the crackle of magic. He looked up to find McGonagall standing at the Professor’s table, wand out. \n“While I appreciate that there may be some news that many students are finding particularly fascinating,” she announced, “I would like to remind everyone to respect the privacy of your classmates. I will be adding wards to the mail for Slytherin students immediately, to allow mail in only by those whom you approve. Please have a list to me by the end of lunch today.”\n She sat down and Harry spared a moment to be grateful she had already added one for him on the first day of term, when he’d been besieged with letters — and more than a few packages that had turned out to contain love-spelled items and lust potions.\n Harry watched sympathetically as almost all of the Slytherin boys who had mail scampered out of their places and left the Great Hall, Draco included.  Blaise sat peacefully in his spot, opening his mail with what looked like great delight.\n With a regretful sigh — he’d barely managed to finish some toast and bacon, Harry shoved out of his seat and followed the exodus. \nHe opened the link tentatively, searching for Draco. Are you okay? \nA harassed, snide feeling shot back at him. Harry chuckled a little at how so very Malfoy it was. Where are you?\n There was such a long pause that Harry started to consider heading to his rooms to get his map, when a blurry, strained image came through showing a first year Charms classroom. Harry turned a corner and jogged down the corridor to the room in question and slipped inside. \nDraco sat at a desk, head in his hands. “Why are you doing this, Potter?” \nHarry stopped, astonished, eyes on the curve of Draco’s neck, on the hair falling over his eyes. “I thought it was obvious.”\n Draco gave a harsh little bark of laughter. “Yes, and we should all be subjected to your version of what’s obvious. You’re stalking me. Not like that’s new.” \n“I’m not stalking you.\" Harry winced and shrugged. \"I’m… winning you back.”\n “In what universe is outing me to the entirety of Hogwarts and the rest of the wizarding world ‘winning me?’”\nDraco asked, disbelief etched across his sharp features.\n Harry shifted uncomfortably. He walked over and sat down. “The article didn’t say anything about you.”\n “Not today's,” Draco shot back bitterly. \n“All I’ve said is that I’m taken. That I’m, you know, in love with someone. Ron is the one who mentioned your name and I’ll make sure he doesn’t do it again. You can say whatever you want to the press.”\n “My mother is ecstatic,” Draco said. \nHarry blinked. “She’s what?” \n“I got hers before the rest of the letters came,” Draco admitted with a small sigh. He slid a folded piece of high-quality parchment over to Harry, who picked it up and opened it. \n\n\nMy love, \n\n\n\n\nWas this the reason you so strenuously refused to be Matched with Astoria last month? While I admit to feeling a certain amount of surprise over your choice of partner, I cannot fault your pick. Harry Potter is not only an uncommonly powerful young wizard with an impeccable bloodline on his father’s side, but his reputation alone can only help to bring dignity and pride back to the Malfoy name.\n\n\n\n\n I have occasionally wondered about your preferences on the matter but when you refused to discuss it with me and allowed us to begin talks with the Greengrass family, I assumed that you approved of our plans. I only want the best for you, and of course Harry. Please know you can tell me anything.\n\n\n\n\n Please let me know, as well, if either of you need help dealing with the press when your relationship is fully exposed. I will contact our public relations firm, who I've no doubt will be speaking to us again after today. \n\n\n\n\nI would appreciate it if you would let me discuss the implications with your father as, surely, he is going to hear about this.\n\n\n\n\n I love you, \n\n\n\n\nMother\n\n\n Harry felt a weird bubble of laughter in his throat. “Your father will hear about this? So, you’re not the only one who says that?” He paused. “And when did you call off the idea to getting married to Astoria? I saw you talking to her…” \nDraco glared at him, meeting his eyes for the first time, but Harry felt a reluctant sense of amusement thread through the link. He reached out to place a gentle hand on Draco’s back and, when he wasn’t shrugged off, moved his palm in small circles. \n“Almost right after our Cores were disconnected. I couldn’t… I couldn’t. And she didn’t want to, either. But don’t you get it? Now you’re a political ambition. It’s all right for me to be gay, because you are, and because I’m with you. And everyone will know. And we’ll both be in danger because of it.” Draco ran his fingers through his hair in agitation. \n“So?” \nDraco groaned. “Why doesn’t that bother you? A normal person would be bothered.” \n“I’ve been in danger for so many years, I think life is boring otherwise?” Harry joked.\n “Ha bloody ha.” Draco dropped his head down onto the desk with a thunk, exhaling loudly. Harry continued to pet him, fingers travelling up his spine to play with the hair at Draco's nape as he searched for the right words.\n “Are you really ignoring the part about me being in love with you?” he asked. “I’ve said it twice now.”\n “I really think they should add ‘bullheaded’ to the list of Gryffindor characteristics.”\n “They don’t need to; everyone knows. You’re still ignoring it.” \nDraco sighed. He lifted his head. “No, I’m not.” \nThe link flared to life in a way that it hadn’t in so long and with it came the most piercing sort of sweetness that Harry had ever felt. He put a hand over his suddenly unsteady heart, his ribs growing too tight for his lungs. Love and fear in equal measure washed through him, and Harry's eyes ached, the urge to cry almost overwhelming as Draco watched him, face carefully blank.\n He leaned forward and pressed his lips against Draco’s. The kiss was dry and chaste and perfect and Harry let it linger before pulling away. Draco looked down and bit his lower lip, worrying it between his teeth. \n“So are we together?” Harry said. \n“Well, I can’t seem to get rid of you, can I?” Draco complained.\n Harry snorted. “Thank Pansy for that. She told me to keep going until it was too inconvenient for you to ignore me.” \n“So pretty much everyone knows about us?”\n “The people that matter, I guess,” Harry said. “I don’t mind being used as a political stepping stone, as long as it’s not by you. I’ve seen who you are; I know that you wouldn’t. If it helps pave the way for your… mother, in particular, well…” Harry grimaced but shrugged. “I can live with it. As for the danger aspect, has it not occurred to you what the link could do?”\n Draco looked at him uncomprehendingly. “I like my privacy, Harry. I like not being attached to you all of the time. I find the idea that you can read my thoughts distasteful.”\n “Well, I can’t. Not unless you want me to, and even then it’s not perfect. And it doesn’t have to be open all the time. But just think: if something were to happen to one of us, we could let each other know we were in trouble through the link.” Harry took a deep breath. “If that helps.” \nThere was a long silence. Draco head jerked in a stilted nod. “It does. But you can’t go in my head without my permission.”\n “Merlin, our Cores are separated now. I don’t think I could even if I wanted to,” Harry said. He pursed his lips, annoyed. “Now, you tell me.” \n“What?” Draco said loftily, gaze sliding away. \n“Tell me you love me, too,” Harry demanded.\n Draco huffed. “Do you always have to be so blunt about everything?”\n “Tell me, Draco.”\n “I already did!” \nHarry stilled and caught Draco’s eyes with his own. “Please.”\n “Fine, I love you,” Draco muttered with bad grace. “Are you happy, now?”\n “Yes,” Harry said. “Now don’t forget it.” \nHarry stood cupped the back of Draco’s neck, pulling him to his feet and kissing him firmly. For all of his verbal reticence, Draco responded immediately, eagerly, slanting his mouth against Harry’s and opening it at the first touch of Harry’s tongue. Harry slid his tongue inside, his first taste of Draco in too long like bright bursts of joy in his mind.\n Draco wound his arms around Harry’s waist, pressing against him and Harry lost his breath at the firm line of him, at the hardness he could feel growing against his stomach. He pulled his mouth away, touching his forehead against Draco’s. “I missed you.” \nDraco stared into his eyes and a fizzle of longing swept through the link. \n“Of course you did, I’m the best thing that ever happened to you,” Draco said. Harry snickered. Draco’s mouth curled down in a small, perplexed frown and his voice was soft as he continued, “I missed you, too.”\n Harry clutched him tighter and kissed him again, deepening it as a spark of arousal work its way through his body and his prick fattened. He thrust his hands into Draco’s fine hair and walked him backwards to a desk so he could grind his hips lightly against him. \nDraco groaned. “Don’t you think we should go to one of our rooms?” He gave Harry a crooked smile. \nHarry struggled to remove his wand from his too-tight trousers. He pointed it at the door and murmured, \"Colloportus\" under his breath. The lock snicked shut. \n“I think we can stay here for a few more minutes,” Harry said, voice husky. \nAnd they did.\nHarry woke up alone, groaning at the sunlight pouring in. He waved his wand frantically to shut the bed hangings and used all of his energy to nudge the link open, sending plaintive waves of hideousness through it.\nA hand shot through the curtains to offer him a fizzling potion. Harry took it gratefully, swallowing all of it in three gulps. He felt a sudden heave of nausea and another vicious throb in his head before the feeling subsided.\n“Thanks,” Harry rasped out, relieved. “It’s safe to come in, I’m not going to sick up on you. Although you probably need to come to terms with seeing that if you’re really going to go into Healer training next year.”\n“Shut it.” Draco peeked in carefully, then drew the curtains back open and sat down on the bed. “Serves you right, anyway for drinking too much.”\n“I had less than Ron!” Harry said. Draco snorted.\n“Yes, and everyone at the party saw how that turned out. Asking Granger to marry him while falling over and nearly wetting himself. I’m sure that’s going over well this morning.” Draco said, looking rather pleased with the thought.\n“Why are you out of bed?” Harry asked. Draco was generally a deeper sleeper than he was, and since McGonagall had allowed them to re-room together back in the guest quarters, it was usually Harry who had to nag Draco out of bed.\nHe was still a little astonished that McGonagall had gone along with it. Harry had argued that neither of them would receive any privacy while sharing dorms — particularly after they had given a brief interview to the Quibbler about the bonding accident and their resultant relationship. People had started getting creative about sending mail through her wards, mostly because everyone knew Harry and Draco’s Houses. It had taken a couple of weeks consideration but McGonagall had finally given in. Eyeing him narrowly, she'd agreed that it might be best if people outside Hogwarts didn’t know where their living quarters. Draco claimed she’d given in out of impressed admiration for Harry’s sheer cheek at even asking.\nBut McGonagall, being McGonagall, had then instituted a new rule for every returning, of-age, eighth year, allowing them to move into rooms in the guest quarters if they so chose. It was a chance that most of the remaining eighth years had leapt at.  So Harry and Draco's quiet refuge of the guest quarters had given way to two dozen other students, many coupled. This led to noise and more nosiness than Harry was generally okay with, as intrusions seemed to happen in their quarters frequently when he or Draco were about to be otherwise occupied.\nOn the plus side, it led to that much-lauded interhouse unity that McGonagall had gone on about during the beginning of the year. There was a party nearly weekend in someone's room, aided by plenty of elf-wine or Firewhiskey. People were getting along great. It may have had something to do with The Chosen One living with a Slytherin, Harry conceded to himself, but whatever worked.\nHarry stretched, nudging Draco’s thigh with his foot as Draco perched on the side of the mattress. Draco’s eyes had darkened, moving over him as the sheet slid down to expose more of Harry's body, and Harry felt a little smug. \n\"Sorry,” Draco said, seeming to come back to himself. He addressed Harry’s question. “Packing. I’m leaving in an hour.”\n“Right.” Harry scowled a little. “Why are you packing? You’ll only be gone for three days.”\nHe and Draco had both stayed at Hogwarts for the better part of winter holidays, as had a lot of students. Harry had plans at the Burrow for Christmas Eve, which Draco had promised to join him for, and Christmas morning. Christmas dinner would be spent at Malfoy Manor with Draco and his mother, who had taken to telling every publication that asked how delighted she was that Harry had such fine taste in men, and how their relationship was a testament to Draco’s character.\nHe wondered if they were going to have to have an awkward chat about the amount of interviews she’d been giving, except… Well, everything she said was true.\n“I have clothes there,” Draco said. He gestured to a trunk that had been shrunk down for easy transport. “Mostly gifts for my mother.”\n“Speaking of gifts…” Harry pulled his wand and Summoned a present that he’d hidden in his own trunk. It was large and square and he'd wrapped in deep blue paper that twinkled with little stars. He shoved it into Draco’s hands. “You might want to open that early.”\nDraco looked down at it, a surprised little smile tilting his lips. He shrugged. “In that case…”  He Summoned something from the drawer on his side of the bed and handed it to Harry.\nHarry stared down at the tiny red package. “So we just open?”\n“Do yours first.”\nHarry grinned and tore open the paper, ignoring Draco’s irritated huff as it fell to the floor. Underneath was a small black, lacquered box with a hinged lid.\nHe pried it up with stiff fingers and saw a long silver chain with a flat, round, gold and silver pendant nestled inside. Harry drew it out slowly, turning the disk in his hand. On one side, there was the engraving of a holly tree that came into full bloom when he touched it, filling with golden leaves and silver berries, before resetting.\nOn the other side, the tree was caught up in iridescent flames, the fire shimmering as it consumed and replenished the tree, much like a phoenix. Harry stared down at it so long that it grew warm in his hand.\nHe felt a trickle of anxiety through the link and looked up into worried grey eyes.\n“If you don’t like it…” Draco said hesitantly.  Harry started laughing and Draco’s worried look changed to offense.\n“No, no, I love it, I really do. It’s perfect. It’s so perfect.” He looped the chain around his neck and felt the pendant settle in the middle of his chest. “Now yours.”\nDraco, unlike Harry, took his time opening the gift, gently sliding his fingers under the Spell-o-tape and unwinding the paper slowly. He stopped, staring at it with such all-encompassing shock that Harry reached over to peek at it and make sure that it still looked the same as it had before it was wrapped.\nThe painting depicted the small form of Draco standing at the edge of a pool, shaded with trees. He was looking down at the surface of the water, which rippled with different colors. The sky was a deep, intense blue and every so often, feathers would brush floated across the surface of the canvas, as if on a gust of wind.\n“I hope you don’t mind,” Harry said awkwardly when Draco stayed silent. “I gave a Pensieve memory to the artist when I commissioned it, just a few seconds worth so he’d know what I wanted it to look like. I had him add you in, after.”\nDraco carefully placed the painting on the floor on its side. He turned to Harry, eyes glassy with unshed tears.\n“You got me something that shows me…”\n“Where you keep your magic, yeah.” Harry smiled crookedly. “And you got me the same.”\nDraco leaned in and kissed him, swift and hard. “I can’t think of a gift I’ve ever gotten that I like more. Thank you.”\n“Thank you,” Harry echoed, his voice a little hoarse. He cleared it. “Have no idea how I’m going to top it next year, though.”\n“Next year?” Draco said with an elegantly wry arch of one eyebrow. Despite that, a wave of happiness flowed through the link to settle in Harry’s chest, near where the pendant lay.\n“Next year,\" he said firmly. \"I have more for this year but I guess we’ll have to save that until we get back to Hogwarts,” he added with a leer.\nDraco smirked. “We have a little time.”\n“Did you know,” Harry said seriously, “that Dumbledore always told me that love was one of the strongest forms of magic?”\nDraco’s smirk became a full-fledged smile. “Stop bragging about your power, Harry, it’s tacky.”\nHarry snorted, disguising his pleasure at the backhanded compliment, and kissed him. Draco hummed with approval, pulling away to skim his teeth over the nerves under Harry’s jawline, nuzzling his ear and making him shiver.\n“How much time do you have, really?”\n“Enough,” Draco mumbled, pushing on Harry’s shoulders. “I want to try something.”\nHarry went back against the pillows, heart pounding and cock twitching hard. He grinned breathlessly as Draco slithered down down his body.\nDraco lifted his knees so they were propped wide open. He lowered his head with a sly smile.\nAnd he kept going.\n "
}