{
    "id": "9358457",
    "url": "https://archiveofourown.org/works/9358457?view_full_work=true",
    "author": [
        "tau"
    ],
    "title": "You Stir up a McFlurry in My Heart",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "방탄소년단 | Bangtan Boys | BTS"
    ],
    "relationships": [
        "Jeon Jungkook/Min Yoongi | Suga"
    ],
    "characters": [
        "Jeon Jungkook",
        "Min Yoongi | Suga",
        "Kim Taehyung | V",
        "Park Jimin (BTS)",
        "Jung Hoseok | J-Hope"
    ],
    "additional_tags": [
        "Alternate Universe - Food Service",
        "First Meetings",
        "gratuitous abuse of the mcdonald's trademark"
    ],
    "language": "English",
    "series": "",
    "published": "2017-01-16",
    "completed": null,
    "words": "7,985",
    "chapters": "1/1",
    "comments": "292",
    "kudos": "12,304",
    "bookmarks": "3,210",
    "hits": "105,112",
    "summary": "<p>Jungkook is completely and utterly screwed the moment he develops a crush on the voice behind the McDonald’s Drive Thru speaker.</p>",
    "notes": "<p>idk please pretend there’s a street in korea where mcdonald’s and wendy’s are right across from each other or something. i probably seem kinda opinionated about fast food here but honestly i just spent a really long time staring at mcd's online menu (disclaimer: their shakes do have milk) (don't sue me)</p>\n<p> </p>\n<p> now available in <a href=\"https://ficbook.net/readfic/6374964\" rel=\"nofollow\">russian</a>, <a href=\"https://my.w.tt/08Wve2UomU\" rel=\"nofollow\">turkish</a>, and <a href=\"https://my.w.tt/uipbKvBnUY\" rel=\"nofollow\">vietnamese</a>!</p>",
    "text": "Last year, for Jungkook’s eighteenth birthday, his dad bought him a busted up 1970 Fiat 124 Spider. Got it cheap from a guy in America, spent twice the value of the car to have it brought all the way across the ocean, and then some to strip it down to its parts and rebuild it. Eight months, an equivalent amount of his allowance, endless DIY videos and a shiny red paint job later, he’d finally fixed it up good as new. Better than new, if he’s being honest. So, when he says his car is his actual child, he means it.\nThe point is, he’s five hundred thousand percent sure he didn’t go through all of that time and effort just for his car to end up being a glorified taxi for his two drunk best friends.\nYeah, he's bitter. But honestly, he's allowed to be. Because Jungkook is somehow too young to attend whatever college parties Taehyung and Jimin are going to all the time, but apparently not too young to chaperone their drunk asses across the city for fast food. So that’s why he’s here, staring at the backlit McDonald’s Drive Thru menu that’s bright enough to sear into his corneas, wondering what the difference between the Double Cheeseburger and the McDouble is because the pictures both look the fucking same.\n“Welcome to McDonald’s,” a deep, monotone voice that just screams everything but welcome drones over the Drive Thru speakers. “What would you like today?”\n“Uhh,” Taehyung slurs, leaning dangerously out the side of the car to get his face as close to the speaker as physically possible, “can I get, uh, a Mc- McFuckin’… ah, fuck it, I want the biggest McBurger you guys have, whatever the fuck it’s called.”\n“One big Mc-fuckin’-burger, for the presumably drunk guy in the back,” the voice says, devoid of any amusement or happiness or any indication that its owner enjoys life at all. “Anything else?”\n“I want the egg,” Jimin says, gesturing vaguely at the menu from the passenger seat.\n“The Egg McMuffin?”\n“No-o, just an egg,” Jimin says slowly, giggling a little. “I’m on a diet.”\nThere's a long pause. “You’re at the wrong McDonald’s then,” the voice says. Jungkook is pretty sure he can practically hear all faith in humanity disappearing out of the voice’s owner with each word. There’s a pain in it he can kind of relate to, though. Like they could be kindred spirits, maybe. “Is there anyone in this car who’s sober or am I going to have to call the cops?\n“Yes, sorry. I’m the driver,” Jungkook says. He covers Jimin’s mouth when he leans in to say something and gently pushes him back into the seat. “Sorry. My friends are… yeah.”\n“Yeah,” the voice parrots, clearly unimpressed by the apology. Jungkook winces, but the voice’s tone softens as it continues on, “You want anything too, Designated Driver-ssi? Unfortunately, we’ve just eighty-sixed the eggs as of this conversation.”\nJungkook laughs a little, then hopes that was an especially sarcastic attempt at humor instead of the voice’s obvious hatred of life bleeding through. “Just… give them a cheeseburger and the healthiest salad you have.”\n“Right.” There’s a pause, and Jungkook watches the orders pop up on the screen, makes note of the total. The voice is almost kind as it asks, “You sure you don’t want anything? Sounds like you need to treat yourself tonight.”\n“No, it’s okay. I’m… on a diet too.”\n“Sure.” He doesn’t press. Either because he doesn’t care if Jungkook is feeding himself or not, or he’s decided to stop judging Jungkook's life choices.\nProbably the former.\nWhich is fine, of course, because it’s not like he’s ever going to put himself through this again. Somewhere in the last five minutes, though, Jungkook has started to warm up to the faceless voice. Maybe, probably, he’s started to find comfort in this voice that seems to be suffering just as much as he is tonight. And maybe there’s a part of Jungkook that’s starting to wonder just what kind of person is behind those speakers, because maybe – just maybe – there’s something kind of nice starting to peek through the gruff, annoyed cracks of this stranger.\nDisappointingly, the voice is back to being curt and professional when it starts again. “Your total’s on screen. Please pay at the window.”\n“Sure, thanks,” Jungkook says, shifting back into drive, feeling more awkward than ever now that the moment’s over. “Um, sorry again.”\nThe speakers prickle with static, like someone’s sighing into it. “It’s my job.”\nRight. It’s not like the guy was giving Jungkook special treatment or anything. This is probably a normal night shift for him. “Well, thanks for not calling the cops?”\n“Sure, kid,” is all he gets in reply.\nJungkook pulls up at the window and pays, then forks out extra cash to the disgruntled-looking lady behind the window – “A tip for the speaker guy,” he explains – as an afterthought, which only works to make her look even more disgruntled. Jungkook really hopes she gives it to the speaker guy instead of turning around and pocketing it for herself, and spends the rest of the drive fighting the urge to turn the car around and drive back to check.\nJimin and Taehyung end up finishing their food before they reach home. The trip goes by without any messes, which is more for Jimin and Taehyung’s benefit than it is for Jungkook’s, because best friends or not, he’d flay them alive without a second thought if they puked in his car. A single piece of lettuce does fall somewhere between Jimin’s seat and the door, at which point Jimin begins to cry in some combination of drunkenness and that moodiness he always seems to go through when he diets, but overall, Jungkook considers the trip a success.\nOnce he’s home, he goes to throw the remaining trash away. There’s still a weight in the bag; when he reaches in, he feels something round and solid at the bottom, padded by an excessive amount of napkins, that upon further investigation reveals itself to be an egg.\nAn egg. An actual egg, from the McDonald’s Drive Thru.\nThere’s marker on the shell that’s slightly smudged, and he realizes a moment later that it spells something. As he turns it over in his hand he reads, For your diet. Treat yourself next time.\nIt’s so surreal, he laughs and swears never to go to that McDonald’s again.\n \n \nThree days later, and Jungkook inexplicably finds himself staring at the Drive Thru menu.\n“Oh, it’s you again,” that voice says, still filtered but just as deep and monotone as before. Now that Jungkook doesn’t have Taehyung and Jimin to distract him, he’s suddenly struck by how smooth and rumbling it really is.\n“How did you know it was me?”\n“Your car. Really stands out among the regular McDonald's crowd. Might have to kill you for it some time,” the voice answers, with absolutely no variation in pitch. “Thought you were on a diet, though.”\nJungkook’s head whips around so fast he’s pretty sure he hears his neck crack. “What? You can see me?”\n“There’s a camera,” the voice says drily. There’s a hint of a smile in it now too, but it might just be the horrible audio quality. “Behind you. Say hi.”\nJungkook sticks his head out the window, straining to see what the man is talking about. All he sees are confused and possibly annoyed looks from the drivers queued up behind him. He ducks back into his car sheepishly.\n“Now that introductions are out of the way, can I take your order?”\nRight, that’s what Jungkook is here for. To make an order. Not to make friends with the guy behind the speakers. “I’d like, uh, a southwest grilled chicken salad, I guess,” he says, quickly reading off the board in front of him for something that he might be able to digest. “The strawberry shake sounds good too, actually.”\n“You realize the shake defeats the purpose of ordering a salad?”\n“Aren’t you supposed to be taking my order?” Jungkook shoots back.\n“Touché,” the voice says. “But just putting this out there: if you have to poison yourself, the McFlurry is way better than strawberry. You can’t just go to McDonald’s and order any plain shake. That’s like going to Wendy’s and ordering a Frosty without any fries to dip with. You just don’t do that.”\n“…People dip fries in their shakes?”\nStatic bursts through the speakers, and Jungkook realizes the guy is laughing. Even his laugh sounds nice. “You’ve never done that? It’s better than it sounds. You should try it. Wendy’s is right across the street; you can thank me when you have.”\n“Isn’t this against company policy or something? This is like, corporate sabotage. I could report you to your superiors.”\n“What? Me?” the voice says, suddenly all sweet and faux innocence. “I would never suggest Wendy’s – which has fresh, never frozen meat – is better than McDonald’s. Why would I do that?”\nJungkook opens his mouth to say something, but doesn’t manage to get a word out when behind him someone honks impatiently. “Okay, god, I’ll get a McFlurry if you insist.”\n“Oreo or M&amp;M?”\n“Surprise me,” Jungkook says flatly, not ready to admit he has no idea what a McFlurry even is as he double-checks the oversized menu.\n“Right, one salad and one McFlurry, coming right up. Please proceed to the next window.”\n“No eggs this time!” Jungkook calls out in afterthought. He hears the voice laughing behind him as he drives up.\nHe doesn’t get an egg, but he does get handed two oversized shakes right after he puts down his salad. When he fishes out the receipt to double check, it shows he’s been billed for both – Oreo and M&amp;M – for the price of one.\nHe supposes this is what Speaker Guy means by treat yourself.\n \n \nTaehyung gives him a weird look when Jungkook mentions he’s going out to get McDonald’s and asks if he wants anything.\n“Is that code for ‘going to see my drug dealer’ or something?” Taehyung says dubiously, fixing Jungkook with a look. “You never eat junk food.”\nHe’s not entirely wrong, but Jungkook is not about to tell Taehyung why he’s actually going. Or that he’s already gone once, because Taehyung would tell Jimin and then both of them would be jumping on him over it when it’s not a big deal. At all.\nHe crosses his arms. “I can treat myself every once in a while, can’t I? Do you want something or not?”\n“Jungkook, your definition of ‘treating yourself’ is another set at the gym.” Taehyung narrows his eyes at Jungkook and looks over him appraisingly. After a moment, he finally answers, “I want twenty chicken nuggets. No wait, forty. And don't even think about stealing any – I'll know.”\n“It wouldn't be stealing if I bought it with my own money.”\n“Fine,” Taehyung huffs, pulling out his wallet and fishing two 10,000 won bills out delicately between his fingers. “Here you go. Buy yourself something too. Now you can’t say hyung never did anything for you.”\nJungkook rolls his eyes and takes the bills, all too aware of Taehyung’s keen gaze following him as he leaves. If he notices Jungkook is more eager than usual to go out, he doesn’t comment on it, at least.\nHearing the voice is a refreshing change of pace in comparison. “Forty? What, is this how you're finally planning on kicking the bucket? Choking to death on forty chicken nuggets?”\nOr maybe not.\n“It's for my friend,” Jungkook explains.\n“Uhuh. Whatever helps you sleep at night.”\n“No, really. Is it part of the employee handbook to judge your customers’ life choices?”\n“I judge everyone,” the voice says without skipping a beat. “Especially the weirdo kid who won’t leave me alone and tipped me at the Drive Thru. At McDonald's. I mean, who the fuck does that?”\n“You could at least say thank you.”\n“Yeah, thanks for the tip. Whatever. I forgot to mention last time. You didn’t have to; I get paid somewhere above minimum wage.”\n“I didn’t know if you would get it or not,” Jungkook admits. “You didn’t have to give me a free McFlurry either, so I guess we’re even.”\n“Free?” the voice says in mock confusion. “If I remember correctly, I charged you for both. I might have made an honest mistake because I'm just so bad at math, but I'm not giving out drinks for free.”\n“Thank you for being bad at math, then.” Jungkook laughs.\nAs the conversation pauses, he looks around him. There’s no one in line behind him tonight to yell at him for holding up the Drive Thru queue, so he rests his arm out the car and leans in a little closer to the speakers. There’s something kind of sad and desperate about him seeking out these fleeting conversations with the prickly, sarcastic stranger behind the speakers, and even sadder about the fact that Jungkook inexplicably feels his day brightening as he hears the sound of the voice, but somehow he can’t seem to stop himself.\n“By the way, I tried out a french fry Frosty, like you suggested. Way better than I expected.”\nA pause, then surprised laughter. “I didn't think you would. So you came back just to tell me you consorted with the enemy?”\n“Hey, you’re the one who told me how great Wendy’s is in the first place. Is that what they teach you to tell customers during training?”\n“I said nothing like that, and you can’t prove it.”\nJungkook grins. He's about to reply when another voice gets picked up by the speakers, but it's too muffled to make out what it's saying. A moment later, the voice says, “They're starting to question why the fuck some random kid in his grandparents’ fancy car has just been parked in front of the speakers talking to me, so you better pay up before I have to kick you out for holding up the line.”\n“How is that my fault? And why do I have to move? There isn't even a line. I'm the only person here.”\n“I don't make the rules. I just work here. Next window, please, before you get me fired,” the voice says sweetly, right before the speakers cut.\n“Wait! What the fuck, I haven't even finished ordering yet!” Jungkook yells back. No response. “Hey, are you ignoring me? Who's the manager here? If you don't come back and finish my order I'm going to march in there and demand to speak to your manager!”\nStill no response. He catches a movement out the corner of his eye, and glances over to see the screen has started to fill with an order. Forty-piece chicken nuggets. A grilled chicken salad, an Oreo McFlurry, and an extra-large side of fries. The only thing missing now is the egg.\n“Unbelievable,” he mutters.\n \n \nIt becomes oddly routine after that. Like some compulsion he can’t ignore, he soon finds himself at the Drive Thru just about every other day, at which point he doesn't know if he's in it for the easy food or the surprisingly good, if overly sarcastic company.\nBoth are equally bleak options.\nHe wants to think his nightly visits break up the monotony of what has to be a thankless shift. That the pain he first felt in the voice during that first night sparked some kind of sympathy deep within him, some basic human instinct to help. It's like doing a good deed for the community, making it a little brighter in his own way. Even if “the community” is actually just the one guy behind the speakers.\nHonestly though, if someone actually asked him why, he wouldn't be able to answer. But that doesn't stop him from going. Which is how his daily life starts getting peppered with enriching conversations like this:\n“You're still here?”\n“So are you.”\n“I work here, smartass. Now are you going to order or not?”\n \n \nOr:\n“I’m thinking of branching out a little. I only ever get salads,” Jungkook says, eyeing the menu. It’s still a bit overwhelming how many choices there are. He doesn’t think he’ll ever get used to it. “What would you recommend?”\n“Personally? I like Wendy’s chicken nuggets. There’s also a really good fried chicken place down the street; the owner there is nice and gives good discounts if you’re handsome and call her Auntie.”\nJungkook laughs. “Are you really that handsome?”\n“Can’t you tell?” the voice huffs, resulting in a burst of static through the speakers. He actually sounds miffed to be questioned by Jungkook, which is… kind of cute, in a way.\n“Yes, you must be very handsome, stuck behind a speaker working night shifts at McDonald’s.”\n“What the hell does that mean,” the voice says flatly, and Jungkook tries to stifle more laughter. “Hey. Turn around, punk, I’ll see for myself if you’ve got any right to talk to me like that.”\nGrinning, he waits for the convertible roof to fold to give the camera a clear view and does what he’s told, ignoring the exasperated looks he’s getting from the drivers behind him. There’s a pointed silence from the speakers in response.\n“You’re speechless, aren’t you? I’m that handsome, right?” Jungkook asks, twisting in his seat so he can pose better for the camera.\n“…Can’t tell,” the voice says gruffly, but Jungkook could swear it’s gone shy. “Shitty camera.”\nJungkook grins. “What’s the name of the fried chicken place again?”\n \n \nAnd also:\n“What happened to being on a diet?” asks the voice the nth time Jungkook finds himself staring at the Drive Thru menu.\n“Still happening. I've just been working out more to make up for the milkshakes.”\n“O-kay,” the voice says like that's the worst thing that Jungkook could have said. “They’re just called shakes, by the way. If we called them milkshakes we’d have to start putting actual milk in them.”\n“I’m starting to think you’re actually trying to sabotage McDonald’s,” Jungkook says, grinning at the speakers. “Are you going to defect to Wendy’s? You have anything else you want to whistleblow while you’re at it?”\n“Welcome to McDonald’s. What would you like today?” the voice says instead.\n \n \nJungkook's familiar with the routine now: engage in brief but friendly banter with the voice, order, pay, grab food, and go. So when they skip to steps two and three without step one, he can’t bring himself to drive to the next window.\n“Is something on your mind today? You’re being awfully… normal.”\n“It's called working,” the voice says pointedly. “Maybe it’s a foreign concept to you, since all you seem to do with your time is bother me.”\n“You? Working?”\nThere's an annoyed grunt on the other end. “I’ve been told that at specific times of the day I occasionally haven’t been doing my job efficiently enough, thanks to someone. So yes, I’m working.”\n“You seem pretty wound up. Are you sure that’s all you’re upset about?”\n“There’s the fact that you’re cheating on me with the ahjumma at the fried chicken restaurant,” the voice says, managing to sound petulant even through the usual shitty speakers and monotone. “She won't stop talking about the boy with the nice vintage car, and it’s been ruining my appetite whenever I go. Here I thought you and I had something special, and it turns out you're just getting friendly with all of the fast food workers on this street.”\n“Oh, you're special, all right,” Jungkook can't resist saying, though a part of him is still slowly catching up to what he just said because that’s the longest thing he’s ever said to Jungkook at once. “…Wait. Is this your way of calling me a slut?”\n“You said it, not me.”\n“It’s not what it looks like,” Jungkook says. “I only went because you recommended it, that’s all. It was just one time, I swear.”\n“Oh, really? What makes you think I should trust you to keep your word?”\n“You're special, babe. I wouldn't dare dream of cheating on you with the fried chicken auntie.”\nThis is a little farther than he meant to carry that joke, he thinks belatedly as he shudders at how strange the words sound sliding off his tongue. Babe. Fucking hell, he’s going crazy. What the hell possessed him to say that, of all things?\n“Eugh,” the voice agrees, and very kindly follows that up with a gagging noise. “Please don't do that again. It's weird.”\n“Yeah, definitely.”\n \n \nA few weeks later, when the voice wryly asks him, “The usual?” and Jungkook finds himself moments later sporting a large Oreo McFlurry in one hand and driving with the other, he realizes he may have a legitimate problem.\nFuck.\nHe has a usual.\nHe has a usual at McDonald’s.\nFucking fuck.\nHe doesn’t even know the guy’s name.\n“I don’t even know your name,” Jungkook says the next time he inevitably pulls up to the Drive Thru. “I have no idea what you look like, or how old you are. I don’t even like fast food, but I keep coming back here just to talk to you. What is wrong with me?”\n“I take offense to that,” Nameless Voice says, but Jungkook could swear there’s something smug creeping in his voice. “You say that like I’m some sort of predator. It’s perfectly normal to want to talk to me, Jeon Jungkook.”\nJungkook opens his mouth to retort, except– “You know my name?”\n“Obviously, Jungkook.”\nJungkook rolls his eyes, as effective as that is. “How do you know my name?”\n“It’s on your credit card, Jungkookie.”\n“Okay, now you’re just being annoying on purpose. Are you going to tell me your name? I won’t even question you about how you got your hands on my card or file a restraining order if you tell me.”\n“I don’t think so, Kookie.”\nJungkook decides not to fixate on the sudden endearing nickname or how it makes his heartbeat skip a little. Just a little. “This doesn't make you seem less like a predator, you know. How do I know you're not going to stalk me and kill me and run around the city wearing my skin on your face?”\n“You don't, Kook-ah. Maybe that's the plan. Maybe this whole time I was just aiming to stalk you and find out where you live so I could kill you and drive off in your fancy car.”\n“Okay, fine, I can accept that. Just tell me anything, please. This is so unfair,” Jungkook says, painfully aware this is something like begging. But fuck it, he’s really that desperate at this point. “The name of your first dog, the first car you ever owned, the street you grew up on, your mother’s maiden name–”\n“Those are generic security questions,” the voice says. “Why should I tell you anything if you’re obviously just planning on stealing my identity? You want my KSSN while you’re at it?\"\nJungkook huffs. “Fine. How about, what color’s your hair? You have any hobbies? A favorite book?”\n“Gray.”\n“…Gray? What, like Fifty Shades? That’s pretty wild.”\n“My hair,” the voice explains, sounding reluctant to even be doing so. “It’s gray.”\nGray. The owner of the voice’s hair is gray. What is he supposed to do with that information? “Have I just been flirting with a sixty-year-old man for the past two months? Oh my god, and I even called you babe.”\n“Yes,” the voice says in a tone that suggests completely otherwise. “You got me. The jig is up. Congrats, your prize is a free McFlurry.”\n“Well hey, a McFlurry’s a McFlurry. I guess I’ll take it, ahjussi.”\nThe voice makes a choked noise and sputters out, “Ahjussi?” and Jungkook laughs all the way to the next window.\n \n \nSo it goes like that for a while. Probably longer than it should, but it’s fine. Totally fine, because Jungkook doesn’t have a problem. Definitely doesn't have a problem. Not until he wakes up one day tied to a chair.\nIt’s exactly what it sounds like. He wakes up not in the bed he went to sleep in, but sitting upright on a chair. To add to the confusion, when he tries to get up he finds out he can’t move because there’s some sort of wire tying him down.\nHis first thought is I’ve been kidnapped, except he’s seated right in the middle of his own apartment, so unless whoever put him in this position is planning on robbing the place with him watching, he guesses not. His second thought is, was I really that drunk last night? but that train of thought leads nowhere because he definitely didn’t touch any alcohol. They got rid of all of the alcohol in the apartment after Taehyung started drunk-playing his saxophone in the middle of the night and their neighbors called the cops on them.\nHis confusion lasts as long as it takes for Jimin and Taehyung to appear in front of him.\n“Hyung?”\n“Jungkookie,” Jimin says gently, “we're staging an intervention.”\n“What the fuck,” is all Jungkook says.\nJimin looks grave as Taehyung holds up one of Jungkook’s trash cans. Taehyung tilts it to show him whatever’s in it that’s so incriminating that they had to tie him up, and Jungkook wants to bang his head against the floor. “You have a bunch of bags and four of these McDonald’s cups in here. Judging from the leftovers inside of these cups, you’ve been getting milkshakes.”\n“Shakes. Just shakes.”\nJimin and Taehyung exchange a look before they both say in comical unison, “What?”\nJungkook feels the back of his neck heating up under their scrutiny. “They can’t call them milkshakes if they don’t have– you know what, never mind. This is stupid. Untie me already.”\nTaehyung frowns. “So. You have four of these shakes in here. It’s been five days since garbage day. If we do the math, that means you’re eighty percent cripplingly addicted to McDonald’s shakes.”\n“That’s… not how math works, Tae. That’s not how any of this works. Did you really have to kidnap me for this?”\nJimin steps forward. “All we’re saying is, you never eat fast food and we’re worried about the state of your arteries, not to mention your mental state.”\n“Yeah,” Taehyung adds. “Who knows what kind of stuff they add to their food to make it so cheap and addictive? And their shakes? It’s like, liquid crack. First you have one, and then you have to have another, and next thing you know you’re selling your TV just for more. Eventually it gets so bad you get evicted, and you can't even find a new place because you spent your entire deposit on your addiction.”\n“It’s not like- not like that, okay?” Jungkook says. “I’m not addicted to McFlurries or anything.”\n“That’s what they all say,” Taehyung says, then turns to Jimin to whisper loudly, “Don't believe him when he says he can stop at any time. That's how they get you.”\nJungkook groans and looks down, wishing he could bury his face in his hands so he wouldn’t have to face… whatever this is. “I just like talking to the guy who takes my order at the Drive Thru, all right,” he says reluctantly.\nJimin blinks once, then twice at the new information. He glances at Taehyung and gestures him closer before wrapping an arm around him. They both huddle together, whispering about something Jungkook can barely make out. Jungkook feels like rolling his eyes at the pointlessly dramatic display.\n“So let me get this straight,” Jimin says once the two separate. “You’ve been ordering an unhealthy amount of fast food because you’re in love with the guy at the Drive Thru.”\n“I’m not in love with him,” Jungkook protests. “I don’t even know his name. How could I be in love with him if I don’t know his name?”\n“You don’t know his name?” Jimin echoes skeptically. Jungkook can practically see him putting the pieces together in his head, and he doesn’t like it. “Shit, have you even met the guy face-to-face? He could be like, a fifty-year-old dude. He probably preys on every cute college kid that drives through, Jungkookie, and you’re the cutest.”\n“Yeah.” Taehyung nods sagely. “He’s gotta be like, a real life catfish.”\n“What?”\n“Catfisher. He means catfisher,” Jimin amends, covering Taehyung’s mouth and looking at Jungkook meaningfully.\n“That is so wrong–”\n“Is it, though? Kookie, when he kidnaps you and your body is found in a ditch somewhere, we won’t even be able to say ‘I told you so’ because you’ll be dead.”\nJungkook wants to deny that. He does. There’s nothing he would enjoy more than proving the two of them wrong. But when he tries to, he realizes he honestly has no way to counter that. Speaker Guy has always been dodgy about his personal details whenever pressed. Knows Jungkook's name but refuses to give up his own. Even Jungkook has brought the point up before. Anyone would find it suspicious.\nIt’s not like the conclusion is crazy, or anything. Jungkook would probably come to the same idea as Jimin and Taehyung, given the amount of information they have. But he knows with every fiber of his being that they’re wrong. It’s just annoying that he can’t prove it.\n“Either way, this can’t be healthy,” Jimin goes on. “Any of it. Even if this guy doesn’t kill you, all of these shakes will.”\nJungkook sighs. “Fine, whatever. If I agree to go less, will you let me out of this stupid chair?”\n \n \nHe makes an effort. A genuine effort, just for Taehyung and Jimin. He’s not entirely sure why he’s trying, though; they’re the reason why this all happened to him in the first place. Honestly, it's perfectly within his rights to not listen to them at all, especially after they tied him to a chair just to interrogate him like some sort of criminal. But a part of him knows they have a point, and as crazy as they are sometimes, they care. So Jungkook makes an effort to follow through.\nIt takes him all of a week before he’s back at the Drive Thru.\nIn all fairness, this is probably the longest gap between visits since… well, since he started going in the first place. So there’s definite improvement there. A personal record, actually, if he doesn't count the nineteen years – give or take – before he spiraled into this hell.\nBesides, he thinks, it's not like they have to know. His biggest mistake was leaving the evidence around. He's learned. He’s going to be smarter about it this time.\nA voice that is definitely not his voice welcomes Jungkook through the speakers. “Can I take your–”\n“Where's the normal guy?”\n“–order… what?”\n“The–” Jungkook pauses, realizing belatedly that this is probably weird and all kinds of stalkerish, but it's too late to turn back because Speaker Guy couldn’t have gotten replaced, not like this, without any warning. “–the guy on the speaker who usually works this shift. He’s not here?”\nThere's a confused silence. Whether the new person behind the speakers is trying to figure out who Jungkook is talking about or trying to work out whether or not to call the police on him, he isn't sure.\n“Are you talking about Yoongi?”\n“I don’t… actually know his name. Or anything else about him, honestly. Just that he works here,” Jungkook mumbles awkwardly, starting to get reminded uncomfortably about his conversation with Jimin and Taehyung. With each passing second his shame is starting to creep back to him.\n“Is he kind of gruff? Sounds like he hates life and would probably fight you?”\n“Yeah, that… sounds pretty accurate, actually. Grumpy, sarcastic guy, weirdly obsessed with Wendy's?”\nThe new guy laughs. “You must be talking about Yoongi-hyung. Why? Did you want him to take your order instead?”\n“No, it's okay,” Jungkook says, taking a moment to process the fact that he has a name now, testing the sound of it in his mind. Yoongi. It's fitting. It rumbles, just like Yoongi's voice. “Just- just wondering if he was still here or if he defected to Wendy’s already.”\n“Ohh, you must be Jungkook,” the guy says, but before Jungkook can figure out what that means, he continues, “He's taking some time off. Got hurt earlier and started bleeding all over the place. It looked pretty bad and was a pretty serious health concern for the kitchen so we made him go home. We had to practically drag him out, kicking and screaming.”\n“Is he okay?”\n“Oh, sure. Knowing him, he’s probably going to be totally fine and is just looking for a reason to take time off anyways. Though, come to think of it, he’s been showing up more than usual for the past couple months.”\n“Oh… that’s good to hear,” Jungkook says, unsure what the guy expects him to say to that.\n“He should be back soon, don’t worry,” the guy continues. “It’s so cute that you’re worried about him, though. Yoongi will really appreciate it.”\n“Um,” is all Jungkook can say, because his mind is racing. Trying to figure out at which point, amongst the friendly bickering and sarcastic jabs, he started to worry about the voice.\n“I’m Hoseok, by the way!” the guy chirps sunnily. “Sorry I’m not Yoongi, but you’ll just have to put up with me for now.”\n“Right.” Jungkook clears his throat. “Hi, Hoseok. I’ll have my usual.”\nHoseok laughs at that before Jungkook catches himself, and Jungkook sputters an apology at the mistake. “Don’t worry about it,” he says easily. He’s friendly in a way that makes Jungkook smile, despite himself. He’s friendly, he’s bright, and his charisma radiates with more intensity than the fucking Drive Thru menu.\nIn short, he’s the exact opposite of Yoongi.\n“By the way, Jungkook,” Hoseok says after Jungkook finishes listing out his order and starts to put his car back into drive, “if you asked him out, he wouldn’t say no.”\nJungkook nearly accelerates into the wall.\n \n \n“Back on your diet?”\nThe voice sounds off today, but it's Yoongi’s for sure this time. Jungkook is one part relieved, two parts conflicted. He isn't quite sure what it is, or if it’s just because he hasn’t talked to Yoongi in a little over three weeks, but something just feels different tonight and he’s not sure how he feels about it yet.\n“No, my friends staged an intervention. No more nightly McDonald’s trips for me.”\n“Oh.” He’s not positive, but Yoongi sounds… disappointed. “Probably for the best; you were right on track for type 2 diabetes with all those shakes.”\n“Don’t act like you weren’t waiting for it to kill me so you could take my car.”\nYoongi laughs, and it strikes Jungkook that this is the first time he’s talking to him as Yoongi, not as the voice. It feels like everything’s changed, even though nothing really has, and for some crazy reason he feels nervous.\n“So, uh, how’ve you been? I heard you got hurt,” he says conversationally, suddenly and painfully unsure where he’s hoping to go with it.\n“Yeah, you know… workplace accident. It happens, but I'm all good now,” Yoongi says, like he’s trying to move on from that topic as quickly as possible. And then, more panicked: “How did you know?”\n“The other guy– Hoseok, he said his name was. He told me.”\n“Hoseok.” There’s a groan. “What did he say?”\nThat I should ask you out, Jungkook’s mind supplies immediately, followed by heat prickling his cheeks at the memory he’s been trying to forget. From his tone, Yoongi seems to already suspect as much, but Jungkook really isn't ready to face the implications of it yet. “Just… that you’d gotten hurt and would take time off. I thought you’d finally had enough of this place, honestly.”\n“If only,” Yoongi says sullenly. “Then I could probably stop trying to wait here every day for you to show up.” A long pause. “Fuck. I did not mean to say that. Just pretend you didn’t just hear that, fuck.”\n“Sure. Of course. I'm just going to forget about you admitting you look forward to seeing me.” Which he won't. Because he can't. Because maybe, deep down he was hoping this entire time Yoongi looked forward to talking to Jungkook as much as Jungkook looked forward to talking to him.\nAs Yoongi put it so succinctly: fuck.\nSomeone behind him is honking at him, but he’s distracted by a thought that suddenly strikes him, too insistent to ignore. “Is this why he seemed confused about the fact that you were coming to work more frequently than usual?”\nThere's another silence. It stretches on long enough Jungkook wonders if Yoongi might have just spontaneously decided to abandon his post and Jungkook altogether. “I knew it,” Yoongi groans finally. “Hoseok said something weird to you.”\n“So it's true?” Jungkook presses on. “You've been waiting for me.”\n“I work here. I’d be in this exact spot even if you didn’t show up. You're the one who would come here every other day like some sort of creep,” Yoongi mutters. “You said it yourself: you don't even like fast food.”\n“I like you,” Jungkook almost says. But something stops him before he can. Maybe it's the realization that he's never quite said those exact words, never even imagined himself saying them. That this entire time, he's never even come close to conscious of what exactly this has all been about, even though the answer has always been right there.\n“I’m going to take your silence to mean you don't disagree with the fact that you’re a huge creep.”\n“Don't think I've forgotten you’re the one who’s probably some sixty-year-old man hiding behind the speakers. You wouldn’t even tell me your name,” Jungkook protests.\nThere’s a long, drawn-out sigh. “I'm twenty-four, not sixty. Happy now?”\n“Maybe,” Jungkook says. “Does this mean I have to call you hyung now, Yoongi?”\n“Wait, how old are–” Yoongi stutters to a halt. “Fuck. He told you my name too?”\n“Yep. Now we’re even, Yoongi-yah.”\n“Punk,” Jungkook hears him say faintly. Then, louder: “Hyung is fine. Call me anything weird and I’ll punch you.”\n“That’s going to be pretty hard to do through these speakers, hyung.”\n“Yeah? Try me. I’ll go out there myself if I have to.”\nJungkook grins, suddenly tempted by the promise. “You just want an excuse to see my handsome face again.”\nYoongi says something, but Jungkook can’t make out the words. The honking is back, louder this time. There might be some yelling too. “What did you say?” he asks.\n“Nothing. Something I’m going to regret.”\nJungkook has a feeling he knows the answer anyways. “You don’t need an excuse, you know,” he says. “What time do you get off?”\nYoongi laughs.\n \n \nYoongi doesn’t look anything like he imagined.\nLike Jungkook were in a drama, it goes like this: he takes his order and settles down inside. Can't keep himself from wanting to burst out of his own skin in anticipation, glancing every minute towards the direction of the kitchen, at every movement around him wondering if maybe one of the uniformed people shuffling around is Yoongi, then down at his phone to check the time. Rinse and repeat.\nFast forward an hour – the longest hour of his life. The restaurant has nearly emptied, everyone is slowly filing out, and the staff around him is starting to look at him funny. And then, right at two minutes past the hour, he hears someone call out his name. When he looks up and locks eyes with the source of the voice, he knows. With every fiber of his being, he knows it's him.\nYoongi waves at him hesitantly, and it feels like everything happens in slow motion from there.\nYoongi pulls off his hat and messy gray hair spills out into a fringe across his forehead. He runs a hand through his soft-looking hair, and smiles the most radiant smile Jungkook has ever laid eyes on. When he walks across the restaurant to Jungkook, he strides, all confident swagger that would make Jungkook's knees weak if he weren't sitting.\nWhen Yoongi reaches Jungkook, he pulls out the chair across from him, seats himself down, and softly says, “Hi.”\nNice to finally meet you, he should probably say. Hi, is acceptable too. Instead–\n“Your skin is way too nice for someone working at McDonald’s,” Jungkook blurts out, unable to stop himself from staring. Yoongi practically glows under the fluorescent lights, and his skin looks so smooth he wants to stroke it.\nOkay. Maybe he is the creep here.\n“Um, thanks?”\n“I mean- my friends kept telling me how sketchy this all was, you know? I was imagining this big greasy guy with like, acne and shit,” Jungkook continues. Fuck it. It's too late to be embarrassed now. “You’re- you’re cute.”\nYoongi’s lip twitches. “Thank you?”\nIf Jungkook were to make a Venn diagram of all the traits he was imagining Yoongi to have and what traits Yoongi actually had, there would just be two circles trying their hardest to be as far away from each other as physically possible. From his deep, rough voice, Jungkook had been imagining someone big, tall, and definitely intimidating. Probably some sort of delinquent, judging from his occupation and dyed hair. The man in front of him is noticeably shorter and thinner than Jungkook, and the most intimidating thing about him is the dark slant of his eyebrows.\nIf Jungkook had only one word to describe Yoongi, he'd have to say beautiful. Ethereal. Heaven on legs.\nOne word isn’t enough.\n“Don't take this the wrong way,” Jungkook is still saying, “but I honestly wasn't expecting much. I mean, who works night shifts at McDonald's and slaves behind the speaker if they have a face worth showing off? But shit, I don't think I would've had a chance if you did show off your face.”\n“You're pretty cute yourself, for someone who eats as badly as you do,” Yoongi offers, his mouth curving bashfully and his ears turning darker pink by the second.\nJungkook thinks he might be hallucinating the freckles dusting his cheeks.\n“So,” Yoongi starts, chewing at the inside of his cheek and his eyes fixed on where his fingers are tapping at the table, “what now?”\nWhat now? Jungkook echoes in his mind. What does he even want? He doesn't know if he expects this to go anywhere yet. Up until a few weeks ago, he didn't know Yoongi’s name. Just ten minutes ago he didn't even know what Yoongi looked like. Didn't know if they'd work out. Still doesn't know.\nFor now, all he can see is the immediate future, and he supposes that's okay.\nJungkook watches Yoongi's face – the flutter of his eyelashes, the delicate curve of his lips. Takes it all in and hopes for the best. “I know I basically just met you and this is sudden, but… I want to hold your hand. And take you out somewhere. Oh– and show you off to my friends, for daring to doubt me.”\n“We can do that.” Yoongi glances down at Jungkook's hand and cautiously reaches across the table. His fingers are long and slim, but they fit nicely between Jungkook's own. “Where do you want to take me?”\n“I haven't thought that far yet,” Jungkook admits. “You wanna go to Wendy's or something?”\nYoongi makes a face. He glances down and shakes his head. “I'm still in my work uniform. I can't be seen in enemy territory like this.”\n“As if,” Jungkook scoffs. “I know you’re a traitor at heart. I'm sure you would be perfectly happy consorting with the enemy.”\nYoongi laughs, and Jungkook might have thought his laugh sounded nice before but shit, does he look good while laughing too.\n“Okay, no fast food subterfuge on the first date. Noted,” Jungkook says to cover up how much shakier he feels, how Yoongi's presence is chipping away at his nerve. “How do you feel about fried chicken? I know just the place.”\n“I'm sure that Auntie would like that.” Yoongi smiles, then looks shyly down at where their fingers are just barely linked. “I would, too.”\n \n \n“No way,” Taehyung gasps. His jaw nearly reaches the floor. “You’re really him? Jungkook didn’t just hire some dude to act as Creepy Speaker Guy?”\n“The name’s Yoongi,” Yoongi says. “Yes, it's really me.”\n“No way. You're supposed to be all gross and predator-y so I could laugh at Jungkook for being catfished by some greasy old guy,” Taehyung says. “Not- not… this. You're not supposed to be cute.”\n“Now I see why you’re friends,” Yoongi says drily to Jungkook, who can only shrug back and hope Jimin and Taehyung can get over the novelty that is Jungkook’s Date soon.\nA little wishful thinking never hurt anyone.\n“What he’s trying to say is, we’re excited to finally meet you,” Jimin says, elbowing Taehyung, who sulks away while muttering under his breath, “Why can’t I find a cute date at McDonald’s?”\n“It’s… nice to meet you too,” Yoongi says. Under his carefully neutral face, he looks a little like a deer caught in headlights. Jungkook wants to laugh.\nJimin beams. “We’ve heard–” He falters for a second, his face falling. “–uh, not a lot about you. But we’ve heard of you.”\n“Yes.” Taehyung nods vigorously. “We are so happy you’re not a serial killer.” He pauses, considering that for a second with a frown. “Okay, never mind, you could still be a serial killer who’s just biding his time, trying to get our complete trust before you cruelly snatch our Jungkookie’s life away from us. I’m onto you, Yoongi.”\nYoongi’s lips curl. He shakes his head at the two of them, looking exasperated, and Jungkook takes that as their cue to leave.\n“Anyways!” he exclaims, tugging at Yoongi’s sleeve and gesturing at the door with his chin. “We’re going out now. On a date. Where I won’t be serial killed. Right, Yoongi?”\nYoongi is already backing away towards the door. He nods slowly. “Right.”\n“Don’t forget to use a condom!” Taehyung calls out after them.\nJungkook hopes he’s not as red as he feels as they close the door behind them.\n“So… yeah. My friends.” he waves his hand vaguely. “I hope that didn't put you off. I realized halfway through that I probably should have warned you.”\nYoongi hums. “Are they the same friends who asked for the McBurger and an egg?”\nJungkook laughs. “Yep. The very same. They also kidnapped me because they thought I was addicted to McFlurries.”\n“What?”\nJungkook grins and reaches for Yoongi’s hand, squeezing it a little once their fingers slot together, reveling a bit in the warmth between them. “That's a story for next time. You know, if there is a next time.”\nYoongi smiles. He shifts on his feet. “If you want there to be.”\n“I think I've made it pretty clear that I do–”\nHe doesn’t manage to finish his thought before Yoongi drags his fingers through Jungkook's hair and pulls him down to press a kiss against his lips, soft and fleeting. It’s not enough but at the same time it’s too much, too much for Jungkook to even comprehend anything besides the feeling of Yoongi’s lips against his own.\n“Okay,” Yoongi says when he pulls away. He dips his head, but Jungkook catches the beginnings of a blush on his cheeks. He’s pretty sure his own face looks much, much more incriminating, and he can barely understand what Yoongi is saying much less stutter out a reply.\n“O…kay?”\n“Next time,” Yoongi promises before pulling Jungkook in again."
}