{
    "id": "9582161",
    "url": "https://archiveofourown.org/works/9582161?view_full_work=true",
    "author": [
        "everythingsace"
    ],
    "title": "The Little Things",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "Gen"
    ],
    "fandoms": [
        "Iron Man - All Media Types",
        "Captain America - All Media Types",
        "The Avengers (Marvel) - All Media Types"
    ],
    "relationships": [
        "Peter Parker & Tony Stark"
    ],
    "characters": [
        "Tony Stark",
        "Peter Parker",
        "James \"Rhodey\" Rhodes",
        "Steve Rogers",
        "Clint Barton",
        "Scott Lang",
        "Wanda Maximoff",
        "Friday (Marvel)",
        "Sam Wilson (Marvel)"
    ],
    "additional_tags": [
        "Tony Stark-centric",
        "Tony Stark Has A Heart",
        "Tony Stark Needs a Hug",
        "Tony Stark Gets a Hug",
        "Hurt Tony Stark",
        "Tony Stark Has Issues",
        "Tony Stark Feels",
        "Protective Peter Parker",
        "Precious Peter Parker",
        "BAMF Peter Parker",
        "Tony Stark Gets A Cat",
        "his name is Tich"
    ],
    "language": "English",
    "series": "Part 2 of Thank God For Peter Parker",
    "published": "2017-02-05",
    "completed": null,
    "words": "5,438",
    "chapters": "1/1",
    "comments": "327",
    "kudos": "15,629",
    "bookmarks": "1,943",
    "hits": "162,821",
    "summary": "<p>Peter Parker has unintentionally saved Tony Stark several times, but every once in awhile, it’s entirely on purpose.</p>\n<p>(A.K.A. Peter finally punches Steve Rogers in the face.)</p>",
    "notes": "<p>I heard your pleas and I enjoyed every step of the delivery. Peter finally punches Steve.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>I hope you enjoyed it! Feel free to send me any ideas for future stories, and please let me know if you noticed any mistakes! Kudos + comments are always appreciated.</p>",
    "text": "Peter Parker has unintentionally saved Tony Stark several times, but every once in awhile, it’s entirely on purpose.\n\nI.\n\nTony really wants a drink. He’s ready to upend every last bottle in his liquor cabinet, and he has a  lot of liquor.\nHe shouldn’t. He knows he shouldn’t, because it could end very badly when he’s in this state, but to be fair, that’s never exactly stopped him before.\nIt’s very, very tempting, but he’s trying to be sober. He’s trying very, very hard, but the nightmares aren’t going away, and he just wants to sleep, just a few hours without falling or being attacked by Captain America or being waterboarded or seeing his parents die. He wants to be left the fuck alone by his subconscious so he can just get some goddamn rest.\nHe could drink, but when he’s thinking about all these things, he knows it’s a bad idea.\nBut he could forget for a while.\nUgh, but last time, he got dangerously close to using that damn burner phone. He should just get rid of that thing.\nWell, no, he shouldn’t. He can’t. It’s the only sign he has that he didn’t  entirely  fuck up, even if he certainly fucked up a hell of a lot.\nHe will never call. Never. He’s told himself repeatedly that he will never call. He might be lying to himself, but that’s not really new.\nHe shakes his head, looking longingly at the alcohol. He wants sleep. He just wants to fucking sleep. He doesn’t want anything else, just a fucking break. He hadn’t slept for more than a couple hours at a time in a week.\nSighing, he reaches for an old bottle of scotch.\nHe jumps as a phone begins to ring. Not  the phone, but his own. He glances up and FRIDAY says, “It’s Peter Parker, boss.”\nHe nods. “Uh, right.” He looks towards his phone stiffly, before awkwardly climbing to his feet. He stumbles towards the phone and answers it, switching it to speaker before falling into a seat tiredly. “Hey, kiddo,” he says sluggishly. “What’s up?”\n“Hey, Mr. Stark! I was wondering if you could maybe help me with my homework? I’m working on calculus, and I’m not sure what to do, and Aunt May can’t remember anything past geometry.”\nTony stares at the phone for a second. “Uh. Yeah, sure, ‘course. What’re you workin’ on?” he asks, vaguely aware that his words are sort of slurring together, despite the fact he hasn’t had a drink yet. He sets down the scotch, pushing it aside.\n“L’Hopital’s rule. I, like, I sorta get it, and I’ve got my notes, but I kinda zoned out for a minute, and I don’t know how she did a part. Here, I’ll send you a picture of the problem.”\nAlmost immediately, a picture comes in, and Peter continues talking: “And so she said that this would be one to the power of infinity, but how would it be infinity? Wouldn’t it be zero considering…”\nThe teenager trails off. Tony squints at the hologram in front of him, then at the phone. He opens his mouth to ask Peter if he’s plugged in the wrong limit, but then Peter groans. “Fuck, I’m a dumbass. Never mind.” He continues to grumble, and Tony can picture the teenager angrily scrubbing away his previous attempts.\nTony chuckles. “Glad I could help,” he says, and Peter’s muttering just increases in its vulgarity.\n“Yeah, yeah,” Peter mumbles. “Thanks,” he adds, despite the fact Tony had literally done nothing.\nTony rolls his eyes. “See ya, kid,” he says, smirking just a little as he swipes away the call.\nTony looks up from his phone and to his surrounding workspace. He breathes out with a loud puff, before standing up. “Alright, FRI, gimme something to do.”\n\nII.\n\nTrudging to his bed, Tony tries to shut out all thoughts about his day. He’d spent every fucking hour working through each line of the Accords, trying to assemble  something  that Rogers would at least spare a glance to.\nIt was fucking difficult, and it was exhausting. Arguing with council members over where to put a damn comma was incredibly draining, and the genius is welcoming any sleep he can get.\nHe falls asleep as soon as his overworked head hits his pillow.\nHe’s not exactly overjoyed to see Howard Stark standing in front of him. The man fixes him with a glare. “Anthony,” he says, a reprimand already on his tongue.\nTony sighs, flicking his eyes towards the ceiling. He’s in the workshop back in the old family mansion, somewhere he’d only seen in photographs and dreams for years. Everything is just how he remembers it. Old, useless blueprints litter the room, and tools lie across the floor where he’d last thrown them. He hasn’t been here since he was twenty-one.\n“Dad,” he says flatly, letting himself drop on one of the abandoned seats in the workshop.\nHoward steps forward, but instead of criticizing Tony like usual, his face begins morphing. After a few seconds, it’s Obadiah standing in front of Tony, and Tony can’t move.\nHis heartbeat picks up and he has to watch as, over and over and over again, Obadiah reaches out and extracts the reactor from his chest. He watches himself be murdered again and again, until it’s  not Obadiah, but it’s Steve.\nThe shield is held high above him, before coming down and it doesn’t hit his armored chest, it hits his unguarded face, crushing every bone, every vessel--\nHe shoots up as he hears Black Sabbath start blaring beside him. “Wha-?” he starts, his chest heaving, before he realizes it’s his phone. He fumbles for it, before answering the call and holding it to his ear.\nHe barely lets out a strangled, “Huh?”\n“Uh, Mr. Stark, I- uh, I have a little bit of an emergency.”\nTony’s shaken mind clears a little as he recognizes the guilty tone in Peter’s voice he’s heard one too many times. “What’d you do, Parker?” he asks, waving his hand so FRIDAY turns up the lights.\n“So, uh, I was doing my thing, y’know, uh, fighting crime, and--”\nTony raises an eyebrow. “Peter.”\n“I found a cat.”\nTony stares blankly at the phone before sighing. Very loudly. “A cat.”\n“Yeah.”\nTony rubs the lines on his forehead that have just kept getting worse over the years. “Explain?”\n“I’d just stopped this guy from mugging another guy, and I just heard these really sad and pathetic meows coming from the alley, so I--”\n“Are you telling me you seriously just saved a stray cat from an alley?”\n“...Yes.”\n“Oh, my God,” Tony says, staring at his bedroom wall incredulously. How has this become his life?\n“C’mon, Mr. Stark, Aunt May isn’t gonna take in a cat! She’s allergic!” Peter pleads, and Tony sighs, finally getting out of his bed.\n“And what am I supposed to do?” Tony asks, walking over to his closet to pull on a shirt. “Can’t you just take it to a shelter?”\n“Well, first, he’s a  he.  Not an  it. ” Tony’s feet freeze in their tracks, and he gets the feeling he knows where this is going. Rhodey did this exact same thing in their third year of MIT. “And… I kinda like the little guy.”\n“Peter--”\n“No, listen, hear me out! You get an adorable cat--”\n“Peter--”\n“--I get to visit him whenever I want--”\n“That’s not--”\n“--You’ll always have someone to spend time with if Rhodey and Vision are out,  and he’s not a dog, so you don’t even need to take him out for walks or anything! C’mon, Mr. Stark! Please!”\nTony groaned, rubbing his hand across his face. “I--” He was interrupted by the  smallest  little  mew  he’d ever heard. He paused, his mouth dropping open. That just isn’t fair. He shakes his head.  No.  “Peter, I don’t have ti--”\nThe stupid cat meowed again, but this time…\nTony narrowed his eyes, walking towards his bedroom door where he’d heard the sound. He threw it open, revealing a disheveled Peter Parker, holding a ball of black fur.\nTony stared at the cat, before slowly bringing up his gaze to look at Peter, who at least has the decency to look guilty. “Peter,” he says, a hint of a warning in his voice.\nPeter ignores it. “Please, Tony! Please! I named him T’Challa.”\n“Are you  kidding--” \n“But come on, he looks just like him!” Peter lifts up the kitten excitedly, and the damn thing does its stupid, adorable  mew again.\nTony crosses his arms, but his eyes don’t leave the cat. “This is a very bad idea.”\n“Yes! You hear that, T’Challa? You’ve got a new home!”\n“We’re not calling him T’Challa.”\n\nIII.\n\nThe phone is taunting him. That stupid vision Wanda had put in his head before Ultron was cycling through his head on repeat.\n“You could’ve saved us.”\nHe  tried. \nSome nights, he hears  Rhodey saying those words, and then he can’t sleep for days.\nThis is one of those times.\nHe doesn’t want to call Steve. Not really. But sometimes he feels like he just needs to scream at Steve. Scream because Rhodey got hurt, because Steve didn’t tell him, because Steve didn’t listen, because he’s  sorry  . He knows that he doesn’t really have a reason to be sorry, but sometimes-- sometimes, when he’s sitting in the common room while Rhodey’s in therapy and Vision is moping somewhere, when he’s sitting there  alone… He misses them.\nHe misses his prank buddy. He misses his science bro. He misses his freaky assassin friend. He misses the only person whose personality was as loud as his own. He misses his childhood-hero-turned-friend.\nHis hand reaches towards the phone, picks it up, and he stares at it.\n\n They don’t want you. They chose what they wanted. \n\nTony swallows past the lump in his throat. He looks at the phone in his shaking hand. He wills it to still. Sighing, he rubs his other hand across his face, then his temples.\nGod, he just wants them back.\nHis hands hover over the buttons of the phone, but before he can do something he’d probably regret, he hears the elevator doors open behind him.\nHe twists in his seat to see Peter walk in with a crumpled suit in his hands.\nTony’s eyes widen and his hands fumble with the phone before he shoves it in one of the drawers of the workstation. He turns around again, trying not to look guilty. “Hey, kid, what’s up?”\nPeter eyes him suspiciously before shrugging. “Uh, do you think you could make my suit, uh- not flammable?” he asks, and Tony can now see the scorch marks littering the suit.\nTony’s eyes narrow. “That’s what happens when you enter flaming buildings, you know.”\n“I was getting people out of there!” Peter said indignantly. “And you’re one to talk, Mr. I-flew-a-nuke-into-space!”\n“That was years ago, and it was different!”\nPeter simply quirked an eyebrow. “Yeah, okay, Mr. Stark.”\n\nIV.\n\nTony hasn’t left his workshop in over a week. He’s slept for about six hours, scattered evenly across those eight days, and he’s consumed nothing but coffee and granola bars.\nHe would leave the shop-- he isn’t even working on super important things anyway-- but he’s the only one in the tower so there’s no point. Rhodey’s visiting Mama Rhodes, Vision’s visiting Wakanda to discuss the Accords, and- well, that’s it, really. There used to be seven other people living here, eight if you include Pepper, and now there’s two.\nTony sighs, spinning a washer on the desk in front of him. He sets his chin on the desktop, before tilting his head so his cheek is flattened by the metal surface. He picks the washer up once it falls and sets it off again, his eyes staring blankly at the spinning motion.\nHe feels sort of numb, a feeling that isn’t exactly rare to him at this point, but it doesn’t change the fact that it always makes his body feel cold.\nSitting up, he listens to the washer rattle to a stop, and he lifted his gaze to stare at the wall blankly. Being alone is not a good idea for Tony, especially when he’s in this sort of mood. Before, there was almost always someone around. He could usually find Clint at the archery range, or find Steve or Natasha on the common floor or in the gym, or he could find Bruce in his lab, or Thor in the kitchen if he was around-- he could usually find someone.\nTony will always be incredibly grateful for Rhodey and Vision, but they have their own lives and they can’t be at the tower all the time. Vision spends a lot of the time working on the Accords or at the compound or even occasionally helping with SI, and thanks to Tony, Rhodey has to deal with physical therapy for a large chunk of his time, and not to mention, he’s still working with the U.S. military in the ways he can. Tony can’t blame them for that, and he never will, but he just doesn’t want to be alone anymore.\n\n “Meow.” \n\nTony moves his head and he registers the small fur ball that was Tich (a solution to the confusion between the kitten and the king), sitting on the sofa in the corner of the workshop. Tony blinks rapidly, trying to snap himself out of his daze. When he focuses on the cat again, Tich is giving a small yawn, stretching out his tiny little limbs.\nTony watches as the cat curls in a ball before giving him a look. It isn’t  necessarily a glare, but it’s pretty damn close.\n“What do you want?” Tony asks, raising his eyebrows.\nThe kitten has grown a considerable amount in the past three weeks, definitely has more meat on his bones, but he’s still a considerably small cat. He looks even smaller curled up, and he emits another small sound.\n          “You know that’s unfair,” Tony says, crossing his arms. Tich doesn’t break eye contact, but instead stretches and gives a small yawn.\n           Tony feels a warmth in his chest, and it helps to dampen the cold feeling everywhere else. He sighs, watching the cat for a moment. Finally, he rolls his eyes. “Fine. But you’re very whiny,” he says, getting up from his seat.\n          Tich preens as Tony sits down next to him and scratches behind his ears. The kitten stretches his back, and Tony scritches across the soft fur.\n           Tich cranes his neck up to look at Tony and meows, before darting onto Tony’s lap. Tony stills as the kitten crawls across his thighs before settling between them with a yawn. Tony slowly relaxes, allowing a smile. He carefully leans back and rests his hand on Tich’s head, feeling stupidly warm.\n          He supposes he should thank Parker for finding the little guy.\n\n1.\n\n“No.”\n“Mr. Stark--”\n“No! They can stay at the compound, I don’t fucking care, but I’m going to stay away from them, and they are going to stay away from me. That was the deal.”\nThe king on the other end of the line is silent for a moment. Then, “Very well. I will make it clear to them that they are to stay away from you.”\nTony lets out a relieved sigh, swallowing thickly and nodding. “Okay. Thank you, your highness.”\n“Of course,” T’Challa says, and the call ends.\nTony exhales slowly, trying to gather himself as he rests his hands on the edge of the kitchen table.\n“Mr. Stark?”\nTony looks up to see Peter walking in, Rhodey next to him. Rhodey leans against the wall for support, looking at Tony with concern. Peter mirrors the expression, frowning with his eyebrows furrowed.\nTony shuts his eyes, rubbing a hand across his face. After steadying his breathing, he drops his hand and looks at Peter and Rhodey, who are still watching him carefully.\n“They’re coming. Pardoned. They’re going to stay at the compound.”\n “  What?  ”  The question is asked by both of them, and Tony sighs, dropping into a chair.\n“It’s all done. They’re finally pardoned. Which. Great. The world needs the Avengers, whatever, I just--” His breath catches, and he lets it out in a shudder. “I’m not ready to see them. I don’t-- Not-- and especially--”\nHe hears the sound of Rhodey approaching, and he makes a mental note to make the braces quieter. A familiar hand settles on his shoulder. “You don’t have to, Tones.”\n“Yeah. I’ll punch Rogers in the face if he tries anything,” Peter offers, and Tony lets out a startled laugh.\n“Thanks, Pete, but I don’t think we need any more conflict,” he says, though he appreciates it greatly.\n“Yeah, well, I didn’t ask for permission,” Peter says. “Plus, Rhodey probably wants to do the same.”\nRhodey hums his verification, and Tony lets out another chuckle. “You’re a bad influence on him,” Tony says, shaking his head.\nRhodey shrugs, sitting next to Tony. “I think I can live with that if I get to punch Rogers in the face.”\n“Rhodey,” Tony whines, but Rhodey talks over him.\n“Seriously, if I could just give that dick a black eye, I would be the happiest man alive.”\n“You two are ridiculous.”\n“Nuh-uh,” Peter says, sticking his tongue out in true teenage fashion.\nTony rolls his eyes as Rhodey settles his arm around his shoulders, letting himself relax. He has these people, he’ll be okay.\nNope, nope, not okay, he’s not okay at  all. \nT’Challa may have promised to keep the Others away, but he isn’t exactly able to keep that promise when he’s busy ruling another country.\nThe Others stay away the first couple weeks, but one day, Tony’s sitting in the commons of the tower, sipping at a mug of coffee, when FRIDAY says in an alarmed voice, “Boss, the Avengers-- the  captain’s Avengers- have entered the building.”\n“What?” Tony demands, shooting to his feet. “Why’d you let them in?”\n“The security cameras in the front are still broken from this morning’s attempted kidnapping,” FRIDAY says, and Tony winces. He put off the camera repairs because he had to first take care of a malfunction in Rhodey’s braces. “I’ve refused access to the elevators, but that’s not stopping them from using the stairs.”\nTony lets out a sharp breath, trying to stop a verging panic attack. “O-okay, FRI, don’t- don’t let them- don’t-”\n“Boss, Hawkeye has his explosive arrows to get through any obstacles in their path. I’m sorry, I can’t-- Boss!”\nTony slips to the floor, his hands reaching for his chest. “No, no, they can’t- I can’t see them. I can’t, FRIDAY, I can’t-”\n\n Meow. \n\nTony lets out a quiet gasp as the kitten makes his way towards him, looking at him with concern.\n“T- Tich,” Tony says, reaching, and the cat hurries its pace and bounds across the floor until he reaches Tony. He sets his paws on Tony’s knee, tilting his head curiously.\n“I don’t want them here,” Tony says, his voice choking off. “I can’t,” he whispers, and Tich’s ears twitch. The kitten quickly leaps into Tony’s lap, gently nuzzling his stomach.\nTony winces as he hears a faint explosion. “FRIDAY, tell the staff to go home. Structural integrity will be fine, but I don’t want anyone to panic.”\n“Boss, you’re panicking.”\n“I’m  aware,  FRIDAY,” he snaps, then winces. Tich looks up at him, his tail twitching. “Sorry,” he mutters.\n“Completely reasonable, boss,” Friday says, her tone reassuring.\nTony lets out a shuddering sigh and gently cups the back of Tich’s head. The kitten nuzzles his stomach again, purring softly.\nHe flinches as another explosion is heard.\n“Boss, I’m trying--”\n“I know,” he says, his eyes shut and his voice tight. FRIDAY’s probably locking down everything she can, but Tony designed those arrows. They’re strong enough to get through anything FRIDAY puts up.\nTich meows, and it’s a distressed little sound, and the genius feels a pang of guilt. It’s  his  fault this is all happening. It’s  his  arrows, it’s  his  fault they’re breaking in, it’s  his fault that the security isn’t strong enough.\nAnother explosion, and Tony can start to hear the faint sound of hurried footsteps, slowly growing louder. He curls in on himself and Tich, who purrs soothingly. He buries his fingertips in the kitten’s fur, trying to calm himself down, if not for his sake than for Tich’s.\n“Staff has left the building, boss,” FRIDAY says, and Tony takes some comfort in that information.\nHe tries to steady his breathing, but it grows more and more rugged as he hears Rogers and his team approaching.  Stay away, stay away, stay away-- \n“Tony? FRIDAY, where’s Tony?”\n“You have no business seeing him, Rogers,” FRIDAY replies, and Tony notes the deliberate absence of Steve’s formal title.\n“FRIDAY,” Steve says, sounding exasperated.\n“Rogers,” FRIDAY says, sounding cold.\nSteve obviously gives up, as he just continues to shout for the shaken engineer.\nHe hears another blast, and it’s so close he knows it’s the last one they need. He’s shaking, and he really doesn’t want them to see him like this, but he can’t-- he can’t--\nHe screws his eyes shut as he hears Rogers’s team burst into the room, but he quickly wrenches them open when he feels Tich leap from his lap.\n“Wait--!” He reaches his hands out, but Tich has already bounded up to stand in front of…\nTony looks up to see Steve, Clint, Scott, Sam, and Wanda. (He doesn’t know where Bucky is, but hopefully away from conflict. He has a feeling that Bucky probably needs to have some peace for once.) They’re all staring at Tich, looking baffled.\nTich glares at the intruders and attempts a menacing growl, but seeing as Tich is an adorable kitten, it comes out more like a soft grumble. Still, Tony’s heart tumbles and he whispers, “C’mon, Tich.”\nThe cat glances at him before glaring at Steve’s team for a moment more, but then he turns around and joins Tony again, nuzzling his hand.\n“That’s a cat,” Clint says, and if Tony was in a better mental state, he’d make a comment about his astounding observation skills.\nSteve blinks slowly for a minute, before seemingly remembering why they’ve broken in. “Tony, you can’t keep avoiding--”\nThere’s a loud fumbling in the next room, and Tony immediately knows who it is. He’d installed a sliding window that FRIDAY could automatically opened if a certain teenager came swinging.\nThe intruders look startled and spin towards the door, only to be met with the door slamming open.\nPeter storms into the room, his mask pushed down to show his fury, and Steve opens his mouth to say  something, but he never gets to, because he is quickly met with a right hook to the jaw.\nTony’s jaw drops just as Steve clutches his own and the others burst into outcry.\n“Peter!”\nPeter turns to him, his eyebrows raised, looking entirely unimpressed as he shrugs. “I told you I would.”\n“I didn’t think you’d actually do it!” Tony says, trying not to pay attention to the outraged looks standing behind Rogers.\n“Hey, I promised Rhodey! Also, when he gets back, I’m totally telling him I beat him to it.” Peter turns to Cap and points at him. “Fuck you, by the way,” he says, before turning to Tich and crouching. “Hey, Tich! How are you? You’re getting tubby, has Mr. Stark been spoiling you?” he asks, scratching behind the cat’s ears, causing a happy purr.\n“Peter, you can’t just--”\n“Yes, I can,” Peter interrupts, glancing up at him only to return his attention to Tich. “Rhodey  and Pepper gave me permission.”\n“But I didn’t!”\n“No offense, Mr. Stark, but you probably wouldn’t let me punch whoever kills you.”\n“Wait, why am I being killed? Why can’t I die peacefully?”\n“Because you’re a billionaire and you don’t protect yourself.”\n“I have a flying suit of armor.”\n“Which you fly into danger at every opportunity.”\n“That’s not--”\n“Hello?”\nTony looks up to see Clint glaring at them, along with everyone else. That is, besides Steve, who’s busy clutching his bleeding nose, and Sam, who’s making sure he’s okay. Peter looks at the archer, unfazed.\nClint waves his arms for a moment, then just says, “What the fuck?”\nPeter glares at him. “Weren’t you supposed to be retired anyway? What happened to spending time with your family?”\n“The Accords weren’t right!” Clint says, crossing his arms.\n“One, they wouldn’t have affected you if you didn’t come out of retirement every five minutes, and two, how the hell is accountability not right? Did you even  read the Accords? Why did you get into this mess in the first place? You had a family to take care of!”\n“You have no--”\n“Same for you,” Peter says, turning to Scott. “You also had a family that you just dropped! Did  you read the Accords?”\n“I--”\n“ I  did!” Peter says, glaring at them. “Yes, they weren’t perfect, but they were amendable, not that any of you bothered to even  try  to listen when people pointed that out to you  . ”\n“Kid, listen--” Sam starts, but cuts himself off when Peter glares at him.\n“And you just follow him like a blind puppy! Did it not occur to you that just maybe accountability is important? That maybe the people of the world deserve to be safe? Or did you just hear Rogers say no and immediately follow him?”\nSam says nothing, just flounders for a moment, and that’s enough of an answer.\n“None of you thought about your actions. You would all blindly follow Captain America into the jaws of death just because he’s Captain America.” He looks at the captain. “So many of us looked up to you, and you deserve  none of it.” \nSteve sighs, wiping his face. His voice comes out nasally. “Look, I’m--”\nPeter stands up, his jaw stiff and eyes narrowed. “Not sorry. Fuck you, Steve Rogers. Fuck your stupid phone. Fuck your letter. Fuck your apology. Fuck your hypocrisy. Fuck  you. ”\nTony sighs, standing up, lifting up Tich when he cries in protest. “Peter--”\nPeter spins on him, jabbing a finger in his direction. “Tony. Shut up.” Tony falls silent, and Peter looks back at Steve and his team. “How  dare  you believe that you had the right to keep the truth from him? You act like you’re on this moral high horse all the time, but you’re a regular person who fucks up and you need to know that. You claim to protect the little people, but you ignore  one hundred and seventeen  countries full of those little people, because you think you know better than them? Not to mention, you mistreated a man who did nothing but give and give to you for  years! You blame him for Ultron, while you happily bring in the girl who supported Ultron and was the one who planted the idea in Tony’s head in the first place, and--”\n“She was under HYDRA’s influence!”\n“Which she volunteered for!” Peter shouts, looking ready to punch Steve again. He spins on Wanda, who’s quick to flick out her magic. “You volunteered for a  known Nazi organization! ”\n“I was young, and HYDRA promised that I could get revenge on Stark for killing my parents,” she defends, as if that’s helping her case in the slightest, but her magic flickers away.\n“You mean his  weapons  that killed your parents? His weapons that have been repeatedly verified that he had no control over? He wasn’t firing the missiles, he was making them, and it was Obadiah Stane who was dealing them in the first place! And guess what?” Peter says, glaring at her. “You may have been young, but don’t act like that excuses your actions. My uncle Ben died when I was young, and yeah, I wanted revenge, but I didn’t jump up to join a Nazi-terrorist organization. I didn’t fuck with a man who was already struggling with PTSD. I didn’t try to raise an AI that would kill humanity!” He turns to Steve again. “You blamed him for Ultron when he was just trying to make the world a safer place! Did any of you ever bother to ask  why he built Ultron, instead of just fighting and yelling at him?” He points at Wanda. “Maximoff planted the image of you guys dying and blaming him for it in his head. He saw all of you dead, and he wanted to stop that from happening.\n“And of course,” he adds, turning to the captain once more. “You berated him for hiding things, while  you refused to tell him the truth about his parents! You knew that his parents were killed by the Winter Soldier, and you thought you could keep that information to yourself?”\n“I thought it would be--”\n“You didn’t have the right to decide, Rogers! That was  Tony’s right! It was never yours, but again, because you thought you could do no wrong--”\n“I didn’t want him to get hurt!”\n“And how the hell did that turn out?” Peter snaps. “You left him in a dead suit in Siberia,” he says coldly.\n“He was going to kill Bucky!”\n“No, he wasn’t!” Peter shouts. “You and I both know that Tony could have killed Barnes in one fucking shot, but he didn’t! He held back, because he wasn’t going to kill Barnes. You, however, you never hesitated!  I saw the footage from the HYDRA base. You slammed your stupid shield into his  head! Do you even know how much brain damage that could have caused?”\n“I--”\n“And then you crushed the reactor! Tell me,  Captain, why do you think Tony blew off Barnes’s arm?”\nHe’s silent.\n“Because Barnes touched the reactor. He tried to  tear  the reactor from the suit, and you fucking let him, and you  knew  that was a trigger for Tony! You knew about Afghanistan, about Obadiah, you fucking knew, and you just--” Peter’s words choke off, and Tony watches in horror as tears form. The teenager wrenches his eyes shut for a moment, hot tears escaping. After a moment, he looks up, revealing angry, bloodshot eyes. “  Fuck you, Rogers. Fuck you.  Now, get the  hell out of this building, because I already called the cops, and they’re gathering around this tower as we speak.”\nSteve and his stupid team look at each other with alarm, before Steve finally gives a stiff nod. They all rush for the exit, and FRIDAY gives them a quick, “Let the door hit you on the way out.”\nAs soon as they’re gone, Peter slowly turns to Tony, who quickly realizes that  he’s crying as well.\n“I-- I came as quickly as I could. FRIDAY told me that they were breaking in, and I was nearby so I called the police and I tried to--”\n“Peter, thank you,” Tony says. “I don’t…”\nPeter gives him a small smile, quickly stumbling across the floor to wrap the genius in a hug. Tony lets out a sigh and relaxes into the familiar warmth. (It’s funny. He never really considered himself much of a hugger until Peter came around.)\nPeter sighs. “I’m sorry.”\nTony pulls away enough to look Peter in the eye. “Sorry for what?”\n“I’m sorry that you’ve had to deal with them for so long. You’re the greatest person I know, and they-- they treat you like a doormat, like they can just walk all over you and you’ll still be there when they get back, and they just-- you deserve so much better.”\nTony lets out a watery chuckle, but Peter just frowns.\n“I’m serious.”\nTony gulps, and he nods stiffly. “I know. Just…”\n“Don’t worry,” Peter says, smiling slyly. “One day, you’ll get used to people loving and caring about you. For now, I’ll just keep hugging you until it’s drilled into your brain.” With that, he throws himself back onto Tony, and Tony lets out a startled  oof before returning the embrace. Tich, feeling left out, quickly joins them by stepping on their feet.\nThen, after a minute: “Did you really have to punch him in the face?”\n“Absolutely.”\n \nLater, after FRIDAY shows him the footage of the encounter, Colonel Rhodes runs as fast as his braces will carry him to the living room where Tony’s helping Peter with his homework, gives Peter a high-five, hugs Tony, and curses the existence of Steve Rogers. Also: “Can’t believe you beat me to it, kid. Next time,  I’m breaking his nose.”\n\n\n"
}