{
    "id": "972233",
    "url": "https://archiveofourown.org/works/972233?view_full_work=true",
    "author": [
        "mommymuffin"
    ],
    "title": "Throw Away the Key",
    "rating": "Not Rated",
    "archive_warnings": [
        "Creator Chose Not To Use Archive Warnings"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Teen Wolf (TV)"
    ],
    "relationships": [
        "Derek Hale/Stiles Stilinski"
    ],
    "characters": [
        "Stiles Stilinski",
        "Derek Hale",
        "Scott McCall (Teen Wolf)",
        "Sheriff Stilinski"
    ],
    "additional_tags": [
        "One Shot",
        "Feral Derek",
        "Magical Stiles Stilinski",
        "Scenting",
        "Cuddly Derek"
    ],
    "language": "English",
    "series": "",
    "published": "2013-09-19",
    "completed": null,
    "words": "5,861",
    "chapters": "1/1",
    "comments": "62",
    "kudos": "6,177",
    "bookmarks": "819",
    "hits": "70,865",
    "summary": "<p>Stiles knew it was stupid to go to the hunters’ headquarters all by himself, so when he finds himself caught, he can really only blame himself. </p>\n<p>It shouldn't surprise Stiles when the situation quickly goes from bad to worse as the hunters throw him to a feral werewolf waiting to tear him apart.</p>\n<p>Sucks that it's Derek, though.</p>",
    "notes": "<p>I feel really bad for being so slow on finishing the second part of the \"Shakespeare Was a Wolf\" series and I am sorry to anyone who is ever so patiently waiting for it. To show how sorry I am, please have this (much shorter) Sterek story in the meantime. I am working on part two, I promise!</p>\n<p>So, this story popped into my head and popped right out (in record time, no less), because my mind is often wont to wander down the path of Feral Derek. It is such an intriguing path, that one. And this story had been niggling at the back of my brain for a while now I think. Also, since I'm rewatching Teen Wolf from the beginning with my roommate, it somehow wound up being kind of set in between season one and season two?? Or something??? I'm not really sure. Let's just call it canon-divergent and leave it at that, shall we?</p>\n<p>Please enjoy the story.</p>\n<p>(And thank you for your patience to anyone who is waiting for the sequel to \"A Wolf By Any Other Name\"!!)</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Thanks for reading!</p>\n<p>http://mommymuffin.tumblr.com/</p>",
    "text": "Stiles knew it was stupid to go scope out the newly arrived hunters’ suspected HQ all by himself. \nHe did it anyway. \nWhat could he say? He was worried. There hadn’t been much activity from them which was even more concerning than if there had been. No action meant they were planning. And that couldn’t be good.\nBesides, it was only “suspected” and really what were the chances the hunters knew who he was? If they caught him, they’d think he was just some human kid, hanging out around an abandoned building on a Friday night like all the cool kids do. Right? \nWrong.\nThey knew who he was.\nAnd how.\n“Well, well, well, if it isn’t the wolves’ human,” one of them says, stepping up behind Stiles in the most menacing manner possible, rifle resting on his shoulder.\n“Uh. What?” Stiles says, straightening up. “What are you talking about? And why do you have a gun?”\n“Nice try, kid,” he sneers, “but we know you run with the wolves of this town. We don’t know why. But, we know you do.”\n“Uh,” is all Stiles says in response. Not his best moment.\n“Get inside,” the hunter commands, kicking at his legs.\n“Hey! Watch it!” Stiles makes a show of protesting the rough treatment, turning in a full circle to see if he has an out. He doesn’t.\nThe hunter shoves him into the main room of the warehouse and announces, “Look what I caught,” to the others.\nThere are six of them in total. Damn. That’s kind of a lot.\nOne of them walks over to the man, who has Stiles by the collar of his shirt, and grins. \n“You caught their human. Good work. I’d say he would be excellent bait for the Alpha, but...well, we’ve already caught him.”\nStiles’s eyes go wide. They had Derek?\n“That’s right,” the lead hunter says, eyes gleaming in sick joy at the look on Stiles’s face. “Caught him just a few hours ago. It’s perfect, really, that you came along. Now we have the perfect opportunity to test out how well the drug works.”\n“What drug?” Stiles asks.\n“Marsh here is a chemist,” the leader says pointing a thumb over his shoulder at one of the men still leaned over the table covered in papers and maps. “He’s been developing a drug that makes werewolves lose control completely. Just makes them the mindless killing machines they already are really.”\n“They’re not,” Stiles snaps. “And what would you want with something like that?”\n“We can’t kill a werewolf unless he deserves it,” the leader replies, smoothly. “We have to stick to the code, you know.”\n“Cheaters,” Stiles says.\n“Winners,” the man corrects. “As you’ll soon see with your Alpha.” \n“He’s not my Alpha,” Stiles says, stubborn. \nThe hunter shrugs, seemingly unconcerned with the declaration.\n“It doesn’t matter, really. I’m sure it will still be devastating for him, when the drug wears off and he wakes up standing in a pool of your blood.”\nStiles jerks back, tries to get away, but two of them are already dragging him toward a greasy metal door, the kind with a big sliding latch in the middle.\n“You can’t do this. I’m human!” Stiles yells. “You’re supposed to follow the code!”\nIt creaks open and there’s a surprising amount of light coming from the room for how dark the rest of the warehouse is. But, then again, it’s not so surprising, considering hunters can’t see in the dark, but werewolves can.\n\"We are following the code,\" the leader calls out to Stiles. “It’s just such a shame your own Alpha lost control and ripped you apart, when you were just trying to help him.”\n With a sneer the other hunters shove Stiles through the door.\n\"No!\" Stiles shouts even as the door swings shut. He hears the sound of a heavy metal latch being slid into place and his fists uselessly hit the thick door. \"Dammit.\"\nStiles's anger at the hunters vanishes like smoke when his ears register the low growling coming from somewhere behind him. Slowly, he turns over his shoulder. The sight of Derek, wolfed out and angry, is always enough to send a shiver down Stiles's spine. But, now, the savagery in Derek's expression makes all the blood drain from Stiles's face.\n\"Derek...\" Stiles says, gently, heart in his throat. He makes slow, careful movements to turn around. One hand sneaks into his pocket while the other makes a futile, placating gesture. \"It's me. Stiles. You know me. Just Stiles. No danger here. Just weak, little, ole human Stiles.\"\nDerek snarls and snaps his teeth at him.\n\"And that doesn't even matter,” Stiles says, swallowing thickly. “You don't care. You just want to kill me. Great.”\nHis feet want to move, but he knows that running will invite chase and that's the last thing he wants. What he wants is to get Derek contained, preferably before the werewolf even has a chance to lunge at him.\nToo late, he thinks as Derek charges him.\nStiles squeezes the jar in his palm as hard as he possibly can and believes with the desperation of a man who is about to lose something even more dear than his life.\nA deafening noise like the sound of a chip bag being popped open fills the room and Derek bounces off the mountain ash barrier hard. A perfect circle ten feet in diameter has formed around the wolf. The jar is empty when Stiles pulls it out to look at.\nDerek rounds on the magic user, even more furious now. His eyes have never been redder. He runs at the barrier again, only to be thrown back with equal force. He gets to his feet, throws his head back, and lets out an earth-shattering howl. Stiles falls to his knees, covers his ears, shut his eyes.\nWhen he opens them again, Derek is glaring at him intently, maliciously. He knows Stiles is the one responsible for his imprisonment and judging by the rage in his eyes he can't wait to get out of it so he can tear Stiles to pieces.\n\"I know you're mad now, Derek,\" Stiles says carefully. \"But, I think you'd regret it, if I let you kill me. So, we’re just gonna wait this out and hope the drug wears off before the hunters open the door and notice I am distinctly not dead.”\nDerek growls and then settles down on the ground to wait. Stiles isn’t sure if it’s because he understood him or if it’s just coincidence. Stiles also sits down to wait. He notices Derek’s eyes never leave him.\nEven half an hour later Derek hasn't looked away from Stiles once. It's really starting to creep the teen out.\n\"Guess they figure you've killed me and don't feel the need check,\" Stiles says from his position leaned up against the wall. \"They probably won't open this door again until they're ready to do something else with you.\"\nDerek doesn't appear to be registering anything Stiles is saying, anything he's said in the past thirty minutes. It doesn't do much to stop Stiles from talking to him.\n\"Do you even know you're you right now? I mean, like, are you consciously aware that you're a person in there somewhere and that you know me and usually try not to kill me, in spite of the constant threats? Or is it just gone? 'Cause I'm thinking it's the second option. Man, what'd they give you?\"\nDerek doesn't respond. His eyes are glued to Stiles.\n\"God, you're creepy,\" Stiles complains, rolling onto his side, still keeping Derek in his peripheral, but not direct line of sight. Something crackles in his pocket and he reaches into it curiously. It's a packet of Nutty Bars.\n\"Oh, yeah! Forgot I put those there. Sweet, a snack.\"\nStiles peels back the wrapper and Derek sits up straighter, clearly curious. Stiles doesn't know what to do with that. Do feral werewolves even eat peanut butter and chocolate? Is chocolate bad for them like it is for dogs? Stiles shakes his head. That's absurd. Scott eats chocolate all the time and he's never any worse for wear for it.\nStiles eyes Derek. He looks a lot less wolf and a lot more puppy in that moment and Stiles can't help, but commit the image to memory. He proffers a bar to the man. \"Want one?\"\nDerek lowers his head and growls briefly before edging forward to sniff at it. Stiles’s hand is on the other side of the barrier, but Derek, who has clearly learned exactly where the invisible wall is, because he doesn't even bump his nose on it, apparently gets a good whiff. He swipes for it, but can't get past the mountain ash. Stiles frowns.\n\"You'd take my freaking hand off, wouldn't you?\" He sighs and tosses the snack up into the air and over the line. \"Catch.\"\nDerek does.\nHe nibbles the end of the bar before practically inhaling it. Stiles’s pictures his hand being subjected to the same treatment and winces. \nDerek’s attention zeroes in on the one in Stiles’s hand. Apparently, he likes Nutty Bars. And isn’t satisfied with just one. When Stiles doesn’t immediately offer it to him, he starts to growl. Stiles rolls his eyes. \n“You’re kidding, right? What am I supposed to eat? You want me to go hungry?”\nIf the timber of Derek’s growl is any indication, the answer is “yes, screw you.”\n“Ugh. Fine,” Stiles says and tosses up the other bar. \nThe growling cuts off abruptly as Derek snatches it from the air. Stiles crosses his arms and sulks.\n“Jerk,” he says. \nDerek hesitates. He eyes Stiles, then the Nutty Bar, and then, Stiles again.\nHe holds it back out to Stiles, arm jutting out sharply.\nStiles startles. This could be a trap. Derek could just be trying to get Stiles to reach over the barrier so he could actually bite Stiles’s hand off.\nOr he could be learning to be human again.\nStiles eyes him warily. Derek seems to realize his hesitance and in a move that scientists would have gone nuts over if Derek were a lab chimpanzee, mimics Stiles and tosses the Nutty Bar up and over the line.\nStiles catches it (barely) and blinks at Derek in surprise. He’s beginning to think that—once he’s calmed down—Feral-Derek is nicer to him than Normal-Derek.\nDerek is watching Stiles, waiting for him to eat it. Stiles pauses and then breaks the bar in half and tosses a piece over to Derek. \nDerek catches it and looks like he doesn’t know what to do with it anymore. \nStiles gestures between them, biting off a hunk of Nutty Bar, and mumbles, “Sharing. It’s a beautiful thing, bro.”\nDerek still looks reluctant, so Stiles rolls his hand in a go-on motion. \n“Eat it. It’s for you. Out of the kindness of my heart.”\nDerek slowly lifts the bar toward his mouth and never taking his eyes from Stiles’s face, eats it. Much slower than the last one.\nStiles nods. “Cool.” And munches on another bite.\nAnother forty minutes later, Stiles is bored and tired and Derek kind of looks like he may be at least the former of those two. He’s a lot less hostile, regardless. So, at least there’s that.\nStiles lays down on the floor again, facing Derek this time. Derek watches him interestedly and after a brief moment lays down and mirrors Stiles. Stiles raises his eyebrows at that.\nThat’s interesting.\nExperimentally, Stiles reaches out and places his fingertips just at the edge of the mountain ash.\nDerek does the same.\n“What are you doing?” Stiles asks, smiling slowly. \nHe moves his hand to the left a few inches and Derek’s hand follows it. Then, he moves it back to the right and Derek tracks it right back.\nStiles giggles and then is embarrassed he made that noise. Derek doesn’t seem bothered by it. If anything, he looks interested in it.\n“Are you playing with me?” Stiles asks. “You are such a weirdo...”\nThe sentiment, however, does not stop Stiles from playing with Derek in kind. He moves his hand left and right; lifts it a few inches off the ground; wiggles his fingers; waves them in a fluid motion as if he were slowly tapping them on a desk. Derek follows each movement with his own fingers. The claws at the tips of them glint occasionally, reminding Stiles that Derek was trying to kill him just over an hour ago. Now, though...Now, Stiles isn’t sure of anything anymore. Maybe he’s won Derek’s wolf over and it was really just that easy to do. Maybe his wolf is bored enough to be playing with the human in a way that doesn’t involve teeth.\nDerek perks up suddenly, cocks an ear toward the door. Stiles glances behind himself, but can't discern anything. Then, the lock starts sliding out of place on the other side and Stiles scrambles to get up. He goes around the other side of the barrier, putting Derek between him and the hunters, even though Derek can't do anything from behind the ash’s wall. Derek is on his feet growling and Stiles is still trying to decide if releasing Derek is a good idea or not when the door swings open.\nGun barrels appear through the door before anything else, clearly ready to put Derek down if he moves to attack. A confused, \"What the hell?\" comes through next.\n\"He's still alive!\" one of the goons yells, staring at Stiles in disbelief.\nThe man glances down and notices the lines of mountain ash, then. \"He's magic!\" he shouts and the others pour into the room. Their weapons go to their shoulders or hanging near their sides, the threat of Derek ripping them open currently null and void.\nStiles returns their leader's gaze with a sharp look and the man chuckles.\n\"We underestimated you,\" he says.\n\"Don't beat yourself up about it. Most people do,\" Stiles says levelly.\n\"I'm wondering what a clever, little boy like you is planning to do next, though. You don't seem to have a lot of options.\"\n\"I never do,\" Stiles says and the toe of his shoe is at the edge of the ash line, \"but I've always played it a little risky when it’s down to the wire.\"\nThe man is watching his foot with the eyes of a hawk. \"Don't be foolish, young man. You're smarter than this.\"\nStiles shrugs, says, \"I'm really not as smart as everyone thinks,\" and his sneaker disrupts the only thing separating everyone in that room from a messy end.\nThe hunters raise their guns as quickly as humanly possible. But, Derek isn't human. And he’s too fast for them. A few bullets fly, but they don’t hit their target. The leader's throat is the first to go and the remaining men do not take long after. A disturbingly large pool of blood forms, encircling the men and eerily mimicking Derek's own entrapment earlier. But, Derek can step out of this circle—and he does.\nHe stalks toward Stiles and Stiles is screwed and he knows it. The mountain ash is scattered around the room and he doesn't have the power to call it back to him to use again. He's weaponless and any hope of getting to one of the felled hunter's weapons is shot due to the fact that Derek is blocking them and Stiles really doesn't want to have to shoot Derek anyway.\nHe crouches down, sliding against the wall and watches Derek's approach until the very last second. Stiles tucks his head away when Derek is on him and screams uselessly. He's surprised when he doesn't start bleeding to death immediately. Cautiously he peeks up at Derek. Derek is looking at him with a pained expression on his face.\n\"Um...\" Stiles says and pulls his head up to look at him better. \"Hey, there, buddy...You okay?\"\nStiles isn't sure what's going on, but hopes against hope since Derek isn't killing him right now, he’s not planning to.\nDerek bends down to sniff Stiles's hair and Stiles flinches so hard it startles both of them. Derek blinks at him and Stiles doesn't have anything to say for once in his life.\nThen, Derek seems to have made up his mind and he stoops to yank Stiles up and over his shoulder. Stiles lets out a yelp, but powerless to stop the Alpha, he sags against Derek’s body and lets himself be carried out of the miserable, little room.\nIt doesn't surprise Stiles when Derek takes him to the Hale house. Even in his most primitive state, where everything is instinct, this is still his home. It probably always will be.\nMaybe that's why Derek always seems like he doesn't belong anywhere. Because to him, he doesn't have anywhere left to belong.\nStiles is not pleased when Derek dumps him into the middle of a charred bedroom upstairs and promptly proceeds to try to tuck him into a mess of sooty curtains and sheets.\n\"No, Derek. No. This is not healthy. I'm going to die of ash inhalation here.\"\nDerek pays him no mind.\nOnce Stiles is securely entrenched in the blackened mess (and resigned to his fate), Derek crawls in after him and curls up around him.\nStiles blinks.\n\"Um, what...? I'm...I'm not really sure what you're doing...\" Stiles attempts to move an arm.\nDerek rumbles. And it's not a growl. Not exactly. But, Stiles recognizes it for the warning it is.\n\"But, I'm staying right here. Yep. Not moving an inch. Got it.\"\nStiles sighs and his breath ruffles Derek's hair. It causes the wolf to snuggle closer, tucking his head right up under Stiles's chin. Stiles jabs him gently with his chin and hopes that is seems like a gesture of affection and not aggression or something. Derek's mouth is literally at his throat. Now would not be a good time to anger him.\nDerek lets out a short, noisy breath through his nose and Stiles thinks that there should be a word for something between a huff and a snort.\nHe rubs his chin back and forth across the top of Derek's head for lack of anything better to do. His hair is soft and thick and Stiles is suddenly thankful Derek won't let him move his arms so he doesn't run his fingers through it like he's allowed to or something.\nDerek lets him for a minute or so, then jerks up suddenly and roughly rubs his face against Stiles's cheek.\nStiles squirms. \"Oh my god, I think you just gave me the worst case of stubble burn in the history of ever. And we weren't even making out. How is that fair?\" Stiles freezes. \"Uh, I mean...not that I want to make out with you or anything. Like at all. I mean, you are godlike in your hotness, but I wouldn't, I mean...I'm not...\" Stiles trails off. He's made himself flustered and now he's desperately trying not to notice that Derek is touching him everywhere, which is only the hardest thing he's ever tried (and failed) to do in all his life. Because truthfully he does want to kiss Derek. Just wants to full-on attack his mouth in hot, messy kisses and alternatively press soft, sweet kisses everywhere in equal measure. Stiles knows his face is red and he's glad Derek's not aware enough to know or care why. \"I don't even know why I'm defending myself. You can't understand me.\"\nDerek tilts his head, gauging Stiles for a moment. Then, he leans forward and lightly bites Stiles's jaw. Stiles jerks back, or at least tries to, the best he can when he's the filling in a blanket burrito.\nDerek has pulled back to observe Stiles's strange reaction. He goes back in to nip him again, this time pressing his whole body forward and into Stiles’s.\nFlustered is no longer the word Stiles would use to describe himself.\n\"Derek, what are you doing? Stop it,\" Stiles protests. But, he can't even lift his arms to push Derek back and even if he could he doesn't think it would do any good, not with Derek like this.\nStiles breaths in and it's shuddery and gasping and he's not sure if it's from arousal or fear or maybe both. No, definitely both, he thinks as Derek's body pushes down onto his more heavily.\n\"Derek, stop,\" Stiles pleads and something in his voice must reach Derek's addled mind, because the wolf pulls back and stares at him for a long moment. Eventually, he climbs off of Stiles completely and goes and sits in the far corner of the room, huddled and dejected.\nStiles takes the opportunity to free his arms, but when Derek looks at him sharply from over his arms crossed on his knees, Stiles thinks twice about freeing his legs. The two stare at each other quietly for a moment.\n\"I'm sorry,\" Stiles says, suddenly, even though he's not sure what he's apologizing for or why he's bothering doing it, when Derek can’t understand him. \"I just...you scared me...\"\nDerek doesn't react, only continues to look straight at him. Stiles knows he's not understanding any of the words, but he does seem to interpret tone of voice pretty spot on.\n\"Look, I...\" he starts sincerely. \"This is too complicated a topic to try to work out with you when you're like this, so just...stop huddling in that corner like a kicked puppy and come back.\"\nStiles holds out an arm and Derek's eyes travel to it briefly before looking back at Stiles's face. He's still hunched over and seems to not be making any move toward returning to the nest.\n\"Please?\" Stiles pleads and it sounds genuine and broken. His other arm comes up to accompany it and Derek moves then. Lightning fast he bounds back to Stiles on all fours.\nStiles accepts him into his arms and jabs his chin into the top of Derek's head again when the wolf is close enough for him to reach. Derek kicks his feet back into the covers and Stiles yanks up a piece to cover Derek's shoulders and his own arms securely wrapped around them. They're holding on to each other more tightly than before.\n\"Sorry,\" Stiles whispers.\nDerek turns his face to breath into the crook of Stiles's neck before resting his cheek back on the teen's chest. Stiles thinks that's werewolf for sorry.\nHe'll take it.\n~~~\nWaking up because the sun is too bright is not Stiles's preferred method of waking up. That is, however, exactly how he finds himself greeting the next day. Derek is still heavy over him and he's practically breathing in the other man's hair from how close it is. Stiles groans when he realizes he doesn't even know where his phone is and that if that much sun is streaming in through what's left of the window, his dad has probably already called him at least once. As Stiles had thought ahead to tell his father he was spending the night with Scott, hopefully it's still early enough that the Sheriff has only called once, simply assuming they slept in, when no one answered. Which is exactly what he would tell his father happened. After all, it's the truth. They slept in.\n\"They\" just isn't Stiles and Scott right now.\nHe's almost positive he would give his father a heart attack and thusly put him in an early grave if he were to tell him that he and Derek Hale hadn't set an alarm, oops.\nSpeaking of Derek, Stiles's groan apparently woke him and now the werewolf is shifting on top of him, groggy and slow and still half asleep by anyone's guess.\nThe body above him freezes and Stiles has a fleeting moment of joy that the drug has worn off before he's abruptly filling up with dread. Normal-Derek is not going to be happy about waking up next to Stiles, even though Feral-Derek is the one that did this in the first place. Which is exactly the case Stiles will plead.\n\"Uh...Hey, Derek. Morning,\" Stiles says, trying for cheerful and missing by a mile.\nDerek's eyes find him and Stiles can't help the involuntary swallow as his throat suddenly constricts.\n\"How ya feeling?\" Stiles asks, when Derek doesn't say anything. Stiles starts to wonder if the drug is actually completely out of his system, when he just keeps staring at Stiles, wordlessly. Huh. Maybe Normal-Derek and Feral-Derek aren't so different after all.\n\"Fine,\" Derek says and Stiles is relieved that it's over.\n\"That's good. No lasting effects. Awesome. So, how much do you...remember?\"\nDerek flashes an angry look at Stiles and Stiles throws his hands up in defense.\n\"Just asking so I can fill you in on what happened if I need to. Judging by the look on your face, I'm going to go with you remember everything though, so...that's good.\"\nStiles knows his heart is racing, knows Derek can hear it, can feel it under him. He can't stop it though, he's too embarrassed about last night, too scared of how Derek's going to react.\nDerek is still just staring at him. Stiles is really starting to miss Feral-Derek right about now. Ridiculously, he was easier to communicate with. The wolf Stiles could at least read, his expressions and his body language giving away tells for what he was thinking. But, Derek is like a statue even at the best of times. Stiles wishes he would at least blink.\n\"Sorry,\" Derek says suddenly and all Stiles can do is blink at him. An apology was pretty much the last thing on his list of things he was expecting from Derek.\n\"Um. For what? I mean, it wasn't really your fault.\"\n\"Yes, it was,\" Derek says standing and Stiles is simultaneously relieved and remorseful he does. He turns away from Stiles and Stiles finds himself staring at the tense line of his back.\n\"No, it really wasn't. They drugged you, dude. And really, it's all okay, because I'm a magical bad ass and managed to keep you from killing me.\" Stiles blanches. \"Sorry about trapping you by the way. That was probably not cool for you in the state you were in.\"\nDerek does that half-snort, half-huff thing through his nose again as he regards Stiles from over his shoulder. \"It wasn't,\" he says and Stiles winces.\n\"Sorry. I probably did a lot of things you didn't like last night.\"\nDerek rounds on him suddenly and Stiles wishes his legs weren't trapped so he could at least have the option of trying to run away, pointless as it might be. The werewolf looks like he's going to say something, but reins it at the last second, fists clenching tightly.\n\"What?\" Stiles asks, heart jackhammering away. Then, he remembers their hand game and grimaces. \"If this is about the hand thing...I'm sorry. I...we were both bored, okay?\"\n\"It's not about the hand thing,\" Derek says darkly.\n\"Then, what is it about?\" Stiles snaps, patience running thin.\n\"You...!\" Derek starts, but stops himself, trying to find better words than whatever he was going to say. \"You let my wolf get all over you!\"\nStiles doesn't see how that can possibly be the better word choice.\n\"Sorry...?\"\nDerek makes a frustrated noise and explains, \"You smell like me now.\"\n\"Okay? And...?\" Stiles still isn't getting why this should matter.\n\"And now my wolf wants you, too, okay?!\"\nStiles doesn't know what to do with those words at first, but then he latches on to a very important keyword here.\n\"Too?\" Stiles asks. \"What do you mean by too?\"\nDerek bares his teeth at him, clearly thinking that's an acceptable way to answer someone, and Stiles flails out of the mess of fabric around his legs. Stiles is on his feet surprisingly quick for him, but this is important and he doesn't have time for clumsiness now.\nThe teen gets up in Derek's space and demands, \"You want me?\"\nDerek growls and looms threateningly over Stiles. He's trying to intimidate Stiles into dropping it, into being scared and running away. Stiles knows that, knows that’s exactly why he’s letting his eyes bleed red. But, this is too important.\n\"No,\" Stiles says and grabs Derek's face and kisses him square on the mouth. If he might not get his throat ripped out for it in the next twenty seconds, Stiles would have laughed at the way Derek's arms flailed when their mouths met and continued to flail when Stiles didn't let go. \nWhen Stiles pulls back, Derek looks more shell-shocked than if the boy had turned into a unicorn right in front of him. It's only a brief moment before the stiff arms flung out at Derek's sides reel back in and trap Stiles. Derek basically trips the captive teen back into the nest of fabric and lands on top of him.\nIt’s Derek’s mouth that finds his this time. Their tongues clash as Stiles fights Derek for dominance of the kiss. Eventually, Derek wins out when he bites the corner of Stiles’s mouth and takes advantage of the startled gasp that opens Stiles’s mouth. Stiles surrenders and lets Derek dip into his mouth and suck on his lips and bruise them. He involuntarily bucks up into Derek after a particularly rough bite and Derek’s hands tighten on his sides.\nThe werewolf moves away from Stiles’s mouth to nip his way down the teen’s jaw, while he gives Stiles a chance to breathe. Stiles pants and thinks about when Derek did that last night.\n\"So...\" Stiles starts, pausing to gasp when Derek reaches his ear and scrapes his teeth across the sensitive flesh beneath it. \"Your wolf...what, scented me or something?\"\n\"Yes.\"\n\"Why?”\nDerek pulls back and Stiles practically mewls he is that pathetic. He pays close attention to what Derek says next though.\n“Because you scented me first.”\nStiles blinks. “What?”\n“When you were rubbing your chin on my head. You were scenting me.”\n“No, I...wasn’t...” Stiles eyes go wide. “Oh my god, I was! Holy crap, what is wrong with me? I basically seduced your wolf!”\n“It wasn’t just because of you,” Derek says firmly. “Though believe me, that didn’t help. It was also because my wolf knew I wanted you. It was only acting on my urges in response to you. That’s why this whole thing is my fault.”\n“Oh...” Stiles says. Then, tilting his eyebrows up comments, “I think something bad has to happen for someone to be at fault, Derek, and I do not see this as a bad thing. No, it is definitely a good, good thing.” He strokes the short hair at the back of Derek’s neck, meeting his eyes. Then, smiles wickedly. “So, these urges. I think I’ll need demonstrations.”\nThe look Derek gives him has his cock twitching in his pants. Derek growls and dives back in, nipping the boy’s lips until they’re the color of ripened cherries. His hands skate up under Stiles’s shirt, his fingers dipping into the grooves of his ribcage as they find their way to his chest.\nDerek is just pushing Stiles’s shirt up to his armpits, when his head jerks up, eyes on the window.\n\"What?\" Stiles asks, breathlessly.\n\"Scott.\"\nMiraculously, that registers in Stiles brain and he scoots back to sit up slightly. \"Scott's here?\" he asks.\n\"Probably looking for you.\"\n\"Oh, crap. What time is it? Shit.\"\nThe two of them stand up, then, Derek hauling Stiles up by his arm. It's surprisingly gentle for him and Stiles ducks his head to hide his smile.\nThey hear Scott calling for Derek.\n\"Derek! Derek, are you here?! There were a bunch of bodies and I can't find Stiles! Derek!\"\nThey come down the stairs and Scott registers their heartbeats before they hit the front door.\n“Oh, thank god,” Scott says upon seeing his best friend. “Oh my god, Stiles, your dad called the house and I was like “yeah, he's here, we're about to go get breakfast” and he wanted to talk to you, but I said you were already out in your Jeep and hung up on him really quickly and I called your cell and you wouldn't answer so I tracked it and it was in this warehouse with a bunch of bodies, like really bloody bodies, and you weren't there, but I could smell that you had been and I didn't know if you were alive or dead and I didn't want your dad to kill me for lying to him.”\n“Scott. It's okay, I’m okay,” Stiles says, clapping his best friend on the shoulder. He's touched by how concerned he is.\n“Thank god! Because I have a date with Allison tonight and I can't cancel on her.”\nOkay, or he's not touched at all and kind of wants to punch Scott in the nose right now.\nHe’s not the only one. Derek rumbles beside him and puts himself in front of Stiles. “Something happened last night, but it's taken care of. You don't have to worry about it.”\n“Cool,” Scott says, bright and cheery again, seemingly unconcerned by the massacre he found earlier. He’s already on Allison-autopilot again; he doesn’t even notice how ravished Stiles’s lips look.\nThe love-struck idiot does manage to do at least one more useful thing for his best friend. He fishes Stiles's phone out of his pocket and hands it over. \"Here. You better call your dad.\"\n\"Yeah,\" Stiles says, \"Thanks.\"\n\"Bye, Stiles!\" Scott says with a wave and takes off, thoughts of his date with Allison tonight filling his head, Stiles is sure.\nStiles sighs, glances back at Derek. Derek shakes his head and Stiles laughs a little.\n\"Yeah, I'm not sure why I still love him as much as I do. But, he's my best friend and I'm undyingly loyal. What can I say? Give me a minute, yeah?\" Stiles asks, waving his phone.\nDerek nods and goes back onto the porch.\nStiles hits the speed dial for the station and waits for his dad to pick up.\n\"Hello?\"\n\"Hey, Dad. Looks like I missed your calls. Sorry. You know how distracting Scott can be.\"\n\"Yeah, I do,\" his father replies. \"Where are you now?\"\n\"Out in the woods,\" Stiles says and Derek's head snaps toward him. Stiles grins at him, before saying, \"Me and Scott were going to run through some lacrosse drills and stuff for a while. Cool?\"\n\"Yeah, that's fine. I'll talk to you later, kid.\"\n\"Talk to you later, Dad. Love you.\"\n\"Love you, too.\"\nStiles hangs up the phone and tucks it back into the pocket of his filthy hoodie. He looks back up at Derek.\nA grin splits his face and he moseys up the steps to stand in front of the older man. Derek is watching him intently, eyes dark.\nStiles looks up into his face and smirks.\n\"Now. Where were we?”"
}