{
    "id": "9856568",
    "url": "https://archiveofourown.org/works/9856568?view_full_work=true",
    "author": [
        "Cesare"
    ],
    "title": "icebreaker",
    "rating": "General Audiences",
    "archive_warnings": [
        "No Archive Warnings Apply"
    ],
    "categories": [
        "M/M"
    ],
    "fandoms": [
        "Yuri!!! on Ice (Anime)"
    ],
    "relationships": [
        "Katsuki Yuuri/Victor Nikiforov"
    ],
    "characters": [
        "Katsuki Yuuri",
        "Victor Nikiforov",
        "Original Female Character(s)",
        "Original Male Character(s)",
        "Katsuki Yuuri's classmates",
        "Yuri Plisetsky"
    ],
    "additional_tags": [
        "POV Outsider",
        "Post-Series",
        "College",
        "University",
        "Study Group",
        "Retirement",
        "Happy",
        "Happy Ending",
        "Friendship",
        "Coach Victor Nikiforov",
        "College Student Katsuki Yuuri",
        "Students",
        "Oblivious Katsuki Yuuri",
        "Supportive Victor Nikiforov",
        "Established Katsuki Yuuri/Victor Nikiforov",
        "Established Relationship"
    ],
    "language": "English",
    "series": "",
    "published": "2017-02-21",
    "completed": null,
    "words": "6,134",
    "chapters": "1/1",
    "comments": "515",
    "kudos": "21,370",
    "bookmarks": "5,393",
    "hits": "170,252",
    "summary": "<p>Yuuri's husband is possibly not as oblivious as he seems, because he grins and asks, \"Have you never looked up Yuuri?\"</p>\n<p>\"There's a porn actress with the same name who went into politics,\" says Nate, \"so she's most of the results, and some stuff about figure skating.\"</p>\n<p>\"Some stuff about figure skating,\" Victor says ruefully to Yuuri.</p>\n<p>(((A post-skating-retirement college scenario based on <a href=\"https://skygemspeaks.tumblr.com/post/156733406313\" rel=\"nofollow\">skygemspeaks' idea about Yuuri's college classmates learning about his figure skating career</a>. I wrote a variation mostly because I just really wanted to include Victor in the mix. This also heavily draws on <a href=\"https://kevystel.tumblr.com/post/156833181620/you-are-the-first-person-i-would-trust-in-writing\" rel=\"nofollow\">kevystel's ideas about Yuuri unknowingly breaking hearts everywhere he goes</a>.)))</p>",
    "notes": "<p>As mentioned in this story, there really is a porn actress also named Katsuki Yuuri. However, I decided that if she was going to be a more common search result for the name ahead of figure-skating Katsuki Yuuri, she would have to do something that made a big splash in the news, like going into politics-- so I invented that part.</p>\n<p>The quad axel is not a thing yet, but I imagine in a few years, Yurio will be trying for it.</p>\n<p>Moyo zolotse: my gold. Tanpopo: dandelion.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
    "text": "Marianne gets to know Yuuri Katsuki mainly because she never heard the name \"Yuuri\" before their class together.\nA nasty case of the flu knocks her out for the second week of Biological Psychology, and when she comes back, the only person whose name she remembers is Yuuri, a name that stuck in her head because it was completely new to her. Her undergrad didn’t have many international students.\nShe takes the seat next to his and leans toward him. “Excuse me... Yuuri? I’m Marianne. I missed a few days. Could I borrow your notes for last week’s classes?”\nYuuri glances up, light bouncing off his glasses. “Yes, sure,” he says. “I type up my notes... I can email them?”\nShe writes out her email address on a slip of paper, because the professor’s coming in and she doesn’t want to keep talking long enough to spell out “mari.echevarria” to her classmate. Yuuri accepts the scrap and smiles at it, glancing up at her. “That’s my sister’s name too.\"\nMarianne’s phone chimes when she gets the email. She looks over the notes he sent her: they’re very detailed, complete with links to references and blockquotes from primary sources, put together in ways that make memorable connections between the lectures and the reading. “These are amazing! Thank you!” she emails back.\nAfter class, “Thanks again for the notes,” Marianne says to Yuuri. “They’re really helpful. Are you still taking them? I didn’t see you typing.” Yuuri wouldn't be the first grad student to take incredibly detailed notes for the first couple of weeks and then slack off for the rest of the semester.\n“I record the lectures,” Yuuri tells her, gesturing with his phone. “And then I listen again later and take notes on that and the reading, both. That’s how I study best.” He has an accent that comes and goes, lilting some words and phrases while others sound authentically slurred and American.\n“You should post them somewhere. They’re so useful with all those annotations you made.”\n“I wouldn’t know how,” says Yuuri. “I try not to spend a lot of time online, I get too caught up in things.”\n“Yeah. Never read the comments,\" says Marianne, hypocritically. \"I have a friend who’s good with Wordpress. And she’s taking this class next semester, so I bet she’d be happy to put these up for you just to get her hands on them.”\n“Um. Okay, maybe? All right,” says Yuuri, a little flustered. He’s really cute. Marianne is a returning student, at 31, and most of the students on campus look so young to her, pretty but unfinished. Yuuri looks young too, with high slender cheekbones and strong brows that set off his wide dark eyes, not quite hidden behind his glasses. But even with his spiky bedhead hairstyle and casual sporty outfits, he seems a little more mature. He wears a wedding band on one hand and an actual watch on the other wrist, both making him look more solid and adult than the other students.\nIt's in his posture and body language, too: beyond his surface shyness, he just comes off as more settled and sure than the rest.\n“I’ll have my friend email you, okay?” Marianne smiles encouragingly. Yuuri nods with a tiny smile in return. Very cute.\nAs predicted, Serena is eager to whip up a Wordpress site in order to get her hands on a head start for a notoriously demanding class. Marianne posts the link to the notes on the class forum, which hardly anyone visits, until the first test is looming. Then everyone seems to have printouts of Yuuri’s notes.\n\"We should do a study group,\" Ran says. \"Yuuri, would you lead it?\"\n\"I don't know if I-- everything I'd have to say is written down,\" says Yuuri.\n\"Leading the group just means reading over the notes, really,\" Marianne explains. \"You know, for people who learn better from hearing things than reading them.\"\nYuuri considers that, and squares his shoulders. \"Then. Okay. I can do that.\"\nThe study group goes so well that it becomes a weekly thing, with Marianne and Randhir leading it on the days when Yuuri doesn't make it or rolls in late. But soon it's obvious that Yuuri is the main attraction for a lot of the attendees, who all seem to find reasons to check their hair or apply lip gloss just before Yuuri's due to show up.\nMarianne can't really blame them. She's completely off romance since her divorce, but even she can see the appeal. Yuuri is soft-spoken at first, and easily embarrassed, which is kind of adorable; but his underlying confidence shows itself once he's comfortable. Before long, when the group gets off-track, he levels a demanding look at them and raises his voice just slightly, and everyone straightens up and listens.\nAnd then there's the time he shows up in clingy track pants and a snug t-shirt-- \"I had to reschedule a few things this week, I'm going to the gym right after this,\" he explains, either misinterpreting or politely ignoring the open staring at his sculpted shoulders and objectively perfect ass. It's no surprise that the study group is also quickly becoming the Yuuri Katsuki fan club and would-be dating pool.\nWhich would be fine, but Marianne could swear that's a wedding band on Yuuri's finger. And she really doesn't want drama to screw up the study group. She's still trying to keep going with her old job part-time, and it doesn't leave a lot of opportunities to socialize in person, so the study group is kind of all she's got going right now.\nAnd it's a good bunch, even if they spend half the time gazing dreamily at Yuuri. She doesn't want any of them to get serious about Yuuri and get hurt if it's never going to happen.\nAfter class on a study group day, Yuuri's phone is going off even more than usual-- for someone who's not on social media, he gets a lot of notifications, Marianne's noticed. It must be SMS. He taps out a text with a fondly exasperated expression that might as well be issued to spouses along with the marriage certificate.\nMeanwhile, one of the hair-checkers from the study group is idling nearby, giving Yuuri the biggest pair of heart eyes Marianne has ever personally seen.\n\"You're married, right?\" she asks Yuuri. It's a little out of the blue, but she feels for Heart Eyes over there, and she wants to pull the pin on this grenade before it gets any more destructive.\nYuuri looks up, startled. \"Yes?\"\n\"I thought so, but I wasn't sure, because your ring's on the right hand. Do you wear it on the right in Japan?\"\n\"No, it's the left in Japan also,\" says Yuuri, \"but my husband is Russian, and they, um--\" he waves his hand, the ring catching the light. \"There it's on the right.\"\nHeart Eyes now has a tragic pall on his face, but really, better to know. He'll recover.\nAt study group that evening, it's obvious that word got around. There's a wistful quality to the usual avid attention Yuuri gets. But people don't stop coming. By the following week, study group is now doubling as the Yuuri Katsuki Hopeless Crush Support Group.\nWhenever Yuuri does something particularly attractive-- like breathing in or breathing out-- a shared forlorn look sweeps through all the hair-checkers and lip gloss appliers. Marianne sees two girls clutch each others' hands under the table for strength one time when Yuuri absently chews on a pen.\nYuuri never really acknowledges the crush symptoms, but he tends to gravitate toward Marianne; she's not sure if that's because she's the one of the few who's never showed romantic interest in him, if he's more comfortable with her because she's older, or just because she's the first person he got acquainted with. It's nice, though. He offers her rides home and walks her to her door every time. It's no mystery why half the class has fallen for him.\nThings come to a head during an extra-long session to study for the final.\nOver the months, Marianne has made a few unconscious assumptions about Yuuri's husband based on the very little information she's picked up. He's Russian. He seems to text Yuuri  a lot--  most of those notifications seem to be from him  . He's bigger than Yuuri, based on the time Yuuri put on a hoodie and then fretted that it looked \"sloppy\" because he'd grabbed the wrong one and his husband's was too big on him. Once when texting, Yuuri asked her, \"What's the word for, it's not balding, but the hair goes back...?\"\n\"Receding hairline?\"\n\"Yes!\" Yuuri tapped out a text with a stifled laugh, and added, \"My husband is vain about his hair.\"\nAnd one evening after study group when they both stayed to work on their term papers, Yuuri tore a number off a flyer for a local Polar Bear Club and confided that he and his husband moved here for Yuuri's grad school, and he worried that his husband hadn't made many local friends. \"It's hard for him,\" Yuuri said quietly.\nMarianne privately thought that if her sweet, cute, doe-eyed husband attracted hordes of smitten twentysomethings without even trying, she'd probably have trouble making friends too.\nSo without ever realizing it, Marianne sort of put together a mental picture of Yuuri's husband as a big, balding, antisocial guy, not really in the same league as Yuuri and struggling to hang onto him among the tides of admirers surging for Yuuri's attention.\nThe study group for the final goes on so long that they decide to break for dinner and reconvene in an hour. A few Hopeless Crush Support Group members linger when Yuuri doesn't leave-- \"Too many afternoon snacks,\" he smiles, to a chorus of quiet sighs. Still at the table are Marianne, Camila, Nate, Lark, and Darin. Nate-- formerly known as Heart Eyes-- volunteers to make a coffee run, and soon brings back not just Starbucks for those still here, but a full thermos and extra cups for the group.\n\"You're so thoughtful, Nate. Thank you,\" says Yuuri. Nate looks like that just made his  year . Darin immediately jets off and returns in record time with a bunch of bags of chips and pretzels from the vending machine downstairs, to more words of gratitude from Yuuri. Camila waits for her moment and tops them all by bringing out homemade cookies.\n\"These look delicious. Split one with me?\" Yuuri asks Marianne. They aren't big cookies, but she gamely snaps one in half and shares with him.\n\"Only half?\" Camila asks sadly.\n\"I have to be careful, I gain weight easily.\" Yuuri rubs the back of his neck bashfully. \"I've put on almost ten pounds since I started school again, and it's only been a year and a half.\"\n\"You used to weigh less than this? How? You're tiny!\" says Darin. \"I mean, you're built, but you're-- you know, lean.\"\nYuuri blushes and laughs that off, ducking his head to sip his coffee, and his fan club exchanges the usual mournful looks. The crush levels at the table are off the charts, considering half the group is off to dinner.\nMarianne is facing the door and keeping an eye out for the others to come back, so she's the first to see the new arrival. She didn't realize she had any opinions about what Russian men look like, but the moment Marianne sees a tall, fair man with light hair come through the doors, something about his bone structure and chiseled features just makes her think: Russian.\nAnd then:  this  has to be Yuuri's husband. And: wow. Her previous assumptions crumble with a resounding  holy fuck .\nThis guy is in Yuuri's league, and he is batting a thousand  in  that league. He's slim with broad shoulders, nicely dressed in crisp slacks and a sweater that shows off a classic V-shaped swimmer's build, and he moves with the same perfect posture and grace that Yuuri has. His hair falls over half his face in a style that should look ridiculous, but he's pulling it off and then some.\nMust-be-Yuuri's-husband scans the library and spots them, brightening. Catching Marianne's eye, he holds a finger to his lips, circling to come up behind Yuuri. It is, somehow, completely adorable, especially when he sings out \"Yuuuuri,\" and Yuuri jumps a foot and lights up with a huge smile.\n\"Victor,\" he says. It sounds like he's trying for a scolding tone but ends up happy and breathless despite himself. \"I thought you had another hour?\"\n\"Yurochka tried for the axel again the second my back was turned and banged up his hip. I told him to go home and think about what he's done,\" says Yuuri's husband. \"Though more likely he's eating everything in sight whether it's food or not, and shouting at other people playing video games a thousand miles away.\"\nYuuri tuts and shakes his head, and turns a cheerful face back to them. \"At least that means you can meet some of my classmates. This is Darin, Lark, Camila-- she brought the cookies-- Nate, and Marianne,\" says Yuuri, going around the table. \"My husband Victor.\"\nThey all say their Hellos and Nice to meet yous in a tangle of pleasantries. Lark tells Yuuri seriously, \"Damn. Go, Yuuri. Congratulations on your husband.\"\n\"Thank you?\" says Yuuri, coloring up prettily while his husband laughs.\n\"And congratulations  to your husband. We wondered who managed to snag a babe like Yuuri.\"\n\"Thanks! It wasn't easy,\" says Yuuri's husband as Yuuri tries to hush him. \"What? It's nice when people recognize my greatest achievement.\"\nCamila is kind of squinting at Victor. Marianne has a feeling they all want to, if only to try to figure out if that's a real hair color or not. Marianne isn't even totally sure that it's real  hair . It's glossy as a shampoo commercial, and under the buttery lights of the library it's impossible to tell whether it's very pale ash blond or actually silver.\n\"Sorry, I don't mean to stare, it's just, you look just like the guy from that cologne commercial a while back,\" Camila says. \"Where the guy ice skates on a glacier, that one? I got a bottle of that for my boyfriend. And like, that guy had the same hair and everything.\"\n\"Do you hear that, Yuuri?\" Yuuri's husband pulls out the empty chair beside him and sits. \"I look just like him. What an amazing coincidence!\"\nHis slight smirk and Yuuri's frozen caught-out expression make it obvious to all of them even before Camila says, \"Oh God, you  are that guy.\"\n\"I am that guy!\" Victor answers, as if it's exciting news he's just heard for the first time.\n\"You're a model?\" asks Lark, who is fashion-forward and gorgeous with perpetually perfect makeup, and practically has NETWORKING OPPORTUNITY flashing visibly behind her eyes.\n\"Mm, not really,\" says Victor. \"But that one I had to do, it's my cologne.\"\n\"Like, you made it?\" Camila asks, confused. Lark scoffs.\n\"No, no, Elizabeth Arden makes it,\" Victor says serenely. \"They licensed my name for it.\"\n\"Oh, God, of course,\" says Camila, \"fff, it's  called  Victor-- I didn't know it was named after anyone!\" Lark is now very obviously kicking Camila's foot under the table. \"Uh. Sorry. Sorry, I guess that's, uh, rude...\"\nVictor shrugs. \"Did you like it? When you got it for your boyfriend.\"\n\"Yeah, it's really nice.\"\n\"Then you're forgiven,\" Victor gives her a sunny smile.\nYuuri's poor lovely face now perfectly portrays the sentiment  Can you not? \n\"You can also have a cookie if it'll help,\" says Camila, regaining her aplomb.\n\"Thank you!\" Victor takes one and munches it happily. \"So good!\" He seems completely oblivious to the awkwardness paralyzing the rest of them, namely that Yuuri's husband is evidently famous enough that he has a cologne named after him, and yet none of them know who he is. Marianne's best guess is Russian pop star. Russia has pop stars, right? They had tATu.\nDarin chokes and starts coughing; Marianne realizes he's been sort of huddling behind Nate to conduct a frantic search on his phone. He must have hit paydirt.\nYuuri's husband is possibly not as oblivious as he seems, because he grins and asks, \"Have you never looked up Yuuri?\"\n\"There's a porn actress with the same name who went into politics,\" says Nate, \"so she's most of the results, and some stuff about figure skating.\"\nDarin socks him one under the table.\n\"Some stuff about figure skating,\" Victor says ruefully to Yuuri.\n\"It's  fine, \" Yuuri hisses.\n\"You did figure skating?\" Marianne asks Yuuri's husband.\nHe slides his arm around Yuuri's shoulders. \"Yuuri won gold at the World Figure Skating Championships twice, the Grand Prix three times, and silver at the Pyeongchang Olympics.\"\nYuuri takes off his glasses and rubs his eyes at the resulting onslaught of  Oh my God!  and  That's so cool! \n\"Why would you not tell people that?!\" Lark asks. \"That would be the first thing out of my mouth every time I met somebody! Hi, I'm Lark Wu, you might know me from  the motherfucking Olympics .\"\n\"You would think it might come up at some point,\" Victor agrees.\n\"You would think the  five-time  World Champion might mention  that, \" says Yuuri pointedly. To the table at large he adds, \"Victor took first in every figure skating competition he was in for five straight years. He won gold at the Olympics twice.\"\nDamn. No wonder somebody named a cologne after him.\n\"Of course I have to talk about you first,\" says Victor, \"you and your standing  world record  free skate score. As your coach--\"\n\"Vitya,\" Yuuri interrupts him. Without his glasses, his doe eyes are even more irresistible. No one is surprised when his husband raises his hands in surrender and shuts up.\n\"Sorry we didn't know,\" says Nate. \"I guess, uh, none of us are all that into sports.\"\n\"It's really fine,\" Yuuri says.\n\"Yes, not surprising,\" Victor flicks his hair back. \"The media here never pays attention to figure skating unless Americans win, and sometimes not even then.\"\n\"Yeah, but--\" Darin has his phone up now, and turns it to show them all. It's a montage of Yuuri on skates, doing several dizzying jumps in a sparkling outfit, then a clip of him skating toward a waiting Victor, who tackles him with a kiss before he can even step off the ice. Darin's phone has excellent speakers: the delighted screams of the enormous crowd come through clearly. \"It seems like you guys are pretty famous?\"\nYuuri covers his face again while Victor squeezes his shoulders and says with pleased nostalgia, \"Ah, our first kiss.\"\n\"That  was your first kiss? In an  arena?\" Lark is bouncing, because she adores all things extra.\n\"Look up 'Yuuri on ice kiss' on YouTube,\" says Victor. \"If you see the whole performance, you'll understand why I had to kiss him right then.\"\n\"Stop,\" Yuuri moans behind his hands.\nVictor gives him another squeeze. \"All right, I didn't come to embarrass my husband. That's just a bonus-- oof,\" he says as Yuuri elbows him. \"I thought since you've all been working so hard, we should take everyone out to dinner.\"\n\"Half the group is out to dinner now, we're just waiting on them,\" Marianne tells him.\n\"We still have so much to go over,\" says Yuuri, dropping his hands to paw through printouts of his notes.\n\"We could order in?\" Victor offers.\n\"Victor,\" Yuuri says, that fond exasperation showing again, \"this is a  library. \"\nNate clears his throat. \"Actually, you can have food in the study rooms in the annex, you just have to sign out the key and clean up afterward. I can sign for it.\"\n\"Pizza?\" asks Victor, waking up his phone.\nJust then the rest of the group returns, and Cynthia gasps and squeals, \"Oh my God, Victor Nikiforov!\"\nAt that Yuuri apparently hits his limit, jumping up with a quick, \"Bathroom!\" and vanishing.\nIt turns out Cynthia loves winter sports and has known about the figure skating stuff all this time, but when she spoke to Yuuri about it (months  ago!) he asked her not to mention it to anyone else. Everyone is torn between a profound sense of betrayal at Cynthia, and the awareness that if Yuuri asked them nicely not to talk about something, they would take it to the  grave. \nWhen she asks, Victor gives Cynthia a scrawled autograph, casually, like it's just something people do, which more than anything else lands it home for Marianne that even if a bunch of grad school nerds here in the States don't know him, this guy is used to being seriously famous.\nDarin has continued to Google, holding his phone out so everyone can see. The results for Victor's name are a parade of glamour shots on skates, high fashion ads, stills of his skating from when he was younger and the glossy mystery-colored hair was down to his waist, more recent photos of him buff and shirtless with ice skates hung around his neck. One of the shirtless pics has him holding out his arm toward the camera with  dozens of gold medals hanging from it. It looks like the hottest, most expensive Newton's cradle ever.\nAnd plenty of the results are Victor with Yuuri: hugging him from behind; staring into his eyes while an arena goes crazy around them; kneeling at his feet?-- according to the text excerpt for that one, \"Champion turned coach Victor Nikiforov kisses Yuuri Katsuki's skate.\"\nJust... wow.\nMarianne's phone buzzes. She checks to find a text from Yuuri.  [Is it safe to come back?] \nMarianne gauges the group. The shock's mostly worn off, and while a couple of people are still doing searches or watching clips on their phones, most of them seem ready to get back to work. Even Cynthia is now just having a normal conversation with Victor about her Labradoodle.\nShe texts back,  [I think so.] \nYuuri returns with the key to a study room in the annex and the announcement that he ordered pizzas and desserts, and everyone schleps their stuff to the annex.\n\"How much do we all need to chip in for food?\" Marianne asks as they settle in the study room.\n\"Our treat,\" Victor says, and over the protests, \"No, no, leave it to us, we have to spend that cologne money somehow.\"\n\"You spent the cologne money on a convertible,\" Yuuri mutters. He gives Marianne a long-suffering look; she's flattered to be identified as an island of sanity in all this. \"A pink convertible,\" he elaborates. \"Victor couldn't even drive in the States yet.\"\nVictor waves that away. \"You complain, but you love that car. You and Yurochka both. You two are so alike sometimes.\"\n\"Yurochka,\" says Camila. \"Does that mean Yuuri Junior? You have a kid?\"\nYuuri chokes a little. Victor pats his back. \"No, Yurochka is the main skater I'm coaching. Just by coincidence his name is also Yuri, so he gets nicknames. Yurochka, Yura, Yurio.\"\nFinally, the group gets back into gear and they pick up where they left off. They get through a good half hour before the food arrives, and there's another shorter interlude of distraction while everyone eats.\nDuring that break, Lark tries to ask Victor how he and Yuuri got together, and Yuuri all but teleports across the room to say, in that shy, polite, immovably stubborn way of his, that it's a long story and there's no time for it tonight.\n\"It's not that long,\" Victor says. \"Yuuri asked me to coach him, so I came to Japan and I coached him. See, was that so hard?\" But he's wearing a huge shit-eating grin and Yuuri looks like he might throttle him, so there's probably more to it than that.\nOnce everyone is starting to settle again, Victor peers at Marianne's printouts. \"You still have so much. This is your study guide?\"\n\"These are the notes Yuuri's been sharing with us all semester,\" Marianne says, flipping through them to show him. \"Didn't he say?\"\n\"No!\" Victor turns to Yuuri and loops an arm around his shoulders again, squeezing him close and gazing at him adoringly. \"Moyo zolotse. Look at all these people you've been helping! I'm so proud of you.\"\nMarianne thinks, first, that this evening is teaching her almost as much about what she absolutely does not want in a relationship as her divorce did, because she's pretty sure she wouldn't be able to deal with Yuuri's husband for even a day, let alone a marriage. That kind of sincere drippy sweetness would have her running for the door in record time, even if it came in a model-hot package like that.\nAnd second: sincere drippy sweetness must be just perfect for Yuuri, because he could not look more quietly, blushingly pleased if lives were at stake.\nEven so, \"If you're staying you have to be quiet and not distracting,\" says Yuuri, \"which means you're not staying.\"\n\"I can be quiet!\" says Victor, not quietly.\nAfter a skeptical moment of consideration, Yuuri delves into his satchel and hands an iPad in a keyboard folio to his husband. \"If you stay you have to clear your inbox.\"\nVictor's response to that sounds like grumbly Russian, but he takes the tablet with a dramatic sigh and sets up nearby. He's still a little distracting. It's hard not to notice a flagrantly beautiful man with a shiny fall of light hair, even when he's just sitting there reading intently and pressing a finger to his lips. Yuuri at least has the decency to obfuscate his good looks slightly with his glasses.\nBut they plow through the remaining material in another hour. It's a lot to cover, but they've gotten to the stuff they've been learning more recently in class, so it's fresher in everyone's mind and they need less drilling on it.\nAt a certain point Yuuri's husband stops with the tablet and just watches Yuuri with the same moony expression familiar from all these weeks of the Yuuri Katsuki Hopeless Crush Support Group. It seems like even being married to the guy doesn't make you immune.\n\"Marianne, do you need a ride home?\" Yuuri asks as they're winding down and packing up. \"We need to go out that way anyway to check on Yurio.\"\n\"Sure, if you're heading that way. Thanks,\" Marianne says. The bus isn't bad, but a ride is better. Unless-- \"Wait, did you drive that convertible?\"\nYuuri laughs while his husband contrives to look pouty. \"No,\" Yuuri says, \"I have a normal car,\" though she already knows that's not true: it's a Tesla.\n\"If you don't mind, we'll stop at Yurio's first,\" says Yuuri. \"It's on the way to your place.\"\n\"Of course it's fine,\" Marianne says, and it is, especially when Victor spends the entire trip showing her a photo gallery of their dog on his phone. They have an adorable cuddly brown poodle and Victor almost literally cannot shut up about it, which is sweet.\nWhen they stop, Yuuri urges Marianne to come in with them. \"It shouldn't be long, but I hate to leave you out in the car alone.\" Marianne would be more worried about leaving that  car  alone, but whatever.\nYurio turns out to be another Russian, this one with golden blond hair in a long thick braid. He's a little taller than Yuuri but not as tall as Yuuri's husband, and has the same great posture as the other two, but if he shares their grace there's no way to tell: he comes out onto the front walk to talk to them in gigantic stompy boots.\n\"How's your hip?\" Yuuri asks. \"Have you been icing it?\"\n\"It's fine! It's nothing.\" His accent is more choppy and rough than Victor's. \"I would have been fine to keep going, too. Your asshole husband was just looking for an excuse to leave early.\"\n\"What a wild imagination,\" says Victor unconvincingly.\n\"First you drag me to this wasteland where they won't even sell me booze yet, then you cut my practice short! I have less than a month to the Final, I need that axel, and my leg is fine!\"\nYuuri suddenly pokes Yurio's hip and the blond twitches heavily. \"That's not fine. Go ice it!\"\n\"I was icing it! I was laying on the ice pack, you're the ones who came knocking on the door and got me off it,\" he says, and frowns, jerking his chin at Marianne. \"Who--\"\nThere's a very particular look Marianne is used to getting, though it usually happens at conventions: the squint of someone trying to picture her with dark eye makeup and a large fluffy hat.\n\"Holy shit, Agony Bloodstream,\" says Yurio.\n\"Hi,\" says Marianne.\n\"Who? Huh?\" asks Yuuri.\n\"Seriously? Agony Bloodstream, you loser,\" Yurio repeats snidely. \"She did the Resident Evil 8 speedrun on Avalanche difficulty with just the knife and no deaths! I've watched it twenty times on your TV!\"\n\"What is that, a video game?\" Yuuri's husband asks, several clicks behind.\n\"Ugh, you two are the worst,\" says Yurio, barging past Victor to bounce on his toes in front of Marianne. \"It sucks that you're not updating as much anymore. Are you going to play the next Outlast?\"\n\"I'm going to try to tackle it over winter break,\" says Marianne, \"but probably just a normal playthrough, no stunts. What about you, do you comment? Ever come to the Twitch stream, or the Discord chat?\"\n\"I did a few years ago when I fucked up my knee,\" he says. \"Icetiger21.\"\n\"Hey, I remember you!\" Marianne laughs. \"Nice to know you were lying when you said you weren't underage.\"\n\"I wasn't in Russia!\"\n\"Ice tiger,\" Victor says in a strained deadpan.\n\"Shut up!\"\n\"I can't really talk,\" says Marianne, \"I started my channel when I was still in high school, but even then I should have known better than 'Agony Bloodstream.'\"\n\"Oh, it could be worse,\" says Victor airily. \"When Yurio was younger, figure skating journalists used to call him the Russian Fairy.\"\n\"You are such a dick,\" says Yurio. \"Just remember, the fucking Russian Fairy broke your SP record twice. I'm coming for your free skate record too, Katsudon.\"\n\"I got called 'glass heart,'\" Yuuri offers, conciliatory.\n\"No, no. Japan's ace,\" says Victor, framing Yuuri with his hands as if displaying him to an audience. He frames himself with, \"Living legend,\" and finally Yurio with a smirky, \"Ice tiger.\"\n\"Living legend came later,\" says Yuuri, crossing his arms. \"When you were first competing in Juniors, they called you Oduvanchik.\" Yurio breaks into a fit of laughter and Yuuri explains to Marianne, \"Dandelion. They said his long hair weighed more than he did, and if he got caught up in a strong wind he'd blow away.\"\n\"Yuuri!\" his husband whines.\n\"Serves you right, tanpopo.\" Yuuri says, but he's also stroking a soothing hand down his husband's arm. To Marianne he asks, \"Is it okay if I have Yurio show me some of your game videos?\"\nIt's nice of him to check. \"Sure,\" she says. \"It's not really a secret. I guess it's like your figure skating. There never seems to be a good way to say 'I used to play video games for a living' without making a big thing out of it.\" She's trying to come back to school after years away and get her Master's; she just doesn't have the energy to explain, yet again, how YouTube advertising revenue works.\n\"I can't believe you didn't recognize her,\" Yurio grumbles. \"Literally on your own TV every day when I had a busted knee.\"\n\"I'm a little hard to spot without the makeup and the hat,\" says Marianne.\n\"Hat, hm,\" Victor taps his lips. \"Is it black and grey with cat ears and smiling eyes and fangs?\"\n\"Yeah...?\"\n\"Yurio has that hat! How cute, Yurochka! I thought that was just your usual cat obsession, I didn't know it was a fan thing. Was this another one of your crushes, like the one you used to have on Yuuri?\"\nThe blond turns to Yuuri and says seriously, \"Katsudon, get him out of here if you want to keep him around. One more word and I will murder him.\"\nVictor opens his mouth and Yuuri immediately claps his hand over it. \"Take care of your hip,\" Yuuri says. \"When I come out Saturday, I want to see that quad axel.\"\n\"I'll have it.\" Yurio gives Marianne the slightest curve toward a smile. \"Whenever you livestream the new Outlast? I'll be there.\"\n\"See you then,\" she says, and follows Yuuri and his husband back to the car.\nAs she climbs into the backseat she catches Yuuri's muttered, \"--embarrassing to  me.\" \n\"How can that still be embarrassing to you? Of course he had a crush on you, everyone with good taste gets a crush on you. I spotted at least three at your study group.\" Yuuri's husband turns to look at Marianne. \"How many in your study group have crushes on Yuuri?\"\n\"Seriously?\" she asks. He nods earnestly. \"Uh, I think Lark's dating someone now and Randhir is straight, and I'm clear, but other than that...\"\n\"Hm, I should have put in an appearance sooner.\"\nThey pause at a stoplight, and Yuuri takes the opportunity to bounce his head against the steering wheel. \"Marianne, I know you're kidding, but please don't let him drag you into his delusions-- look, even if someone did, I wouldn't want to know!\"\n\"In that case: no, none of them have crushes on Yuuri. None of them ever lose track of what we're talking about because they get caught up in staring at him, and they definitely didn't lose their tiny minds the time he came to the library in his gym clothes.\"\n\"I bought him those track pants,\" Victor dishes, \"aren't they  amazing?\" \n\"After we drop off Marianne, I'm taking you back to Yurio,\" says Yuuri. \"He and I can give each other alibis.\"\n\"You scared me for a second-- I didn't think that sentence was going to end with 'alibis,'\" says Victor.\n\"I'm not going to be able to  wait until we can get back to Yurio's. Marianne, would you like a Russian husband? Good condition, slightly used?\"\n\"I just got rid of one husband,\" she says. \"I'm not really in the market for another.\"\n\"Yuuri, I can't believe you underrate yourself like that,\" Victor sniffs, \"to call me only  slightly used.\"\nYuuri finally breaks into a charming little snort and giggle, shaking his head.\nVictor cranes around to say to Marianne, \"So you play video games as a job?\"\nShe suppresses her sigh and nods. \"Basically. Yeah. Sort of.\"\n\"What's your favorite game?\"\nWell, that's a little different. For the rest of the drive, Marianne explains Outlast to Yuuri's husband, who looks more and more disconcerted and impressed.\n\"I don't think I could play that,\" he says.\n\"Of course you couldn't play a game set in an  asylum! Victor, you can't even play Pokemon!\" says Yuuri. \"He gets upset about making the monsters fight.\"\n\"Well? Really, Yuuri, how could you? Those pokemon trusted you.\"\n\"They're not real!\"\n\"Heartless,\" says Victor.\nBy then they're at Marianne's place. Yuuri walks her to the door as always, leaving his husband with a command to find something good on the radio.\n\"Weird night,\" Marianne says. \"But it was nice to meet Victor. He's a sweetheart.\" She means it. She still thinks she wouldn't last a day dealing with just Victor on his own, but as half of Yuuri-and-Victor, he's great. It's impossible to feel anything but warmly toward someone who so obviously makes Yuuri happy.\n\"I'm glad about that too,\" says Yuuri. \"I was thinking... since you already know Yurio, in a way... and you said a while back that you'll be in town for the holidays... none of us really celebrate Christmas the way people do here, but... um, if you'd like to come by for dinner sometime during the winter break, you'd be welcome. It would be nice to have a reason to cook real food instead of athlete chow.\"\n\"I'd love to,\" says Marianne, touched.\n\"Oh, good,\" Yuuri smiles. \"We can email about the date. Good luck to both of us on the final!\"\n\"Good luck,\" she agrees. \"Good night!\" and she heads into her apartment. She's got a video to edit and upload, her calendar to check, and her lucky stars to thank that she dodged that particular crush bullet, because Yuuri and his husband are married as  hell and way too cute with it.\nShe can't wait to come over and play with their dog."
}