{
  "id": "10047632",
  "url": "https://archiveofourown.org/works/10047632?view_full_work=true",
  "author": [
    "BreakTheDawn"
  ],
  "title": "So Here's what You're Not Going to Do",
  "rating": "Not Rated",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Voltron: Legendary Defender"
  ],
  "relationships": [
    "Hunk & Lance (Voltron)",
    "Keith & Lance (Voltron)",
    "Lance & Shiro (Voltron)",
    "Lance & Pidge | Katie Holt",
    "Lance & Voltron Paladins",
    "Allura & Lance (Voltron)",
    "Coran & Lance (Voltron)"
  ],
  "characters": [
    "Lance (Voltron)",
    "Hunk (Voltron)",
    "Keith (Voltron)",
    "Pidge (Voltron)",
    "Shiro (Voltron)",
    "Coran (Voltron)",
    "Allura (Voltron)",
    "Blue Lion (Voltron)"
  ],
  "additional_tags": [
    "Lance (Voltron) Angst",
    "Bilingual Lance (Voltron)",
    "Lance (Voltron) is a Mess",
    "Family",
    "Hunk & Lance (Voltron) Friendship",
    "Protective Shiro (Voltron)",
    "Space Uncle Coran (Voltron)",
    "Female Pronouns for Pidge | Katie Holt",
    "Italics",
    "Socially Awkward Keith (Voltron)"
  ],
  "language": "English",
  "series": "Part 2 of A Song of Storm and Ice",
  "published": "2017-03-02",
  "completed": "2017-03-16",
  "words": "32,687",
  "chapters": "12/12",
  "comments": "820",
  "kudos": "7,764",
  "bookmarks": "1,534",
  "hits": "105,604",
  "summary": "<p>He lets them take out the frustrations on him. Encourages it really, because people need an outlet for their anger, and Lance has always been the best at making people angry at him.</p>\n<p>(And if his heart twinges a little every time he has to let someone be particularly mean to him, then he just has to remember that this is what he's good at. What he's good for.) </p>\n<p>But Lance is an older brother, and an uncle, and a younger brother. He learned sometimes keeping people means sacrificing his own feelings for a bit. He's been taught that he can't always let his feelings take a back seat though. After all, what happens if the rock falls apart? </p>\n<p>So, while Lance is always prepared to be the enemy on any given day, there are certain days and certain things that he will not let fly.</p>\n<p>Or, </p>\n<p>What happens when Lance is sick of his teammate's shit.</p>\n<p>“Did something happen between you and him?” Hunk knows that Pidge was working on something, and he knows how Lance can be. Maybe she snapped and his friend’s off licking his wounds somewhere. Or maybe Lance was already upset and she snapped and he’s off licking his wounds somewhere. Not doing much to help the image of his friend curled up in a ball.</p>\n<p>“Ok I know you miss your mom or whatever, but that doesn't mean you can just act like her to us. She isn't here Lance, don't be a baby about it.”</p>\n<p>It's the wrong thing to say. In any situation or circumstance, Keith is wrong to say something like that. He realizes this right after the words leave his mouth.</p>\n<p>And even if Keith didn't have the awareness to realizes it himself, Lance's positively thunderous expression would have given it away.</p>\n<p>“Why do you have my laptop?” Pidge questions, “did you see Lance?”</p>\n<p>Oh no.</p>\n<p>Hunk's eyes widen as Keith flinches and nods.</p>\n<p>“Keith no,” Hunk groans.</p>\n<p>Lance flinches, and his face goes red. There's silence as they stare each other down. Shiro's just about to lose his cool, the image of Keith in tears just there, when the blue paladin finally responds.</p>\n<p>“Your bias is showing.”</p>\n<p>What.</p>\n<p>“What!?” Shiro asks, just a bit outraged.</p>\n<p>“Your bias. It's showing.”</p>\n<p>“Is Lance in his room?” He and Allura don't make a habit of stepping into the paladin's business if it does not directly affect Voltron. Their understanding of the human psyche and customs are still far too limited, and they often end up making a dispute worse. But Shiro needs help. Lance needs help. They all need help.</p>\n<p>“I honestly don't know,” Lance finally mutters, voice bitter and annoyed. “It's been a bad day.”</p>\n<p>Excuses! She's so sick of excuses!</p>\n<p>“A bad day is no excuse to fall apart as a team!” She means the words for everyone, but stares at Lance. This all revolves around him. What has the boy done now?</p>\n<p>Lance turns to look at her, face finally showing some emotion other than the steady annoyance he's been portraying. He looks shocked. Why does he look shocked?</p>\n<p>“You're not seriously about to blame me for what just went down,” he asks breathlessly, “are you?”</p>\n<p>“Shiro,” the princess murmurs, “please step aside.”</p>\n<p>Her voice is soft, and Coran imagines that she has to be quite shocked about what just happened. He is not doing much better himself. </p>\n<p>“No,” Shiro shakes his head, “I won't.”</p>\n<p>“Promise us,” Pamela insisted, “that you’ll stand up for yourself more?”</p>\n<p>“I know you like to take things on your shoulders because it makes you feel good,” Lisandra added, “but you can only do that if you’re in good health. So you can’t let others put you down like that.”</p>\n<p>“Ok?” Arturio had ran a hand through Lance’s hair, “Alejandro?”</p>\n<p>It took a moment, but Lance had eventually nodded, ready to take on this new challenge.</p>\n<p>“Si.”</p>\n<p>“I do think it's worth it to speak to your fellow paladins though,” Coran continues calmly, “on your own time, of course.”</p>\n<p>Lance nods. He's glad Coran is here. He never knows how much he misses having an adult in his corner until the advisor pops up out of nowhere when Lance needs it. And he knows what's not being said. Hunk will be content if Lance wants to avoid the other paladins for another whole week, but Coran understands that it's impossible. They're defenders of the universe, and their ability to do that job literally relies on them being on speaking terms at the very least. </p>\n<p>Lance accepts the jar from Coran's hands. His own are much more steady now.</p>\n<p>The advisor will never push Lance into talking to the others, but won't let Lance forget that he's going to need to eventually either. The blue paladin appreciates that.</p>\n<p>Lance sighs, putting down his application brush and standing. Looks like it's happening sooner rather than later. He schools his face into a blank expression, and walks over to open the door.</p>\n<p>“Hello Lance.”</p>\n<p>It's Allura.</p>\n<p>Oh shit.</p>\n<p>“I want to forgive you though,” Lance admits, “I want us to be ok. I don’t like being mad at you Shiro, it makes me feel gross. So…”</p>\n<p>The blue paladin moves and leans back against his room door, sliding down until he’s sitting directly across from the leader.</p>\n<p>“Let’s have it then.”</p>",
  "notes": "<p>Hey hey hey!</p>\n<p>Naturally, I don't own anything, but I just have to say that my favorite character of Voltron is indeed Lance, and while I adore how the show has gone so far for the most part, I can't help but think of some of the great potentials for characterization (ahem, LanceHunkCoran) that it's glossed over. So this is basically a self-indulgent mini-fic exploring one of my favorite headcanons that I wish other people would go into more: that Lance has a very scary temper. He's a family man, after all, and people who are all about that family life must have semblance of how to deal with people being disrespectful, especially if we go with the idea that Lance has younger siblings he's helped raise. </p>\n<p>A quick warning though, this fic does get into some rather steep self-deprecation territory.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>I'm just going to explore all my headcanons with this one lol.<br>I feel as though Lance is smart. Like, actually smart. I don't think he would have been selected to be the leader of two tech prodigies at the garrison if he couldn't at least keep up with them a little bit. It only makes sense that he picked up a few things, and if there's one thing that I actually do dislike about his characterization in the show, it's how ridiculously stupid they make him come off as sometimes (season two, I'm looking at you), especially considering he's shown to be quite capable and competent at other times.</p>\n<p>Anyways, I don't plan on this fic being very long, it's mainly to get my ideas out and to actually introduce myself to writing Voltron fics, but I have a plot planned out for this, and I hope to get it wrapped up within a few weeks or so.</p>\n<p>Wow. The response so far for this is just overwhelming really T.T I'm so glad that people are enjoying this and taking to the idea. I've planned it out and it's looking like this is going to be about 8 chapters. This one is rather short, unfortunately, but I want them to be separate in that they focus on different character relations. This mainly acts as setup for the next chapter and a focus on the role Hunk is going to play in this story.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>Like I said, it's short. But don't fret! The next chapter is actually almost complete and should go up sometime within the next two days. See y'all then!</p>\n<p>Another chapter so soon? Hahaha this one just flowed right out of me. Fair warning, Keith is kind of mean in this, but he's not meant to be an antagonist or anything.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>Like I said, Keith isn't meant to have a nasty characterization, neither is Pidge for that matter. No one is, and I hope I did a well enough job framing exactly why Keith thought it would be appropriate to push Lance like this. I was trying to impart the idea that Keith only really knows how to interact with Lance on Lance's terms, or what he thinks Lance's terms are. He didn't go into this interaction wanting to hurt Lance's feelings, he went into expecting Lance keep up the dynamic that Keith believes they are both most comfortable with. All anyone is guilty of in this fic is not learning Lance well enough past the superficial, and these interactions are meant to be a \"what if Lance gets tired of people not learning him well enough?\"</p>\n<p>Anyways, please anticipate some more updates in the near future, and any feedback is appreciated!</p>\n<p>So another super short Hunk-aside. These are really meant to be breaks in between the angst honestly, and to show that Hunk is in fact aware and informed of the situation.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">more notes</a>.)\n</p>\n<p>Lance is my favorite character, but I actually love them all hahaha. One of my favorite things to see is some Hunk-any other paladin interaction because I feel like he cares so much, just like Lance. They both show it in different ways, but they are no doubt the legs of Voltron.</p>\n<p>Double Update! Hahaha I'm so into writing this that I've been working on it little by little during most of my free time.<br>Fair warning, there be angst in this chapter, Shiro stans beware, he kind of drops the ball here. I was actually a bit leery about this one, but all will be explained in the end notes.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">more notes</a>.)\n</p>\n<p>So just in case there's any confusion, this fic does in fact take place all in one day, which is why Lance's reactions are getting progressively more intense. I hope my backstory building isn't too confusing or ridiculous, I'm trying to set up a sensible timeline wherein Lance has actually been withdrawn for the past week leading up this story, only really talking to Hunk in his free time and only interacting with others when they're as a group. </p>\n<p>There are no antagonists here, just misunderstandings rampant. To me, Shiro does not know Lance and Hunk nearly as much as he knows Keith or Pidge, and while he cares about all of them, he's operating under assumptions here that he would not have made if he knew Lace better. Pidge is only half coherent here, and that's why she isn't telling Shiro the full story behind Lance's outbursts, but Shiro trusts that Pidge is coherent enough. He's just being protective bro mode here hahaha, and what he thinks are Lance's various \"tells\" are what leads him to think that Lance was in the wrong here. The only one who has experience dealing with Lance at his worst and his most fed up in this story is Hunk. Shiro is recognizes signs, just connecting them wrong.</p>\n<p> I do hope I did his character justice, because to me there are an incredible amount of ways Shiro can be characterized and still fit into his archetype in the show due to the layers of his backstory and the fact that we only really have hints of the type of person he was at the Garrison. Anyways. wow. This got long! See y'all next time!</p>\n<p>Bam! Another chapter done.<br>Can I just say that the response to this is so overwhelming great!? I read every comment and I love every comment hahaha. That being said, I'm probably going to put off personally responding to each comment until about the end of this story. I'm so glad people are appreciating the characterization though! That's what I'm most focused one when I write.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">more notes</a>.)\n</p>\n<p>So, Coran is going to play a similar role as Hunk in this story. I can tell you right now that he won't be upsetting Lance during this storyline. I'm trying to make the confrontations as realistic based on the characters presented as possible, and I just don't see any scenario where Coran would push Lance's buttons like the others have been, even over a misunderstanding. Coran just doesn't have that type of character, add that to the fact that he seems to favor Lance sometimes. So, there will be no yelling at the space uncle hahaha.</p>\n<p>Psst.<br>Surprise.<br>Another double update hahaha.<br>This one gave me feels to write honestly, and once I started I really couldn't stop. So without further ado, enjoy the chapter! Be warned, their be sad and angry feels abundant in this chapter.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">more notes</a>.)\n</p>\n<p>So. Allura.<br>My personal headcanon is that she does not actually spend much time with the paladins outside of training, missions and meals maybe. She's leading a team to save the universe. The stakes are ridiculously high for her. Allura strikes me as very militant leader, and the idea that her paladins might not be prepared for anything really riles her up. Voltron: Legendary Defender, is made to be appropriate for kids, but if it had a higher rating, I've always thought that Allura would be much harder on the paladins than she's shown as being on the show. Here, she's just trying to protect them in her own. She doesn't understand why they're falling apart before her eyes, but she knows that it has a lot to with Lance. So Lance is the one she calls out, and he finally has his impending breakdown. I imagine watching someone you care about literally lose all of their shit can be quite disarming, so that's why no one intervenes. Had it gone on for much longer, they probably would have, but the interaction is over too fast. </p>\n<p>We're wrapping things up with this story, the next few chapters will have Hunk and Coran working overdrive to fix up this mess, and attempts at apologizing. It may take a bit longer to get them out, because the one I'm working on at the time of this note is turning out to be quite long lol, but I hope it will be worth it! Stay tuned for more!</p>\n<p>Er, surprise?<br>Lol I know I said an update might take a few days, but upon further reviewing, I decided to break this part off and make it into a singular chapter, just in trying to follow the narrative style I've developed for this story. So...enjoy!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_8_endnotes\">more notes</a>.)\n</p>\n<p>Headcanon: Allura runs the show and keeps them on task. Shiro leads and encourages. Keith gets shit done. Pidge innovates and makes it possible for things to get done. Hunk fixes when thing's are broken or slowing down (people include naturally). Lance supports, just constantly in his own ways. And Coran helps everyone do their own individual thing as needed. <br>The next chapter will definitely be the longest yet lol. Why? </p>\n<p>Because we'll finally be getting a full sequence from Lance's point of view. So anticipate Langst and anger and feels and Hunk and Coran and just all of the things hahaha!</p>\n<p>It is my pleasure to present this update to you guys lol!<br>Fair warnings, when I this fic goes into some dark self-depreciation... Well here it is. There is very very light self harm depicted here, but it's not a conscious or purposeful effort, so be mindful.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_9_endnotes\">more notes</a>.)\n</p>\n<p>I got feelsy while writing this lol. I tried to have a realistic take on Lance's outbursts and how to connect them to the more insecure side of his character that's been alluded to. Resolutions are coming soon guys! Expect apologies and explanations and fluff coming your way soon! Headcanon: Lance's name is Alejandro...because I like it.</p>\n<p>Ta-dah! Sorry this took so long lol. I really wanted to get this right with the narrative, and I debated on the perspectives to focus on for this chapter a lot. So I ended up rewriting this entire part three different times. And I eventually got to a point where I was satisfied with it. </p>\n<p>Can I also just say that reading the comments have given me all sorts of life? :). I'm going to take the time and go through and reply to the ones I haven't already yet when this is complete, but just know that I do read them and I do love them, and I'm honored that so many excellent authors on here (one happens to be one of my favorites &gt;.&gt;) are enjoying my work.</p>\n<p>Let the resolutions and fluff begin!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_10_endnotes\">more notes</a>.)\n</p>\n<p>I suppose this is as good a time as any to drop the fact that this is planned to be the prologue of a plot-driven series. On the last note of this work, I will go more into detail, but just know that the plot points I've been dropping aren't random or out of nowhere lol. They're very purposeful.</p>\n<p>Anyways, we have Keith and Pidge finally reconciling with Lance. I headcanon that given the opportunity, Lance or Hunk could easily end up being some of Keith's closest and most trusted friends, and I hoped that I demonstrated the dynamic I'm going for between him and Lance properly in this story. I also slipped in some of my headcanons regarding Keith and Shiro's relationship here &gt;.&gt;</p>\n<p>Speaking of our fearless leader, once again, I must say that there are no antagonists. The focus on Shiro as having hurt Lance's feelings more than anyone else is purely based on the situation at hand. Lance looks up to Shiro, wants to be seen as trustworthy and capable by him, so the confrontation between them in this story really grated on him. Lance doesn't expect nearly as much from Allura as he does from Shiro here, but he's even less willing to talk to her because of it. In his head, she doesn't see him as a friend, and his bond with her won't affect Voltron directly, so he has no desire to have a conversation with her just yet.</p>\n<p>And Pidge. Come on, she's like a little sibling to Lance, through and through. There was no way he was going to hold a grudge against her when he knew she already felt bad and understood her error.</p>\n<p>Back at it again with another update! This one's a bit shorter, but don't worry! The next chapter should be up within the next two days or so. We're wrapping things up folks! There will be one more chapter after this and perhaps a forward for a continuation! Please enjoy!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_11_endnotes\">more notes</a>.)\n</p>\n<p>Originally, Allura and Shiro were going to share a chapter. But I decided against that. Lance and Shiro are planned to be the most central characters of the next installment in this universe, and a lot of plot focuses will go back to the conversation they're about to have, so I felt it would be appropriate for that to be it's own chapter for both that reason and the fact that Shiro really put Lance out with the whole \"rely on you\" question. Emotions are going to be high in the next one lol.</p>\n<p>Now back to Allura. Here we get into a bit of how I feel she views Lance. I personally headcanon that Lance would be a difficult person for Allura to grow close to because she doesn't understand or appreciate his approach to trying to socialize with her. I think she sees him as a capable paladin, but isn't as secure with trusting him as she is with trusting everyone else, and this is also something I plan on exploring further. </p>\n<p>Anyways, til next time!</p>\n<p>(P.S. I'm not ignoring those who are asking about Hunk's scenario with Lance. That will be a thing.)</p>\n<p>Wow. We've come full circle my peoples! I'm happy to say that I've completed my first story in the Voltron Fandom!<br>Please do enjoy. I legit teared up while writing this so I hope the emotions ring true for others as well.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_12_endnotes\">more notes</a>.)\n</p>\n<p>Things between these two are not magically fixed lol. They've just come to an agreement onto how to go about fixing them. But like I said, Shiro and Lance will be primary characters in the plot-driven continuation of this, so expect for this interaction to be revisited. </p>\n<p>It took a long of debating, but I decided on having the majority of the apology occur from Shiro's point of view. I wanted to explore just emotional I believe he'd get when presented with everything Lance is throwing at him here. Because I don't see him as a bad guy, but I do believe that he's a bit out of his depths sometimes, and it shows with the decisions he makes. I do love him though, regardless, and exploring the dynamic between him and Lance is something I wish I saw more in the fandom.</p>\n<p>I debated for a long while on how to conclude this chapter, but eventually decided that something humorous was the way to go. Because come on, this is Voltron, they're all a bunch of nuts at the end of the day lol. </p>\n<p>I am so overwhelmed with joy due to response to this fic and universe, all of your comments have given me life, and sometime tomorrow I will go through them all and reply to the ones I have not replied to yet. I'm glad people enjoy my writing, and that my interpretation of these wonderful characters was appreciated. Please anticipate more from me in the future!</p>\n<p>Now. Because I like to be suspenseful or whatever, here's something I wrote as a forward to the continuation of this universe.</p>\n<p>(“I don't see why you're so surprised,” Faraj says casually, “surely you didn't think that you all would be able to come together as one to form Voltron if you all weren't at least slightly compatible with all the lions?”</p>\n<p>“I mean…” Lance murmurs. It does make sense in a way. Voltron is all five lions. All five of them. It makes sense that not having a basic connection to all of the lions would make uniting difficult.</p>\n<p>“Paladins all have quintessence that mirrors their Lions, it's how the Lions choose their pilots,” Bin goes on, “however, part of the paladins quintessence has to be compatible in some way to all of the lions for you all to have formed Voltron as fast as you did.”</p>\n<p>“Everyone of you paladins have a slight connection to the other Lions outside of your destined one, but you, my friend,” Faraj smiles, “you have a lot of quintessence, and the strongest balance of it.”) </p>\n<p>A Hunk-focused oneshot surrounding the incident from the past should be up within the next few days, and you can expect more from the main universe in about a week, give or take! Thank you all so much!</p>\n<p>I'm just going to explore all my headcanons with this one lol.<br>I feel as though Lance is smart. Like, actually smart. I don't think he would have been selected to be the leader of two tech prodigies at the garrison if he couldn't at least keep up with them a little bit. It only makes sense that he picked up a few things, and if there's one thing that I actually do dislike about his characterization in the show, it's how ridiculously stupid they make him come off as sometimes (season two, I'm looking at you), especially considering he's shown to be quite capable and competent at other times.</p>\n<p>Anyways, I don't plan on this fic being very long, it's mainly to get my ideas out and to actually introduce myself to writing Voltron fics, but I have a plot planned out for this, and I hope to get it wrapped up within a few weeks or so.</p>",
  "text": "<p>Ok. So. Here's the deal.</p>\n<p>Lance is an older brother, he has three younger sisters. He's an uncle, he has a nephew and niece. He's a younger brother as well, with two older sisters (one who has fraternal twins) and one older brother. He's a firm middle child, the connection of two generations, and his mama has always relied on him to help keep the peace (<em>don't think about what she's doing without you, <strong>don't</strong></em>). He's good at it, he knows people in a general sense, and makes it a point to learn his friends as much as he's learned his family.</p>\n<p>Keeping everyone happy is no easy task, but Lance has it down to a science. A laugh here, a distraction here. A smile a day keeps the pain away. And on the very real chance that he can't them to smile (making someone laugh and annoying them go hand and hand after all), or the off chance that a smile is not what they need (because he knows people, and knows that smiling isn't a fix for everyone), then he's got that covered too.</p>\n<p>A shoulder to cry on? Lance is your guy. Someone who listens even if he doesn't understand? Lance can do that surprisingly well. That one guy who won't stop trying to compete with you but that's ok because you secretly have fun winning against him any way? Takes a bit more effort than he's used to, but Lance can do it. A silent presence subtly watching over you just to remind you that-hey, you're not alone here? This one has a tendency to break Lance's heart a bit, but he's got it covered.</p>\n<p>Being on the castle ship with only six other people and trying to save the universe is stressful though, so Lance often finds himself having to do the thing he's most good at, but also happens to sting from time to time.</p>\n<p>He lets them take out the frustrations on him. Encourages it really, because people need an outlet for their anger, and Lance has always been the best at making people angry at him.</p>\n<p>(And if his heart twinges a little every time he has to let someone be particularly mean to him, then he just has to remember that this is what he's good at. What he's good for.)</p>\n<p>But Lance is an older brother, and an uncle, and a younger brother. He learned sometimes keeping people means sacrificing his own feelings for a bit. He's been taught that he can't always let his feelings take a back seat though. After all, what happens if the rock falls apart?</p>\n<p>So, while Lance is always prepared to be the enemy on any given day, there are certain days and certain things that he will not let fly.</p>\n<p>Today is one of those days.</p>\n<p>….</p>\n<p>“Geez Lance,” Pidge groans, “will you stop being such an <em>idiot</em> and go away already!? You don't know anything, you don't listen to anything, you have <em>nothing productive to contribute at all</em>, so just take a hike already!”</p>\n<p>Her tone sounds harsh to even her own ears, and she has the brief thought that maybe this reaction was unwarranted. But Lance is just being so...<em>Lance</em>, running up and asking dozens of ridiculous questions and trying to get her to go to sleep. She's been working on this algorithm for going on six hours now and she'd finally had a breakthrough and here he comes and-</p>\n<p>“Excuse me?”</p>\n<p>Pidge pauses. Something in Lance's tone sounds much more...hostile than she's used to.</p>\n<p>She turns slowly and fixes her gaze upon her stupidly tall teammate, and is honestly a little unnerved to find him staring blankly down at her, looking distinctly unamused.</p>\n<p>It looks too much like how Shiro looks at her when she refuses to stop swearing. It's weird, so naturally her hackles raise.</p>\n<p>“I <em>said</em>,” Pidge asserts (and tries to ignore the twitch in Lance's eye), “to stop being such an idiot and go away. And stop looking at me like that!”</p>\n<p>Lance stares. Pidge stares back. There's a tense silence in which she realizes that she's probably overstepped some type of boundary. Oh no, Lance better not start crying like a-</p>\n<p>The absence of her laptop draws her attention, mainly because Lance proceeds to snatch it from her and close it shut.</p>\n<p>“Hey!” Pidge growls, ready to tear into Lance, feelings be damned.</p>\n<p>“Be quiet Pidge.”</p>\n<p>The noise she makes is a straight up squawk, Pidge is a ashamed to admit. Just who the he'll does Lance think he is!?</p>\n<p>“I'm sorry Lance,” she growls, “but who died and made you leader? You have no control over me, now give me back my fucking laptop or else I’ll grab my bayard and-”</p>\n<p>“<em>Listen to me</em>,” Lance snarls back, lip curling and eyes hard.</p>\n<p>Pidge’s mouth snaps shut without her permission, because holy hell- who is this guy and what has done with Lance?</p>\n<p>No teasing grin, no smug countenance, no stupidly goofy but still-somehow-kind-of-charming smile. Just a visibly angry Cuban boy who looks like he's holding himself back from smacking her.</p>\n<p>Pidge swallows.</p>\n<p>“All I came here to do was to get you to take a break,” Lance says sternly, no hint of humor in his eyes. “You haven’t eaten in six hours, haven't slept in god knows how longer, and I just watched you type out the same line of code and delete it three times in a row.”</p>\n<p>Feeling chastised and somewhat embarrassed, Pidge looks away. She always forgets that Lance does in fact have a basic knowledge of both coding and engineering, things he made an active effort to learn in order to relate to herself and Hunk respectively. She knows that it sometimes hurts his feelings when she writes him off as dumb just because he can't follow the more complex aspects.</p>\n<p>“I'm just trying to <em>help you</em>,” his voice raises slightly, and Pidge flinches. “Everyday I try and find some way to help you,” Lance snaps, “and not that it's required, but it would be nice to get a damn ‘<em>thanks for listening Lance</em>’ or ‘<em>thanks for bringing me food</em>’ from time to time. But no, I get snarked at and insulted!”</p>\n<p>It's been awhile since Pidge had felt like this, like she's totally fucked up. It reminds her of when Matt used to snap from time to time when she was being particularly obnoxious.</p>\n<p>“And that's fine!” Lance is full on giving her the third degree now. Pidge feels like the universe has turned upside down or something. “Because what else do people do around here if not snarking at me and insulting me! I expect that, but I also expect some common decency. You know, because we're all people up here, right?”</p>\n<p>Pidge hunches her shoulders.</p>\n<p>“...<em>right</em>!?”</p>\n<p>“Right,” Pidge will never admit to squeaking, but she knows she can't hide how big her eyes are when she looks and sees how red and angry Lance's face looks. She doesn't know how to deal with this.</p>\n<p>“So what you're <strong>not</strong> going to do,” Lance's voice lowers, eyes as icy as Blue's laser. “Is treat me like this. I've not once tried to make you feel bad or hurt you since we've been up here. I've respected you as a person, as my teammate, and as my friend. You need to me show at least some of the same respect, which means <em>you need to stop speaking to me like that.”</em></p>\n<p>Her eyes feel hot. Ain't that a bitch? The Green Paladin of Voltron reduced to guilty tears because she got told about herself by her always-joking-but-apparently-not teammate. Pidge feels as though this had been a long time coming.</p>\n<p>“I…” she gulps. “I’m sorry Lance,” she insists meekly. Pidge isn't good with emotions, and is less good with emotional people, so this isn't the first time she's crossed a line with the blue paladin. It is however, the first time he's snapped back. She should have known that Lance losing his temper would be this unnerving, it's always the goofy ones.</p>\n<p>But one thing Lance is not, and has never been, is cruel. So when he notices she's on the verge of tears, he softens visibly, but still has a stern look on his face as he hold her laptop closer to his torso.</p>\n<p>“I'll give this back to you after you've at least eaten something,” he says softly.</p>\n<p>Pidge wants to protest. Actually opens her mouth to do so, but Lance's expression hardens tremendously the moment he sees this and Pidge quickly comes to the conclusion that she needs to do what he says.</p>\n<p>“Ok,” she mutters.</p>\n<p>And as Lance gives her a kind smile, that look parents get when they feel bad for shouting at their kids but recognize that it was necessary on his face, something is put into real perspective for Pidge.</p>\n<p>Lance really is a big brother.</p>\n<p>Probably one of the best anyone could ask for, really.</p>\n<p>\n<span>“Is Lance ok?”</span>\n</p>\n<p> </p>\n<p>\n<span>Hunk is just minding his business, trying to figure why this creepy red alien pepper moved when he tried to boil it, when Pidge walks into the kitchen, face kind of sullen.</span>\n</p>\n<p> </p>\n<p>\n<span>“What?” Hunk asks, immediately worried. Is Lance ok? Why is Pidge asking him this? “Why are you asking me that?” Have she seen Lance today? “Have you seen him today?” Hunk hasn’t yet. Did she see him and he was hurt? “Oh my god, is he hurt?” </span>\n</p>\n<p> </p>\n<p>\n<span>“What?” Pidge frowns, “no. He’s not hurt, calm down...what are you doing?”</span>\n</p>\n<p> </p>\n<p>\n<span>She stares at where Hunk is currently trying to force the wiggling pepper into the pink water (Coran said it wouldn’t kill them), but he’s not having a very easy time because the thing is strong.</span>\n</p>\n<p> </p>\n<p>\n<span>“It’s strong,” it’s important than Pidge knows this too. “I don’t know what happened, it didn’t move at all when I peeled it, and I even chopped one to bits the other day when I tried to cook that shell thing,” it didn’t go well, “and that one didn’t do anything. But the moment I brought this guy close to the water, he went all Hulk on me!” </span>\n</p>\n<p> </p>\n<p>\n<span>“Interesting,” Pidge hums, “maybe it’s a reflex? A physiological response in it’s muscles to the water? Or the steam?”</span>\n</p>\n<p> </p>\n<p>\n<span>“But it shouldn’t have muscles,” it’s a pepper. “And it doesn’t have a brain, so reflexes are out?”</span>\n</p>\n<p> </p>\n<p>\n<span>Pidge comes closer, “...maybe it’s not really a pepper. It could be an insect? Remember those beans that actually turned out to be man-eating crickets?”</span>\n</p>\n<p> </p>\n<p>\n<span>Hunk shivers at the reminder, almost letting the pepper hop out of his hands. He’d had to apologize to Lance so many times-</span>\n</p>\n<p> </p>\n<p>\n<span>Wait. </span>\n</p>\n<p> </p>\n<p>\n<span>They got sidetracked, Hunk realizes, letting the pepper go and ignoring it as it hops away (</span>\n<em>\n<span>maybe it’s not a pepper after all…)</span>\n</em>\n<span>. Instead he turns to Pidge to panic again.</span>\n</p>\n<p> </p>\n<p>\n<span>“What’s wrong with Lance!?” he demands. The blue paladin had been just fine when Hunk has last spoken to him, but Lance has always been a little bit moody, and space has not made it better.</span>\n</p>\n<p> </p>\n<p>\n<span>He’s imagining his friend curled up in ball somewhere (which, Hunk has only caught him twice, but he knows it happens way more often than that), when Pidge flushes, looking meek.</span>\n</p>\n<p> </p>\n<p>\n<span>“Did something happen between you and him?” Hunk knows that Pidge was working on something, and he knows how Lance can be. Maybe she snapped and his friend’s off licking his wounds somewhere. Or maybe Lance was already upset and she snapped and he’s off licking his wounds somewhere. Not doing much to help the image of his friend curled up in a ball.</span>\n</p>\n<p> </p>\n<p>\n<span>“He…” Pidge murmurs, before sighing. “Ok, you cannot tell anyone about this,”</span>\n</p>\n<p> </p>\n<p><span>“Oh my god you both </span><em><span>hooked</span></em> <em><span>up</span></em><span>!” it’s all in the flush in her face, and her abnormally small demeanor like she’s embarrassed. But wait. There’s no way in hell that Lance would go there. So.</span></p>\n<p> </p>\n<p>\n<span>“Or you have a crush on him and you’re embarrassed about it so lashed out and hurt his feelings and now Lance is somewhere upset and feeling awkward and guilty because he doesn’t return your feelings and he’s sad that he has to reject you and you’re asking me if he’s ok because you know I have experience dealing with this type of situation and you don’t want to tell Shiro because you know he’d go all dad and make you both talk about feelings and why would you tell Keith about this? No offense to Keith, but his emotional range leaves a lot to be desired and-”</span>\n</p>\n<p> </p>\n<p>\n<span>“NO!” Pidge shrieks finally, expression horrified. “Hunk! What the hell?”</span>\n</p>\n<p> </p>\n<p>\n<span>“It’s the only logical conclusion!” Hunk cries.</span>\n</p>\n<p> </p>\n<p>\n<span>“How!?” she waves her hands, face tomato-red.</span>\n</p>\n<p> </p>\n<p>\n<span>“Because you’re blushing!” Hunk insists, poking her cheek and retreating quickly to avoid her swing, “So you’re embarrassed and-”</span>\n</p>\n<p> </p>\n<p>\n<span>“I’m embarrassed because Lance just parent-ed the shit out of me!” Pidge snarls, “Not because I have a crush on him!”</span>\n</p>\n<p> </p>\n<p>\n<span>Hunk stares.</span>\n</p>\n<p> </p>\n<p>\n<span>Pidge stares.</span>\n</p>\n<p> </p>\n<p>\n<span>Oh.</span>\n</p>\n<p> </p>\n<p>\n<span>Ohhhhhh.</span>\n</p>\n<p> </p>\n<p>\n<span>Hunk snorts.</span>\n</p>\n<p> </p>\n<p>\n<span>“Hunk you asshole!” Pidge shouts, “I can’t believe you’re laughing at me!”</span>\n</p>\n<p> </p>\n<p>\n<span>“To be fair,” Hunk corrects, “I’m not laughing yet. I’m reserving that reaction for when you tell what exactly you did to make Lance scold you.”</span>\n</p>\n<p> </p>\n<p>\n<span>“How do you know it’s my fault?” Pidge says so offended, arms crossed. But Hunk had known Lance for a long time now. And he knows that Lance would never lose his cool with Pidge unless it was warranted. She doesn’t realize that she gets prime Hunk-treatment, in that Lance will never get genuinely angry with her unless she crosses a line. </span>\n</p>\n<p> </p>\n<p>\n<span>(Hunk has only crossed one line, once. Several years ago. He will never do that again. </span>\n<em>\n<span>Ever</span>\n</em>\n<span>.)</span>\n</p>\n<p> </p>\n<p>\n<span>“You asked if he was ok,” Hunk explains, “so you're worried about him. And I don't think you'd be worried about him instead of angry at him if it wasn't kind of your fault. No offense.”</span>\n</p>\n<p> </p>\n<p>\n<span>Pidge deflates, “I said something kind of mean.”</span>\n</p>\n<p> </p>\n<p>\n<span>“You say ‘kind of mean’ things to him all the time,” Hunk points out, ignoring her guilty flinch. Something was different this time.</span>\n</p>\n<p> </p>\n<p>\n<span>“Ok, it was really mean,” Pidge pouts, “and completely unwarranted because all he did was suggest that I take a break because it looked like I had hit a roadblock and then I went all bitch mode.”</span>\n</p>\n<p> </p>\n<p>\n<span>She huffs, face still red.</span>\n</p>\n<p> </p>\n<p>\n<span>“And then he took my laptop and said he wouldn't give it back until I ate.” </span>\n</p>\n<p> </p>\n<p>\n<span>Hunk's eyebrows raise. Pidge got punished.</span>\n</p>\n<p> </p>\n<p>\n<span>“You got punished,” he says as if she's unaware. Shiro doesn't even do that.</span>\n</p>\n<p> </p>\n<p>\n<span>“Dammit Hunk, don't laugh!”</span>\n</p>\n<p> </p>\n<p>\n<span>“Sorry,” Hunk laughs, even though he's totally not. She brought this on herself. “Lance will be ok,” he states, because she asked. “You know he's just doing because he cares?” He asks, because it's important that she know.</span>\n</p>\n<p> </p>\n<p>\n<span>“I know,” she sighs, finally going over to slump at the table. “He'll be ok?”</span>\n</p>\n<p> </p>\n<p>\n<span>Hunk smiles, “He'll be fine.” The yellow paladin will have to hunt Lance down to make sure, but Pidge doesn't need to know that. “As long as nobody else upsets him today.”</span>\n</p>\n<p>\n<br>\n<br>\n<br>\n</p>\n<p>\n<span>He shouldn't have said that.</span>\n</p>\n<p>\n<br>\n<br>\n<br>\n<br>\n</p>\n<p>\n<span>Keith is angry. </span>\n</p>\n<p> </p>\n<p>\n<span>There's no other word for it. He's angry. He's pissed actually, and for a lot of different reasons. </span>\n</p>\n<p> </p>\n<p>\n<span>To begin, Red had locked him out this morning after training.</span>\n<em>\n<span> Again</span>\n</em>\n<span>. One would think that after she'd tore through an entire base in order to save him that her occasionally raising her barrier against him would stop happening. Well. No. It still happens. </span>\n</p>\n<p> </p>\n<p>\n<span>“What is wrong with you?” He'd groaned. But he knew. Red had developed a tendency to get moody (and despite what Coran says, the lions</span>\n<em>\n<span> do so </span>\n</em>\n<span>get moody) whenever Keith went off to do something with people from the Blade. Shiro and Allura had decided to give the paladins a break from training today, so Keith had accepted the offer to help train with his galra blade. And then Red locked him out.</span>\n</p>\n<p> </p>\n<p>\n<span>And then, Coran had made him clean the healing pods (technically he asked quite nicely, but had cornered Keith in Red's hanger and offhandedly mentioned that the red paladin was the only one who hadn't helped him with it at least once). This was upsetting for multiple reasons, because apparently they didn't quite know how to filter out human blood because of the iron content or something? So Keith had ended having to scrub layers of dried blood from the bottom of the pods. And then two of the pods had tried to eat him. Because apparently there were random sensors along the rim that when brushed a certain way, activated an automatic diagnostic and quick-fix function or something (though this is actually really good to know. God forbid any of them be injured and have to get themselves in the pod because no one is around).</span>\n</p>\n<p> </p>\n<p>\n<span>And Keith is very fond of Coran, but damn, that Altean can talk. </span>\n</p>\n<p> </p>\n<p>\n<span>It had also been a bit of a crap week so far in the first place. Zarkon's forces had went insane when news of his defeat spread. Haggar had gone into hiding for them being, but Allura was determined to begin reestablishing inter-galactic relations between planets and galaxies that they'd freed. So it had been diplomatic mission after diplomatic mission lately, which Keith hated in the first place, and it was made even worse by the fact that somehow, a Galran commander always caught wind of where they were and tried to screw things up for them. And while their missions had all been relative successes so far, the constant participating in weird diplomatic events only to then have to deal with a galran fleet was taking its tole. </span>\n</p>\n<p> </p>\n<p>\n<span>And to top things off, Keith is currently stalking down the hallways looking for some way to channel his aggression because </span>\n<em>\n<span>the training deck is broken</span>\n</em>\n<span>. Or, not technically broken, something is wrong with something in the calculations for the difficulty levels so until Coran and Allura figure it out, none of them are allowed to do training sequences because there's a chance that a level one sequence might throw a level ten gladiator at them. And Shiro is doing some weird mental thing with Black, and that's a thing he can do, because the Black Lion does </span>\n<em>\n<span>not </span>\n</em>\n<span>randomly lock Shiro out.</span>\n</p>\n<p> </p>\n<p>\n<span>So yeah. Angry. Pretty good description of Keith right now. And he needs to find a way get at least some if the frustration out. Otherwise he'll go crazy.</span>\n</p>\n<p> </p>\n<p>\n<span>Keith spies Lance in the hall. Okay then.</span>\n</p>\n<p> </p>\n<p>\n<span>The blue paladin has yet to pick a fight with Keith at all this week. Nor has he come up with some weird and convoluted competition that Keith will never admit to having fun with. In fact, Lance's “mullet” comments have been lacking this week as well. He seems to have been spending a lot of time with Hunk or by himself lately. Keith frowns and moves to catch up with the blue paladin.</span>\n</p>\n<p> </p>\n<p>\n<span>“Lance,” he calls, already prepared for a comment on his hair (it's Lance's go to way of acknowledging Keith's presence). Lance turns around, something clutched in his arms, and Keith catches a brief glance of a surprisingly somber expression before Lance grins.</span>\n</p>\n<p> </p>\n<p>\n<span>“Yo mullet-man,” he's not disappointed. But nothing more comes. Keith's a bit shocked to find himself being gazed at expectantly, Lance normally has more to say than that.</span>\n</p>\n<p> </p>\n<p>\n<span>“Uh…” Keith doesn't know how to start a conversation with anyone but Shiro or Pidge on this ship, least of all the blue paladin. </span>\n</p>\n<p> </p>\n<p>\n<span>“Are you bored or something?” Lance chuckles.</span>\n</p>\n<p> </p>\n<p>\n<span>“No!” Keith denies quickly. He can't have Lance thinking that he's the one the red paladin seeks out when he's bored. Keith would never hear the end of it. </span>\n</p>\n<p> </p>\n<p>\n<span>And besides, Keith really isn't bored. He's angry. There's a steady thrum of irritation and unrest coursing through his body and what he wants right now is a good outlet. Lance is a good outlet. </span>\n</p>\n<p> </p>\n<p>\n<span>“Are you bored?” He asks accusingly, trying to get Lance to taunt him. Keith is frustrated, but he still has enough wherewithal to remember that Lance is one who's good at starting a fight without letting any actual feelings be hurt. It's a talent, Keith came to that conclusion one day, because anytime he himself starts a fight with anyone, he always crosses a line from the get go.</span>\n</p>\n<p> </p>\n<p>\n<span>Lance is good at annoying people without actually offending them. He can tease people and not hurt their feelings. He can taunt Keith and bring him into a bickering session without actually making Keith want to punch him. He's very good at being annoying and obnoxious while remaining completely harmless.</span>\n</p>\n<p> </p>\n<p>\n<span>Keith's counting on this, so Lance's heavy sigh and head shake throw him off.</span>\n</p>\n<p> </p>\n<p>\n<span>“What's up with you Keith?” He asks.</span>\n</p>\n<p> </p>\n<p>\n<span>The red paladin frowns. This is not how he expected this to go. He doesn't want to talk.</span>\n</p>\n<p> </p>\n<p>\n<span>“Nothing,” he'll try again then, “what's up with you?”</span>\n</p>\n<p> </p>\n<p>\n<span>Lance's eyes narrow, and Keith finally thinks he's going to make some teasing or challenging comment. He doesn't.</span>\n</p>\n<p> </p>\n<p>\n<span>“Ok,” the brunet sighs, clutching what Keith now realizes is Pidge’s laptop closer to him. “I don't really have time for this, so I'm just gonna walk away now.”</span>\n</p>\n<p> </p>\n<p>\n<span>Keith scowls. This moody version of Lance pops up from time to time, and if it were any other day, he would leave him alone. But Keith is still angry, and the last time he saw Lance with something of Pidge's and didn't say anything, he somehow got tied to a ridiculous prank and lectured by both Shiro and Allura. So. </span>\n</p>\n<p> </p>\n<p>\n<span>“Why do you have Pidge's laptop?” If Lance won't start, then Keith will have to anyway.</span>\n</p>\n<p> </p>\n<p>\n<span>Irritation flashes briefly across the blue paladin's face. But not hurt or offense, Keith's doing well so far.</span>\n</p>\n<p> </p>\n<p>\n<span>“Don't worry about it,” Lance says dismissively. Keith isn't used to this.</span>\n</p>\n<p> </p>\n<p>\n<span>“Did you steal it again?” He keeps pushing, ignoring the voice at the back of his head (which may actually be Red...but he's annoyed with her right now) telling him to leave it.</span>\n</p>\n<p> </p>\n<p>\n<span>“I said,” Lance is definitely irritated right now, “don't worry about it.” </span>\n</p>\n<p> </p>\n<p>\n<span>It's not the same form of annoyance Keith is used to, which is explosive and over the top and dramatic. No, Lance's voice is stern and his face is two steps from done, like he's dealing with a kid or something. Keith has the brief thought that maybe he should stop, but now Lance is just making him even more angry.</span>\n</p>\n<p> </p>\n<p>\n<span>“Is it another one of your stupid pranks again?” The red paladin pushes on aggressively, stepping a bit closer. “Because last time I had to hear all about even though I had nothing to do with it! This isn't the time to be joking around Lance! We should be focusing. You should be focus-”</span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>God dammit</span>\n</em>\n<span> Keith!” Lance snaps finally, fire in his eyes. But it's not like usual, his lip doesn't normally curl like that, and his frown is never quite so...severe. Keith stares. “This is none of your damn business! Why the hell are you even bothering me!? Go beat on a gladiator or something!” </span>\n</p>\n<p> </p>\n<p>\n<span>Keith had been feeling just a bit guilty, right up until Lance mentioned the reason he was angry in the first place. The situation seems a bit more dangerous than normal with the blue paladin, but at least Keith can finally vent.</span>\n</p>\n<p> </p>\n<p>\n<span>“I can't, the training deck is broken,” he snaps back.</span>\n</p>\n<p> </p>\n<p>\n<span>“Oh,” Lance's tone is bitter, “I get it. Can't beat up on the gladiator so Lance is next best thing huh?” </span>\n</p>\n<p> </p>\n<p>\n<span>Keith isn't sure why it kind of stings to hear Lance's voice sound like that. The blue paladin is exactly right after all.</span>\n</p>\n<p> </p>\n<p>\n<span>“Well it's not like you do anything productive with your time,” Keith states.</span>\n</p>\n<p> </p>\n<p>\n<span>Lance's mouth twists and his jaw visibly clenches, face going red with anger. Ok. That's new.</span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>You</span>\n</em>\n<span>,” the blue paladin points at Keith sharply, “are being so </span>\n<em>\n<span>rude </span>\n</em>\n<span>right now. I think you need to back off.”</span>\n</p>\n<p> </p>\n<p>\n<span>Feeling scolded, Keith bites back immediately.</span>\n</p>\n<p> </p>\n<p>\n<span>“Ok I know you miss your mom or whatever, but that doesn't mean you can just act like her to us. She isn't here Lance, don't be a baby about it.”</span>\n</p>\n<p> </p>\n<p>\n<span>It's the wrong thing to say. In any situation or circumstance, Keith is wrong to say something like that. He realizes this right after the words leave his mouth.</span>\n</p>\n<p> </p>\n<p>\n<span>And even if Keith didn't have the awareness to realizes it himself, Lance's positively thunderous expression would have given it away.</span>\n</p>\n<p> </p>\n<p>\n<span>“Now you?” Lance speaks through grit teeth. </span>\n</p>\n<p> </p>\n<p>\n<span>“What?” Keith isn't sure what that's supposed to mean, but he doesn't have the chance to think about because Lance is suddenly in his face and looking more mad than Keith has ever seen him before.</span>\n</p>\n<p> </p>\n<p>\n<span>“I haven't done anything to you Keith!” Lance shouts right in the red paladin's face. Keith is so shocked that he flinches. “What is your </span>\n<em>\n<span>problem </span>\n</em>\n<span>man? I haven't bothered you today! I haven't bothered you </span>\n<em>\n<span>all week</span>\n</em>\n<span>! </span>\n<em>\n<span>Why are you bullying me right now</span>\n</em>\n<span>!?”</span>\n</p>\n<p> </p>\n<p>\n<span>Bully?</span>\n</p>\n<p> </p>\n<p>\n<span>Keith's eyes widen, “I'm not trying to bully you- I just,” he shouldn't have pushed. He crossed a line just like he knew he would if he pushed.</span>\n</p>\n<p> </p>\n<p>\n<span>“You are so!” Lance's face is redder than Keith thought possible for his skin tone, “and for what!? Just because you're mad and you want someone to take it out on? We're supposed to be </span>\n<em>\n<span>friends</span>\n</em>\n<span>, Keith!” </span>\n</p>\n<p> </p>\n<p>\n<span>“N-no that's not it. I just,” Keith will hate himself for stuttering later, but right now he's just trying to figure why Lance shouting in his face is so upsetting. They are friends.</span>\n</p>\n<p> </p>\n<p>\n<span>“Oh it's not?” Lance scoffs. “What is it then? Tell me what I've done, Keith. Tell me what I've ever done to deserve you disrespecting the way I feel about my family like that.” </span>\n</p>\n<p> </p>\n<p>\n<span>Keith draws in a sharp breath, heart beating fast, anger giving way to panic because </span>\n<em>\n<span>this was not supposed to happen like this.</span>\n</em>\n<span> Lance was supposed to fight back as usual, but not like this. Not this bitter cold anger and voice shook with rage. Keith wasn't supposed to hurt him. He didn't want to hurt him.</span>\n</p>\n<p> </p>\n<p>\n<span>“...Well!?” Lance snaps expectantly, “I'm waiting! Give me one time I've ever done my best just to hurt your feelings.”</span>\n</p>\n<p> </p>\n<p>\n<span>Keith can't. He can't give a single example because one doesn't exist, other than maybe the dropout comment when they first saved Shiro (but even that doesn't really count because Keith had did the same by forgetting Lance and calling him a cargo pilot, albeit unknowingly). But they didn't know each other then, and Lance was quick to pick up on what to say and what not say around Keith and had never so much as pushed a line since. </span>\n</p>\n<p> </p>\n<p>\n<span>“You know what?” Lance's shoulders drop and all at once he just looks exhausted. Keith swallows around a lump in his throat, eyes hot. He didn't </span>\n<em>\n<span>mean </span>\n</em>\n<span>to hurt him. “You need to go eat something that Hunk makes, maybe a decent meal will settle whatever crap mood you're in.” </span>\n</p>\n<p> </p>\n<p>\n<span>“Lance,” Keith murmurs, ashamed of himself. </span>\n</p>\n<p> </p>\n<p>\n<span>“And when you go tot the kitchen and eat something,” it's not a request, “give this back to Pidge.” He thrusts the laptop into Keith's arms, “but only if she's eaten.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Which, by the way,” Lance continues on flatly, “is why I had it. So she wouldn't go almost ten hours without food or sleep and pass out on the training deck. Again. Not that it's any of your business.”</span>\n</p>\n<p> </p>\n<p>\n<span>Keith sighs. He'd screwed up big time.</span>\n</p>\n<p> </p>\n<p>\n<span>“Never,” Lance says lowly, “disrespect. My family. Again.”</span>\n</p>\n<p> </p>\n<p>\n<span>Keith is helpless to do anything but nod.</span>\n</p>\n<p>\n<br>\n<br>\n</p>\n<p>\n<span>“I swear I just saw it!” Pidge grumbles, crouching down and examining the space under the table.</span>\n</p>\n<p> </p>\n<p>\n<span>“Oh man,” Hunk groans, “Allura is going to be so mad.” </span>\n</p>\n<p> </p>\n<p>\n<span>This is the fifth time in the last two months that something Hunk had thought was food has upped and walked away. Now some weird hopping pepper is loose in the castle. The only saving grace is that it didn't try to bite them. Lots of things in space bite. They've learned this.</span>\n</p>\n<p> </p>\n<p>\n<span>“Does it generate body heat?” Pidge asks curiously. “We might be able to use a BLIP to find it.” </span>\n</p>\n<p> </p>\n<p>\n<span>“It didn't feel like it generated body heat!” Hunk complains. Oh how he longs for the days where he could just eat his food. Now his life is full of man-eating cricket beans and aquaphobic peppers. </span>\n</p>\n<p> </p>\n<p>\n<span>Oh? And purple space cats trying to kill them.</span>\n</p>\n<p> </p>\n<p>\n<span>“Do you think Keith has any new special dietary needs?” Hunk asks curiously. What do Galra even eat?  </span>\n</p>\n<p> </p>\n<p>\n<span>Pidge goes with it. “Probably not, he's gone his whole life eating earth food and never seems to have any bad reactions to what we eat here. His galra genes are probably too recessive.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Yeah,” it makes sense. “Do you think he has some special galra traits that he's always thought of as normal but really aren't?”</span>\n</p>\n<p> </p>\n<p>\n<span>“It's possible,” Pidge responds, moving over to look underneath the thing they use as a freezer, “it might help to explain his intuition. He could literally just have better senses than all of us.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Er, Hunk?” comes the surprisingly small voice of Keith as his shuffles into the kitchen. They turn to look at the red paladin, almost instantly taking in his sullen face and dewy eyes.</span>\n</p>\n<p> </p>\n<p>\n<span>Hunk is worried, “What's wrong buddy?”</span>\n</p>\n<p> </p>\n<p>\n<span>Keith bites his lip, frustration and guilt flashing across his face.</span>\n</p>\n<p> </p>\n<p>\n<span>“Why do you have my laptop?” Pidge questions, “did you see Lance?”</span>\n</p>\n<p> </p>\n<p>\n<span>Oh no.</span>\n</p>\n<p> </p>\n<p>\n<span>Hunk's eyes widen as Keith flinches and nods.</span>\n</p>\n<p> </p>\n<p>\n<span>“Keith no,” Hunk groans. Because he has a pretty good idea as to what happened. They've all been kind of stressed lately, and Hunk knows that the training deck has been experiencing some weird malfunctions. With Keith's main outlet for frustration gone…</span>\n</p>\n<p> </p>\n<p>\n<span>“I messed up,” Keith sighs. Then he turns to Pidge, “did you eat?” </span>\n</p>\n<p> </p>\n<p>\n<span>Pidge blinks. “Not yet?”</span>\n</p>\n<p> </p>\n<p>\n<span>Keith sighs again, “I'm not supposed to let you have this until you eat.”</span>\n</p>\n<p> </p>\n<p>\n<span>The green paladin pouts, but nods anyway.</span>\n</p>\n<p> </p>\n<p>\n<span>Hunk is freaking out.</span>\n</p>\n<p> </p>\n<p>\n<span>“What happened?” He cries. Pidge was bad enough, but now Keith too? He's going need to do some serious damage control after dinner tonight. Is everyone going out of their way to upset his best friend today?</span>\n</p>\n<p> </p>\n<p>\n<span>No. That's not fair. Hunk knows that Pidge feels bad about hurting Lance's feelings. And if they way Keith looks is any indication, then red paladin feels awful. But it's ok. </span>\n</p>\n<p> </p>\n<p>\n<span>Hunk can fix this. But he needs to know the damage.</span>\n</p>\n<p> </p>\n<p>\n<span>“Keith,” he implores, meeting glassy eyes. “I need you to tell me what happened.”</span>\n</p>\n<p> </p>\n<p>\n<span>“I said some things.” </span>\n</p>\n<p> </p>\n<p>\n<span>“Ok?” Hunk asks expectantly, but Keith doesn't seem willing to offer up any more details. “Keith, I </span>\n<em>\n<span>need </span>\n</em>\n<span>to know what you said.” </span>\n</p>\n<p> </p>\n<p>\n<span>He doesn't want to push the red paladin, because it looks like Lance had tore into him pretty bad, but it's important. Lance never forgets what people say to him, and Hunk needs to make sure that Keith's words won't send Lance to that dark place he's been teetering on the edge of for the past week.</span>\n</p>\n<p> </p>\n<p>\n<span>“Something about him not focusing,” Keith responds, “but what really set him off was what I said about his mom.”</span>\n</p>\n<p> </p>\n<p>\n<span>Pidge gives a low whistle and Hunk sighs. Keith really needs to find a more productive way of channeling anger.</span>\n</p>\n<p> </p>\n<p>\n<span>But while the mom thing is mean and beyond uncalled for, it's not something that Lance will take to heart as long as Keith never says it again. Neither is the unfocused thing for that matter. Hunk's mildly relieved, it could be much worse.</span>\n</p>\n<p> </p>\n<p>\n<span>“The best thing to do now is to let him cool off for a bit,” Hunk murmurs to himself really, but he's aware that Keith and Pidge are listening. “He needs time, he won't stay mad at you, but he needs time to be alone.”</span>\n</p>\n<p> </p>\n<p>\n<span>Keith gives another heavy sigh.</span>\n</p>\n<p> </p>\n<p>\n<span>“I didn't mean to hurt him,” he mutters.</span>\n</p>\n<p> </p>\n<p>\n<span>“I know buddy,” Hunk responds, but doesn't go over to hug the red paladin. As much as it sucks, Keith and Pidge both need to stew in their own guilt for a moment, and Hunk comforting wouldn't be doing anything but condoning them hurting Lance. Which he will not do. </span>\n</p>\n<p> </p>\n<p>\n<span>He also won't let them be miserable though. They both need to eat and sleep for a bit. Time for the </span>\n<em>\n<span>special </span>\n</em>\n<span>stew.</span>\n</p>\n<p> </p>\n<p>\n<span>Hunk makes his way over to the still-boiling water, new game plan in mind. “Alright,” he says cheerfully, “the hopping pepper can wait!”</span>\n</p>\n<p> </p>\n<p>\n<span>“What?” He hears Keith ask Pidge.</span>\n</p>\n<p> </p>\n<p>\n<span>“I can make my cinnamon stew instead!” He goes, smiling brightly as he grabs for the ingredients. Everything will be fine. Hunk will make sure of it. </span>\n</p>\n<p> </p>\n<p>\n<span>Besides, there's no way anyone else is going to cross a line with Lance again today.</span>\n</p>\n<p> </p>\n<p>\n<span>Right?</span>\n</p>\n<p>\n<br>\n<br>\n</p>\n<p>\n<span>One thing Shiro has grown to love? Talking to Black.</span>\n</p>\n<p> </p>\n<p>\n<span>After his Lion preserved his body and his consciousness in the astral plane, he'd spent a great deal of time connected directly to her. Shiro was privy to her innermost thoughts and memories, he'd felt her in every way a human being could feel. And when he'd finally woken up in the cockpit one to the teary eyed faces of his team, Shiro had found a new level of peace. </span>\n</p>\n<p> </p>\n<p>\n<span>He relies on that peace, more than he probably should honestly. But between the constant activity and general sense of foreboding surrounding the ship due to Haggar’s whereabouts still being unknown, Shiro has come to savor his daily moments alone with the Black Lion. </span>\n</p>\n<p> </p>\n<p>\n<span>It's something they should all probably strive for, Shiro believes, but the uncertainties surrounding the astral plane and how it works have him reluctant to suggest it as a new training method. Everyone has a solid bond with their lion, forming Voltron has never felt smoother lately, so he's satisfied. </span>\n</p>\n<p> </p>\n<p>\n<span>Shiro walks leisurely towards the direction of the training deck. He wonders if Allura and Coran have managed to fix it yet, thinking back to how annoyed Keith had seemed when they were both told about the malfunction this morning. Group training had been cancelled, at Shiro's own suggestion, but Keith has always gotten restless and snippy if there's no way to work out his frustration.</span>\n</p>\n<p> </p>\n<p>\n<span>The plan had been to run through a few training sequences together, as Keith had been particularly wound up this week for some reason, but Coran had been adamant that the miscalculations in the sequence data could end up being very bad for them. Keith had instead gone to train with the Blade of Mamora, which had been traveling alongside the castle in their attempts to establish alliances lately, hoping that the deck would be fixed by the time he'd returned.</span>\n</p>\n<p> </p>\n<p>\n<span>Shiro certainly hopes that Keith has found a way to relax by now, because he knows from Black that Red had locked her paladin out for going with the Blade instead of practicing maneuvers with her. If he hasn't, then his friend is surely infuriated by now, and Shiro would rather it not become a problem for the team dynamics.</span>\n</p>\n<p> </p>\n<p>\n<span>The only one who hasn't seemed off this week is Hunk, if Shiro's being completely honest, who has been doing his routine of splitting his time between the kitchen and meals with everyone, talking tech and theory with Pidge, examining Yellow here and there, and spending time with Lance. Pidge has been working on several algorithms to modify the castle’s communication scans in hopes of zeroing in on her family's location, and Shiro knows for a fact that she's not sleeping or eating enough, but he's come to realize that he can rely on Lance to step in before it becomes too bad (from what he'd heard, their two Legs had been invaluable to the team's stability in his short absence). </span>\n</p>\n<p> </p>\n<p>\n<span>Lance has been...odd, this past week. He hasn't been around as much, and has been on the quiet side when he is around. Shiro hasn't bothered him about anything because Hunk has been hyperattentive to the blue paladin, but he has noticed some alarmingly dark looks on their resident jokester’s face. Shiro's worried about him potentially riling Keith up too much or pushing Pidge too far. Lance can be careless with his words sometimes.</span>\n</p>\n<p> </p>\n<p>\n<span>“Hey Shiro,” Pidge's voice pulls him out of his musings, and he turns to smile at the green paladin.</span>\n</p>\n<p> </p>\n<p>\n<span>“How are you feeling?” He asks automatically, not just because he knows she's been working too much, but also because she's clutching her laptop to her chest and looking quite meek.</span>\n</p>\n<p> </p>\n<p>\n<span>“Hunk made some stew that tastes like cinnamon gum,” Pidge responds thoughtfully, yawning just a bit. “It was actually pretty good? Think something in there affects melatonin though, I just got super sleepy in like, the last twenty minutes. I'll have to ask Keith later if he felt it too, hopefully he'll be less panicky.” </span>\n</p>\n<p> </p>\n<p>\n<span>Shiro stiffens.</span>\n</p>\n<p> </p>\n<p>\n<span>“Panicky?” He asks carefully. Pidge doesn't seem fully coherent as she rubs her eye adorably (not that he would ever tell her that), but she's still able to answer.</span>\n</p>\n<p> </p>\n<p>\n<span>“About Lance,” she says as if that explains everything.</span>\n</p>\n<p> </p>\n<p>\n<span>Worry for both of his teammates curls up in his gut. What's happened </span>\n<em>\n<span>already</span>\n</em>\n<span>? He was only with Black for...actually, he's not quite sure. Time is weird on the Astral Plane. Some days he's there for half an hour and other days Lance has to tell Blue to tell Black to tell Shiro that he's pushing eight hours. </span>\n</p>\n<p> </p>\n<p>\n<span>“What happened between Keith and Lance?” Shiro tries to keep his voice calm, because Pidge looks like she's about to finally sleep for more than four hours without someone making her, but the thought of a panicky Keith hurts. </span>\n</p>\n<p> </p>\n<p>\n<span>“Lance is on a warpath today,” Pidge says flatly, “tore me a new one and almost made Keith cry.”</span>\n</p>\n<p> </p>\n<p>\n<span>What?</span>\n</p>\n<p> </p>\n<p>\n<span>“Excuse me?” Shiro asks incredulously. Are they talking about the same Blue Paladin? He doesn't even correct her vulgarity, he's so shocked.</span>\n</p>\n<p> </p>\n<p>\n<span>“Poor Keith could barely hold a conversation,” Pidge states, “there was something I was supposed to ask you...damn, Hunk's soup is strong. Did he do this on purpose?”</span>\n</p>\n<p> </p>\n<p>\n<span>It would be a Hunk thing to do in order to get Pidge to sleep. Him and Lance were a force of nature. But that's not what Shiro is focused on. </span>\n</p>\n<p> </p>\n<p>\n<span>“Lance and Keith argued that bad?” He needs to know the full frame of the situation before he hunts one of them down. </span>\n</p>\n<p> </p>\n<p>\n<span>“I imagine it was pretty one-sided, if the riot act I got is any indication,” Pidge yawns again. “Lance is mad, and apparently an argument against a genuinely angry Lance McClain isn't much of an argument so much as it is a smackdown.”</span>\n</p>\n<p> </p>\n<p>\n<span>Shiro swallows, all of this happened while he was with Black? Maybe he was a bit too hasty to think he could rely on Lance. It seems to have gotten to the boy, and now he's taking it out in his teammates. </span>\n</p>\n<p> </p>\n<p>\n<span>This cannot be allowed. Shiro's thinking of how Keith must have come off for Pidge to describe him as “panicky”. That side of the red paladin hasn't surfaced in a long while, not since Keith was fresh and new to the Garrison, just from another foster family. </span>\n</p>\n<p> </p>\n<p>\n<span>He couldn't relate to his peers, didn't know how to relate to them, and he'd been a bundle of confusion and anger when Shiro had first met him. Keith had never been good at making or keeping friends, and whenever he had a falling out with one, he tended to go into a state of panic over what he did wrong, even if it wasn't always his fault. He'd shut down, be difficult to get a word out of, and be on the verge of tears for a good while after. What had Lance said to bring him back to that point? Shiro thinks back to the dark looks on the blue paladin’s face this week. It makes sense now, Lance has been angry all week, and finally snapped. The black paladin doesn't know how he didn't expect this.</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>But I will fix it</span>\n</em>\n<span>, Shiro thinks. He's suddenly filled with protective rage as he thinks of how bad Lance's blowup would have had to been to reduce a frustrated Keith to meekness and anxiety. It gets worse as he remembers that Lance has apparently blown up at Pidge today too. </span>\n</p>\n<p> </p>\n<p>\n<span>“Don't worry Pidge,” Shiro grits out. He'll need to talk to Keith and make sure he's all right later, but a simple assurance should do for the green paladin for right now. “This won't happen again.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Huh?” She seems confused, it must be the soup. “I'm not sure you can promise that, Shiro.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Oh I can,” the black paladin mutters lowly, “trust me.”</span>\n</p>\n<p> </p>\n<p>\n<span>Pidge regards him with bleary eyes and a slowly drooping posture. She analyzes him for a moment, looking incredibly lost (what did Hunk make this soup out of?), before shrugging. </span>\n</p>\n<p> </p>\n<p>\n<span>“I'm too tired to try and make sense of what you want to mean by that,” she murmurs, turning away and beginning to shuffle down the hall. “‘M gonna sleep now. Maybe I'll dream up the right sequence…”</span>\n</p>\n<p> </p>\n<p>\n<span>“Get Hunk to help you back to your room,” assuming the yellow paladin isn't the same state as her, “did Lance eat with you guys?”</span>\n</p>\n<p> </p>\n<p>\n<span>“Oh yeah,” Pidge says as if she's made a great discovery, “Hunk gives piggyback rides...No,” she adds as an afterthought, “Lance is probably being angry somewhere. Should check on him.”</span>\n</p>\n<p> </p>\n<p>\n<span>Shiro intends to, “leave that to me.” It warms him a bit to know that Pidge is still outwardly worrying about Lance even though he's apparently treated her badly today. He needs to make sure the blue paladin knows that this type of behavior will not fly.</span>\n</p>\n<p> </p>\n<p>\n<span>“‘Kay,” Pidge continues to shuffle. “Oh yeah!” She exclaims suddenly, “that's what I was going to ask. Shiro, if you see a hopping pepper around the halls somewhere, tell Hunk and not Allura, ok?”</span>\n</p>\n<p> </p>\n<p>\n<span>“Sure,” Shiro answers absently, making a mental note to ask Hunk about that later. He's already turned and began a brisk pace, intent on getting to the blue paladin's room. The image of Keith, teary-eyed and quiet, passes through his head.</span>\n</p>\n<p> </p>\n<p>\n<span>He will not tolerate this.</span>\n</p>\n<p> </p>\n<p>\n<span>…</span>\n</p>\n<p> </p>\n<p>\n<span>Shiro knocks twice on Lance's door. </span>\n</p>\n<p> </p>\n<p>\n<span>He'd considered barging in, but that wouldn't be fair to Lance. The Blue paladin never locks his door, welcomes any of them in at any time, but has always seemed a bit testy about people going in without his explicit permission. </span>\n</p>\n<p> </p>\n<p>\n<span>In the few seconds it takes for Lance to open the door, Shiro evaluates the situation. Lance has no right to push Keith to the brink of tears, but it is in fact possible that the red paladin started the argument in the first place. How Lance responds at first will be key. The blue paladin will go off about how Keith specifically started it if the red paladin was an equal participant, but will be uncommitted and reluctant to talk about if he knows that he himself is in the wrong. Because Lance doesn't like to talk to others when he knows he did wrong, he prefers to talk to the person themself, but Shiro needs to make sure this never happens again.</span>\n</p>\n<p> </p>\n<p>\n<span>There's something to what Pidge said about Lance going off and being angry somewhere, because the blue paladin does not look happy when the door slides open.</span>\n</p>\n<p> </p>\n<p>\n<span>“Shiro?” Lance questions, expression softening into curiosity. </span>\n</p>\n<p> </p>\n<p>\n<span>“Lance,” Shiro nods at him. The cuban boy tenses minutely, obviously able to tell that a serious conversation is about to happen. That's sign one.</span>\n</p>\n<p> </p>\n<p>\n<span>“What's up?” Lance asks, eyes cautious and face guarded. He steps back to let Shiro in, and the black paladin follows. </span>\n</p>\n<p> </p>\n<p>\n<span>Shiro's only ever been in Lance's room twice before this. Once to check up on him after a particularly stressful mission ended up with the blue paladin contracting some space virus, and once not to shortly after he'd returned in order to make sure Lance was in ok spirits after the month he, Hunk and Coran had spent checking after everyone while Shiro was gone. </span>\n</p>\n<p> </p>\n<p>\n<span>It's still surprisingly bland. He'd expected that Lance would be the type to let collectibles and souvenirs from planets pile up in his room (all of them did that to some degree, Shiro included), but all he had unique to his room were his cosmetic creations and the altean sewing kit Coran had gave him. Not that Lance doesn't collect things, Shiro knows for a fact that he does, it's just that he does not keep them in his room for some reason. No one knows where they end up. </span>\n</p>\n<p> </p>\n<p>\n<span>(</span>\n<em>\n<span>“It just seems…” Shiro had muttered, “a bit impersonal for you. It doesn't seem like the type of room you'd be comfortable in.” </span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Lance's laugh was surprisingly somber.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“I shared my room with my brother all my life. I could always hear someone moving about the house too,” the boy had responded, “and then I shared a room with Hunk. I could always hear the Garrison patrols at night.” </span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Lance had shrugged. </span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“Nothing is going make me feel comfortable in this room,” he said casually as if he didn't just break Shiro's heart a little bit, “so why fill it with clutter when I can put it all elsewhere?”</span>\n</em>\n<span>)</span>\n</p>\n<p> </p>\n<p>\n<span>The blue paladin has struggled. He's been struggling for a long time. Shiro feels for him, he really does, but they're </span>\n<em>\n<span>all </span>\n</em>\n<span>struggling. And he can't have Lance hurting his teammates feelings.</span>\n</p>\n<p> </p>\n<p>\n<span>“So how was your daily date with Black-?”</span>\n</p>\n<p> </p>\n<p>\n<span>“What happened between you and Keith?” Shiro's not one for posturing, and blurting it out is the best way to get a genuine response from Lance.</span>\n</p>\n<p> </p>\n<p>\n<span>Lance's mouth snaps shut, eyes wide as he regards Shiro. Sign two.</span>\n</p>\n<p> </p>\n<p>\n<span>“You heard about that already?” The boy questions. He could be deflecting, but Shiro doesn't think he is. The leader needs to be sure before he goes on. </span>\n</p>\n<p> </p>\n<p>\n<span>“Yes,” he decides not to mention Pidge just yet, “what happened?”</span>\n</p>\n<p> </p>\n<p>\n<span>“Shiro…” Lance sighs, “can we not talk about this now?” </span>\n</p>\n<p> </p>\n<p>\n<span>Shiro frowns. He's not blaming Keith, which would normally mean that Lance started it. But he isn't trying to distract Shiro like he normally would.</span>\n</p>\n<p> </p>\n<p>\n<span>“We need to talk about it,” he insists, waiting to see what the response is.</span>\n</p>\n<p> </p>\n<p>\n<span>“Can't we just talk about how nice your date with Black probably was?” Lance pleads, and while he's normally not this down in demeanour, his words are enough. Sign three. </span>\n</p>\n<p> </p>\n<p>\n<span>“You upset Keith almost to the point of tears,” Shiro states harshly, feeling all the anger for Keith and Pidge start to build again. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance's eyes widen, “wha?”</span>\n</p>\n<p> </p>\n<p>\n<span>He had the audacity to look confused.</span>\n</p>\n<p> </p>\n<p>\n<span>“I know you've been in a bad mood lately Lance,” Shiro lectures, “but that does not mean its ok for you to take your anger out on your teammates.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Whoa,” Lance takes a step back, hands raising defensively, “wait, </span>\n<em>\n<span>what</span>\n</em>\n<span>!?”</span>\n</p>\n<p> </p>\n<p>\n<span>“I know you attacked Keith today, Lance,” Shiro snaps. Lance won't keep playing dumb for long hopefully, because it just makes it worse.</span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>Excuse me!?</span>\n</em>\n<span>” the blue paladin does a good job of sounding completely offended, “I don't think you have your facts straight. I did not attack Keith!”</span>\n</p>\n<p> </p>\n<p>\n<span>“Maybe not physically,” Shiro retorts, “but words can be just as hurtful. You've always spoken a bit carelessly, but to go out of your way to hurt your teammates-”</span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>What are you talking about!?</span>\n</em>\n<span>” </span>\n</p>\n<p> </p>\n<p>\n<span>“-I thought that would be beneath you,” Shiro ignores Lance's shriek, irritation level high and steadily growing. Lance needs to listen to him. “You should support your team Lance, not try to tear it down. I'm disappointed in you.”</span>\n</p>\n<p> </p>\n<p>\n<span>“You're wrong!” Lance insists, hands going up to grip his own hair, “you've got misinformation or </span>\n<em>\n<span>something</span>\n</em>\n<span>!”</span>\n</p>\n<p> </p>\n<p>\n<span>“So you didn't yell at Keith and Pidge today?” Shiro doesn't know what he'll do if Lance lies. </span>\n</p>\n<p> </p>\n<p>\n<span>“Yes,” but that's not going to be a problem, “I did yell. But I had reasons for doing it-”</span>\n</p>\n<p> </p>\n<p>\n<span>“You being in a bad mood is not a good enough reason,” Shiro cuts him off harshly. Lance has finally admitted it, but isn't taking responsibility. “Everyone has off days, but it doesn't give you the right to treat your friend's feelings like they don't matter.”</span>\n</p>\n<p> </p>\n<p>\n<span>Lance rears back as if slapped, eyes unblinking as he looks at Shiro in horror.</span>\n</p>\n<p> </p>\n<p>\n<span>“Seriously?” The blue paladin mutters. </span>\n</p>\n<p> </p>\n<p>\n<span>“Yes, Lance” Shiro snaps, voice just shy of shouting, “seriously. You need to apologize to both Keith and Pidge. Neither of them deserve how you treated them today.” </span>\n</p>\n<p> </p>\n<p>\n<span>Lance scoffs.</span>\n</p>\n<p> </p>\n<p>\n<span>“Am I making myself clear?” Shiro grits out. Lance in a bad mood is not a pleasant person to converse with. “Or was I wrong to think that I could rely on you?”</span>\n</p>\n<p> </p>\n<p>\n<span>Lance flinches, and his face goes red. There's silence as they stare each other down. Shiro's just about to lose his cool, the image of Keith in tears just </span>\n<em>\n<span>there</span>\n</em>\n<span>, when the blue paladin finally responds.</span>\n</p>\n<p> </p>\n<p>\n<span>“Your bias is showing.”</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>What</span>\n</em>\n<span>.</span>\n</p>\n<p> </p>\n<p>\n<span>“What!?” Shiro asks, just a bit outraged.</span>\n</p>\n<p> </p>\n<p>\n<span>“Your bias. It's showing.”</span>\n</p>\n<p> </p>\n<p>\n<span>What the hell is going on with this kid?</span>\n</p>\n<p> </p>\n<p>\n<span>“You need to watch it,” Shiro warns, “I will not accept any outbursts from you.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Do you even know what happened?” Lance asks blankly, jaw clenched and eyes hard. He's not backing down.</span>\n</p>\n<p> </p>\n<p>\n<span>“I know enough,” Shiro crosses his arms.</span>\n</p>\n<p> </p>\n<p>\n<span>“No,” Lance's voice is harsh. Bitter in a way that Shiro has never heard before. “You only know what you care to know, and that's why your. </span>\n<em>\n<span>Bias</span>\n</em>\n<span>. Is. Showing.” </span>\n</p>\n<p> </p>\n<p>\n<span>Shiro has an angry retort just on the edge of his lips, but something tells him to wait.</span>\n</p>\n<p> </p>\n<p>\n<span>“Your precious Keith's feelings are hurt, that's what you know. Because that's all you care to know,” Lance berates, closing some of the distance between them. This is not the blue paladin Shiro knows. “If you cared at all about what actually happened, you would have let me explain.”</span>\n</p>\n<p> </p>\n<p>\n<span>“I asked you what happened,” Shiro reminds him.</span>\n</p>\n<p> </p>\n<p>\n<span>“And I asked not to talk about it right now,” Lance snaps back, “but I'm not Keith for Pidge for that matter, so </span>\n<em>\n<span>of course </span>\n</em>\n<span>I don't get the respect of having time to cool down.” </span>\n</p>\n<p> </p>\n<p>\n<span>That's...not unfair. Shiro supposes he could have honored Lance's request. But he needs for this team to not hurt each other. </span>\n</p>\n<p> </p>\n<p>\n<span>“You hurt your teammates,” Shiro states.</span>\n</p>\n<p> </p>\n<p>\n<span>“No!” Lance shouts suddenly, throwing both arms up. “I did not hurt my teammates! My </span>\n<em>\n<span>friends </span>\n</em>\n<span>hurt </span>\n<em>\n<span>me</span>\n</em>\n<span>!” </span>\n</p>\n<p> </p>\n<p>\n<span>Shiro stares. The protective anger is rolling away. Lance's words seem sincere. He's beginning to wonder if taking everything Pidge said at face value was a smart idea. She was basically drugged by soup after all.</span>\n</p>\n<p> </p>\n<p>\n<span>“Because that's what we are!” Lance goes on, “We're not just teammates, we're friends! A family! And a family cares about each other's feelings but neither of them cared about mine today!” </span>\n</p>\n<p> </p>\n<p>\n<span>“I did not just lay into Keith just for the hell it!” Lance shouts, face red and voice so, </span>\n<em>\n<span>so angry</span>\n</em>\n<span>. “I did it because your </span>\n<em>\n<span>golden boy </span>\n</em>\n<span>decided it would be a good idea to hunt me down just to use me as a verbal punching bag! Why am I the first one you came for!?”</span>\n</p>\n<p> </p>\n<p>\n<span>Shiro's eyes widen. Oh no.</span>\n</p>\n<p> </p>\n<p>\n<span>“And I </span>\n<em>\n<span>know </span>\n</em>\n<span>that I'm the first one you came to! Because if you went to Keith, then he would have told you that he brought it on himself! Same with Pidge! All I was trying to do was make her eat something and all of a sudden I'm a non-productive waste of space!?</span>\n<em>\n<span> Fuck that</span>\n</em>\n<span>!” </span>\n</p>\n<p> </p>\n<p>\n<span>The black paladin doesn't have the wherewithal to correct Lance's language (and he's very much convinced that it would be a </span>\n<em>\n<span>bad idea</span>\n</em>\n<span> anyway), he's shaken by the pure emotion in his friend's voice. There's no way he's not telling the truth.  It's a wonder that no tears have fallen. </span>\n</p>\n<p> </p>\n<p>\n<span>No, Lance isn't going to cry. He's more angry, hurt and offended than he is sad right now. And Shiro deserves everything the blue paladin can think to throw at him.</span>\n</p>\n<p> </p>\n<p>\n<span>Oh god, how did he screw this up so badly?</span>\n</p>\n<p> </p>\n<p>\n<span>“All I wanted was a little respect for a least a little while and that's too much to ask!?” Lance growls out, beginning to pace. “You don't even respect me enough to hear my side of the story before going off on me! You're supposed to be the oldest! The </span>\n<em>\n<span>leader</span>\n</em>\n<span>! Why do my feelings automatically take a backseat to Keith and Pidge's?” </span>\n</p>\n<p> </p>\n<p>\n<span>Shiro's mouth feels dry and it becomes a bit hard to swallow, “Lance, please wait.”</span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>No</span>\n</em>\n<span>!” Lance </span>\n<em>\n<span>screams</span>\n</em>\n<span>, and Shiro jumps. The air is thick with the waves of anger and frustration pouring off of the blue paladin. And it's all. Shiro's. Fault. “No, I will not wait! I can't believe you would treat me like this too!”</span>\n</p>\n<p> </p>\n<p>\n<span>“I was too hasty-”</span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>Or was I wrong to think that I could rely on you</span>\n</em>\n<span>?” Lance repeats lowly, “that's what you said to me. You came in here with flimsy information and tore into me for standing up for myself! And then you said that to me!”</span>\n</p>\n<p> </p>\n<p>\n<span>“Lance. Please,” Shiro closes the remaining distance and rests his hands carefully on the boy’s shoulders, stopping him from pacing. Lance is shaking terribly, how are they going to come back from this? “What can I do?” He begs, because he has to do something. He can't just let this fester. They need to fix this. They all need to fix this.</span>\n</p>\n<p> </p>\n<p>\n<span>“Treating my feelings with same care you treat Keith and Pidge's would be nice,” Lance's voice is hard and unforgiving, “but what I really want you to do is leave.”</span>\n</p>\n<p> </p>\n<p>\n<span>Shiro's heart breaks, “Lance.”</span>\n</p>\n<p> </p>\n<p>\n<span>“We can talk about this later, like we should have done in the first place,” Lance steps away from the leader, “but I really need to be alone right now. And you should probably eat something anyway.”</span>\n</p>\n<p> </p>\n<p>\n<span>How can he still stand there and think of Shiro's wellbeing? It must be a family thing. Shiro's always felt sad for both Lance not having his family and his family for not having Lance in turn, but never more so than in this one moment.</span>\n</p>\n<p> </p>\n<p>\n<span>Shiro nods, and leaves the room without a word.</span>\n</p>\n<p> </p>\n<p>\n<span>He kind of wants to cry.</span>\n</p>\n<p><br>\n<br>\n<br>\n</p>\n<p>\n<span>Coran whistles happily as he strolls down the halls of the castle, on a quick path to the bridge. He's just left Allura on the training deck, having finally balanced the faulty calculations for the training sequences. Now the paladins will be able to train with no fatalities! He also managed to improve the AI for the gladiators a tidge. Allura had been quite pleased, and they'd spent a good amount of time coming up with new and improved training sequences for the paladins. The pods were clean (Keith wasn't the most pleasant company, though), he'd tunes up the sensors in the Lion hangers earlier, and now he's on his way to prepare the bridge systems for Pidge's new algorithms. </span>\n</p>\n<p> </p>\n<p>\n<span>All in all, it's been a great day.</span>\n</p>\n<p> </p>\n<p>\n<span>His whistling has escalated to humming when he spies the leader of Voltron solemnly walking down the hall. Head down, shoulders droopy. The perfect picture of disheartened. </span>\n</p>\n<p> </p>\n<p>\n<span>Coran clicks his tongue. This certainly will not do. The leader of Voltron should be calm and doing his rather obsessive rounds with a little smile on his face. Shiro is sad instead. It doesn't make sense, the Black Lion has never been the type to argue from what Coran remembers, so he can't see any reason why Shiro seems like he's having a bad day.</span>\n</p>\n<p> </p>\n<p>\n<span>Well, production doesn't always have to be in mechanical side of things. Coran makes his way over to Shiro.</span>\n</p>\n<p> </p>\n<p>\n<span>“Black paladin,” he calls cheerfully. Maybe Shiro is just this “moody” that Keith insists the Red Lion gets sometimes (it's quite preposterous, if Coran says so himself). </span>\n</p>\n<p> </p>\n<p>\n<span>“Hey Coran,” Shiro greets quietly. Interesting. Something has clearly happened. “How's the training deck?”</span>\n</p>\n<p> </p>\n<p>\n<span>“Tip top shape my boy!” Coran pronounces proudly. “Allura and I were even thinking of having a late night training session!”</span>\n</p>\n<p> </p>\n<p>\n<span>Shiro winces, “tonight?”</span>\n</p>\n<p> </p>\n<p>\n<span>Oh quiznack.</span>\n</p>\n<p> </p>\n<p>\n<span>“Uh-I mean,” Coran panics. It was supposed to be a surprise drill. “Nevermind! There will be not training of any sort!”</span>\n</p>\n<p> </p>\n<p>\n<span>“Coran…” the black paladin sighs. Oh no, this somberness will not do.</span>\n</p>\n<p> </p>\n<p>\n<span>“You will not have to leave your beds!” Coran insists. Maybe he will try and talk Allura out of it. The black paladin seems quite distressed.</span>\n</p>\n<p> </p>\n<p>\n<span>“Please Coran,” Shiro says softly, “tonight really isn't the night to spring surprise training on the team.”</span>\n</p>\n<p> </p>\n<p>\n<span>Oh dear. Something's gone amiss. Coran will definitely have to suggest Allura alter her plans for tonight.</span>\n</p>\n<p> </p>\n<p>\n<span>“Might I ask why?” He asks calmly. It's best to get a sense of the situation now.</span>\n</p>\n<p> </p>\n<p>\n<span>“There's a bit of a rift between us and Lance right now,” Shiro explains, voice sad but still strong. A leader must always remain strong. “And I'm ashamed to say that I've had a major part in it.”</span>\n</p>\n<p> </p>\n<p>\n<span>Coran’s eyes widen. This does not bode well. Has whatever darkness that's been following the blue paladin around lately finally set in? Why does Shiro believe he's at fault. The royal advisor has certainly met more capable and experienced leaders in his time (and what a long time it has been), but the current black paladin has always impressed him with his drive and compassion. He's always respected those who are natural at leading by example.</span>\n</p>\n<p> </p>\n<p>\n<span>And yet, no one is perfect.</span>\n</p>\n<p> </p>\n<p>\n<span>“Care to elaborate, my boy?” Because Shiro is young. Older than the rest of his team. But still young.</span>\n</p>\n<p> </p>\n<p>\n<span>“I accused Lance of doing something terrible and scolded him for it,” Shiro explains. No reluctance, he must need the relief talking about a situation brings. “Only I didn't have my facts straight, and it turned out that he wasn't at fault,” a deep sigh, “he'd already been upset. More upset and frustrated than I think he's ever been since we left Earth, but I just made it that much. And the worst part is that I could have avoided doing so if I'd only had a better handle on my own emotions and a deeper understanding of Lance's.” </span>\n</p>\n<p> </p>\n<p>\n<span>Coran remains silent. The black paladin isn't quite done yet.</span>\n</p>\n<p> </p>\n<p>\n<span>“I don't know my own teammate, Coran,” Shiro admits, “and because of that, I hurt him when I should have been helping him. And now I don't know how to fix it.”</span>\n</p>\n<p> </p>\n<p>\n<span>The advisor pulls in a sharp breath. It's not often that Shiro doesn't have at least some idea of what to do. The situation is more precarious than Coran originally thought. There is no way a surprise training session will be productive. The team needs mending.</span>\n</p>\n<p> </p>\n<p>\n<span>“Is Lance in his room?” He and Allura don't make a habit of stepping into the paladin's business if it does not directly affect Voltron. Their understanding of the human psyche and customs are still far too limited, and they often end up making a dispute worse. But Shiro needs help. Lance needs help. They all need help.</span>\n</p>\n<p> </p>\n<p>\n<span>Coran is help. It's his nature, his very being. His job and life as an advisor is to help, and he takes it quite seriously.</span>\n</p>\n<p> </p>\n<p>\n<span>“Yes,” Shiro responds cautiously, “But I don't know that speaking to him is a great idea right now. He's very on edge.”</span>\n</p>\n<p> </p>\n<p>\n<span>That human colloquialism has never made much sense to Coran, but he can read context very well. Lance does not want to be bothered at the moment. He can respect that. </span>\n</p>\n<p> </p>\n<p>\n<span>“Then we will approach him later,” Coran decides.</span>\n</p>\n<p> </p>\n<p>\n<span>“We?” What has happened that Shiro is hesitant to approach his teammate, who also happens to be one of the sweetest people Coran had the pleasure of meeting. Oh no. This won't do at all.</span>\n</p>\n<p> </p>\n<p>\n<span>“Later today, before a cycle has completed,” a leader cannot be unwilling to talk to their subordinate. This puts the situation in an even newer light, and if it's that bad, then Coran cannot allow it to continue into a new cycle. “Wounds fester if left too long, Black Paladin,” he says the title as a reminder. Shiro is the Black Paladin. Coran has faith in him. “It's best to come to an understanding sooner rather than later. We will approach Lance together in a few mega-ticks, and we will talk peacefully and productively.”</span>\n</p>\n<p> </p>\n<p>\n<span>Shiro still looks hesitant, but nods determinedly.</span>\n</p>\n<p> </p>\n<p>\n<span>“Of course,” there's the cadence of a leader. Coran smiles, albeit a bit sad. It was such a great day too. </span>\n</p>\n<p> </p>\n<p>\n<span>Why is it so hard for everyone to have a great day? Why does something always have to go wrong for someone. He thinks about the fact that they're placing so much stock in children. Certainly not the first time it's weighed on him.</span>\n</p>\n<p> </p>\n<p>\n<span>“Now,” Coran begins amicably, “shall we get some goo into you?”</span>\n</p>\n<p> </p>\n<p>\n<span>Shiro does that peculiar thing with his face that the paladins always do when the food goo is brought up, but nods with a slight smile nonetheless.</span>\n</p>\n<p> </p>\n<p>\n<span>“Excellent,” Coran gestures broadly, “lead the way!” </span>\n</p>\n<p> </p>\n<p>\n<span>Coran will help. It's what he does.</span>\n</p>\n<p>\n<br>\n<br>\n</p>\n<p>\n<span>“Allura,” Coran says yet again, “I must ask that you reconsider.” </span>\n</p>\n<p> </p>\n<p>\n<span>The princess sighs.</span>\n</p>\n<p> </p>\n<p>\n<span>“And I must reiterate that I cannot,” she says sternly. “If the situation is as precarious as you say, then the paladins need this.”</span>\n</p>\n<p> </p>\n<p>\n<span>For some reason, her advisor and friend has been doing everything in his power for the last few mega-ticks to get her to call off her surprise training session.</span>\n</p>\n<p> </p>\n<p>\n<span>“The bonds between the paladins are a severely damaged right now,” Coran had said, “particularly regarding the Blue Paladin. I believe this training has potential to make it worse.” </span>\n</p>\n<p> </p>\n<p>\n<span>She understands his sentiment, but they are at war. Just because Zarkon is no longer a factor, does not mean they can slack for the time being. Haggar has the potential to be even more dangerous.</span>\n</p>\n<p> </p>\n<p>\n<span>Allura swallows the anger and sharp feeling of betrayal that comes with thinking about the witch. She cannot allow this rift between paladins to stay. They need to be able to work together, and she </span>\n<em>\n<span>knows </span>\n</em>\n<span>that they all are capable of looking past their differences when in combat.</span>\n</p>\n<p> </p>\n<p>\n<span>“They have to understand that these personal squabbles will do nothing but impede progress,” Allura states firmly, “the universe will not wait for hurt feelings.”</span>\n</p>\n<p> </p>\n<p>\n<span>Her advisor slumps, “I understand that. Truly I do, however-”</span>\n</p>\n<p> </p>\n<p>\n<span>“That's enough Coran,” she cuts him off gently, reaching out to place a hand on his shoulder. “I value your opinion more than anyone's” and this is true, “but now is not the time to be soft. We're just about to follow a lead to tracking down Haggar. They need to be ready.”</span>\n</p>\n<p> </p>\n<p>\n<span>“...Yes princess,” Coran finally nods. Allura empathizes with him, and she too is worried about the state of the paladins, but Coran has already stated that he sent Shiro off to rest. The plan was apparently for them both to talk to Lance together after Shiro had slept on it and woke up with a sounder mind. But she doesn't see how that can be productive. The Blue Paladin does not need to be coddled, he's quite capable of functioning without them handling him so delicately.</span>\n</p>\n<p> </p>\n<p>\n<span>Lance is not an unfair person. Allura does not know much about her blue paladin unfortunately, but of this she is sure. He has a rather low sense of duty and responsibility, but he will hear Shiro out if they're forced into the same space. </span>\n</p>\n<p> </p>\n<p>\n<span>She's still not quite sure she believes that Lance had nothing to do with the apparent arguments today. The blue paladin is willfully patronizing, and she imagines that Shiro is just taking too much responsibility on his shoulders. </span>\n</p>\n<p> </p>\n<p>\n<span>Regardless of which. They </span>\n<em>\n<span>will </span>\n</em>\n<span>work together. They just need to be reminded of the stakes.</span>\n</p>\n<p> </p>\n<p>\n<span>“Sound the alarm Coran,” she orders. The advisor hesitates just a split second, but does as told.</span>\n</p>\n<p> </p>\n<p>\n<span>The shrill shrieking begins immediately, filling the halls of the castle with a sense of urgency. Allura quickly goes on the intercom.</span>\n</p>\n<p> </p>\n<p>\n<span>“Paladins!” She calls, hearing her own voice reverberate over the alarm, “report to the training deck immediately! It's urgent! I need you all here in no more than sixty ticks!” </span>\n</p>\n<p> </p>\n<p>\n<span>She waits.</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Thiry ticks</span>\n</em>\n<span>. Keith runs in, bayard in hand but missing his jacket. The timing is normal, but he does not look as focused as he normally does.</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Forty-six ticks</span>\n</em>\n<span>. Hunk is next, with a rather flailing demeanour. He also has his bayard, but appears to be in pajamas. Allura frowns.</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Forty-nine ticks</span>\n</em>\n<span>. Pidge stumbles in, nearly tripping over her own feet. She does not have her bayard. What is going on?</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Fifty-eight ticks</span>\n</em>\n<span>. Shiro rushes in, face panicked and confused. He's never the last, never takes more than forty ticks. He does not appear ready for anything.</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>One hundred and twenty ticks</span>\n</em>\n<span>. No Lance.</span>\n</p>\n<p> </p>\n<p>\n<span>This is unacceptable.</span>\n</p>\n<p> </p>\n<p>\n<span>“What is wrong with you all?” She snaps from over the intercom. They can't see her from the deck, as she and Coran are in the observation room, but her tone is enough. “Your assembly was ridiculous! I said sixty, but it truly shouldn't take you more than forty ticks to get here from your quarters!”</span>\n</p>\n<p> </p>\n<p>\n<span>“None of you are in armor! </span>\n<em>\n<span>Pidge</span>\n</em>\n<span>!” She goes on, seeing the girl visibly flinch, “you don't have your bayard! How were you planning to fight!?”</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>Pidge's mouth moves, and then the microphones catch the sound and project it to the observation room. </span>\n</p>\n<p> </p>\n<p>\n<span>“Sorry! I was completely knocked out! Hunk drugged me!”</span>\n</p>\n<p> </p>\n<p>\n<span>The yellow paladin squawks.</span>\n</p>\n<p> </p>\n<p>\n<span>“You and Keith needed the sleep!” He retorts, tone offended.</span>\n</p>\n<p> </p>\n<p>\n<span>“Wait what!?” Keith snaps, “is that why I was so tired for no reason!?” </span>\n</p>\n<p> </p>\n<p>\n<span>“You were having an </span>\n<em>\n<span>emotional breakdown</span>\n</em>\n<span>!” Hunk defends, “I was just trying to help!”</span>\n</p>\n<p> </p>\n<p>\n<span>“Keith…” Shiro's murmur is picked up, “are you feeling better now?” </span>\n</p>\n<p> </p>\n<p>\n<span>“Y-yeah,” the red paladin responds quietly, “but...Shiro-”</span>\n</p>\n<p> </p>\n<p>\n<span>“I know, Keith,” the elder sighs, “we'll work on how we're going to apologize later.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Yeah! Focus on that!” Hunk says, crossing his arms. Allura can his posture go rigid from all the way up here. “Wait...</span>\n<em>\n<span>we</span>\n</em>\n<span>?”</span>\n</p>\n<p> </p>\n<p>\n<span>His voice trembles with anxiety.</span>\n</p>\n<p> </p>\n<p>\n<span>“Shiro?” Hunk prompts.</span>\n</p>\n<p> </p>\n<p>\n<span>“Oh crap!” Pidge shouts suddenly, “that wasn't a dream! Shiro! Please tell me you didn't go to Lance!”</span>\n</p>\n<p> </p>\n<p>\n<span>Her voice is panicked. Just what the quiznack is going on? </span>\n</p>\n<p> </p>\n<p>\n<span>“I'm afraid I can't Pidge…” is the hushed response.</span>\n</p>\n<p> </p>\n<p>\n<span>“Wait,” Keith interrupts, “what happened? Why do you need to apologize too?”</span>\n</p>\n<p> </p>\n<p>\n<span>Shiro opens his mouth, but Hunk beats him to it.</span>\n</p>\n<p> </p>\n<p>\n<span>“No!” He shakes his head, “nononononono! This is </span>\n<em>\n<span>so </span>\n</em>\n<span>bad! I have to go see him right now!”</span>\n</p>\n<p> </p>\n<p>\n<span>And to Allura’s outrage, the yellow paladin turns and begins charging for the door.</span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>Halt</span>\n</em>\n<span>!” She snaps, and the sound on the deck stops. Hunk pauses, but does not turn around. </span>\n</p>\n<p> </p>\n<p>\n<span>The </span>\n<em>\n<span>disrespect</span>\n</em>\n<span>.</span>\n</p>\n<p> </p>\n<p>\n<span>“I am appalled!” Allura rages. This is so beyond unacceptable, “we have not won yet! We are still in a War! And you dare to come here, unprepared, inattentive and completely ignorant of your duties as paladins!? What has gotten into to all of you!?”</span>\n</p>\n<p> </p>\n<p>\n<span>“Allura,” Coran murmurs. But she will not be silenced. Don't they realize this type of behavior can get them killed one day?</span>\n</p>\n<p> </p>\n<p>\n<span>“Do not leave this room Hunk!” She snaps, and the yellow paladin shrinks. “Whatever has occurred outside of this room does not matter anymore! We are here to train. To better ourselves! To protect the universe! Surely you all haven't forgotten that?” </span>\n</p>\n<p> </p>\n<p>\n<span>No one answers. But the yellow paladin does turn back around. </span>\n</p>\n<p> </p>\n<p>\n<span>“Please Allura,” Hunk pleads, and something in her twists to hear the shakiness of his voice. “Lance needs me right now.” </span>\n</p>\n<p> </p>\n<p>\n<span>The name bolsters her anger again.</span>\n</p>\n<p> </p>\n<p>\n<span>“Where is Lance?” He hasn't showed up yet. He's never this late.</span>\n</p>\n<p> </p>\n<p>\n<span>No one answer right away, but both Pidge and Keith look down. What. Is. Happening.</span>\n</p>\n<p> </p>\n<p>\n<span>“Lance needs time,” Shiro states, “it's why I asked Coran for us not to do this tonight.” </span>\n</p>\n<p> </p>\n<p>\n<span>There's ire in his voice. Coran sighs.</span>\n</p>\n<p> </p>\n<p>\n<span>“And he passed your request on to me,” Allura retorts sharply, “but the decision is mine in the end. And it's become startlingly clear that I was right in assuming you all need this.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Allura come on,” Pidge speaks up, “this is a really bad time.”</span>\n</p>\n<p> </p>\n<p>\n<span>“And you think the universe cares if we're having a bad time?” Allura questions incredulously. They were doing so well, why are they falling apart now? </span>\n</p>\n<p> </p>\n<p>\n<span>“Allura,” Hunk speaks up again, “I need to see Lance.” </span>\n</p>\n<p> </p>\n<p>\n<span>“Lance needs to be here!” There is no way they're not going through with this training session now. They've gotten far too comfortable. “You can see him when he gets here.”</span>\n</p>\n<p> </p>\n<p>\n<span>Hunk opens his mouth again, but Allura is already calling overhead.</span>\n</p>\n<p> </p>\n<p>\n<span>“Lance!” She calls, “we are waiting on you! All of your fellow paladins have assembled. Report to the training deck immediately! Do not make me repeat myself again.” </span>\n</p>\n<p> </p>\n<p>\n<span>She removes her finger from the button. It gets silent for about twelve ticks. Coran clears his throat uncomfortably.</span>\n</p>\n<p> </p>\n<p>\n<span>“You didn't have to say it like that…” Hunk's quiet complaint is picked up over the intercom.</span>\n</p>\n<p> </p>\n<p>\n<span>“I've had </span>\n<em>\n<span>enough </span>\n</em>\n<span>of your attitude, Hunk.” Allura states. The yellow paladin flinches, “I know you're worried about Lance, but this is your duty. You need to take it seriously. This behavior is very unbecoming of you.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Don't talk to Hunk like that,” comes a voice Allura isn't sure she recognizes. Her eyes go to the door, just in time to watch it close behind Lance.</span>\n</p>\n<p> </p>\n<p>\n<span>Or this...</span>\n<em>\n<span>person</span>\n</em>\n<span> who kind of looks like Lance.</span>\n</p>\n<p> </p>\n<p>\n<span>There's a scowl on his face that Allura can see even from here, and it easily rivals Keith on one of the red paladin’s angrier days. He looks tired, dressed in a worn out gray shirt and his jeans. But at least he has his bayard.</span>\n</p>\n<p> </p>\n<p>\n<span>Allura glares, not that he can see it. He has enough composure to come at least somewhat prepared, so there is no reason to coddle him.</span>\n</p>\n<p> </p>\n<p>\n<span>“You are very late Lance,” she snaps. “We could have been defeated and gone by the time you got here.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Hunk hasn't done anything wrong,” Lance completely ignores her. What the quiznack!? </span>\n</p>\n<p> </p>\n<p>\n<span>“Were you listening to me!?” She demands. What's going on with the blue paladin? If this attitude has been present all day, then she's right in assuming that he played a bigger part in the conflicts she's heard about.</span>\n</p>\n<p> </p>\n<p>\n<span>“Hunk was just worried about me,” Lance insists.</span>\n</p>\n<p> </p>\n<p>\n<span>“Buddy…” Hunk says quietly. </span>\n</p>\n<p> </p>\n<p>\n<span>Allura is floored by the blatant disregard for her authority. And by the fact that Shiro hasn't corrected Lance yet. A quick glance to black paladin reveals he's doing everything he can not to look at Lance. So are Keith and Pidge. Enough is enough.</span>\n</p>\n<p> </p>\n<p>\n<span>“My apologies, Hunk” Allura swallows her pride and apologizes diplomatically. Something tells her that she's not going to get anything more out of Lance until she does.</span>\n</p>\n<p> </p>\n<p>\n<span>“...It's cool.” Hunk murmurs. A bit of the tension in Lance's body fades. </span>\n</p>\n<p> </p>\n<p>\n<span>“Sorry I'm late princess,” he finally says, “I...had my pillow over my ears. I just caught the last bit of your last message.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Well see to it that it doesn't happen again,” she states coldly. The training needs to begin. </span>\n<em>\n<span>Now</span>\n</em>\n<span>.</span>\n</p>\n<p> </p>\n<p>\n<span>“Please grab a practice weapon, Pidge,” she orders, “we're running through a new training sequence. You'll just have to make due with what we have on hand.” </span>\n</p>\n<p> </p>\n<p>\n<span>Pidge groans, but follows the direction, marching over to pick up a practice dagger.</span>\n</p>\n<p> </p>\n<p>\n<span>“The new sequence will put you against groups of mixed gladiators with update AIs,” Allura explains tersely, watching as her paladins get into position. Only Hunk stands very close to Lance, the rest seem to keep a bit of distance. Hopefully this training sequence will knock everyone out of this ridiculousness. “The levels of the deck will shift to mimic various topographies. We're going to be doing a lot of on foot missions from here on out since our main goal is helping planets expand their free territories and establish connections.”</span>\n</p>\n<p> </p>\n<p>\n<span>Everyone seems to be listening to her, but she pays special attention to Lance, who is at the heart of this dissension of her paladins. What has he done? Or had something been done to him? </span>\n</p>\n<p> </p>\n<p>\n<span>He seems like he's listening to her, but his demeanour is overall very negative, and it seems to be making the other paladins very uncomfortable. Enough of this.</span>\n</p>\n<p> </p>\n<p>\n<span>“We will begin now,” Allura commands, gesturing at Coran. She'd originally planned to explain more, but she needs to see how much their combat skills are being affected by this situation.</span>\n</p>\n<p> </p>\n<p>\n<span>“Are you absolutely certain?” Coran asks grimly.</span>\n</p>\n<p> </p>\n<p>\n<span>“Do it.”</span>\n</p>\n<p> </p>\n<p>\n<span>They are at war. They can't afford to get soft.</span>\n</p>\n<p> </p>\n<p>\n<span>It starts out well enough. The first exercise in the sequence is just against regularly programmed close combat gladiators, nothing they haven't faced before. The paladins perform...decently. They take out all the gladiators, but do not work together at all. Instead they split up tackle them on their own.</span>\n</p>\n<p> </p>\n<p>\n<span>Allura cannot understand why this is happening. Why Shiro is </span>\n<em>\n<span>letting </span>\n</em>\n<span>this happen.</span>\n</p>\n<p> </p>\n<p>\n<span>He seems to get with the program by the second sequence though, which contains gladiators specifically programmed to target a single paladin upon prompting action. So when Keith does a backflip to avoid an attack, all of the gladiators immediately turn their aggression on him.</span>\n</p>\n<p> </p>\n<p>\n<span>“Get into position around Keith!” Shiro orders, recognizing the intent immediately. Good. Except Keith locks up when Lance goes to cover his back, forgetting to parry a strike and taking a hard hit. The blue paladin is quick to provide covering fire though, and Pidge eventually helps Keith right himself. But a glance from Lance to both of them has them both hesitating. </span>\n</p>\n<p> </p>\n<p>\n<span>Allura feels her ire grow.</span>\n</p>\n<p> </p>\n<p>\n<span>They do eventually pass that level, but it takes far longer than Allura expected. She is displeased. And the third level goes even worse. </span>\n</p>\n<p> </p>\n<p>\n<span>The paladins a pitted against a mix of short range and long range gladiators, and they immediately begin to fall apart.</span>\n</p>\n<p> </p>\n<p>\n<span>It starts when Lance yells “Shiro! Duck!” And the black paladin freezes a bit before complying. The hesitation is noteworthy, and the gladiators begin to go for the leader in earnest. The paladins immediately rally to guard their leader, but Lance keeps his aggression trained on the units that don't pose an immediate threat. </span>\n</p>\n<p> </p>\n<p>\n<span>This is sad.</span>\n</p>\n<p> </p>\n<p>\n<span>Even still, the paladins get through that level eventually, looking much worse for wear. </span>\n</p>\n<p> </p>\n<p>\n<span>“Perhaps we should stop,” Coran suggests.</span>\n</p>\n<p> </p>\n<p>\n<span>“Just one more level,” there's no way the paladins are finishing the entire sequence like this. But maybe she can pinpoint the problem. She has an idea though.</span>\n</p>\n<p> </p>\n<p>\n<span>The fourth level is an atrocity. It's a ridiculous amalgamation of Shiro, Keith and Pidge clustering while Lance goes off on his own with Hunk trying (and failing) to bring a balance between them.</span>\n</p>\n<p> </p>\n<p>\n<span>“End the sequence after this level,” Allura growls, turning on her heel and storming from the observation room.</span>\n</p>\n<p> </p>\n<p>\n<span>Unacceptable.</span>\n</p>\n<p> </p>\n<p>\n<span>Her anger blocks out the trip down and around to the deck, but by the time she gets there, Coran has halted the sequence early. They didn't even get through the fourth level. Allura expected them to make it to twelve. They should be able to make it to twelve. </span>\n</p>\n<p> </p>\n<p>\n<span>“That was atrocious!” She berates them immediately, staring them all down. Hunk flinches and looks away. Pidge sighs and looks down. Keith looks angry and guilty. Shiro just stares solemnly at her. He knows their performance was awful. Lance just stares off into space. They're going to get themselves killed like this.</span>\n</p>\n<p> </p>\n<p>\n<span>“You've all demonstrated a commendable level of teamwork in the past,” Allura lectures, “but I saw none of that here. I am thoroughly disappointed and embarrassed.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Princess,” Shiro begins, but Allura waves a hand sharply and he stops. She does not want to speak with him at the moment. </span>\n</p>\n<p> </p>\n<p>\n<span>Allura decides to address the source of the problem.</span>\n</p>\n<p> </p>\n<p>\n<span>“Lance,” she calls.</span>\n</p>\n<p> </p>\n<p>\n<span>“Yes princess?” He asks quietly, still staring at a random point on the wall. Allura feels her anger build more.</span>\n</p>\n<p> </p>\n<p>\n<span>“What is going on with you and the team?” She demands. He doesn't answer right away, and there's a tense silence for a bit.</span>\n</p>\n<p> </p>\n<p>\n<span>“I honestly don't know,” Lance finally mutters, voice bitter and annoyed. “It's been a bad day.”</span>\n</p>\n<p> </p>\n<p>\n<span>Excuses! She's so sick of </span>\n<em>\n<span>excuses</span>\n</em>\n<span>!</span>\n</p>\n<p> </p>\n<p>\n<span>“A bad day is no excuse to fall apart as a team!” She means the words for everyone, but stares at Lance. This all revolves around him. What has the boy done now?</span>\n</p>\n<p> </p>\n<p>\n<span>Lance turns to look at her, face finally showing some emotion other than the steady annoyance he's been portraying. He looks shocked. Why does he look shocked?</span>\n</p>\n<p> </p>\n<p>\n<span>“You're not seriously about to blame me for what just went down,” he asks breathlessly, “are you?”</span>\n</p>\n<p> </p>\n<p>\n<span>There's complete and utter disbelief in his tone, and it just grates on her nerves even more. How can he not be taking this seriously enough to notice!?</span>\n</p>\n<p> </p>\n<p>\n<span>“Why is it impossible for the other paladins to work with you today?” Allura asks harshly.</span>\n</p>\n<p> </p>\n<p>\n<span>“Allura,” Shiro speaks up, eyes wide.</span>\n</p>\n<p> </p>\n<p>\n<span>“Don't!” Keith insists out of nowhere.</span>\n</p>\n<p> </p>\n<p>\n<span>“Come on,” Pidge complains.</span>\n</p>\n<p> </p>\n<p>\n<span>“Enough!” Allura shouts, silencing them. “Lance,” she goes for the blue paladin again, “your performance was subpar. You left you team to fight the gladiators themselves while you targeted unnecessary marks. You're supposed to watch your teammates backs!”</span>\n</p>\n<p> </p>\n<p>\n<span>“Please </span>\n<em>\n<span>stop</span>\n</em>\n<span>!” Hunk pleads. Allura talks over him. They need to understand. This can't happen on a live battlefield.</span>\n</p>\n<p> </p>\n<p>\n<span>“You refused to position yourself near your team,” Allura accuses, “what were you trying to accomplish? I certainly hope it wasn't showboating.”</span>\n</p>\n<p> </p>\n<p>\n<span>Lance remains silent. He just stares at her, eyes hollow.</span>\n</p>\n<p> </p>\n<p>\n<span>“It's like you not even taking this seriously!” Allura cares about her paladins. She will not allow them to destroy themselves, “You have a family waiting for you back on Earth! If you cared half as much about as you claim to, you would do better than this!”</span>\n</p>\n<p> </p>\n<p>\n<span>It's a low blow. But he needs to be reminded of the stakes. Every paladin opens their mouth, probably to protest her words. In that split tick. Allura is prepared to take their outrage and defend her statement.</span>\n</p>\n<p> </p>\n<p>\n<span>And then Lance opens his mouth.</span>\n</p>\n<p> </p>\n<p><span>“</span><em><span>Shut</span></em> <em><span>up</span></em><span>!” </span></p>\n<p> </p>\n<p>\n<span>Everyone stops. Allura stares.</span>\n</p>\n<p> </p>\n<p>\n<span>Lance's face is...crazed with anger and frustration and disbelief. He breathes heavily, having shouted at the top of his lungs. Allura is floored.</span>\n</p>\n<p> </p>\n<p>\n<span>“Excuse me?” She retorts, ready to lecture him on his disrespect. She doesn't get that chance.</span>\n</p>\n<p> </p>\n<p>\n<span>“Shut up!” He repeats, voice enraged. “Shut up! Shut up! </span>\n<em>\n<span>Shut the hell up</span>\n</em>\n<span>!”</span>\n</p>\n<p> </p>\n<p>\n<span>Allura chokes on her own breath, eyes wide as she stares at her paladin.</span>\n</p>\n<p> </p>\n<p>\n<span>“This is not my fault! Do you hear me?” Lance shouts, voice going high and shrill. “This is not my </span>\n<em>\n<span>fault</span>\n</em>\n<span>!”</span>\n</p>\n<p> </p>\n<p>\n<span>“Lance,” she speaks.</span>\n</p>\n<p> </p>\n<p>\n<span>“What else was I supposed to do!?” Lance asks hysterically, “these three just kept freezing up every time I so much as looked at them!” </span>\n</p>\n<p> </p>\n<p>\n<span>He gestures wildly at Shiro, Keith and Pidge.</span>\n</p>\n<p> </p>\n<p>\n<span>“How is that supposed to help us! I had to start doing my own thing! I couldn't even try to work with them because they couldn't even deal with me! What else was I supposed to do!? Let Keith and Pidge keep stopping every time I went near them? Have Shiro hesitate on a move just because I say his name!? </span>\n<em>\n<span>There was nothing else I could do</span>\n</em>\n<span>!”</span>\n</p>\n<p> </p>\n<p>\n<span>The level of vitriol and unsteadiness in his voice honestly worries Allura. What is </span>\n<em>\n<span>wrong </span>\n</em>\n<span>with him today?</span>\n</p>\n<p> </p>\n<p>\n<span>“Is this because you've done something to them today?” It's the logical conclusion.</span>\n</p>\n<p> </p>\n<p>\n<span>“No!” Lance starts advancing on her, “That's the fucking problem! I haven't done shit to them! At all!”</span>\n</p>\n<p> </p>\n<p>\n<span>“Lance,” Hunk calls softly.</span>\n</p>\n<p> </p>\n<p>\n<span>“How dare you ask me that!?” Lance demands, and Allura finally has to begin taking steps back when he gets right up to her face. “How dare you accuse me of not taking this seriously!?”</span>\n</p>\n<p> </p>\n<p>\n<span>Allura is in a state of disbelief. Why is no one intervening? Lance is legitimately aggressing on her right now and the paladins are just watching with horrified eyes.</span>\n</p>\n<p> </p>\n<p>\n<span>Unless the think it's warranted?</span>\n</p>\n<p> </p>\n<p>\n<span>“I take this seriously every day! It's in everything that I do!” Lance follows her, eyes wild. “It's in the way that I take anything anyone says to me at all! I let you guys come down on me</span>\n<em>\n<span> all the time!</span>\n</em>\n<span> And the one day where I don't feel up to it? All of sudden </span>\n<em>\n<span>everyone </span>\n</em>\n<span>is ten times worse!? How dare you blame me for everything that happened?”</span>\n</p>\n<p> </p>\n<p>\n<span>“I don't blame just you,” Allura tries to cut in, having the stark feeling that she's in the wrong somehow.</span>\n</p>\n<p> </p>\n<p>\n<span>“Could have fooled me! I was the first person you started going for!” Lance snaps, “I am always the first person! And it's not always my fault! What is with everyone today!?” </span>\n</p>\n<p> </p>\n<p>\n<span>He finally stops, taking in a shaky breath and stepping away from her. Much to her relief. Has this side of her paladin always existed?</span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>Esto es jodidamente ridículo</span>\n</em>\n<span>,” Lance mutters in the interesting language he sometimes slips into. But his voice is harsh and syllables aren't as pretty as she's used to. </span>\n<em>\n<span>“No necesito esto. ¿Qué hay de malo en todo el mundo hoy?</span>\n</em>\n<span>”</span>\n</p>\n<p> </p>\n<p>\n<span>He takes another breath, face red. Allura gasps as his eyes fill with tears.</span>\n</p>\n<p> </p>\n<p>\n<span>“Why is everyone being so </span>\n<em>\n<span>mean </span>\n</em>\n<span>to me today?” His voice breaks. There's a tick of an awful silence, and then Lance is running from the training deck, swiping at his eyes the entire time.</span>\n</p>\n<p> </p>\n<p>\n<span>Allura is struck with a sense of shame. She's not sure what just happened. But she knows instinctively that she could have handled it better.</span>\n</p>\n<p> </p>\n<p>\n<span>Silence.</span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>Nice going guys</span>\n</em>\n<span>,” the uncharacteristically harsh and sarcastic tone to Hunk's voice has them all staring at the yellow paladin.</span>\n</p>\n<p> </p>\n<p>\n<span>Hunk glares at them, which is a very uncomfortable sight, before running after his friend.</span>\n</p>\n<p> </p>\n<p>\n<span>“I think it's time we all rested for this cycle,” Corans tired voice comes over the intercom.</span>\n</p>\n<p> </p>\n<p>\n<span>The remaining three paladins are staring at her. The tension in the room is stifling. Allura looks down.</span>\n</p>\n<p> </p>\n<p>\n<span>Her hands are shaking.</span>\n</p>\n<p>\n<span>“Dammit,” Hunk swears softly. There's a reason he tries to never let Lance get a head start. Hunk always gets left in the dust.</span>\n</p>\n<p> </p>\n<p>\n<span>His friend is nowhere in sight, but Hunk knows that he's been down this way. Lance has a select few places that he gravitates to when he gets like this, and if Hunk can get to him fast enough, maybe he can minimize the damage.</span>\n</p>\n<p> </p>\n<p>\n<span>“Hunk!”  Pidge's voice calls, and he turns to see her and Keith running up to him. Nope.</span>\n</p>\n<p> </p>\n<p>\n<span>“Oh no,” Hunk states firmly, and they stop. “You all have to stay away,” he insists, “Lance doesn't want to see any of you at the moment.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Hunk,” Keith tries.</span>\n</p>\n<p> </p>\n<p>\n<span>“Sorry, but </span>\n<em>\n<span>no</span>\n</em>\n<span>.” This is not up for discussion. This whole thing started with them, and while Hunk is sure it has to end with them too, now is not the time. Now, he just needs to make sure his best friend doesn't start self-destructing. “You don't understand,”  he explains, “Lance needs to be calm before you all apologize, or he won't listen to any of you.” </span>\n</p>\n<p> </p>\n<p>\n<span>“You can calm him down right?” Keith asks, game face on. Good, he should be determined.</span>\n</p>\n<p> </p>\n<p>\n<span>“Honestly?” Hunk sighs, “I don't really know. What happened with Allura just now was bad. Really bad. And on top of everything else…”</span>\n</p>\n<p> </p>\n<p>\n<span>Hunk is about to ask a few things that aren't very fair. But Lance somewhere hysterical with anger and sadness because his entire team has been ganging up on him today. </span>\n</p>\n<p> </p>\n<p>\n<span>“Why </span>\n<em>\n<span>have </span>\n</em>\n<span>you guys been so mean today?” He doesn't very much feel like being fair anymore.</span>\n</p>\n<p> </p>\n<p>\n<span>Pidge flinches and Keith's jaw clenches. But neither one answers.</span>\n</p>\n<p> </p>\n<p>\n<span>“Seriously?” Hunk throws his hands up, “you need to be able to answer me! Because if you can't answer me, then you won't be able to answer Lance either! And if you don't answer Lance when he asks, if you don't show him that you understand what happened and why you're in the wrong for it, your relationships with him will never be the same!”</span>\n</p>\n<p> </p>\n<p>\n<span>Pidge, for her part, looks terrified at the prospect. Keith swallows audibly, but doesn't back down.</span>\n</p>\n<p> </p>\n<p>\n<span>“I know what I did wrong now,” he insists, “if you get Lance to talk to me, I will make things right. I swear to you Hunk, I'll make it right, and I won't ever let this happen again.” </span>\n</p>\n<p> </p>\n<p>\n<span>Keith is serious, there's that fire in his eyes that tells people to get out of his way. Good.</span>\n</p>\n<p> </p>\n<p>\n<span>“I know too,” Pidge joins, “I've known Lance for a long time now. I should have paid more attention. Maybe none of this would have happened if I didn't start it.” </span>\n</p>\n<p> </p>\n<p>\n<span>Hunk says nothing. He </span>\n<em>\n<span>really </span>\n</em>\n<span>doesn't feel like being fair right now. </span>\n</p>\n<p> </p>\n<p>\n<span>“But everything that happened back there put things into a new perspective,” Pidge goes on, “He isn't in a mood, this isn't some sad phase. This was a long time coming, and if it didn't happen today, it would have happened eventually.”</span>\n</p>\n<p> </p>\n<p>\n<span>Hunk agrees.</span>\n</p>\n<p> </p>\n<p>\n<span>“But since it happened today,” Pidge nods determinedly, “then we'll do everything we can to fix it today too.”</span>\n</p>\n<p> </p>\n<p>\n<span>Hunk finally gives them a small smile. </span>\n<em>\n<span>There's </span>\n</em>\n<span>his teammates. </span>\n</p>\n<p> </p>\n<p>\n<span>“You do whatever you need to do Hunk,” Keith suggests, “and when Lance is ready, doesn't matter when, call us. We'll be there. You don't have to fix this alone.”</span>\n</p>\n<p> </p>\n<p>\n<span>Hunk nods, overcome with affection for his friends. “I'll be sure to do that,” he promises, before turning and running in the direction of the star map room.</span>\n</p>\n<p> </p>\n<p>\n<span>His best friend needs him.</span>\n</p>\n<p> </p>\n<p>\n<span>….</span>\n</p>\n<p> </p>\n<p>\n<span>The silence is stifling.</span>\n</p>\n<p> </p>\n<p>\n<span>It takes a lot to make Coran uncomfortable. He's stood next to leaders during some of the most tumultuous and tension-filled negotiations in the universe, and none of them have quite the same atmosphere as this.</span>\n</p>\n<p> </p>\n<p>\n<span>For once, he realizes as he watches Shiro stand in front of the door, blocking Allura’s exit. For once, he doesn't know what to say at all. </span>\n</p>\n<p> </p>\n<p>\n<span>“Shiro,” the princess murmurs, “please step aside.”</span>\n</p>\n<p> </p>\n<p>\n<span>Her voice is soft, and Coran imagines that she has to be quite shocked about what just happened. He is not doing much better himself. </span>\n</p>\n<p> </p>\n<p>\n<span>“No,” Shiro shakes his head, “I won't.”</span>\n</p>\n<p> </p>\n<p>\n<span>The black paladin and the princess have disagreed on courses of action before, but Shiro has always been willing to fold eventually. That is not the case here. Coran fully believes him when he says that he's not going to move.</span>\n</p>\n<p> </p>\n<p>\n<span>“That's enough, black paladin,” Allura's voice hardens every so slightly, but she still sounds unsure. “There has been a startling level of insubordination tonight, do not add to it.”</span>\n</p>\n<p> </p>\n<p>\n<span>She is referring to how Pidge and Keith had just gone off after the yellow paladin a few moments past, ignoring and snubbing Allura's requests and demands for a more thorough explanation of the situation. Allura had bristled, going to follow them, when Shiro had stepped right in her path and not moved when ordered. This is surely the most uncomfortable Coran has ever been, watching the two leaders stare each other down in the wake of one of the most heartbreakingly emotional occurrences to ever take place since they awoke.</span>\n</p>\n<p> </p>\n<p>\n<span>“I won't move,” Shiro insists. His voice is soft, his face is sad, but his eyes are hard. “Not until you hear me out.”</span>\n</p>\n<p> </p>\n<p>\n<span>“The time for discussion has passed!” Allura snaps back, “we must take action! The dissension within Voltron must corrected tonight! I don't have time to hear you out!”</span>\n</p>\n<p> </p>\n<p>\n<span>“And that's what the problem is,” Shiro's volume remains level, but his tone grows darker as he scowls. “You should have listened, Princess. To us, when we tried to get you stop. To Coran, when he suggested we cancel for tonight.”</span>\n</p>\n<p> </p>\n<p>\n<span>Allura looks over at Coran then. He merely sighs in response. As much as it kills him, he cannot support Allura here. Regardless of which one of them is right, this is a conversation the two leaders need to have themselves. Anything he has to offer at this moment will be an impediment.</span>\n</p>\n<p> </p>\n<p>\n<span>“You should have listened to me,” Shiro says quietly, “I'm their leader, my opinion should have carried some weight here tonight.”</span>\n</p>\n<p> </p>\n<p>\n<span>“I saw no </span>\n<em>\n<span>leading </span>\n</em>\n<span>whatsoever Shiro,” Allura scolds, “you were quiet and reserved and just as distracted.”</span>\n</p>\n<p> </p>\n<p>\n<span>“And if you'd taken the time to listen,” the black paladin retorts, “then you would know why. You wouldn't have made faulty assumptions like me and made the situation worse for it.” </span>\n</p>\n<p> </p>\n<p>\n<span>“Then explain the situation to me now,” Allura demands, “because if Lance is causing such issues that it results in this, then we need to have a course of action!”</span>\n</p>\n<p> </p>\n<p>\n<span>It hurts Coran to hear her so gravely misunderstand the situation, but he must allow this conversation to run it's course. </span>\n</p>\n<p> </p>\n<p>\n<span>“Lance has not caused an issue!” Shiro's voice finally raises, eyes fierce with a protective fire. “It's the rest of us with the issues! Lance just happened to be the one to have to deal with it today.”</span>\n</p>\n<p> </p>\n<p>\n<span>“That makes no sense to me!” Allura shouts back.</span>\n</p>\n<p> </p>\n<p>\n<span>“Well then let us explain it to you!” Shiro snarls. The princess reers back. Coran can see she is buckling under the intensity. Two paladins shouting at her in one night, the same night as all of the paladins showing their more...difficult sides. </span>\n</p>\n<p> </p>\n<p>\n<span>Still, they have to reach an understanding with each other.</span>\n</p>\n<p> </p>\n<p>\n<span>“Very well then,” Allura acquiesces, voice tight. “I want an explanation, from all of you.”</span>\n</p>\n<p> </p>\n<p>\n<span>“You might have to settle for Keith, Pidge and myself,” Shiro responds firmly, “there's no way Hunk is doing anything but tracking down Lance right now. I'm more than inclined to let him do it.”</span>\n</p>\n<p> </p>\n<p>\n<span>Allura breathes deeply, shoulders tense with ire. Coran stares, this is a defining moment.</span>\n</p>\n<p> </p>\n<p>\n<span>“Fine,” she sighs. </span>\n</p>\n<p> </p>\n<p>\n<span>Excellent. Coran sighs in relief. Now he can help.</span>\n</p>\n<p> </p>\n<p>\n<span>“I shall see about gathering them,” he pronounces, and the two whip around to stare at him. Apparently he'd been forgotten. But that's ok. He does his best work in the background. “This conversation would be better suited in a more amicable environment? I will bring Keith and Pidge to the sitting room, and then allow you all to discuss.”</span>\n</p>\n<p> </p>\n<p>\n<span>Allura frowns, “will you not join us Coran?”</span>\n</p>\n<p> </p>\n<p>\n<span>“I'm afraid I will not my dear,” He answers, “The details don't matter so much to me at the moment. I am far more concerned with how we will remedy this.” </span>\n</p>\n<p> </p>\n<p>\n<span>Coran is help. He will help where it's needed most.</span>\n</p>\n<p>\n<span>He sends Allura and the black paladin off, trusting them not to continue an argument, and immediately makes for Keith and Pidge.</span>\n</p>\n<p> </p>\n<p>\n<span>His mind is troubled, and his heart heavy. How is it that this has all come to pass on this one day? It started out so well. But as Coran sets a brisk pace through the halls in search of the red and green paladins, he can’t help but feel as though this was inevitable. Lance had behaving oddly all week, and it’s part of the reason he enlisted Keith’s help for cleaning the pods today instead. The Blue paladin has been in need of rest for a long time now, supporting a team in no simple task. Coran is ashamed that he didn’t help him more. </span>\n</p>\n<p> </p>\n<p>\n<span>His musings occupy his mind. Before he knows it, he sees Keith and Pidge.</span>\n</p>\n<p> </p>\n<p>\n<span>“Ah, paladins” they're together, which makes it easier. “Please make your way to the sitting room. Allura and Shiro have decided that a discussion is in order.” </span>\n</p>\n<p> </p>\n<p>\n<span>“It sure is,” the red paladin scowls, “she went too far back there Coran.”</span>\n</p>\n<p> </p>\n<p>\n<span>“You're quite right about that my boy,” the advisor nods. The shock on their faces is priceless. Do they not realize that part of an advisor’s duty is correcting their charges when necessary? “But as I understand it, this is a common theme with the team today,” he reminds gently.</span>\n</p>\n<p> </p>\n<p>\n<span>“You're right,” the green paladin admits, “but we're all ready to fix it.” </span>\n</p>\n<p> </p>\n<p>\n<span>“Excellent,” Coran knows that they can come back from this, “please proceed then.” </span>\n</p>\n<p> </p>\n<p>\n<span>“Where are you going?” Keith questions.</span>\n</p>\n<p> </p>\n<p>\n<span>“Where I am most needed.” </span>\n</p>\n<p> </p>\n<p>\n<span>Coran shoos them on, and then sets a path for the Blue Lion's hanger.</span>\n</p>\n<p> </p>\n<p>\n<span>…</span>\n</p>\n<p> </p>\n<p>\n<span>Lance wasn't in the star map room.</span>\n</p>\n<p> </p>\n<p>\n<span>And that's fine. Hunk didn't actually expect him to be there. It was where Lance went when he was homesick and it was getting to him. He always went alone, but the potential for others to join him was there. The yellow paladin really just wanted to rule it out. </span>\n</p>\n<p> </p>\n<p>\n<span>No. Not the star map. Not his room. There's very little doubt in Hunk's mind. Lance is with Blue. His Lion is the place where the blue paladin can be totally sure that he'll be left alone, as Blue is very protective, and will throw up a particle barrier keeping others out in a heartbeat. </span>\n</p>\n<p> </p>\n<p>\n<span>Coran seems to have the same idea, as he's there when Hunk walks into the hanger. </span>\n</p>\n<p> </p>\n<p>\n<span>“Hey Coran,” the yellow paladin greets quietly, walking up to stand next to the Altean. </span>\n</p>\n<p> </p>\n<p>\n<span>“Yellow Paladin,” Coran nods back. They both stare at the Blue Lion and her active particle barrier. They take a moment, share a glance. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance supports. Hunk fixes. Coran helps. The team needs all of them in top shape. The oldest gives a soft sigh and approaches the barrier.</span>\n</p>\n<p> </p>\n<p>\n<span>“Let's get started, shall we?”</span>\n</p>\n<p>\n<span>When Lance was fourteen, he’d had his first real emotional breakdown. It was bad.</span>\n</p>\n<p> </p>\n<p>\n<span>His younger sister Driselle was a well-spoken and articulate twelve year old. She was his first younger sister, and Lance doted on her like no other. His mother had always had the habit of leaving him to watch the three youngest while the three oldest worked in order to pay off their home and put themselves through schools. Lance loved Driselle dearly, but good lord was she </span>\n<em>\n<span>mean</span>\n</em>\n<span>.</span>\n</p>\n<p> </p>\n<p>\n<span>She had gone into the rebellious phase, with a healthy side of pre-teen angst and an extra serving of “my-brother-always-embarrases-me”. And Lance had been all too willing to take anything she had to dish out. </span>\n</p>\n<p> </p>\n<p>\n<span>If Lance wasn’t annoying (</span>\n<em>\n<span>dios, who taught her that word?</span>\n</em>\n<span>), then he was stupid. If he wasn’t stupid, then he embarrassing. He almost never got smiles, just little scowls all the time. Whenever he tried to correct her, he was unfair and biased and the worst babysitter ever. Meena, ten years old, and Thalia, age seven, had eventually followed Driselle’s lead. They were spectacular at behaving when the rest of the family was around, but when Lance watched them by himself. Well. </span>\n</p>\n<p> </p>\n<p>\n<span>Just. Well.</span>\n</p>\n<p> </p>\n<p>\n<span>And he’d always been such a sensitive boy, even when he was that age. Especially when he was that age. But what he </span>\n<em>\n<span>didn’t</span>\n</em>\n<span> have at that age, was any type of backbone. It all came to pass one night. </span>\n</p>\n<p> </p>\n<p>\n<span>He’d wanted to make sure that they ate. That’s all he wanted to do. They had been teasing him all night, and it was getting harder and harder to paste a smile on. And then Driselle had huffed and pushed her little finger in his face.</span>\n</p>\n<p> </p>\n<p>\n<span>“Oh my gosh, Alejandro!” she’d jeered, “you’re so annoying! You’re the worst big brother ever! We wish we had a different brother! Why’d we get stuck with you!?” </span>\n</p>\n<p> </p>\n<p>\n<span>Lance had froze.</span>\n</p>\n<p> </p>\n<p>\n<span>“Worst brother ever!” Meena cheered.</span>\n</p>\n<p> </p>\n<p>\n<span>“Worst brother ever!” Thalia joined in.</span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>Worst brother ever, worst brother ever, worst brother ever, worst brother ever!</span>\n</em>\n<span>”</span>\n</p>\n<p> </p>\n<p>\n<span>Worst brother ever?</span>\n</p>\n<p> </p>\n<p>\n<span>His oldest sister Pamela had come home to find the three girls panicked and upset.</span>\n</p>\n<p> </p>\n<p>\n<span>“Pamela!” Driselle had shrieked, “</span>\n<span>¡</span>\n<em>\n<span>Algo anda mal con Alejandro! ¡Por favor ayudarlo!</span>\n</em>\n</p>\n<p>\n<em>\n<span>¡No quise hacerlo! ¡No quise hacerlo</span>\n</em>\n<span>!” </span>\n</p>\n<p> </p>\n<p>\n<span>Pamela had rushed into the kitchen to find Lance curled up in the freezer, having yanked everything out and spread it over the kitchen. His skin had gone deathly pale, tear tracks frozen on his cheeks and he’d almost completely bitten through his lower lip, blood staining his plain white t-shirt. </span>\n</p>\n<p> </p>\n<p>\n<span>“Worst brother ever…” he’d muttered. Over and over again while his sister called everyone and loaded them up in her truck in order to take Lance to the hospital. </span>\n</p>\n<p> </p>\n<p>\n<span>His mother had tore into his three little sisters terribly, and Lance had felt bad the entire time, insisting that it was his fault. That he deserved it. Pamela had been beside herself with worry, apparently recognizing several signs from her Psychology courses, and had rallied his other older sister, Lisandra and his older brother, Arturio, and sat with Lance overnight in the hospital.</span>\n</p>\n<p> </p>\n<p>\n<span>“I know you don’t like to,” Pamela had said softly, “but you </span>\n<em>\n<span>need</span>\n</em>\n<span> to start standing up for yourself Alejandro. Por favor. You cannot let them treat you like that. When your feelings are hurt, when they are being disrespectful and rude, you need to correct them.”</span>\n</p>\n<p> </p>\n<p>\n<span>“But I,” Lance had said, cringing with pain as it pulled on his lower lip.</span>\n</p>\n<p> </p>\n<p>\n<span>“When you do not correct them Alejandro,” Lisandra had picked it up from there, “you let them think it’s ok to treat you that way. They are your family, gatito, but that does not mean that they can talk to you like that.” </span>\n</p>\n<p> </p>\n<p>\n<span>“They love you, Alejandro,” Pamela insisted, “they care so deeply for you, and they are very upset that they hurt your feelings. Sometimes people we care about make mistakes, and they need to be corrected.”</span>\n</p>\n<p> </p>\n<p>\n<span>“You believed them,” Arturio muttered, and the room went silent, “didn’t you?”</span>\n</p>\n<p> </p>\n<p>\n<span>They had paused for a moment. Lance had started crying again, curling up to his big brother who’d occupied the bed with him. </span>\n</p>\n<p> </p>\n<p>\n<span>“That’s why you kept saying that,” the older McClain continued, “that you’re the worst brother ever?”</span>\n</p>\n<p> </p>\n<p>\n<span>“They kept saying it…” Lance had whined.</span>\n</p>\n<p> </p>\n<p>\n<span>“You’re not, Alejandro,” Arturio insisted softly, “you’re a wonderful big brother, and a wonderful younger brother too.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Then why would they say that to me!?” Lance demanded.</span>\n</p>\n<p> </p>\n<p>\n<span>“They didn’t mean it,” Arturio says firmly, “they said it as a joke. A very mean joke. But a joke nonetheless. That’s why you have to stop people from going too far sometimes, Alejandro. If they think they can say anything to you, someday they’ll say something that they do not mean and then you’ll believe them and then things like this will happen.”</span>\n</p>\n<p> </p>\n<p>\n<span>Lance sniffled, but nodded.</span>\n</p>\n<p> </p>\n<p>\n<span>“Promise us,” Pamela insisted, “that you’ll stand up for yourself more?”</span>\n</p>\n<p> </p>\n<p>\n<span>“I know you like to take things on your shoulders because it makes you feel good,” Lisandra added, “but you can only do that if you’re in good health. So you can’t let others put you down like that.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Ok?” Arturio had ran a hand through Lance’s hair, “Alejandro?”</span>\n</p>\n<p> </p>\n<p>\n<span>It took a moment, but Lance had eventually nodded, ready to take on this new challenge.</span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>Si</span>\n</em>\n<span>.”</span>\n</p>\n<p> </p>\n<p>\n<span>….</span>\n</p>\n<p> </p>\n<p>\n<span>Lance curls up on the floor of Blue’s cockpit. </span>\n</p>\n<p> </p>\n<p>\n<span>It’s hot. His skin is too hot. He’s sweating. His breathing is short. He chest hurts. His eyes burn. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance yanks off of his shirt, flopping down on the cool floor. He always gets so hot when this happens. His hands are shaking, his teeth are chattering. He’s angry, and frustrated, and sad, and hurt, and </span>\n<em>\n<span>betrayed</span>\n</em>\n<span>, and </span>\n<em>\n<span>heartbroken</span>\n</em>\n<span>, and he hates himself, but he also hates </span>\n<em>\n<span>them</span>\n</em>\n<span> and-</span>\n</p>\n<p> </p>\n<p>\n<span>No. </span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>No, no, no</span>\n</em>\n<span>. Lance does not hate his team. He loves them. Lance loves them so much it hurts. He loves to see Pidge light up with a smile and a cheer of triumph whenever she finally cracks a tough technical problem. He loves to see Keith look proud and satisfied with himself when he executes a particularly difficult maneuver. He loves to see Shiro look at his team with a look of fondness and pride. He loves to watch Hunk get all excited over figuring out a new recipe or a new mechanic of his lion. He loves to watch Allura giggle and gossip with the mice. He loves to watch Coran’s wistful yet proud expression when he talks about stories from Altea. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance loves his team so much. Why don’t they love him?</span>\n</p>\n<p> </p>\n<p>\n<span>....</span>\n</p>\n<p> </p>\n<p>\n<span>He’d broken down a second time when he was sixteen. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance didn’t really have many friends at the Garrison. He was social, he talked to people. People knew him. But no one liked him. Except for his roommate, Hunk.</span>\n</p>\n<p> </p>\n<p>\n<span>But they’d recently had a falling out, and while it was something they’d resolved rather quickly (because Hunk was literally a teddy bear, and no one can stay mad a teddy bears), it had left a slight awkwardness while they tried to navigate the new understanding of their friendship. So that night, he’d decided to hang out with a few kids from his engineering class (Hunk was an engineering prodigy, and was in an engineering class three whole levels above Lance). </span>\n</p>\n<p> </p>\n<p>\n<span>He remembered most names from people at the Garrison, but there were very few that he knew more than just a casual acquaintance. These three teens, Tyler, Sander and Holland, were in his group for class though, and he’d eaten lunch with them a few times when Hunk’s classes ran over. To a socially-starved Lance McClain at sixteen years old, this meant they were his closest friends apart from his roommate. </span>\n</p>\n<p> </p>\n<p>\n<span>They had sat around a table in one of the commons, all set to play a few card games. But here’s the thing. Lance did everything with his family before going to the Garrison, including playing games. Anything they didn’t play, he didn’t know how to play. And the only card games they played were Uno and Go Fish, because the entire range of children could easily understand the rules.</span>\n</p>\n<p> </p>\n<p>\n<span>So when Lance had asked Sander to explain a card game for a third time, the blonde haired boy had laughed derisively.</span>\n</p>\n<p> </p>\n<p>\n<span>“Jeez Lance,” he’d said, voice mildly irritated, “don’t you play any games with your family?”</span>\n</p>\n<p> </p>\n<p>\n<span>“Sure I do!” Lance had responded quickly, always eager to talk about his family. “Back on Varradero Beach, we used to do this thing where-”</span>\n</p>\n<p> </p>\n<p>\n<span>“Whoa wait,” Tyler interrupted, “where?</span>\n</p>\n<p> </p>\n<p>\n<span>“Uh,” Lance had been confused, “Varradero Beach?”</span>\n</p>\n<p> </p>\n<p>\n<span>They had stared at him.</span>\n</p>\n<p> </p>\n<p>\n<span>“It’s in Cuba?” he’d responded, unsure of why they seemed so intrigued. He slipped into spanish all the time back then, there’s no way they should have been surprised about the fact that he came from a Hispanic country. </span>\n</p>\n<p> </p>\n<p>\n<span>“Why aren’t you at the Cuban sect of the Garrison then?” Sander asked curiously.</span>\n</p>\n<p> </p>\n<p>\n<span>The Garrison, being a worldwide intercultural space exploration program, had campuses in many countries. Lance had gotten into one of the leading ones, located in Arizona in the States, but there was in fact a specialized campus located in Cuba as well. </span>\n</p>\n<p> </p>\n<p>\n<span>“I didn’t pass the test to get into that one,” he’d admitted, “but my scores were enough for me to go here after three tries, so…”</span>\n</p>\n<p> </p>\n<p>\n<span>He didn’t think anything of it, Hunk had never ridiculed him for failing the entrance to the Garrison multiple times. Lance had no logical reason to think that admitting his failure wasn’t the best choice.</span>\n</p>\n<p> </p>\n<p>\n<span>Holland, with her pretty green eyes and long brown hair, had snorted.</span>\n</p>\n<p> </p>\n<p>\n<span>Lance was instantly on edge, “...what?”</span>\n</p>\n<p> </p>\n<p><span>“It took you </span><em><span>three</span></em> <em><span>tries</span></em><span> to get into this place?” Holland asked.</span></p>\n<p> </p>\n<p>\n<span>“Yeah…” the hispanic boy had responded, not understanding the fascination.</span>\n</p>\n<p> </p>\n<p>\n<span>“Dude,” Tyler had chuckled, “you must be a low-key idiot then.”</span>\n</p>\n<p> </p>\n<p>\n<span>“What?” that had stung. Sure, he wasn’t as smart as Hunk, and he had to work much harder to get decent grades, but Lance worked hard.</span>\n</p>\n<p> </p>\n<p>\n<span>“Did you just get lucky?” Sander asked, voice taunting. But Lance didn’t make the connection. They were his friends, they weren’t going out of their way to hurt his feelings. He was just being too sensitive. Like always.</span>\n</p>\n<p> </p>\n<p>\n<span>“No,” Lance had murmured, “I just don’t test well, but that last time I worked super hard and nailed it.”</span>\n</p>\n<p> </p>\n<p>\n<span>“What’d you get?” Holland had asked.</span>\n</p>\n<p> </p>\n<p>\n<span>“A 274,” he’d answered. The test was out of 350. A 270 was the minimum required to pass. A 330 was necessary to get into a campus like the Cuba one. </span>\n</p>\n<p> </p>\n<p>\n<span>“Just four points above!?” Tyler cackled, “and you say you </span>\n<em>\n<span>didn’t</span>\n</em>\n<span> get lucky?”</span>\n</p>\n<p> </p>\n<p>\n<span>Lance had frowned. Why were they being assholes all of a sudden.</span>\n</p>\n<p> </p>\n<p>\n<span>“What did you get the first two tries?” Holland asked around her giggles.</span>\n</p>\n<p> </p>\n<p>\n<span>There was probably a punchline coming up, and he was just missing it. Lance didn’t have much experience dealing with these people.</span>\n</p>\n<p> </p>\n<p>\n<span>“A 190 and then a 234,” he’d answered meekly, somehow knowing that he probably shouldn’t have told them that.</span>\n</p>\n<p> </p>\n<p>\n<span>“Holy shit!” Sander had shouted, throwing his head back and laughing aloud. “Dude! You are a low-key idiot!”</span>\n</p>\n<p> </p>\n<p>\n<span>“No fooling!” Tyler continued cackling, “that’s embarrassing!”</span>\n</p>\n<p> </p>\n<p>\n<span>“Hey…” Lance had protested. What happened? They had been so nice not half an hour before that point.</span>\n</p>\n<p> </p>\n<p>\n<span>“Lance,” Holland had said very seriously, and he looked at her, expecting her to step in and stop them from making fun of him like that. She was so nice. “You’re pathetic.”</span>\n</p>\n<p> </p>\n<p>\n<span>“What…?” he’d asked quietly.</span>\n</p>\n<p> </p>\n<p>\n<span>“You’re pathetic,” she sing-songed. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance, finally having the wherewithal to see what had been happening that night, had stood and stormed from the room.</span>\n</p>\n<p> </p>\n<p>\n<span>But the damage had been done. </span>\n</p>\n<p> </p>\n<p>\n<span>“Lance McClain is pathetic” had become the theme of the campus the next day. It turned out that Holland knew like, everyone. He’d heard it whispered in class. As he tried to eat in the cafeteria. In the commons. During simulations. In the showers. </span>\n</p>\n<p> </p>\n<p>\n<span>And the instructors had did nothing, no one had did anything. Hunk had tried to talk to him about three times that day, but Lance avoided him each time. Hunk hadn’t like the three in the first place. He was right.</span>\n</p>\n<p> </p>\n<p>\n<span>And Lance. He’d learned to stand up for himself to his siblings and to the people of his town, even gotten a bit of a reputation for it. And not long beforehand, he’d showed Hunk why he had a reputation. But this wasn’t family, and these were not his friends. Lance didn’t know how to stand up to what seemed to be everybody. So they didn’t stop.</span>\n</p>\n<p> </p>\n<p>\n<span>So naturally, he’d eventually believed it.</span>\n</p>\n<p> </p>\n<p>\n<span>Hunk had found him that time.</span>\n</p>\n<p> </p>\n<p>\n<span>Lance had been in showers, sitting under the spray with the water as cold as he could get it. He’d bitten and opened up the scar on the inside of his lower lip, so he must have looked like a fright, blood pouring from his mouth and mixing with the stream of ice cold water as he shivered and sat there, only in his boxers.</span>\n</p>\n<p> </p>\n<p>\n<span>“Lance,” Hunk had sounded heartbroken, not hesitating to gather the smaller boy in his arms.</span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>Pathetic</span>\n</em>\n<span>,” Lance had been whimpering, “I’m pathetic. I’m pathetic. </span>\n<em>\n<span>I’m pathetic</span>\n</em>\n<span>…”</span>\n</p>\n<p> </p>\n<p>\n<span>“You’re not,” his roommate shut the water off, pulling Lance closer, “you’re not. You’re not. I </span>\n<em>\n<span>swear</span>\n</em>\n<span> you’re not.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Hunk,” he’d sobbed.</span>\n</p>\n<p> </p>\n<p>\n<span>“I got you buddy.”</span>\n</p>\n<p> </p>\n<p>\n<span>Hunk had taken him to the infirmary, somehow managing to get Lance through the halls unnoticed, and had sat with him all night.</span>\n</p>\n<p> </p>\n<p>\n<span>“Why are you letting them say that to you?” Hunk had asked.</span>\n</p>\n<p> </p>\n<p>\n<span>“I…” Lance choked.</span>\n</p>\n<p> </p>\n<p>\n<span>“You know,” Hunk had said thoughtfully, “you don’t have to only stand up for yourself when it comes to people you’re familiar with. It’s ok to not let people put you down like that.”</span>\n</p>\n<p> </p>\n<p>\n<span>“I’m…”</span>\n</p>\n<p> </p>\n<p>\n<span>“Yeah bud?”</span>\n</p>\n<p> </p>\n<p>\n<span>“I’m afraid…” Lance had been so ashamed to admit it. But he didn’t know what people would do if he tried to defend himself. Would they get worse?</span>\n</p>\n<p> </p>\n<p>\n<span>“Don’t be,” Hunk had insisted, voice surprisingly protective, “I’ve got your back. Always.”</span>\n</p>\n<p> </p>\n<p>\n<span>“...Really?”</span>\n</p>\n<p> </p>\n<p>\n<span>“Whatever you do,” his best friend had said, “you won’t be doing it alone.”</span>\n</p>\n<p> </p>\n<p>\n<span>…</span>\n</p>\n<p> </p>\n<p>\n<span>No.</span>\n</p>\n<p> </p>\n<p>\n<span>It’s not that they don’t love him, Lance tries to remember this. Going down that road brings nothing good with it. He knows that they love him. It’s in the way Pidge leans on him when they sit on the couch together. The way Keith seeks Lance out for sparring or demands that the blue paladin go out with alongside him to try out new moves in their Lions. The way Shiro smiles when Lance finds the leader on one of his weird night patrols and welcomes his company. The way Hunk wants Lance to be the first one he shows a new recipe to, or a new mod he’s come up with. The way Allura lets him help her with her hair whenever they go out to a fancy diplomatic event. The way Coran pats Lance’s head and unashamedly declares the blue paladin to be his favorite.</span>\n</p>\n<p> </p>\n<p>\n<span>They love him. They do.</span>\n</p>\n<p> </p>\n<p>\n<span>So why have most of them been such assholes today?</span>\n</p>\n<p> </p>\n<p>\n<span>Lance fights to control his breathing and his shaking. It’s too hot.</span>\n</p>\n<p> </p>\n<p>\n<span>Pidge had been bad enough. It was a haunting reminder of the situation with his little sister Driselle. Lance could feel his heart drop at her words, but offense and anger had quickly overtaken that feeling, and he’d snapped. She’d listened, and taken him seriously, but Lance been left feeling drained and annoyed.</span>\n</p>\n<p> </p>\n<p>\n<span>And then Keith. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance bites at the scar on his lip.</span>\n</p>\n<p> </p>\n<p>\n<span>It hurt, to know that Keith was specifically seeking him out for a fight. Why was that one of the only times this week that Keith had approached him? Lance liked spending time with Keith. He was envious of the red paladin, but Lance knew it was born from admiration. Keith hadn’t so much as started a conversation with him for even more than the past week lately, and the first time he did was to pick a fight because he was in a bad mood. Lance couldn’t deal, and he’d tried to leave. He really did, but then Keith had to go and bring his mom into it. And that could not be allowed. Keith has a special and weird place in Lance’s heart, but that does not give him the right to touch such topics like that. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance presses his face into the floor even more. He’s burning.</span>\n</p>\n<p> </p>\n<p>\n<span>Shiro had just about broken his heart.</span>\n</p>\n<p> </p>\n<p>\n<span>Lance had been so close to crying when Shiro berated him for something that was blatantly not his fault. Because of course Shiro thought that Lance was to blame. Keith and Pidge have always been higher up on his priority list. The leader had seemed so angry, and Lance didn’t know what to do. But then Shiro had went and thrown out that jab about relying on Lance and oh if that didn’t piss him off like nothing else. Because Lance was trying, he was trying so hard when Shiro was away. He tries even now that he’s back. And to have Shiro throw that in his face over false assumptions? It was unacceptable. Lance could not let it go on. </span>\n</p>\n<p> </p>\n<p>\n<span>He’s vaguely aware of Blue trying to communicate with him, but the ringing in his ears and the pain from him gnawing on his scar are too distracting.</span>\n</p>\n<p> </p>\n<p>\n<span>Why did Allura have to add to it?</span>\n</p>\n<p> </p>\n<p>\n<span>He did his best during that training sequence. He was cranky and upset and did not want to see anyone on his team but Hunk. Allura had already poked his temper when he caught her berating Hunk for wanting to check on him. Because if there was anything that anyone on this ship was not going do, it would be to get on Hunk for being his amazing and thoughtful self. And then the fights against the gladiators had went horribly. Something had told him that Allura get on him about it, but he actually wasn’t prepared for her to try and lay all the blame at his feet. So, he lost it. And then he’d ran. </span>\n</p>\n<p> </p>\n<p>\n<span>Because he could feel this coming on.</span>\n</p>\n<p> </p>\n<p>\n<span>This...panic attack? Anxiety attack? Hunk doesn’t go through things like this. Lance never knows what’s wrong with his own body when he gets like this, but he knows that it’s terrifying to look at, and he was not going to give Allura and the others the chance to see just how much damage they had done. Lance is not weak, and he won’t have them thinking that he can’t back up the righteous anger he’d displayed today. That being said.</span>\n</p>\n<p> </p>\n<p>\n<span>His vision starts to blur. Breathing is hard. It’s still too fucking hot. It’s never gone on this long before.</span>\n</p>\n<p> </p>\n<p>\n<span>Figures, he’s going to pass out from this. Maybe he </span>\n<em>\n<span>is</span>\n</em>\n<span> weak.</span>\n</p>\n<p> </p>\n<p>\n<span>…</span>\n</p>\n<p> </p>\n<p>\n<span>His last break down before he got roped into Voltron had occurred when he was eighteen.</span>\n</p>\n<p> </p>\n<p>\n<span>Keith Kogane had been kicked out of the Garrison.</span>\n</p>\n<p> </p>\n<p>\n<span>Lance had been moved up to fighter pilot class.</span>\n</p>\n<p> </p>\n<p>\n<span>The two were directly connected. And none of his instructors had ever let him forget it. </span>\n</p>\n<p> </p>\n<p>\n<span>He wasn’t as strong as Keith. He wasn’t as fast as Keith. He wasn’t as skilled as Keith. He wasn’t as smart as Keith. He wasn’t a </span>\n<em>\n<span>natural</span>\n</em>\n<span> like Keith.</span>\n</p>\n<p> </p>\n<p>\n<span>The only saving grace was that he was a better shot and a more effective leader than Keith. But that was just because Keith had gotten the boot before he trained these skills. If he was still there, surely he would surpass Lance.</span>\n</p>\n<p> </p>\n<p>\n<span>Lance had finally gotten the position he’d dreamed for, and gotten Hunk on his team in an amazing stroke of luck. Pidge was weird and closed off, but Lance could work with that, given enough time. He was finally going where he really wanted to go, but his experience was directly intertwined with </span>\n<em>\n<span>KeithKeithKeithKeithKeith</span>\n</em>\n<span>.</span>\n</p>\n<p> </p>\n<p>\n<span>People were ridiculing him and being mean to him again. Lance couldn’t go a single day without some insult or comparison. But these were his teachers and instructors. Lance couldn’t stand up to them. </span>\n</p>\n<p> </p>\n<p>\n<span>So.</span>\n</p>\n<p> </p>\n<p>\n<span>Thank dios for Hunk.</span>\n</p>\n<p> </p>\n<p>\n<span>It had started as Iverson was getting in his face about how subpar he was compared to Keith. Only it was really bad this time. Pidge wasn’t paying attention during the exercise and screwed an essential part of the mock mission. Hunk had gotten too nervous and forgotten important details necessary for their success. Lance took the blame for both of these things upon himself. He was their leader. It was his fault anyway.</span>\n</p>\n<p> </p>\n<p>\n<span>Iverson tore into him in front of the entire class. But he always did that. The difference was that this time he was throwing in all these comments about Lance being an embarrassment to his family and if there was one thing that was going to get to the hispanic boy, it was that. </span>\n</p>\n<p> </p>\n<p>\n<span>His family were his biggest supporters. They wanted nothing more for Lance to live out his dreams. Everyone who could pitch in had worked together to pay for the steep tuition of the Garrison. And he was failing them.</span>\n</p>\n<p> </p>\n<p>\n<span>All at once his body heat seemed to skyrocket. His breathes got short and his eyes got wide and he was going to fall apart in front of everyone.</span>\n</p>\n<p> </p>\n<p>\n<span>But Hunk. Sweet, perfect Hunk. He’d recognized the warning signs and began gagging loudly, making like the residual effects from the simulation had caught up to him. </span>\n</p>\n<p> </p>\n<p>\n<span>Iverson had sighed in frustration, shooing them off to the infirmary.</span>\n</p>\n<p> </p>\n<p>\n<span>They’d left Pidge in the hall, she’d believed that Hunk really was sick and appeared very confused to see him suddenly stand upright and usher Lance away, apologizing all the while.</span>\n</p>\n<p> </p>\n<p>\n<span>Hunk had barely gotten Lance back to the room before it had fully set in. The hispanic boy had begun repeating Iverson’s words and biting on his lip and Hunk had to help him get his uniform off. </span>\n</p>\n<p> </p>\n<p>\n<span>Hunk had sat with him, holding his sweaty face between his hands and talking him through the attack softly. Lance had cried. Hunk had cried.</span>\n</p>\n<p> </p>\n<p>\n<span>But they got him through it together.</span>\n</p>\n<p> </p>\n<p>\n<span>Lance appreciates a lot of things in his.</span>\n</p>\n<p> </p>\n<p>\n<span>But nothing compares to his best friend.</span>\n</p>\n<p> </p>\n<p>\n<span>…</span>\n</p>\n<p> </p>\n<p>\n<span>Blue's intent cuts through the heat, worry sharp and icy. Lance sighs as his Lion forces cool waves of comfort over him. She's very panicked and upset underneath it all, but seems to know what to do to help. </span>\n</p>\n<p> </p>\n<p>\n<span>She pokes at his mind insistently, and Lance has just enough composure to let her in. </span>\n</p>\n<p> </p>\n<p>\n<span>The image of Coran staring imploringly up at him, no Blue, flips through his mind. Lance is relieved to see the Altean despite himself. Coran always helps. Maybe he'll scan Lance and finally provide some insight as to just what the hell is wrong with him.</span>\n</p>\n<p> </p>\n<p>\n<span>Behind him.</span>\n</p>\n<p> </p>\n<p>\n<span>Hunk stares directly up into Blue's eyes.</span>\n</p>\n<p> </p>\n<p>\n<span>“Buddy?” The yellow paladin asks tentatively, “Can we come in?”</span>\n</p>\n<p> </p>\n<p>\n<span>He's burning. He's so very angry and hurt and upset and...drained. Lance is so tired. But just as he finally passes out, he feels a sense of relief. His best friend is here.</span>\n</p>\n<p> </p>\n<p>\n<span>The Blue Lion lowers her barrier.</span>\n</p>\n<p> </p>\n<p>\n<span>When Lance wakes up, it's to Hunk's panicked voice. </span>\n</p>\n<p> </p>\n<p>\n<span>“-ran! He's never passed out from this before!” His best friend is frantic, “is he ok? Please say he's ok! People can pass out from not getting enough oxygen! What if there's lasting effects?”</span>\n</p>\n<p> </p>\n<p>\n<span>“If I may ask,” that's Coran, “what lasting effects might you be speaking of?” </span>\n</p>\n<p> </p>\n<p>\n<span>“Us human's have this thing where our brains take damage if we don't get enough oxygen for too long and-”</span>\n</p>\n<p> </p>\n<p>\n<span>“Allow me to settle your nerves a bit, yellow paladin,” Coran speaks calmly, “Lance is breathing now, I imagine his passing out had to with many more factors than just low oxygen intake. We will certainly scan him to be positive, but our dear boy appears to be fine now.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Are you sure?” Hunk's voice is high with anxiety. That just won't do.</span>\n</p>\n<p> </p>\n<p>\n<span>“Buddy,” Lance murmurs. His throat hurts from all the yelling he's done today, and the word comes out croaked, but both his companions hear it well enough.</span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>Lance</span>\n</em>\n<span>!” Hunk's voice is relief incarnate, and the blue paladin smiles without opening his eyes. Not many people sound that happy to see him very often. “Don't just smile!” His best friend complains indignantly.</span>\n</p>\n<p> </p>\n<p>\n<span>Lance opens his eyes.</span>\n</p>\n<p> </p>\n<p>\n<span>They're still in Blue, his head is resting on his friend's thigh and Coran is standing over them both, looking down at Lance with a big smile. He's not burning anymore, it's actually kind of cold. He can breathe fine now, and there is no ringing in his ears. </span>\n</p>\n<p> </p>\n<p>\n<span>His lip hurts though.</span>\n</p>\n<p> </p>\n<p>\n<span>Lance must wince or something, because Coran’s smile loses some of it's brightness.</span>\n</p>\n<p> </p>\n<p>\n<span>“You appear to have damaged your lip, dear boy” the advisor points out softly, “I can provide a salve for that. I have also acquired some water and blankets for you. Hunk said they might be necessary.” </span>\n</p>\n<p> </p>\n<p>\n<span>Lance loves these guys. </span>\n</p>\n<p> </p>\n<p>\n<span>“Always looking out, huh buddy?” He looks up at Hunk, who looks worried, but still gives him a brilliant grin.</span>\n</p>\n<p> </p>\n<p>\n<span>“You know it,” the yellow paladin assures. </span>\n</p>\n<p> </p>\n<p>\n<span>There's a worried nudge at the back of his mind.</span>\n</p>\n<p> </p>\n<p>\n<span>“I'll be alright now girl,” he reassures Blue. When sentiments of doubt and confusion come back to him, he sighs. “I know you don't understand what just happened, but trust me when I say Hunk and Coran can help.”</span>\n</p>\n<p> </p>\n<p>\n<span>Blue settles just a bit at that. </span>\n</p>\n<p> </p>\n<p>\n<span>“Lance…” Hunk says softly.</span>\n</p>\n<p> </p>\n<p>\n<span>“I think I'll take those blankets and that water now, Coran,” the blue paladin interrupts. He's definitely calmer now, but nowhere near ready to talk about this god-awful day yet. Hunk understands though, and doesn't push. His friend instead helps lift him into a sitting position, taking the majority of his weight.</span>\n</p>\n<p> </p>\n<p>\n<span>Coran gives him a knowing look, and Lance is afraid for a moment that the Altean will insist on having a conversation now. But the advisor says nothing, and simply hands over a water pouch. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance's hands are still a bit shaky as he takes the pouch, but no one comments on it. He takes slow sips, mindful that his stomach probably can't take more. And his lip hurts.</span>\n</p>\n<p> </p>\n<p>\n<span>Hunk wraps him up in a thick blanket made of a spectacular Altean fabric that's both warmer and softer than anything Lance has felt before. This particular one happens to be his favorite blanket on the ship.</span>\n</p>\n<p> </p>\n<p>\n<span>Coran’s attention to detail still manages to surprise him somehow.</span>\n</p>\n<p> </p>\n<p>\n<span>“Can I get anything else for you, dear boy?” The advisor questions.</span>\n</p>\n<p> </p>\n<p>\n<span>“That salve would be nice,” Lance responds with a wince. Every word he says tugs on his lip. </span>\n</p>\n<p> </p>\n<p>\n<span>“At once,” Coran shares a look with Hunk over Lance's shoulder, and the blue paladin smiles yet again. They are so unsubtle. </span>\n</p>\n<p> </p>\n<p>\n<span>The Altean speeds off, and Blue's cockpit is silent for a moment. Lance focuses on Hunk's steady breathing, from what he can hear and feel with his back pressed up against his friend's side. </span>\n</p>\n<p> </p>\n<p>\n<span>“Whenever you're ready bud.”</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Dammit</span>\n</em>\n<span>. Hunk knows that Lance is weak to words like that. </span>\n</p>\n<p> </p>\n<p>\n<span>“I…” the blue paladin doesn't even know where to begin. “Today has sucked, Hunk.” That seems like a good enough start.</span>\n</p>\n<p> </p>\n<p>\n<span>Hunk makes a sympathetic noise, “I bet.”</span>\n</p>\n<p> </p>\n<p>\n<span>“It's just- the universe is out to get me today or something?” It's an absurd statement, but it really feels like some cosmic powers are doing their best to screw him over today. “I mean, I just. I don't know what's going on? But I know that I </span>\n<em>\n<span>hate </span>\n</em>\n<span>it.”</span>\n</p>\n<p> </p>\n<p>\n<span>Lance has always been fairly in touch with his own emotions, even if he's not always honest about how he presents them, so once he's going, he keeps going.</span>\n</p>\n<p> </p>\n<p>\n<span>“I hate it. I hate it so much, Hunk. I don't want to feel like this!”</span>\n</p>\n<p> </p>\n<p>\n<span>“Like what?” Hunk prompts quietly.</span>\n</p>\n<p> </p>\n<p>\n<span>“Like I'm being </span>\n<em>\n<span>attacked</span>\n</em>\n<span>,” Lance states, “all the time. For doing nothing but being me and trying to help. I already feel bad about myself more often than not, why does everyone have to make it worse on the </span>\n<em>\n<span>one day </span>\n</em>\n<span>I can't take it!?”</span>\n</p>\n<p> </p>\n<p>\n<span>“I annoy people,” he continues, voice vehement and gaining volume with his rising frustration. “I get that! I do it purpose half the time, so it'd be dumb of me to not expect someone to snap! If I'd been super obnoxious this week, then maybe today wouldn't have sucked as much, because I would have been ready!”</span>\n</p>\n<p> </p>\n<p>\n<span>It's not like the hazy mix of rage and sadness and so many other emotions that caused him to break down. No. This is cathartic, Lance feels. He needs to talk about this. Someone needs to hear him. Dios bless Hunk.</span>\n</p>\n<p> </p>\n<p>\n<span>“But I haven't been annoying anyone at all this past week!”</span>\n</p>\n<p> </p>\n<p>\n<span>“Because it's been a bad week,” his best friend surmises. Hunk knows. Hunk has been with him this past week.</span>\n</p>\n<p> </p>\n<p>\n<span>Lance is a sensitive boy, he's always been. He trusts to easily, takes things to heart, and sometimes he just needs a </span>\n<em>\n<span>break</span>\n</em>\n<span>. Lance knows his fellow paladins, and he knows himself. So when he'd gotten choked up and sad over some nasty comment Keith had made at dinner (it had been Lance's fault though, he'd antagonized the red paladin), he'd immediately pulled back the next day. He'd kept to himself and only talked at length with Hunk, giving the others only greetings and a stray comment here and there.</span>\n</p>\n<p> </p>\n<p>\n<span>But that one day hadn't been enough. Lance was still too tightly wound, too emotional. And so he'd taken another day. And then another. And then a full week had passed by with both him and Hunk trying and failing to find a solution for his steadily declining mood. Lance knew why he was in the dumps. Their diplomatic missions had been non-stop lately, and somehow something always went awry and made them more stressful than they already were. And it didn't help that Allura was being an absolute slave driver with the training.</span>\n</p>\n<p> </p>\n<p>\n<span>Everyone was handling the added stress in their own ways. Hunk was trying out random recipes daily. Pidge was devoting even more time than usual to the search for her family. Keith was training constantly, between Allura, the Blade and flying with Red. And Shiro was spending more and more time with Black (Lance is still kind of worried about this, Shiro seems to have been showing some signs of dependency there). </span>\n</p>\n<p> </p>\n<p>\n<span>Lance had knew he needed more time by the end of yesterday, but he also knew he couldn't stay away for too long. Hunk was doing fine, as having regular conversations with Lance was enough to keep the yellow paladin's spirits up. But Lance knew that Pidge had gotten a grand total of maybe twenty-two hours of sleep over the past seven days, and that Keith was losing his mind over the diplomacy missions. Hunk wasn't as good at pushing Pidge to sleep or eat, and the yellow paladin quite frankly just didn't like talking to a irritable Keith. And Shiro was generally not around for six to twelve hours a day because he was with Black. </span>\n</p>\n<p> </p>\n<p>\n<span>He'd needed more time, but the team needed him </span>\n<em>\n<span>more</span>\n</em>\n<span>.</span>\n</p>\n<p> </p>\n<p>\n<span>So Lance’s plan was to do the usual rounds. He joined everyone at breakfast, and let them do their own things for a while in order to give himself time, and then went to Pidge a few hours past castle midday time. </span>\n</p>\n<p> </p>\n<p>\n<span>And. Well.</span>\n</p>\n<p> </p>\n<p>\n<span>“It's been a bad week,” Lance grits out, “but I've done my best. I've tried </span>\n<em>\n<span>so hard</span>\n</em>\n<span>.”</span>\n</p>\n<p> </p>\n<p>\n<span>And look what that got him.</span>\n</p>\n<p> </p>\n<p>\n<span>“I didn't deserve that,” Lance is referring to the entire day, but Shiro and Allura have him particularly disturbed. </span>\n</p>\n<p> </p>\n<p>\n<span>“You didn't,” Hunk says firmly, “Allura was awful for that.”</span>\n</p>\n<p> </p>\n<p>\n<span>The protective tone in Hunk's voice makes Lance smile a bit. The best bro.</span>\n</p>\n<p> </p>\n<p>\n<span>“Yeah,” what does it say about his day that he's not even the slightest bit inclined to come to the Princess’ defense? Lance can normally justify any decision Allura makes, rational or not, to himself. Not tonight. He knows in his head that the problem was that she didn't have enough information, but that doesn't justify it. </span>\n</p>\n<p> </p>\n<p>\n<span>“And you didn't deserve what Pidge and Keith said to you,” Hunk's voice is cautious, “you know that. Right?”</span>\n</p>\n<p> </p>\n<p>\n<span>“Yeah,” Lance sighs. If there's one good thing about today, it's that he didn't go too terribly off the deep end. “I know that.”</span>\n</p>\n<p> </p>\n<p>\n<span>“And I'm not sure what happened between you and Shiro,” the yellow paladin murmurs, scooching a bit more into Lance's space, “but I know you didn't deserve that either.”</span>\n</p>\n<p> </p>\n<p>\n<span>Thinking specifically of Shiro gets Lance's blood boiling just that quick. “Damn straight I didn't,” he grumbles, “it was a misunderstanding, I think. But he was a complete and utter dick to me.”</span>\n</p>\n<p> </p>\n<p>\n<span>He knows that somehow Shiro managed to only get half of the story about what happened with Keith and Pidge. But the black paladin had barged in with his mind already set on Lance being the bad guy, and if Lance is being honest, that's the worst offence of the day to him. The blue paladin is under no illusion that Allura sees him as anything more than the pilot of the Blue Lion, and that's ok (it's not). But Shiro has actively claimed to view Lance as a friend. He should know Lance better than that. </span>\n</p>\n<p> </p>\n<p>\n<span>(Lance is seriously worried about the effect spending hours on the Astral Plane is having on their leader.)</span>\n</p>\n<p> </p>\n<p>\n<span>“I gather we may need to save the Black Paladin for last?” Coran strides back into Blue's cockpit, hands clutching a jar. His voice is soft, but determined. Lance gets it, he wants to start fixing things tonight.</span>\n</p>\n<p> </p>\n<p>\n<span>Hunk remains silent, and the blue paladin knows that his best friend is leaving the decision up to him.</span>\n</p>\n<p> </p>\n<p>\n<span>“...Yeah,” Lance nods. Pidge and Keith pissed him off, but he's at least in a headspace where he can have a conversation with them. He needs to work himself up to speaking to Shiro. </span>\n</p>\n<p> </p>\n<p>\n<span>“Coran…” he looks up at the advisor. He doesn't know if he wants to have a conversation with Allura tonight. </span>\n</p>\n<p> </p>\n<p>\n<span>“I will not fault you for not wanting to speak with the Princess,” somehow the advisor always knows. “And I will not attempt to apologize on her behalf. Her actions towards you tonight were her own, and I will respect you both in letting you handle that yourselves. Whenever you're ready.” </span>\n</p>\n<p> </p>\n<p>\n<span>“I do think it's worth it to speak to your fellow paladins though,” Coran continues calmly, “on your own time, of course.”</span>\n</p>\n<p> </p>\n<p>\n<span>Lance nods. He's glad Coran is here. He never knows how much he misses having an adult in his corner until the advisor pops up out of nowhere when Lance needs it. And he knows what's not being said. Hunk will be content if Lance wants to avoid the other paladins for another whole week, but Coran understands that it's impossible. They're defenders of the universe, and their ability to do that job </span>\n<em>\n<span>literally </span>\n</em>\n<span>relies on them being on speaking terms at the very least. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance accepts the jar from Coran's hands. His own are much more steady now.</span>\n</p>\n<p> </p>\n<p>\n<span>The advisor will never push Lance into talking to the others, but won't let Lance forget that he's going to need to eventually either. The blue paladin appreciates that.</span>\n</p>\n<p> </p>\n<p>\n<span>The salve is cool as Lance dabs some over the broken skin on his lower lip. It has the vague taste of some sort of berry, go figure that Altean medicine tastes better than the food. The wound begins to close immediately, which is awesome, but Lance can tell that the scar will remain. </span>\n</p>\n<p> </p>\n<p>\n<span>“Can I do anything else for you, dear boy?” </span>\n</p>\n<p> </p>\n<p>\n<span>The Altean’s voice is so caring, so nice, so ridiculously paternal, that Lance doesn't even think before capping the jar, setting it aside, and extending his arms.</span>\n</p>\n<p> </p>\n<p>\n<span>Coran smiles and moves forward without hesitation, wrapping Lance up in a big hug. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance grins and hugs the Altean back tightly.</span>\n</p>\n<p> </p>\n<p>\n<span>“Dawww,” Hunk coos, wrapping arms around both of them and bringing them in close. “A bonding moment!”</span>\n</p>\n<p> </p>\n<p>\n<span>Lance chuckles. Sentiments of warmth and affection push their way through his head.</span>\n</p>\n<p> </p>\n<p>\n<span>“Blue is joining the bonding moment too guys,” he says quietly.</span>\n</p>\n<p> </p>\n<p>\n<span>“No doubt expressing her love for her wonderful paladin,” Coran says with the utmost confidence. Lance flushes, opens his mouth to brush the compliment off-</span>\n</p>\n<p> </p>\n<p>\n<span>“Blue has awesome taste,” Hunk cuts in, “she couldn't have picked a better pilot.”</span>\n</p>\n<p> </p>\n<p>\n<span>Blue rumbles in affirmation.</span>\n</p>\n<p> </p>\n<p>\n<span>“Guys,” Lance is done crying for tonight. He </span>\n<em>\n<span>swears</span>\n</em>\n<span>. His eyes are hot because he's hot. </span>\n</p>\n<p> </p>\n<p>\n<span>“I know the other paladins think so as well,” Coran states, “for how could they not? You're my favorite for a reason.” How can he say that so unabashedly!?</span>\n</p>\n<p> </p>\n<p>\n<span>“He's my favorite too,” Hunk murmurs, resting his chin on Lance's head, “best bro a bro could wish for.”</span>\n</p>\n<p> </p>\n<p>\n<span>Ok. Lance is </span>\n<em>\n<span>not </span>\n</em>\n<span>done crying for the night.</span>\n</p>\n<p> </p>\n<p>\n<span>….</span>\n</p>\n<p> </p>\n<p>\n<span>Keith is angry.</span>\n<span></span>\n<br>\n<br>\n</p>\n<p>\n<span>There's no other word for it. He's angry. He's pissed actually. But for two reasons only.</span>\n</p>\n<p> </p>\n<p>\n<span>He's positively </span>\n<em>\n<span>infuriated </span>\n</em>\n<span>about how today has gone for Lance. He's always been protective, and just knowing that they've all (except for Hunk and Coran) somehow managed to make this literally the worst day ever for the blue paladin, it's enough to make him want to hit everything. Including himself.</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Especially </span>\n</em>\n<span>himself. Keith has no words for how much he regrets what happened in the hallway earlier today. He'd always resented bullies growing in the foster care system, and had carried on that dislike to the Garrison.</span>\n</p>\n<p> </p>\n<p>\n<span>(</span>\n<em>\n<span>In fact, one of the reasons he could barely stand to be around Lance in the beginning was because he had thought of the taller boy as a bit of a bully. An offhand comment from Hunk had been all it took to correct that idea though.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“Lance treats you like Arturio actually,” the yellow paladin had stated plainly.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“Like who?” Keith had wondered.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“His older brother,” Hunk continued, completely nonchalant as if he wasn't presently make Keith reevaluate everything he knew about Lance. “You don't really act like him, but Lance seems to hold you in the same regard.”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“He doesn't like his older brother?” Keith was confused.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“Are you kidding me?” Hunk responded absently, focus completely on whatever weird food thing he'd found. “Lance adores Arturio, but they're super competitive with each other.”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Oh.</span>\n</em>\n<span>) </span>\n</p>\n<p> </p>\n<p>\n<span>But somehow, that's what he became today. A bully. He didn't want to attack Lance or hurt his feelings, but Keith knows now that it doesn't matter. He'd seen it with his own eyes. Anyone with half a brain could tell that Lance very much did not want to be bothered, and yet the red paladin had pushed anyway. Just like a bully.</span>\n</p>\n<p> </p>\n<p>\n<span>Knowing exactly how Pidge and Shiro contributed hasn't exactly helped either, Keith realizes. It's been about an hour and a half since they talked to Hunk, and just shy of a half an hour since the three of them had sat down with Allura and fully explained the situation. Keith knew that Pidge had said something mean, but he now realizes that he could have done without knowing what the exact words were. But he's mostly annoyed that she had to go and tell their leader about what happened in the actual worst way possible.</span>\n</p>\n<p> </p>\n<p>\n<span>And Shiro. It's no secret that Keith is much more dependant on his old friend than he should be (the topic of a very heated argument between him and Lance when Shiro was gone, actually). He appreciates Shiro's support whenever the man is willing to give it, and has always wanted to be there for him like he was for Keith. He cares for Shiro more than anyone, and he's unashamed to say that, but he really wishes that their leader would have chosen to not support Keith this time around. </span>\n</p>\n<p> </p>\n<p>\n<span>Knowing that Shiro had gone to an already upset Lance and treated him like the villain on Keith's behalf (and Pidge's to some extent) is something that bothers the red paladin immensely. One part of him wants to be glad because it reaffirms that Shiro always has his back like Keith has his. But that part is drowned out by the one that is actually quite angry at his friend for making such hasty conclusions. That's something he'll have to leave to them though. He knows that Shiro feels terrible about it and will do whatever he can to make it up to the Blue paladin.</span>\n</p>\n<p> </p>\n<p>\n<span>And then Allura. What a </span>\n<em>\n<span>clusterfuck </span>\n</em>\n<span>that was. Keith gets where the Princess was coming from. He really does, on any given day, he would have probably agreed with her. But not today. Today, it shouldn't have mattered that the universe wouldn't wait for them to be ok, they would have caught up with it eventually. They always do. Trying to explain to Allura that Lance had nothing to do with the arguments he'd gotten into today was a massive pain, Keith and Pidge had to leave it up to Shiro eventually. The Princess just couldn't fathom in her head that her paladins, whose bonds with their Lions and with each other appeared to be stronger than ever, could somehow gang up on Lance like that unless he'd been at least partially at fault. She seemed to follow it better when Shiro explained that the basis of it all were misunderstandings rampant. Allura was a diplomat, so she knew the value of having a complete understanding of a situation before proceeding, less she offend someone and something terrible comes out of it.</span>\n</p>\n<p> </p>\n<p>\n<span>And that's the second reason Keith is pissed. Misunderstandings. That. Stupid. Word.</span>\n</p>\n<p> </p>\n<p>\n<span>Everything that's happened today, every shouted word, hurt feelings, and shedded tears. It could have all been avoided if they just </span>\n<em>\n<span>understood Lance more</span>\n</em>\n<span>. </span>\n</p>\n<p> </p>\n<p>\n<span>Keith would have left him alone today if he knew how to recognize the signs of Lance being truly and utterly drained. He knew that something was wrong, that something was different, but he didn't know enough to justify stopping to himself in his anger.</span>\n</p>\n<p> </p>\n<p>\n<span>And the red paladin </span>\n<em>\n<span>hates </span>\n</em>\n<span>that. He hates that he's fought side by side with Lance for well over a year now, felt his cool determination and somehow focused excitement over the bond in Voltron, and he still somehow doesn't know his friend that well. Because if Keith is going to be truly honest about today, then he knows that all wanted to do was to spend some time with a friend. He was just being selfish though, not thinking that perhaps Lance hadn't kept up their usual dynamic for a reason, and he'd pushed too far.</span>\n</p>\n<p> </p>\n<p>\n<span>So yeah. Keith is pissed.</span>\n</p>\n<p> </p>\n<p>\n<span>But like, the productive kind of pissed?</span>\n</p>\n<p> </p>\n<p>\n<span>His anger isn't dark and malicious. He doesn't want an outlet for it. He wants to focus it on a task, use it to fuel himself where Keith has trouble letting other emotions in. And maybe that's not very healthy, but knowing that he feels no anger at all towards Lance right now helps. In fact, the blue paladin is probably the only person on this ship right now that Keith can talk to without worry that he'll explode and say something completely.</span>\n</p>\n<p> </p>\n<p>\n<span>And so he stands outside Lance's door, directed there by Coran not too long ago. And he knocks.</span>\n</p>\n<p> </p>\n<p>\n<span>…</span>\n</p>\n<p> </p>\n<p>\n<span>“Keith,” Lance acknowledges.</span>\n</p>\n<p> </p>\n<p>\n<span>It's Keith first. Lance really isn't surprised. Fastest in his Lion, fastest on foot. Once he has an idea in his head, the red paladin has to see it through. Of course he's the first one to approach Lance tonight. Even if he looks mildly terrified all of a sudden.</span>\n</p>\n<p> </p>\n<p>\n<span>The red paladin's face was the perfect picture of determination and steel when the door slid open but had changed drastically upon realizing that it was Lance himself who opened it (which is weird. This is Lance's room after all). Keith had literally looked the blue paladin up and down, taking in all his pajama and bathrobe glory, before settling on his face and promptly adopting a deer in the headlights look. If Lance wasn't still mildly pissed at him from earlier, the whole thing would be hilarious.</span>\n</p>\n<p> </p>\n<p>\n<span>But Lance is still angry. Still hurt. So he doesn't smile, grin or smirk. Doesn't invite Keith in. Doesn't give him anything other than his own name as an acknowledgement. He does cross his arms and lean on the frame though, raising an eyebrow. He's not going to make this easy, he can't. But he's not going to be a total dick about it either.</span>\n</p>\n<p> </p>\n<p>\n<span>“Why so starstruck?” Lance asks, “expecting Hunk?”</span>\n</p>\n<p> </p>\n<p>\n<span>It's a fair expectation all things considered. Hunk is generally the one to answer Lance's door for him when he's in a mood. </span>\n</p>\n<p> </p>\n<p>\n<span>“Uh…” Keith murmurs awkwardly. So. Yes.</span>\n</p>\n<p> </p>\n<p>\n<span>“He's in the kitchen making so special recipe for me,” Lance answers the unspoken question, “so he's not here. Just me.”</span>\n</p>\n<p> </p>\n<p>\n<span>He lets a bit of challenge bleed into his tone towards the end there, of only to get Keith focused again. And besides.</span>\n</p>\n<p> </p>\n<p>\n<span>“What?” He challenges, “can't say what you have to say without him?” </span>\n</p>\n<p> </p>\n<p>\n<span>And maybe he shouldn't be riling Keith up now. But Lance knows his boundaries. Knows that he can and will stop himself if it becomes unproductive.</span>\n</p>\n<p> </p>\n<p>\n<span>It works anyway. Keith loses that lost look and that admirable fire finally rises in his eyes again.</span>\n</p>\n<p> </p>\n<p>\n<span>“Can I come in?” The red paladin asks in favor of acknowledging Lance's words, apparently determined to see this through. That's good. Lance knows that Hunk is the go to person for all things Lance, but he needs for his team to approach him tonight without the yellow paladin's support. Hunk will worry enough about Lance on his own. He doesn't need the added stress of worrying on the behalf of others as well.</span>\n</p>\n<p> </p>\n<p>\n<span>Lance nods, stepping aside to let his teammate in.</span>\n</p>\n<p> </p>\n<p>\n<span>Keith walks in quickly, obviously focused on his reason for being here. He doesn't look around like Shiro and Pidge always do for some reason. Doesn't make himself comfortable like Hunk or Coran (Allura has never been in Lance's room). He doesn't even do that awkward fidget thing he'd done whenever he came to complain to Lance about Black the entire time Shiro was gone.</span>\n</p>\n<p> </p>\n<p>\n<span>He just stands in the middle of the room and stares directly at Lance. </span>\n</p>\n<p> </p>\n<p>\n<span>“You really don't half-ass anything do you?” Lance murmurs, amused despite himself.</span>\n</p>\n<p> </p>\n<p>\n<span>“Not the things I care about,” Keith replies honestly. </span>\n</p>\n<p> </p>\n<p>\n<span>(</span>\n<em>\n<span>This is very reminiscent of a similar interaction. Just as unpleasant but in a completely different way.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“You really don't half-ass anything do you?” Lance's tone had been hard and sarcastic then.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“Not the things I care about!” Keith had shouted back.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“So what you're saying is,” Lance had snapped, “that you care about Shiro, but can't even be bothered to talk to the rest of us!?”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“We don't have time to talk! We're falling apart without him here so we need to find him now-”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“No!” Lance had shouted, “</span>\n</em>\n<b>\n<em>You're</em>\n</b>\n<em>\n<span> falling apart without him here! Because you forgot how to live without him!”</span>\n</em>\n<span>)</span>\n</p>\n<p> </p>\n<p>\n<span>The circumstances are different now. Lance can't help but be a bit bitter.</span>\n</p>\n<p> </p>\n<p>\n<span>“You care about me, huh?” He scoffs, even though he knows that's not fair. Lance knows that Keith cares.</span>\n</p>\n<p> </p>\n<p>\n<span>“I do,” the red paladin insists with wide eyes. “You </span>\n<em>\n<span>know </span>\n</em>\n<span>that I do.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Then what was all that today Keith?” Lance questions tiredly.</span>\n</p>\n<p> </p>\n<p>\n<span>“I…” Keith says blankly, “I just.”</span>\n</p>\n<p> </p>\n<p>\n<span>Lance remains quiet. Keith can't just summon up words to express his feelings to the blue paladin on the fly. </span>\n</p>\n<p> </p>\n<p>\n<span>“I don't know?” Keith tries. Lance immediately bristles, and it must show on his face because Keith stops him from saying anything. “I mean I do know! I know what happened. I swear.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Really?” Lance asks, tone cold. Because there's no point in continuing this conversation if Keith doesn't even know what he did wrong.</span>\n</p>\n<p> </p>\n<p>\n<span>“I pushed too hard!” Keith must be able to tell that Lance is quickly losing patience, because his words are rapid fire. He just goes for it. </span>\n</p>\n<p> </p>\n<p>\n<span>“I saw you in the hall, and then I said all the wrong things! I just. I didn't realize at the time that you were hurting already. I </span>\n<em>\n<span>swear </span>\n</em>\n<span>I didn't. But that's no excuse for pushing you anyway just because I was in a shit mood. You hadn't done anything to me. And I knew something was going wrong and I still pushed because I've somehow never taken the time to get to know you well enough to connect the dots and I just. I didn't </span>\n<em>\n<span>mean </span>\n</em>\n<span>to hurt you, Lance.”</span>\n</p>\n<p> </p>\n<p>\n<span>Keith's voice is shaky, his tone is sincere. Lance is floored. Keith isn't done.</span>\n</p>\n<p> </p>\n<p>\n<span>“I swear I didn't!” The red paladin reiterates. “It's just-I mean. I was angry and restless, and then you were there. And we haven't really talked for more than a few minutes this past week and I didn't understand why I hadn't seen you around. But you were there! And then you tried to walk away and I just. I went too far.”</span>\n</p>\n<p> </p>\n<p>\n<span>Lance's heart warms without his permission. And at once he just feels so fond. Keith is still talking.</span>\n</p>\n<p> </p>\n<p>\n<span>“I didn't mean to disrespect your family, that was shitty of me and-” but his words cut off and his posture stiffens as Lance brings him into a hug, “uh. What.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Dude,” Lance buries his face into the red paladin's hair, ignoring the scent of sweat. Of course he came directly here without showering. “There are much more reasonable ways of letting me know that you missed me.”</span>\n</p>\n<p> </p>\n<p><span>“</span><em><span>Missed</span></em> <em><span>you</span></em><span>?” Keith squawks, the sound muffled from where his face is pressed into Lance's collarbone. “You're crazy!”</span></p>\n<p> </p>\n<p>\n<span>Lance grins. He knows better. Keith has neither denied it nor has he made to pull away.</span>\n</p>\n<p> </p>\n<p>\n<span>“Whatever, mullet,” he sighs. At the word, Keith's entire posture relaxes, and the red paladin's arms wind around Lance's middle as he returns the hug finally. They stay like that for a minute or so.</span>\n</p>\n<p> </p>\n<p>\n<span>“I'm sorry,” Keith murmurs.</span>\n</p>\n<p> </p>\n<p>\n<span>“We'll have to talk,” Lance responds, “we'll talk about boundaries and whatnot. But I forgive you.”</span>\n</p>\n<p> </p>\n<p>\n<span>“You shouldn't,” the red paladin responds, “don't deserve it.”</span>\n</p>\n<p> </p>\n<p>\n<span>And maybe he doesn't. Lance isn't too sure right now. But he knows that Keith is going to work to keep this from ever happening again. He trusts that. Doesn't really need to know anything else.</span>\n</p>\n<p> </p>\n<p>\n<span>“I say you do,” Lance retorts with a grin. Not that Keith can see it. “We're Voltron’s power duo. We've got this.”</span>\n</p>\n<p> </p>\n<p>\n<span>Keith doesn't verbally respond, but tightens his grip on Lance, shoulders shaking.</span>\n</p>\n<p> </p>\n<p>\n<span>“Mullet,” Lance asks incredulously, “are you crying?”</span>\n</p>\n<p> </p>\n<p>\n<span>“No,” Keith lies.</span>\n</p>\n<p> </p>\n<p>\n<span>Lance grins. They still have work to do. Lance needs to make sure Keith knows exactly how to tell when not to push. But he's really not surprised that the red paladin has managed to sucker his forgiveness out of him so fast.</span>\n</p>\n<p> </p>\n<p>\n<span>Keith doesn't half-ass anything, after all.</span>\n</p>\n<p> </p>\n<p>\n<span>…</span>\n</p>\n<p> </p>\n<p>\n<span>“Went well?” Hunk asks cautiously, watching as Keith walks into the kitchen.</span>\n</p>\n<p> </p>\n<p>\n<span>“A lot better than it probably should have,” Keith murmurs. But he has a small smile on his face, and his posture is so relieved.</span>\n</p>\n<p> </p>\n<p>\n<span>“Of course it did,” Pidge grumbles from where she is sprawled against the table. Watching absentmindedly as Hunk stirs the batter of what he hopes will turn out to be something like red velvet cake. Just. Purple red velvet cake.</span>\n</p>\n<p> </p>\n<p>\n<span>“Knowing my luck,” the green paladin continues on, “I'll probably end up owing him a dozen favors.”</span>\n</p>\n<p> </p>\n<p>\n<span>Keith shrugs. Hunk snorts.</span>\n</p>\n<p> </p>\n<p>\n<span>The yellow paladin doesn't bother to call Pidge out on the fact that she's just trying to joke away her anxiety. He knows she's still under the faulty impression that today is somehow all her fault, and he knows that only Lance is going to be able to assuage that. </span>\n</p>\n<p> </p>\n<p>\n<span>Pidge will need to see it for herself, but Hunk is almost positive that Lance is only mildly irritated with her. Nothing like how he was angry at Keith, or how he's infuriated with Shiro and doesn't want to talk to Allura. All it will take is a simple acknowledgement and an apology. He's sure of that, but Pidge seems to think that Lance is going to hack her up into pieces and feed her to Blue.</span>\n</p>\n<p> </p>\n<p>\n<span>(That may have something to do with how the Yellow Lion keeps telling him how irate Blue is at the moment. He's sure that all of the Lion's are getting the message.)</span>\n</p>\n<p> </p>\n<p>\n<span>“Only one way to find out,” Hunk says airily. “You can't keep putting it off.”</span>\n</p>\n<p> </p>\n<p>\n<span>Because that's what Pidge is doing, she's afraid of Lance's reaction, which is why she didn't protest when Keith had insisted on going first. Hunk knows that she actually has the least to worry about, despite her insistence that today is all her fault. </span>\n</p>\n<p> </p>\n<p>\n<span>From a purely logical perspective, Hunk can see why she's worried. It started with a comment from her to Lance, which worsened his mood. It continued because of the worsened mood, and then Pidge talked to Shiro and then she reacted awkwardly during training.</span>\n</p>\n<p> </p>\n<p>\n<span>But this isn't a logical situation with a purely logical person. Lance is perfectly capable of logic and reason when he feels it necessary, but he's in general a primarily emotional person. And his emotions towards Pidge are that of an older brother to a little sister. Lance will not stay upset with her.</span>\n</p>\n<p> </p>\n<p>\n<span>All she needs to do is go to him.</span>\n</p>\n<p> </p>\n<p>\n<span>“Maybe Shiro should go before me,” Pidge tries, looking around as if she doesn't know that the black paladin is with Allura and Coran talking about possible alterations in their schedule for tomorrow. </span>\n</p>\n<p> </p>\n<p>\n<span>“Yeah. </span>\n<em>\n<span>No</span>\n</em>\n<span>” Hunk states firmly, fixing Pidge with a look. “There's a 100% chance you will catch Lance in an even </span>\n<em>\n<span>worse </span>\n</em>\n<span>mood if you try to wait for Shiro. You should forget about that plan.”</span>\n</p>\n<p> </p>\n<p>\n<span>Pidge groans. “Fine,” she lifts herself off the table and starts shuffling towards the door, “but if this goes south, I'm locking you out of your room Hunk.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Yeah, yeah,” Hunk waves her off. It won't go south. Even if it does, Hunk knows the exact schematics for their room doors. There is no locking him out. All he needs is something pointy. </span>\n</p>\n<p> </p>\n<p>\n<span>“Ugh!” Pidge groans as she leaves the room. There's a pause.</span>\n</p>\n<p> </p>\n<p>\n<span>“Is Lance really that upset with Shiro?” Keith questions quietly, coming up to watch Hunk stir.</span>\n</p>\n<p> </p>\n<p>\n<span>Hunk thinks back to Blue's cockpit.</span>\n</p>\n<p> </p>\n<p>\n<span>“He's pretty disturbed about that whole situation,” he answers honestly, wondering how Keith will respond.</span>\n</p>\n<p> </p>\n<p>\n<span>“...he has a right to be.” The red paladin says simply. Keith was with Pidge, Allura and Shiro during their talking session, so he must know exactly what happened.</span>\n</p>\n<p> </p>\n<p>\n<span>“Can Shiro fix it?” Hunk asks.</span>\n</p>\n<p> </p>\n<p>\n<span>“I think so,” Keith nods, “might take some work though.”</span>\n</p>\n<p> </p>\n<p>\n<span>“...Good.”</span>\n</p>\n<p> </p>\n<p>\n<span>....</span>\n</p>\n<p> </p>\n<p>\n<span>Pidge doesn't do emotions.</span>\n</p>\n<p> </p>\n<p>\n<span>People are complicated in a way she doesn't really care to understand, which is why she turns to technology most of the time. Everything that happens within a computer or a machine happens for a reason that she can make sense of if she tries hard enough.</span>\n</p>\n<p> </p>\n<p>\n<span>Try as hard as she might though, Pidge cannot pick apart emotions. Which is often why she's careless in how she treats others.</span>\n</p>\n<p> </p>\n<p>\n<span>Everything that's happened today had happened because Pidge doesn't understand people like she understands technology. She started it all when she upset Lance. And then she somehow managed to throw him under the bus with Shiro just because she couldn't close her big mouth and was incapable of articulating the whole story while under the influence of Hunk's druggy food. And then she contributed to making that training session go as bad as humanly possible. But Lance caught flak for that too.</span>\n</p>\n<p> </p>\n<p>\n<span>Pidge sighs as she stands in front of Lance's door. Today has been all her fault. She'd started it all, and now she somehow has to fix it. Logically, she knows what she could say to explain away the situations, but all of her words would make her sound like a bitch.</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“Sorry I hurt your feelings earlier Lance, I don't know you well enough to know what's going to far and when. I also don't appreciate what you do for me, like at all.”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“Sorry I made it sound like you were the issue all day today. I was delusional and only told Shiro my side of the stories.”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“Sorry I couldn't even work with you during the training sequences tonight. I felt bad but I didn't know what else to do but avoid being near you.”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“Sorry I suck as a teammate and a friend. I should know you better than this. But I don't.”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>...Pidge doesn't know how to tackle this problem. There's no logical explanation that sounds good in her head, but she knows she needs to explain herself somehow. Lance deserves it.</span>\n</p>\n<p> </p>\n<p>\n<span>But emotions are a fickle thing. She barely understands Lance's, and she doesn't even really get her own.</span>\n</p>\n<p> </p>\n<p>\n<span>Which is extremely evident when Lance unexpectedly opens his doors. Pidge takes one look at his surprised face and bursts into tears.</span>\n</p>\n<p> </p>\n<p>\n<span>“I'm so sorry!” She cries, throwing herself at him. Lance catches her with an </span>\n<em>\n<span>‘oomph’</span>\n</em>\n<span>. </span>\n</p>\n<p> </p>\n<p>\n<span>“Pidge?” He sounds worried. How can he still worry about her!?</span>\n</p>\n<p> </p>\n<p>\n<span>“This is all my fault!” She wails, pushing her face into his stupidly soft shirt. “I was so mean to you! And you didn't deserve it!”</span>\n</p>\n<p> </p>\n<p>\n<span>“Pidge…” </span>\n</p>\n<p> </p>\n<p>\n<span>“And then I went and made things worse by telling Shiro that you yelled at me and made Keith cry!” She talks over him, “I was all loopy off of Hunk's cinnamon soup and I just didn't tell him how it all started and that's why he came to you and was an ass!” </span>\n</p>\n<p> </p>\n<p>\n<span>“Oh,” Lance murmurs, “that answers that question.”</span>\n</p>\n<p> </p>\n<p>\n<span>His voice seems annoyed to her. Pidge cries harder.</span>\n</p>\n<p> </p>\n<p>\n<span>“I'm sorry!” She insists. Because above anything else, he needs to know this. “I'm so </span>\n<em>\n<span>so </span>\n</em>\n<span>sorry! About earlier and about Shiro and about Allura and that I don't pay enough attention to you and all that you do for me!”</span>\n</p>\n<p> </p>\n<p>\n<span>“Pidge,” Lance says quietly.</span>\n</p>\n<p> </p>\n<p>\n<span>“And I'm sorry you had to get stuck with an ungrateful brat like me as opposed to your actual family,” Pidge sobs.</span>\n</p>\n<p> </p>\n<p>\n<span>“Pidge!” Lance scolds, gripping her shoulders and moving her back so he can look at her face. He doesn't look mad. </span>\n<em>\n<span>Why doesn't he look mad?</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>“Why aren't you mad!?” Pidge doesn't understand this, “you should be yelling at me right now!”</span>\n</p>\n<p> </p>\n<p>\n<span>“You're doing a well enough job of that yourself,” he responds wryly. “Don't talk about yourself like that Pidge,” Lance says firmly, “you are not an ungrateful brat and I don't feel like I got ‘stuck’ with you.” </span>\n</p>\n<p> </p>\n<p>\n<span>“But you should!” Pidge insists. Lance doesn't make sense to her. “Because you did! What type of family treats each other like I've treated you!?”</span>\n</p>\n<p> </p>\n<p>\n<span>“When I was fourteen,” Lance says out of nowhere, “my little sisters upset me so bad that I ended up in the mental ward for the night.”</span>\n</p>\n<p> </p>\n<p>\n<span>Pidge freezes, horrified. Lance </span>\n<em>\n<span>cannot </span>\n</em>\n<span>be serious about that. But she knows that he is. He wouldn't make something like that up.</span>\n</p>\n<p> </p>\n<p>\n<span>“It was the first time it had happened,” the blue paladin murmurs, “ and my older siblings made me swear that I would start standing up for myself more.”</span>\n</p>\n<p> </p>\n<p>\n<span>Pidge has never known this about Lance. It's hard to think about it. All this time she's pictured him as having the perfect family that always got along with him. That's why he doesn't take things seriously, that's why he's always joking.</span>\n</p>\n<p> </p>\n<p>\n<span>But she's wrong about that, isn't she?</span>\n</p>\n<p> </p>\n<p>\n<span>Pidge stares up at her friend. Lance does take things seriously. He takes them very seriously. Him always joking is actually a byproduct of just how much he cares about them and what they're doing. </span>\n</p>\n<p> </p>\n<p>\n<span>And they've been </span>\n<em>\n<span>awful </span>\n</em>\n<span>to him today.</span>\n</p>\n<p> </p>\n<p>\n<span>“I'm so sorry Lance,” she whimpers. </span>\n</p>\n<p> </p>\n<p>\n<span>“I forgave my sisters,” he says with a small smile, “just like I'm forgiving you.”</span>\n</p>\n<p> </p>\n<p>\n<span>“But why?” How is he like this? How did she come to apologize only to end up being comforted by him?</span>\n</p>\n<p> </p>\n<p>\n<span>“Because they're my family, and I love them,” Lance says as if it's the most simple concept in the universe. Maybe it is. Maybe Pidge is thinking too much about it. “I didn't get stuck with you guys,” he insists, “I just got another family. Which means I love you guys too. And I understand that sometimes we'll hurt each other, but as long as we care for one another, we can move on from it.”</span>\n</p>\n<p> </p>\n<p>\n<span>Pidge sobs, hiding her face against his chest again.</span>\n</p>\n<p> </p>\n<p>\n<span>“It's ok Katie,” Lance murmurs, rubbing her back. “I forgive you.”</span>\n</p>\n<p> </p>\n<p>\n<span>Pidge is not religious, but she finds that she'll pray to anything that will listen that they can get Lance home to his family. They're missing someone spectacular.</span>\n</p>\n<p> </p>\n<p>\n<span>Truly one of the best older brothers anyone could ask for.</span>\n</p>\n<p>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n</p>\n<p>\n<span>There's something to the whole talking thing, Lance decides as he mixes his face mask. </span>\n</p>\n<p> </p>\n<p>\n<span>Talking to Keith and Pidge had brought him a relief he wasn't even aware that he needed. Knowing that they both understand what went wrong today and are genuinely sorry for it has settled him somewhat. </span>\n</p>\n<p> </p>\n<p>\n<span>His hands don't shake as he fashions the weird Altean creams into what passes for a suitable mud mask. He hasn't been using it as often as should, caught up in the hustle the past month or so, and it's probably contributed to his being down in the dumps slightly.</span>\n</p>\n<p> </p>\n<p>\n<span>Lance loves to take care of himself. But it's not because he's conceited or self-obsessed (though being able to honestly say he has the best skin of everyone in the castle is pretty cool), but rather because it's something he always used to do with Lisandra. </span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“It's not about ego, Alejandro. It's about feeling good and healthy and strong. The walls aren't very thick, gatito, we hear you crying sometimes at night. You said this makes you feel better, so this is what we'll do.”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Lance smile softly as he completes the mix. He's still wound pretty tightly, because if the trend stays the same, he's almost positive that he'll end up having to talk to their leader tonight. He's still not sure he's ready to hear Shiro out though. </span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“Or was I wrong to think that I could rely on you?”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Lance's mouth twists, before he tries to shake the thoughts out of his head. The night has been looking up, and he wants to be able to smile genuinely at Hunk when he goes to try whatever midnight cake thing his best friend is attempting to make.</span>\n</p>\n<p> </p>\n<p>\n<span>It's been a little less than an hour since Pidge left, and it's not looking like the team is going to be sleeping anytime soon. Apparently Shiro, Allura and Coran are having talks or whatever. Hunk is determined make Lance a cake. Keith and Pidge are determined to help Lance eat said cake. He wonders what their schedule is going to look like tomorrow. Maybe it'll be a total break day, where they walk around in their pajamas and just relax.</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>It would be nice</span>\n</em>\n<span>, Lance thinks. But it's probably not plausible. They and the Blade no doubt have somewhere to go soon, and they can't afford to take a mental health day. Which also points towards the Black Paladin seeking him out tonight.</span>\n</p>\n<p> </p>\n<p>\n<span>No matter how much Lance tries to reason with himself. Tries to tell himself that Shiro only acted like that because he was afraid Lance was going around attacking the team unwarranted, the blue paladin can’t justify it in his head. Sure, Pidge’s words made it sound bad. But Lance would have hoped that the black paladin thought of him better than that. How could he think that Lance would do something like that? </span>\n</p>\n<p>\n<span>Lance shakes his head frantically. No. No thinking of this. Just thinking about it makes his breath go shorter and sends a slight tremble through his body. He hates it. Doesn’t like being so angry at his leader. But he’s just so, </span>\n<em>\n<span>so</span>\n</em>\n<span> hurt. </span>\n</p>\n<p>\n<span>  </span>\n</p>\n<p>\n<span>A knock at the door.</span>\n</p>\n<p> </p>\n<p>\n<span>Well then.</span>\n</p>\n<p> </p>\n<p>\n<span>Lance sighs, putting down his application brush and standing. Looks like it's happening sooner rather than later. He schools his face into a blank expression, and walks over to open the door.</span>\n</p>\n<p> </p>\n<p>\n<span>“Hello Lance.”</span>\n</p>\n<p> </p>\n<p>\n<span>It's Allura.</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Oh shit.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>The Princess stands before him, regal and composed even though he can see how tired she is as well. Her expression is very serious, very controlled. It's her diplomat face. She wants to talk. Lance doesn't </span>\n<em>\n<span>want </span>\n</em>\n<span>to talk to her.</span>\n</p>\n<p> </p>\n<p>\n<span>“Princess,” he acknowledges quietly. She inclines her head a bit, gaze moving past him into his room.</span>\n</p>\n<p> </p>\n<p>\n<span>“May I come in?”</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>No</span>\n</em>\n<span>.</span>\n</p>\n<p> </p>\n<p>\n<span>“Sure,” he murmurs, stepping aside. It's her castle after all. </span>\n</p>\n<p> </p>\n<p>\n<span>“Thank you,” she says amicably, walking in gracefully, hands folded before her politely. She has to move past him, he catches a whiff of some floral scent. </span>\n</p>\n<p> </p>\n<p>\n<span>All at once he remembers advancing on her on the training deck, vitriol and indignant rage spewing from his lips. Is she here to return the favor?</span>\n</p>\n<p> </p>\n<p>\n<span>“I must admit,” the Altean speaks conversationally. She's doing the look around thing that Shiro and Pidge do. “I expected that you would personalize your quarters more.”</span>\n</p>\n<p> </p>\n<p>\n<span>Expectations. Everyone has expectations of him. Why are almost none of them right?</span>\n</p>\n<p> </p>\n<p>\n<span>Lance doesn't know what to say to that. So he remains silent. He does not want to have this conversation.</span>\n</p>\n<p> </p>\n<p>\n<span>“May I sit?” Allura questions.</span>\n</p>\n<p> </p>\n<p>\n<span>“Sure,” he gestures to the bed. And she sits down calmly, as if this is the most normal thing in the world. Lance doesn't know what her angle is.</span>\n</p>\n<p> </p>\n<p>\n<span>He wants to apologize, for blowing up at her. But at the same time, he doesn't feel like he should </span>\n<em>\n<span>have </span>\n</em>\n<span>to apologize for blowing up at her. Why is she here? Is </span>\n<em>\n<span>she </span>\n</em>\n<span>going to apologize? Is she going to rip into him? Lance was an asshole back there, but she was one first. </span>\n</p>\n<p> </p>\n<p>\n<span>Allura and him are not friends. He admires her, feels for her plight, and wants to do anything in his power to help her. But they aren't close, they don't talk much outside of training and missions, and their conversations mainly consist of him flirting or trying to joke with her, and Allura rebuffing him. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance doesn't know how to have a conversation with the princess. He's not prepared for this.</span>\n</p>\n<p> </p>\n<p>\n<span>“I've come to apologize,” Allura states.</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>What</span>\n</em>\n<span>?</span>\n</p>\n<p> </p>\n<p>\n<span>“What?” He asks, eyes wide. </span>\n</p>\n<p> </p>\n<p>\n<span>“I've visited all of the paladins to offer my apologies,” Allura says, voice strong. “In particular, I felt that I've wronged Hunk and Shiro tonight, so I took quite a bit of time with them.”</span>\n</p>\n<p> </p>\n<p>\n<span>Lance sighs. Of course.</span>\n</p>\n<p> </p>\n<p>\n<span>“But I've certainly wronged you the most,” the princess says softly.</span>\n</p>\n<p> </p>\n<p>\n<span>What?</span>\n</p>\n<p> </p>\n<p>\n<span>“I…” Lance murmurs.</span>\n</p>\n<p> </p>\n<p>\n<span>“Please allow me to continue,” Allura requests, and the blue paladin shuts up. “It's come to my attention that many things occurred today that were unfair to you. I didn't mean to contribute , and for that I must apologize.”</span>\n</p>\n<p> </p>\n<p>\n<span>Lance stares. He really shouldn't be as surprised as he is. Allura is tough, but she isn't cruel, and has shown herself to be quite gracious. Of course she would want to make this right.</span>\n</p>\n<p> </p>\n<p>\n<span>“I want to ensure the success of Voltron,” Allura states quietly, “and to preserve the integrity of the universe. In my haste to expand our allies and bolster our chances, I have inadvertently neglected to treat you all with the respect you deserve.”</span>\n</p>\n<p> </p>\n<p>\n<span>She looks down at her folded hands.</span>\n</p>\n<p> </p>\n<p>\n<span>“You are soldiers, and you should always be ready. We should </span>\n<em>\n<span>always </span>\n</em>\n<span>strive for better,” she sighs, “but you are also young. You all have emotions and feelings that I do not always know how to deal with properly.”</span>\n</p>\n<p> </p>\n<p>\n<span>“But that's the thing Allura,” Lance murmurs. He has to stop her there. They're going to have a conversation then. So be it. “You talk about our emotions and feelings like they're an obstacle sometimes. Like they'll get in the way.”</span>\n</p>\n<p> </p>\n<p>\n<span>“If they aren’t geared towards our goals, then they have the potential to,” Allura states calmly, “even I have made unwise decisions based on emotion. This night included.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Yeah,” Lance nods, “emotions suck sometimes. But that doesn't mean we should view them as a hassle. Voltron relies on us being connected on a mental, spiritual and emotional level right?”</span>\n</p>\n<p> </p>\n<p>\n<span>Allura nods, regarding him with thoughtful eyes. “That's correct.”</span>\n</p>\n<p> </p>\n<p>\n<span>“So we shouldn't think of them as something to be dealt with,” Lance insists, “they're precious.” </span>\n</p>\n<p> </p>\n<p>\n<span>“When you put it that way,” Allura says softly, “you're very right, Lance. It seems as though I've somehow forgotten just how important they are. You were all doing so well, I had assumed that any other feelings unrelated to Voltron had to be set aside...I must admit, I am becoming privy to many other sides of you tonight.”</span>\n</p>\n<p> </p>\n<p>\n<span>Lance snorts derisively, “other than the troublemaker side, huh?”</span>\n</p>\n<p> </p>\n<p>\n<span>And </span>\n<em>\n<span>that's </span>\n</em>\n<span>why he didn't want to have this conversation. He doesn't want to hear what exactly Allura thinks of him. Because whatever it is, she made the decision to blame him for the team's issues tonight because of it. Lance is so </span>\n<em>\n<span>tired</span>\n</em>\n<span>. Hunk and Coran helped. Talking to Keith and Pidge helped. But nothing has replenished his energy just yet. He doesn't have it in him to hear how lowly Allura must think of him. He's not so sure he'll be able to defend himself again.</span>\n</p>\n<p> </p>\n<p>\n<span>“...I was very wrong for that,” Allura states. “I assumed quite wrongly, and my lack of understanding made an already tense situation very worse.” </span>\n</p>\n<p> </p>\n<p>\n<span>“You're not the only one today,” Lance grumbles.</span>\n</p>\n<p> </p>\n<p>\n<span>“I've been made aware of that as well,” Allura responds. “But I must ask,” she continues on, “why did you not express your feelings this week to your team? Surely it would have taken so of the confusion out of the situation?”</span>\n</p>\n<p> </p>\n<p>\n<span>Lance doesn't answer right away. It's a fair question. He could have told everyone else that he was in a mood and didn't want to bothered. It may have helped, but then again…</span>\n</p>\n<p> </p>\n<p>\n<span>“Why should I have to put in extra work to make sure others respect my feelings?” He asks quietly, “It's not like my feelings this week affected anyone but myself directly. I was training like usual. Doing missions like usual. Protecting the universe like usual. The only unusual thing was that I needed some extra time to myself. Why should I have to explain that to the others just so they won't treat me like crap?”</span>\n</p>\n<p> </p>\n<p>\n<span>His voice is quiet, but firm. Allura says nothing.</span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>Everything</span>\n</em>\n<span> that happened today wouldn't have been ok,” Lance states, “even if I was in a better mood. Lines would have been crossed anyway, and the only thing my mood changed was how I responded.”</span>\n</p>\n<p> </p>\n<p>\n<span>“I see,” Allura says quietly, face somber. “I...don't understand you, Lance.”</span>\n</p>\n<p> </p>\n<p>\n<span>He knows. But hearing it aloud stings. A lot.</span>\n</p>\n<p> </p>\n<p>\n<span>“You are very dear to me,” she goes on. That soothes the ache a little bit. “But I'm afraid that I don't always see much past your status as the Blue Paladin and what you present on the surface.”</span>\n</p>\n<p> </p>\n<p>\n<span>Lance looks down.</span>\n</p>\n<p> </p>\n<p>\n<span>“It's difficult,” she explains softly, “to look past your joking and careless attitude sometimes. I find myself forgetting that it's only one facet of your personality.”</span>\n</p>\n<p> </p>\n<p>\n<span>Lance sighs. “That's my fault,” he murmurs. Allura doesn't see him as anything but the Blue Paladin and a blustering idiot. But why would she? What else has he shown her? </span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>No</span>\n</em>\n<span>,” the princess says vehemently. Lance's head snaps up, and he stares wide eyed at her serious expression. He doesn't know where this is going anymore.</span>\n</p>\n<p> </p>\n<p>\n<span>“It's not entirely on you, Lance.” She says surely, “Much of the fault lies with me for not attempting to know you more. I may not see what you're like when you're not joking around, but I have recognized that your humor is an effort to reach out to me. An effort I have blatantly ignored more times than I can count.”</span>\n</p>\n<p> </p>\n<p>\n<span>Lance is floored. He honestly doesn't know what he expected from her, but this is not it.</span>\n</p>\n<p> </p>\n<p>\n<span>“It seemed easier that way,” Allura admits softly, “I don't understand your humor. Or what you seem to want from me. So I figured keeping you at a distance would be best. That all I knew about you was enough to properly guide you as a paladin. It's become increasingly clear to me that I was wrong in this assumption.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Princess…” Lance swallows, “I don't really know what to say right now.”</span>\n</p>\n<p> </p>\n<p>\n<span>A pause.</span>\n</p>\n<p> </p>\n<p>\n<span>“Tell me more about yourself,” Allura suggests after a moment. </span>\n</p>\n<p> </p>\n<p>\n<span>What.</span>\n</p>\n<p> </p>\n<p>\n<span>“Uh,” Lance flushes.</span>\n</p>\n<p> </p>\n<p>\n<span>“Is that too broad a request?” the princess questions thoughtfully, tapping a delicate finger to her temple. “How about this…” she murmurs, “tell me about you and Hunk.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Me…” he repeats, “and Hunk?”</span>\n</p>\n<p> </p>\n<p>\n<span>“Our yellow paladin holds you in quite a high regard, Lance,” Allura smiles slightly. “He looks up to you, cares for you, relies on you, and will step up to protect you.”</span>\n</p>\n<p> </p>\n<p>\n<span>Lance doesn't say anything. They both know she's referring to earlier. </span>\n</p>\n<p> </p>\n<p>\n<span>“He sees something in you that I haven't had the privilege of seeing quite yet,” she explains, “perhaps if I understand your relationship more, I can know where to look.”</span>\n</p>\n<p> </p>\n<p>\n<span>Lance smiles softly. Their Princess, ever the diplomat. He should expect no less.</span>\n</p>\n<p> </p>\n<p>\n<span>“Well he and I first met at the Garrison…” the blue paladin moves to sit beside the princess.</span>\n</p>\n<p> </p>\n<p>\n<span>Maybe she'll want to do face masks with him later.</span>\n</p>\n<p>\n<br>\n<br>\n</p>\n<p>\n<span>…</span>\n</p>\n<p> </p>\n<p>\n<span>She doesn't want to tonight. But she is open to the possibility in the future. Lance thinks that they may actually be able to come back from this.</span>\n</p>\n<p> </p>\n<p>\n<span>…</span>\n</p>\n<p> </p>\n<p>\n<span>Hunk is a genius. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance has always known this. But being reminded of it every once and again is always a great feeling. </span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>Bro</span>\n</em>\n<span>,” Lance says reverently, patting his best friend's back, “I can't believe you were able to make space red velvet cake!”</span>\n</p>\n<p> </p>\n<p>\n<span>“Oh believe it alright!” Hunk grin proudly, “I've been saving that one for just the right moment!”</span>\n</p>\n<p> </p>\n<p>\n<span>“And you couldn't have picked a better one!” Lance says it with a laugh. But the sentiment is real. Hunk is everything he needed and more today. He wonders how he would have managed without the guy. (He wouldn't have managed. Period.) </span>\n</p>\n<p> </p>\n<p>\n<span>“I've never seen Keith's eyes light up like that,” Hunk giggles.</span>\n</p>\n<p> </p>\n<p>\n<span>“Go figure the mullet would have the same favorite cake flavor as me,” Lance grumbles with no malice. Keith getting so happy after taking one bite is low-key one of the most adorable things Lance has ever seen. “Dude,” he says with wide eyes, “if Keith had cat ears, they totally would have done that perky happy thing!”</span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>Duuuude</span>\n</em>\n<span>!” Hunk stares back with eyes just as wide, “do you think Keith will grow cat ears one day? He'd totally hate them.”</span>\n</p>\n<p> </p>\n<p>\n<span>The image of a grumpy Keith Kogane with droopy cat ears is too much for Lance to take, and he immediately bursts in hysterical cackles.</span>\n</p>\n<p> </p>\n<p>\n<span>“He would go insane!” Lance shrieks, “but maybe Red would feel closer to him and finally stop locking him out all the time!”</span>\n</p>\n<p> </p>\n<p>\n<span>Hunk throws his head back in glee, letting out a full bodied laugh. </span>\n</p>\n<p> </p>\n<p>\n<span>“Or maybe she'd be even more jealous of the Blade of Mamora because he looks more like them!” The yellow paladin suggests happily, “So she'd lock him out even more!”</span>\n</p>\n<p> </p>\n<p>\n<span>They continue to laugh and talk as they walk through the halls back to their rooms. Lance figures that it's way past midnight castle time now, but Allura had assured him that there would be no training come morning, that they would spend the day preparing to wormhole to their next destination. They've all had a long and tough day, so he's certainly not going to complain about that. He doesn't feel shaky anymore. His body temperature seems stable. He doesn't have the urge to nibble on his scar. Things are starting to be ok.</span>\n</p>\n<p> </p>\n<p>\n<span>Hunk freezes as the turn the corner to get to Lance's room. The blue paladin was staring at his friend's hair, wondering when Hunk plans on letting him cut it again, so he doesn't see whatever his best friend sees at first. So he follows Hunk's wide-eyed and nervous gaze to the figure sitting against the wall across from Lance's room.</span>\n</p>\n<p> </p>\n<p>\n<span>Lance freezes. His hands start to shake again. Dammit.</span>\n</p>\n<p> </p>\n<p>\n<span>The person lifts their head from where it was buried in arms crossed over knees.</span>\n</p>\n<p> </p>\n<p>\n<span>“...Lance.”</span>\n</p>\n<p> </p>\n<p>\n<span>The blue paladin sighs heavily, shoulders drooping.</span>\n</p>\n<p> </p>\n<p>\n<span>“...Shiro.”</span>\n</p>\n<p>\n<br>\n<br>\n</p>\n<p>\n<span>This is ridiculous. </span>\n</p>\n<p> </p>\n<p>\n<span>Takashi Shirogane is one of the Garrison’s best and brightest. He’d been given supervisory duties at the ripe age of eighteen, and has been responsible for </span>\n<em>\n<span>someone </span>\n</em>\n<span>ever since. He went to Kerberos. Got captured by the Galra. Survived the coliseum. Got taken by the druids. Survived the druids experimentation. Became the Champion. Escaped with the help of Ulaz. Became the leader of Voltron. Lead Voltron. Defeated Zarkon. Became one with the Black Lion.</span>\n</p>\n<p> </p>\n<p>\n<span>Shiro shouldn’t be nervous or afraid of anything but himself by this point. But he is.</span>\n</p>\n<p> </p>\n<p>\n<span>“Er…” Hunk mumbles awkwardly, “Should I go?...Should I stay?”</span>\n</p>\n<p> </p>\n<p>\n<span>Lance sighs, “go ahead buddy,” he pats Hunk on the arm, “get some sleep. You’ve put in a lot of work today.”</span>\n</p>\n<p> </p>\n<p>\n<span>The yellow paladin hesitates, wringing his hands as he looks between the leader and the blue paladin with anxious eyes. Shiro almost hopes that Hunk chooses to stay, Lance’s posture is tense, but with an underlying security that he realizes he’s only ever seen when the two are together. Shiro is noticing a lot of things he should have already noticed tonight. </span>\n</p>\n<p> </p>\n<p>\n<span>But then Hunk pats Lance on the shoulder, and send Shiro a gaze that’s somehow sympathetic but serious all at the same time. </span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>‘I wish I could help you fix this</span>\n</em>\n<span>,’ his face says, ‘</span>\n<em>\n<span>but you need to do it yourself,</span>\n</em>\n<span>’ is what Shiro gathers from his eyes. </span>\n</p>\n<p> </p>\n<p>\n<span>Hunk is a true protector if there ever was one.</span>\n</p>\n<p> </p>\n<p>\n<span>“I guess I’ll see you guys later then?” Later. Not tomorrow. Because tomorrow is technically already here. </span>\n</p>\n<p> </p>\n<p>\n<span>Why does time feel like it’s been dragging on for so long? A large fraction of that time was spent with his lion, so Shiro really shouldn’t feel like the majority of his day has been awful. Somewhere within the bracket of him seeing Pidge in the hall, confronting Lance, that apocalyptic training session, trying to explain to Allura what happened, changing their itinerary for tomorrow with Coran and Allura, all the calm and peace he’d felt upon departing the astral plane and Black had faded away. </span>\n</p>\n<p> </p>\n<p>\n<span>Now he feels wound up, shaky, and terrible about himself. </span>\n</p>\n<p> </p>\n<p>\n<span>Shiro has </span>\n<em>\n<span>never </span>\n</em>\n<span>felt so badly about his own actions. If there’s one thing he’s always prided himself on, it was his decision making skills. He’s been holding onto that this entire time, with chunks of his memory gone and a grim haunting of his dreams at night, Shiro was always secure in the fact that he was capable of making well-informed and thoughtful decisions. Even in his bouts of terror and rage from a flashback, he could always come back from it when given a chance. Even when he was worn out and tired and just wanting to leave everything up to someone else for once, Shiro could find solace in the fact that he’d made the right decision in leaving control of Voltron to Keith. </span>\n</p>\n<p> </p>\n<p>\n<span>(No one really talks about the period in time where Shiro was gone, other than to commend Lance, Hunk and Coran for how they kept everything together. It’s also one of the blank spots in Black’s memories that she has not chosen to share with him, so Shiro doesn’t even feel as secure in </span>\n<em>\n<span>that </span>\n</em>\n<span>decision anymore.)</span>\n</p>\n<p> </p>\n<p>\n<span>He knows he isn’t the best leader (most don’t get crippled by PTSD at the absolute worst times), but Shiro’s always thought that he did more good than he did harm to his team. </span>\n</p>\n<p> </p>\n<p>\n<span>And then today happened.</span>\n</p>\n<p> </p>\n<p>\n<span>Hunk slinks away silently, and Shiro finds himself staring up at the blue paladin.</span>\n</p>\n<p> </p>\n<p>\n<span>Lance doesn’t look like he’s two steps from going off the deep end anymore, which is a relief. Seeing him go off on Allura like that was honestly a little scary. Shiro doesn’t like not recognizing people he can claim to know well. </span>\n</p>\n<p> </p>\n<p>\n<span>But then again, how well can he claim to know Lance? Not very much apparently. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance doesn’t even look as tense as he did when he opened the door for Shiro earlier. His face is significantly more calm. But it is not open. The blue paladin regards Shiro with a very guarded, almost mistrustful, expression. It </span>\n<em>\n<span>hurts</span>\n</em>\n<span>. </span>\n</p>\n<p> </p>\n<p>\n<span>“Lance,” he murmurs. He can’t bring himself to speak any louder than just above a whisper. “Can we talk?”</span>\n</p>\n<p> </p>\n<p>\n<span>There’s a pause.</span>\n</p>\n<p> </p>\n<p>\n<span>“Well. We have to,” Lance murmurs back, “don’t we?”</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>They have to</span>\n</em>\n<span>. No, that won’t do at all.</span>\n</p>\n<p> </p>\n<p>\n<span>“We </span>\n<em>\n<span>don’t</span>\n</em>\n<span>,” Shiro insists, “I’m not here to pressure you into having a conversation. You can send me away if you want.”</span>\n</p>\n<p> </p>\n<p>\n<span>Lance looks away.</span>\n</p>\n<p> </p>\n<p>\n<span>“I promise you,” Shiro says quietly, “I promise you, Lance. Say the word, and I’m gone. But…” he pauses to swallow hardly, “I’d really like the opportunity to speak with you tonight.”</span>\n</p>\n<p> </p>\n<p>\n<span>And that’s not a lie. Shiro is tired. He’s so very tired, and honestly just wants to lick his wounds for while. But everyone else has come to some form of reconciliation with the blue paladin tonight. He doesn’t want to be the only one on uncertain terms. He’d never get to sleep. Shiro is Lance’s leader.</span>\n</p>\n<p> </p>\n<p>\n<span>And he hopes and prays that he’s still Lance’s friend.</span>\n</p>\n<p> </p>\n<p>\n<span>“I’m…” Lance says softly, still not looking at Shiro. Why won’t Lance look at him? “I’m...I’m angry at you, Shiro.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Oh,” the black paladin knew this already. So why does hearing Lance say it make his chest hurt so much?</span>\n</p>\n<p> </p>\n<p>\n<span>“But more than that,” the hispanic boy finally looks back to him, “I...I don’t get it.”</span>\n</p>\n<p> </p>\n<p>\n<span>Shiro’s intake of breath is harsh and sharp. Lance’s blue eyes glisten with unshed tears under the hallway lights.</span>\n</p>\n<p> </p>\n<p>\n<span>“I don’t get it, Shiro,” Lance mutters, “I don’t understand what happened with us today.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Lance,” Shiro says quickly, “Lance. Please don’t cry.”</span>\n</p>\n<p> </p>\n<p>\n<span>“I don’t </span>\n<em>\n<span>want </span>\n</em>\n<span>to!” the blue paladin insists, voice shaky. He swipes an arm over his face roughly. “I don’t want to be angry at you! I don’t want to cry when I see you! You’re supposed to my leader. My hero! Someone I look up to! Someone I want to see just for the sake of watching you be you! And if not that,” Lance breathes deeply, “then you should be my friend! Someone who I can count on to at least talk to me and treat me with some level of decency!”</span>\n</p>\n<p> </p>\n<p>\n<span>The black paladin’s mouth goes dry. He knows that Lance has always held some degree of hero worship for him. It honestly grated on him more than it made him happy. Lance has always had this idea of Shiro that the he has never had of himself. And seeing the blue paladin use this idea of him as a basis for how to interact with him actually annoyed Shiro quite a bit at first. </span>\n</p>\n<p> </p>\n<p>\n<span>But then Lance got to know him. Lance made an effort to get to know his leader. And his efforts were not lost on Shiro. The elder had noticed how Lance would talk to him more casually, approach him more easily, not expect that much out of him, see things about him that most people tended to skim over. He quickly began to take Shiro the person seriously, and not just Shiro of the Kerberos Mission. Shiro had appreciated it more than he showed.</span>\n</p>\n<p> </p>\n<p>\n<span>And he’d thought that he himself had made the same effort. But he didn’t. </span>\n</p>\n<p> </p>\n<p>\n<span>Even sitting here now, Shiro realizes just how </span>\n<em>\n<span>little </span>\n</em>\n<span>he knows about the blue paladin. And he’s ashamed of himself for it. Just as much as he’s ashamed of the fact that he’s ruined Lance’s perception of him. </span>\n</p>\n<p> </p>\n<p>\n<span>“Lance,” Shiro begs, “please talk to me. </span>\n<em>\n<span>Please </span>\n</em>\n<span>let me explain.”</span>\n</p>\n<p> </p>\n<p>\n<span>“I don’t know if I want to hear your explanation Shiro,” Lance admits with a defeated shrug. “How you explain yourself to me is going to affect how I see you after tonight,” he states plainly, “and I’m not sure if I’m ready to lose a friend if your explanation isn’t enough for me to forgive you.”</span>\n</p>\n<p> </p>\n<p>\n<span>Shiro’s heart stops.</span>\n</p>\n<p> </p>\n<p>\n<span>“Lance,” his eyes well up, “</span>\n<em>\n<span>please</span>\n</em>\n<span>.”</span>\n</p>\n<p> </p>\n<p>\n<span>“I want to forgive you though,” Lance admits, “I want us to be ok. I don’t like being mad at you Shiro, it makes me feel gross. So…”</span>\n</p>\n<p> </p>\n<p>\n<span>The blue paladin moves and leans back against his room door, sliding down until he’s sitting directly across from the leader.</span>\n</p>\n<p> </p>\n<p>\n<span>“Let’s have it then.”</span>\n</p>\n<p> </p>\n<p>\n<span>…</span>\n</p>\n<p> </p>\n<p>\n<span>“Are you certain that this planet is still there, Princess?” Coran asks curiously. He only does so as a habit. If Allura says she senses the planet, then Coran is sure that she senses the planet. But she should be able to articulate exactly what she feels if they are to proceed with their goal.</span>\n</p>\n<p> </p>\n<p>\n<span>“I am,” Allura nods surely, “the level of ambient quintessence is like no other I’ve felt before. The entire world is located within a self-contained dimensional anomaly that only the Lions should be able to cross.”</span>\n</p>\n<p> </p>\n<p>\n<span>Coran nods. That sounds quite right.</span>\n</p>\n<p> </p>\n<p>\n<span>“Then are you sure you are willing to leave the castle in the care of Kolivan?” he asks next. He knows that she still has trouble trusting the Blade, even though they were invaluable during the Black Paladin’s temporary absence.</span>\n</p>\n<p> </p>\n<p>\n<span>“We don’t have much a choice,” Allura responds, “the castle cannot cross the anomaly, and I cannot allow the paladins to go there by themselves. Their understanding of quintessence and how to use it is slim to non-existent at best. They will need us there, if only as translators.”</span>\n</p>\n<p> </p>\n<p>\n<span>Coran agrees.</span>\n</p>\n<p> </p>\n<p>\n<span>“Then I shall set a course for Kislev.”</span>\n</p>\n<p> </p>\n<p>\n<span>…</span>\n</p>\n<p> </p>\n<p>\n<span>Shiro takes in a breath before he continues.</span>\n</p>\n<p> </p>\n<p>\n<span>“Firstly,” he says quietly, “I want you to know how sorry I am.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Ok,” Lance acknowledges, just as quietly. “I appreciate you telling me, but it really doesn’t mean much if neither of us know what you’re sorry for.”</span>\n</p>\n<p> </p>\n<p>\n<span>“That’s fair,” Shiro nods, stretching his legs out and placing his hand in his lap. It’s both an attempt to make his body language as well as an attempt to see what Lance will do. They’re both tall, and Shiro’s right foot is just short of brushing against Lance’s left foot from where his one leg is extended. Lance is wearing his lion slippers, Shiro his boots. The contrast provides something to focus on for a second.</span>\n</p>\n<p> </p>\n<p>\n<span>If Lance knows why Shiro just did that, then he gives no indication. He doesn’t put more distance between them either, and the black paladin allows himself a little bit of relief at that.</span>\n</p>\n<p> </p>\n<p>\n<span>“I mistreated you today,” he states plainly. He’s loathe to admit it, but Shiro isn’t the type to try and play off his mistakes. “I disrespected you as both a teammate and a friend. I treated your feelings carelessly.”</span>\n</p>\n<p> </p>\n<p>\n<span>Lance regards him blankly, chin resting on his arms crossed over his right legs. Blue eyes peeking through long lashes and brown hair that curls slightly towards the ends. His hair is getting longer, time is passing. How long has he been away from his family now. Shiro doesn’t even know. </span>\n</p>\n<p> </p>\n<p>\n<span>“Why?” Lance asks bluntly. </span>\n</p>\n<p> </p>\n<p>\n<span>“Because…” Shiro hesitates slightly, because if he looks back on it now, then all signs pointed to him not being able to take Pidge too seriously with her state of mind. “Because I’d heard about what happened between you and Keith, as well as you and Pidge. And I jumped to conclusions.”</span>\n</p>\n<p> </p>\n<p>\n<span>“I heard Pidge made it sound bad,” Lance nods, “but I still don’t understand how you came to think that I just went to them and…” he swallows, “why would I do that? Have I done </span>\n<em>\n<span>anything </span>\n</em>\n<span>recently to give you that impression?”</span>\n</p>\n<p> </p>\n<p>\n<span>“No,” Shiro responds softly. Because Lance hasn’t, he’s been nothing but helpful lately, and even before this past week, where he kept to himself for the most part, he wasn’t being mean to anyone. He riled up Keith, but there was no malice behind it. He picked at Pidge, but doted on her at the same time. He teased Shiro and Hunk, but was always somewhere close if they needed. He did chores with Coran and indulged the Altean when he told countless stories, which is something they all needed to work on. He smiled and joked around with Allura, but always left her alone when he was rebuked. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance had done nothing to hint at him being malicious or angry enough to attack his fellow paladins. So why did Shiro’s mind automatically jump there?</span>\n</p>\n<p> </p>\n<p>\n<span>“Then why did you come to me like that?” Lance wants to know as well. It's a question, but Shiro knows better. He knows that Lance knows why it happened. Lance had said it then after all. </span>\n</p>\n<p> </p>\n<p>\n<span>“You were right,” Shiro admits softly. “When I heard that Keith’s feelings were hurt, and that you’d argued with Pidge as well, I just…”</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“You bias is showing.”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Shiro’s ashamed of himself.</span>\n</p>\n<p> </p>\n<p>\n<span>“Right,” Lance’s voice goes bitter, and the black paladin flinches. “Of </span>\n<em>\n<span>course </span>\n</em>\n<span>it had to be on me.”</span>\n</p>\n<p> </p>\n<p>\n<span>The elder doesn’t want to go on, but he knows that he needs to explain himself fully. Lance deserves as much.</span>\n</p>\n<p> </p>\n<p>\n<span>“The way Pidge described Keith,” the image of his friend, young and confused and teary pops up again. “It sounded like a way he used to get,” he explains, “but only when he got bullied.” </span>\n</p>\n<p> </p>\n<p>\n<span>Lance remains silent, pressing his face into his arms.</span>\n</p>\n<p> </p>\n<p>\n<span>“I just couldn’t get that image out of my head,” Shiro mutters, “and knowing that Pidge was involved in someway too just brought out the worst in me.”</span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>No</span>\n</em>\n<span>,” Lance denies, looking up from his arms with teary eyes. Shiro wants to cry too. He’s going to, if this goes on any further. “It didn’t bring out the worst in you,” the blue paladin insists vehemently, “those feelings? That need to protect and cherish? That’s </span>\n<em>\n<span>not </span>\n</em>\n<span>the worst of you, Shiro. I’m an older brother. Trust me.”</span>\n</p>\n<p> </p>\n<p>\n<span>Shiro has always known that Lance has a big family waiting for him at home, but he’s ashamed to say that this is the first time he’s hearing it confirmed that Lance has younger siblings. He’d figured, by the way Lance treats Pidge and Keith (who incidentally happens to be older than Lance) sometimes, but this is first time he’s heard it for sure. </span>\n</p>\n<p> </p>\n<p>\n<span>“It didn’t bring out the worst in you,” Lance whispers, “it just made you think the worst of </span>\n<em>\n<span>me</span>\n</em>\n<span>.”</span>\n</p>\n<p> </p>\n<p>\n<span>Shiro doesn’t even try to stop the tear from leaking from his eye. </span>\n</p>\n<p> </p>\n<p>\n<span>“Lance,” he murmurs.</span>\n</p>\n<p> </p>\n<p>\n<span>“That need to protect and cherish?” Lance goes on somberly, “I thought it extended to me too. I always felt safe, because I always felt you were fair.”</span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>Lance</span>\n</em>\n<span>,” Shiro begs, hands clenching in his lap.</span>\n</p>\n<p> </p>\n<p>\n<span>“I know you’ve always preferred Keith,” Lance huffs, “I know you’ve always trusted in him in a way you don’t trust anyone else. And I know you look at Pidge and see Katie, Matt and their father, so.”</span>\n</p>\n<p> </p>\n<p>\n<span>“I…” Shiro can’t say anything to that. Lance isn’t wrong.</span>\n</p>\n<p> </p>\n<p>\n<span>“But you’ve never treated me differently because of that,” the blue paladin states, “you’ve never trusted me as much as Keith, looked out for me as much as Pidge, but you’ve never treated me as less just because of them.” </span>\n</p>\n<p> </p>\n<p>\n<span>Shiro is helpless to stop his eyes from leaking now. Is this really how Lance feels?</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>“You need to apologize to both Keith and Pidge. Neither of them deserve how you treated them today.”</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Of course it is. What has Shiro done to not make him feel this way? Call him their Sharpshooter </span>\n<em>\n<span>once</span>\n</em>\n<span>? In direct response to Lance inadvertently admitting his insecurities that Shiro had never noticed before then?</span>\n</p>\n<p> </p>\n<p>\n<span>“But then </span>\n<em>\n<span>today </span>\n</em>\n<span>happened,” Lance says, voice choked. “And I don’t get it! I’ve tried so hard. Worked so hard to make things ok!”</span>\n</p>\n<p> </p>\n<p>\n<span>Shiro can’t say anything past the lump in his throat. Lance is openly crying now, and he hates it so much. No one so vibrant and happy and </span>\n<em>\n<span>good </span>\n</em>\n<span>should be crying like this, because of him. He should have protected his friend more.</span>\n</p>\n<p> </p>\n<p>\n<span>“When you were gone,” Lance murmurs, “things were awful! Allura went full-on drill sergeant trying to find a way to find you. Pidge stopped having an appetite and starting working around the clock and Keith </span>\n<em>\n<span>literally fell to pieces</span>\n</em>\n<span>!”</span>\n</p>\n<p> </p>\n<p>\n<span>“I…” Shiro chokes out, but Lance isn’t done.</span>\n</p>\n<p> </p>\n<p>\n<span>“Which sucked, because you chose </span>\n<em>\n<span>him </span>\n</em>\n<span>to lead Voltron in your stead!” Lance states harshly, “But the Black Lion wouldn’t let him in at all! He trained all the time, and hardly talked to any of us! I was the only one to see him in person for an </span>\n<em>\n<span>entire three days</span>\n</em>\n<span> one time Shiro! And that was because I had to hunt him down and make him eat and bathe! Hunk didn’t want to talk to him, because he’d gotten all snappy! Pidge was just as snappy, so they started arguing whenever they spoke! And Allura was killing herself trying to jump from place to place in hopes of finding some sign that you were ok!”</span>\n</p>\n<p> </p>\n<p>\n<span>Shiro can’t breathe. It was that bad?</span>\n</p>\n<p> </p>\n<p>\n<span>“Coran took care of Allura, Hunk made sure everyone was fed and rested and basically took care of all the maintenance Coran didn’t have time for anymore, and I dealt with Pidge and Keith,” Lance continues, “And Keith was a wreck! He was </span>\n<em>\n<span>mean </span>\n</em>\n<span>and </span>\n<em>\n<span>nasty </span>\n</em>\n<span>and self-destructive! I don’t think you realized just how dependant on you being here he is when you made that decision, Shiro.”</span>\n</p>\n<p> </p>\n<p>\n<span>The black paladin swallows. He’ll have to talk to Keith about this sometime soon.</span>\n</p>\n<p> </p>\n<p>\n<span>“But I still tried </span>\n<em>\n<span>so </span>\n</em>\n<span>hard!” Lance whispers, “I did everything in my power to help, even when he didn’t want to see my face and I never gave up on him! And then Black spat you back out after like a month!”</span>\n</p>\n<p> </p>\n<p>\n<span>Shiro nods.</span>\n</p>\n<p> </p>\n<p>\n<span>“And then everything was ok!” Lance says softly, “you were back! Keith was calm again. Pidge started functioning like a semi-normal human being again and Allura pulled back a bit,” he smiles slightly. “And when you came to thank me for stepping up that night,”</span>\n</p>\n<p> </p>\n<p>\n<span>Shiro remembers that. He’ll always remember feeling so proud and happy that Lance was the blue paladin.</span>\n</p>\n<p> </p>\n<p>\n<span>“It was one of the best nights ever, Shiro,” Lance’s smile widens a bit, “I wasn’t looking for thanks. I was just happy you were ok, but the fact that you came to me made me think ‘</span>\n<em>\n<span>Yes! Finally, he trusts me! He looks at me as an equal he can rely on!</span>\n</em>\n<span>’, and I finally felt like a part of the team. Like I was meant to be here.”</span>\n</p>\n<p> </p>\n<p>\n<span>There’s a soft sob, and Shiro is floored to realize that it’s come from himself. He never knew Lance felt this way. How has he never known that Lance has felt this way?</span>\n</p>\n<p> </p>\n<p>\n<span>“And then we were back to business as usual,” Lance’s voice is scratchy with emotion, “but you had discovered your new bond with Black, and then you started spending half the day with her. You aren’t around much nowadays outside of training and missions, but I still felt good because you were coming to me and asking me and Hunk about how everyone was doing. You trusted me and him to look out for the team. It meant </span>\n<em>\n<span>everything </span>\n</em>\n<span>to me!”</span>\n</p>\n<p> </p>\n<p>\n<span>Lance’s smile grows bitter and hard. Shiro doesn’t even know what to do with himself anymore.</span>\n</p>\n<p> </p>\n<p>\n<span>“And then in a matter of minutes,” his voice hardens too, “you shot all of that out of orbit. </span>\n<em>\n<span>‘Or was I wrong to think that I could rely on you?’</span>\n</em>\n<span>” he sniffles, “Every good feeling I had about myself, and my place in the team, what I meant to </span>\n<em>\n<span>you</span>\n</em>\n<span>. </span>\n<em>\n<span>Gone</span>\n</em>\n<span>. Just like that.”</span>\n</p>\n<p> </p>\n<p>\n<span>Shiro makes a pained noise. It starts in his chest, clawing it’s way up and out his throat. He reaches out. He can’t take this anymore.</span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>Lance</span>\n</em>\n<span>,” he calls, “please come here.”</span>\n</p>\n<p> </p>\n<p>\n<span>Lance buries his face back into his arms.</span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>No</span>\n</em>\n<span>. No, no,” Shiro shakes his head, “don’t do that. Please come here, Lance. </span>\n<em>\n<span>Please</span>\n</em>\n<span>.”</span>\n</p>\n<p> </p>\n<p>\n<span>He’s not above begging, because he knows that this is a definitive moment. The blue paladin has to come to Shiro completely of his own volition if this is going to work. Shiro wants nothing more than to close the distance, but he needs for Lance to do it.</span>\n</p>\n<p> </p>\n<p>\n<span>“I can make this right,” Shiro insists, far more confident than he actually feels. But he won’t give up. He’s the leader, and he’s wronged his teammate and friend. Somehow, someway, he’s going to make this up to the younger.</span>\n</p>\n<p> </p>\n<p>\n<span>But he’d really, </span>\n<em>\n<span>really </span>\n</em>\n<span>like for Lance to be a part of that process.</span>\n</p>\n<p> </p>\n<p>\n<span>“I can make this up to you,” Shiro pleads, “you’re right, about all of it. I hate myself for making you feel like that, and all I want to do now is to make it right. But I need for you to come here.”</span>\n</p>\n<p> </p>\n<p>\n<span>“How do you even plan on fixing this?” Lance’s voice is quiet and muffled. He doesn’t look up. Shiro has to get through to him before he completely closes off.</span>\n</p>\n<p> </p>\n<p>\n<span>“By doing what I should have done a long time ago,” the black paladin murmurs, “by actually getting to know you. Bringing you, and Hunk for that matter,” because he’s not lost on his need to do that as well, “into my life the same way that I brought Keith and Pidge in. And I hope that you’re still willing to have me in your life too.”</span>\n</p>\n<p> </p>\n<p>\n<span>Lance remains silent.</span>\n</p>\n<p> </p>\n<p>\n<span>“I’m </span>\n<em>\n<span>so </span>\n</em>\n<span>sorry Lance,” Shiro tries, “</span>\n<em>\n<span>please</span>\n</em>\n<span> let me make it up to you.”</span>\n</p>\n<p> </p>\n<p>\n<span>The blue paladin finally looks up. His face is miserable, but his eyes are hopeful.</span>\n</p>\n<p> </p>\n<p>\n<span>“C’mere,” Shiro waves his open arms.</span>\n</p>\n<p> </p>\n<p>\n<span>Lance stares for moment. And then he closes the distance.</span>\n</p>\n<p>\n<br>\n<br>\n</p>\n<p>\n<span>…</span>\n</p>\n<p> </p>\n<p>\n<span>“Is this going to piss Lance off?” Keith murmurs from where he’s pressed against Hunk’s side. “Because I’m not trying to having a repeat of today.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Is it going to piss Shiro off?” Pidge cuts in, “isn’t he like, a super private person?”</span>\n</p>\n<p> </p>\n<p>\n<span>“Shhh,” Hunk places a hand on both of their heads, pulling them slightly closer as he leans a bit further around the corner. “It’s not like we can hear what they’re saying, we’re just making sure no  more yelling is involved.”</span>\n</p>\n<p> </p>\n<p>\n<span>Hunk had heard Lance’s voice raise at one point. He hadn’t been able to discern the words, but the tone was enough to freak him out, so he’d done what any normal person would have done.</span>\n</p>\n<p> </p>\n<p>\n<span>He eavesdropped.</span>\n</p>\n<p> </p>\n<p>\n<span>And apparently Pidge and Keith were in some state of hypervigilance or something, because they’d meandered out of their rooms and pressed in close to Hunk to eavesdrop as well. Lance’s voice didn’t raise again, and neither did Shiro’s. But they did watch with somber eyes as the two seemed to hit a bit of a roadblock in which Shiro seemed to want a hug and Lance was ignoring him.</span>\n</p>\n<p> </p>\n<p>\n<span>Not anymore though.</span>\n</p>\n<p> </p>\n<p>\n<span>“Shiro doesn’t cuddle </span>\n<em>\n<span>me </span>\n</em>\n<span>like that when I’m upset,” Keith grumbles.</span>\n</p>\n<p> </p>\n<p>\n<span>“Oh my god,” Pidge groans, “quit pouting. He so does.” </span>\n</p>\n<p> </p>\n<p>\n<span>“Or at least he tries to,” Hunk points out, “but you never want to be touched, except for that one time.”</span>\n</p>\n<p> </p>\n<p>\n<span>“I am not pouting,” the red paladin hisses. </span>\n</p>\n<p> </p>\n<p>\n<span>“And the number one bonding moment for the day goes to…” Pidge grins, completely ignoring Keith. Hunk smiles as well, watching as Shiro seems to be whispering something into Lance’s ear, the blue paladin’s shoulders shaking underneath the elder’s firm hold on him. That’s going to take some work. No doubt about it. But they both seem willing to put the effort in.</span>\n</p>\n<p> </p>\n<p>\n<span>Things might actually be ok.</span>\n</p>\n<p> </p>\n<p>\n<span>…</span>\n</p>\n<p> </p>\n<p>\n<span>“They’re totally watching us,” Lance mumbles, pressing his face more into Shiro’s neck.</span>\n</p>\n<p> </p>\n<p>\n<span>“Let them,” the black paladin responds quietly, nosing into his hair.</span>\n</p>\n<p> </p>\n<p>\n<span>“Pidge is going to make so many jokes,” he warns, but doesn’t release his grip from Shiro’s middle. Lance never knows how much he needs a hug until he gets one. Shiro-cuddles are nice. This is his first experience with one. Maybe he’ll demand more and have access to both Shiro-cuddles and Hunk-cuddles. </span>\n</p>\n<p> </p>\n<p>\n<span>“Let her.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Keith is totally jealous right now.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Of you?” Shiro questions, “Or of me?”</span>\n</p>\n<p> </p>\n<p>\n<span>“Both, probably,” Lance answers, remembering the moment from his room. “He likes bonding moments, just won’t admit it.”</span>\n</p>\n<p> </p>\n<p>\n<span>“...How are you feeling?”</span>\n</p>\n<p> </p>\n<p>\n<span>Lance takes a second. His hands aren’t shaking. He can breathe just fine. He’s comfortably warm, not overheating. He doesn’t feel the need to nibble.</span>\n</p>\n<p> </p>\n<p>\n<span>“Better,” he answers honestly, feeling Shiro hum in response. “Not 100%, but definitely better.”</span>\n</p>\n<p> </p>\n<p>\n<span>“I will make this up to you,” Shiro insists one more time.</span>\n</p>\n<p> </p>\n<p>\n<span>Lance smiles.</span>\n</p>\n<p> </p>\n<p>\n<span>“I believe you.”</span>\n</p>\n<p> </p>\n<p>\n<span>…</span>\n</p>\n<p>\n<br>\n<br>\n<br>\n</p>\n<p>\n<span>“Shiro?”</span>\n</p>\n<p> </p>\n<p>\n<span>“Yeah?”</span>\n</p>\n<p> </p>\n<p>\n<span>“</span>\n<em>\n<span>What</span>\n</em>\n<span> is that?”</span>\n</p>\n<p> </p>\n<p>\n<span>“What?”</span>\n</p>\n<p> </p>\n<p>\n<span>“That...red thing...do you see it?”</span>\n</p>\n<p> </p>\n<p>\n<span>“Oh. Yeah. It’s...hopping?”</span>\n</p>\n<p> </p>\n<p>\n<span>“...It’s hopping this way.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Can you make out any features?”</span>\n</p>\n<p> </p>\n<p>\n<span>“It’s...one of those weird peppers?”</span>\n</p>\n<p> </p>\n<p>\n<span>“...Hunk?”</span>\n</p>\n<p> </p>\n<p>\n<span>“...Hunk.”</span>\n</p>"
}