{
  "id": "1018539",
  "url": "https://archiveofourown.org/works/1018539?view_full_work=true",
  "author": [
    "dangerbears"
  ],
  "title": "harder to hide than i thought",
  "rating": "Not Rated",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "One Direction (Band)"
  ],
  "relationships": [
    "Harry Styles/Louis Tomlinson"
  ],
  "characters": [
    "Harry Styles",
    "Louis Tomlinson",
    "Gemma Styles"
  ],
  "additional_tags": [],
  "language": "English",
  "series": "",
  "published": "2013-10-26",
  "completed": null,
  "words": "6,494",
  "chapters": "1/1",
  "comments": "127",
  "kudos": "6,330",
  "bookmarks": "1,129",
  "hits": "97,107",
  "summary": "<p>ridiculous self-indulgent high school au. louis's best friend's little brother suddenly got very attractive.</p>",
  "notes": "<p>i got sent home from work early because i'm dying of the plague and i have been meaning to write something like this for awhile and today was the day, i suppose. no one's pretending this is a masterpiece hahahahaha.</p>",
  "text": "<p>Gemma is sitting crosslegged on her bed when Louis walks in. She's flipping through Teen Vogue and her brow is furrowed, lower lip pulled into her mouth. She glances up at him, standing in the doorway. \"Sit down,\" she says, voice sharp. </p>\n<p>Louis blinks and obeys, crossing the shiny oak floor to sink down on the purple bedspread. Gemma doesn't seem to be in a big hurry to say anything, so Louis stares at the map of the United States above her headboard. It's one of those faux-antiques, something that rich people apparently consider charming. Well. It <i>is</i> charming, Louis allows, just, like, he has old maps that his dad would get from gas stations and keep in the glove compartment, but that's just not as classy. </p>\n<p>Gemma sighs. \"So. You're taking me to homecoming, right?\" </p>\n<p>\"Um.\" Louis looks at her. \"Sure. Okay. Gemma, darlin', would you do me the honor of accompanying me to homecoming?\" </p>\n<p>\"<i>No</i>,\" Gemma says, scowling. \"Ugh. Lou.\" </p>\n<p>\"Oh my god,\" Louis says. \"What just happened?\"</p>\n<p>Gemma sits up and pushes the magazine off her lap. It's open to a section on homecoming dresses, naturally. Louis sighs. Hopefully he won't have to invest in a <i>matching suit</i> or something equally ridiculous. \"Louis,\" Gemma says, snapping him back to attention. She's wearing a big grey sweater and black leggings, thick wool socks pulled up her calves. It's cute. Louis wants to cuddle her a little. </p>\n<p>He smiles at her as she opens her mouth to talk again and he crawls across the huge bed to her. Her face softens and relaxes into a rueful smile. He grabs her around the waist and pulls her down so they're laying across the comforter. \"Hi,\" he whispers.</p>\n<p>She squeezes the arm that's wrapped around her. \"Hey,\" she says softly. </p>\n<p>\"Much better. Now, what do you need?\" He reaches up with his free hand and pushes some of her hair out of her face. </p>\n<p>\"It's stupid.\" Gemma's blushing a bit, and she glances away, rolling her eyes. \"I can't believe it's even something I'm thinking about.\" </p>\n<p>\"Gem.\" Louis digs his fingertips into her stomach, where she's ticklish. \"What can I do?\" </p>\n<p>\"I just, like,\" she pauses, sighs. \"I just want someone to ask me to homecoming.\" </p>\n<p>\"I just did!\" </p>\n<p>Her brow tightens briefly, then relaxes. \"I know.\" She knocks her knees into Louis's, giving him a little smile. \"I just... you know? The whole, like, cute thing. I don't know. It's so stupid. Just, like, I'm a senior and nobody's ever asked me to homecoming or winter formal or prom.\" </p>\n<p>\"Ah.\" Louis pulls her closer and drops a kiss on her cheekbone before burying his nose in her hair. It smells like cinnamon. \"Well, I mean. If it makes you feel any better, everyone probably does think you and I are dating.\" </p>\n<p>\"I know.\" Gemma huffs out a little laugh. \"Which is fine, I mean. Obviously.\" </p>\n<p>Louis rolls his eyes. \"Please come to homecoming with me, Miz Styles.\" </p>\n<p>She pinches him. \"Of course I will.\"</p>\n<p>They're quiet for a moment, breathing in sync. \"Is there anyone you actually want to go with?\" Louis asks into the silence. \"Like, crush-wise.\" </p>\n<p>Gemma's shoulders shrug, Louis feels it against his chest. \"I don't know. Sort of.\" </p>\n<p>Louis pushes up to look down at her, wide eyed. \"Oh my god. Gemma Styles. You like a <i>boy</i>? And you haven't <i>told me</i>? <i>Me</i>? Your very best friend in the whole world? I tell you every single boy who even glances at me and you don't return the favor?\" He falls back, dramatic, mock-offended. \"I'm wounded.\" </p>\n<p>Gemma whacks him in the stomach with the back of her hand, and then slides her hand under his shirt to rub at his belly. He flinches. \"Sorry, sorry, sorry. I don't know. It's another really stupid thing.\" </p>\n<p>\"What?\" Louis sits up again, pulling her hand out from under his shirt and winding their fingers together. \"I'm sure you only have the finest taste.\" </p>\n<p>She rolls her eyes. \"It's really, really stupid,\" she says again. </p>\n<p>\"Tell me.\" </p>\n<p>\"Ugh.\" She glances behind her, making sure the door's closed. \"Okay, ugh. Ugh, ugh, ugh. You know Niall Horan?\"</p>\n<p>Louis's brow furrows. \"The sophomore?\"</p>\n<p>Gemma nods. </p>\n<p>\"Isn't he Harry's friend?\" Louis feels his smile growing across his face, but can't stop it.</p>\n<p>\"God,\" Gemma groans. She shoves a hand in her hair, mussing it up and throwing it all over one side. \"I know. It's so awful and weird. But, like, all summer Harry's had his stupid bro-y friends over and they've all been in the pool and everything, like, half-dressed and it's awful. He's like. Cute. And hilarious. And. For fuck's sake, Louis, stop <i>laughing</i>–\"</p>\n<p>\"No, no,\" Louis gets out. \"I'm sorry, shit.\" He can feel how red his face has gotten, and he presses his hands to his cheeks, trying to tamp down his smile. \"I'm sorry. He is really cute. Big shoulders and all that. He's on, what, the wrestling team?\" </p>\n<p>\"I hate you,\" Gemma says, pushing at him till he falls back flat onto the bed, still laughing. She climbs over him, straddling his stomach and grasping his wrists. \"You cannot breathe a word of this to any–\"</p>\n<p>The bedroom door swings open and Gemma immediately cuts herself off, looking up. Louis cranes his head back against the mattress, trying to see who it is. </p>\n<p>\"Uh,\" Harry says. \"Hey, um, Louis.\" </p>\n<p>\"Oh!\" Louis can hear how high and squeaky his voice goes. \"Hello there, Harold. Always a pleasure.\"</p>\n<p>\"Yeah,\" Harry says slowly. \"So, like, when you guys are, uh, done, Mom was wondering if you were staying for dinner?\" </p>\n<p>Louis laughs, still high-pitched and alarmingly annoying. \"We're not doing anything! Just, um. Practicing. Gemma's thinking of joining the wrestling team.\"</p>\n<p>From above him, Gemma makes a growling noise and clamps down harder on his wrists, bending them back rather painfully. Louis tries not to whimper. </p>\n<p>\"Right,\" Harry says. \"Uh, so... dinner?\" </p>\n<p>\"Oh! Right! Yes! If that's alright? If there's not enough or something, I mean, I don't wanna impose, so, like–\" Louis bites his lip, stopping the random babbling. </p>\n<p>Harry smiles a little bit. \"No, no, I'm sure we can scrounge something up for you. See you guys later. Good luck with the wrestling, Gemma. And you, Louis. Looks like you need it.\" </p>\n<p>Turning around, Harry walks out and closes the door behind him. Gemma rolls off Louis and buries her face in the comforter underneath them. \"I can't believe you said that.\" </p>\n<p>\"Oh, come on. He won't get it,\" Louis says absently, staring at the ceiling. \"I'm more embarrassed he thinks you can pin me. How shall I demonstrate my strength to him? Maybe I can lift one of those weird stone gargoyles you guys inexplicably have. Or carry an extra tall stack of dishes when we're clearing the table. Or–\"</p>\n<p>\"Why,\" Gemma says, lifting her head to peer curiously at him, \"are you suddenly so concerned with whether or not my little brother thinks you're strong?\" </p>\n<p>Louis pauses. \"Um. Manly pride? You know. Manly things. Jockstraps. Spitting. Scratching... places. Stuff like that.\"</p>\n<p>Gemma leans over Louis's face, her hair tickling his ears and neck. He twitches. \"Louis Tomlinson,\" she says gravely. \"Do you think my brother is <i>cute</i>?\"</p>\n<p>Louis opens his mouth, but doesn't speak. Gemma's eyes narrow. \"Louis.\" </p>\n<p>\"I...\" Louis starts. \"What do you want me to say? He's attractive, yeah, sure. So's your mom. So are you!\"</p>\n<p>Gemma levels him a steely look. \"Louis Tomlinson,\" she says again. \"I will sit on you again.\" </p>\n<p>\"Oh god.\" He starts thrashing around on the bed. \"Oh dear god, this parachute's a knapsack!\" he shrieks, rolling off onto the floor. \"Man down! Medic!\"</p>\n<p>\"Oh my god,\" Gemma says from the bed. She scoots forward and looks down at him. \"Oh my god, you have a crush on my brother.\" </p>\n<p>\"I – what? This escalated very quickly!\" Louis is grasping at straws now. </p>\n<p>\"You think he's attractive.\" </p>\n<p>Louis buries his face in his hands. \"Gemma!\" </p>\n<p>\"Do I have to ask you your intentions toward him? Oh my god. Are you going to corrupt my little brother with your dirty ways? Oh my god, Louis, I <i>know</i> you. Oh, this is so weird, oh god. This is so, so weird.\" Gemma's sitting up, now, legs folded in front of her, staring at the wall. \"Oh my god. What if you get married? I'll be stuck with you forever in an entirely different way that I expected. Oh god, I am going to be single and alone forever and you and my <i>brother</i> are going to be, like, reveling in happiness in front of my face. I'm going to die old and alone, watching you two <i>canoodle</i>.\" </p>\n<p>\"Gemma,\" Louis says again. He closes his eyes. \"Shut up.\" </p>\n<p>\"How can I shut up!\" Her voice has gone high pitched. \"This is absolutely the last thing I expected, but I suppose I should have seen it coming. The growth spurt. The new clothes that make him look like he dripped off the pages of some indie blog. Oh god. Oh god, he's so your type.\" She stops and looks down at him. \"I am distraught. You have rendered me distraught. How am I meant to behave with this knowledge?\" </p>\n<p>\"Like a normal fucking person!\" Louis snaps. \"Look, god, it's not even a thing, Gem, okay. He's, like, objectively very hot, but most probably straight and even if he's not, I'm sure I'm just like wallpaper to him, so can we <i>drop it</i>?\"</p>\n<p>Gemma opens her mouth to retort and then pauses, closes it. \"What? Lou, shut up. You're, like, gorgeous.\" </p>\n<p>Louis rolls his eyes. </p>\n<p>Groaning, Gemma says. \"Get back up here.\" </p>\n<p>Reluctantly, Louis crawls back up onto the bed, kicking the still-open fashion magazine onto the floor. He pulls back the comforter and burrows underneath, holding it up for Gemma to slip in next to him. She does, and sighs as she wraps her arms around him. \"If you wanna date my brother, I promise not to bitch too much when you spend all your time with him,\" she grumbles.</p>\n<p>Louis huffs a laugh into her hair and kisses the top of her head. \"I'm not even thinking of it as a possibility.\" </p>\n<p>Gemma pulls back slightly and looks up at him. \"Louis, what, c'mon. Despite the weird incest vibe I'm getting here, I mean, like – okay, so I have no idea who Harry's into or whatever, but, like, unless he's a one on the Kinsey, I'm sure he thinks you're fine as hell. So. Shut up.\" </p>\n<p>Pulling a face at her, Louis says, \"Let's nap till dinner and never speak of this again. I have leverage, remember.\" </p>\n<p>\"Okay.\" She's quiet for awhile and Louis relaxes a little, closing his eyes. \"But,\" and Louis's eyes fly right back open. \"But, like, if you get married you'll be my for-real brother,\" she murmurs. \"And that'd be cool.\" </p>\n<p>Louis grins and pulls her closer. \"Yeah. It would.\" </p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p>They doze for about a half an hour, and then there's a soft knock on the door. Louis blinks his eyes open hazily, spitting out a mouthful of Gemma's hair. He pets it down and croaks, \"Yeah?\" just quiet enough not to wake her.</p>\n<p>The door opens and Harry steps halfway into the room. \"Hey,\" he says to Louis. Glancing at the bed, he seems to notice Gemma's still asleep. \"Sorry.\" </p>\n<p>\"Oh.\" Louis is suddenly very aware of how wrapped around Harry's sister he is. He has no idea what Gemma's said about him to her family over the years, but he really can't imagine she could have gone this long without telling them that he's gay. He, like, frequently spends the night. With the door closed. Louis is pretty positive everyone in this family knows he's gay. So, armed with that knowledge, Louis's brilliant, award-winning, poetic mouth opens up and he word-vomits, \"We didn't have sex.\" </p>\n<p>Eyes widening, Harry stares at Louis. </p>\n<p>\"Oh, god,\" Louis says. \"I didn't mean to say that out loud.\"</p>\n<p>Harry starts to smile, then, red lips curving upward and his eyes squinting back down into a warm gaze. \"I didn't think you had sex, but now I'm pretty suspicious, dude. If she can beat you up, I can definitely beat you up.\" </p>\n<p>\"Oh my god, what,\" Louis says, affronted. \"She can <i>not</i> beat me up. I was letting her win. It was, um. Foreplay. Roleplaying, uh. She was Nala, I was Simba. Circle of life.\" </p>\n<p>Harry's full on laughing now and Gemma starts to stir, rubbing her face into Louis's shirt. \"S'what,\" she says into his chest. \"What are you sayin' about me?\" </p>\n<p>\"Louis was telling me you two are into Disney animal roleplay. Apparently it's the only way you turn him on,\" Harry says, smirking at Louis. </p>\n<p>Louis actually might want to drown a little bit. </p>\n<p>Gemma sits up. \"What,\" she says, \"the hell is happening?\" </p>\n<p>\"Oh god, nothing. Really, really nothing.\" Louis shoots a glare at Harry, who's still chuckling by the door. \"You've definitely just gotten me in trouble, thank you.\" </p>\n<p>\"I'll have you know that if I set my mind to it, I could turn you on pretty easily,\" Gemma snaps at Louis. </p>\n<p>Louis closes his eyes. \"Gemma.\"</p>\n<p>\"I <i>could</i>,\" she hisses. \"Want me to try?\" </p>\n<p>\"Gemma,\" Louis says again, through gritted teeth. \"Think about that, yeah?\" </p>\n<p>There's a pause, and then Gemma blows out a breath. \"I hate my life. And your life. And,\" she points to Harry, \"yours too.\" </p>\n<p>Harry's mouth drops open in mock-innocence. \"What have I done?\" </p>\n<p>\"Ugh. More than enough, thank you,\" Louis says. He can't help it, though: he lets his mouth curve up a little and he winks across the room at Harry. </p>\n<p>Harry's face softens into a smile back at Louis. \"I really just came up here to tell y'all that dinner's ready, so. You know.\"</p>\n<p>\"Thanks, fucker,\" Gemma grumbles. \"We'll be down after I kill Louis.\"</p>\n<p>\"Oh, don't do that,\" Harry says as he closes the door. \"I'd miss him.\"</p>\n<p>Gemma elbows Louis hard in the stomach and so Louis pushes her off the bed. He could totally take her. If he wanted to. Which he doesn't. God. He should go benchpress a weird gargoyle statue. </p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p>Dinner is tense. Sort of. <i>Louis</i> is tense, and that's coloring his perception of the whole evening. Gemma's next to him and she keeps stepping on his foot every time Harry even looks over at them, and Anne is clearly confused at the silence around the table. </p>\n<p>\"So,\" Anne says. \"Louis.\" </p>\n<p>\"The food is lovely,\" Louis says in a rush. He turns bright red. \"Sorry I didn't say so before. I love it. Chicken parm is one of my favourites, but my mom never has the time to make it. Thank you for having me. Your home is lovely.\" </p>\n<p>Everyone is still, staring at him. </p>\n<p>\"Lou,\" Anne is looking at him like he's lost his mind. \"You've had dinner over here at least once a week for probably four years.\"</p>\n<p>\"Yeah,\" Gemma says. \"Are you, like, alright? Are you going to have a heart attack? You look like you've sat on a tree branch.\" </p>\n<p>Harry snorts from across the table. Louis doesn't look at him, because he doesn't want to notice how every time Harry takes a bite of food, his mouth has to open about six times the size of whatever's on his fork. He doesn't want to watch Harry lick his lips after every sip of water. He doesn't want to watch Harry get a bit of sauce on his thumb and suck it into his mouth. It's actually obscene. Louis isn't doing a very good job at not looking at Harry. </p>\n<p>\"I'm fine, thank you,\" Louis says stiffly. He draws a design in the salad dressing on his plate. \"Um. Were you going to say something, Anne? Sorry I interrupted you.\" </p>\n<p>Anne looks at Gemma, <i>what the fuck is going on?</i> clearly written in her eyes. Gemma shrugs, even more obviously. Louis bites at his lip and focuses harder on his plate. \"Babe, I just remembered that you did quite well at AP European History, didn't you?\" </p>\n<p>Oh. Louis takes a sip of water. \"Um, I guess? I got a 4 on the AP test, but that was such crap. The test was, like, exponentially harder than the previous year. I'm still mad about it.\"</p>\n<p>Anne laughs, and out of the corner of Louis's eye, he can see Harry roll his eyes. \"I'm just asking because Harry's having a hard time. I just checked his grades online and saw his last quiz score and–\"</p>\n<p>\"Mom!\" Harry interrupts, voice raised slightly. \"What? Excuse me? Isn't that, like, invasion of privacy?!\"</p>\n<p>Setting her fork down, Anne raises a delicate eyebrow. \"No, Harry, I believe that is why the school gives parents a login for the website.\"</p>\n<p>Harry's knuckles are white on his fork. \"Look, god, it was like the second quiz and nobody even <i>cares</i> about the Magna Carta or whatever.\"</p>\n<p>\"The Magna Carta was signed in 1215,\" Louis says absently. </p>\n<p>Both Anne and Harry turn to look at him. Gemma smirks. </p>\n<p>\"Sure,\" Harry says, drawing the word out. \"And?\" </p>\n<p>\"Well, AP Euro is from 1500 to, like, 1970. The Magna Carta probably wouldn't have been asked about.\" Louis is really regretting ever opening his mouth. Harry looks like he's regretting Louis ever opening his mouth as well. </p>\n<p>\"It's settled then,\" says Anne, voice calm. \"Louis will help you study after dinner.\" </p>\n<p>Gemma lets out a shout of laughter and immediately claps her hands over her mouth. \"Sorry,\" she gasps out when everyone stares at her. \"Sorry, sorry. It's just hilarious.\" </p>\n<p>\"Why, pray tell, is it hilarious, Gemma?\" Louis grinds out, glaring at her. </p>\n<p>Gemma struggles to control her expression, forcing her mouth into a straight line. \"Just, like, you know. I'm sure neither you nor Harry were planning on spending your evening this way.\" She smiles back at Louis, innocent. </p>\n<p>Louis is regretting that the entire human race was given the power of speech. </p>\n<p>\"Oh,\" Anne says, \"Louis, I'm so sorry. I didn't even think of that. Do you have to get home? I know your mom works late, do you have to babysit tonight? I'm sorry I didn't ask. Of course you're not expected to help Harry.\" </p>\n<p>Louis glances across the table to where Harry's head is ducked to look under the table, probably texting all his friends that his mom got his sister's embarrassing friend to forcibly tutor him in history. Louis closes his eyes. \"No, no, Anne, don't worry. Lottie's got the shift tonight. If Harry wants to, I could, um, help him out.\" </p>\n<p>Gemma chokes on a string bean and Louis whacks her on the back a little harder than is strictly necessary. \"Don't die,\" he mutters to her, voice dangerous.</p>\n<p>Harry shrugs back at Louis. \"S'pose I don't have much choice,\" he says, giving a rueful grin. \"It's whatever. We can make it fun.\" </p>\n<p>Now it's Louis who has to focus very hard on not choking. \"Perfect,\" he gets out. </p>\n<p>Gemma squeezes his thigh under the table and he digs his nails into the back of her hand. </p>\n<p>After dinner, Louis begins to help clear the table, stacking a pile of plates extra high and pushing his sleeves up subtly to try and show off his muscle definition. Gemma watches him, mouth twitching into a mocking smile. Louis ignores her. </p>\n<p>Suddenly, two large hands gently push Louis's own off the dishes and when Louis looks up, Harry's standing alarmingly close to him. \"I got this,\" Harry says softly, smiling down at Louis. \"Don't worry. Feel bad enough that you got stuck helping me study.\" </p>\n<p>Louis blinks up at him. \"Oh,\" he laughs breathily and curses himself. \"It's fine, I really don't mind. Kind of miss AP Euro, actually.\" </p>\n<p>Harry arches an eyebrow and pulls a suspicious face. \"Oookay,\" he says. \"Freak.\" He lifts Louis's pile of dishes easily and walks into the kitchen. Louis watches him leave and turns to Gemma with a hand over his mouth and pained expression. </p>\n<p>\"Gem,\" he whispers. </p>\n<p>\"You,\" she says, pointing at him, \"are actually fucking pathetic. Like, this is the saddest thing I've seen in awhile. I cannot believe I haven't seen this before.\"</p>\n<p>Louis closes his eyes and sinks down into the chair beside her. \"Oh my god.\" He rests his forehead on his knees. Gemma pats at his hair, condescending and comforting simultaneously. </p>\n<p>\"It's cute,\" she says. </p>\n<p>After a few moments, she adds, \"It'd be a hell of a lot cuter if it wasn't my stupid brother, though.\" </p>\n<p>Louis makes another pained noise into his knees. Gemma just laughs. </p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p>Twenty minutes later, Louis finds himself sitting on Harry Styles' bed, holding <i>Modern European History</i>, open to page 102, with Harry Styles sitting across from him, holding a notebook. Louis is a little bit unsure if he's dreaming or not. </p>\n<p>\"Um. Okay,\" he starts. \"So, like, what do you wanna go over?\" </p>\n<p>Harry rolls his eyes and flops backward. \"I <i>don't</i>.\"</p>\n<p>\"Right. Well.\"</p>\n<p>Rolling onto his side, Harry props his head up on his elbow and peers at Louis. \"So what's going on with you and my sister?\" he asks. </p>\n<p>Louis raises his eyebrows and sets the book down. He pulls his knees up to his chest and wraps his arms around them, leaning against Harry's footboard. \"She's my best friend,\" he says slowly. \"Sorry, what do you mean?\" </p>\n<p>\"I mean, like, are you dating? Or, like, hooking up? I've always been curious. She's never really said a lot about it, but my mom definitely thinks you're gay. Which you should probably let her think, even if you're not.\" Harry smirks. </p>\n<p>Louis almost laughs. \"She's really never said anything? And your mom just let me sleep over?\" </p>\n<p>Harry shrugs. \"I mean, like, my mom has this sort of new age don't ask don't tell policy, you know? Plus, she thinks you're the Nicest Boy in the World.\" </p>\n<p>\"Oh, well,\" Louis bats his eyelashes, \"aren't I?\"</p>\n<p>\"Yeah, yeah,\" Harry says, rolling his eyes. \"Tutoring her precious little boy isn't gonna make you look any worse.\"</p>\n<p>\"I'm just a saint,\" Louis says sagely. </p>\n<p>Harry laughs a little, runs a hand through his hair. Louis looks away. Harry's, like, definitely gotten unfairly hot over the past few months. He's in a pair of the most uncomfortably tight jeans Louis has ever seen and he's in a flannel shirt that's got the first three buttons undone, showing off a little too much smooth chest, and his hair is this crazy mass of wavy curls pushed all over his head. His eyes are dark green and his smile dark pink and his skin is pale and even and his body is so <i>long</i> and he has this way of just <i>existing</i> that's so casual and comfortable and spread out. Louis has known him for four years, since Harry was in sixth grade, and while they've never spent a lot of time together, Louis has been around enough to see his awkward phases: the emo phase, the baggy khakis, the skater phase. Louis knows how often Harry trips over his own feet or how he can hold three water glasses in each hand. Louis has seen Harry cry when Gemma snapped at him too harshly and he's heard him play his guitar through the door. He has these little snapshots of Harry over the past four years and it feels <i>creepy</i> to look at Harry now and realize that this tall, beautiful boy is the cumulative shape all those little memories have taken. </p>\n<p>It's not fair, Louis thinks. He wonders what Harry thinks of him. He wonders if he's ever been anything other than Gemma's friend. He wonders if Harry's ever thought of him except to wonder if he and Gemma were hooking up. He wonders if Harry has little snapshots of Louis over the past for years. He bets probably not. He wouldn't be able to tell most of Lottie's friends apart, so why would Harry care about Gemma's?</p>\n<p>\"So,\" Harry says, bringing Louis back to the present. \"You and my sister? Do I have to threaten you? She's lovely, you know. Don't hurt her.\"</p>\n<p>Louis rolls his eyes. \"Harry, honestly. You have to know I'm gay.\" </p>\n<p>\"Oh.\" Harry bites his lip and blinks over at him. He's quiet for a few moments, and then: \"Okay.\" </p>\n<p>Pulling a face, Louis says, \"Did you just want to hear me <i>say</i> it or something? You can't have honestly thought Gem and I have been hooking up since freshman year. Also, like, I know what people say about me at school. I'm not completely stupid.\" </p>\n<p>Harry sits up now, pulling his legs underneath him and leaning back against his pillows. He looks down at his hands, playing with a string on his jeans. \"No, I mean. I don't know. I really wasn't sure. No one's, like... I mean, you're not <i>out</i>, you know? At school? And, like... <i>no one's</i> out at school. I don't know. So, it's just like. I mean. I suspected, but...\" Harry trails off and runs a hand through his hair, worrying at his lower lip. </p>\n<p>Louis sits up a little straighter, too. This conversation may have just taken a sharp turn in a direction he was not expecting. \"Um. Do you, like... wanna talk about anything?\" </p>\n<p>Letting out a hollow laugh, Harry shrugs. \"Sorry, god. No. Sorry. Ignore me.\" </p>\n<p>\"Hey,\" Louis says, leaning forward and nudging at Harry's knee. \"Harry, look. You don't have to talk to me about anything, obviously, but I'm here if you ever want to, you know? I definitely get being confused, or scared, or whatever. And I can answer any questions or, like, I don't know. Buy you condoms.\" </p>\n<p>A sharp bark of laughter escapes from Harry at that. He claps his hands over his mouth in the exact way Gemma does. Louis grins at him, winking. </p>\n<p>Harry smiles back, but it fades pretty quickly as he turns his gaze back down to his knees. \"I don't know,\" he says quietly. \"I've just always kind of... had a sort of weird crush on this one boy? I mean, like, I always just thought I wanted to be his friend really badly or whatever, because he's funny and cool and cute and all that. But lately it's like...? Clearly not only like that. And there are other boys, too, I don't know. I just look at them, and, like... \" Harry shrugs, still picking at the denim on his knees, not looking at Louis. \"Sorry to dump this on you. I probably sound like such a dumb kid.\" </p>\n<p>\"Whoa, hey, no. None of that.\" Louis crawls across the bed to lean against the headboard next to Harry. \"This is pretty much exactly what I went through. Sort of. When I got to high school, there was this senior in the drama club that I was <i>obsessed</i> with. He was hilarious and so talented and everyone loved him, you know? I totally just wrote my crush off as a hero-worship thing. But then at a cast party I was, like, two beers in, you know, total lightweight, shut up, but he came up to me in the kitchen and told me I was cute and kissed me, and I was just like. I just knew.\" </p>\n<p>Harry's looking over at Louis, face soft and golden in the light of the lamp on the bedside table. \"What happened then?\" Harry asks. </p>\n<p>Louis shrugs. \"Friendly kissing is kind of a drama club <i>thing</i>. I don't know how many drama kids you know, but it's a strange sort of cult. You kiss everyone. I've touched many more breasts than I would have in any other circumstance. He was just being friendly to the little freshman, I think. I had a crush on him all year, and then he graduated.\" He laughs a little. \"We didn't really talk after that night, either, but you know. I owe him one, I guess.\" </p>\n<p>\"Yeah,\" Harry whispers. </p>\n<p>Louis glances over at him, and blinks when he realizes Harry's still looking at him. \"Have you ever kissed a boy, Harry?\" he asks, swallowing when his voice goes low and raspy. </p>\n<p>Harry shakes his head, eyes not leaving Louis's. \"No,\" he says, just as hoarse.</p>\n<p>\"Oh.\" Louis licks his lips, eyes dropping down to Harry's mouth. He's just about to lean in, when there's a sharp knock at the door. </p>\n<p>They both jump and Louis scoots back, hand shaking with adrenaline. \"Yeah?\" Harry croaks out, then clears his throat. </p>\n<p>Louis grabs the book and flips it open. \"Henry VII,\" he says wildly. Harry just looks at him, a small smile playing on his lips.<br>\nGemma opens the door. \"Hey,\" she says. </p>\n<p>Louis looks at her with wide eyes, but Harry's just leaning back into his pillows, the picture of casual. \"Sup.\" </p>\n<p>\"Just wondering what was up,\" Gemma says, eyeing Louis suspiciously. \"It was too quiet. I expected to hear glass shattering in your attempt to escape, H.\" </p>\n<p>Harry snorts. \"Nah, nah. Louis is a shockingly competent tutor. He's being very helpful.\" </p>\n<p>\"I'm sure he is.\" Gemma gives Louis another look. \"Can I get you boys anything?\" </p>\n<p>Louis rolls his eyes. \"Are you quite alright, my dear?\" </p>\n<p>Gemma arches an eyebrow. \"If you're not busy, Lou, I think a gargoyle could be moved a few inches to the left. I know you were concerned with their placement.\" </p>\n<p>Louis glares at her. \"Please leave.\" </p>\n<p>Cackling, she backs out of the room, closing the door behind her. \"Be good,\" she sings from the hallway. </p>\n<p>Harry looks at Louis. \"Gargoyles, what?\"</p>\n<p>Louis sighs. \"I was brainstorming ways to reassert my masculinity after she pinned me.\" </p>\n<p>\"Oh, right.\" Harry laughs. \"You don't like being pinned down, then?\" </p>\n<p>Louis freezes and stares at him, cheeks definitely heat up. After a moment of silence, Louis laughs. \"You're such a jerk.\" </p>\n<p>Winking, Harry smiles back. \"I think I just got my answer.\" </p>\n<p>\"Whatever,\" Louis mutters. \"Henry VII.\" </p>\n<p>\"We haven't gotten there yet,\" Harry says, innocent. \"What were we talking about before Gemma walked in? I think that's where we left off.\"</p>\n<p>\"Oh?\" Louis arches an eyebrow. \"Do you want me to be your drama club senior then?\" </p>\n<p>Harry looks down at his knees again, a rueful smile on his lips. \"Nah, no, never mind. I'm being dumb again.\" </p>\n<p>Holding in his sigh, Louis leans forward again and tucks a curl behind Harry's ear. \"Hey, Harry, look. You're gonna have a lot of time to think about this, to figure out who you actually wanna kiss, you know? Don't worry so much about it.\" Louis shrugs. \"After my drama club boy, I didn't kiss anyone I actually, properly liked for two years.\"</p>\n<p>\"Really?\" Harry looks back up at him, eyes wide. \"Why so long?\" </p>\n<p>Louis chews on his lip and shrugs. \"I mean, you said it before, nobody's really out at school. There was this guy my junior year that I was kind of seeing for awhile, I guess, but it was super secret and he made it very clear that no one could know, and that's like. I mean, it's hot for awhile, you know? But it's just hard. He wouldn't even meet my mom. It's hard for awhile, I'm not gonna lie to you.\" He gives Harry a little half-smile. \"But, at the risk of sounding like a horrible, cringe-worthy cliche-slash-ad campaign, it gets better. Or so I hear.\" </p>\n<p>Harry huffs a little laugh and shrugs. \"I guess.\" </p>\n<p>\"Yeah.\" Louis considers Harry for a moment before reaching out and squeezing his hand. \"And, like, if you feel comfortable at all with this, Gemma has been amazing for me. I know she'd do the same for you. And, I mean... I'm always here for you. If you ever wanna talk. Or hang out. Or whatever.\" </p>\n<p>Squeezing Louis's hand back, Harry nods. \"Yeah... um. Do you think I could have your number? If that's cool?\"</p>\n<p>Louis smiles and tamps down the <i>oh my god a cute boy just asked for my number</i> swirl in his stomach with an iron fist. \"Shut up, obviously. Gimme your phone.\"</p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p>Louis gets home around 11 that evening, and after Gemma drops him off, he wanders through the dark house until he reaches his room, and immediately faceplants on his bed. </p>\n<p>He almost kissed Harry. He almost kissed Gemma's little brother Harry. He almost kissed Harry and Harry didn't freak out; Harry actually <i>wanted</i> to kiss him. Louis lets out a little scream into his pillow. Harry <i>wanted</i> to kiss <i>Louis</i>. </p>\n<p>Gemma grilled him on the drive to his house. She wanted to know everything Harry said, everything Louis said, everything that happened. Louis has never, ever kept anything from Gemma before. Even before he felt ready to tell his mother that he wanted to kiss boys, Gemma knew. Gemma knows everything first, with priority express mail. She knows every boy Louis has ever had a crush on, she knows all about the mess with Reid during junior year, she knows he kissed Aiden at a drama club party three months ago. She knows everything, and this was the first time Louis honestly couldn't tell her something. </p>\n<p>He told her that he and Harry just studied, that it was fine, that nothing happened. He assured her he definitely did not jump Harry's bones. It was hard, though. He'd never betray Harry; he'd never out him before he was ready. He definitely understands how hard it was for Harry to say all that to him tonight, but... It's so hard holding it in. It's so hard because a cute boy wanted to kiss him and he just wants to analyze every moment of it with his best friend. </p>\n<p>Letting out a huge sigh into his pillow, Louis closes his eyes and tries to relax. Tries to remind himself that Harry has a crush on some boy that he's liked for years. Tries to remind himself that he was going to be Harry's experiment. Tries to remind himself that being the experiment never ends very well for him. </p>\n<p>All of his reminders have a clever harmony of <i>cute boy almost kissed me</i> running over the top. Louis screams a little more. </p>\n<p>After a half an hour of Louis's mind and body betraying his sense of rational thought, Louis pulls off his clothes and sits on his bed in sweats and a too-small batman teeshirt, staring at the slightly crumpled, ratty map of the United States that's pinned to his wall. It's from his dad's glove compartment, and it's one of the only things of his that Louis has. </p>\n<p>His phone buzzes beside his thigh. He checks it, and it's from a number he doesn't have saved. It says, <i>Hey, wait, there's one more thing I wanted to ask you..</i></p>\n<p>Louis furrows his brow. <i>is this Harry ?</i></p>\n<p>Almost immediately: <i>Yeah.. could you come outside? I'm at the corner haha</i></p>\n<p>Something hot and slightly reminiscent of excitement swoops through Louis's stomach. He grabs a hoodie from where it's draped over his desk chair and sticks his feet in a pair of ratty old toms. He creeps silently back through the dark house, avoiding the third step that creaks, and holding his breath past his mom's room. He doesn't latch the front door all the way, because no matter how gently he tries to close it, it always makes a loud thump throughout the whole house. </p>\n<p>Harry's leaning against Gemma's car when Louis gets to the corner and Louis shoves his hands in his pockets, trying to calm his heartbeat. He smiles, but it's shaky. \"What's up, Harry?\" he says.</p>\n<p>Harry smiles back, and it looks just as nervous. \"I... god.\" He pushes a hand through his hair, but it all flops immediately back down over his forehead. \"I was just wondering if you had a date to homecoming?\" </p>\n<p>Louis stares at him. \"What?\" </p>\n<p>Harry freezes and looks down at his feet. His broad shoulders bob up and down a little bit. </p>\n<p>\"Harry,\" Louis says gently. \"Don't you wanna ask someone you actually like? I mean... I'm flattered, don't get me wrong, but. I don't want you to do something you'll regret, you know?\" </p>\n<p>Harry's quiet still, not looking at Louis. </p>\n<p>\"And,\" Louis continues, lowering his voice to just above a whisper, \"I don't really want to be your trial date.\" </p>\n<p>Now Harry looks up, and a wry grin has replaced the nervous smile from before. \"Louis, I've had a crush on you since I was in sixth grade. I've had a few trial dates, I think.\" </p>\n<p>It's Louis's turn to freeze. He stands there, four feet from Harry, and Harry's words are hanging in the air between them. Louis wants to reach out and grab them, shove them next to his heart and keep them forever. \"What?\" </p>\n<p>Harry shrugs. \"I dunno. You were always funny and loud and <i>nice</i> to me. Gemma's friends were never nice to me, you know? You were just so nice and confident and I loved it when you were around, but, like. I don't know. I didn't wanna annoy you.\" Harry laughs a little. \"So I sort of hid in my room and tried to think of excuses to talk to you.\" </p>\n<p>Louis stares at him. </p>\n<p>\"So.\" Harry shrugs again, looking straight at Louis. \"Would you like to go to homecoming with me? There's nobody else I'd like to go with.\" </p>\n<p>Taking in a shaky breath, Louis blinks a few times before walking forward the four feet and reaching his hands up to cup Harry's neck. \"'M glad you're not scared of me anymore,\" Louis murmurs. He lifts himself up on his toes and presses a soft kiss to Harry's lips. </p>\n<p>Harry's hands immediately grasp Louis's hips, pulling him in a little closer and ducking down, so Louis can rock back onto his heels. Louis wraps his arms around Harry's neck and deepens the kiss, parting his lips slightly and tugging Harry's lower lip between his own, tongue flicking out to taste it. Harry sighs and wraps his arms fully around Louis's waist, and after a few moments of kissing, Harry pulls back and buries his face into Louis's neck. </p>\n<p>\"Hi,\" Louis says into Harry hair, smiling. </p>\n<p>\"Hey,\" Harry says, kissing Louis's neck. </p>\n<p>\"You know,\" Louis says, after a few beats of silence. \"I was meant to go to homecoming with Gemma. She's not going to take kindly to this.\" </p>\n<p>Underneath Louis's arms, Harry shoulders shrug. \"My friend Niall has a massive crush on her. He'd be fuckin' thrilled if I said he could ask her.\" </p>\n<p>Louis tugs Harry's face back up level with his own and plants another quick kiss on his lips. \"You're so wonderful.\" </p>\n<p>Harry just smiles down at him, eyes warm and bright under the streetlights in the chilled September night. \"Wanna come home with me? I have a gargoyle that needs to be moved.\"</p>"
}