{
  "id": "1019956",
  "url": "https://archiveofourown.org/works/1019956?view_full_work=true",
  "author": [
    "s0mmerspr0ssen"
  ],
  "title": "cast out fear",
  "rating": "Mature",
  "archive_warnings": [
    "Graphic Depictions Of Violence"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Star Trek: Alternate Original Series (Movies)"
  ],
  "relationships": [
    "James T. Kirk/Spock",
    "James T. Kirk Prime/Spock Prime"
  ],
  "characters": [
    "Amanda Grayson",
    "Sarek",
    "Leonard McCoy"
  ],
  "additional_tags": [
    "Minor Character Death",
    "Aftermath of Torture",
    "Post-Traumatic Stress Disorder - PTSD",
    "Angst",
    "Hurt/Comfort",
    "Vulcan-centric",
    "Big Bang Challenge",
    "Alternate Universe - Canon Divergence"
  ],
  "language": "English",
  "series": "",
  "published": "2013-10-27",
  "completed": "2013-10-27",
  "words": "42,268",
  "chapters": "7/7",
  "comments": "429",
  "kudos": "10,080",
  "bookmarks": "3,097",
  "hits": "164,889",
  "summary": "<p>Kirk saves Vulcan from Nero at high cost to himself. It falls to Spock to pick up the pieces.</p>",
  "notes": "<p>This fic was written for the <a href=\"http://startrekbigbang.livejournal.com/profile\" rel=\"nofollow\">Star Trek Big Bang 2013</a>. ♥</p>\n<p>The title stems from one of Surak’s teachings: <i>Dakh'uh pthak. Nam-tor ri ret na'fan-kitok fa tu dakh pthak. </i> -- “Cast out fear. There is no room for anything else until you cast out fear.”</p>\n<p>Where I thought it necessary, I have added translations for the Golic Vulcan used in this fic at the end of each chapter. My knowledge of the Vulcan language as well as some of its culture, customs, food, etc. mostly comes from these great pages:</p>\n<p>They are also the sources of most of my language definitions used in the notes of this fic. All mistakes made in implementing them into this fic/using them/changing them about to fit my purpose are my fault, though. I have also attached further notes about this story at the end of some chapters.</p>\n<p><b>Beta:</b> <a href=\"https://archiveofourown.org/users/ObsidianEmbrace/pseuds/ObsidianEmbrace\" rel=\"nofollow\">ObsidianEmbrace</a><br></p>\n<p><br><b>Fanmix:</b> <a href=\"http://ninety6tears.livejournal.com/151758.html\" rel=\"nofollow\">listen to it here</a> (by ninety6tears)<br><b>Art: </b><a href=\"https://xxsteffiexx.tumblr.com/post/65630131742/here-is-my-art-for-star-trek-big-bang-read-the\" rel=\"nofollow\">look at it here</a> (by hopebetterdays)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p><i>kaiidth</i> = Vulcan philosophy: “What is, is.” (from <i>kya</i> = to exist)</p>\n<p>\u2028Spock to Sarek: <i>Dif-tor heh smusma, osa-mekh.</i> = “Live long and prosper, honored father.”\u2028<br>Kirk to Sarek: <i>kevet-dutar</i> = Ambassador<br>\u2028\u2028Sarek: <i>La’rom’lasha.</i> = formal: lit. “(I/we) welcome (you) here.” (Upon guests’ arrival.)<br>Kirk: <i>La’ertau sochya t’okelek</i> = formal: (if at a home) lit. “(I/we) disturb the peace of your honorable home.”</p>\n<p>\u2028Kirk to Spock: <i>Wa’paitaren du.</i> = informal: “Thank you very much!” (lit. You (are) very much appreciated!)\u2028\u2028</p>\n<p><i>thas t’kheh</i> = lit. “milk of <i>kheh</i>”, whereas <i>kheh</i> is a sort of Vulcan grain; I totally made this dish up\u2028<br><i>pla-savas</i> = lit. “blue fruit”; a sweet type of Vulcan fruit\u2028<br><i>floku</i> = Vulcan equivalent of a spoon\u2028</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p><i>osa-su</i> = gentleman/sir (literally “honored man”)<br><i>oko-su</i> = lady/madam (literally “honored woman”)</p>\n<p>Reference for <i>loshirak</i> is the yoga pose <a href=\"http://www.yogajournal.com/poses/486\" rel=\"nofollow\">Bound Angle Pose</a>; other people have <a href=\"http://syvak.wordpress.com/krakroa-whltri/\" rel=\"nofollow\">likened the Vulcan <i>loshirak</i> to the Zen-Lotus pose</a>, but I liked the ‘easier’ version better, especially as it’s apparently taught to children at a young age.</p>\n<p>As for planet-to-ship communication while Jim is falling towards Vulcan, I went with the inconsistency already present in the 2009 movie. It seems like Kirk is still able to communicate with the <i>Enterprise</i> as he is falling towards Vulcan with Sulu, so I reckoned we can all ignore that the comm device was much more likely to be attached to the helmet instead of the ear (and that in the latter case, it would have been invisible) to make the story work. ;)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p><i>Orensu</i> = students<br><i>Pafam-t'san s'at.</i> = Deficient emotional control.<br><i>Ha, osavensu</i> = Yes, honored teacher.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">notes</a>.)\n</p>\n<p><i>kolinahru</i> = somebody who has mastered the discipline rigorous training program to purge oneself of all emotion</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">notes</a>.)\n</p>\n<p>Aaaaand we’re done. Wow. This was long (double-big bang!). I really liked playing with the idea of saving Vulcan (surely something we all wished for at some point) and how it would impact Jim and Spock and their potential relationship.</p>\n<p>Big thanks to my wonderful Beta, ObsidianEmbrace, and my artist and fanmixer. :) It was a great round!</p>\n<p>I really hope you enjoyed. Thanks for reading. &lt;3 Don't forget to <a href=\"https://xxsteffiexx.tumblr.com/post/65630131742/here-is-my-art-for-star-trek-big-bang-read-the\" rel=\"nofollow\">look at the art</a> and <a href=\"http://ninety6tears.livejournal.com/151758.html\" rel=\"nofollow\">listen to the mix</a>! :)<br>You should also check out the other stories at <a href=\"http://startrekbigbang.livejournal.com\" rel=\"nofollow\">STBB</a>.</p>\n<p><b>Update 2023</b>: I just want to say <b>thank you</b> to all the people who have been leaving kudos and comments on this fic, even after a decade of it having been posted! This fic was my first big bang, my first long writing project that I didn't post as a WIP and it is really dear to me. I love that there suddenly seems to be renewed enthusiasm for this story. Rest assured, even if I don't reply to them all, I do read all your comments with great delight and the ones that tell me they are re-reading the fic are especially amazing! Thank you all! 💖💖💖</p>",
  "text": "<p>Jim awoke and instantly noticed that he was tied down.<br><br>\nHe was used to that by now, except that the wide circles keeping his wrists and ankles carefully in place were of a much softer material than usual. They felt sturdy and tight on his skin, but nothing like the shackles the Romulans had used so far.<br><br>\nHis heart jumped in his chest as memories assaulted him: his own hoarse screams ringing in his ears, his body convulsing with pain, cruel grins on sharp faces.<br><br>\nTrembling, Jim forced himself to stay calm and assess his environment instead of letting himself panic. For once, he wasn’t in any serious pain. He wasn’t being strangled, cut, beaten or otherwise tortured.<br><br>\nClearly, something had changed. Jim could not let that opportunity pass.<br><br>\nThere was grit in his eyes, blurring his vision. Jim squeezed his eyelids closed and opened them again until the worst had passed and he could look around without it stinging too badly.<br><br>\nIt was clear he had been moved. There were no black cables and tubes above him, no musky blue lights, no sounds of machinery, no warp drive humming. Instead, the room was engulfed in a pleasantly orange hue. All was quiet. Jim couldn't hear anything besides his own muted breathing and the rush of blood in his ears.<br><br>\nOr ear, he realized. Only the right one was picking up on sounds. His left ear did not seem to function properly. He felt the sudden urge to jam a finger into it to get rid of the numbness, but his wrists were caught in his restraints.<br><br>\nRight. Tied down. He was still a prisoner.<br><br>\nAnother burst of panic threatened to constrict his throat, to break the control on his breathing and make him thrash, but he didn't let it. There was nobody here ready to torture him right now. He was not in any pain, unless he counted a slight headache and the odd feeling in his left ear.<br><br>\nHe hadn’t been this lucid in, what, weeks? Months? He had to stay calm, make the best of it.<br><br>\nOnce he made sure nobody was concealing themselves in the room, he might be able to risk moving his head to get a better view of his new surroundings. Might even find a means to escape. For that plan to succeed though, he would need to stay still a little longer and simply wait; assess.<br><br>\nHe counted to a hundred in his head, then back to zero.<br><br>\nStill, there was no noise, no sign of an imminent attack, no threat of strong hands grabbing him. Finally bracing himself, Jim very carefully curled his neck, lifted his head off its bedding and turned it to his right.<br><br>\nThis was definitely not Nero's ship. Instead, there were dark brown walls and an egg-shaped window that allowed warm sunlight to filter into the room. Jim made out what looked like the back of a monitor to his right. The cot he was lying on, he realized, had to be some sort of biobed.<br><br>\nNow that he thought about it, it was a lot more comfortable than the hard, unyielding rack Nero's men had strapped him to.<br><br>\nFailing to suppress a full-body shudder, Jim was startled by a short but clear beeping noise echoing through the room. Flinching, Jim let his head fall back onto the cot immediately, ceasing all movement.<br><br>\nNot a second later, Jim could hear rapid footfalls.<br><br>\nClosing his eyes and schooling his features into what he hoped was a natural looking representation of unconsciousness, Jim forced himself to relax on the bed. Whoever was approaching unerringly made their way towards him until Jim seemed to sense their warm presence on his skin.<br><br>\n\"You are awake, <em>oveh</em>.\"<br><br>\nJim did not move, though his thoughts were racing. Whoever it was that had approached spoke only slightly accented Standard. If he knew for sure it was a Humanoid speaking, he'd say it was a female.<br><br>\nThere had been no females on Nero's ship as far as he had known. Still, this might very well be a trap. He was tied down in an unfamiliar location with no memory of how he had got here. Anything might have happened to him.<br><br>\n\"You are afraid. <em>Dakh'uh pthak</em>. No harm will come to you here.\"<br><br>\nA spark of knowledge lit up Jim's mind. <em>Pthak?</em> Dimly remembering his Golic lessons from his second year at the Academy, he was almost completely sure it was a Vulcan word, meaning <em>fear</em>.<br><br>\nHis captors were … Vulcan? From the clipped but calm tone of the voice, it seemed possible. Yet it made no sense at all. Why would Vulcans tie him down like a prisoner? It was more likely the Romulan language shared some features with Vulcan, given their common ancestry. Just because Jim had been too out of it to pick up on it before didn’t have to mean it wasn’t true.<br><br>\n\"I see you are not assured of my good intentions, <em>oveh</em>,\" the voice continued, betraying no emotion. \"I shall return with somebody in which you might have more faith.\"<br><br>\nAs the sounds of footsteps faded away again, Jim risked a glance. He was too late though, only catching a glimpse of Human-like limbs, a blue robe and a head of dark hair before they were gone. Not much to go on. Might as well be any Humanoid species in the galaxy. Might very well be a Romulan.<br><br>\nMight also be a Vulcan. Maybe they had finally come and--<br><br>\nNo. It was stupid to get his hopes up. The first thing he had told himself after waking up on Nero's ship was that he could not hope, that he was for all intents and purposes already dead. He had effectively committed suicide. He could not show weakness by expecting Starfleet to rescue him, could not give Nero something to exploit.<br><br>\nHe'd bet good credits that that was what the Romulans were hoping for: make him feel safe, only to go for another round of mindless torture. In the end there, he hadn't really been aware of anything but pain anymore. Perhaps they wanted him lucid before they continued to make him scream.<br><br>\nJim's hands involuntarily curled into tight fists as phantom pain seemed to seep through every part of his body, shaking him.<br><br>\nMaybe Nero had brought him to this universe's Romulus to nurse him back to health. To be able to break him again, torture him anew. An endless cycle. It would explain the sickbay-like surroundings, the different light, the lack of pain.<br><br>\nA cold shiver ran through Jim's frame and his breath hitched.<br><br>\nMore footfalls, and he hurriedly forced himself to relax again, slackening his face as far as possible. His heart was still racing, though. If this was indeed a biobed, the readings had to be off the chart. Nobody would believe he was still out of it. It was ridiculous. He wouldn't be able to keep up the charade, but being tied down and completely disoriented, he didn't have a much better plan at hand.<br><br>\nAgain, somebody was standing next to his bed.<br><br>\n\"There is no reason to fear, Mr. Kirk.\"<br><br>\nJim's eyes flew open instantly.<br><br>\n\"<em>Spock?</em>\" he croaked.<br><br>\nHis voice sounded like somebody had stepped on broken glass. Jim coughed, feeling like something had caught in his throat, choking him. Unable to hold up a hand as he was tied down, he helplessly convulsed on the cot as one cough turned into a small fit.<br><br>\nSteady hands pressed instantly against his chest, gently but firmly keeping him down until the worst had passed. Though they did nothing but hold him in place, the hands felt soothing. Pleasant cool bled through whatever it was he was currently wearing, seemingly easing the pain inside.<br><br>\nVery slowly, Jim relaxed against the cot.<br><br>\n\"Spock,\" he repeated wheezily, eyes teary.<br><br>\n\"Yes, Mr. Kirk,\" Spock said. \"It is very satisfactory to see you awake and lucid.\"<br><br>\nJim could do nothing but stare at the Vulcan. He looked almost exactly like Jim remembered him from the hearing and the <i>Enterprise</i>: slanted brows, straight bangs, severe expression, except that his Starfleet uniform was missing. Instead, he was wearing what seemed to be simple gray robes.<br><br>\n\"I'm on Vulcan?\" Jim managed through his aching throat.<br><br>\n\"Affirmative, Mr. Kirk. You have been recuperating in Shi'Khar Hospital for the past two weeks.\"<br><br>\n\"Hospital?\" Feeling slightly light-headed, Jim tugged at his wrists. \"Why did they tie me down then?\"<br><br>\n\"I am afraid you have been rather violent towards the staff so far. We assume you mistook the healers for Romulans, given our shared physiological traits. Now that you are clearly lucid, I will of course advise Healer T'Lkai to free you from your bonds at once.\"<br><br>\nBefore Jim could reply, Spock had stepped away and called out in Vulcan. Moments later, a slender figure appeared in Jim's line of sight.<br><br>\nAnother Vulcan, black hair placed high on her head in an immaculate bun, looked down at him, face utterly neutral. Her skin was darker than Spock’s, more like milky coffee, and she was wearing blue robes along with white gloves. Jim assumed that she had to be the one who had fetched Spock after he had not responded to her.<br><br>\n\"I shall free you from your restraints, <em>oveh</em>,\" she stated after offering the <em>ta’al</em> in greeting, proving Jim correct when he recognized her voice. She spoke a brief Vulcan command towards something above Jim's head. With a beep and a loud click, Jim was suddenly released from his ties.<br><br>\nShakily, he tried to sit up, but his muscles and joints protested as he moved. All he managed was to edge upwards a bit, somewhat relieving the awkward angle of his neck.<br><br>\n\"Let me assist you.\"<br><br>\nBefore he could brace himself, T'Lkai had placed her gloved hands under his armpits and effortlessly lifted him up until he rested comfortably against the head of the biobed. Jim blinked. For a moment, he had forgotten not to underestimate a Vulcan's strength. No matter how slender their build, they would still be much stronger than even the best-trained human.<br><br>\nSwallowing roughly, Jim summoned what little Vulcan he remembered right now and said: \"<em>Cha't t'naat.</em>\"<br><br>\nT'Lkai looked at him for a long moment, then nodded once.<br><br>\n\"One does not thank logic, <em>oveh</em>,\" she said neutrally and, oddly enough, bowed briefly at him. She then nodded at Spock and left without another word.<br><br>\n\"I think I offended her,\" Jim said quietly, once the healer had left the room.<br><br>\n\"On the contrary,\" Spock replied calmly. \"I assume she was merely surprised you made the effort to speak Vulcan and used the formal, honorific form to express your gratitude.\"<br><br>\n\"Shouldn't I have? From what I gather, she's my doctor, right?\"<br><br>\n\"Among thirteen other healers, yes. Do not concern yourself, Mr. Kirk. You caused no offense to her.\"<br><br>\n\"She called me … what, <em>oveh</em>? I don't think I remember that word from Golic lessons. What does it mean?\"<br><br>\nSpock's eyebrows twitched very slightly. \"It means <em>honored one</em>. A title meant to show great respect for the person addressed.\"<br><br>\n\"Huh,\" Jim said, perplexed.<br><br>\n\"As I said, do not concern yourself. Surely, you must have more pressing questions at this moment.\"<br><br>\n\"Yes. How am I here? I mean, how did I … damn, what's wrong with my ear?\" Aware again of the numbness, Jim reached up to prod his left ear. Except there was nothing to touch. With a sinking feeling, Jim ran his fingers over the place where his ear shell should be. Instead of flexible cartilage, all he encountered was raised, hard skin, coarse hair and what had to be gauze dressing. Jim could not suppress a slight shriek. \"What <em>happened</em>?\"<br><br>\n\"You do not remember?\" Spock asked, stepping up to the bed and abandoning his stiff posture as he bowed closer in inquiry.<br><br>\n\"I …\" Jim started, then stopped. His headache flared up with a vengeance. Suddenly, he felt sick. Very sick. \"I think … I think I'm going to throw up …\"<br><br>\nSpock moved incredibly quickly. When Jim turned to the side and over the bed, a metal bowl was already waiting for him. He retched for several minutes. He spit nothing but bitter bile.<br><br>\n\"Sorry,\" he croaked miserably when the worst had passed, blinking down into the gross pan until Spock removed it from his sight. He was offered a small, grey washcloth instead. Jim shakily took it and ran it over his sticky mouth.<br><br>\n\"No offense where none is taken,\" Spock replied neutrally and removed the towel from Jim's hands once he was done. \"You are still ill, Mr. Kirk. It is only to be expected after what you have lived through.\"<br><br>\nRunning a trembling hand over his face, Jim shook his throbbing head. When he dropped his hand in his lap, he realized there was a small infusion device taped down on its back with no capsule attached. He didn't try to touch his deaf ear again.<br><br>\n\"So … somebody saved me?\" he finally ventured a guess when both the headache and his upset stomach seemed manageable again. \"From the <em>Narada</em>?\"<br><br>\n\"Affirmative. However, this is not a conversation to have quickly or lightly. If you are agreeable, I will call for the available healers. They will make sure you are fit for longer conversation and inform you of your current physical condition. If they find you to be strong enough, I shall explain to you everything that has transpired to the best of my knowledge.\"<br><br>\n\"But … hell, is everybody okay? Bones -- I mean, Dr. McCoy? Sulu? Uhura? What about the <em>Enterprise</em>?\"<br><br>\nSpock held up a hand.<br><br>\n\"All will be explained in due time,\" he said. \"Please be patient and let the healers assess your health first.\"<br><br>\n\"Can you at least tell me if everyone’s alive? What about Pike?\"<br><br>\n\"All will be explained,\" Spock repeated and turned to leave, taking the soiled bowl and towel with him.<br><br>\nFrustrated and confused, Jim sank back against the head of the cot, feeling weak and awkward and horrible. His stomach still felt queasy. Hopefully, he wouldn't end up vomiting all over the Vulcan healers.<br><br>\nAs it turned out, Spock had not been inaccurate when he had called Healer T'Lkai one of many assigned to him. Shortly after Spock left, a group of no less than eight Vulcans of various ages entered, filling the room almost to full capacity. All of them were wearing light blue or green robes along with white gloves. They did not look like regular medical gloves.<br><br><em>Touch telepathy</em>, Jim remembered as he watched them form the <em>ta'al</em> with their hands. He quickly fumbled to return it, not sure if it ended up passable. His fingers felt a bit odd.<br><br>\nT'Lkai took her place on his right, next to the monitor.<br><br>\n\"We will aspire to speak Standard for your sake, <em>oveh</em>,\" she informed him briefly, before turning to the other Vulcans. \"Mr. Kirk woke approximately eighteen minutes ago. While he did not reply to my initial queries, he responded clearly and in a lucid fashion to the voice of S'chn T'gai Spock with whom he is more familiar. No violent outburst occurred. Mr. Kirk has since been freed from his ties and appears far less agitated than on previous occasions. Though his emotional control is still lacking, rational conversation is possible.\"<br><br>\nJim eyed the other healers, trying to gauge their reaction to T'Lkai's short speech. True to their Vulcan heritage, none of them showed so much as a frown.<br><br>\n\"Your vital signs have much improved. Are you feeling any pain, <em>oveh</em>?\" an elderly healer asked from his left. Jim awkwardly turned his head to catch it, given the lack of input from his left ear.<br><br>\n\"Bit of a headache,\" Jim informed him, voice still rough. \"Also, I just threw up. Um, sorry about that. And my left ear? I can't hear anything, and … well …\" He gestured weakly at the side of his head.<br><br>\n\"Your left ear has suffered considerable damage. Your tympanic membrane has been forcefully pierced and the outer shell cut off completely. We have as of yet made little attempt to heal it, only prevented infection and additional damage. Restorative measures require the patient to be at least somewhat lucid.\"<br><br>\n\"But you <em>can</em> fix it, Healer … um …?\" Jim trailed off awkwardly, realizing he did not know the elderly Vulcan's name.<br><br>\n\"You may call me Healer Serran, <em>oveh</em>,\" the Vulcan replied. Faintly, Jim remembered something about unpronounceable Vulcan names and Standard approximations. \"As for your query, the answer is yes. We can heal it, at least to some extent.\"<br><br>\n\"To some extent? What does that mean?\"<br><br>\nSerran’s expression didn’t change as he explained: \"Restoring the shell will be little work. We will extract a small amount of elastic cartilage from your body, then grow and form a new shell, which we will attach to your head after removing the scar tissue. However, the likelihood of restoring full hearing capacity is less than 1.8 percent. You arrived too late for us to properly mend the delicate membrane. Therefore, we will have to rely on a less effective technological aid.\"<br><br>\nSwallowing, Jim nodded. \"Okay. Anything else I should know about?\"<br><br>\n\"Nerve damage,\" another healer spoke up. With her straight hair chopped off sharply by her chin, she looked even more severe than most Vulcans Jim had seen in his life. \"We assume they are the results of torture through electrical charges. You may expect some level of loss in your fine motor skills. Both hands are affected. Though the exact ratio can not be determined yet, I estimate a decrease of sensation in your fingers by as much as 38.3 percent.\"<br><br>\nAnd on and on they went. Two right toes seemed to be missing, though the gray-haired healer at the foot of the bed seemed confident that they, too, could be regrown from other tissue and reattached. Thirty-two complex bone fractures, all mended. Malnutrition and insufficient weight, though also easily improved by proper nourishment and further infusions. Battered immune system, something to work on gradually. Damage to the heart and kidneys, already healing, but possibly requiring several weeks of supervision and medical assistance.<br><br>\nAnd of course, psychological repercussions: partial amnesia, heavy trauma, shock. Jim was told in very sober terms that he had in turn attacked his healers and pissed himself out of fright for the past fortnight. He knew his cheeks were burning by the end of the sober report.<br><br>\nWhen the healers had no more explanations or questions to offer, T'Lkai ran several tests with a scanner attached to the bed, checking the slim monitor by its side for results. Unlike the biobeds on the <em>Enterprise</em> and in the Academy sick bay, the Vulcan kind didn't make much noise. Jim couldn't even hear his own heartbeat echoed back at him.<br><br>\nT'Lkai's face, of course, gave nothing away as she studied the screen, tilting it so some of her colleagues could also have a look.<br><br>\nWhen the healers finally left him with a new infusion capsule attached to his hand, all of them bowed slightly or offered another <em>ta’al</em> before they turned away from Jim's bed. Distracted, Jim managed another <em>thank you</em> in what was possibly very ill-pronounced Vulcan.<br><br>\nHis mind was whirling. Missing toes. A cut-off ear. Organ damage. Trauma. What a fucking nightmare. By the end of his medical lecture, Jim's headache had worsened considerably, though he had been too overwhelmed to ask for medication or even a glass of water for his sore throat.<br><br>\nLuckily, Spock returned almost as soon as the doctors had gone on their way. \"The healers inform me you are fit for further conversation,\" he said, face as expressionless as before.<br><br>\n\"Yeah, let's talk,\" Jim said. \"But can I have some water first, please?\"<br><br>\nThe slightest of frowns appeared on Spock's forehead, though it smoothed out again almost instantly. \"They did not offer any to you?\"<br><br>\nMutely, Jim shook his head. Spock stepped out again briefly, returning with a rectangular glass of clear water. Jim took it gratefully, forcing himself not to gulp it all down at once. He didn’t want to throw up in front of Spock again. Instead, he savored the cool drink, letting the water run slowly over his tongue. It had an odd but not unpleasant earthy taste to it.<br><br>\n\"You must not think ill of our healers, Mr. Kirk,\" Spock said as he watched Jim drink with scrutinizing eyes. The attention was almost disconcerting. \"A highly superficial but effective mind meld is usually initiated between patient and healer upon hospitalization. Vulcan doctors also remove their gloves and consciously touch their patients during rounds to receive more information. It is considered less trying for the injured and an infinitely more accurate way to communicate about one's ailments. However, as you are human and cannot shield your mind from further intrusion, they neither melded with nor touched you and are therefore not completely informed of your needs. I will remind the staff of your special circumstances and recommend a more direct and vocal approach.\"<br><br>\nJim nodded thoughtfully. \"Couldn’t they just have done it anyway? If it’s just a brief touch, I probably wouldn’t even have noticed.\"<br><br>\n\"Such violation of privacy would go against every Vulcan ethical code on telepathy we hold.\"<br><br>\nThough the tone of Spock’s voice had hardly changed, Jim could not help but feel as if he had just been chided sharply.<br><br>\n\"I'm sorry,\" he said quickly, hands curling around the glass. His fingertips felt even more numb than usual. \"I didn't mean to imply anything.\"<br><br>\nSpock seemed to stand up straighter, although how that was supposed to be possible given his already perfect posture, Jim did not know.<br><br>\n\"Do not apologize,\" Spock said. \"<em>Oveh</em>.\"<br><br>\n\"You as well now? The healers kept calling me that, too,\" Jim pointed out with a tired smile. \"<em>Honored one</em>, right? Do you talk to all of your patients this way?\"<br><br>\n\"No,\" Spock said evenly. \"Only the ones who have made the choice to sacrifice their own life to rescue our planet and entire people.\"<br><br>\nJim's eyes moved down to the glass clutched in his hands. \"Oh,\" he said.<br><br>\n\"It is but a small way to convey our infinite gratitude. The Vulcan people are deeply in your debt, James Tiberius Kirk.\"<br><br>\nJim squirmed on the bed, watching the small pearls of liquid run through the thin tube of the infusion device. He suddenly felt incredibly uncomfortable.<br><br>\n\"It was my job as a member of Starfleet,\" he reminded Spock.<br><br>\n\"It was your duty to try and disengage the drilling platform to the best of your abilities. It was not your duty to go after the device containing the red matter. Neither was it your duty to ask to be beamed into open space without sufficient safety gear. Neither did you--\"<br><br>\n\"Please stop,\" Jim said, squeezing his eyes shut. He didn't want to hear it. Couldn't hear it. Not now.<br><br>\nSpock immediately fell silent. After a minute or so had passed, he continued with a much softer voice: \"I have upset you, <em>oveh</em>. I apologize.\"<br><br>\n\"It's fine,\" Jim managed. God, his head was killing him. \"Hey, you think you can get me something for my headache, too? It really hurts …\"<br><br>\n\"Of course. As I said, I shall speak to the healers to ascertain a more direct approach to your needs in the future.\"<br><br>\nAgain, Spock left, only to return several minutes later with a carafe of water and a small pill.<br><br>\n\"We have been informed of your aversion to hyposprays,\" Spock told him as he gracefully filled up Jim's glass. \"This should for now be sufficient to your pain.\"<br><br>\n\"Bones told you that?\" Jim asked, accepting the medicine as it was dropped on his open palm. \"I mean, Dr. McCoy. Did he tell you about my allergies as well?\"<br><br>\n\"It was indeed Dr. Leonard McCoy who provided us with all relevant medical information,\" Spock said. \"He is well, too, to answer your earlier question. As are Lieutenant Uhura and Lieutenant Sulu.\"<br><br>\nSwallowing the pill, Jim grimaced as it seemed to rub against his sore throat.<br><br>\n\"Pike?\" he asked weakly, though he felt he already knew the answer.<br><br>\n\"I am sorry to inform you that Nero killed Captain Christopher Pike almost as soon as he captured you.\"<br><br>\nJim bit his lip. Harshly.<br><br>\n\"Shit,\" he finally said, his vision blurring. \"Shit shit shit. <em>Fucking bastard.</em>\" He swallowed. \"How many … how many altogether?\"<br><br>\n\"The battle resulted in the loss of 1.864 lives, including 45.3% of the senior cadet class.\"<br><br>\nJim had a hard time breathing just then. Nearly 2000 people dead. He’d have to go through the lists, see whose funerals he had missed.<br><br>\n\"It might be of interest to you that Nero himself is also dead,\" Spock added when Jim said nothing further.<br><br>\nJim barked out a dry laugh. \"Of interest, yes,\" he spat. \"Fuck yes. Dead, really? Was it painful at least? Serves him fucking right if it was.\"<br><br>\n\"His death was clean and swift.\"<br><br>\nJim blinked against the moisture stinging in his eyes. \"Yeah?\" he asked roughly. \"How d'you know that?\"<br><br>\n\"It was I who ended his life,\" Spock replied evenly, looking straight at him.<br><br>\nBaffled, Jim stared at him, hoping for elaboration. None was forthcoming though, and Spock's expression gave nothing away. Jim could detect no remorse, no sign of Spock regretting his actions. Neither, however, did he seem satisfied about it.<br><br>\nOf course, Jim knew about the Vulcans' distaste for violence and their utter condemnation of murder. He had in fact never heard of a Vulcan killing anybody in cold blood.<br><br>\n\"Sorry you had to do that,\" Jim heard himself say before he could think better of it.<br><br>\n\"I am not.\"<br><br>\nJim blinked. For a Vulcan, that had to be a deeply private admission. He suddenly realized how intimate their conversation had been so far, especially given their rather short but colorful history. Taking another sip of water, Jim looked away again, grasping for a better topic.<br><br>\n\"Where are they now? Bones and the others, I mean.\"<br><br>\n\"They returned to Earth 6.8 Standard days ago. Starfleet requested their presence at the Academy. They had already stayed far longer on Vulcan than strictly necessary, but seemed rather anxious to see you in good health before returning home.\"<br><br>\n\"They helped rescue me?\"<br><br>\n\"Affirmative. It was a small but determined party, among them Lieutenants Uhura and Sulu as well as your friend Dr. McCoy.\"<br><br>\n\"Should call them then, probably. Thank them, tell them I'm still in one piece.\" Jim nearly laughed at himself. \"Well, mostly.\"<br><br>\n\"That can be arranged. Now, however, I advise you to try and sleep. Your hands are trembling and you seem very fatigued.\"<br><br>\nJim stared at his hands still curled around the glass. They were indeed shaking. \"Yeah, okay. Should probably rest.\"<br><br>\nHe let Spock take the glass, careful not to touch his skin. Awkwardly, he shifted on the bed until he was lying on his back again, adjusting the thin sheet serving as his cover.<br><br>\n\"I shall return when you are better rested, <em>oveh</em>,\" Spock said quietly.<br><br><em>Don’t call me that</em>, Jim wanted to say, but felt too exhausted.</p>\n<p></p>\n<p>__ __ __</p>\n<p><br>\nHe looked horrible, Jim concluded when he stared into the bathroom mirror.<br><br>\nThree days of strict bed rest, and the Vulcan healers had finally allowed him to get up and walk as far as the adjacent facilities and the window in his room. They had, however, asked him not to go for any extended walks. Seeing his own reflection, Jim could not entirely disagree with their order.<br><br>\nHe was thin, although not scarily underweight. His skin was very pale, which only emphasized the dark circles under his eyes. The patch on the left side of his head hid the scar where the ear was supposed to be. His feet looked weird, too, given the still missing toes.<br><br>\nAll in all, he appeared rather weak and brittle. He didn't feel much better, either. At least, he was assured that both his ear and toes were growing in some laboratory at this very moment and would be ready for reattachment by the end of the week.<br><br>\nSighing, Jim stepped into the sonic shower to finally clean himself without the help of the staff.<br><br>\nHe had soon realized that the Vulcans had gone out of their way to make him comfortable and assure his well-being. His room was a private medical suite, reserved for high-ranking Vulcans and honored guests. They had adjusted its room temperature to suit his Human needs, which undoubtedly meant they themselves were at least uncomfortable whenever they checked up on him. Which was very often.<br><br>\nJim was sure it had something to do with Spock, who had apparently been announced his official caretaker and showed no scruples about telling the Vulcan medical staff just how to properly accommodate a Human patient. At least, that was what Jim gathered from his constant presence and continued hovering.<br><br>\nHe was glad for the company, though. <em>Kobayashi Maru</em> debacle or no, Spock was the only person Jim kind of knew on this planet. Jim felt far more at ease with him than with the other Vulcans. Their continuous bowing and respectful nods made him feel very, very uncomfortable. At least with Spock, it was mostly <em>Mr. Kirk</em> and the occasional inclination of his head, though he would have preferred the Vulcan to call him Jim. Such an offer had been gently but firmly refused.<br><br>\nFeeling his knees go wobbly, Jim quickly finished up and left the shower. He felt unsatisfied. While sonic showers were highly efficient, they never gave Jim that feeling of having been cleaned properly. Water showers, however, were not available on a dry planet like Vulcan.<br><br>\nSlowly, Jim dressed in fresh clothes, one of the thin, knee-length tunics patients wore in Shi’Khar hospital, and made his way back to his bed. As always, Spock was waiting for him. He was sitting on a chair he had procured the previous day, a PADD in his hands.<br><br>\n\"All is well?\" he asked, looking up briefly from the device as Jim sank back onto the bed.<br><br>\n\"I'm not a child, you know. I can go to the bathroom on my own, just like a proper grown-up,\" Jim told him a bit more grumpily than the question merited. Spock was merely taking his duties very seriously, as any Vulcan would. He probably didn't even know he was mothering Jim.<br><br>\n\"I did not mean to imply you had yet to reach age of maturity, Mr. Kirk,\" Spock said, as calm as ever.<br><br>\n\"Forget it,\" Jim sighed and rested his head on the pillow. \"It's just … I can't believe I'm still feeling this bad when I've been here already for over two weeks before I even woke up.\"<br><br>\n\"Your condition was severely life-threatening when you were retrieved from the <em>Narada</em>. It is only logical the recuperation phase would take much longer than you are accustomed to.\"<br><br>\nJim closed his eyes, silently cursing Vulcan logic.<br><br>\n\"Healer T'Lkai informed me that you are experiencing difficulties acquiring sufficient amounts of sleep,\" Spock added.<br><br>\n\"Did she now.\" Jim kept his eyes closed.<br><br>\n\"You are experiencing nightmares?\"<br><br>\n\"Yeah,\" he admitted quietly. \"It's all kind of blurry, though. Nothing specific. Just, you know, nightmare stuff.\"<br><br>\n\"I do not know, no. Vulcans do not dream and therefore do not experience nightmares.\"<br><br>\nSurprised, Jim turned onto his side to look at Spock. \"Really?\" he asked. \"No dreaming at all?\"<br><br>\n\"None,\" Spock confirmed, lowering the PADD after switching it off. \"We require little sleep and never enter into REM cycles like Humans do. Most of our energy is restored through meditation which often lasts less than three Standard hours.\"<br><br>\nJim nodded thoughtfully.<br><br>\n\"Wouldn't mind that myself,\" he said quietly. \"Getting rest without having to worry about dreaming.\"<br><br>\n\"You wish to learn the Vulcan way of meditation?\" Spock asked, lifting his eyebrows in a way that Jim had quickly figured out to mean surprise.<br><br>\n\"Well, not precisely. Can I, though?\" Jim replied, honestly curious.<br><br>\n\"It is not a state of mind unique to Vulcan physique, or at least not the shallow states of meditation. I doubt a deeper state like a healing trance would be accessible to you, but calming your mind and purging the most volatile of emotions should not be impossible. My mother, at least, has mastered it.\"<br><br>\n\"Wait,\" Jim asked. \"Your mother? She's Human?\"<br><br>\n\"Affirmative,\" Spock said. Was Jim imagining it, or was he moving a bit on his chair? \"My mother is indeed Terran.\"<br><br>\n\"Which makes you half-Human, right?\" Jim said, smiling. He propped himself up on his right arm, now free of any infusions, trying for a more comfortable position as they talked. \"No wonder they've made you my babysitter. They must think you the most fitting choice, given your mixed heritage.\"<br><br>\nSpock nodded stiffly. His eyes wandered, focusing on something behind Jim.<br><br>\n\"I believe that was part of their reasoning. Our previous acquaintance as well my staying on Earth and working amongst Humans must also have contributed to their logical conclusion.\"<br><br>\n\"Thanks, by the way,\" Jim said. \"I know you don't like me very much and staying with me all day must be boring, but I really do appreciate the company.\"<br><br>\nSpock's head snapped towards him at once. \"You have come to an erroneous conclusion,\" he said sharply.<br><br>\nJim almost flinched at the intensity of his voice. \"Um. Oh. I was just thinking … well, with the <em>Kobayashi Maru</em> and everything that happened on the <em>Enterprise</em>--\"<br><br>\n\"I have misjudged your character severely in the past, <em>oveh</em>,\" Spock told him, putting special emphasis on the honorific. Jim swallowed. \"You are selfless and brave and very well understand the concept of making a difficult choice. You went after the red matter and asked to be beamed into space, thinking you would die. You had no logical reason to assume death would not be the outcome of your action. Yet, you decided to sacrifice yourself for the sake of many. You were willing to give your life for a planet to which you have no immediate connection. I, as do my people, recognize your extraordinary service to us. If I have given you the impression I find your company disagreeable, I sincerely apologize and shall endeavor to rectify my behavior in the future.\"<br><br>\nThat was quite a speech. Jim's cheeks felt very warm. Slowly, he turned back onto his back, staring at the ceiling.<br><br>\n\"You make me sound like some sort of hero,\" he said. \"I'm not, though. I was scared shitless when I jumped off the drill, I was scared shitless when I told you to beam me into space, I cried like a baby when Nero ...\"<br><br>\nHe trailed off, feeling his chest constrict. Talking about what happened on the <em>Narada</em> made him feel sick, and he didn't even remember all of it that well.<br><br>\n\"As you might remember, the point of the <em>Kobayashi Maru</em> scenario was to experience fear in the certain face of death.” Spock’s voice sounded even more severe than before. “It is not a weakness to feel fear. It is a weakness to succumb to that fear, to let it guide your actions. You did not let your fear overwhelm you as you made your choice. Feeling fear does not make your sacrifice any less honorable. It only makes you Human.\"<br><br>\nTo his own horror, Jim suddenly felt like crying.<br><br>\n\"I wished I hadn't done it, you know?\" he confessed, feeling raw. \"When they were torturing me, at some point I kept thinking <em>Why did you do it? How stupid! You wouldn't be here if you hadn't!</em> I regretted it, do you understand? I wished I had never saved your damn planet! I wished your people would be dead so I could be alive and well. Do you understand me, Spock? I wanted Vulcan to be gone! Destroyed, all of it!\"<br><br>\nShaking, Jim turned his back to Spock, curling in on himself on the bed.<br><br>\nFor a few minutes, nobody moved or talked. Then, fingers curled lightly around Jim’s thinly-clad shoulder. Spock still said nothing, but his hand felt soothing. They didn't talk until it was time for Jim's mid-day meal.</p>\n<p></p>\n<p>__ __ __</p>\n<p><br>\nJim had never seen Bones cry in all the time he had known him.<br><br>\nHe knew, of course, that Bones was incredibly compassionate and emotional below the tough exterior, but seeing his friends' lips tremble as he stared at Jim from the screen with shiny eyes gave Jim the chills. A teary-eyed Leonard McCoy was definitely not something Jim wanted to encounter very often in his life.<br><br>\n\"Hey, I'm okay,\" Jim hurried to say as soon as the connection was stable enough for audio, trying to sound soothing and managing to have his voice go wonky halfway through.<br><br>\n\"Okay? <em>Okay?</em> Your damn left ear is gone! You're thin as a leaf, not a bit of color in your face! How does that remotely qualify as okay, huh?\" Bones barked, voice even rougher than usual.<br><br>\n\"Sorry,\" Jim said miserably at the screen.<br><br>\n\"You better be! You know how scared I was? We knew nothing, Jim, you understand? We didn't know where they'd beamed you, or if you were injured or even de<em>ad</em>.\" The way Bones' voice broke right there made Jim want to crawl into a very dark hole and never return.<br><br>\nThe doctor took a minute to collect himself, then continued in a quieter voice: \"Never do that again, you hear me? Never. This was your share of saving the world! One more stunt like this and I'll make you regret it. Got that, kid?\"<br><br>\nSwallowing heavily, Jim nodded at the screen. Somewhere near the door, Jim heard Spock shift and leave the room, probably disconcerted enough by so much emotional display to neglect his duties of keeping an eye on Jim at any given moment.<br><br>\n\"It wasn't just me, y'know?\" Bones continued. \"Everyone was worried, and they all worked their asses off to get you back. It's a damn miracle we weren't all court martialed to hell for the stunt we pulled.\"<br><br>\n\"I've heard,\" Jim said. \"Sorry.\"<br><br>\n\"Damn it, Jim, you were <em>soaked in blood</em> when we got to you. I didn't even know where to start fixing you up! For a minute, it looked like you'd die in my arms, after all we'd gone through!\"<br><br>\n\"Sorry,\" Jim repeated. Not sniffed. Not at all. \"And thanks. Really, thank you. To everyone.\"<br><br>\n\"Yeah, well,\" Bones replied, quickly wiping a hand over his eyes. \"Glad you’re not. Dead, I mean. Just so you know.\"<br><br>\nThey stared at each other through the screen, clearly lost for words now that Jim had been suitably chastened.<br><br>\n\"Bones,\" Jim finally said helplessly.<br><br>\n\"Yes, kid?\"<br><br>\n\"Just … take care as long as I'm gone, yeah?\"<br><br>\n\"Always do, Jim. You, too. And I want a weekly update, you got that? Write to me, get your medical files from the Vulcans, too. Damn well need to know if they pull any of that Voodoo healing magic on you!\"<br><br>\n\"I'll ask Spock about it.\"<br><br>\n\"He treating you right?\" Bones asked, mouth twitching. \"No hard feelings over the <em>Maru</em>?\"<br><br>\n\"Nah, he's being really nice. Everyone is really nice. They take excellent care of me, really.\"<br><br>\n\"You did save their planet,\" Bones pointed out with a raised brow.<br><br>\n\"Yeah, well,\" Jim replied uneasily. He didn’t want to get into that discussion again.<br><br>\nBones' eyes looked very knowing. \"Right. I'll have to leave now, kid, but you rest, you hear me? And if you don't write to me, I’ll come to Vulcan myself to spank your sorry little ass!\"<br><br>\n\"Kinky,\" Jim joked weakly and laughed as Bones scowled and disconnected the call.<br><br>\nSpock stepped into the room almost as soon as the screen went blank. Apparently, he hadn't really walked off after all.<br><br>\n\"I see you are finished. I shall return you to your room at once.\"<br><br>\nWith a sigh, Jim carefully got up from the chair in front of the hospital communication panel and walked over to where Spock was waiting with a wheelchair of Vulcan design, all metal and acrylic glass. If Jim hadn't been trying to tone down on his emotional displays while staying on Vulcan, he would have grimaced at it in distaste.<br><br>\n\"You make a great nurse,\" he nonetheless quipped with a dose of sarcasm as he sat down in the chair and it bleeped, moving forward as Jim lay his finger over the appropriate sensor.<br><br>\nSpock didn't dignify that with a response, only guided Jim back to his room. Jim nodded at the Vulcans who inclined their heads at him as they passed. He caught murmurs of <em>oveh</em> with his good ear. It was still weird to be treated like some sort of national hero, but Jim was slowly getting used to the curious glances and respectful bows.<br><br>\n\"I have observed that you did not call your family, Mr. Kirk,\" Spock eventually spoke up, a careful sort of curiosity in his voice as he pushed Jim through a less busy hallway.<br><br>\nJim stiffened in his chair. \"Yeah I did.\"<br><br>\nSpock did not ask any more questions.</p>\n<p></p>\n<p>__ __ __</p>\n<p><br>\n\"Who took the red matter?\" Jim asked, surprising himself as the thought suddenly popped up out of the blue.<br><br>\nSpock looked up from the Tri-D Chess set placed on a small table hovering between the biobed and Spock's chair, tilting his head in inquiry.<br><br>\n\"Please elaborate.\"<br><br>\n\"After Nero beamed me aboard, he told his henchmen to get another capsule ready,\" Jim explained. \"But the ship carrying the matter was no longer there.\"<br><br>\n\"You know of that ship?\" Spock asked, eyebrows twitching.<br><br>\nJim grimaced. \"Nero did a lot of talking between the … well …\"<br><br>\n\"I see,\" Spock replied slowly. \"Mr. Kirk, I fear there is something I have neglected to tell you.\"<br><br>\n\"Oh? Well, what is it?\"<br><br>\n\"It is not easily explained. Nor easily comprehended, I assume.\"<br><br>\n\"Try me.\"<br><br>\nSpock paused, averting his gaze. \"I would prefer for you to wait for an explanation for a while longer. At least until your toes and ear have been restored and you are allowed to leave the hospital.\"<br><br>\n\"You make it sound like a really big deal,\" Jim commented, wondering what could possibly be the reason for so much secrecy.<br><br>\n\"It is, I believe, what you would call a 'very big deal'. I would not wish to reset your recuperation due to further stress.\"<br><br>\n\"Well, now I'm just going to worry about it until they've fixed me up!\" Jim snorted.<br><br>\n\"I apologize,\" Spock said, and nothing more.<br><br>\nJim stared at him for a few moments, then let out a dry laugh. \"Fine, leave me hanging,\" he said, moving his knight in a bold move for Spock's queen, gratified that he was no longer dropping the pieces all over the place. He was slowly getting used to the decrease of sensation in his fingers.<br><br>\nSpock considered the chessboard silently with what Jim hoped was a look of irritation.</p>\n<p></p>\n<p>__ __ __</p>\n<p><br><em>I'm a wimp</em>, Jim realized as he watched T'Lkai place two hyposprays on the little table next to his bed. <em>One big fucking wimp.</em><br><br>\n\"You are distressed, <em>oveh</em>. You must calm down for my preparations to be fully effective.\"<br><br>\nDamn, and now he was projecting again.<br><br>\nSpock had informed him that most Vulcans could pick up on especially fierce emotions in their immediate surroundings, even when there wasn't a bond in place. It sounded much handier than it really was, given that Jim was prone to panic attacks whenever he saw pointed ears lurking in the shadow of a hallway and his brain started screaming <em>Romulan</em>, not Vulcan.<br><br>\nBy now, Jim was sure most of his healers had lost any awe they might have possessed for their precious <em>oveh</em>. T'Lkai alone had seen him burst into frightened tears no less than four times since he woke up lucid.<br><br>\n\"I'm sorry, <em>hassu</em> T'Lkai,\" Jim sighed, eyeing the hyposprays with dismay.<br><br>\nHe had started to implement more Vulcan in his speech. It seemed only polite to make an effort, and reminding himself of the respective titles and modes of address seemed a good place to start. Not that it counted for much when he still ended up angsting all over their telepathic minds.<br><br>\n\"Is there anything I can do to relieve you of your current emotional state?\"<br><br>\nJim was pretty sure T'Lkai had started to regard him like she would a Vulcan toddler, not yet able to fully control his emotions. It would even be kind of funny if there wasn't an operation looming over him. Meaning he had to be knocked out by several hypos, fall unconscious for at least two hours straight as he was stretched out on a table being cut and prodded at.<br><br>\nThe prospect of once more lying somewhere, unconscious and completely defenseless, was absolutely horrifying to him, if of course illogical. The Vulcans wouldn't harm him. On the contrary, T'Lkai and the others had gone out of their way to grow his new parts from tiny DNA samples in record time, quickly familiarizing themselves with the specifics of Human physiology in the process.<br><br>\n\"I don't think so,\" Jim said to the healer. \"I'll attempt to control it. I'm sorry it's affecting you.\"<br><br>\n\"I understand it is a natural state in Humans, <em>oveh</em>, succumbing to one's emotions and displaying them so openly.\"<br><br>\n\"It is. Still, I can understand it can't be very comfortable for you. Spock said you can pick up on it if it gets too bad. I wouldn't want to … um … upset your mental state.\"<br><br>\n\"My mental control is more than adequate protection, <em>oveh</em>.\" Now, she almost sounded insulted. Well, crap.<br><br>\n\"Yes. Of course, <em>hassu</em>. I didn’t mean to imply the opposite.\"<br><br>\nHe should probably just shut up now. Shut up and take deep breaths, because his current heart rate was not healthy, let alone relaxed. The palms of his hands were clammy and moist and he could feel his legs tremble under the thin bed sheet.<br><br>\nMaybe, T'Lkai should just use one of those Vulcan nerve pinches. That way, she could at least do her job in peace and prepare him for surgery without Jim doing the mental equivalent of screaming his fear at her like a lunatic.<br><br>\nAs so often these days, it was Spock's arrival that eased Jim's volatile fright to a more manageable level. He did not quite understand why Spock was any different, but whenever Jim woke up from a nap convinced that Nero had once more gotten his hands on him, he was the one to get him out of it. Somehow, his messed-up mind had accepted that he was not a threat. A safe haven, even.<br><br>\n\"Do not feel guilt over your fear,\" Spock said as soon as he entered the room, greeting the busy T'Lkai with a swift <em>ta'al</em> before stepping up to the bed. \"Instead, try to calm your mind. Adhere to logic. Nobody here means you any harm. To feel scared is irrational.\"<br><br>\nIt was a strong sign that Jim had already spent too much time around Vulcans that he almost felt comforted instead of insulted by the way Spock dismissed his panic as an illogical anomaly.<br><br>\n\"I'm trying, Spock,\" he sighed. \"I really am.\"<br><br>\n\"Let me assist you by guiding you through the logical steps.\"<br><br>\nJim only nodded, listening to Spock list the many reasons why the impending surgery was no reason to run screaming, citing Surak’s teachings as he deemed fit. It was indeed making him feel calmer. Maybe, he should take Spock up on that offer on instructing him in the Vulcan ways of meditation and pursuits of logic.<br><br>\n\"Something could still go wrong,\" he argued nonetheless when Spock finished his little speech. “Especially when they’re trying to attach the nerve endings.”<br><br>\n\"A surgery always comes with risks. However, in your case the benefits outweigh the risks by precisely 97%. Enduring the procedure and accepting that risk therefore is the only logical course of action.\"<br><br>\n\"Makes sense,\" Jim said. He still wasn't looking forward to surgery, but his heart had stopped trying to jump out through his throat and T'Lkai was already nodding at them in approval.<br><br>\n\"I commend you,\" she said. \"Mr. Kirk has now sufficiently calmed for me to administer the hyposprays.\"<br><br>\nBefore Jim could do anything about it, T'Lkai had placed the first at his neck and injected it. Jim winced, but otherwise stayed calm.<br><br>\n\"You will watch, right?\" he asked Spock, feeling kind of woozy as the pre-surgery mix of chemicals settled in his systems.<br><br>\n\"Although it is usually reserved for healers in training, I have received permission to watch the proceedings from the observation room,\" Spock said, inclining his head.<br><br>\nJim did not know why it made him feel better, but it did.<br><br>\nSoon, T’Lkai was finished preparing him and he was moved to the surgery. Three more healers were waiting for him, already clad in what Jim assumed were surgical robes.<br><br>\n\"Do you wish to see your new parts before we administer the anesthetic?\" Healer Serran asked neutrally, face covered by a see-through surgical mask.<br><br>\n\"Sure, yes,\" Jim replied, though his eyes were on the windows up and across him, seeking out Spock’s familiar form in the dimly lit observation room.<br><br>\n\"Growing them has proven no difficulty, just as we thought,\" the Vulcan told him, presenting him with a small transparent box.<br><br>\nJim turned his head and blinked at its contents, momentarily distracted from his anxiety as he looked at it. A small gasp of surprise escaped him.<br><br>\n\"It’s... it’s <em>pointed</em>,\" he said dumbly, staring at the ear.<br><br>\nHealer Serran nodded. His face stayed impassive, but spending so much time with Spock had given Jim a bit of a feeling for when Vulcans were not as relaxed as they wanted to appear. Clearly, the healer was not sure how this news would be received.<br><br>\n\"Indeed,\" he stated. “Do you not think it appropriate, <em>oveh</em>?”<br><br>\n\"No,\" Jim said, feeling slightly overwhelmed. Touched, almost. \"No, it’s ... quite appropriate.\"<br><br>\nHe only threw a cursory glance at the toes in the other box, then rested his head on the surgery table. T’Lkai approached with the last hypo and an oxygen mask. Jim sought out Spock again where he was sitting up straight on his bench in the observation room. More Vulcans were entering it now, undoubtedly curious to see something as rare as a surgery on a Human.<br><br>\nJim’s eyes stayed with Spock until he blacked out.</p>\n<p>It was illogical to hurry, Spock knew. The healers had made it clear they would not release Kirk from the hospital until nightfall, mindful of his Human physiology and weakened state. It would not be wise to have him collapse in the burning heat of a Vulcan day. Therefore, Spock had timed his arrival precisely at sunset.<br><br>\nYet, Spock found his steps quickening as he left the transportation shuttle and approached the tall, well-lit building that was Shi’Khar hospital.<br><br>\nIt had been five more days after the surgery before the healers had proclaimed Kirk fit to leave. He was still underweight and would need at least weekly check-ups until his heart and immune system were functioning normally again, but he no longer had to remain in bed.<br><br>\nStepping inside the hospital and approaching one of the turbolifts, Spock could not help but recall the look on the Human’s face when he had told him that he was invited to stay at Spock’s family home.<br><br>\nGrowing up with his Terran mother and staying at the Academy on Earth had of course acclimatized Spock to the way Human faces showed all kinds of emotional layers. The genuine surprise and joy Spock had easily read on Kirk’s face had been quite illogical, however. Spock had made it very clear that he had been appointed the Human’s caretaker as long as he resided on Vulcan. Therefore, he should not be surprised. Neither had Spock done anything to be the cause of happiness, merely fulfilled his duty as a Vulcan and Kirk’s guide.<br><br>\nHowever, Spock had found that where Kirk was concerned, very little logical predictability applied.<br><br>\nWhen he had first seen the man, he was convinced that the cadet with the arrogant sneer on his face was egoistic, vain and therefore more than unfit for Command track, if not for Starfleet as a whole. Spock had not been able to understand the logic behind Captain Pike’s choice to make Kirk temporary First Officer of the <em>Enterprise</em> or to trust him with a mission as vital as disengaging the drill threatening Vulcan, much for the same reasons.<br><br>\nThen, illogically, Kirk had done the unpredictable and not only disengaged the drill but jumped after the red matter device falling towards Vulcan.<br><br>\nSpock could not deny that in that very moment he had felt something: utter amazement, shock almost, at the selfless sacrifice of the very man Spock had considered one of the worst of his kind, a conceited, immature, self-centered Human.<br><br>\nHe could not have been more wrong. Kirk had done what no Vulcan could deem flawed: he had put the need of the many above the need of the one.<br><br>\nRegret, though, was illogical. <em>Kaiidth</em>.<br><br>\nWhen he entered Kirk’s room, Spock was presented with such a brilliant smile that he was momentarily distracted by it.<br><br>\n“Spock!” the Human exclaimed in what could only be described as excessive exuberance. “Finally!”<br><br>\n“I believe I am precisely on time, Mr. Kirk,” Spock returned calmly, looking over Kirk who was sitting on the hospital bed.<br><br>\nHe observed that Kirk had made use of the offers of assistance by the healing staff and ordered clothes. While their cut was undoubtedly Terran -- long, straight pants with a short-sleeved shirt -- Spock recognized the sturdy and practical Vulcan fabrics easily. Somebody had gone out of their way to actually have those clothes sewn instead of simply replicating them in the Federation Standard polyblend. A small bag sitting on the floor by the bed indicated that he had received more than one set of clothing.<br><br>\nSpock was not surprised the staff had taken such diligent care of Kirk’s wish. The Human was not yet aware of just how interested in his well-being the Vulcan people were. He had only gotten a glimpse from the way the healing staff acted towards him. Outside the hospital walls, Vulcans from all classes and origins had found it logical to trade information and news about Kirk’s whereabouts and state of health.<br><br>\nIt was the closest Spock had ever seen his people come to admiring an outworlder’s achievements in such a single-minded, almost emotional way. If he had interpreted some of the more subdued talk in Shi’Khar correctly, even the Vulcan Elders were taking a pointed and unprecedented interest.<br><br>\n“<em>Hassu</em> T’Lkai has officially released me,” Kirk said, clearly making an effort to tone down on his smile as he got up from the bed and lifted the PADD Spock had provided him with from the table next to it. Being far from Earth, Kirk did not have any other personal belongings except for the bag of clothes.<br><br>\nIt had not escaped Spock's notice that Kirk was making an effort to accommodate his hosts. Spock had seen him look up Vulcan phrases and vocabulary, immerse himself in texts on Vulcan culture and casually drop perfectly passable Golic into his conversation with the staff. In addition, he was making a conscious effort to hide the most volatile of his emotions and was very aware of proximity and touch.<br><br>\nSpock’s first assessment of James Tiberius Kirk as self-centered and uncaring proved less and less logical the longer he observed him.<br><br>\n“Then I invite you to follow me to my home. It is in the outskirts of Shi’Khar. A shuttle will bring us there in approximately 18.5 minutes.”<br><br>\n“Ah, approximately,” Kirk repeated, eyes crinkling in what Spock recognized as mirth.<br><br>\nOne thing he apparently could not reign in was the Human trait of <em>teasing</em>. But then, Spock’s own mother had never been able to fully subdue that unfortunate activity either. Maybe it was a Human flaw too fundamental to their nature to disappear entirely.<br><br>\n“You are ready to depart?” Spock asked.<br><br>\n“More than ready,” Kirk replied with emphasis and stepped towards the door. He was obviously eager to leave behind the room he had both suffered and healed in.<br><br>\nKnowing it would be futile to point out the lack of logic in Kirk’s phrasing, Spock simply lead the way.<br><br>\nAs soon as they stepped off the turbolift on ground level, Spock noticed the curious glances thrown in their direction. Pressing his lips together, Spock hurried up a bit, only to slow down again when he realized that in his current state, Kirk would not be able to keep up with that pace for long.<br><br>\n“Wow, it’s <em>really</em> hot,” Kirk said when they stepped outside the hospital and into the warmth of post-dusk Shi’Khar.<br><br>\n“A mere 38.7 degrees Celsius,” Spock told him. “The sun has already passed the horizon. It gets much hotter during the day.”<br><br>\n“Much hotter, really? What’s the season?”<br><br>\n“I believe the Terran equivalent would be mid-spring.”<br><br>\n“Oh.” Kirk looked distinctly unhappy.<br><br>\nSeeing Kirk’s discomfort with the current temperature, Spock pointed towards one of the sleek, silver shuttles waiting by the street near the hospital. “We can climatize the shuttle for your convenience,” he explained as he approached one of them, removed his credit chip from a pocket in his robes and pressed it against the sensor.<br><br>\nWith a few, swift movements he had programmed the correct route into the shuttle and opened the door for Kirk. When they had both entered the shuttle, its door closed tightly behind them.<br><br>\nKirk carefully watched Spock regulate the temperature inside the vehicle. “I wouldn’t want you to be cold.”<br><br>\n“I assure you, Vulcans can endure lesser temperatures than this without feeling any more than slight discomfort. Parts of our deserts fall well below -15 degrees Celsius at night. Unless we stay there completely unprotected for an extended period of time, we do not come to any serious harm.”<br><br>\nFinding a free spot on the street busy with evening traffic, the shuttle moved forwards on its own. Spock watched Kirk dab at the sheen of sweat on his forehead, then turn his head and look at Shi’Khar through the window. The new angle presented Spock with his left ear.<br><br>\nSpock had not expected the healers to grow a Vulcan ear, pointed and jutting out slightly. It could not have been an accident, as Human DNA did not usually carry these specific traits. When he had made enquiries of the nature with Healer Serran, he had told Spock that it had been a wish of the Elders to form the ear in this non-Human fashion.<br><br>\nAnother strong sign that Kirk was of particular interest to them. Spock had not yet collected enough data to come to a logical conclusion as to their full agenda, though he knew it was very unusual. He had yet to determine if he agreed with the current developments.<br><br>\nSpock had seen the look of reverence on Kirk’s face as he had carefully touched the tip of his ear, looking at himself in the mirror T’Lkai had provided. Spock doubted he was aware of how unprecedented it was, Vulcans purposely bestowing Vulcan traits on a non-Vulcan, but had said nothing. Kirk had not asked, either. He certainly did not seem displeased with his new appearance.<br><br>\nThey did not talk much on their way to Spock’s family home. On occasions, Kirk asked about the purpose of a certain building or for the translation of a sign. Other than that, he seemed satisfied just watching the city pass by.<br><br>\n“It’s very … orderly,” he observed eventually. “Very organized and clean.”<br><br>\n“Logic and order go hand in hand,” Spock reminded him, and Kirk nodded.<br><br>\n“Of course.”<br><br>\nThe high buildings of central Shi’Khar soon faded into lower buildings and houses, many of them partly or mostly built right into the red and brown rocks typical for Vulcan. Most of these were clan-houses, their foundations centuries old. With the streets emptier here, the shuttle sped up considerably, quickly approaching its programmed destination.<br><br>\nWhen they arrived at Spock’s home, he could not help but observe Kirk carefully for his reaction.<br><br>\n“That is your house?” Kirk asked, staring up at the building through the window, obviously impressed.<br><br>\nSpock could appreciate his awe. His clans’ workmanship and architecture was indeed something to be admired for its efficient clean lines merging seamlessly with the more decorative styles of earlier centuries. Shortly past Reformation, architects had not yet ceased adding purposeless embellishments to housing.<br><br>\n“Indeed,” he replied, opening the shuttle door. “Come. It will be cooler inside.”<br><br>\nSpock waited until Kirk had left the vehicle, then sent it off to the nearest station with a few simple touches to its sensors.<br><br>\nThey entered the house through the main door, stepping into the atrium. Kirk looked at the walls in open admiration, clearly interested in the inscriptions.<br><br>\n“It is old Vulcan scripture,” Spock explained to him, placing his hands behind his back. “Some essential teachings of Surak along with wise sayings of some of my ancestors. There is a family tree farther on the left, if you are interested.”<br><br>\n“It’s beautiful,” Kirk said, turning to look at Spock. His eyes were very wide, showing off the curious tone of blue his genetics had bestowed upon him.<br><br>\n“There is a certain aesthetic to it, I agree.”<br><br>\nBefore Kirk could reply, light and quick footfalls announced the arrival of Spock’s mother. Sarek’s steps would be much slower, more dignified.<br><br>\n“Spock, there you are!”<br><br>\n“Hello, Mother.” Spock offered her the <em>ta’al</em> as she stepped closer.<br><br>\nStanding very straight, he endured his mother’s brief touch to his cheek as she smiled up at him.<br><br>\nAs a child, he had not minded her physical way of showing her affection until he had realized that it was not the Vulcan way and frowned upon. She had since then ceased to kiss or hug him, though in more private surroundings she seldom refrained from touching his cheek with her two longest fingers in a modified form of a Vulcan kiss.<br><br>\n“Mother, let me present to you the honorable James Tiberius Kirk.”<br><br>\nSpock watched her turn her smile on Kirk, who returned it instantly. Even though his face was gaunter than before, his smile had lost none of its easy Human charm.<br><br>\n“It’s very good to meet you, Mr. Kirk,” Amanda said with warm eyes, offering her hand for a shake in the Terran tradition.<br><br>\n“Thank you, Mrs. … ah, well, what is it they call you? Mrs. Sarek? Or is it Grayson still?” Kirk replied. Spock did not miss the faint blush on his cheeks as he fumbled for the right form of address.<br><br>\n“Just call me Amanda. You’ll be staying here for a while, anything else would just be uncomfortable.”<br><br>\n“Thank you. And please call me Jim.”<br><br>\n“Jim, of course.”<br><br>\nThey continued smiling, clearly assessing each other with friendly looks. Even though he was used to the much more emotional Human greetings, Spock had to admit to a certain sense of discomfort as he watched his mother and Kirk being so familiar with each other.<br><br>\n“I asked Spock to call me Jim, too,” Kirk finally said, throwing Spock a pointed look. “But so far, he insists on <em>Mr. Kirk</em>.”<br><br>\n“If you desire, I shall endeavor to call you by your given name while we are in private,” Spock replied stiffly when he saw the look his mother gave him. “Jim.”<br><br>\nKirk turned that warm smile on him, then looked back at Spock’s mother, who invited them both into the sitting room for some evening tea and fruit.<br><br>\nSpock mostly kept quiet as his mother and their guest chattered away about Terran things, talking about what Spock’s mother missed most since moving to Vulcan and how to best deal with the different climate.<br><br>\nWhen a natural break occurred in their conversation, Spock smoothly interfered. “Where is father, Mother?” he asked.<br><br>\n“He’s with the High Council,” she told him, raising her eyebrows in a way that Spock knew to mean that the meeting was of some significance. “He will return soon though, I imagine. He didn’t seem to believe it would take much longer than a few hours.”<br><br>\nAmanda’s assessment turned out to be correct. Sarek stepped into the sitting room 3.7 minutes later, wearing his most formal robes, usually reserved for highly important diplomatic occasions.<br><br>\nSpock stood at once, offering the <em>ta’al</em>, and said formally: “<em>Dif-tor heh smusma, osa-mekh.</em>”<br><br>\nSarek returned the gesture briefly, then his eyes focused on their Human guest. Kirk, Spock observed, had also stood and abandoned the easy smile he had worn while talking to Spock’s mother. Instead, he looked calm and severe as he offered a very passable <em>ta’al</em> of his own and said: <em>“Dif-tor heh smusma, kevet-dutar.”</em><br><br>\nKnowing his father well, Spock could tell Sarek had not expected Kirk’s grasp on the Vulcan language to be quite this adequate.<br><br><em>“Dif-tor heh smusma, oveh,”</em> Sarek replied. “<em>La’rom’lasha.</em>”<br><br>\nSpock shifted slightly, wondering if Kirk’s knowledge of the language went quite that far, but he replied smoothly: “<em>La’ertau sochya t’okelek.</em>”<br><br>\nSpock did not miss his mother’s smile from where she, too, had stood to greet her husband. It was clear Kirk faring so well using the Vulcan language pleased her.<br><br>\n“You are a welcome and honored guest,” Sarek said, switching to Federation Standard. “Your grasp on the Vulcan language is also to be commended, <em>oveh</em>.”<br><br>\n“There is much more to learn, <em>kevet-dutar</em>,” Kirk replied formally.<br><br>\n“There always is,” Sarek agreed, then turned to greet his wife.<br><br>\nSpock looked away as their fingers brushed together, instead focusing on Kirk once more. From the way he stared curiously at Spock’s parents, it was clear the intimacy of the gesture was not entirely lost even on him.<br><br>\nThey settled down again, though the gathering felt more formal now that Spock’s father had arrived. While Sarek did have ample experience dealing with Humans, it was clear Kirk was intimidated by his presence.<br><br>\nAmanda and Sarek exchanged a few quiet sentences, then Sarek turned to address Kirk directly again.<br><br>\n“<em>Oveh</em>, it is my honor to extend to you an invitation from the Elders of the High Council to join them for a traditional Vulcan mid-day meal in two days time.”<br><br>\nKirk blinked several times, throwing a questioning glance towards Spock before settling for an answer. “I would be honored to join them, of course.”<br><br>\n“Very well, <em>oveh</em>. I shall inform them of your acceptance.”<br><br>\n“May I ask for the purpose of that meeting, <em>osa-mekh</em>?” Spock inquired carefully.<br><br>\nSarek’s response for Spock stayed distinctly brusque: “It is between the honorable Mr. Kirk and the Elders.”<br><br>\n“I can’t bring Spock?” Kirk spoke up with another quick glance towards Spock.<br><br>\nSpock saw his father’s eyebrows twitch. “It is, of course, your choice if you would like to bring a guest of honor, <em>oveh</em>.”<br><br>\n“I don’t want to offend anyone,” Kirk hurried to add, clearly sensing that it was not the done thing. “It’s just that Spock has been really good about keeping me informed and, well ... out of trouble.”<br><br>\nAmanda laughed at that and some of tension in the room bled away.<br><br>\n“I’m glad to hear Spock has been taking good care of you,” she said and Kirk smiled back in what seemed an almost automatic reaction.<br><br>\n“I am convinced the honorable Elders have their reasons for keeping this meeting private”, Spock stated. “It is only logical to adhere to their superior wisdom. I am certain you will fare tolerably on your own, Jim.”<br><br>\nSpock felt his father’s eyes on him when he uttered Kirk’s first name. He had not missed the fact that Sarek kept using the honorific title and pronouns, talking to Kirk like he might to an esteemed equal or Elder.<br><br>\n“If you say so,” Kirk said, inclining his head, though it was clear to everybody he was not convinced he would do well on his own.<br><br>\n“You must be tired, Jim,” Spock’s mother spoke up. It was obvious Sarek did not disapprove of her casual form of address. “Spock, why don’t you show him the guest room and where to find everything else.”<br><br>\nIn other words, his mother wanted to speak to Sarek alone. Spock knew that Sarek would show much less discretion about the purpose of the meeting with his wife.<br><br>\n“Very well, Mother,” Spock said, standing up. “If you will follow me, Jim?”<br></p>\n<p></p>\n<p></p>\n<p>__ __ __</p>\n<p><br>\nSpock startled out of his nightly meditation when panicked screaming sounded through the house. There was no doubt that it was Kirk, and Spock hurried to stand, straightening his robes with short, efficient movements before hurrying out of his room and towards Kirk’s.<br><br>\nThe guest room’s slide door was only partially-closed and the stone walls of older Vulcan houses carried sound very efficiently. Spock was sure the shouts could be heard throughout most of the building. As he entered the room, the screams turned so loud he had to quell an urge to press his hands to his ears and retreat again. Instead, he waved his hand before the sensor by the door to switch on the lights above.<br><br>\n“Mr. Kirk,” he said loudly as he approached the bed.<br><br>\nThe man was thrashing. He had thrown off the thin knit blanket typical for Vulcan beds, exposing his bare chest. His sleeping attire was a single pair of dark pants, creased and slightly askew from his struggles. As Spock stepped closer, he could smell the distinct stench of Human urine.<br><br>\nThe healers had warned him of this. Yet, Spock could not deny that the sight of a soiled Kirk struggling in his sleep, shouting and lashing out in fear, was unsettling.<br><br>\n“Mr. Kirk,” he repeated.<br><br>\nKirk kept screaming nonsense, his voice going hoarse the longer it went on. This close to him, Spock could feel his fear prickling at the edges of his mental shields. Clearly, trying to talk to him would be futile. Spock would have to shake him awake. Touch him.<br><br>\nBracing himself for the impact of such volatile emotions, Spock bowed down and firmly grabbed both of Kirk's bare shoulders.<br><br>\nThe sheer onslaught of emotions nearly brought Spock to his knees. He had calmed Kirk before, but never woken him from one of his nightmares through touch. Spock's mind was seized by a fear so instinctual, so fundamental, it shook him to the very core.<br><br>\n“Mr. Kirk,” he managed through the mental assault, shaking the man once, twice.<br><br>\nKirk's eyes flew open. He gulped in air as if he had just emerged from water, gaze unfocused as he continued screaming. His hands came up to scratch at Spock's arms, clearly too confused and frightened to properly defend himself -- or realize that Spock was not any danger to him in the first place.<br><br>\n“Mr. Kirk,” Spock repeated, grinding his teeth with the effort to control the emotional backlash. “Mr. Kirk. <em>Jim</em>. I mean you no harm. Please calm down.”<br><br>\nFinally, Kirk's eyes seemed to focus and he ceased struggling against Spock's grip, hoarse screams turning into small gasps. Spock could feel some of the fear recede through their temporary connection, though it was clear Kirk was still incredibly scared.<br><br>\n“Spock?” he finally croaked.<br><br>\n“Yes. You had, I believe, another nightmare.”<br><br>\n“Oh. Yes,” Kirk said. Having ceased the thrashing, he was now shaking and trembling with exhaustion. His hands, which had previously scratched at Spock's skin, were curled around his lower arms in what Spock assumed was a search of support.<br><br>\nHe was growing uncomfortable with the prolonged contact. Carefully, he let go of Kirk’s shoulders, but the man only held on tighter to Spock’s arms. With his violent movements, he had pushed the sleeves of Spock’s robes up and past his elbows, which meant he was still touching Spock’s skin directly. Waves of fear kept drumming against Spock’s mental shields, shaking his control.<br><br>\n“Are you capable of letting go of me?” he asked as calmly as possible after a few moments had passed and Kirk made no move to remove his hands.<br><br>\nKirk nodded, though his fingers did not budge. Slowly but forcefully, Spock drew away until Kirk's fingers fell from his arms by themselves. The lack of direct contact was a relief and Spock took a few moments to close his eyes and reestablish his mental control.<br><br>\nWhen he looked back at Kirk, it was clear the man had realized that he had soiled the bed. His face had flushed deep red and he was staring down into his damp lap instead of meeting Spock’s eyes. Even without a connection Spock knew he was feeling strong shame over wetting the bed.<br><br>\n“You must not be ashamed, Mr. Kirk,” Spock said softly, bowing down to pick up the discarded blanket from the floor. “You are still recuperating from intensive trauma. I hypothesize that moving to a new and thus unfamiliar sleeping environment has upset your mind further. I advise you to use the adjacent facilities to clean up while I take care of your bed.”<br><br>\nKirk only nodded mutely. He got up, not once looking Spock in the eye as he hurried away into the bathroom.<br><br>\nSpock efficiently stripped the bed and left to discard the dirtied sheets in the laundry and retrieve new bedding. On his way back, he encountered his mother in the hallway, wrapped in her Vulcan sleeping tunic and the Terran silk robe she favored in the mornings and late evenings. Her brown hair lay in messy waves around her head.<br><br>\n“Is Jim okay?” she asked at once, giving Spock’s armful a surprised glance. Spock saw the very moment she understood the implications. Her face turned soft and affectionate, a look she often directed at Spock himself.<br><br>\n“He has calmed down now, although he was very upset before. He is suffering from intense nightmares.”<br><br>\n“No wonder, after all he’s been through,” she replied and fell into step beside Spock as he turned to return to the guest room.<br><br>\n“I believe he is in need of mental counseling,” Spock stated carefully.<br><br>\n“Have you suggested that to him?”<br><br>\n“Not yet, though I am convinced the healers have made their own recommendations. He has also shown an interest in learning Vulcan meditation techniques. ”<br><br>\n“You should teach him, Spock. It might help until he feels better or can return to Earth for proper therapy.”<br><br>\nSpock nodded. They had nearly reached Kirk’s room. Stopping a few paces away, Spock lowered his voice.<br><br>\n“I propose you return to your own room. While your worry is certainly appreciated, I am not sure Mr. Kirk would be comfortable with another person observing his current plight.”<br><br>\n“Of course, dear. Take care of him.”<br><br>\nBefore Spock could prevent it, she had raised her hand and caressed his cheek with a warm thumb. As a child, Spock had always found his mother’s warmer skin to be soothing.<br><br>\n“Sleep well, Mother,” he said stiffly and accepted her fond smile with a nod.<br><br>\nStepping back into Kirk’s room, Spock spotted the man standing by the door, dressed in a new pair of sleeping pants and clutching the other pair in his hands. His eyes were red and shiny, indicating that he had most likely cried after Spock left.<br><br>\n“You may put those by the door. I will show you the laundry room in the morning,” Spock informed him and approached the bed.<br><br>\n“Sorry,” Kirk said after placing his soiled pants by the door. “Really. You shouldn’t have to do this.”<br><br>\n“You are our guest as well as a recovering patient. Assisting you until you are recovered is logical.”<br><br>\n“And how is pissing the bed like a scared kid ‘logical’?”<br><br>\n“I take it your question is of a rhetorical kind, as I doubt I must explain to you the workings of mental stress and trauma on the Human psyche.”<br><br>\nMaking sure Kirk had not soiled the mattress as well -- he had not -- Spock started to make up the bed once more. A sharp inhale from Kirk disturbed him and he looked up again.<br><br>\n“I hurt you,” Kirk said, pointing towards Spock’s still exposed arms. His face showed genuine regret.<br><br>\nA glance downwards showed three scratches on either arm, all of them glistening slightly green in the light of the overhead lamps. Spock adjusted the sleeves with two precise tugs, concealing the injuries.<br><br>\n“It is of no consequence. They are hardly deep enough to waste the resources of a dermal regenerator.” Folding and pressing the corners of the sheets in the Vulcan fashion, Spock finally draped a new knit blanket over the bed and straightened up. “You can now return to sleep. If you need any further assistance, do not hesitate to call upon me in my room. I take it you remember where it is located?”<br><br>\n“Yeah, of course. Thanks, Spock. Really. <em>Wa’paitaren du</em>.\"<br><br>\nSpock inclined his head, unwilling to again remind Kirk of the illogic behind unnecessary gratitude. “Rest well.”<br><br>\nPicking up Kirk’s discarded sleepwear, Spock was almost out of the room when Kirk called him back.<br><br>\n“Spock, wait!”<br><br>\nSpock turned. “Yes?”<br><br>\n“I ...” Kirk cleared his throat, scrubbing a hand down his face. “Could you ... I mean ...”<br><br>\nWhen no comprehensible explanation was forthcoming, Spock tilted his head in inquiry: “Do you require my help with anything?”<br><br>\nAnew, Kirk’s face turned red, though he did say: “Can you … stay for a while? I’d like to talk for a bit or, you know, do something. Get my mind off things. I don’t think I can go back to sleep so soon after … this.”<br><br>\nSpock stared at Kirk, taken aback by the request. Although Kirk had commented on how he found Spock’s company pleasant before, Spock had not expected to be asked to stay as a supportive measure after something as private as a nightmare. Slowly, he nodded his consent. “Of course. Let me return to the laundry room and I shall join you again afterwards. Would you like to play another game of chess?”<br><br>\nKirk’s small smile suited him much better than the mortified expression he had worn before. “Yeah. Yeah, that’d be great.”<br></p>\n<p></p>\n<p></p>\n<p>__ __ __</p>\n<p><br><br>\nBreakfast was a quiet affair, although a Human might have described it as <em>awkward</em>.<br><br>\nAfter settling down with Spock and his parents for the morning meal, Kirk had apologized profusely for last night’s disturbance, once more blushing Terran pink as he made his excuses.<br><br>\nBoth Sarek and Amanda had assured him that it was nothing to worry about, but from Kirk’s repeated apologies and his following silence, it was clear he did not share that view. Spock watched him eat his morning dish with a distinct lack of his usual enthusiasm. He had not voiced any objections to Vulcan fare before, but seemed dissatisfied with his meal.<br><br>\n“Is your <em>thas t’kheh</em> not to your liking, Jim?” he asked, nodding at the bowl of mashed grain. Spock’s mother had always likened it to Terran porridge, but with a tart flavor to it.<br><br>\n“No, it’s very good, thank you,” Kirk replied at once. As if to prove it, he scooped up a much bigger portion than before with his glass <em>floku</em> and swallowed it quickly.<br><br>\n“I always thought it tasted even better when adding some slices of <em>pla-savas</em>,” Spock’s mother added gently, pointing at the bowl of dark blue fruit in the middle of the table.<br><br>\nKirk politely declined, returning to silently looking at his dish, stirring the mash with his <em>floku</em>.<br><br>\nSpock did not miss the significant glance Amanda threw at him. It was clear she wanted him to change the mood Kirk was in. How he was supposed to do that, Spock did not know.<br><br>\nWhen Spock did not say anything, his mother shook her head and initiated further conversation herself: “Is there anything you would like to see while you are staying on Vulcan, Jim? I’m sure Spock would be very happy to show you around. It’s usually quite bearable outside before the heat of noon.”<br><br>\n“I wouldn’t want to inconvenience anyone,” Kirk said, smiling faintly as he set down his cutlery. “I’m sure Spock has something better to do than keep me company all day. He’s already spent so much time at the hospital with me, it must be very tiring.”<br><br>\nSpock tensed on his chair as he watched his father’s eyes narrow at Kirk’s words.<br><br>\n“Has Spock given you the impression that he finds your company ‘tiring’, <em>oveh</em>?” Sarek asked.<br><br>\nKirk glanced at Spock, but shook his head. “No, <em>kevet-dutar</em>, not at all. Spock’s much too kind to say anything of the sort.”<br><br>\nAlthough Spock was sure Kirk was trying to defend him, he could tell his father had interpreted the sentence quite differently.<br><br>\n“I am available to you for as long as you like, Jim,” Spock assured him, avoiding his father’s eyes. “As I have told you before, Starfleet has granted me leave for as long as I deem it necessary. My current task is taking care of your needs as you recover on Vulcan.”<br><br>\n“Yeah, about that,” Kirk said, placing his hands in his lap as he straightened on his chair. “I’m of course happy to meet with the Council tomorrow, but other than that, there doesn’t seem to be much reason for me to stay. It’s not Vulcan’s responsibility to take care of me. I was injured during a Starfleet mission, so it should be Starfleet who fixes me up. I no longer have to stay in the hospital, so I’m sure a nearby vessel can pick me up and transport me back to Earth for the rest of my recovery.”<br><br>\n“Are you not satisfied with your stay here on Vulcan, <em>oveh</em>?” Sarek asked, eyebrows twitching. Spock had hardly seen him display this much irritation, but he knew it was not directed at Kirk.<br><br>\n“No! No, not at all,” Kirk said, looking apologetic. “I didn’t mean that. I’m very grateful for all that’s been done for me. Your healers have done wonders, it’s a miracle I’m as functional as I am given the state I was in. It’s just that I don’t feel like I should impose on your people anymore than is necessary. You’ve already done more than your share.”<br><br>\n“It is no imposition, <em>oveh</em>, to take care of the one who has rescued our planet,” Sarek told him.<br><br>\nKirk cleared his throat. “That’s very kind of you to say. But I already talked to Spock about that, and it’s really not … I mean, I’m very happy Vulcan was saved, but it wasn’t just me and it’s no reason to go out of your way to accommodate me.”<br><br>\nHearing that, Sarek turned his head towards Spock. For a full Vulcan, his father looked positively thunderous. Spock’s mother, years of experience making her as good a diplomate as her husband, picked up on it at once and hurriedly smiled at Kirk.<br><br>\n“Are you done with that? If so, let me show you the gardens. I have managed to plant some Terran plants in Vulcan soil, would you like to see?”<br><br>\n“Um, sure,” Kirk said and stood with Amanda, throwing a glance a Spock and his father before he was led from the room, abandoning his meal.<br><br>\nSpock calmly lay down his own cutlery before facing his father. Switching to Vulcan, Sarek made no point in hiding his disapproval.<br><br>\n“I must deduce from this conversation that you have given the honorable James Kirk the impression that he is unwelcome on Vulcan,” he said sharply.<br><br>\n“Negative,” Spock replied. “I have repeatedly stated that our people are honored to have him as our guest.”<br><br>\n“It is clear that he does not know that. He even stated that a conversation with you ascertained his misguided point of view.”<br><br>\n“He has voiced discomfort at being regarded as what he termed ‘a hero’. He is convinced he does not deserve any more praise than any other Starfleet member that was part of the rescue mission and seems to have drawn the erroneous conclusion that this also makes him unworthy of the extensive care offered to him on Vulcan. At no point have I agreed with his faulty logic.”<br><br>\n“It is your duty as his current caregiver to make him understand that he is welcome and realize the regard of the Vulcan people. It is clear there must lie fault in your dealings with the honorable James Kirk for him to believe such illogical things to be true.”<br><br>\nSpock stood, his chair scraping loudly against the floor. At once, Spock regretted the movement so close to an emotional outburst.<br><br>\n“You find me to be an inadequate caregiver to James Kirk?” Spock asked, trying to keep his calm in face of such offense.<br><br>\n“It is the logical conclusion, given the misconceptions our esteemed guest is harboring,” Sarek returned, also standing up, but in a much more dignified manner than Spock.<br><br>\n“Are you certain you are not allowing your disapproval of my choice to reject my place in the Vulcan Science Academy to join Starfleet and reside on Earth among Mother’s people cloud your judgement?”<br><br>\n“Unlike you, I adhere to logic at all times. I have not strayed from the Vulcan way.”<br><br>\nFor a moment, Spock felt like he could not breathe. Then, icy calm overtook him, a control so fierce any Vulcan would approve.<br><br>\n“I understand,” he said and turned to leave the room.<br><br>\n“Now you run from this conversation?” his father called after him. “Are you truly that unbalanced that you must flee?”<br><br>\nSpock turned once more, facing his father: “I am not running, nor am I lacking control. Rather, I see that our conversation has reached its logical conclusion. As you are convinced I have fallen from Surak’s teachings and Vulcan logic, there is no merit in continuing this argument, as you will not deem my point of view valuable or even worth considering.”<br><br>\nWith that, Spock left.</p>\n<p>For ten minutes, Jim listened quietly to Amanda talking about her various plants before interrupting her to say: “Did I get Spock into trouble with Sarek?”<br><br>\nAmanda straightened from where she had been inspecting one of her Terran cacti, glancing at Jim.<br><br>\n“I did, didn’t I?” he pressed.<br><br>\n“It’s really not your fault,” Amanda sighed and nodded towards a stone bench standing in the shade by the house.<br><br>\nThey sat down and for the fifteenth time or so, Jim brushed a sheen of sweat off his forehead. How Amanda managed to keep her cool in this heat, all wrapped up in her headscarf and long dress, he honestly did not know. Even though it was still morning and supposedly cool for Vulcan standards, it had to be 30 degrees Celsius at least and Jim was feeling damp already. It didn’t help that every movement was much more exhausting, given Vulcan gravity and the thinner atmosphere.<br><br>\n“Even I could tell Sarek was angry with Spock after what I told him,” Jim said, curling his fingers around the edge of the bench and feeling the sharp Vulcan stone cut lightly into his skin. It felt good, given the decreased sensation in his hands.<br><br>\n“Things have been tense for a while between them,” Amanda sighed. “Honestly, you could probably have lauded Spock for hours and my dear husband would still find a flaw in our son’s behavior.”<br><br>\nJim frowned. “What happened?” he asked, then caught himself. “I’m sorry, it’s really not any of my business--”<br><br>\n“Nonsense,” Amanda interrupted, smiling at him. “You live with us and have to endure their childish behavior, so you deserve an explanation. It all comes down to them being stubborn Vulcans, completely unable to tell each other how they really feel.”<br><br>\nJim snorted. “Yeah, well, I didn’t think Vulcans and emotions went together so great.”<br><br>\n“Vulcans strive to control their emotions, but really, they feel much more strongly than we do, much more intensely,“ Amanda explained, her voice laced with obvious fondness. “Believe me, I’ve shared my mind with one for over three decades. They do feel, but they will their emotions down in the pursuit of pure logic.”<br><br>\n“Doesn’t sound too healthy.”<br><br>\nAmanda laughed. “Not to us Humans, no. They cope well, though, in general. They’ve had centuries of practice and Surak’s teachings to guide them. Vulcan society has prospered through their control, but sometimes, it really makes it difficult for them to communicate. There is a difference between controlling your emotions and suppressing them. And in the end, logic cannot solve all.”<br><br>\n“Don’t tell Spock you said that,” Jim joked, but Amanda’s face was serious.<br><br>\n“Spock knows this, deep down, but he ignores it. As does my husband. Did you know Spock was accepted to the Vulcan Science Academy after he’d finished his schooling?”<br><br>\nJim shook his head, shrugging awkwardly. “To be honest, we had only known each other for a few hours before … well, before Nero and all that.” Though he really wished they had met earlier these days. Spock was -- well, really something. Jim had been trying to ignore the butterflies he was feeling lately during their chess games.<br><br>\n“Really? It’s hard to imagine, seeing how much he cares for you now.” Jim opened his mouth to protest, but Amanda had already moved on. “Either way, Spock refused the Academy and left for Earth to join Starfleet soon after. Sarek was not pleased. It was the first time any Vulcan has refused admittance, you have to realize.”<br><br>\nA grin spread slowly on Jim’s face. “Wouldn’t have taken Spock for a rebel. Good for him, though. Starfleet is head over heels for him, from what I hear.”<br><br>\nAmanda smiled back. “I don’t think it was easy for him, leaving Vulcan, but he did seem happy once he settled down and made friends.” Her smile faded and she sighed, looking away and out into the small, rocky garden. “Sarek isn’t blind. He can see how good Earth has been for Spock, but he cannot acknowledge it. For him, the logical choice for Spock would have been to accept his place at the Science Academy and live an entirely Vulcan life instead of going to explore the universe and his Human side.”<br><br>\n“You don’t think they’ll make up any time soon?”<br><br>\nAmanda shook her head. “I’ve tried to make amends, to get them to talk, but it never ends well. Spock feels rejected and misunderstood, and the frustration Sarek tries to push aside after one of their talks gives me a splitting headache right through our bound, I’ll let you know.”<br><br>\nThe last part sounded a lot like a trademark Bonesian grumble, and Jim couldn’t help but smile.<br><br>\nHe felt a swell of admiration for this woman. It was clear she was intelligent, brave enough to leave her planet behind to live on another, adapt to a life completely different to what she had known. And now, she tried to help her son navigate his path between two worlds, make amends between her Vulcan husband and half-Human child.<br><br>\nActing on instinct, he reached out for her hand and squeezed it. “I’m sure it’ll be okay. They can’t keep arguing forever, can they?”<br><br>\n“You clearly don’t know much about Vulcans and their grudges,” she told him, but her fingers curled briefly around Jim’s in response and she smiled at him, eyes crinkling kindly.<br><br>\n“I take it you and Jim have finished your tour of the gardens?”<br><br>\nJim nearly jumped off the bench in surprise. Blinking upwards, he saw Spock narrowing his eyes at their joined hands. Jim quickly let go of Amanda’s fingers, suddenly feeling embarrassed. The gesture, while certainly affectionate among Humans, had to look utterly intimate to a Vulcan. Jim didn’t want Spock to think he was -- what, hitting on his mom? Damn.<br><br>\n“Jim’s been kind enough to listen to my endless chatter on various cacti,” Amanda confirmed with an easy smile.<br><br>\n“You are well versed in Terran cactoid plant life and how it fares on Vulcan. I am sure Jim appreciated sharing your unique and rather extensive botanic knowledge.” The look Spock threw him dared him to say otherwise.<br><br><em>Bit of a mama’s boy,</em> Jim thought with a surge of amusement and fondness. Seeing Spock interact with his mother had been a revelation. While he was pretending to be unaffected, Jim had seen the affectionate little glances and touches he usually offered in return. It was endearing in a way that Jim tried not to think about too much.<br><br>\nHe hurried to nod at Spock, covering an escaping laugh with a little cough.<br><br>\n“Are you feeling unwell?” Spock asked immediately and Jim felt bad for making him worry -- again. Spock was taking his caretaker duties very serious.<br><br>\n“Just a dry throat,” Jim said quickly. “It’s really hot outside. I don’t think I’m up to any sightseeing in this heat, to be honest.”<br><br>\n“Then it would be best to retire inside. If you are amenable, I can show you some of the Vulcan relaxation techniques I have mentioned to you before.”<br><br>\n“Sounds great.”<br><br>\n“Will you join us, Mother?” Spock asked, arms tucked behind his back as Amanda stood from the bench.<br><br>\n“No, I think I’ll pass.” They started to walk back towards the house. “You boys have fun.”<br><br>\n“You know we are both considered mature adults in our respective cultures, mother,” Spock chastised her lightly. “Furthermore, Jim and I will aspire to clear his mind, not seek pointless amusement from it.”<br><br><em>Hopeless</em>, Amanda mouthed at Jim as they entered the house and winked at him when Spock had his back turned to them. Jim had to bite his lip not to burst into undignified giggles</p>\n<p></p>\n<p></p>\n<p>__ __ __</p>\n<p><br><br>\n\"Like this?\" Jim asked as he adjusted his feet yet again.<br><br>\n\"It is sufficient,\" Spock told him. Jim heard the <em>barely adequate</em> without it being spoken out loud. Lucky for him, Spock seemed to be a rather patient teacher.<br><br>\n\"How can I manage to clear my mind when I can't even get my feet to stick to each other?\" One of his joints popped audibly as he adjusted his legs.<br><br>\n“I fail to understand how such a simple position can cause such difficulty for you.”<br><br>\n“Hey, I’m still recovering. Give me a break!” Jim joked defensively, and immediately regretted it. He should know better by now. For some reason, Spock was unable to see Jim’s health as any sort of joking matter. The only other person who had ever been so particular about it was Bones.<br><br>\n“Your former injuries are troubling you again?” Spock asked at once, leaning closer with assessing eyes. “Shall I call for a healer?”<br><br>\n“Spock, I was just teasing.”<br><br>\nSpock’s frown was very noticeable just then. “Please refrain from ‘joking’ or ‘teasing’ about your state of health. It is not something to take lightly.”<br><br>\n“I’m sorry,” Jim sighed.<br><br>\n“Instead of apologizing, I would prefer you aspire to change your behavior. It is illogical to voice regret over actions one plans to repeat in the future.”<br><br>\nOuch. Maybe, Amanda had been right when she had pointed out that Spock cared a lot more than strictly expected, though Jim doubted he was feeling any of the warm tingles Jim had been experiencing for a while.<br><br>\n“I’ll try,” he promised seriously.<br><br>\nSpock nodded. After lighting a small amount of spicy Vulcan incense, he gracefully slid into the position Jim had struggled to achieve. He didn’t seem to have any trouble sticking the soles of his feet together while placing his knees on the floor. He rested his hands, palms facing downwards, on his ankles. His back was perfectly straight.<br><br>\n“This is <em>loshirak</em>, the open posture,” he explained. “It is the simplest of all meditation postures, taught to Vulcan children as soon as they are capable of controlling their limbs for an extended amount of time.”<br><br>\nSo kids could do this better than him. Fantastic. Suppressing a sigh, Jim forced his knees vaguely towards the ground and placed his hands on his ankles like Spock, hoping his feet wouldn’t slip again.<br><br>\n“Now you will aspire to master the <em>tu-lan</em>, our method of meditative breathing. It is the first step towards achieving <em>tvi-sochya</em>. A rough translation would be ‘inner peace’.”<br><br>\nFor the next half hour, that was all they did -- breathe. As the first twenty minutes or so passed, Jim felt incredibly awkward as he let warm air flow through his nose, silently counting to ten for each cycle. He knew this was supposed to clear his mind, but really, all it did for him seemed to be making him brood more.<br><br>\nHe kept losing count, and when he wasn’t thinking about how hopeless he was at this, his mind flashed back to his time at Shi’Khar hospital, the tense minutes spent fighting on Nero’s drilling platform, the look on Spock’s face when he had woken him from his nightmare ...<br><br>\nEventually, though, he could feel a difference. Slowly, his mind seemed to calm down and an intense sort of quiet washed over him. It almost felt like falling asleep, except he was more aware of his own heartbeat, the tension of his muscles, his fingers curled loosely around his ankles.<br><br>\nIt did not last long, a mere thirty seconds or so, before he felt his feet slip. He let out a small curse as he lost his balance, slumping where he sat on the soft meditation mat Spock had lent him.<br><br>\nWhen he looked up, Spock was looking at him with raised eyebrows, posture still perfect.<br><br>\n“It worked -- for, like, a few moments,” Jim told him.<br><br>\n“Please elaborate.”<br><br>\n“I felt, um, really calm. Relaxed, but I was kind of focusing on my heartbeat and my muscles, too. Kind of a -- focused floating?”<br><br>\n“It is a beginning,” Spock said after brief contemplation, gracefully uncurling from his position and standing up. “I advise you to exercise <em>tu-lan</em> twice daily until you master it. Once you can achieve that state of what you call ‘focused floating’ for at least thirty minutes, we can move on to the next technique.”<br><br>\nJim blinked up to him from his mat. “And you really believe this will help with the nightmares?”<br><br>\n“As I have never experienced a nightmare, I cannot say for certain. However, it is clear to me that your mind is deeply troubled and you are quite upset by the past events. It appears logical to assume that disciplining the mind will ease the chaos created by trauma and help you settle in the night.”<br><br>\n“Well, it’s worth a try at any rate,” Jim said, rearranging his feet to the posture he had been shown. With the heat outside steadily increasing, it wasn’t like he had anything better to do. If only he weren’t so sweaty all the time, maybe his feet would stick together after all.<br><br>\n“It certainly is. As you are clearly preparing for another attempt, I shall leave you to meditate in peace. As always, you may call on me in my room if you require anything at all.”<br><br>\n“Thanks, Spock,” Jim said, smiling up at him before closing his eyes and focusing on his breathing.<br><br>\nHe could practically hear Spock’s distaste over his thanking him again. <em>Illogical as it might be,</em> Jim thought as he settled into the breathing pattern, <em>it’s just one of those things he will have to get used to.</em><br><br>\nHe did not achieve the floating sensation again.</p>\n<p></p>\n<p></p>\n<p>__ __ __</p>\n<p><br>\nThe timing was fucking perfect, bordering on unbelievable really, but Jim was not one to question his luck. His arms curled firmly around the capsule and he felt the metal casing grind harshly against his ribcage, and then, he was plummeting fast towards the red planet underneath.<br><br>\nHe held on to the missile as if his life depended on it, trying to calculate the risk of using one arm to pull his chute. He was sure he wouldn’t be able to grab the thing again once he lost it.<br><br><em>Enterprise to Kirk, what ez happening? Why did you jump off ze drill?</em><br><br>\nThe wind was whipping harshly past Jim as he raced straight towards the ground, making it even harder for him to understand the Russian than it was in the first place.<br><br>\n“They launched something toward the planet!” Jim replied urgently, very much out of breath and trying hard not to panic. Which, seeing as he was currently free-falling towards the planet’s surface at mind-numbing speed, was pretty fucking impossible. “I don’t know what it is exactly, but if they’re throwing it into the hole they drilled, it’s likely some sort of bomb.”<br><br><em>What? You will fall into ze hole along with ze missile!</em> the kid reminded him, leaving communications protocol behind in favor of freaking out at him. Fucking fantastic.<br><br>\n“Pulling my chute now,” Kirk informed him and finally dared loosening his grip to activate the rip line.<br><br>\nIt was a fucking miracle the sudden lurch didn’t make him lose his grip on the device or killed the chute, but he still had the thing and it hadn’t exploded yet and Jim took a huge breath as his descend was slowed.<br><br>\nStill, the thing was heavy as fuck, pulling him down at a much greater speed than usual. Also, his damn arms were hurting and he was sure he might have cracked a rib or two with this stunt if the pain in his chest was anything to go by. They would have to beam him up fast.<br><br>\n“Did you get Sulu off the drill yet?” he shouted towards the small, mobile comm attached to his ear.<br><br><em>Yes, yes, he ez in ze transporter room.</em><br><br>\nIt hit Jim then that he wasn’t wearing his helmet. Really, he had no protective gear beside the suit he was wearing and the chute on his back, straining under the weight of both Jim and the bomb.<br><br>\nHowever, there was no fucking way he’d let them beam him onto the <em>Enterprise</em>, not with an unpredictable demolition device in tow.<br><br>\nJim stared down at the red ground of Vulcan coming closer and closer.<br><br>\nSwallowing, he realized that this was it. There was no way he could get the bomb off Vulcan and himself safely back onto the ship without risking the lives of hundreds of people. It was either he left the bomb and see it disappear into the hole, leaving no chance for the <em>Enterprise</em> to lock onto it, or he went right into space with it.<br><br>\nJim had to fight a bout of hysterical laughter. Maybe, Spock had been right about the <em>Kobayashi Maru</em>: there were no-win scenarios after all.<br><br>\n“Listen up, <em>Enterprise</em>,” Jim gasped against the whipping wind. “I don’t know what this thing is, but I have two minutes tops until I’m going to be past the hole and too far in for you to tag me, so you’ve got to beam me up and into space as soon as possible.”<br><br><em>What?</em><br><br>\n“You heard me,” Kirk repeated through clenched teeth. To make things worse, the wind suddenly changed and the chute lurched again, shaking him badly. <em>Fuck.</em> He prayed to whatever damn deity out there that the fucking missile would hold out on him until he was off-planet.<br><br>\n“Beam me site-to-site, right into space, <em>Enterprise</em>, as far away as you can get me. We don’t know when this fucking thing will go off, but I’d rather it wasn’t this close to Vulcan!”<br><br>\nA lengthy pause. Then, Jim heard Commander Spock’s voice, calm and measured. <em>You realize the risks of such an endeavour?</em><br><br>\nJim felt heated anger bubbling in his stomach. Did Spock really think him that stupid?<br><br>\n“Of course I fucking do,” he shouted, wondering faintly if his anger didn’t simply make him sound more fearful. “I’ve got no helmet, no oxygen, no nothing. My eyeballs’ll be bleeding.” And now he sounded like Bones.<br><br>\nAnd, oh God, but Bones. Jim would never see him again. Never sit at the ocean at night drinking bourbon, or sneak into his dorm room at two am because he felt lonely, or listen to him bitch about Jocelyn, and Jim better not get married, ever.<br><br><em>Your chances of survival are less than point one percent</em>, Spock continued, sounding as unfazed as only a Vulcan could. <em>It is highly unlikely we will be able to reenergize and beam you aboard quickly enough to avoid permanent damage to your person. Doing this will almost certainly result in your death.</em><br><br>\n“I fucking know, just fucking do it!” Jim bellowed, squeezing his eyes shut against the coils of emotion in his chest, the adrenaline spiking through his body. His voice sounded raw. “You need to beam me up now, Spock, or you might as well watch me and the fucking bomb collide with your home planet! I doubt that’s gonna be pretty!”<br><br>\nMore silence, and for a second, Jim actually believed Spock was going to order him to let go of the capsule and let himself be beamed aboard safely.<br><br><em>Ensign Chekov,</em> Spock’s voice finally returned. <em>Prepare to beam Mr. Kirk directly into space, site-to-site transport.</em><br><br>\n“Jesus, fucking finally,” Jim whispered, eyes closed, waiting for the familiar tingle of the transporter beam to fetch him.<br><br>\nBut it didn’t, it fucking didn’t, and Jim kept plummeting downwards, still clutching the bomb.<br><br>\n“<em>Enterprise</em>, what is going on?” he screamed, but his left ear was filled with nothing but static, and the red sands of Vulcan came closer, so much closer and so quickly and--<br><br>\nThe next thing Jim knew, he was sitting up in bed, drenched in sweat and breathing heavily. He was clutching his newly pointed ear as if the mobile comm was still attached, but the buzzing was gone. It took him a few moments to calm down enough to realize that no, he wasn’t falling towards Vulcan but residing on it.<br><br>\nJim allowed himself a few quiet sobs before forcing himself to breathe evenly.<br><br>\nAt least, he hadn’t pissed the bed again. Neither had Spock come running like a worried mother hen. Most likely, Jim hadn’t screamed the house down this time.<br><br>\nFeeling shaky, Jim fell back against his pillow, kicking off the knit blanket resting on his legs in a tangled mess. Fuck, but he was so screwed up. At least this time, it hadn’t been Nero cutting off his toes and ear with grotesque, giant scissors, all the while telling him what a worthless little shit he was in a voice that sounded like Frank’s.<br><br>\nAs nightmares went, this one had actually been frighteningly realistic, except for the ending. Maybe, the Vulcan breathing thing was already working, forcing him to deal with what actually happened instead of making up fucked-up dreams for all the shit he couldn’t remember from the <em>Narada</em>.<br><br>\nBut why was he dreaming about screwing up the mission completely then? What the hell was going on with him?<br><br>\nFeeling hot and sticky, Jim stood and moved into the bathroom. At this rate, he’d use the sonic three times a day. The heat on Vulcan was killing him, and covering himself in fright sweat during the cooler nights did the rest.<br><br>\nAvoiding looking into the mirror, Jim entered the shower, hit the right button and closed his eyes as he was cleaned quickly and efficiently.<br><br>\nHe’d have to get better soon, but first of all, he had to leave. No matter what Spock and his parents said, he could tell when he was being a nuisance. What he needed was a nice set of psychotropic drugs and 0-degree-weather. Surely, Starfleet could provide him with both. Send him off to recover on some snow-covered planet until he was functional again.<br><br>\nIf Jim really was this much of a wreck, it definitely wasn’t Vulcan’s job to take care of it, that much was sure.<br><br>\nHissing in anger, Jim hit the off-button with more force than necessary and left the shower. He’d have lunch with the Elders and then leave.<br><br>\nThat was his plan, and he’d stick to it</p>\n<p></p>\n<p></p>\n<p>__ __ __</p>\n<p><br>\n“What do you mean, leave Vulcan? They trying to get rid of you already?”<br><br>\nJim shrugged as Bones squinted at him from the screen. “I’ve been here long enough”, he said vaguely.<br><br>\n“It’s not even been a full month,” Bones argued. “Most of which you spent in the hospital throwing a fit whenever somebody went anywhere near you. It’s a damn miracle you’re walking around already. You know what kind of state we found you in.”<br><br>\nJim scowled, letting out an exasperated sigh. “Will you help me or not?” he demanded. “I’d rather not contact the brass directly. I’m not even sure if I’m not still suspended because of the <em>Kobayashi Maru</em>.”<br><br>\nBones snorted. “Please. You think they can afford kicking out the guy that saved Vulcan? Starfleet can be stupid, but they’re not likely to admit that they had planned on leaving you on Earth when Nero attacked. For all I know they’ve already made up some bullshit excuse about ‘inventive thinking’ or something to get you off the charges. Plus, I’m fairly sure you’ll be keeping your field promotion too once you’ve finished debriefing for Vulcan and Nero. We all did.”<br><br>\n“Still,” Jim pressed, ignoring the queasy feeling in his stomach. “I’d rather you organize this, Bones. Please?”<br><br>\nBones tilted his head.<br><br>\n“Look, kid, I’m the first to tell you that Vulcans can be exhausting, what with being emotionally stunted and all that, but you’re in no state to travel. I can tell even from this shaky vid comm that you’re still weak and the files they sent me clearly state you need ongoing medical surveillance for your heart and renutrition. The stress alone would set you back weeks. Why don’t you give it some more time? You’re not missing anything here, Jim. Graduation is still a month off and it’s not like you can’t take your finals when you’re back. They’re making exceptions for all of us already, one more won’t make much of a difference.”<br><br>\nFrustrated, Jim scowled at the screen. “I don’t give a fuck about graduation, Bones,” he snapped. “I just want to leave, okay?”<br><br>\n“No need to be cranky with me,” Bones snapped right back, then his voice softened. “Talk to me, Jim. What’s the real problem here? You said they’re treating you well. Hell, they love you so much they plastered a Vulcan ear to you head, so what is it?”<br><br>\nSuddenly feeling incredibly weary, Jim rubbed a hand over his face. It came away sticky with sweat. God, the heat was unbearable.<br><br>\n“I just want to leave,” he repeated helplessly. “Please, Bones? I’d owe you big time.”<br><br>\nProbably tired of Jim’s whining, Bones sighed his consent. “Fine. I’ll see what I can do. But I’m not promising anything, okay? I don’t know if you’ve realized, but the brass don’t take kindly to a group of senior cadets stealing a Starfleet shuttle to go on a haywire rescue mission with their Vulcan instructor. I’m not exactly on their nice list at the moment, special commendation or no.”<br><br>\n“Yeah, I get it. Thanks, Bones, really. You’re the best.”<br><br>\n“Don’t mention it, kid. Just get better soon, you hear me?”<br><br>\n“‘kay,” Jim replied, summoning a smile before Bones disconnected the call.<br><br>\nAs soon as he disappeared from the screen, Jim heaved a deep sigh and leaned back into the chair. It wasn’t even dusk and he already felt like sleeping again, having declined another offer by Spock to show him around Shi’Khar.<br><br>\nHe simply felt too tired and exhausted. The nightmares were getting to him and the heat wasn’t any help either. Even in the climatized house, the temperature was hardly bearable. Jim envied Amanda her years of assimilation.<br><br>\nWith a frown, Jim checked over the controls, his brain taking a bit to sort out the Vulcan symbols before he shut off the terminal.<br><br>\nJust a few more days and Bones would hopefully call back with news of a Starfleet vessel travelling by and picking him up. Jim could hardly wait</p>\n<p></p>\n<p></p>\n<p>__ __ __</p>\n<p><br>\nThe worst thing about the formal robes wasn’t the color -- a shiny, metallic fabric -- or even the cut -- high collar, bell-shaped sleeves -- but the way they made Jim sweat even more than he already was ten seconds after putting them on.<br><br>\n“I will die in these,” he told Spock seriously as the Vulcan adjusted the folds to undoubtedly precise geometric angles. “I will literally die.”<br><br>\n“A set of robes has yet to cause premature death,” Spock replied, showing no mercy as he tugged at Jim’s sleeves. The bastard.<br><br>\n“It’s a million degrees out and this fabric doesn’t let my skin breathe,” Jim said, trying for some sort of logical argument. “It is very likely I will faint in the heat, given that they scheduled this at lunchtime of all things.”<br><br>\n“It is not a mere luncheon,” Spock argued reasonably and God, where did he dig up this kind of vocabulary? “It is a traditional mid-day meal, a most honorable occasion. In addition, while I would share your concerns about the heat were the ceremony to take place outside, it is actually held in the Hall of Ancient Thought at Mount Seleya, where it is much cooler.”<br><br>\n“Much cooler, really? Are we talking Vulcan cool or Human cool?”<br><br>\n“Due to the thick layers of rock surrounding the Hall, the average temperature there usually resides at about eleven degrees Celsius.”<br><br>\nJim nearly sighed with bliss at the mere thought. “That actually sounds wonderful.”<br><br>\nSpock inclined his head. “The Hall itself is impenetrable to both communication and transporter signals. Therefore, you will be transported as close to the entrance as possible, where an Elder will await you and lead you to your final destination.” Spock paused and stepped back, looking Jim over before giving one nod. “You look adequate for the occasion.”<br><br>\nStill, he eyed Jim’s grown-out hair in a way that made Jim fear that Spock was considering a Vulcan haircut. Hurriedly, Jim redirected his attention: “So, the Hall of Ancient Thought. Isn’t that where all the important <em>katra</em> are stored?”<br><br>\nSpock inclined his head. “Indeed. Among the valuable and ancient artifacts stored there and in the adjacent chambers are the <em>katra</em> of our most esteemed predecessors as well as the <em>Kir’Shara</em>.”<br><br>\n“The artifact that contains all writings of Surak?” Jim asked for confirmation.<br><br>\n“The very same.”<br><br>\n“If it’s such a holy and important place, why invite me there for lunch of all things?” Jim asked, honestly confused. Both the Mountain and the Hall were practically the Vulcan equivalent to divine temples. Jim couldn’t imagine himself munching on fruit and bread while sitting amongst Vulcan’s most precious artifacts.<br><br>\nSpock grew very still. He took a few seconds, possibly to contemplate his explanation, then spoke very precisely: “As I have stated before, it is a most honorable occasion. Few ceremonies are held in the Hall, even fewer allow outsiders to participate. The only Human to have been invited in recent years is, in fact, my mother.”<br><br>\nJim swallowed. No pressure, huh?<br><br>\n“I know you are uncomfortable with being praised for your actions regarding the safety of Vulcan, but I cannot stress enough how much your sacrifice is appreciated among my people,” Spock continued. “The Elders have decided to bestow this honor upon you, undoubtedly to show you their regard for your actions, <em>oveh</em>.”<br><br>\nAnd they were back to that again. Great. Jim knew he did a poor job suppressing the scowl forming on his face.<br><br>\n“I don’t need ceremonial luncheons,” Jim replied curtly. “I don’t <em>want</em> them.”<br><br>\nSpock narrowed his eyes at him ever so slightly. “Would you like me to inform the Elders and cancel the meeting?”<br><br>\nJim was very tempted to say yes, but he had taken more than enough diplomacy classes at the Academy to see the blatant offense in that.<br><br>\n“Of course not,” he said. “Let’s get this over with.” Spock gave him a tight nod and gestured towards the hallway.<br><br>\nIt spoke of Sarek’s importance and the wealth of Spock’s family that there was a small but fully functional transporter pad installed in their house. While, according to Spock, it was only used for special occasions, Jim doubted this was standard equipment in every Vulcan home. The planet had to have public transporter stations like any other planet.<br><br>\nSometimes, it was easy to forget that Spock was an ambassador’s son. His family had to be part of what boiled down to the Vulcan upper class: old clan name, vast wealth, extremely well educated even for Vulcan standards, greatly respected by their people. Just thinking about it was kind of intimidating.<br><br>\nSarek was waiting for them at the small terminal when they arrived.<br><br>\n“The High Council awaits you, <em>oveh</em>,” he said formally and gestured towards the pad after handing Jim a small, thin communication device which he could fit easily in one of the slim pockets in his robes.<br><br>\n“You are not coming, <em>kevet-dutar</em>?” Jim asked as he stepped up on the designated spot. After all, it had been Sarek who had extended the invitation.<br><br>\n“I am not part of the High Council, <em>oveh</em>,” Sarek explained as Spock stepped up to the terminal. “Our clan’s seat is held by the honorable T’Pau.”<br><br>\n“T’Pau?” Jim repeated. “Wait, the T’Pau?”<br><br>\nSarek inclined his head, glancing at his son working the controls. “Are you ready to depart, <em>oveh</em>?”<br><br>\nStill awed by this particular revelation, Jim nodded. If T’Pau was the clan mother of Spock’s family, they had to be even more influential than Jim had already assumed.<br><br>\nThe last thing he saw before the world dissolved around him was Spock’s serious face focusing on the control panel as he monitored Jim’s transport.<br><br>\nThe first thing he was aware of in his new surroundings was the heat. It was sweltering, even though Jim saw that he had been sent to a place currently covered in the shadow of Mount Seleya. Almost immediately, pearls of sweat were starting to gather on his neck and back and rolled down his sticky skin. Great.<br><br>\n“<em>Oveh</em>,” a brittle voice called from his right. “<em>Dif-tor heh smusma.</em>”<br><br>\nJim turned to see a truly elderly Vulcan present him with the <em>ta’al</em>, his fingers gnarled with age. His straight hair was snow-white and thin, hardly numerous enough to cover his forehead in the straight bangs most Vulcans favored. Jim doubted he was the youngest of the High Council. Why they would send him of all Elders to pick him up, he honestly couldn’t understand.<br><br>\nRemembering his manners, Jim returned the greeting, careful to use honorifics in his speech. His robes rustled as a light wind picked up, but the breeze brought dry, hot air instead of a cool-off. Jim tried his hardest not to sway at the sudden increase in temperature.<br><br>\n“I am Sunvar,” the Elder introduced himself. His Standard had an odd melodic quality to it. “You are not accustomed to these temperatures. Let us retire quickly to the Hall.”<br><br>\nFor a guy his age, Jim noticed as they made their way up the rocky slope to the concealed entrance, he was still very agile. Sunvar was not even out of breath when they entered into the tunnel leading inside the mountain, whereas Jim was catching his breath, feeling his robes cling to his sticky back.<br><br>\nSpock had been right, however, when he had told Jim that the inside of Mount Seleya would be much cooler. Jim let out a big sigh when he felt like he could breathe again. Undoubtedly, he’d start shivering in a minute due to the sudden plunge in temperature. Jim had never been so happy about goosebumps forming on his arms.<br><br>\n“The Council is honored by your acceptance of our invitation, <em>oveh</em>”, Sunvar told him as they made their way further into the mountain.<br><br>\n“I’m honored as well by your invitation, <em>osa-su</em>,” Jim replied formally, feeling uneasy. He hadn’t truly considered how stiff and awkward this meeting would probably be, as focused as he had been on engineering his quick departure from Vulcan. “I realize it’s not common procedure to invite outworlders to the Hall.”<br><br>\n“You are correct, we do not usually invite outworlders here, <em>oveh</em>,” Sunvar replied, throwing Jim a look that seemed oddly intense. He did not say anything else, though.<br><br>\nThe tunnel ended and lead directly into an impressive chamber. Huge stone statues of what were clearly honored Vulcans of the past lined the Hall, with one of them placed right in the middle of the chamber. Even Jim could recognize Surak’s face in the rock-hewn features.<br><br>\n“Welcome to the Hall of Ancient Thought, <em>oveh</em>,” Sunvar announced.<br><br>\nClose to the giant statue of Surak, Jim noticed a large wooden table. Bowls of food were set out on it. Clearly, this was where the meal would take place. Around the table, the rest of the High Council had already taken their seats. As Jim and Sunvar approached, the Elders rose to greet Jim with the <em>ta’al</em>. Suddenly feeling incredibly intimidated by the procedures, Jim returned the gesture, hoping his hand wasn’t shaking as much as he thought it was.<br><br>\n“We greet thee, <em>oveh</em>,” a regal voice announced in stilted Standard. Jim instantly recognized its bearer as T’Pau. Jim doubted there were many people in the Federation who hadn’t heard of T’Pau, one of the most influential Vulcans in existence. T’Pau’s face looked as serious as it befit a Vulcan, her graying hair placed in an elaborate braid around her formal headdress. Her robes were the most embellished of all, clearly a sign of her superior position even among the Council.<br><br>\nAnd to think that Spock was what basically boiled down to her grandson -- Jim swallowed nervously as he inclined his head at her.<br><br>\n“I’m honored by your invitation,” he replied carefully, feeling like any misused word might offend the Council. Which was actually pretty likely. Crap. He should have researched proper protocol for this or at least asked Spock for advice.<br><br>\n“Please take your place by my side, <em>oveh</em>,” T’Pau said, pointing elegantly at the empty chair to her left. “So we may begin with the meal.”<br><br>\nFeeling all eyes on him, Jim carefully made his way around the table and towards his assigned chair. Nervous thoughts made his stomach queasy. Were his robes still looking adequate? Did his face look red and sweaty? Were there any special eating rules he should know of?<br><br>\nJim nearly stumbled as he stepped up to his chair, feet tangling in his robes. Luckily, he didn’t end up falling face-first into the table. God, he would end up embarrassing himself, wouldn’t he?<br><br>\n“Let us be seated,” T’Pau said and everyone obliged, Jim hurrying to sit down as well without messing with the folds of his robes.<br><br>\nThere was an empty plate in front of him, but no cutlery. Also, he noticed, there were two young Vulcans standing off to the side who were clearly not part of the Council. With their plain robes and neat but standard hairstyles, they would clearly serve as some sort of waiters during the meal.<br><br>\nThe food itself turned out to be mainly luscious pieces of various Vulcan fruit and vegetables as well as baked goods. Most of it Jim had never seen before, though he figured they would likely taste as all things Vulcan - very tart, slightly sweet or almost bitter, but not necessarily bad.<br><br>\n“We shall eat first before we will begin with the ceremony,” T’Pau said and the two young Vulcans stepped forward, each taking a carafe of water from the table. They started with Jim and T’Pau, filling their glasses with water before moving around in circles.<br><br>\n“Honorable T’Pau,” the Vulcan to her other side spoke up and T’Pau turned her head. Unlike the Elders Jim had heard so far, his Standard was accent-less. Jim could not tell whether or not the interruption annoyed T’Pau, but he got a sense that he was interrupting what was standard protocol for these kind of occasions. “May I suggest explaining to the honorable James Kirk the aim of this meeting before we commence the meal? It would leave him some time to mentally and emotionally prepare for the ceremony, as Humans tend to prefer.”<br><br>\nJim eyed the Elder with interest. His face was wrinkled with age, his hair a dignified mix of gray and white. He was sporting a haircut almost exactly like Spock’s. Really, now that he was looking at him more closely, Jim figured this particular Vulcan could well be related to him. But then, Jim didn’t know enough about the Vulcan gene pool to properly distinguish between family resemblance and mere shared Vulcanoid traits.<br><br>\n“Your suggestion is logical, Selek,” T’Pau replied before she turned towards Jim, who swallowed. What sort of ‘proposition’ could the Council possibly have for him? “<em>Oveh</em>, it is our wish to grant thee Vulcan citizenship in honor of your deeds regarding the battle against the time-travelling Romulan known as Nero.”<br><br>\nThey -- what? Jim was faintly aware that he was gaping, but was too busy trying to wrap his mind around the concept to try and do anything about it.<br><br>\n“I -- excuse me?” he finally said, too shocked to be embarrassed by his lack of coherence in the face of the Vulcan Council.<br><br>\nT’Pau raised her left eyebrow by the slightest degree, but dutifully repeated: “It is our wish to grant thee Vulcan citizenship in honor of your deeds regarding the battle against the time-travelling Romulan known as Nero.”<br><br>\nShaking his head, Jim raised a hand. “No, I got that -- I mean, wait.” He took a deep breath, fighting the blush threatening to spread on his cheek. Hadn’t he said he’d embarrass himself? “I’m sorry, <em>oko-su</em>, what I meant to say is: Why would you want to do that?”<br><br>\nFrom what Jim could tell, T’Pau looked at him like he was a particularly slow child. He’d bet good credits she was already regretting their proposition. “As I stated, it is to honor your service to our people. As a token of our appreciation, we had already asked the healers to bestow upon you a physical sign of our wish to make thee one of our people.”<br><br>\nHer eyes rested briefly on his left ear. Jim automatically reached for it, tracing the pointed tip with his fingers. “Oh,” was all he could say, suddenly feeling too overwhelmed to speak.<br><br>\nA Vulcan citizen -- him? God, he didn’t even know Vulcans granted any outworlder citizenship unless they were married to one of their own, and that wasn’t a common occurrence either. Vulcans were so keen on keeping their culture and lives private that it was hard even to learn anything in detail about them, let alone be accepted into their circles.<br><br>\nJim had a hard time wrapping his mind around the concept.<br><br>\n“Do you object to our proposition, <em>oveh</em>?” another Elder asked, her speech patterns less antiquated than T’Pau’s but no less formal. She was outright frowning at him from underneath her curly bangs, an emotional display Jim would hardly have expected from an honorable Elder such as her.<br><br>\nIt hit him, then, that a response in the negative would be a grave insult towards Vulcan, and that the way he had acted so far hadn’t shown much appreciation for their clearly highly generous offer. Looking around, he saw more than one face show a hint of or an outright frown.<br><br>\nPanicking a bit, Jim hurried to try and set things right. “Not at all, <em>oko-su</em>,” he said towards the Vulcan that had spoken up before letting his eyes wander around the table as he continued. “It’s just ... unexpected. I realize that my actions have played a part in saving Vulcan, but it really wasn’t just me alone. I didn’t think it would merit such a -- um, gracious offer. I’m honored, really.”<br><br>\nThat did seem to settle most of the frowns, though it was clear they were still not happy with him. Great.<br><br>\n“You do not believe to have shown extraordinary service to the Vulcan people by sacrificing your life to save our planet?” T’Pau asked. Jim had the feeling that her voice sounded pretty incredulous for a Vulcan.<br><br>\n“I didn’t sacrifice my life, <em>oko-su</em>,” he replied. “I’m still alive, after all.”<br><br>\n“I believe what my esteemed peers are trying to convey, Mr. Kirk,” the Elder Selek interjected smoothly, “is that you were willing to sacrifice your life. As we all know, your survival was a statistical anomaly. You could not have known Nero would beam you aboard quickly enough for you to survive exposure to the vacuum of space. Neither was it likely you would live through his torture.”<br><br>\nSuppressing a shudder at Selek’s words, Jim almost missed the unusual form of address. And really, was he imagining it or did Selek seem more laid back about the whole thing than the other Elders? When Jim looked at him more closely, Selek winked at him, only once, before returning his eyes to T’Pau.<br><br>\nJim tried his hardest not to embarrass himself again with another round of gaping. What the hell?<br><br>\n“Selek’s explanation is sound,” T’Pau said. “Am I correct in deducing that you are, in fact, not rejecting our offer?”<br><br>\nFeeling trapped, Jim said the only thing he could reasonably say: “Of course I accept. I am … very honored.”<br><br>\nWith that, the issue was apparently resolved, as T’Pau nodded and commenced the meal by raising her filled glass to her lips.<br><br>\nJim kept mostly quiet as they ate, taking his cue from the Elders and eating with his hands, taking from whatever bowl he liked. Knowing that Vulcans much prefered to eat using cutlery, Jim figured that this was part of the traditions involved, though he honestly could not find the energy to figure out why.<br><br>\nEven as he was chewing on a fibrous sort of Vulcan berry, his thoughts were with what had just occurred. Had he really agreed to become a Vulcan citizen? What would that even involve? Would he be expected to reside on Vulcan, get a house here?<br><br>\nOverwhelmed, Jim kept his eyes down as he ate, hoping fiercely that everything would work out fine</p>\n<p></p>\n<p></p>\n<p>__ __ __</p>\n<p><br>\nThe ceremony itself had been short and to the point, though a Vulcan gong and ritual words had been involved. Undoubtedly, the Council had already asked somebody else to take care of the paperwork, as all that had been required of Jim in form of legal work had been one signature on a provided PADD.<br><br>\nHe had received an IDIC symbol, pinned to his formal robes, and a small data chip containing the entirety of Surak’s teaching in Federation Standard, now hanging off a simple thin chain around his neck.<br><br>\nHis head was still reeling with all that had happened as he bid every single Elder goodbye personally, lips wrapping around the Vulcan phrases without much conscious thought, nodding gratefully as they welcomed him to the Vulcan people. As nobody frowned at him again, he figured he hadn’t further embarrassed himself or offended anybody.<br><br>\nSelek was the last Elder to step up to him, but unlike the others, he had not come to say goodbye just yet.<br><br>\n“If you are amenable, I would like to guide you back to a suitable point of transportation,” he said, eyes twinkling in a way that made him look highly amused. Jim didn’t know whether to feel uncomfortable or calmed by the Vulcan’s unusual behavior.<br><br>\nThey made their way towards the tunnel Jim and Sunvar had entered through. Selek chose a slower pace as if this were a leisurely amble between old friends.<br><br>\n“<em>Osa-su</em>, was there … something you wanted to talk about?” Jim finally asked, unnerved by the silence.<br><br>\n“Indeed there was, Mr. Kirk,” the Elder replied and stopped close to the entrance. Jim could nearly feel the blistering heat that waited outside on his cooled skin.<br><br>\nAgain, Jim noted that Selek did not bother calling him the special honorific everyone seemed so fond of. It didn’t seem disrespectful, though. Rather, Selek seemed to aim to sound familiar.<br><br>\n“Have I done something?” Jim ventured when Selek did not explain himself.<br><br>\nSelek’s mouth twisted in a way that could nearly be called a smile. Jim stared at him.<br><br>\n“No, Mr. Kirk, you have done nothing, at least nothing to offend me, which I believe is what you were asking.” Selek’s eyes crinkled in a way that reminded Jim of a kindly grandfather before he turned more serious. “In fact, it is I who has done something of offense.”<br><br>\n“Oh?” Could Vulcans be anymore fucking cryptic?<br><br>\n“I believe you are not yet familiar with the full story behind your rescue and the rescue of Vulcan,” Selek continued. “The fault lies mainly with me.”<br><br>\n“With you?”<br><br>\n“Indeed,” Selek said. He inclined his head and the friendly twinkle in his eyes had died. “I must admit that my own actions lead to the near destruction of my home planet.”<br><br>\n“Your actions?” Jim repeated dumbly. “What do you mean? It was Nero who attacked Vulcan!”<br><br>\n“And it was I who provoked Nero into attacking the planet.” Selek’s voice sounded brittle during his admission and for the first time during their conversation, he averted his gaze to stare outside the tunnel into the red heat of Vulcan.<br><br>\n“But … how?” Jim asked, flabbergasted.<br><br>\nAs of now, he had not been sure about Nero’s exact motives to attack Vulcan. During torture, he had mentioned revenge several times, but nothing specific. As the Romulan had acted crazy in the past, Jim had simply assumed that time travelling did things to people. After all, Nero had had no reason to attack the <em>Kelvin</em> over two decades ago either.<br><br>\n“To understand that, I will first have to make you understand that I am not who the Council makes me appear to be to the public. I am not merely another Elder.”<br><br>\n“Okay. And who are you then?” Jim asked carefully.<br><br>\n“Like Nero, I am not from this timeline. In fact, I am from the very timeline from which Nero stems. We both fell through the same black hole and into this universe, though I arrived much later than him.”<br><br>\nJim swallowed nervously. “I don’t know what you’re trying to say,” he admitted helplessly.<br><br>\nSelek’s eyes were sad when they locked with Jim’s once more.<br><br>\n“I am Spock.”<br><br>\n“Bullshit.”<br><br>\nIf he weren’t so busy feeling ridiculed, Jim might be bothered by the fact that he had just cussed at a respected Vulcan Elder.<br><br>\n“I understand it is not easy to believe--”<br><br>\n\u2028“Not easy to believe?” Jim interrupted. He wasn't sure whether to feel annoyed or merely confused. Surely, the actual Spock would have told him about this. “Look, I don’t know what kind of game you’re playing, or what agenda you’re trying to push, but--”<br><br>\n“Please,” Selek interrupted, and it was only the raw, un-Vulcan desperation in his voice that made Jim halt in his speech. “Please let me explain. I am not trying to trick you, Jim.”<br><br>\nAnd now he was calling him <em>Jim.</em> He was suddenly reminded of the similarities he had thought he'd seen during the ceremony earlier, the way Selek had talked and held himself, things that had indeed reminded him of Spock. If this was really true -- well. Jim didn't really know what to think.<br><br>\n\"Explain yourself then,\" he said.<br><br>\n“It is … hard to explain in words,” Selek replied. \"I would rather show you.\"<br><br>\n“Show me?” Jim repeated. \"Show me how?\"<br><br>\nSelek raised a hand and, before Jim could do anything about it, placed it on Jim’s face. “My mind to your mind, old friend,” he said, and the next thing Jim knew he was falling, falling, falling and he was<br><br>\nseeing Spock, a different version than the one he knew, this one edgier, his face thinner, but nonetheless Spock, who was looking at himself in a mirror as he smoothed out the last wrinkles in his blue science uniform, meaning that he was seeing this through Spock’s eyes, wasn’t he, and then he was<br><br>\nstanding on the bridge of what was obviously the <em>Enterprise</em> and in the chair, it was Jim, unmistakably Jim, hazel eyes or no, and Spock was saying “Captain” in a way that conveyed much more than professional respect because there was warmth, affection even, and then he was<br><br>\nolder, feeling much older, and there was a sadness lodged in his chest he could not feel ashamed about, no matter how Vulcan he was, and he was working in a lab, ignoring his pain, his loss as he looked through thick glass at a red, pulsing mass, and then he was<br><br>\nbeing swamped by one memory after another, one layer of thought after another until he understood what had happened, the failure that was rescuing Romulus, being stranded on Delta Vega, seeking out this universe’s version of Montgomery Scott as quickly as possible to prevent the worst<br><br>\nand when he finally emerged, Jim’s head was reeling and he was stumbling backwards until his back met the wall and his head hit the stone wall of the tunnel with a thump. Breathing heavily, Jim sank to the floor, one hand curling uselessly against the wall as he kneeled on the floor, trying his hardest not to throw up as he pressed his free palm against his forehead.<br><br>\n“Forgive me, Jim,” Selek -- no, <em>Spock</em> said breathlessly. \"My emotions -- I fear they have affected the meld.\" He settled a wrinkled hand on Jim’s shoulder.<br><br>\nBut Jim didn’t want him anywhere near him, because he was hurting and his head was filled with pictures that didn’t belong there, an explanation who Nero was and why he had done what he had done mingled with a hundred scenes of a life he had never lived among people he hardly knew, but apparently considered family in another timeline, a timeline where he and Spock were apparently as close as Jim and Bones.<br><br>\n“Don’t touch me,” he gasped, and Spock immediately complied, stepping back to give Jim some space.<br><br>\nIt took him several minutes to calm down. When he no longer felt like the world had been shaken by an earthquake, Jim carefully got up, his shiny robes hanging dirty and wrinkled around his trembling legs.<br><br>\n“You … you were the one who abducted the ship?” Jim gasped, running a shaky hand over his face. “You made sure the red matter was out of Nero’s grasp?”<br><br>\nGravely, Spock nodded. And God, this was Spock, an old version of Spock, a Spock who had served as his First Officer for years and had, apparently, lead the crazy Romulan Nero to this universe and thus nearly triggered Vulcan’s destruction.<br><br>\nThis was … too much to take. Way too much to take.<br><br>\n“I understand if you are angry with me,” the old Spock said quietly.<br><br>\nAngry? Jim wasn’t feeling angry. Hell, he didn’t know what he was feeling but confusion and disorientation.<br><br>\n“I want to go back,” he managed. “To Spock’s-- I mean, the other Spock’s home.”<br><br>\n“I do not think that wise. I have not sufficiently explained--”<br><br>\n“I don’t care,” Jim snapped and, okay, maybe he was angry after all. With the way his head felt right now, he definitely had a right to be. The thing, the meld -- it had felt invasive. Personal. Painful. “I can't talk to you right now, okay? I just-- I need time. Please.”<br><br>\nSpock nodded again. His face seemed even more lined and wrinkled than before. Jim was too agitated to give it more than a fleeting thought. With a last sad look for Jim, Spock turned to leave the tunnel.<br><br>\nJim stumbled after the old Vulcan, head still reeling. A sharp headache akin to the one he had felt after waking up in the hospital was pulsing in his temples, making him feel sick and unbalanced.<br><br>\n“The transporter signal will be able to reach you here,” old Spock said as they had brought some distance between themselves and the mountain. “However, I really must ask you to reconsider and--”<br><br>\n“No,” Jim snapped, swaying a bit as he reached for the small communication device in his pocket. Pushing the right button, he spoke harshly into it. “Anyone there?”<br><br><em>Spock speaking.</em><br><br>\nThrowing a glare at the old Spock for no real reason, Jim managed a “Can you beam me back?” before he had to take a deep breath and close his eyes. The sudden return of the heat combined with the repercussions of the mind meld were playing havoc with his body.<br><br><em>Of course. Please move as little as possible as I lock onto your position.</em><br><br>\nJim swallowed. “Thanks.”<br><br>\nThe last thing Jim saw before he dissolved was old Spock’s worried face, shoulders slumped as he watched Jim vanish.</p>\n<p>The first thing Spock noticed as Kirk contacted him through the communication device was how upset he sounded. His voice was shaky in a way that reminded Spock of Kirk’s post-nightmare state of mind.<br><br>\nDeducing logically that the meeting with the Elders was most likely the cause of this, Spock focused on transporting Kirk back as quickly as possible, not wanting to extend his stay with the Council any longer than strictly necessary. He knew from his own experience how upsetting Vulcan Elders could be, no matter how hard it was to admit to such emotions.<br><br>\nIt took him a few seconds to make sure he had locked onto Kirk properly, then started the transportation process. Looking at the pad, Spock observed as Kirk slowly materialized on the transporter platform. And promptly collapsed as soon as the sparkling lights vanished.<br><br>\n“Jim!” Spock called out illogically before catching himself and approaching the platform.<br><br>\nKirk was on his knees, breathing heavily and clutching his head. As he came closer, Spock could hear that the man was letting out small, pained keening noises. Kneeling down next to him, Spock placed a careful hand on Kirk’s shoulder.<br><br>\n“What happened? Do you require medical assistance?”<br><br>\nBut Kirk did not respond, only shook his head as he took short, staggered breaths.<br><br>\nSensing that he was not equipped to deal with this alone, Spock called out loudly for his father, who he knew to be in his nearby office. Sarek appeared quickly, taking in the scene with one observing look before approaching Spock and Kirk.<br><br>\n“What happened?” he echoed Spock’s earlier words, refraining from touching Kirk as Spock had done, but kneeling down next to him as well.<br><br>\n“Jim asked to be beamed back, sounding emotionally strained. When he arrived, he simply collapsed. He appears to be in pain but remains as of yet unable to voice the reason behind it or explain what exactly occurred.”<br><br>\nSarek gave a serious nod.<br><br>\n“<em>Oveh</em>,” he said, making his own attempt to reach Kirk. “<em>Oveh</em>, can you explain what happened? Are you injured?”<br><br>\n“Hurts,” was all Kirk managed between his harsh breathing.<br><br>\nComing to a decision, Spock used his free arm to manoeuvre Kirk’s trembling frame until he could reach under his knees and back, lifting him with little effort.<br><br>\n“I will bring him to his room and try to calm him. Please, <em>osa-mekh</em>, call for Healer T’Lkai at Shi’Khar hospital. Have her beam here as quickly as possible. As her primary physician on Vulcan, she knows Jim’s medical history and will be most likely to know of a solution. In his current condition, I deem it unwise to expose him just yet to another transporter beam to send him to the hospital.”<br><br>\nSarek conceded his logic with one nod and stepped up to the transportation panel, undoubtedly to place the requested call.<br><br>\nConfident that his father would deal with this situation in an appropriate fashion, Spock hurried to carry Kirk to his room. Of course, it was inevitable that Spock’s mother had picked up on the commotion and she met him in the hallway.<br><br>\n“What’s going on?” she asked immediately as she saw Kirk trembling and whimpering in Spock’s arms, face hidden behind his own hands.<br><br>\n“We do not yet know,” Spock said tightly as he brushed past Amanda, confident she would fall into step beside him. “Jim arrived in this state as he returned from the meeting with the Council. Father is calling for a healer to determine how and where he was injured.”<br><br>\nSpock hurried the remaining meters to Kirk’s room, entering and approaching the bed where he carefully placed the Human on top of the mattress.<br><br>\n“We should get him out of those robes,” Amanda suggested, having followed Spock into the room.<br><br>\nTaking in the soiled and crumpled state of the garment, Spock agreed. He hardly wasted time to contemplate the significance of either the shiny IDIC symbol pinned to Kirk’s robes or the data chip hanging off the thin chain around his neck. Together with his mother, Spock guided Kirk’s trembling limbs until they had extracted him from the stifling garment, leaving him in his thin underwear.<br><br>\nAll the while Kirk whimpered, eyes unfocused as he repeatedly tried to free his hands to press them against this head. The few times Spock’s bare skin brushed against Kirk’s during the undressing process, he could pick up on genuine distress and pain.<br><br>\n“Do you think it might be a mental problem?” Amanda said quietly as they could do nothing further but cover Kirk with the blanket, stand by the bed and wait for the healer. “This looks like the sort of fit I had when your father and I had yet to find a balance with our mental bond.”<br><br>\n“I am unsure, mother,“ Spock admitted. “Surely, the Elders had no reason to connect with his mind. And certainly, they would not allow him to return if they had done so and caused this state.”<br><br>\nHis mother nodded thoughtfully, brow furrowed in clear worry and she sank down on the edge of the bed, placing a hand on Kirk’s arm like she had often done when Spock was sick as a child. He swallowed at the sight and looked away, stepping towards the slide door to observe the hallway and look out for the healer.<br><br>\nT’Lkai and Sarek strode towards Kirk’s room 4.2 minutes later, another healer Spock did not recognize with them. Both T’Lkai and the unfamiliar healer were carrying medical cases.<br><br>\nSkipping the formal greeting, T’Lkai and the other healer simply nodded at Spock before passing him to enter the room and approach Kirk.<br><br>\nAmanda immediately got up and stepped aside, her hand falling off Kirk’s arm as she made space for the healers.<br><br>\n“Healer T’Lkai brought the honorable T’Lona, an experienced mindhealer,” Sarek explained quietly. “After describing Mr. Kirk’s symptoms to her, T’Lkai thought it likely that this was a mental affliction.”<br><br>\nSpock nodded. He watched as the two healers observed Kirk whimpering and trembling on the bed before launching into quiet conversation. T’Lkai traced Kirk’s form with a tricorder from her medical case. Feeling responsible as Kirk’s official caretaker, Spock stepped away from his father and approached them.<br><br>\n“What is your diagnosis?” he asked the healers when T’Lkai put away the scanner.<br><br>\n“We are uncertain as of yet, only that it is clearly a problem of the mind,” T’Lona explained calmly. “I will attempt a shallow mind meld to assess the situation and go deeper once I have ascertained the cause of his symptoms.”<br><br>\nBefore Spock could voice any objections or further questions, T’Lona had bowed over Kirk’s form and placed her hand in the familiar pattern, her dark-brown hand in stark contrast to Kirk’s pale and sickly face. Kirk immediately ceased any noise or movement as their minds connected.<br><br>\nFor a few minutes, the room was silent as T’Lona probed Kirk’s mind.<br><br>\nWhen she emerged, she appeared visibly less calm than before, slightly shaking her head as if it would help her clear her mind of what she had just encountered in Kirk’s.<br><br>\nKirk himself stayed calm where he lay on the bed, breath evening out as he slipped into what appeared to be a deep slumber.<br><br>\n“What have you found?” T’Lkai asked her colleague when T’Lona had regained control and smoothed her face.<br><br>\n“He was suffering from the aftereffects of a deep and rather uncontrolled mind meld,” T’Lona told them, a trace of surprise coloring her voice. “Whoever connected to him was severely emotionally compromised and caused the honorable Mr. Kirk’s mind to be overwhelmed. I have now calmed his mind and brought superficial order into the chaos. I believe the original meld served to transfer a significant amount of memories in a very quick and rapid way. Even for a more disciplined mind, it would have been a considerable amount of information to process.”<br><br>\n“You said he was with the Council before he returned, <em>kevet-dutar</em>?” T’Lkai looked past Spock and towards the door, where Sarek stood next to his wife.<br><br>\nSpock’s mother must have walked over to him while the healers had been busy assessing Kirk’s state of health. Spock had not even noticed, so focused had he been on Kirk and T’Lona. It was unlike him to lose track of his surroundings like this.<br><br>\n“Indeed,” Sarek replied, voice tense. “I shall contact them and ask them how Mr. Kirk came to be in this state. I am sure there must be a logical explanation for this.”<br><br>\nHe nodded at the healers, his fingers brushing past Amanda’s for the briefest of seconds before he left the room. Spock quickly returned his eyes to the healers.<br><br>\n“When will he wake up?”<br><br>\n“He was physically exhausted as well,” T’Lkai said. “It is clear the heat of Vulcan is not ideal for his Human physiology, especially in his still weakened state. My estimate is at least four hours, possibly more. It would be unwise to attempt to rouse him from a slumber this deep. His body is obviously in need of further rest.”<br><br>\n“Mr. Kirk should be calm and lucid upon wakening,” T’Lona added. “I recommend helping him discipline his mind to deal with the additional disarray. You may ask for my assistance if you find yourself having difficulties. My colleague Stalat has, I believe, informed you of the already existing mental trauma Mr. Kirk has suffered before his hospitalization.”<br><br>\nSpock nodded, his thoughts on the implications of the healers’ assessment. Kirk was suffering from an ill-performed mind meld. Spock could not think who on Vulcan would risk the man’s health with such a careless action, especially amongst the Elders.<br><br>\nAs there was nothing they could do for now, the healers left for the hospital. Spock and his mother remained standing by Kirk’s side with orders to contact either healer should Kirk not wake within the next twelve hours or show the same symptoms as before.<br><br>\n“Surely, the Elders didn’t attempt a mind meld,” Amanda said after both T’Lkai and T’Lona had left.<br><br>\n“I can think of no logical reason,” Spock agreed, staring down at Kirk, now covered with his blanket. Apart from the ever-present film of sweat, he looked calm and peaceful as he slept. He was no longer as sickly pale as before and the trembling had ceased completely but for the occasional flutter of his eyelids.<br><br>\nIt was in this moment that Sarek returned to the room, his face serious. Amanda threw him a worried look before ushering all of them out of Kirk’s room, reminding them that he needed to rest and was not to be woken.<br><br>\nShe used the sensor to slide the door half-shut before turning towards her husband, who had clearly returned with an explanation.<br><br>\n“It appears one of the Elders has indeed performed a mind meld on Mr. Kirk,” Sarek said at once.<br><br>\nSpock stiffened, disbelief clouding his mind. “Impossible.”<br><br>\nSarek threw him a disapproving glance before continuing. “It was Selek.”<br><br>\nFor a moment, Spock could not breathe, let alone reply.<br><br>\nHis mother had no such problems, apparently. “You mean, the other Spock? He did this?”<br><br>\nSarek inclined his head, mouth tight. “It appears he was convinced that a mind meld would be the most practical way to explain the circumstances of his arrival in our timeline and the cause of Nero’s madness. He had, however, not realized how compromised he still was from what has occurred.”<br><br>\n“Why did he let Jim leave in a state like this?” Spock demanded, feeling a nearly uncontrollable rush of anger at his older counterpart.<br><br>\n“He said Mr. Kirk refused any help as well as his advice to delay departure.” The icy tone of voice his father had adapted clearly spoke of his own anger. Spock could not shake off the thought that Sarek blamed him for the actions of his counterpart, although they were not the same person.<br><br>\nIt took all of Spock’s self-control not to curl his fingers into fists of anger or grab his father by the robes and shake him. His anger at the other Spock mingled with the ever-festering resentment he had felt towards Sarek ever since their fallout over Spock’s rejection of his place at the Vulcan Science Academy.<br><br>\n“At least we know what happened now,” Amanda interjected, probably sensing another argument coming and trying to prevent it. “If Healer T’Lona is correct, Jim will be just fine, so it’s--”<br><br>\n“And if he is not?” Spock interrupted her, his voice harsher than strictly appropriate. He promptly received another icy look from his father.<br><br>\n“Do not speak to your mother in this fashion,” Sarek said at once. “She does not deserve this kind of treatment simply because you cannot control your emotions.”<br><br>\n“I did not--”<br><br>\n“Will you two stop it?” Amanda looked upset in a way Spock had not seen often. “This is not about your childish feud, but about Jim.” She took a deep breath, pressing two fingers to the bridge of her nose before continuing in a calmer voice: “Spock, why don’t you sit with Jim in case he wakes up and needs something?”<br><br>\nNot wanting to upset his mother further, Spock inclined his head stiffly before turning back towards Kirk’s room.<br><br>\n“And you,” Amanda continued, now clearly addressing Sarek. “Spock’s worried, not purposely disrespectful, so--”<br><br>\nSpock hurried to enter Kirk’s room and let the door slide shut completely this time. It would not do to anger his father further by listening in on what would clearly be one of his mother’s emotional speeches. Nonetheless, he could not help but feel a sense of satisfaction at his mother’s defense of him.<br><br>\nNot having brought a chair, Spock simply stood by Kirk’s bed. He laced his fingers together behind his back and settled in for a quiet wait, aiming to calm and order his mind as he watched Kirk breathe</p>\n<p></p>\n<p>__ __ __</p>\n<p><br>\nKirk awoke 5.3 Standard hours later with nothing but a light headache and another unnecessary apology on his lips. Spock assured him that the latter was not required and informed him that the former would probably resolve itself, as it was a symptom of the mind meld, not a physical ailment.<br><br>\n“So, I’ve met the other you,” Kirk said unnecessarily once he had taken a shower and dressed.<br><br>\nThey had settled in the parlour with Spock’s Tri-D Chess set. Amanda had provided them with cool water and a snack after spending an unsettling amount of time touching and talking to Kirk. Spock knew it was the Human way to reassure and comfort each other after what had happened, but could not watch for long. Even after spending ample time among Humans, these sort of open emotional displays still seemed too intimate to him, especially when they involved his mother.<br><br>\n“For the sake of avoiding confusion and keeping his true identity secret from the general public, he now goes by the pseudonym of Selek,” Spock said stiffly, not wanting Kirk to make the same mistake as his father and see them as one and the same.<br><br>\n“Fine,” Kirk acknowledged, moving a pawn before looking at Spock. “To be honest, I’d rather you told me when I asked you what happened to the red matter. Meeting him like this was … well. Not ideal, I think.”<br><br>\nSpock felt his shoulder tense in spite of himself. He would have to meditate at length tonight. Clearly, today’s events had unsettled him to a point where his control was slipping.<br><br>\n“I apologize. It was Selek’s expressive wish to inform you himself. At the time, it seemed only logical to comply, as you were in no state to deal with such delicate information. Had I known what consequences would come from the delay, however, I would have risked explaining it myself.”<br><br>\n“It’s not your fault,” Kirk said immediately, making a point of catching Spock’s eyes and holding them. His face was honest, open in a way Humans tended to be much too often. In this instance, the physical confirmation of Kirk’s statement was reassuring.<br><br>\n“I am gratified you have come to this conclusion.” Spock caught Kirk’s bishop after checking the board for a possible trap. From the way Kirk cursed under his breath, it had been mere inattentiveness on his part. “If you do not feel up to this match, we can play another time.”<br><br>\nKirk shook his head. “Nah, I’ll pay more attention now.”<br><br>\nThey played quietly for a while before Kirk spoke up again, clearly trying for a casual tone. “So, what do you know about other Spock’s-- I mean, about Selek’s timeline? Did you guys talk a lot or something?”<br><br>\n“We deemed it wise not to converse too much,” Spock explained. “However, I do know that in his universe, both your and my life were different.”<br><br>\n“So you know about the <em>Enterprise</em>?”<br><br>\n“I know that I served as your First Officer on Selek’s version of the <em>Enterprise</em>, yes.”<br><br>\nKirk hesitated before saying: “Weird, huh?”<br><br>\nSpock ceased his observations of the board in favor of looking at Kirk. “What, exactly, do you find ‘weird’?”<br><br>\n“Well, we also ended up on the <em>Enterprise</em>. And from what I gathered from other Spock’s -- crap, I’m sorry, really, I mean, from Selek’s memories -- it was the same people on his ship. Bones, Sulu, Uhura, that kid Chekov. And it was them who helped rescue me, too, right? The ones who went out with you to get me back?”<br><br>\n“Yes. Along with Montgomery Scott, as we required his knowledge about transwarp beaming to successfully infiltrate the <em>Narada</em>.”<br><br>\n“And he just went along with it, right?”<br><br>\nSpock inclined his head. “He was surprisingly amenable to the prospect of going on a rescue mission for a man he did not know personally. His reason, I believe, was that it ‘sounded like fun’.”<br><br>\n“Yeah, and that’s what I find weird. The same people, coming together and all.”<br><br>\nSpock observed Kirk’s face very carefully, noting the way he bit his lip in what he knew to be a Human sign of both contemplation and worry. “Are you proposing a theory of predetermined events and principles constant among all existing timelines and universes?”<br><br>\n“The word you’re looking for is fate, but yeah, basically.”<br><br>\nSpock shook his head. “I cannot agree.”<br><br>\n“Why not?”<br><br>\n“There is no scientific proof to back your claim.”<br><br>\n“That’s just because we know next to nothing about the multiverse. You’ve got to admit, though, the one example we’ve experienced ourselves is in favor of my theory.”<br><br>\n“One positive example does not make a proven and scientifically sound theory,” Spock chastised him.<br><br>\n“Fine,” Kirk replied, then added, “Check.”<br><br>\nSpock threw a furtive glance at the board before gracefully saving the situation by moving his rook. From Kirk’s reaction, it was obvious he had known it to be a weak move at best. He usually played much better than this.<br><br>\n“Besides,” Kirk continued. “I’m obviously not going to be captain of the <em>Enterprise</em> anytime soon in this universe.”<br><br>\n“What makes you so certain of that?” Spock replied. “Starfleet has lost many experienced officers and you have proven yourself worthy of a command position through your actions during the fight with Nero. I have it on good authority that your field promotion to Commander will hold in honor of your services to Vulcan and the Federation as a whole. Once you return to active duty, it is not unlikely they might also provide you with Captain Pike’s legacy. The <em>Enterprise</em> is still undergoing repairs and a definitive crew has not yet been chosen for its mission.”<br><br>\n“As the former first officer and its temporary captain, wouldn’t it make more sense to promote you to captain of the <em>Enterprise</em>?” Kirk asked, clearly having lost all focus for their game at this turn of their conversation. He was staring at Spock with wide eyes, betraying his bewilderment.<br><br>\n“I do not desire a captaincy,” Spock informed him seriously. “Starfleet is well aware my interests lie mainly in the sciences, interests I would not be able to pursue were I given the vast responsibilities of a captaincy. Additionally, Captain Pike has always spoken very highly of you. I believe he would have approved, should the Admiralty consider you the right candidate for the position.”<br><br>\n“You talked to Pike about me?” Kirk seemed surprised by this. Spock did not miss the way Kirk’s fingers curled around the edge of the table, but was unsure how to interpret this.<br><br>\n“Indeed. He asked to see me after I had filed the complaint about the <em>Kobayashi Maru</em>. He tried to convince me of the true motivation behind your actions and the general decency of your character. I must admit, I did not believe him at the time and thought his conclusions about your person to be rooted in irrational sentimentality. He was quite convinced of your formidable qualities.”<br><br>\n“He said that about me?” Kirk asked, sounding breathless. This time, Spock recognized the sadness and disbelief in Kirk’s features.<br><br>\nSpock reminded himself that Pike and Kirk had been rather close. The captain had mentioned Kirk in conversation even before the <em>Kobayashi Maru</em> incident, speaking of him with fondness and a hint of pride. Undoubtedly, Kirk was still suffering from his loss in addition to his own trauma. Hearing about Pike’s high opinion of him would undoubtedly be something Kirk could benefit from emotionally.<br><br>\nSpock had thought about and taken care of Kirk for a considerate amount of time now. He was able to admit to himself that Kirk’s well-being was important to his own peace of mind, at least currently.<br><br>\n“He did,” Spock confirmed. “He thought very highly of you and praised your abilities and character whenever he found it appropriate. I believe he was very fond of you, Jim.”<br><br>\nKirk swallowed at this, averting his gaze. Spock watched him raise his hand to rub over his eyes. When he looked up again, they were rather shinier than before.<br><br>\n“I missed his funeral.” His voice was rough as he stated this fact.<br><br>\nSuddenly faced with the task of handling Kirk’s delicate emotional state, Spock thought of which treatment his mother preferred in situations of emotional upheaval and knew it was a comforting touch.<br><br>\nComing to a quick decision, Spock leaned over the chessboard to clasp Kirk’s left wrist and squeezed it briefly. It was an intimate gesture which offered him a glimpse of Kirk’s genuine grief. But after shaking the man from a nightmare and repeatedly soothing his fears in the hospital, it did not seem inappropriate to take part in his emotions like this.<br><br>\n“I grieve with thee,” Spock said quietly before he let go, losing the connection.<br><br>\nWhen Kirk gave him a small smile and a grateful nod, Spock knew it had been the right thing to do, no matter his own discomfort.<br><br>\nThey resumed their game, speaking no further. Spock won much too easily.<br></p>\n<p></p>\n<p></p>\n<p>__ __ __</p>\n<p><br>\nIt only occurred to Spock the next morning that he had never asked Kirk about the purpose of the Council meeting. As it turned out, reading over the latest announcements of the Vulcan Information Distributing Agency on his PADD was a similarly effective method.<br><br>\nIt took Spock the impossible amount of 6.4 seconds to make sense of the sober headline: <tt>The Honorable James Tiberius Kirk receives Vulcan citizenship status</tt>.<br><br>\nWhen he caught himself, Spock went over the clues in his head and nodded to himself. The conclusion was logical, as was the decision of the Council. As Vulcan would no longer exist had it not been for Jim Kirk’s actions, it was only proper to make him part of the Vulcan people and thus promise protection and support in return.<br><br>\nStill, Spock could not help but be unsettled by this revelation. Vulcans were not known for welcoming outworlders with open arms. Spock’s own mother had needed years of assimilation until she had felt reasonably accepted. He himself had been alienated due to his mixed heritage for most of his life. Now, the Council openly proclaimed that a Human was part of their people.<br><br>\nSpock could not account for the bitter taste on the back of his tongue.<br><br>\nBreakfast commenced with both Sarek and Amanda offering their congratulations to Jim, who nodded and responded with a small smile before taking an inadvisably large swallow of his tea and promptly letting out a wet cough.<br><br>\n“I, too, welcome you to our people,” Spock said formally. It was clear Jim avoided his gaze as he quietly expressed his gratitude.<br><br>\n“Am I correct in assuming that the Council provided you with the teachings of Surak, <em>oveh</em>?” Sarek inquired.<br><br>\n“Yes, <em>kevet-dutar</em>, they have. I’ll make sure to read them carefully.”<br><br>\n“You are, of course, not expected to follow the teachings,” Spock pointed out. “In fact, there have always been certain groups of Vulcans that do not follow Surak and his pursuit of logic.”<br><br>\n“There have?” Kirk sounded honestly interested.<br><br>\n“They are few, and of no consequence,” Sarek interfered, throwing Spock a significant look. Spock wondered if it was illogical to assume that there was nothing he could say or do that would not result in his father’s open disapproval.<br><br>\n“I’d still like to know more,” Kirk said carefully. “It’s not often you hear about Vulcans who reject Surak’s teachings.”<br><br>\n“And does Jim not, now that he is part of the Vulcan people himself, have the right to know all about our society?”<br><br>\n“Spock’s logic seems sound to me.” It was obvious Amanda was hiding a smile behind her cup of tea as she addressed her husband. “It’s reasonable to assume that Jim would like to know as much as possible about his newly acquired home.”<br><br>\nSpock quelled a childish urge to touch his mother’s hand and convey his high esteem for her through their familial bond.<br><br>\n“Indeed.” His father’s voice sounded off in a way that even Kirk seemed to notice, if his raised eyebrows and strange look were any indication.<br><br>\n“If you would like, I can provide you with access to our historical databases,” Spock continued. “This way, you can trace the spread of Surak’s teachings on logic from its very beginning.”<br><br>\n“I’d love to.”<br><br>\nAfter breakfast, Spock led Jim to the family computer panel where he had previously conversed with friends on Earth. Bringing a second chair, Spock sat and showed Kirk how to access the databanks and switch them to Federation Standard for his convenience.<br><br>\nHe was just about to excuse himself and leave Kirk to his studies when an incoming communication interrupted them. Spock did not recognize the ID except that the caller currently resided on Earth, but Kirk clearly was better informed.<br><br>\n“It’s Bones!” Kirk sounded genuinely happy as he gently pushed Spock aside to accept the call with a few touches to the panel.<br><br>\nThe doctor appeared on the screen, looking as disgruntled as Spock had got to know him during their rescue mission. “Hey, Jim,” he said with the smallest of smiles, then nodded towards Spock. “Hello, Commander.”<br><br>\n“Doctor,” Spock returned the greeting before getting up.<br><br>\n“You don’t have to leave,” Jim told him, bright smile still in place. Carefully, Spock sat back down.<br><br>\n“This won’t take long anyway,” Dr. McCoy continued. “I actually expected to just leave a message and have Jim call me back, but I guess I have good timing.”<br><br>\nJim was back to looking up at the screen. “How are you?”<br><br>\n“Fine, kid. What is this I hear about you and Vulcan citizenship?”<br><br>\n“Yeah.” It sounded like a sigh to Spock’s ears. Kirk’s smile turned significantly less bright as he said it. “It’s true.”<br><br>\n“First the ear, now this. When are you gonna go all logical on me and bleed green?”<br><br>\nKirk’s grin returned and he actually laughed out loud. “I don’t think that’s going to happen, Bones.” He threw Spock a glance, blue eyes shining brightly with amusement. “Sorry, Spock.”<br><br>\n“I doubt the latter is medically possible,” he replied carefully, unsure why Kirk was apologizing. Kirk only laughed again before turning his smile back on Dr. McCoy.<br><br>\n“What is it, Bones?”<br><br>\n“Well, I’m actually in between shifts, so I’m going to keep this brief,” Dr. McCoy said. “I talked to the brass and they strongly advise you to stay put for a little longer.”<br><br>\n“Oh.” Kirk sat up very straight, throwing Spock a quick look, which Spock could not quite interpret but seemed distinctly uncomfortable. “About that--”<br><br>\n“There is a ship coming by pretty soon, though, in case you’re going to disregard the advice of your betters, as usual,” Dr. McCoy continued without a pause, clearly not aware of his friend’s discomfort.<br><br>\nSpock noted the signs of fatigue around his eyes. It was clear the doctor was not getting enough rest at night. It was likely he was still picking up shifts for the doctors that had died in battle. Otherwise, the doctor certainly would have noticed the small shake of Kirk’s head as he continued talking.<br><br>\n“It’s the <em>Pegasus</em> and they’re actually going into orbit around Vulcan fairly soon to return Vulcan diplomatic staff to the planet. It all depends on when their mission wraps up. Either way, if you wanna leave early, contact Captain Liáng. She’s been informed you might want to hop on.”<br><br>\nSpock suppressed the urge to ask Kirk the meaning of this. It was clear he was unhappy that Spock had been present for this conversation after all.<br><br>\n“And now, I’m going to go back to the hospital. If you need anything else, please call me-- oh, about never, because that is actually when I’ll have my next day off from what I’ve been given to understand.”<br><br>\n“Thanks for your help. Bye, Bones,” Kirk said tightly as Dr. McCoy gave a little wave.<br><br>\n“Keep your chin up, kid.”<br><br>\nAs the call disconnected, Kirk let out a deep sigh before looking Spock right in the face.<br><br>\n“You have made arrangements to leave Vulcan,” Spock said when Kirk offered no explanation of his own.<br><br>\n“I did kind of tell you,” Kirk replied, but did not sound confident.<br><br>\nSpock inclined his head. “It is of course your choice alone if you wish to leave Vulcan. You are not required to stay for any amount of time.”<br><br>\nKirk quirked his lips. “But?”<br><br>\n“But: As a citizen of Vulcan, you should now no longer be uncomfortable about receiving your care here. Additionally, it is likely the Elders would not see the logic behind your actions and take offense to your leaving this early with your recuperation process not yet finished. Just yesterday, you suffered a great setback due to Selek’s actions. Like the admiralty, I can only advise you not to leave unless your state of health has improved and travelling will no longer be a hardship for you.”<br><br>\nKirk let out a very long sigh, rubbing a hand over his face for 10.8 seconds before letting his shoulders sag.<br><br>\n“I guess I’ll have to stay then.”<br><br>\n“I wish to make it clear once more that it is no inconvenience to my family to house you. Quite on the contrary, it is seen as a great honor to our clan to provide you with board and lodging.”<br><br>\n“Thanks, Spock. I didn’t want to imply that I was unhappy with my stay here. I only … well …”<br><br>\nSpock nodded in understanding. “You are not entirely comfortable. It is understandable, as there are no family ties binding you to my clan. We will aspire not to make you feel like a stranger in our house.”<br><br>\nKirk raised his eyebrows. “You mean, I should feel like part of the family?”<br><br>\nThat was-- not what Spock had had in mind, exactly. But now that Kirk had voiced the thought, Spock could not reject the statement without giving offense. Additionally, it was clear Spock’s mother had already developed a deep fondness for Kirk. Where she was concerned, Kirk’s statement certainly applied.<br><br>\n“Yes,” Spock replied and Kirk smiled, eyes crinkling with fondness. Spock wished he did not have to admit to himself that it affected him, but as he had previously accepted, it was clear that he cared about Kirk’s well-being and wanted to see him content.<br><br>\n“If that is all, I will leave you to your studies.\"</p>\n<p></p>\n<p></p>\n<p>__ __ __</p>\n<p><br>\n“I was thinking,” Spock’s mother said as she tended to one of her more delicate cacti in her garden. “It’s been a week and Jim has still not been going out due to the heat, so why don’t you show him some things that don’t require him to be outside for too long?”<br><br>\n“What places of interest did you have in mind?” He offered her an arm as she got up from her knees. Instead of taking hold of his sleeved forearm, she took his bare hand with a smile. Spock could feel her affection through their touch and allowed himself to prolong the connection for a few moments longer before letting go.<br><br>\n“Your former school in Shi’Khar, for instance. I doubt he’s seen anything like it before, and it’s reasonably cool down where the learning pods are.”<br><br>\n“It is an idea with some merit,” Spock conceded and Amanda brushed her hand over Spock’s once more, sending a wave of approval.<br><br>\nSpock had noticed that his mother had returned to behaving much more Human now that Kirk was living with them. She had never aspired to be like a Vulcan, but made an effort to accommodate her husband’s people. Now, she was back to wide smiles and showing her affection much more openly.<br><br>\n“Is he making much progress with meditation?” Amanda asked as they returned inside together.<br><br>\n“He has voiced frustration over his failure to master the breathing techniques for more than a few minutes.”<br><br>\n“They do require a great measure of patience. Maybe he’s just too preoccupied to find that place where he can stop thinking things over. He’s been through a lot.” The concern for Kirk was very evident in her voice.<br><br>\n“What do you suggest?” Spock asked her.<br><br>\n“Instead of a Human therapist?” she returned evenly. “Why don’t you guide him?”<br><br>\nSpock came to an abrupt halt. “Mother,” he said, more than surprised by her suggestion.<br><br>\n“What?”<br><br>\n“You speak of a very intimate procedure,” Spock told her. The mere thought of melding with Kirk and guiding his mind -- Spock sincerely hoped he was not displaying his embarrassment.<br><br>\n“You two are very close.” She was tilting her head to the side as she looked up at him. “Aren’t you?”<br><br>\nSpock blinked. “How have you come to that conclusion?”<br><br>\n“Beside the fact that it’s nearly impossible to talk to one of you without the other one nearby?”<br><br>\n“I am Mr. Kirk’s caretaker,” Spock replied, shifting where he stood and immediately regretting his action as it betrayed discomfort. “It is only logical to remain at his side and assure his well-being.”<br><br>\n“Logical. Mr. Kirk,” Amanda repeated, her face going soft in that way that filled Spock’s chest with warmth, in spite of his best efforts to remain unaffected. “You don’t have to put up fronts with me, Spock. It’s okay to say that you’re fond of him, you know?”<br><br>\n“Fond of--? Mother, please cease speaking in this manner at once.” Spock made a point of lacing his fingers behind his back, trying to regain some sort of control on the conversation. “It is not appropriate to speak this way.”<br><br>\n“Propriety? That is what you’re concerned with?” She shook her head, frowning up at him. “I know you and your father have a hard time acknowledging this, but you’re very much alike. Might I remind you that he went against the explicit wishes of T’Pau when he bonded with me? What you’re feeling for Jim--”<br><br>\n“I am not ‘feeling’ anything for Jim,” Spock returned harshly, cutting her off. “My high regard for him as a person is based on his honorable actions for our people. If you will not stop speaking in this irrational manner, I will have to end our conversation until you find reason again.”<br><br>\nAmanda narrowed her eyes at this. Spock had to fight an urge to swallow in the face of her sudden anger.<br><br>\n“I know you have chosen the Vulcan way, but even a Vulcan feels,” she said tightly. “If you’re uncomfortable admitting that you care for Jim, it’s one thing, but don’t pretend with me and tell me you do not have emotions. You’re not immune to feeling affection.”<br><br>\nSpock stared at her. “Affection?”<br><br>\n“Yes, affection. I have seen how you look at him during your chess games, I have seen your face when he was suffering from the meld.” She paused, stepping up to him. Her voice softened when she continued. “Spock, you’re my son. I know you and I know how deeply you feel. I realize you’ve come to think of your feelings as something shameful, something to be purged. I know you’ve got this desire to prove yourself more-than-Vulcan due to your mixed heritage, but you must not let this come between you and happiness.”<br><br>\nStruck absolutely speechless, Spock could not move as his mother stroked his cheek.<br><br>\n“Earth has been so good for your,” she continued. “You don’t know how happy it made me when you made friends. For a while, I was even sure you and that lovely girl Nyota would end up together, you know?”<br><br>\nSpock only stared at her, feeling her warm hand against his cheek, waves of affection and even a hint of sadness lapping at his mental shields.<br><br>\n“Please think this over,” she finally said, removing her hand. “I’d hate to see you unhappy.”<br><br>\nWith that, she turned and walked away, leaving Spock to stand in the hallway and grasp for a logical thought</p>\n<p></p>\n<p></p>\n<p>__ __ __</p>\n<p><br>\n“This is where you studied as a child?” Kirk sounded deeply impressed as they passed the learning pods, filled with hundreds of children processing information, taking tests or interrupting their learning process to talk to an instructor.<br><br>\n“Indeed.” Spock observed the room he had not entered for over a decade.<br><br>\nOne or two of the instructors nodded respectfully at them as they passed. Although Spock knew them, he was sure the gesture was aimed at Kirk, not himself. His teachers had never forgiven him for his violent outbursts as a child, that much he knew for certain.<br><br>\n“I can’t believe how much input you Vulcans can handle at once,” Kirk continued as he stopped by a pod, watching a young girl solve mathematical equations with her hands while reciting an ancient Vulcan poem.<br><br>\n“It is no hardship for most Vulcans, once the skill has been properly trained.”<br><br>\nSpock observed as the first pods went offline, the more advanced children having finished early. They did not leave for their mid-day meal, but gathered around one of the dark pods, clearly whispering among each other as they threw glances in their direction.<br><br>\n“Uh-oh,” Kirk said quietly as the children moved and approached them. “An ambush.”<br><br>\nBefore Spock could reply, six children of approximately eight years of age had surrounded Kirk and himself, raising their small hands in the <em>ta’al</em>.<br><br>\n“<em>Dif-tor heh smusma</em>,” they chorused dutifully.<br><br>\nSpock merely nodded at the children, being the older party, but Kirk leaned down, presenting the children with a short but bright smile before he returned the greeting more seriously.<br><br>\n“We are eager to meet you, <em>oveh</em>,” the girl in the very front spoke up. The intonation of her speech was not quite right, sounding much more Vulcan than Terran. “I am T’Karik and I have been chosen as speaker because I have the highest scores in Federation Standard.”<br><br>\n“A logical choice,” Kirk replied.<br><br>\nT’Karik and the others looked at each other, their pride evident in their eyes. Unlike grown Vulcans, these children could not fully control their emotions yet, although to a Human like Kirk they had to look quite serious nevertheless.<br><br>\nAt once, his mother’s words came to the front of Spock’s mind when he noticed Kirk’s easy charm as he talked to the children, answering questions about Earth and asking about their schooling in return. His eyes seemed to dance along as he outlined his explanations with his hands and the children were clearly intrigued by him and his manner of speaking.<br><br>\nOf course Kirk was very attractive for Human standards, and even a Vulcan could not deny the even proportions of his body and face, now slightly altered due to his remodelled left ear. Additionally, there was also something in the way he moved and held himself that was fascinating. His face was very expressive, even compared to other Terrans, offering bright smiles as openly as honest despair.<br><br>\nSpock shook his head ever so slightly. Surely, his mother must have been mistaken. Rationally approaching the question of Kirk’s attractiveness and actually seeing in him a potential mate were two quite separate things, were they not?<br><br>\nMore and more children gathered as their learning sessions ended. Soon, 37 children were blocking the main pathway towards the exit as they listened avidly to Kirk’s description of his own schooling in Iowa. While he did well when talking to Vulcan adults, he seemed to have a hard time reigning in his smiles with the children and his eyebrows rose and fell as he emphasised parts of his tales with broad gestures of his arms and hands. At one point, he let out a short but bellowing laugh that made some of the children whisper to each other as they watched him with wide, curious eyes.<br><br>\n“You are all late for your mid-day meal, <em>orensu</em>.”<br><br>\nSpock stiffened as he recognized the sharp voice. He turned to take in the form of S’lovan, one of Spock’s own former teachers. He had not changed but for strands of grey and white added to his dark hair and the stern wrinkles deepened around his eyes.<br><br>\n“It’s my fault, <em>osa-su</em>,” Kirk immediately replied as he straightened up. The smile on his face had ebbed away and he seemed to aim to position himself before the children as if to defend them.<br><br>\nS’lovan regarded Kirk silently for several seconds and for a moment, Spock was reminded of one of the many times when this very teacher had looked at him this way: <em>Pafam-t'san s'at.</em><em>You are a disgrace for the Vulcan race, Spock.</em><br><br>\nAfter precisely 12.8 seconds, S’lovan inclined his head. “<em>Oveh</em>. It is an honor you are visiting our school.” He looked past Kirk’s shoulder and at the children. “You have eighteen Standard minutes left to proceed and have your mid-day meal, <em>orensu</em>. No exceptions will be made for you. I expect you back precisely on time, as always.”<br><br>\n“<em>Ha, osavensu.</em>” A wave of swift <em>ta’al</em> for Kirk, and the children hurried away, talking to each other in low voices.<br><br>\n“I’m sorry for holding them up,” Kirk said to S’lovan.<br><br>\n“It is important for children to grow up in discipline and order, as it is vital for living with logic as Surak has taught us.” Spock did not miss the brief look S’lovan threw at him. “Nevertheless, I realize you aimed to provide them with useful information about your homeworld. The pursuit of knowledge and inspiring it in others is always to be commended.”<br><br>\n“They did seem to benefit from it,” Kirk replied. Spock knew him well enough to hear him struggle for an expression other than <em>enjoy</em> or <em>have fun</em>. “I take it they do not often have outworlders as instructors?”<br><br>\nS’lovan gave a stiff nod. “All instructors are indeed Vulcan, <em>oveh</em>. Foreign influence has proven to disrupt the learning process.”<br><br>\nThis time, S’lovan looked at Spock so openly that Kirk noticed it as well. His eyes narrowed.<br><br>\n“You have tried implementing instructors from other planets?”<br><br>\n“Not as such, <em>oveh</em>.” A pause. “Maybe, your caretaker can provide you with additional information on this topic. If you will excuse me, I will make sure the children are following their schedule.” With a curt nod, he was gone.<br><br>\nKirk let out a harsh breath. “What a dick,” he hissed.<br><br>\nSpock actually flinched where he stood. “Mr. Kirk--”<br><br>\n“It’s Jim. And I’m not taking it back. I knew Vulcans had some xenophobic tendencies, but did he really just imply you were a ‘disruptive foreign influence’ in school due to your mixed heritage?”<br><br>\n“I did not fit in easily with the other children,” Spock admitted quietly.<br><br>\n“So? It’s the teacher’s responsibility to make sure you are not singled out instead of actively supporting the alienation.”<br><br>\nSpock was surprised at the sudden fervency of Kirk’s defense. “His criticism is not without base,” he tried to elaborate, but Kirk was shaking his head.<br><br>\n“Spock, you’re one of the most intelligent, logical and kind people I know. Plus, I have met your mother. I cannot imagine you to be anything less than an exemplary student. If you ended up making trouble in school, I’m sure it wasn’t your fault alone.”<br><br>\n“Your high opinion honors me,” Spock replied stiffly.<br><br>\nKirk smiled up at him, smoothing the angry creases in his face. A hand settled briefly on his shoulder, squeezing it. “Sorry you had to deal with this as a kid. You deserve much better.”<br><br>\nBefore Spock could react, Kirk had already let go and turned way. “So, you’re going to show me around some more or what?”<br><br>\nSpock could not find a logical explanation for the sudden heat in his cheeks.</p>\n<p>The nightmares had been getting steadily more realistic. Now that his body had mostly recuperated from its more serious injuries, his mind was apparently content to throw at him everything that had happened on Nero’s ship in stunning detail.<br><br>\nEach night, Jim awoke tangled in his blanket, trembling and covered in sweat after reliving being cut, beaten, shocked and laughed at. Twice, he had wet the bed as well and both of those times, he had fervently hoped not to meet anybody, least of all Sarek, in the hallway as he discarded the sheets in the laundry and retrieved a new set.<br><br>\nIt was fortunate that his nightmares had been mostly silent. At least, nobody seemed to wake with him or came to look after him like Spock had done on his first night here.<br><br>\nThis night was different again, however. Or at least, that was what Jim gathered from coming to his senses on the floor next to the bed with his heart beating heavily in his chest and Spock hovering over him. His hands were curled around Jim’s upper arms, firm as manacles as they held him down. His lower lip was split, thick green blood making its way down his chin, his robes torn at the seams by his shoulders.<br><br>\n“Shit,” Jim whispered involuntarily. His voice sounded brittle and his throat felt like sandpaper.<br><br>\n“Can I let go now, or will you attack me again?” In contrast, Spock sounded almost completely calm, though his messed up bangs spoke a different story.<br><br>\n“Shit,” Jim repeated. “Yeah, you can let go.”<br><br>\nSpock uncurled his hand and Jim finally realized that he had touched bare skin, undoubtedly getting a good taste of the irrational fear still shaking his body.<br><br>\n“Crap, Spock, I’m sorry,” Jim rasped as he sat up. He rubbed over the spots where Spock had grabbed him, which were throbbing in tact with his racing heart now that the pressure was gone. Spock’s eyes zeroed in on the movement immediately.<br><br>\n“I grabbed you too harshly,” he said and Jim knew him well enough by now to hear the regret in his voice. “A Human fearing for his life is surprisingly strong and I had trouble estimating an appropriate physical response. I apologize.”<br><br>\n“Well, apparently I split your lip, so I’d say we’re even.”<br><br>\nRaising an eyebrow in surprise, Spock lifted a hand to his mouth, regarding the sticky green on his fingers. “I did not realize you had managed to hit me.”<br><br>\n“Me either,” Jim said, rubbing a hand over his face. Fuck, what in hell was wrong with him?<br><br>\n“I am quite aware you were not yourself.” Spock stood, then offered an arm to Jim.<br><br>\nJim made a point of grabbing the sleeved part of Spock’s arm, although it was probably pointless. Spock had already born the full brunt of Jim’s volatile emotions if he had to hold him down with bare hands.<br><br>\nWhen he stood, Jim’s shaky legs forced him to sit down on the bed quickly. A glance towards his lap revealed that at least he hadn’t pissed himself this time.<br><br>\n“It is unfortunate that you are again suffering from nightmares,” Spock said and, to Jim’s surprise, sat down next to him on the messy bed, nearly close enough to brush their shoulders together. “I had thought it would have passed now that you are acclimatized to your room.”<br><br>\n“Well…” Jim trailed off, but Spock clearly got the message.<br><br>\nHe pursed his lips in obvious disapproval, causing more blood to run from the split. “You have been having them every night, have you not?” Almost casually, he brushed away the fresh blood, clearly too focused on Jim to bother much with it. “Nightmares of this intensity?”<br><br>\nFeeling too shaky to lie, Jim just nodded. “Yeah. No screaming, though.”<br><br>\n“You did not think it wise to inform me or a healer of your troubles?”<br><br>\nJim had no reply to that. What could he say? Spock already knew Jim didn’t want to bother him, didn’t want to bother anyone. He’d be fine once he was back on Earth. Maybe Bones could slip him some therapy so he could get right back to work. Didn’t he have a minor in psychology or something?<br><br>\nA cool hand curled around his wrist. Startled out his straying thoughts, Jim stared down at the contact, then up at Spock, who was quite pointedly not letting go.<br><br>\n“Jim,” he said very seriously. “It is not healthy to experience these kinds of nightmares every night.”<br><br>\n“I’m not exactly asking for them, Spock,” Jim snapped.<br><br>\nSpock did not seem offended. “You misunderstand me,” he replied quietly. “I meant to offer you my assistance.”<br><br>\nJim snorted humorlessly. “Well, the breathing thing isn’t helping much.”<br><br>\nSpock tilted his head. “Yes, I can see that the <em>tu-lan</em> is not assisting you in clearing your mind. Therefore, I have a different proposition to make. It would, however, be quite … invasive.” Still, he was not letting go of Jim’s wrist.<br><br>\nJim swallowed, trying to get rid of the scratchy feeling in his throat. “Invasive?” he asked.<br><br>\nSpock nodded. “Yes. I would act as your <em>pihlora</em>, your guide in meditation.”<br><br>\n“So we’d meld?” Jim could not help but be reminded of the pain and nausea the older Spock had caused him.<br><br>\nSpock must have felt his spiking anxiety through the touch, as he hurried to explain: “It would not be like your meld with the Elder Selek. Unlike him, I am not emotionally compromised. Also, I will not add memories to your mind, but rather guide you to settle the thoughts and emotions already in place.” He hesitated. “Still, it would be a rather personal affair, as I would be partly aware of your thoughts.”<br><br>\n“Oh,” Jim said. That did sound more than a little invasive.<br><br>\n“Your throat sounds sore,” Spock observed. “I shall fetch you something to drink. You may use the time to think over my proposal. You might find that you have questions.” His fingers tightened briefly around Jim’s wrist before letting go. “I will return shortly.”<br><br>\nJim looked after him, feeling slightly overwhelmed as well as shaken up. Melding -- with Spock?<br><br>\nIt wasn’t like he didn’t trust him. He trusted him a whole lot. Too much almost. And he genuinely liked him, too. It had not passed Jim by how much he cherished Spock’s company, how enjoyable it was to talk to him. He usually did his best to simply ignore the little crush he had been harboring for the past weeks.<br><br>\nLetting out a shaky sigh, Jim let himself fall back onto the mattress, legs dangling off loosely at the edge. God, he was a mess.<br><br>\nThe mind meld with the older Spock had shaken him deeply. He still found himself remembering things that had nothing to do with explaining Nero’s presence in this universe, things he knew he had not experienced -- seeing an older, slightly different version of himself in the captain’s chair or setting foot on planets he knew he had never visited. He honestly did not want his mind to have to deal with yet another intrusion.<br><br>\nBut Spock had said this would be different. Something to bring order into the chaos. Maybe, he could even help Jim with getting rid of the strange memories. Or repress them. Something like that, surely.<br><br>\nRealizing that he had already made up his mind, Jim let his eyes drift shut until Spock returned. He had taken care of the split in his lip and ordered his hair, but his night robes were still torn at the shoulders.<br><br>\nSitting up once more, Jim gratefully accepted the glass of water provided to him. It was not cold, but it had the earthy taste water seemed to acquire naturally on Vulcan. He downed it in one go, then nodded to himself.<br><br>\n“Let’s do it,” he said firmly, looking at Spock.<br><br>\n“You speak of me acting as your <em>pihlora</em>?”<br><br>\n“Yes. My mind’s a mess and as long as I’m not on Earth, I might as well try a Vulcan form of therapy, right?”<br><br>\n“It is not precisely--” Spock started, but Jim shook his head.<br><br>\n“Yeah, yeah. I get it.”<br><br>\n“It is also not a decision to make lightly,” Spock reminded him seriously. “You have ample time to form a final opinion on the matter.”<br><br>\n“Well, I trust you now.”<br><br>\nSpock blinked at him, clearly taking his time to let that sink in. “You honor me,” he finally said.<br><br>\nFeeling distinctly uncomfortable with the look on Spock’s face, Jim hurried to say: “So, let’s just try it.”<br><br>\n“Now?” Spock raised his eyebrows.<br><br>\n“Why not?”<br><br>\nSpock shook his head. “You are too unsettled. As am I.”<br><br>\n“Damn, okay. Um, sorry about,” Jim said, making a vague gesture towards Spock’s head, “messing with your mind, too.”<br><br>\n“It was of my own free choice. In addition, my mental shields are adequate and able to forestall any serious damage to my mental composure.”<br><br>\nJim nodded. God, he was tired. As he was still covered in cold sweat though, a shower was non-negotiable. “I’ll freshen up then, and try to sleep some more.”<br><br>\n“A logical decision.” Spock stood, taking the empty glass from Jim. “I hope you rest well, in spite of your troubles.”<br><br>\n“Thanks, Spock.”<br><br>\n“After breakfast, if you are amenable, you may come to my room and I will attempt to guide your mind.”<br><br>\n“Sure.”<br><br>\nFor a moment, it looked like Spock wanted to say something more, but then he turned and left without another word, letting the door slide shut behind him</p>\n<p></p>\n<p></p>\n<p>__ __ __</p>\n<p><br>\n“You will need to relax,” said Spock for the fifth time.<br><br>\n“I’m trying!” And he really was. But every time Spock raised his hand and came anywhere near his face, Jim was reminded of the other Spock and inevitably flinched back.<br><br>\n“Did you not say that you trusted me?”<br><br>\nJim also knew Spock wasn’t trying to guilt-trip him -- there probably wasn’t even a word for it in Golic -- but it didn’t fucking help that it sounded like he was.<br><br>\n“I do,” Jim insisted. “It’s just-- um, you know. Kind of freaked out because of last time.”<br><br>\nSpock folded his hands neatly in his lap. “If you believe you are unable to do this due to your prior experience, we can of course stop trying.”<br><br>\n“No!” Jim shook his head. “I want to try. Really. Do you think I don’t want to get better? I’m about done with feeling like crap every morning, you know?”<br><br>\n“I see,” Spock said. “In that case, you will need to--”<br><br>\n“Relax! I know. Just … give me a minute, okay?”<br><br>\nClosing his eyes, Jim took several deep breaths. It took him a few moments to realize that he unconsciously had chosen the pattern of the technique Spock had taught him. He could still not achieve the floating sensation for any great amount of time, but it did help calm his pulse and relax his muscles -- if he wasn’t attempting the awkward meditation position, that is. Luckily, Spock had told him that a comfortable cross-legged position would be more practical for the meld.<br><br>\n“Okay,” he finally breathed out after a few minutes had passed. “Let’s do this.”<br><br>\nSpock nodded, taking a deep breath of his own. Slowly, carefully, he raised his hand and it approached Jim, who involuntarily tensed. But he would not flinch. He would not.<br><br>\nAnd then, finally, Spock’s fingers connected with his face, instantly finding the right pattern. He murmured something in Vulcan and then--<br><br>\nIt was completely different to the other meld. Spock’s presence wasn’t a brunt force dumping information, but more like a warm wave, lapping over rough edges and blunt ends, smoothing them over. Jim felt like he was sinking, drowning in Spock’s presence without the fear of choking on it.<br><br>\nHe had no exact idea what it was that Spock was doing. Every once in a while, a memory of Nero torturing him would slip up, like a memory suddenly triggered by a smell, sound or picture, but Jim felt detached, like he was seeing it through a filter taking away all emotions and associations attached to it.<br><br>\nMostly, he reveled in the feeling of being so intimately close to somebody else. He did not feel or see any of Spock’s distinct thoughts and memories, but he was a warm and soothing presence in his mind. It hardly felt invasive to have him there, though rationally, it was.<br><br>\nWhen Spock finally drew back, Jim had no idea how much time had passed. All he knew was that he felt better. Quieter. Calmer. He knew he was smiling blissfully when he opened his eyes, feeling simply good in a way he had not experienced in a while.<br><br>\nThe same could not be said for Spock, whose hand was trembling as he returned it to his lap. He was visibly affected by the whole affair. Jim had never seen him like this. His face was tense, wrinkles of pain or discomfort edged around his eyes and mouth.<br><br>\n“Spock, are you okay?” Jim asked immediately, worry clogging up his own voice.<br><br>\n“I am,” Spock said, but his voice was also shaking, and that had never happened before when Jim was around.<br><br>\n“What’s going on? Has my mind hurt you or something?” Jim instantly felt sick at the thought. Spock had gone through some pretty graphic memories of torture. Damn. Jim should have thought about this before giving his consent.<br><br>\n“I merely require meditation of my own,” Spock replied. He looked even paler than usual, clearly not a good sign.<br><br>\n“Should I fetch somebody? You don’t look so good.”<br><br>\n“No!” Spock snapped. And wow, he had never sounded this upset before. He took another deep breath, averting his gaze from Jim’s entirely as he spoke up again: “I apologize for my harsh tone. All I require at the moment is solitude.”<br><br>\nJim hurried to get to his feet. “Oh,” he said. “Yeah, okay. Sorry. I’ll leave.”<br><br>\nSpock did not react. He adjusted his own posture to a complex meditative position and closed his eyes. But instead of looking collected and calm, his eyelids twitched and his shoulders were tense. Jim hurried to leave.<br><br>\nOutside Spock’s room, Jim took a deep breath and ran a hand over his face. Damn. He hoped he hadn’t traumatized Spock in the meld or something. He had seemed so confident when he had explained it to Jim, he hadn’t even thought something could go wrong. Certainly, he had never thought it could impact Spock negatively. He’d only been worried for himself.<br><br>\n“Are you quite well, <em>oveh</em>?”<br><br>\nSarek’s stern face appeared in Jim’s line of vision. Well, crap. That’s not who he wanted to talk to right now.<br><br>\n“<em>Kevet-dutar</em>,” Jim managed. “I’m just fine, thank you.”<br><br>\nAnd he really was, too. Underneath the worry for Spock, he felt calmer than he ever had since waking up in Shi’Khar hospital. There was no trace of anger, fear or helplessness, at least not right now. Clearly, the meld had done some good, at least for himself.<br><br>\n“You do not look ‘fine’.” Sarek threw a suspicious glance at the door to Spock’s room. “Has Spock done something to upset you?”<br><br>\nJim vehemently shook his head. “No. God no, really. I think it was me who did something to him.” The last thing Jim wanted to do now was get Spock into trouble with his father again.<br><br>\n“Indeed?” Sarek frowned the tiniest bit. “Are you able to elaborate on that, <em>oveh</em>?”<br><br>\n“Well,” Jim hesitated. He could hardly lie now. When Sarek asked Spock, he would surely tell him the truth anyway, what with Vulcans and their requisite honesty. Still, he had a feeling Sarek would not be amused. “We mind-melded.”<br><br>\nFor the first time, Jim saw open surprise on Sarek’s face. It clearly was not often the man lost his composure, undoubtedly a trait well-trained both by being a logic-abiding Vulcan and an ambassador.<br><br>\n“You melded?” he repeated, the tips of his eyebrows disappearing behind the line of his bangs.<br><br>\n“We did. Spock thought it might help with my nightmares. He was acting as my <em>pihlora</em>, he said.”<br><br>\n“And you deemed that wise, given what happened during and after the meld with his counterpart?”<br><br>\n“Spock is not Selek.” Jim made a point of looking Sarek directly into the eyes. “I trust him not to hurt me.”<br><br>\nSarek acknowledged it with a curt nod. “Still, the experience seems to have been upsetting to you.”<br><br>\n“Not to me.” Jim shook his head. “I feel fine. But for Spock -- well. He wasn’t doing so well when we ended the meld, <em>kevet-dutar</em>.”<br><br>\n“What exactly happened?” It was plain their antagonistic relationship didn’t go so far that Sarek no longer worried about his son’s well-being when it really mattered.<br><br>\nJim had been uncomfortable leaving Spock in a state like this. Coming to a quick decision, Jim explained: “When the meld was over, he was shaking. He insisted he was fine, but I don’t think he was. He said he had to meditate.”<br><br>\n“Is that was he is doing now?” Sarek asked, sending another glance at Spock’s door. Yes, definitely worried.<br><br>\n“What he’s attempting to do, yeah,” Jim said with emphasis.<br><br>\nSarek threw him another quick glance before looking back at the door. “In that case, if you will excuse me, <em>oveh</em>, I will see to my son’s state myself.”<br><br>\nJim watched him enter Spock’s room with relief. So Spock wouldn’t be on his own after this. Good. He could only hope it wouldn’t end in another fight between the two Vulcans.</p>\n<p></p>\n<p>__ __ __</p>\n<p><br>\nJim did not see Spock until dinner, where he kept silent and pointedly avoided Jim’s gaze. Jim, however, was having none of it.<br><br>\n“How are you feeling, Spock?” he asked as he was handed a bowl of turnip-like Vulcan vegetables by Amanda. “You look better, at least.”<br><br>\n“My state of health is adequate,” was his curt response, his eyes virtually glued to his plate.<br><br>\n“I believe Mr. Kirk would benefit from you elaborating on that, Spock,” Sarek said. “He was quite unsettled when I talked to him.”<br><br>\nAmanda’s eyes instantly narrowed in on the two of them, though she kept quiet as she filled her own plate, holding the slightly differently shaped Vulcan cutlery with practiced ease. Clearly, nobody had told her anything yet.<br><br>\n“There is nothing further to say, <em>osa-mekh</em>,” Spock insisted.<br><br>\n“<em>Sa-fu</em>,” Sarek prompted. “I deem it wise.”<br><br>\nJim did not miss Amanda’s incredulous stare at that pronouncement. Clearly, there was an undertone in this conversation Jim was unable to pick up on. But then, Amanda would know her husband and son much better than him.<br><br>\nSetting down his cutlery, Spock finally looked up, his face as blank as before the meld. “I have once more settled my mind. I apologize for any worry I might have caused.” His voice had sounded stiff until now, but it gentled when he asked: “Have you benefited from the meld, Jim?”<br><br>\n“I have, I think. I feel much calmer. Less agitated.”<br><br>\nSpock nodded, throwing his father a glance, possibly to see if he had fully satisfied his wish, before returning to his meal.<br><br>\nWhen Jim caught Amanda’s eyes once more, she was looking at him pointedly, silently forming the word <em>Talk</em> before she, too, focused on her meal. Nobody said anything until the meal was over, but then Spock had recently explained to Jim that it was not usual for Vulcans to talk much while eating.<br><br>\nWhen the dishes were discarded in the cleaner, Jim found himself confronted by Amanda. Undoubtedly having years of practice as an ambassador’s wife, she managed to steer Jim away from Sarek and Spock without being too obvious about it. They ended up on the deck overlooking Amanda’s garden. As the sun was already setting, the heat wasn’t too unbearable.<br><br>\nAmanda sat him down firmly on one of the seats in the shade. “What have you done?”<br><br>\n“Me?” Jim bristled, but Amanda was shaking her head.<br><br>\n“I don’t mean it like that. But -- Sarek and Spock. They’re talking!”<br><br>\n“Yes?” Jim was not sure he understood what Amanda was trying to say.<br><br>\n“You didn’t notice? Oh, of course you wouldn’t, why would you!” She smiled at him as she adjusted her headscarf, tucking in some loose strings of hair. “They actually talked. Civilly. Sarek even called him <em>sa-fu</em>. I don’t think I’ve heard him acknowledge Spock as his son in years.”<br><br>\n“Oh?” Jim said. He was getting the idea now, at least he thought so.<br><br>\nQuickly, he explained to her what had transpired. Amanda nodded along, throwing in a brief comment or two to express her approval or surprise. She was clearly excited over the apparent improvement in Sarek’s and Spock’s relationship, though Jim could not quite understand how a single word could be seen as such a big step.<br><br>\nJim almost felt sorry for her. It must have been hard for her, seeing her only son and husband be so distant with each other for all these years, quietly trying to work through Vulcan resolve to bring them closer again.<br><br>\n“I’m so glad Spock took my advice,” she said when Jim finished, smiling brightly at him. “Though I didn’t know it would affect him this much.”<br><br>\n“You proposed the meld?”<br><br>\n“I did. I thought it would help you,” she explained. “When I had newly bonded with Sarek, I had troubles adjusting to our new connection. Sarek frequently helped me order my mind until it had settled.”<br><br>\n“Oh. But Spock and I aren’t--”<br><br>\n“Of course not,” Amanda interrupted him. “But you are rather close. And clearly, you’ve benefitted from it, so that’s good at least. I’ll make sure Sarek tells me all about how Spock is doing.” Again she smiled, then leaned over to pat Jim’s arm. “For years, I’ve been trying to get them to mend things, and here you come and just push them into a room together. I knew you’d be good for Spock. He’s very fond of you, you know?”<br><br>\nJim blinked at her, but she was already standing up. “Let me talk to my husband now. I’m sure he’ll try to be very Vulcan and secretive about the entire affair, but I’ll get him to talk eventually.”<br><br>\nShe winked at him and was gone, leaving Jim to sit in his chair, watching the Vulcan sun set as he chewed this strange conversation over.<br><br><em>You are rather close.</em> she had said. <em>I knew you’d be good for Spock. He’s very fond of you.</em><br><br>\nJim pressed a hand over his mouth, thinking. It was clear Spock had talked to her about him, and it wasn’t the first time she had said that she thought them rather close. But had Spock let something more slip? Did he care about Jim more than he let on when they spent time together?<br><br>\nJim had already come to terms with the fact that he was sort of harboring a crush for the guy, but then he had put that down to an injured person having a thing for their caretaker. Especially if said caretaker looked like Spock, all lean muscle and dark hair. Nothing serious, certainly.<br><br>\nBut the meld had felt so comforting, so warm, almost safe. Like a cozy blanket. If Jim could, he’d revisit the experience every day of his life. And if Spock also felt--<br><br>\nGod, no. Stop. This was ridiculous. He wasn’t a fucking teenager. If there was something between them, surely it would manifest itself or simply die down. Those were the only possibilities, and staring at the sunset playing <em>does he, does he not</em> would most certainly not help.<br><br>\nJim shook his head at his own foolishness as he stood and returned to the house.</p>\n<p></p>\n<p></p>\n<p>__ __ __</p>\n<p><br>\nUnfortunately, Jim could not stop thinking about the revelations of that conversation now that the seed was sown. As Amanda kept insisting Jim had to go out and see things, especially now that he was at least slowly getting used to the heat, it gave Jim ample time to observe Spock, too.<br><br>\nSpock was not showing any signs of anything other than friendly regard for Jim, but then he was Vulcan. What did a Vulcan with a crush look like? Did they even do that, or was it more of a Surakian approach, weighing pros and cons and finding the ideal mate through calculations and logical precision?<br><br>\nJim knew the most intimate of things for Vulcans was touch, but unless he counted the few times Spock had touched him for caretaking reasons, Spock had only really sought out contact consciously once or twice. Neither of those touches had seemed overly intimate to Jim.<br><br>\nBut then, Amanda and Sarek were bonded, and Jim hardly saw them touch either. They occasionally shared a Vulcan kiss in front of him, a slow, tender brush of their fingers, but nothing that Jim would call very demonstrative.<br><br>\nSpock also always had a legitimate reason to be close by Jim. If it wasn’t the same old caretaker fuss, he was showing Jim how the Vulcans had actually made use of Nero’s drill hole to build a scientific research station closer to their planet’s core, or they were playing chess, or he was asking if Jim about his nightmares and peace of mind. So it wasn’t like Jim could really interpret that as a sign of interest either.<br><br>\nReally, Jim had no way of knowing anything for certain, and if Amanda hadn’t given those vague hints, he’d probably still be oblivious that there might be something going on between them.<br><br>\nSo maybe, it was up to him to approach things. He had done his fair share of flirting, with Aliens as much as with Humans, and he had been on Vulcan for long enough to have at least some idea of what it might entail.<br><br>\nIt felt awkward, but Jim was determined. One afternoon over chess, he brushed their fingers together a few times as if by accident as they set up the board. But besides a stiffening of his shoulders, Spock did not show any signs of having even noticed, let alone cared.<br><br>\nAnother afternoon, they were taking a shuttle back to Spock’s home after a check-up at the hospital with T’Lkai, and Jim made a point of brushing their legs together. Spock only briefly glanced at their connection before adjusting his leg and breaking the contact.<br><br>\nOne night, with Spock pointing out certain star constellations visible on Vulcan from the deck of his house, Jim sat very close to him, paying extra attention to everything he said and asking lots of questions. Spock had eventually retired to his room, not once commenting on Jim’s behavior.<br><br>\nEither, Jim was being too subtle, or Amanda hadn’t meant anything when she had mentioned Spock’s particular fondness for him. Maybe, she had simply meant friendship, and Jim, still affected by the intimate connection of the meld, had interpreted it in a way that suited his own feelings. The meld had been something else. Warm. Soothing. All things good.<br><br>\nBut it wasn’t like he was in love with Spock, so if he had been wrong, it certainly wasn’t anything to waste too many thoughts over. It wasn’t like he was in any state to pursue any sort of relationship, anyway, what with being a bed wetter in his twenties.<br><br>\nThe meld had helped with the nightmares, though. He was still having them, but he didn’t wake up covered in sweat every night, and the dreams were less volatile and sometimes merged with fond or harmless memories, making it a far less scary experience.<br><br>\nJim doubted he was anywhere near healed or would pass a psych eval at Starfleet, but he was getting more sleep now, didn’t have to change soiled sheets and just felt better all over. Even the Vulcan breathing thing worked better for him, now that he wasn’t feeling so tired and restless all the time. If it weren’t for the ever present heat and T’Lkai insisting that he was not fully physically recuperated and sticking him with hypos whenever they went to the hospital, things would really be looking up.<br><br>\nMaybe, Jim might have let the whole thing drop and forced his little crush into oblivion when one afternoon, returning from yet another trip to Shi’Khar, Selek hadn’t been waiting for them at Spock’s home.<br><br>\nHe was drinking a cup of spicy Vulcan tea as he made light conversation with Amanda. Spock came to an abrupt halt next to Jim as he saw him.<br><br>\nJim himself didn’t quite know what to feel when he saw the Elder. He knew the older Spock hadn’t meant to mess with his mind, but he had, and it hadn’t been a pleasant experience. Still, it was clear from the strange memories in his head that this version of Spock and his Kirk had been close friends, much closer than Jim and his own version. Jim couldn’t begin to imagine what it must have been like to see and talk to another version of a friend so dear. He certainly wouldn’t know what to do when he encountered another Bones somewhere.<br><br>\n“Jim”, the Elder said and stood, placing down his cup on the table. “Spock.”<br><br>\n“Elder Selek,” Spock returned stiffly. Jim noticed he was not presenting him with the <em>ta’al</em> or bowing his head in greeting.<br><br>\nJim only nodded at Selek, feeling more than a little bit uncertain about the whole thing.<br><br>\n“I had hoped I’d be able to talk to you, Jim,” Selek said. His voice sounded sad and even his face showed some emotion. Clearly, this version of Spock had come to embrace a bit of emotional expression at some point in his life. “About what has transpired between us.”<br><br>\n“I do not deem that wise,” Spock interfered before Jim could form any sort of reply. Jim glanced at him in surprise, but Spock’s eyes were on his counterpart. “The last time you spoke to him, it greatly unsettled him and lead to severe mental disarray. It is only logical to assume another conversation will have similar consequences.”<br><br>\n“Last time, I had not yet sought out the <em>kolinahru</em> to settle my mind. to settle my mind. Furthermore, I am not planning on initiating another mind meld.” Selek’s eyes settled on Jim. “Jim, I am very sorry I hurt you. It was not my intention.”<br><br>\n“I know,” Jim managed. The older Spock sounded so regretful, Jim had a hard time staying mad at him. “It’s okay. I’m sure you didn’t know what would happen.”<br><br>\n“He should have known,” Spock retorted. Jim was surprised how harsh his voice sounded. “He was severely emotionally compromised ever since passing through the black hole alongside Nero. He should have known it would not be wise to meld, especially not with an untrained mind like yours.”<br><br>\n“Spock, I don’t think--” Jim said, but was interrupted by Selek.<br><br>\n“Spock is correct,” he said, sounding tired. “I should have known. But seeing you before me, James Tiberius Kirk -- my dear friend. The temptation to know you again was too great.”<br><br>\n“He is not your James Kirk,” Spock reminded him. “He is a completely different person who has lived another life entirely, thanks to your careless actions.”<br><br>\n“Spock!” That was Amanda, sounding honestly upset. “You’re being rude.”<br><br>\nSpock glanced at his mother, then inclined his head. “I apologize,” he said, but didn’t sound the least bit sincere about it.<br><br>\nFeeling helpless in the face of Spock’s reaction, Jim felt it would be best to separate the two of them before something worse might happen.<br><br>\n“Selek,” he said. “I’m willing to talk. In private.” Jim sought out Amanda’s eyes. She nodded and stepped up to Spock, taking him by the arm.<br><br>\n“Let them talk it out, Spock,” she said, gently guiding him away. “It’s Jim’s decision.”<br><br>\n“I will be close by,” Spock informed them before letting himself be pulled from the room.<br><br>\nThe following silence was awkward at best, with Selek staring at the spot where Spock had been with sad eyes.<br><br>\n“I’m sure he didn’t mean to blame you or anything,” Jim finally tried to reassure him, grasping helplessly for something to say.<br><br>\nSelek shook his head. “He did,” he said. “But it is of no consequence. He is not incorrect. It was my actions that brought chaos into this universe and changed the course of your lives.”<br><br>\nUnsure how to refute that statement, Jim shrugged awkwardly. “Anyway,” he said. “You wanted to talk?”<br><br>\nSelek nodded. “Mainly to apologize to you,” he said. “And to ask after your state of health after what I have done.” He gestured towards the seats and abandoned tea and they both sat down.<br><br>\n“I’m good,” Jim said, summoning a smile. “I mean, it wasn’t pleasant, but I’m okay.”<br><br>\nSelek watched him carefully. “I have been informed that more information has leaked through the meld than I had originally intended.”<br><br>\n“Yeah. I mean, I’ve got all the stuff with Nero and the red matter, but there’s also -- other things. You exploring space with my counterpart, mainly.”<br><br>\nSelek let out a nearly inaudible sigh. “I apologize for the additional transference,” he said. “I had not seen you for so long, my mind longed to reconnect with you. And when my mind found that you were different from what I knew, it tried to make up for you lack of memories by providing my own.”<br><br>\n“Oh,” was all Jim managed. “Well, it’s fine.”<br><br>\n“It is not ‘fine’, old friend,” Selek said, shaking his head. “But then, neither is calling you that, is it? I must admit, I find myself running into difficulties in separating the people from my universe with the versions I meet here. It is not easy to realize that you look and sound so much like my James Kirk, but are not him.” His voice sounded shaky. Brittle. Old.<br><br>\nAnd even though Jim was still somewhat angry at him, he could not help but feel sorry for the older Spock. It was clear he felt guilt and regret over what had happened, even though it was not his fault his mission to safe Romulus went this terribly wrong. This Spock -- he had to miss his friends, his family, and all he had now were caricatures of those he had known and cared for, taunting him with their false familiarity. With all that was different in this universe, it was clear they were far from the same people this Spock knew from his own timeline.<br><br>\nThe mind meld had been horrible, but Jim could understand. He really could. This Spock’s mind had simply looked for a familiar touch, a friend. Following an instinct, he placed a careful hand on Selek’s sleeved arm which was placed on the table between them.<br><br>\n“I’m sorry,” he said sincerely, “for your loss.”<br><br>\nSelek’s face was full of gratitude as he accepted the gesture. “Thank you, Jim. Your kindness is, as it seems, a constant in all timelines.”<br><br>\nThey talked for a few more minutes. Selek asked about Jim’s physical health, and Jim told him readily about the decreased hearing capacity of his pointed ear and the lasting numbness in his fingertips.<br><br>\nEventually, though, they were at a loss of what else to say and Selek stood, bidding his farewell.<br><br>\n“If you are amenable,” he added, “I would like to stay in contact. I would greatly appreciate if you would write to me, if only a few sentences as to how you are faring.”<br><br>\nHe had to feel lonely, Jim thought as he agreed. Selek looked so grateful that Jim couldn’t help himself and squeezed his arm once more, a gesture that seemed to mean much to him if the sheen in his eyes was anything to go by.</p>\n<p>When Selek approached Spock and his mother in the hallway, Spock had already regained most of his emotional composure.<br><br> Spock was not in the conscious habit of lying to himself. He knew exactly why he had reacted the way he had when they had encountered Selek. The Elder had proven himself a threat to Jim, and that was unacceptable now that Spock knew his mind. Jim had been hurt far too often in his life. Spock considered it his duty to protect him from any further harm.<br><br> “I also wish to talk to you, Spock, if you are amenable,” Selek said and Amanda excused herself at once, possibly unwilling to listen to another argument.<br><br> “I can think of no benefits to be derived from such a conversation,” Spock said coldly and turned towards the sitting room door, eager to seek out Jim and make sure he was faring well after this unexpected encounter.<br><br> “It is clear you now know his mind,” Selek called after him.<br><br> Spock came to an abrupt halt, slowly turning back toward the Elder. “Elaborate.”<br><br> Selek stepped closer, lowering his voice. “The manner in which you reacted when you talked to me earlier was ample proof. You are protective of Jim Kirk, almost ferociously so. It is clear your minds have touched.”<br><br> “I did not think it was so obvious,” Spock admitted, albeit unwillingly.<br><br> Selek displayed a rather un-Vulcan smile. “I have felt the very same protectiveness for decades. I know what it is like to love James Kirk.”<br><br> Spock inhaled sharply. “You do not know of which you speak,” he said tightly.<br><br> “An entirely illogical statement, although excused by your emotional involvement. Your minds have touched. You must have felt the obvious: How compatible your minds are. How well they fit together.”<br><br> “Yes,” Spock admitted. “But we are not bonded. There is no reason to speak of affection.”<br><br> “You could be bonded. Easily so.”<br><br> Spock stared at him. “You are not making sense, Elder. I advise you to seek order for your mind through extensive meditation.”<br><br> Selek only sighed, shaking his head. His gaze flitted towards the closed door to the sitting room where Jim was still residing. “Please do not repeat my mistakes and disregard that potential until it is too late.”<br><br> “You speak nonsense.”<br><br> “Hear me out, Spock. It is illogical to deny that which is obviously true. Your minds are highly compatible, just as my mind was with that of my James Kirk. That connection-- it has great potential. I even believe that, had I acted on that which I knew to be true but denied nonetheless, my Jim and I could have become <em>t’hy’la</em>.”<br><br> Spock stared at Selek. “There have been very few recorded <em>t’hy’la</em> bonds,” he said tightly.<br><br> “Indeed. But they have been the most stable, harmonious and fulfilling bonds ever to exist, and all of them have had at their heart a mental compatibility far exceeding the average between other satisfactorily bounded couples.”<br><br> “I do not think--”<br><br> “Have you not felt it?” Selek pressed. “Tell me honestly. What did you encounter when you entered Jim’s mind?”<br><br> Spock could not reply immediately. Touching Jim’s mind could not be described adequately in words. It had been like coming home after a long journey, but finding that home in chaos. It had felt like receiving that which you had long desired, only then realizing it was already slipping away from you again.<br><br> Spock had felt their compatibility, but he had also seen the chaos and hurt in Jim’s mind. He had wanted nothing more than to soothe his fear and pains. He had spent far too long in the meld, far longer than he had planned or was accustomed to, taking utmost care to shield and protect Jim. He had soothed his mind, smoothed the harsh edges of the painful memories of torture and despair and made them fade into the background. There had been little actual guidance involved. Rather, it had been Spock taking care of Jim to the best of his abilities.<br><br> He had been deeply shaken when their minds had disconnected. In addition to the experience of Jim’s volatile and traumatic memories, he was also fighting with the urge to reconnect with Jim immediately, to know all his thoughts, to ask him to give up all that was his and give his own mind in return. An illogical wish to forever wrap him up in his own mind and protect him from any possible harm.<br><br> It had taken his father’s gentle guidance to bring order back into his own mind. Of course, it had also been inevitable that he find out what it was that Spock had seen and felt in Jim’s mind. He had not voiced his thoughts on the matter, but Spock realized that Sarek, too, knew of the connection between Jim’s and Spock’s minds. One might even see their improved relationship since the incident as a sign of his approval.<br><br> “I admit to feeling the compatibility of which you speak,” Spock whispered shakily, averting his gaze.<br><br> “Please,” Selek implored. “Do not waste your opportunity like I have. Talk to Jim. Connect with him. Ask for a bond.”<br><br> “I am unsure he would welcome such an intimate connection. Besides, he is still recovering from a traumatic experience. This is not the right time.”<br><br> “This is the right time,” Selek insisted. There was an edge of desperation in his voice that made Spock look at him. His older self looked very Human just then: sad, defeated. “This Jim has little bonds, little family. And it is quite obvious that he is fond of you, even from the little interaction I have seen between you. Do you really not believe he would benefit from the stability of a mate? Thrive on the love you can offer?”<br><br> “Love,” Spock repeated helplessly. Why was it that for most of his life, he had aimed to purge all emotion, but was now victim to the most confusing of them? Love. Affection. A desire to bond, to be close to Jim. To know his mind, soothe his fears, keep him safe. These were not things Vulcans spoke of often, let alone so freely.<br><br> “Do not deny it,” Selek said quietly. “I have made that mistake, and now all I have is memories of a deep friendship and a regret for not acting upon my suppressed feelings until it was too late. I knew his mind, but not as intimately as I should have liked. My Jim and I, we never bonded. I deeply regret that.”<br><br> Spock took in all that was his older counterpart just then: the deep lines in his face, the emotion in his eyes and voice, the defeated stance. His universe had supposedly been less unfortunate, a place where Vulcan had not been attacked and Jim’s father had lived to provide him with a more peaceful life. Yet, Selek had not found peace there.<br><br> Any remaining anger at his counterpart for what he had done to Jim slipped away. “You are correct,” he said instead and Selek sighed with relief.<br><br> “Thank you,” he replied, although gratitude was so very illogical. “I bid you good luck.”<br><br> Spock nodded. “I thank you, too,” he said honestly, “for making me see reason.\"</p>\n<p></p>\n<p></p>\n<p>__ __ __</p>\n<p><br> Jim was sitting on a shady bench in Amanda’s garden when Spock found him. Clearly, he had retreated here to think over his own conversation with Spock’s counterpart, passing over the deck from the sitting room to reach it.<br><br> “Has your conversation with Selek been satisfactory to you?” Spock asked as he sat down next to Jim on the bench. Ever since touching his mind, he could not deny that he enjoyed seeking physical proximity to Jim whenever possible, although he had been careful not to draw attention to it.<br><br> “Yes, it was good to talk it over, actually,” Jim said. He was smiling at Spock, but there was concern in his voice when he asked: “He talked to you, too?”<br><br> “He did,” Spock confirmed.<br><br> “What did he say?”<br><br> “It is … difficult to summarize adequately,” Spock replied carefully, and was rewarded with another smile.<br><br> “Try for me,” Jim said gently. Spock had the fleeting thought that he could not remember the last time he had denied him any request.<br><br> “He asked me not to waste an opportunity.”<br><br> Jim tilted his head. “What kind of opportunity?”<br><br> Spock held his breath as he, slowly, carefully, reached out for Jim’s hand resting on the bench between them. He placed his own fingers directly on top of his. They were longer than Jim’s, but the shape of their hands was the same. The sensation of their joined fingers was exquisite. “This,” he said.<br><br> Jim stared down at their hands, then back up at Spock.<br><br> “This?” he repeated, his brow furrowing. There was confusion in his eyes, certainly, but Spock could feel hope and warmth through their physical connection as well.<br><br> “Indeed,” Spock agreed, slipping his fingers between Jim’s and lifting their entwined hands to settle them on his right thigh. After a few moments, Jim slumped against his side, a wave of content radiating through his skin as he settled against Spock’s shoulder.<br><br> They stayed quiet after that. Due to the ever-present heat, Jim’s hand soon became rather sticky, but Spock did not let go, holding on more tightly instead.<br><br> Silently, they watched swirls of sand blow gently around the cacti beds, both of them enjoying the closeness.<br><br> Finally, Spock could no longer reign in his questions: “You are … satisfied with this?”<br><br> Jim, whose head had been resting on Spock’s shoulder, straightened up. He turned slightly on the bench to look into Spock’s face, though his hand stayed on Spock’s thigh. “It depends on what you mean,” he said. “I’ve never been the type to hold hands, but it’s much more intimate with Vulcans, right?”<br><br> Spock inclined his head. “Yes. But it is not what I meant, specifically. Rather, I was talking about the implications.”<br><br> Jim smiled. “And what are those implications?”<br><br> Had Spock calculated wrong? Did Jim not understand what it meant when a Vulcan picked a partner? It was not done lightly, surely Jim had to know this by now.<br><br> “I seek a relationship with you,” Spock replied. “A bond.”<br><br> “Okay,” Jim replied.<br><br> Spock did not think he entirely understood. “The bond I speak of is of a permanent nature,” he elaborated.<br><br> Jim squeezed his fingers, which made Spock shiver in spite of the comfortable heat. “So you want something serious. That’s fine with me, I can do that.”<br><br> Quelling the frustration that threatened to build, Spock shook his head. “I do not think you entirely understand. It is not like a relationship between Humans. It is not only serious, it is for life.”<br><br> “Oh,” Jim said. He blinked at Spock, then averted his eyes. Spock could feel his growing confusion and uncertainty through their connection. “Oh,” he said again.<br><br> Spock’s heart thumped faster than usual in his side. Even though he truly did not wish to disconnect, he gently released Jim’s hand. It slipped off Spock’s lap, hanging limply by Jim’s side.<br><br> “You do not have to make this decision now. In fact, it is not a decision that is supposed to be made lightly or in haste.” At least not for a Human. For Spock, who had felt Jim’s mind, it had been an easy and irrevocable decision, even though it had needed Selek to see that the decision was already made.<br><br> “Spock,” Jim said. He sounded helpless. “I don’t think …” He trailed off and Spock tensed on the bench.<br><br> “If you are certain now that you do not wish a bond, I will of course respect that decision,” he said. Although if Selek was correct about Jim and he being <em>t’hy’la</em>, it would make seeking another mate nearly impossible for Spock. He would accept that fact. He could not pressure Jim into an unwanted bond, did not wish to either.<br><br> “No,” Jim replied firmly, though his was still not looking properly at Spock, only briefly glancing in his direction. “God, no, I’m not saying-- Spock. It’s just a lot to take in.”<br><br> “I see,” Spock said carefully, but Jim shook his head.<br><br> “No, you really don’t. You know, I’ve only just come to terms that I maybe have more than just a slight crush on you, and now you’re offering to get married or something. It’s a lot to take in. I don’t usually get proposed to after holding hands for a few minutes.”<br><br> Spock did not know which part to focus on first in that pronouncement. Was it the reciprocal of affectionate feelings or the inadequate analogy of a Human marriage and a Vulcan bond?<br><br> “You have ample time to think about this,” Spock finally said. “I will await your decision. My interest will not change.”<br><br> Jim cleared his throat, his eyes again fixed on one of Amanda’s cacti. “You are really serious about this.”<br><br> “I have felt your mind,” Spock explained. “We are highly compatible, Jim. A bond would be firm and most fulfilling between us.”<br><br> Finally, Jim fully turned his head toward him. His eyes were narrowed. “So what you’re saying is, you want to be with me because my mind’s a good match?”<br><br> “An inaccurate but essentially correct statement.”<br><br> Jim pursed his lips. “So you don’t feel anything for me,” he said. Spock opened his mouth to reply, but Jim did not let him talk. “It’s a Vulcan mind thing. You just think I’d be a logical choice of partner or something.” He sounded upset.<br><br> Spock did not know for certain how to calm Jim. “It is the main aspect, yes,” he said. “Bonds are essential for Vulcans. But it does not mean a lack of feelings for the partner.”<br><br> Jim did not seem satisfied. “So you do have feelings for me? You’re attracted to me?”<br><br> “You are an attractive Human,” Spock said, knowing it was not what Jim wanted to hear. But he could not talk openly about things like romantic affection. Love. It was not done. Between mates, it would be evident through the mental connection, the bond.<br><br> Jim nodded stiffly and stood. It was clear Spock had angered him. “You’re right, I’ll need time to think about this.”<br><br> He ran a hand over his face, catching small pearls of sweat. His hair, much longer than when Spock had first seen him, curled messily around his Vulcan ear, shining brightly in the evening sun of Vulcan. The Vulcan sun had bleached it, just as it had tanned his skin and lightly freckled his face. Even though he was so unlike any Vulcan Spock had known in his life, Jim looked like he belonged on this hot, dry planet. By Spock’s side.<br><br> Spock had to keep himself from standing too, from reaching out for Jim, to ask him for a meld. If he could show Jim what this meant to him, surely he would understand better.<br><br> “I will await your decision,” Spock said instead.<br><br> Jim left without another word.</p>\n<p></p>\n<p><br>__ __ __</p>\n<p><br> Jim did not have dinner with the family. He had told Spock’s mother that he was not feeling well and required rest. Although he despised dishonesty, Spock found himself hoping that it was one of those polite Human lies. He could not bare the thought that he had made Jim uncomfortable with his advances to a point where he felt physically sick.<br><br> “Did you have an argument with Jim?” Amanda asked when Spock helped her discard of the dishes after the meal.<br><br> “I am uncertain,” Spock admitted. Did their conversation qualify as an argument? It had certainly ended in discordance.<br><br> “Do you want to talk about it?” Amanda offered.<br><br> Spock did not think he could tell his mother about his troubles, although she was a logical choice. As a Human bonded to a Vulcan, she would be most likely to understand Jim and give advice to Spock.<br><br> “I do not,” he told her nevertheless.<br><br> She accepted his decision, although she made a point of petting his cheek. The warmth and affection she projected helped calm Spock. For once, his mother’s open emotional ways were a complete comfort to Spock.<br><br> “You will figure it out,” she said. “Jim doesn’t seem the kind to hold childish grudges. He’s a good man.”<br><br> “A rather exceptional Human,” Spock agreed and hastily turned away at the knowing look in Amanda’s eyes.<br><br> He settled down in his room to meditate, but was soon interrupted by a knock on the door.<br><br> “Enter,” Spock said, seeing no point in denying entrance when he had already been disrupted in his meditation. He hastily got to his feet when he saw that it was Jim who entered his room.<br><br> Jim still looked tense, but he was sending Spock a small smile before he looked around.<br><br> “You may sit on my bed,” Spock offered, as no other furniture in his room was adequate for sitting. He did not usually entertain visitors the few times he returned to his home planet.<br><br> Jim nodded and sank down at the very edge of Spock’s cot. When he did not say anything, Spock laced his fingers behind his back to keep himself from reaching out to Jim once more. Jim had hardly taken a few hours to think. Spock could not believe he had come to give his consent and offer his mind to Spock.<br><br> \"Was there something you came to say?\" he eventually asked.<br><br> \"Yes, sorry,\" Jim replied. He took a deep breath, then let it out without saying anything. He sent another small smile towards Spock. Spock did not know how to decipher these clues, so he kept quiet.<br><br> \"Okay,\" Jim finally said. \"I'm sorry for how I reacted earlier.\"<br><br> \"You did not say or do anything that would require an apology,\" Spock replied honestly. Jim had not done anything to merit regret.<br><br> \"Sure I did. I was culturally insensitive and trying to press you into Human norms that don't apply to you and your society.\" He shook his head, still smiling. \"God, my xenology professors would be proud of me.\"<br><br> \"Your grades mark you as an exceptional student,\" Spock said, unsure how to take that statement. \"I am sure all of your teachers acknowledge that.\"<br><br> \"I like when you do that, you know?\" Jim said.<br><br> \"What exactly are you referring to?\"<br><br> \"Just … nevermind. Look, what I meant to say is: I'm sorry I got angry at you because you were being a perfectly normal Vulcan and I freaked out at you over it. If this is the way Vulcan bonds work, I shouldn't judge.\"<br><br> \"I see,\" Spock said carefully.<br><br> \"You really don't, but it's fine. So, let's just have this conversation again without me being an ignorant asshole, and maybe we can figure this relationship thing out.\"<br><br> Spock tried his best not to read too much into that statement. \"You wish to talk about the potential for a bond between us?\"<br><br> \"Yes,\" Jim said and patted the spot next to him on the bed.<br><br> Spock very carefully unlaced his hands, stepped up to the cot and sat down beside Jim.<br><br> \"So, you want to bond with me.\"<br><br> \"Yes,\" Spock said, feeling slightly light-headed for no logical reason.<br><br> \"And such a bond would be permanent, as in for life.\"<br><br> \"Yes.\"<br><br> \"And you're one hundred percent convinced that I'm the right choice for that?\"<br><br> \"As I said, our minds are highly compatible.\"<br><br> \"Yes,\" Jim said, but instead of narrowing his eyes, this time he kept smiling, nodding along. \"You explained that. But you know, for us Humans, that's kind of not how you decide to have a life-long relationship with somebody.\"<br><br> \"You do not find mental compatibility a legitimate reason for a romantic relationship,\" Spock translated.<br><br> Jim nodded. \"Exactly. I'm sure you know this already, but with Humans, it's a variety of factors. Physical attractiveness, for a start, but we already covered that you find me attractive.\"<br><br> \"You are indeed aesthetically pleasing,\" Spock acknowledged. Although he did not understand why, his responses did not seem to anger Jim this time, even though they were similiar to the ones he had given before.<br><br> \"But what else do you like about me?\" Jim asked.<br><br> \"What else?\" Spock repeated.<br><br> \"Yes. There must be character traits you find especially, um, pleasing? Don't tell me you only like me for my looks.\"<br><br> Ah. Spock had a sense that he knew what Jim was looking for.<br><br> \"You are intelligent and resourceful,\" Spock listed. \"I find that I find merit in both our chess matches and conversations. I believe both of these experiences would only be enhanced by a bond. I also am convinced of the goodness of your character. You have proven yourself selfless, brave and gracious.\"<br><br> Jim's smile widened so much that his teeth were showing and his cheeks turned slightly redder than usual.<br><br> \"Oh,\" he said. \"Thank you. I also like playing chess with you, and our talks. You're the smartest person I know, I think. And very kind. You’ve been really patient with me all this time.\"<br><br> Spock inclined his head, unsure what else to say. Jim, however, seemed to have this conversation firmly in hand.<br><br> \"Good. So, we both like each other, we both find each other attractive. And our minds fit well, too, yes?\"<br><br> \"Yes,\" Spock repeated again, because apparently, Jim needed to be reassured again of that fact.<br><br> \"But you don't want to take things slow,\" Jim said.<br><br> \"I do not believe I understand.\"<br><br> \"Well, Humans don't usually decide to get married for life just like that. We're in a less serious relationship first to make sure if it's a match.\"<br><br> \"But I already know we are a match,\" Spock said. \"Our minds--\"<br><br> \"Are highly compatible. Yes.\" Jim let out a small laugh, but then turned more serious. \"Can you show me?\"<br><br> \"Show you?\"<br><br> \"That we're compatible.\"<br><br> \"You speak of another meld,\" Spock said. He found that he was overwhelmed at the rapid pace of this conversation. Jim seemed no longer angry, but instead interested.<br><br> As if to prove Spock right, Jim reached out for Spock's hand, just like Spock had done earlier in the garden. \"When we melded, it felt really good,\" he said. \"And I'm feeling so much better since. You've been taking care of me for weeks, but the meld -- I felt really safe, you know? It was a good experience. Really good.\"<br><br> \"I am gratified,\" Spock said.<br><br> \"So, will you show me?\"<br><br> \"I can initiate a meld,\" Spock acknowledged. \"However, I must warn you that it is not unlikely that a more permanent connection will be formed between us.\"<br><br> \"A bond?\"<br><br> Spock shook his head. \"No. It would not be a firm bond. For a bond to fully mature, other factors must come into play.\" He would not tell Jim about <em>pon farr</em> until it became absolutely necessary. \"But it would be the first step.\"<br><br> \"So, what would such a connection be like?\"<br><br> Spock considered how to best explain the concept to a generally psi-null species like Jim's. \"We would be close. We would sense each other's distress, but also content. We would be drawn to one another, essentially.\"<br><br> \"And you're sure this connection will happen if you meld with me?\"<br><br> \"Quite certain,\" Spock said. \"I do not believe I could control it were we to link our minds again.\"<br><br> Jim nodded. He was still holding Spock's hand, lightly squeezing Spock's fingers as he considered. Spock could feel nervousness mingled with affection, felt it mirrored in his own state of mind. He would definitely have to meditate deeply when this conversation was over.<br><br> \"Fine,\" he finally said. \"Let's do it.\"<br><br> \"You wish to meld?\" Spock asked. \"You are sure of this?\"<br><br> \"I'm sure,\" Jim said with emphasis. \"I trust you. You’ve been taking care of me for weeks, you’ve seen me at my worst, and you still think this is a good idea. And if you say we're a good match -- well. I wouldn't want to miss out on an opportunity like this.\"<br><br> Spock was reminded of Selek's words. <em>Do not waste your opportunity like I have.</em> He took in Kirk’s determined face, the serious eyes. Nodding, Spock raised his hand.<br><br> \"My mind to your mind,\" he murmured as he slowly raised his hand and placed it gently against Jim’s face, easily finding the psi points. \"My thoughts to your thoughts.\"<br><br> It was like they had never been parted.</p>\n<p>“I’m damn well melting, is all I’m saying,” Leonard grouched for the fifth time, although his usual snarl did not keep him from thanking Amanda politely when she handed him a glass of chilled water. His parents had ingrained manners into him, after all.<br>\n<br>\nJim laughed silently at him as he accepted his own drink from Spock. “You actually get used to it,” he assured him. “Eventually.”<br>\n<br>\nLeonard scowled at him. “You’ve been here for over three months. For all I know, you’ve slowly been turned into a Vulcan.” He threw a significant glance at Jim’s ear.<br>\n<br>\nHe could not shake off the doctor’s view, so he assessed the remaining scar tissue around the cartilage. Clearly, too much time had passed between the ear being cut off and the new one being attached for the skin to be fully regenerated.<br>\n<br>\n“I’m sure Spock will assure you that I am as illogical and Human as ever,” Jim said and smiled at the Commander in question.<br>\n<br>\nTo say he had been surprised when Jim had informed him of his relationship with the Vulcan had been an understatement. There had been a loud and angry conversation about Jim’s mental state and inability to make serious decisions like this while he was still suffering from trauma -- a conversation really not suited to the restraints of shaky subspace vid calls.<br>\n<br>\nHe had come to terms with it, however, over the course of time. Jim had sounded disgustingly happy whenever he had talked about Spock afterwards, and the one time Spock had agreed to join Jim for another call, they had been so obviously affectionate with each other Leonard had ceased having a hard time wrapping his mind around the concept of a Vulcan in love.<br>\n<br>\nAnd now that he was here on Vulcan to pick Jim and Spock up and chaperone them on the flight back to San Francisco, he could see Jim was doing well. He had regained most of the weight and muscle lost during his time on Nero’s ship, his mental imbalance seemed to have settled down during the past weeks and the sheer brightness of the smile reserved for Spock alone was blinding.<br>\n<br>\nLeonard could not recall Jocelyn ever looking at him this way. But then, they hadn’t had a Vulcan voodoo bond to reassure each other of their mutual affection. They had had to figure it out the old-fashioned way -- and failed.<br>\n<br>\n“I think you’ve been doing really well, Jim,” Amanda said as she sat down next to Leonard. From what Leonard had gathered so far, she was not only an exceptionally smart but also caring woman who had adopted Jim as her own kin in no time. If somebody needed a steady, loving family, it was Jim Kirk. Leonard had been his sole confidant for far too long. “Sarek has been praising your Golic non-stop, I’ll have you know.”<br>\n<br>\n“The ambassador is very kind,” Jim said, waving off the compliment like it was nothing. Leonard knew Jim came across as arrogant and self-assured, and while that was certainly true on many occasions, it was but a reaction to a much deeper insecurity. Leonard doubted there were many people as brilliant and convinced of their own worthlessness as Jim.<br>\n<br>\n“He is also correct,” Spock said. He sounded as calm and cold as ever, but Leonard was not fooled. He knew first hand from their joint rescue mission that Vulcans could be emotional, and even without that experience, it was clear in the way Spock’s hand had curled around Jim’s as soon as he had settled down next to him.<br>\n<br>\nWhen Amanda caught Leonard staring, she only threw him a knowing smile. Clearly, he was not the only one drawn in by the obvious affection between them.<br>\n<br>\n“I can’t believe you’re leaving already,” Amanda sighed.<br>\n<br>\n“It has been over three months since Jim’s arrival, mother,” Spock reminded her.<br>\n<br>\n“Still,” Amanda insisted. “It’s not enough. You’ll have to visit as often as possible.”<br>\n<br>\n“Oh, they’ll be quite busy, from what I hear,” Leonard said, taking an innocent sip of water as Jim stared at him.<br>\n<br>\n“What have you heard?” he asked eagerly.<br>\n<br>\n“Oh, you know,” Leonard said. “Rumor mill’s been working since they called you and Commander Spock back officially, is all I’m saying.”<br>\n<br>\n“You cannot keep me hanging like this, Bones. Seriously, spill!”<br>\n<br>\nLeonard smirked. “I wouldn’t want to get your hopes up, kid.”<br>\n<br>\nJim seemed stuck somewhere between laughing and wanting to beat Leonard to a pulp. Clearly, Spock was also picking up on it, as he said: “Please elaborate nonetheless, doctor. I have found that rumors do sometimes reflect the truth, if only partly.”<br>\n<br>\nJim threw Spock a look that was so full of gratitude and warmth that Leonard had to avert his eyes after all. It seemed intrusive to see them like this. He focused on his drink when he said: “Well, the <em>Enterprise</em> is one month off of being ready to launch again. They’ve been sending out assignments, you see, and they seem to have come to the conclusion that the crew that handled Vulcan’s distress call was a good match. They also seem to believe that her future captain should be from among that original crew.”<br>\n<br>\n“Oh my god,” Jim exclaimed. “Oh my god.”<br>\n<br>\n“Like I said, it’s all just a rumor. But Nurse Chapel has already received her letter, as have Chekov and Sulu, and they’ve all retained their positions.”<br>\n<br>\n“Spock,” Jim said excitedly. “Spock, are you hearing this?”<br>\n<br>\n“I have not actually lost my hearing capabilities. Though it might be likely if you continue to speak in this volume,” he replied, but the look he threw Jim was so clearly fond that it negated the chilling tone of his reprimand.<br>\n<br>\n“Sorry, but the <em>Enterprise</em>, Spock. Can you believe it?”<br>\n<br>\n“As I remember, we already had this very conversation one month and nineteen days ago. I can very well believe it.”<br>\n<br>\nJim was clearly on edge for the rest of the day, breaking into random bouts of grinning for no reason that would have any Vulcan unused to Jim’s demeanor bristle.<br>\n<br>\nLeonard accompanied Jim and Spock to Shi’Khar hospital where Jim would get his last check-up before leaving Vulcan. After Jim received his stamp of approval, Leonard took his chance to talk to T’Lkai, Jim’s primary physician and clearly a very capable healer from what he had gathered from Jim’s health reports.<br>\n<br>\nHe spent over an hour discussing with her the best way to treat and improve on Jim’s hearing implant and finally received a request to keep her updated on “the honorable James Kirk’s state of health”. Clearly, Jim had managed to make more than one Vulcan care about him.<br>\n<br>\nWhen Leonard returned to the consulting room they had left to look over Jim’s charts in detail, it was to Jim sitting on the examination table with his hand curled gently around Spock’s face as he talked to him quietly. Spock’s hands were tracing Jim’s ears in return, one perfectly round, one sharply pointed.<br>\n<br>\nFor a few moments, Leonard indulged in the sight of seeing Jim fully at ease. It was not a sight that he had enjoyed often since they had become friends. Finally, Leonard cleared his throat and Spock hurriedly took a step away from Jim, lacing his hands behind his back like a good little Vulcan. He almost looked guilty in displaying affection for Jim in public, what with his eyes not quite meeting Leonard’s gaze.<br>\n<br>\n“You ready to leave?” Leonard asked.<br>\n<br>\nJim presented him a wide, happy smile. For a moment, all shadows of remaining trauma seemed to be gone and all that Leonard could see was a healthy, content Jim Kirk.<br>\n<br>\n“Yeah,” he said. “We’re ready.”</p>"
}