{
  "id": "10263101",
  "url": "https://archiveofourown.org/works/10263101?view_full_work=true",
  "author": [
    "ShanaStoryteller"
  ],
  "title": "crust and sugar over",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Yuri!!! on Ice (Anime)"
  ],
  "relationships": [
    "Katsuki Yuuri & Yuri Plisetsky",
    "Katsuki Yuuri/Victor Nikiforov"
  ],
  "characters": [
    "Katsuki Yuuri",
    "Yuri Plisetsky",
    "Victor Nikiforov",
    "Christophe Giacometti",
    "Phichit Chulanont",
    "Mila Babicheva",
    "Yakov Feltsman",
    "Celestino Cialdini",
    "Georgi Popovich"
  ],
  "additional_tags": [
    "yuuri and chris are BROS",
    "also this fic is very heavy in yuri and yuuri broship so if that's not your thing be warned",
    "Fake/Pretend Relationship",
    "eventually",
    "hurt only for the sake of comfort",
    "this fic isn't out to hurt you",
    "Idiots in Love"
  ],
  "language": "English",
  "series": "",
  "published": "2017-03-13",
  "completed": "2017-11-30",
  "words": "36,012",
  "chapters": "4/4",
  "comments": "1,448",
  "kudos": "23,699",
  "bookmarks": "8,514",
  "hits": "327,014",
  "summary": "<p>Katsuki sits cross-legged, clearly in no hurry to go anywhere. “What’s your name? I’m –”</p>\n<p>“I know who you are,” he cuts him off, then blushes, then hates himself for both those things. Katsuki looks surprised, and Yuri can’t think as to why. He’s a nationally ranked figure skater. He’s Yuri’s favorite figure skater.</p>\n<p>~</p>\n<p>Yuuri and Yuri become friends and Viktor develops a crush.</p>",
  "notes": "<p>Do not add this work to Goodreads or any similar sites.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>the title is from langson hughes's \"dream deferred\"</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">more notes</a>.)\n</p>\n<p>i hope you liked it!</p>\n<p>ps i DO like celestino i just don't think he's the best coach for yuuri. also the fake/pretend relationship part of this fic happens next, and i'm VERY EXCITED</p>\n<p>also poor chris. he didn't ask for this. </p>\n<p>feel free to follow / harass me at: shanastoryteller.tumblr.com</p>\n<p>hi everyone i have once again underestimated my word count, so i've changed the chapter count from 2 to 4. sorry! :-/</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>i hope you liked it!</p>\n<p>feel free to follow / harass me at: shanastoryteller.tumblr.com</p>\n<p>i post writing updates in my 'progress report' tag if that's something you're interested in knowing :)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>i hope you liked it! feel fee to follow / harass me at: shanastoryteller.tumblr.com</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>thanks so much to everyone for all your support and kind reviews! this couldn't have gotten written without you &lt;3</p>\n<p>ps in the future there is 100% a scene after they get married where yuuri is talking to his mom and she goes \"pass the phone to my other son\" and he hands it to viktor, but then she says to viktor, \"no, my other other son!\" and viktor passes the phone to yura, who's incredibly pleased he's the the other son</p>\n<p>feel free to follow / harass me at: shanastoryteller.tumblr.com</p>\n<p>Do not add this work to Goodreads or any similar sites.</p>",
  "text": "<p>Yakov had said not to practice, that he was just here to observe since he would soon <em>finally</em> be able to move up to the junior competitions. But the last thing Yuri wants to do is sit around all day watching <em>other</em> people skate, and if that mean sneaking out his hotel room and into the rink before dawn, so be it.</p>\n<p>This thought is viciously interrupted when he walks straight into someone bigger than he is and crashes to the floor.</p>\n<p>“Oh, wow, sorry, I didn’t see you!” a panicked voice says, and Yuri has to blink a few times just to make sure he hadn’t fallen harder than he thought and the person in front of him is actually who he thinks he is. “Are you okay?”</p>\n<p>Yuri keeps staring, mouth parted in surprise but no words coming out. He’d known the man was here, of course, and he’d been looking forward to seeing him, but not – not like this. Here, alone, after knocking into him.</p>\n<p>“You didn’t hit your head did you?” he kneels in front of him, reaching out to gently feel for any bumps, eye wide and concerned.</p>\n<p>“No,” Yuri croaks out finally, “I’m fine.”</p>\n<p>“Are you sure?” Yuuri Katsuki asks, and in the poster Yuri has hanging above his bed the man’s eyes look black, but this close he can see that they’re actually a soft shade of brown. Yuri nods, not trusting his voice, and he’s screaming inside to <em>pull it together</em>, but he’s still just sitting on the ground. Katsuki smiles, “Good. Sorry, that was my fault, I wasn’t paying attention. I thought I was the only one crazy enough to be practicing this early.”</p>\n<p>“It’s okay,” and oh god if Yakov or Viktor could see him now they would make fun of him forever, or even worse Mila. “I’m not supposed to be practicing, I’m not competing. My coach just brought me to observe.”</p>\n<p>“But you get antsy if you don’t skate,” Katsuki says knowingly and for some reason he seems content to continue hanging out with him on the floor. “I’m the same way. Sometimes when I get nervous and can’t skate, I dance. In the middle of the living room at two in the morning,” he flashes a smile that makes Yuri want to die, “He’s really nice about it, but it drives my roommate crazy.”</p>\n<p>“Oh,” Yuri says, and Katsuki skates to calm himself too, to focus. Mila always called him weird and Yakov lectured him, but sometimes it wasn’t about practicing, it was just needing to move.</p>\n<p>Katsuki goes crosslegged, clearly in no hurry to go anywhere. “What’s your name? I’m –”</p>\n<p>“I know who you are,” he cuts him off, then blushes, then hates himself for both those things. Katsuki looks surprised, and Yuri can’t think as to <em>why</em>. He’s a nationally ranked figure skater. He’s Yuri’s <em>favorite</em> figure skater. His salchows are mediocre and his other jumps are even worse, although his spins are actually really good. But Yuri isn’t impressed by technical finesse, he’s forced to share ice with Victor Nikiforov after all. He’s impressed by Katsuki's step sequences, the way that when he’s skating it looks like the music is playing to his movements and not the other way around. It’s mesmerizing and breath taking and Yuri can never bring himself to look away, even when Katsuki makes a mistake.</p>\n<p>On the other hand, he’d rather stab himself in the eye than see Viktor perform another quadruple flip. Viktor’s good on presentation, obviously, but he’s not on Katsuki’s level. No matter what anyone else seems to think.</p>\n<p>“I’m Yuri Plisetsky,” he says, trying to fill the silence with something less embarrassing.</p>\n<p>Katsuki’s smile breaks out across his face, “Hello Yuri. If you’re sure you’re okay, do you want to get on the ice? We won’t have much time until it starts filling up.”</p>\n<p>Yuri nods, and Katsuki’s so <em>nice</em>, none of the articles had ever said he was nice.</p>\n<p>He’s also clearly keeping an eye on Yuri as he skates, making sure he really is okay, and Yuri would normally be pissed off by something like that but he has his favorite skater’s eyes on him. They’re skating on the same ice, and instead he does what he can to <em>keep</em> Katsuki’s eyes on him, performing jumps and spins. At some point Katsuki starts clapping, and for a humiliating moment Yuri thinks he’s making fun of him. But when he looks up the older skater is beaming, “Great!” he says, and there’s nothing but open delight in his face, “You’re really good!”</p>\n<p>New skaters aren’t usually happy with him when they see him skate. Especially the older ones. They get quiet, and maybe they’re not quite mean, but they’re also clearly not pleased about his talent. “Thanks,” he says, shy in way he hasn’t been since he was a little kid, and blurts, “Can you help me with my spins? You’re really good at them.”</p>\n<p>There’s that surprise again, as if Katsuki doesn’t know that about himself. But it fades and he says, “Of course, come here and show me what you did again.”</p>\n<p>It’s <em>amazing</em>, and Katsuki’s actually a good teacher, voice low and patient and oddly reminding him of Yakov. When other skaters start trickling onto they leave the ice, discussing Yuri’s spins and what he should work on and what he has down solid.</p>\n<p>This is another thing he’s not used to and hadn’t expected – Katsuki isn’t talking to him like he’s a kid, not really. He’s speaking to him like a skater, like he’s smart and knows what he’s doing and doesn’t talk down or make fun of him once.</p>\n<p>They say that meeting your heroes is always a disappointment, but Yuri thinks this is about perfect as it can get.</p>\n<p>He’s proven wrong a moment later when they leave the rink and reach the expected part where they’ll go their separate ways, but instead Katsuki hesitates and asks, “Do you know any place around here to get breakfast? I’ll pay, I did knock you down after all.” Yuri’s stomach rumbles, answering for him, but Katsuki just grins and says, “Me too.”</p>\n<p align=\"center\">~</p>\n<p>Yakov stares down at his phone in disbelief, shakes it like that will make it make more sense before giving up and handing it to Viktor, “Vitya, what does this say?”</p>\n<p>Viktor pauses in lacing up his skates and takes the phone. He clears his throat before reciting, “Have not been kidnapped. Getting breakfast with a skater.” He shrugs and hands the phone back, “Yura made a friend. So what.”</p>\n<p>“Ignoring the part where Yura <em>blatantly ignored </em>my orders not to practice,” Viktor rolls his eyes because Yakov should have known that that was going to happen from the beginning, “Making friends doesn’t sound like a very – him thing to do.”</p>\n<p>“He’s thirteen now,” Viktor says, “maybe he’s maturing.”</p>\n<p>Yakov snatches his phone out of Viktor’s hands, “Why would that mean anything? You’re just as much of a brat now as when I started training you,” and stalks off.</p>\n<p>Viktor calls out, “Don’t be like that! Come back! Yakov! My short program is today! YAKOV!”</p>\n<p align=\"center\">~</p>\n<p>“Where have you been?” Celestino demands, “You said you’d be back over an hour ago!”</p>\n<p>Yuuri checks the time on his phone, and also sees the three missed calls, “Sorry! I didn’t realize how late it had gotten. I went and got breakfast after I was done.”</p>\n<p>Celestino manages to maintain the angry façade for another moment, but drops it under Yuri’s sheepish wince. “Well, you do practice insanely early anyway, so I suppose we haven’t lost much time. Go get changed.”</p>\n<p align=\"center\">~</p>\n<p>Yuri shows up to the rink about fifteen minutes later than he had the day before, and Katsuki is already skating, headphones in so he’s not likely to notice him.</p>\n<p>Yuri quietly goes to the edge of the rink, leaning on the side as he watches Katsuki skate. He’ll get on the ice himself in a moment, but for now he’s content to watch. The familiar beginnings of a routine starts, and he focuses on Katsuki even more intensely. The senior skater had messed up his short program in a half dozen ways the day before, but had still gotten impressive scores anyway thanks to his step sequence.</p>\n<p>But Yuri recognizes this routine, it’s the same routine he did yesterday, only – different.</p>\n<p>Here, where he thinks he’s alone, where there are no judges and no crowds, he performs it almost flawlessly. His spins seem faster, he lands all his jumps – but they’re not even the <em>same</em> jumps, he adds rotations and amounts, and ends it with a triple flip. <em>Ends </em>the program with it! Katsuki is known for his stamina, but that’s insane! None of the jumps were perfect, and he’d had to touch down on the last one, but it was still scarily impressive.</p>\n<p>It’s clearly exhausted him, chest heaving, but when Katsuki looks up and sees him he freezes. Yuri bursts into applause, and doesn’t stop even as Katsuki’s whole face goes red and he glides over to him, taking out his headphones. “I didn’t see you,” he mumbles.</p>\n<p>“That was incredible!” Yuri beams, “That was – the best thing I’ve ever seen! If you’d skated like that yesterday, you would have beaten all of them!”</p>\n<p>Katsuki grimaces.</p>\n<p>Yuri instantly feels the uncomfortable heat of shame bubble up in him and stuffs his hands into his jacket pocket. “I mean – not that yesterday was bad! I mean, just,” he looks down, and this would be the part where he gets angry and storms away, but he doesn’t <em>want</em> to be angry at Katsuki. So he swallows and looks back up, “Sorry. I – sorry.”</p>\n<p>Katsuki gives a half smile, and it looks like it hurts. But he doesn’t seem mad either. “It’s okay, I wish I’d skated like that yesterday too.”</p>\n<p>“Oh,” he says, and the air between them is almost easy and he should leave it, but he says, “I’ve never seen you skate like that before. I’ve seen all your competition footage, but I’ve never seen anything like what you just did.”</p>\n<p>“All of it?” he asks, and there’s that surprise again, so honest and painful to witness that Yuri can’t even bring himself to be embarrassed.</p>\n<p>“All of it,” he confirms.</p>\n<p>Katsuki half smiles again, but this time it doesn’t look like it hurts him. “I don’t – do well, with crowds and, you know, pressure. I wish I did. But even with my coach, I don’t – I don’t know. I only skate my best when I’m alone. Which doesn’t do me a lot of good.”</p>\n<p>“Oh,” Yuri says, softly, because he’s not stupid, he’s heard of more than one athlete that couldn’t handle the pressure. But it’s not fair, because Katsuki is handling it, mostly, is talented and strong, and before this he was just Yuri’s favorite skater, but now he thinks he might be the <em>best</em> skater. But he doesn’t know how to articulate any of that without seeming like a crazy person, so he asks, “Your triples are pretty good, but do you want to work on your quads? My coach won’t let me perform it in competitions, but I’m pretty good at the quad salchow.”</p>\n<p>As soon as it’s out of his mouth he regrets it. Katsuki’s a senior skater, and an adult, and as he clearly just demonstrated he doesn’t need help from some <em>kid</em>, quads or no quads. Yuri’s thinking maybe he can just run away and pretend none of this ever happened and that he has any dignity left.</p>\n<p>Katsuki doesn’t laugh at him. Instead he blinks and says, “Wow, you can do the quad salchow already? That’s amazing! I’d love your help.”</p>\n<p>Yuri’s mouth drops open, heart in his throat, because – because no one takes him seriously, not Mila or Georgi or Viktor, not even Yakov. He’s good, but he’s a kid, and he has a long way to go. As they all keep reminding him. “Cool,” he chokes out, and says, hopeful, “Then – then we can work on my spins again? If that’s okay?”</p>\n<p>“Sounds perfect to me,” Katsuki says firmly, “a nice even trade.”</p>\n<p>Yuri retreats to pull on his skates before he can make a total fool of himself, but he’s beaming the whole time.</p>\n<p align=\"center\">~</p>\n<p>Yuuri meets the Russian junior skater every morning for the rest of the week, and it should be weird but instead it’s easy and – fun, even. It grounds him, enough that it effects his skating and he lands a couple of jumps that he’d been expecting to mess up. Even Celestino looks impressed. It also means he manages to scrape his way onto the podium.</p>\n<p>Viktor gets first, of course, and Chris winks down at him from his place on second, “Drinks tonight?”</p>\n<p>“Absolutely not,” he glares. Chris just shrugs, but he’s still smirking.</p>\n<p>He’s tells himself that <em>for once</em> he’s going to tell the annoying older skater no, and not make a fool of himself in front of one of his only friends in the skating world, but he knows that’s a lie even as he thinks it. Besides, he’s pretty sure half the reason Chris hangs out with him is for the embarrassing antics he always seems to talk Yuuri into after a few too many drinks.</p>\n<p>Chris shows up at his room, as usual, an hour after they’d managed to pry themselves away from the reporters. Yuuri’s in jeans and a white button up, clothes he’s not attached to just in case he ends up losing them. “Viktor’s going to join us,” Chris says once Yuuri has closed the door behind him.</p>\n<p>Yuuri stares, betrayed. “Absolutely not.”</p>\n<p>“It would be unsportsmanlike for us not to invite him!” Chris insists, pouting as he pushes his glasses up the bridge of his nose.  “Besides, we were all on the same podium, there’s no reason for you to be nervous.”</p>\n<p>He crosses his arms, “Oh, and how are we going to go out for an anonymous night of debauchery with Viktor Nikiforov with us?”</p>\n<p>Chris silently holds up the chunkiest, ugliest pair of glasses he’s ever seen.</p>\n<p>“Oh my god, this is the worst idea you’ve ever had,” he says faintly.</p>\n<p>Chris claps him on the shoulder and steers him to the elevator, “Come on, we don’t want to leave Viktor waiting!”</p>\n<p align=\"center\">~</p>\n<p>He’s been friends with Yuuri longer than Viktor, ever since they were junior competitors together, and so he’s not surprised in the slightest when at the first club they go to Yuuri bolts to the bar.</p>\n<p>“Are you sure it’s okay that I came?” Viktor asks, eyes concerned under the hideous glasses he’d forced his friend to wear. “I know you said this was something you two do together. I can leave.”</p>\n<p>“We only do it alone because Yuuri’s anti-social and Sara and Phichit are too young, not that that stops them all the time. He’s just shy, don’t worry.” He looks over and Yuuri is taking shots. At this rate he won’t be shy for long.</p>\n<p>“If you’re sure,” Viktor says, frowning.</p>\n<p align=\"center\">~</p>\n<p>Two hours and an ungodly amount of alcohol later, Chris and Yuuri are grinding on the dance floor while Viktor watches open mouthed.</p>\n<p>The quiet, reserved Japanese skater had been steadily drinking and mostly ignoring him for the whole night. Then about ten minutes ago Chris had said, “I think it’s time.”</p>\n<p>Yuuri had drained the last his drink, slammed his glass onto the table so hard it shook, and said, “You bet your ass it’s time,” and dragged him onto the dance floor.</p>\n<p>Chris beckons him over, but he’s not sure where exactly in the writhing bodies he’s supposed to fit. Yuuri catches his eye and smiles at him for the first time tonight, cheeks flushed, and <em>oh</em>, okay then, Viktor can feel an answering blush on his own cheeks even though he’s only had a couple of drinks.</p>\n<p>Yuuri pulls himself from Chris and holds out a hand, and Viktor lets himself be pulled closer, blushes even more when Yuuri throws his arms around his neck and says, “Viktor, Viktor, you – you need to dance with me.”</p>\n<p>He looks around for help, but Chris seems to have melted into the crowd, so he says, “Okay,” and Yuuri grabs his hands and puts them on his hips, and Viktor is going to die. They keep dancing, and he catches glimpses of Chris but he’s giving them a wide berth. He’d make a note to yell at the other skater for setting him up later, except that Yuuri is gorgeous and the way he’d skated earlier was great, and Viktor doesn’t usually notice people like this. People get all flustered over him, but he doesn’t tend to feel this way, he’s not a casual person.</p>\n<p>“Let’s get a drink,” Yuuri says, eyes half lidded, “It’s hot in here.”</p>\n<p>They’re both sweat soaked, and it’s making the thin material of Yuuri’s shirt cling to him in interesting ways, so Viktor swallows and nods. Yuuri grabs his hands and drags him to the bar. There’s only one empty seat, and Viktor’s about to offer it to him when he shoves Viktor into it, giving an absent minded, “Here, you’re too tall,” and he isn’t sure if he should be offended or not but he laughs anyway.</p>\n<p>Yuuri leans over to make eye contact with the bartender, which gives Viktor a lovely view of his ass in those tight, tight jeans. He’ll never make fun of the skinny jean trend ever again. “Yuuri,” he says. He turns to face him, and they’re almost nose to nose and whatever Viktor was going to say flies right out his head.</p>\n<p>“Your eyes are blue,” Yuuri says, moving closer and bracing his arm around Viktor on the bar, caging him in, “Like – like – I’m from a beach town, and they’re like that perfect blue when the sun’s reflecting off it on a clear day, you know?”</p>\n<p>Oh <em>god</em>, a gorgeous man is waxing poetic about his eye color and pinning him to surfaces. He’s never going to recover from this. “Yeah?”</p>\n<p>“Yeah,” Yuuri nods, intently serious, and he boosts himself up and suddenly Viktor has a lapful of Yuuri Katsuki.</p>\n<p>He forgets to breath as Yuuri knocks off those ridiculous glasses Chris had forced on him and he tilts his head up just enough to meet Yuuri halfway. He tastes like rum and sugar-sweetness from all those drinks, and he <em>can’t</em> ask him back to his room, not like this, but when Yuuri kisses him he doesn’t resist, opens his mouth up for him and digs his fingers into Yuuri’s hips to keep him from sliding out of his lap.</p>\n<p align=\"center\">~</p>\n<p>Yuuri wakes up to the harsh ringing of his alarm and wants to die.</p>\n<p>“Turn that off!” Chris groans. His friend is spooning him from behind, arm around his waist as he presses his face into his back.</p>\n<p>Yuuri dismisses the alarm and buried his head into his pillow. “I have to get up. I’m meeting someone at the rink.”</p>\n<p>“Oh my god, <em>why</em>,” Chris moans, “It’s too early.”</p>\n<p>“You can stay,” he says, untangling himself from Chris’s grip and shedding the clothes from last night that he’d fallen asleep in. At least he hadn’t <em>lost </em>them, so that was an improvement. “Did we get into a dance off last night?”</p>\n<p>“Not this time,” he groans, shoving a pillow over his head as Yuuri flings open the curtains.</p>\n<p>He considers showering, but he’s only going to get gross on the rink anyway, so he forgoes that and starts pulling on his practice clothes. “Anything interesting or more embarrassing than usual happen?” He pokes at the finger shaped bruises on his hips, “Did you do this?”</p>\n<p>“No. You made out with Viktor Nikiforov and we got kicked out of a club for public indecency. Twice.” He pauses, “Only the second time was my fault.”</p>\n<p>Yuuri rolls his eyes, “Yeah, okay. I’ll take that as a no then. Text me what time your flight is, if it’s late we’ll get lunch.”</p>\n<p>Chris waves a hand in agreement and Yuuri grabs his skates before bolting out of the room and running to the rink.</p>\n<p>“Sorry I’m late!” he says, and Yuri pauses mid-routine to smile at him. “What did you want to work on today?”</p>\n<p>They skate together like they have these past few days, and it’s just a fun and easy between them as always. As the hour ticks by, Yuri gets quieter and quieter, and his lips barely twitch upwards when they step off the ice and head to breakfast.</p>\n<p>He can see that Yuri’s upset, but trying to hide it, and this is <em>stupid</em>. They’re helping each other out, and they get along, and it’s perfectly normal for him to go, “Hey, give me your phone,” in the middle of their shared plate of waffles.  </p>\n<p>Yuri raises an eyebrow but hands it over. Yuuri goes to the contact page and adds himself in there, including his skype and instagram even though he barely uses the thing. He’d noticed Yuri was particularly fond of the app, and between him and Phichit he might actually get dragged into using it more than twice a year. “I could still use your advice on jumps, if you have the time,” he says, handing the phone back.</p>\n<p>Yuri takes it with a blank face, and Yuuri’s worried he’s done something wrong until the younger skater launches himself across the table and grabs him in what an octopus might define as hug. “Yes! Absolutely!”</p>\n<p>He’s not a touchy person, but he laughs and hugs him back as his worries drain away. “Good.”</p>\n<p align=\"center\">~</p>\n<p>The light of midday is streaming into his hotel room, but Viktor is still in bed, arm flung over his eyes and a grin he can’t force down over his face.</p>\n<p>His phone beeps, and if it’s Yakov he’s ignoring it. But it’s a text from Chris saying: <em>here’s a commemorative photo.</em></p>\n<p>He flicks the message open, and it’s from later in the night. He’s back in those clunky glasses, Yuuri’s arms are around his neck, and they’re smiling at each other.</p>\n<p>“Oh my god,” he says quietly, hugs his phone to his chest not unlike a teenage girl, and wonders if making the photo his wallpaper would be too much.</p>\n<p align=\"center\">~</p>\n<p>“So,” Phichit says as soon as he gets back, literally as soon as he walks through the door of their apartment. “Congratulations on getting bronze. What’s going on with you and Plisetsky?”</p>\n<p>“Hello to you too,” he says, stripping off his coat and dropping his bag to the ground. He’d unpack and take care of it later. Long flights always left him exhausted. “How did you know I was with Yuri? Were you social media stalking me again?” he collapses onto the couch, swinging his legs onto Phichit’s lap.</p>\n<p>“How could I be?” he complains, “You never post anything!”</p>\n<p>“Phichit,” he says, mock stern.</p>\n<p>The teen sighs and says, “Plisetsky has a solid instagram. He posts his food when he goes out – and you were in some of them. Not all of you,” he amends when Yuuri raises an eyebrow, “just like your elbow or a bit of your torso or something. But since I’m your <em>best friend</em> and a brilliant detective, I figure these things out.”</p>\n<p>“You’d noticed he’d followed me on Instagram so your stalked his profile in terrifying detail?” Yuuri translates.</p>\n<p>Phichit pretends to be offended for all of two seconds before going, “Yeah, pretty much.”</p>\n<p>“He helped me with my jumps,” he says. “He’s nice.”</p>\n<p>“He’s thirteen!” Phichit protests, “Why was <em>he </em>helping <em>you</em>?”</p>\n<p>Yuuri rolls his eyes, “He’s good, what does his age matter?”</p>\n<p>“I guess,” Phichit says doubtfully, “Okay, whatever. Have fun with your adopted little brother.”</p>\n<p>Yuuri snorts and rolls off the couch onto his feet. “I’m going to go take a shower.”</p>\n<p>“Good!” Phichit calls after him, “You stink!”</p>\n<p align=\"center\">~</p>\n<p>Phichit had said it mostly as a joke, but as the months pass it seems to be more and more the truth. They text and skype, sending each other videos of their routines asking for advice and input. Yuuri talks to the kid more than he does his actual family, but – it seems to be doing both of them good.</p>\n<p>He’s heard the rumors about the kid, that he was talented but also arrogant and bratty and a pain to deal with. He can see hints of that sometimes, when they two of them are arguing about a step sequence or choreography, but for the most part – well, if Phichit didn’t have very reliable sources, he’d think Plisetsky was a sweet kid. Mostly. He complains about his teammates and coach with a viciousness that Phichit personally finds concerning, but Yuuri just shrugs off.</p>\n<p>“They treat him like a child,” Yuuri explains, “and he is, and you know, he needs normal teenage things like discipline and a schedule and boundaries. But treating him like a kid when it comes to skating is pointless. He’s better than half the senior skaters already, and talking down to him only pisses him off.”</p>\n<p>Phichit supposes that makes sense, and doesn’t bring it up again. Besides, he may be right – no matter how much they argue about skating, Plisetsky never directs the contempt he seems to have for everyone else at Yuuri, so his friend must be doing something right.</p>\n<p>Yuuri is better for it too, somehow. Steadier, like being a crutch for Plisetsky had forced him to find firmer footing himself. He tries asking Celestino his opinion on everything, but their coach only says, “I called Yakov and he’s just as confused. We’re just going to go with it for now.” Which doesn’t tell Phichit <em>anything</em> but if Yuuri’s happy and the kid’s happy that’s all that matters.</p>\n<p>Right?</p>\n<p align=\"center\">~</p>\n<p>Viktor leans back against the edge of the rink, refusing to admit he’s pouting. He’s looking in the direction of Yuri, who’s spending their break at the other end of the rink typing rapidly on his phone. Since his grandfather isn’t exactly a large fan of texting, there’s only one person Yuri could be talking to. “He barely even yells at me anymore.”</p>\n<p>“I wouldn’t go that far,” Georgi says, foregoing drinking his water in favor of dumping half the bottle on his face. “He still yells at you plenty.”</p>\n<p>Mila goes on her tiptoes so she can rest her chin on Viktor’s shoulder, “It’s cute, he’s made friends with his hero.”</p>\n<p>“Hero?” Viktor demands, “I thought I was his hero!”</p>\n<p>Georgi raises an eyebrow. Mila moves from behind Viktor to lean over the barrier’s edge so she can look at him pityingly. “No, you’re his rival. He wants to beat you, not be you. There’s a difference.”</p>\n<p>Viktor crosses his arms and huffs, nose in the air, “Well, I don’t see what’s so great about Yuri.”</p>\n<p>Mila jabs her fingers into his ribs, “Don’t be a jealous brat. I’m sure he treasures you as a rival too.” He yelps and skates away from her, betrayed. He’d actually meant he didn’t know what was so great about their Yuri that the Yuuri he’d made out with was texting their rinkmate and not him, but considering he hadn’t actually told any of them about that night he decides to let their mistaken interpretation stand.</p>\n<p>He wishes he could ask Yuri to pass on a message, or ask for Yuuri’s number, but he really, <em>really</em> doesn’t want to explain why he wants it.</p>\n<p>She sighs. Georgi hands her what’s left of his water, and she sips at it. “I am glad Yuri has a friend. He’s not great about those.”</p>\n<p>Georgi steals his water back, frowning. “Do you think our Yuri has told his Yuuri that he’s part of his online fan club?</p>\n<p>“Absolutely not,” Mila says, “Also don’t you dare bring that up, we’re not supposed to know that. You're lucky that’s the most embarrassing thing you found on his phone - he’s thirteen!”</p>\n<p>Georgi hums and glides back into the center of the rink, unconcerned about his blatant disregard for other’s privacy. Mila rubs at her forehead and goes to pull her skates back on.</p>\n<p align=\"center\">~</p>\n<p>Yuuri’s doing aerial yoga in the living room, hanging upside down by his hips. Phichit had been a little too eager when Yuuri had asked about installing the stripper pole, and he’d had horrifying premonitions of his workouts ending up all over his friend’s instagram. The aerial silk hook had been a compromise.</p>\n<p>“HEY!” Phichit walks into the room, waving Yuuri’s phone, “Your mini-me is calling.”</p>\n<p>“He hates when you call him that,” Yuuri sighs, holding out his hand, still upside down.</p>\n<p>Phichit gives him the ringing phone, “I can’t call both of you Yuri, and he gets all offended when I call him Yura.”</p>\n<p>Yuuri rolls his eyes, flicking his thumb across the screen, “Hey Yurochka.”</p>\n<p>“Katsudon,” Yura returns, and Yuuri regrets telling him about his traditions regarding his favorite dish only because it had garnered that unfortunate nickname. Yura had screenshotted his contact lists, and Yuuri’s photo was a picture of his mother’s katsudon that he’d sent him. “Are you busy?”</p>\n<p>He flips up and does a split in the air, then back over so his head’s less than a foot from the floor. They really need to mop. “No, I’m just hanging out.”</p>\n<p>Phichit snorts.</p>\n<p>“Whatever,” Yura says, “Can you skype? I want some help with my routine, and Yakov keeps telling me to relax.”</p>\n<p>“Sounds relaxing,” he observes, “Hold on, I’ll call you back on skype.” He disconnects the call, then calls back using the video service.</p>\n<p>Yura’s face fills the screen, red and sweat drenched and with enough angry tension in his body that he’s clearly two seconds away from snapping himself in half. He squints, “Are you upside down?”</p>\n<p>“Yes,” Yuuri says, and leaves it at that. “What’s wrong with your routine?”</p>\n<p>“Yakov keeps bitching about my step sequences not being fluid enough,” he snarls, “but he’s not telling me how to <em>fix</em> that and I’m about to scream.”</p>\n<p>Yurui flips back up again and shifts until he’s lying in the silk like a makeshift hammock. “Let me see.”</p>\n<p>Yura nods and hand the phone to someone who obligingly holds it up so Yuuri can see the whole rink. He goes through his routine, and Yuuri has seen it before but he pays special attention this time to the transitions from jumps to presentation and back. Yura finishes with both arms outstretched before breaking the moment and angrily skating back over and snatching the phone from whoever had been nice enough to hold it. “Well?”</p>\n<p>“I see what he means,” he admits, but when’s Yura’s shoulders get impossibly tenser he hurries to add, “I think it’s where your jumps are placed – as soon as you start to get in the groove of it you have a jump or a spin and you have to start all over again. It’s hard to make it look fluid the way it’s set up now, I think.”</p>\n<p>“<em>You</em> could do it,” he accuses, ice blue eyes narrowed.</p>\n<p>He opens his mouth to deny it, but hesitates – Yura gets angry when he underestimates himself, which wasn’t something he thought he did but Yura doesn’t agree. He runs the routine over again in his head, and, well, Yura’s not wrong. “Probably. But I can’t land my triples nearly as well as you can.”</p>\n<p>That seems to relax him a little at least, and he says, “Yes, you can. Have you talked to your coach about adding the changes <em>I</em> recommended for you?”</p>\n<p>“I tried,” he says, an unusual flash of irritation going through him, “He didn’t think it was such a great idea.” He barrels forward before Yura can start cursing Celestino, “Give me like a day and I’ll send you some ideas for reordering your routine around, okay? I usually end up designing my own step sequences for Celestino’s routines anyway.”</p>\n<p>Yura huffs, blowing his sticky bangs out of his face, “Okay. But talk to your couch again. Your free skate isn’t pushing you enough.”</p>\n<p>“Fine,” he agrees, already dreading the conversation, “But only if you get off the ice for today. You’re not going to improve if you’re too frustrated to focus.”</p>\n<p>For a moment he thinks Yura is actually going to curse him out, but he bites it back and goes, “Fine. I’ll talk to you tomorrow,” and hangs up.</p>\n<p>Yuuri sighs and pulls himself up and out his silks. Phichit helps him fold it, mouth pulled down at the corners. “Not to agree with the angry thirteen year old, but he’s sort of right about Celestino.”</p>\n<p>“You’re literally agreeing with the thirteen year old,” Yuuri points out, tucking the silks into the corner, “Besides, you love Celestino.”</p>\n<p>“He’s great,” Phichit agrees enthusiastically, “but I don’t know, Yuuri. You’re a brilliant skater. I feel like he should be giving you more complicated routines.”</p>\n<p>He pinches the bridge of his nose, “Let’s not talk about it, I get enough of it from Yura.”</p>\n<p>“Okay,” his friend says agreeably enough, but Yuuri knows he hasn’t forgotten it for a second.</p>\n<p align=\"center\">~</p>\n<p>Yuuri looks from his training and class schedule to his calendar, and he <em>could </em>do it. He hasn’t taken too many days off this semester.</p>\n<p>Besides, most importantly, <em>he</em> would have liked to have someone there for him for his first serious competition.</p>\n<p>He opens his email to write a quick note to his professors.</p>\n<p align=\"center\">~</p>\n<p>Celestino stares. “You’re going to Mexico?”</p>\n<p>His student crosses his arms, “It’s for three days. I’ll be back on Sunday. Is there a problem?”</p>\n<p>He looks toward Phichit, who only shrugs. Then back to Yuuri. “No,” he says slowly, “Is there … is there a <em>reason </em>you’re taking three days off in the middle of training to go to Mexico? Not that that’s a problem, but you’ve never done it before. Ever.”</p>\n<p>Yuuri flushes and rubs the back of his head, “No, not really.”</p>\n<p>Phichit rolls his eyes.</p>\n<p>“Okay,” he says, because there’s nothing else to say. “Have a nice trip.”</p>\n<p>His eldest student nods and walks out, presumably to pack. For his trip. To Mexico.</p>\n<p>“Booty call?” he asks hopefully.</p>\n<p>Phichit shakes his head, “Not even close.”</p>\n<p align=\"center\">~</p>\n<p>Yuri is staring angrily at the ground as they wait for the ice to be cleared, and Yakov knows it’s probably nerves, but Yuri’s piece is about <em>innocence</em> and <em>childish discovery</em> and the red-hot anger that his youngest student bleeds constantly isn’t the best mindset for this.</p>\n<p>He also doesn’t know how to comfort him because he’s a teenager who hates everyone and everything, but who will certainly hate himself if he messes up his short skate.</p>\n<p>“Yurochka!” an unfamiliar voice calls out, and Yuri’s head snaps up. Yakov doesn’t know which reporter or fan just made that mistake, because the only person allowed to call Yuri that is his grandfather, and he throws a <em>fit</em> if anyone else does it –</p>\n<p>“Katsudon!” Yuri answers, waving his arm in greeting, and the first smile Yakov has seen all day breaks out over his face.</p>\n<p>He turns and the Japanese skater who had altered his routine is hurrying towards them. He waits, because absolutely not is Yuri going to let this man get away with calling him that, no matter how happy he is to see him.</p>\n<p>Instead of yelling at him, however, Yuri leaps into the older man’s arms, and Katsuki stoops over enough so that Yuri doesn’t have to strain on his tiptoes. “Sorry I’m late,” he says, giving Yuri another squeeze before letting go. “It was harder to get security to let me back here than I thought it would be. I ended up taking a lot of selfies with security guards?”</p>\n<p>“What are you doing here?” Yuri demands, but he’s beaming. “This is a junior only competition!”</p>\n<p>“I know,” he smiles sheepishly, “But it’s your first Grand Prix event! I didn’t want to miss it. You’ve been working so hard.”</p>\n<p>There’s a moment where Yuri’s absolutely still and Yakov has no idea what he’s thinking. Then he gives Katsuki the smallest, sweetest smile he’s ever seen him give anyone, and tackle-hugs him one final time before taking off his skate guards, shoving them at Yakov, and stepping on to the ice.</p>\n<p>“Hi,” Katsuki swallows, eyes looking anywhere at Yakov, “I’m sorry for just showing up like this. I hope it’s not too much of an inconvenience.”</p>\n<p>He’s clearly braced for a lecture. Katsuki thinks he’s about to yell at him, but he came anyway because he wanted to support Yuri. Yakov curls half his mouth into a grin and claps him hard enough on the shoulder that he stumbles. “Thanks, kid.”</p>\n<p align=\"center\">~</p>\n<p>By the time Yakov makes it to the rink the next morning, it’s clear that that Katsuki and Yuri have already been there for a while, both of them sweat soaked as they skate through the end of Yuri’s routine together, and it’s like seeing double vision. It looks like Katsuki knows the routine by heart, and he has a sneaking suspicion that Yuri knows Katsuki’s as well.</p>\n<p>He’s seen Yuri on the phone with the kid before, but in person is different. Yuri gives Katsuki a respect that he doesn’t afford anyone, Yakov included, and he’s less offended by that than he is intrigued.</p>\n<p>Yuri skates better with Katsuki around too, the other skater calming the nerves he denies he has just with his presence.</p>\n<p>He’s wonders how upset Celestino will be if he kidnaps his student.</p>\n<p align=\"center\">~</p>\n<p>Yuuri has just gotten off the plane in Detroit when his phone rings, Phichit’s face filling up the screen. He’s so tired all he wants to do is sleep for a week, and he’s sure whatever his roommate wants to talk about can wait until he gets home. But it’s also not like he has anything better to do while he’s waiting for his cab, so answers.</p>\n<p>“I can’t believe you let it ring that long,” Phichit scolds before he can get a word in, “Anyway, you broke the internet.”</p>\n<p>“That sounds unrealistic,” he yawns, “also, I barely use the internet.”</p>\n<p>His cab finally shows up, and he gratefully slides into the back seat. “You may not, but everyone else does. Everyone’s freaking out about you showing up GPJ Mexico and all the photos they got of you and Yurio together.”</p>\n<p>“Yurio?” he asks, “Where did that come from?”</p>\n<p>“Your sister suggested it, since it’s not Yuri or Yura.”</p>\n<p>He pulls back the phone in disbelief, staring at it like it’s betrayed him, “You talk to my <em>sister</em>?”</p>\n<p>“You don’t use social media,” his friend complains, “How else is she supposed to know if you’re alive?”</p>\n<p>“By calling <em>me</em>?” he says, “Her brother?”</p>\n<p>Phichit makes a dismissive sound at the back of his throat, “Don’t be ridiculous. Anyway, there’s like a thousand photos of Yurio hugging you and the two of you getting breakfast and stuff everywhere. You and Yurio’s fans are going crazy, they think it’s the cutest thing ever.”</p>\n<p>The fame part of his career has always been the hardest part to swallow. “Well, that’s good, right?”</p>\n<p>His friend’s voice softens. He knows how Yuuri gets about his image and his fans and all the things off the ice that he wishes he didn’t have to think about. “Yes, Yuuri. It’s a good thing.”</p>\n<p>“Good,” he says, and doesn’t know what to say besides that.</p>\n<p align=\"center\">~</p>\n<p>Chris looks at his phone and is seriously tempted to let it go to voicemail. Considering the deluge of photos Yuuri’s been tagged in, this call can only be about one thing.</p>\n<p>“Hi Viktor,” he sighs, giving in, “How are you?”</p>\n<p>“How come he’s friends with Yuri and not me?” his friend whines into the phone, sniffing obnoxiously. “I want to be his friend!”</p>\n<p>Chris rubs at his temples. If he’d known inviting Viktor to go out with them would result in this many irritating phone calls, he wouldn’t have done it.</p>\n<p align=\"center\">~</p>\n<p>Less than two weeks after Yuri returns from JGP Mexico his instagram and twitter followers start aggressively tagging him in some sort of video. Confused, he opens it.</p>\n<p>It’s Katsudon, clearly having just come from practice and doing his best to hide his irritation about being ambushed. “Yuuri,” the reporter says off screen, “It’s recently come to light that you have some sort of relationship with the debuting junior skater Yuri Plisetsky. Can we get a comment about that? Are you mentoring him? Showing a more inexperienced skater the ropes, as it were?”</p>\n<p>Yuri snarls, because the way he’s asking, the tone – he’s not some charity case!</p>\n<p>Katsudon’s eyes narrow and his lips go into a tight, hard line. “No,” he says, “Yuri Plisetsky is an absolutely incredible skater, and any form of mentoring or teaching I may do is returned tenfold. I learn more from him every day, and couldn’t be more grateful for the opportunities and growth his friendship has afforded me.”</p>\n<p>There’s a moment of heavy silence, and the reporter recovers, “Well, that’s, I mean, do you –”</p>\n<p>“I have a class to get to, if you’ll excuse me,” Yuuri cuts him off before turning and moving out of frame. The screen cuts to black.</p>\n<p>Yuri’s grin is so wide it hurts, and his heart beats too fast in his chest. It’s the nicest thing anyone has said about him. Ever. And Katsudon said it, his friend, he called him his friend! Which, Yuri knew on some level of course, you didn’t skype someone three times a week and work on their routines and fly to Mexico for someone if they weren’t your friend. Still – it was nice to hear.</p>\n<p>But he can’t just say <em>nothing</em> about it, and he can’t post a video in kind because Katsudon will think he’s crazy and he’ll feel crazy. So instead he retweets the video and just adds: <em>I feel exactly the same way</em>.</p>\n<p align=\"center\">~</p>\n<p>“Holy shit,” Mila says, watching the video with Viktor and Georgi looking over her shoulders, “he must be dying right now. He hates confrontation.”</p>\n<p>Two pairs of suspicious eyes land on her. “How do you know anything more than we do?” Viktor demands. There’s something almost manic in his expression, and even Georgi gives him an odd look.</p>\n<p>The answer is Sara Crispino, who’s one of the handful of people in the skating community who’s actually <em>friends</em> with the reclusive Japanese skater. For someone who’s by all accounts polite and good-natured, he doesn’t seem to have that many.</p>\n<p>But that answer would open up questions on her relationship with Sara, and that’s not a conversation she’s interested in having at all. So instead she snaps, “None of your business,” and flounces off away from her rinkmates.</p>\n<p align=\"center\">~</p>\n<p>Yuuri sits on the couch with his head in his hands. Phichit’s got an arm around his shoulder attempting to comfort him. It’s not nearly as effective as he probably hopes, considering Yuuri can feel him shaking from surprised laughter. “Why did I do that,” he moans, “Phichit I’m <em>trending</em>.”</p>\n<p>“It’s great!” he says, then winces when Yuuri glares at him. “It’s not that bad! If you want something bad I can post literally any of the photos from when I’ve gone out with you and Chris. I’m astounded there <em>aren’t</em> any photos of you two honestly.”</p>\n<p>“Nobody recognizes us with glasses,” he grumbles, “What I don’t understand is how you keep getting away with following us. You’re <em>eighteen</em>. Stop stalking and following us into clubs! One day we’ll get caught and Celestino will kill me.”</p>\n<p>His phone rings. He just hopes it’s not Celestino.</p>\n<p>It’s worse.</p>\n<p>“Yurochka,” he answers, “Look I – I wasn’t thinking, I didn’t mean to blow this all up, I know I should have just walked away –”</p>\n<p>“Katsudon!” Yura snaps, waiting for Yuuri to take a breath. “Thanks.”</p>\n<p>Oh. <em>Oh</em>. “You’re welcome,” he says, and the tight pit of anxiety loosens in his chest just the slightest bit. “Are you ready for Belarus? Just because you won silver in Mexico isn’t any reason to get arrogant.”</p>\n<p>Yura scoffs, “It’s only arrogance if I’m not as good as I think I am. I’m exactly as good as I think I am, because I have self-awareness. Unlike you.”</p>\n<p>Yuuri rolls his eyes, and they fall into the easy sniping back and forth.</p>\n<p align=\"center\">~</p>\n<p>Chris <em>seriously</em> considers letting the call go to voicemail, but he supposes he did this to himself.</p>\n<p>“Hello Viktor,” he sighs, “You saw the video?”</p>\n<p>He holds he phone away from him as Viktor wails in his ear.</p>\n<p align=\"center\">~</p>\n<p>Phichit is twisted on the armchair doing homework, half-listening to Yuuri’s conversation with his favorite Russian skater. And he’s including his roommate’s obsession with Viktor Nikiforov in that.</p>\n<p>Yuuri’s laptop is in the middle of the coffee table, and he’s got his physics homework spread out across every surface of the couch and the rest of the table, and he’s not focusing on any of it. Instead he’s leaning with his elbows on his knees and his chin in his hands listening to Yurio enthuse about his latest competition in Estonia, the one where he’d finally qualified for the junior division of the Grand Prix Final.</p>\n<p>Phichit wants to be mad, because he’s still competing as a junior and he hadn’t qualified, but he can’t. Yurio is actually that good, and the bubbly, innocent way he’s describing everything to Yuuri is kind of endearing.</p>\n<p>Yuuri’s first competition of the Grand Prix series is coming up – in two weeks he’ll be heading to Canada. Phichit is sure once Yurio stops vibrating for long enough the conversation will circle around to it.</p>\n<p>He’s recently come to the uncomfortable realization that Yurio is more invested in Yuuri’s success than Celestino. He still isn’t sure what to do about it.</p>\n<p>“Chris will be there,” Yuuri says, and Phichit was right, they must be talking about Canada now, “So that will be fun at least. And it’s a short flight.”</p>\n<p>“Giocometti?” Yurio asks, “I didn’t know you knew each other.”</p>\n<p>“We don’t advertise it,” Yuuri grumbles, and Phichit does his best not to laugh. “He’s great! Really nice under all the – everything. But he’s that friend that always talks you into bad decisions, you know? Then photographs it.”</p>\n<p>Phichit calls out, “Actually, I’m usually the one photographing it!”</p>\n<p>Yuuri rolls his eyes, “Whatever, the point is I like Chris and it will be nice to see him. But also he encourages my drinking problem in really horrible ways and it’s exhausting.”</p>\n<p>There’s a long silence, long enough that Phichit looks up from his homework and Yuuri’s eyebrows are dipped together. “Drinking problem?” Yurio asks, small and hesitant.</p>\n<p>Phichit cracks up laughing and Yuuri starts waving his arms in front of the monitor, “No! Not like – like anything like crazy, or a problem-problem, just you know, I get it from my dad, you know?”</p>\n<p>“Alcoholism runs in your family?” Yurio says, and actually sounds a little panicked so it’s totally wrong of him to keep laughing but he does anyway.</p>\n<p>“No!” Yuuri yelps, “No, if anything that’s Minako-sensei – not that she is either! I mean,” he looks to Phichit, “Help?”</p>\n<p>He drags himself from the chair and shoves Yuuri down so he’s in the camera’s view as well. Yurio’s eyes are wide. “Chris is great! I love when he’s around because our dear Yuuri doesn’t have a drinking problem, he has a drinking <em>solution</em>.”</p>\n<p>“Oh my god,” his roommate says, head in his hands.</p>\n<p>“He doesn’t drink often but when he does – whoo boy! Clothes come off, dance moves come out. He and Chris have a <em>great</em> stripper pole routine!”</p>\n<p>“Oh my god,” Yurio says, but at least he doesn’t look worried anymore.</p>\n<p>Phichit grabs his phone, “Do you want to see pictures?”</p>\n<p>Yurio says “Yes!” the same time Yuuri yells “NO!” and tackles him to the ground.</p>\n<p>They can hear Yurio laughing as they wrestle on the floor for his phone, and it’s then that Phichit realizes he’s actually grown kind of fond of the brat.</p>\n<p align=\"center\">~</p>\n<p>Mila shoves over a plate of fries to share with Yuri, who’s grudgingly seated beside her in the rec room of the skating rink. The footage for the second day of Skate Canada is playing on both screens. Georgi is sitting at the table besides him, and Viktor left practice early so he could watch it at home. Yuri doesn’t usually bother to watch the competitions live, but Mila knows that this change of behavior is due to one particular Japanese skater. “What’s his line up?” she asks.</p>\n<p>He throws her an irritated glance, but doesn’t pretend to misunderstand her. “Third,” he admits, “At least it’s not first or last. I guess.”</p>\n<p>“I’m sure he’ll do great,” she says with a confidence she doesn’t feel. He did okay on the first day, his score not breaking a hundred but getting close to it. She’s heard he’s nice, and his routines are <em>good</em>, and his step sequences can definitely be called amazing. But she doesn’t really get the hero worship.</p>\n<p>He crosses his arms. “Whatever.”</p>\n<p>She’s about to try again, to say something that will get the scowl off his face, but his phone rings. He grabs it and is about to hit ‘ignore’ when he freezes, going pale. “Yuri?” she asks, “Everything okay?”</p>\n<p>He doesn’t answer her, standing up so suddenly that his chair clatters to the floor and striding out of the room with the phone pressed to his ear.</p>\n<p>She looks to Georgi, who shrugs. “I’m sure it’s fine.”</p>\n<p align=\"center\">~</p>\n<p>Yuuri gets on the podium, trying not to look stunned at his own success. He’s got silver – barely – and Chris looks down at him from his place at gold and winks. “You’ve changed,” he says, speaking through a smile as the cameras flash. “I like it.”</p>\n<p>“Thanks,” he says, giving a little wave to the cameras. He can see Celestino beaming behind them. “I’m not going out drinking with you.”</p>\n<p>“You say that every time,” Chris sing-songs. “I’m going to be up at your hotel room in an hour, so you might as well just agree so I don’t have to drag you kicking and screaming like last year in Shanghai.”</p>\n<p>Yuuri sighs. It’s true. Celestino has been no help at all, just telling him to have fun as Chris literally dragged him to the elevators. Sara had caught them in the hotel lobby coming back at four in the morning, and had deposited both of them into her room when they couldn’t remember what their own room numbers were. Yuuri had woken up with a splitting headache to her brother yelling at him and Chris for deflowering his sister, something they absolutely hadn’t done.</p>\n<p>Chris had flipped him off, rolled on top of Yuuri, and gone back to sleep.</p>\n<p>Michele still got twitchy whenever he saw either of them.</p>\n<p>“Okay,” he says, “but only if we don’t go nearly as hard as we did in Shanghai.”</p>\n<p>“But of course,” Chris all but purrs, and Yuuri feels like he’s lying to him.</p>\n<p>He’s back in his room, getting ready to shower, when his phone rings. He answers it immediately. “Yurochka! Were you watching? I did the third jump just like you said, and it went great!” There’s wet, heavy breathing at the other end, and his smile slides off his face. “Yurochka, are you okay? What’s wrong?”</p>\n<p>“I wasn’t watching, sorry,” his voice is high and chocked, like he’s trying to keep from crying. “It went well though?”</p>\n<p>“That doesn’t matter, forget about it,” he says, sitting on the edge of his bed, “Take a deep breath for me, okay? In,” he waits until he hears Yura’s shaky inhale, “then out. Again. In. And out.” He continues until Yura’s breathing doesn’t sound so perilous. “Okay. Now, what’s going on? You’re not hurt, right?”</p>\n<p>“No,” he says, “No, I – I’m at the hospital, but I’m not hurt. It’s Grandpa.”</p>\n<p>Yuuri’s hand cover’s his mouth, and he swallows before asking, “Is he – is –”</p>\n<p>“He’s alive,” he says, and Yuuri’s shoulders drop. “He fell, and messed up his back, and they have him in surgery now. He should be okay. They said he should be okay, so – so yeah.” He sniffs and whispers, “I’m really scared.”</p>\n<p>“I know,” he soothes, “But everything’s going to be fine. Is Yakov there? Or anyone?”</p>\n<p>“No,” Yura says, which was the answer he was expecting but not the one he wanted, “I didn’t – you’re the first person I’m telling. I don’t – I can’t handle. Other people. Right now.” His breathing hitches again, and he says, “Can you – can you stay on the phone with me? Until, he, until Grandpa’s out of surgery. Please.”</p>\n<p>Yuuri nods before remembering Yura can’t see it and says, “Of course Yurochka. Whatever you need.”</p>\n<p>He holds his phone between his ear and shoulder, digging around his in his bag for his laptop. “Thank you,” Yura says, “Tell – tell me about the free skate. It went well?”</p>\n<p>“Very well,” he confirms, and launches into the story. He opens up his laptop and does two things – messages Chris that there’s been an emergency and he can’t go out, and googles how much a ticket to St. Petersburg will cost.</p>\n<p align=\"center\">~</p>\n<p>Celestino is still asleep in his room from his own night of drunken debauchery, thank god, but Chris is sitting on his bed watching Yuuri pack with an incredulous look on his face. He’s still covered in body glitter from the night before, and his hair is damp from a shower. “You can’t do this.”</p>\n<p>“I can and I am,” he says firmly, “His grandfather will be in recovery for weeks, <em>if</em> there are no complications, and he’s only thirteen. He can’t deal with that alone. He shouldn’t have to deal with that alone.”</p>\n<p>“It’s not your job,” Chris insists, “Yuuri, you’re doing so well this season! You can’t just pack up to play nursemaid in the middle of it. You have the Trophee Eric Bompard in two weeks! You can't afford to interrupt your training by gallivanting off to Russia.\"</p>\n<p>“I’ll figure it out,” he zips up his suitcase, “I have everything I need for competitions, and I’ll have Phichit send me some clothes once I figure out where I’m staying.”</p>\n<p>“Yuuri!” Chris grabs him by the shoulders, mouth turned down at the corners, “This is crazy! You don’t need to do this.”</p>\n<p>He quirks a smile and takes Chris’s hands off his shoulders, giving them a quick squeeze. “Yes, I do. Good luck in Tokyo.”</p>\n<p>He leaves Chris alone in his hotel room, and pulls out his phone to make a quick call. “Sara, it’s Yuuri. I need a favor.”</p>\n<p align=\"center\">~</p>\n<p>It’s been nearly two days since Yuri’s grandfather was rushed to the hospital, and Viktor is worried. They’re all worried, because he hasn’t slept and he’s barely ate but he keeps practicing, forcing himself to stay on the ice and work through his routine again and again long past the point where it’s doing him any good. They’re all taking a break, except Yuri, who’d growled at Yakov when he’d tried to force him.</p>\n<p>“Can we sedate him?” Georgi asks.</p>\n<p>Viktor snorts, “He’d have to actually eat or drink something for that to work.”</p>\n<p>“Good point,” he sighs, “Do you think he’ll pass out from dehydration or low blood sugar first?”</p>\n<p>Yakov rubs at the bridge of his nose. “Probably just plain exhaustion at this point.” He glances at his watch, “Where’s Mila? She’s late.”</p>\n<p>“She said she had to pick up the friend of a friend at the airport,” Georgi says, “Is he still staying at his place alone? Is that even legal?”</p>\n<p>“Oh, yes, excellent idea, let’s call the cops on him, that will help,” Yakov glares, “I asked him to stay with me, but he turned me down.”</p>\n<p>“Same,” Viktor says, “Or at least to come by for dinner or – anything. He told me to leave him alone.”</p>\n<p>Georgi crosses his arms, “We have to do <em>something</em>. This is untenable. Especially since you two are leaving for the Cup of China tomorrow.”</p>\n<p>“Which is already cutting it way too close for my liking,” Yakov says, “I’d originally planned for us to leave yesterday, before everything.”</p>\n<p>“We’ll only be gone for a couple of days, then we’ll be right back,” Viktor assures.</p>\n<p>He rubs the back of his neck and looks back to Yuri, “I know, it’s okay. Don’t worry. Mila and I will do – something.”</p>\n<p>Viktor and Yakov share a concerned glance. The dubious tone of voice does nothing to inspire confidence.</p>\n<p>“YUROCHKA!” yells a voice Viktor may or may not have been dreaming about for the last several months. Yuri grinds to a halt, chest heaving.</p>\n<p>They all turn to look. Yuuri Katsuki is standing there, Mila at his side. He’s clearly exhausted, bags under his eyes and hair a mess. He looks beautiful, and it would be completely inappropriate, but Viktor feels the urge to march over and kiss him anyway.</p>\n<p>“Fuck,” Georgi says, “he must have come here straight from Canada. I can’t believe Yuri told him.”</p>\n<p>Yuri goes skating towards him, and Yuuri drops his bags and runs to meet him.</p>\n<p>“Shit, is Yuri mad? Should we do something?” Georgi continues.</p>\n<p>Yuri skates right to the edge then leaps into Yuuri’s arms, legs around his waist and skates still on. He momentarily buckles under the weight, but then steadies and hugs him back.</p>\n<p>“Well,” Viktor says, heart pounding in his ears, “I think we can safely say that he isn’t mad.”  </p>\n<p>Yura is shaking with barely controlled tremors as he clings to him. Yuuri braces one arm under Yura’s thighs and the other around his back, “It’s okay, I’ve got you, I’m here.”</p>\n<p>He nods against his shoulder, high hitching breaths as he tries and not to cry and fails. Mila is watching with a hand over her mouth, and he catches her eye and purposefully jerks his gaze down, hoping she catches his meaning without him having to say anything. She nods and kneels besides them, carefully unlacing Yura’s skates and sliding them off, and Yuuri lets out a small breath. The last thing they need is someone accidentally getting sliced open.</p>\n<p>Yura doesn’t protest, only criss-crossing his legs behind Yuuri’s back once they’re off. “You,” he hiccups, “you - what are you,” he shifts so he’s pressing his facing into the juncture of Yuuri’s neck and shoulder, and his face is wet on Yuuri’s skin.</p>\n<p>“I didn’t want you to be alone,” he says, carefully walking over so he can lower them both onto the bench seats. Yura doesn’t let go, only let’s Yuuri readjust them so he’s curled in his lap. “I figured I’d stay with you for a bit. If that’s okay?”</p>\n<p>Yura nods, gripping him extra tight for a moment before relaxing. He still doesn’t move to leave, and Yuuri’s not about to make him, so that’s how they stay for long minutes while Yura’s breath evens out and eventually deepens. He knows the moment Yura falls asleep, his whole body going slack and heavy in his arms.</p>\n<p>“Katsuki,” he looks up, and they’re all clustered around, a respectful distance back except for Yakov who walks forward and carefully brushes Yura’s hair back from his face. “Nice to see you again.”</p>\n<p>“Thanks,” he says, “I wish it could be under better circumstances.” He leans back enough to get a better look at Yura’s face. The crescent bruises under his eyes are dark and deep. “Has he been sleeping at all?”</p>\n<p>“I think this is the first time since Nikolai was hurt,” Yakov says. “He hasn’t been eating either.”</p>\n<p>He sighs, “Of course not. I don’t suppose you could call me a cab? I think I should take Yura home.”</p>\n<p>“I can take you,” Viktor says, “I have a key to Yuri’s place.”</p>\n<p>Yuuri blinks and finally takes a good look at the other skater. He hasn’t seen him since they went out drinking together with Chris months ago, and his memory of that ends somewhere around the time he started doing shots at the first club. Viktor only looks concerned and not like he’s horrified to see Yuuri again, so he couldn’t have done anything too embarrassing. He should really ask Chris for more details – all he knows is that they didn’t get into dance off, which leaves a whole lot of other embarrassing behavior on the table. “Please. Thank you.”</p>\n<p>Viktor nods and quickly switches out his skates for sneakers. “Do you need helps with…?” he gestures to Yura.</p>\n<p>He stands, shifting his grip so he’s holding Yura bridal style with his head is lying against his shoulder. “I’ve got him.”</p>\n<p>“I’ll get these, then,” Viktor grabs Yuuri’s suitcase and duffle, and gives him a movie star smile. “Ready?”</p>\n<p>Yuuri gives his own weak grin in return, “Ready.”</p>\n<p align=\"center\">~</p>\n<p>Georgi squints, “Did … did Viktor just blush?”</p>\n<p>Yakov and Mila turn to stare at him. “What?”</p>\n<p>“I think Viktor blushed,” he says, “I’m almost positive. At Katsuki.”</p>\n<p>Mila rolls her eyes and glides back onto the ice, “I think our lives are dramatic enough without you making stuff up.”</p>\n<p>Georgi looks to Yakov, beseeching, “You saw it, right?”</p>\n<p>His coach sighs, “Get back on the ice, you over dramatic little shit.”</p>\n<p>He huffs and skates back into the center of the rink.</p>\n<p align=\"center\">~</p>\n<p>They don’t say much during the car ride there, and under normal circumstance Viktor would be thrilled to have Yuuri in his car, but these aren’t normal circumstances.</p>\n<p>“Thanks for coming,” he says as he parks, looking into his mirror to where Yuuri is still holding Yura in his back seat. “We were getting really worried.”</p>\n<p>He goes around back and helps Yuuri out, both of them being careful not to wake Yura up. “Anytime,” Yuuri says, “I know Yura can be stubborn.”</p>\n<p>“Him? Stubborn? You don’t say,” Viktor teases, unlocking the front door, “Yura’s room is down the hall on your left. I’ll grab your bags.”</p>\n<p>Yuuri nods, taking careful steps, and Viktor ducks back out to grab his luggage from the trunk. He drops it off in the Plisetsky’s guest room, and when he goes to Yura’s room Yuuri is just pulling the blanket up over the kid’s shoulders.</p>\n<p>“Do you need anything?” he asks, leaning against the door frame.</p>\n<p>Yuuri stretches, hands above his head and curving backwards until he’s nearly touching the ground, his shirt sliding up enough to reveal a strip of pale skin. “No, that’s al-” he cuts himself off and straightens. “Actually,” he says hesitantly, “if it’s not too much trouble – would you mind taking a quick trip with me to the grocery store?”</p>\n<p>“Of course not,” he pushes himself off of the door frame, “I’m ready when you are.”</p>\n<p align=\"center\">~</p>\n<p>Yuuri honestly wants nothing more than to take a shower and go to bed – he hates long plane rides – but a free ride and a handy translator is too good to pass up. His Russian is limited to the few words and phrases he’s picked up from Yura.</p>\n<p>Viktor’s seemingly fascinated with the array of ingredients Yuuri has picked out, and he instantly gets the impression that Viktor is one of those people whose fridge contains a dazzling array of microwavable dinners and little else. “You don’t cook a lot?” he finally asks when they’re in the baking aisle, and Viktor is inspecting the shelf of different flours and sugars like he’s never seen it before.</p>\n<p>“I guess I’m that obvious, huh?” he says, giving him that thousand watt grin that makes Yuuri’s heart skip a beat. “I’m surprised you had time to learn between skating and university.”</p>\n<p>Viktor knows he goes to school? Has Yura been talking about him?</p>\n<p>“It was before that, actually. My parents run a hot springs and restaurant. They taught me,” he explains, “Of course, this also means all the recipes I know are intended to feed about a dozen people. It’s made making friends in college surprisingly easy.” No one cared if you were quiet and awkward if you were feeding them. He pushes the cart out of that aisle and grabs a gallon of milk before swinging around to the produce section. He starts piling vegetables into the cart, and Viktor’s eyebrows rise nearly to his hairline. Honestly, how is this man even alive?</p>\n<p>Viktor leans against the cart, and Yuuri pauses in his inspection of the tomatoes. He’s not looking at him, and his smile seems almost … wistful, maybe, is the word. “That’s nice. I usually eat alone. I guess that’s why I never really learned to cook – it didn’t seem like there was much point if it was only me.”</p>\n<p>Yuuri stares. He’s almost certain that Viktor hadn’t meant for that to come out as heart-wrenchingly sad as it had. His hand hovers over Viktor’s forearm, hesitating because they barely know each other and it’s not his place, but he’s still looking at something Yuuri can’t see, sad in some seemingly untouchable way that Yuuri, who has his family who’s supported and loved him his whole life, who has Phichit and Sara and Chris, who often feels alone but never <em>lonely</em>, can’t really understand.</p>\n<p>He grips Viktor’s arm and squeezes, and his head snaps down so they’re looking each other in the eyes. “Katsudon is my favorite dish that my mother makes – it’s where Yura got his nickname for me, its means pork cutlet bowl. When you get back from China, I’ll make it for you. Okay?”</p>\n<p>Yuuri is not a nurturing person. He’s not prone to cooking and looking after others, but he is a <em>caring </em>person. If looking after Yura keeps him sane, if cooking for Viktor gets that look off his face – he’s more than happy to do it.</p>\n<p>Viktor’s eyes widen, and he smiles – something softer and more genuine than his normal grins, and all at once Yuuri is reminded of how incredibly <em>beautiful</em> Viktor is. He puts his hand on top of Yuuri’s and says, “I’d like that.”</p>\n<p>“Good,” Yuuri says.</p>\n<p>He’s still holding the tomato.</p>\n<p align=\"center\">~</p>\n<p>Yuuri gets back to Yura’s house, groceries on the table that Viktor had paid for despite his protests. He’d said it was the least he could do considering everything Yuuri was doing, and had thrust his card at the bemused cashier.</p>\n<p>The house isn’t a mess by any definition of the word, at worst it can be described as disheveled. But he does what he can, putting away the groceries and quickly throwing together a soup to slow-cook on the stovetop. Yura is still asleep, and when he wakes up he’s going to insist that he eats something. He opens all the curtains, and even cracks a window for a few minutes let fresh air in until he can’t take cold. He does what few dishes there are, and is in the middle of scrubbing down the counters when he hears a phone ringing.</p>\n<p>He blinks, looking around, because it sounds close so it’s not Yura’s and he knows it’s not his. Then he catches sight of a phone attached to the wall, and to be honest he’d completely forgotten that home phones even existed. He picks it up, just in case it’s Yakov or one of Yura’s rinkmates. “Plisetsky residence, Yuuri speaking.”</p>\n<p>There’s a long silence, and Yuuri’s about to hang up when a gravelly voice barks, “You are not Yuri! Where’s my grandson?”</p>\n<p>“Mr. Plisetsky,” he says, startled, “No, I – I’m Yuuri Katsuki, maybe your grandson has mentioned me –”</p>\n<p>“Katsudon?” he asks, the anger and worry draining from his voice. “Aren’t you supposed to be in Japan?”</p>\n<p>Yuuri relaxes, “Detroit, actually, although I am from Japan. I just – Yura called me when you got hurt, and I just – I didn’t want him to be alone. I was planning to stay with him until you’re recovered, if that’s okay with you?”</p>\n<p>“Where is he now?” he asks, “Is he still at the rink?”</p>\n<p>Yuuri looks toward Yura’s room, “Uh, no. He’s asleep actually.”</p>\n<p>“He is?” There’s no mistaking the relief in his voice, “Has he eaten anything?”</p>\n<p>“I’m making soup now,” he glances at the stove, and he should probably be stirring that. “Yakov told me he hasn’t been eating, so I figured I should ease him back into it a bit. I don’t want him getting sick.”</p>\n<p>“Hm. Yakov knows you’re there? And Viktor?”</p>\n<p>“Yes. Viktor drove me here,” he says, leaving out the part where Yura passed out at the rink.</p>\n<p>There’s another long silence, and Yuuri’s just starting to get nervous when Nikolai says, “Very well, you can stay. Take good care of Yurochka,” and hangs up.</p>\n<p>“Will do,” he sighs, speaking only to static, before hanging the phone up and going to check on the soup.</p>\n<p align=\"center\">~</p>\n<p>Yuri wakes up slowly, eyelids heavy. He curls deeper into his bed, pulling the blankets tighter around him. Sleep is pulling him back, but hunger’s also gnawing at his stomach for the first time since – since –</p>\n<p>He shoots up, totally awake, and wrestles himself out of the blankets. It all comes flooding back, and it had to have been a dream, or a hallucination, or something. He skids to a stop in the living room, and Katsudon is there, eyes closed and in an improbable yoga pose. He looks up and smiles, untwisting himself to stand up straight, “You’re up! Good. I made soup.”</p>\n<p>“You’re really here,” he says numbly. “Katsudon, what – what are you <em>doing</em>! You have to be in France in two weeks! You don’t have the time to babysit me!”</p>\n<p>He raises an eyebrow and crosses his arms. “Nobody is babysitting anyone. If you’re responsible enough to be an internationally competing professional athlete, then you’re fully capable of spending your nights alone and feeding yourself if that’s what you want.” Yuri relaxes a little, those words soothing a pride he hadn’t even realized had been hurt. He wasn’t a kid. He didn’t need people fussing over him. “However,” Katsudon continues, “this is rough. It sucks. I thought you might want a friend.”</p>\n<p>He does. Just having him there makes everything better, everything more tolerable. “But your competition!” he insists, “Yuuri, you have a really good chance of qualifying for the Grand Prix Final. You need to be focused on that!”</p>\n<p>“I am,” he says, “I’ve already looked into it – there’s a rink nearby that I can practice at. I’ll be <em>fine</em>, Yurochka. You’re always saying Celestino is useless anyway.”</p>\n<p>He is, but even a shitty coach is better than no coach. But Katsudon has that frown that means he’s going to be stubborn about this, and it’s not like Yuri actually wants him to leave anyway. “Okay. But you’re not going to practice at some random rink with the public – you’re coming and practicing with me at my rink.” He opens his mouth to protest, but Yuri barrels forward, “Yakov and Viktor are going to be gone for the next couple of days anyway, and Mila and Georgi won’t mind.”</p>\n<p>“And when Yakov gets back?” Yuuri asks, eyebrow raised.</p>\n<p>“I’ll take care of it,” he answers, making a note to look up when Viktor’s free skate will be over so he can give their coach a call after. He’s not stupid enough to try to extract favors from Yakov before Vitya has secured yet another gold medal. “Deal?”</p>\n<p>Katsudon uncrosses his arms and sighs, “Deal. Now let’s eat before the soup gets cold.”</p>\n<p align=\"center\">~</p>\n<p>Mila is getting ready for the day, putting on her workout clothes and running a brush through her hair. Considering the alarm she can hear blaring across the hall, she has another five minutes before Georgi groggily stumbles into her room accusing her of making them late. As if it’s ever <em>her</em> fault that they’re late.</p>\n<p>“He’s really planning to stay there?” Sara asks, her face filling up the laptop screen.</p>\n<p>“Looks like it,” she says, and her hair is just barely long enough to pull back. “I’m glad, Yuri’s still a kid. He needs someone looking after him, and he wasn’t about to let any of us do it.” She hesitates, dropping her arms and turning so she can actually see Sara’s face. “Yuri brought him to the rink yesterday. Which is fine, he has his second qualifying event in less than two weeks, so it’s for the best. He’s nice, just like you said, but – uh, I mean.”</p>\n<p>“He doesn’t seem like that great of a skater?” Sara finishes knowingly.</p>\n<p>Mila lets out a great sigh of relief, “Yes! Not bad, of course, but not – I mean, I’ve seen him skate in competitions before, and that was better. I just – don’t get it, is all.”</p>\n<p>She shrugs, “He’s always been like that, don’t worry about it. When push comes to shove, Yuuri will pull through, and besides this season he’s doing better than ever.”</p>\n<p>“If you say so,” Mila says, “I have to get to the rink, I’ll talk to you later.”</p>\n<p align=\"center\">~</p>\n<p>Phichit tilts his head to side and squints, “Are you lying in a bathtub?”</p>\n<p>His best friend rolls his eyes and shifts, and he can’t see much more than Yuuri’s face but it definitely looks like a bathtub. “Yes. I didn’t want Yurochka to overhear and worry.”</p>\n<p>“Worry?” he echoes, and tries not to let his voice pitch into hysteria, “Why would he worry? It’s not like Celestino is threatening to drop you unless you get your ass on a plane back to Detroit or anything.”</p>\n<p>“Shh!” he hisses, glancing anxiously off screen to what Phichit assumes is the bathroom door. “I don’t want to tell Celestino about Yura’s grandfather, he can’t keep any secrets when he’s drunk. I told him I needed to deal with a family emergency, I don’t know what else he expects.”</p>\n<p>“For you to stop acting like a crazy person maybe?” he suggests.</p>\n<p>Yuuri glares, mouth tugging down at the corners. “Well, he can drop me or not, but I’m staying where I am.”</p>\n<p>So <em>stubborn</em>. Phichuit frequently forgets how immovable Yuuri can be when he’s made up his mind about something. “Okay,” he says, not wanting to sit there having an argument he can already tell he’s not going to win. “How are you doing practicing on your own?”</p>\n<p>His face twists into a grimace, “About as well as expected.”</p>\n<p>“Oh my <em>god</em>,” Phichit moans, putting his head in his hands and going back on the decision he’d just made to say, “This is all such a bad idea.”</p>\n<p>There’s an odd gasping sound coming from his monitor, and he peeks between his fingers to see Yuuri laughing so hard he can’t even catch his breath. The knot of worry in his chest loosens at that, because the Yuuri he knew before Yurio would be midway through a panic attack with everything going on, but instead he’s laughing at him.</p>\n<p>Maybe, <em>maybe</em> Yuuri knows what he’s doing after all.</p>\n<p align=\"center\">~</p>\n<p>Yura wanted to see his grandfather, but Nikolai hadn’t wanted him missing practice to visit him, so the compromise was Yuuri and Yura getting up at the crack of dawn and taking a cab to the hospital.</p>\n<p>Yuuri didn’t mind, not one to sleep much past sunrise anyway, but Yura had gotten into the back of the cab and curled up against him before falling asleep like a grumpy kitten. It was, quite frankly, adorable, and Yuuri twisted his arm at an awkward angle to snap a photo without waking him up.</p>\n<p>It’s a short ride, and Yuuri finds himself shaking Yura awake and guiding him through the hospital. He’s wondering if maybe going so early wasn’t the brightest idea when they enter the room and Yura, without any sort of greeting, climbs into Nikolai’s hospital bed and faceplants into his chest. Nikolai laughs and pats the top of Yura’s head, and the two of them speak in soft Russian while Yuuri claims a chair by Nikolai’s bedside.</p>\n<p>Some minute later, a gruff voice says, “You must be Katsudon.”</p>\n<p>Yuuri looks up from scrolling through his instagram – damn Yura and Phichit both for getting him to use the damn thing – and smiles. “Yes sir,” he stands and holds out his hand to shake, “It’s very nice to meet you. I’m glad to see you’re doing well.”</p>\n<p>Nikolai raises an eyebrow and looks from Yuuri’s hand to Yura, who attempts to hide his snickers in his grandfather’s shoulder. Yuuri’s beginning to wonder if he’s missed something when Nikolai’s work-roughened hand closes over his own. However, instead of shaking it, he tugs Yuuri forward, causing him to stumble and fall into the older man. Nikola’s arm comes across his back and squeezes, “None of that now. Thank you for looking after our Yurochka. It’s much easier to focus on getting better and out of here knowing that he’s with you.”</p>\n<p>He flushes and hesitantly hugs back once he feels Yura’s arms joining his grandfather’s, “I wouldn’t be anywhere else, sir.”</p>\n<p>“Call me Nikolai,” he says, and it’s clear he’s laughing at him but it’s also equally clear it’s not malicious so he only nods.</p>\n<p align=\"center\">~</p>\n<p>Chris’s alarm goes off, and he blindly reaches out an arm to snatch his phone of his bedside table and hit snooze. He blinks some of the sleep from his eyes, huddling beneath the warmth of his duvet as he unlocks his phone to check his facebook and twitter.</p>\n<p>He blinks again, slower this time, wondering if he’s still asleep, and scrolls quickly through the rest of his feed, seeing the same thing over and over. “Oh no,” he says, faint because it’s too early to curse and he’s not fully awake yet. It has to be some sort of mistake, because he would have heard about it if it wasn’t.</p>\n<p>He considers calling one of them, either to find out what exactly is going on or to give them a heads up, but it’s <em>early</em> and he’s sure to hear about it anyway so he tucks his phone under his pillow and works on catching some extra precious minutes of sleep.</p>\n<p align=\"center\">~</p>\n<p>Viktor beams, the gold medal around his neck, and carefully steps off the podium to walk over to Yakov and the hoards of reporters. He slows, however, when he sees Yakov frantically shaking his head and miming a zipping motion over his mouth. What on earth…?</p>\n<p>“Mr. Nikiforov!” one of the reporters calls out, and Viktor shrugs it off and strides forward, million-watt smile on display. “Can you confirm the existence of a romantic relationship between yourself and Japanese skater Yuuri Katsuki?”</p>\n<p>…</p>\n<p>\n<em>What?</em>\n</p>\n<p>It’s only through years of practice that he keeps his smile from slipping, “Excuse me?”</p>\n<p>“You two have already moved in together,” another reporter adds, which is certainly news to him, “things must be serious?”</p>\n<p>“Any talk of an engagement?” a third one asks, and he shoots Yakov a panicked glance, because on one hand he and Yuuri – unfortunately – aren’t dating and definitely aren’t engaged, but on the other hand Yakov clearly doesn’t want him to say anything, and why exactly is he getting asked these questions now?</p>\n<p>His mind flashes to the photo on his phone, and if it turns out Chris leaked photos of the two of them from when they’d gone out together after the last World Championships he’s going to strangle him.</p>\n<p>“No comment,” Yakov says gruffly, latching onto Viktor’s elbow and dragging him away from the throng of reporters. He gives them a little wave but allows himself to be pulled away.</p>\n<p>“What’s going on?” he demands once they’re away from prying eyes, “What are they all talking about?”</p>\n<p>Yakov hold out his phone. The headline ‘SECRET LOVE AFFAIR REVEALED’ is stamped along the top, and below it is a photo. It’s the two of them, taken just a couple days ago from when they were grocery shopping. They’re looking into each other’s eyes and their hands are tangled together. Yuuri is holding a tomato.</p>\n<p>It’s a damning picture. Viktor knows it was just Yuuri feeling sorry for him and offering to cook him dinner, but it certainly looks like they’re lovers, like Yuuri is a moment away from closing the few inches between their lips. But he’s not. “So they have a picture,” he says, tearing his eyes away and looking at his coach, who’s now frowning at him. “It’s a mistake, why didn’t we just say that?”</p>\n<p>“And tell them what?” he asks, “That Katsuki is taking an extended vacation to St. Petersburg in the middle of competition season for no reason? That’s believable.”</p>\n<p>“Ah,” Viktor says, finally understanding. The public doesn’t know Yuri’s grandfather is injured, because it’s none of their business. Yuri didn’t even want <em>their</em> sympathy, never mind his thousands of fans. “We need to talk to Yuri. Both of them.”</p>\n<p align=\"center\">~</p>\n<p>Thankfully, they’d gotten to the rink before the story had broken, and hadn’t even known about it until Mila and Georgi had burst inside, eyes wide and frantic. Both of them had been babbling in Russian so Yuuri hadn’t caught a word, but Yura had paled and skated over to the edge of the rink, frantically grabbing for his cell phone. “Mind filling me in?” he asks, skating to the edge and leaning against it.</p>\n<p>“Everyone thinks you and Viktor are dating,” Yura answers, and he stares.</p>\n<p>Georgi holds out his phone, looking vaguely apologetic, “It’s true. It’s all over – everywhere.”</p>\n<p>“Oh my god,” he says faintly, looking down at the photo and scrolling through the <em>hundreds</em> of comments. He thinks he’s going to pass out.</p>\n<p>At that moment, Yura’s phone starts ringing, and he answers it immediately, barking, “Viktor, <em>what the hell</em>.” There’s a long pause. “Yes, he’s here. No, you can’t talk to him, you psycho. Tell me why you haven’t released a statement yet.” There’s another long pause, and Yuri resists the urge to ask Yura to put in on speaker. His face pinches and he says, quieter this time, “Oh. Okay. Hold on, we’re not doing this through a phone call, at least let me call you back on skype.” He hangs up and sighs, closing his eyes and breathing out slowly.</p>\n<p>Yuuri skates over and puts an arm around his shoulders, “You okay?”</p>\n<p>Yura opens his mouth, closes it, and winds his arm around Yuuri’s waist so they’re pressed side to side. “Yeah,” he says, giving a half smile. He calls back on skype and holds up the phone they’re both in view.</p>\n<p>Viktor and Yakov’s faces fill the screen. Viktor’s biting his lips and his eyebrows are dipped together, while Yakov’s face just gives the vague impression of concern while remaining completely blank. “I’m so sorry about this!” Viktor blurts.</p>\n<p>Yuuri blinks, taken aback, “Why? We got photographed, it happens, and it’s certainly not your fault.”</p>\n<p>“Are you seeing anyone right now?” Yakov asks, cutting off whatever Viktor was about to say.</p>\n<p>His face heats up, “Uh – no, I’m not.”</p>\n<p>“Good,” Yakov nods, “then congratulations – for the foreseeable future, you and Vitya are dating.”</p>\n<p>Yuuri can feel the all blood that had just rushed to his face drain from it, which can’t be healthy.</p>\n<p>“What didn’t you ask me if <em>I’m </em>seeing anyone?” Viktor whines before what Yakov just said seems to catch up with him and he says, “What?”</p>\n<p>“It’s easier than trying to concoct some other excuse,” Yakov says, “and it’ll only be for a month or so anyway.”</p>\n<p>“And I just look like a crazy person who abandoned my coach to live in Russia in the middle of competition season for my boyfriend,” Yuuri sighs, and tries not to think of the absolute fit Celestino is going to throw over this. He’s still not planning on telling his coach why exactly he’s here, and now with this story everywhere he’s sure to be furious.</p>\n<p>Yura tenses all along his side and he looks down in concern. “No,” Yura says, hands clenches, “no that’s – that’s not fair. We’ll just tell everyone the truth.”</p>\n<p>Yakov shakes his head, “No, Yuri–”</p>\n<p>“No,” he cuts him off, “No. It’s not fair to drag down Katsudon’s reputation just to keep me out of the news. It’s not worth it. We’ll tell everyone the truth.”</p>\n<p>It’s a nice gesture – an <em>amazing</em> gesture – but Yuuri isn’t about to let it happen. “Yurochka,” he says, squeezing his shoulder until the younger boy looks up at him, “No. Thank you – but no. Your personal life isn’t anybody’s concern, and the last thing you want to do is start letting the media butt into your privacy. We’ll go with the cover story,” he looks to Viktor, who gives a determined nod.</p>\n<p>“But now they’ll be butting in to <em>your</em> privacy,” Yura argues.</p>\n<p>“It’s fine,” he says, even though it’s really not, even though he <em>hates </em>the media prying into his life, hates the fame that comes with his passion. Pretending to be Viktor Nikiforov’s boyfriend is only going to make all that so much worse. But Yura is a kid, he’s only thirteen, and the only thing worse than the public prying into his own personal life is them dragging out all the dirty details of Yura and his grandfather, is the whole world putting Yura’s pain on display like they have some sort of right to it. So Yuuri pushes all his fears down to say, “It’s okay, Yura. Viktor and I can handle this.”</p>\n<p>Yura doesn’t look away, searching Yuuri’s face for a long moment before nodding and leaning back against Yuuri’s side. “It’s settled then,” Yakov says, “We’re heading to the airport now. See you in about,” he checks his watch, “fifteen hours.”</p>\n<p>Fifteen hours. Cool. Fifteen hours to prepare himself to act like the boyfriend of his idol. This is fine.</p>\n<p>Oh god, he needs to talk Phichit.</p>\n<p align=\"center\">~</p>\n<p>Yuri waits until they’ve snuck their way back home and Katsudon’s in the shower to call Yakov. He’s a little bit gratified when he picks up by the time the second ring is done, “Yura? Is something wrong?”</p>\n<p>“Besides everything?” he snarls before remembering he’s calling because he wants something and he should at least make a little bit of an effort at not being a brat. “I mean – yes, something’s wrong. I need a favor. A big favor.”</p>\n<p>“What is it?”</p>\n<p>“I need you to train Katsudon too, while he’s here,” he says, “He’s good, and he’s doing so well this season. I try to help – I <em>do</em> help – but I’m not a coach.”</p>\n<p>Yakov snorts before saying dryly, “It’s good to know you’re aware of at least some of your limits.” Yuri doesn’t even have the time to get offended before he continues, “Yura, of course. By helping you he’s helping all of us.” The relief is so immediate and staggering that he has to lean against the wall for support. He’d been so afraid that he’d doomed Katsudon to failure by needing him, and even if Katsudon was okay with that he isn’t. “I’ve tried calling Celestino but he’s not answering my calls.”</p>\n<p>“Shocking,” Yuri says, but he’s grinning. “Thank you.”</p>\n<p>Yakov grunts, somehow managing to still sound vaguely pleased, and ends the call.</p>\n<p align=\"center\">~</p>\n<p>Chris is mid-practice when his coach calls out, “Your phone’s ringing! It’s Nikiforov!”</p>\n<p>He immediately abandons his step sequence to rush over and snatch his phone away, ignoring Josef’s exasperated look. He’s been <em>waiting</em> for one of them to call him, and he doesn’t bother to keep the delight from his voice when he answers, “Congratulations on your upcoming nuptials. If I’m not the best man I’m going to be very cross.”</p>\n<p>“Shut <em>up</em>,” he moans, “what am I supposed to do?”</p>\n<p>“Yuuri, I’m assuming,” he says, and laughs outright when Viktor makes a choking sound at the other end.</p>\n<p>“I’m serious!”</p>\n<p>Chris leans over and snatches a towel from Josef’s outstretched hand, wiping the sweat from his face. “So am I. What’s the problem here? The man you’re obsessed with is now your media-boyfriend. Could it get any more perfect?”</p>\n<p>“I want him to be my real boyfriend! Not my media-boyfriend!” he insists.</p>\n<p>“Well considering you’ve made exactly zero progress with that on your own, this seems like a perfect opportunity. This time you just have to seduce him without alcohol.”</p>\n<p>Viktor groans, “I didn’t seduce him last time! He seduced me!”</p>\n<p>That’s a good point. “He probably won’t do that again without alcohol.” There a long silence. Chris raises an eyebrow, “Viktor?”</p>\n<p>“I don’t know,” he says quietly, “he’s been doing a pretty good job of it so far.”</p>\n<p> “Oh my god,” Chris laughs, and then hangs up on principle. His phone is instantly ringing again, and he answers “You’re pathetic.”</p>\n<p>“What?” asks not-Viktor, “Chris?”</p>\n<p>He winces, “Yes, sorry, I thought you were someone else. What’s up?”</p>\n<p>As soon as he says it he realized that it’s a ridiculous question. Yuuri answers, “Phichit didn’t answer. I left him a message. In the meanwhile,” he takes a deep breath, and Chris has enough foresight to pull the phone away from his ear.</p>\n<p>He can still hear Yuuri screaming from the speaker, and by the time he stops laughing long enough to bring the phone back to his ear Yuuri’s already hung up.</p>\n<p align=\"center\">~</p>\n<p>“Are you sure you don’t want me to go with you?” he asks for the fifth time.</p>\n<p>Katsudon sighs, “Yes, I’m sure. The whole point of this is to keep you away from the media circus, remember?”</p>\n<p>He crosses his arms, “I don’t like you going alone. They’re going to eat you alive.”</p>\n<p>“Thanks for the vote of confidence,” he says dryly, and Yuri can tell he’s not actually offended so he doesn’t bother to apologize. “I’ll go pick them up, get a few pictures taken, and I’ll be right back. It shouldn’t take more than an hour or two.” Yuri stares. No way is he that stupid. Eventually Katsudon sighs and says, “Let me hope, okay? I promise to come back with all my limbs attached at least.”</p>\n<p>He gives in, uncrossing his arms, but can’t help but ask, “You’re not going in that, are you?”</p>\n<p>Katsudon looks down at his sweatpants and longsleeve, “I was planning on it. Why?” There’s not enough time in the world to talk about everything wrong with it, and they have less than an hour before Katsudon ha to leave. He pulls out his phone, firing off a rapid text to Mila and Georgi since they only live a couple miles from Viktor’s apartment, and doesn’t put it in their rinkmates group chat specifically he doesn’t want the older man to see it. If he hadn’t wanted them going through his things he shouldn’t have given them all keys to his place. “Yura?”</p>\n<p>“Go put on some jeans,” he says, not looking up from his phone as Mila and Georgi start sending him pictures of their options, “the too-tight skinny ones. I know Phichit sent them. And a white button up, you have like five of them.”</p>\n<p>“Denim is cold!” he protests, “I’ll freeze!”</p>\n<p>He stabs a finger towards the guest room where Katsudon is staying, “March. That wasn’t a suggestion.”</p>\n<p>Katsudon throws up his hands, but does as he’s told with a minimum amount of grumbling. If Katsudon is going to put himself under a microscope for Yuri’s benefit, the least he can do is make sure the press doesn’t literally tear him apart.</p>\n<p align=\"center\">~</p>\n<p>Viktor <em>had </em>expected the horde of reporters when he stepped out of baggage claim. What he hadn’t expected was Yuuri to be there waiting for him as well, looking absolutely delicious. Or wearing his grey waistcoat and favorite black silk tie, and jeans that look like they’d been poured on. The cameras are already flashing when Yuuri runs over to him and throws his arms around his neck. “I hope you don’t mind about the borrowed clothes,” he whispers, going on his tiptoes so he can speak directly into his ear, “Yura insisted.”</p>\n<p>“Not at all,” he says back, throat dry, and keeps an arm around Yuuri’s waist as he shifts to stand at his side instead. Oh god, is Yura trying to kill him? “Feel free to take whatever you like.” He immediately flushes and calls himself ten kinds of idiot. Yakov has a sudden coughing fit that probably looks natural to everyone else, but Viktor knows his coach is laughing at him.</p>\n<p>Yuuri flashes a smile at him that makes him melt, “I’ll keep that in mind.” He takes Viktor’s hand and laces their fingers together, “Ready to face the music?”</p>\n<p>He squeezes Yuuri’s hand and says, “Ready.”</p>\n<p align=\"center\">~</p>\n<p>Phichit is conflicted. On one hand, Celestino is absolutely furious and he thinks they might have passed the point of no return, even if Yuuri were to get on the phone this instant and tell their coach everything. On the other hand, his best friend is in a Hollywood relationship with his childhood celebrity crush and splashed on the cover of every news outlet that’s even remotely invested in the skating world.</p>\n<p>His phone rings, and he answers it without looking. “Hello?”</p>\n<p>“IS THIS REAL?” two voices yell in his ear.</p>\n<p>He winces and holds the phone farther away, “Hi Guang-Hong, and – Leo?”</p>\n<p>“Yes,” they both answer at the same time. Again. Phichit hadn’t eve known they were currently in the same country. “This whole – Yuuri and Viktor thing. It’s real, right?”</p>\n<p>“Oh, very real,” he answers, because he’s not about to go spilling Yurio’s secrets, even to his closest friends. And also because he’s having <em>entirely </em>too much fun. “It was kind of a whirlwind romance, you know? One second they barely know each other, the next Yuuri’s jumping on a plane to Russia.”</p>\n<p>There’s more screaming, and Phichit covers the bottom of his phone so they can’t hear him cackling to himself.</p>\n<p align=\"center\">~</p>\n<p>It’s their first morning all training together, and Yuri is grateful that Katsudon is here, loves practicing with him and the others. What he doesn’t love is how Katsudon’s nerves are making it impossible to get through his routine while everyone else is watching him.</p>\n<p>He’s flubbing spins that Yuri knows for sure he could make in his sleep, and his eyes keep darting to the others, Viktor especially, like he’s afraid they’re judging him and finding him wanting. He falls while attempting a jump, and Yuri has officially had it.</p>\n<p>“Okay everyone!” he claps his hands, getting everyone’s attention on him and away from Katsudon. “It looks like it’s lunchtime.”</p>\n<p>“It’s eleven,” Georgi protests, “We’ve only been a few hours.”</p>\n<p>“Brunch then,” he insists stubbornly, crossing his arms.</p>\n<p>Viktor darts his gaze from Katsudon then back to him, and says, “If this is about –”</p>\n<p>“<em>Goodbye now</em>,” he cuts him off, glaring, because when it comes to skating Viktor may be a genius but with everything else he’s a <em>moron</em>.</p>\n<p>He will literally start shoving people off the ice if he has to, but Yakov sighs and calls out, “Let’s take an early break. My treat.”</p>\n<p>“Can we try the new bakery that opened up down the street?” Georgi demands with an intensity Yuri would mock him for if it were any other time. He has the worst sweet-tooth that Yuri has ever seen.</p>\n<p>Yakov rubs at his forehead, “Yes, Georgi, we can go to the new bakery down the street.”</p>\n<p>Everyone leaves the ice, talking amiably and pointedly not looking behind them. Katsudon skates over, “Yura, you really didn’t need to do that.”</p>\n<p>He waits until they’re gone to face him and answer, “Yes, I really did. What’s going on?” Katsudon bites his lip and looks away, and he continues, “Never mind, you’re right, that was a stupid question. Sorry.”</p>\n<p>“It’s okay,” he says, looking back and forcing a smile, “You know, maybe it’s best if I just practice on my own like I was planning to.”</p>\n<p>“Because it will be so much easier to skate in front of a whole bunch of strangers than a couple of fellow skaters? Besides, it’s not like the paparazzi is following you around or anything – oh wait, just kidding, they are.” Katsudon rolls his eyes, but he’s not as tense now, which had been the point. “You have to leave for France in a week, okay, so just – you know this routine. You’ve done it a thousand times. You <em>can </em>do it – there’s no part of it that’s outside your skills, okay? I know how you get, with the – with people and the expectation, and all that crap.” He grabs Katsudon’s hands, and implores, “There’s no one else here, okay? It’s just me. <em>Me</em>. I already know you’re great, I’m not someone you need to impress. So just skate it for me. Like you mean it.”</p>\n<p>Katsudon smiles and pulls his hands back so he can ruffle Yuri’s hair, “I - okay, Yurochka. I’ll skate it for you.”</p>\n<p>Yuri beams and skates to edge of the rink, smile wide and eager.</p>\n<p align=\"center\">~</p>\n<p>Viktor feels a little bad about the fact that they’re all hiding just out of sight and spying on Yura and Yuuri, but it wasn’t his idea.</p>\n<p>It was Yakov’s.</p>\n<p>Mila’s piggybacking on Georgi’s shoulders so she can see, and Viktor is reminded again that in spite of how antagonistic their relationship can be at times, the two of them have been friends since they were kids. Like proper little kids, before either of them got into skating.</p>\n<p>Viktor doesn’t talk to anyone that he knew before he started skating.</p>\n<p>“Holy shit,” Mila says faintly. Viktor curses at himself for getting distracted focuses back on the ice.</p>\n<p>Yuuri’s skating, but instead of the high strung mess he was just moments ago – it barely looks like he’s skating, it looks like he’s flying. His movements are so fluid and natural that it barely looks like he’s touching the ice. His spins are gorgeous, and his flips are neat and precise. He makes it all look easy, but if Viktor tried to do jumps that complicated at the end of a routine – especially after practicing for hours beforehand – he would fall flat on his face and possibly break his leg.</p>\n<p>“I guess Yuri’s obsession wasn’t all hype,” Georgi’s eyebrows are nearly to his hairline. “Fuck, Viktor, you better watch out. If Katsuki gets his shit together, you’re going to be out of a gold medal.”</p>\n<p>He feels the beginnings of genuine excitement and nervousness. Not to disparage other skaters, never ever to talk ill of the talented people he shares the ice with – but it’s been <em>so long</em> since he looked at a fellow competitor and saw a <em>challenge</em>.</p>\n<p align=\"center\">~</p>\n<p>Chris is eating breakfast when his phone rings. This time he doesn’t hesitate at all before answering. “Have you slept with Yuuri yet?”</p>\n<p>“What? No!” Viktor says, sounding shocked at the suggestions and Chris resists the urge to bang his head against his kitchen table. He’s tempted to fly out to Russia himself and knock some sense into both of them. Even if Yuuri is embarrassed about their drunken night out, he’s certainly not embarrassed enough to tell Viktor no if the giant moron would just make a proper move instead of just moping around everywhere like a love-struck fool</p>\n<p>Why are his friends so exhausting?</p>\n<p>“I’m hanging up now,” Chris informs him, “Call me back when you have a boyfriend.”</p>\n<p>“WAIT!” Viktor says, and he sounds serious, for once. “Just – hold on!”</p>\n<p>Chris frowns, “Okay, okay. What’s going on?”</p>\n<p>There’s about half a minute of silence, and he’s about to hang up for real when Viktor blurts, “So – so Yuuri’s, uh, kinda good. At skating.”</p>\n<p>He gives in and lies face down on the table since he can’t give Viktor an exasperated stare over the phone. He hopes they’ve been friends for long enough that he picks up on it anyway. “He’s the best figure skater in Japan, but yeah, okay, we can go with kinda good.”</p>\n<p>“No, I meant – I think he might be the best figure skater not in Japan. I mean, uh, I mean that–”</p>\n<p>“You saw him skate alone,” Chris deduces, smirking, “Terrifying, isn’t it?”</p>\n<p>“<em>Oh my god</em>,” Viktor hisses, somehow managing to sound distressed and impressed at the same time, “What the fuck?”</p>\n<p>He straightens enough so that he’s only slouched on the table and not lying across it, “Basically, yeah. I’ve practiced with him a few times where it was just the two of us, and it’s just as crazy every time.”</p>\n<p>“He’s always been able to skate like that?” Viktor demands.</p>\n<p>Chris shrugs, “More or less. He has a heavy background in ballet, he could have done that professionally instead. It shows.”</p>\n<p>“Oh my god,” Viktor says, different this time, and Chris hangs up.</p>\n<p>He already knows Yuuri is amazing and gorgeous. He <em>really</em> doesn’t need to listen to Viktor wax poetic about it for the next hour.</p>\n<p align=\"center\">~</p>\n<p>It’s easier after that, skating in front of the others. He still gets anxious, but it’s not as bad, and he can just close his eyes and pretend he’s skating for Yura alone, and that makes it better. Yakov helps too, the old man gruff and endlessly patient. He yells at the Viktor and Yura but never at him, nor at Georgi and Mila, and he watches Yakov closely after he notices that.</p>\n<p>Celestino had always treated his students the same, insisting that he would never play favorites, but Yakov doesn’t do that. Not exactly. His students are different, so he treats them differently. Viktor is easily distracted and has to be steered on course more often than not, and Yuri’s focused, too focused sometimes, and Yakov spends more time yelling at him to get off the ice than on it. Mila gets dry sarcasm and critiques that sound like suggestions, while Georgi is given frank, straightforward corrections but only in encouraging and gentle tones.</p>\n<p>Yakov treats him differently too, and it throws him at first. He treats him almost like he treats Viktor – no yelling or corralling, but he doesn’t tell either of them what to do. He only says, “That wasn’t enough rotations,” or “Your back isn’t straight enough.” He’s not sure what it means at first, and he’d think it means Yakov isn’t interested in training him, except treats Viktor the same way. He’s obviously invested in training Viktor, so Yuuri just doesn’t get it.</p>\n<p>“Something on your mind?”</p>\n<p>He blinks and looks up, and Viktor is standing too close except that Yuuri doesn’t feel the urge to move away at all. He’s sweat soaked and his hair is sticking to his face, still beautiful and close enough that Yuuri can feel his whole body heat up. “Doesn’t it get in your eyes?” he asks, reaching up and pushing Viktor’s hair back from his face.</p>\n<p>Viktor leans into his hand, and it’s so unexpected that he freezes, so he’s standing their cupping Viktor’s cheek. “Says the man who skates all his competitions half-blind,” he teases. “You might have heard of this new invention called contact lenses?”</p>\n<p>“They irritate my eyes,” he says, and feels himself moving an extra inch closer since he can’t think of a non-awkward way to reclaim his hand with Viktor still nuzzling it. He’s not sure he wants to anyway. He’s gotten mostly used to the casual touches when they’re in public, Viktor’s hand on his waist or their fingers tangled together. But they’re not in public now, there’s no media to make a show for, but Viktor seems to be moving impossibly closer anyway.</p>\n<p>“Katsudon!”</p>\n<p>Yuuri jerks away, eyes wide and heart pounding. Yura skates over and grabs his hand, pulling him away, “Yura, what – what are you doing?”</p>\n<p>“I need some help with my spins,” he insists, addressing him but looking past him to – is he <em>glaring </em>at Viktor?</p>\n<p>Yuuri blinks, “Ah, okay, Yura. Of course.”</p>\n<p>He starts to skate away and Viktor says, “We should go on a date tonight!” Yuuri’s mouth drops open, and Viktor hastily adds, “For – for the press, right? To put in an appearance. I’ll pick you up at eight?”</p>\n<p>For their dedicated band of paparazzi. Right. “Sure,” he says, and oh god, he has to be so red right now, someone kill him and put him out of his misery. “That’s – sure, yes. Yes.”</p>\n<p>“Katsudon,” Yura hisses, tugging on his arm, and he throws Viktor a smile that hopefully doesn’t look too panicked before allowing Yura to pull him to other side of the rink.</p>\n<p align=\"center\">~</p>\n<p>Yakov holds his head in his hands. Mila is nearly as red as her hair from her attempts to not burst out laughing, and Georgi makes stabbing motion to the rink and says, “I told you! Viktor has a crush on Yuuri!”</p>\n<p>“This is <em>amazing</em>,” Mila says fiercely, “Oh my god, this is perfect.”</p>\n<p>Yakov slowly lowers his hands. He should say something, he should <em>really</em> say something, but there’s not a single bit of him that wants to get involved in his students’ love lives.</p>\n<p>“I’m going to get a drink,” he says, choosing the best course of action and walking away.</p>\n<p>Georgi calls after him, “It’s ten in the morning!”</p>\n<p>“It’s five o’clock somewhere,” Mila sing songs, and he should really work on getting students that aren’t going to give him ulcers.</p>\n<p align=\"center\">~</p>\n<p>Phichit is exhausted and gross, but Yuuri had texted asking for a skype session when he got home so he obliges, collapsing into his computer chair and calling him.</p>\n<p>Yuuri answers almost immediately, pale and frazzled. He only has a moment to worry that something’s gone seriously wrong before he says, “I’m going on a date! With Viktor! In public!”</p>\n<p>“Have you gone on dates with Viktor not in public?” he asks immediately, waggling his eyebrows.</p>\n<p>Yuuri moans and grabs the edges of his laptop, his face suddenly taking up most of the screen. “Phichit, I’m serious! What do I wear! We haven’t – the most we’ve done is go on a coffee run together so the media could snap some photos, I wasn’t expecting to have to go on a <em>date</em> with him!”</p>\n<p>“Poor baby,” he says, grinning and not even trying to sound sympathetic. “I know you’re not the type to put out on the first date, but I think this should be an exception.”</p>\n<p>Yuuri leans back, looking completely scandalized, as if Phichit hasn’t personally witnessed him leave a trail of broken hearts all over campus. He’s about to make fun of him specifically for that reason there’s a loud bang of a door slamming a wall and Yurio strolls into the screen. “What are you guys screaming about?”</p>\n<p>“Yuuri can’t decide what to wear,” Phichit answers, deciding to gloss over the part where he’s encouraging his best friend to ride Nikiforov’s dick into the sunset.</p>\n<p>“And you went to Phichit?” Yurio demands, crossing his arms. “I am <em>offended</em>, Katsudon.”</p>\n<p>He doesn’t look that offended, lips turned up the tiniest bit at the corners as he does his best to keep from grinning and only partially succeeds. Yuuri smiles back, and it’s only been a little over a week, but he seems less tense, almost – happier, even, and Phichit doesn’t know if that’s due to Yurio or Viktor or some combination of the two but he’s thrilled to see it. He misses Yuuri, but the longer he’s away the more Phichit becomes convinced that it was the right decision.</p>\n<p>“Okay, dress me then,” Yuuri says, flinging his arms out dramatically, and Yurio breaks and laughs outright. “You wouldn’t let me leave the house in something you didn’t approve of anyway.”</p>\n<p>Yurio walks to the other side of the room and flings open the closet, “I’d say you have a terrible sense of style, but that implies you have one at all.”</p>\n<p>Yuuri makes an offended face at the camera, but doesn’t protest Yurio’s assessment.</p>\n<p>“Where’s he taking you?” Yurio asks.</p>\n<p>“I don’t know.”</p>\n<p>He rolls his eyes, “Okay, well what are you doing?”</p>\n<p>Yuuri shrugs, “No clue.”</p>\n<p>Yurio pulls his head out of the closet and demands, “How the hell does that asshole expect you to dress then?”</p>\n<p>Yuuri holds up both his hands in helpless confusion, and Phichit leaves the camera’s view so they can hear him laughing but at least they can’t see it.</p>\n<p align=\"center\">~</p>\n<p>Viktor knows it’s not a real date, that Yuuri only agreed because they have a cover to maintain, but it’s the closest he’s gotten, and he spends approximately ten minutes fiddling with his hair and triple checking that his waist coat is buttoned properly before he can talk himself into getting out of the car.</p>\n<p>He’s about to knock on the door when it opens, Yura on the other side and scowling. He lowers his arm, confused. “Hi Yura. Can I come in? Is Yuuri ready?”</p>\n<p>Instead of letting him in, Yura steps outside and closes the door behind him. He begins to feel a whole new type of nervousness when Yura crosses his arms, eyed hard, and says, “I know what you’re doing.”</p>\n<p>“You do?” he asks, because he doesn’t even know what he’s doing. It’s good someone does.</p>\n<p>Yura growls, “Don’t act stupid.” He’s flattered Yura thinks it’s an act. “I see how you look at him. For the record, Katsudon is about the only one that hasn’t figured out that you’re a huge pervert.”</p>\n<p>“I wouldn’t say I’m a pervert,” he protests, “I think it’s quite natural to think that – that I’ve fallen – I mean, <em>look</em> at him Yura!”</p>\n<p>He doesn’t give an inch. “Whatever. The point is that he has enough to worry about, with France and then the Grand Prix Final, that he doesn’t need you messing with him just because you’re easily distracted and he’s pretty. Understand?”</p>\n<p>Viktor feels the first stirrings of actual offence, because he’s not <em>messing with him</em>, if anyone’s messing with anyone, it’s definitely Yuuri with him, since Yuuri’s the one that danced with him and kissed him and made Viktor fall head over heels for him and then never bothered to call. Or text. Or email. But that’s a lot of things that he doesn’t want to say to Yura at all, so he goes, “I don’t think that’s–”</p>\n<p>“Let me be crystal clear,” Yura glares, “No using Yuuri trying to protect <em>me</em> as a way to get him to have sex with <em>you</em>.”</p>\n<p>He jabs his finger into his chest for emphasis, and the Viktor winces and fights the urge to recoil. That’s going to bruise. He opens his mouth, floundering for a moment before saying, “I’m very uncomfortable right now.”</p>\n<p>Yura smiles, and it looks almost like a snarl. “<em>Good</em>.”</p>\n<p>Viktor swallows.</p>\n<p>He opens the door, kicking it open almost like a challenge. “Katsudon’s waiting for you.”</p>\n<p>“Thank you?” he steps inside, edging around Yura in a way that would probably be funny if he wasn’t genuinely worried for his safety. It’s officially the strangest and most terrifying shovel talk he’s ever been given, never mind that it’s the only shovel talk he’s ever been given.</p>\n<p>He pushes it all out of his mind as he walks to the Plisetsky’s guest room. No matter anything else, he has a <em>date</em> with Yuuri.</p>\n<p>He tries to tone down his smile and keep his heart from beating a thousand times a minute, and fails spectacularly on both accounts.</p>\n<p>Yuuri is still messing with his hair when he hears someone clear their throat. He turns to the sound, and instantly feels all the blood rush to his face, which is at least better than it rushing to some other unfortunate places.</p>\n<p>Viktor is dressed in charcoal pants that cling to him and a matching waistcoat with a sky blue button up shirt underneath. His hair is falling into his face like it always does, and his cheeks are red, probably from coming in from the cold. His lips are a wet, dark pink that Yuuri wonders if he could get even darker if he bit them. He looks at Viktor and feels such a visceral punch of <em>want</em> in his gut that he’s almost dizzy with it. “I feel underdressed,” he says, and hopes Viktor doesn’t notice how his voice cracks.</p>\n<p>“You’re not,” Viktor assures, his words almost overlapping with his own. Yuuri’s wearing the same dark skinny jeans he wore to the airport, and a soft red cashmere sweater that Yura has bullied him into wearing. Mostly because it’s not his sweater – it’s Yura’s, and it shows. It’s wrapped around him like a second skin, and the neck dips down low enough to show his collarbones. He knows it’s ridiculous to feel naked when he’s almost entirely covered, but he does. He can’t help it. He doesn’t usually wear clothing this form fitting unless he’s skating in a competition.</p>\n<p>He swallows, “Uh, okay. Should – should we get going?”</p>\n<p>Viktor blinks then jerks, like he’s coming out of a trance. “Yes! Yes, let’s go.” He offers his arm, and Yuuri can’t help but feel oddly shy as he places his hand in the crook of Viktor’s elbow, and he can’t even say <em>why</em>. He’s never dated anyone, but he’s been on dates. This is no different. This is fine.</p>\n<p>They walk out and Yura is curled up in the corner of the couch, scrolling through his phone. He looks up at they walk by and smiles at him, “Don’t forget your coat.”</p>\n<p>“Thanks,” he says, and resists the urge to reach out and ruffle his hair, knowing that Yura won’t appreciate it, at least not in front of Viktor. Then he has a small panic attack when Viktor grabs his coat off the hook and helps him into it. He snatches Viktor’s from the rack before he can, and stubbornly hold it out so he can return the favor.</p>\n<p>He just knows Yura is making a face behind them, so he waves goodbye and shoves them both out the door before he can comment.</p>\n<p align=\"center\">~</p>\n<p>It’s not until Viktor has turned the key and his car revs to life that he realizes he’s made a terrible mistake. “Oh no,” he says softly, eyes widening as he grips the steering wheel too tight. He slowly curls forward and presses his head against it.</p>\n<p>“Viktor!” Yuuri grabs his shoulder, “What’s wrong? Are you okay?”</p>\n<p>He turns his head until he can peek at Yuuri’s worried face and admits, “I forgot to plan something. I didn’t – I didn’t think of anything for us to do.” He’d been so excited about going on a date with Yuuri and trying to pick out the perfect outfit and trying not to be late that he’d completely forgotten that in order for them to go on a date he had to actually <em>plan a date</em>.</p>\n<p>He’s never telling Chris about this.</p>\n<p>Yuuri stares. He wonders if he’s just going to get out of the car and go back inside and leave Viktor out here alone to call himself ten kinds of idiot. “Is that all?” he asks finally, “Don’t worry about it. What do you normally do when you want to get noticed by paparazzi?”</p>\n<p>“Shopping?” he answers, because he’s careful to be photographed pretty frequently, the more pictures of him that show up in magazines the more he can charge for exhibition skates. Besides, even the trashy tabloids are usually pretty kind to him.</p>\n<p>Yuuri pats his shoulder and leans back in his seat, grinning. “Okay, well I don’t really have the money to buy much, but I like window shopping. Maybe I’ll find some gifts for my parents for Christmas or something.”</p>\n<p>Viktor kind of wants to kiss Yuuri right now. Well, he always kind of wants to kiss him, but – he’s not making fun of him, he’s not upset or irritated. He’s just sitting in his car, waiting for him to drive them to the mall so they can window shop. “Thank you.”</p>\n<p>“Don’t worry about it,” he says as Viktor backs them out of Yura’s driveway, “I’m easy.”</p>\n<p>He nearly hits the mailbox pulling onto the road. Is Yuuri trying to kill him?</p>\n<p align=\"center\">~</p>\n<p>Yuri finally closes the app, his plane ticket bought, and some of the worried tension leaves. For better or worse, he’s made his decision.</p>\n<p>He doesn’t want to admit it, but the house feels kind of empty without Katsudon or his grandfather in it. Visiting hours are over at the hospital, and the rink is closed. He could break in, he’s done it before, but he really doesn’t want either Katsudon or Yakov to get a call from the cops if he gets caught.</p>\n<p>He’s already half made up his mind to go for a run around his block just to get rid of some of his restless energy when there’s a knock at the door. He’s instantly suspicious – anyone who he’d open the door for has their own keys. Whoever it is knocks again, and he heaves himself off the couch. He stands on his tiptoes so he can squint through the peephole, then bangs his head against the door.</p>\n<p>It’s Mila and Georgi. He debates not answering, but they definitely know he’s there and they do have their own keys, so if he doesn’t let them in they <em>will</em> let themselves in. </p>\n<p>He opens the door scowling, “What do you guys want?”</p>\n<p>“Nice to see you too,” Mila says as Georgi pushes his way past Yuri, his arms laden with take-out. “Game night!” She hold up her hands, and Yuri notices she’s holding a small stack of board games.</p>\n<p>“What the hell,” he snarls, then the smell of the food Georgi is unpacking on his coffee table hits him. “Is that from Suliko?”</p>\n<p>“Your favorite,” Georgi winks, “Now are you going to stand their pouting, or are you going to get some plates?”</p>\n<p>He wavers. Mila is holding Monopoly. He <em>loves</em> Monopoly, and they don’t. They never agree to play it with him.</p>\n<p>Even as annoying as Georgi and Mila are, a night spent eating and playing with them is probably better than spending the night home alone.</p>\n<p>“Whatever,” he rolls his eyes, but goes to the kitchen to get some plates. He pretends he doesn’t see them high five as soon as his back is turned.</p>\n<p align=\"center\">~</p>\n<p>They’re being trailed by a few very unsubtle paparazzi, but they’ve stayed a respectful distance away. They also keep getting stopped by fans wanting selfies, and almost all of them recognized Yuuri as well and wanted a photo with him too. He supposes if nothing else pretending to date Viktor might up his popularity and make him more appealing to sponsors.</p>\n<p>He buys a delicate nesting doll in varying shades of green for his mother, and then a similar one in pink for Minako. Viktor had insisted on carrying them, then dragged him into a high end menswear store, and started piling things into his arms.</p>\n<p>“Should I be insulted that everyone in my life feels the need to dress me?” Yuuri asks, amused.</p>\n<p>“No,” Viktor says, critically eyeing two shirts that to Yuuri look like the exact same shade of aquamarine. “Well, maybe a little. You spend too much time in sweatpants and t-shirts.”</p>\n<p>“I spend most of my time training or studying,” he points out, and he’s definitely had this conversation with Phichit before.</p>\n<p>Viktor puts one of the shirts back on the rack. Yuuri can’t tell which one. “It’s practically <em>criminal</em> not to dress your body up. It’s your body, it’s meant to be decorated. Like your home!”</p>\n<p>The only decorating he’s ever done was hanging up an obsessive number of posters and photos of Viktor. Which is a horrible thought to have, because that leads to him thinking of decorating his <em>body</em> with Viktor, and thank god Viktor has his head buried in a rack of slacks because his entire face is burning.</p>\n<p>“Here!” he dramatically holds up a pair of dark red pants, “Perfect!”</p>\n<p>Yuuri hopes he doesn’t expect him to wear that with aquamarine shirt. “You know I can’t afford any of this right?”</p>\n<p>“Dress up is fun,” he pouts, “Won’t you try them on for me?”</p>\n<p>All this blood rushing to his face so often can’t be healthy. “Y-yeah. Okay.”</p>\n<p align=\"center\">~</p>\n<p>This entire thing is incredibly self-indulgent, and also probably morally questionable, but Viktor is having the time of his life. Yuuri lets him shove him into a dressing room and call out instructions about what to pair together.</p>\n<p>He chose a few things that he wasn’t sure about, so he’s sure at least some of the outfits are going to look silly. Not that he’ll <em>tell</em> Yuuri that, but some of them inevitably aren’t going to look great because that’s how clothes and people who wear clothes work.</p>\n<p>He’s a fucking idiot.</p>\n<p>Yuuri looks absolutely delicious in everything.</p>\n<p>At first he thinks he’s not just looking at him objectively, since he’s certain Yuuri could be wearing a potato sack and Viktor would still want to lick his face. But considering the downright filthy glances the store attendant keeps giving his date, he figures he’s not alone in his assessment.</p>\n<p>“I look ridiculous,” Yuuri complains, and Viktor looks up from his phone to assure him he doesn’t, but he gets one look at Yuuri and nearly swallows his tongue.</p>\n<p>“Uh,” he starts, and can’t finish, because he’s forgotten how to speak Russian, never mind English.</p>\n<p>Yuuri pushes his hair back, rolling his eyes. The store attendant walks into the rack of clothes, and scrambles to keep it from crashing to the ground. Viktor can’t blame him. “I wouldn’t wear this on the <em>ice</em>, forget the street. I look like a Christmas ornament!”</p>\n<p>“You can be the star on top of my tree,” the attendant mutters in Russian, clearly not meaning to be heard. Viktor would tell him that doesn’t even make sense, except the man is managing to actually form words, so he’s doing better than Viktor.</p>\n<p>Yuuri’s wearing the slim dark red pants, clinging perfectly to the curve of his ass and making his long legs look even longer. Then it’s a simple black t-shirt, but on top of that is a black silk-wool blend blazer with a floral pattern embroidered in gold thread. It hugs him perfectly, and clothes off the rack don’t fit anyone perfectly, except Yuuri Katsuki, apparently. It emphasizes his slim waist and broadens his shoulders, makes the eye focus on the swell of his muscles as he breathes and the gold thread shimmers with every shifting movement.</p>\n<p>“You need that,” he croaks out finally, his mouth dry.</p>\n<p>Yuuri huffs and crosses his arms. Viktor thinks he might whimper. “These are way too expensive – I definitely can’t afford any of this.”</p>\n<p>“You need it,” he repeats dumbly, and when Yuuri’s eyes narrow in the beginnings of true irritation he adds on, “I’ll buy it for you.”</p>\n<p>He flushes, “Viktor, no! You don’t need to do that. I look silly, I don’t need any of this stuff.”</p>\n<p>This isn’t a gift for Yuuri, it’s a gift for himself because he’s a bad, bad man. “I insist.” Yuuri opens his mouth, hands on his hips, and Viktor interrupts him before he gets a chance to say anything, “You can argue with me now, and I’ll smile and agree, and then I’ll come back and buy it and drop it off at Yura’s. Or you can say ‘Thank you Viktor’ and let me buy it now to save myself a trip tomorrow.”</p>\n<p>Yuuri is unamused. Usually a faintly disapproving look from him is all Viktor needs to question his actions, but he’s made up his mind. Yuuri looks <em>fabulous</em> in it in a way that Viktor could never pull off. For all of his shyness, Yuuri does ‘flashy’ so much better than him. Whenever he tries to wear something with sparkle he looks like a disco reject. Yuuri looks like a work of art.</p>\n<p>Granted, he <em>always </em>looks like a work of art, but still.</p>\n<p>“Thank you, Viktor,” he says finally, uncrossing his arms.</p>\n<p>“You’re very welcome,” he says generously.</p>\n<p>They’re leaving the store, Viktor having insisted, on carrying their bags, and Yuuri’s hand tucked into the small of his elbow when his stomach grows. Viktor kind of wants to die, but Yuuri just laughs, “Dinner?”</p>\n<p>“Please,” he smiles down at him, and sees a camera flash out of the corner of his eye. “French?”</p>\n<p>Yuuri jerks his head to the paparazzi, “Do you think we’ve put on enough of a show?”</p>\n<p>Viktor’s heart sinks. He doesn’t want this date to end, but it would be unfair to lie just to spend more time with him. “I think they’ve gotten plenty of photos.”</p>\n<p>“Good,” Yuuri says, “because I owe you some katsudon. Let’s go the market to get the ingredients, and I’ll make it for you. Do you mind if we go to your place? I don’t want to wake up Yura.”</p>\n<p>This is the best day of his life. He hopes he doesn’t look too much like a besotted idiot, but considering the rapid flashes of cameras going off he must fail completely. “That sounds perfect.”</p>\n<p align=\"center\">~</p>\n<p>Mila’s eye flick to the clock. It’s late, and Yuuri still isn’t home.</p>\n<p>Yura is grinning with devilish delight while Georgi looks at what remains of his properties and openly weeps.</p>\n<p>Well, it’s not the first night they’ve spent on Yura’s couch, and she doubts it’ll be the last. Besides, they figured this might happen, and there’s a bag in her car with overnight things for both of them, plus their practice outfits for the next morning. Not that they’ll tell Yura they were planning to stay over – he’ll only get offended and insist he doesn’t need to be babysat.</p>\n<p>She looks down at her own holdings and tries to keep her shoulders from slumping. She’s <em>good </em>at Monopoly, but she’s almost as bad off as Georgi.</p>\n<p>Yura is a monster.</p>\n<p align=\"center\">~</p>\n<p>This is hands down the best date Yuuri has ever been on, and it’s not even a real date. He can’t decide if that’s sad or pathetic, so he just focuses on cooking. Viktor pours them each some wine, and on one hand he doesn’t usually drink alcohol so close to a competition, but on the other hand Viktor simultaneously makes him feel safe and comfortable and nervous enough to crawl out of his skin all at once, so he decides a glass or two won’t hurt. Besides, it takes roughly a dozen shots of hard liquor to get him to tipsy, so some wine won’t do much.</p>\n<p>“Your mother taught you this?” Viktor asks, sitting on the section of the counter that Yuuri hasn’t commandeered.</p>\n<p>He nods, “I’ve been helping out in the hot springs since I was a kid. My older sister, Mari, was awful at cooking. I mean, she still is, but she can do simple stuff now. I picked it up pretty quick, so if I wasn’t in school or on the ice, I was in the kitchen.”</p>\n<p>“School,” Viktor says, and he sounds upset. Yuuri looks up at him, confused. “Aren’t you supposed to be in school?”</p>\n<p>“I am in school,” he says slowly, feeling as if he’s missed something here.</p>\n<p>Viktor shakes his head, “No, I mean, right now. Like – <em>right now</em>. It’s the middle of the semester!”</p>\n<p>H looks so worried that Yuuri knows it’d be rude to laugh at him, but he almost does it anyway. “Viktor, it’s competition season. I don’t take classes in the fall, only in the spring and summer. Otherwise I’d probably give myself a heart attack from stress.”</p>\n<p>“Oh,” now he looks embarrassed, and the flush across his face makes Yuuri want to kiss his nose. “Right. That makes sense.”</p>\n<p>He nudges Viktor’s knees with his hip, “It’s about done, do you want to grab some bowls?”</p>\n<p>He hops down and does just that. “It smells great.”</p>\n<p>“Well, I hope it tastes that way,” he says, accepting the bowl from Viktor and trying not to grin too wide when their fingers brush.</p>\n<p align=\"center\">~</p>\n<p>Viktor automatically goes to his couch before remembering he’s not alone and he has a kitchen table that they can use. He doesn’t sit their normally, because eating a meal at a table meant for four when he’s alone just makes him feel – well, alone. He shifts to stand and sit at the table like a proper adult, but before he gets the chance Yuuri sits beside him, “Did you want to watch a movie?”</p>\n<p>Dinner and a movie, in his house, away from the reporters and everyone else. It’s almost like a real date. “Yes,” he says, mouth dry.</p>\n<p>“Great,” he says, “you pick. It’s not like I’ll be able to understand any of it anyway.”</p>\n<p>“I’ll translate,” he promises, tossing Yuuri the remote.</p>\n<p>“The channels are in Cyrillic,” he protests, “I can’t read this!”</p>\n<p>Viktor laughs at him, and keeps at it until he takes his first bite of katsudon. He goes still and his eyes widen.</p>\n<p>Yuuri leans forward, concerned. “Is something wrong with it? If you don’t like it–”</p>\n<p>He shakes his head, and swallows. “This,” he says reverently, “is the best thing I’ve ever eaten.”</p>\n<p>Yuuri grins, “I’m glad you like it.”</p>\n<p>“No, you don’t understand,” he takes another bite and looks at his bowl in disbelief that anything can taste this delicious, “this is the <em>best thing I’ve ever had in my mouth</em>.”</p>\n<p>He only realizes what he’s said after he’s done it, but luckily Yuuri is just laughing at him, a pleased little crinkle at the corner of his eyes. “It’s my mother’s recipe. I’ll be sure to tell her.”</p>\n<p>Viktor hopes he doesn’t phrase it exactly like he had, but can’t be too bothered either way. Yuuri is in his home, having made him delicious food, and is sitting on his couch with him, content as Viktor flicks through the on-demand section for something worth watching and hopefully in English.</p>\n<p>Halfway through the movie, Yuuri falls asleep and his head droops down to rest on Viktor’s shoulder.</p>\n<p>Viktor can’t remember the last time he was happier than he is right now.</p>\n<p align=\"center\">~</p>\n<p>Yuri’s alarm goes off the next morning, and when he wakes up he remembers the night of good food and absolutely destroying his rinkmates at Monopoly, and has to spend a good minute grinning into his pillow like a little kid.</p>\n<p>He gets himself under control, and decides he’ll even make coffee for everyone before they have to head off to practice. He likes the caffeine, but can only tolerate it with a frankly disgusting amount of sugar. Katsudon and Georgi are the same, while Mila drinks it black like her soul.</p>\n<p>All his good cheer disappears instantly when he passes by Katsudon’s room to see his door open and no one inside, the bed made and unused.</p>\n<p>He stares at it in betrayal. “Viktor,” he growls viciously, “<em>you slutty motherfucker</em>.”</p>\n<p align=\"center\">~</p>\n<p>Mila is, at first, incredibly irritated at Yura for waking her up by pushing her off the couch onto the ground. Then he shoves a heavenly smelling coffee into her hand and says “Katsudon didn’t come home last night. Drive me to Viktor’s so we can pick them up before practice.”</p>\n<p>Yura doesn’t end that sentence with <em>so I can roundhouse kick Viktor in the face</em>, but considering the force of his scowl it’s definitely implied. “Absolutely,” she says. She reaches up to the armchair that Georgi is sleeping in, grabs onto his ankle, and yanks him down to the floor with her.</p>\n<p>He wakes up screaming, realizes where he is, and curls up on the carpet and falls back asleep immediately.</p>\n<p>Yura stares. “Is he always like this?”</p>\n<p>“Since we were kids,” she says with more fondness than she’d be comfortable showing if he was awake enough to hear her.</p>\n<p>“Right,” he says, looking between them oddly. “I’m going to get changed. Let me know when you’re ready.”</p>\n<p>With a minimal amount of affronted whining from Georgi, they’re on the road a short while later. Yura sits with his arms crossed the whole time, staring out the window like the route from his to Viktor’s home isn’t one he’s traveled a hundred times before. He’s out of the car almost before Mila has had a chance to park, and then he’s taking the stairs two at a time up to Viktor’s floor. She’s not willing to miss a second of this, so she’s right behind him. Georgi follows at a more sedate pace, his innate need for drama battling with his overwhelming hatred of waking up and coming out the loser.</p>\n<p>Yura unlocks the door and slams it open, “VIKTOR!”</p>\n<p>There’s a thump and twin grunts of pain. They both turn to the source of it, and see Viktor and Yuri splayed out on the floor and blinking sleepily, both having fallen from the couch.</p>\n<p>“Glad we’re all starting today the same way,” Mila says, and can’t help but be disappointed in their appearance. They’d clearly fallen asleep in their clothes – actually, is Yuuri wearing Yura’s sweater? – and Yuuri has indent makes on his right cheek from sleeping in his glasses.</p>\n<p>It doesn’t look like they got up to anything interesting last night.</p>\n<p>Yura must notice the same thing, because his shoulders relax and most of his angry energy bleeds off of him. “Katsudon. You didn’t come home last night.”</p>\n<p>Yuuri and Viktor stand up from off the floor, and Yuuri’s whole demeanor is contrite. “Sorry, Yurokchka. We were watching a movie and must have fallen asleep. I didn’t mean to.”</p>\n<p>“Whatever,” he shrugs, but the last of the tension leaves his frame when Yuuri steps from Viktor’s side over to his, and he smiles up at Yuuri seemingly in spite of himself. “You’re late for practice.”</p>\n<p> “We’re all late for practice, actually,” Georgi says, leaning against the doorframe.</p>\n<p>That’s a good point. Mila considers sending Yakov a text, but decides against it. He’s too high strung. It’ll be good for him. She’s only looking out for his long term health, really. He’s so lucky to have such caring and considerate students.</p>\n<p>Yuuri’s face drains of color. Viktor just keeps fiddling with the edges of his wrinkled shirt and trying not to look at anyone. “Oh my god,” he says, “oh no, okay, this is fine. I just need to swing by Yura’s to get my things–”</p>\n<p>“I grabbed your skates,” Georgi volunteers, then scratches his chin. “Hadn’t considered that you might need anything else. Sorry Yuuri.”</p>\n<p>“You can borrow something to wear from me,” Viktor volunteers instantly.</p>\n<p>Yura scowls. Mila doesn’t laugh, but it’s a near thing. Viktor probably thinks he’s slick, but it’s obvious to anyone with eyes that what he wants more than anything is to see Yuuri in his clothes. “Don’t be ridiculous,” she says, “anything you have would be too big. I have an extra set of practice clothes I keep at the rink he can borrow. Now go get ready so we can leave.”</p>\n<p>Viktor slinks away, trying to hide that he’s pouting and failing miserably. Yura pokes Yuuri in the side, “Can we work on my transitions today? I was watching my practice video and they’re still not smooth enough.”</p>\n<p>“You’re too hard on yourself,” he says, which isn’t wrong, Mila thinks, but is rich coming from him. “But yeah, of course. Whatever you want.”</p>\n<p>Yura positively beams, and it’s so strange to see him looking and acting his age. He only does it around Yuuri. Mila finds it adorable, but knows if she ever said that aloud Yura would flip.</p>\n<p>“Ready!” Viktor calls, stepping out in his standard sweatpants and t-shirt. He flashes his million watt grin at Yuuri, who turns red and scratches his nose in an attempt to hide it. Yura is back to scowling.</p>\n<p>She’s so happy Yuuri came to stay with them. This is the most fun she’s had possibly ever.</p>\n<p align=\"center\">~</p>\n<p>Chris thinks he’s a good person. Not perfect, of course, but kind enough, a decent sort of guy. Not cruel or particularly malicious. Arrogant for sure, but he’s <em>earned </em>it, so it’s hard for him to think of it as a vice. Which is probably why it is one, actually.</p>\n<p>So as he stares at the ringing phone his coach is holding out to him, he can’t think of what he could have done to deserve this hell. Surely his past self was some sort of serial killer or tax evader or someone who was rude to waiters.</p>\n<p>“Well?” Josef asks impatiently, shaking the phone. “Are you going to answer it?”</p>\n<p>For his sins, whatever they may be, he is the receptacle for all of Viktor Nikiforov’s many and varied emotions.  </p>\n<p>He takes the phone and answers it, preemptively pinching the bridge of his nose to stave off the headache he’s sure will come. “I don’t suppose you’re calling to say you finally banged Yuuri? I saw the photos of your fake date last night. He looked good enough to eat.”</p>\n<p>Viktor tries to sputter in indignation and sigh dreamily at the same time, and it ends up coming out as a garbled gasp. Chris <em>must</em> have been someone who double parked in a past life. It’s the only explanation. “I think I’m in love.”</p>\n<p><em>No shit</em>, Chris wants to say, but doesn’t, because he’s a good person, damnit. “So you didn’t sleep together?”</p>\n<p>“We technically slept together? We fell asleep on my couch last night,” and there’s that dreamy sigh again. Chris wants to stab himself in the eye.</p>\n<p>“Viktor, for the love of god, <em>make a real move</em>. Put us all out of our misery. Throw him over your shoulder and take him to bed.”</p>\n<p>Viktor makes a sound of scandalized affront at the suggestion, like Chris doesn’t know that he’s almost certainly jerked off to that very thought. “I just can’t tell if he’s actually interested in me, yo-“</p>\n<p>Chris hangs up and would throw his phone onto the rink in frustration if he didn’t have to pay for it’s replacement. It’s almost worth it regardless, but only almost. “I’m a good person, right?” he asks his coach.</p>\n<p>Josef’s eyes flicker to the side, halfway to an eyeroll he won’t let himself complete, which is about the maximum amount of expression he shows in any of Chris’s personal affairs. “You’re a good <em>skater</em>, although that won’t last if you don’t get back to practice.”</p>\n<p>A serial killing, tax evading person who was mean to waiters and double parked. It’s the <em>only</em> reasonable explanation.</p>\n<p align=\"center\">~</p>\n<p>Georgi is pretty comfortable in the knowledge that’s he’s a straight guy. He likes girls. Probably too much, falling in love too fast and too hard with the idea of a woman rather than the woman herself. Hey, he’s self aware, if not willing to actually do anything about it. The high before the fall is far too exhilarating to give up.</p>\n<p>Point being, he is a man who is attracted to women.</p>\n<p>But even he has to do a double take when Yuuri steps onto the ice. Because Georgi may be straight, but he is an appreciator of <em>beauty</em>, and Yuuri’s ass in Mila’s leggings can hardly qualify as anything else. They’re skintight, molding to his every muscle, and Mila’s crop top almost looks better on Yuuri than it does on her, although Georgi will never tell her that. Then again, judging by the appreciative way she’s eyeing Yuuri, he thinks she might agree with him.</p>\n<p>Viktor is staring, bug-eyed and mouth open. He skates straight into the edge of the rink, and then has to flail to grab onto it to keep on falling over. Yura can’t seem to decide between being amused or irritated. Yakov looks like he regrets ever getting involved with figure skating in general, and agreeing to coach any of them in particular. He looks like that a lot.</p>\n<p>“Don’t you get cold in this?” Yuuri asks, ineffectually trying to tug the top lower so that the majority of his torso isn’t on display.</p>\n<p>Georgi thinks Viktor actually whimpers.</p>\n<p>“If you’re cold, then you’re not training hard enough,” she says decisively, then claps her hands together, “Chop, chop!”</p>\n<p>Yuuri rolls his eyes and goes to the middle of ice, Yura trailing behind him. Viktor still looks like he’s in the middle of having a heart attack.</p>\n<p>Georgi skates behind Mila and stoops so he can rest his chin on her shoulder. “You are a very bad woman.”</p>\n<p>“You have always known this,” she leans her head against his for the briefest of moments before darting away and leaving him scrambling not to fall flat on his face.</p>\n<p>Well, she’s not wrong.</p>\n<p align=\"center\">~</p>\n<p>It’s the night before he has to leave for Paris, and he and Yura are waiting outside for their cab after a visit with Yura’s grandfather. It’s snowing, and Yura is tucked under his arm and up against his side for warmth. “Are you nervous?” Yura asks.</p>\n<p>He blinks, looking down. “Not really,” he says, and is surprised by the honesty of it. He has the worst nerves right before he steps onto the ice, but two days before a competition he’s usually gotten to the point where he’s jittery, and pacing, and he can’t focus on anything. But instead he’s trying to think of what to make for dinner, and if he should double the recipe so Yura doesn’t just eat take out with his rinkmates while he’s gone, and replaying every time Viktor has smiled at him in the past week and wondering if he places in France if Viktor will smile at him when he gets back.</p>\n<p>He knows it’ll just be for show if he does, but he wonders if Viktor will be waiting for him at the airport when he comes back, just like Yuuri was for him. He spends an awful lot of time wondering about that one, actually.</p>\n<p>He’s not calm. He’ll never be anxiety free, but this is as close to stable ground as he’s known since he was a kid.</p>\n<p>“Good,” Yura says, satisfied, and snuggles even more into Yuuri.</p>\n<p align=\"center\">~</p>\n<p>Phichuit’s worried face fills the screen of his laptop, but Yuuri can’t bring himself to feel more than a light undercurrent of anxiety – well, about this one specific thing, at least. “I really don’t know what he’s planning to do,” his friend says, and he sounds agonized about it.</p>\n<p>Yuuri shakes his head, surveying the things he has laid out on his bed, triple checking that he has everything he needs for France. He has to leave to catch his flight in a few hours. “Don’t worry about it. I knew that this might happen.”</p>\n<p>“If you’d just <em>talk</em> to him,” Phichit tries, “he may be a loud drunk, but he’s a good coach, and he cares about you. But you just left, and didn’t tell him why–”</p>\n<p>“I told him it was a family emergency, and I told him to trust me,” he says, turning back to the camera to raise an eyebrow. At Phichit’s disapproving look, he sighs and admits, “I’ve tried calling a couple of times, but he won’t answer.”</p>\n<p>Phichit moans in despair and buries his face in his hands. Yuri can’t help but crack a grin. He knows this is serious, he knows that he should be panicking and worrying about the fact he may be performing at the Trophee Eric Bombard without a coach, and he is worried, there’s a pit of unease in his stomach. But, even if that’s the case – well, he knows it won’t be a disaster.</p>\n<p>He feels more comfortable with his routine than he ever has. Worst case scenario, he’s almost certain that he can get Yura to convince Yakov to act as his coach for the rest of the season. Besides, Nikolai has another back surgery scheduled. It looks like he’ll make a complete recovery from all of this, but a large chunk of that is that he’s not rushing to get out of the hospital to take care of his grandson. Because he doesn’t have to, since Yuuri is here to make sure that Yura doesn’t stress himself into an early grave.</p>\n<p>So coach or no coach, he’s staying right where he is. He’s made up his mind, and he knows he’s making the right choice.</p>\n<p>Yuuri had forgotten how determined he could be, how clear everything was for him once he decided exactly what it was that he wanted. This has all been a very good reminder.</p>\n<p>When he looks back at the screen, Phichit is peeking at him through his fingers and smiling. “What?” he asks.</p>\n<p>“Nothing. It’s just – you look really happy, Yuuri. Maybe Russia is good for you.” He lowers his hands and his soft expression melts into a wicked smirk. “Or at lease <em>something</em> in Russia is good for you. To you. <em>In</em> you.”</p>\n<p>Yuuri slams his laptop shut, face burning.</p>\n<p align=\"center\">~</p>\n<p>Yuri had already told his grandfather and Yakov was he was planning on doing. However, he remembers he deliberately hadn’t told the most important person when Katsudon comes out of his room with his suitcase, sees Yuri waiting for him with his duffle swung over his shoulder, and only looks confused. “Yurochka?”</p>\n<p>“We better hurry up if we don’t want to miss our flight,” he says, “You take forever to pack, we’re going to be there for like four days, what could you possibly be bringing?” He frowns, “Maybe you’re spending too much time around Viktor. He always overpacks.”</p>\n<p>Katsudon’s mouth drops open, then he closes it. “Yura, what are you talking about? You can’t come with me, you’re in the middle of training, and the last thing you need is to interrupt that worrying about me–”</p>\n<p>“You’re joking right?” he crosses his arms and raises an eyebrow. “Katsudon, you dropped everything and flew across the country to stay with me when I needed you. You left your coach behind, you friends, everything you know to move to a place where you don’t even speak the language. You did it even though you’re in the middle of competition season.”</p>\n<p>He rubs the back of his neck, “That’s different.”</p>\n<p>Yuri scowls and marches forward to jab Katsudon in the chest. “It is <em>not</em>. This friendship is a two way street, and if you think I’m going to let you go to France and compete alone you’ve lost your mind. You’re my friend. You won’t leave me to face my problems alone, and I won’t leave you to face yours alone either.”</p>\n<p>He has his plane ticket, and he booked a hotel room, there’s absolutely nothing Katsudon can do to stop him. He’s one hundred percent prepared to be supportive against Katsudon’s will, but instead Katsudon pulls him forward and gives him a crushing hug. “Thanks,” he breathes.</p>\n<p>“This is what friends are for,” he says confidently, hugging back and burying his face in Katsudon’s shoulder to hide how terribly relieved he is that he’d made the right call.</p>\n<p align=\"center\">~</p>\n<p>The flight is short, or at least shorter than it would have been from Detroit, and he’s almost not exhausted from sitting in a plane doing nothing. He’s thankful they both just brought carry-ons so they don’t have to wait in baggage claim.</p>\n<p>“Yuuri! Over here!”</p>\n<p>Both he and Yura turn to the sound of the voice, and he breaks out into a big grin and drops his bag so he can run to meet her. “Sara!” He picks her up and spins her, lifting her by her ass just to piss Michele off. When he puts her back on her feet, she gives him a quick hug and a kiss on each cheek. “What are you doing here? I didn’t order a welcome committee.”</p>\n<p>“Well, you’re not very welcome,” Michele hisses, angrily taking the bags from Yura’s hands. Even when he’s furious he still has to act like a gentleman. It’s one of the things Yuuri likes best about him. “Stop touching my sister.”</p>\n<p>He looks down at Sara, who’s still attached to his arm. “Do you want me to stop touching you?”</p>\n<p>“No,” she beams, and Michele sighs.</p>\n<p>Yuuri tugs Yura forward with his free hand, and tries not to notice how tense and uncertain he’s become. “Yura, these are my friends, Sara and Michele Crispino,” Michele huffs at being called his friend, but only holds Yura’s duffle a little firmer. “Guys, this is Yuri Plisetsky.”</p>\n<p>“We know!” Sara says, “I can’t wait until you start competing at the senior level, it’s going to be glorious.”</p>\n<p>“I can,” Michele says, his scowl slipping off his face when he addresses Yura, “You’re crazy good, I’m going to lose my place on the podium once I start skating against you.”</p>\n<p>Yura looks stunned, and he gets that pleased little smile on his face that he usually only has around Yuuri. “Thanks.”</p>\n<p>“Seriously, how did you even know when I was arriving?” Yuuri asks as they make their trek out of the airport.</p>\n<p>“Mila told me, she said she didn’t want you getting lost,” she grins.</p>\n<p>Yuuri rolls his eyes, “I have been to Paris before.”</p>\n<p>“Oh, I remember,” she says, and he hopes she doesn’t go into detail because Yura is <em>right there</em>, and Chris hadn’t been there that time to drag him out to the clubs, but Sara had been and it had been <em>brutal</em>. He’d woken up with a massive hangover, half his clothes missing, and about a dozen different phone numbers written on his abs.</p>\n<p>Going out with Sara is even more dangerous than going out with Chris.</p>\n<p align=\"center\">~</p>\n<p>Yakov has been unsuccessfully trying to get ahold of Celestino since Yuuri came to stay with Yura. He knows that if any of his students tried to pull that kind of shit on him he’d be <em>furious</em>, so he does understand the man’s radio silence, at least in part.</p>\n<p>However.</p>\n<p>Yuuri has enough raw talent to make Viktor weep (literally, the last time Yuuri had gone through his full routine Vitya had actually started crying) and he thinks that type of skill should afford Yuuri enough room to make some bad decisions. God knows Vitya makes enough of them.</p>\n<p>Considering his inability to confirm whether or not the boy’s coach will even show up, he feels completely justified and booking his own ticket to Paris. Yura may be great for the boy’s confidence, but he’s not a coach. He doesn’t <em>tell</em> anyone that’s what he’s doing, he has a reputation damnit, so instead he just says that since Yura isn’t going to be there they can all have the weekend off.</p>\n<p>Yakov is showing up the day the competition starts, so that he doesn’t have to leave his other students alone for more than a couple days, considering it’s in the middle of their competition season as well and Yuuri isn’t technically his student.</p>\n<p>This ends up being a completely worthless effort.</p>\n<p>He shows up to the boarding area the same time as Mila and Georgi. They both look surprised to see him. “What do you two think you’re doing?” he scowls.</p>\n<p>“Uh,” Georgi winces, “we thought it’d be a good idea check out the competition in person?”</p>\n<p>Mila glares at him, “Never mind us, what are <em>you</em> doing?”</p>\n<p>Yakov scoffs and sputters, trying to come up with an explanation that isn’t as sappy as the truth.</p>\n<p>“FRIENDS!” a voice they all know well crows, and all three of their shoulders slump. Viktor beams and walks over, dragging an unnecessarily large pink suitcase behind him. He throws an arm around Yakov and Georgi’s shoulders. “What are you all doing here? Are you coming to see me off?”</p>\n<p>“Yakov,” Georgi says, absolutely delighted, “you really have taken our little pork cutlet bowl under your wing, haven’t you?”</p>\n<p>“So sweet,” Mila simpers, smirking like they’re clearly aren’t all here for the same reason, as if he’s any more sappy or invested than the rest of them considering they all individually decided to fly to Paris and support Yuuri. “How uncharacteristically caring and sensitive of you.”</p>\n<p>Yakov wants to die.</p>\n<p align=\"center\">~</p>\n<p>Yura has the hotel room next to his, and he must have talked to Phichit to get his flight and room details. When he next talks to his best friend, he’ll be sure to yell at him for not telling him. Then again, it’s entirely possible he thought that Yuuri had known since it’s not like Yura to keep secrets from him.</p>\n<p>He’d booked this room with Celestino before he’d left Detroit. He’s disappointed when he checks into an empty room, but not terribly surprised. Celestino will either show up, or he won’t, and if he doesn’t he and Yuuri will have to make a statement to the press saying they’ve gone their separate ways. If they don’t, the rumor mill and the few gossip rags that follow figure skating will go absolutely wild.</p>\n<p>This is, he decides, all a tomorrow problem. He’s going to sleep now so he can wake up early enough to beat everyone to the rink tomorrow. Yura’s still awake, but he trusts Sara and Michele not to get him into too much trouble.</p>\n<p align=\"center\">~</p>\n<p>Yuri had spent the whole night hanging out in a restaurant down the street from the hotel with the senior skaters, and at first he’d been horribly self conscious and snappish, because he was obviously the youngest one there and he only knew <em>of</em> all these people, he didn’t actually know any of them even if he’d seen them with his rinkmates before.</p>\n<p>But Michele had stayed at his side the whole night, guiding him into conversation and cutting anyone off if they began to say something about his age or anything else. He’d relaxed after that, and it had actually been really nice, what he imagines being a real senior skater will be like, what being appreciated for his skills will feel like, when people talk to him again and don’t just shut him out and ignore him because of jealousy.</p>\n<p>He doesn’t really have any friends among the junior skaters. There’s Phichit now, but they haven’t competed at the same event since they become friends, and having another skater to text and joke with who was closer to his age was nice, but it wasn’t the same as the easy camaraderie that other skaters seemed to share at competitions, going out together and sharing in-jokes and not letting rankings and loss get in the way of friendships.</p>\n<p>He’d started skating because it was fun. Because it made him happy. He can’t wait until he can share that part of him again with someone else besides Yuuri, and that night out with the senior skaters gives him a taste of that.</p>\n<p>This all means he’s in a <em>fantastic</em> mood when he meets Yuuri down at the ice in the cool grey of morning, even if he’s only running on a couple hours of sleep. He’s not competing today, so he’s not bothered, and Yuuri looks well rested. As he should, he’d slept for more than ten hours. “Ready?” he asks.</p>\n<p>Yuuri beams at him and ruffles his hair. “Ready.”</p>\n<p align=\"center\">~</p>\n<p>Celestino knows Yuuri. He wants to talk to him alone before just showing up in their hotel room so he figured waiting until his student was practicing was his best bet. When he shows up at the rink before most people have even contemplated being awake, he knows exactly what he’ll find.</p>\n<p>He’s wrong.</p>\n<p>He’s been coaching Yuuri for years, and he knew he was good. He wouldn’t have kept training him if he wasn’t. That said, he seems to have stalled out the past couple of years. Yuuri’s mediocre is still leagues above most people’s best, so even as he stagnated and got frustrated with his skills, he easily maintained his place as the best figure skater in Japan, he kept qualifying and usually even placing in the Grand Prix events. But Celestino had given up hope that Yuuri would ever break into something <em>more</em>.</p>\n<p>He’s not a man who makes many mistakes. This was clearly one of them.</p>\n<p>Yuuri is performing his routine, smooth and elegant and looking more like he’s flying than he’s skating. There’s no music that Celestino can hear, but he choreographed the piece, helped Yuuri place his step sequences. Even with the alterations, he can tell that Yuuri is perfectly synced to every beat of the song. Plisetsky is there, sweat soaked so he was skating earlier, but now he’s only watching Yuuri in plain wonder as he dances on the ice.</p>\n<p>“Beautiful,” someone says, a warm hand clapping him on the shoulder.</p>\n<p>Celestino raises an eyebrow and glances to his side to see Yakov. He quickly glances around the rink, but they’re the only ones there, and mostly hidden away out of sight. “It seems your coaching has paid off,” he says.</p>\n<p>Yakov snorts and shakes his head, “Wasn’t me, I’m afraid. I really didn’t do much. That’s all Yuuri. Well,” he amends, “Yura helped.”</p>\n<p>Celestino rolls his eyes and looks back to Yuuri. “I wanted to talk to him about what we should do going forward. But – damn, look at him. If he skates like this out there, there’s no way he won’t take gold.”</p>\n<p>“Yes,” Yakov agrees, “wait until after the short skate, at least. Whatever you’ve decided.”</p>\n<p>“It’s not just me that has some decisions to make,” he says, and he should go before he’s noticed, but watching Yuuri perfectly execute jumps he’d barely been able to land before is mesmerizing. “We both have to decide this is over.” He looks behind him to his bag and slumps, “Also, if I’m not letting him know I’m here yet, then I can’t go to our room. What do you think the chances are there’s another room available?”</p>\n<p>“None,” he says, “Don’t worry about it. You can take Viktor’s room.”</p>\n<p>Celestino raised an eyebrow, “Viktor’s here?”</p>\n<p>“Well,” Yakov says with complete seriousness, “they are dating.”</p>\n<p>He elbows him in the ribs, and takes some satisfaction from his hiss of pain. “Don’t try that crap with me. If Yuuri and Viktor were actually dating, he wouldn’t have flown to Russia and paraded around in front of paparazzi. He’d have hid his identity from the press until they were married, possibly until they died.”</p>\n<p>Yakov rubs at his chest, “Well, they might be dating, I can’t keep up honestly. They spend so much time making cow eyes at each other who knows what they’re doing. They certainly don’t.”</p>\n<p>Celestino coughs to mask his laughter, and they both have to duck behind the bleachers when Yura looks back to where they’re hiding, confused. “Let’s get out of here before we get caught,” Celestino mutters, grabbing Yakov by the shirt collar and dragging him out behind him.</p>\n<p>“You’re much more calm than I anticipated,” Yakov admits.</p>\n<p>Celestino stares, “When am I ever <em>not</em> calm?” The only time he was anything other than perfectly level was when he was drunk. Granted, he was drunk a lot, but even then he wasn’t exactly prone to hysterics.</p>\n<p>Yakov rubs his chin, “Huh. I guess you have a point.”</p>\n<p>“Whatever,” Celestino rolls his eyes, “let’s go kick the top figure skater in the world out of his room. Then you can buy me breakfast, since you stole my student.”</p>\n<p>“I didn’t steal anyone,” he sighs, “but sure. Viktor should have just fallen asleep, so waking him up should be extra satisfying.”</p>\n<p>“You guys just arrived?” he asks, surprised.</p>\n<p>Yakov winces. “Actually, Yuuri doesn’t know we’re here yet either.”</p>\n<p>It’s a good thing they’re away from the rink, because this time Celestino doesn’t think he’d be able to contain his laughter even if he tried.</p>\n<p>Yakov still hasn’t made an appearance by the time he has to step onto the ice for his short skate, and he should be freaking out. He should be an anxious <em>mess</em>.</p>\n<p>But he’s not.</p>\n<p>Yuuri’s sure all the commentators are discussing it, and really should be more worried about it, but – he’s just not. The only sound making it through right now is Yura cheering him on, and he focuses on that through the sounds of the audience and the commentators and everything else.</p>\n<p>The music swells, and he moves. He’s done this routine so many times before, done it well so many times before. He knows he can do it, and as he moves he has a confidence in it that he’s just never had before. It’s not perfect, he wobbles on most of his landings and even has to touch down on one of them, but his transitions feel as fluid as ever. Before, each mistake would have built up on the one before, until he was too distracted by his potential point loss to give all his of his focus to the rest of the skate. Now there’s a half-second of irritation, then he moves on, actually managing to get through the skate while remaining mostly calm.</p>\n<p>The minutes pass like seconds, and the next thing he knows the music has ended and he’s gasping for breath, sweat dripping down his brow. Sound comes back to him all at once, and the stands are full of screaming fans and the commentators are actually stuttering they’re so thrown off balance by his performance. He can only hope that’s a good thing.</p>\n<p>He turns to skate off the rink, looking for Yura, but he has to pause for a moment at what he finds instead.</p>\n<p>Yura is there, of course, but he’s not alone. Celestino is there, clapping and beaming, which is a nice surprise, but that’s not all. Yakov is there, which he hadn’t expected but almost makes sense, but Viktor is there too, and behind them are Georgi and Mila.</p>\n<p>There are too many cameras trained on him right now to hide that he’s crying, so he doesn’t even bother, wiping at his face as he skates over. “What are you guys doing here?”</p>\n<p>“That was amazing!” Yura beams. Viktor tries to move past him to get closer to Yuuri, and Yura elbows him in the stomach and pushes him back without looking. Viktor trips over his feet and crashes in Georgi. “You did so well, I’m proud of you!”</p>\n<p>“Thanks,” he says, and he’s not a touchy person, but Yura has conditioned him well, so he’s already lifting an arm for a hug before he even moves to give him one. Yura’s snuggled into his side with his arm around his waist when he looks at everyone and repeats, “What are you all doing here?”</p>\n<p>“We wanted to support you, of course!” Viktor calls out from where he’s still trying to disentangle himself from the Georgi and get off the floor. Every time they almost make it to their feet, Mila pushes them back down again while laughing, so it’s taking about five times longer than it should.</p>\n<p>Yakov shrugs and crosses his arms, but Yuuri thinks the old man might even be blushing. Celestino claps him on the shoulder and says, “Come on, let’s go get your scores. You did very well.”</p>\n<p>Yuuri eyes his couch warily, but he doesn’t <em>look</em> mad, and he’s always been crap at hiding his emotions. “Okay.”</p>\n<p align=\"center\">~</p>\n<p>Phichit is literally on the edge of his seat, waiting for the judges to make their call. They don’t have a television in their crappy shared apartment, so he’s commandeered the one in the student lounge. Whenever someone had tried to change the channel, he thinks he might have hissed at them.</p>\n<p>Slowly but surely the lounge has filled with people who don’t particularly care about skating, but do care that one of their classmates is performing on international television. There are a few people here who Phichit would even say he and Yuuri are friends with, which is really sweet, and he means to take a selfie of everyone to send to his friend later, but right now he can’t bring himself to look away from the screen for even a second. </p>\n<p>When the scoreboard flashes <em>104.6</em> across the screen, he literally screams and starts jumping up and down on the couch. It takes everyone else a beat, because he’s betting not a single one of them know how the scoring works, but as soon as they see how happy he is they start cheering as well.</p>\n<p>The photo he gets of everyone is a little blurry, but he’s tackled by his science lab partner a moment later, so it’s the best he’s going to get.</p>\n<p align=\"center\">~</p>\n<p>Celestino knocks on the wall before walking the rest of the way into the changing room, just to make sure he doesn’t startle his student. Yuuri is mostly changed, his uniform neatly folded on the bench as he pulls a sweater over his head. Celestino can tell he’s still pretty dazed from his score, and Celestino doesn’t blame him – that’s the best short skate score he’s ever received. “The rest of the competitors along with the Russians are waiting for you. They all want to go out to dinner.”</p>\n<p>Yuuri blinks, his dark eyes wide. “Oh. What? I don’t normally go out with – with everyone.”</p>\n<p>“Maybe it’s time your started,” he says, raising an eyebrow, “Giomatti and that Crispino girl always seem to get you in more trouble than anything.”</p>\n<p>“It’s fun,” he says, more as a statement than as a defense. He’s cautious, looking at him from the side of his eyes and pursing his lips. Celestino fully expected to have to be the one who brought up the elephant in the room, but maybe Phichit is right and these Russians are doing Yuuri some good, because he blurts out, “Do you want to – should we – we should probably talk. About us.”</p>\n<p>“Don’t be so dramatic, you make us sound like some sort of estranged lovers,” he teases. Yuuri flushes and starts sputtering, and it’s almost a relief, to see that the boy he’s spent the past few years training hadn’t disappeared in the weeks since he’s seen him last. “I was upset, and I still am, but I’m old enough to admit that I acted poorly. I’m okay with chalking this up to poor behavior on both our parts if you are.”</p>\n<p>Yuuri deflates, and he finally meets his eyes head on. “Yes! Please. I’d like that.”</p>\n<p>“I thought so,” he ruffles his hair, and is gratified when Yuuri leans into the touch. “Still, you have some decisions to make. I’m assuming you plan to go back to Russia, and not to Detroit with me?’</p>\n<p>Yuuri hesitates, biting at his lower lip, but nods. Celestino had figured as much. Yakov had finally filled him in on what exactly Yuuri has been up to. He supposes if he’d returned the other man’s calls, or even Yuuri’s, he would have found all this out a lot sooner.</p>\n<p>“That’s fine,” he says, and his student blinks at him. “We’ll remain silent to the press about what exactly is going on, and we’ll all sit down and figure out what we’re going to do. <em>After</em> the Grand Prix Final, which, after seeing you skate today, I’m sure you’ll qualify for. Okay?”</p>\n<p>Some things definitely <em>have</em> changed, because shy, reserved Yuuri throws himself at him, giving him a quick, hard hug and whispering, “Thank you!” before letting go, grabbing his uniform, and bolting out of the changing room.</p>\n<p>Celestino is left alone in the locker room, unable to do anything besides blink.</p>\n<p>That’s new.</p>\n<p align=\"center\">~</p>\n<p>Viktor had been hoping for a moment alone with Yuuri, but hadn’t gotten one. He’d come out of the locker room, and been immediately attacked by Sara Crispino, who had jumped into his arms and kissed both his cheeks in congratulations. He’s never been so jealous of another person in his whole life. Also, seeing the ease that Yuuri catches Sara reminds him of how <em>strong</em> he is. Viktor is taller than him, but Yuuri probably could pick him up just as easily as he had Sara. Which is certainly an interesting thought, but one he shouldn’t focus on too long while in public.</p>\n<p>Yura stays glued to Yuuri’s side all through dinner, and Sara is draped over him on his other side. Mila sits next to Sara, and Viktor ends up almost across from Yuuri, sandwiched between Georgi and Michele, the latter of whom spends the whole dinner glaring at Yuuri. He’s vaguely familiar with the other competing skaters, but he doesn’t know them personally. He’s pulled into their conversation anyway, it would be incredibly rude not to answer their questions when they’re sharing a table, after all. He barely gets to exchange any words with Yuuri, never mind getting any alone time with them.</p>\n<p>Thankfully, the dinner doesn’t last long. The free skate is the next day, after all, so all the competing skaters are eager to get to bed early. Everyone finally disperses in the hotel lobby, Yura included, even if he does give Viktor a suspicious stare for not following him upstairs. Luckily, Michele pulls him away. Viktor makes a note to do something nice for the man later, even he does have some sort of weird vendetta against Yuuri.</p>\n<p>“What’s up?” Yuuri asks, and he’s paused in the middle of the hallway, leaning back against the wall. “You’ve been jumpy all night. Is something wrong?”</p>\n<p>He’d thought he’d done a pretty good job of hiding it, but clearly not. Or maybe Yuuri just knows him that well. He really likes the idea of that. “So, um, I got a room here, right?”</p>\n<p>“Right,” Yuuri agrees, a smile around the edge of his mouth.</p>\n<p>“But Celestino took my room. Yakov woke me up and kicked me out, and Celestino gave me his key, so I kind of put my stuff in your room. Is it okay if I sleep there? I don’t want to bother you or anything, you have a really important skate tomorrow, is all, and I can absolutely force Georgi and Mila to share with me, or Yura. Or I can get Yura to switch with me! You won’t mind him, and he probably doesn’t want me sleeping with you anyway – NEXT TO! He probably doesn’t me sleeping next to you, is what I me–”</p>\n<p>Yuuri places his hand over Viktor’s mouth, laughing as he cuts off his waterfall of words. “You can stay in my room Viktor, it’s fine. We’ve already shared a couch. We can share a room.”</p>\n<p>His mind immediately goes back to that night, to Yuri heavy and warm at his side, and his voice comes out higher pitched than normal when he says, “Yeah, okay. Thank you.” It also comes out a little muffled, since Yuuri’s hand is still over his mouth. His lips press against Yuuri’s skin while he talks, and it’s probably really messed up of him to be as turned on as he is right now.</p>\n<p>“No problem,” Yuuri says, lowering his hand. Is he blushing, or is it just the horrible fluorescent lights, or even just Viktor’s imagination? He can’t tell. “It’s probably for the best anyway, considering we’re supposed to be dating. It would be weird if they found out we were staying in separate rooms.”</p>\n<p>“Right,” Viktor agrees, mouth dry. The whole world thinks he’s sleeping with Yuuri. That he gets to spend his nights curled over him, touching him, kissing him. “We should, uh, probably get going. To your room. Our room.”</p>\n<p>“Yeah,” Yuuri says, except he’s still leaning against the wall, and they’re so close their chests are nearly touching, and it would take nothing at all for Viktor to lean down and press their lips together, to kiss him like Yuuri kissed him on that night so many months ago. But Yuuri clears his throat and repeats, “Yeah,” a little more loudly. He pushes himself away from the wall and therefore into Viktor, and for a single delicious moment Yuuri’s body is up against his, and then he’s walking down the hall.</p>\n<p>It takes Viktor almost a full fifteen seconds before his brain comes back online so he can run down the hall to catch up with Yuuri instead of staring at a blank wall like an idiot.</p>\n<p>Somehow the simple acts of getting ready for bed together seem more intimate than anything else they’ve done, than making out in clubs or going on a date or curling up together on his couch.</p>\n<p>He spends a long time just listening to the rise and fall of Yuuri’s breathing before following his fake boyfriend into sleep.</p>\n<p align=\"center\">~</p>\n<p>It’s intolerably early in the morning, but Yuri has already been here for ten minutes and Katsudon should <em>be here</em> by now. It’s not like him to oversleep, especially the day of a competition. He’s just about made up his mind to go track him door when he burst through the door, “Sorry, sorry! I got distracted this morning, sorry!”</p>\n<p>“It’s fine,” he says, biting his lip to keep from smiling as Katsudon frantically changes into his skates. “It’s your practice for your competition that you have today. Far be it from me to stand in the way of your very important beauty sleep.”</p>\n<p>“I said I’m sorry!” he says, just a few octaves off from a wail, and Yuri loses him composure completely and spends nearly two minutes clutching the side of the rink and laughing until he can’t breathe.</p>\n<p>He only stopes when Katsudon skates over and starts poking him in the side, babbling over his laughter that he really needs to work on his triple flip, can he please focus? Except he can’t, and it ends in them spending their first ten minutes on the ice playing an increasingly ridiculous game of tag.</p>\n<p align=\"center\">~</p>\n<p>Mila wakes to Sara’s alarm, but the Italian skater only irritably throws in across the room, choosing to burrow deeper into Mila’s side instead of getting ready for practice. Neither of them had bothered to put their clothes on after they’d finished, and Mila can just tell that getting out of the warm cocoon of their tangled limbs underneath the heavy blanket will be a nightmare.</p>\n<p>“I’m surprised Michele hasn’t barged in here yet,” she says, pressing a kiss to the corning of Sara’s mouth, wondering if they have enough time to make use of their lack of clothing before she really has to leave for some last second practice. Probably not.</p>\n<p>Sara kisses her back, very much on her mouth and settles her thigh between Mila’s legs. Clearly she has a very different concept of time and punctuality. How Italian. “He knows I’m with you, and he likes you. He says you’re the only person he trusts me with, which is kind of insulting, because I can take care of myself, despite his personal beliefs. But it does mean he won’t come barging in here, even if I’m late for practice.”</p>\n<p>Mila likes to pretend she doesn’t have emotions, but she can’t help but be touched. Georgi is as good as her brother, she’s known him practically her whole life and loves him as dearly as she does the rest her family. Not that she’d ever tell him that. But he would never dare to get propriety with her, even if he was worried, because she would drop kick him in the face.</p>\n<p>But Michele isn’t like that. Sara can hide it better, but their freaky codependent relationship runs both ways, and Sara is suspicious of any woman that tries to get close to her brother. Michele is straight up fanatical about keeping Sara safe and happy, and that he thinks Mila is someone who could keep his beloved sister safe and happy is – is really –</p>\n<p>She flips them over and pins Sara to the bed, pressing a trail of kisses from her lips down her sternum.</p>\n<p>If Sara isn’t going to rush off to practice, Mila isn’t going to waste their time together <em>not</em> getting laid.</p>\n<p align=\"center\">~</p>\n<p>Yuuri is about to start his free skate, and he’s nervous, because he’s always nervous, but it’s not overwhelming. He can still think and breathe and he’s not on the edge of a panic attack like he so often is right before a competitive skate. Mila and Georgi are in the stands. Viktor’s joined them in the kiss and cry because Yakov had said it would be weird if he <em>wasn’t</em> there, since he’s supposedly Yuuri’s boyfriend. Yura’s there too, because Yura had growled at Yakov when he’d tried to get him to sit in the stands with his rinkmates, and Yakov hadn’t tried again.</p>\n<p>There’s something at the back of his mind, like a thought he can’t quite articulate, and it’s unsettling him. He’s not nervous, but he’s not exactly focused either, aware something is bothering him but unsure about what exactly ‘it’ is.</p>\n<p>He’d been late for meeting Yura this morning because he’d gotten into a discussion with Viktor about the decline in quality of Kit-Kat flavors, which was a weird conversation to have possibly ever, but doubly so at four in the morning. Except it hadn’t felt weird. Yuuri sometimes struggled to hold mundane conversations with people he liked and knew, and there he was, chattering away to Viktor about the most inane of topics like it’s nothing.</p>\n<p>He steps onto the ice and the music starts, and he should be focusing on his routine. It is, quite literally, the most important thing to him and his career at this moment. He’s going through the moves perfectly, but he’s still <em>distracted</em>, thinking about Viktor’s sleep rough voice and the way he had the lines of the sheets imprinted onto his face this morning, and his hair had been all mussed into the back. Besides that first night he spent with Viktor and Chris, and he really doesn’t remember much of it anyway, he doesn’t think he’s ever struggled to find words with Viktor. Which is so odd, because he struggles with everyone, at least in the beginning. He can keep a steady flow of words with Phichit, Chris, and Sara <em>now</em>, but that took a lot of time to build. It didn’t happen automatically, or easily.</p>\n<p>The closest thing to what he has with Viktor is his relationship with Yura, but that makes sense, even if he doesn’t understand it. He doesn’t have much to compare it to, but it in almost no time at all Yura felt like family, like he was a missing piece in Yuuri’s life. Thanks to Yura he’s a stronger skater, and a better person – a kinder person, even. It was always so easy for him to get lost in his own head, to be selfish without meaning to because his problems were his only problems, for the most part. But Yura doesn’t let him to do that, constantly pulling his attention to him, and to Yuuri’s strengths. He likes who he’s become since he’s known Yura, but it’s not the same as what he feels with Viktor.</p>\n<p>Viktor isn’t making him whole, because he doesn’t have any other missing spaces for him to fill. It’s not even particularly calming being around the man sometimes, because he’s so beautiful. Looking at Viktor is like looking at the sun. It’s shining, and wonderful, but it can hurt. He’s always known that, really, he’s always been a fan of Viktor’s, so he’s not sure what has changed recently. Sure, there’s the laughter, and the softness in the center of his chest when he’s with Viktor, and how when Viktor doesn’t think anyone’s paying attention he’ll look so <em>sad</em>, and sometimes some of the things he says just break Yuuri’s heart, because Viktor is wonderful. He’s wonderful and beautiful and kind, even if he’s an over dramatic disaster, and he hates seeing Viktor sad, because he’s in lo –</p>\n<p>He’s in lo –</p>\n<p>He can’t get himself to complete the thought, and he doesn’t get a chance to try again, seeing as he’s so deep in thought that he messes up his triple flip and crashes face first into the ice. He’s on his feet a moment later, although the entire left side of his face is throbbing and raw. He can’t tell if the liquid running down his face is sweat or blood. He glides straight back into his routine, and resists the urge to poke at his teeth with his tongue to see if any of them have come loose.</p>\n<p>That fall almost definitely destroyed his chances of getting to the Grand Prix Final, but he can’t really bring himself to freak out about that right now. He’s much to busy freaking out over – over realizing that he – that’s he’s –</p>\n<p>He’s in love with Viktor.</p>\n<p>Being in lust with Viktor is old news, and hardly makes him unique. But he <em>loves</em> him, loves not the image of Viktor but the man, the person who looks sad in produce aisles and forgets to plan dates and is one of the very few people that Yura trusts and who smiles at him with green onion stuck in his teeth as he compliments his cooking, his mother’s recipe. That’s who Yuuri’s in love with.</p>\n<p>Yuuri is in love with Viktor.</p>\n<p align=\"center\">~</p>\n<p>When Katsudon goes down, there’s an audible gasp from the audience. It’s bad, he misses the landing and lands in a twisted pile of limbs. It looks like a fall that ends up breaking something, that will effect the rest of the season.</p>\n<p>He and Viktor both fling their arms out to prevent the other from jumping forward, realize what they’ve done, and pull their arms back.</p>\n<p>“MEDIC!” Yakov shouts, but Celestino hisses, “Not yet!” and frantically shoves his hand over Yakov’s mouth.</p>\n<p>Yuri can’t look away, gripping the edge of the rink, biting his lip to keep from crying out. A second later Katsudon is pushing himself up and onto his feet, flawlessly getting back into the routine like nothing had happened. Viktor’s sigh of relief leaves him like air leaves a popped balloon, but Yuri can’t even spare the time to make fun of him for it.</p>\n<p>Half of Katsudon’s face is torn up and bleeding, but he’s skating. It doesn’t look like he broke anything, like his ankle or arm or – or his back. He looks fine.</p>\n<p>The last forty five seconds of Katsudon’s free skate are possibly the longest forty five seconds of his life.</p>\n<p align=\"center\">~</p>\n<p>Viktor is reaching for Yuuri as soon as he steps off the ice, cupping his face in his hands pressing the edge of his sleeve against the cut along his upper jaw. “Yuuri! Are you okay? That looks like it really hurt!” He’s so, so grateful for his cover as Yuuri’s boyfriend, which gives him an excuse to manhandle him like this.</p>\n<p>“I’m fine!” he says, eyes wide, “Really, uh – just, just fine. Must have looked worse than it felt.”</p>\n<p>“You’re bleeding,” he says, distressed, and he’s surprised Yura hasn’t pushed him aside to check on Yuuri for himself yet. Instead the younger skater is hovering next to them, lips pressed into a hard line but not making any move to get in middle of them.</p>\n<p>Lights are flashing everywhere, and he’s sure pictures of the two of them will end up all over the internet by tomorrow, but he really, really doesn’t care. “It’s okay,” he says, “It’s not a big deal.”</p>\n<p>Viktor makes a disagreeable sound in the back of his throat. Yuuri fell and he’s bleeding and it is, in fact, a very big deal!</p>\n<p>“Okay, okay, we’ll get you checked out later to be sure,” Celestino says, somehow managing to elbow in between them and place his arm around Yuuri’s shoulders, guiding him over to where they’ll announce his score. It happens so quickly that Viktor can only make an aborted gesture to reach after Yuuri as he’s pulled away.</p>\n<p>It’s then that he notices Yuuri’s blood has stained the edge of his sleeve, which shouldn’t be surprising considering he literally pressed it against his bleeding wound. But seeing the stark red against the crisp white of his sweater seems – barbaric, almost. He doesn’t like it.</p>\n<p align=\"center\">~</p>\n<p>Yuuri is shocked when scores come up, and when all is said done and he manages to scrape his way onto another podium. His fall hurt his score, but he still managed to get bronze, right behind Michele.</p>\n<p>Which means, by some miracle, he’s qualified for the Grand Prix Final.</p>\n<p>Michele and Sara have as well, and Sara is absolutely ecstatic at the news. She runs over to him as soon as they all leave the kiss and cry. “We should go out!” she says excitedly, “Me and my two favorite boys are going to the Grand Prix Final together! In Sochi! We’ll be in Russia!”</p>\n<p>“I’m in Russia <em>now</em>,” he feels compelled to point out, a sinking feeling in the pit of his stomach. Going out with Sara never ends well for him. “Maybe I should just stay in tonight? Yura came all this way to see me, and it seems rude to leave him on his own–”</p>\n<p>“Nonsense!” Celestino says, clapping Yuuri hard enough on the shoulder that he staggers. “You should celebrate your victory! Yuri won’t mind. Will you, Yuri?”</p>\n<p>Yuuri looks over to Yura, and he’s shaking his head. “You should have fun with your friends.”</p>\n<p>Something seems off about Yura, and he can’t put his finger on what, so he feels compelled to say, “<em>You’re</em> my friend. I really don’t need to go out drinking to have fun.”</p>\n<p>Yura relaxes a little, but something still seems not quite right. “Go out drinking. I’ll be fine,” he says, and he <em>sounds</em> genuine, but Yuuri can’t help but have the niggling feeling that something is wrong.</p>\n<p>“Go on, you’ve earned it,” Celestino says, but the gleam in his eyes gives Yuuri the impression that he’s not completely over the weeks of radio silence, and he definitely considers this punishment.</p>\n<p>Yakov sighs, “It’s probably not a bad idea. You could use the publicity,” carefully not saying that it would be good for Viktor and him to be photographed together considering the mixed company, but certainly implying it.</p>\n<p>“Yeah, okay,” he says, feeling unnecessarily ganged up on. If nothing else, it can’t be worse than the last time he went clubbing in Paris with Sara.</p>\n<p>Sara squeals and jump into his arms, and he catches her in a bridal hold almost on instinct. She does that a lot. “Yay, we’re going to have so much fun!”</p>\n<p>He realizes then that the Grand Prix, he and Sara and Chris are all going to be at the same event, and there’s no way he’s going to survive that.</p>\n<p align=\"center\">~</p>\n<p>When Sara tells them what the game plan is, wide eyed and innocent, Georgi understands completely why Mila likes her so much (Mila might think she’s slick, but he’s known her since they were kids, and he’s known been dating Sara since the beginning.)</p>\n<p>It’s a plan of pure evil.</p>\n<p>Granted, it’s also pretty straight forward: Get Yuuri and Viktor drunk and push them at each other until they’re forced to do something about all that sexual tension. He doesn’t know how <em>effective</em> it will be, but most of his relationships end in the most dramatic fashion possible, so he doesn’t have a lot of room to talk.</p>\n<p>Sara’s smart, so they’re not going out with the other skaters, the ones that Yuuri knows but who aren’t actually his friends. It’s him, Mila, Sara, Michele, and Viktor, meaning Yuuri <em>should</em> be comfortable, but he’s been twitchy all night. He initially chalks it up at his guilt at leaving Yura behind, but halfway through the walk to the first club Sara leans over and whispers, “Don’t worry, he’s always like this at the beginning of the night. He’ll be fine once we start drinking.”</p>\n<p>He finds that a little hard to believe. The Yuuri he knows is quiet and shy and not someone who would feel comfortable at all in nightclubs. Then again, he’d worried Yuuri would show up in sweatpants and a sweatshirt, which is what he wears most of the time back in St. Petersburg. But he’d come down in skinny jeans that had looked like they’d needed to be poured on and a slim black button up, which sounds simple and fairly conservative, but somehow managed to make Yuuri look like he was a hop and skip away from working on a street corner. Viktor had practically started salivating when they’d met up in the lobby of the hotel. Georgi wonders if he could bribe Yuuri into wearing some mesh next time they went out. It’s entirely possible that if he could get Yuuri into a mesh top over those tight jeans, and possibly some eyeliner if he can get away with it, that Viktor would literally combust or possibly fall to his knees and weep. Either one would be hilarious and entirely worth it.</p>\n<p>His conservative estimation of Yuuri is chucked out the window about ten minutes after they get to the club. There’s no keeping a low profile with the group they’re in, and they’re already getting some stares, and the longer people stare the tenser Yuuri becomes.</p>\n<p>Sara goes to the bar and comes back with six shots of clear alcohol. “Here! This will make you feel better.”</p>\n<p>“I don’t know if I should do hard liquor tonight,” Yuuri says nervously, “Someone can have my shot.”</p>\n<p>“Oh, Yuuri,” Sara says, the thinnest layer of false disappointment covering her unholy glee, “these are all for <em>you</em>.”</p>\n<p>Viktor looks conflicted, but Georgi’s eyes bug out of his head. Yuuri has a lot of muscle on him, but he’s not exactly a large man. If he starts off with six shots now, they’re going to end up having to carry him home an hour later. He says, “I don’t know if that’s a good idea.”</p>\n<p>“Shut up,” Sara says pleasantly, but with the same undercurrent of steel that Mila has that makes him obey instantly. She pushes the six shots closer to Yuuri. “<em>Drink</em>, mi passerotto. I insist.”</p>\n<p>Viktor opens his mouth, hopefully to stop this insanity. Before he gets the chance Yuuri mutters, “You’re a monster,” at Sara, and does all six shots in under a minute, one after another.</p>\n<p>“Holy shit,” Mila grins, “I like how this is going.”</p>\n<p>“Fuck this,” Yuuri says, and Michele’s stone face collapses as he snickers into his hand. Georgi thinks he must be dreaming. “Shots take too long, I’m just going to get the bottle.”</p>\n<p>Yuuri disappears into the crowd, and he turns to Michele and Sara, “Are you two shitting me right now?”</p>\n<p>“Drunk Yuuri is the best Yuuri!” Sara says excitedly.</p>\n<p>Michele snorts, “Drunk Yuuri is a flirt. Luckily he’s gotten himself a boytoy,” he jerks his thumb at Viktor, who looks concerningly excited at being called Yuuri’s boytoy. “You’re on Yuuri wrangling duty. Don’t let him get kidnapped by a group of pretty people into a sex cult or an orgy.”</p>\n<p>“Does that happen often?” Georgi asks, horrified.</p>\n<p>“Every time,” Sara and Michele chorus as one.</p>\n<p>What the fuck.</p>\n<p>“Oh dear,” Viktor sighs. He follows his rinkmate’s gaze.</p>\n<p>Yuuri is sitting <em>on</em> the bar, long legs crossed and one arm braced behind him. He’s got his other hand wrapped around a bottle of top shelf tequila, which he’s pouring directly into his mouth, head tilted back and pale neck exposed as his slick pink lips slide over the neck of the bottle. It’s <em>obscene</em>.</p>\n<p>It’s also definitely not allowed, but the bartender looks like the last think on her mind is telling him off. Georgi really can’t blame her. He’s pretty sure that if temptation had a physical form, it would be Yuuri Katsuki deep throating a bottle of tequila.</p>\n<p align=\"center\">~</p>\n<p>Yuuri probably should have seen this happening from the beginning. They start out as a group, but within a couple hours everyone has broken apart. Mila and Sara are nowhere to be found, although he catches occasional glimpses of Georgi and Michele dancing with various women.</p>\n<p>He has a high alcohol tolerance, so it generally takes him a significant about of time before he becomes well and truly drunk. But considering his recent revelation about his feelings for Viktor, being next to the man is hell, because nothing has changed, but also everything has changed. His heart is beating too fast and his face is hot, and whenever Viktor’s eyes lock on his it almost feels like the beginnings of a panic attack.</p>\n<p>There is simply no way to explain any of that without confessing his newly found feelings (not an option) or looking like a crazy person. He doesn’t want to get drunk and slip, doesn’t want to say something that he’ll regret later and will possibly ruin his relationship with Viktor forever. But then Sara puts the shots in front of him, and he takes the path of least resistance – getting so astoundingly, mind-numbingly drunk that he it won’t even occur to him to have a panic attack over the fact that he’s in love with Viktor Nikiforov.</p>\n<p>It works astoundingly well, except that he pops out on the other side, and all he wants to do is pin Viktor to vertical surfaces and have his way with him. To his alcohol soaked brain, there’s absolutely no reason he <em>shouldn’t</em> do that, so he does.</p>\n<p align=\"center\">~</p>\n<p>Viktor is a little hazy, having downed one or two or three too many brightly colored drinks with the little umbrellas in them. He’d thought Yuuri wrangling would be a hard job, but it’s surprisingly easy, since Yuuri seems to want nothing more than to stay glued to his side, which is incredibly flattering and also makes him feel like a teenage girl.</p>\n<p>They’ve been stuck in the throng of bodies for a while, he lost track of time a long time ago, and having Yuuri rubbing his body all over him and putting his hands all over him is driving him insane, and is most of his motivation for getting brightly colored drink after brightly colored drink. “Come on,” Yuuri says, damp breath against his skin, lips brushing the shell of his ear, “I want to get some air.”</p>\n<p>“Okay,” he says, because Yuuri could literally suggest anything to him in that moment and he would agree.</p>\n<p>He drags them outside the back of the club, to an alley where a couple of people are smoking and chatting far from the door, but is otherwise empty. The cool air is an instant relief, they’re soaked with sweat and he hadn’t realized how hot he was until he wasn’t anymore. “Are you feeling okay?” he asks, looking to Yuuri.</p>\n<p>Yuuri doesn’t answer. Instead he pushes him against the brick wall and goes on his tip toes so he can press his hands onto the wall on either side of Viktor’s head. Yuuri’s gorgeous brown eyes are hypnotically close, and Viktor doesn’t feel chilled anymore, his entire body is on fire as Yuuri slides his thigh in between Viktor’s legs. “You’re so beautiful,” he murmurs, and Viktor can feel his breath ghosting over his lips. His heart constricts, conflicted, because Yuuri thinks he’s beautiful, but – so many people think he’s beautiful. He wants Yuuri but he doesn’t know if he can stand just being a beautiful person for Yuuri to touch when Viktor loves him with every fiber of his being, has loved him for nearly a year, since the first time they went drinking together. Yuuri continues muttering, “Love the way you’re so worried about your shirt matching your socks of all things, your ridiculous taste in clothes, how excited you get over good food, over <em>my</em> food, the way you’re so patient with Yura, so patient with me, love your <em>kindness</em>, Vitya, it’s all so beautiful, it makes you so beautiful.”</p>\n<p>Oh. <em>Oh</em>.</p>\n<p>He’s crying as he tilts his head enough to close to the inch of space between them, and his head is spinning with alcohol and Yuuri’s words echoing though his head, and he’s very certain that if he doesn’t kiss Yuuri right this instant, he will die. Yuuri makes an eager little sound against his mouth that make’s all of Viktor’s blood rush south, and it’s not cold out here <em>at all</em>, all at once he’s just as hot as he was in the center of the club. “Wanna go back to our room?” Yuuri asks, biting up his neck, and Viktor knows there’s a reason that that’s a bad idea, but he’s had many drinks and Yuuri is against him, warm and hard and gorgeous, and he can’t think of what it could possibly be.</p>\n<p>Yuuri thinks he’s beautiful, but not like everyone else, thinks he’s beautiful because of who he is, not what he looks like, and it’s the simplest thing in the world for him to say, “<em>Yes</em>.”</p>\n<p align=\"center\">~</p>\n<p>By the time they get back to the hotel, Yuuri has sobered up enough to realize that going to bed with Viktor, the man he’s recently realized he’s in love with, is courting disaster. But he doesn’t actually care, because for some incomprehensible reason Viktor wants him, and he’s not going to pass up his chance to have Viktor’s hands on him, his mouth on him.</p>\n<p>There’s a chance that sex could ruin their friendship, that they’ll wake up in the morning and think it’s a mistake, that he’ll lose the easiness between them that he values so much. But the man he loves is grabbing his ass and whispering filthy things in Russian in his ear, and he’s willing to risk it. They’re stumbling down the hallway to their room when a familiar voice says, “Oh my god! Sorry, I didn’t – sorry!”</p>\n<p>Yuuri pushes Viktor away, and only has a moment to feel bad about Viktor stumbling back into the hallway wall before he sees Yura sitting on the floor next their hotel room door, eyes rimmed red and mouth open in surprise. “Yurochka!” he says, falling hard to his knees beside him. He reaches out a clumsy hand to cup his cheek, carefully looking at his pale face and the obvious signs of crying. “What’s wrong? What happened?”</p>\n<p>“Nothing!” he says, rubbing at his eyes. “Sorry, I’m really sorry, I didn’t think – I’ll go now, I didn’t mean to interrupt.” He tries to scramble to his feet, but Yuuri clamps a hand on his shoulder, preventing him from standing.</p>\n<p>The adrenaline and worry has a better sobering effect than anything else, and he tries to push away his drunken haze so he can focus on Yura. “Don’t be sorry, you didn’t do anything wrong. What were you waiting for me for? Was someone mean to you?” If someone made Yura cry, he is one hundred percent sober enough to track them down and punch them in the face.</p>\n<p>Yura shakes his head. “Nothing, it was nothing, it was stupid.”</p>\n<p>“Nothing that upsets you is stupid,” Viktor says, hesitantly kneeling on the other side of Yuuri. Yura shrinks away from him, ducking his head down, and Viktor looks at Yuuri helplessly.</p>\n<p>“I got it,” he says, and mourns for the briefest of moments the sex he’s definitely not going to have tonight. “Go get ready for bed, I’ve got this.”</p>\n<p>Yura tries to bolt again, but he doesn’t let him. “No, don’t – I’m really sorry, I didn’t think that you two would be – that you were – um, you know.”</p>\n<p>Viktor hesitates, but leans down to press a quick kiss to Yura’s forehead. “Don’t worry about it. You’re more important.” He squeezes Yuuri’s shoulder briefly before going into their room and quietly shutting the door behind him. The fact that he doesn’t seem the least bit bothered about the change of plans for the night is on one hand a little bit of blow to his ego, but also if Viktor had indicated at all that he wanted Yuuri to leave Yura alone and upset he would have had to punch him.</p>\n<p>He shifts so he’s sitting next to Yura with his back to the wall and curls his arm around Yura’s shoulders, pulling the smaller boy against his side. He’s stiff for a moment, but the he melts into it, throwing his arm around Yuuri’s stomach. “Sorry.”</p>\n<p>“Don’t be,” he repeats. “What’s going on?”</p>\n<p>“I just,” he tenses a little and says almost too quietly to hear, “the fall looked really bad, is all. And sometimes injuries that are really bad don’t hurt at first, and – and it looked like you fell on your back, is the thing, just for a moment. And I know the medic said you were fine, and you said you were fine, and Yakov said you were fine – but I just, I was just being stupid, is all,” he says, but the last bit comes out choked, and Yuuri doesn’t have to look at him to know he’s crying again.</p>\n<p>Yuuri feels like a complete and total moron. Yura’s grandfather is in the hospital thanks to a fall, and he’d had to wait in the hospital with him alone, had had to deal with all that alone until Yuuri could get to him. Then Yuuri wipes out right in front of him. It’s not wonder that Yura is freaking out and worried and panicking. Maybe it’s not entirely logical, but if anyone can understand the crushing panic and fear from things that aren’t entirely logical, it’s Yuuri.</p>\n<p>He, more than anyone, should have seen this coming. He’d known Yura was upset about something, but he hadn’t known what, and he’s brushed it off and left him alone anyway. “You’re not being stupid at all, Yurochka. It was scary for you when I fell, wasn’t it?”</p>\n<p>Yura freezes, and then turns completely so he’s full on hugging Yuuri with his face buried in his chest. He nods, breaths hitching and shoulders shaking. “I know you’re fine, I didn’t mean to ruin your night, I just couldn’t stop thinking about it, and I figured if I waited for you and saw you were fine I wouldn’t worry anymore, so I did, but I didn’t mean to ruin anything!”</p>\n<p>“Nothing is ruined,” Yuuri says, rubbing his hand in soothing circles along Yura’s back. “How about I spend the night in your room, and that way you can keep an eye on me? Would that make you feel better?”</p>\n<p>He pulls back and wipes at his eyes, “But don’t you want to,” his eyes flicker to the hotel room door.</p>\n<p>“He’s probably already asleep anyway,” Yuuri says firmly, “I’m <em>fine</em>, Yurochka. But if you need to see it to believe it, I’m okay with that.”</p>\n<p>Yura stares at him for several long moments, getting his tears under control and searching for any hint of lie. Then he looks down and says, “If – if you wouldn’t mind.”</p>\n<p>“Never,” Yuuri swears, pulling them both to their feet. “Let’s go.”</p>\n<p align=\"center\">~</p>\n<p>Viktor knows it’s not a very nice thing to do, but he’s seated on the floor of their hotel room with his ear pressed to the crack, straining to hear their conversation.</p>\n<p>When Yuuri offers to go with Yura, he can’t be surprised, or upset. Yura is a kid, and the list of people he trusts completely is very short. In fact, it contains exactly two people – his grandfather, and Yuuri. It’s no wonder at all he freaked out at the thought of <em>both</em> of his trusted people being hurt.</p>\n<p>Still, he can’t help the feeling of his heart constricting in his chest as he listens to them walk away. Yuuri had wanted him, and it would have been – they would have woken up the next morning, and Viktor could have spirited Yuuri away to breakfast, and they could have had an adult conversation about what it all meant. They couldn’t avoid it anymore if they’d slept together, for better or worse they would have had to <em>talk</em> about it. After Yuuri’s ramblings in the alleyway, he can’t help but think that maybe Chris has been right this whole time, maybe Yuuri really did like him, not just as an attractive man to make out with, but as <em>Viktor</em>. Which means the hopeful end result to this breakfast would be Yuuri agreeing to be his boyfriend for real, not just as a media ploy, and the two of them going back to their room to have sex again before packing to fly back to Russia together, to then have even more sex all over his apartment.</p>\n<p>But instead he’s alone in this room, covered in sweat and alcohol, and with pressure steadily building behind his eyes that he’s doing his best to ignore. Yura needs Yuuri more, so this is fine, it’s all fine, and he’s fine.</p>\n<p>He’s fine.</p>\n<p align=\"center\">~</p>\n<p>Yuri wakes up with the strangest crick to his neck, and he’s confused as to why until the events of last night catch up to him, his embarrassing breakdown and Katsudon comforting him and offering to stay with him, and the two of them squeezing into his too small bed so he could press his ear against Katsudon’s chest and assure himself that his heart was still beating, that he wasn’t going to have to deal with the other most important person in his life getting hurt so soon after his Grandfather.</p>\n<p>He’s alone in bed now, and he turns over to see Katsudon sitting in the window sill, still in last night’s clothes and a distant look in his eyes as he looks out over the Paris skyline. Yuri curls up under the blankets and pillows his head in his arms, just watching him for several minutes before he works up the courage to say, “I didn’t know that you and Viktor were – are – you know. I thought it was just a cover for the media.”</p>\n<p>Katsudon startles at the sound of his voice, but he’s smiling when he turns his head to look at him, and Yuri can’t help but smile back. “We’re not!” he says when what Yuri said catches up with him, cheeks flushing. “Last night was just – just a mistake is all. I mean I – but I’m sure that Viktor doesn’t, so, so, yeah,” he finishes lamely.</p>\n<p>Yuri keeps starring at him, and he doesn’t know if other people think Katsudon’s a good liar, because as far as Yuri’s concerned he’s pretty crap at it. He pushes himself out of bed and walks over to him, standing directly in front of him. Katsudon raises a single eyebrow and tilts his head to the side. Yuri asks, “Do you have feelings for Viktor?”</p>\n<p>“No!” he says, eyes wide, which is so clearly a confirmation.</p>\n<p>“Oh boy,” he sighs, and boosts himself up to sit on the window ledge as well. Katsudon pulls his knees up against his chest to make room. “Look, I know you have self esteem issues,” Katsudon rolls his eyes but doesn’t protest, which is progress, “but you trust me, right? You know I wouldn’t lie to you, or make fun of you, right? I would never tell you something that isn’t true.”</p>\n<p>“Of course,” Katsudon says with gratifying quickness. “Why?”</p>\n<p>On one hand, this will almost certainly mean he’ll have to deal with even more Viktor in his life than before. On the other hand, if Viktor can make Katsudon happy, that’s the only thing that really matters here. “Viktor is an idiot,” he begins, “but also he’s in love with you, which is the least idiotic thing he’s done to date.”</p>\n<p>Katsudon’s mouth drops open. “Um, I don’t think, I mean – what, uh.”</p>\n<p>Yuri raises a single finger and then launches into a speech about every piece of evidence he can think of that proves Viktor is head over heals in love with Katsudon.</p>\n<p align=\"center\">~</p>\n<p>Viktor has just stepped out of the shower, a towel knotted around his waist and hair in his eyes, when Yuuri bursts into their room, still wearing yesterday’s clothes and looking unfairly good in them. How is that even possible? No human being should look so beautiful after falling straight into bed after a night of hard partying.</p>\n<p>He doesn’t get more than a couple seconds to appreciate the view before Yuuri says, words tumbling over each other, “Yura says you’re in love with me, is that true? Because if it is I’m in love with you too. I mean, I guess I’m in love with you whether you love me or not, because that’s how love works, but if – if you do love me, you should know that I love you too. Or if you don’t love me, I guess I just love you, no too added. But no pressure if you don’t feel the same way, I don’t want you to feel pres–”</p>\n<p>Viktor freezes at the first sentence, but by the end of that rambling question he’s beaming. He does what Yuuri did to him last night, and pins him against the wall and presses their mouths together. Yuuri freezes, and Viktor starts to back up, worried he’s done something wrong. But then Yuuri’s arms encircle his waist and pull him closer, pressing them together again and Yuuri’s mouth is eager under his.</p>\n<p>His towel drops and he’s fumbling at the buttons of Yuuri’s shirt, desperate to touch him, to kiss him. Yuuri finally figures out what he’s doing and pushes him back onto the bed, and he’s flushed red as he looks at Viktor spread out before him. “So is that a yes then?”</p>\n<p>“<em>Yes</em>,” Viktor says, and then hooks his foot around the back of Yuuri’s knees and yanks so he falls down on top of him.</p>\n<p>They only have a couple hours before they have to leave to catch their flight, and Viktor plans to make the most of them.</p>\n<p align=\"center\">~</p>\n<p>Chris is curled up under his covers, scrolling through his news feed, when he gets a text message from Viktor.</p>\n<p>It’s better than a phone call, but he’s already resigned himself to a three paragraph ode to the curve of Yuuri’s ass. Or, well it’s Viktor, so it’s might be about his ‘gentle spirit’ or whatever.</p>\n<p>It’s a picture. He impatiently waits for it to load, and when it does he screams.</p>\n<p>It’s Viktor and Yuuri from the waist up, lying in bed and clearly naked. Yuuri’s covered his face with his hands and Viktor is beaming, and there’s absolutely no doubt that the two of them have just had sex. Another message comes in reading: <em>he’s my boyfriend now!! &lt;3 &lt;3 &lt;3</em></p>\n<p>He tries to call both of them, but it goes straight to voicemail, and this is the worst. He’s endured so much, dealt with so much, and they don’t even have the decency to answer his phone call!</p>\n<p>Despicable.</p>\n<p align=\"center\">~</p>\n<p>Yuri was worried things would change, now that Viktor and Katsudon are dating for real, and not just as a ploy for the media.</p>\n<p>It doesn’t.</p>\n<p>Michele and Sara make fun of Viktor for being love struck to his face instead of behind his back, and Katsudon is now way more shy around paparazzi now that he really is Viktor’s boyfriend. But he doesn’t start spending the night at Viktor’s, he still trains more with Yuri than anyone else, he’s still <em>there</em> for him in a way almost no one else has been his whole life.</p>\n<p>He’s incredibly grateful for that, but it’s way too mortifying of a sentiment to ever say out loud, so instead he tries to glare at Viktor a little less since he’s Katsudon’s boyfriend and hopes the sentiment gets across.</p>\n<p align=\"center\">~</p>\n<p>“You’re over thinking this,” Phichit says, his face filling up Yuuri’s laptop screen as he paces back and forth.</p>\n<p>“How can I be overthinking this? It’s a big decision!” he says, and tries not to sound like he’s whining, but almost certain that he does.</p>\n<p>Phichit rolls his eyes. “Look, you’re my best friend, and obviously what <em>I </em>want is for you to come back to Detroit and continue being my roommate and my rinkmate. But Viktor Nikiforov is your <em>boyfriend</em> now! You’ll always be my best friend. But long distance relationships are way harder to maintain than long distance friendship.”</p>\n<p>“But school! And I don’t even know if Yakov wants to be my coach, I don’t want him to feel obligated just because I’m dating Viktor.”</p>\n<p>Phichit sighs, but before he gets a chance to say anything there’s a knock on his door, and Yura comes in without waiting for him to answer. “You guys are so loud, I can hear you, you know,” he bounces down on the edge of Yuuri’s bed. “Yakov would love to take you on, don’t be ridiculous, and it’s not because of Viktor.”</p>\n<p>“Ah,” he blinks, sheepish, “sorry Yurochka, I didn’t mean for you to hear any of that.”</p>\n<p>He waves his hand, “Whatever, don’t worry about it. But Phichit’s wrong,” Phichit makes an offended sound, but doesn’t attempt to interrupt any more than that. “Don’t stay because of Viktor. If he really loves you, the two of you will manage long distance just fine. If he doesn’t, I’ll be here to punch him in the face. Don’t stay because of me either, Grandpa’s going to be stuck in the hospital for another couple months, but I can take care of myself. So don’t do anything because of Viktor, or me, or the media, or anyone else either. The <em>only </em>reason you should stay is if it’s what you <em>want</em>. You’re family,” he says firmly, “and you’ll stay family even if you go back to Detroit.”</p>\n<p>Yuuri stares at him for a long moment, and Yura’s face is slowly turning red from embarrassment. Before he can take any of it back, Yuuri pulls him to feet and grabs him in a tight hug. “Okay then,” he says, trying not to sound as choked as he feels, “I’ll do only what I want then.”</p>\n<p>“Good!” Yura says, although it comes out kinda muffled since his face is pressed into Yuuri’s sternum.</p>\n<p>He hears the tell tale click as Phichit takes a photo of them through the webcam. He flips him off behind Yura’s back, and knows he angled it correctly when his best friend cackles.</p>\n<p align=\"center\">~</p>\n<p>In the Grand Prix Finals, Yuuri loses to Viktor by three quarters of point. He takes silver, while Chris gets bronze. He can see Yura and Phichit booing from the stands, Yura’s gold medal from the junior competition around his neck, and he has to bite his lip to keep from laughing as the cameras flash all around them.</p>\n<p>“Do I have to drag you out tonight, or will you come willingly?” Chris asks from the corner of his mouth.</p>\n<p>Yuuri sighs. Sara, Michele, Mila, and Georgi are all here too. It’s going to be a complete disaster. “Sure.”</p>\n<p>Chris beams.</p>\n<p>After they get down from the podiums, he goes to stand by Celestino for the last time. There’s a cluster of reporters waiting for them, to officially release what the ice skating world has been buzzing about for weeks – he and Celestino going their separate ways, and his permanent relocation to St. Petersburg to study under Yakov.</p>\n<p>And to be closer to his boyfriend and Yurochka, but that’s something he’ll leave to the rumor mill, also known as Phichit.</p>\n<p>There’s still so much to figure out – shipping all his stuff from Detroit, and getting his permanent residency for Russia, and finding a university that at least teaches in English once he maxes out how many online credits his current college will accept.</p>\n<p>At the very least, he won’t have to worry about finding a place to live. He’s staying with Yurochka until his grandfather is fully recovered, and after that –</p>\n<p>Well, Viktor had asked him to move in with him last night.</p>\n<p>He knows this should be an ending, moving from Detroit and leaving Celestino, but it doesn’t feel like it.</p>\n<p>It feels like the last beginning he’ll ever need.</p>"
}