{
  "id": "10438683",
  "url": "https://archiveofourown.org/works/10438683?view_full_work=true",
  "author": [
    "Sharleena"
  ],
  "title": "Only breathing",
  "rating": "Mature",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "방탄소년단 | Bangtan Boys | BTS"
  ],
  "relationships": [
    "Min Yoongi | Suga/Park Jimin"
  ],
  "characters": [
    "Min Yoongi | Suga",
    "Park Jimin (BTS)",
    "Kim Taehyung | V",
    "Jeon Jungkook",
    "Kim Namjoon | Rap Monster",
    "Kim Seokjin | Jin",
    "Jung Hoseok | J-Hope"
  ],
  "additional_tags": [
    "Alternate Universe - Gangsters",
    "Alternate Universe - Criminals",
    "Violence",
    "Drugs",
    "Drug Use",
    "Non-Consensual Drug Use",
    "Explicit Language",
    "Gunplay",
    "Implied/Referenced Rape/Non-con",
    "Sexual Abuse",
    "Dubious Consent",
    "Druglord!Yoongi",
    "Prostitute Park Jimin",
    "Disturbing Themes",
    "Angst",
    "side vkook",
    "Physical Abuse",
    "This work has been translated to Russian",
    "Fluff and Angst",
    "Fluff"
  ],
  "language": "English",
  "series": "Part 1 of Just Breathe",
  "published": "2017-03-25",
  "completed": null,
  "words": "26,461",
  "chapters": "1/1",
  "comments": "324",
  "kudos": "9,497",
  "bookmarks": "2,370",
  "hits": "177,497",
  "summary": "<p>As a drug lord, Yoongi knows the rules:<br>-you don't ask questions;<br>-whatever the client wants, you sell it;<br>-you don't do loans;<br>-you don't fall in love with a customer's whore.<br>Yoongi knows the rules. And because he knows them he also knows when he's about to break one.</p>",
  "notes": "<p>There's a lot of shit here and I don't know why. This is me attempting to write something serious. I apologize for making Jimin the damsel in distress but it was necessary.<br>A huge thank you to Ury who kept me working when I felt like giving up on this.</p>\n<p>You can read this work translated in Russian <a href=\"https://ficbook.net/readfic/5446732\" rel=\"nofollow\">here</a> </p>\n<p>EDIT: incredible artist itsyasyall ACTUALLY MADE AN AMAZING FANART OF WHEN YOONGI AND JIMIN MEET FOR THE FIRST TIME AND HERE IT IS <a href=\"https://itsyasyall.tumblr.com/post/158907765983/hes-new-gao-says-got-him-a-few-days-ago\" rel=\"nofollow\"> AND HERE IT IS</a> GIVE THEM LOVE I CRIED WHEN I SAW IT</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>EDIT: I am overwhelmed with the love this fic received, seriously, thank you so much! Also, wanted to let you know that I'm currently writing two extra chapters (say whaaaaat). The first one will be about the origins of Taehyung and Jungkook plus some missing moments taken from the first chapter, the last one will be an epilogue for Yoongi and Jimin as I'm not satisfied with how I ended this. I hope I'll see you there! I also made some aesthetics as visual references for it if you're interested <a href=\"https://twitter.com/Love_Sharleena/status/857619953557569536\" rel=\"nofollow\">here</a> </p>\n<p>Thank you to everyone who read this! Remeber children, kudos and comments are what keeps an author alive!</p>\n<p>I got <a href=\"https://icecream-suga.tumblr.com/\" rel=\"nofollow\">Tumblr</a> and <a href=\"https://twitter.com/Love_Sharleena\" rel=\"nofollow\">Twitter</a> come scream at me</p>",
  "text": "<p>\n<span>breath</span>\n</p>\n<p>[breth] <br>\n<br>\n<span>noun</span></p>\n<p>1. the air inhaled and exhaled in respiration.</p>\n<p>2. respiration, especially as necessary to life.</p>\n<p>3. life; vitality.</p>\n<p><br> </p>\n<p> </p>\n<p>Yoongi thinks that it's far too early for such bullshit. Honestly, it's not even ten in the morning, he should be in bed right now, not getting dressed to meet a customer. Yoongi's customers know that business doesn't start until noon, so why even bother? But of course, Yoongi also knows that in this particular case he doesn't really have a choice.</p>\n<p>As a drug lord, Yoongi knows the rules:</p>\n<p>-you don't ask questions;</p>\n<p>-whatever the client wants, you sell it;</p>\n<p>-you don't do loans;</p>\n<p>-you don't fall in love with a customer's whore.</p>\n<p>Those rules applied even harder when the client is Wen Gao.</p>\n<p>Wen Gao is a fucking asshole, one of the worst humans that ever stepped on planet Earth, but he's got money. It happens when you're one of the most influential arms dealer of the country. Besides, isn't Gao one of his best clients? He might be scum, but he's rich scum.</p>\n<p>So Yoongi makes an effort in looking at least decent, going as far as to wash his face with cold water and even comb his hair. With his fingers because no one has time to actually use a brush. Does he even own a brush? He might need to check.</p>\n<p>Yoongi finds a white t-shirt scattered on the floor and since it doesn't smell bad he decides that's good enough for the day. He shrugs on a pair of jeans and finds his leather jacket and calls it a day. Gao might be rich scum but he's not rich scum that Yoongi needs to impress.</p>\n<p>As he leaves his comfortably dark room he's welcomed with way too much light. Yoongi sighs and rubs his fingers on his eyes, trying to get accustomed to the sudden brightness. Seokjin must have done something with the shutters as they're all up, letting the sunlight hit the penthouse.</p>\n<p>“Fucking windows.” Yoongi mutters, making his way to the kitchen counter “Fucking penthouse basically made of fucking glass.”</p>\n<p>Yoongi finds some coffee still in the jug from the night before and decides that he's too lazy to actually make fresh one, so he fills a mug and shoves it rather brutally in the microwave.</p>\n<p>He checks his phone. Five minutes to ten. So fucking early. The microwave starts beeping and Yoongi takes the warm cup of coffee, taking a generous sip and sighing contently. Now he can start thinking of business.</p>\n<p>The intercom suddenly rings, startling Yoongi who almost loses his grip on his precious mug. After a muttered curse, the man goes to the intercom and answers it.</p>\n<p>“What?”</p>\n<p>“Sir, Wen Gao is here for you.”</p>\n<p>Yoongi frowns at the voice. It's thursday, so it must be Mike at the lobby, right? Then why is his voice so different? No, wait, Mike works in the afternoon, so this must be...</p>\n<p>“Let him in, Nate.”</p>\n<p>“Yes, sir.”</p>\n<p>Gao is early. Yoongi hates people who are early, it's absolutely inconsiderate.</p>\n<p>He leans with his back to his desk and waits for Gao to arrive, drinking his coffee slowly and savouring the taste. This was going to be a long day and he had just started.</p>\n<p>After a few minutes, someone knocks on the door and Yoongi goes to open it.</p>\n<p>Wen Gao is a middle aged man who is very close to be considered a senior citizen, a belly that is large because of too many beers and too much food, small black eyes and a few hair left, grey, that he still refuses to just cut off even though they make him look ridiculous. All in all, Wen Gao looks absolutely mundane, if not hideous. But his suit is hand-made, his shoes italian, his rolex heavy and his bank account fatter than him.</p>\n<p>“Min! It's good to see you!” the man exclaims, making his way inside the penthouse as Yoongi stands beck to let him in.</p>\n<p>“Gao, it's good to see you too.” Yoongi makes to close the door but Gao stops him.</p>\n<p>“I brought someone with me, I hope it's not an inconvenience.” he explains “He was looking for a place to smoke, a balcony or something.”</p>\n<p>Yoongi nods.</p>\n<p>“He can smoke here.” he says “I don't mind.”</p>\n<p>“I'll go fetch him, then.”</p>\n<p>Yoongi goes to his couch and sits heavily, stopping himself from yawning loudly. Why would he bring someone else and not even tell him beforehand? Asshole.</p>\n<p>Gao comes back a few moments later, an arm snaked around someone's waist, and he closes the door.</p>\n<p>Yoongi doesn't look at them as he searches for his own pack of cigarettes in the pockets of his jacket. When he finds it he takes one out and puts it between his lips, lighting it up immediately and letting out a lungful of smoke.</p>\n<p>“Please, sit. Can I offer you anything?” Yoongi asks, gesturing for the two armchairs in front of the couch.</p>\n<p>“No, thank you.” Gao says as he sits down “Peach, do you want something?”</p>\n<p>Peach? At that, Yoongi decides to spare a glance at whoever it is Gao brought with him. He ends up staring. “Peach”, if that's his real name, is a boy. Short but build, small hands with expensive rings adorning his fingers and the prettiest face Yoongi has ever seen on a boy.</p>\n<p>This must be Gao's new toy.</p>\n<p>Peach doesn't speak, there's a cigarette hanging from his lips, he looks at Yoongi's lighter.</p>\n<p>“Need a light?” he asks, lifting his lighter up.</p>\n<p>Peach leans down to it, Yoongi can now see how full and plump his lips look, how pretty his eyes are under the heavy kohl. Fuck, he's not just pretty, the kid is a work of art. And he shouts “expensive” from every pore.</p>\n<p>Yoongi click the lighter and the flame comes out, lighting up Peach's cigarette. The boy holds his gaze for a second, locks of pink hair covering messily his brow, then he stands back straight and goes to sit on the arm rest, next to Gao. The man holds an arm around his waist, a gesture that looks so possessive it's almost hilarious.</p>\n<p>“He's new.” Gao says “Got him a few days ago.”</p>\n<p>Yoongi hums. “Does he speak?”</p>\n<p>“Only when I ask him to.” Gao's smile is wry “Peach, say hello to mister Min.”</p>\n<p>Peach smiles, it doesn't reach his eyes.</p>\n<p>“Hello, Yoongi.” he says, voice light and sweet.</p>\n<p>“Be respectful, Peach, you can't just call him Yoongi.”</p>\n<p>“It's fine, don't really care.” Yoongi inhales some smoke “You brought him here to brag?”</p>\n<p>Gao lets out a small laugh “I'm showing him off. After all, I take pride in him. He's a korean like you. Isn't he a beauty?”</p>\n<p>Peach cocks his head to the side.</p>\n<p>“I guess he is.” Yoongi concedes.</p>\n<p>Gao nods.</p>\n<p>“You're no fun, Min.”</p>\n<p>“I've been told that.” Yoongi sits back more comfortably “Should we get down to business? I'm busy today.”</p>\n<p>Gao's face turns serious.</p>\n<p>“Of course.” he says as he slips a hand in the pocket of his tailored jacket, taking a piece of paper out and putting it on the small coffee table in front of him “Here's my order for the week.”</p>\n<p>Yoongi takes the paper and unfolds it, eyeing it for a few seconds.</p>\n<p>“There's more stuff than usual.” he says “You want more Valium than last week. Heroin's the same as usual. Morphine?” Yoongi looks up at Gao.</p>\n<p>“I have a man that's been shot pretty badly.” Gao says “We patched him up, but the pain makes him useless and I need him active.”</p>\n<p>Yoongi shrugs. “Don't get pissed if he turns into a fucking junkie later on.”</p>\n<p>“I sure hope he becomes a junkie.” Gao licks his lips “Junkies are easy to order around, you have too much leverage on them, they become puppets.”</p>\n<p>Yoongi can't say Gao's completely wrong.</p>\n<p>“You'll get your stuff tomorrow night, usual place.” Yoongi says “Usual hour.”</p>\n<p>“Payment's method?”</p>\n<p>“Same as always, don't leave tracks.”</p>\n<p>“When do I ever?”</p>\n<p>Yoongi wants to say that he can name a few instances, but decides to stay quiet.</p>\n<p>“Actually, Min, I didn't bring Peach here just to show him off.”</p>\n<p>Yoongi arches an eyebrow and shifts his attention on the boy. He looks way too at ease, sitting on that arm rest like he owns it, eyes confidently staring at him. At least he's using one of the ashtrays he found on the coffee table instead of letting the ash fall on the ground.</p>\n<p>“From next week, Peach will be the one who places the orders.”</p>\n<p>Yoongi frowns. Gao was going to send his fucking boy toy to place drug orders?</p>\n<p>“Why?” he asks.</p>\n<p>“I'll be real busy starting tomorrow.” Gao clears his voice, his hand sliding up and down Peach's side, lifting his t-shirt a little and showing tanned skin “There's a huge deal coming. A massive order of weapons for really special customers. It will last for a while, it's a partnership that will take all of my time and attention. Can't waste time placing orders.”</p>\n<p>“Why him? Why not one of your men?”</p>\n<p>At that, Gao actually laughs genuinely, Peach smiling a little as well.</p>\n<p>“Fuck, Min, you can't trust men like mine to deal with drugs. Most of them are fucking junkies! But Peach, here... he doesn't like drugs. Not the heavy ones. And he doesn't know the coding we use. Don't worry, Min, Peach will just bring the order to you, then Alec will come and take the drugs at usual. He knows how to deal with them, how to bring them where they need to be... but I wouldn't trust him with the order. It's easy to change something so that he orders more and keeps some for him.”</p>\n<p>Yoongi realizes that Gao is right. Once the order is placed no one would actually know if someone had added something. That's the thing about being able to not leave tracks, things are fucking easy to bend at someone's will. The important part was that little piece of paper, not the actual merch.</p>\n<p>“Fine.” Yoongi says, smoke coming out of his nostrils “I'll inform the lobby to let him in, he'll have to give them a picture.”</p>\n<p>“I love taking pictures.” Peach says, his cigarette burns out and he stomps it in the ashtray.</p>\n<p>Yoongi sighs. “Is Peach even his name?”</p>\n<p>Gao smirks.</p>\n<p>“It is now. We should go, shouldn't we? We took too much time from mister Min anyway.” Gao stands up and Yoongi follows suit, Peach standing up as well, straightening his shirt down “You've been very good, baby. Do you want a reward?”</p>\n<p>Peach makes a sound that very much resembles a purr.</p>\n<p>“I want new rings.”</p>\n<p>“I'll buy an entire jewelry if that's what you want.” Gao turns to Yoongi “I guess I'll see you once I find some time. In the meantime, enjoy Peach's presence.”</p>\n<p>Yoongi finds it wise to not say that he will. It's clear that Gao really likes this new one. The previous one was cute as well, well behaved and quiet, but Gao never gave him this much attention. Yoongi knows better than making one of his best clients jealous.</p>\n<p>Yoongi guides them to the exit, opening the door for them. Peach turns around before they disappear outside.</p>\n<p>“I'll see you soon, Yoongi.” he says with an amused smile.</p>\n<p>Yoongi nods and bids his goodbyes, closing the door and waiting for a few seconds before sighing.</p>\n<p>It's not even half past ten but he already wants to crawl back to bed.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>“We're getting a new stash of opiates next week. Heroin mostly, hydrocodone too.” Namjoon crosses his legs “Pills are coming soon as well. Seokjin will take care of 'em.”</p>\n<p>“Costs?” Yoongi asks.</p>\n<p>“Not more than usual.”</p>\n<p>“Good, we lost a client last week, don't want to lose incomes.”</p>\n<p>“Which client?”</p>\n<p>“Wasn't it Alvarez?” Hoseok chimes in the conversation, filling a glass with water from Yoongi's kitchen “Owner of those clubs.”</p>\n<p>“Yeah, it's him.” Yoongi sniffs “He got shot.”</p>\n<p>“Tough shit.” Namjoon says.</p>\n<p>“Kinda asked for it. The idiot tried to get his hands on the woman of a mob boss.”</p>\n<p>“Definetely asked for it, then.” Namjoon stands up from the chair and ruffles his blond hair “There should be no loss, though, I've been checking. We're going steady as ever.”</p>\n<p>“Good.” Yoongi lets out a breath “Then we're done for today. What time is it?”</p>\n<p>“Almost time to order some fucking take out.” Hoseok says “I'm fucking starving.”</p>\n<p>“I'm feeling italian.” Namjoon gives Yoongi a look “Italian?”</p>\n<p>“Sure.” Yoongi takes his jacket off and tosses it without a care on the floor, smoothing the t-shirt with the palm of his hands.</p>\n<p>Hoseok calls the usual italian restaurant and the three men sit on the couch together, lazily looking at whatever bad tv-show that was on in that moment without really paying attention as they wait for their food.</p>\n<p>“What's this story that Gao bought some fresh meat?” Hoseok asks.</p>\n<p>“Yeah, it's his new toy.” Yoongi answers, scratching his knee “Gao calls him peach.”</p>\n<p>“Peach? The fuck?” Namjoon shakes his head “Is he cute?”</p>\n<p>“Cute?” Yoongi smiles “That kid's probably the prettiest thing I've ever laid my eyes on. You should see him, he's a fucking masterpiece. All perfect lips and smiles, he's dangerous as hell. Can't be older than twenty.”</p>\n<p>“Shit.” Hoseok chuckles “Gao, that old sick fuck, always taking 'em young. He probably can't even get it up with all the shit he snorts.”</p>\n<p>Namjoon lets out a low laugh, quiet and pleasurable as always.</p>\n<p>“Fucking Gao, thinks he's a hot blooded american when he's chinese. He's fucking asian like us, thinks he's better than us because he thinks he can fool people into believing he wasn't born in Chengdu.” Yoongi shakes his head “That man can't even hide his fucking accent.”</p>\n<p>“He tries to sound like he's from Texas.” Namjoon says “He sounds like a chinese trying too hard to sound like he's not from China.”</p>\n<p>“If he can't get it up with that kid then he's really a finished man.” Yoongi says “Wonder what happened to the last one. What was his name again?”</p>\n<p>“Don't know.” Namjoon replies “Don't want to know what happened to him either.”</p>\n<p>Yoongi makes a noise of agreement. “Peach will be placing the orders from now on, Gao's too busy with a new deal.”</p>\n<p>“Is it big?”</p>\n<p>“Apparently.” Yoongi looks at Namjoon “Why?”</p>\n<p>“It's always good to keep tabs on our client's affairs. We don't wanna deal with broke assholes if something goes bad. Still, if he's sending a new toy it means he's reliable. Or that Gao trusts him, at least.”</p>\n<p>There's silence for a while, the buzzing of the tv keeping them distracted, before Hoseok speaks.</p>\n<p>“Well, would you look at us.” he murmurs “Three strapping young lads, talking about a client's bitch whilst waiting for cheap italian food. Aren't we living the dream? God bless America.”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>The week goes by and Yoongi doesn't have to bark orders too much, doesn't have to threaten anyone and doesn't have to break teeth. Which means that it has been a good week.</p>\n<p>Thursday arrives and with it Peach arrives as well.</p>\n<p>It's four in the afternoon when the intercom buzzes and Mike informs him that “Gao's man is here”, so Yoongi instructs him to let him through.</p>\n<p>When he opens the door he doesn't expect to be greeted with a flash of white teeth and a bright smile.</p>\n<p>“Hello, Yoongi.” Peach immediately gets inside, not bothering waiting for Yoongi to step back and he almost bounces his way to the couch.</p>\n<p>“Someone's taking liberties.” Yoongi says, no real bite in his words.</p>\n<p>“I always do.” he says, pulling his pink hair back from his forehead “That's why everyone likes me.”</p>\n<p>“I don't.”</p>\n<p>“You'll learn to.”</p>\n<p>Yoongi sighs.</p>\n<p>“Do you want anything? Something to drink?”</p>\n<p>“Tea!” Peach exclaims rather cheerfully “Do you have tea?”</p>\n<p>Yoongi nods and goes to the kitchen, starts the boiler and waits for the water to be ready.</p>\n<p>He gives Peach a quick look, the boy still sitting on the couch with his legs crossed and an amused smile stretching his lips.</p>\n<p>“Gao said you're korean.”</p>\n<p>The boy nods. “I was born in Busan. Apparently.”</p>\n<p>“Apparently?”</p>\n<p>He shrugs. “Don't remeber much from those times.”</p>\n<p>“You speak korean?”</p>\n<p>“Not even a word. I probably used to, though. Can't remember.”</p>\n<p>Yoongi decides not to inquire.</p>\n<p>“Do you speak korean, Yoongi?”</p>\n<p>“Yeah.” Yoongi takes the boiler and fills a mug with hot water, preparing the boy's tea “I was born and raised there.”</p>\n<p>“You don't have an accent.”</p>\n<p>“Had to make it disappear.”</p>\n<p>Peach doesn't ask other questions, Yoongi goes to him and hands him the mug, the boy mutters a thank you and keeps the cup between his hands with a content smile.</p>\n<p>As Yoongi sits on one of the armchairs, he realizes that Peach isn't just a pretty boy, he's fucking beautiful. Crazily enough, there's a sort of naive aura around him.</p>\n<p>“The order.” Peach takes a piece of paper from the back pocket of his ripped jeans and tosses it on the coffee table, sipping blissfully at his tea.</p>\n<p>Yoongi takes it and examines it. It doesn't look like someone tried to change anything, the handwriting is definetely Gao's and Yoongi would recognize that deep blue ink everywhere. The order is real and untouched, the coding message they use for the products is spotless.</p>\n<p>“Good. Tell Alec that it's the usual spot and usual time.”</p>\n<p>Peach nods, then he frowns. “Do I... do I leave now, or...?”</p>\n<p>“I mean, I ain't kickin you out.” Yoongi replies “Finish your tea or whatever.”</p>\n<p>Peach seems to relax visibly at his words, and he slumps deeper in the couch.</p>\n<p>“Good, 'cause I'm bored out of my mind when owner isn't home.”</p>\n<p>The boy's words are processed rather slowly by Yoongi's brain. When he does understand what he has just said, however, Yoongi tries his best to not let his discomfort show.</p>\n<p>“Owner?” Yoongi asks.</p>\n<p>“That's what he wants me to call him.” Peach replies, completely unfazed.</p>\n<p>\n<em>That's creepy. That's fucking creepy.</em>\n</p>\n<p>“What's your name, kid?”</p>\n<p>“I told you, Peach.” he pouts, as if he couldn't get any cuter “Also, don't call me kid. I might not look like it, but I'm twenty two.”</p>\n<p>He looks way younger.</p>\n<p>“Peach isn't your real name.”</p>\n<p>“It's the name I have now.”</p>\n<p>“I'm not calling you peach when you're here.” Yoongi says, voice firm. That's the voice he uses with his men when they fuck up. The boy in front of him doesn't even flinch. “What's your real name? I'll call you with that when we're alone.”</p>\n<p>The pink haired boy stays quiet for what feels like minutes, the tea in his mug slowly cooling down. He holds his gaze with no trace of fear or intimidation. Then, he finally speaks.</p>\n<p>“Jimin.”</p>\n<p>Yoongi nods.</p>\n<p>“That's a name I can use.”</p>\n<p>Jimin tilts his head.</p>\n<p>“Owner says you're dangerous. One of the most dangerous men he's ever met. You don't look dangerous.” Jimin drinks some tea “Which is probably what makes you dangerous.”</p>\n<p>“You don't look like you're scared of me.”</p>\n<p>“Should I?”</p>\n<p>Yoongi considers it for a while.</p>\n<p>“No.” he finally says.</p>\n<p>“Okay.” Jimin looks around himself “I like this place. Owner's house is bigger, but not much light comes in. Shutters are almost always down.”</p>\n<p>Yoongi makes a mental note to always leave the shutters up and the windows wide open when Jimin is here. He doesn't know why and he decides to not dwell on it.</p>\n<p>“I should go now.” Jimin says, gulping down the rest of his tea “I want to go check a new shop, I like the clothes there. I know where the exit is.”</p>\n<p>Yoongi stands up to walk him to the door anyway. “I'll see you next thursday, Jimin.”</p>\n<p>“Yes.” Jimin opens the door and, before he steps out, he says “You're cute, Yoongi, but you need to get some sun on your skin, you look like a ghost.”</p>\n<p>Then he leaves, smile on his lips and lightness in his steps.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>“I'm too old for this shit, Yoons.” Seokjin whines, his head lolling and his body slumped on the sofa.</p>\n<p>“Is that so?” Yoongi asks, not really listening and staring at the orders on his laptop.</p>\n<p>“Yes. My joints hurt. My back hurts. Hell, even my kidneys hurt.”</p>\n<p>Yoongi hums.</p>\n<p>“Too much fatigue. Lifting those packages is so tiring.”</p>\n<p>“Jin, you don't even lift a single gram of those boxes, the</p>\n<p>workers do, you just look at them.”</p>\n<p>Seokjin snaps his eyes open, staring at Yoongi as if he had just spat on his dog.</p>\n<p>“Min Yoongi, I feel their fatigue, I sense it, and therefore it is my fatigue too! Hell, yesterday Shane had in his arms so much cocaine, it must have been so heavy.” he sighs “I felt a crack in my spine just by looking at him.”</p>\n<p>Yoongi chuckles and Jin seems satisfied, so he goes back to closing his eyes and resting on Yoongi's couch.</p>\n<p>“I've seen Peach last thursday.” Jin suddenly says.</p>\n<p>“Yeah?”</p>\n<p>“Yeah, as he was leaving the building. He introduced himself to me, he was so cute.” Jin sighs “Absolutely adorable.”</p>\n<p>Yoongi hums.</p>\n<p>“His name ain't Peach, you know?”</p>\n<p>“What's his real name?”</p>\n<p>“Jimin.”</p>\n<p>“That's a nice name. He's too cute for his own good, all pretty smiles and perfect face.” Jin smile falls quickly “Such a shame, really.”</p>\n<p>Yoongi lifts his eyes from his desktop and focuses on Jin. “What do you mean?”</p>\n<p>“It's a shame that a boy as sweet as him is Gao's.” Jin's voice is low “A shit like Gao doesn't deserve him.”</p>\n<p>Yoongi frowns. Sure, Gao is an old man who has more blood on his hands than Yoongi can even imagine, but he seems to treasure Jimin.</p>\n<p>“It looks like he takes good care of him, though.” Yoongi says and Jin's lips turn down, his expression one of disgust.</p>\n<p>“For now.” he mutters “I know some real dark shit about Gao.”</p>\n<p>“What shit?”</p>\n<p>Jin turns to look at him. “Do you know what happened to his last toy?”</p>\n<p>Yoongi shrugs.</p>\n<p>“Gao's toys are under contract, right?” he asks, Jin nods “Then the contract expired. I'm guessing.”</p>\n<p>Jin sends him a sad look as he takes a deep breath.</p>\n<p>“No, the contract didn't expire. But in a way, it did.” the man shifts his attention to the ceiling “Gao broke his last toy.”</p>\n<p>Yoongi ignores the shiver down his spine. He already knows what Jin means, but he finds himself asking the question anyway.</p>\n<p>“What do you mean?”</p>\n<p>“He broke him.” Jin repeats “Gao killed the last one with a bullet in the skull.”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Thursday comes, the weather starts getting chiller, winter slowly making its way through. When Yoongi opens the door for Jimin, the boy looks almost ethereal, a relaxed smile on his lips and a soft looking huge sweater keeping him warm.</p>\n<p>“Hello Yoongi!” Jimin comes inside and immediately goes straight for the couch “Can I smoke?”</p>\n<p>“Sure.” Yoongi replies and he decides to sit on the couch as well, keeping a discreet distance from Jimin.</p>\n<p>He's not wearing make up today. Yoongi decides he looks better without it.</p>\n<p>Jimin takes two cigarettes and offers one to Yoongi, who takes it and lights it up, doing the same for Jimin.</p>\n<p>“Here's the order.” Jimin says, giving him the usual piece of paper. Yoongi reads it for a few seconds.</p>\n<p>“Still morphine?”</p>\n<p>Jimin nods.</p>\n<p>“The guy that was shot is already addicted. Is it possible? To get addicted so quickly?”</p>\n<p>“With morphine? Yes.” Yoongi replies, sliding the piece of paper in his pocket “Morphine is one of the worst. You link it with the loss of pain so when you don't take it your brain reminds you that you should be in pain.”</p>\n<p>Jimin nods.</p>\n<p>“I don't like drugs.” he says, breathing out some smoke “Not the really hard ones. They're scary.”</p>\n<p>“They are.” Yoongi agrees.</p>\n<p>“Owner uses the drug to keep his men loyal. Turns them into junkies. I'm surrounded by zombies there.” Jimin sighs “It's so boring when owner isn't home. That's why I'm happy when I come here, at least I have an excuse to go out and do something. And you're not a zombie.” Jimin looks at him “Do you take drugs?”</p>\n<p>Yoongi snorts. “I'm not fucking stupid kid, I'm clean of that shit.”</p>\n<p>Jimin smiles softly, features lighting up. He looks frail. He looks easy to break. Yoongi remembers Jin's words.</p>\n<p>“How is Gao? I mean with you, how does he treat you?”</p>\n<p>Jimin lets some ash fall in the ashtray before he answers.</p>\n<p>“He spoils the fuck out of me. I guess he treats me well. It's not bad, probably the best job I ever had. He gives me so much money I almost don't know what to do with it, I can buy whatever I want.”</p>\n<p>Yoongi hums and guesses that that's probably all a guy like Jimin actually needs. The boy looks like he really enjoys owning expensive stuff, Yoongi can't exactly blame him.</p>\n<p>“Besides, Owner can barely get it up.”</p>\n<p>Yoongi chokes on a lungful of smoke under Jimin's amused look.</p>\n<p>“Shit.” Yoongi croaks and Jimin giggles.</p>\n<p>“Too much information?”</p>\n<p>“A little, yeah.”</p>\n<p>“Well, it's true. I'm not surprised, with all the shit he takes. Heroin especially. He either can't get it up and, when he can, he can barely keep it up. So, yeah, it's one of the best jobs I ever had.”</p>\n<p>Yoongi concedes him a smile. Well, Jimin clearly doesn't have a problem in admitting that Gao is disgusting.</p>\n<p>“I hate it when he snorts cocaine off me, though. That shit makes him hard as wood.”</p>\n<p>Yoongi frowns at his words, sitting a little straighter on the couch.</p>\n<p>“Off you?”</p>\n<p>Jimin nods, stomping the cigarette in the ashtray.</p>\n<p>“He likes to snort it from my thighs. Owner loves it, really, he even takes pictures of the coke's stripes before he snorts them. Don't really blame him, I got nice legs.”</p>\n<p>Yoongi didn't realize he was holding his breath until he inhales and his throat hurts.</p>\n<p>“I don't like it when you call him owner.” he says “It's creepy.”</p>\n<p>Jimin shrugs. “It's what he wants me to call him.”</p>\n<p>“Don't call him that when you're here. Really, it's gonna give me fucking nightmares.”</p>\n<p>Jimin looks at him for a few seconds, his gaze heavy with something that Yoongi can't recognize.</p>\n<p>“Then what should I call him?”</p>\n<p>“Call him with his name or whatever.”</p>\n<p>The moment Yoongi says it Jimin visibly stiffens and now Yoongi knows what it is he saw in his eyes: fear.</p>\n<p>“I can't call him with his name, Yoongi.” Jimin whispers.</p>\n<p>Yoongi gulps and nods. That was stupid of him. He's forgetting one thing: if Jimin calls Gao “owner”, it's because Gao literally owns him.</p>\n<p>“No, you're right. Sorry.”</p>\n<p>“It's okay. It's not like I enjoy calling him owner.” Jimin grimaces “Don't... tell him I said that.”</p>\n<p>“I won't. I won't tell him a single thing you tell me when you're here.” Yoongi smiles when he sees Jimin relaxing “Still, there's no way I'll hear the word “owner” one more time. Pick a nickname or something.”</p>\n<p>Jimin squints his eyes, clearly giving it some thought.</p>\n<p>“How do you call an older person in korean? Just... a plain, mundane older person.”</p>\n<p>Yoongi can feel the corner of his mouth curling up in a satisfied smile.</p>\n<p>“Ajussi.” he replies.</p>\n<p>“That's how I'll call him when I'm with you, then. Ajussi.” he says it as if he's tasting the way the word is on his tongue “I like it. I like spending time with you.”</p>\n<p>Yoongi arches an eyebrow. “You like spending time with a druglord?”</p>\n<p>“You're nice. And kind.”</p>\n<p>“You don't know me, Jimin. Kind is not a word that people use when they talk about me.”</p>\n<p>Yoongi almost feels shame if he thinks that Jimin finds him “kind”. Yoongi is a criminal, Yoongi has done things so shady and dark that sometimes they still haunt him in his sleep. Just like Gao, Yoongi has blood on his hands and broken families on his conscience.</p>\n<p>And yet, Jimin just smiles and this time it's different. This time his smile is real and warm, his eyes turn into crescents, almost disappearing and he looks like a kid.</p>\n<p>“Yoongi, trust me, you're kind.” Jimin stands up “I should go, the driver's waiting for me.”</p>\n<p>Yoongi walks with him to the door and opens it for him, Jimin slips out his penthouse still wearing that smile.</p>\n<p>“I'll see you next thursday, Yoongi.”</p>\n<p>Yoongi nods, Jimin leaves.</p>\n<p>When Yoongi closes the door behind the boy, the penthouse suddenly looks too big for him alone.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>“All the stashes were dispatched.” Taehyung says, his head resting on Jungkook's lap and his legs sprawled all over his couch. Yoongi feels like he bought a couch that is way too comfortable since everyone feels entitled to just use it as they want.</p>\n<p>“No problems?” Yoongi asks, going through some papers.</p>\n<p>“Just a guy. What was his name again?” Taehyung asks Jungkook.</p>\n<p>“Miles.” the boy replies, rubbing circles with his thumb on Taehyung's wrist “He's late with a payment. Didn't have enough money.”</p>\n<p>“What did he buy?” Yoongi asks.</p>\n<p>Jungkook shrugs. “Nothing big, just some pills. He swore he'll pay the total amount next time.”</p>\n<p>“How much money does he owe us?”</p>\n<p>“A hundred bucks.”</p>\n<p>Yoongi nods.</p>\n<p>“Give him a week, if next time he's still short of money break a finger or something.”</p>\n<p>Jungkook makes a military salute. “Sure thing, boss.”</p>\n<p>“Kookie likes breaking fingers.” Taehyung says rather cheerfully.</p>\n<p>“No, I don't.” Jungkook retorts with a pout “But you hate it, so someone has to do it.”</p>\n<p>Taehyung coos at him, pinching Jungkook's cheek and making the younger boy blush.</p>\n<p>Yoongi sighs. Taehyung and Jungkook are his best runners, but sometimes he wishes they weren't. They're young and stupidly in love, the fear that Jungkook will do something stupid or rushed is always in the back of his mind, distracting him more than he likes to admit.</p>\n<p>Yoongi likes those two, he'd go as far as to say that he considers them his younger brothers. He doesn't like having them in the streets, but he has no choice. Taehyung is pretty enough to not raise suspicions on the streets, Jungkook is young enough to not earn a policeman's attention.</p>\n<p>“Oh, more importantly!” Taehyung looks at Yoongi “We met Jimin last thursday!”</p>\n<p>Yoongi raises an eyebrow. Goddamn, Jimin had one hell of a timing if everyone managed to meet him as he's leaving.</p>\n<p>“Good for you.”</p>\n<p>“Didn't it feel like he was buying time?” Taehyung asks Jungkook “Like he was stalling.”</p>\n<p>The younger boy nods. “He was leaning on his car, smoking. The driver was clearly impatient and wanted to leave, but Jimin was ignoring him. When he saw us he asked if we knew you and when we said that we did he started talking to us. Told us his name and everything.” Jungkook pauses “He's funny, isn't he?”</p>\n<p>Taehyung vigorously nods.</p>\n<p>“He's funny and adorable. So cute.”</p>\n<p>“Everyone seems to find him adorable.” Yoongi mutters.</p>\n<p>“That's because he is. He's... charming?” Tae looks up at Jungkook “Definetely charming.”</p>\n<p>Yoongi makes a noise that could be either of irritation or agreement. He doesn't know, he decides he also doesn't care.</p>\n<p>“How is he?” Jungkook asks “I'm curious. He's Gao's new toy and he's reliable enough that Gao trusts him with the order placement. So how is he?”</p>\n<p>Yoongi lifts his eyes from the files he was examinating and looks at Jungkook for a few seconds.</p>\n<p>“He's... noisy.”</p>\n<p>Taehyung frowns “Noisy?”</p>\n<p>“He speaks a lot.” Yoongi pauses “I think he's bored. Or lonely. Probably both.”</p>\n<p>Taehyung hums, tapping his fingers on his knees.</p>\n<p>“I think he's the kind of person who gets attached to people real quick. Especially if they treat him nicely.” he says and Jungkook starts combing his hair with his fingers “Which is bad enough as it is, but with Gao... shit, I'm worried.”</p>\n<p>Yoongi sighs. “You don't know him, being worried is useless.”</p>\n<p>“But I do know him, we spoke.” Tae retorts “And I relate to him. I was like him once.”</p>\n<p>Yoongi lowers his gaze. That's true, Tae was exactly like Jimin. For sale.</p>\n<p>“Before Kookie found me I was exactly like him.” he continues, Jungkook smiles at him “And I know for a fact that if he doesn't try to get out of the business quickly he'll end up in the streets. He's too spoiled to survive in the streets. I don't blame him, I mean, I was spoiled too. But my employers and stuff weren't like Gao, it was easier for me.</p>\n<p>At that, Yoongi looks back at Taehyung, curiosity lighting up inside of him.”</p>\n<p>“What do you mean?”</p>\n<p>“Oh, right, you don't know.” Jungkook says “Gao tried to buy Taehyung. Right?”</p>\n<p>Taehyung nods.</p>\n<p>“I was... fifteen, maybe. I remember I was really fucking young, I had a sugar daddy back then and we were in Toronto for a gala. I was walking around when Gao approached me and asked me if he could put me under contract for a year. Told him I already had a contract, he tried to convince me saying he was going to pay me way more than my current owner did.” Taehyung grimaces and shifts uncomfortably on the couch “I remember how weird I felt when he said owner. He said it like he truly meant it. That's when my sugar daddy came and said that no fucking way he was going to give me up. Later that evening he told me that, in the future, if I was in need of another sugar daddy it would have been wise not to choose Gao. “Anyone is better than that sick fuck”, he said.”</p>\n<p>Yoongi lets the silence linger for a few moments, processing Taehyung's story.</p>\n<p>“Why?”</p>\n<p>Tae sighs. “They say he's a sadistic motherfucker. The dangerous kind of sadistic motherfucker. Has Jimin told you how long does the contract last?”</p>\n<p>Yoongi nods.</p>\n<p>“Three years.”</p>\n<p>Taehyung makes a face at that.</p>\n<p>“Three years is a long fucking time, Yoongi.”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>It was kind of ridiculous of how quickly Jimin became friends with everyone. In the span of three weeks, Jimin manages to befriend Mike, the ever stone faced man of the reception, Seokjin who wouldn't stop repeating that he wanted to adopt Jimin, both Hoseok and Namjoon and, of course, Taehyung and Jungkook, who apparently just couldn't stop talking about him because “Jimin is just too cute, who could resist him?”.</p>\n<p>The worst part is that Yoongi agrees with them. Jimin is cute and adorable, but that's not just it. There's much more to Jimin, so much more that Yoongi can't even possibly imagine. He knows it. He sees it in the way Jimin's smile falls whenever he thinks Yoongi isn't looking at him, in how his eyes darken at the mention of Gao, in the way his jaw clenches painfully everytime there's a loud noise coming from the street. Yoongi knows it but he doesn't say anything. Not when Jimin always greets him with that smile and light in his eyes and tells him that he's happy to see him. He just can't do that.</p>\n<p> </p>\n<p>But then another thursday comes and Jimin's smile when Yoongi opens the door for him isn't as bright as usual.</p>\n<p>“Hello, Yoongi.” he says, as he always does, and comes inside “It's cold as fuck outside.”</p>\n<p>Yoongi sees that Jimin is wearing a black coat and a huge scarf surrounds his neck and almost covers half of his face.</p>\n<p>“Haven't gone out today.” Yoongi says “How cold?”</p>\n<p>“So cold.” Jimin whines, sitting on the couch and unbottoning his coat “I love winter, but it's seriously cold. Where can I put the coat?”</p>\n<p>Yoongi gestures to the sofa. “Just leave it there.”</p>\n<p>Jimin takes off his coat and drops it on the couch next to him, doing the same with his scarf. He's wearing another soft looking jumper, this one has a turtleneck that covers him up to his chin, making him look even smaller.</p>\n<p>Yoongi sits next to him, still keeping a distance, as Jimin looks for the order in his jean's pockets. He takes the folded piece of paper and gives it to Yoongi. That's when he notices that Jimin is holding the hems of the sleeves of his jumper with his fingers, covering them almost completely. He's not wearing any rings either.</p>\n<p>“Are you that cold? I can turn the heater on, if you want.”</p>\n<p>Jimin frowns.</p>\n<p>“No, I'm good.”</p>\n<p>“You're covering your hands.”</p>\n<p>“Oh.” Jimin smiles and it looks so horribly forced that Yoongi has to shut down the wave of concern that hits him “Ajussi doesn't like them.”</p>\n<p>“Doesn't like what?”</p>\n<p>“My hands.”</p>\n<p>Yoongi lets a few moments of silence go by.</p>\n<p>“He doesn't like your hands.” he repeats and Jimin shrugs.</p>\n<p>“He says my fingers are too short. Doesn't wanna see 'em. He's in a better mood if I cover them, it's becoming a habit.”</p>\n<p><em>That's disgusting</em>, Yoongi thinks, <em>that's fucking disgusting</em>.</p>\n<p>“There's more valium than usual.” Yoongi says instead, trying to move from the subject as quickly as possible.</p>\n<p>Jimin hums, taking a cigarette and lighting it up, exhaling a lungful of smoke.</p>\n<p>“Don't know why, ajussi doesn't really speak about business with me that much. Only when he's high. I think the valium is more for personal use, though. Most of his men are actual junkies who live off heroin, valium doesn't do shit to them.”</p>\n<p>Yoongi makes a mental note to ask Gao, whenever he'll hear from him again, as to why there's a sudden request for more valium. It's probably nothing, but Yoongi likes to know what's going on when it comes to his merch.</p>\n<p>“How does one become a druglord, exactly?” Jimin asks.</p>\n<p>“Don't know about the others, mine is one hell of a long story.”</p>\n<p>“Will you tell me this story?”</p>\n<p>Yoongi considers it for a few seconds.</p>\n<p>“Not today, no.” he stands up and goes for the kitchen “Since it's so cold, do you want some hot chocolate?”</p>\n<p>The excited shrill squeal and loud clapping that Jimin makes is enough of an answer so Yoongi starts warming up some milk in a kettle.</p>\n<p>“You're a mind reader, Yoongi.” Jimin says “I've been eyeing this coffee shop that's close to your place and looks amazing. I've been craving hot chocolate.”</p>\n<p>“Why don't you go?” Yoongi asks “Do you want marshmallows in it?”</p>\n<p>“Yes, please.” Jimin replies “And I can't go because ajussi doesn't like me going out alone, says it's dangerous. And taking a hot chocolate with my driver or one of the personal guards is like a nightmare, they don't like speaking and they never smile. So boring.”</p>\n<p>“I don't smile either.”</p>\n<p>“You do sometimes. I mean, it's more like a grin, but I'll take what I can get.”</p>\n<p>Yoongi scoffs. Once the chocolate is ready, he pours it in two mugs and tosses in his two marshmallows and way more than two in Jimin's. He's about to ask Jimin if he also wants sugar when he turns around and the words die on his tongue.</p>\n<p>Jimin is still sitting on his bed and Yoongi can only see his back as the boy is silently rubbing on his shoulder and the turtleneck of his jumper slides down to reaveal the tanned skin of his neck, showing the bruises. Yoongi imagines that he shouldn't be surprised. He really shouldn't, hell, what the fuck was he expecting? But there's something about them that unsettles him. Maybe it's because they're so fucking red, swollen. Maybe it's because they don't look like someone choked Jimin with his fingers but with a rope.</p>\n<p>“What happened to your neck?” Yoongi asks the question before he even realizes that the words slipped out of his mouth.</p>\n<p>Jimin stops moving altogether, Yoongi wonders if he's even breathing. Slowly, the boy turns around and looks at him, expression blank and lips pressed in a firm line.</p>\n<p>“What do you think happened?”</p>\n<p>Yoongi tears his gaze away from Jimin and takes the mugs in his hands, going back to the couch and placing them both on the coffee table.</p>\n<p>“You wanna talk about it?”</p>\n<p>“It's not the first time shit like this happens and it ain't going to be the last, so no.” Jimin's voice is cold “No, Yoongi, I don't want to talk about it.”</p>\n<p>Yoongi nods and whispers an “okay” before he takes his mug and blows on the hot chocolate, taking a small sip. Jimin does the same, sweater paws still covering his fingers that are warming up around the cup.</p>\n<p>The silence is tense and heavy and Yoongi feels like an ass. He should've just stayed quiet. Jimin probably wore that turtleneck because he didn't want people to notice, so why the hell did he have to bring it up?</p>\n<p>Jimin stares at his chocolate before sighing.</p>\n<p>“I used to like being choked during sex.” he says “It's... I don't know, there's something about having someone's hands on your neck, having someone else being in control of your breathing, I always found it hot.” Jimin wets his lips nervously “So when ajussi said he was going to choke me I was almost excited. The moment he got that fucking rope out of the drawer I thought “I'd better get a lungful, 'cause I ain't going to breathe for a while”. It hurt like a bitch. I think I passed out at some point.”</p>\n<p>Rage, Yoongi thinks, is something that doesn't really feel right with him. Rage is useless and dangerous, it clouds your sense of judgement, it makes you take rushed decisions. In his line of work, rage is something that has to be avoided at all costs, even when your workers fuck up something or a client is way too fucking late with payment. And yet, there it is. Pure rage. It's a feeling so new to him that at first it scares him. It's almost hot in his chest, almost burning him. That's also the moment he realizes that he's made a mistake in letting Jimin in. He should've never asked for Jimin's real name, Yoongi should've kept calling him Peach, he should've kept him an object that belongs to another man. Instead, Yoongi made him human. And now he's dealing with the consequences.</p>\n<p>“I'm always at the penthouse in the afternoon.” Yoongi says “There might be customers but I'm always here. And if you're bored, or maybe just passing by, you can drop by. Whenever you want, you don't have to tell me before. So... yeah, even if you just want to talk, I'm always here in the afternoon.”</p>\n<p>Jimin stares at him, hot chocolate untouched, his fingers curling up around it.</p>\n<p>“Why?” he asks.</p>\n<p>“Because I feel like I'm the only person who will listen to you.”</p>\n<p>Jimin takes a deep breath before his eyes fall on his chocolate and a small smile lights up his face.</p>\n<p>“Why the hell did you put so many marshmallows?”</p>\n<p>“Shut up.”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Jimin's presence is warm and comforting in the most unsettling way.</p>\n<p>Yoongi knows the rules. And because he knows them he also knows when he's about to break one.</p>\n<p>Jimin is sitting on the couch, legs close to his chest and a book that he brought from Gao's house open on his knees. He reads silently, twisting locks of pink hair between his fingers. He looks peaceful. This has been happening for a while, Jimin suddenly showing at the penthouse and claiming that Gao isn't home and he's so bored and he hates reading when there's no one in the same room. And Yoongi lets him in, makes him tea and keeps working, letting Jimin enjoy the safety of his home.</p>\n<p>Yoongi thinks that if Jimin finds him kind and safe enough to let his guard down like this, he clearly never met an actual kind person in his whole life.</p>\n<p>“Seokjin told me a joke that was so shit I feel like I need to share it with you.” Yoongi suddenly says, breaking the silence.</p>\n<p>Jimin looks up from his book and gives him a small smile.</p>\n<p>“What joke?”</p>\n<p>“It's so fucking bad, I swear.” Yoongi clears his voice “What do you give a cannibal who's late for dinner?”</p>\n<p>Jimin shrugs.</p>\n<p>“A cold shoulder.”</p>\n<p>Jimin bursts out laughing immediately under Yoongi's incredulous eyes.</p>\n<p>“Wait, you like that?”</p>\n<p>“It's so funny!” Jimin says in between fits of laughter, hiding his mouth with the palm of his hand, his eyes disappearing into crescents, crinkling at the corners, cheeks dusted with pink “My pride hurts, but it's so funny!”</p>\n<p>Yoongi hides his smile by covering his mouth with his hand, enjoying the miracle that is Jimin's laughter, letting the sound mark itself with fire in his brain.</p>\n<p>He knows he's breaking one of the rules. He decides that he doesn't care.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>“I wanna go somewhere.” Jimin mumbles, a lollipop in his mouth “I'm so bored.”</p>\n<p>Yoongi arches an eyebrow and leans back on the chair behind his desk.</p>\n<p>“Sorry if I'm too boring.”</p>\n<p>“Not you, you're fine.” Jimin sighs, pouting ever so slightly “I'm always bored. Ajussi is always out and when he's home is in such a fucking mood. Can't say anything to him, he gets pissy over everything and lately he's even more annoyed when I tell him I want to go out.”</p>\n<p>Yoongi clenches his jaw. It sounds to him like Gao has put a goddamn leash on Jimin.</p>\n<p>”<em>If you wanna buy clothes do it online</em>, he says. It's not the same.”</p>\n<p>“Isn't it?” Yoongi asks “I hate going out shopping. It's a waste of time.”</p>\n<p>Jimin shoots him a smirk.</p>\n<p>“I like to show off when I go shopping, 'cause I'm pretty.”</p>\n<p>Yoongi smiles. “Someone's confident.”</p>\n<p>“Shouldn't I be?”</p>\n<p>Yoongi huffs a laugh.</p>\n<p>“No, you should.” he takes a deep breath before leaning with his elbows on the desk “You said you wanted to go to that coffee shop.” Jimin nods “Let's go.”</p>\n<p>Jimin seems to slowly process the words before his eyes widen almost comically.</p>\n<p>“What, like now?”</p>\n<p>Yoongi shrugs. “You said you wanted to go.”</p>\n<p>“I did, but-” Jimin bites his lips “I mean, the driver is downstairs and he won't let me go alone with you. And he'll tell Ajussi.”</p>\n<p>“Gao doesn't need to know, we'll go with my car. It's in the garage in the basement level, the driver won't even know we got out.”</p>\n<p>At that Jimin beams, smiling so brightly that Yoongi wonders if a person could be blinded by the sight.</p>\n<p>“Let's go.” Jimin says, standing from the couch and taking his coat, putting it on hastily.</p>\n<p> </p>\n<p>As they make their way to the elevator, Jimin does nothing but giggling excitedly, fidgeting with the hems of his coat and almost jumping on the spot, lollipop hanging between his lips.</p>\n<p>“You need to chill.” Yoongi says.</p>\n<p>“It almost feels like we're spies.”</p>\n<p>“Spies?”</p>\n<p>Jimin nods before resting his chin on Yoongi's shoulder and looking up at him through his lashes.</p>\n<p>“I'm telling you, I'm gonna try every single cake they have.”</p>\n<p>“Okay.”</p>\n<p>“And I'll make you pay for them.”</p>\n<p>“I thought that was obvious, I'm the one who's taking you out.” Yoongi mumbles, finally the elevator reaches their level and the doors open.</p>\n<p>Jimin smiles. “It almost feels like a date.”</p>\n<p>Yoongi looks at the floor, his hands curling into fists inside the pockets of his jacket.</p>\n<p>“Except that it's not.” Jimin says, hopping inside the elevator and gesturing for Yoongi to come in.</p>\n<p> </p>\n<p> </p>\n<p>For the whole ride Jimin sits on the passenger seat with his legs close to his chest, humming to whatever song they're playing on the radio, staring outside the car window with a blissful smile stretching his lips.</p>\n<p>Yoongi realizes that it doesn't take much to make Jimin happy. Yoongi wonders why Gao doesn't try harder. And then he thinks that Gao doesn't deserve Jimin's happiness.</p>\n<p> </p>\n<p> </p>\n<p>True to his words, Jimin orders a slice of all the seven cakes the cofee shop has to order.</p>\n<p>With an ecstatic smile, he places them all in front of him and then sits in his boot, biting on his nails.</p>\n<p>“Which one should I eat first?” he mumbles.</p>\n<p>“You're seriously going to eat them all?”</p>\n<p>“Of course and you're going to help me.” Jimin pushes a plate towards Yoongi, who's sitting in front of him “That's the carrot cake, tell me if it's good. I'll try the chocolate one.”</p>\n<p>Yoongi looks at the slice of cake with his nose scrunched up.</p>\n<p>“I don't like sweet things.”</p>\n<p>Jimin smirks before taking a bite of the chocolate cake.</p>\n<p>“Then what are you doing here with me?” he asks before he closes his eyes “Shit, this tastes amazing.”</p>\n<p>Yoongi dips his fork in the carrot cake and starts munching on it. It is good, that's for sure, but he's not going to give Jimin that satisfaction.</p>\n<p>“I'm here 'cause you wanted to be here.”</p>\n<p>“So you're doing it all for me?” Jimin asks as he moves on to the next cake, one that looks like it has been dipped into red coloring “Admit it, you wanted to get out as well.”</p>\n<p>“Not this time, no.” Yoongi says, pushing the plate back to the boy “Give me the one with the strawberries.”</p>\n<p>Jimin complies, handing him another plate.</p>\n<p>They don't speak for a while, Jimin too busy munching happily on the cakes, buzzing with excitement and even doing a little happy dance when he tastes the mint cake, closing his hands into tiny fists and almost jumping on his seat when he gets a bite of the raspberry cheesecake.</p>\n<p>Yoongi takes occasional small bites, preferring to just enjoy the little show that Jimin is putting up, smiling softly at the boy.</p>\n<p>After a while, Jimin looks out of the window, finishing his sponge cake and he hums.</p>\n<p>“She's really pretty.” he says and Yoongi follows his gaze. There's a girl just outside the shop, talking on the phone with someone, petite and with soft features, blond hair falling in waves on her shoulders.</p>\n<p>“She'd make good money.” Jimin says, tilting his head to the side “With the right customer she'd be rich.”</p>\n<p>Yoongi frowns.</p>\n<p>“What are you talking about?”</p>\n<p>“It's a thing I do. I try to guess whether people that I see on the street would survive doing my job.” Jimin narrows his eyes “That guy over there is full twink material, he'd find a sugar daddy in a matter of seconds at the right party.”</p>\n<p>Yoongi lets a few seconds go by, his coffee has turned cold in his mug.</p>\n<p>“Why?” he asks and Jimin shrugs, still looking outside.</p>\n<p>“Makes me feel like I'm similar to them. Less weird, I guess.”</p>\n<p>“You're not weird.”</p>\n<p>Jimin turns around and slumps back on the tiny couch, smiling a little.</p>\n<p>“Aren't I?” he whispers “I'm an escort, Yoongi. And that's the nice word for “personal slut”. That's weird.”</p>\n<p>“Your job is, you're not.”</p>\n<p>Jimin giggles.</p>\n<p>“You, on the other hand...” the boy says “You'd make real cash.”</p>\n<p>Yoongi arches an eyebrow. “What?”</p>\n<p>“Face like yours but with your personality? People would kill to have you.” Jimin says before diving back into one of the cakes.</p>\n<p>Yoongi stares at him, taking in the happy tingle in Jimin's eyes, the way the corners of his lips are constantly curled up in a smile and he realizes that this is the first time he's seen Jimin looking this relaxed.</p>\n<p>He's young. And he likes reading and coffee shops and terrible jokes, there's an innocence in everything he does that should be so unnatural coming from someone like him and yet there he is.</p>\n<p>Jimin doesn't belong to the world he's currently living in.</p>\n<p>“Just ask.”</p>\n<p>Yoongi furrows.</p>\n<p>“What?”</p>\n<p>Jimin looks at him, chewing on a bite of ginger cake, before he speaks again.</p>\n<p>“You want to know how I ended up here, right?” Jimin puts the fork down and crosses his arms “I can see it in your eyes.”</p>\n<p>Yoongi takes a deep breath, dropping his gaze and settling his attention on the cold cup of coffee.</p>\n<p>“I don't have a problem talking about it, you know?” Jimin says “After all, I don't remember.”</p>\n<p>Yoongi looks up at that, gazing at Jimin.</p>\n<p>“What does that mean?”</p>\n<p>“I can't remember of how it started.” he replies, lifting his legs and holding his knees close to his chest “Don't know why, everything is kind of blurred. Was I sold? Kidnapped? Abandoned? I don't know, I just know that at some point I was twelve and I was getting fucked in an alley. I remember that I have, or maybe had, parents, but I can't remember their faces or their names. I feel like...” Jimin squints his eyes “I feel like maybe I removed it. People do that, don't they? They block out memories if they're too shitty. Maybe that's what I did.”</p>\n<p>“Jimin-”</p>\n<p>“I remember that I didn't stay in the streets for long.” he continues “A guy saw me and said I looked too pretty to be there. He said he was going to give me food, and clothes and money. And I believed him, 'cause you know, sleeping in the streets is kinda shit. So I guess I started off as a prostitute in this brothel, we were all kids. I was the jewel of that place, 'cause american pedos apparently have a thing for asians. I already knew what I wanted: money. Money meant getting away, you know? So I always went for the rich ones, I have an eye for those. Then I turned sixteen and I found my first sugar daddy. He was this middle aged guy from Indiana, disgustingly rich, he spoiled the fuck out of me.” Jimin pauses to get with his fork another piece of chocolate cake “But the greedy asshole never gave actual money, just let me use his credit card, so when I turned eighteen and he decided he had enough of me I was broke and, well... kind of useless. I don't know how to do most of things, I just know sex. So that's exactly what I did. No fucking way I was getting back in the streets, I wasn't stupid, I knew that I couldn't survive again like that. I went for porn instead.” he shrugs “You don't earn much and you definetely don't get to cum much, but at least I had a job. So years go by, and life is shitty, porn is boring, sugar daddies literally last no more than three months 'cause, apparently, I'm too expensive and then I meet ajussi.”</p>\n<p>Yoongi worries his bottom lip, waiting for Jimin to start speaking again.</p>\n<p>“There was a party.” he says “That kind of party, you know. Where rich men want to either fuck or get fucked. I was invited as well, so I went looking for a new daddy or something, and it was him who approached me first. Covered me with praises and compliments, saying how good I looked and how better I was than all the others so finally he starts talking about business. I told him I already knew what a sugar daddy was and that's when he said that he wasn't going to be my daddy, he was going to own me. He was going to put me under a contract, pay me for my services with so much money that I was going to get tired of it, that there were going to be rules and shit. I didn't think he was that serious back then, i just thought that this chinese old man had a god complex or something. So I agreed. And here I am.”</p>\n<p>Jimin stops talking and starts looking out of the window instead, staring at people walking by, following their steps with his gaze.</p>\n<p>The coffee shop is quiet, voices buzzing around them, white noise in the background as Yoongi takes in Jimin's words. He realizes he doesn't know what to say. It doesn't look like Jimin wants to be comforted, nor is he looking for Yoongi's pity. It just looked like he wanted someone to listen to him, so that's exactly what Yoongi did.</p>\n<p>“I feel like-” Jimin says suddenly, licking his lips, still looking at the street “I feel like you and I are similar.”</p>\n<p>“Similar.”</p>\n<p>“Yes. We both made choices that we might or might not regret and ended up here. In this kind of world.” Jimin looks at him “We're just doing what we gotta do in order to survive.”</p>\n<p>Yoongi lowers his gaze, nodding a little and taking his cup of coffee, now definetely cold and he takes a sip.</p>\n<p>“We're similar, but there's huge difference between us.” Yoongi says, not daring to look at Jimin.</p>\n<p>“What difference?”</p>\n<p>“The difference is that you don't belong in this kind of world. You belong somewhere better.”</p>\n<p>Rather than see, Yoongi can feel Jimin's smile, can sense the warmth that radiates from it on his skin.</p>\n<p>“No, I don't.” Jimin mutters, before standing up “We need to go back.”</p>\n<p>Yoongi doesn't tell him that they can stay a little more if Jimin wants. He doesn't, but he wants to.</p>\n<p> </p>\n<p>The ride back to Yoongi's penthouse is silent, no words are exchanged. Even in the elevator, both of them don't speak nor they share looks. As the doors open Jimin quickly slides out the elevator, turning around just for a second.</p>\n<p>“Thank you for today.” he says “I'll see you next thursday.”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Yoongi massages his temples as he lets out a long breath.</p>\n<p>“Please, Hoseok, tell me again what happened so that I can understand what the fuck went wrong.”</p>\n<p>Hoseok grimaces, sitting on the armchair in front of Yoongi.</p>\n<p>“Listen, it wasn't pretty.” he says “I got this call from Taehyung saying that Kook was about to murder this guy so I went and stopped him. That's all.”</p>\n<p>“No, that's not all.” Yoongi snarls “That can't be all, 'cause Jungkook ain't a fucking idiot and he doesn't try and kill clients with no reason.”</p>\n<p>Hoseok sighs. “It's not Kookie's fault. Nor Taehyung's and he asked me not to tell you but I guess I don't have a choice.”</p>\n<p>“Damn right you don't.”</p>\n<p>“Client's name is Blanchard, that junkie who lives off oxycodone. Tae and Kook went for the dispatchment, as usual, but this time the guy had no money. So they told him that he wasn't getting the stuff, he knows the rules, he should be glad they're not breaking fingers and shit. That's when the guy lost it and took out this knife. He tried to stab Taehyung.”</p>\n<p>“Shit. Is he okay?” Yoongi asks, his stomach dropping from the wave of concern.</p>\n<p>“Yeah, he was quick enough to dodge the knife, just a nasty cut on his cheek. Won't even leave a scar, probably.” Hoseok sighs and shakes his head “But shit, Yoongi, when Tae called me and said that he needed help I wasn't expecting to see Jungkook almost gauging the eyes out of that junkie's head. He was fucking livid and he might be a kid but he's strong, I had a hard time shoving him off Blanchard. And when he saw Taehyung he-” Hoseok shoots Yoongi a sad look “Jungkook started fucking crying. It took us a whole hour to calm him down. The fucking brat almost kills someone and then starts crying because Taehyung has some blood on his face.”</p>\n<p>Yoongi closes his eyes and takes a deep breath.</p>\n<p>“I hate when this shit happens.” he whispers “They're okay, yeah?”</p>\n<p>Hoseok nods. “Tae was worried you'd get angry at Kook, that's why he didn't want me to tell you.”</p>\n<p>“I'm not angry, what the fuck?” Yoongi shakes his head “I'm not angry, I'm worried. They're kids, I fucking hate having them on the streets. Tell them to get the week off, yeah? The other runners will cover their areas. And tell Blanchard that if he fucking dares to show his face again I'll personally kill him.”</p>\n<p>“Can you believe that it's only monday?”</p>\n<p>Yoongi concedes a small laugh at that, taking a cigarette and lighting it up. He offers one to Hoseok, who accepts it and starts smoking with him in silence.</p>\n<p>“Remember when we were runners?” Hoseok asks.</p>\n<p>“How could I forget?” Yoongi looks at the smoke floating above him “Those were some shitty years.”</p>\n<p>“I remember that time a junkie pointed a fucking gun at me. What was his name again?”</p>\n<p>“Can't remember.”</p>\n<p>“I've never seen you move that fast in my entire life.” Hoseok chuckles “What the fuck were you thinking back then, trying to take him down when you didn't have a weapon?”</p>\n<p>“I wasn't thinking.” Yoongi taps the cigarette and ash falls in the ashtray “I saw a gun pointed at your head so I just moved.”</p>\n<p>Hoseok smiles.</p>\n<p>“You're impulsive, you've always have been. Not when it comes to business, no. But you act without thinking when it involves the people you love. Which is why I'm worried.”</p>\n<p>Yoongi frowns. “About what?”</p>\n<p>“You and Jimin.” Hoseok shakes his head “You know the rules, Yoons.”</p>\n<p>Yoongi keeps his gaze steady on Hoseok but doesn't find it in itself to say anything.</p>\n<p>“You're not going to deny it?” the man asks him, his voice careful.</p>\n<p>“What's there to deny?”</p>\n<p>“Yoongi, you're my friend.” the younger man leans on his elbows , almost whispering “My best friend. We've known each other for ages, you're my brother. I'd die for you, and I know you'd do the same.”</p>\n<p>“Of course I would.”</p>\n<p>“And you know that, no matter what, you'll always have me. Always. I'll be by your side, I'll help you and the same goes for Namjoon and the others.” he pauses for a second “But I have to say this: what the fuck are you doing?”</p>\n<p>Yoongi snorts. He takes a drag of his cigarette, blowing out a cloud of smoke and letting a few moments of silence go by.</p>\n<p>“This is stupid.” he says “What, can't I be nice to the kid without people making a huge deal out of it?”</p>\n<p>“That's the point.” Hoseok hisses “It is a huge fucking deal. I'm worried about you both, but mostly about him. What are you trying to do?”</p>\n<p>“Nothing.” Yoongi replies.</p>\n<p>“Are you trying to make him fall in love with you or some shit?”</p>\n<p>“No.”</p>\n<p>“'Cause that's exactly what's gonna happen if you keep being that nice to him.”</p>\n<p>“Jimin is not a fucking idiot, he knows his boundaries. He knows he's under a contract and he's well aware of what he can and can't do.”</p>\n<p>“No.” Hoseok shakes his head “No, Jimin is a kid who's under contract with a fucking psycopath who tried to choke him with a goddamn rope, you told me that! Yoongi, you need to understand something: Jimin lives in two worlds. In one he's Gao's whore, everything is shit, he's lonely and he's treated like a piece of garbage. In the other world there's you. You make him tea, you take him to coffee shops, you call him by his real name. Those are the only two worlds he knows.” Yoongi can see in Hoseok's eyes a deep sadness that he can't bring himself to ignore “In one world he's an object, in the other one he's human. Which one do you think he prefers?”</p>\n<p>“Then what the fuck am I supposed to do, Hoseok?”</p>\n<p>“You know the rules. You don't fall in love with a client's whore.”</p>\n<p>Yoongi looks down at his hands, cigarette burned to the filter, smoke itching at his eyes. Yoongi knows the rules, that's why he also knows he's already broke one. But he can't tell that to Hoseok. He'd understand, hell, Hoseok probably already knows, otherwise they wouldn't be having that conversation. But there's a difference between being aware of feeling and admitting them, a line that Yoongi does not want to surpass.</p>\n<p>So all Yoongi can say is: “He's not just a client's whore.”</p>\n<p>The silence that follows his words is long and tense, broken only by their breaths and the ticking of the grandfather's clock in the other room.</p>\n<p>“I know he's not.” Hoseok finally says.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Yoongi dreads next thursday and at the same time he finds himself checking the hour every few minutes. Jimin is late.</p>\n<p>He's never late.</p>\n<p>Yoongi decides to kill some time by going through some documents that he still hasn't checked, making sure that everything is going steady, that the next stash will arrive in time and this time without mysterious losses that Yoongi has decided to ignore until now because he's too lazy to actually care. Then finally someone is knocking on the door and Yoongi stands up from his chair and basically sprints to open the door.</p>\n<p>The thing that unsettles him the most once he lays his eyes on Jimin is that the boy looks as he usually does. His hair is still pink and perfectly styled, his eyes always a little droopy and horribly pretty, his lips still stretched in that smile he has.</p>\n<p>“Hello, Yoongi.”</p>\n<p>He even sounds the same, a voice so light that all the world would stop just so that it could listen to it just a little more. Jimin is the same as usual except for the map of cuts and bruises on his face.</p>\n<p>“Get inside.” Yoongi hears his voice and almost doesn't recognize it “Now.”</p>\n<p>Jimin shakes his head and fishes from his jacket the usual piece of paper.</p>\n<p>“I can't stay long, I just came to bring you the order.”</p>\n<p>Yoongi snatches the paper from Jimin's hands and drops it on the floor.</p>\n<p>“I don't give a shit about the order, get inside.”</p>\n<p>“Yoongi-”</p>\n<p>“Inside, Jimin.”</p>\n<p>When he sees that Jimin is still not going to make his way inside, Yoongi grabs his wrist and pulls him inside the penthouse, shutting the door close and dragging Jimin to the couch.</p>\n<p>“Sit.” he says and the boy obeys, so Yoongi goes to the kitchen and opens the refrigerator.</p>\n<p>He'll have to thank Namjoon for his obsession with whiskey on the rocks since he has far too much ice in the house. He fills a bowl with ice cubes, takes a cloth that is hanging on the oven and he empties the ice on it, knotting together the edges of the cloth.</p>\n<p>He makes his way back to Jimin and sits in front of him on the couch, almost shoving the icepack on his face.</p>\n<p>“Ouch.” Jimin pouts, taking the cloth and pressing it carefully over his swollen lips.</p>\n<p>“What the fuck happened?”</p>\n<p>“It's not as bad as it looks.”</p>\n<p>“Don't bullshit me.”</p>\n<p>“I'm fine.”</p>\n<p>Yoongi sighs. “No, you're not.”</p>\n<p>Jimin grimaces when he moves the icebag to his black eye, hissing a little.</p>\n<p>“Hurts like a bitch.” “he mutters “But honestly, it could've been worse.”</p>\n<p>“Is that supposed to make me feel better?”</p>\n<p>“In fact, no.” Jimin smiles “It's supposed to make <em>me</em> feel better. 'Cause it really could've been worse. It's not the first time it happens anyway, so it's fine.”</p>\n<p>Fine.</p>\n<p>Jimin keeps saying that word. Never in his life had Yoongi despised a word more than now.</p>\n<p>“What happened?” he asks, looking at the cut on Jimin's cheeckbone. Probably caused by that fucking ring Gao always wears on his index finger. If it leaves a scar, Yoongi might act without thinking.</p>\n<p>“I broke a glass.” Jimin answers, voice flat and steady.</p>\n<p>“A glass.” Yoongi repeats and the boy nods.</p>\n<p>“A really expensive glass, apparently. A client bought it for him as a present or something, don't remember, I was too busy getting punched in the face to actually listen to him.”</p>\n<p>“Shit.” Yoongi takes a deep breath “Shit, Jimin.”</p>\n<p>“It's okay!” the boy gives him a cheerful smile “I just got ajussi in, like, the worst mood possible so-”</p>\n<p>“What?” Yoongi snaps “So what? Being in a shitty mood doesn't excuse what he's done to you!”</p>\n<p>“It could've been worst, Yoongi.” Jimin says, pronouncing every word with a severity that Yoongi doesn't understand at first. Then he does.</p>\n<p>It could've been worst. Gao could've done much more. Gao still can do worst and that's exactly what Jimin is telling him. That he probably will do even worst things in the future and that Yoongi needs to be ready to face them. Jimin is. Jimin is ready to face them all because he knows that there will be more.</p>\n<p>Yoongi takes the cloth full of ice from Jimin's hands and starts dabbing it on the swollen wounds, Jimin's gaze steady on his eyes.</p>\n<p>“I was born in Daegu and I lived there for fifteen years.” Yoongi says, voice low, almost as if he's telling a secret “It's a city I will love forever.”</p>\n<p>Jimin grins. “Is it beautiful?”</p>\n<p>Yoongi smiles at the memories.</p>\n<p>“Yeah.” he replies “There's this botanical garden and it's the most amazing thing. There's a bridge there and I remember sneaking out of my house to go there when I was five years old. I'd threw rocks at the pond for hours. And every spring and autumn there's the <em>Seokjeondaeje, </em>a ceremony where we honor Confucius, a chinese philosopher. I loved it, I loved the music they play and the dance they perform. I love Daegu.”</p>\n<p>Jimin tilts his head to the side.</p>\n<p>“Then why did you leave?”</p>\n<p>“'Cause I was an angsty teenager who dreamed of glory and fame.” Yoongi shrugs “I wanted to make music, it was stupid. So one day I just left, I didn't even tell my parents, I ran away. I was in America, broke, didn't know a single fucking word of english so I didn't last long. I'd be dead under a bridge right now if it weren't for Namjoon. He found me and he was talking to me in english and I was so pissed 'cause I couldn't understand shit and then he switched to korean. I almost cried, I swear to God. He said he could find me a job, and a place to stay which was ridiculous considering he's younger than me and he was shorter than me back then but I still believed him.”</p>\n<p>“My cheek feels numb.”</p>\n<p>“Sorry.” Yoongi drops the icepack on the coffee table.</p>\n<p>“Go on.”</p>\n<p>“You asked me however does one become a druglord, right?” Yoongi asks and Jimin nods “I started off as a runner. You know, they give you drugs and you drop them where they tell you, get the money, give the money to the people in charge. Back then it was me, Namjoon and Hoseok. Seokjin was in charge of giving us the drugs and the areas we had to scan. It was so shitty, really, but it was our job and we were good at it. I was seventeen when it changed for me. Namjoon was late so we went looking for him and I found him in a pool of his own blood with this junkie who was high as fuck still sitting next to Joons, too stoned to do anything but staying there with the knife still in his hand. I just-” Yoongi frowns “I don't even remember what happened. I saw red. So I killed him.”</p>\n<p>Jimin's eyes widen but he doesn't flinch nor he looks scared or surprised.</p>\n<p>“Killed him.” he repeats.</p>\n<p>“It wasn't on purpose.” Yoongi fishes two cigarettes out of his pocket and gives Jimin one, lighting them up “I wasn't even myself in that moment. All I know is that I thought Namjoon was dead because of that junkie so I wanted to make him pay. When I came back to myself he was dead. But Namjoon was alive, by some miracle, so I bought him back to the base and we patched him up. By the following day everyone knew I killed someone. Runners don't kill, you know? Sure, they threaten and break fingers but they don't kill. That's when the old boss found out about me.”</p>\n<p>Jimin frowns, crossing his legs on the couch, cigarette burning between his fingers.</p>\n<p>“Old boss?”</p>\n<p>“His name's Lutz. He's this old guy who looks a lot like Santa Claus before gaining weight.” Yoongi smiles “He called me in his office, said that a runner who kills to avenge a brother should be honored. He was like a mentor to me, taught me how the business really worked, how to survive as a druglord without getting caught. He never said it with his words but I knew that he was teaching me so that I could take his place. The moment I turned twenty he left, leaving a note that said “have fun kid”.”</p>\n<p>“Where is he now?”</p>\n<p>Yoongi shrugs. “Probably in an island somewhere surrounded by hot women.” he answers “So yeah, that's how I became a druglord. First thing I've done was promoting Namjoon, Hoseok and Seokjin. Namjoon's kind of a genius, he handles the money, Hoseok takes care of the runners, Seokjin is the one who keeps an eye on the stashes we receive and makes the orders.”</p>\n<p>Jimin nods pensive, taking in the information, before the smile is back on his face.</p>\n<p>“What about Tae and Kookie?”</p>\n<p>“Namjoon found Jungkook starving in an alley and Jungkook found Taehyung in a shitty brothel.”</p>\n<p>Jimin blinks and his lips part slightly, but he doesn't say anything.</p>\n<p>“I made them runners 'cause they're young and smart but I fucking hate having 'em on the street. Can't really do anything about it though, I keep them safe in any way I can.”</p>\n<p>Jimin hums and they both fall in a comfortable silence, a curtain of smoke hovering above their heads.</p>\n<p>“I don't exactly have a place to go back to.” Jimin says suddenly, looking at his hands “Like, I know I was born in Busan but I don't remember much of it, only the sea, so I don't feel like I belong there. But you have a city you care about. Don't you ever think of going back there?”</p>\n<p>“Everyday.” Yoongi replies immediately “Every fucking day.”</p>\n<p>“Then why don't you?” Jimin asks, his voice small and almost a whisper.</p>\n<p>Yoongi looks at him for a few seconds, his eyes scanning Jimin's injuries.</p>\n<p>“I have things I need to take care of.” he finally says “Besides, without me here Tae and Kook would get killed in a second, those two are a pain in the ass.”</p>\n<p>Jimin giggles and Yoongi could drown in the sound.</p>\n<p>“I have a house in Daegu.” he says before he can stop himself “I bought it three years ago.”</p>\n<p>Jimin frowns, exhaling smoke from his mouth.</p>\n<p>“It's a nice house.” Yoongi continues “Not as big as the penthouse, but it's nice. And it's in my favorite part of Daegu, near Suseong lake. You'd like it there.”</p>\n<p>Jimin smiles softly. “Would I?”</p>\n<p>“And it ain't so far from Busan either, you know?” Yoongi knows he's rambling at this point “It doesn't take long with a train, so-”</p>\n<p>“Do you want me to see Daegu, Yoongi?”</p>\n<p>Maybe it's the way Jimin says those words, with a voice so tense and hopeful that Yoongi can feel his heart swell in his chest, or maybe it's the look in his eyes, full of expectations and fear. Maybe it's just that Yoongi loves Jimin so much that it scares him, so he says:</p>\n<p>“I want you to be happy.”</p>\n<p>Jimin draws in a sharp breath and his face screws up before he lowers his head. Yoongi can see in the boy's tense shoulders how he's trying not to cry, not to break in front of him and the thought that he's the cause of this could kill him. This could actually kill him.</p>\n<p>“Jimini.” He tries “Listen to me, I-”</p>\n<p>“Three years.” Jimin interrupts him, lifting his head and staring at him with red eyes “Can you wait for me for three years? Then you'll show me Daegu, and you'll take me to Busan, just... three years. Can you do that for me?”</p>\n<p>The weight of the contract that keeps Jimin locked away from him should be enough for Yoongi to know that he can't promise something like that. And, in a way, he knows. And yet.</p>\n<p>“I can do that for you.” he says.</p>\n<p>Jimin lets out a shaky breath and abruptly stands up, dropping the burnt out cigarette in the ashtray.</p>\n<p>“I'll see you next thursday, Yoongi.”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>The weeks go by and, somehow, everything seems to go well. Jimin doesn't show with more bruises, the cuts heal and leave no scars, but Yoongi thinks Jimin is losing weight. He's not sure, the boy keeps wearing oversized furry sweaters that make it hard for him to be sure. He realizes that's probably the point.</p>\n<p>Taehyung and Jungkook go back to their job and they keep spending their evenings in Yoongi's penthouse.</p>\n<p>During one of those nights, Yoongi speaks to Junkook privately.</p>\n<p>“What you've done was fucking stupid.” he tells the boy “You could've got killed.”</p>\n<p>Jungkook looks at his feet and he looks like a kid who's getting an earful from his dad.</p>\n<p>“What the fuck were you thinking?”</p>\n<p>At that, Jungkook looks at him, eyes sharp and too mature on his face.</p>\n<p>“I wasn't.” he replies, words spoken firmly “I wasn't fucking thinking, Yoongi.”</p>\n<p>And before Yoongi knows what he's doing, he's hugging Jungkook and even though that kid is larger and taller than him it feels right.</p>\n<p>“I know you weren't.” Yoongi whispers and he swears that he hears Jungkook sobbing but he doesn't say anything.</p>\n<p> </p>\n<p> </p>\n<p>Another thursday comes, the doorbell rings, Yoongi goes to open the door with tea already brewing in the kitchen.</p>\n<p>The moment he opens the door, Yoongi's smile disappears.</p>\n<p>“Min.” Gao greets him with a grin “It's good to see you again!”</p>\n<p>Yoongi looks at the man and then at Jimin, standing quietly next to him, eyes fixated on the floor.</p>\n<p>“It's been a while, Gao.” Yoongi says “Please, come in. Both of you.”</p>\n<p>Yoongi steps aside and Gao puts his hand on the back of Jimin's neck, squeezing it lightly and Yoongi can see how hard Jimin is trying not to recoil at the touch.</p>\n<p>Gao sits on the usual armchair, dragging Jimin on his lap as if he were a pet, hand still clutched around his neck.</p>\n<p>“How's it going, Gao?” Yoongi asks.</p>\n<p>“Very well, thank you.” Gao nods “My deal is going smoothly and... Peach, darling, why aren't you saying hi to Min?”</p>\n<p>Jimin reluctantly lifts his eyes to meet Yoongi's and he forces a smile.</p>\n<p>“Hello, Yoongi.”</p>\n<p>“That's better.” Gao says “Now, the adults need to talk, so why don't you go buy something for yourself, mh? Something nice.”</p>\n<p>“Yes.”</p>\n<p>Gao's grips gets tighter, Jimin stiffens, eyes blown wide with fear.</p>\n<p>“Yes what?”</p>\n<p>“Yes, owner.”</p>\n<p>God, that fucking word. Yoongi forgot about it, he forgot of how fucking twisted it sounded.</p>\n<p>“Very well, Peach. I'll see you home, go now.”</p>\n<p>Jimin stands up quickly, clearly eager to get away from Gao's lock on his neck and out of that house.</p>\n<p>“Bye, Yoongi.” he whispers, quickly exiting the penthouse and closing the door behind him.</p>\n<p>Gao takes from his inside pocket the usual piece of paper.</p>\n<p>“Here's the order.” he says, handing it to Yoongi “Has Peach been doing a good enough job?”</p>\n<p>Yoongi nods, not bothering to look at the order.</p>\n<p>“He's reliable.” he replies “He's never late, so he makes a decent job.”</p>\n<p>“Of course he does, I've trained him well.” Gao clears his voice “Although soon he won't need to place the orders anymore.”</p>\n<p>“Why?” Yoongi asks and curses himself for how quick he was to ask Gao.</p>\n<p>“Well, I told you Min. My deal is going smoothly.” the man says with pride “Soon enough the deal will be done, I'll be richer than I am now and with more time to kill. I'll begin placing the orders again, as it should be.”</p>\n<p>Shit, that's not good.</p>\n<p>“Good for you.” Yoongi says “I forgot to ask you, do you want anything to drink?”</p>\n<p>Gao waves a hand at him dismissevely.</p>\n<p>“Nah, I'm good.” the man licks his lips “What do you think of Peach?”</p>\n<p>Yoongi ignores the wave of nausea that hits him, suddenly the air he's breathing is too thick.</p>\n<p>“There's not much to think.” he says, keeping his voice as flat as possible.</p>\n<p>“Isn't there?” Gao frowns “Don't you ever wonder of how it would feel?”</p>\n<p>“How what feels? I'm not good with riddles.”</p>\n<p>“How fucking him would feel.”</p>\n<p>Yoongi feels his own blood run cold as the words wash over him, the sheer disgust that seems to take over his mind for a moment, making his thoughts blank, just white noise in his head.</p>\n<p>“Surely, you gave it a thought.” Gao continues “Everyone does. I don't blame them. One look at him and the first thing that goes through your mind is “how would he look like on his knees for me?”. And I'll tell you, Min, he looks gorgeus.”</p>\n<p>Yoongi keeps quiet.</p>\n<p>“No? You never thought about it? I ain't buying that, Min, you look like you don't feel anything but you're just a man.” Gao smiles “Do you want me to tell you how it feels?”</p>\n<p>Yoongi wants to kill him. It would be easy, he reckons, Gao is so old and out of shape that the piece of shit wouldn't even see it coming.</p>\n<p>“He's a fucking tease, you know?” Gao chuckles “Oh, he loves showing you how pretty he can be. And he mewls like the best slut but he's tight like a fucking virgin.”</p>\n<p>“Is this a test?” Yoongi says, keeping his voice under control and yet he knows it's shaking with rage “Or some kind of twisted kink of yours?”</p>\n<p>Gao's smile drops and the man leans on his elbows.</p>\n<p>“Let me tell you something, Min.”</p>\n<p>“Please, enlighten me.”</p>\n<p>“When I buy something I like that something to stay mine.” he says “When I buy something, I own it.”</p>\n<p>“You put him under a contract, I'd say that the ownership was made quite obvious.” Yoongi says, squinting his eyes “What is it, Gao? You think your toy ain't loyal?”</p>\n<p>“I think that you're walking on a thin layer of ice, Min.” Gao pauses for a second “The thing is, I can't do anything about it, can I? It's not like I can hurt you to make you realize that Peach belongs to me, your little soldiers would have me hanging by the balls the moment I touch you.”</p>\n<p>“Exactly.”</p>\n<p>“That's why I'm warning you, Min. I can't get my hands on you, but I can get my hands on him.”</p>\n<p>Yoongi wonders if the sound of his heart hammering in his chest can be heard in the room.</p>\n<p>“I don't like ruining my things.” Gao sighs “But when I have to teach my things lessons then I have no choice, do I?”</p>\n<p>“I'm not fucking him.”</p>\n<p>“Like, for example, I have to teach him to be careful if he breaks a glass.”</p>\n<p>“I am not fucking him.” Yoongi hisses.</p>\n<p>Gao lets the silence linger for a while before he starts rubbing at his temples. “I know you aren't. But I also know you want to. So this is just me reminding you that you might have leverage on me because of your position, but I have leverage on you as well.”</p>\n<p>Gao stands up, fixing his tailored jacket on his frame.</p>\n<p>“And I think I'm the one with the upper hand in this situation.” Gao smiles “Enjoy your thursdays, Min.”</p>\n<p> </p>\n<p>Yoongi doesn't know for how long he stays still on the couch, staring at the armchair, Gao's words echoing in his head, the threat a weight on his shoulders that could crash him on the floor. All he knows is that his hands are shaking and he can't seem to make them stop.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p> </p>\n<p>“Why are you sitting so far away?”</p>\n<p>Yoongi looks up from the book on his lap to Jimin, who's currently looking at him with a frown sitting cross legged on the couch with a cigarette dangling between his lips.</p>\n<p>“I'm sitting on the armchair.” Yoongi replies.</p>\n<p>“Exactly. You usually sit on the couch with me unless you're working.” Jimin pouts “Why aren't you sitting with me?”</p>\n<p>Yoongi shrugs.</p>\n<p>“No reason.”</p>\n<p>Gao is the fucking reason. The man's words are still echoing in Yoongi's head, the heavy weight of the threat keeping him frozen on the spot, unable to breath freely. The sole idea of getting close to Jimin is, right now, absolutely frightening and he hates himself for being so weak against a man that he could easily destroy under any other circumstance.</p>\n<p>“But I'm cold.” Jimin whines.</p>\n<p>“Get a blanket.”</p>\n<p>“I don't want a blanket, I want you.”</p>\n<p>Yoongi sighs.</p>\n<p>“Yoongi, please. Pretty please. I really want you here.”</p>\n<p>“Jimin.” Yoongi snaps, his voice way harder that he wanted “Stop it.”</p>\n<p>Jimin freezes, holding his breath, for what feels like ages before he narrows his eyes and looks at Yoongi with curiosity burning in his gaze.</p>\n<p>“You never use that voice with me, what's wrong?” the boy asks.</p>\n<p>“Nothing.”</p>\n<p>“Bullshit.”</p>\n<p>“Language.”</p>\n<p>“Is it because of ajussi?”</p>\n<p>Yoongi flinches and he shifts in his armchair.</p>\n<p>“Why would you say that?”</p>\n<p>“It is because of him, isn't it? Fuck.” Jimin shakes his head “What did he tell you? Has he said anything about me?”</p>\n<p>Yoongi doesn't answer.</p>\n<p>“He did.” Jimin worries his bottom lip, staring at Yoongi “What did he say?”</p>\n<p>“Listen-”</p>\n<p>“No, wait. I don't wanna know.” Jimin closes his eyes, breathing deeply “He thinks we're fucking, you know?”</p>\n<p>Yoongi stares at his hands, unable to look at Jimin's face.</p>\n<p>“Yeah.” he finally says.</p>\n<p>“He didn't tell me specifically, but I know he thinks we are.” the boy ruffles his hair “He's impossible lately, he's always in such a shitty mood. He got even more rough when he fucks me.”</p>\n<p>Yoongi decides that he really, <em>really </em>doesn't want to know more than he already does. They stay in silence for minutes, the loud ticking of the grandfather's clock echoing in the quiet room.</p>\n<p>“It's my fault if I'm in this situation, you know?” Jimin whispers “It's my fault.”</p>\n<p>“No. No, it's not your fucking fault.”</p>\n<p>“It is.” Jimin sighs “I'm a spoiled little thing, Yoongi. I'm so fucking spoiled, I can't do anything by myself and I love being cared for. It's so fucking pathetic but shit, I bask in the attention, I keen at praises and the moment someone is even remotely nice to me I get so fucking dependent on that person. I'm... I'm not proud of it, but it's how I am and I should've known that sooner or later I wasn't gonna be so lucky with my employers. So now that I'm here, so fucking dependent on a man that really despises me I can blame no one but me but there's nothing I can do about it.” when Jimin looks at him again, Yoongi can see fear in his eyes “He'd kill me if he had enough reasons. I know he would. I can see it in his eyes.”</p>\n<p>Yoongi forces himself to swallow, to keep his hands steady and his voice as firm as possible.</p>\n<p>“No, he wouldn't.” he says and he knows he's lying “He cares about his things too much.”</p>\n<p>“Just like he cared about his last toy?”</p>\n<p>At that Yoongi shuts his mouth closed.</p>\n<p>“You think I don't know?” Jimin lets out a shaky laughter “Two of his men told me, they love reminding me that I'll probably end up like that boy too. I know what happened to him.”</p>\n<p>“I know too.” Yoongi says “Jin told me Gao shot him.”</p>\n<p>Jimin clenches his jaw. “Did he also tell you how?”</p>\n<p>“What do you mean?”</p>\n<p>“Ajussi shot him in the head whilst he was fucking him.”</p>\n<p>Yoongi feels like he's going to be sick.</p>\n<p>“They even showed me pictures.” Jimin drops the burnt out cigarette in the ashtray “It was the most eerie shit I've ever seen in my life, and I worked in a fucking brothel for pedos.”</p>\n<p>“Why didn't you tell me?”</p>\n<p>Jimin looks at him for a second before dropping his gaze again.</p>\n<p>“What good would telling you have done? It's not like you can do something about it. It's my fault if I'm in this situation, I don't know what I was thinking when I signed that fucking contract.”</p>\n<p>“You couldn't have known.”</p>\n<p>“That's the fucking point, Yoongi!” Jimin shouts and his skin flushes red “Everyone knows about ajussi! Everyone knows that he's fucking twisted and I still went for it 'cause I thought that he meant what he said, that I was better, I believed him when he said that I was something precious that had to be treasured!”</p>\n<p>“That's because you are!” Yoongi screams and he stands up, the book resting on his lap drops on the floor and Yoongi walks to the couch “You are precious and better than most of the people that are breathing in this very fucking moment!”</p>\n<p>Yoongi kneels in front of Jimin and he takes his hand, holding them tightly. “Jimin, it's not your fault. It's not your fault if you want to be praised, it's not your fault if you need someone to care for you.”</p>\n<p>“Yoongi-”</p>\n<p>“Shit, if I could I...”</p>\n<p>Yoongi can feel the taste of the words he wants to say on his tongue and yet he stays quiet. He just enjoys the sound of them in his own head.</p>\n<p><em>If I could</em>, it's such a nice sound, <em>If I could I'd love you.</em></p>\n<p>Jimin stares at him with an unreadable expression, breathing coming out in soft puffs. The boy holds Yoongi's hands back, squeezing them lightly.</p>\n<p>“Would you take care of me?” Jimin asks in a whisper.</p>\n<p>“Do you want me to?”</p>\n<p>Slowly, Jimin nods.</p>\n<p>“Then I'll take care of you.” Yoongi forces a smiles “I promise I'll take care of you.”</p>\n<p>Jimin looks like he's about to say something but all he does is opening his mouth just to close it agin the next second, looking at Yoongi as if he's lost and can't even recognize him. Suddenly, he lets go of Yoongi's hands and stands up, taking his coat and scarf.</p>\n<p>“I have to go.” he says.</p>\n<p>“Jimin, listen to me-</p>\n<p>“I really have to go.” the boy sprints to the exit and leaves the penthouse, not even closing the door, disappearing behind the wall.</p>\n<p>Yoongi stares at the empty couch before he finds it in himself to stand up and actually close the door Jimin left open. Once he does, though, he can't move once more, staring at the wood in front of him, breathing slowly.</p>\n<p>It's not Jimin's fault if they're in this situation, it's Yoongi's. He knows it. Hoseok is right, Yoongi made him human and Jimin found comfort inside Yoongi's heart. So it's really just his own fault.</p>\n<p>The loud knocking on the door is what breaks Yoongi from his train of thoughts.</p>\n<p>Yoongi opens the door and he has barely mere seconds to process what it's happening. He can see for a moment Jimin, eyes red with tears and then all he can feel is the touch of the boy's fingers on his face and the way Jimin's lips meet his almost brutally.</p>\n<p>There are a few seconds where none of them move, they stand frozen. Then Jimin closes his eyes and the way his lips move on Yoongi's is careful and soft, Jimin tastes of smoke and something sweet and Yoongi's already intoxicated.</p>\n<p>Then Jimin pulls away from him with a loud gasp and his eyes are blown wide, his lips tremble.</p>\n<p>“I'm sorry.” he says “Oh God, I'm so sorry.”</p>\n<p>And then he's gone so quickly that for a moment Yoongi wonders if he dreamed about this.</p>\n<p>He didn't.</p>\n<p>That's probably what hurts the most.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Namjoon is talking to him about the latest incomes and the spike the business had lately and Yoongi is not listening. Which is not good because Yoongi needs to listen, this is an empire he's running, he can't slack off.</p>\n<p>Yet, his mind is not cooperating.</p>\n<p>Where Jimin touched him it burns. The feeling of his lips is still there, the memory of his taste haunts him.</p>\n<p>Jimin had never touched him before that day. Never.</p>\n<p>“Yoongi!” Namjoon clicks his fingers in front of his eyes and Yoongi brings his attention on his friend.</p>\n<p>“What?”</p>\n<p>“Where the fuck are you, man?” Namjoon sighs “Were you listening to me?”</p>\n<p>“No.” Yoongi admits “Sorry.”</p>\n<p>“You okay?”</p>\n<p>“Not really.” he sighs “I'm tired. That's all.”</p>\n<p>Judging from the way his eyebrow arches Namjoon clearly doesn't buy it, but he doesn't push the question further. He knows that Yoongi sometimes needs his space and his own time.</p>\n<p>“Listen, don't worry about these.” he says, gesturing towards the papers scattered on the desk, numbers and words overlapping each other “I'll take care of everything. I always do, if you need some time off I won't blame you.”</p>\n<p>Yoongi grimaces. “I don't need time off.”</p>\n<p>“Yeah, you do. You're only human, brother.” Namjoon sits more comfortably on the chair “It wasn't important anyway, nothing urgent that we need to review. So let's just chill okay?”</p>\n<p>“Okay.” Yoongi nods “Yeah, let's do that.”</p>\n<p>Namjoon hums with a content smile stretching his lips, dimples just below his cheeks.</p>\n<p>Yoongi remembers when it was just Namjoon, Hoseok and him and they were young and scared but they had each other and they used to sneak out the base and run around for hours, getting lost in the city, stealing cheap food from the food trucks on the streets. Suddenly, he misses those days even though they were horrible.</p>\n<p>“Joons.”</p>\n<p>“Mh?”</p>\n<p>“Did you look into Gao's new deal in the end?”</p>\n<p>Namjoon nods.</p>\n<p>“Yeah, I did.” he says, his voice more quiet this time “And I can tell you that it's fucking huge.”</p>\n<p>That peaks Yoongi's interest. “How huge?”</p>\n<p>“Enough to make it impossible for me to actually find real infos about it.” Namjoon scratches his neck “Everything is real fucking secret. No one knows shit. They just know that it's this huge order of weapons that comes from some foreigners, they don't even know where they're from.”</p>\n<p>Yoongi leans over the desk and, automatically, Namjoon does as well even though they're alone.</p>\n<p>“I need to ask you a favor.” Yoongi says.</p>\n<p>“Sure.”</p>\n<p>“I need you to find dirt on Gao.”</p>\n<p>At that Namjoon snorts. “Yoons, everything about Gao is dirty.”</p>\n<p>“No, you don't get it.” Yoongi shakes his head and taps on the table with his index finger “I neel real dirt. Dirt with proofs. Real proofs. Stuff that gives me leverage over him.”</p>\n<p>“That ain't going to be easy.”</p>\n<p>“Listen, during these years as our customer Gao left so many fucking tracks so many times when he paid us.” Yoongi insists “He's not fucking careful when it comes to where his money goes, why should he be careful about the rest? I'm sure that the fucker thinks that whatever he does he's still untouchable.”</p>\n<p>“That's because he is.”</p>\n<p>“He doesn't need to know that we know. He just needs to think that he's not so safe anymore.”</p>\n<p>Namjoon frowns.</p>\n<p>“What are you trying to do, brother?” he asks “Is this about Jimin?”</p>\n<p>When Yoongi doesn't answer, Namjoon sighs. “What the fuck, Yoongi?”</p>\n<p>“I just need something, Joons. Something big or shitty enough to give me something, anything, to use against him.”</p>\n<p>“Wait, you want to blackmail Wen fucking Gao?”</p>\n<p>“If it's necessary then yes.”</p>\n<p>“Shit.” Namjoon takes a deep breath “Why now?”</p>\n<p>“Because,” Yoongi begins “Jimin can't wait three years.”</p>\n<p>Namjoon opens his mouth to say something but Yoongi stops him before he can even start.</p>\n<p>“Namjoon, it's not just because Jimin can't take it, it's because he probably won't see the end of those three years.”</p>\n<p>“Yoons.” Namjoon presses his lips together “Have you ever thought that maybe, just maybe, Jimin is using you? That he seduced you or something just to get out of this?”</p>\n<p>Yes. He thought about it. He thought about it so many times that Yoongi lost count. But then, every single time he had those doubts, he remember the way Jimin smiles at him sometimes, of how his eyes light up whenever Yoongi talks to him and of the way his eyes follow his movements as if he's witnessing a god walking.</p>\n<p>“He's not.” Yoongi says “And even if he is, I don't care.”</p>\n<p>Namjoon looks at him for a full minute, eyes intense as they try to understand what Yoongi's thinking, what he's not telling him. In the end, he sighs.</p>\n<p>“I'll do my best.” he says “I know some people who might have something. And most importantly, Gao has so many fucking enemies, I'm sure someone is willing to snitch on him with enough money.”</p>\n<p>Yoongi hums.</p>\n<p>“If the money doesn't work then cohertion will.” the man says “I'm serious, Namjoon. I don't care if you need to break bones, I need information.”</p>\n<p>“I get it.” Namjoon takes a deep breath, shaking his head “But it might take a while.”</p>\n<p>“Of course.”</p>\n<p>“No, I know that you know. I know you're patient, you know how this stuff works. But you just told me that Jimin might not resist much so this is why I'm telling you. So that you warn him.”</p>\n<p>Yoongi swallows the feeling of dread that threatens to eat him alive and manages to nod.</p>\n<p>“Yeah.” he croaks “Okay.”</p>\n<p>Namjoon sighs loudly and throws his head back, staring at the ceiling.</p>\n<p>“I really hope you know what you're doing brother.”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p> </p>\n<p>The days go by and none of them mention the kiss. Yoongi doesn't because he's terrified, Jimin probably has even more reasons.</p>\n<p>The days go by and Jimin, at some point, stopped smiling.</p>\n<p>Yoongi notices during one afternoon: Jimin is sitting on the couch as usual, a book open on his lap. Usually, Jimin would be reading with a soft, careless smile but this time he's just staring at the wall, book forgotten, eyes tired and lips pressed firmly together.</p>\n<p>“Jimin?”</p>\n<p>The boy trains his gaze on Yoongi.</p>\n<p>“What?”</p>\n<p>“Are you okay?”</p>\n<p>“Peachy.”</p>\n<p>Yoongi gulps. “I mean it, are you okay?”</p>\n<p>Jimin snorts, shaking his head and staring at Yoongi like he's something unbelievable.</p>\n<p>“Okay.” Jimin repeats with so much venom that Yoongi freezes “No, Yoongi, I'm not fucking okay.”</p>\n<p>A heavy silence falls after those words and Jimin looks back on that goddamn wall. Yoongi hates it. He hates the silence, he hates the fact that Jimin is so stressed and tired that he used that voice with him, he hates that Jimin feels the need to put a barrier between them to defend himself. He hates it.</p>\n<p>After a while, Jimin takes a deep breath.</p>\n<p>“I'm sorry.” he whispers “I shouldn't get mad at you, you were just worried.”</p>\n<p>Yoongi goes to sit from his desk to the couch next to Jimin, their knees brushing together.</p>\n<p>“It's fine, Jimin.”</p>\n<p>“It's not.” the boy retorts weakly “But it's not your fault if I'm like this, so I'm sorry. It's just... he's been in a bad mood lately. He's always in a bad mood lately. I swear, I'm always fucking holding my breath and tiptoeing around him so that he doesn't fucking snap at me.” Jimin glances at him “I don't think the deal is going so well.”</p>\n<p>Yoongi frowns.</p>\n<p>“Last time he was here he said it was going great.” he says and Jimin shakes his head.</p>\n<p>“I'm pretty sure something went wrong. That some issue came up and everything got more complicated. So of course he's always in a shitty mood.”</p>\n<p>“Is it okay that you're here?”</p>\n<p>Jimin shrugs. “He's never home, just during the night. But he makes the best use out of those few hours.”</p>\n<p>Yoongi doesn't want to ask, he doesn't want to know, but there's that part of him that it's so fucking concerned that pushes him to inquire.</p>\n<p>“What did he do?”</p>\n<p>Jimin lets out a shaky breath, massaging his neck.</p>\n<p>“Nothing physical, actually. He just... says stuff to me.”</p>\n<p>“What stuff?”</p>\n<p>Jimin's expression twists into something awful, something like shame and sorrow and loathe and Yoongi hates it. God, he hates it.</p>\n<p>“You know that nothing he says it's true, right?” Yoongi murmurs, trying to catch Jimin's gaze “Nothing. You need to keep that in mind.”</p>\n<p>“Yeah.” Jimin sniffles “But it feels real.”</p>\n<p> </p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p> </p>\n<p>Jimin is, once again, late. It happens a lot lately and Yoongi tries not to worry, he really does, but it's impossible.</p>\n<p>So when the doorbell finally rings Yoongi lets out a sigh of relief and goes to open for Jimin.</p>\n<p>“Hello.” Jimin says, voice tight.</p>\n<p>“Hey.” Yoongi steps aside and Jimin enters “You're late.”</p>\n<p>“Something came up.” the boy replies as he takes off his coat and drops it on the couch.</p>\n<p>“Everything okay?” Yoongi asks, closing the door.</p>\n<p>“Yes.” Jimin takes out of his jeans pocket the usual piece of paper “Order.”</p>\n<p>Yoongi takes the paper, keeping his eyes on Jimin. He doesn't look good. He's tense, he keeps looking around, his lips chapped and God, his skin is ashen.</p>\n<p>“Jimin.” Yoongi tries “Are you sure you're-”</p>\n<p>“Can I use the toilet?” Jimin interrupts him “I need to take a piss.”</p>\n<p>Yoongi slowly nods.</p>\n<p>“Yeah, sure.”</p>\n<p>Jimin takes off, walking quickly to the toilet.</p>\n<p>Once Yoongi is alone he goes to the kitchen and starts the fire under the kettle so that he can make some tea. He goes back to the couch, sitting heavily and he decides to check the new order.</p>\n<p>“Why does he need so much fucking valium?” Yoongi murmurs “And enough with the goddamn morphine.”</p>\n<p>The minutes pass and Jimin still hasn't come back from the toilet. Yoongi wonders if he should just let him be but there's a voice in the back of his head that screams at him that something's wrong, that Jimin looks way too on the edge, so he stands up and walks to the toilet.</p>\n<p>The door's closed and Yoongi knocks twice.</p>\n<p>“Everything alright there?” he asks, he gets no response “You've been in there for a while.”</p>\n<p>There's silence for a while before Yoongi can faintly hear Jimin's sobbing and immediately Yoongi opens the door.</p>\n<p>Jimin is on his knees, clutching tightly the hems of the toilet, face pale and wet with tears.</p>\n<p>“Shit, what's wrong?” Yoongi asks.</p>\n<p>Jimin opens his mouth to answer but suddenly he bends over the toilet, retching violently and Yoongi is immediately by his side. He moves Jimin's hair from his damp forehead as the boy vomits, body shaking and the stench of bile filling the bathroom.</p>\n<p>“It's okay, just let it out.” Yoongi says, rubbing at his back “Shit, if you were sick you could've just said so. Why did you come if you felt so bad?”</p>\n<p>Jimin whimpers and he shakes his head.</p>\n<p>“I'm n-not... fuck.”</p>\n<p>“It's okay, why don't you get up? Can you do that?”</p>\n<p>Again, Jimin shakes his head.</p>\n<p>“Well, you can't stay like this, at least try to sit down, yeah? With your back against the wall, until you feel better.”</p>\n<p>Jimin doesn't move so Yoongi takes the matter in his own hands and carefully pulls Jimin away from the toilet. Yoongi is met with no resistance whatsoever so he keeps pushing him until his back is against the cool tiles of the wall and he's sitting down.</p>\n<p>“Do you want some water?”</p>\n<p>Jimin blinks a few times before lifting his eyes until they meet Yoongi's.</p>\n<p>“I'm kinky, you know?”</p>\n<p>Yoongi knits his eyebrows. Jimin's voice is awfully void of emotion and his eyes are far too hazy.</p>\n<p>“Jimin, what happened?”</p>\n<p>“I have so many kinks.” he says “So many. I feel like it's a natural thing when you do my job for so many years. Or maybe not. I don't know. But seriously, Yoongi, so much nasty shit turns me on, it's ridiculous.”</p>\n<p>“Jimin-”</p>\n<p>“Gunplay is one of them. I fucking love it. There's something about it that just... maybe it's the way a gun feels against your temple when you're being fucked, the weight of it. Even if you know it's not loaded it just feels so fucking good, you know how dangerous that thing can be, the power it has over a human being, so fuck I love it.”</p>\n<p>Yoongi holds his breath and he can barely make out what Jimin is telling him because the boy is shaking so much, and his voice is weak even though he's speaking too fast, words overlapping each other, barely taking a breath between every sentence.</p>\n<p>“And he's in such a shitty mood! Such a fucking bad mood, he's so angry at me so I thought that maybe if I made him happy he'd calm down! Just for a while! I thought “make him happy Jimin, so that he lets you breath for a while”. And so I told him!” Jimin stares at him, eyes blown wide, breath coming out short “I told him Yoongi! I told him that I really like gunplay and you should've seen the look on his fucking face. He was fucking ecstatic and I thought I made it, you know? I thought that he was going to be happy.” finally, he pauses “I fucked up so bad. I should've never... what was I thinking? At this point I think I'm just looking for it, I'm fucking asking for it, what was I expecting?!”</p>\n<p>“Jimin, I need you to calm down.” Yoongi takes a deep breath “You need to tell me what happened, but you have to calm down.”</p>\n<p>“Do you know what he kept saying?” Jimin continues and it doesn't look like he heard a word of what Yoongi said “<em>Imagine it's him</em>”.</p>\n<p>Yoongi's blood runs cold and he feels his entire body freezing.</p>\n<p>”<em>You want that, don't you? You want him to fuck you. So imagine it's him</em>”. Jimin tilts his head to the side -”<em>Imagine that it's him fucking you now</em>. I should've never told him. It was even loaded, what was I thinking?”</p>\n<p>“Jimin!” Yoongi shouts and finally,<em> finally</em>, Jimin's eyes focus on him “Jimin, what did he do?”</p>\n<p>“He used a gun.”</p>\n<p>The words linger in the air and Yoongi can't understand what he's trying to tell him.</p>\n<p>“It was loaded. And he used a gun.”</p>\n<p>“I don't-”</p>\n<p>“He fucked me open with it.” a pause “I can even remember the model. 45 ACP Smith and Wesson. He told me. I couldn't even move because he had his finger on the trigger and he kept saying that if I tried to move he would have shot me and he said <em>is this how you wanna die? With a bullet up your ass?</em>, I couldn't move. I was frozen, I was so fucking scared and it hurt and I couldn't even speak 'cause I was so terrified. It was loaded and I just let it happen and it hurt so fucking bad-”</p>\n<p>Jimin stops talking abruptly when he notices Yoongi's hands trying to reach his face.</p>\n<p>“It's me.” Yoongi tries, not moving any further “It's just me.”</p>\n<p>Yoongi sees the moment Jimin breaks. His face screws up and he chokes on a sob, raising a hand and clutching at Yoongi's sweater, trying to pull him closer.</p>\n<p>Yoongi lets Jimin snake his arms around his waist and he lets him hide his face on his chest, holding him lightly so that if he wants to pull back he'll meet no resistance. He lets him cry whilst he caresses his hair and he forces himself not to break as well because Jimin needs him now and he can't be weak.</p>\n<p>They stay on that floor for what feels like hours until Jimin's body isn't shaking so much and his sobs quiet down.</p>\n<p>“I'll get you out of there.” Yoongi whispers but the words seem too loud in the quiet “I swear it.”</p>\n<p>Silence again.</p>\n<p>“Jimin, I'm so sorry.”</p>\n<p>“Can I...” Jimin gulps “Can I stay here tonight? He's away for two days. Or was it three? I can't remember. But can i stay?”</p>\n<p>“Of course.”</p>\n<p>“Please, don't make me go back there.”</p>\n<p>“You're staying here tonight.” Yoongi sighs “You're staying here.”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>It takes Yoongi a lot of coaxing and soothing in order to convince Jimin to stand up so that he can sleep for a while.</p>\n<p>Yoongi manages to drag Jimin to his bed and he lays there with his eyes closed whilst Yoongi tucks him in.</p>\n<p>“Do you need anything? You should drink some water.”</p>\n<p>Jimin opens his eyes.</p>\n<p>“Can you call Tae?”</p>\n<p>Yoongi nods. “Yeah, of course.”</p>\n<p> </p>\n<p> </p>\n<p>The moment Taehyung and Jungkook arrive at the penthouse, Yoongi is quickly kicked out of his room so that Tae and Jimin can be alone.</p>\n<p>Yoongi is sitting on his armchair, a cigarette burning between his fingers, and Jungkook is sprawled over the couch, gaze fixed on the ceiling.</p>\n<p>Yoongi knows they're running out of time. He had hoped that maybe they would've had more days, maybe even weeks, but clearly that wasn't the case. This whole situation was getting out of hand too quickly and Yoongi feels powerless, which is pretty insane considering that power is all he ever had.</p>\n<p>“We could cut his balls.”</p>\n<p>Yoongi blinks a few times and then he looks at Jungkook.</p>\n<p>“Excuse me?”</p>\n<p>“I said that maybe we could cut his balls.” he repeats, unfazed “Or better, we could shoot him in the balls. Or we could fuck him with a gun and then shoot him in the balls.”</p>\n<p>“Shit, kid...”</p>\n<p>“Hanging him by the balls sounds nice too.” Jungkook sighs “So many ideas, so little balls.”</p>\n<p>“Is that why everyone is actually scared of you?” Yoongi asks “'Cause I never understood how someone could be scared of you but now I do.”</p>\n<p>Jungkook frowns.</p>\n<p>“Like you don't wanna do the same.” he mumbles.</p>\n<p>“In fact, I don't.” Yoongi takes a lungful of smoke.</p>\n<p>“Bullshit.”</p>\n<p>“Language kid. Doesn't mean I don't wanna hurt him. Shit...” Yoongi shakes his head “I'd fucking torture him 'till he turns into a weeping mess, 'till his fucking bladder gives up on him, 'till he shits himself and then I'd make him eat his own shit. But I ain't getting near his balls. That's just wrong.”</p>\n<p>Jungkook slowly raises himself so that he's sitting up, staring at Yoongi with a blank expression.</p>\n<p>“And you say I'm scary?”</p>\n<p>Yoongi rolls his eyes and in that moment Taehyung starts coming down the stairs, sighing heavily.</p>\n<p>“How is he?” Jungkook asks.</p>\n<p>Taehyung doesn't answer, he just pats on Jungkook's leg so that the boy makes space for him on the couch and he sits down.</p>\n<p>“So.” he starts “He's not good. Like, at all. But he's coping better than I expected.”</p>\n<p>Yoongi allows himself to sigh in relief. If Taehyung said that Jimin was holding himself together than Yoongi trusted him.</p>\n<p>“Crazily enough, the good news is that Jimin isn't exactly new to this kind of treatment so he knows what to do in order not to just... crumble down.”</p>\n<p>“Treatment?” Jungkook frowns.</p>\n<p>“Rape.” Taehyung says “Yoongi, he's not good.”</p>\n<p>“I know.”</p>\n<p>“No, you don't. You think you do, but you don't.” Taehyung shakes his head “This kind of shit fucks you up, okay? And Jimin is going through a lot, there's not just the physical abuse, there's the mental one. Gao is fucking him up in the head and he can't stay there. You gotta do something.”</p>\n<p>“I'm working on it.”</p>\n<p>“Well, work faster then. I don't know how, but you gotta work faster, 'cause there is no way Jimin will be able to put up with this shit for much longer. He's tired, he's fucking drained and he can't take this anymore.” Taehyung sighs “The thing is, this situation has two bad scenarios in store for us. In the first one, Gao kills him. In the second one Jimin kills himself. And trust me Yoongi, he could. I can see it in his eyes that he's considering it, he's too fucking gone.”</p>\n<p>Yoongi takes in the words, let them sink in and when his mind finally processes them he knows his hands are shaking.</p>\n<p>“What do I do?” he asks “I mean now. What do I do now?”</p>\n<p>Taehyung shrugs. “Just spoil him. Let him rest. Don't leave him alone.” the boy stands up and Jungkook does as well, following him “Thread carefully. He's frail as glass right now.”</p>\n<p>Yoongi nods. “Thank you Taehyung.”</p>\n<p>Taehyung smiles at that, sympathetically, but he still smiles and then he makes his way out of the penthouse with Jungkook.</p>\n<p>After taking a few steading breaths, Yoongi starts climbing up the stairs to join Jimin in his bedroom.</p>\n<p>He slowly opens the door and the room is dimly lit only by the bedside lamp.</p>\n<p>When he approaches the bed, Yoongi sees that Jimin is asleep, curled up on his side, hair falling messily over his forehead and his face peaceful and relaxed in a way that Yoongi hasn't seen in a long time.</p>\n<p>Yoongi quietly sits down on the free side of the bed, careful as to not wake the boy up, his back against the headboard.</p>\n<p>Yoongi is stuck. He's fucking stuck and it feels disgusting, not knowing what to do is absolutely sickening.</p>\n<p>What was Jimin thinking when he signed that contract? How desperate was he to think that working for a man like Gao could be a good idea?</p>\n<p>Without realizing, his hand moves to Jimin's hair, smoothing them out, stroking the locks carelessly. A soft sigh and Jimin opens his eyes.</p>\n<p>“Did I wake you up?” Yoongi asks and Jimin nods “Sorry.”</p>\n<p>“It's okay.”</p>\n<p>“You should sleep.”</p>\n<p>“Don't want to.”</p>\n<p>“You should really-”</p>\n<p>“I'm scared of what I'll dream.” Jimin interrupts him “I don't like being this weak. I've never been this weak or helpless before.” a short pause “I hate him for making me so weak.”</p>\n<p>“I hate him for many other reasons.” Yoongi whispers, he wants to keep the room as quiet as possible “But really kid, you need to sleep.”</p>\n<p>Jimin hums before looking up at Yoongi.</p>\n<p>“Sleep with me? Please.”</p>\n<p>Yoongi should say no. In a moment of clarity, he realizes that they're both too far gone to actually think that taking precautions at this point would change anything. They should've taken them way before, now it's too late.</p>\n<p>So Yoongi lifts the covers of the duvet and slips under them, laying on the bed next to Jimin.</p>\n<p>They stay in silence for a long time after that, Yoongi's hand find its way to Jimin's hair again and their breaths mix together in the room.</p>\n<p>Then Jimin slowly drags himself closer to Yoongi until he gathers enough courage to put his head on the other man's chest, taking a deep breath and closing his eyes. Yoongi holds him closer, his fingers now caressing softly the boy's neck.</p>\n<p>“You-” Jimin starts “You think you're responsible for this.”</p>\n<p>Yoongi gulps.</p>\n<p>“I am.”</p>\n<p>“Maybe. The thing is, Yoongi, that you've given me a taste of what being happy would feel like.” Jimin sighs “And now I'm addicted.”</p>\n<p>Yoongi lets a few moments of silence linger on, the words he wants to say are heavy on his tongue.</p>\n<p>“I'm sorry. Hoseok warned me that this could happen and I knew the risks. But I just couldn't help myself.”</p>\n<p>Jimin lifts his head just a bit, enough to look at him in the eyes.</p>\n<p>“Why?”</p>\n<p>“I told you.” he murmurs, Jimin's breath breaks on his neck and it's wonderful “I want you to be happy. There were moments when you were happy, even if just a bit, like that time I took you to the coffee shop and you looked carefree in the car. I got addicted to those moments and I wanted to give you more of those.”</p>\n<p>Jimin lays down again.</p>\n<p>“You did.” he says “What are we going to do?”</p>\n<p>“I'm getting you out of there. I'll find a way, I've got Namjoon working on it.”</p>\n<p>“That sounds impossible.”</p>\n<p>“What do you want Jimin?”</p>\n<p>“What do you mean?”</p>\n<p>“From life. What do you want from it?”</p>\n<p>This time, the silence is long and heavy, so tense that Yoongi has trouble breathing. When Jimin finally speaks his voice is so low that Yoongi almost can't hear him.</p>\n<p>“I spent my whole life surviving. Breathing. That's all I've been doing. I'm only breathing. I can't do just that forever, I want to live. I want freedom.”</p>\n<p>Yoongi nods and he closes his eyes, Jimin's body warm against his, the smell of cigarettes and expensive perfume makes its way inside Yoongi's brain.</p>\n<p>“I'll give you freedom and more if that's what you want.” Yoongi stirs a little, getting more comfortable and snaking his arm around Jimin's waist “You said he's away for three days?”</p>\n<p>“He'll be back on Sunday from Thai.” Jimin replies, his voice thick with sleep.</p>\n<p>“Stay here until Saturday then.” Yoongi says “You hate it there.”</p>\n<p>“I do.” Jimin replies “Okay. I'll stay.”</p>\n<p>“Good.”</p>\n<p>“'m tired.”</p>\n<p>“I know.”</p>\n<p>And just like that Jimin's asleep, breath slow, body limp.</p>\n<p>Yoongi falls asleep shortly after.</p>\n<p> </p>\n<p> </p>\n<p>When he wakes up the next morning it is to an empty bed, warmth gone, only a note scribbled quickly on a piece of paper left.</p>\n<p> </p>\n<p><em>Sorry,</em> that's all that's written there.</p>\n<p> </p>\n<p>Yoongi cries for the first time in what feels like years.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Jin stares at him for a long time before he takes a deep breath and stands up from the arm chair, walking in circles around the room.</p>\n<p>“You know what's the crazy part?” the man asks Yoongi “That right now the only solution that comes to my mind is to literally to kidnap Jimin.”</p>\n<p>Yoongi nods. “Don't think I haven't considered it.”</p>\n<p>“Fucking hell, Yoons.” Jin shakes his head “A fucking gun.”</p>\n<p>“I'm so fucking worried.” Yoongi sighs “I swear to god, I've never been more worried in my life. He just left like that, I have no idea of what he's doing.”</p>\n<p>“Can't you call him?”</p>\n<p>Yoongi shakes his head.</p>\n<p>“He doesn't have a phone, Gao took it away from him the moment he signed that fucking contract.”</p>\n<p>Seokjin stops dead in his tracks and looks back at Yoongi.</p>\n<p>“This whole story started because of that contract.” he says “Can't we do anything about it?”</p>\n<p>Yoongi scoffs.</p>\n<p>“Like what, burn it?”</p>\n<p>“If that contract disappears Jimin is free.”</p>\n<p>“The contract won't disappear.”</p>\n<p>“No.” Jin agrees “But it can be replaced.”</p>\n<p>Yoongi frowns, looking at the older man.</p>\n<p>“What are you talking about?”</p>\n<p>Jin doesn't answer him for a long time, standing still in the middle of the room, his eyes focused on the ground, eyebrows knitted together and lips slightly agape. Yoongi knew better than try and take some answers out of his friend in this moment, when Seokjin started thinking like that it was hard to get him out of his trance.</p>\n<p>“I need to talk to Namjoon.” he finally says, after another minute of silence “Right now.”</p>\n<p>“What?” Yoongi stands up from the armchair and tries to follow Seokjin, who's already taking his coat and shrugging it on “Jin, talk to me.”</p>\n<p>“Not now.” he replies “Let me speak with Namjoon first, then we'll talk.”</p>\n<p>“But-”</p>\n<p>“Yoongi.” Jin says sternly, staring at him with his eyes narrowed “I am not going to give you false hopes, so let me speak with Namjoon first.”</p>\n<p>Yoongi sighs.</p>\n<p>“You have a plan.”</p>\n<p>“A poor attempt at one, yes.”</p>\n<p>“Okay.” Yoongi nods “Okay, talk with Namjoon.”</p>\n<p> </p>\n<p> </p>\n<p>*</p>\n<p><br>\n </p>\n<p> </p>\n<p>The concern Yoongi has for Jimin quickly turns into dread. Since last thursday he hasn't heard from the boy. Usually Jimin would drop at his house in the afternoon, especially on saturdays, but this time he hasn't. Will he even come on thursday for the usual drop off? At this point, Yoongi doesn't know.</p>\n<p>What if he doesn't come back ever again.</p>\n<p>The moment that thought manages to get inside his head, dread turns into panic.</p>\n<p> </p>\n<p> </p>\n<p>But then monday comes and there's a knock on his door. When Yoongi opens it he only has time to see a blur of pink hair before Jimin is throwing his arms around Yoongi's neck, holding him so tightly that it hurts.</p>\n<p>“You're back.” Yoongi mutters, hugging Jimin back and closing his eyes in relief “God, you're back.”</p>\n<p>“Get me out of there.”</p>\n<p>Yoongi tilts his head a little, trying to get a look at Jimin's face, but the boy has his forehead against his shoulder.</p>\n<p>“I told you I would, it's just going to take time.”</p>\n<p>“No, please. Now.”</p>\n<p>“Jimin.”</p>\n<p>“I can't stay there!” the boy screams and lets go of Yoongi, shoving him away.</p>\n<p>Yoongi stumbles back before he gets a hold of his balance again and now he can finally see Jimin's face. Pale doesn't even begin to describe how ashen his skin is, but that's not what worries him the most: the new bruises do.</p>\n<p>“Fucking shit, Jimin.” Yoongi hisses as he gets closer to Jimin, gripping his chin and checking the wounds. These are far worse than those he had last time, these look fucking ferocious. His bottom lip is split open, there are yeloowish marks round his left eye and Yoongi can see more bruises down his neck and he's sure as hell that the rest of Jimin's body doesn't look any better “What the fuck did he do?”</p>\n<p>“He found out that I spent the night here.” Jimin says and he shakes his head “Yoongi, I don't give a fuck about the injuries, I don't give a fuck that he hit me.”</p>\n<p>“What are you talking about?”</p>\n<p>“I told you!” Jimin screams again, rage coloring his cheeks “I told you that it could be worse and it's worst now, so much worst!”</p>\n<p>“I can see that.”</p>\n<p>“No! No, it's not the hitting!” Jimin closes his eyes and takes a deep breath “He drugged me!”</p>\n<p>Yoongi lets the words sink in before he gets a hold of Jimin's wrist and pulls him away from the still open door. “Okay, you go sit down on that fucking couch.” Jimin follows the order and Yoongi closes the door, taking a deep breath before he joins the boy on the sofa.</p>\n<p>“I'm sorry I pushed you.” Jimin mutters, staring at his hands.</p>\n<p>“I don't care about that, tell me what happened. What do you mean he drugged you?”</p>\n<p>Jimin's body stiffens, his face twisting into disgust. It's the first time Yoongi sees this kind of reaction in him, this rage.</p>\n<p>“The fucking prick.” the boy hisses with venom in his voice “He put Valium in my wine, I'm sure he did. I was fucking out of it, dunno how much he used, but I was out of it, too relaxed. Next thing I know I was tied up on the bed and the asshole was sitting next to me with a spoon and a lighter.”</p>\n<p>Yoongi clenches his jaw and tires to swallow, but his mouth feels too dry.</p>\n<p>“<em>You're too feisty lately,</em> that's what he said. <em>Did Min fuck you so good that now you think you can do what you want? Has he been spoiling you? That means I have to train you again.</em>” Jimin starts fumbling in the pockets of his coat before he manages to find his pack of cigarettes and he takes one out of it, putting it betweent his lips and trying to light it up with the lighter, failing “Light it for me, will you? My hands are shaking.”</p>\n<p>“Yeah.” Yoongi takes the lighter from Jimin's hands and click it, getting the flame on the edge of the cigarette. The boy takes a lungful and blows smoke out.</p>\n<p>“I begged him. Really, I fucking begged him to stop, told him I would never do it again, he didn't fucking listen. He took the siringe and drugged me.”</p>\n<p>“Heroin?” Yoongi asks “He used heroin?”</p>\n<p>Jimin nods. “I don't even know what- It felt so fucking good, Yoongi.”</p>\n<p>“I know.”</p>\n<p>“I wasn't supposed to like it. Fuck, I didn't, I was scared out of my mind, but it felt better than anything I've ever experienced.”</p>\n<p>“I know, Jimin.”</p>\n<p>“That shit is scary.” Jimin takes a drag of the cigarette, tipping nervously his fingers on his knee “I don't even know how much time I was out, a moment I was there, the other I was fucking floating. It felt like minutes, but I guess it wasn't.”</p>\n<p>“No, it was a couple of hours.”</p>\n<p>“Shit.” Jimin shakes his head “I forgot about it all for a moment. I wasn't even there, I felt absolutely nothing, saw nothing. I was so- content. No worries. No fear. No pain. It was fucking bliss.”</p>\n<p>“Yeah, heroin does that to you.”</p>\n<p>“But then it stopped working.” Jimin lowers his gaze “I don't know what happened. Dunno if he fucked me or just got off on it. Guess the latter. I came to myself and I was naked with his cum dried on my chest.”</p>\n<p>“Shit.”</p>\n<p>“This happened last night. He wasn't home, I knew that. He had this flight to Honk Kong, he's staying there for like three days. He just fucking left me there, the fucking piece of shit.” a short silence follows “I shouldn't be here. They'll tell him, I wasn't so subtle when I left. They'll thell him and this time he'll fucking kill me.”</p>\n<p>“You're not going back there. You're staying here and this time you're staying for real. Until he comes back from Hong Kong.” Yoongi looks at him “You hear me? No leaving at the crack ass of dawn with just a fucking note, okay? You're staying and we figure something out.”</p>\n<p>Jimin doesn't answer him for a while. He licks at his bottom lip, flinching a little at the pain and then he manages to nod.</p>\n<p>“Good.” Yoongi slumps back on the couch and his hand finds its way to hold Jimin's “Fucking hell, Jiminie.”</p>\n<p>“Jiminie?” the boy asks.</p>\n<p>“Nickname. Just came out.”</p>\n<p>“I like it.” Jimin lays back on the couch next to Yoongi “I'm sorry I left like that the other time. I wasn't really myself.”</p>\n<p>“It's okay. It's good to see you so angry, though. Last time you were just-”</p>\n<p>“Pathetic?”</p>\n<p>“Tired.” Yoongi squeezes his hand “Never pathetic.”</p>\n<p>They stay quiet for a while, Yoongi finds solace in the sound of Jimin's breathing and in the warmth of his skin.</p>\n<p>“How does it work with Heroin?” Jimin asks “Like, am I going to get hooked on it? I don't know how it works.”</p>\n<p>Yoongi shakes his head.</p>\n<p>“Nah, as long as you don't take it again soon you ain't getting addicted. That's why it's dangerous, you don't feel the lack of it at first, you don't miss it, so you just go for it again cuz you think you're safe. That you're strong, you're not getting addicted. The moment you feel the abstinence then you're addicted and you're fucked, but that's not gonna happen.”</p>\n<p>“What if he gives it to me again?”</p>\n<p>Yoongi doesn't answer. He can't give him false hopes, he can't lie and say that he's not going back to that house.</p>\n<p>“I want to run away, Yoongi. But he'd find me.”</p>\n<p>“Yeah.”</p>\n<p>“I feel like he's actually going to kill me soon.” Jimin closes his eyes “His men keep saying he will. That he's getting tired of me.”</p>\n<p>“He's pissed because he knows you don't belong to him.”</p>\n<p>“That's true, I don't.” Jimin turns his head to look at Yoongi “Do I belong to you?”</p>\n<p>“You belong to yourself.”</p>\n<p>Jimin hums. “But I wouldn't mind belonging to you.”</p>\n<p>Yoongi smiles a little and he shakes his head. “Don't go cheesy on me.” Jimin giggles softly “Have you eaten anything since last night?”</p>\n<p>“No.”</p>\n<p>“We're ordering food. Namjoon, Hoseok and I always get food from this italian restaurant, it's not bad.”</p>\n<p>“I like italian.”</p>\n<p>“Okay. Go and get a shower and wear something of mine. Just... try to relax, okay?”</p>\n<p>Jimin nods. “Can we pretend for a while?”</p>\n<p>“Pretend?”</p>\n<p>“That we're normal. Just for today.”</p>\n<p>“We can do whatever you want today.”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Pretending, Yoongi finds out, is nice.</p>\n<p>It's nice to pretend they're somewhat a normal couple, eating cheap italian food sitting on the floor, looking at an old movie on tv, with Jimin wearing a pair of his sweats and one of his huge black hoodies, pink hair wavy after the shower, skin no longer ashen but sunkissed.</p>\n<p>It's nice to pretend.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>“Have you ever seen Detroit in september?”</p>\n<p>Yoongi looks down at Jimin, resting his head on his chest with his arms snaked around his waist, legs tangled together under the blankets, the lights in the room are dimmed low and it's quiet.</p>\n<p>“No. I've been to Detroit like once, but it was in November.” Yoongi replies, fingers lazily massaging Jimin's scalp.</p>\n<p>“It's beautiful in september. Summer hasn't really ended in Detroit when it's september.”</p>\n<p>“I'll take you there.”</p>\n<p>“You like making promises.”</p>\n<p>“Promises are like goals.” Yoongi murmurs “If I set a goal I tend to reach it.”</p>\n<p>Jimin hums.</p>\n<p>“Where else do you want to go?”</p>\n<p>“Japan. In spring. I want to see the cherry blossoms.”</p>\n<p>“We'll go there as well.”</p>\n<p>“I've never been on a ferris wheel.”</p>\n<p>“We'll do that too.”</p>\n<p>“Will you kiss me on the ferris wheel once we're on top?”</p>\n<p>“Why are you so fucking cheesy?”</p>\n<p>“I want to do all those clichéd things couples do.”</p>\n<p>“Then I'll kiss you on a ferris wheel too.” Yoongi laughs quietly “You're demanding.”</p>\n<p>“I'm spoiled.”</p>\n<p>“I'll fucking spoil you rotten.”</p>\n<p>“Oh, you know me so well.” Jimin sighs “How about we stop pretending for now.”</p>\n<p>“Why?”</p>\n<p>“It hurts.”</p>\n<p>“Then let's stop.” a pause “What do you want to do tomorrow?”</p>\n<p>“Don't know.”</p>\n<p>“Do you want to go to that coffee shop again?”</p>\n<p>“That sounds nice.”</p>\n<p>“Okay.”</p>\n<p>“'m tired.”</p>\n<p>Yoongi makes a noise of agreement and closes his eyes, slowly drifting off.</p>\n<p> </p>\n<p>When he wakes up it's because of a foreing weight on his lap and breathing fanning his cheeks. Yoongi slowly opens his eyes and he sees in the darkness of the room Jimin straddling his lap, mouth agape, staring down at him.</p>\n<p>“Jimin? What are you-”</p>\n<p>“There's something else I want.” Jimin says “And I want it now.”</p>\n<p>Yoongi, still heavy with sleep, just frowns. The moment Jimin drags his hips down Yoongi gasps, hands going immediately to Jimin's waist.</p>\n<p>“Wait, what the fuck are you doing?”</p>\n<p>“What do you think I'm doing?” Jimin grinds his ass on Yoongi's hips again, this time deliberately slowly “Don't you want me?”</p>\n<p>“Jimin.” the air around him is suddenly way too hot “Listen to me-”</p>\n<p>“I'll make you feel so good, Yoongi.” Jimin closes his eyes, his hips moving faster “And I know you'd fill me up so good. Stretching me open.”</p>\n<p>Yoongi tries to speak but all that comes out of his mouth is a choked off moan as he feels himself hardening under Jimin, the friction almost too good.</p>\n<p>“Fuck, Yoongi, I want you in my mouth.” Jimin sighs, throwing his head back and letting his hands wander on Yoongi's chest “Want you inside me, I- ah- I want you to make me cry, fuck. You've been so good to me, Yoongi, you deserve this. Tell me I've been good, shit, tell me I'm good.”</p>\n<p>“Jimin, please-”</p>\n<p>“I want you to love me Yoongi.”</p>\n<p>That's enough. Yoongi pulls himself up and cups Jimin's face, swiping his thumbs over his cheeks.</p>\n<p>“Stop this. Now. Hey, look at me.” Yoongi's voice is firm and Jimin drags his eyes to him “Stop this. It's not gonna happen like this, you hear me?”</p>\n<p>Jimin halts his movements, frowning at the older man.</p>\n<p>“I thought-” Jimin gulps “Don't you want me?”</p>\n<p>Yoongi sighs. “I'll want you when you want me as well.”</p>\n<p>“I do.”</p>\n<p>“Jimin, I'm not having you because you think I diserve a fucking reward. I'm not fucking you because you think you need to pay me back for what I've done for you!” Yoongi wets his lips “Jimin, you're not for sale when you're with me.”</p>\n<p>“I- I'm sorry, I-” the boy's voice breaks “I don't know what-”</p>\n<p>“Don't cry. Don't fucking cry.” Yoongi takes a deep breath, trying to calm himself down “Please, don't cry. You're gonna get through this, you're going to be fine, you're going to be happy, I fucking swear to you, I'll make you happy. Just don't cry.”</p>\n<p>Jimin lets out a ragged breath before he slowly nods, biting the inside of his cheeks.</p>\n<p>“You say you want me to love you.” Yoongi says and Jimin nods again “I do. I thought it was obvious.”</p>\n<p>Jimin smiles weakly. “It ain't obvious until you say it.”</p>\n<p>“Well, I did.”</p>\n<p>“And just like that you made another promise.”</p>\n<p>“Yeah.”</p>\n<p>“I-” Jimin sighs. He closes his eyes and lets his fingertips graze Yoongi's face “I love you. So much.”</p>\n<p>“It's gonna be okay. I know it. If everything goes to shit I'll just kidnap you, how about that.”</p>\n<p>Jimin giggles at that, eyes disappearing in crescents. “That doesn't sound so bad.”</p>\n<p>“I know right? We could be the gay version of Bonnie and Clyde.”</p>\n<p>“Chasing the american dream whilst running away from a chinese sick fuck?” Jimin shakes his head “That's not how the Bonnie and Clyde concept works.”</p>\n<p>“Yeah.” Yoongi kisses Jimin's wrist “We'll make it work.”</p>\n<p>“So many promises.”</p>\n<p>“That's all I really have to give you right now.”</p>\n<p>“That's the problem. You give too much. You give me too much, I don't give you anything.”</p>\n<p>“I told you, you don't have to give me anything. Now, can you please lie down and try to get some sleep?”</p>\n<p>“Such an old man.”</p>\n<p>“Shush.”</p>\n<p>Jimin just pushes Yoongi down until he's laying with his back on the bed and decides to just lie down on him, tangling together their legs again and setting his face next to Yoongi's.</p>\n<p>“You ain't exactly a feather, y'know?”</p>\n<p>“How dare you?”</p>\n<p>Yoongi chuckles, his fingers caressing the space between Jimin's shoulder blazes. “Why the fuck do you smell so good?”</p>\n<p>“I'm a miracle.”</p>\n<p>“'s that so?”</p>\n<p>“You're supposed to say <em>yes, Jimin, you are</em>.”</p>\n<p>“Ain't gonna happen.”</p>\n<p>“You smell good too, though.” a pause “I really like your hands.”</p>\n<p>“Are we going to just spit compliments now?”</p>\n<p>“Why not?”</p>\n<p>“Okay. You have nice lips.”</p>\n<p>“Nice doesn't even begin to describe how good my lips look.”</p>\n<p>“Okay, fine, you've got the best lips, you happy now?”</p>\n<p>Jimin hums. “You're pretty.”</p>\n<p>“Pretty? I'm the pretty one, seriously?”</p>\n<p>“Pretty boy.”</p>\n<p>“Don't you dare.”</p>\n<p>“Twink material, really.”</p>\n<p>“I'll make you sleep on the couch, Jiminie.”</p>\n<p>“I want something else. Now.”</p>\n<p>“What?”</p>\n<p>“It's gonna be cheesy.”</p>\n<p>“Just say it.”</p>\n<p>Jimin lifts his head a little, eyes almost pleading. “Kiss me?”</p>\n<p>Yoongi sighs. “Why do you even have to ask?”</p>\n<p>The thing about kissing Jimin is that it's familiar, it always has been. He tastes of cigarettes and promises that he doesn't want to break, he tastes of freedom and danger. Yoongi is intoxicated. He always has been.</p>\n<p>And this time it's not desperate, nor hurried or hungry. It's slow and deep, careful and interrupted only by whispered <em>I love you</em>s, with Jimin's hands clutching at his shirt to pull him impossibly closer, Yoongi's hand that always find their ways to Jimin's hair. It's like breathing, only better.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Jimin wakes up with the sound of Yoongi's urgent voice. He lazily opens an eye and he sees the older man sitting at the edge of the bed, back to him.</p>\n<p>“Say it again.” Yoongi says, there's silence for a while and Jimin realizes that Yoongi is speaking with someone on the phone “Are you serious? Shit. Shit, Namjoon.”</p>\n<p>Jimin frowns and stirs a little, then he drags his body closer to Yoongi, who notices he's awake and sends him a quick look “What do you mean when? Right fucking now, that's when. No fucking way we're wasting any more time. Get to it, tell the others.” another pause “Okay. Thank you, Joons, thank you.”</p>\n<p>Yoongi ends the call and turns to Jimin.</p>\n<p>“Morning.” Jimin says and Yoongi smiles.</p>\n<p>Jimin looks a little too adorable in the morning, that's for sure, and that's also a sight he could get used to real quick.</p>\n<p>“Morning.” Yoongi wets his lips “I have news but I'm not sure you'll like them.”</p>\n<p>“Where's my good morning kiss?”</p>\n<p>“Seriously?”</p>\n<p>“I am needy, Min Yoongi.”</p>\n<p>Yoongi rolls his eyes but still leans in to quickly peck Jimin's lips, the boy hums.</p>\n<p>“That's better. Now what are these news?”</p>\n<p>“Okay. You're leaving right now and going back to Gao's place.”</p>\n<p>Yoongi sees the moment Jimin's smile drops from his face, eyes immediately flooding with worry.</p>\n<p>“Why? What did I do, what's wrong?”</p>\n<p>“You did nothing, everything's fine.”</p>\n<p>“You said I could stay, don't make me go there.”</p>\n<p>“Listen to me, okay? I don't want you to go back, but we don't have a choice. It's better this way.”</p>\n<p>“Yoongi, please-”</p>\n<p>“Jimin, the moment Gao comes back in two days you have to tell him something.” Yoongi speaks over him “You gotta tell him I want to see you both immediately. Both of you. He doesn't even get to have time to put his fucking luggage down, you tell him to haul his ass here.”</p>\n<p>Jimin frowns. “Why?”</p>\n<p>“Because I'm getting you out of there.”</p>\n<p> </p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p> </p>\n<p>“What if it doesn't work?”</p>\n<p>Yoongi sighs, rubbing his temples. “What if you stop repeating that, Hoseok?”</p>\n<p>Hoseok rolls his eyes and sits heavily on the couch. “I'm worried.”</p>\n<p>“We all are.” Jin says “But it will work.”</p>\n<p>“And hey, if it doesn't work-” Jungkook smiles “We just fucking kill him and then get the fuck out of the country real quick.”</p>\n<p>“Not entirely a bad plan.” Taehyung concedes, propping his chin on Jungkook's shoulder.</p>\n<p>“It's a shit plan.” Namjoon sighs “But we ain't gonna need it.”</p>\n<p>“I sure fucking hope so.” Yoongi mutters as he lights up the nth cigarette of the day “They're late. You said his plane landed three hours ago.”</p>\n<p>“He's probably gonna make us wait, the pretentious shit.” Namjoon massages his neck “But he'll come. Trust me, he loves challenges.”</p>\n<p>Seokjin takes a deep breath. “If it doesn't work we kill him for real.”</p>\n<p>Yoongi arches an eyebrow. “Are you shitting me?”</p>\n<p>“No.”</p>\n<p>“Fine by me.” Jungkook says and before Yoongi can remind him that he's a fucking kid and he should just shut up when it comes to murder, the intercom buzzes.</p>\n<p>Namjoon takes a deep breath and walks to it, pressing the button to answer. “What?”</p>\n<p>“Gao and his man are here to see mister Min.” the metallic voice says.</p>\n<p>“Let them in.” Namjoon turns around “It's time people.”</p>\n<p>Waiting seems like a torture, the minutes feel like hours but finally there's a knock on the door.</p>\n<p>Hoseok stands up from the sofa and walks to stand just behind Yoongi, so does Seokjin. Taehyung and Jungkook stand where they are, next to each other, and Namjoon opens the door.</p>\n<p>Gao walks in with a smug smile on his face and his arm around Jimin's waist.</p>\n<p>The old man sends a glance at Namjoon as he closes the door behind them. “Min. You invite us over and you don't even open the door for us? What happened to your mann-”</p>\n<p>“Hello, Jimin.” Yoongi says, interrupting Gao.</p>\n<p>Jimin's eyes widen at the use of his real name, but he still clears his voice “Hello, Yoongi.”</p>\n<p>“Gao.” Yoongi makes a gesture at him to come over as he sits behind the desk “Both of you, come sit.”</p>\n<p>“You've got the whole gang, I see.” Gao says as he walks over to Yoongi, dragging Jimin with him.</p>\n<p>They both sit down on the two leather chairs set in front of the desk, Jimin sending questions with his eyes to Yoongi.</p>\n<p>Yoongi takes a drag of his cigarette, blowing the smoke in Gao's direction.</p>\n<p>“How are you doing, Jimin?”</p>\n<p>Gao's mouth twitches, but he says nothing.</p>\n<p>“I'm-” Jimin gulps “I'm good, thank you.”</p>\n<p>Gao's hand goes to the nape of Jimin's neck, squeezing it, Jimin clenches his jaw.</p>\n<p>“And Gao, tell me, how was your trip?” Yoongi asks, he sees Namjoon settling behind Gao “Hong Kong, right?”</p>\n<p>“It was a good trip. Business.”</p>\n<p>“Ah, yes. Your deal. Is it going well?”</p>\n<p>“It is.”</p>\n<p>Yoongi hums. “Why are you trying to bullshit me, Gao?”</p>\n<p>The man says nothing for a while, sending quick looks at the two men behind Yoongi and then he starts looking around.</p>\n<p>“I'm confused as to what you want, Min.” he spots Taehyung and he smirks “Oh. Don't I know you?”</p>\n<p>Taehyung arches an eyebrow.</p>\n<p>“You're a pretty little thing, hard to forget.” Gao licks his lips “I'm pretty sure I tried to buy you. I saw you changed your job.”</p>\n<p>“I did.” Taehyung replies.</p>\n<p>“Not for sale anymore?”</p>\n<p>“He isn't.” Jungkook says, voice dangerously low, and Gao laughs.</p>\n<p>“Look at that child, he found himself a sex doll.” Gao's grip on Jimin's neck tightens and the boy's face twists in pain “Aren't they the best?”</p>\n<p>Jungkook stiffens but doesn't make any move, he's smarter than that.</p>\n<p>“How about we get down to business, Min.” the man turns to Yoongi “Why the fuck am I here?”</p>\n<p>“It's simple, really.” Yoongi raises a hand and Seokjin moves, taking from the drawer of the desk a paper and handing it over Gao, who starts scanning it with a frown.</p>\n<p>“The fuck is this?”</p>\n<p>“Can't you read?” Yoongi asks “That's a contract.”</p>\n<p>“I can see that. What for?”</p>\n<p>Yoongi tilts his chin to Jimin “For him.”</p>\n<p>Silence falls in the room, Gao reads the contract with more attention and Yoongi glances at Jimin, the boy staring at him confused.</p>\n<p>“What does this mean?” Gao asks, setting his eyes on Yoongi.</p>\n<p>“I'm buying him. From you.”</p>\n<p>“Buying him.”</p>\n<p>“Isn't that what you did? I'm new to the business. I'm putting him under my contract. You'll sign that piece of paper and hand Jimin over.” Yoongi smiles “I'll pay you, of course.”</p>\n<p>Gao drops the paper on the desk with dismay. “Ain't gonna happen. Really, Min, if you wanna fuck him that much just say so.”</p>\n<p>“Tell me about your deal, Gao. Why isn't it going well?”</p>\n<p>“My deal is going great.”</p>\n<p>“Is it because you tried selling them cheap ass weapons saying that it was actually the good stuff?” Yoongi clicks his tongue “That's a shitty move.”</p>\n<p>Gao squints his eyes. “You think you can win because of this? Seriously, Min, do you even know who I am?”</p>\n<p>“I ain't winning with that.” Yoongi glances at Hoseok and the man takes out of the breast pocket of his jacket an envelope, dropping it in front of Gao “I'm winning with this.”</p>\n<p>Gao levels his gaze for a few moments before he lets go of Jimin's neck and takes the envelope in his hands, opening it and frowning at the content. Then his expression shifts to recognition and all the color drains from his face.</p>\n<p>“How-”</p>\n<p>“You really should stop taking pictures of the people you fuck.” Yoongi says “Especially if you shot one in the head. And more especially if the other one is a child.”</p>\n<p>Gao glares at him.</p>\n<p>“What's her name again?” Yoongi asks Namjoon “Vanida?”</p>\n<p>“Vanida.” Namjoon confirms.</p>\n<p>“Twelve years old.” Yoongi shakes his head “That's not really good, Gao.”</p>\n<p>“You fucking-”</p>\n<p>“I heard that the market for Thai children is hot right now. Damn, Gao, I knew you liked them young, but child prostitution?” Yoongi grimaces “That's just fucking nasty.”</p>\n<p>“How-”</p>\n<p>“Just as nasty as using a gun to fuck someone unwillingly.”</p>\n<p>“Tell me how-”</p>\n<p>“Loyalty is important in our business, Gao.” Yoongi sits more comfortably on his chair “Loyalty is all we have. I have loyal men, as you can see. You? Not so much. See, that's the problem with using drugs to keep your men on your side. There's always a druglord somewhere who can give them more.”</p>\n<p>“What are you gonna do, uh?!” Gao exclaims “Go to the police?! I own those fucking pigs.”</p>\n<p>“I wonder if you're still going to own a few corrupt policemen when an anonimous men drops these photos to them. I mean, you're in the photos Gao. Your face is there. You're fucking dumb, seriously, and also just plain sick.” Yoongi shrugs “So, how about we sign that contrack and get this over with?”</p>\n<p>“Fuck you, Min. You just got yourself in neck-deep shit.” Gao grabs Jimin by the arm and stands up.</p>\n<p>Yoongi stands up as well and slams his hand on the table hard enough to make Jimin jump.</p>\n<p>“Sit the fuck down, you sick fat cunt.” Yoongi hisses “I'm not fucking done.”</p>\n<p>Jungkook smoothly moves the hem of his jacket to the side, showing the gun in his belt and Gao stops moving.</p>\n<p>“See, plan B is just straight up killing you and, honestly, I like this carpet.” Yoongi sits back on the chair “So how about you get your fat ass on that chair?”</p>\n<p>Seconds go by and no one moves, Jimin has his gaze trained on Yoongi, the tension clear in his stiff expression. Finally, Gao sits down and so does Jimin as he's dragged down on the chair.</p>\n<p>“Here's the deal.” Yoongi sighs “You sign the contract, you get the money, I get Jimin, we part ways and we part ways for good. No more drugs from me. And you don't make a fucking move, Gao, 'cause I got so many copies of those photos I could just open an art gallery.”</p>\n<p>Gao is breathing hard now, somehow his hand is once again on Jimin's neck and Yoongi's getting tired of it really quickly.</p>\n<p>“If you kill me my men will be cutting your throat before you even realize you're dead.” Gao hisses.</p>\n<p>“You mean the same men who sold you for morphine and speedball?” Yoongi rolls his eyes “I'm fucking pissing my pants, Gao. Don't you get it? You got nothing on me but I got everything on you.”</p>\n<p>Gao opens his mouth to speak but stays quiet when he hears Jimin muttering something under his breath.</p>\n<p>“What?” Gao asks “You got something to say, you fucking slut? If it weren't for your greedy ass we wouldn't be here, you know? Oh, you just couldn't help wanting his cock up your-”</p>\n<p>“-me.” Jimin whispers, eyes set on Yoongi.</p>\n<p>“Speak louder, you pathetic-”</p>\n<p>“Let go of me.” Jimin says, voice clear and steady, as he turns to look at Gao “Get your fucking hands off me. Was that loud enough?”</p>\n<p>Gao's face screws up in anger and he moves. The slap on Jimin's face echoes in the room and is hard enough to have the boy falling off the chair and on the floor.</p>\n<p>Jungkook's gun is out in a moment, so is Hoseok's but is Namjoon who gets his hands on Gao. He gets the rope he had been keeping in the pocket of his jacket out and quickly puts it around Gao's neck, pulling at it until the men is choking and twisting in his chair.</p>\n<p>“Now, that-” Yoongi stands up “That was a dumb fucking move, Gao.”</p>\n<p>Taehyung is at Jimin's side, helping him up. Namjoon lets go slightly of the rope and Gao starts breathing again, coughing.</p>\n<p>“I know you like choking people with ropes until they pass out.” Yoongi goes around the desk until he's standing in front of Gao “That doesn't sound pleasant. Shall we try? Or maybe you feel like signing the contract?”</p>\n<p>Gao spits at his feet. “Fuck you you goddamn-”.</p>\n<p>His words are cut short as Namjoon pulls the hems of the rope again.</p>\n<p>“It's not such a bad deal, I don't see where the problem is.” Yoongi stirs his neck “You walk out of here with no police biting your ass and everyone's happy. Hell, you even walk out of here with your cock still attached to your body, which is something considering how much Jungkook wants to cut it off. He's a reckless one, you know. Can't seem to control him. Are you fainting on me?”</p>\n<p>Namjoon rolls his eyes and again he looses the rope. “He's got a shitty stamina.”</p>\n<p>“Trust me, I know.” Jimin mutters and Taehyung snorts.</p>\n<p>Gao, chest heaving and eyes bloodshot, stares at Yoongi.</p>\n<p>“You made up your mind, yet? 'Cause I got time, you know? Hell, I could ask Jimin if he wants to take a round, I'm sure he'd love choking you until you pass out. Or beating the shit out of you. Or drugging you.” Yoongi raises his eyebrows “That's actually not a bad idea. I mean, I got drugs. What's your favorite? Coke? We can make you overdose on that shit.”</p>\n<p>“-ing.”</p>\n<p>Yoongi frowns. “I'm sorry, what was that? Speak louder, you pathetic cunt.”</p>\n<p>“I'm-” Gao gulps “I'm signing.”</p>\n<p>“What wonderful news.” Seokjin says with a bright smile, already moving towards Gao with a fountain pen in his hand “I truly dislike violence, I'm more of a business man. Here.” He holds the pen to Gao as the man sizes him up, fingers twitching.</p>\n<p>Namjoon quickly tugs at the rope. “You even think about laying a fucking finger on him, this rope is gonna be the last of your problems.”</p>\n<p>Just like that, Gao takes the pen and Jin's smile only widens.</p>\n<p>“Sign here.” he says, pointing at the paper “And here. Last one, here. Very well.” Jin takes the contract and smiles at Jungkook “Looks like his cock stays attached to his body, I'm afraid.”</p>\n<p>“What a shame.” the boy says.</p>\n<p>Jin hums, moving again behind the desk and taking from underneath it a suitcase. He walks back to Gao and drops it unceremoniously at his feet.</p>\n<p>“I'm gonna take a wild guess and say that the money in there is far more than the money you gave Jimin.” Yoongi says “That wasn't too hard, was it?”</p>\n<p>Gao glares at Yoongi but doesn't say anything.</p>\n<p>“You can leave now.” Yoongi waves a hand dismissevely “Unless someone has something to say. Jimin?”</p>\n<p>Jimin looks at Gao with his lips curled down in disgust.</p>\n<p>“Got nothing to say to someone who's got a tiny dick and doesn't know how to use it.”</p>\n<p>Yoongi smirks.</p>\n<p>“Actually, I have something to say.” Hoseok clears his voice “Your accent is fucking shit.”</p>\n<p>“I'll escort him outside.” Jin says “Joons, you're coming with me? Don't really feel like walking the garbage alone.”</p>\n<p>Namjoon grips Gao's neck and drags him up from the chair, pushing him to the door and finally they exit the room.</p>\n<p>A tense silence follows, where no one dares to move, until Hoseok claps his hands together making everyone jump. “Well this was fun.”</p>\n<p>“Hilarious, truly.” Taehyung mutters.</p>\n<p>“How about we get out of here, uh?” Hoseok claps on Yoongi's shoulder as he moves past “Let's give the lovebirds some alone time.”</p>\n<p>Taehyung leaves a sloppy kiss on Jimin's cheek and he holds his hand out to Jungkook, who grabs it and kisses the palm with a smile on his face. “I really wanted to cut his cock off.”</p>\n<p>“Next time, babe.”</p>\n<p>They leave the penthouse, leaving Jimin and Yoongi alone.</p>\n<p>“You okay?” Yoongi asks, taking the contract in his hands and looking at it.</p>\n<p>“Yeah, I'm-” Jimin takes a deep breath “God, you guys are fucking crazy.”</p>\n<p>Yoongi hums.</p>\n<p>“So what happens next? I mean, Gao could still come back, he's not gonna let this slide and-”</p>\n<p>“You think we didn't take precautions?” Yoongi interrupts him “We already sent the pictures to the police, there's gonna be a raid at his house soon. Fucker thinks he has his ass covered because he can shut close the mouths of a handful of policemen. I basically own the fucking establishment and he thinks he has the upper hand.”</p>\n<p>“The contract.”</p>\n<p>Yoongi looks at Jimin for a few seconds before he rips the piece of paper in shreds. “What contract?”</p>\n<p>Jimin frowns. “I don't understand.”</p>\n<p>“I'm not him, I'm not gonna own you. I just had to make Gao's contract useless, and I did. So no more contracts. I gave you the thing you wanted the most. You're free.” Yoongi leans on the desk “What do you want to do with your freedom?”</p>\n<p>Jimin, still shaken up by the events, stutters for a while before he manages to speak. “I want to dye my hair.”</p>\n<p>Yoongi knits his eyebrows. “You want to do what?”</p>\n<p>“I hate this fucking color. He's the one who chose it for me, I can't fucking stand it.”</p>\n<p>Yoongi nods. “Okay, what else?”</p>\n<p>“I want to eat a burger. The fucker didn't let me.”</p>\n<p>“What else?”</p>\n<p>“I want to see Daegu.”</p>\n<p>Yoongi smiles. “What else?”</p>\n<p>“I want to go to Busan. And to Japan. And I want to show you Detroit in september.”</p>\n<p>“What else?”</p>\n<p>“I- I want to be free with you.” Jimin trains his gaze on Yoongi “If you want me to.”</p>\n<p>“Thought that was obvious.” Yoongi grumbles and Jimin giggles, tension slowly easing away.</p>\n<p>“Is it over?” he asks “Like, for real?”</p>\n<p>“I mean, it's better if we go away for a while. A long while.” Yoongi nods “But it's over.”</p>\n<p>“I won't have to go back there?”</p>\n<p>“Never again.”</p>\n<p> </p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p> </p>\n<p>“Who knew that destroying an empire was going to be so easy?”</p>\n<p>Yoongi hums, taking a sip of his coffee from the the paper cup and he puts the phone to his right ear. “Well, Gao made a poor fucking excuse of an empire since it went done so quickly.”</p>\n<p>On the other side of the phone, Namjoon laughs at this. “Yeah, well, that happens when you're charged with murder, illegal smuggling of weapons and underage prostitution.”</p>\n<p>“Told you he was gonna leave tracks.”</p>\n<p>“You did.” Yoongi hears the sound of sheets shuffling so he guesses Namjoon is in bed “Where are you two?”</p>\n<p>“We arrived in Busan a few hours ago.” Yoongi sighs “It's so fucking cold, Joons.”</p>\n<p>“Jimin's with you?”</p>\n<p>“Buying some sickeningly sweet drink for himself.” he replies “We're going to see the beach, then all those things tourists see. I'm already tired.”</p>\n<p>“You're so fake, I know you're actually loving it.”</p>\n<p>Yoongi makes a noise at that, but he doesn't deny it. “Everything's okay there, yeah?”</p>\n<p>“You left everything in good hands, Yoons. Don't worry about it.” Namjoon chuckles “Jin complains a lot because now he has more work to do, but that's what Jin does. Tae and Jungkook are as gross as ever and I feel like Jungkook is turning more and more into a psycopath.”</p>\n<p>“Hasn't he always been?”</p>\n<p>“Hoseok is having the time of his life, as usual. So, really, don't worry about us and just enjoy your trip. What's after Busan?”</p>\n<p>“Daegu.”</p>\n<p>“Home sweet home.”</p>\n<p>“I guess. Then it's Japan, then I don't even know. I guess I'll just take him wherever he wants. He keeps mentioning Detroit, so I guess there's that.” Yoongi sends a glance at the coffee shop and he sees that Jimin is finishing paying for his drink “I gotta go now, but you keep me updated.”</p>\n<p>“Sure. Say hi to Jimin for me.”</p>\n<p>“Will do.” Yoongi ends the call and Jimin comes out of the shop, pulling back his black hair from his face and smiling brightly at Yoongi.</p>\n<p>“What's up with you, grumpy?”</p>\n<p>“'s cold.” Yoongi mutters, reaching for Jimin's hand and holding it “Too fucking cold.”</p>\n<p>“It's not that bad.”</p>\n<p>“Right.”</p>\n<p>“Damn, you're sour as fuck today.”</p>\n<p>“Shush.”</p>\n<p>“You're lucky I like sour food.”</p>\n<p>“Jimin.”</p>\n<p>“Let's go to the beach, yeah?” the boy says as he starts walking down the street, dragging Yoongi with him “I really want to see it again, if it's as pretty as I remember.”</p>\n<p>Yoongi holds up his scarf until it covers almost half of his face. “It's gonna be even colder there.”</p>\n<p>Jimin decides to ignore him as he happily walks, looking around and commenting the pretty scenery, the gardens they pass by and almost everything he sets his eyes on.</p>\n<p>Yoongi walks behind him, smiling under the scarf, loving the color on Jimin's cheeks and the way his nose reddened from the cold air, black hair framing messily his face.</p>\n<p> </p>\n<p>\n<em>Why black though?</em>\n</p>\n<p>\n<em>Because that way we match, Yoongi.</em>\n</p>\n<p>\n<em>What the actual-</em>\n</p>\n<p>\n<em>It's cute, Yoongi.</em>\n</p>\n<p> </p>\n<p>They reach the beach after an hour of walking around, there's only a few people strolling down the shore, some kids running excitedely with their feet bare on the damp sand.</p>\n<p>“It's beautiful.” Jimin says smiling and Yoongi nods.</p>\n<p>“Yeah, I remember coming here in summer once with my family. It's still beautiful.”</p>\n<p>“Will we meet your family in Daegu?”</p>\n<p>Yoongi snorts. “Yeah, right. Hey parents, I know I've been missing for almost a decade and you probably thought I was dead but hey, I'm still kicking and guess what? I have a boyfriend, he used to be a prostitute and a porn star and then an high class sugar baby. Then I bought him from a sadistic motherfucker. Oh, and I'm a druglord, it's good to have the whole gang back.” he shakes his head “Don't think it's the kind of reunion they want.”</p>\n<p>Jimin hums and props his chin on Yoongi's shoulder, snaking his arms around the man's waist. “Oh, shit, you really are cold.”</p>\n<p>“What, you thought I was faking it?”</p>\n<p>Jimin shrugs. “Thought that maybe you just wanted an excuse to get back to the hotel.”</p>\n<p>Yoongi tilts his head to get a look on Jimin's face. “Why would I do that?”</p>\n<p>The boy wiggles his eyebrows and Yoongi rolls his eyes. “<em>Yah</em>.”</p>\n<p>Jimin giggles. “I like it when you say it. <em>Yah</em>. It's a funny word. You should teach me more korean, <em>hyung</em>.”</p>\n<p>“I regret teaching you even a single word.”</p>\n<p>“'s that so, <em>oppa</em>?”</p>\n<p>“I swear to god, Park Jimin.”</p>\n<p>Jimin laughs and he leaves a kiss on Yoongi's cheek, holding him a little stronger and nuzzling his hair.</p>\n<p>They stay quiet, eyes set on the sea before Jimin chuckles again.</p>\n<p>“What now?”</p>\n<p>“Nothing.” Jimin sighs “I'm just getting used to happiness.”</p>\n<p>Yoongi hums and he intertwines his fingers with Jimin's. “Feels good, uh?”</p>\n<p>“Feels fucking amazing.”</p>\n<p><br>\n<br>\n </p>"
}