{
  "id": "10554512",
  "url": "https://archiveofourown.org/works/10554512?view_full_work=true",
  "author": [
    "DanaiaCake"
  ],
  "title": "Oikawa's Last Wish/es",
  "rating": "General Audiences",
  "archive_warnings": [
    "Major Character Death"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Haikyuu!!"
  ],
  "relationships": [
    "Iwaizumi Hajime/Oikawa Tooru",
    "Hanamaki Takahiro/Matsukawa Issei"
  ],
  "characters": [
    "Iwaizumi Hajime",
    "Oikawa Tooru",
    "Hanamaki Takahiro",
    "Matsukawa Issei",
    "Yahaba Shigeru",
    "Kyoutani Kentarou",
    "Watari Shinji",
    "Kindaichi Yuutarou",
    "Kunimi Akira",
    "Original Characters"
  ],
  "additional_tags": [
    "angst with fluff",
    "Fluff and Angst",
    "Slow Burn",
    "This will hurt",
    "Sorry Not Sorry",
    "Wishes",
    "Love Confessions",
    "iwaoi - Freeform",
    "Sickness",
    "Sad",
    "Sadsadsadsad",
    "You Have Been Warned",
    "Not Beta Read",
    "I didn't even read this because it hurts me"
  ],
  "language": "English",
  "series": "Part 5 of DanaiaCake’s Haikyuu Angst Fics",
  "published": "2017-04-06",
  "completed": null,
  "words": "5,152",
  "chapters": "1/1",
  "comments": "620",
  "kudos": "10,936",
  "bookmarks": "2,432",
  "hits": "402,378",
  "summary": "<p>“Just fucking choose.” Iwaizumi was trying to control his voice but it was getting harder every passing moment. Especially when his best friend was being extremely difficult.</p>\n<p>“Hmn… how about cuddling with hundreds of kittens?” Oikawa mused pursing his dry lips.</p>",
  "notes": "<p>I wrote this for a whole week. I really just wanted to write some angst. Am I weird that I want to write something 'angsty'? Anyway please do \"enjoy\"!</p>\n<p>Comments and kudos are very much appreciated. &lt;3</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Send some love or a shoutout at Twitter! :)</p>\n<p> <a href=\"https://twitter.com/danaiacake\" rel=\"nofollow\">\n<b>Follow me on Twitter @DanaiaCake</b>\n</a></p>\n<p>EDIT: I wrote a sequel to this. You may check it out here: <a href=\"https://archiveofourown.org/works/26793448\" rel=\"nofollow\"><strong>One Way Ticket to Heaven</strong></a></p>",
  "text": "<p>“Just <em> fucking </em> choose.” Iwaizumi was trying to control his voice but it was getting harder every passing moment. <em> Especially when his best friend was being extremely difficult. </em></p>\n<p>Oikawa, in real Oikawa fashion, just rolled his eyes slowly before releasing a raspy breath, “Mean, Iwa-chan. This was your idea! You should be patient with me!”</p>\n<p>“I’m actually regretting it now.” Iwaizumi huffed already thinking about scrapping the entire idea he saw in TV last night which he thought was pretty brilliant, completely forgetting that Oikawa could really be a diva.</p>\n<p>“Hmn… how about cuddling with hundreds of kittens?” Oikawa mused pursing his dry lips. Iwaizumi glared at him, “Cats? Did Kuroo rub off on you that much?” Too late to see that lopsided grin on Oikawa’s face to know that he was just kidding.</p>\n<p>Iwaizumi grunted, “I’m seriously going to choke you.” Oikawa, however, just gave a raspy laugh before he picked up his fork to continue eating his fruits. Iwaizumi wanted an answer, but didn’t want to stop Oikawa from eating especially when this was the first time he had seen him this lively… probably at the prospect of having his wish granted.</p>\n<p>“How about a whole day of alien movies and pizza and popcorn?” He hums, taking a spoonful of plain yogurt from the plastic container beside his half-empty plate. He always heard about looking at a glass half-full instead of half-empty, but right now, half-empty seemed better because it meant Oikawa was distracted enough to eat something.</p>\n<p>He snorted, “That is a lousy wish.”</p>\n<p>Oikawa pouted, “Hey! It’s not! Spending a day watching alien movies would be amazing…”</p>\n<p>“<em> Tooru. </em>” Iwaizumi’s voice was low and calm but it made Oikawa raise his eyes to look up at him. There were few occasions that Iwaizumi called him by his name, and when he does, it always made Oikawa’s flutter a bit.</p>\n<p>“Be serious.” Iwaizumi continued, “You <em> wouldn’t </em>spend your wish to get that. Ask anything else. Not something we could do anytime, anyday.”</p>\n<p>Oikawa blinked at him… but Iwaizumi watched as those brown eyes became somber and lost their enthusiastic spark. He watched those eyes look down at the tray of food on his lap, wheeled by the nurse that morning. He watched as the feeble hands holding the plastic utensil shake a little, before he regained control once again of himself and gave the saddest, most beautiful smile Iwaizumi had ever seen. Then he, in a small very innocent voice said, “I want to play volleyball with our old teammates… in our highschool court.”</p>\n<p><em> There it was </em> . Iwaizumi somehow knew that was what he really wanted. He didn’t know if he wanted Oikawa to tell him because he knew he wouldn’t be able to give it to him… even if he wanted to. Even if he called up their old teammates who already have lives of their own, but would surely drop everything and go back to Miyagi just to do this single thing for their old captain. They would do it, no doubt about it. And even if in the off chance that they wouldn’t, <em> he </em> would still do it.</p>\n<p><em> But the doctors wouldn’t allow it. </em> Not when Oikawa’s condition for the past few weeks was getting worse. Not when no amount of medicine could counter the cancer cells spreading on his lungs that every waking moment felt too quick like Oikawa’s short breaths… lost easily.</p>\n<p>It was how it is now, anyway… and Iwaizumi as his best friend had lived through it with him… through the good days and bad days. This was one of the good days and Iwaizumi was thankful that he and Oikawa was having an almost normal, albeit annoying conversation with the latter actually eating.</p>\n<p>He would take this anytime from those days when Oikawa was always in too much constant pain, when he described breathing as drowning in air… every gulp always coming short, every single oxygen felt like he was being stabbed in the chest repeatedly and Oikawa would hold it in. Whiny little baby that he is, Oikawa would refuse to rate the pain as a <em> 10 </em>, because he was sure something more painful would come and he was just preparing for that.</p>\n<p>Those days when Iwaizumi was torn between running out of the hospital room, go back home, curl up in bed and forget the look of despair in Oikawa’s face. But he would always, stupidly choose the other option which was to stay by Oikawa’s side. Stand quietly by the bedside table, just within reach… but would never reach out. Oikawa would always look up at him and every time he did, Iwaizumi always dreaded that that was the last time those brown eyes were ever going to look at him.</p>\n<p>“I’d take you.” He said, not a single doubt in his voice, “Once you get out of the hospital. I’ll call Mattsun and Makki. Heck, I’ll even call our kouhais. It’ll be a mini reunion.”</p>\n<p>Oikawa looked up at him with bleary eyes, disbelieving, before his face blossomed into an ear-splitting grin, “We can have a practice match.”</p>\n<p>Iwaizumi didn’t realize that he was smiling, too… but only because it had been a very long time since he saw Oikawa’s smile.</p>\n<p>They stay quietly like that until a nurse came in to deliver some medicine and take away the tray of food. She has a soft voice and gentle face… and if Iwaizumi was being honest, looked kind of cute. She was a bit shy but her movements were graceful, and she gave a polite smile at Iwaizumi before she left.</p>\n<p>Oikawa was looking curiously at him when his eyes just as much as trailed off on the nurse’s direction. He frowned when he saw the glint on the setter’s eyes, “What?”</p>\n<p>“You’re checking out my nurse.” Oikawa chuckled, shaking his head, “You’re too obvious, Iwa-chan.”</p>\n<p>“Huh? What are you saying Shittykawa?” He hissed, annoyed at the face the other guy was making.</p>\n<p>Oikawa rolled his eyes, “Come on. Aiko-chan is pretty. I wouldn’t be surprised you find him really cute.”</p>\n<p>“What the fuck?! Shut up or I’ll punch you.I don’t care if you’re sick.” Iwaizumi snapped again, looking away and seeing his reflection in the window. And <em> goddammit </em>but he was blushing.</p>\n<p>Oikawa pouted, “Mean Iwa-chan!” But he was laughing, definitely enjoying this, “You should ask her out.”</p>\n<p>“I swear to god, Oikawa… if you don’t--”</p>\n<p>“You waste half of your days in the hospital, anyways. What’s wrong with finding a little, cute lovelife while you’re at it?” The suggestion was pretty innocent and really positive, and yet Oikawa looked like he just signed a death sentence.</p>\n<p>Iwaizumi moved to sit on Oikawa’s bed but he was careful not to touch him, “Is that what you really want?”</p>\n<p>Oikawa shrugged but didn’t say anything… still refusing to look at him.</p>\n<p>“<em> Tooru.” </em> He said and Oikawa’s head quipped up, his brown eyes meeting Iwaizumi’s hazel eyes. Iwaizumi thought how green and brown always looked good together… <em> like branch and leaves, soil and grass… </em>it was always natural to find green whenever you see brown.</p>\n<p>“Maybe.” Oikawa said softly and for some unknown reason, Iwaizumi’s heart sank. He, of course didn’t know why because neither of them had ever put any other label in what’s between them… save for being <em> best friends </em>. But they also knew it was more than that.</p>\n<p>They knew it ever since high school. Knew that best friends don’t stick to each other that much, best friends don’t miss each other too much and call each other everyday during college. Best friends don’t walk you home, don’t walk you to your station… or ride the bus at three in the morning, in the middle of a thunderstorm, with high fever to just see you… because <em>he misses you. Best friends don’t hold hands and they definitely… almost certainly never kiss while in a drunken stupor.</em></p>\n<p>Iwaizumi sighed, looking up at the ceiling when his eyes passed by the clock on the wall and he realized he had to go to work. He groaned softly, “I have to go to work.”</p>\n<p>Oikawa turned to him, that same look of despair in his eyes telling Iwaizumi <em>don’t go</em> <em>because I need you here</em>, but of course, he would not say it and would cover it up with a smile and a <em>“Okay. I’ll see you tomorrow. Take care.” </em> Except today, he just said, “Okay.”</p>\n<p>Iwaizumi hated it. He was distancing himself again even when he knows he couldn’t run away from Iwaizumi. So he did what any sane person would do at that moment--he grabbed Oikawa’s face and forced him to look at him, “I’ll see you tomorrow, okay?”</p>\n<p>Oikawa looked at him painfully for a moment before he smiled and nodded, “Alright. Goodbye, Iwa-chan.”</p>\n<p>...<em> But </em> the next morning, Oikawa’s doctor and nurses advised Iwaizumi not to visit that day. “ <em> It’s a bad day.” </em> They said, “ <em> Only family is allowed.” </em>He had finally rated a level 10 pain last night because of an infection and he was depressed because his hair started falling out because of the new medicine they gave him. Iwaizumi knew how much his insufferable best friend loved his hair.</p>\n<p>Still, he had to see him. So he stood by Oikawa’s door, watching the guy lying down on his bed, ventilator in place, staring up blankly at the ceiling. He was careful not to be seen… but at the same time, desperate too. He wanted Oikawa to know he was there… that he wouldn’t just go because it was one of the <em> bad days </em>. So when his nurse, Aiko came up to him to ask why he was still around, he asked for a piece of paper, scribbled something on it and asked her to pass it to Oikawa if she can.</p>\n<p>Aiko, was happy to oblige, slipping the note in her pocket before she entered Oikawa’s room. Iwaizumi left.</p>\n<p>\n<b> <em>You still owe me a wish, Shittykawa. </em> </b>\n</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>For the next three days, Iwaizumi stood by the door, watching Oikawa. For the next three days, he’ll desperately wish Oikawa would just as much as turn to him… but all the machines connected in his body wasn’t allowing him to.</p>\n<p>Besides, with all the drugs being pumped in his body, he had to be so weak to even lift a finger.</p>\n<p>On the fourth day, at the lobby of the hospital, Iwaizumi saw Aiko who once again gave him a polite smile. He nodded at her, saying a quiet <em> ‘Good morning.’ </em>And was about to leave when she called him up.</p>\n<p>“Ano… Iwaizumi-san.”</p>\n<p>He stopped in his tracks and looked back. This was the first time Aiko had called him. He didn’t even know she knew his name. She came up to him, face red and so shy, “Umm… can we talk for a bit?”</p>\n<p>Iwaizumi merely stared at him for a few moments before he snapped back in reality and nodded, “Uh, sure.”</p>\n<p>They went to the hospital garden which didn’t have so many people. Just a few patients out on their morning stroll. Iwaizumi used to take Oikawa out here when he’s feeling better but that was a few months ago.</p>\n<p>Aiko chose a small, slightly isolated bench far away from where they entered. She sat nervously on the bench as Iwaizumi stood a few feet away from her, hands in his pocket.</p>\n<p>“I… I’m sorry about this.” Aiko started looking down at her fingers, “I just… I just want you to know… how I...well, really, how all of other nurses think your… love for Oikawa-san is admirable and brave.”</p>\n<p><em> Okay, he didn’t expect that </em>. He blinked at Aiko who was looking at him now, a small smile on her lips. “Love?” He asked and she frowned a bit.</p>\n<p>“Yes. You <em> are </em> in love with him, aren’t you?” She asked, “I mean… you never missed a day without seeing him. Even if you couldn’t.”</p>\n<p>“I don’t…” He paused and shook his head. <em> Love? Was he in love with Oikawa? That bratty little kid? That insufferable, annoying guy? </em>He didn’t know what to say… he just stared at Aiko, as these realizations hit him and he felt like he was drowning.</p>\n<p>Somehow, the expression he was making worried Aiko, “Wait, so you and Oikawa-san are not…”</p>\n<p>“We’re…” he hesitated but said “I’m...”</p>\n<p>Aiko’s eyes widened when she realized her mistake, “I am sorry. I just thought that when Oikawa-san told me before he loves you so much that you two would be…”</p>\n<p>“Wait, what?”</p>\n<p>“Eh?”</p>\n<p>“What did Oikawa tell you?”</p>\n<p>She frowned, not really understanding, “...that he loves you? Surely, you knew.”</p>\n<p>He felt his face heat up… and he looked away, embarrassed. He stared up at the hospital building right in front of them as Aiko rambled on. He was searching for a particular window… one where he and Oikawa would spend countless of hours looking out at people in the garden. Oikawa would blanche at the romance of it all, watching sick people talk with their loved ones. Iwaizumi mostly considered it plain creepy.</p>\n<p>That was when Oikawa was strong enough to get up from bed. When he wasn’t confined in the hospital bed with dozens of machines whirring him awake all the time.</p>\n<p>Iwaizumi didn’t know when Aiko stopped talking, but she eventually did. And when she nudged his arm, he bit back a surprised remark. “Iwaizumi-san? Are you okay?”</p>\n<p>“Uh… yeah.”</p>\n<p>Aiko smiled, “Good. I’m sure Oikawa-san would be happy to see you today.”</p>\n<p>“I can see him today?”</p>\n<p>“Yeah. We just took him out of the ventilator last night. He’s still weak… but he’s awake.”</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>Oikawa looked frail and weak… but beautiful. He always had been. In strength and in weakness, Iwaizumi acknowledged that he had always made it beautiful, even when he never told him so.</p>\n<p>He stopped by the door, unsure if he should walk in because Oikawa was sitting on his bed, back slumped, hands listlessly placed in front of him, head turned towards the window. He was paler and thinner than the first time he remembered him sitting on his hospital bed.</p>\n<p>They were in college, Oikawa went home for summer while Iwaizumi stayed in Tokyo for his summer internship when he received a call from Mattsun who also went home that summer. Oikawa collapsed and was taken to the hospital.</p>\n<p>He took the next bus to Miyagi as soon as he heard… only to find Oikawa sitting on the bed, grinning at him and teasing that he <em> worries too much. </em></p>\n<p>He slowly pushed the door open but Oikawa didn’t budge--too lost in his thoughts to notice him enter. He didn’t say anything and just stood there in silence, observing him.</p>\n<p>He looked smaller now, he was sure that if they stood side by side, he would be taller than him. His brown hair was mussed up and his heart ached because Oikawa cared so much about his hair that even on bad days, he made sure his hair was perfect. His hands were dry and bony and pale… just like the rest of him is. But in between those fingers, a slightly crumpled note was held.</p>\n<p>His heart just flip-flopped and his brain stopped functioning and the fear that he almost lost him suddenly became too real.</p>\n<p>He opened his mouth to call his name and get his attention. But what was supposed to be a <em> ‘Oi Shittykawa’ </em> suddenly became… “I love you.”</p>\n<p>A sudden gasp. Then wide brown eyes turned to him again. “Iwa-chan?” His name slipped out of those dry, cracked lips… and in two huge steps, Iwaizumi grabbed Oikawa’s hand and pulled him close to his chest in a tight and awkward embrace.</p>\n<p>He breathed in his scent… a mixture of disinfectant, a collection of drugs and the sweet smell of <em> just Oikawa </em> . He filled his lungs with this addictive scent and when he thought he couldn’t get enough, he felt the other guy melt into him.<br><br></p>\n<p>Hands circled his back, slowly and weakly… face burying at the crook of his neck. When he felt a wetness on his shoulder, he realized Oikawa was crying. In panic, he pulled away, holding him at arm's length, “What’s wrong? Does it hurt anywhere?”</p>\n<p>Oikawa shook his head, hands covering half his face as tears and snot streamed down in disgusting yet adorable rivulets. “I just…” he choked, “I just thought you’d never…” he took a couple of deep, painful breaths, “I just love you so much.”</p>\n<p>Iwaizumi stared at him… just <em> stared </em> and saw all of <em> him </em> . With his annoyingly perfect bedhead, the adorably ugly cry face and those eyes glistening with tears that simply wouldn’t stop. And god, <em> how did he miss it? </em></p>\n<p>Oikawa Tooru was beautiful because <em> he </em>would never, for the love of him, think he could be anything else but beautiful.</p>\n<p>That night, when he kissed Oikawa, he wasn’t nearly drunk enough as an excuse. He had no excuse except he always wondered what it would like to kiss Oikawa.</p>\n<p>“Iwa-chan… I’m dying.” Oikawa cried, “It’s unfair… for you.”</p>\n<p>“What is?”</p>\n<p>“This. You doing this. It’s… cruel.”</p>\n<p>“What are you saying? We’ve been basically together all our lives. Nothing’s gonna change.”</p>\n<p>“Everything’s going to change.” Oikawa said adamantly, his voice hoarse and Iwaizumi wondered if speaking is also causing him too much pain. <em> Maybe. </em>“I wouldn’t want to go and you wouldn’t want me to go.”</p>\n<p>Iwaizumi gaped at him, he opened his mouth to say he was saying something really stupid, but he also knew it was true. Admitting their in love wouldn’t change the fact that Oikawa was still gravely ill. <em> But… </em> “Then we’ll just do it until it’s time for you to <em> leave </em>.” He said, “It’s not like once you tell me we can’t do this, we’d be able to stop this anyway.”</p>\n<p>He was saying these things, but there was still a lingering fear at the back of his mind… but that fear of losing Oikawa was relatively miniscule compared to the fear of not having him at all. <em> The choice was pretty obvious </em>.</p>\n<p>“I don’t want to hurt you.”</p>\n<p>“I said I love you, goddammit.” Iwaizumi hissed, getting more impatient. “Just… allow me to love you, okay?,</p>\n<p>He didn’t know when Oikawa’s tears stopped. Didn’t know when his began--when Oikawa finally gave him the brightest smile he had seen for a long time. Or when Oikawa nodded. Or maybe when he pulled the chocolate-haired guy back into his arms and captured his lips.</p>\n<p>All he knew was in that singular moment, everything felt nice like where they should be.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>Two weeks later, Oikawa got his wish, thanks to Iwaizumi begging his doctors to allow it.</p>\n<p>Iwaizumi held onto him tightly as the hospital van pulled over the familiar gate of their high school. The guy, sitting quietly beside him, was looking outside. He looked tired, but he always looked tired nowadays… still, his eyes were shining brightly so Iwaizumi knew he was happy.</p>\n<p>The nurses helped him put Oikawa to a wheelchair while Aiko who was excited since yesterday assembled the portable oxygen tank they were carrying. He secured the cannula over Oikawa’s ears before he proceeded to push him through the empty hallway of their high school to the place Oikawa wanted to see.</p>\n<p>Their friends were already waiting for them at the entrance of the gym--Hanamaki and Matsukawa took a break from their wedding plans to drop by; the second years Yahaba and Watari took a leave in their respective corporate jobs in Tokyo while Kyoutani stepped out of his father’s ramen restaurant for the day. Even the first years, Kindaichi and Kunimi skipped their classes just to drop by. And they were all wearing the same awkward, sad-happy smiles.</p>\n<p>A chorus of “Oikawa-san!” and “Oikawa!” was heard when they got nearer and the guy managed to give out a small smile, “Hey…” he said in a breathy whisper.</p>\n<p>As planned, the rest of the nurses save for Aiko, excused themselves and went back to the van while their friends began animatedly talking about what they were up to all this time. Oikawa despite looking tired, listened eagerly at each one of them… looking at them straight in the eyes as they spoke as if he was memorizing their faces.</p>\n<p>After their little stories, Iwaizumi announced the next plan, “Alright, let’s go change into our uniforms.” Oikawa looked up at him, eyes filled with questions. Iwaizumi grinned at him, “What? Did you think we just came here to chat? Of course, we’ll be playing volleyball.” He turned to Aiko who beamed up at him, “Can you handle him for a moment?”</p>\n<p>Aiko nodded and Iwaizumi bent down and gave Oikawa a quick peck on the lips before he was off trailing behind the rest of their team who had already retreated back to where they left their bags.</p>\n<p>A few minutes passed, and suddenly the men who were just wearing a collection of casual shirts and jeans stepped into the court wearing their old uniforms which were a little too tight in some places, as Yahaba told Kyoutani who growled at him.</p>\n<p>But overall, they looked like they did many years ago and the image burned so bad in Oikawa’s eyes he was blinking back tears because he didn’t want to cry in front of everyone. Not when they sacrificed a day in their busy schedule just to see him.</p>\n<p>Iwaizumi walked past him as they divided into two teams. “You okay, Tooru?” He asked and… <em> did he really have to ask? </em>He smiled, “You look hot in that uniform.” Oikawa said making Aiko laugh. Iwaizumi blushed--the uniform was a little taunt especially on his arms. He had grown some muscles over the years and Oikawa had never been shy to compliment him with it. “Yeah, thanks.”</p>\n<p>“Hey, loverboy! Team’s already formed. Let’s start.” Matsukawa called out and Iwaizumi shrugged at Oikawa who smiled and shooed him off.</p>\n<p>It was Iwaizumi-Matsukawa-Yahaba-Kunimi versus Hanamaki-Kyoutani-Kindaichi-Watari. The game was overall balances, except Kyoutani, in real Kyoutani fashion got riled up easily when Yahaba started teasing him. Hanamaki and Matsukawa couldn’t stop giving each other sleazy remarks even when Iwaizumi told them to cut it off or he’d kick them. Kindaichi and Kunimi just looked like they’re lost in the whole drama. The only person taking the game seriously, surprisingly, was Watari who served as the setter.</p>\n<p>By the end of the game, they were breathless and exhausted not just from the physical activity, but from the endless banters they had to endure. <em> At least, we won </em>, was Iwaizumi’s competitive mind was telling him. He looked over at Oikawa, to find tears falling freely from his eyes as he smiled and clapped when the final score was announced.</p>\n<p>The entire court fell silent, with only the solitary pair of hands cheering them on. Nobody knew how to react… what to say. Iwaizumi watched Hanamaki bite his lower lip and closed his eyes shut to stop himself from crying. And when he did that, almost everyone started shedding tears… for the amazing captain who now watched on the sidelines.</p>\n<p>Iwaizumi didn’t cry. He walked towards Oikawa, knelt in front of him and wiped his tears away. “I love you.” Oikawa whispered, “Thank you for doing this.” Iwaizumi smiled, eyes never leaving Oikawa’s face, “As long as you’re happy.”</p>\n<p>They stayed like that until the other members were calm enough to walk to him and gave him a resounding <em> “Arigatou, buchou!” </em>Bowing their heads so low. Aiko’s phone rang and both Oikawa and Iwaizumi knew what that phonecall meant. They have to go.</p>\n<p>Oikawa let his eyes wander around the familiar court--his home for the happiest years of his student life. This was where he met this team... <em> This family </em>. “Thank you guys, for doing this for me.” He said, forcing out the words out of his mouth even when they sound hoarse and raspy, “You have no idea how much I wanted to go back here… to see this place and play volleyball with you…” a deep breath, “For one last time.”</p>\n<p>Hanamaki was crying again, and this time he didn’t try to hide it. “I might not be able… to come back here after today.” He smiled, “But I will always… always treasure every memories I’ve had in the four corners of this court.”</p>\n<p>Nobody said a word, everyone just sort of stood there, afraid to break the moment. Iwaizumi stepped in, “I guess, we have to go, guys. But really, thank you for doing this.” He didn’t wait for them to respond as both he and Aiko began wheeling Oikawa out the court… only to stop when Kindaichi yelled out “Captain!”</p>\n<p>Iwaizumi stopped and turned Oikawa around to face them again. All of them were wearing a smile and suddenly they were high school students again… young, unafraid and wanted nothing else but to get into nationals.</p>\n<p>“We trust in you!”</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>“You know… I could give you guys some time before we go back to the hospital.” Aiko said that as the three of them walked some more around the campus.</p>\n<p>Oikawa smiled at her, “You would?”</p>\n<p>“Would that be safe?” Iwaizumi asked. Aiko winked at them, “As long as it won’t be too long. I’m sure I could make some excuses.”</p>\n<p>She didn’t have to wait for Iwaizumi to respond, they parked the wheelchair and the portable oxygen by the bench across the football field where some gingko trees were growing in full bloom.</p>\n<p>Iwaizumi sat beside Oikawa, “Do you feel okay?”</p>\n<p>“I feel even better. Like… I’m actually be cured tomorrow.” Oikawa giggled as Iwaizumi rolled his eyes, “Come on, I’m serious.”</p>\n<p>“So am I!” Oikawa countered, turning towards the empty football field. The sun was almost setting and everything was washed by a golden orange light. It reminded him of those days when the two of them would walk together home.</p>\n<p>“It’s really beautiful.”</p>\n<p>“What?”</p>\n<p>“Our school.” Oikawa said, “I never regretted coming here… besides, we have like the prettiest uniforms.”</p>\n<p>“You really have a shitty personality, don’t you?” Iwaizumi shook his head but he was laughing at the same time.</p>\n<p>Oikawa joined in, although his laugh sounds different now because it was hard for him to do the usual one without running out of breath. Still, it sounded beautiful. When he stopped, he gave Iwaizumi a meaningful look, “So… about my last wish.”</p>\n<p>“What? I thought this was it?”</p>\n<p>“Well, I never really thought you’d be able to pull this off so I made a Wish B just in case.”</p>\n<p>“But I did pull it off so there’s no need for that, right?”</p>\n<p>“Why not? I can have as many wishes as I can.”</p>\n<p>“It’s called a last wish for a reason, dummy.” Iwaizumi shook his head, “But yeah… fine. Tell me. You better make sure it doesn’t involve kittens or any forms of animals.”</p>\n<p>Oikawa pouted “Why do you hate animals? They are so cute.”</p>\n<p>“I just don’t like them, okay?” Iwaizumi snapped, “Now, are you telling me your wish or not?”</p>\n<p>Oikawa stuck his tongue out at him because even with his sickness and obvious weakness, there was just no limit to his childishness. “I won’t say it because I wrote it.”</p>\n<p>“Fine, gimme it.”</p>\n<p>“No.”</p>\n<p>“What? Why not?”</p>\n<p>“You’re not allowed to find out.”</p>\n<p>“How can I do it if you won’t tell me?”</p>\n<p>“You’ll know when it’s time.”</p>\n<p>Iwaizumi gaped at him, “When it’s time? What do you mean?!”</p>\n<p>Oikawa didn’t answer him that afternoon, nor the next few days that he bugged him about it. <em> What was ‘when it’s time’? </em> He didn’t understand. <em> He soon did </em>. After three months.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>Oikawa Tooru died in his sleep at the age of twenty six, only two days short of his twenty seventh birthday. They didn’t expect it because despite two weeks composed of <em> bad days </em>, that one day, he was actually better.</p>\n<p>But it didn’t matter. Because Iwaizumi was there with him. He held Oikawa’s hand as he slept, held him even when the doctors came and told him he was no more. He didn’t cry. He didn’t beg them to <em> try again. </em>Because that night when Oikawa was supposed to be unconscious, he felt him squeeze his hand twice.</p>\n<p>It was his own way of saying <em> I love you </em>.</p>\n<p>His funeral was simple, too. Everything was white and pure… just like how Oikawa wanted it to be. All of Oikawa’s friends and family attended. There were a lot of tears and nostalgic stories which made them laugh, then cry harder at tbe end.</p>\n<p>Iwaizumi didn’t participate in any of those. He just stood beside the altar where Oikawa’s photo and urn was. He was looking at Oikawa’s photo… the high school, healthy version of him and not the way he looked before he died. He didn’t know if Oikawa would like that.</p>\n<p>There were no tears simply because they would not come. But <em> god, </em> he missed him so much. He wanted to go back to the hospital room and talk about how the rest of their volleyball team cried because of his funeral. He wanted to tell him how his funeral was beautiful, just like how he wanted it to be. He wanted to tell him… <em> anything </em> . He just wanted to go back to the hospital room, lay down with him on the hospital bed and just… <em> be with him </em>.</p>\n<p>He was in deep thoughts when someone approached him. He didn’t look up, and just continued to stare at Oikawa’s photo, trying to burn the image in his mind. “Iwaizumi-san.”</p>\n<p>It was Aiko, “I… I’m sorry for your loss.”</p>\n<p>He managed to give a very small smile and nodded before he turned back to the photo again, “I… I just miss him.”</p>\n<p>Aiko sighed, “He’s always been a fun person to be with. My hospital days would be lonely without him.”</p>\n<p>“I didn’t even get to give him his last wish.” Iwaizumi’s voice broke.</p>\n<p>“Ah, about that.” Aiko said, “Oikawa-san gave this to me a few days before we went to Aoba Johsai. He told me explicitly to not read it and never give it to you until…” her voice faltered, “...well, until you know.”</p>\n<p>Iwaizumi watched her pull a small white envelope from her bag and hand it to him. He took it and said his thanks before she excused herself and walked towards Oikawa’s parents.</p>\n<p>Iwaizumi stared at the white envelope on his hand, contemplating if he should open it or not… <em> of course, he would. </em>He ripped the sealed envelope and pulled out a familiar note from the inside.</p>\n<p><em> It was his note. </em>The one he gave him before… only this time, Oikawa’s handwriting was at the bottom as if to answer his question.</p>\n<p>\n<b> <em>Date her and love again.</em> </b>\n</p>\n<p> </p>\n<p>\n<b>+++</b>\n</p>\n<p> </p>"
}