{
  "id": "1056312",
  "url": "https://archiveofourown.org/works/1056312?view_full_work=true",
  "author": [
    "stereobone"
  ],
  "title": "I'm Only Going to Heaven (If it Feels Like Hell)",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Shingeki no Kyojin | Attack on Titan"
  ],
  "relationships": [
    "Levi/Erwin Smith"
  ],
  "characters": [],
  "additional_tags": [
    "Alternate Universe - Modern Setting",
    "Sugar Daddy",
    "中文翻译 | Translation in Chinese"
  ],
  "language": "English",
  "series": "",
  "published": "2013-11-24",
  "completed": null,
  "words": "16,990",
  "chapters": "1/1",
  "comments": "393",
  "kudos": "13,043",
  "bookmarks": "2,851",
  "hits": "184,123",
  "summary": "<p>\"Are you saying you want to be my sugar daddy?\" Levi says.</p>",
  "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a>.)</p>\n<p>I want to say that this is all <a href=\"https://kisu-no-hi.tumblr.com/\" rel=\"nofollow\">Fanny</a>'s fault but I'm kind of to blame too. And you all probably thought I was a really serious fic writer.</p>",
  "text": "<p>He orders a whiskey and Coke the minute they get in, and orders a second right after he finishes his first. People edge past him to take their place at the bar and Levi pushes his shoulders in to make himself appear smaller. He doesn't like clubs. They're loud, smoky, the music is terrible and so are the people. The alcohol, he thinks, will at least make it somewhat more tolerable. Hanji is tugging on his arm to try and get him to hit the dance floor with her, but Levi stands at the bar like a rock and she eventually gives up and goes off on her own. Four drinks later and Levi is feeling drunk enough to not mind the bass line pounding in his ear.</p>\n<p>The only reason he's here tonight is because midterms have been hell, and Hanji offered to pay for drinks.</p>\n<p>\"Come on,\" Hanji had said. \"It'll be fun, loosen you up a bit!\"</p>\n<p>She cornered Levi in the kitchen of the apartment they shared, her eyes bright with cabin fever. They had been studying for midterms for the better part of two weeks, and she needed out.</p>\n<p>\"I can't afford to go to a club,\" Levi said, which was actually the truth.</p>\n<p>College is fucking expensive, which Levi knew, of course, but nobody told him to what extent. Financial aid barely gives him enough to live on after paying for classes, and the funds from his summer job are just about dried up, forget the fact that his leg stopped him from being able to work properly for more than a few hours without being in searing pain.</p>\n<p>\"There's no cover,\" Hanji said.</p>\n<p>\"I don't—\"</p>\n<p>\"Drinks are on me.\"</p>\n<p>And Levi caved.</p>\n<p>He's been at the bar a better part of two hours, leaning against the bar top with his elbows because his body feels much too heavy. He's not wasted, just drunk enough to feel the tension ease out of his shoulders. The bartender points to his empty drink to ask if he wants another, and Levi nods.</p>\n<p>\"On your tab?\" the bartender asks.</p>\n<p>\"I've got it,\" someone says, and Levi turns his head too fast and realizes that he's drunker than he thought.</p>\n<p>The man is standing just a few feet away—Levi has no clue how long he's been there for—flashing a twenty-dollar bill at the bartender. In the dark lighting of the club, the man looks like a shadow, looming and sure. He's attractive, maturely so, but Levi still sneers at his forwardness.</p>\n<p>\"Whatever,\" he says.</p>\n<p>The man slides closer to him, resting an arm on the bar. He has a drink in his other hand, something clear and bubbly.</p>\n<p>\"You don't seem like you're having a good time.\"</p>\n<p>\"I'm having a great time,\" Levi says, and lifts his drink to show it. \"What, have you been watching me?\"</p>\n<p>\"Yes,\" the man says.</p>\n<p>If Levi weren't drunk, he'd do a lot better at hiding the stupid expression on his face, but he <em>is </em>drunk, and so he doesn't. He collects himself after a few seconds, unimpressed expression back in place.</p>\n<p>\"So, what, you just like to watch people in clubs? You some kind of pervert?\"</p>\n<p>The man laughs. His laugh is light and friendly and makes Levi's arms tingle.</p>\n<p>\"Not people,\" he says. \"Just you.\"</p>\n<p>\"Fuck,\" Levi says. \"Are you seriously hitting on me?\"</p>\n<p>\"Are you offended?\"</p>\n<p>Levi takes a long swallow off his drink, because he really isn't, he's actually kind of flattered and weirdly turned on by the man's audacity, but he can't decide if wants to let him know that or not. He ends up just shrugging. The man leans over and his fingers slide against Levi's wrist, rough and sure.</p>\n<p>\"What's your name?\"</p>\n<p>\"Fuck off,\" Levi says, not unkindly.</p>\n<p>The man smiles, doesn't pull away, and Levi feels incredibly out of depth and suddenly much more drunk.</p>\n<p>\"What's your name?\" the man says again, with such authority that Levi blurts his name out.</p>\n<p>\"Levi.\"</p>\n<p>The man's fingers circle around his wrist and close. \"I'm Erwin,\" he says.</p>\n<p>\"Erwin, right.\" Levi sets his drink down and pushes it away. He hates this club, and the alcohol is telling him that this is a good idea. \"So are you taking me home, or what?\"</p>\n<p>He leaves the club without telling Hanji, can't be bothered to find her when he's half-hard in his pants already. Erwin drives a shiny black Mercedes and the leather is cool when Levi climbs in. They drive out of downtown, and Levi is acutely aware of the fact that this man could be a serial killer or a torture enthusiast, and his mangled body might end up on the evening news in a few days, but Erwin puts his hand on Levi's thigh while he drives and Levi thinks it's worth the risk.</p>\n<p>The man's apartment is more of a penthouse, top-floor and shiny as hell, but Levi barely gets a chance to look. Once they're through the door, Erwin shoves him against it and covers his mouth with his own. They make out like that against the door, Erwin with both hands on Levi's jaw, his knee pressed against his crotch.</p>\n<p>\"I have half a mind to think you're underage,\" he says, pulling away to catch his breath.</p>\n<p>\"Fuck you, I'm twenty-one. How old are you, fifty?\"</p>\n<p>Erwin doesn't seem at all put off by his mouth, if anything, he seems to enjoy it. He kisses Levi again, quick and almost chaste, and then hefts Levi up over his shoulder and starts to carry him toward his bedroom. The room spins and Levi punches his back even though his legs are already wrapping around his waist because shit, this guy is strong and that kind of turns him on.</p>\n<p>\"Hey! What the hell are you doing?\"</p>\n<p>He doesn't get an answer. Erwin drops him on the bed and Levi bounces once against the mattress before Erwin is kissing him again, hands undoing his jeans. Maybe it's the alcohol or maybe it's the situation, but Levi can't ever remember being this turned on before. He doesn't do this. He doesn't go home with strangers and he doesn't do one night stands, but Erwin is tonguing his navel and pulling his pants down and Levi really can't be bothered to care about his morals. They've always been a bit shady, anyway.</p>\n<p>They make quick work of the rest of their clothes. Erwin seems to have this obsession with Levi's thighs, because he keeps biting and licking them, making Levi squirm.</p>\n<p>\"Come on already,\" he says. \"Fuck me. Or do you need more time to get it up?\"</p>\n<p>Erwin grins and runs his thumb up the underside of Levi's cock, which is painfully hard and leaking pre-come.</p>\n<p>\"You keep talking like that and I'll have to do something about your mouth.\"</p>\n<p>\"I'd like to see you try,\" Levi says, just before Erwin kisses him again.</p>\n<p>He does fuck him, though, and it's fantastic. Erwin maneuvers Levi onto his hands and knees and works him open with those thick fingers until Levi is drooling onto the pillow before putting his cock in him. Levi rides it for all it's worth, Erwin's hands holding his hips in a punishing grip.</p>\n<p>\"You're so tight,\" he says.</p>\n<p>\"Shut up, oh my god,\" Levi says, but his voice is shaking.</p>\n<p>Erwin pulls out, and for a second Levi thinks he's actually pissed him off, but Erwin flips him over so he's on his back instead and then pushes back in. Levi throws his head back, exposes his neck, too close to coming to care what he looks like. He knows he's flushed down to his chest, knows that he's making really embarrassing sounds from deep in his throat. His thighs are stretched around Erwin's waist, muscles straining. Erwin puts a hand on his cock and Levi comes with a shout, spilling between them. He deliberately tenses his muscles to push Erwin into orgasm, loving the deep groan he makes when he does so.</p>\n<p>\"Fuck,\" Erwin says, and pulls out.</p>\n<p>Levi rolls over while he ties the condom off, boneless and still drunk as hell. Erwin's sheets are soft, way better than his itchy low-thread count at home. He shuts his eyes and feels like he could fall asleep at any moment. Erwin's hand caresses his back and Levi just hums, thoroughly fucked and content.</p>\n<p>\"You're staying, then?\" Erwin asks, as if he thought Levi would bolt right after.</p>\n<p>Levi opens one eye. \"That a problem?\"</p>\n<p>\"Not at all,\" Erwin says, and sounds like he means it.</p>\n<p>He curls around Levi and they fall asleep like that, Levi listening to the strange quiet of his apartment.</p>\n<p align=\"center\">---</p>\n<p>Levi wakes up in the morning, or maybe it's early afternoon, to seven missed calls and fifteen texts from Hanji. He ignores them, because the bed is empty and he smells bacon and eggs. In the light, Levi can see how nice Erwin's apartment really is. The bedroom is neat, modern, an expensive Ikea showroom. A half-open closet door reveals a line of suits and shined shoes. Levi walks into the adjacent bathroom to take a piss and uses hand soap that smells like it was made from Himalayan salt or some bullshit like that. His head is pounding and his mouth is dry and rancid. He slips his briefs back on before going to find Erwin.</p>\n<p>The man is in the kitchen serving scrambled eggs onto a plate with bacon. It smells delicious and Levi's stomach growls. Erwin turns at the noise.</p>\n<p>\"Ah,\" he says. \"You're up. Hungry?\"</p>\n<p>He's only wearing sweatpants, and Levi can see the well-defined shape of his stomach, the cut of his pelvic muscles. He's still really attractive—attractive and rich—which makes Levi kind of hate him. But he <em>is </em>hungry, and so he takes a seat at the table and accepts the breakfast that Erwin's made him. Erwin sits across from him and watches him eat, but doesn't have anything of his own, just coffee. It makes Levi uneasy, the way he's smiling at him like he's got him all figured out.</p>\n<p>As soon as he finishes the last of the bacon, Levi stands up from the table.</p>\n<p>\"I'm going to get dressed,\" he says.</p>\n<p>He has no idea what he's supposed to do now, so he figures the best thing to do is just leave. He grabs his jeans off Erwin's floor and pulls them back on. His shirt is wrinkled up in the covers somehow. Levi slips it on and catches Erwin's black leather wallet on the bedside table. It looks thick, bulging, and Levi can't help himself. He opens it.</p>\n<p>In cash alone, Erwin's got about five hundred dollars. Levi fingers the bills, crisp. There are also a few platinum credit cards, and Erwin's driver's license. Levi looks at the date to see how old he actually is—thirty-four. Jealousy prickles up his spine and Levi is really tempted to pocket the cash.</p>\n<p>\"Leaving so soon?\"</p>\n<p>Levi drops the wallet and spins around. Erwin is leaning in the doorway but he doesn't appear to know that Levi was looking in his wallet, so Levi relaxes.</p>\n<p>\"Yeah,\" he says. \"I've got stuff to do.\"</p>\n<p>\"I'll drive you.\"</p>\n<p>\"I'll take the bus.\"</p>\n<p>\"Back to campus? That's a far ride.\" Erwin walks into the bedroom and opens his closet to grab a shirt. \"You're a student, aren't you? You said you were twenty-one.\"</p>\n<p>\"Yeah, so? You don't think I can get home on my own or something? Don't patronize me.\"</p>\n<p>Erwin gives him a look like Levi should already know that he would never, and Levi immediately feels ridiculous and doesn't understand why. At any rate, Levi only has one dollar in his wallet and the bus fare is seventy-five cents more, and like hell he's going to ask his one-night stand for bus fare.</p>\n<p>\"Fine,\" Levi says. \"You can drive me home.\"</p>\n<p>The ride back to his apartment is completely different from the night before. Erwin drives with caution, both hands on the wheel, and Levi isn't drunk with lust. He feels awkward and young. He keeps his hands folded in his lap until they pull up to his apartment complex.</p>\n<p>\"You're welcome,\" Erwin says as he's unbuckling his seatbelt.</p>\n<p>Levi stares at him.</p>\n<p>Erwin elaborates: \"For the ride.\"</p>\n<p>\"You're the one who offered,\" Levi says, opening the door.</p>\n<p>Erwin's hand is on his wrist again before he can get out of the car, pulling him back in. Erwin leans across the gearshift to kiss him, coffee-bitter breath.</p>\n<p>\"See you around, Levi,\" he says, and Levi gets out of the car, knowing that he won't.</p>\n<p align=\"center\">---</p>\n<p>\"I thought you were dead!\" Hanji says, shaking his shoulders. \"What the hell happened to you? I called you like eight hundred times!\"</p>\n<p>Levi shrugs her hands off and tries to get to the bathroom so he can shower. The cigarette smoke smell of the club is clinging to him like a disease and he feels dirty as hell, but there's also the subtler, human smell of sex all over. He's sore in places he can't reach. Hanji follows, waving her hands above her head.</p>\n<p>\"Levi, I was seriously worried! I thought you came back to the apartment but you weren't here.\"</p>\n<p>\"I'm fine, I went home with someone.\"</p>\n<p>That shuts Hanji up. She stares at him stupid while Levi pulls his shirt over his head.</p>\n<p>\"You met someone?\" she says. \"Who? Oh my god, who?\"</p>\n<p>Levi steps into the bathroom. \"Some guy. No big deal.\"</p>\n<p>\"Wait a second, I need details. Was he hot? Levi, was he—\"</p>\n<p>\"He was nobody,\" Levi says, and shuts the bathroom door in her face.</p>\n<p>It's pretty much status quo after that for the next week. Levi passes his midterms with no issues, but the work never ends. More papers get assigned, and his classes seem to drag. He and Hanji's apartment is just across the street from campus, so most days Levi just walks, but it's been getting colder lately, so he's started riding with Hanji when they have class on the same day.</p>\n<p>They met at orientation and Hanji was way too enthusiastic about everything but also incredibly smart, and the only one that didn't make Levi want to tear his hair out. They respect each other. Hanji was the one who convinced him to major in business after his athletic scholarship got pulled. He isn't that interested in it, to be honest, but he's smart and he's good at it, so he decides it's not so bad. Maybe he'll even land a decent job when he graduates and pay off his medical bills before he's dead.</p>\n<p>In the meantime, Levi lives off ramen noodles and food truck tacos and it fucking sucks, but he pays his rent on time and that's what matters to him. The stress of being laughably poor comes after. He has two semesters to go—he can do this.</p>\n<p align=\"center\">---</p>\n<p>On the third floor of the library, where it's quiet and the smell of books is soothing, Levi sits cross-legged and cracks open his microeconomics text book. This particular spot is his favorite. The bookshelves line up in just a way that makes him impossible to see. No one bothers him. Levi is half-positive even the librarians have forgotten about the books back here.</p>\n<p>He studies for the better part of an hour before his knee starts to lock up. Levi stretches it out in front of him and massages it lightly. The night he went home with Erwin, the man had fingered the scar there before hitching his legs up. Levi slams his book shut and decides he's studied enough for one day. It's dark when he steps out of the library, and cooler than before. Levi zips his sweatshirt up to the neck and pulls the hood over his head. He likes walking around campus unnoticed, a shadow. Nothing good has ever happened to Levi when he drew attention to himself.</p>\n<p>He stops at the vending machines for chips. The machine won't take his dollar. He tries to smooth it against his pant leg, but the black mouth of the machine still spits it back out, so Levi slams the palm of his hand into it.</p>\n<p>\"I've got it,\" someone says.</p>\n<p>Levi turns. It's Petra. She's in her uniform.</p>\n<p>\"Captain,\" she says, then blushes hard. \"Sorry. Hi, Levi. How are you?\"</p>\n<p>\"Fucking tired. You?\"</p>\n<p>Petra digs into her purse and pulls out four quarters before slipping them one at a time into the vending machine. She lets Levi make his selection.</p>\n<p>\"I'm well, just finished co-ed practice. We all miss you, you know.\"</p>\n<p>The chips fall but Levi doesn't retrieve them. He stands rigid and his leg hurts and he hates it.</p>\n<p>\"Levi,\" Petra says, softer now.</p>\n<p>\"I've been pretty busy.\" Levi bends and grabs the chip bag. \"I'll try to come by soon.\"</p>\n<p>She smiles, puts a hand on his arm. \"We'd all like that. How's your leg?\"</p>\n<p>\"It's a piece of shit,\" Levi says, and Petra laughs.</p>\n<p>Gently, Levi slides his arm away, distancing himself. Petra's skin is shiny with sweat, stringy bits of her hair sticking to her forehead, the veins in her arms popping from exertion. Levi misses that feeling.</p>\n<p>\"I've got to catch the shuttle,\" he says. \"I'll see you, Petra.\"</p>\n<p align=\"center\">---</p>\n<p>That weekend, Hanji invites him back out to the club and Levi says yes. He tells himself it's for the free drinks, even though he and Hanji both know it's not that at all, but Hanji knows him well enough not to say anything about it. They pile into her old hatchback and head for downtown, windows open to let in the crisp fall air. The club is every bit as shitty as Levi remembers it to be, and just as crowded. He and Hanji shove their way to the bar to order drinks.</p>\n<p>\"Maybe you'll get lucky again tonight,\" Hanji says, and then cups her cheeks. \"Maybe I'll get lucky.\"</p>\n<p>\"You're ridiculous,\" Levi says.</p>\n<p>And then he looks around for Erwin.</p>\n<p>Ten minutes later, it becomes glaringly obvious that Erwin isn't there, which Levi wasn't expecting him to be, but he still finds himself disappointed. He's only halfway through his drink, and another twenty minutes pass before he's itching to leave.</p>\n<p>He finds Hanji on the dance floor talking to someone that Levi thinks goes to school with them.</p>\n<p>\"Hanji, I'm going to head out.\"</p>\n<p>\"What? Already?\" she says, and then grins. \"Oh, I get it. He's not here.\"</p>\n<p>\"Who's not here?\" the boy next to her says.</p>\n<p>Levi says <em>shut up </em>at the same time Hanji introduces the boy as Eren. He's a freshman business major. Levi really could not care less at the moment. Eren shrinks behind Hanji.</p>\n<p>\"You want to me drive you?\" Hanji says.</p>\n<p>\"No, it's fine. Stay. I'll take the bus.\"</p>\n<p>She waves him off and Levi exits the club and steps into the cold night, zipping up his sweatshirt. People are drunk and happy around him, swaying on the sidewalk and laughing at nothing. Levi shoves his hands in his pockets. He ignores the way the cold makes his leg hurt. He doesn't know what the hell he was thinking. Erwin is probably at the some other club, picking up some other college boy, those sharp blue eyes intimidating. It's better this way. Levi rounds the corner to the bus stop and runs right into someone. He's about to swear, mouth already open around the word before he realizes that he's run right into Erwin.</p>\n<p>\"Levi,\" he says. He looks surprised, but not in a bad way.</p>\n<p>Erwin is dressed in a three-piece suit under his gray overcoat, hair slicked back. He looks good, really good. The sight of him has Levi remembering the way he held his hips when he fucked him. Levi shuts his mouth and recognizes that Erwin is with two other men, also in suits. They watch Levi with a mild, amused curiosity. Levi feels humiliated for a reason he can't quite place.</p>\n<p>\"You know him, Erwin?\" one asks.</p>\n<p>\"A friend,\" Erwin says. \"Go on without me, gentlemen. I'll see you on Monday.\"</p>\n<p>\"All right,\" they say, each clapping Erwin on the shoulder before walking ahead.</p>\n<p>Levi watches them round the corner before Erwin puts a hand on his arm, bringing his attention back to him.</p>\n<p>\"I didn't expect to see you down here,\" he says.</p>\n<p>Levi sniffs. \"Yeah, well, I was just leaving.\"</p>\n<p>He goes to walk around Erwin, but the man steps in front of him to block his path.</p>\n<p>\"Wait,\" he says.</p>\n<p>Levi goes to step around him, but Erwin repeats the action. Levi sneers.</p>\n<p>\"Get out of my way.\"</p>\n<p>\"Let me take you out to eat,\" Erwin says.</p>\n<p>This close, Levi can smell Erwin's cologne and see the deep blue of his eyes. He's looking at Levi sincerely, but also like he wants to eat him whole. Levi pulls his jacket tighter. He is pretty hungry.</p>\n<p>\"You're buying,\" he says.</p>\n<p>They go to a restaurant a few blocks away and get tapas, which are just really expensive appetizers from what Levi can tell. Still, Erwin is buying, so he orders a few things. Levi forgot to even eat today—he was too busy and too distracted—so when the food arrives, he starts stuffing his face, the smell of it all making him ravenous. A few minutes into it, he notices Erwin watching him, amused expression on his face, so he slows down. Erwin puts a slice of smoked salmon onto a toasted sliver of bread and eats it, watching Levi the whole time. It makes Levi feel jittery and also wanted, which decreases his appetite just a bit, but doesn't stop him from ordering dessert.</p>\n<p>Erwin pays for dinner without blinking, tucking one of his platinum cards into the server's hand. Levi is positive the meal cost well over a hundred dollars. He feels oddly smug knowing Erwin just spent that much money on him. They walk outside together, not talking, keeping a respective distance from each other. Levi can see his breath in the air and he's following Erwin to his car but he refuses to say anything about it. Once they reach Erwin's shiny black Mercedes, Levi hangs back, hands shoved in his pockets defiantly.</p>\n<p>\"Aren't you getting in?\" Erwin says.</p>\n<p>Levi scoffs.</p>\n<p>\"You think you can buy dinner and I'll just let you fuck me?\"</p>\n<p>Erwin stalks right up to him, using his height to loom over Levi. He bends down and puts his lips to Levi's ear.</p>\n<p>\"Yes,\" he says, voice low.</p>\n<p>Levi shivers. He gets in the car.</p>\n<p align=\"center\">---</p>\n<p>Erwin fucks him from behind, one hand on the nape of his neck like he owns him. Levi pushes back against him, listens to the slick sound of their skin sliding together. Before this, Erwin made him come in his pants in the elevator, dragged his thumb against the bulge in Levi's pants until the feeling was too much. He got hard again as soon as Erwin pulled him down onto the bed. Erwin drives into him hard, his rhythm unforgiving, and Levi hasn't been fucked this good in ages, but like hell he's about to let Erwin know that.</p>\n<p>\"Come on,\" he says, voice wrecked. \"That all you got? Should've known you'd get tired, old man.\"</p>\n<p>\"Don't make me gag you.\"</p>\n<p>Erwin's voice comes out smooth, but edging on some kind of hysteria, like Levi is driving him crazy. Good. Levi wants it that way.</p>\n<p>\"Please,\" he says. \"You could never—\"</p>\n<p>He almost chokes when Erwin shoves two fingers in his mouth. They press on his tongue like a warning.</p>\n<p>\"Suck,\" Erwin says.</p>\n<p>Levi bites them instead. Not hard, just enough to let Erwin knows he can't fuck around with him. Erwin rips his fingers out and drives into him hard enough that Levi can't hold himself up on his elbows anymore. He collapses into the mattress and has to turn his head to the side to avoid a face full of cotton.</p>\n<p>\"You're impossible,\" Erwin tells him, and Levi tries to laugh but it just comes out as a long, drawn out moan.</p>\n<p align=\"center\">---</p>\n<p>He stays the night again, but has the foresight this time to text Hanji and let her know he won't be home. This time, when Levi wakes up, Erwin is still in bed, arm thrown over his stomach. He looks younger when he's sleeping. The lines of his face are relaxed and almost nonexistent. His mouth seems smaller. Levi gives his hair a quick check to see if he can find any grays.</p>\n<p>\"What are you doing?\" Erwin says, voice thick with sleep.</p>\n<p>\"Checking to see if you died so I could rob you,\" Levi says.</p>\n<p>Erwin laughs, a genuine, hearty laugh. He puts a hand on Levi's knee and squeezes briefly before getting out of bed.</p>\n<p>\"Well, lucky for me, I'm not. Now how about breakfast?\"</p>\n<p>Levi slides out of bed, languid, stretching his muscles. He scrubs his hands over his face and follows Erwin to the kitchen, in desperate need of coffee.</p>\n<p>\"If you were dead I could just buy my own breakfast,\" he says, and dodges the hand that goes to swat his ass.</p>\n<p align=\"center\">---</p>\n<p>Erwin goes across the street to get bagels and coffee, so Levi naturally decides to snoop around. He walks through the living area of the apartment, fingers trailing across the black leather couch. There's a Jackson Pollock painting hanging across from a giant flat-screen TV, and Newsweek magazines strewn out on the coffee table. By the front door, there's a framed picture on the table where Erwin keeps his keys of an older woman with gray hair. She has her arm around Erwin and looks proud. Levi figures it's his mother.</p>\n<p>In the kitchen, Levi presses fingerprints into the stainless steel refrigerator before wiping them away and opening the doors. It's stocked with fresh fruit and vegetables, yogurt, and some leftovers from a Thai restaurant. There are also half-empty instant coffee drinks that look like they're starting to mold. Levi wrinkles his nose and shuts the doors. He sits on Erwin's couch and picks up one of the Newsweek magazines, flipping through without actually reading. Erwin comes in a few minutes later and kicks the door shut behind him.</p>\n<p>They eat on the couch together, silent until Erwin starts prompting questions.</p>\n<p>\"Tell me about yourself,\" he says.</p>\n<p>Levi stares at him. \"What the hell?\"</p>\n<p>Erwin makes an exasperated face and tries again.</p>\n<p>\"What do you study?\"</p>\n<p>\"Business.\"</p>\n<p>\"Do you like it?\"</p>\n<p>\"It's whatever.\" Levi takes a bite of his whole-wheat bagel and nods to Erwin. \"What do you do?\"</p>\n<p>\"I'm a financial advisor,\" Erwin says, which is very vague, but Levi doesn't press for more.</p>\n<p>He isn't sure how to talk to Erwin. He finds him attractive, wouldn't go as far as to say he likes him, but he definitely enjoys his company. Still, Erwin is difficult to read. All Levi can really tell about him is that he seems to do everything with a genuine sincerity.</p>\n<p>Erwin reaches out and pulls Levi's left leg toward him, running his hand up to the knee.</p>\n<p>\"How did you hurt your leg?\"</p>\n<p>Levi jerks his leg away without thinking about it and nearly knocks his coffee out of his own hand. Erwin is surprised by his reaction, eyebrows raised, hand held up to show he means no harm. Levi stretches his leg back out as an apology and allows Erwin to finger the scar on his knee lightly.</p>\n<p>\"Soccer injury. Tore my ACL.\"</p>\n<p>It was only a year and a half ago, but Levi remembers the twisting pain like it just happened, and then the surgery that followed. He couldn't walk for weeks, had to have Hanji wheel him around campus like some invalid.</p>\n<p>\"You don't play anymore,\" Erwin says.</p>\n<p>\"No,\" Levi says, even though Erwin didn't really ask a question. \"I can't with this knee, can I?\"</p>\n<p>And then, oddly enough, Erwin says <em>sorry</em>. Levi pulls his leg away, more gently this time.</p>\n<p>\"What the hell are you sorry for? It's my knee, not yours.\"</p>\n<p>\"You were on athletic scholarship, weren't you?\" Erwin blows on his coffee before taking a sip. \"That must have been a hard transition.\"</p>\n<p>Levi laughs cruelly. \"Right, like you would know.\"</p>\n<p>He swallows the rest of his bagel and starts back towards Erwin's bedroom.</p>\n<p>\"I'm taking a shower,\" he says, and is surprised that Erwin doesn't follow him.</p>\n<p align=\"center\">---</p>\n<p>He showers and dresses and finds Erwin still on the couch with the news turned on, something about rising oil prices. Levi clears his throat to get Erwin's attention.</p>\n<p>\"Can I get a ride?\"</p>\n<p>Erwin smiles and stands up.</p>\n<p>\"I didn't mean to offend you, earlier,\" he says in the car, which takes Levi by surprise.</p>\n<p>\"Uh,\" he says, unsure how to reply. \"Whatever. It doesn't matter.\"</p>\n<p>Erwin pulls into the apartment complex, parking in a spot this time, before reaching into his pant's pocket and pulling out his phone.</p>\n<p>\"What's your phone number?\" he says. \"I'd like to see you again.\"</p>\n<p>Levi is half-tempted to refuse, or give him a fake one, but the truth is he does want to see Erwin again. There's something about him that Levi is just drawn to, and he wants to figure out what it is. Levi never does anything by halves. He gives Erwin his number—his real number—and hops out of the car before the man can kiss him, but looks over his shoulder as he walks to his apartment and sees that Erwin looks disappointed and longing, which he likes very much.</p>\n<p align=\"center\">---</p>\n<p>Later in the night, Hanji knocks on his door. She's got her cellphone tucked against her ear.</p>\n<p>\"I'm going to order takeout,\" she says. \"You in?\"</p>\n<p>Levi's ears perk up. He's tired of ramen and willing to splurge for something different.</p>\n<p>\"Let me see if I have cash.\"</p>\n<p>He pulls his wallet from his jeans, and his face goes hot when he sees a hundred-dollar bill tucked inside. For a few minutes, all Levi can do is stare at the bill, dumbfounded. Then he shoves his wallet back into his pant's pocket. Now he's livid. He knows exactly where this money came from.</p>\n<p>\"Actually, I have to go somewhere. Can I borrow your car?\"</p>\n<p>Hanji takes the phone away from her ear. \"Now? Where do you have to—?\"</p>\n<p>\"Don't ask stupid questions. Can I borrow the car or not?\"</p>\n<p>\"Fine,\" Hanji says. \"Geez. Just don't crash it.\"</p>\n<p>Levi speeds all the way to Erwin's apartment. He could just call him, but Levi isn't sure he could talk on the phone right now without throwing it against the wall, and he can't afford a new one. The doorman has seen him twice before, but Levi ducks behind a couple entering the building to avoid him calling up to let Erwin know he's coming. He slams his fist into Erwin's door, knocking violently and continuously until Erwin throws it open. He's only wearing sweatpants again, and looks like he's just had a shower, but Levi too angry to appreciate the droplets of water on his skin. He takes the hundred-dollar bill from his pocket and shoves it against Erwin's chest.</p>\n<p>\"Take your fucking money,\" he says. \"I'm not a whore.\"</p>\n<p>He spins on his heels and starts back towards the elevator, but Erwin catches up with him quickly.</p>\n<p>\"Levi, wait.\"</p>\n<p>Erwin grabs his arm and Levi wrenches it away from him, baring his teeth.</p>\n<p>\"Don't touch me, asshole.\"</p>\n<p>\"Levi,\" he says, and tries again, but Levi dodges him.</p>\n<p>\"I said don't touch me.\"</p>\n<p>\"You really want to do this?\" Erwin says, gesturing into the hallway. \"You really want to do this here?\"</p>\n<p>Levi looks around. No one is in the hall except for them, but anyone could come out at any minute, and Levi is sure some people have heard him. That last thing he needs is for someone to call the cops on him, that would be rich.</p>\n<p>\"Come inside.\" Erwin's voice is pleading. \"Let me explain.\"</p>\n<p>He could leave. He could get in the elevator and leave, delete Erwin's number and never talk to him again. He could.</p>\n<p>Levi sighs. \"Fine.\"</p>\n<p align=\"center\">---</p>\n<p>Erwin shuts the door and Levi paces, angry and impatient. It doesn't help that Erwin remains remarkably calm, wet hair making him look a few years younger. He brushes past Levi and heads into the kitchen.</p>\n<p>\"Tea?\"</p>\n<p>\"Is that a joke?\" Levi says. \"You said you'd explain, so explain.\"</p>\n<p>Erwin puts the kettle on anyway. The sound of heating water fills the apartment after a few minutes, getting ready to boil over. It's pretty much how Levi feels right about now. Erwin opens his cupboards and fishes a mug out.</p>\n<p>\"I don't think you're a whore.\"</p>\n<p>\"Good,\" Levi says. \"Because I'm not.\"</p>\n<p>Erwin puts a teabag in the mug and sets it next to the kettle. The fact that he's so damn calm makes Levi feel like he's overreacting, actually calms him down somewhat. It's the principal of the thing that matters more to him, really. Maybe any other person would have pocketed the money, but Levi has a lot of fucking pride.</p>\n<p>\"How broke are you, exactly?\" Erwin says.</p>\n<p>Levi's hands turn to fists.</p>\n<p>\"That's not any of your goddamn business, is it?\"</p>\n<p>\"No,\" Erwin says. \"I suppose it's not. But I'm asking.\"</p>\n<p>The kettle clicks, alerting Erwin that it's boiled. He pours water over the teabag, and Levi kind of regrets not having a cup.</p>\n<p>\"I'm not exactly enrolling in a 401K right now,\" he says. \"My financial aid is a fucking laugh.\"</p>\n<p>\"You're struggling.\"</p>\n<p>\"Don't say that like you know me.\"</p>\n<p>\"I know you have bags under your eyes,\" Erwin says. \"And I know that you were looking through my wallet the first night I took you home.\"</p>\n<p>The second part actually catches Levi off guard. He shifts his weight to his good leg and crosses his arms over his chest, feeling a lot more exposed now.</p>\n<p>\"Shit. I thought you didn't see that.\" Before Erwin can respond, he adds, \"It's not like I took anything.\"</p>\n<p>\"No,\" Erwin says. \"You didn't.\"</p>\n<p>\"So you gave me money because you, what? Pity me?\"</p>\n<p>\"I don't pity you, Levi. You're very smart. But you already knew that. I gave you the money because I like you. I want to keep seeing you.\"</p>\n<p>He takes a sip of his tea and puts the mug down, folds his hands behind his back. It's like he's giving Levi the floor. He's explained himself, and now he's going to let Levi react how he will. Levi is tempted to pick Erwin's mug up and throw the tea in his face, but also tempted to suck his dick, so he has no idea what that says about himself. Erwin doesn't pity him. Erwin likes him. Erwin wants to give him money. Levi glances back at the door and sees the hundred-dollar bill Erwin gave him sitting crumpled on the floor. He must have slipped it into Levi's wallet while he was taking a shower, the clever bastard.</p>\n<p>\"You like me,\" Levi says. \"You give everyone you like money?\"</p>\n<p>\"No,\" Erwin says, tone quite serious.</p>\n<p>It occurs to Levi very quickly that he can use this to his advantage and hates that as much as he loves it. The thing is, he doesn't want a handout, and he sure as shit doesn't want pity, but he needs money. He <em>needs </em>it. And if Erwin wants to give him his money, who is Levi to complain? His financial situation is miserable and Erwin is not bad looking at all. He needs money. Levi tells himself that over and over as he steps into the kitchen, walking purposefully slow, until he's mere inches away from Erwin. He watches the man swallow, face totally passive.</p>\n<p>\"Are you saying you want to be my sugar daddy?\"</p>\n<p>Erwin presses a thumb to Levi's lips.</p>\n<p>\"Is that what you want to call it?\"</p>\n<p>Levi could bite him. He could, but he doesn't.</p>\n<p>\"I don't need your money,\" he says, aware of how petulant he sounds. \"But I'm not going to say no to it.\"</p>\n<p>Then he sucks Erwin's thumb into his mouth. He swirls his tongue around the digit, grazing the skin lightly with his teeth before stepping away. Erwin's eyes look hazy and Levi is grinning.</p>\n<p>\"You're a fucking pervert,\" he says.</p>\n<p>Erwin says, \"Stay with me tonight.\"</p>\n<p>Levi's cock twitches in his pants at the thought of staying, but like hell he's going to give it up that easily. He walks out of the kitchen without answering. Erwin follows, looking like he's just barely stopping himself from tackling Levi.</p>\n<p>\"I can't,\" Levi says finally. \"I have class in the morning and I borrowed a friend's car.\"</p>\n<p>He picks the hundred-dollar bill up from the floor. \"I'm taking this, though.\"</p>\n<p>\"Levi,\" he hears, and when he turns Erwin is there without having made a sound. He kisses Levi, hand on his neck, and it takes a lot of effort and willpower for Levi to finally pull away.</p>\n<p>\"Drive safe,\" Erwin says. His face is flushed.</p>\n<p>Levi flips him off as he walks out the door.</p>\n<p align=\"center\">---</p>\n<p>Two days later he gets a text from Erwin: <em>Free tonight? Meet me at Barneys.</em></p>\n<p>Levi types back, <em>Am I supposed to know where that is.</em></p>\n<p>Instead of snappy reply, he gets an address and time.</p>\n<p align=\"center\">---</p>\n<p>Erwin is waiting for him just outside the doors. The sun is nearly set, but he's still wearing black sunglasses, the collar of his coat turned up. He smiles when he sees Levi, an easy, confident smile that makes Levi feel disarmed. He stops what he deems to be a comfortable distance away from Erwin and waits, impatient, for some kind of explanation.</p>\n<p>\"You made it,\" Erwin says. \"Come on.\"</p>\n<p>Levi follows him inside the glass doors, immediately assaulted by the smell of cologne and hypoallergenic makeup. Erwin walks with a purpose, and Levi has to move fast to keep up with him.</p>\n<p>\"What exactly are we doing in a department store?\" he says.</p>\n<p>Erwin stops and turns around. \"We're getting you a coat.\"</p>\n<p>\"What the hell?\"</p>\n<p>Erwin reaches out and flicks at the thin material of his sweatshirt.</p>\n<p>\"That,\" he says, \"just won't do.\"</p>\n<p>He starts walking again, and Levi is left scrutinizing his own clothes. It's a university sweatshirt that he's had for almost two years. The forest green coloring is fading, but other than that, the sweatshirt is fine. Levi keeps it clean. There are no rips or stains.</p>\n<p>\"Oh I get. You don't want to be seen with some ratty-looking guy, that's what this is all about.\"</p>\n<p>\"This is about you not freezing to death,\" Erwin says, completely unaffected by his comment. \"You were chilled to the bone the other night.\"</p>\n<p>Levi says, \"That's an exaggeration.\"</p>\n<p>He doesn't apologize for his comment, because Erwin is really fucking hard to read, and for all Levi knows he's just playing him. But Levi's sweatshirt isn't warm enough for the weather anymore, and he can't afford a warmer coat. He had resigned himself to extreme layering for the winter. Now, though, he supposes he won't have to. A lot of things are changing suddenly for him, like being able to buy real groceries, which is exactly what he did with the hundred dollars that Erwin slipped into his wallet.</p>\n<p>It's not like he grew up poor. His family was working class like most other families, sometimes struggling, but mostly scraping by and making the most of what they had. Levi didn't run into real money trouble until his scholarship got revoked. Even before that, Levi wasn't too fond of anyone whose pockets overflowed with money. They all seemed too greedy, too flippant. He despises them now even more, so, logically speaking, he should despise Erwin. He should.</p>\n<p>They hit the outerwear section and Erwin steps aside to let Levi ahead.</p>\n<p>\"Take a look and see if you like anything.\"</p>\n<p>Levi takes the first coat he sees off the rack, and checks the price tag out of habit.</p>\n<p>\"Jesus shit,\" he says. \"This is eight hundred dollars.\"</p>\n<p>Erwin does not seem at all concerned by this. \"Do you like it?\"</p>\n<p>\"You're insane,\" Levi says, and puts the coat back on the rack.</p>\n<p>He wasn't expecting this, though truth be told, Levi wasn't sure what to expect at all. Levi has to wonder if it's him, or if Erwin would be doing this for anyone he picked up in a club. He wonders if Erwin has done this before and feels oddly jealous. Eventually, Levi decides not to give a shit and just pick a coat. It doesn't take long for him to find one—a black double-breasted pea coat. The buttons practically shine. It's a very, very nice coat, and Erwin notices him looking at it.</p>\n<p>\"Try it on,\" he says, so Levi does.</p>\n<p>It fits him nicely, a little long, but nothing Levi is about to complain about. He's itching to check the price. The coat even feels expensive.</p>\n<p>Erwin looks him up and down, hums. \"You look very nice.\"</p>\n<p>Levi can't help himself. He looks at the price tag.</p>\n<p>\"This coat is worth more than I am,\" he says.</p>\n<p>\"Now that's definitely not true,\" Erwin says.</p>\n<p>\"This is fucking insane, I can't believe you're doing this.\"</p>\n<p>\"And yet here we are.\" Erwin puts an arm around him and steers him toward the cashiers. \"Now let's get this paid for.\"</p>\n<p align=\"center\">---</p>\n<p>He wears the pea coat out. His sweatshirt sits crumpled and abandoned at the bottom of the Barneys' shopping bag. Erwin was content to throw it away, but Levi stubbornly refused. Oddly, and probably a bit insanely, he felt like throwing it out would be throwing a piece of him away. He just didn't want to do it. Erwin let him keep it without question and they left the store. Levi has to admit that it's a much warmer coat (it fucking should be for the money). The chill of the late autumn air barely hits him at all as they walk to Erwin's car. He listens to the click of Erwin's heels next to him, their arms brushing together, and shivers for an entirely different reason.</p>\n<p>Once they're at the apartment, once Erwin shuts the door behind them, Levi starts a get anxious. He watches Erwin slowly undo the buttons of his coat and swallows thickly. The whole apartment has an odd feeling to it. Levi knows what's coming. His fists curl and uncurl. He knows he needs to do something, repay Erwin, but he doesn't move, just stands in the area between the couch and kitchen, wrapped in the coat Erwin bought him. Levi's stillness causes Erwin to turn, cock his head. A piece of his hair has come loose, and it sweeps across his forehead. Levi thinks Erwin is going to brush up against him any minute, but instead he turns and opens his fridge.</p>\n<p>\"I don't know about you, but I'm famished,\" he says.</p>\n<p>Levi watches his backside and the fresh pressed lines of his suit and doesn't know what the fuck Erwin is doing. Erwin emerges with two apples. He tosses one to Levi, who just barely catches it. There's a wet crunch as Erwin's teeth tear through the skin of the apple. Levi follows him dumbly to the couch, mimicking Erwin's movements because he isn't sure what to do next. He doesn't know what the plan is. Levi has never been much of a strategist. Erwin sits with one arm over the back of the couch, the picture of relaxation, legs crossed loosely. Levi stares at the apple in his hands and finally takes a bite, relaxing a bit himself.</p>\n<p>\"Are you going to take your coat off?\" Erwin asks.</p>\n<p>\"Maybe,\" Levi says, who had actually forgotten he was even wearing it. He shrugs it off and lays it over the arm of the couch.</p>\n<p>It occurs then to Levi what Erwin is doing. He's not doing anything. That's the point. He's showing Levi that he doesn't have to do anything in return, nothing at all. Levi takes a vicious bite of his apple. That just…that just pisses him off. It'd be a lot fucking easier if Erwin were just a pervert, but apparently he's a considerate pervert. Levi is tired of him always being one step ahead.</p>\n<p>He sets his apple on the coffee table and crawls very deliberately into Erwin's lap. Erwin watches him with darkened eyes but otherwise does nothing, so Levi kisses him. His mouth tastes sweet and cold from the apple. There's a dull thud as Erwin's apple drops to the floor and he wraps his arms around Levi's waist, pulling him closer. It's the slowest kiss they've ever shared, the most calculating one.</p>\n<p>Levi pulls back so he can grab Erwin's legs and tug them up onto the couch before settling between them. He makes quick work of Erwin's belt. Erwin is rubbing a soothing hand up and down his arm.</p>\n<p>\"Levi,\" he says, and his face tells Levi that maybe this is exactly what Erwin wanted all along, and goddammit, Levi doesn't care. He wants to do it.</p>\n<p>\"Shut up.\"</p>\n<p>He pulls Erwin's cock out and tongues gently at the slit. Erwin makes a noise above him, something low and uncontrolled. Levi smiles. He wraps his lips around the head of Erwin's cock, cheeks hollowing, then swallows him down as far as he can. He drags his tongue against the underside of it, head bobbing, listening to the pained groans that Erwin is making. Erwin's hand tangles in his hair and fingernails scrape lightly against his scalp. Levi wants to open his eyes and see the look on his face, but it seems like too much effort and he's having a hard enough time controlling his gag reflex. The noises Erwin's making are more than enough.</p>\n<p>\"Oh,\" Erwin says, when his cock hits the back of his throat, \"oh that's very good. Good boy.\"</p>\n<p>Levi lets his cock slip out of his mouth because he cannot believe those words just left Erwin's lips.</p>\n<p>\"<em>Good boy</em>, really?\" There's a line of drool at the corner of his lip so he wipes at it. \"God dammit, you want to me start calling you daddy or something? Fucking hell.\"</p>\n<p>\"You're the one who keeps suggesting these things,\" Erwin says, \"not me.\"</p>\n<p>But he also doesn't shoot the idea down.</p>\n<p>\"Like you weren't thinking it,\" Levi says, and takes him back in his mouth.</p>\n<p>He knows when Erwin's orgasm is about to hit because he practically rips Levi's hair out before pushing his hips up and coming hard. Levi grunts but swallows easy. As soon as Erwin's grip loosens he comes up for air and massages away the sharp pain in his scalp.</p>\n<p>\"Sorry,\" Erwin says, though he doesn't sound it at all.</p>\n<p>He pushes up onto his knees, copying Levi's position, and shoves a hand down the front of his pants.</p>\n<p>\"Let me return the favor.\"</p>\n<p>Levi bites his lip. \"If you make me come in my pants again I'll kill you.\"</p>\n<p>\"Don't worry,\" Erwin says. \"I've got you.\"</p>\n<p>Levi comes with his head pressed into Erwin's shoulder, teeth biting into the skin to swallow down the noises he's making.</p>\n<p align=\"center\">---</p>\n<p>The whole apartment complex is vibrating from the celebration. Hanji and Levi are in his room because it's cleaner and trying to ignore the noise to the best of their abilities when all Levi wants to do is go out there and beat the shit out of everyone. The soccer team won another game. This win puts them at third in the country. Levi's happy for them, he is. He could just do without the crazy party that's been raging for the last three hours. Hanji must know he's on edge because she's been unusually quiet, just passes him notes for the homework every now and again. Levi knows the team has a new captain. He can't remember his name, but he heard that he's good.</p>\n<p>Levi thinks about the field sometimes. He lets himself remember the smell of wet grass, the feel of sweat dripping into his shin guards. After, he felt disgusting, but in the moment he felt invincible. He was good at playing, he was good at being captain. Soccer was something he belonged in. Now he doesn't belong much of anywhere.</p>\n<p>\"Levi, hey, earth to Levi.\" Hanji's hand waves in front of his face. \"You okay?\"</p>\n<p>He swats her hand away. \"I'm fine. What were you saying?\"</p>\n<p>Hanji pulls a piece of mail from her notebook. \"I was saying that this came in the mail for you today.\"</p>\n<p>Levi holds the envelope in his hand. It's another demand for payment from when he had his surgery. He tosses the envelope on the bed without opening it. It'll go to collection, whatever.</p>\n<p>\"Listen,\" Hanji says. \"You know I can help—\"</p>\n<p>\"No,\" Levi says.</p>\n<p>His voice comes out harsh. Hanji jumps and Levi is immediately apologetic.</p>\n<p>\"No,\" he says again, softer now. \"You shouldn't have to get involved. I'll manage.\"</p>\n<p>\"You pay me rent on time, and that's great, but maybe you could stop for a while and let me—\"</p>\n<p>\"Hanji, <em>no.</em>\" Levi nudges her with his shoulder. \"I don't need you to take care of me.\"</p>\n<p>\"I know,\" she says, looking down at their notes.</p>\n<p>A loud thump comes from the apartment above them and Levi looks up at the ceiling and growls. Fucking party animals. He hopes someone calls the cops.</p>\n<p>\"By the way,\" Hanji says. \"I saw your new coat…it's nice.\"</p>\n<p>Levi's eyes flicker to the coat where it's hung in his closet. He shrugs. Hanji doesn't know about Erwin. Levi can't even imagine trying to explain the situation to her. Erwin buys him things. They have sex, possibly in exchange. Levi doesn't want to talk about it.</p>\n<p>\"It's a coat,\" he says.</p>\n<p>\"It looks expensive.\"</p>\n<p>Levi sets his pen down. \"What are you getting at?\"</p>\n<p>Hanji adjusts her glasses, which is something she only does when she's really serious. An insane part of Levi thinks she's somehow found out about his thing with Erwin. She can be freakishly perceptive.</p>\n<p>\"Levi, did you steal that coat?\"</p>\n<p>And sometimes she's incredibly dense.</p>\n<p>The chair scrapes against the floor as Levi stands up, back stiff.</p>\n<p>\"You're a fucking idiot,\" he says.</p>\n<p>\"Hey!\" Hanji stands up after him. \"Okay, so you didn't steal it. Where did it come from?\"</p>\n<p>\"Does it matter?\"</p>\n<p>\"Yes.\"</p>\n<p>Levi rolls his eyes. \"Someone bought it for me. I didn't steal it. Christ, who do you think I am?\"</p>\n<p>Hanji blushes and starts fiddling with the frayed edges of her ponytail. She laughs, embarrassed, and then apologizes, her face still red. Then the first part of Levi's answer catches up with her.</p>\n<p>\"Hold on, who bought it for you?\"</p>\n<p>Levi's stomach tightens. He decides the best thing to do is walk away. Hanji follows.</p>\n<p>\"Levi!\"</p>\n<p>\"It was no one.\"</p>\n<p>\"The same no one you went home with from the club?\"</p>\n<p>Levi backtracks to grab the coat from his closet. There's some tinny, auto-tuned rap coming from the upstairs apartment, and Levi really cannot be bothered to deal with this right now.</p>\n<p>\"Hanji,\" he says. \"If there was ever a time I needed you to shut up, it would be now.\"</p>\n<p>He steps out the front door just as Hanji yells, \"Secrets don't make friends!\" Students are roaming the hallway with red solo cups full of beer, laughing and bumping into one another.</p>\n<p>Levi pulls out his phone and shoots Erwin a text. <em>Can I come over? </em></p>\n<p>Erwin's reply comes quickly. <em>Of course.</em></p>\n<p align=\"center\">---</p>\n<p>He has a thing for Erwin's sheets. They're soft and always smell clean. Levi wraps himself in them after his shower and they're cool to the touch. Erwin's hand is on his good knee and he's reading the paper. It's Saturday. The night before, they fucked three times, until Levi was so tired he rolled right over and went to sleep without showering. This morning he's sore, feels an ache deep inside him, but it's oddly pleasant.</p>\n<p>Erwin tries to hand him part of the paper.</p>\n<p>\"No thanks,\" Levi says, folding his hands together.</p>\n<p>He doesn't like handling newspapers. The ink gets on his fingers and it's just messy.</p>\n<p>\"Do you want the funnies instead?\"</p>\n<p>\"Oh fuck you.\"</p>\n<p>Levi knees him and Erwin just laughs, low and smoky. He wears reading glasses, which Levi did not know but feels like he should have. This man bought him a coat that cost more than his rent and Levi really doesn't know the first thing about him. To be fair, it's not like he has to. There's no point in making this arrangement anything more than it is. That doesn't stop Levi from being curious. He leans over to see what Erwin's reading about. Despite the black and white format and the shitty pixilation, he can still make out Erwin's picture on the page. He's shaking hands with someone who looks important.</p>\n<p>\"That's you,\" says Levi, which is a painfully obvious observation, but still. \"Why are you in the paper?\"</p>\n<p>\"I told you I'm a financial advisor.\" Erwin pushes his glasses up. \"My name and picture occasionally end up in the paper.\"</p>\n<p>Levi grabs the paper from his hand, ink fingers be damned, and starts scanning over the article. As it turns out, Erwin is the financial advisor of one a major financial company: banking, loans, the works. No wonder he's loaded. He's being recognized in the paper for his \"outstanding financial planning\" and contributions to the community. Levi presses his tongue to the roof of his mouth.</p>\n<p>\"Good for you,\" he says, handing the paper back over.</p>\n<p>\"That impressed, are you?\" Erwin says.</p>\n<p>The newspaper crinkles as Erwin folds it back together and Levi leers.</p>\n<p>\"Was that you trying to impress me just now? With your picture in the paper?\"</p>\n<p>Erwin's fingers trail along his thigh. \"I know better than to try and impress you with something like that.\"</p>\n<p>\"You're smarter than I thought,\" Levi says, and pulls the sheet away.</p>\n<p align=\"center\">---</p>\n<p>Erwin takes him home Sunday evening. Other than running out for food, they haven't left the apartment. Levi doesn't think he put pants on at all on Saturday. Outside his apartment, in the warmth of Erwin's car, he waits for Erwin to offer him money, but the car just idles and Erwin just stares at him. Levi realizes that he's going to make him ask for it. He grits his teeth.</p>\n<p>\"Can I have some money,\" he says, or rather mumbles.</p>\n<p>Erwin leans across the gearshift. \"Come again?\"</p>\n<p>\"I need to buy groceries,\" Levi says, louder and more abrasive. He's almost positive Erwin heard him the first time.</p>\n<p>\"Ah, of course.\" Erwin digs out his wallet and pulls out two one hundred-dollar bills. \"Think that'll be good for the week?\"</p>\n<p>\"Fine.\"</p>\n<p>Levi snatches the money from his hand and shoves it into his coat pocket.</p>\n<p>\"You like your coat, I take it?\"</p>\n<p>\"Yeah, it's good. It's fine.\" Levi fidgets in his seat. \"Thank you.\"</p>\n<p>Erwin smiles. He's already leaning toward him, arm draped over his seat, so it doesn't surprise Levi when he closes the distance and kisses him. His mouth is cool and minty from his toothpaste. Levi presses himself into the kiss. He can hear the money Erwin gave him crinkle in his coat pocket.</p>\n<p>\"You're welcome,\" Erwin says, and pulls away.</p>\n<p>And then Hanji's voice from outside the car says, \"Holy shit.\" And Levi says, \"Fuck.\"</p>\n<p>He desperately, desperately wishes a freak tornado would swoop down and suck her away, but when Levi looks out the windshield, she's standing there with a bundle of groceries and her mouth open. Erwin's headlights are reflecting off her glasses and making her look insane.</p>\n<p>\"A friend of yours?\" Erwin says.</p>\n<p>Levi sinks further into the leather seat. \"My roommate.\"</p>\n<p>\"Ah.\"</p>\n<p>Levi tries to get her to leave by sheer force of will and an exceptionally well-practiced death glare, but Hanji either doesn't get the hint or doesn't care. It gets worse when Erwin shuts the engine off and opens the driver's side door.</p>\n<p>\"What are you doing?\" Levi says, but Erwin's already gotten out of the car.</p>\n<p>He jumps out after him, rounding the hood to intercept Hanji. Her mouth is still open. Levi reaches her just as she and Erwin are shaking hands.</p>\n<p>\"Hi there,\" she says. \"I'm Hanji.\"</p>\n<p>\"I know,\" Erwin says, which Levi stares at him for because he actually does not know. \"I'm Erwin. It's a pleasure to meet you.\"</p>\n<p>Levi grabs Hanji back the crook of her elbow to pull her away, jostling the groceries in her arm. She stumbles back onto the sidewalk with him.</p>\n<p>\"Right, well, you'd better go,\" Levi says to Erwin. \"We have an exam tomorrow.\"</p>\n<p>Hanji blinks. \"No we—\"</p>\n<p>\"Don't let me keep you,\" Erwin says. \"I'll talk to you soon, Levi.\"</p>\n<p>\"Right,\" Levi says. \"Whatever.\"</p>\n<p>Even though Erwin's back in his car, Levi still has to practically drag Hanji up the stairs. She's silent up until the moment they get into the apartment. She drops her groceries on the table without looking and grabs Levi's shoulders.</p>\n<p>\"You,\" she says. \"You little liar.\"</p>\n<p>\"Get your filthy hands off of me.\"</p>\n<p>Levi shakes her off and opens the fridge to grab a beer.</p>\n<p>\"He bought you that coat, didn't he?\" Hanji says.</p>\n<p>Levi twists the top off his beer and takes a long drink. \"So?\"</p>\n<p>\"So, he's not nobody. You said he was nobody. He's definitely somebody. Somebody rich.\" Hanji picks her groceries back up and starts to put them away, tomatoes tucked under her arms when she suddenly gasps and drops them. They hit the floor with a wet <em>thunk</em>. \"Oh my god. He's giving you grocery money too, isn't he? Levi, oh my god.\"</p>\n<p>\"Don't say it,\" Levi says. \"I'll fucking murder you.\"</p>\n<p>She says it anyway.</p>\n<p>\"He's a sugar daddy. You bagged a sugar daddy.\"</p>\n<p>The words make Levi's skin crawl. He sneers around the rim of his beer bottle. This is why he didn't want her to know. This is why he didn't want <em>anyone </em>to know. The last thing he needs is Hanji trying to get chummy with Erwin, acting like this is anything more than it is. It's embarrassing and annoying. And also weird. Erwin feels like a dirty little secret, and that's how Levi wanted to keep him—a secret.</p>\n<p>\"That's so cool,\" Hanji says.</p>\n<p>\"Please shut up.\"</p>\n<p>\"What? I wish I had a sugar daddy.\"</p>\n<p>She folds her empty grocery bag and shoves it under the sink. It's not like Levi hasn't used the words himself, it's not like he doesn't know, but when Hanji says it, it sounds a lot different. Dirtier. Real.</p>\n<p>\"He's not my sugar daddy,\" he says.</p>\n<p>\"Fine, your rich boyfriend.\"</p>\n<p>\"He's not my boyfriend.\"</p>\n<p>Hanji retrieves her tomatoes from the floor, wiping them off with her sleeve.</p>\n<p>\"Who is he, then?\"</p>\n<p>\"I told you,\" Levi says. \"Nobody. It's nothing.\"</p>\n<p align=\"center\">---</p>\n<p>But his nothing with nobody continues. By the time finals roll around, Levi is at Erwin's apartment nearly every weekend. It's a situation that Levi is becoming more and more comfortable with, comfortable enough that he bought an extra toothbrush. It sits next to Erwin's in the chrome holder. He is learning things about Erwin, like how he likes his coffee black and his tea strong. He doesn't eat red meat and moves his lips when he reads the newspaper, which he reads every morning without fail. His job is incredibly demanding and stressful, not something Erwin has ever said, but something Levi has noticed (when Erwin picks him up and his back is stiff or his tie is knotted too tight and Levi presses his fingers into the tense muscle there and watches as Erwin slowly relaxes back into him). Levi has noticed these things without trying to.</p>\n<p>He comes out of Erwin's room from a nap the Saturday after his last final. It's been raining on and off all day, not cold enough for snow yet, and Levi feels lethargic. He finds Erwin on the couch and TV is showing his school's soccer team and Levi's chest tightens immediately. Erwin is watching the match, coffee mug in one hand. Levi can see Gunther running downfield, Oluo beside him.</p>\n<p>\"Can you turn that off?\" he says.</p>\n<p>Erwin turns. His hair isn't slicked back today, and it hangs loosely over his forehead.</p>\n<p>\"This is your team,\" he says.</p>\n<p>\"Not anymore.\"</p>\n<p>They haven't been his team in a long time. Even seeing them around campus is odd for Levi. Petra still talks to him, but the others have drifted away almost entirely. It isn't their fault. Levi doesn't want to talk to them. It feels too odd, too reminiscent of something that isn't. Erwin switches the channel over to a TV movie instead and Levi is silently grateful. He joins him on the couch, tucks his legs underneath him, ignoring the pull of the muscle in his left leg.</p>\n<p>\"Just because you can't play doesn't mean you have to take it out of your life completely,\" Erwin says.</p>\n<p>\"Yes it does.\"</p>\n<p>\"You could coach, if you wanted.\"</p>\n<p>\"I don't want to coach.\" Levi shrugs. \"What's the fucking point if I can't play.\"</p>\n<p>\"That's always a point.\"</p>\n<p>Erwin's fingers press against the back his neck, massaging away the tension that Levi didn't realize had built up there. It's an extremely tender gesture, and it startles Levi. He wants to be push him away, tell him, <em>no. No, this isn't what we're doing, this isn't part of the deal.</em> Instead, he leans into the touch, eyes fluttering closed. The next time Erwin speaks, he's much closer, breath hitting against Levi's skin.</p>\n<p>\"You take things too seriously,\" he says.</p>\n<p>Levi shudders. \"Just fucking take me to bed.\"</p>\n<p>Erwin handles him gently and it's disarming. He coaxes Levi onto his back and spreads his legs, takes his time opening him up, pausing every so often to drag his thumb up Levi's cock. When he finally fucks into him, he's holding Levi's legs apart, making it difficult for him to move, to think. Levi arches up into him, chest and neck flush. Erwin eventually lets his legs go so that he can touch Levi's nipples, run his fingers over the redness of his chest. The movement of his hips is so slow it's almost painful, and Levi feels laughably out of control.</p>\n<p>\"Erwin, fuck, <em>Erwin.</em>\" Levi bites the back of his wrist. \"You're some kind of pervert, you know that?\"</p>\n<p>\"I'm sorry,\" Erwin says. \"It's just you look so good like this.\"</p>\n<p>He drags his hands down Levi's stomach, the muscles quivering and jumping. Levi swallows hard.</p>\n<p>\"Come on,\" he says. \"Come on, daddy, fuck me.\"</p>\n<p>Erwin's hands still and Levi thinks, <em>got you.</em></p>\n<p>\"Levi,\" says Erwin, like he just got punched.</p>\n<p>Levi leers up at him. He's back in control.</p>\n<p>\"What's the matter, daddy?\"</p>\n<p>Erwin pulls out so suddenly that Levi nearly sobs, and then he's rolling Levi over so that he's on his knees, shoving his cock back inside of him, moving a lot faster now. He grabs Levi's wrists and pulls them back so that Levi is held up only by him, body angled forward ninety degrees. The position pushes Erwin's cock deeper inside of him. Levi chokes on his own spit and his knees shake. He feels trapped, wrists caught in Erwin's grip, cock hot inside him. It feels far too good.</p>\n<p>\"Fuck, what are you—\"</p>\n<p>\"You can take it,\" Erwin says. \"Come on, good boy.\"</p>\n<p>His shoulders feel like they could pop out of their sockets at any second, but he's also seeing fucking stars and Erwin is right, he can take it. He tosses his head back, ignoring the strain of his muscles and focusing instead on the hot pulse of Erwin inside him, fucking him like he's really, truly earned it.</p>\n<p>\"That feel good?\" Erwin says. \"You like it when I take care of you, don't you?\"</p>\n<p>\"Fuck, oh god, Erwin.\"</p>\n<p>\"Who am I?\"</p>\n<p>Levi's groin is tight, cock aching and muscles throbbing, but it feels so overwhelmingly good he can't help indulging Erwin.</p>\n<p>\"<em>Daddy</em>,\" he says, gasping on it.</p>\n<p>Erwin's hips snap. \"Daddy what?\"</p>\n<p>\"Fuck you,\" Levi says. \"Oh god, daddy, <em>please</em>. Shit, please, please. Harder.\"</p>\n<p>His face is hot and red and the shame of it shouldn't turn him on, but it does anyway. Erwin fucks him harder, squeezing his wrists tight and Levi feels hot all over. Erwin finally lets his wrists go and Levi collapses against the mattress, Erwin following so he's right on top of him, and now Levi's cock is trapped against his belly and mattress and the friction and pressure becomes too much. He comes with his mouth in the pillow, barely able to breathe, humping the mattress like he knows nothing else. Erwin's thrusts slow after that, and when Levi realizes that he's going to pull out, he squeezes around him, head shaking.</p>\n<p>\"No,\" he says. \"Keep going, I can take it. Inside me, you fucking old man.\"</p>\n<p>There's vibration above him as Erwin laughs, but he listens. He picks up his thrusts, easing up some so that Levi can actually breathe. He plants one hand on the pillow next to Levi's head to brace himself, so Levi bites his wrist, tasting the salty skin there. Erwin comes not long after that.</p>\n<p>They lay still on the bed afterwards, breathing heavy. Erwin is curled against Levi and they're both sweaty and there's semen drying on Levi's stomach but he doesn't, for some reason, care at all. He sleeps.</p>\n<p align=\"center\">---</p>\n<p>In the darkness, later, Levi says, \"Why are you doing this? Seriously.\"</p>\n<p>Erwin shifts, asleep, but Levi wonders if he's really awake.</p>\n<p align=\"center\">---</p>\n<p>Sunday when Erwin drives him back to his apartment, he shuts the car off. Levi stares.</p>\n<p>\"What are you doing?\" he says.</p>\n<p>Erwin steps out of the car, pulling his collar up against the cold.</p>\n<p>\"I'd like to see where you live.\"</p>\n<p>\"You've seen it,\" Levi says. \"Here it is.\"</p>\n<p>He holds the car door open like Erwin will get back in, but it's obvious that he isn't. Levi doesn't want Erwin to see his apartment. It's tiny, appliances dating back to the nineties and Levi has never been embarrassed about his situation but he certainly doesn't want to flaunt it. It's a cardboard box compared to Erwin's place.</p>\n<p>\"I meant inside,\" Erwin says. \"If that's all right with you.\"</p>\n<p>Levi doesn't really have a good reason to say no, not that he feels he needs one. But Erwin has done a lot for him, and Levi trusts by now that he's not just some rich asshole. He doesn't see the harm—Hanji isn't even home.</p>\n<p>\"I just don't know why you'd want to, it's a dump.\" That isn't true at all; Levi keeps the place immaculate. \"But whatever. Come on.\"</p>\n<p>They climb the stairs to the second floor together but Erwin hangs back when Levi digs his keys out. There's a dent in the front door from where someone kicked it, back before Levi and Hanji moved in. It should have been fixed over a year ago. Levi inhales and opens the door.</p>\n<p>The apartment is dark inside and also freezing. Levi flips the lights on and goes to the thermostat. The apartment opens right into the kitchen and then the living room. Off the living room is a hallway with Levi and Hanji's bedrooms and a bathroom. The washer and dryer hide in a closet in the kitchen for reasons Levi has yet to figure out. Erwin looks around, rubbing his hands together to warm them up.</p>\n<p>\"This reminds me of my first apartment in college,\" he says.</p>\n<p>Levi flicks the heat on and tries to imagine Erwin broke and in college, living off of ramen noodles. It's really difficult to imagine, but also kind of amusing.</p>\n<p>\"Glad to know they've always been shitty,\" Levi says. \"I'm guessing you want to see my room.\"</p>\n<p>He walks down the hall without waiting for Erwin's answer. His room is just as cold as the rest of the apartment and the overhead light doesn't work so Levi has to turn on the desk lamp. His notes are stacked neatly in the corner of the desk, pens lined up next to them. A letter announcing that his intent to graduate in the spring has been approved sits open in the middle. Levi pushes it to the side.</p>\n<p>\"It's neat,\" Erwin says, amused. \"I expected nothing less.\"</p>\n<p>\"It's not hard to keep a room this small neat.\"</p>\n<p>Other than his desk, Levi has one dresser and his bed pushed against the wall. There are a few posters hanging, and a calendar, but nothing else. There's also a space heater underneath his desk.</p>\n<p>\"So that's it,\" Levi says. \"I don't know why you wanted to see it so bad.\"</p>\n<p>Erwin thumbs through one the books on top of Levi's dresser. \"I wanted to see where you lived.\"</p>\n<p>\"I'm not living in squalor. Are you satisfied?\"</p>\n<p>Erwin laughs once through his nose and shuts the book.</p>\n<p>\"I never thought that,\" he says.</p>\n<p>\"Then why did you want to come in so bad?\"</p>\n<p>The floor creaks as Erwin steps toward him, face softening. He tucks Levi's bangs back behind his ear.</p>\n<p>\"Levi,\" he says, and leans down and kisses him.</p>\n<p>His mouth always tastes so clean, Levi thinks, then he kisses back, hands grabbing the hem of Erwin's coat to ground himself. When he pulls away, Erwin is watching him with hooded eyes, mouth open like he wants to say something.</p>\n<p>Levi hears the front door open and steps back, wiping his mouth.</p>\n<p>\"Hello?\" Hanji says. \"Levi, you here? I think Erwin's car is out front.\"</p>\n<p>\"Yeah,\" Levi says, and then coughs to get his voice working properly. \"Yeah. We're in here.\"</p>\n<p>\"Oh, he's here?\"</p>\n<p>Hanji pokes her head in the door, cheeks red from the cold.</p>\n<p>\"Hi,\" she says. \"Nice to see you again.\"</p>\n<p>\"Likewise,\" Erwin says.</p>\n<p>\"Want something warm to drink?\"</p>\n<p>\"I was actually just heading out.\" Erwin nods to her. \"Thank you, though.\"</p>\n<p>Hanji disappears from the doorway. Levi waits until he hears her in the kitchen before speaking again.</p>\n<p>\"So next weekend?\" he says. \"Or earlier. I'm out of class until January, you know.\"</p>\n<p>\"Actually, I'll be flying out of country this week for the holidays.\"</p>\n<p>Levi speaks before he can school the disappointment in his voice: \"Oh.\"</p>\n<p>He shouldn't be upset, he has no right or reason to be. It isn't like Erwin is obligated to tell him stuff like this. Levi tells himself that, but he still feels odd about it, disappointed.</p>\n<p>\"I'll be back after Christmas,\" Erwin says. \"Promise me you won't get into trouble while I'm gone.\"</p>\n<p>\"What am I, a thug?\" Levi shoves him lightly. \"I've been taking care of myself long before your sorry ass came along.\"</p>\n<p>\"So I can see.\"</p>\n<p>Erwin pulls his wallet out of his back pocket and pulls out some money to tuck into Levi's hand. When Levi looks down, he notices that Erwin has given him more than one or two bills. He's given him eight—eight hundred dollars.</p>\n<p>\"Shit,\" he says, and almost drops the money. \"This is way too much money.\"</p>\n<p>But he doesn't hand the money back, and Erwin doesn't take it from him. He folds his hand over Levi's.</p>\n<p>\"Take it,\" he says. \"Think of it as a Christmas present.\"</p>\n<p>\"Merry Christmas to me, then,\" Levi says.</p>\n<p>He walks Erwin to the front door and doesn't give a shit when Hanji sees him crane up to kiss him goodbye.</p>\n<p align=\"center\">---</p>\n<p>It snows the day after Erwin leaves. He texts Levi just before he gets on a flight to England, tells him to enjoy his holiday. Levi texts him back and tells him not to break his back in Europe. He briefly considers using some of the money Erwin gave him to buy him a Christmas present, but ends up deciding against it. It would be like Erwin bought the present for himself, and Levi can't think of what he'd get him, anyway. He buys Hanji new seat covers for her car, and she buys him a pair of boots, and they spend the snowy nights in drinking eggnog spiked with rum together.</p>\n<p>\"Petra is having a Christmas party,\" she tells him.</p>\n<p>It's five days before Christmas and they're huddled under a blanket on the couch together watching Rudolph the Red-Nosed Reindeer. Hanji and Petra were friends long before Levi got hurt. He shifts under the blanket.</p>\n<p>\"So what?\"</p>\n<p>\"Come with me!\" Hanji says. \"Petra said you're invited. It'll be way better than spending the night here alone again.\"</p>\n<p>\"I don't like Christmas parties,\" Levi says.</p>\n<p>\"You are such a liar.\"</p>\n<p>Hanji kicks his shin under the blanket and Levi hisses.</p>\n<p>\"Everyone misses you. They want to see you, Levi.\"</p>\n<p>Levi looks back at the TV. Rudolph is on the island of misfit toys, nose glowing. His knee twitches and he thinks of Erwin in England, Erwin with his smart coats and all his money.</p>\n<p>\"I'll think about it,\" he says.</p>\n<p>Later, he goes into his room and reopens the letter approving his intent to graduate. His department graduates May fourth. Less than six months. Levi reads the letter over, memorizing the details of it, running his finger over the stamped signature of the department. He thinks of Erwin again. Erwin six months from now. Levi decides to go to the party.</p>\n<p align=\"center\">---</p>\n<p>Eld is the one who answers the door when Hanji and Levi show up to Petra's apartment. He does nothing to hide the surprise on his face when he sees Levi standing at the door with her.</p>\n<p>\"Oh,\" he says. \"Oh, shit!\"</p>\n<p>He moves like he's going to hug Levi, then settles for shaking his hand instead.</p>\n<p>\"Wow,\" he says. \"It's great to see you.\"</p>\n<p>\"Are you going to let us in or have us freeze to death out here?\" Levi says.</p>\n<p>\"Oh, right.\"</p>\n<p>He steps aside to let them in, still shaking Levi's hand. Eld eventually stops, embarrassed once he realizes it. He takes Hanji's scarf and coat for her and hangs them on the hook beside the door. Levi takes off his own, hanging next to Hanji's and trying to stop himself from feeling so anxious. He hasn't talked to most of these people in over a year, let alone seen them.</p>\n<p>\"Hanji didn't tell us you were coming,\" Eld says. \"But I'm glad you did.\"</p>\n<p>\"Slipped my mind,\" Hanji says, laughing.</p>\n<p>\"You're full of such shit,\" Levi tells her, and now Eld is laughing.</p>\n<p>\"You haven't changed one bit, man.\"</p>\n<p>They join everyone else in the living room and there are more handshakes and a few hugs and lots of laughter. Levis sits on the arm of the sofa next to Hanji, listening as opposed to really talking. He feels less awkward being around his former teammates than he thought he would. Petra's apartment smells like pine and gingerbread, warm from the amount of people. Levi drinks eggnog and lets himself relax. The conversation turns, eventually, to soccer, which he knew it would. Gunther starts talking about their last match, and then there's a hush among everyone, and quick glances at Levi. He shrugs.</p>\n<p>\"You're doing really well,\" he says. \"The women's team, as well. Good work.\"</p>\n<p>It makes him feel like a captain again, which he both loves and hates.</p>\n<p>\"We still miss you,\" Oluo says.</p>\n<p>\"Well I don't,\" Levi says, though he does, and being here makes him happy and miserable all at once.</p>\n<p>Everyone laughs and Levi drinks more eggnog and the tension is gone.</p>\n<p>At the end of the night, he pulls out his phone. He has a text from Erwin: <em>Merry Christmas, Levi. </em></p>\n<p>Levi stares at the text, chest blooming, and realizes that he actually misses Erwin. He misses him, and his stupid nice apartment, and the way he makes Levi feel incredibly out of depth. He shoves his phone back in his pocket.</p>\n<p>\"Are you okay?\" Petra says.</p>\n<p>\"Yeah. Just gotta piss,\" Levi says.</p>\n<p>He excuses himself to the bathroom and pulls his phone back out, stares at the text. Eventually, he texts back: <em>Merry Christmas. </em>And after another minute, adds: <em>Daddy. </em></p>\n<p align=\"center\">---</p>\n<p>Levi gets a call from Erwin later that night when he's buried under the covers in sweatpants and a sweater. His toes feel icy even though they're in socks. He digs around for his phone, snorting when he sees the name on the caller ID.</p>\n<p>\"Isn't it like 3am there?\"</p>\n<p>\"Did I wake you?\" Erwin's voice sounds smoky over the phone.</p>\n<p>Levi shakes his head, then remembers Erwin can't see him. \"No.\"</p>\n<p>\"Good.\" There's fidgeting on the other end of the line, then a banging noise and Erwin and swears. \"How are you?\"</p>\n<p>\"Are you drunk?\" Levi says.</p>\n<p>\"Just a bit. It's Christmas Day.\"</p>\n<p>\"Not here.\" Levi never told Erwin his birthday was on Christmas—really didn't see the point. \"What do you want?\"</p>\n<p>\"I was just thinking about you,\" Erwin says.</p>\n<p>Levi stretches his legs out under the covers. \"Yeah?\"</p>\n<p>\"Yes. I was thinking about you taking my cock.\"</p>\n<p>Levi freezes and hates the little shiver that travels to his groin.</p>\n<p>\"Oh my god,\" he says. \"You're not seriously—\"</p>\n<p>\"Do you have any idea what you look like when I'm fucking you? It's exquisite.\"</p>\n<p>\"Well, I don't…\" Levi swallows. \"It's not like there's a fucking mirror.\"</p>\n<p>He hears Erwin shift, a soft exhale, and thinks he's probably touching himself. Levi can't believe this is happening. He considers hanging up, but in all honesty, he doesn't want to.</p>\n<p>\"What do I look like?\" Levi says.</p>\n<p>\"Like you were made to take it,\" Erwin says. \"You go flush all over like a little slut.\"</p>\n<p>Levi's hand is toying over the band of his sweatpants before he swears silently and lets it slip inside, grips his cock. He's already half-hard at the sound of Erwin's voice.</p>\n<p>\"I was with colleagues tonight and all I could think about was making you come with my fingers,\" Erwin says. \"Would you like that?\"</p>\n<p>Levi strokes himself. \"Yeah,\" he says. \"Shit.\"</p>\n<p>\"Are you touching yourself?\"</p>\n<p>\"What do you think?\"</p>\n<p>Erwin laughs, breathy. He's silent for a minute, and Levi feels anxious from his arousal.</p>\n<p>\"Keep talking,\" he says. \"Tell me more, daddy.\"</p>\n<p>\"Fuck, Levi, I want to fuck you until you can't move. I want to take you apart, darling boy, until you're sobbing for more.\"</p>\n<p>Levi strokes himself faster, fully hard now, embarrassed but too aroused to really care. He's having fucking phone sex, and Erwin is miles and miles away and he misses him.</p>\n<p>\"You want me to cry for you, daddy? Is that what you want? I'll beg for your cock, I don't fucking care.\"</p>\n<p>\"You love my cock, don't you?\"</p>\n<p>\"It's—\" Levi bites his lip to keep his moan down. \"Yeah, shit, it's fucking huge. I feel so full when you're inside of me.\"</p>\n<p>\"I want you to come,\" Erwin says. \"Come thinking about how I'm going to fill you up when I get back there.\"</p>\n<p>Levi jerks himself until he does, which doesn't take long at all. He moans into the phone as he comes, listening for Erwin's uneven breathing on the other line.</p>\n<p>\"Good boy,\" Erwin says.</p>\n<p>\"Fuck,\" says Levi.</p>\n<p>He kicks his soiled sweatpants off, skin still heated.</p>\n<p>\"Fuck,\" he says again.</p>\n<p>\"Get some sleep,\" Erwin tells him. \"I'll be home soon.\"</p>\n<p>Levi thinks about saying he misses him. The words are right there on his tongue, ready to come out, but he doesn't say them.</p>\n<p>\"Yeah,\" he says. \"Okay. Goodnight.\"</p>\n<p align=\"center\">---</p>\n<p>Erwin brings him back a black cashmere scarf from London.</p>\n<p>\"Didn't you already give me a present?\" Levi says, but still wraps the scarf around his neck.</p>\n<p>It's soft and smells like an airplane. They're naked in bed together, the scarf the only thing Levi is now wearing. He likes being back in Erwin's bed. He liked looking out his window to see Erwin's Mercedes in the parking lot. He liked coming back to his apartment and trailing his fingers over Erwin's back. He missed Erwin. But he's not going to say that. Erwin smiles.</p>\n<p>\"This is for your birthday.\"</p>\n<p>Levi can't keep the shocked look off his face. \"How the hell did you know about that?\"</p>\n<p>Erwin shrugs. \"I have my ways. Now come here.\"</p>\n<p><em>Hanji,</em> Levi thinks, but he can't bring himself to be mad. He scoots closer to Erwin on the bed and Erwin pulls him by the hips until he's seated in his lap. He adjusts the scarf, tightening it around Levi's neck a touch too much and smiling when Levi bats his hand away.</p>\n<p>\"Fucking perv.\"</p>\n<p>He pulls the scarf loose but lets it hang on his neck.</p>\n<p>\"Well?\" Erwin says. \"Do you like it?\"</p>\n<p>Levi kisses him slow, licks across his lips and then bites him.</p>\n<p>\"Yeah, it's all right,\" he says.</p>\n<p>Erwin pushes him down onto the mattress and the ends of the scarf fall across the bed like ribbons. He tugs the scarf aside to kiss at Levi's neck, cock soft and warm against his hip.</p>\n<p>\"Happy birthday.\"</p>\n<p>Levi squirms.</p>\n<p>\"Hey,\" he says.</p>\n<p>\"Hmm?\"</p>\n<p>\"I'm graduating this semester.\"</p>\n<p>Erwin looks up at him, and Levi can't read his face. A weird silence passes between them before either speaks again.</p>\n<p>\"Congratulations,\" Erwin says. \"That's a big achievement.\"</p>\n<p>He goes back to kissing Levi's neck.</p>\n<p>\"Yeah,\" Levi says, struggling to concentrate now. \"Yeah, so…\"</p>\n<p>Erwin looks up again. \"What is it?\"</p>\n<p>His eyes are very blue. Even in the soft light of his bedroom, the color of them is nearly startling. Levi doesn't know why he's never noticed that before.</p>\n<p>\"Nothing.\" He pushes Erwin's head back down. \"Nothing.\"</p>\n<p align=\"center\">---</p>\n<p>He sees Petra more during the semester. They meet for coffee on campus when their schedules allow it and just talk. Levi lets her talk about soccer. He likes hearing about it now. Erwin's stupid coaching idea is something that's stuck with Levi since he said it. He has experience, and the certification isn't hard. He could coach high school soccer if he wanted to, or even a club. Realistically speaking, though, getting a job that has to do with business would be more sensible. It would certainly pay more.</p>\n<p>He's been saving some of the money that Erwin gives him so that he can start paying off his medical bills. The monthly payments aren't huge, but Levi still has trouble paying them.</p>\n<p>Petra isn't graduating for another year or so, and Levi wonders if he'll see her at all after he graduates. Probably not. He hasn't watched her play in a while, but if she's as good as he remembers, she'll go professional by the time she's out of college. It was a goal Levi had once, and one that he'll never attain now. He meets Petra on a windy day in March and they duck into the campus coffee shop and warm their hands on their coffee cups.</p>\n<p>\"So what's next after graduation?\" she says. \"Are you going to get a job? Wear a suit and tie?\"</p>\n<p>\"I hate ties.\" Levi pours creamer into his coffee. \"But probably. I fucking need one.\"</p>\n<p>\"I'm sure something will come up. You could always wear a cravat.\"</p>\n<p>\"A what?\"</p>\n<p>Petra laughs. \"Never mind.\"</p>\n<p>Levi's phone vibrates with a text from Erwin. He's been so busy he hasn't seen him in almost a week. Levi hides his phone under the table to read the text.</p>\n<p>\n<em>In a terrible meeting. What are you doing?</em>\n</p>\n<p>Levi grins.</p>\n<p>\n<em>Having an orgy. The usual.</em>\n</p>\n<p>He puts his phone away only to have it vibrate seconds later.</p>\n<p>\n<em>Pics? </em>\n</p>\n<p><em>Give you a recap later in person, </em>Levi writes, <em>you dirty old pervert.</em></p>\n<p>\n<em>What a cruel little boy…I miss you.</em>\n</p>\n<p>Levi's thumb hovers over the screen to reply, but then he looks up and sees Petra watching him from across the table, head cocked, a smile on her lips. Levi frowns and puts his phone away.</p>\n<p>\"What?\"</p>\n<p>\"You look happy,\" she says.</p>\n<p>\"No I don't.\"</p>\n<p>\"Yes, you do. Well…\" She rolls her eyes affectionately. \"As happy as your facial expressions allow.\"</p>\n<p>\"Very funny,\" Levi says.</p>\n<p>He sips his coffee and it tastes burnt but it's warm so he doesn't mind. Petra leans forward.</p>\n<p>\"Who are you texting?\" she says.</p>\n<p>\"Nobody,\" Levi says, but that doesn't sound right anymore.</p>\n<p>Erwin isn't just nobody to him anymore. He's very much become somebody, and Levi doesn't remember when, or how. It sort of terrifies him. Levi downs the rest of his terrible coffee and when he his phone vibrates again, it's Erwin asking if he can pick him up tonight, and Levi hesitates before saying yes.</p>\n<p>\"You're quiet,\" Erwin says in the car.</p>\n<p>Levi shrugs, watches the streetlights blur out the window as they speed down the highway. \"Tired.\"</p>\n<p>When he gets to Erwin's, it's Levi who pulls them into the bedroom, Levi who tugs at Erwin's clothes until they fall useless to the floor. Erwin watches him, half-concerned, half-aroused. Levi feels desperate for it. He grabs Erwin's cock and it feels heavy in his head and he wants this back the way it was. They tumble back onto the bed, Levi rutting up against Erwin.</p>\n<p>\"Come on, daddy\" he says. \"Give it to me.\"</p>\n<p>Instead, Erwin nudges him onto his stomach and drags his hands down Levi's back. Levi waits with his cheek pressed into the pillow, and twists his hands into the bedding when Erwin spreads his cheeks and starts to eat him out, tongue dipping in to taste him, to test him. He feels like crawling away. Ewrin's hand touches his hip soothingly.</p>\n<p>\"It's all right,\" he says. \"Let daddy take care of you.\"</p>\n<p>\"This is seriously not hygienic.\" Erwin's tongue presses in harder. \"Jesus, fuck.\"</p>\n<p>He can feel Erwin smiling, and then he swirls his tongue, so close and intimate that Levi is shuddering with arousal. The hot flush of it starts at his cheeks and runs all the way down to his thighs. Erwin's tongue is relentless, and eventually he's made Levi wet enough to slip a finger in alongside his tongue. All Levi can do is push back against his face. Erwin feels like he's everywhere: in him, around him, on him, and Levi wants to cry because it's not the same as it was before. It's much different now. Levi wants to cry. Instead he comes with his toes curling and his face hidden. </p>\n<p align=\"center\">---</p>\n<p>The rest of the semester slips through his fingers without Levi even realizing. He's overloaded with work, and weekends are spent with Erwin, so when he gets the notice for cap and gown rental, it's a shock. Finals are in one week. Graduation is in two. Hanji is ecstatic about it, won't shut up about finally getting out of their university. Levi is just anxious. He feels uncertain about the future, about everything. Erwin's been spoiling him fucking rotten, much as he's loathe to admit it. He hands Levi cash like it's water, and Levi knows that's going to be ending very soon. This was always the plan: let Erwin take care of him until graduation, and then move on and start doing things for himself. This was the plan. It still is.</p>\n<p>Nothing really changed after he told Erwin he was graduating. He was still there nearly every weekend, still taking Erwin's money and his gifts, still sliding into his lap and whispering <em>daddy </em>in his ear just to feel the way Erwin tensed when he did so. They'd go out, sometimes, especially the when the weather got warmer. Erwin likes restaurants that overlooked the city, floor-to-ceiling windows that made Levi feel like he was falling when he looked out them. They went to a few coffee shops, lazy brunches on Sunday afternoons. Erwin would have his nose in the newspaper until Levi ran his foot up his calf, then Erwin's attention would be all his, and Levi liked it that way. Nothing really changed, but Levi always felt his graduation looming over him and exactly what that meant for this arrangement.</p>\n<p>He and Hanji pick their cap and gown up together that Friday and try them on as soon as they get back to the apartment, standing in their tiny bathroom together to admire themselves in the mirror.</p>\n<p>\"I can't believe this is happening,\" Hanji says.</p>\n<p>She twirls in the mirror, lifting her arms up, the fabric rustling. Levi's cap sits awkward on his head, nearly covers his eyes. He fiddles with it until it looks somewhat decent, but he still feels awkward in it, displaced. He can't believe it either. He's already got some interviews lined up after graduation. He might not get the jobs, but it's a start. He should feel happier about it all, but he doesn't feel much of anything.</p>\n<p>\"This gown is ugly,\" he says.</p>\n<p>Hanji snorts. \"Says you. I feel like I'm in Harry Potter.\"</p>\n<p>Levi pulls the gown over his head and hangs it up in his closet next to the coat Erwin bought him that it's now too warm wear. He shuts the closet door. It's now or never. Levi thinks about waiting until after graduation, but he knows that if he doesn't this now, it'll be Erwin who tosses him aside, and Levi sure as shit isn't going to let that happen. He texts Erwin and asks him to come over. He almost adds, <em>we need to talk</em>, but it sounds as stupid and dramatic as it reads, so he doesn't. Levi waits in his room, anxious until the moment Erwin calls to say he's outside.</p>\n<p align=\"center\">---</p>\n<p>He gets in Erwin's car and doesn't put his seatbelt on. He fidgets, and Erwin notices, because he puts the car and park and leans back against his seat.</p>\n<p>\"You're fidgeting,\" he says.</p>\n<p>Levi folds his hands into his lap.</p>\n<p>\"Not anymore.\"</p>\n<p>He hates initiating shit like this. Erwin is watching him earnestly and it's making Levi kind of hate himself. He wipes his hand on his pant's leg.</p>\n<p>\"You know I'm graduating,\" he says.</p>\n<p>Erwin nods. \"Yes.\"</p>\n<p>\"In less than two weeks.\"</p>\n<p>\"You must be excited.\"</p>\n<p>Levi swears under his breath. \"Yeah, well…shit, are you going to make me say it?\"</p>\n<p>\"Say what?\"</p>\n<p>\"Fine. You don't have to keep doing this.\"</p>\n<p>And Erwin looks genuinely, genuinely confused. \"This?\"</p>\n<p>\"Yeah, this.\" Levi gestures between them. \"Buying me shit. Taking care of me. Being my fucking sugar daddy. I'm graduating.\"</p>\n<p>\"So…\" Erwin trails off, prompting him.</p>\n<p>\"So this is ending, right?\"</p>\n<p>Erwin's eyes widen slightly. He looks surprised. Levi doesn't understand why he looks surprised. He shifts in his seat, the leather, mouth half-open, looking at a loss for once.</p>\n<p>\"Is that what you want?\" Erwin says eventually.</p>\n<p>\"What the hell does that mean? I know what this is—was—whatever,\" Levi says, and can't keep his voice down anymore. \"But it's ending. I'm going to take care of myself now, all right? So we're fucking useless to each other now.\"</p>\n<p>Erwin's body gets straighter, taller even though he's sitting.</p>\n<p>\"Is that what this is about?\" he says. \"Is that what you think?\"</p>\n<p>Levi realizes that he doesn't know. He doesn't fucking know, but he had a plan and Erwin is fucking ruining it.</p>\n<p>\"Yeah,\" he says.</p>\n<p>He opens the car door.</p>\n<p>\"Levi,\" Erwin says, voice firm enough that Levi pauses. \"You must know by now that I'm not doing this out of some sick perversion. I like you very much.\"</p>\n<p>Levi stares at the floor of the car because he can't look at Erwin right now.</p>\n<p>\"But you know this won't work,\" he says, forcing himself to ignore the last sentence. \"I'm always going to be in debt, for the rest of my fucking life, and what are you doing to do? Be my sugar daddy until your balls shrivel up and you die?\"</p>\n<p>\"I doubt my balls will shrivel.\"</p>\n<p>Levi wants to scream. He thought this would be easy, but Erwin is making it so hard.</p>\n<p>\"That's not the fucking point. The point is this won't work, okay? I'm just ending it before you do.\"</p>\n<p>\"<em>Levi</em>—\"</p>\n<p>Levi gets out of the car before Erwin can get another word in. He takes the stairs two at a time, heart caught in his throat, making it hard to breathe. Then he waits for Erwin to come after him. He takes stands outside his apartment door, but Erwin doesn't come, not five minutes after waiting, not even ten. Levi exhales once, and then goes inside.</p>\n<p align=\"center\">---</p>\n<p>He graduates. The ceremony is long and boring, but it does thrill Levi to walk across the stage and hear people clapping for him. He shakes the hand of the university dean. He finds Hanji after the ceremony and she hugs him tight, the both of them clutching their blank diplomas. It's warm and sunny out and everyone around them is dressed in their gowns and Levi is oddly reminded of a funeral. Hanji takes pictures and Levi humors her by being in them. The whole day feels dreamlike, something he imagined, but it's real. They hurry to return their gowns so they won't get charged, and leave after most of the traffic has dispersed to head back to the apartment and change.</p>\n<p>\"This calls for the ultimate celebration,\" Hanji says. \"Fancy dinner and drinks. My mom is buying. You're in, right?\"</p>\n<p>Levi undoes his dress shirt. \"Actually, I'm going to stay here. Also, your mom hates me.\"</p>\n<p>\"She doesn't hate you! She just thinks you're grumpy.\"</p>\n<p>\"Whatever. I'm staying. Thanks anyway.\"</p>\n<p>Hanji takes her glasses off and cleans them against her shirt. She goes silent the way she does before she says something Levi doesn't want her to.</p>\n<p>\"Are you going to see Erwin?\"</p>\n<p>\"No.\" Levi throws his shirt into the hamper and his heart goes tight at the sound of Erwin's name but he ignores it. \"I told you I stopped that shit.\"</p>\n<p>He looked for Erwin a few times during the ceremony, and even once after. He doesn't know why, there's no way he would have been there. And Levi ended it so it's not like it matters.</p>\n<p>The first few days after he ended it, things were weird. Levi felt listless, lonely, bitter. He was quick to anger, and that's how Hanji figured out that things had ended between them, though she was smart enough not to ask why. Levi went through the next week and a half on autopilot, ignoring the ache in his chest when he thought about Erwin, ignoring anything that reminded him of the man. He got more attached to Erwin than he planned, and it made him feel stupid. Levi fell right into it with him and it was too easy.</p>\n<p>\"I know,\" Hanji says. \"I just…well we should meet later, at least. To celebrate together.\"</p>\n<p>\"Yeah,\" Levi says. \"That's fine.\"</p>\n<p>He showers after Hanji leaves, enjoying the quiet of the apartment. He picks at leftovers from the fridge and then goes back to his room to grab his latest bill notice. Levi has enough money now to pay a bit more than the minimum. He wasn't an idiot when he had money left from Erwin, he put it into his bank account and let it pile up. He pulls his phone out and sits as his desk, listening to the computerized options before selecting payment, then waiting for a representative to pick up.</p>\n<p>\"Payment, how may I help you?\"</p>\n<p>\"I need to make a payment on a medical bill.\"</p>\n<p>\"Your name and ID number, please.\"</p>\n<p>Levi rattles them off, leaning back in his chair. After he gets a job, he figures he can start paying more, maybe get the bills covered by the time he's forty.</p>\n<p>\"There's no balance for you account, sir,\" the woman on the phone says.</p>\n<p>Levi stutters.</p>\n<p>\"What?\"</p>\n<p>\"The balance is zero, sir. The bill was paid in full just last week. Would you like to speak to a manager?\"</p>\n<p>Levi stares at the bill again, and all the zeroes following. At first he's just confused, thinks there's been some kind of mistake. Then he realizes there hasn't been one at all.</p>\n<p>\"No,\" he says. \"No. Thank you.\"</p>\n<p>He hangs up and his phone slips out of his hand and clatters to the floor.</p>\n<p>\"Shit,\" he says into the silence. \"Shit.\"</p>\n<p align=\"center\">---</p>\n<p>It takes him an hour by bus to get to Erwin's and Levi's leg is shaking the whole time. He's full of a kind of energy he hasn't ever had before and can't really place. He's not mad. He's not happy. He just is and needs to talk to Erwin. Levi steps into his building and the doorman nods at him.  </p>\n<p>\"I'm here to see Erwin Smith.\"</p>\n<p>\"Levi,\" the man says. \"Haven't seen you for a few weeks. Go on up.\"</p>\n<p>He bypasses the elevator and takes the stairs instead, running up them until his leg starts to hurt and he's breathing heavy, but by that time he's reached Erwin's floor. Levi knocks on his door, jittery as he waits, wondering now if Erwin isn't even home. He knocks again. The door opens, and there's Erwin, face open with shock. </p>\n<p>\"Levi,\" he says.</p>\n<p>\"Are you going to let me in?\"</p>\n<p>Erwin opens the door the rest of the way, wordless. Levi steps inside, inhaling the smell of Erwin's apartment once more, the familiarity of it all. He's missed this place. He's missed Erwin. He stands stupid in the middle of the foyer, hands sweaty and still against his jeans. There are empty take out boxes on Erwin's counter.</p>\n<p>\"Your apartment is kind of messy,\" he says.</p>\n<p>\"Levi…\"</p>\n<p>He doesn't know why it's so hard to talk about all of a sudden. He stares at the take out boxes.</p>\n<p>\"You paid off my surgery.\"</p>\n<p>\"Yes,\" Erwin says. </p>\n<p>Levi turns around, looks at Erwin's crisp shirt, his five o'clock shadow.</p>\n<p>\"How the hell did you do that?\"</p>\n<p>\"I manage the company in charge of collecting your money. It wasn't hard.\"</p>\n<p>Levi's mind is spinning.</p>\n<p>\"But why the hell did you do that? What the fuck were you thinking?\"</p>\n<p>\"I was thinking that you could use a fresh start. No debts.\"</p>\n<p>Levi opens his mouth and flounders.</p>\n<p>\"But I owed—\"</p>\n<p>\"I know how much you owed,\" Erwin says.</p>\n<p>Levi doesn't know what to say. He doesn't have anything to say, not anything that wouldn't sound selfish or stupid.</p>\n<p>\"Say something,\" Erwin says.</p>\n<p>\"I don't know what to say.\" Levi shifts his weight. He crosses his arms. He uncrosses them. \"I don't get why you did it. I don't get it—were you trying to get me back?\"</p>\n<p>\"Oh Levi,\" Erwin says, like he's just broken his heart. \"No. I was trying to set you free.\"</p>\n<p>It sort of punches Levi in the gut, the way Erwin says it, the way he just tells him why he did it without hiding anything. He took away Levi's dependence on him. He put him in control. Levi exhales for the first time since he walked into his apartment. Erwin stands straighter, and it makes Levi feel younger and smaller than he already is. Maybe it wasn't ever about the money for Erwin. Maybe he actually likes Levi, and maybe Levi actually likes him, and he made the whole thing a lot more complicated than it ever had to be.</p>\n<p>Levi is still trying to figure out who's been in control when it occurs to him that neither of them had ever been. They crashed right into each other without realizing it.</p>\n<p>\"I was never going to end it,\" Erwin says, and Levi inhales. \"But you don't have to stay. You don't owe me anything.\"</p>\n<p>\"Yeah,\" Levi says. \"I know that. But I want to stay.\"</p>\n<p>He grabs Erwin by the collar of his shirt and pulls him down to kiss him. Erwin has coffee breath and Levi is standing on the tips of his toes and he doesn't give a shit. He's missed Erwin. He likes him, likes him a lot more than he realized. They go a little crazy with it, kissing mouths and jaws and necks. Levi pulls away only because he can't breathe.</p>\n<p>\"Shit,\" he says. \"Shit. I'm not saying sorry, okay?\"</p>\n<p>\"Okay.\"</p>\n<p>\"Okay.\" Levi drops his head against Erwin's chest, exhausted suddenly. \"But I'm sorry,\" he says, nearly whispers it.</p>\n<p>\"I know,\" Erwin says.</p>\n<p>He hugs Levi, and the intimacy is no longer startling. They stay like that for a long time before Erwin finally pulls back.</p>\n<p>\"I'm going to miss you calling me daddy.\"</p>\n<p>Levi shoves him, then grabs him by the shirt to pull him back. \"Who says I'm going to stop?\"</p>\n<p>They kiss again, slower, aware that they have all the time they want now. They aren't counting down to anything. They walk to Erwin's room together, arms tangled and mouths connected.</p>\n<p align=\"center\">---</p>\n<p>He wakes up later to Erwin's voice. \"Still planning to get a job?\"</p>\n<p>Erwin mouths the words into his back. He's got his hands on Levi's hips, thumbs pressing into his back. The sheets are still warm from sex and Levi is pleasantly tired. He hums.</p>\n<p>\"Yeah.\"</p>\n<p>\"What will you do?\" Erwin rolls over to face him, propped up on his elbow. \"My company has a few paid internships opening up in the fall.\"</p>\n<p>\"You want to be my boss?\" Levi says. \"Fuck that.\"</p>\n<p>Erwin's laughter shakes the mattress. \"What will you do, then?\"</p>\n<p>Levi scoots until he's pressed against Erwin, chest to chest, hand tucked under his head.</p>\n<p>\"I was thinking about applying to coach soccer.\"</p>\n<p>There's silence, then Erwin's hand runs through his hair, affectionate.</p>\n<p>\"What a brilliant idea,\" he says.</p>"
}