{
  "id": "1066271",
  "url": "https://archiveofourown.org/works/1066271?view_full_work=true",
  "author": [
    "Rena"
  ],
  "title": "but monsters are always hungry, darling",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Teen Wolf (TV)"
  ],
  "relationships": [
    "Derek Hale/Stiles Stilinski"
  ],
  "characters": [
    "Derek Hale",
    "Stiles Stilinski",
    "Lydia Martin",
    "Sheriff Stilinski"
  ],
  "additional_tags": [
    "Alternate Universe",
    "Alternate Universe - Werewolves Are Known",
    "Barebacking",
    "hooker!Derek",
    "Plot What Plot/Porn Without Plot",
    "Or Is It?",
    "maybe there's a little plot",
    "mentions of Xenophobia"
  ],
  "language": "English",
  "series": "",
  "published": "2013-12-01",
  "completed": null,
  "words": "7,071",
  "chapters": "1/1",
  "comments": "164",
  "kudos": "12,919",
  "bookmarks": "1,817",
  "hits": "158,674",
  "summary": "<p>\"I just...I just want someone to fuck me,” he blurts out, flailing his hands around. “I mean, like, really fuck me. Not any of this wishy-washy stuff, but someone with strength and stamina who’ll actually, honestly, fuck me, hold me down and fuck me so hard I can still feel it the next day.”</p>\n<p>“So, essentially, you want a werewolf,” Lydia deduces.</p>\n<p>“Where would I even find a werewolf willing to fuck a human?” Stiles demurs. Werewolves mostly keep to themselves. Stiles doesn’t blame them.</p>\n<p>“Oh for Christ’s sake.” Lydia levels him with a hard look. “You find them where you find everyone you can purchase the fulfillment of your every sexual fantasy from. Find a damn hooker.”</p>",
  "notes": "",
  "text": "<p dir=\"ltr\"> </p>\n<p> </p>\n<p dir=\"ltr\">“Ugh,” Stiles says as he flops face first onto the couch and buries his head in the giant fluffy pillow Lydia insisted on buying.</p>\n<p dir=\"ltr\">Speaking of Lydia, he can almost hear her rolling her eyes at him from across the room. It’s a special skill she has.</p>\n<p dir=\"ltr\">“Only you could be so gloomy after getting laid,” she says, and whoa, that is definitely her judgy voice. He hates it when her judgy voice is directed at him, which happens more often than he’d like. Don’t get him wrong, Lydia’s ability to judge essentially everything everyone does is kind of terrifyingly hot, but only when her judgmental looks aren’t directed at him. It always makes him feel like he’s fifteen and gangly and awkward again, back before they became friends and she had every reason to look down on him.</p>\n<p dir=\"ltr\">“Stop judging me,” he whines. “You don’t understand my pain.”</p>\n<p dir=\"ltr\">“Since I know you’re not talking about the literal pain resulting from taking it up your back door, the answer is no.” Lydia swats him over the head with another throw pillow. “The day you stop being a drama queen may be the day I’ll stop judging you. Until then, I think it’s my duty as one of your best friends to tell you when you’re being ridiculous.”</p>\n<p dir=\"ltr\">“I’m not being ridiculous. I’m disillusioned and experiencing a crisis. It’s your duty to support me and let me cry into a few bottles of wine and a bucket of ice cream, not make me feel even worse.”</p>\n<p dir=\"ltr\">“It can’t have been that bad,” Lydia reasons somewhat incredulously. Understandably so; he was out for hours last night, in a hot dude’s bed, doing decidedly x-rated things. For all intents and purposes, he should be glowing, not glowering.</p>\n<p dir=\"ltr\">Stiles sighs and twists around on the couch, so he’s lying half on his side, half on his back, and tucks his legs closer to his body to make room for Lydia. “It was, though. Well, no, it wasn’t bad, exactly,” he relents, “it just wasn’t-”</p>\n<p dir=\"ltr\">“Satisfactory? Mind-blowing? What you were looking for?” Lydia offers.</p>\n<p dir=\"ltr\">“All of the above.”</p>\n<p dir=\"ltr\">“Stiles.” Lydia sighs and pats his leg, the way she always does when she’s going to hit him with a sympathetic but stern lecture. “Not every time you have sex is going to be equally good for you, especially with one night stands. It takes time for people to get used to each other’s bodies, to get attuned to one another. Sometimes you hit a jackpot - more often, you don’t. And don’t get me wrong, it’s not a bad thing, but you seem to be one of the people who are extremely hard to satisfy.”</p>\n<p dir=\"ltr\">“Me?” Stiles scoffs. “Are you kidding me? I’m easy. I’m so fucking easy, and it really doesn’t take much to get me off.”</p>\n<p dir=\"ltr\">“That’s not what I was talking about and you know it.”</p>\n<p dir=\"ltr\">And strangely enough, he does. The thing is, Stiles likes sex. He likes sex a lot, and therefore he’s been having as much sex as he could get. And it’s usually good, and he always gets off, it’s just...not enough. It leaves him feeling coiled up under his skin and sort of empty.</p>\n<p dir=\"ltr\">“Look, I’m not trying to butt into your personal life and tell you what to do here, Stiles, but you’re the kind of guy who gets very attached and commits. Are you sure one night stands are the way to go for you?”</p>\n<p dir=\"ltr\">Stiles almost scoffs at her concern, because the great Lydia Martin got it exactly the wrong way around. “I don’t want slow, gentle feeling sex with candlelight, Lydia,” he says. “Actually, that’s the opposite of what I want.”</p>\n<p dir=\"ltr\">Lydia raises one perfectly plucked eyebrow. “Then what do you want?”</p>\n<p dir=\"ltr\">Stiles bites his lips. It’s not that he’s ashamed of his kinks; he’s a big supporter of accepting everyone and everything and letting people do their thing. It’s not even a particularly weird or unusual fantasy, it’s just that he doesn’t usually talk about his bedroom preferences with anyone, not even with Scott. As it turns out, it’s kind of uncomfortable to hear about stuff that makes you picture your best friend doing the dirty in several different positions, so for the sake of their sanity, they’ve stopped giving each other the details.</p>\n<p dir=\"ltr\">But this is Lydia, not Scott, and he doubts he can say anything that could possibly shock her. “I just...I just want someone to fuck me,” he blurts out, flailing his hands around. “I mean, like, really fuck me. Not any of this wishy-washy stuff, but someone with strength and stamina who’ll actually, honestly, fuck me, hold me down and fuck me so hard I can still feel it the next day.”</p>\n<p dir=\"ltr\">“So, essentially, you want a werewolf,” Lydia deduces, cool as a cucumber, more interested in inspecting her nails than dealing with Stiles’ drama. It’s strangely reassuring that she pretends she isn’t giving him her full attention; it tells him that she doesn’t think he’s weird for wanting to be dominated.</p>\n<p dir=\"ltr\">The solution she offers is way too simplistic, though. It doesn’t work like that.</p>\n<p dir=\"ltr\">She must sense his scepticism, because she turns towards him again. “What?” she asks. “Werewolves are insanely good looking, they’re stronger than humans, they have more stamina and from my experience, they generally enjoy being on top and getting a little rough. You find yourself a werewolf who’s willing to fuck you, you’ll have a greater chance of getting what you want than with any run-off-the-mill guy you meet in a bar. Get it out of your system for a while so you can enjoy sex more in general, then go back when you need a hard fuck again.”</p>\n<p dir=\"ltr\">“Isn’t that speciest?” Stiles wonders.</p>\n<p dir=\"ltr\">Lydia’s ten billion times less prejudiced than the rest of their society, but Stiles is different. He’s never really seen the difference between werewolves and humans. Well, no, he has noticed differences, obviously, what with his best friend being a werewolf and everything, but he doesn’t differentiate, and he doesn’t think humans are better than werewolves. Most people would be appalled by Lydia’s suggestion; all those who consider werewolves to be nothing better than animals, all those who’re afraid of them, all those who’re already looking down on Stiles for associating with werewolves.  </p>\n<p dir=\"ltr\">Then, of course, there’s the other part of the population who pretend they hate werewolves but secretly get off on fucking them, using them to boost their ego, feeling safe and invincible in the knowledge that the Werewolf Control Act prevents the werewolves from hurting them. Stiles knows from what his father tells him that there’s also plenty of workplace harassment going on that the werewolves can’t really fight against. As if it doesn’t suck enough that hardly anyone is willing to give them a job in the first place, regardless of how smart and qualified and competent they are.</p>\n<p dir=\"ltr\">It just….it just sucks, and the thought of sleeping with a werewolf makes Stiles’ stomach clench uncomfortably. Not because he’d be adverse to it, fuck no, but the thought of using someone like this and then drop them like a hot potato leaves a bitter taste in his mouth. Obviously, that’s exactly what he does with all his one night stands, but that’s different. Werewolves are being exploited enough as it is.</p>\n<p dir=\"ltr\">But fuck if the thought doesn’t turn him on.</p>\n<p dir=\"ltr\">Lydia flicks her hair over her shoulder. “I’m listing their assets, and I speak from experience. Talk about stereotypes all you want, some of them are true. If you don’t want to do it, fine with me, but don’t come running later to cry on my shoulder. Either take my advice or leave it.”</p>\n<p dir=\"ltr\">“Where would I even find a werewolf willing to fuck a human?” Stiles demurs. Werewolves mostly keep to themselves. Stiles doesn’t blame them.</p>\n<p dir=\"ltr\">“Oh for Christ’s sake.” Lydia levels him with a hard look. “You find them where you find everyone you can purchase the fulfillment of your every sexual fantasy from. Find a damn hooker.”</p>\n<p dir=\"ltr\">Stiles nearly falls off the couch.</p>\n<p> </p>\n<p></p>\n<p>\n<strong>∞</strong>\n</p>\n<p dir=\"ltr\">Derek exhales slowly and watches the steamy cloud dissolve slowly into the night air, trying to ignore the cold that emanates from the stone wall he’s leaning against and seeps through his leather jacket. He doesn’t mind the cold, usually, isn’t as susceptible to it as humans, but it’s freezing cold and the weather report said it would start snowing during the night, so a warm coat wouldn’t go amiss. Or some gloves, at the very least. Turns out stuffing his hands into the cuffs of his jackets doesn’t actually do much to keep them warm.</p>\n<p dir=\"ltr\">He glares at the alley leading to the back entrance of the shady building he usually picks his customer up at. The guy he’s sharing his spot with dragged his john into the dark shadows about ten minutes ago because you can give more blowjobs in a row if you don’t bother to go to a hotel room, as he’d announced cheerfully, and now the unmistakable and enthusiastic sounds of people having sex reach his ears and grate on his nerves.</p>\n<p dir=\"ltr\">Derek needs to get away from here. Not only because he needs to get out of the cold before he freezes to the ground, but also because he seriously needs a paying customer if he wants to pay the rent in time. And, well, also because he feels like punching a hole into the brick wall on the small chance that it reminds the others to be a little quieter.</p>\n<p dir=\"ltr\">The moans increase in pitch and frequency, become so loud that he almost misses the quick, skip-race heartbeat steadily drawing closer. Nervous, Derek thinks. Twitchy. A first timer. Not his usual clientele, but he can make do. Probably.</p>\n<p dir=\"ltr\">He’s better standing in dark corners and looking broody. It attracts the kind of men who get off on the thought that he’s dangerous, could rip them apart with a single blow. The kind of men who boost their egos thinking they’re taming a wild beast. Derek hates them, hates their taunting and their proclivity for showing off, but they pay good money and he doesn’t need to play a role. Doesn’t really have to pretend he likes it, doesn’t have to play nice and sweet.</p>\n<p dir=\"ltr\">He once smiled at a younger man, obviously a virgin, and the boy broke out in cold sweat and ran the other way. The guy he shares his corner with (he’s never bothered to learn his name, and the guy hasn’t offered) had laughed at him for five minutes, taken the man by the hand and led him away. He looks gentle and trustworthy, scores a lot with johns who like to pretend to be brave by fucking werewolves but are secretly scared of them, looking for the most harmless looking one.</p>\n<p dir=\"ltr\">His colleague has a lot more clients than Derek does.</p>\n<p dir=\"ltr\">Derek can’t afford to let this one get away. He knows how he looks, knows it’s attractive to most people who come looking for a quick fuck. He’ll just have to let that work in his favour more, be a little less menacing, maybe. Which is easier said than done.</p>\n<p dir=\"ltr\">About half a minute later, he sees the guy with the stuttering heartbeat round the corner. It’s definitely not his usual kind of customer; he’s tall and lanky, his hair is sticking up in all directions as if he’d just stuck his finger into a power outlet, and he’s wearing loose-fitted jeans and plaid. A student, most likely, not the arrogant, self-assured businessman who usually comes around here searching for a quick fuck. The nervous energy the guy exudes is enough to make Derek feel twitchy, too, though not necessarily in a bad way. The man is attractive, has nice eyes and an obscene mouth that makes Derek want to find out what sounds he can draw from it.</p>\n<p dir=\"ltr\">He pushes himself away from the wall and saunters into the light before speaking. He’s learnt the hard way that lurking in corners may be alluring for some, but scares away most people. “Looking for company?” he asks, refrains from adding a cheesy pick-up line. They never work for him anyway.</p>\n<p dir=\"ltr\">The young man startles a little, still, flails as he regains his balance. “Whoa.”</p>\n<p dir=\"ltr\">Derek can’t help but raise an eyebrow. “You okay?”</p>\n<p dir=\"ltr\">Funnily enough, that seems to do it. The man’s heartbeat spikes, and the heavy scent of arousal fills the air around him, the faint traces of anxiety and fear disappearing completely. “Yeah,” he breathes, “just -”</p>\n<p dir=\"ltr\">“Never done this before?”</p>\n<p dir=\"ltr\">The man grimaces. “Is it that obvious?”</p>\n<p dir=\"ltr\">“Yeah.”</p>\n<p dir=\"ltr\">“Awesome.” He sighs and tilts his head back to look at the sky. “Leave it to me to embarrass myself in front of every living creature in the world.”</p>\n<p dir=\"ltr\">Derek forces himself to not look at the exposed skin of his neck. “I don’t mind.”</p>\n<p dir=\"ltr\">“You don’t mind that I embarrass myself or that this is my first time picking up a hooker?”</p>\n<p dir=\"ltr\">Derek smirks. “Either. Both. I don’t have a policy against letting awkward virgins fuck me.”</p>\n<p dir=\"ltr\">“Excuse me, I’m not a virgin,” the man says, affronted. “I’m just new to the whole prostitution thing.” He gestures around wildly and then draws in a deep breath. “And I don’t want to fuck you.”</p>\n<p dir=\"ltr\">Derek bites his tongue. Shit. Of course he’s fucked up again. He should never be allowed to open his fucking mouth if he ends up driving everyone away. He might as well just walk away now and try to find a different customer. Or maybe just call it a night, what with the shitty luck he's had today. Maybe invest some money he doesn’t have into a How To Talk To People 101 so he can get rid of his habit of accidentally insulting potential paying customers.</p>\n<p dir=\"ltr\">“I want you to fuck me.”</p>\n<p dir=\"ltr\">The words are so quiet, stumbling out of the man’s mouth, that he almost misses them. He snaps his head up. “What?” he asks.</p>\n<p dir=\"ltr\">“I said,” the man continues, clears his throat weakly, “I want you to fuck me.”</p>\n<p dir=\"ltr\">Derek maybe loses control over his jaw a little.</p>\n<p dir=\"ltr\">“Is that….is that gonna be a problem?” He starts twitching nervously again, scratches his chin and rakes his fingers through his hair like he’s suddenly ashamed of asking. “I mean, do you not -”</p>\n<p dir=\"ltr\">“No,” Derek says quickly, voice much more raw and shaky than he intends it to be. “I mean yes,” he corrects himself when the man’s face falls. “I mean, it’s not a problem. It just took me by surprise, is all. That’s not what people usually ask for.”</p>\n<p dir=\"ltr\">“Oh.” He breathes a sigh in relief. Then his gaze turns decidedly curious. “What do they usually ask for?”</p>\n<p dir=\"ltr\">“To fuck me,” Derek says bluntly. There’s no point in beating around the bush. Interestingly enough, while it does spark the man’s interest, it’s nothing compared to the wave of arousal that hit him earlier when they talked about Derek fucking him.</p>\n<p dir=\"ltr\">“Right.” He nods. “But it’s not gonna -”</p>\n<p dir=\"ltr\">“I already said it wasn’t a problem,” Derek interrupts him. Luckily, he really doesn’t think it will be. When he’s getting fucked, it doesn’t matter much whether he is enjoying it or not. It’s different when he’s on top, obviously. That hasn’t happened very often, and only ever with women, but they hardly ever find their way into these districts. Women who pay for sex frequent different circles, search more respectable and safe ways to get what they want. Derek normally avoids the ones that do look for hookers on the streets; they’re not necessarily nicer than the men he deals with on a daily basis, and faking it is much harder. He’s tired of imagining other people below him just to be able to give them what they want; the effort isn’t worth it.</p>\n<p dir=\"ltr\">He doesn’t think he’ll have to fake it with this guy. He’s attractive enough, he doesn’t seem like a douchebag, and he smells really fucking good. Fucking him won’t be a hardship. He may just have hit a jackpot, if he’s not dealing with a broke college student.</p>\n<p dir=\"ltr\">“Can you pay?” he asks.</p>\n<p dir=\"ltr\">“I - yeah, good thinking. I should probably ask how much.”</p>\n<p dir=\"ltr\">Derek is tempted to give a sum higher than he usually does, but whatever the guy does for a living, it certainly hasn’t made him rich, and the regular money is better than nothing. So he actually cuts it down by ten quid, and the man nods.</p>\n<p dir=\"ltr\">“Yeah, okay. That’s - uhm….sorry, I don’t know how to do this. Which you already know. So...where do we do this? Oh, I’m Stiles by the way.”</p>\n<p dir=\"ltr\">He actually extends his hand for Derek to shake. Derek gives him a look that hopefully doesn’t say ‘you’re the weirdest person I’ve ever met’ and, after a moment of hesitation, takes it. “Derek,” he says.</p>\n<p dir=\"ltr\">“Is that a fake name?” Stiles frowns a little, worries his lip with his teeth.</p>\n<p dir=\"ltr\">“You ask me that?” Derek snorts. “Stiles?”</p>\n<p dir=\"ltr\">“That actually is my name, though.”</p>\n<p dir=\"ltr\">There’s no uptick in his heartbeat, no sign that he’s lying. Derek nods. “Derek is my real name, too.” He turns and points further down the street. “There’s a little motel about two blocks from here. Nothing fancy but fairly clean, they don’t ask questions and don’t mind renting rooms by the hour.”</p>\n<p dir=\"ltr\">“Well then,” Stiles says, shoving his hands into his pockets, “lead the way?”</p>\n<p dir=\"ltr\">Derek does. It’s not until they’ve checked into the motel and closed the door behind them that they speak again.</p>\n<p dir=\"ltr\">“Okay,” Stiles says. “I think we should probably lay down some ground rules. No scratching and biting that draws blood. I mean, that should be obvious.”</p>\n<p dir=\"ltr\">“Yes,” Derek says drily. “Since I don’t intent to go to jail, that’s a given.”</p>\n<p dir=\"ltr\">“Right. But other than that, I don’t really mind if you get a little rough.” He draws himself up to stand a little taller, a little more determined. “Actually, I want you to get rough. I’m not super into spanking, and I do want to be still able to walk out of here after, but I really just want you to fuck me hard. Don’t treat me as if I’m gonna break. Can you do that?”</p>\n<p dir=\"ltr\">Derek swallows down the lump in his throat. “Yes, I can definitely do that.”</p>\n<p dir=\"ltr\">Stiles grins. “Anything you wanna add? Like, stuff I shouldn’t do, no kissing -”</p>\n<p dir=\"ltr\">“This isn’t Pretty Woman, Stiles.” Derek rolls his eyes, grabs him by the arm and yanks him forward until his body is pressed flush against Derek’s.</p>\n<p dir=\"ltr\">“Shame, I’d love to have as much money as the dude Richard Gere plays in that mo-hng,” Stiles’ words are swallowed by Derek’s lips and quickly turn into a shameless moan. Stiles is young and eager, and incredibly responsive to even the slightest touches, and that makes it all that much easier. When his lips fall open Derek takes the opportunity to lick into his mouth and run his tongue along his teeth, lets himself enjoy the warm-slick slide of tongues against each other.</p>\n<p dir=\"ltr\">Stiles’ hands are already tugging determinedly at his leather jacket and Derek draws back a little to shrug it off and throw it across the room, kicking his shoes off at the same time. When he straightens again, Stiles has already gotten rid of his jacket as well and is making grabby hands at Derek.</p>\n<p dir=\"ltr\">Derek snorts at the childish behaviour. “You’re ridiculous, you know that?” he asks, pulling his henley over his head as he speaks.</p>\n<p dir=\"ltr\">“I’d scold you for talking to your client like that, but I think you make up for it with that torso, I mean, holy shit,” Stiles says, licking his lips and staring at his abs.</p>\n<p dir=\"ltr\">Derek grins, kisses him again and walks forward. Stiles moves with him until his knees hit the edge of the bed, and then it only takes a little push for him to fall backwards onto the covers. Derek makes quick work of Stiles’ shoes before following him onto the bed and covering his lithe body with his own. Stiles takes it as a blanket permission to get his hands and his mouth all over the parts of Derek’s body he can reach, fingers digging into his skin as Derek grinds his hips down. Derek shoves his hands under his shirts, urges Stiles to take them off because really, he’s still wearing too many layers, and when the clothes have finally fallen uselessly to the ground he does what he’s wanted to do since Stiles first came up to him, gets his mouth on the pale flesh of Stiles’ neck and bites down with blunt teeth, sucks at the skin until a dark bruise begins to form.</p>\n<p dir=\"ltr\">Stiles stiffens minutely under him, and for a second Derek fears he’s gone too far, but then he lets out a shaky moan and arches underneath him, his hands sneaking down to the fly of Derek’s jeans and fumbling with the button. “Fuck,” he swears, “fuck, Derek, off, take them off.”</p>\n<p dir=\"ltr\">Derek’s hands are shaking a little, too, when he pushes off his jeans and then Stiles’. Undressing, he thinks idly, is that much easier when you’re calm and composed and not actually into what’s happening. But he is, very much so. It’s been a long time since he had sex with someone he enjoyed it with, but his body remembers the steps, burns up under the trail Stiles’ hands leave on him. It helps that Stiles is into it, too, unabashedly; it’s almost more of a turn on than his touch is.</p>\n<p dir=\"ltr\">The slide of their erections against each other makes Stiles actually mewl. “Fuck, Derek, I need you to fuck me, like, right now.”</p>\n<p dir=\"ltr\">“Not quite yet,” Derek says lowly and flips him over.</p>\n<p dir=\"ltr\">“Nonono, this is the opposite of what I - holy shit,” Stiles cries out as Derek licks a wet stripe over his hole. “Oh my God.” He doesn’t say much more as Derek begins to rim him in earnest, gets the tip of his tongue inside before drawing back and doing it again. Soon, Stiles is reduced to a shaking quivering mess fisting his hands into the sheets. “You’re so lucky werewolves can’t catch anything,” he breathes. “Whatever would you do with that kink? Fuck, do that again, get your tongue deeper, fuck.”</p>\n<p dir=\"ltr\">“Thought you wanted me to hold you down and fuck you,” Derek says, grinning, and shoves two fingers inside knuckle deep.</p>\n<p dir=\"ltr\">“Yeah,” Stiles breathes, “I really want that, too.”</p>\n<p dir=\"ltr\">“Can’t decide?” Derek mocks, licks from the tip to the base of Stiles’ cock before sucking it into his mouth.</p>\n<p dir=\"ltr\">“Fucking - unfair,” Stiles pants. “How am I supposed to decide when I want you to do all the things to me?”</p>\n<p dir=\"ltr\">Derek pulls off him again, kisses and licks his way up Stiles’ back before whispering into his ear. “All the things?”</p>\n<p dir=\"ltr\">“All of them,” Stiles confirms, wiggling his ass against Derek’s groin. This time it’s Derek who has to bite his lip to keep down his moan when his dick slides into the crease between Stiles’ cheeks, catches a little at the rim of his hole. “This is taking a direction I approve of.”</p>\n<p dir=\"ltr\">“I bet,” Derek murmurs, rakes his fingers through Stiles’ hair. “How would you like me fucking your pretty little mouth first?”</p>\n<p dir=\"ltr\">Stiles reaction is instantaneous. His eyes widen almost comically, and then he scrambles to turn around and lie on his back, and it only takes him a second to get his hands behind Derek’s thighs and drag him forwards until he’s essentially sitting on his chest, his dick just inches from Stiles’ face. “Like this?” he asks. “You sure?” It’s not the most comfortable position to give a blowjob in, but Stiles seems ecstatic.</p>\n<p dir=\"ltr\">“Absolutely,” Stiles says, already drawing his head up to mouth at him. “One hundred percent.” He can’t reach all of Derek yet and he makes a face as if it physically hurts him so Derek inches closer, brings his thumb to the corner of Stiles’ mouth. It falls open easily under a bit of pressure, and all of Derek’s reservations fly out the window.</p>\n<p dir=\"ltr\">“That’s it,” he murmurs. “Open your mouth for me.” He guides himself in, slowly at first and only a little because he doesn’t want to choke Stiles but Stiles just brings his hands up to his ass and pulls him forward a little more and gets his hand over the part he cannot fit into his mouth, makes encouraging noises until Derek starts to move his hips and fuck his mouth.</p>\n<p dir=\"ltr\">It’s warm and wet and perfect until Derek realises that he’s a hooker and he’s not supposed to be on the receiving end of blowjobs. Sure, Stiles seems to be enjoying it a lot, and what gets his johns off is always fair game, but Derek is maybe enjoying it a little too much. He’s never had a problem with getting emotional during his tricks, but this is starting to feel less like a job and more like an actual hook-up between equals. That’s not what they are, and it’s dangerous for him to let himself believe it even for a second.</p>\n<p dir=\"ltr\">“Turn around,” he orders, climbing off the bed to search the pockets of his jeans for lube and condoms.  </p>\n<p dir=\"ltr\">“I don’t think we need those,” Stiles remarks from where he’s lazily stretching out on the bed, watching him. “I know you can’t carry anything, remember?”</p>\n<p dir=\"ltr\">Derek raises his eyebrows skeptically. “You wanna clean my come out of your ass? Be my guest, I’m not the one dealing with the mess.”</p>\n<p dir=\"ltr\">“I think I can deal,” Stiles murmurs.</p>\n<p dir=\"ltr\">Derek jams the square foil back into the pocket but takes the lube, because even if Stiles really wants it rough there’s no way he’s gonna fuck a human with nothing but spit to ease the way. He slicks himself up on the way back to the bed, watches Stiles watching him with hungry, earnest eyes. Stiles pushes himself up on his elbows when Derek kneels down behind him, shivers when he pressed close and drapes himself over his back.</p>\n<p dir=\"ltr\">“So, how do you want this?” Derek asks. “Still going for hard and fast?”</p>\n<p dir=\"ltr\">“Yes.” Stiles grins. “Take me, Sir, take me hard.”</p>\n<p dir=\"ltr\">Derek stares. “I can’t believe you’re asking me to fuck you by quoting Firefly.”</p>\n<p dir=\"ltr\">“Fine, fine, you don’t like pop culture references in bed, I get it,” Stiles huffs. “Want me to rephrase?” He angles his head a little, gets his mouth directly against Derek’s ear. “I want you to fuck me as hard as you can.”</p>\n<p dir=\"ltr\">Derek groans, presses his lips to Stiles’s shoulders to keep himself from just pushing forward and doing exactly that. “Think you can take it?”</p>\n<p dir=\"ltr\">“Didn’t I tell you not to treat me as if I’m breakable?” Stiles counters. “If you ask me if I’m sure one more time I’m gonna punch you in the head. Message received?”</p>\n<p dir=\"ltr\">“Loud and clear.”</p>\n<p dir=\"ltr\">Derek lines up, then, and pushes inside with a single, deep thrust, revels in the way Stiles whines and braces his forehead on his elbow, breathes in deep as he clenches around Derek’s cock. He stills his movements, planning on waiting for Stiles to adjust to the intrusion, but Stiles is having none of it. He starts rolling his hips practically the moment Derek bottoms out, fucks himself back on Derek’s dick. It’s obscene, and Derek can’t help the groan that escapes his lips upon seeing the way Stiles moves, the way he slides in and out of Stiles’ body. He could get off on only this, he thinks; he could ignore his instincts to hold Stiles down and claim him, just because he’s curious to see what else Stiles can do, in what ways he could use Derek to get himself off. He seems to be enjoying himself just fine even with Derek only being a silent spectator.</p>\n<p dir=\"ltr\">Derek hates being used, hates being treated like a toy without feelings, a means to get off and nothing more, but watching Stiles like this is fascinating. He doesn’t know what makes the difference; maybe it’s the way Stiles doesn’t really treat him like a prostitute, the way he makes it seem like he’s unabashedly into Derek, not only his body and the idea of fucking someone dangerous.</p>\n<p dir=\"ltr\">Maybe it’s just the fact that Derek is really into everything Stiles does.</p>\n<p dir=\"ltr\">Stiles turning his head to throw a dirty look at Derek jolts him out of his reverie. “Do you need a written invitation to get with the programme or are you gonna continue to make me do all the work?” he asks. “Sex should involve two participating parties, and you’re not participating nearly enough for my ta-hmpf.” His words are muffled by the sheets when Derek splays one of his hands between his shoulder blades and pushes his upper body down, curls his other around his hipbones and snaps his own hips forward sharply.</p>\n<p dir=\"ltr\">Stiles cries out, so Derek does it again, and again, increases the pace until Stiles is a shaking, quivering mess beneath him, a string of mostly nonsensical and unintelligible encouragements falling from his lips. Derek can maybe make out one out of five of the garbled sounds leaving his mouth, but Stiles repeats some of them so often they cannot be misinterpreted, like fuck, and Derek, and yes, yes, faster, and fuck me harder, come on.</p>\n<p dir=\"ltr\">Stiles tries moving again, rocking his hips back in an attempt to turn their rhythm into something even rougher, and Derek can tell he’s getting desperate to get off when he pulls one arm out from under his head and reaches down to touch himself.</p>\n<p dir=\"ltr\">Derek catches his hand before he can wrap it around his erection. “No,” he growls lowly, threateningly, yanks Stiles’s hand away and grabs him by the scruff of his neck with his other hand, uses it to pin him down. “You don’t get to touch yourself. You hear me?” He leans down to drape himself over Stiles’ back, breathes directly into his ear. “You wanted me to hold you down and fuck your brains out, so you will lie there like a good boy and take it. I’m the only one who gets to touch you, but I won’t even need to, will I? Just look at you. You’re so greedy for my cock, begging to be fucked. I bet I can make you come without jerking you off, don’t you think? You’re gonna be good for me, do as I say?”</p>\n<p dir=\"ltr\">“Fuck,” Stiles gasps out. “Fuck, yes, just, please, Derek, please -”</p>\n<p dir=\"ltr\">Derek lets his hand slide around Stiles’ neck, urges him to turn his face to the side to capture his mouth in a heated kiss, licking the pleas right off his tongue. Stiles whines low in his throat, bites at Derek’s bottom lip, his stuttering breath warm against Derek’s mouth. Derek can tell he’s close, and he knows exactly what he can do to push him over the edge. He presses his thumb against the soft hollow where Stiles’ neck meets his jaw a little, lets himself feel Stiles’ racing heartbeat where the blood rushes hot underneath the skin, wraps his right arm arm around Stiles waist and hauls him backwards, until Derek is sitting on his heels with Stiles in his lap. A little nudge against his knees makes Stiles’ legs slide apart further, lets him sink down more snugly into his lap.</p>\n<p dir=\"ltr\">It only takes one more sharp thrust upwards, driving deeper into Stiles than the other position would allow him with gravity working in his favour and Stiles lets out a broken, choking sound, mouth going slack with pleasure. Derek uses the hand that’s still on his neck to tilt his head back, marvels at the pale stretch of skin  and sinks blunt teeth into the tendons of his neck. Stiles screams, throws his arms back to fist his hand in Derek’s hair almost painfully hard, and then he’s coming in long, hot stripes all over himself and the sheets, shattering into pieces in Derek’s arms.</p>\n<p dir=\"ltr\">It almost wrenches his orgasm from Derek, too, the combination of seeing Stiles’ climax and the feeling of his ass clenching around him, but he grits his teeth, buries his head in Stiles’ shoulder and tries, desperately, to hold on, to draw it out as long as possible. When he comes, he’ll have to face reality again; he’ll have to leave the warmth of Stiles’ body, the addicting thrill of their bodies moving against each other. He doesn’t want to go outside again, into the cold, where he’ll have to wait for another john to come around and fuck him. He wants to stay buried in Stiles forever. That’s probably just the hormones talking, but he doesn’t care.</p>\n<p dir=\"ltr\">Stiles throws a wrench in his plans, though, when he’s not being reduced to quiet sobs and gasping intakes of breath anymore. The moment he opens his mouth again, Derek knows it’s game over. “Fuck, Derek, yes, come on, fill me up, I wanna feel you, want everyone to know I’m yours, come on.”</p>\n<p dir=\"ltr\">Derek groans when he comes, white-hot pleasure crashing over him, bites his lip until it bleeds to keep the string of embarrassing, destructive thoughts from tumbling out. They fall back onto the bed, boneless, and Derek has just enough control over his muscles left to ensure he doesn’t crush Stiles underneath him. He pulls out begrudgingly, and for a moment they simply lie side by side, staring at the ceiling and trying to catch their breath.</p>\n<p dir=\"ltr\">“Holy God,” Stiles says a few minutes later, blissed out look still on his face. “We should do that all the time.”</p>\n<p dir=\"ltr\">Derek snorts. “What, you have a fortune lying around somewhere?”</p>\n<p dir=\"ltr\">Stiles elbows him in the side. “Stop ruining my afterglow with depressing shit.” He rolls on his side, frowns at Derek. “Can I ask you a question?” he says hesitantly.</p>\n<p dir=\"ltr\">Derek attempts a shrug. “Sure. Can’t promise I’ll answer.”</p>\n<p dir=\"ltr\">“How did you end up here?”</p>\n<p dir=\"ltr\">“In this room, with you?” Derek raises his eyebrows. “Well, I was standing outside and you came up to me and -”</p>\n<p dir=\"ltr\">“Stop being a smartass, that’s my job,” Stiles says. “You know what I meant.”</p>\n<p dir=\"ltr\">“Do I now?”</p>\n<p dir=\"ltr\">“Come on, Derek. You can’t tell me you enjoy this. Not, uh, this night specifically, because I hope you enjoyed that at least half as much as I did, which was a lot, by the way, I mean...turning tricks. I know some people do this because they want to, because they enjoy having sex and getting money out of it, too, but you don’t.”</p>\n<p dir=\"ltr\">“Oh really,” Derek says flatly. “And what makes you an expert at what I do or do not like?”</p>\n<p dir=\"ltr\">Stiles pokes his nose. “It’s written all over your face. And just...you don’t strike me as the type to, I don’t know, drop out of school and go live on the streets for funsies.”</p>\n<p dir=\"ltr\">“I didn’t,” Derek says after a while. He doesn’t know why he keeps talking. He doesn’t talk about his past with lot of people. Definitely not with strangers. Definitely not with strangers who are his clients, Jesus Fucking Christ, what is wrong with him? “It was just me and my sister, and she made sure I finished high school, got into college. I had a scholarship and a job to pay the bills. Then my sister disappeared, and I went looking for her.”</p>\n<p dir=\"ltr\">“Did you find her?”</p>\n<p dir=\"ltr\">“I found parts,” Derek says, voice hard and cold; it’s the only way he can keep it from quivering. “I took some time off, tried to get back on my feet. When I went back, they’d cancelled my scholarship and wouldn’t give me a new one. Same with my job. They fired me because I was unreliable, apparently. Couldn’t find another one, either; word about werewolves travels fast, even in big cities, and once you have a reputation, there’s no going back from it. Couldn’t get a loan, either, cause I don’t have job.” He shrugs again. “Had to pay the bills somehow. It’s not enough to cover the expenses of college, obviously, but it pays the rent.” He looks at Stiles coolly. “Good enough of a sob story for you?”</p>\n<p dir=\"ltr\">“That’s not why I asked,” Stiles says quietly.</p>\n<p dir=\"ltr\">“Isn’t it?” Derek asks sharply, turns around to slide out of the bed and starts fishing for his clothes. He swallows down the bitter taste in his mouth, knows he shouldn’t have said as much as he did.</p>\n<p dir=\"ltr\">“Derek!” Stiles grabs his arm, holds him back. “You know it’s illegal for them to discriminate you like this, right? You lost a family member, that’s a valid reason for anyone to take some time off, you can fight against that.”</p>\n<p dir=\"ltr\">“Sure, I’ll sue with money I don’t have, because every jury in the world is gonna believe the word of a werewolf over the word of a human,” Derek spits out. “Especially an unrespectable werewolf who works as a hooker.”</p>\n<p dir=\"ltr\">Stiles clenches his jaw. He looks angry, for the first time since Derek met him, but not angry at Derek. It’s a helpless, futile rage against the society they live in. Derek knows from experience; he’s still angry, all the time, but he’s stopped thinking about it most of the time, because it just makes him want to punch things. There’s nothing he can do to change the world, and it’s better to survive by dealing with it.</p>\n<p dir=\"ltr\">“You know,” Stiles says after a while, when Derek has almost finished dressing, “there’s a spot opening at the Beacon Hills Police Department. My dad’s been thinking about filling the vacancy with a werewolf, because he’s being trying to fight discrimination against werewolves and he thinks it’ll be easier for victims to come around and talk about it if there’s someone they feel they can trust.”</p>\n<p dir=\"ltr\">“Shut up, Stiles. I’m not your fucking charity case. This is not Pretty Woman, and you’re not the hero who swoops in and saves the poor, miserable prostitute from her horrible life on the streets.”</p>\n<p dir=\"ltr\">“I’m aware,” Stiles replies heatedly. “Does it look like I sit on a huge amount of money that I can finance your future with? I’m not a knight in a shining armour. I don’t wanna be. I’m not fucking telling you what to do, Derek, or how to live your life. I’m just saying, if you want to get out, there are options, even if you don’t believe there are, and this is one of them. Do with that information what you want.”</p>\n<p dir=\"ltr\">Derek stuffs the crumpled dollar bills lying on the night stand into his jeans and turns the door handle. “You have another ten minutes to get cleaned up, get dressed, and check out or they’ll charge you for another hour,” he informs Stiles matter-of-factly.</p>\n<p dir=\"ltr\">He leaves without saying goodbye.</p>\n<p> </p>\n<p></p>\n<p>\n<strong>∞</strong>\n</p>\n<p dir=\"ltr\">He doesn’t see Derek again for months. Stiles goes back to the corner where they met, once, a few weeks later, but Derek is nowhere to be seen. He hovers pathetically for an hour or two, until he’s freezing his ass off and has to fess up to the fact that Derek probably isn’t coming, and that even if he were around, he’d probably not want to see Stiles.</p>\n<p dir=\"ltr\">And then, well, winter break is over, and he has to return to Berkeley for his final semester, and he doesn’t dwell on it too much anymore. Well. He tries, at least. Lydia never has to know the reason he stopped hooking up with people isn’t actually that he’s too busy studying; that’s partly true, yes, but it mostly has to do with no one being able to live up to Derek’s standards and no one, in general, being, you know, Derek. He’s never telling her that, though. She’s already convinced he’s slightly insane, he doesn’t need to add to the evidence by telling her he’s sort of hopelessly hung up on someone he paid for sex.</p>\n<p dir=\"ltr\">Christ, he’s a disaster.</p>\n<p dir=\"ltr\">When he comes back during spring break, the first thing he does after entering Beacon Hills is drive to the station to hug the shit out of his dad. He falls through the office door with his usual grace that Scott once likened to a dying antelope, already halfway through his greeting before he even closes the door. “Yo, daddy-oh, Eagle Two has touched down and can I just say, Roscoe needs new brakes and also I know you’ve been eating doughnuts again, seriously, can you not -”</p>\n<p dir=\"ltr\">“Stiles,” his dad interrupts him, rolling his eyes long-sufferingly and gestures at the person next to him. “I’m kind of busy.”</p>\n<p dir=\"ltr\">“So?” Stiles asks. He’s never cared much about interrupting meetings, or whatever the deputies call their gossip hours nowadays. He’s known everyone here for as long as he can remember, he practically grew up around the station, no one cares about his antics anymore. Or at least they’ve gotten used to suffering through them.</p>\n<p dir=\"ltr\">It’s only when he actually looks at the man that he stops dead in his tracks. “Tell me you didn’t get arrested,” he blurts out.</p>\n<p dir=\"ltr\">His father stares at him as if he’s lost his mind. Which, granted, he does with alarming frequency. “Stiles,” he says, “I would introduce you to our new deputy in training, but clearly you already know each other. And I don’t even want to know how you know him, or why you would think he’s been arrested. Please don’t ever give me any details. Derek, I’m gonna get the paperwork for you, and I want it done by tomorrow, understood?”</p>\n<p dir=\"ltr\">“Yes, Sir,” Derek nods.</p>\n<p dir=\"ltr\">“Good.” His dad pats Stiles on the shoulder as he walks past. “Good to have you home, son. I’ll leave you two to...catch up. I’ll be back in five, though, so no sex on the desk.”</p>\n<p dir=\"ltr\">“I hate you,” Stiles says, feeling the blood rushing to his head and heating up his cheeks.</p>\n<p dir=\"ltr\">“Sure thing, kiddo,” his dad says good-naturedly, and walks out.</p>\n<p dir=\"ltr\">Stiles clears his throat, smiles shyly at Derek. He looks good. Better than when they met, which should be impossible, but it’s true. He looks happier. Healthier. “So,” he says, hesitantly. “Hi?”</p>\n<p dir=\"ltr\">Derek smiles. “Hi.”</p>"
}