{
  "id": "10966704",
  "url": "https://archiveofourown.org/works/10966704?view_full_work=true",
  "author": [
    "Ionaperidot"
  ],
  "title": "Homecoming",
  "rating": "Not Rated",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Batman - All Media Types"
  ],
  "relationships": [],
  "characters": [
    "Bruce Wayne",
    "Jason Todd",
    "Dick Grayson",
    "Tim Drake",
    "Alfred Pennyworth",
    "Joker",
    "Selina Kyle",
    "Jim Gordon",
    "Barbara Gordon"
  ],
  "additional_tags": [
    "Dad Bruce Wayne",
    "just pretend Bruce cares more about his kids than Gotham",
    "and also someone has the good sense to say something when a body disappears from the cemetary",
    "also Clark and Ollie and Roy show up",
    "no one is Robin",
    "Catatonic Jason Todd",
    "the joker dies"
  ],
  "language": "English",
  "series": "",
  "published": "2017-05-22",
  "completed": "2017-05-25",
  "words": "12,276",
  "chapters": "4/4",
  "comments": "611",
  "kudos": "7,297",
  "bookmarks": "1,902",
  "hits": "65,907",
  "summary": "<p>“Your son’s grave. It’s been disturbed.”<br>In which people actually notice when Jason breaks out of his grave, and Bruce finds him before Talia does.</p>\n<p>Tim wonders how much longer Bruce will let him stay, now that Jason is back. Jason still can’t be Robin, but Bruce doesn’t want Tim as Robin, anyway. Everyone seemed pretty set on keeping him until his parents came home, but maybe that’s just something you say to be polite about using the neighbor kid as a substitute for your dead son until he comes miraculously back to life.</p>\n<p>Roy is smaller than he remembers, sweating and shaking and not quite conscious, deep in the throes of withdrawal. Bruce lifts him carefully, mentally cataloguing the track marks that appear when his sleeve rides up. He knew Roy was on heroin when they saw him last. He’d hoped the boy had gotten clean, but he’d suspected he was already dead, so overall this counts as a win. Hopefully Oliver Queen will see it that way, too. If not, Roy can join them on The Great Wayne Runaway, as Dick has taken to calling it.</p>\n<p>“Jason?” Tim whispers. “What is it like to die?”</p>",
  "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>And then Babs meets Cass in Gotham and sends the boys lots of photos of her adorable assassin baby, and they get Damian from Talia somehow and have their own adorable assassin baby, and everyone lives happily ever after, because I'm rereading Under the Red Hood right now and I do not need any more angst in my life.</p>\n<p> </p>\n<p>Thanks so much for reading, guys, and for making my first time writing fanfic so happy and exciting. I haven't been replying to comments or anything because I don't have internet, except for the ten minutes every day that I spend at my aunt's house uploading chapters and stuff. But I have been reading all the comments and notifications and everything on my phone, and then spending the next few hours giddy because everyone says such nice things.</p>",
  "text": "<p>A call from a funeral home is the last thing Bruce needs right now. What would they even want with him? Money? That’s all anyone ever wants from Bruce Wayne, but fuck them if they expect an extra donation after everything he forked over when they put his kid in the ground.</p>\n<p>He lets it go to voicemail three times before he notices Tim flinching when it starts back up again—in the last two months he’s basically adopted his neighbor. The kid thinks Batman needs a Robin. Bruce thinks the kid needs three square meals every day, eight hours of sleep every night, and a shitload of attention from someone who isn’t paid to give it to him. The Drakes are in for a custody battle if they ever come back from Brazil, or wherever the fuck they’ve moved on to now. They don’t exactly keep Tim updated.</p>\n<p>Jason’s been dead six months. Barbara is still in the hospital, and they’re saying she might never walk again. Dick doesn’t smile anymore, Alfred’s taking time off to be with a daughter Bruce didn’t even know about, Scarecrow is rampaging, and now he’s somehow in charge of an eleven year old with RAD. If the stupid phone would just. Stop. Ringing—</p>\n<p>“What?”</p>\n<p>“Um, Mr. Wayne? Sir? We’re sorry to call you during the—but, um. The thing is…”</p>\n<p>Bruce sighs, glances at Tim in the corner, and tries not to lose his temper. “What is the thing?”</p>\n<p>“Your son’s grave. It’s been disturbed.”</p>\n<p>-</p>\n<p>Tim comes with him to the cemetery, because Bruce is developing this thing about letting children he cares about out of his sight. He would make Dick come too, but it would probably be too upsetting for him—Dick’s quit his job and moved back home, but he never leaves his room except to eat and visit Barbara, he hasn’t even acknowledged Tim’s presence, and Bruce is pretty sure seeing his baby brother’s desecrated grave isn’t going to do anything good for his mental state.</p>\n<p>Bruce misses having someone to patrol with, but he’s also pretty sure that if Dick was still acting like Dick, he’d break both his legs before letting him out in a suit. Tim is absolutely not becoming Robin. None of his kids. Never again.</p>\n<p>The thing about Jason’s grave is—well. Bruce doesn’t even know where to start. Jay was wearing a nice suit, because that is how funerals work. He wasn’t buried with anything more valuable than the suit. He would have hated that, something going in the ground when it could still be used by someone who needed it. And really, what were the grave robbers expecting to find? A Rolex, maybe? Really nice gold cufflinks? Sure, Bruce is a billionaire, but it’s the twenty first century. He’s not about to lay his son to rest on a bed of diamonds.</p>\n<p>So grave robbers go after a poor little rich boy, fail to find actual riches, and just decide to take the body? What the hell?</p>\n<p>Some creep is out there with Jason’s body. Jason’s body. Jason’s dead body, doing God knows what—</p>\n<p>And Bruce knows that Gotham’s never exactly had a high class of criminals, super villains aside, but these guys couldn’t even bother to dig him up properly. It looks like they dug just enough to get access to the wood, then pried off just enough to drag the body out.</p>\n<p>“He came out,” Tim says, quiet and awed.</p>\n<p>“Tim?”</p>\n<p>“All the angles are wrong. No one broke in, Mr. Wayne. He broke out.”</p>\n<p>“Bruce,” he corrects absently, and then Tim’s words sink in.</p>\n<p>He should have noticed. He’s Batman, of course he should have noticed, but cut him some slack here—the body of his dead child has just gone missing.</p>\n<p>Tim is right.</p>\n<p>The kid would have been a great Robin, in a different world.</p>\n<p>Jason broke out. His dead son is somewhere on the streets of Gotham, alone and probably very confused. His dead son is somewhere on the streets of Gotham, alive.</p>\n<p>-</p>\n<p>“Dick. Time to come out.”</p>\n<p>The door opens slowly, and Bruce looks at his oldest son, hating himself a little more than usual. He should have pulled himself together, should have tried harder to help him—Dick is clearly not doing well, between Jason and Barbara. But he didn’t know what to do.</p>\n<p>Now he does.</p>\n<p>“I think Jason is alive.”</p>\n<p>“That’s not funny,” Dick says.</p>\n<p>“It’s not a joke. His grave was disturbed last night. Tim noticed the damage came from below, not above, and the body is gone.”</p>\n<p>“Tim?”</p>\n<p>“That kid who’s been living here for the last two months?”</p>\n<p>“Oh. Right. I’ll, um, suit up, I guess.”</p>\n<p>Bruce isn’t sure if Dick is in shock, or just out of it enough that things aren’t really registering. It doesn’t matter. Things will be better. They’ll find Jason, and things will be better.</p>\n<p>“Just find some jeans and a t-shirt, okay Dick? You’ve lost at least twenty pounds. The suit isn’t going to fit.” </p>\n<p>Not that Bruce would ever let him go out as Nightwing again anyway, if he could help it. No more kids in danger. Never again.</p>\n<p>He leaves Dick to call Alfred—if he wants to bond with his daughter, he can bring her to the Manor. Jason is coming back, and Jason needs Alfred. He’s trying to decide whether to call Leslie or Gordon next, when Dick comes down the stairs, looking more like Dick than he has in months. He still looks completely terrible, but it’s an improvement. Probably.</p>\n<p>“You really think Jason is back?”</p>\n<p>“I do,” Bruce says. “The three of us are going to find him.”</p>\n<p>Tim appears from behind the counter (seriously, great Robin material—Bruce didn’t even know he was there) to demand that they hurry up, then, which is significantly more than Tim usually says when he isn’t answering direct questions, imparting important information, or trying frantically to justify some completely innocent action that his parents would consider misbehavior.</p>\n<p>Dick smiles at Tim, a little, and Bruce decides to count it as yet another win on a day incredibly full of them.</p>\n<p>They check every hospital, medical facility, and police station in Gotham first. Then they start at the cemetery and work their way out, all on foot, in civilian clothes, until it gets dark. Nothing.</p>\n<p>Nothing yet. They have no idea how long Jason’s been out—less than twenty four hours, but nothing more concrete than that—and he’s a smart kid. Fast. Good at getting around Gotham.</p>\n<p>Bruce sets up facial recognition software, while Tim watches, fascinated, and Dick hangs back, looking lost. He manages to herd them both out of the Cave with no trouble, and then he makes his phone calls in the kitchen, where he can keep an eye on them.</p>\n<p>Tim sits on the counter, watching Dick with a mixture of anxiety and awe that has become very familiar to Bruce in the past few weeks. Dick shuffles around the kitchen gathering food, occasionally tossing puzzled looks back at Tim.</p>\n<p>Gordon, on the other end of the line, politely doesn’t say that he thinks Bruce has lost his marbles, and Bruce wonders for a moment if he has. This family is definitely in for some serious therapy. Tim’s RAD, Dick’s depression. And there’s no way Jason doesn’t have some serious PTSD.</p>\n<p>Bruce looks at the food Dick’s assembled, admits to himself that he couldn’t do any better, and really hopes Alfred was serious about being on the next flight out.</p>\n<p>“Chinese?” he offers.</p>\n<p>Dick shrugs, Tim nods, and he picks the phone back up. Maybe he should leave Scarecrow to the police. Spend the night with his boys instead.</p>\n<p>But one of his boys is out there right now, and Bruce has to protect him, too. Can’t let criminals run around on the same streets as his missing child.</p>\n<p>As soon as Jason is home, they are all going on a very long vacation, very far from Gotham. Assuming he can settle everything with the Drakes.</p>\n<p>-</p>\n<p>During the day, the three of them wander around town in search of Jason. At night, Bruce patrols fast and hard and keeps an eye out for familiar faces. Dick stays up late watching video feeds from all over Gotham, and Tim calls every hospital, shelter, and police station, every day, with a description of Jason. Alfred comes home, Barbara moves from the hospital to rehab, Joker escapes Arkham for half an hour before returning with forty three broken bones, the Drakes call Tim to say they’ll be gone at least another month, in France now, and Jason doesn’t show up.</p>\n<p>If Bruce was wrong about this, Dick is going to break. Alfred will never recover. And he…Bruce doesn’t know how he can possibly cope with being wrong about this, except that he has to, because there’s Tim now. Tim, who was right about what Bruce needed, except that it was Tim himself, not another Robin. And Dick, who still needs Bruce so much more than he thought. He has to be right about this. He has to.</p>\n<p>-</p>\n<p>“Bruce!” someone yells from down the hall. “Bruce! Bruce!”</p>\n<p>It takes a moment to recognize the voice as Tim’s, because he has never heard Tim yell, ever. His first reaction is to panic, but Tim bursts into the dining room seconds later, grinning and waving the phone.</p>\n<p>“The hospital called.”</p>\n<p>Twenty minutes later they arrive at Gotham General, even Alfred looking frazzled. Dick is still in his pajamas. Tim is wearing slippers. Bruce isn’t quite sure what he looks like, but it must be interesting, because this is not the way people usually stare at Bruce Wayne.</p>\n<p>A kind-looking older nurse approaches, kneeling down to say, “Hello, you must be Timothy,” and then they’re in front of a small white bed in a small white room, and Jason is there.</p>\n<p>Everyone is crying, except for Tim, who doesn’t actually know Jason, and Jason, who is in a coma. A walking coma, the nurse says, where he can move and eat and respond to basic instructions. Bruce wonders if that makes it worse, having his son up and about and looking at him with eyes that don’t really see.</p>\n<p>It doesn’t matter. Jason is alive.</p>\n<p>-</p>\n<p>Dick is a little freaked out. Jason isn’t mouthing off or squirming out of his hugs or anything. Also, Jason is dead. Dick saw the body. But this is—this is the first time he’s really felt like a person since that fucking clown blew up his baby brother and put a bullet through his ex’s spine, and maybe things can be okay now. Jason will get better. He has to.</p>\n<p>It’s been less than an hour, but money is a real superpower, because Bruce is well on his way to having Jason brought home from the hospital tonight. Alfred can take care of catatonic Jason. Totally. And they can always bring in Dr. Thompkins, and Bruce has been talking about finding therapists.</p>\n<p>The therapy is probably for him, Dick thinks, but Jason will need it more. And maybe the new kid. Timmy? Dick hasn’t been paying as much attention to him as he should, with everything else going on. But he’s definitely a little weird. Dick tried to hug him yesterday, and the kid panicked. Plus, he never makes eye contact, he almost never talks, and Dick is pretty sure he’s much more scared of Bruce than Batman, even though he obviously knows everything, considering the way Bruce has been coming up to the kitchen in costume lately.</p>\n<p>He should probably try to bond with Timmy more. When did Bruce pick up another kid anyway? And where? Dick really needs to get his shit back together—who knows what else he’s missed?</p>\n<p>-</p>\n<p>Alfred makes everyone clear out when they get Jason home. Something about crowding him. Bruce goes downstairs, a move that probably has more to do with the legal mess of a kid rising from the grave than it does obeying Alfred. But Tim stays. Well, sort of. Technically he’s not in Jason’s room. Not crowding him. He’s just sitting in the hall immediately outside Jason’s room, spying on him.</p>\n<p>It’s not exactly exciting. Jason is mostly just sitting on the edge of his bed, staring into space. But this is Jason Todd, Robin, for real, alive and everything, and there’s no way Tim is missing a single second of it.</p>\n<p>“Hello? Earth to Timmy.”</p>\n<p>Tim flinches, violently, and Dick, standing above him, frowns.</p>\n<p>“You’re really gonna have to get over that twitchy thing, kid. I swear I don’t bite. Not my brothers, at least.”</p>\n<p>“I’m not your brother.”</p>\n<p>“No? I though Bruce was adopting you or something.”</p>\n<p>“I’m just—sorry. I’m just your neighbor. Sorry. I’ll be out of your hair soon. Alfred just doesn’t want me to leave until my parents are home—sorry. It’s stupid. I’m always home alone. It’s fine.”</p>\n<p>“Wait. You’re the Drake kid?”</p>\n<p>Tim nods.</p>\n<p>“Dude. It is not fine. They’re home, what, three weeks a year? I figured they were taking you with them when they went abroad. Shit. How long have you been living alone?”</p>\n<p>He shrugs.</p>\n<p>“No offence, Tim, but your family sucks. I’m claiming you. You’re my family now.”</p>\n<p>“You can’t just—you can’t claim me.” The kid sounds so confused, and it’s adorable, and yeah, he is definitely Dick’s little brother now. How much cuteness did he miss while Jason was dead?</p>\n<p>“Sure I can. You just try and stop me.”</p>\n<p>Tim looks decidedly skeptical.</p>\n<p>“Come on, Timmy. Please? I really want another brother. And Jay does too.”</p>\n<p>“Jason doesn’t want anything. He’s in a coma.”</p>\n<p>“He wants cute little kids to have families that love them. Trust me. I know him.”</p>\n<p>“I’m not cute.”</p>\n<p>“Timmy, you’re adorable.” </p>\n<p>He walks into Jason’s room and hauls him to his feet. “Come on, Jaybird. We’re gonna watch a movie with our new baby brother.”</p>\n<p>-</p>\n<p>Bruce finds all three of his boys in front of the TV, huddled on the couch. The menu is running, and they’re all asleep, Jason curled into the arm rest, Tim tucked up against his side. Dick is sprawled mostly on the floor, only one leg on the couch, and he sits up when Bruce turns the TV off.</p>\n<p>“Hey, B. Time for patrol?”</p>\n<p>“For me it is,” Bruce says. “For you three it’s time for bed.”</p>\n<p>“Seriously? You’re sending me to bed? I’m in my twenties, Bruce.”</p>\n<p>Bruce sighs. He knew they would have to have this conversation, but he really doesn’t want to. “I know, Dick. You’re an adult, and I can’t tell you what to do. If I could, you’d never set foot outside again, not after what happened to Jason. But I am asking you, because I care about you, to please not go out for a while. You haven’t been Nightwing in months. Because you’ve been sick. And getting Jason back does not magically make you better, and I don’t want to risk you getting hurt because you’re not at your best. Please, Dick. Stay home. Be here for Jay. And Tim—his parents are assholes, and if I can get him to see that, we’re going to have a custody battle on our hands.”</p>\n<p>“I’m not sick.”</p>\n<p>Bruce just looks at him.</p>\n<p>“Okay, maybe I haven’t been doing so great. But Babs is out, too, and you need backup.”</p>\n<p>Bruce refrains from pointing out that he hasn’t had backup in over four months, and instead motions for Dick to follow him into the kitchen, where the younger boys won’t be woken up by their conversation. It’s time to share the idea he’s had since there was a chance Jason was alive, the idea he’s been thinking about seriously since they got back from the hospital this morning.</p>\n<p>“I want the Joker dead,” he says.</p>\n<p>“Bruce—”</p>\n<p>“I can’t kill him. And I can’t let anyone else kill him. But he’s committed crimes everywhere—he got Jason in Ethiopia. Get Tim to help you. Find some other city he’s killed in, some other city that wants him. Somewhere with a death penalty.”</p>\n<p>“Why?” Dick asks. “Why now?”</p>\n<p>“I want you boys out of this. And you never will be, unless I’m out too. And I can’t stop while the Joker is still a threat. If I know that Gotham is free of him, forever, I can give up Batman and take you somewhere far, far away, where I know you’ll be safe.”</p>\n<p>“What if I don’t want to be safe?”</p>\n<p>“You don’t have to come, Dick. I hope you will, but I’ll understand if you don’t. And I’ll respect that decision and support you in it. You are an adult. But Jason is a child, and he’s been murdered. I can’t put him at risk like that again. I need him away from Gotham, where I can keep him safe and get him the help he needs.”</p>\n<p>“And Tim?”</p>\n<p>“If I can get custody. I’d like you to dig up some dirt on the Drakes, too.”</p>\n<p>Dick nods. “Let’s get the boys to bed. I can start on the Drakes while you patrol. Joker when Tim wakes up tomorrow.”</p>\n<p>Bruce wisely waits until he’s roaring out of the cave in his Batmobile to tell Dick about the counseling session he has scheduled tomorrow morning.</p>\n<p>When Tim walks downstairs in the morning, Jason is sitting at the island, eating methodically. The doctors were pretty confident about Jason’s ability to eat and use the bathroom without help, which is more than Tim would expect from a coma. A lot more. Tim sneaks glances at him as he picks at his own breakfast—not that it would matter if he openly stared. Jason probably won’t notice, and if he does he won’t remember it when he wakes up for real. Still, it seems rude.</p>\n<p>Tim wonders how much longer Bruce will let him stay, now that Jason is back. Jason still can’t be Robin, but Bruce doesn’t want Tim as Robin, anyway. Everyone seemed pretty set on keeping him until his parents came home, but maybe that’s just something you say to be polite about using the neighbor kid as a substitute for your dead son until he comes miraculously back to life.</p>\n<p>Maybe he should start packing his things. Not that he really unpacked in the first place, but Alfred has some of his clothes in the laundry room, and he left a couple books in a sitting room last week, and Alfred insisted that he hang his coat and his nice suit in the closet. Yes. He should definitely start packing.</p>\n<p>The next time he looks over at Jason, Jason looks back, and there’s a second of weird sort-of eye contact before Dick races in, hugs them both (Tim tries not to flinch), and grabs an apple, promising to “eat more later, Alfie, I’m running late, fucking Bruce is such an asshole—I know, I know, language, sorry, gotta go!” </p>\n<p>Jason’s lips twitch in what could just barely be described as a smile, if the person describing it was in a generous mood, and Tim smiles back, even though it’s not directed at him, because this is something like awareness.</p>\n<p>And Jason is home and alive and Tim is sitting at the breakfast table with Robin, and it’s everything he’s ever wanted, it’s more than he’s ever wanted, and now he has to go home to his huge empty house where no one loves—it’s not like he expects people here to love him, he’s not stupid, but at least there is love in this house, and he can see what it looks like up close, and he’s going to miss that.</p>\n<p>-</p>\n<p>The first thing Dick does when he gets home is give Alfred his new pills, because all meds in this house go through him, ever since Bruce “forgot” to take his painkillers after he broke three ribs fighting Killer Croc.</p>\n<p>The second thing he does is leave an angry voicemail for Bruce at work, and the third thing he does is check up on Jay, who’s just wandered out of the kitchen to sit in front of the TV. Dick turns it on, just to make himself feel better—it’s easier if he can at least pretend that his brother is aware and paying attention to something.</p>\n<p>The fourth thing Dick does when he gets home is track down Tim to start working on the Joker case, and that’s where he runs into trouble. Because he can’t track down Tim. Granted, the manor is huge, and Bruce has mentioned Tim’s habit of tucking himself into weird corners to hide, but there are security cameras everywhere in here, and Dick has had years to learn all the best hiding places, and he is positive Tim Drake is not in this house.</p>\n<p>Alfred hasn’t seen him—he’s been focused on Jason. And if Jason’s seen him, well, walking-coma-Jason doesn’t really talk. And yeah, at some point Dick is going to actually have to process the fact that this is his brother right now, and he’s still just Jay, and he needs to be there for him and whatever, but in the last day and a half his brother has come back from the dead, Bruce has asked him to give up crime fighting and to get the Joker killed, he’s been put on anti-depressants, and he’s somehow managed to misplace an entire child. Processing later. Finding Tim now.</p>\n<p>Tim’s stuff is gone. His room looks like a guest room—no sign that a preteen boy was living here as recently as this morning. He’s not planning to come back, so he’s probably at home. Next door.</p>\n<p>Dick collects Jason from the couch and helps him into shoes and a coat—Bruce said something about Tim idolizing Jason and taking pictures of him as Robin and stuff, so whatever made Tim leave, Dick is hoping Jason can help convince him to come back.</p>\n<p>Jason lets Dick manhandle him into the shoes and coat, and then he lets him take his hand and lead him down the street, and this is disturbingly not-Jason in a way Dick is going to think about later. Maybe this can work to his advantage. Cuddly Jason. Lots of hugging.</p>\n<p>Did Tim leave because Dick pushes too hard when he gets twitchy? That’s gonna suck to explain to Bruce.</p>\n<p>No one answers when he rings the doorbell, but since the Drakes are in South America or something, and Tim just ran away, it’s not exactly a surprise. Dick lets go of Jason’s hand to pick the lock, then grabs it again to pull him inside.</p>\n<p>“Come on, Jaybird. Gotta find Timmy. Then we’ll go home and—fuck. I don’t even know what you like to do. I’m a shit brother, huh? Shoulda spent less time with the Titans. Maybe if I’d been there, you wouldn’t—”</p>\n<p>Jay pulls away from his hand and crosses the room, stopping in front of a hall closet. And, well, Dick can take a hint.</p>\n<p>“Tim? Hey, you in there?”</p>\n<p>“Hi, Dick.” His voice is slightly muffled by the wall. “Hang on, I’ll get you some tea or somethi—ow. I definitely need to move that lamp stand.”</p>\n<p>He pushes the door open, revealing what seems to be an entire bedroom organized around coats, boots, and the other sorts of things one actually expects to find in a closet.</p>\n<p>“Oh. Hi, Jason. I didn’t know you were here too.”</p>\n<p>“Timmy?” Dick says. “Do you sleep in here?”</p>\n<p>“What? Oh. Yeah. It’s just less empty than my room, you know? Anyway, most of the food is stale and I haven’t finished ordering groceries yet, but I can get you something to drink.”</p>\n<p>“Tim. Why are you here?”</p>\n<p>The kid blinks up at him, clearly confused. “I live here?”</p>\n<p>“You haven’t lived here in months.”</p>\n<p>“Well, yeah, but Jason’s back now, and I shouldn’t be over there getting in everyone’s way.”</p>\n<p>Dick runs a hand through his hair. It’s not like it’s a surprise that Bruce found another kid with abandonment issues and low self esteem, but Dick is really tired, and somewhere during this conversation his undead brother wandered off.</p>\n<p>“You’re not in the way, Tim. Bruce wants your shitty-ass parents to lose custody so he can adopt you, okay? Did you see where Jay went? Bruce is going to kill me if I manage to lose both of you in one day.”</p>\n<p>-</p>\n<p>When Bruce gets home from work, the entire family is in the cave. Alfed is sitting on the mats with Jason, carefully helping him to sort through a large collection of books. Dick and Tim are on the computers, arguing quietly about statutes of limitations and which states are likeliest to issue a death penalty versus which states will carry it out the soonest. The two of them look up when he approaches; Alfred and Jason continue what they’re doing.</p>\n<p>“Do you really want me?” Tim asks.</p>\n<p>That’s a pretty loaded question, but Dick is nodding furiously in the background, so Bruce says, “Of course.”</p>\n<p>“No one’s ever wanted me before.”</p>\n<p>“We do,” Bruce says firmly. He turns to Dick. “How’s Jay?”</p>\n<p>Dick shrugs. “About the same as yesterday. Sticking close to Alfie. He kept looking at the door when we were upstairs, though. I think he was waiting for you to come home.”</p>\n<p>Bruce crosses the cave and lowers himself to the floor between Jason and Alfred. “So. What are we working on?”</p>\n<p>-</p>\n<p>Batman runs around Gotham looking threatening for about an hour that night, then stops by the bat signal to speak with the Commissioner. Jim knows—well, Jim probably knows everything, but officially the Commissioner knows that Robin is dead, Batgirl is gone, and Nightwing is off-world with the Titans. Batman tells him, now, that Nightwing is home but out of commission, maybe permanently, and Batman is on his way out, too.</p>\n<p>“Six to eight months, I’d say. I have children I’m responsible for, and it’s becoming increasingly clear that I can’t be a vigilante and a father. I’m getting them out of this hellhole, but I’ll wrap up as much as I can first.”</p>\n<p>Jim understands. Of course he does. Batgirl is currently recovering from a bullet through her spine, and they can dance around it for the rest of their lives, but they both know Batgirl is Barbara Gordon.</p>\n<p>The rest of the night is spent in the Cave, watching the security feeds set up in Arkham. If he plays his hand right, Bruce thinks he can eliminate Two Face and Poison Ivy before he goes, too. He just has to figure out how.</p>\n<p>At the next monitor, Dick is researching catatonia and walking comas, while Tim sorts a list of every crime the Joker’s ever committed by location and severity. It’s a huge job, and Alfred was helping, but now that Jason’s wandered out of their line of sight, someone has to follow him.</p>\n<p>-</p>\n<p>Things are getting better, he thinks. Dick is still sullen and miserable and blaming himself for things that aren’t his fault, more often than not, and Tim is still a lot more comfortable around Bruce when he’s in the cowl, which still doesn’t make sense to any of them. But last week Barbara sent him a list of every corrupt city official in Gotham, which he forwarded to Clark Kent, and he’s expecting a list of crimes to appear in the Daily Planet any day now. Harvey seems a lot more open to treatment when he’s getting frequent visits from an old friend, and he’s promised Dr. Pamela Isley a significant grant and all the resources she wants, for any benign project of her choosing, if she can get officially released from Arkham in the next two years. They’ve signed contracts and everything.</p>\n<p>He’s been spending more time at home lately, since Jason tends to get agitated if he’s gone too long, and Alfred is looking into properties to move the family to when things are settled here. Still, he needs more help.</p>\n<p>Batman has never let other heroes into his city, and he isn’t happy about it now, but this won’t be his city much longer.</p>\n<p>The Justice League doesn’t understand, and Bruce can’t blame them. He’s going against everything they’ve ever known about Batman. But losing Jason changed him, and he won’t throw this second chance away. Not for anything in the world.</p>\n<p>He keeps thinking about Roy Harper. That kid Green Arrow took in and made a soldier instead of a son. That kid Green Arrow broke. No one has seen him since he checked himself out of rehab, one week in. And that was over a year ago.</p>\n<p>Bruce knew Roy better than he wanted to—when he was thirteen he had a crush on Dick, and was at the Manor constantly. Two years later it all went to shit with Ollie, and now—not even old enough to drink, and he’s probably dead in a ditch somewhere. That isn’t happening to his sons. Nothing is happening to his sons, ever again. Bruce spent months waking up to the feeling of Jason’s blood on his hands, and everything is different now. His sons aren’t soldiers. This is someone else’s war.</p>\n<p>So he invites the Justice League to his backyard, and he gives them everything he knows. Dick shakes himself from a haze of depression to talk to Clark, and Jason trails after Diana, as awed by her as ever. Tim stares at everything, and tries to make himself invisible at Bruce’s side.</p>\n<p>Ollie looks at them with a sort of longing, and Bruce thinks he did love Roy, despite everything, and is more sure than ever that he’s doing the right thing.</p>\n<p>Later, when the rest of the League is gone, Clark asks him, “Is Dick all right?” </p>\n<p>“No,” Bruce says. He doesn’t elaborate, because it’s none of Clark’s business, none of anyone’s business, how his sons have become strangers overnight and he doesn’t know how to help them.</p>\n<p>“Are you all right?” Clark asks.</p>\n<p>“No,” Bruce says, because Clark is his friend and there’s no point in lying.</p>\n<p>“This isn’t like you, and I’m afraid you’re going to regret it later.”</p>\n<p>Bruce glances up the stairs—he knows which room the boys are probably in now, knows that Tim, who barely slept last night, is falling asleep on Jason’s shoulder. (Jason doesn’t approach him, Jason doesn’t talk to him, Jason doesn’t want anything from him, and therefore Jason is safer than Bruce and Dick and even Alfred.) He knows Dick is rambling to Jason about nothing, will keep rambling for hours without a response, because he doesn’t know what else to do. He knows that Jason is catatonic, but safe and alive, and he looks back at Clark and smiles.</p>\n<p>“I will be all right, when this is finished. And even if I’m not, they will be.”</p>\n<p>He looks skeptical.</p>\n<p>“I was never much of a hero, Clark. I got into this for my parents. Helping everyone else just happened. But my parents are dead now, and my sons are alive. Jason is alive, Clark. Nothing else is ever going to be as important as this.”</p>\n<p>-</p>\n<p>“I hear your son turned up alive,” Harvey says at Bruce’s regularly scheduled Arkham visit.</p>\n<p>“Yeah.” Bruce smiles. He missed this, missed Harvey.</p>\n<p>“And you’re adopting some other kid?”</p>\n<p>“Yeah,” he says again. “Wait. What? Where did you hear that? I mean, I am, but how did you know?”</p>\n<p>“Some guards were talking about it last night. You okay, Bruce?”</p>\n<p>He’s really not. For all the craziness Brucie Wayne gets up to in the public eye, he’s usually good at keeping things quiet when he wants to. Jason is legally alive, but he bribed enough officials that no one really took note of it. And Tim Drake—yeah, he’s been in discussions about that, about the big empty house and Tim’s makeshift bedroom in the front closet, the grocery order he puts in every week, the homeschooling with no supervision, the fact that even the housekeeper was dismissed over a year ago when the Drakes decided it was a waste of money, with the ten year old perfectly capable of dealing with things himself. But those discussions weren’t supposed to be common knowledge for random night guards in a mental institution.</p>\n<p>Tim and Jason are watching the news when he gets home. Well, Tim is watching the news. Jason doesn’t seem all that invested.</p>\n<p>“I’m so sorry,” Tim says as soon as he sees Bruce.</p>\n<p>“For what?”</p>\n<p>“Everyone—it’s in the news, people are all talking about—I know you wanted it to be quiet, about you and my parents and the—I promise I didn’t tell anyone. I don’t know how the news found out.”</p>\n<p>“Tim,” Bruce says. “I’m not mad at you. I wouldn’t be mad even if you had told people. I don’t care who knows, okay? I just wanted to protect you from the drama.”</p>\n<p>“Okay,” Tim says, barely audible, and Bruce thinks he believes him, but doesn’t understand. A scene has been made, Tim is involved in the scene, therefore Tim ought to be in trouble. Bruce cannot wait to get this kid far away from the Drakes forever.</p>\n<p>“Is it okay if I hug you, Tim?”</p>\n<p>Tim nods hesitantly, but when Bruce wraps his arms around the boy, he leans in immediately with a happy little sigh.</p>\n<p>“You don’t have to be afraid of me, Tim. Things are going to be okay now.”</p>\n<p>And, all right, an attachment disorder and moderate to severe anxiety aren’t going to be solved with a hug, but it’s a start. And as soon as he has custody Bruce can get the kid some proper treatment.</p>\n<p>-</p>\n<p>“Poor little kittens,” Selina whispers.</p>\n<p>Bruce glances back to look at her, figure illuminated by light from the hallway. Alfred didn’t mention her arrival, but Bruce probably deserves that. They haven’t spoken as Bruce and Selina since before Jason’s death, and with the mood Batman’s been in without Robin, his conversations with Catwoman have been less than cordial.</p>\n<p>“Selina,” he whispers back, coming to stand beside her. The boys are all sleeping on the couch, the TV playing softly in the background.</p>\n<p>“He’s really back?” she asks.</p>\n<p>Bruce nods.</p>\n<p>“And the new one, the little one. He used to follow you around the city at night, didn’t he? I caught him once. Bought him a milkshake and sent him home.”</p>\n<p>“His name is Tim.”</p>\n<p>“I know, Bruce. I saw the news.”</p>\n<p>He kisses her, even though he knows it’s a bad idea. It’s been far too long. He’s missed her.</p>\n<p>“I’m taking them away from Gotham. Out of state, maybe even out of country.”</p>\n<p>“Good. They’ll be safe.”</p>\n<p>“You could come with us,” he offers, and Selina smiles sadly.</p>\n<p>“You know I can’t do that, Bruce. But I’m happy for you. If I had kids, I’d find a way out, too.”</p>\n<p>“You could spend the night. See Dick and Jay in the morning, meet Tim.”</p>\n<p>“Hm. Make it worth my while?”</p>\n<p>“I always do,” Bruce says, and she smiles again, sharp and feline.</p>\n<p>-</p>\n<p>At breakfast the next morning, Tim stares at Selina with open fascination.</p>\n<p>“Remember me, kitten?”</p>\n<p>“You stole a six million dollar diamond necklace from the museum last April, and Batman was so busy pining for you he didn’t even notice.”</p>\n<p>“Selina?” Bruce asks. </p>\n<p>She laughs.</p>\n<p>“Also you took me to that diner,” Tim adds. “Thanks.”</p>\n<p>Selina spends the rest of breakfast in conversation with Dick, pointedly ignoring Bruce’s inquiries about unreported theft. It’s not as if the man doesn’t know what she does for a living.</p>\n<p>Later, she herds Jason off to some hidden corner for bonding time with her favorite little Robin, waving merrily at Bruce and promising to bring him back unharmed.</p>\n<p>As if she would ever hurt Jason.</p>\n<p>They find him in the kitchen two hours later, flipping slowly through a cookbook without actually reading it. He hands Bruce a folded slip of paper, silent, not looking up, but his posture is slightly different, and he looks happier, more like himself, than he has in a long time. Bruce puts Selina’s goodbye note in his pocket, for later, when he’s alone. </p>\n<p>Damn, he’s going to miss that woman.</p>\n<p>Jason and Tim are sitting on the couch. In theory, they’re watching TV. In practice, Tim is working on a laptop, Jason is comatose with his eyes open, and the TV is on, as it always is now, to maintain the illusion that Jason is—something. Tim isn’t entirely sure what the reasoning is behind the entire family’s tendency to constantly place some kind of stimulus in front of Jason, regardless of whether he responds to it. Tim does it too—he’s the one who turned the TV on as soon as Jason appeared—but he doesn’t understand it.</p>\n<p>And speaking of things he doesn’t understand, these calculations make no sense. They came from Barbara, so they should, but they were delivered by Dick, and the combination of Dick and Barbara doesn’t always yield great results. Tim hasn’t even met Barbara yet, but she sends him messages sometimes. She seems really nice, and Tim is kind of glad they’re sending the Joker to the electric chair, after what he did to her and Jason. But he’s not going to tell Bruce that.</p>\n<p>Jason makes a small, unhappy noise, and Tim turns his attention to the older boy. There’s no sign of anything being wrong.</p>\n<p>“Are you all right, Jay?”</p>\n<p>He shifts slightly and looks away, then briefly makes eye contact, which is generally walking-coma-Jason for “Doing absolutely nothing has gotten boring, so now I want to continue doing absolutely nothing while you pay more attention to me.”</p>\n<p>And normally nothing would make Tim happier than Robin wanting attention from him, but if he can figure out what’s going on in these files, three corrupt politicians will be in jail by the end of the week, and they’ll be that much closer to Bruce officially adopting Tim and whisking the whole family away to somewhere nice and sunny and safe where they can focus on actually getting Jay better.</p>\n<p>Anyway, Tim never knows what to do with Jay. He never knows what to do with people in general. It’s getting easier with Bruce, and Alfred has always been really nice to him. He’s even gotten better about not reacting badly when Dick comes out of nowhere and hugs him. But he doesn’t really know how to interact with normal people, never mind catatonic teen superheroes that he used to stalk. And he has to figure this out.</p>\n<p>“I can’t, Jay. I’m busy.”</p>\n<p>Jason just looks at him.</p>\n<p>“Go bug Dick, okay? I think he’s in his room.”</p>\n<p>He waits the necessary few seconds for Jason to process this, then repeats, “Find Dick, Jay.”</p>\n<p>Jason stands slowly, and Tim gestures encouragingly toward the stairs. Hopefully he’ll have at least a couple hours to work in peace now.</p>\n<p>-</p>\n<p>“Hey, Jay,” Dick says when a shadow appears in his doorway. “You get bored with Tim?”</p>\n<p>He hears Jay shuffling around, but mostly ignores him—he’s pretty much decided that when Bruce leaves Gotham, he’s going with him, and now he’s trying to get his room in enough order that he can actually find things to pack when the time comes.</p>\n<p>Dick keeps up a steady stream of chatter as he cleans. There’s usually not much indication that Jason actually listens to what he’s saying, but as long as he can register that someone is speaking to him, he’ll usually stick around, and Dick likes his Jaybird where he can see him.</p>\n<p>Except he’s restless today, in a way that might have filled Dick with hope a month or two ago, but is mostly just a nuisance today. Days like this, when Jason is kind of being a little shit, used to feel like a start, like he was being more engaged with his surroundings, more himself. Days when he messes with Dick’s stuff and causes minor trouble and then looks blank and innocent when you try to complain.</p>\n<p>It is more like Jason, but it’s as much like Jason as he ever gets, and it’s never close enough. And having his brother back is a miracle, but he wants more.</p>\n<p>Jason is bored. Jason gets bored pretty easily for someone who’s semi-conscious and only tangentially aware of his surroundings. And Bruce and Alfred are both working right now, which explains his presence in Dick’s room. Tim may idolize Jason, but he’s shit at keeping him entertained—the kid doesn’t so much have a lot of boundaries as he is just one big boundary disguised as a small human child. </p>\n<p>They’re working on it. </p>\n<p>“So I told Wally, if you really want to meet the—hey, careful, Jay. Don’t move that stuff.”</p>\n<p>Jay continues to move the stuff.</p>\n<p>“Look, Jaybird, see the piles? I’m trying to sort stuff, so it has to stay in the right piles, okay? Do you want to help me sort?”</p>\n<p>Jason’s glare conveys pretty clearly that he does not want to help Dick sort. Or possibly that he doesn’t appreciate the tone Dick’s taking. Probably the latter, Dick admits to himself. Trust Jay to be half-conscious and still touchy about being patronized. Dick sighs.</p>\n<p>“Okay, sorry. Look, how about this? You sit on the bed and let me finish with this stuff over here, and then as soon as I’m done we’ll go outside. Okay, Jaybird?”</p>\n<p>Jason doesn’t nod, but he does, after a moment’s hesitation, sit carefully at the edge of the bed. Dick abandons his aimless chatter. Maybe he can get some fucking work done before Jay gets needy again.</p>\n<p>He can’t.</p>\n<p>“Jason!” he snaps, less than five minutes later. “Stop touching that!”</p>\n<p>Jason flinches, then lowers it slowly to the floor, eyes wide and unfocused, and Dick realizes—well, it’s not that no one’s gotten after Jay since he came back. They’ve gotten after him, because he’s Jay, and Jay is a menace. But this is the first time since he died that anyone has raised his voice, and it’s not like Jay is trying to get in his way, or even being that annoying, and—and—</p>\n<p>“Shit. Shit, I’m sorry, Jaybird, it’s fine, I’m not—”</p>\n<p>His phone rings. It’s an unknown number, and he’s just going to deal with it quick so he can make sure Jay is okay, doesn’t think Dick is really mad at him, but then he answers, and, well. He knows that voice on the other end, and the voice is saying, “Dick? I need help.”</p>\n<p>He pulls Jason along with him, knocking on Tim’s door before inviting himself in and depositing Jason inside, ignoring both brothers in favor of the phone. He’ll take one of Bruce’s less ostentatious cars. He can be there by ten tomorrow morning, probably, if he drives all night. He leaves.</p>\n<p>-</p>\n<p>Bruce is waiting when Dick lets himself into the Manor three days later.</p>\n<p>“Where the hell have you been? We’ve been worried sick. You didn’t answer your phone, you left your meds here, Jason has been miserable since you—”</p>\n<p>“Roy Harper is passed out in the back of my car,” Dick tells him.</p>\n<p>Bruce blinks once, twice, then his face smoothes out into the calm stoicism of Batman. “Go apologize to your brothers and Alfred. I’ll bring him inside.”</p>\n<p>-</p>\n<p>Roy is smaller than he remembers, sweating and shaking and not quite conscious, deep in the throes of withdrawal. Bruce lifts him carefully, mentally cataloguing the track marks that appear when his sleeve rides up. He knew Roy was on heroin when they saw him last. He’d hoped the boy had gotten clean, but he’d suspected he was already dead, so overall this counts as a win. Hopefully Oliver Queen will see it that way, too. If not, Roy can join them on The Great Wayne Runaway, as Dick has taken to calling it.</p>\n<p>The whole family is gathered when Bruce returns to the house, Tim looking even more withdrawn than usual, Jason eying Dick with an air of deep suspicion. And that’s going to be a problem, he can tell, but it’ll have to wait. He sets Roy down on the couch, and leaves Alfred to check him over while he makes a phone call.</p>\n<p>“Ollie? You’re gonna want to head to Gotham immediately. Ollie, not Green Arrow. And you might want to bring Dinah.”</p>\n<p>When he rejoins the others, Tim and Alfred are gone, presumably getting something for Roy. Jason is standing right where Bruce left him, and Dick is looking anxiously between him and Roy.</p>\n<p>“Do you remember Roy, Jason?” Bruce asks.</p>\n<p>A few seconds for Jay to process, and he shuffles forward, slightly, tilting his head to study Roy, looking unsure.</p>\n<p>“Speedy,” Dick adds, and Jason nods, slightly, which is more of a response than they’ve gotten since bringing him home. Dick reaches out to touch his arm. “Speedy’s real sick, Jay, and I had to go get him right away when he called. I didn’t leave because of you, okay? I’m sorry I yelled at you before I left, and I’m sorry I didn’t tell you what I was doing.”</p>\n<p>Jay leans forward, allowing Dick to hug him. Bruce smiles. That’s one problem solved, at least.</p>\n<p>-</p>\n<p>Oliver Queen reaches Wayne Manor late the following morning. Bruce didn’t tell him what to expect, just that it was important. And it must be, because it’s clearly impacted even the unflappable Alfred.</p>\n<p>Bruce is waiting for him, along with Dick, who stands beside his guardian’s shoulder and glares. Oliver knows Dick doesn’t like him, and he doesn’t blame him for it—the kid was friends with Roy, after all. But usually he stays polite.</p>\n<p>“Roy is here,” Bruce says, effectively distracting him from Dick’s attitude. “He called Dick earlier this week. He’s currently going through withdrawal, and he probably doesn’t want to see you.”</p>\n<p>“Then why am I here?” Oliver asks, because what else are you supposed to say to the news that your long lost kid is back and hates you just as much as ever?</p>\n<p>“I thought you would want to see him.” It’s not the harsh Bat-tone Bruce usually uses to express disapproval at Ollie’s parental failings, and he looks at Dick, anger fading into clear anxiety, then follows Bruce’s eyes to the other end of the room, where Jason sits on one side of the couch, spaced out. That new kid is curled into a ball on the other side, making himself as small as possible, and, well, maybe Bruce is a little more on board with second chances than he used to be.</p>\n<p>Except for the Joker.</p>\n<p>“Yeah,” he says, and no, he is not getting choked up, not choked up at all. “Yeah, I really do.”</p>\n<p>Dick takes him up to the guest room, silent until they reach the door, when he warns him to be nice, then disappears down the hall.</p>\n<p>Roy is sitting on the edge of the bed, lighting a cigarette, looking a little better than Ollie would expect from someone who might have been shooting up as recently as three or four days ago. Of course, that probably won’t last. They’ve been through this before. Never successfully.</p>\n<p>“Oh, fuck no,” Roy says when he sees him, and stands to leave. Oliver grabs his arm.</p>\n<p>“Stay,” he says, and it’s not an order, it’s a plea. Roy sinks back down and lets him take the cigarette lighter—he’s shaking too much to do it himself.</p>\n<p>Roy takes a long drag, then flops down onto the bed. “Thought Dick moved out. I wouldn’t have called if I knew he’d take me home to fucking Batman.”</p>\n<p>“A lot has changed this year.” He doesn’t get an answer, and tries another approach, careful to keep his tone light, unaccusing. “How did you even get cigarettes in this place?”</p>\n<p>“Jaybird. Kid had stashes everywhere when he first moved in. Guess Alfred never found them all.” </p>\n<p>Roy sighs, and sits back up to meet Ollie’s eyes for the first time today. He doesn’t sound angry anymore, or deliberately casual. He sounds vulnerable, almost scared. “What happened to him, Ollie?”</p>\n<p>“He got blown up.”</p>\n<p>“Shit,” Roy says.</p>\n<p>“They’re calling it a walking coma. Bruce thinks he’ll get better, once he gets him away from Gotham.” Bruce is probably the only one who thinks that anything can make Jason better, but Ollie isn’t about to admit that, out loud, in Bruce’s house, sitting on a guest bed with his own irreparably damaged son.</p>\n<p>He doesn’t have to, anyway. Roy is nodding like he gets it, and they sit in silence until the cigarette is done, and Roy puts it out on Oliver’s jacket.</p>\n<p>“Come home, Roy. Please.”</p>\n<p>Roy looks away. “You gonna kick me out again as soon as shit goes bad?”</p>\n<p>“No.”</p>\n<p>“I don’t think I trust you. I know you don’t trust me.”</p>\n<p>Oliver waits quietly until Roy turns to face him again. It takes a long time.</p>\n<p>“Everything has gone to shit, these last few years. Not just with us. People are dead, evil—our friends, Roy. Gone. The bats are done. Batgirl was crippled, Robin exploded, Nightwing had a breakdown. Bruce is taking them all away from here soon. Everything has—everything is different. And you’re my son, Roy. I can’t bear to lose you again.”</p>\n<p>There is a long pause while he thinks it over. Oliver helps him to light another cigarette.</p>\n<p>“Okay,” Roy says finally. “Okay.”</p>\n<p>-</p>\n<p>Roy hugs Dick, ruffles Jay’s hair, and smiles at the little boy no one’s explained to him yet. Less than two hours after Ollie’s arrival, they leave together, and Dick heads upstairs. He knows Bruce is still unhappy, about the leaving and the radio silence and the abandonment of his meds, but he’ll have to wait a few more hours to talk about it.</p>\n<p>Dick spent last night in a chair by Roy’s bed, and the few before that on the road, with a few quick naps in the backseat. And leaving the meds behind really was a mistake, because he feels like shit. He’s going to his room, and he’s going to sleep, possibly for the next several weeks.</p>\n<p>Only, this is not how he left his room. It isn’t…clean, exactly. Someone has collected all of the trash and dirty dishes in the room, but instead of throwing anything away or taking it down to the kitchen, has created tidy little piles in the center of Dick’s floor. The bed has been made, haphazardly, and everything has clearly been organized and put away, just slightly crooked, off-center, not where Dick or Alfred would have left it. And Dick is not going to be able to sleep now, because he has to hug his brother one hundred times first. Because everything about this screams Jay, from the “I’m sorry I upset you let me fix it” of the actual cleanup, to the passive-aggressive “but I still think you’re an asshole” of the garbage pile.</p>\n<p>And yesterday he nodded when Dick asked a question. So maybe—Dick opens his door to look into the hall, and yeah, there he is. This is better, Dick thinks. Definitely better than when they found him.</p>\n<p>“Hey, Jaybird. You wanna come in?”</p>\n<p>He approaches the door slowly, and Dick pulls him into a hug.</p>\n<p>“You cleaned my room, didn’t you?”</p>\n<p>In response, Jason presses his head harder against Dick’s shoulder, and Dick realizes he’s gotten taller since dying. He’s gotten at least a couple inches taller, probably put on some weight, too, and shit, he’s going to be so confused when he wakes up, and everything—chill, Dick.</p>\n<p>He steps back a little. “I gotta crash, Jay. But you can still hang out. Stay in here with me?”</p>\n<p>Jason nods, again, and Dick wakes up the next morning wrapped around his baby brother. Everything is definitely better now.</p>\n<p>-</p>\n<p>Bruce stands outside the study, listening to Tim’s conversation with his mother. It’s the first time they’ve heard from the Drakes since well before the custody battle began, and it isn’t even about the custody—just Janet calling to let her eleven-year-old know that they’ve moved on to another country, won’t be home anytime soon.</p>\n<p>“Neglect and abandonment,” Tim is saying, his voice steady and emotionless. “The fact that you didn’t show up for a single court date hasn’t helped your case.” </p>\n<p>A pause.</p>\n<p>“No, Mom, I don’t think ‘but we didn’t get the summons because we’ve been abroad for the past two years and haven’t spoken to our son in six months’ is going to be an acceptable excuse. You’re losing custody. I don’t know where they’ll come down on visitation rights, but it doesn’t really matter, does it? You don’t have time to visit anyway.”</p>\n<p>It’s the most words Bruce has ever heard Tim say at once, and somehow that’s more heartbreaking than all the rest of it. He wants to go inside, to comfort his son, but he knows this conversation is something Tim would rather handle on his own. </p>\n<p>The silence as Janet speaks on the other line is much longer this time. When Tim speaks again, it’s to ask, in a small, painfully young voice, “Do you love me at all?”</p>\n<p>Bruce enters the room then, hangs up Tim’s phone as he scoops the boy up and settles in the chair. Tim is crying.</p>\n<p>Dick and Jason were both orphans by the time they were eleven. So was Bruce, for that matter. He tries, and fails, to understand how anyone could choose to leave behind a little boy. Especially this little boy, sweet and brave and brilliant, this little boy who discovered Batman’s secret, who realized Jason was alive, who stares at Bruce with wide, hopeful eyes and seems puzzled when Bruce is kind.</p>\n<p>The Drakes are lucky they’re in Europe, because Bruce would like nothing more than to put on his suit and rough them up a little.</p>\n<p>Tim is clinging to him, getting his shirt wet—both things he’ll try to apologize for later. “I love you so much,” Bruce tells him, since evidently Janet can’t.</p>\n<p>Three days after his daughter comes home, Jim Gordon drives her to Wayne Manor to visit her ex-boyfriend.</p>\n<p>The house is quiet—unsettlingly so. There is still chaos, but it’s all half-packed boxes and displaced furniture, not teenagers arguing and back-flipping down the hall. Dick and Jason seem to be packing books, very slowly—Dick will hold one up, Jason will consider, and then he’ll point Dick toward one of the boxes scattered around them. Tim is talking to Bruce as they both wrap dishes.</p>\n<p>He’s known for months, of course, that the Waynes were leaving Gotham. But it hasn’t seemed real until this moment, this domestic scene. He’s known all these boys long before Batman and Robin. Bruce, in too much shock to process what had happened, calmly recounting the events of his parents’ deaths, breaking down only when his butler came to fetch him from the station. Bruce as an angry teenager, breaking the laws that rich young assholes do, paying his fines and rolling his eyes at all the cops. Dick, crying and stuttering in what turned out to be Romani, clinging desperately to the first person to reach him after his parents’ fall, going home with him at the end of the night.</p>\n<p>Jason had been a regular guest at the station for a few years. Someone would bring him in, Jim would give him a good meal, he would nap on Jim’s couch while they found a place to put him, and he’d be sent to a foster family, always running away before dawn. It had taken Jim a long time to realize that Jason was not an exceptionally terrible petty thief, but was letting himself get caught for the food and the rest and the books that Barbara occasionally forgot in his office. Most of the books were never seen again.</p>\n<p>Just last week he’d testified about his previous meeting with Tim Drake, a small well dressed six year old waiting beside the Bat-signal, calmly explaining to Jim that his babysitter had fallen asleep, so he’d decided to come out and see Batman. It was one in the morning, and he’d come alone from the other side of town. Jim had never seen Tim again, but it had become clear throughout the custody hearings that the boy had wandered through Gotham unsupervised in the night on many other occasions. When questioned about it, he had not seemed to understand why this was odd.</p>\n<p>Jim will miss the Waynes.</p>\n<p>While the boys go off with Barbara, Jim settles on the couch across from Bruce. He’ll have to come back again before they leave—today is Alfred’s day off.</p>\n<p>They talk mostly about nothing, both pretending to be focused on their conversation, and not their children.</p>\n<p>Barbara is getting a handle on her wheelchair, and Dick looks much healthier than the last time Jim saw him. Tim is quiet, but smiling, and Jason—</p>\n<p>“He’s still recovering,” Bruce says.</p>\n<p>“What if he doesn’t?” Jim asks, because someone has to, and no one else will.</p>\n<p>Bruce shrugs, but the movement is stiff and forced. “Then he doesn’t. What’s the difference, anyway? He’s mute, his reaction times are slower—”</p>\n<p>“It’s more than that, Bruce.”</p>\n<p>“I know. The doctors don’t think he’ll get better than this. But they don’t think he’s in much pain, either. He’s—it’s so much better already. When—when I found the body, the way it—if he’d been a vegetable the rest of his life, that would have been a miracle. But he came back from the dead, and he’s walking around. It’s—I want more. Of course I want more. I want him reading and laughing and fighting with Dick. But he’s alive. It’s enough. It’s more than enough.”</p>\n<p>“Good,” Jim says, because that means Bruce is going to be an adult about this, rather than Batman or Brucie, going to make the best of what he has instead of pushing and pushing until disaster strikes again.</p>\n<p>He looks away from the children. “So, where are you going when you leave?”</p>\n<p>-</p>\n<p>“He’s out,” Tim reports. Dick leans over him to examine the monitor—the Joker has just escaped Arkham. Batman is close behind, prepared to deliver him to a prison Dick and Tim are sure will issue a death sentence. It shouldn’t be hard; they staged this breakout, after all. Best way to be prepared for the escape. Tim and Dick are keeping an eye on things here, with Barbara doing the same from home. They have Superman on standby. It’ll be easy.</p>\n<p>After about half an hour Jason appears between their shoulders. Dick looks back; Alfred’s in the cave now, too. The only reason Alfred hasn’t been helping tonight is to keep Jason distracted upstairs, but no amount of brain damage could make Jason easy to control.</p>\n<p>Everything is fine for a few minutes, and then Jay starts whining.</p>\n<p>“You okay, Jaybird?”</p>\n<p>He accepts Dick’s hug. Barbara types furiously in the background.</p>\n<p>“Nightwing? I’ve overlaid the video footage on a map of Gotham.”</p>\n<p>Dick lets go of Jason. “Where is he going? There’s nothing in that direction.”</p>\n<p>“Except for us,” Tim says, “but why would he…”</p>\n<p>They both turn to look at Jason.</p>\n<p>“Shit,” Dick says. “Shit, Jaybird.” Because Jay was tortured for hours before the explosion. Of course, of course the Joker knows all their secrets.</p>\n<p>He turns on the comms. “B, we’re compromised. He’s headed for the Manor.”</p>\n<p>“Clark’s not coming,” Tim says, swiveling a monitor to show Dick. Natural disaster in India. Huge. Thousands of innocent lives or helping Batman with one criminal? Not a contest.</p>\n<p>“Okay. Okay. B, I’m suiting up.” He switches the comms back off. “Alfred, help Babs on the monitor. Tim, get Jay out of here. Take him next door—he might not know about you.”</p>\n<p>Alfred slips easily into Dick’s place in front of the computers, and Tim begins tugging Jason toward the door. But Jason is sixteen and stubborn, and Tim is eleven and small for his age. Jay, still focused on the screen, will not budge.</p>\n<p>“Come on, Jason,” Tim says.</p>\n<p>“Jay! Go with Tim.”</p>\n<p>Jason shakes his head, and on another occasion Dick might be happy that his brother’s direct responses have expanded from just the nods, that he’s able to actually focus on the screen and recognize the presence of the Joker. But they don’t have time for this now.</p>\n<p>“Jay!”</p>\n<p>He shakes his head again, then turns to Tim, staring intently.</p>\n<p>“Oh,” Tim says. “Oh. Crap. Dick, my parents got home last week. We can’t lead the Joker there.”</p>\n<p>Jay looks less stubborn now, which means this was the reason he wouldn’t go, which is another thing to celebrate later, but now he’s down a plan, and the Joker is getting closer.</p>\n<p>He turns back to the monitor showing their video call with Barbara. “Babs, could you run the computer shit if I sent the kids away with Alfred?”</p>\n<p>“Maybe? If you need me to I’ll make it work.”</p>\n<p>Before Dick can answer, an explosion goes off. The monitors flicker. Jason screams.</p>\n<p>It was just on the screens. It’s not—they’re safe. It wasn’t here. Alfred goes to Jason. Dick turns back to the monitors; most of them are still running. </p>\n<p>“Talk to me, Babs.”</p>\n<p>“I don’t know where the bomb was, but it blew out—we’ve lost visual on the Joker.”</p>\n<p>Dick swears violently, turning the comms back on. He explains the situation to Bruce as quickly as he can, struggling to change into his costume as he does. There’s no time for modesty, and it’s not like Alfred and probably Jason haven’t seen him naked before.</p>\n<p>“It happened just out of town,” Tim reports, the news playing softly on the computer behind him. “The road is blocked.”</p>\n<p>“The road?” Dick asks.</p>\n<p>“Our road. We’re sitting ducks, Dick.”</p>\n<p>Jason has stopped screaming, but he’s still shaking violently, and Dick thinks he might be crying. He looks from one brother to the other, panic rising. He’s the only one fit to fight here, and he doesn’t know what to do, how to protect these kids depending on him.</p>\n<p>“Alfred?” he asks, finally. Alfred is smart. Alfred will know what to do. Alfred always knows what to do.</p>\n<p>“Boys, go deeper into the caves. Try to get lost; we can find you later.”</p>\n<p>Tim nods, tugging at Jason again. Jason, again, won’t budge.</p>\n<p>“Please, Jay?”</p>\n<p>Jason looks back at Dick and Alfred, clearly unsure.</p>\n<p>“We need Tim somewhere safe, Jaybird. And he can’t go into the caves alone.”</p>\n<p>That does it—the two of them disappear into the dark.</p>\n<p>“I’ll try to meet up with Batman, head him off,” Dick says. “Batgirl, A, stand by?”</p>\n<p>He hasn’t done this in so long now, hasn’t been Nightwing in months and months, and he isn’t ready. He can’t do this, not the Joker, not now. He isn’t ready for this.</p>\n<p>His baby brothers are depending on him.</p>\n<p>-</p>\n<p>“Jay? Jay, are you still here?”</p>\n<p>A hand slips into his, and Tim takes a deep breath. It’s okay. Jason is here, and Jason is Robin, and Robin is awesome. Sure, they’re lost in the dark with the Joker on their heels, but Robin is here, and Robin is his brother, and they won’t let anything happen to each other.</p>\n<p>“I’m kinda scared, Jay.”</p>\n<p>Jason squeezes his hand, and Tim leans back into his chest. He has a sudden, terrifying thought, and turns around, reaching up to touch Jason’s face. Jason. Definitely Jason, Jason’s nose and chin and forehead. Not the Joker. Not the Joker.</p>\n<p>This is the problem with being alone in the dark with your mute brother. Hard to be sure exactly who’s beside you.</p>\n<p>“We’re going to be okay, right Jay? Bruce and Alfred and Dick will come for us.”</p>\n<p>Jason squeezes his hand again, and a loud bang echoes through the caves. Tim jumps. Then the laughter starts.</p>\n<p>Jason pulls him forward, and they’re running blind through twisting corridors. He’s in the caves. He’s in the caves. The Joker is in the caves. Tim can hear Jay hyperventilating. And then he trips, pulling Tim down with him.</p>\n<p>They fall into a ditch, with a ledge overhanging. It’s good enough, Tim figures, for a hiding spot. It’s not as if either of them saw it coming before they fell in. And the Joker sounds far away, still. Someone will find him before he finds them. Definitely. Definitely.</p>\n<p>“Jason?” Tim whispers. “What is it like to die?”</p>\n<p>Jason doesn’t answer, of course, and Tim remembers his scream as they heard the explosion. He’s never heard Jay make a noise like that, not back when he was Robin, talking and laughing and alive, certainly not since he came back. Tim wonders how loud Jason screamed when he was actually in an explosion. Tim wonders how loud he’ll scream, when the Joker kills him. He wonders how the Joker will do it, this time. If he kills them one at a time, Tim hopes he starts with Jason. He doesn’t want Jason to watch him die. He doesn’t think Jason would take that well, especially since they only got Jason to hide down here by telling him to protect Tim.</p>\n<p>Tim thinks he might be crying now. His face feels wet. He rotates his ankle slowly, carefully. Definitely sprained. Maybe broken.</p>\n<p>Jason pulls him closer, practically into his lap, and hugs him tightly. Tim closes his eyes, tries to relax. Jason is an awfully good brother, especially considering the coma thing. Although he’s never seemed less comatose than he has today.</p>\n<p>“Don’t wake up now, Jay,” he whispers. “This would really suck to wake up to.”</p>\n<p>For a long time, there’s nothing but cold and dark and the echoing laughter of a madman. Tim tries the breathing exercises Dick taught him a few weeks ago, before the last custody hearing, and resists the urge to keep talking to Jason. That’ll only make it easier for the Joker to find them.</p>\n<p>He hasn’t seen his parents since they got back last week. Bruce was ready to work out visitation rights, but they didn’t seem interested. He wonders if they’ll be sad when they find out he’s dead. He thinks they might be, in an abstract, impersonal, he-died-too-young-kind of way. They never knew him well enough to be personally sad.</p>\n<p>Tim feels Jay freeze up behind him, hears the cut off, choking sound he makes, before he registers the Joker’s face above them, his green hair so bright Tim can see it in this darkness, his impossibly wide, impossibly white smile, his—</p>\n<p>A shot rings out, and the Joker falls back.</p>\n<p>“Come on out, boys,” Alfred says.</p>\n<p>Tim surges to his feet, struggling to pull Jason up as well. The Joker is—the Joker—Alfred just—Tim thinks he might be in shock.</p>\n<p>Alfred shoots the Joker again, directly in the chest, just as Batman and Nightwing rush in.</p>\n<p>“Self defense,” he announces calmly.</p>\n<p>Bruce stares at Alfred. He stares at the body. He stares at Nightwing, pulling his brothers out of a hole in the ground. Tim is crying, silent, probably not even aware of it. Jason is completely nonresponsive, despite all of Dick’s best efforts. This was not the plan. This was not the plan at all.</p>\n<p>It doesn’t matter. It happened. He needs to pull himself together.</p>\n<p>“Tim, do you remember when I showed you how to get into the caves from the yard?”</p>\n<p>Tim nods.</p>\n<p>“Good. That’s how you got down here tonight. Dick and I left a few hours ago to have dinner with Selina Kyle. Alfred saw the Joker on our security cameras and told you and Jason to hide down here. He came down after you with his gun, just in case. The Joker found you. Alfred shot him to protect you, and Batman and Nightwing got here just too late. Okay?”</p>\n<p>“Okay,” Tim repeats.</p>\n<p>“All right. Nightwing, find a way up into the yard, call the police, and lead them back down here when they come. I have to go block off the passage into the Bat Cave.”</p>\n<p>Dick takes off. Alfred bends down to check Joker’s pulse; Bruce suspects that if he found one, he would shoot him again. He can’t bring himself to care. Alfred’s a civilian, technically, and it was self-defense. Besides, it’s not as if this is the first time Alfred’s killed a man. He was in the military.</p>\n<p>Before going to orchestrate his cave-in, Bruce removes the cowl and goes to check on his sons. Tim doesn’t just let himself be hugged, but actually hugs back, which is a first. Jason seems to have retreated back into complete catatonia. It’s understandable, all things considered, but that doesn’t make it hurt any less. Bruce hugs him, brushes his hair back, and kisses him on the forehead.</p>\n<p>“Everything will be okay now,” he promises. Then he pulls on his cowl and goes back to work.</p>\n<p>-</p>\n<p>They settle on the outskirts of a small town in southern France, and life is different. Sometimes it’s even easy.</p>\n<p>Alfred’s daughter visits on the weekends. Tim is mostly at ease with the family, and he learns French in no time at all. Alfred is teaching him to cook, since Bruce and Dick are both hopeless. Bruce bought Dick a gym in town, and he teaches gymnastics sporadically, when he’s not busy flirting with the girl who lives down the street.</p>\n<p>There’s a significant Romani population in the area, and it’s nice to hear Dick speaking his first language. Nice to see him laughing like that. Bruce hates himself, a little, for not trying hard enough to learn it when he first got Dick. But things are good now. His boys are happy.</p>\n<p>Well, mostly. It takes Jason nearly two months to even begin regaining the progress he’d made before the Joker’s escape. But the specialist they see every week says that walking coma probably isn’t an accurate description. The doctors in Gotham were right—his brain has healed as much as it’s going to. But the specialist doesn’t think the current situation is about physical trauma, considering the instant regression when the Joker appeared. It’s mental, he says. It’s emotional. Which means he could theoretically snap out of it at any time.</p>\n<p>Bruce doesn’t care if Jason wants to spend the rest of his life essentially catatonic. Well, he does, of course. He misses his son. Misses him desperately. But if Jason doesn’t fight with Dick and swear in Spanish and spend hours reading anything with words, if he never does any of the things he’s always done again, Bruce can live with that. He just wants him to be happy.</p>\n<p>But things are getting better, he thinks. Not as good as they were, near the end. But they’re making progress.</p>\n<p>Barbara is calling herself Oracle now, and running a small team back in Gotham. </p>\n<p>Tim has recently been spotted with actual friends. Or, at least, with boys his age that he speaks to enthusiastically and with lots of hand gestures. </p>\n<p>Bruce is pretty sure Dick is dating the girl from down the street, though no one’s actually said anything yet. He hopes she sticks around—she thinks Tim and Jason are adorable, and Jason’s clear irritation about this is one of the strongest reactions they can get out of him. </p>\n<p>It also confirms that whatever else has been shaken up in his brain (and it’s so hard to tell with someone so unresponsive), his knowledge of French is still intact. He’s scowling at pet names before Bruce can even translate them.</p>\n<p>Bruce is mostly fluent, but Jason grew up bilingual, and when he decided at thirteen that translations are stupid, he had no trouble picking up a second Romance language. He knows all the Romance languages now, and a little bit of German. Just a few weeks before he died, Jason was complaining about how he couldn’t read the Iliad in the original Greek.</p>\n<p>Bruce would do anything for his son to have a chance to learn Greek.</p>\n<p>Alfred and his daughter are in Paris this weekend, and Dick has convinced Tim to invite his friends over, so Jason is hiding in the attic.</p>\n<p>Bruce doesn’t think that Jay dislikes Tim’s friends, really. It’s just that their presence tends to make Tim loud and excitable in imperfect French. And loud and excitable is Dick’s natural state, so it can get to be a little much. Bruce understands. He feels the same way. But he also doesn’t like to leave them unsupervised for long—Dick is only technically an adult. He’s probably able to get into more trouble than Tim and his friends combined, and he’ll definitely egg the younger boys on.</p>\n<p>He stands up slowly. “I have to go back down, okay, Jay? I’ll save some food for you, if you want to stay up here.”</p>\n<p>Jay reaches out, fingers just brushing the edge of his pants leg. “Stay?”</p>\n<p>His voice is hoarse and quiet, and his face is hopeful-awkward-I-love-you-but-I’m-too-cool-to-admit-it Jason, and Bruce sits down again. Dick can handle things downstairs.</p>\n<p>“Of course, Jay,” he says. “Of course.”</p>"
}