{
  "id": "11035398",
  "url": "https://archiveofourown.org/works/11035398?view_full_work=true",
  "author": [
    "LemonadeGarden"
  ],
  "title": "Yesterday's Voices",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Batman - All Media Types"
  ],
  "relationships": [
    "Bruce Wayne and his kids"
  ],
  "characters": [
    "Bruce Wayne",
    "Tim Drake",
    "Jason Todd",
    "Damian Wayne",
    "Dick Grayson",
    "Stephanie Brown",
    "Cassandra Cain",
    "Alfred Pennyworth",
    "Damian's numerous pets"
  ],
  "additional_tags": [
    "Fluff and Hurt/Comfort",
    "Little bit of angst",
    "Mostly just lots of awkward family bonding",
    "Amnesia fic",
    "Canon-Typical Violence",
    "Other Additional Tags to Be Added",
    "Bruce Wayne is a Good Dad",
    "But a perpetually confused one",
    "The Knights being a shitty baseball team is also a recurring theme"
  ],
  "language": "English",
  "series": "",
  "published": "2017-05-29",
  "completed": "2017-08-15",
  "words": "49,000",
  "chapters": "16/16",
  "comments": "1,901",
  "kudos": "18,874",
  "bookmarks": "5,695",
  "hits": "235,169",
  "summary": "<p>While trying to take down a drug cartel that deals with memory altering drugs, things go awry, and Batman wakes up with no recollection of the last five years.<br>As a result, his family must now race against time to find the antidote, while also having to deal with a Bruce who still thinks Jason is Robin. A Bruce who doesn't recognise most of them. A Bruce far less jaded and cynical than the one they're used to. A Bruce who still <em>cares.</em></p>\n<p>Alfred does a lot of remembering.</p>",
  "notes": "<p>Um. This is the amnesia fic that no one asked for. I did this instead of focusing on my WIP. *Hides in a corner*</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Just to clarify, I'm not pushing any OCs or anything, it's just that this chapter required some degree of outsider perspective to move the plot along.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_9_endnotes\">more notes</a>.)\n</p>\n<p>@ all of you who were waiting for the other shoe to drop: THIS SIZE TEN MEN'S LEATHER OXFORD IS FIRMLY ON THE GROUND NOW.</p>\n<p>Keep in mind that none of this stuff is particularly scientifically accurate. Then again, a memory altering drug isn't too scientifically accurate either. This is me stepping out of the car and showing the police officer my massive creative license and hoping I don't get arrested.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_15_endnotes\">notes</a>.)\n</p>\n<p>Epilogue up soon. Be sure not to miss it!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_16_endnotes\">notes</a>.)\n</p>\n<p>(yes yes I know that Clark has indestructible skin so he can't actually get a tattoo but I did it for the laugh so don't @ me)</p>\n<p>And that concludes this story! Thank you all for reading, this has been an absolute pleasure to write. I'd love it if you left a comment and told me what you thought.</p>\n<p>As always, you can come talk to me on <a href=\"https://lemonadegarden.tumblr.com\" rel=\"nofollow\"> Tumblr </a>.</p>",
  "text": "<p>\n<em>He pulled the boy closer. Just remember that the things you put into your head are there forever, he said. You might want to think about that.</em>\n</p>\n<p>\n<em>[The Boy:] You forget some things, dont you?</em>\n</p>\n<p>\n<em>[The Man:] Yes. You forget what you want to remember and you remember what you want to forget.</em>\n</p>\n<p align=\"right\"><em>-The Road</em>, by Cormac McCarthy.</p>\n<p align=\"center\">*</p>\n<p align=\"center\"> </p>\n<p>They don't sedate him.</p>\n<p>That is their first mistake.</p>\n<p>He twists one of the men's elbows and flips him down to the ground, kicking him in the stomach. Hard. He lands a solid hit on the other man's jaw, and when he's sure that both of them are down, he runs. He runs till he can't anymore and stops, panting, with his hands on his knees.<br>\nHe looks around.</p>\n<p>He's in a dank alleyway now. He stands upright again, and looks at his gauntleted hands. So he can fight. Really well. He can't remember his own name, but he can fight. He frowns. No, that can't be right. He <em>does</em> remember things.<br>\nHis name is Batma- <em>Bruce</em>. It's Bruce. Wayne. He's thirty four years old. He has two children. Dick and Jason. Dick is in college and Jason is still in school. Dick is eighteen and Jay is fourteen. He can remember that. Alfred is sixty two. Clark is thirty one. Selina is twenty nine. He remembers going to bed after patrol yesterday. It was cold and raining and Jason hadn't finished his homework yet.</p>\n<p>It's not cold now. Actually, it feels like summer. He frowns again. His head hurts so much. Why? There's a small pinprick of pain on his left bicep. He looks at it. There's a small hole in the batsuit there. He almost doesn't see it. They must have injected him with something. He has to call Jay. Make sure he's okay. Call Alfred. Report back to base.</p>\n<p>He reaches for the small burner cell that he keeps in one of the pouches in his utility belt, but it's not there. He looks at the belt in disbelief. It's smaller. Sleeker. In fact, now that he thinks about it, his <em>whole</em> suit is different. It's lighter. Less clunky. He stretches his arm in front of him. More flexible too. It looks like it's made from a material he'd kill to get his hands on. Some kind of kevlar-silk mesh body armour. darker too; it's almost black. Less yellow on a suit that didn't have too much colour to begin with anyway. The cowl still feels the same.</p>\n<p>Except there's something inside his ear.</p>\n<p>He grabs at his cowl, trying to take it off. The cowl comes off smoother than it usually does- something he takes note of- and he slips whatever was in his ear out. He examines it, turning it back and forth on his palm. It's a small metal. . . Bluetooth earpiece? No, it's too small for that. It's the size of a earbud. There's a button on the side. Curiosity gets the better of him, and he presses it.</p>\n<p>Suddenly there's a red light beeping on the side. He can hear a voice, slightly garbled, coming from the small speaker built into it. Bruce quickly puts it back in his ear.</p>\n<p>\"-ed Robin to Batman, I repeat, Red Robin to Batman. Are you there? Comm lines have been on and fully secure for the last twenty hours. Red Robin to Batman. Please pick up. Switch on your comm, Batman. If you don't answer in another fifteen minutes, Nightwing's going to head to your last seen location for Retrieval. The school play can go to hell. Red Robin to Batman, I repeat, is anyone there? Red Robin to Ba-\"</p>\n<p>\"Yes,\" Bruce says, feeling slightly flustered. Is he supposed to talk back into the. . . the earpiece? But he doesn't have a mouthpiece. How does it work? Already his mind is racing, trying to figure out how to engineer one himself. \"It's Batman. I'm reporting. Who is this? Jason? Is that you?\"</p>\n<p>\"What?\" 'Red' Robin says, sounding slightly annoyed. \"No. It's Tim. Where have you been? Your tracker is unresponsive. There's been radio silence from your side for almost a day. Over.\"</p>\n<p>\"I. . . don't really know.\" Who's Tim? \"Um, over.\"</p>\n<p>\"What? You don't know where you are? Are you sure? How out of it are you? Tell me which street you're on. Over.\"</p>\n<p>Bruce looks around. The alleyway has no markers. He walks out of it slowly, putting his cowl back on, and trying to stay in the shadows. The street in front of him is empty. It looks like Pendleton Street, except there are a dozen new shops on it that he's never seen before. Alternate Universe? He can't rule it out.</p>\n<p>\"Pendleton Street. I think. Near a Starbucks. Over.\"</p>\n<p>\"Roger. Stay put. We'll have Red Hood pick you up. He's in the area. You better tell us what's going on when you're back in the cave. Over and out.\"</p>\n<p>Who's Red Hood? Bruce is about to ask, but the comm line switches off abruptly. He keeps it on from his side, just in case.</p>\n<p>The road is completely empty, because it's almost midnight, and it's a quiet part of the city, and Bruce walks onto it, trying to assess his surroundings. There are newspapers and plastic trash bags moving across the road in the slight breeze. A faint siren in the distance. He can smell piss and smoke in the air. Definitely still Gotham, then. The light from the streetlamps is starting to hit the shops at a slant. With a start, he stops in the middle of the road. He can see his reflection in one of the glass windows of the shops. Even with the cowl on, he looks. . . <em>different</em>.</p>\n<p>Older.</p>\n<p>He looks around the street to see if no one's around, and slowly takes off his cowl again.</p>\n<p>Then he stares.</p>\n<p>He has <em>wrinkles</em>. Faint ones, around his mouth and eyes. And some of his hair is gray, around his temples. His eyes look a little lighter, more washed out. Almost a pale gray-blue. There's a notch in his brow that definitely wasn't there yesterday.</p>\n<p>He looks astonishingly like his father. It makes something in his chest contract.</p>\n<p>He blinks, and when he opens his eyes he still looks the same. What is <em>happening</em>?</p>\n<p>He thinks he may be beginning to get a general idea.</p>\n<p>Before he can read into it any further, the communicator switches back on with a small beep noise.</p>\n<p>\"Red Robin to Batman, Red Ro-\"</p>\n<p>\"Yes, Tim.\" He says. Does he know a Tim, then? Maybe he's concussed, and he's temporarily forgotten about him. They might even be close. Or at least, they're close enough that Tim knows about Batman. And so does 'Red Hood'. And 'Nightwing'. He can recall something about the Joker wearing a red hood in the early days, and some kind of Kryptonian legend about a great hero called Nightwing that Clark told him about, but no more than that.</p>\n<p>\"Uh. This is kind of awkward, but Jason doesn't want to come pick you up. He said something about not wanting to have to 'chaffeur around a fascist, self-righteous cock-knob of a man'\" Tim clears his throat, sounding a little embarrassed for having to repeat that. \"I'm assuming this is about the fight that you guys had two days ago.\"</p>\n<p>\"Jay?\" Bruce laughs, almost feeling delighted at having something familiar to focus on in this new confusing situation. So Jason must be Red Hood then. That clears some doubt, at least. Still, he can't remember having any fight with him.\"Jay said that?\" He smiles a little. \"I have to admit, that does sound like him.\"</p>\n<p>There's a small pause from the other side of the comm line. \"You're not. . .mad?\"</p>\n<p>\"Why would I be mad? He's just a boy. Boys have tantrums sometimes. He'll get over it, it's okay.\" He doesn't even really know why he's telling Tim all of this. He doesn't even know him. There's just something about him, even if it's a scrambled voice on a communicator from a secure line, that makes Bruce's brain say: <em>you know him. You trust him.</em></p>\n<p>How strange.</p>\n<p>There's a longer pause on the comm line; it's long enough that Bruce is about to speak when Tim says, \"Uh. Okay. It's just that you're usually really mad when he does something like this. Like. <em>Really</em> mad.\"</p>\n<p>That doesn't really sound like Bruce. He opens his mouth to say something, when Tim starts to speak again. \"Um. Anyway. I'm just sending the batmobile to Pendleton on auto. I tracked it down to a warehouse near your last seen, and I'm remote controlling it down to your location. You'll just have to drive it back on auto. Sorry.\"</p>\n<p>\"Wow,\" Bruce says, suitably impressed. \"<em>Thank</em> you, Tim. That sounds like it would have been tough to do.\" Especially for a kid his age. He sounds what? Sixteen? Seventeen? Older than Jason, maybe, but still far from adulthood.</p>\n<p>\"Uh,\" Tim says, \"Thanks? I do this pretty much all the time, so.\" He sounds confused, and almost a little flustered. Like he's not used to getting much praise for his work.</p>\n<p>Another one of those long pauses over the line. Bruce waits patiently. He thinks he may be beginning to understand what those pauses mean.</p>\n<p>\"Just. Just get home soon. Demon Brat's worried.\" Tim mumbles, and cuts the line.</p>\n<p>While Bruce waits for the batmobile to drive onto Pendleton Street, all be can think of, is one thing.</p>\n<p>What the hell is a Demon Brat?</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Jason sits in a seedy pub, nursing his fourth beer and a raging headache.</p>\n<p>He can hear the dim sounds of the sports channel in the back, along with the general hubbub of people cheering for the knights or whatever. It's almost the end of the season. Gotham Knights versus Central City Stars. Jason doesn't really care.<br>\nHe hasn't seen a single game of baseball unless you count that day went he was thirteen and Bruce took him to see a match in the ninety degree weather. He can remember sweating his butt off, and the smell of stale hot dogs and caramel popcorn. The people milling around in the stands. Bruce trying to hide his face with shades and a Knights cap and smiling sheepishly at the Jumbotron when they found him anyway. He had tried to get Bruce to eat a chilli dog and then send a picture of the face he would make to Dick. But Bruce wouldn't do it because he claimed that chilli dogs were the worst food to come into the world. Jason wondering if Bruce could hit the ball better than any of those star players, and staring at him until Bruce turned away from the game and said, \"what?\" and Jason just shook his head, so Bruce pulled him closer and ruffled his hair and they watched the rest of the game in silence. The Knights had lost that day, but then again, they always lost, so no one was really surprised. Crowds grumbling good naturedly as they left the stands, and Bruce placing his cap on Jason's head and promising to buy a mitt for Jason for when he wanted to play ball with Bruce.</p>\n<p>Jason leans his head against the cool glass of the mug. The condensation trickling down the cold glass wets his forehead.</p>\n<p>Except he never did remember to buy that fucking mitt.<br>\n<br>\nHe asks for another beer, and the bartender takes his keys away. He glares into his drink. Whatever. He'll just hotwire the bike. He idly watches as the Knights lose again. People cheer half-heartedly for them anyway. Jason shakes his head. This fucking city. Never giving up on their heroes. Maybe it's time they do. He certainly has.</p>\n<p>He sits there while the crowd slowly starts to move out of the pub, the soft shuffling around of shoes scuffing against marble in his ears. The bar's almost empty now. There's a guy a little ways down him by the bar, but that seems to be about it.</p>\n<p>Jason drinks from his mug. The guy sitting two stools down asks the bartender to switch to a news channel. \"I heard that two days ago Batman took down a major chunk of the Pastorelli cartel,\" he tells Jason excitedly, looking at the television. Sure enough, there's footage of Bruce taking down some mafia members in a restaurant. Jason scrubs at his face.</p>\n<p>\"I know.\" He says. <em>I was there,</em> he thinks. It didn't end well for anyone<em>.</em> Especially not for Jason himself.</p>\n<p>\"Man, I hate those guys.\" The man is saying, his eyes glued to the TV, \"they shot my brother Vince when he refused to join their gang.\"</p>\n<p>\"I'm sorry.\" Jason says, not even looking up at the screen. He just wants to go home and sleep for the next eighteen hours.</p>\n<p>The man makes a disaproving <em>tch</em> sound when Robin is shown on screen. \"What does Batman need those kids for?\" He says, splaying his arms around. \"He's plenty badass on his own.\"</p>\n<p>Jason looks down into his beer mug. On TV, Damian is throwing batarangs around, grinning like he's having the time of his life.</p>\n<p>\"Maybe those kids need him,\" he mumbles into his mug, quiet enough that the man can't hear. At the baseball game all those years ago, Bruce had pulled him onto frame in that Jumbotron shot, and put an arm around him, and Jason had grinned and waved. 'My son' Bruce had mouthed, pointing at Jason.<br>\nOne of the best days of his life. The day to shape all days upon.</p>\n<p>\"What?\" The man says.</p>\n<p>Jason shakes his head. \"Nothing.\" He says.</p>\n<p><br>\nThe man leaves after a while, but Jason stays, tapping his fingers against the wood of the bar, and starts when his phone suddenly rings. He checks the caller ID, and then scowling, he picks up the phone.</p>\n<p>\"It better be a fucking emergency,\" he growls. He's off duty.</p>\n<p>\"Jason, I think it maybe kind of is,\" Tim says. \"I need you to pick up Bruce from Pendleton road. He went missing yesterday while following up on that drug trafficking case, and he turned up only today. He sounds,\" here Tim pauses, and for a moment Jason can only hear him breathing into the phone, \"not like himself. A little disoriented. Could you drop him off to the manor?\"</p>\n<p>\"No.\" Jason says, and hangs up. Because fuck Bruce and his stupid family, that's why.</p>\n<p>Two seconds later, Tim calls him again. \"Jason, <em>please</em>.\" He says.</p>\n<p>Jason struggles to contain his anger. \"Why can't you do it yourself? I'm not driving that fucking fascist, patronising cock-knob <em>anywhere</em>. He can take the fucking bus or something. Like the rest of us.\"</p>\n<p>Tim sighs. \"I have that leg fracture, remember? From yesterday's patrol? I didn't think <em>you</em> of all the people could forget.\"<br>\nJason winces.</p>\n<p>Tim continues, \"I can't do much other than monitor duty and mind the comm lines.\"</p>\n<p>\"Well, ask Golden Boy to do it, then. He's good at cleaning up Bruce's messes.\" Jason says.<br>\nTwo days ago, Bruce glared at him and said that he was being an irrational idiot, and idiocy and vigilantism didn't mix well together, and that maybe Jason should consider a different stream.</p>\n<p>\"I was just trying to help!\" Jason had shouted at him, from across the batcave. Tim was getting his leg set by Alfred, and everyone else was sitting by the medbay, unnaturally quiet as they watched Bruce and Jason go rounds again.</p>\n<p>Bruce had glared at him again. Jason could never quite perfect Bruce's glare. That awful way he'd look at you that made you feel like the crap whenever you screwed up, or did something differently from the way Bruce would had done it. Something less than perfect. Jason looked at the floor.<br>\n\"Clearly. You almost got all of us killed.\" Bruce had growled back, bandaging Damian's leg with more roughness than usual. Damian had been silent too, looking at Jason almost sympathetically. Or, whatever counted as sympathy for Demonspawn.</p>\n<p>Jason clenched his jaw. To his horror, he could feel himself fighting back tears. \"I wasn't-\"</p>\n<p>\"Thinking. You weren't thinking.\" Bruce had said, sounding so infuriatingly calm and rational that Jason had wanted to tear his hair out. \"It's obvious you're incapable of thinking objectively in a these kind of situations. Now leave. You're done here.\" A brusque dismissal.</p>\n<p>\"Bruce,\" Dick piped up, his eyes holding Jason's in a show of quiet support. Jason looked away and blinked rapidly. \"maybe you should cut him some slack. He was jus-\"</p>\n<p>Bruce turned his glare towards Dick, and Dick fell silent.</p>\n<p>\"I said, <em>leave</em>.\" He said to Jason, not even looking at him anymore.</p>\n<p>So Jason left.</p>\n<p>Oh, and Bruce also said a bunch of stuff about how Jason wasn't fully living up to his entire potential, and could he just get it though his thick head that Bruce was always fucking right and Jason was always the dumb, violent, trigger-happy numbskull who drank, ate and shat stupid.</p>\n<p>Okay, so maybe those weren't his exact words. But he had definitely implied it. It still hurts. He doesn't even know why. He stopped caring about Bruce's opinion of him a long time ago. He thinks. God, his head hurts. He slides the half empty mug away.</p>\n<p>Fuck Bruce for saying that. Fuck all of the others for not intervening.</p>\n<p>\"Dick's at Damian's school play.\" Tim is saying through the phone, and Jason is really only half listening at this point.</p>\n<p>Jason snorts. \"Guess who's actually supposed to turn up to all of those plays.\" He puts some cash on the table, and walks out of the bar.</p>\n<p>\"I <em>told</em> you, Jason. He went missing.\"</p>\n<p>Jason rolls his eyes. What an enabler. \"Yeah? When was the last time Bruce went to a school event?\"</p>\n<p>There is silence on the other end of the phone. \"Exactly.\" Jason says, walking out to the parking lot.</p>\n<p>\"Besides,\" he says, pulling out the wires from the connector on his bike, \"I'm way too drunk to be driving anywhere right now.\" He pulls out a small piece of wire from his jacket pocket and jams it into the connector. \"Call Steph or Cass.\"</p>\n<p>\"I can literally hear you hotwiring your bike. They're out patrolling the east end.\" Tim says, sounding tired. \"Believe me, you were my last option.\"</p>\n<p>\"I'm flattered,\" Jason says, \"but no.\" He hangs up again, and switches on the ignition. The engine purrs, and Jason grins for the first time that day.</p>\n<p align=\"center\"><br>\n*</p>\n<p>The batmobile drives by smoothly next to Bruce, and he gets in. It's completely different too. Different from all the models that Bruce has built over the years. He pulls himself into one of the seats and with a single practiced motion, he flicks on autopilot while putting on his harness, and saying, \"Batcave. Take the freeway.\"</p>\n<p>He freezes. Why did he do that? It's like someone took over for him, momentarily. Since when does he talk to his <em>car</em>? And he strapped himself into the car like he's been doing it for <em>years.</em></p>\n<p>Maybe it was just a lucky hunch.</p>\n<p>Probably not.</p>\n<p>He only barely manages to prevent himself from jumping when a disembodied, female, robotic sounding voice says, \"Estimated time of Arrival: seventeen minutes. Light traffic near Point place.\"</p>\n<p>Bruce is not sure what to say back, so he stays silent. The batmobile starts to glide down the street, accelerating slowly until it's going at a positively breakneck speed. It drifts expertly at the turn of the road; he can hear the tires squealing against the road. Despite himself, Bruce is starting to grin. He's always liked fast cars. It seems like a metaphysical constant through time and space- alternate universe or otherwise. Bruce will always like fast cars.<br>\nAnd this is a very, <em>very</em> fast car.</p>\n<p>He grins again when the car makes another perfect sharp turn at Point place.</p>\n<p>By the time he's reached the cave, Bruce is flushed with adrenaline. The car glides through the tunnels heading to the cave, decelerating smoothly as is comes closer to the parking pad. Bruce starts to take of his harness. He needs to see what's under the hood of this car, for sure. There's no way it could cost south of a million dollars to put together.</p>\n<p>The last tunnel that he heads down finally opens up into the gargantuan caverns underneath the manor, and the car parks smoothly into its respective area. He steps out of it and is immediately greeted by a cow.<br>\nIt moos happily.</p>\n<p>He stops. Blinks. Sometimes after a long night of patrol he's often tired enough that he sees things that aren't really there. But it's still there. It moos again.</p>\n<p>There is a <em>cow</em> in the batcave.</p>\n<p>It has a collar around its neck, along with a bell, that says '<em>batcow</em>'.</p>\n<p>He wonders idly if he should take a photo of this and send it to Clark.</p>\n<p>\"Jason?\" He calls out instead, still maintaining uncomfortable eye contact with the cow, \"Is this your idea of a practical joke?\" Jason had once written 'DO NOT STEAL' in large neon letters on the tires of the batmobile, as a prank. He remembers that he'd laughed about it, but not before making Jason scrub the letters off with bleach. The look of pure misery Jason had had on his face while sitting on the floor of the batcave, a bottle of bleach and a heavy duty metal scrubber in hand, had been reward enough for Bruce.<br>\n(Eventually he'd felt bad enough to give him a hand, and make sure he didn't to scrub everything off but 'STEAL')</p>\n<p>A tiny person runs past him, grabbing hold of the cow's collar. He's wearing a brown pair of pants and has green paint on his face. \"Sorry, father,\" the tiny person says in a sniffy sort of voice, \"he got out of his enclosures. It wouldn't have happened if Drake had been minding him.\"</p>\n<p>Before Bruce can fully break down that sentence and have a crisis about it, another boy with a pair of crutches and a leg in a cast hobbles towards him. \"Oh good,\" he says, sounding like he's about to kill someone, \"you're here. Now <em>please</em> tell Damian that he's acting crazy,\" he says, shooting a murderous look to the tiny boy with the cow, \"and that just because I'm doing monitor duty doesn't mean I'm going to sit around and babysit his fifteen thousand animals.\"</p>\n<p>\"Making yourself useful is the least you could do,\" the little boy sneers, \"after all, it's not like we really even notice your absence during patrol.\"</p>\n<p>The boy in the crutches opens his mouth and closes it again multiple times, like a goldfish. Then he turns towards Bruce. It looks like his head may explode. \"Do you <em>see</em> what I have to deal with?\" He says, gesturing towards the other boy.</p>\n<p>Bruce takes a careful step back. There have been very few occasions where he has not understood what is going at <em>all</em>. He can count them on one hand. This is most certainly one of them.</p>\n<p>\"<em>Omigod</em>, are you guys fighting about that stupid cow again?\" A cheerful voice says, from the other end of the cave. \"For the <em>last</em> time dude, don't let it walk around the cave. It shits <em>everywhere</em>!\"</p>\n<p>There is a cow in his cave. A cow that shits everywhere. Along with numerous children. It occurs to Bruce that he could just get back into the batmobile and drive far away, coming back only after his hallucinations have subsided.</p>\n<p>The owner of the voice is a blonde girl dressed in a purple combat suit. She's standing near the side entrance. She puts her hands on her hips like she's their mother, giving the smaller boy an annoyed look. \"And then Alfred takes it out on us, you know. I don't know about you, but if I have to listen to one more <em>Cleanliness is next to Godliness</em> lecture, I might literally die. Like, legit choke and run out of air to breathe.\" She acts like she's running out of breath, gasping and clawing at her throat.</p>\n<p>Crutches boy snickers. The other boy glowers darkly at her. \"Whatever, <em>fatgirl</em>. At least if you die the lift will stop getting overloaded all the time.\"</p>\n<p>The girl in the purple suit narrows her eyes at him. \"Say that one more time, and I'll tell Alfred to take away your snack privileges.\"</p>\n<p>The tiny boy mutters something under his breath, but remains reluctantly silent.</p>\n<p>The blonde girl grins. \"That's what I thought. Anyway, that whole thing about Tim being useless during patrol is totally true, so I'll give you points for that.\"</p>\n<p>The boy with the crutches (<em>Tim</em>?) rolls his eyes, but finally turns to Bruce. He looks at him expectantly.\"So? What's going on?\" The conversation that the girl in the purple outfit and the tiny boy were having is temporarily put on hold as they too, look at him curiously.</p>\n<p>\"What's going on about what?\" The girl is saying in the background, but Bruce can barely hear her over the white noise in his head. His headache is back and it's much worse.</p>\n<p>Bruce sits on the hood of the batmobile. Bits of the conversation are only now catching up to him. He's feeling a little faint. He puts his hands over his eyes, trying to figure out what's happening. He's not stupid. He is very, <em>very</em> far from stupid. It'll come to him eventually.</p>\n<p>Now would be a really good time, though.</p>\n<p>His head shoots sharply up to the little boy holding the cow's collar. Did he just call him <em>father</em>?</p>\n<p>He hears another voice before he can say anything. Someone else has come down to the cave.<br>\n\"Hey, did you guys see that picture of Damian I sent on the group chat?\"</p>\n<p>Bruce tenses up. This voice, he does recognise.</p>\n<p>It's Dick.</p>\n<p>He looks at him, expecting a stony look back, or an awkward half shuffle upstairs, with Dick mumbling \"Just came here for some stuff I left behind\" and then Bruce will smile extra wide, or laugh kind of heartily and say in a voice that sounds too jolly and fake something like \"I hope you're not being this forgetful with your bills!\" or \"Alfred's been waiting to see you,\" and Dick will kind of nod, not really looking up from the floor, and there will be a sad, stunted little silence where they will both pretend that everything is okay.</p>\n<p>Instead, Dick grins at him. <em>Really</em> wide. And not the fake, overcompensating kind of a wide grin that they've been doing of late. A <em>real</em> one. He smiles at Bruce like he really means it. Bruce almost staggers under the weight of it.</p>\n<p>\"Hey, we've been looking all over for you! What happened? Tim said your communicator switched off? Mine does that too sometimes, I keep meaning to tell Babs about it. Oh, and did you see that awesome new update Babs made to the system? Hey, Tim, tell Bruce how cool the update is. Oh, and hey! You're gonna want to see pictures of Damian's school play. Man, he's a genius. Not to brag or anything, but he's definitely the next Robert De Niro.\" Dick says proudly, and all in one breath.</p>\n<p>\"I don't know,\" the girl is saying, twirling a strand of her hair idly, \"I never liked De Niro. Meryl Streep, now <em>she's</em> a genius.\"</p>\n<p>\"<em>Grayson</em>, I was a <em>tree</em>.\" The angry boy with the cow spits out. He still looks a little pleased though.</p>\n<p>Bruce gets off of the hood of the Batmobile. He can't sit for this. He needs to think. Who are these people? And why are they acting like they know him? He walks towards the computer consoles, pacing.</p>\n<p>\"Uh, what's wrong with him?\" He can hear Dick whispering to the others.</p>\n<p>Bruce puts his hands over his eyes again, pressing them against his skull. His head throbs painfully, a persistent pressure at the back of his skull. Think. <em>Think</em>.</p>\n<p>\"I don't know. He was acting weird on the comms too,\" the boy with the crutc- Tim, is whispering back.</p>\n<p>Someone steps out of the shadows, near where the blonde girl had been standing. and Bruce nearly jumps again. It's a girl. She has short, dark hair, and large, clear eyes. There's something pixie-like in her movements. She's wearing a suit not unlike Bruce's.</p>\n<p>\"Oh, hey Cass!\" Dick says happily. \"Did you see Damian's photos on the group-\"</p>\n<p>She holds a hand up. Dick stops talking.</p>\n<p>She looks at Bruce, at his hunched shoulders and his clenched fists. She walks towards him slowly, and takes off his cowl. For some reason, he lets her, bending his head to make it easier for her. In a room full of strangers, no less. She studies his eyes, two hands on either side of his face.</p>\n<p>\"I don't know what's happening,\" he whispers to her. The entire cave is suddenly very quiet. No one is talking.</p>\n<p>She looks at him meaningfully, and pats his cheek, like he's a baby that's been crying.<br>\nShe turns to the others. \"His head is wrong.\" She announces.</p>\n<p>Tim raises his eyebrows. \"What?\"</p>\n<p>The girl in front of him- Cass- adopts a frustrated expression. She puts a hand in the air, like she's trying to grasp something. \"He has a-\" she pauses, her hand still raised.</p>\n<p>\"A headache.\" Bruce supplies. Cass smiles at him, and he finds himself smiling back on reflex.</p>\n<p>\"It's deeper.\" She says.</p>\n<p>\"Deeper than a headache?\" Tim asks, leaning on a crutch and looking confused.</p>\n<p>Cass nods, looking pleased with herself.</p>\n<p>\"That doesn't make any sense.\" Damian says, but he's looking back and forth between Cass and Bruce, his eyes flickering nervously. There's no heat in his voice.</p>\n<p>Bruce takes a deep breath. \"Who are you?\" He asks.</p>\n<p>The boy, Damian, frowns. For some reason, he's reminded of Talia. Wow, Talia. He hasn't thought about her in years. \"I'm Damian.\" He says, like it's perfectly obvious, like Bruce is acting stupid.</p>\n<p>\"I'm not stupid.\" Bruce says defensively.</p>\n<p>\"We know you aren't, Bruce,\" Dick says, softly. \"Look, maybe you should just go lie down for a while, you might be concussed. I'll get Alfred here to check up on-\"</p>\n<p>But Bruce has stopped listening, and he has gone very still.</p>\n<p>They're right. He's certainly not stupid. In fact, he's smart enough to have understood something very important.</p>\n<p>He has wrinkles now. And gray hairs.</p>\n<p>Dick looks a little older.</p>\n<p>He's surrounded by people he doesn't know, who are acting like they've known him for years.</p>\n<p>His armour is sleeker. Better. So is the batmobile.</p>\n<p>Some kid called him father. He looks a little like Talia. That night with Talia was eight years ago. But the boy looks about thirteen.</p>\n<p>There were new shops on Pendleton Street that he had never seen before, and he knows every fucking <em>inch</em> of Gotham.</p>\n<p>This is not an alternate dimension. This isn't time travel.</p>\n<p>\"What year is it?\" He rasps out, looking at all of them. They look back, confusion and blank looks on their faces.</p>\n<p>\"What are you talking about?\" The blonde girl is saying, her eyebrows furrowed, \"Bruce, what's-\"</p>\n<p>\"How old am I?\" He asks. His voice sounds thin and scared to himself. He needs to sit down somewhere. He starts pacing again. He thinks he's going to be sick. Where's Jason? He keeps worrying about Jason. Has he already grown up and gone away? Like Dick did?</p>\n<p>\"Thirty-nine, Bruce,\" Tim says, exchanging anxious glances with Dick, \"you're thirty-nine years old.\"</p>\n<p>Bruce stops pacing. \"That can't be right,\" he says faintly. \"I turned thirty-four two weeks back. There was a big party. The mayor was there.\"</p>\n<p>Dick tilts his head. Very slowly, he says, \"I remember that night. We flew in lobsters from New York. I was eighteen. You let me drink some champagne. Jason was eating all the fried prawn Hors d'oeuvres.\" Bruce suddenly feels full of dread, like he's going up a rollercoaster. Up up <em>up</em>.</p>\n<p>Dick's eyes hold his. \"Bruce, that party was five years ago.\"</p>\n<p>\"Huh.\" Bruce says. He meant to say something more profound, but 'huh' is all that comes out.</p>\n<p>Then he's sick all over his shoes.</p>\n<p>Alfred makes his way down the hall, towards the kitchens, where everyone has gathered around the kitchen island. Dick is eating a bowl of dry cereal, an anxious expression on his face. Tim and Stephanie are sitting next to each other, peering over something on Tim's iPad. Cass is sitting on the floor next to Dick's feet, and every once in a while, she reaches up and steals a marshmallow from his bowl. Damian is sitting across the table, his entire body stiff. He's staring at his hands. Poor boy. He's probably taking it the worst.</p>\n<p>\"He's asleep.\" Alfred says, and everyone lets loose a collective sigh of relief.</p>\n<p>\"We have to plan this,\" Tim is already saying, putting the iPad away. \"We have to be smart. He didn't see Jason's Robin costume in the case, did he?\"</p>\n<p>Stephanie's eyes widen. \"<em>Shit</em>. I didn't even think of that. I don't think he did. He was too far away, right?\"</p>\n<p>\"What about Babs? She's in a wheelchair now.\" Dick says, tapping his fingers against the rim of the bowl. \"No way we can tell Bruce what happened.\"</p>\n<p>\"Is it temporary? Maybe we should get a few brain scans done and-\"</p>\n<p>\"How do we explain that Cass is batgirl? He saw her in the outfit.\"</p>\n<p>\"He might not have put it together, Barbara's costume looked totally different.\"</p>\n<p>\"Someone's gonna have to call Jason!\"</p>\n<p>\"He won't pick up my calls! I've been-\"</p>\n<p>\"We can't just-\"</p>\n<p>\"What do we tell the Justice League? Maybe we should call Clar-\"</p>\n<p>\"I don't think that's the best-\"</p>\n<p>\"Call the <em>alien</em>? Are you trying to get us all killed?\"</p>\n<p>\"Dami!\"</p>\n<p>\"We should-\"</p>\n<p>\"Enough,\" Alfred says, and everyone falls obligingly silent. Except Cass, who hadn't said anything in the first place. She sneaks another marshmallow from Dick's bowl, and smiles at Alfred.</p>\n<p>Alfred smiles back. What a dear girl.</p>\n<p>\"We will let Master Bruce rest,\" he says, \"and you will all eat dinner. Master Damian, you will go wash that paint off your face. And then we will all reconvene to discuss our present options. Go wash up for dinner, all of you.\" He says, making sure to give all of them a pointed look.</p>\n<p>All of them shuffle off to their respective rooms with various degrees of reluctance. From the corner of his eye, he can see Stephanie poke Damian good naturedly, trying to make him smile as they go up the stairs.<br>\nAll except Dick, who's still staring sadly at his bowl of cereal. When only he and Alfred are left in the room, he drops his spoon back into the bowl dolefully. \"Did you see the look he gave me? Like he thought I hated him.\"</p>\n<p>Alfred sits down next to Dick. It's been a rather. . . trying experience for him as well. When he was helping Master Bruce into his bed, adjusting the saline drip slightly so it wouldn't quite prick the inside of Master Bruce's arm, Bruce had seized his hand, his eyes bright and fierce. \"Al,\" he had whispered, a small smile on his face, \"you haven't changed at <em>all</em>.\"</p>\n<p>That smile he hadn't seen in years. It was the smile that a young Bruce would give Master Thomas, running down the stairs to open his Christmas presents. \"I don't believe in Santa Claus,\" he'd proclaim loudly, showing everyone that toothy smile, \"my deductions point out that it was Dad.\" He'd grin at his father, who would smile sheepishly back. \"Maybe next time you could save some of the midnight cookies for me.\" Bruce would say, and then he'd open all his presents like a madman, tearing through paper and cardboard with astonishing speeds.</p>\n<p>Somewhere along the line, in these last few years, that smile had disappeared. Eroded slowly by the cruel winds of fate and time.</p>\n<p>Alfred shakes his head. He's being a sentimental old man. \"I saw no such look,\" he informs Dick, although of course he did. Everyone did.</p>\n<p>Dick sighs, putting his head on Alfred's shoulder. \"I don't know why we fought so much back then. Remember how we'd just completely stopped talking to each other when Jason wasn't around?\"</p>\n<p>\"Indeed I do,\" Alfred says. The deafening, rage-filled silences, followed by the sudden, loud outbursts are not something he can forget. \"It would get quite,\" he pauses, \"<em>tense</em>.\"</p>\n<p>Dick snorts. \"That's one way of putting it.\"</p>\n<p>Alfred smiles, and they sit in silence for a while. It's well into the night, sometime around one or one thirty. Dinner, when it can be managed, is always late on days that the entire family goes out to patrol. They usually manage with protein bars. Alfred disapproves, of course, but when has anyone listened to him about basic meal time rules?</p>\n<p>\"How's he holding up?\" Dick asks, his voice quiet even in the relative stillness of the empty kitchen.</p>\n<p>Alfred thinks back to Bruce's bright smile, and his tight grasp on his hand. <em>You haven't changed at all.</em></p>\n<p>Oh, but he <em>had</em> changed. He had changed irreparably. They all had.</p>\n<p>\"Surprisingly well,\" he says, \"he appears to have accepted a lot of the information supplied to him in a very short time.\"</p>\n<p>\"That's Bruce, I guess.\" Dick says, shrugging with one shoulder, \"adaptible.\"</p>\n<p>There is a moment before any of them speak again.</p>\n<p>\"We can't tell him about what happened to Jason, can we?\" Dick whispers. \"That's one thing he won't be able to adapt to.\"</p>\n<p>Alfred remembers the Bruce that came back to the batcave holding Jason's broken body, pressing his forehead to the gash near the Robin symbol on Jason's chest. His shoulders shaking under his cape. Blood everywhere, dark and sticky and half dry. There was red on his forehead when he looked up again, looked up helplessly at Alfred.</p>\n<p>He also remembers the Bruce that had found out that his father was the one who would hide the Christmas presents under the tree by dusting them for fingerprints with Martha Wayne's face powder. Those are two very different people.</p>\n<p>\"No,\" Alfred says. \"I'm afraid he will not.\"</p>\n<p align=\"center\"><br>\n*</p>\n<p>Bruce is looking at the moon through his window.</p>\n<p>Well. Not really. He's only forcing himself to look outside, at the full moon, so that he won't rip the I.V. out of his arms and get out of bed and rifle through the drawers of the bedroom like a crazy person. Or run out of this strange but familiar house, also like a crazy person.</p>\n<p>He's feeling a bit like a crazy person anyway.</p>\n<p>He breathes in. Don't go through the drawers. There won't be any useful information in there. He breathes out. Why <em>shouldn't</em> he go through the drawers? It's his room. He has every right.</p>\n<p>Except it's not really his room. It's <em>other</em> Bruce's room. Bruce from the future. Five years later Bruce. Bruce who keeps a cow in his batcave. Bruce who an angry looking boy calls <em>father</em>.</p>\n<p>Not even dad. <em>Father</em>.</p>\n<p>For some reason, that sounds a lot more serious.</p>\n<p>He shakes his head. One thing at a time. He'll deal with the word <em>Father</em> and its possible implications later.</p>\n<p>He sits up slowly, looking around the room again. The lights have all been dimmed. It tells him almost nothing. He's never really been the type to hang up personal photos, so no surprise there. White walls and minimal furniture. Same as ever. The A/C looks like it's been upgraded. Two new paintings on the walls, though. One of them is relatively large, a beautiful watercolour of Wayne Manor's lawns, with the fountain and Alfred's immaculate hedges. The smaller one probably doesn't count as a painting. It's a pencil sketch of Dick, and some other boy he doesn't recognise. They're laughing at something and looking to a side. It's probably been copied off a photograph. Both signed DW, with the date at the right hand corner.</p>\n<p>Damian. . . <em>Wayne</em>? He closes his eyes and scrubs at his face. God. He feels like whipping out a DNA test and sticking Q tips into that boy's mouth for saliva swabs. Although, he's probably done that already.</p>\n<p>In the other corner of the room is a table with some paperwork and letters. Again, standard. A laptop. Looks different from the one he had. Slimmer. He wonders if he can get it started up and go through the Wikipedia page about himself. Maybe some gossip pages. Catch up on five years of news. Probably not. He won't remember any of his passwords.</p>\n<p>He makes failsafes all the time, for in case he's unable to function in any way. He winces. This was a situation that never occurred to him. When (not <em>I</em><em>f</em>. He's pointedly not thinking about the <em>if</em>) he gets his memory back, he's going to make a pen drive full of information that he'll keep on his person at all times.<br>\nDo people even use pen drives anymore?</p>\n<p>The door opens with a soft click, and he looks up to see who it is, squinting through the dark at the sliver of light from outside.</p>\n<p>It's the angry looking boy. Damian. Except he's looking more nervous than angry right now.</p>\n<p>\"Hello,\" Bruce says.</p>\n<p>Damian stands at the threshold of the room, one hand on the doorknob, opening his mouth to speak, and then thinking better of it. He looks like a deer caught in the headlights. \"I thought you would be asleep,\" he says finally, and then flushes.</p>\n<p>Bruce laughs, rubbing the hem of the blanket between his fingers nervously. \"What, where you just going to stand there and watch me sleep, then?\"</p>\n<p>Silence from the doorway tells Bruce that the angr- that Damian, had been planning to do exactly that.</p>\n<p>\"Oh.\" Bruce says, and then not much else. What does other Bruce do, when his son comes to his room in the middle of the night like this? Put an arm around him and comfort him? Or send him back to bed? He can't think of anything to say. He just sits there on the bed, staring at Damian, and Damian stands there, staring right back.</p>\n<p>\"I should go,\" Damian says finally, his hands placed in front of him awkwardly. \"You need rest.\" He turns to shut the door.</p>\n<p>\"Wait,\" Bruce says, and Damian turns back around. Bruce pats part of the mattress beside him. \"Come sit.\"</p>\n<p>Damian looks equal parts wary and intrigued. \"I do not think-\"</p>\n<p>\"It's okay,\" Bruce smiles at him, trying to put him at ease. \"I won't bite.\"</p>\n<p>Damian almost takes a step back in surprise. Bruce smiles again, a little uncertainly this time. \"What's the matter? Don't people say 'I won't bite' anymore?\"</p>\n<p>Damian shakes his head, approaching the bed slowly, like Bruce might be a sleeping dragon. \"No. They still do.\"</p>\n<p>He sits on the edge of the bed, his body tensed up like he's prepared to have the mattress pulled out from under him at any time. He looks away, to a side.</p>\n<p>\"Why is that on your arm?\" Damian says suddenly, his voice sounding loud after the small silence. He's pointing to the intravenous drip.</p>\n<p>\"Oh, this?\" Bruce says, looking at the tubing running down his arm and then up to the saline bag. \"I was dehydrated. That's what Alfred said. I don't think I've eaten or had anything to drink for the last day. I can't really remember. Everything is. . .hazy.\" he says. A lot of bright dots fill his vision when he tries to think too hard about what happened. That, and his headache worsens.</p>\n<p>\"Oh,\" Damian says. He fidgets with his hands a little.</p>\n<p>\"Aren't you supposed to be at dinner?\" Bruce asks. Alfred had mentioned something about it.</p>\n<p>\"I asked to be excused,\" Damian says primly. Then he is silent again, and bites his lip.</p>\n<p>Bruce waits for that inevitable question.</p>\n<p>\"You really don't remember me?\" Damian asks, his voice small sounding.</p>\n<p>Bruce sighs. He looks at Damian. His face is closed off and remote, but in the moonlight, his eyes are bright and uncertain looking.</p>\n<p>\"I remember the day you were made,\" Bruce says.</p>\n<p>Damian makes a face.</p>\n<p>\"No, really,\" Bruce laughs, \"it was actually kind of sweet. Your mother and I were fighting-\"</p>\n<p>Damian snorts. \"As usual.\"</p>\n<p>\"Anyway, we were fighting, and this was back when I was still training under your grandfather. We were very young and stupid. She was trying to teach me some kind of ancient martial arts nerve tap, and I kept trying to kiss her so she-\"</p>\n<p>\"<em>Fa-ther</em>!\" Damian cries out, making a distasteful face. He puts his hands over his ears and squeezes his eyes shut. \"That's disgusting.\"</p>\n<p>Bruce laughs, even though every time the kid calls him father he has a mini heart attack. \"She thought it was romantic. That I was being cute.\"</p>\n<p>Damian shakes his head, his hands still clamped over his head. \"I don't want to know. I <em>don't</em>.\"</p>\n<p>\"So the next day, she came up to me, and she was really nervous. Or, as nervous as someone like Talia could get. She said something about being not a hundred percent sure about if the-\" he cuts himself off from one look from Damian. The kid looks like he might puke. Bruce grins. \"anyway, I said that if it came to it, and she really was pregnant, than maybe it wouldn't be so bad.\" He says, his smile softer.</p>\n<p>He's noticed that Damian has sidled closer to him now, sitting cross-legged near Bruce's pillow, their shoulders touching. \"You didn't tell me this story before,\" Damian says, his voice accusatory.</p>\n<p>Bruce feels mildly surprised. \"I didn't? Well, know you now.\" He shrugs slightly. \"A week later we had a bigger fight, one that you couldn't really bounce back from, and my training was over anyway, so I didn't really have any reason to stick around. So I left. And she never told me anything about a baby, so I thought it was just a false alarm.\"</p>\n<p>Bruce holds up one of Damian's hands up against his own. It's tiny. But one day maybe it'll look just like his. He can feel Damian's eyes on him. \"I wish I found you earlier. I should have looked for you,\" Bruce whispers.</p>\n<p>\"Really?\" Damian asks, doubt in his voice. He looks at their hands touching each other, and hesitantly he presses their fingertips together. He has to stretch his fingers slightly to do it.</p>\n<p>\"Of course,\" Bruce says, frowning a little. Hasn't he said all of this before? He <em>must</em> have.</p>\n<p>Damian shakes off Bruce's hand and sits up straight again, regarding Bruce with a suspicious expression. \"How do I know that you aren't an alien? Or- I don't know. Some kind of shape shifting imposter?\"</p>\n<p>Bruce nearly laughs again. The kid looks so serious. \"Why would you think that?\"</p>\n<p>Damian shrugs, looking down at the hand that was clasped in Bruce's. \"You aren't acting very much like Father.\" He mumbles.</p>\n<p>Bruce looks at him thoughtfully. \"How do I prove it to you, then?\"</p>\n<p>Damian screws up his face, like he's thinking hard. \"Tell me one embarrassing thing that happened to Grayson when he was a boy.\" He says, his eyes flicking to Bruce's uncertainly to see if he buys it, \"Just so I can know you're the real Father, of course.\"</p>\n<p>Bruce hides his smile. The kid's still too young to be a very good liar. \"Alright,\" he says, and Damian looks like he can barely contain his excitement. \"But only so that I can provide proof that I'm not an evil shape shifting alien.\"</p>\n<p align=\"center\"><br>\n*</p>\n<p>Alfred puts down a large tray of cookies, and everyone <em>oohs</em> and <em>aahs</em> appreciatively.</p>\n<p>\"So here's what I think happened.\" Tim says, gesturing towards the iPad. They're sitting around the big formal dining table, eating ham and cheese sandwiches. All except Damian, who asked to be excused early.</p>\n<p>Alfred stands near the table, dusting the glass screen of the china cabinet. Except he's not really dusting anything. No one dusts china cabinets at one in the night, for heaven's sake. He's listening in, and everyone knows it.</p>\n<p>\"Here.\" Tim says, and shows them the screen with the data from Bruce's suit tracker. \"23:00 hours, he heads down towards the old shipyard, where the Pastorellis were keeping their product. They were moving it through the dock nearby, is what we thought. Damian and Cass were supposed to meet up with him at the docks, once he had apprehended this guy called Dr. Elijah Brown.\"</p>\n<p>Stephanie scrunches up her nose in disgust. \"No relation.\"</p>\n<p>\"He was supposed to be the brains behind the drug. We think he developed the formula and laboratory preparation for it. The funding and distribution was still being handled by the Pastorellis, of course, but it was only possible because of this guy.\"</p>\n<p>He flicks to the next data set. \"Here's the data from the tracker after 23.15 hours.\" He says, taking a bite of the sandwich.</p>\n<p>Dick leans forward to have a closer look. \"It's blank.\"</p>\n<p>Tim shrugs. \"I think someone tampered with it. Damian and Cass waited at the docks for him for three hours before they went to the shipyard warehouse to search for him themselves. Came up with nothing. The whole place was deserted. They had packed up shop and gone somewhere else.\"</p>\n<p>\"So it was an ambush?\" Stephanie asks. Her plate is empty. Alfred moves in to put another sandwich on it, and she grins at him.</p>\n<p>\"I don't know. But they did know we'd be trying to find their base of operations, and they were pretty pissed-\"</p>\n<p>\"Language,\" Alfred admonishes mildly.</p>\n<p>\"Sorry. They were pretty mad about what happened to their buddies two days ago, back at that restaurant.\"</p>\n<p>Dick winces. \"You mean the pile of dirt that used to be a restaurant?\" They're all thinking about the mix up that Jason was involved in.</p>\n<p>\"Man,\" Stephanie says, sighing, \"what was he thinking? Shooting up people in a place that had a hundred litres of nitroglycerin in it.\"</p>\n<p>\"He didn't <em>know</em> about the nitro,\" Dick says indignantly, defending Jason. \"None of us did. And he didn't deserve to get chewed out like that. Bruce was way too harsh on him.\"</p>\n<p>Tim rolls his eyes. \"My leg nearly blew off. I think he deserved it at least a little.\"</p>\n<p>Dick shakes his head. \"You don't understand. What Bruce says means a lot to Jason. He won't admit it, but it does.\"</p>\n<p>Alfred begins to collect their plates. \"If I may, I do think you should call him up and tell him about the recent developments, Master Dick. He may listen to you.\" Alfred says, remembering how Dick had defended him.</p>\n<p>\"Ugh,\" Stephanie says, putting her hands on her head a touch overdramatically, \"do we <em>have</em> to tell him about this? What if he turns up and tells Bruce <em>everything</em>? I swear to God, it'll be like an episode of Full House, Alf.\"</p>\n<p>\"Tell me everything about what?\" Bruce says from the entrance, and everyone jumps. Except maybe Cassandra. Cassandra waves at him. And smiles. She probably knew that he'd come in all along.</p>\n<p>Bruce smiles back, but it doesn't quite mask how tired he looks. He seems old and worn. He's carrying a sleeping Damian in his arms. \"He fell asleep in my bedroom. If any of you could point me in the direction of his room, I'll just tuck him in.\"</p>\n<p>Alfred knows that Tim and Stephanie and Cassandra are probably exchanging incredulous looks right now. <em>'Tuck him in'</em> is not something Bruce would say today. But Alfred remembers a time, a time with a little boy in pajamas running down the stairs with socked feet and an adorable smile, saying 'I won't go to bed just yet!' and his tired, but smiling father running after him and scooping him up, and the child bursting into giggles and trying to wiggle out of his grip, and his father letting out an exhausted 'Dick, <em>please</em>,' but he'd let him run away again anyway. He remembers a Bruce who would tuck in his son every night.</p>\n<p>\"I'll show you the way,\" Alfred says, putting the trays away.</p>\n<p>He walks down the halls until he reaches the staircase, and he starts to climb the steps. He can hear Bruce's quiet footsteps behind him, and Damian's soft snores. They walk up the stairs to the third floor, and go to the second door on the left.</p>\n<p>Alfred opens the door. Titus is lying on his back in Damian's bed, his tongue lolling and legs akimbo as he sleeps. He covers most of Damian's large queen sized bed. Bruce stops, looking at the massive black dog with a bemused expression. \"So in the future,\" he says, his voice still quiet enough that he doesn't wake Damian up, \"I have about fifteen kids, a dog the size of a tank, and a cow?\"</p>\n<p>Alfred pushes Titus to a side to make room for Damian. Titus sighs happily in his sleep. \"And a cat. His name is Alfred.\"</p>\n<p>When he hears no reaction from Bruce, Alfred looks up. Bruce's shoulder are shaking. He is alarmed for a moment before he realises that master Bruce is laughing. <em>Laughing</em>.</p>\n<p>Bruce looks up at Alfred, the corner of his mouth still quivering a little. He's smiling. \"Maybe other Bruce's life isn't so bad, huh?\"</p>\n<p>\"No,\" Alfred says, feeling something soft and tender and quiet for his dear boy. \"It's a good life.\"</p>\n<p>Bruce sits down on Damian's bed, his sleeping son still sprawled across his lap. He tips his head against the bedpost. \"God, I'm tired.\" he says, closing his eyes. Damian shifts a little in his sleep, pressing closer to Bruce's chest. He wouldn't be caught dead doing something like this when he was awake.</p>\n<p>\"I know.\" Alfred says, \"Go back to your room and put that I.V. drip back in right this second.\"</p>\n<p>\"Yes, sir.\" Bruce says, the corner of his mouth quirking up again, even though his eyes are closed. Still, he stays firmly seated on the bed. \"How old is he?\" He asks quietly. Alfred can't tell if he really is sleepy or just pretending so he can get away with asking questions like this.</p>\n<p>\"Twelve and a few months,\" Alfred says. \"We think his birthday is somewhere around late April.\"</p>\n<p>Bruce runs a hand through Damian's hair. \"He looks like her. Not really like me.\"</p>\n<p>\"Sometimes, when he frowns in a particular way, or sweeps his cape behind him, he looks exactly like you,\" Alfred says. \"And he's inherited your habit of taking in strays.\" He pats Titus's rump, and the dog stirs, and looks up at Bruce. He grunts happily, licking Bruce's cheek.</p>\n<p>Bruce sighs, shaking his head. \"I always wanted a dog,\" he says, rubbing Titus's jowls idly. Titus explodes in a shiver of tail-wags, nearly stepping on Damian to get to Bruce. \"But Mom was allergic. Remember?\"</p>\n<p>\"I remember,\" Alfred says.</p>\n<p>Titus settles back down next to where Damian is sleeping on Bruce's lap, nuzzling his cheek. Damian pets him sleepily.</p>\n<p>\"Where's Jason?\" Bruce asks lightly, not quite meeting Alfred's eyes as he watches Titus lick Damian's palm.</p>\n<p>Alfred looks to a side. Damian's room has several paintings of his pets and his family, which he studies for awhile. \"He lives on his own now,\" Alfred says, trying to word what he says carefully.</p>\n<p>Bruce nods jerkily. \"Of course he would. He's grown up.\" He slowly gets off the bed, extricating Damian from his lap. \"Is he in college? He wanted to do an English major,\" he says, almost desperately. \"Did Jason do his English major, Alfred?\"</p>\n<p>So he knows something is not right. Alfred is not surprised. Master Bruce always knows when people are lying to him. However, in this case, he may not want to know the truth. \"No,\" Alfred says slowly, \"he never went to college.\" How to explain to Master Bruce that he was never even able to finish high school?</p>\n<p>\"Oh.\" Bruce says. \"That's,\" he pauses. \"But he wanted to do an English major,\" he repeats, slightly uselessly.</p>\n<p>\"I know,\" Alfred says gently. \"Dick will call him in the morning and he will make sure that Jason comes home to see you. Okay? Why don't you go back to bed now.\"</p>\n<p>Bruce nods again. They walk back down the hall, closing the door of Damian's room with a muted click.</p>\n<p>The sound of their feet against oak panelled floor fills up the moment of silence as they walk back down the stairs and towards Bruce's room on the second floor. Bruce seems quiet. Thoughtful.</p>\n<p>They reach the door of Bruce's bedroom. Alfred opens it, ushering Bruce in. Bruce lies back down, letting Alfred slip the IV catheter back into his arm. There's an abstracted expression on his face.</p>\n<p>\"What is it?\" Alfred finally asks.</p>\n<p>Bruce shakes his head. \"I know there's a lot that none of you are telling me.\" He says.</p>\n<p>Alfred goes still, his hands still holding the IV.</p>\n<p>Bruce shakes his head, \"It's not even that I'm angry,\" he says. \"But it's five years. Five <em>years</em>. I don't know <em>any</em> of these people. Not even Dick. He's so different now. Where do we start, Al?\" He laughs humourlessly. \"Where do we fucking start.\"</p>\n<p>\"It'll come back.\" Is all Alfred can say.</p>\n<p>Bruce smiles ruefully, not looking at Alfred. \"I don't know. Will it?\"</p>\n<p>There is something about Bruce that reminds him of a child now. Something innocent. Unbroken. It leads Alfred to make a split second decision. He sits down, and takes Bruce's hand in his.</p>\n<p>Bruce raises an eyebrow. They have never been the type to hug or show physical affection.</p>\n<p>\"We'll save the bigger things for tomorrow,\" Alfred says. \"But I can tell you some things now.\"</p>\n<p>Bruce sits, waiting.</p>\n<p>Alfred begins. \"For starters, you don't call me Al anymore.\"</p>\n<p>They sit and talk through dawn, and Alfred tells him things, small things, like how Damian sometimes sleeps in the cave when Bruce is off-world, and how Tim once threw up in the pool when he had the flu, and how Bruce finally got around to restoring the east wing of the manor, and how Dick and Barbara have got together and broken up a dozen times, and how Bruce took an ASL course with Cassandra but dropped out after the instructor tried to flirt with her, and then they just taught themselves from the internet, and how Stephanie makes better banana muffins than Alfred, and Dick has been know to try and shove three of them in his mouth at once. How his children love him unconditionally.</p>\n<p>By the time Alfred is finished, Bruce is half asleep. \"It's dumb that I don't call you Al anymore.\" He mumbles. He's still holding Alfred's hand. Perhaps it's just because he simply has forgotten to let go.</p>\n<p>Alfred smiles. \"Quite.\" He says.</p>\n<p> </p>\n<p>\"And then Kim and Kanye got married-\"</p>\n<p>\"So we think this Dr. Elijah Brown may be behind this entire thing, and you were-\"</p>\n<p>\"And they had two babies, North and Saint. I know. North. <em>North</em>!\"</p>\n<p>\"-tracking down their base of operations when your tracker died. Let me just show you the data set of y-\"</p>\n<p>\"And Gwyneth Paltrow and Chris Martin split up, then there was that huge Ebola outbreak, and then the pope resigned, and Kendrick Lamar released the most woke album I've heard<em> in my entire life</em>-\"</p>\n<p>\"It clearly shows that you went missing sometime around 23:05. The tracker alert started to ping, so-\"</p>\n<p>\"Then Brad and Angelina got divorced, and Angelina got custody of their six billion kids. Oh, and a new Star Wars movie came out. It was definitely better than the prequels, although Tim disagrees, and Jason thinks we're nerds.\"</p>\n<p>\"-shows inconclusive results. So Dick and I are going to start the search for all the missing product. For all we know, it could have already been distributed by now. Dick will need field support though, since I'm confined to-\"</p>\n<p>\"I told Jason he could go suck it, cause I'm pretty sure I saw him tear up a little when Harrison Ford died. Slimy little hypocri-\"</p>\n<p>\"Steph, this is important!\"</p>\n<p>Bruce frowns. He's sitting up, a breakfast tray on his lap and two teenagers on either side of his bed. Stephanie, (the girl with the blonde hair, he's come to find out) is trying to fill him in on all the significant events of the last five years, while Tim is trying in vain to talk about the case. Bruce idly picks at his omelette. He feels mildly annoyed.</p>\n<p>\"They really killed off Han Solo?\" He says.</p>\n<p>Stephanie's eyes widen. \"I tell you that there was an Ebola outbreak, and you're mad that they killed a fictional character in a movie franchise?\"</p>\n<p>\"I don't know what Ebola is,\" He tells her, \"and Han Solo was the coolest hero ever.\" He eats some of the omelette.</p>\n<p>Both Tim and Stephanie are looking at him with identical expressions of disbelief.</p>\n<p>\"What?\" He asks, his mouth half full of egg.</p>\n<p>\"Bruce, I've never heard you say '<em>cool</em>' in your entire life.\" Stephanie says, placing her hands on her hips incredulously.</p>\n<p>Bruce eats some more of his omelette. It's good. Thoughtfully, he looks at Tim. \"You <em>really</em> liked the prequels?\" He asks.</p>\n<p>Tim rolls his eyes, raising his palms heavenwards. \"Now is <em>not the time</em>!\"</p>\n<p>\"Okay, okay,\" Bruce says, putting his fork back down. \"Tell me about this plan of yours.\" Tim likes planning things, he's discovered. It helps him feel more in control. Not entirely unlike himself.</p>\n<p>Stephanie sits at the foot of the bed, and leans over to grab a piece of toast off of Bruce's plate, winking at him. \"Don't take it to heart. He's always grumpy in the mornings.\"</p>\n<p>\"I haven't slept all night,\" Tim says, glaring at Stephanie, \"because I've been trying to figure out this clusterfuck of a situation.\"</p>\n<p>\"Language,\" Bruce says, from around his toast.</p>\n<p>\"Sorry,\" Tim says, and then stops short. \"What did you just say?\"</p>\n<p>\"Language,\" Bruce repeats helpfully, before drinking some orange juice.</p>\n<p>Tim blinks. \"Okay, then.\" He pauses. \"You're <em>sure</em> you're not from an alternate dimension or something?\"</p>\n<p>Bruce shrugs, his mouth too full of orange juice to say anything.</p>\n<p>Tim shakes his head gravely. \"I miss in-control, older batman who yelled at me more. At least I knew where I stood with him.\"</p>\n<p>Bruce privately echoes his sentiment.</p>\n<p>\"Okay,\" Tim says, shaking his head like he's clearing his mind. He sits next to Stephanie. \"Here's what's going to happen. We can't let the media know, cause they'll have a field day. And we definitely won't be able to explain how it happened. I can contact Leslie privately and we can arrange an MRI or something for you. Um, I can call Janice and tell her to postpone your meetings indefinitely, so you don't have to go to work. God knows Bruce Wayne does it all the time anyway.\"</p>\n<p>\"Janice,\" Bruce smiles. His private assistant brings back fond memories. \"How is she?\"</p>\n<p>\"She's got grandkids now.\" Tim says, \"Twins. Two year olds.\" He shakes his head, a strange look on his face. \"Talking to you is like talking to a time traveller.\"</p>\n<p>Bruce eats more toast. Grandkids. <em>Huh</em>.</p>\n<p>\"Anyway, we'll have to keep up appearances. I don't want people to think that there's something wrong. Dick can probably put on his old Batman suit again, and Cass can start patrol with him. You'll still have to attend functions as Bruce Wayne, though-\"</p>\n<p>Bruce stops eating. \"Dick's old Batman suit?\" He repeats.</p>\n<p>\"Oh.\" Tim says, \"Yeah. Dick was Batman for a while when we thought you were dead but you were only lost in the time stream.\"</p>\n<p>Bruce eats more toast while he processes this. </p>\n<p>\"I could still be Batman,\" he says, \"I don't see why it's a problem. It's not like I've forgotten how to fight.\"</p>\n<p>Tim shakes his head. \"You won't know Gotham anymore. There's more roads and freeways and buildings now. Plus, all the gangs and cartels are different now, with different allies and enemies. You have a couple more rogues, and you have no idea how to deal with them. You'd have to learn everything again before you could go out there.\"</p>\n<p>\"We have comm lines,\" Bruce points out, \"If I need help I can just call someone from this vast network of allies I've seemed to accumulate over the years.\"</p>\n<p>\"We get it,\" Stephanie says, rolling her eyes, \"you think you have way too many kids. I agree, buddy.\"</p>\n<p>Bruce points his fork at her. \"Aren't you supposed to be at your apartment?\" They don't <em>all</em> live <em>here</em>, do they?</p>\n<p>Stephanie snorts.\"It's cute that you think that I actually use my apartment, when the Manor has the best water pressure in Gotham.\"</p>\n<p>Bruce is not sure what to say to that. \"How do we know each other, exactly?\"</p>\n<p>Stephanie props her chin on her palms. \"I'm your son's ex girlfriend,\" she says, pointing to Tim. \"And I was Robin for like two days.\"</p>\n<p>Bruce wipes his mouth with a napkin. \"You must have been a really good girlfriend,\" he says, \"because I don't usually give free board to them. The manor would've been too full of Dick's exes by now.\"</p>\n<p>Stephanie laughs. \"Your dad was <em>cool</em>,\" she says to Tim, almost accusingly. She starts to head to the door. \"Anyway, I gotta go. I have to give a makeup class in fifteen minutes, and it's across the river, so I'm definitely gonna be late.\" She kisses Tim on the cheek, and slings her backpack around her shoulder, opening the door.</p>\n<p>\"Why were you Robin for only two days?\" Bruce asks.</p>\n<p>Stephanie stops at the door. \"It wasn't actually two days. It was probably a couple of months.\" She says. Then she looks at Bruce with an strange look on her face. \"It's a long story,\" she says. She leaves.</p>\n<p>Tim turns to Bruce. \"You fired her because she didn't follow a few orders, and then she tried to fix things and almost got killed because of it.\" He says.</p>\n<p>\"Oh,\" Bruce says.</p>\n<p>\"Yeah. <em>Oh</em>.\" Tim says. He gets up, propping himself up on his crutches again, \"Man, these things keep digging into my armpits. I wish I had one of those mechanised wheelchairs, like Babs.\"</p>\n<p>Then his eyes widen.</p>\n<p>\"Fuck,\" he says.</p>\n<p>\"Tim,\" Bruce says slowly, \"why would Barbara have a mechanised wheelchair?\"</p>\n<p>\"Uh,\" Tim says, his eyes flicking around the room wildly, as if to search for means of escape, \"because. Um. Why don't you ask Alfred, I actually have a thing to attend so. Yeah.\"</p>\n<p>\"Tim,\" Bruce says again, his voice dangerously calm. \"Sit down. You're not going anywhere.\"</p>\n<p>Defeated, Tim sits. He sighs, \"Everyone's going to give me so much shit for this.\"</p>\n<p>\"Why would Barbara have a mechanised wheelchair?\" Bruce asks again.</p>\n<p>Tim looks at the floor, looking miserable. Bruce could almost feel sorry for him if he wasn't so angry right now.</p>\n<p>Tim mumbles something incomprehensible.</p>\n<p>\"What?\" Bruce asks.</p>\n<p>\"Joker shot her,\" Tim says quietly. \"In the stomach. It hit her spine, and she was paralyzed from waist down. It was a long time back. She's okay now.\"</p>\n<p>Bruce is quiet. Tim looks away, looking like he could let the ground swallow him right now.</p>\n<p>\"It's my fault, isn't it?\" Bruce says, finally. He noticeably squares up his shoulders, like he's preparing to let someone punch him.</p>\n<p>\"It's no one's fault,\" Tim says wearily. \"Except the Joker's.\" They've talked about this countless times. He can remember fights, shouted out in the batcave, usually after Tim gets himself banged up, with Bruce yelling that Tim must be more careful, that he can't be responsible for letting more children get hurt. Tim glaring down at the floor.</p>\n<p>Bruce always apologises later, whispering how he's sorry that he let Tim get hurt like that, or how he's going to make sure it doesn't happen again. It does happen again, though. And that's okay. In their line of work, it would be weird if he <em>didn't</em> come away with scrapes and bruises. It always seems to affect Bruce much worse than it affects him, anyway. Bruce sits by his cot in the medbay, his quiet presence still formidable to Tim even in his drugged-out, half unconcious state. Sometimes when Tim is really badly hurt, or he's been hit with a dose of fear toxin, Bruce puts his fingers on Tim's cheek, or brushes back his hair from his forehead. But only when he thinks Tim's sleeping. Once he even kissed his forehead.</p>\n<p>Tim knows it's totally weird and he's being crazy, but sometimes he actually looks forward to getting hurt or maimed, so Bruce can act a little human with him.</p>\n<p>It's not that he isn't aware that his relationship with Bruce isn't the definition of healthy.</p>\n<p>\"Tim,\" Bruce is saying to him, and Tim snaps out of his reverie. \"Pay attention.\"</p>\n<p>\"What?\" Tim asks.</p>\n<p>\"I've been asking for the last five minutes if you could log me into the batcave computers. There's a lot I need to catch up on. Old case files and League developments, gear inventory. New allies,\" he says, pointing at Tim. \"Every development in the last five years.\"</p>\n<p>\"Oh,\" Tim says. \"I, uh. Can't today.\" He says, flushing. \"I can put you through to Oracle, though.</p>\n<p>\"Why can't you do it?\" Bruce says. He doesn't feel like facing Barbara. Not now. Not with her in a wheelchair. All he does is ruin people.</p>\n<p>\"I have a meeting. At school.\" Tim says, ducking his head. He looks nervous suddenly.</p>\n<p>Bruce blinks. \"What type of meeting?\"</p>\n<p>Tim fidgets a little with the end of one of his crutches. \"Alfred usually goes, or sometimes Dick, it's never you, but.\" He pauses. \"Never mind.\" He says.</p>\n<p>\"<em>Tim</em>. What type of meeting.\"</p>\n<p>Tim takes a deep breath, and exhales all at once. \"Parent-teacher conference,\" he mumbles. \"You don't have to come. You don't, usually. So it's really not necessary.\"</p>\n<p>\"Don't be ridiculous,\" Bruce is already saying, getting up. \"Let me put on a suit. I'll meet you out in the foyer in ten minutes.\"</p>\n<p>Despite himself, Tim smiles. But just a little. And looks to the side, so Bruce can't see.</p>\n<p align=\"center\">*</p>\n<p><em>THUD</em>.</p>\n<p>Jason groans, pulling his pillow over his head. His head feels like it might split into two. He touches the back of his head delicately, and immediately winces.</p>\n<p><em>THUD. THUD</em>.</p>\n<p>Jason scowls into his sheets, his eyes still closed. He cracks one open to check the time off of his phone. 7:06.</p>\n<p><em>THUD</em>. \"Jason, I <em>know</em> you're in there!\" Dick's stupid cheery voice. He's banging on Jason's door like there's no tomorrow. <em>THUD</em>.</p>\n<p>He tries to yell at Dick to fuck off, but all that comes out is a wretched half-croak, muffled by his pillow.</p>\n<p><em>THUD</em>.</p>\n<p>Jason gets up, swaying slightly. He looks around for his shirt unsuccessfully, and walks slowly towards the door. Every step that he takes sends an automatic throb to his head. He grimaces, grabbing an aspirin bottle from the side table on his way.</p>\n<p><em>THUD</em>. \"Jason, for the <em>las</em>-\"</p>\n<p>Jason opens the door and squints angrily Dick, who's standing in the way too sunny exterior of his apartment, his foot tapping nervously on the grimy floor of the hallway outside.</p>\n<p>\"Look, <em>fuckface</em>,\" Jason begins, \"today is <em>not</em> the day to-\"</p>\n<p>\"Jason, shut up for <em>once</em> in your life,\" Dick says, and for the first time Jason notices that he's actually looking pretty serious. Nervous, almost. \"Listen to me. We don't have much time.\" There's something on Dick's face that looks almost like desperation.</p>\n<p>Jason lets him in.</p>\n<p> </p>\n<p>Ten minutes later, they're sitting on Jason's shitty excuse for a couch, and Jason puts down his bottle of water and stops popping the Aspirin like candy.</p>\n<p>\"What do you mean he doesn't <em>remember</em> I died?\" he asks incredulously.</p>\n<p>Dick shrugs. \"We still don't know the exact amount of memory that's been wiped out, but he said that his thirty-fourth birthday was two weeks back.\"</p>\n<p>Jason blinks. Maybe it's just the hangover, but his headache is getting so much worse. \"But that was five-\"</p>\n<p>\"Five years ago. Right.\" Dick says. He pauses. \"When he first came to the cave, he was looking for you. He still thinks you're Robin.\"</p>\n<p>Jason stares. \"Why are you telling me this?\"</p>\n<p>\"He keeps asking for you, Jay.\" Dick says, putting a hand on Jason's shoulder. Jason shrugs it off. \"If we don't say anything, he's gonna start asking questions. Or worse, looking around himself. And you know Bruce. He's <em>going</em> to look.\"</p>\n<p>Jason is silent. He will not stand before Bruce and subject himself to all of it again. He will <em>not</em>. \"You came back wrong,\" Bruce will say, or, \"the Lazarus messed with your head. This isn't you, Jason.\" Or worse, \"No son of mine would do this.\"</p>\n<p>\"Your death's on public record, Jay.\" Dick continues. \"If he does some detective work, it's only a matter of time before he finds out for himself.\"</p>\n<p>But Bruce is wrong. Jason was already prepared to kill. Even before the Lazarus. Even before he died. Hurtling down the path he was destined to go down. <em>You didn't come back right.</em></p>\n<p>He came back exactly right. More right then he'd felt in years. It was Bruce who never understood. Maybe now he can make him understand. <em>Force</em> him to.</p>\n<p>Jason looks back up at Dick, his jaw tight. \"Let's go to the manor,\" he says, something hard and raw and powerful blazing in his chest. Anger, maybe. Hurt. He can't tell. \"I have a few things to tell him anyway.\"</p>\n<p align=\"center\">*</p>\n<p>Bruce walks down the street from Tim's high school. Tim is walking with him. Bruce is quiet. Tim is quiet. The car is parked a little ways down the road. They walk in silence down the sidewalk, Tim scuffing his shoes against the pavement lightly.</p>\n<p>Finally, Bruce looks at Tim.</p>\n<p>\"Your teachers really hate you,\" he says. His expression is carefully blank, like he's trying very hard not to laugh.</p>\n<p>Tim winces. \"Yeah.\" He says.</p>\n<p>Bruce shakes his head. \"I mean, they <em>really</em> hate you. I don't think anyone's looked at me with such intense loathing before. And I've stared down Bane.\" He says.</p>\n<p>\"That's unfair,\" Tim says. \"Bane is only half as bad as Mrs. Espinoza.\"</p>\n<p>Bruce looks bemused. \"Why do they hate you?\" He asks. \"Your grades are excellent.\"</p>\n<p>Tim shrugs. \"I don't really pay attention in class. I sleep a lot. Bunk class.\" He admits, a little guiltily.</p>\n<p>\"And you're the smart kid, so you're constantly undermining them.\" Bruce says, nodding like he gets it. \"Telling them how the things they're teaching are wrong.\"</p>\n<p>Tim narrows his eyes. \"How did you know?\"</p>\n<p>Bruce smiles, the corner of his mouth twitching up. \"Let's just say I knew a kid like you once,\" he says.</p>\n<p>\"Jason?\" Tim asks. A breeze picks up around them, making Bruce's shirt collar flutter in the wind.</p>\n<p>\"What? No. Jason <em>loved</em> school. He loved learning. His teachers adored him.\" Bruce says.</p>\n<p>\"Then who?\" Tim asks. Definitely not Dick. He can't imagine <em>anyone</em> disliking Dick.</p>\n<p>Bruce smiles again, a little sheepishly this time. \"Me.\"</p>\n<p>Tim raises his eyebrows incredulously. \"No way. Bruce Wayne was a slacker?\"</p>\n<p>\"Bruce Wayne was a capital <em>P</em> Problem child,\" Bruce tells him. \"I was the kid other kid's parents told them to stay away from.\" They spot the car, and Bruce gets his keys out from his pocket.</p>\n<p>Tim shakes his head. \"I don't believe you at all. I bet you were in the football team and you were the captain of the debate team, and you qualified for state level chess tournaments, plus you aced your SATs.\"</p>\n<p>They get in the car, Tim sitting in the front passenger seat next to Bruce.</p>\n<p>\"I <em>was</em> in the chess team briefly,\" Bruce indulges, \"but they kicked me out because I was smoking pot with Jenny Carlyle after school. Behind the bleachers. Alfred was called. It was quite the spectacle.\"</p>\n<p>Tim's eyes are wide. \"You're <em>shitting</em> me.\"</p>\n<p>\"Language,\" Bruce says.</p>\n<p>\"<em>Language</em>?\" Tim's voice sounds somewhat squeaky even to himself. \"You just told me you did <em>drugs</em> in <em>high school</em>!\"</p>\n<p>\"Yes,\" Bruce says. He sounds amused.</p>\n<p>\"<em>Batman</em> doesn't do <em>drugs</em>!\" Tim says, \"What else did you do, huh? Bully little freshmen? Throw pig's blood on the prom queen?\" And he thought <em>he</em> was the asshole.</p>\n<p>Bruce makes a sound somewhere between a laugh and a cough. \"<em>Hey</em>. I was a bad kid. I wasn't <em>cruel</em>. There's a difference.\"</p>\n<p>\"Oh.\" Tim says, sounding slightly relieved. \"Well. That's okay then.\"</p>\n<p>The car turns towards the main road, away from the school. Tim puts on his seatbelt, trying to think of the possible reasons that Bruce would act out when he was a kid.</p>\n<p>\"I'm sorry,\" he says, when he finally realises the answer.</p>\n<p>\"It's alright,\" Bruce says lightly. \"It was a long time ago.\" As an afterthought, he adds, \"Don't make life tough for your teachers. They're overworked and underpaid.\"</p>\n<p>There's a small silence, in which Bruce switches on the radio. Steph's rap music starts playing, the volume turned on low. Instead of switching the channel like he usually does, Bruce turns the volume up, tapping along to the beat with his fingers on the steering wheel. Tim looks at him incredulously.</p>\n<p>\"Besides,\" Bruce says after a short pause, \"If I threw pig's blood on the prom queen she would most <em>definitely</em> tell her 210 pound quarterback boyfriend that I'd been having sex with her on and off for the last six months.\"</p>\n<p>Tim has a sudden coughing fit, and Bruce has to pat his back rather vigorously to get him to stop.</p>\n<p>\"You want ice cream?\" Bruce asks, and Tim can only mutely nod, eyes streaming with tears from the choking on his own spit part, and wondering just how much stuff he doesn't know about Bruce.</p>\n<p> </p>\n<p> </p>\n<p>\"I'm proud of you,\" Bruce says, handing Tim his cone of mint chocolate chip ice cream. They're sitting in the car, parked outside an ice cream parlour. It's raining slightly, and Bruce's blazer is wet with the cold drizzle from the outside. He told Tim to wait in the car.</p>\n<p>Tim nearly drops the cone. \"<em>What</em>?\" He says.</p>\n<p>Bruce raises an eyebrow, studying his almost dropped cone and somewhat hunted-looking expression. \"I said, I'm proud of you. Your grades really <em>were</em> very good. We should celebrate.\"</p>\n<p>Tim flushes again. \"<em>Bruce</em>,\" he says. \"Don't be weird. This is the usual for me. I get grades like this all the time.\" He can't really decide how he feels about this other Bruce. He couldn't be more different from regular version.</p>\n<p>\"Well, then we should celebrate every time.\" Bruce says firmly.</p>\n<p>Tim just gives him an odd look.</p>\n<p>\"What?\" Bruce says.</p>\n<p>Tim shakes his head. \"Nothing. It's just that- you're so <em>different</em>. It takes a while to get used to.\"</p>\n<p>Bruce is quiet for some time. \"I'm a bad person now,\" he says, but it sounds more like a question.</p>\n<p>Tim frowns. \"<em>No</em>. No, you're not a bad person. You're a good dad, it's just that you're a better commanding officer, I guess.\"</p>\n<p>Bruce looks thoughtful. \"That sounds horrible.\" He says.</p>\n<p>Tim shrugs. \"It's not bad. You keep us all alive. <em>Somehow</em>. You've been doing this for a long time now. It's okay to have missed a few parent-teacher meetings here and there.\"</p>\n<p>Bruce smiles at that, and gently knocks his own ice cream cone against Tim's. \"Here's to never missing one again. Even though Mrs. Espinoza may quite possibly be the Devil incarnate.\"</p>\n<p> </p>\n<p>On the way back home, Tim turns to Bruce. \"You know that thing I said about you being lost in time?\"</p>\n<p>\"<em>Hnn</em>.\" Bruce looks absorbed in trying to drive carefully on the rain slicked roads.</p>\n<p>\"Well. Everyone thought you were dead. But not me. There was a body and everything, but I knew you were still alive.\" Tim says. He doesn't know why he says it, just that he does. Like something he had to get out.</p>\n<p>Bruce spares him a glance, and then looks back at the road. \"I can't say I'm surprised,\" he says. \"Thank you, Tim.\" He says in a softer tone. \"Thank you for saving my life.\"</p>\n<p>To his surprise, Tim thinks there might actually be a lump in his throat. He can't possibly be this starved for attention. It's ridiculous to the point of pathetic, he thinks.<br>\n<em>I saved your life twice, actually</em>, he wants to say. <em>The first time around, when we first met, I saved you from yourself,</em> he wants to say. But he stays silent.</p>\n<p>Instead, he smiles at Bruce. This version of Bruce, who likes Han Solo and Stephanie's rap music, who smiles so often that it kind of freaks Tim out, who used to smoked pot behind the bleachers of his high school, and who makes jokes about his English teacher, and not so subtly flirts with the school moms and buys Tim ice cream just because, and says things like '<em>I'm proud of you</em>' for no reason at all. This strange, wonderful, inscrutable version of Bruce. The Bruce that once was.</p>\n<p>\"You're welcome,\" he says instead, and Bruce smiles back and puts an arm on Tim's shoulder, and drives them back home.</p>\n<p> </p>\n<p> </p>\n<p dir=\"ltr\"> </p>\n<p>\"What are you watching?\" Bruce asks, a frown on his face, looking at the TV that Cass has situated herself next to. His coat is still wet from the afternoon rain, and he peels himself out of it, setting it down on a nearby side table where it will be deftly picked up, dried, and folded back by Alfred in the foreseeable future.</p>\n<p>\"The Real Housewives of New Jersey,\" Cass says, careful to enunciate every syllable carefully. She turns back to the television, watching as two women with orange looking spray tans grapple with each other clumsily, scratching and shouting and (on one occasion,) biting. There is also a significant amount of hysterical crying going on.</p>\n<p>Bruce only looks more confused.</p>\n<p>\"Come. Sit.\" Cass says, patting the sofa next to her.</p>\n<p>Bruce sits. \"Tim told me that you'll be covering patrol for me this next week?\" He asks her. He seems shy. No, not shy. Uncomfortable. His back is too straight for Bruce. Batman straight.<br>\nSteph says she can never tell the difference, but it seems obvious to Cass. When Bruce is being Batman and when he is being himself. When he is in between both.</p>\n<p>She nods. Patrol is always long anyway. A few more hours don't really matter. Besides, she likes patrol. Dancing on rooftops with Steph playing music from her phone. Buying milkshakes from their usual diners at 5 AM, just when the sun is about to come up and there's an air of absolute calm and temporary peace. Vanilla choco chip is her favourite.</p>\n<p>\"You like milkshakes?\" She asks.</p>\n<p>Bruce looks more confused now, but he goes along with it. \"You would know,\" he says, \"due to this. . . unexpected situation, most of you know me better than I know myself, currently.\"</p>\n<p>Cass shakes her head. \"Not Him. He hates milkshakes. But he likes iced coffee.\" She says. \"You. You like milkshakes?\"</p>\n<p>The corner of Bruce's mouth twitches up. \"We're not the same person?\" He asks, his voice lighter now. Less uncomfortable. Back is more relaxed. Good.</p>\n<p>Cass shakes her head again. She touches his face, the area in between his eyebrows. \"He frowns from here.\" She says, her finger tracing a notch on his forehead.</p>\n<p>\"And I don't,\" Bruce says, raising his eyebrows so that her finger moves up as well. She giggles. He smiles.</p>\n<p>\"No.\" She says, turning back to her show.</p>\n<p>They watch housewives complain about their husbands to each other for some time. Cass points at the screen helpfully. \"Melissa is sleeping with Shawna's husband,\" she says. On screen, there's another fight, and this time the women are yelling at each other at a barbecue.</p>\n<p>Bruce steeples his fingers together firmly, a gesture that she's seen him do hundreds of times before. Some things don't change. \"This show is absolute trash,\" he declares definitively.</p>\n<p>Cass smiles. \"That's what He says, too.\"</p>\n<p>He grins, running a hand through his hair in an effort to get it to dry a little. \"He seems like an all around great guy,\" he says. Cass rolls her eyes.<br>\nThey watch The Real Housewives make up with each other on screen, tearfully apologising and hugging.</p>\n<p>\"Jason is coming,\" Cass says, looking at him from the corner of her eye. \"Dick called.\"</p>\n<p>Bruce looks at her, a shade too quickly. \"Yeah?\" He asks, \"When?\"</p>\n<p>She's looking at him with something odd in her eyes.\"Now,\" she whispers.</p>\n<p>Even as she says it, the doorbell rings. Cass looks away, down at the carpet. She shakes her head. \"Don't listen,\" she says. \"He's wrong about you.\"</p>\n<p align=\"left\">She gets up and leaves the room. Seeing them fight always makes her want to curl up and cover her ears. Especially now, when Bruce won't know what's wrong. </p>\n<p align=\"left\"> </p>\n<p align=\"left\">\"What?\" Bruce asks Cass, but she walks away and Alfred is already midway down the stairs, on his way to answer to door, and Bruce looks up again. Has to look up. He strides towards the foyer with long strides. \"I'll get it,\" he tells Alfred, feeling breathless, something hot and bright in his chest.</p>\n<p>He opens the door, and sees Dick and someone else standing outside. Some man. A flicker of disappointment goes through him. \"Oh.\" He says. \"Where's Jason?\" He asks politely.</p>\n<p>Dick looks at him, wide eyed. So does the other man, actually. Dick's gaze flickers back and forth from him, to the man. Bruce looks at the man.</p>\n<p>Oh.</p>\n<p><em>Oh</em>.</p>\n<p>\"Jason,\" Bruce says, the wild thing in his chest rearing its head again. \"You grew up,\" he breathes.</p>\n<p>For some reason he thought Jason would be a slightly gangly looking fourteen year old boy finishing his algebra homework while eating lasagna for dinner and trying to explain to Bruce why he couldn't just <em>ask</em> Jessica Colbert to <em>prom</em>, <em>dad</em>, she was <em>way</em> out of his league, and she'd <em>totally</em> say no.<br>\nNot this grown man, his shoulders filled out and his jaw square. More lean looking. <em>Ragged</em>, for some reason, is a word that comes to Bruce's mind. He's taller, too. Maybe as tall as Bruce, now. His hair is shorter. There's a white streak in it, right in the front. He looks at Bruce, disbelief clear in his eyes.</p>\n<p>Bruce looks at him in wonder. When did his little boy get so <em>big</em>?</p>\n<p>He smiles at Jason, feeling something he can't quite name. \"Jaybird,\" he says softly, \"have you been taking care of yourself?\"</p>\n<p>Jason looks like he may be sick. He looks at Dick again. Some look passes between them that Bruce doesn't understand, and Dick shakes his head once, a single, firm gesture. Jason looks away.</p>\n<p>\"What's wrong?\" Bruce asks. He wants his Jason back. The fourteen year old gangly kid with a voice that had started to break, and a muffled breath into his shirt collar, whispering that he thought that he was too old to be comforted after having nightmares, but holding onto him tightly anyway. <em>Never</em>, Bruce had said, half asleep and still pleasantly tipsy from that night's gala, <em>You'll be never too old to stop being my son</em>. Jason had blushed, but snuggled closer to his side.</p>\n<p>\"Bruce,\" Dick says, trying to smile brightly, \"maybe we should all go in.\"</p>\n<p>Bruce looks around. It occurs to him that they're still on the threshold of the door. \"Oh,\" he says, trying to get his bearings back. \"Of course. Come in.\"</p>\n<p>They walk inside the manor, and Bruce sits on one of the futons in the living room hall, and looks at them. Jason is still looking away, his hands shoved into his pockets like the last thing he wants to do is be here. He doesn't understand. Do they not talk anymore?</p>\n<p>He realises with a start that he's the man in that pencil sketch with Dick. The one that Damian made, that's up in his bedroom. So they <em>must</em> still talk. He wouldn't be hanging up pictures of his son if he didn't talk to him anymore, would he?</p>\n<p>\"So, Bruce,\" Dick says, looking between the two of them nervously, \"here's the thing. You need to tell me your last clear memory, so that we can actually figure out just how much you've forgotten. It would also help us in potentially being able to synthesise an antidote, or calculating the amount of the drug you were injected with. Or we could somehow reverse engineer it ourselves, I don't know.\" He says, sucking in a breath. He looks at Jason. \"He's here to confirm exactly when whatever you're recounting took place. Get it?\"</p>\n<p>Bruce nods slowly. He's going to tell them the last thing he remembers, and Jason will be able to remember when it happened.</p>\n<p>\"It was raining, and cold. November? No, it was definitely after Christmas. The lights were still up in the manor, and when we came back from Patrol, Jason had some cocoa and I had another cup of coffee.\" He says, frowning as he tries to remember. It all seems so hazy, like slivers of clouds that keep slipping through his fingers. \"He had a science project due on Tuesday, and he hadn't finished it yet. Something about volcanoes?\"</p>\n<p>Jason looks at him, startled. Bruce sees his eyes for the first time. They look hunted. He looks pale, like the colour has been leached right out of him.</p>\n<p>\"I was helping him with it while we were eating dinner,\" Bruce says quietly, holding eyes with Jason. The memory is coming back to him more clearly the more he thinks about it. He's talking directly to Jason now. \"You wanted to make a working model, one with a real explosion. Baking soda and vinegar. But I said we didn't have the time, that the project was day after tomorrow and there was no way I was going to be able to help with your baking soda explosion, because I had a meeting the next day. You ate more of your sandwich and told me that we could use one of the early prototypes of the smoke bombs that I had developed, the ones that didn't quite work with the intensity that I'd wanted. I told you not to be ridiculous. You grinned and said that it was just a suggestion.\"</p>\n<p>Jason is completely still. Not an inch of him moves. His hands clenched into angry fists.</p>\n<p>\"I told you that if we stayed up late after dinner we could probably finish half of it, but Alfred wasn't too happy with the plan. He wanted us to go to bed. It was already two in the morning. We didn't listen to him, as usual. You passed out about half an hour in to the project. There was paper mache stuck to your hands. I half dragged, half carried you upstairs to your room. You mumbled something about your science project counting as thirty percent of your grade, and I told you not to worry, that I'd take care of it. You fell asleep. Then I came back downstairs and finished the rest of the volcano. I fell asleep on the couch.\" Bruce looks at the futon. \"This one. When I woke up two men were dragging me out of a warehouse and towards a van,\" he says, and then turns back to Dick. \"You know what happened from there.\"</p>\n<p>Dick nods, biting his lip. \"Jason?\"</p>\n<p>Jason's head jerks up to look at Dick, \"Yeah,\" he says slowly, like he's in a dream. \"That was five years ago.\"</p>\n<p>He looks at Bruce, hesitation clear on his face. \"I got a B on the project. A volcano was not a very original idea.\" He talks carefully, constantly checking for Bruce's reaction.</p>\n<p>\"Oh,\" Bruce says, clumsily. Words have never been his strong suit, and right now he has absolutely no idea what to say. Jason and he have never had a single lull in their conversations; sometimes it actually feels easier to talk to him than it does to breath. \"Well, that's a shame. I spent three hours on it.\"</p>\n<p>Jason nods. He looks back at his hands.</p>\n<p>In the shared silence, Bruce looks at him searchingly. Jason is trying to look anywhere but at him.</p>\n<p>\"I don't understand,\" Bruce says finally, \"did I say something wrong?\"</p>\n<p>Dick turns to Bruce. \"B, no, of course you didn't, it's-\"</p>\n<p>Jason shrugs jerkily. \"I should go,\" he says. His voice is quiet. He and Dick share another one of those looks that Bruce doesn't understand, and he walks back to the door.</p>\n<p>\"Stay for lunch, at least,\" Bruce calls out, trying not to sound as desperate as he is. \"Alfred made mac and cheese. Your favourite.\"</p>\n<p>Jason turns around to look at Bruce, and for a moment he looks like he might actually cry. His face almost crumples. Bruce jerks back, startled. Even when he was a scrappy twelve year old, Jason never cried.</p>\n<p>\"No, thanks,\" Jason mumbles. \"Maybe next time.\" He leaves with a soft click of the door behind him.</p>\n<p>In the long silence that follows, Bruce clasps his hands together.</p>\n<p>\"Is there,\" he says, very calmly to Dick, \"something you need to tell me?\"</p>\n<p>Dick looks wary. \"Bruce, look, you and Jason aren't so-\"</p>\n<p>\"Hey, I found some of the photos, but I think the ones that I'd backed up to my drive are-- what's wrong?\" Tim is here, clutching in his hand a sheaf of old photos, and a camera.</p>\n<p>Bruce sighs, rubbing at his temples. \"Jason was here. I have no idea what just happened.\"</p>\n<p>\"Oh,\" Tim's face falls, just for a moment. It's obvious to even Bruce, who's admittedly not the best at picking up social cues, that he's disappointed that the attention has been diverted from him yet again. He takes to attention from Bruce like a flower to the sun. Blooming in it.<br>\nA flower that the sun never really notices.</p>\n<p>\"How was it?\" Tim starts putting the photos away, back in his file. The camera goes back in the case. Tucked neatly away, so that he's not a bother to anyone.</p>\n<p>Bruce sighs again. He seems to be severely lacking in the parenting department with all of his children. Except possibly Cass. Cass turned out pretty well.<br>\n\"Come here,\" he says. \"Let's see those photos.\"</p>\n<p>And even as Tim shows him photos of Bruce and Jason grappling across rooftops and alleyways in the night, Bruce can't help but think of what went wrong. Why Jason doesn't look at him like he's looking at Batman in those photos, adoration and love naked in his face.</p>\n<p> </p>\n<p>Lunch is a reserved affair. The mac and cheese feels flat in his mouth. He never liked it much anyway. Alfred usually made it for the kids. Cass and Dick talk to each other in low tones across the long table, ever so often giving Bruce a look. Stephanie is still at her class, across the river. Tim is texting someone on his phone, his food untouched. Damian sits next to Bruce, looking at him like he's trying to figure something out. Bruce moves the food around in his plate, hoping to be able fool Alfred into believing he actually ate some of it. Not that it usually works, of course.</p>\n<p>Someone nudges his shoulder. It's Damian. He's looking at Bruce with his big, clear eyes. \"We were supposed to spar together today,\" he says, his voice petulant sounding. \"You forgot.\"</p>\n<p>Bruce blinks. \"Yes. As I seem to have forgotten everything from the last half decade, Damian.\"</p>\n<p>Damian scowls, and goes back to eating his food irritably. A minute later, he leaves the table, claiming he's not hungry anymore.</p>\n<p>\"Don't mind him, Master Bruce,\" Alfred adds helpfully from a side. He never sits at the table with them, something that hasn't changed in the last five years. It leaves Bruce exasperated. \"He's simply upset. His father hasn't been acting much like himself, lately.\"</p>\n<p>\"It's not like I can <em>help</em> it, for God's sake,\" he snaps. The room quietens suddenly. He can feel their eyes on him.</p>\n<p>He puts his fork down, sighing. \"Sorry, Al.\" He says. \"I need to- I wasn't.\" He pauses. \"I need to go.\" He gets up, the chair pushing back against the hardwood floor.</p>\n<p>\"Go where?\" Dick asks, his own plate forgotten.</p>\n<p>Tim scrubs at his face. \"Jason's apartment, obviously.\"</p>\n<p>\"Master Bruce, I don't suggest-\"</p>\n<p>\"Al, <em>please</em>,\" he says. He must look like he means it, because Alfred steps back.</p>\n<p>Dick rises as well, pushing his own chair back. \"I'll come with you,\" he says.</p>\n<p>Bruce shakes his head. \"You stay,\" he says. \"I should go talk to him alone.\"</p>\n<p>Dick bites his lip. \"Bruce, there's a lot of things that you're not aware of, that happened in-\"</p>\n<p>\"He's my <em>son</em>,\" Bruce says. \"That hasn't changed.\"</p>\n<p>He leaves.</p>\n<p>It's only when he's in his car, halfway down his driveway, when it occurs to him that he has no idea where Jason lives anymore.</p>\n<p> </p>\n<p> </p>\n<p>When Jason gets home, he sinks down onto his shitty couch and stares at the blank, white wall in front of him.</p>\n<p>God <em>fucking</em> dammnit.</p>\n<p>He had been <em>so</em> ready. So ready to fight and yell and <em>rage</em> at Bruce. <em>Look what you've become</em>, he was going to shout. <em>Look what you did to me. To all of us</em>. He had been prepared to see the look of confusion, and then horror and lastly, shame on Bruce's face when he told him that he'd gotten him killed. That he hadn't come for Jason when Jason had needed him the most. That he hadn't even been there for Jason when he came back from the dead, a confused, pit-addled husk of himself. That he had failed to kill the man that deserved to die the most.</p>\n<p>He had been prepared to destroy Bruce. Give him what he deserved.</p>\n<p>Instead, Bruce had greeted him with a smile and told him about the time Jason had fallen asleep making a paper mache volcano for an eighth grade science project.</p>\n<p>He puts his head in his hands. Clarity fucking <em>sucks</em>.</p>\n<p>The worse thing was that before Bruce had recounted the memory to him in such vivid detail, Jason had actually forgotten all about that day. In his mind, that particular day had blended into a series of similarly uneventful, halcyon days. Days with nothing but laughter and patrol and school and Bruce scolding him for not finishing his math homework.</p>\n<p>His eyes get oddly wet, and he pushes back against the tears with his balled up fists. He's being ridiculous. A full grown, twenty year old man fighting back tears at the memory of his dad yelling at him for not doing school work.</p>\n<p>He sniffles, wiping at his nose with the sleeve of his jacket. Fuck this. He's going out to kick some ass. Even if it's the middle of the day. It's Gotham. There's bound to be someone trying to start shit at lunchtime.<br>\nHe puts his helmet on, and straps the guns to his arms. There's a knife in each holster on his leg. One tucked into a boot. He checks to see if he has enough mags, and then leaves his apartment, locking the door behind him.</p>\n<p> </p>\n<p>Two hours and a stab wound later, he stumbles back home, and admits that okay, maybe going out for patrol in the middle of the day? Not such a great idea. The red helmet sticks out like a sore thumb in bright daylight. They saw him coming before he wanted them to.</p>\n<p>He staggers towards the kitchen, clutching at his side, searching for his goddamned med kit. He knows he should probably go to Leslie's clinic, but he's really not feeling up to it right now. He sweeps his gaze across the room, and finds a roll of bandages on the table next to his couch, on which Bruce is currently sitting.</p>\n<p>\"Motherfucker,\" Jason says, without much feeling.</p>\n<p>\"Jason,\" Bruce says, \"you're bleeding.\"</p>\n<p>\"Yeah, no shit,\" Jason says, trying to tamp down that roaring feeling in his stomach. \"Pass me the bandages.\" What the fuck is <em>he</em> doing here?</p>\n<p>Bruce gives him such a concerned look that Jason has to turn away. \"It'll need stitches, Jay. Let me have a look.\"</p>\n<p>Jason shakes his head. He's breathing hard. From the wound or the this, he doesn't know. \"I'm fine,\" he says. \"I'm okay. You should go.\" He says, and then promptly falls over and passes out.</p>\n<p> </p>\n<p>When he wakes up, he's lying down on the couch and there's a blanket over him. An ice pack placed on his ribs. He opens his eyes. Bruce is sitting beside him, on a chair that he must have dragged from the other room. He's looking at him as if he's never seen him before.</p>\n<p>\"What,\" Jason mumbles, still groggy. He suspects that Bruce probably gave him some form of high grade anaesthetic. Where he scrounged it up from, he has no idea. He certainly can't afford any of that stuff.</p>\n<p>Bruce shakes his head. He gives him a small smile. \"You're so much bigger now. It's going to take some time to adjust to.\"</p>\n<p>\"Oh,\" Jason says. <em>I could tell you a few other things that might take some time to adjust to,</em> he thinks. Instead, he says, \"you stitched me up.\"</p>\n<p>Bruce nods. \"I found your suture kit in your bathroom. I think I did a pretty good job. Take a look.\"</p>\n<p>Jason hikes his shirt up a few inches. Ten tiny, neat stitches going up his side, like some kind of miniature ladder. He eyes the ice pack above it.</p>\n<p>\"You had bruised ribs,\" Bruce explains. \"I found out when I was stitching you up.\"</p>\n<p>\"Oh,\" Jason says again. He seems to be incapable of saying much more. \"Thanks.\"</p>\n<p>Bruce nods. He moves a hand to Jason's hair, and starts smoothing it back from his forehead lightly. Like he would when Jason got hurt when he was Robin. Guiltily, Jason finds that he doesn't want to move away.</p>\n<p>\"You'd do it for me.\" Bruce says.</p>\n<p>Jason's not entirely sure he would.</p>\n<p>There's a moment in which neither of them speak. Bruce is looking at Jason in that way again. That soft, slightly confused look. Like Jason's some kind of puzzle he can't figure out.</p>\n<p>\"How did you find my apartment?\" Jason asks, \"Did Dick tell you?\" He's going to kill that sonuvabitch as soon as he can get back on his feet.</p>\n<p>Bruce shakes his head. He smiles again. Why does he keep doing that? It freaks the hell out of Jason. \"It took me a while to figure out,\" Bruce says quietly. \"But some things don't change, do they? Your mother's apartment was two floors below this one. I asked your downstairs neighbour if she knew a white man in his twenties.\"</p>\n<p>Jason gives him a bitter smile. \"I know. I'm just a fucking idiot that keeps going backwards, right? Back to my druggie mom's house in crime alley. Why go back when I could just stay at the manor, and have, I don't know, fucking <em>tea</em> <em>parties</em> with old rich people? Well, guess what, Bruce. It's none of your goddamned business.\"</p>\n<p>Bruce is quiet for a moment. The hand stroking his hair stops. Jason turns away, turning his body to the other side of the couch so he doesn't have to look at Bruce's face.</p>\n<p>\"I don't understand why you're so angry,\" Bruce says finally, his voice quiet. \"What did I do?\"</p>\n<p>Jason squeezes his eyes shut. \"Forget about it,\" he says into the couch, his voice muffled, \"just go.\"</p>\n<p>Minutes pass, but he doesn't hear anyone rise, or any footsteps going towards the door. Jason breathes against the leather padding, and foolishly allows himself to hope.</p>\n<p>Finally, there's an arm placed on his shoulder. It's warm and large and strong. \"I'll go,\" Bruce says, \"but listen to me about this one thing. And then I'll never come back here if you don't want me to. I swear it.\"</p>\n<p>\"What,\" Jason whispers.</p>\n<p>Bruce's hand is still on his shoulder. \"I love you so much,\" Bruce says, his voice barely above a whisper. \"I'm not as good with words as Dick, but,\" he pauses, looking down. \"I don't know what happened between us in these five years, but I would never stop loving you. Never. I believe that with all my heart.\"</p>\n<p>Jason says nothing. He's still turned away from Bruce. His face is wet with tears. \"You'd be surprised,\" he says. \"The things I did. I don't think you'd ever forgive me.\"</p>\n<p>There's a pause, and then the hand on his shoulder is gone, and he can hear Bruce going towards the door. He's going to leave. And he won't come back again.<br>\n<br>\nJason gets up slowly, rubbing at his eyes. \"Wait,\" he says.</p>\n<p>Bruce stops.</p>\n<p>\"Come back here,\" Jason whispers. \"Please come back.\"</p>\n<p>Bruce comes back to the couch. Jason can't quite look at him. \"Please sit back down,\" he says. His heart is pounding so fast. Maybe it's from the blood loss.</p>\n<p>Bruce sits next to Jason, the couch dipping under his weight. Jason looks at the books sprawled across his table. The roll of bandages. The knife that he keeps in his boot. Dick gave it to him. Bruce must have seen his guns. He <em>must</em> have, when he was tending to the stab wound. He's just going to be disappointed in him all over again. Disappointed and angry. Maybe it would have been better if he'd just let Bruce <em>leave</em>. Maybe he shouldn't have-</p>\n<p>\"Jason,\" Bruce's soft tone jerks him out of his train of thought. \"Look at me,\" he says.</p>\n<p>Jason looks at him. Bruce is looking back at him in a way that Bruce hasn't looked at him in a long time.</p>\n<p>\"What's wrong, Jay?\" He asks, his brow furrowed like he actually <em>cares</em>, and that does it for Jason. Something inside of him that's been holding out since this debacle took place just snaps. <em>Fuck it</em>, his brain decides for him.</p>\n<p>He hugs his dad.</p>\n<p>Bruce's arms come around him instantly, holding him in place. Jason shuts his eyes against Bruce's collar. He smells the same as ever, leather and aftershave and <em>Bruce</em>. They sit like that for a moment. Bruce's chest moves up and down slowly, and Jason feels it under his cheek. He's a warm, solid anchor, one that Jason needs to stay afloat.</p>\n<p>\"I don't want to hurt your ribs,\" Bruce whispers to him, eventually.</p>\n<p>Jason nods, and slowly extricates himself out of Bruce's arms. He wipes at his eyes again. \"Sorry,\" he says.</p>\n<p>Bruce's eyes study him. \"That's alright,\" he says. \"You want to go lie down?\"</p>\n<p>Jason nods. Bruce gets up, holding out a hand for Jason. Jason leans on Bruce heavily on his way to the bedroom. By the time they've reach his bed, which happens to be about five metres away from his couch, he's panting, his hands clutching his side.</p>\n<p>Bruce frowns, getting his blanket from the couch. \"You need to go to a hospital.\"</p>\n<p>Jason shakes his head, sitting down on his bed. \"I don't go to hospitals.\" It's hard to get free healthcare with a dead boy's social security number. He lies down, and for a brief moment, it feels like heaven.</p>\n<p>Bruce frowns deeper, but he spreads the blanket on top of Jason. \"I have an MRI and a few other tests scheduled at seven, at Leslie's clinic. Tim's supposed to meet me there. It's three blocks from here. Come with me.\"</p>\n<p>Jason must be more tired than he thought, because he doesn't fight the idea. He just nods. \"Okay.\"</p>\n<p>Bruce goes to the other side of the room, and then outside, to the hall. He looks like he's searching for something. \"Where's your thermostat? I want to turn the heat up,\" he says.</p>\n<p>Jason looks at him. \"I don't have a thermostat. We all have a common one. The landlord doesn't let us change it.\"</p>\n<p>Bruce says nothing for a moment, and Jason knows that he's trying to refrain from commenting on what a piece of shit this building is. \"Why don't you live with me anymore?\" He asks instead. He smiles a little. \"I promise I wouldn't force you to go to any old people tea parties\"</p>\n<p>Jason stares up at him. \"It's a long story.\"</p>\n<p>Bruce makes his way back to Jason's bedside, carrying the chair along with him. He sits, and looks at Jason. \"I have the time,\" he says.</p>\n<p>Jason bites his lip. \"I don't want to talk about it.\" He says. Dick made him promise not to say anything about his death. The thing is, he was going to do it anyway, earlier. Now he can't bring himself to.</p>\n<p>Bruce's face softens. \"Okay.\" His hand finds Jason's. It's warm and dry against Jason's clammy hand. \"Go to sleep. I'll wake you up around six thirty so we can make it to the appointment.\"</p>\n<p>\"Okay,\" Jason says, but he doesn't sleep. His eyes stay open, watching Bruce. Bruce watches him. They both just sit there, soaking up each other's presence.</p>\n<p>\"You remember when you had just come to the manor, and you would hide things? Small things, like my watch or my cuff links. Alfred's gardening tools.\"</p>\n<p>\"Once it was a set of silver forks,\" Jason mumbles. He can feel the sleep starting to take over him. \"I thought that in case you kicked me out, I'd at least be able to sell some of it. Make rent again.\"</p>\n<p>Bruce exhales softly, like he's laughing. \"I don't see how stealing my cufflinks would have helped you pay rent.\"</p>\n<p>\"Are you kidding? The cufflinks I took from you could probably pay the rent for this entire building for three months.\" Jason's slurring over his words now. His eyes are closing.</p>\n<p>There's a silence in which Jason can only hear the birds idly chirping outside. No matter how long or how bad the winter in Gotham is, the birds always come back in the summer. Always. Jason never understood it. Why not just stay in the warm place, is what he used to think. But now he thinks he gets it.</p>\n<p>\"Your hands are shaking,\" Bruce says, and Jason almost doesn't hear him because he's sunk so deep into sleep.</p>\n<p>\"Yeah, they do that sometimes. After a patrol like this.\" He says. He feels Bruce grip his hand tighter.</p>\n<p>\"Want to know something funny?\" Bruce asks.</p>\n<p>\"What?\"</p>\n<p>\"My hands shake all the time too.\"</p>\n<p>Jason looks at Bruce. For the first time in a long time, it occurs to him that maybe Bruce is as human as he is. As flawed and broken. That he's not as perfect as Jason always thought. As he pretends to be. It must kill him on the inside, pretending to be in control all the time. Pretending that he's coping fine.</p>\n<p>\"That's not funny,\" Jason says.</p>\n<p>Bruce shrugs. \"Sorry.\"</p>\n<p>He pauses. He's looking into the middle distance now. Somewhere above Jason's head. \"Alfred once told me that his hands would shake when he came back from the war.\" He lifts up his hand, the one that's holding Jason's. He studies Jason's shaking fingers. The bloodied knuckles that the gloves can't do much to protect. \"Which war have you been in?\" He asks, whispering.</p>\n<p>Jason doesn't know what to say to that, so he says nothing. He looks at Bruce. His father. His teacher. His enemy. The lines are always getting increasingly blurred. His eyelids feel heavy. The drug is starting to kick in.</p>\n<p>\"Go to sleep,\" Bruce tells him, his voice quiet.</p>\n<p>\"You'll be there when I wake up?\" Jason asks. Hears himself asking. He sounds like a child again, he realises.</p>\n<p>Bruce's hand over his is reassuring. New, but somehow also familiar.</p>\n<p>\"Always,\" he says.</p>\n<p> </p>\n<p> </p>\n<p>He can hear the loud whirring of the MRI machine as he's slid into the tube, his hands placed on either side of him.</p>\n<p>\"Bruce, stay still and relax.\" Leslie's voice says, coming somewhat crackly and distorted through the intercom.</p>\n<p>Bruce would usually say that he's done this a thousand times before, it's not like he's not had head injuries before- he's <em>Batman, for God's sake</em>- but speaking now would definitely defeat the purpose of her statement. So he stays still, closing his eyes.</p>\n<p>His side twinges a little, and he frowns, thinking of what he'd found back in Jason's apartment.<br>\nJason had been fast asleep, his mouth slightly open and the blanket kicked away, when Bruce realised that he hadn't showered for the last 26 hours. Ever since he'd come back. He rose slowly, making sure not to wake Jason up, and walked towards the apartment's bathroom.</p>\n<p>It was small, nothing like the large, marbled expanses of space that they had in the manor, but it came with a showerhead and a water supply, so it was perfectly suited for Bruce's needs at present. He took off his clothes, stepping into the narrow stall and turning the taps. Warm water came out the the showerhead, and Bruce closed his eyes against the water sluicing his face. It felt like coming home after a long patrol. He spent maybe ten minutes in the shower, before wrapping a towel around his waist and stepping out. He idly studied his reflection in Jason's small bathroom mirror, above his sink.</p>\n<p>He had more scars. A lot more. Five years worth. He wasn't surprised, really. It was to be expected.<br>\nClaw marks on his shoulder. He smiled at that. Selina was still active in Gotham, then. There was an old red mark on the left side of his chest. Bruce looked down at it. Someone, over the course of the last five years, had tried to brand him. The skin was slightly puckered and raised. He ran his fingers over it. He wondered how he explained it to his dates. Then something more interesting came to his attention.</p>\n<p>There was a fresh cut on his side. Maybe two days old. Made likely when he'd been held captive. Relatively shallow. It hadn't even hurt enough for him to have noticed it earlier. It had two letters, and a three digit number carved into his side. It said - 'NA 128'</p>\n<p>It had very obviously been carved onto his flesh by a batarang.</p>\n<p>Bruce put his clothes back on while considering his options. Either someone had done it to him, or he'd done it to himself. He highly doubted it was the former, because they would have tried to make it deeper. Cause more pain. Years and years of experience had taught him how to perfectly cut into something (or someone) while causing the least amount of damage or pain. This incision looked a lot like that.</p>\n<p>But why, was the question. Perhaps he'd known he was going to be injected by the drug, and there was something essential that he'd wanted to remember.<em> NA 128</em>. What did that mean?</p>\n<p>He opened the door of the bathroom, and was greeted by the site of an empty bed, the covers thrown off the bed like someone had jumped out of it. He could here a loud clatter outside, in the hall.</p>\n<p>\"Jay?\" He called out.</p>\n<p>The clattering noise stopped. Jason ducked his head back into the bedroom. There was something on his face that looked undeniably like relief. \"Oh,\" he said. \"I thought you'd left.\"</p>\n<p>\"I was taking a shower,\" Bruce said. Jason nodded again, looking at patch of wall next to Bruce. Was he really this scared of being abandoned?</p>\n<p>\"Bruce, we're all done for now,\" Leslie says through the intercom, bringing Bruce back to the present. He blinks open his eyes.</p>\n<p> </p>\n<p>In the room opposite the MRI machine, Leslie sits with scans of Bruce's brain. Tim sits in the chair across the desk from her, next to Bruce. Jason is leaning against the wall near the door, his expression slightly guarded, like it usually is whenever he's around Tim.</p>\n<p>\"Here,\" Leslie says, pointing to the scan, \"you can clearly see that certain smaller areas in your prefrontal cortex have slightly less activity than the other parts. Your amygdala and cerebellum show normal activity, which explains why your muscle memory would be intact. It's probably why you can still fight, or use the batmobile.\"</p>\n<p>She points to another part of the scan. \"Short term memory is fine, too. The hippocampus checks out okay.\" She sighs. \"I don't exactly know what this is, but I'd recommend you get some more scans, and preferably get them done by a neurologist.\"</p>\n<p>\"I trust you,\" Bruce tells her.</p>\n<p>She sighs again. \"Maybe so, but a neurologist is definitely more qualified to handle the medical anomaly that is your brain right now. I'm a general physician, Bruce. I could barely see through all the extensive scar tissue on your brain as is. Here,\" she says, showing him a scan with a few white blobs on it. \"What do you see?\"</p>\n<p>Bruce looks at it. \"Nothing. I can't tell.\"</p>\n<p>Leslie steeples her fingers together. \"Exactly. All the scarring on your brain obstructs my view of what's really going on. I'd recommend a brain biopsy, although I don't know how much it'd tell us about the extent or term of your condition. Which brings me to my next question.\"</p>\n<p>Then she frowns at him. Oh god, here it comes. Bruce rubs at his temples, and prepares to wait it out.</p>\n<p>\"<em>Robert Bruce Wayne</em>,\" she says, her eyes narrowed at him. \"Exactly <em>how</em> many times have you come back from patrol with a concussion and just slept it off with the help of a handful of aspirin?\"</p>\n<p>\"You shouldn't sleep if you have a concussion, Bruce,\" Tim says, nodding gravely.</p>\n<p>\"That's actually a myth,\" Bruce says, at the same time that Jason says, \"I do it all the time, and I'm fine.\"</p>\n<p>Leslie glares at him. \"<em>Jason Peter Todd</em>-\"</p>\n<p>\"Oh no,\" Jason says, rolling his eyes. \"You're not getting started on <em>me</em>. This is about Bruce, remember?\"</p>\n<p>\"You live six hundred feet away from my clinic.\" Leslie narrows her eyes.</p>\n<p>Jason shrugs. \"'M tired after Patrol. Don't feel like doing anything but going to bed.\"</p>\n<p>Leslie shakes her head, looking at both of them. \"How the two of you aren't already punch-drunk, drooling idiots with CTE is beyond me.\"</p>\n<p>\"I wear a helmet,\" Jason says. \"Don't know about cowl-face here, though.\"</p>\n<p>\"I don't let people punch me in the face,\" Bruce informs them dryly. \"It looks bad when Bruce Wayne comes back from a girlfriend's penthouse with a black eye.\"</p>\n<p>Jason snorts. \"You could just tell the paps that you ran into a door.\"</p>\n<p>Bruce gives Jason a look. \"Are we done here?\" He asks Leslie.</p>\n<p>\"Yes,\" Leslie says, her voice resigned. \"Don't let anyone punch you in the head for the next few days. I'd prefer if it was forever-\" Leslie holds up her hands in defense when Bruce begins to open his mouth, \"but you'd never listen to that. So no patrol for at least the next week, please. You should be okay. I'll send the results of your blood test to the manor as soon as I can. Now go, I have to see about fifteen different people before I can go home,\" she says, shooing them out of the room.</p>\n<p>As they walk out of the entrance of the clinic, Leslie sticks her head out of her room to say, \"Keep an eye on those stitches, Jason. And don't forget to keep wearing that helmet. Wouldn't want you to turn into a vapid troglodyte like your father,\" she gives Bruce a pointed look. Bruce shakes his head.</p>\n<p>Jason grins at her. \"Will do, Doc.\"</p>\n<p align=\"center\"><br>\n*</p>\n<p>\"So?\" Tim asks, looking at the both of them as they walk down the streets of old Gotham, towards Jason's apartment, where Bruce's car is parked. \"What's going on?\"</p>\n<p>Jason shoves his hands into his jacket pockets again, and looks down, scowling.</p>\n<p>\"Jason's coming home for dinner,\" Bruce says definitively.</p>\n<p>\"Really?\" Tim raises an eyebrow, looking surprised.</p>\n<p>Jason scowls harder, and Bruce is positive that he's blushing a little. \"Yeah.\" Jason says, finally. \"Just for an hour or whatever. Gotta go see Alfie.\"</p>\n<p>\"Right.\" Tim says, still looking a little skeptical. \"And you're not going to try to shoot anyone in Bruce's study again? Like last time?\"</p>\n<p>Jason's head turns towards Bruce so fast, it's a wonder he doesn't break his neck. He glares at Tim. \"What the <em>fuck</em>, dude,\" he hisses.</p>\n<p>Tim's eyes widen. \"Oh crap, I forgot he didn't know about the guns!\" He covers his face. \"I'm gonna go delete myself. Bye.\"</p>\n<p>\"That's okay,\" Bruce says. \"I saw the guns in your apartment. I had to cut away a section of your armour, so.\" He trails off. He's aware that both the boys are looking at him, waiting for his reaction.</p>\n<p>\"And, you're okay with that?\" Tim asks. Jason, Bruce notices, is largely silent.</p>\n<p>Bruce thinks for a while, of the gun that killed his parents. A Baretta 9 millimetre handgun. Semi automatic. Thirteen rounds. Fairly common in Gotham. They sold them for practically nothing in parts of Old Gotham.<br>\nHe had looked at the ballistics reports for the case when he'd been old enough. Two bullets. Two exit wounds. The report had made him sick. He'd thrown up after, his hands clammy and shaking, braced on top of the sink in a public bathroom in the archival department of a police precinct.</p>\n<p>Funny, how he hasn't been able to get over it even after all these years.</p>\n<p>\"No,\" he says. \"I'm not.\"</p>\n<p>Jason draws in a breath. He's looking very interested in his sneakers all of a sudden.</p>\n<p>\"I'm guessing this is what we fight about,\" Bruce says.</p>\n<p>Jason nods. \"Among other things,\" he shrugs.</p>\n<p>\"Like who ate the last peanut butter cup from the fridge that I'd saved up specially for myself.\" Tim says, jokingly. It's clear from his tone that he's trying to lighten the mood.</p>\n<p>Jason smiles grudgingly. \"That too,\" he says, and the look that he gives Tim resembles something close to gratitude.</p>\n<p>They don't talk about it anymore, after that. Bruce doesn't think he can. He can't fight with the one tether he has to his already tenuous grip of reality. They're quiet the rest of the way to the manor, but Jason doesn't try to back out of his decision to go back to the manor, so Bruce considers it a semi-victory, anyway.</p>\n<p align=\"center\"><br>\n<em>*</em>\n</p>\n<p><br>\nThey talk about a great many things at dinner, from the Manor's new security system, to the startling revelation that Damian has actually invited Jon to the manor for a sleepover next Friday,</p>\n<p>(\"You have <em>friends</em>?\"</p>\n<p>\"Shut <em>up</em>, Todd.\")</p>\n<p>Tim informs them that he may have found a potential lead on the Pastorelli case. That one of his surveillance cams picked up video footage of crates with the Pastorelli insignia on them. They may be based down near the bay area, he says. But he'll need more time and intel to figure it out.<br>\nHe says all of this while drinking coffee straight from the pot, looking like death warmed over. Bruce makes a mental note to make sure he gets some sleep after this meal.</p>\n<p>Alfred discusses at great length, the problems that he's facing with the head housemaid and how she refuses to wash the table runners the way he likes them to be done. Dick talks about everything and nothing, babbling about how the communications system needs to be upgraded while commenting on Steph's mom's homemade potato latkes being the best thing to grace God's green earth, in the same breath. Damian disagrees, informing them that he thinks they taste like a mixture of sawdust and potato clumps. Steph shoves a latke in his face, and tells Bruce and that Janice called and that he can postpone all meetings for the next week, but there's a gala that the manor is supposed to be hosting tomorrow, that he absolutely <em>can't</em> blow off. Or Janice may very well come to his house and attempt to castrate him.</p>\n<p>Bruce winces, but eats a latke. Which is actually pretty good. Steph also offhandedly mentions borrowing his car to practice for her driving test, and here, he puts the latke down and flat out refuses. <em>No one</em> is touching the Bentley. He had a look at it. It's a Bentayga 2016. It's from <em>four years in the future</em>.</p>\n<p>The day he lets a seventeen year old drive it, will be the day hell freezes over.</p>\n<p>\"Come <em>on</em>, Bruce.\" She says, making a face.</p>\n<p>\"I don't care how well I may have known you. I don't care if we're practically family. I'm not letting you take out the Bentley for driving lessons.\" Bruce says.</p>\n<p>\"What if you come with,\" she says, smiling sweetly.</p>\n<p>Bruce narrows his eyes, but he has too much latke in his mouth to disagree. So that, he supposes, is that.</p>\n<p align=\"center\"><br>\n*</p>\n<p><br>\nIt occurs to him only after dinner is over, that he doesn't know too much about this Bruce Wayne. The Bruce Wayne he's supposed to be. The man who owns three more cars and four more children than he does. Who probably is smarter and wiser and stronger and probably a better Batman than he is. Who has a bigger family. And more money.</p>\n<p>It occurs to him that this Bruce Wayne is not a very happy man.</p>\n<p>It also occurs to him that this might be the happiest he's been in years.</p>\n<p> </p>\n<p>\"Merge.\" He says, \"Stephanie, <em>merge</em>.\"</p>\n<p>Stephanie looks at him like she wants to shove the steering wheel down his throat. \"I'm <em>trying</em>, okay! Stop backseat driving.\"</p>\n<p>\"If you don't merge right now, the car behind us is going to plow through us.\" He informs her, looking all tense and uptight and batman-y.</p>\n<p>Stephanie sucks in a breath, looking at the Toyota Corolla behind them, from the rear view mirror. \"Shit. You think?\" She asks. The guy driving the corolla looks mean.</p>\n<p>\"Yes. I definitely think. Now <em>merge</em>.\"</p>\n<p>She mumbles something incoherently, trying to switch lanes.</p>\n<p>\"What?\" He says.</p>\n<p>\"I don't <em>exactly</em> know how to merge into a lane,\" she confesses. How hard could it have been, right?</p>\n<p>Bruce stares. He is silent for a moment. \"This,\" he says, after a while,\"is a 2.3 million dollar car, Stephanie. 2.3-\"</p>\n<p>\"I know, okay! I'm trying!\"</p>\n<p>\"<em>Million</em>-\"</p>\n<p>\"It's tough to drive on the freeway!\"</p>\n<p>\"-Dollars.\" He says, speaking over her. The Toyota behind them honks impatiently, and Steph flips the driver off.</p>\n<p>\"Okay,\" Bruce says, rubbing at his temples. \"Here's what you're going to do. Speed up a little bit. You're holding up all the traffic. A <em>little</em> bit- Stephanie. Now veer slightly to the left. Now.\"</p>\n<p>\"I am!\" She complains. It's not her fault if the car won't move.</p>\n<p>\"A little more. You have to actually turn the wheel.\" He tells her, to which she gives him a dirty look.</p>\n<p>\"Okay, now maintain one car's distance from the vehicle in front of you. Good. Veer left. <em>Veer</em>. No don't-\"</p>\n<p>\"They keep honking at me!\" Stephanie says, feeling frazzled.</p>\n<p>\"Yes, because you're going to cause a multiple car pile-up in the middle of the freeway,\" he says, kind of testily.</p>\n<p>\"Thanks for your vote of confidence,\" she makes a face, attempting to turn ever so slightly.</p>\n<p>\"No don't accelerate into the- <em>Stephanie</em>!\"</p>\n<p>\"Sorry!\" She squawks, hitting the brakes. They jerk ahead abruptly, the seat belts straining tight against their chests. Bruce looks slightly wide-eyed, which okay, is <em>totally</em> unfair. He's been in crashing spaceships and flown into deep space with nothing more around him than a flimsy construct made by those green spandex-wearing space guys without batting an eye. Stephanie's driving can't be <em>that</em> bad.</p>\n<p>\"Okay,\" Bruce says definitively. \"Okay. Pull over.\"</p>\n<p>Stephanie spares him a glance, harried. \"What- I don't-\"</p>\n<p>\"Pull over, Stephanie.\" He says, his voice doing that thing where he's trying to sound calm but failing.</p>\n<p>Stephanie makes a face again, but somehow manages to stop the car at the side of the freeway. A few more people honk angrily, but Stephanie ignores them. As if anyone abides by traffic regulations in Gotham anyway. She looks at him. \"Look,\" she starts, trying to explain herself before he starts yelling at her, \"I swear I'm better at doing this usually-\"</p>\n<p>\"Take a deep breath.\" He says.</p>\n<p>That shuts her up momentarily. She opens her mouth, and then closes it again. \"<em>What</em>?\" She says.</p>\n<p>\"I'm going to give you a crash course in driving on a freeway in Gotham.\" He says. \"Pay attention.\"</p>\n<p>Stephanie raises an eyebrow, but doesn't say anything.</p>\n<p>\"You have to be mean.\" he says.</p>\n<p>\"Mean.\" She repeats, without any intonation. She can't quite believe this happening.</p>\n<p>\"Mean,\" he agrees. \"Don't let anyone switch lanes unless you've done it already. It's every man for himself. Do not allow yourself to be bullied. Out there, <em>you</em> must become the bully. Honk. This is essential. Stephanie, you must use the horn as liberally as you can.\"</p>\n<p>Stephanie looks at him with wide eyes. Bruce looks back at her soberly. He's actually being <em>serious</em>. <br>She bursts out laughing. They're both ignoring the steadily louder streams of horns behind them now.</p>\n<p>\"<em>Stephanie</em>,\" he says, but his voice doesn't sound angry or anything. In fact, the corner of his mouth is quirking up a little. Still, he's doing that rubbing-temple thing he does when he's kind of annoyed.</p>\n<p>\"I'm sorry,\" she says, gasping through the last few giggles. \"But you have to understand, the Batman just gave me the absurdest driving advice <em>ever</em>.\" Who wouldn't be a little hysterical over the sheer surreality of the situation? \"Did you just tell me to be a <em>bully</em>?\" She asks incredulously.</p>\n<p>Bruce sighs. \"Okay. This obviously isn't going to work. Get out of the car.\" He says.</p>\n<p>\"Wait- what?\"</p>\n<p>\"Get out of the car. I'm driving. You're banished to the backseat.\"</p>\n<p>\"Bruce!\" She yells, but he totally ignores her, stepping out from his side of the car to cross towards hers.</p>\n<p>She sulks in the backseat. Not even shotgun. Geez, what a hardass.</p>\n<p> </p>\n<p> </p>\n<p>Fifteen minutes and a relieving lack of multiple car pile-ups later, they're safely off the freeway. Stephanie stares at Bruce with a newfound respect.</p>\n<p>\"<em>Dude</em>,\" she says, \"that was <em>amazing</em>.\"</p>\n<p>Bruce raises an eyebrow. \"Thank you,\" he says dryly.</p>\n<p>(But he sounds a little pleased with himself anyway.)</p>\n<p>She shakes her head in disbelief, leaning forward, towards the driver's seat. \"You <em>were</em> mean. Actually, I think you made that truck driver <em>cry</em>.\"</p>\n<p>Bruce makes an expert turn, viciously cutting off a family suburban. The suburban honks at them, and Bruce looks at the guy driving the car right in the eye, and says a swear word that would definitely warrant a severe frown from Alfred. Stephanie grins. Bruce is being <em>so cool</em>.</p>\n<p>\"That's what he gets for driving at 60 at a road with a 70 miles per hour speed limit on a two lane highway. He deserved it,\" He pauses, \"<em>Dude</em>.\"</p>\n<p>And Stephanie really can't help it at this point; she bursts out laughing again. \"How can this be even <em>happening</em>?\"</p>\n<p>The very idea of Bruce doing these kind of things, saying this kind of stuff - it's. . . strange. Extraordinary. Kind of funny. Worrying. Amazing. And so, <em>so</em> strange.</p>\n<p>Bruce is sitting ahead of her, but in the rear view mirror she can see that he's laughing a little bit as well, like he can't help it.</p>\n<p align=\"center\"><br>*</p>\n<p>In the end he takes her to a quieter country road, somewhere in the outskirts of the city.</p>\n<p>\"You need to learn how to drive properly,\" he tells her, rolling up his sleeves, like giving her basic pointers is some kind of herculean task. \"Why don't you have a driver's licence already?\"</p>\n<p>\"I failed the last test,\" she says, matter-of-factly. They're still sitting in the car, except this time Stephanie is back in the driver's seat, and Bruce is sitting next to her.</p>\n<p>Bruce huffs, like it's some personal insult to him that she failed. \"That's ridiculous,\" he says. \"I taught Dick, and he passed the first time he took it. Flying colours. In fact, he got full on his written test.\"</p>\n<p>Stephanie rolls her eyes. \"Figures. Only <em>you'd</em> be proud of someone's driving test scores. Besides, you didn't teach me, B. You're not my <em>dad</em>.\" She snorts.</p>\n<p>Bruce frowns. \"What about your dad, then? Didn't he teach you?\"</p>\n<p>Stephanie snorts again. \"Ha.\" She says. \"You mean mister deadbeat supervillain?\"</p>\n<p>\"What?\"</p>\n<p>\"You don't remember. Right,\" Stephanie realises, laughing. \"My dad's Cluemaster. He's, ah, a little after your time, I guess. So you don't know him just yet. I mean, you do, but you don't remember who-\"</p>\n<p>\"I get it,\" Bruce says, holding up a hand. He sighs. \"Let me guess. You decided to step in and try to stop him, and that's how our paths crossed.\"</p>\n<p>Stephanie grins. \"That's actually pretty close. That, and we both had the common ground of trying to make sure Tim didn't get himself killed. He's not really the greatest at self-preservation.\"</p>\n<p>\"Wait.\" He says, looking confused. \"Weren't <em>you</em> Robin?\"</p>\n<p>\"Yeah. I was,\" she says, and then nothing more.</p>\n<p>Bruce looks at her, and she's pretty sure he knows that he's toeing the edge of some unseen line. Something they never talk about.</p>\n<p>\"Was it good?\" He asks finally.</p>\n<p>\"What?\"</p>\n<p>\"Being Robin. Did you like it?\" He asks, and for a second, she has to look up at his face to make sure he's not making fun of her. Not that he ever would, of course, no iteration of Bruce Wayne would ever be cruel enough to make fun of her few months as Robin. Not when it meant so much to her. But still. She looks.<br> He's being perfectly serious, his face earnest. He's looking at her expectantly. Did she <em>like</em> being Robin. Did she <em>like</em> running across rooftops in the cold rain, sheets upon sheets of water pouring over her until her shivering made her back ache and her head hurt? Did she <em>like</em> getting yelled at by Batman all the time, constantly worried about getting benched? Did she <em>like</em> having to save everyone, no matter what kind of scum they were? Did she <em>like</em> coming home with bruises and stitches and concussions and lacerations and contusions and fractures that made her cry with how much they hurt?</p>\n<p>\"Yeah,\" she answers quietly. Honestly. \"Yeah. I loved it.\"</p>\n<p>Bruce nods. \"Good.\" He says.</p>\n<p>The car is quiet and still for a moment, before Steph breaks the silence with a quick smile.</p>\n<p>\"So! B man. My dude. My guy. My kind of parental figure. My main man. Teach me how to drive this 2.3 million dollar baby\" She says, tapping her purple painted nails on the steering wheel.</p>\n<p>Bruce exhales, tipping his head back against the seat. \"I'm going to regret this.\" He says, his voice flat. He's actually stroking the Bentley's seats kind of lovingly. Seriously.</p>\n<p>Stephanie grins again, and pats Bruce's shoulder consolingly. \"Buckle up, Bruce. This car's going for a ride.\"</p>\n<p>(Bruce groans, and Stephanie laughs again, the edges of her eyes crinkling. It's the stupidest thing, but the last time Bruce acted like this with her, soft and gentle and firm at the same time, was when he was sitting with her in that hospital room, when they both thought she was going to die, when he was telling her she was always going to be Robin. That she would always at least have that.)</p>\n<p align=\"center\"><br>*</p>\n<p>It's not so bad.</p>\n<p>Well.</p>\n<p>It's pretty bad. But she only really crashes into one thing, when everything's said and done. A bush. One measly little bush. It doesn't even dent the car. She doesn't know why Bruce looks like he's going to have a heart attack. Honestly. He's overreacting slightly, she thinks.</p>\n<p>When she informs him of her sentiment, he looks like he may actually implode. \"<em>Stephanie</em>,\" he says again. </p>\n<p>Stephanie grins at him, doing a perfect (<em>perfect!</em>) three point turn. \"Aww, you sound just like yourself again.\"</p>\n<p>\"Out of my mind with frustration and concern?\" He asks, his jaw still tight.</p>\n<p>The concern thing makes something in her stomach go hot and bright, but she shrugs it off. \"Pretty much,\" she says, \"yeah.\"</p>\n<p>Bruce shakes his head again. He's covering his face with his hand like he can't look while Stephanie drives. \"Six of you. All day. <em>Every</em> day. No wonder my hair's going gray.\"</p>\n<p>She gives him a sideways look. \"Plus Jon's here sometimes. Damian and him do all kinds of crazy shit together and drive you and Clark insane.\"</p>\n<p>\"Who's Jon? I heard about him at dinner yesterday.\"</p>\n<p>\"Oh. Jon is Clark's son. He was born during a multiversal cataclysm that threatened his and Lois' lives, so Lois and Clark and Jon from that world travelled to this one to prevent the multiverse from losing its shit and exploding or imploding or whatever. And then they merged with this earth's versions of themselves. And now Damian and Jon sometimes go on playdates together. But don't ever call them playdates in front of Damian. Anyway, it's pretty neat.\"</p>\n<p>\"Huh,\" Bruce says, in a tone that's so appalled that Stephanie almost messes up her reverse parking manuever because she's laughing too hard. </p>\n<p>Almost.</p>\n<p> </p>\n<p><br>Once Bruce decries that he's done all he can for Stephanie for the first lesson, they drive back towards the city, with Stephanie giving him updates on the gala situation. Janice generally gives her the details on events and parties and charity galas, and Tim picks up the slack on conferences and meetings. Together they make a pretty good team, actually. </p>\n<p>\"Caterers will be here at four, to set everything up. All you have to do is let them in and let them commandeer the kitchens. Um, Alfred opened up the north ballroom yesterday, so that should be fine too. The wait staff and live music will be here by four thirty. The event is to celebrate the six year anniversary of your Children Of Gotham charity, so you're gonna have to push for funding. Agressively. There's going to be a lot of the usual, long time patrons turning up, like the Powells and the Elliots. But there's going to be some new faces there too. I think lady who owns LivTech electronics is going to be there? Emily Van or Von something. One of those fancy rich people names. You were contemplating a merger with her for a part of your R&amp;D department, last I heard.\"</p>\n<p>Bruce frowns. \"Emily Van Buren? Her father owned LivTech.\"</p>\n<p>\"Yeah, but he died three years ago. Stomach cancer, I think. She took over. Why, you know her?\" She asks, looking at him.</p>\n<p>\"Not really. We went to college together. Eyes on the road, Stephanie. We weren't friends, but I knew her,\" he says. He can vaguely remember the girl with the shy smile and lightish hair.</p>\n<p>He looks at Stephanie. \"Are you going to be there?\"</p>\n<p>She looks at him, surprised. \"Yeah. Of course. All of us are. It's a children's charity, and technically we're your children. Looks good for the cameras, you standing there with all these disadvantaged kids whose lives you turned around.\"</p>\n<p>She can hear the muted sounds of the car radio. It's the sports channel playing in the background; a post-game analysis on the Orioles-Knights game. Yet another crushing defeat for Gotham.</p>\n<p>She turns down the radio in disgust. God. The only thing worse than Gotham's crime rate is their baseball team.</p>\n<p>\"Not technically,\" Bruce says, after a while.</p>\n<p>\"What?\" Stephanie's only half paying attention, trying to figure out how to take a left turn from a roundabout. </p>\n<p>\"You all aren't <em>technically</em> my children.\"</p>\n<p>Stephanie smiles. \"Wait till I tell Dick you said that. He might actually cry a little. Broodman actually showing emotion. It's a miracle.\" She says.</p>\n<p>Bruce pointedly ignores her statement. \"What about Jason?\" He asks, looking at her, his gaze unwavering.</p>\n<p>Stephanie blinks. It takes her a while to realise what he's talking about. \"Oh. He won't be coming.\" He hasn't, ever since he came back. What would people think, looking at a dead boy attending a charity gala?</p>\n<p>Bruce frowns. \"Why not?\"</p>\n<p>\"Uh.\" Because he legally doesn't exist anymore.</p>\n<p>Stephanie considers her options. She can't tell him the real reason. \"He's busy, I think. He's helping Tim track down that research scientist guy. From the drug cartel.\"</p>\n<p>\"Elijah Brown.\" Bruce says.</p>\n<p>\"Yeah. Him.\" Stephanie hopes her voice sounds even.</p>\n<p>\"How's the search going? Any new leads?\"</p>\n<p>\"Yeah,\" Stephanie says, trying to recall what Tim had told her in the morning, \"Something about them being headquartered in the bay area. Tim and Dick found the exact location, but they're still thinking of how to break in covertly. Apparently they have security guards posted around the perimeter 24/7. We're trying to go for a more. . .stealthy approach this time, after what happened at that restaurant three days back.\"</p>\n<p>\"What happened?\"</p>\n<p>Stephanie makes a face. \"It's a long, messy story.\"</p>\n<p>\"That's what everyone keeps saying,\" he says.</p>\n<p>\"What?\"</p>\n<p>\"I ask anyone a question, and they just tell me it's a long story. Or it's hard to explain. That's just a way to avoid a question.\" He says.</p>\n<p>Stephanie bites her lip. \"Yeah. Well. Sometimes it <em>is</em> a long story. And it <em>is</em> hard to explain. You can't just distill the facts of five years into a few lines and explain everything. The Jon thing gave you half a heart attack anyway, and that was only a few months back.\"</p>\n<p>Bruce looks away, at the wide road stretching ahead of them for miles and miles.</p>\n<p>\"Hey,\" she says, putting a hand on his shoulder. \"It'll come back. Your memory.\"</p>\n<p>He grunts, looking unconvinced.</p>\n<p>\"Sure it will,\" she says easily. \"And then you'll remember why it's a bad idea for us to spend an extended period of time in a small, confined metal box together. And hopefully you'll never agree to do it again.\"</p>\n<p>\"A 2.3 million dollar metal box, Stephanie.\" he tells her, but he's smiling at little, so Stephanie considers it a victory.</p>\n<p>\"You should call me Steph,\" she says, after a while. \"Everyone else does.\"</p>\n<p>\"Do <em>I</em> call you that?\" He asks.</p>\n<p>Stephanie snorts. \"No. With you it's all like, stop putting on eyeliner during patrol, <em>Stephanie,</em> and, stop trying to goad Tim into doing handstands in crime alley at 2 AM, <em>Stephanie</em>, and I'm not mad, I'm just disappointed, <em>Stephanie</em>.\"</p>\n<p>Bruce raises an eyebrow. \"So I take it that patrol has devolved into some kind of high school type group meet and greet?\"</p>\n<p>\"Hey,\" She says, looking at him with an outraged expression.\"the whole itching-powder-down-nightwing's-suit thing happened only the <em>one</em> time. And then you benched us all for like, a <em>month</em>, B.\"</p>\n<p>Bruce shakes his head, but his eyes are warm and fond when he looks at her. Stephanie revels in it, almost. She hasn't had his undivided attention in years. It feels. . .<em>nice</em>.</p>\n<p>\"Eyes on the road,\" he says again, but not particularly chastisingly, \"<em>Steph</em>.\"</p>\n<p>There's never a dull moment at any gala held at the manor.</p>\n<p>Dick idly reflects on this while he attempts to stop his youngest brother from trying to stab some rich old lady with an ice pick.</p>\n<p>\"I'm so sorry, Dorothy,\" he gasps out to her, holding Damian firmly by the waist. \"It's past his bedtime.\" Damian flails around in his arms, accidentally elbowing Dick's nose, and making his eyes water in pain. \"Let me <em>go</em>, Grayson!\" He seethes. \"Say your last words, <em>Shrew</em>.\"</p>\n<p>Dorothy gasps. Kind of theatrically. Then again, everything Dorothy does is kind of theatrical.</p>\n<p>Tim comes out of the crowd, his tablet in hand. \"Hey Dick, they got those tiny prawn appetizers you like.\" He says, chewing on some prawn. and then his eyes flick from Damian to the lady to the ice pick. They all turn to look at him, mid-action.</p>\n<p>Tim pauses mid-bite.</p>\n<p>Then he clears his throat. \"Some other time then.\" He says, attempting to take slow backward steps.</p>\n<p>\"Wait, Tim! Help me out here,\" Dick says, trying in vain to hold back a very unhappy Damian. \"Here, grab his arms.\"</p>\n<p>\"Un<em>hand</em> me, Grayson. She's going to get what she deserves.\" Damian snarls, wriggling around in his grip. Tim tentatively steps forward towards Damian. Damian all but snarls at him, and Tim quickly steps back. \"This old <em>hag</em> said that Father was on <em>drugs</em>.\"</p>\n<p>\"<em>Hey</em>!\" Dick says, offended. \"Did you really say that?\" He looks pointedly at Dorothy. Damian tries to mimic the offended look, but he really just ends up looking like an angry kitten.</p>\n<p>She actually clutches at her pearls. Seriously.</p>\n<p>\"Well, I <em>never</em>,\" she sniffs. \"I simply suggested that Damian's father may be under the influence of certain. . . <em>stimulants</em>.\"</p>\n<p>\"That's the <em>same thing</em>, woman!\" Damian yells, trying to throw himself at her again. Dick reinforces his grip on his waist. \"Damian,\" he hisses. \"Chill <em>out</em>. Ice picks are <em>not</em> the answer. I got this.\"</p>\n<p>He regards the her with a cool gaze. \"Hey, Doro?\"</p>\n<p>\"Yes?\" She says, still looking at Damian warily. Damian glares at her.</p>\n<p>\"Damian's dad has never done drugs. And insinuating that, to his own son, in his own house, is frankly one of the most insulting things you could be doing.\"</p>\n<p>Beside Dick, Tim coughs uncomfortably.</p>\n<p>\"What?\" Dick says.</p>\n<p>Tim scratches the back of his neck. \"I uh, wouldn't say he's <em>never</em> done drugs. Per se.\" The tips of his ears have gone pink.</p>\n<p>Dick looks at him disbelievingly. \"Now is <em>not</em> the time to talk about specifics, Tim.\" He hisses. Tim looks suitably chastised.</p>\n<p>He turns his attention back to Dorothy. \"He isn't on any drugs.\" He reaffirms.</p>\n<p>Dorothy narrows her eyes, tucking a strand of her thinning hair behind a ear that's positively dripping with diamonds. \"Well then,\" she says in a reedy, accusatory voice, \"how do you explain <em>that</em>?\" She says, pointing to the other end of the hall with a bejewelled finger.</p>\n<p>Dick looks across the hall in the direction of her pointed finger.</p>\n<p>\"Oh, no.\" He says. Tim covers his face with his hand.</p>\n<p>\"Oh, <em>yes</em>,\" Dorothy smiles viciously. Across the hall, Bruce is engaged in an intense conversation with Dorothy's very confused looking grandson.</p>\n<p>\"What's wrong?\" Damian asks, looking lost.</p>\n<p>Dorothy smiles, smug. \"Child, this is before your time. The man talking to your father is my grandson, Robbie.\"</p>\n<p>Damian raises an eyebrow, all thoughts of ice pick abetted stabbings currently on hold. \"So?\"</p>\n<p>\"So, Bruce and Robbie haven't talked since 2014, ever since Robbie won Gotham's Most Eligible Bachelor award from Bruce, who'd been the reigning champion for the last 7 years.\"</p>\n<p>All four of them look at Bruce from across the ballroom floor. He's saying a joke or something to Robbie, waving his hands around and grinning while he does it. Robbie is just standing there, looking like he's been hit by a truck.</p>\n<p>Dorothy turns back to them. \"Drugs.\" she concludes.</p>\n<p>Dick rubs at his eyes tiredly. So much for a fun night. \"Look. This has been a fun chat, but we need to go and um, have a talk with Bruce.\"</p>\n<p>Dorothy's eyes glint with the joy of knowing something about Bruce Wayne that no one else knows. \"You do that, honey,\" she says, delighted.</p>\n<p>Damian narrows his eyes. \"This isn't over, harlot woman. Mark my words, by daybreak your grandson Robert and you will have your entrails strung over the gates of this manor.\"</p>\n<p>\"<em>Damian</em>.\" Dick says. \"Less gut-talk and more walking,\" he pushes Damian gently forward, and they walk towards Bruce to the other end of the ballroom.</p>\n<p>\"This was a bad idea.\" Tim whispers. \"We should get him out and away from here before someone tries to talk to him about a business deal they made three months ago or an ex girlfriend approaches him or something.\"</p>\n<p>\"I know,\" Dick says back, just as quiet. \"Can you tell everyone that Damian's sick? That way it'll look good if Bruce skips out of the party to take care of him.\"</p>\n<p>\"I'm not sick!\"</p>\n<p>\"We know, Damian.\" Tim says, rolling his eyes. \"Just go with it, okay?\"</p>\n<p>Damian grumbles, but reluctantly agrees.</p>\n<p>\"Great,\" Dick says, and puts on a smile. In a slightly louder voice, he says, \"Bruce! There you are! I need to speak to you.\"</p>\n<p>Bruce is engrossed in a conversation with Robbie's date. \"-- and that's the story of how I got a unicorn tattoo on my ankle,\" he's saying, grinning at her. It's possible that he plays the role of Brucie even better than the Bruce they know now does. His hands are shoved casually in his pockets, his back hunched slightly, his first two shirt buttons open. It's scary how good he is at it.</p>\n<p>\"<em>Bruce</em>,\" Dick says again, still in a loud voice. Still, it's tinged with the slightest hint of urgency, so Bruce turns around. He sees their faces, and turns back to Robbie and his date. \"Excuse me, but I have to go. Stick around, though. Mingle!\" he says, grinning again.</p>\n<p>Bruce waits until he's out of earshot before he speaks. \"What is it?\" He asks in a low voice, \"Is the batsignal on?\"</p>\n<p>\"No, Cass is taking care of that, remember?\" Dick says.</p>\n<p>\"What then?\"</p>\n<p>\"Do you really have a unicorn tattoo on your ankle?\" Tim asks.</p>\n<p>Dick turns to him, ready to tell him that there's a time and place for this stuff. Then he pauses. It <em>would</em> be pretty cool if Bruce had a unicorn tattoo on his ankle. He supposes that waiting a <em>few</em> minutes to find out wouldn't hurt.</p>\n<p>Bruce pauses to hitch up his pants leg a little. \"I lost a bet to Clark about a Knights' game in the summer of 2007. There were consequences. Although, I seem to have gotten it removed,\" he says, frowning at his bare ankle. \"Clark's never going to let me hear the end of if.\"</p>\n<p>Dick can't decide whether to laugh or scream. \"You never told me about any unicorn tattoo,\" he says indignantly.</p>\n<p>\"You would have tried to get a matching one, Dick.\"</p>\n<p>\"Maybe so, but I still have the right to know about any unicorns you're putting on your body, B.\"</p>\n<p>\"Clearly,\" Stephanie says, from a side, \"I seem to have stumbled onto some gray, uncertain territory of TMI, so I'm slowing backing away now.\"</p>\n<p>\"Wait, Steph,\" Dick says, \"we're pulling Bruce out of the party. You've gotta help us with the guests.\"</p>\n<p>\"Why am I being pulled out of the party?\" Bruce asks, one eyebrow raised.</p>\n<p>\"Because you're too-\"</p>\n<p>Bruce holds a hand up. He's looking at something over Dick's shoulder. \"Steph,\" he says, his voice kind of strange sounding. \"Is <em>that</em> Emily van Buren?\"</p>\n<p>Dick turns around to where Bruce is looking. A pretty looking blonde in a pink cocktail dress is talking to someone near the bar.</p>\n<p>\"Yeah,\" Steph says. \"Why?\"</p>\n<p>\"No reason,\" Bruce says, and wow, is he actually <em>blushing</em>? \"She just looks. . . different. Not the girl I remember from college. That's all.\"</p>\n<p>Steph makes a very rude snorting noise. \"<em>Golly gee</em>. Bruce has a crush.\"</p>\n<p>Bruce gives her a look. Then he turns to Dick. \"I'm fine. Really. You don't need to pull me out of this.\" He says, and then picks up two champagne flutes from a passing waiter's tray. \"Now, if you'll excuse me, I'm going to talk to an old friend.\"</p>\n<p>Steph cups her hands around her mouth as he makes his way towards the bar. \"Go get her, Tiger!\"</p>\n<p>Dick laughs. Maybe this night won't be so bad after all.</p>\n<p align=\"center\"><br>*</p>\n<p>Emily smiles at him. \"Bruce, it's such a pleasure to see you.\" She says. Bruce smiles back. Unlike the large majority of people who say this to him at parties, she looks like she really means it.</p>\n<p>\"It's the same for me,\" he says. \"I haven't seen you since college. We were in Bruderlein's Economics class together, right?\"</p>\n<p>Emily frowns. \"Yes, but we met after that, too.\"</p>\n<p>\"Oh, right, I remember,\" Bruce starts to lie, before Emily says, \"We met at that tech seminar, right after your son passed, right? Oh, watch out you're going to-\"</p>\n<p>The champagne flutes fall to the ground.</p>\n<p>Emily and Bruce stare at the broken glass and champagne on the floor.</p>\n<p>\"Drop the glasses,\" Emily says, belatedly. She looks back up at him. \"I shouldn't have spoken about it. <em>Shit</em>, Bruce, I'm <em>so</em>-\"</p>\n<p>\"It's fine,\" Bruce says, still looking at the mess on the floor.</p>\n<p>There is a very long pause.</p>\n<p>\"Which son did you say passed again?\" Bruce finally asks. He feels slightly faint.</p>\n<p>Emily looks confused. \"What? I- I didn't mean to-\"</p>\n<p>\"Yes.\" Bruce says, signalling at a waiter to mop up the mess. \"Of course you didn't. I understand. But if you'll excuse me, I really must go now.\"</p>\n<p>\"Oh,\" Emily says. \"Of course. But you really must know. About Jason, I didn't mean to talk about it. I don't know what I was thinking, it just slipped out. <em>Gosh</em>, I'm being so <em>rude</em> and-\"</p>\n<p>Bruce goes very still. \"Jason.\" He says. He has the distinct urge to put his head in his hands.</p>\n<p>\"Yes, I'm <em>so</em> sorry I-\"</p>\n<p>\"It's fine, it's fine,\" Bruce says trying to go for a smile. It doesn't come out so well. \"I really must go now. It's been lovely talking to you.\"</p>\n<p>He leaves the ballroom with hurried steps, heading in the direction of the one place he hasn't gone to since he lost five years of his life.</p>\n<p>The one place he didn't think to go to. The one place he was <em>stupid</em> enough to not go to. The one place, that now that he thinks about it, everyone was deliberately trying to keep him out of. Even Leslie.</p>\n<p>The batcave.</p>\n<p>He finds file after file of information. It's not that hard. He knows how to de-encrypt the data because he was the one who wrote the program. He finds case files and incident reports. Old newspaper articles. Older still emails from Jason's school.</p>\n<p>An autopsy report that he can't look at for too long.</p>\n<p>He knows the right key words because he was the one that set up the system. So he finds the information. He finds it, and he stares at the monitors, wondering how he could have ever been so blind.<br>\n<br>\nJason starts getting benched more in 2013. He almost kills a man in February of that year- putting him in a coma after repeated blunt force trauma to the head. He literally punches his head in. Same thing the next week, when he fractures a woman's arm in three different places. She's the kingpin of a child prostitution ring. He finds a news article about it. Robin handcuffing her bent out of shape hands, looking steadily at the camera. He is not smiling.</p>\n<p>March of that year, Bruce goes on a fifteen day business trip and when he comes back he finds out that Jason's been expelled from school for breaking a boy's leg. With a baseball bat.<br>\nHe's stupid about it. Doesn't think. He gets angry instead of asking questions. Instead of paying more attention to him. Personal emails from him to a child psychologist. She recommends Prozac. Robin is benched again.</p>\n<p>By April, he's dead.</p>\n<p>He finds other things, things that explain the impossibility that is Jason Todd. A file on the Lazarus pit. One on the Red Hood. '<em>Dangerous</em>' it says. '<em>Highly volatile'. 'Pit-madness and PTSD</em>'. He goes through the file. He has a contingency plan for him too, in a separate attachment. For his own son.<br>\nHe doesn't bother to read it, switching off the monitor in disgust.</p>\n<p>He sits there for a long time. He doesn't know how long. He stares at the stone wall of the cave in front of him. He studies his hands. He switches on the monitor again and reads half of the contingency plan before he has to switch it off again. He stares at the wall some more.</p>\n<p>He is so, <em>so</em> angry.</p>\n<p>Angrier than he has been in a long time. The pure rage feels like it's literally coursing through his veins. Hot and bitter and pulsing.</p>\n<p>He gets up from the chair, walking away from the console and the array of monitors. He walks a little, trying to burn off some of that rage before he breaks something.</p>\n<p>That's when he sees the glass case.</p>\n<p>He walks up to it slowly. It's right in the middle of the batcave, and everything in the cave almost seems to be built around it. Every chair, every workstation, even every parking pad in the far corner of the cave, near the tunnels, is facing it. He'd have to be looking at it constantly whenever he came down here. Like something he doesn't want to let himself forget.</p>\n<p>Without knowing what he's doing, he walks up to it, and puts a hand on the cool glass. Another. . . what had Leslie said? <em>Muscle memory.</em></p>\n<p>The uniform in the case is stained with something brown and old that makes Bruce feel sick to his stomach. There are little tears all over it, that have been carefully stitched up. Did he make Alfred do that? Or did he do it himself? Clutch the remains of his son, mend the last shreds of his essence so he could cling onto that like a fool. Force himself to remember his greatest failure everyday.</p>\n<p>He rests his forehead on the glass. It's cool on his skin. He shuts his eyes.</p>\n<p>Then he draws his fist back, and punches the glass wall as hard as he can.</p>\n<p>It doesn't break. He doesn't expect it to. It's probably bulletproof. There's a sick sort of irony in that. A bulletproof case to protect something that is already dead.</p>\n<p>He hits the glass again anyway. And again. And again. He does it till he loses count. Until his blows get more uncoordinated and sporadic. His knuckles start to bleed.</p>\n<p>He stops to take a breath, and means to sit down only for a minute, but ends up kind of collapsing against the memorial, sliding down to the floor slowly with his back against the glass.</p>\n<p>He tips his head back, resting it on the glass. His hand hurts like hell. There's a hole in his chest, right down the middle, that hurts even worse.</p>\n<p>This too, feels like muscle memory.</p>\n<p align=\"center\"><br>\n*</p>\n<p>Dick finally finds Bruce in his study. \"Oh, there you are. Why are the lights off? We've been looking all over for-\"</p>\n<p>He stops. Inhales. The whole room smells like-</p>\n<p>\"Have you been <em>drinking</em>?\" He asks, incredulously. Bruce <em>never</em> drinks.</p>\n<p>Bruce looks at him. His eyes have a weird, blank look to them. He's sitting behind his desk, slumped over it really. There's a bottle of scotch in front of him, and one of those fancy drinking glasses that Alfred keeps in the liquor cabinet that no one ever uses.</p>\n<p>\"You never drink,\" Dick says. Something's gone wrong.</p>\n<p>Bruce doesn't say anything in reply. Just pours himself another two fingers of scotch and throws it back like it's nothing.</p>\n<p>\"I don't know about that,\" Bruce says. His voice is rough. \"I found this in the bottom drawer of the study, and it was already a quarter empty.\" He laughs, but it sounds bitter and angry and <em>wrong</em>. \"I've had another half of it and I'm not drunk yet. So I probably drink quite a bit, Dick.\"</p>\n<p>Dick pauses. He's on uncertain ground.</p>\n<p>Bruce scrubs a hand over his face. The sharp angles of his face look more blurred somehow. Smudged. \"Get out of this room,\" he says, softly.</p>\n<p>Dick frowns. \"What?\"</p>\n<p>\"Get out.\" Bruce says again. He's not even looking at Dick, just rolling the empty glass back and forth in his palm.</p>\n<p>\"Bruce-\" he starts, but then Bruce gives him such a look of contempt that Dick has to physically take a step backwards.</p>\n<p>He pauses again, to think. Bruce was fine two hours ago, when Dick last saw him. Now he's sitting in his study, drinking in the dark. And is that blood on his knuckles?</p>\n<p>Dick stops. Swallows. His mouth is dry. \"You know,\" he says.</p>\n<p>Bruce smiles again, wry and angry. He pours himself some more scotch.</p>\n<p>\"Stop it,\" Dick says, feeling helpless. \"You're going to make yourself sick.\"</p>\n<p>\"Yeah?\" Bruce says, \"I'm going to make myself sick? When did you get so concerned about me?\"</p>\n<p>\"Come on, Bruce, don't be like that I-\"</p>\n<p>\"<em>All</em> of you lied to me,\" Bruce says, his voice barely a thread of sound. \"Every single one of you.\"</p>\n<p>\"We did it-\"</p>\n<p>\"For what? My own <em>good</em>? So I could sleep easy, knowing that I got my son killed?\"</p>\n<p>Dick finds that there's nothing he can say to that.</p>\n<p>He steps forward, towards the table. He kneels down next to Bruce's chair. Bruce is still looking away from him. His hands are clenched into helpless fists.</p>\n<p>\"Bruce,\" Dick says softly, \"let me get you something to eat, alright? The party's still going on downstairs, and everyone's looking for you. You don't have to go back. But you gotta eat dinner, okay? You're going to throw up, otherwise.\"</p>\n<p>Bruce shakes his head. \"Leave,\" he says again, but he just sounds tired.</p>\n<p>Dick puts his hands on Bruce's shoulders. \"I'm not going anywhere. I'm going to tell you a story, okay? It's a story about the week we finally stopped fighting.\"</p>\n<p>\"Dick-\"</p>\n<p>\"No,\" Dick says firmly. \"You listen. This is important.\"</p>\n<p>Bruce is silent, staring at the desk, so Dick takes that as a yes and begins.</p>\n<p>\"It was, I don't know, maybe two months after Jason's funeral? Alfred called me in the middle of the night. I'd just come back from a late night shift from the precinct. I'm a cop now, dad,\" Dick says softly, smiling. Bruce shuts his eyes.<br>\n\"Youngest on the force, back then. Anyway, I was awake, and Alfred told me that you'd been spending less and less time in the manor, and more and more time in the cave. Your hours as batman were getting so long that you were hardly ever Bruce, anymore. When he called, you hadn't come upstairs in the last three days. He was pretty freaked out. Or as much freaked out as Alfred can get, anyway.\"</p>\n<p>\"There wasn't much I could do, and I told him that, but I drove here anyway. All the way from Bludhaven. By the time I reached the manor, it was almost morning. Alfred took me down to the batcave. The minute I saw you,\" Dick stops, shaking his head. \"I was this close to calling Leslie, and asking to get you admitted or something. You were typing something on one of the computers. It was clear you hadn't slept in like half a week or something. You didn't even <em>notice</em> that I'd come in. <em>You</em>.\"</p>\n<p>Bruce has been silent all this time, but now he speaks. \"What did you do,\" he says, his voice still rough and tired, but at least he's talking to Dick.</p>\n<p>\"I took you to my apartment.\" Dick says.</p>\n<p>Bruce looks at him, and the only reason he can tell that Bruce is surprised is because he's known him for so long. To anyone else it would just look like a mildly inquisitive look.</p>\n<p>Dick shrugs. \"I couldn't let you stay in the manor any longer. It was killing you. So I made Alfred take a week off, and I took you back to my place, in Bludhaven.\"</p>\n<p>He remembers Bruce how had sat next to him in his car in complete silence, all the way to Bludhaven. He'd just looked outside through the window, a blank sort of look on his face. Hadn't even argued, when Alfred had put him in a jacket and all but shoved him into Dick's car. He had just kind of given up. Like he wasn't even there with them anymore. It had been one of the scariest days of Dick's life, constantly looking sideways at Bruce to make sure he didn't have a sudden change of heart and try to open the car door and hurl himself out into the moving traffic.</p>\n<p>\"You spent a week in my flat. You slept a lot. Didn't eat much. Barely ever talked. I was so worried,\" Dick says, \"I had no idea what to do. And I had work, so I had to leave you alone for like ten hours everyday. You were just sitting around in my apartment and staring at the walls. Not much better than the manor, after all. So one day I decided to call in sick and take you to the zoo. I know,\" Dick says, holding up his hands and smiling a little, before Bruce can say anything, \"taking a depressed person to the zoo does not help make them better because they're not five year olds with crises that can be instantly solved by seeing a few monkeys. But you have to remember that I was only nineteen, back then. I hadn't seen <em>anyone</em> act like this before.\"</p>\n<p>Bruce is still quiet, staring in the middle distance. Not unlike he'd done all those years ago, in Dick's matchbox sized apartment in the North side. It makes Dick falter, momentarily. What is he hoping to achieve, with this? Does he really think some kind of sentimental story about their reconciliation will make Bruce forgive him for probably the worst thing he could've done to him in this situation? Maybe he shouldn't even-</p>\n<p>\"Zitka,\" Bruce mumbles. \"We saw Zitka.\"</p>\n<p>Dick looks at him in amazement. \"Sure did,\" he smiles. \"You're remembering stuff! That's amazing, Bruce. Then we went and saw the-\"</p>\n<p>\"Penguins,\" Bruce says. \"I don't like penguins.\"</p>\n<p>Dick laughs. \"I wonder why.\" He could practically sing with joy right now. \"This is awesome, Bruce. You remember anything else?\"</p>\n<p>Bruce looks down. He shakes his head.</p>\n<p>Dick nudges him with his shoulder. \"Must've been a pretty important memory for you, huh?\" He grins again. This is what he does. Keeps up the charade of good cheer for Bruce until he comes to believe it. He did it back when he was Robin, and he does it now. He doesn't mind it. It's become a part of him, almost. \"You remember how Zitka remembered me after all those years? You kept saying she didn't, but I could see the look in her eye, Bruce. I <em>knew</em>.\"</p>\n<p>Bruce runs a hand over his face. He looks like he's somewhere far away.Dick has no idea if he's even listening.</p>\n<p>\"And then,\" Dick continues, ignoring that still worryingly empty look in Bruce's eyes, \"we went to get lunch at. . .what was it? Some terrible sandwich place near the promenade. You remember?\"</p>\n<p>Bruce shakes his head again.</p>\n<p>\"That's okay. You will, eventually. We went there, and I think it was the first time we talked properly in years. Well. Mostly I did the talking. You just listened. But you asked me some questions about how work was, and stuff like that. We talked a little bit about Jason. I think you even cracked a smile or two when I made a joke. It felt nice. Kind of reminded me of how it used to be just the two of us all those years ago. On the way back home you bought me some cotton candy from the promenade,\" Dick laughs. \"Just like you would when I was a twelve. I think we were both just too tired to keep fighting anymore.\"</p>\n<p>Dick is silent after that, and after a while, Bruce looks at him. \"And then?\" He asks.</p>\n<p>A tiny flare of victory lights up in Dick's chest. He <em>is</em> listening.</p>\n<p>Dick shrugs. \"You went home after a week. You were slightly better. We talked some more on the car ride back to the manor. I even stayed for dinner. I think Alfred was kind of surprised. I hadn't stayed at the manor for more than fifteen minutes at a time for a long time. I kept coming back after that. Not every week, but maybe every other week. I told myself that I was doing it to keep an eye on you, but it was mostly just so I could see you again. And by then, Tim had already started training under you. You were talking again. Having actual conversations, and not staring at walls anymore. Tim really changed your life, you know. You didn't need me to keep an eye on you anymore.\"</p>\n<p>The silence after that is long. Dick stands up again, and puts the the glass and the scotch away, on top of a shelf. He'll put them both back in the liquor cabinet later. Bruce is still sitting at his desk, staring at the nothing. Dick wonders idly how bad he's fucked up. Maybe Bruce will ask him to leave again. He might actually have to. He's fresh out of stories to tell.</p>\n<p>\"I always will.\" Bruce says, finally, so quiet that Dick almost doesn't hear him. \"Need you, that is.\"</p>\n<p>Dick reaches Bruce in three long strides, and is hugging him before Bruce can even say anything further. \"I'm so sorry, dad,\" he whispers into the collar of Bruce's dress shirt, \"I'm so damn sorry. I fucked up. I shouldn't have lied. I'm so, <em>so</em>-\"</p>\n<p>\"It's fine,\" Bruce is saying, rubbing Dick's back. \"I'm fine, you don't need to apologize.\"</p>\n<p>Dick nods, and wipes his eyes with the back of his hand. He breathes in and out. Bruce's hands still around him. Five more seconds before he makes himself get up. He should be the one comforting Bruce, not the other way round.</p>\n<p>He finally looks up at Bruce. Bruce is looking back at him with an expression not wholly unlike tenderness. That weird empty look in his eyes is mostly gone, he notes with relief.</p>\n<p>\"Tell me something you want me to do.\" Dick says. \"Anything.\"</p>\n<p>Bruce is silent for a while before he says something. \"Jason,\" he says, trying to get up. He sways on his feet a little, and Dick drags him back into the chair. No matter what Bruce says, he's definitely at least a little drunk. \"I want to see Jason.\"</p>\n<p>\"In this state?\" Dick says, \"You're just going to upset him. Let's wait until tomorrow. Anyway, It's like one in the morning, B.\"</p>\n<p>Bruce rubs at his eyes. He can tell that Bruce knows that he's right.</p>\n<p>There is a short silence.</p>\n<p>\"How the <em>fuck</em> did this happen,\" Bruce says. He sounds so helpless that it breaks Dick's heart.</p>\n<p>Dick sighs. \"I'll take you to his flat tomorrow. You need to sleep.\" Eating seems like a no-go, right now. Bruce might throw it up. \"Can you make it to your room?\"</p>\n<p>Bruce nods. He gets up, slower this time. Doesn't sway or stumble or anything.</p>\n<p>Dick watches him open the door connecting his bedroom to the study. At the threshold, he stops.</p>\n<p>\"Dick,\" he says.</p>\n<p>\"Yeah?\"</p>\n<p>\"Thank you.\" He turns. Looks at Dick in the eye. \"You know, right? That I-\"</p>\n<p>Dick allows himself the smallest of smiles. \"Yeah.\" He says. \"Yeah, Bruce. I do.\"</p>\n<p> </p>\n<p> </p>\n<p>\"I'll wait outside,\" Dick says to him, squinting as the early morning light falls into his eyes. He's leaning against his car, two plastic cups of coffee in hand that he got from a coffee shop on the way here.</p>\n<p>\"You don't have to do that,\" Bruce starts to say, but Dick shakes his head firmly. \"This is for the both of you,\" he says. \"Not me.\"<br>\nHe gives him both the cups. \"Give one of them to him. He's cranky in the mornings.\"</p>\n<p>Bruce nods, taking the cups. He stares at the lobby of the apartment building in front of him, hesitant.</p>\n<p>Dick prods at his side not-so-gently. \"Go on,\" he says.</p>\n<p>Bruce sighs. \"What would I say?\" He's always been reliant on Dick for emotional advice and guidance. Even when he was a thirteen year old boy with braces. Now is no different.</p>\n<p>\"What you mean, B. Speak from your heart.\" Dick says.</p>\n<p>Bruce gives him a look. \"Because I'm so good at that.\" Speaking from the heart. Sounds ridiculous.</p>\n<p>Dick smiles a little. \"He'll understand what you mean. Trust me.\"</p>\n<p>Bruce gives the lobby one last hesitant look, and then squares his shoulders and walks in. He climbs up the stairs slowly, trying to get his thoughts in order. Trying to think of what he should say to him. He's going to apologize. Say that he loves him. Say that it was all his fault, and he should have listened better to what Jason was trying to tell him. Say that if Jason can find it within him to forgive Bruce, then Bruce will be forever grateful for something he never deserved.</p>\n<p>And then Jason will nod and square his jaw and shut the door on his face.</p>\n<p>Bruce shuts his eyes. What is he <em>doing</em>? A <em>sorry</em> won't fix a <em>death</em>.</p>\n<p>He reaches the door of the Jason's flat, and waits outside for a long time before he knocks. He takes a deep breath. <em>Speak from the heart.</em></p>\n<p>He has absolutely no idea how to speak from the heart.</p>\n<p>The door opens almost five whole minutes later, and Jason squints up at him through bleary eyes, his hair sticking up perpendicular to his head in places. Bruce has an irrational urge to smooth it down.</p>\n<p>\"Bruce?\" Jason says, his voice confused sounding and heavy with sleep, \"it's like six in the morning. What are you doing here?\"</p>\n<p>\"It's eleven.\" Bruce says. He would have come sooner, but he was sleeping off his hangover.</p>\n<p>Not one of his proudest moments.</p>\n<p>Jason rubs at his eyes. \"Fuck. I was supposed to go get breakfast with Roy.\" He shuffles back inside the apartment, and Bruce follows him.</p>\n<p>Jason is opening and closing kitchen cabinets, looking for something. \"Ha!\" He says, taking out a carton of cereal. \"I <em>knew</em> I wasn't out of this stuff.\" He looks back at Bruce. \"Want something to eat?\"</p>\n<p>\"I- No,\" Bruce clears his throat. \"I got you some coffee. Well. Dick did.\" He says, holding out the cup for Jason.</p>\n<p>Jason takes it, looking at Bruce curiously. \"Dick's here? Is he waiting outside or something?\"</p>\n<p>\"Yes, Jay, I-\" Bruce sighs, and sits down heavily on Jason's couch. The same one he lay Jason down on two days ago, scared out of his mind that he was going to bleed out right there. \"I have something to say.\"</p>\n<p>Jason raises an eyebrow. \"Okay,\" he says.</p>\n<p>\"I found out what happened,\" Bruce says quietly. He can't quite bring himself to say it. <em>Found out that you died.</em></p>\n<p>Jason stares at him for a moment, not understanding. And then there's a flicker of realisation in his eyes.</p>\n<p>\"Oh,\" Jason says. \"<em>Oh</em>.\" He sits down on the couch next to Bruce.</p>\n<p>Bruce studies his hands. He can't really meet Jason's eyes, even though he knows that Jason is looking at him.</p>\n<p>\"If you could,\" he says finally, \"if you could ever even consider- to bring yourself to forgive me, I would-\" he stops, and looks at his hands some more. His voice seems to be failing him. Funny, how fucking <em>useless</em> he is, at this.</p>\n<p>\"Bruce,\" Jason says in an odd voice.</p>\n<p>Bruce shakes his head. \"I'm sorry. I'm so <em>so</em> goddamned <em>sorry</em>, I couldn't even <em>begin</em> to-\"</p>\n<p>\"Bruce,\" Jason says again, in that same voice.</p>\n<p>\"I <em>never</em> thought it would happen to you, you have to believe me, Jay, I was so <em>damn</em> <em>stupid</em> and <em>callous</em> and <em>reckless</em> and I got you <em>killed</em> and I-\" He's crying now, his eyes wet and his voice trembling, and Jason is looking at him with wide eyes, the cups of coffee between them forgotten.</p>\n<p>\"<em>Bruce</em>,\" Jason say again, more forcefully, and Bruce stops talking.</p>\n<p>\"Stop it,\" Jason says. He sounds angry, almost. \"I don't want to have to listen to this.\" He gets off the couch and goes back to the kitchen counter and stands there for a while, his palms flat against the counter and his eyes closed.</p>\n<p>\"Jason,\" Bruce starts, but Jason cuts him off with a shake of his head.</p>\n<p>\"Stop talking.\" Jason says. Bruce stops talking.</p>\n<p>It's a long time before Jason opens his eyes again, and comes back to the couch to sit next to Bruce. He looks at Bruce, studies every square inch of his face.</p>\n<p>\"What the hell are you doing, Bruce,\" he says, and he sounds so tired. \"You know how many times we've fought about this? How <em>many</em> missions have gone wrong because I barged into an arms deal too quick, and everything went wrong? Because I started shooting up a restaurant which had explosives in it and the whole thing blew up? And you'd yell at <em>me</em> for being <em>stupid</em> and <em>callous</em> and <em>reckless</em>. And now you're turning this whole thing around.\" Jason says, shaking his head. \"You know how <em>much</em> I want to be pissed at you right now? You're crazy, you know that?\"</p>\n<p>Bruce nods. He looks down.</p>\n<p>\"I am aware of that,\" he says. \"If that is of any help.\"</p>\n<p>\"<em>Fuck</em> no, it isn't.\" Jason says, but he puts his head on Bruce's shoulder anyway. He closes his eyes. He looks so calm and young. Peaceful.</p>\n<p>Bruce is this close to breaking down.</p>\n<p><em>This</em> close.</p>\n<p>Instead, he brings a hand to the side of Jason face, and flattens down some of that unruly hair. Jason leans into the hand.</p>\n<p>\"Did it- did it hurt?\" Bruce asks. Is afraid to ask.</p>\n<p>Jason nods. His hair is soft and the longer bits are curling slightly, at the edges. \"Yeah,\" he says. His eyes still closed. \"Like nothing I'd ever felt before.\"</p>\n<p>Bruce remembers how Jason would steel himself when his arm broke, or his face got punched during patrol. He'd pretend it hadn't happened at all. Like a dislocated shoulder or a ligament tear was nothing.</p>\n<p>\"I'm so sorry,\" Bruce says again, into Jason's hair. <em>Sorry</em>. He feels so fucking useless. He got a fifteen year old boy killed. His own son. If there is a hell out there, then he deserves to be chained to its very gates.</p>\n<p>He can feel Jason exhale slowly, with frustration. \"Bruce, it's <em>not</em> your fault. If you say sorry again, I'll kick you out of my apartment,\" he says softly.</p>\n<p>Bruce nods. His voice sounds strange and wet even to his own ears, when he says, \"Did I- did I try to find you? When Talia took you?\"</p>\n<p>\"You thought I was still dead,\" Jason says dully. \"You didn't know.\"</p>\n<p>\"Oh,\" Bruce says. He closes his eyes. \"But, but if I <em>had</em> found you, back then, we could've-\"</p>\n<p>\"<em>Stop</em> it, Bruce,\" Jason says again, with none of the heat in his voice. \"I spent the entire first year that I came back thinking about all the possibilities, all the scenarios where it would've turned out better for me. For the both of us. It doesn't do anyone any good. Trust me.\"</p>\n<p>Bruce exhales shakily. The inside of his chest feels raw and cold. \"Come home for a while,\" he says. \"Please. Come back to the manor.\"</p>\n<p>Jason looks away. \"Nah,\" he says lightly. \"I'm good. Besides, you'll probably regret having me back there when you get your memory back. We don't really like each other, remember?\"</p>\n<p>\"I like you a lot, Jaybird.\" Bruce says. Honestly.</p>\n<p>Jason laughs a little wetly. \"Yeah. Well. The other guy really doesn't.\"</p>\n<p>\"The other guy,\" Bruce says firmly, \"can go suck it.\"</p>\n<p>Jason smiles at that. There's something so very sad in his eyes. \"Bet you twenty bucks you're gonna want me to move out the second you get your memory back.\"</p>\n<p>Bruce rubs at his eyes tiredly. \"I really messed up, Jay.\"</p>\n<p>\"Hey,\" Jason says, and there's a supportive hand on his back. \"If wasn't all you. I mean, just between you and me? I probably shouldn't have shot Timmy.\"</p>\n<p>\"What?\"</p>\n<p>\"Never mind,\" Jason says. \"That's a story for another day.\"</p>\n<p>Bruce shakes his head. \"What kind of hell did you go through?\" He says, and Jason takes a breath. Big and shuddering.</p>\n<p>\"I could tell you, if you wanted,\" he says quietly. \"I haven't told anyone before. Not everything, at least.\"</p>\n<p>Bruce holds his eyes. He thinks of a fifteen year old Jason, lying by himself in a dark warehouse, alone and trembling and scared and covered in his own blood. Waiting to die.</p>\n<p>Crawling out of his own grave a few years later, and wandering around looking for something to eat out of dumpsters. Getting beat up in the street. Being captured by the Al Ghuls. The horrible and intense pain of the Lazarus pit.</p>\n<p>Does he really want to know?</p>\n<p>\"Tell me,\" Bruce says.</p>\n<p align=\"center\"><br>\n*</p>\n<p><br>\nJason speaks for hours. His quiet voice a never changing monotone as he speaks of in explicit detail, the horrors that he's faced. His face is expressionless. Set in stone. Like the real Jason is somewhere far away from it all.</p>\n<p>At the end of it all, Bruce thinks he's going to be sick.</p>\n<p>\"Do I already know all of this? I mean, the other me?\" He asks finally, after he can speak again.</p>\n<p>Jason shakes his head. \"No. You know parts of it. Not everything.\"</p>\n<p>Bruce draws Jason into his arms. \"<em>God</em> Jay, I'm so, <em>so</em>-\"</p>\n<p>\"That's it, I'm kicking you out,\" Jason says, but his voice is muffled with Bruce's jacket, and Bruce thinks that he may be crying, too.</p>\n<p>He holds his son in his arms for a long time after that. The coffee has long grown cold.</p>\n<p>Jason is shaking a little. His hands are clutching at Bruce's back to the point of pain. Maybe the story he told Bruce is affecting him more than he thought.</p>\n<p>\"Hey,\" Bruce whispers. \"Hey, it's okay. Jason, listen to me, you're here, with me, okay? You're good.\"</p>\n<p>Jason shakes his head. \"It's <em>never</em> going to leave me,\" he sobs. \"The pit, and the Joker and I <em>can't</em>-\" he stops, choking. Bruce holds him closer, his hands firm on Jason's shaking back, trying helplessly to transfer some of his strength to him. Jason is shaking harder still. \"I have nightmares <em>every</em> night, Bruce. Every <em>fucking</em> night.\" He says.</p>\n<p>Bruce feels terrified. \"What do I do, Jay,\" he whispers. \"Tell me what to do to make it better.\" But Jason is only shaking his head, crying harder. \"I don't know,\" he sobs. \"I don't <em>know</em>.\"</p>\n<p>\"You're fine. Nothing's going to hurt you, baby. Listen to me, come on, Jason, <em>shhh</em>. You're okay. Come on, <em>shh</em>.\" He says more meaningless consolations, and eventually they start working, because Jason stops shaking so much.<br>\n\"Stop shushing me,\" he mumbles, sniffing.</p>\n<p>\"Okay,\" Bruce says, rubbing circles onto his back. \"Okay, I won't.\"</p>\n<p>They are quiet for a bit. Jason draws back a little, and Bruce lets him. Jason sniffs.</p>\n<p>\"I'm sorry for freaking out on you like that,\" Jason mumbles. He looks embarrassed, his eyes red and his cheeks splotchy with colour.</p>\n<p>\"Now who's saying sorry too much,\" Bruce says. He wonders if he ever tried to hunt down the Joker and kill him for what he did. The thought must have occurred to him.</p>\n<p>He doesn't kill people because he thinks it's the right thing, or the just thing to do.<br>\nHe doesn't kill people because it would be too easy to never stop.</p>\n<p>\"Jason,\" he says, \"you need to get help. I wish you'd told me earlier. Even before I lost my memory. I could have helped you.\"</p>\n<p>Jason snorts. \"Right. Because which therapist would believe me when I told them about the time I died?\"</p>\n<p>Before Bruce can answer, Jason jerks up, looking at Bruce. \"Shit. Is Dick still waiting outside?\"</p>\n<p>\"Oh,\" Bruce says. \"No, probably not. I think he went back home when he realized that no one was going to be killing anyone.\"</p>\n<p>But Jason is already on his feet again, pacing across the flat as he looks for his phone. Bruce watches him.</p>\n<p>Jason finds his phone under a book that's been stacked sideways on his shelf. He picks up his phone, dialling a number.</p>\n<p>\"Hey,\" he says, his voice low. \"Sorry you had to wait for- yeah. It's-- <em>no</em>, Dick. It was fine. Yeah. He's here now.\" There's a long pause as he listens to Dick's voice on the other end. He looks back at Bruce. \"<em>Stop looking at me,\"</em> Jason mouths to him.</p>\n<p>\"<em>Sorry</em>,\" Bruce says. But he doesn't stop. His son is alive and standing before him. He can't stop.</p>\n<p>\"Really?\" Jason is saying into the phone. \"Yes. Of course. Bring her too. She's good at getting stuff out of people. Yeah. Okay. You too. Bye.\" Jason hangs up. \"Dick says they're moving in on the Pastorelli headquarters tonight. He asked me to come. It's gonna be me, him and Steph.\"</p>\n<p>\"Okay. What about-\"</p>\n<p>\"No. Leslie was <em>not</em> kidding about the whole brain damage thing. You can't come.\" Jason says, with such firmness that Bruce has to fight not to smile. If he ever decides to have kids one day, he's going to make a great father.</p>\n<p>\"I'm on monitor duty then.\" Bruce says. \"That's not a request. I want to keep an eye on all of you at all times.\"</p>\n<p>Jason shrugs. \"As long as you're not out in the field.\" He goes back to the bookshelf to set his phone down again. He has heaps upon heaps of books. There's not enough space for them on the shelves. He recognises some of them. That first edition <em>The Autumn of the Patriarch,</em> for instance.</p>\n<p>\"Jay,\" Bruce says, \"did you <em>raid</em> the manor library?\"</p>\n<p>Jason looks at him defensively. \"It's not like anyone was reading those books, anyway.\"</p>\n<p>Bruce laughs. It feels good. \"I have a signed copy of <em>The Blind Assassin</em> in the bookshelf in my study upstairs. I'm going to give it to you.\"</p>\n<p>\"You already gave it to me three months back.\" Jason says. \"It was kind of a guilt present, I think. Because I got knocked over by some fear toxin and you were there to see it. I said some stuff that was pretty tough to hear for you.\"</p>\n<p>Bruce is not sure what to say to that.</p>\n<p>\"The book was good though.\" Jason says, and he smiles, and just for a moment he's a fourteen year old boy trying to convince Bruce to see another one those horrible sci-fi movies that he likes so much before they go to bed again. <em>Just one more, B. I need to know if the simians overthrow the humans again.</em></p>\n<p>\"I love you, Jason.\" Bruce says. He swallows. \"I know I didn't say it enough, even back when you were Robin, but- I <em>do</em> care for you. A lot.\"</p>\n<p>Jason nods jerkily. \"Yeah,\" he says, and he sits back down on the couch next to Bruce. \"Me too.\" He says. He leans back on the leather padding. \"Remember when you took Dick for his college tour, and I insisted on tagging along?\"</p>\n<p>Bruce nods. He remembers. \"You were a fourteen year old kid who wanted to go to Yale,\" he smiles. Jason had actually been more interested in going to college than Dick himself. He would run around all day, picking up pamphlets and look at college courses and drive the both him and Dick crazy.</p>\n<p>\"I was actually thinking of going back to school,\" Jason says, nonchalantly. \"I never got to finish. So.\"</p>\n<p>Bruce blinks. \"Jason, that's a great idea. If you wanted, I could speak to the dean of-\"</p>\n<p>\"Oh, no.\" Jason laughs. \"I'm going to go look for classes at a community college or something. Gotham university, maybe. Definitely not <em>Yale</em>.\"</p>\n<p>\"Why not?\" Jason had wanted to be a writer. Last that Bruce remembered, he had wanted to write westerns. Three months before that, it had been fantasy novels though, so Bruce had taken it with a grain of salt.</p>\n<p>Jason shrugs. \"I don't like leaving Gotham. Not for too long, anyway. Stay close to the ground, right?\"</p>\n<p>Jason died in Ethiopia, the report had said. Too far from home. Of course he didn't want to leave Gotham.</p>\n<p>\"Okay,\" Bruce says. \"That's fine.\"</p>\n<p>Jason just snorts again. \"I can hear your blood pressure rise, old man. You hate GCU. What did you use to call it? '<em>A piece of shit institution'. You</em> know, Tim wants to go to GCU as well? Business studies and management. He's gonna take over for you, one day. He wants to stay in Gotham, so he can keep being Red Robin, but you're making him go to Harvard. He's pretty mad about it.\"</p>\n<p>\"That's. . .harsh.\" Bruce says.</p>\n<p>Jason shrugs. \"I mean, I can see why. You don't want him to stay here any more and be a vigilante. Statistically, he's less likely to get killed during an economics class in Boston, than in a gang war in Gotham. You're trying to get him out of the family business, I think. He's just pissed off about it.\"</p>\n<p>Bruce stares into the long forgotten cup of coffee. He wonders if it's too late to heat it up. \"You should do it, Jay. Go to college. Get that English major.\"</p>\n<p>Jason regards him with a guarded gaze. \"You really think so?\"</p>\n<p>\"Yes.\" He says. He smiles. \"I still have that poem you wrote for me when you were twelve. I saw it in a drawer in my study yesterday. I had it framed and everything. Pablo Neruda stands no chance against '<em>Dear Bruce, you really suck</em>.'\"</p>\n<p>Jason laughs, disbelievingly, no doubt remembering the poem he'd written for Bruce when Bruce had grounded him for an entire week in the summer that he was twelve years old. \"You kept it? After all this time?\"</p>\n<p>\"Apparently. I can still recite it by heart, you know. It goes something like this: Dear Bruce, you really suck, your cowl makes you look like a stupid-\"</p>\n<p>\"Stop it,\" Jason says, laughing hard. \"You can't make fun of children. It's rude.\"</p>\n<p>\"Your friends Diana and Clark are way cooler than you, and I hope you get seriously sick from swine flu.\"</p>\n<p>\"<em>Bruce</em>!\" Jason says, his face pink from laughing hard or the embarrassment, he can't tell. \"I was <em>twelve</em>!\"</p>\n<p>And Bruce laughs with him, and thinks, that maybe, just maybe, he's on his way to being forgiven.</p>\n<p> </p>\n<p> </p>\n<p>\"Alright,\" Steph says, shifting around warily in the darkness. \"I'm in position. But just for the record, this <em>really</em> sucks.\"</p>\n<p>\"I'm in position too. I can see five guards outside. Three in the back. I can't tell how many of them are inside, though. Tim?\" Dick's voice comes through her comm.</p>\n<p>Tim and Bruce are sitting in the batcave, miles away from here, monitoring the situation through a satellite uplink. Steph looks at her surroundings warily. She wishes she could be doing the same.<br>\n\"Negative,\" Tim says. \"I'm approximating around five, but I'm not sure. Their rotating schedules are very irregular. I've been surveilling the spot for a couple days now, but I'm still not a hundred percent sure. There could be a few permanent guards in the compound.\"</p>\n<p>\"Great. Makes the job that much easier. <em>Thanks</em>, replacement.\" Jason's voice comes through the communicator, sarcasm dripping through every syllable. He's probably in the most danger of them all right now. He's hidden in a service elevator behind the entrance. Maybe only about three or four feet away from the guards outside. He never complains about stuff like that though. Jason's pretty cool that way.</p>\n<p>\"Jason,\" Bruce's voice says, crackling slightly with static. \"Be careful. I can see two of them coming towards you.\"</p>\n<p>\"Can I take 'em out?\" Jason asks, a trace of something eager in his voice.</p>\n<p>\"No,\" Bruce says firmly, and she can almost hear Jason sighing through the commlink. \"Wait for Steph to give the all clear.\"</p>\n<p>Steph takes the opportunity to complain about her position. \"It's not fair that you guys get all the action while I'm stuck in a ventilation shaft inside, keeping an eye on things. This place is gross.\" She's sure she saw something crawling in there next to her, just five minutes ago. She shudders. \"I've been here for hours.\"</p>\n<p>\"You've been in there twenty minutes.\" Dick says.</p>\n<p>\"Feels like hours. I'm claustrophobic, you know.\"</p>\n<p>\"No you're not.\" Tim says.</p>\n<p>\"<em>Fine</em>. I'm <em>not</em>. But this place is really small and really cold and I'm just stuck in here because I'm the <em>girl</em>!\"</p>\n<p>\"You're stuck in here cause you're the only one who could fit, shortcake.\" Jason says, chuckling.</p>\n<p>Steph glares at the small window grill in front of her. \"Don't you even <em>dare go</em>-\"</p>\n<p>\"Keep the comm lines clear.\" Bruce all but barks. Everyone quietens down, albeit reluctantly. Jason's still laughing a little, the absolute douchebag that he is.</p>\n<p>Steph seethes in silence. After another ten minutes or so of this, she gets a little tired of it and sighs. \" I give up. Anyone up for a game of twenty questions or something? I'm really bored.\"</p>\n<p>\"Is there no activity at all?\" Tim.</p>\n<p>Steph looks out of the grill again. The dingy room in front of her is completely empty, save some medical equipment and a few filing cabinets. And a shelf full of bottles and vials, like a chemistry lab. No people, though. \"Nope. Gotta say, this place really doesn't look like a drug lab to me. Looks more like a hospital. I saw a few stretchers in the other room, when I snuck in.\"</p>\n<p>\"I think they're testing out the drug on people. Checking potency and stuff.\" Dick says.</p>\n<p>Everyone is silent at that.</p>\n<p>\"<em>Anyway</em>,\" Steph continues brightly. \"Jason. Celebrity, Place, Monument or Event?\"</p>\n<p>\"Celebrity,\" Jason says, after a while.</p>\n<p>Three people groan in mutual distaste over the comm line.</p>\n<p>\"Jason, it better not be Jennifer Lopez again.\" Dick says. \"You <em>always</em> pick Jennifer Lopez. Every <em>single</em> stakeout. It's getting predictable.\"</p>\n<p>\"Yeah, she's hot!\"</p>\n<p>\"Keep the comm lines <em>clear</em>.\" Bruce says again.</p>\n<p>\"You know, <em>our</em> Bruce lets us play twenty questions all the time.\" Steph says.</p>\n<p>Tim snorts. \"No he doesn't.\"</p>\n<p>\"Yeah, but he didn't <em>know</em> that, pipsqueak.\"</p>\n<p>\"Well it's not-\"</p>\n<p>\"Wait,\" Steph says. \"I see something.\" She leans ever so slightly forward, towards the grill. A man has entered the room. No, not one man. A few of them. \"Dammnit,\" Steph whispers. \"There's way more than five men in here, Tim.\"</p>\n<p>\"What? How many?\"</p>\n<p>\"I can see eight. They don't look like guards, Tim. They're all in black suits. Very classy looking and everything.\"</p>\n<p>\"Is it Pastorelli?\"</p>\n<p>Steph looks at the men closely. \"Look like it. Him and some of his family. Cousins, I think.\"</p>\n<p>Another man walks in, slower than the other eight. His hands are handcuffed together, and he's limping pretty badly. He has a black eye. He keeps looking at the other men, his eyes shifting back and forth between them. He looks scared out of his mind. He swallows. Clears his throat. \"Mister Pastorelli, I swear, I didn't have anything to do with what happened, back there at the restaurant. I was just-\"</p>\n<p>One of the men amongst them steps forward. \"Clyde, shut up.\"</p>\n<p>Clyde blanches. \"Please, Mister Pastorelli, sir, I didn't mean no disrespect, I-\"</p>\n<p>\"Clyde,\" the man says. He looks visibly annoyed.</p>\n<p>Clyde is crying now. \"Please, sir, please don't do this. I got a wife, and I got four kids. I gotta family, sir, I don't-\"</p>\n<p>\"Clyde,\" Pastorelli says. \"I'll make sure they get your handsome severance package. Now shut the fuck up, and get on the stretcher.\" He says, pointing to the stretcher that's being wheeled in by a man in a lab coat.</p>\n<p>Clyde's eyes flick from the stretcher to Pastorelli, and then to the man in the lab coat. He jerks backwards, trying to make a run for it. Someone pushes him back, and he stumbles and falls. Pastorelli looks on in disgust. The man in the lab coat bends down and pushes Clyde's sleeve up. He slides a needle into the inside of his arm, and Clyde's head tips back and he goes stiff.</p>\n<p>\"Shit,\" Steph says. \"Something's about to go down.\"</p>\n<p>\"What's happening?\" Dick asks.</p>\n<p>\"Pastorelli's drugging one of his own guys. Change of plans. Dick, Jason, get over here. I need some back up. I'm going in.\"</p>\n<p>\"No one is going in. Your job is to observe and report, Spoiler. Stay where you are. It isn't safe.\" Bruce says.</p>\n<p>\"Screw that. They're going to wipe him, just like they did to you.\"</p>\n<p>\"<em>Stephanie</em>-\"</p>\n<p>She disconnects the comm link. She's probably going to get into a hell of a lot of trouble for this later.</p>\n<p>She slides the grill back, and drops downwards, tucking her feet in to land gracefully on the floor. Years of practicing cool superhero landings.</p>\n<p>\"Hello, boys.\" She says.</p>\n<p>Nine fully grown (and probably armed) mafia members stare back at her.</p>\n<p>She can take them. Definitely.</p>\n<p>Probably.</p>\n<p>She squares up her shoulders, and hopes to god that Jason and Dick are on their way.</p>\n<p>A man reaches into his suit jacket to remove his gun, when Steph knocks his hand away. The gun skitters to a distance a few feet away. Someone punches her in the back, making her grunt. She ducks and rolls away from them, towards the gun. She picks it up and throws it at the head of the man closest to her, and then sweeps his legs out from under him. One down. Eight to go.</p>\n<p>A man with a big tattoo on his face advances towards her, and she ducks under his arm, and twists it all the way back and until he cries out. She uses his momentum to push him down to the floor, -something Bruce had taught her; If she couldn't use her size, she could sure as hell use theirs- and shoves a hard knee into the small of his back. Face tattoo stays down.</p>\n<p>She's midway through man number five, when she realises that she can't see Lab Coat anymore. She raises her head momentarily to look for him, and suddenly there's a sharp pain in the back of her head. It's so bad that it momentarily blacks out her vision. She stumbles a little, a turns around to see what hit her.</p>\n<p>It's Pastorelli. He looks at her, amused. He's holding his handgun. He must have hit her with its butt. \"I would've let you go on for a bit, but you were really plowing through my men there. Good job, by the way.\" He sounds genuinely impressed. \"I've never seen anyone take Sal down that fast,\" he says, pointing to Face Tattoo, lying in the corner.</p>\n<p>\"Thanks.\" Steph says. \"Face tattoos are never a good idea.\"</p>\n<p>Pastorelli snorts. He steps over one of his unconcious men, edging closer towards her. Steph takes an uneasy step back. \"Try telling him that.\" He has a very slight accent when he speaks. \"My zia, his mother, she was furious with him for months for getting that thing.\" He laughs. \"I remember thinking how, what do you call it?. . . <em>clichéd</em> it was.\"</p>\n<p>Steph nods. \"Sure. You know what else is clichéd? The bad guy beating up the good guy. That's pretty predictable.\"</p>\n<p>He smiles. Takes another step towards her. \"I'm not the bad guy, sweetheart. I'm just trying to build an empire.\"</p>\n<p>Then he punches her in the face, and that's the end of that.</p>\n<p> </p>\n<p>When she wakes up, she's strapped to the same stretcher Clyde was going to be put on, and she can vaguely hear Pastorelli talking in the background. She cracks open an eye. He's talking to Lab Coat. She looks around discretely. The men she took down have been carted away, but the other guy, Clyde, is still there, lying on the floor. He looks unconcious. Three other guards at the door.</p>\n<p>She feels around her restraints. They're old school. Leather straps. No handcuffs. Nothing she can pick a lock out of. She tries to pull her hands out of them, but they won't come out. It's too tight.</p>\n<p>Pastorelli looks over at her. \"Oh, you're up. Good. Doctor Brown here is going to give you a nice little injection that's going to make you feel very calm.\" He says. She looks over at Lab Coat. The pieces finally fall into place in her brain. Elijah Brown. She frowns. He's so young. Much younger than they thought he'd be. He looks like he's barely out of grad school.</p>\n<p>He advances towards her, holding a small vial of clear liquid, and a syringe. \"Hold still,\" he says.</p>\n<p>She struggles harder, tugging at her restraints. She doesn't want to forget. Oh god, she won't remember <em>anything</em>. Tim, being Robin, Bruce, Cass, Damian. The manor. Alfred. \"No,\" she whispers. \"<em>No</em>.\"</p>\n<p>Behind Doctor Brown, Pastorelli is checking his watch impatiently. \"Can you hurry this one up, Eli? My daughter has a dance recital in an hour. You know she always throws such a bitchfit when I don't make it to those things.\"</p>\n<p>\"Sure thing, Tony.\" Doctor Brown says easily. He starts to prepare the syringe. Steph's really flailing around now. Maybe if she moves around too much he won't be able to inject her. Maybe she could get the stretcher to tip over if she just shifted her weight to the right side by-</p>\n<p>There's a loud gunshot on the other side of the door. Pastorelli looks up from his watch. He says something in Italian to the other guards. They leave the room, closing the door behind them.</p>\n<p>Pastorelli takes his handgun out. Looks at the doctor. Elijah Brown puts down the syringe. They both look towards the entrance.</p>\n<p>Thirty seconds later, the door is thrown open, and her two idiot brothers come crashing in, yelling threats and throwing batarangs. Steph grins. She really loves those douchebags right now.</p>\n<p>Pastorelli is quickly knocked out, and Dick rushes to her side, helping her out of her restraints. \"You okay?\"</p>\n<p>\"You're <em>late</em>.\" She says. \"I <em>said</em> I needed backup.\"</p>\n<p>\"You're welcome,\" Jason says, dryly. He's restraining Elijah Brown with some zip ties.\"It took us long enough to get past all the guards at the entrance. I don't know what Red Robin was on about. This place is like the fucking <em>Pentagon</em>.\"</p>\n<p>\"You can't just run into danger like that, Spoiler. That's reckless and stupid.\" Dick says, gravely.<br>\n\"And also it's my thing. You can't steal my thing.\" Jason says.</p>\n<p>For a second, Steph does feel kind of embarrassed. They did end up having to bail her out. And she basically ruined any chance of them gaining any intel about the drug. So she's pretty much ruined Bruce's life forever.</p>\n<p>\"Shit,\" she sighs. Then she looks up quick. \"Clyde!\" She yells.</p>\n<p>\"What?\" Dick asks, managing to look confused even through the blank lenses of his domino mask.</p>\n<p>\"The guy over there,\" Steph says, going towards Clyde. He still looks unconcious. \"They dosed him with some of it. They thought he was the guy that leaked out the location of that restaurant. Hey, uh, mister Clyde?\" She says, shaking at his shoulder. \"You awake?\"</p>\n<p>Clyde opens his eyes, and then he blinks up at her. He frowns.</p>\n<p>\"Mommy?\" He says.</p>\n<p>Steph frowns. \"What?\"</p>\n<p>\"Mommy?\" Clyde says again. His face looks kind of weird. A grown man's eyes shouldn't be so wide.</p>\n<p>\"Holy shit,\" Jason says from the back, even as realisation starts to dawn on her.</p>\n<p>Oh god.</p>\n<p>\"How old are you?\" Steph whispers to him.</p>\n<p>Clyde bites his lip. \"Mommy said I shouldn't talk to strangers.\"</p>\n<p>\"I'm not a stranger, honey. I'm going to get you to your mommy, okay? How old are you?\"</p>\n<p>\"Eight.\" Clyde says. \"Mommy said I could go play with Jake after I finished putting away my toys, and I totally did. Can I go now?\"</p>\n<p>\"Wait, what?\" Dick says. \"How is that even-\"</p>\n<p>\"They used too much,\" Steph says, looking at the fully grown man in front of her in horror. \"They gave him way too much.\"</p>\n<p>\"But how is it possible? I can barely remember anything from when I was eight. If I forgot everything after that, I'd just be a blank slate,\" Dick says.</p>\n<p>\"That's not actually true,\" a voice says from behind them. \"The human memory works in interesting ways.\" All of them then. Doctor Elijah Brown is looking at them with interest, bound hands clasped together on his lap. \"You'd be surprised at how much actual, long term memory is locked away in your subconscious.\"</p>\n<p>Jason is on him instantly, shoving his chair back. The red of his helmet glints meanly under the surgical lights of the small room. Steph can understand why Dick recruited Jason for the operation. He has an effect on people. An effect that makes them want to shit their pants. He and Bruce are alike in that way.<br>\n\"You,\" Jason says. \"You're going to give us the cure. You're in for a world of pain from Batman once he's back on his own two feet.\"</p>\n<p>The doctor actually looks surprised. \"<em>Batman</em>? He's still alive?\"</p>\n<p>\"Of course he's still alive, you piece of shit. No thanks to you. Why wouldn't he be?\"</p>\n<p>\"Hmm,\" The doctor says. \"That's interesting.\"</p>\n<p>Steph pushes off the floor, away from Clyde. \"Why is that interesting?\"</p>\n<p>He shrugs his shoulders. \"The drug usually kills everyone in a couple of days. I administered it to him. . . three days ago, yes? He should be dead by now.\"</p>\n<p>Dick, who'd been standing next to her, looks noticeably shaken up. \"That's not true. You're lying.\"</p>\n<p>Doctor Brown shrugs again. \"Fine. See for yourself, then, when he keels over and passes out. It must be his size. Never gave it to anyone that big before.\"</p>\n<p>Jason shakes him by the shoulders. \"The cure.Tell us what it is.\"</p>\n<p>The doctor just laughs. \"I told you. Human memory is works in interesting ways. The brain is a delicate thing. You can't magically un-wipe someone's memory.\"</p>\n<p>Dick looks at him. \"What are you saying?\"</p>\n<p>The doctor gives him a cursory glance. \"I'm saying there <em>is</em> no cure.\"</p>\n<p>Jason starts shaking his head. \"That's not possible. There's gotta be one. You must have it in one of these rooms. Just tell us which one.\"</p>\n<p>\"Red Hood.\" Steph says.</p>\n<p>\"No,\" Jason says. He's shaking his head still. \"No. There's a cure. He's lying to us. Can't you see? It's probably in one of those filing cabinet things we saw on the way-\"</p>\n<p>\"Red Hood.\" Steph says again. She looks at Clyde, lying on the floor across the room from her, wiping at his eyes and asking for his mother. He had a wife. Kids. A whole family he'll never remember. A whole life.<br>\nBy comparison, their situation doesn't seem so bad. They could adjust. They could learn to adjust, right?</p>\n<p>\"I don't think he's lying, Hood.\" Steph whispers. \"I'm sorry.\"</p>\n<p>Jason kicks at the stretcher. It wobbles away from him. \"Fuck,\" he whispers. He bends down, putting his hands on his knees. Steph looks at Dick. He's talking to someone on the other end of the commlink. Reporting back to them, a worried expression on his face. The doctor watches the three of them. His face expressionless. He's so young, Steph thinks again.</p>\n<p>Just a student. Probably doesn't even have a doctorate yet. She has no idea why everyone calls him doctor.</p>\n<p>Something occurs to her. She looks back at the man. Elijah Brown. \"You figured out the formula for this thing, right?\" She says to him. He doesn't reply, still watching them, but that's okay. She's just thinking out loud now.</p>\n<p>\"You're what? Twenty four? Twenty five? Let me guess. You started formulating this thing when you were in college. A quiet little chemistry major, kept to yourself a lot, probably worked the hardest. No one ever knew what you were making.\"</p>\n<p>Jason stops bracing himself on his knees, and looks up at her. His blank lenses on her face.</p>\n<p>Steph continues. \"And you finally got done with it. You figured it out. Now all that was left was to test it, right? So you go to your buddies at the FDA or wherever the hell it is you go to test out these things, saying something about it being the key to curing PTSD, or whatever you were trying to scam them into believing. Hell, maybe you even believed it, back then.\"</p>\n<p>The doctor is silent.</p>\n<p>\"Except, your plan didn't work out, huh? Those stuck up dicks at the hospitals and research centres don't let you test this out on humans. Too risky, they say. Severe consequences, they say. Inhumane. So you make a deal with some trigger happy Italian guys. They provide you with a seemingly inexhaustible supply of test subjects, and you take care of them for the gang. Win-win.\" She says. \"Except there was a time before that, right? Before you reached out to the gang? When they didn't let you test it on anyone, but you <em>had</em> to try. You <em>had</em> to do it to further your research. I bet, doctor Brown, I bet that you tested it out on yourself.\"</p>\n<p>His face stiffens minutely, and Steph knows that she's got it right. She looks at Jason. Jason nods.</p>\n<p>Jason pushes the doctor down onto a chair. \"Here's how it's going to go, bud.\" He says. \"Answer all her questions, and we won't tell the police commissioner about the one time you tried to take down the Batman. They're pretty chummy, you know. A move like that could get you, what, ten to twelve years in jail?\"</p>\n<p>\"Sure could,\" Dick says.</p>\n<p>Steph looks at the doctor. He looks visibly more nervous now. \"You're all the proof I need that a cure exists,\" she says. \"Now you're going to tell us where it is.\"</p>\n<p>The doctor's eyes flick to Jason, and then back to Steph. \"It doesn't work like that.\" He says, finally. Quietly. \"There's an injection that you give yourself twenty four hours within the first dosage. Just a neutralising agent. Stops you from dying of complete organ failure. Which the Batman should have had forty eight hours ago. The memory you gain back eventually. The lesser the dosage, the faster you get it back.\" He falls silent.</p>\n<p>Jason prods at his back, hard. \"Go on.\"</p>\n<p>\"When- when I was younger, I would test out maybe a few milligrammes at a time. I'd forget maybe an hour or two. Sometimes maybe half a day. Never more than that. So even if I never got it back, it'd be okay. I would write down about my day before I injected myself. Read it after I gave myself the dose. So it was never anything too much. I'd usually remember things a few hours later.\" He shakes his head. \"But that won't work for the Batman. He forgot years. I made sure of it. He won't be remembering it anytime soon.\"</p>\n<p>\"Liar,\" Jason says.</p>\n<p>The doctor shrugs. \"Believe what you want. But there really is no cure. I wasn't lying about that. Just something that stops the sickness after the dose. A kind of neutralising agent, if you will. That's what I call it.\"</p>\n<p>\"Where is it?\" Steph says.</p>\n<p>The doctor says nothing. Jason bends down low, level to his ear. \"I promised someone I wouldn't kill anymore, but no one's here to stop me from breaking both your legs. God knows you deserve it.\"</p>\n<p>The doctor remains silent, but his eyes flick slightly to the left. Towards a service closet in one corner of the room.</p>\n<p>\"Bingo,\" Steph says. She walks towards it and opens it, and woah, that's not a service closet. It's a whole room.</p>\n<p>\"Uh, guys? Whatever this cure thing is, I think I found a lot of it.\" She says.</p>\n<p>There are shelves upon shelves stacked with vials full of some sort of clear, viscous looking liquid. She takes a closer look. They all have labels. Different serial numbers. \"They're all different,\" she calls out, from the room. \"Which one do I pick?\"</p>\n<p>Dick has been speaking into his communicator the whole time, his voice low as he talks to the person on the other end. \"He's asking if the vials are numbered.\" 'he' must mean Bruce.</p>\n<p>\"Yeah. They have some kind of three digit serial number.\"</p>\n<p>\"Anyone of 'em say 128? Neutralising agent 128?\"</p>\n<p>Steph looks around at the glass vials. \"Yeah. A whole bunch.\"</p>\n<p>\"Grab as many as you can. Let's get out of here.\" Dick says. He switches off his comm and then looks around. \"I don't like it here. Feels too risky staying for much longer.\"</p>\n<p>\"Great.\" Steph says. \"I was hoping you'd say that. Red Hood, grab some of these with me. This place is giving me the heebie jeebies.\"</p>\n<p>They take as many of the no. 128 vials as they can, and they start to make their way to the entrance, when Steph suddenly stops. \"Wait,\" she says.</p>\n<p>Dick and Jason pause.</p>\n<p>\"What about Clyde?\" She says, looking over at him. He's sitting up now, a small improvement, but she's pretty sure he's trying to play patty cake with the floor.</p>\n<p>\"His brain's pretty much fried, Spoiler. There's nothing we can do.\" Dick says. \"We'll call Jim. Ask him to get to the scene of the crime. Anyway, he's been trying to get something on the Pastorelli's for the last couple of months. It'll be like an early Christmas for him. He can take care of the guy.\"</p>\n<p>They all tense up as they hear gunshots from what seems like far away. \"Trouble,\" Jason says. \"We should go.\"</p>\n<p>\"Alright, just give me a sec, okay?\" Steph says, and then races back to Clyde.</p>\n<p>\"Hey, uh, mister?\" She says. \"I just wanted to say, I'm really sorry. That thing at the restaurant was really our fault. Not yours. Someone's gonna take care of your family, okay?\"</p>\n<p>Clyde looks at her, his face blank. \"Mommy?\" He says.</p>\n<p>Steph sighs. She feels pure, unadulterated rage at Tony Pastorelli and Elijah Brown. \"Mommy's going to be here soon, okay? I- I really have to go, I'm so sorry.\" She says, and she gets up again, clutching at her vials.</p>\n<p>Clyde stares after her as she goes, his eyes listless and unseeing.</p>\n<p><br>\nWhen they're out of the compound and on the way back home in the batmobile, Dick puts an arm around her. \"That was really horrible and sad, but it's not what's going to happen to Bruce, okay? He's going to get better. I swear.\"</p>\n<p>Steph sniffs and nods.</p>\n<p>Now all there is to do is to hope and wait.</p>\n<p> </p>\n<p> </p>\n<p>Damian is not happy.</p>\n<p>His father is acting wholly unlike himself. It <em>is</em> still his father, he knows because he ran a DNA test from one of the mugs he was drinking coffee out of. He ran the test in the batcave late one night, when no one else was there. Because for some reason, it felt like a betrayal. Everyone is so <em>glad</em>. Elated. Ecstatic that the <em>old</em> Bruce has finally returned, whatever <em>that</em> means.</p>\n<p>Damian is not ecstatic. To say the least.</p>\n<p>This man is <em>not</em> his father. His father does not drink two cups of coffee in the morning instead of one. His father does not give them all a day off on sparring and endurance training for no reason at all. He even ties his tie differently. He does his pushups in the evening, before patrol starts, rather than in the morning. He eats three slices of bread instead of Father's usual two slices and a protein bar for breakfast. He parts his hair differently. He shaves every day instead of thrice a week. One day, he sees him wearing a T-shirt that says '<em>Ramones</em>' on it, in bold font.</p>\n<p>\"Found this in the back of the wardrobe.\" Father said to Pennyworth, looking at it fondly.<br>\nDamian googles the <em>Ramones</em>, and then scrunches his nose in distaste. Punk rock. His father does <em>not</em> listen to punk rock.</p>\n<p>He's different around Damian. Less. . . paternal. More laid-back. He sends Damian off to school without the usual body pat-down, checking for weapons in his pockets. He doesn't ask for additional details when Damian tells him he's going to Metropolis for the night, to patrol with Jon. He doesn't call when he's back home later than he's supposed to be. He doesn't place a warm hand on Damian's shoulder like he usually does when Damian manages to tackle Grayson onto the mat during sparring. Instead he looks up from the computer, and says, \"Good job, both of you,\" sort of absently.<br>\nHe doesn't yell or lecture Damian when he and Tim get into another fight, when he pushes Tim hard enough to bruise. He doesn't sit him down and explain to Damian that they're both his sons, and therefore they're both brothers, like he usually always does. The lectures that Damian rolls his eyes through. The ones that he's so sorely missing right now. It's like Father just doesn't <em>care</em>.<br>\nIt terrifies him.<br>\n<br>\nThis other man sometimes does his paperwork during mealtimes. Father <em>never</em> does that. He spends his mealtimes in the grand dining hall with Damian, asking him how his day at school was. Asking him what his plans for the teen titans are. Asking how Jon's training is working out. Never alone in his study, working on something on his laptop and absentmindedly eating a sandwich. He <em>never</em> misses a meal with Damian, unless there's a crisis or he's off world. Drake and Father spend hours together in WE conference rooms, or Father's office, drawing up plans and spitballing new ideas for the company. It is their- their <em>thing</em>. Grayson and Father spar together. Brown and Father pretend to do not like each other, spending all their time shooting retorts and insults they do not really mean. Cain and Father patrol. Todd and Bruce do not really have a thing, except to fight and yell and later apologize, but Damian has noticed that lately Todd has been sneaking to the manor library and taking books up to Father's study. So maybe that is their new thing.</p>\n<p>Mealtimes. That is Father and Damian's <em>thing</em>. Father prompting details about Damian's day from him, and Damian grudgingly answering or rudely ignoring him when he has been grounded or benched.</p>\n<p>He loves it more than Father thinks he does.</p>\n<p>The first day that Father does not show up, Damian goes through the house in a near panic, looking for him. Perhaps he's been injured. That complete organ failure that Brown and Grayson had been talking about. Maybe he's collapsed in the bathroom, blood leaking out his mouth and ears and pooling around his face. Maybe he never made it out of bed at all. Maybe he's just lying there in the sheets, his body cold and dead.</p>\n<p>He runs past the third floor landing and towards his father's bedroom, when he hears a tapping noise in the study. A sound like typing. He stops. Turns around. Opens the door.</p>\n<p>Father looks up at him, his half-eaten sandwich in hand and laptop open before him. A few opened files strewed around on his desk. \"Oh, hey Damian,\" he says, and Damian just stares.</p>\n<p><br>\nSo he tests his DNA. He runs the tests in the silence of the empty cave, his face washed in the blue glow of the monitors. He knows this is irrational. That the only reason his father is acting different is because he's simply forgotten the last few years. That this must have been the person he was, all those years back.<br>\nBut he cannot connect the man he was to the man he know now. Father. This other man. They couldn't be more different. Damian is at his wit's end.</p>\n<p>The DNA tests come back with no satisfactory results. His father has not been replaced or cloned. So he sits there in the empty dining hall everyday, glaring at the table, his hands clenched into knotted fists.</p>\n<p>Something is going to happen. He knows it, he can feel it itching in the back of his head. This is not permanent. These days of strange peace, of a calm before the storm where everyone but him seems to be content cannot stay this way forever. Something to build up and up and up and finally <em>snap</em>. And then things will be much worse.</p>\n<p><br>\nHe's right. It happens two days after Grayson, Todd and Brown return from the compound. It is breakfast time, and Damian is sitting at the kitchen island, eating his eggs. Pennyworth stands by him, pouring him some more orange juice. Father is pouring himself some more coffee, (two cups now, instead of one) when he drops the mug.</p>\n<p>The mug falls and smashes against the floor, spilling bits of glass and coffee everywhere.</p>\n<p>Damian looks up. Father is staring at his hand in surprise. Pennyworth puts the pitcher down.</p>\n<p>\"I'll clean up,\" Father says, getting up to pick up the pieces of broken glass. And then something very strange happens.</p>\n<p>Father gets up, pushing the chair back as he stands, and then stumbles on his feet. His arm shoots out to grip the table, to right himself again, but they all see it. His leg. It gives out for a second. He looks at them, and for the tenth of a second, it's the face of a scared man. Then the expression his face is arranged deftly into something calm and rational again.</p>\n<p>\"Alfred,\" he says. \"I think it's time.\"</p>\n<p> </p>\n<p>The reason they don't give him the neutraliser the moment they get their hands on it, is because there is simply no reason too. It's not a cure. That much they are certain of. It only stops the sickness that comes with being injected with the drug, and Father seems to have avoided that altogether. Moreover, they have absolutely no idea what the components of the liquid are.</p>\n<p>\"No unnecessary risks,\" Drake had said, studying the compound through a microscope. He and Grayson and Damian were sitting in the cave's lab, and going through vial after vial of every neutraliser they had. \"I don't want to give this to Bruce before we know for certain what it is.\"</p>\n<p>\"Well?\" Grayson had said, pacing the room.</p>\n<p>\"I can't tell. This compound . . . it's like nothing I've ever seen. I'll send a sample to Leslie, but I don't know if she'll be any better at identifying this thing. These structures, they don't belong on any database in the planet.\"</p>\n<p>\"How is that possible? You've made a mistake, as usual. Check again.\" Damian had said.</p>\n<p>Drake had lifted his head up from microscope, and given him a disdainful look. \"Yes, because I'm making the same mistake for every single on of these samples. I've looked at like fifty of them, Damian.\"</p>\n<p>\"But-\"</p>\n<p>\"Tim's right,\" Grayson had said, stopping his pacing. \"We don't know what's in that thing. And nothing's happened to Bruce yet, so. I vote that we wait.\"</p>\n<p>\"You wouldn't wait to give someone a vaccine if they hadn't had the disease yet.\" Damian had seethed.</p>\n<p>\"Dami-\"</p>\n<p>\"<em>None</em> of you <em>want</em> him to get better. You all just want to keep him <em>this</em> way, because- because he aligns with the version of himself that <em>you</em> like the most. Not the one that he really is.\" Damian had not known when it had happened, but sometime during this exchange he had started screaming. \"You just want him to be the way he <em>used</em> to be. So you won't give him the medicine he needs.\"</p>\n<p>\"Damian,\" Dick had started again, something akin to sympathy on his face. No. Not sympathy. <em>Pity</em>. \"I know you miss your dad, but please understand-\"</p>\n<p>\"I don't miss <em>anyone</em>!\" He had shouted, and then run up the stairs, back up towards the opening of the door, through the grandfather clock-</p>\n<p>-only to run face first into Father's stomach. Hard.</p>\n<p>\"Oof,\" Father said, or a sound very much like it. He stepped back, and looked at Damian. \"Are you okay?\"</p>\n<p>Damian glared at Father. \"Tt. I'm fine.\"</p>\n<p>Bruce had smiled and said something like \"Good kid,\" and ruffled his hair. Actually <em>ruffled</em> his <em>hair</em>.</p>\n<p><br>\nHe is not a <em>kid</em>. He is a man. His father <em>knows</em> this. His father treats him as such. His father gives him responsibilities and challenges. His father chastises him for going back on his promises. His father holds him accountable for when he makes a mistake.<br>\n<br>\nHis father does <em>not</em> ruffle his hair and call him a child.</p>\n<p><br>\nAnd now he's been proven right. He does not speak to Grayson or the others while Father is put up in his room, while he is administered, at last, the neutraliser that Damian had been telling them he'd need eventually. He does not speak to them as Father gets progressively worse. He stays in his room while the others discuss their options. He catches whispers of their conversations around mealtimes and during patrol.</p>\n<p>\"The fever's overtaking his system,\" Tim says into his phone quietly one day, to god knows whom. \"He's starting to lose motor functions.\"</p>\n<p>\"I don't know if we should have given it to him at all,\" Dick says worriedly to Alfred, \"maybe it just did more harm then good. He's out of it half the time.\"</p>\n<p>The next day, Damian goes to his father's room, and cracks open the door. The room is dark and quiet. It smells like antibiotics and sweat and sickness.</p>\n<p>\"Father?\" He whispers.</p>\n<p>There is no reply. He enters slowly, shutting the door behind him. As he walks up towards the bed, his eyes begin to slowly adjust to the darkness. He can see Father lying in bed, wrapped in sheets. He's asleep. Or unconcious. He can't tell. His breathing sounds weak, like the air is rattling around in his lungs.</p>\n<p>Asleep, like this, Damian can almost pretend he's <em>his</em> Bruce. Not the one that the others like so much. His father.<br>\nHe sits down on the bed next to him, just like he did a week back, when Father told him all those stories about his mother, and of Grayson when he was younger. That part was not so bad. He remembers falling asleep in this bed, relaxing into the warm centre of Father's voice. Strong arms around him, carrying him back to bed. A part of him wishing they wouldn't, so he could stay here, with Father.</p>\n<p>\"Father?\" He whispers again, shaking his shoulder.</p>\n<p>Two gray eyes flick open softly. A hand snakes through the sheets and reaches for him. \"Damian,\" the voice rasps. The hand comes up to his face. Holds the side of his head. Damian shuts his eyes.</p>\n<p>\"Are you alright?\" He finally asks, when he can speak again.</p>\n<p>\"Getting there,\" Father says, in that same raspy voice. \"Leslie just left. She said that the worst has passed.\"</p>\n<p>\"Good.\" Damian says. His voice sounds weak and trembling and he <em>hates</em> it. \"I'm glad.\"</p>\n<p>Father nods and closes his eyes. He's silent for so long that Damian thinks he's asleep. He's about to leave the room when Father says something.</p>\n<p>\"I remembered something. A memory.\" He says. His eyes are still closed.</p>\n<p>Damian sits up fast. \"Really?\"</p>\n<p>\"Yes. It was you and Tim fighting. I think things got physical. I was holding you by the collar and yelling at the both of you. You were yelling back. Not really a good memory.\"</p>\n<p>But Damian feels overjoyed. He's remembering again. His Father is going to <em>come back</em>. <br>\n\"Tt,\" he says. \"Drake was the one being unreasonable.\"</p>\n<p>Father laughs softly. It turns into a cough.</p>\n<p>\"What?\" Damian says.</p>\n<p>Father shakes his head. \"When I was your age, all I wanted was a brother. Well. That, and for my parents to not be dead.\"</p>\n<p>\"I hate all my brothers,\" Damian informs him.</p>\n<p>\"You don't hate Dick.\"</p>\n<p>\"Grayson is. . . tolerable.\" Damian says.</p>\n<p>Father raises an eyebrow. Even in his weakened state, it has the same effect.</p>\n<p>\"<em>Fine</em>. Grayson is a good brother. But Drake is weak and stupid and inept. And he's still somehow your favourite.\"</p>\n<p>\"What makes you think that?\"</p>\n<p>Damian thinks of the hours they spend together in Father's office, or how they always consult each other while solving cases and doing detective work. \"It's obvious.\"</p>\n<p>\"You know what's funny?\" Father says. \"Tim thinks you're the favourite.\"</p>\n<p>\"That's- that's <em>ludicrous</em>.\" Damian says. He is far from Father's favourite. All he <em>does</em> is yell at him.</p>\n<p>\"Maybe. But it makes you think.\" Father says. He closes his eyes again. \"I think the whole thing is ridiculous. Obviously, Cassandra seems to be my favourite.\"</p>\n<p>\"<em>Father</em>!\" Damian says, and Father laughs weakly again. \"I'm kidding.\" He says. He pats Damian's hand. \"Go to bed. It's late.\"</p>\n<p>\"Alright,\" Damian says. And then a sudden thought seizes him. \"Father,\" he says, \"do you think you will remember everything again, once this sickness is gone?\"</p>\n<p>Father's expression changes into something more sympathetic. \"This must be tough on you,\" he says. \"I don't know, Damian. Maybe.\"</p>\n<p>Damian straightens up. He smiles. \"Good. Then I wish you a speedy recovery.\" And then Father will spar with him and make him do his homework before he goes to Patrol and scold him for getting hurt while he sneaked out and things will be the <em>way they were.</em></p>\n<p>Father's face is doing that same thing again, where it looks like he's trying to cushion the fall. \"Damian, it's not a guarantee that I'll have-\"</p>\n<p>\"Speedy recovery, Father! Take your medicines.\" Damian calls out, already out of the door. He smiles to himself again.</p>\n<p>This is good. This is <em>progress</em>.</p>\n<p>His father <em>will</em> come back to him.</p>\n<p> </p>\n<p>The days pass in strange intervals of wakefulness and sleep for Bruce.</p>\n<p>In the beginning, he's unconcious for more time than he is not; every time he opens his eyes, the light coming through the curtains is different, or there's a different person sitting next to him, or the food tray has been replaced.</p>\n<p><em>Blink</em>. Dick is wearing a different t-shirt. <em>Blink</em>. It's suddenly bright, early morning. <em>Blink</em>. It's dark again. <em>Blink</em>. It's a new day.</p>\n<p>He starts managing to stay up for longer eventually, and starts doing some thinking. How is it that the others all died, but he didn't? How is it that the sickness struck him so late? How is it that he's starting to have snatches of memory reveal themselves to him, as slippery as mist forming a fine layer over him?<br>\nYesterday he could remember with startling clarity a quarterly meeting he had attended two years ago, bring Tim with him for the first time. He could practically smell the office coffee and the perfume of one of the consultants. The way Tim had looked so nervous, sitting there stiff and quiet in his new suit. The clicking of the pens of the associates as they took down notes. Lucius tapping his fingers impatiently. The crisp air of the conference room A/C.</p>\n<p>Immunity. Immunity is the answer. He figures it out over these days of half-awareness and sleep. He must have been immune. To what? The drug? If so, how? Perhaps he has come in contact with it before. Or something like it.</p>\n<p>\"Jason,\" he says, the first time he opens his eyes for good, the first time he's actually lucid enough to say more than three sentences without drifting off to sleep. \"Does the drug have Kryptonian provenance?\"</p>\n<p>Jason, who's been sitting by his bedside, reading a book, for almost two hours now, jumps and drops the book.</p>\n<p>\"Holy shit,\" he says. \"You're awake.\"</p>\n<p>\"Obviously. Drug. Kryptonian provenance?\"</p>\n<p>\"Uhh, I don't really know. Tim did some tests and stuff on it, but we can't really track its origins. Same for the antidote thing that we gave you.\" Jason, says, fumbling around in his pockets for something. \"We actually sent a sample to Green lantern, so he could test it out with his ring, and- hang on, I've got the results on my phone, Tim texted them to me.\" He reads out from his phone, \"Origins unknown, possibly stolen alien tech. Further chemical analysis underway.\"</p>\n<p>He looks up at Bruce. \"Huh. Are you thinking what I'm thinking?\"</p>\n<p>\"I've been thinking it for a while now.\" Bruce says.</p>\n<p>So they go down to the batcave, Bruce walking slowly down the steps to the lab. Jason does most of the work, setting up the Petri dish, the sliver of Kryptonite, and a small amount of the memory erasing drug.</p>\n<p>\"You might want to put some gloves on,\" Bruce tells him.</p>\n<p>Jason looks at the Kryptonite, and at the drug in the Petri dish, which is starting to sizzle slightly. \"Yeah,\" he says, a wary expression on his face. \"That's probably a good idea.\"</p>\n<p>So Jason puts on gloves and they both watch as he puts the sliver of Kryptonite inside the Petri dish, and the consequent small explosion that follows. A few seconds after, Jason peers into the Petri dish. Almost all the drug is gone. Sizzled away, or been broken down into something simpler. Something harmless.</p>\n<p>\"Would you look at that,\" Jason says. \"It's like Clark, but in a bottle.\"</p>\n<p>\"<em>Jay</em>.\"</p>\n<p>Jason snorts. \"I wonder how that doctor got his filthy little hands on Kryptonian chemicals. You think people have just been going to the fortress of solitude and scraping at the ship walls or something, while Clark was working overtime at the Planet? That's actually pretty funny.\"</p>\n<p>Bruce frowns. \"We should try this with some of my blood. Call Alfred.\"</p>\n<p align=\"center\">*</p>\n<p>\"So you acquired immunity because you were in close contact with Kryptonite all this time?\" Tim asks, flipping through the channels, his unnaturally cold feet on Bruce's, under the comforter.</p>\n<p>\"I have been, for the last twelve years.\" Ever since Clark gave him that small lead lined box and said that he trusted him to do the required thing, if it ever came to it. They must have both been, what? Twenty seven? Twenty five? He couldn't even really have been called a vigilante back then. Just a man who went out every night to fight dangerous men and tried not to look like he was scared out of his mind. \"We have over a kilogramme of it in the safe, down at the cave. Almost all types.\"</p>\n<p>\"This was such a freak stroke of luck, B.\" Dick mumbles into the pillow. \"Tim, go back, they're playing Notting Hill.\"</p>\n<p>Cass nods. \"I like Notting Hill.\" She's sitting right in front of him, blocking his view of the television.</p>\n<p>Not that he wants to watch Notting Hill.</p>\n<p>Bruce sighs. \"We have a home theatre. Get off my bed, all of you.\"</p>\n<p>\"Nope,\" Steph says cheerfully. \"This is an impromptu slumber party to celebrate your freak stroke of luck. Also, you should probably call Clark and tell him that people have been stealing parts of his ship and injecting them into other people.\"</p>\n<p>After Alfred had come down to the cave and found out that Bruce was out of bed and conducting medical tests on himself, using Kryptonite, he was . . . suitably disgruntled. After the blood test and consequent explosive experiment, (although this time it was much milder; his blood had barely any of the drug in it anymore), Bruce had been told rather firmly to go back up to bed.</p>\n<p>\"Just because <em>you've</em> been grounded to your room doesn't mean <em>we</em> have to be,\" Jason says. He's not on the bed, opting instead to sit on the chair next to the bed, his book back in his hands. He's watching Notting Hill too, though.</p>\n<p>\"Tim, please get your feet off mine. They're freezing.\"</p>\n<p>Tim's feet press closer to his. He looks over at Tim and sees that he's smiling slightly. \"Did you know, sea lions huddle together for warmth in the winter?\"</p>\n<p>\"It's not winter, and we are not sea lions. Turn up the thermostat.\" Bruce says. But Tim just presses his feet closer. Bruce sighs.</p>\n<p>\"Hey, where's Damian?\" Steph asks, a few minutes into the movie.</p>\n<p>\"Oh,\" Dick sighs. \"About that. We kind of . . . had a fight? I guess you could call it that. Tim was there.\"</p>\n<p>\"He got mad at us for not injecting Bruce with alien drugs without checking first.\" Tim says. He sounds a little bitter about it.</p>\n<p>Bruce frowns. He has a vague memory of Damian sitting next to him and telling him to get better, but it was when he was sick, so it's foggy and unclear.</p>\n<p>\"He's just a kid,\" Dick says. \"And he misses his dad. He says a lot of stuff he doesn't mean. Don't take it too hard, Tim.\"</p>\n<p>Tim shrugs. \"Whatever.\" He says. \"He's always got a problem with me anyway.\"</p>\n<p>They watch some more of the movie, and the kids laugh and joke about characters and dialogues, but Bruce can't get what Dick said out of his head. <em>He misses his dad.</em></p>\n<p>Bruce is starting to remember things now. He could maybe get his memory back in a week. A month. A year. Maybe never. It's unclear. What will Damian do until then? Stay locked up in his room and glare daggers at the walls?</p>\n<p>He gets up slowly, gently extricating himself from the pile of children on his bed. Everyone shifts around to settle in more comfortably. He sees Tim very deliberately flicking Dick's ear as he tries to get on the warm spot that Bruce was occupying before him. Sea lion huddle, indeed.</p>\n<p>\"I'm going down to Damian's room.\" He says. \"Just for a minute, okay? If Alfred comes in here, cover for me.\"</p>\n<p>They shrug or nod in varying degrees, still watching the movie. \"Want me to come with you?\" Dick asks.</p>\n<p>\"No, but thanks. I'll be fine.\" He says. He pauses, and then puts a hand on Dick's shoulder before he leaves the room.</p>\n<p><br>\nDamian's room is closest to his, just a few dozen steps down the hall from his. He remembers when this used to be Dick's old room, and he would run or jump or cartwheel down the hallway to Bruce's room. Once he even somersaulted off a chandelier, much to Bruce's and Alfred's shared horror. Something twinges in his chest at that. Sometimes he really misses the old days.</p>\n<p>He knocks at the door quietly. \"Damian? May I come in?\" He asks.</p>\n<p>The door is opened quickly. Damian stares up at him with wide eyes. \"Father? You're well again?\"</p>\n<p>\"Yes. Well, more or less.\" Bruce frowns. \"Did no one tell you yet?\"</p>\n<p>\"I'm not talking to any of them.\" Damian says, almost offhandedly, his eyes bright with excitement. \"But that doesn't matter anymore, because you <em>remember</em> again! Father, can we please go spar at the dojo in the penthouse again? Like we did last summer? I learned a new kick that I wish to receive your criticisms on. And I shall make you another pencil sketch of whatever you wish for. Oh, and last week I told my violin teacher that his lessons will no longer be required, as I have already mastered the art. I have so much more to share.\" He says, and if Damian was an ordinary child, Bruce would say that it sounded like he was babbling.</p>\n<p>\"Damian,\" he says slowly, \"I haven't remembered anything.\"</p>\n<p>Damian blinks. Frowns. \"What?\"</p>\n<p>\"I haven't remembered anything. Who told you I did?\"</p>\n<p>\"<em>You</em> did.\" Damian says, looking more and more angry. \"<em>You</em> told me that your memory would come back as soon as you got better. You <em>promised</em>.\"</p>\n<p>\"Damian-\"</p>\n<p>\"No! You <em>said</em> you'd remember again.\" Damian is yelling now, and Bruce looks around himself worriedly. He has no idea what to do. He doesn't know Damian. Not really. He doesn't know him as well as Bruce from the future does. <em>He'd</em> know what to do. Crap.</p>\n<p>\"Damian, you need to calm down, I-\"</p>\n<p>\"Don't tell me what to do,\" Damian snarls at him. \"<em>You're</em> <em>not</em> my father.\"</p>\n<p>Bruce stops talking.</p>\n<p>Damian goes back into his room, and comes back out a moment later. He throws a pile of red and black cloth on the floor, next to Bruce's feet.</p>\n<p>\"I'm not doing it anymore. Not with <em>you</em>.\" He says. His voice is so full of contempt that Bruce doesn't want to look him in the eye. \"I'm leaving in the morning.\"</p>\n<p>He slams the door closed.</p>\n<p>\"Where will you go?\" Bruce asks, to the closed door. Not back to Talia.</p>\n<p>There is no reply.</p>\n<p>Bruce picks up the pile of cloth. It's not cloth, he realises. It's Kevlar. And silk. A cape. Damian's Robin uniform. He runs his hands over the embellished robin symbol.</p>\n<p>\"Damian,\" he says. \"Open the door right now.\"</p>\n<p>The door remains firmly closed.</p>\n<p>He stares at the Robin symbol some more. He feels - he doesn't have the word for it exactly. He feels weightless. Like he's floating in a pool of something. Something dense and heavy. Like maybe it might drown him.</p>\n<p>He also has one hell of a headache.</p>\n<p>It's not that he's angry. He's not. He's just . . . <em>tired</em>. So tired.</p>\n<p>\"Damian,\" he says again, quieter this time. \"Please let me in.\"</p>\n<p>Again, the door does not open.</p>\n<p><br>\nHe walks down the hallway, holding the cape in his hands. The red and black of it is so familiar. Robins. He holds it in his hands, the weight of it.<br>\nHe stops outside the door of his bedroom. He can hear the sounds of muted laughter and talking. Something stops him from entering.<br>\nThis isn't his family. Damian is right. He's not the Bruce that they know.<br>\nHis family is a fourteen year old boy who loves the hell out of him and an eighteen year old man who doesn't talk to him all that much and a butler who's been with him forever.</p>\n<p>He goes downstairs instead, back to the cave.</p>\n<p>He walks past the memorial, and the row of monitors, and goes to the gym. He folds the cape carefully, and sets in down on the bench next to the free weights, in case Damian would like to reconsider.</p>\n<p>He runs for a few miles on the treadmill, until his mind is clear and his feet hitting the surface of the belt is all he can hear or think off. He switches it off, and gets down. He leans against it for a second, massaging his temples. His headache has only gotten worse.</p>\n<p>He sits on the bench next to the cape. He frowns. His headache is <em>really</em> bad. It doesn't feel like a usual stress migraine. Maybe he should call Leslie.<br>\nSomething wet on the back of his hand makes him look down at it. It's his knuckles. They're bleeding. They've split again, from before. Must've been because he's balled up his fists while running. He looks for something to wipe the blood off with, and cape is the first thing that comes to hand.</p>\n<p>He dabs at his knuckles with the cape, and then he stops. He looks at it. There's blood on the cape. Blood on the Robin symbol. What does it remind him of? It feels like it's right <em>there</em>. Right behind a thin curtain he can't look behind. <em>Fuck</em>, his head hurts.</p>\n<p>He closes his eyes, and remembers.</p>\n<p>Suddenly it's like he's <em>there</em>. The smell of the blood and the heat and fire and Jason is lying on the ground and there is blood all over his cape and why is there so much <em>blood</em>? He tries to wipe at it, wipe away at the blood but more keeps gushing out from somewhere and he can't figure out where and the whole place is on fire and his son is <em>dying</em> and he can't do anything to stop it. Jason has long since stopped breathing but his body is still warm and he stares at the bloody cape and knows that the day that his parents died is now the second worst day of his life.</p>\n<p>He and Dick go see Zitka and the penguins and they eat sandwiches near the promenade and then they walk back to Dick's apartment instead of taking a cab because Dick paid for the sandwiches and now he's run out of money and Bruce forgot his wallet at home and they hug each other at the end of the evening and Bruce whispers \"sorry\" into Dick's collar, and Dick squeezes his hand back and just like that they stop fighting after almost two years of it. It's a good day in maybe the worst year of Bruce's life.</p>\n<p>Tim almost knocks down the manor door trying to enter. He shows him a handful of news clippings and says that he knows Bruce is Batman. Alfred looks like he's trying not to smile. A thirteen year old kid with an ultimatum. It almost makes Bruce laugh. And nothing has, in so long. He's missed having a kid around at the manor. He's missed it so much in fact, that he lets Tim talk for a while, just to hear the sound of his voice. And then the things Tim says really start to make him think. Maybe he's not just a thirteen year old with an ultimatum after all.</p>\n<p>Stephanie and Bruce never get along, but they try for Tim's sake. She never takes his orders seriously and always undermines him and jokes around and is a bad influence on Tim and always gets into trouble that Bruce has to bail her out of and suddenly he realises that he <em>does</em> like her. He sits in the adoption clinic with her, going through the pamphlets when he realises that she's crying quietly next to him, her hands clutching at her stomach. \"It's going to be okay,\" he says quietly and puts an arm around her, and she nods and cries harder.</p>\n<p>He sees Damian for the first time when Talia has him held captive in some underground tunnel in London, and the first thing Damian says is, \"I thought you would be taller,\" and Bruce has never met this kid in his life, but there's already a knot of something tight in his chest. Could it really be? He takes him home and he trains him and then all of a sudden he has to leave and Dick cares for him and when he comes back Damian is a changed person. He's taller and older and god how did- when did he grow up so <em>much</em>? Damian only nods, and says \"Father. It's good to see you.\" But later that night he comes to Bruce's room and gives him a quick hug, his cheeks flaming red.</p>\n<p>Cass can barely say anything, when they first meet. He tries to teach her how to pronounce things. Digs up old children's books he'd forgotten he had, from the attic. He finds his old Knights baseball cap, dusty from lack of use. The one he'd bought when he took Jason for that game. He stares at it, and then shakes his head. Old memories, now. He very deliberately puts it away. Teaches Cass how to say '<em>Bat</em>' and '<em>Hat</em>'. She grins at that. The next day he see the old Knights baseball cap placed on his batsuit mannequin instead of the usual cowl. It makes him laugh.</p>\n<p>Sometimes he realises that he's not the same as he used to be. He remembers being the kind of person that would laugh when one of his kids wrote an embarrassing poem, or the kind of person who would go to his kid's school events and activities. The kind of person who was fun to be around. But now all he can do is worry. Worry, and be scared for them. The pure <em>fear</em> coils up around his windpipe, clutching tight. Every time Damian misses his curfew, Bruce calls him. When Dick doesn't make it on time to the manor during galas or holidays, he doesn't think that it might be because of the traffic on the state highways. No, it's because he's been kidnapped. Or murdered. Why wouldn't he? There's people trying to kill them all the time.</p>\n<p>So he sacrifices a few of those things. Things that he enjoyed doing. Seeing movies with Jay. He would do that a lot. But the first time Tim wanted to stay in and watch a movie, he had to close his eyes and take deep breaths and swallow away the goddamned lump in his throat before he could say, \"Let's go for patrol instead, Robin. You can watch a movie later.\" </p>\n<p>Like that time he was off world and it was Dick's twentieth birthday, and he just stared at the communicator in his hand until Clark looked his way and said, \"I could drop you back Earthside. If you wanted to see him.\"<br>\nAnd Bruce had just shaken his head. \"I can see him after we take care of the Krazlons.\"</p>\n<p>(It took two weeks to take <em>care</em> of the Krazlons. He knows he should have called, at least. But the words were choked up in his throat and he couldn't bring himself to say them. Jason was never going to turn twenty)</p>\n<p>So maybe he's not that person anymore, the person who liked Han Solo and bad poems and watching baseball, but at least this way he's keeping them safe. And it <em>has</em> worked. And this life <em>is</em> a good life.</p>\n<p><br>\nIsn't it?</p>\n<p><br>\nHe remembers everything. How Damian curls up when he sleeps, his fists clenched tight when he has nightmares. How he feels like he has to fight everyone, even though they're all on his side. How he laughs, his voice still high and childlike, when Dick says something funny, or when he runs across a rooftop during patrol.<br>\nHow he and Jason fight all the time, because he's so reckless and careless with his own life, and he's going to get himself <em>killed</em>, can't he see that? Can't he see how <em>precious</em> his life is? How Bruce can't lose him again? Everytime Jason shouts back at him or is cold towards him Bruce just stands and stares at him and wonders what happened to them. How did it all go so <em>wrong</em>?<br>\nHe remembers that quiet argument he has with Tim about his college choice that turns into a not so quiet confrontation when Tim yells \"you can't micromanage every <em>single part of my life!</em>\" And everyone in the cave turns to look at them, and Tim walks away and Bruce stares after him because all he wanted to do was the <em>right thing</em>.</p>\n<p>But there are good days, like that day when Cass and Stephanie wake him up at six in the goddamn morning with slightly undercooked bacon and eggs and some coffee and when he asks them what the hell they're doing they tell him to shut up and eat. He passes on the bacon and eggs (Stephanie glares at him) but he has some of the coffee and listens sleepily as they tell him their plans for the day, and how Stephanie thinks that Ryan from Chemistry is totally dating her friend Kirsten and how she doesn't approve at <em>all</em> because she heard from her other friend Claire that in his sophomore year Ryan once cheated on-</p>\n<p>\"Please,\" he says, holding his head in his hands. \"Please stop.\"</p>\n<p>Cass giggles, and Steph smiles a little too. He has another sip of the coffee and he realises that it's really good. Later that day, in the evening, Damian makes him a crown out of cardboard that he paints yellow with the paint that Alfred had bought him for his birthday, and they all insist on him wearing it while Dick hands him a chocolate cupcake and they all cheer and clap when he cuts into it with a plastic knife.<br>\n\"What's all this for?\" Bruce asks.</p>\n<p>\"It's father's Day,\" Tim says, eating what's supposed to be <em>Bruce's</em> cupcake. \"You look really ridiculous in that crown. Don't take it off until I can get a picture.\"</p>\n<p>So there <em>are</em> good days.</p>\n<p>He remembers all of them.</p>\n<p>It occurs to him that he's not on the bench anymore, that he's lying on the floor and clutching at his head. The cape is balled up in his hand. His headache is receding a little.</p>\n<p>He blinks open his eyes. Did Damian say something about cancelling his violin lessons with Mr. Nguyen?</p>\n<p>\"Shit,\" he says.</p>\n<p>He gets up off the floor, and wipes at his mouth. He feels out of breath, but he doesn't think he's been screaming. The cape he puts aside again.</p>\n<p>When he turns he sees that Cass is standing next to him, looking at him with concern.</p>\n<p>\"Oh,\" he says, \"You sneaked up on me again.\" It feels good to remember who she is. To remember her name by himself, and not just go with what everyone else told him. His daughter.</p>\n<p>She's still looking at him, frowning in that decided way that she does when something is bothering her. He meets his gaze, and lets her look at him. She's smart. She'll figure it out.</p>\n<p>\"Bruce?\" She says finally, the word ending with an uptilt.</p>\n<p>Bruce nods, and her face breaks out in a smile.</p>\n<p>\"Knew you'd come back,\" she says.</p>\n<p>He's silent, as he thinks. He didn't know. He didn't think he'd remember again. \"I'm lucky, \" he says.</p>\n<p>Cass shakes her head. \"We are.\"</p>\n<p>Bruce smiles at that. \"Flattery will get you nowhere,\" he says, and she grins up at him, and he suddenly feels a lot better about himself. It was . . . not pleasant, thinking that literally no one other than Damian had missed his 'departure', so to speak.</p>\n<p>Perhaps the fault lies with him, on that front. Maybe it's not too late to fix that. Maybe.</p>\n<p>\"Come on,\" he says, \"as soon as the world stops tipping slightly to the left I'm going to take you somewhere.\"</p>\n<p align=\"center\"><br>*</p>\n<p><br>Cass wiggles her toes in the cold, crisp air. It reminds her of how different the streams and currents of air get higher up, when they're on rooftops or terraces.</p>\n<p>\"Put your shoes back on, you're going to hurt your feet on the shingles.\" Bruce is sitting next to her. His eyes are studying the horizon. He seems as unaffected by the strong wind as she is.</p>\n<p>Cass shakes her head. Her feet are strong. She wiggles her toes again to show Bruce.</p>\n<p>Bruce doesn't see it though, or laugh like he sometimes does. He's still looking far off, at the darkening sky.</p>\n<p>Cass nudges him with her elbow. \"Okay?\"</p>\n<p>Bruce sighs. \"Yes.\" He says. He's leaning mostly on the chimney, his back against its solid brick. \"We're going to break this roof,\" he says.</p>\n<p>Cass grins and jumps a little. The roof holds. It'll be fine.</p>\n<p>\"Don't do that, you'll fall right off.\"</p>\n<p>\"Buzzkill,\" she says. Tim taught her that. It means someone who ruins your moment. She wiggles her toes again, right in front of him this time, so Bruce can see. Her nails are painted in different shades of purple, courtesy of Steph.</p>\n<p>He smiles absently.</p>\n<p>\"Brooding,\" She says. \"What's wrong?\"</p>\n<p>He studies his feet. They're sitting on the roof of the manor, their legs stretched straight across the slanting roof. He told her that he used to come up here when he was a teenager. Alfred would always yell at him after. A younger, surly Bruce brooding on a rooftop and then getting scolded by Alfred. Not so different from now. Something about it makes Cass smile.</p>\n<p>\"How far is the drop, do you think?\" He says. He's talking about from here to the ground.</p>\n<p>Cass shrugs. She knows she could jump and land safely from the height. Instincts that have been drilled into her to tuck and roll. They used to throw her from greater heights and tell her to try not to break any bones on the way down. They used to call it training.</p>\n<p>\"Fifty feet?\" She says.</p>\n<p>Bruce smiles. \"Forty nine and a quarter. Good guess.\"</p>\n<p>Cass scoots a little further down the roof, until she's right at the edge of the roof. She can see Alfred's tulips from up here.</p>\n<p>\"Be careful,\" Bruce says.</p>\n<p>Cass grins, and pretends to lose her footing. She 'stumbles', dipping precariously over the edge.</p>\n<p>\"<em>Cass</em>,\" Bruce quickly leans over and pulls her back by the back of her T-shirt, and she falls back on her butt hard. She giggles, looking over at Bruce to see if he's mad.</p>\n<p>\"Stop that. You're going to give me a heart attack.\" He says, trying to look severe but it just makes her laugh harder.</p>\n<p>\"I got you,\" she says, feeling proud.</p>\n<p>\"Yes,\" he smiles. \"You did.\"</p>\n<p>It's almost fully dark now, and Cass can hear the bats starting to come out from the caves, going for their hunts.</p>\n<p>\"Tell the others?\" She says. Bruce doesn't look very happy. She thought he would, getting his memories back.</p>\n<p>\"Not yet,\" he says. He's still staring into the night, something inscrutable in his eyes. \"Let's just sit here awhile, you and I.\"</p>\n<p>She shrugs. They sit there for a while, watching the sky darken and the bats fly, and after a while Cass scoots closer to him and puts her head on his shoulder.</p>\n<p>\"Do you like me?\" He says after some time, his voice jarring and abrubt after the silence they had been sitting in.</p>\n<p>Cass looks at him, confused.</p>\n<p>\"Do you . . . think I'm a good person? I know that I haven't been as- as,\" he trails off, and sighs. \"I used to be a different person. Is the thing. I don't know.\"</p>\n<p>Cass stares. Of course they like him. Maybe he was a different person then, but that Bruce was not the person who adopted Cass. He wasn't the one who bought her ice cream and taught her sign language instead of throwing her down a cliffside and telling her to not break any bones.</p>\n<p>\"Bruce,\" she says, \"don't be - hard on yourself. We . . . missed you.\"</p>\n<p>\"Yeah?\" He says. A bat flies over their heads, and both of them crane their necks to watch it go.</p>\n<p>\"I used to be scared of bats,\" he says, staring after it. \"And heights. Of falling. I fell into a cave full of them once, when I was a boy. I used to come up here to conquer both.\"</p>\n<p>Cass blinks. She's never known Bruce to be scared of anything. She used to be scared of small spaces, herself. Her father used to lock her in a closet if she lost at sparring, or she hurt herself. Under no circumstances was she allowed to get hurt. Her body was a weapon, to be trained and taken care of. She'd sit for hours and hours in that closet, studying the grain of the wood and holding her broken arm or lacerated leg close to her, her throat full of frozen screams.</p>\n<p>And then Bruce found her and there were no more closets or broken bones. Suddenly there were brothers and milkshakes and Steph and reality TV and a <em>home</em>.</p>\n<p>\"Damian will forgive you,\" she says. She'd heard shouting from the other room. Shouting and then the door slamming and finally silence.</p>\n<p>\"I know,\" he says. \"But not everyone is going to be happy.\"</p>\n<p>He's talking about Jason.</p>\n<p>\"You don't know that.\"</p>\n<p>Bruce nods. \"Maybe. I'll talk to him.\"</p>\n<p>\"Good.\" Cass says, and puts her head back on his shoulder. \"Don't be dumb. We like <em>you</em>.\" She's tired of speaking now. If Bruce wants to talk anymore, she's just going to sign it out.</p>\n<p>But Bruce seems to share her sentiment. He doesn't say anything further. He's always liked the quiet anyway. The quiet and the dark. It feels like they're on patrol together, waiting for that perfect moment to drop onto the ground and take down some bad men.</p>\n<p>After a while, she signs something to him, and he watches her hands and then laughs.</p>\n<p>\"No,\" he grins. \"It didn't work. I'm still afraid of them.\"</p>\n<p align=\"center\"><br>*</p>\n<p>This time when he stands outside Damian's door, there isn't any silence. He can hear a conversation. Two high voices whispering to each other, like they don't want to be heard. It makes Bruce smile.</p>\n<p>He knocks on the door. \"Damian? May I come in?\"</p>\n<p>The voices stop abruptly. Then there's the sound of footsteps, and the door opens, just a crack.</p>\n<p>Damian looks up at him through it, slightly suspicious.</p>\n<p>\"May I come in?\"</p>\n<p>\"Why?\" Damian asks. He sounds genuinely curious.</p>\n<p>\"I want to talk.\" Bruce says.</p>\n<p>Damian gives him another look, like he's trying to figure out his intentions, and then cracks open the door some more.</p>\n<p>Bruce enters the room. Damian's room, large and usually neat and orderly, is today looking slightly different. There's heaps of clothes strewn across the floor, and his swords (that he's absolutely <em>not</em> supposed to be bringing upstairs,) laid out on the bed. A half-filled suitcase in the corner. A pair of shoes near the table. Despite himself, a twinge of hurt goes through Bruce's chest. He was really going to leave?</p>\n<p>\"Don't worry, Mr. Batman,\" Jon says, from the bed that he's sitting on cross legged, \"I talked him out of it.\"</p>\n<p>Bruce looks at Damian. \"Is that true?\"</p>\n<p>Damian shrugs irritably. \"Yes. I . . . realise that I might have overreacted slightly.\"</p>\n<p>\"I <em>made</em> you realise-\"</p>\n<p>\"Shut <em>up</em>, Jon.\"</p>\n<p>\"Hey! You can't talk to me like that!\" Jon says, offended. \"I'm your <em>friend</em>!\"</p>\n<p>\"So what? I'm older.\"</p>\n<p>\"I'm <em>taller</em>.\"</p>\n<p>\"Tt. You can't-\"</p>\n<p>\"Boys,\" Bruce says. \"Enough.\"</p>\n<p>They both stop. Damian looks at Bruce hesitantly. He has an expression on his face that couldn't quite be called ashamed, but Bruce can read between the lines. Sometimes, at least.</p>\n<p>\"I shouldn't have said those things. Especially about you not being my father.\" Damian says, his voice quiet. He's looking at his feet. \"I'm- I apologize.\"</p>\n<p>Bruce nods. He bends down towards Damian, his voice quiet, \"You know that the next time you have a problem you can tell me, right? Don't keep it to yourself. Even if it's a problem you have about me.\"</p>\n<p>Damian nods, still looking at his feet. \"Tt.\" He says. \"I'm okay.\"</p>\n<p>\"Good,\" Bruce says, and hugs him.</p>\n<p>\"<em>Father</em>,\" Damian hisses, embarrassed, his arms stuff and awkward around Bruce, \"not in front of <em>Jon</em>.\"</p>\n<p>\"Indulge me, for minute. And then you're going to call up Mr. Nguyen and tell him that you changed your mind. There is no way you could have possibly 'mastered the art' in three months, Damian.\"</p>\n<p>Damian's eyes flick to his, quickly. \"You remember?\"</p>\n<p>Bruce smiles. \"Call him. Don't forget to apologize. And stop letting go of your teachers without my permission or I'll put you in a public school.\"</p>\n<p>\"You would never,\" Damian says, but he's smiling back.</p>\n<p>\"Aww, that's so great guys! You're not fighting anymore!\" Jon says from the back.</p>\n<p>\"Shut up, Jon.\" Damian says again.</p>\n<p>Bruce turns to look at him. Clark's son is grinning wide, his eyes practically sparkling. \"Aren't you supposed to be in school?\" He says, getting up again.</p>\n<p>Jon stops grinning. \"Well- I <em>am</em>, but Damian called me and said it was a code blue emergency- and Metropolis isn't so far from Gotham, and we had recess anyway, and all I missed was a dumb pop quiz and-\" he stops, after seeing the look on Bruce's face. \"Please don't tell Dad, Mr. Batman.\" He says sheepishly.</p>\n<p>Bruce crosses his arms. \"We'll see. I don't want you flying back on your own. I'll drop you home. I need to talk to Clark about the Fortress anyway. Grab your coat. Let's go.\" He walks back towards the door, and then turns around to look at Damian. \"Go downstairs. Everyone's celebrating. And keep your swords back in the cave.\"</p>\n<p>Damian frowns. \"You told me <em>last</em>?\"</p>\n<p>Bruce raises an eyebrow. \"Damian, you threw your cape at me and said you never wanted to talk again. I was giving you some space.\"</p>\n<p>Damian scowls again but he darts across the room, opening the door and zipping outside with a rushed 'bye Jon', but on the way out he gives Bruce a shy smile.</p>\n<p>\"Sparring tomorrow.\" Bruce says. \"Five thirty. Don't be late.\"</p>\n<p>The smile becomes a grin. \"I'll be there at five.\"</p>\n<p>Once he's gone, Bruce turns his attention to Jon. Jon squirms uncomfortably.</p>\n<p>\"Missed a pop quiz, huh?\" Bruce says.</p>\n<p>Jon blushes. \"It was open book anyway.\"</p>\n<p>Bruce shakes his head. \"How's your dad?\" He asks. He was supposed to meet him for a check up on the Javelin six days ago.</p>\n<p>Jon shrugs. \"Dad's saying that he thinks you're doing one of your deep cover missions again, where you don't contact anyone in the league for like, <em>six</em> months. And that's why you missed the last two meetings. He says that you're always an ass about it.\" He says the word <em>ass</em> slowly, like he's trying to relish using the word. He's probably not allowed to swear at home.</p>\n<p>\"Does he now.\" Bruce says, walking towards the door.</p>\n<p>\"Oh,\" Jon says, when he realises what he's saying, \"he didn't mean it <em>that</em> way, Mr. Batman! He was being like, jokey and all.\"</p>\n<p>Bruce allows himself a small smile, now that his back is towards the kid. He has an image to maintain, after all. \"I know, Jon. And stop calling me Mr. Batman.\"</p>\n<p>\"Oh. Uh, sorry. . . Uncle Bruce?\"</p>\n<p>Bruce's hand stills on the doorknob. \"I'll pay you good money to never call me that again. Especially not in front of my children.\" They'd never let him hear the end of it.</p>\n<p align=\"center\"><br>*</p>\n<p><br>When he gets back, late in the night, they're still celebrating. The atmosphere in the kitchen, where everyone had congregated, is oddly festive. Alfred is making them a fancier variation of cheese and crackers, while Stephanie and Cass bicker about whose phone to plug into the AUX. Jason and Tim and Dick are sitting at the raised bar table. Damian is sitting on the counter next to Alfred, trying to sneak some cheese from the plate and failing.</p>\n<p>\"Bruce,\" Dick says, his voice slightly slurred. \"Join us. We're roasting to you being your old asshole self again.\" He holds up a glass with a lemon wedge in it.</p>\n<p>\"No thanks, I don't drink.\" Bruce says, and Dick smiles.</p>\n<p>Bruce looks over at Tim. \"Put that glass down,\" he says. \"You're not old enough to be having that.\"</p>\n<p>\"It's just a beer,\" Tim says, but grumbles and puts it back down on the table when Bruce gives him a Look.</p>\n<p>\"I'll be twenty one in three years and eleven months.\" Tim says weakly. He looks a little flushed, like he's already had a few. Bruce narrows his eyes.</p>\n<p>\"That's a long time, replacement,\" Jason laughs. \"How was that a good argument,\" he laughs some more. It may be possible that Jason is also quite a bit drunk.</p>\n<p>\"Do you guys want to listen to my amazing rap mixtape or Cass's dumb pop shit?\" Stephanie yells from the living room.</p>\n<p>\"I vote dumb pop shit. Your music is loud and awful.\" Dick yells back.</p>\n<p>Stephanie glares at him. \"Bruce, back me up here. We were really bonding over Kendrick Lamar, remember?\"</p>\n<p>Bruce pretends not to have heard her, and walks over to where Alfred and Damian are, doing his best to ignore her choice cursing. He does see Cass raising a fist in victory from his peripheral vision.</p>\n<p>\"See?\" Jason says, laughing some more, \"Favourite kid. It's been proven.\"</p>\n<p>\"Master Bruce,\" Alfred says, as way of greeting. \"Anymore soap operatics that we shall have the pleasure of witnessing today?\" He's talking, of course, about Damian's outburst. And also possibly his sudden memory revival.</p>\n<p>\"Ha,\" Bruce says dryly. Come to think of it, there have been a lot of 'soap operatics' in the last two weeks. \"If memory serves correctly, and I know it does,\"- to this Damian rolls his eyes- \"all of you seemed to rather enjoy it.\"</p>\n<p>\"That we did, Master Bruce. That we did.\" Alfred hands both him and Damian a plate of cheese and crackers and makes shooing features that imply that he wants them to get out of the kitchen.</p>\n<p>Damian scampers over to the bar, towards Dick, his plate in hand. Dick leans down to say something to him, and they both laugh.</p>\n<p>\"Looks like they're friends again,\" Bruce says.</p>\n<p>\"Indeed. Perhaps one ought to supervise the drinking pattern of those boys. I can see Master Tim eyeing his glass again.\"</p>\n<p>\"Yeah, not on my watch,\" Bruce says, going back towards the bar. He notes that Alfred has very graciously left out the fact that when he was Tim's age he was drinking much, much more. He stops at the doorway.</p>\n<p>\"Alfred?\" He says.</p>\n<p>\"Hm.\" Alfred doesn't look up from the chopping board, his knife working with precision.</p>\n<p>\"Thank you.\" Bruce shifts uncomfortably.</p>\n<p>Alfred looks at him with surprise. \"What for?\"</p>\n<p>\"Everything, I guess. I don't know.\" Bruce looks at the kids outside. They're laughing as Dick narrates some story, his arms moving wildly as he gesticulates. \"You do most of the work, when it comes to them. All of it, maybe. I've been,\" Bruce pauses, as he considers the correct word to choose. \"<em>distant</em>. These last few years. I haven't tried hard enough.\"</p>\n<p>Alfred is looking at him now, his focus averted, temporarily, from the chopping board.</p>\n<p>\"And- and perhaps it's time I stopped leaning on you so much. For when it comes to them, I mean. You shouldn't have to do the job I was supposed to do. So. Thank you, for doing it so far.\" He says. He stares at his shoes, unable to say much more.</p>\n<p>\"Quite,\" Alfred says finally, softly. \"Master Bruce, I do not consider this my job. It's a gift to watch them grow and change and learn. That being said, I hope this means you're going to do their bloody laundry from now onwards. I understand that I am the family butler, but seven sets of clothes is pushing it a little, sir.\"</p>\n<p>Bruce laughs. \"Make them do it. I'm not touching anyone's dirty underwear.\"</p>\n<p>\"And there go all the promises, right out the window.\"</p>\n<p>\"Alright, alright,\" Bruce says, and goes back towards the bar. He finds Tim sitting to a side, watching the proceedings with a smile on his face. He pulls him aside. \"I need to talk to you,\" he says.</p>\n<p>\"Sure,\" Tim says, stretching and getting off the stool. \"What's up?\"</p>\n<p>\"Come with me to the study.\" Bruce says.</p>\n<p>Tim quirks a curious eyebrow, but says nothing. They walk up to the third floor, and when they reach Bruce's office, Bruce walks across the room to his desk, and picks up a sheaf of papers.</p>\n<p>\"Princeton,\" Bruce says.</p>\n<p>Tim looks more confused than ever. \"I'm sorry, what?\"</p>\n<p>\"Princeton. You could go to Princeton. I've been thinking about it for a while now.\"</p>\n<p>\"What?\" Tim says again, ever so eloquently.</p>\n<p>\"It makes perfect sense. I went to Princeton. The Dean and I know each other. I could put in a good word for you. And it's not too far. Maybe forty minutes away. Honestly, I don't know why we didn't think of this earlier.\"</p>\n<p>\"Wait, what are you talking about?\" Tim says, frowning.</p>\n<p>Bruce sighs. \"College, Tim. Gotham university is a piece of shit institution, and you obviously don't want to go to Harvard.\"</p>\n<p>\"So you're saying. . . Princeton?\"</p>\n<p>\"Yes. They have a very good business and management course. I would know, I took it.\" Bruce pauses, and his tone softens. \"I want you to at least think about this, Tim. I know I haven't always been the most understanding about your wishes. This could be good. A compromise.\"</p>\n<p>\"This way I could come back every night to go for patrol,\" Tim says, realisation dawning on him.</p>\n<p>Bruce purses his lips. \"I would prefer only on the weekends, but we could negotiate that.\"</p>\n<p>Tim's nodding now, as if he's just now getting that this could actually work. \"It's perfect. It'll look good for the company too. Son of owner goes to his Alma mater. And I won't freeze my nuts off in <em>Boston</em>.\"</p>\n<p>\"Language,\" Bruce says automatically.</p>\n<p>Tim bites his lip to hide a grin.</p>\n<p>\"What?\" Bruce says.</p>\n<p>\"Nothing, 'Language',\" Tim says, grinning. \"You still got a little bit of the other guy in you.\"</p>\n<p>Bruce looks mildly disgusted. \"That makes me sound like Dr. Jekyll.\"</p>\n<p>\"Yeah, well. Oh, and don't you dare put in a <em>good word</em> for me, Bruce. I'm getting in on my own.\"</p>\n<p>Bruce's mouth quirks upwards. He hands over the sheaf of papers to Tim. They're pamphlets for Princeton.</p>\n<p>\"Read up,\" Bruce says. \"We'll turn you into a business mogul yet.\"</p>\n<p align=\"center\"><br>*</p>\n<p>It's much later into the night, when the impromptu celebrations have died down, that Bruce gets to talk to Jason.</p>\n<p>Everyone starts slowly drifting upstairs to their rooms, making noises about having to wake up early tomorrow or just wanting to go to bed. He helps Alfred clear up, picking up empty plates and mugs from the table, switching off the music, and taking Damian upstairs to his bedroom, when he falls asleep.</p>\n<p>He's putting away the leftovers, when he realises that Jason's still sitting there.</p>\n<p>Bruce looks up at him. Jason looks half asleep, his head lolling slightly. He's leaning against the bar still, his hands closed around his glass, but his eyes are closed.</p>\n<p>\"Jason,\" Bruce says, and Jason's eyes flick open slowly.</p>\n<p>\"W'ssat?\" He mumbles.</p>\n<p>\"Get up, you can sleep in a bed.\" Bruce says, and starts helping Jason up.</p>\n<p>Jason gets up, and yawns hugely. \"M' goin' home.\" He says. His eyes though, are still firmly shut. Jason would hold off on opening his eyes until the last possible moment, whenever he was sleepy. As a thirteen year old, he had perfected the art of taking a shower, dressing and eating breakfast all without cracking an eye open. Bruce remembers laughing about it.</p>\n<p>\"No you're not. You're far too sleepy and intoxicated to drive.\" Bruce says.</p>\n<p>\"Mm.\" Jason says, in argument.</p>\n<p>\"While the point that you just made is perfectly sound, you need to be in a bed. Right now.\" He gives Jason a little tug, and after a moment's hesitation, Jason follows him.</p>\n<p>\"I have to get home,\" Jason insists weakly. \"Gotta feed the cat.\"</p>\n<p>\"You don't own a cat, Jay.\"</p>\n<p>Jason considers this. \"Fair 'nough.\" He mumbles. \"But if I did his name would be Pimpernel. As in, the scarlet variety. Pimp, for short.\" He giggles to himself. \"A cat named Pimp. That's genius.\"</p>\n<p>\"Alright,\" Bruce says, amused. \"Go to bed, now.\"</p>\n<p>Bruce takes him to an old guest room on the first floor of the manor that no one uses, and Jason flings himself into the bed, wearing shoes and jacket and all.</p>\n<p>Bruce leans down by bed next to him. \"Jason,\" he says carefully, \"you know that this doesn't <em>change</em> anything, right? I'm still going to be your-\"</p>\n<p>He stops. Cocks his head. Jason is already snoring.</p>\n<p>\"Well, then.\" He murmurs to himself. A hand grips his.</p>\n<p>\"Shut up, dad. 'M trying to get s'm sleep.\" Jason mumbles half into the pillow.</p>\n<p>Bruce allows himself a small smile at that. \"Okay,\" he whispers, getting up. \"Goodnight.\"</p>\n<p>Jason stirs, turning to look at him blearily. \"Gotta get home,\" he says again.</p>\n<p>Bruce stands at the doorway, and looks at him. It's late enough that he knows the sun will be coming up in an hour or so. That glorious washing over of dawn after a long night. A second chance to fix previous mistakes. To try again. He thinks of the manor, of everyone in it.</p>\n<p>\"You <em>are</em> home,\" he whispers. \"Go to sleep.\" He clicks shut the door behind him, and stands outside it for a moment, letting an impossible warmth wash over him.</p>\n<p> </p>\n<p> </p>\n<p>It's a bright August morning when the Gotham Knights win a game for the first time in twenty six games.</p>\n<p>And Bruce is right there to see it.</p>\n<p>\"Sorry we're late,\" he says, sitting down on the empty seat next to Dick and Stephanie. \"Jason wanted to buy a mitt, for some godforsaken reason, and we had to drive across town to find one that he liked.\"</p>\n<p>Jason sits down on Dick's other side, eating a hot dog while wearing the mitt. Bruce watches half in amusement and half in disgust as the mustard and ketchup leaks all over the mitt.<br>\nJason looks up at him. \"You know exactly why I wanted it. I'm going to whoop Dick's ass later, when we play, and we don't have sports stuff lying around in the manor.\"</p>\n<p>Dick snorts. \"You should know that Bruce made me swing a bat at five in the morning everyday for four years, and called it basic training. I'm pretty much the undefeated champion, Jay.\"</p>\n<p>Jason grins. \"We'll see about that.\"</p>\n<p>Dick rolls his eyes. \"And take your sunglasses off, we're sitting in the shade. You look like an asshole.\"</p>\n<p>\"Can't,\" Jason says. \"I'm supposed to be Bruce's bodyguard,\" he smirks. \"And can I just say, these shades are doing wonders for my game. I mean, I already got this chick's number, and damn you should have seen her-\"</p>\n<p>\"If something gross comes out of your mouth I'm going to punch it,\" Stephanie says.</p>\n<p>\"Smile.\" Jason says, grinning. \"You should have seen her smile. Real beautiful.\"</p>\n<p>Stephanie just rolls her eyes.</p>\n<p><br>\nThe game is in its eighth innings already. They're not just late; they've missed most of the game. The stadium watches in half-interest as the Meteors step up to bat.</p>\n<p>\"You know, it's not actually looking bad for us this time around,\" Tim says. He's still in his suit from the morning meeting that Bruce took him to earlier, although he's taken his blazer and tie off.</p>\n<p>Stephanie scoffs. \"You say that every time.\"</p>\n<p>\"Hope springs eternal,\" Dick says.</p>\n<p>Jason stares. \"Did you just quote an Alexander Pope poem?\"</p>\n<p>\"Hey, I'm well read too. I have hidden depths, you know.\"</p>\n<p>Jason does an elaborate snort at that.</p>\n<p>\"Shh.\" Bruce says. He's looking down at the pitch. Tim's right. It's not actually looking bad for them. The Meteors aren't doing as well as they usually do. He watches as a Knights fielder tags the batter-runner. A wave of cheering goes up through the stadium. Everyone looks faintly surprised. No one more so than the Knights themselves.</p>\n<p>\"Are we. . . actually <em>winning</em>?\" Stephanie says from beside him, in disbelief.</p>\n<p>\"Don't jinx it,\" Dick says, but he looks pretty impressed as well.</p>\n<p>The innings continue, and Bruce stretches out his legs a little, looking around him. \"Where's Damian?\" He asks.</p>\n<p>\"He's getting Cass a hot dog.\" Tim says, not taking his eyes of the game. \"Said something about not caring about this unnecessarily complicated American sport.\"</p>\n<p>\"Well. He's not wrong,\" Jason says.</p>\n<p>Right on cue, Damian shows up with Cass, holding two hotdogs. \"Father, you're here.\" He says.</p>\n<p>Bruce stares at him. He blinks. \"Damian, while I'm all for letting unbiased support for all baseball teams, may I know why you're wearing a Meteors t-shirt?\"</p>\n<p>Damian looks down at his t-shirt. \"Oh, <em>this</em>.\" He looks cautiously around him, and then gives Bruce a conspiratory look. \"Well, I suppose it's safe enough for me to tell you.\"</p>\n<p>\"Safe to tell me what?\" Bruce asks, feeling very confused.</p>\n<p>Damian gives him an impatient look. \"Bend down a little, this is for your ears only.\" He whispers.</p>\n<p>Obligingly, Bruce bends.</p>\n<p>\"Yesterday I received an email from the Watchtower server.\" Damian whispers urgently into his ear. \"The email said that I had been recruited for a top-secret mission, selected from amongst the best of the best. This email informed me that there are secret plans to assassinate you, and those assassins are going to be here today, Father, and use the stadium's low security and bad hygiene standards to their advantage.\"</p>\n<p>\"Bad hygiene,\" Bruce repeats, his face carefully blank.</p>\n<p>\"Yes, bad hygiene. Have you seen the state of the bathrooms, Father? Abominable, really. I mean, have they no clue of the amount of bacteria that festers in an average, half-drunk, obese baseball fan's urine? Have they never seen-\"</p>\n<p>\"Damian, stay on track.\" Bruce says, sighing.</p>\n<p>\"Yes, so as I was saying, the email very specifically outlined that I was to wear a Metropolis Meteors t-shirt and come to the stadium, as it would completely throw off the assassins, who have, ever since birth, been brainwashed to believe that Bruce Wayne would never associate himself with Meteors fan.\"</p>\n<p>\"The email said that.\" Bruce says, slowly.</p>\n<p>\"Yes, Father, everyone knows you hate Metropolis.\" Damian says patiently, as if he's a kindhearted teacher, and Bruce a slightly stupid child who hasn't yet grasped a particular concept. \"So while on a surface level it looks like I'm making a fool of myself, in reality I'm actually saving your life.\"</p>\n<p>Bruce nods. \"Of course. And I'm assuming that these assassins have all been suitably bamboozled and subsequently returned to their headquarters?\"</p>\n<p>Damian shakes his head. \"The email also specified that I wear the shirt for the entire duration of the match, to prevent any unnecessary risks.\"</p>\n<p>\"Of course.\" Bruce says again. \"In case any of the assassins are particularly slow on the uptake.\"</p>\n<p>Damian nods, something about him so absolutely innocent, that Bruce has to smile. Just a little.</p>\n<p>He kneels down, properly this time, so that he's eye level with him.<br>\nDamian looks back at him sagely.<br>\n\"Damian,\" he says, putting a hand on his son's shoulder, \"never change.\"</p>\n<p>\"Of course I won't.\" Damian says, earnest. \"Not until the match is over. I greatly value your life, Father. My hatred for Metropolis is nothing in comparison to my love for your company. If I must wear this t-shirt for continued existence of such, then so be it. Any assassins I see I will not hesitate to take care of, and immediately.\"</p>\n<p>\"Thank you, Damian.\" Bruce says. \"Best keep your eyes peeled, then.\" He pats Damian's shoulder one more time, and then gets back up, off of the floor, and walks over to Tim's seat, where he's been sitting and watching the game avidly.</p>\n<p>He sits down next to Tim. Tim stares straight ahead, at the game.</p>\n<p>Bruce says nothing, looking straight at him.</p>\n<p>A silence.</p>\n<p>Bruce clears his throat pointedly.</p>\n<p>Tim's composure cracks slightly, a slight quirk on the corner of his mouth.</p>\n<p>\"Having fun, are we?\" Bruce says, and Tim bursts into helpless laughter.</p>\n<p>\"It was so worth it, Bruce,\" he says, in between gasps. He's laughing so hard that people from other seats are looking over at them to see what's going on. \"I don't care how long you ground me this time, the look on his face when he said he was saving <em>your life-</em>\" At this point he stops being able to speak, devolving into uncontrollable laughter, his shoulders shaking.</p>\n<p>Bruce sighs, pinching the bridge of his nose. \"How many times have I told you to stop hacking the watchtower server.\"</p>\n<p>\"An innumerable amount,\" Tim cackles, his eyes watering.</p>\n<p>\"You're grounded for a week.\" Bruce says.</p>\n<p>\"It's totally worth it, B. Look at his face-,\" Tim gasps. \"He's feeling so <em>noble</em> and <em>brave</em>, oh my god, this is the best day of my life. I <em>can't</em>-\"</p>\n<p>\"You should be glad I didn't tell him. He wouldn't hesitate to take out that sword that he so carefully snuck in past the security checks.\"</p>\n<p>\"The email told him to bring it,\" Tim says, practically half-sobbing at this point, \"and to be extra watchful of the guy who's selling the hot dogs, because he's on a couple of watchlists. That's why he's been buying a hot dog like every twenty minutes. And he has to eat them too, to avoid looking like a total weirdo. And you know how much he hates them.\"</p>\n<p>\"Your brother is <em>little</em>.\" Bruce says. \"You're supposed to look out for him, instead of pranking him.\"</p>\n<p>Tim snorts. \"Yeah, right. It's Damian. He had it coming, B.\"</p>\n<p>Bruce sighs, leaning back in his seat. Maybe he should have come to the game alone. \"At least tell him to stop glaring at the poor hot dog man.\"</p>\n<p>Tim leans over to see Damian, and sure enough, he's giving the man selling the hot dogs a particular nasty look as he buys another one.</p>\n<p>He starts laughing again. \"Goddamn,\" he says, \"I'm a freaking genius.\"</p>\n<p align=\"center\"><br>\n*</p>\n<p>When the innings end, Bruce goes back to his seat, and sees Jason sprawled across it, tossing a paper ball back and forth with Cass, who's all the way over at the other end of their seats. Cass is wearing his mitt.</p>\n<p>\"Jason.\" Bruce says.</p>\n<p>\"Mm.\" Jason pitches the ball over to Cass, not looking up at him.</p>\n<p>\"Bodyguards do not sprawl over their employers' seats.\"</p>\n<p>\"Yeah, well. This one does. Get outta the way, B. Cass is kicking my ass at this thing.\"</p>\n<p>Bruce sighs, and gets out of their way. He sits down on the seat next to Jason's. Damian is curled up in the one next to his, snoring softly. How the boy manages to fall asleep in the middle of the day, in the midst of a hot, noisy crowd, is beyond him. Tim walks over to their seats, whispers \"<em>assassins</em>,\" into Damian's ear and runs away again.</p>\n<p>Damian wakes with a jerk, looking around frantically. \"Where? I'll find them. Just you wait, you <em>fiends</em>, by-\"</p>\n<p>\"Damian,\" Bruce sighs. \"There's no assassins.\"</p>\n<p>\"What do you mean? Of course there are.\"</p>\n<p>\"They don't- <em> Damn</em>.\" He says, looking over at the Jumbotron. \"Damian, get out of frame this instant.\"</p>\n<p>\"Why?\" Damian asks, looking confused. He looks over to see their faces on the sixty foot tall screen. \"Oh.\"</p>\n<p>\"You're wearing a Meteors shirt, and nobody likes a traitor.\" Tim yells over at them from the other end, snickering. \"I'd be careful, if I were you. It's Gotham. People tend to be more violent here. Throw things and all that.\"</p>\n<p>Damian scoots away worriedly.</p>\n<p>Bruce rubs at his temples. \"He's just scaring you. No one is throwing anything.\"</p>\n<p>Jason leans over, and grins at the screen. \"Hey guys,\" he says, despite knowing that they can't hear him. \"I'm the bodyguard. All the lovely ladies, feel free to hit me up after-\"</p>\n<p>He stops when Bruce gives him a look. \"What, I can't even pick up chicks anymore?\"</p>\n<p>\"Someone might recognize you.\" Bruce points outs tiredly. He remembers this being distinctly more fun when he was younger. And he had lesser children.</p>\n<p>Jason nudges his shoulder. \"Hey, lighten up. No one's gonna know. I'm wearing sunglasses. It's the Clark Kent method of doing things.\"</p>\n<p>\"I can see that,\" Bruce says dryly. He notices that they're still on screen. He waves, smiling, like Bruce Wayne would. Jason is still in frame.</p>\n<p>Just the two of them, on a sixty foot screen, talking to each other. Not safe.</p>\n<p>The Jumbotron shot moves on soon, to some adverts and Bruce exhales in relief. He looks over at Jason, who's looking back at him with a strange look in his eyes.</p>\n<p>\"Remember the last time that happened?\" Jason says quietly.</p>\n<p>As if Bruce could ever forget.</p>\n<p>\"Now that, that was a great day.\" Jason smiles. \"You skipped a day of work so I could see a game, remember? I told you I'd never been to a stadium and seen a game live before and you called up Lucius and cancelled all your meetings.\"</p>\n<p>\"Yes,\" Bruce says. \"I remember.\" And Jason had babbled excitedly all the way to the stadium about who his favourite players were, and who was probably going to win, and what he thought was the problem with the Knights' batting strategy and Bruce remembers sitting there, in the car, watching Jason speak and gesticulate so enthusiastically and wondering how he ever got so lucky.</p>\n<p>Jason is so different now, and yet so much the same.</p>\n<p>\"I started going to therapy,\" Jason had mumbled to him yesterday, in Bruce's study.</p>\n<p>Bruce had looked up from his paperwork, surprised. Jason had come to his study to pick up a few books and go over their plans to do a final sweep through Gotham for any remnants of the Pastorelli drug cartel.<br>\nBut that wasn't the only reason. Lately Jason had taken to coming to his study just to sit and talk to him. Or read a book while Bruce worked on something. Often it was just that. Sharing space. They never talked much of anything of real significance. So this had surprised him, to say the least.</p>\n<p>\"That's good,\" Bruce had said. \"I'm. . . <em>glad</em>, Jay. It's a healthy step to take.\"</p>\n<p>\"Yeah yeah,\" Jason mumbled, looking at a patch of carpet by his feet. \"Don't get too excited. I'm just checking it out. I might leave if I don't like it.\"</p>\n<p>Bruce had looked at him. \"Do you want me to come with you?\"</p>\n<p>\"No,\" Jason said firmly. \"Definitely not. Us and emotions and a small room. It would probably end in a fistfight.\"</p>\n<p>Bruce had smiled. \"Alright. Tell me if you change your mind.\" And then he had gone back to his paperwork, and Jason back to reading his book, and they had passed the next hour or so in that way. When Jason left, he paused at the door.</p>\n<p>\"Would it be weird if I said that you getting kidnapped and injected by super dangerous drugs was the best thing that happened to us in a long time?\"</p>\n<p>Bruce considered this. \"Yes. A little bit.\" And Jason had shrugged and said, \"It is what it is,\" and left.</p>\n<p>Bruce considers what would have happened if he had never been near the docks that day, or never been ambushed. Never drugged up to his eyeballs and dragged out of that warehouse.</p>\n<p>Very possibly he might still have been sitting in the cave right now, solving some case or attending some inane party. Not here, not now, with his family. His sons and daughters.</p>\n<p>He looks over at Damian. At Jason. At Stephanie and Cass, laughing at something on Cass's phone.<br>\n<br>\n\"Hey, the ninth inning's starting,\" Dick says, from over at his seat. \"You guys think we'll get lucky?\"</p>\n<p>Bruce looks over at the field. The Knights are stepping up to bat. Today, for some reason, they look undefeatable.</p>\n<p>\"Yes,\" Bruce says, \"I imagine we will.\"</p>\n<p align=\"center\"><br>\n*</p>\n<p><br>\nThey're making their way out of the stadium after the game, when Bruce stops suddenly. He looks around.</p>\n<p>\"Where's Damian?\" He asks.</p>\n<p>The next twenty minutes go by in extricating Damian from a very scared and confused hot dog seller.</p>\n<p>Tim does not stop laughing even <em>once</em>.</p>\n<p align=\"center\"><br>\n*</p>\n<p>\"We should celebrate, or something.\" Dick says. They're making their way out of the stadium again, this time with Damian held securely in Dick's grip. The boy is sulking, looking less than pleased at the prospect of being manhandled. The others are trailing behind, excitedly discussing the game.</p>\n<p>\"Hnn.\" Bruce says, looking for the car. Where had he parked it, again?</p>\n<p>\"I'm serious. We should throw a party, B. When was the last time the Knights won, huh? Like, three years ago?\"</p>\n<p>\"It hasn't been that long.\" Bruce says.</p>\n<p>\"Whatever. I don't remember the exact date. But we haven't not sucked in a while. I think you should throw a post game party. Invite the justice league over, maybe. We could all sit down and watch the highlights. What do you think?\"</p>\n<p>\"No.\" Bruce says.</p>\n<p>Dick rolls his eyes. \"Come <em>on</em>, Bruce. This could be so much fun. And you know Damian has been dying to meet Diana. Haven't you, Dami?\"</p>\n<p>\"No.\" Damian sulks. \"But if Father decided to invite her to this party, I suppose it would be alright.\"</p>\n<p>\"No party,\" Bruce says, finally spotting the car. \"And no Diana.\"</p>\n<p>\"Please? please? I could call the Titans, and Damian could call his buddies, and-\"</p>\n<p>\"Damian's got one friend. <em>One</em>.\" Jason says, from the back. \"And he's from Metropolis. As in, the team whose asses we just kicked. I doubt he'd show up for us to put salt on his wounds.\"</p>\n<p>\"Shut up, Todd. I have friends.\"</p>\n<p>\"Oh yeah? Name five. Go ahead.\"</p>\n<p>\"Todd you <em>imbecile I-</em>\"</p>\n<p>\"Okay,\" Bruce sighs. \"Fine. Throw the party. Call everyone. Go ahead. Just don't get me involved.\"</p>\n<p>\"Great.\" Dick smiles. \"This is going to be awesome. I'm going to call Clark right now.\"</p>\n<p>Bruce lets himself grin a little, at that. Victories do no often feel quite this sweet.</p>\n<p>\"What did you do,\" Dick says.</p>\n<p>\"What?\"</p>\n<p>\"You're smiling. It's freaking me out. You did something.\" Dick says.</p>\n<p>\"I was just thinking of why Clark won't be coming to the party.\"</p>\n<p>\"What? Why?\"</p>\n<p>They get into the car, and Bruce looks back to see if everyone is buckled in. He starts to reverse, the background sounds of the stadium and the kids talking to each other intermingling. It's a good day, Bruce realises. One of the better ones.</p>\n<p>\"He'll be too busy getting a unicorn tattoo.\" Bruce says, and they turn into the lane, and drive back home.</p>\n<p align=\"center\"> <em>Fin.</em></p>\n<p> </p>"
}