{
  "id": "1141067",
  "url": "https://archiveofourown.org/works/1141067?view_full_work=true",
  "author": [
    "Yiichi"
  ],
  "title": "Burning Glances (Turning Heads)",
  "rating": "Not Rated",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Teen Wolf (TV)"
  ],
  "relationships": [
    "Derek Hale/Stiles Stilinski"
  ],
  "characters": [
    "Derek Hale",
    "Stiles Stilinski",
    "Sheriff Stilinski",
    "Scott McCall",
    "Kate Argent",
    "Cora Hale",
    "Laura Hale",
    "Talia Hale",
    "Alan Deaton"
  ],
  "additional_tags": [
    "Alternate Universe - Historical",
    "18th Century",
    "Fashion & Couture",
    "Costume Parties & Masquerades",
    "Alternate Universe - Cinderella",
    "Fairy Tale Retellings",
    "Minor Character Death",
    "Lord Derek",
    "Tailor Stiles",
    "Scott is a Good Friend",
    "and also kind of a fairy-godmother?",
    "Laura is meddlesome",
    "but she means well",
    "Cora is a spoiled brat",
    "Mutual Pining",
    "Angst",
    "Happy Ending"
  ],
  "language": "English",
  "series": "Part 1 of Fairy Tails",
  "published": "2014-01-18",
  "completed": "2014-02-14",
  "words": "28,471",
  "chapters": "4/4",
  "comments": "324",
  "kudos": "5,845",
  "bookmarks": "1,717",
  "hits": "98,421",
  "summary": "<p>Stiles is a lower-class tailor, who has always dreamed of attending the fabled, annual Hale ball. His good friend, Lord McCall, somehow managed to procure an extra invite.</p>\n<p>Stiles doesn't expect anything of the evening. He certainly doesn't expect to capture the gaze of a dark, mysterious stranger wearing a wolf mask.</p>",
  "notes": "<p>This fic was cursed. I started writing it in August, and it seemed like I just couldn't finish it, and then uuuugh, so many problems with having it beta'd. But then <a href=\"bookgeekgrrl.tumblr.com\" rel=\"nofollow\">BookGeekGrrl</a> came into my life and now everything is sunshine and rainbow sparkles and unicorns.</p>\n<p>Title from Andrew Lloyd Webber's 'Phantom of the Opera' and the song <i>'Masquerade'</i>.</p>\n<p>The story is set in the 18th century, more specifically around the 1770's. More images will be provided in the later chapter for references to the clothing style. Any mistakes I've made are my own, but because it's an AU and I want Sterek to happen, there's no major blow-out of two male characters getting together because I DO WHAT I WANT. So yeah, sorry about the inaccuracy, but Sterek.</p>\n<p>Also <a href=\"littlecofiegirl.tumblr.com\" rel=\"nofollow\">Cofie</a> drew me <a href=\"https://littlecofiegirl.tumblr.com/post/60213389720/yijitumbles-said-oh-could-i-please-maybe-ask\" rel=\"nofollow\">AN AMAZING ART!</a></p>\n<p>Thank you to all the people who have liked this story so far! It was one of my favorites to write. So much so that I plan to make this the first installment of a series of Sterek-themed Fairy Tales, which will be <a href=\"https://archiveofourown.org/series/69826\" rel=\"nofollow\">located here.</a></p>\n<p>ALSO! Have some historical costume references!</p>\n<p> </p>\n<p> <a href=\"http://i39.photobucket.com/albums/e161/Yiji/COLLAGE_zps632fe7a2.jpg\" rel=\"nofollow\">* A collage of Derek and Stiles' party outfits and masks</a><br><a href=\"http://i39.photobucket.com/albums/e161/Yiji/smithgown_zps65ff5362.jpg\" rel=\"nofollow\">* Laura's party dress (but imagine it in cream)</a><br><a href=\"http://i39.photobucket.com/albums/e161/Yiji/louisxv_zps8f05053f.jpg\" rel=\"nofollow\">* Cora's ostentatious party dress (a.k.a 'the oversized meringue cake' XD)</a></p>\n<p> </p>\n<p>In regards to adding a fourth chapter - Sorry guys! There was way too much to write to put it all into one chapter! But the last one won't be too far away, I promise!</p>\n<p>As always, come hang out with me on <a href=\"yijitumbles.tumblr.com\" rel=\"nofollow\">my Tumblr!</a></p>\n<p>Happy Valentine's Day everybody! As a special gift to all you lovely people, have the final chapter! ♥</p>\n<p>A billion thanks once again to Michele for being the best beta in the world. Ahhh, I do so love happy endings ♥</p>\n<p>As always, you can find me <a href=\"https://yijitumbles.tumblr.com\" rel=\"nofollow\">on my Tumblr</a>!</p>",
  "text": "<p> </p>\n<p> </p>\n<p>\n<br>\n</p>\n<p></p>\n<p>\n<img src=\"http://i39.photobucket.com/albums/e161/Yiji/Fic-Line-Break-Image_zps040a7dc4.jpg\" alt>\n</p>\n<p>  </p>\n<p>The narrow, two-storey house was small but well-built, with rust-coloured tiles on the roof and a thick, sturdy wooden door on the front, just on the outskirts of the town’s fabric district. Stiles had lived there all his life. His first memories were of getting underfoot upstairs as his mother baked and cooked in the evenings, tangling young limbs in the bright threads of cotton as she spun downstairs and being lulled into hypnotised silence as her nimble fingers wove fantastical beasts and delicate flowers from seemingly nothing. During the day, she would have him sit on the scrubbed wooden counter and suck on a sugar sweet as customers complimented her on her fine weaving and pretty designs, or watch, enraptured, as she fashioned masks from cardstock and cloth, and rosettes from fabric. His father, a peace officer of the town, was always gone in the mornings before he roused, but by the time the little shop had shut and the stew was almost finished bubbling on the hearth, he was home. His ruddy, worn face eased into smile lines as his large hand cupped the back of his head fondly, letting Stiles help disrobe him of his blue gendarme’s coat, wrapping both of them into his bear-like arms.</p>\n<p>Being a bluecoat didn’t pay well, and his mother’s creations, beautiful as they were, often gathered more dust on the walls of the shop than coins in her hand. Regardless of their shortcomings, what little they had was good, and, despite not having as many toys as the other children in town, Stiles was happy. His father was the absolute embodiment of heroism in his eyes, and his mother, with her soft, brown hair, tender smile and soft singing voice as she spun, the personification of gentleness. Once he was old enough to stay (mostly) out of trouble, he helped his mother dust the shelves and wax down the wooden counter downstairs, and, between absorbing his numbers and letters, learnt how his mother spoke with customers, took commissions and jobs, and exchanged coin. Under her watchful eye, he breezed through his studies much faster than anyone would have expected, and soon enough he was manning the counter, helping fill in the little booklet of orders with pencil, his handwriting choppy and nowhere near as elegant as his mother’s looped script.</p>\n<p>Some evenings, they’d sit by the hearth and his mother would attempt to teach him to spin. His fingers were quick and clever enough to handle the basics, but somehow he never quite seemed to master the delicate grace of the woven craft. One evening, his father’s work trousers came apart at the pocket seam, and Stiles found himself sitting at his mother’s knee with a needle in his hand, her patient instructions slowly guiding him through the mend. His stitches were a little wobbly and uneven at first, but soon enough the tear was mended, good as new. His father clapped him on the shoulder proudly, beaming at his work, and Stiles felt a swell of joy so great he thought his heart might just burst. </p>\n<p>He decided to apply for an apprenticeship at a local tailor when he turned seven. His mother could only teach him so much when it came to sewing, and he’d taken over the household chores of mending and darning when the need arose. His nimble fingers and thirst for knowledge delighted both his parents, even if sometimes his boredom led him to mischief, exasperating them and his neighbours with his silly antics. He’d begged and pleaded for days until she’d relented with a fond sigh, the upward curve of her lips belying the exasperated expression on her face.</p>\n<p>“A tailor is a fine profession,” his father crowed proudly as they ate supper one night, after he and his mother recounted their trip further into town to Deaton’s, an old friend of his father. It had been, by far, the most nerve-racking experience of his life, and even with being almost grown (he was <em>seven</em>!), Stiles had held his mother’s hand the entire walk there, barely speaking a word and quivering with nerves as if he were being led to the gallows. Deaton had been a good sort, a soft-spoken man with an enigmatic smile, pleased to see that, in the face of Stiles’ young age, he’d found a career path worth pursuing. He’d kindly shut his door to the outside and showed Stiles and his mother around his workshop, explaining the different cottons he used, the length and width of the needles he used, the strangely-shaped rulers with gentle curves.</p>\n<p>“Seven is a little young to be an apprentice,” he’d said, “But learning waits for no man – or youth, in this case. If you’re truly interested in taking up a vocation as a tailor, I would be more than glad to take you under my tutelage.” </p>\n<p>Thus, Stiles found himself at Deaton’s for two days a week, grasping a lunch in a folded kerchief as his mother walked him to the other man’s store early in the mornings.</p>\n<p>“I’ll miss my little man on the days when you aren’t here,” she laughed a little wistfully, patting him on the back as Stiles darted through Deaton’s doors, the chime above the entrance tinkling sweetly. He was still far too young to work on anything, or be paid, but Deaton was a patient man, and kept his childish, flighty attention focused at all times. When Stiles wasn’t running errands for him like buying buttons in the market or fetching him tools, he stood behind the man and watched with rapt attention as the older man talked while he worked, showing him how he drew the lines of the suit on fabric with tailor’s chalk, how long and spaced apart a basting stitch should be and why. He taught Stiles different types of stitches, and assigned him a square foot of calico to practice his tacks on as a sampler, which Stiles worked on diligently. His mother labelled the different stitches in pencil, and Deaton nodded approvingly when presented with the sampler. In four months, Stiles had learnt enough to be allowed to sew buttons onto cuffs and suit fronts with careful, neat stitches. Deaton wouldn’t let him do any more for the time being, but Stiles was glad enough to be of use, and for every dozen buttons he tacked on, Deaton would pay him with a copper penny.</p>\n<p>“Your work saves me a lot of time, Stiles,” Deaton would often smile at him, “And I’m confident that, within a few years, you’ll be doing far more work for me than sewing buttons. You might as well enjoy the peace while you can – I feel that you’ll soon be a very busy young man.”</p>\n<p>His mother became sick in the winter. The rosiness ever-present in her cheeks dulled to a white pallor that, despite her insistences of merely being struck with the winter chills, never seemed to get any better. Her weaving took longer and longer, until her graceful hands shook too much to do anything at all, and eventually she stopped spinning altogether. Her smiles turned into weak, watered-down imitations of what they’d once been, and her voice became watery and frail, too frail to sing and fill their house with music. Deaton was understanding beyond measure, giving Stiles as much time as he needed away from the store to help tend to her, but regardless of his ever-present care, Stiles’ mother grew wan and fragile, her hands paper-thin and almost insubstantial upon the sheets of her bed. She slept long hours with Stiles sitting at her bedside, reading book after book, sometimes aloud to her, sometimes quietly to himself, his throat too constricted to utter a single sound.</p>\n<p>While she slept, he made vegetable soups and hearty, warm stews from her recipe books to put flesh back into her bones, but her appetite was light, and often she struggled keeping food down. The lines on his father’s face deepened with worry as they ate their supper together in the evenings, the silence of the house interspersed with the occasional coughing from his parents’ room.</p>\n<p>“The medicine – it isn’t working,” Stiles murmured, pushing a carrot through his soup listlessly with his spoon.</p>\n<p>His father didn’t say anything. Stiles could read his face like an open book, though, and the sentiments <em>you’re a good son</em>, <em>I’m glad you’re here with her,</em> <em>I couldn’t do any of this without you</em>, were written plain as day on his honest countenance. They made him feel as though his efforts weren’t nearly all worthless, that perhaps things would get better.</p>\n<p>For a little while, they’d been convinced that she was beginning to recover, because she’d been eating a little more, staying awake for longer periods of time. She spoke to Stiles for hours on end about their family, how she’d met his father, how they’d gotten married under the large beech tree in the forest nearby, close to a rundown chapel. His father had taken some time off his patrols, and stayed with her night and day. It was funny, how the saying went, that a candle burned its brightest before it extinguishes.</p>\n<p>He was eight when his mother died. She slipped away during the night, his father holding her hand, a small, sincere smile on her lips. Stiles was asleep – he woke up to the sound of his father’s sobs in the next room over, and his own, little heart shattering into a thousand fragments. Stiles’ mother had burned so brightly that she’d only burned half as long.</p>\n<p>They buried her beneath the beech where his parents had married, then a small funeral plot with a half-dozen graves scattered around it, their headstones still polished and smooth. Only a handful of people came to the service, Deaton included, and his hand was a comforting weight on Stiles’ narrow shoulder.</p>\n<p>“Claudia was a gift to this world,” he murmured afterwards in his reassuring voice, while his father stood beside them, face wrecked with grief. “I’ll understand if you wish to take some time to yourself. My door is always open to you, Stiles – you’ve been by far the most enthusiastic apprentice I’ve had.”</p>\n<p>It was almost four months after his mother died before Stiles could bring himself to leave the house again. His father had returned to work after only a couple of weeks, money a necessity in their lives, and Stiles spent just about every day at Deaton’s, learning the art of tailoring under his watchful eye. He cooked and cleaned and kept the house in order, and dined with his father in the evenings. Sometimes his father had to work the occasional night shift, to cover the coin that his mother used to make with her weavings. They didn’t need to buy as much food anymore, since it was only the two of them, so they got by on his father’s income and Stiles’ infinitesimal pay.</p>\n<p>They worked, and they got on with their lives. Stiles slowly began to suture up the hole in his heart, and though neither of them were quite the same, time brought them closer together. The scar of their missing piece is always there, always present in the woven tapestries on the wall that neither of them have the heart to pack away.</p>\n<p>They lived.</p>\n<p>He was young still when his father passed, seventeen, still honing his skills at stretching fabric so the warp and weft of it are even, finding the grain and bias of cloth with his eye rather than aligning the square ruler against the selvage. He had three embroidered waistcoats, five sashes, a cassock, and more jabots than he could count under his belt, Deaton pleased enough with his skills to give him actual commissions and pay, well on his way to being a fully-qualified tailor. Tara, one of his father’s workmates, burst into Deaton’s store that fateful day, chest heaving with exertion, and told Stiles that his father had collapsed while on patrol. Deaton didn’t say a word as he ushered them both out of his shop, locking the door quickly behind them as they rushed back to Stiles’ house.</p>\n<p>According to the physician, it was his weak heart that caused him to collapse, despite Stiles’ conscientious care and fastidious conviction with eating healthy meals. He stayed at home for a week, looking after his ailing parent, and his father managed to stay awake long enough for each of them to say goodbye, to reaffirm how much they love each other.</p>\n<p>“I was always proud,” he wheezed, face ashen as he gripped Stiles’ hand in his own, hard enough for their bones to creak. Stiles only then realized how much smaller his father appeared than he remembered – always the hulking, bear-like figure with the ruddy, proud face. “You and your mother, you are the two greatest things that have happened to me in this life.”</p>\n<p>They buried his father under the beech tree, beside his mother. His father had never felt complete when she’d gone, but at least they were together again, even in death. Deaton stood beside him at the service, and Stiles, almost a man, didn’t feel ashamed at all when the tears ran freely down his face. Deaton had been named as his guardian until he finished his apprenticeship, and, even being his ward, Stiles was given the freedom to choose whether or not he wanted to continue living in his family’s home. Stiles couldn’t imagine anywhere else he’d rather be, so he stayed.</p>\n<p>He was given a month off work with pay, and Deaton practically forced him to stay away from the shop, despite Stiles feeling as though he’s taking advantage of Deaton’s abundant kindness. So Stiles mourned, broke apart, and took the time to slowly put himself and his life back together again. He cleaned the house, but didn’t throw anything of his parents’ away. He prepared to move on with his life, as usual. And when he returned to Deaton’s after a month, it was with full pay and more responsibilities than ever, seeing as Deaton was relying on him as his head-cutter and drafter now.</p>\n<p>Stiles worked, and life went on.</p>\n<p> </p>\n<p align=\"center\">. o O o .</p>\n<p> </p>\n<p> “These gloves are amazing, Stiles,” Scott gushed, tracing the embroidered vine leaves along the wrists, and, although he’d been making things for the young Lord for years, Stiles still can’t get used to the compliments directed at his work. His tailoring business is located at his house now, five years since completing his tailoring apprenticeship. He’s twenty-three, and while his business isn’t exactly booming, he’s made enough of a name for himself in town as a fine tailor with a good eye for detail, and he’s gotten a few return customers, and some exclusively requesting his skills. Lord McCall was, by far, one of his best and most loyal customers, and closest friend. Even without requesting an order, it would not be uncommon for him to visit Stiles at his shop, or for them to have meals together.</p>\n<p>“I do believe you’re sorely mistaken, Scott,” he smiled in return, sheathing his snips into his tool roll on the bench, smoothing down the fabric edges with his nimble fingertips. Despite Scott’s high status as a Lord in town, they were close friends, and at ease with each other enough to forego formalities and call each other by their given names. Scott’s mother, Melissa, was a famous physician at court, one of the few female practicing the arts of healing, and had made quite a name for their family. He was, what they called, ‘New Money’, and some looked upon that with scorn. Stiles, however, found the young Lord easier to speak to, since Scott’s attitude was more down to earth than most he knew.</p>\n<p>“Pish posh, you know you’re the only tailor I’ll pay coin to,” the other youth smiled, taking a small satchel of coin from his pocket and settling it onto the table. “I don’t care what people may think, I believe you’ve the finest stitchwork in all the country. You’re the only one I’ll trust to make my clothes now, especially when it’s so fun to stay and chat. The other tailors are so dreadfully boring compared to you,” his smile was warm and lopsided as he spoke, sincerity radiating from his honest, sweet face.</p>\n<p>“Flattery gets you everywhere,” Stiles returned, hefting the little bag of coins. His eyebrows rose higher as the coins clinked inside, and, pulling the drawstrings open, he was surprised to see a couple of gold coins settled among the silver. “Scott, this is far more than the gloves are worth. I can’t accept this payment, it’s too much.”</p>\n<p>“It’s what you <em>should</em> charge, Stiles. These gloves, the waistcoat you embroidered for me last month, everything you make is so wonderful, and it’s almost a crime at how low your prices are. Now, I won’t hear any arguments,” his hand rose between them, effectively cutting off Stiles’ retort, “Consider it a gratuity for the constant excellence of your work.”</p>\n<p>“Whatever,” Stiles scoffed back, pocketing the coins. “It’s your loss, Lord McCall. Just don’t be surprised if the prices I begin charging you are higher than usual.”</p>\n<p>“Serves me right, then,” he replied with a smile, tucking the new gloves into his belt. A few minutes of idle chatter, and then Scott was gone, off to see to some business or other, or accept another fancy invite from his busy social schedule. Tired from the hard day’s work, Stiles flipped the sign on his shop and closed the door, done for the day.</p>\n<p>It still felt strange, sometimes, working from the same downstairs studio where his mother spun and sold her works. Now the building belonged to Stiles alone, and spoke of nothing but a busy tailor. Isaac, an old friend of his, had helped him to build shelves and a cutting table for the workshop, but aside from that, all the furniture was the same from his mother’s day, including the scrubbed wooden counter at the front, and the comfortably worn, oak chair that she spent hours sitting on, weaving her fantastical designs. Scrubbing a hand over his face, Stiles spent a few minutes tidying his things away, sliding his shears back into their rightful place, righting his pincushions, needle tray and measuring tapes.</p>\n<p>Some days he felt fine, living in this house, running his own business. Deaton had taught him so much, before his retirement, that he felt confident enough in his craft to know could survive on his income. But that was also part of the problem – he could survive, yes, but he wasn’t particularly <em>living</em>. And while he was doing something he loved, it wasn’t how he’d imagined spending the rest of his days – living in his childhood home with the ghost of his parents upstairs. Stiles shrugged his shoulders offhandedly as he swept the stray threads off his worktable into the wastebasket, not wanting to waste any more thought on the subject. He supposed it could be worse – he could be stuck in a career he despised, or be out on the streets without a roof over his head. He shouldn’t really wish for anything so far out of his reach, like thrills or excitement. It wasn’t living, but it was what he had, and it would do just fine.</p>\n<p>His workspace clean, Stiles trudged upstairs to change into more comfortable clothes, perhaps bathe later, and see what he could dredge up from the pantry for supper. His mind was too weary to even think about working more on his own suit, tucked away in the work cupboard below.</p>\n<p> </p>\n<p align=\"center\">. o O o .</p>\n<p> </p>\n<p>“Come on, tell me what the matter is,” Scott urged, leaning over the counter as Stiles sketched away on paper. “You’ve been in a mood for days, ever since I commissioned that new suit off you for next month.”</p>\n<p>“It’s nothing,” Stiles waved carelessly, putting the final touches on the design with pencil before turning it around on the desk to face Scott. “How does this look?”</p>\n<p>“Perfect!” the young Lord enthused, his face lit up with a grin as he virtually gushed over the design. “This is absolutely brilliant – you’re sure that you’ll have this done by then?”</p>\n<p>“It’ll be a bit of a stretch, especially if I have any other orders coming in, but I’m sure I could do it.” To be perfectly honest with himself, Stiles hadn't received any new orders yet, but he knew the end of the month was a special occasion – the Hale family’s annual ball, and he’d soon be swamped with orders for embroidered kerchiefs, sashes, almost anything, really. His embroidery was fine and in demand at this time, but even he knew that he’d be piling on too much work on his plate. Still, it’d be a welcome distraction from the event itself.</p>\n<p>“Stiles – this is an <em>incredibly important</em> suit – I’ll – I’ll pay your wages for the entire month until it’s finished!” Scott leaned forward and grabbed his hands between his own, his face intent. “If you take nobody else’s orders but my own, it’ll definitely get done, right?”</p>\n<p>“You can’t ask that of me, Scott!” he replied, his face slack with shock. “You – you’re suggesting I literally close my door to everybody else until <em>after</em> the ball? Do you know how much that’ll cost you in earnings? You’re mad.”</p>\n<p>“I don’t care,” Scott argued back, the grip on his hands tightening. “I’m prepared to pay you whatever you want, as long as this gets done. It’s <em>vital</em>.”</p>\n<p>“What’s so significant about this suit in particular?” Stiles probed with an inquisitorial raise of his eyebrow. “You seem awfully fixated on it.”</p>\n<p>“It’s – argh!” The other youth stepped back, running a hand nervously through his close-cropped curls. He cast his gaze around suspiciously, as if to seek out eavesdroppers. “Alright – look, you know Allison, right?”</p>\n<p>“You mean Lady Argent? The same Lady Argent that you’ve been hopelessly smitten for since she moved to the capital a few years ago? The same Lady whom you wax poetic over every single time you come in for a fitting?” Stiles grinned conspiratorially, leaning his elbows down on the wooden counter. “I’m fairly sure I’ve heard every poetic synonym describing the flowing texture of her hair, rosy hue of her cheeks, and the most charming, coquettish dimples known to man.” He scratched a blunt nail against the wood, loosening a spot of grit. “If I recall correctly, she’d been accepting an awful lot of invitations from you for outings and suppers and rides. Is there anything wrong? Are you in the metaphorical doghouse and need to dig yourself out, my friend?”</p>\n<p>“Quite the opposite,” Scott sighed, his face turning dreamy and wistful. “I recently visited her father and asked for her hand in marriage – I plan to propose at the ball, when we have a few moments to ourselves.”</p>\n<p>“That’s wonderful! It’s no wonder you want everything perfect. I promise you the suit will get done, and to the best of my abilities.”</p>\n<p>“Thank you – oh, <em>thank you</em>, Stiles! You have no idea how much this means to me.” Scott came around the bench and grasped his shoulder firmly, pulling him into an embrace which Stiles warmly returned, if somewhat awkwardly before Scott pulled back, looking him hard in the eye. “I want no expense spared for this – use whatever you need, I’ll be more than happy to spare the coin. And I meant what I said, I’ll pay your income until the ball.”</p>\n<p>“It’s really not necess-” he began, but was once again hushed. Well – it seemed that Lord McCall was not one to argue against.</p>\n<p> </p>\n<p align=\"center\">. o O o .</p>\n<p> </p>\n<p>“Mother, please,” Derek grumbled with exasperation, stirring sugar into his tea over breakfast. “Is the ball really necessary this year? We have one hosted every single Spring, surely skipping one year wouldn’t do any harm.”</p>\n<p>“Of <em>course</em> it’d do harm, Der,” Cora rolled her eyes at him from across the table, “People expect it of the family. It’s kind of a big deal in the town now – I know for a fact that people look forward to it almost immediately after it ends, and spend the entire year in preparation for it. Anybody would give their eye teeth for an invite.”</p>\n<p>“It’s just a stupid party,” Derek insisted, leaning back in his chair and pushing up the sleeves on his riding coat, snug against his forearms, powerful and strong from years of outdoor activities. “There are more pressing things to focus on than a mere night of frivolity. Like the-”</p>\n<p>“-The stable roof being re-shingled, yes, like we haven’t heard that a thousand times before,” Cora snipped back with irritation. “All you ever care about is those stupid horses of yours, and going out on your silly hunting adventures and gallivanting around the fields like a peasant, with muddied clothes and unpolished boots.”</p>\n<p>“Derek, my darling, the roof is going to be fixed later in the week,” his mother smiled from the other end of the breakfast counter, smiling as she sliced a fried tomato. “And Cora, my dove, please don’t belittle your brother’s pastimes.”</p>\n<p>“Just because I don’t lather myself in perfume and swan around in frills like a ninny,” Derek whispered back hotly, feeling his ears burn.</p>\n<p>“Both of you calm down, you’re behaving like absolute children” Laura, the eldest, chided, eyes never straying from the book she was reading avidly, perched between her plate and a glass of sweet juice. “Derek, you’re not missing this year’s party, and that’s final. Cora is still a little tender from discovering this morning that Lord Everett won’t be attending,” and Derek smirked meanly over his plate at his younger sister, who speared her eggs with enough vindictive force to practically bend the tines of her fork, “But I think an evening amongst other members of the court will do the both of you some good. Perhaps the two of you might even learn to relax a little.”</p>\n<p>“Well put, dear,” Talia nodded her head, pleased. Derek took a bite from his buttered bread and used his entire reserve of willpower not to roll his eyes at the matriarchal disposition of his family.</p>\n<p> </p>\n<p align=\"center\">. o O o .</p>\n<p> </p>\n<p>It was a fortnight before the ball, and Stiles had worked tirelessly to make his best customer (and friend) the finest suit he could. And, true to his word, Scott visited every second or third day to check on the process, and paid him far more than he would earn, even if he were inundated with other orders. This unexpected freedom gave him plenty of time to focus on the details of Scott’s waistcoat, to get the braiding trim sewn perfectly and get each and every detail perfect. And, working his own hours, he even managed to work on his own project in the evenings. It was at the two-week-prior mark when Scott came in for another fitting that he noticed something was amiss.</p>\n<p>“Whatever could be the matter, my friend?” the young Lord inquired as Stiles tugged a panel of the coat snug, pinning it down to follow the smooth curve of Scott’s back, now that he was wearing the waistcoat underneath.</p>\n<p>“Don’t know what you could mean,” Stiles lied through his teeth, wincing as he missed the pincushion strapped to his wrist completely and dug the sharp pin into his own skin. He quickly stepped back and peeled the pinned jacket off, not meeting Scott’s eyes, but the other youth followed him to the worktable without hesitation, leaning a hip against the counter and crossing his arms.</p>\n<p>“I’ve known you long enough now to see when something’s troubling you. It started the instant I mentioned the new suit, and the closer we get to it, the more miserable you’ve become. Out with it.”</p>\n<p>“I’ve always wanted to go to the damn ball,” Stiles spoke out all at once, his words virtually jumbling in their haste to fall from his mouth. He looked up and stared, horror-struck, at Scott, who only looked back with mild amusement.</p>\n<p>“Well, I don’t see why you can’t go. Surely you’ve a suit, right?”</p>\n<p>“It’s not that simple, Scott,” he returned, his voice exasperated. “It’s not just about having a <em>suit</em>.”</p>\n<p>“But you do have one, yes?”</p>\n<p>“<em>Yes</em>! I mean – almost.”</p>\n<p>“Almost? How can you almost have a suit?”</p>\n<p>Sighing, Stiles crossed the room and opened the cupboard, wheeling out one of his dress forms, the one he’d adjusted to his size. His suit was still half-finished, hanging off the mannequin.</p>\n<p>“Stiles -” Scott breathed, stepping closer to examine it. Stiles couldn’t help but feel the warm swell of pride – even half-finished, it was his best work yet.</p>\n<p>“I’ve – I’ve always wanted to attend the Hale annual ball,” he spoke quietly, touching fingertips to the russet fabric of the sleeve. “Ever since I was a child. I’d see the bright lights of the party on the hilltop through my window, and once I even saw the fireworks. It was – it was pretty spectacular. I’d always dreamed of what the parties would be like – the music, the dancing. Everything just sounded so grand, so ostentatious.” He ducked his head down, smiling self-consciously, slightly self-deprecating. “Every once in a while, I had a few extra coins – I’d save my earnings and buy a little extra fabric, an extra yard or two of lace or braiding. And I’d work on this suit in the hopes that one day, maybe, I’d be able to attend.”</p>\n<p>“So why don’t you, then?” the other asked, eyebrows furrowed.</p>\n<p>“Be<em>cause</em>, Scott,” Stiles sighed with vexation, “Not everybody with a nice set of clothes can attend. The Hales are one of the city’s oldest, wealthiest families, and their parties are legendary. Only the <em>crème de la crème</em> are invited.” He crossed his arms and scowled at the floor. “I doubt they’d be thrilled to find a lowly tailor in their midst.”</p>\n<p>“This is perfect, though!” Scott said excitedly, clapping a hand on his shoulder. “This year it’s a masquerade ball – everyone will be masked. If you attend and wear a mask, nobody will know who you are.”</p>\n<p>“But you still need an invite to go,” Stiles countered, still feeling dejected.</p>\n<p>“I have an invite, Stiles.”</p>\n<p>“Don’t remind me, please.”</p>\n<p>“No, you’re missing the point. <em>I </em>have an invite. And Allison will be there already. I happen to have a faraway member of my family who’s just come down for a few days to visit. It’d be a shame to leave him home alone on such a wondrous night.”</p>\n<p>“And what does this have to do with me?” he replied, a little sharply – it was bad enough to know he couldn’t attend, but to have to hear another man uncaringly go alongside his friend? He couldn’t bear to think of it.</p>\n<p>“More thank you know, Stiles,” Scott winked, grinning wide. “You see, he’s from very, <em>very</em> far away. Nobody really knows him. And he’s returning home right after the ball, I’m afraid. But he’s an ever so wonderful friend of mine. All he needs to worry about is having his suit finished in time.” And he turned slightly, nodding to the half-finished garment hanging on the mannequin. Stiles balked, mouth opening and closing wordlessly for long moments, before he felt well enough to speak again.</p>\n<p>“Surely you – Scott! I couldn’t ask you for such a thing!”</p>\n<p>“Why not?”</p>\n<p>“Because – <em>because</em>! You’ve already done so much for me – not just in the past month, by paying me more coin than necessary to work on your clothes, but ever since I first opened my shop. You’ve been my best customer, and I couldn’t ask this of you, I just couldn’t.”</p>\n<p>“Stiles, you’re my friend.” Scott spoke earnestly, laying both hands on Stiles’ shoulders, meeting his eyes square-on. “Since mother earned her title, since we’ve moved into the estate – you’ve been the only true friend I’ve had in a long time. Let me finish,” he interrupted Stiles before he could get a word out of his mouth, already wanting to argue back, “This is important to you. And it’s nothing at all for me to make room in the carriage for you, too. And besides – I’d be a terrible mess of nerves before asking Allison to marry me. I could really use the moral support.” </p>\n<p>“So – technically, you’re just taking advantage of my dream to bring me along as encouragement, right?” Stiles quipped, his smile lopsided and a little hopeful.</p>\n<p>“Right in one, my friend. Now – I suggest we finish up here quickly, and then figure out something to eat. I’m starved.”</p>\n<p> </p>\n<p align=\"center\">. o O o .</p>\n<p> </p>\n<p>“You’re not looking very happy,” Laura observed, sitting in one of the delicate chintz chairs of the sitting room as Derek tramped through the hallway, “Our esteemed head butler would pitch a right fit if he caught you traipsing mud through his spotless floors.”</p>\n<p>“Harris be damned!” Derek hissed back, tugging the scarf from around his neck with force, balling it up between his hands and creasing the delicate silk. “To hell with all of them!”</p>\n<p>“Alright. Enough is enough, Derek, there’s no need for such language.” Laura retorted, her tone stern enough to startle the fight out of him. He deflated immediately, crossing the room and collapsing into the chair beside hers. To her credit, Laura placed her bookmark delicately between the dog-eared pages and set the leather-bound hardback aside, before leaning over and folding her delicate hand over his calloused one. “Now,” she said in a much gentler, coaxing tone, “Will you tell me what’s upset you so? You only ever ride that hard when something’s truly bothering you.” She indicated with a nod of her head at Derek’s mud-splattered riding boots, threadbare breeches and shirt and plain homespun tunic, what Cora kept dubbing his ‘peasant garb’.</p>\n<p>“It’s this accursed ball,” Derek groused, glad that his eldest sister was completely uncaring of the state of his dress, or the dirt caking his skin – she’d always been more level-headed and practical than Cora, who, in the last few years had developed virtually an obsession with parties, dresses and invites. “Everywhere I turn, I keep seeing reminders of it coming. You know how much I dread going to the blasted thing. Every year, it’s always the same – making boring conversations about hairstyles, dances, court life. It’s just so – <em>ugh</em>.”</p>\n<p>“I take it you received Lady Argent’s invite for the picnic, then?” Laura pried, and Derek flinched because she always knew just what bothered him, and never shied away from cutting to the quick of the issue.</p>\n<p>“How do you know about that?”</p>\n<p>“Oh, please, little brother,” she scoffed, waving a hand dismissively. “Like you don’t know who sorts through the mail in the mornings. I can recognise that stationery anywhere, not to mention the Argent’s wax seal on the invite. And you <em>have </em>been getting more of them as of late.”</p>\n<p>“Only from <em>her</em>,” Derek’s lip curled in distaste, “And I’m almost certain that the only reason I’ve stopped receiving any invites from anybody else is because she frightens the living daylights out of them.”</p>\n<p>“Most people would consider such a – <em>confident</em> woman attractive. You know – self-assured and assertive enough to go after something she wants.”</p>\n<p>“She’s frightful, that’s what she is.” Derek shook his head. “I’ve never encountered a woman like her in my life, and that’s not a compliment, Laur. She honest to goodness frightens me. Every time I see her, she’s staring at me as if I’m a trophy to be won – and not in a good way, though, I say trophy as in ‘<em>mount me on a wooden plaque and hang me above her family’s fireplace</em>’ type of trophy. It’s getting more and more difficult not to shudder in her presence.”</p>\n<p>“Cheer up, Der,” Laura pushed on, “You know mother hosts these balls in the hopes of either you or Cora finding someone. That’s how she found father, after all, and fell in blissful, divine love. And it is how I met Steven.”</p>\n<p>“But unlike me, Cora <em>likes</em> the parties,” Derek insisted doggedly. “Heaven knows why, but she does. She revels in getting dresses made, and powdering herself up like a doll, and swanning around the floor with her suitors. In all honesty, I think she’s hoping to find herself a husband at the dance, though I’m certain he’ll be as foppish and materialistic as she.”</p>\n<p>“You can’t say that,” his sister chided, though a playful grin tugged at her lips as she silently agreed on the materialistic vanity of their youngest sibling. “Steven and I met two years ago, and we seem to be doing alright – even our engagement hasn’t seemed to dampen our enjoyment of one another’s company.”</p>\n<p>“That’s because you two are practically soulmates.” He huffed out a breath, trying not to feel the stab of jealousy. “You’re not like the other women in the court – you don’t powder your hair or wear wigs, you don’t care about dresses or jewellery or makeup. You don’t believe water is <em>unhygienic </em>and drown yourself in perfume instead to block out the rancid smell of body odour.”</p>\n<p>“I’d love to know who spread that rumour and throttle them,” Laura giggled helplessly behind her hand.</p>\n<p>“And you <em>read</em> and hold conversations about <em>interesting things</em>,” Derek pressed on, trying not to think of how his voice was taking on a distinctive whine. “And Steven is an author and cares more about what’s in your head than what’s draped over your shoulders. I’ve seen you two prattle on for hours about everything. I’m just – alright, alright, I’m envious of you and your fiancé. I want to find someone like that too, not just be pushed into a sham of a marriage just because we’re second-cousins to the King, and the connection looks good on the family tree.”</p>\n<p>“I’m sure you’ll find someone who’s right for you, Derek. Mother and father wouldn’t expect you to settle for anyone less,” Laura patted his arm consolingly. Derek nodded back without enthusiasm, quick to rise from his chair and make a hasty retreat to his rooms when Harris’ outraged screech at the state of the floors rang through the corridors.</p>\n<p> </p>\n<p align=\"center\">. o O o .</p>\n<p> </p>\n<p>Stiles sewed like a man possessed. Scott’s suit was done in record time, and he spent hours in the evenings working on his own suit. The base outfit was finished, but his fastidious nature wouldn’t let it be. The day before the ball, Scott was over, whistling through his teeth in appreciation of his suit.</p>\n<p>“This is, by far, the most exquisite thing I’ve ever seen you make, Stiles.” He ran his hands reverently over his new outfit, tracing along the navy blue silk and gold braiding.</p>\n<p>“Glad you think so. It’s cost you enough.”</p>\n<p>“I would gladly pay twice the amount for something like this. I could honestly see myself being married in such a suit – even buried. But let me see your ensemble, now! It is finished, right?”</p>\n<p>With a flourish, Stiles brought out the dress form, with his suit hanging completed from its shape. It had been an effort and a half, that was for sure, long evenings after the store had closed spent carefully working by lamplight to get the details just right. As it was, Stiles couldn’t have been any prouder. It was truly a marvellous creation – the silk had been costly, and it had been so hard to justify buying something like that for himself. But, honestly, Stiles was a man with few needs, and aside from the occasional treat, he’s never really indulged in anything that wasn’t essential. It was almost a God-given blessing that Scott had requested to ignore all other customers’ orders, because there was no conceivable way he would have been able to finish both their suits <em>and </em>whatever other orders might have come his way.</p>\n<p>“Alright – I take the sentiment back,” Scott whistled, impressed. “<em>This</em> is the most exquisite thing I’ve ever seen. Look at this – Stiles. This is superb.” His eyes roved over the embroidery with admiration, taking in the delicate needlework of autumn-coloured foliage. “The amount of detail in this – Stiles, this is something the Royal Family itself would have in their wardrobes.” </p>\n<p>“Flattery gets you everywhere, Scott,” the tailor reproached playfully, clapping a hand on his shoulder. “Though I’m not going to lie, this is my pride and joy. What do you think – is it worthy of the Hale ball?”</p>\n<p>“More than!” his friend responded with keenness. “I cannot wait for tomorrow evening – Mother is letting me use the good carriage for the night, you know the one, with black panelling and brass fixtures. It’ll be quite a sight. I’ve even picked up a mask for it downtown, look-” He tore open the wrapped parcel on the counter to reveal the handsome visage of a hunting hound, made to the same midnight-blue colour as his suit. “I’m sure Allison will go as a bird – she’s graceful and light as one. I thought it’d be perfect, considering how I plan to ask to capture her hand.”</p>\n<p>“Clever,” Stiles remarked, smirking.</p>\n<p>“Do you have a mask too? It is a masquerade, after all – we could always go down to the same store I bought mine at and get you one.”</p>\n<p>“I – yes. I do have one.” He went back to the cupboard and pulled out a mask of his own – it had been kept in one of the cupboards upstairs for years, a relic from his mother’s crafting days that hadn't sold, and something he now treasured. It was a fox mask, made of papier-mâché and glue, one of the few that she’d made that were animals rather than the handsome, androgynous faces that were so popular in Europe. The playful reddish tint picked up on the subtle hints of the same colour in the embroidery, ending in a pointed snout and clever, perked ears, decorated with gilded swirls. His mother had always called him a clever little fox, and the rich, autumnal colours were his favourite. It seemed only right to carry a little piece of her to his dreams, even if it was only for one evening.</p>\n<p>“Fantastic – we’re all set!” Scott packed his own mask away excitedly, hastily re-wrapping the parcel. “I’ll come by tomorrow afternoon, and we can dress together and eat something quick before we go – I hate going to events on an empty stomach, you never know what they’ll serve there. I’ll tell the coachman to pick us up at sundown, just as the party’s started, so we can get there on time but not be <em>too</em> early, you know what I mean? Allison said she’d be there at that time too – oh, but we need to return the carriage to my mother’s just before one in the morning.”</p>\n<p>“Midnight? Isn’t that a little early?” Stiles inquired, brows rising. “I’ve seen the lights on at the mansion well into the early hours of the morning.”</p>\n<p>“What can I say, mother wants the carriage back in one piece.” The young Lord gave a noncommittal shrug. “Still, it’ll give us a solid few good hours there, and if we leave by midnight, I can get you dropped off back here, and have the carriage back at our place on time.”</p>\n<p>“Sounds perfect,” he grinned in reply, the excitement already causing his chest to flutter.</p>\n<p> </p>\n<p align=\"center\">. o O o .</p>\n<p> </p>\n<p>“I can’t believe I’m doing this,” Derek muttered, standing awkwardly in front of the mirrors in the dressing room as the head tailor tugged the edge of his suit down, muttering approvingly as he smoothed the lines over his broad shoulders. Their mother had hired him and a squad of assistants from the capital, on loan from their royal cousins (and hadn't Cora practically <em>shrieked </em>with glee) to make their outfits for their party. And here he was, the day before the big event, making sure the final fitting for his clothes was done. Granted, it was far nicer than anything else he had in his wardrobe, but it still felt oppressive and excessive, compared to what he usually wore.</p>\n<p>“Cheer up, Derek,” Laura sighed, breath hitching as a seamstress gave another hard tug onto her corset, almost causing her to fall over. “A-at least you’re not getting your organs compressed into pâté over there. Goodness – this dress is so heavy, I feel like I’m toting an ox-cart around on my hips.” She winced as the plump dresser <em>wedged her knee into the small of her back</em>, <em>how was that even safe</em>, and yanked on the corset strings hard enough to elicit another wheezy yelp.</p>\n<p>Derek had to agree that at least he got off lucky on the dress department, watching Laura scrabble uselessly at the back of one of the room’s chairs as the older seamstress tugged her dress on. She always preferred the comfortable, simple cotton day dresses without corsetry or stomachers (every female in their family was naturally slight of frame)- however, it seemed that this year’s fashion dictated an even more rigid silhouette. Derek was glad that at least he could move comfortably enough, without fear of knocking a table over with the edge of an enormous hooped skirt. He refrained from mentioning how absurd the wide skirts were, at least to Laura – she was his favourite sister, after all.</p>\n<p>“You’re just unused to the higher fashions of the capital,” Cora sniffed primly on his other side, turning this way and that to admire herself in the mirror. While Laura’s new dress, though much larger in size to her regular ones, seemed to match her easy-going personality, Cora’s was entirely on the other end of the spectrum. Unlike Laura’s cream-coloured floral gown, his younger sister’s was bedecked in ribbons and lace, rosettes and flounces gathering up multitudes of ruched panelling. Her hoop was much wider than Laura’s (he guessed the fashion implied that bigger was, supposedly, better), and the searing combination of salmon-pink, ice-blue and silver of the layers, covered in embroidered flowers, made his eyes hurt. Cora seemed to adore it, though, cooing with glee as she smoothed down the ruffled lace of her sleeves.</p>\n<p>“You look like an oversized meringue cake,” he commented snidely, watching her preen. At least Laura still retained a vaguely humanoid shape.</p>\n<p>“It’s called <em>fashion</em>, Derek, something you wouldn’t know if it bit you on the backside,” Cora returned just as nastily, trying to decide between two seemingly identical hairpieces bedecked with lace, silk flowers and miniature birds. “At least I’m not stuck looking like a pompous idiot all my life, unlike <em>some</em>.”</p>\n<p>Their sniping argument was abruptly cut short by a loud crash, and they both leaned over to see Laura crumpled to the ground, her billowing skirts up around her ears as she scowled, seeming decidedly put-out.</p>\n<p>“Didn’t realize fashion didn’t make room for breathing <em>or</em> moving,” she muttered darkly, trying to pick herself up off the floor and failing, coming across less regal and more like an upturned turtle. Derek chuckled, raised his eyes heavenwards and prayed with every ounce of faith he’d been brought up to have that his sister’s fiancé would never, <em>ever </em>let someone like her go. And, while he was at it, he also threw in a prayer or two for the accursed evening to pass without incident.</p>\n<p> </p>\n<p align=\"center\">. o O o .</p>\n<p> </p>\n<p>It felt as though Stiles had hardly a wink of sleep before he was up the next morning, setting the shop in order. He was closed for the day, a gift to himself for stretching his work hours so far out to get his suit done. Nevertheless, time seemed to both crawl and fly by. One moment he was breaking his fast, foot tapping nervously against the skirting board as he surveyed the chaos that had turned his usually tidy workshop into a sty, and the next he was tidying with a mad fervour, shoving scraps of useless silk in the trash bin and sweeping loose threads into the dustpan. And suddenly the morning was gone, and though the workshop was a sight cleaner than before, Stiles needed to get clean and ready because <em>heaven’s above, he was going to the Hale ball.</em></p>\n<p>The very first thing Stiles did was draw a bath from the pump behind the house, because his parents had always been sticklers for cleanliness, and he couldn’t imagine putting on his brand new suit while smelling of exertion and sweat. He scrubbed his skin almost raw, used more soap than he ever had at one time in his life, and by the time dusk was falling, his suit was laid out, ready to put on, his shoes were polished to a shine bordering on absurd, his hair was dry, combed, and as styled as it was ever going to be (and it was behaving itself quite admirably, considering he didn’t have a powdered periwig). His hair was, indeed, cropped too short for the fashion, but he supposed that it’d have to do, and regardless, Lord Scott’s hair was only slightly longer than his, so he doubted that he’d be the only one wearing his natural hair.</p>\n<p>Scott came over soon after, bringing with him a large plate of sliced meat and a crusty loaf of bread (“The cooks wouldn’t let me leave without food, it’s like they don’t seem to realize I eat <em>all the time,</em>”), and they spent the better part of an hour raiding the cupboards for condiments and putting together increasingly large towers of food. It was a fantastic way to begin an evening, and the mood was light-hearted and jovial as they helped each other to dress. Scott was incredibly low-maintenance and actually knew how to dress on his own, something Stiles had hardly ever witnessed a noble do, and even helped him tie the sash across his own suit. All too soon, they piled into Scott’s awaiting carriage, on their way to the Hale manor for the ball.</p>\n<p>Stiles felt – well, the entire lead up to this day felt exciting, but he found himself an erratic, jumbling bundle of nerves. He could feel his palms sweating beneath the fine linen of his embroidered gloves, and was glad for the mask perched upon his face, because while it was easy to return the excitable grin of his noble friend beside him, he was starting to regret eating that third sandwich. Everything felt a little bizarre, from the velvet of the cushions underneath him, to the echoing clop of the horses’ hooves as they trotted merrily down the cobbled streets. Stiles mentally gave up a prayer of thanks that the evening was still a little cool, because had it been any warmer he would have sweated his body weight through with nerves.</p>\n<p>All too soon, they arrived at the manor, and it took all of his willpower not to peek through the curtained windows to ogle the lush grounds like a commoner. There’d be plenty of time to take in the sights afterwards, he simply had to make sure he didn’t frighten himself before arriving at the courtyard, and lose his wits altogether. Scott, who had spent the ride animatedly rehearsing the speech with which he planned to woo his bride-to-be, seemed to be no less enthused as the coachman opened the door of the carriage, despite looking slightly green around the gills. It comforted Stiles a little to know that even nobles sometimes felt a rush of anxiety before an event, and, reassured that he wasn’t the only one that felt as though he were walking into the mouth of Hell itself, gave his friend a solid squeeze on the shoulder.</p>\n<p>“After you, my Lord,” he smirked, rewarded with a playful shove back as Scott pushed him towards the door first. It was a feat of agility in itself that he managed to climb out of the carriage with his long legs in a fashion graceful enough to not snap his neck in twain.</p>\n<p> </p>\n<p align=\"center\">. o O o .</p>\n<p> </p>\n<p>“It feels even more oppressive than usual,” Derek murmured to his eldest sister as the party, now in full swing, went on around them. Beside him, tucked away in the corner of the ballroom, Laura looked almost equally as miserable as he. She was clutching a crystal champagne flute and appearing pale behind her half mask, a simple façade of silk and cream ribbon. It contrasted beautifully with her dark hair and crimson lips, the only cosmetic she’d deigned to wear for the night.</p>\n<p>“I’m glad for the masks, though,” she replied, “If I had to hear one more time about the Hale daughters and their ‘natural handsomeness free from powders’, I would have screamed.” She took a mouthful of the sparkling wine and sighed. “Cora seems to be enjoying herself, though.” She gestured with a gloved hand at their sister, laughing and merrily spinning on the dance floor with a handsome youth, glittering and dazzling like a butterfly.</p>\n<p>“I suppose I can’t judge her for it,” Derek observed, looking put out. “She was right about what she said this morning over breakfast. I don’t know how to have any fun.”</p>\n<p>“Oh, she’s just being petty. I think you’re plenty of fun, Der. Who else am I supposed to talk to about my views on women in society? Who else is going to indulge me when I decide to wax poetic about the latest paperback that father brought back from his travels? You’re plenty of fun, it’s just – society right now seems interested in a – a <em>different</em> sort of fun from ours. One that’s a little less intellectual and a little more-”</p>\n<p>“Narcissistic?”</p>\n<p>“I was <em>going </em>to say flighty,” she admonished, hiding a smile behind her hand, “But perhaps you’re right in more ways that others would care to admit. Still – you’re a lovely young man, little brother. You simply have to find someone who will look past your-” She gestured at his brooding face, covered by the sullen countenance of a half-face wolf mask, “-your ruminating mien.”</p>\n<p>“My ‘<em>ruminating mien’</em>? You mean to say my perpetually affixed scowl, if you wish to borrow Cora’s words.” </p>\n<p>“I wish to do no such thing. Now, I think I see Chancellor Barry over there, he and I were supposed to talk about father’s donation to support one of the new colleges in town.” She set her empty flute down on a passing waiter’s tray and straightened her gloves. “I’m giving you fair warning that Lady Argent is here with her young niece, and last I heard they had split up. Apparently, Lady Allison is searching for one of her suitors in particular. If you’re attempting to avoid the other, she’s wearing a ghastly violet gown with black trim, and has a black mask with red stones on the front.”</p>\n<p>“You’re a real gem, Laura,” he sighed gratefully, picking up a glass of wine for his own from a passing tray and cradling it between his fingers.</p>\n<p>“I know, I know. Now, attempt to make at least two conversations before I return, and if we’ve both had enough by then, we can call it a night and tell mother we tried.”</p>\n<p>“Deal.”</p>\n<p>“Lord McCall and family, from Beacon Hall!” came the shout from the herald as he and Scott stepped across the threshold of the palatial mansion. Stiles already began to feel slightly ill – he knew that it would take some time to get adjusted to the <em>idea</em> that he was here, but now that he was, everything seemed so much more daunting as he was experiencing it. It felt like a mad rush, and, as they made their way through the lantern-lined entryway and inside, Stiles became completely and utterly overwhelmed. The Hale manor was resplendent with candle-lit crystal chandeliers, casting the expansive ballroom in a glittering shower of flickering light. The walls, covered in dainty gold filigree, cast the luminosity back, which caught off the jewels and shiny buttons of the people inside, chatting on the sidelines or twirling in the middle of the marbled floor to fast-paced, tinkling music from the stringed ensemble on the dais. Long tables were stretched out between the floor-to-ceiling glass doors open to the brisk night air outside, covered in lace cloths and piles high with ornate sweetmeats and dainty, appetising food.</p>\n<p>And the people! Stiles stood stock-still for a long moment, mesmerised at the sight as if from a dream. Never before had he seen so many lavish gowns and suits in one place, the women exquisite as exotic birds, flitting about daintily as the patterned silks of their dresses swished with rich sounds about them. The men wore both suits and the heavier cassocks, their braid and embroidery glinting in the luminosity of the night as they strutted in heels and boots, stately and proud as capons. The masks on their faces completed the look, some animals and fantastical beasts, some the genderless faces so popular in Italy and Venice. If Stiles hadn't known he was awake and in that room, he would have had no misgivings in thinking it was all part of a magnificent dream.</p>\n<p>“I see her! I see her, Stiles, look!” Scott spoke from beside him all of a sudden, pushing on his shoulder and gesturing to the far corner. Indeed, at one end of a table stood a lovely young lady in an emerald-coloured dress, with a feathered mask on her delicately-featured face. Stiles was more than a little impressed that his friend had been able to recognise his lady-love from an entire roomful of <em>masked</em> people, but then again, not much had been crossing the young Lord’s mind as of late aside from thoughts of her.</p>\n<p>“Go on, then,” he urged, jerking his chin towards her direction.</p>\n<p>“But what about you? We just arrived, I can’t leave you on your own!”</p>\n<p>“Scott, tonight is important for both of us, I completely agree,” he held his hands out, palm downwards in a placating gesture, “But this moment is far more important for you than I. Not to mention I’ll have to be the one to hear about it for the rest of my days if it doesn’t happen. Go forth and conquer, my friend, I’ll be fine.”</p>\n<p>“You’re sure?” Scott looked sheepish, which, in turn, made his face, in addition to the mask, look even more adorably chastened than normal.</p>\n<p>“I’m positive. Now, best of luck,” he clapped him on the back heartily, meaning every word, “And if I don’t see you for a while, I’ll see you outside at the carriage at midnight.”</p>\n<p>“Alright. The Hales have a grandfather clock that strikes the hour very loudly, so no doubt both of us will hear it. I’ll see you soon – enjoy the party!”</p>\n<p>“Try not to make a fool of yourself in the meantime!” he laughed, only to be met with the hastily retreating back of his friend. He sighed, squared his shoulder and stepped out into the glittering room.</p>\n<p> </p>\n<p align=\"center\">. o O o .</p>\n<p align=\"center\"> </p>\n<p>Derek had been at the party for almost two hours, and he still hadn't found anything worth staying for. He’d carefully avoided Lady Argent as he saw her making her rounds of the dance floor searching for someone (he’d bet his finest horse it was him), and had followed Laura’s advice to attempt conversation with other people. A good twenty minutes were wasted with Lord Hiferth in discussing his mother’s choice of canapés and music. Derek had (foolishly) thought that perhaps he’d be able to spend a lot more of his time with young Lord Guilford, as he was as much of a riding enthusiast as anybody he’d met. But alas, it was not meant to be – they’d discussed at great lengths the better makers of stirrups and bridles, but his (slightly too young to be proper) wife had pulled him away to discuss politics with a few of her friends, and there was no chance that Derek would even <em>venture</em> into that subject, not with his forthright manner of speaking.</p>\n<p>Laura had finished speaking with the Chancellor, but, as luck would have it, her fiancé had returned early from his trip and had come to the party to surprise her. The three of them had talked at great lengths about the latest English translation of Antoine Galland’s <em>One Thousand and One Nights</em>, of which he’d been an avid reader, and had finally, mercifully, been able to contribute to the conversation with. But then Steven had brought up Oliver Goldsmith’s latest work, <em>The Vicar of Wakefield</em>, and the two of them were off, speaking at an excited, hurried pace about the different interpolations of literary genres within. Laura was scathing in the way the book was written as a fictitious memoir, and Derek was well and truly lost by then. Steven was looking at Laura in a way that was completely besotted and (in his opinion) slightly nauseating, so he graciously stepped back and left the two love birds at it.</p>\n<p>Thank goodness he had eaten dinner beforehand, he mused, because he was picking up his second glass of wine from a waiter’s tray, and, had he come here with an empty stomach, he would be well and truly gone by the end of the night. Well, at the rate he was going, anyhow. He scanned the crowd again, hoping to find a familiar face to converse with (a little more difficult, considering everyone was wearing masks) when something caught his attention and held it. A young man, skirting the edges of the room as if trying to keep all attention away from him, clad in a russet, silk suit and a fox mask. Everybody seemed not to notice him, but something about the youth’s posture, the way he carried himself, the manner in which he cradled the champagne flute between his gloved fingers, seemed to transfix the entirety of Derek’s awareness.</p>\n<p>Without realizing it, Derek was following him avidly with his eyes, taking note of how he moved – a little hesitantly, as if he didn’t quite belong, but with an odd sort of grace. His body was lean, but firm, shoulders broad and waist slender, a charming silhouette only emphasised by the excellent cut of his suit. It wasn’t the most fashionable garment in the room, not when many had tailors employed by the King, but from halfway across the room it looked splendid. He found his body slowly gravitating towards the youth, gradually and unhurriedly, watching fervently as the other seemed content to sip at his champagne slowly and watch the other partygoers dance.</p>\n<p>Before he knew it, he was standing beside the young man, and Derek was glad for the mask, because somehow his pulse was beating loudly enough in his ears to be heard over the music. From this distance, he could see the other’s coat, which was simply cut, as he’d first thought, but delicately embroidered with autumn leaves, matching what appeared to be a large beech tree emblazoned in needlepoint on the waistcoat underneath. Paired with the gilded fox mask, he wouldn’t have been surprised to learn the young man was some sort of enrapturing woodland nymph, or an entrancing <em>jinn</em> from <em>Arabian Nights</em>. The youth turned his face towards him, first looking at his hand clasped around his glass, and then dragging slowly upwards until their eyes met. He didn’t say anything at first, seemingly dumbfounded, and then, as if remembering his manners, the corners of his lips drew up a little. Derek would swear on any religious book that he felt his heart leap up into his chest at the sight.</p>\n<p>“Good evening,” the other spoke, and <em>oh</em>, the sound of his voice was sweeter than the candied fruit he’d tasted just a little while ago. At this proximity, he could see the youth’s eyes behind the fox mask were an alluring shade of amber, matching his outfit almost perfectly.</p>\n<p>“Good evening to you,” he found himself saying, voice a little gruffer than he intended it to be. He swallowed nervously, and gestured with indifference to the dance floor mere feet away with his wineglass. “You’re not dancing tonight?”</p>\n<p>“Oh, I’ve not – I’m happy to just watch, really,” the youth beside him spoke quickly, the hand not holding his flute waving dismissively with a little too much gusto. “I don’t have a dance partner here, you see, I’ve come with my – my cousin, and right now he’s off wooing his ladylove, and besides, dancing doesn’t interest me much, not really.”</p>\n<p>Derek hid a smile behind the action of taking another sip of wine. Had Laura been standing beside them, listening to their conversation, she would have undoubtedly made a comment. He could hear her voice, clear as day in his head, muttering ‘<em>The lady doth protest too much, methinks</em>’ with a grin. He must have been giddier than he previously thought, or perhaps his almost-two glasses of wine were making him braver than usual, because with surprising speed he plucked the other man’s glass from his hands, and settled both of them on a passing tray.</p>\n<p>“If you’ve no one to dance with, I’ll gladly be your partner,” he said, feeling an unusual confidence he hadn't possessed before from the safety beneath his mask. He reached out his hand, glad for all the dancing lessons his mother had insisted on, because if he wasn’t completely certain he could waltz in his sleep, he wouldn’t have had the conviction to ask otherwise. “Would you care to dance with me?”</p>\n<p> </p>\n<p align=\"center\">. o O o .</p>\n<p> </p>\n<p>Since stepping into the ballroom, Stiles had felt like he’d stumbled into a dream landscape, impossibly rich and splendid beyond anything he could conceivably imagine. And yet, despite wearing clothes just as sumptuous as some of them, he still felt like an outsider that didn’t belong. Regardless of his fine suit, he knew that his social standing was infinitesimal at best, ludicrous at worst. Devoid of all confidence as he gazed around the room, Stiles felt as though he were a pigeon in a cage full of peacocks.</p>\n<p>He’d managed to keep to himself for the better part of an hour or so, he estimated, before he felt the strange, prickling sensation on the back of his neck, the sensation of being watched. Discreetly, he cast his eyes around the room and saw, from the corner of his eye, a solitary figure standing behind one of the marble pillars, oddly motionless in a room of dancing and merriment. From across the room, the man seemed to be hardly more than a shadow, standing in the shade of the support. He thought nothing of it, but, unavoidably, found himself casting a glance back at the other from time to time. The figure didn’t seem to move for a long, long time, but it seemed that, before Stiles knew it, they were standing side by side.</p>\n<p>The first thing Stiles noticed, before all else, were the man’s gloves. He was grasping a crystal glass of blood-red wine, and he somehow couldn’t seem to look away. In his time, Stiles had made numerous pairs of gloves, and he above all people could appreciate the difficulty it took to make them, the detail that can go into something people consider so trivial. The fourchette between the fingers of the other man’s gloves were sewn in so precisely that the stitches were near invisible, and the trank plain, but styled incredibly well, cut to the wrist at the perfect measurement to match his sleeve length. There were rosettes and fleur-de-lis embroidered onto the linen, in a shade of white so well matched that, had Stiles not been looking, he wouldn’t have noticed at all. It spoke of a man who wasn’t ostentatious in his tastes, who enjoyed fine detail without being grandiose in presentation.</p>\n<p>As if pulled by a mysterious force of gravity, his gaze was dragged upwards, over the sleeve that was fitted perfectly to accentuate the man’s strong physique, across the expanse of torso that was resplendent in silver embroidery, whorls of silvery chrysanthemums along a collar fitted, here and there, with metal buttons. The effect of the silver thread contrasted strikingly against the velvet backdrop of the suit’s dark black, catching the light enchantingly. Stiles took the sight in, from the man’s closely-cropped inky hair and dark shadow of facial hair, to the sombre, very nearly sullen mask of the wolf obscuring his face. But what really shocked Stiles were the man’s eyes, a stark difference to the gentleman’s entire appearance. Where he’d expected them to be as sable as the rest of him, Stiles was entranced by the other’s jewel-like tone, juxtaposing the darkness of the mask. All the air seemed to leave his body at once, because the sum of all the other man’s parts, the breadth of his shoulders, the way the coat fits him and his amazing, light-coloured eyes, made his chest constrict in a strange, almost painful way.</p>\n<p>He hadn't realized how brazenly he’d been staring until the silence had stretched awkwardly between them, and, thankfully, he remembered his manners in time to extend a greeting. It was returned easily enough, and, for a moment, he believed it to be the end of that particular interaction. But without warning the masked man began conversing with him, and Stiles – well, he felt surprised that someone seemed to have taken an interest in him, even if it was on such a banal subject as dancing. When asked about the reason he’s not on the floor, all the breath is knocked out of him. He chattered on quickly, looking around in the hopes of finding Scott, certain that he’d been too obvious and had been found out.</p>\n<p>When his glass was taken from his hand and he was offered to dance, Stiles – well, to be frank, he was flabbergasted. He stood immobile, rooted to the spot as if petrified, while the other masked man stood, patiently, with his hand still outstretched.</p>\n<p>“Dance with me,” the stranger repeated, his voice soft and gently insistent. And, despite standing nowhere near a wall, Stiles felt cornered and abruptly shy. Regardless of that, he found that he didn’t want to refuse the urgings of the man, whether it be to try and throw suspicion from himself or to admit that, regardless of the fact he didn’t know this man at all and he seemed a little peculiar, he had a remarkably enigmatic nature. He couldn’t deny the allure of him, not when his multi-coloured eyes seemed to shine behind his dark mark with such sincere aspiration. Before he knew it, he’d placed his hand tentatively in the wolf’s outstretched own, who grasped it almost instantly, pulling Stiles close to him and leading him into the centre of the dancing, lively crowd. Suddenly, Stiles felt a nervous mess. He’d never danced properly before at a ball, only with the mannequins of his shop which, to be expected, were poor dance partners and didn’t provide reliable practice.</p>\n<p>“I – I don’t know how to dance well,” he whispered, feeling an embarrassed flush creep into his cheeks. The man’s lips, soft and full beneath the half-visage of the wolf, worked up into a slightly playful smirk, completely devoid of malice.</p>\n<p>“Not to worry, little fox. I will lead you.”</p>\n<p>The man’s hands came down, one resting on the flat of his back, the other catching his hand. Stiles swallowed heavily, trying to dislodge what felt like an entire brick in his throat as he placed his free hand on the man’s strong, broad shoulder.</p>\n<p>And just like that, they were moving.</p>\n<p>It was like something out of a child’s fairy-tale, being spun on the floor surrounded by rustling silk and gleeful, chirping laughter, the string ensemble’s music filling his ears and the lights from the hundreds of lit candles whirling around him. It’s only after a few moments that Stiles became comfortable with himself enough to let the sound of the music into him, giving up all apprehension as he let the wolf take the lead. It’s a little clumsy at first, especially considering that they’re very nearly of the same height, but soon enough their motions align in synchronisation, and he realizes that he’s laughing delightedly. The man behind the wolf mask steers their movements with grace borne of practice, and smiles at him in return.</p>\n<p>They began moving a little faster as the music increased in rhythm, its pace building. Stiles couldn’t remember a time when he’d last had so much excitement, spellbound by the environment he’d somehow entered and the way the other man’s hands held onto him so closely, leading him with sureness. The tempo of the melody builds higher and higher as their feet dance into a whirlwind of crescendo, and he’s glad for the sensation of those strong, sure hands, because he feels as though he might lift off his feet at any moment and fly away.</p>\n<p>“Are you ready?”</p>\n<p>The question startles Stiles from his rapturous exhilaration, but before he’s had a chance to process it, the band swings into a near raucous, boisterous climax, and the other man presses his hand firmly against the small of his back, grips his hand harder and leans forward, dipping him backwards. Stiles fights his body’s natural reaction to flail his arms wildly in shock, instead surprising himself by scrambling to wind his other hand around the man’s neck.</p>\n<p>It suddenly feels as though all sense of time and space have slowed to a complete standstill, where only the two of them seem to have been spared. All of his senses seemed to be hyperaware and focused solely on his dance partner, cataloguing every fibre of the moment, from the slightly soapy, fresh, masculine scent of his skin, to the honeyed-gold ring around his pupil bleeding into the dazzling array of hues of his eyes. Their breathing hard and heavy from the exertive dance steps, Stiles couldn’t help the way his hold instinctively tightened around the man’s neck, bringing their faces a half inch closer. The other’s eyes widened a touch, then flicked downwards at his mouth, and then –</p>\n<p>The moment ended with the sound of clapping from around them, as the dancers swirled to a stop and applauded the musicians. The taller man pulled him back into an upright stance, and they broke apart hastily, Stiles’ chest heaving with exertion, the wolf’s facial emotions unreadable because of the mask. Clearing his throat and feeling heat throughout his entire body, he made to turn and leave, but the masked man caught his wrist, impeding his exodus from the dance floor, where another tune was already beginning and the guests were partnering again in preparation. Desperately, Stiles tried to find words that made sense of his bewildered, frazzled mind, or the way that his heart seemed to still beat too fast, despite the dance being long over.</p>\n<p>“I was – I’m feeling rather too warm,” he stumbled instead, the heat of the other’s fingers almost like a brand upon his wrist, even though there were multiple layers of cloth between them. “I thought I might – step outside. For a brief moment, that is.”</p>\n<p>The man grunted in response, a soft sound that he barely heard over the clamour of the next dance beginning. His grip loosened on Stiles’ wrist, however, and travelled down to take Stiles’ hand within his gloved own. He was pulled forward, following the stranger as he led them across to the edge of the ballroom, and then through opulent gilt doors that opened to the cool night breeze of outside.</p>\n<p>“Where are we going?” Stiles asked, still feeling a little breathless.</p>\n<p>“I told you before,” replied the man, casting a small smile over his shoulder as they walked, “That I would lead you.”</p>\n<p> </p>\n<p align=\"center\">. o O o .</p>\n<p> </p>\n<p>Derek had obviously been taught how to dance – it was one of the many lessons he’d rigorously learned as a child, and then had to grudgingly keep up with as an adult to retain. He’d never felt right, especially when practicing with Laura or Cora, both who were light as butterflies and nimble on their toes, making him feel like a heavy-footed troll by comparison.</p>\n<p>He hadn't known what possessed him to request a dance from the fox-masked youth. It had been clear as day, even with the mask on his face, that the young man was looking at the dance floor with an air of longing. And, if Derek had to be perfectly frank with himself, he wanted nothing more in that moment than to spend as long as he could in the company of the other. He hadn't expected at all for his offer to be accepted, not when Cora had laughed at his mask, declaring with a delighted face that it was just as frightening and intimidating as his face on a regular day. But when the youth slipped his hand, just a touch hesitantly, into Derek’s outstretched one, he had to fight hard to keep his face from breaking into an elated grin.</p>\n<p>Dancing with the young man was – different, to say the least, from dancing with his sisters. For one, they were more or less of a height, though his body was obviously broader. It was easy to see the youth was inexperienced at dancing, more so with a partner, and yet his clumsy moves seemed to synchronise with Derek’s own smooth, practiced steps, until they slid into a sort-of harmonized grace that worked for both of them. Derek could say with absolute honesty that it was the most enjoyable dance of his life, especially when the other tilted his head back and laughed delightedly. And if his hand against his partner’s waist tightened a fraction as they spun in time to the fast-paced jig being played, well, it was nobody’s business but his own.</p>\n<p>It felt as though it was all too soon when the music ceased, and Derek could see the magic of the moment between them slipping away as discomfiture overtook the young man. Even as he stepped away, something like fear overcame him, and unthinkingly his hand shot out, catching the other by the wrist. It was quite an indecorous action, but the thought that, after that wonderful dance, he might not see the young man again, well, it was very nearly too much to bear. Derek couldn’t be sure if his dance partner’s need for fresh air was an excuse to be rid of him or not, and, in any erstwhile situation, he would have wordlessly walked away to save himself the embarrassment or rejection, or apologized for taking a hold of his wrist so thoughtlessly. But there was something to be said about the anonymity of the mask he wore, and the peculiar feeling of confidence that came alongside it. And, acting impulsively on this tide of newfound daring, he took the other’s hand and led him outside. If the young man wanted nothing more than fresh air, and he was wrong in his approach, well, he could always express his regret later with another few glasses of wine before retiring for the night. He had nothing to lose, really.</p>\n<p>Derek had to concede that Harris took his position as head butler of their household with acute seriousness, because the gardens of the estate looked just as picturesque as the inside. There were multitudes of tall, gilded candelabras at arbitrary points of the lawn, which cast a soft, warm light over the trimmed hedges. The slightly perfumed wax of the candles lightly scented the air, already made sweet by the faint perfume of his mother’s favourite climbing roses, their vines delicately wrapped around the marble pillars and arches of the courtyard. Although beautiful in its calmness, the green was deserted by the merrymaking nobles inside, all too caught up in dancing and wine to enjoy the night air. And though the evening breeze was crisp, almost chilly, it was a pleasant change from the growing stuffiness of the ballroom, and couldn’t diminish the beauty of the place.</p>\n<p>“Oh!” said the man beside him, and Derek had only then realized that he was still clutching at the other’s hand. Hastily, he took his own away, but watched intently as the fox-masked youth smiled broadly from under his disguise, the slightly tense set of his shoulders easing just a touch.</p>\n<p>“I must admit,” Derek ventured, his hands clasped behind his back as they began to walk together, a slow, sure pace, “I was actually hoping to find an excuse to get away from that room.”</p>\n<p>“Oh, you too?” the fox asked, as a melodic chuckle tumbled from his soft mouth. “It was – don’t misunderstand me, it’s a wonderful party. I’ve never seen such wondrous things, or heard such lovely music being played in front of me. But I was beginning to feel a little overwhelmed, especially with -” He suddenly seemed to catch his words, reining in whatever words he was about to speak, and Derek found himself undeniably curious. </p>\n<p>“You mustn’t assume I’ll think any less of you for your opinions,” he said unconcernedly, their unhurried pace through the gardens a welcome respite from the fast dancing. “My sisters often tell me that my opinions are wildly unpopular, most probably because I seem to have no problem in pointing out the truth. For instance,” he turned his head a little and gave a small smile, “I think those periwigs that men wear look absolutely absurd. It makes them look as if they’re wearing a sheep on their crown.”</p>\n<p>Of <em>course</em> Derek would have to put his foot in his mouth and tell one of his no-nonsense, frank opinions on the preposterousness of court life. According to Cora, it was this factor that was his chief downfall in trying to find someone who could bear his company for more than a handful of minutes (which came a close second to his supposedly constant glower). He’d lost more than a few conversation partners almost the instant he’d voiced his first thought, and he was more than expecting the other to turn on his heel and walk back the way they’d come, possibly at a brisk pace to put as much distance between them as possible. What he <em>hadn't </em>expected was the fox to throw his head back and laugh, the sound bright and dazzling, completely charming.</p>\n<p>“Oh, I’m <em>so</em> glad I’m not the only one who thinks like that!” he returned, voice full of mirth. “To be fair, I was beginning to get a frightful headache from the reek of perfume inside. I suppose that a lot of the noble ladies enjoy smelling like flowers, but when they completely forego bathing and drench themselves in the stuff – well, it’s not so much a bouquet as an explosion of vegetation.”</p>\n<p>“Forego bathing?” Derek repeated, feeling his eyebrows rise in curiosity behind his wolf face. “Surely you don’t mean they don’t bathe daily.”</p>\n<p>“They believe it to be unsanitary,” the other chuckled, and Derek surprised himself with a sudden bark of astonished laughter.</p>\n<p>“Madness. These people are utterly mad,” he mused, and saw his companion grin and nod in reply.</p>\n<p> </p>\n<p align=\"center\">. o O o .</p>\n<p> </p>\n<p>Despite being silent at first as they made their way through the picturesque gardens, Stiles soon found himself deep in conversation with the wolf-masked man. It was surprisingly informal and effortless to talk to him, the discussion as natural and uncomplicated as any he’d had before with Scott. It began with their tongue-in-cheek observations of the nonsensicality of the nobles, and then the topics naturally progressed, from which books they preferred to read (he delighted in finding out his walking companion read mythical tales as well) to whatever Stiles could think of.</p>\n<p>And even if the other was dressed to the nines like a king, there was something about the man that seemed down-to-earth and genuine, that contradicted his exceptional couture and poise. The way he spoke about his love of horse riding seemed unconcerned, even speaking about how his sisters teased him for trailing mud through the house – well, Stiles could say with all certainty that he was feeling enchanted with his mystery friend and his intelligent humour and outlook on life.</p>\n<p>So they talked, on and on, and Stiles couldn’t have said how long they’d been outside, but the brisk air had long ago taken away whatever heat he’d accrued in the stuffy ballroom. He was glad for his overcoat and multiple layers beneath his vest, because the temperature had dropped – not enough for it to be bitterly cold, but definitely chillier than it had been before. He attempted to suppress a shiver, though it didn’t seem to work, as the other man fixed him with a look from behind his disguise.</p>\n<p>“You’re cold.”</p>\n<p>They were in one of the garden’s miniature hedge mazes, taking a break from their aimless meandering and sitting on the edge of a stone fountain in the centre of the maze, aquatic lilies and floating candles adorning the surface of the water. Some light was spilling still from the ballroom, but in the quiet haven of the garden, the din from the ball was muted, the light sparse and flickering in the cool night air from the candles and the soft moonlight in the clear night sky overhead.</p>\n<p>“I’m alright,” he replied, because, yes, he was feeling a little chilled, but nothing he hadn't felt before during winter when he hadn't had enough firewood to stave off the chill, or when he’d been caught without a coat in early Spring. “I’d rather stay out here than go back inside – trying to navigate a safe path between all those crinolines crushing against one another is bound to end in tears.”</p>\n<p>“I could lend you a coat,” offered the stranger, and somehow the suggestion brought heat into his cheeks and the tips of his ears. He wasn’t a young girl, he had absolutely no reason to blush at such a thing, and yet, there he was, glad for the cover of the mask to hide his reddened cheeks.</p>\n<p>“It – it’s quite alright,” he stumbled, “Though I am grateful for the offer. I suppose it’s best to get back inside, though, the air is starting to get a little chilly.” He rubbed his gloved palms together, the friction causing a little warmth at least.  “We may have to battle our way through the throng of partygoers, especially if we’re trying to avoid the dance floor.”</p>\n<p>“Why ever would you want to do such a thing?” his conversation companion asked, the hint of a grin on his face, “You seemed perfectly fine when we spun on there a while ago.”</p>\n<p>“Only because I had a dance partner who knew what they were doing,” Stiles quipped back, chuckling. “At one point, I was pretty sure I held onto your shoulder for dear life when you steered us around, and I almost got crushed by that enormous woman who looked like a cream confection.” They both laughed, the memory light between them. “In all honesty, I wasn’t expecting such a fast-paced dance to begin with. It certainly takes a lot to keep up with it.”</p>\n<p>“Well, come on,” the wolf stood, offering his hand to Stiles again. “Let’s dance again before we go back inside.”</p>\n<p>“Wha- out here?” He glanced around, curiously. They were cut off from the courtyard by the hedge maze, completely alone save for the sounds of music and partying from over the manicured bushes.</p>\n<p>“I don’t see why not,” the other returned, his voice light. “I was always told that a gentleman can dance anywhere.” Stiles slipped his hand into the man’s without a moment’s hesitation, pulled to his feet as the music wafted over the shrubbery. However, the melody had changed into a slow, gentle waltz, full of string instruments and gentle harmonies.</p>\n<p>“It doesn’t… it’s not as fast-paced as the prior one we danced to,” Stiles noted out loud, his expression not quite even with the faintest hint of trepidation and his back stiff. And yet, before Stiles could gather his senses enough to deem it a bad idea, the other has wound his hands around him, and he could feel the warmth from the wolf’s broad hand against the small of his back again. The difference in their position from their earlier dance was more intimate, their bodies closer and their chests pressed flush together.</p>\n<p>“Waltzes are usually slower than jigs,” the man smiled, though not unkindly. And then they were moving again, though their steps were far more leisurely than before. Once again, his companion seemed to be an excellent dance partner, steering them both through the waltz with near effortless grace. Their shared body heat seemed to be enough to make him forget the chilled night air completely. They moved together for what felt like an indeterminate amount of time, long enough that Stiles’ rigid posture relaxed, and he sunk nearer to the wolf’s touch. In reply, the other man’s fingers spread out against his back, tugging him impossibly closer, their faces almost touching and lips sharing the same air. Stiles, his eyes firmly glued to the other’s cravat for the longest time, hazarded a glance upwards, and was met by the unbelievably powerful gaze of the taller man, regarding him with his green-opal-coloured irises. And, once their eyes met, Stiles could not, for the life of him, seem to tear his own gaze away. At any prior time, he would have turned away self-consciously, or spewed a nervous babble of speech to hide his discomfort. The most peculiar thing, though, was that, for once, Stiles found himself brave enough to meet those eyes straight-on. Perhaps it was the sweet music, or the glass of expensive wine he’d imbibed, or the gentle pressure of the man’s touch against his spine. Whatever the case, they were level enough to feel the gentleman’s breath against his cheek from beneath his mask.</p>\n<p>“Could I-” the other began, a little hesitantly, as if searching for the right words to say. “It might sound improper, but would you – could I perhaps – dance with you without gloves?”</p>\n<p>“Oh,” was all that Stiles could say, feeling a little confused. To him, it didn’t sound improper at all, as he rarely wore gloves, but maybe the nobles had a different idea of what proper etiquette was. Regardless, he found himself saying “Of course,” and pulled back a touch, enough to slip his gloves off and tuck them into the pocket of his vest. The stranger did the same, and when they met again in the middle, Stiles found his hand searching for the other’s immediately, the heat of his partner’s virtually scorching by comparison. He didn’t even think to feel self-conscious of his calloused fingertips, not when the hand holding his was equally as rough-skinned across the fingertips. The moment felt just about too perfect and personal.</p>\n<p>“Is this-?” he whispered, his skin tingling and buzzing where it held the other’s hand. He felt quite drunk, even if he’d barely finished his glass of champagne from so long ago. “What is this?”</p>\n<p>“I don’t know,” the wolf admitted, his voice soft and – what was it? A little hopeful? “I’ve never done this before. If I’m making you uncomfortable, we can stop.” His light-coloured eyes trailed over Stiles’ face, still burning with intensity. “Do you want to stop?” he asked, his voice low.</p>\n<p>“No,” Stiles found himself saying, his voice equally as soft, “For the life of me, I can’t think of a reason to stop.” Indeed, his own hand, resting against the dark fabric of the wolf’s coat, clutched it a little tighter, the cloth heavy and costly beneath his fingers. Their dancing had slowed so gradually while they were lost in each other’s eyes that movements were little more than a gentle sway.</p>\n<p>“I…” Stiles faltered, his utterances lost to the jumble of his mind. “I feel a little strange right now,” he tried, slipping his hand from the stranger’s grasp and settling it against the other’s chest, firm beneath his touch. “Not – not strange in a bad way, though. Just – peculiar. It feels as though my chest is being clutched in a vise.” They’d stopped moving altogether now, and the taller man’s hand, now free of Stiles’, came forward to clasp fingers gently beneath his jaw. Stiles felt caged, impossibly surrounded by the other, his senses full of nothing but the man’s smell and sight, the feel of his hand against his back, pressing them level, and the thumb that skimmed the sensitive spot below his ear that made him shudder (of which he’d never even <em>known</em> of before). He found his eyelids fluttering low as the tips of the fingers travelled over his cheek, curling under the edge of his mask and beginning to move it aside. His eyes were closed, now, his breathing a little heavier and lips parted as he felt the papier-mâché against his face move…</p>\n<p>Suddenly, the loud chime of a grandfather clock rang out across the gardens, piercing and thunderous over the previously gentle harmonies of the music inside. Stiles’ eyes shot open and his hand came up quickly, grabbing the wolf’s wrist and halting his movement suddenly. It was far later than he’d thought – midnight, by the sound of the gongs – and Scott had told him they’d needed to leave by then. Already he was probably late to meet him outside to await the coach.</p>\n<p>“I – I’m sorry!” he sputtered frantically, a panicked feel in his chest as he broke away from the man’s embrace. “I need to – I have to go.” Without waiting for an answer, he turned and rushed away, darting through the garden and weaving through the throng of merrymakers. It was a miracle that, stepping outside, Scott was waving to him merrily, looking as though he’d just arrived and dishevelled enough to assume that he’d been pulled through a hedge backwards, if not for the lipstick smears across his face.</p>\n<p>“She said <em>yes</em>, Stiles!” he crowed as they piled into the carriage, his grin so wide it was infectious. “She said <em>yes</em>. We’re going to arrange for our parents to meet and formally draw up the papers! Allison and I are going to be <em>married</em>.” He shoved him in the arm and flailed his hands in the air in front of him, the hound mask forgotten completely and hanging off the back of his head by its ribbons.</p>\n<p>“That’s – Scott, that’s wonderful,” Stiles enthused, wrapping his arm around his best friend as they cheered happily, delighted in his comrade’s good fortune. He steadfastly refused to put any thought into what had happened with the handsome stranger only moments ago, instead focusing on the good spirits of the moment. The ride certainly involved a lot of hugging and overjoyed declarations of life-long friendship.</p>\n<p>It wasn’t until later that evening, after Scott had dropped him off at his house with a last giddy goodbye, that Stiles tiredly removed his suit and hung it onto his mannequin for the evening to wash and pack away in the morning. And it was only after he’d removed every last stitch of the party clothes and slipped on his nightshirt that he realized, with surprise and a degree of annoyance, that one of his gloves was missing.</p>\n<p>“I wasn’t going to say anything, because I thought that maybe, just <em>maybe</em>, you’d undergone some considerable mental recalibration and turned into an actual, successfully-functioning human being,” Laura began, leaning against the back of his chair and looking over his shoulder, “But now I’m having doubts, because surely this individual here cannot be my beloved brother, who detests nothing more than parties, who quoted them recently as being ‘<em>just so ugh</em>’.  I say this because the party-hating brother I know wouldn’t spend an entire afternoon sitting at his writing desk <em>writing out party invites</em>.”</p>\n<p>“Is there a particular reason you’re choosing to annoy me, Laura?” Derek groused, hunched over the polished wood of the bureau and writing out names agonisingly slowly in the proper calligraphy his writing teacher had drilled into him, rather than his usual, near-unintelligible scribble. “I thought perhaps taking Cora’s advice to be more <em>fun</em> would be a wise course of action. After last week’s event, she’s practically been inundated with invites from eligible young men.”</p>\n<p>“But Derek, you don’t <em>like</em> being social,” his elder sister pointed out, and if it had been anyone else, the response would have been veritably insulting. But because it was Laura, and she knew him almost better than he knew himself, Derek couldn’t help but feel it was the truth. “Something happened that made you change your mind on the whole ‘social butterfly’ aspect, didn’t it?”</p>\n<p>“Nothing happened,” he was quick to reply, because <em>curses</em>, but Laura knew him <em>too </em>well. His sister hummed noncommittally, but didn’t move away from her bothersome perch against the back of his seat.</p>\n<p>“I’m not convinced, Derek,” she tutted, “Not after I saw you come in from the garden – You looked like someone had repeatedly kicked you in the ribs, and you went straight upstairs to your room, even when Lord Hutchins greeted you and tried to draw you into conversation.”</p>\n<p>“I didn’t feel like talking to Lord Hutchins,” Derek justified, putting his pen down and turning to Laura.</p>\n<p>“Oh, <em>please</em>,” she scoffed, “You <em>always</em> want to talk to Lord Hutchins. You and the old man have a deep, spiritual bond based on riding and proper horseshoe care. I’ve seen the way you two prattle on and on and <em>on</em> about it. There has factually been no instance in recorded history in which you haven’t spoken to him when you’ve both been in the same room. Last time at Nancy’s wedding you almost bowled over a member of the staff in your haste to get to him.”</p>\n<p>“Don’t remind me, Cora was making fun of me for <em>weeks</em> after that,” he moaned. “And in my defence, the boy ran out of nowhere.”</p>\n<p>“The <em>point</em> is,” Laura pressed on, grinning mischievously, “It looks like my little Der has found somebody. Now, who’s the lucky girl? Or boy? Because I distinctly remember young Lord Tyrin looking at you with doe eyes at the fair last summer. Is it somebody we know?”</p>\n<p>“He’s nobody we know,” he rolled his eyes, and then caught himself. “I meant – it’s not anybody – there wasn’t – <em>damn it</em>, Laura!”</p>\n<p>“<em>I knew it!</em>” she cackled in glee, clapping her hands. “So <em>that’s </em>why you’re writing invites, then? To invite them back? Why not just send an invite to him alone? Why bother to invite almost every noble in the country?”</p>\n<p>“Because – Laura, because I didn’t get his name,” he said dejectedly, picking at a loose thread of his shirtsleeve. “He left before I could ask, and I – honestly, I’d never seen him before. I would have remembered someone like him, but I just… I don’t know who it could possibly be.”</p>\n<p>“So you’re hoping that, if you hold a party, he’ll come again?”</p>\n<p>“That was the plan. At least, that’s what I was hoping to do. I’ve never hosted a party before, Laura, Mother always figures the details out. It’s definitely a lot more difficult than I’d been expecting it to be.”</p>\n<p>“You’re scheduling this party for next week?” Laura asked, incredulous, as she picked up one of the invites and scanned over the neat penmanship. “Derek, Mother took <em>two months</em> to plan the previous one, and even then it was a rush. There’s no way everything can be organized before then.”</p>\n<p>“You’re <em>kidding</em> me,” he groaned, tilting his head back and staring at the ceiling above him as though it had grievously wronged him. “This is – this is an absolute disaster. I just wanted to see him again, and I don’t even – what if he wasn’t from around here? I looked at the guest list from the party, more than twenty of the nobles had been accompanied by family from another region. What if he’s not here anymore?”</p>\n<p>“Then I’ll suppose you and I had better come up with another solution to find him,” she acquiesced, rubbing his shoulders and pressing an affectionate kiss on top of his short, dark hair.</p>\n<p> </p>\n<p align=\"center\">. o O o .</p>\n<p> </p>\n<p>There wasn’t any reason for Stiles to be feeling as morose as he was, especially considering the life-altering night he’d had, the brilliant, dream-like evening that had opened his eyes to the glittering life of the upper crust nobility. And yet, he’d found himself in such a sorry mood that he hadn't opened the store for two days running after that night, too preoccupied to the swirling thoughts inside his head to do anything more than idly tidy the house and shop, and stare listlessly into space.</p>\n<p>Of course, there was nothing that could be done. It had been a wonderful night, yes, but he had to face the unforgiving reality that the evening had been just that – a magnificent memory to be treasured. That was all it could be.</p>\n<p>The man in the wolf mask – he’d been something Stiles hadn't counted on, something brilliant and shining in his world of dulled, faded colours. Amongst the dazzling, overstated extravagance, he had been something unpretentious and genuine, and that had made him all the more luminous to his eyes. Even days after, Stiles had been able to feel the warmth of his broad, bare hand against his own, the fiery touch that had travelled over his jawline that had made him shudder with unexpected pleasure. That magical night, something had come alive in him that he’d never known to exist before, something small and lonely that had unfurled with warmth under the other man’s captivating eyes, that had pounded against the walls of his heart, begging to be let out.</p>\n<p>But Stiles had to face the reality – he was a lowly tailor in a small town, nothing more, and the wolf-masked man was obviously a noble, a high-born at that. Their paths would have never crossed in another circumstance, not when nobles’ clothes were usually made in the capital by high-name designers. And even if they did chance to meet, their lives were too far apart, their social positions too dissimilar. He had been carefully vague about himself when conversing in the gardens, and with good reason, too – the working-class were not meant to mingle with the nobles. That was the rule.</p>\n<p>So, with a heavy heart, Stiles did the only thing he knew how to do; he locked down tight the yearning, desperate part of him that longed for those strong hands and those jewel-tones eyes on him again, and drew the shutters open in his store. He had clothes to make, after all, and food to put on his table. No amount of daydreaming and wishing could put coins in his pockets or bread in his belly – he had to be realistic, after all.</p>\n<p> </p>\n<p align=\"center\">. o O o .</p>\n<p> </p>\n<p>To say that Derek was passionate about finding the mystery youth he’d danced with at the ball was putting it mildly – it was becoming a near fixation, spending hours scouring lineages in the family’s library of nobles’ family trees. None of them seemed to match what he was looking for, though – they were either people he knew, or didn’t match the right age or gender. He’d already checked most of the noble areas where he believed the youth would be, quickly learning that no one of his description was part of any social circle. The only one close to the young man in any way was young Lord McCall, but Derek had met him on a couple of occasions, and he’d definitely not been the one. Moreover, there had been the recent news that he’d not long ago proposed to young Lady Argent, so that ruled it out of the question with absolute sureness.</p>\n<p>He still had the glove that he’d found that night, only moments after the fox-masked young man had left so abruptly. He’d been left wordless and stunned, having realized that his dance partner had deserted him so hastily, before noticing the accessory lying on the ground. It must have come free of its purchase in the other’s vest as they parted, going unnoticed in the other’s rush to leave. He’d retired to his room that night, clutching it tightly in his hand and foregoing the rest of the evening’s festivities, feeling somewhat disorientated and mystified now that his fox had gone.</p>\n<p>Laura attempted to help him in his search, but the trail grew cold as snow quickly, and before he knew it, almost two weeks had passed after the fateful night. With his fruitless results, he grew more and more dejected, bitter and loath to hide his depressed and hurt heart. Despite the time that passed, Derek could recall with almost perfect clarity the few, precious moments he’d shared with the other. Never before had he found himself taking so easily to a stranger – Laura, obviously, had grown up with him and was accustomed to his frank opinions and his atypical behaviours as a noble. That was probably why they’d always gotten along as children, since Laura was as distinctive as he, intelligent and clever and unafraid to speak her mind. She and Cora were like chalk and cheese, and Derek would have never guessed, not in a thousand years, that Laura’s sharp mind wouldn’t be able to solve every problem. Indeed, it was Cora, of all people, who pulled him from the dead-end rut he’d spiralled into.</p>\n<p>“Oh, what a lovely glove!” Cora remarked one day as she came from snooping in Derek’s room, looking for some paper with which to return a letter. Derek, slumped in the drawing room and flicking through a novel with irritation, almost surged from his chair with annoyance and snatched it back. Sensing Cora’s playful mood, however, and knowing how big a deal she would make of it, he kept his face neutral as his younger sister examined it.</p>\n<p>“Look at all these lovely details!” she remarked, and Derek noncommittally grunted in reply, keeping his eyes carefully on the pages in front of him. It wasn’t as though he hadn't traced the delicate embroidered border of ivy leaves himself so many times he’d practically memorized it, or considered how the size of the hand was smaller than his own, not overly so but just enough to fit perfectly into his, as it had the night of the dance. “Derek, I didn’t know you had such nice gloves. You should have told me, I’d love a pair such as these for my walking dress. Where’s the other one, though? Silly place to leave your gloves, on your writing table instead of in your drawers. Mother would have a fit if she knew you were leaving your things around. You really should consider a full-time valet, instead of only one when we have parties.”</p>\n<p>“I’m fully capable of dressing myself, Cora,” Derek answered evenly, flicking another page over, having absorbed exactly none of the words. It was a near-impossible feat, to remain so calm when every fibre of his being wanted to launch his body from his chair and snatch the precious item back, but he succeeded, somehow. “Besides, it’s not my glove.”</p>\n<p>“Oh. <em>Oh</em>,” she smirked mischievously, “Is this a <em>favour </em>from someone, Derek? Did a special somebody leave you something behind to remember them by?”</p>\n<p>“Nobody left me anything,” he sighed, as if impatient with her silly notions. Years of doing it must have honed his skills well, because his words came out sounding so blasé that she actually huffed out in annoyance, her fun spoilt. Derek didn’t feel too bad about lying, not when technically he was speaking the truth – the glove hadn't been left to him on purpose, anyway. He was of a mind to jump on his horse and scour the entire kingdom, every last house and establishment, in search of his fox.</p>\n<p>“I just wanted to get something this pretty made for myself,” she grumbled, tossing the fabric over to Derek, who caught it in his hand deftly. “I wish I knew whose glove it was. I could ask them about their tailor, and get a pair made.”</p>\n<p>“Cora, you’re <em>brilliant</em>,” Derek suddenly exclaimed, rising from his chair so fast he almost toppled it over, grabbing her by the upper arms and planting a hard, affectionate kiss on her forehead. Unmindful of her surprised squawk, he hugged her ‘round the shoulders and took off at a run, hoping his mother hadn't gone out for the day so he could ask to borrow her address book.</p>\n<p> </p>\n<p align=\"center\">. o O o .</p>\n<p> </p>\n<p>Every single tailor that he’d visited at the capital had told him what he’d feared most – not only was the glove none of their work, but they didn’t recognise the craftsmanship that went into it. They’d each complimented the intricate, hand-embroidered leaves along the edge, and Derek would have thought that, visiting the best tailors in the kingdom that specifically <em>catered</em> to nobles, someone would have <em>known</em> the work.</p>\n<p>He had more luck when he returned to town. Of the two best tailors in town, they’d both said the same thing – it looked an awful lot like Deaton’s work, only finer. Deaton, it turned out, was a fine tailor himself, though retired for quite a number of years. Exhausted from his investigatory work, he finally managed to track down his only apprentice that had continued into the business – a man named Stilinski.</p>\n<p>Derek, at the end of his tether, had fully intended to storm into the shop, clutching the glove aloft. Determined to have some answers, even if it meant shaking them out of the tailor, he’d made his way to the small store on the far edge of the town, in the middle-class quarter. He wasn’t uncomfortable, considering that he’d actually dressed down, so he was fairly confident that he wouldn’t be stabbed for his wallet – not immediately, anyhow. Probably enough time to tie his horse off and quickly duck inside to ask about the commissioned accessory.</p>\n<p>He was across the way, about to dismount his charger, when a figure came out of the doorway with a broom and began sweeping the entryway. Derek froze, one of his feet still hanging aloft from the stirrups. There was no fancy suit to be found, and the apron he wore was tattered in some places and there were loose threads hanging here and there off him, but there was no mistaking the slant of those shoulders, or the cherrywood colour of his hair, even from that far away. Derek felt his breath catch tightly in his throat, knowing in the pit of his stomach that it was him, and scrambled back into his saddle properly, edging his horse away from the main road and watching the youth discreetly from around the corner of the building closest to him. Without the mask, the young man was mesmerizing – he couldn’t see every minute detail from that distance, but he was immediately captivated by the rosy cheeks and sweet, turned-up nose.</p>\n<p>An elderly man greeted him warmly as he made his way to the door, and the youth welcomed him inside, his smile warm and dazzling as he held the door open. He felt somewhat unsettled, lurking in the shadows as they headed inside together, and then quickly moving close to the shop and peering in the window – he honestly felt like a skulking prowler. But there was a pressing need to confirm, to validate his theory. The way the tailor moved his hands so animatedly when talking to the customer, the way he pursed his lips – it was all exactly like the man in the fox mask he danced with that night.</p>\n<p>It appeared that Derek’s search was over, and the mystery of the youth’s identity was solved – he was the tailor, Stiles Stilinski. He would have to be blind and in denial to refuse to associate the richly-dressed fox with him. Stiles was the one he had been looking for all this time. His mouth dry and his chest tight, Derek turned his horse and made his way back to the manor, his mind working furiously. He didn’t care that Stiles was a lowly member of the working-class – what he’d shared with him at the party was extraordinary, something he’d never experienced before in his life, and he wasn’t about to let the ridiculous politics of class division to stand in the way of his emotions. His family had been on the lookout for someone he could marry, and he’d never been keen on the idea before. But now, he’s entirely supportive of the suggestion, as long as it’s with the man he danced with at the ball.</p>\n<p>He just has to figure out how to approach the other without scaring him off.</p>\n<p> </p>\n<p align=\"center\">. o O o .</p>\n<p> </p>\n<p>One day, out of the blue, Stiles had a package delivered to his store. It had been almost three weeks since the ball, and he’d almost finally, definitively managed to convince himself that his life would return to its repetitive, monotonous state. Compared to the glittering events of that night, his existence seemed to be all the more lacklustre, but he was glad to have the memory of that evening as a bright remembrance.</p>\n<p>When the parcel arrived, Stiles had to check with the deliveryman to ensure it was the correct address. Everything seemed to be in order, though – his name and address were written in neat script upon the waxed fabric over it. Whatever it was, the bundle had been quite heavy, and he’d almost buckled under the surprising weight of it as he hefted it to his worktable. He’d never received a parcel before in his life – it was with trepidation that he cut and unwound the string from the carefully wrapped muslin.</p>\n<p>There was a flat bolt of fabric inside, thickly-embroidered brocade that felt heavy and lush under his fingers. The stark white of the roses and vines against the brilliant gold underneath was luminous, and the cloth could have easily cost more than he made in the entire year.</p>\n<p>There must have been a mistake, and Stiles felt the tendrils of panic creeping quickly into his bones. From a corner of the textile, he noticed an odd corner of cream sticking out, and gingerly pulled at it, unveiling an envelope of thick parchment sealed with wax. Unable to contain his curiosity, he pried the seal off with a blunt fingernail and pulled out a note, folded in half. Opening that, his eyes widened at the coiling, elegant script across the page.</p>\n<p> </p>\n<p>\n<em>Esquire Stiles Stilinski,</em>\n</p>\n<p>\n<em>Please find enclosed a token of appreciation, as, after seeing your creations, I have become a great aficionado of your handiwork.</em>\n</p>\n<p>\n<em>With regards,</em>\n</p>\n<p>\n<em>An Admirer</em>\n</p>\n<p> </p>\n<p>Stunned, and feeling his eyebrows climb so high they were certainly in danger of joining his hairline, he read the note again, and then a third time.</p>\n<p>“Oh my god,” he murmured, and then he repeated himself, just for emphasis. “Oh my <em>god.</em>”</p>\n<p> </p>\n<p align=\"center\">. o O o .</p>\n<p> </p>\n<p>The gifts continued to come, every two or three days, always different and unique. The second parcel held a box of buttons, gilded and raised with exquisite fleur-de-lis, while the third held a thick roll of lace so fine that he was sure it must have come from abroad, and was almost as costly as the cloth. Another bundle was long and ridiculously light for its size, and held bundles of feathers from exotic, tropical birds, richly coloured and more vibrant than anything he’d ever seen. Each bequest was accompanied by the same letter written in the fine, curling writing, each from his admirer. Stiles would be lying to himself if he said that he wasn’t beyond flattered by them, that he didn’t keep the notes tucked away in his bureau drawer upstairs in his room and re-read them. He’d never had an admirer before, nobody had even looked <em>twice</em> at him, and now – well, what was he supposed to do?</p>\n<p>He was given a silver box of hand-pressed sugar sweets, crafted into exquisitely ornate shapes that seemed almost criminal to consume, though he couldn’t help but utter a delighted sigh as he tried one. A bottle of wine came next, dusty and of an old vintage, and though Stiles didn’t drink red wine, he was sure that one day his tastes would change, and it would be a perfect indulgence for that day.</p>\n<p>In total, he received seven parcels in two weeks, and he was beginning to look forward to the new day, to the possibility of the well-suited courier who rapped on his front door and cheerily pushed the next gift into his hand. Knowing there was someone out there in the big, wide world, who valued his work enough to give him such expensive tokens – frankly, it made him feel giddy, but somehow a little heartsick at the same time. He couldn’t forget the man he’d danced with so joyously that fateful night, so long ago, of the perfect press of his hands against him. He spent many long, sleepless hours staring at the ceiling of his room in the dark, regretting his hasty flight from the gardens, dodging away from those elegant fingers that had, so perilously, held the edge of his mask. Many a night Stiles found him awaking from a fevered dream of those hands against him once more, of firm lips against the underside of his jaw, the knuckles of his hand. Each time he did, he was quick to remind himself that the night was done, and he would not cross paths with the masked man again.</p>\n<p>One final package came the morning after a particularly sleepless night, plagued by dreams of peridot-green eyes and a smooth-timbered voice. Stiles barely let his mind wander as the pulled out the envelope first, ignoring the still-wrapped item lying in the open folds of the muslin. It wouldn’t do to think of impossible things, not when he looked forward to the small, handwritten letters that came with each delivery, personal little notes that made his entire day brighter. Gingerly, he unfolded the latest one, skimming over the writing. Startling, Stiles re-read it again, sure that he’d interpreted it incorrectly. The words remained the same;</p>\n<p> </p>\n<p>\n<em>Esquire Stiles Stilinski,</em>\n</p>\n<p>\n<em>I do hope that you enjoyed the deliveries – I certainly found much pleasure in choosing them for you. Enclosed is one final gift to you, with a humble request. I wish to see you, face to face, so I may speak to you of my intentions. If you are so inclined to respond, please meet me in the public gardens a little way past the path beside the bridge on Miller’s Way, tomorrow evening at 6 o’clock.</em>\n</p>\n<p>\n<em>With affections,</em>\n</p>\n<p>\n<em>Your Admirer, D.H.</em>\n</p>\n<p> </p>\n<p>Dumbfounded, Stiles could only stare at the letter, now hanging limply in his hand, feeling his chest suddenly constrict. It had seemed all so lovely, having an admirer, but now they wanted to meet him? Was this truly happening? There was no doubt in his mind, though, that he would be meeting the mystery benefactor of these gifts, if only to thank them so. Placing the letter carefully flat onto the counter, he unfolded and slid the rest of the packaging off the gift, and found his heart suddenly leap into his chest.</p>\n<p>Inside the folds of the opened parcel, wrapped delicately in layers of tissue paper, lay the mask of the wolf.</p>\n<p> </p>\n<p align=\"center\">. o O o .</p>\n<p> </p>\n<p>Perhaps requesting Stiles to meet him was too soon, Derek thought as he paced in his chamber that evening. Possibly, he speculated miserably, turning another corner and very nearly wearing a hole in the floor, the whole idea was ludicrous. He’d been so careful to keep his letters neutral, free of emotions. Laura had been an enormous help in picking out the gifts as well, he doubted he would have gotten anything half as appealing without her input. And she’d assured him that they were impartial, safe gifts that were impersonal.</p>\n<p>That is, until he sent the sweets. And the wine. He hadn't been able to help himself – he remembered how elegantly Stiles’ fingers had wrapped around the stem of the glass, how he’d hovered near the tables of sweetmeats and fruits at the ball. He didn’t know if Stiles drank wine or not, if he liked sweets or not, but he couldn’t help buying them and sending them anyway. If he didn’t like sugar, the box was always pretty enough to keep, anyway, and if the wine was unacceptable, well –</p>\n<p>Exhausted from his worrying, Derek grunted in frustration and fell face-first into his mattress, uncaring that his shirt was getting wrinkled. Maybe requesting to meet him was too soon, maybe he shouldn’t have sent his mask from the ball to him, or signed the last letter with his initials. They were due to meet in less than twelve hours’ time, and Derek felt the slow tendrils of anxiety begin to curl in his stomach.</p>\n<p>He was afraid of rejection, that was certainly true. What if Stiles thought him to be a pompous nobleman, and wanted nothing more to do with him? What if he came, but had no interest in Derek whatsoever? Or, worst of all, what if he didn’t show up at all?</p>\n<p>Groaning despondently, Derek set up for a long, sleepless night of worrying.</p>\n<p> </p>\n<p align=\"center\">. o O o .</p>\n<p> </p>\n<p>Against all better judgement, Stiles found himself closing his store early and drawing a bath, internally fighting with his inner monologue as he scrubbed the day’s labour from his skin. Since he’d opened the parcel yesterday, his mind had not stopped working, so much that he’d pricked his finger twice with a needle as he’d basted the lining to a lapel, something he hadn't done in a long, long time. He was at war with himself over what decision he should make. On one hand, he was most certain that it was a noble whom he’d danced with at the ball, and had discovered his common standing. Maybe he was planning to threaten him, blackmail him for something?</p>\n<p>But the man he remembered from the dance didn’t seem to be as cold-hearted as that. And, really, if he <em>were</em> planning on blackmailing him, why would he bother sending him gifts?</p>\n<p>Despite all instincts telling him that meeting the noble was not a good idea, Stiles was driven by one need: the desire to see the man again, if only for a few moments. He couldn’t lie to himself anymore – since that fateful night, he’d been completely and utterly entranced by the other, spellbound by his presence and easy conversation. If he were being completely selfish, he would give up all of his expensive, costly gifts, if only to share one more moment with the other man.</p>\n<p>Only a little while before the appointed meeting time, and Stiles was standing in the little clearing, nervously holding the mask in his hands, wrapped neatly in its original muslin cloth. He felt on edge and self-conscious – even wearing some of his cleanest, least-worn clothes, he was still obviously a working-class man. Yet he held his head high – his mother and father had been working-class, and there was no shame to be had in that, none whatsoever. His heart was steeled for disappointment, all hope firmly tempered down. If he had no expectations, he couldn’t possibly walk away disheartened.</p>\n<p>“You came,” a voice spoke from behind him, and Stiles whirled, the mask clutched tightly against his chest like a shield. The wolf – well, not wolf anymore, but a man – was standing only feet away, hands unsure by his sides. He was dressed in simple but elegant clothes and boots, but the cut and fabric of his shirt and breeches marked him as a noble as clearly as a brand. Without the concealment of the mask, Stiles was certain that he had never met anybody in his life quite as beautiful, and doubted he ever would, coloured in dazzling oranges and golds of fading sunlight glittering through the canopy of the trees around them. “You came,” the noble repeated, almost awestruck, “I didn’t think you would.”</p>\n<p>“It would have been rude of me not to,” Stiles replied, hoping his voice wasn’t as nervous-sounding as he felt. “Especially after those gifts you sent me.” Immediately he regretted the words, because an expression of discomfiture marred the handsome features of the other’s face. “I’m sorry, I didn’t mean to sound rude when I said that,” he quickly expressed.</p>\n<p>“No, no need,” the other responded in turn, just as hastily. “It was – after the ball at our house, you see, I wasn’t sure of how I should approach you.”</p>\n<p>“Your house,” Stiles echoed back, feeling the dread pool in his stomach, his quick mind piecing together the initials of the letter to the face. “You’re Derek Hale. Of the Hale family.” And suddenly the situation seemed so much worse than before, because it wasn’t simply a regular noble before him, but one of old, blue blood, of incomparable wealth and status, a family line that shouldn’t even be seen <em>talking </em>to the lower classes.</p>\n<p>“That is my name, yes,” the man – <em>Derek</em> – replied, stepping in closer, so they were hardly an arm-span away from one another. “Stiles – after the ball, I couldn’t – it might sound tactless and forward, but since that evening, I haven’t been able to think of anything but you.” There was an expression of tenderness on his face, so poignant and intense that it almost made Stiles’ head spin. “I felt I was going mad, not knowing your name, who you were. I could think of little else but finding you again. Your glove –” he brought the missing accessory that Stiles had thought lost out from his jacket, holding it aloft, “You dropped this when you left. I searched all over the capital for its owner, thinking you were a noble, questioning every tailor I knew. I would have never thought you were a tailor yourself.”</p>\n<p>“It must have been an overwhelming disappointment when you found out,” he murmured, his chest clenching with pain. “I’d known about the Hale parties for years, and had always wanted to attend at least once. I didn’t – when I attended the ball with my friend, Lord McCall, I didn’t – I hadn't meant any harm.” His voice tapered off to something small and remorseful as a heated, shameful blush spread blotchily across his cheeks, feeling foolish that he’d thought he could be present at such an event without causing a stir. “I apologize – I shouldn’t have put you in such an awkward position.” He held the fabric-covered mask between them, offering it to the other. “Here – your mask, my Lord. I’ve come to return it.”</p>\n<p>“There is nothing for you to apologize for, <em>nothing,</em>” Derek Hale effused, his expression serious. “I didn’t ask you to meet me here to express your remorse for the night, or to return my mask, Stiles. I requested to meet you here to tell you that, the night of the party, I was completely captivated by you.”</p>\n<p>“You need to stop,” Stiles hissed, his emotions running rampant and prickling beneath his skin. “You cannot say such things to people of my class – it’s improper.”</p>\n<p>“I don’t care about propriety,” Derek bit out, crowding into his space enough that Stiles was forced to step back, if only to put more distance between them – he couldn’t remain so close to Derek, not if he was trying to keep his unseemly urges firmly lidded. “What I care about is you – the way we were able to so easily make conversation, the comfort I felt around you. I’d never felt something like that before, not in all my life. I – in that moment, just before you left, I truly felt as if we’d made a connection.”</p>\n<p>“A connection might have been made, Lord Hale,” he snapped back, as coldly as he could, “But that doesn’t mean we should continue with it, see how far we could push the boundaries. That’s dangerous territory for the both of us, and not something I’m interested in.”</p>\n<p>“And yet you <em>came</em>,” the noble shot back, his features wild for a moment, before smoothing back into a controlled façade, “Because you know, as well as I, that we shared something exceptional. You wanted to see me again, just as much as I wanted to see you.”</p>\n<p>“It doesn’t <em>matter</em> what I want!” Stiles burst out, equal parts of anger and fear colouring his cheeks. “<em>Nothing</em> I want matters, because it’s not <em>my choice</em>! I’m a mere tailor, and you’re a noble! Tailors aren’t worthy of nobles’ love. And you shouldn’t -” his voice cracked slightly on the word, before he pushed on, “You shouldn’t settle for less.” He pressed the muslin-wrapped mask against the older man’s chest, erecting another barrier between them even as the other adamantly refused to take it into his hands. “Take your mask back, and forget about that night, forget about me.”</p>\n<p>“I don’t want to forget,” Derek returned, his voice carefully controlled, even as his eyes bore into Stiles’. “I don’t want to lose you again, not now that I’ve finally found you. You felt it too, and you still feel it now, this connection between us.”</p>\n<p>“Then you have sorely misjudged my ability to care,” Stiles lied through his teeth, eyes shuttering, before glancing away quickly, “Because I don’t. I can easily go home and forget all about you. And you, Derek Hale, should do the right thing for both of us and do the same.”</p>\n<p>Ignoring the wounded expression on the noble’s face, Stiles spun on his heel and walked away, his pace brisk and spine rigid. Derek reached out and took his arm, as if to stop him, but he abruptly shook the hand off and continued on his way. He paid no attention to the shouts of his name that followed him from the clearing. He didn’t change his pace until he’d reached his little shop and bolted the doors behind him, the house swathed in the darkness of early evening.</p>\n<p>His face was impassive and stony, nose stuffy and face burning as if he’d gotten dust against it, and, after lighting a lamp, he stepped brusquely to his worktable with the intention of clearing away the little clutter still upon it. Belatedly, he realized that he was still holding onto the wrapped wolf mask. Uttering a frustrated noise, he shoved the offending item under the desk and out of sight, behind a pile of scrap calico, and tersely rearranged his work-tools with a brutal efficiency. He didn’t realize his vision was wavering until he blinked, and a tear fell upon the back of his bare hand, gripping a tracing wheel so tightly his knuckles turned a sickly white. Letting out a pained gasp, Stiles bit back a sob, scrubbed at his eyes quickly, and took a deep shaking breath, before forcing himself to clean and forget all about what had occurred in the clearing.</p>\n<p>“Why are you here?”</p>\n<p>The words were sharp and biting, and, to a lesser man, would have cowed them. Stiles was behind his work desk, a disapproving frown across his lips and his brows furrowed in condemnation. His stance was radiating displeasure as he stood, arms akimbo and stray bits of thread stuck in the scruff of his hair, obviously trying for intimidating, perhaps a touch menacing. Derek simply thought he seemed terribly endearing, and he closed the door of the workshop quietly behind him.</p>\n<p>“You were lying, yesterday evening,” he ventured, stepping forward and leaning a hip casually against the edge of the worn table.</p>\n<p>“I wasn’t,” Stiles replied curtly, his argument betrayed by the blotchy flush of his cheeks as he hastily turned away. Derek folded his arms over his chest and raised an eyebrow, the excuse not washing with him one bit – but then again, he had grown up with Cora, and her penchant for telling tall tales, especially for getting him in trouble with their parents. Stiles ducked down under the counter quickly, straightening with something in his hand that he pushed across the desk, wrapped in fabric. Derek recognised it as the mask from the evening prior, when Stiles had tried to push it back into his hands. He was surprised the younger man hadn't thrown it away.</p>\n<p>“It matters, you know,” he said softly, ignoring the muslin package. When Stiles quirked an eyebrow at him in confusion, pose mirrored with his own arms folded before him, Derek raised his eyes to meet the other’s own amber ones. “What you said before. That what you want doesn’t matter. Because it does. It should.”</p>\n<p>“Not many of us have the freedom to make that choice, my Lord,” Stiles sniped, his voice oozing sarcasm. Derek refused to be provoked by the tone, instead peering over Stiles’ shoulder as the tailor turned back to his work, pointedly ignoring him. Undeterred, Derek dragged over one of the high stools from the other end of the counter and sat opposite the workbench, elbows on the table and watching intently as Stiles traced up a line of tailor’s chalk on the fabric, the white stripe a stark contrast to the darker material under his slim, elegant fingers. Stiles’ eyes flicked over to him, then stubbornly back to his task, the obstinate set of his shoulders and thin line of his lips showing just how ill at ease he felt.</p>\n<p>“Are you going to leave? Or continue sitting there for the rest of the day and drive my customers away?” he finally snapped, the silence between them proving too much. Derek, dressed in simple, unobtrusive shirtsleeves and riding breeches, merely rested his chin atop of his hand in reply, resisting the urge to gesture at the empty store. Stiles rolled his eyes dramatically and sighed through his nose, taking a pair of shears in hand and snipping the selvage edge off.</p>\n<p>“Just keep your hands off my work, and try not to distract me too much.”</p>\n<p> </p>\n<p align=\"center\">. o O o .</p>\n<p> </p>\n<p>Stiles hadn't expected Derek Hale, a noble of all things, to be quite as persistent as he was, but he was proved wrong. The sheer perseverance of the other man was almost mind-boggling, considering he’d not expected anybody to be as tenacious about doing almost nothing all day, every day. Then again, he wasn’t well versed in what nobles <em>did </em>on a daily basis anyway, so it wasn’t as if he had a base for comparison on how they wished to spend their free time.</p>\n<p>Scott had only visited him twice after the ball, but Stiles couldn’t blame him. He and young Lady Argent had only just gotten engaged, and he’d be neck-deep in social outings events that left no room for anything else. With a family to formally meet, gatherings to be seen at together and a marriage contract to sign, Stiles counted himself lucky that he’d been able to see Scott at all, and braced for a long, lonely stretch of time without seeing his friend.</p>\n<p>Derek Hale came to his shop almost every day, an hour or two after he’d opened up shop, and sat at the stool on the other side of the counter, away from his work desk. Every day he arrived, he came dressed in clothes simple enough to not outright declare him of noble blood, and watched Stiles with an ardent curiosity as he worked, asking the occasional question or making small talk as he measured and cut, pinned and stitched. Each time, Stiles slid over the parcel containing the wolf mask, expecting the noble to get the hint and take the offending item back. And, at the end of each day, Derek Hale left his shop, somehow pleased with the course of the day’s events (despite Stiles being preternaturally silent) and leaving the linen-wrapped package on the countertop, unmoved.</p>\n<p>Eventually, Stiles stopped bringing it out from under the desk. He let his mind believe that there was no point in doing so – not if the other man refused to take it back, let alone acknowledge its existence. And so, it remained tucked behind the calico scraps and boxes of spare spools of thread and packets of needles.</p>\n<p>He couldn’t seem to understand this particular brand of pestering, especially when Derek was reticent and restrained at the best of times. But his eyes were still that startlingly clear green-grey hue, warm and inviting, and the few times that Stiles found he was answering a question found Derek’s lips pulling upwards into a radiant, delighted smile, transforming his entire face. And, perhaps, Stiles felt his insides flutter when Derek <em>did</em> smile, and tried, as hard as he could, not to count those times as small, personal victories.</p>\n<p>The trouble was – well, there were many things wrong with their situation. Derek was a noble, and of good lineage, while Stiles was common-born, due to inherit nothing save for a lifetime of repetitive work, maybe an apprentice or two in his future to carry on his business name. And, after so many years of the same monotonous existence, with no family and fewer friends than he’d hoped for, Stiles had become nothing more than a bitter young man who could, on occasion, make beautiful clothes fit for actual nobles. Most times, however, he was reduced to making simple garb for the working man, making his complete existence lacklustre and mind-numbingly dreary.</p>\n<p>Day after day passed in the same manner, with Derek hovering across the table, pigheadedly refusing to budge, and Stiles caught himself appreciating the company. He hadn't realized just how solitary his day could be without the customers coming in constantly – it was an off-time, an awkward period between Spring and Summer, where his business dropped enough that he could work on more time-consuming commissions without people barging in and out of the store. What few customers did enter somehow managed to rope Derek into conversation, even if it was somehow a little brief and stilted on both sides, until Stiles managed to write down order slips and receipts in a quick hand to get them out of his shop.</p>\n<p>Stiles found that he was, unthinkingly, slipping the façade of carefully controlled distance and coolness that he’d built up against the other man. He hadn't think he’d warm up to someone so fast, but the earnest, sincere questions and looks that Derek sent his way made his restraint slip. More and more, he realized his mouth had been running away from him, chatting openly and joking along with Derek as he worked. Sometimes he even found his words taking on a tone that could be interpreted as flirtatious. He was always quick to pull back and resume his dispassionate demeanour, but it was becoming more difficult as the days passed. Especially when Derek’s stool, over time, edged closer to his work area, and Stiles didn’t say anything.</p>\n<p>The wolf mask, so haphazardly pushed below the counter, found its way upstairs to Stiles’ room. The muslin wrapping was gone, thrown back into the scraps box, and the papier-mâché disguise propped up against his low bookshelf. Some evenings, alone in his room with nobody for company save one of his books, Stiles found his fingers tracing along the ridges of the beast’s face, recalling the tinkling music of the ball and the large, warm hands against his back, against his bare palm. Those evenings were always the most difficult to go through, because his loneliness felt palpable and near-suffocating, and he couldn’t get out of his head for hours, endlessly stuck in a loop of fond memories that he had no right owning, and no right wishing for again.</p>\n<p>The days that Derek didn’t come to the shop were the worst. Because, inexplicably, Stiles had come to look forward to his visits, to their growing chatter and conversations. Derek never treated him as a lesser being because his blood wasn’t blue – he regarded him just as Scott did, as an equal. And, against all defences and resistances, Stiles’ affections grew stronger with each passing day, his veneer of indifference and coldness crumbling with each soft word, each cautious smile. The days that Derek didn’t occupy the stool (<em>his</em> stool, Stiles now considered) truly were the most unpleasant, because despite trying desperately not to give in to his emotions, he was becoming used to Derek being by his side, and that only seemed to emphasize his loneliness when he wasn’t around.</p>\n<p>Of course, word spread of Lord Hale’s presence in his shop, as was inclined to do in a town where nothing seemed more highly regarded than local gossip.</p>\n<p>It started slowly, at first, so subtle and unremarkable that Stiles didn’t notice for a long, long time. At first, it was glances from strangers on the streets, drawn-out looks that lingered for a moment or two longer than necessary. Stiles didn’t take it much to heart, because he was known to step out of the store in various states of dishevelment. And, as such, Stiles usually brushed off whatever curious glances he received with his usual aplomb. It was only when the stares were accompanied with hushed whispers, not so discreetly hidden behind a raised hand. It wasn’t bothersome, not at first, but Stiles could hardly walk down a street to buy a loaf of bread, or a new packet of thread, without garnering at least one gawp from a passer-by.</p>\n<p>“People are beginning to talk,” he offered inattentively, loosely basting down a lapel as Derek sat beside him at the worktable now. He was making himself useful by sorting his mess of buttons into organized containers, and Stiles almost startled at how close he’d managed to sit, how over time he’d moved his stool slowly enough for him not to notice. He felt it to be almost clever.</p>\n<p>“I don’t care,” Derek replied offhandedly, scooping the small piles of horn, wood and wool into their respective containers. His workspace cleared, he upended another box of fastens and began sorting the pricier, fancier ones, the pearl, silk and ceramic buttons appearing dainty beneath his broad fingers. “They already think most of the Hale family are eccentric beyond words. It’s not as if my reputation matters to me, after all – who are those people to judge me for what I want to do?”</p>\n<p> His eyes lifted from his word, settling on Stiles’, and the two shared a long, silent look. “Do you –care that I’m here?” he asked, his brows furrowing somewhat, concern etched on his handsome features. “I’m sorry, I didn’t mean to presume. If others are talking, and it’s bothering you - -”</p>\n<p>“It’s fine,” Stiles answered quickly, keeping his eyes to the work between his hands, as he felt his face grow warm. It was the best he could say at the time, even as his treacherous mind supplied him with a multitude of thoughts he could say – that Derek’s presence alone seemed to make his entire day worthwhile, that, for once in his life, he could wake up in the morning and not dread the dull repetitiousness of his every day. Stiles didn’t <em>have</em> a reputation to uphold – after all, he was a nobody, a small-town tailor that could have just as easily been overlooked in a crowd. It was Derek’s repute he was worried about, but he knew, from the stubborn set of the other’s jaw, that no amount of insisting would make him move off the stool and stay out of his store, out of his life. And a very selfish part of him, one that still remained in that glittering garden so many evenings ago, didn’t care about the consequences to come, if only Derek stayed by his side.</p>\n<p>“It’s fine,” he repeated, chancing a half smile at Derek, who returned it with a dazzling one of his own.</p>\n<p> </p>\n<p align=\"center\">. o O o .</p>\n<p> </p>\n<p>“So <em>this </em>is where you’ve been keeping yourself all this time, Derek,” Laura’s admonishing tone came imperiously from the doorway, and Derek visibly flinched, shooting her a panicked look. It had been such a good day, too – Stiles had been in one of his good moods, actively involving him in conversation as he worked and making almost flirtatious jokes with him, accompanied by his small, private smiles. And then, of course, Laura had to burst through the door and ruin <em>everything</em>.</p>\n<p>“Is there something I can help you with?” Stiles asked inquisitively from his work desk, wiping stray threads off his apron. For a moment, Derek’s heart caught in his throat as his eldest sister rounded on Stiles, worried that he might soon have to break up a fight. But Laura’s face suddenly took on an inscrutable emotion, and she quickly turned to the younger man with an affectionate look across her pretty features.</p>\n<p>“Oh, you’re <em>Stiles</em>. How silly of me. Do forgive me, I must take-” she reached across and yanked on Derek’s sleeve, hard enough to topple him from the stood and land awkwardly on his feet to avoid sprawling on the ground, “-my wonderful brother home for a chat. It was wonderful to meet you in person, Stiles, I hope to see you again soon.” And, flashing one of her usually delightful smiles, she heaved Derek out the door, her tiny frame belying the sheer force of her will. Derek had hardly a moment to look over his shoulder at the stunned face of the other and wave before Laura shut the door, gently but firmly, and dragged him around the corner of the building, where her horse was tied beside Derek’s.</p>\n<p>“Now I know why you’ve been quieter and even more enigmatic than usual,” she mumbled <em>sotto voce</em>, “Here I am, out of my <em>mind</em> with worry and thinking you might be doing something stupid like visiting gambling houses, or liquor dens, or, heaven forbid, a <em>house of ill-repute.</em>”</p>\n<p>“Houses of- Laura, what do you take me for?” Derek sputtered, trying his outright best to sound indignant, even as his face flushed with embarrassment.</p>\n<p>“<em>How was I supposed to know</em>?” she hissed, gesticulating enough that her dainty riding hat tipped off the pinned-up curls of her dark hair. Derek was exceedingly thankful that she preferred to wear her hair more naturally, because if she sported the silly <em>poufs</em> or <em>fontanges</em> that seemed to be the fashion, because he wouldn’t have been able to keep a straight face and take her seriously. Laura must have sensed his mind wandering, because she was quick to slap him sharply on the arm to bring his focus back.</p>\n<p>“The point is – Derek, I’ve been hearing rumours circulating that you’ve been fraternising with the lower-class servants.”</p>\n<p>“Stiles is <em>not</em> a servant, for goodness’ sake!” Derek snapped back hotly, helping Laura into her side-saddle, before untying both their horses and mounting on his own. “He’s a tailor, and a damned fine one at that. And even if he <em>were</em> a servant, it has nothing to do with anyone but ourselves.”</p>\n<p>“Does he feel the same way?” Laura asked, all the heat gone from her voice, her eyes soft-looking and worried as they steered their mounts away from the street. And, as if by magic, those six simple words had all the air deflate from his lungs. In all actuality, Derek had been avoiding thinking about the possibility of Stiles not returning his feelings, because it seemed too painful a concept. He’d been so sure, from the way they’d spoken at the party, and the telling argument that he’d made so long ago in the clearing, that Stiles, too, felt what he did. Now that it had been voiced, however, he wasn’t so sure.</p>\n<p>“I don’t – I think he might, but I don’t know for sure,” he murmured, eyes affixed to the road before them. “The way we talk – how he smiles at me more freely now, I thought that, perhaps, we were getting closer.”</p>\n<p>“And the status difference doesn’t mean anything to you?” his sister asked, as they turned off the cobbled streets and made their way down the grassy path of the vale, towards the Hale manor.</p>\n<p>“Not a bit,” he answered immediately, finding the honesty of the answer completely satisfying. “I would care for him whatever class, rank or division he was. I would care for him even if I were struck blind, deaf, or mute.”</p>\n<p>“‘<em>Love looks not with the eyes, but with the mind, and therefore is winged Cupid painted blind’.</em>” Laura recited, her lips curved upwards in a pleased smile. “I’m glad, at least, that you’ve found yourself someone like that, Derek. Mother and Father will be so pleased to hear that you’ve fallen in love, instead of having something arranged – they never could stand the idea of that. Seeing him today, and knowing what you’ve told me about him, he’s – different. From your other suitors, I mean. More himself, less eager to please at the cost of pretending to be something he’s not. Regardless, he seems to care for you too, in his way.”</p>\n<p>“The status difference is affecting him more than he’d care to admit,” Derek muttered, feeling put out. “I’m hoping that, given time, he’ll come to see my affections as sincere, not as a passing fancy.”</p>\n<p>“I suppose that, at the end of the day, the fallout from this will die down, too. I can’t possibly imagine what Stiles had to deal with, considering young Lord Birtrand and his fit earlier this week.”</p>\n<p>“… what?”</p>\n<p> </p>\n<p align=\"center\">. o O o .</p>\n<p> </p>\n<p>“I had wondered who it might have been that captured young Lord Hale’s attention so thoroughly,” came the smooth, charming voice from the front of Stiles’ shop. Stiles was already in a bad mood – Derek had left so early the day before, and it was well past noon – far later than the usual time he’d arrive, meaning that Stiles was facing a day without his company.</p>\n<p>“May I help you?” he asked, his lips already pulled into a frown as he turned towards the source of the words. A woman in an expensive silk gown rustled forward, with pinned curls of honey-gold piled in an elaborate pouf atop of her head and an incredibly insincere smile across her beautiful face, all of which raised Stiles’ hackles by default. Derek’s name had been mentioned, and, judging by how other people before her had all begun their conversation in the same way, it wasn’t going to be pleasant.</p>\n<p>“I just wanted to see what kind of person would charm that cantankerous young noble so,” the woman spoke, folding her hands prettily against the edge of the scrubbed wooden counter. From this close, Stiles could see the cold ruthlessness of her smile, the sharp dagger of her cold eyes, and felt chills down his back. “I needed to see for my own eyes what was so great about them that a man with such pedigree would stoop so low to have. I have my sources, you see, and they’ve been telling me just how much time Derek spends at your,” she cast her eyes around the workshop, lip curled back in distaste, “- quaint little hovel.”</p>\n<p>“This is it, I suppose,” Stiles replied with false cheer, extending his hands and gesturing to himself. “What you see is what you get. And, yet, I assure you there’s no magic spell at work. Just simple, plain old me, which, for some peculiar reason Lord Hale seems fond of annoying.”</p>\n<p>“You think this could work out, don’t you?” the woman hissed, and it would have been intimidating, had Stiles not already dealt with four of Derek’s other suitors in the past week, each threatening him with a form of bodily harm and to have him shackled in a prison cell for the rest of his days.</p>\n<p>“I said nothing of the sort, really,” Stiles replied calmly, picking up one of his ratty old pincushions and pushing his scattered pins into it. There was something to be said for pincushions and alleviating built-up anger. “What Derek decides to do, or not do, is entirely out of my hands. If he wants to spend his day wasting time by bothering me while I work, it’s nobody’s decision but his.”</p>\n<p>“I see what you are, really,” the woman – Lady Argent, he distantly remembered Scott pointing her out as Allison’s aunt once – smirked. “You’ve discovered what a pretty face you have, and so you’re currying favour with the nobles, trying to give yourself a leg up, is that it? I must say, if I had to live in a fleapit such as this, I’d use whatever means I had at my disposal to get somewhere less<em> infested</em>.” Stiles tried, goodness knows he <em>tried</em> not to blush with mortification at her gaze raking up and down his body, but obviously he must have failed, because her grin got that little bit sharper, a little crueller. “But mark my words, boy,” she continued, leaning forward enough to feel even more menacing than before, even with a table between them, “Nobles and commoners don’t mix. Sure, Derek might have a little fun with you now and then, but like marry like, and you’d be thrown out on the street the moment your usefulness has run its course.”</p>\n<p>“Derek is a gentleman, <em>my lady</em>,” Stiles sneered, his shoulders squaring. “Nothing has occurred in this place that could be considered untoward.”</p>\n<p>“Whatever the case might be, you need to understand that it’s not your place to be associated with anybody of a higher standing than yourself. Keep to your own, boy, and I might not have to get the city guard onto you for indecent behaviour. I’m sure a face as comely as yours won’t do well in the barracks.”</p>\n<p>She was out of the building before he could formulate an answer, and, thoroughly shaken, Stiles turned the sign to signify his shop’s closure for the day and locked the door tightly. Struggling to take in a proper lungful of air, he slid to the floor with his back against the door and hugged his knees tightly, counting the inhalations in his head and forcing himself to breathe slowly, even with his body’s need to take in great, sucking lungfuls.</p>\n<p>He couldn’t go on much longer this way, that much he knew. Derek – somehow, since the night of the ball, something remarkable had happened between them to draw each other closer, like the pull of a magic spell. Shy at first, they’d become increasingly closer, and Derek – he’d slowly become so dear and precious to Stiles. In a night so full of glittering treasures, in a gorgeous world he had no right to be a part of, Stiles had felt small, still and obscured. But Derek had found him, had sought him out, and now – now, there was nothing Stiles could do to convince himself that he wasn’t in love with him.</p>\n<p>Deep down, buried far beneath the rising tide of selfishness that wanted to keep Derek all to himself, he knew that a situation such as this could not work. He’d taken up far too much of Derek’s time as it was, indulging his longing for his company, for those rare, joyous smiles he gave him. In the past, he’d tried desperately to make Derek understand, regardless of his insistence, that their futures were not meant to be together. Derek would marry noble blood, and raise a family of fine children to carry on the name, while Stiles – if Stiles was lucky, perhaps, he too might find someone to love one day.</p>\n<p>It was a form of torture, not accepting Derek’s affections, despite every fibre of his being wanting to, desperately yearning for it. But for both of their sakes, it was something that had to be done.</p>\n<p> </p>\n<p align=\"center\">. o O o .</p>\n<p> </p>\n<p>Derek hadn't visited Stiles’ shop for three days running, four if he included that afternoon where Laura had unceremoniously dragged him out of the store. His days had been hectic and eventful, considering what he’d had to go through with Laura to tell his parents about his choice to be with Stiles. The situation had been exhausting, especially in trying to get his affairs in order. Surprisingly enough, his parents had been only slightly hesitant to give their blessings when he’d mentioned Stiles’ rank, but in the end, they’d had no choice in the matter. Their own marriage had been built out of love, and there was no denying Derek’s affections for the tailor were genuine.</p>\n<p>The moment he stepped into Stiles’ workshop, he knew something was wrong. Stiles, usually so hard at work already, was leaning against his worktable with his arms, his face drawn into an expression of unhappiness. And while that alone might have made his chest clench, it was the way that Stiles’ eyes lifted to him and lingered, clear and wide and forlorn, that made his breath halt completely.</p>\n<p>“I don’t think you should come around here anymore.”</p>\n<p>Those words had the same effect as that time Ginger, his childhood pony, accidentally kicked him in the stomach and laid him up in bed for three days straight. Except, somehow, this made him feel a lot worse.</p>\n<p>“What’s happened?” he asked immediately, his mind already running through a list of all the possible circumstances that would have brought a frown to Stiles’ face. One possibility after another crossed his mind, from financial troubles to personal problems, before he finally processed the words properly – Stiles didn’t want <em>him</em> coming around anymore. His body went cold at the thought. “Someone’s said something, haven’t they?” he stepped forward, closing the distance between them. Laura had told him about some of the nobles coming to Stiles, poisoning his mind with lies – the same nobles that had tried to curry favour with him, to woo him as marriage prospect. “Has somebody threatened you? Tell me who they were – I won’t stand for you being harassed.”</p>\n<p>“You’re just not <em>listening </em>to me!” Stiles shouted, thumping his fist against the flat surface of his desk in frustration. “I don’t want you here! You don’t <em>belong </em>here!”</p>\n<p>“Why are you saying this now? What’s changed?” Derek cried, confused and hurt, stepping forward again until there were barely a couple of paces apart. He’d thought they’d been getting closer, becoming something more than friends, slowly but surely. Stiles had smiled at him more, talked to him more openly. Just the other day, their hands had brushed against the table, reaching for the same thing, and Stiles hadn't jerked away immediately. Before, he’d have given anything for Stiles to be looking at him so intently, but the way he was now, it felt like finality, like a goodbye. “Stiles – why are you telling me this now?”</p>\n<p>“You and I were never supposed to meet,” Stiles sighed wearily, running a long-fingered hand through his hair, making it stick up oddly. “We were supposed to live our lives apart. We still are. But every day, you come into my shop and sit at your stool, and you talk to me and make me feel like – this isn’t – you’re not supposed to be here, with me, Derek. You’re supposed to marry a beautiful, rich noble and have your children and live in your big, expensive manor.”</p>\n<p>“What I’m supposed to do doesn’t matter,” Derek entreated, closing the distance between them completely and taking one of Stiles’ hands between his. It was the first time he’d initiated contact since their first encounter in his garden, and the mere touch sent a thrilling, warm bloom up his entire arm. “Stiles, you’re all that matters to me. Each and every day, you’re all I think about. Why do you want me to leave so badly?”</p>\n<p>“I don’t want you here,” Stiles murmured, his eyes downcast, sending what felt like a cinderblock into the pit of Derek’s stomach. As if from afar, he watched the way Stiles seemed to shrink in on himself, the smooth column of his pale throat as he swallowed heavily, exhaling with a shaking breath. “You need to leave, and not come back.”</p>\n<p>Taking a deep inhalation of his own, Derek didn’t move for a long moment. His eyes raked over Stiles’ downturned face, desperate for a sign that it was false. But Stiles’ expression was closed off, betraying nothing but remorse, and it made the situation all that more painful for him. After what felt like an eternity, he nodded once, tersely, and stepped back, releasing Stiles’ hand, his expression detached and impassive.</p>\n<p>“I understand,” he said finally, hearing the tone of his voice coming across as cold, dispassionate, making Stiles flinch. “If you want me to leave, then I will. I’ll respect your wishes; I’ll go, and I won’t come back.” Ducking his head, feeling lost, Derek turned and stepped away, his footfalls echoing and loud in the silence of the shop. He paused a moment, almost at the door, and turned around to catch a glimpse of Stiles, one last time, before he left, even as his mind told him it was a foolish, weak thing to do – he’d always been a foolish, weak man at heart, after all. “I only wish,” he spoke, regret colouring his words and unable to hold the sentiment back, “That I could have stopped myself from falling so deeply in love with you, if I had known you wouldn’t feel the same in return.”</p>\n<p>Not daring to look at Stiles again, for fear he wouldn’t be able to tear himself away from this place, Derek turned and left, shutting the door quietly behind him. He didn’t leave immediately, despite all common sense telling him it was the right thing to do. Instead, he leaned his back against the sturdy panelling of the door and exhaled, standing stock-still for a minute or two, willing his composure back in place.</p>\n<p>Which is how he was able to hear the quiet, broken sob from inside.</p>\n<p>Lost to all other senses except the need to be right beside Stiles in that very moment, Derek wrenched the door open and stepped back inside quickly. Stiles was standing at his bench still, a stricken look on his face and the tracks of tears still wet upon his cheeks. He mustn’t have expected Derek to be there, and he was quick to scrub his palms against his face to erase the evidence, but Derek had seen enough to know. It was enough to break him.</p>\n<p>“Why would you act as if you didn’t care?” he demanded, striding forwards, feeling incensed and exasperated and distraught all at once. “Why do you reject me, time and time again? You know my feelings for you are true, and I can see it in your eyes that you share my affections.” He reached out, holding Stiles by the arms, not sufficiently tight to hurt but firm enough that he couldn’t get away, not again. “Don’t you see how much I care about you? Why won’t you let yourself feel the same?”</p>\n<p>“Because I <em>can’t</em>!” Stiles cried, the words wrenched from him, struggling to keep the tears from falling even as his voice broke with unshed emotion. “I <em>can’t</em>. I’m not good enough! I’m just a tailor! I was born into a low class to ordinary people. I can’t – I will never be good enough for you.”</p>\n<p>“I don’t <em>care</em> if anybody thinks you’re not good enough!” Derek roared, “You’re good enough for me! You’re all that I want! And if anybody has issues with whom I love, they’ll have to speak to my entire family, because they know about it now.”</p>\n<p>“You told them,” Stiles choked out, a disbelieving laugh making his words sound even more choked than before. His hands rose and perched against Derek’s chest, as if to push him away, but instead they simply rested against the fabric of his shirt. All of Derek’s rage seemed to dissipate in that moment, and he let out a soft exhale, lips curled up in a small, amused smile, even as his heart was still clenched in knots.</p>\n<p>“Please,” Derek begged, cupping Stiles’ face and wiping the tracks of his tears away with a thumb, “I’ve never been one for pleading, Stiles, but I beg of you – give this a chance. Give us an opportunity to be together.” Even now, Stiles was as breathtaking as the first time he’d set eyes on him, despite his face being blotchy and tear-stained. His eyelashes, wet from the tears, clumped together into long, angelic curls, and the colour was high on his cheeks. He was terrifyingly beautiful, both inside and out. “I swear that I would spend the rest of my days making you happy, making you want for nothing. I would love you eternally, entirely, if you just said yes.”</p>\n<p>“It’s not as if I have much choice in the matter, do I?” Stiles replied, sounding desperately fond through his sniffles as he nuzzled into Derek’s palm, sending tingles throughout Derek’s entire being. “Not unless I want to spend the rest of my life wallowing in regret, not being with the man I fell in love with.”</p>\n<p>Derek was frightfully glad the shop was bereft of customers and the door latched behind him, because he couldn’t contain the jubilant laughter that erupted from him, or the crushing need to heft Stiles into his arms and hold him nearer than ever before. He felt Stiles’ hands grasp desperately at the back of his shirt, pressing them even closer, and knew for certain that, whatever hardships might come their way because of this, it would be more than worth it to have all of Stiles.</p>\n<p> </p>\n<p align=\"center\">. o O o .</p>\n<p> </p>\n<p align=\"center\">\n<strong>EPILOGUE – SIX MONTHS LATER</strong>\n</p>\n<p> </p>\n<p>He was awoken by gentle fingers trailing through his hair, and the softest press of lips against his bare shoulder. Mumbling incoherently for a few moments, Stiles shuffled in the soft comfort of the bed, the exquisite sheets like heaven against his skin as he creaked his eyes open, simultaneously searching for the source of the touch, while at the same time wanting to shut his eyes against the pale morning light seeping through the curtains and drift back into the restful embrace of sleep.</p>\n<p>“It’s morning, sleepy-head,” Derek’s amused, soft voice murmured by his ear, and Stiles exhaled happily, twisting over to curl himself around the figure sitting on the edge of the mattress, dipping the feather-stuffed mattress down on one side.</p>\n<p>“Good morning,” Stiles smiled sleepily, catching one of Derek’s hands in his own and tangling their fingers together with only minimal fumbling. Derek smiled in return, bringing their hands up to kiss along Stiles’ knuckle.</p>\n<p>“I brought you breakfast,” he stated, almost crowing with pride as he nodded to the silver platter of food on the bedside stand, the delicious, warm aromas from the plates already making Stiles’ mouth water.</p>\n<p>“You mean you woke up early and harassed Gloria for the tray,” he chuckled. “Derek, you do realize that she’s getting grumpy because you’re stealing one of her jobs away from her, right?”</p>\n<p>“It’s not my fault I like to bring you breakfast while you’re sleeping sometimes,” Derek retorted with a grin, kissing the inside of Stiles’ wrist and eliciting a delicious little shiver from it. “Besides, I’m not the one who continues trying to make our bed in the mornings.”</p>\n<p>“Gloria keeps telling me off about it,” Stiles groaned, twisting downwards into the sheets. “It’s still hard to get used to it, you know? Even if we’ve been here two months, I still can’t believe I’m living with you. In a <em>manor</em>, of all places.”</p>\n<p>“It’s hardly a manor when it’s a third the size of my family’s house, and has only four staff,” Derek deadpanned.</p>\n<p>“It has a <em>stable</em>, and <em>kitchens</em>, and there are eight rooms and a <em>dining hall</em>, Derek, please excuse me if it takes me a little while to adjust.” His pout didn’t last long, not when Derek was bending down to nuzzle against his cheek, his scruff tickling him. “Speaking of which, we spent all day fixing the doors and partitions of the stables, I’m <em>tired</em>. It’s still too early to be out of bed.”</p>\n<p>“Laura’s coming over later for tea, along with Cora.”</p>\n<p>“Oh, thank you so much for reminding me, like I didn’t know that Cora was harassing me without pause for those new gloves I’m embroidering,” Stiles grouched. “I swear, she wholly and utterly <em>despised</em> me until she found out I was the one who made those gloves, and even now she barely tolerates me, unless she asks me to sew her something.”</p>\n<p>“You could just say no.”</p>\n<p>“I <em>could</em>, but I like embroidery too much to give it up altogether.”</p>\n<p>“You’re not exactly giving up your craft, considering we’ve moved your tools and table down the corridor and you’re working on our suits for the McCall wedding.”</p>\n<p>“And we’ll be the best-dressed couple there.” Stiles grinned smugly. “Including the bride and bridegroom.”</p>\n<p>“I’m sure we will,” Derek agrees, his smile sincere. “Now, are you going to get out of bed soon? We have to ride into town to do an inspection on your parent’s house, make sure the new tenants are keeping it in good condition.”</p>\n<p>“Couldn’t I have a little longer?” Stiles pleaded, making his eyes as wide and innocent as possible. “I’m still feeling <em>ever</em> so tired. Especially since we didn’t get to sleep until the early hours of the morning.”</p>\n<p>“It’s not my fault,” the older man chided, though his ears turned red at the tips, something that Stiles took great delight in. “We were <em>supposed </em>to have an early night last night. You can just get very –” his eyes travelled down the length of the bedsheets, twisted around Stiles’ legs in a manner that showed just how much he appreciated Stiles foregoing nightwear. “– distracting.”</p>\n<p>“Then by all means, my Lord,” Stiles laughed, wrapping his arms about Derek’s neck, his heart giddy with a joy that was almost too great to bear, “Allow me to be even more of a distraction to you.”</p>\n<p>“You’re a menace, that’s what you are,” Derek smiled with utter devotion, sinking down to press Stiles up against the pillows, capturing his lips in a deep, lingering kiss. Stiles sighed blissfully against his lover’s lips as Derek’s hands wandered, pushing the linens down and out of the way, his fingers a searing brand against bare skin. Someday, he thought idly as Derek’s larger frame covered his, he’ll become accustomed to the storybook, magical perfection that his life had become, complete with the love of his life. Until then, he was glad to keep marvelling.</p>\n<p>Needless to say, they were quite late for tea.</p>\n<p> </p>\n<p> </p>\n<p align=\"center\">\n<strong>THE END</strong>\n</p>\n<p align=\"center\">\n<img src=\"http://i39.photobucket.com/albums/e161/Yiji/Fic-Line-Break-Image_zps040a7dc4.jpg\" alt></p>"
}