{
  "id": "11457669",
  "url": "https://archiveofourown.org/works/11457669?view_full_work=true",
  "author": [
    "dirgewithoutmusic"
  ],
  "title": "a life of smoke and silvered glass",
  "rating": "General Audiences",
  "archive_warnings": [
    "Major Character Death"
  ],
  "categories": [
    "F/M",
    "Gen"
  ],
  "fandoms": [
    "Harry Potter - J. K. Rowling"
  ],
  "relationships": [
    "Lily Evans Potter & Severus Snape",
    "James Potter & Severus Snape",
    "Albus Dumbledore & Severus Snape",
    "James Potter/Lily Evans Potter"
  ],
  "characters": [
    "Severus Snape",
    "Lily Evans Potter"
  ],
  "additional_tags": [
    "I don't know how this happened",
    "what even",
    "i am compromised about severus goddamn snape and i am UPSET ABOUT IT",
    "Good Severus Snape",
    "i guess",
    "less shitty severus snape at least",
    "he's a caustic little thing and apparently i love it",
    "with only a few bare steps away from canon",
    "Lily Evans Potter & Severus Snape Friendship",
    "WE COULD HAVE HAD IT ALL"
  ],
  "language": "English",
  "series": "Part 15 of boy with a scar",
  "published": "2017-07-10",
  "completed": null,
  "words": "27,794",
  "chapters": "1/1",
  "comments": "1,171",
  "kudos": "13,139",
  "bookmarks": "3,253",
  "hits": "171,549",
  "summary": "<p>Albus Dumbledore rose to his feet, smiling at them in that way of his, like he knew something you didn't and he was proud of you for it. \"Friends,\" he began.</p>\n<p>The door thudded open and the Marauders burst in, late and pink-cheeked with cold. The headmaster smiled at them, too, and Sirius gave a cheery little salute back.</p>\n<p>Severus sunk lower in his chair, staring witheringly over his butterbeer. \"You told Potter about it, too?\"</p>\n<p>\"He might as well put all that energy to good use,\" said Lily. \"And, to be accurate, I told Remus.\"</p>\n<p>\"But Potter, really?\" said Severus.</p>\n<p>\"He and Black cooked up a jinx that gives you a boil every time you say a slur to a Muggleborn,\" said Lily. \"It was either invite them to Alice's war club or bake them cookies, and I know where my skills lie.\"</p>\n<p>Severus sniffed. \"Don't come crying to me if he tugs your pigtails.\"</p>\n<p>\"Come crying to me if he pulls yours, and I'll deck him,\" said Lily.</p>\n<p>(Slight AU in which Severus apologizes, tries harder, and stays friends with Lily)</p>",
  "notes": "<p>anonymous asked:<br>i have a prompt for you: what if snape hadn't called lily 'mudblood' that day. what if their friendship had stayed strong, unbreakable. would he have grown to be a better person? would lily have loved him, rather than james? would harry just have another godfather? would james and lily have survived?<br> </p>\n<p>And I sort of answered.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>If you wanna chat or see my other writing, come follow me at ink-splotch on tumblr or ejadelomax on twitter!</p>",
  "text": "<p>When Severus was seven, he fell in love with the girl down the street. She had long red hair and dirty knees and she offered him half her candy bar one drizzly afternoon, waiting outside the school for her parents to come pick her up.</p>\n<p>His parents weren't coming— dad working late and mum at the pub recounting old Hogwarts glory stories, talking of years when her life was magical-- but he didn't tell Lily that. He was just waiting for the older bully boys who lurked in the empty lot on his way home to get bored and leave.</p>\n<p>He ate the candy slowly in neat little bites while she grinned and told him about her big sister's feud with the science teacher, like her Tuney was some sort of hero in a political espionage drama. She talked with her hands, narrow little things with freckled backs. He watched her wave from the back window of her mother's car and then he started the long walk home.</p>\n<p>When Severus was fifteen, James Potter dangled him upside down in the quad and laughed. Severus landed on elbows and knees. The bruises would stay for a week. The memories would not die with them— James's cocky grin, the laughter in the spring air, the long whip of Lily's red hair.</p>\n<p>He felt small, bug-like, his knees pressing into the grass. His mother would come home some nights, kick the threadbare carpet, rattle the battered old pans in the cupboard, curse a Ministry that hated purebloods, that sucked up to halfbreeds and Mudbloods, that left the true wizards to rot in filth. He would curl up, make himself small, bug-like, imagine a chitinous shield growing over his shoulders, his spine, the softness of his kidneys. Some days, his father slept through this. Some days he screamed back.</p>\n<p>After Severus met Lily, he would curl up under his covers, small, bug-like, and read through the comics she'd lent him with his hands pressed up over his ears. He wanted Professor X to come take him away. He wanted to be someone special, someone saved. He wanted a giant to burst through his door and frighten his mother and offer him a squashed birthday cake and a way out.</p>\n<p>When Severus was fifteen, he slammed to his knees on the green Hogwarts quad. Laughter burrowed into his ears, like curses, like the nights his father screamed back, and when Lily stepped toward him he snapped, \"I don't need help from a <em>Mudblood</em>.\"</p>\n<p>--</p>\n<p>When Severus slouched up to her door that summer, Lily didn't invite him in. She leaned on the open frame of the door, arms crossed. He had so rarely seen Lily neither smiling or incandescent with rage, but she watched him with snakeskin eyes and a set mouth, still.</p>\n<p>\"I'm sorry,\" he said. \"I didn't--\"</p>\n<p>She twitched a strand of hair over her shoulder, the irritation the closest thing to an emotion he could spot on her. He was watching, desperate-- this was Lily, she gave things away. She talked with her hands. He never felt lost, with her. \"But why,\" said Lily. \"<em>Why</em> are you sorry? Because I'm upset, or because what you did was wrong?\"</p>\n<p>\"I didn't mean to hurt you.\"</p>\n<p>\"You did, and it's not the point. I don't care if it's the part you care about, Sev, it's not the part that matters. That was an awful thing to say-- to say to <em>anyone</em>. You were cruel because you were scared and embarrassed, but Sev I could really care less. You were <em>cruel</em>.\"</p>\n<p>\"I'm sorry,\" he said again.</p>\n<p>\"Sorry's not enough, Sev. Be fucking better.\"</p>\n<p>He jerked back and tried to turn it into some kind of laugh. \"Language, careful, your mum might hear.\"</p>\n<p>She shrugged, and stepped back through the open door, and shut it in his face.</p>\n<p>He spent the summer reading comic books, haunting the local library, then the local park once it'd closed, and then sneaking home when he was hopeful his parents would be asleep. He tried to think about bravery, but sometimes he just thought about Lily's hair, the way it went more golden in summer. He tried to think about nobility, ethics and grace, but the clouds chased each other, fat and white, across the sky and he wasn't sure what any of this had to do with him.</p>\n<p>His father took him fishing by a dreary brown creek and they sat in silence. Severus could hear every creak of the rods, every lap of the water, every inhale and movement his father made. He thought maybe if he just said nothing, nothing ever, he'd never say anything again that made Lily's face go so flat and distant. If he said nothing, maybe nothing would hurt.</p>\n<p>His father reached back for a beer can in a swift movement and Severus froze himself unflinching. He sat in that silence afterward, slowing his heartbeat, picking apart the sudden rigid shell of his shoulders. His father hummed, cracking the can open like a gunshot.</p>\n<p>He sat alone on the Hogwarts Express that year, stuffed in a compartment with a handful of second years who gave him half the seats while they giggled among themselves about the haircut of someone named Gertrude. Every summer's end, for five years, he and Lily had boarded the train together, pressed their noses to the window glass, and watched the land rush by.</p>\n<p>For the first month of school, Severus practiced pausing before he spoke, for seconds, minutes if he needed them. Sometimes he'd add an answer after the conversation had already moved on, bent over his mashed potatoes, weighing words as carefully as he weighed salamander eyes and mandrake root.</p>\n<p>(If you crushed firedrake seeds with the flat of your blade, instead of cutting them, they made a more potent potion. The textbooks told you to stir six times counterclockwise to make Sleeping Draught, but he knew--because he had thought, and tried, and tried again--that if you did five counterclockwise and two clockwise the draught would turn that perfect turquoise and the sleep would be dreamless and sweet and deep. He kept notes in his textbook's margins, because it helped to remember.)</p>\n<p>In the second month, he tried to listen. People were starting to think about life after school, a big yawning chasm they were supposed to fill with themselves. People were starting to fall in love, puppyish and petty. People were starting to believe in the war, whispering, dreaming, fearing.</p>\n<p>In the common room, one of the kids said something about Mudbloods and Severus's head snapped up. He tried to imagine a shell growing into his shoulders, over his spine, covering all the soft parts of him. He wanted his covers, he wanted to shrink, he wanted Lily's boxfuls of comics, but he rose to his feet and snapped back. Sometimes saying nothing hurt people, too. A small Muggleborn in green and silver ducked away to her dorm, clutching quietly at her sleeves.</p>\n<p>For the third month, he tried to watch-- not for warning sneers or cocky grins, clenched fists and broad shoulders, all the things he'd been watching for since before he could name them-- but for the way shoulders might go rigid, the way fists might clench but hide, wishing for something to shield every soft part of them.</p>\n<p>Severus was bony and pimply, sixteen years old and graceless in it, but he could be an interruption. He could mock with the best of them, flicking his brows and twisting his nose, and asking pointed questions. He could talk, smart-mouthed and snide, until the focus turned to him, and then he could survive anything they handed out. He could give as good as he got. The pauses were shorter, these days, before he spoke, but they would always be there, an echo offset from the shout, an avalanche that struck late and terrible.</p>\n<p>When kids cried in bathrooms or empty classrooms or the library, he didn't move to comfort them, though he heard them. He didn't know how. He wrote his own curses, out in the forest where he could scar the trees in experiment, and they all turned out bloody. He loved few things, even Lily, as much as he loved pouring all of himself into his work, until something new and his own grew out of it. He wasn't sure he'd ever invented something kind.</p>\n<p>He didn't try to find Lily, but he came back from the Forest once and almost tripped over her, half-napping in Hagrid's pumpkin patch. He stumbled back into a gargantuan gourd while she pushed hair out of her face and peered up at him.</p>\n<p>\"I'm sorry,\" he said, after a pause that rumbled and roiled in his gut, that he clung to with both hands, breathing into it and letting his shoulders go soft. \"I'm sorry I said it. I'm sorry I made you feel small because I was feeling-- small.\"</p>\n<p>Lily sat up a bit, in the little semi circle she'd built herself of books and scrolls and gobstones and snacks. She had built fairy circles like that, when they were children, of the flowers he'd transfigured for her.</p>\n<p>\"I'm sorry anyone has to feel that way, ever,\" he said. \"They shouldn't. I'm angry anyone has to feel that way.\"</p>\n<p>\"Me, too,\" she said, and, fishing around in the detritus that surrounded her, handed him half a candy bar. \"C'mon, you want some tea? Hagrid said he'd put a kettle on for me if I finished my Arithmancy.\"</p>\n<p>--</p>\n<p>When Severus was in sixth year, Remus Lupin almost killed him on a moonlit night.</p>\n<p>Severus had wanted answers, had wanted to get them in <em>trouble</em>, had wanted something a bit like vengeance, and Sirius had told him about the Whomping Willow. Sirius had grinned when he'd done it, small and bitter, and Severus had wondered if he was fighting with James again, wondering why else he'd sell out his friends.</p>\n<p>\"I didn't think--\" Sirius tried, the morning after, watching Remus across dry toast and cocoa, big juicy bowls of melon.</p>\n<p>\"You never do,\" Remus snapped. (A bare handful of years later, standing in the smoldering ruins of James and Lily's house, Remus would think about Sirius's erratic gaze, the sharp edge of his voice, his last name, and wonder if he should have seen it coming. What here was premeditated? What was mischief? Sirius had once almost painted Remus's own hands with red blood.)</p>\n<p>But for now, Remus was sixteen and angry; he was sixteen and guilty of things that might have happened. He didn't speak to Sirius for a month.</p>\n<p>James refused to speak with Sirius, too, but he only lasted a week. Moony was sulking and Peter was busy studying his little heart out, and James got twitchy without proper and regular socialization.</p>\n<p>\"I'll punch him in the nose,\" said Lily, when Severus told her. She shifted where she sat cross-legged on the library table, like she might go off and hunt him down that second.</p>\n<p>\"Black doesn't deserve the attention,\" said Severus.</p>\n<p>\"Getting his ass kicked by a girl? That type of attention?\"</p>\n<p>\"Getting his ass kicked by Lily Evans,\" Severus said. \"It'd be an honor and you know it.\"</p>\n<p>--</p>\n<p>Reports of violence outside Hogwarts got worse. People were disappearing. People were whispering, fearing. The papers were ignoring the important things, and feeding off the fearmongering, or so Lily announced in the library while Severus was trying to study.</p>\n<p>Alice and Lily had spent years sharing hissed rants in humid greenhouses. Over an undulating bed of luminescent deadly nightshade, Alice bent her head close to Lily's and asked, \"Have you heard of the Order of the Phoenix?\"</p>\n<p>It took a series of introductions, arguments, and passwords, but a few weeks later Lily trudged out to the Hog's Head to meet with a group of interested students and graduates. Severus followed behind her, crunching his boots down on top of the smaller footprints she left behind in the snow.</p>\n<p>\"Is it legal for the Headmaster to recruit students to his guerilla army?\" Severus wondered aloud, shoving his freezing hands into his armpits.</p>\n<p>\"Shush,\" said Lily.</p>\n<p>When they got into the pub, Severus tried to pretend that no one was looking at him. The only other Slytherin was Kingsley Shacklebolt, now an Auror trainee at the Ministry. Severus tugged Lily over to a pair of seats where he could sit with his back to no one.</p>\n<p>There were a few adults in the group-- Professor McGonagall, who was perched stiffly on a stool, a slightly smelly man who appeared to be stashing an empty mug into his bag, and a small woman with flyaway hair who had cat dander all over her knees.</p>\n<p>Albus Dumbledore rose to his feet, smiling at them in that way of his, like he knew something you didn't and he was proud of you for it. \"Friends,\" he began.</p>\n<p>The door thudded open and the Marauders burst in, late and pink-cheeked with cold. The headmaster smiled at them, too, and Sirius gave a cheery little salute back.</p>\n<p>Severus sunk lower in his chair, staring witheringly over his butterbeer. \"You told Potter about it, too?\"</p>\n<p>\"He might as well put all that energy to good use,\" said Lily. \"And, to be accurate, I told Remus.\"</p>\n<p>\"But <em>Potter</em>, really?\" said Severus.</p>\n<p>\"He and Black cooked up a jinx that gives you a boil every time you say a slur to a Muggleborn,\" said Lily. \"It was either invite them to Alice's war club or bake them cookies, and I know where my skills lie.\"</p>\n<p>Severus sniffed. \"Don't come crying to me if he tugs your pigtails.\"</p>\n<p>\"Come crying to me if he pulls yours, and I'll deck him,\" said Lily.</p>\n<p>--</p>\n<p>At their third clandestine meeting, Dumbledore pulled Severus aside. Severus kept to the side in these meetings, anyway, so Lily didn't even notice him go.</p>\n<p>Out in the cold side alley, Dumbledore put his hands in the pockets of his robes and watched Severus slowly. Severus felt weighed. After a long moment he lifted his chin and looked back.</p>\n<p>\"Severus,\" said Dumbledore. \"I am going to ask something difficult of you. It would mean not coming to meetings anymore. It would mean... a lot of things.\" In the decades they would fight this long, quiet war together, Severus would come to know Albus Dumbledore better than most. He would see him tired, see where his enigmas faded into exhausted despair. He would come to know that this hesitancy was something the headmaster would grow out of-- one day, when asking children to give their lives for the cause, there would be no stumble to this man's voice.</p>\n<p>\"I do want to be here,\" Severus said, quiet and trying his best not to be angry with it. \"I'm not--\" He took a breath, a pause, clung to it with two hands that were trying to be patient. \"I know what side I'm on.\"</p>\n<p>\"Of course,\" said Dumbledore. \"That's why I'm asking this of you.\" He glanced back through the open door, to where Lily was listening intently to Alice.</p>\n<p>Words brimmed in Severus's throat, but he didn't say them. <em>Not just for her. </em></p>\n<p>\"It will be difficult,\" said Dumbledore. \"It may be heartbreaking. But having a man on the inside might save lives.\"</p>\n<p>Severus snapped his gaze back to Dumbledore. \"You want a spy. You want <em>me</em> to be a spy?\"</p>\n<p>\"In the war that is coming? I think we will need one. We are going in blind and things are only getting darker.\"</p>\n<p>\"I want to fight,\" said Severus, and it was still quiet. \"I want to stand up for things, for once.\"</p>\n<p>\"This is the fight,\" said Dumbledore. \"I know what I'm asking, Severus. I know the sacrifices I am asking. But we need you.\"</p>\n<p>In the warmth of the pub, Lily was talking with her hands. This was a problem for the mug of butterbeer she was holding, which was spilling on her shoes.</p>\n<p>\"Someone has to,\" Severus said, the words feeling dull on his tongue. \"And I won't look out of place there.\"</p>\n<p>He stopped coming to the Hog's Head. Dumbledore told him to tell no one, but he told Lily.</p>\n<p>When he and Lily met up, now, it was out at Hagrid's after dark or snuck into the kitchens to visit the house elves after hours. When the stained glass peach giggled, Lily liked to giggle right back, even in those days. They toasted each other with hot chocolate that never got lukewarm and they didn't talk about the war.</p>\n<p>At meals, Severus sat with Avery and Mulciber. He drifted through their conversations, picking at his potatoes, answering their words seconds and minutes too late. \"I thought that Evans had you wrapped around her little Mudblood finger,\" said Avery.</p>\n<p>Severus scraped the tines of his fork across his plate. \"Seen her mooning around Potter lately?\" he said. Avery had already continued on into discussion about holiday plans by the time he said it, but they were used to their housemate's lags by now. \"Found a pretty rich boy and dropped me to the curb.\"</p>\n<p>In classes, he sat with Narcissa. He could pretend to hate Lily. He could conjure up his mother's bitter rhetoric on his tongue. But he'd prefer not to tank his studies, and Narcissa at least would see his precise notes as not goodness but ambition.</p>\n<p>When Mulciber said hateful things in the Slytherin Common Room, Avery sniggering, Regulus squeaking in wide-eyed amusement, Severus didn't stand. He didn't snap out anything. He didn't laugh, either. He smiled, a cold little thing he'd practiced in the mirror again and again, just the thinning of lips and the lift of a brow.</p>\n<p>--</p>\n<p>\"Here comes the graduate!\" said his mother as Severus pushed through the front gate, his bag slung over his shoulder.</p>\n<p>\"You'd think he was coming home from the wars, Eileen.\" But his father came down from the front step to clap Severus's shoulder and try to take his bag. Severus's hand tightened on the strap.</p>\n<p>\"Actually, I need that,\" he said. \"I'm not staying long.\"</p>\n<p>His father's brow was furrowing. Severus looked him in the eye, like he had with Dumbledore, like he did when he smirked at Avery's jokes. \"I've gotten a job,\" he said. \"An internship, dad.\"</p>\n<p>\"Where?\"</p>\n<p>\"A sort of grassroots political movement,\" Severus said and didn't choke on any of the words. \"Handing out flyers. Going door to door.\"</p>\n<p>\"And it pays?\"</p>\n<p>Severus smiled. It was almost involuntary, the way one corner of his mouth twisted cold and slow. \"In experience.\"</p>\n<p>He turned his head a fraction and saw his mother watching from the step. \"This is the group you've been mentioning in your letters? Who Avery and Mulciber's parents work with?\"</p>\n<p>Her eyes were bright and proud. He could hear the pots of the kitchen clattering in the back of his head, the door slamming, her kicked curses and bitter mutters. \"Good,\" she said, \"I think you'll do good,\" and Severus's smile held and held.</p>\n<p>He let his father give him some advice. He let his mother kiss his cheek and he lied when he said he'd write. He looked her in the eye when he said he'd write. Then he adjusted his bag on his shoulder and walked to Lily's house.</p>\n<p>He could have Apparated. Someone might see him walking this way, and realize who was at the end of it. But he needed to walk this way again-- past this old elm, the swingset in the playground, the little yappy dog in the yard in front of the yellow house, and the big dog in the yard on the corner, who was always asleep under the jasmine. He knew the cracks in this concrete. He knew the sun on his shoulders.</p>\n<p>He knew Lily was at the end of this, like she had been for years-- bright hair and bright eyes, conning him into helping with chores, laying on their stomachs in her room and scribbling in the margins of his textbooks because he liked records, liked recordings, liked having things he could flip back to and look at when he forgot. She had stood cold in her doorway once, giving him nothing, and he had almost walked away and not come back.</p>\n<p>The magnolia tree outside of Lily's house was dropping wilting petals on the walk. He stepped over the brown husks. Lily would have kicked them and sent them scattering, for the sake of the sound if nothing else. Severus lifted his head and there she was, hurrying down the steps and dragging him inside.</p>\n<p>\"Careful, you're not supposed to be here,\" Lily said, shutting the door behind her and drawing the kitchen curtains-- airy things, embroidered yellow and white.</p>\n<p>\"I wanted to say good-bye, first,\" he said. \"In case.\"</p>\n<p>\"Oh, Sev,\" said Lily. \"Okay.\"</p>\n<p>\"You head out--\"</p>\n<p>\"Next week,\" she said. \"Dumbledore says Alastor Moody is going to teach us new kids some tricks, but I think it's mostly just to see what we're made of.\"</p>\n<p>They didn't know what they were getting into. They were eighteen years old and they thought that was grown. They had signed on for a fight and they didn't know what the end would be. Petunia was rolling her eyes from the other side of the room and they thought that was the worst she could ever do.</p>\n<p>Severus ate the sandwich Mrs. Evans thrust at him when she saw his skinny bones lurking in her kitchen. Lily gave him a hand-held radio. \"Muggle airwaves,\" she said, \"so I don't think they'll be listening. I put some extra protections on it, anyway, but we'll still have to be careful.\" She wrapped his fingers around the black plastic case. \"Because this isn't good-bye, okay?\" She squeezed her fingers over his. \"You'll be alright, won't you?\"</p>\n<p>He told her he'd be fine. He looked her in the eye when he said it.</p>\n<p>Severus Apparated out to Diagon Alley to meet Avery at the Leaky Cauldron. The inside of the pub was as muggy as the summer's day he'd left outside. Clouds were beginning to claw over the blue and turn the sky overcast. It did nothing for the dull heat. Avery lifted his head from his pint and grinned when he saw Severus. \"Hey, Snape,\" he said. \"You ready to save the world?\"</p>\n<p>It started with favors. Severus got a dingy little apartment and a job stocking the back shelves of Florescu's ice cream shop. When asked, he carried unmarked packages from one place to another. He went to dark little back rooms of restaurants or the reception halls of mansions and listened to rhetoric he could spit out as well as any of them.</p>\n<p>He didn't meet Tom Riddle, called Voldemort, until two months in. Tom was still beautiful then, with his dark hair and long fingers and that smile. He'd barely entered the room before Severus felt soft pressure against the walls of his mind, seeking hands, and so he offered up all his discontent. Severus thought about feeling small. He thought,<em> I know why I'm here, </em>and pretended for a long, cold moment that the heart of it was hate.</p>\n<p>He didn't call his mother, but he met Dumbledore in the ice cream shop's massive freezer and passed him vials of wispy memory. He surrounded his bedroom in Silencing Spells eight inches deep and radioed Lily as summer turned slowly to fall.</p>\n<p>More and more of Lily's stories started to be about James. Severus remembered sitting on the school steps and listening to her talk about Petunia arguing with teachers four times her nine-year-old size about homework and human rights violations. He hadn't heard a Tuney story in years, just caught her sideways glare and ladylike sniffs when he visited over summer vacations.</p>\n<p>He hadn't heard stories for ages, but he wasn't sure Lily ever gave up on anyone. Maybe she should, but he was grateful all the same that she didn't. He was grateful, but he was also listening to daily recountings of her adventures with James Potter, and he was trying not to be bitter. Be better, not bitter, Sev. She's happy. She's alive.</p>\n<p>Lily saw her first action a week after Severus did. Still high on adrenaline, she whispered to him until almost dawn the night after-- light and fire, the way fear balled up in her throat, how she'd dropped her wand but punched a Death Eater in his jaw. Remus had healed up her knuckles and Alice had snogged Frank in the aftermath and Moody had called them all infants.</p>\n<p>\"They were going for the Prophet's editor's grandchildren,\" Lily said sleepily. Severus sat cross-legged on his tucked bedspread, books open around him, overbrewed tea cold where it was levitating beside his left shoulder. \"Susie-Lynn and Anthony. They're off in-- off somewhere safe, now.\"</p>\n<p>\"Good,\" he said. Then, \"Did Potter tell you you'd never looked prettier than you did covered in blood and dirt and rage?\"</p>\n<p>\"Oh you shut up,\" she said, and he could almost hear her blushing. He almost smiled, and he knew she could almost hear it, too. \"He did, actually,\" she added. \"<em>Don't</em>-- don't say anything or I'll-- I'll tell Mum about the summer our third year, with the slugs, don't think I won't!\"</p>\n<p>Severus didn't tell her about his first action.</p>\n<p>He'd come home smoky and ashen the week before and flicked on the radio and told her instead about the birthday party of an eighty-six year old he'd glimpsed from the back of the ice cream shop that morning. They had stolen each other's dentures with <em>Accio</em>, cackling old grievances and scorning each other's sundae choices. \"It's true,\" Lily had said. \"Pistachio and bubblegum is a garbage combination.\"</p>\n<p>\"But what about with cookie bits on top,\" Severus had said, trying to pretend he wasn't slumped nearly facedown on the bed, unmoving from the place he'd collapsed as soon as he walked in. \"Doesn't that just pull the whole thing together?\"</p>\n<p>Maybe if he was braver he'd have told her about green flames. Maybe if he'd loved her less he'd have told her about conjured fire, a stubborn Muggleborn's empty childhood home, how he had stood there in the ghastly flickering light, trying to figure out what he would have done if it hadn't been empty. If anyone had been home. If they hadn't run fast enough.</p>\n<p>He had thought, as they burned timber and bedding, tables and rugs and patterned wallpaper--<em> if I could separate Crabbe from the group, get him alone to Stun</em>. He had thought,<em> if I could distract them, if I carried a pocket-sized Portkey, if I'd learned how to do Cloaking spells wordlessly</em>. Then he had snatched up all those thoughts and set them to the side and told himself, <em>No</em>.</p>\n<p>\n<em>If none of those things worked. If they were home, and we were here with fire in our hands, and there was no way to save them without betraying the mission-- what would I do? </em>\n</p>\n<p>\n<em>What will I do? </em>\n</p>\n<p>But he had told Lily instead about the way wispy old heads of white hair had been laid on bony old shoulders, the way the gang had snuck all their extra cherries into the little paper cup of the friend they knew loved them the most. And she had talked about how excited she was, how nervous, to be going into the field for the first time in just a week.</p>\n<p>They spoke at night-- not every night, but many of them. Severus felt like he was drowning, some days, and Lily wasn't a lifeboat but she was a reminder to keep treading. Three months later, his radio chirped in the middle of a chilly afternoon. He looked up from a book on Portkey creation and frowned at it.</p>\n<p>He flicked the radio on but didn't say anything, in case it was a trap. Deviation from standard protocol. Something to be wary of.</p>\n<p>\"Sev?\" said Lily and he frowned more. \"Mum died. Stroke. They weren't expecting-- The funeral's on Tuesday. <em>Sev</em>.\"</p>\n<p>\"I can't go,\" he said.</p>\n<p>\"I know,\" she snapped, not unkindly. \"But I needed you to know, I needed--\"</p>\n<p>\"Yes,\" he said. \"I--sorry. I'm so sorry, Lily,\" he said. \"She was wonderful,\" he said, and listened to her cry on the other end of the line.</p>\n<p>Lily went to watch her mother be buried beside her father under a grey spring sky. Lily was not yet so well known that she had to go in disguise, but Severus imagined her in black, pale and still and silent, her hands folded in her lap, and that seemed like disguise enough.</p>\n<p>Mr. Evans had died in the summer after Lily's fourth year at Hogwarts, and back then Severus had been able to hug her, and hold her hand at the funeral, and buy her candy bars after. He spent this day flying classified packages all over Scotland, only pausing in his routes to pry their protective spells open, note their contents, and piece their protections perfectly back together.</p>\n<p>He gave the information to Dumbledore by vial-- a dozen snippets of open packages, the locations and faces of the senders and recipients. \"You're doing good work here, Severus,\" the old man said. Ice was gathering in his long beard.</p>\n<p>Severus didn't answer, didn't lift his quill from his clipboard, just continued to note down the amounts of chocolate ice cream and rainbow sorbet on the shelves. The work had to get done, and why not now.</p>\n<p>On a warm summer night, Severus and Mulciber were sent after an Order informant named Elwin Monroe, who lived at the far edge of a small wizarding village to the north. He had a vegetable garden of blossoming squash plants. They'd been given the assignment late, with no time for Severus to get word to the Order to spirit Monroe away. He and Mulciber grabbed some curry from the village shop and then went through the paved streets by foot.</p>\n<p>\"You got no head for spice, Snape?\"</p>\n<p>\"Sweet tooth,\" said Severus and Mulciber laughed all the way up the front walk.</p>\n<p>They were alone. The little house was quiet. The squash vines were blooming in the yard. They pushed their way into the front hall and Severus drew his wand. The door clicked shut behind them. Mulciber yanked up his hood and moved forward, starting to kick in doors. \"Oy, Mr. Monroe, you have <em>visitors</em>.\"</p>\n<p>\"<em>Avada kedavra</em>,\" Severus whispered at Mulciber's back, but his wand only sparked feeble green. His gut coiled coldly. His mouth twitched. He was here because at seven he'd fallen in love with the girl down the street. He didn't have enough hate in him.</p>\n<p>He adjusted his grip on his wand. He whispered, \"<em>Petrificus Totalus</em>.\"</p>\n<p>\"You need to get out, away,\" he told the old man who stepped into the hallway, blinking and clutching at his shirtsleeves over Mulciber's rigid form. \"Get to Albus, or Minerva. You didn't see me,\" he said, and he realized it was true with his hood hiding his face. Monroe vanished and Severus hoisted up Mulciber's stiff body and Apparated out to drop him in the Atlantic. The sea spray soaked into his robes. He cast a cleaning spell over it when he hit land again and then he limped to Avery's.</p>\n<p>\"The Order,\" he gasped on Avery's doorstep. \"They got there first. They got Mulciber.\" He thought about Lily alone at a funeral, imagined Mrs. Evans's kitchen going up in magicked green flames, tried to will grief and rage onto his visage.</p>\n<p>Avery gripped his elbow. \"Those bastards,\" he said and his voice shook with it.</p>\n<p>Severus met his eyes. \"We'll get them.\"</p>\n<p>But he couldn't murder every partner he got sent out with. He kept untraceable Portkeys in his pockets. He passed Dumbledore wispy vials of secrets and sabotage in the ice cream shop's freezer room. He learned how to cast Cloaking Spells wordlessly. But sometimes none of that mattered.</p>\n<p>Sometimes he watched. Sometimes he helped. Sometimes when he woke up from nightmares he could not begrudge whatever higher entity had sent them down-- could not curse them for the way his limbs sweated and shook, for the way he limped to the toilet and vomited up the images curdling in his gut. He just knelt on his rough rug and let the shivers take him, let the bile coat his tongue.</p>\n<p>In the Order's camp, life went on. Alice married Frank Longbottom in a ten minute civil ceremony that would have made Frank's mother disown him if it wasn't wartime and if she'd had more heirs. Lily was there as a witness, but not a bridesmaid-- Alice hated fuss.</p>\n<p>\"I want to see you,\" said Lily over the radio on a frigid Friday. It was almost summer, again, but the weather hadn't seemed to notice. \"I know it's hard to get away, and hard to get away safely, but I haven't seen you in over a year.\"</p>\n<p>\"It's dangerous,\" said Severus. \"Why now, Lils?”</p>\n<p>\"There's something I want to tell you,\" she said, and he knew she was chewing on her fingernails, the way she kept saying she'd outgrown.</p>\n<p>\"Then tell me.\"</p>\n<p>\"No, I want to <em>see</em> you. I want to know you're okay-- okay in general and okay with this. Your face is going to do a <em>thing</em> and I want to see it.\"</p>\n<p>Severus wasn't sure his face had done a thing in years. His lifted his eyebrows and one corner of his mouth, like at one of Avery's jokes, as though in query. The mold on his ceiling didn't seem impressed. \"Tell me anyway,\" he said.</p>\n<p>\"It's my news, Sev.\"</p>\n<p>\"Are you getting a tattoo of Potter's face on your bicep?\"</p>\n<p>\"<em>Sev</em>.\"</p>\n<p>\"You've signed me up for pottery classes with Petunia. McGonagall has formally adopted you. Black has been turned into a giant canary and you need me to brew up a potion to turn him back-- joke's on you, I won't do it. Oh, no, wait, he'd be terrifying as a giant canary. I will make you a Shrinking Potion, but that's all.\"</p>\n<p>\"I'm getting married,\" said Lily.</p>\n<p>Severus took a pause in both hands, held onto it, breathed into it. \"To Remus?\" he said.</p>\n<p>\"To James, you dishrag.\" She sighed, the sound rough through the speaker. \"You're my best friend,\" she said. \"I wish you could be there for it.\" Severus watched the tendrils of mold creeping across his ceiling. \"I miss you, Sev.\"</p>\n<p>\"Yeah,\" he said.</p>\n<p>\"Come visit. Be as paranoid and careful as you want, but come.\"</p>\n<p>Severus took a route that went through six European countries and one North African, used two brooms, a Portkey, a couple hops of Apparation, and four Cloaking spells. He finally stumbled to a stop under a streetlight in north London, drowning in a ratty sweater and baggy Muggle jeans, his hair tied back under an ugly knit cap.</p>\n<p>He wiggled his toes in his boots for a long moment before taking the steps two at a time and knocking. When the door opened, Lily was standing there.</p>\n<p>\"So you weren't done growing,\" he said, because she was a bare inch taller, and she reached out and dragged him into the house and into a hug.</p>\n<p>He hoped one of them had had the sense to shut the door behind him, maybe toss up a few shielding spells, but he didn't care and didn't check. He just buried his face in the top of Lily's sunshine hair and screwed his eyes shut. \"You!\" she said. \"You're really here.\"</p>\n<p>\"You asked me to come,\" he said and she pulled back and smiled at him. Her hair was longer, braided over one shoulder. She looked tired, with hollower cheeks and dark circles and bright eyes.</p>\n<p>\"I missed you,\" she said.</p>\n<p>Her voice was different in person, and he'd almost forgotten.</p>\n<p>\"You said.\"</p>\n<p>\"You missed me, too, you dork. Now come <em>on</em>.\"</p>\n<p>Lily had her hand tight around his as she dragged him up to the attic and he watched the place his sallow skin met her freckled fingers. She squeezed her grip once more as she pulled him up the last step and into a cluttered room done up with Cloaking spells so thick that even Severus relaxed a little. A young man stood up from a bare crate, shoving through his hair with one hand and giving an awkward half-wave with the other.</p>\n<p>\"James,\" Lily said, smiling ear to ear. \"This is Severus. Sev, James.\"</p>\n<p>\"We know each other,\" said Severus.</p>\n<p>\"You <em>don't</em>, though,\" said Lily. She sat down, then hopped up to shove Severus gently into another chair. Severus shifted his weight on the old chair experimentally, listening to the squeak of wood and screws. He looked up after a wordless moment to find Lily staring at him with pained intensity.</p>\n<p>\"You look like a skeleton, Sev, this is awful,\" Lily burst out. She leapt up again.</p>\n<p>\"I eat,\" he said. \"I do fine, Lily.\"</p>\n<p>\"I'm getting tea, and I'm getting bread, and I'm getting <em>jam</em>,\" said Lily. She fled toward the attic door.</p>\n<p>The moment Lily ducked out of the attic, James turned to him with a gaze so earnest that Severus gripped the edge of his chair and glared back. \"I was a dick to you, in Hogwarts,\" James said.</p>\n<p>\"Um,\" said Severus and then frowned at himself. He detested filler words. But maybe this was a special occasion.</p>\n<p>\"I'm sorry,\" said James. \"You've got perfect right to hate me, but I'd like it if we could be friends.\"</p>\n<p>Severus gripped his chair harder. He considered this. James--was the sky purple? were all the pig-flying spells all over England failing for one shining moment? was his mother's basement freezing over?--<em>waited for him to find his words</em>. \"It would make certain things simpler,\" Severus managed.</p>\n<p>James grinned, cheeks creasing, and Severus had forgotten he was handsome. It was frustrating. \"Lily has made it extremely clear that no matter what I think of you or you think of me that you're not going anywhere without her.\"</p>\n<p>\"I go a lot of places without her, these days.\"</p>\n<p>\"That's not what I--\" James sighed, scrubbing a hand over his face. \"You're important to her, and I love her so much. You were there for her, mostly, when I was a raging dick-- and I was a raging dick to <em>you</em>. And you were a raging dick, too, but--\"</p>\n<p>\"Stop groveling,\" said Severus. He would have liked to have interrupted earlier, but it still took awhile to get his thoughts in order. \"You're bad at it.\"</p>\n<p>James stopped and blinked at him with those dumb pretty eyes. What color was that, even. What right had it to look warm.</p>\n<p>\"I've been hearing about you for years, now,\" said Severus. \"And anyway I trust Lily's judgement. You don't have to prove anything. You don't have to <em>apologize</em>.\"</p>\n<p>\"But I want to,\" said James, and oh lord the earnestness was making Severus itchy. \"I don't like who I was. I don't like who I'd have grown up to be.\" He hesitated. \"And I think you understand that, better than most.\"</p>\n<p>Severus's cheeks were lifting just softly, and he wondered why he felt like crying before he realized-- no, this was just a smile, tucked away in this dark attic. He creaked the chair back and forth for a second and then he said, \"It's hard to survive Lily and not end up better for it.\"</p>\n<p>James laughed and Severus's eyes flicked up to him, startled. \"Yeah,\" he said. \"I bet someone could resist it, but god I'm glad I'm not him.\"</p>\n<p>Lily clomped up the last of the steps, the tea balanced precariously on an old cutting board. She had three pots of jam and she set them down before Severus like a challenge. \"Hey, boys,\" she said. \"What you talking about?\"</p>\n<p>\"Your fiancé’s hair is stupid,\" Severus told her.</p>\n<p>They spent the whole rest of the day and night cooped up there, but James and Lily had patrols to run and weddings to headline in and Severus had some sort of heinous appointment with Igor Karkaroff and a Gringotts vault of ugly, heirloom curses. He also had a list of spells twelve inches long that might just be able to turn their break-in pear-shaped (or a list that would have been twelve inches long had his life been so blessed that he could write such things down ever).</p>\n<p>\"I'm happy for you,\" he said, before he left. Severus didn't look Lily in the eyes when he said it, just squeezed her hands in his, because he meant it. She squeezed back. He wrapped her up in his arms and she buried her nose in his shoulder. \"I'm so happy for you,\" he said.</p>\n<p>\"Me, too,\" she said and pulled back, sliding her hands down his arms to grip his hands again. \"Take care of yourself, Sev.\" She kissed him on one cheek and he tried not to blush about it. \"And this still isn't good-bye.\"</p>\n<p>Lily Evans married James Potter under a bespelled blue sky. Petunia did not attend, and neither did Severus. Lily's father walked her down no aisles, but Hagrid brought giant, beautiful squash blossoms from his garden for her bouquet. Alice (now Longbottom) painted up her eyelashes while Remus worked patiently on her nails. Sirius, Peter, and James passed around a flask of whiskey Sirius had stolen from his father's best stores.</p>\n<p>While Severus distracted Karkaroff with talk of Quidditch prospects and tugged and tweaked and amplified and cloaked the guard spells on a Gringotts vault, the girl down the street became Lily Evans Potter. She kissed James to the sound of cheers and catcalls. Almost everybody she loved was watching her laugh, watching James pick her up and swing her around and crush her into a hug that involved only happy crying.</p>\n<p>James asked McGonagall how she could manage to look disapproving even on his wedding day, grinning ear to ear. Albus wiped his tears with his long white beard. Alice romped around the dance floor with Lily, both of them smiling furiously, almost flying, impossible to catch. Mad-Eye Moody gave a speech, only stopping twice during it to throw friendly hexes at any of his cadets he didn't think were being vigilant enough. He called Lily \"a reckless hellion child,\" and he called James \"damn lucky.\"</p>\n<p>Severus collapsed into bed at four the next morning, the tips of his hair singed with dragon flame and his throat sore with unspoken spells. If Lily had pinged his radio for a congratulations or a hello or a good-bye, he hadn't been around to hear it.</p>\n<p>There were few things Severus didn't give to Voldemort. He gave him waking nights and ugly mornings, the power behind his wand and his hands and his mind. When he felt that gentle invisible pressure along his temples, he gave himself small and buglike under his childhood covers, the banging of pots, the thump of a boot, and his father screaming at his mother. He gave himself in makeshift labs out in the Forest, the gouges deep into the tree bark, the hot joy of something new dug out of his chest and made real.</p>\n<p>He gave him the transfigured flowers in his hands at seven years old, half a chocolate bar on schoolhouse steps, the way ugly words had boiled in his throat on his bruising knees in a green Hogwarts quad-- but not sitting with James in peaceable dark, talking about surviving Lily Evans.</p>\n<p>The more Severus gave, the less Voldemort would search. Severus had told Albus Dumbledore once that he wouldn't look out of place here, and he didn't. He understood how someone could believe in this garbage, could feel at home here, but he had given himself better things to hold onto.</p>\n<p>When he overheard Dumbledore's interview in the Three Broomsticks with Sybil Trelawney, he gave Voldemort that, too. He didn't give him the vials of wispy memory in his pockets that he meant for Dumbledore, but he gave him the rest of it-- spotting Albus in the streets cluttered with autumn leaves, following him quiet as a shadow, dropping in a nearby booth to hide behind a mug, ghosting up the stairs to lurk. He didn't realize.</p>\n<p>Severus was used to Lily being one of the pillars of his world, the heart of his orbit, the voice in his ear. Maybe he should have known her story would change the whole world, not just his own. But he heard a prophecy through a locked door-- power he knew not, things thrice defied-- and he didn't think <em>oh god, it's Lily and James</em> until too late.</p>\n<p>Albus figured it out on his second listen-through of the prophecy, holding an empty vial in Fortescu's ice cream shop's freezer room-- but he didn't tell Severus. In this world he needed to tempt Severus into nothing, not yet. This would only complicate things, and Albus was outgrowing any need for hesitation here.</p>\n<p>Lily radioed on a tepid Thursday night and told Severus she and James were pregnant. Severus had a few moments of only-somewhat-complicated joy before his heart turned to lead and dropped down to pool in his toes.</p>\n<p>\"When are you due?\" said Severus, and he was still smiling, because this was good news.</p>\n<p>\"The end of July,\" said Lily and everything in Severus's body turned into a static buzz.</p>\n<p>\"I,\" he said. <em>As the seventh month dies. </em>\"Lily--\" <em>Thrice-defied.</em> \"Lily, he's going to come after you, he's going to, there's a-- I didn't, I didn't <em>know</em>.\" <em>Oh god,</em> he thought, <em>oh god it's James and Lily</em>. \"I didn't think--\" said Severus and he almost choked on it. He hadn't thought-- yes, where had his pauses vanished to?</p>\n<p>\"I know,\" said Lily. \"We know. We're going into hiding. Albus found a prophecy. There's something special about our kid, or there could be. Him, or Alice's boy.\"</p>\n<p>\"Alice had a boy?\" said Severus, dull, numb. \"Leaving me out of all the gossip, Lil.\"</p>\n<p>She gave a wet little laugh. \"Neville, his name's going to be Neville, and he's not here yet. We're placing bets on Frank fainting in the hospital, and Remus is knitting him a baby blanket.\"</p>\n<p>\"You're going into hiding,\" Severus said, still dull, still numb, still bursting. \"Neville. That's a nice name.\"</p>\n<p>\"I can't tell you where. We're getting a Secret-Keeper.\" There was a rustle, like Lily was rolling over. \"I wanted it to be you, but Albus says you're under too much pressure, and too much surveillance, so we're asking Sirius.\"</p>\n<p>\"Lily, I'm the one who told him, Lily, I gave him the prophecy.\" Severus's breaths were caught in his staticky chest. His lungs were wet paper bags and his hands were shaking.</p>\n<p>\"I know.\" Her voice floated through, distant and warbling, as though through water or sludge. \"That's your job right now, Sev. It's okay. That's what you're supposed to do. You can't get caught, okay, you can't.\"</p>\n<p>\"<em>You</em> can't,\" he said. \"You can't, okay, you <em>can't. Lily</em>.\" Flickering green flames were burning up the Evans family kitchen in his mind, the yellow and white curtains burning and blackening, even though Severus knew Lily hadn't been there in months. They'd boarded it up and put it on the market.</p>\n<p>\"Hey, um, this is James? Lily's crying-- ow, Lils, I mean uh she's having Emotions but in like a really manly way-- ow, okay, a very ladylike way? And, Snape, dude, I think you're having a panic attack, so I thought I'd help out with this talking bit. Everyone, breathe?\"</p>\n<p>\"Oh fucking shut up, Potter,\" wheezed Severus. \"You're not comforting, you're a peacock cursed with human speech.\"</p>\n<p>\"Ir's going to be alright,\" James went on. \"Sirius is going to brag forever that we love him best, but don't worry, we love you all equally.\"</p>\n<p>\"Go fly into a tree.\"</p>\n<p>\"I have never flown into a tree in my life,\" James said. \"And if Lily has been telling you otherwise, well, she's a dirty liar trying to turn you against me.\"</p>\n<p>\"Not gonna be hard to do.\" Severus shoved his forehead against the radio's blocky side, trying to force air in and out of his chest cavity.</p>\n<p>\"Lies,\" said James as Severus dropped a hand against the thick weave of his bedspread, willing the pattern into the skin of his palm. \"You sent me a <em>hat</em>. It wasn't marked but I know it was you. It matches Lily's eyes.\"</p>\n<p>\"That was because your hair is <em>stupid</em>, you incorrigible bastard, and should be <em>hidden from innocent eyes</em>.\" Severus pushed himself up to shaky feet and went for a glass of water. He pressed the heel of one palm into the rickety counter and put the radio down next to it. He could feel his heart beat in his fingertips.</p>\n<p>\"It's going to be alright,\" James said.</p>\n<p>\"But what if it's not.\" Severus took a long drink of water and only got a little down his shirt front.</p>\n<p>\"We're going to fight with everything we've got and you know it,\" Lily said, rasping on it a little. James better be fetching her a glass of water at that very moment. He probably was, the considerate ass. \"Sev, I don't want to talk about this. I want to talk about happy things. Sev, I'm going to have a baby.\"</p>\n<p>\"Yeah,\" said Severus. He scrubbed at a cheek, scowling when he found it damp. \"You are, Lils.\" He padded back to sit on his bed. He didn't own any other place to sit. \"I hope it looks like you and not your ugly husband.\"</p>\n<p>\"Me, too,\" said James. \"Here, Lily, you should hydrate.\"</p>\n<p>Three weeks later, Severus came home to his landlord fighting off the biggest tawny owl he'd ever seen in his life. There was a lot of hooting and hollering from each of the respective individuals and Severus had something he was trying to pretend wasn't a migraine. \"Excuse me?\" he said and the landlord stumbled back from the bird.</p>\n<p>\"Mr. Snape.\" He pushed his glasses back up his sweaty nose. \"I was just trying to move this down to my office for safekeeping, but this monster <em>attacked</em> me.\"</p>\n<p>The owl had dropped back down to perch on a large package wrapped in brown paper, where it was now grooming itself with off-handed arrogance. The package was tied in twine. Severus squinted at the thick scrawl of handwriting in the center of it, which read <em>Slimy Git</em>.</p>\n<p>\"Yes,\" he said. \"I believe that's mine. Thanks, sir, if you'll excuse me?\"</p>\n<p>He approached the package warily once the landlord had left, but the owl hopped peaceably off of it and then followed Severus into the flat. He dug around in his cabinets for some old dry cereal the owl accepted dubiously and then sat down to open the package. He could feel the protective spells recognizing him, peeling away softly to let him in.</p>\n<p><em>This is an old hand-me-down of mine</em>, read the note strewn on top of soft, silver folds of what seemed to be a cloak. <em>Figured the missus and I wouldn't have much use for it for a bit, but you might. </em></p>\n<p>Severus slipped his fingers under the silky fabric and watched them vanish. \"Of course James had an Invisibility Cloak at school,\" he told the tawny owl. She nibbled serenely on her cereal. \"Of course he did.\"</p>\n<p>The cloak wouldn't take an illusion spell when he tried one, the magic sluicing off silkily, which was rather suspicious in terms of how much of a spoiled git Potter must be. \"Old hand-me-down, like a goddamn ragged sweater,\" he said and then jerked away at a sudden tug at his shirtsleeve.</p>\n<p>The culprit hooted at him with soft disapproval and went back to nibbling on the loose thread at his cuff. Severus put his wand down.</p>\n<p>He put the Cloak in the bottom of his bag, below his Portkeys and his everyday potions (some for lying, some for hiding, some for transformation, some for healing, some for truth, some for mercy). The owl hung around, so he started picking up mice from the Emporium and fruit from the grocer's and leaving his window open for her at night.</p>\n<p>It was the end of summer. Severus sweated through the worst nights and shivered through others.</p>\n<p>\"Guess what?\" Lily's voice came over the radio on a Wednesday that had felt about three weeks too long-- Severus might burn the robes he'd been wearing, might lay down in bed and never get up. But Lily's voice was half a shriek and half a whisper and he lifted his head to hear it better. \"I've got a <em>kid</em>. He's eight pounds and he screams like a hellbeast and I am <em>never</em> doing this again, I already know for <em>sure</em>, that was <em>wretched</em>.\"</p>\n<p>\"Lils,\" Severus said, and that's all he could do. His throat was thick and his chest was so full he could barely fit any air in. If she'd been there, he'd have hugged her so tight. If she'd been there, he might have cried on her and she'd have laughed at him.</p>\n<p>\"But he's perfect, Sev. My <em>son</em>. We're calling him Harry.\"</p>\n<p>\"Tell me everything,\" Severus said, and Lily did her best.</p>\n<p>\"You're his godfather, you know, on my side,\" Lily whispered through the radio near the end of the call. Harry was sleeping on her chest, she'd said, and Severus laid back on his bedspread and tried to imagine it-- her long red hair, the purple bags under her eyes, and a tiny dark head cupped under her slender palm and its freckled back. \"Sirius is his on James's. Oh, shush, don't you say a word-- you'll have to share. Or compete and spoil Harry rotten, I don't mind. I'll keep him humble.\"</p>\n<p>\"Like you could teach humility to a mouse,\" Severus said.</p>\n<p>\"You charmer,\" said Lily. \"Oh, shit, I think he's hungry. I'll talk to you later.\"</p>\n<p>Severus felt like he was just waiting for it, all those weeks before it happened. Trying to convince the tawny owl not to rip off Bellatrix's fingers when she reached for one of his letters, and he was just waiting to hear they'd found the Potters. Whispering to Lily over the radio, trying not to wake the baby, and he was wondering if this would be the last time he talked to her. Walking back from Avery's, and he was scanning all the newspaper headlines for the news-- FAMILY OF THREE FOUND DEAD. EX-HEAD GIRL AND HEAD BOY OF GRYFFINDOR KILLED BY DARK LORD.</p>\n<p>\"Have you heard?\" said Bellatrix, reclining onto the plush seat back in Lucius's third-best sitting room. \"Big night last night.\"</p>\n<p>(\"Have you heard?\" Lily said over the radio that evening, and Severus almost collapsed with relief to hear her distorted voice even though he'd known by then that it wasn't her. \"It's terrible news.\")</p>\n<p>Bellatrix's hair was a mad cloud, but unlike most of the other Death Eaters Snape knew how long it took her to get it to that perfect chaotic mess. She stretched, her spine curving, her smile curving. \"Rodolphus and I and little Crouchy the Crotchety Junior made a visit to the Longbottoms. Sanctimonious fucks-- you remember them from school, Snape?\"</p>\n<p>(\"We got there, but not in time,\" Lily whispered. \"It was terrible. There wasn't any blood, because Cruciatus isn't like that, you know, it's not-- but we could hear them screaming-- I could hear Alice just <em>screaming</em>--\")</p>\n<p>\"They had a cute little hide-away spell up, but you know how baby Barty is with those.\"</p>\n<p>(\"They haven't woken up,\" Lily said. \"Neville's with his grandmother, in hiding, thank god. They're in St. Mungo's, and they say they might not wake up, or if they do they might not ever, not ever--\")</p>\n<p>\"Frankie tried to get between us and her, of course, and,\" Bellatrix sniggered. \"I told him to wait his turn.\"</p>\n<p>(\"It's Alice,\" said Lily. \"And <em>Frank</em>. I don't even know how to--\" She was crying. James was in the background, voice indistinct. Severus laid on his bedspread and stared up at the mold on the ceiling. He would sleep tonight, eventually, but not for a very long time.)</p>\n<p>\"Should have seen her little weasel face when Rodolphus grabbed her by the hair.\" Bellatrix shook out her hair, grinning up at the ceiling. \"God, I'm going to marry that man.\"</p>\n<p>\"I'm sure you'll be very happy,\" said Severus. \"Excuse me, Bella, but I have actual work to do.\"</p>\n<p>\"Wet blanket,\" she called after him.</p>\n<p>Severus finished everything that had been asked of him-- from Voldemort, Avery, Lucius and his dumb posh voice. He bought a mouse for the tawny owl. He met with Dumbledore in the freezer room and passed him clinking handfuls of vials. \"I marked a few in blue I think are urgent,\" he said. Then he climbed the steps to his room, dropped the mouse on the counter, and fell into bed.</p>\n<p>His radio made a short, sharp sound and after a long moment he reached out to flick it on.</p>\n<p>\"Have you heard?\" said Lily. \"It's terrible news.\" He closed his eyes.</p>\n<p>--</p>\n<p>Severus was waiting for it, and then it came.</p>\n<p>\"Guess what,\" said Bellatrix, draping herself over the counter like she was some kind of hanging moss with too great an affinity for eye makeup.</p>\n<p>\"You and Crabbe are eloping,\" Severus said. He didn't look up from the Sleeping Draught he was brewing in Avery's kitchen. There was a meeting tonight and he'd promised Goyle some potions for his kid, who was having trouble sleeping through nights.</p>\n<p>Bella cackled, swinging a foot at him but missing. \"Rodolphus might kill ya for that.\"</p>\n<p>\"I can take Lestrange,\" said Severus. \"Hand me the newts' eyes, there?\"</p>\n<p>She slid it along the counter to him, almost knocking some of his papers off the edge. When he glared at her, Bella giggled triumphantly and he fished out a newt's eye. She said, \"The Potters' Secret-Keeper squealed.\"</p>\n<p><em>No</em>, he thought. <em>Oh god, </em>he thought. <em>Oh god, it's Lily and James. </em></p>\n<p>The newt's eye disappeared into the thick liquid with a <em>plop</em>. Bella stretched up to rifle through Avery's cabinets, looking for something to eat or fiddle with or steal, snickering. The potion was grey sludge. Severus's whole body was static. \"Do you know what he said?\"</p>\n<p>She shrugged, one cheek stuffed with a marshmallow. \"The Dark Lord went himself.\"</p>\n<p>\"You don't know where.\"</p>\n<p>\"You don't <em>ask</em> the <em>Dark Lord</em>--\"</p>\n<p>\"Excuse me, Bella,\" he said. Avery asked things. Avery couldn't keep his mouth shut, and while Voldemort Crucioed him for it half the time, the other half he answered his questions because Avery was rather more useful when he knew things, despite all appearances.</p>\n<p>Severus thudded up the stairs to where Avery was sitting in a sunbeam. \"Where did the Dark Lord go? Did he tell you?\" said Severus.</p>\n<p>Avery quickly stuffed his trashy romance novel under his thigh. The cover, which bore a swooning witch in half-open robes, creased and Avery made a small sad sound.</p>\n<p>\"Avery,\" said Severus. \"This is urgent. I cannot explain how bad it's going to be if you don't tell me where he's gone, right now.\"</p>\n<p>Avery stared at him. \"I don't think I've ever heard you say that many words.\"</p>\n<p>\"<em>Avery</em>.\"</p>\n<p>\"Godric's Hollow,\" he said and the crack of Severus Apparating away cut off the end of the second word.</p>\n<p>There was smoke rising from the house. If he had come here a week before he wouldn't even have been able to see it-- this brick and wood little home, the massive hedge rising up over the back fence, the bare branches of the tree out front. But someone had betrayed the Potters. Someone had burned up their safety, broken a promise, doomed their friends. One day Severus was going to kill Sirius Black for this.</p>\n<p>Severus hit the front door at a run-- it was hanging open, the night air billowing in. He didn't have time to look close but he wasn't sure the whole top of the house was there anymore. A wail thudded down the stairs, deafening even to Severus's ears, which were filling with desperation and static and rage.</p>\n<p>He'd never been here before and he'd never be back. There was a rag doll rabbit on the hideous living room rug. Lily had recited all the wedding gifts to Severus over the radio, and this rug had been from Sirius, an ugly thing he'd meant as a joke and that James and Lily had kept just to spite him.</p>\n<p>There was a body on the hideous rug. Severus had seen a lot of bodies on a lot of floors. This one had messy dark hair peeking out from under a green knit hat. Severus took the stairs three at a time.</p>\n<p>He had his wand out. He was hoping he would need it-- that this would be a firefight, that there was still something here for him to fight, to <em>do</em>, to leap in front of-- but he didn't.</p>\n<p>Severus stopped in the door of the nursery and clung to the frame to stay standing. There was no sign of Tom Riddle. There were no ghostly fingers slipping over his temples, just a screaming storm that shook through his whole skull.</p>\n<p>Lily was lying on the floor, under the torn apart roof, the billowing night wind.</p>\n<p>Harry was crying, little chubby fists around the wood of his crib, and he was the only living thing here. It was the first time Severus had ever seen him. He looked like James, even tiny and red-faced and bawling. He had his same dumb mop of hair.</p>\n<p>Severus stepped into the room, onto the faint purple carpet, much lovelier than the one downstairs-- past a painted shelf of little books and toys, past a crumpled quilt on the floor, past Lily.</p>\n<p>His chest was thudding in and out. He wondered if it was going to injure anything--lungs or muscles or his curving ribs--the way he was shaking and shuddering, his heart something violent, his hands something weak.</p>\n<p>\"Hey,\" he said. \"Hey, kiddo, it's okay.\" Harry was not very convinced but to be fair neither was Severus. Lily was on the floor. He reached slow hands down to wrap around Harry's tiny soft baby ribs and lift him up. He tried to remember how you were supposed to hold babies. Harry was too big to need his head supported, right? He seemed to have that down.</p>\n<p>Lily's nightdress was being tugged about by the wind, her gauzy sleeves dragging over her wrists. Harry didn't stop crying but he grabbed at Severus's robes with those tiny chubby hands and shuddered there in Severus's careful, shaking hands. \"I got you,\" Severus said, and his voice was terrible-- steady and small and cracked only around the edges. \"Lily, I got him. I'm sorry but we can't stay here.\" He wrapped one long-fingered hand around the back of Harry's still-soft skull and with a <em>crack</em> the Godric's Hollow house stood empty.</p>\n<p>When Severus got back to his apartment (he took two intermediary Apparations to confuse any trackers), he threw every lock he had on the door and pulled up every shielding spell he'd ever worked into the walls. He laid Harry down in the center of the bed-- Harry had found the first Apparation terrible and shrieked about it, but he'd found the next two to be fairly captivating if nothing else and had quieted down-- and watched him anxiously while he tied a note to the tawny owl's leg and sent her off to Dumbledore.</p>\n<p>The owl beat her wings against the cold night air and lifted away. Severus moved back to the bed, close enough to catch Harry if it looked like he might roll off. Harry tried to put one of his own toes in his mouth. Severus stared at him-- tiny and breathing, alive.</p>\n<p>The kid's cheeks were damp so Severus rummaged around for a clean handkerchief and wiped them off. \"Oh,\" said Severus. He sat heavily on the bed. \"You've got your mum's eyes.\"</p>\n<p>\"Pah,\" said Harry, muffled by some delicious toes.</p>\n<p>\"Pah,\" Severus agreed and offered him a finger to chew on. There was a sharp knock at the door-- Severus had the Anti-Apparation spells over his room warded against everyone except himself. Severus scooped Harry up in one arm and drew his wand with the other to spell the door open and then to defend against whatever came through it.</p>\n<p>\"You have the child,\" said Dumbledore. He bustled past Severus, into the room, shutting and locking the door behind him-- one two three bolts slotting into place. \"Thank Merlin.\"</p>\n<p>\"Is it actually you?\" said Severus. Harry burbled wetly into the shoulder of his robe. \"Albus. Lily and James. They're dead.\"</p>\n<p>Dumbledore took Severus's shoulder gently. \"It is me.\" His eyes twinkled behind crescent-moon glasses. \"Confetti cake remains my favorite ice cream flavor.\" He leaned forward, peering at Harry, who reached up for his glinting glasses. \"What is this?\" Dumbledore moved to brush his thumb over the jagged scar on Harry's forehead. Severus stared at it.</p>\n<p>\"That's a scar, not a wound,\" said Severus, taking a step back. \"He's not bleeding, it's healed over. He must have fallen sometime.\"</p>\n<p>\"No,\" said Dumbledore. \"He got this tonight.\"</p>\n<p>\"Where are you going to take him?\"</p>\n<p>\"To his family. He has an aunt and an uncle and a cousin. Muggles.\"</p>\n<p>Severus nodded, staring at his stained rug. \"Good. Petunia can do something useful for once in her life,\" he said in a rush of sound. Harry was warm on his chest, sweet-smelling and heavier than it seemed like he should be.</p>\n<p>\"Severus?\" said Dumbledore, and it was soft.</p>\n<p>\"They're dead,\" he said, and his voice still wasn't right. He shouldn't be able to say those words and not choke on them. He moved back toward the bed, leaning down to put Harry carefully in its center. \"I can't-- I don't know how--\"</p>\n<p>\"Severus,\" said Dumbledore, gently. \"I realize Lily is gone, but this fight still needs you.\"</p>\n<p>Severus lifted his head and looked at him, still bent over the bedspread. There were words bubbling in his throat, hot and thick, but he clung to a silent pause with two white-knuckled hands. He took a long breath, straightening up.</p>\n<p>\"This child is going to need you,\" said Dumbledore, and Severus decided he'd probably paused enough now.</p>\n<p>\"You think you have to convince me,\" said Severus. He put one word down after the other like he was laying a path to someplace, heavy stones dropped onto the earth. Harry made a little sound on the bed and tried to get his toes in his mouth again. \"After all of this. After everything. You think because they murdered the most important person in my entire world I'm going to jump ship now-- <em>now</em>?\"</p>\n<p>\"Severus.\"</p>\n<p>\"Do you understand what I have done for this fight?\" said Severus. \"For them? For <em>you</em>? Do you understand what I have bled and what I have <em>cut away</em>-- I would have died for them. I have <em>been</em> <em>dying for them</em>.\"</p>\n<p>\"This won't be the end of it,\" said Dumbledore like he was a wise old sage and not an old man who loved socks and hated straight answers and trusted no one-- that was the thing about Albus, Severus would learn. He knew it even now, but he would learn and learn-- Albus didn't trust anyone, and he trusted himself least of all. \"And their child-- he must be protected. He will need to be protected. Severus, you must listen to me, before you do anything rash.\"</p>\n<p>\"You think you have to <em>twist</em> this for me, to make me stay?\" Severus shook his head, taking a wobbling step back, skewing his face with scorn he'd been perfecting for years. \"Albus, I'm <em>flattered</em> I mean so much to you but put a sock in it. I've got this twisted up enough for myself. Your pretty words were <em>never</em> why I was here.\"</p>\n<p>\"But Lily was.\" Albus looked stricken even as he said it. \"And now-- I'm sorry, this isn't the right time for this conversation.\"</p>\n<p>\"It will never be the right time for this conversation. Please take the baby. Please go. I will contact you when I have something new to report.\"</p>\n<p>\"His name is Harry.\"</p>\n<p>\"I know his name,\" said Severus. \"Get out.\"</p>\n<p>He checked the locks on the door, after Dumbledore left. He opened the window for the owl. He laid down on his bed and looked at the mold creeping across the ceiling.</p>\n<p>\"This still isn't good-bye,\" Lily had said.</p>\n<p>Severus reached out and flipped on the radio and laid there in the dark until dawn, listening to the crackle of empty airwaves.</p>\n<p>--</p>\n<p>In the morning they told him the war was over. He hadn't realized. In retrospect, that made sense, but he hadn't seen Riddle's body.</p>\n<p>He watched people stumble in the streets, happy and hungover, and thought that they were right-- that the most important thing that had happened the night before was the end of a war. But he sat in the quiet of his room-- the ice cream shop was closed, like it was a holiday, and maybe it would become one-- and he couldn't get himself to believe that.</p>\n<p>He hadn't seen Riddle's body though, so when Avery came knocking at his door the next afternoon he let him in like a friend. \"You knew,\" said Avery.</p>\n<p>Severus poured hot water into a chipped mug. He put the kettle down and fished out a tea bag and then he spoke. Avery didn't even blink at the silence, because this was Snape and they'd all agreed awhile back that he was a bit of a weird bloke. \"I'd only just figured it out,\" said Severus. \"I still don't quite know what they did.\"</p>\n<p>\"You were trying to warn him. Whatever weapon those cowards had...\"</p>\n<p>\"They weren't cowards,\" Severus snapped and then he tried to bury it back down into his throat. He stirred his tea and handed the other mug to Avery. \"How dare you call someone with the courage to face against our Lord <em>coward</em>. Fools, maybe.\"</p>\n<p>Avery snorted. \"They're saying it was the baby, but clearly that's nonsense.\"</p>\n<p>\"Mm,\" said Severus.</p>\n<p>\"What are we going to do now?\"</p>\n<p>\"Grovel,\" said Severus. \"Apologize. Lie.\" They hadn't found Riddle's body, after all. They had found no ugly husk of Voldemort's. Severus was having a hard time calling this a victory, and one of the reasons was because he wasn't sure they'd won. He didn't tell Avery that part, just sent him away and went back to bed. His untouched tea cooled on the counter for a few days before he finally poured it down the sink.</p>\n<p>--</p>\n<p>Fifteen minutes of patient knocking woke him up at 3 p.m. on a disgustingly bright Tuesday.</p>\n<p>\"I've burnt no covers,\" said Severus into his pillow, after he'd fished his wand out from under it and waved open the locks on the door. \"My fucking evil cult leader just turned to smoke. I'm in mourning. Leave me alone, Albus.\"</p>\n<p>\"I've vouched for you with the Ministry,\" said Dumbledore. \"You've been pardoned.\" He threw open the curtains, letting a beam of angry daylight in.</p>\n<p>Severus sat up, resigned, but he pulled his blankets around his shoulders mutinously. \"So you're burning my covers, then.\"</p>\n<p>\"When he returns, you will give him information on me and on the Order, and you will be more valuable than ever. And in the meantime you won't rot in Azkaban.\"</p>\n<p>\"Hurrah,\" said Severus. And then, \"When? Not if, but when, you think.\"</p>\n<p>\"I fear so,\" said Albus. \"I know something of what dark magics Tom played with. I do not think he can be dead, not yet.\"</p>\n<p>\"Lovely,\" said Severus.</p>\n<p>Albus sat on the edge of the bed, so Severus rolled out of it and stumped over to the sink to splash some water on his face. \"My Potions master resigned,\" Albus said.</p>\n<p>\"Good riddance,\" said Severus. \"He couldn't teach his way out a game of children's checkers.\"</p>\n<p>\"I'd like to hire you for the position,\" said Albus.</p>\n<p>\"Can't do it. I'd miss the ice cream,\" said Severus. \"Those rainbow sprinkles are the only bright spot in my life.\"</p>\n<p>\"<em>When</em>,\" said Albus, \"and not <em>if</em> he comes back-- he will come for Hogwarts, you know this.\"</p>\n<p>\"Obsessive nostalgic creeper,\" Severus agreed reluctantly.</p>\n<p>\"He will come for Harry,\" said Albus. \"I want you there. I need your help, Severus.\"</p>\n<p>\"God, <em>alright</em>,\" said Severus. \"I don't have to start tomorrow, do I?\"</p>\n<p>\"No,\" said Albus. \"But please consider it. I think it will be good for you.\"</p>\n<p>--</p>\n<p>They put up a statue in Godric's Hollow. Severus didn't go to see it. Instead, he Apparated out to a wide, fenced in green hill near Sussex and walked among the gravestones, quiet, until he found the ones he was looking for. He hadn't been here since he'd been fifteen years old, holding Lily's hand, sweating through one of his father's old ill-fitting suits.</p>\n<p>\"Lily's grave is a tourist attraction, nearly,\" he told the patch of greening earth at his feet. \"I'd be seen, and I can't answer those questions. Hi Mr. Evans. Hi Mrs. Evans. Sorry.\"</p>\n<p>The sky was blue and breakable and that was <em>absurd</em> because Lily was dead. Lily was dead and there should be no sunlight left. A bird sang prettily from the bushes and a squirrel dashed down the row of graves, tail high and bushy. Absurdity. He'd be angry if he wasn't so tired.</p>\n<p>--</p>\n<p>Bellatrix and her husband went to Azkaban. Barty Crouch Jr. vanished somewhere and Severus didn't pay attention to it. The papers rolled out lists of arrests and pardons and speculation, but Severus had been anxiously scanning the headlines for months and he was a bit done with that. Karkaroff dropped desperate confessions and information at the Ministry's feet and then left the country with their grudging blessing.</p>\n<p>Lucius Malfoy asked Severus over for tea and when he arrived in Lucius's second-best sitting room there was a bulky unmarked package on the tea table.</p>\n<p>\"No,\" said Severus and he almost laughed at how easy it was to say it. He slid into a seat and took a scone. \"I'm not your mule, Lucius.\"</p>\n<p>Lucius's face twisted. Severus resisted the urge to put his boots up on the pale peach chair cushion opposite him and smear black dirt all over them. \"You were the Dark Lord's,\" said Lucius. \"Jumping up at every snap of his fingers.\"</p>\n<p>\"You're no Voldemort,\" said Severus and Lucius, even now, flinched at the name. \"And I hear you weren't even a Death Eater, these days.\"</p>\n<p>\"I hear you're an Order spy, these days.\"</p>\n<p>Severus snorted. \"If you believed that, I wouldn't be here. I'm a spy as much as you're an Imperioed innocent. Just trying to survive a defeat, is all. You understand.\" He brushed crumbs off his robe and snatched up another scone. \"These are quite good,\" he said. \"Say hello to Narcissa for me and smuggle your own damn packages.\"</p>\n<p>--</p>\n<p>\"Don't you want a window?\" Albus asked, after Severus had turned down a few nice tower or ground floor rooms and headed straight down the dungeons. He'd found the potions lab and then taken a few turns to find some nested empty storage rooms. \"These will do,\" he'd said and started scouring them out.</p>\n<p>\"Not really,\" said Severus, surveying the room for the proper place to put a work bench. He'd have to install some ventilation spells to whisk away the more toxic gases, but he had a dozen of those tucked under his tongue.</p>\n<p>\"Minerva has a full floor of one of the towers,\" said Albus. \"Professor Sprout built herself a half-buried cottage out on the grounds. All the students just think it's a pretty bush. We don't lack for space here. Severus, it is a magical castle.\"</p>\n<p>\"You know, I've been here before, actually,\" said Severus. \"I'll take these two, thanks. You said you wanted me to start classes tomorrow?\" He conjured a sturdy workbench, a set of knives, and a cauldron from the class stores down the hall and set them up in the best corner.</p>\n<p>\"You can brew in the classrooms or the labs,\" Albus said. \"Severus, there are plenty of available facilities.\"</p>\n<p>\"I'm sort of in the habit of being self-contained,\" Severus said.</p>\n<p>He set up the first room into an office and the second, whose only entrance was through the first, into a bedroom. He thought the lack of windows would discourage her, but the tawny owl pecked patiently at his door until he let her inside to roost. \"There's an Owlery,\" he told her. \"I'm told it's very nice.\"</p>\n<p>She hooted disapprovingly at him and shredded the corner of the stack of old Potions assignments he'd been reviewing. The previous professor, he saw, had still been teaching Goeinger's brewing methodologies even though Ralph et. all had thoroughly debunked those in the 1940s. Severus pulled the pile out of her reach.</p>\n<p>\"I should probably name you,\" he said. She fluffed up her neck feathers and ducked her head under her wing to nibble away some dirt there. \"You look like an Agatha,\" he said, and she didn't seem to take offense, so that's what he called her.</p>\n<p>Not all of the teachers had known him before, but Minerva McGonagall had. She made it clear she was only tolerating his presence out of respect for Dumbledore's wishes. His owl hissed angrily whenever McGonagall glanced balefully his way at the breakfast table, which he didn't really think was warranted but he unwillingly appreciated it anyway-- though he did wonder if owls normally <em>hissed</em>. Agatha preened primly, stole a triangle of toast, and took off with a massive flap of her wings.</p>\n<p>He set the kids to brew a grade-appropriate potion first, just to see where they were at. Where they were at was terrible. He spent the rest of the year trying to drag them up to standard.</p>\n<p>\"Do you really want me teaching children, Albus?\" he asked one late night. Outside the wide windows of the headmaster's office he could see all the way to the Forbidden Forest.</p>\n<p>\"I know few people who understand Potions as well as you, professor.\" Albus beamed when Severus's nose twisted at the title.</p>\n<p>Severus snorted. \"Knowing the subject isn't teaching. I am not patient. I am not <em>kind</em>.\"</p>\n<p>\"Neither is Minerva.\" Dumbledore hesitated. \"And you cannot <em>be</em> kind,\" he said. \"You do have a reputation to maintain.\"</p>\n<p>\"Don't worry about it,” Severus said. \"I'm using you as an excuse. When a bunch of pureblooded parents come running to you demanding your head on a platter for meddling, please know who sent them.\"</p>\n<p>When little Slytherin children whose terrible relations Severus knew a bit too well came to him and complained he was favoring Hufflepuffs (he wasn't, he was favoring people who <em>did their goddamn homework</em>), he looked aggrieved and regretful and bitter and complained about Albus Dumbledore and his nosy administration. \"Look for who has the power, kids,\" he said. \"Look for who's using it, and then you survive whatever world you find yourself in.\"</p>\n<p>For the first two years he taught to the book. It was adequate, even if adequacy generally made Severus curl his lip in disgust. Once he got a decent white-knuckled grip on the basic curriculum-- running a classroom was nothing to navigating a meeting of Death Eaters, except for how it was about a billion times harder-- he started folding in his own methods and recipes.</p>\n<p>He tutored any student who requested it, but few did, so he approached the ones he thought would get the most out of it-- the most talented, but also the ones who seemed to love it most, and the ones trailing far behind, who he just couldn't reach in class.</p>\n<p>He made sure to scowl through all of it. He complained to his Slytherin students that the headmaster forbade him to favor only one House in his choices for private tutoring. \"If I had may way,\" he assured the sons and daughters and nieces and nephews of Death Eaters and they nodded sagely. The first time Nymphadora Tonks brewed a perfect Sleeping Draught, he had to feign a coughing attack to hide the smile. \"Acceptable, Ms. Tonks,\" he told her and she rolled her eyes and grabbed her bag and left for lunch with her friends.</p>\n<p>(Three years later, Severus found an unsealed envelope on his desk, with his name in Albus's fluid hand on the front. Inside were the Auror exam results of Tonks, Nymphadora, who had failed Stealth but aced both Disguises and Potions).</p>\n<p>The first time Nymphadora had stepped into Severus's classroom, her hair had been bright blue but her nose had been the one she’d been born with and her chin and her smirk, too. Severus had almost jumped to his feet. He almost grabbed his wand, but instead he just sat there and clung to stillness. Bellatrix had been in Azkaban for years. When he had tripped over his tongue and told Nymphadora she looked like her aunt, she had cast him a disgusted glance and told him she looked like herself.</p>\n<p>Halloween came around every year, and Severus sat through the feast drinking pumpkin juice and feeding Agatha. When Agatha visited him at meals, the other professors made sure to give him enough elbow-room to accommodate her entire wingspan, and she always visited him on Halloween. He found this to be very acceptable.</p>\n<p>His birthday was in January, and so was Lily's. Everything frosted over for miles and Severus woke up in the winter mornings with cold toes. Severus turned twenty-two, twenty-three, twenty-four, twenty-five and Lily stayed twenty-one and dead.</p>\n<p>The sun went down early in January, but you couldn't tell from his sunless rooms, except from the way his fingers and toes ached if he didn't light a fire or cast a warming spell. He often didn't.</p>\n<p><em>She's dead,</em> he thought. <em>She's dead and you're alive. Be alive. </em></p>\n<p>He went up to the kitchens and got some hot cocoa from the house elves. It never got cold. He never got warm. He went to bed.</p>\n<p>--</p>\n<p>The second time Severus ever saw Harry, the kid was stepping through the Great Hall doors in a crowd of tiny first-years. (They got smaller every year, Severus swore). Harry wasn't saying anything to the first-years talking beside him, his head tipped back to look at the ceiling-sky.</p>\n<p>He looked even more like James than he had the last time Severus had seen him, which made sense because now he could walk and presumably talk and likely didn't chew on his toes so much.</p>\n<p>Severus wasn't sure how to feel about it, so he decided it didn't matter. Instead he peered down the long aisle at the kid-- uncomfortable in new robes (he remembered how Lily had wrinkled her nose at those), standing near a kid who looked like he was probably the latest Weasley. Of course.</p>\n<p>The entire hall held its breath as Harry went under the Hat, which Severus thought was fairly rude. Give the kid some sort of complex, would you? And how were the rest of the children supposed to feel about this?</p>\n<p>\"GRYFFINDOR!\" The table of raucous hellions cheered and hollered. Severus fiddled with his fork sourly. Of <em>course</em>.</p>\n<p>\"Well, this will be an interesting year,\" Flitwick said cheerfully, beside him.</p>\n<p>\"Yes,\" said Severus. He was looking over Quirrell's shoulder at Harry as he made his way to the cheering table of gold and red. When the boy turned to look up at him-- eleven, he was <em>eleven</em>, had he and Lily ever been that small?-- Severus saw him flinch. He frowned and turned back to his plate.</p>\n<p>Severus watched him carefully over the next few weeks, because he watched them all carefully. He weighed his options and decided ignoring Harry in class was probably the best answer. He did take ten points from Gryffindor over Harry's missing tie and heard the Weasley boy next to him hiss, \"He's got a soup stain on his robes from last <em>week</em>, what right--\"</p>\n<p>\"Another ten, I think, Mr. Weasley,\" he said and the Granger girl beside them kicked at Weasley under the table. That could have been another handful of docked points, but he thought she was rather justified.</p>\n<p>The new Defense Against the Dark Arts teacher stunk of dark magic. DADA professors often did, of course-- it was a matter of course that defending against dark magic would get some of it on you, and also there was the matter of the curse on the position. But there was something almost familiar about Quirrell and Severus spent the beginning of the year making sure his shields were up and his face was right, trying to figure out exactly what tragedy the DADA curse was dragging into the school this year.</p>\n<p>Dumbledore had also told him he was keeping an immortality-causing magical object in a third floor corridor, so Severus had additionally spent several sleepless nights over <em>that</em>.</p>\n<p>\"You're keeping that thing in a school, with children?\" Severus had demanded, pacing Dumbledore's office. \"You know exactly who's going to want that Stone most. You know exactly who... Albus, if you are putting <em>bait</em> in the middle of this school I will make your vocal chords constrict such that you speak an octave higher for a week.\"</p>\n<p>\"That could be an adventure.\"</p>\n<p>\"I hate you sometimes,” he’d said. “Albus, what are you doing?\"</p>\n<p>\"It is not bait, Severus. This is simply the safest place I have for the Stone, and Nicholas asked me a favor. I'd like to ask your help with its defense.\"</p>\n<p>Severus had sighed. \"I'll come up with something.\"</p>\n<p>Severus thought of Petunia Evans Dursley as \"Tuney,\" because that was what Lily had called her in stories. Standing in the kitchen with Lily, a lifetime ago, he couldn't have imaged that Tuney could hate a child for years just because he was a reminder of all the things she couldn't have. But that old kitchen was gone now, the Evans house boarded up and sold, and Harry was skinny for eleven, knobbly-kneed and untrusting.</p>\n<p>When Severus looked at Harry he did not see James. He did not see Lily. He saw a half-blood boy from an ugly home and his heart turned to static in his chest.</p>\n<p>\"You could be better than this,\" he thought, when he saw Harry unflinching, when he saw his rigid shoulders in the Hogwarts halls. \"You should have been better than this. Tuney, she thought you were going to save the world.\"</p>\n<p>Dumbledore had told him about the protections in Harry’’s blood, the rules and sacrifices they worked under, but he wasn't sure that was worth this.</p>\n<p>Severus didn't see James when he looked at Harry, or he tried not to, but he saw James when he looked at Fred and George Weasley. He saw James and he saw Sirius and he gave them detentions for every careless thing they attempted in his orbit.</p>\n<p>In the weeks before Halloween, all the leaves died. As a child it had been one of Severus's favorite seasons-- the autumn, the fall-- because Lily had worn over-sized scarves and caps and held his hand through bulky mittens and kicked at the dry leaves. She had liked the noise they made, skittering over the concrete walks outside her house.</p>\n<p>Lily had called them the changing seasons, spring and fall, and she had liked that their names were verbs. Severus thought about that, in those long months of the fall.</p>\n<p>For Halloween, every year, Severus nursed his pumpkin juice and fed Agatha where she skulked on the back of his chair. McGonagall got stiff around Halloween, every year, snapping at Severus in staff meetings and ignoring him in hallways. He was rather sure he knew who she thought he was mourning on rainy October days.</p>\n<p>Her sharp silences meant he was doing this right, he was certain. It was a victory. He tried to feel smug. He fed Agatha a bit of pastry.</p>\n<p>\"Troll!\" Quirrell burst through the hall's doors and Severus snapped up his head, feeling like the muscles of his neck were fighting molasses instead of just air and gravity. \"Troll in the dungeons.\"</p>\n<p>The prefects rounded up the first-years, herding them back to the dormitories like anxious pimply sheepdogs. Severus thought that was Harry handled, so he whisked away to protect the second most important thing in the castle. But, of course, it was James's son, it was Lily's son-- so while Severus was guarding the Stone and getting his leg ripped open by Hagrid's three-headed monster pet, Harry faced down a mountain troll in a girl's bathroom.</p>\n<p>Once the troll had been dispatched and all the <em>eleven-year-old children </em>had been sent off to bed, Severus climbed up to Dumbledore's rooms and spent a few hours nursing a firewhiskey and moaning about how foolhardiness was hereditary.</p>\n<p>But over the next few weeks Severus watched Harry bobbing through crowds at Hermione's elbow, or Ron's, saw the way they leaned close and stood close and rolled their eyes at each other. There were some things that were worth even staring down a twelve-foot mountain troll, and that friendship was one of them.</p>\n<p>\"The Longbottom kid,\" Severus asked in the teacher's lounge when there was no one around but Professor Sprout. \"How's he doing in your class?\"</p>\n<p>\"Green thumb.\"</p>\n<p>\"I thought maybe,\" said Severus. \"He sucks in mine, but I think it's approach, not ability. I should probably do something about it.\"</p>\n<p>Sprout buttered her toast in peaceable agreement.</p>\n<p>\"If I call him in for tutoring I think he'll die of fear though.\"</p>\n<p>\"I'll tell him I asked it of you, as a favor,\" said Sprout. \"And that you're terrified of my wrath and therefore will be on your best behavior.\"</p>\n<p>\"I <em>am</em> terrified of you,\" said Severus.</p>\n<p>\"Why thank you, sweetheart.\"</p>\n<p>Christmas brimmed anxiously on the horizon. He heard Harry telling the youngest Weasley boy in class that last year he'd gotten a clothes hanger and a stale biscuit.</p>\n<p>Severus bought Agatha the plumpest mouse he could find, and Albus some socks, and then he dragged James's Invisibility Cloak out from the bottom of his closet. He'd last used it to drop some belladonna in a Death Eater's nighttime tea, which he figured was about as noble a purpose as something could have. He folded the silky silver fabric on his desk and then he conjured some wrapping paper.</p>\n<p>He didn't know what James had used the Cloak for, as a child, but Severus remembered being seven and curled under his blankets and hungry, too scared to sneak out to the kitchen because his father was snoring on the couch.</p>\n<p><em>Your father left this in my possession before he died,</em> he wrote. <em>Use it well. </em></p>\n<p>\n<em>--</em>\n</p>\n<p>Severus thought maybe if he had been a different person he might have talked to Lily in his head. <em>Hey Lily, today I ate a grapefruit and you're right, they're disgusting. Hey Lily, it's been raining for weeks but today I saw some kids up at the Owlery trying to give every owl there an umbrella spell. Hey Lily, I miss you. </em></p>\n<p>But he had never talked to Lily because he had had things he wanted to say. He had made her flowers from leaves. He had told her about the birthday parties of 86 year olds because he hadn't wanted to talk about other things.</p>\n<p>He had wanted to hear about her day and how she was doing and what idiot thing James had done recently, who was Remus knitting a sweater for, had Alice gotten tired of charming the breakfast toast to dance? He wanted to talk to Lily because he wanted to hear Lily, what she wanted to share and what she wanted to say.</p>\n<p>So when the irises came back up in spring, he didn't tell her. When he cornered Quirrell in the Forbidden Forest, he didn't tell her, he just hissed threats in the wooded shadows and missed Harry eavesdropping from the branches. When Neville managed his first potion without a burn, a boil-over, or any billows of poisonous gases, he told the boy, \"Acceptable, Longbottom,\" and he told Lily nothing.</p>\n<p>Her son took to the skies above the Quidditch pitch, and Severus had never seen the kid look so at peace. He didn't think, <em>Lily, look. </em></p>\n<p>\n<em>--</em>\n</p>\n<p>He thought Quirrell was a minion, some glory-seeker or blackmail victim trying to track down the Stone. To be fair, Albus assumed the same thing, but Severus was still furious when he found at the end of the year that Tom Riddle had been hitching a ride into Hogwarts classrooms.</p>\n<p>He had kept in character all year, towering and hissing over the stuttering man. He had warned Quirrell away from the third corridor with threats and flashing black eyes, like he had wanted it for himself, like there was some master he dreamed of serving it up to. If he ever saw Tom in person again he could drop to his knees in shock and regret-- \"I thought I was protecting your interests, my Lord. I didn't realize. If you had just told me--\"</p>\n<p>Of course Harry, too, had spotted his torn-open leg after stopping Quirrell from getting past Fluffy, had heard him hissing bile and threats at Quirrell out in the Forest-- but that was how it was supposed to go, after all. Harry watched him balefully in the hallways and Severus named it victory, it was a victory, it had to be, this was what he had.</p>\n<p>Severus had been asleep in his rooms when Harry, Ron, and Hermione petrified Neville, fought past the protections of a half dozen Hogwarts professors, and finally faced down the fragment of Voldemort that was living on the back of Quirrell's skull.</p>\n<p>Dumbledore told him about it later and Severus sank down with his face in his tired, tired hands. \"Well,\" he said. \"He's certainly theirs, isn't he? Oh god, he's going to <em>die</em>.\"</p>\n<p>--</p>\n<p>The next year Narcissa's kid bought his way onto the Quidditch team. He was very little like his mother, except for the hair and the bone structure and the excellent ability to turn his nose up at things. But Narcissa had moved through Hogwarts with a spine of exquisite steel. She had known who she was and what she wanted and she would have ground herself down to the bone to get it.</p>\n<p>Draco wanted things, but he didn't know what he was doing. He parroted his father's words and not his mother's and Severus wondered when the kid would find out where the power in his family lay.</p>\n<p>That year Severus taught Harry <em>Expelliarmus</em> from a Dueling Club stage. He brought Polyjuice Potion up in class and Hermione stole the supplies from his stores. All around them students fell frozen and rigid, lining the infirmary beds. Sprout hovered over her mandrakes and Severus spent most of that year down in his dungeons, brewing ineffective practice draughts with mandrake substitutes.</p>\n<p>Dumbledore told him it had been Voldemort, after. He tucked the destroyed diary into the vault behind his desk and told Severus about Tom Riddle, sixteen years old, already a killer of children. \"How many more are there?\" Severus asked, looking at the painting above Dumbledore's desk and thinking about the Horcrux lying dead behind it.</p>\n<p>\"There's no way to know,\" said Dumbledore. \"But he is a... traditionalist. I think there will be seven.\"</p>\n<p>\"Lovely,\" said Severus. \"Just lovely.\"</p>\n<p>Dumbledore nodded, seated at his desk with his shoulders bowed, like he was old, like he had seen this all before.</p>\n<p>\"D'you wanna come down to the greenhouses for some tea?\" Professor Sprout asked the day the students boarded the trains for home, when she found Severus nodded off in the staff room. He squinted down at his own cold cup of tea, but she kept patiently smiling down at him so he gripped the mug and followed her down to the big glass houses.</p>\n<p>\"You know <em>Aguamency</em>, of course,\" she said after she'd made them both big steaming mugs and set them to floating beside them. \"That bush needs about three gallons, this little fellow here needs about one...\"</p>\n<p>Severus lifted his wand obediently. He had watered the hedge behind the Evans’s house sometimes but it had been with a hose. Sprout hummed a little tune and started going through the foliage, tsking over brown leaves.</p>\n<p>\"The littlest Weasley,\" he said.</p>\n<p>\"Yes?\" said Sprout. \"Oh, honey, no, you can't grow that way. Respect your neighbors.\"</p>\n<p>\"If you could keep an eye on her next year. A hand if she needs it.\"</p>\n<p>\"Why don't you?\" said Sprout.</p>\n<p>\"Do you know what happened to her?\" he said instead of answering.</p>\n<p>Sprout was half inside a bush now. \"I saw the writing on the wall. And know her brother and the Potter boy got her out. Gilderoy, too, I suppose, though I doubt he was much help, poor lad. She must have been terrified.\"</p>\n<p>Eleven, Severus thought. <em>God, they get smaller every year. </em></p>\n<p>\"The thing that opened the Chamber,\" Severus said. \"The Heir. It was... bothering her all year,\" he said. \"In her head. In... a haunting, sort of.\" Through the warped greenhouse glass the sky was a fierce and terrible blue. Tom Riddle had been creeping through Severus's school all year, again, and he hadn't known.</p>\n<p>\"I know some of what it's like,\" he said. \"To have that man walking around your head. Touching your best things. Whispering. She just might need someone, when she comes back.\"</p>\n<p>\"Well, I'm always around,\" said Sprout. \"The greenhouses are good for escaping whispers.\"</p>\n<p>Severus couldn't quite figure out how to say thank-you, so he hung around in the warm silence of the place and helped her water the garden beds.</p>\n<p>--</p>\n<p>Even professors couldn't Apparate onto Hogwarts grounds. At the beginning of the next school year, Severus hunched his shoulders and trekked past drifting dementors at the gates. It was like the wettest days of October, the worst frosts of January-- cold grabbed him by the bone marrow and dragged down and so he set his jaw and walked up the gravel path.</p>\n<p>It wasn't like it was a big deal, anyway. People said they could hear things sometimes, when dementors came too close-- that they would step back into the worst inhales of their lives and drown there. Severus pulled his cloak more firmly around his shoulders. All he could hear was a radio, flicked on to empty airwaves. All he could hear was the wind.</p>\n<p>He shoved past the first row of hedges on the grounds and the dementors faded back behind him. The cold stayed.</p>\n<p>That third year, the Granger girl got a pet monster cat and it played tag with Agatha in the Great Hall, going screaming down the aisles between the tables and terrifying the first-years. Agatha seemed to be enjoying herself, though, so he let it be.</p>\n<p>Remus Lupin joined the Hogwarts faculty and it was peculiar. Some days Severus didn't feel much older than sixteen, uncertain and raw (some days he felt older than Dumbledore, intimate with the way those skinny shoulders hunched and knotted)-- but with Lupin standing there in those same old sacred halls, it was easy to see where they were. Lupin's visage was as threadbare as his clothes. You had always been able to see his bony elbows, even when he was the sensible shadow over Potter and Black's shoulder, the ballast against their worst ideas except when he was Black's worst idea.</p>\n<p>Severus had sulked in Dumbledore's office when he heard the news. \"What about full moons?\"</p>\n<p>\"You'll make him the wolfsbane potion,\" Dumbledore had said easily and Severus had sunk down in his chair and sulked more.</p>\n<p>\"I should get a raise.\"</p>\n<p>(\"It tastes worse cold,\" Severus said, putting the steaming mug down on the desk on the first full moon day. \"If you want to wait.\"</p>\n<p>\"Thank you,\" said Lupin as Severus stalked out of the room.)</p>\n<p>Severus lurked around Madame Pomfrey after the student's first meal, during which Draco had loudly acted out Harry's supposed fainting on the train. \"What do you prescribe to students with bad reactions to dementors?\" he asked. \"Is it a potion? I've never come across them in my studies.\"</p>\n<p>\"Oh nothing so fancy as that,\" she said. \"A bit of chocolate and a warm place to sit is often the best medicine.\" She straightened beds and told him how the nice new professor had handed out chocolate to his cabin of third-years. \"Potter hardly looked shaken, for someone so badly affected,\" she said. \"But I suppose I'm used to seeing the lad in more terrible straits-- regrowing bones, that sort of thing.\"</p>\n<p>\"Hm,\" said Severus and stole a lollipop from the jar on her desk.</p>\n<p>--</p>\n<p>It was Halloween and the children were celebrating excess desserts at dinner and Lupin was drawing nonsense designs in his gravy with slow drags of his fork.</p>\n<p>\"Wasn't she your friend once?\" Lupin asked. He asked it like he was curious, like he was kind.</p>\n<p>\"Wasn't Black yours?\" said Severus. \"We all make sore decisions. Pass the potatoes, would you?\" He went back to sipping his pumpkin juice and Lupin stopped asking him questions Severus couldn't answer.</p>\n<p>--</p>\n<p>The Weasley twins still reminded Severus of Potter and Black, up to how they vanished and reappeared without notice, like the way you could never get rid of glitter or that stain in the <em>Cat in the Hat </em>books. But Severus was fairly sure Harry wasn't lending them James's old Invisibility Cloak, because after all they had been this annoying <em>before</em> he'd given the Cloak up to Harry's possession.</p>\n<p>They had something more up their sleeve, it seemed, and whatever it was they taught it to Harry-- because the boy started vanishing and then floating up to the surface like a bad egg in places he wasn't allowed.</p>\n<p>Harry wasn’t allowed out to Hogsmeade, with Black on the loose, but Severus was pretty sure the boy was sneaking out there anyway. He found him in the castle with his pockets full of Zonko’s toys and tricks, and as Harry stood in front of him, mulish and stubborn, Severus remembered James bold and arrogant at school, remembered Harry’s small soft weight on his chest as he carried him out of a home Sirius Black had betrayed. In among the detritus, Harry had an old piece of parchment, folded with care. Severus assumed it was another Zonko toy until he jabbed it with his wand and saw ink spread across its surface.</p>\n<p>He didn’t know the nicknames because they had been their own, but he knew that heavy script. <em>Mr. Prongs agrees with Mr. Moony and would like to add that Professor Snape is an ugly git. </em></p>\n<p>“It’s clearly from Zonko’s,” said Lupin when he appeared and got between between Harry and Severus’s rigid shoulders. He was smiling, with his scarred face and his hands closing over the parchment, and Severus let him do it. Whatever it was, this remnant haunted by James’s hand probably belonged to Remus.</p>\n<p>--</p>\n<p>The year rolled on. On a frozen February morning, Severus gave fifty points to Slytherin for Crabbe having his tie on straight, and heard a familiar voice behind him.</p>\n<p>\"Still favoring Slytherin, I see,\" said Lupin.</p>\n<p>\"I don't think <em>Slytherin</em> was the word you meant there,\" Severus said. \"Old loyalties die hard, as I'm sure you know.\" And on his next walk to class he took fifty-five points from a Gryffindor for whistling out of tune.</p>\n<p>On full moon days, Albus asked Severus to take over Lupin's classes. Severus stalked into the classroom, threw up page numbers on the board, and sat with his boots up on Lupin's desk.</p>\n<p>\"Um,\" said Granger. \"We're not there in the book yet.\"</p>\n<p>\"Does it seem like I care?\" Severus said.</p>\n<p>\"This is--\" she flipped through the book. \"Um, it starts in the section on blood poisons and then goes into a chapter on illusion magic? Did you... choose these on purpose?\"</p>\n<p>\"Obviously,\" said Severus. \"Ten inches on how the two subjects affect each other.\"</p>\n<p>\"They <em>don't</em>,\" said Granger.</p>\n<p>\"Ten points from Gryffindor, Ms. Granger,\" said Severus and tipped his head back and thought about how best to brew dragon bone extract for the rest of class.</p>\n<p>--</p>\n<p>The last full moon of the school year came, but when Severus went to bring Lupin his potion he was gone. The parchment left unfolded on his desk was no longer blank, with ink moving and squirming on the page.</p>\n<p>Severus would have remembered Lupin's potion, steaming on the cluttered desk, any other day-- but he saw Black's name on the Map and all he could think was <em>Lily</em>. All he could think was <em>you promised you would keep her safe</em>.</p>\n<p>He knew the way through the grounds, to the Whomping Willow, and the knot at its trunk that would freeze its violent thrashing for a time. He felt frozen, violence stretching before and behind him. He knew these dark little stunted passages. He remembered being sixteen and jealous and petty, looking for a secret at the end of this buried corridor and finding a snarling, aching monster instead.</p>\n<p>James had come for him, and Severus hadn't known what to do with that, then, other than gamble on taking his hand and running. They had run, and Lupin had apologized later, tight-wound and furious, and Severus had regretfully not taken Lily up on her offer to punch Sirius Black in his handsome nose. They had run and Severus was moving, now, through that same musty dark.</p>\n<p>James's hair had been wild, his mouth tight and unsmiling, his hand outstretched-- they had both been so rarely unsmiling, Lily, James, always either laughing or incandescent, furious, blinding-- and maybe that had changed, in the long cold days of the war, but his trenches had been so far from their warm foxholes. Had Lily gone still? Had James gone quiet, turned to bedrock and frost?</p>\n<p>Severus had been lifetimes away from them, pretending to become something he hated. He had not been there to see them break apart, in those ends of days, in those days they did not know were the end. Lifetimes away, listening to the crackle of voices late at night-- it felt like Lily had been dead for lifetimes now.</p>\n<p>James had risked his life for Severus, once, because the man at the end of this corridor had thought it would be <em>funny</em>. James was dead, because this man had betrayed him. Lily was dead. What here was mischief? What was cold malice? What was cowardice?</p>\n<p>When Severus burst through the door to the Shrieking Shack, he had an Avada kedavra on his tongue, ready. He had been more certain of few things in his life than that he had enough hatred in him to cast it.</p>\n<p>But apparently three simultaneous <em>Expelliarmuses</em>, even cast only by some third-year wizards, can knock a man unconscious.</p>\n<p>Severus didn't hear what came after, but he would have understood. \"I would have died rather than betray Lily and James,\" Black screamed at Pettigrew in that Shack. \"I would have died rather than betray my friends.\"</p>\n<p>But Severus didn't hear it. He was unconscious through Black's story, through Pettigrew squealing, through Harry standing with frightened, certain fists and saying, \"My dad wouldn't have wanted you to,\" like he knew anything at all about what James would have wanted.</p>\n<p>Severus didn't hear any of it, but he would have understood. He would have understood Black screaming in Pettigrew's face, thirteen-years gaunt and hollow-cheeked. He would have understood the way Harry's stubborn face froze them in their tracks.</p>\n<p>Severus had walked through the long dark corridor, a killing curse roiling in his gut, and he didn't know, but Black would have understood that, too.</p>\n<p>Severus woke cold and damp, his nose squished into mossy pebbles. Lupin was gone. Granger, Weasley, Black and Harry were strewn around him, under the fog crawling in off the water's surface. \"Th' hell,\" mumbled Severus, and then he conjured stretchers for the children and the Ministry for Black. He was cold and he was aching, the fire out in his gut, and he thought maybe Black deserved Azkaban's long slow torture more than a clean death.</p>\n<p>Severus wasn't sure what the kids had been thinking-- he couldn't imagine what Black could have told them. What had Lupin said? What had he been thinking? Where was he-- hell, the potion.</p>\n<p>He levitated each of them onto the conjured stretchers-- their dangling limbs, Ron's cast, Granger's bush of hair, the way Harry's slipped across his scarred forehead. Severus had never seen Harry without a scar. Screaming in his nursery, heavy on his chest with Albus thin and tired at his front door-- Harry had always had a lightning storm writ into him, healed over and scarred. It had never gotten to be a wound.</p>\n<p>Severus got them to the infirmary, and then he hovered around the edges of the gathered Aurors and Ministry officials, so he was there when the ruckus started off-- Black was gone.</p>\n<p>Black was gone-- and so was Hagrid's hippogriff, of all things, though Severus didn't point that out to the Aurors. Harry was looking smug, like James at his worst, and Severus stormed up to Dumbledore's office while the kids got on the trains home.</p>\n<p>\"You cannot let them do this,\" Severus said.</p>\n<p>\"Mm?\" said Dumbledore. \"Lemon drop?\"</p>\n<p>\"Trust Black,\" said Severus. \"Albus, he got James and Lily killed.\"</p>\n<p>\"Not mentioning Pettigrew and the dozen Muggles, I see,\" Dumbledore said.</p>\n<p>\"Don't you tell me what to care about,\" Severus snapped. \"I am caring about Harry and I <em>know you</em>. Why did you let this happen? I know they helped him get away, on Hagrid's giant angry bird.\"</p>\n<p>\"You're one to talk about angry birds.\"</p>\n<p>\"<em>Albus</em>.\"</p>\n<p>Dumbledore sighed. \"It wasn't Sirius.\"</p>\n<p>There was a rush in Severus's ears and he tried to bat it down. \"It was,\" he said. \"He was their Secret-Keeper, because you <em>wouldn't let them choose me</em>.\"</p>\n<p>\"They swapped at the last moment, without telling anyone. They thought Sirius would be too obvious, so they asked Peter.\"</p>\n<p>\"Pettigrew,\" said Severus. \"That wet paper bag of a person, they--\"</p>\n<p>\"They thought it would be safer. Sirius knew, of course, and he hunted down Pettigrew after they died. Peter was the one who killed all those people, and took off his own finger--\"</p>\n<p>Severus lifted a hand, shaking his head. \"Pettigrew,\" he said. \"You're sure?\"</p>\n<p>\"Yes.\"</p>\n<p>\"Do you know if he's alive?\" said Severus.</p>\n<p>\"Alive, and I fear rejoining Voldemort as we speak.\"</p>\n<p>\"He'll be easy to find, then.\"</p>\n<p>\"Severus,\" Dumbledore said sternly. \"Do nothing rash. We need you.\"</p>\n<p>\"When have I ever been rash?\" said Severus.</p>\n<p>He didn't hunt down Peter that summer and roast him over hot coals. He considered it, at length and with much imagined detail, but instead he went on a long backpacking trip through the Alps, seeking brewing ingredients that only bloomed under certain moonlights.</p>\n<p>Albus was right-- Harry was the priority, and that meant Severus keeping his cover. But Severus had a list, and Peter was on it. He tucked it away in his mind-- his life had not so changed that he had the luxury of being able to write such things down.</p>\n<p>--</p>\n<p>In Harry's fourth year of school, the Goblet of Fire chose him as a frankly illegal second Hogwarts champion. \"But what about <em>sportsmanship</em>?\" Severus asked Dumbledore dryly. \"What about the kid <em>not</em> dying before he figures out how to brush his hair?\"</p>\n<p>\"I must figure out who's placed his name in the Goblet,\" said Albus, tearing apart a lemon drop wrapper. Sunlight was pouring through the windows and Severus put his feet up on Albus's desk. \"There can have been no reason for it except to endanger him.\"</p>\n<p>\"I bet he thinks it was me,\" said Severus.</p>\n<p>The first task was dragons, so Severus lurked down by the dragon handlers, asking about some of the rarer dragon-derived potions ingredients. During the actual task he sat rigid in the stands and tried not to think about Harry, eleven-- god had he ever really been <em>that</em> small?-- dangling from his broom while Severus hissed Anti-Jinxes under his breath.</p>\n<p>Severus had been seeing Neville once a week since his first year for tutoring. He scowled through it and sometimes napped at his desk for the safer stretches of brewing, when he knew there was something Neville <em>got</em>. The kid was approaching grade-level standards, though, and had on at least one instance corrected Granger on a brewing fact.</p>\n<p>\"What's that?\" Neville asked when Severus put a box of gillyweeds on his desk while rummaging through his ingredients for some fire flower essence. He scowled and snored and snubbed, but Severus tried to encourage questions, however sourly he answered them.</p>\n<p>\"Gillyweed,\" said Severus. \"Ingested, it allows a wizard to breathe underwater. But you have a Illumination brew to make, get to it, Longbottom.\" And then he put his boots up on his desk and pretended to snore through Neville tentatively robbing his unlocked gillyweed stores.</p>\n<p>Alastor Moody cornered him out on the grounds-- now <em>he</em> smelled of Dark Arts, but Severus supposed he'd had plenty of terrible years to get the stuff on him. Like glitter, it never really came off. Severus was glad to have him, though, because when whatever Voldemort flunky was lurking raised his ugly head, he could trust ol' Mad-Eye to kill him dead without a flinch. Small comforts.</p>\n<p>\"'Course Dumbledore trusts you,\" Moody said. \"He's a trusting man, isn't he? Believes in second chances,\" he said and Severus almost laughed because people kept telling him these false things about Dumbledore. Instead he raised both eyebrows and one side of his mouth and waited.</p>\n<p>\"But me,\" said Moody. \"I say there are spots that don't come off, Snape. Spots that never come off, d'you know what I mean?\"</p>\n<p>\"Always nice to see you, too, Alastor,\" said Severus. \"But I'd like to get back to my walk.\"</p>\n<p>Karkaroff cornered him, too, down in his dungeons, his hand wrapped tight around the inside of his opposite forearm.</p>\n<p>\"Karkaroff, long time,\" said Severus. \"So I see they put you in charge of children? How odd.\"</p>\n<p>\"You're one to talk, Snape.\" Karkaroff's hand around his forearm was white-knuckled, pressing into marked flesh. Severus knew the feeling. His Dark Mark had been prickling and darkening all year, but he had had Quirrell haunting his classrooms, had seen Dumbledore locking a destroyed diary away, had been waiting for this.</p>\n<p>\"Hold yourself together, Karkaroff,\" he said and swept off to grade some papers.</p>\n<p>The Cup was supposed to make some sort of signal when a champion reached it, but nothing happened. The spectator views of the third task were poorly thought out, but while the crowd wondered and peered at the high hedges Severus felt the Mark on his forearm burst into blinding life. It cut into his skin like he was getting it all over again, arm outstretched, Voldemort's cold fingers around his wrist, the tip of his wand dragging along the skin.</p>\n<p>By the time Severus got to Albus in the crowd of spectators, Harry was back. He was on his knees in the grass, both hands clenched in the robes of a dead boy. Cedric had been terrible at neat dicing in Severus's class but wonderful at lending his supplies to those around him who'd forgotten to bring what they needed.</p>\n<p>Everything was noise. The pain in his forearm was dragging at his attention. Amos Diggory was on his knees, in the grass.</p>\n<p>Moody-- no, Crouch the younger, what had Bella called him, Barty Jr, Crouch the Crotchety-- took Harry and Albus realized his mistake in time. Severus and Minerva flanked him, and Severus dug up Veritaserum from his stores when asked. His forearm was aching-- the skin, yes, but it felt like the pain was cutting down through tissue and sinew to bone.</p>\n<p>\"He's back,\" Harry was saying. \"He's <em>back</em>.\" His hair was in his eyes and his hands were shaking and he looked like no one except a scared fifteen year old boy with grass stains on his knees. When Severus and Lily had been children they had come home from summer afternoons covered in grass stains and Mrs. Evans had put Severus's things through the wash before she sent him home. \"Don't want your mum to fuss,\" she'd said, hands hesitating over Severus's bony shoulders without touching him.</p>\n<p>Albus pulled Severus to the side, slow and quiet. \"Go,\" he said. \"You know what you need to do.\"</p>\n<p>Severus wrapped his hand around his opposite forearm, holding so tight his knuckles turned white with it. He knew where he was meant to be and he could feel Voldemort's impatience pacing up his spine.</p>\n<p>Severus grabbed nothing, just paced out of the room and out of the castle and out of the grounds, past the main gates and the Anti-Apparation charms. He vanished with a violent thud of air and appeared in a poorly lit room somewhere below London.</p>\n<p>They'd left the graveyard, but here was the tall pale ghost of an angry young man. Here was the feeling of gentle fingers whispering over the inside of Severus's skull. The men arrayed around Voldemort wore their masks and hoods, except for Pettigrew cringing in the corner, but Severus stood bareheaded in his professor's robes. He inhaled the musty air of the room.</p>\n<p>\"My Lord,\" said Severus, and dropped to his knees.</p>\n<p>--</p>\n<p>Severus slunk back into the school the next day. He had to keep his cover, he'd told Voldemort. Yes, here, he'd said, take a walk through fifteen years of Albus's exhausted shoulders, it's all yours, this was for you, all for you, Lord. A headache was dragging along his temples like cold fingers, the tip of a wand.</p>\n<p>Hogwarts felt nearly empty, its corridors echoing, its classrooms shut. Severus moved over stone and past armor and painted canvas until he found them-- the whole student body, the faculty, the staff-- in the Great Hall. Albus stood at the head of the podium and Severus could see the weight on his shoulders. \"There will come a time,\" Albus said. \"When you have to make a choice between what is <em>right</em> and what is <em>easy</em>,\" he said, and Severus turned and walked away, back down the empty hall.</p>\n<p>Dumbledore's voice followed him. \"Remember Cedric Diggory.\"</p>\n<p>Severus went down to his room and sat on his bedspread behind the closed door. He put the tip of his wand to his temple and pulled out wispy white strands full of musty air and low voices, pulled them out of him and bottled the memories away for Albus's old tired hands.</p>\n<p>Severus could have run for the edges of the grounds, the moment he felt the Mark scream into full life. He could have run far enough to Apparate to the graveyard and maybe Cedric would still have been alive. Maybe he could have done something, burned his covers, saved a child.</p>\n<p>He thought about a house in flames, wallpaper, yellow and white lace curtains. Harry never told the full story of the graveyard and Severus never knew that Cedric had been long dead before the Mark ever activated. He laid on his bed and searched his ceiling for mold and wondered about what price was too high to pay.</p>\n<p>--</p>\n<p>\"You checked, didn't you, Albus?\" said Severus. Mad-Eye Moody glared at him from just inside the door of Grimmauld Place and Severus said, \"Hey, lil Barty got the glares down <em>pat</em>, that's doing you no favors.\"</p>\n<p>Dumbledore sighed. \"I'm sure, Severus.\"</p>\n<p>\"Mm,\" said Severus and slunk inside past Moody. He followed a step in Dumbledore's wake, so any concerned, questioning, accusing looks could glance first off the old man's knowing smile and their protests could die in their throats.</p>\n<p>The front hall loomed and the big table outside the kitchen was still half-drowned in dark despite even Molly Weasley's best attempts to light it. Voices were muffled in the corners of heavy wood. Bread and lamps and briskly scrubbed floors did their best, but something in the room resisted.</p>\n<p>Severus gave Molly's food a wide radius and sat at the furthest corner of the table, ignoring Black's glare and Lupin's considering gaze. He wanted neither of them. A woman's voice caterwauled down the stair, thumping on the expletives, shrieking on the verbs.</p>\n<p>Shacklebolt was looking concerned at the sound. Black said with a groan, \"My mother's portrait was put up with some damned powerful Sticking Charms. She's not going til the house burns down.\"</p>\n<p>The shriek rose to a crescendo. \"Maybe burn it down,\" said Severus, and Black swiveled to look at him.</p>\n<p>\"Should <em>Snivellus</em> really be here?\" said Black.</p>\n<p>\"I trust him,\" said Dumbledore and Severus raised two eyebrows and one side of his mouth until Black twisted up his face and looked away.</p>\n<p>Tonks entered the room via a tumbled coat rack and a knocked over chair, and then the first meeting of the second Order of the Phoenix began. Severus didn't ask Tonks if she'd kept up with her brewing, and she didn't look his way.</p>\n<p>They didn't tell Harry about the steps they were taking or the measures they were making. Harry didn't write his least favorite Potions professor, but Severus heard from Dumbledore that the kid was reaching and asking, desperate and angry. He'd been born into a war, once. People had been pretending it had been over for years, but Severus knew better, Albus knew better, and now Harry did, too.</p>\n<p>Severus went to Order meetings in Grimmauld Place, the location safe in Dumbledore's Secret-Keeping hands. (<em>Safe</em>.) He went back to Lucius's third-best parlor (new carpet, old chaises), to Avery's cramped little kitchen, a rotating cast of basements and back rooms. He bottled up white wisps of memory for Dumbledore and he let Voldemort walk around his mind. The summer passed. Severus only got a glimpse of Harry in Grimmauld Place, twitchy and scowling, but he liked the way Granger and Weasley looked at him with their hearts in their anxious throats.</p>\n<p>--</p>\n<p>Severus had never seen McGonagall so angry about anything as about Dolores Umbridge-- and he had been the recipient of her glares more than once in his three decades of life. It confused him, that she could be as angry about this toad of a woman as she was about the maybe Death Eater in her midst-- but he supposed she'd been able to fight Voldemort, when it came down to it, and there wasn't much she could do about Umbridge. Minerva broke a mug in the staff room and once she was gone-- long gone, no witnesses-- Severus cleaned it up.</p>\n<p>The day Umbridge sat in on Severus's potions class was the smuggest he'd ever seen Harry and co., and Severus stood stiffly at the front of the room, trying to think of nothing but newts' eyes and pewter-- not James with curses and grins, not James in a green knit cap, not Black's thirteen years, not Pettigrew cowering but breathing in the back of Voldemort's meetings.</p>\n<p>He didn't let Umbridge sit in on Neville's tutoring, or on Goyle's, who was trying and who could follow the instructions if you sat still and explained them patiently enough and let him fiddle with the knives.</p>\n<p>Sue Li was a Ravenclaw who had hunted him down at twelve to demand extracurricular potions. He let Umbridge hover while he quizzed Li on the liminal tendencies of red-spot toadstools. Li blasted him with clarifying queries and suppositions that led them all the way down the track to the philosophical gestalt inherent in brewing, and Umbridge slunk out of the dungeons looking frankly dizzy.</p>\n<p>--</p>\n<p>Tom Riddle was slinking around Harry's mind, Albus said. They had a connection, Albus said and Severus stared out the windows over the headmaster's shoulder. Harry needed someone to train him in Occlumency, Albus said, and Severus tried.</p>\n<p>He scowled through it, because that's how this went, and Harry scowled on back. The boy's mind was brittle and wide-open, grasping and desperate for answers no one was giving him. Severus tried to pretend he had too many ugly answers heavy on his shoulders to have any sympathy for him.</p>\n<p>\"I cannot do this,\" said Severus, a bare few weeks into the lessons. \"He's a nosy, irresponsible little <em>brat</em> and I can't do this. I can't be there. I can't be dragging this shit up. Do you think I'm not doing enough lying, Albus?\"</p>\n<p>Dumbledore frowned at him over steepled fingers, all warm concern, and Severus scowled back. Albus said, \"I thought you would enjoy the chance to connect with him.\"</p>\n<p>\"He shouldn't be connecting with a goddamn Death Eater, and<em> that's what I am</em>.\"</p>\n<p>\"You are the best Occlumens I've ever known, including myself,\" said Albus.</p>\n<p>\"That's too bad. Find someone else.\"</p>\n<p>Harry had dug into Severus’s Pensieve and found a sunny afternoon that flooded even Harry goddamn Potter with pity-- Severus's knees in the grass, bile in his throat, James laughing and Lily not. Severus had felt small, bug-like, a chitinous shell growing over all his softest parts. He couldn't remember, these days, living without that exoskeleton over his skin, and he didn't mind so much anymore.</p>\n<p>He climbed back down to his office and straightened up the innards of his Pensieve, sorted the spools of memory with the softest grip he could manage.</p>\n<p>What Harry had found-- that was not Severus's worst memory. That was not when he had lost her.</p>\n<p>--</p>\n<p>Umbridge outlawed everything she could get her hands on, and Severus watched. Granger founded a resistance group in the back rooms of her schoolhouse, and Severus watched. Albus was ousted from his own office, and Severus watched. He gave Umbridge fake Veritaserum when asked, and he slept as well as he ever had.</p>\n<p>Severus saw them in halls, grouped around their smallest members; in the detentions writing out lies with firm strokes of their quills. Fred Weasley reminded him of James-- sitting beside a frightened first-year and waiting for him to find his words.</p>\n<p>Harry's shoulders were going rigid like he was growing a shell over all the soft parts of himself-- something steady and shining, like the suits of armor that lined the corridors. He stood up in classes and hallways and common rooms and told his truth again and again.</p>\n<p>Severus was something like jealous. He was something like proud. He didn't talk to Lily, even alone in his rooms late at night, even when Harry was standing in Umbridge's line of fire, refusing to be bowed. He didn't think <em>Lily, look</em>.</p>\n<p>--</p>\n<p>Late in the spring, Harry had a nightmare. His mind was brittle and desperate, grasping for anything, given nothing-- and so old Tom slipped fear and knowing into his sleeping mind. Severus didn't know all of this until later, until he was talking to Albus, subdued in his office among broken odds and ends.</p>\n<p>Harry was in Umbridge's office, at wand point. Even in the worst of Severus's first war Hogwarts, at least, had never been a battlefield. Severus had almost died in a tunnel under a willow, perhaps, but that had been pettiness and children and an inability to see consequences-- but here was a woman standing shaking and pointing, here was Draco Malfoy with a badge on his chest and a smirk he thought he meant.</p>\n<p>\"Snuffles,\" said Harry. \"He has Snuffles in the place where it's hidden,\" he said.</p>\n<p>Severus could see Granger churning through courses of action like a woman behind enemy lines. He could see the desperation that was living behind Harry’s snakeskin eyes. The littlest Weasley had a bruised cheek and a stubborn visage and Severus wondered if Sprout had ever taken her out to the greenhouses. He told Umbridge he was out of Veritaserum and that Potter was speaking nonsense, and then he went to call the rest of the Order to arms.</p>\n<p>They met in Grimmauld Place, every person he could find-- Kingsley and Moody, Tonks and Lupin. They came, and he tried not to be surprised. Molly fussed and fretted and Arthur was still too pale, but they came and they listened and they went.</p>\n<p>It was almost nostalgia-- hearing the bang and crack of people going off to fight without him. The Mark on his arm spiked into painful life, but he knew he wasn't expected by either side.</p>\n<p>In the Department of Mysteries, six Hogwarts students clashed with grown, hooded fighters. In a room haunted by a veiled archway, reinforcements came for them. Sirius Black died at Bella's eager hand. Voldemort flooded into all the empty places in Harry's chest, sending him writhing over the atrium floor, and Severus sat in the dark of Grimmauld Place and listened to Black's mother shriek.</p>\n<p>--</p>\n<p>Severus Apparated back to Hogwarts' outer gates, when they told him it was over, and strode back to the castle with his cloak flapping behind him. At Hogwarts, you were always a step away. At Hogwarts, you had to rush to its boundaries before you could vanish to anywhere useful.</p>\n<p>He climbed up to Albus's office, where his trinkets and toys and treasures had been smashed here and there by Harry's fifteen-year-old grief. Fifteen-- had Severus ever been that small? He had held Lily's hand, at that age, sat through the muggy heat of her father's funeral and bought her a candy bar after.</p>\n<p>Albus was reinstated and Umbridge had gone missing. Severus gave a lesson about bezoars and watched Harry scowl and clench his hands in the back row.</p>\n<p>Severus wasn't sure how Harry thought the Order had gotten the news, if not for Severus. He didn't corner the boy and snap that he hadn't abandoned him in Umbridge's office-- he'd passed on the message, as asked, what did he <em>want</em>? Sometimes you had to say one thing and do another.</p>\n<p>But maybe Harry did know-- if Severus hadn't alerted the Order, Black wouldn't have gone to the Ministry and Black wouldn't be dead. Harry might be, then, but Black wouldn't. Severus watched the boy stalk through the halls, fifteen years old with his shoulders hunched up to his ears, and he could understand that. He had been that small before.</p>\n<p>--</p>\n<p>That summer, Dumbledore found the Gaunt ring and murdered the snippet of spirit living inside it. Hogwarts was empty over the summer holidays except for Hagrid out weeding the grounds. Severus met Albus up in his high study and turned his blackening hand over in his sallow fingers.</p>\n<p>\"This is an ugly curse,\" he said, like he'd comment on the warm weather burning the grass outside.</p>\n<p>\"Did you expect any less of Tom?\" Albus said.</p>\n<p>\"<em>You</em> apparently didn't,\" Severus snapped, laying Albus's hand gently back on the table.</p>\n<p>\"There are some things you cannot defend against,\" said Albus. \"I made a call.\"</p>\n<p>Severus rose to pace, a hiss held tight behind his teeth.</p>\n<p>\"Dark times are coming,\" said Albus.</p>\n<p>\"<em>Obviously</em>,\" Severus snapped. \"Did you hear the news I brought? He's recruiting the giants. He's got Fenrir out after the werewolves--\" Albus wasn't looking at him. \"Albus, what do you know? What have you heard that I don't know?\"</p>\n<p>\"Narcissa Malfoy may soon ask you a favor,\" Albus said, looking at his hand.</p>\n<p>\"Albus, tell me.\"</p>\n<p>\"I have more sources than just you, Severus. It is just-- she may ask you a favor. Please say yes.\"</p>\n<p>--</p>\n<p>Severus's parents had died and he had buried them in shallow earth, so the house in Spinner's End was his now. Narcissa had never been there before and he was trying to decide if he appreciated the way she looked at him and not at the water stains or the battered pans or the threadbare carpet. Bellatrix came in after her and dropped down on a sunken couch, soft cushions curling around her hips.</p>\n<p>\"He's asked Draco to--,\" Narcissa said, voice catching, and Bella said, \"Yes, it's an honor,\" and Severus went to pour himself a glass of water. He didn't offer either of them any.</p>\n<p>Narcissa didn't ask him for the Dark Lord-- she asked him for her own sake. Severus wondered if it was because she knew something. She took his hands and squeezed them like they were still teenagers, like he was in love with Lily Evans and Cissa was soberly considering the curve of Lucius's adolescent jawline. \"My son,\" Narcissa said. \"Whatever he needs to do, you must promise to help him.\"</p>\n<p>Bella demanded the Unbreakable Vow, because she didn't understand any of him-- that Narcissa's dry hands gripping his were all that was needed to bind him here, that Severus would break any promises he needed, no matter if his blood boiled in his veins from the lie.</p>\n<p>--</p>\n<p>\"How would you like to fill the DADA position, this year, Severus?\"</p>\n<p>Severus stared at Albus. \"Within the year, then, you think?\" said Severus. \"You think this will all come crashing down within the year-- if you're willing to hand me over to that curse, now.\" Dumbledore's withered, ashy hand sat on the desk between them. He'd kept the Gaunt ring on his finger, the morbid soul.</p>\n<p>\"I do not think I will survive the year, and when you kill me you will no longer be welcome at Hogwarts.\"</p>\n<p>\"What if I don't want to <em>kill you</em>, Albus? I promised to help Draco, not--\"</p>\n<p>\"When has this ever been about wanting, for you?\" Dumbledore shook his head-- had he always been this old? Severus wondered. Had he always been this small-- narrow-shouldered beneath generations of portraits of dead wizards and witches?</p>\n<p>Albus said, \"I will tell Harry about the Horcruxes, this year. Draco will try to kill me and we cannot let him, Severus. Killing scars the soul— he’s too young to carry that, we cannot let him.\"</p>\n<p>Too young-- Had they ever been that young?</p>\n<p>\"What about my soul?\" Severus said. \"Or did I not make it into your calculations, headmaster?\"</p>\n<p>\"It won't be a killing, from your hands,\" said Albus and Severus scoffed and stalked toward the windows. \"You know more than he does. From you, it will be a mercy.\"</p>\n<p>\"Not for me,\" said Severus.</p>\n<p>\"For me,\" said Albus. \"Please, Severus.\"</p>\n<p>\"Do you know what I have done for this fight?” Severus had screamed at Albus once, but he didn't say it now. “For them? For <em>you</em>? Do you understand what I have bled and what I have <em>cut away</em>—”</p>\n<p>\"Alright,\" said Severus. \"When it's time. Make sure you say your good-byes this year, Albus.\"</p>\n<p>\"To who?\" said Albus and Severus dropped his head down and laughed.</p>\n<p>--</p>\n<p>Draco slunk around corners that year, looking pale and heavy-eyed. He looked worse than Harry, which was fairly saying something. Harry slunk around behind him, still desperate, still grasping, and Severus remembered trying so badly to dig out Lupin's secrets at sixteen.</p>\n<p>He cornered Draco when he could-- offered help, pretended to know secrets he didn't, threatened, anything to get anything at all off the boy's shoulders. But Draco stood and shook and refused.</p>\n<p>Severus and Lily had written in the pages of his textbooks, on their bellies in her bedroom, leaning over them at Hogwarts library tables. He'd filled his potion textbook with irritated corrections to imperfect recipes and she'd drawn little comics of their classmates-- James messing with his hair so much it all fell out; Lucius leaving a trail of sleaze behind him; Alice standing on the Hufflepuff table in the Great Hall and shouting about non-human rights.</p>\n<p>Severus had invented things out in the Forest, ripped magic from his chest and considered what he found there. So little of it had been kind.</p>\n<p>Severus heard noises from a bathroom, years after he had written those things down, lifetimes after, and he found Narcissa's son bleeding out on the grungry tile from a spell he'd invented at sixteen.</p>\n<p>\"I didn't,\" said Harry. \"I didn't mean-- I didn't <em>realize</em>--\"</p>\n<p>Everyone always said Harry looked like his father, and Severus had known James petty and young, ugly and hurtful; he had known him quiet in a dusty attic, waiting for Severus to find all his words. Draco's blood was on the bathroom tile and Severus would clean it up, later, when he was done with the kid's wounds and giving Harry Saturday detentions until the end of the year.</p>\n<p>Everyone always said Harry looked like James, but Harry was standing over a bleeding classmate and all Severus saw in that moment was Tom.</p>\n<p>--</p>\n<p>Albus told him later that Harry had been angry, that he had been frightened, that he had thought Draco had been up to something, that he hadn't known what the <em>Sectumsempra</em> spell did.</p>\n<p>Severus wasn't sure that made anything better. He went out to the Forest and turned tree trunks bloody, like he was sixteen and curious with it again. He thought about <em>Levicorpus</em> on James's tongue, all the things Severus had dragged out of his own chest and then found in other people's careless hands.</p>\n<p>--</p>\n<p>There were Death Eaters on Hogwarts ground, that year-- more than the back of Quirrell's skull or Riddle's diary or a rat curled up high in Gryffindor Tower-- more than Lucius Malfoy come to give his son a present or Barty Crouch Jr. hiding in other peoples' skin. Draco made them a gate and they came, in pairs, in robes, wands drawn, smiling under their hoods.</p>\n<p>\"Please,\" said Albus, standing in the Astronomy tower among enemies and Draco and Severus-- and how did Severus get to a point in his life where Albus Dumbledore was the only person alive who knew anything at all about who he was? \"Please, Severus,\" he said, and how was this real, that Albus Dumbledore was going to die begging?</p>\n<p>Draco was shaking, his wand arm no longer even lifted, and Severus wanted to scream at him-- about Narcissa's dry hands, how in school Severus had been so certain she was going to go somewhere, conquer things, shine-- about being eighteen in a burning bloodless home, deciding then and there what to do the day someone alive was at the end of his wand. Severus wanted to scream at him, <em>if you were stronger I wouldn't have to do this</em>, but Draco was a child and Severus hadn't been one of those in a long time.</p>\n<p>Draco couldn't do it-- not for his mother and not for himself. He couldn't even raise his wand and Severus was something like jealous. He was something like proud.</p>\n<p>\"Please,\" said Albus, and Severus found enough hatred in his soul to kill him.</p>\n<p>It might have been a mercy to Albus. It might have been a rescue for Draco, and a boon for Narcissa, but Severus watched the light go out of Albus's eyes. He heard Harry scream from below the floorboards, and he had heard that scream from smaller lungs. The wind billowed through the Astronomy Tower's high window and Albus Dumbledore hit ground somewhere far below.</p>\n<p>\"You'd better run,\" Severus told Draco. His voice didn't even shake, because he asked it not to.</p>\n<p>Hogwarts rose against the invaders and Severus blocked their curses and thought <em>good</em>. Ginny Weasley hurled Bat-Bogey Hexes at Avery and Susan Bones ducked under Bella's Avada kedavra and Neville Longbottom charged at Rodolphus with his wand in his thick fist and Severus thought, <em>were we ever that young? </em></p>\n<p>Dumbledore's body was going cold on the flagstones. Severus was so tired of running for the edges of Hogwarts. He was so tired of not being where he needed to be. He was so tired of people screaming at him. He was so tired.</p>\n<p>And here was James's son, here was Lily's son charging down the grass after him. Harry was screaming about cowardice because he didn't know how to scream about how he had lost too many fathers lately. He had Lily's eyes. He had James's stupid fucking hair and Severus was tired.</p>\n<p>Death Eaters were disappearing all around him with a crack and a boom. The castle was alight behind Harry and his furious <em>Stupefy</em>s. Albus was dead at Severus's hand. He had begged for it, in the end, for the sake of a scared boy's soul, and Severus could not name it a mercy.</p>\n<p>\"Don’t call me coward,\" said Severus. He took a step backward over the Hogwarts property line and vanished.</p>\n<p>--</p>\n<p>He would have liked a day. He would have liked to ask Sprout to feed Agatha. He would have liked to find a corner where no one would bother him and sit there until he fell asleep, but instead Severus appeared with a <em>crack</em> in the foyer of Malfoy Manor. Voldemort rose up with whispering robes, with a smile, and Nagini curled around his ankles. Soft fingers pressed against Severus’s skull and he filled his mind with hate.</p>\n<p>The summer rolled on, muggy and thick. They buried Dumbledore and Severus read about it in the papers and Rodolphus slapped his back, grinning. Agatha found him and he shooed her away with angry sweeps of his arms— she was large even for an owl, but Nagini was massive for a snake and Severus couldn’t, he couldn’t—</p>\n<p>\"How would you care to be Headmaster of Hogwarts?\" Voldemort asked him, smiling. \"I need someone there I can trust, Severus, and you know it better than any of us.\"</p>\n<p>\"Whatever you need, my Lord.\"</p>\n<p>Harry and his friends didn't return to Hogwarts. Alecto Carrow took over as Muggle Studies teacher, and the old professor writhed over Voldemort's dinner table. The first blows fell in Hogwarts hallways-- Neville Longbottom, of all people (of course Neville, of all people), getting between Amycus and a second-year, and Severus watched.</p>\n<p>In Defense class, students practiced curses on each other under Amycus's eye and Parvarti's fists were small and taut in her robes. She and Lavender paired off with Crabbe and Goyle so no one else would have to. Anthony Goldstein hid out in the library and tried to invent untraceable shielding charms to give to the youngest students, and Severus watched.</p>\n<p>The littlest Weasley, the Lovegood girl, and Neville tried to steal Gryffindor's sword from the Headmaster's office. Alecto rose up to her full height, hissing threats, and Severus stepped in and gave the kids detention out in the Forest with Hagrid, as though it was a punishment. Harry, Granger, and Weasley stole the locket Horcrux, and Severus fell asleep with his feet up Albus's old desk and woke up only when his chair unbalanced and threw him to the floor.</p>\n<p>McGonagall watched him balefully across the Great Hall table, and Flitwick wouldn't speak to him, but Sprout stamped into his office and left mud all over the carpet. \"I know you're scared of him,\" Sprout said, and he could see her trying to be compassionate with it. \"But how can you let them do this?\"</p>\n<p>\"Please, Professor,\" Severus said, because they were only so many moments of his life he could hide from Voldemort's eyes, because in the end what did the opinion of one old woman really matter? \"If you would see yourself out.\"</p>\n<p>\"I expected better of you,\" she said.</p>\n<p>\"And I apologize for that,\" said Severus.</p>\n<p>She hid them out in her greenhouses, he knew-- first years she thought were too fragile or children who were painting bull's-eyes on their backs. Sprout took them out there for quiet afternoons of peace, breaths in the middle of drowning, and some she just never sent back. She knew every hillock and tree of the Hogwarts grounds. Some she had made herself and she hid the children there who she thought needed it.</p>\n<p>First-years disappeared into Sprout's hedges. Susan Bones and Hannah Abbott vanished into the Hogwarts walls, sharing warm foxholes with Neville, Weasley, and Lovegood, who'd already gone. Neville had stood on the Gryffindor table before he left and shook the Great Hall with a voice as big as Alice's, and Severus sat alone in the Headmaster's office and talked to the portraits of dead witches and wizards like they knew anything about what he was supposed to do.</p>\n<p>Sue Li brewed up Polyjuice Potion in the girls' bathroom with ingredients stolen from Severus’s old stores. Astoria Greengrass giggled at Amycus's jokes and cried appealingly and stole hairs and fingernail clippings to sneak back to Li. Anthony hid out in the Forest, scarring the trees and trying to invent untraceable counter-curses, shields that snapped back, and Severus misplaced some of his old notes into Anthony's book bag.</p>\n<p>Lee Jordan's radio whispered through the dorms and hallways and courtyards of the castle. Seamas Finnegan didn't sleep through the nights anymore, going over maps in the Room of Requirement, and Severus sent his Patronus to guide Harry to Gryffindor's true sword, drowned in a frozen pond.</p>\n<p>They called Weasley, Lovegood, and Longbottom <em>generals</em>. They called Amycus and Alecto <em>Dumb and Dumber</em> and Severus didn't listen to what they called him, because he had earned it. This was victory. This was what he had.</p>\n<p>--</p>\n<p>They found the cup, the locket. They had killed the diary, already, and the ring. The diadem was waiting at Hogwarts, the snake at Voldemort’s feet, and Harry didn’t know, even now, what he was carrying in his chest.</p>\n<p>Severus had thought Granger might guess about the eighth Horcrux, but she didn’t. He wasn’t sure what she would have done with that knowledge— contingency plans, flight, denial, a knife in a boy’s sleeping back?</p>\n<p>Or maybe she had guessed and had just decided to do nothing. Maybe she was waiting.</p>\n<p>The castle rose up against the invaders. McGonagall banished Severus from the Great Hall, like she’d been dreaming of doing every Halloween for sixteen years.</p>\n<p>Hogwarts rose up and Severus, fleeing out the Great Hall’s wide windows, thought <em>good</em>.</p>\n<p>People turned to Neville, listened when he spoke, nodded and gripped his hand— Severus had been watching the boy become a lodestone, all year. Fred Weasley died mid-laugh and Severus, dragging his robes through the mud on his way to the Willow, didn’t know. Nymphadora Tonks went down on damp stone, her hair fading back to a plain mousy brown, and Severus would never know.</p>\n<p>Minerva had banished him and Voldemort had called him, and so Severus was going. He was a dark shape moving through pale weeds and everyone thought they knew him. Flitwick thought <em>good riddance</em>, and Harry thought about Albus begging on the Tower, and Sprout thought he was scared. Voldemort thought he had a right to the power of the Elder Wand, but Severus had nothing.</p>\n<p>\"I'm sorry, Severus,\" Voldemort said out in the Shack. Harry was listening from the shadows, Harry had run, Harry was trying to figure out what to do next, and Voldemort didn’t know but Severus did. \"You have been nothing but loyal, but only one of us can live forever.\"</p>\n<p>And Severus wanted to tell him-- <em>you want the one who defeated Dumbledore? Look for the child in your flinching shadow, because I killed him empty-handed. I was a mercy. </em></p>\n<p>Severus wanted to scream at him, <em>what do you know of loyalty? What do you know of living? He has her eyes. He's going to kill himself at your hands, because I'm going to tell him he must, because it will save everyone he loves. What have you ever been, Tom, that could compare to that? </em></p>\n<p>\n<em>Do you know what I have done, for them? Do you know what I have been? </em>\n</p>\n<p>\n<em>I would have died for them. I have been dying for them. </em>\n</p>\n<p>And he did.</p>\n<p>--</p>\n<p>It was a selfishness, but when Severus pulled wisps of memory into the air, he gave Harry more than the last of Dumbledore's battle plan.</p>\n<p>Harry needed to know that he had a piece of Tom Riddle living in him, and that it had to die-- but he also needed to know that he had some of Lily alive in him, and James, and that they had lived and lived. Severus's chest was turning to static under the weight of it all.</p>\n<p>\"Go,\" he told Harry. He was gasping on the floor of the Shack and Harry was staring at him— the blood, the greasy hair falling over his eyes, his shaking hands. Had Harry ever seen someone die before? Of course, of course he had… \"Please,\" Severus said, and he didn't know if these were even words anymore. \"Please, listen.\"</p>\n<p>Harry left, and then the room was empty, except for darkness, and dust, and him.</p>\n<p><em>He's alive,</em> Severus told himself. His ears were turning to static, his eyes.</p>\n<p><em>Not for long, though, </em>something whispered.</p>\n<p><em>He's alive,</em> he told himself. <em>And that means making choices. And that means dying, sometimes. </em></p>\n<p>He hurt, an ache spiraling outwards from the wound. He was cold.</p>\n<p>\n<em>He's alive. He has her eyes. He has her heart, and yes that means he won't live long, but he's alive. We made it here, all the way to the end. </em>\n</p>\n<p>The room was getting darker. Severus let his head fall back, his breath rattling in his chest. <em>He didn’t even manage to outlive you. I'm sorry, Lily. </em></p>\n<p>\n<em>I would have saved him, if I could have. I would have made it turn out different, if I could, but I didn't have any way out. And so we're here. But I think you would have been so proud of him.</em>\n</p>\n<p>The poison sank into his veins. The cold didn't leave. Severus died alone, in pain, and in that moment no one mourned him, not even himself.</p>\n<p>--</p>\n<p>But his memories did not die with him.</p>\n<p>--</p>\n<p>Harry walked back down the tunnel that he had raced down once in desperation, after Ron and an emblem of death; that Severus had once walked in quiet rage.</p>\n<p>Severus had been pulling bits of himself out of his skull for years and handing them over-- in the dark of his room, in the cold sugar-sweet air of the freezer, standing before Albus's desk with the light streaming in through the windows.</p>\n<p>Harry climbed up to what had once been Dumbledore's office with a vial of white smoke clenched tight in his fist. It was the only thing Severus had left behind other than a set of annotated textbooks and one angry tawny owl. Harry poured it out into the silver bowl of the Pensieve and leaned forward until he felt like he was falling.</p>\n<p>Everything was static, and then he hit ground.</p>\n<p>--</p>\n<p>Harry had been here before.</p>\n<p>He was kneeling in green grass, with his father laughing and bruises blooming. He spat out the bile on his tongue and he would never be able to swallow that back down.</p>\n<p><em>That's a reason to hate him,</em> Harry thought down to his balled fists, their ink stains and the way they lacked his scars. <em>Not a reason to hate me. </em></p>\n<p>The grass was green, and the sky blue, and Lily was running across the quad with her long hair flying, and Harry started to rise up--</p>\n<p>--</p>\n<p>Yellow and white lace curtains flapped in the window of a kitchen Harry had never known. A woman with greying yellow hair muttered at the to-do list inked onto her palm until she spotted him hovering there. \"Oh, honey, you scared me. Lily should be back from flute practice in a sec.\"</p>\n<p>She leaned her weight on the counter. Her nails had been painted magenta with an unsteady hand, but she smiled at him and Harry recognized his own nose on her face. \"You want a sandwich, kiddo? I swear you're all bones.\"</p>\n<p>\"I'm looking for an answer,\" said Harry, while his grandmother made him a ham sandwich and cut off the crusts because Severus had always hated crusts. \"I need to know what to do next. You promised you’d tell me—”</p>\n<p>--</p>\n<p>Green flames roared through a small house-- blackening timbers, withering curtains, crumpling wallpaper. Harry could hear it but he couldn't feel the heat, just his hand wrapped tight around a wand.</p>\n<p>\"What is this?\" said Harry. \"Is this the last war?\" He turned around and there were hoods all around him, like in the graveyard, in the Astronomy Tower, and the house was burning.</p>\n<p><em>What would you have done?</em> asked a whisper. <em>What will you do?</em></p>\n<p>\n<em>You do not have to know, you do not have to know, you just have to die--</em>\n</p>\n<p>--</p>\n<p>Severus was screaming in Albus's office about raising a child like a pig for slaughter, but Albus's voice was the loudest thing there. It shook the earth and filled the air and weighed Harry down with the sunlight coming through the windows.</p>\n<p>\"You must understand,\" Albus said, and part of Harry was screaming at the sound. It sank like lead to pool in his toes. It shook the rafters. \"When he killed Lily and James, he made another Horcrux.\"</p>\n<p>--</p>\n<p>\"Getting his ass kicked by Lily Evans,\" said Severus and Harry stood there in a library that had saved his life over and over and he looked at his mother's face. He was eleven and losing nights and nights of sleep staring at an enchanted mirror. He was thirteen and poring over Hagrid's photo album. People were telling him, again and again-- <em>You have your mother's eyes. </em></p>\n<p>Lily scowled at him, cross-legged on the table and her gangly elbows on her knees. Severus said, \"It'd be an honor and you know it.\"</p>\n<p>--</p>\n<p>The door to the Godric’s Hollow house hung open. Smoke rose. Half the roof was missing, and Harry stood there in the shadow of it, looking up. “You were here?” he said, but Severus was gone, into the house, vanishing.</p>\n<p>Harry pulled himself through the open door. Severus's feet pounded up the stairs, because the baby was screaming still, because where was Lily, because maybe maybe they weren't too late-- but Harry stopped at the edge of the ugly garish rug.</p>\n<p>Severus had been too late, but Harry remembered.</p>\n<p>\n<em>Lily! He's here. Take Harry and go. </em>\n</p>\n<p>There was a rag doll rabbit strewn on the floor. James was strewn on the floor, his mess of hair falling out from under his green knit cap. Harry stood there, counting years, counting stitches, trying not to cry, and thought <em>He's Fred's age. </em></p>\n<p>He took the stairs one at a time. He and Hermione had come here but with seventeen years of weather writ into the walls. He touched the wallpaper and the tips of his fingers drifted through it, leaving white wisps curling behind him.</p>\n<p>He reached the top of the stairs and the wind blew him away.</p>\n<p>--</p>\n<p>The sound of leaves kicked over hard pavement. The crinkle of a candy wrapper--</p>\n<p>Lily reached up from a fairy circle of schoolwork and detritus, cross-legged among pumpkins the size of boulders. Apologies ached in his throat.</p>\n<p>Lily pulled him through the snow and into the bare warmth of the pub, and Harry stood in the Hog's Head and watched Dumbledore draw Severus out into the side alley. He wondered if Severus had ever realized that Dumbledore had waited until Lily was distracted to pull him aside. The winter air billowed through the open door and froze him down to his bones.</p>\n<p>Lily pulled him up a stairway and Severus stared at where her freckles met the sallow skin of his wrist. <em>She sounds different when she's not on the other end of a radio</em>, thought Severus.</p>\n<p><em>She sounds different when she's not standing between her child and a killer,</em> thought Harry, and then the wind stole him away again-- out the attic, past three open jam jars and James leaning forward to hear them both better.</p>\n<p>--</p>\n<p>Harry's hands had never moved this smoothly over knives. Long green stalks fell to perfect splinters. Electric blue mushrooms became perfect cubes, diced and piled to the side. Bulbs he crushed under the flat of a silver blade, and he could hear their names in a dozen languages dancing behind his eyes.</p>\n<p>He pushed greasy hair off his forehead and everything was quiet, quiet, quiet for just a second before the static rose up and up.</p>\n<p>--</p>\n<p>\"I know the sacrifices I am asking,\" said Albus, and Severus was sixteen and standing in the dirty snow. He didn't scream at the old man, <em>but you don't, you don't, you don't. I will do it but you do not know--</em></p>\n<p>\"Oh, honey, eat another sandwich, would you?\" said Mrs. Evans, and the yellow and white curtains were burning-- they had never burnt, but they were burning-- they had boarded up the house and Lily had buried her mother without him--</p>\n<p>\"You sent me a <em>hat</em>. It wasn't marked but I know it was you,\" and here was James laughing. \"It matches Lily's eyes,\" and here was James lying on the terrible rug Sirius had bought them and that James and Lily had kept just to spite him.</p>\n<p>A chitinous shell was growing up over his shoulders, over all the softest parts of him and he would die with it-- die for it--</p>\n<p>A blanket was pulled tight over his head-- a Cloak was hiding him, and he was stealing secrets and slipping poisons in drinks and swallowing poisons and spitting poisons--</p>\n<p>Put on your armor, kid, c'mon-- build it up and build it out of you. It won't be pretty, kid, but you can be stronger, you can <em>be</em>--</p>\n<p>\"Because this isn't good-bye, okay?\" said Lily.</p>\n<p>\n<em>Not just for her. Not just-- Not her, not her, no, I would have died for her, I would have died-- </em>\n</p>\n<p><em>You can't. You can't, okay, you </em>can't<em>. Lily. </em></p>\n<p>\n<em>--</em>\n</p>\n<p>The sound of leaves kicked over hard pavement. The crinkle of a candy wrapper. The hiss of empty airwaves.</p>\n<p>A girl sat on schoolhouse steps, under a slate sky, offering half a candy bar. She was seven and Harry felt too small in his oversized sweater, felt at home in the careless mending over his knees. A bird shrieked from the maple tree.</p>\n<p>He had a pebble in his shoe, but Lily was smiling at him with a chocolate smudge over the freckles on her thumb. He sat down and ate the candy in slow careful bites while she told him how, one day, Tuney was going to grow up and save the world.</p>\n<p>--</p>\n<p>There was a boy lying on a bed, staring up at a moldy ceiling, listening to the static of empty airwaves. He did not die there. He went on. He dragged memories from his head and marrow from his bones and the shaking from his hands.</p>\n<p>There was a half-blood boy in an ugly home, hungry, listening to his father snore on the couch. There was a half-blood boy who sat invisible on his aunt’s kitchen counter in the summer midnights of his second and third and fourth and fifth years of school and ate Nutella straight from the jar.</p>\n<p>There was a half-blood boy in clothes too large for him. There was a boy walking the halls of Hogwarts while someone hissed at him from the crowd. There was a boy in love with a girl who talked with her hands. There was a boy weighing the words on his tongue.</p>\n<p>Severus was taking James's hand in a buried tunnel. Severus was storming down the same tunnel, squeezed with rage, certain with it, ready. <em>You promised. You were supposed to keep her safe.</em> Severus was overhearing a prophecy and he didn't realize, he didn't <em>realize</em>--</p>\n<p>Lily was washing dishes and flicking soapsuds at him. Lily was running too fast across a green field. Tom Riddle had his fingers wrapped tight around Severus’s wrist, his wand dragging down his forearm. James sat in an attic, waiting for Severus to find his words. Lily had leaves in her small freckled palms, trying to turn them to flowers. Severus had Harry heavy on his chest in a broken-open bedroom and the wind was stealing the words from his mouth. \"Hey. Hey, kiddo, it's okay. I got you. Lily, I got him.\"</p>\n<p>Harry was walking the memories of a man he'd thought had hated him and Lily was on the other end of a radio, laughing, whispering, her belly and her ankles swollen. \"I want you to be his godfather, on my side.\"</p>\n<p>--</p>\n<p>\"There will come a time,\" said Albus and it shook the walls, it rattled the windows, it brought down the rafters. \"There will come a time,\" said Albus, \"when you have to make a choice between what is <em>right</em> and what is <em>easy</em>,\" and Harry turned on his heel and walked down the long, empty corridor.</p>\n<p>Albus's voice followed him. \"Remember.\"</p>\n<p>--</p>\n<p>\"Please,\" said Severus. \"Listen.\"</p>\n<p>--</p>\n<p>Harry opened his eyes in Albus's old office in the middle of war. The carpet was rough under his knees. The day was ending and nothing was pouring through the high windows but dusk.</p>\n<p>He was seventeen years old. He didn't want to die, but what had wanting to do with any of this?</p>\n<p>Everything-- wanting had everything to do with it. It was every reason he had.</p>\n<p>Harry wanted to never see Molly cry over anything the way she'd wept over Fred's body. He wanted Hermione to have long afternoons to curl up in an armchair, in the sun, with a stack of \"light reading\" and Crookshanks purring in her lap like he could bring the house down. He wanted to wipe the bags from under Luna's eyes and take her out in her most paint-splattered overalls and find her a field of wildflowers and the best brushes money could buy.</p>\n<p>He wanted to always be around for Ron to come back to, proud and clever and too quick to catch himself; he wanted to lose at chess at Molly's big kitchen table, and he wanted to see Ron touch Hermione's shoulder thoughtlessly, warmly, in a tiny terrible flat, and he wanted to watch Hermione kill every poor plant they tried to keep in pots on the windowsill.</p>\n<p>He wanted to go to sleep at night with Ginny breathing in the dark beside him, and he wanted to come home at night to an accidentally empty larder and eat hasty take-out while she waved her chopsticks around and told him about every stupid thing she'd seen that day and everything wonderful thing, too. He wanted to tease her when she wore three years of Christmas sweaters in winter and still had icicle hands, and he wanted her to be alive. He wanted all of them to be alive.</p>\n<p>Harry would think, as he walked out to the Forest: <em>There is a difference between being dragged into the stadium to die, and walking with your head held high. Dumbledore knew that, and my parents knew that, and I do, too.</em></p>\n<p>Severus would have said it differently, but Harry didn't know that, and he would never know that. <em>There is a difference between dying, and dying for something. </em></p>\n<p>The trees in the Forest were old and alive under the billowing wind. In their shadows, Severus had failed all his life to invent anything kind, but he had died for this.</p>\n<p>Harry would live, but he didn't know that. He walked out into the Forest with nothing but a stone and a stick of wood and all the ghosts who loved him at his sides. He was seventeen.</p>\n<p>Harry died in Forest mulch and he rose up in a Hogwarts courtyard and he killed Tom Riddle. He didn't have enough hate in him, but he didn't need it.</p>\n<p>He found Ron in the crowd, lanky and freckled, a dirt smudge on his nose-- he found Hermione bushy-haired and teary and blazing-- he found Ginny and she grabbed his hands and laughed and crushed him in a hug and the last of the static faded from his ears.</p>\n<p>The war was over. The war was won.</p>\n<p>--</p>\n<p>When Harry had stood in the clean white place that had looked like King's Cross Station, he had wondered.</p>\n<p>In the years to come, the long years, the warm years, he thought about Ginny on the battlefield with her red hair like a war banner; thought about Hermione, who never left, and Ron, who always came back; and he wondered if Severus had stood in a place like that, in his last moments. He wondered if he had had a choice.</p>\n<p>Harry wondered if anyone had taken Severus’s hand and told him he could go-- he could get on a train and just go, and that there would be people waiting at the end of the journey who loved him.</p>\n<p>--</p>\n<p>--</p>\n<p>--</p>\n<p>\n<em>epilogue: seven years later</em>\n</p>\n<p>James Sirius was asleep on Ginny's chest, her freckled hand cupped around his small dark head.</p>\n<p>\"If it's a girl we're naming her after Luna,\" said Ginny.</p>\n<p>\"Godmother, namesake, <em>and</em> role model?\" said Harry. \"That's a lot of pressure and Luna's so tiny.\"</p>\n<p>\"Tiny and terrible,\" said Ginny with eyes half closed. \"Conqueror of worlds, dreamer of dreams, shaker-up of stagnation. She's my favorite. I'm not sure how you can possibly compete, Potter.\"</p>\n<p>\"My rakish good looks.\"</p>\n<p>\"Nope,\" she said.</p>\n<p>\"My rakish charms,\" he said.</p>\n<p>\"What charms? Where are you getting this impression that you're rakish? You wear Mum's sweaters unironically--\"</p>\n<p>\"They look <em>good</em> on me--\"</p>\n<p>\"Shush, <em>shush</em>,\" said Ginny. \"If you wake him, I'll have Charlie set a dragon on your pretty face, don't think I won't.\"</p>\n<p>\"If <em>I</em> wake him,\" Harry hissed and Ginny giggled, her chest shaking under James's sleeping head.</p>\n<p>There was a stack of battered old textbooks in the corner, their margins filled and heavy with two inked hands. Harry had carried them along, from Andromeda Tonks's spare room, to his and Ron's first flat where Hermione crashed constantly during her university years, to the little place with Ginny above the ice cream shop, to here.</p>\n<p>Pea shoots climbed up the garden wall outside. In a few minutes, Agatha would come with the mail and mob them until Harry got up to make her some toast.</p>\n<p>Ginny had tipped her head back, smiling, but she turned to Harry when he made a sound.</p>\n<p>\"If it's a boy,\" said Harry.</p>"
}