{
  "id": "1152767",
  "url": "https://archiveofourown.org/works/1152767?view_full_work=true",
  "author": [
    "grimm"
  ],
  "title": "our lives are changing lanes",
  "rating": "Explicit",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Teen Wolf (TV)"
  ],
  "relationships": [
    "Derek Hale/Stiles Stilinski",
    "Allison Argent/Scott McCall",
    "past Derek Hale/Kate Argent"
  ],
  "characters": [
    "Derek Hale",
    "Stiles Stilinski",
    "Scott McCall",
    "Laura Hale",
    "Sheriff Stilinski",
    "Kate Argent",
    "Gerard Argent",
    "Original Characters"
  ],
  "additional_tags": [
    "Deputy Stiles Stilinski",
    "Single Parent Derek",
    "Single Dad!Derek",
    "Slice of Life",
    "Alternate Universe - Werewolves Are Known",
    "Alternate Universe - Modern Setting",
    "Kid Fic",
    "bottom!Derek",
    "implied versatile!sterek"
  ],
  "language": "English",
  "series": "",
  "published": "2014-01-26",
  "completed": null,
  "words": "47,537",
  "chapters": "1/1",
  "comments": "503",
  "kudos": "21,944",
  "bookmarks": "6,823",
  "hits": "395,524",
  "summary": "<p>There's a lot of screaming going on inside the first house Stiles visits. He isn't really worried, because it sounds like kids, but then the door opens and <em>hi</em>, says his dick, because the dude in front of him is <em>gorgeous</em>, built like a god with a face like thunder. Stiles wants to <em>lick</em> that solid jaw line. <em>Hold the fuck on,</em> says his cop brain, because the dude's got kids hanging all over him; one's on his back, skinny legs looped around his waist, and another two hanging off one arm, toes barely brushing the ground. There's a tubby toddler clinging to his leg like a koala, and he's got a baby tucked into the crook of the one arm that <em>doesn’t</em> have kids hanging off it. Stiles' mouth drops open.</p>\n<p>\"How many of those kids did you <em>kidnap?\"</em> he asks before he can wrangle his brain into submission.</p>\n<p>The man gives him a look that says <em>what the fuck is wrong with you</em> and snaps, \"You think I'd subject myself to this on purpose?\"</p>\n<p>\"Oooh,\" says one of the kids hanging off his arm. \"I'm telling Mom.\"</p>",
  "notes": "<p>This fic is for <a href=\"https://the1001cranes.tumblr.com\" rel=\"nofollow\">Amanda</a> and is one hundred percent inspired by a conversation we had on Twitter last fall about her Sims - Stiles was a cop and Derek had a bazillion kids. </p>\n<p>Thanks to <a href=\"https://qhuinn.tumblr.com\" rel=\"nofollow\">Qhuinn</a> for her beta &amp; cheerleading work, and thanks to <a href=\"https://winterkiss.tumblr.com\" rel=\"nofollow\">Becky</a> for the <a href=\"https://winterkiss.tumblr.com/post/74627626600/give-away-au-gifset-itslookinggrimm-our\" rel=\"nofollow\">gorgeous graphic</a> she made! Thanks to everyone else for their enthusiasm and encouragement along the way - I really hope this fic lives up to all the hype. </p>\n<p>Title is a line from \"Reptilia\" by The Strokes.</p>\n<p>Warnings: Brief un-negotiated [choking] kink, someone has to stick their fingers in someone else's bullet wound, a car crash, hospitals, let me know if I missed anything else!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Follow me on <a href=\"https://itslookinggrimm.tumblr.com\" rel=\"nofollow\">tumblr</a> &amp; hang out with me on <a href=\"https://twitter.com/Grimm_times\" rel=\"nofollow\">twitter</a>!</p>",
  "text": "<p><em>\"Dad,\"</em> Stiles says impatiently.</p>\n<p><em>\"Stiles,\"</em> his father says mildly, not looking up from his paperwork. He doesn't say anything else, knowing full well Stiles will make his displeasure known in some way or another; he doesn't need to ask.</p>\n<p>Stiles does; he flings himself into the chair across the desk and says, \"Dad. Canvassing, really? I'm not a rookie anymore.\"</p>\n<p>\"I think you are,\" his father replies, circling something on a report. \"You're only our second-newest hire.\"</p>\n<p>\"I've been on the force for three years!\"</p>\n<p>\"And you'll be a rookie until we hire four more people or you've been here two more years, whichever comes first,\" his dad says. \"Just because you've been here for a while doesn't mean you stop doing legwork, son.\"</p>\n<p>\"You do know that's a predominantly werewolf neighborhood, don't you?\" Stiles asks, frowning.</p>\n<p>\"Yes,\" his father says patiently, \"which is why Scott's going to go with you. He'll wait in the car while you ask the questions. You won't come to any harm.\"</p>\n<p>\"Right,\" Stiles says sarcastically. \"Which is why you're sending me out with the muscle.\"</p>\n<p>\"Exactly.\" His father closes the folder in front of him and gives Stiles a long look. \"You got anything else to complain about?\"</p>\n<p>\"The soda machine doesn't have ginger ale and no one ever brings in donuts,\" Stiles says resentfully, getting to his feet. \"I hate this job.\"</p>\n<p>\"You're well on your way to becoming a bitter old cop,\" his dad says, waving him out. \"I'm proud of you, son.\"</p>\n<p>-</p>\n<p>\"What do you think about starting a bagel day?\" Stiles says as he and Scott head toward the far side of town.</p>\n<p>Scott narrows his eyes at the road, tapping his fingers against the steering wheel. \"What do you mean?\"</p>\n<p>\"I mean like we get everyone on a list and every Friday it's someone's turn to bring in bagels and juice and stuff. Don't you think that'd be nice?\"</p>\n<p>Scott thinks about it. \"You <em>know</em> people would end up forgetting it was their turn and then people would get pissed because there are no bagels and people <em>not</em> on the list would always try to mooch - \"</p>\n<p>\"Ugh,\" Stiles sighs. \"You're completely right.\"</p>\n<p>\"It was a nice thought, though,\" Scott says consolingly, and Stiles grins over at him. Scott's been his partner since the day Stiles joined the force. He honestly couldn't believe they never met sooner; they both grew up in Beacon Hills, but Stiles went to Beacon Hills High and Scott went to the private school up the hill and their paths never crossed. Scott's a werewolf but that doesn't bother Stiles in the slightest; half the kids he went to high school with werewolves. Beacon Hills has the highest concentration in the state; it's what he grew up with. They're just people with some, uh, extra talents.</p>\n<p>\"You ready?\" Scott asks, turning down Pine Street. There are a lot of werewolf families in this neighborhood; there's a private elementary school for werewolves down the block.</p>\n<p>\"Yeah, dude,\" Stiles says. \"You can drop me here. We'll do this block and then go down Quincy Ave, you think?\"</p>\n<p>\"Sounds like a plan,\" Scott agrees. \"Scream if you need me.\"</p>\n<p>\"Harr harr,\" Stiles says and slams the door when he gets out. He walks up the drive to the first house on the block, a split-level ranch painted in soft tones of yellow and white, and knocks on the door. It's opened after a moment by an older woman, who narrows her eyes at his deputy uniform.</p>\n<p>\"How are you doing, ma'am?\" Stiles asks politely. \"I'm Deputy Stilinski from the Sheriff's Department. Do you have a moment?\"</p>\n<p>The woman's eyes flick to Scott sitting in the cruiser and her eyes narrow further, but she nods.</p>\n<p>\"We've had some reports of an arsonist in the neighborhood,\" Stiles tells her. \"Trash cans lit on fire, mailboxes and so on. Have you noticed anything going on lately? Anyone suspicious? Unfamiliar?\"</p>\n<p>The woman shakes her head, eyes flashing gold in the sunlight. \"Haven't seen anyone around,\" she tells him. \"There's always kids hanging around in the park after dark, though.\"</p>\n<p>\"That's helpful,\" Stiles says, pulling out his notebook. \"Which park?\"</p>\n<p>-</p>\n<p>Stiles goes to forty houses, talks to forty people. He gets slobbered on by dogs, doors slammed in his face, holds one baby while the mom puts clothes in the washing machine. He drinks three glasses of water, has four cups of coffee, eats a donut, cookies, and a brownie because he doesn't like saying no to people. He and Scott stop at a 7-11 for lunch and he pees for two minutes straight. People complain to him about kids driving too fast on the road, dogs barking at night, people running stop signs, people jaywalking. One lady tells him about how her neighbor lounges on the back deck naked and Stiles takes a surreptitious look out her back window; the fence is ten feet high, so unless this lady is pressing her face up against empty knotholes in the wood, there's no way she's just casually spotted the dude. No one offers any help at about a potential arsonist.</p>\n<p>After lunch, they turn down Spring Street. It's quiet out there, the further from the center of town they get. The houses are getting bigger and further apart, big front lawns with shady trees. Stiles wishes he could afford a house out here but there's no way in hell that's happening, not on a deputy's salary.</p>\n<p>\"Any chance you want to take over?\" Stiles asks hopefully.</p>\n<p>Scott shakes his head. \"It's hard for werewolves to trust others. We're better off if we stick with you.\"</p>\n<p>\"Because I don't smell like a threat?\" Stiles inquires sourly.</p>\n<p>\"Well,\" Scott says, elbowing him in the side. \"At least you've got a gun.\"</p>\n<p>There's a lot of screaming going on inside the first house Stiles visits. He isn't really worried, because it sounds like kids, but then the door opens and <em>hi</em>, says his dick, because the dude in front of him is <em>gorgeous</em>, built like a god with a face like thunder. Stiles wants to <em>lick</em> that solid jaw line. <em>Hold the fuck on,</em> says his cop brain, because the dude's wearing a white tank with what look like scorch marks and he's got kids hanging all over him; one's on his back, skinny legs looped around his waist, and another two hanging off one arm, toes barely brushing the ground. There's a tubby toddler clinging to his leg like a koala, and he's got a baby tucked into the crook of the one arm that <em>doesn’t</em> have kids hanging off it. Stiles' mouth drops open.</p>\n<p>\"How many of those kids did you <em>kidnap?\"</em> he asks before he can wrangle his brain into submission.</p>\n<p>The man gives him a look that says <em>what the fuck is wrong with you</em> and snaps, \"You think I'd subject myself to this on purpose?\"</p>\n<p>\"Oooh,\" says one of the kids hanging off his arm. \"I'm telling Mom.\"</p>\n<p>\"You go right ahead,\" the man tells the kid. His eyes - and god, they are <em>gorgeous</em> - snap back to Stiles. \"Can I help you?\"</p>\n<p>\"Uh,\" Stiles says, thrown the intensity of his gaze. \"I - I'm Deputy Stilinski. With the Sheriff's Department.\"</p>\n<p>\"I can see that,\" the man says, rolling his eyes so hard his retinas look like they might detach. \"You've got a name tag.\"</p>\n<p>\"I - right.\" Stiles is flushing; he can fucking <em>feel</em> it. He's a cop, dammit. People don't get to make him blush. \"We're trying to track down an arsonist. Do you have a moment to talk?\"</p>\n<p>The man's expression flattens at the word <em>arsonist</em> but he nods and steps back, an invitation to come inside. Stiles glances over his shoulder at Scott, who's playing around on his phone. Draw Something, probably. Isaac's been kicking his ass and Scott is weirdly competitive. He waves at Stiles without looking up: <em>all clear.</em> Stiles rolls his eyes and steps inside, shutting the door behind him.</p>\n<p>\"Just give me a moment to deal with these ankle biters,\" the man tells him, and turns down a hallway with all his passengers protesting loudly at the nickname. Stiles watches him pass through a sunny room that's probably the kitchen. He opens a back door and all the kids drop off him, racing outside with shouts of glee. The man bellows after them, \"No snack until you've all shifted back! Sammy, I mean it!\"</p>\n<p>\"Isn't 'ankle biters' a little, uh, offensive?\" Stiles asks, when the man comes back down the hall. He's just holding the baby now; it's peacefully asleep, thumb tucked in its mouth.</p>\n<p>\"It's okay when I say it,\" the man replies, crooking a finger at Stiles and leading him into a living room cluttered with kids toys.</p>\n<p>Stiles gapes at his back. \"Is that a <em>joke?\"</em></p>\n<p>\"I don't joke,\" the man says flatly. \"You want to tell me what's going on, or do I need to call the cops?\" He drops onto the couch.</p>\n<p>\"I am the cops!\" Stiles winces; he's sounds like he's five. The man squints at him.</p>\n<p>\"Thought that was a costume.\" He sounds smug.</p>\n<p>\"If you've got a lot of dudes in fake cop uniforms coming to your door, I probably shouldn't know about it,\" Stiles retorts. The man's lips part and his cheeks go pink. Stiles bites back a triumphant grin; chalk one up to him. \"Anyway,\" Stiles says, pulling out his notebook, \"we've been getting reports of someone in the neighborhood setting fires. Anything you can tell me about it?\"</p>\n<p>\"Not unless my ex got released from jail,\" the man says. Stiles looks up from his notebook, wondering if he's joking, but his stony face is serious.</p>\n<p>\"Oh,\" Stiles says. \"Their name?\"</p>\n<p>\"Katherine Argent,\" the man tells him, and Stiles writes it down dutifully. The name sounds vaguely familiar, but he's having trouble placing it.</p>\n<p>\"Anything else?\"</p>\n<p>The man shrugs. It's an impressive gesture and Stiles is definitely not staring.</p>\n<p>\"Uh,\" Stiles says dazedly (because fuck it; he <em>is</em> staring). \"Well. Thanks. For your help. I'm gonna give you my card, in case you hear anything else.\" He drops it on the table and desperately thinks <em>call me</em>.</p>\n<p>\"Sure,\" the man says dismissively. He doesn't get up from the couch. Stiles lets himself out. He can hear the kids in the backyard, screaming with laughter.</p>\n<p>He canvasses twenty more houses before giving up for the day and riding back to the station with Scott so they can go over their notes.</p>\n<p>\"Sounds like it's probably going to be those kids who hang out in the park,\" Scott says. \"Like ten people mentioned them.\"</p>\n<p>\"Yeah,\" Stiles says absently, flipping through his notes. He spots the name he wrote down at the hot guy's house. <em>Katherine Argent.</em> He taps it. \"Dude, is this lady's name familiar to you?\"</p>\n<p>Scott leans over and goes kind of pale. \"Stiles,\" he says quietly. \"She burned down the Hale house.\"</p>\n<p>\"The Hale house?\" Stiles repeats, his mouth falling open. He didn't know all that much about the case, as he'd been across the country at Northeastern, just about to graduate around the time it happened, but he knew that eight people had been killed, and his dad had worked overtime for weeks. \"Oh, shit, that was Derek Hale that I talked to?\"</p>\n<p>Scott's eyes widened. \"Wait, he was in one of the houses you canvassed?\"</p>\n<p>\"Yeah, out on Spring Street.\"</p>\n<p>\"Well, it wasn't her,\" Scott says. \"She's serving life, dude. No parole.\"</p>\n<p>Stiles sucks on his teeth. \"Shit, that's awful. He was so casual about it.\"</p>\n<p>\"That's kind of just the way he is,\" Scott says, getting to his feet. \"He doesn't show a lot of emotion.\"</p>\n<p>Stiles is just about to ask Scott if he knows Derek - <em>how</em> he knows Derek - when his dad appears at their desks and asks, \"How's the investigation going?\" which is how they end up sitting in the cruiser at the edge of the park later that night, watching for their young suspects. Scott's eating a hamburger but Stiles skipped dinner; he's still feeling overfull from the several pounds of baked goods he consumed that day.</p>\n<p>\"Man, who even lights mailboxes on fire?\" Stiles complains, tapping his fingers on the arm rest. \"That's so fucking dumb.\"</p>\n<p>\"I dunno, kids?\" Scott replies. \"Didn't you ever light things on fire?\"</p>\n<p>\"No,\" Stiles says scornfully, then thinks about it. \"There was one year where I went around smashing people's pumpkins on Halloween. It's not really the same thing though, is it? I mean, I wasn't putting lives at risk.\"</p>\n<p>Scott shrugs. \"They're not thinking, obviously.\"</p>\n<p>Stiles makes an irritated noise, followed by an indignant one when Scott jabs him in the side. \"Hey, look who it is.\" He points and Stiles follows his finger to see a man jogging along the edge of the park, disappearing and reappearing in the pools of light cast by the streetlights. It's Derek Hale, the hot dude from earlier. Stiles is almost angry at how distressingly good-looking he is in running gear. It just isn't <em>fair</em>.</p>\n<p>\"How <em>do</em> you know him, anyway?\" Stiles asks Scott, because he forgot to ask at the station.</p>\n<p>\"Allison,\" Scott replies, smiling at his wife's name. \"She - well.\" His smile fades a little. \"She's Kate Argent's niece, so she knew Derek before - before all that happened, and she stayed in touch after, because they always got along. We've had him over for dinner a few times. He's not really social, but.\" Scott shrugs. \"He's an okay guy, I guess. My daughter likes him.\"</p>\n<p>\"He's a were, though, right?\" Stiles asks, watching Derek pause in the shadow of a tree, thinking about the way all those kids had clung to him. He could probably lift Stiles easily. Stiles licked his lips and tried not think about all the sex positions that were possible with that kind of strength.</p>\n<p>\"Yeah,\" Scott nods. \"Beta. Oh, hey, look - \" He points again and Stiles looks across the park to see a small group of teenagers slinking across the grass, mostly keeping to the shadows. \"There are our hooligans.\"</p>\n<p>\"Yeah, but are they are arsonists?\" Stiles asks, squinting. \"Your night vision's a thousand times better than mine, dude. Are they carrying anything?\"</p>\n<p>\"Doesn't look like it,\" Scott replies, frowning, \"but they could just be using lighter fluid or alcohol as a starter. That'd fit in a pocket.\"</p>\n<p>\"True,\" Stiles agrees. His eyes slide back over to Derek, who hasn't moved from under the tree. \"Dude, Derek's watching them too.\"</p>\n<p>\"They must not be weres,\" Scott says. \"They should have noticed us or him by now.\"</p>\n<p>\"Or they're just stupid.\"</p>\n<p>\"Or they're just stupid,\" Scott agrees, and they fall into silence, watching the kids head for the center of the park, congregating around a bench. \"Dude, are they going after a bench?\"</p>\n<p>\"The thrill of small-town life,\" Stiles sighs, adjusting his belt. He sees flame flicker in one of the kids' hands. \"You - oh, fuck!\"</p>\n<p>\"What?\" Scott exclaims, swinging his head around.</p>\n<p>\"Dude, lights on - Derek's going after them - go, go, go!\" And it's true; Derek's taken off across the park, headed right for the kids, who haven't noticed anything. Scott swears and twists the ignition, hitting the lights at the same time. They take off across the park, cutting over the grass and over curbs, swerving around trees. By the time they get to the center of the park, the bench is in flames and Derek's caught three kids by their collars. He's glaring after a fourth who managed to escape his grasp and disappear under the jungle gym.</p>\n<p>\"I'm on that one,\" Scott says, barely getting the cruiser into park before he's out of the car and fading into the night. Stiles sighs.</p>\n<p>\"Thanks,\" he mutters. \"Let me take care of the mad werewolf.\" He gets out of the car and approaches slowly, raising his hands peacefully as Derek turns to glare at him, his eyes glowing blue. \"Hey. Mr. Hale, right? Would you mind letting those kids go?\"</p>\n<p>\"Fire is not a game,\" Derek snarls. Stiles winces; now that he knows that this is Derek Hale, he totally gets why he'd be mad about arson, but -</p>\n<p>\"It's not,\" Stiles agrees, \"but these guys are like thirteen - \"</p>\n<p>\"I'm fourteen!\" one of the kids protests. The others shush him.</p>\n<p>\" - and you're a full-grown werewolf and they're human and there are <em>laws - \"</em></p>\n<p>\"I know that!\" Derek snaps. \"If these idiots were werewolves, I would have beat them to a pulp.\"</p>\n<p>\"Just let them go,\" Stiles says soothingly. \"I'm gonna pretend that I didn't hear that.\"</p>\n<p>Derek curls his lip, but releases the kids. Stiles nods his thanks and says to the teens, \"Sit on the ground and put your hands on your heads for me. We're going to wait until my partner gets back.\"</p>\n<p>The kids do as they're told; they mostly look relieved to be away from Derek, who folds his arms over his chest and glares at them. Stiles puts his hands on his belt and watches them. He wants to say something to Derek but the only thing that comes to mind is <em>want to have dinner sometime?</em> and it's not really appropriate for the situation, he thinks. Scott comes back a couple minutes later, trotting across the dark grass with the last teenager jogging along in front of him, hands cuffed behind his back.</p>\n<p>\"Hey, Derek,\" Scott says cheerfully, pushing the kid down onto the grass next to his friends. \"Thanks for your help, but I think we've got it from here.\"</p>\n<p>Derek shifts. He doesn't look pleased, but he nods, rolling his shoulders before jogging off into the night. Stiles watches him go regretfully. At least he gets a nice view of Derek's ass before it disappears into the darkness.</p>\n<p>-</p>\n<p>It's a long night, but things quiet down in the days following. There are other small cases across the county, nothing exciting; old lady misplaces her jewelry and thinks someone stole it, dude gets too drunk and falls down some stairs, kid gets lost in the woods, kid gets found. Stiles, however, <em>cannot</em> stop thinking about Derek Hale. He lies in bed at night and puts a hand down his pants and shamelessly thinks about Derek's broad chest and his tight ass and his stupid ears and stupid rabbit teeth and his gorgeous eyes until he comes on his stomach with a tense groan. It's not fair, he thinks dazedly, his legs tingling. Derek's probably married. He's got like a billion kids and one of them's a baby - he's gotta have someone popping those out for him. Stiles groans into his pillow. He is so fucking gone.</p>\n<p>During his lunch break, he looks around guiltily and slinks into the records room, where he flips through Kate Argent's court transcripts. It's worse than he knew - three of the eight dead were children, and half the group was human, all members of the extended Hale family. His heart hurts just reading the tearful testimonies. Derek's parents - the alpha, Talia, and her human mate - were both killed in the blaze, as well as two of his kid siblings, both humans, and an aunt and uncle and their kids. Stiles thinks about how much losing his mom hurt and then tries to imagine that pain times eight. He can't even fathom that much loss. Worse is how fucking nonchalant Kate is through the whole thing - she pleads guilty with a grin on her face, openly admits burning down the house with everyone inside. She says she thinks werewolves are monsters, sub-human, insinuates she's done it before to other families. He has to put the file back in its box and sit outside in the sun for a while because he might puke otherwise.</p>\n<p>The last place Stiles expects to see Derek is at the grocery store, which is stupid, because everyone needs food. He doesn't know why it's so surprising when he rounds the corner of the chip aisle and there's Derek standing in front of the yogurt. Maybe because it's so <em>normal</em>, he thinks. The last time he saw Derek, he was fuming about some teenage arsonists. Now he's just standing under the blue-green light of the yogurt display and he looks tired. One of the little kids from the house is standing next to Derek - a little girl, dark-haired just like him. He's got his hand on the back of her head, face turned slightly to watch her as she talks, gesturing at the yogurt with her little hands. Stiles can hear her faintly, announcing all the flavors she's tried. It makes Stiles' heart ache a little.</p>\n<p>He's twenty-six, and as much as he tries to tell himself he's way too young to settle down, somewhere in the back of his mind he'd always thought that he'd be married by now, with a nice house and kids, maybe. Instead he's got a cramped one-bedroom apartment and an ungrateful cat named Oscar. It's so easy to imagine himself in that life, though; waking up to the same face every morning, sneaking kisses while they watch movies with the kids. Hell, even arguing over stupid shit sounds amazing. Stiles groans quietly to himself, listening to Derek and his kid have a dispute over yogurt.</p>\n<p>\" - not getting the one with the candy, Sammy,\" Derek's saying. \"You can get the one with the granola.\"</p>\n<p>\"But Daaaaaad,\" the little girl wheedles, using his arm to swing herself around in circles, \"everyone at school - \"</p>\n<p>\"Nope,\" Derek says simply. \"Granola. Grab five for me.\"</p>\n<p>The little girl sighs but does as she's told, leaning on her tiptoes to reach the correct selection. Stiles should move, he realizes. He could step up next to them, pretend to be totally engrossed in the myriad flavors, and then totally, completely nonchalantly notice them. Yeah, he thinks, and takes a couple steps forward. He didn't time it right, though; they're already done with the yogurt and turning his way. Derek pauses when he sees Stiles, his hand coming up to catch his daughter by the back of her shirt. She skids to a halt and frowns up at Stiles, looking unnervingly like her father.</p>\n<p>\"Deputy,\" Derek says politely. He appears to think for a moment and adds, \"Stilinski.\"</p>\n<p>\"Stiles, please,\" Stiles tells him hopefully. At least Derek remembered his name. \"I'm off duty, Mr. Hale.\"</p>\n<p>Derek watches his face for a long moment and Stiles tries not to shrink under his inscrutable expression. His eyes are beautiful and like, way too intense; Stiles feels like they're boring right into his soul and Derek's going to be able to suss out exactly how Stiles feels about him, if he's not reeking of it already. Scott says werewolves can't really smell emotion, but arousal isn't really an emotion, more of a physical state, and Stiles can feel his palms getting sweaty. \"Call me Derek,\" Derek says finally, and Stiles relaxes like he's passed some test.</p>\n<p>\"Thanks for your help the other night,\" Stiles tells Derek. Derek nods, a quick jerk of his head. Stiles shifts his weight nervously. He's quickly realizing he doesn't actually have anything to talk to Derek about, but he doesn't want to just walk away. \"Uh,\" he says, nodding at Derek's daughter. \"Where's the rest of your gang?\"</p>\n<p>Derek frowns faintly before his expression clears. \"Those were my sister's kids,\" he says. \"I've just got the one.\" He nudges his daughter. \"This is Samantha. Be polite, or he'll arrest you.\"</p>\n<p>Samantha looks Stiles up and down, clearly sizing him up. \"He's not scary.\" Derek snorts like he agrees. Stiles narrows his eyes at him and receives the eyebrow raise of the century in return.</p>\n<p>\"Thanks,\" Stiles tells Samantha. \"I wish I could say that this was the first time someone's told me that.\"</p>\n<p>Derek snorts again - Stiles wants to tell him it's not cute but it is, kind of - and says, \"Sounds like you need to work on your image…Stiles.\" Stiles tries not to pretend like that doesn't send a thrill up his spine, the sound of his name rolling off Derek's lips. The ghost of a smile rises on Derek's face and Stiles would swear, <em>swear</em> Derek knows what he's doing to him. Derek says, very mildly, \"We've got to get going.\"</p>\n<p>\"Oh, yeah,\" Stiles says, hurriedly stepping aside. \"Uh. Nice to see you, Derek, Samantha.\"</p>\n<p>Derek nods, pushing his daughter along in front of him. She glances over her shoulder at Stiles and sticks her tongue out at him. Stiles resists the urge to return the gesture and is glad he does, because a moment later Derek looks back at him as well and Stiles <em>swears</em> he smiles before he turns back around. Stiles bites back a grin before he turns down the pet food aisle; Oscar's out of food and he gets <em>cranky</em> when he's hungry.</p>\n<p>-</p>\n<p>Stiles doesn't see Derek again for two weeks. He's getting antsy, trying to think of a way to get Scott and Allison to host some sort of dinner and make Derek come without sounding like he's obsessed. He isn't. (Probably.)</p>\n<p>It's an accident. Like, a complete and honest accident that Stiles has nothing to do with. The call comes over the radio and Scott and Stiles are the nearest unit out on patrol. Neither of them recognize the address; it's far out on the edge of town, a huge house with a bunch of cars parked in front. Scott stiffens as he climbs out of the car and mutters, at Stiles' raised eyebrow, \"Alpha.\"</p>\n<p>Stiles frowns up at the house as they walk up the drive. \"Looks like they're having a party.\" There are only four alphas in Beacon Hills and he's completely blanking on who lives where. Scott knocks on the front door and it's swung open by a dark-haired woman with an exasperated look on her face. To Stiles' surprise, she's got Derek's daughter in her arms. Before Stiles' heart can even start sinking, because this <em>has</em> to be Derek's wife or girlfriend or baby mama or whatever, Scott straightens and says, \"Alpha Hale!\"</p>\n<p>Stiles blinks. Alpha Hale. That would make this Laura Hale, Derek's sister. <em>Those were my sister’s kids.</em> Oh. He relaxes minutely, then remembers they're here on a call. \"Hi, ma'am,\" he says. \"We got a call about an intruder.\"</p>\n<p>\"Mm,\" Laura says, looking him up and down. Stiles is disconcerted to find Samantha eyeing him in the exact same fashion. \"Yeah,\" she says finally. \"You better come in before there's a bloodbath. No need to call for backup,\" she adds, turning to show them into the house. \"Not as long as you get this old creep out of my brother's sight in the next five minutes.\"</p>\n<p>\"Huh?\"</p>\n<p>\"Old creep,\" Laura repeats loudly, like she thinks Stiles is deaf. \"Breaking into my house.\" She clicks her tongue loudly, as if to say <em>the nerve of people, really.</em></p>\n<p>They come into a large room that, judging by the couches and the huge television, is probably a family room, to a strange tableau. Stiles is surprised to see Isaac standing at one end of the room with an old man in what looks like a very gentle headlock. In the middle of the room, four kids sit on the couch. One of them's holding a baby; Stiles thinks they're the kids that were at Derek's house the other week, which makes them Laura's. They don't seem at all perturbed by what's going on around them; the chubby toddler in the middle's brushing a doll's hair.</p>\n<p>Across the room, a huge dude, a dark-haired girl, and a blonde chick have their arms wrapped around Derek, whose eyes are glowing blue. He's fighting against them, snarling soundlessly. Laura rolls her eyes and points to the old man.</p>\n<p>\"That dude,\" she says, \"is the one who broke in and I want him <em>gone.\"</em></p>\n<p>\"I have every right to see my granddaughter,\" the man says, his voice muffled by Isaac's arm.</p>\n<p>\"You're wrong,\" Laura says simply. She sounds bored, like she's had this conversation a million times. \"Derek's got full custody and you've got no rights, actually. This is a great example you're setting for her, actually. Real responsible.\"</p>\n<p>\"All right, all right,\" Stiles says. \"Officer McCall, you want to do the manhandling? I'll take statements. You want to press charges?\" he asks Laura.</p>\n<p>\"Sure do,\" she says sweetly, and the old man sputters something, sounding outraged. Scott takes over for Isaac, beaming. Laura watches Scott tug him out of the room before she sets down Samantha, who immediately goes trotting over to her father. Stiles watches Derek bend and scoop her up before turning to Laura, pulling out his notepad.</p>\n<p>\"So what was all this about?\"</p>\n<p>\"That loon,\" Laura says, rolling her eyes - and it must be a Hale thing; Stiles doesn't think he's ever seen anyone roll their eyes that hard before - \"is Sammy's grandfather, Gerard Argent. We were just trying to celebrate her birthday when apparently it struck him as a great idea to come busting into a house full of werewolves to try and see her.\" She purses her lips, glancing over at Derek. He glowers back, his arms tight around Samantha.</p>\n<p>\"All right,\" Stiles says evenly, but his pulse is pounding in his head because if that man was an Argent and he's Samantha's grandfather, that means that Kate Argent is her mother and that - He sucks in air between his teeth. That really sucks. \"Has this happened before?\"</p>\n<p>\"Not here.\" Laura bites her lip and calls, \"Der? Can you come over here for a sec?\"</p>\n<p>Stiles forces himself to remain casual, greeting Derek with a nod. \"Hi,\" he says. \"You all right?\"</p>\n<p>\"Fine,\" Derek says shortly.</p>\n<p>\"Derek,\" Laura says, and there's warning in her voice. \"Deputy Stilinski wants to know about Gerard.\"</p>\n<p>Derek's lip curls, but he inclines his head.</p>\n<p>\"Has this happened before?\" Stiles asks again. He looks at Samantha. She wrinkles her nose at him and tucks her head under Derek's chin.</p>\n<p>\"I've seen him on the street,\" Derek says slowly, in a voice wrapped in anger. \"Not often. But enough.\"</p>\n<p>\"You've seen him in town?\" Stiles asks, frowning.</p>\n<p>\"No,\" Derek snaps. \"Outside my house.\"</p>\n<p>\"Oh,\" Stiles says, making a note. \"If it's happened more than once, we can probably stick him with stalking charges.\"</p>\n<p>\"Will he go to jail?\" Derek asks, frowning.</p>\n<p>\"Depends on the judge,\" Stiles replies. \"Do you want him to?\"</p>\n<p>\"I - \" Derek shuts his mouth and bends, setting Samantha down on the floor. He gives her a gentle push in the direction of the children on the couch and she takes the cue, dancing over to the couch. Derek straightens and jams his hands in his pockets. \"He scares her,\" he spits furiously. \"He <em>hates</em> our kind. To him, she's just a thing that should be <em>his.\"</em> Laura reaches out and puts a hand on Derek's shoulder. He casts her a dark look, but doesn't move away. Stiles feels uncomfortable, like he's intruding. He's seen a lot of bad things since joining the force, but these tense moments with family members never get easier.</p>\n<p>\"Okay,\" Stiles says gently. \"We'll take him in, build a case. I'm guessing he's probably got the funds to get out on bail, so what you can do in the meantime is get a restraining order against him. If he violates it, we can arrest him again and, depending on the terms, he could go to jail immediately. Does that work for you?\"</p>\n<p>\"Yes,\" Derek says heavily. Stiles watches the way his eyes slide over to the couch, where Samantha has joined Laura's children.</p>\n<p>\"Okay,\" Stiles says again, his heart aching a little. \"You can file that at the courthouse. I'd do it on Monday, first thing. We've got Argent, so I'll get out of your hair. Sorry your party got interrupted.\"</p>\n<p>Derek meets his eyes for the first time since Stiles entered the room. He doesn't say anything, but there's gratitude there. Laura bumps her shoulder against her brother's and says, \"You want some cake for the road, Deputy Stilinski? It's red velvet.\"</p>\n<p>\"Sorry,\" Stiles says somberly, \"I'm allergic to chocolate.\"</p>\n<p>Laura grins, catching the lie, and Stiles decides he likes her; she seems like the type of person who doesn’t puts up with anyone's shit, just like his dad. He ends up walking out to the patrol car with a tupperware container full of cake. Scott's waiting in the front, Gerard glowering in the back. They bring him back to the station.</p>\n<p>\"Hey,\" Stiles says, as they head to their desks, Gerard safely locked up in a holding cell. \"Are you related to him?\"</p>\n<p>Scott rolls his eyes. \"Never met him,\" he says. \"Allison and her dad don't have anything to do with that side of the family any more. Even before Kate - well. Allison told me she hasn't seen her grandfather since she was like ten.\"</p>\n<p>\"Huh,\" Stiles says, settling down in his chair, then brightens as he remembers. \"Oh, hey - want some cake?\"</p>\n<p>They share the cake as they fill out paperwork. It's really good.</p>\n<p>-</p>\n<p>He sees Laura before he sees Derek again. It's a week after the call to the Hale house. Gerard's out on bail, but Stiles checks the system and sees that Derek has indeed filed a restraining order against him. It makes him feel a little better.</p>\n<p>Stiles is coming out of the dentist, his teeth aching. They always get after him for not flossing enough, even though he does, twice a day. He wonders if werewolves need to go to the dentist. If they lose a tooth, does it grow back? Do elderly werewolves need dentures? He has a hard time imagining it. Would they need a special set with fangs for when they shift?</p>\n<p>He's halfway across the parking lot when he sees Laura Hale coming out of one of the other shops in the plaza, a massage therapy place he knows Allison goes to sometimes. She spots him as he spots her, and a frown clouds her brow, momentarily making her look like Derek's female doppelganger, before her expression clears.</p>\n<p>\"Deputy Stilinski, right?\" she asks. \"Didn't recognize you without your uniform.\"</p>\n<p>\"Day off,\" Stiles shrugs. He's wearing skinny jeans and an old Beacon Hills High sweatshirt, which makes him look about seventeen, but it's comfortable. \"How are things going?\"</p>\n<p>\"Better than they were,\" Laura says warmly. \"Did you enjoy the cake?\"</p>\n<p>\"Oh, yeah!\" Stiles grins. \"I've got your tupperware in the car, actually. I've been meaning to drop it off. It was really good; thank you.\"</p>\n<p>Laura follows him over to the jeep and leans against the metal as he bends into the back, searching for her container. \"Are you new to the force?\"</p>\n<p>\"I've been here three years,\" Stiles replies, straightening. He hands the plastic to Laura. \"I grew up here, though. My dad's the sheriff.\"</p>\n<p>\"I guessed as much,\" Laura smiles. \"Stilinski isn't a very common name.\"</p>\n<p>\"No,\" Stiles agrees. He puts his hands in his pockets and shifts, a little uncomfortable. He doesn't actually know Laura, after all, even if he's got a major crush on her brother.</p>\n<p>Like she's reading his mind, Laura says, \"I couldn't help but notice the way you watched my brother the other night, Deputy.\"</p>\n<p>\"Oh?\" Stiles asks, trying for casual. \"And how's that?\"</p>\n<p>Laura smiles slow, showing her teeth. It's not an entirely friendly look. \"Like you're interested in him.\"</p>\n<p>\"I - \" Stiles swallows, knowing she'll hear any lie. \"Might be.\"</p>\n<p>Laura doesn't move. \"All right,\" she says, but Stiles knows better than to relax. \"He deserves to be happy and you seem nice enough. I'm going to warn you, though - you hurt my brother and I'll make your life <em>hell.\"</em></p>\n<p>\"Are you - did you just threaten an police officer?\" Stiles splutters.</p>\n<p>\"Sure did,\" Laura says sweetly. \"He's pack <em>and</em> my brother. That's an over-protective double-whammy.\" She taps her fingers against the Tupperware. \"Good luck wooing him, Deputy.\"</p>\n<p>\"W-wait,\" Stiles says weakly as she turns to leave. Laura pauses, casting him an arched eyebrow over her shoulder. Stiles sighs. \"Do you have any tips?\"</p>\n<p>Laura grins and says, \"You're a cop. Follow the clues.\"</p>\n<p>-</p>\n<p>The jeep breaks down in the parking lot of the gas station. Stiles goes in to get his customary post-Friday shift curly fries and six pack, and when he comes back out, the stupid thing won't start. Stiles groans quietly. It's already nine o'clock in the evening, which means all the garages are closed, and he's had the shittiest day; he'd had to arrest a fucking pregnant sixteen-year-old girl for stealing prenatal vitamins. She'd cried the whole way to the station and Stiles had felt like crying along with her. Not the best way to end the week. All he wants to do now is go home and drink and watch <em>Dexter</em>.</p>\n<p>Stiles heaves a huge sigh and gets out of the car. He's halfway inside of it, leaning over into the hood, but he's not much of a mechanic. He can change the oil without getting it all over himself, but that's about the limits of his skill, and he really can't tell what's going on here.</p>\n<p>\"Everything okay?\"</p>\n<p>Stiles jerks his head up so fast he slams it against the hood. He falls back against the side of the car, clutching at his head. \"Ah, fuck!\"</p>\n<p>When his eyes stop watering, he can finally focus on his interrupter. He's horrified to see it's Derek, standing there with his hands in his pockets and an expression on his face like he's trying not to laugh. \"Sorry,\" he says to Stiles.</p>\n<p>\"No, no,\" Stiles says quickly. \"I was hoping to get bruised today; it's okay.\"</p>\n<p>Derek screws up his face and repeats his earlier question: \"Everything okay?\"</p>\n<p>\"Yeah,\" Stiles sighs. \"I just - my jeep's acting up. Won't start.\"</p>\n<p>\"Want me to take a look?\" Stiles raises his eyebrows and Derek explains, \"I work part-time as a mechanic.\"</p>\n<p>\"I - oh. Thanks. If it's no problem.\"</p>\n<p>Derek shrugs his broad shoulders and Stiles steps aside so he can lean in. He watches Derek root around and licks his lips nervously. He isn't mentally prepared for this encounter, not after the day he's had. The silence is getting to him, though, like it always does, so he asks, \"How's your daughter doing?\"</p>\n<p>\"Fine,\" Derek replies, his voice muffled.</p>\n<p>\"Argent been hanging around?\"</p>\n<p>\"No,\" Derek says, straightening to frown at Stiles. \"I'll rip his face off if he does.\"</p>\n<p>\"You really shouldn't say things like that to a police officer,\" Stiles admonishes gently.</p>\n<p>Derek quirks an eyebrow at him. \"Aren't you off-duty?\"</p>\n<p>\"Yeah,\" Stiles agrees, \"which is why I'll tell you I have no sympathy for people that fuck with kids. You have to be careful when you're building a case against someone, though. The defendant's lawyers will look for <em>anything</em> to make you look like a bad person. You want everyone on <em>your</em> side.\"</p>\n<p>Derek regards him for a long second, his face neutral. \"Are you on my side?\"</p>\n<p>Stiles blinks, his cheeks warming. \"I - yeah. I told you. I don't like people who fuck with kids.\"</p>\n<p>Derek watches him a moment longer before nodding and waving his hand toward the Jeep. \"Your radiator's cracked, I think. You'll have to have it towed and get it repaired.\"</p>\n<p>Stiles sighs again. \"Figures.\"</p>\n<p>\"I can put in a call and have it towed to my garage,\" Derek offers. \"I've got time in the morning to take a better look.\"</p>\n<p>\"I - you don't have to do that,\" Stiles says, flustered. \"I can take it to the station garage.\" He doesn't really want to, though; the station mechanic, Greenberg, has no idea what he's doing, and Stiles' Jeep is <em>precious</em> to him.</p>\n<p>Derek shrugs again. \"It's not a problem.\"</p>\n<p>\"Well...thanks.\"</p>\n<p>Derek nods, and Stiles stands there awkwardly while Derek pulls out his phone and calls a towing company. He seems familiar with whoever answers, which makes sense considering his line of work. Stiles sticks his hands in his pockets, wishing he'd changed out of his uniform back at the station. Derek hangs up the phone and says, \"They're sending someone out. Should be about ten minutes.\"</p>\n<p>\"You really didn't have to do that, but thanks,\" Stiles tells him. \"I can probably handle it from here.\"</p>\n<p>Derek leans against the side of the car next to him. \"I can give you a ride home.\"</p>\n<p>\"You don't - \"</p>\n<p>\"I know,\" Derek says, cutting through him. He looks at Stiles, his eyes serene. \"Call it a thank you for dealing with our shit the other week.\"</p>\n<p>\"That's my job,\" Stiles says uncomfortably.</p>\n<p>\"So's this,\" Derek responds, nodding toward the car.</p>\n<p>They fall into silence, watching the cars at the pumps come and go.</p>\n<p>\"Um,\" Stiles says after a while, \"can I ask you about Samantha?\"</p>\n<p>\"Depends.\"</p>\n<p>\"Okay,\" Stiles says slowly. \"Her mother - \"</p>\n<p>\"Kate Argent,\" Derek says shortly. \"Gave up all parental rights when she found out Sam was a werewolf. She's in jail. You knew that,\" he adds. He doesn't sound angry. Maybe tired. He's probably had this conversation hundreds of times and Stiles feels guilty. It's like when people used to ask where his mother was. He should have thought about it.</p>\n<p>\"Yeah,\" he says quietly. \"Cop. Sorry. I put it together when your sister said Gerard Argent was her grandfather. Does Samantha know?\"</p>\n<p>Derek shakes his head. \"I told her Kate's in jail. If she ever wants to go visit her, that's her choice, but I won't be taking her there.\"</p>\n<p>\"Oh,\" Stiles says.</p>\n<p>They fall back into silence. The tow truck rolls in a few minutes later and Stiles signs a receipt, then grabs his beer and curly fries and follows Derek to his car, a sleek black Camaro. The car seat in the back is at odds with the rest of the car's image. Stiles has to stop himself from snorting.</p>\n<p>The ride to his apartment is quiet except for Stiles directing Derek down the right streets. It's not entirely uncomfortable, but Stiles tries not to talk. He always ends up putting his foot in his mouth in situations like these, and he really doesn't want to fuck things up with Derek so, probably wisely, remains quiet.</p>\n<p>As they pull up in front of Stiles' apartment building, Derek says, \"I'll take a look at your car in the morning and give you a call later, all right?\"</p>\n<p>Stiles narrows his eyes at Derek, warning, \"I'm trusting you to not fleece me. I'll remind you right now that I'm a cop.\"</p>\n<p>Derek snorts. \"I'll keep that in mind.\"</p>\n<p>\"You need my number?\"</p>\n<p>\"I've got your card,\" Derek reminds him.</p>\n<p>\"That's my desk number,\" Stiles tells him. \"Can I give you my cell?\"</p>\n<p>\"I'll report you if you start harassing me via text,\" Derek says stoically.</p>\n<p>Stiles claps a hand over his heart, wounded. \"I would never!\" It's not like he's got an ulterior motive for getting Derek's number. Ha. Ha. Ha. Derek raises an eyebrow at him, but graces him with his number when Stiles gets his phone out. He shoots Derek a text that says <em>hey</em> and hears Derek's phone buzz somewhere in the car when it arrives.</p>\n<p>\"Well,\" Stiles says, suddenly awkward. \"Thanks again for everything.\"</p>\n<p>Derek inclines his head. \"Not a problem.\"</p>\n<p>\"You - \" Stiles breathes in. \"You want to come up? I've got beer.\" He lifts the six-pack hopefully, belatedly remembering that werewolves can't get drunk off regular alcohol.</p>\n<p>Derek watches him for a moment , his expression unreadable, before shaking his head. \"Sorry,\" he says. \"I have to go pick Sam up from Laura's.\"</p>\n<p>\"Oh, yeah, right,\" Stiles says, even as his heart sinks. He wishes he was a werewolf; what would Derek be smelling like right now? Regret? Irritation? Dislike? He's probably grossed out by the way Stiles smells like nerves and sweat. \"I'll talk to you later, then. Thanks for the ride.\"</p>\n<p>Derek lifts his fingers in a short wave as Stiles clambers out of the car. He takes the stairs to his apartment at a run, trying to release some of his nervous energy. If he drinks the entire six-pack in one sitting and then jerks off furiously, well, only Oscar's there to judge him.</p>\n<p>-</p>\n<p>Scott has to come pick him up in the cruiser. It's a quiet morning; they meander around town with no real purpose. Stiles finally tells Scott about Derek and his stupid teenage crush. To his great credit, Scott doesn't tease him; he just taps his fingers against the steering wheel and says, \"He's a tough case, dude. I mean, Allison knows him better than I do, but I don't think he's dated anyone since Kate.\"</p>\n<p>Stiles sighs. \"I don't really blame him, I guess.\"</p>\n<p>Scott gives him an encouraging grin. \"Don't give up, man. I think if you keep chipping away at him, you might be successful.\"</p>\n<p>\"I hope so,\" Stiles says doubtfully.</p>\n<p>His phone buzzes around one. It's a text from Derek.<em> jeep's all set. pick up whenever you want.</em></p>\n<p>Stiles grins and texts back, his fingers flying over the screen. <em>thnk u so much!!! i owe u!</em></p>\n<p><em>you don't owe me anything.</em> This text is followed a minute later by another: <em>your spelling is worse than my six-year-old's. that's saying something.</em></p>\n<p>Stiles snorts and responds, <em>shut up, im not supposed to text while im on duty.</em></p>\n<p>Derek doesn't respond for a few minutes. Stiles wonders if he doesn't want to encourage bad behavior, or if he's just not interested in continuing the conversation, but then another text comes through. <em>i'll let you get back to work, then.</em></p>\n<p>\"Noooooo,\" Stiles groans.</p>\n<p>Scott shoots him a look. \"What's wrong?\"</p>\n<p>\"Nothing,\" Stiles says petulantly. He doesn't text Derek back, as much as he wants to; he's not going to pester him. He has a feeling that Derek wouldn't take well to that sort of behavior, and Stiles is an adult. Most of the time, anyway, except on Saturdays when he watches <em>Adventure Time</em> in his pajamas. But Derek doesn't need to know that (yet).</p>\n<p>Scott drops him off at the mechanic when their shift ends at five. Stiles looks around surreptitiously as he walks through the garage, but doesn't see Derek. He’s a little disappointed.</p>\n<p>\"Evening, deputy,\" the woman behind the desk smiles. \"Blue Jeep, right? It's sitting out on the lot. Let me grab your keys.\"</p>\n<p>Stiles accepts them with a sigh. \"What do I owe you guys?\"</p>\n<p>She smiles. \"Not a penny.\"</p>\n<p>Stiles blinks. \"Excuse me?\"</p>\n<p>\"Derek did the repairs on his own time. You don't owe us anything.\" Her smile goes a little sly, like she's fishing for information. \"He must like you, for him to come in on his day off and fix your car.\"</p>\n<p>Stiles stares at her, his cheeks flushing. \"Yeah,\" he says, backing toward the door. \"Guess so. Uh. G'night!\" He almost trips leaving the office, but thankfully manages not to knock anything over in his mad rush to get out to the jeep. He doesn't know what he's expecting to find when he climbs in - a note, maybe, some kind of confession - but it's just his messy car, always smelling faintly of curly fries. He sits there for a minute, though, heart still pounding. Derek came in on his <em>day off</em> to fix his car for <em>free</em>. That's way more generous than an almost stranger needs to be. He texts Scott.</p>\n<p>\n<em>is derek particularly generous? or nice?</em>\n</p>\n<p><em>not really,</em> Scott replies. <em>why?</em></p>\n<p>Stiles doesn't respond. He sits in his car and gnaws on a fingernail, tapping his foot against the floor. He sends Derek a message.</p>\n<p>\n<em>you have to let me pay you back somehow</em>\n</p>\n<p><em>no,</em> is the immediate response.</p>\n<p>Stiles bites at his lip. Owing people doesn't sit well in his stomach. Even if Derek says he doesn't owe him anything, even if it would have cost like ten bucks to fix the thing, Derek still came in on his day off and spent time working on something Stiles could have just as easily let Greenberg bungle. He takes the plunge before his nerves can catch up.</p>\n<p>\n<em>let me take you to dinner.</em>\n</p>\n<p>He hits send and almost immediately wishes he could take it back. There’s no way Derek’s going to accept; they hardly know each other, and their interactions always seem to end in awkward silence.</p>\n<p>He watches his phone the entire way home, nearly running over a couple of kids on the crosswalk before he tosses it in the backseat. His phone’s silent all the way through dinner. Stiles tries not to stare at it, but his eyes keep slipping across the living room to where it’s charging on a side table, the screen flat and black. He starts over-thinking things. Derek replied immediately to the first text he sent; he <em>had</em> to have seen the second. Derek’s ignoring him. Stiles has fucked up.</p>\n<p>“I’m obsessed,” he tells Oscar, who yawns widely and curls up in his lap.</p>\n<p>When his phone finally does light up, Stiles restrains himself from jumping up. He waits until he needs to use the bathroom, then casually wanders over to his phone. There’s no use putting on the act; he’s the only one there, but it makes him feel marginally more in control of his life, especially when he picks up his phone and sees a simple<em> all right.</em></p>\n<p>Stiles allows himself exactly one fist pump before sedately texting back <em>when are you free?</em></p>\n<p>\n<em>tuesday.</em>\n</p>\n<p>Tuesday. Stiles likes the finality of that. It’s refreshingly solid after the constant <em>I don’t knows</em> and <em>it’s up to yous</em> of plan making with the rest of his friends. Stiles grins and <em>texts back tuesday it is, then.</em></p>\n<p>-</p>\n<p>Tuesday afternoon, Stiles gets hit by a car. It's stupid, really. It's actually <em>really</em> stupid, and he doesn't blame his dad for laughing until he cries when he hears that Stiles was trying to move a turtle out of the road so it wouldn't get hit and Stiles got hit instead. It's funny. Stiles will probably laugh about it when he's not in a drugged up haze, and also after his broken ribs heal, because even <em>breathing</em> kind of hurts right now.</p>\n<p>\"Sadly,\" his dad tells him, \"I don't think this qualifies you for any sort of award for injury in the line of duty,\" and walks out of the hospital room chuckling. Stiles tries to glare after him but, what with the concussion and all, he's kind of having trouble focusing.</p>\n<p>Scott comes in after his dad leaves, chewing on his bottom lip and looking like he's trying to hold back a shit-eating grin. Stiles sighs and waves a hand. \"Go on,\" he says. \"You can laugh.\"</p>\n<p>Scott collapses in the seat next to the bed, grinning helplessly. \"Sorry, dude,\" he snorts. \"You just looked so shocked. You <em>and</em> the turtle.\"</p>\n<p>Stiles flips him off and asks, \"Is the turtle okay, at least? I nearly died for that asshole.\"</p>\n<p>\"Yeah, he wandered off while the paramedics were loading you up,\" Scott grins. \"You're the hero of the woodland community, I'm sure.\"</p>\n<p>\"Hah,\" Stiles says weakly. He'd really like to take a nap, but he got bitched out by a nurse for trying earlier.</p>\n<p>\"You're going to have to cancel, you know.\"</p>\n<p>Stiles blinks at Scott wearily. \"Cancel what?\"</p>\n<p>\"Your date with Derek.\"</p>\n<p>\"My - oh, shit!\" Stiles shoots upright, then groans when his ribs flare with pain in protest. He sinks back against the pillows, moaning. \"Nooo, fuck, dude, I have to go! The plan's finally falling into place, and I - \"</p>\n<p>Scott laughs. \"He's going to understand! It's not like you're blowing him off for no good reason. You got <em>hit by a car.\"</em></p>\n<p>\"I can go!\" Stiles protests. \"I'm fine!\"</p>\n<p>Scott laughs even harder. \"Dude, have you seen yourself? You got into a fight with the pavement and the pavement <em>won.\"</em></p>\n<p>Stiles scowls, but when he gets released an hour later and Scott drives him home, he finally gets to take a good look in the mirror and - it's kind of true. The left side of his face, where he hit the road, is swollen and scabbing and just starting to darken with bruises. The entire left side of him, in fact, aches and throbs. He's going to have a really impressive collection of bruises in the morning. Stiles sighs, because he <em>can't</em> go to dinner like this, not with his eye swollen shut and still half high off the medication.</p>\n<p><em>i'm really sorry, but i have to cancel tonight,</em> Stiles texts Derek. <em>got hurt at work today.</em></p>\n<p>He's not expecting the almost instantaneous response of <em>are you all right?</em></p>\n<p>Stiles fights back a smile because it makes his head ache, but replies, <em>i'll be okay, just drugged up. you don't want to see me high.</em></p>\n<p>\n<em>do you need anything?</em>\n</p>\n<p>Stiles is sorely tempted to say yes, his head full of images of Derek sitting by his bedside, holding his hand, feeding him soup, kissing his forehead. <em>no,</em> he texts back, exhaling regretfully. <em>scott's going to take care of me.</em></p>\n<p>Which is true, even though Stiles wishes it wasn't. Scott comes back twenty minutes later with pizza and beer, even though Stiles isn't supposed to drink while he's on his meds, and just as Scott's setting everything down on the coffee table, Stiles hears back from Derek. <em>okay. get some rest. we can reschedule.</em></p>\n<p>\"Hey,\" Scott says, and Stiles lifts his eyes from his phone to see Scott grinning at him. \"So I probably shouldn't tell you this, but when I was waiting for the pizza, Derek started blowing up my phone with texts about you.\"</p>\n<p>\"What?\" Stiles asks, his heartbeat picking up. \"No.\"</p>\n<p>\"Yes,\" Scott says firmly, plunking himself down on the couch next to Stiles. \"I know this whole date was just supposed to be a platonic thank you sort of thing, but he was worried. I think he likes you, dude.\"</p>\n<p>\"Don't get my hopes up,\" Stiles groans, reaching for a slice of pizza. \"He's like, impossible to read.\"</p>\n<p>\"That's partly a werewolf thing,\" Scott says. \"It's a lot harder to hide your feelings from other werewolves, so you end up with people who are very open, or very closed off. But believe me, dude, he wouldn't have even bothered asking if he wasn't actually concerned.\"</p>\n<p>\"Hm,\" Stiles says noncommittally. There's a heavy warmth settling in his stomach, though, hopeful and comforting.</p>\n<p>-</p>\n<p>Stiles is on desk duty until his ribs heal; he's no use as a partner if he can't run, or if he might injure himself further in an altercation. He understands that, but it still sucks, and it's boring as hell. He mostly spends his time on the phone with all the people who've been warned they'll be arrested if they keep calling 911, so they call the non-emergency line instead. He's sitting at the front desk three days after his accident, chin in his hand as he listens to an old man trying to convince him that the government's planted cameras in his kitchen, when Derek walks through the station doors.</p>\n<p>\"We'll send someone over to check it out as soon as we can,\" Stiles lies to the old man, and hangs up without another word. \"Hi.\"</p>\n<p>Derek leans against the counter, eyes flickering over Stiles' face. \"Hey.\"</p>\n<p>Stiles licks his lips, suddenly awkward. His face is no longer swollen, but he's still heavily bruised, and there's a long scrape that runs from the side of his temple to his chin. \"What can I do for you?\"</p>\n<p>Derek shrugs with one shoulder. \"Figured you'd probably be here,\" he says. \"Just wanted to check on you.\"</p>\n<p><em>Just wanted to check on you.</em> Stiles tries to tamp down on the swelling of his heart, but it's pretty much useless. They're not friends, technically, yet Derek stopped by to check on him? He wants to sing. He wants to kiss Derek on his stupidly handsome face. \"Thanks,\" he says hoarsely, and limits himself to that, because he might burst out with a whole slew of inappropriate things otherwise.</p>\n<p>\"So what happened?\" Derek asks, gesturing toward Stiles' face.</p>\n<p>\"Oh.\" Stiles' cheeks go red, because the story is no less embarrassing now than it was three days ago. He decides to leave out the bit about the turtle. \"I got hit by a car.\"</p>\n<p>Derek frowns. \"Someone hit you on purpose?\"</p>\n<p>\"No, no,\" Stiles says hurriedly. \"I was in the road, and the lady was distracted. She just clipped me; it wasn't like I got run over or anything.\"</p>\n<p>Derek's expression clears. \"All right.\"</p>\n<p>\"I'm sorry I had to cancel.\"</p>\n<p>Derek snorts. \"You got hit by a car. You get a pass this time.\"</p>\n<p>\"This time?\" Stiles repeats hopefully, and Derek's face goes a little soft around the edges when he nods. \"Well,\" Stiles says nervously, shuffling papers around on the desk. \"Well, then.\" He squints up at Derek. \"Are you busy? Tomorrow night, maybe?\"</p>\n<p>One side of Derek's mouth lifts slightly. \"I'm sure I can find a babysitter.\"</p>\n<p>\"Okay,\" Stiles says, fighting back an idiotic grin. \"Cool. Um. I can't do much, but maybe I could make dinner - \" He cuts himself off at the way Derek's smile fades. \"Uh, no? Did Scott tell you I'm a terrible cook? Because I'm not - \"</p>\n<p>\"No,\" Derek says quickly. \"That's fine. I was just thinking it'd be nice to get out of the house. I don't get the chance very often.\"</p>\n<p>\"Oh!\" Stiles blinks. The phone rings, but he ignores it. \"We can do that! What kind of food do you like?\"</p>\n<p>\"Anything,\" Derek shrugs, then seems to reconsider. \"Not Italian. Too heavy.\"</p>\n<p>\"No pasta? Sacrilegious,\" Stiles declares with a grin. \"I'll figure something out then text you, okay?\" He gestures at the phone, which is still ringing, with a sigh. \"I should probably, you know, do my job.\"</p>\n<p>\"All right,\" Derek says with a faint smile. \"I'll talk to you later.\"</p>\n<p>\"See ya,\" Stiles waves. He's about to pick up the phone when there's a soft cough from behind him and he twists around to see his father standing in the doorway to his office, looking smug.</p>\n<p>\"Working hard, son?\" the sheriff asks, folding his arms across his chest.</p>\n<p>\"How much of that did you hear?\" Stiles sighs.</p>\n<p>\"Door was open,\" the sheriff replies. \"All of it. I'm very happy you've landed yourself a date, but try to limit the flirting to your lunch break next time, all right?\"</p>\n<p>\"Yes sir,\" Stiles agrees, the tips of his ears going pink. He turns back to the desk and picks up the phone. The old man at the other end of the line tells Stiles he's pretty sure he's just found government cameras hidden in his tool shed. Stiles slumps over the desk with a sigh.</p>\n<p>-</p>\n<p>The following day, Stiles gets off his shift and goes home. He takes a shower, then dithers in front of the closet for a while, not sure how formal to be. This isn't a date, technically; it's Stiles thanking Derek for fixing his car. Even if that isn't something Derek usually does for other people in the first place, even if Derek stopped by work yesterday just to check in on him. He isn't going to assume anything until it's actually spoken out loud and agreed upon, because he's made too many mistakes in the past, and he's really holding out on this to be real.</p>\n<p>He finally settles upon a navy button-up and khakis and heads to the restaurant to meet Derek. He can feel his palms getting sweaty as he drives and it's - it's kind of silly. At the same time, though, maybe it's not? Stiles is good at talking, good at listening, good at being that guy that everyone likes and gets along with. But the deeper connections? They're hard for him. He can make friends with the snap of a finger, but keeping those friends longer than a few months is a lot harder. Here in Beacon Hills, the only people he's really got are his dad, Scott, and Allison. Lydia's back on the east coast, and he's not sure how Isaac feels about him - and that's it. Three people and a cat.</p>\n<p>He can't remember the last time he went on a date. It's been at least six months, probably longer. His last serious relationship was, fuck, back in college, and even that was nothing to be proud of; just like friends, he can't seem to keep a relationship going much longer than three or four months. It's discouraging and a little depressing. He's trying really hard not to get his hopes up about Derek, but it's so hard not to when everything seems to be falling into place.</p>\n<p>Derek's waiting in front of the restaurant and fuck, he looks <em>good</em>, dressed in a white dress shirt and dark jeans. It's not fair how devastatingly handsome he is, no, no, no, or how kind he looks when he smiles, like he's smiling at Stiles right now.</p>\n<p>\"Hi,\" Stiles says, his cheeks going red at the way his voice is high and breathy.</p>\n<p>Derek doesn't seem to notice. He lifts his eyes toward the restaurant sign and says, \"This the place?\"</p>\n<p>\"Yeah,\" Stiles says, following his gaze. \"I - no, wait, this is totally different! When did this happen? This used to be a steakhouse.\"</p>\n<p>Derek shrugs. \"I don't mind. You want to try it?\"</p>\n<p>\"Sure,\" Stiles says deliberately. \"I don't mind an adventure.\"</p>\n<p>They head inside, and Stiles quickly realizes that it might be more of an adventure than he thought, because this place is <em>fancy</em>. Not like suit-and-tie fancy, but all the ladies are in nice dresses, and the dude are all wearing sports jackets, and even though he knows he looks good, he still feels out of place. If Derek feels the same, though, it doesn't show; he thanks the hostess when she shows them to a table, and raises his eyebrows at Stiles when Stiles stays standing a moment too long.</p>\n<p>\"This okay?\" Derek asks, raising his eyebrows.</p>\n<p>\"Yeah,\" Stiles breathes, sliding into the other side of the booth. \"Totally. Totally. I guess this - this isn't the type of place you'd go with your daughter.\"</p>\n<p>Derek snorts quietly. \"She gets impatient,\" he says. \"It's a virtue we're working on. If we go out to eat, it's to fast food places where she doesn't have to sit any longer than ten minutes.\"</p>\n<p>\"My dad could sympathize with you there,\" Stiles tells Derek ruefully. \"He and my mom could never take me anywhere. I'd be bouncing off the walls in five minutes. I was on Adderall until college,\" he adds, at Derek's raised eyebrow.</p>\n<p>Derek snorts again. \"I pity your parents.\"</p>\n<p>Stiles laughs as the waiter comes over and introduces himself. They order drinks and then that fish out of water feeling comes back as Stiles stares down at the menu. \"Is this French?\" he whispers to Derek, who's frowning down at his menu like it's personally offended him. \"I don't know what any of this stuff is.\"</p>\n<p>\"I don't either,\" Derek admits. He gives Stiles a grim look. \"Adventure, right?\"</p>\n<p>\"Right,\" Stiles says as the waiter comes back over with their drinks. He reaches for his glass and manages to knock over his water instead, flooding their table. \"Fuck! Jesus, I'm sorry!\" The thunk of the glass hitting the floor has several heads turning in their direction. A woman at a nearby table leans forward to whisper something to her companion, who laughs. Stiles can feel his cheeks flushing red. \"I'm sorry,\" he tells Derek again. \"I'm totally floundering here, dude.\"</p>\n<p>Derek slides out of the booth, stepping over the puddle of water. Stiles watches him nervously, wondering if he's done such a disastrous job that Derek's done with him, but all Derek does is reach out and curl his fingers around Stiles' wrist, tugging him from the booth. \"Come on,\" he says quite gently, and tows Stiles out of the restaurant. The night air is cool on his hot face.</p>\n<p>\"Sorry,\" Stiles tries again, but Derek shakes his head, turning left and heading down the street, his hand still around Stiles' wrist. Stiles looks down at their hands, his mouth dry.</p>\n<p>\"Glad that happened,\" Derek says, quirking one side of his mouth up. \"That place was a little stuffy.\"</p>\n<p>Stiles breathes out. \"Yeah,\" he agrees, relief flooding through him. \"What now?\"</p>\n<p>\"I think there's a diner around the corner,\" Derek says, glancing over at him. \"Is that more our speed?\"</p>\n<p>\"Hell yeah,\" Stiles says cheerfully. \"Give me all the greasy comfort food.\"</p>\n<p>Derek laughs, his fingers squeezing against Stiles' skin before finally dropping away. Stiles misses the contact almost instantly, but he doesn't try to go after it; he knows how some werewolves - hell, some humans - feel about touching other people. Stiles would have guessed by Derek's guarded exterior that he's one of those werewolves, but maybe not.</p>\n<p>Their second attempt at dinner goes a thousand times better than the first. The diner is bright and warm and crowded with people Stiles knows from his patrols. He sees Derek nod at a few people and smiles to himself as they settle down into a booth.</p>\n<p>\"Is this better?\" Derek asks, nodding his thanks as a waitress sets mugs of coffee down in front of them without prompting.</p>\n<p>\"So much better,\" Stiles grins. \"You think?\"</p>\n<p>Derek nods, lips quirking up.</p>\n<p>\"So you work as a mechanic part time,\" Stiles says, eyeing the menu. \"Do you have another job?\"</p>\n<p>Derek shakes his head. \"I stay at home,\" he says, \"watch Laura's kids a couple days a week. She used to watch Sam in return while I worked, but Sam's started school now, so.\" He rolls his shoulders in a shrug. \"'s quiet.\"</p>\n<p>Stiles smiles. \"You really love her, huh?\"</p>\n<p>Derek shifts slightly, keeping his eyes on the menu. \"Yeah. I never - never wanted her to think she was unwanted. Family and pack - it's important.\" He smiles, soft and fond and private. \"She came home the other day and said she wanted to join the soccer team. I never would have gone out for something like that. Sam's strong.\" He glances up at Stiles and his cheeks go red. \"Sorry,\" he says, suddenly gruff again.</p>\n<p>\"No way,\" Stiles says, waving a carefree hand. \"I think it's awesome, dude. I bet you're a great dad.\"</p>\n<p>Derek looks down at his menu, the tips of his ears going red, and Stiles grins.</p>\n<p>They order their food and talk and it's easy, so easy. Stiles doesn't know why he was nervous. He tells Derek about living on the east coast while he was in school, and stories from the police academy, and Derek tells him about the big outings the pack does - a retreat in Idaho, a vacation on the gulf of Texas. Stiles' plate is empty in front of him and he doesn't remember eating his hamburger and fries. Across the booth, Derek's leaning forward against the table, his face soft, and Stiles thinks about how easy it would be to just lean forward and close the distance and kiss him. He doesn't, though, as much as he wants to, because he's still not sure if this is just dinner or a date.</p>\n<p>The waitress drops their check off with a cheerful, \"Take your time, sweethearts,\" and Derek picks it up before Stiles can touch it.</p>\n<p>\"I'll pay,\" Derek says, pulling out his wallet.</p>\n<p>\"What, no!\" Stiles protests, trying to grab at the bill, but Derek jerks it out of his reach. \"I'm supposed to be thanking you for working on the jeep!\"</p>\n<p>\"It was my idea to go out,\" Derek replies smoothly, pulling a few bills out of his wallet. \"You were going to cook for me.\"</p>\n<p>\"I don't mind paying,\" Stiles sighs.</p>\n<p>Derek looks up at him and smiles faintly. \"Guess you're in my debt again.\"</p>\n<p>Stiles' breath catches in his throat at the insinuation. \"I - yeah.\" A smile - a really gleeful, terrible, frightening smile, he's afraid - forces its way onto his lips. \"I can deal with that.\"</p>\n<p>He wants to write a poem about the way Derek's eyes crinkle at the corners when he smiles. Stiles <em>could</em> kiss him then; he nearly does, but Derek's getting to his feet before he can work up the nerve. They step out of the diner and Stiles is vaguely surprised to see there's still light at the edge of the horizon. Is this what it's like to be an adult? God, he's turning into his dad.</p>\n<p>\"Where'd you park?\" Derek asks, shoving his hands in his pockets.</p>\n<p>\"Down that way,\" Stiles says, jerking his head toward the street.</p>\n<p>\"I'll walk with you,\" Derek says casually, and Stiles grins.</p>\n<p>\"Did you forget I'm a cop?\" he teases. \"I can protect myself.\"</p>\n<p>\"Fine,\" Derek retorts. \"If you don't want my company - \"</p>\n<p>\"Let's not be hasty,\" Stiles says quickly, spinning on his heel to head toward his car. Derek falls into stride next to him, the long lines of his body relaxed. Stiles makes himself remain calm, but inside he's almost dancing in his skin because dinner was a success; it wasn't awkward, and Derek seems to like him, and he feels good, but he's got to make sure before he can make a fool of himself trying to go further. When they reach his car, Stiles leans against the side and says, \"I know this was just supposed to be me thanking you for fixing the jeep, but do you want to do it again? Soon?\"</p>\n<p>\"Yes,\" Derek says without hesitation.</p>\n<p>\"Oh, good,\" Stiles sighs, and relaxes completely when Derek steps into his space. Derek hovers there for just a moment, one of his hands rising to brush against Stiles' cheek before he closes the last few inches between them and kisses Stiles. Stiles closes his eyes and presses himself into Derek, letting Derek's kiss consume him. He can't help the small, needy noise that escapes him when Derek pulls away, but he doesn't go far, breathing warm against Stiles' cheek.</p>\n<p>\"Do that again,\" Stiles mumbles and Derek laughs, a soft <em>hah</em> of air breezing across Stiles' skin.</p>\n<p>Derek straightens, his hands slipping to Stiles' sides. Stiles wants to keep the warmth in his eyes there forever. \"I'm free on Monday.\"</p>\n<p>\"Okay,\" Stiles grins. \"Cool. I can't do anything strenuous,\" he says, gesturing at his ribs, \"but maybe we can get drinks or whatever.\"</p>\n<p>Derek nods, his eyes falling to Stiles chest before rising back to his face. \"Can I?\" he asks, lightly resting one of his hands against Stiles' bruised chest.</p>\n<p>\"I - what?\" Stiles asks. Derek's eyes settle halfway shut, his breathing even. Stiles' knees sag a little as warmth fills his torso and residual pain from his ribs he hadn't even noticed fades away. \"Oh,\" he says languidly, watching black lines trace the flow of Derek's veins, running up his forearms and disappearing under his shirt cuffs. \"Doesn't that hurt?\"</p>\n<p>\"Not for long,\" Derek says, pulling his hand away. Stiles sighs at the loss of his touch, but the pain doesn't return, which is a small miracle.</p>\n<p>\"Thanks,\" he tells Derek a little dazedly, head fogged.</p>\n<p>Derek nods and leans in for a second slow kiss before he steps back, up onto the curb. \"Drive safe.\"</p>\n<p>\"I will,\" Stiles promises. He climbs into his car and sits there for a moment, watching Derek head back down the street in his rearview mirror. He sits there for a moment longer, breathing deeply as the last of the haze from Derek healing him fades from his head. He thinks about Derek kissing him and starts grinning. He grins all the way home, heart hammering in his chest. He's still smiling when he falls asleep, the memory of Derek's lips against his, and the warmth of his hands a heavy, comforting weight on his chest.</p>\n<p>-</p>\n<p>On Monday, Derek texts him first. <em>you still free?</em></p>\n<p>Stiles, who's still on desk duty, texts back <em>yes! did you have something in mind?</em></p>\n<p><em>yes,</em> Derek responds. <em>i'll pick you up at nine.</em></p>\n<p>Stiles grins. <em>what are we doing?</em></p>\n<p>\n<em>nothing you have to dress up for.</em>\n</p>\n<p>That's all he gets until eight, when Derek texts him that he's outside and he goes downstairs to find Derek waiting in his flashy car. He can't help noticing that the car seat’s been taken out of the back and croons as he slides inside, \"Oooh, you gonna take me to Makeout Point?\"</p>\n<p>Derek gives him a flat look. \"If you want your father knocking on the window.\"</p>\n<p>Stiles laughs. \"Nah, dude, he's managed to permanently weasel his way out of night shifts; we're safe. He'd just roll his eyes anyway. I can't even tell you how many times he walked in on me in uh, compromising situations when I lived at home. You think he would have learned to knock, but no.\"</p>\n<p>\"Maybe later, then,\" Derek says lightly, a smile hovering around the corners of his mouth. Stiles laughs, and he keeps laughing when Derek pulls into the drive-in theater. Derek gives him an unimpressed look.</p>\n<p>\"Really?\" Stiles snorts. \"How <em>old</em> are you?\"</p>\n<p>\"If you think I'm going to pass up the chance to see a movie rated higher than G, you're wrong,\" Derek retorts, handing the attendant in the booth a couple of bills.</p>\n<p>\"Oh, dude,\" Stiles says, suddenly contrite. \"How many princess movies have you seen in the last year?\"</p>\n<p>Derek winces as he pulls into a spot in front of the screen. \"Too many,\" he says, sounding rather mournful.</p>\n<p>\"All right, I'll give you this one,\" Stiles says, unbuckling his seatbelt. \"I'll even buy the popcorn.\"</p>\n<p>\"My hero,\" Derek says dryly, but he follows Stiles out of the car and down the dirt path to the concession stand.</p>\n<p>It's weird, Stiles thinks, how at ease he feels around Derek. Sure, the first few times they spoke it was kind of awkward, but it was almost like the experience at that first restaurant was a test and once they'd passed that, things were fine. Of course, it's only their second date, but the easy way Derek curls an arm around his waist as they stand in line makes it seem as though it's been much much longer. It feels nice to have someone to lean against; it's been a long time since Stiles' had that.</p>\n<p>Derek snorts when Stiles orders popcorn <em>and</em> curly fries, but obligingly points toward the Junior Mints when Stiles elbows him and demands he choose something sweet. \"Does the sheriff's department consider this a healthy diet?\" Derek asks as they walk back to the car, arms laden with junk food.</p>\n<p>\"You are severely underestimating my metabolism,\" Stiles says derisively. \"And if my dad had his way, the station vending machine would only serve Oreos and Snickers.\"</p>\n<p>\"Glad you're focusing on the important things,\" Derek retorts. \"Not like, say, the safety of the county.\" He opens the door to the Camaro and pops the seat forward.</p>\n<p>Stiles pauses. \"So are we not going to pretend that we're not going to end up making up halfway through the movie?\"</p>\n<p>\"No,\" Derek says, sliding into the back. \"I'm twenty-eight, Stiles. I know what i want.\"</p>\n<p>\"Oh,\" Stiles says, brightening. \"Cool.\" He hands Derek his food and slides into the back next to him, leaning forward to shut the door. He waggles his eyebrows at Derek suggestively. \"You gonna make a man out of me?\"</p>\n<p>He's startled by the look Derek gives him then, a slow, predatory grin. It sends a shock of heat right down to his groin. \"Don't test me,\" Derek warns, leaning forward. Stiles stills, thinking Derek's about to kiss him - but he just yanks the box of Junior Mints out of Stiles' hand and sits back, looking smug.</p>\n<p>\"You tease,\" Stiles complains lightheartedly, digging into his curly fries as trailers start playing on the movie screen.</p>\n<p>The back seat is not uncomfortable, but it's small and they've both got broad shoulders. Stiles doesn't care, because he eventually ends up tucked into Derek's side with Derek's arm around his shoulders, his fingers idly scratching through Stiles' hair. Stiles is usually fidgety, always seeking a new position, but the weight of Derek's arm is good, grounding. He can hear Derek's heartbeat even over the sound of the movie coming through the speakers, steady and solid. He can smell Derek too, if he breathes deeply enough. He knows scent is important for werewolves, how it helps them read emotions. Most of them tend to shy away from heavily scented perfumes and aftershaves - unless they're trying to hide something - and Derek's no different; there's only the faintest smell of laundry detergent and aftershave on him. On top of that is the scent that has to be<em> Derek</em> - warm and vaguely spicy, like fallen leaves. Stiles wonders what Derek would smell like if he had a werewolf's heightened sense of smell, then wonders what <em>he</em> smells like. He'd asked Scott once and Scott had said, \"Pizza,\" but Stiles had been eating pizza at the time, so he thinks Scott was just joking. He <em>hopes</em> Scott was just joking, God. Imagine going through life smelling like pizza. Maybe he'll ask Derek if they make it a through a couple more dates.</p>\n<p>He hopes they will. Derek's certainly not pushing him away, he thinks triumphantly, lazily shifting more fully into Derek's side, enjoying the heat of him. Derek sighs softly and Stiles is conflicted for a moment because he's a movie guy and he's been wanting to see this new superhero movie for a while now and it's actually pretty good - but on the other hand, <em>Derek</em>. Derek wins out because there's always the DVD a couple months from now, but there's only one second date with Derek (and okay, Stiles is kind of still a teenager at heart and he didn't do nearly enough making out at the movies when he was in high school - like, any, actually, because he didn't date until college - and that's an experience everyone deserves to have, right? Right.).</p>\n<p>So he tilts his head instead, pressing his lips to the hinge of Derek's jaw. Derek's throat is right there and Stiles aches to taste his pulse, but he knows that the neck's a sensitive spot for werewolves and he doesn't want Derek to think he's trying to dominate him so he goes for his jaw instead, mouthing at his warm skin, Derek's stubble prickling at his lips. Derek exhales quietly. If he's annoyed Stiles is distracting him from the movie he doesn't show it. He tilts his head down instead, nosing against Stiles' cheek before dipping in to meet Stiles' lips. Stiles likes the way he kisses, slow and unhurried but forceful, his fingers gripping at Stiles' shirt like he's dying. It feels like forever, like Stiles should have run out of air hours ago but he's fine, better than fine.</p>\n<p>When they do pull apart Stiles shifts around so it doesn't feel like he's breaking his neck to reach Derek, hand on Derek's shoulder for balance as he moves onto his knees, then straddles Derek's thighs when Derek wraps a hand around the back of his leg and tugs. It's not great; he has to hunch forward to keep his head from hitting the roof of the car and his ribs don't really appreciate the way he has to curve his spine, but it gets them at an angle so he can lean against Derek's shoulders, sinking his fingers into his soft hair as Derek's tongue sweeps against his teeth. Stiles can taste him, salt and butter and chocolate and mint and that fire's burning inside him, his cock stirring against his leg.</p>\n<p>Derek tilts his head and mouths at Stiles' neck and his mouth is hot and wet and perfect and <em>fuck</em>, would Stiles love Derek to bruise him, break blood vessels, mark him - but Stiles is a cop and he's got to deal with the public. He hisses when he feels teeth and murmurs, \"I gotta work tomorrow, dude. Keep me professional, okay?\" Derek makes a disgruntled noise - Stiles wholeheartedly agrees - and Stiles presses his fingers under Derek's chin, lifting his head back up so Stiles can lick into his mouth apologetically.</p>\n<p>Derek's kept his hands on Stiles' back but now they slip down, one stopping in the small of his back, the other dipping between his jeans and his underwear, the tips of Derek's fingers curling against the swell of his ass. Stiles moans softly, arching his spine at the touch. He's hard now, jeans constricting, and the forward movement of his hips bring him into contact with Derek, who's just as hard. Stiles can feel the heat of him even through two layers of denim.</p>\n<p>\"Jesus,\" Derek says roughly, his eyes fluttering closed as he thumps his head back against the seat.</p>\n<p>Stiles bends his head to bite at Derek's collarbones but yelps when his ribs flare in pain. He jerks upright and smacks his head against the roof. \"Ow!\"</p>\n<p>\"You all right?\" Derek asks, looking bemused and a little worried.</p>\n<p>\"Yeah,\" Stiles sighs, patting his ribs gingerly. \"I just - I'm not too flexible at the moment.\"</p>\n<p>\"That's all right,\" Derek replies, stroking a hand up his spine. He nods past Stiles toward the screen. \"The movie's over anyway.\"</p>\n<p>\"Bummer,\" Stiles says ruefully. \"A couple more minutes and I would have come in my pants. That would have rounded out this teenage date perfectly.\"</p>\n<p>Derek laughs and Stiles grins at the rich sound of it. He could do with hearing that noise every day. \"You want me to help you out?\" Derek asks.</p>\n<p>\"Nah,\" Stiles grins. \"Driving home with a boner is also a fond teenage memory.\"</p>\n<p>Derek huffs out another laugh and pulls Stiles down against him. His breath catches in his throat at the feeling of their cocks brushing - even two layers of fabric between them isn't enough to dull the sensation. He feels like he's on fire. When was the last time he even had sex? It's been fucking <em>months</em> and now there's Derek, his body firm and burning like a furnace against Stiles, his hands back down the back of Stiles' pants and all Stiles can do is rut against him, panting against his neck. God, he <em>is</em> a teenager, isn't he?</p>\n<p>People are starting to leave around them, turning on their cars and driving out of the field. \"You're going to get us arrested,\" Stiles gasps.</p>\n<p>\"You better hurry up, then,\" Derek retorts. He brings up his hips sharply, digging his fingernails into Stiles' ass and that's it - Stiles makes an horribly embarrassing noise he mostly muffles against Derek's throat and comes with a jolt, his chest screaming as his whole body goes rigid with orgasm. Derek turns his head, sinking his teeth into Stiles' shoulder with a groan, his hips riding up once, twice, before going still. They sit there for a long moment, trying to catch their breaths as they come down from their highs, the car flooded on and off with light from departing vehicles.</p>\n<p>\"Teen date complete,\" Stiles says after a while, his voice hoarse. And even though his ribs ache something fierce and his underwear is disgustingly wet, he feels <em>great</em>. \"Jesus. Good thing you're driving. I can't feel my legs.\"</p>\n<p>Derek snorts and gently shifts Stiles aside, popping the door open. \"You going to stay back there or do you want a hand?\"</p>\n<p>Stiles waves him away, climbing out of the car and sliding the seat back so he can collapse into it. Derek drives quite sedately out of the parking lot and the ride back to Stiles' apartment passes in mostly in silence. Derek pulls up in front of the building and looks over at Stiles, his face soft.</p>\n<p>\"I'd invite you up,\" Stiles says, gesturing toward the building, \"But I might actually break another rib if we do anything else.\"</p>\n<p>\"That's all right,\" Derek replies, smiling faintly. \"I promised Laura I'd pick Sam up before midnight.\"</p>\n<p>\"Okay,\" Stiles smiles. \"Well - thanks. I haven't had that much fun in a while.\"</p>\n<p>\"It's been a while,\" Derek agrees quietly. He reaches out and curls his fingers around Stiles' wrist, squeezing lightly. \"I'd like to do it again.\"</p>\n<p>\"Agreed,\" Stiles says firmly. \"I'll call you - or you call me. Whichever one of us thinks up something to do first.\"</p>\n<p>\"All right,\" Derek concurs. He tugs at Stiles' wrist, pulling him over the center console to give him a soft kiss, his lips lingering.</p>\n<p>Stiles swallows as he pulls away, his cock giving a half-hearted twitch of renewed interest. \"I've got to go change out of these pants.\"</p>\n<p>\"Me too,\" Derek says ruefully. \"Laura will piss herself laughing if I come over like this. I'll talk to you later.\"</p>\n<p>\"Sounds good,\" Stiles grins, climbing out of the car. \"G'night.\"</p>\n<p>Stiles watches Derek pull away down the street. He's got that stupid grin on his face again and he doesn't regret anything about it.</p>\n<p>-</p>\n<p>The next couple of days pass slowly. It's deathly boring at the station; even the calls from all the crazies have mostly dried up. Stiles exchanges the occasional text with Derek, but Derek's not a super lively texter, and sometimes it takes him hours to reply, which is fine, but Stiles is <em>bored</em>. He's also not sure what the next step is for them. He wants Derek, in no uncertain terms, and he's like ninety percent sure that Derek wants him, but he's also rushed into relationships before and it's always turned out badly. He wants them to work.</p>\n<p>Scott helps him out by coming in the next morning and announcing to the station at large that he's hosting an end-of-fall barbecue at his place on Friday and Stiles brightens. Maybe he can invite Derek. That'd be good right, hanging out with other adults? He wonders if Derek drinks, what he's like when he's drunk. And as if he knows Stiles is thinking about him, Derek texts him just before noon. <em>have you eaten?</em></p>\n<p><em>no,</em> Stiles texts back, though he's been thinking about it. <em>you want to go somewhere?</em></p>\n<p><em>i'll bring it to you,</em> Derek replies. <em>what kind of sandwiches do you like</em></p>\n<p><em>ANYTHING,</em> Stiles types enthusiastically.</p>\n<p>He's helping a woman file a stolen property report when Derek comes in half an hour later. Stiles glances up when he hears the door open and meets Derek's eyes with a faint smile. <em>Just a minute,</em> he mouths and Derek nods and turns to look at a community message board peppered with flyers of lost dogs and church potluck dinners. Stiles turns his attention back to the woman but he's warm inside, flushed with pleasure at the idea that Derek's here for him, brought him <em>sandwiches</em>. It's so fucking domestic. He has to tell himself to calm down, not to get used to it because they've only gone on two dates and there's still plenty of time for things to go to shit. He still blushes, though, when the woman leaves and Derek leans on the desk and says, \"Hey.\"</p>\n<p>\"Hey,\" Stiles echoes casually, even though all he wants to do is throw himself across the desk at Derek. \"Let me go grab someone to watch the desk and we can eat outside.\"</p>\n<p>Derek nods and Stiles ducks into the back office, calling forth a deputy to cover for him. He and Derek head outside and Stiles leads them around the side of the station, where a huge old oak tree towers over a picnic table. Derek sits next to him, not across from him and Stiles likes that, likes the way the sides of their thighs press together, the way their arms brush occasionally.</p>\n<p>\"Are you working today?\" Stiles asks as Derek unpacks a paper bag, laying wrapped sandwiches and chips and drinks on the table. He nods toward the shirt Derek's got on under his jacket, streaked with dirt and grease. \"Didn't want to dress up to see me, huh?\"</p>\n<p>\"This is the real me,\" Derek deadpans. Stiles elbows him good-naturedly and Derek snorts. \"Hey, you're in your uniform too.\"</p>\n<p>\"I wouldn't call a dirty shirt and ripped jeans a uniform,\" Stiles retorts, unwrapping his sandwich. \"Oh, hey! This looks good!\"</p>\n<p>\"You said you'd eat anything,\" Derek shrugs. \"Leunig's does the best sandwiches in the city.\"</p>\n<p>\"You did not just say that,\" Stiles says, jabbing a finger at Derek with his mouth full of cold cuts and vegetables. \"It's Blue Moon or nothing.\"</p>\n<p>\"Guess you don't want this, then,\" Derek replies, plucking the sandwich out of Stiles' fingers. Stiles dives after him, laughing.</p>\n<p>They eat the rest of their sandwiches in relative peace. When he's done eating, Stiles crumples up the wrapper and says, \"Hey, so, Scott's throwing a barbecue at his place tomorrow night.\"</p>\n<p>\"I know. Allison told me,\" Derek replies, sipping at his coke. \"Are you going?\"</p>\n<p>\"Yeah,\" Stiles says. \"I mean - I was going to ask you if you wanted to. Go.\"</p>\n<p>\"Together?\" Derek raises an eyebrow at him and Stiles nods. \"Sure. I just - \" He hesitates for a moment. \"I was going to bring Sam. She loves Tori.”</p>\n<p>\"Dude, that's fine,\" Stiles grins. \"I'd like to get to know her, if that's okay.\"</p>\n<p>Derek looks at him for a moment, his eyes soft, before he nods. \"I'd like that.\"</p>\n<p>He kisses Stiles a few minutes later, as Derek heads to his car and Stiles heads back to the front desk. He pulls Stiles in by the front of his shirt and mashes their mouths together, kissing Stiles until he's breathless, and Stiles almost feels like Derek's thanking him. Derek presses their foreheads together when they pull apart, breathing softly against him. It occurs to Stiles that they're right in front of his dad's office, but he can't quite bring himself to care.</p>\n<p>\"Thanks for lunch,\" Stiles says, his voice a little unsteady.</p>\n<p>Derek smiles, a small curl of his lips that's utterly content. \"You're welcome,\" he replies. \"I'll see you tomorrow night.\"</p>\n<p>\"Yeah,\" Stiles agrees shakily. \"Yeah.\"</p>\n<p>Derek kisses him again, a quick, chaste press to his lips, and walks away. Stiles watches him go, his heart pounding in his chest. He's in so deep already.</p>\n<p>-</p>\n<p>Stiles is late to Scott's party because he had a check-up at the hospital (ribs: still broken, but healing), which he's fine with because he hates those early minutes at parties when there's only a couple of people there and no one's drunk yet. When he arrives, walking around to the back of the house, the barbecue's in full swing. Scott's at the grill, a truly massive amount of meat on the table next to him. Allison, her stomach swollen with their second kid, is a few feet away, talking to a woman Stiles thinks is Deputy White's wife. He sees his dad across the backyard, chatting with some of Scott's neighbors. He doesn't see Derek, but that's fine.</p>\n<p>Stiles wanders over to Scott instead, snagging a beer out of a red cooler with a paper sign marked <em>HUMAN</em> on it. There's a blue cooler next to it with a similar sign that says <em>WEREWOLF</em>, which Stiles knows is full of brews laced with wolfsbane.</p>\n<p>\"Hey, dude,\" Scott says cheerfully when Stiles approaches. His face is red from standing over the hot grill, but he grins. \"What'd the doctor say?\"</p>\n<p>\"On the road to recovery,\" Stiles replies, patting his chest gingerly. \"Still gotta take it easy. You think Dad will let me back on patrol soon?\"</p>\n<p>\"Not if your ribs are still broken,\" Scott says with a shake of his head. \"Maybe you should go see a witch. It's boring patrolling alone.\"</p>\n<p>\"You think I like answering phones?\" Stiles retorts. \"All this for a stupid turtle.\" He turns slightly, eyes flickering over all the people standing around.</p>\n<p>\"He's here,\" Scott says, noting the way Stiles is looking around. \"I saw him go inside with the girls.\"</p>\n<p>\"Girls?\" Stiles repeats, bewildered.</p>\n<p>Scott rolls his eyes. \"His daughter and my daughter? They wanted popsicles.\"</p>\n<p>\"Oh,\" Stiles says, relaxing. \"Cool. You need a hand with anything?\"</p>\n<p>\"Nah,\" Scott grins. \"I've only got one spatula.\"</p>\n<p>\"Hah, all right,\" Stiles laughs. \"I'm going to go say hi to my dad, then. He keeps saying we never see each other, even though we do every day.\"</p>\n<p>\"That's work though,\" Scott says, pointing his spatula at Stiles severely. \"Go be a good son.\"</p>\n<p>Stiles laughs again and heads across the yard. He's halfway across the grass when he sees the backdoor to Scott's house swing open. Two small dark-haired girls come tumbling outside, popsicles clutched in their hands. One of them is Tori, Scott and Allison's four-year-old, her wavy hair pulled back in a messy ponytail. The other is Samantha and right behind her is Derek, looking bemused. Stiles pauses where he is, waiting for Derek's eyes to scan the backyard before he lifts his hand in a wave. Derek nods at him and waits for the girls to scamper off to the swing-set before he steps off the back deck and makes his way over to Stiles.</p>\n<p>\"Hey,\" Stiles says, grinning. He wants to reach out, wants to kiss Derek hello - but he doesn't. He doesn't know how Derek would react - if that would go over well in front of a crowd. So he curls his fingers into his palms and smiles at him and Derek smiles and leans in and - oh. Kisses him. It's just a chaste kiss on the cheek, but he does it in front of their friends, Stiles' co-workers, his dad - oh, his <em>dad</em>. Stiles' eyes flicker over to where his dad was standing, but the sheriff doesn't seem to have noticed and Stiles relaxes minutely.</p>\n<p>\"Hi,\" Derek says lightly, straightening up. \"When'd you get here?\"</p>\n<p>\"Just a couple of minutes ago,\" Stiles replies. \"I had to stop by the hospital so they could look at my ribs.\"</p>\n<p>\"Oh?\" Derek raises an eyebrow. \"And how are you doing?\"</p>\n<p>\"I'm healing,\" Stiles says, then adds with a leer, \"I wouldn't say no to more of your healing touch, though.\"</p>\n<p>Derek's eyes go dark and the way he says, \"Maybe later,\" sounds like a promise. Stiles swallows, his lungs suddenly tight. They get even tighter when a voice to his right says, \"Hey, son.\"</p>\n<p>Stiles swallows again and turns his head to see his dad standing there, one hand in his pocket, the other holding a beer. His dad knows about Derek. Well, kind of. He'd overheard Stiles and Derek talking, but there hadn't been much of a follow-up. \"Hey, Dad,\" Stiles says, forcing his voice to remain casual. Inside, though, he's freaking out because it's just occurred to him that he and Derek haven't talked about what they are or how they're going to introduce themselves to people and jesus christ, he's twenty-six and this really shouldn't be a problem. He's supposed to be an <em>adult</em>.</p>\n<p>His dad gives him a long look like he knows Stiles is panicking and then his eyes flicker over to Derek, who's standing next to Stiles with a casual look on his face. Stiles kind of wants to punch him; he looks too fucking serene. \"Who's this?\"</p>\n<p>\"This is Derek,\" Stiles says. \"We're, uh, we're…\" He looks at Derek for help and Derek looks back at him blankly, the bastard. He's totally playing him! If they do end up alone later, Stiles is going to make him <em>pay</em>. \"Dating,\" he decides, watching Derek carefully. Derek raises his eyebrows but doesn't say anything, turning his gaze to Stiles' father.</p>\n<p>\"Mr. Hale,\" the sheriff says politely.</p>\n<p>\"Sheriff,\" Derek says with a nod. \"Call me Derek, please.\"</p>\n<p>\"Derek,\" Stiles' father agrees. \"So you're the one who's been distracting him while he's on duty.\"</p>\n<p>\"Jesus, Dad,\" Stiles hisses.</p>\n<p>His father smiles at him genially. \"Maybe if you came over for dinner once in a while, I'd know these things.\"</p>\n<p>\"Oh my god, Dad, stop being passive aggressive and just invite me over,\" Stiles sighs. \"I can't read your mind.\"</p>\n<p>\"Maybe next week, then,\" his father says. \"Derek, you're welcome too.\"</p>\n<p>\"Thank you,\" Derek says gravely, and they both watch Stiles' father meander over to Scott before Derek turns to Stiles and says, \"It's been a while since I've been interrogated by the parent of someone I'm dating.\" He raises his eyebrows at Stiles again as he says these words.</p>\n<p>\"Shut up, asshat,\" Stiles says. \"You weren't helping me out at all.\" He hesitates, looking around at all the people in the backyard and says, softer, \"Is that okay, though? I don't want to just assume - \"</p>\n<p>\"It's fine,\" Derek says easily. \"That's what we're doing, right? Dating?\"</p>\n<p>\"Yeah,\" Stiles agrees, relaxing slightly. \"Hey, how do you know my dad, anyway?\"</p>\n<p>\"He was the lead investigator for the fire,\" Derek says. \"I spent a lot of time sitting in his office.\"</p>\n<p>\"Oh,\" Stiles says, his mouth going dry. He searches for something else to say that's not about the saddest day of Derek's life; luckily he's saved when Derek's daughter comes skipping up, her hands stained red with popsicle juice.</p>\n<p>\"Daddy,\" she says, \"can we eat soon? I'm hungry.\"</p>\n<p>\"I don't think the food's ready yet,\" Derek tells her calmly. He gestures at Stiles. \"Do you remember Stiles?\"</p>\n<p>Samantha narrows her eyes at him. \"The police officer,\" she says.</p>\n<p>\"That's right,\" Stiles agrees.</p>\n<p>Samantha frowns up at him, her expression eerily like her father's. Then she swings her leg forward, her foot catches Stiles right in the shin.</p>\n<p>\"Jesus, Sam!\" Derek snaps, yanking her into his arms while Stiles bites down on his tongue, his eyes watering. Sam is way too strong for her size.</p>\n<p>\"He's not scary, Daddy,\" Sam informs Derek.</p>\n<p>\"You don't go kicking people to find that out!\" Derek scolds, frowning. \"You don't kick people, period. Understand?\" Samantha nods, her little face stormy. \"Apologize to Stiles.\" Samantha turns to look at Stiles but doesn't say anything. \"Apologize,\" Derek repeats, his eyes flashing blue.</p>\n<p>\"Sorry,\" Samantha tells Stiles sullenly.</p>\n<p>\"No you're not,\" Derek says, swinging her down to the ground. \"Go sit at the picnic table. You're in disgrace.\"</p>\n<p>Samantha pouts but obediently heads for the picnic table over where Scott's grilling.</p>\n<p>\"You - \" Stiles begins, but stops when Derek raises a hand, his head turned to watch his daughter. He waits until she's sitting down before turning to Stiles with a sigh.</p>\n<p>\"I'm sorry about that,\" Derek says. \"Did she hurt you?\"</p>\n<p>\"No,\" Stiles says, though he's pretty sure he's going to have a huge bruise on his shin later. \"Um. Did you - talk to her about us?\"</p>\n<p>Derek opens his mouth, then looks around and seems to realize they're still surrounded by people. He jerks his head to the side, indicating Stiles should follow him to the far edge of the yard, where there's a little more privacy. \"I haven't said anything,\" he tells Stiles softly, the lines of his face smooth in the fading light of the sun. \"We've been on two dates, Stiles, and I haven't dated anyone since she was born. I'm not - \"</p>\n<p>\"Whoa, wait,\" Stiles says, waving his hands placatingly. \"I wasn't looking for a declaration of anything, I was just wondering.\" Derek shuts his mouth and Stiles gives him a considering look. \"You haven't dated anyone since she was born?\"</p>\n<p>Derek nods jerkily. \"I wasn't exactly in the right place for it,\" he says heavily. \"And then there was the trial and raising her and - I got into the habit of being single.\"</p>\n<p>Stiles shoves his hands in his pockets. \"All right,\" he says easily. \"You don't have to justify it to me, dude. If you didn't date, you didn't date.\" He hesitates for a moment before asking, \"Why me, though? Why now?\"</p>\n<p>Derek tilts his head to one side, considering him. \"I don't know,\" he says finally. \"I'm attracted to you and you kept showing up. Seemed right.\"</p>\n<p>\"Good enough for me,\" Stiles grins. \"I think the food's ready, if you want to eat.\"</p>\n<p>\"Are we good?\" Derek asks slowly and Stiles blinks.</p>\n<p>\"Yeah,\" he says. \"Why wouldn't we be?\"</p>\n<p>\"My daughter did just kick you in the shins,\" Derek replies dryly, turning with him to head for the picnic table, where people have gathered to grab food. Samantha's still sitting there, kicking her legs impatiently.</p>\n<p>\"Daddy,\" she pleads when she sees Derek, \"Daddy, I'm <em>hungry.\"</em></p>\n<p>Derek looks at her coolly. \"Are you ready to try apologizing again?\"</p>\n<p>Samantha looks at Stiles. \"I'm sorry for kicking you,\" she says, her voice small.</p>\n<p>Derek nods and looks over at Stiles, who smiles and says, \"Apology accepted.\"</p>\n<p>The evening passes slowly, languidly, in the best way. The evening grows cool and Scott and Allison's father build a bonfire to ward off the chill. Stiles noticed how Derek keeps his distance from the flames, how carefully he watches Samantha when she skips forward to roast a marshmallow over the fire pit. Stiles can't really blame him; if his family had been killed in a fire, he'd probably have a lingering fear of flames too. God knows the smell of hospitals still makes him sick after all that time spent sitting around in them when his mom was dying. He's fine with sitting back a ways, even if the evening chill bites at him through his sweatshirt, talking idly with Derek while Samantha sits on Derek's lap and blinks sleepily.</p>\n<p>Stiles regards her uncertainly. She hasn't paid much attention to him since apologizing for kicking him but Stiles feels like there's something he should be doing. He's pretty sure, based on what he already knows about Derek's strong connections with his family, that if Sam doesn't like him, he and Derek won't last long. It aches a little, watching the way Derek's so familiar with her, absently stroking her hair as they talk. He wants that, wants Derek, wants family. He never realized before how badly he wants it.</p>\n<p>Stiles heads inside some time later to use the bathroom. He's a little tipsy, body flushed warm with alcohol, and he keeps a hand on the wall to hold himself steady. When he comes out of the bathroom he meets Derek coming down the hall. He's got Sam in his arms; she's asleep, dead to the world.</p>\n<p>\"I was just going to lay her down,\" Derek says, his voice low, and Stiles nods, following him to the living room. He watches Derek gently set her down on the couch, pulling a blanket off the back to drape over her. He watches the way Derek brushes his fingers across her forehead before straightening, and abruptly asks, \"Do you want more kids?\"</p>\n<p>Derek glances over at him, his expression hard to read in the dim light of the room. \"I don't know,\" he says finally, stepping forward and curling his fingers around Stiles' wrist. \"It would depend on the circumstances, I guess.\"</p>\n<p>\"Oh,\" Stiles says lamely, following as Derek tugs him down the hall. They head away from the party toward the other end of the house, ending up in the dark quiet of the den. There's no preamble; Derek pushes Stiles up against the wall and kisses him hungrily. Stiles is happy to relax into his touch, hands coming up slip around the back of Derek's neck. He's been aching to touch Derek since he first saw him that evening - since their last date, really - body thrumming with low-level arousal all night, and apparently Derek feels the same.</p>\n<p>\"You smell so fucking good,\" Derek sighs, rubbing his nose against the line of Stiles' jaw. Stiles' breath hisses out of him when Derek nips at his jaw, mouth moving down his neck in wet line of heat. Stiles is already warm from drinking, but Derek pressed up against him flushes him hot and he groans low in his throat, hooking his leg around Derek's hip so he can grind shamelessly against him. \"You make me want to crawl out of my skin,\" Derek growls, curling his hand under Stiles' thigh and hitching his leg higher. \"God, I need - can I suck you off? I need to fucking <em>taste</em> you.\"</p>\n<p>\"Fuck, <em>please,\"</em> Stiles hisses. He tries to be quiet, he really does, but he can't help groaning again when Derek drops to his knees. He clamps a hand over his mouth, mindful of the party outside, and Derek's <em>daughter</em> asleep down the hall, fuck. \"Can Sam hear us?\"</p>\n<p>\"No. Her senses haven't developed that far yet,\" Derek replies, pushing up Stiles' shirt and snapping at his treasure trail, his fingers nimbly undoing Stiles' belt and pants. Stiles clamps his teeth tight regardless, making pitiful muffled noises through his teeth while Derek licks at the jut of his hipbones, sinking lower to kiss the insides of his thighs. For a moment Derek just pauses there, his eyes mostly closed, breathing in deeply. Stiles is about to ask if something's wrong when Derek leans forward and licks a line up his shaft. He makes a deep, satisfied noise in his chest that Stiles swears he can feel in his bones and it's all he can do not to sag at the knees when Derek slowly takes him into his mouth, eyes shut in what looks like ecstasy. Stiles' hand comes out reflexively, tangling in Derek's hair for a moment before pulling away, unsure if Derek will welcome the touch.</p>\n<p>Derek pulls off him long enough to murmur, \"Go ahead,\" before swallowing him down again, head bobbing up and down steadily. Stiles, reassured, reaches out again, dragging his fingernails against Derek's scalp before settling in his hair. The movement earns him a muffled groan from Derek, and as the heat builds inside Stiles he can't help the tiny jerks of his hips, which only gain him more noises from Derek. He sounds like he's enjoying himself almost more than Stiles is - Stiles can see him grinding a palm against his crotch and shit, they are definitely going to sixty-nine at some point down the road - and god, there's nothing better than knowing his partner is having just as much fun as he is.</p>\n<p>Stiles shifts his hips experimentally, pushing just a little further. To his surprise, Derek drops his jaw, relaxing his mouth, and Stiles stutters to a halt. \"I - \" he begins. \"Um. Can I - \"</p>\n<p>Derek pulls back with an indecent wet noise, his eyes glowing faintly blue in the dark room. \"Fuck my mouth,\" he says, his voice low and raw and way too fucking sexy, and gets his mouth back on Stiles' dick like it's done something to personally offend him. Stiles leans against the wall and rolls his hips - carefully at first and then, when Derek makes an impatient, hungry noise, harder. Stiles fists his fingers in Derek's hair and fucks into his mouth over and over, panting harshly in the quiet of the den. He can feel his orgasm approaching, building swiftly in the arches of his feet and the small of his back.</p>\n<p>\"Derek,\" Stiles gasps, \"Derek, I - \"</p>\n<p>Derek grips at Stiles' hips like a lifeline and refuses to lift his head. Stiles bites down on a moan as he comes, back arching from the wall as he spills down Derek's throat. Derek holds him, licking at him until Stiles has to push him away, too sensitive. He sags against the wall, watching Derek get to his feet, licking come and spit from his lips, a predatory expression on his face. He leans in and kisses Stiles and Stiles can feel him, hard against his thigh.</p>\n<p>\"You want help with that?\" Stiles murmurs against Derek's lips, slipping his hands between them to free Derek's cock from the confines of his jeans and underwear. Derek exhales quietly as Stiles starts working at him, worrying at Stiles' throat with his teeth. Stiles doesn't even care that he's going to have bruises tomorrow because the quiet noises Derek's making are totally worth it. He's quiet when he finally comes, thrusting up into Stiles' fist a couple of times before he stills, breathing heavily. He's watching Stiles lick the come off his fingers, eyes heavy, when he lifts his head, gaze moving to the hall.</p>\n<p>\"What is it?\" Stiles asks. Oh, god, what if it's his dad? The room smells like sex, even to his nose, and it's not like there's any other reason for them to be standing in there in the dark.</p>\n<p>\"Sam,\" Derek says. \"She's awake.\"</p>\n<p>\"Oh,\" Stiles says. He can hear her too, faint calls of \"Daddy?\"</p>\n<p>Derek smiles, his teeth flashing white in the dim light, and leans forward for a lingering kiss before he straightens. \"I have to go take care of her,\" he says.</p>\n<p>\"Yeah, of course,\" Stiles says, gesturing with sticky fingers. \"I'm just gonna - wash my hands.\"</p>\n<p>Derek snorts softly and Stiles follows him down the hallway, splitting away to duck into the bathroom and wash his hands. When he comes out and goes into the living room, Derek's kneeling next to the couch, pulling the hood of Samantha's purple sweatshirt over her head.</p>\n<p>Scott comes into the house as Stiles is standing there watching. \"Hey, I was wondering where you guys - \" Scott stops, his nostrils flaring. \"Aw, dude, really? In my house?\"</p>\n<p>Derek at least has the decency to look embarrassed when he stands, but Stiles shrugs at Scott, grinning. \"I can only resist for so long, buddy.\"</p>\n<p>\"You're the worst,\" Scott declares. \"You're uninvited from all future barbecues, both of you. Not you though, Sammy,\" he adds, because Sam whines loudly. \"We like you here.\"</p>\n<p>Derek coughs roughly and says, \"I think we're going to head home. Sam, maybe Scott will take you to say goodbye to Allison?\" Scott nods and he and Sam disappear through the kitchen, the back door opening and closing behind them. Derek turns to regard Stiles for a long moment before saying, \"You're a bad influence.\"</p>\n<p>\"Hey, you're the one who insisted on getting us off at the movies,\" Stiles retorts. \"At least we were in a house this time.\"</p>\n<p>Derek snorts again but doesn't move away when Stiles steps up to him, winding his arms around his neck. \"You should come over for dinner,\" Derek tells him softly. \"You and Sam didn't really have a chance to get to know each other.\"</p>\n<p>\"I don't think she likes me,\" Stiles says doubtfully.</p>\n<p>\"She just needs to get used to you,\" Derek replies. \"She'll open up.\"</p>\n<p>\"I hope so,\" Stiles says. \"How about Tuesday? I'm working evenings the rest of the week.\"</p>\n<p>\"Tuesday's fine,\" Derek says, and leans in for a quick kiss as the back door opens again. When Scott comes back in with Samantha, Derek and Stiles are standing a couple of feet apart, playing innocent. Scott rolls his eyes, not fooled, but nudges Samantha toward Derek and says, \"Thanks for coming.\"</p>\n<p>\"Thank you for having us,\" Derek replies gravely.</p>\n<p>\"You know you're welcome here any time, right?\" Scott tells him. \"Not just Sam. You too.\"</p>\n<p>Derek regards him silently for a moment before nodding. He throws Stiles a tight smile and then leads Sam toward the front door. Stiles slides his hands into his pockets, listening to the door shut behind them and jumps, a little startled, when Scott says, \"You know, I think I underestimated both of you.\"</p>\n<p>\"Why's that?\" Stiles asks suspiciously.</p>\n<p>\"We've been inviting him over for years,\" Scott explains with a shrug. \"He's never stayed longer than half an hour. He'll leave Sam here sometimes, but he never hangs around. It's almost midnight now.\"</p>\n<p>\"Yeah?\" Stiles says, trying to sound casual.</p>\n<p>Scott shakes his head, not fooled. \"You're doing something right, dude. He looked <em>happy.\"</em></p>\n<p>\"I'm irresistible,\" Stiles quips.</p>\n<p>Scott shakes his head again. \"I don't know about that,\" he says with a snort, \"but you sure are something.\"</p>\n<p>-</p>\n<p>On Tuesday, Stiles goes home and showers after work, then heads over to Derek's house. He's a little nervous as he parks on the streets and walks up the driveway. Sure, he's been inside before, but this is official, somehow. He feels like he's here to meet Derek's family, even if 'family' is Derek's six-year-old daughter whom he's already met before. Jesus, his palms are sweating.</p>\n<p>Derek answers the door when Stiles knocks and he smiles softly at Stiles, the corners of his eyes crinkling. \"Hey,\" he says. \"You didn't get lost.\"</p>\n<p>\"I have a memory for details,\" Stiles says loftily, though really he looked Derek up in the county database to double-check his address. He raises his hand, showing Derek the bottle he's holding. \"I brought whiskey.\"</p>\n<p>Derek smiles slowly. \"Laced?\" he asks, and Stiles nods, grinning; he'd been sure to grab the aconite-infused brand. \"Are you trying to get me drunk?\"</p>\n<p>\"Maybe,\" Stiles teases.</p>\n<p>Derek's eyes flicker down his body and back up to his face. \"All right,\" he says and it's not fair, it's just not fucking fair what his face and his voice do to Stiles' body. He really might as well be a teenager for the way he gets a semi every time Derek speaks. Derek grins like he knows exactly what he's doing to Stiles and steps back. \"Come in.\"</p>\n<p>Stiles kicks off his shoes, adding them to the pile next to the door, and follows Derek into the house.</p>\n<p>\"You've seen the living room,\" Derek says, nodding to his left. Stiles can see Samantha sitting on the couch, bathed in the blue glow of a television. \"Dining room,\" Derek says, gesturing at the table as he leads Stiles through. \"And kitchen.\"</p>\n<p>\"This is really nice,\" Stiles says, setting the bottle of whiskey down on the counter. The kitchen's big, with a bank of windows that look out over the backyard. Stiles can see a patio and swing-set, and beyond that the yard slopes up to meet the forest. \"How'd you afford this place on a mechanic's salary?\"</p>\n<p>\"There was - money,\" Derek says haltingly and Stiles immediately regrets opening his mouth. \"From the insurance and my parents' wills. And Laura took Kate to civil court after the criminal trial and won damages.\"</p>\n<p>\"I'm sorry,\" Stiles says automatically, then winces. \"Look, you know you don't have to tell me stuff if you - if you think it's too private, right? I ask questions for a living and I'm kind of nosy anyway, but - you don't have to.\"</p>\n<p>\"I know,\" Derek says, after watching Stiles for a long moment. \"I don't mind.\" He turns as the doorbell rings, leaving Stiles standing in the kitchen. There's a weird warm feeling in his chest; he thinks that Derek probably doesn't open up to people too easily, so the fact that he's fine with telling Stiles such personal details is - it's awesome, but almost alarming. Like it's <em>too</em> easy.</p>\n<p>He pushes the thought aside when Derek comes back into the kitchen carrying a paper bag that smells like greasy food. \"I thought you were going to cook me dinner,\" Stiles teases.</p>\n<p>\"I never promised anything,\" Derek retorts, setting the bag down on the counter. He pulls it open and starts pulling out cartons of Chinese food, explaining, \"I can fix cars, but I can't cook. I can just about do chicken and that's it.\"</p>\n<p>\"You're going to be bummed you insisted going out to eat for our first date, then,\" Stiles informs him. \"Because I'm one hell of a cook.\"</p>\n<p>\"Are you?\" Derek looks like he doesn't believe Stiles.</p>\n<p>Stiles hesitates before speaking next, but Derek's been so open with him that Stiles feels like he has to level the playing field slightly, so he says, \"My mom died when I was twelve.\" Derek casts him a sharp look, heavy eyebrows drawing together. He doesn't speak, though, and Stiles continues, \"My dad was elected sheriff a few months before she died so he was gone a lot and it was just me in the house most of the time. She taught me how to cook as a kid, just simple stuff, and she left some recipes behind when she died.\" Stiles shrugs, smiling faintly at the memory. \"I went from there, teaching myself how to cook.\"</p>\n<p>\"You'll have to show me,\" Derek says. His face is open, understanding and Stiles steps up beside him, bumping his shoulder against Derek's.</p>\n<p>\"Are we gonna eat or what?\" he asks.</p>\n<p>\"Getting hungry?\" Derek teases, but he turns his head and calls, \"Sam! Dinner!\" before turning to grab plates out of the cupboards.</p>\n<p>Samantha comes trotting into the kitchen but slows when she sees Stiles, eyes narrowing. Stiles tries not to go tense; it's not like he's afraid she's going to kick him again, but he's nervous - he wants her to like him. Sam stares at him for a long moment before scooting over toward Derek. Interestingly, instead of getting Derek between herself and Stiles, she stands between him and Derek, like she's trying to protect Derek from him.</p>\n<p>\"Say hi to Stiles, Sammy,\" Derek says absently, pulling a pitcher of water out of the fridge.</p>\n<p>\"Hi Stiles,\" Samantha says grudgingly, and makes it sound more like <em>fuck off</em> - pretty hardcore for a six-year-old.</p>\n<p>\"Hey, Samantha,\" Stiles says awkwardly. God, what are you supposed to <em>say</em> to kids? Before he can even think of anything, Samantha turns her back on him, plastering herself against Derek's side.</p>\n<p>Stiles watches Derek smooth a hand over the top of her head, an absent, practiced movement, and then he picks up the pitcher of water and asks, \"Can you take this outside for me?\" Samantha nods seriously and he places the pitcher in her hands. She heads for the back door as Derek loads a tray with the food cartons. He picks it up and nods at the plates. \"You want to grab those?\"</p>\n<p>\"What about the booze?\" Stiles laughs, grabbing the stack of plates. \"Palate cleanser?\"</p>\n<p>\"That's our dessert course,\" Derek snorts, leading the way outside. They spread the food out on the patio table and help themselves. It's a nice night; they're getting to that part of the year where the darkness comes early, but it's a warm evening. Stiles likes the calm; the street Derek lives on is not heavily traveled so there's just the noise of the forest, the sound of the wind stirring the leaves.</p>\n<p>\"What do you guys do on full moons?\" Stiles asks curiously. \"I asked Scott once and he said he and Allison get super hor - \" He catches himself just in time, remembering Samantha's there. \"Uh. You know.\" He makes a vaguely vulgar gesture with his hand. \"Do you spend it with your pack?\"</p>\n<p>\"Sometimes,\" Derek says. \"There are a couple of moons throughout the year that we always celebrate together. Sometimes Sam and I will go out into the woods, just the two of us.\" He looks down at his daughter fondly and she pauses in the middle of making a mountain out of her pork fried rice to beam up at him. \"That's one of the nice things about having the forest right there,\" Derek adds, nodding toward the trees. \"It's a quick journey home once you get tired.\"</p>\n<p>\"Do you ever go alone?\"</p>\n<p>\"Not…often,\" Derek says, after a moment's hesitation. \"Pack is important. It keeps you strong.\"</p>\n<p>\"Oh,\" Stiles says thoughtfully. \"Sorry for all the questions. I've tried asking Scott, but he's not super enlightening.\"</p>\n<p>Derek shakes his head. \"He was bitten, not born,\" he says. \"He doesn't have the same mindset.\"</p>\n<p>\"Do you - \"</p>\n<p>\"Daddy,\" Samantha interrupts. \"Is Allison going to have a werewolf baby or another human like Tori?\"</p>\n<p>\"Don't interrupt,\" Derek tells her. \"And I don't know.\"</p>\n<p>\"Scott says he thinks it's going to be werewolf,\" Stiles says, mostly to Samantha. She gives him a disgusted look and digs her fork into her rice. Stiles looks at Derek instead and said, \"He said the baby kicks like crazy on the full moons.\"</p>\n<p>\"Doesn't guarantee anything,\" Derek says. \"My mother used to say my youngest brother went mad during the full moon, but he was born human.\"</p>\n<p>\"Was your father human?\" Stiles asks curiously. He knows from skimming the court records that Derek's mother was the alpha before Laura, but he doesn't remember much about Derek's dad.</p>\n<p>\"Grandma was the alpha,\" Samantha informs Stiles haughtily. \"Grandpa was a beta.\"</p>\n<p>\"It happens,\" Derek adds with a shrug. \"Sometimes it's like two werewolves cancel each other out; there's no guarantee the child will be born a werewolf. It's rare, but it does happen.\" He gives Stiles a considering look. \"Are there any weres in your family?\"</p>\n<p>\"I've got a cousin who sought the bite after he turned eighteen,\" Stiles replies after a moment of thought. \"He was accepted into a pack down near Santa Barbara, though, so I don't see him much.\"</p>\n<p>Derek nods, watching Samantha hop out of her chair and head for the swing-set before asking Stiles, \"Have you ever thought about seeking the bite?\"</p>\n<p>\"I've thought about it,\" Stiles tells him. \"I was scared of it when I was a kid. I didn't understand how it worked; I thought it meant someone would come into your house at night and turn you while you slept. Got it mixed up with <em>Dracula</em>, I guess. I thought about it for a while when I was in college but - I don't know.\" He shrugs. \"I wouldn't be upset, exactly, if it happened, but I know myself pretty well at this point, and I'm happy with who I am.\"</p>\n<p>\"That's a good answer,\" Derek nods.</p>\n<p>\"What about you?\" Stiles asks, a teasing note entering his voice. \"Ever thought about being a weak little human?\"</p>\n<p>\"Not even once,\" Derek shoots back, snapping his teeth together. He gets to his feet and stretches - Stiles can hear something in his spine pop before he straights and gathers the plate off the table. Stiles half-rises, reaching for the now mostly empty cartons of food, but Derek shakes his head. \"Relax,\" he says.</p>\n<p>Stiles watches him head inside and then swings around, looking out over the backyard. The sun's dipped below the horizon down, casting the backyard in shades of dark blue and purple. He can see Samantha playing in the sandbox next to the swing-set; he can hear her talking to herself. He twists back around, idly picking a piece of orange chicken out of one of the cartons. He's full of food, happy. He and Derek are going to get drunk and, judging by the way Derek eyed him when he arrived, Stiles is pretty sure there's another mind-blowing orgasm in his future and he is so very down with that.</p>\n<p>A couple minutes slip by. The house is dark but Stiles can hear Derek moving around and then nothing. He pulls out his phone, flicks through Facebook, then lifts his head when he realizes it's <em>quiet</em>. He can't hear Derek moving around inside, and he can't hear Samantha playing. A bad feeling settling in his gut, Stiles twists back around. Samantha's not in the sandbox any more, but there's someone standing in the shadows behind the swing-set, and they're holding a struggling child-size figure in their arms.</p>\n<p>Stiles doesn't even stop to think; his training and instincts kick in and he's out of his seat before he even realizes what's happening, pelting up the lawn toward the dark figure, who surges toward the forest. It's a man with white hair and as Stiles draws near he realizes it's Gerard Argent with Samantha in his arms, one hand clamped over her mouth.</p>\n<p>\"Bite him!\" Stiles yells, quickly closing the distance between them. \"Bite him, Sam!\"</p>\n<p>She must do what he says because Gerard Argent howls in pain and throws her to the side. Samantha hits the ground with a whimper but Stiles doesn't slow; he throws himself forward and catches Argent around the middle, slamming him into the ground. Stiles is on him immediately, bringing his hands behind his back and reaching for his handcuffs before he remembers that he's not on duty.</p>\n<p>\"Sam,\" Stiles pants, clamping his knees against Gerard's ribs as the man bucks and swears underneath him, \"go get your - \"</p>\n<p><em>Dad,</em> is what he's going to say, but he's interrupted by the sound of the backdoor slamming open. Derek's on the back stoop and he <em>roars,</em> the sound vibrating up Stiles' spine, his skin breaking out in goosebumps at the pure animal fury of it. Derek doesn't stop there, though - the sound's barely out of his mouth before he's flying across the lawn toward them, fully shifted, eyes burning bright blue. Stiles starts to relax until he realizes Derek's getting close and he's not slowing down - he's got a split second to brace himself before Derek plows into the both of them. Stiles gets thrown off Gerard and goes tumbling across the grass, his ribs blazing in sudden, burning pain. He has to get up, though, has to move because Derek's on top of Gerard, slamming his fist into Gerard's face, and Stiles has to stop him because there's self defense and there's assault and Derek's already crossed the line.</p>\n<p>\"Derek,\" Stiles wheezes, shuffling close. \"Der, you gotta stop.\"</p>\n<p>Derek whips his head around and snarls at Stiles, who freezes. He's not sure Derek's listening, not sure if he's operating under total human control. His eyes flicker over to Samantha, who's crying, her eyes burning gold. Stiles takes a deep breath - which <em>hurts</em> his ribs, holy fuck - and does something very stupid; he lunges toward Derek and gets his hand around Derek's throat. He doesn't squeeze, just keeps his fingers tense against his skin and says, \"Derek, <em>stop.\"</em></p>\n<p>The strange thing is, Derek does. His lip curls back from his teeth in a snarl, but then he looks up at Stiles and his eyes stop glowing, his furious expression fading to something unreadable.</p>\n<p>\"Take Sam and go inside and call the station,\" Stiles tells him, letting his hand drop to his side. \"Tell them I'm here and he - \" He jerks his thumb at Gerard. \" - is not going anywhere.\"</p>\n<p>Derek hesitates, but only for a moment. He climbs off Gerard, scoops up Samantha, and trots across the lawn and back into the house.</p>\n<p>\"I'll make you pay for this,\" Gerard hisses.</p>\n<p>\"Yeah, I'm real impressed,\" Stiles says scornfully. \"You just bought yourself a shit-ton of jail time, buddy, nice going.\" Gerard seethes, but Stiles ignores him, sitting back on his heels and reciting the Miranda rights. This doesn't stop Gerard from talking but Stiles tunes him out, keeping one eye on him and one eye on the house. The lights are on inside now; he can see Derek moving around the kitchen, holding Sam on his hip.</p>\n<p>It's a scant few minutes before his fellow deputies arrive; there are no sirens, but he sees the lights coming up the street between the houses, and watches Derek leave the kitchen to go let them inside. Stiles is happy to hand Gerard off to Deputy White, who slaps on a pair of handcuffs and leads him around to the front of the house. Deputy Finch takes his statement; she doesn't really like Stiles all that much, but she looks sympathetic when Stiles tells her about Samantha.</p>\n<p>It's nearly an hour before the deputies leave. Night has well and truly fallen as Stiles walks back toward the house, a nervous churning in the pit of his stomach. Derek's standing on the back steps with Sam still in his arms and Stiles can't see the expression on his face with the light coming from behind him in the house, but he's nervous. The method he used to get through to Derek was taught at the academy as a technique to control betas and he's worried he's offended Derek by forcing him to submit.</p>\n<p>Stiles stops at the bottom of the stairs and looks up at Derek, swallowing. The back door's hanging off its hinges and Sam looks like she's asleep, but all he can see of Derek is the firm set of his jaw. He turns abruptly, not saying a word, leaving the doorway open. Stiles hesitates for a long moment before going up the steps and closing the door as well as he can behind him. By the time he gets into the kitchen, Derek's not in sight. Stiles moves forward cautiously, through the dining room and into the front hall. He cranes his neck but Derek's not in the living room either.</p>\n<p>Stiles stands there for a few awkward minutes, wondering if he's been dismissed. He's just decided to get his shoes back on and leave when he hears footsteps coming down the stairs. Stiles pauses, nerves jangling up his spine when Derek rounds the corner from the living room. His face is carefully blank. Stiles has to force himself not to back away.</p>\n<p>\"Derek,\" Stiles says when Derek gets near. \"I'm sorry, I shouldn't have - \"</p>\n<p>But Derek's shaking his head as he steps into Stiles' space, hands coming up to catch him by the hips. \"Thank you,\" he says softly.</p>\n<p>\"I - what?\" Stiles asks, bewildered. \"You - but I - \"</p>\n<p>\"Thank you,\" Derek repeats, tilting his head forward to press his forehead against Stiles'. \"For stopping me. The last thing Sam needs is both of her parents in jail.\"</p>\n<p>\"It's not going to happen again,\" Stiles says, and hastens to add when Derek lifts his head, \"Gerard, I mean. He violated the restraining order and tried to kidnap Samantha. You won't see him again for a long time.\"</p>\n<p>\"Good,\" Derek rumbles. He tilts his head, nosing along Stiles' cheek. \"Are you all right? I slammed into you pretty hard. I'm sorry.\"</p>\n<p>\"I may have re-broken some ribs,\" Stiles admits. His chest feels like it's on fire; every intake of air is like a knife twisting in his side.</p>\n<p>\"Sorry,\" Derek says, sounding upset.</p>\n<p>\"No, it's not, <em>oh,\"</em> Stiles says when Derek slips a hand under his shirt, his fingers splaying out against Stiles' ribs. He tilts his forehead against Derek's cheek, watching black veins lick up Derek's forearm. \"Jesus, that's better than morphine.\"</p>\n<p>\"Stay here tonight,\" Derek murmurs into his hair. \"You said you're working night shifts, right?\"</p>\n<p>\"I can't get rowdy,\" Stiles says sadly. \"I might actually die.\"</p>\n<p>Derek huffs out a laugh, the hand that's not pulling pain from Stiles coming up to run through his hair. \"Just stay with me,\" Derek says softly. \"I'll take care of you.\"</p>\n<p>Stiles really likes the sound of that. He puts on the brakes, though, as Derek leads him into the living room and says, at Derek's inquisitive look, \"I want some of that whiskey.\"</p>\n<p>Derek laughs, full-throated and rich, and says, \"Good idea. You head upstairs and I'll grab it.\"</p>\n<p>Stiles nods his agreement and heads up the stairs, careful not to jostle his ribs too badly. He stops at the top of the stairs, looking around. Derek's house is smaller than it seems from the outside; there's just three bedrooms and a bathroom upstairs, none of any great size. One bedroom appears to be a guest bedroom, decorated with a twin bed and little else, while one of the other's is Sam's room. He can see her curled in her bed, surrounded by stuffed animals.</p>\n<p>He heads for Derek's bedroom, which is the biggest of the three. It's sparsely decorated, clearly lived in by a man who does not know or care about interior design, but it's cozy anyway, the light soft. His bed looks like heaven, covered in a huge, puffy eiderdown he can't wait to sink into - the other details of the room can wait until morning.</p>\n<p>Derek comes up behind him while he's still standing halfway through the door, lost in thought. \"You going to go in?\" he asks, sounding bemused. Stiles shoots him a dirty look and moves into the room, shuffling toward the bed.</p>\n<p>\"Which side do you sleep on?\" Stiles asks, unbuttoning his flannel.</p>\n<p>Derek grins. \"I usually end up in the middle. Here,\" he adds, handing Stiles the bottle of whiskey. \"Take a shot of that. It'll dull your pain.\"</p>\n<p>\"Sure thing,\" Stiles says cheerfully, taking a large swig straight from the bottle. He winces at the burn - not from the alcohol, but the wolfsbane tainting the flavor. \"If I say anything really weird in my sleep it's because of the wolfsbane, all right?\"</p>\n<p>\"All right,\" Derek agrees, taking the bottle back and swallowing a mouthful. \"You need any help getting your clothes off?\"</p>\n<p>\"I - \" Stiles lifts his arms cautiously and winces at the pain that flares up his sides. \"Just my shirt, I think.\"</p>\n<p>Derek steps forward and slides his warm hands up Stiles' sides before his fingers curl around the hem of Stiles' shirt and he gently pulls it over Stiles' head. \"You should probably go to the hospital.\"</p>\n<p>Stiles shrugs and regrets it. He shuffles toward the bed, unbuttoning his jeans as he says, \"I'll sleep on it, see how it is in the morning. Sometimes it's just on the surface.\"</p>\n<p>Derek nods and moves around to the other side of the bed, setting the bottle of whiskey down on the nightstand and tugging back the comforter before pulling off his own shirt. Stiles sits on the edge of the bed to kick off his jeans, then carefully lowers himself down onto the mattress. His bones ache in protest, but Derek's bed is soft and he sinks in deep, humming in content despite the pain. The mattress dips as Derek slides in next to him and Stiles shifts closer to him, his hand coming out to curl around Derek's.</p>\n<p>\"Was Sam okay?\" Stiles asks, because in all the commotion since Gerard appeared, he hadn't had a chance to find out.</p>\n<p>Derek's silent for a moment, a considering look on his face as he passes Stiles the bottle of whiskey. \"She was scared,\" he says finally. \"I'm surprised she's not sleeping in here - don't be surprised if you wake up and she's climbing in bed with us.\"</p>\n<p>\"He's a fucking asshole,\" Stiles says, taking a swig from the bottle, his eyes drifting closed as Derek begins pulling pain from him, heat flowing from his chest and down his arm into Derek. \"Scaring a little girl like that.\"</p>\n<p>\"I told you,\" Derek replies quietly. \"He doesn't think of us as people.\" He shifts onto his side and places his other hand on Stiles' stomach, which contracts and relaxes under his touch as he pulls more pain from Stiles.</p>\n<p>\"Don't hurt yourself,\" Stiles slurs, absently setting the whiskey on the nightstand, his limbs like jello.</p>\n<p>\"It doesn't last,\" says Derek. He shifts closer to Stiles, the tip of his nose pressing into Stiles' shoulder. Stiles cracks open a heavy eyelid to look at him. Derek's got his eyes closed, his expression loose and unworried. It occurs to Stiles that unless Derek's been bringing home hook-ups - and that's totally fine; he went through a period of one-night stands himself - though Derek doesn't seem like the type who'd be into that - in all likelihood Stiles is the first person he's shared a bed with in more than six years. His chest floods with warmth once more and he reaches out, carding his fingers through Derek's thick black hair. Derek makes a quiet noise of pleasure, lifting his chin to rub his stubbly cheek against Stiles' bare shoulder. It burns a little, the bristle on Derek's jaw reddening Stiles' pale skin, but it's an affectionate gesture, one Stiles will gladly accept.</p>\n<p>Stiles isn't sure what he's done to earn such trust from Derek. If anything, he's the one who should be showering Derek in affection; Derek's the one who fixed his car for free, who paid for dinner, lunch, the movies, who keeps taking his pain. He wants to treat Derek just as well, wants to spoil him stupid, wants to keep that warmth in his eyes.</p>\n<p>Stiles sighs as some of the pain comes back; Derek appears to have fallen asleep, his breathing slow and steady. Stiles doesn't stop scratching at his scalp, though; he keeps up the mindless movement of his fingers until he too falls asleep. It's such a small thing, but if it makes Derek happy then that's enough.</p>\n<p>-</p>\n<p>When Stiles wakes in the morning, the room is soft with golden light. He’s warm and comfortable and when he shifts around he’s relieved to find that there doesn’t seem to have been any lasting damage to his ribs because they’re only vaguely sore. He feels around, not ready to get up yet, but the bed’s empty beside him. Stiles cracks open a finger to be sure and yep – Derek’s gone. He’s not bothered, though, even if the space next to him is cold, like Derek’s been gone a while. This is Derek’s house, after all; if Derek wanted him gone, he would have woken Stiles up.</p>\n<p>Stiles sighs peacefully and lets himself sink back into sleep. It’s acceptable, he thinks, as he sinks back into unconsciousness. He’s working late tonight; gotta be rested for that.</p>\n<p>The next time he wakes, the light isn’t so soft; it’s the brighter, whiter light of mid-morning. The window is half open, letting a cool breeze roll in; he can hear cars passing on the street outside, a couple of women talking as they walk past. Derek’s back next to him, curled against Stiles’ side, and Stiles smiles drowsily, feeling utterly content. He spends a few tranquil minutes watching Derek sleep, taking in all the tiny details he’s never had a chance to see before, drinking in the way Derek’s dark lashes rest against his skin, the way the frown lines on his forehead smooth out in slumber, the creases at the corners of his mouth gone slack. There’s a pale scar below Derek’s cheekbone, barely visible, and Stiles wonders what it’s from – he wasn’t aware that anything could scar a werewolf. He brushes the tips of his fingers against it, just barely touching, and Derek shifts in his sleep, lips parting with a quiet noise.</p>\n<p>Eventually, though, Stiles has to rise – his bladder demands it – which gives him the chance to poke around the bathroom. There’s nothing incriminating, to his disappointment, though he’s fully prepared to pretend that the Cinderella toothbrush is Derek’s and tease him mercilessly for it. That reminds him that he’s probably got awful whiskey-morning breath so he borrows some toothpaste, using his finger to rub it over his teeth before rinsing out his mouth and heading back to the bedroom.</p>\n<p>Derek’s awake when he comes back, his eyes half open to watch Stiles lower himself back into the sheets. It kind of hurts; his ribs flare with a pain that settles into a dull ache as he reclines among the pillows. Derek doesn’t miss it; his eyes are sharp when he murmurs, “You all right?”</p>\n<p>“Yeah,” Stiles sighs, “just getting old.”</p>\n<p>Derek snorts, but he still reaches out and slots his fingers over Stiles’ ribs, leeching pain from him like a sponge.</p>\n<p>“That is so not necessary,” Stiles mumbles, body melting under Derek’s touch. “It doesn’t hurt that much.”</p>\n<p>“I like helping you,” Derek replies placidly.</p>\n<p>“You’re the best,” Stiles says, bumping his knuckles against Derek’s shoulders. “Where’s your daughter?”</p>\n<p>“I brought her to school.”</p>\n<p>“Oh,” Stiles says comfortably. “That’s where you went. I woke up and you were gone.”</p>\n<p>“And yet you didn’t leave,” Derek says gravely, though there’s light sparkling in his eyes.</p>\n<p>“Nope,” Stiles retorts smugly. “I’ve come to discover that your bed is a lot more comfortable than my own, so I’m laying claim to it.”</p>\n<p>“Hm,” Derek says thoughtfully. “You sure that’s a good idea, going after a werewolf’s territory?”</p>\n<p>“We don’t have to fight over it,” Stiles says diplomatically. “Not if you want me here.” He pauses. He only said that because he was just rolling with the conversation, but it sounds like a lot more than just that a light-hearted joke.</p>\n<p>“I do,” Derek says simply, like it’s that easy. Maybe it is, and Stiles needs to stop over-thinking things. They’re both adults; they’re allowed to be forthright about what they want. Derek looks at Stiles thoughtfully, absently dragging his fingernails against Stiles’ skin in a barely-there way that makes Stiles prickle with goosebumps. “I think you impressed Sam,” he says after a moment. “She had a lot of questions about cops this morning.”</p>\n<p>“And you didn’t wake up the expert to let him answer?” Stiles asks, nudging Derek in the ribs.</p>\n<p>“I told her the <em>expert</em> needed to sleep in after his heroics,” Derek replies. He turns his head, nuzzling into Stiles’ shoulder, but Stiles is suddenly uncomfortable, remembering the night before. He remembers his hand on Derek’s throat and the unreadable expression on Derek’s face. Derek seems to sense that something’s wrong because he pauses in the middle of rubbing a very red patch into Stiles’ skin with his stubble and asks, “What’s wrong?”</p>\n<p>Stiles hesitates before saying, “I know you said it was all right, but I need to know the truth. Last night, when I stopped you, I touched your throat – “</p>\n<p>“Stiles, it’s fine,” Derek says simply. “You stopped me from getting myself into trouble.”</p>\n<p>“Yeah, I know you said that,” Stiles says anxiously, “but I just - I feel like I crossed a line. That’s a control technique and I don’t want you to think that I’m - that I’m trying to control you.”</p>\n<p>Derek rolls onto his stomach, one of his arms bracketing Stiles’ waist. He looks at Stiles, his pale eyes watching Stiles’ face carefully. \"Why? Because you were acting as a cop or as my boyfriend?\"</p>\n<p>\"I - \" Stiles swallows. \"I don't know.\"</p>\n<p>\"You were protecting me and mine,\" Derek says calmly. \"That's all that matters to me.\"</p>\n<p>\"I just know that that's a - I don't know, kind of a sensitive area?\" Stiles hazards, his cheeks flushing under Derek's steady gaze.</p>\n<p>“You’re not just anyone,” Derek says, his gaze flickering down to Stiles’ lip. “You can touch me like that.” Derek’s eyes are heavy, half-closed, fingers doing endless circles on Stiles’ skin. “If it had been anyone else, I probably would have gone after them instead.”</p>\n<p>“Did I break you?” Stiles asks quietly, his throat dry, and Derek’s hand stills.</p>\n<p>“No,” he says. “I want to submit to you.”</p>\n<p>Stiles swallows and his throat clicks loudly. “Jesus.”</p>\n<p>Derek blinks like he’s coming out of a daydream. He looks self-conscious suddenly, uncertain. “If that – “</p>\n<p>“No,” Stiles says hoarsely, shaking his head. “No take-backs, dude. You confessed that fair and square.”</p>\n<p>The corners of Derek’s mouth twitch. “And?”</p>\n<p>Stiles tilts his head, considering his words carefully. “This is important,” he says finally. “I really like you. I just want to be sure that I’m doing things right.”</p>\n<p>“You are,” Derek assures him. “You can do more. I’ve noticed how you avoid my neck when we’re kissing.”</p>\n<p>“I don’t want you to think – “</p>\n<p>“I want you to,” Derek tells him plainly. He repeats, softer, “I want you to.”</p>\n<p>“Okay,” Stiles agrees, relaxing a little. “I think I can handle that.” Derek smiles, his eyes crinkling up at the corners. Stiles lifts a hand, scratching his fingers through Derek’s hair, his body singing at the contact. Derek sighs softly, settling a little heavier against him – though Stiles notes he’s careful not to put any weight on Stile’s ribs. “So,” Stiles says, licking his lips. “You called me your boyfriend.”</p>\n<p>Derek pauses, his eyes narrowing as he apparently rewinds their conversation in his head. “I did,” he eventually agrees.</p>\n<p>“Did you mean it?”</p>\n<p>Derek tilts his head to one side. “What do you think?” he asks. “Too soon?”</p>\n<p>“Maybe,” Stiles says thoughtfully, then grins. “But I don’t give a fuck.”</p>\n<p>Derek snorts, though a warm smile spreads across his face. He leans forward to kiss Stiles, teeth catching on his bottom lip before pulling back. “So this is okay?”</p>\n<p>“So okay,” Stiles breathes, curling a hand around the back of Derek's neck to pull him back down. Derek moves obligingly, carefully straddling his hips, forearms bracketing either side of Stiles' head. Stiles, now that he knows that he has permission - that Derek <em>wants</em> him to - <em>needs</em> to get his mouth on Derek's neck, so he tugs lightly at Derek's hair, angling his head just enough so that he can reach. Derek groans when Stiles' lip brush against his skin and Stiles grins into him, pleased by his reaction. He presses dry kisses down Derek's throat and when he flicks his tongue against the hollow between Derek's collarbones, Derek groans again, quiet and almost pained.</p>\n<p>Stiles wishes his ribs didn't hurt so bad, because he'd like to flip them, to suck and bite and kiss at Derek's skin all day. It's harder when he has to crane his head upward; his ribs still ache. He sighs softly when Derek shifts against him and he can feel how hard Derek is. He wants to fuck, or get fucked, and he can't imagine it being bad with Derek. He does his best anyway, digging his teeth into Derek's pulse while he gets a hand between them, rubbing at Derek over his cotton briefs. Derek swears, his hips jolting at the touch. Stiles realizes that even though they've shared two orgasms so far, he hasn't seen Derek's dick yet and he wants to, he really wants to.</p>\n<p>So Stiles curls his fingers around the band of Derek's underwear, tugging them over the curve of his ass, and Derek rears back long enough to pull them down the rest of the way. He pauses there, looking down at Stiles with his cheeks flushed, his expression content. Stiles wonders if he ever shifts when he's having sex and he shudders, a little thrill rushing down his spine. Is he into that? Jesus, it's not something he's ever considered, but he thinks he might be.</p>\n<p>Derek's eyes go dark at the way Stiles shivers and he goes for Stiles' boxers, bending to suck a bruise over his hipbone before sinking back down on top of him. Stiles exhales roughly at the contact, at the pure feeling of skin on skin, and he lifts his hips just to feel Derek's cock against his, moaning at the friction. Derek makes a strangled noise and bends his head, latching onto Stiles' collarbone while Stiles reaches out again, getting his hand around both their cocks. Derek groans into the hollow of his throat, his big fingers folding over Stiles'. He presses his forehead to Stiles' shoulder, bending to watch their hands move and Stiles' can't believe how hot it is, watching Derek watching them get off. He thinks about how enthusiastic Derek was when he was blowing Stiles and knowing just how <em>into</em> them Derek seems is too much; he sucks in air as he comes, his free hand scrabbling to grip at Derek's hair.</p>\n<p><em>\"Jesus,\"</em> Derek groans, dick pulsing hot against Stiles' hand as he follows, his come joining Stiles' to streak his stomach white. Stiles watches dazedly; he's never felt like his orgasm was such a communal effort before and he's super into it, to be honest.</p>\n<p>He scratches his hand through Derek's hair and says, \"You're fucking amazing, you know that?\" Derek makes a noncommittal noise, but the tips of his ears go pink and without making eye contact, Derek slips down Stiles' body, settling between his legs. \"What are you - <em>oh,\"</em> Stiles cuts himself off as Derek licks a thick stripe across his stomach, cleaning the wet mess there. \"Are you - are you into that?\"</p>\n<p>Derek glances up at him, his expression serene, but his eyes flash blue and - yep, Stiles is totally into that. If he hadn't just come, he'd be hard again - and as it is, his dick's giving it a valiant try.</p>\n<p>When Derek's licked him clean, he moves back up the bed, dropping down beside Stiles, hooking a leg over his. Stiles twists slightly, shifting his shoulders against the pillows so he can look at Derek. Derek gazes back, his eyes heavy-lidded. He looks content and Stiles smiles.</p>\n<p>\"You <em>are</em> amazing,\" Stiles tells him again, and it's so satisfying to watch the way Derek's face flushes.</p>\n<p>\"Cut it out,\" Derek mutters, breaking eye contact. Stiles grins and reaches out, gently brushing his fingers against an already-fading bruise on Derek's neck. Derek turns his head, playfully snapping at Stiles' fingers before pushing himself up onto his elbows and asking, \"You want some breakfast?\"</p>\n<p><em>\"Yes,\"</em> Stiles replies decisively.<em> \"Please.\"</em></p>\n<p>Derek snorts and pulls himself out of bed and Stiles watches him move around the bedroom appreciatively before sitting up - with only a dull pulse of painful protest from his ribs - and fishing around for his phone. It's already nearly eleven and he's got several missed calls from the station, plus a text message from his father that says <em>Need you in to answer q's about last night.</em> He sighs and Derek looks up from where he's pulling on a pair of pants.</p>\n<p>\"Something up?\"</p>\n<p>\"We'll have to make breakfast quick,\" Stiles tells him sadly. \"I've got to go in to the station and talk to someone about last night.\"</p>\n<p>Derek frowns. \"Are you in trouble?\"</p>\n<p>\"I doubt it,\" Stiles replies, twisting to plunk his feet on the floor. Reaching for his underwear, he says, \"Multiple interviews aren't unusual, especially when there's a cop involved. Could be Argent's making a fuss. People always threaten to sue.\"</p>\n<p>Derek doesn't look placated. \"If he does - \"</p>\n<p>\"He won't,\" Stiles shrugs, not concerned. \"Considering what he was doing when he got caught, I don't think he's got much of a case. Do you?\"</p>\n<p>\"This isn't really my area of expertise,\" Derek says uneasily.</p>\n<p>\"So leave it to me,\" Stiles tells him, getting to his feet. He smiles at Derek, trying to look calming. \"Nothing's going to happen.\"</p>\n<p>\"All right,\" Derek says, still looking uncertain, but he doesn't press it further and they head downstairs.</p>\n<p>Derek makes a good breakfast; despite saying the previous night that he couldn't cook, he makes the best spinach omelet Stiles has ever had; it has <em>feta</em> in it.</p>\n<p>\"Can I hire you as my personal chef?\" Stiles asks dreamily, after he's cleared his plate.</p>\n<p>Derek gives him an amused looked. \"All I can do is breakfast food.\"</p>\n<p>\"That's all I need,\" Stiles grins. \"Nothing beats breakfast food.\"</p>\n<p>\"Not even sex?\" Derek deadpans.</p>\n<p>\"Not even sex,\" Stiles declares, and manages to keep himself from grinning for nearly five seconds. Derek snorts and knocks his knee against Stiles'.</p>\n<p>Before Stiles finally leaves a little while later, dragging his feet the entire time, Derek pins him to the wall by the front door and kisses him ferociously, hand twisted in the front of his shirt. It leaves him breathless and a little dazed and Derek looks extremely satisfied with himself. It takes all of Stiles' will not to say \"Fuck work,\" and spend the day wringing orgasms out of the both of them, but he manages to resist and get his shoes on.</p>\n<p>\"So-o-o,\" he says slowly, once he's straightened. He jams his hands in his pockets and looks at Derek. \"Can we do this again? Dinner take two, maybe? No Argents, I promise.\"</p>\n<p>\"I'd like that,\" Derek agrees with a slow smile.</p>\n<p>\"My turn to cook,\" Stiles says. \"I'll call you, all right?\"</p>\n<p>Derek nods and leans in for another slow kiss. \"Let me know you're not in trouble.\"</p>\n<p>\"Will do,\" Stiles grins. \"See you.\"</p>\n<p>\"Bye,\" Derek says softly, and he stands in the doorway and watches Stiles until he's in his car, raising his hand in farewell as Stiles drives off. Even when he's turned the corner and Derek's house is no longer in sight, Stiles still feels him watching and he grins like a maniac as he drives. God, it's fucking dumb, but he's in - he's all in.</p>\n<p>-</p>\n<p>Heading in for questioning is not as cut and dry as Stiles hopes. His dad comes out of his office when Stiles gets into the station and he looks pissed.</p>\n<p>\"Er,\" Stiles says when he sees the sheriff, stopping short. All his residual happiness from waking up with Derek that morning seeps away, replaced with unease. \"Dad?\"</p>\n<p><em>\"Sheriff,\"</em> his father snaps, and Stiles knows he's fucked something up. His father hooks a thumb down the hall and says, \"Interview room, <em>now.\"</em></p>\n<p>Stiles shuts his mouth and heads down the hallway with his dad on his heels, past the deputies' desks. Everyone sitting there looks at him sympathetically and Stiles frowns, frantically filtering through last night's events so he can figure out what he did. He thinks he played everything by the book - he stopped Derek from beating Gerard, at the very least, so where's the issue?</p>\n<p>Stiles pushes open the door to the interview room and pauses at the sight of the man sitting at the table. Stiles recognizes him as Reagan Whittemore, father of one of his enemies from high school and one of the town's most prominent lawyers.</p>\n<p>\"Fuck,\" Stiles mutters. He's had run-ins with Mr. Whittemore in the past - it's a small county and the man's got a lot of clients - but he really hasn't liked Stiles since he was in high school and Jackson ran his brand-new Porsche right into the side of Stiles' Jeep. The fact that his son was at fault, not Stiles, doesn't actually matter to a person like Mr. Whittemore, who's always looking for a reason to fight.</p>\n<p>Stiles sits on the side of the table opposite Mr. Whittemore and his father sits down heavily next to him, drumming his fingers against the tabletop. \"What's this all about?\" Stiles asks uneasily.</p>\n<p>\"Mr. Whittemore's representing Gerard Argent,\" his father tells him, looking very unamused. \"He wants to file a complaint against you.\"</p>\n<p>\"What?\" Stiles exclaims. \"What for? I did everything the way I was supposed to - \"</p>\n<p>\"According to my client, you told a <em>werewolf</em> to bite him!\" Mr. Whittemore interrupts coldly. \"Do I have to remind you, Deputy Stilinski, that there are laws in place specifically protecting werewolves from being used as weapons - \"</p>\n<p>\"Are you fucking kidding me?\" Stiles explodes. His dad grabs him by the arm but Stiles points his other hand at Mr. Whittemore and snaps, \"Your client attempted to kidnap a six-year--old girl and I did what I had to to protect her! I should have had Derek take her to the hospital because your client is fucking <em>poison</em>. You want to make a complaint? Do I have to remind <em>you</em> that betas can't turn people, you fucking moron?\"</p>\n<p>\"Stiles!\" his father says furiously. Stiles sits back in his chair, folding his arms across his chest with his cheeks flushed splotchy pink, but he keeps his mouth shut. His father turns to Mr. Whittemore, raising his eyebrows. \"My deputy may be out of line, Mr. Whittemore, but he has a point. Betas can't turn people.\"</p>\n<p>Mr. Whittemore scowls. \"My client was unaware of this. The stress - \"</p>\n<p>\"The werewolf that bit your client was his granddaughter,\" the sheriff points out. \"Feigning ignorance isn't going to work this time.\"</p>\n<p>Mr. Whittemore glares between the two of them before standing abruptly. \"I look forward to cross-examining you in court,\" he says icily. \"I'll be sure to mention your relationship with Derek Hale.\"</p>\n<p>\"Oh yeah?\" Stiles retorts. \"Then be sure to mention that I was off duty at my <em>boyfriend's</em> house when I stopped your client from abducting his granddaughter.\"</p>\n<p>Mr. Whittemore gives him a very sour look before striding out of the room, slamming the door behind him.</p>\n<p>\"I'm sorry,\" Stiles says immediately, the moment the door's shut. \"I didn't mean to lose my temper - \"</p>\n<p>\"Don't worry about it,\" his father says wearily, waving a tired hand. \"You know as well as I do that he's just trying to stir up trouble. Argent's just as bad; he spent all night yelling from his cell. I'll be glad to see them both gone.\"</p>\n<p>\"Is that what you called me down here early for?\"</p>\n<p>\"No, no, you just need to do a follow up interview with Knox,\" his dad sighs. \"Whittemore showed up five minutes before you did. If I'd known he was going to try that bullshit, I would have taken care of him myself.\"</p>\n<p>\"You're a good dad,\" Stiles says approvingly. His father rolls his eyes and smacks him on the back of the head and Stiles laughs. \"What? Should I have said boss? I'm not on the clock yet, am I?\"</p>\n<p>\"I suppose not,\" his father admits grudgingly. \"You did a good job last night, though. Taking Argent down and controlling a shifted beta?\"</p>\n<p>\"Derek wouldn't have hurt anyone,\" Stiles says uncomfortably.</p>\n<p>\"Tell that to Argent's black eye,\" the sheriff replies mildly. \"You're lucky he listened to you.\"</p>\n<p>\"Yeah, well, we kind of have an understanding,\" Stiles mutters, his cheeks going pink.</p>\n<p>\"Uh huh,\" his father says. \"Boyfriend, huh?\"</p>\n<p>\"I told you we were dating,\" Stiles says, avoiding his eyes.</p>\n<p>\"You didn't seem so sure when you reintroduced us the other night,\" his father says placidly. \"Figured that out, huh?\"</p>\n<p>\"Told you,\" Stiles squirms. \"We've got an understanding.\"</p>\n<p>\"Uh huh,\" his dad says again, and the tone of his voice suggests he has no desire for further clarification. \"Well. You go talk to Deputy Knox and then head on home. You're on late tonight.\"</p>\n<p>\"Yeah, thanks for that,\" Stiles sighs, getting to his feet. \"Glad to know you don't play favorites when you're making the schedule.\"</p>\n<p>His father chuckles unsympathetically as he follows Stiles out of the room. \"Get used to it, rookie.\"</p>\n<p>-</p>\n<p>After repeating his account of the previous night to Deputy Knox, Stiles heads back home and takes a nap in the sunny spot on the couch, Oscar curled on his chest like a heating pad. When he wakes in the late afternoon, he has a text from Derek, who asks <em>everything turn out all right?</em></p>\n<p>Stiles smiles faintly and replies<em> yeah, argents lawyer wants my ass but thats typical</em></p>\n<p>He receives a response fifteen minutes later while he's heating up leftovers for dinner. Stiles grins, his body flooding with warmth as he reads Derek's words. He can just picture Derek scowling as he punches out the message.</p>\n<p>\n<em>your ass is mine. don't let anyone else touch it.</em>\n</p>\n<p><em>i wont,</em> Stiles types back. <em>thats a promise.</em></p>\n<p>-</p>\n<p>Six night shifts in a row leave Stiles exhausted. He's stuck on front desk duty - Dad's attempt at soothing Mr. Whittemore, though it's really just for show; Stiles still has several weeks before he can get back on active duty anyway, thanks to his slow-to-heal ribs. It's deathly boring at night; the criminals of Beacon County seem to sleep with the rest of the population and the only calls he seems to get are noise complaints. The shift's longer, too - eight to eight, twelve hours instead of the normal eight, and it's not like he's even doing anything at work (mostly he just plays Candy Crush on his phone), but he still gets home weary and hateful of fluorescent light.</p>\n<p>He misses Derek. Stiles thinks it's phenomenally unfair that they agreed to the whole boyfriends thing and then immediately don't see each other for a week. They text, but Derek's slow to respond in the evenings, which Stiles understands - he's busy with his daughter and, y'know, being an adult - but it doesn't make things any easier. That's why, even though he's bone-tired by the end of the week, he still texts Derek after his final shift and asks <em>dinner tonight?</em></p>\n<p><em>yes</em> comes the almost immediate response and Stiles grins, rubbing a hand over his face. Derek must be up getting Samantha ready for school. <em>what time?</em></p>\n<p>Stiles counts on his fingers, trying to figure out how much time he needs to get some rest and still have enough time to make dinner. <em>six good?</em></p>\n<p>\n<em>great.</em>\n</p>\n<p>Stiles grins at nothing and heads for the grocery store to pick up food. It's quiet - he's never been to the store so early in the morning. Most of the other patrons look inappropriately chipper so early in the day, though Stiles spots a couple others like himself, rumpled clothing indicating the end of a long swing shift.</p>\n<p>He's gathered the ingredients for dinner when it occurs to him that he's not sure how picky Samantha is - she ate Chinese food like a champ, but who <em>doesn't</em> like Chinese food - so he grabs some dinosaur-shaped chicken nuggets (and fuck, he's not ashamed to admit he'll eat them himself if there are leftovers). It also occurs to him that his apartment's not particularly child-friendly - he's got video games, but nothing he'd let a six-year-old play - so he heads down the aisle with the greeting cards and the bad romance novels and grabs a coloring book and pack of crayons. That's good, right?</p>\n<p>Feeling proud of himself, Stiles goes home and sleeps until four and it's a blessed relief to wake up and know that he doesn't have to go in for another shift for a couple of days. He takes a luxurious shower and thinks about jerking off but doesn't; he's hoping he and Derek can slip away while Sam's watching tv or something.</p>\n<p>The food's in the oven and Stiles is cracking open a beer when there's a knock on the door. He puts the beer down and straights, nervously rubbing his hands on the front of his jeans. It's probably stupid to be so anxious, but this is the first time Derek's been in his apartment and just the fact that he has an apartment, not a house, makes him a little self-conscious. He cleaned, too, but now he's worried that Derek's super senses are going to pick up on things he missed. There was a weird smell in the place when he moved in that's never quite faded away and what if it smells god-awful to Derek?</p>\n<p>He worries about it right up until he opens the door and Derek's standing there, looking unfathomably attractive in an unzipped leather jacket, soft grey v-neck beneath. \"H-hi,\" Stiles squeaks, his voice going embarrassingly high.</p>\n<p>\"Hey,\" Derek returns quietly, the corners of his mouth curving up as his eyes flick up and down Stiles' body. Stiles flushes faintly; he's just wearing old jeans and a worn plaid button-up, but Derek must like what he sees because he leans across the threshold to kiss Stiles, one hand sliding up to curl around his neck, Derek's thumb pressing into his jaw.</p>\n<p>They pull apart slowly, Stiles suddenly aware that they're still standing in the doorway, Derek halfway in the apartment. Stiles grins at Derek. \"You wanna come in or just hang around in the hall all day?\"</p>\n<p>Derek smiles faintly, bumping against him as he steps into the apartment. Stiles goes to shut the door and pauses, realization washing over him. \"No Samantha?\"</p>\n<p>Derek turns, raising his eyebrows. \"Not tonight. Laura's taking the kids to the movies.\"</p>\n<p>\"Oh?\" Stiles teases. \"Sparing you from another princess tale, huh? What a martyr.\"</p>\n<p>Derek's lips quirked. \"That's what the alpha does.\" He swings his head around, nodding at the apartment. \"I like your place.\"</p>\n<p>Stiles snorts, jerking his head toward the bare walls. \"I've been living here three years and I still haven't hung anything on the walls. It's kind of just a place I stay when I'm not working.\"</p>\n<p>Derek looks at him, his eyes soft. \"I like it,\" he repeats. \"It feels comfortable.\"</p>\n<p>Stiles flushes, but a timer going off in the kitchen saves him. He dives for the oven as Derek follows, pulling a cookie sheet from the heat. Derek raises his eyebrows. \"Chicken nuggets and french fries? I thought you said you were a good cook.\"</p>\n<p>\"Shut up,\" Stiles says, his cheeks flooding with color again. \"I made food for us, but I thought Sam was coming and I didn't know if she'd like what I was making, so…\"</p>\n<p>He trails away at the expression on Derek's face; he's startled, but the expression quickly softens into something warm and liquid - just seeing it makes Stiles hot all over. His eyes fall to the side, where the coloring book and crayons sit on the counter, and he goes very still.</p>\n<p>\"Uh,\" Stiles says awkwardly. \"I thought - she might get bored, and - \" He's cut off by Derek, who surges forward, smashing their mouths together. Stiles makes a startled noise - he's still got an oven mitt on one hand, for fuck's sake - but Derek presses him back against the counter, hands firm around his hips. Stiles doesn't even bother pretending to fight it; he loops his arms around Derek's neck and pants roughly when Derek turns his head, sucking a line of bruises down his throat.</p>\n<p>They're interrupted by a second timer - this one's for the main dish - and Stiles has to push Derek away so he can get to the oven. Derek's reluctant to move; he keeps his hands on Stiles for as long as possible, his nostrils flaring as Stiles pulls the casserole dish from the oven.</p>\n<p>\"What is that?\" he asks curiously.</p>\n<p>\"Golabki,\" Stiles replies proudly. \"It's my grandma's recipe - meat and rice wrapped in cabbage leaves. Always a crowd-pleaser.\"</p>\n<p>\"It's…Polish?\" Derek offers, and Stiles nods.</p>\n<p>\"Got it on both sides of my family,\" he replies, setting the pan down on a burner. \"So, uh, what was that all about just now?\"</p>\n<p>Stiles glances over at Derek in time to see him look away, his cheeks flushing a faint pink. \"Sorry,\" he says. \"I just - it makes me happy. That you were thinking about Sam. What she would want.\"</p>\n<p>\"Dude, of course,\" Stiles says, warmth flooding his chest. \"I mean, we're a team now, right? And not just you and me - Sam too.\"</p>\n<p>Derek looks pleased beyond measure and leans in for another kiss, softer this time, and when he pulls away he doesn't go far, dragging his nose against Stiles' cheek and along his jaw. Stiles lets him do what he ants, enjoying the closeness of his body after a week apart. He's tempted to say \"Fuck dinner,\" and pull Derek into his bedroom, but eventually he gently pushes Derek away and says, \"You ready to eat?\"</p>\n<p>Derek nods, his eyes hazy, and they fill their plates and head to the living room. Stiles doesn't have a dining table but he doesn't really care because this leaves the couch and Derek sits right next to him, the sides of their bodies pressed together. Stiles watches Derek out of the corner of his eyes as they eat, a little nervous; he knows he's a good cook, but whether Derek will like it or not is a different story. After a few mouthfuls, however, Derek sets the plate against his thighs, his eyes half-shut.</p>\n<p>\"Let's make a deal,\" he says, and Stiles raises his eyebrows curiously. Derek glances over at him with a small smile and continues, \"I'll keep making breakfast if you keep on making dinner.\"</p>\n<p>\"Deal,\" Stiles says readily, grinning. \"You like it, then?\"</p>\n<p>\"It's delicious,\" Derek assures him solemnly, his eyes crinkling at the corners as he adds, \"I think Sam would have liked it too.\"</p>\n<p>Stiles smiles widely. \"Well, you can take some home for her.\"</p>\n<p>\"Thanks,\" Derek says quietly, bumping his knee against Stiles', and Stiles knows he's thanking him for more than just making them dinner.</p>\n<p>After they eat, they settle back onto the couch and watch a movie. Stiles slumps into Derek's side and he's so comfortable; he's full of food and Derek's warm next to him. Derek smells really good, Stiles thinks drowsily, and he keeps pressing his nose to Stiles' temple, inhaling softly against his skin. Stiles figures it's got something to do with werewolves because he's never had someone so interested in sniffing him before, but it's not like he dislikes it; on the contrary - it settles some nervous part of him that worried he didn't <em>fit</em> somehow, like the wild part of Derek's mind might reject him.</p>\n<p>\"I haven't just relaxed like this in a while,\" Derek says after a while. His voice is heavy, content. \"Not since college, I think.\"</p>\n<p>\"Oh yeah?\" Stiles hums. He could fall asleep like this and maybe he will. He doesn't think Derek would mind. \"What'd you major in?\"</p>\n<p>\"History,\" Derek replies, a touch derisively. He shifts them, slouching down so Stiles' almost on top of him, curling an arm over his stomach. \"Didn't spend a lot of time partying.\"</p>\n<p>Stiles settles himself down against Derek, folding his arm over Derek's. \"History nerd, huh? Why aren't you working in the field?\"</p>\n<p>\"Local jobs are hard to find,\" Derek says quietly. \"It's…I worked as an archivist at the history museum for a few years after I graduated, and that's where I met Kate. It's kind of tainted now.\"</p>\n<p>\"Shit,\" Stiles murmurs.</p>\n<p>Derek’s arm tightens around him. “Don’t worry about it,” he says softly, nosing against Stiles’ cheek.</p>\n<p>Stiles chews on his lip for a moment before saying, “You don’t have to answer this, but…what happened between the two of you?”</p>\n<p>Derek sighs. He doesn’t sound exasperated or annoyed, just tired. “We dated for a couple months. There was something about her that pulled me in. Moth to the flame,” he adds bitterly. “It took me that long to realize that that something wasn’t right with her, but it was too late by then. She’d been using me to learn about the pack and a couple weeks later…” Derek makes a vague gesture. “Half my family was gone.”</p>\n<p>“Shit,” Stiles says again, his heart clenching. “And Sam?”</p>\n<p>“She called me from jail,” Derek says. “Bragged about being pregnant. I think she liked the thought of having something of mine, another thing to warp. Even when Sam came out a werewolf, she didn’t care. I think she though Gerard would get her, but I made sure – I sued for custody and he’s been on our case ever since.”</p>\n<p>Stiles swallows. “And you don’t care? That Sam’s Kate’s kid?”</p>\n<p>“She’s <em>my</em> kid,” Derek replies fiercely. “She’s nothing like Kate.”</p>\n<p>“I know,” Stiles says, curling his fingers around Derek’s wrist. “I know.”</p>\n<p>Somehow they’ve sunk right into the couch and Stiles flips onto his stomach so he can look Derek in the eyes. “You’re a good person,” he says. “And a great father.”</p>\n<p>Derek flushes red but smiles faintly, one of his hands cupping the back of Stiles’ head, stroking through his hair. “Thanks.”</p>\n<p>Stiles returns his smile and turns, resting his head against Derek’s chest. He could’ve stretched up and kissed Derek and it’s not like he doesn’t want to, but he wants to show Derek that sex isn’t all he cares about, that he’s here for comfort and support and a quiet place where they can just <em>be</em>. He wants Derek to know that he’ll never do anything like Kate did.</p>\n<p>He doesn’t mean to fall asleep, but with Derek’s heart beating steadily under his ear, and one of Derek’s hands smoothing over his hair again and again, it’s better than a lullaby.</p>\n<p>Stiles wakes up later still on top of Derek, one of Derek’s arms curled around his shoulders. There’s something buzzing under his hip and Derek shifts with a disgruntled noise, getting a hand between them so he can pull out his phone. Stiles tilts his head, watching Derek’s face as he reads the message on his screen. “Everything all right?”</p>\n<p>Derek sighs, setting his phone down beside him and passing a hand over his eyes. “I’ve got to head out,” he says. “Sleepover at Laura’s isn’t going well.”</p>\n<p>Stiles frowns. “Is Sam all right?”</p>\n<p>“She’s been having nightmares since the other night.” Derek sighs again. “Sorry.”</p>\n<p>“Hey, it’s totally fine,” Stiles says hurriedly, sitting up. “Do you want me to pack up some food for you to take home?”</p>\n<p>Derek smiles faintly as he pushes himself upright. “I’d like that.”</p>\n<p>After Derek’s pulled his jacket back on and Stiles has handed him a grocery bag full of Tupperware containers, they linger by the door, Stiles watching Derek slip his shoes on.</p>\n<p>“Sorry I fell asleep on you,” he said.</p>\n<p>“I don’t mind,” Derek replies, giving him a bemused look. “Told you I hadn’t relaxed like this since college. I like spending time with you.”</p>\n<p>“Good,” Stiles grins, feeling pleased.</p>\n<p>Derek leans in for a slow kiss. “I’ve got to go rescue my daughter,” he says when he pulls back. “We’ll continue this later.”</p>\n<p>“Holding you to that,” Stiles replies cheekily. Derek snorts and Stiles watches him disappear down the hallway. Stiles feels like he’s made of light, floating on air. When he turns around, Oscar’s sitting on top of his bookcase, giving him a sarcastic look. “Shut up,” Stiles says, pointing a finger at him. “I know, I know.”</p>\n<p>-</p>\n<p>Another week trudges by. Gerard Argent gets his morning in court and the shock on his face when he’s sent to straight to jail to await trial on the attempted kidnapping charges – with no bail because he violated the restraining order Derek had on him – is <em>delicious</em>. It takes everything in Stiles not to smirk at Mr. Whittemore as he stalks out of the courtroom.</p>\n<p>He sees Derek a couple of times, but never for quite long enough – they go out to dinner with Sam and despite what Derek said about Stiles impressing her, she still doesn’t seem to like him all that much. He hangs out at Derek’s house after his shift one night and Samantha clings to Derek the entire time, though at least she’s stopped giving Stiles dark looks every time he even <em>thinks</em> about shifting closer to Derek.</p>\n<p>“Maybe she needs to spend some time with you without me being there,” Derek says later, after she’s gone to bed.</p>\n<p>“Are you kidding me?” Stiles asks, a little panicked. “I don’t know what to do with kids?”</p>\n<p>“You treat them like people,” Derek says, exasperated. “It’s not <em>that</em> difficult.”</p>\n<p>“Easy for you to say,” Stiles mutters. “I saw how Laura’s kids treated you like a jungle gym.”</p>\n<p>Derek snorts and rolls him onto his back and Stiles receives half a blowjob before he gets called in for an emergency shift directing traffic on the highway after a massive pile-up. It’s pouring rain and he’s uncomfortably aroused and decidedly unenjoyable.</p>\n<p>Derek makes it a hell of a lot better the next morning when he comes in at the start of Stiles’ second shift with soup. “Figured you might need something,” he says wryly.</p>\n<p>“Angel,” Stiles groans, rousing himself from his zombie-like state to look around warily. His dad’s not in his office, though, so Stiles leans across the desk and steals a quick kiss. “You’re my savior.”</p>\n<p>Derek leans on the counter, looking subtly pleased as Stiles peels the lid off the container and inhales the smell of chicken noodle. “Can I ask you something?”</p>\n<p>Stiles looks up sharply. “Yeah, of course.”</p>\n<p>“I – the full moon’s in a couple of days,” Derek says, looking a little nervous.</p>\n<p>“I know,” Stiles says with a faint frown. His dad always schedules more deputies on the days around full moons – werewolves or not, he says, the moon brings out the crazies. “What about it?”</p>\n<p>“We always get together at Laura’s before moonrise,” Derek tells him. “There’s food and stuff. Do you – would you like to come?”</p>\n<p>Stiles stares at him. Derek looks down at the desk, tapping his fingers against the counter. It’s a big deal that he’s asking, Stiles knows – it’d be a big deal even if he wasn’t a werewolf because meeting someone’s family is always a huge moment, but this is bigger because this isn’t just family; it’s <em>pack</em>. “I’m – I’m not a werewolf,” Stiles manages after a few seconds.</p>\n<p>“It doesn’t matter,” Derek says earnestly. “There are humans in the family – two of Laura’s kids are human.”</p>\n<p>“Okay,” Stiles agrees, because he can see that this means a lot to Derek and hell, it means a lot to Stiles that he even asked. “I’m working, but it’s another late shift, so I should have time. Just give me the details and I’ll be there.”</p>\n<p>“Thank you,” Derek tells him quietly and that soft, pleased look on his face makes it very hard for Stiles not to leap the desk and ravage him. But Stiles catches sight of his dad coming down the hallway and manages to keep himself still. Derek notices him too and says, “I’ll let you get back to work.”</p>\n<p>Stiles nods. “Let me know when you want me there, all right?”</p>\n<p>Derek nods in return, giving Stiles a swift smile before he disappears out the station door. Stiles turns to find, unsurprisingly, his father standing there with a couple of files in his arms, his eyebrows raised.</p>\n<p>“I wasn’t distracted,” Stiles says defensively.</p>\n<p>“I’m sure you weren’t,” his father replies, sounding completely unconvinced. “Everything all right?”</p>\n<p>“He brought me soup,” Stiles says, flushing, “and he wants me to hang out with his family on the full moon.”</p>\n<p>His dad’s face softens. “That’s a big step.”</p>\n<p>“I know.”</p>\n<p>His father shoves his free hand into his pocket. “You happy?”</p>\n<p>“Yeah,” Stiles says, flushing darker. “I really am.”</p>\n<p>The sheriff smiles as his son as he heads into his office. “That’s all that matters.”</p>\n<p>-</p>\n<p>Three days later, Stiles parks on the street in front of Laura’s grand house and gets out of his car to see Derek just getting out of his own car in the driveway. Derek waves at Stiles as he rounds the side of the car to let Sam out of the backseat. She hits the ground with a thump and tries to head toward the house, but Derek grabs her by the back of her jacket and says, “Hey, whoa, aren’t you going to say hi to Stiles?”</p>\n<p>Samantha gives her father an exasperated look, then turns to Stiles and her eyes flash gold when she sighs, “Hi, Stiles.”</p>\n<p>“Hey, Sam,” Stiles greets. Derek lets go of her shirt and she slingshots toward the front door, disappearing inside. “Progress, I think,” he says to Derek. “She didn’t sound like she wanted to rip my throat out, though she did flash her eyes at me.”</p>\n<p>Derek raises his eyebrows as he reels Stiles in by his belt loops. “That’s respect,” he says. “Not quite submission, but somewhere along the same lines.”</p>\n<p>“Oh,” Stiles says, straightening.</p>\n<p>Derek smiles and says, “You’re growing on her.” He leans in, nosing along Stiles’ temple, and Stiles grins, curling his fingers into the back of Derek’s shirt.</p>\n<p>“Hey.”</p>\n<p>“Hey,” Derek breathes. He tilts his head, coming in for a proper, albeit brief, kiss. “You’re working tonight?”</p>\n<p>“Yeah, at nine,” Stiles says. “Plenty of time to hang out.” He nods up toward the sky, which is turning the silky dark blue of evening. “Don’t you guys get antsy, all cooped up together inside while the moon’s rising?”</p>\n<p>“Not with the pack,” Derek says. “The pack’s stability. With so many of us, you can hardly feel the moon’s pull.”</p>\n<p>“Huh,” Stiles says thoughtfully. “Well, are we gonna go inside?”</p>\n<p>Derek nods, his eyes darkening. “You nervous?”</p>\n<p>“No,” Stiles says, surprised. “Should I be?”</p>\n<p>Derek shakes his head but it’s not Stiles who’s nervous, Stiles realizes once they get inside. It’s Derek. He keeps an arm around Stiles’ waist as Derek leads him down the front hall and Stiles can feel it in the tightness of his grip, the way his mouth’s gone firm around the corners.</p>\n<p>For a moment, it doesn’t make sense to Stiles, who’s never been the type of person who worries about meeting new people – it’s part of his job, after all – and Derek knows these people, his pack. And – oh. <em>Oh</em>. This is Derek’s pack; of <em>course</em> it’s important to him that they all like Stiles. Oh, god, he should have worn something nicer.</p>\n<p>Laura appears at the end of the hallway, her long dark hair piled on top of her head in a loose bun. “Hey, Der,” she greets cheerfully. “And Deputy Stilinski. Caught your man, I see.”</p>\n<p><em>“Laura,”</em> Derek says, sounding strangled.</p>\n<p>“Derek,” she replies, grinning sharply. “Don’t you try to police me. If he’s going to be sticking around, he’ll get to know how awful we are.” Laura winks at Stiles, who laughs, while Derek looks offended. “Come on, sweethearts. Food’s out back.”</p>\n<p>“Come on,” Stiles says to Derek, who looks like he’s going to be sick. “’s no big deal.”</p>\n<p>“Says you,” Derek mutters.</p>\n<p>“Relax,” Stiles says, leaning up to whisper in his ear, “We can take a sec for a quick bj if that’d make you feel better.”</p>\n<p><em>“Stiles,”</em> Derek says, sounding mortified. Somewhere beyond the hall, Laura cackles. <em>“Werewolves.”</em></p>\n<p>Stiles grins and shrugs, unabashed. “All right, so head’s okay at Scott’s picnic but not here. Got it.”</p>\n<p>“I like this one, Der!” Laura hollers.</p>\n<p>“Oh my <em>god,”</em> Derek says, and wraps his hand around Stiles’ arm, pulling him down the hall. “Let’s get it over with.”</p>\n<p>Stiles grins as they pass Laura, who’s bringing a bowl full of chips out from the kitchen. She winks.</p>\n<p>It’s fun, though. Derek introduces Stiles to every member of the pack – he already knows Isaac, but there’s Cora, Derek’s younger sister, and Laura’s husband Tim, who came from a pack in the Midwest. He’s got a drawl like a cowboy. Stiles is highly amused to see that the kids <em>love</em> Derek. All of them – including Sam – rush him when they step out onto the back patio and his heart melts at the way Derek laughs. There seem to be more kids than he thought and it turns out two of them – twin boys – belong to the final two members of the pack, Boyd and Erica. Stiles remembers them from the last time he was at the house. Everyone’s welcoming and Derek seems to relax as the minutes tick by, some of the worried lines by his eyes smoothing out.</p>\n<p>Boyd and Tim build a huge bonfire in the fire pit out back and help the kids toast marshmallows as the sky darkens overhead, the air cooling as the sun sinks below the horizon. The rest of them stand around and drink and eat while the moon slowly appears between the trees.</p>\n<p>“What’s it feel like?” Stiles asks Derek, who raises his eyebrows.</p>\n<p>“What does what feel like?”</p>\n<p>“The moon.”</p>\n<p>Derek’s eyes move to where the moon’s visible through the trees and his mouth twists thoughtfully. “Hard to put into words,” he says. He touches a hand to his chest and says, “It’s like a tug here. Like a fish hook pulling a different part of me to the surface.”</p>\n<p>“Your wolf?”</p>\n<p>“You could call it that,” Derek says. “It’s not black and white, though. I can’t say there’s a human side of me and a wolf side. There’s just a part of me that’s more…primal.”</p>\n<p>Stiles can’t help the small shudder that runs through him at the words and Derek turns his pale eyes on him, pulsing faint electric blue around the edges. “Wish I didn’t have to work tonight,” Stiles tells him with a significant eyebrow raise.</p>\n<p>Derek’s eyes darken, his lips parting in a white-toothed smile that’s edging on raw, sending Stiles’ skin prickling with goosebumps. “Maybe you can get the next full moon off,” he says, his voice low and Stiles tries, desperately, not to get aroused while he’s standing around with a bunch of werewolves. He’s <em>definitely</em> got a thing for werewolves, fuck. He’d really like to revisit his earlier suggestion that they find a quiet spot for a quick <em>anything</em>, but Laura’s narrowing her eyes at them from across the fire, so Stiles bites his tongue and wills his semi into nonexistence.</p>\n<p>Derek smiles at him again and he totally knows what he’s doing to Stiles, the fucker, but all he does is gently bump his shoulder against Stiles’ before going to grab another beer. Stiles smiles after him and god, he’s such a hopeless teenage romantic, but Derek’s good, okay, he’s a good person and he doesn’t even seem to realize it and Stiles is determined to make him aware. Someone touches his arm and Stiles jumps, startled.</p>\n<p>“Sorry,” Laura says. “Help me in the kitchen?”</p>\n<p>“Sure,” Stiles says warily, because he can hear the heavy hint in her voice that it’s not really a suggestion, more of an order, but he follows her inside, through the dark living room and into the brightly lit kitchen. Laura leans against the counter, looking at him thoughtfully, and Stiles says, “Are you going to give me the scary big-sister-slash-alpha talk?”</p>\n<p>“Do I need to?” Laura replies, leveling him with a capital-L Look.</p>\n<p>“Er, no,” Stiles says nervously. “You’re scary enough as is.”</p>\n<p>“Fucking right,” Laura says cheerfully. “Besides, I think I’ve already threatened you before, the time after you and Scott arrested Argent.”</p>\n<p>“Oh yeah,” Stiles says blithely. “How could I forget.”</p>\n<p>Laura laughs and elbows him in the ribs. “I’m not here to scare you,” she says. “I just wanted to talk to you about Derek. I’m glad you managed to wrangle him.”</p>\n<p>“Oh,” Stiles says, his shoulders slumping in relief. “Well. I wouldn’t say that I wrangled <em>him</em>. I think we wrangled each other.”</p>\n<p>“Regardless,” Laura replies, her grin softening into something more tender. “I’m glad you found each other. Der looks happier than I’ve seen him in a long time. For a long time, Sam was the only thing that made him smile.”</p>\n<p>“I’m – I’m not doing anything special,” Stiles blinks. “I’m just treating him like a normal person.”</p>\n<p>“But you have to understand,” Laura tells him. “The last person he was with didn’t do that. He and Kate dated for three months and she never met our family. Hated who we were, never wanted to come over on full moons. And yet you two, you’ve been together for what, half that, and he brought you over and you’re here and making an effort, and that says a lot.”</p>\n<p>Stiles flushes. He’s not sure what to say to that, but apparently he doesn’t need to say anything; Laura shoves a bowl of tortilla chips in his arms and pushes him back outside. Derek’s waiting, looking a little lost, and Laura claps him on the shoulder cheerfully. “Found your lost puppy, baby bro. Chin up,” she tells him, and Stiles snorts.</p>\n<p>Derek looks a little betrayed, but he’s distracted by Samantha, who comes skipping over and tugs on his hand. “Daddy, Uncle Tim says it’s moonrise! Can we go into the woods?”</p>\n<p>“What’s Aunt Laura say?” Derek asks her, and Samantha looks up at Laura pleadingly.</p>\n<p>Laura grins and spreads her arms wide, calling, “All right, my loves, it’s time to play!”</p>\n<p>It’s nothing like Stiles expected; all the kids set up howling and bolt for the trees. The adults are slower to follow; Boyd carries Erica on his back as they trot toward the forest, calling to their children. Tim follows behind with the pudgy toddler up on his shoulders, Isaac laughing at his side, his arm linked with Cora’s, who’s got Laura’s baby in the crook of her other arm.</p>\n<p>Laura laughs, dropping her arms by her sides. “You coming in, deputy?”</p>\n<p>“I have to work,” Stiles says, slightly awed. “Everyone goes in? I thought you had human kids.”</p>\n<p>“I do,” Laura replies. “But it doesn’t do them any good leaving them at home. They’re pack, same as the rest of us.”</p>\n<p>“Oh,” Stiles says.</p>\n<p>“Der?” Laura asks.</p>\n<p>“I’ll be up in a minute,” Derek says with a nod. “Keep an eye on Sam for me?”</p>\n<p>“Will do!” Laura says happily, trotting off toward the trees. She tilts her head back, letting out a howl that Stiles can feel in his bones and it’s echoed back at her from the trees, many voices large and small.</p>\n<p>“This is amazing,” Stiles tells Derek, who smiles faintly.</p>\n<p>“Not what you pictured?”</p>\n<p>“I guess not,” Stiles says, sticking his hands in his pockets. “I was thinking of a hunt, I guess.”</p>\n<p>“We do that sometimes,” Derek says. “But not often. It’s more about being together. Safe. Happy.” He takes a deep breath. “I wish you could stay.”</p>\n<p>“I wish I could too,” Stiles agrees, and he’s not lying. It seems like fun, being a part of something like this – he can hear people off in the woods, laughing and calling to one another. Derek shifts minutely, his eyes on the trees, and Stiles can tell he wants to be out there with them so he says, “Next time. I’m going to head out now, so you go have fun with your pack.”</p>\n<p>Derek looks at him and his eyes are already burning a faint blue, but he says softly, “Thanks for coming.”</p>\n<p>Stiles reaches out and squeezes his hand. “Thanks for wanting me to be a part of it.”</p>\n<p>Derek gently tugs him closer, slipping his hands around Stiles’ waist. “I like you,” he says steadily, staring down into Stiles’ eyes. “A lot.”</p>\n<p>“I’m glad to hear it,” Stiles replies, his throat constricting, “because I really like you.”</p>\n<p>Derek smiles and Stiles is maybe a little in love with the way the corners of his eyes crinkle when he does. “Next month,” Derek promises, leaning in to brush his lips against Stiles’ cheek. “I’m gonna fuck you senseless.”</p>\n<p>“Oh, fuck,” Stiles says weakly. “Do we have to wait that long?”</p>\n<p>“How are your ribs doing?”</p>\n<p>“This is my last shift on desk duty,” Stiles says, a little desperately. “I’ve been cleared for street shifts.”</p>\n<p>“Good,” Derek says, his voice so low he’s almost purring. “We’ll have to celebrate.”</p>\n<p>“Fuck yes,” Stiles agrees fervently. “I’ll text you?”</p>\n<p>Derek bites down on Stiles’ jaw and Stiles whines, his hips bucking forward. “I’ll look forward to it,” he growls and then pulls himself away from Stiles, his eyes glowing bright blue.</p>\n<p>“Go have fun,” Stiles tells him weakly. “Before we get ourselves in trouble.”</p>\n<p>Derek snorts, but jogs off through the backyard, heading for the trees. Stiles watches him go and he’s thankful he’s still got forty-five minutes before he needs to be on shift because he’s fucking hard as hell and he needs to jerk off <em>now</em>. And if he does it to the thought of Derek touching him with his eyes burning that electric blue, no one’s going to know but him.</p>\n<p>-</p>\n<p>Scott's so happy Stiles is back on street duty that when he sees Stiles the next morning, he wraps him up in a hug that's got his feet lifting off the ground. Stiles laughs, clapping Scott on the back. \"Dude, don't squeeze me too hard or I'll end up behind the desk again.\"</p>\n<p>\"I'm so fucking glad you're back,\" Scott sighs as they head out to their cruiser. \"Daehler's the <em>worst</em>. Allison said he used to stalk her in high school and I had to ride around with him for a month and try not to rip his throat out – you know how hard that is?\"</p>\n<p>\"Told you that guy's weird,\" Stiles replies. \"I dunno how he managed to pass the personality test.\"</p>\n<p>\"Probably bribed someone at the academy,\" Scott agrees.</p>\n<p>They spend the morning sitting in a speed trap on a back road and even though he’s just sitting around like he was when he was on desk duty, Stiles is delighted because it’s not fucking desk duty. He gets to hang out with Scott, too, which is a definite plus, especially when Scott reaches under his seat and pulls out a container full of sugar cookies.</p>\n<p>“Celebration?” Stiles grins.</p>\n<p>“Tori and I made them for you,” Scott says cheerfully.</p>\n<p>“I missed you so much,” Stiles says, pretending to wipe away a tear.</p>\n<p>\"So,\" Scott says as Stiles bites into a cookie with way too much frosting - and he's not sure whether it's adorable or sad that he can't tell if it's Scott's handiwork or that of his four-year-old. \"How's it going with Derek?\"</p>\n<p>\"You really wanna know?\" Stiles replies, wiggling his eyebrows at Scott, who gives a long-suffering sigh.</p>\n<p>\"He's vaguely related to me, so if you're gonna tell me about any weird sex stuff, let me get mentally prepared, all right?\"</p>\n<p>Stiles laughs. \"You'd take that blow for me? Aw, dude, I'm bummed Allison got to you first because I'd totally marry you right now.\"</p>\n<p>Scott gives him a lopsided grin. \"I'm sure Derek wouldn't appreciate that. It's going well, though?\"</p>\n<p>\"Yeah,\" Stiles sighs contentedly. \"He invited me over to his sister's house for the full moon last night.\"</p>\n<p>Scott raises his eyebrows, looking impressed. \"Seriously? That's big, man.\"</p>\n<p>“Yeah.” Stiles swallows back a grin of pleasure. “I know. He was so nervous; it was kind of adorable. And everyone seemed to like me, so no problems there.”</p>\n<p>“I’ll ask Isaac for his take on the situation,” Scott says solemnly. “You probably broke a bunch of werewolf etiquette rules and they only <em>pretended</em> to like you.”</p>\n<p>“Asshole,” Stiles laughs, punching him on the arm.</p>\n<p>He texts Derek on their way into town to grab lunch. <em>hope u guys had a good night. wanna get together tonight?</em></p>\n<p><em>can't,</em> Derek texts back a couple minutes later, and Stiles’ heart sinks.<em> forgot last night - laura's out of town for the next few days &amp; tim works nights so the kids are sleeping here.</em></p>\n<p>“Something wrong?” Scott asks.</p>\n<p>“It’s nothing,” Stiles says sadly but then he has to laugh, because Derek follows up with a text message that only says <em>:(</em>. “Dork,” Stiles mutters, and texts Derek as much, who retorts <em>say that to my face.</em></p>\n<p>“Hey, stop getting sappy over there,” Scott warns. “I mean it, man.”</p>\n<p>“I listen to you praise Allison and Tori all the time,” Stiles snorts. “You owe me this.”</p>\n<p>“Just eat another cookie, will you?” Scott mutters.</p>\n<p>It rains steadily for the next couple of days, which means the department’s kept busy with a lot of minor collisions and power outages caused by flooding and downed trees. It’s as good a way as any to distract Stiles from the thought that he’s not seeing Derek, even if he does go home with his socks soaked through every night. They’ve got plans to meet, anyway, the day Laura comes back from whatever pack business she’s on, which gives Stiles something to look forward to.</p>\n<p>The day before Laura’s return, Stiles stops at the gas station on the way to work to fill up the Jeep. He has to do it more often than he’d like, but the gas gauge’s busted and permanently stuck on half full, so he’d rather not leave it to chance, and at least the gas station has a roof over the pumps so he’s not getting soaked by the pouring rain.</p>\n<p>He’s idly wondering if maybe Derek could fix it for him when he notices the woman at the pump behind the Jeep cursing. Stiles cranes his neck to see her, a blonde, competent-looking woman. “You okay?” he asks conversationally.</p>\n<p>She looks up sharply, then gives him a lopsided grin. “Locked myself out,” she says, gesturing at her car. “Typical.” The woman eyes him, taking in his uniform. “You wouldn’t be able to help me out, would you?”</p>\n<p>“Can’t while I’m on shift,” he tells her. “Insurance reasons. Lucky for you, I’m not on shift.”</p>\n<p>“My hero,” she winks, and Stiles grins. He crouches down next to the Jeep, reaching for the underbody – he’s got a bad habit of locking his keys in the car, and it’s reached the point where sticking a slim jim under the car with a couple of magnets has saved him several hundred bucks in calls to AAA.</p>\n<p>“Promise you won’t sue me if I fuck up your door,” Stiles says, slipping the slim piece of metal between the window and the car.</p>\n<p>“Oh, believe me,” the woman murmurs, a grin quirking one side of her mouth. “I’m not going to make any trouble.”</p>\n<p>Stiles unlocks the door without any problem and the woman smiles at him. “Thank you, Deputy…” Her eyes fall to his name tag and her smile widens. “Stilinski.”</p>\n<p>“No problem,” he tells her. There’s something itching at the back of his mind – she’s familiar somehow, but he’s good at faces and he’s pretty sure he’s never seen her in his life. Then again, he meets a lot of people. It’s possible they’ve crossed paths before. “Have a great day. Stay dry.”</p>\n<p>“You too,” she replies, winking at him before climbing into the car. Stiles watches her leave the parking lot, a faint frown furrowing his brow. It’s going to bug him all day.</p>\n<p>-</p>\n<p>Sometime in the late afternoon, Stiles sits in the driver’s seat of the cruiser, watching Scott catch a lost cat in the pouring rain. He has to bite back a joke about cats and dogs as Scott climbs into the front after putting the cat in the back, and settles for, “Cats aren’t your biggest fans, huh?”</p>\n<p>Scott looks put out. “I don’t get it. I used to work at a vet’s office in high school and cats loved me!”</p>\n<p>“It couldn’t possibly be that pesky werewolf bite, huh?” Stiles says innocently. Scott gives him a dark look and shakes the water out of his hair, splattering Stiles with cold droplets.</p>\n<p>“Hey, hey!” he protests, flinging his arms up protectively. “I give, I’m sorry!”</p>\n<p>Scott grins triumphantly and opens his mouth to speak when the radio crackles to life and they both pause as the dispatcher says, “All units, back-up needed at a 11-79 on Old Hollow Road, Beacon Hills, approximately one mile north of the bridge.”</p>\n<p>“Car accident,” Stiles says, at the same moment Scott says, “We’re only a couple miles away.”</p>\n<p>“Call it in,” Stiles says, kicking the cruiser into drive and flicking on the lights as they roar off down the road.</p>\n<p>Scott nods and picks up the radio. “10-4, dispatch, Unit 48 on our way to the scene – you got some more details for me?”</p>\n<p>“Two cars involved, one rollover,” the dispatcher tells them. “One victim is a male werewolf in critical condition, but he’s fighting first responders. Back-up requested to help subdue him and control the scene.”</p>\n<p>“10-4,” Scott repeats grimly as Stiles winces.</p>\n<p>“Gonna have your work cut out for you,” he says sympathetically. “Injured were full of adrenaline?”</p>\n<p>“Gotta do what we have to,” Scott says seriously, reaching under the seat for a bullet-proof vest – it won’t just protect him from gunshots, but the lethal claws and teeth of fellow werewolves. Stiles feels guilty for being grateful that departmental rules stipulate that, whenever possible in aggressive situations, werewolf officers deal with werewolves. Stiles may have been able to get Derek to submit the other night, but at least he <em>knows</em> Derek.</p>\n<p>They pull up to the scene just as the ambulance arrives from the other direction. There are already cars at the scene – two cruisers, and an SUV with flashing lights probably belonging to a first responder. Another SUV sits crookedly across the middle line, front end completely smashed in and Stiles frowns at it; it looks vaguely familiar. There’s a group of people standing by the edge of the road, struggling with what must be the werewolf victim – Stiles can hear ragged snarling as he jogs toward them. Where’s the second car? Didn’t dispatch say there were two cars involved?</p>\n<p>His stomach sinks when he realizes that the land drops beside the road into a sharp ravine – the car must have gone down there. Next to him, Scott stiffens and says, “Jesus, Stiles – <em>look.”</em></p>\n<p>“Huh?” Stiles follows Scott’s finger, pointing to the struggling figure, and his jaw drops open because it’s <em>Derek</em>, Derek with blood streaming down the side of his face. He’s completely shifted, his eyes burning blue as he throws himself against the officers trying to restrain him. “Oh my god,” Stiles says hoarsely, speeding up.</p>\n<p>“Stiles, be careful,” Scott hisses, close behind. “He’s not in control – “</p>\n<p>And Jesus, Stiles can <em>see</em> that – Derek’s not looking at any of the men holding onto him, his eyes wide and panicked, focused on the ravine – but it’s Derek and he has to try and help. As Stiles gets closer, he can see Derek’s clothes are ripped, and underneath – Stiles swallows hard because he can see bone.</p>\n<p>The paramedics reach Derek at the same time as Stiles and Derek lets out a roar when they try to pull him onto the gurney, his struggle increasing. “Derek!” Stiles says breathlessly, his heart pounding. “Derek – “</p>\n<p>“Back off, Stilinski!” one of the other deputies snaps – Aiden or Ethan, he can never tell the twin brothers apart. He’s got claw marks down the side of his face, but they’re already healing. “He’ll rip your fucking face off!”</p>\n<p>They manage to wrangle Derek onto the gurney but he still fights as they tie him down, head twisted to stare at the ravine, panting raggedly. Stiles crouches down next to him, touching Derek’s arm. “’s all right, Der. We’re trying to help you.”</p>\n<p>Derek’s skin flinches under his touch, his entire body jolting like he’s been shocked, but his gaze finally breaks from the edge of the road, eyes flickering to Stiles.</p>\n<p>“Hey,” Stiles says worriedly. “Hey, talk to me, big guy.”</p>\n<p>Derek gives him a horrified look, exhaling harshly through his nose. “Sam,” he says hoarsely.</p>\n<p>“Sam?” Stiles repeats, alarmed. “Was Sam with you?”</p>\n<p>“His kid’s trapped in the car,” one of the other deputies tells him. “We’re waiting on heavy rescue.”</p>\n<p>Derek groans, tensing against the straps holding him down. “Sam – ”</p>\n<p>“Hey, hey,” Stiles says hurriedly, getting to his feet. “I’ll take care of her, Der, I promise. Trust me.”</p>\n<p>The paramedics start to haul Derek away but his eyes remain fixed on Stiles’ face, and the hurt in them is too much; he turns, heading for the side of the road. The ravine’s not that deep – it only drops about thirty feet – and the Camaro sits on its wheels at the bottom, though it’s clear from the way the roof’s caved in that it flipped at least once on the way down. The driver’s side’s completely smashed in – Derek must have gone through the window. The other twin deputy’s standing by the car, his mouth thin.</p>\n<p>“Is she hurt?” Stiles asks shortly, skidding down the incline, and the deputy shakes his head.</p>\n<p>“Can’t tell,” he replies. “She tried to claw me when I stuck my head in.”</p>\n<p>“Back off,” Stiles tells him, unbuckling his utility belt. “Go get me a blanket – the EMTs will have some.” He’s drenched to the bone by now, chilled to the core with the cold rain, but he strips off his uniform top and uses it to sweep the glass from the broken window so he can lean against it. “Hey, Sam?”</p>\n<p>He can see her round face, her eyes glowing yellow in the dim light of the late afternoon. “Hi Stiles,” she whispers.</p>\n<p>“Hey,” Stiles says again, trying to sound soothing. He hoists himself forward through the window, falling into the mangled front seat. He tries to ignore how it’s wet with blood and props himself up on the center console so he can take a better look at Sam. She’s in her car seat, which has been pushed forward, almost under the front seat – he can’t see her legs at all. “You okay, sweetheart?”</p>\n<p>Sam’s bottom lip quivers as she holds her arm out to him, a long cut running along her forearm. There are a few cuts on her face as well, but they look like they’ve already stopped bleeding.</p>\n<p>“Not bad,” he says encouragingly, curling his hand around hers. Her fingers are cold; he can see goosebumps on her arms. There’s a sound behind him and Sam’s head snaps around, a tiny growl rumbling between her lips. Stiles twists to see one of the twins leaning toward him, pushing a blanket through the window. Stiles takes it with a nod of thanks and the deputy backs off again, clearly not wanting to stress Sam out.</p>\n<p>“Here you go,” Stiles says calmly, unfolding the blanket and tucking it over Samantha’s tiny frame. “Better?”</p>\n<p>She nods, but to his surprise, her hand sneaks out from under the blanket, seeking his again. “Is Daddy going to be okay?” Sam whispers, her eyes filling with tears. Stiles can’t imagine how terrifying it must have been for her, trapped down in a car reeking of blood while Derek roared above.</p>\n<p>“He’s going to be fine,” Stiles says softly, squeezing her hand. “As soon as we get you out of here, we’ll go and see him, all right?” Sam nods, but tears spill down her cheeks. She whines miserably, high and distressed, and Stiles contorts himself further, pushing his way into the mangled back seat. It’s covered in broken glass and sharp metal but he disregards all of it, murmuring, “Hey, hey, you’re okay, and your dad’s okay,” smoothing a hand over her dark hair.</p>\n<p>Sam whimpers and, to his further surprise, turns into him, wrapping her arms around his neck, pressing her wet face to his collarbone. He can see the twin outside the car – Ethan, he’s pretty sure – looking startled and Stiles tries to make a face that expresses <em>this is my boyfriend’s daughter and it’s totally not weird at all.</em> But honestly, he couldn’t care less what’s going on outside; he’s focused on Sam, on how her breathing evens out, how strong she is as she clutches at his shirt. He promised Derek.</p>\n<p>“Look,” Stiles says gently, nodding toward the hill, where a group of firefighters are making their way down the ravine with rescue equipment. “The firemen are here to get you out, okay?”</p>\n<p>He starts to pull himself out of the car so the firefighters will have a clear path, but Sam whines and tugs at his shirt frantically. “Don’t go!” she cries. “Stiles, please don’t go!”</p>\n<p>“Okay,” Stiles says soothingly. “I’m right here. It might get loud, but don’t be scared, all right? They’re gonna get you out of here.”</p>\n<p>It’s a slow, painstaking process as the firefighters cut away the car around them, using a spreader to push the back seat into its original position, freeing Sam’s legs. Stiles watches her face, covers her ears with his hands when she cringes at the screech of the metal, tells her over and over again, “You’re doing so good, Sam.”</p>\n<p>One of the firemen cuts the straps on her car seat and lifts her out and Stiles follows, stiffly unfolding from the cramped wreck. He takes Sam from the man, and Sam wraps her arms around his neck tightly. The climb up the side of the ravine is difficult, the growth slick with rain and mud, but Stiles makes it up with a couple pushes from a firefighter behind him and hurries over to a waiting ambulance.</p>\n<p>Scott appears as Stiles passes Sam to the paramedic inside, his brow furrowing with worry. “She all right?”</p>\n<p>“Just some cuts and bruises, I think,” Stiles says wearily. “Derek?”</p>\n<p>“On his way to the hospital,” Scott replies, wiping rain out of his eyes. “Look, we can’t find the other driver.”</p>\n<p>Stiles frowns at him, one foot up on the back of the ambulance, ready to pull himself in. “What do you mean?”</p>\n<p>“I mean, there’s no sign of them,” Scott says. “They’re bringing out search and rescue. I’m going to stay here – you’re heading to the hospital?”</p>\n<p>“Yeah,” Stiles says, nodding toward Sam. “Promised Derek I’d watch her.”</p>\n<p>Scott spares him a quick smile. “Good luck, man. I’ll see you back at the station.”</p>\n<p>Stiles nods and climbs into the ambulance and it’s not until the bus begins to move that he realizes he’s shaking. It’s more than just the cold – it’s adrenaline leaving him, and the EMT spares him a sympathetic glance before tossing a blanket into his lap. Stiles wraps it around himself gratefully and takes Sam’s hand as she reaches for him again.</p>\n<p>The ride to the hospital is quick and silent – apart from some mostly healed cuts on her face and bruise on her shins, Sam’s only major wound is the long cut on her arm and it’s already healing. The paramedic cleans it and wraps it in gauze and draws a flower on the bandage in permanent marker, which makes Sam giggle. Stiles smiles absently, but now that he knows Sam’s going to be fine, his thoughts drift to Derek and his heart twists with worry. He knows that werewolves can take a lot more damage than humans can, but he saw torn flaps of skin and muscle and <em>bone</em>. There had to be a limit to what the body could take before it shut down, and Derek’s clothes had been saturated with blood.</p>\n<p>“Stiles?” Sam asks hesitantly and he blinks, finding both Sam and the paramedic staring at him. The woman raises her eyebrows significantly, nodding toward Sam, and Stiles realizes that Sam can sense his distress; she’s already starting to look upset, her eyes growing watery. “Everything’s fine!” he says hurriedly, and it’s not really a lie because for all he knows, it is.</p>\n<p>They reach the hospital after a ride that seems to take hours and seconds all at once and a nurse hustles them inside. Sam’s arm gets a brief examination by a doctor, who smiles and gives her a Hello Kitty sticker and tells Stiles she’s going to be fine. Another nurse leads them up to the fourth floor, where it’s quieter. Sam wrinkles her nose at the smell of antiseptic as the nurse hustles away to find a doctor who can tell Stiles what condition Derek’s in. He taps his feet nervously against the linoleum, trying to keep his mind blank so that Sam won’t get worried. He’s not hugely successful; emptying his mind of distraction has never been one of his strong suits.</p>\n<p>“Stay right here,” he tells Sam when the doctor appears, and they walk together down the hall until they’re out of ear shot. Stiles rocks back and forth on his feet anxiously and tries to hook his fingers in his utility belt but it’s not there – he left it on the grass next to the smashed shell of the Camaro.</p>\n<p>“Mr. Hale is in surgery,” the doctor tells him calmly. “He received significant damage to his chest, but that will heal without any issue. The major problem is with his leg – the bones shattered during the crash and his violent movement afterward damaged it further. We have to remove the bone fragments so they don’t remain inside him after he heals.”</p>\n<p>Stiles winces, remembering how Derek had been staggering around. “Is he going to be okay, though?”</p>\n<p>“He’ll be fine,” the doctor assures him, “but recovery will be slower than usual. Bone regeneration is the weakest of the werewolf’s healing abilities and requires significant energy consumption.”</p>\n<p>Stiles nods. “How long until he’s out of surgery?”</p>\n<p>“Shouldn’t be long,” the doctor says. “Though it may be a few hours before he’s lucid. Performing surgery on a werewolf requires injecting them with wolfsbane to slow the healing process so the incisions don’t heal as they’re made. He’ll receive the antidote shortly, but with all the stress to his body, he may sleep for a while.”</p>\n<p>“Thanks,” Stiles says quietly and the doctor nods briskly.</p>\n<p>Sam looks up hopefully when Stiles returns, and he plunks down next to her with a sigh. “Little while longer,” he tells her. “Your dad’s going to be fine, though.”</p>\n<p>Sam nods, her eyes wide. He’s not sure if she quite understands what’s going on but then again, what does he know about kids? She’s probably a hell of a lot more perceptive than he is. Stiles rubs a hand over his face. He’s still soaking wet, weary to the bone. He just wants to see Derek and know, really <em>know</em>, that he’s okay. Word from the doctor’s all well and good, but he needs to see it.</p>\n<p>Sam tugs on his sleeve and he looks down at her, guilt rushing through him when he sees the anxiety on her face. “Sorry,” he murmurs. “It’s been a long day, huh?”</p>\n<p>Sam nods again and then climbs over the arm of his chair, plunking herself down on his lap, leaning back against him firmly. He’s not sure why she’s warming up to him so suddenly, but he’s not going to push away a little girl seeking comfort. Stiles curls an arm around her and digs around in his pocket for his phone, pulling it free with a flourish.</p>\n<p>“You ever played Candy Crush?”</p>\n<p>-</p>\n<p>It’s nearly two hours before a nurse appears and tells them that Derek’s out of surgery. His phone’s dead and Sam’s asleep by then, her head tucked under Stiles’ chin, but he carefully lifts her and follows the nurse down a silent hallway. She shows them to a dim room and then disappears with a smile, leaving Stiles to step into the quiet room.</p>\n<p>Derek lies in a bed near the window, his eyes closed, chest slowly rising and falling. A shudder of relief runs through Stiles at the sight of him, at the way the heart rate monitor next to the bed shows a steady heartbeat. Stiles sinks into a chair next to the bed, Sam still cradled in his arms. He’s tired and the room is so quiet, filled with the sound of the rain beating against the window and the hum of machines and Derek’s steady breathing. It’s not long before Stiles slips into slumber, exhausted to the core.</p>\n<p>-</p>\n<p>Stiles is awoken sometime later by Sam moving around and he opens his eyes groggily to find her clambering off his lap. He watches her go scrambling over to Derek’s bed and realizes, with a jolt, that Derek’s awake; his eyes are half open and fixed on his daughter, his hand outstretched to her. Sam climbs onto the bed easily and Stiles' chest tightens at the pained noise Derek makes, wrapping his arms around her and drawing her in close. \"I'm okay, Daddy,\" Sam tells him, patting him on the back with her small hands, and Derek closes his eyes, breathing in deep. Eventually he exhales, pressing his face to Sam's neck.</p>\n<p>\"I know,\" Derek says quietly, smoothing a hand down her face. He opens his eyes, his gaze moving to Stiles, and Stiles' heart clenches again at the pain in his gaze. He feels like he's intruding, and he's wondering if he should just leave when Derek says, \"Hey.\"</p>\n<p>Stiles swallows. \"Hey. Um.\" he licks his lips. \"How you feeling?\"</p>\n<p>Derek gives him an unamused smile. \"Like I got blindsided by a car.\"</p>\n<p>\"Oh,\" Stiles says weakly, and to his horror his vision starts swimming.</p>\n<p>Derek looks both concerned and bemused. \"Are you crying?\"</p>\n<p>\"No,\" Stiles says, blinking defiantly. “I’m just – I’m just glad you’re okay, okay?”</p>\n<p>Derek carefully shifts Sam to his other side and gestures at him. \"Come here.\"</p>\n<p>Stiles rises without question, sinking down onto the edge of the bed and gratefully leaning into Derek, who curls an arm around him and noses at his jaw with an wet exhalation of warm air. Stiles can feel himself relaxing at Derek's touch, at the solid, reassuring smell of him - muted though it is by the smell of the hospital. \"I'm glad you're okay,\" Stiles repeats quietly, curling his fingers into the fabric of Derek's hospital gown.</p>\n<p>\"I'm made of strong stuff,\" Derek assures him solemnly, nudging Samantha. \"Right, Sam?\" She nods seriously and Derek gives her a soft smile, folding his hand over Stiles'.</p>\n<p>\"Do you remember what happened?\" Stiles asks after a few minutes of sitting quietly.</p>\n<p>Derek's silent for a second, absently rubbing his thumb against Stiles' hand before he says, \"We were running over to Bath to pick up an order for the garage and - I don't know. There was a car behind us on the road, but the last time I looked at it, it was pretty far back and then - then we got hit from behind.\"</p>\n<p>\"From behind?\" Stiles repeats, frowning. \"They smashed into you deliberately? You didn't brake suddenly or something?\"</p>\n<p>Derek shakes his head. \"No. The roads were slick, but I didn't lose control until we got hit.\" He rubs a hand over his face, looking tired. \"I smacked my head when we got hit, I think - couldn't stop the car. We went over the edge of the road and that's all I remember.\"</p>\n<p>Stiles squeezes his hand. \"'s okay,\" he says gently. \"We can put the rest together.\"</p>\n<p>Derek nods, his mouth twisting. \"Laura's going to be delighted,\" he sighs. \"She's been getting after me to get a new car since Sam was born.\"</p>\n<p>Stiles snorts, elbowing him. \"Looks like she's finally getting her way.\"</p>\n<p>\"She'll probably insist I get a minivan,\" Derek says morosely, watching Sam fiddle with his blankets.</p>\n<p>Stiles laughs and says, \"At least there'd be plenty of room for extracurricular activities, huh? No more smacking my head on the roof of the Camaro.\"</p>\n<p>Derek snorts, the corners of his mouth curling up. \"I'll be out of here by tomorrow,\" he says. \"I haven't forgotten about our date.\"</p>\n<p>Stiles grins. \"Good. I get to call out when I get hit by a car, but you've already proven that you're made of tougher stuff.\" Derek rolls his eyes and Stiles laughs again. \"Speaking of Laura - do you want me to give her a call and let her know what's going on?\"</p>\n<p>\"Yeah,\" Derek sighs. \"Tim's going to have to find someone else to watch the kids.\"</p>\n<p>\"What about Sam?\"</p>\n<p>Derek's eyes fall to his daughter. \"Seems like the two of you are getting along,\" he says thoughtfully. \"Would you be willing to take her for the night?\"</p>\n<p>\"Me?\" Stiles asks, startled, and Derek looks at him.</p>\n<p>\"Yeah,\" he says quietly. \"I trust you.\"</p>\n<p>Stiles swallows. \"Yeah, I mean - I totally can, if she wants to.\"</p>\n<p>Derek nudges Sam. \"What do you think?\" he asks her. \"Would you be okay if you went home with Stiles tonight?\"</p>\n<p>Sam looks at Stiles and nods solemnly. \"Okay.\"</p>\n<p>Derek kisses the top of her head and says to Stiles, \"You can stay at the house if you want. Sam can show you where the spare key's hidden.\"</p>\n<p>\"Cool,\" Stiles replies, smiling across at Sam. \"We'll have a party.\"</p>\n<p>There's a knock on the door maybe an hour after Derek wakes up and to Stiles' surprise, Scott pops his head in the room. \"Hey,\" he says, looking worried. \"Tried to call you.\"</p>\n<p>\"Oh,\" Stiles blinks. \"My phone's dead, sorry.\"</p>\n<p>\"Oh,\" Scott echoes, stepping into the room. He's still in uniform, and one of the twins is behind him. \"Hey, Derek. How're you feeling?\"</p>\n<p>\"Fine,\" Derek replies, watching Scott and the other deputy suspiciously. \"Why are you here?\"</p>\n<p>\"Stiles is going to need a ride home,\" Scott says, \"and Aiden's going to get a statement from you about the crash, but there's something I need to tell you both.\"</p>\n<p>\"What?\" Stiles asks sharply, getting to his feet. \"Did you find the other drive?\"</p>\n<p>\"Not exactly,\" Scott replies. He looks at Derek. \"Derek, I'm not sure you'll want Sam in the room for this.\"</p>\n<p>Derek nods shortly, his brow furrowing, and Scott gestures at Aiden. \"Hey, Sam, you want to go with Aiden for a sec? Maybe he'll let you pick something out of the vending machine.\"</p>\n<p>Sam looks up at Derek and he nods, nudging her off the bed. \"It's fine,\" he tells her. \"Behave yourself.\"</p>\n<p>Scott waits until Sam and Aiden have left the room before he says, \"The car that hit you was reported stolen a couple of hours ago from Chowchilla, but that's not all. While we were still on scene, your dad showed up. He said he got a call from the Central California Women’s Facility - Kate Argent's escaped.\"</p>\n<p>Stiles freezes, his mouth dropping open. Next to him, Derek pushes himself upright, his eyes burning blue. \"Where is she?\" he snarls. \"Where - \"</p>\n<p>\"Derek!\" Stiles exclaims, twisting to push him back onto the bed. \"Calm down!\"</p>\n<p>\"We don't know where she is,\" Scott tells them, looking anxious. \"We followed the scent from the car, but the driver threw down a spice bomb. Completely wrecked the scent trail.\"</p>\n<p>Derek growls. \"She's the one that hit us.\"</p>\n<p>Scott nods. \"We think so.\"</p>\n<p>\"Scott,\" Stiles says slowly, clues clicking together. \"The car she stole - it was a BMW?\"</p>\n<p>\"X5, yeah, one of those really expensive SUVs,\" Scott says, frowning.</p>\n<p>\"She told me she got locked out,\" Stiles says, dread building in the pit of his stomach.</p>\n<p>\"What?\" Scott and Derek snap in tandem.</p>\n<p>Stiles swallows. \"This morning, I helped a woman at the gas station who was locked out of her car. I didn't - I thought she looked familiar but I couldn’t place her.\" He feels sick. If only he'd known, he could have stopped her before she hurt Derek and Sam -</p>\n<p>\"It's not your fault,\" Derek snaps. \"Don't even <em>start</em> thinking that.\"</p>\n<p>Stiles grimaces as the door opens again and Sam and Aiden come back into the room. Scott glances at them and says to Stiles, “We need to get back to the station. The sheriff’s trying to coordinate a manhunt with the highway patrol – he’s calling everyone in. Aiden’s going to stay and watch the door in case Kate’s stupid enough to come here.”</p>\n<p>Stiles looks at Derek, who thins his lips but nods. Scott looks at Stiles. “You ready to go?”</p>\n<p>“I – “ Stiles hesitates, still looking at Derek. “I said I’d watch Sam.”</p>\n<p>Scott looks a little startled, but he says, “We could drop her off at my place. Allison’s home with Tori – ”</p>\n<p>Samantha looks hopeful, but Derek says, “No. I want her with werewolves.”</p>\n<p>“We’ll bring her to the station,” Stiles tells Derek. “She’ll be safe there.”</p>\n<p>Derek pauses for a moment before nodding. “Fine.”</p>\n<p>“Okay,” Scott sighs. “Can we get on the road?”</p>\n<p>“You go start the car,” Stiles tells Scott with a tired smile. “We’ll say goodbye.”</p>\n<p>Scott nods and leaves the room, Aiden on his heels. Stiles sinks back down on the side of the bed and watches Derek enclose Sam in a bear hug. He whispers something to her that makes her giggle, and rubs their cheeks together before kissing her forehead.</p>\n<p>“What’d you say?” Stiles asks him, once he’s let go of Sam and turned to Stiles.</p>\n<p>“I told her that if any cops give her trouble, she should kick them in the shins,” Derek replies, casting a wry glance over at Sam, who giggles again. Derek’s pale eyes slide back to Stiles. “Be careful.”</p>\n<p>“I will,” Stiles promises. “I swear I’ll keep her safe.”</p>\n<p>“I know you will,” Derek says softly, curling his hands over Stiles’. He leans forward, delicately dragging his nose along Stiles’ jaw line, the same practiced gesture he’s been doing for weeks – and Stiles suddenly realizes what it is: scent marking. He just saw Derek doing it to Sam, rubbing their skin together so their scents mix. It’s a sign of pack and trust and love – and Derek’s been doing it to Stiles for <em>weeks</em> now. God, no wonder Sam’s been warming up to him; he smells like <em>family</em>.</p>\n<p>The thought fills him with a golden heat, filling him to the brim. He’d give anything right now to be able to stay, but he settles with throwing his arms around Derek’s neck and returning the gesture, dragging his lips against Derek’s cheek. Derek huffs against his neck and anyone who didn’t know him might think he was annoyed, but Stiles can tell he’s pleased. “You should get going,” he murmurs to Stiles, hands a heavy weight at his hips. “Scott looked about ready to pop a blood vessel.”</p>\n<p>“Yeah,” Stiles agrees with a heavy sigh. “Sam and I will come visit in the morning, okay?”</p>\n<p>“Deal,” Derek says, tilting his head for a quick kiss.</p>\n<p>“Gross,” Sam says, wrinkling her nose at them.</p>\n<p>“I’ll kiss you too,” Stiles threatens.</p>\n<p>“Daddy!” Sam protests with a grimace, looking to Derek for help.</p>\n<p>Derek shrugs, not concerned. “All’s fair in love and war,” he tells her, and Stiles tries not to react to the way he says <em>love</em>. He’s pretty sure he’s already in love with Derek and that’s just – that’s lunacy. They’ve been together less than two months, only agreed they were boyfriends like three <em>weeks</em> ago and yet – while Stiles knows he has this tendency to fall into things fast, he’s never felt this way about anyone. If the way Derek treats him is any way to judge, Derek feels the same way about him.</p>\n<p>Stiles has already told himself, though, that he’s not going to say anything. It’s too much too soon; he’s going to be smart about this, even if the way Derek’s looking at him right now says he <em>knows</em>.</p>\n<p>“I don’t understand what that means,” Sam complains as Stiles gets to his feet, Derek’s hands following him up until they drop to his lap.</p>\n<p>“You will when you’re older,” Derek replies, his eyes still on Stiles. Stiles smiles faintly and Derek nods.</p>\n<p>“Come on, Sam,” Stiles says a little hoarsely. “Let’s go annoy Scott.”</p>\n<p>“But I like Scott,” Sam protests, slipping off the bed.</p>\n<p>“I do too,” Stiles grins. “Makes it even better.”</p>\n<p>“Be careful,” Derek calls after them.</p>\n<p>“We will,” Stiles promises and Sam waves. “Bye, Daddy!”</p>\n<p>Scott’s waiting out front, lights on and wipers going. It’s still raining – more of a downpour, really – and Stiles has to rush to get Sam in the back. Scott’s worried because they don’t have a booster seat but Stiles tells him to just drive slow. They take a detour to Derek’s house so they can pick up some things for her and as Sam trots up the front walkway, Stiles murmurs to Scott, “Can you smell Kate?”</p>\n<p>It occurred to him, on the drive over, that if Kate had been in town since at least the time he’d seen her at the gas station this morning, she’d probably been searching for Derek and Sam for a while, which probably meant that she’d come by the house at some point. For all he knew, she could still be around somewhere – out in the woods behind the house, watching and waiting.</p>\n<p>Scott swings his head from side to side, scenting the air. “I’m not picking anything up,” he says, and Stiles relaxes a little.</p>\n<p>When they reach the station, the parking lot’s full of unmarked police cars and California Highway Patrol cruisers, as well as all the sheriff’s department vehicles. Inside, it’s busy; there are people everywhere and Stiles picks up Sam so they won’t get separated. She doesn’t seem to like the noise and hustle all that much, tucking her face against Stiles’ shoulder while he tries to find his dad.</p>\n<p>When he does locate his dad, talking to a competent-looking trooper, the sheriff gives his son a tired look and asks, “Who’s your friend?”</p>\n<p>“This is Derek’s daughter, Samantha,” Stiles tells him. “I told him I’d watch her and with – with all this happening, I figured the safest place for her is probably here.”</p>\n<p>“You’re probably right,” his father sighs.</p>\n<p>“I know I’m going to regret this, considering I just spent a month and a half doing it, but if it helps, I’ll stay on desk duty tonight so I can be here,” Stiles offers.</p>\n<p>His dad snorts and says, “Fine. You can park her in my office. There’s a bag of Oreos in my bottom drawer if she gets hungry.”</p>\n<p>“Ooh,” Stiles says warningly. “After this is over, we’re having a talk about your health.”</p>\n<p>His father waves him away, his mouth twisting wryly.</p>\n<p>Once Stiles has Sam settled in his dad's office with some computer printouts of coloring pages, all the colored highlighters and markers he can scrounge up, and a stack of his dad's illicit Oreos, Stiles finally has a chance to plug his phone into a charger and call Laura.</p>\n<p>She answers the phone with a suspicious, \"Hello?\"</p>\n<p>Stiles clears his throat. \"Hey, Laura? It's Stiles - Stiles Stilinski.\"</p>\n<p>\"Stiles,\" she says, sounding no less suspicious. \"Hi. Why are you calling me?\"</p>\n<p>\"I need to tell you a few things,\" Stiles replies steadily. \"The first is that Derek and Sam are <em>fine</em>, but they were in a car crash - \"</p>\n<p>\"What?\" Laura snarls.</p>\n<p>\"Hold on,\" Stiles says weakly. \"Let me finish before you explode, because there's a bigger issue - Kate Argent's escaped from prison and we don't know where she is.\"</p>\n<p>Laura's silent for so long that Stiles checks his screen to make sure they're still actually connected. When she does speak, it sounds like she's choosing her words very carefully. \"Where's Derek?\"</p>\n<p>\"He's in the hospital,\" Stiles tells her. \"I've got Sam here with me at the sheriff's station.\"</p>\n<p>Laura breathes out forcefully. \"What happened to him? Is he all right?\"</p>\n<p>Stiles tells her everything - from the moment he and Scott arrived at the scene to the time he arrived back at the station - and he finishes with, \"Derek wanted me to tell you so that Tim would know to find someone else to watch your kids tonight.\"</p>\n<p>Laura laughs, unamused and exasperated. \"He would,\" she sighs. \"Okay. I'm out in Montana with Isaac with right and we were going to head back tomorrow morning, but we’ll grab our things and head out now. Sam’s safe?”</p>\n<p>“Safest place she can be right now,” Stiles assures Laura. “Look, you don’t need to rush. Derek should be out of the hospital by tomorrow, and we’ll find Kate.”</p>\n<p>“Stiles,” Laura says, a little impatiently. “The woman who murdered my family is on the loose. I need to take care of my pack.”</p>\n<p>“Oh,” Stiles blinks. “Right. Sorry.”</p>\n<p>She sighs. “Thanks for calling me. I’ll be in touch.”</p>\n<p>“Bye,” Stiles says, but Laura’s already hung up.</p>\n<p>Stiles sits at the front desk until late into the night, watching patrols come in and out. Someone tells him that they’ve got cops going door to door, and werewolves in the woods looking for Kate, but so far there’s been no sign of her. His dad doesn’t seem all that surprised – disheartened, yes, but as he says to Stiles, she seemed to have made something of a profession of killing werewolves; she’s not going to let herself be caught that easily.</p>\n<p>At two in the morning, he gets switched out and his dad tells him that he can go home, but Stiles shrugs and says, “I might as well stay – the station’s probably safer than my apartment, and I don’t want to take any chances with Sam.” She’s curled up on the couch in his dad’s office, buried under a pile of blankets that Stiles had to rub against himself before she’d settle down. It makes his heart twist a little – he must <em>reek</em> of Derek if it’s that comforting to her. He hopes Derek’s doing all right, all by himself in the hospital. Aiden’s voice comes over the radio every hour or so, letting them know that the hospital’s clear.</p>\n<p>Stiles ends up sleeping on the floor next to the couch and it’s odd how the hum and bustle of the building is comforting but then again, maybe it’s not – he’s slept at the station many times before, curled up on the same couch that Sam’s sleeping on. He can’t remember how many nights he spent there after his mom died, with his dad newly elected sheriff. They couldn’t afford a babysitter every night and the station was more like home anyway, the deputies and staff family.</p>\n<p>When Stiles wakes up in the morning, weak golden light streaming into the office, the building’s quieter and Sam’s gone. Stiles shoots upright, his heart hammering in his chest, and scrambles out of the office only to find his dad and Sam sitting behind the front desk. Sam’s got a plate of breakfast food in front of her, swinging her legs back and forth as she gnaws on a piece of bacon. Stiles’ father raises his eyebrows at him.</p>\n<p>“Don’t worry,” he says mildly. “I didn’t steal your charge. She’s got to be to school in an hour, though.”</p>\n<p>“Crap,” Stiles sighs, scrubbing a hand over his face. “Any news?”</p>\n<p>“No sign of her,” his father says with a shake of his head. He nods down the hall. “There’s breakfast, if you want it – Jen’s Diner set us up a whole spread.”</p>\n<p>Stiles shakes his head. “I’m all right.” He looks down at Samantha. “You sleep okay, Sammy?”</p>\n<p>She wrinkles her nose. “It’s noisy here.”</p>\n<p>“The police never sleep,” Stiles’ dad tells her solemnly.</p>\n<p>“I want to be a police officer,” Sam tells him conversationally. “My mom’s a bad person.”</p>\n<p>“Who told you that?” Stiles asks curiously.</p>\n<p>“Aunt Laura,” Sam replies primly, stabbing at her scrambled eggs. “She said my mom hurt Daddy a lot. He doesn’t talk about her.”</p>\n<p>Stiles’ dad looks up at Stiles, his eyebrows raised, and Stiles swallows uncomfortably. “All righty,” he says, forcing fake cheer into his voice. “Why don’t you finish up your breakfast and we’ll go visit your dad before you go to school?”</p>\n<p>Stiles’ father gets to his feet and claps him on the shoulder. “Take your time. Run home and shower if you want, but we’ll need you back on shift.”</p>\n<p>Stiles nods. When Sam’s done eating, she takes his hand and they head out to the staff parking lot, where his Jeep’s still sitting. Someone managed to scrounge up a booster seat, so he latches into the backseat and Sam scrambles inside, buckling herself in with practiced hands.</p>\n<p>Stiles nods at the deputy stationed outside Derek’s door – Aiden went off duty hours ago – and pushes the door open so Sam can skip ahead of him. Derek’s awake, though there are deep, dark circles under his eyes, but he smiles when he sees Sam and Stiles.</p>\n<p>“You sleep okay?” Stiles asks, bending to kiss Derek’s temple.</p>\n<p>“Mm,” Derek shrugs noncommittally. “Spent a lot of time thinking.”</p>\n<p>“I was a little worried I might come in to find you’d gone after her,” Stiles admits.</p>\n<p>“Thought about it,” Derek replies, his eyes landing on the window. He shrugs again. “I can’t do much right now, though. Not weak like this.”</p>\n<p>Stiles looks down at Derek’s legs. The casts are gone, the skin on his legs pale and new. “When are you getting out?”</p>\n<p>“Noon,” Derek says. “I was hoping you might be able to pick me up. I’m kind of stuck without a car and Laura out of town.”</p>\n<p>“Sure,” Stiles nods. “Shouldn’t be a problem. I talked to her last night, by the way,” he adds. “Laura.”</p>\n<p>Derek nods. “I know. She called the hospital. She talked me down from going after Kate.”</p>\n<p>“Oh,” Stiles says. “Good.”</p>\n<p>“I’m not going to do anything stupid,” Derek tells him. He looks down at Sam, then up at Stiles. “I have obligations other than myself these days.”</p>\n<p>Stiles smiles faintly. Derek says, “You better get out of here; Sam’s going to be late.”</p>\n<p>“Right,” Stiles sighs, getting to his feet. “You ready, Sam?”</p>\n<p>Samantha sighs petulantly but gets to her feet with a nudge from Derek, who says, “Aunt Laura’s going to pick you after school, all right?”</p>\n<p>Sam nods and Stiles says, “I’ll see you at noon.”</p>\n<p>“See you,” Derek says, sounding a little forlorn.</p>\n<p>Stiles drops Sam off at her elementary school. There are deputies stationed there as well, two at each entrance. Ostensibly, it’s to ensure the safety of the entire school, but Stiles knows they’re only there for Sam, in case Kate shows up. He heads home and takes a shower, feeds Oscar, changes into a fresh uniform. By the time he gets back to the station, it’s nearly nine and Scott’s just getting in. There’s no new news; there have been sightings of Kate Argent all over town reported by concerned citizens, but none of them have panned out.</p>\n<p>Scott shakes his head as they head out to their cruiser. “Allison said she’s probably holed up somewhere. Some detectives from the highway patrol came over to interview her dad last night – he’s Kate’s brother, you know? They hoped he might know if she had any hideouts in town, but he didn’t have any ideas.”</p>\n<p>Stiles gnaws on a fingernail. “You think that’s true?”</p>\n<p>Scott shrugs. “Seems likely. I mean, no one’s found any trace of her so far.”</p>\n<p>Stiles heaves a sigh. “Do we even know how she escaped from prison?”</p>\n<p>“It was a high-security prison,” Scott says, shaking his head. “Sounds like she went full-on <em>Shawshank Redemption.”</em></p>\n<p>They’re on regular patrol for the morning – not part of the team that’s searching for Kate Argent. It’s a slow day; they help a woman on the highway fix a flat tire, serve a welfare check on an old man, make accident reports on a couple minor fender-benders. Right around noon, Scott drives them to the hospital to pick up Derek, who’s already sitting outside, looking pale in the watery sunlight.</p>\n<p>“There’s my criminal,” Stiles says cheerfully, climbing out of the cruiser and opening the back door for Derek, who gives him a sour look, but climbs inside.</p>\n<p>“How’re you feeling?” Scott asks, glancing over his shoulder at Derek.</p>\n<p>“Stiff,” Derek replies, frowning out the window. “They had me doing physical therapy all morning.”</p>\n<p>The ride’s quiet for about five minutes, the silence only broken by the crackle of the radio. Most of the communication about Kate is on another channel, but it’s on the forefront of everyone’s mind, which is probably why Derek abruptly asks, “Any news?”</p>\n<p>Stiles looks over at Scott, who shakes his head. “Nah, man. We haven’t picked up any trace of her yet.”</p>\n<p>Derek nods shortly, turning his eyes back to the window.</p>\n<p>“Do you know anything that might help?” Scott asks slowly, watching Derek in the rearview mirror. “Any sort of hiding place she might have had?”</p>\n<p>Derek shakes his head, his jaw tightening. “She never mentioned anything.”</p>\n<p>They pull up in front of Derek’s house a few minutes later, and Stiles gets out so he can pull open the door. “Can I walk you to the door?” he asks Derek, who nods, his mouth quirking up on one side. “Be right back,” Stiles tells Scott, who waves.</p>\n<p>He and Derek walk up the driveway together, Stiles’ arm around Derek’s waist. He walks slowly, teeth gritted like he’s thinking about punching something. “You going to be okay?” Stiles asks when they get up on the porch.</p>\n<p>Derek rolls his neck and says, “I’ll be fine. I’m just going to go sleep it off.”</p>\n<p>Stiles looks around the neighborhood – at the squad car sitting out on the street, at the quiet houses around them. “She’s not around, is she?”</p>\n<p>Derek lifts his head and inhales deeply several times. He shakes his head. “No.”</p>\n<p>“If she does show up, don’t – “ Stiles cuts himself off. “Just call me, okay?”</p>\n<p>“I’m not going to do anything stupid,” Derek says patiently, like he knows what Stiles was going to say. “I told you.”</p>\n<p>“I know,” Stiles says uneasily. “I just don’t like this.”</p>\n<p>“She’ll show up eventually,” Derek replies, his voice taking on an ugly tone. “She always does.”</p>\n<p>Stiles swallows. “We still on for tonight?”</p>\n<p>Derek nods. “As long as you’re not working.”</p>\n<p>“I’ll let you know,” Stiles says. “I’ll see you.”</p>\n<p>“See you,” Derek murmurs, pressing a kiss to Stiles’ forehead. Stiles waits for him to get inside before he heads back to the cruiser.</p>\n<p>Scott grins at him as they pull off down the street. “You two are such saps.”</p>\n<p>“Shut up,” Stiles mutters. “Isaac told me how bad you and Allison were in high school.”</p>\n<p>“Young love,” Scott says solemnly, then cracks up when Stiles punches him in the arm.</p>\n<p>-</p>\n<p>They’re finishing up a call at a house – attempted B &amp; E – when Stiles’ phone starts ringing. He doesn’t usually answer calls on the job, but when he checks the screen, he’s startled to see it’s Laura. Stiles waves at Scott, who jogs over to take care of the victim, and steps outside, bringing his phone up to his ear.</p>\n<p>“Hello?”</p>\n<p>“Hi, Stiles,” comes Laura’s voice. It sounds like she’s trying hard to sound calm. “It’s Laura Hale. Um. Have you heard from Derek?”</p>\n<p>“No,” Stiles says, a cold, worried feeling creeping over him. “I mean, we dropped him off at the house around noon. Why? What’s going on?”</p>\n<p>“I just came to drop Sam off and he’s not here,” Laura says, her voice cracking. “Can you – “</p>\n<p>“We’re on our way,” Stiles snaps, and darts back inside. “Scott!”</p>\n<p>Scott looks up and frowns at the expression on his face. He passes the victim off to the second unit and steps over to Stiles. “What’s going on?”</p>\n<p>“Derek’s missing,” Stiles says, stumbling over his words. “Laura – she just went to drop Sam off and he’s not there, and – and – ”</p>\n<p>“Okay,” Scott says firmly. “Let’s go.”</p>\n<p>They’ll probably get reprimanded for using the sirens later, but Stiles doesn’t care; he clenches at his knees and glares out the window as buildings flash past. Laura’s standing on the front lawn when they get to Derek’s house; she’s got her baby in her arms and all her kids and Sam are sitting in a circle around her.</p>\n<p>“Stay here,” she order them when Stiles and Scott spill out of the car, and steps across the lawn toward the duo, her brow furrowed with worry.</p>\n<p>“Have you gone inside?” Stiles asks, checking his gun.</p>\n<p>Laura shakes her head. “I can hear from here – there’s no one inside.”</p>\n<p>“She’s right,” Scott says, his eyes fixated on the house.</p>\n<p>Stiles forces himself to exhale, because the absence of a heartbeat doesn’t mean that Derek’s not in there. <em>He’s fine,</em> Stiles tells himself, and follows Scott up the driveway, pulling the spare key from its hiding place, which he hands to Scott. Scott shakes his head, pointing at the lock; the wood around it is splintered – someone’s kicked it in already. Stiles curses under his breath and steps inside after Scott, almost running into him when he stops short.</p>\n<p>“She was here,” Scott says quietly. “I can smell her – it’s the same scent from the accident.”</p>\n<p>“Shit,” Stiles swears. “She took him?”</p>\n<p>“I can smell blood,” Scott says ominously, and Stiles’ stomach plummets.</p>\n<p>“Where?” he asks hoarsely, and Scott motions him forward, leading him into the kitchen. It’s in complete disarray; the floor’s covered in shards of broken pottery, a couple of the cabinet drawers hanging askew. The back door’s open and there’s blood on the doorjamb.</p>\n<p>“Look,” Scott says, pointing at the floor; there are bloody footprints smeared across the tile, dark droplets of blood still shining wetly on the porcelain.</p>\n<p>“Is it Derek’s?” Stiles mumbles.</p>\n<p>“Can’t tell,” Scott replies, clapping him on the shoulder. “Could be a mixture.” Scott turns away, pulling out his radio to call in back-up. Stiles stands still, staring down at the mess around his feet, and something clicks.</p>\n<p>He remembers reading through Kate Argent’s trial transcripts. One of the biggest questions had been how she’d been able to get into the house in the first place, and as it turned out, there was a network of tunnels under the Hale house, a remnant from an era when werewolves weren’t looked upon so kindly by society, when sometimes even your own house wasn’t safe. That’s where she’s taken Derek, Stiles knows with sudden blinding certainty. That’s where they’ll be.</p>\n<p>Stiles turns as if moving on automatic and heads for the front door. He’s already on the porch when he hears Scott call his name behind him, and he breaks into a trot, crossing the yard and reaching the cruiser just as Scott appears at the front door.</p>\n<p>“Stiles, don’t!” Scott bellows at him, but Stiles is already climbing into the cruiser. “Where are you going?”</p>\n<p>“It’s the tunnels!” Stiles yells back and Laura, standing frozen in the middle of the lawn, goes pale.</p>\n<p>He’s never been to the Hale house, but he knows where it is – out in the woods in the middle of Beacon Hills Preserve. In recent years, it’s become a place for teenagers to hang around in, making out and breaking shit. He’s never been on one of the nuisance calls, but he knows it’s become enough of a problem that the county’s been trying to get Laura to get it torn down. She’s been reluctant, which he understands.</p>\n<p>Stiles pulls off the road long before he gets to the house – he doesn’t want Kate to hear the car. He stalks through the trees, scanning the ground for one of the humps that’s hiding a tunnel entrance and finally finds one about two hundred yards from the house, a metal grille that’s been pulled to one side. Stiles crouches down outside it, checking his gun and chambering a round – he grabbed the rifle from the squad car, because he’s not taking any fucking chances where Derek’s concerned. He could wait – Laura’s probably told Scott what he meant, and back-up can’t be far behind, but he doesn’t dare wait. There’s no telling what Kate wants Derek for – or whether she needs him alive at all.</p>\n<p>Stiles takes a deep breath and drops down into the tunnel, landing as lightly as he can. The dirt floor’s muddy under his feet, though it grows solid the further away he gets from the entrance. The walls are stone and covered in moss – though when he rounds a corner, they become blackened and the air smells faintly of smoke. Stiles grits his teeth. There’s a door hanging open up ahead and he can hear faint metallic sounds.</p>\n<p>Stiles closes his eyes and counts to ten before he moves forward, treading silently on the dirt floor. He stops outside the room, listening, picking out sounds over the pounding of his heart. Someone’s moving around inside; he can hear soft footsteps, a faint humming. There’s a click and a pained gasp and then a woman’s voice says, “Tell me where she is.”</p>\n<p>Stiles grimaces. That’s her, that’s Kate – he recognizes her voice, low and raspy, from yesterday – the blonde woman at the gas station. Fuck, if only he’d <em>known.</em></p>\n<p>“Sweetheart,” Kate says patiently. “I’m not gonna hurt a hair on her head, but if you don’t tell me where she is, I’ll kill all your sister’s whelps in front of her and it’ll be <em>all your fault.”</em></p>\n<p>Stiles peers around the doorway and the first thing he sees is Derek. He’s strapped to a table next to what looks like a car battery wired to his body. Kate’s standing next to the table, her back to the doorway, and she’s got her hand on the battery. Her fingers twist and Derek’s body tenses, his back arching off the table. Stiles’ mouth goes thin when he realizes that Kate’s shocking Derek – she’s fucking <em>torturing</em> him. Her hand moves again and Derek collapses back against the table, his head lolling to the side. He doesn’t seem to see Stiles. That’s enough.</p>\n<p>Stiles steps into the doorway, raising the rifle to his shoulder. “Put your hands in the air,” he announces loudly. “Turn around slowly.”</p>\n<p>Kate glances over her shoulder at him and a smile spreads across her face. “Deputy,” she says cheerfully, turning around and leaning against the table. “Nice to see you again. You were <em>so</em> helpful yesterday – thank you!”</p>\n<p>“Put your hands in the air,” Stiles repeats. “Get on the ground.”</p>\n<p>Kate doesn’t move. She taps her nails against the table and says, “I’m glad to see you again, Deputy…Stilinski, wasn’t it? I saw you earlier, when you dropped Derek off at the house. Quite the pair of lovebirds.” She reaches back almost absently, and strikes Derek sharply across the face. He hisses, blinking blearily at her. Kate laughs. “Got a call from my father a couple weeks ago. He told me Derek was seeing someone new. Wasn’t very happy about you tackling him.”</p>\n<p>“Get on the fucking ground,” Stiles growls. His stomach’s roiling, but he’s not going to let Kate get to him.</p>\n<p>She laughs again and moves fast, snatching a sawn-off shotgun up off the table. “No, sweetheart,” she smiles, leveling the shotgun at him. “I don’t think I will.”</p>\n<p>For a few long seconds, there’s silence. Stiles keeps his hand on the trigger, sweat sliding down the back of his neck. He’s got his bulletproof vest on, but it’s only rated against handguns, not shotguns, and it won’t do him any good if Kate aims for his head. “What do you want?” he rasps, eyes flickering to Derek.</p>\n<p>“Easy,” Kate says steadily. “I want my daughter.”</p>\n<p>Derek makes a furious noise. “You’re not her mother! She knows who you are – she knows you’re evil to the core!”</p>\n<p>Kate laughs, unconcerned by Derek’s rage. “Young minds,” she tells him sweetly. “They’re moldable, sweetheart. A couple months under my wing and she’ll forget who you are.”</p>\n<p>Derek snarls, fighting to break the straps binding him to the table. Stiles steps forward and Kate’s gaze swings back to him. “Uh, uh, darling. You stay right there.”</p>\n<p>“It’s not going to happen,” Stiles snapped at her. “No one’s letting you near Sam.”</p>\n<p>“Oh, Sam,” Kate sighs. “That was your youngest sister’s name, wasn’t it, Derek? Samantha? What an adorable tribute.”</p>\n<p>Stiles keeps his eyes on Kate, but his attention is distracted by the sound of voices echoing down the tunnel. He freezes and prays that Kate hasn’t heard it, but his luck doesn’t run that way – she smiles at him and says, “Reinforcements? Sounds like you’ve got a choice to make, sweetheart,” and before Stiles can understand what she means, she swings her gun behind her and shoots Derek in the stomach. He howls in pain, body arcing and Stiles gets it – Kate wants him to have to choose; will he catch her or help Derek?</p>\n<p>Maybe she thinks he’s soft. Maybe she thinks he’ll panic. Maybe she’s forgotten that he’s a cop and he’s been trained for every stressful situation on the planet. Stiles drops slightly as she turns to him with her gun raised once more, his footing solid, and shoots her in the chest. Later, he’ll think back on the surprise on her face with a vicious sense of triumph, but for now, he doesn’t stop. Even as she hits the floor, he’s moving forward, flipping her onto her stomach and cuffing her hands behind her back.</p>\n<p>Only then does he rise to focus on Derek. There are feet pounding down the hall toward him, but Stiles tunes them out, all of his attention on the way the gunshot wound on his stomach is pumping out blood with every breath. Derek’s panting hoarsely, his pupils pinpricks – shock, Stiles thinks, with an odd sense of clinical detachment – and the way the wound’s going black around the edges tells him that Kate’s shotgun shells had wolfsbane mixed in with the gunpowder.</p>\n<p>He has to get the slug out before Derek can heal and he doesn’t think twice about it before he sticks two fingers in the wound. Derek roars again, bucking under Stiles, but the fact that he’s strapped to the table helps Stiles out – Stiles isn’t sure he’s in control right now, his fingernails popping into claws. “I’m sorry, I’m sorry,” he chants.</p>\n<p>Derek’s stomach is warm and wet and Stiles would puke, but he can’t let himself think about it. His probing fingers close around the slug and when he pulls it out, he’s relieved to see it’s still in one piece. There are other deputies in the room with him now, milling around, pulling Kate to her feet, but Stiles ignores them steadfastedly, his hands going to his utility belt and the small pouch that every deputy carries. Inside is a vial of dried wolfsbane and a lighter and he pours the wolfsbane onto the table but he struggles with the lighter; his fingers are slick with blood and can’t seem to grip on the wheel.</p>\n<p>Stiles nearly panics until someone else reaches out, touching flame to the pile of wolfsbane, and Stiles looks up to see Scott standing next to him, a reassuring smile on his face. “Thanks,” Stiles pants as the wolfsbane goes up in a shower of green sparks. Scott nods and Stiles scoops the ashes into his palm, then presses them into the wound on Derek’s stomach. Derek groans, his body tensing, then relaxing in a full-body shudder. Only then does Stiles twist away and puke.</p>\n<p>By the time he straightens, wiping at his mouth and shaking a little, Scott and one of the other deputies have unstrapped Derek, and another’s carefully unhooking him from the car battery. Derek sits up slowly, wincing as his wound stretches with the movement. He meets Stiles’ eyes, face narrow with exhaustion, his eyes sad. Stiles tries to drudge up a smile.</p>\n<p>“Guess our date’s off, huh?”</p>\n<p>-</p>\n<p>There is no date. What there is are hours of interviews. Stiles repeats his story multiple times, gets yelled at by his dad for charging in without a plan, answers question after question. His gun is taken until an internal investigation determines whether his use of force was justified. Kate’s in the hospital – his father tells him that she’s in serious condition, but expected to pull through, and Stiles doesn’t know whether to be disappointed or relieved. She’ll be sent back to prison as soon as she’s recovered, and there will be another trial in a couple of months for her latest crimes. Apparently the tunnels under the Hale house are just one of multiple caches she and Gerard have hidden around the county, stocked with weapons and clothes and other supplies.</p>\n<p>Derek’s fine; he was brought back to the hospital for a check-up, but Scott texts Stiles at some point in the night to let him know that Derek’s all right and back at home with Sam. Stiles spends a lot of time in between interviews staring at the clock, wishing he could see him. There’s still blood underneath his fingernails and he thinks of Derek every time he catches sight of it.</p>\n<p>“Well,” his father sighs, sometime near midnight. “I think we’re done with you for now. Why don’t you take a couple of days off, come back next week?”</p>\n<p>Stiles scrubs his hands over his face, exhausted to the core of his very being. “Yeah, okay.”</p>\n<p>“Stiles,” his dad says softly, and Stiles turns to look at him. “As your superior officer, I can’t say that I’m pleased with your decisions today, but as your father…Scott told me how level-headed you were when you were taking care of Derek’s gunshot. I’m proud of you.”</p>\n<p>“Thanks, Dad,” Stiles says, his throat tightening, and he accepts the hug his father offers him, his father’s firm grasp steadying him.</p>\n<p>When Stiles gets outside, he has to sit in his car for a few minutes, breathing in slowly. He’s never shot anyone before – he can’t stop replaying the surprised look on Kate Argent’s face when he pulled the trigger. The department mandates therapy after a shooting, and he thinks he might need it.</p>\n<p>When Stiles finally turns the car on and drives, it’s not until he comes to a stop that he realizes that he hasn’t driven home – he’s driven to Derek’s house. Stiles stares up at the dark house and scrubs his hands over his face again. He’s too tired. He’s pulled two double shifts in the last two days. He just wants to sleep for a thousand years – is that so much to ask?</p>\n<p>As he sits there, trying to build up the enthusiasm to drive home, the porch light comes on and Derek steps outside, bare-chested and in sweatpants. Stiles sighs softly, relieved to see the skin on his stomach smooth and unmarred. Derek doesn’t move, just watches him, and after a few long seconds, Stiles climbs out of the car and crosses the lawn. He climbs up the stairs and doesn’t stop, wrapping his arms around Derek’s neck. Derek exhales roughly and curls his arms around Stiles, holding him close. Stiles shuts his eyes, breathing in deeply.</p>\n<p>“You wanna stand out here all night?” Derek murmurs. “Or you wanna come inside?”</p>\n<p>“Please,” Stiles whispers.</p>\n<p>Derek brushes his nose against Stiles’ jaw before he pulls away, taking Stiles by the hand and leading inside the quiet house. They make their way upstairs and into Derek’s bedroom. Stiles bows his head as Derek tugs his clothes off, stripping him down to his boxers, his hands gentle. Stiles peels back the covers as Derek pulls off his sweatpants and they sink into bed together. Stiles sighs softly as Derek rolls on top of him, winding his limbs around Derek like an octopus.</p>\n<p>“Glad you’re safe,” he mumbles.</p>\n<p>“Glad you came for me,” Derek replies softly, tucking his face against Stiles’ neck.</p>\n<p>“I’d do anything for you,” Stiles says before he even thinks about what he’s saying.</p>\n<p>“I know,” Derek says without hesitation. “I’d do the same.”</p>\n<p>Stiles tightens his grip on him and Derek presses a kiss to his jaw. “Sleep,” Derek murmurs.</p>\n<p>“Oh, I plan on it,” Stiles mutters. “The next three days, at least.”</p>\n<p>Derek laughs quietly. “I’m with you there.”</p>\n<p>“Good,” Stiles mumbles, kissing Derek’s temple.</p>\n<p>He falls asleep underneath Derek, his weight solid and reassuring, and wakes up to tiny hands pattering against his cheeks. Stiles forces his eyes open to see Samantha leaning over the edge of the bed, staring down at him. Derek’s not next to him.</p>\n<p>“Hey, Sammy,” Stiles says groggily. “Wassup?”</p>\n<p>“I wanted to say thank you,” she tells him solemnly. “For finding my dad.”</p>\n<p>“Hey,” he says, smiling wearily. “That’s my job.”</p>\n<p>Derek comes into the room, running a hand through his hair. “Sam,” he says. “Let Stiles sleep.” Sam nods and bounces out of the room, leaving Derek to take his turn in leaning over Stiles. “Go back to sleep,” he says softly, brushing a hand over Stiles’ hair. “I’ll be back soon.”</p>\n<p>“I’ll be here,” Stiles mumbles, curling his fingers around Derek’s wrist and squeezing gently before letting go. He closes his eyes, listening to Derek rise and head downstairs. There are voices for a while, the high tone of Sam and the deeper notes of Derek, and then silence – and whether Stiles has fallen asleep or they’ve left the house is anyone’s guess.</p>\n<p>When Stiles wakes later, the room’s just as dark as it was before, and it takes him a long moment to realize it’s raining heavily outside, beating against the windows. He hums quietly, warm and content, happiness growing when he lips onto his other side and finds Derek back in bed next to him, curled on his side with his back to Stiles. Stiles scoots closer, hooking an arm over Derek’s side and Derek shifts minutely, making a quiet questioning noise.</p>\n<p>“’s this what you do every morning?” Stiles murmurs, cheek pressed against Derek’s warm shoulder. He’s not wearing a shirt and his skin is smooth, almost hot to the touch. “Bring Sam to school and go back to bed?”</p>\n<p>“Not usually,” Derek rumbles quietly, his chest expanding and contracting as he breathes. Stiles noses absently at the heavy black spirals tattooed between Derek’s shoulder blades. “Sometimes I have to work. Sometimes Laura dumps her kids on me.”</p>\n<p>“Hm,” Stiles says. “Are we in danger of that this morning?”</p>\n<p>“No,” Derek replies, a note of triumphant in his voice. “I told her if she tried to push her kids off on me today, there’d be hell to pay.”</p>\n<p>“Showed her,” Stiles murmurs. “You got plans?”</p>\n<p>Derek shifts onto his back, his hand rising up to cup Stiles’ cheek. “Only you.”</p>\n<p>Stiles licks his lips, face flushing with pleasure. “You sure?”</p>\n<p>“Very sure,” Derek says softly, rubbing his thumb along Stiles’ cheekbone.</p>\n<p>Stiles smiles. “How are you feeling?”</p>\n<p>“Fine,” Derek assures him, taking Stiles’ hand in his, guiding Stiles’ palm to the firmness of his stomach, where his skin is smooth and warm and shows no signs of ever being blown open by a shotgun. “One hundred percent whole.”</p>\n<p>Stiles curls his fingers against Derek’s skin and swallows, briefly flashing back to yesterday, when he’d had to shove his fingers <em>inside</em> Derek. Derek makes a quiet noise, like he knows what Stiles is thinking. “You saved me,” he says softly, thumb sweeping back and forth against Stiles’ face. “You keep taking care of me.”</p>\n<p>Stiles swallows again, bites back the <em>because I love you</em> – too soon, too soon, he reminds himself – and says, “What else would I do?”</p>\n<p>Derek smiles faintly. “The world feels balanced,” he says quietly. “Hasn’t for a long time.” His smile widens. “I think you’re to blame.”</p>\n<p>Stiles flushes, pleased beyond measure, and blurts, “Can I kiss you?”</p>\n<p>Derek blinks sedately. He looks like he’s going to start purring soon. “You’re asking now?”</p>\n<p>“I’m gonna explode soon,” Stiles tells him earnestly. He drags his fingers over the phantom wound in Derek’s stomach. “And I wanted to make sure this isn’t superficial and you aren’t still hurt.”</p>\n<p>“I’m good,” Derek assures him quietly, his eyes heavy-lidded and dark. “Your ribs okay?”</p>\n<p>“They’re <em>fine,”</em> Stiles says impatiently, and surges forward so eagerly that he head-butts Derek in the nose. Derek grunts in pain but doesn’t seem all that bothered; he fists his hand in Stiles’ hair and aligns their mouths properly, dragging his lips against Stiles’ before kissing him for real. Stiles sighs into his mouth, all the tension of the past couple of days’ events draining from him, replaced instead by a jittery white energy that consumes his body whole, infusing his bones and lighting his brain on fire. It sizzles everywhere Derek touches him – and Derek touches him all over, drags his fingertips along Stiles’ spine and counts his ribs and scrapes against the trail of hair disappearing into his boxers.</p>\n<p>Stiles sighs again as Derek flips them, rolling Stiles onto his back so he can straddle his body, tilting his head to drag his lips over Stiles’ skin. Stiles sinks his hands into Derek’s silken hair, fingernails scraping against his scalp.</p>\n<p>“What do I smell like?” he asks suddenly, and Derek lifts his head.</p>\n<p>“Today?” Derek sinks between the vee of Stiles’ thighs, a thoughtful look on his face. “Gunpowder. Sweat. A little bit of blood.”</p>\n<p>Stiles screws his face up. He scratches at Derek’s hair and Derek closes his eyes, his fingers tensing and relaxing where they rest at Stiles’ side, over and over. “Is that I usually smell like?”</p>\n<p>“No,” Derek says, opening his eyes again. He leans forward, licking a stripe up Stiles’ chest, lips catching at Stiles’ nipple. Stiles hisses and Derek bends his head, pressing his nose to the crook of Stiles’ armpit. “Warm grass. Sugar. Lightning.”</p>\n<p>Stiles shudders at the way Derek’s eyes flash electric blue, his dick twitching. Derek drags blunt, human teeth against Stiles’ armpit, nipping at the thin, tender skin above his ribs. Stiles groans, his cheeks flooding with warmth, and Derek sinks back, slotting his mouth over Stiles’ nipple and biting down.</p>\n<p>“Fuck,” Stiles hisses. “Will you stop fucking <em>teasing</em> me?”</p>\n<p>Derek laughs low in his throat, the noise vibrating against Stiles’ skin, and rises onto his knees to shimmy out of his sweatpants. He’s commando underneath and already hard, the tip of his cock flushed red and arching toward his stomach. Stiles swallows, his mouth watering because he suddenly, desperately, needs Derek’s dick in his mouth.</p>\n<p>“Come here,” he gasps, gesturing at Derek. “Fuck, come <em>here.”</em></p>\n<p>Derek’s eyes darken, pupils expanding so there’s only a thin ring of bright blue showing around their edges, and shifts forward, straddling Stiles’ chest. “You sure?” he breathes, fisting the base of his cock, eyeing Stiles’ mouth hungrily.</p>\n<p><em>“Please,”</em> Stiles says, a little desperately. Derek licks his lips and leans forward, guiding himself into Stiles’ waiting mouth, and Stiles moans around him, his hands coming up to dig into Derek’s hips. Derek moves carefully, the breath hissing out of him as he shifts his hips in and out. It’s not awesome – the angle’s not right for Stiles to take him as deep as he’d like – but at the time it’s <em>great</em> because Stiles his lips wrapped around the velvety smooth length of him, and Derek’s groaning above him, hands pressed flat against the wall to keep his balance. Stiles may not be able to dissect Derek’s scent like Derek can with his, but the smell of him is strong here, warm and rich and comforting like autumn air.</p>\n<p>Maybe they lose themselves a little, some of the care falling away from Derek, thrusting harder, panting harshly. Stiles closes his eyes and relaxes his jaw, fingers kneading at the firm swell of Derek’s ass. One of his hands drops, fingertip brushing against Derek’s hole, and Stiles hears his breath hitch, hips stuttering. <em>Oh,</em> Stiles thinks wickedly, and presses harder, teasing at his entrance. Derek groans, one of his hands leaving the wall to cup Stiles’ jaw, fingers tracing his cheek. Stiles opens his eyes to look up at Derek and finds his eyes closed, head thrown back, mouth open. It’s pure joy to watch his face when Stiles presses a finger inside of him – his cheeks flood red, eyes open in surprise. Derek’s whole body jolts forward and he comes without warning, shooting down Stiles’ throat with a groan.</p>\n<p>“Oh my god,” Derek wheezes immediately, carefully pulling out of Stiles’ mouth. “Jesus, I’m sorry – ”</p>\n<p>“Don’t you dare apologize,” Stiles replies dreamily, wiping at his mouth with the back of his hand. “That was amazing.”</p>\n<p>Derek sinks down slowly, looking slightly uncertain. Stiles rubs his palms over Derek’s thighs and says reassuringly, “I’m not gonna break.” He adds, his voice dropping lower, “You looked so fucking good. I wanna suck you off every day.”</p>\n<p>Derek flushes and drops his head, a small tremor running through his body. Stiles squeezes his leg. “What do you want, Der?”</p>\n<p>Derek flushes darker, right down to his chest, but he meets Stiles’ eyes firmly. “I want to get you off.”</p>\n<p>“’s not going to be hard,” Stiles admits woefully.</p>\n<p>Derek grins, sinking back down next to him. “Good thing there’s plenty of time left in the day.”</p>\n<p>“Mm, I like the sound of that,” Stiles says, pulling himself on top of Derek. “Y’think you can get it up soon? I’d really like to get fucked.”</p>\n<p>“I can do that,” Derek replies, trailing his fingers along Stiles’ jaw. “Or you can fuck me.”</p>\n<p>“Can I?” Stiles brightens. “D’you have lube?”</p>\n<p>Derek pushes him aside and leans over the edge of the bed, resurfacing with a plastic bag. “I picked some stuff up the other day,” he says triumphantly.</p>\n<p>“You are so thoughtful,” Stiles says cheerfully, nudging Derek with his knee as he tugs off his underwear. He hisses faintly as the cool air touches his bare skin – it feels amazing, but he knows Derek’s going to feel even better.</p>\n<p>Derek smiles shyly as he pulls a tube of lube out of the bag and hands it to Stiles. “Do you want a condom? I got those too.”</p>\n<p>“Only if you want me to wear one,” Stiles says, rubbing a hand against Derek’s knee. Derek shakes his head and chucks the bag back on the floor. Stiles laughs and sinks back down on top of him, framing Derek’s head with his arms so he can lean in and kiss him silly. Derek hums, sounding pleased, and curls his arms around Stiles’ shoulders, hands firm against his skin. He seems reluctantly to let go when Stiles moves backwards, but he smiles when Stiles catches one of his hands, pressing kisses to his palm and the rough, calloused pads of his fingertips.</p>\n<p>When Stiles sinks between his legs he doesn’t move right away, absently rubbing his cheek against the soft skin of Derek’s inner thigh. He smells like sweat now – the whole room smells like sex; even Stiles’ human senses can pick that up – and it’s heady. He closes his eyes while he opens the lube, squeezing a small amount onto his fingers.</p>\n<p>“You okay?” Derek asks quietly.</p>\n<p>Stiles opens his eyes and looks up at him with a smile. “Yeah. You?”</p>\n<p>“Never better,” Derek says, one corner of his mouth quirking up. Stiles keeps his eyes focused on Derek’s face when he presses a finger inside him, watching the way he throws his head back against the pillows, exposing the long, pale line of his throat. Stiles swallows at the sight; he’s going to get his mouth <em>all over</em> that as soon as he’s inside. The thought makes him move faster, rapidly stretching Derek with one finger, then two, then three.</p>\n<p>“You’re so good,” Stiles murmurs, watching the muscles in Derek’s torso strain as he resists shoving back against Stiles’ hand. Stiles straightens and rubs his hands against Derek’s thighs, fingers digging into the tense muscle. Derek groans at the loss of Stiles’ fingers, tossing his head impatiently, his cheeks flushed. “Don’t worry,” Stiles says soothingly, slicking his cock with lube. “I’m not going anywhere.”</p>\n<p>Derek’s eyes land on Stiles’ face, burning neon blue. <em>“Fuck me,”</em> he snarls.</p>\n<p>“You shouldn’t make demands of the person about to dick you,” Stiles reprimands lightly, holding on to the base of his cock so he can guide himself inside so achingly slow.</p>\n<p><em>“Fuck</em> that,” Derek snaps, and jolts his hips back, shoving himself against Stiles in one sharp movement. Stiles hisses and falls forward onto his hands, struggling to match Derek’s pace.</p>\n<p>“Dude,” he hisses. “We’ve got all day, remember?”</p>\n<p>“I know,” Derek replies, pulling him down for a rough kiss, his teeth catching at Stiles’ lip. “I want as much of this as possible.”</p>\n<p>“Oh yeah?” Two can play at that game, Stiles decides, tilting his head to sink his teeth into Derek’s throat. Derek cries out roughly, his body arching off the bed with a shudder. Stiles grins and straightens, pressing Derek’s legs forward so he can fuck into him deep and hard. There’s sweat building on him, gathering in the curve of his spine and hollows of his throat and palms of his hands. It makes it hard to hold onto Derek but Derek seems to like it when Stiles digs his fingernails in if the way his head tilts back and his mouth falls open is any way to judge. Derek’s hard again, his cock flushed and leaking precome against his stomach, jolting with every thrust of Stiles’ hips.</p>\n<p>Stiles isn’t going to last much longer at this pace, but he wants to savor this. He drops forward again, slowing his pace, and he takes a gamble – Derek’s not pleased by the sudden decrease in speed, Stiles can see it in his eyes, and when he tries to move his hips and get Stiles going again, Stiles curls a hand over his throat. He doesn’t squeeze at all, just keeps his head there with light pressure.</p>\n<p>Derek pauses, his lips parting, and Stiles suddenly feels incredibly guilty. “Sorry,” he says quickly, pulling his hand away. “I shouldn’t have – sorry.”</p>\n<p>“Do it,” Derek croaks, his eyes wide. “Please, fuck – “</p>\n<p>Stiles swallows and puts his hand back on Derek’s throat. He squeezes this time, just a little, and Derek throws his head back with a faint noise, his eyes burning such an intense blue that Stiles can see the light reflected off the headboard and it completely does him in, knowing Derek trusts him so implicitly. So much for savoring the moment – Stiles only gets another couple of thrusts in before he comes with a weak cry, fingers fluttering against Derek’s neck.</p>\n<p>He has to stop for a long moment, struggling to catch his breath as his legs shake with residual pleasure. He can’t stop completely, though – Derek’s still hard – so he keeps one hand on Derek’s throat and one hand wrapped around his cock and jerks him off with all the finesse he can muster, muttering, “You’re so good, god, Der, c’mon, come for me, please – “ And Derek throws a hand over his eyes, panting harshly as he comes, dirtying his stomach with white streaks.</p>\n<p>Only then does Stiles collapse next to him, boneless, so hot he’s sure steam must be rising off of him. He watches Derek stare up at the ceiling, watches the rise and fall of his chest slow. There’s a faint imprint of his hand on Derek’s neck and he shudders, unaware that he’d been holding Derek so hard – it fades as he watches, but he’d really like to bring it back sometime if Derek will let him.</p>\n<p>Derek’s eyes slide over to him. He reaches out, brushing his knuckles against Stiles’ cheeks. “Thanks,” he says quietly.</p>\n<p>“That wasn’t – I didn’t go too far, did I?” Stiles asks hesitantly.</p>\n<p>“No,” Derek replies softly. “You were perfect.”</p>\n<p>Stiles smiles, his face flushing with pleasure. “Good.”</p>\n<p>Derek stretches and Stiles watches the way his muscles shift greedily. “What do you say?” Derek asks. “Shower? Breakfast? Round two?”</p>\n<p>“Yes to all of that,” Stiles grins. “But – oh.”</p>\n<p>Derek gives him a slightly worried look. “What is it?”</p>\n<p>“It’s already past noon,” Stiles informs him.</p>\n<p>“Oh,” Derek says, glancing toward the clock on his nightstand. His shoulders droop. “Right. Do you have to go in to work?”</p>\n<p>“No,” Stiles says solemnly. “But no one’s serving breakfast anymore. Looks like we’re gonna have to get pizza instead.”</p>\n<p>Derek rolls his eyes and shoves Stiles into the pillows while Stiles laughs his head off. “Fucker,” he murmurs fondly.</p>\n<p>“Better get used to it,” Stiles tells him with a grin. “I’m not going anywhere.”</p>\n<p>The way Derek smiles at him, it doesn’t look like it’s going to be a problem.”</p>\n<p>-</p>\n<p>\n<strong>TWO MONTHS LATER</strong>\n</p>\n<p>Stiles runs, the sound of his breathing harsh in his ears. There are footsteps pounding through the woods behind him, crashing through bushes and snapping twigs - when he chances a glance over his shoulder, he sees at least three sets of golden eyes glowing in the gloom. They're still far off, several hundred years back in the trees, but they're catching up fast. Stiles puts on a burst of speed, hands reaching for his utility belt, but he forgot he's not wearing it - he's in civilian clothes, sneakers on his feet and only a thin tee on top.</p>\n<p>Stiles is so busy focusing on the sound of his pursuers that he noticed a tree too late and smacks his shoulder against it. The collision sends him stumbling, and before he can recover, three bodies smack into him, bearing him down into the damp leaves. Stiles struggles upright with a laugh, grinning down at the kids on top of him.</p>\n<p>\"All right, you caught me fair and square,\" he says. \"That's three times in a row. Don't I get to chase you all now?\"</p>\n<p>\"You're <em>slow,\"</em> says Paul, who's Laura's oldest son, with a scornful wrinkle of his nose. \"You'd never catch us.\"</p>\n<p>\"That hurts,\" Stiles replies, pretending to pout. \"Where'd everyone else go, anyway?\"</p>\n<p>As if in answer, a howl rises up through the trees somewhere off to their right. All the kids shriek excitedly and scramble off him, running back into the trees. Stiles snags Sam by the back of her shirt and she gives him an exasperated look over her shoulder.</p>\n<p>\"You seen your dad?\" he asks her.</p>\n<p>\"No,\" she says, with an impatient little jig. \"Lemme go!\"</p>\n<p>Stiles lets her shirt go and she flies off into the woods with a giggle, leaving him alone. He can hear the pack somewhere in the distance, laughing together, so he heads that way slowly, unhurried. He can hear Laura calling to the kids - it's getting late, the full moon hanging high overhead. Stiles isn't worried about being left behind; it's easy enough to see in the moonlight and someone will find him if he gets lost, anyway.</p>\n<p>Stiles hasn't gone far before he hears the soft snap of a branch in the trees behind him. He pauses, turning to look, but there's nothing to be seen, just silvery trees and dark shadows. Stiles starts walking again, a faint smile crossing his face. He listens and can hear faint footfalls in the loam behind him. His grin widens; he hasn't seen Derek since they entered the woods two hours ago, but he knows it's him - if it were a werewolf with malicious intent, he wouldn't hear them until they were on top of him.</p>\n<p>Stiles picks up his pace, jogging through the trees, and he hears Derek do the same. A quick glance over his shoulder rewards him with a flash of blue eyes, only serving to confirm it's Derek - he's the only one in Laura's pack with blue eyes, and this is their territory; it's highly unlikely to be an unfamiliar werewolf.</p>\n<p>\"Come catch me,\" Stiles whispers, knowing full well Derek can hear him, and bursts into a sprint. He's not as in shape as he was at the police academy - he could run a 5'30\" mile back then - but he's still fast. He didn't run all-out for the kids but he does now, sweat beading along his spine and temple as he sprints through the trees. Derek could easily catch him even at Stiles' top speed, but there's no fun in that for either of them. Derek's not bothering to keep quiet now and the sound of him crashing through the trees behind Stiles sets his blood pumping. The uncertainty - not knowing when Derek's going to catch him - is thrilling, even if he does shriek in surprise when Derek's arms close around him from behind five minutes later, swinging him off his feet and bearing him down into the leaves.</p>\n<p>Stiles is trapped under Derek's weight, stomach-down on the forest floor, leaves and twigs jabbing at his skin. It's not comfortable, but all he can focus on is Derek's breath, hot against the back of his neck, on the slow way he drags his lips against Stiles' skin, every place their bodies connect. Derek pulls Stiles' hands above his head, lacing their fingers together.</p>\n<p>\"You gonna eat me up?\" Stiles breathes. He's hard already, pumped full of adrenaline from the chase. He wonders how he smells to Derek, already wet and leaking into his underwear. He squirms under Derek; he could throw Derek if he wanted to - he's got the training - but he likes the feeling of being helpless, trapped under Derek's weight. \"You better take me home soon unless you planning on taking me right here.\"</p>\n<p>\"Don't tempt me,\" Derek murmurs, nipping at his throat. He shifts his weight, allowing Stiles room to roll onto his back. He touches his nose to Stiles', eyes half-closed and burning electric blue in the darkness. \"You have no idea how badly I want to.\"</p>\n<p>\"Oh, I think I do,\" Stiles replied, pressing his knee against Derek's crotch. He can feel Derek, already hard and hot, and Derek hisses, dropping down onto one elbow so he can dig his blunt teeth into Stiles' throat. Stiles groans, his back arching, fingers scrabbling at Derek's back. \"Seriously,\" he pants, when Derek unlatches his teeth and licks at the tender spot he's just made with long, slow sweeps of his tongue, \"Der, seriously, I'm going to have a repeat of the drive-in if you don't make some kind of decision <em>now.\"</em></p>\n<p>Derek tilts his head back and laughs, full-throated and joyous, and he bumps his nose against Stiles' once more before getting to his feet. \"Well,\" he says seriously, offering Stiles a hand, \"this sounds pretty dire. I think Laura will understand if we duck out early.\"</p>\n<p>\"Are you kidding me?\" Stiles replies cheerfully, looping an arm around Derek's waist as they begin walking off through the trees. \"Laura's going to know exactly why and she'll start offering <em>tips.\"</em></p>\n<p>Derek groans quietly. \"Maybe we shouldn't say anything, then. Just sneak off when she's not looking.\"</p>\n<p>Stiles laughs. \"I love how embarrassed your sister makes you.\"</p>\n<p>\"Number one reason why we're never hooking up in the woods,\" Derek grumbles. \"If she stumbled across us we wouldn't hear the end of it for <em>years</em>, and you <em>know</em> she'd find us somehow.\"</p>\n<p>\"Bummer,\" Stiles sighs. He's still sporting a half-chub, though it's receding now that his body's not pumping with adrenaline. \"I don't think I've ever been that turned on.\"</p>\n<p>Derek makes a soft, bemused noise, pressing his nose to Stiles' temple. \"Laura's not below bribery,\" he rumbles. \"Twist her arm hard enough and she'll watch Sam during the full moon. We can reenact our run tonight.\"</p>\n<p>\"With a different ending, right?\" Stiles grins.</p>\n<p>\"A very different ending,\" Derek agrees, his voice dropping an octave, making Stiles shudder.</p>\n<p>They’re getting close to the house now – lights can be seen through the trees, faint voices echoing through the wood. Erica laughs somewhere, her distinctive hyena cackle bouncing off the trees. It’s midwinter, and now that Stiles has stopped running he’s cold in just a tee shirt, shaking. He’s looking forward to going back to Derek’s, to tumble into his bed and get his body running hot again.</p>\n<p>Derek stops him at the edge of the tree line though, the arm he’s looped around Stiles’ shoulders tightening. Stiles looks wistfully toward the house, at the rest of the pack trailing toward the back door. Laura promised Tim would make hot chocolate and Stiles has had enough of Tim’s cooking over the past few months that he’s willing to delay sex for a few more minutes just to try it out. He doesn’t try to make a move for the house, though, waiting patiently for whatever move Derek’s going to make.</p>\n<p>Derek shifts his weight around, his eyes on the house. Stiles follows his gaze and sees Cora carrying Sam. He leans his weight against Derek, his body warm with cheer despite the cold. It’s been a long couple of months since the whole affair with Kate, even longer since that first day he’d met Derek with kids hanging off him, and he loves Derek more every day. He’d said so for the first time a couple of weeks ago after sitting on the words for ages, and he’d barely been able to get them out, murmuring them into Derek’s throat while they’d laid on the couch late one night watching <em>Finding Nemo</em>, of all things, with Sam asleep on the floor in front of the television. It hadn’t exactly been romantic but Derek hadn’t seemed to mind, inhaling against Stiles’ hair before returning with a soft, “Love you too.”</p>\n<p>“What’re you thinking about?” Stiles asks now, tilting his head against Derek’s shoulder.</p>\n<p>Derek exhales quietly and says, “Move in.”</p>\n<p>Stiles looks at him with a frown. “What?”</p>\n<p>“Move in,” Derek repeats, hesitatingly only a fraction of a second. “To the house. With us.”</p>\n<p>Stiles’ lips part, his mouth going dry. “You – you mean that?”</p>\n<p>Derek nods, meeting Stiles’ eyes steadily. “I want you around,” he says. “All the time.”</p>\n<p>“I – what about Sam?” Stiles asks, his throat tightening.</p>\n<p>“We talked about it,” Derek says simply. “You can ask her what she thinks.”</p>\n<p>“I will,” Stiles says, taking a step away from him. Derek’s arm falls from his shoulder and Derek’s face goes carefully blank.</p>\n<p>“You don’t have to say yes,” Derek tells him. “You can think about it – or you can say no. It was just an idea – ”</p>\n<p>“You’re a big sap, Derek Hale,” Stiles announces, a grin spreading across his face. “And I wouldn’t want you any other way.”</p>\n<p>Derek blinks, then a faint, hesitant smile tugs at his lips. “So?” he prods.</p>\n<p>“Hell yes,” Stiles answers. “A thousand times yes. You think there’s any way in hell that I could ever say no to you?”</p>\n<p>“You have,” Derek says, the smile on his face betraying the solemn intonation of his voice. “I asked you the other day if you wanted jam on your toast and you said no.”</p>\n<p>“Because grape jelly is the devil’s invention,” Stiles retorts, reaching out to grab Derek’s hand. “Everyone knows that strawberry is God’s chosen flavor.”</p>\n<p>Derek rolls his eyes, reeling Stiles in for a soft kiss. “I’m glad you want to move in,” he murmurs against Stiles’ lips. “Even if my taste in jams is sinful.”</p>\n<p>“Someone’s got to keep your daughter pure of heart,” Stiles replies quietly. “Might as well be me.”</p>\n<p>He’ll never get over the way Derek smiles when he’s truly happy, the way his eyes crinkle up at the corners and his rabbit teeth make an appearance. He’s still smiling when they get inside and Laura looks at them suspiciously, her nostrils flaring noticeably. They must pass muster, though, because she hands them each a mug of hot chocolate and pats Derek on the back. Sam wanders up and slips her hand into Stiles’, rubbing wearily at her eyes, and even better than the hot chocolate is the way Derek’s eyes go soft and liquid when he looks at them. <em>Family</em>, Stiles thinks, golden happiness flooding his veins. He sets down his mug.</p>\n<p>“Come on,” Stiles says quietly, reaching for Derek’s hand. “Let’s go home.”</p>"
}