{
  "id": "11600508",
  "url": "https://archiveofourown.org/works/11600508?view_full_work=true",
  "author": [
    "Quixoticity"
  ],
  "title": "Written in the Stars",
  "rating": "Mature",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "F/F",
    "F/M",
    "M/M"
  ],
  "fandoms": [
    "Teen Wolf (TV)"
  ],
  "relationships": [
    "Derek Hale/Stiles Stilinski",
    "Lydia Martin/Stiles Stilinski",
    "Scott McCall/Kira Yukimura",
    "Vernon Boyd/Erica Reyes",
    "Isaac Lahey/Jackson Whittemore",
    "Stiles Stilinski/Malia Tate"
  ],
  "characters": [
    "Derek Hale",
    "Stiles Stilinski",
    "Scott McCall",
    "Vernon Boyd",
    "Isaac Lahey",
    "Kira Yukimura",
    "Erica Reyes",
    "Allison Argent",
    "Jackson Whittemore",
    "Malia Tate",
    "Danny Māhealani",
    "Talia Hale",
    "Cora Hale",
    "Laura Hale"
  ],
  "additional_tags": [
    "Soulmate-Identifying Marks",
    "Alternate Universe - No Werewolves",
    "derek is a tattoo artist",
    "Derek is a Softie",
    "Oblivious Stiles",
    "Pining Derek",
    "Angst and Fluff and Smut",
    "Alive Hale Family",
    "Stiles is a teacher",
    "Friends to Lovers",
    "nobody uses their words"
  ],
  "language": "English",
  "series": "",
  "published": "2017-07-25",
  "completed": "2017-08-13",
  "words": "26,586",
  "chapters": "6/6",
  "comments": "557",
  "kudos": "10,776",
  "bookmarks": "2,498",
  "hits": "104,279",
  "summary": "<p>Derek Hale is a lucky guy. He's got a great family, good friends, and a fulfilling job as a tattoo artist.</p>\n<p>He's also one of the twenty-five per cent of the population born with a soul mark.</p>\n<p>He likes his life, but he's waiting for his soul-match. The odds of meeting them aren't great but hey, Derek's a lucky guy. He has faith.</p>\n<p>He can't believe how good his luck really is when one day his soul-match wanders right into his studio, all long limbs and copper eyes. There's just one problem: Stiles is there to get his soul mark covered up. Permanently.</p>",
  "notes": "<p>Thank you so much for your comments, it means a lot that you guys take the time to write them!</p>\n<p>Yuanfen: a Chinese concept that doesn't fully translate into English, concerning the fate or chance by which two people are brought together, a combination of serendipity and destiny; the binding force that connects people in any type of relationship.</p>\n<p>Kind of a bonus chapter because Chapter 3 got way too bulky, so I've split it into two and changed the overall number of chapters to five. It's basically all written so I'll post it as I stop messing with it; hopefully it will all be up by mid-week :D</p>\n<p>Thank you so, so much for reading and for commenting, honestly it makes my day.</p>\n<p>Sorry this is later than I'd hoped, summer is always crazy-busy for me. But there's another chapter to post later today to make up for it.</p>\n<p>Thank you so much for reading and commenting, I haven't been able to respond to the comments yet but I will be as soon as I can, and I really appreciate all of them!</p>\n<p>Warnings for irresponsible use of parenthesis in this chapter - please forgive me :)</p>\n<p>Thank you so, so much for all your amazing support and comments. Just one more chapter to go after this one, thanks for hanging in there!</p>\n<p>P.S. Just did a quick edit for tiredness typos, ugh! Hopefully better now :s</p>\n<p>Holy shit, this is finished. This has been my fic equivalent of an earworm (a fic-worm. is a that a thing? I feel like it's a thing.) so I'm both very happy and very relieved to conclude it!</p>\n<p>Thank you <u>so much</u> for making it to the end, and for your wonderful comments and support, which I have loved. x</p>",
  "text": "<p>Derek Hale is a lucky guy. </p>\n<p>He knows this to be true for a lot of reasons. He’s lucky to have his chaotic, embarrassing, and utterly devoted family, who tease him and support him and give him a place to belong. When he's in tenth grade there's a fire in the kitchen of their house that they all manage to escape unharmed, so he has no illusions about exactly how lucky he is to have them. </p>\n<p>He is fortunate to have (at least, so he’s been told) pleasing features and nice eyes, and combined with his natural athleticism this helps him make it through high school relatively unscathed by the cruelties some of the other kids suffer at the hands of their peers. </p>\n<p>He’s been blessed with a deep passion for books and reads voraciously, which means he ends up graduating somewhere near the top of his class. He’s popular enough that he's never lonely, his basketball team providing a natural pool of friendship that he dips into when he feels the need. At a dance in his final year he screws up his courage and gives his first kiss to a sweet girl named Paige. Luckily, she kisses back. </p>\n<p>He works hard to try and deserve all his good fortune. He never misses basketball practice, and he always studies for tests, and he brings Paige flowers for her birthday. He leaves for college in the fall, watching Paige through his rear-view mirror as she waves goodbye, bright autumn leaves whirling around her. She has another year of high school left, so they’d agreed, amicably, to part. Their hearts are both a little bruised, but not broken by any means, and it’s very mutual and low-drama. A lot of Derek’s friends are dealing with painful break-ups or the prospect of unfulfilling long-distance relationships. Not so, for Derek. He thinks again about how lucky he is as he drives down the freeway, leaving Beacon Hills behind as he speeds into his future.</p>\n<p>In college he double majors in English Literature and Fine Art, because he can also draw. Like, really, really draw. </p>\n<p>(He’s such a fucking lucky guy.)</p>\n<p>Every spare minute not spent on a basketball court or reading is spent curled up with his sketchbook and a pencil or some charcoal, spilling the thoughts and feelings that his teenage self still struggles to articulate out onto paper, giving them form and texture and life. It’s his catharsis.</p>\n<p>His room-mate, a big, stoic guy called Boyd who brings home a different girl every week, laughs at him for being a surly, tortured artist, and Derek rolls his eyes and laughs along, although it couldn’t be further from the truth. </p>\n<p>He’s not surly, he’s selective.</p>\n<p>He’s not tortured; he’s <em>waiting.</em></p>\n<p>He waits because there’s someone out there who’s right and perfect and <em>his,</em> and he doesn’t want to settle for less.</p>\n<p>He knows this because he’s among the small percentage of the population born with a soul mark. His family know, but he doesn’t tell his friends, preferring to cradle the knowledge close to his chest, protecting it, cherishing it. He wants it to be something just he and the person with the matching mark share; something purely theirs. </p>\n<p>So he studies and draws and reads and plays, and occasionally goes for coffee or drinks with perfectly nice people, but all the while, he waits.</p>\n<p>The odds of meeting his soul-match aren’t all that great, he knows. A blessed minority of people have marks, so finding the one person out there that’s destined just for you… It seems like it should be impossible. But Derek just has this <em>feeling.</em> And besides, he’s always been so lucky.</p>\n<p>He’s even lucky to have a mark this beautiful, he thinks. It's become his habit to smooth his fingers over it when he has a moment of privacy, letting himself imagine, after a shower or while he lies in bed at night, how it might feel under the trailing, tender fingertips of his soul-match. The mark has been part of him since birth, a scrunched-up collection of speckles and dots that has unfurled as he’s grown and now stretches over the flare of his thigh, right under the juncture where it meets his hip. </p>\n<p>For someone like Derek, to whom conversation doesn’t come naturally, having a little piece of his soul right there on his skin feels miraculous, and unexpectedly, headily intimate.</p>\n<p>It’s empowering. Addictive.</p>\n<p>One day he’s out in town, buying a book for a course, when he sees a ‘help wanted’ sign in the window of an unassuming little tattoo studio not too far from campus. He wanders in. It’s a bright, white sugar lump of a room, completely stark except for the art on the walls. It’s image after image of high quality, hand drawn tattoos, all framed like a gallery. Derek thinks that’s pretty much exactly what this is. He fills out an application on the spot, and gets the job, despite his middling-to-poor people skills. Lucky, right?</p>\n<p>At first he just makes coffee and sterilises equipment and organises little vials of ink, but he loves it. He loves watching people’s stories take shape on their skin, loves the delicacy and the boldness and the complexity of it all. He even likes the dull buzz of the needle, finding it soothes him like white noise, and lets him lose himself in his own mind, so he starts to bring along his sketch book for the quieter periods. </p>\n<p>He finds that his soul-mark works its way into all of his doodles and sketches one way or another. It's not a conscious thing, but he always seems to find echoes of the shape of it in his pieces when he steps back to look at what he’s done. The manager of the shop, Satomi, is impressed with his work and starts to let him shadow a couple of the other tattooists. The first time Satomi touches a needle to Derek, it feels like the instrument has never been more appropriately named as it makes his skin fit him like it never has before. He wants to do that for other people. He comes up with images of ink on skin in his dreams. </p>\n<p>As soon as he graduates he becomes a full-time apprentice. He throws himself into it whole-heartedly, like everything he does. After six months he’s certain this is what he’s meant to do with his life. His parents support him, even if they don’t exactly get it. It’s okay. He wishes he could show them how it feels to bring a little piece of someone’s inner self up to their surface. It feels like a privilege. He’s so lucky.</p>\n<p>Once he’s completed his training he quickly acquires a dedicated base of regular customers, all of whom appreciate his eye for detail and laser-focused perfectionism. </p>\n<p>He still sketches his soul-mark, over and over, when it’s quiet. He’s still waiting. </p>\n<p>It’s a Wednesday when it happens. </p>\n<p>It’s a non-descript, uneventful Wednesday in March. He’s worked out, showered and gone to the studio, grabbing a small bucket of overpriced, over-stewed coffee and an apple on the way. He greets Isaac, the new trainee, as genially as he knows how, and sets him to work scrubbing down the tiny kitchen out back, then he settles in at the front desk. He has half an hour before his first appointment. He downs the last of his coffee and reaches for his pencils.</p>\n<p>He flips his sketch pad shut when he hears the door get thrown open, raising an eyebrow when a tall, lanky guy stumbles over the threshold and glares briefly back at the doorway like he’s mad at it for tripping him. </p>\n<p>Derek gets a glimpse of rolled up sleeves revealing slender, pale forearms, and a general air of anxiety as the guy turns on the spot a few times to take in the studio. He’d put money on this being the guy’s first tattoo. </p>\n<p>‘Can I help you?’ He eventually says, biting back a smirk as the guy visibly startles.</p>\n<p>‘Jeez,’ the guy says, clutching at his plaid-clad chest with unfeasibly long fingers, <em>‘warn</em> a guy!’ </p>\n<p>‘Sorry,’ Derek says flatly, trying to ignore the flare of heat that the sight of those long fingers sparks low in his belly. He deliberately and sarcastically clears his throat, and then says, with as much condescension as he can muster (which is quite a bit, as it happens), ‘Can I help you?’</p>\n<p>The guy’s eyes narrow for a beat, and then his whole face breaks out into a huge smile, which in turn segues into a whole-body laugh. Derek feels the heat travel from his stomach up to his ears. He presses his thighs together under the desk, willing his cheeks not to flame up as traitorously as his ears. It’s been a long time since he’s had such a visceral reaction to someone. </p>\n<p>The guy moves forward to brace those long hands against Derek’s desk. ‘Thanks. So helpful. I actually have an appointment in about ten minutes. With, um, Derek?’</p>\n<p>Derek manages to stop staring at the curve of the bones in the guy’s wrist long enough to stare instead at his coppery eyes, crinkled at the corners with his barely contained laughter. His mouth feels dry and cottony. ‘I’m Derek,’ he finally says.</p>\n<p>‘Awesome,’ the guy – Stiles, according to the appointment book – says. ‘My man Scotty says you’re the best.’</p>\n<p>Derek stares at him blankly. </p>\n<p>‘Scott McCall?’ Stiles qualifies. ‘You did these badass concentric ring thingies on his upper arm a few weeks back? He said your portfolio was pretty sweet.’</p>\n<p>‘Ah. Yeah, I remember him.’ The heat is definitely pinking up Derek’s cheeks now, so he looks down sharply to try to hide it. </p>\n<p>‘So this is what I want…’ Stiles pulls a folded piece of paper from his back pocket and slaps it down in the wooden desk right in front of Derek’s nose. Derek unfolds it gingerly, trying not to think about how the paper is warm because it’s holding residual heat from its recent proximity to Stiles’ ass. </p>\n<p>‘Oh,’ he says, surprised by the slightly smudged pencil sketch of an elegantly stylised fox that curls across the page in front of him. ‘Did you draw this?’ Most kids nowadays bring along printed images from the internet, or show Derek a blurry photo on a phone. This is refreshingly old school. </p>\n<p>‘Yeah.’ Pink adorns Stiles’ neck now, in uneven patches. It’s stupidly endearing. Derek’s stomach flips at Stiles’ bashful little smile. He feels absurdly hopeful – he’s not even sure if this guy is gay or not, but god, he’s fucking adorable, and it looks like he can draw. </p>\n<p>‘It’s good.’</p>\n<p>‘Thanks, man.’</p>\n<p>‘Do you mind if I just…’ Derek gestures to the drawing with a pencil. </p>\n<p>‘Go for it, dude. Just don’t change the legs or tail, they need to stay where they are.’</p>\n<p>‘It’s a cover-up?’ Derek can’t help his tongue peeking through his lips as he adds to the drawing, sharpening some angles and softening others, changing the shape of the eyes. He doesn’t change anything essential about the drawing, but uses his skill to enhance it, to make it <em>more.</em></p>\n<p>‘Yeah.’</p>\n<p>That’s unexpected; Derek had honestly thought this kid had never set foot in a tattoo studio in his life before. He takes a few more minutes to move over the drawing with his pencil before he spins the paper back around to show Stiles, whose eyes go gratifyingly wide. </p>\n<p>‘Oh,’ Stiles says, much closer than he had been before. He smells dizzyingly of cologne and hair wax and <em>boy.</em> ‘Oh, wow. That looks so good, it’s like… What I wanted to draw, but couldn’t, you know?’ He beams widely, which makes his nose scrunch up. Derek has to remind himself to keep breathing.</p>\n<p>Derek shakes his head. ‘You did good. Can I see what you’re covering, though? I’ll be able to adjust the shading to make sure it’s fully hidden.’</p>\n<p>‘Yeah, no problem.’ </p>\n<p>Derek stands to lead Stiles through to a more private space behind the main reception area, gesturing for Stiles to sit on a large, pvc-covered bench while he takes a seat on a little wheeled stool and scoots over to a small desk against the wall. He watches out of the corner of his eye as Stiles hops up on the bench and immediately starts unbuttoning his shirt and yeah, Derek definitely feels lucky today. </p>\n<p>The shirt puddles onto the bench, and Stiles grips the bottom hem of his t shirt and yanks it up over his head in a surprisingly fluid movement which does all sorts of good things for the lean musculature of his arms. Stiles’ shoulders are broader than he expected, and covered in beautiful, pale skin. Derek wants to draw him. Or draw on him. He can’t decide which he wants more, he just <em>wants.</em> He swallows heavily. </p>\n<p>‘So,’ Stiles says, blissfully unaware of how Derek watches the bob of his throat. ‘I’m covering up this thing on my back…’</p>\n<p>‘Okay…’ Derek scoots the stool around to get a clear look, clutching the fox drawing, and bites his lip at the shift of skin and muscle over Stiles’ smooth, broad shoulders and quickly lowers his gaze, which it turns out is less than helpful because now he's staring at how the small of Stiles' back dips sweetly just above the curve of his ass. He gulps a little, which is not a thing that he knew he did. He's a professional, for god's sake.He should not be thinking about how he wants to press his thumbs into that dip and... </p>\n<p><em>Enough.</em> He shakes his head to get himself in line. He forces himself to flick a purely professional glance over the expanse of skin in front of him. He frowns. He can’t see anything to cover here, except a few beauty marks and – oh. He freezes, the drawing fluttering to the floor. There, marked out on Stiles’ shoulder blade, is a perfect replica of Derek’s soul mark. Derek’s jaw drops as he stares at the tiny points of the intricate stars, linked together by fine lines of even tinier, impossibly delicate stars, to form the shape of the constellation Lupus. Stiles moves a little and the shading of the mark makes it looks like the stars are flickering. </p>\n<p>Derek has seen it thousands of times on himself, but on the canvas of Stiles’ skin it’s… overwhelming, like a sucker punch to the chest. It’s <em>incredible.</em></p>\n<p>He wants to reach out and touch it, wants to trace it with his tongue. He looks up at the improbably beautiful lines of the man in front of him, feels the heat of tears prickling behind his eyes. He wants to know him, wants to know how he spends his time and how he thinks and how every part of him tastes. Fuck. He’s <em>so lucky.</em></p>\n<p>He wrestles briefly with what to say. In all the years that he's been waiting for this moment, <em>dreaming</em> of this moment, he's never really figured out the right words. They never were his forte, after all, and he wants it to be... special. He’s always found directness works best for him. He probably shouldn’t change that now. After all, Stiles is his soul-match, so he’ll probably like Derek’s slightly gruff demeanour, right? He takes a breath and is about to form it into something like, <em>‘By the way, you’re beautiful and also you’re my soul-match,’</em> when Stiles reaches back over his shoulder to waggle a hand towards the pattern on his skin.</p>\n<p>‘So this, right here? This is what I want you to cover. I want you to make sure you can’t see it at all, okay? I want it gone,’ he makes a vicious, swiping motion with his hands. ‘Ixnay on the soul mark crap. I want nothing on my body that I haven’t chosen for myself. Taking back control, man. Saying no to predeterminism and all that outdated fandango.’ </p>\n<p>Derek blinks, winded.</p>\n<p>‘And anyway,' Stiles says, voice becoming wistful and soft, 'I’m getting married.’ </p>\n<p>And that’s the moment Derek Hale will always remember as the moment his luck ran out.</p>\n<p>‘Um. Congratulations,’ Derek manages numbly, grateful for once for his natural taciturnity as it stops him from feeling the need to force out anything more expressive that might give him away. </p>\n<p>‘Thanks, man. I mean I haven’t actually asked her yet, so you maybe oughtta save that for when it’s official.’ Stiles grins back over his bare shoulder.</p>\n<p>Derek’s heart, which had stopped at the words ‘I’m getting married’, pumps back into action, throwing itself urgently against his ribcage. <em>Now,</em> the rush of his blood whispers in his ears. <em>Tell him now. There’s still a chance.</em> His head is spinning and he feels, for the very first time in his life, like he might pass out. He regrets sitting on this stupid little stool; there’s nothing to hold onto, nothing nearby to ground himself with except Stiles, and the last thing in the world he wants to do is grab onto this guy who has unknowingly, and with the most guileless of smiles, upended Derek’s entire future. He tries and fails to marshal his thoughts into some sort of coherency.</p>\n<p>Stiles twists around a little, perching at an angle so he can see Derek’s face. His forehead creases a little. He must interpret Derek’s blank stare as curiosity rather than horror, because he plunges on blithely.</p>\n<p>‘I know, I know. But we live together so it’s basically a done deal. Been together since we were in high school and we were both on the debate team.’ Stiles’ moves his hands around enthusiastically as he talks, and they look like white birds fluttering in Derek’s peripheral vision. Like doves, only they’re bringing chaos, not peace. ‘Actually we met when we were paired up to present the opposing argument in a debate about whether there was any merit to the beliefs and notions surrounding the soul-mark tradition. Not a hardship for me, even then…’ Stiles’ voice turns flinty, and Derek wonders what could have happened to him to put him off the idea so much. Stiles clears his throat. ‘Anyway. She was fucking <em>magnificent,</em> man. Smartest person I’ve ever met, hands down. Our eyes met above the heads of our crushed and weeping opposition and we’ve been together ever since.’ </p>\n<p>Derek is used to clients pouring their hearts out to him while they sit on this plastic-covered bench, explaining how all the threads of their personal histories end up weaving together to form the image Derek etches onto their skin. Sitting here listening to Stiles feels both achingly familiar and wildly different. </p>\n<p>His heart pounds like a jackhammer in his chest, beating out <em>tell him, tell him, tell him,</em> over and over, relentless, but his head holds him back. Would it really make any difference? The guy is clearly opposed to the notion of soul-matches on the deepest of levels, and has been for years. He’s spent his past denouncing everything to do with it, his present ridding himself of it, and soon he’ll commit the rest of his future to someone else. What could Derek possibly say that would change the way Stiles feels? He’s just Derek, after all. Stiles would let him down gently, he’s sure, but what would be the point of putting them both through the inevitable painful awkwardness of it?</p>\n<p>Also, he supposes, if he himself still believes in soul-matches – and he does now, having met Stiles, more than ever – surely he’s supposed to want whatever makes his match the happiest. It seems like so much more than a coincidence that it’s Derek’s hands that Stiles has sought out to cover the mark that links them. If his whole purpose is to make Stiles happy, well… Maybe the way he does that is to follow through with Stiles’ wishes. </p>\n<p>It doesn’t do anything to alleviate the sick disappointment that squats, heavy in his chest.</p>\n<p>The tips of Derek’s ears burn ferociously. He bends to grab the fallen drawing, grateful for the way the movement muffles his voice and obscures the tone. ‘So you’re really… not into the whole soul match thing?’ </p>\n<p>Stiles scoffs. ‘Understatement of the century. I mean, each to their own, and all that, but. The idea that some mysterious force has chosen someone for me that I’m expected to love regardless of who they are? Nuh uh. Not for me. Never did like being told what to do…’ He lights up with a mischievous smile.</p>\n<p>Derek makes a noncommittal noise in his throat that seems to satisfy Stiles. Muscle memory takes over and on auto-pilot he holds the fox sketch up against Stiles’ soul mark, checking the size and shading, even as he wonders how he could even be considering this. He hopes there’ll be a reason the tattoo won’t work at all, but of course it’s the perfect size and shape. </p>\n<p>‘So, what’s the verdict?’ </p>\n<p>‘It’s…’ Derek clears his throat to dislodge the words that stick there. ‘Yeah. It’ll work.’</p>\n<p>‘Excellent.’ Stiles starts to tug his t shirt back on over his head. ‘So when do I need to come back to get inked, tatt-man?’</p>\n<p>Derek blinks at him. ‘Tatt-man?’</p>\n<p>‘Yeah,’ Stiles pulls another rubber-faced grin that shouldn’t really be as attractive as it is and nods down at Derek’s black Henley and dark jeans. ‘You totally have that whole night-stalking, crime-fighting, angry-eyebrowed vigilante thing going on.’ Derek frowns but Stiles just laughs. ‘Way to disprove my point, eyebrows.’</p>\n<p>Derek glares at him. ‘Firstly, if I were a superhero, I’d obviously be Superman-’</p>\n<p>‘Whatever, dude,’ Stiles looks him over far too shrewdly and it makes Derek’s stomach twist. ‘What color is your car?’</p>\n<p>Derek glares harder. </p>\n<p>‘It’s black isn’t it?’ Stiles lets out a little crow of triumph at the look on Derek’s face. ‘Knew it! You own a tatt-mobile, admit it.’</p>\n<p>Derek huffs and scoots the stool away. ‘I’ll check the appointment book but it’ll be a few weeks, I think I’m booked through the middle of April.’ Enough time for Stiles to change his mind, maybe, or for Derek to come to terms with it. </p>\n<p>‘Alright.’ Stiles shrugs his shirt up over his shoulders. ‘Should I give you my digits or do I just look for your signal in the sky?’ </p>\n<p>Derek opens his mouth to bite out a snarky response, surprised by how much he likes bickering with this obnoxiously endearing boy. It’s familiar somehow, and bittersweet like pressing on a bruise. </p>\n<p>‘Yo, Derek,’ Isaac sticks his head around the partition. ‘Steve just called to cancel his Saturday afternoon appointment. Sick with the flu or something. You want to take it off?’</p>\n<p><em>Oh no.</em> Derek’s heart sinks.</p>\n<p>‘Or…’ Stiles sidles over and nudges his shoulder with his own, ‘You could tattoo your new buddy slash sidekick Stiles?’</p>\n<p>‘I don’t, uh…’ Derek lets his eyes dart around the room, searching desperately for a reason to refuse.</p>\n<p>‘I promise not to make any more tatt-man jokes…’ Stiles looks up at Derek through his eyelashes and Derek realises he doesn’t stand a chance.</p>\n<p>‘Okay. Yeah. Can you book him in, Isaac? I just gotta… Um, see ya, Stiles.’ He ducks through the studio and out of the door that leads into the alleyway that runs down the side of the shop, sucking in deep lungfuls of stagnant, damp air. He sinks down onto his haunches and rests his head in his hands. He’s been dreaming about this happening every night for years, and now he feels all those dreams slipping away, like grains of sand pouring through his fingers. What the fuck is he going to do?</p>\n<p>He forces himself to his feet and heads for the sanctuary of the second-hand book store a couple of blocks away. He’ll get a cup of tea in the little café at the back, he thinks, and lose himself in another world for a while. His chest loosens in relief as he pushes through the door and the warm scent of coffee and imagination and possibility envelops him. He’s loved this place since he moved here to start college, and was first lured in by the vanilla-almond sweetness of old paper, cut through with sharp ink. It still soothes him on some fundamental level. He goes straight to the display of the latest titles they’ve had delivered, running his fingers reverently over the cracked spines and slightly dogeared pages. He loves that people have loved them even if they’re not perfect. </p>\n<p>He stops, dead still, as one of the books catches his eye.</p>\n<p>He knows it from college but hasn’t read it in years. The cover is simple; a photograph of a sunset, or a sunrise, depending on how you want to look at it. It feels more like a sunset, right now. The title below is in plain, unpretentious font: There Are Men Too Gentle To Live Among Wolves.</p>\n<p>He lets the book fall open. He knows where it will land before he even touches it, and with a sinking inevitability he reads the first line of the poem.</p>\n<p>\n<em>‘To love is not to possess.’</em>\n</p>\n<p>He inhales, sharply. In this moment, he has to make a choice; he can either be weirded out by the strange sense of fate that seems to have brought him here, or he can believe in it.</p>\n<p>He chooses to believe in it.</p>\n<p>He buys the book and some hot tea. By the time he gets back to the studio, Stiles is long gone. </p>\n<p>He hardly sleeps at all until Saturday. He knows what he has to do, but it doesn’t make it hurt any less when Stiles walks through the door, excited and happy, and every bit as dorky and weird and gorgeous as he remembers. He recites the poem to himself, over and over, as he asks Stiles to straddle a tall chair backwards and rest his chest against the back. He applies the transfer paper to Stiles and sees for the first time how his shoulder-blade will look without the soul mark.</p>\n<p>\n<em>‘To love is not to possess,<br>\nTo own or imprison…’</em>\n</p>\n<p>He focuses intently on the few square inches of skin in front of him. He can’t look at any other part of Stiles or he won’t be able to do it. He knows he could refuse, that Stiles would find another tattooist and that would be the end of it. But somehow it feels right that he’s the one replacing the mark with another, that by indelibly marking Stiles some other way with his own hands maybe they’re still linked in some way. At the very least he can make sure it’s beautiful. </p>\n<p>He takes a deep breath. He can do this. He can do this for Stiles.</p>\n<p>\n<em>‘To love is not to possess.’</em>\n</p>\n<p>He switches on the needle and erases himself from Stiles’ skin.</p>\n<p>*</p>\n<p>Afterwards, Stiles wants to take him for chicken wings because he feels bad for nearly passing out twice.</p>\n<p>Derek feels pretty shaky himself, although he’s doing his best not to let Stiles see that, but he feels a wave of hot guilt course through him at the thought of spending further time with Stiles. Then he thinks of the way the ink had covered over the last traces of the soul mark that matches his own, the one he’ll never touch with his bare fingertips, and he thinks he can allow himself one final hour with the guy who’ll never touch his mark either. He relents.</p>\n<p>He’s regretting it a little, to be honest. He hadn’t thought it was possible for anyone to eat chicken wings sexily, and objectively Stiles eating chicken wings really isn’t, but still…</p>\n<p>He clears his throat and glares down at his own wings so he doesn’t have to watch Stiles lick at his own fingers or chase the straw around his glass with his tongue. </p>\n<p>Stiles is unphased by his quiet companion, talking animatedly about his passions (his job as a kindergarten teacher, curly fries, the Mets, and Lydia), and his plans for proposing, which all sound grandiose and strange to Derek’s ears. He nods dutifully along, but he’s grateful when Stiles moves on to wax lyrical about the wings, how much he loves the fox that now curls across his shoulder, and how he’ll recommend Derek to his friends. Derek chuffs and shrugs and scuffs at the floor and wills the wings to last forever.</p>\n<p>Stiles slurps down the last of his soda and sits back in his chair with a satisfied little sigh, regarding Derek with sharp, amused eyes. ‘So what are you doing tonight?’ </p>\n<p>*</p>\n<p>Several hours later, Derek meets him near the front of a slightly dingy club that Stiles says he regularly frequents with a group of friends. He’s gathered reinforcements in the form of Boyd and Isaac so at least he won’t be the only newbie, but his heart still hammers in nervous anticipation. He doesn’t really know why he’s doing this, only that he seems to have exhausted his reserve of self-restraint where Stiles is concerned, and so he’d accepted the invitation as soon as it was offered. </p>\n<p>Stiles seems pleased to see him, slinging an arm around his shoulders to introduce him to the group he’s with. Derek tries to ignore the line of heat from Stiles' body, focusing instead on remembering names. He recognises Scott right away and is pleased to see the fresh, dark bands of ink around his bicep are fully healed. He’s there with his girlfriend, Kira, and a couple of guys called Liam and Hayden whose fingers are linked together.</p>\n<p>Once they get inside the club they make their way to the bar, where a blonde girl waits with a tall guy who looks like he’d rather be anywhere else in the world. ‘Yo, Stilinski, you get yourself a bodyguard?’</p>\n<p>Stiles calmly flips him off as he orders several beers and leads them to a free table. ‘That’s Jackson.’ He has to lean close and yell to be heard over the music, his breath ghosting hotly over the shell of Derek’s ear. </p>\n<p>Derek nods to hide the shiver that runs over his skin. ‘And your girlfriend?’</p>\n<p>‘Nah, Lydia’s at home, working on her thesis. That’s Erica. She’s awesome. And single, if you’re interested?’ Stiles waggles his eyebrows suggestively.</p>\n<p>Derek shakes his head. ‘Not really looking right now.’ He looks for Boyd and Isaac but he's already lost them in the crowd.</p>\n<p>‘Hey, Derek, how’s it going?’ Scott appears behind them and clasps Derek’s hand before pulling him in for a complicated bro-hug that Derek barely keeps up with. ‘Stiles, you’re needed on the dance floor. The guys are a car wreck out there, it’s fucking painful to watch, man.’ </p>\n<p>‘Alright, alright, I’m on my way. Wanna dance, Derek?’</p>\n<p>‘No thanks.’ Derek actually just wants to find a dark, quiet place to hide in until this whole mess goes away. Instead he sips slowly at a beer, and tries not to look obvious as he watches Stiles throw his body around the dance floor. Like almost everything about Stiles, the disjointed, erratic movements should not be sexy, but somehow they are. Something about the way they seem to be born of a buoyant inner joy, probably. Derek notices wryly that he’s not the only one who thinks so, as several girls seem to gather closer and closer to dance, moths to the flame of Stiles’ energy. It attracts Derek the same way, only he’s already been burned. He shakes his head when Stiles tries to wave him over. He’ll keep his distance. </p>\n<p>After several songs Scott breaks away from the fray and comes to lean next to Derek, gulping down half a beer in one go. He follows Derek’s incredulous eye-line. ‘He’s really something, huh?’</p>\n<p>Derek shakes his head in gentle disbelief. ‘What the hell am I watching?’ </p>\n<p>Scott snorts. ‘Crazy, right? But girls love him, dude. Though I think it’s only like this ‘cos he’s taken so he’s not handsy or anything. If he actually <em>wanted</em> to get girls he’d totally wipe out, you know?’</p>\n<p>Scott’s right. Stiles smiles at the approaching girls, and gets into silly dance-offs, but he’s always careful not to touch them. ‘He’s never tempted?’</p>\n<p>‘Nah. Loyal as a dog. Plus Lydia’s smokin’, so.’</p>\n<p>‘Ah.’ Derek bites down on the inside of his cheek. The music is starting to give him a grating headache, right at the back of his skull. He’s tired from lack of sleep and from the alcohol, and he really doesn’t need to hear about how hot Lydia is, but he can't seem to bring himself to walk away.</p>\n<p>Kira must motion to Scott because he slips back into the throng of swaying bodies, but Derek isn’t left alone in his awkwardness for long because Stiles ducks out from the circle of girls and makes his way over to fling himself down into the chair next to him, chest heaving from his exertions. </p>\n<p>‘Good choice of friends, my man!’ Stiles nods over to the bar where Boyd and Erica are whispering together, and Derek notes with some surprise that Jackson and Isaac have found a shadowy corner and are all over each other. ‘You’ve officially paired off the two biggest pains in my ass, I owe you forever.’ Stiles raises a bottle to Derek in thanks. ‘You’re never getting rid of us now, you know that, right, Tatt-man?’ </p>\n<p>Derek rolls his eyes theatrically, but later, in the dark, when he sinks into his cool bed-sheets, he remembers the hint of affection that had warmed Stiles' gaze, and admits to himself that he’s absurdly pleased. </p>\n<p>*</p>\n<p>Over the next few weeks Stiles makes good on his words, and Derek finds himself being dragged out to dinner or the movies or a club, with some variation on Stiles’ group of friends (although never Lydia, Derek notices), at least once a week. It's actually nice, other than a persistent, yearning ache in his chest whenever he gets too close to Stiles. He ignores it, firmly. Once the group figure out that Derek’s loft is bigger and more private than any of their own apartments they begin to show up regularly on a Friday night, with beer and pizza. Derek does a pretty good job, on the whole, of not letting on how much he loves it, even if Stiles does insist on calling his loft the Tatt-Cave. </p>\n<p>He also thinks he does a pretty good job of not letting on that he’s hopelessly in love with Stiles, although Boyd shoots him a keen-eyed look when Derek goes right out to buy a TV after seeing the look on Stiles’ face when he discovers Derek doesn’t have one. </p>\n<p>Derek just wants Stiles to have a reason to keep coming back to his apartment. It feels right to have him in his space. </p>\n<p>It’s not like it can go on forever, anyway, even if it is serendipity or fate that brought them together. The date Stiles is planning on proposing is coming up, and then he’ll be caught up in wedding planning, and once he’s married he’ll be off… doing married things Derek can’t bring himself to think about. All Derek will have is the echo of his voice around the loft and a soul mark that doesn’t mean anything, any more. He just wants to enjoy the little bit of Stiles he can have, while it lasts. </p>\n<p>He knows Stiles wants to propose to Lydia on their seventh anniversary, and that he’s planned a fancy dinner at a very expensive restaurant, with crystal and champagne and a whole bunch of other stuff that doesn’t seem very Stiles-like at all, but is, as Stiles would say, ‘Lydia’s jam’. Stiles produces the ring, shyly, to a chorus of excited coos from everyone except Jackson who wrinkles his nose and pretends he has to squint to see the diamond. The criticism just bounces off Stiles, who is effervescing with excitement as he counts down the days and the hours and the minutes until he can give the ring to Lydia.</p>\n<p>Every tick of the clock weighs heavy on Derek’s shoulders. </p>\n<p>Eventually, inevitably, the day arrives. Derek sleeps fitfully the night before, and wakes up drained. He's made sure he doesn’t have any appointments because he can’t be this distracted when he’s working. Instead he goes for a long run and comes home via the book store. He marathons several episodes of a Walking Dead boxset that Stiles downloaded for him until the shadows grow long on the walls. He thinks about calling his mom, but he doesn't want her to notice anything's wrong. Instead he waits, alone, as his soul-match proposes to someone else. He has no choice, because it's the right thing to do even if it doesn't feel like it. Sometimes he really hates being a good guy.</p>\n<p>\n<em>To love is not to possess.</em>\n</p>\n<p>His own loss and his jealousy don't matter. The most important thing is Stiles' happiness.</p>\n<p>He makes a cup of tea and stares at it until it goes cold, then he makes another and does the same. He pours away four cups before he gives up on tea. It’s the longest day of his life.</p>\n<p>Once the daylight fades completely he orders Chinese food, not because he’s especially hungry but just because he feels like he should. He paces for a while and then sits on the sofa to try and read, but the words of his book swim muzzily in front of him. Eventually he settles on sketching, setting some of his frustration free in rough, angry swipes of the charcoal.</p>\n<p>A knock on the door startles the charcoal from his hand. ‘Shit.’ It’s probably his food.</p>\n<p>He yanks open the door, taking a step backwards in surprise when he finds Stiles huddled in the doorway. He can tell immediately that something is very wrong. Stiles is hunched into himself, hands shoved deep inside his pockets. His hair is sticking up all over the place like he's been wringing his hands through it. Derek's stomach plummets.</p>\n<p>'Stiles?' Derek tries to make his voice low and soft and soothing.</p>\n<p>‘She said no.’ Stiles mumbles. He shuffles to the side to reveal a battered holdall. ‘She broke up with me. I just, uh…’ He blinks up and around him, chewing on his lower lip, looking vaguely confused as to why he’s at Derek’s loft. ‘I guess I didn’t know where else to go…’</p>\n<p>His eyes are huge and bloodshot, his voice rough. Derek’s heart breaks for him. He'd never wanted Stiles to be unhappy. He takes him by the shoulder. ‘I’m glad you came here. I- For as long as you want, okay?’ He grabs the bag and steers Stiles gently through the apartment, settling him on the couch. </p>\n<p>‘Thanks.’ Stiles is barely audible now, and is visibly shivering. Derek bends to slip Stiles’ sneakers off his feet, and grabs the blanket from the arm of the sofa, tucking it around him. Stiles sinks back into the cushions, clutching the blanket into himself. </p>\n<p>'Do you need anything? A drink?'</p>\n<p>Stiles shakes his head. 'Just her.'</p>\n<p>'I'm sorry.' Derek finds he genuinely means it.</p>\n<p>'She said... She's been thinking about breaking up for a long time now. She wants to focus on her thesis and to, to...' Stiles voice breaks into a little hiccupy sob, 'to find herself.'</p>\n<p>Derek is swept through with the urge to hold him, but he doesn't, he can't, and it's fucking awful. Instead he lays a careful hand on the socked foot that sticks out from beneath the blanket. He doesn't say anything. There's nothing to say. The foot starts to shake and he can tell Stiles is crying so he holds it just a little bit tighter, passing the box of tissues to Stiles with his free hand. It disappears into the swathe of blanket, and there's the sound of Stiles shakily blowing his nose. </p>\n<p>After a long time the shaking stills. Another knock at the door signifies the arrival of the food. By the time Derek is back with two steaming bowls of beef and broccoli and Singapore noodles, Stiles is fast asleep.</p>\n<p>Derek puts the food down and takes a long look at the little bit of Stiles he can see - just a pale cheekbone, framed with thick eyelashes and the start of the swoop of his nose, and he feels helpless and heart-sore. He wishes he could somehow take Stiles' pain away, even if it meant he felt it instead. He's a little angry with the world, because the whole point of Derek suffering through a broken heart is so that Stiles doesn't have to. Stiles is supposed to be happy. That was the plan, fuck-you-very-much, Universe.</p>\n<p>Stiles makes a snuffly noise and shifts a little in his sleep. Derek wonders what it means that Stiles came here and didn't go to Scott. It doesn't really matter why, he decides. Stiles is here now. For better or for worse.</p>\n<p>Derek pauses outside Stiles’ room – the guest room, really, but over the last three or four weeks he’s already come to think of it as Stiles’ room – and presses his palm to the door. Inside he knows Stiles is in bed, even though it’s the middle of the afternoon. Lydia’s rejection has hit Stiles like a body blow, sending him crumpling into bed where he’s stayed, sleeping all day and barely eating. Thank god it’s summer break and Stiles doesn’t have to be at work. </p>\n<p>A steady stream of visitors arrives for him; first Scott, then Kira, then Erica with Boyd in tow, and then Scott again, but Stiles sends them all away. Derek doesn’t really know what to do other than try the best he can to take care of him, bringing him fresh juice and clearing away plates of untouched food. He tries to draw Stiles’ focus away from his cell (which he stares at intensely although Lydia never calls) and into conversation, but stumbles over the listless monosyllables that seem to be all Stiles can muster. He surreptitiously changes the bedding every few days when Stiles is in the bathroom, but it’s been over a week since Stiles managed to shower and Derek knows he needs to try a different approach. </p>\n<p>He hates how Stiles is hurting, hates watching him fade away. He needs to figure out <em>something.</em></p>\n<p>He goes to his own bathroom and fills the deep, claw-foot tub with warm water and bubbles, and then he goes to Stiles’ room where he enters without knocking. Stiles is, as expected, staring hopelessly at the ceiling from the life-raft of the bed. His loud squawk of protest as Derek pulls the cover back and bodily scoops him up is the most noise Derek has heard him make in weeks. ‘Derek! What the <em>hell?’</em></p>\n<p>He’s too thin, Derek can tell, and his hair is starting to get matted. His stubble grows straggly and untended in uneven patches, and his eyes are underscored with purpling, bruise-like shadows. He looks terrible. </p>\n<p>‘You look terrible,’ Derek says helpfully, as he kicks open Stiles’ bedroom door and heads for the bathroom. </p>\n<p>Stiles’ mouth drops open in shock, eyes widening as he sees the bath already drawn. </p>\n<p>He struggles and pounds at Derek’s chest ineffectually. ‘Don’t you dare, Derek Hale! Put me down, you <em>oaf!’</em></p>\n<p>Derek does, unceremoniously dumping him into the bathtub, pajamas and all. He points to the shampoo, bodywash and razor that line the bathtub and says, ‘Wash. There’s food when you’re ready.’</p>\n<p>‘Holy shit!’ Stiles splutters in shock, looking at his hands which are dripping bubbles. ‘You actually…’ His face darkens and he glares daggers at Derek. ‘You will rue the day, Hale!’</p>\n<p>Derek rolls his eyes and steps out of the room, closing the door firmly behind him. He can’t help a tiny smile at the memory of Stiles’ outraged, gaping face as he sploshed into the water. It’s fine if Stiles is mad at him; anything is better than the apathy of the last few weeks. If it takes being kind of an asshole to get Stiles to surface from the place he’s retreated to, deep within himself, then that’s what Derek will do. </p>\n<p>He opens the fridge and surveys the contents. </p>\n<p>His mom always used to cook for him and his sisters when they were ill, and he supposes heart-sickness is the same sort of thing. He doesn’t know what Stiles’ mom used to make for him when he needed comfort as a child, so he settles on his own mom’s go-to recipe; chicken noodle soup. </p>\n<p>Stiles emerges from the bathroom an hour later in the fresh sweats Derek laid out for him, clean shaven, skin pink and scrubbed and glowing. He smells like Derek’s shampoo. Derek swallows hard and tries to breathe through his mouth. </p>\n<p>He gestures to the table where he’s laid out a steaming bowl of soup and several slices of thickly buttered bread. ‘Eat.’ He turns back to his book, trying not to make a big deal of Stiles eating in case it scares him off like a skittish animal. </p>\n<p>He’s immensely relieved when Stiles crosses the kitchen and sits at the table. He grabs a spoonful and shoves it into his mouth. Derek carefully doesn’t watch him. ‘Just because this is really, really good,’ Stiles mutters around the spoon, ‘does not mean you’re forgiven.’</p>\n<p>Derek shrugs. ‘Okay.’ </p>\n<p>He reads in silence while Stiles eats. The bath seems to have awoken him enough to eat almost a whole bowl, and one of the slices of bread. </p>\n<p>As soon as the spoon hits the side of the bowl Derek gets to his feet and grabs his keys, shoving Stiles’ sneakers towards him. ‘Come on.’</p>\n<p>Stiles’ face is comically furious. ‘Not a chance. I've suffered a traumatic event! Some dickwad threw me in a bath, remember? I’m going back to bed to recover.’ He lifts his chin and crosses his arms across his chest stubbornly. </p>\n<p>Derek shakes his head. ‘Nope. Do I need to carry you again? Because I will.’ He takes a step towards Stiles.</p>\n<p>‘No!’ Stiles shoots to his feet. ‘No. I’m coming, jeez.’ He shoves his feet into his shoes and trudges after Derek. </p>\n<p>He sulks all the way to the car, not even making a Batmobile joke when he sees Derek’s black Camaro. Instead he puts his feet up on the dash, daring Derek to say something with his eyes. When he’s met with Derek’s silence, he wraps his arms around his knees, frowning out at the buildings as they flash by. He rouses a little when the car draws to a stop, a making a small noise of surprise when he sees where Derek has brought them. </p>\n<p>‘Sports centre?’</p>\n<p>‘I thought you might wanna hit stuff with a bat.’</p>\n<p>Stiles turns to stare at him. ‘Huh.’</p>\n<p>He allows himself to be led through the parking lot, his semi-catatonia earning them some curious glances from the guy who hooks them up with bats and tokens. He only seems to come back to himself when he’s standing on the mat inside the netted off batting cage next to Derek’s, bat in hand.</p>\n<p>Stiles stares at the bat like he’s never seen one before. ‘I don’t know about this, Derek…’ He moves the weight of it from one hand to the other.</p>\n<p>Derek shrugs. ‘Get ready to have your ass kicked then, Stilinski.’ He turns his cap backwards and holds his own bat up over his shoulder, pivoting his foot when he hears the sound of the ball leaving the pitching machine and swinging down to smack the bat against the ball with a satisfying thud. </p>\n<p>He looks over to see Stiles swinging half-heartedly, missing his own ball by a mile. </p>\n<p>‘Come on, Mets boy, show me what you got!’ He pulls off his hoody to reveal a Yankees shirt his dad bought him on a work trip, years ago. It’s a little tight across the shoulders now, and it smells kinda weird after languishing in a drawer for years, but Derek needs to bring out the big guns if he really wants to piss Stiles off. He turns slightly and deliberately, so that the Yankees emblem is right in Stiles’ line of sight. </p>\n<p>‘Oh my god,’ Stiles mutters, glaring over at the shirt. ‘You suck <em>so much.’</em> But there’s a flicker of life in his eyes, and a thread of steel in his voice, and this time when he swings the bat connects with the ball hard enough that the ball flies off into the netting. </p>\n<p>Derek hits the next ball dead on and turns to Stiles with a challenging smirk. He feels a flare of triumph when Stiles’ eyes narrow in determination, a little glimpse of Stiles’ familiar fire. He raises an eyebrow because he knows it will annoy Stiles even more. He wants him to keep feeling that anger, to tap into it, and then to let it out.</p>\n<p>Stiles hits the next ball, and the next, and the next, and soon he’s completely focused on it, not noticing when Derek stops feeding tokens to his own machine so that Stiles can have more turns. He smacks the balls harder and harder, the force of it punching raw, animal sounds out of his chest until eventually he's meeting each ball with a howl of hurt, or rage, or frustration, or all three. Stiles’ face is wet with sweat or tears, Derek doesn’t know which, and he doesn’t ask. He sits quietly in the corner of the cage, watching as Stiles’ muscles tense, bunch and release over and over. He hopes he hasn’t gone too far, pushing Stiles into this. </p>\n<p>Stiles only stops when he’s spent and shaking, collapsing down to sprawl out next to Derek. He’s pale with exhaustion, but his eyes are alight. The knot of worry in Derek’s chest loosens just a little. </p>\n<p>They sit for a long time, listening to the whirr of the machines and the faint thwack of bats on balls. Eventually Derek rolls his head towards Stiles. ‘Okay?’</p>\n<p>‘Yeah.’ Stiles exhales slowly through his nose. He sounds tired, but not empty like before. ‘Hey, Derek?’</p>\n<p>‘Yeah?’</p>\n<p>‘Let’s go home.’</p>\n<p>Warmth floods Derek’s chest. ‘Okay.’</p>\n<p>*</p>\n<p>Things slowly change, after that. Stiles appears for breakfast the next morning, dressed in soft, comfortable clothes, and though he spends the day on the sofa and still compulsively stares at his phone, he at least doesn’t retreat back to bed.</p>\n<p>There are days where Stiles does stay in bed, days where he’s still too overcome with loss to function, and Derek doesn’t ever push him because he knows the next day, or the day after that, it will be a little better again, because Stiles is coming back to himself – coming back to Derek. It’s going to be a long journey, Derek thinks, but Stiles has taken the first steps.</p>\n<p>A few days after the batting cages, Stiles lets Scott come over for the first time, and they spend hours on the sofa playing video games. Derek strategically retreats to his own room to let them talk. When Scott leaves, Stiles looks tired and drawn, but somehow more settled in his own skin. </p>\n<p>Gradually Stiles spends more and more time with his friends, letting them gather close to him, letting them love him. </p>\n<p>‘So are you living here now, like, permanently?’ Erica asks curiously one night as she builds herself a taco from the assortment of food spread over the coffee table.</p>\n<p>Stiles’ eyes flick straight over to Derek. They haven’t actually had this conversation, yet, there’s just an unspoken understanding that this is where Stiles is, now.</p>\n<p>‘For as long as he’ll have me,’ Stiles says at exactly the same moment Derek says, ‘For as long as he wants,’ and they both laugh and do a taco toast, and that’s that.</p>\n<p>Stiles starts to eat more regularly, and Derek often comes home from the studio to find Stiles cooking for them both, barefoot and perfect in the previously underused kitchen. Its achingly domestic. He shoves the thought away. It doesn’t matter how he feels, as long as Stiles is getting better. </p>\n<p>Derek knows he’s on the right track when Stiles returns from the laundry room one evening and drapes himself over the back of the couch where Derek is reading, eyes glittering with mirth. He looks so much like his old self it makes Derek’s breath catch in his throat. </p>\n<p>Derek narrows his eyes at him over the top of his glasses. ‘Why do you look like you’re up to no good…?’</p>\n<p>Stiles gasps dramatically and clutches his hand to his chest. ‘You wound me, Derek! I’ll have you know I’m actually doing a nice thing because I am a selfless and thoughtful roommate.’ </p>\n<p>Derek sighs in resignation. ‘What did you do, Stiles?’</p>\n<p>Stiles smirks. ‘Your laundry.’</p>\n<p>‘Okay…’ Derek frowns. ‘Thanks, I guess.’ </p>\n<p>‘But, hmm, I wonder if it’s possible your laundry somehow got mixed up with someone else’s?’ Stiles’ voice is silky and dangerous, his lips curved into a knowing smile. </p>\n<p>Derek’s stomach does a weird little flip as he racks his brain for any potentially embarrassing items of clothing Stiles might have come across. He’s been the freaked-out recipient of sexy underwear from ex-partners, but he’d always shoved it in the trash at the earliest opportunity so it can’t be that…</p>\n<p>‘I only wonder because I’m sure big bad Derek Hale would never in a million years own these, am I right?’ </p>\n<p>Stiles holds something up in front of him and Derek’s heart stops. <em>Oh no. Oh no, no, no.</em> The pajamas his Mom bought him for Christmas his first year in college… The bright blue pants, covered in dancing cartoon pretzels, had been meant as a joke, but they’d turned out to be the most comfortable things he’d ever worn in his life. He hadn’t worn them much lately, what with Stiles being around, but he’d given in to the urge the other night when Stiles had gone to bed early. He’s regretting his moment of indulgence, now…</p>\n<p>He looks from the pajamas to Stiles, who is barely containing a Cheshire-cat grin. If he shows weakness right now Stiles will never let him live it down, so he decides to do the only thing he can; style it out. </p>\n<p>He shrugs nonchalantly then looks back down at his book. ‘No, they’re mine. They’re really soft and they fit my butt great.’ </p>\n<p>Stiles snorts in surprised amusement. ‘Nice. Do you think Batman has secret comfy-butt pjs? Maybe that’s why he lived alone until he found Robin, the only roommate in the world who owned more embarrassing clothing than he did. Sadly for you, I barely own any spandex so you are officially the more embarrassing roommate.’</p>\n<p>Derek huffs, ears burning at the superhuman effort it takes not to think about Stiles in spandex. ‘You’re ridiculous.’</p>\n<p>‘Your <em>butt</em> is ridiculous, dude. What are you, half Kardashian? Not surprised you wanna keep these babies if they accommodate the booty. You should never let them go.’ </p>\n<p>Derek can’t help his jaw from falling open at Stiles’ admission that he’s been looking at his butt, even objectively, and Stiles grins in triumph at having broken Derek’s cool composure. He throws the pajamas at Derek’s face as he skips away in the direction of his room. </p>\n<p>‘I hate you!’ Derek calls out after him.</p>\n<p>‘No, you don’t!’ Comes Stiles’ smug reply.</p>\n<p>‘Get out of my house!’</p>\n<p>‘Never leaving!’ Stiles sing-songs back as he shuts his door. </p>\n<p>Derek sits for a minute, fingers curled around the brushed cotton of the pyjama pants, before he catches sight of his dopey grin in the mirror and shakes his stupid self out of it. </p>\n<p>*</p>\n<p>One weekend, just before school starts again, Stiles goes with Scott to collect his stuff from the apartment he’d shared with Lydia, and on his return heads straight for his room.</p>\n<p>‘It was tough on him,’ Scott says, forehead creased in concern. He waits with Derek for a couple of hours but Stiles doesn’t re-emerge, so he leaves Derek with a large suitcase, several cardboard boxes, and a sympathetic smile.</p>\n<p>A little later Derek hears Stiles’ door open, and soft footsteps pad to Derek’s room. After a few minutes, the footsteps haven’t returned, so he curiously goes to see what’s happening. He catches Stiles standing in the middle of his room, looking guilty. Derek cocks an eyebrow when he sees that he’s wearing the pretzel pajama pants. Stiles raises his chin defiantly. ‘Don’t judge me.’</p>\n<p>Derek shakes his head. ‘If loving those pajamas is wrong, I don’t want to be right.’</p>\n<p>Stiles looks at the floor, a small smile on his face. </p>\n<p>‘You want a beer?’</p>\n<p>‘God, yes.’ Stiles sighs in relief. </p>\n<p>They sit on either end of the couch with a couple of beers each, and Stiles finally talks. He tells Derek how Lydia had been there, in the apartment, along with some girl called Allison who she’d introduced as a friend but had looked at like she was more. Stiles hadn’t realised, he says, how long it had been since she’d looked at him that way. </p>\n<p>He talks about how things with Lydia had been strained for several months before the break up, with work pressures forcing them to spend more time apart. When Stiles had proposed Lydia had seen their future, stretched before them, and had panicked because she’d never really considered any other options. She’d said she didn’t know who she was without Stiles but she wanted to find out.</p>\n<p>The problem was that Stiles didn’t know who he was without Lydia, either. He didn’t know if, without Lydia, he was anything at all. </p>\n<p>Derek wants to tell him that he’s everything, that he’s absolutely, perfectly <em>everything,</em> just sitting there in pretzel pajama pants, with unbrushed hair and bare toes. But he doesn’t. </p>\n<p>‘Hey, can I ask you something?’ Stiles asks suddenly.</p>\n<p>‘Sure.’ </p>\n<p>‘Why don’t you date? Is it because of me?’</p>\n<p>Derek’s eyes widen and his heart picks up. He’s been so careful not to let Stiles know how he really feels, how could Stiles possibly know? ‘What.’</p>\n<p>Stiles tilts his head to the side. ‘You know, ‘cos I’ve been such a mess. I thought maybe you were trying to be all sensitive and not flaunt some secret perfect girlfriend… or boyfriend?... in my face in case it reinforced to me how incredibly pathetic my own love life currently is.’</p>\n<p>‘Oh.’ Derek looks down at the beer in his hands, relief trickling down his spine like the condensation down the bottle. ‘No. No girlfriend or boyfriend.’</p>\n<p>‘How come? Tell me to butt out if you want, but you don’t seem to be exactly playing the field either and hello, I would if I looked like you.’</p>\n<p>‘No. I mean here and there, but.’ Derek takes a deep breath. He’s never told anyone about his soul mark before, but he wants Stiles to know who he is. ‘I have a soul mark. I guess I’m still trying to figure out what that means for me.’</p>\n<p>Stiles nods slowly. ‘Okay. I just wanted to make sure that you know that I’m totally fine with you dating. It wouldn’t, like, upset my fragile mental state or anything. Plus I have some really good noise-cancelling headphones so feel free to shove a sock on your door-handle or whatever, any time you’re getting lucky.’ Stiles grins boyishly at him, blissfully unaware of how his words are kicking Derek in the heart.</p>\n<p>He scratches at the label of his beer bottle with his thumbnail. ‘I’ll, uh. Bear that in mind.’</p>\n<p> Stiles sits back, satisfied. ‘Soul mark, huh? You’re a believer?’</p>\n<p>‘Yes.’ Derek nods fervently, because he is. Even if it’s really fucking hard sometimes, he still believes. He feels the words <em>‘because it’s you’</em> bubble up from his chest and sit on his tongue, waiting to be set free. He swallows them down. He would hate for Stiles to think he’s been trying to take advantage of him while he’s been vulnerable, when all he wants is for Stiles to be happy. Instead he says, ‘Why aren’t you?’</p>\n<p>Stiles fidgets his toes so they’re tucked warm beneath Derek’s thigh. ‘My mom and dad were soul-matches. They were… god, so happy. Perfect couple.’ Stiles eyes flash golden in the lamplight. ‘But then she died, and. My dad didn’t know how to carry on without her. It was like he needed his soul-match to survive, and no-one else was worth living for. Not even me.’ He bites his lip. ‘He drank himself stupid every night. He’s stopped now, but. It tore me up, as a kid. I needed him, and he wasn’t there, you know? I guess I don’t… I don’t like the idea that a soul-match ruins you for everyone else. The idea that there’s just one person out there for me… That’s… That’s just scary. There’s nothing romantic or reassuring about that, for me.’ </p>\n<p>Derek can certainly understand that, even if he doesn’t feel the same way. ‘I’m sorry.’</p>\n<p>Stiles shrugs. ‘It’s alright. Anyway, why do I even need a soul-match when I have you, my best buddy and roommate extraordinaire who happens to make the very best nachos in all the world?’ He sends a hopeful smile in Derek’s direction. Derek gives in and makes nachos, and Stiles eats way more than his fair share. Derek pretends to grumble about it, and eventually Stiles falls asleep with his feet in Derek’s lap.</p>\n<p>Derek sits for a long time, perfectly still, watching as the light from the setting sun turns Stiles' pale skin golden and pink and orange and picks out strands of copper in his hair. Of course he still believes.</p>\n<p>Maybe Stiles will never love him like he loves Stiles. Maybe that's okay, as long as he's still meant to be part of Stiles' life - and he believes that he is.</p>\n<p>He doesn't know why the mysterious force that brought them together would set it up this way, and yeah, if he's honest with himself, it really hurts sometimes, to live like this. He's worried about the future; he doesn't know if he can do this forever. But right now Stiles needs him, and he needs him to be his friend, so that's exactly what Derek is determined to be. And all the while, deep down, in the private, locked-up sanctuary of his heart, Derek believes.</p>\n<p>Living with Stiles is beautiful, blissful torture. </p>\n<p>As a roommate, Stiles is loud and messy, and he eats all the food, and Derek has no idea how one relatively slender person could possibly use that many towels in a day.</p>\n<p>He’s sarcastic <em>all the time,</em> and he has an Instagram account (that Derek doesn’t know how to access because he’s not a hundred per cent sure what Instagram even is) dedicated to the subtle nuances of Derek’s angry eyebrows. He and Scott try in vain to engage Derek in a prank war but don’t seem to realise how massively unsubtle they both are, and always manage to give themselves away somehow (their attempts, however, result in a great deal of fodder for the Instagram account). </p>\n<p>Most heinously of all: he’s stolen Derek’s fucking pretzel pajamas. </p>\n<p>He’s basically everything Derek never wanted in a roommate, and Derek loves him.</p>\n<p>He’s adorably undone first thing in the morning, stumbling around the kitchen bleary-eyed until Derek presses a mug of coffee into his hands. Once the caffeine kicks in he loves to make Derek breakfast, setting huge stacks of pancakes or waffles in front of him despite Derek’s half-hearted protests. After a few weeks he starts to arrange fruit in obnoxious (and often obscene) pictures on the plate in an effort to see how hard he can make Derek roll his eyes.</p>\n<p>Once a suitable quantity of carbs and sugars have been consumed, Stiles disappears to shower, (which Derek never thinks about ever) and then reappears in his work garb, which consists of corduroy slacks and button downs in a variety of colors, topped off with a garish bow-tie. The bow-ties are retina-searingly awful, Derek points out, but Stiles just grins, and Derek tries to ignore the fact that he must be really far gone for this guy if he thinks he’s sexy even in a bow-tie with gummy bears on it. He supposes he might have a soft spot for the way the bow-ties are testament to Stiles’ endearing nerdiness, but it’s probably more that the man he loves appears in front of him every morning literally wrapped in a bow. </p>\n<p>And yet Derek isn’t able to touch him. His fucking <em>life,</em> man. </p>\n<p>Happily – or not, Derek can’t decide – Stiles seems to have no such reservations about touching <em>him.</em></p>\n<p>There are hugs and back-pats and shoulder squeezes, and once or twice even companionable slaps on the butt which make Derek yelp and glower even though secretly his stupid, traitorous heart leaps a little every time. </p>\n<p>As the summer melts away into fall, Stiles gets so comfortable around Derek he even starts dropping down into Derek’s lap any time there aren’t enough chairs for everyone. No one else seems to think this is weird because they're quite a touchy-feely group, and Derek has no idea what is a normal amount of touching for two extremely platonic roommates, so he goes with it because Stiles smells really good, pretending like it’s no big deal while he carefully keeps his hands to himself (Isaac tries it once but Derek glares him right back over into Jackson’s lap). </p>\n<p>He deals with being Stiles’ human chair pretty well with it, he thinks, except for that one time Stiles was playing Mario Kart with Scott and he kept shifting his body weight to lean into the bends, and Derek had to excuse himself to go to the bathroom before he humiliated himself in front of the whole group. </p>\n<p>Stiles still has low moments, usually when he hears his and Lydia’s special song or a movie they both loved comes on (and on those days Derek knows it’s best to feed him a lot of pizza and watch baseball with him until he falls asleep) but generally speaking, he’s doing much, much better. </p>\n<p>Derek is both incredibly proud and incredibly scared, because he knows that the better Stiles feels, the closer he is to maybe wanting to start dating again, and Derek’s not at all sure that won’t crush him. In the quiet solitude of his room, he sketches some of the little, perfect moments of his life, and tucks them away safely in a box he keeps under the bed. He doesn’t know if, when Stiles is gone, he’ll ever be able to look at them again, but at least he’ll know they’re still there. They’ll never be lost to him completely.</p>\n<p>*</p>\n<p>‘Oh my god,’ Stiles’ voice is muffled through his forearm as he slumps despondently over the table. ‘I’m gonna be single forever…’ </p>\n<p>‘What’s going on?’ Derek asks, breathless and buzzing from his run. It’s a glorious October Sunday morning, all birdsong and good feels. He heads straight for the fridge to grab a bottle of water, smiling when he sees a big bowl of fresh, chopped fruit waiting there. He grabs a hunk of watermelon and bites into it, enjoying the cold sweetness of it on his tongue. It’s these sorts of little, thoughtful gestures that keep Derek from strangling Stiles when he finds he’s saran-wrapped the entire bath tub when Derek has been at the studio working late.</p>\n<p>‘Stiles struck out at the grocery store,’ Jackson smirks.</p>\n<p>The watermelon turns sour in Derek’s mouth.</p>\n<p>‘Thank you, Jackson, for your unwavering support, as ever.’ Disdain is practically dripping from Stiles’ pores. </p>\n<p>‘You’re welcome,’ Jackson sing-songs, unperturbed. </p>\n<p>Beneath all the snark, Derek thinks that Jackson and Stiles do sort of grudgingly like each other, but there’s no way either of them would ever admit it. </p>\n<p>Stiles doesn’t move from his hunched-over position, but does raise one hand to flip Jackson off. </p>\n<p>Jackson curls his lip a little. ‘Fine. How about this… I will personally make sure you don’t end up old and alone.’</p>\n<p>Stiles shifts enough that one eye peers suspiciously through the tangle of his forearms. ‘How?’</p>\n<p>‘I’ll make you a deal, Stilinski.’ Jackson tilts his head, suddenly serious. ‘How about, if we both are single at forty-five…’ </p>\n<p>Stiles lifts his head fully then, to stare at Jackson in shocked anticipation, and Derek does the same because Jackson is the very last person Derek had ever expected a marriage pact from.</p>\n<p>‘…I will kill you.’ Jackson finishes, stretching his arms up above his head casually. ‘So at least you’ll never be old.’ </p>\n<p>Ah. Well that figures.</p>\n<p>Stiles glares. ‘You are an epic asshole, Jackson. Seriously, if there were an asshole Olympics you’d win gold, silver and bronze.’</p>\n<p>‘Aww, thanks, man.’ Jackson makes a ridiculous kissy face that only serves to incense Stiles further.</p>\n<p>Derek shakes his head and wanders to his room to take a shower. While the water heats up he gives himself a little pep talk in the mirror about keeping his shit together around Stiles. It’s not like he hadn’t been expecting the dating thing, and it’s not like Stiles even seems to be all that good at it, so maybe he shouldn’t worry about it too much yet.</p>\n<p>He strips off his tank top and then stops suddenly, sniffing the air. The whole bathroom smells suspiciously of… soup? What the…?</p>\n<p>A brief investigation yields the bouillon cube that someone must have hidden in the showerhead – definitely Stiles, judging by the guilty blush that stains his cheeks when a distinctly un-soupy Derek re-appears in the kitchen. </p>\n<p>He rummages under the kitchen sink for the bottle of bathroom cleaner, and then turns back to Stiles to lecture him silently with his eyebrows, only to find he already seems to feel pretty bad about this one because he’s gone way more pink and fluttery than he usually gets. </p>\n<p>‘Did you, uh, get more ink?’ The deflection sounds jittery, so he must be expecting Derek to be mad.</p>\n<p>‘Satomi did some more of the shading, yeah.’ Derek glances down at his right shoulder which is covered with an intricate tattoo of a phoenix with its wings spread. It’s mostly monochrome but Satomi has added highlights in softly blended splashes of ink which look like watercolors. Derek had forgotten that Stiles wouldn’t have seen the new work, yet, since all that’s usually visible under a t shirt are the long tail feathers that lick down to his elbow like flickering flames. It’s his biggest piece, followed by the triskelion between his shoulder blades. His favorite though, is the silhouetted tree line encircling his left wrist, taken from a photograph of the preserve his family owns back in Beacon Hills, because it reminds him of home. </p>\n<p>‘Looks good.’ Something sounds a little off in Stiles’ voice, but before Derek can figure it out they’re interrupted.</p>\n<p>‘I know, right?’ The sound of Jackson’s glee filters through from the next room. It sounds like he’s relaying Stiles’ terrible morning to someone on the phone. ‘And then, no, wait, this is the best part, then he said,’ he appears in the doorway and changes his voice a little in a poor imitation of Stiles, ‘hey, is your name Google, ‘cos you got everything I’m searching for…’ Jackson descends into helpless hoots and cackles.</p>\n<p>Stiles’ cheeks are flaming as he mutters, sullenly, ‘Doesn’t even sound like me…’ </p>\n<p>‘Don’t worry about it…’ Derek hesitantly reaches out to squeeze Stiles’ shoulder as he passes. It’s rare for him to initiate contact because it makes him go all Stiles-stupid, and true to form his heart rate rockets just at the feel of the curve of Stiles’ collarbone under his fingers. Stiles turns his head to look at him in surprise. ‘You’re just a little rusty. You’ll get there.’ </p>\n<p>‘Oh yeah?’ Stiles brightens up, the familiar smile that plays around the corners of his lips firmly back in place. ‘Can I practice on you?’</p>\n<p>‘Absolutely not.’ Derek makes for the relative safety of his bathroom, bathroom cleaner in hand. </p>\n<p>‘Aww, come on, Der!’ Stiles calls after him. ‘Ooh I got the perfect one! Hey, Derek, did you sit in a pile of sugar ‘cos you have a pretty sweet ass!’</p>\n<p>‘Fuck off, Stiles!’ Derek calls back, but he can’t hold back a grin, because yeah, Stiles isn’t turning into some lean, mean, dating machine any time soon.</p>\n<p>*</p>\n<p>‘So, how’d you do?’ Stiles bounces his knees excitedly.</p>\n<p>‘I’m not telling you that.’ Derek doesn’t know how he let himself get dragged along to this, only that he’d been reading after work then suddenly Stiles was really close to him on the sofa, wearing this soft green shirt with thumbholes, and he’d smelled insanely good, and when Derek had looked up to meet his eyes they had been all lit up, and now… Now he’s having a stiff drink after an evening of extremely awkward speed dating, which Stiles had forced him to come to in the interest of ‘getting his game back’. </p>\n<p>Derek knocks back a good mouthful of bourbon, relishing the slow burn down his throat. </p>\n<p>‘Come on, man.’ Stiles looks a little flushed, Derek notices – maybe from the alcohol, maybe from being annoyed with Derek. ‘How many matches did you get?’ Stiles holds out an expectant hand.</p>\n<p>‘I’m not showing you.’ Derek tips back a little more bourbon. </p>\n<p>Stiles sighs, exasperated. ‘Of course you are, you’re a terrible judge of character and I need to vet them.’</p>\n<p>‘I am not a terrible judge of character!’ Derek huffs, affronted.</p>\n<p>‘Yeah, no, you completely suck. Just awful. So gimme!’ Stiles waggles his fingers impatiently.</p>\n<p>Derek sighs from the tips of his toes and hands over the piece of white card. ‘Fine.’</p>\n<p>Stiles scans the card, muttering to himself. ‘Alright, so… Woah, a shit-ton of people crossed your box. Not really surprising, you’re hot like burning.’</p>\n<p>Derek kicks at him from his bar stool. ‘Shut up.’ </p>\n<p>Stiles just grins and moves his long legs out of the way. ‘You really need to learn how to take a compliment. You’re almost as bad at it as you are judging people’s characters…’ </p>\n<p>Derek kicks him harder but Stiles dodges again, and laughs. ‘Alright so whose box did you cross? Let me get a look at the contenders for the next Mr or Mrs Derek Eyebrows!’</p>\n<p>Derek glowers and gestures to the bar tender that he’d like another very large bourbon. </p>\n<p>‘Let’s see what you got, big guy…’ Stiles furrows his brow which is so adorable it makes Derek’s chest hurt. ‘Oh boy. Okay, Jennifer was hella intense about the wicca thing, and you don’t really strike me as the type to want to dance skyclad around a freshwater spring on the full moon, so no. Ethan… Cute, but way too attached to his twin brother… And Kate…’ Stiles winces. ‘Just, yikes.’</p>\n<p>‘Yikes?’</p>\n<p>Stiles stares at him. ‘You seriously didn’t notice she was batcrap crazy?’ </p>\n<p>‘Um. No?’ Derek thought she’d seemed nice, actually, and a lot more down to earth than some of the other women who were so uncomfortable in their too-tight dresses and too-tight faces. Now that he thinks about it, maybe she had been a little over-familiar, leaning a little too far into his space, her smile a little too wide.</p>\n<p>‘Dude, you have like no cray-dar.’ Stiles shakes his head despairingly.</p>\n<p>Derek snorts. ‘Explains a lot about why you’re still living in my loft…’</p>\n<p>‘Hey,’ Stiles pouts, ‘You love me and you know it!’ </p>\n<p>Derek wants to come back with something sarcastic like he usually does, but his mind goes completely blank. Maybe it’s the alcohol, or that the lights are low and soft, making it all too easy to imagine that he and Stiles are on a level far more intimate than they actually are. Maybe it’s because of the raw emotion that watching Stiles chat and flirt with other people has brought to the surface, even though Stiles thankfully didn’t connect enough with anyone to make a match. Whatever it is, instead of speaking Derek just stares at Stiles like an idiot for a long enough moment that it gets awkward. </p>\n<p>‘So,’ he clears his throat, looking away sharply to snap himself out of it. ‘That’s a hard pass on all of them?’</p>\n<p>‘Yeah, Derek.’ Stiles’ face is inscrutable but his voice is all fond exasperation. ‘It’s a ‘no’, ‘fuck no’, and a ‘run like hell’.’ </p>\n<p>‘Great.’ Derek downs the last of his drink. He feels fuzzy around the edges, so he definitely can’t have any more to drink. ‘Can I go home and read my book now?’</p>\n<p>Stiles glances over at him. ‘You’ll never meet your soul match if you stay home all the time. They might be right here in this bar, you never know.’</p>\n<p>Derek rolls his eyes. ‘I think I’ll take my chances.’</p>\n<p>Stiles sighs. ‘Come on then, you big anti-social lug.’</p>\n<p>‘I’m not anti-social,’ Derek grumbles, ‘I just really don’t like people.’</p>\n<p>‘Pretty sure that’s the definition of anti-social, Derek.’ Stiles slips off his bar stool and Derek is suddenly so overwhelmed by the urge to slip an arm around his waist and tuck his hand in his back pocket that he gets lightheaded and wow, he should definitely not drink bourbon any more.</p>\n<p>He follows Stiles out onto the street, grateful that at least, even if they’re not <em>together,</em> they get to go home together. </p>\n<p>*</p>\n<p>It can’t last. </p>\n<p>Stiles starts to go back out to clubs with Scott and the rest of the guys. Sometimes Derek goes along, although he’s careful never to let himself get drunk and he never, ever dances with Stiles. </p>\n<p>One night, Stiles finds him at the bar, two new people in tow. ‘Hey Der-Bear, there you are!’ He’s loose-limbed and tipsily gorgeous. ‘I want you to meet my new friends! This is Malia…’ Derek nods a greeting to the pretty blonde tucked into Stiles’ side. ‘And this,’ Stiles slings his other arm around the neck of a tall, dark-eyed guy in a deep v neck top, ‘is Danny.’ </p>\n<p>Danny flashes a flawless, toothy grin at Derek. ‘Hi, how are you?’ Something about the way Danny’s gaze moves over him, slow and lazy, makes Derek prickle with self-consciousness. </p>\n<p>‘Danny’s a computer programmer, and…’ He pauses to give Derek a significant look which Derek doesn’t understand, ‘He’s currently <em>single.</em> I’m gonna leave you guys to chat while I buy Malia here a drink.’ Stiles beams at them both and then disappears, which is a little weird because Stiles rarely leaves Derek alone with new people for fear he might accidentally make them cry.</p>\n<p>Derek grips his bottle of beer so tightly he thinks he might crush it. He sets it down on the bar, a little too hard.</p>\n<p>‘Sorry to railroad you like this,’ Danny smiles up at him, and he’s nice enough, Derek supposes, but he’s too confused by Stiles’ behaviour to really be able to concentrate. ‘Your cute friend likes my cute friend, so… here we are.’</p>\n<p>And <em>there</em> it is. Stiles wants Derek to occupy Danny while he puts the moves on Malia. Derek presses his fingers into his temples. Fuck. It’s not like it’s an unusual thing for a guy to do when he’s out with his friends – and maybe Derek wouldn’t have minded if it seemed like Stiles gave a shit about whether he’d actually like Danny or not - but <em>this?</em> Being reduced to a walking, talking distraction? This fucking sucks.</p>\n<p>‘Gotta say, it works out for me,’ Danny blinks up at Derek through his eyelashes. ‘I’ve been watching you all night.’</p>\n<p>Out of the corner of his eye Derek can see Stiles leaning close to Malia, watches how she smiles as her fingers curl around his shoulder, pressing into the fabric that sits right over the fox he put there. </p>\n<p>‘Right. Yeah.’ Derek stands up abruptly. ‘This isn’t going to happen. Sorry.’ </p>\n<p>He blindly makes for the exit, shouldering people out of the way. He doesn’t look back at Danny and he doesn’t look back at Stiles. The heat inside the club is oppressive, smothering. He needs to be <em>out.</em></p>\n<p>The air outside is cool, kissing at his face softly and telling him it’ll be okay, but his cheeks still burn. Maybe that oppressive heat is actually within him.</p>\n<p>His blood is rushing so loudly in his ears he doesn’t hear the rapid footsteps that scuff along the sidewalk behind him. </p>\n<p>‘Derek! Hey, Derek!’ </p>\n<p>Long fingers at his elbow make him spin around. Stiles is there, breathless from chasing him, red creeping up his neck from beneath his tight black t shirt. ‘What the hell, dude, you’re just gonna run away and not tell anyone?’</p>\n<p>‘You seemed a little busy.’ He tries hard to keep the bitterness out of his voice, he really does, but he’s not sure how successful he is. </p>\n<p>Stiles frowns. ‘Did Danny do something? If he upset you I’ll fucking kill him…’ He moves to stride back towards the club.</p>\n<p>‘No, <em>you</em> upset me, Stiles!’ </p>\n<p>Stiles reels back like he’s been struck. ‘What? What do you mean?’</p>\n<p>Derek crosses his arms protectively in front of his chest. ‘I’m not stupid. You were pimping me out to get what you wanted. It was a dick move.’ </p>\n<p>Stiles looks stricken. ‘I’m sorry. I didn’t mean… I just, I really like her, and I thought he was cute and maybe you’d…’ He sighs and pushes his fingers through his hair. ‘Fuck. I’m sorry.’ </p>\n<p>Derek shrugs. The hurt tastes bitter and metallic in his mouth. ‘It doesn’t matter.’</p>\n<p>‘Of course it matters,’ Stiles says, reaching out to lay a hand on Derek’s shoulder, right where it curves up to meet his neck. ‘If you’re upset about it, it matters.’</p>\n<p>Derek gives in. He’s confused and a little wounded, but he’s not sure if he has any good reason to be, and he feels really, really stupid. And anyway, Stiles is his weakness. He can’t deny him anything, even if it’s someone else. ‘I’m just tired. I’m gonna go home, go to bed. I’ll be fine in the morning.’</p>\n<p>‘Okay. You want me to come with you?’</p>\n<p>It’s so very tempting to say yes, to go back with Stiles to the home that they share and keep him all for his own. But it wouldn’t be fair. It isn’t Stiles’ fault that Derek is six feet of simmering jealousy. ‘No. Go get back to your girl.’ He manages to smile enough that he almost convinces himself. </p>\n<p>Stiles hesitates. ‘Are you sure we’re okay?’ </p>\n<p>‘Yeah. Always.’ </p>\n<p>Stiles squeezes his neck. Derek fights to keep from leaning into the touch that all too soon is gone. </p>\n<p>When Derek gets back to the loft, he slips into Stiles’ room and grabs his noise-cancelling headphones. He puts them firmly them over his ears as he lays down onto his pillows, letting the unnatural silence fill his head. He doesn’t sleep at all, but he also doesn’t permit himself to open his eyes, and in the morning he doesn’t look at the sock that hangs from Stiles’ door handle, signalling a victory for Stiles and a loss for Derek. As he pours himself juice, there’s the muted sound of an unmistakably female voice from Stiles’ room, laughter and low moans. Derek crushes the headphones back onto his head and flees.</p>\n<p>He runs for hours, pounding the streets until his lungs burn. By the time he gets back, the sock has disappeared and so has Malia. Stiles doesn’t mention either, and neither does Derek, although he does have to keep averting his eyes from the half-moon shaped bruise just below Stiles’ ear. </p>\n<p>He doesn’t know how many nights like that he could take, even for Stiles’ sake.</p>\n<p>He fervently hopes it was a one-night thing. </p>\n<p>*</p>\n<p>It isn’t. </p>\n<p>Malia becomes a regular feature in Stiles’, and therefore Derek’s, life. </p>\n<p>She’s nice enough, at least. She’s uncomplicated and fierce in a way Derek can respect, which is annoying because Derek can’t even secretly despise her like he wants to. She’s good for Stiles, he grudgingly admits to himself. She wouldn’t know a mind-game if it bit her on the ass, and that’s exactly what Stiles needs right now. </p>\n<p>But the knowledge that what Stiles needs right now is not Derek, sits heavy and jagged in the pit of Derek’s stomach, and as he lugs it around with him day after day it cuts and wears away at his insides until he’s a mess of stinging exhaustion.</p>\n<p>They hardly see each other for weeks; if Stiles and Malia are home Derek does his best not to be, or Stiles is out, leaving the apartment far emptier than it ever felt before. </p>\n<p>Derek is tired and miserable, and the worst part is that Stiles is too busy to even notice.</p>\n<p>Derek’s inscrutable by nature, but still. Stiles is supposed to be his soul-match, the person who best understands Derek and he just… doesn’t. </p>\n<p>For the first time, Derek begins to doubt.</p>\n<p>Derek decides to go home for Thanksgiving, to let himself find badly needed solace in his mother’s arms. He refuses to think of it as running away, especially since he spends hours running every day just to avoid Stiles and Malia cuddling and laughing and exchanging syrup-sweet kisses over breakfast. </p>\n<p>If anything it’s to give himself a break from his constant running.</p>\n<p>He clears his schedule for a whole week, and goes home to the preserve. </p>\n<p>He knows it was the right decision as soon as he gets out of the car, giving himself a second to lean back against the chassis and let the susurration of the wind through the trees wash over him and sooth his soul. The air is so much sweeter here, he feels he can breathe properly for the first time in weeks – months, maybe. </p>\n<p>His family await him with hard hugs and gentle teasing, and as soon as he steps over the threshold he feels more like himself.</p>\n<p>This week away is exactly what he needs.</p>\n<p>His dad has made about seventeen thousand cookies in his excitement at having the whole family together, so Derek eats way too many of them and then goes on long hikes with his mom and his younger sister Cora to burn them off. He plays ridiculous games in front of the fire with his sister Laura, her husband Paul who is a quietly acerbic, funny man whom Derek likes tremendously, and their two little sons, Jacob and Joseph. He lets the familiarity and comfort of their love soak in through his skin, patching up the places where his heart has grown worn.</p>\n<p>In the evenings he slips out onto the porch and sketches, or just looks up at the stars, wondering whether the knowledge that Lupus is up there somewhere, as constant and mysterious as the reflection on his own skin, is a comfort or a curse.</p>\n<p>He doesn’t let himself think too much about Stiles during the day, but in the peace of the evening he finds the low-level yearning ache rises up in his chest again. It’s just that Stiles would be so perfect, here, he thinks. He can picture him helping his dad in the kitchen or laughing with his mom, picture Stiles and his autumnal eyes among the tumble of leaves outside, or waking up with Stiles in the teenage bed where he used to dream of his soul-match. It all still feels so right that it’s hard to let it go, even though he knows Stiles and Malia had probably planned to spend the week together holed up in the apartment doing god knows what to each other. </p>\n<p>The night before Thanksgiving, his mom finds him on the swinging bench on the porch. She hands him a mug of hot coffee and settles down beside him under a blanket. As she slips under his arm and leans against his side, he’s hit by a wave of nostalgia for how they used to do this when he was a kid, only Derek had been the one to cuddle in to his mom back then. Her long, dark hair smells of the same shampoo, even after all these years.</p>\n<p>They sip their coffee and sit together in companionable silence for a long time, then his mom says, ‘So Stiles, huh?’ and Derek splutters a bit, but isn’t all that surprised. He accepted long ago that his mom has magical powers about this sort of thing. </p>\n<p>Eventually he sighs and says, ‘Yeah. I mean… It’s Stiles for me. Not me for him.’</p>\n<p>His mom presses in closer. ‘He’s your soul match?’</p>\n<p>Derek nods.</p>\n<p>‘Does he know?’</p>\n<p>‘No. He’s seeing someone now anyway, there wouldn’t be any point telling him.’ </p>\n<p>‘The point is that you love him,’ she pauses to see if Derek will correct her. He doesn’t. ‘And right now you love him at the expense of yourself. I know you, Derek. You’re tired.’ She keeps her voice mild, but he can see the worry etched into the fine skin at the corners of her eyes.</p>\n<p>‘I’m okay,’ Derek protests, but he can hear his own insincerity ringing out like a bell. ‘He’s been through a rough time. He needs-' He cuts himself off, biting at his own lip. ‘He needed me.’</p>\n<p>Talia hums in sympathy. ‘You need to do what’s best for you, too. You can’t go on like this forever.’</p>\n<p>Derek looks up at the glitter of stars across the velvety sky and wonders if there’s any chance that Stiles is doing the same right now. ‘He’s important.’</p>\n<p>‘So are you.’ Talia hugs him tighter. ‘Come home for Christmas? I want to keep an eye on you.’</p>\n<p>‘Sure.’ Derek smiles down into the eyes that are just like his. He doesn’t mind her concern, not really. The warmth of it spreads through his chest, like a shot of bourbon. He puts an arm around her shoulders and kicks the swing off a little, wondering, not for the first time, what he would ever do without her. </p>\n<p>Thanksgiving dinner is chaotic and fun, even if it feels a little hollow for Derek, like something necessary is missing. Maybe he just needs to learn to live like this. Nevertheless, after draping a blanket over his parents who have succumbed to the mandatory Thanksgiving nap on the couch, he chases his nephews through the trees, his boots skidding on the fragrant, earthy mulch, and he lets himself feel lucky again.</p>\n<p>He ends up going back to the city a night earlier than planned, overcome with uncertainty about what to do about Stiles. His mom is right; it can’t go on like this forever. All he knows is that the thought of living with Stiles indefinitely while he’s caught up in other people is unbearable, but the thought of living without him is just as bad. </p>\n<p>When he gets back to the apartment the lights are all off and Stiles’ room is empty. His heart does a disappointed little dive. He’d been excited to see the idiot after almost a week without him. He must be out with Malia. He doesn’t bother with the lights, instead heading straight for his own room. It’s not that late, but he’s tired enough to sleep. He dumps his bag and yanks his sweater off, skidding to a halt when he notices the shadowy figure in his bed. </p>\n<p>‘Stiles?’</p>\n<p>‘Hey,’ the blanket-swaddled shape murmurs happily, ‘you’re back!’</p>\n<p>Derek is struck momentarily dumb by how pleased Stiles sounds to see him, and the fact that he is <em>in his bed.</em></p>\n<p>Eventually he says, ‘You know this isn’t your bed, right?’ Derek stands there awkwardly, sweater dangling from his forearms.</p>\n<p>‘Yeah...’ Stiles’ voice is thick with sleep. ‘Laundry on mine. Couldn’t be bothered to deal.’</p>\n<p>‘Oh.’ Derek blinks rapidly into the darkness. ‘I’ll just… I can sleep on the couch, no worries.’</p>\n<p>Stiles chuffs grumpily. ‘It’s a big bed, dude. Shut up and get in.’</p>\n<p>‘Uh, no, it’s fine. I’ll just…’ Derek takes a step backwards towards the door. </p>\n<p>‘What, are you worried you won’t be able to keep your hands off my sexy self?’ Stiles chuckles sleepily and pats the bed next to him ‘Come on, I promise to keep my devastating charm dialled down low. Gotta turn my swag off at night anyway or I wake up <em>covered</em> in devotees, and they take up way too much of my comforter.’</p>\n<p>Derek snorts and slides tentatively into the bed, keeping his jeans and undershirt on and making sure to leave plenty of space between their bodies. ‘You’re such a dick.’</p>\n<p>Stiles ruins it by turning over to face him, lessening the gap considerably. ‘Rude. I can’t believe I actually missed your grumpy ass.’</p>\n<p>Stiles’ face is inches from Derek’s own, his skin opalescent in the sliver of moonlight coming in through the curtains. Derek’s sure Stiles must be able to feel the pounding of his heart through the mattress. He frowns as his eyes adjust enough that he can see a familiar logo standing out darkly against Stiles’ white shirt. ‘Is this… are you wearing my shirt?’</p>\n<p>‘Mmhmm.’ Stiles yawns. ‘Laundry, ‘member?’</p>\n<p>Derek nods, although he’s not sure he understands really because he thought Stiles’ bed was covered in clean laundry. He chalks it up to Stiles’ innate weirdness. He rests his head on the pillow, letting the seclusion of the darkness seduce him into openly staring at the bold chiaroscuro outline of Stiles’ pale face and collarbones. He licks his lips. This is not helping at all with his indecision about whether to stay or not. ‘No Malia tonight?’</p>\n<p>He sees Stiles blink, slowly, a brush of dark lashes shading his cheekbone just for a second. ‘Nah. We decided we’re better as friends.’ </p>\n<p>‘Oh.’ Derek’s heart does a complicated manoeuvre in his chest. <em>Thank god.</em> He fights to sound normal. ‘Are you okay?’</p>\n<p>Stiles nods a little, and there’s a smile, just a flash of white teeth. ‘Sure. It was always just a casual thing. M’not sad or anything.’</p>\n<p>‘That’s good.’ </p>\n<p>‘I think so. It was good to have fun. I mean I’d never been with anyone but Lydia. But I think I’m maybe more of a serial monogamist, you know?’</p>\n<p>‘Yeah. Maybe.’</p>\n<p>‘Hey, Derek?’ Stiles snuggles deeper into Derek’s pillow, his eyes dark and unreadable. ‘I’m glad you’re home.’</p>\n<p>Derek watches Stiles’ long, silver fingers go lax in sleep before he whispers, ‘I’m glad I’m home too.’</p>\n<p>He means it. Being with Stiles is unbearable, but being without him is much, much worse.</p>\n<p>*</p>\n<p>Stiles at Christmas-time is just about as horrifying a prospect as Derek had anticipated. He gets home from work one afternoon to find that there’s been a Christmas tornado in his apartment, with Stiles at its eye, and every visible surface is strewn with red, green and gold sparkly <em>stuff.</em></p>\n<p>Derek sets his keys into the bowl on the table by the door, only now the usual plain bowl has been replaced by a truly hideous dish in the shape of Santa’s face, it’s lips pulled back into a rictus grin. Derek eyeballs it suspiciously for a second before slowly turning to face the rest of the living room. He winces as he takes in the gold tinsel tree, prancing reindeer statues and flashing coloured lights that are now everywhere. <em>What the hell…</em> ‘Oh god…’</p>\n<p>‘Hey, Der-Bear!’ Stiles bounces into the room and wisely hands Derek a large glass of eggnog. ‘I saved the tree decorations so we could trim it together.’ His hair is all over the place, presumably mussed up when Stiles pulled on the awful knitted Christmas sweater he’s currently wearing, and his eyes are burnished bronze in the Christmas lights.</p>\n<p>Derek can’t help but soften. ‘Fine…’ he grumbles, but he rolls his eyes to make sure Stiles knows he’s not going to enjoy it. </p>\n<p>He’s rewarded with a sweet smile and a paper bag to the chest.</p>\n<p>‘Ow! What the…?’</p>\n<p>‘It’s for you!’ Stiles grins and trots over to the remaining box of decorations, stood near the tree. ‘You have to be appropriately attired for Christmas merry-making!’</p>\n<p>With a horrible, sinking sense of foreboding, Derek peers into the bag. Every fear is realised when he sees the bright green knitted elf sweater waiting for him. ‘Hey, Stiles?’</p>\n<p>‘Yes, dear?’ Stiles winks obnoxiously and Derek hates him. </p>\n<p>‘I’m not wearing this.’ </p>\n<p>Stiles gives him a level look. ‘Derek. You’re wearing the sweater.’</p>\n<p>‘Not in a million years.’</p>\n<p>‘Please?’</p>\n<p>Oh fuck it. Derek sighs and tugs his own sweater off so he can put the offending item on. ‘Fine. But if you take a single picture, you’re dead.’</p>\n<p>‘Aye aye, Cap'n!’ Stiles nods vigorously, and then stops abruptly and just looks at him. </p>\n<p>‘What?’ Derek messes with the hem of the sweater self-consciously.</p>\n<p>‘Um,’ Stiles startles, his neck flushing pink against the white of his snowman sweater. ‘No, nothing. I’ve just… never seen anyone look actually good in an ugly Christmas sweater before.’ It’s mumbled so fast Derek barely catches it. </p>\n<p>His ears burn. ‘Shut up,’ he huffs, elbowing Stiles in the side. ‘And hand me that god-awful light-up star thingy…’ </p>\n<p>In the end he does actually enjoy trimming the tree with Stiles, who puts Christmas songs on loudly and insists on shaking his ass all around the apartment while Derek does most of the work. They finish the cookies Derek brought back from his parents’ house, and then watch It’s A Wonderful Life, which is Derek’s favorite. Stiles likes Elf, but Derek’s not nearly drunk enough for that.</p>\n<p>Derek stretches out on the couch, warm and full of cookies, and lets himself be lulled by the soporific effect of the soft lights and Stiles’ low-level, snarky commentary, which should by rights be really irritating, but is actually a reassuring reminder that Stiles is there with him.</p>\n<p>The last couple of weeks, since Derek got home from Beacon Hills, have been… nice. Falling back into their old, familiar routine has been as natural and as easy as breathing, but now it feels just a little bit different in a way that Derek can’t put his finger on. Stiles seeks Derek out more eagerly, but there’s an edge of hesitancy to Stiles when they’re together that Derek doesn’t really understand. Stiles has never tried to hold himself back when it came to affectionate touches, but lately he’s been far more tentative, and he seems to second-guess his own words, which has never been the case before (although Derek has often wished it were). </p>\n<p>It must be to do with Stiles getting over Malia, Derek thinks sleepily, eyelids comfortably heavy. ‘I’m just saying…’ Stiles is saying, somewhere just within the far edge of his consciousness, ‘Pottersville doesn’t look <em>that</em> bad… Dixieland jazz, jitterbuggers, cocktails… Where do I sign?’</p>\n<p>Stiles doesn’t seem nearly as upset over Malia as Derek had expected him to be, although he’s vague about the reasons behind their break-up.</p>\n<p>Maybe, Derek thinks, as his eyes finally close, he’ll never really understand Stiles the way the soul-match books always say he will. </p>\n<p>Hours later he wakes up so slowly he’s not even sure if he’s really awake or not. His neck and shoulders feel stiff, because he’s somehow slumped over onto his side on the couch, but the rest of him feels floaty and relaxed and… he carefully keeps himself still as he realises that his head has wound up on a pillow on Stiles’ lap, and that there are long fingers carding through his hair. He’s facing away from Stiles, towards the television, so he can’t see Stiles’ face, but Stiles doesn’t seem to be uncomfortable. He strokes Derek’s hair gently, each press of the pads of his fingers into Derek’s scalp sending showers of sensations over Derek’s skin. </p>\n<p>It takes Derek a full minute to start breathing again. When he does he weighs up his options; he could go with his first reaction, which is to jump up and ignore any awkwardness and make Stiles turn off Love Actually and go and start dinner. </p>\n<p>Or. </p>\n<p>He could stay right where he is, floating in this moment for as long he can, heart thrumming like a humming bird under his skin, not quite letting himself wake up so Stiles doesn’t have to stop. </p>\n<p>Stiles pushes his fingers up from the nape of Derek’s neck, and lets his nails drag just a little as he moves them back down. </p>\n<p>Derek stays.</p>\n<p>*</p>\n<p>Stiles refuses to go to his dad’s for more than a couple of hours on Christmas, and it turns out that the Stilinski house isn’t far at all from Derek’s parents’ house, so they wind up both going to the Hale house on Christmas Eve. Stiles makes plans to see his dad in the afternoon on Christmas day, and as his Christmas gift Derek offers him unprecedented use of the Camaro to make the trip. </p>\n<p>He even lets Stiles drive them both to Beacon Hills on Christmas Eve morning, which is worth it for Stiles’ joyful whoop at the consternation on Jackson’s face as Stiles blows by him, flipping him off (Derek strongly suspects Stiles texted Jackson to come to their apartment just to be sure they'd pass him, though Stiles denies it vociferously).</p>\n<p>Stiles is actually not a terrible driver – or at least he seems to be careful with the Camaro and its back seat filled with brightly wrapped gifts – and Derek is by default in charge of the music. They bicker for the whole journey. It’s kind of the best.</p>\n<p>Stiles is wowed by the sprawling Hale house, spectacularly lit for Christmas, and he loves the natural wildness of the preserve in winter.</p>\n<p>In return, the Hales love Stiles. Derek watches with pleased pride as Stiles chats with Laura and Cora, and then gives his mom a plant in a pot that his kindergarten kids made by hand.</p>\n<p>Talia seems charmed, although Derek doesn’t miss the curious glances she sends his way. </p>\n<p>He tries to tell her with his eyes that he’s okay, that everything’s okay. </p>\n<p>And it really is, at least for now.</p>\n<p>Stiles slots effortlessly into the landscape of Derek’s life, just like he’d always known he would.</p>\n<p>He has to keep reminding himself, brutally, that it’s not permanent; not real. Next year Stiles will probably be with someone else. </p>\n<p>Stiles is glorious, which makes it difficult to hold onto reality. The Hales are a family who like to tease, and Stiles is more than down with that, riffing gently off of Derek’s sisters. He’s so gorgeous, laughing in Derek’s family kitchen, that Derek can’t even resent being the focus of most of the teasing.</p>\n<p>He forgets it entirely when Stiles sits down with Joseph and Jacob and produces a little bowl full of cheerios, and another homemade plant pot. ‘My mom loved Christmas,’ Stiles says earnestly. ‘It was her absolute favorite. And she did this with me every year, so I make sure to never forget. But this year I need someone to help me out, do you think you guys could help me?’ </p>\n<p>The boys nod, faces rapt. </p>\n<p>‘Awesome!’ Stiles exclaims, grabbing the cheerios. ‘Now, we’re going to grow some bagels for breakfast.’</p>\n<p>‘You can’t grow bagels!’ Joseph protests, eyes comically round.</p>\n<p>Stiles laughs. ‘Sure you can! These are the seeds, see?’</p>\n<p>‘Those are cheerios!’ Jacob giggles. </p>\n<p>‘Well sure, that’s what cheerios are… bagel seeds, see? Do you guys not use them to grow bagels?’</p>\n<p>'No, we eat them!'</p>\n<p>'You <em>eat</em> them? Gross!' The kids fall about laughing at the mock outrage on Stiles’ face. </p>\n<p>Derek knows that Stiles is a kindergarten teacher, of course, but he’s never actually seen him with kids before. He’s mesmerising, pulling his face into all sorts of expressions to keep their interest, and subtly inserting facts and explanations into seemingly silly activities. Stiles notices him watching and shoots him a shy smile.</p>\n<p>Derek wants, fiercely, for him to always be here at this kitchen table, playing with his nephews.</p>\n<p>He wants fiercely for him to be at this kitchen table playing with <em>their</em> kids someday. He swallows as his want overwhelms him. He forces himself to smile back and to exclaim over the pot that his nephews have carefully planted their cheerios in. </p>\n<p>He and Stiles both get pulled away in different directions then; Derek to help his dad chop wood for the open fireplace and Stiles to look at a problem with Cora’s laptop, but Derek is always hyper-aware of Stiles’ proximity. There’s a low urgency, humming in his skin, to be close to him.</p>\n<p>He deliberately sits at the other end of the table to Stiles at dinner because he’s worried that having Stiles in his family home has cracked open his reserve enough that he might accidentally give himself away.</p>\n<p>It’s been years since he’s lain awake in his childhood bed on Christmas Eve, but that night he hardly sleeps for thinking about Stiles in the next room. When his clock ticks over to five thirty he decides enough is enough, and decides to get up and start putting breakfast together for everyone.</p>\n<p>He pulls on his favorite robe and pads downstairs, only to finds Stiles has beaten him to the punch. </p>\n<p>Stiles is standing at the kitchen counter, surrounded by bowls and pans, wearing red plaid pajama pants, a red long sleeved shirt, and thick, soft socks. Derek wants to take him upstairs, lay him out in his own still-warm bed, and peel every single thing back off him. </p>\n<p>‘What are you doing?’ He asks softly, heading for the coffee machine.</p>\n<p>‘Making bagels,’ Stiles says, wiping floury hands on a cloth. ‘I asked your mom if I could. We gotta have bagels, ya know… for the bagel plant.’</p>\n<p>‘Oh,’ Derek smiles, heat spreading through his chest at the realisation that Stiles - who famously sleeps anywhere, anytime, all the time - has risen early to make breakfast for his family. ‘Of course. They smell good.’</p>\n<p>Stiles blushes and ducks his head, uncharacteristically shy. ‘Thanks. And, uh, thanks for inviting me.’</p>\n<p>Derek shrugs. ‘Used to having you around, I guess.’ He fixes Stiles’ coffee and passes it to him. Stiles makes an approving noise at the novelty reindeer mug Derek has selected for him. </p>\n<p>They just have enough time to get the bagels out of the oven and arranged on a wooden tree made of pegs that Stiles places in the pot, before the thundering of little feet on the stairs announces that the boys are up, and therefore soon the rest of the house will be too. </p>\n<p>Jacob and Joseph are enchanted with the Christmas bagel magic, and then tear off to see if Santa brought their presents, too, and Derek steals one last long look at Stiles. His red shirt sets off the pale skin of his throat, and he’s laughing and carefree.</p>\n<p>Derek wants to spend every Christmas morning like this.</p>\n<p>Talia appears, wrapped in a robe, to coo over the bagels, and then Cora starts to coo over Stiles’ adorable socks, and the distance between Derek and Stiles gets further. And yet… Maybe it’s just wishful thinking, but… Derek can’t shake the feeling of Stiles’ eyes on him when he isn’t looking, and on the couple of occasions he does catch Stiles looking, he imagines he sees a strange sort of heat in his gaze, especially after he gets showered and dresses in the deep blue shirt Stiles bought him for Christmas.</p>\n<p><em>It’s not real,</em> he reminds himself. He’s just getting carried away at having Stiles here, with his family, at Christmas. <em>It’s not real.</em></p>\n<p>He props himself in the doorway to watch the boys open some of their gifts. ‘The key is not to over-water your bagel seeds,’ he hears Stiles tell his mom earnestly, behind him in the kitchen, ‘or you end up with a soggy bagel.’ He bites back a smile, then turns in surprise when he hears his mom press a wrapped gift into Stiles’ hands.</p>\n<p>‘Mrs Hale!’ Stiles sounds just as surprised as Derek feels. ‘You didn’t need to… I didn’t expect…’</p>\n<p>‘Talia,’ Derek’s mom says, eyes crinkled in amusement. ‘Stiles, it’s Christmas. You’re part of Derek’s family, so you’re part of ours now, too.’ Stiles looks at her for a long moment and then tears off the gold paper to reveal his own pair of pretzel pajamas, only these ones are red in honor of Christmas. Stiles’ shoulders shake with laughter. ‘Like I said… part of the family,’ she says, smiling wickedly. ‘Though now I feel like I should have gotten you bagel pajamas…’</p>\n<p>Stiles laughs and says ‘Maybe next year?’, making Derek’s face flood with warmth. ‘Thank you. These are,’ Stiles says, beaming so widely his cheeks must be sore, <em>‘so</em> awesome…’</p>\n<p>Talia steps up on her toes and wraps him up in a firm mom-hug. A complicated expression passes over Stiles’ face as he hugs her carefully back. Derek realises it must stir up memories of Stiles’ mom, and then has to look away from the intensity of the moment.</p>\n<p>A few minutes later Stiles makes his way over to him, his gift clutched to his chest. ‘I guess you can have your pants back…’</p>\n<p>Derek rolls his eyes. ‘Finally… Thought we’d be fighting over them when we’re old and gray…’ He blushes as soon as he realises how he’s given away his hopes for them still to be close when they’re old, but when he looks up Stiles’ eyes are soft.</p>\n<p>‘Don’t worry,’ Stiles says, ‘I’m sure we’ll find lots of other stuff to fight about.’</p>\n<p>Derek’s heart is rabbit fast in his throat, and Stiles is so close, he could just lean in a little and-</p>\n<p>‘Um, boys?’ </p>\n<p>Derek turns to find Laura giving them both a significant look, one hand on her hip. At the sight of his blank stare she sighs, rolls her eyes upwards and says, ‘Mistletoe…’</p>\n<p>‘Oh…’ Stiles looks upwards at the pearly white berries among the glossy foliage, strung from the door-frame on white ribbon. </p>\n<p>Derek shuffles awkwardly. ‘Just ignore her, it’s okay, she-'</p>\n<p>Stiles sighs. ‘God, it’s fine, shut up!’ Then he grabs a handful of Derek’s shirt and pulls him in, wrapping the other around the nape of Derek’s neck. For a heart stopping moment Derek thinks Stiles is actually going to kiss him, but instead he feels warm lips at the corner of his mouth for half a second, and then he’s wrapped in a long, luxurious hug.</p>\n<p>‘Merry Christmas, Derek,’ Stiles whispers in his ear.</p>\n<p>It’s Christmas, so Derek decides to be bold. He turns his head half an inch and presses a barely-there kiss just under Stiles’ ear. He doesn’t know if Stiles can feel it or not, but he feels dizzy with daring anyway. ‘Merry Christmas, Stiles.’</p>\n<p>They break apart at the sound of Cora excitedly greeting a new arrival.</p>\n<p>‘Holy shit, Paige?!’ Derek crosses the kitchen in three strides and throws his arms around her, spinning her around delightedly. It’s been years since he last saw her, but she looks exactly the same, just with a more sophisticated haircut. </p>\n<p>She laughs and tucks her head into his shoulder. ‘Hi… I hope it’s okay I came by, I saw your mom in the grocery store last week and she invited me over…’</p>\n<p>‘Of course. It’s good to see you.’ Christmas could not get any better, Derek decides. All his favorite people are here with him, there’s three different kinds of meat roasting in the oven and life is good.</p>\n<p>A slight clearing of a throat behind him prompts him into putting Paige down. ‘Paige, this is my friend Stiles. Stiles, this is Paige, my… ex-girlfriend.’ It still feels weird to say it, even though their break up wasn’t at all weird, and he’s heard through his sisters all about Vic, the new love of her life, who she lives with. He wants to hear all about him, all about what her life is like now. She was his first love, something sweet and pure, and he’ll always have a soft spot for her. </p>\n<p>‘Ex-girlfriend?’</p>\n<p>‘We were high school sweethearts,’ Paige says, holding out a hand to Stiles.</p>\n<p>‘Ohh…’ Stiles can’t seem to stop staring at her as he takes it. ‘Sorry, it’s just, I live with Derek and he hasn’t dated in all the time I’ve known him, so to have proof of actual human relationships is…’ He mimes an explosion near his head with his hands and makes a <em>‘kaboom!’</em> sort of noise.</p>\n<p>Paige slips her coat off over her shoulders and accepts Talia’s offer of tea and one of Stiles’ bagels. ‘Still holding out for your soul-match, huh?’ </p>\n<p>Derek nods. ‘Still hoping.’ </p>\n<p>Stiles stifles a huffing noise which makes Paige tilt her head a little, curiously.</p>\n<p>‘Stiles doesn’t believe in soul-matches,’ Derek explains in what he hopes is a steady voice. </p>\n<p>‘No?’</p>\n<p>Stiles shakes his head. </p>\n<p>‘Good for you!’ Cora interjects. ‘We all think Derek was crazy to let Paige go. They were insanely perfect together…’</p>\n<p>‘Is that why you didn’t stay together?’ Stiles asks, ‘Because of Derek’s soul mark?’</p>\n<p>Paige blushes pink. ‘Derek left for college. But I always knew about the soul mark, and how much it means to him.’</p>\n<p>‘Soul match or bust, huh?’ Stiles glances sharply over at Derek.</p>\n<p>Derek has no idea how to answer that so he just shrugs.</p>\n<p>‘I don’t believe in that, I…’ Stiles rubs a hand through his hair. ‘I believe more in love, I guess. I actually had Derek tattoo over my mark, it’s how we met.’</p>\n<p>Derek can see his mother’s back stiffen and decides to do damage control. ‘Hey, Paige, come and meet my nephews?’</p>\n<p>Catching up with Paige is so nice that it takes Derek a while to notice that Stiles has slipped away.</p>\n<p>He reappears a while later and sits for a while, listening to Derek and Paige reminisce about their high school relationship; Derek’s nervous first kiss, their first date, and what’s happened to each of them since they said goodbye. </p>\n<p>Stiles is uncharacteristically quiet, and picks anxiously at a loose thread on his jeans. Derek catches his eyes and mouths ‘Okay?’ at him, and Stiles nods stiffly. ‘Time to go to my dad’s,’ he says with a nervous smile. </p>\n<p>Derek’s chest aches for him. ‘You want me to come?’ He goes to the hall to grab his car keys from his jacket pocket. </p>\n<p>‘Nah. It’ll be fine. And Paige is here, so.' Stiles stuffs his hands in his jeans pockets. 'You stay and catch up. I’ll be back later.’</p>\n<p>Derek frowns. Something feels off. ‘Okay...’ </p>\n<p>He wants to hug Stiles, but after the intensity of the hug they shared in the kitchen it feels weird. Awkward. He remembers how it felt to press a kiss into Stiles’ skin, and his ears burn. </p>\n<p>‘See you later!’ Stiles blurts out, and then he scrambles out of the door. </p>\n<p>Derek stares after him for a second. He wonders if kissing Stiles like that was going too far. Maybe he freaked him out. It didn’t seem like he’d minded, in the moment, and after all, Stiles pulled him in first, but maybe now he’s had some time to reflect… He sighs and turns to go back to his family. </p>\n<p>He’s probably over-thinking it all. Stiles is probably just nervous about seeing his dad. It’ll all be alright when he gets back, later.</p>\n<p>*</p>\n<p>Stiles makes an effort to seem okay when he gets back from his dad’s, but Derek knows him too well by now. He decides to wait until they get back to the loft before he tries to talk to him about how it went, but if anything Stiles retreats into himself further.</p>\n<p>He doesn’t avoid Derek or do anything very different, it’s just that he’s a little subdued – a little sad, somehow. When Derek tries to ask if he’s okay he avoids Derek’s eyes and finds a reason to excuse himself from the conversation.</p>\n<p>Derek wonders again if he went too far with the kiss, but then he remembers how Stiles had kissed him too, just for a second, and the whispered ‘Merry Christmas’ in his ear, and he ends up going around in circles in his own head.</p>\n<p>He doesn’t know what to do, other than trust that Stiles will come to him in his own time. </p>\n<p>On New Year’s Eve, Derek is in his room sketching when there’s a knock at his door. </p>\n<p>It’s Stiles, wearing nice jeans and a dark t shirt and an expression of fierce determination. ‘Wanna go out tonight?’</p>\n<p>‘Out?’</p>\n<p>‘Yeah. Let’s go to Heat. Everyone else is going to be there. And I… don’t want to celebrate New Year without you.’</p>\n<p>Derek looks at his messy hair and his dark eyes, and the way he’s nervously biting his lower lip. He doesn’t really feel like going out to a club – hasn’t since the night Stiles met Malia - and honestly, a lot of his uncertainty is because he’s worried Stiles is looking to hook up with someone tonight. But he knows how much Stiles loves to be out among people, how he loves to dance. It feels like Stiles' flame has been dimmer since Christmas. Derek would give anything to see him burn again. ‘Okay.’</p>\n<p>*</p>\n<p>The club is a crush of people, noise, and heat. Derek would hate it except it means Stiles has to stay close, pressed down his side in a solid line of heat. They have to wait for far too long to get drinks and then Stiles downs his instantly. Derek stares at the muscles of his throat as he tips his head back. Derek looks for a space to wait while Stiles goes to dance – he’s sure he saw Scott and Kira in the crowd not long ago, and Stiles has already been hugged by several happy, sparkly people whom Derek doesn’t know – but instead Stiles grabs his wrist.</p>\n<p>His breath ghosts hot over the shell of Derek’s ear, sending a shiver down his spine. ‘Dance with me.’</p>\n<p>Derek shakes his head, expecting Stiles to wander off in search of easier prey like he usually does, but Stiles stays put, an unusual intensity in his eyes.</p>\n<p>‘Come on, Derek. Don’t make me dance alone…’ Stiles tugs at his hand and Derek allows himself to be pulled along, helpless against the force of nature that is Stiles on a dance-floor.</p>\n<p>Stiles is flushed under the pulsing lights, his hair curling a little at his damp temples. His shirt is sticking to his skin, showing off the breadth of his shoulders and his narrow waist. His lips are bitten red and he has glitter smeared over his cheekbones. Derek has never seen anything more beautiful in his life. </p>\n<p>He lifts his eyes to meet Stiles’ and realises with a jolt that he’s been caught staring. Stiles stares right back, and then smiles, slow and wicked, as he turns around and grabs for Derek’s hands to pull him flush against Stiles’ back. Derek tries to drop his hands but Stiles still has hold of his wrists, so he settles them lightly on Stiles’ hips. He doesn’t really know why Stiles wants to dance with him like this but he supposes it at least gives him the chance to glower away any admirers that might approach him, so maybe Stiles will go home alone tonight – or just with Derek, anyway – and will put on his pretzel pyjamas and play Mario Kart with Derek until they fall asleep on the couch. Maybe Derek won’t have to block out the noise of someone else touching Stiles when he can’t. Maybe he can save his heart a little, tonight. </p>\n<p>Stiles starts to move, and Derek can see from the thick fan of lashes over Stiles’ cheekbones that he’s closed his eyes, so for once so Derek loses himself in the music too. He moves slower and with more purpose than Stiles, whose movements are always erratic and free. He likes how it feels to have Stiles enfolded in the loose cradle of his arms and his hips, likes being the solid counterpoint to Stiles’ unrestrained energy. </p>\n<p>He hopes Stiles can’t feel his thundering heart or the way his hands shake once Stiles’ shirt rides up and leaves Derek’s thumbs pressed into soft skin stretched over sharp hip bones. Despite the scant distance Derek carefully keeps between their pelvises (no thanks to Stiles who Derek would think was purposefully trying to grind back into him, if he didn’t know better), this is probably the closest he’ll ever let himself get, so he drinks in every second, all greed and need and self-control. He tries to commit the way Stiles’ hair smells to memory, and lets his eyes trace the slow trickle of a droplet of sweat as it makes its way down Stiles’ neck. He wants to lick it so badly it makes his jaw ache. </p>\n<p>He closes his own eyes, then. It’s too much.</p>\n<p>After several songs Stiles turns in the circle of his arms and pokes an accusatory finger into his chest. ‘You can dance!’</p>\n<p>Derek smirks at him. </p>\n<p>‘You asshole! You’ve been holding out on me all this time!’ Stiles is smiling too widely to really sound pissed off, and Derek is acutely aware of the fingertip Stiles has left pressing into his chest, for much too long. He glances down at it, expecting Stiles to remove it, but all Stiles does is flatten his hand so his palm is pressed over Derek’s heart. </p>\n<p>Derek feels his ears burn under the Stiles’ warm gaze which travels over him, slow and unabashed and deliberate. He feels the searing heat of Stiles’ hands on his shoulders, on his chest, on his waist, and then there’s fingers hooking through his belt loops, pulling him in, and Stiles’ chest is pressed against his own and he feels the brush of eyelashes along his cheekbone.</p>\n<p>He slows his dancing down to a gentle sway, in case any sudden movement breaks the spell cast by the dim lights and loud music.</p>\n<p>‘Derek…’ Stiles says his name, low and desperate, and then leans in and kisses him. </p>\n<p>Derek is still and stunned for a heartbeat before he kisses back, sliding his hands up to cup Stiles' jaw. He wants Stiles so badly, has wanted him for so, so long, that he can’t help himself. Stiles tastes sweet and spicy, like the coca cola he’d had with his rum, and his jaw is soft and strong and rough and perfect under Derek’s fingers. He licks his way into Stiles' mouth like they’ve done this a thousand times before.</p>\n<p>Only it's <em>not</em> like any kiss he's ever had before. Since the day they met, the way he feels about Stiles has been a simmering ember that Derek tries not to feed too much oxygen, so the flame stays low and under control. But this kiss... it's a kiss of fire. The ember bursts into scorching flames that fill his chest and lick their way down his limbs, following the fiery feathers of his phoenix. All his worries and self-restraint are incinerated as he loses himself in the crucible of the kiss, only aware of Stiles' hand curled around the nape of Derek's neck, and the other still gripping at his belt loop and the flesh right above his waistband. He'll have bruises there tomorrow in the shape of Stiles' fingertips, he thinks, pleased.</p>\n<p>Derek pulls back a little to nip at Stiles' lower lip, smiling at his gasp, and then he presses kiss after urgent kiss to the swollen flesh. He kisses Stiles’ cheeks and his nose and his eyelids, kisses along his jaw and the lobes of his ears, kisses his forehead and his temples, chaste or open-mouthed, anything, anywhere he can reach. He kisses Stiles for all the times he’s wanted to kiss him but couldn’t, kisses him for all the times he might not get to in the future. He tries to press his love and his adoration into Stiles’ skin through his kisses, wanting to give as much as Stiles will allow, until they have to separate to breathe. Instead they rest their foreheads together, propping each other up. Doubt takes advantage of the stillness of the moment, creeping in around the edges. Derek can't bring himself to look at Stiles' face for fear of what he might see there.</p>\n<p>‘So...' Stiles sounds wrecked, and heart-breakingly uncertain. 'I guess we need to talk?'</p>\n<p>Derek risks slanting a look up at Stiles, who seems… not exactly happy, though it's hard to get a good read on him under the pulsating lights. He doesn’t seem angry or appalled by Derek’s passionate response to his kiss, but he’s fidgety and his mouth is sad. Derek wonders if he went too far – although, he reminds himself, it was Stiles who initiated the kiss, and the dancing, and this whole goddamned night. And it’s Stiles who is gripping onto him still, bony fingers digging fiercely into the meat of Derek’s shoulder. Yet he’s skittish and uncertain, refusing to fully meet Derek’s eyes, and that makes worry trickle icily down Derek’s spine.</p>\n<p>He manages a nod. ‘Yeah. Let’s talk.’</p>\n<p>‘Not here,’ Stiles says, and Derek remembers with a strange tilting sensation that they’re still on a dance floor, heaving with bodies. Stiles is right. This shouldn’t happen here.</p>\n<p>‘Home?’ Maybe some privacy will help settle Stiles.</p>\n<p>An odd shadow crosses Stiles’ face. ‘Right. Home.’ </p>\n<p>Derek’s heart sinks a little further. It’s not like he’d expected Stiles to throw a parade in celebration of the kiss or anything, but he also hadn’t expected this nervous reserve. Derek’s used to Stiles being unapologetically honest and unfiltered, so for him to continue the uncharacteristic evasiveness of the last week even now… it’s weird and it makes Derek feel wrong-footed. </p>\n<p>Stiles lets go of him long enough to make an abstruse motion towards the exit, and turns to move through the crowd, reaching back tentatively. Derek grabs at the gesture with both hands and all his hope, and holds on tightly.</p>\n<p>He’s not going to risk losing Stiles now.</p>\n<p>There seems to be an unspoken agreement not to bring up the kiss, or any of the potential emotions surrounding it, until they get back to the loft, which leads to a very strange, silent Uber journey with them both trapped awkwardly in a tin can that smells too strongly of air freshener. Derek’s not actually sure he’s ever seen Stiles be quiet for so long before. Stiles jiggles his knees incessantly, staring out of the window at the street lights that flicker by. Derek tamps down on the urge to settle a hand on his knees to try and still them.</p>\n<p>It's an unsettling contrast that the kiss, which was so much more than Derek had ever hoped for, should be followed by this thick, unhappy tension. Oddly, as Stiles gets more and more agitated, Derek feels more and more calm and in control. </p>\n<p>He wants to tell Stiles it’ll be okay. He wants to tell him that if it was a mistake on Stiles’ part then yeah, it would suck for a long time, but in the end it would be okay because they’re friends, first and foremost. He wants to tell him that if it <em>wasn’t</em> a mistake – if, for whatever foolhardy, miraculous reason, Stiles wants him – then that’ll be okay, too (and so much more, of course). He wants to tell him about the soul-mark. He wants to tell him everything. It feels like Stiles is finally ready to hear it and then… Well, then Derek finally gets an answer. And then life will go on, and one way or another it’ll be okay. </p>\n<p>There’s nothing he can do, though, except link his fingers more firmly with Stiles’ where they lie intertwined on the seat between them, and try to reassure him with the touch.</p>\n<p>They reach the apartment building after what feels like several years of Derek’s life. He’s sure Stiles must have worn through the car upholstery under his nervous feet. It doesn’t bode well for his wooden floors, he thinks with an anticipatory wince. </p>\n<p>They squeeze into the little elevator, apologising to each other repeatedly over who’s going to push the button, and Derek has to suppress a laugh at the importance they’re ascribing to such an inconsequential thing, in an effort to distract themselves from the much bigger, much scarier issue they’re both ignoring for now. </p>\n<p>The peaceful sanctity of the loft doesn’t seem to settle Stiles at all. Derek stands, arms folded over his chest, watching in bemusement as Stiles paces all over the place, muttering to himself, getting more worked up by the second.</p>\n<p>‘Do you want coffee? I could use some coffee. It’s not too late for coffee, right? I mean it probably is but it’s not like we’ll be sleeping tonight now anyway…’ He skids to a halt in between the fridge and the coffee machine and glances back over his shoulder at Derek, wide-eyed. ‘I did not mean it like that! I didn’t have, uh… I have no expectations or anything, I just meant because, you know, with the talking…’</p>\n<p>‘Stiles.’ Derek cuts him off firmly. ‘No coffee for me, thanks.’</p>\n<p>‘Okay.’ Stiles’ cheeks go a shade more pink. ‘Yeah.’ He looks down at the package of coffee in his hands. ‘I probably don’t need any either.’</p>\n<p>‘You think?’ Derek raises an eyebrow. </p>\n<p>‘Shut up.’ Stiles turns impossibly pinker. Derek wants to know how low the blush spreads under the black t-shirt that clings softly to his chest and shoulders.</p>\n<p>‘Can’t shut up <em>and</em> talk,’ Derek says dryly. Usually being an asshole needles Stiles out of whatever hyper-focused rabbit-hole he’s going down, and he figures now isn’t the time to change up tried and tested methods. </p>\n<p>Stiles’ eyes flash as he snorts. ‘Please. Like you won’t be using your eyebrows for ninety per cent of your communication anyway.’</p>\n<p>Derek takes a slow step closer.</p>\n<p>Stiles looks vaguely panicked and sets off in the direction of his bedroom. ‘Pajamas! I need pajamas. I can’t do my best thinking all gussied up. I need to be free, Derek, free to express myself!’</p>\n<p><em>Gussied up?</em> Derek’s other eyebrow slides right up to join the first somewhere up by his hairline as he trails Stiles to the bedroom, leaving several feet of space between them. ‘You want to put on pajamas to free your thoughts? I guess that depends on where your thoughts are going to be coming from…’ </p>\n<p>Stiles stops rummaging in his dresser and reflexively looks down at his lower body, mortification spread across his cheeks and chest in deep red splotches. He sniffs haughtily in Derek’s direction. ‘I fucking hate you.’</p>\n<p>Derek smirks. ‘I’m pretty sure you don’t.’</p>\n<p>‘Of course I don’t,’ Stiles murmurs, so low Derek barely hears it. ‘I-' Stiles catches himself. ‘Fuck…’ He pulls out the pajamas Talia gave him at Christmas and holds them to his chest like a shield and mutters, ‘I promised myself I wasn’t going to do this…’</p>\n<p>‘Do what?’ Derek takes a step into Stiles’ room. It’s the messiest room in the loft by far, with video games and books and clothes shoved in careless heaps here and there, and the bedding always rumpled. Derek’s always felt a deep sense of satisfaction when he sees Stiles’ stuff inhabiting the space he owns, draped over the furniture Derek picked out when he bought the loft. It smells of Stiles’ cologne and shampoo and Stiles, layered into the bedclothes and the curtains. It feels safe and warm, like a den. For some reason the thought makes contentment unfurl cozily in Derek’s stomach.</p>\n<p>He wrenches his gaze from the mussed-up bedding to find Stiles glaring at him. ‘You have ears like a bat, anyone ever tell you that?’</p>\n<p>‘Do what, Stiles?’ Derek sighs in exasperation. ‘Can you just… step away from the pretzel pajamas? Please? So we can talk?’</p>\n<p>Stiles nods jerkily and sets the pyjamas back in the drawer. Derek can see his agitation in the rapid rise and fall of his chest. </p>\n<p>‘Hey,’ Derek says softly. ‘If you don’t want to, that’s fine. I need to talk to you, soon. But if you’re not up for it tonight that’s fine. I’ll be here tomorrow, and the day after that.’</p>\n<p>Stiles glares at him sharply. ‘Can you stop doing that? You’re not helping.’</p>\n<p>Derek sits on the edge of the bed, near the footboard because being anywhere near Stiles’ pillows feels too intimate right now. ‘You’re going to need to be more specific.’</p>\n<p>‘Can you stop doing your adorable-asshole thing? Because I’m trying really hard to respect your boundaries and have some self control, and neither of those things are my best things, okay? Like they would not be on my resume under ‘Things Stiles is Excellent At’. And it’s already all going wrong because I let myself give in and then that kiss was… <em>fuck,</em> Derek.’ Stiles sounds sort of like he wants to cry as he drops down on the edge of the bed next to Derek, carefully not touching him.</p>\n<p>Derek tucks a leg up under himself and runs everything through his mind for a moment before he blinks and shakes his head. ‘Yeah, try being even more specific than that.’</p>\n<p>Stiles’ hand inches closer, bridging the space between them. His fingertips brush over the back of Derek’s hand tentatively, like a question. Derek can’t stop his hand from jerking closer to Stiles’ in response. Emboldened, Stiles gently laces their fingers together. ‘So here’s the thing…’ Stiles takes a deep breath in and then exhales it, gustily. ‘I’m in love with you.’</p>\n<p>The words shimmer in the air for a long moment before they fade away into silence.</p>\n<p>Derek stares at Stiles’ face, searching for reassurance of his sincerity, even though he knows Stiles would never joke about this. But still, he thinks wildly, Stiles could be drunk (though he knows he’s not) or possessed (admittedly unlikely) or, or, <em>something.</em> His blood pounds in his ears. He feels like something hot and tingly has filled his chest and stolen all his air.</p>\n<p>‘I mean, you knew that, right?’ Stiles asks uncertainly.</p>\n<p>‘No.’ Derek shakes his head. ‘Definitely didn't.' </p>\n<p>‘Oh.’ Stiles twists his fingers anxiously. ‘I just thought… At Christmas with the mistletoe I was, like, horribly obvious, I thought for sure you at least suspected.’</p>\n<p>‘No.’ Derek tries to put words together, but can’t make anything fit. ‘For… long?’</p>\n<p>Stiles opens his mouth then closes it, and swallows. He looks away. ‘So… remember when Malia and I stopped seeing each other?’</p>\n<p>‘Yeah…’ Derek does remember, extremely well. It was the night he’d come home to find Stiles in his clothes, in his bed. It’s a moment he often re-lives in glorious technicolor.</p>\n<p>Stiles shifts a little, guiltily. ‘I haven’t really told you the entire truth of what happened there…’</p>\n<p>Derek frowns a little. ‘Okay…?’</p>\n<p>‘Uh, after you left to go to Beacon Hills, I was worried. You’d seemed sad and I didn’t really get to talk to you about it. I’d gotten half-way through planning this epic Thanksgiving day with just the two of us and beer and football and stuff, and you know, bro-time? But then you decided to go home instead. Anyway, it was uh, weird here without you.’</p>\n<p>Derek feels a rush of retrospective affection, knowing he hadn’t been forgotten in the run-up to Thanksgiving. ‘Weird…’</p>\n<p>‘Weird. Shitty. Um, it’s possible that I…’ Stiles makes a frustrated spiral in the air with his free hand. ‘It’s possible I missed you a little.’ He ducks his head. ‘A lot. It’s possible that I talked about you to Malia a bit. Or, you know… A lot. And so I called her the night before you came home to see if she wanted to go get pizza with me, and she was all like, ‘Sounds nice Stiles but I really think you should stay home and tell your roommate you’re in love with him,’ and I was all like, ‘Pshaw, joke’s on you, sister, Derek’s not even home for two more days, and p.s. you’re ridiculous, I’m obviously not in love with Derek,’ and she was all like ‘If you call me sister ever again I’ll rip your balls off,’ and I was all like, ‘Yeah, no, that’s fair,’ because I don’t even know where that <em>came from,</em> man, I have literally never called anyone ‘sister’ in my entire life before, except for this one time when I was crossing the road and there was this nun-'</p>\n<p>‘Stiles,’ Derek says firmly. </p>\n<p>Stiles blinks. ‘Right. Right. Okay, so she had just insightfully pointed out that my being latently in love with you was a slight barrier to my relationship with her, and that we should probably just stay friends, and then she hung up and I stared at my phone for thirty minutes because wow, was that ever a wake up call. I mean it's not like I'm not aware of how gorgeous you are, and yeah, maybe I'd had a couple of low key fantasies about, like, covering you in whipped cream and licking it off, and this one time I did have a dream we got married, and it was <em>beautiful</em> man, but. I guess I was in denial or something. I don’t know how she figured it out before I did. I guess I’m not all that subtle…’ He reaches out to shove Derek in the shoulder when he snorts. ‘Shut up. Anyway, I handled my moment of stunning elucidation like a boss and ended up wandering around the loft all bereft, like, smelling your sweaters and stuff and in the end I went and got in your bed and that was where you embarrassingly found me, dressed in your clothes. God, so mortifying.’</p>\n<p>Derek hums. ‘No, I thought that was pretty great.’</p>\n<p>Stiles laughs and covers his face with his hands. ‘Dumbass.’</p>\n<p>Derek reaches over and gently wraps his fingers around Stiles’ wrists, pulling them away from his face. ‘Why are you so worried?’</p>\n<p>Stiles swallows with an audible click. ‘Because of Christmas. Because… I think you love me, too.’</p>\n<p>‘And that’s… bad?’ Derek shakes his head in confusion.</p>\n<p>‘Yeah.’ Stiles’ face crumples. ‘Because you loved Paige, right?’</p>\n<p>Derek’s head is spinning from the 180. ‘There’s nothing going on between me and Paige, there hasn’t been for years.’</p>\n<p>‘Exactly! Because even though you loved her and she’s beautiful and lovely and you guys were great together… You still broke up with her for your soul-match. And I love you, and I tried to be selfless or whatever because I know how much your soul mark means to you. I want you to be happy…’</p>\n<p>The familiarity of those words is not lost on Derek, nor their irony, and all he can do is gaze at Stiles with his heart in his mouth. ‘Stiles…’ </p>\n<p>‘But clearly I suck at selflessness and I obviously can’t stay away from you, not if you like me back. But I can’t be some stop-gap thing for you until your soul-match comes along and you <em>leave</em> me…’ Stiles’ voice breaks, and so does Derek’s heart, a little.</p>\n<p>‘Stiles.’ </p>\n<p>‘-which is why I thought maybe it’s better if I move out because I can’t really be here with your stupid <em>face,</em> Derek-'</p>\n<p>‘Stiles!’</p>\n<p>‘-and Scott said I could crash with them until I find a place-'</p>\n<p>In the end Derek crouches in front of Stiles, takes his face in his hands and kisses him quiet. It’s without a doubt his favourite way ever to shut Stiles up. He intends to use it often. Unless Stiles kills him for not telling him about the soul-mark sooner, or – worse – rejects him because of it. </p>\n<p>‘Uh,’ Stiles manages, eloquently.</p>\n<p>Derek knows now is the moment – knows it’s right and necessary and inevitable. After all, every second of his life so far has led him right here. But he’s still shaking, a little. ‘I need to tell you something. Shut up and let me, okay?’ </p>\n<p>‘’Kay.’</p>\n<p>He takes a breath and meets Stiles’ gaze. ‘I love you, too. I want you to know that. I have for… a long time.’</p>\n<p>Stiles’ eyes narrow. ‘A long- How long are we talking, here?’</p>\n<p>Derek straightens up, leaving Stiles sitting on the edge of the bed, and brings his hands to rest at the waistband right above his soul mark. The air in the room feels thick and charged. Unsteadily he slips the button of his jeans through the button-hole and tugs the waistband down over his hip, rucking up the leg of his boxers, revealing the mark.</p>\n<p>Stiles is, predictably, already talking again. ‘Okay, what is happening here? Because I know I’m not exactly Casanova or anything but even I know that taking your pants off shouldn’t be your first reaction to someone telling you they love- holy shit, what is that?’</p>\n<p>Derek’s heart races, making blood surge through his veins fast enough to make him dizzy, and he steadies his hands against himself. ‘It’s exactly what it looks like, Stiles.’</p>\n<p>Stiles slowly leans in closer, curling one hand around Derek’s hip bone while he traces the mark on Derek’s thigh with a feather-light fingertip. ‘Is this… a tattoo? Because I really don’t think that’s funny, Derek…’</p>\n<p>‘It’s real.’</p>\n<p>‘But…’ Stiles sits back far enough to look up at him. ‘But… It’s…’</p>\n<p>‘The same as yours.’</p>\n<p>Stiles falls silent as he starts to take in what that means. <em>‘Derek…’</em></p>\n<p>Derek lets him look at the mark until he starts to feel squirmy with self-consciousness, anxiety snarling up in his stomach. He hikes his pants back up and sits down on the bed before his legs give out. Half a second later he feels the mattress bounce as Stiles stands.</p>\n<p>Stiles walks to the other side of the room, scrubbing his hands through his hair. It’s several minutes before he says anything, and when he does he sounds furious. ‘What the fuck, Derek? Why would you… Jesus, I would never have…’</p>\n<p><em>Never have stayed,</em> Derek thinks miserably.</p>\n<p>'I would never have hurt you like that…’ Stiles looks over at him, distraught. ‘I must have hurt you so much...'</p>\n<p>Oh. </p>\n<p>‘And god, I never would have…’ Stiles waves a hand towards his room, ‘…with Malia here, in front of you, I…’</p>\n<p>‘I know.’ Derek moves his head until he snags Stiles’ gaze. ‘I know you wouldn’t have.’</p>\n<p>Stiles shakes his head rapidly. ‘Then why the fuck wouldn’t you say something?’</p>\n<p>Derek sighs. ‘You weren’t doing anything wrong. You didn’t know. And… I wanted you to be happy, too.’</p>\n<p>Stiles slumps down into his desk-chair, exhaling loudly as he goes. Then he groans and presses a hand to his forehead. ‘Derek. The tattoo…’</p>\n<p>Derek chews on the inside of his cheek, hoping he can make Stiles understand. ‘I know.’</p>\n<p>‘Oh my god… Are you crazy? I would never have made you do the tattoo, I can’t believe you even did it. I know how you feel about your mark.’</p>\n<p>‘I thought about telling you that first day. I came really close. But… come on, Stiles, you didn’t even know me. Are you really telling me there wouldn’t have been a Stiles-shaped hole in the door two seconds after I’d told you? You wouldn’t just have gone to find another tattoo artist and studiously avoided my part of town for the rest of your life?’</p>\n<p>Stiles’ pregnant silence tells Derek he’s right.</p>\n<p>‘Besides, you were with Lydia so what was the point? When you and Lydia broke up I was so glad that you came here, that you let me be here for you. I thought if I told you then it would seem like maybe I was trying to take advantage of you at a vulnerable time. And I figured maybe the soul-match thing meant friendship for us, even though I felt differently.’</p>\n<p>Stiles just stares at him, jaw slack. Derek rubs his palms nervously on his jeans. ‘But you were never okay enough with the idea of it meaning friendship to date anyone else?’</p>\n<p>Derek shrugs. ‘Maybe I would have been, in time. If you decided, right here, right now, that you didn’t want this… I’d respect that. And I hope in time I would come to care for someone else. But since you walked into the studio, I… It’s only been you.’ </p>\n<p>‘You didn’t know anything about me.’ Stiles sounds hoarse and exhausted.</p>\n<p>‘I know that you don’t feel the same as me about soul marks, but. I trust this.’ He presses his fingers to his mark. ‘And time with you just… It hasn’t changed my mind. At all.’ </p>\n<p>Stiles blinks dazedly and shakes his head a little like he's trying to get everything straight in his mind. ‘I just can’t believe you put up with all my crap, this year.’ </p>\n<p>Derek shakes his head. ‘Look, I know it comes across as… Masochistic? But it was partly a selfish decision, not to tell you.’ </p>\n<p>Stiles looks up at him. ‘What do you mean?’</p>\n<p>‘I wanted you to be happy. I still do. I love you, and to me that means that you being happy, with or without me, is more important than anything. But I also wanted…’ He trails off, searching for the right words. This is the last secret he needs to tell Stiles, the last knot in his stomach he needs to unpick. Then he’ll be fully bare in front of him, and the rest will be up to Stiles. </p>\n<p>‘What did you want?’ Stiles prompts softly.</p>\n<p>‘I wanted you to choose me,’ Derek says.</p>\n<p>He’s not proud of the words, but letting them out is an unburdening nonetheless. ‘I knew right off the bat how you felt about soul-matches, and I knew that if I told you… Maybe in the beginning you’d have left, and then as we became closer, maybe you’d have felt some sort of sense of… obligation. I didn’t want that. So I wasn’t honest with you, I… I deceived you because I wanted you to stay with me. Or at least as close to me as you wanted to be, in the hope that one day you might choose me.’ He spreads his hands helplessly in front of him. ‘If you ever did choose me, I wanted to know that it was just because I’m what you want. No other reason. I wanted that. For myself.’ </p>\n<p>The words ring childishly in his ears, and he looks down at his hands, ears hot, as he waits for Stiles to call him out for being selfish or a creeper or just plain weird, but then he tips backwards with a yelp when Stiles barrels into his lap without warning. ‘I want you,’ Stiles says, pressing sloppy kisses to his mouth. ‘I want you because I want you. I fucking <em>choose you,</em> Derek, oh my god. Also, holy shit, that was the most words I’ve heard you say <em>ever.’</em></p>\n<p>Derek laughs against his lips, the sudden evaporation of months of worry and heartache leaving him light-headed.</p>\n<p>‘When we tell this story to our friends and family…’ Stiles murmurs into his neck, alternating each word with a nip or a lick, ‘We’re going to leave out that part, and also the part where my own attempt at selflessness started with sweater-sniffing and ended with me accosting you in a club after like two tortured weeks. Let’s just stick with the version of this story where we continually try to out-noble each other until we couldn’t keep our hands off each other.’</p>\n<p>Derek hums happily, eyes rolling back a little as Stiles teeth scrape over his collarbones. ‘Deal.’</p>\n<p>He bites back a noise of protest when Stiles sits up. ‘Look, I want you, fuck, I want you. Like right now, in many different ways – in all the ways, actually. But, uh. I want to be sure that you’ll be okay even if I don’t convert to a soul-match believer overnight, even after I’ve re-contextualised our relationship and processed it all. I don’t want to hurt you any more than I already have.’ </p>\n<p>Derek puts his hands on either side of Stiles’ waist, holding him where he hovers, straddled over Derek’s thighs. ‘Stiles. I know you. Yes, I felt a connection to you from the first day, but I also <em>know</em> you. I’m not expecting you to change what you believe, but if you’re half as stubborn about loving me as you are about your soul-mate beliefs, then I feel pretty good about that.’ He pauses as Stiles’ face softens into a smile. ‘Now, I swear to god, if you don’t start taking my clothes off soon I’m going to go to my own room and get started without you because it has been a <em>really</em> long time...'</p>\n<p>Stiles narrows his eyes wickedly. ‘Well I am curious about your mark, I’ll admit. I think that in the name of research I really ought to get a closer look.’ He dips his thumbs under the waistband of Derek’s boxers and smooths them over the sensitive tendons of Derek's hips, making him gasp and arch up. ‘Remember,’ Stiles says, all mischief and kiss-bitten lips, ‘I’ve never been with a guy before. But lucky for you, I’m a quick study.’</p>\n<p>Derek is acutely aware of exactly how lucky he is. He loses himself to Stiles’ hands and mouth, as Stiles strips him down and winds him up, further and further. He whispers dirty-sweet things into his skin, tracing Derek’s mark with his tongue, and Derek’s bones dissolve into icy heat, made impossibly hotter in the knowledge that Stiles is paying attention to the mark solely to show Derek he’s loved, and it’s this that pushes him over the edge, much sooner than he'd like, fingers tangled in Stiles’ hair. Once he’s caught his breath he tugs Stiles up over him and wraps his hand around him, matching the rhythm Stiles’ hips find, and kisses his neck until he comes in Derek's arms, with a full-body shudder. </p>\n<p>Afterwards, they arrange themselves more comfortably on Stiles’ pillows and lie tangled up in each other, petting at whatever exposed skin they can reach. Stiles strokes his fingertips absently over Derek’s mark. The touch isn’t the electric charge that Derek has read about, but more a sense of deep contentment, a blissful rightness that washes over him with every brush of Stiles’ skin against his own. He wonders if Stiles feels anything similar, and if he does, what would he attribute it to, if not the soul mark. </p>\n<p>He moves his hand from where it’s slung over Stiles’ waist, reaching up until his palm is splayed over the skin where Stiles’ mark used to be. He’d only ever touched it with gloves on when he was tattooing it, and hasn’t ever touched it since. He thinks it feels hotter under his hand than normal skin, but he knows he might be willing that to be true. </p>\n<p>‘Mmm,’ Stiles murmurs, drowsily. ‘You’re warm.’ </p>\n<p>Derek smiles. </p>\n<p>‘Do you feel anything?’ Stiles blinks open eyes which are golden in the lamplight. ‘When you touch it?’</p>\n<p>Derek shrugs a little. ‘It feels right.’</p>\n<p>‘Even though it’s covered?’</p>\n<p>‘I put that on your skin, though. It still means something to me.’</p>\n<p>Stiles sits up a little on one elbow, and dips his head to kiss him. ‘Good. It means a lot to me, too, that you would honor my choice like that. Hey, what was it like when you first saw me? Fireworks? Choirs of angels? Cavalcades of gilded unicorns waltzing through the cold and lonely corridors of your heart?’</p>\n<p>Derek snorts and shoves his shoulder. ‘Ass. No.’</p>\n<p>‘Then what?’</p>\n<p>‘It wasn’t some big moment. It was… I thought you were beautiful, but it wasn’t like, some big love at first sight moment, it was… familiarity. Certainty. Like, oh, right, of course, it’s you. It’s always going to be you.’</p>\n<p>‘Oh.’ Stiles scrunches his nose thoughtfully. ‘That’s sort of exactly how I feel about you now.’ </p>\n<p>Derek’s chest aches with how happy he is, in this little bubble with Stiles. ‘You’re not moving in with Scott, then?’</p>\n<p>Stiles makes a face. ‘Oh my god, I was freaking out so bad that I’d have to move out. I fucking love… this loft, man.’ He laughs when Derek punches him, then turns serious. ‘Is this okay? To already be living together? Like, it feels right to me, but, maybe it’s too fast?’</p>\n<p>‘Feel right to me,’ Derek says, burrowing into a pillow that smells deliciously of Stiles, then he follows it up with a hopeful, ‘Kinda like when you touch my mark?’</p>\n<p>Stiles lies back down with a chuckle and moves his hand to resume its gentle caress over Derek’s mark. </p>\n<p>They fall asleep as the first smudgy tendrils of rose and gold appear over the horizon; the first sunrise of a new year. </p>\n<p>*</p>\n<p>In the end, they don’t end up telling any of their friends that they’re soul-matches. It’s Derek’s choice. He’s always been so private about it that it feels wrong to splash the news around now, but he does let Stiles tell anyone and everyone that they’re obnoxiously in love. Absolutely no-one is surprised. </p>\n<p>His mom gets choked up when he tells her over the phone, and immediately sends them matching love heart pajama pants. Derek loathes them passionately, but wears them all the time because goddamn it they’re <em>so comfy. </em></p>\n<p>The one person they do tell about their soul marks is the Sheriff, who is as happy as Stiles predicted at the news. What’s surprising, though, is how moved Stiles is by how happy is dad is for him. For the first time he and his dad sit together and talk about his mom, while Derek brings them beers and drops kisses onto Stiles’ head, and later, holds him as his tears soak the pillow. It’s a deeply complex situation, Derek knows. But somehow it feels like this one connection has given Stiles a foothold into something that has been insurmountable to him, and for Stiles, that’s a lot.</p>\n<p>Derek talks with Stiles about their soul-marks often. Sometimes it's bittersweet, like when Stiles finds Derek's dog-eared anthology of poetry with a bookmark in the poem he'd memorised and repeated to himself like a mantra, night after night. <em>To love is not to possess.</em> Stiles sets the book down with damp eyes and kisses Derek, slow and deep, like a promise. The discovery of the box of sketches under Derek's bed is much sweeter, leading to an hour of happy reminiscing about their not-so-very platonic roommate days. Derek looks at the beautiful curve of Stiles' jaw, and the pattern of moles that he now knows better than anyone else, and he decides not to tell him that he drew the moments so he'd always have the memory of them, even if Stiles left. Nothing good would come of Stiles knowing that.</p>\n<p>There are other stumbling blocks, of course. Where Derek sees evidence of the soul-match bond (like how Stiles came to him, and not Scott, after Lydia), Stiles sees a nameless serendipity that could affect those without soul-marks just as much. Derek attributes the deep bliss of shared physical intimacy to their bond, where Stiles insists he feels the same thing but it's down to being stupidly in love.</p>\n<p>Derek doesn’t always live up to his promise to be fine with Stiles not being a believer. Sometimes Stiles’ stubborn refusal to give much credence to their soul-bond stings, especially since his faith in it just grows evermore steadfast.</p>\n<p>In return, Stiles gets annoyed by Derek’s refusal to acknowledge the possibility that he could find love again should anything happen to Stiles. ‘I don’t want that burden, Derek,’ Stiles says irritably. ‘It isn’t healthy to be one person’s everything. You need to live with more hope than that.’ </p>\n<p>Sometimes they fight about it, but it happens less as they grow further into the trust and security that comes with time, and even if they do fight, they come back to each other, and remind each other with kisses that it doesn’t really matter if the mysterious force behind Derek’s heart is different to the mysterious force behind Stiles’ – or even if it’s all dumb luck. They always choose each other, in the end. </p>\n<p>*</p>\n<p>On their one year anniversary, Stiles brings Derek breakfast in bed, and on the tray is a small, flat box. Derek opens it to find a sketch of a wolf, done in the same style as Stiles’ fox. ‘I want you to tattoo this on my thigh,’ Stiles says, ‘exactly where your soul mark is. And see? I want its eyes to be just like yours.’</p>\n<p>Derek loves the gesture, and loves that Stiles wants to put a representation of Derek back into his skin. He loves the trust that Stiles has in him, loves making Stiles’ vision come to life and making it as fucking beautiful as he possibly can, to try to do Stiles justice. </p>\n<p>Truthfully, though, he loves the fox, too. He knows Stiles worries it’s a sore point for Derek, but actually, it’s not. </p>\n<p>He loves the fox that represents Stiles’ personality so well; his inquisitiveness, his intelligence, his mischief. He loves that the soul mark is still there, if only to his own practised eye. It’s there in the broad strokes and the lines of the fox’s form, an indelible skeleton forming the framework for Stiles’ own free will and choices. </p>\n<p>And Derek is one of those choices. </p>\n<p>He thinks about the ring box that he’d found tucked away, the last time they’d visited Beacon Hills, when he’d blearily mistaken Stiles’ bag for his own in the early hours of the morning. He thinks about the soft look his parents had shared across the breakfast table when Stiles had stumbled down and dropped into Derek’s lap instead of bothering to find a chair, and Derek had wrapped one hand around his waist and grabbed for the bacon with the other, putting it directly in front of Stiles and earning himself a sleepy kiss.</p>\n<p>He glances up from the needle to find Stiles watching him intently with astute, affectionate eyes. </p>\n<p>‘I was gonna get Satomi to do this as a surprise,’ Stiles says, ‘but when it came down to it, it feels right that you’re the only person to put any marks on my skin.’</p>\n<p>Derek rumbles approvingly, deep in his chest, which makes Stiles laugh.</p>\n<p>‘You wanna get dinner after? We could go to that diner with the wings you like.’ </p>\n<p>‘You asking me on a date?’ Stiles sparkles delightedly at him, making him flash hot all over. </p>\n<p>Derek ducks his head. It’s embarrassing how flustered Stiles can make him, even after all this time. </p>\n<p>‘Of course I’ll go on a date with you,’ Stiles says, low and warm. 'I actually have something I want to ask you.' </p>\n<p>Derek bites his lip to keep from grinning like an idiot. Stiles would never let him live it down, even though it’s Stiles’ fault because Stiles chooses him. </p>\n<p>Stiles chooses him, over and over.</p>\n<p>Yeah.</p>\n<p>Derek Hale is a lucky guy.</p>"
}