{
  "id": "11604675",
  "url": "https://archiveofourown.org/works/11604675?view_full_work=true",
  "author": [
    "TheResurrectionist"
  ],
  "title": "A Children's Story",
  "rating": "Not Rated",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Batman - All Media Types"
  ],
  "relationships": [],
  "characters": [
    "Bruce Wayne",
    "Dick Grayson",
    "Jason Todd",
    "Tim Drake",
    "Damian Wayne",
    "Alfred Pennyworth"
  ],
  "additional_tags": [
    "Bank Robbery",
    "Kidnapping",
    "Batfamily",
    "Crack Treated Seriously",
    "Guns",
    "Protective Bruce",
    "Batdad",
    "Hijinks & Shenanigans"
  ],
  "language": "English",
  "series": "",
  "published": "2017-07-25",
  "completed": "2017-07-28",
  "words": "5,802",
  "chapters": "3/3",
  "comments": "342",
  "kudos": "8,480",
  "bookmarks": "1,674",
  "hits": "54,761",
  "summary": "<p>Four batkids walk into a bank.</p>",
  "notes": "<p>Thanks for letting me yell at you about my batfamily feels. I hope you enjoy!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Thanks for sticking with me! Here's chapter two--and happy late birthday, Batwayneman!</p>\n<p>Thanks you for all the comments! Here's the last chapter! :)</p>\n<p>Leave me a comment, and let me know what you thought! :)</p>",
  "text": "<p>\"--it's not even <em>yours--</em>\"</p>\n<p>\"Who freaking cares, anyway?\"</p>\n<p>\"--going to <em>kill </em>you--\"</p>\n<p>Bruce ignored the squabbling in the backseat, forcing himself awake with another sip of coffee. He squinted at his phone, already regretting Alfred's carpool proposal.</p>\n<p>Jason, Tim, Damian, and Dick had all managed to squeeze into the back of the Rolls-Royce, dressed in their school uniforms. The floor was littered with backpacks and coffee travel mugs. The only person who looked pleased about this arrangement was Dick, who was seated next to Tim in the backseat.</p>\n<p>\"-regardless, <em>I </em>will be the one accompanying Father into the bank.\"</p>\n<p>In the front seat, Bruce rolled his eyes.</p>\n<p>\"Damian, you know I'm only dropping off a check, correct?\"</p>\n<p>The youngest Wayne crossed his arms, sinking back into the car seat. \"I'm well aware of that.\"</p>\n<p>\"It's going to take five minutes, tops.\"</p>\n<p>Dick poked him, reaching over Jason to do so. \"It's <em>really </em>boring, Dami.\"</p>\n<p>\"<em>Drake</em> is going.\"</p>\n<p>\"That's because Tim <em>works </em>for Bruce,\" Jason interjected, rolling his eyes. Behind him, Tim snorted, \"He kinda needs to know how to do that stuff.\"</p>\n<p>In the front seat, Bruce continued to ignore his children. He paged through a few stock options on his phone, pleased to see WE was selling well. Another sip of coffee almost made the premise of a 9:30 AM meeting bearable.</p>\n<p>\"I will be going,\" Damian declared, catching Bruce's eyes in the rearview mirror. \"It will be a good, pre-school educational experience.\"</p>\n<p>\"You're gonna be at school in twenty minutes,\" Jason muttered, looking out the window. He pulled at the collar of his Gotham Academy uniform, \"What's the rush.\"</p>\n<p>\"We'll <em>all</em> go,\" Dick said, elbowing Tim, who nearly spilled his coffee, \"How about that? Right Bruce?\"</p>\n<p>\n<em>Great.</em>\n</p>\n<p>\"Sure.\"</p>\n<p>\"Dear lord,\" Alfred muttered from the driver's seat, sending Bruce a quick glance. \"It's not even nine yet.\"</p>\n<p>Bruce squinted as they pulled up in front of Gotham National, shielding his eyes from the sun. \"They need off buttons, you're right.\"</p>\n<p>\"I <em>heard </em>that!\"</p>\n<p>He grabbed his briefcase, opening the car door. Dick filed out of the backseat, followed by Jason, while Damian and Tim exited through opposite doors. Alfred raised an eyebrow.</p>\n<p>\"I'll be waiting,\" the butler told Bruce, \"<em>Ta</em>.\"</p>\n<p>The Rolls-Royce disappeared around the corner, leaving them on the sidewalk.</p>\n<p>Gotham National was bleak, defiantly grim, even in Gotham's best sunshine. This early, there was little foot traffic on the street. Bruce waved at his children, debating just leaving them outside and making a mad dash for the teller.</p>\n<p>\"Come on. Let's go.\"</p>\n<p>He pushed open the door, keeping his face down instinctively. With all four children dressed in their Gotham Academy uniforms, it looked like he was leading a tour. Dick helped shepherd everyone over to one wall, Jason trailing behind him.</p>\n<p>In retrospect, insisting to Lucius on delivering the check himself had backfired spectacularly. A transaction that would have taken two minutes would now take ten, even fifteen minutes more. He resisted the urge to sigh, glancing at his watch.</p>\n<p>\n<em>Still have time until the meeting.</em>\n</p>\n<p>\"What is it you do first?\" Damian asked, tugging on his sleeve, \"May I assist you, Father?\"</p>\n<p>\"Go over to that first counter,\" he said, pointing, \"I need a deposit slip. It's the blue one. Tim can help you.\"</p>\n<p>\"I can find it on my own,\" Damian sneered, stalking off to the counter, \"I don't require assistance.\"</p>\n<p>Tim rolled his eyes, tapping at his tablet. He seemed more than content to let his brother handle everything. \"Uh huh.\"</p>\n<p>The bank was fairly quiet for a Friday morning. Sound tended to echo off the marble walls, amplifying the smallest noise to deafening levels. Across the expansive room, a woman's heels clicked. Bruce winced, turning back towards the entrance.</p>\n<p>\n<em>Left my coffee in the car. God damn it.</em>\n</p>\n<p>Over Dick's shoulder, he watched as another woman entered the bank, followed by a man. Two children trailed after her, staring up at the chandelier. One pointed at the ceiling, babbling.</p>\n<p>Another man entered through the double doors, a black duffel bag tucked against his side. He glanced at the counter, averting his eyes to the floor.</p>\n<p>Bruce frowned, watching as the man stepped over to one of the counters. His suit was new, most likely off the department store discount rack; he could still see the outline of the stickers on the pants leg.</p>\n<p><em>Interesting</em>.</p>\n<p>Another man entered through the side door, a large briefcase under his arm. Judging by the creases at the seams, it was empty. That in itself was far from unusual--the man could simply be coming to retrieve deposits. Still.</p>\n<p>\n<em>You're tired. You're seeing things. Maybe pulling an all-nighter wasn't in your best interest, yet again.</em>\n</p>\n<p>He snorted, imagining Alfred's lecture on <em>that </em>specific topic in bright technicolor.</p>\n<p>The two men began filling out withdrawal slips. They were both watching the doors as they did so. He turned back to his children, something itching at the back of his brain.</p>\n<p>Tim and Damian were arguing over two deposit slips by the first counter, not even pretending to be quiet. Jason was ignoring them both, scrolling through his cellphone by one of the pillars.</p>\n<p><em>They're safe, </em>a voice said in the back of his head, <em>out of the line of fire. No one would go for the kids first. Not right away.</em></p>\n<p>Dick was watching the entrance, as if he'd sensed Bruce's disjointed thoughts. The teen was slouched casually next to Jason. His legs were rigid under his uniform, ready to move at a moment's notice.</p>\n<p>Bruce found himself tensing despite himself. Something was wrong.</p>\n<p>Outside the bank, the shadow of two rifles flickered across the glass. A pair of men ducked into the entryway, duffel bags slung over their shoulders. Black ski masks covered their faces. They moved silently, their shadows the only indication of their presence.</p>\n<p>In a split second, his gaze caught Dick's. A moment of understanding passed between them as the robbers pushed through the front doors, wordless and urgent.</p>\n<p>\n<em>Now. Move. Now. NOW.</em>\n</p>\n<p>Bruce dove for Damian and Tim, adrenaline surging through him. He dragged them under the table by their collars, throwing his briefcase to the side. A few feet away, Dick did the same to Jason, shoving him towards Bruce.</p>\n<p>He pushed their heads down just as the gunfire started, shielding them as best he could against the table. Dick placed his hands over Damian's ears, ducking under Bruce's arm.</p>\n<p>\"EVERYBODY ON THE GROUND! GET YOUR ASSES ON THE GROUND!\"</p>\n<p>A second burst of gunfire nearly deafened him. He pushed Dick even further under the table, ignoring Tim's cry of pain. The idea of a stray bullet or fragment hitting one of them superseded any bruises.</p>\n<p>Damian stuck his head past Bruce's shoulder, trying to look at the robbers. He shoved his son down none-too-gently, holding him down as the gunfire continued.</p>\n<p>\"DOWN! ON THE GROUND! <em>NOW!</em>\"</p>\n<p>Bruce peeked around the corner of the table. The two men from earlier were also wearing masks, joining the robbers at the teller's counter. They both had handguns pointed at the woman, their bags on the floor.</p>\n<p>\"Everything in the safe,\" the man with the briefcase said, shoving the gun into her face, \"I want it <em>now</em>.\"</p>\n<p>Across the room, one of the robbers pointed his rifle at the woman with the children. She let out a gasp, cowering against the desk. The boy and girl were wide-eyed in her arms.</p>\n<p>\"<em>P-please,\" </em>she sobbed, pulling them to her chest, \"Don't shoot us. Don't hurt us, <em>please-</em>\"</p>\n<p>\"Shut her <em>up</em>!\" the man with the briefcase yelled, turning from the teller. \"<em>Now</em>!\"</p>\n<p>The man took the rifle, cracking her across the forehead. The bank went silent as she crumpled to the floor. Blood ran down her temple, gushing slowly towards the marble.</p>\n<p>Damian squirmed under his hand, trying to get to his feet. His eyes flashed, promising bloodshed.</p>\n<p>Bruce pushed him down, tugging him to his chest in the same way the woman had.</p>\n<p>\"Don't,\" he muttered in his son's ear, \"Don't you dare. You can't help her.\"</p>\n<p>\"I <em>can-</em>\"</p>\n<p>Bruce covered his mouth with a hand, bracing one arm over the boy's chest. Damian stared up at him, a look of betrayal in his eyes.</p>\n<p>\"-on a time delay,\" the teller was saying, her voice echoing in the sudden silence, \"I can't open it until ten, at the earliest.\"</p>\n<p>\"Bullshit,\" the first man said, pressing the gun to her forehead. \"You're <em>lying </em>to me.\"</p>\n<p>The woman narrowed her eyes, displaying true Gotham grit.</p>\n<p>\"Why the <em>hell </em>would I do that?\"</p>\n<p>\"Don't you dare go for that panic button,\" the robber dug the gun into her forehead, enraged, \"Do you want me to blow your brains out?\"</p>\n<p>Bruce counted hostages under his breath, beginning to put together a plan. The panic button--if she'd managed to push it--would do no good. Gotham PD would take their sweet time getting to a bank robbery, if they managed to show at all.</p>\n<p>There were multiple hostages, but the robbers didn't seem to be intent on killing them needlessly. No. They wanted money and an exit. Quick and dirty.</p>\n<p>\n<em>They hadn't planned on there being a time delay on the safe. How could they?</em>\n</p>\n<p>Damian bit his hand. Bruce narrowed his eyes, daring him to try that again.</p>\n<p>\"I can't open the safe,\" the teller gasped, \"Not until ten. I swear. It won't open.\"</p>\n<p>The other robbers had surrounded the room, watching the hostages carefully. They seemed to be waiting on the ringleader, their guns pointed at the ground.</p>\n<p>A flash of light by his feet dragged his attention away. Tim's face poked out from under Damian's knee, his tablet glowing in the enclosed space. Bruce bit off a curse, realizing his hands were still occupied.</p>\n<p>\"<em>Tim--</em>\"</p>\n<p>\"I'm hacking the power system,\" the teen whispered, fingers tapping at the screen, \"We can pull the lights--\"</p>\n<p>\"Put it <em>down</em>.\"</p>\n<p>\"But I--\"</p>\n<p>\"<em>Now</em>.\"</p>\n<p>A few feet away, Dick sent him a quick hand signal. One of the robbers was walking towards them, his rifle held in a loose grip.</p>\n<p><em>Stay down, </em>Bruce mouthed back, <em>don't engage. No movement.</em></p>\n<p>Dick nodded. Bruce dropped his hand from Damian's mouth, signing for him to remain quiet. The pre-teen narrowed his eyes, but didn't make a sound. Jason reached over, carefully turning off the sound on Tim's tablet.</p>\n<p>The robber passed them, his footsteps echoing. Bruce kept his face down, knowing it was the most recognizable. The man left without incident, shuffling on to the next hostage.</p>\n<p>Glancing at his watch was a mistake. They had more than an hour until the safe could open, which meant two things: One, the boys would be late to school. And two--there was no way in hell he was making this board meeting.</p>\n<p>\n<em>Great.</em>\n</p>\n<p>\"Sir, we've got a silent alarm out of Gotham National.\"</p>\n<p>Jim Gordon grunted, turning the newspaper to the sport's section. Beside his hand, his coffee was close to boiling--almost cool enough to drink, if he was trying to wake up. \"...again?\"</p>\n<p>\"Ten minutes ago. Another robbery.\"</p>\n<p>The detail didn't faze him. He turned back to the weather, squinting at the pollen alert for the northern suburb. \"Third one this month, isn't it?\"</p>\n<p>\"Fourth, actually,\" the sergeant muttered, shrugging. He looked over his shoulder at the precinct, \"They've got hostages this time. Might make things interesting.\"</p>\n<p><em>Hostages. Great. Exactly what I needed. </em>Jim sighed, pushing back from the desk. He stood, grabbing his blistering cup of coffee.</p>\n<p>\"It would, wouldn't it.\"</p>\n<p>\"I believe so, sir.\"</p>\n<p>Jim squinted at him, taking a sip from his coffee. He embraced the burning sensation, willing himself awake as his tastebuds died a merciful death.</p>\n<p>\"That was a rhetorical question, sergeant.\"</p>\n<p>\"You keep your heads down. At no point do you engage. They'll be out of here in half an hour. They'll have their money. Nobody gets hurt. Understand?\"</p>\n<p>Damian opened his mouth as soon as Bruce's whisper cut off, ready to argue. Dick covered his mouth before he could draw attention.</p>\n<p>\"I can hack the lights, though,\" Tim whispered, sending him a disappointed look. \"They'll freak and ditch.\"</p>\n<p>\"No, they'll think the FBI is here and start shooting everyone,\" Jason interjected, sending a furtive glance at the robbers, \"Those are AR-15s. They wanted to kill us, it would take three seconds.\"</p>\n<p>The premise chilled Bruce. He locked eyes with Dick, who nodded slowly.</p>\n<p>\"We wait it out,\" the billionaire whispered, spreading his hands, \"If things go south...I'll handle it.\"</p>\n<p>Four concerned faces stared back at him. He ignored them, turning back to the robbers. Between the counter's legs, he could just barely make out the ringleader's face. The other three robbers were patrolling the room, restless.</p>\n<p>The woman's body was still in the center of the floor. Her breathing was short and erratic. Blood pumped sluggishly from her temple, staining the marble bright red.</p>\n<p><em>The longer she's out, the higher the chance of brain damage, </em>he thought distantly, <em>she needs a doctor.</em></p>\n<p>Off to the side, her two children were curled against one of the counters. Their faces were streaked with tears, red and puffy.</p>\n<p>\"Mama…\" the boy was sobbing, growing louder. He reached out to the woman, \"<em>Mama…\"</em></p>\n<p>Bruce flinched. He ducked behind the counter again, only to find Dick several feet closer. And Damian…</p>\n<p>\"He tried to make a break for it,\" the teen whispered, shifting his hips to reveal Damian pinned beneath one of his legs, \"So I'm sitting on him until he realizes why that's a terrible life choice.\"</p>\n<p>Jason rolled his eyes. Beside him, Tim was tapping at his tablet, aiming it at their captors.</p>\n<p>\"How much time is left?\" the ringleader demanded, slamming his hand on the teller's desk. \"When does the safe open?\"</p>\n<p>\"Sir, I can't open it until ten. I told you.\"</p>\n<p>\"Well, what time is it?\"</p>\n<p>\"Nine twenty, sir,\" the teller replied, striking the perfect balance between frightened and woefully unsympathetic, \"You have forty minutes left.\"</p>\n<p>The ringleader's hand swung out, whipping her head backwards with a <em>crack. </em>Across the floor, the girl screamed, clinging to her brother.</p>\n<p>\"Would someone <em>shut </em>those brats <em>up</em>?\" the ringleader screamed, turning around. He waved his gun at the other robbers. \"<em>Now!</em>\"</p>\n<p>Two of the robbers advanced on the children, guns in hand. Bruce closed his eyes, weighing his options as the girl's terrified sobbing grew louder.</p>\n<p><em>They're just kids. They're just fucking </em>kids<em>.</em></p>\n<p>\"Stay <em>put</em>,\" he growled, pushing himself to his feet. He sent one last glare to his children. \"<em>Do not </em>move.\"</p>\n<p>It didn't take long for someone to notice him.</p>\n<p>\"Hey,\" one of the robbers swung his gun around, aiming at his chest. \"What the hell are you doing? Sit down!\"</p>\n<p>The second robber continued towards the children, his finger twitching on the trigger guard.</p>\n<p>\"Hey asshat,\" Bruce said loudly, ignoring the first man, \"Over here!\"</p>\n<p>The other robber turned, irritated. He pointed his gun at Bruce, momentarily distracted from the children. </p>\n<p>\"Who the hell are you?\"</p>\n<p>\"Me?\" the billionaire asked, aghast, \"I'm <em>Bruce Wayne</em>.\"</p>\n<p>\"We've got the perimeter secured, sir. Waiting on orders to move in.\"</p>\n<p>Jim pushed past the yellow crime scene tape, one hand firmly grasping his travel mug. He peered across the street at the bank's entrance.</p>\n<p>\"Any idea who's holding it up?\"</p>\n<p>\"Actually, sir,\" the sergeant, \"We've received an anonymous tip. Photos from someone inside.\"</p>\n<p>An IPad was placed in his free hand. A blurry photo of the bank's interior was on the screen. He paged through the pictures, counting hostages and robbers.</p>\n<p>\"Four perps, and an unknown number of hostages,\" Jim summarized, shoving the IPad back at the sergeant, \"What the hell are they waiting for?\"</p>\n<p>\"Source says they're waiting on the time delay safe,\" the sergeant said, fumbling with the tablet, \"They're beating on hostages while they stew.\"</p>\n<p>\"Great,\" Jim sighed, taking a long sip from his mug. He swallowed with a grunt, wishing for a cigarette, \"The Mayor's gonna have a field day over this.\"</p>\n<p>The sergeant blinked. \"She usually does, sir.\"</p>\n<p>\"Once again, sergeant, that was rhetorical.\"</p>\n<p>\"We're gonna get good money for him. <em>Way </em>more money. Probably more than we were gonna carry out of here, anyway.\"</p>\n<p>\"He's worth at least 50 mil,\" one of the robbers said, glancing at Bruce, \"You know these rich people. They'll pay anything for him back.\"</p>\n<p>The billionaire stretched a little in his seat, pulling experimentally at the zip ties around his ankles and wrists. Only his wrists were actually securely fastened; he gave it about twenty seconds, tops, to break free.</p>\n<p>\"We do both,\" the ringleader murmured, putting out a calming hand. Odd, considering his earlier outbursts, but Bruce wasn't in a position to judge. \"We get the safe open, and then we take him with us.\"</p>\n<p>\"We can't <em>take </em>him,\" one of the robbers said, \"He's seen our faces!\"</p>\n<p>\"Yeah, and who's dumb idea was it to go into the bank first without masks, huh?\"</p>\n<p>Across the room, his children were suspiciously quiet. Beneath the counter, he could spot Tim's left foot, and…Jason's leg?</p>\n<p>Damian's head popped up by the deposit slips. Bruce's heart nearly stopped as he edged around the counter, silent.</p>\n<p>\"Look, I'm just saying, we'd get a lot more money,\" the first robber said, \"We don't even need to take him with us. We can negotiate with the police, or something.\"</p>\n<p><em>SIT DOWN </em>he mouthed at Damian. NOW. </p>\n<p>The pre-teen crept over to the two children, ignoring him. He ducked down, pulling them behind the counter.</p>\n<p>Bruce watched in amazement as the robbers continued to confer, oblivious to what was happening in the rest of the bank. Even the ringleader was preoccupied, his gun held loosely at his side. The AR-15's were abandoned by the front counter, propped up against the desk.</p>\n<p>With the boy and girl safe behind the counter, Damian tip toed back to his brothers. He perched just behind the table's edge, his hand going to his ankle.</p>\n<p>Bruce watched in disbelief as the boy pulled something silver from his sock, unsheathing a knife longer than his forearm.</p>\n<p>\"<em>No</em>,\" he said without thinking, his voice carrying, \"<em>Absolutely</em> not.\"</p>\n<p>The robbers turned towards him, their conversation breaking off.</p>\n<p>\"Did he just say something?\"</p>\n<p>Across the room, Damian ducked back behind the counter, sending him a vicious glare.</p>\n<p>\"You got a problem with something?\" the ringleader asked, stalking over to him. He pointed his gun at Bruce, \"Huh, big mouth?\"</p>\n<p>\"No, I…\" Bruce bit down on a sigh. The safety was still on, which was just...somehow, very disappointing. \"It's just. The, uh, money you're talking about.\"</p>\n<p>\"Yeah?\"</p>\n<p>\"I have kidnapping insurance,\" he explained, shrugging, \"It has a mandatory cap at 5% future revenue and earning capacity. It's also contingent on a lot of legal stuff.\"</p>\n<p>\"Jeez,\" one robber muttered.</p>\n<p>\"Yeah. Real pain in the ass,\" Bruce said, praying they wouldn't turn around, \"Lots of state statutes and stuff. You don't wanna mess with those. That's how they got Al Capone.\"</p>\n<p>\"Right, right,\" the other robber muttered, \"That was taxes and shit, right?\"</p>\n<p>\"Yeah.\"</p>\n<p>\"Damn shame.\"</p>\n<p>Above him, the chandelier flickered. A quick surge, and then it went out completely. The bank was thrown into darkness.</p>\n<p><em>Tim, I'm going to break that damn tablet over my knee, </em>Bruce thought, putting on a sunny smile for his captors.</p>\n<p>\"Why don't I call my lawyers?\"</p>\n<p>\"How much time do we have left?\"</p>\n<p>Tim lowered the brightness on his tablet, tapping at the screen. \"Ah...twenty minutes, about.\"</p>\n<p>\"I will lead an attack,\" Damian whispered, holding up his sword, \"Drake, you will stay here. Grayson, you and Todd will come with me--\"</p>\n<p>\"<em>Hell </em>no,\" Tim interrupted, \"You'll blow the whole mission.\"</p>\n<p>\"First of all,\" Dick said, putting a hand in between them, \"This isn't a <em>mission</em>. This is a hostage situation.\"</p>\n<p>\"Bruce is keeping them talking,\" Jason added, peeking around the corner, \"We just have to make sure they don't shoot anyone until the safe opens.\"</p>\n<p>Damian didn't look thrilled.</p>\n<p>\"I don't get to stab anyone.\"</p>\n<p>\"No,\" Dick said, \"You don't. Sorry.\"</p>\n<p>\"Did we just shut off the lights? I thought Hostage Rescue wasn't going to get here for another hour?\"</p>\n<p>The sergeant frowned, grabbing a pair of binoculars. He handed them to Jim.</p>\n<p>\"We didn't cut power. Must have been someone else.\"</p>\n<p>\n<em>Must have been--</em>\n</p>\n<p>\"Well who the hell did it, if it wasn't us?\"</p>\n<p>\"I don't know, sir.\"</p>\n<p>\"I don't like this,\" one of the robbers muttered, glancing at the ceiling. \"I don't fucking like this. We shoulda been out of here half an hour ago.\"</p>\n<p>Bruce agreed silently, thinking mournfully about his meeting.</p>\n<p>\"They cut the lights, like in the movies,\" the other robber said, wide-eyed. \"The negotiator is gonna call us soon. We gotta come up with demands.\"</p>\n<p>\"We don't <em>have </em>any demands,\" the ringleader snapped, \"We're grabbing the cash and getting out of here.\"</p>\n<p>\"And prettyboy?\"</p>\n<p>The man turned to Bruce, considering. \"We'll take him with us.\"</p>\n<p>\"I say we take one of the kids too, in case he don't pan out.\"</p>\n<p>The attention quickly shifted towards the two children in the back. Bruce swore under his breath, halfway through putting together a distraction.</p>\n<p>\"You don't want to--\"</p>\n<p>\"I'll go.\"</p>\n<p>It was almost comical how quickly the robbers' heads turned. Damian was standing in the center of the bank floor, his hands on his hips.</p>\n<p>\"I volunteer as a hostage.\"</p>\n<p>The ringleader turned back to Bruce, a frown on his face.</p>\n<p>\"How do you feel about that, Wayne?\"</p>\n<p>\"Take him,\" Bruce muttered, sending Damian a death glare. <em>You got yourself into this. </em>\"Really. Please. Take him.\"</p>\n<p>\"What did you just say?\"</p>\n<p>\"I said, don't take him,\" Bruce said loudly, twisting his face up, \"Please. Don't take him. I don't need a kid to behave, sir.\"</p>\n<p>The second the robbers turned around, he sent Damian the darkest glare he could muster.</p>\n<p>\n<em>See if I ever take you out for ice cream again after patrol again.</em>\n</p>\n<p>\"<em>Fuck,</em>\" Jason said, \"There goes Damian, I guess.\"</p>\n<p>\"What the hell is he doing?\" Tim whispered, \"He's ruining <em>everything</em>.\"</p>\n<p>\"Beats me.\"</p>\n<p>\"Who the hell are you?\"</p>\n<p>\"Damian Wayne,\" Damian said, crossing his arms. He glared at the ringleader. \"Your men have terrible recollection. I've seen more terrifying criminals at the playground.\"</p>\n<p>\"Shut the fuck up,\" the man stepped towards him, nostrils flaring, \"You shut the <em>fuck </em>up!\"</p>\n<p>Bruce felt his heart jump as the ringleader waved the gun at Damian, cursing his son's brazenness. He had one hand out of the zip-ties in less than five seconds, quickly working on the other wrist.</p>\n<p>\n<em>Damian, stop talking. Please.</em>\n</p>\n<p>\"Point your gun elsewhere,\" Damian said, staring down the barrel of the gun, unflinching. \"I'm not intimidated.\"</p>\n<p>The ringleader scoffed, furious. \"I'll shoot you, even if your daddy has insurance.\"</p>\n<p>\"Go ahead.\"</p>\n<p>The man fumbled with his gun, struggling to click off the safety. He nearly dropped it, grabbing it and swinging it back towards Bruce. \"I won't--\"</p>\n<p>There was a deafening <em>bang. </em>Bruce grunted as something hit his shoulder, tearing through the muscle. It took him a few seconds to realize what had happened.</p>\n<p>\"<em>Fuck</em>.\"</p>\n<p>The ringleader went pale.</p>\n<p>He pressed a hand to his shoulder, wincing as his fingers hit blood. Across the room, Damian was wide-eyed, staring at him in shock.</p>\n<p>\"You shot him,\" his son said, turning to the ringleader, \"You <em>shot</em> him.\"</p>\n<p>\"I couldn't-\"</p>\n<p>\"How incompetent are you?\"</p>\n<p>The ringleader backed up as Damian advanced, looking terrified. \"I didn't <em>mean </em>to!\"</p>\n<p>\"Damian,\" Bruce said, pressing a hand to his shoulder. That was a <em>lot </em>of blood, now that he thought about it. \"Damian, I--Stop.\"</p>\n<p>He tried to stand, remembering only at the last second that his feet were tied. The blood loss hit him instantly. He tipped forwards, slamming his head against the marble, and knew no more.</p>\n<p>\"That was gunfire, sir.\"</p>\n<p>Jim tightened his grip on the walkie talkie, his stomach dropping. The bank had fallen silent, by all appearances, calm.</p>\n<p>\"Snipers catch anything?\"</p>\n<p>\"I'm getting reports of a single gunman,\" the sergeant said, reading off his tablet, \"Possibly a pistol. They didn't see much.\"</p>\n<p><em>Either they're taking out hostages one by one, or someone finally pissed them off. </em>\"Have they made any demands?\"</p>\n<p>\"Hostage rescue hasn't arrived yet.\"</p>\n<p>Jim snorted. \"What's their wait time for a Gotham crime scene again?\"</p>\n<p>\"Last time I checked, around two hours, sir.\"</p>\n<p>\"Hmph,\" the older man leaned forward, gesturing for the binoculars. \"Sounds a little low.\"</p>\n<p>\"<em>Fuck</em>,\" Jason whispered, his eyes locked onto Bruce, unconscious across the floor. \"Holy shit. What the <em>fuck</em>.\"</p>\n<p>Across the room, the ringleader was a quivering mess on the floor. Damian had abandoned his bloodfury, rushing back to Bruce's side. The other robbers were still frozen, shocked silent.</p>\n<p>\"We need to do something,\" Tim said, his tablet forgotten in his hands. His face was drained of all color, his earlier enthusiasm gone. \"He's going to bleed out.\"</p>\n<p>\"No, fuck that,\" Jason said, stumbling to his feet. \"We're done with this bullshit. I don't care what the hell Bruce said. They're going <em>down</em>.\"</p>\n<p>Dick grabbed him by the shoulder, shoving him back down to the ground.</p>\n<p>\"Believe me,\" he growled, \"I'd like nothing more than to bash their faces in. But we can't break cover.\"</p>\n<p>\"Can't break cover?\" Tim asked, \"Damian's about to skin that guy with his <em>sword</em>. How's that for breaking cover?\"</p>\n<p>\"I thought I took that away from him last week,\" Dick squinted at the youngest Wayne, looking vaguely disappointed. \"He won't leave Bruce, not when he's injured. We need to do whatever we're going to do before he decides that doesn't matter.\"</p>\n<p>The robbers had massed around their leader, pulling him to his feet. Damian was bent over Bruce, blood staining his fingers. He put pressure on the wound with folded hands, watching the robbers with a murderous expression.</p>\n<p>\"I have a plan,\" Tim said, voice tense, \"It won't blow our covers.\"</p>\n<p>\"Okay.\"</p>\n<p>\"I might need to hack into JP Morgan.\"</p>\n<p>He was met with silence. Jason shrugged, looking at Dick.</p>\n<p>\"Well, I always said we should commit more felonies,\" he smirked, \"You know, to even out all the misdemeanors.\"</p>\n<p>\"<em>Jason.</em>\"</p>\n<p>Bruce woke with the taste of blood in his mouth. Something shifted near his feet, pressing down on his chest. He bit off a groan at the pain, opening his eyes.</p>\n<p>Damian's worried face stared down at him. There was a smudge of blood on his chin. Bruce prayed it wasn't someone else's.</p>\n<p>\"Can't breathe,\" he reminded his son, who relented, leaning back.</p>\n<p>\"You need to keep pressure on the wound,\" Damian growled, shoving his good hand onto the makeshift compress across his shoulder. \"Press down. I'll be right back.\"</p>\n<p>Bruce grabbed his wrist, tugging him backwards. A few feet away, the ringleader was wide-eyed, watching them in outright terror. \"Ah ah. <em>Nope</em>.\"</p>\n<p>\"Let me go,\" Damian's eyes flashed. He didn't seem have the heart to break Bruce's hold. \"I need to remove this man's testicles.\"</p>\n<p>\"Okay, first of all, <em>no,</em>\" Bruce said, tightening his grip. The room spun briefly. \"Bad. Bad idea. No removing testicles.\"</p>\n<p>\"<em>Father--</em>\"</p>\n<p>\"And second of all, when we get home, we're having a discussion about bringing weapons to school. A <em>long </em>discussion.\" Bruce narrowed his eyes, hoping his point was being conveyed. He looked past the pre-teen, focusing on the ringleader. \"And <em>you</em>.\"</p>\n<p>The man went pale.</p>\n<p>\"I have a photoshoot in Bali next week,\" Bruce said, genuinely irritated. \"What the hell were you thinking?\"</p>\n<p>\"Lie back,\" Damian said, pushing him backwards, \"You're bleeding.\"</p>\n<p>\n<em>And whose fault is that again?</em>\n</p>\n<p>Suddenly, he was on his back again, staring at the ceiling. Damian was staring at him, visibly concerned.</p>\n<p>\"You've lost an alarming amount of blood.\"</p>\n<p>Bruce blinked. \"Put the sword down.\"</p>\n<p>\"I'm not touching the sword.\"</p>\n<p>\"I can <em>see </em>your hand, Damian.\"</p>\n<p>\"I'm <em>not </em>touching the sword.\"</p>\n<p>\"<em>Damian.</em>\"</p>\n<p>Sneaking out from under the counter was far easier than Dick would have guessed. The robbers were still standing over Bruce and Damian, discussing loudly. Crawling past them was almost comically easy.</p>\n<p>\"I say we still take them with us.\"</p>\n<p>\"Hey asshole, he's <em>bleeding. </em>We won't have a chip to bargain with if we shove him in the van and he croaks.\"</p>\n<p>Jason signalled at the west corner, ducking behind a pillar. Tim was a few feet behind him, tablet in hand.</p>\n<p>\"He's not worth anything dead,\" the ringleader was saying, keeping a careful distance from Damian. He pointed. \"But <em>he </em>might be worth something.\"</p>\n<p>Dick facepalmed.</p>\n<p>\"Touch me and die,\" Damian said, still crouched over Bruce. \"Understood?\"</p>\n<p>Jason had edged towards the abandoned AR-15's, creeping along the base of the teller's desk. He moved silently, only half-hidden from the robbers.</p>\n<p>\"Shut up, kid,\" the ringleader said, managing to salvage some of his shaky bravado, \"Or I'll shoot you next.\"</p>\n<p>\"You call that <em>shooting</em>?\"</p>\n<p>Dick watched as Jason took one of the AR-15's, stripping it down in a series of complicated moves. He pulled out the firing pin, then replaced the pieces. He did the same to the other two guns, setting them back against the desk.</p>\n<p>Across the small hallway, Tim was hunched in front of the safe. Jason crept back, joining him at the access panel.</p>\n<p>\"What now?\" Dick asked.</p>\n<p>\"I just bugged the time delay function,\" Tim whispered, frowning at the screen. \"It won't open at ten. The alarms will go off instead.\"</p>\n<p>\"We've got less than five minutes,\" Jason said, glancing at the clock. \"Let's hope this plan of yours works.\"</p>\n<p>The clock's chime interrupted the robbers' intense discussion. Their heads swivelled towards the teller, who was still seated at the desk.</p>\n<p>\"Is it ten o'clock?\"</p>\n<p>Her face said <em>I don't know, doofus, can you read a clock?</em></p>\n<p>\"Yeah.\"</p>\n<p>\"Great,\" the ringleader said, gesturing, \"Get the bags over. Let's get the hell out of here.\"</p>\n<p>Bruce forcibly restrained Damian yet again as the ringleader passed them, shuffling over to the safe. He winced at the pull in his shoulder, wishing this would wrap up soon. <em>Painkillers, yes. A wonderful invention.</em></p>\n<p>The robbers walked the teller to the safe at gunpoint. She began punching in a lengthy code, hunched over the keypad.</p>\n<p>The room lit up suddenly, blinding its occupants. An alarm blared as emergency lights began to flash. The teller dropped her hand, stumbling backwards with a squeak.</p>\n<p>\"THIS IS GOTHAM SWAT,\" a familiar shouted down the hallway, obscured by the wall. \"EVERYBODY DOWN ON THE GROUND.\"</p>\n<p><em>Dick, </em>Bruce thought, shaking his head. <em>So much for staying down and not doing anything.</em></p>\n<p>The robbers ran for their guns, shouting. There was a sudden wave of swearing and clicking, then the sound of scattered footsteps.</p>\n<p>\"Cover me!\" the ringleader said, pointing his handgun down the hallway. \"...Guys?\"</p>\n<p>Bruce bit down on a laugh as the man finally noticed the empty bank behind him. The robbers had scattered, abandoning their leader at the first sign of real trouble.</p>\n<p>\"<em>Fuck</em>!\" the ringleader screamed, glancing at the empty bags, then to the door. \"<em>FUCK!</em>\"</p>\n<p>With one last look at the safe, he turned and ran for the entrance. Just as he pulled open the door, an umbrella smacked him across the temple, knocking him backwards.</p>\n<p>Alfred crossed his arms, watching the ringleader's body hit the floor with a twist of his lips. He looked over to Bruce.</p>\n<p>\"You were taking quite a while,\" the butler nodded at the unconscious ringleader, \"Is he a friend of yours?\"</p>\n<p>\"GOTHAM PD!\"</p>\n<p>Bruce winced, sitting up as Jim Gordon and a sergeant he didn't know barreled through the doors, guns drawn. They stopped short of the ringleader, scanning the room.</p>\n<p>\"...is everyone alright?\" Gordon asked, his eyes drifting to Bruce. \"Mr. Wayne. Do you need an ambulance?\"</p>\n<p>\"Coffee,\" Bruce muttered, lying back down. \"I need <em>coffee</em>.\"</p>\n<p>\"Yes, he needs an ambulance,\" Dick said loudly, entering from their right. Behind him were Tim and Jason, thankfully whole. \"There's also a woman with a head injury over here, if you'll follow me.\"</p>\n<p>The sergeant hurried after the teen, leaving Gordon by the doors, dumbfounded.</p>\n<p>\"I will give you a million dollars for a cup of coffee,\" Bruce said, closing his eyes. He rested his head against the floor, ignoring the spinning sensation. \"Please.\"</p>\n<p>\"I don't think you should be drinking anything, Mr. Wayne,\" Gordon said, the sound of sirens in the distance. \"Maybe you should wait until you get to the hospital.\"</p>\n<p>\"Five million dollars.\"</p>\n<p>\"It's illegal to bribe a public official.\"</p>\n<p>Damian frowned, still glued to Bruce's side. \"Why didn't you say that the first time?\"</p>\n<p>\"Don't be rude to the Lieutenant.\"</p>\n<p>Gordon sent him a strange look, then walked away to question one of the hostages. Bruce let out a breath, dropping the smile.</p>\n<p>\"You're all grounded,\" he told his children, ignoring Damian's protest. He put up a hand. \"Except for Dick, I know you didn't do anything stupid.\"</p>\n<p>\"<em>Hey</em>.\"</p>\n<p>\"Hey!\"</p>\n<p>\"The plan was smart,\" Bruce admitted, almost as an afterthought, \"Good execution, good teamwork. Nobody died…\"</p>\n<p>Jason coughed. \"...right.\"</p>\n<p>\"There were <em>minor </em>casualties,\" Bruce said, staring pointedly at Damian, who blinked. \"Including your freedom for the next two months.\"</p>\n<p>\"<em>Father--</em>\"</p>\n<p>\"You took a sword to <em>school, </em>Damian!\"</p>\n<p>\"I wasn't on school property--\"</p>\n<p>\"<em>Yet.</em>\"</p>\n<p>Gordon wandered back, a pad of notes in hand.</p>\n<p>\"Ten million dollars,\" Bruce offered, spotting the EMTs arriving outside of the bank. \"Come on, Jim.\"</p>\n<p>Dick elbowed Jason, who was examining the firing pins from the AR-15's. He slipped them into his pocket, sending his brother a glare.</p>\n<p>\"Sorry, Mr. Wayne,\" Gordon said, nodding at one of the EMTs. \"I will need a statement eventually, however.\"</p>\n<p>\"I have very disobedient children,\" Bruce said, catching Alfred's eye, \"Gun control is important. There's my statement.\"</p>\n<p>\"An extended statement, Mr. Wayne,\" Gordon said, the EMT shifting him onto one of the gurneys in a quick motion. \"More like a summary.\"</p>\n<p>\"Right. A summary.\"</p>\n<p>The EMTs began to roll him towards the door. Alfred followed alongside the gurney, Damian at his side.</p>\n<p>\"Alfred,\" Bruce said, waving at the butler, \"Call Lucius. Tell him I'm taking a...personal day.\"</p>\n<p>\"Of course, sir.\"</p>\n<p>Jason waited until Bruce was out of earshot. He leaned over to whisper to Tim.</p>\n<p>\"So, any chance you still have that combination?\"</p>\n<p>Dick smacked him, not looking away from the doors.</p>\n<p>\"<em>Jason</em>.\"</p>\n<p>\"That's not a no, Timmy.\"</p>\n<p>\"Jason, stop.\"</p>\n<p>Tim looked both ways, then grinned at his brother. \"...yeah, okay, I still have it.\"</p>\n<p>\"I'm not condoning this,\" Dick warned, \"if Bruce asks--\"</p>\n<p>\"No one asked you to, Golden Boy.\"</p>\n<p>\"Jason, stop encouraging him to commit felonies!\"</p>\n<p>\"Oh, bite me<em>,\" </em>Jason said, \"Live a little, Richard!\"</p>\n<p>\"I wanna hack the Pentagon,\" Tim said, eyes wide. \"Can I do that?\"</p>\n<p>Dick facepalmed. Jason grinned.</p>\n<p>\"Dream big, baby bird.\"</p>\n<p>THE END</p>"
}