{
  "id": "11635215",
  "url": "https://archiveofourown.org/works/11635215?view_full_work=true",
  "author": [
    "commanderquill"
  ],
  "title": "Relax, I'm From Gotham",
  "rating": "Not Rated",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Batman (Comics)"
  ],
  "relationships": [
    "Tim Drake/Jason Todd"
  ],
  "characters": [
    "Tim Drake",
    "Jason Todd"
  ],
  "additional_tags": [
    "Humour",
    "All comfort no hurt",
    "Fluff"
  ],
  "language": "English",
  "series": "",
  "published": "2017-07-28",
  "completed": null,
  "words": "5,435",
  "chapters": "1/1",
  "comments": "160",
  "kudos": "8,466",
  "bookmarks": "1,450",
  "hits": "51,016",
  "summary": "<p>“You know, just out of curiosity,” Red Robin begins, and Jason twists to face him, “are you from Gotham?”</p>\n<p>“What gave it away?” Jason drawls as fire sirens start up in the distance. “My anger issues, or my apathy in the face of the new supervillain flavor of the week?”</p>\n<p>(Or: That time Jason moves to New York and becomes a meme.)</p>",
  "notes": "<p>For everyone unfamiliar with the geography, Albany is the capital of New York State. When I refer to New York, I refer to the state, not New York City. Also, in this, let’s pretend Batman offered Tim Robin after Dick became Nightwing, but Tim changed it to Red Robin (with his New 52 Red Robin get-up) because he didn’t want to piss Dick off.</p>\n<p>Anyway, I was just thinking one day, and I wondered... Why are the people in Gotham ever surprised anymore? In every movie, show, comic, etc. people flip out at the scene, which is understandable, but what happens off the scene? They probably just shake their heads and go about their days. After all the shit that's gone down... They would hardly be phased by this point. And this is my take on that.</p>\n<p>This also serves as my apology for the lack of updates the last few weeks. My grandpa died very unexpectedly and now I'm taking an impromptu plane trip. Hopefully my writing muse comes back in August?</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>I now have a tumblr under the same name! Come drop me a message!</p>",
  "text": "<p>The only thing that Jason regrets, when he finally sets the last box down on his new beige carpet, is not moving sooner. He’s not totally sure what kept him in Gotham for so long but he has a feeling it has to be the same reason reason why Gotham has yet to be deserted by all its civilians. It’s a terrible place, yeah, but it’s a familiar one. Jason hasn’t been in an unfamiliar place since he got a scholarship for Gotham University and realized there’s actually a nice part of Gotham. Even now, having made up his mind to set up shop in New York (and, in the process, increase his potential lifespan), an itch crawls under his skin.</p>\n<p>Jason has only been here for a few hours but he already has the distinct feeling he’s been thrown into a parallel universe. The landlady at the front desk actually said <em>hello</em> to him. She also asked him if he needed help moving in. The man outside five minutes later didn’t even ask -- one moment he was walking his dog, the next he had a box hoisted beneath one arm while ranting about how much he hates his ex wife. Jason can’t smell the perpetual underlying stench of the harbor and he had to Google whether there was a CVS nearby without already knowing. He's never shied away from busy places but the fact that he can’t identify the source of every smell, the names of every mom-and-pop store owner, the location of every useful shortcut in case of an emergency... it makes him overwhelmed and maybe a bit claustrophobic.</p>\n<p>But he’s determined to see this through. Jason has worked too hard for his GED and then his degree in culinary arts to see it all go to waste every damn time the place he works gets ‘accidentally’ destroyed, or in the inevitable event he finds himself on the other side of Freeze’s cold... gun/ray/whatever. No. He has a plan. And, more importantly, a job.</p>\n<p>It’s why he settled on Albany. He had spent months applying online to any offering job in any sort of chef/cooking/baking position he could find in any city he could think of and, finally, after nearly giving up, Jason got a call back from a small Italian restaurant on the corner just down the street. To say Jason was surprised would be an understatement. He’s never known any local Italian businesses to hire non-Italians, non-Italian speakers, or just straight up someone who isn’t in their family. But apparently Jason’s online responses and extreme determination won him some points (the follow up emails including lengthy discussions of the best complimentary spices won him a few more).</p>\n<p>All he needs is a stepping stone. Somewhere to start. Then, <em> then </em>he has somewhere to build from (and maybe, possibly, the pipe-dream of owning his own restaurant won’t end up being such a pipe-dream after all).</p>\n<p>It's too bad he's a magnet for trouble.</p>\n<p>The first time it happens, it’s Jason’s second week in the kitchen. He hasn’t been put in charge of anything yet but that’s to be expected. He’s switching between the tutelage of different chefs all throughout the kitchen and is currently working alongside the saucier, who is less than thrilled to have him and has spent the entire day so far harassing Jason to pull back his sleeves for fear of death by cheese knife.</p>\n<p>Jason has to wonder -- is it because he’s white? (Which makes him wonder if Italians classify as white or brown, which devolves into a mental debate about race, which is too passionate a topic to be thinking about while slicing tomatoes).</p>\n<p>One of the waiters, almost as new of a hire as Jason, rushes into the kitchen during the lunch rush with a notepad and a harried expression. The man pinning up the order asks him what’s wrong and it all spills out. “There is -- people in masks! Outside! They are fighting and they are coming nearer and do you think we are in danger? One has a gun that shoots fire!”</p>\n<p>The cooks look to each other in varying degrees of alarm. Jason puts down his knife and maneuvers to the front. He slowly pushes the flap door leading into the main restaurant open, the waiter peering over his shoulder, and squints across the floor to the one wall that’s essentially all window. He sees nothing and closes the door a little in order to address the waiter. “Who was fighting the guy with the gun?”</p>\n<p>“I don’t know,” the boy says quickly, obviously feeling put on the spot. Jason rolls his eyes.</p>\n<p>“I got that. But what did he look like?”</p>\n<p>“I don’t know!” exclaims the boy. “I saw it on the news!”</p>\n<p>Jason peers out the door again to look at the TV in the far corner of the restaurant. The word LIVE declares itself over footage of, lo and behold, the front of the bar at the end of the street. Using a bo-staff to propel himself behind a car is none other than Red Robin. The scrolling text at the bottom of the screen is unremarkable except for the bold words ‘FIREFLY IN ALBANY’ that instantly make Jason want to tear his hair out. He ducks back into the kitchen.</p>\n<p>The kitchen is silent now. Most of the cooks stare at him. “What?” Jason says, frowning back at them.</p>\n<p>As if that was the answer they were waiting for, they start whispering amongst themselves, voices gradually increasing in volume until the woman boiling the tortellini asks loudly, “What did you see?”</p>\n<p>The sous chef places a hand on the waiter’s shoulder, the kid doesn’t look much older than a scrawny seventeen, and pushes him back in a gesture that clearly tells him to stay put. The boy starts breathing exercises.</p>\n<p>“Supers?” It comes out more like a question because he doesn't know what other answer they're expecting, except it’s apparently the straw that broke the camel's back because the kitchen erupts into a flurry of noise and commotion and exclamations of fear and <em> jesus, </em>what’s their deal?</p>\n<p>The flap door hits Jason in the back as a woman, one of the older waitresses on the staff, bustles in with an expression not unlike the rest of them. Before the door closes, Jason confirms that the customers are in a similar predicament. Most of them are pressing themselves up against the window -- the last thing they should be doing.</p>\n<p>Jason takes one sweeping look around at the chaos the kitchen has degraded into before sighing and walking onto the main floor. “Everyone, if you would listen to me--” except no one can hear him over their own voices. He frowns. “Guys--”</p>\n<p>Jason spares a second to wallow in his exasperation before he crosses his arms across his chest, takes a deep breath and yells, <em> “Everyone, shut up!” </em></p>\n<p>The restaurant quiets in increments, and in a few seconds most of the patrons are looking in his direction. He waves his hat to catch the attention of everyone else while taking a quick cursory assessment of the room. He remembers the row of booths extending around the block of the kitchen, making the floor into a giant L shape, that contains no windows due to the brick wall around it. “First of all, step back from the windows.” No one moves at first. After a glare, it seems that those at the windows finally realise that he’s talking to them and they shuffle back. “Now, if you’ll listen to me, I promise”--probably--”that you’ll all be okay. But we have to move quickly.”</p>\n<p>In the next few minutes, a couple heads poke out from the kitchen, but when Jason advises them to stay back, they do. Jason has no real authority in this place whatsoever, yet for some reason everyone is listening to him. He decides not to look a gift horse in the mouth. A pair of customers panic and try to run out of the restaurant, but the only door in the main restaurant is in the front and they soon run back in.</p>\n<p>The other door is in the back of the kitchen. Jason doesn’t think leaving the restaurant is wise -- he knows first hand just how messy fights like these can get, and there’s no predicting where they’ll go. That’s why he doesn’t remind anyone of it. Instead, he helps them get into the corner lined on either side by brick walls and then barricades them in with tables turned sideways, supported by chairs. He’s about to retreat back into the kitchen when the glass window shatters inwards.</p>\n<p>Everyone screams, but luckily their panic forces them further into the corner, instead of making them try to push the tables away and make a break for it. Jason thanks small blessings as he presses up against the wall and glares with all his might at the superhero in the middle of his restaurant.</p>\n<p>Red Robin is currently on the back of a guy dressed like an upgraded bee, his arm locked around his throat. Said bee apparently can fly, because he (Firefly, Jason’s mind supplies) propels the both of them to the ceiling. Jason winces as plaster rains down, and so do the hero-villain duo as Red Robin uses his other arm to block Firefly’s line of sight. Firefly is raining curses that he only barely manages to get through his mouth, clawing at the arm around his throat. It doesn’t seem that he still has his gun of death or whatever with him, at least.</p>\n<p>Up, up, up--</p>\n<p>And down.</p>\n<p>They crash into the wall on the right, on the left, back to the floor, too close to Jason for comfort--</p>\n<p>Jason pushes back from the wall and scowls. “Hey!” he yells. Red Robin has resorted to sawing Firefly’s jetpack off with a knife shaped like a bat. “Do you realise how much these damages are going to cost?” he says when Red Robin doesn’t answer.</p>\n<p>The vigilante manages to get the jetpack off and tosses it to a corner of the restaurant. Everything is suddenly silent, save for Firefly’s thrashing. Jason’s surprised he’s still conscious. He must have some sort of armor around his throat.</p>\n<p>Jason picks the jetpack up, walks up to the two of them, and smashes the metal container on Firefly’s head as Red Robin is still struggling to keep him down. The guy <em> is </em>more heavily armored and overall just a lot bigger than the vigilante, after all. There’s abrupt silence.</p>\n<p>“Take this somewhere else, dude. This is a fucking restaurant and you don’t have a reservation.”</p>\n<p>Red Robin rubs the back of his neck with his hand, still kneeling over Firefly’s unconscious body. “Uh, yeah… Sorry about that.”</p>\n<p>“If you were sorry, you’d stop doing it. You got your guy, now get the hell out.\"</p>\n<p>The vigilante turns his head, as if just now noticing the sheer amount of damage he’s caused. Five chairs and the front desk are absolutely destroyed, the ceiling is cracked, there’s plaster all over the floor, and there’s a sizeable dent in the wall connecting to the kitchen which isn’t made of brick. There’s also shattered glass everywhere that’s going to be a pain in the ass to clean up.</p>\n<p>“Right,” Red Robin says sheepishly, standing up and dragging Firefly up with him. “Sorry again,” he apologises as he opens the mostly-intact front door. Jason can see him dump the unconscious body on the ground right outside and sprint away.</p>\n<p>At least he had the courtesy to take him out at all.</p>\n<p>In the few beats of silence that follow, Jason has already completely forgotten about the people behind him. He’s spending his time estimating how long he’ll be out of a job until everything gets repaired again. Then the clapping begins. He spins slowly around to stare incredulously as people start cheering. Before he can think, he’s being pulled into a hug by a large woman that he’s never met in his life.</p>\n<p>Christ, New York is weird.</p>\n<p>Jason gets his job back a month later and he’s never been more relieved. The small restaurant is too poor to have paid all its staff during re-modelling, so Jason has spent the last month as a barista. Yeah, customer service? Not his thing.</p>\n<p>He’s ready to forget about everything and get back to work, except the first day in he gets pulled into the owner’s office and spends an entire hour being praised. He can’t understand half of it, considering half of it is in Italian, but he’s sure the speech is touching and all. He really does like the owner, though, so he spends longer in there than necessary steering the conversation away from himself. They end up discussing what could be added to the menu according to customer feedback on the surveys that they handed out last month, and Jason walks out with a promotion from trainee to full-time official cook.</p>\n<p>His promotion isn’t what earns him respect among the kitchen staff, though. Since his ‘stunt’ during the Firefly fiasco, all the other cooks have warmed up to him and treat him like an old buddy. The old man who Jason normally finds washing dishes, even though Jason doesn’t think that’s his job, smiles widely every time they make eye contact and is constantly patting him on the back and nodding. And of course, it seems that every <em> hour </em> afterwards, the anxious waiter Jason now knows as Marco comes up and says, “Table 7 says thanks”, or “Table 5 wants to let you know that you’re the reason they keep eating here,” or “I think the blonde lady at Table 1 wants your number.” He finally tells Marco that he gets it and the boy doesn’t need to <em> actually </em>thank Jason every time someone tells him to.</p>\n<p>He can’t count the amount of times Marco has led him back out onto the floor so someone who looks important can tell them how much they appreciate what he did, his quick action, yada-yada. Two weeks after he got back to work, a man Jason doesn’t recognise requests his presence, forcing Jason to stand there as the man thanks him for saving his child’s life. Jason thinks he’s being a little over dramatic, and that opinion doesn’t change when the brunet man gasps at something he spots over Jason’s shoulder.</p>\n<p>Jason is half-expecting to see Firefly out the window again, except this time the man is just gasping at the TV, where there’s a helicopter view of Bane tearing up a traffic pole in downtown Gotham. “Oh god, look at that! That’s terrifying!”</p>\n<p>Jason raises his eyebrows, shrugs at the TV, and turns back around. “I guess.”</p>\n<p>The man gapes at him like he can’t decide if Jason is a terrible person or not. But then again, maybe Jason’s just projecting.</p>\n<p>The next time, it’s Jason’s <em> day off </em>and he’s spending it standing in line at the bank, ready to cash in his paycheck so that he can finally buy the entire Lord of the Rings first editions he’s had his eye on for what seems like forever. After all, he lives alone, has no girlfriend, and his most expensive hobby is upgrading his motorcycle which he barely uses because he works on the same block as his apartment. What better thing is there for him to spend his money on than books?</p>\n<p>But, of course, because this is <em> his </em>life, someone screams the second he gets up to the counter. He doesn’t even turn at first, just glares at the wall as the woman sitting in the chair across from him trembles in horror.</p>\n<p>\n<em> “On the ground! Everyone get on the fucking ground!” </em>\n</p>\n<p>Jason slowly slides to the ground as he turns, because he’s not an idiot, and sits leaning against the front desk because getting on his knees is just fucking uncomfortable. It doesn’t seem that anyone takes notice of him as one of the men points a gun at the woman that was just about to take Jason’s check. She leads him away from the room as one of his four other partners starts waving his gun around like he’s trying to prove he has one.</p>\n<p>It’s five minutes later when someone finally decides to pay him attention. Jason is surprised it took them this long, considering he’s the only one not sticking his butt in the air or laying sprawled like an idiot (maybe he’s the idiot, actually, for not doing that -- whatever). One of the men, the one who had been waving his gun, marches towards him. “What are you doing?” he yells. “Get on the ground!”</p>\n<p>“I am,” Jason scowls.</p>\n<p>“Hands up, face down! <em> Now!” </em></p>\n<p>Jason cocks his head and looks up at him with a decidedly unimpressed look. “You think you’re gonna scare me with a little thing that still has the safety on?”</p>\n<p>It’s when the kid is scrambling to turn the safety off that Jason obeys because he came to Albany to <em> extend </em>his life, not end it.</p>\n<p>Still, he only barely manages to <em> not </em>make a comment comparing the guy’s miniature weapon of choice to his dick.</p>\n<p>Jason almost wishes he were still in Gotham. He grew up in Crime Alley, for fuck’s sake. At least most of the costumed criminals over there have style. The least these guys could do is put on a good show. They should really take some tips from the Riddler (or the Penguin -- Jason heard that he doesn’t kill civilians anymore).</p>\n<p>An hour later, Jason’s out of the bank but he still hasn’t gotten his check cashed and he’s pretty annoyed by it. He’s perched on the back of an ambulance with a blanket wrapped around his shoulders, and the only reason he hasn’t thrown it off already is because it’s insanely soft and he can appreciate nice things sometimes. From here, Jason can see a reporter interviewing all of the hostages one by one, and to Jason’s surprise most of them are more than happy to be thrust in front of a microphone. Jason doesn’t share such sentiment. He’s dreading when the reporter inevitably attempts to approach him, and his nerves aren’t being helped by the guy from the ambulance he’s on, who’s trying to get all up in his space. “Dude, knock it off, I’m fine,” Jason says, scooting pointedly away. “Can I leave now?”</p>\n<p>The man, or boy because the kid looks barely out of high school, looks perplexed by Jason’s attitude. A first aid kit is clutched firmly in his hand and he hovers like he can’t quite decide what to do with himself. “Uh, I don’t think so. The police will probably want to get a statement.”</p>\n<p>Jason scowls as the medic scurries off in search of a more predictable patient. “Great.”</p>\n<p>Jason manages to sit there for all of ten seconds before deciding that he really doesn’t care what the police want. He’s on his way out, weaving among the media vans and police cruisers perched at the edge of the scene when he’s spotted by the peppy girl with a microphone. “Mister!” she calls after him. Jason turns around with a long-suffering look. “Mister, were you one of the hostages?”</p>\n<p>“Sure was,” Jason responds half-heartedly. He looks longingly over his shoulder at the police tape just two precious feet away.</p>\n<p>“Can you give me any details? Did any of the men speak to you? Did they threaten you? Did they hurt you?”</p>\n<p>Jason’s eyebrows rise as far as they can on his forehead at her rapid fire questions. He spares a glance for the cameraman, looking for a reaction, but it seems as if the man has been her cameraman for a while because his face doesn’t change. Or maybe it’s just that all news reporters are like this. “I pissed one of them off by pointing out that he still had the safety on his gun. He was an amateur. Probably compensating for something. He was really fucking annoying.”</p>\n<p>The girl blinks in disbelief. “Oh,” she says lamely, before coming back to herself. “Uh, so I take it you were...relatively calm throughout this traumatic ordeal?”</p>\n<p>Jason gives her the same unimpressed look he gave the robber. “Traumatic? Lady, I’m from Gotham. This shit is <em> elementary.” </em></p>\n<p>He gets to escape while she’s still formulating a response.</p>\n<p>There’s an earth-shattering <em> boom </em>as another pod crashes into the middle of the block, the same type that’s been plastered all over the news since yesterday morning. Emerging like an arachnophobe’s worst nightmare, a long white spider-like leg arches and clamps into the street with enough force to shake Jason off-balance. From the same area appears two more legs, and slowly from the crater a giant structure like a pulsing red and white brain rises above the towers. Yellow mucus drips from the exterior.</p>\n<p>A person shoves Jason into the wall of a bakery as they struggle to get away from the staggering monster. Humanoid figures wielding unidentifiable weapons across their chest march out, and Jason is starting to think that it might actually be a spaceship of some sort (a spaceship with legs?) when it starts pumping black smoke into the sky. Mucus continues its sludge down towards the street, and the screams of the people around Jason aren’t enough to drown out the groans and whistles of debris from struck buildings raining down from the sky.</p>\n<p>Jason stands there, taking in the sight of impending doom, and wonders why people are even bothering to run away.</p>\n<p>A stark picture of flying black and red soars through the air and rolls onto the ground beside Jason’s feet like an unwelcome answer to an unsaid prayer. He stares incredulously as Red Robin rolls onto his back with a moan and attempts to rise to his feet.</p>\n<p>“A little help?” the vigilante says when he notices Jason standing there.</p>\n<p>“What the fuck are you even trying to accomplish?” Jason deadpans. “Did you <em> see </em>that thing kick Superman back to Krypton or was that just me?”</p>\n<p>“Just you,” says Red Robin, now resigned to getting to his feet on his own. He stumbles a little and catches himself on the wall.</p>\n<p>While the vigilante collects himself, Jason observes him. Red Robin looks like he’s had better days. His cape is torn and somewhere along the way one of his bandoliers got ripped at the shoulder and is now hanging limp at two ends beside his thigh. There’s a bruise blossoming over his right cheekbone, and Jason spares a moment to wonder why Batman’s the only Gotham vigilante with face gear.</p>\n<p>“Hey,” Jason calls. “Didn’t something like this happen in the Avengers?”</p>\n<p>Red Robin gives the most obnoxious snort Jason has probably ever heard in his life. “Nah, those aliens were definitely more metallic. These guys are organic. And more annoying.”</p>\n<p>“I wouldn’t be so sure,” Jason muses. “I mean, those other ones could fly. Can these guys fly?”</p>\n<p>It seems that Red Robin has to take a moment to think about that. “No idea. I should probably check.” Jason nods and they both take in the scene for another extended moment. “You know, just out of curiousity,” Red Robin begins, and Jason twists curiously to face him, “are you from Gotham?”</p>\n<p>“What gave it away?” Jason drawls as fire sirens start up in the distance. “My anger issues, or my apathy in the face of the new supervillain flavor of the week?”</p>\n<p>“Actually, I think it’s the sarcasm,” Red Robin replies.</p>\n<p>“Oh, right. I forgot about that one,” says Jason, like everything in the world finally makes sense.</p>\n<p>There’s a second of silence between them that’s punctuated with the sight of a little glowing green man flying into a building, and the sound of said building crumbling in half as a result. “I think that’s my saving-the-world cue,” Red Robin says contemplatively, as if he’s commenting on the weather.</p>\n<p>“Alright, have fun,” says Jason. Red Robin is probably giving him a weird look, but it’s hard to tell from the mask. He doesn’t say anything before he disappears so Jason considers it a win.</p>\n<p>As it turns out, the world doesn’t end that day. It was just another alien invasion on just another city, except where in Gotham people the next day would already be opening stores for business and vandalising the debris, the New Yorkers are still too scared to walk outside. He gets to work the next morning and tries opening the door three times before he realises it’s locked, and when he calls his boss, he gets an earful about what in the world he was thinking.</p>\n<p>Jason was thinking about his paycheck, but whatever.</p>\n<p>He wanders down the street for a time, taking in the odd peace. He doesn’t live in a main area of commute, so rush hour traffic is distant, and the pedestrians are severely lacking. Then again, it would probably be difficult to walk a dog around the ruins of a battlefield like this, he muses as he steps around a mutilated newspaper box. A homeless man watches him curiously as he passes.</p>\n<p>Jason tries the door on the local coffee shop, feeling in the mood for caffeine, and is surprised to find it open. The barista at the front -- well, more like at the side, lounging on one of the couches -- looks just as surprised to see him. She scrambles up to tie her apron around her waist as she sets about taking his order.</p>\n<p>When he gets his cup and takes a seat at a window, the barista disappears. She’s probably in the back making herself useful, what with only him as a customer, and he’s somewhat grateful. Having only two people in a dimly lit shop as small as this makes him feel pressured to start a conversation, when he’s just as content to watch the steam curl up from his mug.</p>\n<p>That’s why he jumps when someone takes the seat across from him.</p>\n<p>And stares because shit like this doesn’t even happen in <em>Gotham</em> (it probably does actually, now that Jason thinks about it).</p>\n<p>Red Robin is perched across from him like he isn’t carrying a belt full of sharp weapons into a homely little shop and Jason blinks twice because he isn’t quite sure if he’s dreaming. The man (boy?) looks like he hasn’t slept, and Jason doesn’t doubt that. He probably didn’t don military-grade gear first thing in the morning to go grab coffee.</p>\n<p>The boy smiles a small, friendly smile as he waves. Jason hesitantly waves back. “Hi,” he says lamely.</p>\n<p>“Mornin’,” the vigilante replies, opening one of his pouches and retrieving a smartphone.</p>\n<p>“Do you mind…?” Jason asks, nodding to the seat. He was looking forward to a peaceful morning for once.</p>\n<p>Red Robin shakes his head. “Not at all,” he replies, and Jason is about to clarify that that’s definitely not what he meant when he sees the smirk that the boy is barely holding back. Ass.</p>\n<p>He starts fiddling with his phone and Jason can’t quite believe what he’s seeing. A fully armed vigilante is sitting across from him texting like a preteen. He sips his drink and tries to back to looking out the window, but it’s no use because Red Robin’s reflection is interrupting his thoughts. He frowns.</p>\n<p>It’s only by frowning at the reflection that he notices when the vigilante holds out his phone. Jason glances down at it suspiciously. It’s open to Twitter.</p>\n<p>With an encouraging nod from Red Robin, Jason cautiously takes the device, and is disappointed to find that Red Robin had taken the time to log out so Jason can’t see what his account is. Damn.</p>\n<p>“Did you know that you’re a meme?” Red Robin says, and Jason stares at him.</p>\n<p>“What?” he asks.</p>\n<p>“A meme,” the vigilante responds. “Come on, you can’t be old enough to not know what a meme is.”</p>\n<p>“I know what a meme is,” Jason defends. “And I’m not old.” He looks down at the phone.</p>\n<p>There’s a picture of <em> him </em> on it, obviously taken from the video of his very brief interview by the reporter from last week. He has an expression on his face that screams ‘you’re an idiot’. Jason reads the caption above the picture out loud. “Tfw you find out the guy running for president is a psychopath who built a glowing green robotic suit to take over the world,” and then glances at the white caption below the picture of his face, “I’m from Gotham. This shit is <em> elementary.” </em></p>\n<p>There’s a smile growing on the vigilante’s face the longer Jason stares at the caption. It becomes a full shark-toothed grin when Jason finally cracks, puts his hand over his face, and starts laughing almost hysterically. “Why am I being referenced. I was <em> using </em>a reference.”</p>\n<p>“Keep scrolling,” Red Robin says.</p>\n<p>The picture below that one is a screenshot of the Sherlock Holmes from the Epic Rap Battles of History on Youtube, holding a pipe out, with the caption, “I’m from Gotham. This shit is elementary, my dear Watson.”</p>\n<p>“Why is this happening to me,” Jason moans from between his fingers.</p>\n<p>The barista finally re-emerges, stares at Red Robin in horror, and runs back to wherever she came from.</p>\n<p>“Congratulations, you’re a celebrity,” says Red Robin. “You’re famous for ripping off Sherlock. So creative.”</p>\n<p>Jason gives him a dirty eye. “And you ripped off a burger restaurant. So creative.”</p>\n<p>“There’s no Red Robin restaurants in Gotham!”</p>\n<p>“How many times do you get made fun of?”</p>\n<p>“My ex-girlfriend buys me a Red Robin gift card every year for my birthday,” the vigilante deadpans. “My brother continued the tradition after she faked her death.”</p>\n<p>Jason whistles. “Wooow.” He hesitates. “Why did she fake her death?”</p>\n<p>“Her dad became her supervillain,” says the vigilante in the same dry tone. He rises to his feet as Jason is still processing that.</p>\n<p>“What the fuck?” Jason asks, although more to himself than to Red Robin. He doesn’t move as the boy takes his phone from Jason’s hands.</p>\n<p>“I have an interesting life,” Red Robin says simply. Jason bets that yeah, he probably does, especially compared to Jason’s. “I should be heading back, I just wanted to make sure you knew about your newly acquired fame,” he says, that earlier amiable smile returning as he looks down at Jason.</p>\n<p>“Will I see you around?” Jason blurts, and wishes he didn’t. Now he sounds desperate, when a few minutes ago he was wishing Red Robin would leave. Maybe the intrigue of the lives of Gotham’s resident vigilantes is finally starting to get to him. It’s already enthralled everyone else, it was about time Jason got a taste. And boy, is he hooked.</p>\n<p>Red Robin hums and tilts his head in consideration. “Are you ever coming back to Gotham?”</p>\n<p>“I don’t know,” Jason answers honestly.</p>\n<p>“I would say you should stop by for a visit, but I wouldn’t wish that on my worst enemy.”</p>\n<p>“Aren’t your worst enemies in Gotham?” asks Jason.</p>\n<p>“Nah, he’s in the Middle East. I’m not sure if he’s plotting world domination or trying to figure out the best way to blackmail his ten year old grandson, but either way, I definitely don’t want him in Gotham. We already filled our bioterrorist quota.” Jason is just itching to shower Red Robin with more questions, but one look at the smug expression on his face and Jason just <em> knows </em>he won’t get any answers.</p>\n<p>“You should come back here sometime then,” says Jason stupidly.</p>\n<p>“I probably will, now that I’ve been so warmly invited,” the boy says, and it’s ridiculous since Jason can’t see his eyes, but with his smile and the length of his gaze, Jason feels something like <em> fondness </em>coming from him.</p>\n<p>“Cool,” says Jason, because he only knows how to use words when he’s writing them down.</p>\n<p>The boy must find his response funny, because his smile widens as he walks towards the door. “Bye, Jason,” he calls one last time, the bells of the door ringing shut behind him. Jason watches him go, then directs the smile he didn’t even know he was wearing down at his cup.</p>\n<p>It takes until he finishes his drink to realise that he never told Red Robin his name. Jason spares a moment to be curious, but finds that he just doesn’t have it in him to be freaked out.</p>\n<p>After all, he <em> is </em>from Gotham.</p>"
}