{
  "id": "116314",
  "url": "https://archiveofourown.org/works/116314?view_full_work=true",
  "author": [
    "out_there"
  ],
  "title": "Let You Kiss Me (So Sweet and So Soft)",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Sherlock (TV)"
  ],
  "relationships": [
    "Sherlock Holmes/John Watson"
  ],
  "characters": [],
  "additional_tags": [],
  "language": "English",
  "series": "",
  "published": "2010-09-14",
  "completed": null,
  "words": "8,659",
  "chapters": "1/1",
  "comments": "608",
  "kudos": "11,946",
  "bookmarks": "2,201",
  "hits": "170,655",
  "summary": "<p>\n<em>The first time Sherlock kisses him, John keeps his eyes open, and so does Sherlock, and mostly, he wonders what Sherlock could possibly be up to. There'll be some logic to this. Some ridiculous experiment about body warmth or respiratory rates or testing a new way of picking pockets. Sherlock does the unimaginable for bizarre reasons, but behind it, there's always logic and curiosity. Sometimes, it just takes him a while to explain it to John.</em>\n</p>",
  "notes": "<p>Title comes from Regina Spektor's \"Fidelity\". Huge thanks to my betas <a href=\"http://www.dreamwidth.org/profile?user=vista_blows\" rel=\"nofollow\"><img src=\"http://s.dreamwidth.org/img/silk/identity/user.png\" height=\"17\" alt=\"[profile] \" width=\"17\"></a><a href=\"http://www.dreamwidth.org/profile?user=vista_blows\" rel=\"nofollow\"><strong>vista_blows</strong></a> and <a href=\"http://tehomet.dreamwidth.org/profile\" rel=\"nofollow\"><img src=\"http://s.dreamwidth.org/img/silk/identity/user.png\" height=\"17\" alt=\"[personal profile] \" width=\"17\"></a><a href=\"http://tehomet.dreamwidth.org/\" rel=\"nofollow\"></a><strong>tehomet</strong>.</p>\n<p>ETA: Translated <a href=\"http://pantomime.blogbus.com/logs/208748369.html\" rel=\"nofollow\">into Mandarin</a> (link not working) and <a href=\"http://ficbook.net/readfic/268114\" rel=\"nofollow\">Russian</a>.</p>\n<p>Also available in a wonderful podfic <a href=\"http://www.audiofic.jinjurly.com/let-you-kiss-me-so-sweet-and-so-soft\" rel=\"nofollow\">here</a>.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
  "text": "<p>The first time, John's in the middle of making a sandwich. There are four slices of bread, which he commandeers as his own -- if Sherlock wants a sandwich then Sherlock, for once, can be the one to go out and buy bread -- sitting next to a small block of cheddar and one bright red, perfectly ripe tomato. He slices the cheese thin and the tomato thick, and he's in the middle of sprinkling salt on it when the door opens.</p>\n<p>John glances over his shoulder, fast and from old habit, but it's only Sherlock. He closes the sandwiches with the last two bread slices, and cuts them in half before he turns around.</p>\n<p>Sherlock is pushing aside the small collection of post -- catalogues and assorted junk mail, mostly; the occasional utility bill that John doesn't want to know about -- and lifting a familiar white, blue and red plastic bag onto the table.</p>\n<p>\"You went to Tesco?\" John asks because despite months of living with the brilliant Sherlock Holmes and dealing with the strangest cases to see London streets, there are some things that still impossible to contemplate. There are things that simply don't happen.</p>\n<p>Like Sherlock shopping.</p>\n<p>\"I needed raspberry cordial. I want to see how the dilution of the cordial affects staining, and it's always good for splatter pattern analysis. You needed bread,\" Sherlock says, pulling out a loaf and balancing it on one outstretched hand. It's entirely possible he doesn't know where the bread lives in between the shopping bag and magically arriving on his plate as part of a sandwich. \"And milk.\"</p>\n<p>John nods, and takes the bread. \"We weren't even out.\" He puts it in the fridge on the top shelf, and ignores the cake box sitting on the bottom shelf. It's a compromise. John's main objection to body parts in the fridge is that he doesn't want to see them first thing in the morning; this way, he doesn't see them and he doesn't need to know what Sherlock is examining. (It's not a head. A head wouldn't fit in that box unless it was sliced in three pieces… and that's really not a thought he wants to be having.) \"Pass the milk?\"</p>\n<p>John's expecting an explanation for the bread -- perhaps starting the day with a particular length of shower implies a day when he'll decide on two sandwiches for lunch -- but Sherlock passes it over without a word.</p>\n<p>Closing the fridge door, John turns and finds Sherlock right behind him. Three inches from him to be exact.</p>\n<p>It should be alarming. It should make John jump or flinch or whatever it is normal people do when they're surprised, but this is Sherlock. Sherlock with his pale, sharp eyes, unruly hair and smoothly pressed collar, and Sherlock isn't threatening. He's mostly interesting, with a dash of frustrating or fascinating, depending on whether he's bored and languishing around the flat or working on a case.</p>\n<p>Between his own natural wariness and the look-evaluate-shoot caution the army drills into everyone, John knows how to spot a threat. Sometimes, he's even smart enough to avoid it before he gets to the shouting and fighting part. But there's nothing about Sherlock, even standing so ridiculously close, that registers as danger.</p>\n<p>Mostly, he's curious. Sherlock's watching him and John wonders what he's looking for. Dust on John's collar, proving that he'd given in to Mrs Hudson and actually dusted the shelves cluttered with Sherlock's books? Early signs of dandruff, proving that John should switch to Head &amp; Shoulders? Or perhaps something more far-fetched and ridiculous, something miniscule revealing details that most people thought were private and unknown.</p>\n<p>Sherlock kisses him.</p>\n<p>John's first thought, strangely enough, is: <em>it's funny what goes through your head</em>. The last time he kissed someone taller than him was Jenny Hargreaves in fifth form. She had legs all the way down to the floor, and wore skirts that never touched her knees, and for five glorious weeks he'd had a crick in his neck from snogging her.</p>\n<p>Since then, he's dated shorter girls with longer skirts, and he's used to leaning down to kiss. But for once, he isn't leaning up or down. Sherlock's ducked his head down the differential few inches to press his lips against John's. And Sherlock's lips are warm and slightly parted, warm like the press of Sherlock's nose and the soft exhale against John's cheek. Nothing like the cold hand Sherlock presses against his shirt, under John's open jacket.</p>\n<p>John keeps his eyes open, as does Sherlock, and mostly he wonders what Sherlock could possibly be up to. There'll be some logic to this. Some ridiculous experiment about body warmth or respiratory rates or testing a new way of picking pockets. Sherlock does the unimaginable for bizarre reasons, but behind it, there's always logic and curiosity. Sometimes, it just takes him a while to explain it to John.</p>\n<p>Sherlock pulls back, watching John carefully, and then gives one sharp nod. Turning, he collects the dark red cordial and walks out, presumably to his room.</p>\n<p>John checks his wallet is still in his pocket, and then checks that everything supposed to be in his wallet is still there. Then he picks up his sandwiches, walks over to the sofa and turns on the telly.</p>\n<p>***</p>\n<p>The second time it happens, John's half asleep. He's spent most of the night waking up from nightmares, strikingly vivid dreams that leave him reaching for his gun, holding his breath so he doesn't make enough noise to be found. He hates waking up from those dreams with his hands empty and his head too full, and even though he eventually gets back to sleep, it's never a restful night.</p>\n<p>But it's eight o'clock, and it's bright, and he's almost awake, so he drags himself down the stairs with his eyes mostly closed, hand tight on the banister. He shuffles into the kitchen, eyes still shut and Sherlock says, \"Want a cup of tea?\"</p>\n<p>The answer to that is yes, but it means Sherlock wants him to make it. John manages to open one eye and glare at Sherlock.</p>\n<p>\"Here,\" Sherlock says, walking towards him holding something that very definitely resembles a teacup.</p>\n<p>\"You? Tea?\" And he means, 'You, Sherlock Holmes, know how to make tea and finally decided to share this useful trait?' but that's far too many words on too little sleep.</p>\n<p>\"Mrs Hudson made it.\" Sherlock presses the warm cup into John's hands and ducks forward to kiss John on the lips. Just a peck, mouth-closed, the kind of early morning kiss that implies the other person hasn't brushed their teeth yet. \"Morning,\" Sherlock says, and then disappears to leave John in peace with his wonderful, steaming hot cup of tea.</p>\n<p>It's not until he's finished his tea and managed to blearily open his eyes, that John realises something was very wrong with that situation. He puts the teacup and saucer down next to Mrs Hudson's empty, blue-flowered teapot, and then goes to Sherlock's room.</p>\n<p>Sherlock's dressed and tilting forward against the wall, holding himself up with one hand for no discernable reason.</p>\n<p>\"Wait,\" John says, even though Sherlock's not going anywhere. \"Mrs Hudson made us tea?\"</p>\n<p>Sherlock gives a fast, Cheshire-Cat smile. \"I promised we'd dust the shelves.\"</p>\n<p>\"I did that days ago.\"</p>\n<p>\"I know. But Mrs Hudson hadn't realised that. For some reason, the better reward is always offered for the promise of labour rather than confirmation that the labour was done.\"</p>\n<p>John frowns. \"But you used my labour to gain a reward for yourself.\"</p>\n<p>\"Really,\" Sherlock says, pushing himself back from the wall and switching hands in one seamless, strange movement, \"I used the promise of your labour. And I shared.\"</p>\n<p>\"Out of a pot of tea, I got one cup?\"</p>\n<p>\"I shared a portion commensurate with your input into negotiations.\"</p>\n<p>John skulks off to have a shower, and muttering under his breath about using a 'commensurate portion' of the hot water.</p>\n<p>***</p>\n<p>The third time is after butter chicken. Sherlock's trying to identify an observable pattern to Indian restaurants and the level of spice considered appropriate for the dish. Sherlock believes that the varying level of spice used in each restaurant will reflect the general heat of all dishes prepared there; John thinks the third night of eating butter chicken at different restaurants is starting to get monotonous. (It makes him weirdly nostalgic for bad army food, the same meal served over and over with only slight variations in taste.)</p>\n<p>Sherlock spends each meal watching, observing, mentally cataloguing every detail he can see, smell or hear. John's tried making conversation -- asking why the butter chicken, only to have Sherlock roll his eyes, replying, \"A vindaloo three times as spicy as you expected would not be a pleasant experience, or one you'd wish to repeat,\" -- but Sherlock's concentrating. He's observing and deducing. He's working, admittedly for rather strange values of 'work'.</p>\n<p>John can't help feeling like a distraction. Sometimes, living with Sherlock makes you feel unnecessary in your own life; other times, he knows he's the only thing that keeps Sherlock from being strangled by police and criminals alike.</p>\n<p>But at the end of the night, Sherlock will ask him to rate the dish on spiciness, on general heat, on blandness of taste and quality of rice, chicken, drinks and service. Sherlock has prepared cards he forces John to fill out before they leave the table. (John wonders if they look like food critics or critical tourists.)</p>\n<p>\"How are you paying for this?\" John asks as they walk home. The night's mild enough that Sherlock's in a suit without coat or scarf, so John vetoed Sherlock's automatic suggestion of a taxi.</p>\n<p>\"On credit,\" Sherlock says, brandishing a bright orange card in Donovan's name. \"Last night was on Anderson. And Lestrade paid for the night before.\"</p>\n<p>\"They're police. I don't think they take kindly to stealing,\" John says, but his heart isn't in it. It's hard to be properly disapproving when Sherlock looks so pleased with himself.</p>\n<p>\"I exchange it for a false card and return the true card in the morning. By the time they see the charge on their monthly statement, there's nothing they can do.\"</p>\n<p>John thinks about the three restaurants they've been to. Marked on a map, 221B Baker Street would be the center of the triangle. \"It's going to take Lestrade thirty seconds to realise it's you.\"</p>\n<p>\"Oh, they'll know I did it,\" Sherlock says, bright edge of a smile catching the lamppost, \"but they won't know how. And they won't be able to prove it was me.\"</p>\n<p>He should have known. Sherlock hasn't had a case for a week so taunting officials is clearly the next best thing. John's had flatmates before, back at university, at St Bart's, and he's used to grotty kitchens and stale, open beer bottles, complete strangers wandering half-dressed into their living room and helping themselves to breakfast. He even remembers the sickly sweet smell of people getting high and yet, never before has he had to ask, \"I take it you've made sure our flat's clean?\"</p>\n<p>\"Of course,\" Sherlock says, slowing as they walk past the eatery downstairs from them. He stops outside their door and says, \"I'm going to keep walking. They've been working on Weymouth Street and I need to know the impact on pedestrian traffic.\"</p>\n<p>\"I'm thinking an early night,\" John says, shrugging, \"so I'll see you tomorrow.\"</p>\n<p>\"Okay,\" Sherlock says, then he leans forward and kisses John. One hand on John's shoulder and standing at John's doorstep, and there's no way that this isn't a goodnight kiss. They're on a public street and there's space between them, but Sherlock's eyes are closed and his mouth is warm and wet. Sherlock's tongue is against his lips, not pushing, not demanding, but there, alive and inviting and the clear possibility of sex. It's the kind of kiss for the end of a particularly good date.</p>\n<p>There was dinner for two, a booth at the back and Sherlock paid. And now, John's being kissed goodnight at his front door.</p>\n<p>Then Sherlock pulls back and says, \"Good night.\" There's the hint of a smile, not as smug as before but still secretive and pleased, and then Sherlock walks off.</p>\n<p>As if nothing unusual happened. As if <em>\"There's a third restaurant I want to try, John,\"</em> is the same as <em>\"Would you like to go out on a date with me? How about dinner tonight?\"</em></p>\n<p>As if Sherlock's allowed to change the rules at a moment's notice because he wants to.</p>\n<p>And that, John thinks as he slowly, purposely trudges up each stair to his room, is the most annoying part of all. Sherlock changed the rules without telling him. Dates are supposed to be fun and lively, there's supposed to be flirting and making yourself sound better than you really are. John's good at dating. He doesn't usually spend dates sitting quietly at a table, playing Tetris on his mobile phone while Sherlock tries to spot a secret spice-o-meter.</p>\n<p>It's not the way things are supposed to be done, John finds himself thinking as he gets ready for bed. It's a stupid thought. Sherlock never does anything the way it's supposed to be done.</p>\n<p>***</p>\n<p>The next morning, John wonders. He's half-tempted to blurt out the question, to simply ask Sherlock if last night was a date or something… more mundane? More typical of Sherlock? Less romantic? He doesn't know how he'd phrase the question, let alone how to ask it.</p>\n<p>Sherlock's gone when he wakes up, but there's a blanket thrown haphazardly across the couch and a second cake box in the fridge (John doesn't peek. It's better if he doesn't know), so Sherlock was home at some stage last night.</p>\n<p>He's left a message, looped handwriting travelling across the kitchen wallpaper in pencil: <em>Gone to see a man about a dog. SH</em></p>\n<p>John reads it and tries not to laugh. Then he remembers he's on his own -- if you don't count whatever's sitting inside their fridge -- and gives in.</p>\n<p>The hilarious thing is that Sherlock was probably entirely serious about the message. He's probably talking to someone about a canine at this very moment. He wouldn't have even considered colloquial meanings to the phrase.</p>\n<p>It's like the solar system. Sherlock understands the magnetic North pole and the impact on navigation without even caring that it's caused by the Earth constantly spinning. The things that normal people know, Sherlock… doesn't. There are great big yawning gaps in his general knowledge, and it doesn't bother him.</p>\n<p>Likewise, the things that normal people do, Sherlock manages to do in a completely different way. Most people see a homeless girl on the street and give her a fiver out of empathy, concern for another human being, liberal guilt for their own comfortable lifestyles or because it makes them look charitable to others. Sherlock pays the homeless to keep his underground spy-ring ticking along.</p>\n<p>Last night could be a date. It has all the traditional signs of one. If it anyone other than Sherlock -- or Mycroft, John mentally amends -- he'd make the assumption easily. But this isn't, so…</p>\n<p>John pulls out a piece of paper and finds a pen cowering amongst the assorted piles on their kitchen table. He clears enough space to sit down and write, and starts making a possible list of motives.</p>\n<p> </p>\n<p> <em>1. Picking pockets.</em></p>\n<p>\n<em>2. Testing surveillance avoidance techniques a la Bond films.</em>\n</p>\n<p>\n<em>3. Testing public reactions. Testing how much of a stir it would cause, perhaps? Or gauging for levels of homophobia in specific areas of London? (But Sherlock would need to repeat performance in other areas for that to work.)</em>\n</p>\n<p>\n<em>4. Some kind of taunt against Mycroft? Childish, but not impossible for Sherlock. Maybe they were being followed? Was there a government case Sherlock was refusing?</em>\n</p>\n<p>\n<em>5. Giving Mrs Hudson something to gossip about. Possibly to distract her from the dark blue stain inside her teapot? (How did Sherlock stain it blue?)</em>\n</p>\n<p> </p>\n<p>There are a lot of thoughts that end with question marks. Too many for John to make an educated guess and none seem suitably surreal for a Sherlock-inspired experiment. But knowing Sherlock, any and all are possible.</p>\n<p>Sherlock likes to set up expectations and then defy them, so at the end, John adds:</p>\n<p> </p>\n<p>\n<em>6. Actual date caused by honest romantic interest.</em>\n</p>\n<p> </p>\n<p>It looks so ridiculous he considers scribbling through it. Or leave the page lying around for Sherlock to pick the correct answer.</p>\n<p>***</p>\n<p>At the clinic, he takes lunch at his desk and unfolds the page from his shirt pocket. Sherlock has a saying about the difference between impossible and improbable things, and if he really looks at the six items, they're all improbable but they're not actually impossible. Not that much is technically impossible for Sherlock Holmes anyway.</p>\n<p>What John wants is to come up with a seventh option. Something that makes sense.</p>\n<p>Failing that, he'd like a second opinion, which is harder than it sounds when it comes to Sherlock. Mostly Sherlock has a way of getting on people's bad sides. Take Sarah, for example. Nice, rational, sweet girl who experienced the most terrifying night of her life while Sherlock's name was bandied around. Her lack of warmth towards Sherlock is understandable but it also means John's not going to ask her opinion on this.</p>\n<p>Mrs Hudson has always thought they were living together, so that's no help. Lestrade knows they only share a flat but talking to Lestrade about any of this would be immensely awkward on both sides. Lestrade puts up with enough from Sherlock; John wouldn't go out of his way to make the poor bloke's job any harder.</p>\n<p>The only other person who knows Sherlock beyond the swirling coat and staggering intellect is…</p>\n<p>Mycroft.</p>\n<p>John has Mycroft's number.</p>\n<p>John also suspects that Sherlock's original description (most dangerous man you'll ever meet) isn't pure hyperbole so he's not going to call the man out of the blue and ask if he knows about Sherlock's romantic history and how to tell if his brother's actually trying to get a leg over.</p>\n<p>But it can't hurt to rule out a possibility on his list, right? He's pretty sure he's done stupider things in the name of being Sherlock's flatmate, friend and murder-solving colleague. He's stared down explosives and sharpshooters and been attacked by a trained, international assassin. This is almost the same.</p>\n<p>John pulls up the contacts on his mobile, closes his eyes for one deep breath and dials. It's answered on the first ring tone.</p>\n<p>\"Ah, John,\" Mycroft says in a voice like chilled cream (smooth and very, very cold). \"While it is always a pleasure, for the sake of expediency let me confirm that I have not spoken to Sherlock, nor offered him either advice or employment, since I last visited the two of you at 221<em>B</em>.\"</p>\n<p>As always, Mycroft stresses the 'B' in their address. John suspects he finds it insulting that any Holmes lives in a building divided by letters. Given that Mycroft's 'minor' governmental position allows him to live in an impressively large house overlooking Hyde Park (if Sherlock's walking tour can be believed), Sherlock's choice of income and living arrangements appear to be familial rebellion.</p>\n<p>John strikes a line through option four on his list, but before he can ask how Mycroft knows why he called, Mycroft says, \"I know Sherlock. I do not need to know the specific circumstances to know that you would only call me -- halfway through your lunch hour at the clinic, I believe -- to confirm Sherlock's latest round of theatrics were not a direct response to contact with me.\"</p>\n<p>John nods. He's on the phone, but he nods. Mycroft continues, \"My apologies for being impolite but I'm in the midst of a pressing matter. Do give my best to Sherlock,\" and then hangs up.</p>\n<p>John's entire role in that phone conversation was dialling. He didn't say a single word. Mycroft doesn't need a disembodied skull to talk to; he uses the people around him for that. John doesn't know if that makes him better or worse than Sherlock… He settles on deciding the entire Holmes family is more trouble than they're worth.</p>\n<p>He has ten minutes left of lunch, so he brings up the BBC news website. A pressing matter for Mycroft Holmes is probably something the media will never report because they'll never know about it, but he checks all the same.</p>\n<p>***</p>\n<p>John works an extra four hours for a sick colleague (Sarah had asked very nicely and bribed him with pizza) and finds the flat dark and deserted when he gets in. There's no sign of Sherlock -- the kitchen counters are still as clean as John left them -- so John goes straight upstairs.</p>\n<p>He opens his bedroom door, pulls his jacket off and hopes he'll remember his keys are in the pocket. He kicks off his shoes, lazily forcing them off without undoing the laces, and turns on the bedside lamp. He strips out of his jeans, pulls his jumper over his head and turns to get the t-shirt he sleeps in.</p>\n<p>He freezes with his hand under his pillow, his hand around the soft cotton of his t-shirt. On the other side of the bed -- not his side, and Sherlock probably knew that -- Sherlock is curled up on his side. He's wearing pyjama bottoms and a grey t-shirt, with his navy blue dressing gown over the top. With his back to the wall and knees tucked somewhere around his ribcage, arms loosely spread at seventy degree angles, Sherlock manages to take up space while looking like he really shouldn't. He's lying on top of the duvet, pale bare feet almost matching John's off-white linen (not his taste; present from Harry) and he seems to be asleep, as far as John can tell.</p>\n<p>John's used to surreal. Hunting contract killers through the underbelly of London is surreal. Self-censoring a blog to remove the all-to-frequent <em>'…and then they tried to shoot, strangle, suffocate and/or beat us to death…'</em> part is surreal. Coming home to find his flatmate curled up asleep on his bed, without invitation, is so far past surreal John can't deal with it right now.</p>\n<p>He pulls his t-shirt out. Gets changed and gets into bed. He's about to turn out the light when Sherlock says, \"Dr Nguyen finally succumbed to the stomach flu.\"</p>\n<p>His voice sounds rough with sleep but when John turns his head warily, Sherlock's eyes are as bright as ever. Everything John can think to say is either obvious or inane.</p>\n<p>Sherlock props himself up on one elbow and shuffles forward. \"You were supposed to be home three hours ago,\" he says, even though John worked four extra hours. Apparently, there was a scheduled delay for sixty minutes. Maybe it was a combination of weather patterns and train maintenance, or Sherlock had expected John to run errands.</p>\n<p>It's been a long day. John's not going to pick an argument he can't even win.</p>\n<p>Sherlock sits up, hair slightly crushed on the right side, and leans over John. John doesn't say anything as Sherlock gets closer, staring into his eyes like a leopard watches its prey, until he can feel Sherlock's warm breath on his skin and Sherlock's lips on his.</p>\n<p>Then John thinks: <em>Bollocks to this</em>.</p>\n<p>He's not just going to lie here while Sherlock does whatever he's trying to do. If he's going to be kissed for unknown motives -- without being told why, regardless of how patiently he's waited for that explanation -- he might as well enjoy it. If he's going to do it, he'll do it right.</p>\n<p>John gets a hand in Sherlock's hair, low on the curve of his skull, and pulls Sherlock closer. Holds him while John tilts his head and licks past sharp teeth. He feels Sherlock's sharp inhale of breath and doesn't let Sherlock go. He keeps it deep and wet and the good kind of dirty, the kind of kiss that means sweat and bodies and skin, panting and groaning and muffled swearing.</p>\n<p>Sherlock doesn't fight it. He closes his eyes, groaning somewhere low in his chest while his free hand grips John's good shoulder, squeezing sporadically.</p>\n<p>When John's almost dizzy with the need to breathe, he lets go.</p>\n<p>Sherlock pushes up, blinking down at John. In the low light, his eyes are dark and his lips are red and shiny. Breathlessly, Sherlock announces, \"This could have a better result than even I expected.\"</p>\n<p>\"Yeah, about that--\"</p>\n<p>Sherlock talks over him. \"No, this will be great.\" He leans down, kisses John again and... John's always been partial to kissing. He likes it and he likes twisting his fingers in Sherlock's messy hair, holding him still long enough for John to catch up, for John to reach up and press closer and hear Sherlock make that cut-off moan again.</p>\n<p>When they break for air, John has a hand around the back of Sherlock's neck and the other curled around Sherlock's hip, fingertips invading the warm skin hidden under his waistband. John needs to stop this now, while he can still think.</p>\n<p>\"What,\" John says with heartfelt feeling, \"the buggery <em>fuck</em>, Sherlock?\"</p>\n<p>Sherlock nods. \"That's the gist of it.\"</p>\n<p>For a moment, John had forgotten he's in bed -- in <em>bed</em>, a shrill, panicked voice in the back of his head wants to screech -- with an alien. An alien who has observed Earthling culture and learnt the language through some English-to-Holmesian dictionary, but really doesn't understand the point of any of it.</p>\n<p>\"Sherlock,\" John tries again. Calm, controlled. Staying aware of the situation and keeping casualties to a minimum. \"That is the fourth, well, fifth time you've kissed me. Why?\"</p>\n<p>Sherlock doesn't frown but he looks irritated. If he says they're wasting time on pointless explanations, John's going to kick him out of bed. \"It's a preliminary to sex.\"</p>\n<p>\"Okay.\" As far as answers go, that one is technically correct while offering no insight into Sherlock's motivations. Obfuscating with pure, factual truth isn't something that usually leads to a good shag. \"But why?\"</p>\n<p>Sherlock glances away, thinking. \"I'm not sure. I suspect it's the skin-on-skin intimacy while being fully clothed that makes it a logical step to sexual intercourse. Culture has imbued it with a certain invested emotional overtone but I believe that would be more conducive to establishing stable relationships,\" Sherlock says, as if relationships are just another feat of engineering held together by physics. \"But I doubt that's anything more than a contributing factor.\"</p>\n<p>Again, John reminds himself, alien. He really needs a copy of that English-to-Holmesian dictionary. \"Not why does kissing lead to sex. Why did you want to sleep with me?\"</p>\n<p>\"I hadn't factored on sleeping being involved. I only fell asleep because you were late.\"</p>\n<p>\"Stop avoiding the question!\" John flings his hands out to the ceiling. The ceiling doesn't help much. \"Either tell me why you're trying to sleep with me, specifically, or get out of my bed.\"</p>\n<p>Sherlock sits up, looking exceptionally irked as he glares down at John. \"You're being <em>purposely</em> obtuse.\" The way Sherlock says it, it sounds like the most scathing insult he knows.</p>\n<p>John watches him stalk out the door, and then rolls over defiantly.</p>\n<p>Over-exposure to Sherlock has either rotted his brain or his sanity. Logically, he knows he acted rationally, reasonably, asking the questions anyone in his situation would ask. He's annoyed at Sherlock but he should feel justified. He should feel like he's in the right.</p>\n<p>But that empty, hollow ache in the middle of his sternum, that's an unease he recognises easily. It's guilt. Hardly seems fair.</p>\n<p>***</p>\n<p>Sherlock's on the sofa, reading a faded blue textbook. Not sitting on it, because that would be too normal. No, Sherlock is lying on his back and holding the book above his head. His hips are near the footrest, his head's halfway up the second seat with the violin lying a little further up; his ridiculously long legs are bent up over the end of the sofa and his feet are flat on the floor.</p>\n<p>The sight of it makes John pause in the doorway. \"You look like a Cirque du Soleil performer enjoying a lie-down,\" John says.</p>\n<p>Sherlock doesn't look away from the three-inch thick textbook.</p>\n<p>\"Right,\" John says. Sherlock's been sulking all morning, making it ridiculously clear that he's not talking to John. \"I'm making toast. You want any?\"</p>\n<p>He doesn't expect an answer but he pauses a moment before heading into the kitchen.</p>\n<p>Sherlock sulks like Manchester United fans watch a match: obvious, obnoxious and surprisingly loud. There's less chanting involved, and pyjamas take the place of team colours, but every time John steps closer than the coffee table, Sherlock twists the bow of his violin and causes a noise that would make any footy hooligan proud.</p>\n<p>It's not as annoying as it should be. As long as Sherlock doesn't start playing with guns or explosives, the sulking fits and raging boredom don't bother John. John thinks it's the only way Sherlock knows how to show his frustration, like he skipped the formative teenage years of painful self-consciousness and mortification, and never learned that growing up meant learning to grin and bear it, doing things you didn't want to do because you had to.</p>\n<p>Sherlock accepts the term 'genius' as an accurate self-description and he's amazing at what he does, but when he's bored he reverts to a spoilt brat. In many ways, he's a brilliant man with the emotional and social skills of a nine-year-old.</p>\n<p>Truth be told, John finds it secretly endearing. (He'll never say it, though. No point encouraging bad behaviour.) It's so ridiculous John has to work hard not to let the amusement show.</p>\n<p>He butters two extra pieces and gets a second plate. Sherlock eyes him as he puts it on the coffee table, and reaches an arm over his head for the violin.</p>\n<p>John can take a hint.</p>\n<p>***</p>\n<p>John goes for a walk, leaving Sherlock aggressively reading on the couch. He wanders through the streets, enjoying the summer warmth on his face. It's mild compared to the scorching heat of Afghanistan, and so strange that he misses the too hot sun and the incremental creep of sunburn. When he was there, he didn't think he'd miss anything when he finally got home.</p>\n<p>Mostly, he wonders how he could be purposely obtuse when he genuinely has no idea what's going on in his own flat. He loops around past the station and back, ignoring his path until he's almost home again.</p>\n<p>He pulls out his mobile and calls Sarah in case the clinic needs another body.</p>\n<p>\"No, thank you,\" she says warmly. \"I called in Steven so we've got a full staff.\"</p>\n<p>\"Well, if you need me,\" John says, a little disappointed that he's lost a valid excuse to avoid Sherlock for a few hours. \"You've got my number.\"</p>\n<p>\"Thanks.\"</p>\n<p>It's something Sherlock almost never says, John thinks as he shoves his phone back into his pocket. The little things like thank you and please, those manners seem unimportant to Sherlock. Like explaining his thought processes to other people or showing his workings. It's all boring detail Sherlock disdains and avoids.</p>\n<p>But those boring details are necessary in John's life.</p>\n<p>He heads straight up to the living room, marches over to the sofa and grabs at the violin. Sherlock reaches one hand up, gets his fingers around the curve of the body, but it's a bad angle and John only has to lean back to jerk it away from Sherlock.</p>\n<p>Sherlock quickly sits up, swinging his legs around and glaring. \"That's mine,\" he says, voice low and offended.</p>\n<p>\"Nice to know you haven't lost the ability to speak. I was starting to wonder,\" John says, placing the violin on the armchair. Sherlock's still sitting upright, watching John, waiting for him to go away so Sherlock can sulk in peace.</p>\n<p>Sherlock sneers unattractively. \"She's seeing her ex, you know.\"</p>\n<p>It takes John the seven steps back to the coffee table to work out whom Sherlock means. Not Donovan because she's still with Anderson. Not Harry because Harry would have told him if Clara was back. Not Mrs Hudson, because Sherlock likes Mrs Hudson and wouldn't use her in a fight.</p>\n<p>\"Sarah?\" John asks. He thinks about the way she went out for lunch last week, excited to go and a little awkward when she mentioned she was seeing an old friend. \"I thought something was going on.\"</p>\n<p>\"The last sixteen days, as far as I can tell.\"</p>\n<p>Normally, John would ask how Sherlock knows but Sherlock might be using Sarah as a distraction. He has something else he wants to ask.</p>\n<p>John walks around the coffee table and sits on it, directly opposite Sherlock, his legs to either side of Sherlock's long, sharply bent legs. He plants his elbows on his knees, interlocks his fingers and thinks if Sherlock tries to storm away this time, John can tackle him back to the couch until he gets an answer.</p>\n<p>\"Last night,\" John says and Sherlock's eyes narrow dangerously, \"you said I was being obtuse. What am I missing?\"</p>\n<p>Sherlock's silent. He's underestimating John. John's had years in the army to learn how to sit and wait, even when you're not entirely sure what you're doing or why you're here.</p>\n<p>Finally, Sherlock sighs. \"Do you know how many experiments are repeated? How many theories are proved wrong, time and time again? It's hardly a scientific failing for an early hypothesis to be incorrect.\"</p>\n<p>\"Okay,\" John says slowly. What he really means is: that doesn't help at all. Talking to Sherlock shouldn't feel like an oral examination, but it does. \"This hypothesis, what are the underlying assumptions?\"</p>\n<p>Leaning back on the sofa, Sherlock drops his head back and closes his eyes. He waves his hand around loosely as he recites, \"You are the least annoying person I've met. You come from a middle-class family without unusual rates of insanity or criminality. You have a university education. While your current job is not lucratively paid, you are a doctor, implying personal qualities of caring about others and the social status connected to the profession. You were an army doctor, which is both heroic and self-sacrificing without the violent overtones the public associates with soldiers. Now that you're wounded, there's no danger of you returning to the warzone. Do I need to continue?\"</p>\n<p>John has no idea what this means, or why Sherlock considered his background an important assumption so he says, \"Yes.\"</p>\n<p>\"You say people need help connecting the dots. This is not pointing out the dots, this is dragging you through each stage myself,\" Sherlock complains. Then he sighs and closes his eyes again. \"You are reliable, responsible and considerate. You are respectful, intelligent and have a sense of humour most would find appealing. You are not unattractive.\"</p>\n<p>John snorts. \"Not unattractive? I feel so flattered.\"</p>\n<p>\"These are facts, John. I am not in the habit of wasting time on pointless flattery.\" Sherlock gives him an unamused glare, and then adds, \"Also, while you're not particularly young, you have no prior marriage or children which would financially and emotionally burden a new relationship.\"</p>\n<p>\"So you're saying,\" John says carefully, slowly, because he's really not sure Sherlock's saying it at all, \"I'm a catch?\"</p>\n<p>\"For a single woman your age, you would be an appealing prospective husband.\" The way Sherlock says it makes it sound so distant, so theoretical. As if others might find John attractive but Sherlock was more interested in testing a theory.</p>\n<p>\"So how does this lead to you kissing me?\" John asks, and Sherlock's brows immediately lower into annoyance. \"I'm not being difficult. I genuinely don't understand, Sherlock. Explain.\"</p>\n<p>\"You talk fondly of your childhood.\"</p>\n<p>Sherlock's change in direction is enough to give anyone whiplash, John thinks. \"What?\"</p>\n<p>\"You grew up in Kent and talk very fondly of being a child, implying that when you have children of your own, the childhood you envision for them won't include London.\"</p>\n<p>John still feels like he's missing something but he can put most of it together. It's nuts. Absolutely barking mad. Then again, this is Sherlock. \"You kissed me to stop me getting married, having children and moving to the countryside?\"</p>\n<p>\"It would be detrimental to my work.\" Sherlock reaches past John for a slice of now-cold toast. \"But it's a working hypothesis. I'll find the correct approach.\"</p>\n<p>As far as John's concerned, the correct approach here is to get up, find his keys and go down to the local pub to watch whichever team is playing. A pint of Guinness would help, too.</p>\n<p>***</p>\n<p>On his table, there's one empty glass and one half-full. On the telly, there's a repeat of last weekend's game and Chelsea is about to be thrashed two-nil. John has an opened packet of crisps and he's absolutely not thinking about Sherlock.</p>\n<p>He's not thinking about Sherlock staying in bed waiting for him last night, curled up on the wrong side of the duvet and prepared to waste hours, to stay as long as it took for John to get home.</p>\n<p>He's not thinking about how this all started with Sherlock shopping and kissing him in the kitchen like it was something they did all the time.</p>\n<p>And he's definitely not thinking about Sherlock and his wrong approach. Sherlock described him as London's most eligible bachelor and that's not how John feels. Between nightmares and scar tissue and the constant threat of poverty, John doubts he'd be high on anyone's Must Marry list. Not that that's something Sherlock understands.</p>\n<p>Clearly.</p>\n<p>John doesn't understand how someone so bright can be so dim. John isn't dashing off to join the circus; he isn't even seeing anyone seriously. Sherlock's worrying about something that hasn't happened yet and might not happen at all.</p>\n<p>On the screen, Manchester United score a goal and the crowd cheers. John takes a drink and tries to focus on the game.</p>\n<p>He's not here to think about Sherlock. He's not here to think about the low sounds Sherlock made when they kissed in John's bed, or the sweetness of an early morning kiss mixed with the rising scent of hot tea. He should have known Sherlock would do this wrong, that Sherlock wouldn't kiss him for any of the reasons John wants him to.</p>\n<p>Oh.</p>\n<p>John lets his forehead drop to the table.</p>\n<p>Why couldn't he have had that thought last night? He lives with one of the world's most observant people. How could he possibly be so oblivious, so self-delusional? Oh, yeah, he was fine with letting Sherlock randomly kiss him as a secret experiment. Any other weird experiments Sherlock wants to perform -- human eyeballs in the microwave or painting a target on a sheet, hanging it against the wall and throwing various objects against it to measure the indentation left in the plasterboard -- John interferes. John stops them. He puts his foot down and gives Sherlock limits.</p>\n<p>But he stood back and let Sherlock kiss him and didn't for one moment think it was because he wanted Sherlock to.</p>\n<p>John would feel like the world's biggest idiot but he's not the one kissing a co-worker to keep them working with him. Oh, no, he's just the idiot who fell for the world's biggest idiot.</p>\n<p>To his left, the barman calls out, \"All right there, mate?\" and John's first reaction is to groan. Then he pulls his head off the table. His hair probably smells like stale beer now.</p>\n<p>The barman gives him a funny look, as if he's trying to work out how much John's had to drink. Whatever he sees makes him ask, \"Bird troubles?\"</p>\n<p>\"Guy troubles,\" John replies.</p>\n<p>The barman nods towards John's half empty glass. \"Want another?\"</p>\n<p>\"Please.\"</p>\n<p>***</p>\n<p>When he gets back, Sherlock is lying on the couch, praying to the ceiling. He's dressed in dark suit and pale blue shirt, and for a moment, John hopes for a reprieve. \"Do we have a case?\"</p>\n<p>\"No,\" Sherlock says, keeping his eyes closed. It always makes him look as if he's literally meditating on a problem. John's never asked so he doesn't know if it's some odd Zen pose or if Sherlock simply likes to press his palms together when he thinks, likes having something to do with his hands when he can't smoke.</p>\n<p>\"Still thinking about how to stop me leaving?\" John asks, fairly sure he already knows the answer.</p>\n<p>\"It should have worked but it didn't.\" Sherlock looks over at John, eyes flicking up and down before he looks back at the ceiling. \"There must have been a flaw in my reasoning.\"</p>\n<p>\"How many patches?\"</p>\n<p>\"Only one.\" Sherlock pulls up the sleeve of his shirt as proof. On the pale, soft skin of his inner wrist, the adhesive plastic looks more apricot than skin-toned. \"Less urgency than a case. A more distant deadline.\"</p>\n<p>John shifts his weight and wishes there was a chair closer to the couch. The chairs are too far away for a conversation like this and he'd rather not perch on the coffee table again. He settles for the pulling the desk chair around and sitting down. \"Maybe it would help if you talked it through?\"</p>\n<p>\"I doubt it,\" Sherlock says, but he looks over at John. \"From what I know about you, it should have been the perfect solution.\"</p>\n<p>\"Maybe your assumptions were wrong. Maybe you overlooked certain facts.\"</p>\n<p>\"Like?\"</p>\n<p>John swallows past his own discomfort, resists the urge to press against his bad leg. \"Like the fact that I still have nightmares about combat and I don't sleep the whole night through. I have a shoulder that aches when it's cold and damp, which in London is all winter, and a psychosomatic limp.\"</p>\n<p>\"You don't limp now,\" Sherlock says, closing his eyes.</p>\n<p>\"At the clinic when I'm tired. Not around you.\" John shrugs. It's stupid and embarrassing, but he's spotted the pattern. \"I think my subconscious knows you're smarter than it. If it tried that around you, you'd find a way to outwit it and beat it into submission.\"</p>\n<p>\"Or it could be that you're bored at the clinic and discomforted by the normalcy of it, everyday people and their dull little everyday lives filled with coughs, colds and certificates for work,\" Sherlock recites and John wonders if Sherlock already knew about this. Be typical, wouldn't it? The only things Sherlock doesn't know about John are the things John himself doesn't know, and even then, he still figures them out first. \"You feel out of place, and the limp is a physical manifestation of that.\"</p>\n<p>\"It pays the bills,\" John says, defensive despite the fact that Sherlock's partly right. Not always, not all the time, but there are certainly moments when he looks at the blinding white walls and perfectly sterile equipment and wonders how he's supposed to do this after the gritty sand and make-do necessity of Afghanistan. Other times, he likes it; likes coffee breaks with Sarah and saying good morning to people by name, and helping people get through their dull, everyday, quietly happy lives.</p>\n<p>\"Unnecessary,\" Sherlock says. Apparently, the need to pay bills is only something that applies to ordinary, boring people.</p>\n<p>\"Secondly, while women might talk about marrying a doctor, they mean the specialist who drives a BMW and holidays in the Alps. They don't mean the guy in his mid-thirties with a soldier's pension who needs a flatmate to live in London and uses his sister's hand-me-down phone.\"</p>\n<p>\"Irrelevant.\"</p>\n<p>\"It's really not,\" John says, pulling a face.</p>\n<p>\"A woman merely looking for financial security and material comfort would not consider you in the first place. Clearly, not everyone considers economic gain before entering marriage,\" Sherlock says. He interlocks his fingers and twists them, turning his wrists. \"If that's the level of your reasoning, this process might be more productive without your input.\"</p>\n<p>John ignores the dismissal in Sherlock's tone. Dealing with Sherlock requires a thick skin. \"What made you think that kissing me would stop me getting married?\"</p>\n<p>\"Your sweater.\"</p>\n<p>John looks down at the brown cardigan he's currently wearing. He's fairly sure cardigans aren't an invitation to be kissed but maybe he's wrong. \"My sweater?\"</p>\n<p>\"Not that particular one,\" Sherlock replies, irritated that the entire world can't follow his every uttered thought. \"The one you wore when we first looked at the flat. Oatmeal coloured, round-necked, Aran sweater. The colouring doesn't suit you, the shape itself is not flattering, but from the quality it was expensive. It was a gift someone bought for you. You could go out and buy another but it's warm and practical, so you wear it. It's convenience.\"</p>\n<p>\"You think I'm too lazy to walk down the shop and buy myself a nicer jumper?\"</p>\n<p>\"Not lazy, per se. Simply that the effort expended to purchase another isn't necessary when you already have a sweater that keeps you warm and does not require effort.\"</p>\n<p>In a burst of clarity, John gets it. He nearly laughs. \"You were being convenient. You went shopping, you got Mrs Hudson to make me tea. You were waiting in my bed. You were making yourself the convenient option. If I'm too much of a lazy sod to go buy a new jumper, I'm too lazy to date other people when I've got sex on demand at home.\"</p>\n<p>\"It should have worked,\" Sherlock says with a frown that's almost a pout. \"I made it quite clear that it required no change on your part, that it would simply fit into our established patterns. There shouldn't have been a problem.\"</p>\n<p>\"But I asked why, which doesn't work with the path of least resistance approach to sex,\" John says, thinking back to Sherlock's offended reaction. He'd carefully thought through a plan, put it into motion, and at the last minute, John objected and acted in a way he shouldn't. Sherlock was frustrated that his scheme was unsuccessful. \"You should have asked me about the jumper.\"</p>\n<p>\"Really?\" Sherlock's eyes narrow. \"Why?\"</p>\n<p>There's something breathtaking about having Sherlock's undivided attention, Sherlock watching him like he's a puzzle to be solved. It makes something clench in John's chest, gives a shot of adrenalin that makes him grin and walk into insane situations. \"It's not convenience. When I was deployed, I'd call mum when I could, every few weeks or so. I'd tell her I was fine and complain about the food and the weather. I mean, you can't complain about watching a twenty-year-old kid bleed out while you're under heavy fire or the career soldier you're sending home with one leg and burns to thirty percent of his body. You don't want people to worry. So you talk about the weather.\"</p>\n<p>Sherlock's still as marble, watching him and listening to every word. John could get used to that attention so easily. \"We're not a family of letter-writers so I never got post. But one day, I got a parcel from home. A thick jumper for the freezing nights, a colour that wouldn't be seen against the sand. The army doesn't have casual-dress Fridays so I didn't wear it. But it was a piece of home, a reminder of people who cared if I lived or died. That's why I keep it.\"</p>\n<p>\"There's always something,\" Sherlock says with soft regret. He closes his eyes and lets out a sigh. \"It's so hard to be right about all the details.\"</p>\n<p>John feels himself smile. \"Does it make a difference?\"</p>\n<p>\"It says a great deal about what you consider worth keeping in your life. Emotional attachment is vastly different to convenience.\" Sherlock sits up, nodding to himself and swinging his legs around. \"I should have focused on Sarah.\"</p>\n<p>\"Excuse me?\"</p>\n<p>\"It's perfectly logical, John. If emotional attachment is the main concern, then it's best to encourage an attachment to someone who grew up in London and has a vested interest in staying. Sarah takes personal pride in running the clinic and loves the city. While she has little personal fondness for me, she considers my work important and probably believes that you will save lives by helping me.\"</p>\n<p>John feels like his brain is stuck in neutral. There are only so many sudden switches he can take in a day. \"Sherlock?\"</p>\n<p>\"You enjoy the danger of what we do. It stands to reason that as long as you were in London, you would find an excuse to be involved,\" Sherlock says, hands moving fast as the thoughts come quicker. \"If you had a spouse that supported this and didn't require you lying about where you were and what you were doing, you'd still be involved in the cases. I was too short-sighted, too focused on keeping you <em>here</em>, I should have known--\"</p>\n<p>\"Sherlock!\" John interrupts, and Sherlock blinks, pulling himself back and remembering someone else is here. \"Sarah's seeing someone else, remember?\"</p>\n<p>Sherlock waves that thought away with one hand. \"We can deal with that. Romances with ex-lovers are notoriously fragile.\"</p>\n<p>\"You can't break up Sarah's relationship to set me up with her,\" John says, and Sherlock snorts. \"Well, obviously, you probably could but I'm telling you not to. Please.\"</p>\n<p>\"It's the most logical solution, John.\"</p>\n<p>\"How about...\" John walks over to the sofa, sits on the vacant cushion. \"Just ask me to stay.\"</p>\n<p>\"It's a very short-term answer,\" Sherlock says, turning towards John. \"People stay as long as there is personal incentive for them. My expressed wish for you to stay would only influence your decisions until a more pressing emotional connection was formed with someone else.\"</p>\n<p>\"Maybe you should man up,\" John hears himself say. \"Maybe you should be the one I form an emotional connection with.\"</p>\n<p>There's a breathy huff of laughter and then Sherlock freezes, head turned to John. \"That wasn't a joke,\" he announces slowly.</p>\n<p>Sherlock looks surprised, like before his eyes a penguin just turned pink and started singing Ave Maria. John doesn't miss the quick glance Sherlock shoots down at the arm with the nicotine patch, the split-second he takes to remind himself he's clean.</p>\n<p>\"I'm serious.\"</p>\n<p>\"John, I'm not--\" Sherlock starts, and then, \"There are many reasons--\" and finally, \"That's completely irrational.\"</p>\n<p>\"You like me,\" John replies. \"You think I'm the least annoying person in London.\"</p>\n<p>\"I said the least annoying person I'd met. I really can't speak for the entire Greater London area.\" Sherlock frowns and adds, \"I simply meant that I endure your company more easily than anyone else's. It wasn't a vow of undying adoration.\"</p>\n<p>\"And yet, you're sitting here concocting schemes to make me stay,\" John says, high on the impossibility of it all. \"Let's make this easy. I like you and I'd be fine with kissing you on a regular basis. So tell me you like me and you want me to stay, and then kiss me.\"</p>\n<p>\"I think you're oversimplifying matters,\" Sherlock says but he doesn't sound unhappy about it. More… cautious.</p>\n<p>\"You just like everything being so complex you're the only one who can figure it out,\" John replies easily. \"Try it. Worst that happens, you can go back to your Machiavellian plots.\"</p>\n<p>\"Niccolo Machiavelli would approve of a slight amount of deception for the greater good of all, but that's not what most people mean when they say Machiavellian.\"</p>\n<p>\"You're stalling,\" John teases.</p>\n<p>Sherlock looks as if he's not sure if he should smile or not, but he wants to. \"I'm thinking.\"</p>\n<p>\"Any time now.\"</p>\n<p>\"I spend more time with you than I ever anticipated spending with a flatmate and despite all facts that should suggest otherwise, I find myself…\" Sherlock takes a deep breath, shaking his head. Then he meets John's eyes, leans forward and says, \"I like you. Stay,\" and kisses John softly.</p>\n<p>That's the sixth time Sherlock kisses him. After that, John stops counting.</p>"
}