{
  "id": "11770692",
  "url": "https://archiveofourown.org/works/11770692?view_full_work=true",
  "author": [
    "crunchrapsupreme"
  ],
  "title": "one to ten",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
  ],
  "relationships": [
    "Bakugou Katsuki/Kirishima Eijirou"
  ],
  "characters": [
    "Bakugou Katsuki",
    "Kirishima Eijirou",
    "Kaminari Denki"
  ],
  "additional_tags": [
    "Fluff",
    "Friends to Lovers",
    "Crushes",
    "Pining",
    "its soft. yet again. soft is my Brand okay",
    "Kissing",
    "Cats",
    "Confessions"
  ],
  "language": "English",
  "series": "",
  "published": "2017-08-11",
  "completed": null,
  "words": "7,407",
  "chapters": "1/1",
  "comments": "317",
  "kudos": "17,266",
  "bookmarks": "2,500",
  "hits": "88,761",
  "summary": "<p>Kirishima attempts to climb the ladder of success and weasel his way into Bakugou Katsuki's explosive little heart.</p>\n<p>Step one? He has to get to level <i>ten</i>.</p>",
  "notes": "<p>uhhh this is gay and self indulgent. i wasnt gonna post this cause i mostly just word vomited it out, but i decided fuck it why not. </p>\n<p>i just rly like pining kiri ok</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>i have a <a href=\"https://twitter.com/wecametofuck\" rel=\"nofollow\">twitter</a> ayee</p>",
  "text": "<p>“Hey,” Kirishima says, poking Kaminari with the tip of his pencil. “d’ya think if I asked him on a date, he’d say yes?”</p>\n<p>“Probably not.”</p>\n<p>“You don’t even know who I’m talking about!”</p>\n<p>Kaminari looks up from the worksheet he’s struggling to complete, and he raises an eyebrow. “Bakugou.”</p>\n<p>Kirishima bristles. “Well, I mean - <em> objectively - ” </em></p>\n<p>“I bet he’s never even been on a date in his life,” Kaminari says, rolling his eyes. “Anyways, it’s <em> your </em> death wish, dude.”</p>\n<p>“Hey, he totally wouldn’t explode me if I asked him out!” Kirishima hisses, eyes darting up just in case anyone else happened to be listening to their conversation. “Uh, right?”</p>\n<p>“Are you guys even <em> friends </em>?” Kaminari sighs. “Like, I feel like that would be a better first step to take here. Friendship.”</p>\n<p>“Dude, Bakugou is totally my friend,” Kirishima says, and then he stands up from his chair, waving obnoxiously over at Bakugou a few desks over, staring intently at his own worksheet. “Hey, hey, Bakugou!”</p>\n<p>Bakugou growls at the interruption, his head shooting up and red eyes landing on Kirishima.</p>\n<p>Kirishima grins warmly. “We’re friends, right?”</p>\n<p>Bakugou explodes the pencil in his hand. His eyes fall back onto his worksheet.</p>\n<p>Kirishima sits back down, rubbing his chin thoughtfully. “Okay, fair point,” he says to Kaminari. “Friends first?”</p>\n<p>Kaminari nods, albeit a bit nervously at the prospect. “Yeah, dude. Friends first.”</p>\n<p> </p>\n<p>--</p>\n<p> </p>\n<p>Becoming friends with Bakugou turns out to be a surprisingly hard task. He’s always the first one out of the classroom when Aizawa dismisses them, and he’s always the last to arrive in the morning, seconds before class even <em> starts </em> . It’s like he’s trying to get in as little social interaction as possible, get his work done as fast as possible, and spend the <em> least amount of time ever </em> in the vicinity of other people.</p>\n<p>Honestly, it’s a little amazing, how well Bakugou can evade his fellow students. Unless he’s provoked in some way, he tends to keep to himself.</p>\n<p>Though, in all actuality, he seems to be provoked quite a bit.</p>\n<p>“I’ll <em> kill you!” </em></p>\n<p>Todoroki raises an eyebrow when Bakugou overturns his own desk and explodes it halfway across the classroom. Aizawa is late - again - so the students are currently unsupervised.</p>\n<p>“Kacchan - c-calm down!” Midoriya frantically waves, somehow still feeling responsible for the reckless behavior of his childhood friend - enemy? Frenemy? Honestly, Kirishima has no clue what to call them.</p>\n<p>“Shut the <em> fuck </em> up,” Bakugou hisses at Midoriya. If Kirishima was smarter, he would stay completely out of it, but this could be a potential wasted friendship opportunity (how, he doesn’t know yet) so he waltzes over and crosses his arms over his chest.</p>\n<p>“Yo, what’s going on here?” Kirishima asks. Bakugou growls and Kirishima can see the way his palms spark.</p>\n<p>“Stay out of it, <em> shithead </em>.”</p>\n<p>Kirishima pouts. “So mean.”</p>\n<p>“I just asked him if he needed help on the homework,” Todoroki’s face is deadpan, but Kirishima <em> swears </em> he sees a smug glint in his eye. “It looked like he was struggling.”</p>\n<p>“Like <em> hell I was struggling, you half’n’half fuckmunch - </em>”</p>\n<p>“Hey, hey,” Kirishima says, gently, because that’s the kind of approach no one ever seems to take with Bakugou. It can’t hurt to try. “He didn’t mean it in a bad way, okay?”</p>\n<p>Todoroki is a sly motherfucker, and in reality, he <em> could’ve </em> meant it in a bad way, but still.</p>\n<p>Bakugou looks about ready to blow a damn fuse again, so Kirishima bites the inside of his cheek before reaching out and circling one of his twitching wrists. He holds it tightly in his hand (hardening himself just in case) but surprisingly….. It works?</p>\n<p>Bakugou freezes at the touch, mouth going a little slack, and for a hot second Kirishima thinks he broke him. Midoriya’s eyes are wide, darting between Kirishima and Bakugou, completely frozen as if one wrong move might set off a mine, but then Kirishima slowly takes his thumb, and presses it comfortingly against the bone of Bakugou’s wrist.</p>\n<p>Bakugou swallows, but then he’s yanking his hand back with too much force and stalking to the back of the classroom, plopping down in an unoccupied desk since he blew up his own.</p>\n<p>Midoriya is still staring slack-jawed at the empty space where Bakugou was, and Kirishima purses his lips and shrugs before walking back over to Kaminari and sitting down.</p>\n<p>“Dude what the hell?” Kaminari whispers. He looks over to Bakugou, who’s currently sitting in silence, eyebrows furrowed as he sinks further into his seat.</p>\n<p>“I dunno,” Kirishima says. “Do you think we’re friends now?”</p>\n<p>“No - well,” Kaminari furrows his eyebrows. “Maybe?”</p>\n<p>Kirishima grins.</p>\n<p> </p>\n<p>--</p>\n<p> </p>\n<p>Kirishima knows that Bakugou goes to the little market store around the corner almost everyday after school and gets a drink and an apple. He only knows this because Tooru’s cousin works there and she told him, snickering loudly like she <em> knew. </em></p>\n<p>Tooru probably knows every damn secret of their class.</p>\n<p>The chair of his desk squeaks when he stands up, taking a breath, and Kaminari shoots him a reluctant thumbs up for good luck. Kirishima nods in thanks before turning on his heel and stalking towards Bakugou’s desk. The blonde is currently shoving his books back in his bag, and when Kirishima skids to a stop next to him, Bakugou looks up with narrowed eyes.</p>\n<p>“What.”</p>\n<p>“Wanna do something?”</p>\n<p>“No.”</p>\n<p>“I’ll buy us drinks from the store!”</p>\n<p>“No.”</p>\n<p>Kirishima pouts. “But you’re going there anyways, right?”</p>\n<p>Bakugou glares. “How do you know that?”</p>\n<p>Kirishima flushes a bit. “Uh.”</p>\n<p>“Whatever,” Bakugou rolls his eyes. “You can come if you want, I don’t give a shit either way.”</p>\n<p>Kirishima grins, turning towards Kaminari and giving an eager thumbs up. Kaminari makes a lewd motion with his hands that has Kirisima choking on his tongue and grabbing Bakugou by the sleeve, dragging him out of the classroom.</p>\n<p>“Fucker - what the - <em> let me go </em>,” Bakugou yanks his arm free once they’re a good distance down the hall, headed towards the front doors of the school.  He eyes Kirishima hesitantly. “You’re so fuckin’ weird.”</p>\n<p>The sun is shining, the air is clear, Kirishima is <em> hanging out with Bakugou </em>. It’s a good day, and so Kirishima just grins and shoves his hands into his pockets, bumping shoulders with the blonde next to him.</p>\n<p>Bakugou growls and tries to trip him.</p>\n<p>Yeah, this is totally a step in the right direction. Something is blossoming, okay, Kirishima can <em> feel it </em>.</p>\n<p>“On a scale of one to ten, how close are we as friends?” Kirishima asks, kicking a pebble as they wander down the sidewalk.</p>\n<p>Bakugou grunts. “Negative four.”</p>\n<p>“Aw, c’mon,” Kirishima whines. “Seriously?”</p>\n<p>Bakugou just shrugs and  hunches in on himself. Kirishima at this point is used to his outbursts and exclamations, so it’s his silences that are always super surprising. Kirishima takes this time to observe, taking in the way the sun hits Bakugou’s blonde hair and makes it look lighter than it really is. The slope of his nose curves down, and his brows are furrowed like he wants to say something but can’t think of the right words. It’s warm out, and there’s a light sheen of sweat on his face. When he wipes his forehead with his sleeve, Kirishima swallows.</p>\n<p>Fuck.</p>\n<p>Bakugou shoves the door open when they get to the store, and Kirishima darts in behind him before the door closes on his face.</p>\n<p>“Oh god,” Kirishima moans when the air conditioned air hits his face. “It’s so <em> hot </em> out today.”</p>\n<p>Bakugou’s already over at the cooler, grabbing a melon soda and then an apple from the basket on the counter, and Kirishima makes a noise before scrambling over and shoving himself in front of Bakugou.</p>\n<p>“It’s on me!” He exclaims to the girl working the register, grabbing a few crumpled up bills from his pocket and slamming them on the counter.</p>\n<p>“The fuck, shitty-hair?” Bakugou hisses.</p>\n<p>“I’m paying,” Kirishima says, putting his hands on his hips and beaming widely.</p>\n<p>“<em> Why?” </em> Bakugou growls. “I don’t need your money, I can pay for my own damn self.”</p>\n<p>“I know,” Kirishima says, “But that’s what friends do! They do nice things for each other.”</p>\n<p>And then Kirishima rocks on his heels, leaning a bit closer. “And if I’m gonna move my rank up from negative four, I have to step it up!”</p>\n<p>Kirishima’s fully expecting Bakugou to grab his money back from the cashier and blow it up in his palm, but what Kirishima’s <em>not</em> expecting is for Bakugou to turn red and purse his lips. He clenches his hands into fists, and then grabs his items and storms out of the store.</p>\n<p>“See you tomorrow at school!” Kirishima calls out with a wave.</p>\n<p>“Here’s your change,” the cashier says, and Kirishima turns to her with a smile.</p>\n<p>“Thanks!”</p>\n<p>She nods towards the door curiously. “Negative four?”</p>\n<p>Kirishima sighs and leans on the counter, propping his chin in his palm. “I’d say we’re at least a five. Maybe even a six, after today.”</p>\n<p>“O - kay,” the girls says slowly, popping her gum. “Well, good luck with that.”</p>\n<p>Kirishima salutes her before grabbing his change and darting out of the store. Progress has been made today. He can’t wait to tell Kaminari.</p>\n<p> </p>\n<p>--</p>\n<p> </p>\n<p>“Did you know,” Kirishima sighs happily, “that Bakugou’s ears turn red when he blushes?”</p>\n<p>“Gross,” Kaminari says, digging around in his locker. “I didn’t even know Bakugou <em> could </em>blush. He’s capable of human emotions? Shocking.”</p>\n<p>“I bought him a drink yesterday after school and I thought for sure he’d throw a fit, but he just kinda.... went quiet and then ran away?”</p>\n<p>“Sounds like a preteen girl with a crush,” Kaminari snorts. Kirishima perks up.</p>\n<p>“Oh man, d’you think he <em> likes me? </em>”</p>\n<p>“I don’t think Bakugou likes anyone,” Kaminari says, hitching his bag higher on his shoulder as they head towards class.</p>\n<p>“That’s not true,” Kirishima says. “I saw him petting a stray cat the other day by the gym.”</p>\n<p>“That doesn’t - wait, seriously? No fuckin’ way.” Kaminari looks interested now, as if the thought of Bakugou showing compassion to <em> anything </em> is worthy to contemplate. Let alone a <em> cat </em> . If anything, Bakugou comes across as a dog person, through and through. But Kirishima saw through the window last week (he was stuck behind taking a makeup test) and Bakugou was <em> totally </em> coddling an orange tabby. His back was turned, so Kirishima couldn’t see his face, but the lines of his body were relaxed without their usual tension.</p>\n<p>“He’s an animal lover, it’s so <em> cute </em>,” Kirishima coos as they walk into the classroom.</p>\n<p>“Who’s an animal lover?” Ashido pipes up, hopping over her desk and seating herself across from Kirishima and Kaminari.</p>\n<p>“Bakugou, apparently,” Kaminari says, rolling his eyes.</p>\n<p>“The <em> fuck </em> are you guys talking about?”</p>\n<p>Bakugou must’ve just walked in and heard his name, and he stalks over to them with his arms crossed. Kirishima, Ashido, and Kaminari look up at him blankly, but then Ashido grins.</p>\n<p>“You.”</p>\n<p>“Yeah, Kirishima says you’re an animal lover!”</p>\n<p>“The fuck I am,” Bakugou scoffs,  but there’s a nervous tick to his fingers as they tap at his arm. “Stop fuckin’ gossiping and get out of my seat, alien bitch.”</p>\n<p>“He’s totally a cat person,” Kirishima whispers to his friends.</p>\n<p>Bakugou blows up his desk. Again.</p>\n<p>Aizawa gives all four of them detention, but it was <em> totally </em>worth it.</p>\n<p> </p>\n<p>--</p>\n<p> </p>\n<p>They’ve been going to the store after class together for a few weeks now, and Bakugou usually begrudgingly lets him tag along. He’s stopped letting Kirishima pay for his things (“Okay, fucking fine! You’re not at negative four anymore, you douche face! Stop fucking <em> buying me shit!” </em>) but he doesn’t protest when Kirishima asks for a sip of his soda, so. That’s something.</p>\n<p>Normally, Bakugou stomps off without saying a word once they get back to the dorms, and Kirishima usually texts Kaminari to meet him in the common room to fuck around, but today, Bakugou throws a glance over his shoulder impatiently as he’s about to head inside the doors of the dormitories.</p>\n<p>“Well?” he asks, tapping his foot. “Are you fucking coming, or not?”</p>\n<p>“Am I - ” Kirishima asks, confused, but then his eyes widen because <em> oh </em> . Bakugou is <em> asking him to come up to his dorm room </em>. Holy shit, yes. “I’m coming!”</p>\n<p>“Hurry the fuck up, then,” Bakugou grumbles, but his voice sounds softer than usual.</p>\n<p>Kirishima scrambles after him happily.</p>\n<p>When Bakugou opens the door to his room, Kirishima’s not expecting the intense cloud of lavender scent to wash over him. He inhales deeply, and when he spots a small little machine near the corner on his desk, whirring quietly, he immediately goes over to it and bends down to inspect further.</p>\n<p>“Oh, yeah, just make yourself at fuckin’ home then, I guess,” Bakugou grunts sarcastically, shutting the door and toeing his shoes off.</p>\n<p>“Aromatherapy?” Kirishima asks, turning towards Bakugou and raising an eyebrow.</p>\n<p>Bakugou shrugs, loosening his tie. “I get nightmares. It helps.”</p>\n<p><em> Oh, right </em>, Kirishima thinks. Bakugou doesn’t talk about what happened to him, not to anyone, but Kirishima can’t help but shiver thinking about what the other teen has been through. Bakugou’s strong, stronger than most of them for sure, but he’s still just a student. He’s not unbreakable completely, no matter how hard he tries to be.</p>\n<p>Bakugou’s words are said with confidence though, as if he’s testing Kirishima or something.</p>\n<p>Kirishima hums. “It smells really nice.”</p>\n<p>“Of course it does, you dumbshit,” he grumbles, glancing down, and Kirishima grins with glee as he notices the other boy’s ears turning pink. “Anyways, you have your school books and shit, right?”</p>\n<p>“Uh, yeah, right here?” Kirishima says, patting his backpack lightly.</p>\n<p>Bakugou settles on the floor, taking his tie off completely and tossing it onto his unmade bed. “C’mon, sit down and get your shit out.”</p>\n<p>Kirishima blinks, and his lips part in surprise. “Wait - are you… are you gonna <em> help me </em> with my homework?”</p>\n<p>Bakugou rolls his eyes. “I know for a fact you haven’t even fuckin’ <em> started </em>on the worksheet due tomorrow, you irresponsible dickhead. Sit the fuck down.”</p>\n<p>“Oh man, we’re at <em> least </em> at a five out of ten now, right?” Kirishima exclaims, scooting closer to Bakugou as he pulls out his books and a pencil. Helping someone with their homework is like, five notches up on the friendship scale. Kirishima knows this as fact because only close friends will sacrifice their free time for a cause such as this.</p>\n<p>Bakugou scowls. “Fuck off. We’re barely at zero.”</p>\n<p>“A four, then?”</p>\n<p>“<em> Zero </em>,” He hisses. “What the fuck, this stupid scale is complete bullshit, you goddamned airhead.”</p>\n<p>“We’re <em> definitely </em>pushing level four.”</p>\n<p>Bakugou glares. “We’re at a <em> three </em>.”</p>\n<p>Kirishima fist pumps the air. “I’ll take it!”</p>\n<p>Bakugou rolls his eyes, but the corner of his lips twitch upward. Kirishima counts it as a win.</p>\n<p> </p>\n<p>--</p>\n<p> </p>\n<p>“Do you think he’d say yes if I asked him out now?” Kirishima asks as he picks at his lunch. He doesn’t know where Bakugou goes during lunch, and he hasn’t asked. It’s cool. He doesn’t want to overwhelm Bakugou and get knocked back down to zero on the scale.</p>\n<p>“Depends,” Kaminari says, stealing a bite of rice from Kirishima’s lunch. “How high are you on the scale?”</p>\n<p>“Bakugou says we’re a three,” Kirishima says. “But I think we’re definitely at at least a five?”</p>\n<p>“You gotta get to nine on the scale before you ask him out,” Kaminari says matter-of-factly. “Maybe even a ten? I dunno, Bakugou seems like a tough one to crack.”</p>\n<p>“Scale? What scale?”</p>\n<p>Kirishima looks up when Midoriya and Uraraka sit down across from them at the table.</p>\n<p>“The friendship scale!’ Kirishima says.</p>\n<p>Midoriya furrows his brow. “Friendship has a scale?”</p>\n<p>“That sounds silly,” Uraraka says. “Friendship isn’t determined by a <em> scale </em>.”</p>\n<p>“Sure it is!” Kaminari argues. “Look, it’s just like the hotness scale, but - ”</p>\n<p>“There’s a <em> hotness scale?!” </em>Midoriya exclaims, eyes widening.  He looks pale.</p>\n<p>“Not the point, but yes,” Kaminari says, nodding. “Anyways, Kirishima and I? We’re at like, a level twelve on the friendship scale.”</p>\n<p>“Twelve out of ten,” Kirishima nods solemnly. “The truest of bros.”</p>\n<p>“My ride or die.” Kaminari adds, slinging an arm around Kirishima’s shoulder.</p>\n<p>“Okay,” Uraraka says slowly, taking a bite of her food. “What does this have to do with Bakugou, then?”</p>\n<p>“Kirishima is trying to work his way up Bakugou’s scale, so he can then work his way into his - ”</p>\n<p>Kirishima flushes and slaps a hand over Kaminari’s mouth. “Haha, uh. What he’s trying to say, is - ”</p>\n<p>“Oh, I get it,” Uraraka says, smiling. “Deku, it’s like you and Todoroki, right? You’re <em> super </em> high up on Todoroki’s friendship scale, huh?”</p>\n<p>Midoriya blushes so hard Kirishima’s concerned he might pass out, “Uh, um, a-anyways! Bakugou!” he says shakily, trying to calm himself as Uraraka laughs lightly at him. “I don’t think I’m on his friendship scale at all.”</p>\n<p>“I don’t think <em> anyone </em> is on his friendship scale,” Kaminari adds.</p>\n<p>“Dude, I am,” Kirishima says proudly.</p>\n<p>Kaminari raises an eyebrow. “You’re barely at a three.”</p>\n<p>Kirishima pouts, because okay, Kaminari does have a point, but. Still. Kirishima’s working super hard to climb the ladder of success here, okay? He’s determined, and when Kirishima wants something, he goes and gets it without hesitation.</p>\n<p>Lunch continues on, the topic switching to something new, and Kirishima picks idly at his food as he thinks about how all of Bakugou’s clothes probably smell of lavender and ash.</p>\n<p> </p>\n<p>--</p>\n<p> </p>\n<p>Sometimes Bakugou will let Kirishima come with him on his morning runs, and though Bakugou doesn’t say much, Kirishima is always eager to tag along.</p>\n<p>Six in the morning is the usual time, so when Kirishima arrives at Bakugou’s dorm at 6:02am, and Bakugou isn’t already opening the door and shoving past him, Kirishima frowns. Usually it’s Bakugou waiting on <em> him </em> to be ready on time, not the other way around. Kirishima’s learned that Bakugou is kind of a morning person. Kirishima wonders if he’s well rested, or if it’s just the nightmares that cause him to wake up so early.</p>\n<p>He knocks once, twice, but when he fails to get a response, he shrugs and decides to try the door knob.</p>\n<p>Surprisingly, it’s unlocked.</p>\n<p>“Bakugou?” Kirishima calls out, slowly peeking his head inside. The blinds are down, but soft peeks of early sunlight are streaming in, illuminating the room in a gentle glow. The scent of lavender is strong, as expected, and when Kirishima’s eyes scan over to Bakugou’s bed, he frowns as he sees the covers flipped but no body in sight.</p>\n<p>He’s just about to shoot a text to Bakugou when something soft brushes his leg.</p>\n<p>Kirishima yelps and stumbles back, eyes darting down to the ground, and when his eyes lock with bright feline green, his mouth falls open in surprise.</p>\n<p>“Holy fuckin’ shit.”</p>\n<p>The fact that Bakugou has a cat hidden in his dorm should be more alarming than it is, but Kirishima is a little distracted at the moment, and he falls to his knees to pet the creature. The cat is orange, and Kirishima’s eyes widen in recognition. Is this the same cat he saw Bakugou with a few weeks ago? Oh my god.</p>\n<p>“Oi, <em> fuckface </em> ,” a low voice hisses at him from behind, and Kirishima jumps and spins around on his knees, falling on his ass and making the cat dart under the bed away from the commotion. “What the <em> fuck </em> are you doing in my <em> room </em>.”</p>\n<p>“Uh, it was unlocked?” Kirishima offers. “And it’s past 6am. We usually go running, remember?”</p>\n<p>Bakugou curses as he checks the time on his phone. “Shit, I was out longer than i thought,” he mutters.</p>\n<p>It’s then that Kirishima notices the bag in his arm.</p>\n<p>“What’s that?” he asks.</p>\n<p>“None of your fuckin’ business.”</p>\n<p>“Why do you have a secret cat in your room?”</p>\n<p>Bakugou’s face flushes. “None of your <em> fuckin’ business </em>.”</p>\n<p>“You know pets aren’t allowed,” Kirishima says cheerfully, and Bakugou’s palms spark as if he’s getting ready to dispose of Kirishima’s skull. Kirishima holds his hands up in surrender. “Don’t worry! I won’t tell anyone!”</p>\n<p>Bakugou seems to relax a little.</p>\n<p>“But only if you say we’re at a level five on the scale.”</p>\n<p>Bakugou looks like he wants to protest, but he sighs and runs a hand over his face tiredly. “Does blackmail even fucking count?”</p>\n<p>“It does now,” Kirishima responds, standing up. The cat pokes it’s head out from under Bakugou’s bed, and Kirishima watches as Bakugou sets the bag down and then crouches low, holding out a hand for the cat to sniff.</p>\n<p>“S’okay, Cherry,” Bakugou says quietly.</p>\n<p>“Her name is <em> Cherry </em>?” Kirishima exclaims excitedly, and Bakugou growls and doesn’t look at him, keeping his eye on the cat.</p>\n<p>“No, you dumbass, her name is Cherry<em> bomb </em>.”</p>\n<p>“Cherrybomb? Oh my god.,” Kirishima whispers, pressing a hand to his mouth. “You’re so cute.”</p>\n<p>“Huh?”</p>\n<p>“She’s so cute,” Kirishima says louder, clearing his throat. Shit.</p>\n<p>“I know,” Bakugou says, proudly almost, and when the cat is close enough, Bakugou scoops her up in his arms. His hands are large compared to her smaller body, and though she’s not a kitten, she’s still a fairly young cat. Kirishima guesses no older than a year.</p>\n<p>“Look,” Bakugou says lowly. “I know I can’t keep her. I’m not a fucking idiot.” His gaze lowers, to where the cat is kneading at his arm, tail swishing happily as she purrs. “I’m just watching her for a bit, until the shelter I contacted can find her a home.”</p>\n<p>“You know I wouldn’t tell anyone, if you wanted to keep her,” Kirishima says.</p>\n<p>Bakugou frowns. “It wouldn’t be fair to her. I’m not gonna keep her locked up in some stupid fucking dorm room. She needs a real home.”</p>\n<p>Kirishima resists the urge to physically clutch at his heart. He’s sure no one but him has seen this side of Bakugou before, and Kirishima was <em> so </em> right about the cat lover thing. His life just keeps getting better and better. Bakugou shouldn’t look so damn <em> good </em> with a cat in his arms and a distressed scowl on his face, but he fucking does, and Kirishima pinches his arm to make sure he’s not dreaming or something.</p>\n<p>“I can, uh, help you take care of her, if you want?” Kirishima offers, stepping closer hesitantly, watching Bakugou’s eyes follow him. “Until you can find her a home?”</p>\n<p>It’s quiet for a few moments, and when Kirishima reaches a hand out to scratch behind the cat’s ears, Bakugou lets him. Kirishima rocks back on his heels, his chest feeling full.</p>\n<p>“Six,” Bakugou says, after a while. His voice is gruff, and he shuffles the tiniest bit closer so Kirishima doesn’t have to stretch so far to pet the cat.</p>\n<p>“Six?” Kirishima asks, confused.</p>\n<p>When Bakugou looks up, Kirishima is blessed to see that familiar blush across his cheeks.</p>\n<p>“On your stupid fucking scale, you <em> idiot </em>. We’re at a six.”</p>\n<p>“Oh,” Kirishima breathes. “<em> Oh </em> , shit. Hell <em> yes!” </em></p>\n<p>Bakugou rolls his eyes and goes back to coddling the cat in his arms, and Kirishima feels like he could take on the whole <em> world </em>.</p>\n<p> </p>\n<p>--</p>\n<p> </p>\n<p>Bakugou finds a home for the cat a few days later, which is probably good because it had been getting increasingly harder to keep her a secret. Kirishima is pretty sure Aizawa knew, and he knows for a fact that Ashido knew too, because Kirishima would find her visiting Bakugou in his dorm way more often than she ever would normally (and way more often than Bakugou would ever let her).</p>\n<p>“You shouldn’t have named her,” Kirishima says as he sits down on the grass, two melon sodas in his hands. “When you name things, it just makes it harder to let go, dude.”</p>\n<p>Bakugou doesn’t say a word, just sits down on the grass next to Kirishima and snatches one of the sodas out of his hands. The cat went to a good home, the shelter made sure to reassure Bakugou, and though Kirishima wasn’t there for the official goodbye, by the tenseness in Bakugou’s shoulders it wasn’t easy at all.</p>\n<p>Kirishima bumps their knees together. “Hey, man, you did the right thing! I’m sure Cherrybomb is super happy with her new family.”</p>\n<p>“I <em> know that </em>,” Bakugou grumbles, but his voice is quieter than usual. He drinks his soda in three long gulps, crushes the can in his fist, and then turns towards Kirishima and says, “I’m going for a run.”</p>\n<p>Kirishima is fully prepared for Bakugou to just jump up and leave him, but when Bakugou just stares at him, his face carefully blank save for a tiny crinkle between his brows, Kirishima frowns. What?</p>\n<p>What does he - oh, right. It’s an invitation.</p>\n<p>“Me too!” Kirishima says quickly, a smile breaking out on his face, and he almost misses the way the tension in Bakugou’s shoulders melts just a bit.</p>\n<p>“Let’s go, shitty hair,” Bakugou says, standing up, and when he holds out a hand for Kirishima to grab, Kirishima can’t help the stupid little jump his heart does as he grabs the outstretched palm.</p>\n<p> </p>\n<p>--</p>\n<p> </p>\n<p>“You and Bakugou seem to be getting pretty close, huh?” Sero says as he sits next to Kirishima on the couch in the common area. Kaminari is sprawled on the floor, half asleep on his worksheet while Ashido attempts to braid his hair, and Tooru is seated behind Ashido attempting to braid <em> her </em> hair. Kirishima’s pretty sure none of them know how to braid hair at all, but he admires their diligence.</p>\n<p>“When are you gonna ask him out?” Ashido interrupts before Kirishima can respond to Sero, and Kirishima frowns and crosses his arms.</p>\n<p>“I have a plan!” Kirishima exclaims. “You can’t rush me, okay? This is a highly delicate situation, here.”</p>\n<p>“Maybe you should skip the whole ‘asking out’ process and just grab him and plant a big, fat kiss right on his - ”</p>\n<p>Kaminari makes a few tired, fake-gagging noises, and Kirishima snorts on a laugh. His hands tremble though, his face growing incredibly warm at the thought of kissing Bakugou. He wonders if Bakugou would be a rough kisser? Or maybe Bakugou would be tentative, worried about being absolutely perfect because he has to be the best at everything, kissing included.</p>\n<p>Kirishima wonders what Bakugou’s mouth would taste like.</p>\n<p>“He has to work his way up the scale first,” Kaminari says after a moment. Ashido has given up on braiding and now has given him two twin ponytails atop his head. “What level are you at?”</p>\n<p>“That scale is <em> dumb </em>,” Ashido points out, and when Tooru make a noise of confusion, Ashido quickly explains the supposed importance of the Friendship Scale.</p>\n<p>“It’s not dumb, it’s a stepping stone!” Kaminari exclaims, and Sero laughs.</p>\n<p>“I dunno, it sounds….. implausible? You can’t really just put whatever you want on a scale and live by it, you know. Especially like, emotions and stuff.”</p>\n<p>Kirishima hums in thought. He <em> has </em> been thinking less and less about the scale recently, when he’s with Bakugou, and instead has been paying more attention to…. well, to <em> Bakugou </em>. It’s like, when they’re together, Kirishima forgets why he was even trying to climb a scale in the first place, because everything seems to just make…. sense?</p>\n<p>Eugh. Kirishima’s heart throbs. He’s way deeper into this than he originally thought.</p>\n<p>He’s about to say something, but then Bakugou storms into the common room, sweat dripping off his face and jacket tied around his waist. It looks like he just got back from the gym, his face flushed with exertion, and Kirishima <em> almost </em> visibly shivers. Sometimes he forgets how fucking attractive Bakugou is -</p>\n<p>No, that’s a lie. Kirishima could never forget that.</p>\n<p>“Fuckface,” Bakugou says to Kirishima, wiping his forehead with the back of his arm. “Come with me to the store, I’m fuckin’ thirsty.”</p>\n<p>Kirishima scrambles off the couch in record speed, his heart stuck in his throat. “Yes - uh, yeah. Me too. I'm - I'm totally thirsty too.”</p>\n<p>“You sure are,” Sero says.</p>\n<p>Ashido laughs so hard she falls on top of Kaminari, who squawks in surprise.</p>\n<p>Kirishima wills his stupid blush away and watches Bakugou’s back as he turns to leave.</p>\n<p>“I hate you guys,” he whispers, stumbling over his own feet in his haste to catch up to Bakugou.</p>\n<p> </p>\n<p>--</p>\n<p> </p>\n<p>Bakugou is never late to class.</p>\n<p>Sure, he’ll show up literally .5 seconds before class begins, but he’s always shown up on time. Bakugou’s hot headed, but he’s way serious about his education and his heroism, whether he likes to admit it or not. He’s smart, and always turns his assignments in on time, and he’s <em> never </em> late.</p>\n<p>That’s why, why Bakugou walks into class 10 minutes late with bloodshot eyes and an exhausted scowl on his face, Kirishima knows something’s up.</p>\n<p>“Nice of you to join us, Bakugou,” Aizawa says lowly, (As if he’s one to talk, Kirishima thinks).</p>\n<p>Bakugou says nothing, though Kirishima can see the way his finger twitch, with the need to blow something up most likely. It looks like his patience is being tested, like one wrong move could teeter him right over the edge and into rage mode.</p>\n<p>He sits himself in his normal seat, sinking low enough that his leg splay completely under the desk in front of him, and crosses his arms over his chest. His face is set in a glare, and Kirishima averts his eyes quickly to avoid getting caught staring. He’s more a little concerned, but he pushes the thoughts away and tries to focus on the lesson.</p>\n<p>He can feel a weird tension in the room, though. Everyone knows how diligent Bakugou is about school, and the fact that he’s late and also not seeming to be paying much attention, has piqued everyone’s curiosity.</p>\n<p>Aizawa hands out the daily worksheets to each row of desk, and when Midoriya reaches behind him to hand Bakugou his worksheet, Kirishima’s eyes widen to see Bakugou practically asleep on his desk. Kirishima’s eyes dart to Midoriya, who’s turned around in his desk curiously, and Kirishima winces when Midoriya reaches out and gently shakes Bakugou’s arm. This can’t end well.</p>\n<p>“Uh, Kacchan?” Midoriya says softly, as sweet as ever, and Bakugou <em> jolts </em> upright in his seat, palms sparking as his eyes lock with Midoriya’s.</p>\n<p>Bakugou’s eyes narrow in a glare. “What the <em> fuck </em> do you <em> want </em> - ”</p>\n<p>“Y-You were sleeping and... ”</p>\n<p>“I <em> wasn’t fucking sleeping </em>,” Bakugou yells, standing up abruptly. “Don’t ever fucking touch me again.”</p>\n<p>“I was just trying to - ”</p>\n<p>“<em> Shut up!” </em></p>\n<p>Kirishima flinches when Bakugou slams his palms down on his desk, singing two hand-print shaped marks into the wood as Midoriya flinches back. Bakugou looks like he’s about two seconds away from strangling the kid, jesus. To be honest, Bakugou hasn’t been this testy in a long, long time. Sure, he’s always kind of harsh, but he’s calmed down a lot since….</p>\n<p>Well, since Kirishima started hanging out with him, really.</p>\n<p>The outburst is bringing back memories from the first few months of UA together, and Kirishima can’t stop his legs from standing up when Bakugou makes to lunge at Midoriya.</p>\n<p>“<em> Bakugou </em>,” Kirishima says, hopping over his desk until he can grab onto Bakugou’s sleeve. Bakugou, predictably, yanks his arm away, but it’s with enough force that he stumbles a bit, lagging on his feet, which is completely unlike him at all.</p>\n<p>Aizawa looks like he’s one second away from giving both of them a week’s worth of detention for the childish outburst, and Kirishima reaches for Bakugou’s wrist again, fingers curling around the bone tightly, hardening himself just in case.</p>\n<p>“Aizawa-senpai, sorry! Just - can you give us a moment?” Kirishima calls out, and then he’s tugging Bakugou out of the classroom quickly, shooting a slightly apologetic look to Midoriya as he passes.</p>\n<p>Surprisingly, Bakugou lets himself be dragged, having resigned himself silently, and once they’re a good few feet away, the classroom door shut and the silence of the empty hallway deafening between them, Kirishima lets out a shallow breath before turning to the blonde.</p>\n<p>“Dude, what the hell?” Kirishima says, but his voice is gentle. “You can’t just freak out like that.”</p>\n<p>“Whatever,” Bakugou scoffs, and his gaze is drawn down, hands shoved in his pockets.</p>\n<p>Kirishima looks at him - really looks, this time - and there’s bags under his eyes, his skin looking paler than usual. He looks completely <em> exhausted </em>, like he hasn’t slept in days, and Kirishima frowns, because Bakugou’s weirdly conscious about taking care of himself. He eats three square meals a day, keeps sanitizer in his bag for his hands so he doesn’t get sick, and gets eight hours of sleep a night.</p>\n<p>He doesn’t look very well rested right now, though.</p>\n<p>“Have you been sleeping?” Kirishima asks, and Bakugou shrugs.</p>\n<p>“Doesn’t matter.”</p>\n<p>That’s an answer in itself, and Kirishima frowns. “Of course it matters. You turn into a massive dick when you don’t get enough sleep, apparently.”</p>\n<p>“I’m a massive dick all the time,” Bakugou bites back.</p>\n<p>Kirishima sighs. “No, you’re not. If you were a massive dick all the time, then I wouldn’t be your friend, you know.”</p>\n<p>“My - my fucking diffuser broke,” Bakugou says suddenly, rubbing a tired palm over his face. “I just… haven’t been sleeping, okay?”</p>\n<p><em> Oh </em> , Kirishima thinks, his heart sinking a bit at the realization. <em> He’s getting nightmares again. </em></p>\n<p>Kirishima opens his mouth to respond, but a voice interrupts him.</p>\n<p>“Are you two quite finished?”</p>\n<p>It’s Aizawa, peeking his head out of the classroom door a few feet away, an impatient scowl on his face.  </p>\n<p>“Uh, yes! Sorry, we’re coming back now!” Kirishima reassures, bowing quickly.</p>\n<p>When he turns to Bakugou, the blonde is already shuffling back to the classroom, shoulders hunched and tense.</p>\n<p> </p>\n<p>--</p>\n<p> </p>\n<p>Hatsume squints down at the device, humming in thought and flitting around it like it’s a new specimen of alien or something and not just a small, broken little humidifier.</p>\n<p>Kirishima wrings his hands together tightly. It’s lunch time, and most of the students are in the cafeteria or outside on break. Kirishima doesn’t know where Bakugou went off to, but he’s hoping to god he went to go take a nap or something.</p>\n<p>“So?” Kirishima asks nervously, leaning forward as Hatsume picks up the diffuser and brings it closer to her face. “D’ya think you can fix it?”</p>\n<p>Hatsume grins, holding the diffuser above her head like a goddamned newborn baby. “Of <em> course </em> I can fix it! I can even upgrade it, if you want! What’re you looking for? Weaponry? Laser beams? Oh! I could turn it into some sort of pocket shield, perfect for surprise combat - ”</p>\n<p>“Actually,” Kirishima interrupts, “if you could make it just like it was before? That would be amazing!”</p>\n<p>“<em> Boooooring </em>,” Hatsume whines, but then shrugs and sets the diffuser back on the table, pulling a few tools from her belt and leaning down so she’s eye-level with the machine.. “It’s doable though, of course.”</p>\n<p>“Oh man, sweet!” Kirishima exclaims, throwing his fist in the air. “Thank you! How long do you think it’ll - ”</p>\n<p>“Done.”</p>\n<p>Hatsume holds the diffuser out, and Kirishima’s eyes widen.</p>\n<p>“That… was fast,” he says slowly, carefully taking and diffuser in his hands and holding it to his chest. Hatsume is incredibly talented, Kirishima notes, watching as she shrugs and goes back to fiddling with whatever item she was working on before Kirishima came and interrupted her. “Seriously though, I really appreciate you doing this for me.”</p>\n<p>Hatsume waves a hand, offering a bright grin. “No problemo! Now, would you like to see the beautiful, <em> amazing </em> baby that I’m working on now? It’s a modified version of the boots i used during the sports festival, but this time - ”</p>\n<p>“Sorry, uh, maybe later!” Kirishima says sheepishly, grinning and waving as he bounds away, “Thanks again!”</p>\n<p> </p>\n<p>--</p>\n<p> </p>\n<p>Kirishima’s doing push-ups in his room later that night when three loud, rapt knocks on his door interrupt him. He finishes his current push-up before hopping up and rolling his shoulders back, swinging open the door to come face to face with none other than Bakugou.</p>\n<p>“It was you, wasn’t it?” Bakugou says, pushing past him and sitting on Kirishima’s bed, kicking his feet up and crossing his arms over his chest. Kirishima raises an eyebrow but doesn’t stop him. He closes the door before turning back to Bakugou, and when he inhales, he can faintly smell lavender.</p>\n<p>“Surprise?” Kirishima offers, grinning hopefully and hoping to god Bakugou doesn’t explode his face off for breaking into his room not only once (to steal the broken diffuser) but <em> twice </em> (to <em> return </em> the fixed diffuser).</p>\n<p>“Why the fuck would you - I don’t<em> get it,” </em> Bakugou says after a moment, and Kirishima feels his heart jump into his throat, because Bakugou looks lost and frustrated, but grateful, and he sits up so he’s propped against the headboard, knees pulled up to his chest. “Why are you so fuckin’ <em> nice </em> to me? Is this about your stupid fucking scale again?”</p>\n<p>Oh shit, Kirishima thinks, Bakugou seems to think - Bakugou thinks this is some sort of <em> game </em>. Kirishima’s stomach drops, and he can feel his hands start to clam up as he takes a hesitant seat on the bed, a good distance away from Bakugou to be safe.</p>\n<p>“Dude - <em> no </em>, forget the scale,” Kirishima says, “I mean, like, it was helpful, for a bit I guess? It helped me get closer to you, so…”</p>\n<p>“I just - I don’t understand,” Bakugou growls softly, and when he looks up, his eyes are full of some sort of emotion that Kirishima can’t place. “Why would you put so much fucking effort into getting close to me?” Bakugou furrows his eyebrows, rubbing his eyes, frustrated. “You… you said we’re….. at a six, right?”</p>\n<p>“<em> You </em> said we’re at a six,” Kirishima says without thinking, flinching when Bakugou extends his leg and kicks him roughly.</p>\n<p>“<em> Whatever </em>,” he hisses, but then he pulls his legs back, crossing his arms over his knees and resting his chin on top, eyes curious. “Okay, so, what the fuck happens when we get to ten?”</p>\n<p>“What?” Kirishima asks. His throat feels dry, and Bakugou is looking at him with this - this <em> vulnerable </em>expression on his face.</p>\n<p>“<em> Kirishima </em> ,” Bakugou’s voice is quiet when he speaks, talking slowly and deliberately. “What <em> happens… </em> . when we get to <em> ten </em>?”</p>\n<p>Kirishima scoots closer to him on the bed without thinking, until he’s nearly nose to nose with the blonde. He swallows, the sound deafening in the quiet of the room, and his hand shakes a bit when he reaches up and brushes Bakugou’s hair away from his face.</p>\n<p>Bakugou looks like he’s about to throw up, but he also looks anxious, watching Kirishima’s every move with a calculating stare. He doesn’t get up and shove Kirishima away though, so Kirishima pushes his doubts down, hiding them behind every other emotion he’s feeling at the moment, and he grips Bakugou’s chin gently.</p>\n<p>“When we get to ten I…. I guess I do this?” Kirishima whispers, nudging his nose against Bakugou’s before surging forward and pressing their lips together.</p>\n<p>Bakugou makes a gentle noise against his mouth, and Kirishima is about to pull back and apologize profusely, to forget this ever happened at all, but then Bakugou’s unfolding his legs and grabbing Kirishima by the collar of his shirt, tugging him forward roughly.</p>\n<p>Kirishima squeaks when his nose collides with Bakugou’s jaw, but then Bakugou’s <em> kissing him </em>, mouth warm and wet against his own. Bakugou’s hands are in his hair, but his touch is tentative, as if he’s scared Kirishima still wants to pull away.</p>\n<p>Which is, of course, the <em> last thing </em> that Kirishima wants to do.</p>\n<p>He makes sure to prove this fact by wrapping his arms around Bakugou’s waist, holding him close as he deepens the kiss, making a pleased noise when Bakugou tilts his head to the side for a better angle. It’s so <em>warm</em>, and Kirishima feels his heart spinning around in his body, shaking just as hard as his hands probably are, and wow, he likes Bakugou <em> so </em> damn much.</p>\n<p>“Are we - ” Kirishima pants, breaking apart from the kiss in order to trail his lips across Bakugou’s cheek, down to his jaw where he nips gently just to feel Bakugou jolt against him. “Are we at a ten, then?”</p>\n<p>“Shut the fuck up about your shitty scale,” Bakugou breathes out, “And <em> kiss me </em>.”</p>\n<p>“Shit,” Kirishima says, pulling back and running a hand through Bakugou’s hair, down the side of his neck, over his chest. He can’t seem to stop <em> touching him </em>, and Bakugou is pressing up into Kirishima’s hands like his body is unconsciously connected to his fingertips. Kirishima kisses him again once, twice, and gasps against his mouth,</p>\n<p>“I like you <em> so </em>much, dude.”</p>\n<p>Bakugou makes a strangled, broken sound, and Kirishima pulls back to see him flushed across his cheekbones. It’s <em> so </em> much better, seeing it up close like this, close enough that Kirishima can see the very faint freckles over his nose. He kisses them, because he can, and Bakugou lets out a shaky breath, glaring up at Kirishima because somehow they ended up horizontal within the past few minutes.</p>\n<p>“Will you go out with me?” Kirishima asks, puppy dog eyes wide and eager, and Bakugou groans. “Kaminari said you wouldn’t say yes, but I think, now, you <em> totally </em>would.”</p>\n<p>“And what if I say <em> no </em>, you fuckass?” Bakugou responds, but his hand is still fisted in Kirishima’s hair, grip tight and not letting up anytime soon.</p>\n<p>“If you say no,” Kirishima says, curling his fingers over the curve of Bakugou’s waist. “Then I’ll back off, and let you go back to your room, of course.”</p>\n<p>“If I say yes?” Bakugou manages, squirming a bit underneath Kirishima’s weight. “What then, huh?”</p>\n<p>“Then I kiss you again,” Kirishima grins,  “and again and <em> again and - ” </em></p>\n<p>Bakugou slaps a palm over Kirishima’s mouth, face hot with a fresh blush. “<em> God </em> , shut the fuck <em> up </em>.”</p>\n<p>“I’ll kiss you <em> all night </em>,” Kirishima laughs, muffled behind Bakugou’s palm.</p>\n<p>Bakugou closes his eyes and lets his head fall back against this pillows. “Stop <em> talking </em>, holy shit.”</p>\n<p>Kirishima pulls Bakugou’s hand away from his face. “You like it.”</p>\n<p>“I <em> don’t </em>.”</p>\n<p>Kirishima presses closer. “You like <em> me </em>.”</p>\n<p>“I...” Bakugou trails off, peeking his eye open to see Kirishima smiling at him, fond and happy. “Uh.”</p>\n<p>“It’s okay,” Kirishima says, cupping Bakugou’s face in his hands. He leans down, kissing him again soft and gentle but with the tiniest hint of teeth that has Bakugou’s lips parting on a breath and eyelashes fluttering slightly.</p>\n<p>It’s way better than Kirishima had ever imagined, and he’s hit suddenly with how much he <em> wants </em> this. Over the past few months, he was so focused on his stupid scale that he failed to notice just how much his feelings were growing with every passing interaction him and Bakugou had. With every civil conversation, every study session, every silent after-school walk to the store to get drinks and snacks. Sure, Kirishima knew it was <em> there </em>, deep in his chest, swirling around in his heart, but now that he physically has Bakugou in his arms, beneath the palms of his hands, it’s so, so much better than he could’ve ever predicted it would be.</p>\n<p>Bakugou pulls back with a gasp, once Kirishima’s hands have migrated from his face down to his hips, fingertips slipping underneath to touch bare skin.</p>\n<p>“Yes,” Bakugou blurts suddenly, his face flushed with exertion and something else. It looks like he’s trying his best not to scowl, his brows twitching as he clears his throat and averts his eyes. His hands are pressed flat against Kirishima’s chest.</p>\n<p>Kirishima raises an eyebrow. “Yes...?”</p>\n<p>“<em> Yes </em>,” Bakugou mumbles, nails digging into Kirishima’s collarbones. “Yes, I’ll… go out with you.”</p>\n<p>“Oh,” Kirishima breathes, sitting up slightly. “Oh, <em> fuck </em>yes. Kaminari’s gonna be - ”</p>\n<p>“Nevermind, I take it back,” Bakugou deadpans, sitting up and shoving Kirishima off of him.</p>\n<p>“No, <em> no, babe,” </em>Kirishima whines, draping himself over Bakugou’s back and winding his arms around his shoulders. “I can call you that now, right? Babe? Baby? Sweetheart?</p>\n<p>Bakugou’s ears go red, his body going stiff as he tries to squirm out of Kirishima’s grip. “<em> No, </em> you fuck, you can’t call me <em> any of those things. </em>Ever. What the fuck.”</p>\n<p>“How about…. Katsuki?”</p>\n<p>Impossibly, Bakugou’s ears turn even redder. His palms spark.</p>\n<p>Kirishima grins into his neck.</p>\n<p>Ten out of ten. Would <em> definitely </em>woo again.</p>"
}