{
  "id": "11787276",
  "url": "https://archiveofourown.org/works/11787276?view_full_work=true",
  "author": [
    "TunaFishChris"
  ],
  "title": "Five Times the Team Took Care of Steve and/or Peter (and One Time They Returned the Favor)",
  "rating": "Not Rated",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "The Avengers (Marvel Movies)"
  ],
  "relationships": [
    "Steve Rogers & Peter Parker",
    "Steve Rogers & Avengers Team",
    "Peter Parker & Avengers Team"
  ],
  "characters": [
    "Steve Rogers",
    "Peter Parker",
    "Natasha Romanova",
    "Thor (Marvel)",
    "Tony Stark",
    "Bruce Banner",
    "Clint Barton"
  ],
  "additional_tags": [
    "Angst",
    "Angst with a Happy Ending",
    "Emotional Hurt/Comfort",
    "Suicidal Thoughts",
    "Suicide Attempt",
    "probably wrong and completely inappropriate use of comic book character",
    "I never read the comics",
    "Deal With It",
    "also wrong/inaccurate use of spidey-senses",
    "also don't care about that",
    "It's my fic",
    "and I like it this way",
    "so there",
    "Hurt Thor (Marvel)"
  ],
  "language": "English",
  "series": "Part 2 of Held Together",
  "published": "2017-08-13",
  "completed": "2017-09-04",
  "words": "15,339",
  "chapters": "6/6",
  "comments": "216",
  "kudos": "6,086",
  "bookmarks": "601",
  "hits": "65,332",
  "summary": "<p>In light of Steve's mental state, the team gets a tad overprotective.</p>\n<p>Thor looks after his shieldbrothers, big and small.</p>",
  "notes": "<p>I should probably disable the comments. You guys are sending plot bunnies racing through my head</p>\n<p>...nah. I like the positive attention too much. :P</p>\n<p>Thank you so much for the comments. They really help. :)</p>\n<p>Also, for those of you sharing your own ideas about this universe, if you want to write your own fics (as inspired by \"Held Together\"), go for it! I've got an open policy on that.</p>\n<p>--</p>\n<p>We don't have NEARLY enough hurt!Thor Avengers fics. This should help fix that problem (even though it's more focused on Peter's emotional hurt than Thor's physical hurt).</p>\n<p>I'm not sure how I feel about this one. It's hard to get a good read on movie-Natasha.<br>(Of course, this wouldn't be an issue if the writers had decided to explore her character like the beautiful opportunity \"Age of Ultron\" was, but instead they had to throw in a cheap romantic subplot between her and Hulk. Grrr...)</p>\n<p>Anyway, I hope you guys let it. Let me know what you think! The comments are extremely helpful, both for my ego and for improvement.</p>\n<p>TW: mentions of animal cruelty and death.<br>(If you're a cat-lover, I'd skip this one.)</p>\n<p>Shorter chapter than usual, and a lot more fluff than hurt/comfort. These guys have earned it. :)</p>\n<p>TW: mentions of previous (canonical) child abuse.</p>\n<p>Yeah, I made sure Tony was the last one because I knew you were all looking forward to it the most. :)</p>\n<p>Much as I love reading Tony/Steve fics, I've always preferred writing them as platonic besties. For those of you with slash goggles, though...well, you don't have to take them off if you don't want to.</p>\n<p>For those of you who've left comments, THANK YOU. For those of you who have left comments pertaining to Tony, you might find that some of your suggestions have snuck in here. Ask and ye shall receive. :)</p>\n<p>TW for off-screen torture, and for some PTSD stuff.</p>\n<p>Eventually, there may be a sequel featuring Bucky. It depends on whether or not my current workload kills me. </p>\n<p>I'm not entirely sure how I feel about this one. I toyed with a lot of ideas and scenarios of how Steve and Peter would return the favor to their teammates in a single swoop. Not sure I chose the right one. I don't know; thoughts?</p>\n<p>TW: mentions of previous neglect</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">more notes</a>.)\n</p>\n<p>My thoughts on Natasha is that she and the other girls in the Red Room would play a version of \"house\" to escape reality now and then. So in her dream, the Avengers were just a figment of her imagination as a child.</p>\n<p>--</p>\n<p>If you liked this, you should check out some of my original work. See www.dzamarie.com</p>",
  "text": "<p>Venom, Clint decided, was an asshole.</p>\n<p>Peter had just officially joined the Avengers, a celebration that had been marked with cake and Asgardian mead (which they had to explain to Thor was not appropriate for an eighteen-year-old, even though back in the day you were officially a man at the age of fifteen). </p>\n<p>So of course, his first Avengers mission that should've been relatively simple ended him with him being mind-controlled by an alien symbiote. </p>\n<p>It made the Spider-Man costume look pretty badass; the red-and-blue design was clownish in comparison to the black and silver. But it'd also made Peter break Natasha's arm and almost shatter Tony's arc reactor. In the end it'd taken the Iron Man suit, Thor's resistance to alien crap, and more willpower than anyone knew Peter possessed, to pry the symbiote from the teenager and shove it into an appropriate cage. </p>\n<p>Clint was just glad that, barring this kind of shit, Peter was a good guy. Because fighting Spider-Man the villain? Not fun.</p>\n<p>As soon as they'd gotten back to the Tower, Peter had shut himself into his new suite. Not even Steve could go in and talk to him. </p>\n<p>Normally when someone shut themselves away, Clint let them mope. But having been in Peter's shoes, he knew that wasn't going to work here. So he slithered through the vents and dropped into the kid's living room.</p>\n<p>\"Nobody in this tower seems to understand the concept of locks,\" came a dry voice. </p>\n<p>Peter was lying on the couch, arm over his eyes. He was still in the Spider-Man suit, the mask lying on the floor. </p>\n<p>Clint picked up Peter's feet and sat on the couch, dropping the feet on his lap. \"We do, we just take them as a personal challenge.\" </p>\n<p>Peter grunted. \"Is Nat okay?\" </p>\n<p>\"She's fine. Mostly just pissed that Venom got the drop on her. Not many people can do that to Black Widow.\" </p>\n<p>\"She thought I was an ally.\" </p>\n<p>\"You are,\" Clint said. \"Sometimes allies get compromised.\" </p>\n<p>Peter snorted. </p>\n<p>Clint squeezed his ankle. \"You didn't kill anyone.\" </p>\n<p>\"Bit of a low bar, don't you think?\" </p>\n<p>\"No,\" Clint said seriously. \"Not everyone who gets brainwashed can say that.\" </p>\n<p>Peter removed his arm. His eyes were red and puffy. \"What?\" </p>\n<p>He gave a wry smile. \"Did no one tell you what happened between me and Loki during the Chitauri invasion?\" </p>\n<p>\"No...\" </p>\n<p>\"Long story short: Loki brainwashed me and I killed fourteen SHIELD agents.\"</p>\n<p>Peter stared at him. \"Shit.\" </p>\n<p>\"Yup.\" </p>\n<p>\"I'm sorry.\" </p>\n<p>Clint smiled. \"It sucks. That feeling of your body and mind being used by something evil. Being used to destroy the things you love. You start blaming yourself, thinking that there must be something wrong with you to have done that to your friends. And if you manage to get past that, you blame yourself for not doing enough to stop it, for falling into the trap. The nightmares aren't going to be fun, either.\" </p>\n<p>Peter made a face. </p>\n<p>Clint squeezed his ankle again, making sure he had his attention. \"But what you need to know above everything else is that we get it. We know that there is nothing else you could've done to protect yourself against that. And we know that the thing that tried to kill us, that hurt Nat and went after Tony, we know that thing is <em>not</em> you.\"</p>\n<p>Peter's chin trembled. He nodded. </p>\n<p>Clint stayed until Peter decided to wash up and go to bed. He went to the common floor and was unsurprised to see Steve in the living room, pouring over the mission reports. </p>\n<p>\"How is he?\" Steve asked. </p>\n<p>\"Went to bed. Hopefully what I said got through that thick skull of his,\" Clint said. \"Hard to tell, though. I'm not a therapist.\" </p>\n<p>Steve smiled. \"No, you're better. You're a friend.\" </p>\n<p>Clint snorted. \"That doesn't beat a professional.\" </p>\n<p>\"I beg to differ.\" </p>\n<p>\"And if I said the wrong thing?\" he challenged. </p>\n<p>\"It's not what you said that matters,\" Steve explained. \"It's how you made him feel.\" </p>\n<p>Clint snorted again. \"No offense, Steve, but that's a load of bullshit.\" </p>\n<p>Steve was quiet as Clint went into the kitchen to get some water, and maybe a late-night snack before bed. Then, \"Do you remember when Chris Cornell died?\" </p>\n<p>Clint closed the fridge. \"Is this you trying to make me feel better? Because you suck at it.\"</p>\n<p>\"That was a trigger for me.\" </p>\n<p>Clint paused. He walked out of kitchen, back into the living room. Steve hadn't moved from his spot on the couch, but he'd set aside the reports and was looking up. \"They've done studies on it. Once one person in an area commits suicide, others immediately follow. It makes sense: we see him do it, and we think, 'Well, if he can, then I can.' We realize it's a viable option. You think it's a coincidence that Linkin Park's lead singer hung himself on Cornell's birthday?</p>\n<p>\"Anyway, I was thinking about it. At the time I was going to text Peter, as part of our system. I felt guilty about it, considered not doing it and trying to power through on my own, which probably wouldn't have ended well. And then you and Tony walked in.</p>\n<p>\"We didn't talk about depression or mental health or any of that. You didn't even know what was going on inside my head. But I ended up not having to call Peter because I already had a friend with me. That's what made it bearable, not a shrink.\" </p>\n<p>Clint swallowed. They hadn't talked about Steve's depression since returning from the alternate universe. He didn't <em>want</em> to talk about it; every time he heard of a time when they almost lost Steve to himself, under their very roof, it scared the hell out of him. </p>\n<p>\"Next time tell us, all right?\" Clint said. His voice had the slightest wobble to it. \"We don't know what you need unless you say so.\" </p>\n<p>Steve smiled. \"Yeah, I know.\" </p>\n<p>\"Cool.\" He clapped his hands together. \"Wanna listen to Songbook?\"</p>\n<p>\"This is so not fair!\" the Man of Spiders declared, futilely reaching for the toy in Thor's hand. </p>\n<p>On Thor's other side, Steven was snickering. Thor had been the one to discover the Spider-Man themed gifts and baubles being sold across the nation (if not the Realm). Peter had mostly reacted with embarrassment, especially when the undergarments came out. But worse than the little red spiders embroidered onto smallclothes was, apparently, the talking toy Thor now held. </p>\n<p>It was quite fascinating, really. Thor would push a button, and the toy would speak one of half a dozen phrases. The voice was nowhere near what Peter actually sounded like, which made it all the more amusing. </p>\n<p>Thor pressed the button on the toy again, this time prompting it to shout, \"My spidey-senses are tingling!\" </p>\n<p>\"I don't even say that!\" Peter protested. \"And they <em>hum</em>, not tingle!\" </p>\n<p>The three of them were in a park in the middle of the city, the dying sunlight painting the buildings and trees a dark grey. There were a few mortals around, many giving them amused looks, but most left them alone. Of the three of them, Peter was the only one in mask and armor, a new suit of red and blue that Anthony had fashioned for him to make him resistant to bullets and blades. He had been just starting his patrol, his one-man battle against crime that he continued to wage even after joining the Avengers, when Thor had sent him an electronic message asking to meet him and Steven at their favorite park. </p>\n<p>And this was exactly what Thor had hoped to accomplish. Steven laughed every time the toy spoke, almost crumpling to the ground as Peter tried in vain to snatch the toy away. He'd tried using his climbing abilities, his fighting skills, even his webs. Thor was determined to keep it; he had a collection of Avenger-themed baubles. </p>\n<p>Earlier that day, Thor had realized that he hadn't seen Steven all morning. Which was unusual, as it was Saturday, and the man liked to spend those mornings in the kitchen making pancakes, sketching the view from the living room's massive windows, watching movies with the others, and otherwise just enjoying a day of rest among comrades. </p>\n<p>But as morning became afternoon, still the Captain had not emerged. Thor had even asked the wise caretaker JARVIS if Steven had left the building, but he hadn't left his floor since yesterday. </p>\n<p>Concerned, Thor had gone to him, finding him on the couch in the living room of his floor. The first thing Thor had noticed was a lack of electronic devices. There weren't many in Steven's possession, but the staples were always within reach: his cellular device, the tablet upon which he sketched, and the television where he watched movies. But the cellular device and tablet were nowhere to be seen, and the television stand was closed. </p>\n<p>Second, Steven was still in the clothes he'd worn to bed last night: grey pants and a white shirt. He hadn't washed today, either, and the dark circles beneath his eyes spoke of little to no sleep. Seeing the man so blatantly disregard his personal health immediately set Thor on alert. </p>\n<p>The only relief he found in the scene was the book that Steven was reading. Thor wasn't nearly as invested in literature as their captain and the good doctor, but he recognized certain titles and found that he could associate them with his teammates' moods. Steven read new, glossy books when he was feeling adventurous or otherwise content, and he read battered titles familiar in his own time when he felt the deep cut of loneliness that came from being a man out of time. <em>The Lord of the Rings</em> was middle ground: it had technically been written during Steven's time (just a few years after his final battle with the Red Skull), but he'd discovered it last year. </p>\n<p>He was currently reading the second volume, which was his favorite because, according to him, it was the happiest of the three. </p>\n<p>\"Something I can do for you, Thor?\" Steven asked, looking up from his book. </p>\n<p>So this was a \"bad day,\" though not as bad as it could be. A few months ago, Thor would've sympathized with his friend for not feeling his best, but wouldn't have given it much thought. Since falling into the parallel universe, he'd been forced to re-evaluate his relationship with Steven. </p>\n<p>Thor had lived for centuries, fighting countless battles along the way. He knew far too many soldiers who hadn't been able to handle the horrors of war, or the sudden change to \"normal\" after returning home, and had destroyed themselves because of it. He was ashamed that he hadn't recognized the signs in Steven until it'd been thrown in his face. (He'd said as much to Steven a few days after returning home. The captain had just smiled and said that it wasn't Thor's fault. Steven hadn't wanted anyone to know. And besides, by the time Thor had returned to Earth after escorting Loki to Asgard and repairing the Bifrost, Peter had already helped him through the worst of it.)</p>\n<p>Everyone needed to be alone from time to time. But when a person who held such hatred for himself pulled away, sometimes you had to pull them back. </p>\n<p>Lucky for Thor, he'd discovered the perfect way to cheer Steven up just that morning. </p>\n<p>It'd taken a little coaxing to convince Steven to come to the park with him that evening (bathed and in clean clothing), and then moments to ask Peter to join them. </p>\n<p>Now, with Steven laughing and Peter whining, \"Why must you defy physics? I can lift a truck, I should be able to knock you off your feet, you jerk!\" Thor grinned in pride. Because, for the moment at least, he'd made his friend's world a bit brighter. </p>\n<p>Until Peter suddenly froze. He let go of Thor and backed away. </p>\n<p>Steven frowned, his laughter dying. \"Spidey? What--\"</p>\n<p>\"Thor, <em>down</em>!\" Peter cried, and lunged. </p>\n<p>He was a second too late. Thor heard the BANG, then felt the bullet rip through his skin and flesh. </p>\n<p>A mortal bullet would barely phase him. This one must have been enchanted or otherwise enhanced, because Thor found himself on his back, dazed, with his shoulder screaming at him. </p>\n<p>Strong hands grabbed his uninjured side, and Steven yanked him to cover behind a tree. Thor growled in pain, but managed to get his feet under him as he instinctively gripped his injury to stop the blood.</p>\n<p>\"Spider-Man, come on!\" Steven ordered. </p>\n<p>In the long seconds that had passed, Peter hadn't moved, frozen in place. The captain's voice snapped him into action, and he barely dodged the next bullet, swinging up and away. </p>\n<p>Steven gently pried Thor's fingers from his wound, wincing. \"Looks like it went through and through. But anything that knocks you on your ass isn't something to take lightly.\"</p>\n<p>Thor wasn't so much afraid--which he probably should have been--as he was angry. He was hurt, and he'd been having a good day, and he'd just turned his friend's mood from dark depression to love and laughter. </p>\n<p>And he'd lost the Spider-Man toy. </p>\n<p>He called Mjolner as Steven called the Avengers. </p>\n<p>--</p>\n<p>Thor stood on the roof, wincing as his wound throbbed. </p>\n<p>There had been two foes: the shooter, and a witch who had enchanted the bullet. They'd hoped to curry favor from other villains by killing Thor. </p>\n<p>Fortunately for Thor, the shooter wasn't Hawkeye, and had missed his vital areas. </p>\n<p>Unfortunately for the shooter, the Avengers did have Hawkeye. He hadn't missed. </p>\n<p>Now the shooter was dead, and Black Widow and Hawkeye were escorting a chained witch to the SHIELD dungeons to await judgement. Thor hoped the Director ordered an execution; it could've just as easily been Steven or Peter in front of that bullet. </p>\n<p>Of course, that was assuming the Director had such authority. The humans' structure of law and order was often confusing to Thor. There were <em>so many</em> people involved in trial and sentencing. At times like this, he preferred the simplicity of Asgard's hierarchy. </p>\n<p>\"You need to go to medical.\" </p>\n<p>Thor startled. He hadn't noticed the Man of Spiders getting so close to him. He smiled, waving away his concern. \"It's a fleabite. I merely need to wash it.\" </p>\n<p>Indeed, the blood had stopped flowing, turning his t-shirt and skin a crusty red. Already his body was healing. He rarely got injured, but when he did, he recovery matched that of the Captain of America. </p>\n<p>Peter was not deterred. \"Please,\" he whispered. </p>\n<p>\"He's right,\" Steven said. \"The witch might've added something nasty to that bullet. Spidey, see that he doesn't pull a Tony and ditch the doctors.\" </p>\n<p>\"Hey!\" Anthony protested. </p>\n<p>\"Or a Clint,\" he added. </p>\n<p>\"Dude,\" the archer complained. </p>\n<p>Normally, Peter would join in the banter. Or at least smile under the mask; they could always see it beneath the cloth. He did neither. He took Thor's uninjured arm and silently tugged him to the healers. His hand was trembling. </p>\n<p>Concerned, Thor let the young warrior take him to the healers' chambers in the SHIELD building. When Thor was swarmed by healers, Peter remained on the fringes. He didn't leave for his patrol. And while Thor couldn't see under the mask, he knew those eyes never left him. </p>\n<p>\"There doesn't seem to be anything out of place here,\" the head healer announced some time later. The dark-skinned lady Savadra was a familiar face to the Avengers, a scholar of the unusual and of strange bodies (\"xenobiology\" and \"enhanced bodies,\" she called them). \"The only magical residue we could pick up was a single spell meant to add more force to the bullet. It probably wouldn't have even broken skin without it. Otherwise, no poisons, no curses, no hexes that we could find. But I'd like to put you under observation for twenty-four hours just to be safe.\" </p>\n<p>Thor carefully put his shirt back on, mindful of the neat rows of fresh stitches on his torso. \"I must decline, fair healer. We need to interrogate the witch and discover where her powers come from. As I'm the only delegate from Asgard available, I must be there to offer my input.\" </p>\n<p>Healer Savadra's mouth thinned into a frown. From the doorway, Peter coughed. \"We'll keep an eye on him. He won't leave Avengers Tower. JARVIS can do hourly scans, and it has its own medical facilities.\" </p>\n<p>After a bit of thought, she nodded. \"That works. But call me the minute you think something's wrong.\" </p>\n<p>Thor beamed, then took Healer Savadra's hand and kissed her knuckles. It never failed to make her roll her eyes and lightly whack the top of his head with her files. \"Go on, get out of here. Try not to blow up anything important for the rest of the week.\" </p>\n<p>That was Peter's cue to make a joke, to pout and whine that she was being no fun. He stayed silent.</p>\n<p>Truly concerned now, Thor scanned him up and down. His red suit made it difficult to see any blood or injuries. \"Are you well, Man of Spiders?\" </p>\n<p>Peter jerked a little, clearly surprised. \"Me? I'm not the one who got shot.\" </p>\n<p>\"You don't seem yourself.\" </p>\n<p>\"I'm fine,\" he said through gritted teeth. </p>\n<p>Healer Savadra cleared her throat. \"Spider-Man, why don't you contact the other Avengers? I imagine they'll want to arrange a ride for you two.\" </p>\n<p>Thor heard the unspoken request for him to stay. As soon as Spider-Man left, the healer turned to him. \"I think he's in shock.\" </p>\n<p>Thor frowned. \"He wasn't injured.\" </p>\n<p>\"Not that kind of shock. An emotional trigger.\" She eyed him critically. \"Is there any trauma in his past that might've been picked at when you were hit?\" </p>\n<p>Thor remembered the way Peter stood in the open, frozen until Steven yelled at him to get to safety. \"I don't know,\" he said. </p>\n<p>--</p>\n<p>Thor was ordered by everyone--Healer Savadra, the other Avengers, even JARVIS--to get some bedrest as soon as he returned to the Tower. Instead, after he'd changed into clean clothes, he asked JARVIS where Peter was. </p>\n<p>The boy was in the gym. He'd traded his armor for workout clothes, and was now tearing into a punching bag with a ferocity that Thor had only ever seen on a battlefield. </p>\n<p>As soon as he heard Thor's soft footsteps, Peter whipped around and glared at him. \"Shouldn't you be in bed?\" </p>\n<p>\"Soon enough,\" he promised. \"What happened today?\" </p>\n<p>Peter gave him a look. \"Uh, two jerks decided to make a grab for fame by assassinating an Avenger and failed epicly?\"</p>\n<p>\"With you,\" Thor clarified. \"Your reaction to my getting hit was worrisome. You're not that slow.\" </p>\n<p>Peter turned away, though not before Thor would see the reddening of his cheeks. \"It won't happen again.\" </p>\n<p>Thor suppressed a sigh. He walked up to Peter and nudged him until they were facing each other again. \"What happened? What did you see, Peter?\" </p>\n<p>The boy swallowed. He was looking at Thor's shoulder, as if he could see through the shirt to the injury itself. \"Uncle Ben went the same way. Except it was a mugger, not a sniper.\" </p>\n<p>...ah. </p>\n<p>Sympathy, humility, and pride mixed in Thor's chest. He knew the pain of losing someone you cared about, and how those wounds could reopen with exquisite pain at the most inopportune times. At the same time, he couldn't help but feel honored and somewhat pleased with himself that Peter was putting him on a similar pedestal as his lost Uncle Benjamin. </p>\n<p>Thor pulled Peter into a hug. The boy almost tripped over his feet in surprise. Because of their height difference, his head bumped into Thor's chest, right over his heartbeat. </p>\n<p>He didn't say that he was sorry; such an apology solved nothing. He didn't promise that it would be all right; it wouldn't. He simply said, \"I'm here for you. And if a day should come when I'm not, the other Avengers will be there for you, too.\"</p>\n<p>Peter was shaking as he gripped Thor with enough force it would've broken the bones of a mortal man. He sniffed. \"I'm sorry. You're the one who's injured, I shouldn't be...\" </p>\n<p>Thor gripped him tighter when he tried to leave. \"As I said: it's a fleabite. And in any case, my pain doesn't disqualify yours.\" </p>\n<p>A beat. Then, \"You guys must have some seriously scary fleas on Asgard.\" </p>\n<p>It was a weak attempt at a joke. It had Thor grinning anyway.</p>\n<p>Natasha wasn't psychic, no matter what everyone else thought. Still, she couldn't help the sense of <em>I'm not going to like this</em> when she answered Steve's request to come to Peter's floor at midnight.</p>\n<p>Lucky for everyone, the Avengers kept odd hours. She usually didn't get to bed until two in the morning. And when she was in bed, she would answer only to an Assemble alarm. </p>\n<p>She found Peter in the bathroom, and as she followed the sound of running water, she picked up gentle, soothing talking beneath it. </p>\n<p>He stood at the sink, wearing his full costume except the mask. He was washing what looked like a rock. </p>\n<p>Except the rock moved, and weakly meowed. </p>\n<p>\"Tony's going to flip when he sees you brought an animal in the tower,\" she warned. </p>\n<p>Peter didn't look the least bit guilty. \"The snow's locked everything down. I couldn't find a vet that was open.\"</p>\n<p>Natasha stiffened. \"Vet?\" </p>\n<p>Footsteps behind her. She turned to see Steve coming to the bathroom with a massive, fluffy towel. He looked beyond relieved to see her. \"Peter found her on patrol.\" </p>\n<p>\"In an alley in a cardboard box,\" Peter growled. \"With two dead siblings.\" </p>\n<p>Natasha glanced outside. She could barely see the city through the falling snow. </p>\n<p>The weatherman had been predicting a harsh blizzard all week. When Peter announced that he was going on patrol tonight, all the Avengers made him promise to be back before the snow started. She supposed she should be grateful that he'd kept the promise rather than trying to swing through that mess, looking for an open clinic.</p>\n<p>\"Bruce is out of town, or we would've called him,\" Steve explained. \"You're the one who has the most experience with animals...\"</p>\n<p>Natasha looked at the kitten, so small in Peter's hands. Its fur was black, and one green eye opened up a sliver to stare at her. It was probably less than three weeks old. </p>\n<p>\"That better be warm water, not hot,\" she said, stepping forward and gently taking the kitten from Peter. </p>\n<p>\"It is,\" he said. \"Maybe we should get some milk or something to feed her--\" </p>\n<p>\"No.\" Natasha motioned for Steve to come forward and placed the little bundle in his towel. \"Feeding chilled kittens is extremely dangerous, even if they're malnourished. We have to wait until she's warmed up, and then take her to the vet. Assuming she survives the night.\" </p>\n<p>\"She will,\" Peter declared. </p>\n<p>Natasha shook her head. She didn't want to say this, to steal another shred of hope and innocence from her fellow spider-themed hero. But it was better to prepare him for the worst. \"You said the other two were already dead. That means she was exposed to the snow for hours, probably on the verge of starvation, and that's without knowing what her previous owners did to her before abandoning her. She probably won't make it.\" </p>\n<p>Steve's jaw set in the trademark Captain America line of stubbornness as he carefully dried off the kitten. Peter looked a little heartbroken, but shook his head. \"What do you need?\" </p>\n<p>\"A box and a heating pad,\" she said.</p>\n<p>Every Avenger had a heating pad, and most of them had more than one. They were excellent for sore muscles. It took Peter all of fifteen seconds to get his, and an empty shoebox. They padded the box with a small, fluffy towel, tucked the kitten inside, and put the heating pad (set on low) over it. Natasha offered to stay while Peter cleaned up and Steve got them something to eat. It was going to be a long night. </p>\n<p>--</p>\n<p>Natasha was there when the kitten died. She'd snuck her hand under the pad and was stroking its soft fur, watching the sun rise while the boys slept on the couch. The blizzard had softened to a light sprinkle, and she'd planned on waking them up in ten minutes so they could go to the vet. That's when the kitten stopped breathing. </p>\n<p>She sat there for a long time, silently cursing in every language she knew. Finally, as Peter yawned and started to stretch, she removed the pad and closed the box. Steve, woken by Peter's movement, cracked his neck. When they looked at her, she shook her head.</p>\n<p>Peter's face fell. Steve's was carved from stone. He stood and left the room. </p>\n<p>--</p>\n<p>Burial wasn't an option, so they settled for cremation on the roof. Natasha found firewood and old newspapers. Peter lit the match.</p>\n<p>As they watched the box burn, Peter snickered. \"I'd just stopped a home invasion when I found them,\" he said. \"Someone just left them out there to die.\"</p>\n<p>Natasha didn't say anything, the silence urging him to continue. </p>\n<p>\"Does it ever end?\" he asked. </p>\n<p>\"If by 'it' you mean 'the shittiness of humanity,' then no,\" she said. \"It never ends. No matter what you do or how long you do it, people will keep doing horrible things to each other. And just when you think you've seen it all, they'll find a new way to horrify you all over again.\"</p>\n<p>\"Thanks, Nat,\" he grumbled. </p>\n<p>\"But,\" she continued, \"for every horrifying thing one person does, another does something truly incredible. For every villain, there's a hero. At the end of the day, that's what you have to focus on.\" </p>\n<p>Peter was silent as they watched the box burn, crumple into ash. He checked the time. \"I've gotta go to class.\" </p>\n<p>\"All right,\" she said. </p>\n<p>He hesitated. \"Steve's probably beating himself up right about now.\" </p>\n<p>Natasha looked at him in alarm. He held up his hands. \"I'm not feeling a ping or anything, but just...\" </p>\n<p>She relaxed, and gave a grim smile. \"I'll keep an eye on him.\" </p>\n<p>--</p>\n<p>Steve was breaking a third punching bag when Natasha found him in the gym. Normally, she'd offer to spar. Instead, she walked up to him and crossed her arms. </p>\n<p>It took a solid four minutes for him to stop beating the bag and finally look at her. \"Romanov.\" </p>\n<p>Hel-lo. Back to a last-name basis? That wasn't good. \"Do you want to talk about it?\" she asked. </p>\n<p>He unwrapped his fists. \"What's there to talk about? Cat died, end of story.\" </p>\n<p>\"It's a very sad story,\" she said. </p>\n<p>\"It's a cat.\" </p>\n<p>She tipped her head, the pieces falling into place. \"Are you upset because the kitten didn't make it, or because you realize that most of the people you're attached to will die before you do?\" </p>\n<p>Steve tossed the wrappings aside, revealing raw knuckles. He didn't say anything. </p>\n<p>Natasha hesitated. She knew she was right, knew that she should probably share a piece of her life that only Clint had ever seen glimpses of. It still took a while to convince herself to open her mouth: \"The Red Room tried to destroy attachments. If we ever became emotionally attached to something, they would destroy it, because they didn't want us to be compromised.\"</p>\n<p>Steve studied her. He sounded almost hopeful when he asked, \"Did it work?\" </p>\n<p>\"In a sense,\" she said. \"The end result was A-list assassins who were all dead inside. It also resulted with me being on Hawkeye's hit list by the time I was twenty-one.\" </p>\n<p>He stared at her. \"Clint was ordered to kill you?\" </p>\n<p>Back to first names now. Excellent. \"He almost did, too,\" she admitted. She knelt and pulled up the sleeve of her pants leg, revealing an old scar. \"Put an arrow right through me. But instead of sticking another one somewhere more fatal, he patched me up and convinced me to join SHIELD.\" </p>\n<p>Steve sat next to her, ghosting his fingers over the scar. </p>\n<p>\"You had all of your attachments severed when you went into the ice,\" she said. \"That almost killed you. So the idea of making more is terrifying. But they're the only thing that make life worth living.\" She gave him a hard look. \"You know what happens when you don't have that.\" </p>\n<p>Steve turned red and looked away.</p>\n<p>She smoothed out her pants. \"The Natasha in the other universe survived only through light attachments. Superficial friendships. She figured that since at least one of us is bound to get killed one of these days that being distant made her stronger, more prepared. I told her that was a load of bullshit.\" </p>\n<p>\"What made you say that?\" Steve asked. </p>\n<p>She smirked. \"I told my alternate self that I understood Captain America's strategies better because of how he rounds up the dogs at the pet shelter. I know far more about Asgard than 99% of the planet just by hanging out with Thor. I can calm the Hulk in seconds because of doing morning yoga with Bruce. I get constant updates on the status of crime in New York, from organized mafia to random shoplifting, when I treat Peter to sushi. And I generally know what Iron Man's going to blow up in the heat of battle because of Mario Kart marathons with Tony.\"</p>\n<p>\"No one knows what Tony's going to blow up,\" he accused. </p>\n<p>\"It's whatever will make the biggest explosion without killing any civilians,\" she said. </p>\n<p>Steve tipped his head in acknowledgement, a small smile tugging at his lips. </p>\n<p>Natasha put a hand on his knee. \"If and when one of us goes down, it's going to hurt. It's going to hurt like a bitch. But we'll help each other back up, make some new attachments, and keep moving.\" </p>\n<p>Steve swallowed. He squeezed her hand. \"Thank you, Natasha.\"</p>\n<p>\"Steeeve. Steeeeviiiiiie. Steeeeeeeeeve.\" </p>\n<p>\"Bruce, a little help?\" Steve pleaded, struggling with a very drugged Spider-Man while something exploded behind them. </p>\n<p>They were in the middle of a mission, trying to shut down an evil scientist's lab. No Code Green; throwing the Hulk into a building with a bunch of dangerous, untested chemicals was not a good idea. And besides, for something like this, they needed Bruce's mind more than Hulk's muscle. </p>\n<p>Hulk had very nearly come out anyway. At Natasha's clipped \"Spider-Man's down,\" rage and fear had bubbled so close to the surface, Bruce had had to employ every breathing technique he knew to keep Hulk at bay. The fact that it had been a tranquilizer of some sort rather than a bullet that had hit Spider-Man had not calmed him down: who knew what kind of poisons the villains had?</p>\n<p>So Bruce was very much on-edge when he helped Steve pour Peter into the van. He pulled off Peter's mask to check his pupils while Steve demanded status reports. </p>\n<p>Bruce heard Clint say something about the bad guys having backup, but he was more concerned with the fact that Peter's pupils were the size of olives. The boy smiled drunkenly at him. \"Hiiiiiii Brucey. Tony calls you that a lot. Calls you Brucie-Bear. I think it sounds cute. Did you know they made a Hulk-bear?\" </p>\n<p>\"Yes, I did,\" Bruce said, checking his pulse and blood pressure. \"What do you think of it?\" </p>\n<p>\"It's cute! But I think Hulk is cuter. Especially that one time he found a bunch of puppies...\"</p>\n<p>Bruce relaxed as Peter rambled. He turned to Steve. \"Heartrate and blood pressure are steady. I want to do a tox-scan and run a few more tests, but it looks like it's just put him in a state of drunkenness. It was probably supposed to knock him out, but his physiology's a lot tougher than a regular human's.\" </p>\n<p>Steve didn't drop his \"Captain America\" persona. He rarely did on a mission. But he visibly relaxed. \"Get him to the Tower. I need to help the others.\" </p>\n<p>Bruce nodded. But as soon as Steve opened the van door to leave, Peter surged forward. \"Okay, let's go!\" </p>\n<p>\"No, Peter,\" Steve ordered. \"Go with Bruce.\" </p>\n<p>Peter's face did a mixture of pouting, falling, and hardening, like he couldn't decide between heartbroken and angry. \"Steeeeeve. It's <em>dangerous</em>. You need Spider-Man.\" </p>\n<p>Steve visibly bit back a soft smile. \"I know. Which is why you're going with Bruce. I need you to protect him. That's your mission, Spider-Man. Got it?\"</p>\n<p>Peter straightened. \"I can do that!\" </p>\n<p>\"Good.\" He jumped out of the van, calling over his shoulder, \"Get moving, Bruce!\"</p>\n<p>--</p>\n<p>\"...should get JARVIS a Christmas present. Only, I don't know what to give him, 'cause he's a computer. A really fancy computer,\" Peter rambled. He leaned on Bruce as they came into the elevator. \"Hey JARVIS, whadya want for Christmas?\" </p>\n<p>\"I don't celebrate Christmas, Mr. Parker,\" JARVIS said. If it was possible for an AI to sound fond, he did. </p>\n<p>\"Oh.\" Peter thought for a minute. \"D'you celebrate Hanukkah?\" </p>\n<p>\"Pretty sure he's an atheist, Peter,\" Bruce said, pressing the button for the medical floor of Avengers tower. Peter's room might be more comfortable, but if something went wrong, they'd need medical equipment ASAP. Best put him under observation. </p>\n<p>\"So's Tony, but he celebrates Christmas,\" Peter argued, surprisingly well for someone in his position. </p>\n<p>\"Holidays are an excellent excuse to get drunk,\" JARVIS pointed out. </p>\n<p>\"I think I'm drunk,\" Peter hiccuped. \"Bruce, am I drunk?\" </p>\n<p>\"Essentially,\" Bruce said. He shifted his weight and put his arm around Peter's shoulders so the boy was more firmly leaning on him. \"Intoxicated is probably a more accurate term.\" </p>\n<p>\"In-tox-i-ca-ted,\" Peter giggled. </p>\n<p><em>Well, at least he's a happy inebriate,</em> Bruce thought as the doors opened. There was medical staff on standby, as was always the case when the Avengers were on a mission. Bruce only borrowed one person for the sake of drawing blood. </p>\n<p>\"I don't like needles,\" Peter grumbled. </p>\n<p>Bruce sat him on the bed and patted his shoulder. \"No one does.\" </p>\n<p>As he moved away to give the medic more room, Peter gripped his hand. He looked so vulnerable and scared Bruce forgot he was an adult superhero. \"Can you hold my hand? Uncle Ben always held my hand at the doctor's.\" </p>\n<p>Bruce sat next to Peter, never breaking physical contact. \"Of course.\"</p>\n<p>As the needle went in and Peter squeezed his fingers, Bruce wondered if this was what it was like having a brother. He'd never wanted a sibling when he was a kid. With his parents? Absolutely not.</p>\n<p>But then the Avengers formed their rag-tag family and adopted Peter. Or rather, Peter adopted them. Bruce couldn't imagine where they would be if the boy hadn't been stubborn enough to stick with them for so long and help pull them together. </p>\n<p>Actually, he could. He'd spent two days in that reality and never wanted to go back. </p>\n<p>Bruce would never admit this to anyone. He loved Steve, the way they all did. But the scariest thing about the alternate universe hadn't been Steve's death. It'd been Peter's. The little spitfire who gleefully joined him in the lab, pushed food at him during a science-binge, poked the Hulk as much as Tony, beat everyone at Mario Kart, and made everything brighter just by existing in the same space. Steve might lead the Avengers, but Peter was the one who took care of them. </p>\n<p>\"We'll run a few tests on this and keep him in observation,\" the medic said, yanking Bruce out of his thoughts. \"But honestly, if we haven't seen any dangerous side effects by now, they probably won't happen.\"</p>\n<p>Bruce nodded as the medic left. \"Well, Peter, ready for a sleepover?\" </p>\n<p>Peter brightened. \"I've never had a sleepover before! Everyone said I was too big a nerd. Can we have a pillow fight? I love pillow fights.\"</p>\n<p>\"Let's save the pillow fights 'till morning.\" When he'd most likely be horribly hungover. </p>\n<p>Bruce helped Peter change out of his Spider-Man outfit and into a soft t-shirt and sweatpants, listening to him ramble. Halfway through, Bruce got a message from the others: fight was over. Everyone was safe. They were helping SHIELD with clean-up. </p>\n<p>Peter yawned as Bruce tucked him in. He ruffled his hair, turned off the lights, and was just getting ready to leave when Peter snagged his shirt. \"You can't leave. Steve told me to protect you.\" </p>\n<p>Despite himself, Bruce smiled. \"I'm going to be right down the hall.\" </p>\n<p>Peter didn't let up. \"Nuh-uh. You stay.\" </p>\n<p>Bruce looked down at where Peter was grabbing the hem of his shirt. On one hand, the boy was five minutes from falling asleep, and Bruce could sneak out then. But if he woke up and panicked at the empty room, or God forbid something happened...</p>\n<p>On the other hand, Bruce did not want to sit in a chair with nothing to do but twiddle his thumbs and watch someone sleep. That was just creepy. </p>\n<p>Although...he remembered something Steve had told him ages ago, how his friend Bucky would read to him when he was sick. Bruce had sympathized with Steve, as it was clear he was still going through the pain of loss, and had also been irrationally jealous. When Bruce was a kid, he'd see the parents on TV shows and movies read their children to sleep at night. Bruce had no memory of his parents doing that for him. His father was far more likely to give him a punch than a bedtime story, and if his mother ever read him to sleep he didn't remember it. </p>\n<p>A part of Bruce still wanted that. But as he'd grown older, he also wanted to be on the other side of it. </p>\n<p>\"All right,\" he said, sitting back on the chair. He pulled up the reading app on his phone. \"How about I read you something instead?\" </p>\n<p>Peter snuggled into the bed and listened with rapt attention as Bruce began <em>Percy Jackson and the Lightning Thief</em>, something that never failed to make both of them laugh. By the time Percy made it to Camp Half-Blood, Peter was fast asleep. Bruce kept reading.</p>\n<p>At any other time, Tony would've been impressed by the Villain of the Week's security system. At the moment, he wanted to shred it with his bare hands. </p>\n<p>\"You just had to take this one yourself, didn't you, Stark?\" he grumbled, using the crude computer/cell phone he'd made from what meager belongings he could find in his cell to hack the security system and at least open the damn doors. He cringed when the screaming started again.</p>\n<p>Technically Tony didn't take this one completely by himself. When he'd seen the size of the base and how many bad guys were in there, he'd elected to take one other Avenger with him. That was really all that should have been needed, and honestly, all that was available. Peter was taking his finals, so for the next week he was a last resort (not that Peter knew that; he insisted that he could be pulled for duty any time Spider-Man was needed, but the adults--the older, adultier adults, that is--had quietly agreed to unofficially bench Spider-Man until summer break). Thor was off-world, taking care of a \"delicate diplomatic mission\" on Asgard (Tony had snorted at that; they thought the guy with the hammer was the best person for that kind of job?). Natasha was doing her part-time super-spy thing for SHIELD and was on radio silence. Clint had dislocated his shoulder and, while mostly healed, he needed another week of bed rest/light duty to make sure there was no permanent damage. And Bruce was in Japan working with doctors on an alien disease that, while quarantined, posed a serious threat to humanity if they didn't find a cure ASAP. </p>\n<p>So Steve was the only Avenger available for the job. But even if there'd been other options, Tony probably would've dragged him along, anyway. The guy had been withdrawn and...very Captain America-y the last few days. Now that Tony and everyone else knew what to look for, he recognized it as a sign of yet another battle in the war against depression, this one not going so well. After looking up a few basic facts, it was easy to see why: this week was the anniversary of both Bucky Barnes' death and the plane going down.</p>\n<p>The best way to get out of a funk, Tony firmly believed, was to get out of town. So he'd gone to Steve a few hours ago and said, \"Some assholes have a bunch of crates of my weapons in California. Wanna help me blow them up? We can visit San Fran and get oysters later. And catch a baseball game. Although if they put us on the kiss-o-tron, you're on your own for that one.\" </p>\n<p>Steve had agreed, claiming that Tony would need the supervision (which Tony so totally did not, but he'd swallowed his pride and said nothing because it brought a bit more life into Steve's eyes). </p>\n<p>Of course, the plan had gone pear-shaped as soon as they'd touched down. Apparently, there was a trio of very powerful mutants working here. Tony and Steve had managed to take them out, but not before getting surrounded on all sides.</p>\n<p>The end result was Tony in a cell with walls that were paper-thin. It did nothing to muffle the screams coming from the next cell. </p>\n<p>Tony had mostly tuned out the Lead Asshole's demands when he'd made them. He'd gotten the gist of it: make weapons or suffer. Even if Steve hadn't given him the slightest shake of his head, Tony would've refused. He was done with weapons. He'd even blown up the suit once he realized they weren't getting out of this. Which, now that he thought about it, was probably why they'd kept him around. Otherwise they could've shot him and cannibalized his tech.</p>\n<p>He'd expected torture to follow, just like in Afghanistan. Except this time he wouldn't have to wait three months; JARVIS knew exactly where they were, knew that something was wrong with the suit off-line, and if Tony didn't check in in the next ten minutes, he'd send an alert that'd bring a fresh suit, all the other Avengers, and SHIELD on these guys' heads. </p>\n<p>What Tony hadn't expected was that instead of grabbing him, they'd pulled Steve out of his cell. The screaming and...other noises had started soon after. </p>\n<p>Tony gritted his teeth against a grinding noise, then had to force himself to stay still when he finally heard the <em>click</em> that meant the doors were unlocked. There were footsteps coming down the hall. He barely had time to hide his Frankenstein computer.</p>\n<p>Lead Asshole and his two guards didn't notice that the door was unlocked; it hadn't actually moved. He leaned against the bars and waited for the noise to die down. \"Your friend's not doing too well.\"</p>\n<p>If Tony concentrated, he could hear Steve's ragged breathing in the deafening silence. He forced himself to move slowly and calmly to the bars. The guards stiffened, but didn't interfere as he leaned against the bars, right next to the door. \"What exactly do you want?\" </p>\n<p>Asshole grinned. \"Oh, nothing major. We're not stupid enough to ask for an Iron Man suit. Just a few missiles and bombs, plus whatever other trinkets you decide to give us in exchange for keeping you alive.\"</p>\n<p>\"And if I refuse?\"</p>\n<p>He smirked. \"Start again,\" he called. This time something hissed, like a burn, and the screaming started anew. Asshold shrugged. \"The super-soldier serum will fail. After a very, very long time.\"</p>\n<p>Tony sighed, putting a hand on the bars. \"I admit, you're not as dumb as the Ten Rings. Still pretty dumb, though.\"</p>\n<p>He pushed the door open, slamming it into Asshole's forehead, and rushed into the hall. </p>\n<p>He wasn't Captain America, or Black Widow, or Hawkeye. But he could still take out a couple of goons and their jerk leader who'd never stepped in a sparring ring. And the noise from the next room was loud enough to cover the sound of punching and muffled shooting. Within seconds, Tony had a loaded gun in hand and was creeping up to Steve's cell. </p>\n<p>There were two men standing in the room, one in the corner with a rifle trained on Steve, the other pressing a red-hot soldering iron to Steve's chest. Steve himself was strapped down to a table, bare from the waist up, with dozens of cuts, bruises, and now burns. </p>\n<p>But there were no bones sticking out, no twisted distortion of his limbs, no major bleeding or holes that Tony could see. So all the damage, while painful, was superficial. </p>\n<p>The torturer raised the iron. Steve gasped, heaving breaths. The torturer tsked. \"Sure hope your friend makes up his mind soon. I'd hate to keep doing this to such a fine specimen.\" </p>\n<p>And Steve...chuckled. \"He's not gonna do it,\" he said between breaths.</p>\n<p>The cell was like Tony's: three metal walls and a wall of bars. As soon as he stepped within range of the two enemies, they'd see him. He'd have to move fast. </p>\n<p>\"Not even to save Captain America?\" the man challenged. </p>\n<p>Steve snorted. \"Just a kid from Brooklyn.\" </p>\n<p>He's need to move exactly 2.3 feet to the right before firing. That'd give him the maximum cover. And he'd need to take out the torturer first because that asshole needed to die like yesterday...</p>\n<p>\"I think there's more to it than that.\"</p>\n<p>Steve gave a self-deprecating grin. \"Nah. Everything special about me came out of a bottle.\" </p>\n<p>Tony froze. </p>\n<p>The man tipped his head in agreement. \"True. Too bad we haven't been able to recreate that. We could give it to someone who actually deserves it.\" </p>\n<p>The hiss of the soldering iron re-heating snapped Tony out of it. He moved and fired too shots. </p>\n<p>The good news: he hit both targets dead-on. </p>\n<p>The bad news: when the torturer fell, he dropped the iron. On Steve. </p>\n<p>Swearing, Tony shot the lock, sprinted into the room, and shoved the iron off of Steve's burning skin, all the while yelling \"Shit! Sorry, sorry, sorry, sorry, sorry...\"</p>\n<p>When Steve finally stopped screaming this time, Tony undid the massive chains on his arms and legs. \"Can you move? Tell me you can move.\" </p>\n<p>Slowly, Steve sat up, wincing as the movement pulled at his wounds. He tested his fingers, moved his legs off of the table, and stood. He nodded. \"I'm fine.\" </p>\n<p>\"You are not fine,\" Tony gritted out. </p>\n<p>Steve gave him a look. \"Get me my shield and I can take down more of these guys than you.\" </p>\n<p>\"I have no idea where they put your shield, and we have no time to find out. But we missed our check-in, so JARVIS should be sending an emergency suit any minute.\" </p>\n<p>\"We can't wait for that.\" Steve went to the dead guard and took the rifle. \"Shall we?\" </p>\n<p>--</p>\n<p>The good news: these guys had a bunch of small jets that the superheroes were able to get their hands on. Once Tony and Steve were in the air, they made sure to destroy the other planes still on the ground so they weren't followed. </p>\n<p>The bad news: Tony forgot about the other weapons these guys had stashed away. Namely missiles. </p>\n<p>--</p>\n<p>Tony groaned, which, with his broken nose, came out more of a gurgle. He lifted his head from the control panel, taking stock of his injuries. </p>\n<p>Bruised ribs; seatbelt must've really dug in. Splitting headache, possible concussion. Other than the nose, nothing broken or bleeding. </p>\n<p>The control panel was completely fried, wires and bits of debris sticking out of it. The missile had hit the wing, completely blowing it up, forcing them to crash-land in the middle of a forest. The windshield was a mess of cracks and fissures, but more-or-less in one piece, successfully protecting them against pointy branches. Tony closed his eyes, put his hand on his nose, and jammed it back in place. </p>\n<p>Ow.</p>\n<p>Once the ringing in Tony's ears died down, he realized the haggard breathing he was hearing wasn't his own. </p>\n<p>\"Steve?\" he called, scrambling to get out of his seat. The soldier hadn't strapped down right away; one of the jerks had managed to slip onto the plane before the door closed, and she and Steve had been fighting behind Tony while he'd been getting the damn thing in the air. Last he recalled, Steve had managed to knock her out just as their wing had been hit. Had Steve managed to strap himself in...?</p>\n<p>He found Steve in the seat right behind him, seatbelt in place. At first, Tony was beyond relieved. Then he noticed the pallor of Steve's skin, he ragged breathing as he struggled to get out of the seat, and the foot-long metal pole sticking out of his gut. </p>\n<p>\"Shit, Steve! Hold still.\" Tony put his hands on Steve's shoulders to get him to stop moving, and almost got clocked in the jaw for his effort. </p>\n<p><em>Okay, Stark, do the math,</em> he scolded himself. Frantic movement + irregular breathing + glazed look in the eyes...</p>\n<p>Yup. Definitely a panic attack. </p>\n<p>Tony hadn't even known Steve got those. He figured he was the only basketcase in the bunch. </p>\n<p>Getting as close to him as possible without actually touching him, Tony cleared his throat. \"Steven Grant Rogers, we're in California, it's May 13th, 2015. You're here because your idiot Avenger suckered you into a job that was none of your business. JARVIS knows something's up by now and is sending help. He's gonna get us back home, and when he does Natasha will dutifully kick my ass while Clint and Thor watch and laugh and Bruce and Peter go into complete mama bear mode, which they must've picked up from you, because I swear, Bruce was never such a mother hen before you guys became friends...\"</p>\n<p>He rambled until Steve's breathing began to even out. He blinked, swallowed, and looked up. \"T-Tony?\" </p>\n<p>Tony grinned. \"Hey, soldier. Now, don't be mad, but I kinda crashed the plane, and you've got a pole sticking out of you. But don't worry; JARVIS is on his way. I've got tracking devices planted in my arms, and he would've known something was up as soon as the suit detonated, plus I didn't check in when I should've, so...\" </p>\n<p>Steve didn't look relaxed. His breathing was still shaky. \"Get me out of this plane.\" </p>\n<p>\"That's the plan, chief.\" Tony stepped back to get a clearer look at Steve's injury. The pole was at least three feet long, nailing Steve to the chair. One end pointed at Tony, the other went through the chair before hitting the floor. </p>\n<p>\"Dammit,\" he said. \"We're gonna have to wait for the suit to...\" </p>\n<p>The whine of repulsors cut him off. Tony grinned. \"Oh, JARVIS, baby, perfect timing!\" </p>\n<p>Before Tony could take two steps, Steve's hand snaked out and grabbed his shirt. \"Don't--\"</p>\n<p>Tony paused as Steve cut himself off. He was too pale to properly blush, but there was a tiny bit of pink in his cheeks as he uncurled his fingers and let Tony go. </p>\n<p>Now, Tony may be a self-centered asshole with shitty people skills, but even he couldn't misinterpret that. He put a hand on Steve's shoulder and stayed put. \"JARVIS! In here, sweet cheeks.\" </p>\n<p>\"The things you call your computer are disturbing,\" Steve muttered. </p>\n<p>\"I've heard much worse, Captain,\" JARVIS said through Iron Man's speakers as the suit walked through one of the gaping holes in the plane. </p>\n<p>\"Gimme a gauntlet, J. And call a med evac,\" Tony ordered. When the familiar metal was wrapped around his forearm, he turned to Steve. \"Okay, the good news is I have a laser on the finger here, so cutting you out of this should be pretty straightforward. The bad news is we're gonna have to kind of...slide you up the pole a few inches so I can get between you and the seat.\" </p>\n<p>Steve nodded. \"Do it.\" </p>\n<p>Tony grimaced. He was really hoping to go at least another month without listening to Steve scream again. \"J, I'm gonna need some help.\" </p>\n<p>--</p>\n<p>Half an hour later, Tony pulled Steve from the wreckage and set him against a tree. The suit went to sentry mood, and Tony sat next to him with a huff. </p>\n<p>\"ETA on the evac is fifteen minutes, sir,\" JARVIS reported. </p>\n<p>\"'anks,\" Steve said. He was still breathing heavily, and he was pale. Tony couldn't tell if that was from shock, blood loss, or the recent panic attack. \"I know we could've just stayed in there, but...\" </p>\n<p>Tony waved it off. \"Eh, we don't know how stable it is in there.\" He bit the inside of his cheek, before deciding to go for it. They had to do something for fifteen minutes, anyway, and Steve needed to stay awake. \"Didn't know you got panic attacks.\" </p>\n<p>\"I usually don't,\" he defended. \"Just...the plane crashed.\" </p>\n<p>Tony felt like the biggest fucking idiot in the world for not putting that together sooner. Anyone would freak out over their plane crashing, but of course Steve would have a MAJOR FRIGGIN' PROBLEM WITH IT. The only thing that would've made it worse was if they'd gone down in freezing water. </p>\n<p>So, to recap: today Tony had pulled Steve along for a mission that he shouldn't have been a part of, Steve had gotten tortured and injured because of it, and now he was recovering from a Tony-induced panic attack. Oh, and he apparently had taken what Tony had said on the helicarrier a lot more seriously than he'd thought. </p>\n<p>Tony hadn't thought about that little conversation in years. Not since a couple of weeks after it'd happened, when the Avengers had all moved into the Tower. Tony had expected an awkward not-apology from the captain that he would then try to brush off. Instead, Steve had dropped four pizzas on his table in the workshop and said, \"I've heard this is the surest way to get you to forgive anything.\" </p>\n<p>It'd even had Tony's favorite topping: sausage and pepperoni. \"You talked to Pepper, didn't you?\" he'd asked. </p>\n<p>\"Colonel Rhodes,\" Steve had admitted. \"After he chewed me out for what I said.\" </p>\n<p>Tony had then reached for the pizza. \"Water under the bridge, Cap.\" </p>\n<p>It didn't occur to Tony until right this moment that <em>he</em> had never apologized to Steve. He'd just assumed that Steve had already moved past it, as he had. They'd been manipulated by the scepter, and they'd both proven the other wrong about all the crap it'd made them say, and anyway how insecure could Captain America possibly be? </p>\n<p>Pretty damn insecure, as they'd all learned during their little vacay to the parallel universe last year. </p>\n<p>He hadn't really talked to his alternate self outside of creating the portal back. He hadn't had to. He got it. Steve had been slowly dying inside for <em>months</em> under Tony's own roof. He'd made damn sure to get everything the Avengers needed when they'd moved in. He considered it a source of pride, especially when he got them things they hadn't even thought of or known they'd needed: archery range for Clint, lab for Bruce, massive kitchen stuffed with pop-tarts for Thor...</p>\n<p>Money couldn't solve everything, though. And apparently, Tony had only been making it worse. He'd actively avoided Steve the first few months they'd lived in the Tower together, and not just because he'd gotten the (wrong) impression that Steve had only wanted a professional relationship with the Avengers. Every time he saw Captain America, he thought of Howard and how he'd constantly compare his son to the great national icon, always finding Tony wanting. He knew it wasn't Steve's fault. That if Steve had known his friend had turned into such a jerk, he would've kicked Howard's ass.</p>\n<p>It'd taken a long time for Tony to separate the idea of Captain American from the man Steve Rogers. Too long. </p>\n<p>Tony's stomach twisted. He'd never been good at this sort of thing, would rather avoid it altogether. But avoiding this problem had clearly only made things worse. </p>\n<p>\"I heard what you said to that guy,\" he said. \"It's what I told you on the helicarrier. 'Everything special about you came out of a bottle.' You know that's not true, right?\" </p>\n<p>Turned out, even pale, sweaty, and just coming down from a panic attack, Captain America had a pretty fierce \"bitch, please\" face. Who knew? </p>\n<p>\"I beg to differ,\" Steve said. </p>\n<p>Ah, fuck.</p>\n<p>Tony shook his head. \"You know, if you weren't bleeding out right now, I'd seriously consider punching some sense into you.\" </p>\n<p>Steve snorted. \"You know how many other big guys thought the same thing back in the day? If it didn't work for them, I doubt it'll work for you.\" </p>\n<p>\"That stubbornness didn't come from a bottle.\" </p>\n<p>Steve gave him a look. \"Tony. I have only basic military training, the same thing millions of other schmucks in this country have. Less, even. I'm not a genius, I'm not a god. I got here through sheer dumb luck.\"</p>\n<p>\"Bad luck,\" Tony grumbled, eyeing the pole in Steve's gullet. </p>\n<p>\"Sometimes,\" Steve admitted. \"Without the serum, I'm nothing special. Except for the mile-long list of illnesses and allergies I had.\" </p>\n<p>Tony stared at him. \"God, you're oblivious.\" </p>\n<p>\"Excuse me?\" </p>\n<p>He shook his head. \"Look, I know that mutants or enhanced people or whatever are rare, only a fraction of a fraction of a percent of the human population. But there are still hundreds if not thousands of people out there with super-strength, and far more impressive powers on top of that, many of whom we know and consider our allies. We chose <em>you</em> to lead us.\"</p>\n<p>\"You didn't have a lot of options at the time,\" Steve pointed out. </p>\n<p>\"We have options now. We're not taking them.\" </p>\n<p>The stubborn set in Steve's jaw made Tony roll his eyes and drop his head back against the tree. Christ, was this how Pepper and Rhodey felt whenever they had to deal with his thick-headedness? He needed to get them a truck of chocolates or something. Each. </p>\n<p>The buzz of a helicopter drew their attention up. \"Rescue party's here,\" Steve said. He closed his eyes. \"Finally.\" </p>\n<p>--</p>\n<p>Tony spent the time Steve was in the hospital planning his next move and working up his courage. He should've done this the second they came home from the parallel universe, but Natasha, knowing exactly what he'd wanted to do with her freaky psychic powers, had pulled him aside and said, \"We can't overwhelm him. That's what got him into this mess in the first place.\" </p>\n<p>\"Nat--\"</p>\n<p>\"I'm not saying do nothing. But medication isn't going to work on him anyway, and psychology was vastly different in the '40s from what it is today. Just...tread gently.\" </p>\n<p>Right. Because Tony Stark is exactly the kind of person everyone thought of when they were told to 'tread gently.' </p>\n<p>Well, he'd tried. And look how that'd turned out. Thank you, Natasha. </p>\n<p>A week after Steve was out of the hospital, Tony made sure they were the only ones on the communal floor before dropping into a kitchen chair and asking, \"Your history lessons included the change in psychology and mental illness, right?\"</p>\n<p>Steve, who had been standing at the counter spreading peanut butter on his toast, paused. \"Yes, they have, and no, I won't.\" </p>\n<p>\"Why not?\" </p>\n<p>He dropped the knife in the sink and started putting away the peanut butter. \"I don't need it.\" </p>\n<p>Tony laughed. \"Steve, there are thousands of people who have faced a fraction of the trauma and issues you have who need six types of meds and a therapist just to get through the day without breaking down. Or eating a bullet.\" </p>\n<p>Steve glared at him. \"Don't go there.\" </p>\n<p>\"Why not?\" Tony challenged. \"People who attempt suicide are statistically more likely to try again.\" </p>\n<p>\"Three to twelve months after the attempt,\" Steve corrected. \"Don't try it, Tony. I did my research.\"</p>\n<p>\"First of all, while the first year is the highest risk of a second attempt, the real danger doesn't ever pass. Yes, I did my research, too. Second, reading all the articles in the world isn't the same as actually talking to an expert.\"</p>\n<p>Steve set his jaw. \"I don't need to spill my guts out to a doctor I barely know, Tony. That's what I have friends for.\" </p>\n<p>\"So do I! I still see a shrink.\" </p>\n<p>Steve blinked. \"What?\" </p>\n<p>Tony silently swore. He hadn't meant to say that. He did his best to cover it with a smirk. \"Well, it was either that, or sleep on the couch forever. Pepper was pretty damn relentless.\" </p>\n<p>\"I didn't know you did that,\" he said softly. </p>\n<p>Tony shrugged. \"Beauty of doctor-patient confidentiality. Only me, Pepper, and Rhodey knew.\" </p>\n<p>\"Afghanistan?\" Steve asked. </p>\n<p>Tony considered replying with \"none of your business.\" This spotlight on his weaknesses was making him itchy. </p>\n<p>It was also, apparently, the only way to get anywhere with Steve. </p>\n<p>\"New York, actually,\" he admitted.</p>\n<p>At Steve's surprised look, Tony chuckled. \"Yeah, three months of captivity was fine, but apparently flying a nuke through a wormhole was enough to give me a lovely bouquet of panic attacks.\" </p>\n<p>Steve's look turned skeptical. \"Really. You're just like me?\" </p>\n<p>\"Wow. You think I'd lie about my medical history just to get you to a shrink?\" Tony asked, honestly slightly hurt. </p>\n<p>\"You've lied about your medical history plenty.\" </p>\n<p>\"Okay, first of all, I've only lied about my injuries is to get me <em>out</em> of medical, not to get someone else <em>in</em>. Second, JARVIS, tell 'im.\" </p>\n<p>\"Sir has had five attacks within the last three months,\" JARVIS reported. \"This is an exponential decrease from immediately after the Chitauri invasion. I can send you a chart if you wish, Captain.\" </p>\n<p>Steve stared at the ceiling, then at Tony. When he opened his mouth, Tony cut him off, \"Don't you dare ask why I didn't tell anyone, you little hypocrite.\" </p>\n<p>He deflated. \"That's different, Tony. I'm the leader of this team. I have to keep my shit together.\" </p>\n<p>\"Nobody on this team has their shit together,\" Tony countered. \"And seeing a therapist doesn't automatically disqualify you from leadership. If it did, every president of anything ever would've been out of a job within the first month.\" </p>\n<p>Steve rolled his eyes. \"And you don't see anything wrong with me telling all my secrets to a SHIELD doctor?\" </p>\n<p>\"I never said anything about SHIELD,\" Tony said. </p>\n<p>\"A civilian, then? At least with SHIELD, they'd sell my secrets to Fury rather than the papers.\" </p>\n<p>Tony gave him a look. \"JARVIS, send Steve the info for my therapist. You know, the one who has worked with several other celebrities and world leaders for twenty years without once blabbing to the press.\" </p>\n<p>\"Doctor Harrison's contact information is now in Captain Rogers' inbox,\" JARVIS reported. </p>\n<p>\"Thanks, doll.\" </p>\n<p>Steve rubbed his eyes and sighed. \"Fine. I'll set up one--<em>one</em>--appointment. If it doesn't work, I'm out.\" </p>\n<p>\"Nothing's going to be fixed with one session,\" Tony countered. \"Do at least six before you decide to call it quits.\" </p>\n<p>\"Three. <em>And</em> if Pepper and Rhodes aren't available to help you through your panic attacks, you call me.\"</p>\n<p>Tony glared at him. \"Two-way street, Cap.\"</p>\n<p>Steve returned the glare, before he bit out, \"Fine.\"</p>\n<p>\"Fine,\" Tony said.</p>\n<p>Steve took his peanut butter toast and left.</p>\n<p>--</p>\n<p>A month later, the team was in a hotel in South Africa. Thanks to it being in the southern hemisphere, it was winter in June (ugh). They'd just finished a mission and were all in separate rooms. Or, they were supposed to be. Clint and Nat were teaching Peter how to play poker. They all should've been in bed, it being almost midnight, but half of them were insomniacs. Tony was on his way to their room to join them when he passed by Steve's room and heard a thump. </p>\n<p>He paused. Steve, Bruce, and Thor had all done most of the work this mission and had gone straight to bed, Bruce out like a light as soon as they were back. Maybe Steve fell out of bed? Or was having a nightmare and had hit something?</p>\n<p>Tony rapped his knuckles on the door. \"Steve? You all right?\" </p>\n<p>There was no response. Just as Tony was about to bring Nat to pick the lock, he got a text. It was from JARVIS: <em>Cap. Rogers requires your assistance. The door is unlocked.</em></p>\n<p>Tony was in the room before he finished reading. It was dark, but he could hear the tell-tale heavy breathing and see a quivering shape on the bed. </p>\n<p>\"Steve, what--\" </p>\n<p>\"C-cold,\" Steve stammered. </p>\n<p>It wasn't cold in the room. Not in the slightest. In fact, Tony was standing there in sweats and a t-shirt and had considered lowering the temperature. But Steve's eyes were fixed on the window. Outside, it was almost a blizzard. </p>\n<p>And he'd splashed through a freezing lake knee-deep during the mission today. </p>\n<p>Swearing (because he really should've seen this coming), Tony rushed to the windows and closed the curtains. He checked the closet for a spare blanket, found it, and then jumped into bed. \"Scooch.\" </p>\n<p>If it was hot in the room, it was boiling under the blankets. Tony ignored the sweat starting to form on his forehead and back of the neck and tucked the extra blanket around Steve. The man was shivering like he had hypothermia, but his skin was searing hot. Didn't stop Tony from cuddling up close, remembering the tried and true method of warming someone up that they knew even in the '40s: body heat. </p>\n<p>\"It's okay, Steve,\" he said, taking Steve's hands and blowing into them. \"It's okay. You're okay.\"</p>\n<p>It took a long time, and by the time Steve was breathing normally and pushing off the comforter, the back of Tony's shirt was soaked with sweat. He gladly helped Steve peel off a few blankets--and his shirt, because, ick--until there was only the sheet and a blanket. </p>\n<p>\"Sorry,\" Steve mumbled. </p>\n<p>Tony jabbed him in the stomach. \"Shush. It happens.\"</p>\n<p>\"Didn't want to call you,\" he admitted. \"JARVIS threatened to tell Dr. H if I didn't.\" </p>\n<p>In the dark, Tony smirked. \"Well, you're stuck with me now. Hope you're not a bed hog.\" </p>\n<p>\"Oh, you don't have to...\"</p>\n<p>Tony scooted over and dropped his head on Steve's chest, effectively shutting him up. By now, he was pretty tired. He waited for Steve's heartbeat to settle back into a normal rhythm, and when it did, let it lull him to sleep.</p>\n<p>When Steve woke, his head was killing him, and he was sweating bullets beneath a dozen blankets. </p>\n<p>Yawning, he pushed the blankets off of him, slowly sitting up. Strange how his alarm hadn't gone off. Normally when he woke on his own it was due to nightmares, but he'd slept like the dead. There'd been a bitch of a mission.</p>\n<p>Steve frowned. Something about the mission...</p>\n<p>\"Steve!\" </p>\n<p>He froze. He knew that voice.</p>\n<p>For the first time, he noticed his room was not his room. This wasn't Avengers Tower. This was a medical facility, with none of the fancy technology he'd grown accustomed to. The nurses passing the hallway weren't in scrubs, they were the white uniforms of his youth, the kind his mother wore. Nobody was on their cell phone or tablet. </p>\n<p>And sitting in the chair next to him was Peggy Carter. </p>\n<p>\"Pegs?\" he croaked. </p>\n<p>She shoved a glass of water in his hands, making a face that meant she was trying to look firm but was close to tears or laughter. \"You missed our date.\" </p>\n<p>Slowly, he took a sip. When he was done, he said, \"By about seventy years, I think.\" </p>\n<p>Peggy blinked. \"Do I look like a crone to you? You've been down for two months. You were under the ice for <em>weeks</em> before Howard pulled you out. Everyone thought he was mad, that there was no possibility that you would survive. Even I thought he was mad.\" She winced, but didn't apologize. \"We shouldn't have been surprised that he was right. He's Howard Stark, after all.\" </p>\n<p>\"Howard...\" Steve echoed. </p>\n<p>She frowned. \"You remember who he is, right?\" </p>\n<p>This was wrong. All wrong. But Steve didn't know why. His head felt like it was stuffed with cotton. The last thing he remembered was the plane, going down, Peggy's voice in his ear as they planned a date they both knew he'd never make. Except that wasn't right. He was missing something...</p>\n<p>\"Speak the devil, and he shall appear,\" a new voice said. </p>\n<p>For a second, Steve saw him and thought <em>Tony.</em> Then he blinked, and he recognized his old friend.</p>\n<p>\"Fondue,\" Steve said. </p>\n<p>Howard grinned. \"He remembers, Pegs. He spent six weeks frozen in the Arctic. I think we can forgive him for being a little slow on the uptake.\" </p>\n<p>Steve pushed the blankets away and slowly swung his legs over the side of the bed. Peggy hissed and stood. \"Steve, are you sure that's a good--\"</p>\n<p>\"I'm fine,\" he said. He wobbled a little as he stood, but managed to get upright. </p>\n<p>Howard's grin grew. \"See? He's fine.\" </p>\n<p>Steve studied him, that sense of wrongness growing. \"I'm forgetting something. Something important.\" </p>\n<p>\"That's perfectly normal,\" Peggy reassured. \"You had a gash on your head, so we think you hit it in the crash. I'm sure your memories will return. And if they don't, we'll help you.\" </p>\n<p>\"I don't...\" He looked at Howard. \"Do you know a man named Tony?\" </p>\n<p>Howard blinked. \"Who?\" </p>\n<p>\"Tony,\" Steve said firmly. \"He...you must know him, I <em>know</em> you do...\"</p>\n<p>\"Steve, maybe you should sit down,\" Peggy said. She put her hands on his shoulders and gently sat him back on the bed. \"What's Tony's last name? If he's important, I'm sure Howard will remember him.\" </p>\n<p>The memory slammed into Steve's head so fast he almost fell over.<br>\n--<br>\nTony was drunk. Again. Steve chewed the inside of his cheek, watching the man pour another glass of whiskey. \"I'm cutting you off after this one,\" he decided. </p>\n<p>\"Fuck off,\" Tony growled. </p>\n<p>\"I mean it. You're drunk enough that JARVIS won't let you pilot the suit.\" </p>\n<p>\"Don't need the suit to kick your ass.\" </p>\n<p>\"No, but you need good coordination and straight thinking.\"</p>\n<p>Tony chuckled, downing his drink. \"Big man in a suit of armor...\" </p>\n<p>Steve winced. </p>\n<p>\"Dad would've liked that.\" </p>\n<p>He paused. Took a closer look at Tony. This was the first time he'd mentioned Howard. </p>\n<p>\"What was he like?\" Steve asked. \"As a father?\" </p>\n<p>Tony shook his head, reaching for the tumbler again. \"I'm not drunk enough for this conversation.\" </p>\n<p>Steve snatched the bottle and slid it down the counter, out of reach. \"You're plenty drunk. I don't think you'll even remember this conversation in the morning.\" </p>\n<p>He grunted, looking at his empty glass. \"'M not telling.\" </p>\n<p>\"Why not?\" </p>\n<p>\"'Cause he's a good memory to you,\" Tony said softly. \"I don't want to ruin that.\" </p>\n<p>Steve braced himself, then reached across the counter and touched Tony's wrist. \"I have enough good memories to spare. I can handle the truth.\" </p>\n<p>Tony stared at Steve's hand. He slumped. \"He was a shitty father. Never looked at me twice. The company was all that mattered. I just...wasn't important enough.\" </p>\n<p>Steve squeezed his wrist, channeling all of his sudden rage at Howard and turning it into a need to make up for the damage he did. \"You are important, Tony. He was a moron for not seeing it, but we're not going to repeat his mistakes.\" </p>\n<p>Tony finally looked at up him. \"Promise?\" </p>\n<p>\"Promise.\"<br>\n--<br>\nSteve blinked, and was back to the present. Er, that was a relative term. He was back to wherever this place was, with Peggy and Howard looking at him with concern. </p>\n<p>\"Right,\" he said. \"I remember now.\" </p>\n<p>He stood, gently pushed Peggy aside, walked up to Howard and punched him across the face. </p>\n<p>\"Steve!\" Peggy scolded. </p>\n<p>He shook out his fist, watching Howard lie on the floor in a daze. \"You know, you may not be the real Howard Stark, but damn did that feel good.\" </p>\n<p>\"What are you talking about?\" she demanded. </p>\n<p>Steve shook his head. He didn't know what this was, but he knew it wasn't real. It was a dream or an illusion or an alternate dimension or something, but it wasn't real. </p>\n<p>\"Tony Stark,\" he muttered under his breath, stepping over Howard and shoving through the throng of doctors and nurses in the hall. \"Peter Parker. Natasha Romanov. Bruce Banner. Clint Barton. Thor Odinson. Tony Stark. Peter Parker...\" </p>\n<p>He opened the door to the hospital...</p>\n<p>and fell. </p>\n<p>--<br>\n--</p>\n<p>Peter yawned, giving a leisurely stretch in his bed. </p>\n<p>His room was a mess, as usual. Aunt May was going to have a fit. But that was all right. He was only here about once a month, usually spending his time at...</p>\n<p>He frowned. Huh, that was weird. For a second he thought he was living somewhere other than Aunt May's.</p>\n<p>Just wishful thinking. Shaking his head, Peter got out of bed and got dressed. He only had one class today, in the early afternoon. He had time for a big breakfast, maybe a bike ride to take some photographs, grab lunch with a couple of friends, maybe he could get sushi with...</p>\n<p>He snorted as he pulled on his shirt. \"Money's too tight for sushi,\" he reminded himself. Which was a shame. Sushi was delicious. </p>\n<p>He gathered his textbooks, grimacing at the one for chemistry. He loved science, but he had a test coming up next week. It was a shame there wasn't a section on blowing shit up. He was great at that. </p>\n<p>Wait, why was he great at that again...?</p>\n<p>Peter's phone pinged. He glanced at a text message from Harry and left the room, typing a reply. </p>\n<p>He could hear the television on as he came into the kitchen. \"'Morning,\" he called, opening the fridge. </p>\n<p>\"Good morning.\" </p>\n<p>Peter froze. </p>\n<p>He did not just hear that voice. He brain was just playing tricks on him. </p>\n<p>Slowly, he closed the fridge and looked into the living room. </p>\n<p>Aunt May was doing laundry while watching the morning news. </p>\n<p>Next to her was Uncle Ben.<br>\n--<br>\nPeter stood in front of the gravestone, watching the rain slide off the granite. It was such a cliche: raining on the anniversary of a loved one's death. Ben would've laughed. </p>\n<p>The rain suddenly stopped patting the top of his head. He looked up at the underside of an umbrella. </p>\n<p>\"You'll catch a cold,\" Bruce said, standing next to him. </p>\n<p>Peter smiled. \"Pretty sure the spider-powers prevent that.\" </p>\n<p>\"Can't be too careful.\" </p>\n<p>They stared at the grave for a long moment. Peter shifted his feet. \"You said your parents are dead, right?\" </p>\n<p>\"Yes,\" Bruce said. </p>\n<p>\"Do you visit their graves?\" </p>\n<p>\"My mother wanted her ashes strewn in the lake, next to where she grew up. And my dad, I'm not touching that with a ten-foot pole.\" </p>\n<p>Peter looked up. \"You didn't get along?\" </p>\n<p>Bruce's smile was twisted. \"That's one way of saying it.\" </p>\n<p>Peter looked back at the gravestone. \"Uncle Ben would've liked you.\"</p>\n<p>Bruce snorted. Peter hated it when he did that, just dismissed any compliment or nice thing said about him because he thought it wasn't true. He was working on it. Ben had taught him to be persistent, and he'd always been stubborn. </p>\n<p>\"I'm spending the day with my aunt,\" Peter said. \"But maybe tomorrow we could go to the museum? They've got a new meteorology exhibit.\" </p>\n<p>Bruce smiled. \"I'd like that.\"<br>\n--<br>\nBen smiled. Then he frowned, his forehead creased in concern. \"Are you okay, Peter?\" </p>\n<p>Peter blinked. \"This is a dream.\" </p>\n<p>Ben stood as Peter turned and headed for the door. \"Peter?\" </p>\n<p>\"No!\" he snapped. He pretended there weren't tears in his eyes as he opened the door...</p>\n<p>he fell. </p>\n<p>--<br>\n--</p>\n<p>Gasping, Steve sat bolt upright. The table he was lying on was made of stone and made his ass sore. The Captain America costume clung to him with sweat and dried blood. His shield was across the room, and the other Avengers were lying on similar tables around him. </p>\n<p>\"He's awake!\" someone cried from the side, and lunged at him. </p>\n<p>Steve elbowed him in the face, and didn't feel an inch of remorse when it turned out to be a woman. </p>\n<p>Two more ran at him with fancy-looking knives, the kind used in ceremonies. A third went to an altar with a book and started speaking what sounded like Ancient Greek. </p>\n<p>A shot of webs glued her mouth shut. The book was yanked from her hands and used to bash her over the head by an unmasked, very pissed-off Spider-Man. </p>\n<p>After Steve disposed of the knife-wielders, he looked at the rest of the team. None of them had moved. </p>\n<p>\"Are they...\" Peter gulped. </p>\n<p>Steve rushed to the nearest one--Clint--and put his fingers to his throat. He sagged with relief. \"Alive.\"</p>\n<p>Peter looked down at the book he'd snagged and frowned. \"I can't read this. I don't know what they did to them.\" </p>\n<p>\"Probably the same thing they did to us,\" Steve said. \"Were you in a dream of the past?\" </p>\n<p>\"Um...sort of? I was eighteen and in college, like now, only I wasn't Spider-Man and...and Ben was still alive.\" </p>\n<p>He nodded. \"I lost only a few months to the ice, not decades.\" </p>\n<p>Peter went up to Natasha, a notoriously light sleeper, and snapped his fingers by her ear. \"Hey, Nat! Wake up and please don't kill me.\" </p>\n<p>She didn't stir. </p>\n<p>Steve remembered now. They'd been dispatched to deal with a small coven of evil witches that had all but obliterated a nearby friendly coven of good witches. But before the fighting had even begun, all Steve remembered was falling asleep. And overhearing something about ransom. </p>\n<p>Pfft. Idiots. They knew SHIELD had a no-ransom policy, right?</p>\n<p>Peter cursed. \"All right. Who made Bruce cry?\"</p>\n<p>Startled, Steve came over and looked over Peter's shoulder. Bruce was as dead to the world as the others, only there were silent tears sliding down his face.</p>\n<p>\"We need to get them out of here,\" he decided. \"Call SHIELD. Tell them to bring Keira.\" </p>\n<p>--<br>\n--</p>\n<p>Keira was the sole survivor of the friendly coven. Once SHIELD got all the Avengers to the Tower, they brought her in. Peter handed her the book while Steve described to the best of his ability what had happened. Peter, back in his mask, sat in the corner of the hallway of the medical center, watching the Avengers in their hospital beds as Steve and Keira talked next to him.</p>\n<p>She nodded. \"You're right in that they're trapped in a dream world, but they may not be as pleasant as yours.\" </p>\n<p>Steve frowned. \"What do you mean?\"</p>\n<p>\"As soon as you realized that it was fake, and more importantly, decided to leave, you woke up,\" she explained. \"The spell is designed to create a dreamscape where the dreamer believes there is no escape, or decides to stay there indefinitely. You could've remained in the 1940's and lived your whole life in that dream, perfectly content. Spider-Man could've stayed in a world where his uncle was alive. But there are cases where the dreamer is in a much worse realty.\" </p>\n<p>\"Such as...\" </p>\n<p>\"Bruce's biggest fear is that the Hulk will hurt us,\" Peter said quietly. \"If he's in a world where the Hulk turned on the Avengers...\" </p>\n<p>Keira nodded. \"It's believable, and he'd be distracted enough by grief not to question it. He'd simply accept it as his realty.\" </p>\n<p>Steve took a breath. \"Right. How do we wake them up?\" </p>\n<p>\"We can't,\" she said. \"We can only guide them. It's like...like a very vivid nightmare. Only fragments of the real world are filtered into the mind.\" </p>\n<p>\"Like sound, smell, touch...\" </p>\n<p>\"Exactly. My advice: provide as much evidence as you can that <em>this</em> is the real world, not whatever place their minds are trapped in.\" </p>\n<p>\"Oh!\" Peter cried, jumping to his feet. \"Poptarts!\" </p>\n<p>\"What?\" Steve asked. </p>\n<p>Peter ran out of the hall without a word. Shrugging it off, Steve flagged down the medical staff. \"We're moving them to common floor. Living room.\"</p>\n<p>It wasn't something they did often, but usually after particularly bad missions, the Avengers would puppy-pile in the living room like the dorks they were, order a literal truckload of fast food, and watch bad movies until they fell asleep. </p>\n<p>Steve helped the staff peel the Avengers out of their uniforms and into more comfortable clothes. Bruce's tears had dried, but he still looked anguished. Clint looked about the same. Nat looked scared, which was beyond terrifying. Thor looked like Thor, so wherever he was at least wasn't horrible. Tony didn't look like he was having a nightmare, or a panic attack, or anything like that. Steve had plenty of experience thanks to their little therapy agreement. But he didn't look happy. He seemed sad, a bit resigned. Disappointed.</p>\n<p>Once they were all settled in the living room, Steve found an earpiece connected to JARVIS and stuck it in Tony's ear. The AI could talk him out of anything, from panic attacks to intense \"creative zones\" to manic science-speech. </p>\n<p>Peter came back with half a dozen toasters and several boxes of poptarts. Steve snorted as he plugged them all in and started cooking. Soon the room was saturated with the smell of cooking poptarts, the thunder god's favorite treat. </p>\n<p>\"If you don't wake up soon, I'm eating all of them,\" Peter threatened an unconscious Thor. Five minutes later, he followed through with his threat and started another batch. </p>\n<p>Steve studied Nat as she squirmed, like a child in a bad dream. She never admitted when she was afraid, but she did tell him a tiny bit about her childhood, how she used to have a stuffed animal and...</p>\n<p>He looked at the time, grimaced at the late-night numbers, and made the call anyway. </p>\n<p>\"Judy,\" he said as soon as it picked up. \"I know it's late, but the Avengers need a favor.\" </p>\n<p>The elderly woman from the animal shelter sucked in a breath. \"All right.\" </p>\n<p>To Judy's credit, she didn't snort or sound disbelieving after he explained the problem and possible solution. She just said, \"You'll want Snickers. He's Natasha's favorite and loves to snuggle. There's a couple stopping by tomorrow to adopt him, but I can take him to Avengers Tower in...twenty minutes?\" </p>\n<p>Steve grinned. \"You're a peach.\" </p>\n<p>While he waited for Judy, Steve looked at Clint. \"Hey JARVIS, do you think you can compose a playlist of Clint's favorite tunes? Only songs that have come out since Peter first entered the tower.\" </p>\n<p>\"I'm downloading it to your phone now, Captain.\" </p>\n<p>Steve was putting the earbuds in Clint's ears with the modern country music playing when a sleepy voice asked, \"Poptarts?\" </p>\n<p>Peter whooped. \"Welcome back, Thor! Also, don't be mad, but I ate about half of your stash. It was for the greater good, you see.\" </p>\n<p>Thor slowly sat up, rubbing his eyes. He looked around the room. \"What happened?\" </p>\n<p>Steve left Peter to explain as Judy arrived in the lobby. He took the tan, sleepy cat from her arms, went back upstairs, and gently set him against Natasha. Sure enough, after finding a comfortable spot, Snickers the cat curled up against her stomach. </p>\n<p>\"I see,\" Thor said gravely. \"Mine was no nightmare, but it is an unfortunate inevitability.\" </p>\n<p>\"What?\" Peter asked. </p>\n<p>\"I was living a hundred years from now. You weren't.\" </p>\n<p>Steve cringed. </p>\n<p>Thor stood, walked over to Steve, and gripped his shoulder. He smiled. \"Fear not. I may yet live for several millennia, but so will my parents, and my Asgardian sheidbrothers. I will never be alone.\" </p>\n<p>Steve squashed the pang of jealousy before it fully formed. \"I'm glad.\" </p>\n<p>Thor grinned. \"Don't be too glad. They do not have poptarts!\"</p>\n<p>Peter handed him a mountain of toasted sweets before going straight for Natasha. He pulled out his phone and took half a dozen pictures, smirking. </p>\n<p>\"She's going to kill you, you know,\" Steve warned. </p>\n<p>\"Worth it.\" Peter put his phone away. His smile slipped when he looked at Bruce. \"What to do with you...\"</p>\n<p>He was still thinking when Tony stirred. Iron Man groaned, then blinked at the ceiling. \"Oh, thank God. No hangover.\" </p>\n<p>\"Would you like a poptart?\" Thor offered. </p>\n<p>Tony gagged. \"No. I'm still half-convinced I OD'd on cocaine. Gonna be a while before I know I can keep anything down.\" </p>\n<p>\"What now?\" Steve asked, alarmed. </p>\n<p>He winced. \"Yeah, the whole...spell thing-y, god I hate magic...made me think that Iron Man and the Avengers were just a really vivid drug-induced hallucination. Though I've gotta say, it was nice being twenty again.\" </p>\n<p>Steve didn't want to think of young Tony, trying to find solace in drugs in his grief after losing parents who didn't give a damn about him in the first place. But he knew just the thing to cheer him up. \"I punched Howard.\"</p>\n<p>Tony paused. \"What?\" </p>\n<p>Steve explained. By the time he was done, Tony was back on the floor, only this time he was laughing. </p>\n<p>\"Quiet down,\" Natasha grumbled, snuggling closer to Snickers. </p>\n<p>\"Nat?\" Steve called softly, shaking her shoulder. \"You with us?\" </p>\n<p>\"Yes, I'm curse-free. Yes, it was horrible. No, I will not tell you, it had to do with the Red Room. Now shush, Snickers is leaving tomorrow and I want to spend time with him.\"</p>\n<p>Steve grinned. \"Fair enough.\"</p>\n<p>\"You could've stayed,\" Tony said quietly. All the amusement from before was gone. \"You didn't have to try to remember. You could've stayed in your time. Married Peggy. Hung out with your Commandos.\" </p>\n<p>Steve shook his head. \"It wasn't real.\" </p>\n<p>\"And if it was?\" he asked. He wasn't looking at Steve, instead studying the ceiling with intense interest. \"If you could go back. For real. Without any horrible consequences.\" </p>\n<p>Steve had to think about that, which was weird because he used to ask himself this very question every day. Then it was every week. Now, it was maybe once a month. </p>\n<p>\"The answer to that question stopped being 'yes' a long time ago,\" Steve said.</p>\n<p>Tony looked about two seconds from crying. He smiled. \"Good. Because time travel always has the worst consequences.\"</p>\n<p>Steve chuckled. He looked around, only to realize they were down an Avenger. \"Where's Peter?\" </p>\n<p>\"He went to retrieve something to wake the doctor,\" Thor said.</p>\n<p>Tony sputtered when he saw Bruce. \"Who made him cry?!\"</p>\n<p>\"People who are now dead,\" Steve promised. He looked at Clint, frowned when he realized the archer wasn't awake, and decided to risk his life. \"Natasha, I need to move you three feet.\" </p>\n<p>She opened one eye and glared at him. </p>\n<p>\"Clint's not waking up.\" </p>\n<p>\"Fine,\" she grumbled. She picked up an equally grumpy-looking Snickers, scooted over to Clint, then dropped on him, using his stomach as a pillow. Steve had seen this position a hundred times both ways. She would give Clint a head-rub if he had a horrible day, and he'd do the same for her. Steve gently took Clint's limp hand and rested it on Natasha's forehead. </p>\n<p>Peter came back with a stack of books. Steve recognized the Harry Potter series. He frowned in confusion. </p>\n<p>\"He likes being read to,\" Peter defended, sitting next to Bruce. \"I don't think anyone ever did that for him as a kid.\" </p>\n<p>\"Not if what the police reports say are true,\" Tony grumbled. He settled himself against the cushions and closed his eyes. \"JARVIS has a voice-modulator if you want. He can make Dumbledore sound like Morgan Freeman if you want.\" </p>\n<p>\"Oh, that's who they should've cast for the movies,\" Steve said. </p>\n<p>\"Now bear with me,\" a new voice said. \"Samuel L. Jackson.\" </p>\n<p>They turned to see Clint, wide awake, rubbing Natasha's head with one hand and pulling out an earbud with the other. \"Wouldn't that be the most badass Dumbledore ever?\" </p>\n<p>Steve's face twisted. \"I don't see it.\"</p>\n<p>Peter clearly disagreed. \"I think you're on to something.\" </p>\n<p>\"'I recognize that the Ministry has made a decision,'\" Tony said in a swaggering Jackson-esque voice, \"'but given that it's a stupid-ass decision, I've elected to ignore it.'\"</p>\n<p>Clint giggled, \"'Harry, you little shit, did you put your name in the Goblet of Fire?'\"\n</p>\n<p>\"'I have had it with these motherfuckin' basilisks in this motherfuckin' castle!'\" Tony laughed. \"That's it. I'm getting Hollywood to remake the entire series.\" </p>\n<p>\"Too soon,\" Natasha protested.</p>\n<p>\"Not with Samuel Jackson.\" </p>\n<p>Peter snorted and opened the first book. \"Whatever. I'm gonna start reading. If you don't like it, we can move.\" </p>\n<p>\"Nay, I'd like to hear this story of witchcraft,\" Thor said, settling next to Steve. \"Despite having just recovered from a sleeping spell, I find myself quite tired.\" </p>\n<p>\"Is that normal?\" Steve asked. He'd been running on mostly adrenaline, but now that most of the danger was over he was getting exhausted.</p>\n<p>\"Indeed.\"</p>\n<p>\"Steve.\" Clint held up the phone and earbuds. \"Thanks.\" </p>\n<p>Steve took it. \"Do you want to talk about it?\" he asked lowly. </p>\n<p>Clint didn't say anything. For a long moment, the only sound in the room was Peter reading aloud. Just when Steve thought Clint was never going to talk, he said, \"It was Loki. He came back with the scepter. I...\" He swallowed. \"You guys tried not to hurt me. You missed, on purpose. I didn't.\" </p>\n<p>Natasha hadn't opened her eyes, but she curled closer to Clint. Steve grimaced and gave him a sideways hug, careful not to dislodge anybody. \"That's never going to happen. We've faced mind-control before and always beat it. It's one of the reasons we spar each other so much.\" </p>\n<p>Clint gripped the front of Steve's shirt. \"Promise me, Steve,\" he whispered. \"I would...I'd rather be dead than get any of you killed. Promise me you'll make sure of it, if another Loki happens.\" </p>\n<p>Steve cringed. \"I promise. We won't let you hurt anyone.\" </p>\n<p>Clint relaxed. Probably because he missed the fact that Steve just promised to stop him, not kill him.</p>\n<p>Steve didn't let go of his teammates as they drifted back to sleep. Peter dutifully read on, mixing his voice for the different characters. Steve let his eyes slip closed. </p>\n<p>--<br>\n--</p>\n<p>Peter was halfway through <em>The Chamber of Secrets</em> when Bruce finally opened his eyes. </p>\n<p>\"Peter?\" he asked in a small voice. </p>\n<p>The teen grinned and set the book down. He looked up to call the others' attention, only to find that they were all passed out. He snorted. \"Wow. <em>Nobody</em> stayed awake to listen to me. Real nice, guys.\" </p>\n<p>Bruce turned over so fast Peter thought he'd get whiplash. He stared at his teammates, then at Peter. Slowly, he reached out and touched Peter's sleeve. \"You're real?\" </p>\n<p>\"Uh, last I checked,\" he said. \"Let me guess: Hulk smash?\" </p>\n<p>Bruce looked away. </p>\n<p>\"Hey, come on.\" Peter tugged on Bruce's shirt until he was facing him again. \"It was just a dream. Hulk would never hurt us.\"</p>\n<p>He blinked, and suddenly he was pulled against Bruce's chest, being hugged within an inch of his life. </p>\n<p>\"You were dead,\" Bruce said, his voice wavering. \"You were all dead. And it was my fault. And Ross got me and had me in a cell. And...and then I heard your voice and thought I was going crazy.\" </p>\n<p>Peter winced. \"Okay, that's kind of the opposite of what I wanted. You're the only sane person in this group, we kind of need that.\" </p>\n<p>Bruce gave a wet chuckle. \"No, it's good. It's fine. I followed it. You brought me back.\" </p>\n<p>Peter tightened the hug. \"Always will, buddy. Always will.\"</p>"
}