{
  "id": "12199032",
  "url": "https://archiveofourown.org/works/12199032?view_full_work=true",
  "author": [
    "springrain21"
  ],
  "title": "Winter Blues",
  "rating": "Not Rated",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "방탄소년단 | Bangtan Boys | BTS"
  ],
  "relationships": [
    "Min Yoongi | Suga/Park Jimin"
  ],
  "characters": [
    "Min Yoongi | Suga",
    "Park Jimin (BTS)"
  ],
  "additional_tags": [
    "yoonmin",
    "Alternate Universe-Magic Is Known",
    "Romance",
    "witch!jimin",
    "cat!Yoongi",
    "Fluff",
    "Humor",
    "Mutual Pining",
    "Yoongi POV",
    "Tooth-Rotting Fluff",
    "SO MUCH FLUFF",
    "Sexual Content",
    "Kissing",
    "Love Confessions",
    "jimin is a really crappy witch",
    "yoongi is just really soft for him",
    "yoongi falling madly in love with jimin while he's a cat?",
    "its a yes from me",
    "the other members are only mentioned like once",
    "sorry my sons"
  ],
  "language": "English",
  "series": "Part 3 of YFR Yoonmin Fantasy Bingo",
  "published": "2017-09-27",
  "completed": "2017-09-27",
  "words": "14,685",
  "chapters": "3/3",
  "comments": "184",
  "kudos": "6,438",
  "bookmarks": "1,392",
  "hits": "64,640",
  "summary": "<p>Yoongi is turned into a cat by a sorceress, and novice witch Jimin finds him and takes him home.<br>Fluff and feelings ensue.</p>",
  "notes": "<p>NOTICE: I do not allow translations of any of my works.</p>\n<p>This is my third entry for the <a href=\"https://archiveofourown.org/collections/yfrfantasybingo\" rel=\"nofollow\">Yoonmin YFR 2017 Fantasy Bingo</a> and fulfills the \"Familiar\" tile I was given. This was so much fun to write and I hope everyone enjoys it!<br></p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>P.S. The kitten's name is Empress Alfalfa</p>",
  "text": "<p>  Min Yoongi is not having a good day.</p>\n<p>  For one thing, he’s just been turned into a fucking cat by a bitter sorceress.</p>\n<p>  The sorceress in question is standing over him, hands on her hips and looking awfully pleased with herself. She’s a pretty young thing with long dark hair and big brown eyes. The exact opposite of Yoongi’s type.</p>\n<p>  He’d told her as much when she’d come onto him in the coffee shop where Yoongi was waiting grumpily for his morning caffeine fix. He’d promptly rebuffed her advances, so not in the mood to deal with this shit so early in the day. She’d been visibly offended, stalking back to her table while muttering something under her breath.</p>\n<p> With his steaming hot coffee in hand, Yoongi had exited the shop and cut through the alley next door, a shortcut back to his apartment. Unbeknownst to him, the young woman had followed him into the abandoned alley.</p>\n<p> <em> “Allerio ma shaek ackni anni,”</em> a feminine voice calls out behind him, the words oddly warped and echoey.</p>\n<p>  The next thing he knows, there’s a puff of pink smoke and Yoongi is staring up at the woman, who is suddenly the size of a freaking giant. His coffee drops to the ground and explodes all over the pavement, and he jumps to avoid the hot spray.</p>\n<p> Except he doesn’t jump back on two human legs. No, he jumps back on four little legs. Cat legs. Yoongi stares down at himself, sees a fluffy chest and soft little paws. Looks behind him and sees a long, bushy, bottlebrush tail.</p>\n<p>  Not only is he a cat. He’s a blue cat. Fucking royal blue, just like how he'd dyed his hair last week. Apparently the young woman has a sense of humor. He stares up at her balefully, not even believing this shit.</p>\n<p>  <em>“Are you fucking kidding me?”</em> He asks, but it comes out as a series of raspy meows.</p>\n<p>  She still seems to be able to understand him though, and she grins nastily down at him. “That’ll teach you to be so disrespectful,” she crows, reaching down to pet his head patronizingly. Yoongi swipes a clawed paw at her, his hackles raising. It’s a strange sensation. She pulls back, laughing meanly.</p>\n<p>  <em>“You’re a fucking witch, I take it?”</em> Yoongi meows, glaring at her. He wonders what color his new cat eyes are.</p>\n<p>  She tuts and wags at finger at him. “A sorceress, honey bear. Much more powerful.”</p>\n<p>  Yoongi flicks his fluffy tail irritably. It feels so weird. “<em>A sorceress. Of fucking course. They can never take rejection well, the psycho bitches.”</em></p>\n<p>  The sorceress narrows her eyes dangerously at him. “Watch yourself, fur ball. I could turn you into a pile of dust with a snap of my fingers.”</p>\n<p>  Yoongi’s ears involuntary flatten against his head. <em>“Do it then, you bitter bitch.”</em> Yoongi really needs to learn when to shut up.</p>\n<p>  The sorceress’ lips tighten, and for a second, Yoongi thinks she actually will. Then she shakes herself off and smiles cruelly down at him. “Nah. I think this’ll be more fun.”</p>\n<p>  She takes a step back and panic flares in Yoongi's chest. <em>“Where are you going?”</em></p>\n<p>  She glances down at her watch. “I have Pilates in fifteen minutes. See ya around!”</p>\n<p>  <em>“Wait!”</em> Yoongi cries, though it just comes out as a loud yowl.<em> “Okay, okay, you've had your fun. Turn me back now.”</em></p>\n<p>  She just laughs humorlessly and shakes her head. “Mmmm, don't feel like it. Have fun, fur ball.” Then she snaps her fingers and disappears in a cloud of pink smoke.</p>\n<p>  All that remains in the empty alley is a stinky dumpster, a spilled coffee, and a royal blue cat.</p>\n<p>  Well, shit.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> <br>    For three days Yoongi roams around the city, starving and miserable.</p>\n<p>  He has to dig through dumpsters and trash cans to try to find scraps of food to eat, which results in his blue fur stinking to the high heavens. He’s cold and tired and just wants to go to sleep, but nowhere is safe on the streets. Just yesterday he’d almost become a dog’s dinner when he’d strayed too far into a neighborhood in search of something to eat. He’d narrowly avoided its snapping jaws before racing back the way he’d came, ears flat against his head and tail fluffed up.</p>\n<p>  His soft pink paw pads are cracked from the constant contact with the rough pavement and concrete. He’s taken to sleeping on a slab of damp, moldy cardboard under a dumpster at night, shivering and trying not to inhale to stench around him too deeply. He keeps his distance from people, not sure how they’d react to seeing a blueberry colored cat on the street, and not wanting to find out. Yoongi prays to god that he doesn’t have fleas. He doesn’t think he’d ever be able to live that down.</p>\n<p>  He’s been keeping his eye out for the sorceress, hoping that if he sees her again he’d be able to convince her to turn him back, but no such luck. So Yoongi has taken to camping outside a popular occult shop at the end of a busy street. There’s a skinny alley way directly across the street from the shop, and Yoongi sits behind a dented trash can to watch to front door.</p>\n<p>  His hope is that he’ll see someone who will be able to help him with his situation. Although the shop has its fair share of regular humans who just like to check it out, it’s also a popular stop for actual magic users. Yoongi hopes that he’ll be able to find someone who’s the real deal to help him.</p>\n<p>  Yoongi has been crouched behind the trash can for a good two hours, muscles stiff and stomach rumbling. The winter air is harsh and cold and blows against the tufts of his blue fur, making him shiver. It looks like it’s going to snow tonight, and Yoongi doesn’t know what he’s going to do.</p>\n<p>  His eyes catch on movement across the street, and Yoongi watches a man walking down the sidewalk towards the occult shop. All that Yoongi can tell from this distance is that he’s wearing a big grey hoodie and he has blonde hair, but something about him has Yoongi perking up. The man disappears inside the shop, and Yoongi waits tensely for him to come back out.</p>\n<p>  He doesn’t have to wait too long. About ten minutes later the man pushes back out with a small brown bag clutched in one hand. Instead of leaving the way he’d come, the man starts walking across the street towards the alley. Towards Yoongi.</p>\n<p>  Yoongi freezes and presses himself to the ground behind the trash can. He enters the alley, not even seeing Yoongi trying to hide from sight, the bag swinging in his grip. He seems to be going through a checklist, lips pursed in concentration.</p>\n<p>  “Dragonfly wings, eye of newt, pixie dust,” he mutters to himself, ticking off a finger with each item. He passes barely a few inches by Yoongi, and the blue cat stealthy begins following him a moment later, pressing close to the wall of the alley. There’s something about this stranger that calls to Yoongi.</p>\n<p>  “Still need werewolf fangs and cuttlefish fins,” the human is still talking to himself as he walks, unaware of Yoongi trailing him in the shadows.</p>\n<p>  He’s almost at the other end of the alley when he suddenly stops and spins around. “Who’s there?”</p>\n<p>  Yoongi freezes, but it’s already too late. The human has seen him.  His eyes zero in on the skinny blue cat crouched on the rough, wet pavement, staring up at him with horrified green eyes.</p>\n<p>  They stare at each other for a minute before the human seems to shake himself. “Hey there, little guy,” he says softly. He sinks down slowly onto his haunches and lifts a hand in Yoongi’s direction.</p>\n<p>  This close, Yoongi can see he’s actually pretty young. Probably only a few years younger than Yoongi himself. He’s got fluffy hair the color of wheat and a really pretty face. Full lips tilted up in a gentle smile and soft brown eyes curved into half-moons. His jaw is sculpted but his cheeks are round and soft, stained pink from the cold air.</p>\n<p>  “It’s okay, I’m not gonna hurt you,” he says calmly, his voice soft and light. Something about this boy’s aura is calming and soothing, and maybe it has something to do with his new cat senses, but Yoongi can't help but feel a sense of safety.</p>\n<p>  Yoongi takes a tentative step forward, drawn to this young man for some reason. A gust of wind blows down the alley and hits Yoongi, making him shiver hard. The blonde frowns and wiggles his fingers enticingly.</p>\n<p>  “You look cold,” he says, his eyes sweeping over Yoongi’s ratty cat form. He’s fucking freezing, and this kid’s warmth calls to him.</p>\n<p>  Yoongi takes a few more slinking steps forward until he’s level with the kid’s small, chubby fingers. The human waits patiently while Yoongi stretches out his neck and takes a few hesitant sniffs. He smells like vanilla and toffee, the pleasant scent amplified by Yoongi’s cat nose. Now <em>this</em> boy is definitely Yoongi's type.</p>\n<p>  Yoongi takes one more step closer, jumping and tensing when those small fingers gently begin scratching behind his ears. It’s humiliating. He’s a human, for christ’s sake, getting his ears scratched by another human. But it feels so fucking good that a loud purr starts rumbling in his throat, startling him a little. It tickles.</p>\n<p>  He leans into the blonde’s touch, eyes drooping when the fingers scratch around the scruff of his neck. “You’re a pretty kitty,” the human coos to Yoongi, who feels his paw pads heating up in a blush. “Why are you blue, though?”</p>\n<p>  Yoongi flicks his bottlebrush tail a little irritably, and the human giggles. It’s a soft sound, sweet and a little squeaky. “Sorry, I didn’t mean to offend you.”</p>\n<p>  Yoongi allows the human to keep scratching him for a while, going almost limp with pleasure. Then the boy perks up and bops Yoongi gently on his black nose. “Hey, maybe you were meant to be my familiar,” he gasps, making Yoongi squint at him. He leans closer to Yoongi and whispers conspiratorially, “I’m a witch, you know.”</p>\n<p>  Yoongi’s eyes widen and his ears perk up. The blonde giggles again and rubs Yoongi’s temples. “Do you want to come home with me?”</p>\n<p><em>  \"Can you turn me back into a human?”</em>  Yoongi asks, the question coming out as a series of loud meows. He boy giggles gleefully and stands up.</p>\n<p> “I’ll take that as a yes,” he says happily, then reaches down to pick Yoongi up.</p>\n<p>  It’s awkward and uncomfortable, but the human is cradling Yoongi to his chest, and he’s so warm and smells so good that Yoongi can’t help but snuggle closer.</p>\n<p>  The human begins walking again, now with a blue cat in his arms. “I live a few blocks from here,” he tells Yoongi.</p>\n<p>  Yoongi lets out a world-weary sigh and settles in for the journey.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>  </p>\n<p> </p>\n<p>  The boy’s apartment is small and untidy, but cozy and homey and smells of vanilla and toffee. It's blessedly warm inside and Yoongi feels the tension beginning to seep from his body. The human sets Yoongi down on the kitchen floor and starts rifling through the cupboards.</p>\n<p> “I don’t have any cat food right now, I’ll have to go shopping for that later. Will tuna be okay for now?”</p>\n<p>  Yoongi is so hungry he would’ve eaten just about anything. When the human sets a plate of tuna in front of him, he inhales it like a vacuum.</p>\n<p>  “Not so fast, you’ll get sick,” the human warns him, sitting down on the kitchen floor next to him. Yoongi pays him no mind as he licks up the last remnants of tuna juice from the plate.</p>\n<p>  “I wonder what I should name you,” the kid muses to himself, and Yoongi turns his piercing gaze on him.</p>\n<p>  <em>“My name is Min Yoongi,”</em> he meows reproachfully.</p>\n<p>  The blonde snaps his fingers. “How about Señor Cutiebutt?</p>\n<p>  Yoongi blanches. <em>“You've got to be fucking kidding me.”</em></p>\n<p>  The human must mistake Yoongi's yowl of outrage as a cry of agreement. He claps his hands together and giggles happily. “Señor Cutiebutt it is,” he motions to himself. “I'm Jimin, your new daddy.”</p>\n<p>  Yoongi snorts but it comes out kind of like a coughing sound. <em>Daddy my ass,</em> he thinks to himself snarkily.</p>\n<p> Yoongi blinks balefully up at Jimin, not sure what to do now that he's eaten. Jimin, on the other hand, has a tense look on his face.</p>\n<p>  “Hey, no offense, but you smell really bad,” Jimin says apologetically, and Yoongi’s tail puffs up in offense. “Would you shred me to pieces if I gave you a bath?”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>  Yoongi does not shred Jimin to pieces. Instead he sits still in the bathtub, warm water up to his chest, and closed his eyes while Jimin scrubs him down with soap. Jimin's fingers massage into every inch of Yoongi's fur and it feels so wonderful he starts purring again.</p>\n<p>  “You're a funny cat,” Jimin says, soaping behind Yoongi's neck. “Aren't you supposed to hate water?”</p>\n<p>  Yoongi ignores him and instead leans further into Jimin’s touch. It should be weird; Jimin is washing what is technically Yoongi’s naked body. He doesn't really want to think about that right now.</p>\n<p>  Once Jimin's done soaping him up, he turns on the tap and begins pouring fresh warm water all over Yoongi to wash out his fur. He avoids Yoongi's face and ears and pays special attention to his belly fur, which makes the cat purr harder.</p>\n<p>  Finally he pulls Yoongi, looking like a drowned blue rat, out of the tub and sets him on a towel. Before Yoongi even has a chance to start getting cold, Jimin is swaddling him in another towel and rubbing him dry. It's a little rough, but Yoongi doesn't mind, enjoying the pampering. Jimin discards the damp towel, wraps him in a new one, and carries Yoongi to the couch like a baby. He settles crossed-legged on the couch, places the wrapped up Yoongi in his lap, and turns on the TV.</p>\n<p>  It's getting dark out now, and the warmth of the towel and the heat of Jimin’s body is making him sleepy. Jimin turns the channel to some black and white film while he scratches behind Yoongi’s ears and yawns.</p>\n<p>  “Tomorrow I'll go shopping and pick you up some stuff,” Jimin tells him. Yoongi settles more comfortably in his lap, too tired to be embarrassed. This is the safest and warmest he's felt in what feels like forever, and he's going to savor it, damn it.</p>\n<p>  Yoongi must have dozed off in Jimin’s lap, because the next thing he knows, he’s being carefully lifted and then set down on something soft. Yoongi cracks a green eye to see he's lying at the foot of Jimin's bed while the kid walks into the bathroom. Yoongi hears the shower running a moment later, and he sits up with a mighty arch of his back and a wide yawn.</p>\n<p>  Outside the window next to Jimin's bed, Yoongi sees that it's started to snow, and he shivers just looking at the fluffy white particles blowing around wildly.</p>\n<p>  His fur is dry now, but it's sticking up in every direction, much to his annoyance. Yoongi busies himself with licking down his fur in attempt to tame it. He wrinkles his nose in disgust when he feels the long strands catch on his scratchy tongue.</p>\n<p>  Jimin comes out of the bathroom a little while later with nothing but a towel around his waist and damp blonde hair. Yoongi stops grooming himself mid-lick and stares.</p>\n<p>  Shit, he's <em>toned</em>.</p>\n<p>  Jimin walks back into the bedroom, pats Yoongi’s head as he passes, and walks up to his dresser to grab some pajamas. Jimin drops the towel and Yoongi jerks his gaze away. But not before he gets an eyeful of an extremely plump and firm ass.</p>\n<p><em>  You fucking pervert,</em> Yoongi scolds himself while he pointedly stares up at the ceiling while Jimin gets dressed.</p>\n<p>  Jimin dresses in an oversized blue sweater that almost reaches his knees and plaid pajama pants. He pulls back the sheets of the bed and climbs in, rolling onto his side and making kissing noises at Yoongi while he pats the bed.</p>\n<p>  “Come here,” Jimin tries to coax, but Yoongi just gives him an unimpressed look. Jimin just shrugs and leans over to turn off the bedside lamp. “Goodnight, Señor Cutiebutt.”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>  The next morning, Yoongi wakes up enveloped in warmth. He cracks an eye to find himself face to face with a sleeping Jimin, the human’s arms wrapped around his body.</p>\n<p> Sometime during the night Yoongi had gotten cold at the foot of the bed and crawled under the covers with Jimin, seeking the boy’s incredible warmth.</p>\n<p>  Yoongi's green cat eyes trail over Jimin’s peaceful face while he sleeps. His full lips are slack and puckered against the pillow, and his blonde hair is sticking up in every direction. His long lashes splay across his cheekbones, and the light filtering in through the window leaks across his body and lights up his smooth, honey tan skin.</p>\n<p>  He looks like a slumbering angel, Yoongi finds himself thinking in awe.</p>\n<p>  Then he shakes himself when he realizes what he's doing and stands up with a stretch. Jimin's arms slip from around him, and the movement makes him stir. Jimin's sleepy eyes blink open and a soft smile graces his features when he sees Yoongi.</p>\n<p>  “Good morning, Cutiebutt,” Jimin says in an adorable voice raspy with sleep. He reaches a hand out to scratch behind Yoongi's ears, who leans into the touch despite himself.</p>\n<p>  Jimin sits up in bed and rubs his eyes. He has creases indented in his cheek from the pillow. “Hungry?” He asks Yoongi, who perks his ears and meows a loud affirmative. Jimin laughs and slides out of bed, and Yoongi hops off to follow him out into the living room, tail held high.</p>\n<p>  Jimin gives him another plateful of tuna and pulls out some cold, leftover kimchi from the fridge for himself. Yoongi looks between the plate on the floor and Jimin at the table. Finally he leaves the tuna and hops up on the table next to Jimin, who cries out, “Hey!”</p>\n<p>  Before Jimin can stop him, Yoongi bends his head and starts eating the kimchi straight from the plate. “Hey! Cutiebutt, stop that!” Jimin tries to push him away, but Yoongi just swats at him with paws and keeps eating. It's probably the most delicious thing he's ever tasted before.</p>\n<p> Jimin slumps back in his chair and watches Yoongi in disbelief. “Unbelievable,” he mutters as Yoongi gobbles up his breakfast. It's probably not very good for him in his cat form, but he doesn't really care.</p>\n<p>  Jimin tries to shoo him away a few more times before he gives up and lets Yoongi eat the rest of the kimchi, instead pouring a bowl of cereal for himself.</p>\n<p>  “Will you be okay here by yourself while I go pick up some stuff at the store?” Jimin asks a while later when he's washing the dishes. Yoongi gives a little <em>mrrow</em> of affirmation and goes back to cleaning his face with his paw.</p>\n<p>  Jimin leaves the TV on for him while he's gone, and Yoongi curls up to watch reruns of Boys Over Flowers. He'd fallen asleep when Jimin gets home, but the rattle of keys in the door wakes him. Jimin pushes the door opened, arms laden with grocery bags, and Yoongi sits up on the couch to watch him.</p>\n<p>  “Hi, Cutiebutt,” Jimin calls to him, and Yoongi rolls his eyes at the name. “Were you okay while I was gone?”</p>\n<p>  Yoongi jumps off the couch and prances across the floor into the kitchen, hopping up on the table to watch as Jimin starts unloading stuff from the bags.</p>\n<p>  There's a small litter box and a bag of litter, some cats toys, and a rectangle cardboard scratcher. When Yoongi sees a bag of dry cat food come out next, he immediately swipes at it with his paw, sending it crashing to the ground.</p>\n<p>  Jimin yelps and jumps back in alarm. “What the hell!”</p>\n<p><em>  “I’m not eating that crap,”</em> Yoongi snaps at Jimin, his meows loud and plaintive. Jimin picks up the bag and glares at Yoongi.</p>\n<p>  “Stop being a little brat,” Jimin bites at him, and Yoongi feels his tail start fluffing up. Jimin sets the cat food back on the table, not fast enough to stop him when Yoongi once again sends it crashing to the tile.</p>\n<p>  “Stop it!” Jimin cries angrily, his cheeks all flushed and his eyes wild. He's cute when he's mad.</p>\n<p>  Yoongi sniffs the air snootily and pointedly turns his back on Jimin.</p>\n<p>  Dinner is a dramatic affair where Yoongi absolutely refuses to eat the bowl of cat food Jimin sets before him. He meows and meows and meows until Jimin finally gives up with a loud cry and gives Yoongi some of his instant ramen. The blue cat slurps it up happily and laughs to himself at the look on Jimin’s face.</p>\n<p>  They watch TV together after that, with Yoongi dozing off in Jimin’s lap as the blonde scratches his neck.</p>\n<p>  “Will you be okay tomorrow? I have school all day and then practice after, so I won't be home until the evening,” Jimin says later that night when they're in bed.</p>\n<p>  Yoongi is by Jimin's legs, but he has a feeling he’ll be joining Jimin under the covers soon. Yoongi doesn't like the thought of being home alone all day without Jimin or anything to do, but there's not much he can do about it. He kneads at Jimin’s leg under the covers in answer.</p>\n<p>  “You know, sometimes I feel like you actually <em>can</em> understand me,” Jimin says, making Yoongi snort-cough in amusement.</p>\n<p>  <em>If you only knew, kid.</em></p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>  Yoongi learns many things about Jimin in the weeks that follow. His full name is Park Jimin, he's originally from Busan, and he's a dance major at the local college. Everyday after school he spends two hours practicing with his dance mates, Hoseok and Jungkook. He hates mangoes and loves super sugary tea in pretty cups. He always does his laundry at the same time every week. He folds his underwear. He sings to himself whenever he gets the chance. He always leaves the TV on for Yoongi when he's not home. He loves extra marshmallows in his hot chocolate. He has a particular fondness for black licorice, which Yoongi will never understand.</p>\n<p>  Yoongi learns that Jimin is soft and gentle and warm and kind, and so full of love it's incredible to Yoongi. He wakes up every morning cuddled in Jimin's arms, and every morning he's struck again by how beautiful he is.</p>\n<p>  He also learns that Jimin is a terrible fucking witch. One time he'd tried to cast a glamour spell on himself and had instead turned the wallpaper of his apartment a putrid yellow color. Another time he'd tried to brew a shrinking potion and almost caught his hair on fire when it exploded.</p>\n<p>  “I just need more practice!” Jimin had defended himself shrilly at Yoongi’s deeply judgemental look.</p>\n<p>  Yoongi is curled up on the couch watching a Korean dubbed version of Men in Black when he's startled by the doorknob rattling. He jumps up and glances at the clock above the TV. Jimin isn't supposed to be home for another two hours.</p>\n<p>  The door opens and Jimin pushes inside, and the first thing a Yoongi notices is that he's crying. Alarm and panic flaring inside him, Yoongi leaps off the couch and runs to Jimin.</p>\n<p> <em> “Jimin, what's wrong?!”</em> Yoongi yowls at him, twining around and around Jimin's ankles, staring up at him in concern. <em>“What happened? Are you okay?”</em></p>\n<p>  Jimin drops his stuff on the table and walks across the living room to flop down on the couch, eyes red and blotchy and wet with tears. Yoongi jumps into his lap and stares intently at his face, his heart breaking at the sight in front of him.</p>\n<p>  <em>“What happened?”</em> He demands in a raspy meow.</p>\n<p>  A sob rips through Jimin’s chest and a fresh wave of tears spills down his face. Desperate, Yoongi rubs his head against Jimin’s chin and purrs as hard as he can, trying to calm him down. <em>“Don't cry, Jiminie, it's okay. Please don't cry.”</em></p>\n<p>  Yoongi stands up in Jimin’s lap and places his paws on either side of his chest, bringing them face to face. He started licking at Jimin’s salty tears, earning a watery giggle from Jimin at the feeling of Yoongi’s rough tongue scratching against his skin. He's still purring furiously, booping his cold wet nose on Jimin’s cheeks between licks.</p>\n<p>  Jimin wraps his arms around Yoongi and buries his face in his soft blue fur, seeming to take comfort in the sounds of Yoongi's purring. They stay like this for a little while until Jimin is finally calmed down.</p>\n<p>  <em>“What happened, Jiminie?”</em> Yoongi asks again when Jimin finally pulls back. Jimin, unfortunately, doesn't answer.</p>\n<p>  Yoongi finds out later though when Jimin calls his best friend, Taehyung. Jimin is tucked under the warm covers of his bed with Yoongi pressed against his stomach. He'd refused to leave Jimin's side after what happened earlier, and Jimin seems to be grateful for his company.</p>\n<p>  “Hey, Tae,” Jimin says into his phone, sounding tired and subdued. “Yeah, I'm okay.” There's a pause while Taehyung probably asked what happened. “You know my awful psychology professor? The one who I'm positive is the actual antichrist and has it out for me? Well today she called me out during the lecture in front of everyone and asked me a question that we haven't even covered yet. I got it wrong of course, and then she called me an idiot in front of everyone, said I should focus on dance because I'll never be smart enough for an actual career, and a bunch of people laughed. I've never been so mortified and humiliated in my life.”</p>\n<p>  Yoongi feels rage sweep through him and he sees red. He clenches his hands--paws?--and vows that if he ever meets this woman he'll shred her to fucking pieces. Yoongi shoves his face into Jimin's armpit and purrs loudly. Jimin’s response to something Taehyung said is cut off by his giggles at the tickling sensation. He tries to push Yoongi’s face away but he just burrows deeper.</p>\n<p>  “It's-ah!-just Señor Cutiebutt,” Jimin giggles breathlessly into the phone.</p>\n<p>  He finally succeeds in pulling Yoongi's face out and bends down to press a kiss on his little furry head. Yoongi feels warmth overtake his body and he tingles pleasantly, little cat heart beating frantically in his chest.</p>\n<p>  “Well, if you want to meet him then come over,” Jimin says into the phone, stroking the bridge of Yoongi's nose. The scent of vanilla and toffee is so strong pressed up this close to Jimin, and Yoongi is drowning in it.</p>\n<p>  “Yeah, okay,” Jimin yawns loudly. “I'll see you tomorrow. Bye.”</p>\n<p>  He hangs up and places his phone on the bedside table. Yoongi crawls up to curl around Jimin's neck, purring softly when Jimin threads his little fingers into Yoongi's long fur.</p>\n<p>  “Goodnight, Cutie,” Jimin whispers, on the edge of sleep. Yoongi settles his nose into the crook of Jimin’s neck and sighs deeply.</p>\n<p> <em> “Goodnight, Jiminie.”</em></p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>  Jimin keeps trying to get Yoongi to play with the cat toys. He really doesn't want to, but Jimin keeps tossing the little green mouse over and over, a hopeful smile on his face.</p>\n<p>  “Go on! Get the mouse!” Jimin keeps cooing at him.</p>\n<p>  Finally Yoongi sighs in defeat and decides to humor him. If it'll make Jimin happy, he'll do anything.</p>\n<p>  He goes racing after the mouse when Jimin tosses it across the living room the next time, and Jimin laughs gleefully behind him. The sound is so pure and bright and wonderful that Yoongi decides acting like a cat for a bit is a small price to pay for it.</p>\n<p>  Jimin loses his mind when Yoongi carries the mouse back and drops it in front of him. “What a good little doggy,” the blonde croons at Yoongi, who rolls his eyes but secretly glows at the praise.</p>\n<p>  He plays fetch with Jimin for a while until he starts to grow bored. Jimin seems to sense it because he stands up and heads into the kitchen. He comes back with a bag of some shredded green stuff and sits down in front of Yoongi.</p>\n<p>  “You want some catnip?” Jimin asks him excitedly, ripping open the seal.</p>\n<p>  And, on no. Not gonna happen. Playing with toys is one thing, but Yoongi's seen how cats act when they're on catnip, and he's not about to act the fool in front of Jimin.</p>\n<p>  Jimin pinches a little of the herb between his fingers and sprinkles it on the carpet. Yoongi tries to ignore it and turn away, but his nose seems to have a mind of its own.</p>\n<p>  Next thing he knows he's sniffing at the carpet, and <em>holy shit.</em></p>\n<p>  It hits Yoongi like a bus. His heart suddenly starts hammering against his ribs and his blood starts singing, racing through his veins. He starts feeling drunk and a little loopy, and it's <em>incredible.</em></p>\n<p>  He shoves his face into the carpet and inhales deeply, feeling his body come alive. Yoongi rubs his face across the catnip, suddenly excited. His skin twitches. He flops onto his side and starts kicking at the carpet. Jimin is laughing.</p>\n<p>  Yoongi feels incredible! He could take on the world! He wants more. Wants to sniff, wants to lick, wants to eat! He's wild and free!</p>\n<p>  He rolls onto his back and claws at the air. He's fast and dangerous like a tiger!</p>\n<p>  <em>“Holy shit!”</em> Yoongi yells, his meows loud and warbling.</p>\n<p>  Jimin laughs again. It sounds a little distorted. It's the best thing he's ever heard. Yoongi rolls over and latches onto Jimin's leg. Jimin squeals but Yoongi sinks his claws in, kicks at Jimin with his back feet.</p>\n<p>  This is fun! Wow!</p>\n<p>  “Stop!” Jimin is still laughing, trying to retract his leg from Yoongi's grip. Yoongi swipes at him with a clawed paw when Jimin tries to push him away.</p>\n<p>  No! Jimin can't push him away! Jimin belongs to Yoongi! Jimin is<em> his</em>!</p>\n<p> <em> “Jimin is mine, can't give to anybody!”</em> Yoongi yowls madly.</p>\n<p>  Jimin is still laughing. He is so beautiful! Like an angel! Jimin makes Yoongi's heart race and his tummy feel all silly and fluttery!</p>\n<p>  Jimin grabs the mouse next to him and throws it hard.</p>\n<p>  Oooh, prey! Must attack! Must kill!</p>\n<p>  Yoongi jumps up and races after it like the lethal predator he is.</p>\n<p>  The crash hits Yoongi just as hard.</p>\n<p>  One minute he's diving at a piece of lint on the floor, and the next he's flopping onto his side and falling asleep, exhausted to the bone. Jimin's happy giggles twirl around his dreams.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>  Yoongi is really fucking glad he works for himself, or else he'd be in big trouble with a boss. He knows his parents have probably been trying to get ahold of him for the past month, but Yoongi's phone had been in his pocket when the sorceress had turned him, and he has no idea where it is now.</p>\n<p>  Slowly Yoongi is beginning to accept that he'll probably never be human again. He's tried to communicate to Jimin over and over what has happened to him and how he needs his help, but the young witch just doesn't understand.</p>\n<p>  That day when Jimin gets home from school, he finally brings Taehyung over to meet Yoongi. The kid is loud and has an incredibly deep voice, with big puppy eye and long ashy hair. He smells like cinnamon and too much cologne.</p>\n<p>  Jimin introduces them, and when Taehyung reaches out a hand to pet him, Yoongi narrows his eyes dangerously at him. Taehyung seems to get the hint and retracts his hand, looking spooked.</p>\n<p>  A little while later, Jimin and Taehyung are sitting on the floor of the living room playing cards, and Yoongi is on the couch staring at Taehyung, when he finally speaks up.</p>\n<p>  “I don't like him,” Taehyung says, pointing at Yoongi.</p>\n<p>  Jimin looks hurt and offended. “Why not?”</p>\n<p>  “He keeps,” Taehyung flaps his hands around. “Staring at me, like he knows all my deepest secrets and can understand everything I say. It's creepy. Plus, why is he blue? It's weird.”</p>\n<p>  Jimin glares at his best friend and strokes Yoongi's fur, as if he's worried the cat is offended. Yoongi just grins smugly at Taehyung, who gasps. “He just smiled at me!”</p>\n<p>  Jimin whips around to see Yoongi primly cleaning a paw. “What are you talking about?”</p>\n<p> Taehyung splutters loudly, eyes bugging out of his head. “I'm telling you, hyung, that's not a normal cat.”</p>\n<p>  Jimin rolls his eyes and grabs a new card. “That's because he's not a normal cat. He's my familiar and he's magical. And I'm pretty sure he <em>can</em> understand you, so be careful what you say.”</p>\n<p>  Taehyung leaves a while after that, muttering about alien cats and creepy smiles. Yoongi is relieved that he's gone and he gets to have Jimin all to himself again.</p>\n<p>  That night, Jimin is lying on his stomach on the bed studying, a highlighter sticking out of his mouth while he reads. Yoongi hops up next to him and comes face to face with the most glorious ass to ever exist. Yoongi's cat side must be starting to taking over, because he sees it and all he wants to do is <em>knead. </em>So Yoongi places both of his paws on Jimin's round, firm ass and begins kneading his cheeks as if they were bread dough. Jimin jumps and starts giggling madly, looking behind him at Yoongi, whose eyes are half closed and who is purring softly.</p>\n<p>  “That tickles,” Jimin complains through his laughter, wiggling his ass to try to dislodge Yoongi. Little kitty claws sink into his skin just enough to stop Jimin from moving and to keep him still.</p>\n<p>  When Yoongi realizes what the actual fuck he's doing, he freezes and his eyes go wide. Is he seriously kneading and groping Jimin's ass, for christ’s sake? How much more perverted can he get?</p>\n<p>  Yoongi jumps away from Jimin’s backside and instead stalks up towards his head. Jimin pushes aside his textbook and rolls onto his side, reaching out to scratch at Yoongi's scruff. Yoongi goes limp in pleasure and flops onto his side, closing his eyes as a purr starts rumbling in his throat. Jimin keeps scratching and rubbing until Yoongi is flat on his back, limbs splayed aside to allow Jimin access to the velvet soft fur of his belly.</p>\n<p>  He feels so content, so warm and safe, bathed in Jimin’s presence. He's starting to forget what his life was like before he was turned into a cat and met the young witch. Whenever he's around Jimin his heart races and fills with happiness.</p>\n<p>  It's when Jimin leans in and nuzzles his face into Yoongi’s warm belly and says, “I love you, Cutiebutt,” that Yoongi realizes;</p>\n<p>  Oh shit, he's completely head-over-heels (paws-over-tail?) in love with Park Jimin.</p>\n<p>  All Yoongi wants is to be with Jimin. And if the only way to do that is to remain a cat forever, so be it.</p>\n<p>  Sometimes Jimin accidentally leaves the window that leads out to the fire escape open, but Yoongi never leaves. The thought doesn't even cross his mind. And when Jimin gets home on those days, he throws open the door, looking frantic and panicked. But when he sees Yoongi curled up in his favorite spot on the couch, he gasps in relief and rushes over to him. He’ll engulf Yoongi in his arms and hug him tight, and Yoongi will think this is what true happiness is.</p>\n<p>  Today is Saturday which means Jimin will spend all day with him. Yoongi likes Saturdays the best. Sundays not so much, because that's when Jimin runs all his errands, so he's not home as much.</p>\n<p>  Yoongi wakes up from a short nap to find Jimin sitting on the living room floor, dozens of what look like spellbooks strewn around him. There are some candles lit on the coffee table next to Jimin’s overly-sugared tea, some pretty crystal cluster pendants, and some bottles of herbs.</p>\n<p>  Oh great, it looks like Jimin is trying to do magic again. Yoongi's whiskers quiver in dread.</p>\n<p>  <em>“What are you doing?”</em> Yoongi asks as he pads up to Jimin.</p>\n<p>  Jimin smiles at him and takes a sip of his tea. “Hey, sleepyhead.”</p>\n<p>  <em>“Jiminie, what are you doing?”</em> Yoongi meows again, nudging at one of the spellbooks with his paw to get his question across.</p>\n<p>  “I'm gonna curse my evil psychology professor,” Jimin announces. Yoongi's eyes widen in disbelief.</p>\n<p>  <em>“Don't be a fucking idiot,”</em> Yoongi yowls plaintively, fixing Jimin with a glare.</p>\n<p>  The young witch rolls his eyes at Yoongi and goes back to the spell book in his lap. “I don't need your attitude right now, mister.”</p>\n<p>  So Yoongi watches from the couch while Jimin puts together the spell. He throws a bunch of herbs together in a cast iron cauldron and sets them on fire while chanting some nonsense. It smokes like mad and Yoongi is shocked when the smoke detector doesn't go off.</p>\n<p>  Jimin takes a picture of his professor, (“I printed it off the school website,” he tells Yoongi) and sets that on fire as well. He waves one of the crystal pendants over the flames and mutters some more gibberish, and Yoongi wonders where he's getting this “spell” from.</p>\n<p>  The fire dies down, and both Jimin and Yoongi peer into the ashes with bated breath.</p>\n<p>  For long moments, nothing happens. Then Jimin looks down and yelps loudly when he sees that his hand is starting to turn bright purple.</p>\n<p>  Within minutes, Jimin's entire body is the color of watered down grape juice. He looks like Barney the Dinosaur, and Yoongi can't stop laughing. It sounds like he's choking on a furball, but Jimin seems to understand that he’s being laughed at. He glares at Yoongi and moans loudly, burying his purple face in his purple hands.</p>\n<p>  “Why does shit like this always happen when I try to do magic?”</p>\n<p>  Yoongi rubs along Jimin’s side, still chuckling to himself. <em>“My pretty little grape,”</em> he chirps, purring loudly to try to soothe a rapidly panicking Jimin.</p>\n<p>  Jimin takes three showers and the color staining his skin only lightens by one shade. Yoongi pointedly stares at the carpet when Jimin comes out of the bathroom naked and dripping water. He never looks when Jimin changes or undressed, which Jimin gets a kick out of.</p>\n<p>  “Always such a little gentlemen,” he cooed at Yoongi one time.</p>\n<p>  Jimin pulls on a pair of boxers and collapses onto his bed. “I have school on Monday,” he whines petulantly. “What am I gonna do?”</p>\n<p>  Yoongi hops up next to him and begins licking at the strands of his damp blonde hair. It tastes faintly of strawberries. He flicks Jimin's turnip-colored face with his tail, who huffs and bats it away.</p>\n<p>  “<em>You're still perfect to me, Jiminie,”</em> Yoongi meows, touching his little wet nose against Jimin’s, earning a soft giggle.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>  The next morning, Yoongi wakes up to an only lightly lilac-colored Jimin asleep next to him. It makes his blonde locks stands out even more in the sunlight spilling in, and Yoongi stares at him in awe. He's surrounded by the familiar scent of vanilla and toffee, which Yoongi now associates with safety and home and love and <em>Jimin.</em></p>\n<p> Yoongi would give anything to hold Jimin in his arms as a human, to hug him and kiss him and be able to tell him out much he loves him. That's not something that's ever likely to happen though, so Yoongi will take what he can get.</p>\n<p>  Yoongi raises a paw and presses it into Jimin’s cheek, marveling at the way Jimin’s eyebrows furrow in his sleep. He pushes a little more insistently, because as much as he loves watching Jimin while he slumbers, Yoongi is hungry. When Jimin still doesn't wake, Yoongi starts licking the tip of his nose, enjoying the sweetness of Jimin’s skin, like sleep and cream and sunlight.</p>\n<p>  The scratchiness of Yoongi's tongue on his nose finally wakes Jimin up. “Ugh,” he groans, cracking an eye to look at Yoongi. “Stop that.”</p>\n<p> Yoongi stops licking and rubs his head against Jimin’s chin, purring when Jimin wraps his arms around him in a hug. His heart is so heavy and full of love for this boy that it almost aches. He could stay like this forever, wrapped up in Jimin's presence, his warmth and light and wonderful, familiar scent.</p>\n<p>  Jimin releases him and sits up in bed with a yawn, eyes widening when he catches sight of his hands. “It's faded a lot!” He exclaims, jumping out of bed and running to the bathroom. “Oh, thank god!” Yoongi hears him gasp, and he smiles to himself.</p>\n<p>  Obviously Jimin can't leave the house to run groceries, and Yoongi is ecstatic. He gets to have Jimin all to himself for the second day in a row!</p>\n<p>  They spend all day lounging on the couch watching movies and eating snacks. Yoongi keeps snatching Jimin’s pretzels out of his hands with his teeth until the blonde gives up and pours Yoongi his own bowl.</p>\n<p>  They cuddle for hours and Yoongi doesn't remember ever being more content. Jimin is the absolute fucking best at giving scratches, and Yoongi lays limp while Jimin pampers him, eyes dropping and purr rumbling like a motor. At one point while they're laying on the couch, Yoongi gets bored and starts nibbling Jimin’s earlobe. Jimin squeals and tries to move away, but Yoongi drapes himself across his neck and continues gently nibbling at the soft purple flesh.</p>\n<p>  Oh, how he wishes he could do this as a human.</p>\n<p>  They go to bed that night curled up together under the warm covers while another snow storm whirls around outside.</p>\n<p>  The next morning, Jimin’s color has returned to normal. Yoongi lies on his chest and listens to the steady thumping of his heart, thinking there's nowhere he'd rather be.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>  It's starting to become a little painful, how much Yoongi loves Jimin and how he'll never be able to have him. Not in the way he really wants. As more than just a cat.</p>\n<p>  Yoongi is lying on his back on the kitchen tile, bemoaning his situation and waiting for Jimin to get home, when the doorknob rattles but doesn't open.</p>\n<p>  “Shit!” Comes Jimin’s voice from outside. Yoongi hops up and stares curiously at the door. What is Jimin doing? There's some more rattling and some more cursing until the door finally swings open. Yoongi trots over to Jimin and rubs against his ankles, purring madly. Jimin almost trips over him as he takes off his shoes.</p>\n<p>  “I lost my fucking keys and had to use the spare,” Jimin tells him when he notices Yoongi's questioning gaze. “It sticks in the lock and is a huge pain in the ass.”</p>\n<p>  After giving Yoongi a greeting scratch behind his ears, Jimin dumps the entire contents of his school bag on the living room floor in search of his keys. He then calls Jungkook to see if he left them at the dance studio.</p>\n<p>  “Damn it,” Jimin groans when he hangs up.</p>\n<p>  Yoongi stops batting around one of Jimin’s pencil erasers and crawls into his lap. <em>“Please don't do magic,”</em> Yoongi pleads in a series of chirps, already knowing where this is going.</p>\n<p>  Jimin snaps his fingers and grins down at Yoongi. “I'm gonna do magic to find them!”</p>\n<p>  Yoongi let's out a long-suffering sigh and wonders why he's in love with such an idiot.</p>\n<p>  “Don't give me that look,” Jimin glares at him. “You're my familiar, you're supposed to help me in my magical endeavors.” </p>\n<p>  Yoongi rolls his eyes and hops off Jimin's lap when he stands up. He watches in exasperation as Jimin pulls out all his spellbooks and flips through them. He pauses on one page of an old leather bound book. “This might work; ‘<em>to reveal that which is hidden’</em>. It says all I have to do is recite the words and focus on what I'm trying to find,” Jimin shrugs and smiles at Yoongi. “Seems easy enough.”</p>\n<p>  When Jimin thinks magic is easy, that's always a bad sign.</p>\n<p>  Jimin pushes back the coffee table to give himself room and faces the couch, while Yoongi sits behind him, next to the TV, to watch. Jimin holds the book in his hands and begins reciting the words written there.</p>\n<p>  <em>“Allerio ma shaek ackni anni.”</em></p>\n<p>  Yoongi barely time to think that those words sounds strangely familiar when there's a loud crack and a puff of pink smoke.</p>\n<p>  Next thing he knows, a very human Yoongi is standing in Jimin’s living room, staring at the witch’s back.</p>\n<p>  Holy shit. Yoongi is back!</p>\n<p>  “What was <em>that?”</em> Jimin cries, whirls around, sees Yoongi, and <em>screams.</em> “Who are you?!” Jimin shrieks, the book dropping with a thud to the carpet. “How'd you get in here?!”</p>\n<p>  Yoongi raises his hands up in a calming gesture, seeing he's wearing the clothes he'd had on when the sorceress had turned him. Thank god. If he'd appeared in front of Jimin naked, he doesn't know how he'd ever live that down. “J-Jimin,” Yoongi tries, his voice scratchy with disuse.</p>\n<p>  Jimin's face goes pale and his eyes go wide. “How do you know my name?!”</p>\n<p>  Yoongi clears his throat and tries again. “It's--” a cough interrupts him. “It's me. I'm the cat.”</p>\n<p>  At the word ‘cat’, Jimin gasps and whips his head around, frantically looking for the feline. “W-what have you done to my cat?” Jimin chokes out, turning watery eyes to Yoongi. It makes his heart ache and all Yoongi wants to do is cross the distance and pull him into his arms, but he restrains himself.</p>\n<p>  “Jimin, it's me,” Yoongi tries again. “I’m the cat.”</p>\n<p>  Slowly the words seem to register and Jimin pauses in his panic. His gaze rakes over Yoongi and his eyes stops at his head of royal blue hair, and that's when Jimin seems to start working it out, his eyes widening.</p>\n<p>  “S-Señor…Cutiebutt? Jimin whispers, staring horrified at Yoongi.</p>\n<p>  “It's Yoongi, actually,” Yoongi says gently.</p>\n<p>  Jimin sucks in a shaky inhale and swallows heavily. “Y-you're...human?”</p>\n<p>  Yoongi nods and opens his mouth to explain, but Jimin lets out a strangled little sound and drops limply onto the couch.</p>\n<p>  “Oh my <em>god</em>,” Jimin breathes, looking as if he's on the verge of passing out. “Oh my god. You-I-we s-slept together. You--” Jimin squeaks and turns flaming red. “You've seen me <em>naked.”</em></p>\n<p>  “No!” Yoongi exclaims quickly. “I never looked. Not once. Cutiebutt would always looked away, remember?”</p>\n<p>  Jimin stares at him with watery, confused eyes. Yoongi sighs and runs a hand through his hair. It feels so weird to have all his limbs back, to be able to feel everything as a human again.</p>\n<p>  “Can I sit? I'll explain everything,” Yoongi asks gently. Jimin bites his lip and looks uncertain for a moment, but he finally nods and scoots to the very edge of the couch while Yoongi takes the other end.</p>\n<p>  Yoongi takes a deep breath. <em>You can do this</em>, he thinks to himself.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>  Forty five minutes later, Yoongi finally falls silent after telling Jimin everything. His throat hurts from talking so much after so long of not being used.  On his side of the couch, Jimin is rubbing idly at his temples, looking incredibly overwhelmed.</p>\n<p>  “So,” Jimin begins tentatively. “This sorceress cursed you because she flirted with you and you turned her down?”</p>\n<p>  Yoongi nods and watches Jimin’s face closely. “You know how sorceresses are. Always over-dramatic and easily offended.”</p>\n<p>  Jimin hums in absentminded agreement before fixing Yoongi with a wide eyed stare. “So, this whole time it was you? And you could understand everything I was saying?” Yoongi nods again and Jimin groans loudly, his cheeks turning pink. “I gave you a <em>bath.”</em></p>\n<p>  Yoongi feels his own cheeks heating up. “Yeah, it was weird for me too at first.”</p>\n<p>  Jimin's face keeps darkening. “I cuddled with you and gave you belly rubs.”</p>\n<p>  Yoongi coughs a little awkwardly but doesn't answer.</p>\n<p>  Jimin claps a hand over his mouth, eyes twinkling a little mischievously. “I cleaned your litter b--”</p>\n<p>  “Okay!” Yoongi interrupts loudly, face on fire. “What matters is that I'm back to normal now.”</p>\n<p>  Jimin bites his lip and nods. Then his brows furrow and he stares hard at Yoongi. “Why did you never try to tell me what was going on?”</p>\n<p>  “I <em>did</em>,” Yoongi says. “But up couldn't understand me and I had no idea how to get the message across.”</p>\n<p>  “You could've written a letter,” Jimin argues back.</p>\n<p>  Yoongi lifts his hands and wiggles his fingers. God it feels good. “No opposable thumbs, remember?”</p>\n<p>  Jimin crosses his arms and pouts, and all Yoongi wants to do is leap across the couch and kiss it away.</p>\n<p>  “You could've…” Jimin struggles to think of something else, face screwed up in concentration. Finally he sighs in defeat. “Oh, I don't know.”</p>\n<p>  Yoongi doesn't say anything, and they fall silent for a bit while Yoongi waits patiently for Jimin to process things.</p>\n<p>  “Is that why you would never eat regular cat food?” Jimin asks suddenly, looking up at him curiously.</p>\n<p>  Yoongi grins at him shrugs. “Would you want to eat that shit if you were a human?”</p>\n<p>  Jimin visibly shudders and shakes his head. “No way.”</p>\n<p>  Yoongi chuckles and Jimin seems to relax slightly at the sound.</p>\n<p> “So when it looked like you were looking at me all judgmentally, you actually were? I wasn't just imagining it?”</p>\n<p>  Yoongi dips his head and smiles apologetically. “No offense, Jiminie, but you kind of suck at magic.\"</p>\n<p>  “Hey!” Jimin protests hotly. Then he pauses and goes bright red. “J-Jiminie?”</p>\n<p>  Yoongi’s eyes widen and his face flushes with heat. “Ah,” he laughs awkwardly. “Yeah.”</p>\n<p>  They lapse into another uncomfortable silence before Jimin fidgets. “Uh, that one night where you started, you know...kneading my, um, butt…was that human you or cat you?”</p>\n<p>  Yoongi kind of wants to die. “Cat me, I think,” he says, blushing darkly. “It wasn't anything, like...<em>sexual</em> or anything. I wasn't groping you, I swear.”</p>\n<p>  Jimin nods meekly, his face rivaling Yoongi's in redness. “What about that time I came home crying and you...l-licked away my tears?”</p>\n<p>  God, could this get anymore uncomfortable? “That was the real me,” Yoongi decides to go with honesty, as painful as it is. “I didn't like seeing you sad.”</p>\n<p>  Jimin looks stunned. His eyes blink rapidly and his mouth opens and closes, but nothing comes out. He looks like a little blonde goldfish, and god, Yoongi is so in love.</p>\n<p>  “Oh,” Jimin finally breathes out.</p>\n<p>  Yoongi is about to say something when a harsh ringing from his jeans pocket interrupts him. They both jump about a foot in the air and Jimin let's out a little squeak of fright. Heart racing, Yoongi pulls out his phone and blanches when he sees the screen. 307 missed calls and 2,067 missed texts. Holy fucking shit. It's his mother calling, and Yoongi glances up at Jimin apologetically.</p>\n<p>  “Do you mind?” Jimin shakes his head and gestures for Yoongi to answer the phone.</p>\n<p>  Biting his lip in dread, Yoongi presses the answer button and utters out a meek, “Hello?”</p>\n<p>  “<em>OH MY GOD,”</em> his mother shrieks from the other end. <em>“YOONGI-YAH, IS THAT YOU?!”</em></p>\n<p>  “Hi, eomma,” Yoongi smiles weakly.</p>\n<p>\n<em>  \"WHERE THE HELL HAVE YOU BEEN?! DO YOU KNOW HOW WORRIED YOUR FATHER AND I HAVE BEEN?! WE THOUGHT YOU’D BEEN MURDERED! WE’VE BEEN CHECKING ALL THE HOSPITALS EVERY SINGLE DAY EXPECTING YOU TO TURN UP DEAD. HOW COULD YOU NOT CALL ME TO TELL ME YOU WERE OKAY?! WHAT THE HELL HAVE YOU BEEN DOING?!”</em>\n</p>\n<p>  Yoongi pinches the bridge of his nose and squeezes his eyes shut. “I'm sorry I worried you, eomma, but I'm okay, really.”</p>\n<p>  “You better have a damn good explanation about why you went missing for a month and a half,” his mother sounds <em>furious</em>.</p>\n<p>  So Yoongi decides to tell her the truth. It's easier than trying to come up with some cover story. Jimin sits on the couch and listens while Yoongi tells his story, blushing prettily when Yoongi starts explaining him to his mom how Jimin took him in and probably saved his life.</p>\n<p>  He talks so long that the phone pressed against his ear begins to ache painfully. Finally he falls silent and waits for his mother to process what he just said. “Well,” she finally says, sounding a little faint. “I'd like to invite this Jimin to dinner to say thank you.”</p>\n<p> Yoongi chuckles awkwardly and glances at Jimin. “I'll, uh, ask him.” Jimin perks up and eyes Yoongi curiously.</p>\n<p>  “Come see us soon, Yoongi-yah,” his mother says, sounding choked up. “We've missed you so much.”</p>\n<p>  “Yeah, okay. I have to go now, eomma,” Yoongi says, suddenly feeling tired to the bone out of nowhere.</p>\n<p>  “I love you, sweetie,” she replies. “Call soon.”</p>\n<p>  “Love you too,” Yoongi says back before hanging up. He leans back against the couch and lets out a weary sigh. He can feel Jimin’s gaze on his face but he can't bring himself to look at the witch.</p>\n<p>  “How did she take it?” Jimin asks quietly from across the couch.</p>\n<p>  Yoongi shrugs and rubs at his tired eyes. “Surprisingly well. She invited you to dinner to say thank you.”</p>\n<p>  Jimin's eyes widen and he goes pink. “Oh, I hardly did anything,” he waves his hand dismissively, but his words come out a bit shaky.</p>\n<p>  “I beg to differ,” Yoongi says. “Who knows what would've happened to me if you hadn't brought me home.”</p>\n<p>  Jimin can't even bring himself to meet Yoongi's eyes. His cheeks and even the tips of his ears are flaming red. Yoongi wants to touch, to feel the heat of his skin with him human fingers.</p>\n<p>  When Jimin shifts a little uncomfortably and glances at the clock above the TV, Yoongi feels like a bucket of ice cold water has been dumped on him.</p>\n<p>  Technically, he doesn't live here. This is Jimin’s apartment, not his. He's not a cat anymore and Jimin is probably trying to find a polite way to ask him to leave.</p>\n<p>  The thought of being away from Jimin, who he's been in the presence of every day for a month and a half, is physically, unbearably painful. Trying to imagine not waking up wrapped in Jimin's vanilla and toffee warmth, to not see him when he gets home from practice, to not watching TV together on the couch at night, pierces Yoongi right through the heart.</p>\n<p>  But he forces himself to think about this situation from Jimin’s perspective; one second he's with his beloved cat, and the next he's facing some stranger spouting a crazy story and invading his personal space.</p>\n<p>  As much as it hurts, Yoongi doesn't want Jimin to be uncomfortable. He clears his throats and stands up. “I should, uh, probably...go.”</p>\n<p>  Jimin jumps up as well and looks uncertain. “O-oh, okay. Are you sure?”</p>\n<p><em>  Fuck no I’m not sure</em>. “Yeah,” Yoongi tries to smile reassuringly, but it comes off more like a grimace. “I probably have piles of mail to sort through.”</p>\n<p>  Jimin nods, still a little uncertain, and walks him to the front door. They stand there awkwardly for a moment while Jimin rubs the back of his neck. “Well, um, good luck,” he finally says, and Yoongi absolutely<em> hates</em> how it sounds like a goodbye.</p>\n<p>  “Thanks,” he forces a smile back. “You too.”</p>\n<p>  Then he's stepping out into the cold hallway and leaving Jimin behind.</p>\n<p>  <strong><em>Eviction Notice.</em></strong></p>\n<p>  That's the sign that greets Yoongi when he trudged up three flights of stairs to his apartment door.</p>\n<p>  “Shit,” Yoongi hisses, feeling panic rise inside of him. With a sinking heart he realizes while he was stuck as a cat he hadn't been able to pay rent.</p>\n<p>  He makes his way down the to the front office and pleads with the landlord, but he's a big, brutish man who couldn't care less why Yoongi didn't pay his rent. In the end he allows Yoongi in the apartment to pack up his essentials, and then he gives Yoongi a number of a storage company that'll transfer his stuff to a unit there for an added fee.</p>\n<p>  Once he has most of his clothes, his laptop, some of his recording equipment, and a few other basic essentials, Yoongi slumps on a bench out by the street, homeless and freezing. It's looks like another snow storm tonight, and he doesn't know what he's going to do. It's getting progressively darker and the temperature keeps dropping by the minute.</p>\n<p>  Shivering and miserable, Yoongi thinks about calling Namjoon to ask if he can stay with him and Jin for a little, but then he remembers they're still on their honeymoon in Europe. His parents are back in Daegu, and anyone else Yoongi can think of, he's not good enough friends with.</p>\n<p>  Shit. That only leaves him one option.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>   When Jimin opens the door, it looks like the last thing he expects is his former cat to be standing on the other side, shivering, pink-cheeked, and carrying a large duffle bag. The burst of warm air from inside and the smell of vanilla and toffee washes over him, and Yoongi immediately finds himself relaxing. Jimin looks beautiful as usual, in a big beige sweater with messy blonde hair, and Yoongi wants to hug him so bad.</p>\n<p>  Jimin blinks at him in surprise, mouth popping open. “Yoongi-ssi? What are you doing here?”</p>\n<p>  Flushing in embarrassment, Yoongi tells Jimin about his situation, about the eviction and his landlord.</p>\n<p>  “So you need a place to stay?” Is the first thing Jimin says, and Yoongi wants to sink into the floor in embarrassment.</p>\n<p>  “Only until I can figure something out. It's totally fine if you don't want to, I know how weird this probably is for you--”</p>\n<p>  “It's fine, Yoongi-ssi,” Jimin interrupts him with a gentle smile. “I mean, we've sort of been living together this whole time, right?”</p>\n<p>  Yoongi stares at him, stunned. He hadn't  expected Jimin to agree so easily, or even at all. When Jimin steps aside and opens the door wider, it takes Yoongi a second to get his feet to move.</p>\n<p> “Are you sure about this?” He asks as Jimin closes the door behind him.</p>\n<p>  “Of course,” Jimin replies, gesturing for Yoongi to take off his shoes, which he does. Jimin's cheeks go a little pink and he looks at the carpet. “To be completely honest, it felt really weird after you left. I'm so used to having Cu--er, cat you around that suddenly being alone was strange.”</p>\n<p>  Yoongi stares at Jimin in awe, feelings of love and affection bubbling up in his chest. Yoongi smiles at Jimin and says a little teasingly, “You mean <em>Señor Cutiebutt?”</em></p>\n<p>  Jimin groans and hides his face in his hands. “I can't <em>believe</em> I named you that,” he whines while Yoongi sets his bag on the couch.</p>\n<p>  Yoongi chuckles and has to force himself from crossing the distance and taking Jimin into his arms. He looks around the familiar apartment and can't help but feel incredibly relieved that he's home.</p>\n<p>\n<em>  Home.</em>\n</p>\n<p>  When did Jimin's apartment become home? When did <em>Jimin</em> become home?</p>\n<p>  Something on his face must be off, because Jimin frowns and cocks his head at Yoongi. “Are you okay?”</p>\n<p>  Yoongi startles, his gaze flicking back to Jimin. “Yeah,” he says a little too quickly. “It's just...good to be back.”</p>\n<p>  For whatever reason, Jimin’s eyes widen and he blushes. Yoongi just wants to kiss across those plump pink cheeks, feel the heat of them beneath his lips. Feel how they go even hotter at his touch.</p>\n<p>Jimin coughs awkwardly and rubs his cute nose. “Um, I was gonna order some food. Do want to like, take a shower of anything while we’re waiting?”</p>\n<p>  Yoongi narrows his eyes, wondering if Jimin is trying to hint at something. But it looks like Jimin is just being nice, seeing as Yoongi is still frozen with cold and shivering slightly. “That sounds great,” he says, running a tired hand through his blue hair. “It's been forever since I've taken a shower as a human.”</p>\n<p>  And holy shit, did he forget how incredible a scalding hot shower could be. Yoongi stands under the hot spray, head bowed and limbs loose and relaxed, feeling more like himself by the moment.</p>\n<p>  Once his body is raw and pink, Yoongi washes up with Jimin’s strawberry shampoo and his vanilla bar soap. It smells so much like Jimin that Yoongi has to pause for a moment, suddenly dizzy with it. His heart pounds painfully in his chest as the scent washes over him, and makes him a little weak in the knees. He allows himself to simply stand there for a moment, absorbing the scent that is so wonderful to him.</p>\n<p>  Finally, when his entire body starts looking like a prune, Yoongi turns the shower off and dries off with one of Jimin's soft, fluffy towels hanging on the rack. It feels incredible against his bare human skin, and Yoongi savors it for a bit.</p>\n<p>  When he comes out of the bathroom dressed in a loose black t shirt and some old pajama pants, Jimin is setting the table. He looks up at Yoongi's arrival and smiles, and Yoongi feels his heart stop.</p>\n<p>  “Hey,” Jimin greets him. “The food just got here, go ahead and sit down.”</p>\n<p>  Yoongi and Jimin eat the chinese takeout, and Yoongi answers Jimin's tentative questions.</p>\n<p>  “Was it weird not having thumbs?”</p>\n<p>  “Did you ever get hair balls?”</p>\n<p>  “What was it like having a tail?”</p>\n<p>  “What was it like being on catnip?”</p>\n<p>  Yoongi answers his questions patiently, and though it's a little awkward at times, he can sense Jimin starting to become a little more comfortable with him.</p>\n<p>  When it's time for bed, Jimin brings out piles of blankets and waves away Yoongi's protests when he starts making up the couch for him instead of Yoongi. Neither of them mention that it'll be the first time they’re sleeping apart in what feels like ages.</p>\n<p>  The first night sleeping without Jimin is difficult, to say the least. Yoongi tosses and turns and can't seem to get comfortable on the couch he'd loved so much as a cat. He feels hollow and lonely and cold without Jimin, and even though he's just down the hall, it feels like he's miles away. Yoongi didn't realizes how accustomed to Jimin's warm, comforting presence he'd become to as a cat.</p>\n<p>  Yoongi doesn't fall into a fitful sleep until the early hours of dawn.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>  Over the next few weeks, it's Jimin's turn to get to know Yoongi.</p>\n<p>  He learns that Yoongi is from Daegu and that his family still lives there. That Yoongi left home because his parents originally didn't approve of his choice of career, but they've since accepted it. He discovers Yoongi hates cilantro and loves lamb skewers and banana milk. He is incredibly organized and doesn't mind clutter in Jimin's apartment but hates it in his workspace, A.K.A, the coffee table. He doesn't fold his underwear and waits as long as possible to do his laundry. He secretly loves Studio Ghibli movies and not so secretly loves Kumamon.</p>\n<p>  He learns that Yoongi is a music producer who's going through a bit of a dry spell at the moment. Despite that, he still spends hours every day diligently trying to come up with new material. Sometimes he'll let Jimin listen to what he's been working on, and Yoongi can't help his smile at the way Jimin always gets so excited on those occasions.</p>\n<p>  The more Jimin gets to know him, the more he opens up and reverts back to the Jimin that Yoongi knew as a cat. The one he fell in love with. No longer shy and awkward but loud and giggly and a little bit bratty at times. He calls Yoongi ‘hyung’ now, and every time Yoongi hears the honorific, it makes his heart beat a little faster and his insides all gooey.</p>\n<p>  When Jimin gets home that evening, Yoongi is on the couch with his heavy headphones on while he works on his laptop. He slides them off immediately when Jimin pushes through the door, damp with sweat in his dance clothes.</p>\n<p>  “Hi, hyung,” Jimin grins at him while he kicks off his shoes.</p>\n<p>  Yoongi feels himself melting at the breathtaking sight of his smile. “Hi, Jiminie,” he smiles back, closing his laptop and setting it on the coffee table. “How was practice?”</p>\n<p>  Jimin collapses onto the couch next to Yoongi and sighs dramatically. “Hoseok hyung is driving us into the ground with this new choreography,” he pulls his legs onto the couch and rubs at his small, cute foot. “I can't even feel my feet right now.”</p>\n<p>  Yoongi forces himself to wipe the dopey, adoring look off his face before Jimin catches the expression. “Poor baby,” Yoongi murmurs, enjoying Jimin's scowl. “Do you want me to make you some hot chocolate?”</p>\n<p>  Jimin's eyes light up and he nods happily. “With--”</p>\n<p>  “Extra marshmallows, I know,” Yoongi interrupts as he stands up. Jimin looks a little surprised before he starts grinning.</p>\n<p>  “I keep forgetting that you already know lots of stuff about me,” he says as Yoongi enters the kitchen.</p>\n<p><em>  Know you and love you</em>, Yoongi thinks to himself as he grabs two mugs out of the cupboard.</p>\n<p>  They drink their hot chocolate while watching crappy dubbed movies, sitting close but not close enough for Yoongi's liking.</p>\n<p>  That night he goes to bed on the couch and once again has trouble sleeping without Jimin.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>  Yoongi gets home one Sunday afternoon, arms laden with grocery bags, to find Jimin sprawled on his stomach across the couch, his nose buried in a textbook and endless pieces of homework strewn around him. He looks up when Yoongi comes in and beams at him.</p>\n<p>  “Hey, hyung!” He chirps in greeting, setting the book down and sitting up. “How was grocery shopping?”</p>\n<p>  It had been Yoongi's turn to shop, part of the agreement he'd practically forced on Jimin; “I'm not gonna live here rent-free and and do nothing else to contribute,” he'd said firmly, ignoring Jimin's protests.</p>\n<p>  “Busy,” Yoongi replies tiredly, dropping the bags on the kitchen table. He fishes around inside them until he finds what he's looking for. He pulls out the packet of black licorice vines, wrinkling his nose in distaste.</p>\n<p>  “Hey,” Yoongi says, and Jimin looks up. “Catch.”</p>\n<p>  He tosses the packet through the air and Jimin catches it gracefully. He looks down at the candy and his eyes widen in surprise. “Black licorice!” He exclaims, staring up at Yoongi with starry eyes. “How'd you know I love them?”</p>\n<p> Yoongi smiles at him softly and rubs his neck, feeling suddenly shy. “I know <em>you,</em> Jiminie,” he shrugs, cheeks going pink.</p>\n<p>  An expression of pure <em>wonder</em> seems to cross Jimin's face as he stares at Yoongi, his own cheeks darkening as well. The look he gives Yoongi is so full of awe and amazement that Yoongi is forced to look away from the intensity of it, instead busying himself with unloading the groceries.</p>\n<p>  Yoongi doesn't notice the way Jimin keeps sneaking looks at him in between his studying.<br>\n <br>\n </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>  Yoongi can't tell if he's imagining it or not when Jimin starts glancing at him a little more. When he starts giggling more often and blushing easier and more frequently around Yoongi. He can't tell whether the casual, fleeting touches mean something more or if it's just Jimin's natural personality shining through. Yoongi doesn't want to misread the situation, get his hopes up for nothing, or, god forbid, misinterpret and make an unwanted move on Jimin. He doesn't even want to think how that would end.</p>\n<p>  One morning, Yoongi awakes from a fitful sleep earlier than usual. Jimin is still asleep in his room and won't be up for a bit, so Yoongi rolls over and tries to fall back asleep.</p>\n<p>  After about ten minutes Yoongi gives up and decides to get up. He rubs a hand over his face and through his fluffy blue hair, deciding he'll go down to the nearby coffee shop and surprise Jimin with breakfast. He dresses quickly in a hoodie and rumpled jeans and quietly leaves the apartment. He realizes halfway down the street that he forgot his phone, but decides he'll be fine without it for a little bit and doesn't go back for it.</p>\n<p>  Coincidentally, the nearest coffee shop happens to be the exact same one Yoongi first met the sorceress in. Immediately weary, he sidles inside and looks around, prepared to make a break for it at a second’s notice.</p>\n<p>  The cafe is fairly empty so he deems it safe to step in. Yoongi orders himself a black coffee and Jimin an iced chai, heavy on the sweetener, and two breakfast sandwiches.</p>\n<p>  It's as he's waiting for his order to be prepared that Yoongi feels an odd tingling run through him.</p>\n<p>  “Well, well. Look who we have here,” comes a horribly familiar female voice from behind him.</p>\n<p>  Yoongi spins around and freezes. The sorceress who turned him into a cat is standing there in a yellow sundress and high beige wedges. Her long hair is braided down her back and her smile is dangerous as her gaze sweeps over him. “Y-you,” Yoongi breathes shakily, his flight-or-fight kicking in. He backs up a step and hits the counter, gulping when her predatory eyes follow his movements. “Stay away from me.”</p>\n<p>  She cocks her head and smirks. “Oh, relax. I'm in a good mood today.”</p>\n<p>  Yoongi knows better than to trust her word. He eyes her suspiciously, ready to run if needed. Her eyes narrow at him and she looks intrigued. <em>“How</em> did you turn back, though? Spells like that don't just wear off.”</p>\n<p>  “Like I’d tell you,” he snaps, instantly regretting it when her mouth tightens.</p>\n<p>  “Still as rude as ever, I see,” she says casually, lifting a hand and examining her manicured nails.</p>\n<p>  Heart racing in his chest, Yoongi edges along the counter towards the door. “W-what are you gonna do to me?”</p>\n<p>  Her eyes flicker in amusement. “Nothing, silly. Like I said, I'm in a good mood,” then she cocks her head and her eyes zero in on Yoongi with an intensity that makes him burn. He's not expecting what she says next;</p>\n<p>  “Omo...you're in <em>love</em>.”</p>\n<p>  Yoongi chokes on his own tongue, the gears in his head grinding to a halt. <em>“What?\"</em></p>\n<p>  She chuckles as her gaze sweeps over him again. “Its radiating off you like sunlight. Anyone with magic could see it a mile away.”</p>\n<p>  Yoongi's heart stutters to a halt, a horrible thought hitting him. Does that mean that Jimin....</p>\n<p>  <em>“...anyone?”</em> Yoongi croaks, throat dry.</p>\n<p>  She shrugs her small shoulders. “Anyone worth their salt, at least.”</p>\n<p>  Oh, thank god. So not Jimin then.</p>\n<p>  “How you managed to fall in love while you were stuck as a cat is beyond me,” she says, looking at Yoongi curiously.</p>\n<p>  He's saved from having to answer by the barista calling his name. Yoongi turns, snatches up the paper bag and drink carrier, and hightails it out of there.</p>\n<p>  “Good luck with everything!” The sorceress laughs behind him as he goes.</p>\n<p>  The entire way home, Yoongi keeps looking manically over his shoulder, terrified she'd changed her mind and decided to finish him off.</p>\n<p>  When Yoongi gets back to the apartment, he has to juggle the food in order to get the key in the lock. Jimin had given him a copy a while ago, making Yoongi glow with warmth. Jimin had found the keys he lost in his jeans pocket the day after Yoongi turned back into a human. He had been very embarrassed.</p>\n<p>  Yoongi had just shut the door behind him and put the food and drinks on the table when rapid footsteps pound down the hall. Jimin careens into the kitchen, wild-eyed and frantic, panting as if he'd just run a mile.</p>\n<p>  “Jiminie?” Yoongi asks, concern flooding him at the sight of the witch.</p>\n<p>  Jimin skids across the tile and throws his arms around Yoongi with a gasp. “I thought you'd left,” he cries, sounding on the verge of tears.</p>\n<p>  Yoongi's mind goes completely blank with shock. On instinct, his arms circle around Jimin's waist and he holds him close. Yoongi hasn't been this close to Jimin's vanilla and toffee scent in forever, and he has to stop himself from burying his nose in Jimin's blonde hair, messy and soft from sleep, and inhaling deeply.</p>\n<p>  “Jiminie? What are you talking about?” Yoongi finally asks, his voice a little hoarse.</p>\n<p>  “I...I woke up and you weren't here, and I thought that you'd left,” Jimin whispers into his shoulder, and Yoongi realizes with horror that he's shaking slightly. “I tried to call you but you left your phone on the couch, and I thought…”</p>\n<p>  “Hey, hey,” Yoongi says softly, rubbing a hand in soothing circles across Jimin's back. “It's okay. I'm here, I didn't leave.”</p>\n<p>  Jimin pulls back just enough to be able to look at Yoongi's face, and his heart shatters when he sees his eyes are watery and filled with tears. Jimin's bottom lip is quivering slightly, and Yoongi just wants to kiss the pout away.</p>\n<p>  “I just went to get us breakfast,” Yoongi says, nodding his head at the table. Jimin follows his gaze and promptly turns pink.</p>\n<p>  “Oh,” he blinks, then lets out a watery, breathless laugh. “I guess I overreacted a little.”</p>\n<p>   Yoongi just smiles fondly at him and tries not to let his disappointment show when Jimin finally loosens his arms and steps out of Yoongi's embrace a long moment later. Unless he's imagining it, Jimin seems a little reluctant as well, his movements slow and unsure as he detaches from Yoongi.</p>\n<p>  “It's okay,” Yoongi assures him gently, watching Jimin's flush spread to the tips of his ears. “You hungry?”</p>\n<p>  Seeming to recover a little, Jimin smiles tentatively and nods, plopping down at the table. “Is this a chai?” Jimin asks, picking up his iced drink.</p>\n<p>  Yoongi nods and pulls out the sandwiches. “With extra sweetener.” Jimin giggles and slurps happily at his drink. </p>\n<p>  They eat their breakfast and Yoongi doesn't bring up the delicate matter of Jimin's freak out, since he's obviously still embarrassed about it.</p>\n<p>  Halfway through, Yoongi decides to tell Jimin about the sorceress.</p>\n<p><em>  \"What!”</em> Jimin yelps loudly, a bit of egg from his sandwich going flying. “She was there?! You talked to her?!”</p>\n<p>  Trying to keep a straight face over Jimin's adorable reaction, Yoongi nods. \"I was scared she was going to do something else to me, but she said she was in a good mood and just talked.”</p>\n<p>  Jimin's eyes go wide as the moon and he leans over the table. “What did she talk about?”</p>\n<p>  Memories of his conversation with the sorceress flash through his mind, and Yoongi dips his head over his sandwich to hide his blush. “Just, you know...how I changed back and stuff,” Yoongi mumbles vaguely. When Jimin starts to look a little alarmed, Yoongi quickly adds, “I didn't say anything about you, obviously.”</p>\n<p>  Jimin scowls to himself and wrings his hands, as if imagining a neck between them. “If I ever come across her, I'll…I'll…” he casts about for something to say. “Vaporize her!”</p>\n<p>  Yoongi can't keep a straight face this time. Jimin glowers angrily at him when he starts laughing. “What's so funny?” Jimin demands hotly.</p>\n<p>  “Jiminie, you can't even cast a simple spell without turning the wallpaper different colors,” Yoongi chuckles, finding Jimin's annoyed expression incredibly cute.</p>\n<p>  “I just need more practice, is all!” Jimin says heatedly.</p>\n<p>  Yoongi just reached across the table and ruffles Jimin's wheat-colored hair fondly. “Whatever you say, Minnie.”</p>\n<p>  Jimin glares at him. “It's true!”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>  That night, Yoongi lies, once again, awake upon his made up bed on the couch. For the countless night in a row, sleep eludes him. Even after all this time of not being with Jimin while he's sleeping, he just can't seem to get used to it. He glances at the clock above the TV, illuminated by a streetlight outside, and sighs wearily when he sees it's a quarter past three in the morning.</p>\n<p>  He's debating on whether or not to pull out his headphones and laptop and try to get some work done, when the floor squeaks behind him.</p>\n<p>  “Hyung?” A quiet, almost whispered voice speaks behind him.</p>\n<p>  Yoongi sits up quickly to see Jimin standing in the entrance to the hall, clad in pajama pants and a sweater that's too big for him. His sweater paws dangle by his side and his honey hair is a tousled mess.</p>\n<p>  “Minnie?” Yoongi says, concern washing over him. “Is everything okay?”</p>\n<p>  Jimin nods quickly and he swings his sweater paws a little aimlessly. “I just, um...I was wondering...well, I haven't been sleeping very well since Cutiebutt...er, cat you, has been gone, and I was wondering if maybe...I mean you don't have to, of course, but um…”</p>\n<p>  Yoongi sighs in fond exasperation. “Spit it out, Jiminie.”</p>\n<p>  There's a moment of hesitation before Jimin blurts out. “Could you come and sleep in my bed with me?”</p>\n<p>  Yoongi doesn't need to be able to see in the dark to know that Jimin is turning red. Before the witch has a chance to start apologizing and run away in embarrassment, Yoongi rises from the couch and crosses over to him. He takes Jimin's small, warm hand and holds it tight. “Of course I will,” he says softly. Before Jimin can even reply, Yoongi is tugging him down the hall and into the bedroom.</p>\n<p>  They climb under the covers together, and god, has Yoongi missed this bed. They lay down with a little bit of space between them, facing each other, and simply stare. It's quiet in the room aside from their breathing, and Jimin's gaze seems to burn into Yoongi's soul.</p>\n<p>  A long moment of silence falls as they settle in. A few beats later though, Jimin starts edging closer and closer across the bed towards Yoongi, hesitant, as if he expects Yoongi to recoil away from him. Once his aborted little movements become too annoying, Yoongi sighs and hooks an arm around Jimin, pulling him flush against his body.</p>\n<p>  Jimin let's out a surprised little gasp and freezes for moment. Then he melts into Yoongi and burrows his face in his neck, arm wrapping loosely around Yoongi's waist, and a small, content sigh leaving him.</p>\n<p>  It's as if the entire world is falling back into place. Jimin is a warm, familiar weight in his arms, his body soft and so delicate, curved against Yoongi as if they were made for each other.</p>\n<p>  And the smell of him, <em>oh.</em> Yoongi's senses are dulled now that he's not a cat, but he can still pick up traces of Jimin's vanilla and toffee scent, and god, Yoongi thinks he could get drunk off that smell alone.</p>\n<p>  He nuzzles his nose into Jimin's hair and inhales deeply, savoring this moment. His arm drapes across Jimin's shoulders and his hand twist gently into the hairs at the back of his head, anchoring him in place.</p>\n<p>  “Goodnight, Minnie,” Yoongi murmurs into the dark, quiet room.</p>\n<p>  He gets no response, because Jimin has already fallen asleep. Smiling to himself, Yoongi follows him into the best slumber he's had in weeks.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>  Yoongi no longer sleeps on the couch. Every night, he and Jimin climb into the bed and curl up together under the warm blankets and quickly drift off to sleep, bathed in the other’s presence.</p>\n<p>  Not much has changed between them except that Jimin is even more clingy than ever. He hangs off of Yoongi every chance he gets, crowds against his side when they're watching movies, and throws all his weight on Yoongi when they're sleeping.</p>\n<p>  When they go out in public together, Jimin has taken to holding Yoongi’s pinky with his entire hand, sticking close and grasping the finger tightly. The first time it happened Yoongi almost fainted with the swell of emotions that hit him at the innocence of it.</p>\n<p>  Things are more comfortable than ever and Yoongi couldn’t be happier.</p>\n<p>  It's Jimin who kisses him first.</p>\n<p>  It's late at night when they're both zoning out in front of some weird French movie, the lights in the living room dimmed. They're slumped together on the couch with Jimin's head resting on Yoongi's shoulder.</p>\n<p>  Yoongi is almost dozing off when Jimin sits up suddenly and turns to him. He doesn't have a chance to ask what's wrong before Jimin is cupping Yoongi's face between his hands and pulling him gently into a kiss. He just barely has time to register the look of determination on Jimin's face before their lips seal together.</p>\n<p>  His whole brain shuts down for a moment and he goes still. Before he knows it, Jimin is pulling away, starting to look mortified, but Yoongi stops him saying anything by surging forward and hungrily capturing Jimin's lips again.</p>\n<p>  Jimin gasps into his mouth and melts into him. His lips are warm and so sinfully soft that Yoongi feels like he's drowning in them, in <em>Jimin</em>. Yoongi grasps Jimin's face in his hands and tilts his head back, allowing him an even better angle. Jimin shivers against him and goes all pliant and responsive. Yoongi rises up and pushes Jimin back on the couch, never separating their lips as he presses down on him.</p>\n<p>  He licks across Jimin's bottom lip and he eagerly opens his mouth to grant Yoongi access. Jimin's mouth is hot and intense and tastes faintly of black licorice, which Yoongi finds he doesn't mind for the first time in his life. Jimin's hands come up to twist in Yoongi's hair, a little whimper escaping him when Yoongi licks hard into his mouth.</p>\n<p>  God, Yoongi has wanted this for so long, and now that it's happening, he can't believe it. It's better than he ever imagined.</p>\n<p>  Unfortunately though, they finally have to separate once Yoongi's head starts swimming from lack of oxygen. They both gasp loudly into the dim room, breath ragged as if they'd just run a marathon. In the background, the end credits of the movie are playing.</p>\n<p>  “Hyung,” Jimin says breathlessly, tugging at Yoongi's hair until their eyes meet. His lips are red and swollen and wet. “Hyung...I think I'm falling in love with you.”</p>\n<p>  Nothing can quite describe what Yoongi feels when he hears those words. Liquid sunlight erupts throughout his entire body, and he lets out a sort of sob, dropping to bury his face in Jimin's hot neck. Concerned, Jimin pats at his back uncertainly. “Hyung?”</p>\n<p>  Yoongi hides in Jimin's neck for a second before rising back up to very seriously meet Jimin's eyes. He brushes his thumb over Jimin's swollen bottom lip gently. “Park Jimin, I've been in love with you from the first moment I met you,” he says quietly.</p>\n<p>  Jimin looks shell-shocked. His eyes turn wide and his mouth drops open, giving Yoongi the perfect opportunity to sneak a quick kiss. “You have?” He whispers, as if it's too good to be true.</p>\n<p>  Yoongi drops another kiss on his lips. “Always,” another kiss. “And forever.”</p>\n<p>  Jimin closes his eyes to absorb this information, a small, serene smile gracing his face. Yoongi feathers light kisses onto his delicate eyelids, making Jimin hum happily. They wrap their arms tightly around each other, and Yoongi rests his face in the crook of Jimin's neck. He almost purrs like Cutiebutt when Jimin starts carding his hand through Yoongi's blue locks.</p>\n<p>  They stay like this for what feels like forever, and Yoongi is on the verge of falling asleep, when Jimin speaks. “Hyung, you said you've loved me this whole time?”</p>\n<p>  Yoongi shifts so he's looking blearily at Jimin's face. “Yeah.”</p>\n<p>  “So you loved me when you were a cat?”</p>\n<p>  Yoongi narrows his eyes. “...yeah.”</p>\n<p>  A mischievous glint enters Jimin's eyes. “Isn't that sort of like bestiality?”</p>\n<p>  Yoongi groans and pushes Jimin's face away with his hand. “Park Jimin, don't ruin the moment, you little shit.”</p>\n<p>  Jimin giggles and wraps both legs around Yoongi to hold him hostage, just in case he were thinking of leaving. He's not.</p>\n<p>  “I'm tired,” Yoongi yawns after a while of them cuddling. “Let's go to bed.”</p>\n<p>  Jimin waggles his eyebrows suggestively, allowing himself to be pulled up off the couch by Yoongi. “You gonna take me to <em>bed,</em> hyung?”</p>\n<p>  A flush rushing to his cheeks, Yoongi ducks his head to hide it while he pulls Jimin down the hall. “Shut up,” he mutters, making Jimin laugh gleefully.</p>\n<p>  Like always, they fall asleep wrapped around each other, except now there’s an unspoken promise of <em>more.</em></p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>  They don’t have sex for the first time until almost a month later. When they do, it’s slow and sweet with Yoongi pounding a whimpering Jimin into the mattress with deep, mind numbing thrusts. He murmurs praises into Jimin’s skin that make him whine and squirm desperately. Jimin cums with tears rolling down his face and Yoongi’s name on his tongue, and Yoongi tumbles over soon after, burying his moans in Jimin’s neck.</p>\n<p>  Afterwards, Jimin lies, spent, on his stomach while Yoongi plays with his naked butt. Finally, he can touch it and appreciate it as a human. Jimin giggles when Yoongi starts kneading across the firm muscles his with palms, reminiscent of his time as a cat. Then Yoongi can’t stop himself from slapping one of his plush cheeks. Jimin jerks and gasps and pushes up into the touch.</p>\n<p>  That eventually leads to round two. Apparently Jimin isn’t as spent as Yoongi thought.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>  One day, Jimin comes home later than usual. Yoongi is starting to get worried, and he’s about to call him when the door unlocks and swings open. Jimin shuffles in, face guilty and arms hidden behind his back.</p>\n<p>  “Jiminie, where have you been?” Yoongi demands, rushing up to him, but stopping when he sees the expression on his face. “What is it?”</p>\n<p>  Jimin smiles sheepishly at him. “Now, don’t get mad,” is the first thing he says, and Yoongi is immediately on edge.</p>\n<p>  “Jimin, what’s going on?”</p>\n<p>  Instead of responding, Jimin pulls his arms out from behind his back. In his hands is nestled a fluffy grey kitten. It's staring up at Yoongi with giant green eyes, and it starts purring loudly as soon as it sees the blue-haired man.</p>\n<p>  “Jimin, what the hell?” Yoongi gapes down at the kitten.</p>\n<p>  Jimin pulls the kitten up to his face and nuzzles it. “Sometimes I still miss having a cat around, and I still need a familiar...so I thought...maybe...we could...get one…”</p>\n<p>  Jimin is blinking at him with those pleading puppy eyes, and the kitten is staring at Yoongi as well, mirroring the expression with its big green eyes. And goddamn it, Yoongi has always been weak for cute things. Plus, if it makes Jimin happy, how can he possibly say no?</p>\n<p>  Yoongi lets out a long suffering sigh and reaches out a hand to stroke the cat’s fur. It’s bunny rabbit soft and the little thing immediately starts rumbling a purr. “Fine,” he finally says begrudgingly. “But you’re cleaning the litter box.”</p>\n<p>  Jimin grins at him, his whole face lighting up. “That’s okay. I already have lots of practice with you.”</p>\n<p> <em> “Jimin!”</em><br>\n </p>"
}