{
  "id": "12285273",
  "url": "https://archiveofourown.org/works/12285273?view_full_work=true",
  "author": [
    "Sharleena"
  ],
  "title": "Give it to me Slow (Then Wash Away)",
  "rating": "Explicit",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "방탄소년단 | Bangtan Boys | BTS"
  ],
  "relationships": [
    "Min Yoongi | Suga/Park Jimin"
  ],
  "characters": [
    "Min Yoongi | Suga",
    "Park Jimin (BTS)",
    "Kim Taehyung | V",
    "Jeon Jungkook",
    "Kim Namjoon | Rap Monster",
    "Kim Seokjin | Jin",
    "Jung Hoseok | J-Hope"
  ],
  "additional_tags": [
    "Vampires",
    "Alternate Universe - Vampire",
    "Vampire Min Yoongi | Suga",
    "Blood Drinking",
    "blood prostitute Jimin",
    "is that a thing? it is now",
    "Smut",
    "Fluff",
    "Fluff and Smut",
    "Light Angst",
    "Violence",
    "Blood",
    "Coming Untouched",
    "Barebacking",
    "Anal Sex",
    "Slow Burn",
    "Jimin has kinks",
    "YFR-Fantasy Bingo",
    "Yoonmin fantasy bingo",
    "Top Min Yoongi | Suga",
    "Bottom Park Jimin"
  ],
  "language": "English",
  "series": "Part 2 of YoonminRec Fantasy Bingo 2017Part 1 of I can feel It go Down",
  "published": "2017-10-06",
  "completed": null,
  "words": "33,331",
  "chapters": "1/1",
  "comments": "442",
  "kudos": "14,067",
  "bookmarks": "3,900",
  "hits": "249,312",
  "summary": "<p>Jimin has worked in the Blood Brothel for a long time, he's had his fair share of clients, knows how to do his job and what to expect from his customers.<br>That's why it is to him a shock when he gets a boner from being bitten by one of their new clients, Yoongi.</p>",
  "notes": "<p>This... This was supposed to be a quick PWP. It turned into a 30k monster. I don't even know anymore.<br>Anyways, this is my second entry for the Yoonmin Fantasy Bingo, clearing the vampire square! Yay! This is 70% plot and 30% utter filth.</p>\n<p>Enjoy!</p>\n<p>As usual, a thank you to my beta, Kari &lt;3</p>\n<p> </p>\n<p> <a href=\"https://twitter.com/Love_Sharleena\" rel=\"nofollow\">Twitter</a></p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Woooh, here we go. I hope you liked it! Yoongi is a cute vampire, okay?</p>\n<p>Anyways, I'll see you all very soon, catch me on <a href=\"https://twitter.com/Love_Sharleena\" rel=\"nofollow\">Twitter</a> and remember, kudos and comments are what keep authors alive.</p>",
  "text": "<p><br>\n </p>\n<p>Sometimes Jimin thinks that Seokjin spent more money on the decorations rather than on the actual business. All for the aesthetic in some ways. After all, where did he even find leather couches that look so authentically worn out by time, giving all perfect decayed vibes, fitting the underground nightclub's theme so well. Then again, Jin is a few centuries old, so maybe those couches are his. Oh. Oh, the couches probably belong to him, maybe Jimin should ask him once.</p>\n<p>He takes a sip of his Martini, licking the liquor off his lips and then he glances at the lower level, where the patrons are sitting at the old wooden tables, glasses filled with red liquid to the brim, chatting quietly, with music filling the moments of silence.</p>\n<p>Jimin had once asked Namjoon why he chose lofi Hip Hop as the genre of music that would play in the club, he had told him that apparently it's relaxing to them, soothing even. All Jimin knows is that he listens to lofi when he has problems sleeping, so it only works in making him crave the softness of his mattress.</p>\n<p>He spots Jungkook walking between the tables, an earpiece set in his right ear and a small microphone attached to the collar of his blue shirt. The boy looks up to the balcony and their eyes meet, Jungkook gives him a smile and Jimin sticks his tongue out in return, before slumping back on his armchair.</p>\n<p>It's a slow night, not many patrons, chill and honestly boring. Also, not really prolific since he hasn't got one single client since he sat in his armchair, and it's already well past midnight. And, his Martini is almost over. This is putting him in a bad mood.</p>\n<p>He starts fanning himself with his hand, glaring at the many candle holders set on every available surface, keeping the lightness of the whole club to a minimum, dimmed and low, casting shadows on every corner. Honestly, Jimin couldn't care less about Jin's aesthetic, this is a fire hazard if he's even seen one. Also, it's too damn hot in this place.</p>\n<p>Jimin looks at his empty glass and sighs, he puts the olive in his mouth (with the toothpick still attached) and leans on the wooden railing, waving his arms so that Hoseok can take notice of him. When he does, Hoseok frowns, he's drying a glass with a cloth, Jimin raises his empty glass and sends the man at the bar counter a pleading look. Hoseok sighs and gestures at him to wait a second, already grabbing a clean glass and making Jimin his drink. He'd walk to the bar and get it himself, but he's on the balcony upstairs and he's far too lazy to actually walk down to the ground floor where the bar is positioned. Jimin has a feeling Jin put the bar there 'cause he knows that otherwise his workers would just go there to drink, abandoning their spots.</p>\n<p>That's when Taehyung finally comes back, he sits on the leather armchair in front of Jimin with a satisfied grin and a bandage wrapped around his hand.</p>\n<p>“What took you so long?” Jimin asks “You were booked for a forty seconds session, you've been away for half an hour.”</p>\n<p>“Sorry.” Taehyung grabs the unfinished drink he abandoned when he got booked “New dude who wasn't keen on understanding the rules. Had to repeat them like seven times, then once he was done my hand wouldn't stop bleeding.” Taehyung raises the bandaged hand “Then I realized I had to take a shit.”</p>\n<p>Jimin grimaces and crosses his arms “I'm bored and my drink is still not here.”</p>\n<p>“You get pissy when no one books you.”</p>\n<p>“Well, yeah.” Jimin arches an eyebrow and pushes back some strands of grey hair. The dye is starting to wear off, he'll have to go to the salon soon “I mean, I'm losing a night of sleep and getting no money, so of course I'm pissy.”</p>\n<p>Taehyung looks down at the lower level and smiles widely “Jungkook looks hot tonight.” Jimin rolls his eyes “Those pants fit him so well.”</p>\n<p>“You mean they fit his ass well.”</p>\n<p>“Yep.” Taehyung sighs dreamily, putting his chin on the palm of his hand with a huge grin on his lips “I'm so whipped.”</p>\n<p>“Oh thanks God.” a bartender finally arrives with his new Martini, Jimin almost drops it because of how aggressively he grabs the glass “If I have to hear you thirsting about Jungkook for the next three hours I'm gonna need a drink.”</p>\n<p>Taehyung glares at him, eyebrows furrowed “You're such a-”</p>\n<p>“You have blood on your hair.”</p>\n<p>Taehyung curses and starts patting his blonde hair until Jimin points at him his short bangs, the boy starts rubbing the locks between his fingers until the dry blood crumbles and falls down.</p>\n<p>Suddenly, Jimin's tablet lights up and a notification pops up.</p>\n<p>“Guess who's been booked.” Jimin grabs the tablet and taps on the notification bar, opening the information tab “New client, apparently. One minute and a half session.”</p>\n<p>Taehyung clicks his tongue “Lucky you.”</p>\n<p>He sure is lucky. One and a half sessions are always decent, he gets a good amount of money, there's no rushing which means not much pain and, usually, clients who request these kinds of sessions are also those who treat him the best once they're done. Jimin taps on the green box that confirms the booking and grabs the olive, biting it off the cocktail stick. A notification informs him that the money has been transferred in his account, he puts the tablet on the table.</p>\n<p>“Off I go.”</p>\n<p>“Be careful, yeah?” Taehyung waves at him “I'll be waiting here.”</p>\n<p><br>\n </p>\n<p> </p>\n<p>There are only three suites in the club, the rest of the services are either performed in smaller rooms or on the lower level of the club, on the couches that are put a little further from the rest of the patrons in small booths.</p>\n<p>Jimin climbs down the stairs of the balcony and walks to his suite, located in a hallway just behind a door that is guarded all the time by Yugyeom, one of their security staff and Jungkook's friend. Which means he's a brat. But with muscles.</p>\n<p>Yugyeom opens the door for him, winking as he walks past him, then the door is locked and Jimin is in the hallway. He passes the red suite then he's in front of the blue door that leads to his. Jimin takes a deep breath, fixes his hair a bit, then opens the door.</p>\n<p>His suite is always dipped in blue.</p>\n<p>Electric blue neon lights are the only thing that make things visible to the eyes, casting on the black leather couch flares of azure, the entire room feeling and looking way colder than it actually is.</p>\n<p>Jimin enters the suite, closes the door behind him and sets his eyes on the vampire sitting on the couch. He's slim, maybe even a little scrawny looking, the blue light seems to dig holes in his cheeks, skin pale and covered in clothes that look a little too large on his frame.</p>\n<p>Jimin smiles at him, a subtle curling of his lips “First time here, right darling?”</p>\n<p>The vampire nods. His face is pleasant, soft features and pouty lips that are a pale pink, button nose but eyes that are sharp and almost cat like. Also known as: Jimin's type.</p>\n<p>“Let me explain the rules to you, then.” Jimin starts undoing the first buttons of his already loose shirt “You booked me for a minute and a half, when the time is up an alarm will ring and you will have to stop. You can, howerever, add minutes or seconds to the session, but you need to tell me before the time is over.” the vampire nods, Jimin points at the right corner of the room “There's a camera there, recording everything in case something happens. Also, I am allowed to sound an alarm if for any reason I don't feel comfortable or safe.” Jimin tilts his head to the side “All clear?” another nod “Good, then tell me your name.”</p>\n<p>The vampire blinks “Yoongi.”</p>\n<p>It's... well, it's not the kind of voice Jimin expected from a face like that. It's low, akin to a rumble even, deep and awfully fucking nice to listen to.</p>\n<p>“My name is Jimin. Pick a spot.”</p>\n<p>Yoongi frowns “Spot.”</p>\n<p>“Where do you wanna bite me?”</p>\n<p>“Neck.” he replies without missing a beat, eyes falling on Jimin's neck for a second, then back on his face.</p>\n<p>Jimin is fine with being bitten on the neck, there are far worst places someone could pick. Or maybe it has to do with the fact that he's always liked having marks around his neck, down his collarbones, maybe even further- but that's another story and now he's working.</p>\n<p>Jimin nods and grabs the stopwatch from the coffee table in front of the sofa, then he sits down next to Yoongi, knees brushing together. Jimin pulls the dress shirt down until it hangs from just below his shoulders, neck and collarbones exposed.</p>\n<p>“It's new, don't wanna get it dirty.” Jimin gives Yoongi a smile “Haven't been bitten on the neck in a while, so it's all clean for you.”</p>\n<p>“Lucky me.” Yoongi says and Jimin can sense a hint of sarcasm in the flat of his voice “I'll be careful with your shirt.”</p>\n<p>“Well, then-” Jimin sends a look at the stop watch and puts his thumb over the watch's switch “Whenever you want to.”</p>\n<p>Yoongi leans in and, for some reason, brushes the pads of his fingers over his neck as if he were pushing long hair away from the skin... which, Jimin won't lie, feels kind of nice. The moment he feels Yoongi's breath ghost over his flesh, Jimin pushes the switch and the stop watch starts the countdown.</p>\n<p>Jimin likes one and a half sessions. Vampires have all the time in the world to feed, so they don't rush it. When they rush it they try to get as much blood as possible in the shortest span of time availabe and it hurts like a bitch. One minute and a half are, surely, not the best but definitely better than thirty seconds sessions.</p>\n<p>Yoongi's fangs breach the skin easily, Jimin grimaces for a moment because those things are still fucking sharp, then relaxes. He's used to this, after all. The whole process kind of becomes numb after a while, you barely feel the way the blood gets sucked away.</p>\n<p>Once the skin is open Yoongi latches his lips on the spot he picked, just above where shoulder and neck meet and starts sucking slowly. No rush. No hunger. No raw need for blood, just a caprice of his, Jimin guesses. Yeah, Jimin likes one and a half sessions.</p>\n<p>That is, until he feels like something is absolutely going south. In all senses of the word.</p>\n<p>Jimin knows how vampire's venom works. There are all kinds of venoms, some make you dizzy, some paralyze you, others straight up make you black out. But this is the first time he hears about a venom that makes you horny. 'Cause there's no other explanation for what is happening right now.</p>\n<p>There's heat cursing from the small wounds on his neck, gently spreading, traveling through his body. Jimin swallows and sends a look at the stop watch. Only forty seconds have passed. He is not going to get a hard on from having his blood sucked, absolutely not, he's a fucking professional, he's working for God's sake, he's gonna keep it cool.</p>\n<p>Jimin clenches his jaw and closes his eyes, focusing on anything besides the situation at hand. He's out of milk at home, so he'll have to buy some as soon as possible, since he's at it he might as well do some actual groceries, he can't keep living off instant food, besides-</p>\n<p>Jimin can't help the small gasp that leaves his throat when Yoongi pricks at the wound again with his fangs, so that more blood comes out. What the hell is being so gentle for, that only seems to make it worst, if Yoongi were one of those vampires who bite necks as if they want to break them in half it would be so much better. Instead, Yoongi keeps the bites soft, only sucking eagerly on them in a way that is making Jimin's head spin.</p>\n<p>Not even a minute has passed, only fifty six seconds. Jimin keeps his lips pressed tight, he swears he feels a moan threaten to slip past his mouth and that truly can't happen. Jesus, this will be awkward to explain.</p>\n<p>Yoongi bites again just above the previous spot, skin breaking easily and the vampire hums, Jimin swears he's about to have an aneurysm. It's when Yoongi's tongue darts on the skin, pressing a little harder, wet and warm, that Jimin feels his dick twitch in his pants. Jimin tilts his head back a little, legs parting almost involuntarily, eyes fluttering. He has no idea if it's the venom doing this, but fuck does it feel good. He could get lost in this, drown in the small waves of heat that move in his body, short sparkles of pleasure buzzing under his skin. Jimin dares a glance at his stop watch, Yoongi is too busy feeding to really notice his movements, or the way his breathing got so much faster than normal. Only twentyfive seconds to go.</p>\n<p>He starts counting in his head, trying to detach himself from the feelings rushing in his body, from the solid presence of Yoongi's body leaning against his.</p>\n<p>Yoongi pinches with his teeth around the small punctures to draw more blood out and sucks on the liquid hungrily, tongue darting out and Jimin whimpers. His eyes widen when he realizes that he actually made that noise, he feels his own cheeks flushing, Yoongi halting his ministrations for a second before the vampire puts his left hand on Jimin's thigh and squeezes, drinking again from his neck. And Jimin isn't stupid, he knows Yoongi did it probably because he thought he hurt him and so squeezed his leg as an apology but shit, does it not help Jimin right now. Because Yoongi's hands are pretty as hell, long fingers and blue veins visible under the pale skin. Jimin bites his bottom lip to keep himself from making any more noises, his cock hard and twitching in his pants, he feels his underwear getting sticky and this is... this is absolutely ridiculous. Because Jimin swears he could actually come from this, just from that damn venom and flicking of Yoongi's tongue, he could actually-</p>\n<p>The stop watch clicks once then rings loudly, Jimin's eyes fly open and Yoongi immediately pulls back, Jimin closes his legs and hopes he can somehow hide the tent in his pants.</p>\n<p>He swallows and pulls himself a bit straighter, trying to at least pretend that he's fine and not at all the horniest he's been in a long time. Yoongi looks at him for a few seconds, eyes a little glazed over, lips red with his blood. It's normal, vampires take a few seconds to snap out of the afterglow of the feeding.</p>\n<p>The vampire blinks and then clears his throat, licking the blood off his lips quickly “I didn't get it dirty.”</p>\n<p>Jimin frowns “Uh?”</p>\n<p>“Your shirt.”</p>\n<p>“Oh.” Jimin nods “Thank you.”</p>\n<p>Yoongi looks around for a second “Do I just leave, or-”</p>\n<p>“Yeah, you just leave.”</p>\n<p>He really needs to leave immediately, Jimin is dying.</p>\n<p>Yoongi snorts quietly but starts getting up “No aftercare whatsoever?”</p>\n<p>Jimin almost fucking groans because: one, Yoongi needs to leave before Jimin starts jerking off right in front of him, two, hearing that voice saying aftercare isn't really helping him out.</p>\n<p>“I hope you enjoyed the service.” Jimin manages to say, he's still working, there are things he needs to say.</p>\n<p>Yoongi's lips curl up for a split second “I did. I might even come back.”</p>\n<p>Jesus, please don't.</p>\n<p>“Flattered.” Jimin says, maybe a little too curtly.</p>\n<p>Yoongi turns around as if he's about to leave, but then once more twists to look at Jimin “I'm sorry if I hurt you be-”</p>\n<p>Jimin frowns when Yoongi stops speaking in the middle of the sentence, then his blood runs cold. Yoongi has his eyes fixed on the not so discreet bulge in his pants, Jimin stands frozen, all of his blood rushing to his face.</p>\n<p>“I- shit, I'm sorry if- I didn't-” Yoongi splutters, stepping back and Jimin swears he sees the vampire fucking blushing “I'll-”</p>\n<p>“Darling.” Jimin smiles “Our time is up. You need to leave the room.”</p>\n<p>Yoongi nods almost frantically, then sprints out of the suite, closing the door hard behind him and leaving Jimin alone.</p>\n<p>Jimin stares at the closed door for a few seconds, willing his breath to slow down even if just a bit, but the tightness of his pants doesn't seem to relent at all. Jimin sighs and sends a pointed glare at the camera, so he stands up almost angrily and marches to the private bathroom of his suite.</p>\n<p> </p>\n<p><br>\n </p>\n<p>“Jesus, Chim.” Taehyung says as soon as Jimin falls back on the armchair “What the fuck took you so long, you've been gone for almost an hour.” Taehyung then frowns “Why is your face so red?”</p>\n<p>Jimin pulls back his hair and takes the glass of a brand new Martini that Hoseok probably made for him knowing he enjoys his drinks after a session.</p>\n<p>“Had to rub one off then panicked.”</p>\n<p>Taehyung blinks at him, Jimin sips his Martini, hoping that his skin will stop flushing soon.</p>\n<p>“You did what?”</p>\n<p>“I got a boner.” Jimin puts the glass down “Because vampire's venom is a fucking bitch.”</p>\n<p>Taehyung's crease between his brows only deepens at that “Venom?”</p>\n<p>“The client's venom made me horny. Because of course there are venoms that-”</p>\n<p>“Jimin, there aren't.”</p>\n<p>“There aren't what?”</p>\n<p>“There are no venoms that make you horny, vampires can't give you a boner with their venom.”</p>\n<p>Jimin lets the words sink in for a few moments. In those particular moments, Jimin has also the time to realize how utterly, incredibly, truly fucked he is.</p>\n<p>“So.” he begins “You're telling me I got a boner just because I was turned on by a dude's fangs in my neck?”</p>\n<p>Taehyung narrows his eyes, clearly considering his options of answer “I believe so, yes.”</p>\n<p>“Well then.” Jimin downs his Martini and hisses “I am fucked.”</p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p>If someone asks Jimin about the legality of his job, Jimin answers by quoting what Jin said when Jimin asked him the same question “It's all about grey areas.”</p>\n<p>Vampires have always existed, lived in the dark, hidden from the world, until one day they stopped doing so. An entire species, old and ancient, who could easily walk under the sun and destroyed everything that myths and tales taught them just showed up. It's been centuries now, vampires and humans learned how to live with eachother's presence, that doesn't mean that there aren't rules.</p>\n<p>Blood Banks are common and absolutely legal, vampires can purchase blood as if they were buying groceries, but for sure vampires can't go around sucking blood from people's necks as they please. That's when Brothels came in.</p>\n<p>Are they legal? No.</p>\n<p>Are the people working in Brothels aware that what they are doing isn't legal? Yes.</p>\n<p>Are the workers of a Brothel aware that they could be put in danger? Yes, once more.</p>\n<p>As long as there's consent, that's when the grey area comes in action and, somehow, makes everything quite easy. After all, the governement knows about the existence of Brothels, the simple fact that they haven't shut them down yet it's because, clearly, they're of some use to them as well.</p>\n<p>Vampires are spoiled and they enjoy their blood warm, Brothels are nothing but a mere caprice, an itch under their skin that they'd like to get rid of once in a while.</p>\n<p>Grey area.</p>\n<p>Jimin likes his grey area. His grey area allows him to have a job that gives him more than enough money to survive comfortably, his job is in a safe position as he's the third most requested in the club and- well, yes, someone might argue that having your blood sucked isn't the best career someone could decide to venture in, but there's worst. Like, for example, having no job at all.</p>\n<p>Besides, it's only twice a week.</p>\n<p><br>\n </p>\n<p>Jimin is sitting on his usual armchair, Taehyung sitting in front of him with his eyes set on Jungkook, who's walking between tables as usual, keeping a close look on the patrons and the other workers.</p>\n<p>Jimin looks at Taehyung and sighs “Jesus, Tae, just ask him out.”</p>\n<p>Taehyung clicks his tongue “As I have no interest in being rejected, no thank you.”</p>\n<p>“He won't reject you.”</p>\n<p>“Pretty sure he will.”</p>\n<p>“On what basis.”</p>\n<p>“On the basis that I'm a human and he's not.”</p>\n<p>Jimin points at Jin, who's sitting on a stool at the counter of the bar, looking at his club with a relaxed smile “He's not human but he's still dating one.”</p>\n<p>Taehyung rolls his eyes “Namjoon is his prey, of course they're together.”</p>\n<p>“He wasn't born Jin's prey.” Jimin flicks the cocktail stick, the olive rolling in the Martini “Besides, Jungkook is only half vampire, so-”</p>\n<p>“So I should just get my shit together, yes, I know.” Taehyung slumps back in his armchair “We've talked about this before.”</p>\n<p>“Yeah, like seventeen times.” Jimin sighs “I don't know why I bother.”</p>\n<p>Taehyung grins “Me neither, babe.”</p>\n<p>Jimin decides to focus on the people downstairs, keeping himself distracted by watching a few of the patrons feeding on the regular workers on fancy couches, his eyes travel through the room until he spots Jin again, who's now amicably chatting with someone. Jimin is pretty sure he's seen that man before, then his eyes widen in realization.</p>\n<p>“Oh, shit.” Jimin ducks behind the railing, Taehyung frowning at him.</p>\n<p>“What are you doing?”</p>\n<p>“He's here!”</p>\n<p>“Who? Oh!” Taehyung ducks down as well “Hard On Fangs?”</p>\n<p>Jimin grimaces “You gave him a nickname?!”</p>\n<p>“Isn't it funny? Hard On Fangs. It's appropriate.”</p>\n<p>“It sounds like the title of a shitty porn.”</p>\n<p>Taehyung's eyes go wide “I love it. Let's produce those pornos. I already have the title for the sequel.”</p>\n<p>Jimin squints his eyes, Jin is laughing and the vampire, Yoongi if he remembers correctly, is smiling along “Why is he here again?”</p>\n<p>“Hard on Fangs 2: Suck it dry.” Taehyung raises a hand in the air “The subtitle is: The fangs are back... and this time it's personal.”</p>\n<p>“If you don't shut the fuck- wait.” Jimin frowns and looks at his friend “Why is it personal?”</p>\n<p>“Because at the end of the first movie you get kidnapped by Laurent.”</p>\n<p>“Who the fuck is Laurent?”</p>\n<p>“Hard on Fangs' enemy, a french noble vampire who has beef with Hard on Fangs.”</p>\n<p>Before Jimin can ask him if he knows any french vampires to cast for the movie, Yoongi looks up at the balcony and their eyes meet. Jimin scrambles back on his feet immediately, sitting on the armchair and hiding his face behind his hand, pretending that he's leaning his head on it.</p>\n<p>“Fuck, shit, did he notice?” he asks, Taehyung clears his throat.</p>\n<p>“You mean if he noticed you acting like a bad cartoon character?” Taehyung pauses “Nah, pretty sure that totally went right through his vampire senses.”</p>\n<p>“I'm gonna fucking kill you.” Jimin hisses. His tablet buzzes, Jimin jumps on his seat and he sees Taehyung trying to hide his snort.</p>\n<p>“Wow, I wonder who that might be.”</p>\n<p>Jimin sighs and grabs the tablet. The notification bar shows him he's been requested for a ten minutes session.</p>\n<p>“Oh.” Jimin swallows “Oh shit.”</p>\n<p>“What?”</p>\n<p>“He asked for ten minutes.”</p>\n<p>Taehyung snickers and flicks his finger against the glass of his drink “That vampire has a crush.”</p>\n<p>Jimin worries his bottom lip, finger hovering over the confirmation bar. Unless he wants another vampire boner, he really shouldn't accept this request. But he does need the money, this week has been so slow...</p>\n<p>“Fuck it.” Jimin confirms the booking request and almost throws the tablet on the table. Taehyung raises an eyebrow at him.</p>\n<p>“You're going?”</p>\n<p>“I need the money.” Jimin grabs his Martini and downs it “Wish me luck and no awkward boners.”</p>\n<p>“I'm with you spiritually, Chim.”</p>\n<p>Jimin takes a deep breath and gets up, straightens his shirt and starts making his way to the suite.</p>\n<p>Yugyeom winks at him, as usual, and opens the door for him, Jimin swears he can hear his footsteps echoing in his head. He stops in front of the door of his suite and closes his eyes.</p>\n<p>“Okay.” He whispers “No funny jokes. Yes, I'm talking with my dick, that's okay. That's not okay, jesus, fine, whatever, let's do this.”</p>\n<p>Jimin opens the door, quickly shuts it and his eyes find the couch.</p>\n<p>Yoongi is already sitting there, looking at him with eyes dipped with blue neon.</p>\n<p>“Welcome back, darling.” Jimin says, putting on a smile that feels and definitely looks forced “Good to see my services were appreciated.”</p>\n<p>“You can drop that.”</p>\n<p>Jimin frowns “Sorry?”</p>\n<p>“The things you have to say.” Yoongi replies with a shrug “Drop them.”</p>\n<p>Jimin pauses and nods, then starts walking to the couch “Fine. What do you want today?”</p>\n<p>Yoongi looks down at his lap, his thumb playing with a silver finger on his index finger “Mostly apologize about last time.”</p>\n<p>Jimin thanks God and Obama as well that the cold lights of his suite don't allow Yoongi to see the horribly aggressive blush that spreads on his face “Don't need to apologize about that, it was mostly my fault for-” Jimin grimaces “That.”</p>\n<p>Yoongi looks back at him and nods “Okay.”</p>\n<p>“Is that why you're here?” Jimin asks “You wanted to apologize?”</p>\n<p>Yoongi shakes his head “No, I'm also here to drink.”</p>\n<p>Shit. Jimin keeps back a sigh and starts undoing the first buttons of his blue shirt but Yoongi holds up a hand.</p>\n<p>“I'll bite your wrist.” he says “Maybe it's- better. Yeah.”</p>\n<p>Jimin wants to disappear.</p>\n<p>“Right.” Jimin sits down on the couch and undoes the buttons of the sleeves of his shirt, pulling it up so that his wrist is bare, then he grabs the stop watch “You remember the rules?”</p>\n<p>“Yeah.” Yoongi replies, already eyeing Jimin's wrist which is not helpful. At all.</p>\n<p>“Well, then, serve yourself.” Jimin holds out his wrist.</p>\n<p>Yoongi gives him one last look before he grasps Jimin's wrist and brings it to his mouth, Jimin starts the stop watch and Yoongi bites. The fangs breach the skin even more easily than last time, although Jimin can feel Yoongi is being a little more careful. Jimin takes a deep breath and looks away, trying to detatch himself from the situation. Yet, he waits for it, for the heat to surge through his body again.</p>\n<p>But it doesn't happen. Not even when Yoongi starts sucking at the two small wounds. Thing is, it still feels good, which is all kinds of fucked up, but there's none of that heat going straight to his dick, none of his mind buzzing with waves of pleasure. Just... it just feels nice.</p>\n<p>Jimin relaxes and sighs, sitting more comfortably and letting his head fall back on the pillow. Ten minutes sessions take energy out of him, he might as well try to rest as much as he can.</p>\n<p>Barely a minute has passed before Yoongi pulls back from his wrist “How did you start working with Jin?”</p>\n<p>Jimin frowns, Yoongi looks at him with a blank expression.</p>\n<p>“Are you-” Jimin licks his lips “Are you trying to make conversation whilst you suck my blood?”</p>\n<p>Yoongi blinks “'s that weird?”</p>\n<p>\n<em>Yes.</em>\n</p>\n<p>“No.” shit.</p>\n<p>“Tell me, then.”</p>\n<p>Jimin arches an eyebrow “That's quite demanding.”</p>\n<p>“I'm like that.”</p>\n<p>“Demanding.”</p>\n<p>“Yeah.”</p>\n<p>“You're also brutally honest.”</p>\n<p>Yoongi shrugs and Jimin guesses that sharing this won't hurt.</p>\n<p>“I started working for him a little more than two years ago.” he says, Yoongi starts drinking from his wrist again “I was looking for easy money, this sounded like easy money.”</p>\n<p>Yoongi hums, bites between his teeth the wounded skin, drawing out more blood “Isn't it dangerous?”</p>\n<p>“Sure.” Jimin sends a look at his stop watch, two minutes “There's worst out there, though. This place is safe, Jin takes good care of us.”</p>\n<p>Yoongi keeps on drinking but he sends him a look that is asking of him to elaborate.</p>\n<p>“I met him by chance, I was walking by one night and saw this place that looked like a night club so I got curious. I like night clubs.” Jimin swears he feels Yoongi's lips stretch in a small smile “When I got in I realized where I was and Jin was all over me, asking if I was here by mistake, already trying to take me outside, apologizing over and over. I just asked him if they were looking for fresh meat, I started working there the following week.”</p>\n<p>Yoongi frowns and pulls back from his wrist, his eyes already looking a bit darker than usual “Just like that?”</p>\n<p>“I had just moved in Seoul, I used to live in Busan. I had to pay rent.”</p>\n<p>Yoongi nods slowly, as if he's not completely convinced by Jimin's answer, but he doesn't press.</p>\n<p>“I've known Jin for quite a while.” he says.</p>\n<p>“Oh.”</p>\n<p>“He's a good friend.” Yoongi points at his wrist “You're feeling okay?”</p>\n<p>Jimin nods “Yeah, sure, keep going.”</p>\n<p>Yoongi starts lapping and sucking at the wounds again, still awfully careful with the pressure he puts, holding his wrist with long fingers that are surprisingly soft.</p>\n<p>“Have you ever went to a Brothel before?” Jimin asks. Yoongi looks comfortable with the environment so he guesses he has, but he still asks. If Yoongi thinks he has rights to ask questions than so does he.</p>\n<p>“I have.” Yoongi replies, barely moving away from his wrist, lips grazing his skin “Went to many different ones.”</p>\n<p>Jimin hums.</p>\n<p>“This one became my favorite, though.” Yoongi says before he gets back at drinking.</p>\n<p>Jimin knows he must be blushing, which is stupid. He doesn't know if Yoongi meant it in a flirtatious way, the vampire tends to keep his voice quite flat, it's hard to really know if he means something or not. Still, the words get to him.</p>\n<p>A look at the stop watch tells Jimin that three minutes and a half have went by and that's also when the dizzyness starts catching up. Ten minutes session are nice, but they are draining. He knows that after this he'll have to get home, 'cause no way in hell another vampire is gonna suck his blood, unless Jimin actually wants to be in danger.</p>\n<p>Still, Jimin is used to this, to the dizzyness, he guesses that after a while you develop some sort of resistance. Yoongi pricks at the wound again, sharp teeth pressing hard but not enough to breach the skin again, Jimin gasps softly at the sensation. Fuck, it does feel nice... not arousing, not this time, but it's relaxing, it's small waves of heat that curl up in his chest, it's something he might and maybe even wants to get familiar with.</p>\n<p>Suddenly, Yoongi pulls away and slumps back in the couch. He's got his chin red with blood, lips almost scarlet, eyes dazed and lips parted.</p>\n<p>“Give me a- a moment.” Yoongi swallows, words slurred almost as if he's drunk.</p>\n<p>“Sure.” it's not unusual that during the longer sessions, vampires take breaks. Blood is, after all, something addicting, smooth like any alcohol and vampires are too lazy to search for a hangover.</p>\n<p>“You taste good.”</p>\n<p>Jimin freezes. Yoongi doesn't seem to have even noticed speaking out loud. That's another thing of the after glow, vampires start talking. Usually, Jimin doesn't mind nor does he care, but- shit, the way Yoongi said it. Voice husky, with that blissed out expression on his face, that does things to Jimin.</p>\n<p>“Yeah?” Jimin asks, for some reason feeling like he wants to get more out of Yoongi “What do I taste like?”</p>\n<p>Yoongi blinks, slowly training his gaze on him. Jimin can see that the daze is wearing off, Yoongi's eyes are far too sharp now.</p>\n<p>“Sweet.” he replies “But there's a sourness to it.”</p>\n<p>“Sourness.”</p>\n<p>“Like... shit, I don't know.” Yoongi chuckles, blue neon reflecting on his black hair “Like Gin.”</p>\n<p>Jimin hums “I drink a lot of Martinis.”</p>\n<p>“That's it, then.” Yoongi licks the blood off his lips, tongue darting out quick “I swear I can almost taste the olives.”</p>\n<p>“I call bullshit on that.”</p>\n<p>“Maybe. Maybe not.” Yoongi breathes out slowly and cleans his chin of the blood with the back of his hand “Thanks for your service.”</p>\n<p>“What?” Jimin sends a look at the stop watch, there are still five minutes to go “You're done? We still have time.”</p>\n<p>“I'm not drinking more.” Yoongi says, he starts sitting up straighter.</p>\n<p>“Why?”</p>\n<p>Yoongi sends him a look “Wait, you're telling me that your customers use all the ten minutes?”</p>\n<p>Jimin shrugs “They take breaks, but they definitely drink more than you did.”</p>\n<p>Yoongi scoffs and shakes his head “Selfish pricks, if they wanna get drunk they can do it with the bags, not with humans.”</p>\n<p>“You paid for ten minutes.” Jimin insists “You should talk to Jin, ask him for a refund.”</p>\n<p>“Nah, I got what I wanted alright.” Yoongi waves a hand at him “You use these last five minutes to rest, I ain't gonna suck you dry.”</p>\n<p>Silence falls in the suit. Yoongi looks at Jimin sharply, eyes blown wide, Jimin swears to God he can literally hear his own blood rush to his face.</p>\n<p>“That-” Yoongi coughs “That came out wrong.”</p>\n<p>“Kinda.” Jimin nods, stiff like wood “Yeah.”</p>\n<p>“I'm- I think I'll go. Thank you for your services and- and all that stuff.”</p>\n<p>Jimin nods frantically “Yes! Of course!” Yoongi starts getting up from the couch and that's when he remembers he's still working and he's got shit to say “I hope you'll come back, and I wish you a good night.”</p>\n<p>Yoongi flashes him the most forced smile Jimin has ever seen on someone's face and he starts making his way to the door, but he stops in front of it, hand hovering just above the handle, then he turns around.</p>\n<p>“Herring.”</p>\n<p>Jimin blinks “What?”</p>\n<p>“I heard herring is good for low blood. Parsley, too. And oranges.” Yoongi says “So eat them.”</p>\n<p>Jimin looks at the vampire for a few seconds before a bubble of giggles rises from his throat “Jesus, you are demanding.”</p>\n<p>Yoongi grins back at him “I told you I am.”</p>\n<p>“Okay.” Jimin rubs at his nose, still laughing quietly “I'll eat some.”</p>\n<p>Yoongi's eyes seem to linger on him for a while, Jimin tries to hold his gaze as much as possible, then Yoongi's lips curl in a smile that is... soft. Softer than Jimin expected.</p>\n<p>“Yeah.” he says “Do that, <em>doll</em>.”</p>\n<p>Yoongi opens the door and leaves, Jimin left alone in the suite. The wounds on his wrist are pulsing, there's still heat in his body, slowly fading away, and he's got three minutes left.</p>\n<p>He knows he's gonna spend them thinking of how fucking nice it felt to be called doll by Yoongi.</p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p>The week goes by in a blur. He spends his days home, lazying around, ordering take out, watching movies, listening to music, enjoying the earnings of the month. He cashed a good amount of money and he decides he deserve a stress free week.</p>\n<p>When he gets back to the brothel it's with the taste of an orange lingering on his tongue.</p>\n<p>Taehyung is sitting in front of him, sipping his drink slowly.</p>\n<p>“You.” Taehyung suddenly says, Jimin looks at him “You is whipped.”</p>\n<p>“Your grammars are fucked.”</p>\n<p>“What happened last week?”</p>\n<p>“Nothing.”</p>\n<p>“Got a boner again?”</p>\n<p>Jimin rolls his eyes “No.” he takes a gulp of his martini and starts playing with the toothpick, moving the olive around in the glass “He called me doll.”</p>\n<p>Taehyung nods “You is whipped.”</p>\n<p>Fuck, maybe he is. So what if he is?</p>\n<p>“I'm not the one who starts drooling the moment Jungkook fixes his jacket.”</p>\n<p>Taehyung smirks “I wish he could fix his cock in my-”</p>\n<p>“I'm stopping you right now.”</p>\n<p><br>\n </p>\n<p>Yoongi doesn't stop by this week, but Hyuna does, booking him for half an hour.</p>\n<p>Jimin has been Hyuna's favorite little drink since the beginning, the vampire always had a soft spot for Jimin. And Jimin loves his half an hour sessions with Hyuna as the woman barely even drinks his blood, just keeps him there to gossip.</p>\n<p>“He's back, you know?” she says as she licks blood off Jimin's shoulder, the red liquid dripping from the wound.</p>\n<p>“Which one?” Jimin asks, his fingers carding through Hyuna's long orange hair, locks falling in soft curls over her bare shoulders.</p>\n<p>Hyuna moves her leg over Jimin's legs, so that she can straddle him, she sucks lightly at the bite “Bon Hwa.”</p>\n<p>Jimin grimaces “That asshole?” she hums “Drop his ass in a ditch, you deserve better.”</p>\n<p>Hyuna giggles and looks at him through her lashes, eyes big and round, her face so beautiful Jimin could just sigh “Oh, honey, you're right. I should.”</p>\n<p>“What about the human?” Jimin asks “You liked him.”</p>\n<p>“I still like him.”</p>\n<p>“What's his name again?”</p>\n<p>“Hyojong.”</p>\n<p>“He's pretty.” Jimin remembers the photo Hyuna showed him just a month ago “And he's so in love with you.”</p>\n<p>“You don't know that, honey.”</p>\n<p>“Who wouldn't be in love with you?”</p>\n<p>Hyuna raises an eyebrow at him “You aren't.”</p>\n<p>“I have a good excuse, though. I like cock.”</p>\n<p>Hyuna laughs, eyes lighting up, electric blue painting them azure. Jimin smiles at her, still passing his fingers between the woman's hair, she sighs “God, you're so lovely honey.”</p>\n<p>“Dump Bon Hwa's ass.” he says “Get with the human.”</p>\n<p>Hyuna hums and licks off some remaining blood from his skin before she hops off Jimin's lap and sits back on the couch “Humans are frail, honey.”</p>\n<p>Jimin doesn't reply.</p>\n<p>“What about you, though?” she asks, squeezing his knee “Got anyone in that heart of yours?”</p>\n<p>Jimin licks his lips “Maybe.”</p>\n<p>“Who?”</p>\n<p>“He's-” Jimin shakes his head “I don't know. A customer.”</p>\n<p>“A vampire?”</p>\n<p>Jimin nods “Not a smart idea, mh?”</p>\n<p>“Depends on what kind of vampire he is.”</p>\n<p>“A demanding one.” Jimin replies after a pause.</p>\n<p>“Those are the worst ones.” Hyuna whispers “Trust me. I'm one of the demanding types, we're all a bunch of annoying motherfuckers.”</p>\n<p>Jimin laughs at that, feeling relaxed like he'd be with a friend.</p>\n<p>“How does he look?”</p>\n<p>Jimin smirks “Good.”</p>\n<p>“What kind of good?” Hyuna rolls on the couch so that she can look at Jimin better “I'm curious now.”</p>\n<p>“He looks-” Jimin pauses “He looks good under blue neon.”</p>\n<p>Hyuna hums, her index finger tracing the line of Jimin's jaw “Be careful of those ones.”</p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p>It's two weeks after Yoongi's last visit that the vampire comes back.</p>\n<p>Jimin sees him, once again, chatting with Jin near the counter and sometimes their eyes meet, briefly, Jimin always immediately looking back at his glass of Martini.</p>\n<p>“You think he's gonna grow a pair and book you or-” Taehyung squints his eyes in Yoongi's direction “Never took you for one who's into the pretty type.”</p>\n<p>Jimin arches an eyebrow “With a voice like his he could look like a goddamn cockroach, I'd still go for it.”</p>\n<p>Taehyung snorts, he seems to be about to say something when he suddenly groans “Trouble's coming.”</p>\n<p>Jimin frowns and looks down from the balcony. A man, a vampire Jimin guesses, is walking to the balcony, his steps staggered and unbalanced, he must be drunk.</p>\n<p>“Hey!” the vampire calls from the first floor, pointing at the balcony with a dazed smile “What do I gotta do to get up there?”</p>\n<p>“You can't.” Jimin replies “You book us and we come down.”</p>\n<p>The vampire hums, losing his balance once he stops right under the balcony. Honestly, there's not much distance from their balcony and the first floor, just enough to show that they're the pricey ones. The vampire can easily reach for the wooden rods of the balcony, his chin reaches the platform in terms of height, although he still has to tilt his head up to manage to look at their faces.</p>\n<p>“What, you pretty things are too precious for us?”</p>\n<p>“Yep.” Taehyung replies, crossing his legs and focusing on his drink “If you wanna book us you can, but you can't stay here.”</p>\n<p>“Why?”</p>\n<p>“You're annoying.” Taehyung says, then he turns to Jimin “You were saying?”</p>\n<p>“Come on, don't be like that.” the vampire slurs, waving his hand around until he grabs one of the wooden rods “You're so pretty, I bet you taste delicious.”</p>\n<p>Jimin grimaces “You're drunk, get back at your table. You still have blood on your chin, Jesus.”</p>\n<p>Jimin wonders who's the poor soul that he drank from, they sure as hell couldn't have had a decent experience with this kind of customer.</p>\n<p>“I like you, yeah?” the vampire says, pointing at Taehyung, who just rolls his eyes “I'll drink real slowly, yeah? So that it won't hurt. From your shoulder, so I can lick down to those pretty collarbones of yours.”</p>\n<p>“Sir.”</p>\n<p>Taehyung almost chokes on his drink when he takes notice of Jungkook, standing besides the vampire with a blank expression. Jimin presses his lips together so that he doesn't snort.</p>\n<p>“I'm gonna have to ask you to go back to your table, you can't talk to them.” Jungkook says, already opening his arm in the direction of the vampire's table “If you could follow me.”</p>\n<p>The vampire regards him for a moment and scoffs “A fucking half-breed thinks he can talk to me?”</p>\n<p>“Dickhead.” Taehyung whispers, but the vampire hears him just fine, turning to him again, squeezing the rod harder.</p>\n<p>“You said something?”</p>\n<p>“Yeah.” Taehyung puts his drink back on the table “I said you're a dickhead.”</p>\n<p>“You've got a mouth on ya, I like that.”</p>\n<p>“Sir.” Jungkook heaves a sigh “As I said-”</p>\n<p>“Shut up, kid, I'm talking to this bitch.”</p>\n<p>Taehyung snorts and Jimin sees him rolling up the sleeves of his expensive shirt “You know what, this bitch is about to come down there and fucking shove his fist up your-”</p>\n<p>“I'm gonna tell you one more time.” Jungkook speaks over Taehyung, sending him a quick look “Leave on your own legs, or I will make you leave.”</p>\n<p>The vampire lets his eyes linger on Jungkook for a few seconds, then he clicks his tongue “I ain't speaking to trash like you.” he turns to Taehyung again and he moves his hand past the rods, grabbing Taehyung's ankle and yanking it towards him.</p>\n<p>Taehyung yelps, taken by surprise, and Jimin sprints up catching him before he falls on the table. Jungkook immediately grabs the vampire's arm, twisting it behind his back, the man shrieking in pain as Jungkook pushes him down on his knees, the entire club going silent.</p>\n<p>“You fucking touch him again, I'm gonna rip your head off.” Jungkook hisses, Jimin sees some of the security staff hurrying over.</p>\n<p>“Holy shit.” Taehyung whispers “I'm so hard right now.”</p>\n<p>Jimin groans and lets go of his friend, who just falls back on his armchair staring at Jungkook with wide eyes.</p>\n<p>The other two security guards grab the vampire's arms and start dragging him to the exit, the club slowly living up again, soon enough the chatter and buzzing are back to their normal volume.</p>\n<p>Jungkook fixes his jacket and turns to them “You guys are okay?”</p>\n<p>“Peachy.” Jimin says, he looks at Taehyung “<em>Taehyung</em>, did he hurt you?”</p>\n<p>Taehyung, who still looks a little out of it, slowly trains his gaze on Jimin.</p>\n<p>“You know.” Jimin raises his eyebrows “He grabbed your ankle pretty hard. So I was wondering if maybe, <em>just maybe</em>, you wanna ask Jungkook to take you outside for a moment. To get a breather.”</p>\n<p>“Uh?” Taehyung mumbles, Jimin refrains from slapping him.</p>\n<p>“Are you hurt?” Jungkook asks, looking like a lost puppy.</p>\n<p>“Nu-uh.” Taehyung shakes his head and he blinks “That was so hot.”</p>\n<p>“Oh my God.” Jimin murmurs.</p>\n<p>Jungkook, on the other hand, flushes so quickly and so hard that Jimin worries he might be on the verge of having a heart attack.</p>\n<p>“That was- what?” he asks, doe eyes going huge.</p>\n<p>“The hottest thing I've ever witnessed.” Taehyung repeats.</p>\n<p>Jungkook chokes on his spit, Jimin wants to kill them both.</p>\n<p>“Right, yes, I- well, I mean-” Jungkook scratches the back of his neck “Well, you guys are okay so I'm- I'm gonna go. Okay. Bye.”</p>\n<p>Jimin hums as Jungkook basically runs away, when he looks at Taehyung he finds his friend looking at him with a smirk.</p>\n<p>“Oh, Tae.” Jimin giggles “You're such an asshole.”</p>\n<p>Taehyung shrugs and gets his drink back in his hand “Isn't he adorable? He looks like he could bend me in half and make me beg for his cock, but you say one nice thing to him and he becomes jelly.”</p>\n<p>“You're fucking nasty.”</p>\n<p>“And he's gonna be my man before the end of the week, so who's the real winner?” Taehyung's tablet buzzes and he groans “I can't believe I'm being booked right after I finally saw Jungkook blush, life is unfair.” he still grabs the tablet and accepts the request “I'll see you later, Chim.”</p>\n<p>“Be careful out there.”</p>\n<p>“You know it.”</p>\n<p>Taehyung walks away and Jimin starts drinking his Martini again. He sends a look in Jungkook's direction and sees him standing in a corner, looking at the patrons, his usual laid back expression on his face but the blush is still there as well.</p>\n<p>“Cute.” Jimin whispers, his tablet buzzes. Jimin looks at the bar but Yoongi isn't there, that must mean-</p>\n<p>He takes the tablet and- yeah, Yoongi just booked him. Okay. He can do this. No big deal.</p>\n<p>HUGE DEAL!, his mind helpfully provides him, but Jimin still accept the request and finishes the rest of his Martini, he stands up and makes his way to the suite, Yugyeom opening the door for him with his usual wink.</p>\n<p>Jimin fixes his blue shirt a bit, silk a little crinkled at his sleeve, then he opens the door to his suite.</p>\n<p>Yoongi is standing in front of the minibar, fixing himself a drink. He looks- well, different.</p>\n<p>Usually, Yoongi comes wearing a suit, or a dress shirt, elegant pants, because the Brothel has a dress code going on. But tonight Yoongi is just wearing black. Black leather jacket, black t-shirt tucked in his black skinny jeans and- well, he has a nice ass, that's all Jimin has to say.</p>\n<p>“Hi.” Yoongi says, pouring what looks like whisky in his glass “Jin said we can drink, I'm taking advantage of it.”</p>\n<p>“Of course.” Jimin closes the door “Haven't seen you in a while.”</p>\n<p>“I was in Japan, work.” Yoongi sniffs his glass of Whisky and shrugs “Jin has shitty taste in liquors.”</p>\n<p>“You booked me for thirty seconds?” Jimin sits down on the couch.</p>\n<p>“Yeah, I'm- kind of in a hurry today, sorry.”</p>\n<p>“Oh, no, it's fine.” oh God, why is he so disappointed that Yoongi booked him only for thirty seconds, what is wrong with him.</p>\n<p>Yoongi drinks some of his drink, then he makes his way to the couch “What was all that about, before?”</p>\n<p>“You mean the asshole?”</p>\n<p>“Yeah.”</p>\n<p>“Drunk customer.” Jimin shrugs “It happens.”</p>\n<p>Yoongi sits down next to him, not meeting his eyes “'s that so?”</p>\n<p>“It's not that dangerous, really. We have good security.”</p>\n<p>“You don't have it in here, though.”</p>\n<p>Jimin frowns “Sorry?”</p>\n<p>“Here in the booths there's no security.”</p>\n<p>“There are cameras and we have alarms.”</p>\n<p>Yoongi pauses “The security takes a while to arrive, though.”</p>\n<p>Jimin swallows “You're worried?”</p>\n<p>“Yeah.” Yoongi downs some more of his drink then he freezes “Shit, I really am brutally honest.”</p>\n<p>Jimin laughs at this, Yoongi smiling to himself and the atmosphere in the suite slowly starts mellowing down, Jimin swears he could've tasted the tension just a few moments before.</p>\n<p>“You said you're in a hurry, so let's do this.” Jimin says, already taking his stop watch “Where do you want to drink today?”</p>\n<p>“Neck.”</p>\n<p>Jimin freezes. Oh. Oh, no. Yoongi looks at him, the glass still held in his hand, in the blue hues of the room his eyes feel way more intense than they should feel. Jimin has always been weak to eyes like those.</p>\n<p>“Okay.” Jimin wonders if Yoongi can see how hard his hands are shaking once he starts undoing the first buttons of the shirt. But he knows Yoongi is looking at him, even when he puts the glass back on the table. Jimin doesn't know what it is that is going on between them at this point, 'cause it sure as hell isn't a normal customer/worker relationship. Hell, maybe it never has been, but now it's different.</p>\n<p>“Okay.” Jimin pulls the shirt down his shoulders and grabs the stop watch “When you're ready.”</p>\n<p>“Is it all clean for me again?” Yoongi asks, voice flat, Jimin can't help the chuckle.</p>\n<p>“You really didn't like me saying it.”</p>\n<p>“It felt really forced.” Yoongi says as he starts angling himself better on the couch.</p>\n<p>“It was forced, I have stuff to say when I work, but you don't like them.”</p>\n<p>Yoongi hums, eyes set on Jimin's neck “I'd like them if you meant them.”</p>\n<p>Jimin decides to stay quiet at this. Yoongi seems to understand that he's not gonna say anything back so he finally starts leaning down on his neck. Again, he brushes his fingers on the spot he chose, just like last time, once Jimin feels the ghost of Yoongi's lips against the skin, he presses the button of the watch.</p>\n<p>Jimin closes his eyes, feeling way too tense, Yoongi's fangs start breaching the skin but- slowly. So slowly. He can feel his skin opening but it doesn't hurt, Yoongi's lips latch on his neck and he starts drinking.</p>\n<p>Jimin is used to thirty seconds sessions. They're uncomfortable, hurried, the vampires drink fast and hard to get the most out of the little time they have. Instead, Yoongi is sucking on the wound so gently, as if he has all the time in the world, as if he's not doing this for himself but-</p>\n<p>He isn't doing this for himself, Jimin realizes. Yoongi is doing this to make <em>him</em> feel good. And shit, it's working. It's not- not like the first time. No scorching heat, no arousal. It's something awfully nice, it feels almost like stepping in warm water, body relaxing easily under Yoongi's fangs, Jimin's eyes flutter open. Suddenly he realizes he really doesn't give a shit as to why he feels like this when Yoongi bites him and drinks from him, fuck it, it feels good and it feels <em>right</em>.</p>\n<p>Yoongi laps at the wound and Jimin can't keep in the small sounds that slips past his lips. He hears Yoongi humming against his skin, the vampire's hand settles on his nape, thumb stroking him softly and it feels too tender, too intimate, it just makes Jimin feel even better, more comfortable. Before Jimin can't stop himself, his hand fists the fabric of Yoongi's t-shirt, tugging at it. Yoongi's fingers twitch against his nape before they move up to his hair, carding between silver locks, Jimin sighs at the feeling and-</p>\n<p>The stop watch clicks then rings, loud enough to make him flinch. Yoongi is already pulling back but he doesn't move much, just enough so that his lips aren't on Jimin's neck anymore, his breathing coming fast and breaking on his skin. Jimin swallows, keeping still, his hand clinging on Yoongi's t-shirt.</p>\n<p>Yoongi twists his head a bit, meeting Jimin's eyes and- God, Yoongi looks fucking wrecked. Which is insane, because they've had longer sessions, sessions that were far more intense than this, but Yoongi's eyes are lidded and dark, lips parted and shiny with Jimin's blood, blue neon casting shadows on Yoongi's cheekbones.</p>\n<p>“You-” Yoongi clears his throat “Everything okay?”</p>\n<p>“Uh?” Jimin blinks “I'm- yeah. No awkward boner this time.”</p>\n<p>Yoongi stares at him for a second, Jimin feels himself flushing. That was not what he wanted to say, his fucking brain needs to snap out of it.</p>\n<p>“That's- good.” Yoongi nods and finally starts moving away from Jimin, slumping back on the sofa with a loud sigh.</p>\n<p>“You're the one who doesn't look okay.”</p>\n<p>Yoongi chuckles breathlessly “I'd like to see you in my place.”</p>\n<p>“You didn't drink much, is everything alright?”</p>\n<p>“It's hard not to drink a lot from you, doll, that's all I'm saying.”</p>\n<p>“Oh.” Jimin sits up a little straighter, having actively sunken in the couch, he pulls his shirt back up on his shoulders “You could've asked for more time.”</p>\n<p>“I should have.” Yoongi mutters, he heaves a sigh and licks his lips clean, then he starts getting up “But I really have to go, wasn't lying when I said I'm in a hurry.”</p>\n<p>Jimin starts buttoning his shirt again, Yoongi stands in front of him for a few moments before he turns around and takes a few steps to the door, only to stop and twisting to Jimin once more.</p>\n<p>“Should I-” Yoongi looks at the floor “Should I ask for more time when I'll come back again?”</p>\n<p>“Yes.” Jimin replies, way too quickly “I mean- if you want to.”</p>\n<p>“I do.”</p>\n<p>“Then you should.” Jimin pauses “I don't like herrings.”</p>\n<p>Yoongi frowns at him “Herrings.”</p>\n<p>“You said they're good for blood but I don't like them. I still ate them, though.” Jimin smiles sheepily “I was afraid the whole time my blood was gonna taste of herring.”</p>\n<p>Yoongi snorts at that, scratching his nose “It doesn't, don't worry.”</p>\n<p>“Okay. I'll see you next time, then.”</p>\n<p>Yoongi smiles at him, shifting his weight from one foot to another “I'll see you next time, doll.”</p>\n<p> </p>\n<p><br>\n </p>\n<p>Jimin spends probably more time than he's allowed to in the empty booth, pressing a towel against the wounds on his neck even though the blood has already stopped, staring at the wall in front of him, eyes growing weary of the electric blue lights.</p>\n<p>Jimin wonders, for a moment, if Yoongi still goes to other brothels. He did say that this one became his favorite, that doesn't mean he just comes here though. He said he's been in Japan, isn't Tokyo really famous for it's Brothels?</p>\n<p>“Oh my God.” Jimin groans “Why am I jealous?”</p>\n<p>Yoongi is a customer, for fuck's sake, what the hell is he being so petty for? So what if he went to another Brothel, it's not like Jimin owns him or anything.</p>\n<p>Wouldn't it be better if he weren't a worker in this place? Then again, Jimin probably would have never met Yoongi if it weren't for his job, so- but it's not just that. He might be just a staff member, but Yoongi doesn't act like a customer either, which doesn't make things easy at all. Jimin had his fair share of customers and even the best ones didn't act that way with him. They sure as hell didn't try to make the experience enjoyable, let alone pleasurable, they treated him for what it was, a walking bag of blood for sale in a shop. Hyuna, of course, is an exception, but Hyuna is also his friend. Yoongi? They're not friends. But Jimin is also pretty sure their relationship isn't the one that a worker and a customer would have.</p>\n<p>Jimin throws the towel on the floor and stands up, feeling restless. Maybe he should call it a night, Jin would understand if he'd ask him to get the rest of the night off.</p>\n<p>He makes to leave his suite, then he stops. Right on top of the mini bar he sees what looks to be a wallet. He grabs it and frowns, feeling the smooth leather under his fingers. This- this must be Yoongi's. Jimin leaves the booth and quickly makes his way back into the club, Yugyeom is still standing beside the door, smiling at him as he closes the door that leads to the suites, then Jimin squints his eyes, looking for Namjoon.</p>\n<p>He finds him sitting at the bar, sipping on what looks like a hard liquor, so Jimin hurries to him.</p>\n<p>“Hyung?”</p>\n<p>Namjoon turns to him “Hey, everything alright? You've been in there for a while.”</p>\n<p>“It's okay, just-” Jimin sits on the free stool next to Namjoon's “Can I ask you something?”</p>\n<p>Namjoon frowns but nods, putting the glass on the counter “Sure, kid.”</p>\n<p>“How did you know that Jin wanted more than just drinking from you?”</p>\n<p>Namjoon arches an eyebrow, his eyes already glinting with interest “You think a vampire wants more than blood from you?”</p>\n<p>“I asked first.”</p>\n<p>“And I'm asking second.”</p>\n<p>“Maybe. I don't know.” Jimin fidgets with the hems of his shirt “That's why I'm asking.”</p>\n<p>Namjoon hums “With Jin it was easy to deduce. I mean, he's easy to read, didn't take much to understand he was interested in me. Then again-” Namjoon grins “I wasn't a worker in a blood brothel and he wasn't a customer.”</p>\n<p>Jimin doesn't say anything, dropping his eyes to his lap. Fuck Namjoon and fuck his brain for always figuring things out too quickly.</p>\n<p>“Because it is a client, isn't it?” Namjoon pushes, he takes the glass again and drinks.</p>\n<p>“Yeah.” Jimin admits with a sigh “He is.”</p>\n<p>“Okay, how does he act with you?” Namjoon asks “Vampires are easy to read, really, they're not exactly subtle.”</p>\n<p>“He told me to eat herrings because they're good for my blood.”</p>\n<p>Namjoon snorts, he shakes his head “That's kinda cute.”</p>\n<p>“And he's always really- you know-” Jimin gestures with his hands “Careful when he bites.”</p>\n<p>“Careful?”</p>\n<p>“He's gentle about it? Makes sure he doesn't hurt me. Once he booked me for ten minutes but drank only for five, even less, he got upset when I told him that usually clients use all of their time.”</p>\n<p>Namjoon nods along, eyes focused on him, drink forgotten “What else?”</p>\n<p>“He gets worried? Like, today there was that drunk customer and when he realized that it would take a few moments for the security to get to the suites he admitted to me being worried. And- I don't know, he touches me? A lot? Clients do, of course, but not like that, it's just-”</p>\n<p>“He's courting you.” Namjoon cuts him off, seemingly unfazed, then he gets back to his drink.</p>\n<p>Meanwhile, Jimin's heart is dancing the conga and his brain is going in full panic mode “Woah, he's what?”</p>\n<p>“Courting you. They do that. Especially the really old ones.” Namjoon replies “Vampires get protective when they're into someone, even fucking territorial sometimes. So the touching, that's because he's marking you.”</p>\n<p>“Marking me.”</p>\n<p>“Because of the smell. He's probably not even doing it on purpose.” Namjoon shrugs “You get used to it after a while. The real question is, are you okay with him courting you?”</p>\n<p>Yeah. Yeah, that is an important question. Jimin looks at the wallet in his hands, black leather, it looks old and worn out.</p>\n<p>“Hyung?”</p>\n<p>Namjoon hums, a knowing grin hidden behind his glass.</p>\n<p>“Can you go look at the client's register and give me an address?” Jimin asks, tapping his thumb against the wallet “One of them forgot something.”</p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p>So, maybe he wasn't expecting a house like this. Vampires are rich, usually, or at least well off. After all they are old, the majority of them are, the younger ones are still part of families that are ancient. So, what Jimin was expecting was a huge condo in Gangnam, or maybe a penthouse.</p>\n<p>What he wasn't expecting was a normal looking condo in Songpa. The building looks new, though, it must have been built recently, maybe in the last five years or so? Jimin takes a deep breath and casts a look at a car parked next to him, trying to get a glimpse of his reflection to see if he looks decent. He didn't exactly dress up, not at all, but he did put on jeans that could be less tight in some places.</p>\n<p>Jimin steps inside the building and looks at the map of the inside. Yoongi's flat, apparently, is at the third floor. He finds easily the elevator and asks himself again if this is a good idea. Yoongi would probably come back to get his wallet, maybe this is a bit too much?</p>\n<p>“Whatever.” Jimin mumbles as he pushes the button for the third floor. He came this far, he woke up even though he worked all night long, hell he took the fucking subway and Jimin hates the subway. So he's gonna do this and if it goes to shit- well, at least he tried.</p>\n<p>Once he's out of the elevator, Jimin starts looking for Yoongi's apartment. He scans the numbers above the doors and finally gets to the right flat.</p>\n<p>It's okay. He can do this. If only his heart could stop trying to break his ribcage, that would be nice.</p>\n<p>“Fuck it.” Jimin presses the buzzer and waits. Seconds go by and nothing happens, not one sound comes from inside the flat, nothing that could make Jimin think that someone is actually gonna open the door. Oh shit, what if no one is home? Did he seriously make all this trip for nothing? 'Cause that would be particularly embarassing.</p>\n<p>Then there's a rustling coming from the flat, Jimin stiffens, a lock clicks and the door opens.</p>\n<p>Yoongi looks- like he just stepped out of bed. His hair is a mess, eyes half closed and Jimin swears that there are pillow marks against his left cheek.</p>\n<p>“Jimin?” Yoongi frowns “What- what are you doing here?”</p>\n<p>“I-” Jimin swallows “You forgot your wallet.”</p>\n<p>Yoongi blinks a few times, he rubs at his nose with the palm of his hand, sniffling hard, clearly still not completely awoken “My wallet?”</p>\n<p>“You left it at the brothel, yesterday night.” Jimin pauses “But I woke you up, didn't I? I'm sorry, it's still early, I didn't think about it and- whatever, just. Here.” Jimin gets Yoongi's wallet out of the pocket of his jacket and basically shoves it against his chest “I just wanted to bring you this, I'll go now, sorry for waking you up.”</p>\n<p>“Want some coffee?”</p>\n<p>Jimin stops rambling and looks at Yoongi. He seems a bit more reactive now, eyes fully opened “Coffee?”</p>\n<p>“I've just woken up and you worked all night. So yeah, coffee.” Yoongi shrugs “Besides, I have to thank you for coming to me to give me the wallet back.”</p>\n<p>Jimin's mind is screaming “Do NOT go inside, are you fucking insane?” but his heart is also yelling at him to “Wake the fuck up and get inside his flat right now.”</p>\n<p>“I mean, I don't wanna disturb you.” Jimin tries, but Yoongi just shakes his head and steps aside.</p>\n<p>“Come in, I'll fix you up a cup of coffee.”</p>\n<p>Jimin's legs move before he can even try to decline and he curses his body just doing whatever it wants without listening to reasoning.</p>\n<p>“Sorry for the mess.” Yoongi mumbles, scratching at his shoulder.</p>\n<p>He's wearing a plain white shirt and shorts, bare feet padding softly on the floor as he moves from the entrance to the living room, Jimin takes off his shoes and follows him quietly.</p>\n<p>“I'm really sorry for waking you up.” Jimin says once they're in the living room.</p>\n<p>“I was gonna wake up sooner or later either way, it's fine.” Yoongi gives him a small smile “How do you like your coffee.”</p>\n<p>“If you have some milk it would be nice.”</p>\n<p>“Okay, I'll be back, you just-” Yoongi moves his hand around “Just do as if it was your place.”</p>\n<p>Jimin nods and Yoongi walks out of the living room, going for what Jimin presumes is the kitchen. Jimin looks around, curious as to what kind of place a vampire like Yoongi could live in. The flat it's actually bigger than what Jimin thought, the living room spacious and with large windows, although there are curtains to prevent direct sunlight to creep in. There's a soft looking couch at the back, an armchair next to it and a television in front of it. Jimin goes to sit there and hums once his feet touch the carpet. It's incredibly soft and thick, of a creamy color and with an intricate black pattern in the middle that Jimin can't quite understand. Jimin sits down on the couch, he sees a door leading to a corridor where there must be probably a bedroom or a bathroom, another door (the one from where Yoongi left) that he guesses takes to the kitchen.</p>\n<p>It's a nice place, Jimin is surprised to notice that his own flat is actually bigger than Yoongi's. And it's quiet here, the building located in one of the less populated parts of Songpa, the noises of traffic don't reach the flat.</p>\n<p>Yoongi appears from the hallway, holding two mugs in his hands, walking carefully but with his eyes close. Which is... kinda cute.</p>\n<p>Yoongi, though, seems to know his apartment well as he walks straight to the couch and holds out a mug for Jimin, who takes it with a thank you. Yoongi goes to sit on the free armchair, pulling up his feet and crossing his legs, fitting perfectly in the chair, sipping on his coffee with his eyes still close. And that's fucking adorable, don't cross Jimin on that, this, <em>him</em>, is adorable.</p>\n<p>And now, without cold blue neons digging in their faces, Jimin can see that Yoongi's face is actually softer than he thought. He has pink lips and a button nose, for crying out loud, cheekbones high and a round face and holy shit, Yoongi is<em> pretty</em>.</p>\n<p>Jimin decides to start chugging down his coffee, trying to ignore the sight of Yoongi's legs, skin so pale and smooth it looks unreal.</p>\n<p>Slowly, Yoongi's coffee seems to do it's job, and the vampire actually opens his eyes “You didn't have to come all the way here to bring me the wallet, you know?”</p>\n<p>Jimin nods “Yeah, well, I had a free morning and wanted to take a walk.”</p>\n<p>Yoongi hums “I see. Well, thank you.”</p>\n<p>Jimin looks at the pictures that are framed and put on the empty library shelves, the others filled with books that look quite old “Can I ask you something?”</p>\n<p>“Sure.”</p>\n<p>“How old are you?” Jimin looks back at Yoongi “'Cause your flat doesn't seem to be, you know-”</p>\n<p>“An obnoxiously huge penthouse in the middle of Gangnam?” Yoongi grins “Yeah, I don't like big houses. They make me uncomfortable. I have all I need here, after all. To answer your questions, I turn 200 years old in nine days.”</p>\n<p>Jimin's grip on the mug goes slack for a second, but he manages to not spill any coffee on the carpet.</p>\n<p>“Shit, you're old.”</p>\n<p>Yoongi arches an eyebrow, a gling of amusement in his eyes “Thanks.”</p>\n<p>“No, sorry, I didn't mean it like- forget it.” Jimin knows that there aren't neon lights here to hide his blush, so he keeps drinking the coffee “I wasn't expecting you to actually be that old, that's all.”</p>\n<p>Yoongi gives him this crooked smile that has Jimin's stomach roll around in a knot “I'm that old, yeah. I act like an old man, too. I barely leave the house.”</p>\n<p>“Yeah?” Jimin sits a bit more comfortably, feeling some of the tension wear off “Why?”</p>\n<p>“I work at home, mostly. Told you, I really have all I need here.”</p>\n<p>“You did mention you took a trip 'cause of your job. What do you do?”</p>\n<p>“I sell songs.” Yoongi replies “To big companies.”</p>\n<p>“You're a producer.”</p>\n<p>“I guess.”</p>\n<p>“Something I know?”</p>\n<p>“Probably.”</p>\n<p>Jimin hums “So you're filthy rich.”</p>\n<p>Yoongi chuckles at that, looking at his cup “I guess I am.” Yoongi looks back at him “I hope you get paid a lot for your job.”</p>\n<p>“I do, actually. I didn't at first, but now I do. I mean, I'm up on the balcony.”</p>\n<p>“What, you have ranks?”</p>\n<p>Jimin nods “The five most requested are on the balcony. Tae is third, I'm second. The first most requested is Lisa, but she works when I don't. She's lovely.”</p>\n<p>Yoongi presses his tongue against his cheek “Good to know that you make good money at least.”</p>\n<p>Jimin frowns at the harsh bite of Yoongi's voice, the vampire looking at the wall with a hard gaze, thumb flicking on the handle of the mug.</p>\n<p>“You really don't like me working there, do you?” Jimin asks quietly.</p>\n<p>“I don't.” Yoongi says, without missing a beat “You deserve better than having assholes sucking your blood.”</p>\n<p>“It ain't that bad.”</p>\n<p>“Right.” Yoongi scoffs.</p>\n<p>“There are nice customers.” Jimin pauses “Great customers, too.”</p>\n<p>“Uh huh.” Yoongi brings the cup to his lips “Name one.”</p>\n<p>“You.”</p>\n<p>Yoongi chokes on his gulp of coffee, coughing hard and pounding his fist against his chest, trying to breathe normally again. Jimin just smirks to himself and keeps drinking.</p>\n<p>“You almost fucking killed me.” Yoongi grumbles after a few moments.</p>\n<p>“Didn't know it took that little to kill a vampire.”</p>\n<p>Yoongi rolls his eyes “Hilarious.”</p>\n<p>Jimin giggles at Yoongi's expression. He's clearly trying to hide how embarassed he is, lips pouted and eyes casted down “Back on the topic at hand, I mean it when I say it's not that bad. Sure, we get bad customers, but most of them are nice.”</p>\n<p>“That's not the point. It's dangerous.”</p>\n<p>“Well, yeah, but mostly nothing bad happens.”</p>\n<p>“See, Jimin.” Yoongi sighs “It's the <em>mostly nothing</em> that gets me. 'Cause shitty things must have happened, right?”</p>\n<p>Jimin shrugs “Yeah, of course.”</p>\n<p>“Tell me.” Yoongi straightens his shoulders “Tell me the worst thing that happened there.”</p>\n<p>“To me?”</p>\n<p>“Sure.”</p>\n<p>“I mean, what do you think happened? A vampire tried to suck me dry, he was stopped, that's it.” Jimin worries his bottom lip “The fact that you worry so much is actually weirder than the risk of having too much blood sucked out.”</p>\n<p>“Of course I worry.” Yoongi says without a care “Vampires worry easily.”</p>\n<p>“You have no reason to.”</p>\n<p>“I have loads, thank you very much.” Yoongi heaves a sigh and gives Jimin this long gaze “I worry a lot. Vampires are overprotective by nature, but with you it's a mess.”</p>\n<p>Jimin feels his lips stretching in a smile, Yoongi's eyes darting down to his mouth “There you go again, being brutally honest.”</p>\n<p>“Do you want me to be even more honest?”</p>\n<p>“Maybe.”</p>\n<p>“I really wanna take you out for dinner.”</p>\n<p>Well, shit.</p>\n<p>Yoongi frowns “I have to say, you blush <em>a lot</em>.”</p>\n<p>“Oh my God, shut up.” Jimin retorts weakly, patting his heated cheeks “Shit, are you- like, on a date?”</p>\n<p>Yoongi nods.</p>\n<p>“You're asking me out.”</p>\n<p>“Yeah.”</p>\n<p>“Oh.” Jimin clears his throat “Okay.”</p>\n<p>“Okay?”</p>\n<p>“Yeah, okay.” Jimin clears his throat “I'll order so much food with garlic, you won't even believe it.”</p>\n<p>Yoongi laughs at that, eyes squinting and crinkling at the side, smiling wide “You're an asshole, you know?”</p>\n<p>“That's no way to talk to your date.”</p>\n<p>“You're an asshole, <em>doll.</em>”</p>\n<p>Jimin smiles “That's better. I like when you call me doll.”</p>\n<p>Yoongi presses his lips together, almost as if he's trying to hide a grin “Yeah?”</p>\n<p>“Yeah.” Jimin clicks his tongue “Well, start thinking of where we should go to this date, I have to leave now.”</p>\n<p>“Why should I think of it and not you?”</p>\n<p>“You're the one who's old and wise, I'm sure you know more places than I do.” Jimin stands up from the couch “Thanks for the coffee. You know where to find me, I guess.”</p>\n<p>“Yeah.” Yoongi gets off the armchair as well, gesturing for Jimin to follow him so that he can walk him out “I'll actually stop by the brothel this friday.”</p>\n<p>“You have seven whole days to think of a date, take advantage of them.”</p>\n<p>“I'll try my best not to disappoint you.” Yoongi says, voice flat, Jimin chuckles.</p>\n<p>“You sound so annoying when you make that voice.”</p>\n<p>“It's my voice.”</p>\n<p>“It's your annoying old vampire voice.” Jimin says, Yoongi opens the door for him “But it's funny.”</p>\n<p>“I'll keep using it, then.” the vampire says, a glint of mirth in his eyes “I'll see you soon.”</p>\n<p>“Yeah.” Jimin exits the house, turning around and giving yoongi a small wave with his hand “You'll see me soon.”</p>\n<p>“What you said about booking you for more time, did you mean it?”</p>\n<p>Jimin's smile falls, he feels something shifting in his chest “I did.”</p>\n<p>Yoongi nods “Okay. I'll see you soon, doll.”</p>\n<p>Jimin makes it to leave but stops, turning around once more “Yoongi.”</p>\n<p>“Mmh?”</p>\n<p>“Did you leave the wallet on purpose?”</p>\n<p>Yoongi looks at him for a few moments, then his lips curl up in a smirk “Who knows?”</p>\n<p><br>\n </p>\n<p> </p>\n<p>It's evening, close to nine, and Jimin is curled up on his couch, tv playing dimly in front of him even though he's not paying attention, drowning in too many blankets. He should probably try and eat something, but he's been far too busy freaking out about what happened this morning to really focus on food.</p>\n<p>It took Jimin's brain a few hours to fully understand what exactly had happened earlier. First of all, Yoongi looks adorable and cute when he's sleepy and that is really not helping his case. Secondly, Yoongi asked him out. For dinner. On a date. An actual date.</p>\n<p>Jimin groans as he feels his face heat up, he hides under the blankets more, trying to tune out the noises from the tv. The thing is, Jimin agreed. It's not like he's regretting it, not at all, he's just fucking terrified. Yoongi is still a client, despite all of this, and dating a client is- well, it's not forbidden, but it is highly advised against. Jimin had clients asking him out before, every single person working there had been, Jimin rejected every one of them simply 'cause he wasn't interested. Besides, Jin told him once that many vampires feel a certain bond forming after a few times of sucking blood from the same person and, more than once, they confuse it for attraction. That's what it's messing with Jimin's head right now.</p>\n<p>If Yoongi is in this only because of his blood then Jimin doesn't want this anymore. He's not an idiot, nor naive, he knows relationships between vampires and humans are difficult. And Jimin, well- he's lonely. He's missing affection, he's missing love, all of this got even worst when he started working at the brothel. In the afterglow, vampires speak a lot, mouth loose and brain dizzy, they say nice things, they become touchy, Jimin realized just then how much he's missed this kind of affection. But if Yoongi gets tired of drinking from him would he really still feel attracted to him?</p>\n<p>His phone starts buzzing in the pocket of Jimin's sweats, who sighs and gets out of the blankets, he grabs the phone and frowns once he sees that the one who is calling him is Seokjin.</p>\n<p>“Hey, hyung.” Jimin says as soon as he accepts the call “Everything allright?”</p>\n<p>“Yeah, Minnie, it's all good.” Jin says, the music of the club playing muffled from the phone “Have you had dinner yet?”</p>\n<p>“I'm not so hungry, hyung.”</p>\n<p>“You should eat, Jimin-ah! Do you want me to come over and cook something for you?”</p>\n<p>Jimin chuckles and shakes his head “No, hyung, it's okay. I'll eat something, don't worry. Why did you call me, though?”</p>\n<p>“Ah, yes.” Jin heaves a sigh “I know that you usually don't- well, you're not okay with this kind of requests but you've been booked.”</p>\n<p>Jimin frowns “I'm- hyung, I'm not working tonight, what-”</p>\n<p>“No, it's not for tonight. It's for this friday.”</p>\n<p>“I've been booked five days in advance?”</p>\n<p>“You've been requested for one of the premium sessions.”</p>\n<p>Jimin groans, throwing his head back “No.”</p>\n<p>“Jimin-ah...”</p>\n<p>“I'm not doing it, hyung.”</p>\n<p>“Yoongi requested it.”</p>\n<p>Jimin's eyes snap open “Wait, what?”</p>\n<p>“One hour.” Jin clears his throat “This friday.”</p>\n<p>Jimin stays quiet. He feels the beating of his own heart echoing in his head, tension making him so stiff his muscles hurt. Fuck, he did ask Yoongi to book him for more than thirty seconds, but this is-</p>\n<p>“Okay.” Jimin whispers “I accept it.”</p>\n<p>Jin pauses “Are you sure?”</p>\n<p>“Yes.” Jimin swallows “Yeah, I'm sure.”</p>\n<p>On the other side of the phone it's quiet for a few seconds, Jimin can only hear the basses of the song that is currently playing, the buzzing of chatter of the patrons.</p>\n<p>“Okay, then.” Jin finally says “I'll accept the request and the money will be transferred to your account by the morning, as usual.”</p>\n<p>“Yes, thank you.”</p>\n<p>“Jimin-ah, rest a lot these days, okay? Eat a lot, sleep as much as you can.”</p>\n<p>“I know, hyung.”</p>\n<p>“Okay.” Jin sighs “Okay, Minnie. Take care, I'll see you friday.”</p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p>Jimin accepted two premium sessions before. The first one had to be interrupted after twentyfive minutes as the vampire was already too drunk and trying to get his hands on Jimin for a different kind of services that they do not, in fact, provide. The second one was with Hyuna and Jimin managed to perform it all. Hyuna was a friend and she had been careful with him, her experience on her side to help her not to lose her mind too quickly. But even with her, it was far too intense. From that day, Jimin had been quite clear about the premium sessions, he just wasn't up to them. Taehyung didn't have much problems with them, he didn't enjoy them, but he did accept them if he was in the mood.</p>\n<p>But with Yoongi- shit, Yoongi must know. Jimin had gotten hard from just a half minute session with him, and even the others were so incredibly pleasurable that Jimin can still almost feel them in his body. So Yoongi must know that this time, now that he's asked for the premium session, he must know what that means. And because of this, Jimin feels a thrill rushing in his veins, something throbbing inside. Jimin recognizes it as want.</p>\n<p><br>\n </p>\n<p>“You okay?” Taehyung asks him, his drink held loosely in his hand “You know you're still in time to cancel the session, right? Jin-hyung won't mind.”</p>\n<p>“I don't want to cancel it.” Jimin replies, already drinking his second Martini. He's nervous, sue him.</p>\n<p>Taehyung hums, then he smirks “You dressed up.”</p>\n<p>Jimin scoffs “I always dress up for work.”</p>\n<p>“You dressed up more than usual.” Taehyung points at his shirt “That's the Gucci one.”</p>\n<p>Jimin shrugs.</p>\n<p>“And you put perfume.”</p>\n<p>“I always put-”</p>\n<p>“You're wearing Chanel, you trick ass bitch, don't cross me.” Taehyung arches an eyebrow “Admit it, you're gonna try and seduce him.”</p>\n<p>Jimin doesn't say anything, so he just sips on his drink.</p>\n<p>“Oh.” Taehyung bites his lip “You have a plan.”</p>\n<p>“Maybe.”</p>\n<p>Scratch the maybe, he sure as hell has a plan. He's just not sure if the outcome will be what he wishes for, so he'd rather keep quiet about it.</p>\n<p>“I have news, you know?”</p>\n<p>“Yeah?” Jimin looks at his friend “Spill this tea.”</p>\n<p>“I got asked out.”</p>\n<p>“This tea tastes <em>delicious</em>.”</p>\n<p>“By Jungkook.”</p>\n<p>Jimin blinks “Are you shitting me?”</p>\n<p>Taehyung shakes his head with a smug grin “I speak the truth, my homie. He called me yesterday and it took him a whole hour to ask me if I wanted to take a coffee with him. He was so nervous, he talked about the weather for like ten minutes whilst I was just there on my couch watching <em>Goblin</em> and humming along.”</p>\n<p>“You're an asshole.”</p>\n<p>“Either way, we're going this weekend.” Taehyung sighs dreamily “I can't wait. I'll wear jeans so ripped I'll give him a heart attack.”</p>\n<p>“You're such a fucking bastard.”</p>\n<p>Taehyung shrugs, looking down at the first floor “Oh, Edward Cullen is here.”</p>\n<p>Jimin frowns and follows Taehyung's gaze. Yoongi is here, talking with Jin at the counter, he nods to something the elder vampire tells him then he goes straight for the suites, without looking up at the balcony. Jimin swallows, then his tablet buzzes.</p>\n<p>“Time to go.” Taehyung grins at him “Fuck him up, sweetheart.”</p>\n<p>Jimin rolls his eyes and gets up from the armchair, quickly making his way down to the bottom level. He looks for Namjoon and finds him sitting at the counter, looking at one of the tablets that monitor the cameras of the suites.</p>\n<p>“Hyung.”</p>\n<p>Namjoon turns to him “Hey, kid. Everything okay?”</p>\n<p>“I have a favor to ask.”</p>\n<p>Namjoon nods “Okay, what is it?”</p>\n<p>“You have to turn off the cameras in my booth.”</p>\n<p>Namjoon tilts his chin up, looking at Jimin with doubts “I can't do that, Jimin-ah.”</p>\n<p>Jimin takes a deep breath, he ignores the flush that creeps to his cheeks “No, you don't get it. I really don't want you to see what is gonna happen in the booth.”</p>\n<p>Namjoon frowns but, before he can say anything, Jimin speaks “Yoongi booked me for an hour.”</p>\n<p>Namjoon shuts his mouth close, eyes wide and lingering on Jimin “You mean-”</p>\n<p>“Please, just turn them off, don't make me say anything.”</p>\n<p>“Jesus, okay, okay. Damn it, if Jin finds out he'll kill me.” Namjoon grumbles as he turns back to the tablet and starts pressing random icons of a side column. Jimin sees that in the square where his suite is usually displayed, now it's plain black “There, it's off.”</p>\n<p>“Thank you, hyung.” Jimin murmurs, Namjoon just waves him off and turns his back to him.</p>\n<p>Jimin walks to the door that leads to the suites, Yugyeom opens it for him as usual, gives him a wink, then Jimin is alone in the corridor.</p>\n<p>He takes a few steadying breaths. He can do this.</p>\n<p>He opens the door to his suite, shuts it close behind him and finds Yoongi already sitting on the couch, staring at him.</p>\n<p>“Hey.”</p>\n<p>“Before we do anything.” Jimin swallows “I don't accept premium sessions.”</p>\n<p>Yoongi doesn't react for a few seconds before he nods “And?”</p>\n<p>“I accepted yours.”</p>\n<p>“I know.”</p>\n<p>“Okay. The second thing.” Jimin pauses “I asked Namjoon to turn off the cameras.”</p>\n<p>The distance between them isn't much, just a few steps divide the door from the couch. Jimin can't see Yoongi's fingers twitch for a moment against his knee, eyes piercing on him.</p>\n<p>“So-” Yoongi gets up and starts walking to him, Jimin follows his movements “He can't see us.”</p>\n<p>Jimin waits for Yoongi to be in front of him “He can't.”</p>\n<p>Yoongi nods “Good.”</p>\n<p>Jimin has time to take a breath before Yoongi's lips are on his. Jimin finds himself closing his eyes and tugging at Yoongi's shirt to get him closer, Yoongi complying and pressing his body between him and the door. Yoongi kisses the way he talks: lazily, slowly, making sure that Jimin really feels what he's telling him, what he means. Jimin opens his mouth, Yoongi tilts his head to deepen the kiss as his hands go to his hair, fingers carding and tugging lightly at the locks. Jimin's hands skim across Yoongi's chest, stopping at his shoulders and shit, Jimin always liked broad shoulders.</p>\n<p>Yoongi's hands squeeze Jimin's hips and he starts walking backwards, guiding Jimin along who tries his best not to break the kiss because, seriously, no one in their right mind would stop a kiss like this.</p>\n<p>Yoongi's calves meet the couch and the vampire falls backwards, carrying Jimin down with him and their foreheads bump hard together. Jimin pulls back hissing, palming at his forehead.</p>\n<p>“Shit, sorry.” Yoongi groans “You okay?”</p>\n<p>“I'm good!” Jimin exclaims, snapping out of it and quickly putting his legs on either side of Yoongi's waist, straddling him “I'm great, don't worry, let's continue.”</p>\n<p>Jimin sees that Yoongi wants to retort and, well, he's not having it, so he shuts him up by kissing him again, Yoongi hums and lets Jimin dart his tongue inside, hands stroking at his thighs. To say that this is better than what Jimin even hoped for is an euphemism. Yoongi kisses him like he can't get enough, his hands skim along his body almost as if he's never touched someone like him, it's enough to make Jimin's head spin. And Jimin wants more, knows there will be more and he's growing impatient by the second, his fingers almost twitching where they grab the fabric of Yoongi's shirt.</p>\n<p>“Yoongi.” Jimin gasps and Yoongi almost seems to chase his lips, but stops to look at him.</p>\n<p>“Yeah?”</p>\n<p>Jimin worries his bottom lip, a spark of thrill when he notices Yoongi's eyes following the action “I want to ask you something but it's embarassing.”</p>\n<p>Yoongi scoffs “More embarassing than knocking your forehead 'cause I thought I could try and be real smooth and get us to a couch?”</p>\n<p>Jimin snorts “Okay, not that embarassing.”</p>\n<p>“Just tell me what you want, doll.” Yoongi says, squeezing his thighs “I'll give it to you.”</p>\n<p>Jimin swallows before he finds the courage to start undoing the first buttons of his shirt. Yoongi's eyes fall to his collarbones, tongue darting out quickly to lick as his lips, Jimin counts it as a win. He lets the shirt fall a bit down his shoulders, the he tilts his head to the side.</p>\n<p>“Please?”</p>\n<p>“You really don't need to beg for this.” Yoongi says, his fingers caressing Jimin's neck.</p>\n<p>“No, I'm begging you to not get this shirt dirty, 'cause it's expensive.”</p>\n<p>Yoongi scoffs “As if I'd get it dirty, who do you think I am? A newborn? I've been doing this shit for 200 years, your shirt will be pristine.”</p>\n<p>Jimin grins at him “I hope it will. You stain it, you buy me a new one.”</p>\n<p>Yoongi rolls his eyes “You used to blush at anything now look at you, already asking for gifts.”</p>\n<p>“I'm a quick learner.”</p>\n<p>Yoongi chuckles but he leans down on his neck, he starts leaving a trail of kisses from his jaw down to the column of his throat, then along his collarbones and up to his shoulder, Jimin closes his eyes, expectation building up.</p>\n<p>“If it gets too much tell me, I'll stop. If I don't stop fucking shove me away, yeah?”</p>\n<p>“Yeah, okay.”</p>\n<p>“Shouldn't you start the watch or-”</p>\n<p>“Yoongi, fuck the watch.”</p>\n<p>He feels Yoongi snorting against his neck and Jimin bites off a smile.</p>\n<p>Yoongi leaves one last kiss on his skin, on the side of his neck, then he bites. Jimin's eyes fall close as he feels the fangs breaching the skin, this time a bit harder than the others, as if Yoongi isn't holding back anymore. Yoongi wraps his arms around Jimin's waist and he starts sucking and, finally, Jimin feels it again. The heat starts pooling in the spot where Yoongi bit him but it spreads quickly under his skin. Jimin doesn't try to fight it, instead he sighs at the feeling, his hands roaming on Yoongi's back to let him know that he can keep going, he can do so much more.</p>\n<p>Yoongi laps at the wound then, suddenly, he bites again and Jimin gasps, choking on a moan that he somehow manages to stifle, a new wave of heat setting his skin on fire.</p>\n<p>“Shit.” Jimin hisses, he feels his body relaxing, legs parting even more, putting his whole weight on Yoongi's lap.</p>\n<p>Yoongi pricks at the new wound, drawing blood and then pressing his tongue flat against it, Jimin keeps a moan to himself but he feels his dick twitching in his pants, slowly hardening, his body growing hotter by the second.</p>\n<p>“You're being quiet.” Yoongi says, still leaning on his neck “I remember you were more vocal the first time.”</p>\n<p>“I'm trying not to be.”</p>\n<p>“Stop trying.” Yoongi licks around the wound, Jimin shudders “I wanna hear you.”</p>\n<p>Jimin spends barely one second cursing Yoongi and his stupidly deep voice before the vampire has his fangs in Jimin's neck again.</p>\n<p>Jimin lets out a choked moan, his hips faltering, Yoongi hums against his skin and squeezes his hip. Jimin feels the heat moving under his skin from his neck, cursing through his whole body, buzzing and sending sparkles of pleasure up his spine. Jimin knows that Yoongi is probably getting off on this, on having this kind of power against him. That shouldn't be such a turn on for him but, big surprise, it is. But Jimin is also enough of a competitive asshole to not just sit there and enjoy it all, giving the victory to Yoongi. The moment he feels Yoongi's tongue lapping at the blood on his neck, Jimin shifts his hips againt Yoongi, dragging his crotch againt the vampire's. Yoongi gasps, his fingers digging in the flesh of Jimin's hips.</p>\n<p>“Shit, doll, you're so fucking hard.” Yoongi groans once Jimin presses his hips down again “You really like it?”</p>\n<p>“So much.” Jimin breathes out, grinding down in a more firm pace “I like it so much, Yoongi.”</p>\n<p>Yoongi's hips move up to meet Jimin as he presses down, eliciting another moan from Jimin.</p>\n<p>“You sound so fucking good.” Yoongi starts leaving a trail of open mouthed kisses along Jimin's jaw, his hands moving on the small of his back “I'd record you and put those sounds in a song.”</p>\n<p>Jimin manages a weak laugh “Not sure how well that would sell.”</p>\n<p>“I'd buy it.”</p>\n<p>“You can have it for free.”</p>\n<p>Yoongi chuckles and pulls back from his neck, Jimin takes notice of how dark Yoongi's eyes are right now, lips stained with blood. Before Jimin can stop himself he leans down and kisses him, Yoongi immediately kissing back, hard and fast, letting Jimin taste his own blood. Which, Jimin knows, is fucked up but honestly, at this point he's so far gone he couldn't care less.</p>\n<p>Yoongi pushes Jimin's hips down, so that he starts grinding on him again, Jimin gasps when he feels that Yoongi is hard as well, pressing his erection against his.</p>\n<p>“Again.” Jimin whispers as he breaks the kiss and bares his throat “Bite me again.”</p>\n<p>Yoongi's eyes fall down to his neck, he swallows hard, jaw clenching and, finally, he leans down again. The third time Yoongi's fangs breach his skin, Jimin swears he sees white behind his eyelids. This time, the wave of heat is hard and fast, spreading under his skin in one second, racking his body. Jimin whimpers, his hips moving again against Yoongi, the vampire sucking at his skin hungrily, lapping away the blood.</p>\n<p>Jimin feels his dick throb in his underwear, Yoongi's hands moving down to his ass and kneading at the flesh, parting his cheeks and Jimin curses himself for still wearing pants but by now it's too late to do much about it.</p>\n<p>“I'm gonna cum.” Jimin moans, closing his eyes and letting the heat consume him more “Yoongi, I'm gonna-”</p>\n<p>“Fuck.” Yoongi groans, biting around the wound without breaking the skin “Cum, doll, wanna hear you.”</p>\n<p>Jimin fists the fabric of Yoongi's shirt, keeps grinding on his lap and, when he feels Yoongi biting in the same wound as before, a shock of pleasure numbing him completely, Jimin cums, his body shuddering against Yoongi. It's- shit, it's better than anything he's ever experienced before. It's different, it's more intense, longer, and it keeps shoking his body in small waves of pleasure, slowly fading away, knocking the air out of his lungs.</p>\n<p>“Oh my God.” Jimin moans weakly, feeling his lips stretch in a smile “Holy shit, that was so good.”</p>\n<p>Yoongi snorts, nosing at his hair “Yeah?”</p>\n<p>“Yeah. I-” Jimin chuckles as he goes limp on Yoongi's lap, the vampire grabbing him by the shoulders and keeping him up.</p>\n<p>“Woah, are you fainting on me?”</p>\n<p>“No. No, I'm good, just-” Jimin giggles breathlessly “Holy shit, I wasn't expecting that. My legs are numb.”</p>\n<p>Yoongi hums “Wanna lay down for a moment?”</p>\n<p> </p>\n<p>“Fuck that.” Jimin manages to push himself a bit straighter and he opens his eyes “I'm comfortable here.”</p>\n<p>He sees that Yoongi is smiling as well, his chest rising and falling quicker than usual, eyes wide and dark. Jimin feels his heart beating faster and he lets out another fit of laugh.</p>\n<p>“What's so funny, mh?”</p>\n<p>“Just-” Jimin licks his lips and wipes some blood off Yoongi's bottom lip with his thumb “Nothing, you're just- really attractive.”</p>\n<p>Yoongi scoffs and shakes his head “I ain't the one looking like a fucking vision after getting his blood sucked.”</p>\n<p>“Oh, now you're just saying it.”</p>\n<p>“No, I'm really serious about this.” Yoongi lays back more comfortably, his head resting on one of the pillows, a hand going up to Jimin's hip and stroking it carefully “I'm so serious about how hot you look.”</p>\n<p>“Didn't know I was dating a poet.” Jimin says and Yoongi cocks his head to the side.</p>\n<p>“Didn't know we were dating.”</p>\n<p>“You're right, we aren't. You jumped straight to my neck before that dinner you promised me.”</p>\n<p>“You're the one who said to book you for more time.” Yoongi sighs “And for that dinner, I was thinking-”</p>\n<p>“Mmh?”</p>\n<p>“You free on monday?”</p>\n<p>“Isn't that your birthday?”</p>\n<p>“It is.”</p>\n<p>“And you wanna spend your birthday with me?”</p>\n<p>Yoongi shrugs “Sure, of course.” he frowns “You look surprised.”</p>\n<p>“No, I'm-” Jimin shakes his head “I don't know. I'm happy? I seriously don't know, I'm having the longest afterglow of the history of post orgasms.”</p>\n<p>Yoongi laughs at this, an actual laughter, voice cracking and eyes squinting together, cheekbones high and gums showing.</p>\n<p>“Fuck, you're cute.” Jimin giggles and Yoongi stops laughing immediately.</p>\n<p>“Cute.”</p>\n<p>“Really cute.”</p>\n<p>“I ain't cute.”</p>\n<p>“No, you kind of are.” Jimin looks down at his hand and sees that his thumb is still stained with the blood he wiped off Yoongi's mouth. Without really thinking about it, he brings it to his lips and sucks on it, the taste of copper spreading on his tongue. He looks back at Yoongi and finds him staring, eyes piercing and lips parted.</p>\n<p>“You-” Yoongi takes a deep breath “You have no fucking idea of what you're doing to me.”</p>\n<p>Jimin feels a wave of adrenaline in his veins “Yoongi.”</p>\n<p>“Mh?”</p>\n<p>“Is there anywhere else you'd like to bite me?”</p>\n<p>Yoongi doesn't say anything for a while “You're seriously testing me.”</p>\n<p>“I mean it.” Jimin smirks “Anywhere? You like to bite me on my wrist too, but is there somewhere else?”</p>\n<p>Slowly, Yoongi nods.</p>\n<p>“Where?”</p>\n<p>“I already drank a lot from you.”</p>\n<p>“I'm fine. Besides-” Jimin presses his hips down, Yoongi hissing a breath beneath him “You're still hard. Just tell me where.”</p>\n<p>Yoongi worries at his bottom lip, eyes flicking from Jimin's eyes to his lap until he heaves a sigh “Thighs.”</p>\n<p>Jimin blinks “My-”</p>\n<p>“Your thighs.”</p>\n<p>Jimin asks himself if he saved a country in his previous life, because what is this sudden blessing of a vampire?</p>\n<p>“Fuck, please do it.” Jimin twists his body so that he can take off his shoes, throwing them in a corner of the suite.</p>\n<p>“Wait, are you serious?”</p>\n<p>“So serious, I think I'm hard again.” Jimin is already undoing the first button of his jeans, hands shaking “Honestly, I'm not even questioning my kinks anymore, I'm nasty.”</p>\n<p>“I like that.” Yoongi says before he grips Jimin's hips and flips him on his back against the couch so that he lays down “I'm not gonna lie, I'm tipsy as fuck.”</p>\n<p>“Drunk?”</p>\n<p>“Not drunk, but close.”</p>\n<p>“Hey, my safeword is <em>manggaetteok</em>.”</p>\n<p>Yoongi pauses “Wait, forreal?”</p>\n<p>“What are the chances of hearing that word during sex?”</p>\n<p>“That's a fair argument.” Yoongi unzips Jimin's jeans and pulls them down, Jimin lifts his hips so that Yoongi can take them off him “Shit, I seriously love your legs.”</p>\n<p>Jimin smirks, satisfied “Thanks. Wait, are you folding them?”</p>\n<p>Yoongi scoffs as he folds his pants neatly and puts them behind him “They look expensive, I'm taking care of your clothes. You're welcome.”</p>\n<p>“Such boyfriend material, I'm impressed.”</p>\n<p>“You know-” Yoongi presses his hands on the back of Jimin's thighs “You talk a lot.”</p>\n<p>“You're the one who wanted me to be vocal.”</p>\n<p>“Vocal doesn't mean being a brat.”</p>\n<p>Jimin shrugs, grinning at Yoongi “I am a brat.”</p>\n<p>Yoongi rolls his eyes but Jimin can see he's trying very hard to hide a smile “Yeah, I noticed.”</p>\n<p>Before Jimin can say anything, Yoongi grabs his ankles and pulls him closer, Jimin's ass pressing against the bulge in Yoongi's pants. The vampire then lifts one of Jimin's legs on his shoulder, he leaves a kiss on Jimin's inner thigh.</p>\n<p>“Kick me in the face if you want me to stop.”</p>\n<p>Jimin nods at him, licking his lips as expectation starts bulding up in his system. He honestly doubts he's gonna get hard again, not after that orgasm, but the idea of having Yoongi biting at his thighs as him on edge. He spares a glance at the boyshorts he's wearing and sees them soiled, he keeps a sigh to himself.</p>\n<p>Yoongi drags his tongue under his teeth before he leans down and sinks his fangs in the soft flesh of Jimin's thigh.</p>\n<p>“Oh, <em>fuck</em>!” Jimin moans, voice louder than he'd meant and his back arching on the couch. Shit, this is- this is so good, maybe too good. This time it's even worst than before, heat bursting under his skin and traveling up to his dick too fast, Yoongi's fingers digging in his skin, but it's not just that. Jimin feels so fucking sensitive right now, he just came down from that orgasm and now Yoongi is just forcing it all back up.</p>\n<p>Jimin tries to keep his eyes open, focused on Yoongi as the vampire sucks on the wound, lips shiny with red. Blood looks way darker under blue neon lights and Jimin just realizes now. Yoongi has his eyes closed and brows knitted together, humming softly as he drinks. Then the vampire starts moving his hips, dragging his clothed erection against Jimin's ass and testicles. Jimin whimpers, the denim of Yoongi's jeans is slightly painful on his sensitive skin but Jimin doesn't mind it, actually liking the rough friction. God, he's fucking leaking in his underwear, he's not gonna last at all if this keeps going.</p>\n<p>Yoongi laps at the blood dripping along his inner thigh, moaning softly on his skin, Jimin bites his bottom lip to try and stifle the sound that threatens to spill.</p>\n<p>“You're so fucking pretty, doll.” Yoongi slurs, voice impossibly lower. Jimin chokes on his breath, unconsciously moving his hips in time with Yoongi's drags.</p>\n<p>“Again-” Jimin whines and he decides he'll be embarassed about it later “Yoongi, again.”</p>\n<p>Yoongi looks at him for a moment, mouth slack and eyes almost fluttering close before he turns to his thigh and licks a long strip where the blood has dripped down. Jimin holds his breath, waiting, he's so sure he can cum again if only Yoongi would bite him once more, maybe a bit harder, deeper-</p>\n<p>Yoongi opens his mouth wide on his thigh and bites, fangs working the skin open in a second, his hips grinding against Jimin's ass faster and that's all it takes for Jimin to grit his teeth and cum again. His hand try to grasp the leather of the couch as he falls apart, body spasming in what feels like way too much pleasure for him, blinding and almost painful.</p>\n<p>“<em>Yoongi</em>-”</p>\n<p>“Shit, you're fucking beautiful.” Yoongi groans as he keeps grinding his cock against Jimin “I didn't even fucking touch you, you're so-”</p>\n<p>“Fuck, I love this.” Jimin murmurs, still shuddering “I fucking love this.”</p>\n<p>Yoongi laps at the wound again, squeezing his thigh hard, then he stills and his body shakes as he cums too, moaning Jimin's name quetly, eyes scrunches close.</p>\n<p>Jimin tries to catch his breath as Yoongi slowly comes down from the high, putting Jimin's leg down and letting his arms fall along his side.</p>\n<p>“You okay?” Jimin asks, surprised he can even form a sentence.</p>\n<p>“I'm so drunk.”</p>\n<p>Jimin snorts “Yeah?”</p>\n<p>“You're gonna be the death of me.”</p>\n<p>“You're honestly too easy to kill.”</p>\n<p>Yoongi chuckles and he finally slumps back on the couch, wetting his lips “I am a really weak man right now.”</p>\n<p>Jimin hums. He'd be up for some cuddles right now, 'cause God knows he feels needy as hell, but at the same time his body isn't exactly working.</p>\n<p>“Tell me there's a bathroom close, 'cause I need to clean you up.” Yoongi says, he clears his throat.</p>\n<p>Jimin manages to raise an arm and he points at the door behind Yoongi “There.”</p>\n<p>Yoongi nods and squeezes his knee before he stands up, stumbling on his steps “Shit, I forgot how gross it feels to cum in your pants.”</p>\n<p>“Don't tell me, I came twice.”</p>\n<p>Yoongi opend the door and disappears in the bathroom for a few seconds, Jimin hears the water of the sink running, then Yoongi comes out with a damp towel in his hand. He sits down between Jimin's legs and starts cleaning the blood away, then he passes the towel to Jimin.</p>\n<p>“You think you can try to clean that up?” he asks, nodding at his underwear, Jimin rolls his eyes.</p>\n<p>“No.” he says, but he still dabs at his underwear “But, honestly, worth it.”</p>\n<p>“'s that so?” Yoongi chuckles “How much time do we have left?”</p>\n<p>Jimin twists his head to see his stop watch, put on the bedside table “Twenty-five minutes.”</p>\n<p>“Want me to leave you to rest?”</p>\n<p>“No, I want cuddles.”</p>\n<p>Yoongi arches an eyebrow “In this economy?”</p>\n<p>Jimin throws the towel at his face, Yoongi grinning to himself “Hey, if you really wanna date me then you'd better know that I require a lot of attention.”</p>\n<p>“Mmmh.” Yoongi tries to get in the space between Jimin and the couch, so Jimin scoots over to let him fit in.</p>\n<p>“Yeah, I need a lot of cuddles. Especially after sex.” Jimin grins once Yoongi has found a comfortable position and he raises an arm. Jimin quickly rolls on his side and snuggles against Yoongi, slotting their legs together and nosing at his neck “Like this.”</p>\n<p>Yoongi lets his hand rest on Jimin's hip, thumb stroking circkles on his exposed skin “It's gonna be a terrible sacrifice, but I'll try my best.”</p>\n<p>Jimin smiles “You know, it's hard to tell when you're being sarcastic or not.”</p>\n<p>“I have two hundred years of sarcasm behind me, I became a master.” Yoongi kisses his forehead “Once, I was at a restaurant for a business dinner, I was producing a track for this new singer. Anyways, a dude comes in and he's wearing lycra pants.”</p>\n<p>“Oh my God.”</p>\n<p>“Before I can stop myself I say-” Yoongi clears his throat and, when he speaks again, his voice is flat “<em>Wow, those are some nice pants</em>.”</p>\n<p>Jimin snorts.</p>\n<p>“The singer chuckles to himself, then he turns all serious and he looks at me and goes, <em>Wait, you're being sarcastic, right?</em>” Yoongi pauses “I look at him straight in the eyes, dead serious, and I say, <em>No, why would you say that?</em>”</p>\n<p>“You're such an asshole.” Jimin giggles.</p>\n<p>“He looked so confused, I actually felt bad.” Yoongi sniffles “I'm still drunk.”</p>\n<p>“You drank a lot.”</p>\n<p>“You okay, yeah?”</p>\n<p>“A bit dizzy, but it's okay.”</p>\n<p>Yoongi hums “Better eat those herrings.”</p>\n<p>Jimin snorts “Stop.”</p>\n<p>“Those herrings will be so tasty.”</p>\n<p>“Yoongi-”</p>\n<p>“I'm gonna buy you a whole fish tank of herrings, so that they're gonna be real fresh.”</p>\n<p>“Oh my God.” Jimin wheezes, slapping weakly at Yoongi's chest “Oh no, why is that so funny?”</p>\n<p>“I will-” Yoongi chuckles “I will plant a whole tree of oranges in your garden.”</p>\n<p>“I don't have a garden.”</p>\n<p>Yoongi pauses “Then I'll get you some of those chinese mandarin oranges. They grow on tiny trees, you can have that as a house plant. But they don't beat herrings, oh no.”</p>\n<p>“I'm gonna actually kick you in the balls.”</p>\n<p>“Like, first night you invite me at your place-”</p>\n<p>“Shut up.”</p>\n<p>“We finish doing our things and you don't even give me time to clean you up, you're already running to the fish tank with the herrings.”</p>\n<p>“I won't invite you over. Ever.”</p>\n<p>“But the herrings, Jimin.”</p>\n<p>“Next time we fuck, I swear to God, I'll call for herrings instead of your name.”</p>\n<p>Yoongi bursts laughing at that, the sound vibrating in Jimin's chest.</p>\n<p>“About that dinner-” Yoongi starts.</p>\n<p>“I'll text you my address.” Jimin pauses “You have a phone, right?”</p>\n<p>“No, doll, I decided to stick with the good old times.”</p>\n<p>“Mmmh.”</p>\n<p>“But don't worry, I'll get you your own pidgeon so that we can keep in touch.”</p>\n<p>“You get really chatty when you're drunk.”</p>\n<p>“I do, I'm gonna regret everything I said tomorrow.”</p>\n<p>“No, I like it. It's funny.” Jimin tilts his chin up to look at Yoongi, who's smiling at him with his mouth filthy with blood “Not for nothing, but you look like you just murdered someone with your bare teeth.”</p>\n<p>“Shit.” Yoongi starts rubbing at his mouth “Is it better?”</p>\n<p>“Yeah.”</p>\n<p>“Good.” Yoongi leand down and pecks Jimin's lips.</p>\n<p>“Oh my God.” Jimin giggles and hides his face behind his face “I love drunk you.”</p>\n<p>“What are you getting shy for, I had you begging me to bite your thighs.”</p>\n<p>Jimin groans “And now I hate drunk you.”</p>\n<p>Yoongi just pulls him closer and Jimin breathes in deeply. Yoongi smells good, of some expensive cologne he seems to recognize faintly, and his arms wraps easily around his waist. Jimin feels good. Fuck, he feels safe, and that's a first.</p>\n<p> </p>\n<p><br>\n </p>\n<p>Jimin opens his eyes and sighs. He must've fallen asleep during the afternoon, he sees the book he had been reading half open on his lap. Jimin sends a quick look at the clock on the wall and sees that he actually has to start getting ready for work, so he moves to get off the bed but stops when he notices the weight on his belly.</p>\n<p>Yoongi is sprawled all over the bed, his face pressed on Jimin's stomach, lips parted and chest rasing and falling slowly. Jimin smiles to himself and pushes some strands of black hair away from Yoongi's brow. The vampire scrunches his nose in his sleep but doesn't wake up.</p>\n<p>“Yoongi?” Jimin tries “Babe, wake up.”</p>\n<p>Yoongi just sighs deeply and wraps his arms around Jimin's waist, hiding his face in Jimin's shirt.</p>\n<p>“I know you're awake.”</p>\n<p>“'m not.” Yoongi slurs, voice thick with sleep.</p>\n<p>“You are. Come on, get off me, I have to go to work.”</p>\n<p>“Fuck that.” Yoongi retorts “Sleep with me a bit more.”</p>\n<p>“How did you even fall asleep, weren't you working in the studio?”</p>\n<p>Yoongi hums “Came to see if you wanted something to drink but you were napping. Thought I'd follow your example.” Yoongi breathes in “You're so soft.”</p>\n<p>“Shit, stop being so cute.” Jimin giggles “But seriously, I need to go.”</p>\n<p>“Nah. Stay with me. We can cuddle.”</p>\n<p>“Yoongi.”</p>\n<p>Yoongi grumbles something before he finally rolls off of him, blinking at him with sleepy eyes “I hate you.”</p>\n<p>“Not what you said last night.” Jimin gets off the bed and goes to Yoongi's closet, opening it and finding his spare clothes in the sports bag he brought from his place. He hears Yoongi moving on the bed, sheets rustling. Yoongi has a habit of rolling around on the mattress when he's still half asleep, stirring and making all kinds of cute noises that have Jimin cooing at him. Fuck his stupid boyfriend for being cute, Jimin has never heard of a vampire being this cute, it should be illegal.</p>\n<p>Jimin takes off his loose t-shirt and quickly puts on the black dress shirt, working the buttons fast. He strips of his ripped jeans and puts on the faux leather pants, tucking the shirt in. From the bed, Yoongi hums.</p>\n<p>“Like what you see?”</p>\n<p>“Very.” Yoongi replies with a sigh “How did I get so lucky, mh?”</p>\n<p>Jimin rolls his eyes “Compliments won't make me stay here, Yoongi.”</p>\n<p>Yoongi scoffs “Then why am I even bothering?”</p>\n<p>“Prick.”</p>\n<p>“Don't be mad at me, doll, my poor heart couldn't take it.” he says with that flat voice of his, Jimin grins to himself as he walks to the mirror and takes a look at his reflection.</p>\n<p>“My eyes are so fucking puffy, you should've woken me up.” Jimin grumbles, hurrying to the bathroom where he has some of his make up and toiletries.</p>\n<p>He hears Yoongi from the bedroom mumbling something about him trying, but Jimin ignores him and splashes his face with cold water, dabbing it dry with a towel, then he starts applying some dark grey eyeshadow to the creases of his eyelids, trying to mask the obvious swollen state of his eyes.</p>\n<p>Satisfied, he walks back to the bedroom and he finds Yoongi curled up on the bed, a pillow between his thighs, staring at his hands with his lips pursed.</p>\n<p>“Are you actually pouting at me?”</p>\n<p>Yoongi shrugs.</p>\n<p>“For going to work?”</p>\n<p>Yoongi looks at him and sighs “It's not for that, you know it.”</p>\n<p>Jimin softens at this and he sits on his knees on the matress “I know, babe. But I'll be okay, mh? Besides, today is Hyuna's day.”</p>\n<p>Yoongi seems to relax a bit once Jimin tells him this, slowly he nods and cocks his head to the side “Okay, doll. Just be careful. Want me to come and fetch you once your shift is over?”</p>\n<p>Jimin shakes his head “Nah, I'll just grab a cab, I know you're busy with work.”</p>\n<p>“Okay, doll.”</p>\n<p>Jimin smiles and leans down, planting a kiss on Yoongi's lips, pulling back after a handful of seconds “I'll see you in a few hours.”</p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p>After that night two moths ago, Yoongi did take him out for dinner on his birthday.</p>\n<p>It was in a fancy restaurant that, apparently, Yoongi founded fifty years ago, a table is always reserved there for him if he needs it.</p>\n<p>Jimin remembers how nice it was, how nothing felt uncomfortable or forced, how genuinely happy Yoongi looked and how happy Jimin himself felt.</p>\n<p>He smiles to himself in the subway, on the way to work, thinking of when the waiter asked them for their orders and Jimin asked “Do you have garlic bread?”</p>\n<p>Yoongi had arched an eyebrow at him, completely unamused, Jimin pressing his lips together to suppress a bubble of laughter.</p>\n<p>Yoongi had looked at the waiter for a few seconds, then he said “Do you have an appetizer with herrings?”</p>\n<p>As soon as the waiter had walked away, Jimin bursted in laughter, followed quickly by Yoongi, who hid his own smile behind the menu.</p>\n<p>God, it was nice. They should go back there again one of these nights. Jimin has never felt so... content before. Sure, he had relationships, good relationships, but with Yoongi it was different. It felt safe. It felt like something that could last way more than he thought possible.</p>\n<p>Yoongi, behind all that sarcasm and flat expressions, is caring and sweet, has mannerisms so cute that Jimin feels his chest swell with warmth everytime Yoongi makes cute noises when he cooks for him, everytime the vampire gets excited over some new song he listened to the radio or for an upcoming project. Lately, Jimin has found himself more than not staying at Yoongi's flat. Their schedules don't differ that much, after Jimin started working at the brothel he finds it hard to sleep more than a couple of hours in the night, so they nap a lot when the sun is out, Yoongi working during the early hours of the afternoon or evening, they keep the nights for themselves. Jimin spares a look at his wirst and finds the fading marks of Yoongi's fangs there, he licks his lips unconsciously. He stopped asking himself about his kinks a long time ago. Yoongi is caring, sweet, adorable even, but give him some blood and Jimin finds himself begging for more, Yoongi so quick to comply, touching him in a way that has him gasping for air.</p>\n<p>So yeah. Jimin is happy.</p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p>“You do look happy.” Hyuna says before she's licking at the blood dripping from his shoulder.</p>\n<p>“You should meet him. You'd like him.” Jimin tucks Hyuna's red hair behind her ear “He's a sarcastic asshole.”</p>\n<p>“My favorite people.” she giggles, giving Jimin a smile “You know, I'm seeing the human now.”</p>\n<p>Jimin groans “Oh, thanks fuck for that. I'm so glad you dumped the piece of shit.”</p>\n<p>“Oh, honey, I'm glad too. I couldn't stand his sight anymore.”</p>\n<p>“How is it going with the human? Hyojong, right?”</p>\n<p>“Yeah.” Hyuna wipes her thumb on the wound on Jimin's shouder and sucks on the digit “He's adorable. I'm so gone for him, honey, it's not even funny.”</p>\n<p>“What happened to the whole humans are frail thing?”</p>\n<p>Hyuna's eyes turn a little sadder “They still are. I'm worried about him all the time.”</p>\n<p>“You vampires are seriously so overprotective.”</p>\n<p>“We have good reasons.” Hyuna replies “We seriously don't wanna die of heartbreak.”</p>\n<p>Jimin frowns “What?”</p>\n<p>Hyuna keeps quiet for a few seconds “You'll have your own boyfriend tell you about that, mh? It's not my place to talk about it. But it's okay, Hyojong wants to become my prey.”</p>\n<p>“Oh.” Jimin gasps “Holy- that's good, right?”</p>\n<p>Hyuna nods, smiling “As long as it lasts, it is.”</p>\n<p>“Why shouldn't it-”</p>\n<p>Jimin gets interrupted when he hears the alarm blasting through the walls. His blood turns cold in his veins, heart jumping in his throat. Lisa doesn't work during his shifts, nor do Minjae and Mina, that means-</p>\n<p>“<em>Taehyung</em>.” Jimin jumps on his feet and runs to the door, slamming it open and peaking in the corridor.</p>\n<p>Taehyung's suite is just after his and suddenly the door opens, Taehyung sprinting out of it on wobbly legs. The boy slams against the wall and he has his left arm clutched to his chest, a large wound on his forearm oozing blood.</p>\n<p>“Tae!” Jimin shouts and he runs to his friend, who's slowly slipping down on the floor, breathing heavily.</p>\n<p>“No no, go away.” Taehyung slurs, looking paler than Jimin has ever seen him be.</p>\n<p>Jimin kneels beside him and grabs Taehyung's arm, pressing his hand on the wound to try and stop the blood when a vampire walks out of the suite. He looks completely out of it, eyes wide and mouth slack, staring at Taehyung with his nostrils flaring.</p>\n<p>The door of the corridor opens and Yugyeom comes rushing in, he launches himself against the vampire and slams it on the ground, growling and quickly pinning the creature's arm behind his back.</p>\n<p>“This fucking asshole is high off something.” Yugyeom hisses, the vampire thrashing beneath him but unable to move.</p>\n<p>“Is he allright?” Hyuna asks, looking at Taehyung with concern.</p>\n<p>He sure doesn't look okay, Jimin sees the little color he had left on his cheeks draining, eyes struggling to keep open. Jimin hears someone else rushing in the corridor and then Jungkook is kneeling in front of Taehyung, shrugging his jacket off.</p>\n<p>“Give me his arm.” he urges, Jimin pulling his hand off Tae's arm and Jungkook quickly wraps the jacket around the wound, tying it tight “Tae? Can you hear me?”</p>\n<p>Taehyung nods.</p>\n<p>“Okay, you're okay.” Jungkook swallows and glares at Yugyeom “Where the fuck were you, what took you so fucking long?”</p>\n<p>Yugyeom scoffs, still keeping the vampire pinned on the floor “Blame Bo Gyeong, he's the one who was on booth duty and he wasn't even at the goddamn door.”</p>\n<p>“I'll fucking kill him.”</p>\n<p>“Cold.” Taehyung manages “I'm cold.”</p>\n<p>“Hyung, help me get him up.”</p>\n<p>Jimin nods and puts his arm behind Taehyung's back as Jungkook lifts him from the floor, holding his legs.</p>\n<p>“You're heavier than you look, you know?” Jungkook tries to joke, to keep Taehyung awake, and the boy lets out a breathless chuckle.</p>\n<p>“Not what- you said when you fucked me against a wall.”</p>\n<p>“He sounds just fine to me.” Jimin says, his voice thin and his heart still beating wildly in his chest. They manage to carry Taehyung to the staff room, sitting him on a chair.</p>\n<p>Jimin fetches him a glass of water and helps him drink, Seokjin coming in the room after a minute, lips pressed firmly in a grimace.</p>\n<p>“Jesus, kid, I'm so sorry. I'm firing Bo Gyeong before he even has time to ask how the weather is.”</p>\n<p>“It's okay, hyung.” Taehyung clears his throat, he looks a little more like himself.</p>\n<p>“It's not, but I'll make it up to you. How much blood did you lose? Your blood type is A, right?”</p>\n<p>“I don't need a transfusion, I'm okay.”</p>\n<p>“Fuck no, you're not.” Jungkook hisses.</p>\n<p>“Kook, I'm good, I just want you all to relax for a second and bandage my arm. Then I'd like to sleep for two days.”</p>\n<p>Jin scoffs, already walking to the cabinet where he keeps the bandages and disinfectants “Fuck two days, I'm giving you two weeks off, I'm not letting you come back until I'm sure you're okay.”</p>\n<p>Jin passes the disinfectant and some cotton wool to Jimin and Jungkook undoes the the jacket that he wrapped on Taehyung's wound. It looks bad but not as bad as Jimin thought in the heat of it all, it could've been worst.</p>\n<p>“This is gonna hurt like a bitch.” Jimin murmurs as he wets the cotton with the disinfectant.</p>\n<p>Taehyung nods, Jungkook presses a quick kiss on his temple and holds his hand once Jimin starts dabbing the cotton on the open skin. Taehyung hisses through his teeth, body stiff and eyes scrunched close.</p>\n<p>“Motherfucking shit, I'm gonna fucking piss on that vampire's face.” he groans, Jin snorting from a corner of the room.</p>\n<p>“What are you gonna do with him?” Jungkook asks.</p>\n<p>“I have security escorting him as far as possible, then I'll handle the matter with the police.” Jin sighs “I'm really sorry, Taehyung-ah.”</p>\n<p>Taehyung gives Jin a tight smile “Shit happens. I should've noticed, he looked out of it since I walked inside the room.”</p>\n<p>“Drunk?” Jin asks.</p>\n<p>“Yugyeom said he looked high.” Jimin says, he cleans the wound of the excess blood and nods at Jungkook to start wrapping Taehyung's forearm with the bandage.</p>\n<p>“Got it.” Jin rubs the bridge of his nose “Anyways, I'm calling a taxi for both of you guys, the balcony is closed for tonight. Then I'm firing that fucking idiot.”</p>\n<p>Jimin nods and Seokjin walks out of the room. He looks down at his hands and finds them stained red up to his forearm, some blood drying on his shirt as well.</p>\n<p>“Shit, Yoongi is so gonna smell this.” he murmurs.</p>\n<p>“He's your boyfriend, yeah?” Jungkook asks “He's a vampire?”</p>\n<p>“Yeah.”</p>\n<p>“He's gonna freak out.”</p>\n<p>“It's not my blood, though.”</p>\n<p>Jungkook shakes his head “Trust me, he's gonna freak out.”</p>\n<p>“Can you come home with me?” Taehyung asks Jungkook, looking at his bandaged arm “Kinda in need for cuddles and cheesy movies.”</p>\n<p>“Yeah, of course.” Jungkook takes a deep breath “I think I had a few heart attacks when I saw you there.”</p>\n<p>“That's cute. Ain't he cute?”</p>\n<p>“Adorable.” Jimin heaves a sigh and stands up “I'm gonna go if you don't need me. I'll call you tomorrow, yeah?”</p>\n<p>Taehyung nods and gives him a small smile “You're gonna be okay with Yoongi, yeah?”</p>\n<p>“I sure fucking hope so.”</p>\n<p> </p>\n<p> </p>\n<p>But the thing is, Jimin himself isn't feeling okay. On the ride back home, Jimin finds himself shaking, the image of Taehyung crouched on the floor with his arm bleeding so much, his skin fucking ashen, the look of worry in Jungkook's eyes and the fury he'd seen in the vampire's keep coming back in his head. He knows he's just now realizing what could've happened, how bad it could've went and that his body is just coming to terms with it, metabolizing the shock and fear.</p>\n<p>He's still shaking once he's in the elevator, staring at the buttons panel as he goes up to the third floor. He takes a deep breath as he walks out of it and makes his way to Yoongi's flat. Maybe he should've called him and told him that he was gonna go home instead, but that would've worried him even more. He's about to ring the doorbell when the door opens and Yoongi grabs his arm, pulling him inside and shutting the door close.</p>\n<p>“I could smell blood the moment you walked in the building, what the fuck happened to you?” Yoongi's voice is so emotionless that Jimin feels another shiver rack his body.</p>\n<p>“It's- it's not mine.”</p>\n<p>“I fucking know it's not yours.” Yoongi curses under his breath as he looks at Jimin's hands, still pink with blood “So tell me what the actual shit happened.”</p>\n<p>“Taehyung.”</p>\n<p>Yoongi looks up at his eyes sharply, his face already morphing in one of concern “Shit, doll, is he okay?”</p>\n<p>Jimin nods “Yeah, he's fine, we got to him in time.”</p>\n<p>Yoongi takes a deep breath “Then why are you shaking so bad?”</p>\n<p>Jimin keeps quiet, staring at Yoongi and feeling a lump in his throat until, finally, he lets go. He feels his eyes welling up and a sharp sob getting stuck in his chest.</p>\n<p>“No, don't cry, come here.” Yoongi whispers, pulling him closer and wrapping his arms around his neck, a hand immediately stroking his head and that only helps Jimin in crying harder “Jimin, it's okay, he's fine yeah?”</p>\n<p>“I was-” Jimin hiccups “I was so scared.”</p>\n<p>“I know, doll.”</p>\n<p>“He looked so fucking pale, Yoongi! I thought he was gonna fucking die, I-”</p>\n<p>Jimin tucks his face in the crook of Yoongi's neck, inhaling deeply, the smell of his cologne the only thing familiar to him right now.</p>\n<p>“Okay, you're okay doll.” Yoongi presses his lips on the crown of his head “You're gonna be fine, just breathe.”</p>\n<p>Jimin nods, slowly breathing in and out, trying to calm himself. Fuck him for being so emotional at the worst times, it would've been better if he had this breakdown at the brothel.</p>\n<p>“Hey, how about this, mh?” Yoongi says, rubbing at his back “I'm gonna run us a bath, clean your arms and then we can do whatever you want. I'll even light up those scented candles you like so much, mh?”</p>\n<p>Jimin, despite it all, finds himself laughing weakly “Even though they make your nose itchy?”</p>\n<p>“I'll make this sacrifice, yeah.”<br>\n </p>\n<p> </p>\n<p>Jimin finds himself calming down considerably once his hands aren't stained with Taehyung's blood anymore. He sighs in the warm water of the tub, pressed against Yoongi's chest, the vampire holding him from the back and kissing along his neck softly.</p>\n<p>“I hate these candles.”</p>\n<p>Jimin smiles, closing his eyes “They're expensive as fuck, too.”</p>\n<p>“I hate them even more, now.” Yoongi sniffles and then he groans “My nose is numb.”</p>\n<p>“Do you think they have herring scented Yahtzee candles?”</p>\n<p>Yoongi chuckles “Jesus, could you imagine the stench?”</p>\n<p>“Garlic scented Yahtzee candles.”</p>\n<p>“I'll drown you in this tub.”</p>\n<p>“I'll make myself all pretty for you, wear laced panties, pour rose petals on the bed and-” Jimin giggles “And light up twenty garlic scented candles, waiting for you with my ass up in the air.”</p>\n<p>“I'd die.” Yoongi says “Like, I could actually choke and die.”</p>\n<p>“Because of the candles or because of my ass in panties?”</p>\n<p>A pause, then “Shit, both.”</p>\n<p>Jimin smiles, feeling a lot better, the knots in his musckles slowly loosening “Thank you for this, Yoongi. I feel good now.”</p>\n<p>“I'm glad, doll.” Yoongi swallows “I really hate you working there.”</p>\n<p>Jimin sighs “I don't like it either, Yoongi.”</p>\n<p>“Then quit.”</p>\n<p>“It's not that easy, I have a contract. Besides, Jin has done a lot for me, I'm not just gonna walk out and leave him with one less staff member. But I'll tell him that maybe he should start looking for someone new, mh?”</p>\n<p>“Yeah?”</p>\n<p>“Yeah.” Jimin stirs his neck “Yeah, I'm not so okay with random vampires drinking from me anymore.”</p>\n<p>Yoongi hums and his fingers skim over Jimin's shoulder, stopping on the fresh bite “What's this, mh?”</p>\n<p>“Hyuna.”</p>\n<p>“'s that so?”</p>\n<p>Jimin sighs as Yoongi leaves an open mouthed kiss against it, tongue darting out “What are you doing?”</p>\n<p>“Making you feel good. You're tense as fuck, doll.”</p>\n<p>“No, you're just marking your territory.”</p>\n<p>Yoongi drags his teeth against the sensitive skin, Jimin's breath hitching.</p>\n<p>“You're hurting me, doll, I'm just being a great boyfriend here.”</p>\n<p>“Right, how silly of me.”</p>\n<p>Yoongi smiles on his skin “Can I? I'm not touching you if you'd rather go to sleep.”</p>\n<p>“No, do it.” Jimin tilts his head to the side, leaving more space for Yoongi “Please.”</p>\n<p>Yoongi doesn't bite him immediately. Instead he keeps mouthing at his skin, on his shoulder and on the side of his neck, his fingers dragging from his stomach down to his navel, Jimin's legs parting at the touch, only to have Yoongi pull his hand back up, the pad of his fingers rubbing on Jimin's nipple.</p>\n<p>Jimin arches, chasing the touch of Yoongi's hand.</p>\n<p>Finally, Yoongi sinks his fangs in his skin, in the same exact spot where Hyuna bit him, but he does it slowly, dragging it and having heat bursting all at once.</p>\n<p>“<em>Ah</em>-” Jimin gasps “Yoongi.”</p>\n<p>“It's okay, doll, just relax.” Yoongi licks at the wound, Jimin's hips faltering. Yoongi's hand travels down again and, this time, he takes Jimin's cock in his palm, fist loose around it, slowly working him up.</p>\n<p>“You're always so sensitive, I love it.” Yoongi whispers, voice so fond and warm Jimin finds himself sighing “You're so good to me, doll. So fucking good.”</p>\n<p>Jimin moans at the praise, feeling his dick twitching in Yoongi's hand, the vampire still stroking him lazily, his thumb digging in the slit and teasing at the sentitive head.</p>\n<p>“More?” Yoongi asks, mouthing at the wound, Jimin nods.</p>\n<p>Yoongi pricks at the skin again, drawing blood and making Jimin whimper.</p>\n<p>“I just want you to feel good, doll.”</p>\n<p>“I feel so good.” Jimin breathes, shifting his hips up so that he can get more friction, Yoongi tightens his fist and sucks on his skin, drinking slowly and without rush. This isn't about him, it's about making Jimin feel good. Jimin knows it, he adores Yoongi for this, for turning something that should be for him alone into something for Jimin's pleasure.</p>\n<p>Yoongi bites with his blunt teeth around the wound, strokes his cock faster, Jimin chokes on a moan, his body tautening.</p>\n<p>“Just let go, doll.”</p>\n<p>“I'm so close-” Jimin hisses, chasing the pleasure pooling down.</p>\n<p>Yoongi bites at his earlobe softly “Do you want me to fuck you, doll?”</p>\n<p>“Oh God, please.”</p>\n<p>“Want me to stretch you open, fill you up with my cock?”</p>\n<p>“Yoongi, shit-” Jimin cums, Yoongi keeps stroking him, whispering flith in his ear until Jimin is whining, twitching weakly against him and Yoongi stops moving, resting his hand on the soft of Jimin's stomach.</p>\n<p>“Why am I so nasty?” Jimin whispers, lips stretched in a sated smile.</p>\n<p>“I don't know, but fuck I'm lucky.” Yoongi nuzzles his hair “Wish I could keep you all the time.”</p>\n<p>“You can.”</p>\n<p>“Mmh.” Yoongi wets his lips “Yeah, well, we'll see about that.”</p>\n<p>Jimin frowns at Yoongi's voice, it's clear that something is upsetting him, Jimin can hear it in the rising of his pitch.</p>\n<p>“What's wrong?” he asks, Yoongi doesn't reply “Yoongi?”</p>\n<p>“It's nothing.”</p>\n<p>“Seriously, what's wrong? You can talk to me.”</p>\n<p>Jimin tilts his head so that he can look at Yoongi, the vampire staring at the foam slowly dissipating in the water.</p>\n<p>“Yoongi.”</p>\n<p>“I love you.”</p>\n<p>He says it quickly, rushed, as if he's either ashamed of it or afraid. Jimin feels his lips curling up “I know.”</p>\n<p>Yoongi rolls his eyes “Of course you know.”</p>\n<p>“I love you, too.”</p>\n<p>Yoongi finally looks at him, breathing deeply before cupping his cheek “I know.”</p>\n<p>“You know.” Jimin pulls himself up a bit to leave a kiss on the corner of his mouth “Since you know, tell me what's wrong.”</p>\n<p>“It's not something we have to talk about now, Minnie.”</p>\n<p>“Is it about me becoming your Prey?”</p>\n<p>Yoongi looks away from him “Yeah.”</p>\n<p>“Do you want me to?” Jimin rests his head on Yoongi's shoulder again, he finds his hand underwater and he squeezes it “I seriously know shit about preys, I don't really know how it works. Just that- well, I'd live longer right?”</p>\n<p>“It's not that easy.”</p>\n<p>“But if you-”</p>\n<p>“Jimin, doll, I mean it.” Yoongi shakes his head “You don't have to become my Prey. Like- fuck, it's normal that I feel like this 'cause it's in my nature to want you as my Prey, but it's way too fucking soon, okay?”</p>\n<p>Jimin nods, worrying at his bottom lip “But what if I end up not wanting to be your Prey?”</p>\n<p>Yoongi gives him this small smile that looks a bit forced and a lot sad “I guess I'll have to accept my heart breaking.”</p>\n<p>“What?”</p>\n<p>“Babe.” Yoongi rubs his nose on his cheek and sighs “Let's not think about this shit right now, okay? You're tired and you've has a bad evening, let's just get to bed.”</p>\n<p>Jimin hums “Will we cuddle?”</p>\n<p>“You know damn well we're gonna cuddle.”</p>\n<p> </p>\n<p><br>\n<br>\n<br>\n </p>\n<p>The club is quiet when Jimin comes back for his shift. Taehyung is still away, still a week off to go, Jimin is stuck on the balcony alone. It's fucking boring. There's not many people but Jimin isn't surprised. After accidents there's always at least a week of little to none customers, even vampires don't wanna be in a place where one of their kind went havoc. Jimin is left alone drinking his Martini, looking at the bottom floor where the few customers they have are simply chatting quietly at their tables, glasses filled with blood in their hands. Jimin spots Jungkook in his usual spot and waves at him to grab his attention. When he succeeds, Jimin gestures him to come closer and the younger immediately complies.</p>\n<p>“Everything okay?” he asks as soon as he's under the balcony.</p>\n<p>“Yeah, don't worry. Just wondering if Taehyung is fine. He says he is when we talk on the phone, but- well, you know.”</p>\n<p>Jungkook sighs and nods “No, I get it. Honestly, he is fine. Sometimes I see him staring at his arm but he doesn't really talk about it. I guess he's still just trying to forget it happened.”</p>\n<p>Jimin hums “How was he when you got him back at his place?”</p>\n<p>Jungkook grimaces “It wasn't pretty, he cried a lot. He was so fucking scared, I think he tried to make it look like he was fine 'cause you were there.”</p>\n<p>Jimin nods, biting at the inside of his cheek “Yeah, I figured. But he's fine, right?”</p>\n<p>“I'm sure he'll be great soon. You know him more than I do, he'll just get better out of spite.”</p>\n<p>Jimin smiles at this, Jungkook grinning along “Yeah, you're right Kookie.”</p>\n<p>“And you? Everything okay with your boyfriend?”</p>\n<p>“Yeah.”</p>\n<p>“Did he freak out?”</p>\n<p>Jimin sighs “Fuck yeah, he did.”</p>\n<p>“I knew it.” Jungkook shrugs “Vampires. We're like that. I mean, I'm only half, but I still have that streak in me.” Jungkook looks briefly behind him “I gotta get back to my spot, you'll be okay?”</p>\n<p>“You do your job, Kook-ah, I'll do mine.” Jimin winks at him “Thank you.”</p>\n<p>Jungkook nods and walks away, moving back to his usual corner, standing with his shoulders straight and his hands behind his back.</p>\n<p>Jimin goes back to sipping his drink but he can't focus on the taste very well. He didn't lie to Jungkook, between Yoongi and him everything is going just fine. It's just that Jimin just can't seem to get out of his head what Yoongi had told him. Hyuna mentioned it, too. The heartbreak. Everytime a vampire mentions that word it sounds far more dangerous than it really is. Jimin realizes his Martini is over and, well, he's so not gonna stay sitting there without anything to do and nothing to drink. He spares a glance at the bar and he sees that Namjoon is sitting there as well, talking with Hoseok, the man finding himself quite free of duties as there are so few people. Jimin stands up and walks down the stairs of the balcony, making his way to the bar counter. He sits down heavily on the free stool besides Namjoon, Hoseok arches an eyebrow at him.</p>\n<p>“What are you doing here? If you needed a drink you could've-”</p>\n<p>“I don't need a drink.” Jimin frowns “No, that's bullshit, I actually need one. But I also need advice.”</p>\n<p>Hoseok rolls his eyes at him, pulls back from his brow locks of orange hair and turns around, grabbing a bottle of Gin.</p>\n<p>“What do you need, kid?” Namjoon asks him around his glass of liquor.</p>\n<p>Jimin waits for Hoseok to finish mixing his Martini. The man slides a cocktail glass in front of him, pours the liquid in it, then takes an olive out of a bowl and plops it in.</p>\n<p>Jimin stares at it “No toothpick?”</p>\n<p>“I'm too curious as to what you need advice for.” Hoseok grins at him and leans on the counter by his elbows “Spill, child.”</p>\n<p>“I need to know more about Preys.”</p>\n<p>Namjoon's eyebrows raise, the man's eyes lingering on him for a while “Why?”</p>\n<p>“You're with a vampire?” Hoseok asks.</p>\n<p>“Yeah, but it's not that he really asked me. It's- I just want to know more, 'cause I know shit. Just the basic stuff.”</p>\n<p>Namjoon nods, Jimin picks his glass and drinks “It's good that you ask, it's better to know what you're getting into.”</p>\n<p>“You're making it sound scary, Joon.” Hoseok mutters.</p>\n<p>“Well, it ain't exactly something light, you know? Being a Prey is a commitment.”</p>\n<p>“Just explain it to me.” Jimin urges him, growing restless.</p>\n<p>“Okay, damn.” Namjoon takes a deep breath “Well, you know, being a Prey is- I'm not gonna say that it's like marriage, but really fucking close. It's more than a promise, it's an oath. You become a Prey, you're promising something really close to forever.”</p>\n<p>Jimin nods so that Namjoon can see he's listening and understanding.</p>\n<p>“The thing is, becoming a Prey is easy. You drink a drop of vampire's blood and there, you and that vampire are bonded. For life. I ain't joking about that. But this is where the deal gets messy, you're not the one who's bound, the vampire is.”</p>\n<p>Jimin frowns “Wait, that's not what I know.”</p>\n<p>“It's a common misconception, not entirely wrong either. You see, you become a Prey and you feel way more close to your lover. I'm talking real fucking close, it's something intimate, it's hard to describe. You just feel it, you feel your soul isn't yours only anymore. And, of course, as you drink vampire's blood your lifespan also expands, so that you can stay with the vampire longer. The more frequently you drink, the longer you live.”</p>\n<p>“Makes sense.” Hoseok comments, picking an olive from the bowl and munching on it.</p>\n<p>“In return, your lover will feed only from you because it's to you that they're bound. You understand?”</p>\n<p>“Yeah, I think.” Jimin rubs at his nose “Like, they can't physically feed on others or-”</p>\n<p>“They can. But Jin says it tastes like shit at that point.” Namjoon replies “But there's this thing- Shit, I think it's unfair. You become a Prey, you promise forever, but you can walk out of it.”</p>\n<p>A silence follows, Jimin's confusion growing stronger “I don't get it.”</p>\n<p>“If you want to stop being someone's Prey, you just stop.” Namjoon clarifies “You decide you have enough? Just walk away, never meet that vampire again, stop drinking their blood and the bond will weaken 'till it disappears and you start aging normally again.”</p>\n<p>“Okay.” Jimin nods slowly “Why is it unfair?”</p>\n<p>“The bond disappears for the Prey, not for the vampire.” Namjoon looks back at his glass “That vampire will still be bonded to their Prey. That's why it's for life.”</p>\n<p>Jimin blinks, trying to get a sense out of what Namjoon just told me. It- fuck, it does sound unfair. Like the worst kind of breakup ever.</p>\n<p>“Why?” Jimin asks, finally.</p>\n<p>“Hell if I know, that's just how it works.” Namjoon shrugs “Vampires are a mess. So it's a big step, especially considering the risks.”</p>\n<p>“Risks?”</p>\n<p>Hoseok huffs a breath “Shit, has your boyfriend told you anything?” he looks at Namjoon with an arched eyebrow “He probably doesn't wanna tell Jimin 'cause he doesn't wanna scare him away.”</p>\n<p>“What are you guys talking about?”</p>\n<p>“Heartbreak.” Namjoon answers, his tongue darting out to wet his lips “Vampires can die out of it.”</p>\n<p>“That's-” Jimin tries to find words, but they die on his lips. Hyuna looked so sad when she talked about heartbreak.</p>\n<p>And Yoongi- Yoongi looked like he was just waiting for it. Like it's something he expects, something he'll just have to feel.</p>\n<p>“It's common for vampires to let themselves starve to death after their Prey leaves.” Namjoon adds “It's also real fucking rare to meet a vampire who's had more than a Prey. Jin told me they can feel it when they find someone who they want as a Prey, they can taste in the blood or something. Hell, I know of Preys who don't leave their lover just because they're terrified of breaking their hearts and, well, you can't stay with someone out of fear.” Namjoon pauses “That's why I'm telling you, Jimin, being a Prey is wonderful if you're in love. If you're sure you're gonna spend a fucking long time with them. But if you're not sure, then don't do it. For his sake.”</p>\n<p>Jimin decides that now it's a good time to down his drink in one gulp, Hoseok whistling impressed.</p>\n<p>“Shit, Joon, you scared the fuck out of him.”</p>\n<p>“Hey, I'm being honest.” Namjoon retorts “He needs honesty.”</p>\n<p>“I'm good.” Jimin croaks “How- how long have you been Jin-hyung's Prey?”</p>\n<p>“I've been with Seokjin for sixty-seven years.” Namjoon replies with a smile “Ain't planning on stopping anytime soon.”</p>\n<p>Hoseok, behind the counter, gags “Jesus, I hate happy couples.”</p>\n<p>“Jimin-ah.” Namjoon calls, looking at him with eyes that are too old on his face “Talk to him before making any rash decision. Because you're too kind to live in fear.”</p>\n<p><br>\n </p>\n<p>It's dawn when he's back home. It just comes to Jimin's mind that lately he's been calling Yoongi's flat home a lot. That's something else he needs to think about now. He manages to get his shoes off despite how tired he feels, so he drags his sleepy body to the bedroom.</p>\n<p>He can make out Yoongi's silhouette in the dim darkness of the room, dark curtains shielding him from the sun. Yoongi is curled up under the blankets, eyes shut tight and mouth pursed. Fuck, he's cute.</p>\n<p>Jimin takes off his clothes and grabs the first shirt he finds in the closet, then he crawls onto bed and under the blankets, laying down next to Yoongi.</p>\n<p>As he does almost every night, Jimin traces with his fingers the slope of his nose, then the cupid bow of his lips, his jaw, up to his cheekbones and eyebrows. Jimin feels his lips stretch in a smile.</p>\n<p>“You're back.” Yoongi grumbles, not opening your eyes.</p>\n<p>“Woke you up?”</p>\n<p>“'s okay, was waiting for you.” Yoongi shifts a bit closer to him “Come here, how was work?”</p>\n<p>“Good.” Jimin says as he easily fits against Yoongi's chest, the vampire wrapping his arms around him “Slow night, didn't have one single client. Which is shit for my bank account but lovely for my blood.”</p>\n<p>“Damn right it is.”</p>\n<p>Jimin hums “Yoongi.”</p>\n<p>“Mmh?”</p>\n<p>“I'm not gonna break your heart.”</p>\n<p>Yoongi doesn't say anything, but Jimin feels him holding him harder “Okay.”</p>\n<p>“That's why I think that maybe-”</p>\n<p>“Jimin, doll, you really don't have to become my Prey. I mean it.”</p>\n<p>“I think-” Jimin continues “I think that maybe we should see how it goes before making any decision. 'Cause it's a big fucking deal.”</p>\n<p>“It is.”</p>\n<p>“So we stay like this for a while. Hopefully a lot. And maybe it's gonna take me years but once I'm sure, then-”</p>\n<p>“Once you're sure.” Yoongi brushes his lips on Jimin's forehead “Once you're sure tell me. Until then, we stay like this.”</p>\n<p>Jimin sighs, getting a bit lost in the warmth of Yoongi's embrace “Until then.”</p>\n<p><br>\n </p>\n<p>Yoongi tells him, one afternoon, that he's never had a Prey before, nor did he intend on finding one.</p>\n<p>“You hear so much terrifying shit about them.” Yoongi says as he lays on the couch with Jimin sprawled over him, half watching the tv, half combing his fingers through Jimin's hair “I was born in a family with no Preys, my mom and dad were both vampires, full pure bloodline and all of that. Some of them are elitist assholes, others don't really care. Don't know, haven't seen them in forever. I talk to my brother sometimes.”</p>\n<p>Jimin hums, chin propped on Jimin's chest “The rest of your family?”</p>\n<p>“My dad is nice, but my mom wasn't very happy when I left home so soon.” Yoongi scoffs “I mean, I stayed fifty years with them dealing with their bullshit, I'm gonna say I lasted more than I expected.”</p>\n<p>“What bullshit?”</p>\n<p>“My family is large. Cousins, uncles, all that clusterfuck. And since we're all pure bloods there were so many conflincts about money and estates, activities we own, just really boring stuff. So I just left and started making my own shit, so that they can't come to me in-” Yoongi pauses “Say five hundred years when I'm finally turning old and they all want a piece of my legacy 'cause they feel entitled to it. Fuck that.”</p>\n<p>Yoongi's hand travels from Jimin's hair to his cheek, cupping it and stroking circles on the skin with his thumb, Jimin leans lightly in the touch.</p>\n<p>“What does that have to do with Preys?”</p>\n<p>“Elitists, that's what my parents are.” Yoongi replies “They don't like the idea of vampires and humans forming any kind of bond.”</p>\n<p>“But you left a long time ago, you cut ties, so they weren't stopping you from being with someone.”</p>\n<p>“Told you, never really thought about it. Like-” Yoongi presses his lips together “My parents and family filled my head with stories about heartbreak, of vampires who lost eveything because of a human, of humans who lied just to be able to live longer. So I never really looked for anyone. I wasn't looking for you either, you just showed up.” Yoongi shrugs “At that point there wasn't much I could do, you fucked me up.”</p>\n<p>Jimin purses his lips so that he stops the huge smile he knows it's coming and presses his face on Yoongi's chest, rubbing his nose on the fabric of the vampire's t-shirt.</p>\n<p>“Shit, what are you acting so cute for, mmh?” Yoongi asks.</p>\n<p>“Oh, shut up.”</p>\n<p>“You always do this, you ask me questions, I reply honestly and you get all blushy and embarassed.”</p>\n<p>“Please!” Jimin scoffs, raising his head to look at Yoongi “Yesterday I was walking around in shorts and you looked like you were about to burst.”</p>\n<p>“That was not embarassment, that was my dick getting hard embrassingly quickly.”</p>\n<p>Jimin pinches Yoongi's hip and the vampire startles, hissing and glaring at him “You're so violent for being so tiny.”</p>\n<p>Jimin shrugs with a grin and then shuffles forward so that he can start leaving kisses all over Yoongi's face, the vampire groaning and grimacing but letting him do it anyways.</p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p>Taehyung comes back to work as if nothing bad ever happened to him. He's all smiles and jokes, dirty remarks about his boyfriend's ass and- well, it's just as always. Taehyung doesn't force smiles nor does he fake happyness, he's never been that type of person. But now, everytime he gets requested, Jimin sees him rubbing absentmindedly at his arm, almost as if he needs a reminder, before he accepts the job.</p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p>“So here I am.” Taehyung sips at his drink, one leg hooked over the other “Wearing nothing but the sexiest babydoll you could ever find, deadass posing on my bed as if I'm in the fucking Victoria's Secret catalogue when Jungkook finally gets home.”</p>\n<p>Jimin nods, his finger running on the stem of his cocktail glass.</p>\n<p>“He opens the door, steps in, sees me and just fucking stops moving. And I'm there waiting for the good dicking, you know?”</p>\n<p>“Of course I know.”</p>\n<p>“Jungkook just keeps staring. I'm not sure if I gotta find it hot or not. I swear at least a minute passes, at this point I'm holding my breath.” Taehyung licks his lips, takes a dramatic pause “And then Jungkook flops on the goddamn ground like a wet piece of cloth.”</p>\n<p>Jimin blinks “He fainted.”</p>\n<p>“Yes.”</p>\n<p>“Because he saw you in a babydoll.”</p>\n<p>“I almost called the ambulance.”</p>\n<p>“Your boyfriend is a fucking idiot.”</p>\n<p>“I prefer the term Endearing Overgrown Child.” Taehyung says “E.O.C., if you will.”</p>\n<p>Jimin snorts, almost choking on his Martini. His tablet buzzes and Jimin sighs, grabbing it and looking at the request.</p>\n<p>“Thirty seconds session.” he groans as he accepts the job “I'm gonnna be back soon.”</p>\n<p>“Yeah.” Taehyung smiles “Be careful, okay?”</p>\n<p>Jimin nods at him “Yeah.”</p>\n<p><br>\n </p>\n<p>He's honestly starting to seriously consider quitting this job. He's never had a problem with it, his job provided him with money and a certain life style. But since Yoongi came around it's getting harder and harder to sit there on that couch with another vampire feeding off of him. It's starting to get uncomfortable. Still, he's not leaving before Jin finds someone who can replace him.</p>\n<p>Jimin fixes his shirt and opens the door to his suite. This must be a new client, Jimin is pretty sure he's never seen this man. He looks quite plain, a simple cheap looking suit that looks a bit tight on him, huge eyes on a rather small face, although he's well built. He probably doesn't have a lot of money but still wants to act like new rich, that's why he managed to book Jimin only for thirty minutes.</p>\n<p>“Hello, darling.” Jimin smiles as he closes the door “First time here, mh?”</p>\n<p>“Yeah.” he replies, voice so low in the room Jimin strains to hear him.</p>\n<p>“Well, sit down over there, I'll start with the rules.” Jimin points at the corner of the ceiling “There's a camera there, recording everything, I'm allowed to stop this session at any given moment. I will sound an alarm if for any reason I don't feel comfortable.”</p>\n<p>Jimin sees a flash of annoyance in the vampire's face as he sits down on the couch.</p>\n<p>“If you want to add seconds you gotta tell me before our time is over.” Jimin starts undoing the buttons of the sleeve of his shirt, rolling it up, hoping to get the vampire's attention on his wrist “All clear, darling?”</p>\n<p>The vampire nods and mumbles a yeah.</p>\n<p>“Well, then.” Jimin sits down next to him, grabs his stop watch “Where do you-”</p>\n<p>“Neck.”</p>\n<p>Jimin holds back a sigh and clenches his jaw “Yeah, okay.”</p>\n<p>He undoes the first two buttons of the shirt, lets it fall a bit under his shoulders, clears his voice and tilts his head to the side “Whenever you're ready.”</p>\n<p>As soon as he says this, the vampire is on him, sinking his fangs in his neck so quick and hard that Jimin has to bite his lip as to not cry out. Fucking piece of shit really wants to get as much blood out of him as he can in the small time he has.</p>\n<p>Jimin makes the stop watch start and breathes deeply. He knows it's only thirty seconds, but this is- fuck, it hurts. This vampire is sucking on his skin too hard, Jimin can already feeling it bruise, pointed teeth grazing at his open skin, causing nothing but more pain. Jimin shuts his eyes close and keeps the pained noises to himself, trying his best to endure this. It's not the first time he has a customer this violent, it's okay, he can do this.</p>\n<p>The vampire makes a noise against his neck, tongue lapping at the wound, Jimin grimaces but doesn't say anything. This isn't uncommon, he never had any problem with this kind of behaviours. Fuck Yoongi for spoiling him and turning him so picky, it's his fault entirely.</p>\n<p>The vampire bites again, in the same exact spot with the same pressure and strength, Jimin grunts in pain, steals a look at the watch and sees that there are only fifteen seconds to go. So he closes his eyes and counts, ignoring the sounds the vampire is making, just waiting for-</p>\n<p>The stop watch rings and Jimin's eyes fly open “Time's up, darling.”</p>\n<p>The vampire pulls back only slightly “I'm requesting more seconds.”</p>\n<p>“That's not how it works.”</p>\n<p>“Ten more seconds.” and he's back on his neck, sucking.</p>\n<p>Jimin rolls his eyes and goes for the alarm remote he keeps in the back pocket of his jeans. Suddenly there's a hand around his wrist that pulls his arm up, pinning it above his head.</p>\n<p>“Get the fuck off me.” Jimin growls, starting to squirm away, but the vampire just holds his wrist tighter and wraps his mouth around his neck.</p>\n<p>And that's when Jimin's blood runs cold. Because he's been in danger before, but this is the first time he can't reach his alarm.</p>\n<p>Jimin starts thrashing, trying to get away from the vampire, to at least make him stop drinking his blood, he knows that at this rate his head will go dizzy, the man is drinking too much too fast.</p>\n<p>“Fucking let go of me!” Jimin yells, trying to raise his knees between him and the vampire's stomach so that he can either kick him away or get to his only shot of getting out of this before shit gets too much.</p>\n<p>After Taehyung's incident Seokjin was clear on one thing: defending themselves was more important than anything else.</p>\n<p>Jimin manages to get a foot up on the couch, still trying to shove away the vampire, struggling to keep his eyes from scrunching close in pain. Jimin, with his free arm, taps at his calve, barely reaching it, and feels the knife under the fabric of his pants.</p>\n<p>He quickly slips his hand under the leg of the pants when the vampire bites down his neck so <em>hard </em>Jimin swears he could pass out right now. He screams, voice cracking and eyes welling up with tears, the pain on his neck fucking excruciating, skin almost burning where he's been bitten. Jimin's sight is turning fucking blurry, everything is aching but he still manages to get a grasp of the knife hidden in his pants, tied with a simple belt to his calf. He gets it out of the restraint and, without even thinking about it, Jimin sinks the knife deep in the side of the vampire's neck. The man yells and pulls back, clutching at his neck, Jimin finally free to squirm away from him. He falls to his knees as soon as he's off the couch but he gets up again, a hand pressed against the wound on his neck and the other grabbing the remote in the pocket of his jeans and pressing it, the alarm ringing immediately.</p>\n<p>Jimin sprints out of the booth, legs shaking and barely keeping him up for taking more than a few wobbly steps before he's back on his knees on the floor. But Yugyeom is already in the hallway, rushing to him.</p>\n<p>“Fucking shit, Jimin, what-” Yugyeom's attention is caught by the vampire who dashes out of the room, trying to run away.</p>\n<p>But Yugyeom is on him, grabbing his arm, twisting it and pushing the vampire against the wall, the man thrashing against him but stilling as soon as Yugyeom starts digging and twisting the knife that Jimin has stuck in the vampire's neck, deepening the wound.</p>\n<p>Jimin drags himself to the wall so he can at least lay his back against it, his head swimming in pain and dizzyness, he feels blood between his fingers, the pressure he has on the wound clearly not enough. From the corner of his eyes, Jimin can see more of the security staff is coming, he sees Jungkook running to him, so he guesses that closing his eyes right now isn't such a bad idea.</p>\n<p>“You keep those fucking eyes open, Jimin.” Jungkook says, voice firm, his hands already against his neck, Jimin lets his own arm fall but he does open his eyes.</p>\n<p>“Y-you forgot the hyung.” Jimin murmurs, Jungkook forcing out a laugh.</p>\n<p>The other guards are taking the vampire away, Yugyeom staring at him with huge eyes.</p>\n<p>“That's a big wound.” he says “We need to get him to the infirmary.”</p>\n<p>Jungkook nods and Yugyeom kneels beside him, both of them grab him by the legs and back, Jungkook keeping his hands pressed tight on his neck.</p>\n<p>Jimin struggles to keep his eyes open but doesn't dare to close them, tries to focus on the ceiling when he feels another hand grabbing his own and squeezing it.</p>\n<p>“What the fuck happened to him?” Taehyung says, voice loud and tinted with fear.</p>\n<p>“I swear I was in the moment the alarm sounded but he was already in this state.” Yugyeom replies, Jimin looks at Taehyung “This looks fucking awful, I don't know why he didn't sound the alarm immediately.”</p>\n<p>Jimin feels the looks of almost every customer on him as they carry him to the infirmary as quick as they can, he sees Jin opening the door for them.</p>\n<p>“'m fine.” Jimin manages to whisper, his throat hurts.</p>\n<p>“You're so not fine.” Jungkook mutters as he and Yugyeom put him on the chair.</p>\n<p>“He's losing so much blood, that can't be normal.” Taehyung murmurs, squeezing his hand that he still isn't letting go.</p>\n<p>“It's okay.” Jin says, grabbing bandages and disinfectant “It's gonna be okay, first we see how deep the wound actually is then maybe we start panicking.”</p>\n<p>“Wow, that's... really not helping.” Yugyeom says, Jin throws him a glare then gets next to Jungkook, folding the bandage four times.</p>\n<p>“You're gonna remove your hands quick, so I can put this on his neck.” he tells Jungkook “Now.”</p>\n<p>Jungkook takes off his hands and Jin immediately presses the bandage on the wound, Jimin hisses and his hold on Taehyung's hand hardens.</p>\n<p>“Okay, let's see.” Jin pulls back only slightly the edge of the bandage, eyes squinted, he licks his lips “Turns out we don't panic, it's not that bad.”</p>\n<p>“Not that bad?!” Taehyung screeches “He looks like that asshole ripped his throat open!”</p>\n<p>“That's 'cause he ripped a whole goddamn chunk of flesh off but it's not deep and he didn't break any artery, it's superficial. Just large.” Jin sighs “Fuck, you got so lucky Jimin.”</p>\n<p>Jimin frowns “Yeah. Lucky. That's how I feel.”</p>\n<p>Taehyung chuckles “He's being sarcastic, he's gonna live, a miracle.”</p>\n<p>Jimin would laugh but, honestly, every time he opens his mouth everything hurts so he's gonna keep quiet.</p>\n<p>“This will hurt a lot.” Jin says, the bottle of disinfectant in his hand “But I'll be quick, yeah?”</p>\n<p>Jimin nods weakly and takes a deep breath, preparing for more pain. Seokjin tilts the bottle and lets drops of the liquid fall on his skin, Jimin's whole body tautens and he grits his teeth, trying his best to not let any sound out. After what he's been through in the booth, this kind of pain is actually nothing to him.</p>\n<p>“Yugyeom, get me clean bandages.” Seokjin instructs, still cleaning the wound “Jungkook, get some towels and damp them with water so that we clean this blood off of him.”</p>\n<p>Taehyung takes a shaky breath, clearly trying to calm down “Jesus, Minnie, how the fuck did you end up like that?”</p>\n<p>“I tried to sound the alarm as soon as he requested more seconds because he asked once the time was already over.” Jimin says, he swallows “But he noticed and grabbed my arm, he kept going, I barely managed to reach the knife.”</p>\n<p>Yugyeom comes back with clean bandages and Jin quickly works them on the wound after folding them, then secured them there by wrapping more around Jimin's neck.</p>\n<p>“Too tight?” he asks, Jimin shakes his head “Okay. Well, the blood is already stopping but maybe it would be better for you to go to an hospital. If not tonight then tomorrow.”</p>\n<p>Jimin sighs “Is it gonna scar?”</p>\n<p>Jin grimaces “I'm afraid so, kid.”</p>\n<p>Jimin closes his eyes, he nods “Yeah, okay.”</p>\n<p>“Jimin-”</p>\n<p>“It's not your fault, hyung.” Jimin means it. It's not Jin's fault, it's no one's fault but the vampire's. And his own, for still working there “But, just so you know, you might wanna find someone who can replace me very soon.”</p>\n<p>Jin smiles at him “I'll do my best. Anyways, you're not coming back here for at least three weeks, you got in serious danger.”</p>\n<p>“Oh my God.” Jimin groans “Oh no, Yoongi is gonna kill me.”</p>\n<p>“Don't think about that now.” Jin tells him, massaging the bridge of his nose “You rest here for a while, yeah? When you feel ready I'll call you a cab or something.”</p>\n<p>Jimin nods “Yeah, thank you.”</p>\n<p>Seokjin looks at him for a few seconds with his lips pressed tight and brow furrowed “I'm so sorry, Jimin.”</p>\n<p>Jimin gives him a tight smile “Not your fault.”</p>\n<p><br>\n </p>\n<p>Once Jungkook finishes cleaning him off with some towels, Jimin feels like dozing off and Taehyung is trying very hard to keep him awake.</p>\n<p>“You know, it ain't a concussion, it's not like I die if I fall asleep for more than an hour.” Jimin grumbles, Taehyung swats at his thigh.</p>\n<p>“Just stay awake, you'll sleep once you're home.” he pauses “Are you going back to your place or-”</p>\n<p>“Promised Yoongi I'd go to his flat, if I don't he's gonna get more suspicious and worried and then he'll find out and he will actually dump me.” Jimin clicks his tongue “I'll- I think I'm gonna stay here 'till the end of your shift. That way I'll be home when it's past dawn and Yoongi will be sleeping already, maybe that will buy me time.”</p>\n<p>Jungkook, who's throwing the towels in a basket, scoffs “Yeah, right.”</p>\n<p>“Jungkook.” Taehyung grits out with a tight smile “Babe. Shut that pretty mouth of yours?”</p>\n<p>Jungkook rolls his eyes “Sorry if I'm being honest.”</p>\n<p>“I don't need honesty right now.” Jimin retorts “What I need is to rest and drink.”</p>\n<p>Jungkook nods “I'll get you some water.”</p>\n<p>“Babe.” Taehyung arches an eyebrow “He doesn't need water, he needs a Martini.”</p>\n<p>Jimin sighs “You know me so well, Tae.”</p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p>It's way past dawn when Taehyung's car stops in front of Yoongi's condo, Jimin sitting on the backseat and staring at the building with his bottom lip between his teeth.</p>\n<p>“Do you want us to walk you up?” Jungkook asks.</p>\n<p>“Nah, it's fine, I feel better now.”</p>\n<p>His neck still hurts like crazy, but the fog in his head disappeared and his legs don't feel like actual jelly anymore, so Jimin is gonna consider this a win.</p>\n<p>“Okay, I need honesty right now.” Jimin looks at Jungkook “How much do I smell like blood?”</p>\n<p>“A whole fucking lot.” Jungkook replies.</p>\n<p>“Taehyung, spray me with Gucci or something.”</p>\n<p>“It's not gonna mask it, hyung.” Jungkook says, giving him an apologetic smile “Sorry.”</p>\n<p>Jimin sighs and opens the car door “Let's hope Yoongi is sleeping really fucking deeply then. Thank you for driving me here.”</p>\n<p>“Don't mention it.” Taehyung twists around to plant a kiss on his cheek “I'll call you tomorrow.”</p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p>Jimin stands in front of the door of the apartment until his weak legs almost give up on him, so he gets inside and locks the door as quietly as he can, putting the keys back in the pocket of his coat.</p>\n<p>He takes off his shoes and walks slowly, praying that Yoongi isn't gonna wake up. Once he's in the room, Jimin finds Yoongi asleep, half hugging a pillow. Maybe he won't wake up.</p>\n<p>In the darkness of the room, Jimin strips of his clothes and walks to the bathroom, throwing the bloodied shirt in the laundry basket even though he knows there's no way that the stains will wash away. He grabs then one of Yoongi's t-shirts from his closet, hoping that at least that will somehow mask the smell, even if just a bit, then slowly and carefully lays on the bed. He tucks the covers up to his chin and keeps as far as possible from Yoongi, who's giving him his back. Jimin sighs and closes his eyes, hoping to just fall asleep quickly and deal with this whole mess when he'll wake up in the evening.</p>\n<p>But then, Yoongi stirs. Jimin holds his breath as Yoongi rolls around, eyes still closed.</p>\n<p>“Doll?”</p>\n<p>Shit. Jimin doesn't reply and shuts his eyes close, hoping that Yoongi will think he's asleep already. Yoongi doesn't speak for a while, but then Jimin hears him shuffling closer and slump an arm on his waist. Yoongi breathes in then freezes. Jimin swears he feels his heart jump in his throat as Yoongi takes a deep intake of air again.</p>\n<p>“What the fuck happened?”</p>\n<p>Okay, not dealing with it in the morning. Yoongi is already reaching for the bedside lamp, he switches it on and Jimin opens his eyes.</p>\n<p>“Before you freak out-”</p>\n<p>Yoongi doesn't let him finish, just shrugs the blankets off him. His eyes fall on the bandages on his neck, expression blank for a few seconds.</p>\n<p>“Jimin, what happened to you?” he whispers, his face finally showing emotion as his eyes go wide with concern.</p>\n<p>“It's not that bad, I promise.” Jimin says, slowly sitting up straight “Just- an issue with a client.”</p>\n<p>Yoongi slowly raises a hand and moves it to his neck but he doesn't touch it, just lets his fingers hover above the bandages.</p>\n<p>“It's not deep. Jin-hyung took care of it, it's really not that-”</p>\n<p>“I can smell open flesh, so don't you dare tell me that it's not that bad.” Yoongi says, talking so fast that he slurs on some words “You smell like you were drenched in blood so don't you tell me not to freak out, 'cause I am.”</p>\n<p>“Yoongi-”</p>\n<p>“You're so fucking pale, how much blood did you lose?” Yoongi whispers, his expression finally softening and his hands finding Jimin's own, holding them and squeezing them.</p>\n<p>Jimin breathes in “It really wasn't that bad, Yoongi. I got lucky.”</p>\n<p>“Wouldn't call it lucky.”</p>\n<p>Jimin lets out a chuckle, more out of nerves than anything “I actually stabbed him in the neck to get out of there.”</p>\n<p>Yoongi frowns “You stabbed him.”</p>\n<p>“I couldn't get to my alarm, he grabbed my arm.”</p>\n<p>“He-” Yoongi blinks “Let me get this straight, you couldn't even sound the alarm?”</p>\n<p>Jimin doesn't reply. Yoongi's eyes are narrowed on him, concern gone and replaced with something else.</p>\n<p>“Jimin.” Yoongi wets his lips “Jimin, you're quitting tomorrow.”</p>\n<p>Jimin blinks “Excuse me?”</p>\n<p>“I'm- I'm so fucking serious right now.” Yoongi cups his cheeks, jaw clenched hard “I'm actually begging you to quit this job tomorrow.”</p>\n<p>Jimin laughs incredulously, looking at Yoongi “I can't just quit!”</p>\n<p>“I'll talk to Jin, ask him this favor.”</p>\n<p>“I don't want to leave Jin short of a staff member like this! He helped me so much, I owe him some time to find someone else!”</p>\n<p>Jimin sees the moment Yoongi almost loses it, but he just breathes in deeply again and closes his eyes for a moment “Doll, I don't think you're following me. You were in serious danger because you couldn't use your only source of safety.”</p>\n<p>“It never happened before, I never had that problem! It just happened!”</p>\n<p>“Yeah, and it can happen again!” Yoongi says, his voice rising.</p>\n<p>“There was nothing I could do about it!”</p>\n<p>“That's the fucking point, Jimin! You can't do anything about it because you're a human and that was a vampire! We're predators, for fuck's sake!”</p>\n<p>“Yoongi, I won't quit this job in a day! That doesn't mean I'm gonna stay there for long!”</p>\n<p>“Jimin, fuck, can't you do this for me?!” Yoongi shouts, Jimin flinches “You could've fucking died! You actually almost died and I almost lost you, so please, I'm begging you, quit that fucking job!”</p>\n<p>“I'm not your fucking Prey yet, you can't tell me what to do.”</p>\n<p>Jimin regrets his words the moment he stops talking. He didn't mean it to say anything like that, especially not with that tone, not that angrily, not as if he really believes it. Yoongi's hands slowly fall down from his face to his lap. The vampire stares at him with his lips parted, almost as if he's trying to say something but no words come out, blinking slowly, processing what Jimin just told him.</p>\n<p>“Shit.” Jimin swallows “Yoongi, I'm- I'm so sorry, I didn't mean it.”</p>\n<p>Yoongi doesn't reply, just keeps looking at him, eyes darting from the bandages on his neck to his eyes. Jimin tries to reach for his hand but Yoongi flinches and moves away from him. Jimin freezes.</p>\n<p>“Yoongi.”</p>\n<p>“I'll sleep in the guest room.” he says, he gets off the bed and walks to the door “You rest.”</p>\n<p>Before Jimin can say anything else, Yoongi closes the door and leaves him alone.</p>\n<p>Jimin finds himself staring at the ceiling for what feels like hours, his head repeating those words he said over and over again until Jimin almost feels disgusted with himself.</p>\n<p><br>\n </p>\n<p>When he wakes up it must be afternoon already, judging by the low sunlight creeping in the room from a small opening between the curtains. Jimin sighs and his throat feels like sandpaper, neck aching. He manages to get out of bed and slowly walks out the room and to the kitchen, he fills himself a glass of water and drinks avidly.</p>\n<p>Yoongi doesn't seem to be in the house, it's too quiet. At this hour he either sleeps or works, but from the little studio no sounds came, when Jimin goes to check in the guest room he finds it empty.</p>\n<p>Yoongi isn't home. He left with the sun still out and if that doesn't tell Jimin of how fucking angry Yoongi must be at him...</p>\n<p>It's not like he's gonna burn to ash, but vampires just don't like sunlight and Yoongi is particularly sensitive to it. So if Yoongi actually felt a need so strong to leave the house even though it's still broad daylight, then it truly means Jimin fucked up.</p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p>Jimin kills time by taking a long bath, he changes the bandages on his neck and grimaces at how irritaed the skin looks around the wound, sensitive and throbbing. He then sits on the couch, one of Yoongi's fluffy blankets wrapped around him as he watches the tv without really paying attention, waiting for Yoongi to come back. It's still his house, he must come back even if it's just to break up with him.</p>\n<p>Jimin looks at his phone, it's already ten in the evening. He hasn't even ate anything, too busy cursing himself for being such a prick. Jimin sighs and quickly dials Jin's phone number, waiting for the vampire to answer.</p>\n<p>“Minnie? Is everything okay?”</p>\n<p>Jimin sighs “I'm fine, hyung.”</p>\n<p>“You're not just saying it, right?” there's music in the background, Jin must be at the brothel “I feel so bad, Jimin, I'm thinking of ways to improve the security system and-”</p>\n<p>“Jin-hyung, it wasn't your fault, I just got very unlucky.” Jimin tries to calm him down because, truly, it's not Jin's fault “Just- I need to talk to someone? And a vampire would be better.”</p>\n<p>“Okay. Okay, give me a moment.”</p>\n<p>Jimin keeps quiet and waits for Jin to speak again, he hears the music slowly fading away, a door opening and closing, then silence. Jin must be either in his office or outside the club, maybe in the back.</p>\n<p>“Okay, Jimin-ah, tell me.”</p>\n<p>“It's-” Jimin fidgets with the blanket “I said something shitty to Yoongi.”</p>\n<p>A pause “Okay, what?”</p>\n<p>“He was very worried and mad because of the accident with the customer and kept telling me I should quit the job.”</p>\n<p>“Well, you can't blame him, Ji-”</p>\n<p>“I know that.” Jimin mutters “But I was so nervous, I was in pain and scared but all Yoongi did was yelling at me things I already know so I just snapped at him.”</p>\n<p>“What did you say?”</p>\n<p>Jimin literally struggles to repeat it again “I told him I'm not his Prey so he can't tell me what to do.”</p>\n<p>There's silence for a while on the other line, then a sigh “Jesus, Jimin.”</p>\n<p>“I know, okay!” Jimin exclaims “I know, it was shitty, it was too much and out of place, I know how important to vampires the whole Prey thing is! I was nervous, I didn't mean it! But now he's gone, he left and he's still not back and I'm afraid I ruined everything just because I'm an idiot and-”</p>\n<p>“Jimin, darling, please breathe? You're rambling, calm down.”</p>\n<p>Jimin closes his eyes and breathes in, slowly forcing his heart beat to slow down “I feel like shit.”</p>\n<p>“I know, Jimin. But- okay, hear me out. I know that you said what you said out of anger, you had a terrible experience and instead of comforting you Yoongi just told you things you already know. But, for once, I think you need to try and put yourself in Yoongi's place.” Jin says, voice gentle and careful “If you want to stay with him I need you to realize that things like these will happen. Because that's just how vampires are, we are like this by nature. We protect what we love because what we love is frail and we aren't. I know that it's annoying, trust me, Namjoon never fails to remind me of that, but we are protective and territorial. We are born as predators, it's in our nature, that can't be changed. And if you'll ever become his Prey, that instict to just <em>protect</em> what we have will only be stronger. Yoongi is already trying his best, the fact that he kept quiet about you working in this brothel up until now still amazes me. He actually let you work in a place where other vampires suck your blood, do you have any idea of how fucking hard that is? I don't think I'd be able to let this happen if it were with Namjoon.”</p>\n<p>Jimin doesn't speak, so Jin starts again.</p>\n<p>“Jimin, you're a strong person and you have your own life. I get it. But this is a job that is dirty and dangerous, <em>anyone</em>, not only a vampire, wouldn't want you to do this. Then you come back home, smelling like someone ripped your throat open, he panicked. Hell, I'm surprised he didn't try to come here and kill the vampire who did that to you.”</p>\n<p>“I know.” Jimin whispers “I know that.”</p>\n<p>“Yoongi might have acted too harshly, but can you blame him? You almost died.” Jin sighs “Jimin, vampires are surrounded by things that wither in the blink of an eye. We'll do everything we can to be sure that they don't wither in front of our eyes.”</p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p>Jimin isn't sure what time it is, maybe close to dawn, but he wakes up with Yoongi's fingers combing through his hair.</p>\n<p>“Get back to sleep.” Yoongi says, he's kneeling on the floor in front of the couch “Didn't mean to wake you up.”</p>\n<p>Jimin stirs under the blanket “What time is it?”</p>\n<p>“Not even dawn, maybe four in the morning.” Yoongi pauses “You should get to bed, though.”</p>\n<p>“Are you gonna sleep with me or are you gonna go in the guest room?”</p>\n<p>“If you want me to sleep with you I'll sleep with you.”</p>\n<p>“Good.” Jimin stretches out his arms “Carry me?”</p>\n<p>Yoongi rolls his eyes but still scoops his arms under Jimin's and circles them around his waist, Jimin quickly straightening up and wraps his legs around Yoongi's waist. Yoongi starts getting up, lifting Jimin from the couch.</p>\n<p>“Jesus, you're heavy.” Yoongi groans.</p>\n<p>“What happened to vampire's strength?” Jimin asks, chin hooked over Yoongi's shoulder as he walks to the bedroom.</p>\n<p>“Never been much of a strong vampire. I'm in the fast side.”</p>\n<p>Jimin giggles “You're basically one of those lame superheroes, everyone has super cool powers and then there's always the one who is just <em>fast</em>.”</p>\n<p>“I'm gonna drop you, then we'll see who's the lame superhero.”</p>\n<p>They make it to the bed and Yoongi kneels on it, carefully putting Jimin on the mattress and then falling heavily on it “I'm so fucking tired.”</p>\n<p>Jimin lays wordlessly next to him.</p>\n<p>“Next time I think it's a good idea to go around because I'm mad and the sun is out just shove garlic up my asshole.”</p>\n<p>Jimin snorts at that, the sound turning quickly into laughter, Yoongi smiling at him with that stupid fond expression painted on his face.</p>\n<p>“Don't make me laugh, my neck still hurts.”</p>\n<p>Yoongi's eyes fall down to his neck “Be honest, how bad is it?”</p>\n<p>“It's seriously not that bad. Not good either, but I'll be fine.” Jimin sighs “It's gonna scar though.”</p>\n<p>Yoongi nods then opens his arms and Jimin quickly moves so Yoongi can hug him. Jimin feels a sigh leave his lungs as soon as he has his face tucked in the crook of Yoongi's neck, the smell of his cologne so familiar that it feels like home, Yoongi's arms wrapping easily around his frame.</p>\n<p>“I'm so sorry, doll.” Yoongi says against his hair “I'm so fucking sorry.”</p>\n<p>“No, I was the one who went overboard. I really didn't mean it, that thing about me not being your Prey-”</p>\n<p>“You aren't my Prey.”</p>\n<p>“That doesn't give me the right to say that shit. I know how important a Prey is to a vampire and I'm sorry for insinuating that you'd control me or something.” Jimin pauses “I'm sorry, Yoongi.”</p>\n<p>“Okay, doll.” Yoongi nuzzles his hair “And I'm sorry for just fucking attacking you when you just needed some comfort, I was just- just scared. But you were too, more than me so-” Yoongi pauses “Why the fuck am I so bad at this?”</p>\n<p>Jimin chuckles, his fingers skimming along Yoongi's spine “You're good at other things.”</p>\n<p>“Yeah?”</p>\n<p>“Sure.”</p>\n<p>“Like what?”</p>\n<p>“Eating my ass.”</p>\n<p>“You're lucky you're still weak and injured, otherwise I would throw you off this bed, you smartass.”</p>\n<p>“You're good at being good to me, Yoongi.” Jimin says “You're good to me.”</p>\n<p>Yoongi holds him a bit tighter, Jimin ignoring the slight pain on his neck to get lost in what feels to him as the safest place on earth.</p>\n<p>“I'll quit working at the brothel, okay? Just give Jin-hyung time to find a replacement and I'll quit. I have three weeks off, Jin said he's gonna look for someone in this time, I'll be out of there soon.” Jimin plants a small kiss on Yoongi's shoulder “Okay?”</p>\n<p>“Okay.” Yoongi says “Okay, doll.”</p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p>The following week is spent mostly in bed with Yoongi fussing over him. 'Cause if Yoongi spoils him when he's fine, if he's recovering from an injury Yoongi downright doesn't leave him alone for a second. Which is not bad, but-</p>\n<p>“You are not gonna wash me.”</p>\n<p>“You like it when I wash you!”</p>\n<p>“I like it because it means sexy time! You're not gonna wash my fucking ass because I have a cut on my neck!”</p>\n<p>“You have a piece of flesh <em>missing</em> from your neck!”</p>\n<p><br>\n </p>\n<p>But other than that, it's nice. Scratch that, it's great. Because Yoongi is weak to him, so he's especially weak to him if Jimin pulls the right cards and whines about his neck aching and itching so Yoongi just sighs and prepares himself for a session of cuddles that might or might not last for maybe hours.</p>\n<p><br>\n </p>\n<p>Jimin is already feeling better, his energies are back but he still has to take care of his wound, slowly but surely healing, itching like a bitch. He gets rid of all the bandages, keeping just an adhesive one over the wounded spot, his neck finally free.</p>\n<p>So, one day, he asks “Yoongi, aren't you hungry?”</p>\n<p>Yoongi, who's sitting on the couch with Jimin between his legs, frowns “You just ate.”</p>\n<p>“No, I mean, you haven't bitten me for a while.”</p>\n<p>“I have blood bags in my fridge, you know?”</p>\n<p>“Yeah, but you always say how much better it is warm.”</p>\n<p>Yoongi gives him a look “I'm not laying a fucking finger on you until I'm sure you're okay.”</p>\n<p><br>\n </p>\n<p>Which sucks. Because Jimin might be recovering, but he's a thirsty bitch who's recovering.</p>\n<p>Yoongi isn't lying when he tells him that he's seriously not gonna touch him for a while. Everytime they start making out and Jimin tries to make things just a little bit more heated, more intimate, Yoongi pulls back and gives him a look that screams <em>Yeah, nice try</em>.</p>\n<p><br>\n </p>\n<p>After almost two weeks, Jin calls him to tell him he actually found someone else.</p>\n<p>“Really?!” Jimin exclaims, stirring the stew he's cooking in the pot.</p>\n<p>“Yeah, he's a good kid and he's friends with Yugyeom, up to a few days ago he worked in that expensive brothel in Gangnam, so he's got good references. His name is fucking complicated, told us all to call him Bambam.” a pause “He has really long legs.”</p>\n<p>“That's great!”</p>\n<p>“He dabs a lot, too.”</p>\n<p>Jimin frowns “He dabs?”</p>\n<p>“When I told him he had a job he just- dabbed. For like ten seconds. Really fast.”</p>\n<p>“Taehyung is gonna love him.” Jimin says, he tastes the stew from the spoon and grimaces. He can't cook for shit.</p>\n<p>“I'm afraid he's gonna dab even whilst customers are drinking from him.” Jin murmurs “Either way, he can start working on the first of June, so you'll have one last day of work when you come back. If you don't wanna do it and skip it it's totally fine.”</p>\n<p>“No, I'll come! I'll say goodbye to you all.”</p>\n<p>“What, you're planning on disappearing?”</p>\n<p>“Of course.”</p>\n<p>“You little-”</p>\n<p>“I won't.” Jimin grins “I'll come back for the free Martinis.”</p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p>Now.</p>\n<p>Jimin has a plan.</p>\n<p>A really good plan.</p>\n<p>Fuck it, an amazing plan.</p>\n<p>Yoongi is out for a few hours, he has a meeting with a producer he will work with soon, so Jimin gets ready.</p>\n<p>He waits for Yoongi on the couch, a blanket covering his legs, wearing one of Yoongi's large sweaters, smelling of that lavender bodywash Yoongi said he likes, hair all tousled. It's a bulletproof plan.</p>\n<p>When the door opens, Jimin bites back a smirk.</p>\n<p>“Hey!” he exclaims as Yoongi walks in the living room “How was the meeting?”</p>\n<p>“Boring as fuck.” Yoongi replies, shrugging his jacket off “But maybe a good song will come out.”</p>\n<p>“I have news.”</p>\n<p>“Yeah?”</p>\n<p>Jimin nods and pats the empty space next to him, so Yoongi goes to sit there.</p>\n<p>“Jin-hyung found someone who can replace me.”</p>\n<p>Yoongi blinks “This is the best fucking news of a goddamn lifetime, and I'm 200 years old.”</p>\n<p>“I knew you'd like it.”</p>\n<p>“Sure I do. Aren't you happy?”</p>\n<p>“I am.” Jimin licks his lips “So I was thinking we should celebrate.”</p>\n<p>Yoongi nods, rubbing at his cheek “Sure, you wanna go out for dinner somewhere?”</p>\n<p>“No.”</p>\n<p>“What do you wanna do?”</p>\n<p>“I want to fuck.”</p>\n<p>Yoongi chokes on his spit, Jimin keeps quiet and waits for Yoongi to stop coughing.</p>\n<p>“Jimin, I-” Yoongi clears his throat “You're still recovering.”</p>\n<p>“Nah, I'm good.”</p>\n<p>Yoongi arches an eyebrow “I'm not gonna-”</p>\n<p>“I think you are.” Jimin pulls away the blanket and, God, does he enjoy the look on Yoongi's face once he sees the stockings on his legs.</p>\n<p>They're nothing particularly sexy, just creamy cotton mid thigh stockings, warm and soft to the touch. But he knows he looks good in those.</p>\n<p>Yoongi quickly snaps out of it “If you think these will be enough for me to-”</p>\n<p>Jimin rolls his eyes and quickly moves so that he's straddling Yoongi's lap, shifting his ass slowly on his crotch.</p>\n<p>“I can't believe you're actually trying to seduce me right now.” Yoongi mutters, clearly struggling to keep his hands to himself.</p>\n<p>Jimin knew this would happen. That's why he's prepared.</p>\n<p>“Yoongi.” he whines, Yoongi swallows “I really want you to fuck me.”</p>\n<p>“Jimin-”</p>\n<p>“And bite me.”</p>\n<p>“I'm so not-”</p>\n<p>Jimin grabs the hem of the sweater and pulls it up, revealing his stomach and chest, he bites the sweater between his teeth to keep it up and smirks at Yoongi's face as his eyes land on the pink satin boyshorts he's wearing.</p>\n<p>Jimin waits. Yoongi keeps staring.</p>\n<p>“Fuck it.” the vampire breathes out, grabbing the back of Jimin's thighs and standing up, Jimin yelps and wraps his legs around him.</p>\n<p>“Jesus Christ, weren't you only fast?”</p>\n<p>“I'm suddenly strong, don't ask me why, the power of panties or something.”</p>\n<p>Jimin hums, Yoongi quickly carrying him to the bedroom “That or the herrings.”</p>\n<p>Yoongi stops walking “Okay, the herrings are gonna be a turn off, just so you know.”</p>\n<p>“No no no, focus on the panties.” Jimin giggles “Come on, I'm wearing fucking stockings, forget of those goddamn fishes.”</p>\n<p>Somehow, Yoongi manages to get both of them to bed without breaking anything nor dropping Jimin. As soon as Jimin's back hits the mattress Yoongi is on him, kissing him deeply and hard, his hands already roaming on his body. Jimin sighs into the kiss, tugs at Yoongi's shirt that is tucked in his pants until Yoongi gets the message and pulls back just so that he can unbutton and take off the piece of clothing.</p>\n<p>Yoongi then grabs Jimin's sweater and pulls it up to his chin, leaning down “Keep that up.”</p>\n<p>Jimin puts the fabric between his teeth again, he knows he'll want to have his fingers between Yoongi's hair for what is coming.</p>\n<p>Yoongi starts leaving a trail of soft kisses along his collarbones, Jimin sighing and relaxing at the feeling, Yoongi's hands still keeping Jimin's legs wrapped around his waist.</p>\n<p>Yoongi then laps at Jimin's nipple, flicking his tongue over the nub, Jimin bites at the sweater harder, feeling it already damping with his spit.</p>\n<p>Yoongi's hand goes to Jimin's right nipple, teasing it with the pad of his finger, not really putting any pressure, his thumb just grazing it. Yoongi wraps his lips around the other nub and sucks, Jimin's hips faltering and he almost loses his grasp on the sweater.</p>\n<p>Jimin breathes hard through his nose as Yoongi keeps teasing and playing with his chest, squeezing lightly his nipple between his teeth, flicking at the other with his finger. Jimin lets out a small sound, muffled because of the sweater, he feels his dick twitching in his panties and it takes him all of his control not to shamelessly rut against Yoongi's crotch, keeping still beneath him.</p>\n<p>Yoongi's hand travels then down from his chest to his navel, fingers skimming over the skin, sending shivers up Jimin's spine until Yoongi slips his hand past the waistband of Jimin's boyshorts and palms at his cock.</p>\n<p>Jimin gasps, hips raising to meet Yoongi's hand but the vampire keeps his touch light, not giving him any real friction, just teasing and making Jimin's head dizzy with frustration.</p>\n<p>Yoongi trains his attention on Jimin's neck, sucking at the skin, slowly moving upwards until he tugs at Jimin's earlobe with his teeth.</p>\n<p>“Want me to fuck you?”</p>\n<p>Jimin whines, biting the fabric of the sweater and feeling spit drool past the corner of his mouth.</p>\n<p>“Want me to stretch you open with my fingers, tease you until you beg for me to fill you up?”</p>\n<p>Jimin's eyes flutter close, his dick twitching under Yoongi's hand, the vampire showing some mercy and stroking him lazily.</p>\n<p>“Want me to bite you?”</p>\n<p>Jimin whimpers at this, still managing to keep the clothing between his teeth, pushing up in Yoongi's loose fist around his dick.</p>\n<p>“Look at you, doll, so fucking needy.”</p>\n<p>Jimin moans, mentally cursing his stupid boyfriend and his stupidly filthy tongue.</p>\n<p>Suddenly, the hand around Jimin's dick disappears and Jimin opens his eyes, thrusting up his hips into nothing.</p>\n<p>Yoongi gets off the bed and shrugs off his pants and briefs, he walks to the bedside drawer and gets the bottle of lube, he gets back on the bed and fits himself between Jimin's legs.</p>\n<p>“Want to keep these on?” he asks, pointing at the satin shorts. Jimin shakes his head, so Yoongi tugs at the waistband and pulls them down, Jimin raising his hips to help him. Jimin clutches his legs to his chest once Yoongi has to pull away the panties conpletely.</p>\n<p>“Keep those there too, mh?” Yoongi says as he squeezes some lube on his fingers, rubbing them together to warm it up “Can you do that?”</p>\n<p>Jimin nods. At this point he's ready to run a fucking marathon if it means that Yoongi will start to actually give him any sort of attention.</p>\n<p>Yoongi starts thumbing at his hole, Jimin holds his breath until he feels Yoongi's finger slowly breaching inside. Jimin's breath hitches, he grips his thighs closer to his chest.</p>\n<p>“Relax, I got you.” Yoongi whispers, moving his finger carefully. Jimin closes his eyes and tries to breathe more regularly through his nose, the fabric of the sweater in his mouth drenched and muffling the noises he makes.</p>\n<p>He feels himself relaxing, Yoongi starts moving his finger a bit faster, a bit deeper. God, Jimin missed this.</p>\n<p>“<em>Mwore</em>.” Jimin manages around the sweater, Yoongi quick to comply, adding another finger.</p>\n<p>Jimin wants to moan, to let at least one sound, but his teeth are tight around the piece of fabric, Yoongi's fingers slowly fucking him open, stretching him and rubbing against his walls.</p>\n<p>Yoongi glances at him, lips parted and gaze heavy “So fucking pretty, I just-” Yoongi looks at his thighs “Want me to bite you?”</p>\n<p>Jimin nods, a moan slipping past his gritted teeth. Yoongi pats at his leg so Jimin lets them go, leaving them parted beside Yoongi's hips. Yoongi grabs his left leg and lifts it up, he tugs at the stocking and pulls it down a little. Then Yoongi licks at Jimin's inner thigh before he finally sinks his fangs in the soft flesh.</p>\n<p>Jimin moans, arching and letting go of the sweater, not caring anymore, his mouth open and gasping for air. Heat surges through his body and goes straight to his cock, leaving it throbbing and untouched, Yoongi too busy sucking his blood and still fingering him open.</p>\n<p>“Yoongi-” Jimin gasps, grasping at the sheets as Yoongi adds a third finger.</p>\n<p>“You're doing good, doll.” Yoongi says, licking off drops of blood off Jimin's thigh “You're clenching around my fingers, started doing that the moment I bit you.”</p>\n<p>Jimin just closes his eyes, drowns in the waves of heat and pleasure that hit him, Yoongi's tongue darting on the small wounds on his thigh.</p>\n<p>“Yoongi, just-” Jimin swallows “Just fuck me, please, I'm-”</p>\n<p>Yoongi retrieves his fingers, Jimin clenching around nothing, the vampire gives one last lick at his thigh before he plants a small kiss on it, the action eliciting a giggle out of Jimin.</p>\n<p>Yoongi grips Jimin's hips and starts slipping inside. Jimin feels his rim stretching around the head of Yoongi's cock, burning slightly, just adding to the sensations. Yoongi groans as he sinks inside deeper, slowly pulling back just to pull back inside, Jimin shudders and wraps his legs around his waist, pushing him closer.</p>\n<p>Yoongi leans down, nosing at his neck, kissing the skin softly to help him relax.</p>\n<p>“You're so fucking tight, doll.” Yoongi breathes out, squeezing his hips hard.</p>\n<p>“Neck-” Jimin manages “Bite my neck.”</p>\n<p>Yoongi tenses up “You sure?”</p>\n<p>“Please, I- I miss it.”</p>\n<p>Yoongi curses but he still lapts at his skin before biting, fangs sinking in his flesh easily, Jimin's eyes roll back and he moans loud, his skin so hot he feels like burning, Yoongi bottoms out and keeps still, drinking from his neck, his fangs still deep inside.</p>\n<p>“Feels so- so fucking good, Yoongi.” Jimin wraps his arms around Yoongi's neck, his fingers combing through black hair “Move, want you to fuck me.”</p>\n<p>Jimin bites at his bottom lip at Yoongi's first shallow thrusts, slow and deep. Yoongi digs his fangs deeper in his neck and Jimin moans, jerking his hips back against Yoongi's hips, urging him deeper and harder.</p>\n<p>“Yeah-” Jimin breathes out “Like that, fuck me like that.”</p>\n<p>“Shit.” Yoongi starts finding a rythm, hips slapping against Jimin's buttocks, the sound filling the air.</p>\n<p>When Yoongi slams back inside hard and fast Jimin cries out, fingers digging in Yoongi's back, he's pretty sure he's scratching him at this point but he can't focus on anything but the feeling of being filled up, the heat that still buzzed under his skin as Yoongi keeps lapping his blood away.</p>\n<p>“Yoongi, buh-bite me again.”</p>\n<p>Yoongi groans, slamming back inside of him, hard and fast, leaving him breathless and shuddering until the vampire has his fangs in his skin again, in a spot just above the previous one, everything suddenly feels too much, too sensitive, too good and too painful, mingling together and messing up with Jimin so much he feels a sob wreck his body.</p>\n<p>Yoongi hums on his neck, sucking hard, Jimin's dick throbbing and leaking precum over his stomach, Yoongi shifts his hips a little and at the next thrust Yoongi hits the bundle of nerves inside him so good and hard Jimin cries out way too fucking loud.</p>\n<p>Yoongi laps at the wound one last time before he pulls back and sits back on his tallons, grabbing Jimin's thighs and fucking him harder, fingers digging in the flesh.</p>\n<p>“You should fucking see yourself.” Yoongi grunts in between thrusts “You look so good.”</p>\n<p>Oh, Jimin has an idea of how he looks, of how fuckin wrecked he must be, a quivering mess, whimpering and moaning Yoongi's name, begging for more.</p>\n<p>“Yoongi!” Jimin gasps, his own hips moving to fuck himself on Yoongi's cock.</p>\n<p>“Say it again, say my name.”</p>\n<p>Jimin whimpers “Yoongi.”</p>\n<p>“Shit, I love you.” Yoongi leans down to kiss him, Jimin tries his best to keep up but he gives up quickly, leaving his mouth open for Yoongi, for him to lick against the roof of his mouth, tug at his lip and sucking on his tongue.</p>\n<p>Jimin feels something coiling in the pit of his stomach, heat still spreading from his neck.</p>\n<p>“Gonna cum.” Jimin's breath itches in his throat “Yoongi, fuck, go harder.”</p>\n<p>Yoongi does, slamming inside deep and hard, his pace fast enough for it to be too much too quickly. Jimin cums hard over his and Yoongi's stomach, his whole body shuddering and shaking as Yoongi keeps fucking him hard, chasing his own release, his lips back on Jimin's neck.</p>\n<p>He bites one last time, in the same spot, reopening the small wound, sending burning heat across Jimin's sensitive body before he cums as well, spilling inside Jimin with a deep moan, lips locked on his skin.</p>\n<p>Jimin licks his dry lips, he finally lets his legs fall down on the matress, muscles aching. Yoongi takes a deep breath before he pulls himself up on his elbows and slowly slips out of Jimin, apologizing quietly as he winces.</p>\n<p>Yoongi lays down next to him, his hand already finding it's way to Jimin's hair “You okay?”</p>\n<p>“I-” Jimin swallows and chuckles airily “I'm so good right now.”</p>\n<p>Yoongi snorts “You're fucking unbelievable.”</p>\n<p>“Best fuck of a lifetime.”</p>\n<p>“Jesus.”</p>\n<p>“Ten out of ten would fuck again.”</p>\n<p>“If you don't shut up right now, I swear to-”</p>\n<p>“Five stars on Yelp Reviews.”</p>\n<p>Yoongi groans, Jimin giggling breathlessly, sweat cooling down on his skin “I missed this.”</p>\n<p>“I could tell.”</p>\n<p>“As if you didn't like it.”</p>\n<p>Yoongi hums, eyes falling close “Guess who's drunk?”</p>\n<p>“The herrings?”</p>\n<p>“That's the thing I regret the most, you know? Telling you of those goddamn herrings. I want them to be extinct, that's how much I regret it.” Yoongi pauses “You're lucky you're so pretty.”</p>\n<p>“Oh my God, drunk you is back, I missed him.” Jimin rolls on his side, his thumb stroking Yoongi's cheek “How much do you love me?”</p>\n<p>“So fucking much.”</p>\n<p>“Brutally honest drunk Yoongi is the best.”</p>\n<p>Yoongi opens his eyes, a small sated smile gracing his lips “Two can play this game. How much do <em>you</em> love me?”</p>\n<p>Jimin sighs, smiling so wide his cheeks hurt “You know.”</p>\n<p>Yoongi's eyes are maybe the most honest thing about him. They don't hide anything, never. So when he says “I know.”, Jimin can see it in his eyes that he really does.</p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p>Yoongi is sitting on the bed as Jimin gets ready for his last day of work.</p>\n<p>“Do you really have to go?” he asks, Jimin just buttons his shirt.</p>\n<p>“Yep.”</p>\n<p>“Mmh.”</p>\n<p>“Yoongi, is my last day, let me say bye to everyone and drink free Martinis.”</p>\n<p>“Fine, whatever.” Yoongi clicks his tongue “Ah, you might not find me when you come back. I have to meet with this singer at the crack ass of dawn 'cause he's a trainee and he's got lessons early, so-”</p>\n<p>“Okay, I guess you'll find me sleeping.” Jimin gives himself one last look in the mirror “Okay, I'm ready to go.”</p>\n<p>He turns around and leans down on Yoongi, kissing him quickly on the lips. As he pulls back, Yoongi grabs his wrist and pushes him on the bed, then gets on Jimin's lap and sprawls himself all over him, nosing at his neck and hair, hands moving all over his clothes.</p>\n<p>“Err.” Jimin frowns as his boyfriend keeps this up, actually rubbing himself against him “Yoongi, what-”</p>\n<p>“Here.” Yoongi suddenly pulls back and gets off him “Now you can go.”</p>\n<p>“What even was that?”</p>\n<p>Yoongi shrugs “Nothing, just wanted to do it.”</p>\n<p>“You're so fucking weird.”</p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p>“Okay, look, I seriously like this Bambam, he's hilarious.” Taehyung tells him as they sit on the balcony “But last time I met him, he dabbed me goodbye.”</p>\n<p>Jimin blinks “Wait, what?”</p>\n<p>“Yeah, people wave you goodbye, but not him, oh no. He dabs goodbye.” Taehyung shakes his head “He's a genius.”</p>\n<p>Jimin chuckles “Anyway, where the hell is Jin-hyung? I wanted to chat with him but he's not even here.”</p>\n<p>Taehyung wriggles his eyebrows “Namjoon-hyung isn't here either, you know what that means?”</p>\n<p>“Oh God.”</p>\n<p>“Bow Chika Bow Wow.”</p>\n<p>Jimin snorts, almost choking on his Martini, Taehyung looking far too smug and satisfied with his stupid joke.</p>\n<p>Maybe he'll actually miss this place. He'll miss this balcony, the Martinis, killing time with Taehyung, he'll miss the melody of lofi Hip Hop filling the Brothel, the ridiculously expensive couches, the candles lit up everywhere, on all surfaces.</p>\n<p>But that's when he notices that almost every single customer in the Brothel is staring at him. It's- not in a hungry way, more like... like they're in awe. Almost scared of coming close to him, looking at Jimin like he shouldn't be here, like he doesn't belong.</p>\n<p>That's also when Jungkook basically sprints under the balcony, staring at him with the same look.</p>\n<p>“Hyung, what the actual fuck?”</p>\n<p>“What?” Jimin frowns “What's wrong, why is everyone looking at me?”</p>\n<p>“You- you're scaring them away! They can't even get close to you!”</p>\n<p>“I don't-”</p>\n<p>“You're marked, so why did you even-”</p>\n<p>“Woah, hold on.” Jimin holds up his hand “What do you mean marked?”</p>\n<p>Jungkook blinks “Hyung, you're drenched with the smell of a vampire. I'm guessing Yoongi? He marked you.”</p>\n<p>“Marked me.”</p>\n<p>“Scent marked you, yeah.”</p>\n<p>Jimin is... well, confused.</p>\n<p>“It's gonna disappear in like a day, but still-” Jungkook grimaces “It's not the best in a Brothel.”</p>\n<p>And suddenly, it makes sense. Yoongi's behaviour makes so much sense.</p>\n<p>Jimin sighs, grabs his glass, downs his Martini and slams the glass back on the table “I'll cut his fucking dick off.”</p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p>The moment the door opens, Yoongi coming in and taking off his shoes, Jimin is waiting for him at the beginning of the living room.</p>\n<p>“Hey!” Yoongi greets, takes a step forward, then freezes.</p>\n<p>Jimin smirks, victorious, as Yoongi's eyes well up with tears, turning red in a matter of seconds.</p>\n<p>“Oh my-” Yoongi coughs “Shit, what's this smell?!”</p>\n<p>“Garlic.” Jimin says.</p>\n<p>Yoongi stares with wide teary eyes at the crown of garlick hanging on his neck “Jimin, why-”</p>\n<p>“The whole house, every fucking available surface, is covered in garlic. I have garlic heads shoved in my fucking underwear.”</p>\n<p>Yoongi coughs again, grimacing and rubbing at his nose “Why the fuck?!”</p>\n<p>“You scent marked me, you fucking shit.”</p>\n<p>Yoongi groans “It was a joke! I did it for laughs, I thought we'd laugh about it!”</p>\n<p>“Do you see me laughing, Min Yoongi?!”</p>\n<p>“No, I can't see shit 'cause I'm tearing up!” Yoongi exclaims “Fuck, please, let me open the windows, I'm actually gonna die.”</p>\n<p>Jimin tilts his head to the side and takes a step forward, Yoongi steps back “I drank garlic juice, Yoongi.”</p>\n<p>Yoongi, if it's even possible, pales “No.”</p>\n<p>“Why don't you give your boyfriend a kiss, Yoongi?”</p>\n<p>“Stay away from me.”</p>\n<p>“Give me a kiss!”</p>\n<p>“Jimin, you get one step closer and I'll- FUCK, YOU SMELL LIKE DEATH, GET AWAY FROM ME!”</p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p><br>\n </p>\n<p>\n<u>TWO WEEKS LATER</u>\n</p>\n<p><br>\n </p>\n<p>“Okay.” Jimin breathes hard, Yoongi's naked body still on top of him “That was the best one yet.”</p>\n<p>Yoongi chuckles “What about that time I fucked you on the kitchen counter?”</p>\n<p>Jimin pauses “Okay, this was the second best one yet.”</p>\n<p>Yoongi rolls off of him, grabbing a pillow and putting it under his head. He then frowns and scrunches up his nose “What the-”</p>\n<p>“What's wrong?”</p>\n<p>Yoongi slides his hand inside the pillowcase, patting around until he finds something. When he pulls his hand outside, there's the head of a garlick in his fist. Yoongi stares at it.</p>\n<p>“I-” Jimin swallows “I was sure I threw them all away.”</p>\n<p>“Two fucking weeks.”</p>\n<p>“Yoongi, I swear it's not on purpose.”</p>\n<p>“Two weeks and I keep finding garlic everywhere.”</p>\n<p>“It's not <em>everywhere</em>.”</p>\n<p>Yoongi throws the garlic as far away as possible, shivering.</p>\n<p>Jimin grins and moves closer to Yoongi, kissing the tip of his nose “Yoongi.”</p>\n<p>“What, you fucking garlic bitch.”</p>\n<p>“You know.”</p>\n<p>Yoongi looks at him, smiles “I know.”</p>\n<p>And Jimin can see it in his eyes that he really does.</p>"
}