{
  "id": "12408531",
  "url": "https://archiveofourown.org/works/12408531?view_full_work=true",
  "author": [
    "Leslie_Knope"
  ],
  "title": "When You're Close I Feel the Sparks",
  "rating": "Mature",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Teen Wolf (TV)"
  ],
  "relationships": [
    "Derek Hale/Stiles Stilinski"
  ],
  "characters": [
    "Derek Hale",
    "Stiles Stilinski",
    "Laura Hale",
    "Talia Hale",
    "Sheriff Stilinski"
  ],
  "additional_tags": [
    "Alternate Universe - High School",
    "Alive Hale Family",
    "Spark Stiles Stilinski",
    "Emissary Stiles Stilinski",
    "BAMF Stiles",
    "Mild Smut",
    "Friends to Lovers",
    "Werewolf Reveal"
  ],
  "language": "English",
  "series": "",
  "published": "2017-10-19",
  "completed": "2017-11-09",
  "words": "39,671",
  "chapters": "4/4",
  "comments": "472",
  "kudos": "13,833",
  "bookmarks": "3,142",
  "hits": "167,946",
  "summary": "<p>The guy is hot as hell, sure—leather jacket <em>and</em> glasses, Jesus, be still Stiles' poor, bisexual, beating heart—but more importantly, it must really suck being new on the first day of senior year. </p>\n<p>“We’re adopting him,” he decides, tugging Scott and Kira by the elbow in that direction. “Let’s go.”</p>",
  "notes": "<p>So this started as a simple little fluffy HS AU, 10K words or so, and then...and then it turned into this monster! The story is almost done, I'm just finishing up the last chapter and doing final edits. New chapters every Wednesday!</p>\n<p>(Title is from Powerful by Ellie Goulding/Major Lazer.)</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>\n<a href=\"https://leslieknopeismyshiningstar.tumblr.com/\" rel=\"nofollow\">leslieknopeismyshiningstar on Tumblr</a>\n</p>",
  "text": "<p>“Whoa,” Stiles breathes, trying to keep his voice down. He jerks his chin toward the tall guy at the other end of the hallway, who’s staring down at a sheet of paper with a furrowed brow. “Who the hell is that?”</p>\n<p>He could be a teacher, honestly, with that level of facial hair—more than Stiles will likely be able to grow in his lifetime, ever—but considering the backpack and the stack of textbooks under his arm, he’s probably a student.</p>\n<p>“I think that’s the new kid,” Kira whispers back. “Darren. Derek. Daryl. Something like that, my dad mentioned it.”</p>\n<p>“Is he a senior, too?” Stiles asks. “He must be, he looks like 22.”</p>\n<p>“I think so.”</p>\n<p>Immediately intrigued, Stiles hums. The guy is hot as hell, sure—leather jacket <em>and</em> glasses, Jesus, be still his poor, bisexual, beating heart—but more importantly, it must really suck being new on the first day of senior year.</p>\n<p>“We’re adopting him,” he decides, tugging Scott and Kira by the elbow in that direction. “Let’s go.”</p>\n<p>Stiles strides across the hall, narrowly dodging a terrified-looking pack of freshman girls, and walks right up to the guy, who looks up and seems surprised that someone’s actually talking to him.</p>\n<p>“Hey!” He tries to pitch his voice as cheerful but not <em>too</em> manic. Probably a lost cause. Whatever. “You’re the new kid, right?”</p>\n<p>“Uh, yeah.” He still looks a little wide-eyed behind those glasses, and it’s not a bad look. “Yeah, I am. I’m Derek.”</p>\n<p>“Nice to meet you, <em>Derek</em>,” Stiles says, enjoying the way the name sounds coming out of his mouth. “I’m Stiles. This is Kira, and this is Scott.”</p>\n<p>“Hi,” Derek says. He shoots them all a tight, slightly cautious smile that shows off fucking <em>bunny teeth</em>, and yeah, Stiles is done for. He shakes his head a little and tries to recalibrate. Helpful new friends, right.</p>\n<p>“This is your schedule, I presume?” he asks as he tugs the piece of paper out of Derek’s hands. He doesn’t wait for Derek’s response before he starts to scan the page. “Okay, let’s see...ooh, look at all those AP courses. So you’re smart,” he says appreciatively, and Derek chuckles a little, looking down as his cheeks flush.</p>\n<p>“I guess.”</p>\n<p>“<em>Awesome</em>. I could use some more competition for valedictorian. I mean, there’s Lydia, of course, and a couple of the new exchange students, apparently, though I’m not sure they should really count. But yeah, anyway, we need fresh blood.” Derek blinks at him, clearly surprised by his tangential rambling, but Stiles just barrels on. He’ll get used to it. “Looks like you’re in AP physics and calc with me, Spanish with Scott, and history with Kira. Plus, we all have the same lunch period. That’s pretty good.”</p>\n<p>The warning bell rings right above their heads, signaling two minutes until first period, and Derek winces. “Uh, physics now, right?”</p>\n<p>“Yep,” Stiles confirms, rocking back on his heels and jerking his chin to the left. “Other wing, so let’s book it. You need to go to your locker?”</p>\n<p>Derek shakes his head, and Stiles just barely manages to resist grabbing him by the elbow. He should probably let the guy get used to his presence before he starts with the constant personal space invasion.</p>\n<p>“Bye, Derek!” Kira calls out cheerfully from behind them, and Derek waves over his shoulder.</p>\n<p>“She’s aggressively nice,” Stiles says, and Derek laughs. “It’s almost scary.”</p>\n<p>“Good to know. What about Scott?”</p>\n<p>“Equally nice, but in more of a puppy-dog, nonthreatening way. They’re together, obviously.”</p>\n<p>“Obviously,” Derek repeats dryly, and Stiles gives him a look. “What about you?”</p>\n<p>“I’m not a part of their relationship, if that’s what you’re asking,” he says, and Derek snorts.</p>\n<p>They reach their physics classroom, which is full of students milling among the long lab tables. Stiles bites his lip. It’ll be a bit of a risk, but he’s going for it.</p>\n<p>“You wanna be lab partners?” he whispers.</p>\n<p>Derek eyes him, a little smirk twisted on his lips. He’s got very expressive eyebrows, and Stiles is quite pleased to see that he’s apparently got a bit of snark to him. “You sure you’re smart? What if you’re just trying to take advantage of me?”</p>\n<p>Stiles somehow manages to swallow down his response to <em>that</em> and instead smirks back, bumping their elbows together. “Well, now, you’ll just have to trust me, won’t you?”</p>\n<p>Derek mutters something under his breath that Stiles doesn’t catch. He hasn’t actually answered the lab partner question, Stiles realizes, but just then Derek grabs him by the shoulder and pushes him down into a chair at a lab table smack-dab in the middle of the room. Stiles resists the urge to smile as he pulls a notebook from his backpack.</p>\n<p>“You know anything about the teacher?” Derek asks, leaning close, and Stiles shakes his head. He tries to remember what words are. Derek smells <em>really</em> good, fuck. Is it his deodorant? His shampoo? More investigation is clearly required.</p>\n<p>“Uh, no, not really,” he says lowly. “I think she’s supposed to be good, if somewhat of a hardass. But literally <em>anyone</em> on planet Earth would be better than Harris in chemistry last year, so...”</p>\n<p>Derek grimaces as he sits back in his chair, and Stiles can finally breathe. “Glad I missed it.”</p>\n<p>The first day of school is as boring as usual—here’s the syllabus, keep up with the reading, watch out for pop quizzes, etc., etc.—and Stiles meets back up with Derek at lunchtime to lead him to their usual table.</p>\n<p>Stiles emits a sound of envy when Derek pulls a brown paper bag from his backpack. “Oh, man, a packed lunch.”</p>\n<p>Derek frowns a little as he takes out what seems to be a peanut butter-banana sandwich. “What, is that weird? Do people not do that here?”</p>\n<p>“Oh no, you’re totally fine, I’m just jealous. It’s better than whatever the hell this is,” he says, poking dubiously at what he’s assuming are chicken nuggets. Seriously, how can the cafeteria mess up chicken nuggets? “I like to bring mine, when I actually remember.”</p>\n<p>“So how was your morning, Derek?” Kira asks cheerfully, and Derek gives her another one of his tight smiles.</p>\n<p>“Fine. Even though I’m not sure about my physics lab partner,” he says, his tone impressively dry as he tilts his head just a touch toward Stiles.</p>\n<p>Scott and Kira laugh, and Stiles feigns a gasp. “Oh, you asshole. I’m gonna stick you with all the shitty sections of the lab reports.”</p>\n<p>Derek snorts. “I’d like to see you try,” he says, and Stiles rolls his eyes, trying to hide how enamored he is with this guy already.</p>\n<p>“Okay, time for your first lesson in BHHS sociology. Those are popular kids, obviously,” Stiles says, jerking his chin toward the table in the middle of the cafeteria. “The redhead is Lydia. My aforementioned competition for valedictorian. Also, student body president, prom queen, etc. She and I are actually friends, somehow, but mostly only for school stuff. The unfairly handsome guy next to her is her boyfriend, Jackson. He’s a <em>douche</em>, but he’s our lacrosse captain, so—”</p>\n<p>“You guys play lacrosse?” Derek asks.</p>\n<p>“All three of us!” Kira says.</p>\n<p>“On the men’s team,” Scott adds, clearly proud, and Derek looks impressed.</p>\n<p>“Wow. That’s awesome.”</p>\n<p>“Kira’s better than me,” Stiles admits freely, and the smile Derek shoots him definitely looks fond. “What about you? You <em>definitely</em> look like you play sports.”</p>\n<p>Derek looks down at his food. “Nah. I run and lift weights and stuff—”</p>\n<p>“Obviously,” Stiles cuts in, before he can stop himself. Shit, that might have been too much. Derek doesn’t really react, though.</p>\n<p>“But other sports aren’t really my thing,” he finishes.</p>\n<p>“Just don’t let Finstock see you.” Stiles gestures at Derek with his fork. “He’ll get one look at those biceps, and suddenly you’ll find a lacrosse stick in your hands.”</p>\n<p>Jeez, Stiles has <em>got</em> to get his mouth under control. Thankfully Isaac drops down across the table from them, next to Scott. “Whose biceps are you talking about this time?”</p>\n<p>“Not yours,” Stiles shoots back, glaring at him. He’s still adjusting to Isaac and Scott’s sudden best-bro-ship, it’s fine. “Derek, this is Isaac and Boyd and Erica,” he says, nodding to them as they all sit down in a line, like usual. “This is Derek, he’s new.”</p>\n<p>The three of them wave, grunt, and smirk, respectively. “Are you talking about the game on Friday?” Isaac asks.</p>\n<p>“What game?” Derek asks, turning to Stiles just as he’s forcing down a mouthful of something dry that’s apparently masquerading as a cookie. He coughs.</p>\n<p>“Our first lacrosse game is Friday night.” He holds his hand over his mouth to avoid spraying Derek with crumbs. “Against our biggest rival. It’s kind of a big deal.”</p>\n<p>“You should come, Derek,” Erica says suddenly. She leans forward, resting her chin in her palm and giving him one of her slow grins. “You can sit with me while we watch these guys play.”</p>\n<p>“Uh, okay,” Derek says. He shifts a little in his chair but doesn’t really respond to her beyond that, and Stiles feels weirdly protective. Erica’s attention can be a little overwhelming to someone who doesn’t know her.</p>\n<p>She winks at Stiles, and he frowns. He never really knows if she’s with Boyd and/or Isaac—or neither and therefore possibly interested in Derek, because who wouldn’t be? But she nudges his foot under the table. <em>For you</em>, she mouths, and Stiles rolls his eyes.</p>\n<p>The conversation has drifted off to something that happened in Derek and Scott’s Spanish class, which they share with Isaac, and Stiles tunes out, not listening to what they’re saying in favor of staring at Derek, hopefully surreptitiously.</p>\n<p>He seems to always look a little bit guarded, a little on edge, and Stiles just wants to, like…wrap him in a blanket and give him a hug. Or something.</p>\n<p>Fuck.</p>\n<p>Back when Stiles figured out that he was probably-slash-definitely bisexual at the tender age of 16, he adopted Danny as his gay Yoda—Danny <em>hated</em> that nickname, it was pretty hilarious. He was helpful, though. They snuck into Jungle together, though Stiles didn’t really like the scene as much as Danny did. Somewhat-anonymous sex held zero appeal to him, it turned out. He lost his hand job virginity to Danny and had fooled around a little with a couple other guys, but that was it.</p>\n<p>But one of the things Danny told him—along with lessons in how to correctly apply a condom and a lecture on the importance of lube—was the despair of crushing on a straight guy. <em>I mean, you’ll do it</em>, Danny said at the time, clapping him on the shoulder with an earnest look in his eye. <em>But it sucks, man.</em></p>\n<p>And now it looks like Stiles has his own test case. He knows better than to assume that everyone is straight, obviously, but statistically most people <em>are</em> straight. He hasn’t gotten any sort of vibe from Derek, either—not that Stiles is good at that sort of thing, though, at least according to Danny.</p>\n<p>Something nudges his elbow. “Yeah,” he says loudly, snapping to attention and blinking rapidly. Derek’s frowning at him, looking a little concerned with his cute eyebrows.</p>\n<p>Wow, if Stiles is thinking cute thoughts about Derek’s <em>eyebrows</em>, he really is screwed.</p>\n<p>“The bell just rang,” Derek explains, and Stiles looks around. Sure enough, the cafeteria is a mass of humanity, with everyone bottlenecking at the three trashcans like usual—seriously, why can’t the school spring for more trashcans?</p>\n<p>“Right.” He refocuses again and draws his attention back to Derek. “Give me your phone?”</p>\n<p>Derek’s frown gets deeper, but he obediently shoves his hand in his pocket and drops his phone in Stiles’ hand. “Okay.”</p>\n<p>Stiles taps away, entering his number and quickly taking a ridiculous selfie of himself to save as the contact photo. “So you have my number now,” he explains. “Text me so I have yours.”</p>\n<p>He hands it back with a blinding smile, and Derek smiles back, if a little more hesitantly. But it’s fine—friendship by force usually works for him. It’s how he got Scott.</p>\n<p>Derek steps over the threshold and takes a greedy deep breath, inhaling the familiar, comforting smell of <em>home</em> and <em>pack</em>. It always takes a little while for him to get used to the overwhelming crush of scents at school, and the first day is the worst.</p>\n<p>Cora pushes past him with a huff and drops her backpack in the foyer before flouncing into the den, and he drifts after her. His mom is at the desk, typing at her laptop, but she smiles warmly at them and lowers the screen when they walk in.</p>\n<p>“Hey, guys. How was the first day?”</p>\n<p>Cora shrugs and yanks her phone out of her pocket as she falls down onto the couch. “Fine, I guess.”</p>\n<p>His mom throws Derek a commiserating, exasperated look, and he gives her a little smile. Cora wasn’t talkative with him either on the drive home. “Just fine? How’s the new school?”</p>\n<p>“Fine,” she says again, messing around on Snapchat or Instagram or whatever new app the young kids are onto now. Derek <em>already</em> feels old, how is that even possible? “My history teacher seems cool.”</p>\n<p>“That’s nice to hear. What about you, Derek?”</p>\n<p>“Classes are good. Made a friend,” he says, even though it makes him sound eight instead of 18.</p>\n<p>“Oh, yeah?” his mom asks. Her eyes light up in surprise, and Derek can’t blame her, really. He’s not exactly known as a people person.</p>\n<p>He nods. “He’s in a couple of my classes. Showed me around, introduced me to some people, stuff like that.”</p>\n<p>“What’s his name?”</p>\n<p>“Stiles.”</p>\n<p>“Stiles who?” she asks, pretending to be casual, and Derek sighs. He deserves the suspicion, sure, but he’s looking forward to having his parents’ unconditional trust again. Someday.</p>\n<p>“Stilinski, I think,” he says, and she hums.</p>\n<p>“Stilinski…that’s the Sheriff’s name, if I’m remembering right. Can’t be that many Stilinskis in town.”</p>\n<p>Derek shrugs. “Dunno.”</p>\n<p>Their conversation is apparently scintillating enough for Cora to peel herself away from her phone. “Is he tall? Brown hair, moles?” she asks suddenly, her eyes glinting, and Derek hesitates.</p>\n<p>“Yeah, why?”</p>\n<p>“I overheard him talking about you outside my English room,” Cora says, and their mom frowns.</p>\n<p>“Cora,” she admonishes, “we’ve talked about that, that’s rude.”</p>\n<p>Cora rolls her eyes—the perfect picture of a petulant 15-year-old—but Derek freezes. His biggest fear is that Stiles was nice to him just because Derek…<em>has grown into his looks</em>, as his mother likes to say.</p>\n<p>“What—what’d he say?” he asks, trying not to sound like he cares. And probably failing.</p>\n<p><em>Definitely</em> failing, if Cora’s smirk is anything to go by. She doesn’t mention it, though, because sometimes she isn’t the worst. “He just said that he bets it’s hard being new for senior year. Told some girl to be nice to you, I don’t know who. He said you were cool, for some reason, so <em>he’s</em> obviously not cool.”</p>\n<p>She rolls her eyes and Derek huffs. “He’s cool,” he says lamely, defending Stiles. “He plays lacrosse.”</p>\n<p><em>Whatever</em>, Cora mouths, and he frowns at her.</p>\n<p>“Well, he sounds very nice. You should have him over sometime, Derek,” his mom says, with that tone that suggests it’s more of a <em>demand</em> than a suggestion. He nods dutifully. “Time for chores. Who’s helping me in the garden, who’s helping dad in the kitchen?”</p>\n<p>“Kitchen,” Derek answers quickly, before Cora can get a word in edgewise. He can hear a lot of people outside in the yard—Peter and his kids, at the very least—and after a full day of having to be at least marginally social, he’d rather hide out with his dad in the kitchen and avoid people for as long as possible. Cora starts to complain, but Derek doesn’t stick around for that and heads to the kitchen.</p>\n<p>“Hey, kid,” his dad says, without turning around as Derek steps through the arched doorway to the kitchen, and Derek snorts. His dad is human, but they all swear that after so many years together, he’s absorbed some of his wife’s enhanced senses.</p>\n<p>“Hi, dad.”</p>\n<p>“You survive the first day?”</p>\n<p>“Yeah,” he says, wincing. “Too many people trying too hard on the first day and wearing too much perfume and cologne.”</p>\n<p>His dad laughs. “Yeah, well, they’ll probably stop making an effort by the end of the week.”</p>\n<p>“God willing,” Derek mutters, as he washes his hands. “How many are we cooking for tonight?”</p>\n<p>“Everybody,” his dad answers, and Derek grimaces. <em>Everybody</em> means the whole pack, and that’s a lot.</p>\n<p>“What’s the occasion?”</p>\n<p>His dad shrugs. “Just everyone’s first day of school, I think. Your mom’s idea.”</p>\n<p>“Of course,” he says with a laugh. His mom’s always up for any kind of family gathering. “How can I help?”</p>\n<p>“Finish chopping those potatoes,” he says, pointing with his knife. “And then make brownies.”</p>\n<p>Derek nods and gets to work. His dad is great for many reasons, one of which is that he never pushes Derek to talk. They’re happy to work side-by-side in silence, and Derek works through the stack of potatoes easily. His dad is the main chef in the family, and he’s been teaching Derek ever since he was tall enough to stand on a stool and see over the counter. He loves it now, likes sequestering himself in the kitchen and working with his hands to make something that the whole family will share.</p>\n<p>He dumps the potatoes onto the baking sheets, as instructed, and starts carefully flipping through their cookbook of family recipes to find the peanut butter brownies that are Cora’s favorite.</p>\n<p>He’s just about done with the batter, stirring in the flour, when he hears the distinctive pitter-patter of light steps coming into the kitchen.</p>\n<p>“Derek!”</p>\n<p>“Hey, squirt.” He stoops to pick up Maggie when she crashes into his legs, and she clutches at his shoulder.</p>\n<p>“Stop calling me squirt,” she complains, squirming in his grip. “I turned six last week, remember?”</p>\n<p>“Of course I remember, I was there.” The combined racket of two dozen five- and six-year-olds hyped up on sugar was a noise he wouldn’t soon forget. “What about Robbie, can I still call him squirt?”</p>\n<p>Maggie’s eyes light up, as they always do when confronted with the opportunity to bug her brother. “Yeah! He’s eight minutes younger than me.”</p>\n<p>Derek hides a smile. Yes, and she never lets any of them forget it. “So how was kindergarten?”</p>\n<p>“<em>Super</em> cool,” she enthuses. “Mr. Lopez is really nice, and he let me lead the whole class out to recess.”</p>\n<p>“Wow,” he says, eyes comically wide. It’s good that someone is nurturing Maggie’s bossy side, at least.</p>\n<p>“What’re you doing?”</p>\n<p>“Making brownies. You wanna help?”</p>\n<p>She nods, wrapping her arm around his neck, and Derek shifts her to a more comfortable position on his hip as he hands her a measuring cup. “Chocolate chips, please.”</p>\n<p>He holds the big bag as she plunges the cup into it, and <em>most</em> of the chocolate chips actually make it into the bowl. He helps her stir the thick batter and then sets her back down so he can scrape it into the pan and put it in the oven.</p>\n<p>“How long until we can eat them?” Maggie asks, sitting down in front of the oven once it’s safely closed.</p>\n<p>“Not till after dinner,” Derek says, and he laughs at the anguished noise she makes in response. He swoops her up again, making her squeal, and slings her over his shoulder. “Where’s your dad?”</p>\n<p>“Outside,” she says, tugging on Derek’s hair in an attempt to steer him in that direction. He winces.</p>\n<p>“At your service,” he says under his breath. They run into Peter just inside the French doors, and Maggie makes a happy noise, leaning off Derek’s shoulders until Peter grabs her.</p>\n<p>“Derek and I made brownies!” she crows, and Peter gives her an appropriately impressed look. With Maggie’s attention now firmly fixed on her father, Derek takes the opportunity to duck away.</p>\n<p>He detours to grab his camera from the den before joining everyone in the backyard. There are various aunts and uncles and cousins out there, and he answers several rote questions about his first day of school. Once he feels satisfied with his level of interaction, he wanders further into the woods and picks up his camera, snapping random shots of the trees against the fading sky.</p>\n<p>It’s as soothing as it always is, and Derek slowly relaxes. He loves his family, of course, more than anything, but sometimes he feels a little bit out of place. Somehow he missed out on the loud, friendly gene and ended up quiet and somewhat gruff instead. He doesn’t feel unloved or anything, far from it, but especially after the events of the past year, there’s a little distance there that he doesn’t know how to overcome.</p>\n<p>Stiles <em>loves</em> lacrosse. He loves being part of the team, working hard enough that it actually makes him tired at night, and of course, actually being good at something. He and Scott both started playing in middle school, and after years of hard work, making first line at the beginning of last year is one of his biggest accomplishments.</p>\n<p>“Stilinski!” Finstock yells. “Get your head in the game, don’t make me bench you.”</p>\n<p>Stiles winces. Okay, he loves lacrosse as long as he isn’t busy worrying about whether or not the guy he has a crush on is in the stands. God, he’s such a cliche.</p>\n<p>Derek <em>said</em> he was going to come—both when Erica asked him on Monday and then again when everyone was talking about it at lunch today—but each time Stiles sneaks a look over his shoulder to scan the stands, he doesn’t see him. And he <em>thought</em> he was being subtle about it, but clearly not, if Finstock noticed.</p>\n<p>There’s only a few seconds left in their timeout, so Stiles tunes out when Finstock starts discussing a play that he knows by heart. He checks again, just one more time, and…<em>ah-ha</em>! He finally spots Derek, sitting near the front next to Lydia. Well, that’s—that’s definitely weird. Erica’s on his other side, though, and Stiles has a few precious seconds to worry over what they’re talking about before Finstock blows his whistle, making everyone jump.</p>\n<p><em>Stop thinking about Derek</em>, he scolds himself as he pulls his helmet back on and jogs out onto the field.</p>\n<p>Beacon Hills wins, and Stiles is fairly pleased with himself—he played most of the game and scored two goals, got an assist on another.</p>\n<p>The field fills with students after the game, and Stiles worms through them all, accepting random congratulations and pats on the back along the way, until he spots Derek.</p>\n<p>“Hey,” he says, slightly breathless as he skids to a stop in front of him. “You came.”</p>\n<p>“Of course,” he says, with a little smile. “Nice job, by the way.”</p>\n<p>Stiles hopes his face is still flushed enough from the game to cover any possible blush. “Thanks.”</p>\n<p>He staggers at the sudden heavy weight on his back, and he twists his head to see Danny, who plants a smacking kiss on his cheek. “Nice job, Stilinski.”</p>\n<p>Derek stiffens a little bit, stuffing his hands in his pockets, and Stiles really hopes it isn’t because of the blatant guy-on-guy action. That would be a little bit of a problem.</p>\n<p>“Ugh, Danny, you’re heavy,” he complains, wiggling in an attempt to dislodge him until he finally slides off. “Hey, everyone’s going to Paulie’s. You should invite Ethan.”</p>\n<p>Danny snorts and jerks his chin toward the far side of the field, where the other team is sullenly packing up their bags. “Somehow I don’t think he’ll be in the mood to celebrate.”</p>\n<p>“That’s why you need to cheer him up!” Stiles punches him lightly in the chest. “If you know what I mean.”</p>\n<p>Danny rolls his eyes. “Everyone <em>always</em> knows what you mean.”</p>\n<p>“Part of my charm,” Stiles says, with a shrug and a wide grin. “Hey, you know the new kid, right? Derek?”</p>\n<p>“Yeah, hey,” Danny flashes the infamous dimples, and Derek looks impressed, as anyone should. “I don’t think we’ve ever been officially introduced, but we’re in the same English class, right?”</p>\n<p>“Uh, yeah,” Derek says with a little nod. “Nice to meet you.”</p>\n<p>Derek seems relaxed now, so if he’s bothered by the whole gay thing, he does a good job at hiding it. Danny moves along, grinning at the next unsuspecting person, and Stiles runs a hand through his sweaty hair.</p>\n<p>“So he’s dating someone on the other team?” Derek asks.</p>\n<p>“Yeah,” Stiles says, laughing. “Our biggest rival. When Jackson found out, he didn’t talk to Danny for like a week, I swear. He takes lacrosse a little too seriously.”</p>\n<p>“You’re not, uh, dating someone on the other team, are you?”</p>\n<p>Stiles grins. “No. Good joke, though.” Derek blinks at him for a second, clearly trying to parse that one out, then blushes when he realizes what he said. Stiles takes mercy on him and keeps talking. “We’re all going to Paulie’s, that little diner in town—you should come.”</p>\n<p>“Uh, sure,” Derek says, with that adorable little cute smile of his, and Stiles internally fist pumps.</p>\n<p>“Awesome. Everyone’ll probably head out in 10, 15 minutes or so. Be right back.”</p>\n<p>Stiles gives Derek an awkward knock to the shoulder and sprints off to the locker room to shower as fast as possible, not wanting to keep Derek waiting a second longer than he has to. Part of him is definitely worried that he’ll just disappear. He ignores everyone celebrating in the shower—it is <em>so </em>homoerotic, sports are so weird—and pats himself dry in a hurry, grimacing as he pulls clothes on over his still-damp body.</p>\n<p>He’s panting a little by the time he finds Derek again, sitting at the edge of the bleachers and playing with his phone, and Derek frowns up at him. “You okay? Your face is really red.”</p>\n<p>“Oh, yeah,” he says airily, trying to surreptitiously fan himself. “Just, you know, warm.”</p>\n<p>Scott jogs past him, and jostles Stiles’ shoulder without stopping. “Hey, buddy,” he calls out over his shoulder, “we’re taking your Jeep!”</p>\n<p>Stiles just stands there, baffled, as he watches Scott, Kira, and Isaac hop into the Jeep and speed off.</p>\n<p>“Do you guys share a car?” Derek asks, and Stiles shakes his head.</p>\n<p>“No, we most certainly do not. He doesn’t have a car, though, so I gave him a key for <em>emergencies</em>—a decision I’m quickly beginning to regret. I’m gonna make that fucker pay for gas now, though,” he says, and Derek laughs. He tips his head in the direction of the parking lot.</p>\n<p>“You want a ride, then?”</p>\n<p>“Yeah,” Stiles says, blowing out a breath. “Yeah, that’d be great, thanks. Sorry.”</p>\n<p>Scott is an <em>asshole</em> who totally planned this—Stiles probably shouldn’t have waxed poetic about Derek’s dumb pretty face over text a couple days ago—and Stiles hasn’t decided yet whether he’s going to punch him or hug him.</p>\n<p>He decides on <em>hug</em> when he sees Derek’s car.</p>\n<p>“Whoa,” Stiles breathes, running his hand lightly over the hood. “You have a Camaro? How did I not notice that before? This is a sick car.”</p>\n<p>“My sister and I share it, technically,” Derek admits. “But since she’s away at college…”</p>\n<p>“Nice,” he says as he drops into the passenger seat. “Where does she go?”</p>\n<p>“She’s a junior at Berkeley.”</p>\n<p>“Cool. That’s, uh, where I want to go, actually,” Stiles says, stumbling a little over his words. Not many people know that.</p>\n<p>“Me, too,” Derek says, giving him a little sideways look. “I’m actually—I’m going to visit her in a few weeks. You could come if you want, if you want to see the campus or whatever.”</p>\n<p>Stiles’ jaw drops. “Wow, dude, really? That would be awesome.”</p>\n<p>Derek nods and ducks his head, busying himself with turning the key in the ignition. The engine makes a glorious rumbling sound, and Stiles maybe moans a little bit.</p>\n<p>Derek raises an eyebrow at him, and Stiles flushes, trying to think of something else to talk about, besides the fact that he might be a little turned on by the combination of Derek and his car and Derek <em>in</em> his car. “So, uh, do you have other siblings?”</p>\n<p>Derek nods absently as he carefully backs out of the lot. “Yeah, Cora. She’s a freshman. What about you?”</p>\n<p>“Nope. Only child. Can’t you tell?”</p>\n<p>“What are only children supposed to be like?”</p>\n<p>“Independent, high-achieving, self-motivated,” he recites, grinning broadly when Derek rolls his eyes.</p>\n<p>“Oh, yeah?” he says dryly. “Then I’m not sure I believe the whole birth order theory.”</p>\n<p>“Really? You seem like a typical middle child to me.”</p>\n<p>Derek opens his mouth, then closes it again. “I’m not sure whether I should be offended by that or not,” he says finally, and Stiles laughs.</p>\n<p>“No, dude, I totally meant it as a good thing. You’re like, chill.”</p>\n<p>“<em>I’m like, chill</em>,” Derek mocks, in a frankly terrible impression of Stiles’ voice, and Stiles laughs again.</p>\n<p>“And a bit of an ass,” he admits.</p>\n<p>“But it’s the only way to get <em>noticed</em>,” Derek says, pulling an exaggerated sad face.</p>\n<p>“Oh, I’ll bet,” Stiles says, mock-serious. “How was it, growing up in between two sisters?”</p>\n<p>“They’re both evil,” he says immediately. “I got conned into playing a lot of dress up when I was a kid. There were a lot of tea parties.”</p>\n<p>Stiles makes a pleased noise. “At least there’s two siblings I could bribe for baby pictures.”</p>\n<p>Derek grimaces. “I wasn’t a cute kid,” he says, and Stiles can’t hold back his huff of surprise.</p>\n<p>“Yeah, I don’t really believe you. Clearly, the only solution is for me to see the pictures.”</p>\n<p>Derek rolls his eyes, and Stiles laughs at him for the rest of the drive to the diner.</p>\n<p>The lacrosse team has commandeered several booths in the back corner, and Stiles nods at Danny, who’s sitting with Ethan, Lydia, and Jackson. Jackson attempts to trip him on his way by, and Stiles responds by kicking his shin. “Stilinski. You didn’t <em>completely</em> suck tonight.”</p>\n<p>“More goals than <em>you</em>,” he counters, and Jackson makes a face. “Oh by the way, do you know Derek?”</p>\n<p>Jackson frowns and gives Derek a little considering glance, probably pissed that he’s no longer the most handsome guy at Beacon Hills High. “No, I—”</p>\n<p>“Good,” Stiles interrupts, grabbing Derek by the elbow to steer him away. “He’s too nice for you.”</p>\n<p>Derek chuckles as they head toward the next booth, which already has Scott, Kira, and Isaac squeezed into one side. “He’s charming.”</p>\n<p>“He’s kind of an ass, but he’s harmless, really. It’s mostly just habit now, the two of us bitching at each other.”</p>\n<p>Stiles follows Derek into the empty side of the booth, and he shoots Scott a glare and a pointed nudge under the table for ditching him. Scott just gives him that floppy grin, though, and Stiles rolls his eyes.</p>\n<p><em>You’re welcome</em>, Scott mouths.</p>\n<p><em>Fuck off</em>, Stiles mouths back.</p>\n<p>“Hello, losers,” Erica announces as she strides up to their table and sits next to Stiles. It’s a tight fit when Boyd slides in after her, but Stiles doesn’t exactly complain about being pressed up fully against Derek.</p>\n<p>“Sorry,” Stiles whispers to him, now squished up against the wall, but Derek shrugs and doesn’t seem to mind.</p>\n<p>“You’re <em>wel-come</em>,” Erica sing-songs softly in his ear, but Stiles just glares at her, too, and doesn’t dignify that with a response. Is his crush that obvious? Did everyone take a vote and decide to gang up on him?</p>\n<p>Not that he’s complaining. Right now, at least. Derek’s thigh feels <em>solid</em> where it’s pressed up against Stiles’, and basically his entire attention span has narrowed down to all the places that they’re touching. They’re about the same height, which means their shoulders line up perfectly, and Stiles has to forcibly keep himself from leaning into the heat of Derek’s body.</p>\n<p>“So what brings you to Beacon Hills, Derek?” Scott asks after they order, and Stiles perks up. Somehow, that hasn’t yet been a topic of conversation.</p>\n<p>Derek tugs his water glass closer and takes a long sip before shrugging carefully. “I grew up in Beacon Hills, actually. We moved to the San Diego area before I started high school, for my dad’s job. Then my parents decided they wanted to move back.”</p>\n<p>“Right before senior year,” Kira says with a wince. “That’s rough.”</p>\n<p>Derek shrugs again, his thigh shifting against Stiles’. “It’s fine. My sister is starting high school now, so it’s a good time for her.”</p>\n<p>The waiter stops by with their food then, interrupting Stiles before he can ask more prying questions.</p>\n<p class=\"messagebody\">\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>Dude, this calc problem set is gonna be the death. Of. Me. <span class=\"x1F601\"><span class=\"hide\">*grimacing emoji*</span></span></span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Derek: </b></span>Yeah, seriously. Is this stuff even in the book?</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>No, I’m pretty sure she just made it up.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Derek: </b></span>We could work on it together?</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>YES PLEASE. <span class=\"x1F64C\"><span class=\"hide\">*raised hands emoji*</span></span></span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>Tomorrow after school? I don’t have lax practice, for once. We can go to my house.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Derek: </b></span>That's good.</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>Awesome.</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>(Also. Up your emoji game, man. Come on.)</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Derek: </b></span><span class=\"x1F620\"><span class=\"hide\">*angry face emoji*</span></span></span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span><span class=\"x1F44D\"><span class=\"hide\">*thumbs up emoji*</span></span></span>\n</p>\n<p>Derek snorts and slides his phone back in his pocket. He always at least tries to obey the no-phones-at-the-dinner-table rule, and even when he fails, he’s better than Cora.</p>\n<p>“What’s so funny?” his mom asks, and Derek shakes his head.</p>\n<p>“Just texting with Stiles. Is it okay if I go over to his house after school tomorrow to work on calculus?”</p>\n<p>His mom frowns for a second, and Derek tries to keep his expression as neutral as possible. “Yes, of course,” she says finally, her face softening. “Just let me know if you’re staying there for dinner, okay?”</p>\n<p>“Welcome to <em>casa de Stilinski</em>,” Stiles announces, holding the door open with a flourish, and Derek snorts as he walks by him. It’s smaller than his own house, for sure, but it’s neat and homey, clearly lived-in with a relaxed feel. “Or as I like to call it, the bachelor pad.”</p>\n<p>Derek frowns. “What about your—”</p>\n<p>He cuts himself off awkwardly when Stiles winces. Well, shit.</p>\n<p>“Yeah.” He toys with the strap of his backpack as he carefully closes and locks the front door. “My, uh, my mom passed away, a while ago.”</p>\n<p><em>Double shit</em>. Derek feels like a total dick. “That really sucks,” he offers. “I’m sorry I brought it up.”</p>\n<p>“It’s okay,” Stiles says. He smiles, but it looks forced. “You didn’t know. C’mon, we can spread out our stuff at the kitchen table.”</p>\n<p>They work for a little while, making frustratingly incremental progress, until Stiles groans and shakes his head. “Okay,” he says, pushing back from the table. “I need brain fuel. Study snacks?”</p>\n<p>Derek snorts. “We’ve only been at it for 15 minutes.”</p>\n<p>“Fine, Mr. Smarty Pants,” Stiles says, flicking an eraser at Derek that he neatly dodges. “See if I share my snacks with you now.”</p>\n<p>Derek drops his pencil and stretches. “What do you have?”</p>\n<p>Stiles hums and squats down in front of the kitchen sink, oddly. He leans forward to rustle through the cabinet, behind a stack of paper towels, and Derek tilts his head as the motion makes Stiles’ shirt ride up, revealing a strip of skin and the black band of his boxers. “Uh, your standard plethora of unhealthy snacks that I have to hide from my dad,” he says as he turns around, and Derek jerks, averting his eyes. “Sunchips, Pop-Tarts, Oreos.”</p>\n<p>“I could go for a Pop-Tart,” Derek admits, and Stiles nods solemnly.</p>\n<p>“Solid choice, my man, solid choice,” he says, then stills as he reaches back into the cabinet. “Unless you’re one of those heathens who only likes strawberry or something.”</p>\n<p>Derek pulls a face. “S’mores is the only acceptable flavor.”</p>\n<p>“Dude,” Stiles exclaims as he shows him the box. “Same, it’s fate.”</p>\n<p>He rips open a package and pops both pastries—though that’s a real stretch of the word, to be honest—into the toaster. Derek spots paperwork on the counter next to him, emblazoned with the logo of Beacon County, and the dots connect in his head.</p>\n<p>“Your dad’s the Sheriff, right?”</p>\n<p>Stiles snorts. “Yeah. Did kids at school warn you?”</p>\n<p>“What? No,” Derek says, confused. “My mom recognized your last name.”</p>\n<p>“So it doesn’t bother you?” he asks, and Derek frowns.</p>\n<p>“Why would that <em>bother me</em>?”</p>\n<p>Stiles shrugs and plucks the Pop-Tarts out of the toaster, sucking briefly at his fingertips after he drops them on a large plate. “Kids can be dicks about it. Think I’m a narc or whatever.”</p>\n<p>Derek rolls his eyes. “High school kids are dumb.”</p>\n<p>“<em>You’re</em> a high school kid,” Stiles says. He rejoins Derek at the table and sets the plate between them.</p>\n<p>“Yeah, well, I’m not dumb,” he retorts. Not dumb <em>anymore</em>, at least.</p>\n<p>“Good comeback,” Stiles says, with an overwrought wink, and Derek rolls his eyes. “But no, it’s cool. My dad’s the fuckin’ best, I don’t care if it makes me unpopular.”</p>\n<p>Derek frowns as he takes a bite of his Pop-Tart. He doesn’t yet have a full grasp of the Beacon Hills High social strata, but he knows that Stiles isn’t <em>un</em>popular. He says as much, and Stiles shrugs.</p>\n<p>“I guess. But Scott and I were nobodies until we got good at lacrosse. And even now it’s—I mean, I like lacrosse and all, but it’s not like my entire life revolves around who scored the most goals against Riverside and who scored the most <em>chicks</em> at Jackson’s party, you know? It’s like…I just want to shake them all and yell <em>this doesn’t matter</em>. And…sorry.” Stiles winces and mimes zipping his lips shut. “You really didn’t need such a deep dive into my psyche, I’m sure.”</p>\n<p>“No, no, I get it.”</p>\n<p>Stiles snorts and gives Derek a very pointed once-over. “Like you’ve ever had to worry about being popular.”</p>\n<p>Derek flushes all the way up to his hairline and ignores that part. “I—I agree with you, that all that shit doesn’t matter.”</p>\n<p>Stiles tilts his head and gives him a considering look. He opens his mouth to say something, but they’re interrupted by the front door. Derek didn’t even hear the car pulling up, Jesus.</p>\n<p>The Sheriff walks in, in his full uniform, and drops a hand on Stiles’ shoulder. He’s looks stern but also kind, and he instantly reminds Derek of his mother.</p>\n<p>“Hey, son,” he says, then narrows his eyes just a bit as he looks at Derek. “Hello.”</p>\n<p>“Dad, this is Derek Hale,” Stiles says absently, his eyes still on the paper in front of him. “The new kid.”</p>\n<p>“Nice to meet you, Sheriff,” Derek says. He stands and holds out his hand, and Stiles laughs.</p>\n<p>“Oh my god a <em>handshake</em>,” he says. “My dad is going to love you.”</p>\n<p>Derek flushes, and the Sheriff scowls at Stiles as they shake hands. “And what’s wrong with appreciating people with manners, huh?” he says to his son, then turns back to Derek. “Nice to meet you, as well, Derek. I take it my son has forced his friendship on you?”</p>\n<p>“<em>Da-aad</em>,” Stiles whines, rubbing at the back of his neck as he drops his head. “Seriously? Come on.”</p>\n<p>Derek laughs. “I was worried about being new for senior year, but Stiles seems to have it taken care of.”</p>\n<p>“People are <em>lucky</em> to be friends with me,” he mutters. He looks down at his textbook again, and Derek taps his foot with his own under the table. Stiles shoots him a tiny smile, and Derek returns it.</p>\n<p>“I know,” his dad says fondly, ruffling Stiles’ hair. “I’m gonna go nap for a little bit before dinner. I might have to go out again later.”</p>\n<p>Stiles frowns. “Again?”</p>\n<p>“Jake’s on paternity leave, remember? I’m gonna have some extra shifts over the next few weeks. Have fun, guys, good luck with the homework. And if you go upstairs, be sure to leave the door open,” he says, and Stiles winces.</p>\n<p>“Oh my god, Dad, seriously,” he groans, but his dad just smirks at him and heads for the stairs. Stiles grumbles to himself and stares intently at their problem set. “Sorry ‘bout that. Telling him I was bi was an awful idea. Now he doesn’t trust me with anyone, ever.”</p>\n<p>He has a tentative look in his eye, as if he’s not sure how Derek will react, and he racks his brain for something reassuring to say that isn’t <em>I might be bi, too</em>. “My sister didn’t tell our parents that she was a lesbian until she was 17. She had <em>sleepovers</em>,” he says, grimacing, “with her girlfriend all the time before then.”</p>\n<p>Stiles cracks up. “Oh, man, that is positively genius. I can’t lie worth <em>shit</em>, though, so that probably wouldn’t have worked for me. Plus, you know,” he says, jerking his head toward the stairs, “the sheriff. Built-in lie detector.”</p>\n<p>“Believe me, Laura is a <em>very </em>good liar,” Derek says with a snort. Talk about built-in lie detectors. He’s actually a little terrified of her. “Alarmingly good.”</p>\n<p>They get back to calculus and after a couple hours, have managed to work through most of the problem set.</p>\n<p>Stiles shoves his textbook aside and drops his head, resting his cheek against the table. “I don’t think I can go on,” he says plaintively, closing his eyes, and Derek laughs.</p>\n<p>“It wasn’t <em>that</em> bad.”</p>\n<p>“Oh, yes, it was,” Stiles counters. “I need a break before we finish. TV?”</p>\n<p>Derek nods. “Sure.”</p>\n<p>They move to the living room, and Derek goes to sit down on the couch when he notices a large woven basket, filled with what looks like yarn, on one of the cushions. With one eyebrow quirked, he turns to Stiles, who flushes.</p>\n<p>“Oh. It’s embarrassing.”</p>\n<p>“I’m sure it’s not,” Derek assures him.</p>\n<p>Stiles scratches at the back of his neck. “I, uh, I knit? Sometimes? It’s weird, I know.”</p>\n<p>“That’s not weird,” he says, shrugging. He’s a fucking <em>werewolf</em>, it takes a lot for him to find something weird. “How’d you get into it?”</p>\n<p>“My mom liked to knit,” Stiles starts, and Derek winces. He opens his mouth to say that Stiles doesn’t have to talk about it, but Stiles waves him off. “I had to go to therapy after she died. Anxiety, ADD, the whole shebang, and the therapist recommended that I try knitting. It calms me down because it’s repetitive, it gives me something to do with my hands when the ADD is bad, and it gives me a connection to my mom. Triple whammy, I guess. It really works, though.”</p>\n<p>“Wow,” Derek says, impressed. He pokes through the basket. The yarn is soft, even against his sensitive skin, and there’s a lot of it. “That’s so cool. What do you do with it all?”</p>\n<p>Stiles shrugs. “Gifts, mostly. Please expect a hat for Christmas.”</p>\n<p>“Looking forward to it,” Derek says seriously. He comes across a tiny hat and snorts, holding it out to Stiles. “I’m not sure this one’ll fit.”</p>\n<p>He smiles. “Yeah, sometimes I make hats and blankets for the babies down in the NICU.”</p>\n<p>Derek inhales sharply and looks at the hat again. It fits neatly in the palm of his hand. “Jesus.”</p>\n<p>“I know, right,” Stiles says, carefully picking up the hat and spinning it on one finger. “Okay, this is depressing. TV? What d’you wanna watch?”</p>\n<p>Derek shrugs. “Don’t care.”</p>\n<p>Stiles flips channels until he lands on a random sitcom. He chuckles at a dumb joke along with the laugh track, idly chewing at his thumbnail, but Derek is too preoccupied with their position to pay much attention. The couch isn’t small, but there’s only about three inches of space between them. Who sat down last? Derek can’t remember, shit.</p>\n<p>He’s a little…<em>startled </em>about his feelings for Stiles. He was not expecting to have a crush on anyone anytime soon, but the other day he found himself staring at Stiles, thinking about how pleasant his laugh is and wondering if his lips would feel as nice as they look.</p>\n<p>And at the moment, he wants nothing more than to slide over those three inches and stick his nose in Stiles’ neck—he smells <em>really</em> good. Which is weird. And decidedly not friendly behavior, so Derek should probably get a handle on this whole thing before it spirals out of control. He could really use a friend right now, and he doesn’t want to do anything to screw that up.</p>\n<p>Stiles’ stomach makes an audible rumble, and he winces when Derek laughs. “Well, time for dinner, I guess. You wanna stay?”</p>\n<p>“Yeah, sure.”</p>\n<p>“You might regret that once you hear what we’re having,” he says, and Derek narrows his eyes.</p>\n<p>“Try me.”</p>\n<p>“Turkey burgers, whole grain buns, broccoli, sweet potato fries,” he recites, then lifts his eyebrows in challenge.</p>\n<p>Derek shrugs. “Fine by me. Are you the chef in the house?”</p>\n<p>“We take turns, with mostly easy stuff. Dad has high cholesterol, though, so I try to keep his diet under control. I’d like to do more, but my abilities are pretty limited.”</p>\n<p>Derek clears his throat. “I, uh, cook some. I could show you some stuff, if you want.”</p>\n<p>Stiles’ eyes light up, and Derek swears he can feel it warming his chest. Shit.</p>\n<p>“Yeah,” he says, his smile soft. “That’d be great.”</p>\n<p>“Fuck, you’re so hot,” Derek mumbles against his lips, pressing him up against the closed door in Stiles’ bedroom. Stiles tries to say <em>likewise</em> in response, but it’s difficult to get the words out when Derek is so thoroughly devouring his mouth, not to mention robbing him of the ability to even think.</p>\n<p>Stiles just groans instead and pushes harder against Derek, shifting his hips so that they’re pressed fully together. Derek slides his hand, torturously slow, from Stiles’ neck down to the waistband of his pants. He pauses there, and Stiles flails in his strong grip, biting Derek’s lower lip in retaliation. Derek laughs and <em>finally</em> slips his hand down that blessed inch, squeezing, and—</p>\n<p>Stiles jerks into full consciousness and muffles a whimper into his pillow, thrusting mindlessly against the mattress. Holy shit.</p>\n<p>He gasps, trying to orient himself to what’s actually real. His brain is <em>pissed</em>—that Derek’s not here, pressing him into the wall, or at the very least that he didn’t get farther in his dream—but his body is hopelessly turned on. He’s a healthy 18-year-old who therefore wakes up hard just about every day, but normally he can at least wait until he gets in the shower. Not today.</p>\n<p>“Fuck,” Stiles hisses, worming his hand into his boxers. It should be too dry to really be comfortable, but one, he’s leaking like a faucet, and two, he doesn’t think this is going to take very long, anyway. His dick is almost painfully sensitive, and he shivers down to his toes when he swipes his thumb over the head.</p>\n<p>Everything is hazy and warm under the blankets, and it’s easy to put himself back into the dream, so easy to imagine Derek yanking at his zipper, curving a broad hand around his dick, or maybe even dropping to his knees and—</p>\n<p>Stiles groans as he comes, curling inward and managing to catch it all in his hand to avoid messing up the sheets. He shoves the comforter down with a harsh exhale, shivering when the cool air hits his overheated skin.</p>\n<p>His crush on Derek is officially overwhelming. He just <em>likes</em> the guy, so damn much, and after today, it’s probably going to get so much worse. They’re going to the lake, along with Scott, Kira, Lydia, and Jackson, which means that Stiles is going to see Derek shirtless.</p>\n<p><em>It’ll be fine</em>, he tells himself.</p>\n<p>Stiles is <em>not </em>fine.</p>\n<p>He’s put a lot of brainpower over the past couple weeks into imagining what Derek looks like shirtless, but the reality is even better than his dreams, which isn’t exactly supposed to happen, he doesn’t think. Derek has <em>abs</em>, like a lot of them, and a very nice light layer of chest hair that Stiles just wants to rub his face against. That’s probably weird.</p>\n<p>It’s distracting enough that he barely even notices Lydia in her bikini—his crush on her might have faded over the past few years, as they became actual friends, but he still has <em>eyes</em>—and intimidating enough that he hesitates before taking off his own shirt.</p>\n<p>He’s decently ripped, he thinks, thanks to lacrosse, and his shoulders are broad, but he’s still a little gangly and definitely paler than Derek, with far less impressive chest hair. But Stiles finally just does it, taking a deep breath and stripping off his shirt, and at least Derek doesn’t run screaming or anything.</p>\n<p>“Nice tan, Stilinski,” Jackson calls out, already in the water up to his chest, and Derek sidles closer to him, doing something under the water that makes Jackson fall over with a sputter and a splash.</p>\n<p>Everyone’s laughing, even Lydia under her wide-brimmed hat, and Stiles doesn’t think before he’s splashing through the water and plastering himself onto Derek’s back. “My hero,” he croons, and Derek laughs as he hooks his hands around the back of Stiles’ knees.</p>\n<p>He moves to slide off, but Derek’s hands spasm a little bit, as if…as if he’s maybe not too uncomfortable with their current position. So Stiles takes a chance and passes it off as shifting his weight, hopefully, and slumps more against Derek. He holds his breath, anxious, but Derek doesn’t react at all as he continues talking with Scott. Stiles exhales carefully and tries to be still.</p>\n<p>“Hale!” Jackson yells. “Race, let’s go.”</p>\n<p>Derek tips Stiles off his back without a second thought. He sputters indignantly and resurfaces with a flailing splash, but Derek’s already taken off after Jackson.</p>\n<p>“Jerk,” Stiles mutters, wading out further. Scott and Kira are heading for the shallows, probably to make out or something, so Stiles swims to the floating dock a little farther out. Lydia watches him climb up gracelessly and gestures for him to sit next to her.</p>\n<p>“I think he’s competing for your affections,” she says, and Stiles grimaces.</p>\n<p>“Oh my god, shut <em>up</em>,” he hisses, hoping that the sun is a decent cover for his sudden flush. “Don’t jinx it.”</p>\n<p>She laughs and scoots over to give him some space under the umbrella.</p>\n<p>Derek seems to enjoy needling Jackson, much to Stiles’ delight, and after he’s thoroughly proved that he’s a faster swimmer, Derek hauls himself up and leans his weight on his forearms on the dock, his legs dangling. The movement makes the muscles in his shoulders bunch <em>very</em> nicely, and Stiles lets himself stare for just a second.</p>\n<p>“Don’t move,” he warns, and Derek freezes. Stiles turns around and backs toward the edge of the dock, his heels almost bumping up against Derek’s folded arms.</p>\n<p>He takes a deep breath and flings himself up and back, back-flipping into the water and landing behind Derek with a vicious splash.</p>\n<p>“That’s pretty cool,” Derek admits, and Stiles grins, scrubbing his hair out of his face.</p>\n<p>“Been practicing that move since I was 10.”</p>\n<p>“Okay, let me try,” Derek says, and Stiles hangs back to enjoy the view of Derek’s clingy swim trunks as he climbs up onto the dock.</p>\n<p>“Lydia!” he calls out. “Tell us who has a prettier back flip.”</p>\n<p>“I don’t really care about your courtship rituals,” she says with a smirk, and Stiles rolls his eyes, ducking down under the water for a second to avoid making eye contact with Derek.</p>\n<p>Derek tries to argue that his back flips are better because he can make a bigger splash, but he loses steam after Stiles points out loftily that <em>size doesn’t matter, Derek</em>. After about 10 flips, he’s feeling a little dizzy and staggers over to Lydia again.</p>\n<p>“Good to know you can show off, too,” she says under her breath. “You guys are like chimps. Next thing I know, you’ll just be presenting your asses to each other.”</p>\n<p>Derek trips, falling off the other side of the dock, and Stiles snorts as he crawls over to make sure he didn’t hit his head or anything.</p>\n<p>Scott produces a Frisbee, and after a couple hours of a viciously competitive game, Stiles hauls himself back onto the dock with a wince. It’s well past the time to reapply sunscreen, and since he can feel his skin tightening, he should probably sit under the umbrella for a little while.</p>\n<p>It’s cozy, even against the rough boards of the deck, and Stiles almost dozes off, so relaxed that he shrieks—he’d like to pretend otherwise, but it was definitely a shriek—when a wave of cold water lands on his stomach.</p>\n<p>“Jesus Christ,” he says, clutching at his chest as he rolls over on his side to face the water. “You are <em>quiet</em>.”</p>\n<p>Derek grins up at him, looking weirdly proud, and Stiles’ breath quite literally catches in his throat as the sun highlights all the different colors in his eyes. Goddamn, he’s sappy.</p>\n<p>Derek jerks his head toward the shore, where everyone else has gathered. “Everyone’s hungry,” he says. Stiles groans and rolls off the platform, slipping into the water.</p>\n<p>“Ugh, ‘m tired,” he mumbles, sliding both hands through his hair, and Derek drifts closer, turning around.</p>\n<p>“Then hop on.”</p>\n<p><em>What the fuck</em>, Stiles mouths, grateful that Derek can’t see him grinning like a loon. But he obeys, hooking both arms over Derek’s shoulders and loosely wrapping his legs around his waist. He dares to rest his head against Derek’s hair, cool under his cheek, and just hangs on as he swims back to shore.</p>\n<p>“It’s so <em>early</em>,” Stiles whines, pressing his face against the window, and Derek rolls his eyes as he backs out of the Stilinskis’ driveway. Stiles looks ridiculous, sprawled out in the passenger seat and hiding in his hoodie, and Derek is <em>screwed</em> because he thinks it’s cute.</p>\n<p>“It’s basically the same time as we would get up for school.”</p>\n<p>“Yeah, and today is a day <em>off</em>,” Stiles retorts. “Which means I shouldn’t even <em>think</em> about being awake right now.”</p>\n<p>“I can take you back home,” Derek says mildly, and Stiles winces.</p>\n<p>“No, sorry,” he says quickly. “I’m just tired. I didn’t sleep that well last night, and then my dad drank all the coffee this morning. I’m really glad you invited me, this is gonna be awesome.”</p>\n<p>Derek isn’t sure <em>why</em> he invited Stiles to go visit Laura with him, practically just after they met, but now that they’re actually friends, he’s glad that he did. Stiles is his closest friend at school, probably, and he’s trying to focus on that instead of on his growing crush.</p>\n<p>But as he swings by Starbucks on the way to the highway and enjoys Stiles’ noise of gratitude a little too much, he doesn’t think he’s doing a very good job.</p>\n<p>“You’re the best,” Stiles says under his breath, and he perks up considerably once they’ve been through the drive-through, coffee and muffins in hand.</p>\n<p>The caffeine was perhaps not the best idea for being trapped in a car with Stiles, who sings along with the radio—<em>loudly</em>—and flips stations every four seconds.</p>\n<p>“Ooh,” he says delightedly as he stops on one station and starts to sing along. “<em>In touch with the ground, I’m on the hunt down I’m after youuuuuu</em>.”</p>\n<p>Oh, god.</p>\n<p>“This is a dumb song,” Derek grumbles as he reaches for the radio, but Stiles slaps his hand away before he can touch the dial.</p>\n<p>“Dude!” he exclaims. “What the hell. Do you have something against Duran Duran?”</p>\n<p>“It’s just a dumb song,” he repeats, and Stiles rolls his eyes.</p>\n<p>“Stop being ridiculous. This is an awesome song. My mom loved Duran Duran,” he says, humming the tune. “C’mon, you gotta know the song, everyone knows this song.”</p>\n<p>“I know the song,” Derek says with a sigh.</p>\n<p>“<em>And I’m hun-gry like the wollllllf</em>,” he sings, even louder than before, and despite Derek’s attempts to contain it, his mouth twitches into the tiniest smile. Stiles spots it, though, and grins.</p>\n<p>They fight over the radio for the rest of the two-hour drive, and by the time they find a parking spot at Berkeley, Derek’s stomach hurts from laughing.</p>\n<p>“You had fun,” Stiles accuses, hooking an arm around Derek’s neck as they walk to meet Laura. “Don’t even deny it, I saw your grumpy face smiling.”</p>\n<p>“Shut up,” he mutters, shaking his arm off. He can spot Laura wading through the crowd toward them, and she’s going to give him <em>so much shit</em> about Stiles, he can tell.</p>\n<p>Laura jumps into his arms from about three feet away, confident that he’s going to catch her, and he wraps his arms around her gratefully, taking in her familiar scent. It’s only been about a month since he’s seen her, and even though they talk just about every day, it’s not the same as being with her.</p>\n<p>“Missed you, bro.” She plants a smacking kiss on his cheek before she lets herself down.</p>\n<p>“Missed you, too. This is Stiles,” Derek says, gesturing, and Stiles grins at Laura, his hands stuffed in his pockets.</p>\n<p>“Hey. Thanks for letting me crash your brother-sister weekend.”</p>\n<p>“You’ll keep us from killing each other,” Laura says cheerfully, and Stiles’ eyes go a little wide.</p>\n<p>“You—you guys seem to get along pretty well.”</p>\n<p>Laura smirks. “Yeah, well, the claws haven’t come out yet.”</p>\n<p>She winks at Derek, and he rolls his eyes as Stiles laughs. “So where are we going, oh wise one? My future is in your capable hands.”</p>\n<p>“Classes first. Anthropology and sociology,” she says, and Stiles’ eyes light up.</p>\n<p>“Awesome. Those are your majors, right? That’s what Derek said, anyway. How’d you decide?”</p>\n<p>There’s nothing Laura loves more than being an authority on something, and Derek trails behind them as they chatter away wildly about different majors and professors.</p>\n<p>Stiles is looking a little star-struck by the time they get to the lecture hall, and Derek is stupidly, irrationally jealous. He <em>cannot </em>cope with the guy he has a crush on also crushing on his sister. Just…no.</p>\n<p>“You’re not allowed to have a crush on my sister,” he leans over to say under his breath, and Stiles flails.</p>\n<p>“No, dude, no.” Stiles makes a face. “Just…no.”</p>\n<p>Derek frowns. “So she isn’t good enough for you?”</p>\n<p>“Oh my god,” he wails, covering his face with his hands, and Derek smirks. “Your sister is very attractive,” he whispers, still hiding behind his hands, “and is undoubtably a catch. But no crush, I swear.”</p>\n<p>His heartbeat is steady—no lie.</p>\n<p>“Okay,” Derek says, satisfied.</p>\n<p>Stiles has <em>way</em> too much fun in the two classes they sit in on, and Laura has to practically sit on his hands so that he doesn’t contribute to the conversation.</p>\n<p>Afterward, Stiles professes a need for more caffeine, and he insists on getting drinks for all of them as a thank you. Derek stands with Laura off to the side and idly watches him worm his way through a line of people at the coffee cart.</p>\n<p>“Thanks for having both of us,” Derek says to her. “Really.”</p>\n<p>“You know I’m always happy to have you visit. Plus, I had to check out your little crush,” she says, grinning widely, and Derek turns to gape at her. There’s no point in denying it—she’s the good liar in the family, not him.</p>\n<p>“How’d you know?” he says instead, sighing, and Laura snorts.</p>\n<p>“I <em>do</em> talk to Cora, you know. And Mom. They say you won’t shut up about him.”</p>\n<p>“Damn it,” Derek whines, and she laughs, wrapping an arm around his waist just a little too tightly.</p>\n<p>“Don’t worry. I won’t embarrass you—much. He’s cute.”</p>\n<p>Derek sighs again and leans against her just a bit. “I’m kinda still trying to deal with it. It’s surprising.”</p>\n<p>“What, why? Cause he’s a guy?”</p>\n<p>Derek frowns. “Not really. I just…wasn’t exactly expecting it. You know.”</p>\n<p>Laura’s eyes soften. She opens her mouth to say something in response, but they’re interrupted by Stiles, walking carefully as he balances three drinks in his hands.</p>\n<p>“An iced latte for the lovely lady, and a mocha for Derek. For his secret sweet tooth,” he says with a wink, and Laura bursts out laughing.</p>\n<p>Derek frowns down at his drink. “How’d you know that?”</p>\n<p>Stiles taps his temple, grinning. “I pay attention.”</p>\n<p>“I don’t think you have to worry about your crush being unrequited,” Laura says, too soft for Stiles to hear, and Derek flushes.</p>\n<p>Laura disappears in the afternoon to work on a group project, and Derek and Stiles wander the campus. They meet back up for a late dinner, and Laura offers to take them to a party.</p>\n<p>“Like a frat party?” Stiles asks, and Laura wrinkles her nose.</p>\n<p>“No, frat parties are lame. Are you interested in pledging a frat?”</p>\n<p>Stiles shakes his head. “Nah, not really. I think I’m getting my fair share of lax bros in high school, that’s plenty.”</p>\n<p>“You <em>are</em> a lax bro,” Derek points out, and Stiles gasps, pretending to be offended.</p>\n<p>“I am <em>not</em>, you take that back.”</p>\n<p>“You are literally wearing a backward snapback right now.”</p>\n<p>Stiles pouts, his shoulders slumping as he sheepishly turns his hat around.</p>\n<p>The party’s at a sprawling, somewhat-rundown house just off campus, with music and people spilling out of it.</p>\n<p>“Do <em>not </em>embarrass me,” Laura says lowly, pointing at each of them in turn. “And if anyone asks, I don’t know you.”</p>\n<p>“No falling-down drunk, got it,” Stiles says, with a mock-salute, and Laura snorts.</p>\n<p>“Yeah, like I’m gonna give the <em>Sheriff’s kid</em> alcohol. No drinking allowed, I’m serious. I’ll know if you do.”</p>\n<p>Stiles looks appropriately terrified. “I don’t know <em>how</em> she would know,” he whispers, once Laura flounces away. “But I believe her.”</p>\n<p>Derek smirks. Laura could smell a drop of alcohol on Stiles from 10 yards away, and he almost wants Stiles to drink just to see what she’d do. He’s not <em>actually</em> that cruel, though, so he just shoves Stiles in the direction of the front door.</p>\n<p>It’s overwhelming inside, loud and full of unpleasant scents. Derek can just about keep track of Stiles’ familiar heartbeat, if he tries, and he tries to focus on that to keep himself steadied.</p>\n<p>The music is loudest in the living room, where there’s a crush of people dancing, and Stiles stops right in the middle of them, suddenly enough that Derek runs right into his back. He starts wiggling his hips to the beat, and Derek winces.</p>\n<p>Oh, dear. He <em>definitely</em> can’t do this without getting hard.</p>\n<p>He lets his hands linger on Stiles’ hips for a few extra seconds as he forcibly separates them and keeps them moving toward the kitchen. He keeps a hand on Stiles’ shoulder, under the guise of staying with him as they worm through the crowd.</p>\n<p>“Just leaving me hanging like that? Harsh, dude,” Stiles says, even though he isn’t resisting.</p>\n<p>“The music sucks,” he says, which isn’t a lie.</p>\n<p>The drinks are in the kitchen, as he expected, and even though they aren’t <em>drinking</em>, Derek would really appreciate having something to hold in his hands so he isn’t tempted to do anything dumb like hold Stiles’ hand. There’s a row of soda bottles on the back counter, so Derek grabs two red cups and heads in that direction. Someone bumps against his side in what seems like a purposeful manner, and he looks over.</p>\n<p>“Hi.” It’s a girl, blonde and very pretty with thick curly hair spilling over her shoulder. She smiles at him, her eyes bright, but Derek just gives her a tight smile in response and averts his gaze, focusing on pouring. She gets the message, he thinks, because the weight moves away after a second.</p>\n<p>Another body quickly replaces her, but Derek recognizes this one.</p>\n<p>“<em>Dude</em>,” Stiles hisses, elbowing Derek right in the ribs. “You could totally hook up with a college girl.”</p>\n<p>Derek winces. “Yeah, I’d really…rather not.” Do that again, at least.</p>\n<p>“Why not?” Stiles asks plainly, and Derek shrugs, frowning.</p>\n<p>“Don’t wanna ditch you.”</p>\n<p>“S’cool, I’ll be your wingman.”</p>\n<p>Derek rolls his eyes and thrusts a cup of Coke into Stiles’ chest, holding it there until Stiles’ hand comes up to grab it, his fingers brushing against Derek’s. “I <em>just</em> said I didn’t wanna hook up with anyone.”</p>\n<p>Stiles shakes his head, wagging his finger at the same time. “Common misconception. Wingmen—wait, that sounds weird. Wingmans?” Derek lifts his eyebrows, telegraphing his utter lack of an opinion. Stiles rolls his eyes and keeps going. “Anyway. <em>People who wingman</em> are just helpful in general. You don’t wanna hook up with anyone, I’ll keep people away from you.”</p>\n<p>Derek snorts and searches in vain for a place to stand where they won’t be pressed together by the crush of people. “You think that deserves its own job title?”</p>\n<p>Stiles doesn’t seem to mind the crowd and stops in a random hallway, leaning against the wall. “Have you <em>seen you</em>?” he asks, his face twisted up in a scoff. “I should have brought caution tape or something. Or like, one of those <em>please don’t touch the art</em> signs like in a museum.” He gestures, nearly sloshing his drink onto the floor. “You know, hung around your neck on a chain.”</p>\n<p>Thank goodness it’s dark in here because it hides Derek’s blush. <em>You need your own sign</em>, is what he wants to say. “Stop being ridiculous,” is what he says instead. “What about you?” he forces himself to say. “I’m sure you could find a girl. Or a guy.”</p>\n<p>Stiles shakes his head, gnawing on the rim of the cup. “Nah. Casual sex’s not my thing, found that out already. I—man, that makes me sound like a slut. Not that being a slut is a bad thing!” he yelps. He winces and covers his eyes with his hand, slumping further against the wall. “Shit.”</p>\n<p>Derek laughs. “Relax.”</p>\n<p>The needy, curious part of him wants to press and ask questions about every aspect of Stiles’ sexual history, but he manages to restrain himself.</p>\n<p>“So,” Stiles says, looking around pointedly with his eyebrows raised. “This is a college party.”</p>\n<p>“Lots of loud, drunk people,” Derek agrees. “Not much different than a high school party.”</p>\n<p>Stiles sighs. “Yeah.”</p>\n<p>“Are you disappointed?” Derek asks, laughing, and Stiles shakes his head with a little grin.</p>\n<p>“Nah, I’ve so far managed to resist being swayed by pop culture telling me that college parties are the pinnacle of sexual expression and depravity. C’mon, let’s go outside,” he says, jerking his head. “It’s really loud in here.”</p>\n<p>Thank <em>god</em>. “Lead the way.”</p>\n<p>They end up stretched out on the grass in the backyard, and Derek wiggles his hips to slide his phone out of his pocket. The trees are different here, and he wants to capture it.</p>\n<p>As he frames the photo carefully, Stiles leans over, his chin almost resting on Derek’s shoulder. “Whatcha doing?”</p>\n<p>“Taking a picture,” he says dryly, and Stiles groans, the noise vibrating through Derek’s chest.</p>\n<p>“No shit. You like photography or something?”</p>\n<p>“Yeah,” Derek says, surprised that he’s never told Stiles. “Kind of a lot, actually.”</p>\n<p>Stiles hums and doesn’t move from where he’s rolled closer. “That’s awesome. You must have a nicer camera, though, better than your phone.”</p>\n<p>“Yeah.” He takes a couple more shots so he doesn’t have to look at Stiles. “But the best camera is the one that’s with you.”</p>\n<p>Stiles snorts and finally rolls back, out of Derek’s space. “Deep, Hale.”</p>\n<p>Laura finds them a while later and stands over them, her hands on her hips. “Are you guys <em>high</em>?”</p>\n<p>Derek shakes his head, but Stiles holds out his thumb and index finger, about an inch apart. “Just a lil’ bit, from those people smoking over there.”</p>\n<p>She sighs, but she looks fond as she steps back and jerks her head. “C’mon, this party is lame. Let’s go.”</p>\n<p>Derek hops to his feet and stretches a hand down to Stiles, hauling him up easily. “Whoa,” Stiles says, crashing against Derek’s chest and bracing a hand against his shoulder for balance. “You’re strong.”</p>\n<p>He winces—way to keep the super-strength under wraps.</p>\n<p>They walk back to Laura’s on-campus apartment, which she shares with three other girls. “My roommate is kindly spending the night with her boyfriend,” she says quietly, presumably because the door to the second bedroom is already closed, “so you guys can share her bed. The futon is shit, sorry.”</p>\n<p>“That’s cool,” Stiles says with a shrug. He rifles through his duffel bag and disappears into the bathroom.</p>\n<p>Derek turns to Laura, who’s grinning. “Seriously?” he says lowly. “Sharing a bed?”</p>\n<p>“What did you expect? And do <em>not</em> have sex with him, Derek, I swear to god. I will never forgive you.”</p>\n<p>He sputters. “I’m classier than that,” he says finally, and she rolls her eyes.</p>\n<p>“Let’s hope so.”</p>\n<p>Sharing a twin bed with Stiles isn’t the easiest—neither of them are exactly <em>small</em>, and they keep bumping elbows and shoulders as they both flip around and try to get comfortable.</p>\n<p>“Sorry, dude,” Stiles says lowly, laughter coloring his voice as they bump hips again. Derek sighs, trying to sound put-upon as he <em>accidentally </em>jabs Stiles in the ribs with his elbow. Stiles laughs again, apparently ticklish, and retaliates with a knee to Derek’s thigh.</p>\n<p>Laura’s sigh is loud from the other side of the room. “Could you two please stop flirting? Just fucking <em>cuddle</em> or whatever, I don’t care, just go to sleep.”</p>\n<p>Derek’s face <em>burns</em> in the dark, and he breathes carefully, pointedly not looking over at Stiles.</p>\n<p>“I’d let you be the little spoon,” Stiles whispers, still loud enough for Laura to hear, and Derek snorts.</p>\n<p>“My shoulders are broader.”</p>\n<p>“Oh my <em>god</em>, are you serious? No fucking way. My—”</p>\n<p>“Stop it!” Laura yells. “Right now. Go to sleep. Argue about your shoulders tomorrow, when I don’t have to hear it.”</p>\n<p><em>Stiles’ are nicer</em>, Derek thinks idly.</p>\n<p>Said shoulders are still vibrating slightly with repressed laughter, and Derek focuses on Stiles’ steady breathing as he drifts off.</p>\n<p>In the morning, Derek wakes with the startled alertness that always happens whenever he sleeps in a new place. He cranes his head, looks around—Laura’s bed is empty, but Stiles is still sacked out next to him, on his back with his thigh pressed against Derek’s. Derek lays there for a second, enjoying the shared body heat, before he starts to feel too creepy and carefully climbs out of bed.</p>\n<p>Laura’s sitting at their tiny kitchen table, flipping through a magazine and sipping a cup of coffee.</p>\n<p>“How’s <em>Stiles</em>?” she says in a sing-song voice, and he glares at her half-heartedly.</p>\n<p>“Asleep. Keep your voice down.”</p>\n<p>He steals her coffee for a sip, and she pinches him, <em>hard</em>. “Your crush is worse than I thought,” she says frankly, making Derek wince.</p>\n<p>“It’s worse than I thought, too,” he admits.</p>\n<p>“You should tell him. About us,” she says, and he snorts.</p>\n<p>“You know I can’t do that.”</p>\n<p>“Not everyone takes it badly, Der.”</p>\n<p>He scratches at his beard. “I’m pretty sure Mom won’t let me tell anyone ever again,” he says, and Laura smiles, a little sad.</p>\n<p>“I’m not saying you have to tell him <em>tomorrow</em>. Just think about it.”</p>\n<p>“Fine,” he says, just so she’ll stop pestering him about it. “It’ll probably happen by accident anyway.”</p>\n<p>Laura smirks knowingly. “You think he smells good, huh?”</p>\n<p>“So good,” he moans, burying his head in his arms. “I feel like I’m gonna die.”</p>\n<p>She laughs and runs a hand through his hair, tugging lightly. “He likes you, it is <em>so obvious</em>. So why don't you just ask him out?” Derek's face must show the utter disregard he feels for that statement, and Laura rolls her eyes. “What, you're just gonna swear off dating forever because of a couple bad eggs?”</p>\n<p>“A couple <em>bad eggs</em>?” he repeats, incredulous, but Laura just waves her hand. “And yes, that's exactly what I was planning to do, actually.”</p>\n<p>“But I get such a good vibe from him. Don't you?”</p>\n<p>“I don't trust myself anymore,” he admits, and Laura's face softens.</p>\n<p>“Well, trust <em>me</em>, then. He’s a good guy, I think you should go for it.”</p>\n<p>He swallows. “And what, just kiss him or something?”</p>\n<p>Laura rolls her eyes again, more dramatically this time. “Oh my <em>god</em>, you caveman. Actually ask him out on a date like a normal person.”</p>\n<p>“Okay,” he says, a little dazed. “I could maybe do that.”</p>\n<p>Friday brings another lacrosse game, and much to Stiles’ delight, Derek shows up <em>again</em>. Stiles plays even harder than usual, scoring two goals while again resisting the urge to look for Derek in the stands, and tries to convince himself that he’s not a cliche.</p>\n<p>There’s a party afterward this time, and Stiles follows Derek over to Lydia’s house after he successfully convinces him to come. Lydia presses a solo cup of beer into his hand almost as soon as they walk in, and he offers it to Derek.</p>\n<p>He frowns and makes an aborted motion toward the cup. “I, uh, don’t really drink.”</p>\n<p>“Oh, dude, that’s totally cool,” Stiles says, taking it back. “I rarely have more than like, two.”</p>\n<p>“The Sheriff?” Derek says knowingly, and Stiles laughs, nodding.</p>\n<p>“Exactly. Plus, I would never drive drunk, and I usually have the Jeep, so—”</p>\n<p>“So you’re a <em>responsible</em> underage drinker,” Derek says, in that delightfully dry way of his. “Good to know.”</p>\n<p>Stiles slings a playful arm around Derek’s neck and drags him further inside to make a round of the house, saying hi to a couple of people and ignoring just about everyone else. “I’m over high school parties,” he declares, after about 10 minutes, and Derek snorts.</p>\n<p>“The college party was pretty much the exact same as this,” he points out. “With maybe more sex.”</p>\n<p>“Then don’t go upstairs,” Stiles jokes, and he laughs when Derek winces. In all honestly, the party is not that great. Stiles doesn’t really care about any of these people, and there’s a group of people playing spin-the-bottle—seriously, what are they, 14? “This party is kinda lame,” he says, and Derek looks grateful as he nods.</p>\n<p>“Yeah, this isn’t really my thing.”</p>\n<p>Stiles hums as he tries to think of something else that they could do. He’s not quite ready to be done with Derek’s company, but there aren’t a whole lot of options in Beacon Hills at this hour.</p>\n<p>“Ooh, have you been to The Pie Shack?” he asks, and Derek shakes his head. “It’s this 24-hour pie place in the next town over. Wanna go?”</p>\n<p>“Why not. I could go for pie.”</p>\n<p>Stiles gives him a mock salute and hooks a hand around the crook of his elbow, under the guise of not getting separated as they worm their way out of the party. Derek seems to relax, the tight line of his shoulders loosening, as soon as they step outside and the thrum of music fades away.</p>\n<p>“Do you have a curfew?” Stiles asks, and for some reason Derek looks a little embarrassed.</p>\n<p>“Uh, not really. My parents are really big on knowing what I’m up to and who I’m with, but other than that they’re pretty cool. What about you?”</p>\n<p>“Yeah, but it’s mostly a formality. Same thing, really—if he knows where I am and who I’m with, he’s pretty flexible. Plus, he has spies like, all over town,” Stiles admits. “So I couldn’t hide much from him, even if I wanted to.”</p>\n<p>“Let me drive,” Derek says. He jerks his chin toward the Camaro on the other side of the street. “You’ve been drinking.”</p>\n<p>Stiles grins—he only had about half a cup of beer, he’s completely fine—but nods and follows Derek to the Camaro. He’s not dumb enough to turn <em>that</em> opportunity down.</p>\n<p>The 20-minute drive is mostly quiet. Stiles feels oddly calm in Derek’s presence, which isn’t exactly something that he’s ready to think about yet. He likes it, though, likes how he’s equally comfortable whether he’s chattering away, with Derek interjecting pointed, dry comments, or quiet, just staring out the window and tapping his fingers on his leg as Derek drives.</p>\n<p>The Pie Shack is moderately busy when they pull into the parking lot, just like it always seems to be no matter the day or time. Derek seems a little bit nervous and locks the Camaro about four times. Stiles pats him on the arm. “Sometimes it’s a little sketchy with the night crowd, but that’s part of the fun.”</p>\n<p>Derek grimaces when they walk in, and Stiles can’t really blame him. The place is pretty dated and shabby-looking, not really more than a literal pie <em>shack</em>, but the pies are to die for. “Just trust me,” he says, and Derek gives him a little side-eye.</p>\n<p>“Okay,” he says simply, and it somehow feels bigger than just a word.</p>\n<p>Stiles swallows to cover his reaction and steps up to the counter. “You wanna split a slice? They’re huge.”</p>\n<p>“Sure,” Derek says absently, his gaze drifting over the pies in the display case. “You pick. The only thing I don’t really like is key lime.”</p>\n<p>“The peanut butter chocolate silk pie is my favorite, that good?”</p>\n<p>Stiles slides cash across the counter while Derek’s distracted by the framed write-up in the Beacon Hills Gazette from 1987, and he frowns when he notices it.  “Hey,” he complains, but Stiles just smirks at him.</p>\n<p>“You drove here. <em>And</em> let me pick the pie.”</p>\n<p>“Fine,” Derek says, even though he still looks grumpy about it.</p>\n<p>They sit at the counter, on a pair of unbalanced, cracked vinyl bar stools, and a bored-looking waitress slides over a plate with a giant piece of pie and two forks.</p>\n<p>“Cheers,” Stiles says, holding up a fork, and Derek snorts as he taps it with his own. They each take a bite, and Stiles thoroughly enjoys watching Derek’s eyes widen in surprise.</p>\n<p>“Oh, wow,” he says after he swallows, licking his lips, and Stiles cackles.</p>\n<p>“Good, huh?”</p>\n<p>“<em>So</em> good, what the hell.”</p>\n<p>“I know, right.”</p>\n<p>Derek playfully tugs the plate closer to himself, curling one arm around it in an attempt to keep it away. Stiles groans and tugs at his arm—in vain, as it turns out, because goddamn he really is strong. Stiles ends up kind of just petting his bicep, and he pulls away when he realizes it, his cheeks flushing.</p>\n<p>Their forks battle over the last bite, but Stiles manages to shoulder Derek out of the way and steal it.</p>\n<p>“You have whipped cream on your face,” he says, and Stiles grimaces. He uses his tongue and then opens his mouth to ask if he got it, but Derek just sighs and drops off the stool, heading toward the door. Stiles quickly swipes his fingers over his mouth and jogs after him.</p>\n<p>Derek’s in kind of a weird mood on the drive back to Beacon Hills, even quieter than usual with his eyebrows drawn low, but Stiles just chatters away about their latest physics lab and movies that are about to come out and anything else that crosses his mind.</p>\n<p>Derek pulls to a stop behind Stiles’ Jeep then clears his throat when Stiles moves to unbuckle his seat belt.</p>\n<p>“Yeah?” he says, hesitating as he catches Derek’s gaze. Derek doesn’t say anything, just looks at him, but then he breaks the spell and shakes his head, scratching at his beard.</p>\n<p>“Nothing. Never mind.”</p>\n<p>“Okay,” Stiles says awkwardly, unbuckling the seat belt and getting out of the car.</p>\n<p>“Thanks for the pie!” Derek says belatedly, and Stiles lifts his hand with a grin as he jogs backward toward the Jeep.</p>\n<p>Stiles freezes, his face twisting into a grimace as he looks between Derek and the countertop. “I—I don’t know if I can do this.”</p>\n<p>Derek rolls his eyes. “It’s just chopping vegetables. Stop being dramatic, you’ll be fine.”</p>\n<p>“You probably shouldn’t insult me when I’m holding a giant knife,” Stiles mutters, and Derek presses his lips together to hide a smile.</p>\n<p>Stiles hadn’t let Derek forget about his promise to help him with some cooking tips, and they finally found an open afternoon, Thursday after school, to make an easy turkey chili.</p>\n<p>“Do you actually know how to use a knife properly?” Derek asks, and Stiles shrugs.</p>\n<p>“Eh, sorta,” he says, but his gestures with the knife are expansive enough that Derek winces and takes it away from him. Derek doesn’t have to worry about knife safety too much when he’s cooking, thanks to the whole healing thing, but his mom still tends to complain when there’s blood in the food.</p>\n<p>“Hold it like this,” Derek says, demonstrating, “and keep your fingers curled under. Just rock the knife.”</p>\n<p>Stiles is clumsy and a little slow, but he works his way through an onion and a bell pepper without too much trouble. “I thought canned vegetables were bad,” he says, frowning at the can of tomatoes, and Derek shakes his head.</p>\n<p>“No, they’re fine, especially tomatoes. Just check the sodium.”</p>\n<p>The ground turkey is browning away with the onion and garlic when Stiles’ phone vibrates on the countertop. He wipes his hands on the towel slung over Derek’s shoulder before he picks it up and snorts as he reads whatever message he got.</p>\n<p>“Your sister’s funny, dude.”</p>\n<p>Derek goes unnaturally still and only keeps stirring on autopilot. “You’re texting with Laura?”</p>\n<p>“Uh-huh,” he says absently, tapping away. “She answers all my incessant questions about Berkeley.”</p>\n<p><em>Fuck</em>. He should probably steal Stiles’ phone and make sure Laura isn’t saying anything that she shouldn’t be.</p>\n<p>“So you still like Berkeley?” he asks instead, hoping to redirect the conversation. It works, and Stiles brightens.</p>\n<p>“Yeah.” Stiles puts his phone down and carefully measuring the spices into the pot at Derek’s instruction. “Yeah, definitely still my first choice. This is probably going to put an end to Scott and I’s lifelong plan to be college roommates, but…oh, well, I guess.”</p>\n<p>“Where does he want to go, do you know?”</p>\n<p>“No, not really. He’ll probably go wherever Isaac goes,” Stiles says, sighing with a little sneer.</p>\n<p>“What’s wrong with Isaac?” Derek asks, curious. The two of them have a couple classes together and are becoming friends, Derek thinks, but he knows that he and Stiles don’t exactly get along.</p>\n<p>Stiles’ face twists again before he smooths it out. “Nothing, I swear. He’s fine,” he says, but it’s a weak lie.</p>\n<p>“No, tell me.”</p>\n<p>“You're gonna think I'm a terrible person,” Stiles warns, and strangely, that relaxes Derek. People who are <em>actually</em> terrible aren't quite so forthcoming about it.</p>\n<p>“I sincerely doubt that.”</p>\n<p>Stiles sighs. “So…Scott and I are bros for life, right? Like, we bonded hard-core in kindergarten and it’s been like that ever since. He was there when—” Stiles’ voice catches, and he swallows before he keeps talking. “When my mom died, and it’s always been just the two of us. But now, as of last year, he’s all buddy-buddy with Isaac, they hang out together all the time. And I’m just…I’m just jealous, especially because Isaac doesn’t even like me that much. It’s <em>dumb</em> as fuck, I know, but still. It doesn’t help that they live together, obviously.”</p>\n<p>Huh. Derek didn’t know that. “Why does he live with Scott?”</p>\n<p>Stiles grimaces. “Isaac’s dad’s a piece of shit drunk who used to beat him up, like a lot. Last year he moved in with the McCalls.”</p>\n<p>“So you feel bad about being jealous,” Derek surmises, and Stiles nods, frowning as he bites his lip.</p>\n<p>“I know, awful, right?” he says, shaking his head. “God. He’s had a really tough life, and I can’t even share my best friend with him.”</p>\n<p>“Well, it’s not like you wish he still lived with his dad, right?” Derek asks, and Stiles' responding look is horrified.</p>\n<p>“Oh my <em>god</em>, of course not. I'm not a monster.”</p>\n<p>Derek shrugs. “Then you’re fine. It’s natural to be jealous about something like that.”</p>\n<p>“No,” Stiles says with a snort. “I think it’s just me. I’m too possessive, I guess.”</p>\n<p>Oh, god. Derek <em>really</em> doesn’t need to think too hard about Stiles being possessive.</p>\n<p>“It’s not just you. Look, Laura and I are close, right?” he says, and Stiles nods. “Well, I was <em>such</em> a dick to her when she went off to college, as if she had the audacity to go off and make friends that weren’t me.”</p>\n<p>“Aw,” Stiles says, laughing a little as he playfully pats Derek’s cheek. “Poor baby Derek.”</p>\n<p>“See?” he says. His cheeks are flushed, he can feel it, but he ignores it. “Not just you.”</p>\n<p>Stiles takes the wooden spoon from Derek’s hand and stirs. “What about Cora? Are you guys close?”</p>\n<p>Derek hesitates. He can't exactly tell Stiles that Cora went through an intense and not entirely unwarranted phase of hating Derek's guts, one that they're still somewhat working through the ramifications of.</p>\n<p>“Kinda,” he says finally. “We're more similar, so I think that makes it harder.”</p>\n<p>“So you mean she's a grumpy nerd just like you?\" Stiles asks. He's grinning, though, and Derek can't help but smile back.</p>\n<p>“Shut up,” he says anyway, shouldering Stiles out of the way to check on the chili. “It looks good.”</p>\n<p>“Now what?”</p>\n<p>Derek turns the burner down to the lowest level and reaches around Stiles for the pot lid. “Now you cover it and let it simmer for about half an hour.”</p>\n<p>“Oh,” Stiles says, looking surprised. “That’s it?”</p>\n<p>“Told you it was easy.”</p>\n<p>“Wow. Well now I’m far less impressed with your cooking prowess,” he says, smirking, and Derek rolls his eyes.</p>\n<p>“See if I ever help <em>you</em> again,” he mutters, and Stiles bumps into him with a grin, herding him into the living room.</p>\n<p>“Seriously, thank you. This is awesome, I have one more meal to cook now.”</p>\n<p>“Well, next time you’re teaching me how to knit,” Derek says, jerking his chin toward the woven basket in the corner, and Stiles laughs.</p>\n<p>They collapse down onto the couch, practically on the same cushion, and Stiles flips channels, finally landing on a baseball game. Derek tunes out almost immediately, once again fixated on the lack of space between the two of them. Stiles <em>could </em>have taken a seat on the other end of the couch, or hell, even in the chair. Does that mean anything?</p>\n<p>This is torture.</p>\n<p>Stiles’ arm is hooked over the back of the couch, twisting his body toward Derek and showing off the hollow of his collarbone. Derek has gotten embarrassingly good at cataloguing Stiles’ heartbeat, and he’s calm right now, breathing easily. Is that a good sign? Though Derek is glad that Stiles can’t hear <em>his</em> heartbeat because he’s pretty sure it would be giving him away.</p>\n<p>Derek is still pissed at himself for chickening out last week, when Stiles was in his car. They’d been talking about that movie, the Hugh Jackman one, and it was such a natural segue, it would have been so easy for him to say <em>hey, do you wanna go out?</em> But he’d just…frozen. And then Stiles was out of the car before he could work up the courage.</p>\n<p>“Logan!” Derek blurts out, and Stiles turns to stare at him as if he’s grown an extra limb.</p>\n<p>“Uh…what?”</p>\n<p>Derek winces. This is not going according to plan. Again.</p>\n<p>“The movie,” he says with a cough, hoping it’ll clear the awkwardness out of his voice. It doesn’t work. “We were talking about it. Last week.”</p>\n<p>“Oh! Right.” Stiles nods several times as he looks at Derek expectantly.</p>\n<p>“You wanna go see it? Maybe Saturday?” he asks, and Stiles nods again.</p>\n<p>“I’m more of a DC guy over Marvel, honestly, but I heard it was good. So yeah, sure.”</p>\n<p>Well, that was easy.</p>\n<p>Stiles starts fiddling with something on his phone, his lower lip stuck in between his teeth, and he’s not at all acting like Derek just asked him out on a—</p>\n<p>Shit.</p>\n<p>Derek sighs. “I meant like as a date,” he says, forcing himself to keep his voice steady. Stiles freezes and slowly looks up from his phone. His mouth is open, and Derek drags his gaze away, back up to his eyes.</p>\n<p>“Holy…shit are you <em>serious</em>?”</p>\n<p>Derek has a lot of advantages at his disposal for reading people, and yet he still has <em>no </em>idea what Stiles is feeling right now. “Uh, yes?” he tries, and Stiles’ heartbeat skyrockets. Okay, that’s probably a good sign.</p>\n<p>“My luck is not this good,” Stiles says, shaking his head. His eyes are wide, his fingers fiddling with the hem of his shirt, and Derek relaxes.</p>\n<p>“So I’m guessing that’s a yes.”</p>\n<p>“Oh, you <em>asshole</em>,” Stiles says with a laugh, punching Derek in the shoulder, but whatever he was going to say next gets interrupted by the front door opening.</p>\n<p>They both turn their heads as Stiles’ dad comes inside, wiping his feet on the mat and shaking the rain off his jacket. “Hey, Derek,” he says, and Derek lifts a hand in response.</p>\n<p>“Hi, Sheriff.”</p>\n<p>“Damn, it smells good in here. You staying for dinner?” he asks, but Derek shakes his head as he levers himself off the couch.</p>\n<p>“No, I promised my mom I’d be home.”</p>\n<p>Stiles still looks a little shell-shocked, sitting there on the couch with his body curled toward the space Derek just vacated. He doesn’t make a move to get up, so Derek just smirks at him and waves before he slips out the front door.</p>\n<p>Derek’s phone buzzes in his pocket a few times on the drive home, but he forces himself not to check it until he’s safely parked in front of his house.</p>\n<p class=\"messagebody\">\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>Okay, if that was a joke, you are ACTUALLY the biggest asshole ever.</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>But I’m gonna give you the benefit of the doubt and assume that it wasn’t.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Derek: </b></span>It wasn't.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Derek: </b></span>You still haven't given me an answer, though.</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>Maybe I’m still thinking about it.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Derek: </b></span><span class=\"x1F641\"><span class=\"hide\">*sad face emoji*</span></span></span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>Okay, fine, I guess we can go out.</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>Since you seem really excited about it and all.</span>\n</p>\n<p>“Morning, Dad!” Stiles chirps as he practically skips into the kitchen. He drops two pieces of bread into the toaster and waits, drumming his fingers impatiently against the countertop. His dad is sitting at the table, reading the newspaper as he sips at a cup of coffee, and he gives Stiles a considering look.</p>\n<p>“What the hell is up with you?” he asks, and Stiles shrugs.</p>\n<p>“Nothing. Saturday, you know. Good day.”</p>\n<p>His dad hums, sounding suspicious, and Stiles keeps his gaze fixed on the toaster, willing it to work faster.</p>\n<p>“Any plans for the day?”</p>\n<p>“Not really.” Stiles grabs the toast as soon as it pops and winces as it burns his fingertips. “Just going to a movie tonight. Nothing big.”</p>\n<p>“Oh, yeah? With who? Scott and everyone?”</p>\n<p>Stiles swallows and very carefully spreads peanut butter on his toast as he avoids his dad’s gaze. “Uh, no. Just Derek. You know…casual.”</p>\n<p>“So, a date,” his dad says flatly, and Stiles sputters.</p>\n<p>“What?” he exclaims. A thick drop of peanut butter flings across the counter, and he swipes it up with his thumb. “No! No. Definitely not.”</p>\n<p>“But you’re going to a movie? On a Saturday night? With no one else?”</p>\n<p>His dad stares at him, one eyebrow raised, and Stiles sighs, folding like a cheap paper plate. “Yes, fine. It’s a date.”</p>\n<p>His dad’s smirking a little, that look he gets when he successfully manages to pry something out of Stiles. “Are you two dating?”</p>\n<p>“I dunno.” Stiles shrugs as he takes a bite of his toast. “It’s our first date. But, you know, hopefully.”</p>\n<p>“Well, he seems like a nice enough kid. And your curfew stands—10 on school nights, 11 otherwise. But I can be flexible if you do a good job letting me know where you are.”</p>\n<p>“Okay,” Stiles says quickly, nodding.</p>\n<p>“And do we need to have the safe sex talk again?” he asks, painfully earnest, and Stiles squeezes his eyes shut.</p>\n<p>“Oh my <em>god</em>, no,” he says, choking briefly on a mouthful of toast. “No. I’m good, I swear.”</p>\n<p>Stiles got the “standard” sex talk when he turned 13, and then again during sophomore year when he told his dad that he was bi. His dad gave him a big hug and said he loved him no matter what—overall, a very touching father-son moment. And then he came back two days later with <em>pamphlets</em>, talking about things like lube and saying things like <em>just because you don’t have to worry about pregnancy, son, doesn’t mean it’s automatically safe</em>, and Stiles would honestly just like to forget that it ever happened. “No,” he says again, wincing at the memory. “Just…no.”</p>\n<p>His dad grins, as if making his son uncomfortable is his greatest joy in life. Hell, it probably is.</p>\n<p class=\"messagebody\">\n<span class=\"breply\"><span class=\"hide\"><b>Stiles: </b></span>So…what time for that movie tonight?</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Stiles: </b></span>We are still going out, right? You said yes once, you can’t take that back.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Stiles: </b></span>(I’m just kidding. Enthusiastic consent is v important.)</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Stiles: </b></span>But please don’t take it back.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Stiles: </b></span>I’m starting to regret sending so many texts. You’re probably going to take it back now.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Stiles: </b></span>I’m cool and relaxed, I swear.</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Derek: </b></span>I’m picking you up at 7:30.</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Derek: </b></span>You can’t get rid of me that easily.</span>\n</p>\n<p>Now that that’s settled, Stiles blows out a breath and switches to his text message thread with Lydia.</p>\n<p class=\"messagebody\">\n<span class=\"breply\"><span class=\"hide\"><b>Stiles: </b></span>HELP WHAT DO I WEAR</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Lydia: </b></span>That's vague.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Stiles: </b></span>I’m going to the movies tonight with Derek. Like, as a date.</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Lydia: </b></span>Wow. I thought you guys were going to dance around each other for another three months, at least.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Stiles: </b></span>Your confidence in me is overwhelming.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Stiles: </b></span>Please please help</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Lydia: </b></span>Do NOT wear plaid, Stiles, I mean it. Wear short sleeves. He’ll either put his arm around you or offer you his jacket. It’ll make him feel all manly and important, and he’ll associate those good feelings with you.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Stiles: </b></span>Wow. Sneaky.</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Lydia: </b></span>Men are so easy to play with, it’s almost boring. Maybe I should move on to girls.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Stiles: </b></span>...</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Stiles: </b></span>I’m on a very short emotional rope right now, please don’t make it worse.</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Lydia: </b></span><span class=\"x1F644\"><span class=\"hide\">*eye roll emoji*</span></span></span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Stiles: </b></span>Which shirt?</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Lydia: </b></span>That tight dark gray one. It makes your shoulders look nice.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Stiles: </b></span>You've noticed my shoulders???</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Lydia: </b></span>This conversation is now over.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Stiles: </b></span>THANK YOU</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Lydia: </b></span>You can repay me with a description of how Derek looks naked. I want details, Stiles.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Stiles: </b></span>A gentleman never kisses and tells.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Stiles: </b></span>But thanks for the inspiration for my traditional pre-date jerk.</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Lydia: </b></span>Well, we clearly don’t have to worry about you being a gentleman.</span>\n</p>\n<p>Stiles showers—and jerks off, natch—and purposefully doesn’t leave himself enough time to second-guess what he’s going to wear. He throws on his favorite jeans and the shirt Lydia recommended, all the while trying to ignore how naked he feels without a hoodie or plaid overshirt. He thinks about doing something with his hair, but honestly, it’ll probably be better if he doesn’t even go down that road.</p>\n<p>He attempts to tip-toe past where his dad’s watching a baseball game from the couch, but he calls out without even moving his head. “Stiles.”</p>\n<p>He bites his lip with a silent curse and backtracks, hanging onto the door jamb. “Yep?”</p>\n<p>His dad twists around to look at him, and Stiles freezes. “You look nice, have fun,” he says finally, and Stiles relaxes. “Tell Derek I say hello.”</p>\n<p>“Yep, will do, thanks Dad!” he calls out, darting out the front door before his dad can demand that Derek come inside. He checks his phone, shivering as the breeze brushes over his bare arms, and doesn’t see a last-minute “just kidding, I would never date you” text from Derek. Thank god.</p>\n<p>At 7:28, Stiles spots the Camaro turning onto his street and hesitates for a second, wondering if this is going to be weird. But then he shakes his head and makes himself step forward. It’s just <em>Derek</em>, they hang out all the time.</p>\n<p>Derek glides to a stop in the driveway and looks like he’s making to get out of the car, but Stiles motions for him to stay put as he jogs over. What the hell is Derek going to do if he gets out of the car? Hug him? Open the door for him? Any and all options are awkward as fuck.</p>\n<p>So Stiles opens his <em>own </em>door, thanks very much, and plops down in the passenger seat, just like usual. He’s just going to pretend that this is one of their normal hangouts. No need to get nervous.</p>\n<p>But then he twists, gets a full view of Derek, and promptly freaks out.</p>\n<p>Derek looks <em>good</em>, even better than usual—which is saying a lot, let’s be real—in a tight purple Henley, with the sleeves pushed up to his elbows. (And one more button open than normal, Stiles thinks. He’s pretty sure he doesn’t usually see that much chest hair.) He also smells amazing, and something about his gaze is different, too—more serious, maybe. <em>Sexier</em>, definitely.</p>\n<p>Stiles attempts to swallow. Why is mouth suddenly so <em>dry</em>? “Uh, hello.”</p>\n<p>“Hi.” Derek’s gaze skates over him, pausing at his shoulders, and Stiles flushes. What the fuck is wrong with him, he usually doesn’t <em>blush</em> when Derek looks at him. He groans and covers his face.</p>\n<p>“Are you okay?”</p>\n<p>“Yep,” he says, from behind his hands, and Derek snorts.</p>\n<p>“You look nice.”</p>\n<p>“Thank you. So do you. Obviously.”</p>\n<p>“Are you nervous?”</p>\n<p>“No,” he says defiantly, dropping his hands back down into his lap.</p>\n<p>“Lie,” Derek says easily as he backs out of the driveway. Something so routine shouldn’t look so sexy, and Stiles curses him in his head.</p>\n<p>“Fuck you.”</p>\n<p>Okay, he curses him out loud, too, but Derek just laughs.</p>\n<p>Stiles feels safe in the dark, quiet shadows of Derek’s car, especially now that he has free rein to stare freely at Derek, at the sharp lines of his face as the streetlights flash past. He wishes the drive were longer, but soon enough Derek’s pulling into the movie theater parking lot and leading them inside.</p>\n<p>“I already bought the tickets,” Derek says gruffly, and Stiles grins.</p>\n<p>“Awesome, thanks,” he says, backing toward the concession line. “Then I’m getting the snacks because I don’t know about you, but I need popcorn. You want anything?”</p>\n<p>Derek trails after him and scans the candy behind the counter. “Junior Mints.”</p>\n<p>“Junior Mints, really?” He tugs his wallet out of his back pocket. “How old <em>are</em> you?”</p>\n<p>“Shut up,” Derek says, frowning at him, and Stiles laughs.</p>\n<p>Derek is surprisingly picky about where they sit in the theater, and he considers and rejects several spots before finally settling in the middle of a row near the back. Stiles promptly props his feet up on the empty seat in front of him and starts in on the popcorn.</p>\n<p>He whispers through the previews, offering pointed commentary on which movies he wants to see and which look dumb, and even though Derek doesn’t offer up many opinions of his own, he at least seems decently entertained by Stiles’ constant blathering.</p>\n<p>And then, about 20 minutes into the movie, Derek <em>actually</em> pulls the whole arm-on-the-back-of-the-seat, fake-stretch move, and Stiles can't help the little burst of giggles that erupts out of him.</p>\n<p>“What?” Derek snaps, looking adorably confused as he pulls his arm back, and Stiles waves his hand.</p>\n<p>“Nothing. Come back.” Stiles reaches for Derek’s arm, but he crosses them tightly over his chest.</p>\n<p>“Oh, no.”</p>\n<p>Stiles tugs at Derek’s bicep, but <em>damn</em> he’s strong. His arms don’t budge. “I mean, we could do it this way,” he tries instead, sitting up a little straighter before slinging his arm over Derek's shoulders, “but it’ll be <em>way</em> comfier the other way because you're like an inch taller than me, and—”</p>\n<p>Derek ducks out from underneath Stiles’ arm with a sigh and wraps his own arm around him instead. “Fine.”</p>\n<p>“Ooh, I was right,” Stiles says delightedly, wiggling as he keeps babbling in a vain attempt to distract from his nervousness. “This is much comfier.”</p>\n<p>“It was only because you looked cold,” Derek grumbles.</p>\n<p><em>Thank you, Lydia</em>, Stiles thinks.</p>\n<p>“Right,” he says mockingly. He pats Derek’s thigh and after a second, dares to leave his hand there.</p>\n<p>They don’t talk for the rest of the movie, and as they file out, Stiles catches Derek wiping his face on the shoulder of his shirt.</p>\n<p>“Did you cry?” he asks, and Derek glares at him.</p>\n<p>“It was <em>moving</em>,” he snaps. Stiles has to bite his lip to keep from laughing, just because Derek looks so affronted.</p>\n<p>“I like dudes who cry,” he says with a shrug. “So it’s cool.”</p>\n<p>Derek rolls his eyes, but he <em>does</em> take Stiles’ hand and wind their fingers together. “You, uh, wanna get some ice cream?”</p>\n<p>“Sure,” Stiles says, trying not to convey how freaked out he is by holding Derek’s hand. Not that it’s <em>bad</em>—just the opposite, actually, it’s a little freaky how normal it feels.</p>\n<p>There’s an ice cream shop in the same shopping center as the movie theater, one of those old-timey ones with stools at the counter and red vinyl booths, and Derek buys them both ice cream. They walk as they eat, strolling over to the little park across the street and discussing their upcoming calc test.</p>\n<p>“You’re making a bit of a mess there,” Derek says, pointing, and Stiles winces.</p>\n<p>He really should have learned his lesson about cones—he’s not good with messy things in the first place, and then to make matters worse, he talks too much, giving the ice cream more time to melt and causing an even bigger mess. Plus, it’s a warm night, which all in all means he has mint chocolate chip goodness dripping all down his hand and even onto his arm. He doesn’t want any to get on his jeans, so he uses his tongue to circle the bottom edge of the cone and then starts laving at his wrist.</p>\n<p>Derek growls—actually <em>growls</em>, what the fuck, that is hotter than it has any right to be—and grabs Stiles’ wrist, bringing his hand to his mouth. Stiles’ eyes go wide as Derek licks up the spilled ice cream, running his tongue along the side of his index finger and actually sucking the pad of his thumb into his mouth. By the time he finally pulls back, Stiles is pretty sure he’s forgotten how to breathe.</p>\n<p>“Payback,” Derek says, seemingly nonchalant as he licks his lips.</p>\n<p>“Oh my god,” Stiles breathes. “You know that isn’t deterring me at <em>all</em>, right?”</p>\n<p>Derek snorts and opens his mouth to say something, but Stiles can’t take it anymore and just <em>flings</em> himself toward him, landing in a clumsy kiss as Derek’s free hand comes up to steady him. It gets smoother after a second, once they get their heads tilted in the correct directions, and Stiles can’t even believe this is happening.</p>\n<p>He crowds even closer, Derek’s body so wonderfully solid against him, and searches for Derek’s free hand with his own. His hand is sticky, he knows, from spit and ice cream, but Derek tangles their fingers together anyway and squeezes. The pure sweetness of it is what makes Stiles’ breath hitch, and he has to pull back to suck in a proper breath.</p>\n<p>“Wow.” He leans back a little to look at them, small splatters of ice cream dotting their clothes and arms and hands. “We look like we have some kinda food kink or something.”</p>\n<p>Derek huffs and leans forward to kiss him again.</p>\n<p>“Is this your way of telling me that you <em>are</em> kinky? Because you know the rule, right?” Stiles says, getting the words out between breathless kisses. “You gotta disclose your kinks before like the, uh, the third date. That way I get to decide whether I want to cut ties or not. You know, depending. I’m not saying I—”</p>\n<p>Derek kisses him harder then, sucking his lower lip into his mouth, and Stiles shuts up, to encourage that behavior as much as possible.</p>\n<p>“You are…” Derek pauses, shaking his head, and Stiles snorts.</p>\n<p>“Spastic? Too talkative? Annoying as fuck?”</p>\n<p>“Pretty great,” he says instead, his face painfully earnest. Stiles swallows. Derek’s eyes are bright even in the moonlight, and Stiles is pretty sure he can’t look directly at them, they’re just too pretty.</p>\n<p>“That was—that was a very nice thing for you to say. And now I’m going to kiss you again before I say something stupid to screw it all up.”</p>\n<p>He does, and Derek laughs, this tiny exhalation of breath against Stiles’ lips that he wants to hear again and again.</p>\n<p>“For what it’s worth, I think you’re pretty great, too.”</p>\n<p>“I thought you said you were gonna stop talking,” Derek murmurs, and Stiles grins.</p>\n<p>“Yeah, that was a lie.”</p>\n<p>Stiles tosses the rest of his cone in the trash—it’s pretty much a lost cause now, anyway—and Derek bravely ducks back into the ice cream shop for a fistful of napkins. Once he determines that they’re clean enough for the Camaro, they walk back to the car, hand-in-hand, and Derek drives him home. He even lets him pick the radio station, which in Stiles’ opinion is the highest form of chivalry.</p>\n<p>He debates about whether he should direct them to a spot where they can make out some more, but before he can make up his mind, Derek is pulling into his driveway.</p>\n<p>“C’mere,” he says softly, wrapping one warm hand around the nape of Stiles’ neck and tugging him forward over the center console.</p>\n<p>Stiles goes eagerly and almost falls into Derek, bracing a hand on his thigh for balance. The muscle is hard and corded under his fingers, and Stiles shamelessly gropes him a little bit, sliding his hand down to his knee and back up with a squeeze.</p>\n<p>Something flashes in Stiles’ eyes, and while at first he thinks it’s just the clichéd <em>fireworks</em>, Derek pulls back from the kiss. The flashes are still happening, and Stiles realizes that his dad is flipping the porch light on and off.</p>\n<p>“Ugh,” he complains. “He is not subtle at all.”</p>\n<p>Derek laughs. “You better go.” He draws his nose up Stiles’ cheek, and Stiles gulps.</p>\n<p>“<em>Or</em>,” he says eagerly, “we could keep making out here and see what else he comes up with.”</p>\n<p>“I’d really rather not make an enemy of your dad on our first date.”</p>\n<p>“So since you said <em>first</em> date, does that imply that you want a second?” he asks, and Derek just gives him a look. “Well, your <em>eyebrows</em> are saying no, so—”</p>\n<p>Derek growls at him again and draws him into another fierce kiss, pulling away only after a sharp nip at Stiles’ lower lip.</p>\n<p>“Okay,” Stiles says, a little shaky. “I’m gonna go now.”</p>\n<p>Neither of them move, though, and this time it’s Stiles who closes the distance between them and kisses him again. He’s definitely going to have beard burn all over his face tomorrow, but he really just doesn’t give a shit.</p>\n<p>They finally manage to separate themselves, and Stiles waves embarrassingly as Derek backs out of the driveway.</p>\n<p>His dad’s in the kitchen, nonchalantly pouring a glass of water and doing a terrible job of pretending that he isn’t just waiting up for Stiles. “So how was your date?”</p>\n<p>“It was good,” Stiles says. He’s trying to keep his face relatively passive, but he’s probably doing a shitty job at it.</p>\n<p>His dad tilts his head. “Is that ice cream on your neck?”</p>\n<p>Stiles grimaces and slaps a hand over his neck. “Don’t worry about it!” he calls out over his shoulder as he takes the stairs two at a time. He showers off the stickiness, jerks off <em>again</em>, and falls asleep with a goofy grin on his face.</p>\n<p>Derek spends the rest of the weekend in a low-key freakout. It's not that he didn't have a good time on their date—quite the opposite, actually—but it’s actually sinking in that he really likes Stiles. That <em>should</em> be a good thing, sure, but at the beginning, he’d also liked Paige. And Kate. And neither of those turned out very well, to say the least.</p>\n<p>So he broods all day Sunday, thinking in circles about whether or not he’s stupid to be falling for someone again. But maybe <em>that’s</em> silly because for all that Stiles seemed to enjoy their date, maybe he didn’t. Maybe he had a terrible time and has no desire to see Derek again and therefore all this ruminating is for moot.</p>\n<p>See? Thinking in circles.</p>\n<p>Derek has somehow managed to keep this whole thing a secret from his parents, which he knows is a terrible idea for a variety of reasons, but he’s just not ready to talk about it.</p>\n<p>He’s not ready to talk to <em>anyone</em> about it, apparently, not even Stiles, because as soon as he catches a whiff of Stiles’ scent in the hallway on Monday morning, he darts into their physics classroom before he even spots him. Stiles strides into the classroom with a huge grin—okay, maybe he <em>did</em> have a good time on the date—but Derek just offers him a tight smile and looks back down at the homework he’s about to turn in, pretending to be proofreading for errors that he knows aren’t there.</p>\n<p>Thankfully it’s not a lab day, but they still don’t talk at all, which is definitely strange for them. Stiles’ scent slowly sours, and Derek hates himself more with every passing moment. <em>Maybe he’ll just think I’m not out yet</em>, he thinks, then wants to punch himself in the face. <em>Stiles deserves better than you. Obviously.</em></p>\n<p>As soon as the bell rings, Derek makes some terrible excuse about needing to print something out—<em>what</em>—and runs out of the room. He hides in the library during lunch—<em>coward, coward, coward</em>—and cuts out of his last period three minutes early so he can be one of the first ones out of the parking lot.</p>\n<p>So all in all, not Derek’s most courageous day.</p>\n<p>He trudges through the front door of his house and runs into his mom in the kitchen. “Don’t forget, sweetie,” she says. “You have a session with Lisa in 10 minutes.”</p>\n<p><em>Fuck</em>, he thinks, hanging his head and running a hand through his hair. “Right. I didn’t forget,” he says, knowing that his mom will hear the lie but not really caring.</p>\n<p>Lisa is his therapist. Turns out that when their son secretly dates an older woman who ends up being a literal criminal, his parents get worried.</p>\n<p>“Are you okay?” His mom puts a hand on his arm. “It seems like you’ve been a little down these past couple of days.”</p>\n<p>His parents also care incessantly about his well-being, which he supposes is equally true for kids who don’t have a history of making terrible, life-threatening romantic decisions.</p>\n<p>He nods with a little smile, so he doesn’t have to explicitly lie, and gives his mom a half-hug before grabbing an apple and heading up to his room. It wasn’t easy to find a therapist who is also in the know about the supernatural, even with his mother’s vast network, and now that they’ve moved, he talks with Lisa over Skype.</p>\n<p>Derek hated it, at first. He attempted to worm his way out of it when he turned 18, but <em>that</em> got shot down pretty quickly, with the most typical parental response of all time: “as long as you're living under our roof, you're living under our rules.”</p>\n<p>At least now he only has to talk to Lisa once a month. He likes her enough, sure, but it's still never exactly <em>pleasant</em>.</p>\n<p>They start the session and go through the standard list of questions that Derek hates—<em>no</em>, he’s not hearing voices, he swears—even though he knows she’s supposed to ask them, or whatever.</p>\n<p>She makes pleasant small talk, asking about the first month of school and what he did this weekend, and he swallows. “I went out on a date this weekend.”</p>\n<p>If Lisa’s surprised, she hides it well. “That’s great. Who’s the lucky person?”</p>\n<p>“A guy from school, Stiles. He’s—nice. Different.”</p>\n<p>“So you went out on a date with a guy you like. Why do you seem down about that?”</p>\n<p>Derek shrugs. “I like Stiles. But I liked Kate, too, so it’s hard to see this going well.”</p>\n<p>“Why’s that?” she asks with a frown, and he shrugs again.</p>\n<p>“I don’t really trust myself. I’m clearly not a very good judge of character.”</p>\n<p>She hums. “Why did you like Kate? What drew you to her?”</p>\n<p>Derek grimaces, looks down at where his thumbnail is tracing along the grain of his jeans. “I don't want to talk about that.”</p>\n<p>Lisa doesn’t respond, instead drawing out the silence to an uncomfortable length, but Derek doesn't say anything to fill it. He knows that trick.</p>\n<p>“Okay, fine,” she relents after a minute, holding up her hands. “Then what about Stiles? Does he make you feel the same way? Any of the same qualities?</p>\n<p>Derek thinks about it. Kate always made him feel like they were doing the wrong thing—sneaking around, just the two of them against the world. Which, after 16-plus years as a straight-laced kid, was fun…for a while, at least, until it very much wasn't.</p>\n<p>“No,” he says finally. “Not at all.”</p>\n<p>Later that night, after dinner, he texts Stiles a simple <em>hey</em>. It’s over an hour before he gets a response.</p>\n<p class=\"messagebody\">\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>Hey</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Derek: </b></span>I’m sorry about today, I was in a weird mood. Could we maybe meet tomorrow before school? I can apologize in person.</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>20 minutes early at my locker?</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Derek: </b></span><span class=\"x1F44D\"><span class=\"hide\">*thumbs up*</span></span></span>\n</p>\n<p>He hopes the emoji makes Stiles smile and drifts off feeling a little lighter.</p>\n<p>Derek is at school with 10 minutes to spare, so he pulls out <em>Jane Eyre</em>, for English, and slides down to the floor, leaning against Stiles’ locker.</p>\n<p>He knows as soon as Stiles pushes open the front door to the school, two corridors away, but he waits until Stiles is in sight before scrambling to his feet.</p>\n<p>“Hi,” Stiles says, giving him a tight smile, and Derek’s heart twists. He hates seeing Stiles so wary and toned-down, especially because of him.</p>\n<p>“Hey.” He thrusts out the package of s’mores Pop-Tarts that he brought as a peace offering, and Stiles laughs a little as he takes it, ripping open the foil.</p>\n<p>“Thanks.”</p>\n<p>He hands one of them to Derek, who takes a bite just to delay what he has to say. “I’m really sorry,” he says eventually. “For…for avoiding you like that yesterday.”</p>\n<p>“Yeah, that was kinda shitty,” Stiles says frankly, and Derek forces himself to nod. “Are you—do you want to go out again?”</p>\n<p>“Yes,” he says, as fast as he can get the word out. “Definitely. Do you?”</p>\n<p>Stiles nods, but it seems a little more hesitant than Derek would expect. “Are you, um…are you not out or something? Is that what the whole avoiding me thing was about?”</p>\n<p>He sighs. “No. I’ve, uh, had a couple bad relationships,” he says carefully. “And I just—got a little freaked out, I guess. Stuck in my own head.”</p>\n<p>Stiles hums around a mouthful of Pop-Tart. “But you still want to date me.”</p>\n<p>“Very much.”</p>\n<p>“Well, that’s good, because my crush on you is still, like, of epic proportions. But I’m gonna make you take me out to dinner to make up for yesterday’s emotional trauma.”</p>\n<p>“Gladly.”</p>\n<p>Stiles swallows his last bite and sucks briefly at his thumb. “Cool. You wanna go make out somewhere, then?”</p>\n<p>With a snort, Derek bends down to pick up his backpack, then laces his fingers with Stiles’. “I have a key to the darkroom.”</p>\n<p>“Ooh, really?” he says, brightening. “I’ve always wanted to go in there and see how all that works. Could you teach me?”</p>\n<p>Derek bites back a smile. “If you want, yeah.”</p>\n<p>“On second thought,” Stiles says, his gaze going a little hazy, “making out now. Teaching out later.”</p>\n<p>They end up being three minutes late to physics, and Stiles’ grin is practically incandescent.</p>\n<p>Derek never really thought he’d be a part of one of those sappy, cliched high school couples, but he and Stiles hold hands all throughout lunch and then spend almost 10 minutes saying goodbye to each other in the parking lot. It’s objectively gross, but the grin doesn’t slide off Derek’s face until he’s halfway home, when the sirens start up behind him.</p>\n<p>Fuck, fuck, <em>fuck</em>.</p>\n<p>He pulls over carefully and grimaces when the cruiser stops right behind him. Derek reaches for his wallet then freezes. Wait, he’s supposed to wait until they ask for that, right?</p>\n<p>He rolls his window down and attempts to breathe, his hands twisting on the leather of the steering wheel. The sound of boots approaching is ominous, to say the least, and the feeling gets even worse when he sees that it’s<em> Stiles’</em> <em>dad. </em>Oh, god. Stiles probably told him what a jerk Derek was yesterday, and now he’s here to kill him. Great.</p>\n<p>“Why, hello there, Derek,” he says, his voice deceptively cheery as he stoops into view, and Derek swallows.</p>\n<p>“Hi, Sheriff.”</p>\n<p>“Do you know what the speed limit is on this road, son?”</p>\n<p>“Uh, 40, sir.” He tries as hard as he can not to phrase it like a question.</p>\n<p>The Sheriff hums. “And do you know how fast you were going?”</p>\n<p>“I—I really don’t think it was above 40. Sir,” he adds.</p>\n<p>“You’re mistaken,” he shoots back. “It was 42.”</p>\n<p>Derek wants to argue—is he seriously going to get a ticket for going <em>two</em> miles over?—but he’s smart enough to know that would be a terrible idea. He nods instead, biting his lip. “Sorry, Sheriff. I won’t do it again.”</p>\n<p>He makes a little noise, scribbling on his pad, and Derek wants to <em>die</em>. His parents are going to kill him if he gets a ticket, and he needs them in a good mood before he tells them about Stiles.</p>\n<p>“All right,” he says finally. He stuffs his notepad back in his pocket and rests one arm on the top of Derek’s car. “I’m just going to give you a warning, since this is the first time I’ve pulled you over. But <em>believe</em> me, it would behoove you to drive a little bit safer when my son is in your car.”</p>\n<p>Derek blinks up at him, certain that there’s a deeper meaning hidden in there somewhere. “Uh, yes. Yes, of course, sir.”</p>\n<p>“Okay, then.” He taps the top of the car before backing away. “Have a good night, son.”</p>\n<p>“Thank you!” Derek calls out belatedly, and the Sheriff waves over his shoulder.</p>\n<p>With a harsh exhale, Derek slumps back in his seat and waits for the cruiser to pass him before he pulls out his phone.</p>\n<p class=\"messagebody\">\n<span class=\"breply\"><span class=\"hide\"><b>Derek: </b></span>Your dad just pulled me over.</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>WHAT. Oh my god, that jerk.</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>PLEASE tell me he didn’t give you a ticket.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Derek: </b></span>I was going 42 in a 40.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Derek: </b></span>No, just a warning. And a thinly-veiled threat? I think?</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>Wait, my dad just texted me a line of laughing emojis??</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>(Who the fuck even TOLD him about emojis, seriously.)</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>Wow, he’s such a jerk.</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>It was apparently a test. You passed. He approves.</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>Fuck my life.</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>Brb, yelling at him about the grievous misuse of police resources.</span>\n</p>\n<p>Stiles nearly gets brained with a lacrosse ball toward the end of practice, when his gaze drifts over to the bleachers and he sees <em>Derek</em>, leaning back on his elbows and stretched out over three steps like some sort of fucking supermodel.</p>\n<p>Once Finstock finally releases them, the rest of the team heads to the locker room but Stiles veers over to the bleachers. “Hey,” he calls out, pleasantly surprised. “What’re you doing here so late?”</p>\n<p>Derek shrugs, not moving from his reclined position as Stiles sits down next to his hip. “I had to work on a group project thing after school, so I just thought I’d stick around to say hi.”</p>\n<p>He tries to maintain his distance, cognizant of the fact that he probably reeks, but Derek wraps an arm around his waist and tugs him down.</p>\n<p>“<em>Derek</em>,” he whines. Stiles struggles in his grip and winces when his hipbone smacks against the edge of the riser. “I’m all sweaty, I smell gross.”</p>\n<p>“Nope.” He traces a line up Stiles’ neck with his nose. “Not to me.”</p>\n<p>“Weirdo,” Stiles says fondly. He cups Derek’s scruffy cheeks in his palms and kisses him soundly. They kiss for a minute, while Stiles tries to remember that they’re in a public place, on school grounds, and therefore he <em>probably </em>shouldn’t straddle Derek right now.</p>\n<p>He pulls back when the impulse gets too great, and Derek drops a hand to his hip. “So my parents want you to come over for dinner this weekend,” he says, his mouth twisted into a grimace, and Stiles freezes.</p>\n<p>“O-<em>kay</em>,” he says slowly. “That’s fine with me, but why do you look like your dog just died? Are your parents awful? Are you secretly ashamed of me?”</p>\n<p>He frowns dramatically, and Derek snorts. “No, nothing like that,” he says with a shake of his head. He hesitates. “They’re just…a little intense.”</p>\n<p>“Well now I’m officially terrified, thanks.”</p>\n<p class=\"messagebody\">\n<span class=\"breply\"><span class=\"hide\"><b>Stiles: </b></span>Is there a dress code for dinner?</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Derek: </b></span>...</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Derek: </b></span>Seriously? No, of course not.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Stiles: </b></span>I’m just checking! I don’t wanna make a bad impression on your parents</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Derek: </b></span>Just wear whatever, it’s fine.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Stiles: </b></span>Cool, so I’ll just show up naked, then.</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Derek: </b></span>I mean, no complaints.</span>\n</p>\n<p>Stiles finally decides on dark jeans with cleanish Converse and one of his nicer plain t-shirts, and he makes a pit stop for flowers on his way over. It’s a somewhat limp-looking $8 bouquet from the grocery store, but hey—he’s only 18, and his summer part-time job at the bookstore doesn’t exactly leave him rolling in dough. It’s the thought that counts, anyway, he’s pretty sure, and he’d like to make a good impression on Derek’s parents.</p>\n<p>Stiles has been on a couple dates before, but he’s never officially “dated” anyone long enough to meet their parents. He’s thrilled to be there with Derek, though, even if his weird reaction after their first date sent Stiles into a minor emotional tailspin. He was a little startled to find out that Derek has apparently had relationships that were bad enough to put him off of new ones—how is that possible, they’re only 18?!—but he <em>likes</em> Derek, a lot, and is happy to give him the benefit of the doubt. Derek has shown no indication that he wants to talk about those relationships, at <em>all</em>, but Stiles will hopefully pry it out of him sooner rather than later.</p>\n<p>He follows the directions Derek gives him and is suddenly glad for the Jeep as he bumps up the winding dirt road. He’s never actually been to Derek’s house before. Whenever they get together to do “homework”—or actual homework because they really are in a lot of hard classes—they go to Stiles’ house.</p>\n<p>He parks next to the Camaro and takes a minute in the car to calm down. “You can do this,” Stiles mutters. He wipes his hands on his jeans and grabs the flowers before he makes himself leave the safety of his car.</p>\n<p>Derek’s house is really nice, big and sprawling and all secluded in the woods. As soon as Stiles hops up onto the porch, still a good three strides from the front door, it opens, and he almost falls on his ass in surprise. He catches himself by grabbing onto the porch railing and then goes still when he looks up.</p>\n<p>All three of them, Derek’s parents and Cora, are crowded in the doorway, staring down at him, and Stiles suddenly feels not only underdressed but under…under-<em>everything</em>. They’re all as attractive as Derek and Laura, tall and dark-haired with beautiful bone structure. Derek’s dad has a beard, too, peppered with gray, and goddamn, Derek is going to be one handsome motherfucker when he’s old. That’s probably an awkward thought, and Stiles internally grimaces.</p>\n<p>Derek’s mom finally smiles warmly at him and breaks the weird tension. “Hello, there, you must be Stiles.”</p>\n<p>He coughs and lets go of his trusty porch rail, straightening up and brushing his hands on his pants before he shakes her hand and then Mr. Hale’s.</p>\n<p>“Hi, Mrs. Hale, Mr. Hale.”</p>\n<p>“Talia,” she corrects, and he nods politely, already planning to ignore <em>that</em> request. He’s making out with her son, like a <em>lot</em>, so until he knows her a little better she is most definitely Mrs. Hale. “This is my husband Aaron, and this is Cora.”</p>\n<p>Stiles shoots Cora a smile, which worryingly, she doesn’t return. He’s seen her around school, but they’ve never actually talked. He wishes that Laura were here, so at least he’d have someone else on his side.</p>\n<p>They usher him inside, and he skirts around them to stand awkwardly in the foyer. They’re all smiling at him, but it’s a little…<em>predatory</em>, almost. He smiles back, nervously, and is about to ask where Derek is when he comes trotting down the large staircase. “Hey.”</p>\n<p>“Hi,” Stiles says gratefully. He clenches his hands into fists to keep from reaching out.</p>\n<p>Derek touches his arm gently and turns them a little so that his body is shielding Stiles from the rest of his family. “Did you bring flowers?” he asks lowly, with a little smirk that probably means he’s going to make fun of Stiles at the earliest opportunity.</p>\n<p>“It’s <em>polite</em>,” he hisses, then leans around Derek to hand the bouquet to Mrs. Hale with what he hopes is a smile. “These are for you. Thank you for having me over for dinner.”</p>\n<p>“Of course, dear, thank you,” she says, taking them with a smile. “Derek, why don’t you show Stiles around? We’ll have dinner in just a few minutes.”</p>\n<p>Derek gives Stiles’ hand a reassuring squeeze and obeys. The house appears to be as nice on the inside as it is on the outside, but Stiles only gets to see the den before Derek tugs him through the mud room and out the back door.</p>\n<p>“Relax,” he says, his voice barely above a whisper, and Stiles laughs.</p>\n<p>“No promises.”</p>\n<p>“You’re fine. Everything is fine.” Derek squeezes his hand again before dropping it and cupping Stiles’ face. He kisses him, just a quick peck, and Stiles grasps at his waist. “Relax, your heart is pounding.”</p>\n<p>“God, is it that loud?” Stiles asks. He holds his hand over his chest and wills it to calm down. Derek smiles and covers his hand with his own.</p>\n<p>“Just a lucky guess.”</p>\n<p>“This is a great backyard, by the way,” Stiles says, trying to distract himself by looking around. There’s a large clearing between the house and the edge of the woods, scattered through with a couple large picnic tables and a few large trees that look perfect for climbing. “How many bones did you break falling out of those trees?”</p>\n<p>Derek smiles again and kisses him once more. “Just my arm once. C’mon, let’s go inside.”</p>\n<p>Stiles gives a longing look to the little breakfast nook off the kitchen, but they have dinner in the formal dining room. He gets to sit next to Derek and relaxes when Derek’s hand lands on his knee. He remembers to put his napkin on his lap, at least, and thankfully there’s only one fork next to his plate.</p>\n<p>Derek’s mom starts the serving with a large platter, piled high with sliced steak. “Do you like the family silver, Stiles?”</p>\n<p>Stiles blinks at her, then down at his silverware. She’s staring at him, her eyes hard, and he has no idea what he did to make her dislike him all of a sudden. “Yes,” he squeaks, then clears his throat. “It’s beautiful.”</p>\n<p>“Mom,” Derek says, sounding tired. “Leave him alone. He doesn’t…I told you already.”</p>\n<p>Stiles has no idea what <em>that’s</em> about, but Mrs. Hale hums and finishes serving everyone else.</p>\n<p>“So Derek tells us you’re interested in Berkeley?” she asks, and Stiles nods several times as he swallows. Why do people always ask questions while you’re chewing?</p>\n<p>“Yeah,” he says, after a quick gulp of water. “It’s a great school, obviously, and I’d get the benefit of in-state tuition, which would be really helpful, while staying close to my dad. I mean, if I can get in, that is.”</p>\n<p>“He got an almost perfect score on his SATs,” Derek chimes in, and Stiles whips his head around to stare at him.</p>\n<p>“How the hell did you know that? I didn’t tell you that.”</p>\n<p>Derek shrugs. “I asked around.”</p>\n<p>“About my exam scores?” he asks, raising an eyebrow, and Derek shrugs again, with a little smile.</p>\n<p>“About you in general.”</p>\n<p>“Well, now I’m scared of what you heard.”</p>\n<p>“Oh, it was all bad, I just ignored it.”</p>\n<p>Derek has that deadpan face on, the one with the eyebrows, and Stiles just rolls his eyes while everyone else laughs.</p>\n<p>“Almost a full moon,” Mr. Hale comments, leaning back in his chair to look out the window. “What do you think about that, Stiles?”</p>\n<p>“Um.” He takes a bite of his mashed potatoes to buy himself some time. “It’s pretty? My dad’s the sheriff, you know, and he always says there’s more mayhem and such on full moon nights. I don’t know if I buy that, though, I’d need to see some data.”</p>\n<p>Mr. Hale hums, swirling his wine in his glass before he takes a sip. “And how long have you been in Beacon Hills?”</p>\n<p>“As long as I can remember,” he says with a shrug. “My dad was a deputy here for a long time before he was elected sheriff.”</p>\n<p>“Any other family?”</p>\n<p>Stiles shakes his head. “Nope, not really. A few cousins scattered around that we don’t see very often, but it’s mostly just me and my dad.”</p>\n<p>That seems to put an end to their line of questioning, and they move onto the far more innocuous topics of the weather and the Giants for the rest of dinner.</p>\n<p>“Can I help with the dishes?” Stiles offers—he’s really invested in making a good first impression here—but Mr. Hale shakes his head.</p>\n<p>“It’s all right, Stiles, I can take care of it. Thank you, though.”</p>\n<p>“Derek said you two have a lab report to finish, right?” Mrs. Hale asks, and Stiles nods. “You two are excused, then. Derek, there are some cookies in the kitchen that I baked earlier.”</p>\n<p>Derek nods and hops up, seemingly as eager to escape this as Stiles is, but his mom catches his wrist as he passes behind her chair. She whispers something in his ear, and strangely, Cora starts laughing, even though she’s sitting on the other side of the table. Derek’s cheeks are red when he pulls away from her, but he doesn’t say anything in response and just ushers Stiles into the kitchen.</p>\n<p>He gestures to a glass container next to the fridge, and Stiles opens it to find a delicious-looking pile of chocolate chip cookies. He grabs several, setting them down on the plate that Derek helpfully holds out. “Your family’s a little weird,” he says lowly, and Derek winces, gesturing at him to <em>shhh</em>.</p>\n<p>“What?” he hisses. He knows how to keep his voice down, he swears, no one can hear them. “I like them, though. It’s a cool weird.”</p>\n<p>Derek rolls his eyes, but he looks fond. “Yeah, well, you would know.”</p>\n<p>“Aw, thanks, boo,” he says with a grin, and Derek rolls his eyes <em>again</em>. Twice in 10 seconds—might be a new record.</p>\n<p>“Don’t call me that,” he grumbles.</p>\n<p>“Too late, boo,” Stiles says easily.</p>\n<p>“Go upstairs.”</p>\n<p>“Ooh, yeah, baby, tell me what to do.”</p>\n<p>Derek’s eyebrows are fully set in <em>pained</em> mode, and his mouth is twisted. “Oh my <em>god</em>, stop talking,” he whispers harshly. “Please.”</p>\n<p>He hustles Stiles up the stairs and into his bedroom, where he seems to relax after he closes the door behind them. Stiles pokes around a little bit, but Derek’s room is pretty neat, with shelves stuffed with books and only a few items of clothing littering the plush rug.</p>\n<p>“Lab report first,” Derek says, snatching the plate of cookies away, and Stiles gapes at him.</p>\n<p>“Are you serious right now?”</p>\n<p>“Mm-hmm.”</p>\n<p>“Taskmaster,” he mutters, but he obediently takes his laptop out of his backpack and sits down at the desk. Derek stretches out on his stomach on the bed and they work in silence for a while, Derek scratching out calculations while Stiles starts writing their conclusion. He’s the <em>master</em> of bullshit, after all, which was basically invented for high school lab reports.</p>\n<p>Almost an hour later, Stiles climbs onto Derek’s green-and-gray comforter—because of <em>course</em> he makes his bed—and straddles his back, slumping down over him.</p>\n<p>“You’re distracting me,” Derek says under his breath, and Stiles grins into his hair.</p>\n<p>“Awesome.” He watches for a minute as Derek works, his handwriting small and neat. “You wanna know something weird?”</p>\n<p>Derek hums. “Not really, but I have a feeling you’ll tell me anyway,” he says absently, not even flinching when Stiles swats him on the back of the head.</p>\n<p>“I just wrote, like, two pages without getting distracted <em>once</em>,” he says proudly.</p>\n<p>“You took your meds today, right?”</p>\n<p>“Well, yeah, but it usually kinda wears off by now. And still—it’s not usually <em>this</em> good.”</p>\n<p>It was really weird, actually. Even with the Adderall, Stiles is used to a constant low hum of distraction, but here, sitting at Derek’s desk, it was like something switched in his brain and he’d entered another dimension, one where his brain worked like it was supposed to.</p>\n<p>Derek is still working and doesn’t seem as impressed by Stiles’ accomplishment as he should be, so Stiles huffs and rests a little bit more of his weight onto him. “I want cookies.” He drops a kiss at the nape of Derek’s neck. “Have I been good enough for cookies?”</p>\n<p>Derek snorts and finally pushes his notebook away, twisting under Stiles so that they’re face-to-face. Stiles moves to sit up—the cookies are on Derek’s nightstand, and he <em>really</em> wants some—but Derek takes Stiles’ hips in that strong grip, holding him in place. He cranes his neck up, seeking a kiss, and Stiles’ eyes light up as he ducks down that extra inch.</p>\n<p><em>Or this</em>, he thinks, humming happily. <em>This is good, too</em>.</p>\n<p>This is good, this is familiar, and Stiles slowly lets his weight slump fully onto Derek’s body. One of Derek’s legs moves to the side, hooking over the back of Stiles’ to give him more room. The added friction is amazing, and Stiles groans, the sound muffled into Derek’s mouth as he deepens the kiss.</p>\n<p>Careful not to knee Derek in the balls or something, Stiles rearranges his weight so that he has one free hand and immediately finds Derek’s arm, squeezing his bicep. Stiles is strong from lacrosse, in a wiry way, but Derek is seriously jacked and it makes Stiles a little crazy. When he gets Derek’s shirt off for the first time in bed, he’s probably going to self-combust from the hotness of it all.</p>\n<p>Stiles has come to wear his beard burn like a badge of pride, and he quickly twists his head to give Derek more room as he starts to kiss down his jaw. Derek kind of has a thing for necks, it seems like, but Stiles certainly doesn’t mind, and he takes advantage of Derek’s distraction to slide a hand up under his shirt and just sort of pet embarrassingly at his abs.</p>\n<p>He starts to ruck up Derek’s shirt, but he barely gets anywhere before he finds himself unceremoniously dumped to the side. Derek has flipped over, his face shoved into the pillow, before Stiles can even blink, and he freezes.</p>\n<p>“Hey,” he says softly after a second, resting his hand on Derek’s back. “You okay?”</p>\n<p>Derek nods and says something, but it’s too muffled into the pillow for Stiles to understand. He sits next to his hip, resting one hand on Derek’s back and using the other to scratch gently through his hair. Stiles desperately wants to pry—he knows Derek has had sex with a girl but not a guy, so maybe this is some kind of gay-sex-related freakout?—but he manages to keep his mouth shut, barely.</p>\n<p>He waits a few more minutes, until Derek shifts onto his back. “Sorry,” he says, his gaze determined even as he bites his lip. His hair is stuck up in clumps, from when Stiles’ hands had been in it, and frankly, it’s insanely adorable. “I got a little, uh, overwhelmed.”</p>\n<p>“Dude, that’s a freaking <em>compliment</em>,” Stiles says proudly, and he laughs when Derek rolls his eyes. “That little ol’ me could make you all hot and bothered.”</p>\n<p>“You’re not little,” Derek grumbles, tugging him down so they’re lying next to each other.</p>\n<p>“Yeah, and neither are you.” Stiles swings one leg over Derek’s and tucks his head under his chin. “Hey, can you reach the cookies?”</p>\n<p>Derek laughs and obediently reaches over to the nightstand.</p>\n<p>Derek lets Stiles press him up against the driver’s side door of the Jeep, but he pulls away from the kiss after only a few seconds. After all, he can’t exactly tell Stiles that his whole family is definitely listening and probably also watching.</p>\n<p>“Thanks for coming to dinner,” he says lowly, and Stiles grins.</p>\n<p>“I survived. And I don’t even think your family hates me.”</p>\n<p>“They definitely don’t.”</p>\n<p>(The bar isn’t high, but Stiles doesn’t need to know that.)</p>\n<p>“I’ll talk to you later?”</p>\n<p>“Yeah,” Derek says, unable to resist leaning forward for one more kiss. “Drive safe, text me when you get home.”</p>\n<p>“Worrywart,” Stiles teases, but he’s smiling as he gently pushes Derek back and climbs into the Jeep.</p>\n<p>Derek waits until he’s disappeared out of view and then trudges back to the house.</p>\n<p>Ideally, he would have kept Stiles a secret from his parents for a little while longer, just to avoid the scrutiny, but it’s hard to keep things from them—they keep a pretty close eye on him, anyway, regardless of his mom’s supernatural senses. They figured it out almost immediately after they started dating, and while Derek isn’t positive, he’s pretty sure that they asked Cora to spy on him at school. When they confronted him about it, politely, there were a lot of pointed, earnest looks and enthusiasm that bordered on forced. But overall, the whole ordeal has caused less strife than Derek anticipated. He hasn’t even gotten a lecture on “making good choices” yet.</p>\n<p>They’re all in the den when he enters the house, and his mom immediately smiles at him. “He seems like a very nice boy, Derek. You should invite him over again.”</p>\n<p>“I like that his dad’s the sheriff,” his dad says, without looking up from his book, and Derek snorts.</p>\n<p>“Well, I’m so glad to have your approval,” he says, and it comes out sounding a lot less like a joke than he intended.</p>\n<p>Cora looks up from her phone, and she’s got that hard look on her face that makes Derek freeze. “So you went 0-for-2 on girls and decided to try a boy instead?” she asks, her voice steely, and Derek's jaw drops.</p>\n<p>“Cora!” his mom snaps. “That was uncalled for, apologize to your brother.”</p>\n<p>She huffs and rolls her eyes, pointedly silent as she stands from the couch and heads upstairs. A door slams, loudly, and they all wince.</p>\n<p>Their mom gets up to follow her, but Derek takes a step forward instead. “No, it’s fine,” he says reluctantly. “I should go talk to her.”</p>\n<p>He trots up the stairs and stops in front of Cora’s room with a sigh.</p>\n<p>“Cora,” he says softly, tapping his knuckles on the door. “Can I come in?”</p>\n<p>He stands there for probably about 60 seconds before she finally opens the door a crack. He rolls his eyes at the dramatics and steps inside. Since privacy comes in short supply in a werewolf pack, their soundproofed rooms are their sanctuaries, and Derek doesn’t go into his sisters’ rooms very often.</p>\n<p>Cora’s back in bed already, on her phone again with her back to Derek, and he looks around. He spots a stack of textbooks on her desk and stares at it, realizing that he can’t even remember the last time they really talked.</p>\n<p>“How’s school going?”</p>\n<p>“Fine,” she mutters, and Derek grits his teeth. Without giving her time to react, he leaps onto the bed and wraps his arms around her. She lashes out immediately, elbowing him in the gut, but he doesn’t let go. “What are you doing?” she hisses, and he squeezes harder.</p>\n<p>“I’m hugging you,” he snaps back, “and I’m not letting go until you hug me back.”</p>\n<p>They scuffle for another minute, Derek wincing when Cora’s claws come out, but she finally stills in his arms. It’s quiet for a while, until she shifts and turns her face into his chest. “You're my big brother,” she whispers. “I thought you were perfect, I thought I could trust you.”</p>\n<p>Derek’s eyes are suddenly hot, and he slams them shut. “I’m really sorry,” he says quietly. “I don’t know if I ever said that to you, but I am. For everything that happened and how it affected you.”</p>\n<p>She sighs. “I’m sorry, too. Both for being a dick and for—for what happened to you. Laura told me more about what actually happened, and that’s just…so shitty.”</p>\n<p>Derek’s cheeks flush, and he’d really rather not talk about this with his baby sister. “Yeah.”</p>\n<p>“I forgive you. I know it wasn't your fault.”</p>\n<p>Derek doesn't exactly feel worthy of either of those statements, but he just hugs her tighter. “I mean—it kind of was. Everything else that happened, anyway. I know you didn’t want to move.”</p>\n<p>Cora snorts. “Don’t even start. She was…I don’t like calling girls bitches, but she was totally a bitch.”</p>\n<p>Derek swallows. “Yeah, I know.”</p>\n<p>“And I like Stiles,” she admits, and he pulls back to look at her.</p>\n<p>“Really?” he asks, skeptical.</p>\n<p>Cora nods. “Don’t tell anyone,” she warns, and Derek laughs. “But he seems good for you.”</p>\n<p>He loosens his grip, but Cora doesn’t move away immediately, just shifts so that her phone is braced on his chest. “Who are you always texting?”</p>\n<p>She’s silent for a long time, and Derek figures she’s not going to tell him. “It’s a boy,” she says finally, and his eyes light up.</p>\n<p>“I won’t tell Mom, I swear,” he says immediately, and she laughs. “Who is it?”</p>\n<p>“Like I’ll ever tell you,” she says with a snort. “You’d just beat him up.”</p>\n<p>“I would not,” he says, but it sounds weak even to his own ears. “Is he cute?”</p>\n<p>Cora wrinkles her nose. “No, we’re not doing this. Get out.”</p>\n<p>Derek rolls off the bed with a laugh—he’ll take it.</p>\n<p>He goes back to his own room and closes the door carefully behind him before falling into bed face-first and taking a deep whiff of his pillow. He should probably be embarrassed about this, he thinks idly, but it’s not a strong enough thought to make him stop.</p>\n<p>Derek <em>thought </em>he was ready to have Stiles in his room, but he sorely overestimated his own levels of restraint. Because as soon as they were in Derek’s bed, with Stiles’ pleasantly-aroused scent seeping into his sheets, there was no way Derek had enough control to fend off the shift. Blue-balling himself was a more appealing option than a conversation that Derek is <em>not</em> ready to have, and miraculously, Stiles didn’t press the issue.</p>\n<p>Derek flips over onto his back and undoes his jeans, sliding them down his hips just a bit. With the scent still so strong in his bed, all he has to do is close his eyes, and it’s so, so easy to pretend that Stiles is still there with him.</p>\n<p>Just thinking about what could have happened between them—what <em>will </em>happen between them—is enough to get him all the way hard, and once he gives into the temptation to wrap a hand around his dick, everything’s over pretty quickly.</p>\n<p>He hisses, biting his lip as he spills over his hand, and after enjoying the afterglow for a minute, he fumbles for his phone on the nightstand.</p>\n<p class=\"messagebody\">\n<span class=\"breply\"><span class=\"hide\"><b>Derek: </b></span>Please tell me you’re home.</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>Ugh, sorry I forgot to text. <span class=\"x1F641\"><span class=\"hide\">*sad face emoji*</span></span></span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>What're you up to?</span>\n</p>\n<p>Derek bites his lip and looks down at himself, thinking about it for a minute before he responds.</p>\n<p class=\"messagebody\">\n<span class=\"breply\"><span class=\"hide\"><b>Derek: </b></span>Just jerked off.</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>DUDE</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>What the fuck, man, you gotta give me some warning.</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>Holy shit. I gotta go to my room.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Derek: </b></span>Sorry for leaving you hanging earlier.</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>(I wanna make some kind of dick joke with “hanging,” but there’s like no blood in my brain right now and I can’t think of one. Fuck.)</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>Okay, first of all, you didn’t. And second, literally never apologize for that.</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>Ever.</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>But if it’ll make you feel better, you can tell me what you thought about.</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>Not that I’m lacking in inspiration. Believe me.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Derek: </b></span>Like we were before, in my bed with you on top of me, and you jerked off on me.</span>\n</p>\n<p>A reply doesn’t come right away, and Derek snorts. He peels himself out of bed to clean up, tossing the tissue in the trash after a cursory wipe-off and changing into sweatpants.</p>\n<p class=\"messagebody\">\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>Oh, Jesus Christ. I just came thinking about you thinking about that.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Derek: </b></span>You didn’t think about just doing it? That seems convoluted.</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>Fuck you, don’t criticize my jerking off process.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Derek: </b></span>Call it constructive feedback. Do you need any more tips?</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>DEREK</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>I am 18, but I’m only human. Gimme like 10 minutes.</span>\n</p>\n<p>“Holy shit,” Stiles pants. He stumbles to a stop and braces his hands on his knees. Why did he ever decide that running with Derek would be a good idea? “Hold up, I need a break. Why are you so freakishly fast?”</p>\n<p>Derek circles back and stands over him, his hands on his hips. That fucker’s barely even breathing hard. While Stiles’ face is splotchy red and pouring sweat, Derek has just enough of a light sheen to make him look even more attractive. Zero percent of this situation is fair.</p>\n<p>“I thought you’d be faster. You look fast when you’re playing lacrosse.”</p>\n<p>“Don’t be an asshole,” he warns, and Derek smirks at him.</p>\n<p>“Or what?” he asks. “You’ll chase me down?”</p>\n<p>With a groan, Stiles gives up on standing and drops down onto the ground. Derek sits next to him and leans in, but Stiles shoves a hand in his face and pushes him away. “Ugh, no kisses for you. You’re mean.”</p>\n<p>Derek bites his hand, that weirdo, and then laces their fingers together. “You’re fast,” he says, and Stiles snorts.</p>\n<p>“Yeah, not as fast as you. You should do track or something.”</p>\n<p>Derek shrugs. “Rather just hang out with you.”</p>\n<p>Stiles groans again and lays back in the grass, keeping a hold of Derek’s hand. “Now you’re just being nice because you want kisses.”</p>\n<p>“Those two things could be independent,” he argues. They sit in silence for a few minutes, enjoying the quiet, until Derek squeezes Stiles’ hand. “You ready?”</p>\n<p>“If you took off your shirt I could probably run faster,” Stiles suggests, but Derek just rolls his eyes and stands up.</p>\n<p>“You wanna keep going just a little farther? There’s a nice clearing a little ways down the trail, we can turn around there.”</p>\n<p>“Yeah, sure.”</p>\n<p>Stiles is kind of at Derek’s mercy here, anyway—he apparently knows the preserve like the back of his hand, and Stiles has literally no idea where they are. The trail is single-file here, so he falls into step behind Derek, who blessedly seems to be going a little slower now.</p>\n<p>They reach the clearing after maybe five more minutes, and suddenly Stiles feels a jolt, the shock of it nearly throwing him off his feet.</p>\n<p>“Holy shit,” he gasps, holding his hands out for balance, and Derek whirls around, frowning.</p>\n<p>“What, what is it?”</p>\n<p>Stiles has…no idea. He says as much, and Derek’s frown deepens. “I just felt this weird, uh, jolt? Or buzz or something? Super weird.”</p>\n<p>“Are you okay?” Derek asks. He steps closer with his hand outstretched, grabbing onto Stiles’ elbow, and Stiles nods. For the most part, anyway, but he takes a couple deep breaths and props his hands on his hips as he looks around. He doesn’t really see anything strange, except for some weird etchings high up on the bark of a couple of the trees surrounding them. That’s pretty typical for the preserve, though—probably dumb kids carving their initials into hearts or whatever.</p>\n<p>“You didn’t feel it?”</p>\n<p>Derek’s eyebrows are firmly set in the “concerned” position. “No. What did <em>it</em> feel like?”</p>\n<p>“Almost like I’d been struck by lightning? Or hit an electric fence? But <em>not</em>, obviously, and I’ve of course never been struck by lightning, so it’s not like I would know…”</p>\n<p>Stiles trails off at the confused look on Derek’s face and wrings his hands together before sliding them through his hair. He feels weirdly wired now, like he might just shake out of his skin. He’s been sticking to his Adderall schedule, right?</p>\n<p>“Maybe there’s a storm coming,” Derek suggests. “Sometimes that makes the air all weird. Electricity and stuff.”</p>\n<p>“Yeah,” Stiles says, nodding even as he looks up at the cloudless blue sky. “Yeah, you’re probably right.”</p>\n<p>“You wanna head back? Or sit down for a little while or something?”</p>\n<p>Stiles shakes his head. “Nah, I’m fine. Let’s go.”</p>\n<p>“You lead this time,” Derek says, gesturing to the trail, and Stiles sticks his tongue out at him on the way past.</p>\n<p>“Fine. Try to keep up, then.”</p>\n<p>They run back to the edge of the preserve, and when they reach the point where they started, Derek’s grinning.</p>\n<p>“You clearly just need a lot of time to warm up.” His arms are folded behind his head while he heaves for breath, and Stiles frowns.</p>\n<p>“What do you mean?”</p>\n<p>“You were so much faster on the way back. I had to work hard to stay with you.”</p>\n<p>Huh. Stiles shrugs and wipes his face with the hem of his shirt. He’s not even that tired, so he must be in better shape from lacrosse than he thought.</p>\n<p>“C’mere,” Derek says, reaching for him, and Stiles tries to squirm away.</p>\n<p>“Oh god, Derek, no, I’m so gross!”</p>\n<p>Derek traps him in place with his arms and noses up his neck, taking a pointed sniff. His scruff tickles, and Stiles laughs. He gives up on trying to get away, because Derek’s arms are like iron bands across his chest, and instead turns around, sliding his hands up under Derek’s shirt. Derek’s skin is damp and tacky with sweat, which should be gross but is really, really not.</p>\n<p>After five minutes of delightfully-sweaty kisses, Derek splits off to head home, and Stiles jogs back to his neighborhood. He’s <em>still</em> jittery when he gets home, and thinking about what Derek said, he checks the weather. Zero percent chance of rain and not even any clouds in the area.</p>\n<p>Weird.</p>\n<p>Stiles jerks off in the shower—in an attempt to combat the jitters as much as anything—and nearly drops his towel in surprise when he gets back to his room. It’s dark outside already, heavy clouds streaking the sky, and windy rain is pounding against his window.</p>\n<p>He huffs an incredulous laugh and shakes his head. Maybe he should be a meteorologist, he thinks wistfully. Low accountability, clearly.</p>\n<p class=\"messagebody\">\n<span class=\"breply\"><span class=\"hide\"><b>Stiles: </b></span>The Jeep is being temperamental this morning :(</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Derek: </b></span>You want a ride?</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Stiles: </b></span>Really? I’ll make it worth your while…</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Derek: </b></span>I mean, I’d do it anyway. But if you wanna bribe me, sure.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Stiles: </b></span>I’ll bring Pop-Tarts. And if you pick me up early, you can show me the darkroom again :)</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Derek: </b></span>Deal.</span>\n</p>\n<p>Derek shows up about 15 minutes early, and Stiles practically skips out to the Camaro, giddy with the thought that a little clandestine making out is probably on the horizon.</p>\n<p>“Hey.” He tosses his backpack into the backseat before plopping down in the passenger seat, but Derek just grunts in response. His jaw is clenched, and Stiles reaches out to poke it. “You okay? You seem...agitated. Or something.”</p>\n<p>Derek cracks his neck again and twists his hands on the steering wheel. “Yeah, I’m fine. Just slept weird or whatever. Sorry.”</p>\n<p>“No problem, dude,” he says easily. “I’ll just shut up.”</p>\n<p>Derek actually laughs, even though it sounds a little strained. “No, you’re fine.”</p>\n<p>Derek continues to be in a weird mood all day, grumpy and surly and reticent, but he seems fairly back to normal by the time Stiles meets him in the parking lot after school. He’s a little more physically affectionate than usual, actually, wrapping Stiles up in a hug and burying his face in his neck, but Stiles isn’t exactly complaining.</p>\n<p>“You wanna hang out?” He runs his hand through Derek’s hair, but he pulls back with a grimace.</p>\n<p>“I, uh, have to be home early tonight. It’s a family thing.”</p>\n<p>“Oh, okay,” Stiles says, trying to hide his disappointment a little. “You can just drop me off at home, then. Thanks again, by the way, for giving me a ride.”</p>\n<p>“I have maybe an hour?” Derek suggests, and Stiles grins.</p>\n<p>“Well in that case, I have an idea.”</p>\n<p>“Uh-oh,” he drawls, and Stiles punches him in the arm.</p>\n<p>“Just shut up and drive the damn car,” he says, and Derek obeys, the scowl he’s been wearing all day replaced with a tiny grin. “Hang a left up here.”</p>\n<p>“Are you directing me to a makeout spot?” Derek asks, one eyebrow cocked, and Stiles snorts.</p>\n<p>“Uh, no,” he says, with a roll of his eyes. “My dad knows all the makeout spots. This place is better.”</p>\n<p>They end up parked off the edge of a dirt road deep in the preserve, and Stiles is fairly confident that no one will stumble upon them. He looks at the bucket seats, scratching at his forehead, and Derek tilts his head.</p>\n<p>“Backseat?”</p>\n<p>“Yes, definitely.” Stiles contorts himself through the little gap between the two front seats, landing awkwardly on his shoulder. He lets out a little curse and rearranges himself so that he’s flat on his back, then looks up and sees Derek standing outside the car with the door open. “Oh. I suppose that would have been easier.”</p>\n<p>“Uh-huh,” Derek says dryly, then crawls on top of Stiles, closing the door behind him.</p>\n<p>Stiles swallows. “Hello,” he says, curling his hands into fists. Derek looks really big from this angle—imposing, almost, with his broad shoulders seemingly taking up most of the space in the backseat.</p>\n<p>“Hi,” he says softly, complete with a kiss to the tip of Stiles’ nose, and Stiles has to press his lips together to suppress a laugh. Oh, right, this is <em>Derek Hale</em>, the complete and utter puppy dog who is all bark and no bite.</p>\n<p>After drawing Derek down into a proper kiss, Stiles relaxes his hands and slides them up Derek’s chest and around his shoulders to push off the leather jacket. Derek squirms out of it, tossing it blindly down onto the floor, and then carefully sets himself back down over Stiles.</p>\n<p>He yanks at him impatiently, eager for the weight, and then seems to break some sort of spell when he nips at Derek’s lower lip. Derek exhales harshly before deepening the kiss, and Stiles grins, bending his knee to give them more room.</p>\n<p>They’ve done their fair share of making out, but Derek has never been this aggressive before—not  that Stiles is complaining, not one tiny bit. In fact, it’s really fucking hot the way Derek holds him down, practically devouring Stiles’ mouth.</p>\n<p>Stiles shifts a little bit, aligning their hips better, and yep, wow, that does <em>not</em> feel small, Jesus Christ. He grinds upward, practically on autopilot, making Derek grunt.</p>\n<p>“Is this, uh, are you—”</p>\n<p>“Yeah, yeah,” Stiles breathes, sliding his hands down to clutch hard at Derek’s ass. “Keep going, god, please.”</p>\n<p>Derek groans at that and buries his face in Stiles’ neck, the scratch of his beard making Stiles shiver. The friction is amazing, and Stiles’ blood feels like it’s boiling in his veins. But in the miracle of all miracles, Derek actually comes first, shuddering in Stiles’ arms as he pants hard in his ear. He shifts a little, giving Stiles a thigh to grind against, and holy <em>shit</em>, it’s so hard and muscled and—</p>\n<p>What Stiles hoped would be a manly groan comes out as more of a strained whimper as he arches up against Derek, then collapses in a pile of boneless goo. Derek huffs an incredulous-sounding laugh and slumps down with him, sliding to the side and wrapping a firm arm around Stiles’ waist to keep him in place.</p>\n<p>The post-orgasmic lethargy wears off after a few minutes, leaving Stiles giddy, and he muffles his laugh against Derek’s collarbone. He didn’t even get to see his <em>dick</em>, Jesus Christ, but this was still by far the hottest thing that’s ever happened to him.</p>\n<p>Derek pulls back, with the most adorable mulish frown on his face. “Are you <em>laughing</em> at me?”</p>\n<p>“At the <em>situation</em>, not you,” Stiles hurries to say. He’s all-too-aware of the delicate teenage boy ego. “Just—I was unaware that sex could be so good without taking off any clothes.”</p>\n<p>“Oh,” he says, his face smoothing out. “Uh, same.”</p>\n<p>“Smooth,” Stiles says, and Derek rolls his eyes, even as a blush spreads across his cheeks.</p>\n<p>They lay there for a few more minutes, until Derek lifts his head to look at him and grimaces. Stiles frowns—<em>hello</em>, teenage boy ego here—and opens his mouth to protest, but before he can say anything, Derek gently presses his thumb against his neck. “I’m sorry.”</p>\n<p>“For what?” he asks, instinctively craning his head before realizing that no, he obviously cannot see his own neck. Right. “Oh, did you give me a hickey?”</p>\n<p>Derek’s eyebrows do some sort of complicated dance that Stiles doesn’t follow. “I’m sorry, I should’ve asked. I didn’t even—I’m sorry.”</p>\n<p>“Aw, dude, it’s okay,” he says as he prods at his neck. It doesn’t even hurt. “I’m 18, it’ll never be more socially acceptable for me to have a hickey than it is right now. I mean, my dad’ll give me shit, but whatever. He might pull you over again.”</p>\n<p>He grins, but Derek just nods solemnly and brushes his fingers over the spot again. “Worth it.”</p>\n<p>“Weirdo,” he says fondly, and he squeezes Derek one more time before starting to squirm.</p>\n<p>“You wanna go?”</p>\n<p>“Yeah,” Stiles says, sitting up with a wince. “We probably should have thought this through a little better.”</p>\n<p>“Next time,” Derek promises, with a tiny smile, and Stiles grins. Yeah, the sticky boxers are totally worth it.</p>\n<p>When they get to Stiles’ house, Derek reaches for his seatbelt and hesitates. “Could I, uh, come in, just to get cleaned up a little bit?”</p>\n<p>“Oh, totally,” Stiles says. Thankfully his dad’s not home. “You want to borrow a pair of boxers?”</p>\n<p>“<em>Yes</em>,” he says, looking more grateful that Stiles would have guessed for such a simple favor. “That would be great, thank you.”</p>\n<p>Stiles laughs and tugs him up the stairs by the hand.</p>\n<p>Derek tip-toes through the front door, his fingers crossed that he can get up to his room before anyone can <em>sense</em> what he’s been up to.</p>\n<p>It’s just his luck, though, because Laura is sitting on the couch in the living room, and her eyes light up as soon as she sees him. Shit, he had no idea she was even coming home this weekend.</p>\n<p>“Not a fucking word,” he warns, but she just grins wider.</p>\n<p>“Language, Derek!” his mom calls out from somewhere at the back of the house, and Derek rolls his eyes. Being a werewolf really sucks sometimes.</p>\n<p>Laura smirks at him, with that look in her eye that means Derek is <em>not</em> going to like what comes out of her mouth. “On the full moon, really?” she asks, her voice below a whisper. “How many hickies does that poor kid have now?”</p>\n<p>Derek glares at her and then pounces, flipping her off the couch and onto the floor, narrowly avoiding the coffee table. She’s still stronger than him, infuriatingly, but he’s catching up and can get the upper hand if he surprises her. They scuffle for a minute, and before long she has him pinned and is sitting on his stomach.</p>\n<p>Laura grins triumphantly down at him, and he rolls his eyes. “Stiles is fine,” he mutters, and she snorts as she slides off him.</p>\n<p>“Yeah, I’ll bet.”</p>\n<p>“I dare you to go sit in the backseat of the Camaro,” he shoots back, and she pretends to gag, wrinkling her nose.</p>\n<p>“<em>Gross</em>. And way to be trashy, seriously. The backseat?”</p>\n<p>He grins. “Not my idea.”</p>\n<p>“Oh my god, get away from me, you are so cocky.” He can’t pass up the obvious joke, but Laura claps her hand over his mouth before he gets the chance and tackles him again. They smash into the end table, the lamp wobbling treacherously, and they both freeze.</p>\n<p>“No claws in the house!” It’s his mom’s voice again, and she pokes her head into the room with a frown. “I’m not in the mood to replace another picture frame.”</p>\n<p>“Sorry,” they mutter in unison, edging apart from one another.</p>\n<p>“And yes, Derek,” she adds, her nose wrinkling delicately. “Please go take a shower before dinner.”</p>\n<p>With Laura cackling, Derek flushes all the way up to his hairline and trudges up the stairs.</p>\n<p class=\"messagebody\">\n<span class=\"breply\"><span class=\"hide\"><b>Stiles: </b></span>Okay, remind me of the names again.</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Derek: </b></span>Stiles.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Stiles: </b></span>I made a cheat sheet. Can I bring it?</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Derek: </b></span>Stiles. It's gonna be fine, I promise.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Stiles: </b></span>It’s a LOT of people, Derek! And I don’t make the best first impressions.</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Derek: </b></span>It worked on me.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Stiles: </b></span>Aw, you're so gross.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Stiles: </b></span>Okay, I'm leaving.</span>\n</p>\n<p>Stiles tosses his phone into the passenger seat of the Jeep and heaves a deep breath before he turns the key. Derek’s parents are hosting some kind of big family cookout at their house, and Stiles is officially invited. There are a bunch of aunts and uncles and cousins who all live nearby, and while they’re all apparently really close, Stiles hasn’t yet met anyone outside of Derek’s immediate family.</p>\n<p>At least his hickey has faded by now—thank <em>fuck</em>, Stiles wasn’t looking forward to explaining that. His dad’s knowing looks were bad enough, he really didn’t want to deal with however Derek’s family would react. Derek says that they’re all normal, nice people, but Stiles is still more than a little nervous. No matter what Derek says, he knows that first impressions aren’t always his forte.</p>\n<p>There are a bunch of cars all parked along the Hales’ long driveway, and Stiles has to park about 30 yards down. He trips a little when he gets out, but Derek is suddenly <em>there</em>, up in his space and kissing him.</p>\n<p>“Hey.”</p>\n<p>“Hi,” Stiles breathes back. Derek looks good, as always, in just jeans and a t-shirt, and Stiles is glad that he didn’t decide to dress up any further.</p>\n<p>“You ready?”</p>\n<p>“Absolutely.” He says it with more bravado than he feels, especially since he’s all of a sudden weirdly dizzy.</p>\n<p>Derek leads him around the side of the house toward the backyard, but with each step Stiles feels worse and worse. Finally he has to stagger to a stop, bending over with his hands on his knees. All this energy is thrumming through him, it feels like, and he slams his eyes shut in a vain attempt to mitigate the spinning and the vibrating.</p>\n<p>“Stiles? Stiles!”</p>\n<p>Derek’s voice sounds like it’s coming from far away, but Stiles finally manages to open his eyes and focus on him. Derek’s in front of him, his brow furrowed.</p>\n<p>“Holy shit, are you okay?”</p>\n<p>Stiles sucks in a breath and then immediately regrets it. The smell of meat cooking hangs heavy in the air, making him queasy.</p>\n<p>“Yeah.” He takes a small breath through his mouth, which is only slightly more palatable. “Yeah, I’m fine.”</p>\n<p>Derek doesn’t seem convinced. “You really don’t look fine. Do you want me to drive you home?”</p>\n<p>Stiles shakes his head. This is embarrassing enough already, he can see everyone clustered in the backyard staring at him, and he doesn’t need to leave before he even meets anyone. “No, I’m—I’m good.”</p>\n<p>He tries to straighten up away from Derek and take a step, but he crumples almost immediately. Derek has crazy reflexes, though, and manages to catch Stiles before he even gets near the ground. “Nope,” Derek says, his voice tight. “Come on, we’re going inside.”</p>\n<p>Oh, god, everyone is still staring—this is <em>so</em> embarrassing. Derek should have listened to him about first impressions.</p>\n<p>Derek crouches a little and moves like he’s going to hook his arm under Stiles’ knees, but Stiles flinches away. “I am <em>not</em> letting you carry me out of here, absolutely not,” he says lowly. “Just—just keep your arm around me.”</p>\n<p>Derek sighs but obeys, his grip tight as he steers them toward the side door of the house. It’s slow-going but they make it up to Derek’s bedroom, and Stiles collapses gratefully into his bed.</p>\n<p>“How are you feeling? What can I get for you?”</p>\n<p>“I—I don’t know. It’s just…just really overwhelming for some reason?” Stiles tries for a weak laugh as he rubs at the back of his neck. He’s still not sure whether he’s going to throw up or pass out. “I have no idea, I’ve never felt like this before.”</p>\n<p>“Are you having a panic attack?” Derek asks seriously, and Stiles shakes his head.</p>\n<p>“It doesn’t feel like it, no. I’m just—like my <em>body</em> feels really overwhelmed. Which obviously doesn’t make any sense.”</p>\n<p>Derek frowns, but before he can say anything, the door to his bedroom opens. It’s Derek’s mom with a tall blond guy Stiles doesn’t recognize, and Talia immediately moves to the bed, laying her hand on Stiles’ arm.</p>\n<p>“This is Derek’s Uncle Will, he’s a nurse.”</p>\n<p>“I’m fine, really,” Stiles protests, but Talia gives him the most mothering look he’s seen in years, enough so that he has to close his eyes and swallow.</p>\n<p>Will steps forward and rests his hand against Stiles’ forehead. “You’re a little warm but not too bad. Have you been feeling bad recently?” he asks, and Stiles shakes his head.</p>\n<p>“No, not really.”</p>\n<p>“Nauseated? Double vision? Any other strange symptoms?”</p>\n<p>“A little nauseated,” he admits. “And dizzy. But that’s it.”</p>\n<p>Will hums. “You might be a little dehydrated, it is unseasonably warm today. Or you might have the start of a virus. Just try to rest and drink some water, okay?”</p>\n<p>Derek leaves with his mom and uncle and comes back a few minutes later with a tall glass of water. Stiles doesn’t really feel like drinking anything, but he’s not in the mood for Derek’s disappointed face.</p>\n<p>“You should go back outside.” Stiles can only manage about three sips and then rolls onto his side. “I don’t want you to miss out.”</p>\n<p>“Nah. I see those losers all the time.”</p>\n<p>Derek’s smiling as he climbs onto the bed, and Stiles moves closer to cuddle him shamelessly. “What if I’m getting sick? I could be contagious.”</p>\n<p>“I’m not that worried about it,” Derek says. He curls around him, pulling Stiles’ head into the crook of his neck and hooking an arm around his waist. Derek always smells so comforting, and if Stiles can shut his eyes and think really hard, he can pretend that Derek’s good energy is seeping into him and making him feel better.</p>\n<p>“Thanks for staying with me.” He mumbles the words into the collar of Derek’s shirt, but he seems to understand and starts to rub Stiles’ back in a nonverbal <em>you’re welcome</em>.</p>\n<p>Stiles never actually manages to doze off, he’s pretty sure, but after an hour or so, he can at least contemplate the idea of standing without wanting to throw up.</p>\n<p>“Okay. I’m ready to get up.”</p>\n<p>He doesn’t move, though, and Derek’s arm tightens. “Are you sure? Don’t worry about this party thing, we can stay here. Or I can take you home.”</p>\n<p>“No, I want to meet everyone.” It’s a feat of strength, but Stiles manages to pry himself out of Derek’s arms and sit up. “And I might even be a little hungry.”</p>\n<p>Derek lifts up onto his elbows and opens his mouth, but Stiles glares at him and cuts him off.</p>\n<p>“If you say <em>are you sure</em> one more time, I’m gonna be pissed.”</p>\n<p>Derek laughs and gets off the bed in that ridiculously graceful way of his. “Okay. Let’s go, then.”</p>\n<p>Derek’s family politely doesn’t mention the little fainting episode, except for Laura, who gives Stiles a big hug and then keeps her arm around him when he tries to step back.</p>\n<p>“Hey, are you okay?”</p>\n<p>“Yeah,” he says gamely, trying for a smile. “Must’ve just been dehydrated or something.”</p>\n<p>“Okay, good.” She shakes his shoulder a little and ruffles his hair. “We were worried about you.”</p>\n<p>Stiles meets the rest of Derek’s family—Talia’s brothers and Aaron’s sisters and all the assorted children—and while basically everyone is almost aggressively friendly, as a whole it’s less intimidating than Stiles was anticipating. He feels better, physically, if he sticks close to Derek, which is clearly the placebo effect at work, but Stiles is gonna run with it. He even gets enough of an appetite to choke down half a hamburger and after a while feels safe enough to venture away from Derek.</p>\n<p>There’s a gorgeous garden plot at the far edge of the backyard, and Stiles wanders over in that direction, belatedly noticing that there’s a kid sitting in the corner.</p>\n<p>“Hey, buddy.” He tries to make his voice sound cheerful and friendly, and the kid looks up at him. He’s pretty sure it’s Robbie, Derek’s Uncle Peter’s son.</p>\n<p>“Hi,” he says softly.</p>\n<p>“Whatcha doin’ here?”</p>\n<p>“Takin’ care of the flowers.”</p>\n<p>“Looks like you’re doing a really good job. Can I help you?”</p>\n<p>Robbie stares up at him for a full second, then nods. “Okay. The weeds look like this,” he says, pointing. “Don’t pull the pretty ones, those are the flowers.”</p>\n<p>“Got it,” Stiles says seriously.</p>\n<p>Robbie is a pretty quiet kid, it seems like, but soon enough Stiles gets him babbling about the flowers and the vegetables and the bugs that they find.</p>\n<p>After a while, something bumps up against his back, and he jumps. It’s Derek, and he smiles at him when Stiles tips his head back to look up at him. “Is Robbie putting you to work?”</p>\n<p>“Oh, yeah, he’s a real taskmaster. You wanna help pull weeds?”</p>\n<p>“Sure. I’ll help you earn your dinner.”</p>\n<p>As soon as Derek walks into the kitchen in the morning, Robbie and Maggie latch onto him. He heaves each of them up into one arm with a huff—man, they’re getting heavy. “What are you squirts doing here?”</p>\n<p>“We’re going for a walk! To see the trees!” Maggie says excitedly, but that doesn’t exactly answer his question.</p>\n<p>“Peter and Beth had to go into the city for a doctor’s appointment,” his dad says from the stove. He has eggs in one skillet and bacon in the other, and Derek’s stomach rumbles.</p>\n<p>Laura’s curled up on a stool at the breakfast bar, with a mug of coffee practically fused to her face. “We’ve been drafted into babysitting duty,” she says sleepily.</p>\n<p>“Don’t you want to go for a walk with Cora instead?” Derek asks the twins, smiling encouragingly. He loves them, but he was planning to get some homework done this morning.</p>\n<p>“Cora’s busy,” his dad says, “helping your mom in the garden. There’s a lot of stuff to pick.”</p>\n<p>Derek frowns. They definitely had a special dinner last month to celebrate the end of the harvest. “I thought most everything was done,” he says, and his dad shrugs.</p>\n<p>“So did we. Global warming, I guess?”</p>\n<p>“Weird.”</p>\n<p>“Yeah. Can you wash the fruit in the fridge?”</p>\n<p>Derek nods and dumps the twins onto the breakfast bar next to Laura.</p>\n<p>After they eat—and after Laura has been properly caffeinated to deal with two six-year-olds—they get ready to go outside. At the last minute, Derek grabs the beanie that Stiles gave him just the other day.</p>\n<p>Laura’s by the back door downstairs, and she smiles at the sight of him. “It’s like 60 degrees outside, Der.”</p>\n<p>“Shut up.” Derek rolls his eyes at her and tugs the hat down lower over his forehead. “Stiles made it for me.”</p>\n<p>Derek can see the exact moment in Laura’s eyes as she considers making fun of him, then changes her mind. “It’s really nice, it matches your eyes.” She pats the top of his head, running her fingers over the yarn. “I’ll have to see if he’ll make me one.”</p>\n<p>“He said everyone can expect them as Christmas gifts, he knits a lot.”</p>\n<p>“Awesome. Tell him I like purple.”</p>\n<p>“Tell him yourself,” Derek shoots back. “I know you guys text.”</p>\n<p>Laura grins. “Aw, are you jealous? I don’t tell embarrassing stories about you or anything. Not that often, anyway.”</p>\n<p>Derek rolls his eyes and shoves her, a little too hard, on their way outside. Maggie and Robbie come running toward them, trailed by Cora, who’s got two baskets full of zucchini and summer squash. Derek grimaces at the sight—by this time of year, he’s really tired of zucchini.</p>\n<p>“Are you ready?” Maggie takes his hand and tugs him toward the tree line. “Can we go? Is that your camera?”</p>\n<p>“Yes, yes, and yes. Do you wanna hold it? Remember to be careful, don’t drop it.”</p>\n<p>Most of the kids like playing with Derek’s camera, and he loves seeing what pictures they come up with. Usually for every shot that cuts off someone’s head or has a thumb over the lens, there’s an accidentally-creative one that he likes.</p>\n<p>It’s all fun and games on their walk until Maggie trips and falls into a thorny bush just off the trail. With a wince, Derek hands the camera to Laura and reaches down to pick her up. Unsurprisingly, she’s immediately started wailing—werewolves heal quickly, but injuries still hurt, especially to a six-year-old. He swings her up onto his hip and starts blotting away the blood on her leg with the hem of his t-shirt, while his other hand tries to take some of her pain. “It’ll be okay, kiddo, I promise.”</p>\n<p>“Derek,” Laura says sharply, and he jerks his head up.</p>\n<p>“What?” he says, over the sound of Maggie’s tears. He pats her hair.</p>\n<p>“Why aren’t you bleeding?”</p>\n<p>Derek looks down at his bare arm and frowns. His arm scraped right through that thorny bush when he bent to grab Maggie, but now there’s not even a scratch. He shouldn’t heal <em>that</em> quickly.</p>\n<p>He shifts Maggie to his other hip and reaches down into the bush again, dragging his arm deliberately against the thorns. He braces for the stinging pain, but there’s nothing—just a slight tickle even as he watches the thorns scrape against his skin.</p>\n<p>“What the fuck?” he whispers, looking up. Laura’s eyes are wide. She promptly sticks her arm into the bush, too, but pulls it out quickly, cursing under her breath as she wipes the blood off onto her jeans.</p>\n<p>“We should to tell Mom. That’s really weird.”</p>\n<p>“Yeah.” Derek stares at his arm, then the bush, then back at his arm. He shakes his head and jostles Maggie. “You want to go back or walk some more?”</p>\n<p>“Walk more,” she says, wiggling until Derek lets her back down.</p>\n<p>“Onward!” Laura yells, pointing farther down the trail, and Robbie runs ahead of her. Derek looks at the bush one more time and follows.</p>\n<p>Once they’re back in the house, Derek takes off his beanie and scrubs a hand through his hair while he scrapes his boots clean. Uncle Peter’s sitting with his parents in the kitchen, and Maggie makes a beeline for him. “Daddy, the bush hurt my leg.”</p>\n<p>Peter swings her up into his lap. “Where, sweetie?” Maggie points to her shin, and Peter kisses it.</p>\n<p>Laura helps Robbie reach to wash his hands. “Something’s going on with those bushes. You know, the ones with the thorns? They didn’t make Derek bleed.”</p>\n<p>“Really?” their mom asks, frowning. “That’s strange.” She steps toward the counter and brandishes a knife from the block. “Come here, Derek, let’s test it.”</p>\n<p>“Our family is strange,” Peter remarks, and his mom sticks her tongue out at him as Derek obediently steps forward.</p>\n<p>She lays the blade against the skin of his forearm and draws it down gently, but a thin line of blood appears almost immediately. They all stare at it for a second, then she runs a dishrag underneath the tap and cleans Derek’s arm. He doesn’t exactly need it, but she takes his pain away as they both watch it heal.</p>\n<p>“Maybe it was something special about the bush?” he offers, and Laura frowns.</p>\n<p>“But it cut my arm. And Maggie’s leg.”</p>\n<p>“Hmm,” his mom says, her brow furrowed. “Interesting. Tell me if something like that happens again. Or anything else weird.”</p>\n<p>“Okay.” The small wound has healed, and Derek slides his sleeve down self-consciously.</p>\n<p>“What are your plans for the rest of the day?”</p>\n<p>“Going over to Stiles’. We have physics to work on.”</p>\n<p><em>Physics</em>, Laura mouths behind their mom’s back, winking, and Derek rolls his eyes at her.</p>\n<p>“Where’s…where’s your dad?”</p>\n<p>Stiles makes a face—nothing worse than thinking about <em>parents</em> while he’s got a hand down Derek’s pants—and bites his neck in retaliation before responding. “Not home for at least another hour. Shut up and take off your pants.”</p>\n<p>Derek laughs but obediently reaches one hand down to unbutton his jeans. “You wanna—”</p>\n<p>Derek uses his body weight to shift them toward the bed, but Stiles pushes right back so that Derek’s flat against his closed bedroom door.</p>\n<p>“Oh, no no no,” he breathes. “Right here? Please?”</p>\n<p>Derek just kisses him, which is answer enough, and Stiles immediately deepens it. It’s frantic, heated, and Stiles has to pull back to catch his breath. He multitasks, because he’s productive like that, and moves down to press a line of biting kisses down Derek’s neck. He must have the toughest skin known to man because the hickeys never last, no matter how hard Stiles tries.</p>\n<p>He slides his hand back into Derek’s pants, easier with them unbuttoned, curling carefully around his dick. Stiles knows how Derek likes it now, knowledge that he very much enjoyed gathering, and he doesn’t hold back. Derek has a little bit of a hair trigger sometimes, which Stiles finds secretly hilarious and not-so-secretly very flattering, and sure enough, a few minutes later, he’s curving into Stiles’ body with a grunt.</p>\n<p>Stiles huffs out a breathless laugh and wipes his hand on his shirt. Derek’s out of breath, his head tipped back against the door with his eyes closed, and it’s a really fucking good look on him.</p>\n<p>“Mmm, you look good like that.”</p>\n<p>Derek snorts and scrubs both hands through his hair before leaning forward for a firm kiss. “With my pants around my thighs?”</p>\n<p>“Yeah, and with your shirt still on. Very…debauched.”</p>\n<p>“I’ll show <em>you</em> debauched,” he mumbles, not bothering to fix his pants before he shoves Stiles backward.</p>\n<p>“Ooh, good one,” he snarks, but Derek gets the last word when he pushes Stiles to sit on the bed and drops to his knees in front of him.</p>\n<p>“Why are your pants still on?”</p>\n<p>“Fantastic question,” Stiles says, breathless as he tips onto his back and fumbles with his zipper. He manages it, with Derek’s help, and he lets out a strained noise as Derek takes hold of his dick through his boxers.</p>\n<p>It’s always good, obviously, whenever they do this, but it’s never been quite like this before, with Stiles feeling like he’s burning up from the inside out. He tries to breathe through it, but he’s practically <em>vibrating </em>with energy, energy that he needs to shake it off somehow. He’s squirming on the bed and sliding his hands all over Derek, tangling in his hair and thumbing over his cheeks before sliding down over his shoulders.</p>\n<p>Suddenly Derek pulls back, lunging over toward Stiles’ nightstand and grabbing the water glass he left there. Stiles blinks, still drunk with lust, and watches dumbly as Derek upends the glass over a stack of papers on the corner of Stiles’ desk that’s…<em>smoking</em>?</p>\n<p>Stiles scrambles up to a seated position. “Holy fuck, was that on <em>fire</em>?” he says, his voice squeaking. “Jesus Christ.”</p>\n<p>Derek nods. He’s panting a little, and he wipes his mouth on the shoulder of his shirt. “What the hell. You don’t have candles, do you?”</p>\n<p>“No, of course not.” Stiles scrubs a hand over his face. He’s still jittery, but less so now. Probably because Derek isn’t touching his dick anymore. “It’s sunny, and the shades are open. Maybe the sunlight reflecting or something?”</p>\n<p>Derek frowns and tilts his head, considering the window. “I guess.”</p>\n<p>“That’s terrifying.”</p>\n<p>“I hope these weren’t important.” Derek gingerly flips through the stack of papers, now singed at the edges, and Stiles winces.</p>\n<p>“Nah, not really. Nothing I can’t just print again, anyway.” Stiles leans back on one arm and pulls his seductive face, which he knows is not particularly alluring. Derek still has sex with him, though, so it must not be <em>that</em> bad. “So…”</p>\n<p>Derek quirks an eyebrow. “You’re not concerned about the spontaneous fire in your bedroom?”</p>\n<p>“Oh, I am, very much so. So please help me relax by making me come.”</p>\n<p>Derek rolls his eyes with a little huff, but he’s smiling as he steps closer and drops back down onto his knees.</p>\n<p>Derek rummages through the pantry for another bag of chips, humming himself as he does so. They’re having another customary Hale pack cookout, and with Stiles there, easily charming everyone, Derek doesn’t think he could be any happier. He hasn’t yet broached the topic with his parents—he’s still working up the courage—but he thinks that soon, he might be able to tell Stiles the big family secret. He’s quite possibly foolishly optimistic, but Stiles certainly seems open-minded enough to accept it.</p>\n<p>A sudden cracking, rumbling noise makes him frown. It sounded like thunder, but as of two minutes ago, it was sunny and cloudless outside.</p>\n<p>Derek steps out of the pantry into the kitchen, and sure enough, there’s the unmistakable clatter of windy rain against the windows. He peers out the back door and grimaces at the frantic scene, all the kids screaming and everyone scrambling to get the food inside. He looks around for Stiles, like always, and all the blood rushes out of his face when he spots him.</p>\n<p>Stiles is standing in the middle of the backyard, eyes glazed over as he sways, as if he’s in some kind of weird trance. “Stiles!” Derek yells, running toward him.</p>\n<p>The rain is getting harder, thunder interspersed with strong gusts of wind, and a few seconds later, Stiles’ eyes fall shut as he collapses. Derek lunges forward and manages to catch him before he hits the ground.</p>\n<p>Before he can even contemplate what the <em>fuck</em> is happening right now, his mom and Peter are surrounding them. She swipes impatiently at her wet hair and leans over Stiles with a worried look on her face.</p>\n<p>“Which way was he facing?”</p>\n<p>“What? Why?” She gives him a no-nonsense, alpha look. “That way,” Derek says, nodding northwest toward the trees, and she nods sharply.</p>\n<p>“Humans and everyone under 16, into the house,” she yells, her voice carrying even over the rain. “Derek, you too, take Stiles. Everyone else with me, let’s go.”</p>\n<p>“Mom,” he says, trying to get her attention as she whispers furiously with Peter. He may be 18, but his boyfriend is slumped unconscious in his arms and he really just needs his mom to tell him that everything’s going to be okay. She turns to him and touches Stiles’ shoulder.</p>\n<p>“Do you recognize that scent?” she asks, her voice quiet, and Derek closes his eyes, concentrating as he tries to sift through the food and the rain and the panic coursing through everyone else. Finally, he catches onto the hint of ozone and almost physically recoils.</p>\n<p>“Oh my god, it smells like Bernadette,” he says, with a violent exhale, and she nods grimly.</p>\n<p>“Call Deaton, ask him to come over as soon as he can. He’ll know what it’s about. And also call the Sheriff. <em>Tell him</em>.”</p>\n<p>Derek winces. “Mom, I don’t know if I—”</p>\n<p>“Yes, you can,” she interrupts, curving one hand around his cheek like she’s done ever since he was a little kid who was scared of the monsters under his bed. “We’ll be back soon. Take Stiles inside and make him comfortable, okay? He’ll be fine, I promise.”</p>\n<p>With that, the adults run off, into the trees, and Derek is left standing in the middle of the backyard, soaking wet with rain streaming down his face.</p>\n<p>“Derek!”</p>\n<p>Someone yells his name from the back door of the house, and he snaps back into motion. Stiles is still…unconscious or asleep or whatever he is, and Derek carries him carefully back into the house.</p>\n<p>“We should get him out of those wet clothes,” Will says. “Cora?”</p>\n<p>“I’ll get some of Derek’s!” she calls out, already halfway up the stairs.</p>\n<p>Will guides Derek toward the couch, which is already set up with a couple of extra blankets. He sets Stiles down carefully, grimacing as his head lolls off the pillow.</p>\n<p>After Derek and Will make quick work of changing his clothes, Will picks up Stiles’ wrist to take his pulse, then looks briefly into his eyes. “Heart rate’s good. He should be fine, he just needs rest.”</p>\n<p>Derek sits next to Stiles’ hip on the couch, staring at the gentle rise and fall of his chest to convince himself that he’s still breathing. “Now what?” he asks, and his dad squeezes his shoulder.</p>\n<p>“And now we wait for him to wake up. I’ll keep watch, you go get changed into dry clothes and get something to eat.” Derek doesn’t budge, still staring at Stiles’ chest, and his dad gives him a gentle nudge in the shoulder. “Go.”</p>\n<p>It’s his no-nonsense voice, so Derek peels himself off the couch. He methodically changes clothes, dropping his sodden ones in the laundry basket and toweling his hair dry.</p>\n<p>It’s still raining outside, he notices, as he trots back downstairs.</p>\n<p>Aunt Beth, Peter’s wife, is in the kitchen wrapping up the food, and Derek frowns. She’s not only a werewolf but is one of the pack’s best fighters. Derek has no idea what’s going on, but regardless of the situation, she isn’t someone that they would leave behind. “Why aren’t you out there with them?”</p>\n<p>“You want to know a secret?” she whispers, and when Derek nods, she rests her hand low on her stomach with a conspiratorial smile.</p>\n<p>It takes Derek a second, then his eyebrows shoot up. “Wow, really? Congratulations!”</p>\n<p>“Thank you. You can probably hear the heartbeat if you try.”</p>\n<p>Derek crouches in front of her, turning his head, and when he concentrates, he can hear a thready, quick <em>lub-dub</em>. “That’s so cool.”</p>\n<p>“How’s Stiles?”</p>\n<p>“Still asleep,” he says with a sigh as he stands, and her smile is sympathetic.</p>\n<p>“I’m sure he’ll be fine.” <em>How is everyone so sure</em>, Derek wants to ask, but doesn’t. “Do you want something to eat?” she asks, and Derek makes a face.</p>\n<p>“I’m not hungry.”</p>\n<p>“Well, too bad,” she says firmly. “Let me make you a sandwich, it’ll make you feel better.”</p>\n<p>After what feels like hours but is probably only about 90 minutes, the adult werewolves finally come tromping in through the back door.</p>\n<p>Cora runs over first and gives their mom a hug. “Are you guys okay?”</p>\n<p>“Yes, yes, we’re fine. How’s Stiles? Any word from Alan or John?”</p>\n<p>“He’s still out,” Derek admits. “But Uncle Will says he’s fine otherwise. And Deaton and the Sheriff both said they could be here in about an hour. What happened?”</p>\n<p>“We went over to the northwest edge of the territory.” His mom sighs and picks at the bowl of crackers on the kitchen island. “Someone messed with the protective runes, pretty badly. Hopefully it was just an omega and not anyone actually testing our borders.”</p>\n<p>It’s quiet for a second, as everyone contemplates the repercussions of what that could possibly mean.</p>\n<p>“How come none of you felt the disturbance?” his dad asks.</p>\n<p>Derek’s not totally sure how the magic of the pack works, but the runes are supposed to be constructed so that when they’re disturbed, it somehow alerts the senior, more powerful members of the pack—Talia, Peter, and Laura, at least.</p>\n<p>“Because the runes are incomplete—since we don’t have an emissary, no one has been keeping up with them in a long time.”</p>\n<p>It’s quiet again, until Cora is the one who finally acknowledges the elephant in the room.</p>\n<p>“But <em>Stiles</em> felt it?”</p>\n<p>His mom sighs again, smoothing down a nonexistent wrinkle in her shirt. “It appears so, yes. We should wait for Alan.”</p>\n<p>“No,” Derek says sharply, and she looks up at him in surprise. “I think you all know something that you’re not telling me, and I want to know what it is.”</p>\n<p>His parents exchange a look, and his dad shrugs. His mom lifts her eyebrows, and from the magic of an alpha glance, everyone else scatters.</p>\n<p>Once they’re all gone, she steps closer to Derek and lays a hand on his arm. “I think Stiles might be a spark.”</p>\n<p>Derek’s jaw drops. “What?”</p>\n<p>He doesn’t know that much about sparks, but he knows that they’re <em>magic</em>. And Stiles—Stiles is human. Right?</p>\n<p>“I don’t really know much,” she admits. “My knowledge of sparks is…limited.”</p>\n<p>“And how long have you been thinking this?”</p>\n<p>“Not that long. A couple weeks.”</p>\n<p>A couple of <em>weeks</em>.</p>\n<p>Derek clenches his jaw. “And why?”</p>\n<p>Why hasn’t <em>he</em> noticed anything, he means.</p>\n<p>“The scent I mentioned to you earlier, I had gotten whiffs of that before. And then there was the garden.”</p>\n<p>Derek frowns. “What about the garden?”</p>\n<p>“The first time he came over to the house, remember, he and Robbie worked in the garden? And then a week later, we had that surprise, bountiful harvest. Sparks can have amplifying nature effects.”</p>\n<p>Derek nods, slowly. “And you just…decided not to tell me?”</p>\n<p>“Yes,” his mom says, her alpha voice in full effect. “You are a beta in my pack, and more importantly, you are my <em>son</em>. I am always, always going to do everything I can to protect you.”</p>\n<p>Derek crosses his arms tightly over his chest. “And you didn’t think that <em>telling me</em> would be a better way of protecting me?”</p>\n<p>“I wasn’t sure! And especially after…after—”</p>\n<p>It’s uncharacteristic for his mom to stumble over her words, and Derek’s entire body tenses. “<em>Kate</em>,” he spits. “You can say her name.”</p>\n<p>Her eyes close for a second before she opens them again, and her voice is softer now. “After Kate. I wasn’t sure if it was actually my intuition, or if I was just paranoid. And you…you seemed so happy, sweetie. I’m so sorry, I didn’t want to make you worry until I was sure.”</p>\n<p>Derek is suddenly too tired to keep standing, and he slides down the wall until he’s sitting down, his legs tucked up against his body. His mom follows him and leans her head against his shoulder.</p>\n<p>“You really think he’s a spark?” he whispers, and she nods.</p>\n<p>“Probably. Or something, at least. Especially after this.”</p>\n<p>“And do you think…is he a danger to our pack? Was that what this whole thing was about? I mean, he—” Derek pauses to swallow. God, how did he miss all the signs? “He did just come right up to me on the first day of school.”</p>\n<p>She pokes at his cheek with a little smile. “That might have been because of something else.”</p>\n<p>Derek groans and tucks his face into his knees. “I’m serious.”</p>\n<p>“So am I. I’ve been digging into his family’s background, and I don’t see any reason that he would want to hurt us.”</p>\n<p><em>There’s no real </em>reason <em>hurt us at all, </em>Derek thinks bitterly.</p>\n<p>“But why wouldn’t he tell me?”</p>\n<p>His mom shrugs. “Why didn’t you tell him that you’re a werewolf?”</p>\n<p>“Very funny,” he mutters, and she squeezes his arm.</p>\n<p>“We won’t know more until Deaton and John get here and Stiles wakes up. Let’s go wait.”</p>\n<p>Stiles is in that weird sleep stage where he’s awake, kind of, but there’s no way in hell he can pry his eyes open, no matter how hard he tries. His whole body feels heavy, like he’s just half a second from falling asleep again, but he fights against it, trying to get closer to the surface.</p>\n<p>“He’s waking up,” someone whispers, and Stiles tries to concentrate enough to identify the voice. Derek’s dad, maybe? A lot of people are talking, but they’re doing it softly enough that it’s all blurring together.</p>\n<p>Then someone’s hand is on his arm, their thumb brushing gently against the inside of his elbow, and Stiles is pretty sure it’s Derek.</p>\n<p>“You awake, kiddo?”</p>\n<p>That’s <em>his</em> dad, definitely. Stiles tries to offer a <em>yes</em>, but it comes out as more of a croak. He redoubles his efforts to open his eyes and finally manages it.</p>\n<p>After blinking about 18 times, he can recognize that he’s in the Hales’ living room, on the couch, and there are a lot of worried faces around him. His dad and Derek are closest, followed by Derek’s parents, but he can see others, like Peter and Laura and Cora, hovering at the edges of his vision.</p>\n<p>Someone offers him a glass of water, which he drains in two gulps—it’s ice-cold, and it does a lot to finish waking him up. He hands it off to someone, he has no idea who, and tries to sit up. Derek’s hand stops him, though, and gently presses him back down.</p>\n<p>“What happened?” Stiles asks, and everyone exchanges glances. Anxiety builds in the pit of his stomach, but his dad’s face is calm when he faces him.</p>\n<p>“There’s a lot we need to talk about. Are you sure you don’t want to rest a little bit longer?”</p>\n<p>“I’m fine,” he says impatiently, and this time when he tries to sit up a little, no one stops him. “How long was I asleep?”</p>\n<p>“About six hours.”</p>\n<p>“How do you feel?” Talia asks, and her eyes are serious enough that Stiles takes a second to really think about it. Did something happen to him that he doesn’t remember?</p>\n<p>“Still really tired. And a little bit dizzy. But otherwise okay, I think.” He feels Derek intertwine their fingers, and Stiles squeezes hard. “Someone please tell me what the hell is going on.”</p>\n<p>His dad sighs and pats his leg. “It’s…it’s kind of a lot, kiddo, okay? But I promise that you’re fine, everything is fine.”</p>\n<p>“Okay, now you’re just scaring me,” Stiles says, his voice smaller than he’d like, and his dad’s face tightens.</p>\n<p>“Stiles, sweetie,” Talia starts. “This is not exactly how we wanted to tell you, but we’re werewolves.”</p>\n<p>\n<em>Werewolves.</em>\n</p>\n<p>Stiles swallows. This is absolutely, most definitely a dream. “What? Dad, what’s going on?”</p>\n<p>He squeezes his leg again. “I know how it sounds. Let Talia explain everything.”</p>\n<p>“Werewolves,” Stiles repeats, and it sounds no less ridiculous in his own voice. “All of you?”</p>\n<p>“A lot of us.”</p>\n<p>“Who?”</p>\n<p>His voice is sharp, he can tell, but Talia doesn’t flinch. “Me, Peter, Beth, Laura, Derek, Cora. And others.”</p>\n<p>Stiles’ breath hitches. He glances at Derek, who’s very studiously looking at the floor. His boyfriend is a <em>werewolf</em>? What kind of <em>Twilight</em>-level sorcery is this? He tries to pull his hand away, but Derek holds fast, even though he still won’t meet Stiles’ eyes.</p>\n<p>“Prove it,” he says harshly, and for some reason, that makes everyone smile.</p>\n<p>“Derek said you’d say that,” his dad explains, and Stiles isn’t sure how he feels about that.</p>\n<p>Talia puts some more space between them—Stiles isn’t sure whether he’s grateful for or resentful of the gesture—and half a second later, he’s staring at…at some different kind of creature. And then it’s gone, and regular Talia is sitting in front of him.</p>\n<p>“Holy shit,” he breathes. His knowledge of werewolf mythology is sorely lacking, and his fingers are itching to get to his computer. “That’s…wow.”</p>\n<p>Stiles’ mind is full to the brim of questions, popping up one after another almost faster than he can consciously realize them, and he tries to sift through them for the most important ones. “Did you know about this?” he asks his dad, who nods.</p>\n<p>“As of a couple hours ago, yes.”</p>\n<p>Okay. Well, he trusts his dad, at least. He turns to Talia again, who seems to be in charge. “So how is this related to me, like, passing out or whatever? What happened?”</p>\n<p>She sighs and gestures behind Stiles. “That is a question for Alan.”</p>\n<p>Someone sits down next to her, and Stiles gapes at him. “Dr. <em>Deaton</em>? Why is the vet here? Are you a werewolf?”</p>\n<p>He shakes his head. “I’m a druid.”</p>\n<p>“What the fuck is a druid?”</p>\n<p>“I…I help maintain balance, shall we say.”</p>\n<p>Stiles makes a face. “The balance of <em>what</em>?”</p>\n<p>Talia shoots Deaton a glare and takes a seat next to Stiles’ hip. “Alan is an advisor. He’s very well-versed in many supernatural matters, especially magic.”</p>\n<p>“Magic,” he repeats, and she nods.</p>\n<p>“Werewolves are only one of the creatures that inhabit the supernatural world. Magic threads through all of us, of course, and are more concentrated in specific creatures.”</p>\n<p>“So…like witches and stuff?”</p>\n<p>“In a manner of speaking, yes,” Deaton says. “Which includes you.”</p>\n<p>Stiles blinks at him for a long second, wondering if this is the point where he’s going to wake up. “Me. Magic. You think I’m <em>magic</em>?”</p>\n<p>“In a way.”</p>\n<p>“In a way <em>how</em>?” he asks, his teeth clenched, but Deaton just studies him with that inscrutable gaze.</p>\n<p>“By all appearances, you seem to have a spark.”</p>\n<p>“A spark,” he repeats, and Deaton nods.</p>\n<p>“Yes. People with sparks are…particularly <em>receptive</em> to magic and to other supernatural creatures. Conduits, if you will, which are always looking for something to amplify their power.”</p>\n<p>“So I’m magic,” he says again. Derek is still holding his hand, and he squeezes. This is insane, he’s not <em>magic</em>.</p>\n<p>“Somewhat, yes. Once you started spending time with Derek, and by consequence the Hale pack, your spark sensed safety and opportunity, and so it started to manifest.”</p>\n<p>“It’s <em>sentient</em>?” he asks, his eyes wide, and Deaton’s face becomes, somehow, even more inscrutable.</p>\n<p>“In—”</p>\n<p>“If you say <em>in a matter of speaking</em> one more time,” he says, glaring at him, and Talia lets out a short burst of laughter. Deaton just frowns at him.</p>\n<p>“The spark sensed a potential emissary match, yes,” he says, and then it’s Stiles’ turn to frown.</p>\n<p>“What’s an emissary?”</p>\n<p>“Each werewolf pack has an emissary. They are responsible for maintaining the balance between other packs and protecting the territory, mostly through magic. The emissary is only as strong as their pack, and vice versa.”</p>\n<p>“Who’s your emissary?” he asks Talia, whose eyes droop as the mood in the room shifts. No one will meet Stiles’ eyes, including Derek, and Stiles frowns.</p>\n<p>“Our emissary died last year,” Talia says softly. “She was close to 90.”</p>\n<p>“And as a consequence,” Deaton chimes in, “the Hale pack is overall quite weak. They’ve been able to persevere thus far because their lineage is very strong. But the word is starting to get out that they’ve been substantially weakened, and that could bring a lot of trouble to Beacon Hills.”</p>\n<p>Stiles nods, trying to absorb everything. “So my…my <em>spark</em> sensed a good match and started to manifest because it wants—it wants me to be the Hale pack emissary?”</p>\n<p>“Yes,” Deaton says simply. Stiles swallows and withdraws his hand from Derek’s, who lets him.</p>\n<p>“Did you know this?” he asks Talia, and she hesitates.</p>\n<p>“I—I had a little bit of an inkling, a couple weeks ago. We thought you might have known about your spark and were hiding it from us.”</p>\n<p>“No! I didn’t!” he exclaims, and Talia squeezes his arm.</p>\n<p>“We know, sweetie, we know that now. And we would have found some way to tell you, but I wasn’t sure until today.”</p>\n<p>Stiles nods, slowly. “What was that, anyway? What happened today?”</p>\n<p>Talia sighs. “There was a small disturbance at one of the borders of our territory. Your spark sensed it, apparently, and tried to defend us.”</p>\n<p>Stiles can admit that sounds pretty badass. “And the passing out?”</p>\n<p>“Your body is not at all accustomed to using magic,” Deaton says, “nor does it know how to ration it. Exhaustion is very common in beginners.”</p>\n<p>Stiles is still half-convinced that he’s about to wake up from some kind of crazy fever dream, but he nods. “So…what’s next, then?”</p>\n<p>“If—and I remind you that this is still an <em>if</em>—Mr. Stilinski is in fact to become your emissary, he will need immediate training to strengthen his spark.”</p>\n<p>Stiles wrinkles his nose. “I thought, like, my <em>spark</em> already decided it,” he says, and Deaton shakes his head.</p>\n<p>“It’s not that cut and dry, nor is it so predetermined. Your spark manifested because it sensed a potential emissary match. It still needs to be strengthened, for one. Then, both you <em>and</em> the Hale pack need to initiate and accept the bond.”</p>\n<p>Stiles swallows. “So I could just…walk away.”</p>\n<p>There’s a stirring behind him and some hushed voices, but Deaton just looks at him steadily. “Yes. If you cut off contact with the Hale pack, your spark will slowly recede. It will do you no harm.”</p>\n<p>“But what about <em>us</em>?” Cora cries out. “We’re weak and we need an emissary!”</p>\n<p>“Cora,” Talia says sharply. “Hush.”</p>\n<p>Cora frowns but ducks her chin and obeys. Stiles frowns. “I…I don’t have to decide right this second, do I?”</p>\n<p>Talia’s “of course not” overlaps neatly with his dad’s “no.”</p>\n<p>Derek has been silent this whole time, looking down at the blanket covering Stiles’ lap, and Stiles slips their fingers together again. Derek squeezes gratefully.</p>\n<p>He doesn’t want to ask this, especially in front of all these people, but the words slip out before he can stop them. “Does, uh, does this have anything to do with me and Derek?”</p>\n<p>Deaton shakes his head. “The spark can sense a potential beneficial relationship, but it has nothing to do with romance. The same thing would have happened with your spark if you came into prolonged contact with Laura, for example, but presumably, there would have been no romance.”</p>\n<p>“Thank fuck,” Laura mutters under her breath, and Derek glares at her.</p>\n<p>“Are you sure, though?” Stiles asks. Derek is seriously cool, in like every conceivable way, and it would make total sense if <em>magic </em>explained why he was actually into Stiles.</p>\n<p>“You aren’t that powerful,” Deaton says flatly, and Stiles winces.</p>\n<p>“Jeez. Harsh. I mean, I know he’s out of my league, but—”</p>\n<p>“There’s no such thing as a love spell,” he interrupts to say. “Your spark in no way compelled Derek to be in a relationship with you.”</p>\n<p>“But what about—”</p>\n<p>“Oh my god, stop talking,” Derek cuts in. “It's fine, I promise. We'll talk about it later.”</p>\n<p>Talia is smiling, but Laura is downright cackling.</p>\n<p>“I'm sorry I was concerned about <em>magically assaulting</em> you!” Stiles says stridently. Derek rolls his eyes and folds his free arm across his chest.</p>\n<p>Deaton seems completely disinterested in their banter. “Have you noticed your magic manifesting in other ways recently?”</p>\n<p>Stiles shrugs. “No. I had no idea I <em>was</em> magic, remember?”</p>\n<p>But Derek shakes his head. “You almost passed out before, the first time you came over.”</p>\n<p>Stiles totally forgot about that. Wow, he has a really terrible track record of staying conscious around Derek’s family.</p>\n<p>“It was probably the shock to your spark of encountering so many pack members at the same time, I assume,” Talia says, turning to Deaton, and he nods.</p>\n<p>“Oh my god, and the fire!” Stiles yelps, and Derek grimaces.</p>\n<p>“What happened with fire?” Deaton leans forward, his eyebrows furrowing. “Working with fire is an advanced form of magic and results only from very intense emotion or intensive training.”</p>\n<p>Stiles’ cheeks feel hot. “Uh, I’d really rather not tell that story with all these adults around.” His dad crosses his arms over his chest, quirking an eyebrow, and Stiles pales. “Nothing illegal, I swear! Just sex!”</p>\n<p>Derek closes his eyes, while Laura looks like she’s holding in her laughter by sheer force of will. “So you had sex and started a fire? That didn’t seem suspicious?” she asks.</p>\n<p>“Are you really asking for more details?” he shoots back, and she makes a face.</p>\n<p>“Point.”</p>\n<p>Deaton sits back in his chair, and Stiles gets the impression that he’s reached the limit of what he’s going to tell him.</p>\n<p>“Can I, um—”</p>\n<p>“You want to go upstairs?” Derek interrupts, and Stiles shoots him a grateful look.</p>\n<p>“Yes.” He stands up under his own power, avoiding Derek’s steadying hand, and hugs his dad.</p>\n<p>“I’m going to talk with these guys for a while, okay?” he says. “We can go home in a bit.”</p>\n<p>“Okay. Love you, pops.”</p>\n<p>“I love you, too,” he says. He looks proud, weirdly so considering that all Stiles has done is apparently become some kind of <em>magician</em>, but he’ll take it.</p>\n<p>The stairs are a bit slow-going, though he continues to resist Derek’s help. His bed looks <em>so</em> good, though, and Stiles collapses down onto it with a happy groan.</p>\n<p>When he forces his eyes open again, Derek’s hovering by the door, his shoulders a bit hunched, and Stiles rolls his eyes. “Get over here, I’m not scared of you.”</p>\n<p>“Are you sure?” Derek moves, though, and joins Stiles on the bed. Stiles inches closer, shamelessly, and Derek wraps an arm around him. “Are you mad at me?”</p>\n<p>Stiles sighs. “No, not really. I can’t imagine that’s an easy thing to tell people,” he says, and Derek shakes his head. He buries his nose in Stiles’ neck and takes an exaggerated sniff.</p>\n<p>“You smell good.”</p>\n<p>Stiles laughs and cards a hand through Derek’s hair. “Why do I smell good?”</p>\n<p>“You’re wearing my clothes.”</p>\n<p>Stiles looks down, notices that he is in fact wearing a hoodie and a pair of sweatpants that are a little big on him. “So…you’re telling me that a super-sniffer is part of being a werewolf? That makes sense, I guess.”</p>\n<p>“Enhanced senses, yes.”</p>\n<p>Stiles thinks about that for a second, then looks at the door and cringes—they’ve definitely…<em>done stuff</em> in here before. Derek follows his gaze, though, and shakes his head. “Soundproof. All our rooms are.”</p>\n<p>“Oh, thank god,” he says, and Derek laughs. It gets quiet again, and Derek starts to trace lines with his finger on the skin above Stiles’ waistband, his touch maddeningly soft. Stiles’ dick is too tired to get interested, unfortunately.</p>\n<p>“I wanted to tell you,” he says quietly, and Stiles freezes. “That conversation has…not exactly gone well for me in the past.”</p>\n<p>“What happened?”</p>\n<p>“The first girl I dated…she just completely freaked out. Her family moved away.”</p>\n<p>Stiles makes a face. “That’s a bit of an overreaction.”</p>\n<p>Derek shrugs. “Are you okay?”</p>\n<p>“Still about 40 percent sure this isn’t real, but otherwise I’m fine. I’m going to have a million questions, though, I’m just too tired to think through all of them right now.”</p>\n<p>Derek lets out a small laugh and resumes the movement of his hand, which is doing a great job of lulling Stiles to sleep. But after a minute, his hand stills and holds onto the hem of the hoodie instead. “I have something else to tell you.”</p>\n<p>Stiles rolls onto his stomach muffles his yawn into the pillow. How the hell is he <em>still tired</em>? “Yeah? Good thing is, now that I know you’re a werewolf, it’s hard to shock me.”</p>\n<p>Derek laughs a little, but it’s flat. He picks up Stiles’ hand and threads their fingers together. “You know that we lived near San Diego for a couple years, for my dad’s job. When we were there, I, uh…I met someone.”</p>\n<p>Stiles frowns. “Yeah,” he says slowly, and Derek swallows, looking down.</p>\n<p>“She was, um, older. And so I didn’t tell my parents. But the whole thing…” Derek trails off and then shakes his head, sharp, as his face tightens. “The whole thing was fake. She was just using me. She and her dad tried to burn our house down.”</p>\n<p>Stiles’ jaw drops. “Holy <em>shit</em>. What—why?”</p>\n<p>“There are hunters. People who try to hunt werewolves and other supernatural creatures.”</p>\n<p>Stiles swallows. “Fuck. But you guys…I mean, you guys are fine, right?”</p>\n<p>Derek rolls closer, until his head is mostly buried in Stiles’ neck again. “Our emissary died protecting us.”</p>\n<p>Well, shit. No wonder Derek was shy about relationships.</p>\n<p>“And it was my fault,” Derek continues.</p>\n<p>“No, it wasn’t,” Stiles says quietly. He has zero details about the situation, of course, but he’s certain of this, at least. “I swear to you, Derek, it wasn’t. The only person you’re allowed to blame is that crazy girl. What happened to her?”</p>\n<p>“Her name’s Kate. She’s in jail, they both are.”</p>\n<p>“And is that why you guys moved back?”</p>\n<p>Derek nods. “There were…the hunter activity is stronger down there. It’s safer here.”</p>\n<p>“Wow.”</p>\n<p>Derek pulls back a bit, his arm still hooked over Stiles’ waist. His eyes are red. “Do you, uh, do you have any other questions?”</p>\n<p><em>Yes</em>, actually, but he’s not sure he can handle any of them right now.</p>\n<p>“Can we just…lay here for a minute?” he asks instead, because he’s seriously fucking exhausted, and Derek immediately rolls onto his back before tucking Stiles against his side. Stiles rests his ear right over Derek’s heart and lets the steady thump lull him back to sleep.</p>\n<p>The door to the vet’s office jingles as Derek steps in, and it’s dark enough that he can barely make out Stiles slumped over a line of chairs in the waiting room.</p>\n<p>“He’s fine.” Deaton’s behind the counter, flipping through paperwork, and Derek grits his teeth. Stiles has been training with him for two weeks now, but Derek still isn’t a fan of his aggressive placidness.</p>\n<p>“Stiles?” he says, ignoring Deaton, and Stiles jerks into wakefulness, wincing as he smacks his elbow on an armrest.</p>\n<p>“Hey. Thanks for coming to pick me up.”</p>\n<p>“Of course.”</p>\n<p>Stiles stands and cracks his neck. “Bye, Deaton.”</p>\n<p>“Goodbye, Mr. Stilinski.” He still doesn’t look up. “See you on Thursday.”</p>\n<p>Derek pointedly does not say goodbye and ushers Stiles out the door. “I’m not late, am I?”</p>\n<p>Stiles shakes his head. “Nah. I passed out about 15 minutes ago, so Deaton let me stop.”</p>\n<p>“What were you doing today?”</p>\n<p>Stiles sighs as he drops into the front seat of the Camaro. He props his feet on the dashboard, and Derek doesn’t even bat them down. “Boiling water. Who knew that was so <em>fucking </em>difficult. Apparently I have ‘natural talent,’ or whatever, according to him, but only when I’m not trying. Doing magic on purpose is a lot harder. And I don’t even get it. Why would I ever need to boil water?”</p>\n<p>“Deaton probably wanted tea,” Derek says dryly.</p>\n<p>Stiles laughs and yawns again. “I mean, I’ve made <em>fire</em> before! And a thunderstorm!”</p>\n<p>“You did pass out for six hours when you made the thunderstorm,” Derek points out, and Stiles huffs, crossing his arms over his chest.</p>\n<p>“Details,” he says, and Derek laughs.</p>\n<p>He dozes off again on the drive back to the Hales’, then frowns at the Beacon County cruiser that Derek pulls in behind. “That’s weird, why is my dad here?”</p>\n<p>“I have no idea.”</p>\n<p>Derek unbuckles his seatbelt and moves to get out of the car, but Stiles grabs his elbow. “Wait one goddamn second, mister.”</p>\n<p>“What?”</p>\n<p>Stiles grins and tugs him forward. Derek grins back, bracing one elbow on the center console as he leans in for a kiss.</p>\n<p>Once they get inside, their parents are sitting in the living room. The talking stops as soon as Derek and Stiles step inside, and they both freeze.</p>\n<p>“What?” Stiles asks immediately. “You all look freaked out.”</p>\n<p>“It’s all fine, dear,” Derek’s mom says. “Come sit down.”</p>\n<p>They do, cautiously, on the loveseat, and the three parents stare at them from the couch. Derek is feeling a little unnerved.</p>\n<p>“Stiles,” his mom starts. “First of all, we are so appreciative of all the hard work you’ve been putting into this.”</p>\n<p>“Yeah.” Stiles’ eyes are a little narrowed. “Which is why I just spent two hours in the back of a vet’s office, staring at cup of water and trying to get it to boil.”</p>\n<p>“What’s going on?” Derek asks, and his voice is sharp enough that his mom gives him a little look.</p>\n<p>“Well, to put it simply, you two have a particular bond, of course, and we—we aren’t sure how that’s going to influence this whole process.”</p>\n<p>“I thought you said our relationship didn’t have anything to do with the development of Stiles’ spark,” Derek says, and his mom nods.</p>\n<p>“Which is correct. But we are <em>less</em> sure of how it will influence the bonding process between Stiles as an emissary and our pack. That development is very delicate and needs to be taken seriously and monitored. Both for the health of Stiles’ magic, most importantly, and for the impact on our pack.”</p>\n<p>“So what are you saying, exactly?” Stiles asks, and all of the parents exchange looks.</p>\n<p>“We would like the two of you to, uh,” John says, “spend a little bit of time apart.”</p>\n<p>Derek’s eyes widen, but before he can say anything, his mom speaks up again.</p>\n<p>“We agree that this isn’t fair,” she says, “and we understand that this is difficult, I promise. But we wouldn’t ask if it weren’t important.”</p>\n<p>“So you want us to break up,” Derek says flatly, and his dad winces a little.</p>\n<p>“More of a—more of a break, really, than a break-<em>up</em>.”</p>\n<p><em>Semantics</em>, Derek thinks but doesn’t say.</p>\n<p>“For how long?” Stiles asks, his voice small, and Derek presses their knees together.</p>\n<p>“It would depend on how Stiles’ spark progresses. Likely about a month.”</p>\n<p>“Can we talk about it?” Derek asks, and they all nod.</p>\n<p>“Of course,” his mom says. “Why don’t you two go up to your room. The Stilinskis are staying for dinner, and we’ll be eating in about 20 minutes.”</p>\n<p>They’re silent on their way up the stairs, and Derek carefully closes the door behind them before he rubs at the back of his neck. “You can still say no, you know. To this whole thing.”</p>\n<p>“No way,” Stiles says quickly. “This is important shit. I have a <em>spark</em>, Derek, and I can use it to help your family. That’s amazing.”</p>\n<p><em>You’re amazing</em>, Derek wants to say. “But we have to <em>break up</em> now, that’s insane.”</p>\n<p>“I think…” Stiles sits down on the bed and leans his arms behind his body. “I might have an idea.”</p>\n<p>Derek arches one eyebrow. “Yes?”</p>\n<p>“We definitely shouldn’t be doing this,” Stiles gasps out against Derek’s mouth. He tries to pull back, but Stiles’ leg tightens where it hooked over Derek’s thigh. “Oh, no, don’t you go anywhere, I’m really close.”</p>\n<p>Derek smiles into the kiss and moves down to nose at Stiles’ neck. “Is that what does it for you then? Knowing that we shouldn’t be doing this?”</p>\n<p>Stiles chokes out a breathless laugh and arches up, pressing his chest more firmly against Derek’s and tightening his hand, where he has a grip on both their dicks. “Oh, yeah. Forbidden sex with my hot werewolf boyfriend. I’m basically living in a teen novel.”</p>\n<p>“Isn’t Twilight about vampires?” Derek bites at Stiles’ neck and smiles again when he laughs.</p>\n<p>“Please don’t talk about Twilight, I’ll lose my erection.”</p>\n<p>“Really?” Derek kisses Stiles before he can respond and adds his hand to the effort. It doesn’t take long after that, and Derek relishes Stiles’ shuddering groan in his ear. He follows soon after and lets his forehead rest against Stiles’ shoulder while Stiles runs a shaky hand through his hair.</p>\n<p>“We are so good at pretending to be broken up,” he whispers, and Derek laughs.</p>\n<p>Derek showers at Stiles’, thoroughly, and changes into a fresh pair of clothes that he brought with him. He makes it back to his house unscathed, but when he comes down for dinner, his mom calls his name out from behind him.</p>\n<p>It’s her <em>disappointed mom</em> voice, and Derek freezes. “Yes?”</p>\n<p>He’s not sure why he’s even bothering—he’s nearly incapable of lying to his mother, which he’s pretty sure would still be true even if she weren’t a werewolf—but he pastes on an innocent look anyway as he turns to look at her. Her head is tilted, her eyebrows raised, and yep, she definitely knows. <em>Fuck</em>.</p>\n<p>“This is serious,” she says. “This is the future of our family—our pack.”</p>\n<p>“I know,” he says, suitably chastised. “I’m sorry. We’ll stop. I promise.”</p>\n<p>“I’m sorry, too, I know this is overwhelming for everyone.”</p>\n<p>She holds her arms out, and Derek gratefully steps into them.</p>\n<p>The next morning, Derek gets to school early to meet Stiles at his locker and confesses. To his somewhat surprise, Stiles has come to a similar conclusion.</p>\n<p>“I know,” Stiles says, his gaze at Derek’s feet. “I felt guilty after you left, and I don’t wanna ever feel guilty about being with you.”</p>\n<p>Derek nods and licks his lips. “So we’re…broken up.”</p>\n<p>“Yeah, I guess,” he says, heaving a sigh. “But not—not forever, right?”</p>\n<p>His gaze jerks up, desperate and searching, and Derek wants nothing more than to kiss him. “God no,” he says instead. “At least…I don’t want that.”</p>\n<p>“Good. Me neither.”</p>\n<p>Derek swallows, staring at Stiles’ fingers where he’s toying with the straps of his backpack. “What’re we gonna tell everyone? Our friends, I mean.”</p>\n<p>Stiles sighs. “Well, we can’t tell them the <em>truth</em>, obviously. What if we, uh, say that we’re nervous about maybe splitting up for college, or whatever, and have decided to take a break?”</p>\n<p>“Okay,” he says, nodding. He’s a little nervous how quickly that idea came to Stiles. It seems like such a cliched high school relationship problem, unlike werewolves and magic and sparks.</p>\n<p>“So we’re really supposed to avoid each other?”</p>\n<p>Derek nods miserably. “Yeah.”</p>\n<p>“What about texting?” he asks, his face brightening, and Derek winces.</p>\n<p>“We shouldn’t risk it,” he whispers. “I don’t know how it works.”</p>\n<p>“Okay. C’mere.”</p>\n<p>They hug, and Derek buries his face in Stiles’ neck. He breathes in deep, indulging himself more than usual as he takes in Stiles’ scent. This is overly dramatic, he knows it it, but he is 18 fucking years old, and the thought of spending a month without his boyfriend sounds like torture.</p>\n<p>“Just think of how good the make-up sex will be,” Stiles whispers, right into his ear, and Derek laughs.</p>\n<p>The next four weeks are…rough. It’s awkward at school, where Derek still has to have classes with Stiles, still has to deal with all of their friends believing that they’ve actually broken up. He spends more with Erica and Boyd and Isaac, who seem to have taken his “side” in the whole ordeal, and he has to appropriately fake feeling upset about the whole thing.</p>\n<p>Not that it always feels fake. He keeps thinking of things that he wants to text Stiles, anything little or silly that reminds him of Stiles. And Stiles still has to keep in touch with the pack, of course, and spends a lot of time with Derek’s mom and various other family members, which drives Derek crazy because he can <em>sense</em> him, on people and at the house, but he can’t do anything about it. He tries to pry a little, attempts to figure out how Stiles’ training is going, but everyone remains fairly tight-lipped about it.</p>\n<p>Derek’s going a little bit crazy.</p>\n<p>Not being with Derek <em>sucks</em>.</p>\n<p>Stiles is trying to be an adult about it—it’s no big deal, it’s only for a month, yadda yadda yadda—but he really misses him. Plus, Stiles is fucking <em>magic</em>, apparently, and he’s still dealing with the whole supernatural-creatures-exist-what-the-fuck crisis, which he could really use Derek’s help with.</p>\n<p>At least Stiles is staying pretty busy with school—he’s also missing Derek’s help with physics and calc, by the way—and the sessions he has to do with Deaton and Talia. Deaton is still way too cagey for his tastes, but they’re managing. He has this nasty habit of making Stiles do things without telling him <em>why</em> he’s doing it, which pisses Stiles off more than anything.</p>\n<p>But it pisses Talia off, too, which is pretty hilarious, and she and Stiles bond over that. A lot of Stiles’ work with Deaton is on his own, learning how to control his spark, but Deaton also has him doing exercises with Talia to “test the emissary-alpha” bond, or whatever BS he feels like spilling that day.</p>\n<p>And even outside the physical training, he gets enough reading assignments from Deaton that it’s practically another class—history about the Hale pack, history about werewolves in <em>general</em>, details about all the various runes and rituals that he’s expected to know, etc. Peter’s been helpful with that, too, and the research-loving part of Stiles’ brain, the part that likes to fixate on things, is really enjoying it.</p>\n<p>It’s still a shock, of course—<em>werewolves</em>, what the fuck—but all the new things he gets to learn, the fact that he is actually playing a pivotal role…well that’s pretty fucking cool.</p>\n<p>But honestly, all Stiles wants to do is talk to Derek about all the cool things he’s learning. He has to suppress himself about a dozen times a day from texting him things like <em>have you ever met a faerie?? </em>and <em>I made fire today, ON PURPOSE this time</em>.</p>\n<p>Finally, after four weeks and five days—not that Stiles has been keeping track or anything—he gets a text from his dad asking him to go to the Hales’ after school. He speeds over there, singing along obnoxiously with the radio and tapping his fingers on the steering wheel. Their break is over, Stiles can <em>feel it</em>. Hugs and kisses and orgasms are on the horizon, he can’t fucking wait.</p>\n<p>He trips getting out of the Jeep and practically runs up the steps and into the Hales’ living room. Everyone is there, but Stiles has eyes only for Derek, who’s lounging on the couch looking more attractive than anyone has the right to be. He shoots Stiles a small smile and winks.</p>\n<p>Stiles swallows, and it only vaguely registers when his dad greets him and asks him to sit down. He sees Derek at school, of course, but they’ve done a really good job at mostly avoiding each other, partly just to keep up appearances with their friends. So now that they’re actually in the same room, Stiles is having trouble curbing the urge to climb him like a tree.</p>\n<p>He shamelessly fishes his phone out of his pocket and slouches down so he can text without anyone looking over his shoulder. He’s aware that everyone will know what they’re doing, but he doesn’t really care. With all the sensitive ears, this is really best option without escaping to Derek’s room, which he’s pretty sure they won’t let them do.</p>\n<p class=\"messagebody\">\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>Is it over??</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Derek: </b></span>I don't know, I hope so.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Derek: </b></span>You gotta try to calm down, I can literally smell your arousal.</span><br>\n<br>\n<span class=\"text\"><span class=\"hide\"><b>Stiles: </b></span>I don’t really see that as a bad thing.</span><br>\n<br>\n<span class=\"breply\"><span class=\"hide\"><b>Derek: </b></span>Means my mom can, too.</span>\n</p>\n<p>Well now Stiles will be lucky if he gets an erection ever again. He slides his phone back into his pocket with a grimace, and Derek just smirks at him.</p>\n<p>“How was school?” his dad asks.</p>\n<p>“Fine,” Stiles answers, too quickly. “So is it over?”</p>\n<p>Talia smiles at him. “Yes. Deaton has been very impressed with your progress so far”—news to Stiles—“and we can start preparing for the official bonding.”</p>\n<p>Stiles barely suppresses the urge to jump up on the couch and do a little dance. “That’s awesome,” he says instead, trying to sound cool, even though he’s pretty sure that his voice gives him away. But Derek is grinning, too, and Stiles is itching to touch him.</p>\n<p>“Curfew stays the same,” his dad warns. “And school still comes first, we’ll be keeping an eye on everyone’s grades.”</p>\n<p>“Absolutely,” Stiles says quickly. He would agree to basically anything right now, honestly, because his brain is a little distracted by staring at Derek. He takes a step toward him, assuming that the official discussion part of this is over, but his dad catches him by the hood of his sweatshirt.</p>\n<p>“Ah. Stiles, you’re coming home with me.”</p>\n<p>“But…” He bites his lip as he looks between Derek and his dad. “<em>Da-ad</em>.”</p>\n<p>His dad grins. “You’ve been complaining all week about that history test tomorrow. Now you can prove to me that you meant it when you just said you would put schoolwork first.”</p>\n<p>“Fine,” he says mulishly. He squirms out of his dad’s hold and darts over to give Derek a kiss on the cheek.</p>\n<p>“Tomorrow’s Friday, you two can see each other this weekend,” Talia says, and Stiles mournfully follows his dad out the door.</p>\n<p>They stop to get takeout on the way home and eat on the couch while watching one of those police procedurals that his dad loves to berate for its lack of adherence to actual police procedure. Stiles gets in about an hour of modestly-productive studying for his history test, though he’s alternately distracted by the pile of reading from Deaton on his bedside table and the temptation of texting Derek.</p>\n<p>There’s a rap of something sharp on his bedroom window, and Stiles nearly falls out of his chair when the window opens and Derek crawls through. “Jesus Christ, you almost gave me a heart attack,” Stiles hisses, but that doesn’t stop him from scrambling to his feet.</p>\n<p>“Sorry,” Derek says quietly.</p>\n<p>“How the fuck did you even get up here?” Stiles asks, then thinks about it for half a second and answers his own question. “Duh. Werewolf, right.”</p>\n<p>Derek grins at him and slides an arm around his waist, pulling him close. Oh, yeah, kissing is a thing that they should definitely be doing. Stiles slings both arms around Derek’s neck and bumps their noses together in his eagerness—he’s a little bit out of practice.</p>\n<p>Stiles is panting when they pull apart, and he leans his forehead against Derek’s. “So, uh, why’d you come over here?”</p>\n<p>Derek ducks in for another short kiss and shrugs a little, with an adorably bashful look on his face. “Just this.”</p>\n<p>“So you seriously ran all the way over here just to give me a goodnight kiss?”</p>\n<p>Derek frowns. “Yeah.”</p>\n<p>“God, I love you,” Stiles says, laughing, and then he freezes. Derek stills, too, but he tightens his grip on Stiles’ waist and holds his gaze.</p>\n<p>“I love you, too,” he says seriously, and Stiles swallows around the sudden lump in his throat.</p>\n<p>“Oh. Uh, really?”</p>\n<p>“Yes,” Derek says, laughing, and Stiles laughs, too, ducking his face into Derek’s neck.</p>\n<p>“Shut up. It just kinda slipped out. I meant it, though.”</p>\n<p>“Me too,” Derek says, and Stiles kisses the spot under his ear.</p>\n<p>“Do your parents know you’re here?”</p>\n<p>“Probably,” Derek admits. “But they didn’t stop me. I shouldn’t stay long, though.”</p>\n<p>“Yeah, I definitely don’t want my dad to know that you can sneak into my room.”</p>\n<p>Derek laughs and kisses him again, lush and sweet. “I missed you.”</p>\n<p>“God, I missed you, too. Everything has just been <em>insane</em>, and it sucked that I couldn’t talk to you about it.”</p>\n<p>“But it’s all been going well, though? That’s what my mom’s been saying.”</p>\n<p>Stiles grins. “Yeah, it’s awesome. I can make <em>fire</em>. On purpose. And all sorts of other cool shit. And Deaton took me out to the territory borders so I can start working on all the runes. Remember when we went running that day in the preserve and I felt really weird? That clearing is one of the borders.”</p>\n<p>“We’ll go running again, you’ll have to show me,” Derek says, and Stiles nods.</p>\n<p>“Ooh, I learned something else cool, wanna see?” Derek nods, and Stiles reaches for the small jar on the corner of his desk. “Trust me?”</p>\n<p>“Of course,” Derek says automatically, and Stiles grins.</p>\n<p>“Awesome. Just stand right there.”</p>\n<p>He twists open the jar, and Derek takes an immediate step backward, his eyes wide. “Shit, is that mountain ash?”</p>\n<p>“Yeah, why?”</p>\n<p>“That’s what Kate used to trap everyone inside the house.”</p>\n<p><em>Shit</em>. Stiles’ mouth drops open, and he holds the jar farther away from himself, as if more distance will make it better. “Oh god, I’m so sorry, I had no idea. I’ll just—”</p>\n<p>Derek swallows visibly and shakes his head. “No, do it.”</p>\n<p>“Do what?” he asks, and Derek gestures toward him.</p>\n<p>“Use it. I wanna see what you learned.”</p>\n<p>Stiles shakes his head frantically. “No,” he says immediately. “I don’t—”</p>\n<p>“I trust you,” Derek says, his eyes soft, and <em>wow</em>, all of a sudden this feels bigger than when Derek said that he loved him. “Show me.”</p>\n<p>Stiles makes Derek repeat himself about three more times, but he finally starts to sprinkle the ash in a circle around Derek’s feet. “Are you <em>sure</em>?” he asks again, when he’s about halfway done, and Derek nods.</p>\n<p>Stiles takes a deep breath and uses his belief and his intention to close the circle, just like he’s practiced. It’s working, he can feel it, and Derek bounces off the circle when he tries to take a step forward.</p>\n<p>He uses his foot to break the circle, and as soon as Derek steps free, Stiles breaks into a grin. “Holy crap, that’s so cool.”</p>\n<p>“Very cool,” Derek agrees. “Please use your powers for good instead of evil.”</p>\n<p>Stiles laughs and fists a hand in Derek’s shirt to tug him closer. “Well, since I love you and all.”</p>\n<p>“Are you ready?”</p>\n<p>Stiles exhales and nods. Talia smiles at him and pulls him into a hug. “I’m so proud of you, Stiles. I love you, and I’m very glad that you’re part of our family.”</p>\n<p>“Thank you,” he says into her shoulder. “I am, too. So much.”</p>\n<p>She squeezes his shoulder and grins. “Then let’s go do this.”</p>\n<p>It’s dark, the moon hanging full and bright in the sky, and the entire Hale pack is gathered in the backyard. The werewolves are all jittery, roaming around in various stages of their beta shifts, and the humans are clearly feeding off their energy.</p>\n<p>Stiles follows Talia through the crowd and joins her on a little mini-stage that someone has set up near the edge of the trees. As soon as she clears her throat, everyone quiets down and comes to surround them.</p>\n<p>“Mieczyslaw Stilinski,” she says, and Stiles winces. Everyone else laughs, his dad loudest of all.</p>\n<p>“Man, how did you even <em>know</em> that,” he complains. “And pronounce it correctly, even.”</p>\n<p>“I’ve been practicing,” Talia says slyly. She says a few words, about the role of an emissary within the pack and about honoring the memory of their former emissary Bernadette. “You ready?” she says to him quietly, and Stiles nods before stripping off his shirt. He inhales through his nose and clears his mind, preparing his body and his spark for the bond, exactly like he’s been practicing.</p>\n<p>Talia’s claw is sharp as she carefully carves a triskelion into the skin of Stiles’ chest, right above his heart. It hurts, but he grits his teeth and focuses on his spark. Then it’s done, and Stiles feels closer than ever to his magic, like it’s simmering right at the surface and ready to do whatever he asks of it. The power is intoxicating, and all the possibilities are welling up in his throat, nearly enough to choke him. He could create fire, wind, lightning…anything.</p>\n<p>Talia presses a cloth over the wound, and Stiles opens his eyes, not even realizing that he’d closed them. Everyone’s staring at him, all looking slightly awed. Maybe he <em>feels</em> different to them, he has no idea. His gaze meets theirs—his dad, Derek, Laura, the kids—and he knows that he would burn the earth to the ground for them. Stiles exhales and tries to keep a lid on the emotions swelling within him.</p>\n<p>When she takes the cloth away, the triskelion is red and raw-looking, but it appears to be mostly healed. Stiles pokes at it curiously, but it’s just a little sore, not really painful. Magical healing, clearly.</p>\n<p>“The bowl, please,” Talia says, breaking his reverie, and Laura hands over a wide wooden bowl filled with a brown substance.</p>\n<p>Stiles has no idea what’s in it—Deaton wouldn’t tell him, <em>obviously</em>—but it smells pleasant enough, kind of woodsy and cinnamony. In order of pack hierarchy, everyone dips their fingers in the mixture and makes some kind of mark on Stiles’ skin before touching the triskelion.</p>\n<p>Derek goes last, for reasons that Stiles doesn’t entirely understand, and swipes up the remains of the mixture on his fingertips. Everyone else has so far avoided drawing on the triskelion, but Derek draws traces right over it. When he lays his palm over the triskelion, it vibrates, sending a little shock through both of them. Derek’s gaze snaps to his, but all Stiles can do is shrug. It certainly didn’t do that for anyone else.</p>\n<p>Talia gives the pack’s traditional full moon blessings and then sends them all off into the woods. Stiles takes off, fully enjoying his enhanced speed—he’s definitely faster when he’s surrounded by so much pack energy. He attempts to evade Derek as long as possible, doubling back on his tracks and even shifting the wind to mask his scent.</p>\n<p>But Derek is gaining on him, Stiles can tell, and he changes directions just in time to be thrown down into a relatively-comfortable pile of leaves when Derek tackles him from behind.</p>\n<p>“You were trying to throw me off.”</p>\n<p>His words are slightly slurred around his fangs, and Stiles grins against the leaves. “Yes.”</p>\n<p>“But I caught you.”</p>\n<p>“Again, yes.”</p>\n<p>Stiles wiggles in an attempt to dislodge a particularly scratchy leaf and flips around in Derek’s grip. By the time they’re facing each other, Derek’s face is fully human.</p>\n<p>“You—”</p>\n<p>Derek cuts himself off and shakes his head, dipping down to bite gently at Stiles’ neck. Stiles tilts his head to give him more room and cards a hand through Derek’s hair.</p>\n<p>“I, what?”</p>\n<p>“You’re so powerful, I can feel it.”</p>\n<p>“Do you know what <em>I </em>can feel?” Stiles asks, moving his leg between Derek’s, and Derek laughs into his neck. He grinds down once, and Stiles groans. “Oh my god, you horndog, we cannot do that here.”</p>\n<p>“Later, then.” Derek slides his lips across Stiles’ skin until they reach his lips, and the kiss is lazy and slow.</p>\n<p>“You bet your ass later.”</p>"
}