{
  "id": "12558048",
  "url": "https://archiveofourown.org/works/12558048?view_full_work=true",
  "author": [
    "terra_incognita"
  ],
  "title": "could i but teach the hundredth part",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
  ],
  "relationships": [],
  "characters": [
    "Yagi Toshinori | All Might",
    "Midoriya Izuku",
    "Uraraka Ochako",
    "Iida Tenya",
    "Asui Tsuyu",
    "Todoroki Shouto",
    "Kaminari Denki",
    "Tokoyami Fumikage",
    "Kirishima Eijirou",
    "Hagakure Tooru",
    "Yaoyorozu Momo",
    "Bakugou Katsuki"
  ],
  "additional_tags": [
    "Future Fic",
    "Nosy Neighbors",
    "Mistaken Identity",
    "POV Outsider",
    "All Might's neighbor has some concerns",
    "dad!might"
  ],
  "language": "English",
  "series": "",
  "published": "2017-10-30",
  "completed": "2017-11-09",
  "words": "5,192",
  "chapters": "2/2",
  "comments": "395",
  "kudos": "13,202",
  "bookmarks": "3,467",
  "hits": "79,598",
  "summary": "<p>Ito Matsu knows three things about her neighbor, Mr. Yagi: he's very skinny, he's very kind, and he has enough children to overthrow the Japanese government.</p>\n<p>Or:</p>\n<p>All Might is retired, but his former students keep coming up with reasons to visit.</p>\n<p>We are not made of flesh and blood. We are made of mistakes, and triumphs, and bits and pieces of every person who ever inspired us.</p>",
  "notes": "<p>\n<i>O dearest, dearest boy! My heart<br>For better lore would seldom yearn<br>Could I but teach the hundredth part<br>Of what from thee I learn.</i>\n</p>\n<p>-Anecdote for Fathers, by William Wordsworth</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>I thought I was done with this, but it turns out I couldn't resist letting Matsu give Toshinori the pep talk we all wish we could give him.</p>",
  "text": "<p>Ito Matsu likes the man who lives upstairs. He’s about her age, she thinks. Late middle-aged, though he has the look about him of someone who spent most of his youth very ill. He’s tall, thin, a little worn-looking. His eyes are shadowed by a tired, heavy brow. But he’s kind, and offers to carry her groceries for her even when she fears they might be heavy enough to break his spidery arms.</p>\n<p>Really, most of the time he’s a pretty good neighbor. He has a dog, but it’s very quiet. A service dog, she remembers hearing him say. For anxiety. The two of them never cause any trouble.</p>\n<p>There’s only one problem.</p>\n<p>It starts with a boy. Green hair, mid-twenties. He shows up once a week with a cooler. When Matsu bumps into him in the elevator, he sheepishly explains that it’s full of frozen meals he’s made for Mr. Yagi. Matsu hums a little under her breath, but answers his polite smile with one of her own as she steps off at her floor.</p>\n<p>It makes sense, she supposes, that such a delicate man would be worried over by his children. And really, he ought to eat more. She’d nearly screamed just three days ago when she’d seen him in the hall—he looked almost exactly like a skeleton from a distance.</p>\n<p>There’s a girl after that, around the same age, with short hair and bright eyes. She comes in with Mr. Yagi, carrying about ten bags of groceries as though they weigh nothing at all. She’s chatting amicably—more at him than with him—but he smiles as he nods along, his little dog watching him attentively as it trots at his heels. The girl waves at Matsu as the three of them pass her on the sidewalk—with the same hand that’s carrying two cartons of milk and what looks like several large jugs of dish and laundry detergent.</p>\n<p>“Anyway,” she says, returning her attention to Mr. Yagi, “He started in on this whole speech about the individual versus society...”</p>\n<p>Matsu shakes her head a little, but goes about her business. It’s nice, she thinks, that Mr. Yagi’s children look after him so well. Her own son barely comes by on the holidays.</p>\n<p>The third one Matsu only notices because of Mr. Yagi’s dog. He’s walking it in the little green space next to the parking lot, waiting patiently as it makes tentative explorations of the few tree trunks within range, adjusting his glasses and stretching a little. Stretching a lot. He’s very tall, she notes, and thinks as he nods politely at her that he must be another of Mr. Yagi’s brood.</p>\n<p>After that, everything seems to snowball.</p>\n<p>There’s a girl with a wide mouth and long fingers who offers Matsu one of the boxes of seaweed tea she’s bringing to Mr. Yagi. “It’s good for your circulation,” she explains, and then—inexplicably—adds, “Ribbit!”</p>\n<p>She almost jumps out of her skin one day when she opens her door at a knock only to find that—instead of the Amazon delivery she’d been expecting—there’s a somber boy with two-toned hair standing on her doorstep. He falters when he sees her, a bag from what Matsu recognizes as a very high-end therapy product brand looped over his wrist.</p>\n<p>“I’m sorry,” he says woodenly. “I’m looking for Mr. Yagi’s apartment.”</p>\n<p>Matsu blinks owlishly at him, then gestures upward. “Same room,” she explains, “Next floor.” Then, “Oh! And could you take him back this umbrella? He loaned it to me a few days ago, I’ve been meaning to take it up.”</p>\n<p>The boy accepts the umbrella with a brief nod, thanks her, and excuses himself.</p>\n<p>Five, she thinks. A large family, but not unheard of.</p>\n<p>Then there’s one with strange teeth and a reckless grin dragging a new sofa up the stairwell, a well-dressed and fine-figured girl pacing the front walk and speaking rapid-fire into a cell phone about Mr. Yagi’s living arrangements. Matsu gets a static shock off of a blonde, who apologizes with a broad grin as a set of—to all appearances—empty clothes chides him fondly.</p>\n<p>Matsu comes to Mr. Yagi’s door hoping for his help changing a light bulb—he’s much taller than she is—only to be assisted by a bird-headed boy who speaks softly but casts a rather… odd shadow.</p>\n<p>And really, Matsu thinks, bewildered, that is altogether too many children. And clearly, with their range of quirks and appearances, not a shared mother between them. It’s all very suspect, but again and always, none of her business.</p>\n<p>It isn’t until some time later that things come to a head. There’s some kind of heated conversation going on upstairs. Matsu—who of course isn’t eavesdropping—can’t quite make out what is being said, but it sounds like an almighty row. She hears something break, and decides that—her business or not—it’s time to get involved. She can hardly expect Mr. Yagi to stand up for himself, after all, when the man can barely climb the stairs without getting dizzy.</p>\n<p>She marches up to his apartment and raps smartly on the door, ready to give whichever child is mouthing off a piece of her mind, when the door itself is blasted off its hinges. She teleports smartly out of the way, steadying herself on the wall as she stares at the charred mess that had once been a rather nice welcome mat with little flowers on it (the short-haired girl’s handiwork, she suspects).</p>\n<p>There’s a blonde boy standing in the doorway, one hand extended as though to turn the knob that is now on the other side of the corridor. He closes his eyes. Matsu thinks she can see him mouthing numbers, slowly, from one to ten.</p>\n<p>When he opens his eyes, he turns around to face the interior of the apartment again.</p>\n<p>“Sorry,” he says, his voice low. “I’ll replace that.”</p>\n<p>Then he’s off like a shot, brushing past Matsu with a muttered apology and disappearing into the elevator.</p>\n<p>Matsu pushes away from the wall, staring at the closing elevator doors in befuddled shock.</p>\n<p>“Mrs. Ito?”</p>\n<p>When she turns around, Mr. Yagi is standing in the doorway. He looks slightly abashed, one hand rubbing at the back of his neck. “I’m sorry if we disturbed you. Young Katsuki is facing something of a rough patch at work, and he gets a bit heated when he goes on a rant. Are you hurt?”</p>\n<p>“Ah— no. Thank you, no.” Matsu dusts off her sweater.</p>\n<p>Mr. Yagi gives her a light pat on the shoulder. “Good! Excuse me, but I really ought to tell the building manager what’s happened. Nasty surprise otherwise, hm?” He walks past her, moving off in the direction Katsuki had gone.</p>\n<p>And she just can’t hold it in any longer.</p>\n<p>“Mr. Yagi,” she says, unable to contain her burning curiosity. “I have to ask. How many children do you have?”</p>\n<p>He pauses mid-step, glancing over his shoulder with confusion written clearly across his features.</p>\n<p>“Oh,” he says, brow wrinkling. “Ah. None, I’m afraid.”</p>\n<p>Then he’s gone, and Matsu is left with one question answered and a hundred more clamoring to be asked.</p>\n<p>The mystery deepens when a friend of hers—Chiba Seiko—accompanies her out to lunch one day. They’re on their way back to Matsu’s apartment for a little dessert—Matsu has a bottle of good sturdy brandy she’s been saving for a rainy day—when they nearly trip over the green-haired boy as he steps out the front door of the complex.</p>\n<p>Matsu is fairly certain his name is Izuku. He’s around more often than the others, sometimes with coolers and other times with arms full of DVDs. She secretly thinks he might be Mr. Yagi’s favorite, though she’s never said anything.</p>\n<p>He bows a little to them, apologizing for the near-collision. Matsu waves his words away, smiling indulgently. Secretly, Izuku is her favorite too. He holds the door open for them, then bows again and disappears down the walk.</p>\n<p>Turning back to Seiko, she’s about to make a remark when she notices that her friend hasn’t stopped staring at the door Izuku had just exited.</p>\n<p>“...Seiko?”</p>\n<p>She jumps, then turns wide eyes on Matsu. “You didn’t tell me,” she says, a little breathless, “That Deku lived in your building!”</p>\n<p>Matsu blinks. “I… don’t think that’s his name. And he doesn’t live here, Mr. Yagi does. He just visits.”</p>\n<p>“Of course it’s not his name,” Seiko says, rolling her eyes so hard they’re at risk of falling out. “It’s his code name! Don’t you watch the news?”</p>\n<p>“It depresses me,” Matsu says with a sniff. “All those crimes.”</p>\n<p>“Matsu,” Seiko says, grabbing her shoulders and almost shaking her. “Matsu, that was Deku. That was the most famous superhero in Japan! Even you have to know that!”</p>\n<p>For a moment, Matsu doesn’t say anything. She’s cataloging experiences, going over mental notes, remembering the bits and pieces of news she hasn’t been able to avoid.</p>\n<p>“Oh,” she says, when she’s done. “Oh dear. I think we might need to look something up.”</p>\n<p>“That one, too.”</p>\n<p>“Matsu you can’t be serious. That’s Ingenium. He runs a massive agency, he wouldn’t have time to visit some old man.”</p>\n<p>“I saw him bagging poop for Mr. Yagi’s dog. It was definitely him. And that one, with the goggles.”</p>\n<p>“Froppy? She’s single-handedly eliminated seafaring smugglers. She’s won like nine medals.”</p>\n<p>“Oh! The girl with the very adventurous neckline.”</p>\n<p>“Creati is a multi-millionaire.”</p>\n<p>“And the boy with the exciting hair?”</p>\n<p>“A legacy hero. Matsu, the Prime Minister gave him an award on national television. How can you not have recognized any of these people?”</p>\n<p>“I mind my own business,” Matsu says with a shrug. “What about that one, with the nice smile? She’s been around a few times.”</p>\n<p>In the end, Seiko has to stay the night.</p>\n<p>Matsu doesn’t get the chance to speak to Mr. Yagi again until a week later, when they run into each other at the building’s gymnasium. He’s walking on the treadmill, pace even, with a book open on the control panel in front of him. She recognizes it as one that the angry boy—whose code name escapes her, but whose fame Seiko has assured her of—brought by last week, something about inner tranquility and quality of life. The Road to a Happier You, she remembers.</p>\n<p>Stepping onto the treadmill next to his, Matsu starts up a gentle jog cycle. Gone are the days of long, all-out runs, she thinks wistfully. Too hard on the knees.</p>\n<p>“How’s the book?” she asks, wiggling her fingers at Mr. Yagi in a casual greeting. He looks up, a little surprised, but smiles.</p>\n<p>“A bit heavy-handed, but there’s something to be said for an author’s good intentions I think. How are you, Mrs. Ito?”</p>\n<p>“I’m all right,” she replies breezily. Then, because slyness is for foxes, she turns to look at him. “Do you mind if I ask you a question, Mr. Yagi?”</p>\n<p>“Not at all,” he says, though she notices the way his fingers tighten on the rails of the machine.</p>\n<p>“You don’t have to answer,” she amends hurriedly. “It’s just. A friend of mine recognized one of your guests a little while ago.”</p>\n<p>“Ah.” Mr. Yagi relaxes, his smile going from wooden to genuine in the blink of an eye. “Yes, they’re quite well-known in their field.” There’s more than a hint of pride in his voice.</p>\n<p>“So I’ve been told,” Matsu says, trying to find a way to word her question that doesn’t sound hideously insulting.</p>\n<p>“You’re wondering why so many famous young superheroes would darken the door of an old man like me,” Mr. Yagi supplies, his smile still wide and untroubled.</p>\n<p>“You’re not that old,” Matsu replies automatically. “If you’re old, I’m old.”</p>\n<p>He laughs, and it’s a laugh she’s only heard filtering through the ceiling when one of Mr. Yagi’s guests is visiting. It’s too big for him, shaking out of his narrow frame like thunder down a mountainside, and for a moment it’s as though there’s a younger man peering out through Mr. Yagi’s eyes. She can’t help but join in, her own laughter quiet and tinny by comparison.</p>\n<p>“All right,” he says finally. “Let’s be not-old together then.”</p>\n<p>Matsu nods, and almost forgets her question until he adds, “They’re my students. Or they were, a long time ago. I think they teach me more than I teach them, these days. Did you know they’re making holo-tablets now? Young Iida was explaining it to me...”</p>\n<p>He tells her all about the latest advancements in technology, all of which seem more like science fiction than science fact. Occasionally his explanations break down into words like “thingy” and “doohickey”, but he seems delighted by the idea of it. Matsu finds herself swept up by his enthusiasm.</p>\n<p>She thinks Mr. Yagi must have been a very good teacher.</p>\n<p>Izuku—Deku, she reminds herself, what an odd code name—is waiting for the elevator a few days later when she comes back from her grocery shopping. He insists on taking some of her bags, though the large cooler resting on one hip prevents him from taking all of them. He smiles apologetically as he adjusts his grip.</p>\n<p>“Sometimes I wish I had Shoji’s quirk,” he tells her wryly. “He’s got six arms.”</p>\n<p>Tentacole, she thinks absently. The Tentacle Hero. Has he visited too? Did she miss him? How many celebrities has she met without knowing it?</p>\n<p>“That’s an awful lot of mittens, come winter.”</p>\n<p>Izuku laughs, and he reminds her so much of her own son that she can’t help a smile.</p>\n<p>“I don’t think I’ve ever seen him in anything but tank tops. I’m not sure he even owns a jacket. Toshi says it’s good to let your biceps breathe, but I think there has to be a limit.”</p>\n<p>At the mention of Mr. Yagi, Matsu’s smile widens. “He’s awfully lucky, you know. Your teacher.” A soft ding alerts them to the opening of the elevator door, and Izuku waves her in ahead of him before joining her and pressing the button for her floor.</p>\n<p>“Oh?” he prompts, adjusting his parcels.</p>\n<p>“Of course.” The ride to Matsu’s floor takes only a moment, and then they’re both trundling down the hall toward her door. She sets down her remaining shopping bags to sift through her purse for her keys. “I think I forgot my teacher’s name three days after I graduated. I certainly never visited him, or brought him meals or anything. I think he would’ve called the police—I was a bit of a problem child.”</p>\n<p>“I’ve met those,” Izuku says absently, waiting as she opens her door and ferries her bags inside. “But really, it’s the least we can do.”</p>\n<p>Matsu chuckles as she takes the last of the bags from him. “He must have been quite the teacher, then.”</p>\n<p>Izuku laughs. Shakes his head. “Well… not really.” He taps out a rhythm on the lid of the cooler. “To be honest, he was kind of terrible. But...” His expression softens a little. His eyes drift up to the ceiling, where Mr. Yagi is probably sitting on his very nice couch with his little dog curled up next to him, sipping seaweed tea and wearing therapeutic slippers.</p>\n<p>When he speaks again, his voice is soft. Thoughtful. “Even if he wasn’t a great teacher. He’s the best man I’ve ever met.”</p>\n<p>He bows then, and starts off down the hall. Matsu watches him until he reaches the elevators.</p>\n<p>Mr. Yagi, she thinks, is an awfully good father for a man with no children.</p>\n<p>Yagi Toshinori lives quietly. He likes it more than he expected, all those years ago when the last of his power left him. Little things mean more to him now; the smell of steeping tea, the sound of rain on his window, the gentle chatter of his neighbors through the walls of his little apartment.</p>\n<p>Well, not that little. Young Yaoyorozu found the apartment and—he suspects—is supplementing his rent. She certainly spends a lot of time talking to the building manager. Once or twice he’s tried to bring it up, but she always waves the subject away.</p>\n<p>Still. It’s warm and spacious, and he has a view of the courtyard. Nana, his little cocker spaniel, has taken to sitting at the window while he reads the paper. Today she watches the first snow of the coming winter as it slowly, surely, buries the leafless trees in what promises to be a thick blanket of delicate white flakes.</p>\n<p>She likes the snow. He should take her for a walk this afternoon, after his tea with--</p>\n<p>There’s a soft rap on the door, and Toshi smiles. Right on time, as always. When he stands up Nana’s eyes flick over to him, but she relaxes when he gives her a scratch behind the ears. Making his way to the door, Toshi flips the lock and opens it without checking the peephole. After all, there’s only one person it could be.</p>\n<p>Sure enough, young Izuku is standing on the other side of the door. Not so young anymore, Toshi reminds himself. He barely has to look down to meet the boy’s eyes these days. And when did that happen? He’s missed it somehow, he blinked at the wrong moment and now Izuku is grown. All of them, grown.</p>\n<p>He shakes the thought from his head as Izuku shakes the snow from the shoulders of his coat. “Young Izuku,” he greets, because old habits die hard in old men. “Come in, please.”</p>\n<p>“It’s freezing out there,” Izuku says, giving a dramatic shiver as he steps over the threshold with his oversized cooler. “I think this is the earliest it’s snowed in years!”</p>\n<p>“On its own, anyway,” Toshi says with raised brow.</p>\n<p>Izuku snorts. “That doesn’t count. It’s not really snow when Shouto does it, it’s just...”</p>\n<p>“Frozen water, falling from the sky?”</p>\n<p>The grin Izuku shoots his way makes Toshi’s eyes go soft. He resettles on the couch, Nana trotting over to give Izuku a perfunctory sniff before yawning and taking her habitual place at Toshi’s feet. He watches as his former student bustles around the open kitchen, shuffling meals into the freezer and putting the kettle on for tea. Izuku keeps up a running patter as he works, and Toshi wonders—not for the first time—if circular breathing is somehow involved. Surely otherwise Izuku would have to stop for air.</p>\n<p>“...but she says that’s just me being paranoid. Which, I mean, that’s not completely unrealistic, it wouldn’t be the first time. Still, I don’t think it’s a stretch to consider all the possibilities. There’s no guarantee they don’t have contacts in Harajuku, and if they do the whole pipeline could be corrupted. So I told her, either we dig deep or we--”</p>\n<p>“--leave the shovels at home,” Toshi recites along with him, smiling crookedly. “You’d better hope Shouta never finds out you’re stealing his idioms to teach your own interns.”</p>\n<p>Izuku just shrugs, pouring the tea into two mugs and flopping down in one of the overstuffed chairs opposite the sofa. “If he didn’t want me learning them, he shouldn’t have taught them to me.”</p>\n<p>“Fair. I think he stole most of them from his grandmother, anyway.”</p>\n<p>“Phantom Eye? You’re kidding.”</p>\n<p>“Mm. I had trouble believing it myself.” Toshi takes a tentative sip from his mug, but it’s still a bit too hot to drink. “From what I hear, she was quite the wise old soul later in life.”</p>\n<p>“You’d never know it from her trading card.” Izuku’s phone vibrates, and he checks his coat pocket before going for the front right of his jeans. Not his work phone, then. When he reads the notifications he smiles a bit before tucking the phone away again.</p>\n<p>“Anything urgent?”</p>\n<p>Izuku shakes his head. “Just Kacchan. He sent me a photo of one of his flower arrangements. Did you know he’s doing that now?”</p>\n<p>Toshi quirks a brow. “I thought he was gardening. Or… knitting?” Toshi has a hat to show for the second hobby, with a gap at the side and an odd knobbly bit at the top. It’s lopsided, and too large by half.</p>\n<p>It’s his favorite hat.</p>\n<p>“Oh he still does those. Flower arranging is new though. He’s actually pretty good at it, wanna see?”</p>\n<p>Nodding, Toshi leans forward to look at the picture Izuku shows him. It’s a large bouquet, crocuses mostly, with a few winter ferns and a scattering of small white flowers he doesn’t recognize. “It’s lovely,” he says, and means it.</p>\n<p>“He says it means...” Izuku takes the phone back and scrolls down. “Happiness and comfort. Huh. He must be having a good day, the last one had petunias in it.”</p>\n<p>Toshi hums agreement, even though he has no idea what that means.</p>\n<p>They pass a pleasant hour, drinking tea and exchanging gossip, until Izuku’s phone—his other phone—gives an impatient trill. He gives Toshi an apologetic look, already standing as he presses the phone to his ear. “Mina? You found the pipeline?” He pauses for a brief moment as he bends down to put on his shoes. “…Okay. Yeah, no, that’s good. Is Toru tailing them? She knows their M.O., she--” Izuku struggles with his laces for a moment before giving up on them entirely. He pulls his mouth away from the receiver for a moment to mouth his farewells, but Toshi is already shooing him fondly out the door.</p>\n<p>“Go on,” he chides. “Save the city, or the world, or whatever it is today. I had my turn.”</p>\n<p>Izuku grins, then darts in for a quick hug before bounding off toward the elevator with the phone still pressed firmly to his ear.</p>\n<p>“Mina, I have to go. I’m gonna call Tenya, he’s way closer than we are and he’s met these guys once or twice. Yeah-- Yeah, I’ll see you there!”</p>\n<p>The elevator door closes behind him, and Toshi is left smiling at an empty corridor.</p>\n<p>Shaking his head, he slips back into his apartment. He rinses out the cups, puts away the kettle. Then he slips his coat over his shoulders—a coat that fits, all of his clothes fit these days, it’s the strangest feeling—and takes Nana’s leash down from its hook on the wall.</p>\n<p>“Come on girl,” he murmurs as she joins him by the door. “Let’s go say hello to winter.”</p>\n<p>The air is crisp and cool as the two of them step out into the snow. It’s stopped falling for the most part, but a few flakes still sweep in lazy circles before settling on the clean white of the courtyard lawn. Toshi abandons the path immediately, watching with some small satisfaction as his shoes cut through the thick snow beneath them.</p>\n<p>They leave their footprints side-by-side, he and Nana, as they make their slow way through the courtyard and down the little path that leads to the park. There aren’t many people out today, all driven inside by the cold, and Toshi is glad of the thermal gloves Shouto brought him last winter. His circulation isn’t what it used to be.</p>\n<p>In spite of the park’s emptiness, he does recognize one solitary figure sitting on a bench beneath a snow-dappled cherry tree. He waves a little.</p>\n<p>“Mrs. Ito,” he greets. “Do you mind if I join you?”</p>\n<p>She glances up at him, a little surprised at first, then smiles and waves him toward the empty seat beside her. “I’d be offended if you didn’t.”</p>\n<p>Chuckling, he eases himself down. “The cold doesn’t agree with my joints,” he explains, “But Nana loves the snow.”</p>\n<p>“Nana and I have that in common,” Mrs. Ito says, and scratches the little spaniel at the base of her spine. Nana wiggles gratefully, tongue lolling. “I saw Midoriya leaving on my way out,” she adds. “He looked like he was in a hurry. Nothing serious, I hope?”</p>\n<p>“Oh, probably. But nothing he can’t handle, and that’s the important part.”</p>\n<p>Mrs. Ito nods sagely, and the two of them slip into companionable silence. All around them, snowflakes dip and flurry in the quietest waltz Toshi has ever seen.</p>\n<p>The next time Mrs. Ito speaks, her words are soft and light and completely unexpected.</p>\n<p>“My parents died twenty-five years ago today.”</p>\n<p>Toshi turns to stare at her, but she’s just gazing off into the middle distance. Watching the lake they can barely see through the trees.</p>\n<p>He doesn’t know what to say. “I’m sorry.”</p>\n<p>“Oh, it’s all right.” She hums, a little distant. “I just always get a little melancholy, you know? Around this time.”</p>\n<p>Nodding slowly, Toshi turns to join her in watching the lake. “Would it be rude of me to ask what happened?”</p>\n<p>“Ruder not to,” she says with a sad little smile. “It was the Ginza explosion. The one near the overpass, you know. It was on the news I think.”</p>\n<p>Just like that, Toshi feels himself shrink.</p>\n<p>The Ginza explosion. Of course. Of course, the Ginza explosion.</p>\n<p>“I remember,” he says, and his words come out small and worn.</p>\n<p>He does. How could he forget? How could any hero forget his debut?</p>\n<p>Fire everywhere and people screaming, buildings crumbling out from under them. And Yagi Toshinori, barely five years out of UA and shaking in his bright yellow boots. Younger than Izuku, twice as scared.</p>\n<p>He’d carried out armful after armful of survivors, struggling not because of the weight, but because of the smoke. Thick and cloying and hiding who knew how many others, dozens at least, that he knew he was already too late to save.</p>\n<p>Toshi snaps back to himself when Nana butts her head against his palm, worried brown eyes watching him. He swallows thickly.</p>\n<p>“I’m sorry,” he manages to croak.</p>\n<p>“It was a long time ago,” she says, waving her hand as though that can brush away all the pain. All the bitter repercussions of Toshi’s failure. “Nothing anyone could have done.”</p>\n<p>And he should nod, should let them slip back into unworried silence, but instead he says, “I could’ve. I’m sorry, I...”</p>\n<p>He can’t finish the sentence.</p>\n<p>She looks at him then. Really looks at him, gaze concerned and then confused and then, finally, comprehending.</p>\n<p>“Oh,” she says softly. And then, “That makes sense, now that I think about it.”</p>\n<p>“I’m so sorry.” It’s all he can say. All he can think, and the world is collapsing in around him like a burning building, and he’s choking on the smoke--</p>\n<p>Then there’s a hand on his arm. It’s small, feminine, covered by a cream-colored mitten. He looks up into Mrs. Ito’s eyes and finds… he finds…</p>\n<p>Kindness. Understanding. Forgiveness.</p>\n<p>“Mr. Yagi,” she says, and her hand on his arm is an anchor. “You haven’t done anything wrong. Not a thing.”</p>\n<p>“Your parents--”</p>\n<p>“--were the victims of a terrible explosion. But you didn’t plant the bomb.”</p>\n<p>“I could have--”</p>\n<p>“Mr. Yagi.” Mrs. Ito closes her eyes. Breathes. Toshi can see tears gathered along her lashes, but she isn’t crying. “All Might. Listen to me.”</p>\n<p>And he does. Because he owes her that much, at least.</p>\n<p>“Listen. You’re upset because… because you think you’re being measured by the lives you can save, right? And that’s-- Well, I won’t talk about how damaging that is because I’m guessing I wouldn’t be the first person to tell you that. So...”</p>\n<p>She’s quiet for a moment. Then,</p>\n<p>“So let’s run the numbers.” Mrs. Ito gives him a slightly-watery smile. “I used to be a math teacher. Did I ever tell you that? Not as glamorous as superheroing but I was good at it.” She squeezes his arm. “So. I think it’s time to talk about exponential growth.”</p>\n<p>Toshi blinks, dazed, completely uncertain of where this is going but clinging to her words like a drowning man. “Exponential… growth?”</p>\n<p>She nods decisively. “How big was the class you taught, at UA?”</p>\n<p>“Ah. About twenty students.”</p>\n<p>“All right. And I’ve seen most of them around, so clearly you inspired something in them.”</p>\n<p>“I don’t--”</p>\n<p>“Don’t argue with me, it’s rude and I’m right.”</p>\n<p>Toshi falls silent.</p>\n<p>“So you inspired twenty children to become heroes. And they each went out and did a lot of really brave things, changed the world for the better. And all the while people are watching them, looking up to them, thinking oh, if I work hard and train hard someday I can be a hero too. So each of your students, they inspire twenty more children to be heroes. And each of those children inspires twenty more, over and over, and do you know where all that started?”</p>\n<p>Toshi doesn’t know if he should answer. Doesn’t know if he can. But then a finger is prodding at his sternum and he looks down to see that she’s taken off her mittens.</p>\n<p>“You,” Mrs. Ito says softly. “You are the epicenter of that incredible ripple effect. Hundreds of heroes, hundreds of children hoping-- knowing! That they can grow up to help people the way you do.”</p>\n<p>She sits back on the bench with a puff of vaporous breath. “We’re teachers, Toshinori. We’re not measured by the lives we save or don’t save. We’re measured by the lives we change for the better.”</p>\n<p>Toshi stares at her for a long, silent moment. Then he turns to stare out at the lake, at the reeds heavy with snow and the overhanging trees he knows will be heavy with blossoms come spring. And for a moment he thinks he can see the cycle of the seasons unwinding in front of him, years flicking by like passing comets.</p>\n<p>He wonders if Izuku will ever sit on a bench like this, when his quirk has been long-since passed on, while a kind stranger passes on this same lesson.</p>\n<p>When he turns to face Mrs. Ito, she looks a little embarrassed. “Did I ramble?” she asks, flushing a bit. “I do that, sometimes. When I don’t know what to say.”</p>\n<p>“Never apologize for rambling. Besides.” He smiles, fragile but sincere. “I think you knew exactly what to say.”</p>\n<p>She shrugs, a little helplessly. “Must be the cold, addling my brain.” Standing, she offers Nana a farewell scratch. “I’ll see you around the building, Toshinori.”</p>\n<p>He nods. “I think I’ll sit a little longer. Walk safe, Matsu.”</p>\n<p>Smiling awkwardly, she gives a little wave and disappears into the gathering dusk.</p>\n<p>Toshinori closes his eyes. Breathes slowly. Allows himself to be still.</p>\n<p>For a moment, brief but real, he can almost feel her on the bench beside him. Can almost hear her cape rustling in the gentle breeze.</p>\n<p>Exponential growth, he thinks. The lives we change for the better.</p>\n<p>When he opens his eyes, the bench is empty. Nana gives a little huff, and Toshi smiles indulgently at her.</p>\n<p>“Cold paws?” he asks, and she yips indignantly. “All right. Let’s go back inside.”</p>\n<p>They move off in the direction of their apartment, following their own footprints all the way home.</p>"
}