{
  "id": "12555548",
  "url": "https://archiveofourown.org/works/12555548?view_full_work=true",
  "author": [
    "starknjarvis"
  ],
  "title": "Bruised Words",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Harry Potter - J. K. Rowling"
  ],
  "relationships": [
    "Harry Potter & Severus Snape"
  ],
  "characters": [
    "Harry Potter",
    "Severus Snape",
    "Albus Dumbledore"
  ],
  "additional_tags": [
    "Past Child Abuse",
    "Traumatized harry",
    "miscommunications",
    "a Snape adopts Harry fic",
    "Family Feels",
    "gen - Freeform",
    "Sickfic"
  ],
  "language": "English",
  "series": "Part 1 of Bruised Words",
  "published": "2017-10-30",
  "completed": null,
  "words": "16,672",
  "chapters": "1/1",
  "comments": "243",
  "kudos": "13,309",
  "bookmarks": "2,392",
  "hits": "166,464",
  "summary": "<p>After Harry blows up Aunt Marge, Dumbledore decides it's not safe for Harry to spend the rest of the summer at the Leaky Cauldron, and instead sends him to stay at Spinner’s End with Professor Snape. </p>\n<p>It's tense, awkward, and teeming with misunderstandings...but it might be the best thing that's happened to either of them. They're both been without a family for a very long time.</p>",
  "notes": "",
  "text": "<p>Harry flopped back onto the bed, staring up at the ceiling. Unlike at Hogwarts, the signs of magic in the rooms above the Leaky Cauldron were more subtle. There was more light in the bedroom than the scattered candles suggested, and Harry was sure he'd heard muttering from the mirror when he'd walked in. As unsettling as that had been, though, he felt the night had been a success.</p>\n<p>He wasn't going to be expelled for blowing up Aunt Marge. (He'd been pardoned by the Minister himself!) Now he had almost a whole month away from the Dursleys before he started back at Hogwarts. The Minister had seemed sure that Harry would be safe at the Cauldron, and Harry was just grateful to be away from Privet Drive.</p>\n<p>He could only imagine what his punishment would have been if he'd stuck around, and he was glad he wouldn't have to find out just yet. Hopefully everyone would forget the whole incident by next summer. (Unlikely, but Harry refused to let anything dampen his mood.)</p>\n<p>Hedwig hooted from her corner, and Harry tilted his head upside down to look at her. It felt silly and free. It was nice not to need to hush her in fear of Uncle Vernon overhearing and trying to throw her out again. \"What is it, girl? Did you not get enough to eat?\"</p>\n<p>Then, there was a sharp rap on his door.</p>\n<p>Cautiously, Harry stood up and walked over to it. Had the Minister changed his mind? Who else could already know Harry was there? Harry had been checked in under a fake name, and no one had seen him arrive except Tom. The Minister's words of caution on his mind, Harry called, \"Er, hello?\"</p>\n<p>There was a sigh from the other side. \"Open the door, Potter.\"</p>\n<p>Harry's blood went cold. He'd know that voice anywhere. Hoping he was wrong, Harry unlocked and opened the door. An imposing figure in black robes towered in the door frame, arms folded.</p>\n<p>\"Professor Snape,\" Harry greeted, dismayed.</p>\n<p align=\"center\">#</p>\n<p>Severus was not having a good evening.</p>\n<p>He was supposed to be at home working on his new alterations of Pepper-Up Potion, but a Patronus message from Dumbledore had torn him from his work and sent him on a mission into London. The information from Dumbledore had been short, to the point, and left no room for argument. The last point was the most frustrating, because Severus was already compiling a <em>long</em> list of reasons why this was Dumbledore’s most absurd request of him yet.</p>\n<p>Though Severus hadn’t actually prepared a list in advance of the ways he would least like to spend his summer holidays, being sent to London to collect a runaway Potter would certainly have been near the bottom.</p>\n<p>The boy in question looked no more excited to see his professor there. Despite the urgency of Dumbledore’s message, he seemed unharmed. He was wearing faded, oversized clothing—probably some unfortunate Muggle fashion trend—and his green eyes were wide behind his glasses.</p>\n<p>Severus looked away from those eyes and strode into the room. “Good,” he said, spotting the trunk at the foot of the bed. “You didn’t unpack.”</p>\n<p>“What are you doing here?\" Potter asked. He hovered between the door and the rest of the room as though he was considering making his second escape attempt of the evening.</p>\n<p>“You couldn’t really expect that Dumbledore would allow you to stay unattended at a brewpub in the middle of London for the rest of summer,” Severus said, exasperated.</p>\n<p>“The Minister said I could—”</p>\n<p>“The Minister is a bumbling idiot who is just glad that you didn’t end up a bloody corpse for him to do PR to cover up,” Severus interrupted. “He has no authority over you, and should not have pretended to. Then again, if he hadn’t, who knows where you might have ended up. Honestly, running away from home, Potter? Isn’t that a level of juvenility beyond even your standards?”</p>\n<p>Potter crossed his arms. “I’m not going back,” he said.</p>\n<p>“Unfortunately for you, Dumbledore agrees. It seems he can no longer trust you to remain put, and has decided on an alternate—and far more distasteful—solution for your accommodations for the rest of the summer.”</p>\n<p>“Can’t be much more distasteful than staying with the Dursleys,” Potter muttered.</p>\n<p>Severus raised an eyebrow. “You’re so sure?”</p>\n<p>Finally, the boy hesitated. “Why? Where do I have to go?”</p>\n<p>“It seems you caught Dumbledore in a strange mood this evening,” Severus said. “You’re staying with me.”</p>\n<p>There’s a moment of silence. “With you?” Potter croaked. He cleared his throat. “At Hogwarts?”</p>\n<p>“You don’t actually believe professors live at the castle during the summer holidays,” Severus said, but not very hopefully. The boy is just daft enough that he might. “I have a residence in Cokeworth. We’ll be staying there until I return to prepare for classes two days before the semester begins. That gives us slightly less than three weeks to drive each other to madness.”</p>\n<p>“You can’t be serious,” Potter said.</p>\n<p>“Would that I were kidding,” Severus said.</p>\n<p>“The Weasleys would let me stay with them,” Potter said.</p>\n<p>“If they were not in Egypt. You know as well as I do that they’re not available,” Severus said. “Believe me, I spent the entire journey here desperate to think of an alternative. But I do as Dumbledore says, and so shall you.”</p>\n<p>“How do I know Dumbledore really sent you?”</p>\n<p>Severus snorted. “You truly believe that this is an honor I would volunteer for if I weren’t being coerced?”</p>\n<p>There was an obstinate tilt to the boy’s jaw. “Do you have any proof? Can I talk to him?”</p>\n<p>He shook his head. “If Dumbledore had the time to deal with you himself, he’d be the one here in the middle of the night.” When the boy didn’t budge, he said, “Fine. How’s this?”</p>\n<p>He cast a quick spell to recreate the phoenix Patronus he’d received earlier that night. The silvery bird was smaller than the original, hovering just at the tip of his wand. “Severus, I need you to away to London,” it began. He let it speak just long enough for Potter to hear the headmaster’s voice before he waved it away again.</p>\n<p>“Now, there’s no time to waste. It’s late, and I have no desire to argue with you all night,” Severus said. “We’ll take the Floo to a neutral destination near my village, and then Apparate the rest of the way.”</p>\n<p>“Now?” Potter asked.</p>\n<p>“It’s nearly two in the morning. When else were you thinking?”</p>\n<p>Potter cast a longing look at the bed, but then steeled himself with surprising grace. “Okay,” he said. “Let’s go.”</p>\n<p align=\"center\">#</p>\n<p>By the time they arrived at Snape’s house, Harry was barely able to keep his eyes open. The various adventures of the night had worn him out, and the extra precautions they’d taken to get to Snape’s house had sapped the last of his energy. He’d fallen asleep as soon as he’d been in front of a bed, without taking the time to look around. He remembered, vaguely, Snape muttering something derogatory, but Harry hadn’t had the mental energy to decipher it.</p>\n<p>When he woke up, Harry jolted awake and looked around. He immediately remembered the events of the night before, and lashed himself mentally for falling asleep at all. Though his heart was pounding, his surroundings seemed…normal.  </p>\n<p>He was in a small, neutral bedroom. It was a bit dusty, and was decorated in boring grays. The door was closed, and he seemed to be alone. There was a quiet rustle of feathers from across the room, and he amended that. Mostly alone, apart from a sleeping Hedwig.</p>\n<p>Cautiously, Harry stood up and looked around. There was, thankfully, a small attached bathroom, which he used quickly. His trunk was sitting at the foot of his bed. He hadn’t bothered to change out of the clothes he’d run away in before falling asleep, but he felt wrinkled and gross, so he swapped clothes now. He dressed quickly, half-expecting Snape to burst through the door, but everything stayed quiet.</p>\n<p>After making sure all of his belongings were in place, Harry pocketed his wand and went to the door. He was so sure that he would find it locked that he jumped when the knob turned under his hand.</p>\n<p>Despite Harry’s expectations, the house beyond his bedroom didn’t appear to be a haunted mansion. Like the bedroom, it had the bland, slightly dusty appearance of Aunt Marge’s guest rooms, though without the photos of her dogs. He wondered if Snape had brought them to a safe home of some sort. He had trouble believing that this was the house Snape lived in full-time.</p>\n<p>According to the clock, it was nearly eleven in the morning. Harry started, immediately on edge. How had he slept so long? Aunt Petunia would have locked him back in his old cupboard with no lunch if he slept through his morning chores. There was no chance Snape was any different. Was Snape going to be sitting somewhere, watching the clock and waiting for him? What would he expect Harry to do around the house to pay for his room and board? They both knew this situation wasn’t part of the kindness of his heart.</p>\n<p>“There you are,” Snape said.</p>\n<p>Harry jumped and turned. Snape was standing in a small kitchen, his wand pointing at a kettle on the stove. Harry looked at the wand cautiously, but it didn’t so much as twitch as Harry edged into the room.</p>\n<p>“I wondered if you’d ever wake up.”</p>\n<p>“I’m sorry,” Harry said.</p>\n<p>Snape just raised an eyebrow. “This is what happens when one runs away from home and traipses through London all night. I’d have slept longer myself, only I’m not a twelve-year-old with no responsibilities.”  </p>\n<p>“I’m thirteen,” Harry said quietly.</p>\n<p>“Oh, of course,” Snape sneered. “Forgive me for not having your birthday marked on my calendar. I expect you had a big enough celebration with all of your adoring fans to make up for my oversight. Sit down.”</p>\n<p>When Harry sat, Snape hovered a plate and a cup of tea in front of him. Harry looked down at the toast and eggs (slightly overcooked, but palatable), and then frowned up at Snape, who was still standing by the counter. “What…?”</p>\n<p>“Apologies if it’s not up to your high standards,” Snape said.</p>\n<p>“You made me breakfast?” Harry asked.</p>\n<p>“I imagine that Dumbledore would take issue if I let you starve in my care,” Snape said.</p>\n<p>Harry blinked. “I know how to cook,” he said. Mrs. Weasley had never made Harry cook, but she liked to cook. She liked <em>Harry</em>. Why would Snape not leave Harry to fend for himself—or cook for them both?</p>\n<p>Snape rolled his eyes. “You think I’d let you interact fire in my kitchen? You forget, I’ve been grading your Potions work for two years. We’d be lucky if you weren’t poisoned. You know eggs can contain bacteria if undercooked.”</p>\n<p>“I’ve cooked every breakfast for the Dursleys every day I’ve been home for years,” Harry argued, feeling defensive.</p>\n<p>Snape just gave him a skeptical glance and then nodded to the plate again. “Eat. I’ll be in my lab. Just because it’s summer doesn’t mean I don’t have work to do.”</p>\n<p>“I…” Harry trailed off. “Do you not need breakfast?”</p>\n<p>“I already ate, obviously. Tomorrow, if you don’t sleep so late, you may even witness the event.”</p>\n<p>“Right,” Harry said. “Should…” He stopped again. Would Snape give him his list of chores now, or just expect Harry to figure things out? He didn’t seem interested in talking more.</p>\n<p>“Don’t touch anything outside of your room. I’ll know if you have. Bother me if you must, but only if you must.”</p>\n<p>“Yes, sir,” Harry said. He waited until Snape left before he began to eat.</p>\n<p>This was…weird. Harry didn’t know what he’d expected, but everything felt off. He was used to being ignored. The days when the Dursleys had refused to speak to him were always the most pleasant. But there was no pattern yet here, no set of rules laid out for Harry to follow. That meant, he had learned, that he’d find the rules when he broke them.</p>\n<p>He couldn’t get detention. This wasn’t school. What was Snape’s idea of a punishment for Harry breaking a rule in his house? Harry already felt as though he was on eggshells, and he’d been awake in the house for less than an hour.</p>\n<p>For a moment, he was furious with Dumbledore for sending him here. Harry would have been better off alone in Diagon Alley. Dumbledore knew Snape hated Harry, and that the professor would set Harry up to fail. Was this punishment for running away? Why not just say so, instead of pretending it was for Harry’s safety?</p>\n<p>When Harry finished eating, he washed his plate, the pan, and the kettle Snape had used, but the rest of the kitchen was clean. Should he dust? There was a layer on most of the cabinet shelves. Would Snape be angrier at Harry for leaving something dirty, or for touching his things?</p>\n<p>Finally, Harry retreated to his room without attempting to clean anything else. Snape had only given him the one instruction, and Harry wasn’t going to step into a trap by breaking it already.</p>\n<p align=\"center\">#</p>\n<p>Severus wished he had a more taxing potion to work on. Pepper-Up was a relatively standard mix, and his alterations were all logical changes based on his understand of alchemical interactions. That left his mind free to think about his unwelcome house guest.</p>\n<p>Severus had cast a charm on Potter’s door to alert him when it opened. Though part of him had expected the boy to make another escape attempt during the night, the alarm didn’t sound until well into the next morning.</p>\n<p>Throughout breakfast, the boy had been silent. Then, afterward, he had returned to his bedroom again without arguing. Severus had expected more nosiness from Gryffindor’s biggest troublemaker, or at least some demands to go outside.</p>\n<p>Potter was acting strange. Plotting something, most likely. Severus was starting to lose his mind waiting for the other shoe to drop. Why had Dumbledore done this to them? They’d be lucky to get to the end of summer alive at this rate. Severus was one aborted sentence away from shouting.</p>\n<p>What was the boy doing in the guest room? If Severus hadn’t trusted his own warding so thoroughly, he might have thought Potter had managed to slip away.</p>\n<p>Finally, after another few hours of silence, Severus was able to focus thoroughly on his work. By the time he left his lab that evening, he could almost pretend that he was alone in the house.</p>\n<p>Glancing at the clock, Severus frowned. It was later than he’d expected, far later than they usually served dinner at Hogwarts. Had the boy ignored his instructions and cooked something? Maybe he’d eaten one of the few snacks Severus kept around the house that didn’t need preparation for both lunch and dinner. That hadn’t been Severus’s plan, but it would have been the easy answer for the boy in an unfamiliar setting. Surely the famous Harry Potter wouldn’t feel an issue with grabbing what food he saw. Severus would need to go the store tomorrow to make sure he had enough supplies to feed them both.</p>\n<p>However, when Severus checked his wards, they confirmed that Potter hadn’t left his room since he’d finished breakfast.</p>\n<p>Potter must have brought food in his trunk. Severus should have predicted that. Teenage boys could eat their body weight in one sitting. Half of that trunk was probably full of sweets.</p>\n<p>Scowling, he knocked on Potter’s door. “Potter,” he barked.</p>\n<p>“What?” Potter called back.</p>\n<p>Did no one ever teach the boy manners? Any one of Severus’s Slytherins would have at least added a ‘sir’ to that. “Dinner,” he said, and went into the kitchen.</p>\n<p>By the time Potter slipped into the room, Severus was almost finished heating the leftover soup he’d frozen the week before. Thank Merlin Severus had made enough to save. He’d have hated to end the day cooking after spending so long over his cauldron.</p>\n<p>Severus plated two bowls and put one in front of Potter. Reluctantly, he sat across from the boy. To mitigate the awkwardness, he summoned the morning’s Daily Prophet from the living room to skim while he ate.</p>\n<p>There was a long period of silence. Finally, unable to take any more, Severus snapped the newspaper closed and said, “I’d prefer if you didn’t eat in the bedroom. Crumbs attract pests, even in magical houses.”</p>\n<p>“Right,” Potter said, seeming confused.</p>\n<p>“Good,” he said.</p>\n<p>And that was the conversation for the night.</p>\n<p align=\"center\"><br>\n#</p>\n<p>The next morning after another awkward breakfast, Harry couldn’t hold back the question anymore. “Sn—Sir,” he said. “What am I meant to be <em>doing</em> here?” He had spent the entire day yesterday in his room, rereading his letters and doing coursework. It had been a novelty to be able to read his magic textbooks without needing to sneak them from the cupboard, and it had been almost nice to have a room to himself without the threat of Dudley barging in. Still, Harry felt like he was missing something. Snape was letting Harry stay, and there was no chance that he wanted Harry to have the time as a vacation. Harry had been strictly forbidden from touching anything, but surely Snape had something in mind.</p>\n<p>“More than twenty-four hours, and you still haven’t figured that out?”</p>\n<p>Harry winced. Clearly Snape thought the answer was obvious. “I’m not used to wizard houses. All of the chores already seem to be done. I don’t know what you want me to do.”</p>\n<p>Snape narrowed his eyes. “Hilarious,” he drawled. “Are you really not able to entertain yourself? What do you do all day at home?”</p>\n<p>“Well,” Harry prevaricated. Did Snape want the list? Would he use it as fuel to mock Harry with later, or was he looking for ideas on what he should be making Harry do for the next few weeks.</p>\n<p>“Have you finished all of your homework?” Snape prodded.</p>\n<p>“Almost,” Harry said.</p>\n<p>“School begins again in three weeks. You should have completed everything last month,” Snape pointed out.</p>\n<p>“I didn’t have much time to work on things with the Dursleys,” Harry said. With all of the chores he did during the day, it had been hard to stay up and complete his readings and essays by wandlight every night without exhausting himself. “I just have one more essay to finish.”</p>\n<p>“Which one?”</p>\n<p>“It’s on the properties of Banishment,” Harry said. “I just have a bit more research to do.”</p>\n<p>“I can only imagine. All right. You’ll bring your homework for me to assess this evening,” Snape said.</p>\n<p>“I… What?”</p>\n<p>“The thought of shoddy work being done under my roof is going to give me hives,” Snape said. “If you’re so bored, I’ll edit what you’ve done so far and give you ways to rewrite. Besides, if anyone finds out that you were in my custody this summer and still turned in your usual caliber of work, I’ll never live down the shame.”</p>\n<p>“You don’t have to do that,” Harry said quickly. He’d thought the one perk of spending the summer with Snape was that he wouldn’t have to worry about the teacher hounding him on his academic performance. The idea of Snape looking through his work and shredding him every day was terrifying.</p>\n<p>“Tonight,” Snape repeated, and then turned back to his newspaper.</p>\n<p>He cleared his throat. Snape glanced up, clearly annoyed that the conversation was continuing. Harry pressed forward. “I saw through the window that you have a garden,” he said.</p>\n<p>“All true Potions Masters do.”</p>\n<p>“It’s a bit overgrown.”</p>\n<p>Snape’s nostrils flared. “Is that so? It’s almost as though I have to work far away in a frozen castle nine months of the year.”</p>\n<p>“I’m not trying to…” Harry took a deep breath. “I just thought I could help.”</p>\n<p>“Help?”</p>\n<p>“When I’m not working on my essays,” Harry said. “I garden back home, and I’m good at it.”</p>\n<p>“You garden?” Snape didn’t seem to know which word to emphasize more, so the sentence came out as an incredulous drawl. “I don’t recall hearing of any spectacular Herbology scores from you. I suppose it could have gotten lost in the exuberant praise you constantly acquire, but I recall a story about Miss Granger being the one to break Pamona’s Devil’s Snare trap. I always assumed that without her, you would have simply perished.”</p>\n<p>“Not magical plants,” Harry explained. “Just regular ones. I’ll be helpful, I swear.”</p>\n<p>“I’ll never understand the youth’s attachment to the outdoors,” Snape said. “Fine. But be careful. Some of those ingredients are worth more than your hide.” He shook his head. “Start with the vegetable patch. Surely there’s nothing you can screw up there. Supplies are in the shed. I’ll be in the lab. Try not to injure yourself.”</p>\n<p>“Yes, sir,” Harry said.</p>\n<p align=\"center\">#</p>\n<p>Harry realized immediately when he got outside that he had underestimated Snape’s garden. There was a greenhouse behind the house which had the more magical plants Snape had warned him to stay away from, but even the Muggle version of the garden along the east edge of the house was larger than any on Privet Drive. In addition to being more functional than decorative, like the plots Harry was used to, the garden had also been neglected for what looked like months. Weeds interlaced the vegetables and flowers with abandon, creating a tangled mess against the soil. Though there were some ripe tomatoes on the vine, most of the plants had already lost their fruit in the summer heat.</p>\n<p>Snape had warned him that there were wards in a hundred meter bubble around the main house, and that he shouldn’t bypass that distance unless he wanted to set off an alarm and experience a mild shock. Harry, cautious of Snape minimizing the severity of the shock for the humor of seeing Harry stumble into it, made careful note of the wards so he wouldn’t accidentally step through.</p>\n<p>Harry pulled on a pair of gloves he’d found in the shed, and jumped when they automatically shrunk to fit his hands. He flexed his fingers. They fit perfectly.</p>\n<p>Though it was a hot day, there was something pleasant about spending time outside again. After a full day cooped in Snape’s guest bedroom, trying to breathe quietly and not disturb his host, it was freeing to use his muscles and get dirty.</p>\n<p>For years, he’d hated working on Aunt Petunia’s flower beds. Her standards were unrealistic, inflated by the lawns she saw on the telly, and she resented any breaks Harry took to get water or eat. Once, when he was younger, he’d fallen asleep on a bed of freshly-planted tulips after Dudley had kept him up all night by stomping above his cupboard. The fragile stems had been crushed under his body, and Petunia had taken away his dinner privileges for a week.</p>\n<p> </p>\n<p>Over time, though, he’d learned to appreciate the solitude. It was an excuse as good as any to avoid the Dursleys, and since none of them had any frame of reference for how long gardening should take, he’d been able to steal time for himself.</p>\n<p> </p>\n<p>Around midday, Harry popped back into his room for a glass of water from his sink, and took an hour to unpack. Then, he went back into the afternoon sun to continue working on the garden.</p>\n<p> </p>\n<p>The sky grew dark around him, but Harry got absorbed clearing one particularly stubborn patch of yarrow weeds that had taken over an entire corner of the plot. The roots had been tangled deep into the soil, and he’d needed to chop at them so hard that there were creases from the hand shovel etched in his palms.</p>\n<p>He didn’t realize how late it had gotten until he glanced over and saw a pair of black boots on the grass beside him. With a startled jolt, Harry looked up—and up—at Snape.</p>\n<p>“<em>What</em>,” Snape said coldly, “did you do?”</p>\n<p>“I…” Harry said, gesturing vaguely at the plot. “Gardening?” What had offended Snape so much? He had been sure not to track in any dirt when he’d gone in during the day, and the garden was already looking much better than it had that morning.</p>\n<p>Snape pointed to the pile of extracted yallow. “And what is that?”</p>\n<p>“Weeds?”</p>\n<p>With a heavy sigh, Snape said, “I should have known better than to trust you with this. If you hadn’t already proven your ineptitude over the last two years, I could have just thought back to your father and realized that this would inevitably be too much for you to manage.”</p>\n<p>Scrambling to his feet, embarrassed and aware of the dirt on his clothes, Harry said, “I did what I said I was going to! You can’t pretend now that you didn’t tell me I could.”</p>\n<p>“I said you could help clean things up, not tear out an entire patch of the main ingredient of homebrewed Skele-Gro,” Snape said. “Those were on the verge of blooming.”</p>\n<p>Harry glanced back down at the weeds he’d just pulled up. “Yarrow is a Potions ingredient?” he guessed.</p>\n<p>Snape folded his arms. “Yes, Potter. And if you’d ever picked up a book, you’d know that.”</p>\n<p>“I have—”</p>\n<p>“I was planning on bringing some of my plants back to Hogwarts to cut the cost of bringing in Skele-Gro from St. Mungo’s stores, but clearly that will have to wait until next year.”</p>\n<p>“We could try to…” Harry trailed off. Magic could fix most things, but he had torn the roots of the weeds beyond repair. “I…” Did Snape know that Muggles saw yarrow as a weed? Would he even care about Harry’s arguments? Harry couldn’t figure out if this had been a set-up, or if Harry had managed to screw up the one thing Snape had actually trusted him to do. Which was worse? Being set up to fail, or confirming Snape’s terrible opinion of him only two days into their three week cohabitation?</p>\n<p>“Are there any sentences you’re planning on finishing, or are you going to continue hacking the English language as thoroughly as you did those plants?”</p>\n<p>With a shaky sigh, Harry shook his head.</p>\n<p>“Thank Merlin I didn’t let you into the greenhouse,” Snape muttered.</p>\n<p>He pointed his wand at Harry, who flinched back. He’d left his own wand in his bedroom. There wasn’t much he could do to fight against a wizard like Snape anyway, but he wished he had something to defend himself with beyond a hand shovel. Instead of hexing him, though, the spell Snape cast created a quick breeze over Harry’s form. Looking down, Harry saw that his clothes had been scrubbed completely clean.</p>\n<p>At Snape’s imperious gesture, Harry followed Snape back into the house. When Snape split off toward the kitchen, Harry trudged toward his bedroom. “Where are you going?” Snape asked. “Why do you think I came out to collect you? Dinner is ready.”</p>\n<p>Harry hesitated, waiting for the punchline. “But…”</p>\n<p>“What?”</p>\n<p>“I messed up your garden,” Harry blurted.</p>\n<p>“Potter, you’ve been working outside all day. If you ate lunch, it was surely whatever sweet treats you still have hidden away, since I’m not missing any other food. I can’t send you to bed without a real meal.” Harry didn’t answer. Snape huffed and rolled his eyes. “You may be looking for an excuse to report to Dumbledore what a cruel monster I was to you, but I won’t stand for it. Sit down and eat.”</p>\n<p>Reeling, Harry sat.</p>\n<p>Throughout the meal, he was on edge, waiting for Snape to yell again, or to laugh and take back the meal. But nothing happened. Snape levitated a scroll to spin slowly in front of him as he ate, letting him completely ignore Harry. Harry finished his bowl of stew, and found the bowl immediately refilled. He hesitated for a moment, not sure if it had been an automatic magical reaction or something Snape had done, but he ate the second helping anyway.</p>\n<p>When Harry stood to move his bowl to the sink, Snape said, “Bring your homework to the living room in an hour.”</p>\n<p>Harry winced. There was the punishment. He nodded and went to the sink. Just as he started to rinse it, the bowl was plucked magically out of his hand, scrubbed thoroughly, and set gleaming in a drying rack before Harry could even jump. He glanced back at Snape to see if he had done the spell, but his professor was still ignoring him.</p>\n<p>Full but confused, still dreading what the evening would bring, Harry finally escaped back to his room.</p>\n<p align=\"center\">#</p>\n<p>If Severus hadn’t been paying attention, he wouldn’t have noticed when Potter entered the living room. For a Gryffindor notorious for rushing into danger, the boy could move quietly when he wanted. Perhaps he was worried about retaliation for his mistake in the garden earlier. Good—Severus wanted to keep him on edge. If Potter got too relaxed, Merlin only knew what mischief he would decide to cause.</p>\n<p>Once Potter had left the kitchen, Severus had gone back outside to assess the rest of the damage, and had been surprised to find that—other than the yarrow incident—an extremely well-manicured garden plot. Potter had done more work than Severus had expected, and had taken obvious care to retain the integrity of the plants he had known.</p>\n<p>Severus hadn’t used the garden recently, which was one of the reasons he’d felt comfortable turning the boy loose on it. However, Potter had done a good enough job that Severus was tempted to restart his gardening efforts to match the plot he now had on hand. With the three weeks he had left before the semester started, and a touch of magic, he’d be able to turn over a decent amount of blooms and produce from the plot.</p>\n<p>Where had the boy been hiding his methodical talents for the past two years? If he was half as diligent chopping ingredients as he’d been extracting weeds, his potions might not have ended up as such clumpy disasters.</p>\n<p>Potter had a stack of books in his hands, along with a series of rolled parchments precariously perched on top. As he approached, the stack wobbled, but he managed to set them on the coffee table without incident. From his armchair, Severus held out his hand. “An essay, if you don’t mind.” On the table, he had a quill already sharpened.</p>\n<p>Potter hesitated, hands hovering over the scrolls, before he finally selected one and handed it over. Severus glanced at the scratchy heading. It was for McGonagall’s course, though he should have guessed from the heft of the parchment. It was good to see that Minerva wasn’t skimping in her assignments of summer work.</p>\n<p>“Not Potions?” Severus asked, hiding a smirk.</p>\n<p>Potter puffed up slightly. “I thought it would be cheating for you to look over your own assignment,” he said.</p>\n<p>Severus hummed thoughtfully. He was mostly sure that Potter was just looking to avoid having Severus look over his shoddy workmanship on his own subject, but he let it slide. Without another word, Severus unscrolled the parchment and began reading.</p>\n<p>Potter, after a few moments of fidgeting, settled down with an open Charms textbook to take notes for his final essay.</p>\n<p>After only a few minutes, though, Severus put down the scroll. “Merlin, Potter, your handwriting has gotten more atrocious than ever. Did you write this on a flying broomstick?”</p>\n<p>“No!” Potter snapped back, defensive.</p>\n<p>“Do you simply not care about how you appear to your professors?” Severus asked, warming to the rant. “I suppose I can at least no longer take it personally. If this is the type of work you submit to your own Head of House…”</p>\n<p>“I wrote it in the dark, okay?” Potter exclaimed. “The lighting from the street isn’t very bright in my room back at the Dursleys at night, so I did what I had to do. I’d rewrite them if I had time, but I didn’t think anyone would care. They’re not illegible, are they? I still think my handwriting is probably clearer than Ron’s.”</p>\n<p>Severus frowned. “Why were you doing your homework at night?”</p>\n<p>Potter cleared his throat, looking awkward now that his burst of anger was gone. “My aunt and uncle aren’t the biggest fans of magic.”</p>\n<p>From what Severus remembered of Petunia, that was likely the truth. He had never quite thought about what Lily’s sister might have grown into. Surely Dumbledore wouldn’t have left the boy with anyone less than doting. Still, it wasn’t surprising that she was still harboring some resentment toward magic.</p>\n<p>When Severus didn’t respond, Potter continued, “If they saw my books, they’d confiscate them. I’d have done everything during the day if I had the chance.”</p>\n<p>“I’m surprised you did your homework at all with that sort of excuse. Children dream of having guardians who forbid them from doing their work.”</p>\n<p>Potter snorted. “I don’t think any of my professors would accept that as a reason,” he pointed out. “Besides, if I did that, the Dursleys would win.”</p>\n<p>Severus wasn’t surprised to learn that Potter saw his relationship with his guardians as a competition, but he couldn’t help but to agree. If Petunia was anywhere near as nasally and uptight as she’d been the last time he’d seen her, Severus was sure that subverting her rules was an enjoyable pastime. No wonder Potter had ended up the way he was.</p>\n<p>Severus skimmed the first few lines of the essay again, and then shrugged. “You’ll have the chance to improve your handwriting when you rewrite this.”</p>\n<p>“Rewrite it?” Potter repeated.</p>\n<p>Dipping his quill in the inkpot, Severus slashed through the second sentence before nodding. “Rewrite it. Once I’m done correcting this, Minerva won’t be able to see your original handwriting anyway.”</p>\n<p>Potter gulped audibly. It was a supremely satisfying noise.</p>\n<p align=\"center\">#</p>\n<p>Over the next week, against all odds, Harry fell into a rhythm in Snape’s house. He spent his mornings working in the garden. Though he had made snippy comments about the yarrow incident for days, Harry had proven his skill enough for Snape to allow him into his magical greenhouse to continue his work there. Harry took that permission as tacit agreement of their deal—as Harry continued to prune and weed the gardens, Snape continued both to fix both breakfast and dinner for him. Harry wasn’t sure which of them owed the other for their nightly homework routine. Harry would hopefully end the experience with better scores, but Snape was the only one who seemed to enjoy the encounters.</p>\n<p>Harry thought that if Snape took as much vicious glee grading every paper as he did editing Harry’s summer work, Snape loved being a professor more than Harry would have ever guessed.</p>\n<p>There were still times when Snape sent mixed messages, and Harry felt like he was constantly scrambling not to break any unsaid rules.</p>\n<p>Then, one morning, Harry woke up with a sharp, painful tickle in his throat, and a nose so congested he was left breathing through his mouth. He hacked a cough, and then bit his tongue to quiet the noise.</p>\n<p>At breakfast, he felt exhausted and uninterested in the food, but he forced himself to swallow the poached eggs and toast Snape had made. Snape, enraptured as always by the morning <em>Prophet</em>, didn’t seem to notice.</p>\n<p>That was for the best. The last time Harry had been sick, Aunt Petunia had thrown a fit. Though she’d thrown him a few packs of expired cold medicine when he was laid up in his room, she had refused to give him any extra attention. As she’d said, if he couldn’t be bothered to cook for himself, he didn’t deserve to eat.</p>\n<p>Harry could imagine how much worse Snape’s reaction would be. The professor, despite his profession, seemed to have no sympathy for weaknesses of any kind. Snape hadn’t even volunteered to have Harry in his house at all. A sick Harry? There was no chance that would be tolerated.</p>\n<p>After breakfast, Harry drank a full glass of water, steeled himself, and then went outside.</p>\n<p>At first, it seemed as though he’d be able to continue on without issue. Though he coughed and sniffled, his movements felt mostly strong. Then, as the day progressed and the pain in his head and throat worsened, Harry’s breathing grew ragged.</p>\n<p>He had moved into the magical greenhouse to work now that the outside gardens were done, and the additional heat and moisture of the shed made Harry feel as though he was pushing his limbs through syrup.</p>\n<p>He knelt to pick up a watering can, and stumbled. He stayed sitting on the ground for a moment, trying to catch his breath. There was gray at the edges of his vision, and his head was spinning like he’d just woken up from a nightmare. What time was it? Should he go inside to try to find some sort of lunch, or to at least drink some water?</p>\n<p>That wasn’t their deal, though. It had been implied that Harry was supposed to work all day—hadn’t it? The thoughts were a bit difficult to hold on to.</p>\n<p>Shaking his head, Harry clambered to his feet. In a rush, the gray that had been teasing his eyes swarmed in, fuzzing out his vision entirely.</p>\n<p>Then, everything was dark.</p>\n<p align=\"center\">#</p>\n<p>When the emergency alarm appeared beside Severus’s head, his first thought was that he’d absently messed up one of his potion timers. Then, he identified the buzzing shape as the small snitch he’d set up to monitor Potter. The alarm, inspired by a spell overprotective mothers set on their children, was set to alert him when the boy was injured. He’d made some modifications for severity—considering how often the boy had ended up in the Hospital Wing, Severus assumed he’d have been getting daily warnings for general clumsiness.</p>\n<p>Potter was a target for many dark wizards, including the particular escaped convict that had been a large part of Dumbledore’s reason for sticking him with the boy, and Severus had not wanted to be caught off-guard if the boy was attacked.</p>\n<p>He followed the spectral snitch at a brisk walk, resisting the urge to run only by reminding himself that if anyone could find a way to break his alarm system, it was Potter. If he reached the boy and found out that he’d caused a false alarm on purpose, he didn’t want to risk seeming invested. He held his wand at the ready, however, mentally preparing the spells he would need to bind Black or any other attacker.</p>\n<p>When he found the boy, though, there were no Dark wizards to be found. He was sprawled on the floor of the greenhouse, but there were no disturbances to the area around him. If someone else had been there, they hadn’t triggered the wards, and they’d managed to escape in the last two minutes. Severus walked closer and then kneeled beside the unconscious child, already murmuring a diagnosis spell. The astral snitch vanished just as Potter sat up. Their heads nearly collided before Potter noticed Severus looming over him and jolted backward.</p>\n<p>Potter reached up and touched the back of his head gingerly, and then scrubbed a hand over his face. “What…?”</p>\n<p>“I was going to ask you the same question,” Severus said.  </p>\n<p>The boy blinked, and then his face went blank. “Nothing. I’m fine.”</p>\n<p>When he tried to stand up, Severus stopped him with a hand on his shoulder. “You’ll interfere with my spell,” Severus told him. Just then, though, the diagnosis came back. A series of lights appeared on Potter’s form. Purple, on the back of his head, marked an abrasion from where he’d hit the floor, but it was relatively mild. More alarming was the green cloud of sickness drowning his face and lungs, and the pink haze over his chest and head that signified a fever.</p>\n<p>“You’re sick,” Severus said. Now that he looked at the boy, he saw that his face was alarmingly pale, and there was a cloudiness to his gaze he’d seen in a hundred fevered students over the years.</p>\n<p>“I’m not,” Potter said, and struggled to his feet. “I’m sorry.”</p>\n<p>Severus rose with him, making sure he didn’t lose his balance again. With Potter’s luck, the next time he passed out would be directly onto a sharp gardening tool, and then where would they be then?</p>\n<p>Potter took a shaky breath and then reached to the table and <em>picked up his watering can again.</em></p>\n<p>“You idiot boy,” Severus snarled. “What are you thinking?”</p>\n<p>Potter jumped at his exclamation, but didn’t loosen his grip on the pail. “I can keep working. It won’t happen again.”</p>\n<p>“You’re bloody right it won’t,” Severus said.</p>\n<p>Potter nodded once, and then turned away from him. “I’m sorry I bothered you.” He still didn’t seem steady on his feet, and Severus stayed close. If he had to catch a dramatically swooning Potter, he at least wanted them not to both be grievously injured in the process.</p>\n<p>“You cannot possibly be as dense as you’re pretending,” Severus growled.</p>\n<p>Potter didn’t turn back to him. “I can work,” he said again.</p>\n<p>“Stop trying to play the martyr! None of your fans are here to applaud. You’ll not work another minute out here today.”</p>\n<p>Finally, Potter whirled on him. The movement left him unstable for a moment, but he regained his balance without falling. “Make up your mind!”</p>\n<p>“My mind? I couldn’t have been more clear with you, you imbecile,” Severus snapped.</p>\n<p>“You’re mad at me for interrupting you and taking a break, but now you’re telling me to stop working! How is that clear?” The boy was breathing heavily, and there was a fire of defiance in his eyes. Under that, though, Severus recognized a wild desperation, like Potter knew he was being reckless by shouting. “I don’t understand what you want from me!”</p>\n<p>Severus swelled with anger at the boy’s defiance…and then paused. There was defiance and anger in Potter’s voice, yes. But, unless Severus was wrong, it came from confusion, not malice. There was nothing that should have been so baffling about this conversation, even with Severus’s abominable reputation. Surely Potter could not genuinely believe that Severus was going to send him directly back to work after the boy had passed out in his greenhouse. If he had, he should have argued against the unfairness, not tried to work more without a complaint.</p>\n<p>“Dumbledore put you in my care,” Severus said. He picked his words carefully, examining the boy’s reactions for more clues. There was something going on here that he hadn’t expected, hadn’t factored into his plans for their interactions, and Severus did not appreciate stumbling about in the dark. “It’s my job this summer to keep you safe. It would seem that today that means being sure that you rest, instead of working yourself into another faint.”</p>\n<p>“But this is <em>my</em> job,” Potter said, gesturing to the plants.</p>\n<p>“Your job is to stay here with me until you’re safe back at Hogwarts,” Severus said. “’This’ is extra. The plants certainly survived without you until now. Or, if they didn’t survive, it wasn’t a tragedy for me. This work doesn’t need to be done. Especially not at the cost of your health.” He shook his head. “I may be a monster in many ways, but I would not treat you like slave labor. I suppose the jump isn’t so extreme, considering our past interactions, but you seem to misunderstand our roles here.”</p>\n<p>“It’s not slave labor. You’re letting me stay here,” Potter said. There was still an edge of anger in his voice, as though he was frustrated by their miscommunications. He was still pale and shaky, but the defiant tension in his jaw said he wasn’t ready to back down easily. “You can’t send me back to the Dursleys again. I’ve been helping, making up for it.”</p>\n<p>“You’re not being sent back to your relatives,” Severus said. He had sent a letter to Dumbledore after the first day of their cohabitation asking the same question, and had been informed that Potter’s parting stunt—which Dumbledore had avoided describing explicitly—had been bad enough that his uncle was refusing to set eyes on the boy until next summer. “If anyone owes me something for this situation, it’s Professor Dumbledore for putting us both in this situation. While I do not mean to give you free rein over my house, which includes a workshop that would be dangerous for both you and my work, you are not required to pay your way.”</p>\n<p>“I don’t understand,” Potter admitted.</p>\n<p>“Merlin, boy, I don’t know how else to say this. You. Do. Not. Need. To. Work. For. Me. Homework, yes. I will be ensuring that you finish your work as assigned. But I am not so desperate as to need a thirteen-year-old helping me around the house. You’re not a servant.” Severus sniffed. “I have no expectations that you would trust me, but I assume you’d at least trust Dumbledore not to put you into such a situation.”</p>\n<p>That last bit, which Severus thought would clinch the argument, just seemed to make Potter droop.</p>\n<p>“Now, come inside. It’s hot out here, and hotter still inside this greenhouse. You need water.”</p>\n<p>Potter followed him back inside the house, quiet and thoughtful.</p>\n<p align=\"center\">#</p>\n<p>Though Harry was still reeling from the strange conversation with Snape and the knock he’d gotten on the head, the glass of water Snape made him drink in the kitchen made him feel slightly clearer. Once the professor had carefully watched him drink the first glass and then poured him a second, he moved around the kitchen to prepare lunch.</p>\n<p>Harry thought he’d have a moment to close his eyes, but then Snape asked, “Does Molly Weasley force you to work for her when you’ve stayed at their home during the summers? I know you were there last year. The incident with the flying car was quite memorable.”</p>\n<p>“You mean when you tried to expel me?” Harry snapped.</p>\n<p>“Precisely,” Snape said with an unapologetic shrug. “I’ve heard the Weasley matron can be a taskmaster. Does she send you to weed her garden until you’ve passed out from exhaustion as well? Since that seems to be the standard of your expectations.”</p>\n<p>“She would never,” Harry said defiantly, feeling protective of Mrs. Weasley despite knowing that even her children would have called her taskmaster if they’d been sure she couldn’t hear. “She wouldn’t let a guest do any work.”</p>\n<p>Snape made a gesture as though expecting that to mean something extra.</p>\n<p>“Mr. and Mrs. Weasley wanted me to stay with their family,” Harry pointed out when Snape didn’t continue.</p>\n<p>“Fine,” Snape said. “What about your relatives? If there’s a similar scenario where you may be expected to work for your room and board, I suppose one could consider that it, despite the familial bond. After all, many guardians expect their children to help about the house. You believe they would let you work yourself to death?”</p>\n<p>Harry didn’t answer. The response on his tongue was a loud and resounding <em>yes</em>. Of course he was supposed to work until he couldn’t stand for the Dursleys. They’d made that clear to him since he had been old enough to understand, and hadn’t let up on that policy since. There was something strange in Snape’s voice, though, something so dismissive and confident that Harry felt a strange tug of shame. What would Snape say if he knew the blithe comments he was making were true? There was already enough judgement in his tone. Harry didn’t want to fuel Snape for all of his future arguments by admitting that he was right, or by complaining about the Dursleys.</p>\n<p> </p>\n<p>He imagined, vividly, Snape bringing up Harry’s home life during Potions, airing Harry’s life of chores to a snickering, pampered Malfoy. <em>What are you, a house-elf? I always knew you were trash.</em> Malfoy would love to learn that someone loathed him as much as he did, especially if that someone had raised him. This kind of ammunition would fuel Malfoy for years.</p>\n<p>“If anything, just remember that I’m fully aware that you can and will report anything I do to torment you to Professor Dumbledore, and that I’m not interested in sabotaging my own career,” Snape said before setting a bowl of soup in front of Harry. Harry wasn’t sure if he’d used magic to make it more quickly, or if Harry had just zoned out for longer than he’d thought.</p>\n<p>Snape left the room, but returned quickly, setting down a glass vial beside the glass of water. “Drink this.”</p>\n<p>Harry glanced up at him, suspicious.</p>\n<p>With an unreasonably dramatic eye roll, Snape said, “I’m not trying to poison you. Have you listened to a word I’ve said to you today, or has it all fallen on deaf ears? I’m getting tired of repeating myself. If you want this cold gone before you pass out again, you’ll drink what I give you when I give it to you.”</p>\n<p>It was that reminder that Snape was irritated and therefore likely not going to waste time deceiving Harry that made him uncork the bottle and swallow it. It tasted of distilled peppermint, and bit his throat with a frigid coldness on the way down.  </p>\n<p>After he ate, Snape herded him toward his bedroom. He tapped his foot impatiently until Harry crawled into bed, still in his freshly-cleaned working clothes. Harry resented being treated like a child, but he was grateful he was lying down when the potion’s effects hit. Suddenly, the exhaustion from working the whole morning overwhelmed him, and his head swam. The magic traveled from where it had entered his stomach and moved back up his throat into his sinuses. The sensation tickled, like ice was growing throughout his insides. He hadn’t realized how warm he felt until the pleasant chill spread completely.</p>\n<p>From then, it didn’t take long for Harry to slip away into sleep.</p>\n<p align=\"center\">#</p>\n<p>For the next two days, Snape refused to let Harry leave the house. It was only when Harry insisted that he would lose his mind from boredom that Snape even conceded to let him continue doing his homework in the living room during the evenings. Even then, though, Snape kept an eagle eye on him, seeming to know the moment Harry’s energy started to flag.</p>\n<p>The soup he made was consistently over-salted, and the potions ranged from a painful blast of peppermint to a bitter sludge, but Harry slowly began to feel better. It was…strange, being taken care of so attentively. The only other time Harry had experienced someone paying attention to his health had been during his various stays in the Hospital Wing, and then it had been Madam Pomfrey’s job to watch over him.</p>\n<p>If it hadn’t been for the constant eye-rolling, Harry thought that this was what it might have been like to be taken care of by a parent.</p>\n<p>Dudley had been a hardy child, but had complained viciously about the slightest inconveniences. Aunt Petunia had never been particularly warm or nurturing, but she had always gone above and beyond any time she thought Dudley was in pain. Though Harry had been the one doing the cooking, she’d made sure Dudley’s favorite meals were prepared, and that someone (Harry) was there to answer his every demand. She’d smothered Dudley so thoroughly that Harry had always been partially glad that he’d never received the same treatment.</p>\n<p>(Or so he’d thought when he was healthy. Later, when he was in his cupboard under all the blankets he could smuggle out from Aunt Petunia’s watchful eye and shaking so hard that his teeth chattered, he dreamed of what it would be like for her to care for him half as much as she did Dudley.)</p>\n<p>Luckily, Snape wasn’t quite as overbearing, but he was <em>attentive</em>. If Harry hadn’t known better, it almost seemed like he <em>cared</em>.</p>\n<p>Harry couldn’t understand it. Why wasn’t Snape threatening to kick Harry back to the Dursleys, or to send him back to the Leaky Cauldron? He should have been calculating the cost of the potions ingredients he’d poured down Harry’s throat, and the time he’d wasted brewing them. He should have been counting down the seconds until Harry was well enough to get back to work.</p>\n<p>Instead, he was being patient and casual. Snape acted like his attitude was expected. Like it was normal for him to take care of Harry, though he was only even letting Harry stay in his house because Dumbledore had forced him to. When Harry tried to hide how poorly he was feeling or offered to go back to work, Snape just ignored him and told him to focus on getting better before he accidentally killed himself.</p>\n<p>Where was the line? Harry was coughing and sneezing loudly all day and night. He was useless around the house. One morning, he’d even forgotten to make his bed in the haze of his sickness. At what point would Snape finally snap?</p>\n<p>The next morning, Harry woke up with a head clear from mucus, but still full of doubts. His footing in Snape’s house had been shaken, and he didn’t know where he stood. When was the other shoe going to drop? The longer he waited, the tenser he felt.</p>\n<p>When he got up for breakfast, he deliberately left his covers in a rumpled mess at the foot of the bed, and his door cracked open so Snape would see. Snape didn’t comment.</p>\n<p>At breakfast, he asked for a second helping of toast. Snape not only gave him the toast, but made a comment about being relieved that Harry was better. He sneered about no longer needing to play nursemaid, but there was no real bite in it. He still didn’t mention the cost of the potions or the food.</p>\n<p>After double-checking him for a fever, Snape cleared Harry for work in the greenhouse again if he wanted. Harry, after a quick breath to steel his nerves, said that he didn’t want to work that day. Not that he wasn’t feeling better enough, not that he didn’t think he was well enough to do the job right—just that he didn’t want to.</p>\n<p>And Snape <em>shrugged</em>.</p>\n<p>“Just don’t come into my lab,” he said, and then went back to his morning paper.  </p>\n<p>Harry spent the day lounging in his room, slightly annoyed at himself for sabotaging his chance to get back outside. After being sick so long, he was desperate for some sunshine, but he’d already told Snape he didn’t want to work. He waited for Snape to come by his door, see that he seemed healthy and send him out to the greenhouse, but it never happened. Instead, Harry was alone and <em>bored</em>. Other than hearing Snape walk to and from the kitchen in the middle of the day, Harry could almost have been there by himself.</p>\n<p>Finally, he sat up. Why was he suffering through boredom? He wanted to see how far he could push Snape. The longer he walked on eggshells, the longer this whole farce would be drawn out.</p>\n<p>He grabbed his Nimbus from his trunk, which was still packed at the foot of his bed, and then left the house. He slammed the door loudly behind him, and then waited for a long moment just outside for Snape to appear. When his professor remained absent, Harry shook his head and went into the yard.</p>\n<p>For the first several minutes, he kept his broom close to the ground. How would Snape react? If he had a spell that would knock Harry off the broom, Harry didn’t want a long fall. When he realized Snape wasn’t coming, though, Harry started to widen his slow loop around the property.</p>\n<p>With Snape’s wards, Harry had a space half the size of the Hogwarts Quidditch pitch to fly around, which was plenty for him to build up a bit of speed and test some of the moves he’d read about in one of the Quidditch books Hermione had given him.</p>\n<p>Other than one move that left him skidding across the grass, the next several hours passed smoothly. If gardening had helped Harry escape some of the tension of his situation, flying made him feel absolutely weightless. He laughed to himself as he did a quick roll over Snape’s roof, imagining that he was ducking a wayward Bludger.</p>\n<p>Flying was one of the many things he missed about magic during the summers. He’d been jealous of the Weasleys’ makeshift pitch. How much better would Harry be at flying if he had a chance to practice those extra three free months? Oliver would be delighted to know that Harry was getting any flying time in over the summer. Harry would have to mention it during their first practice of the season.</p>\n<p>Hogwarts was so close Harry could almost taste the Welcome Feast. He only had two weeks left with Snape before he’d be back home.</p>\n<p>He frowned, his speed slowing slightly. He just had to survive two more weeks. Why was he risking Snape’s wrath by sneaking out for a flying session? Would this be enough for Snape to put him out on his own—or worse, send him back to the Dursleys? It was no wonder that Aunt Petunia loathed taking care of him. Harry couldn’t resist poking and prodding the restraints set by authority figures, searching for the boundaries he couldn’t cross and finding the rules through trial and error.  </p>\n<p>If this was going to be his last chance to fly for the summer, he wasn’t going to waste it. Harry pushed his worries out of his mind, and then leaned forward over his broom. It was time to test how fast he could go.</p>\n<p align=\"center\">#</p>\n<p>Since Potter finally seemed stable enough, Severus had abandoned the soups he’d been making the previous several days in favor of roast chicken and mashed potatoes that night. He’d spent more time on the meal than usual, appreciating the empty kitchen while the boy had been outside.</p>\n<p>Besides, if he’d had to eat soup one more day, he might have lost his mind.</p>\n<p>It had been a relief this morning when Potter had finally woken up without a fever. Severus had poured every potion he’d had on hand down the boy’s throat, but Potter had exacerbated what seemed an otherwise minor cold with his shenanigans that day in the greenhouse.</p>\n<p>To Severus’s surprise, the boy had been a perfect patient, apart from an irritating need to constantly demur the potions Severus gave him. If there had been any student Severus would have expected to arrogantly see Severus’s carefully-brewed potionwork as a given, it would have been Potter.</p>\n<p>But then, Severus was starting to think there were many assumptions he’d made about the boy that were established on shaky ground. The Potter he’d thought he’d known would have jumped at the opportunity to lay around and be pampered. He’d always imagined James Potter having his parents feed him with a silver spoon, and had never imagined anything different of Harry. Instead, the look Potter had given him every time Severus handed him a spell hadn’t indicated any level of entitlement. If anything, his wary expression had reminded Severus of…himself.</p>\n<p>It seemed more likely that Severus was projecting. Why would Potter need to look like a stray dog, someone more accustomed to a raised hand than a helpful one? Severus had given the boy ample reason to hate him over the last two years of their acquaintance, but never a reason to <em>fear</em> him. Had he?</p>\n<p>Last month, the idea of Potter harboring some healthy fear for him might have been satisfying. He would have seen it as a sign of the respect the boy had never seemed to possess. Now, though, that the boy was alone in a house with him and vulnerable, it made Severus feel like a monster.</p>\n<p>Not that Severus had done much in his life to avoid the label of monster. Still, he preferred to earn the title, not shoulder it by default.</p>\n<p>“I saw you went flying today,” Severus commented, taking a sip of wine.</p>\n<p>Across the table, Potter froze. He looked up, knife still stuck in the piece of chicken he had been cutting. There was that look again, like he expected Severus to lunge across the table or throw a hex at him. He didn’t respond. It looked like he was holding his breath.</p>\n<p>“Do try to avoid running into the wards around the property. I’d hate to be forced to scrap you from the ground, and I don’t believe the Headmaster would take kindly to it.” Then, Severus went back to his meal.</p>\n<p>There was a long beat of silence, and then Potter asked, “Is that it?”</p>\n<p>“Just be aware that no amount of practice will allow Gryffindor to steal another Quidditch Cup,” Severus said.</p>\n<p>Potter didn’t respond, but he gave Severus strange looks throughout dinner. Then, when they were almost finished, he began <em>tapping</em>.</p>\n<p>Rapidly, rhythmically tapping his fork on every surface in front of him.</p>\n<p>“Desist,” Severus said when he realized the boy wasn’t slowing down.</p>\n<p>Potter just raised his eyebrows innocently and stopped. He waited until Severus looked back at the potions journal he was reading before starting again.</p>\n<p>Severus narrowed his eyes across the table at him. “Stop that.” Potter, defiant, met his eyes.</p>\n<p>Finally, Severus cast a quick Silencing charm across the table to mute the noise.</p>\n<p>Severus thought that would be the end of it, but despite the silence, the boy kept doing it. Even without the noise, the flurry of movement in Severus’s periphery combined with the slight shaking of the table to drive him to distraction. From the look on Potter’s face, he knew how annoying he was being, and he was <em>daring</em> Severus to do something. What strange, misinformed Gryffindor nonsense was this? Severus had spent days taking care of the boy and then allowed the boy to go flying without the punishment he seemed to expect. </p>\n<p>Finally, Severus had had enough. Slamming down his fork and knife, he glared at Potter. “That is <em>it</em>!” he exclaimed. “I’m trying to finish my dinner, and you’re deliberately driving me out of my mind.” The boy stopped his tapping and waited, a challenge in his gaze. “If you can’t sit still, go to your <em>room</em>.”</p>\n<p>Potter stared, slack-jawed, back at him.</p>\n<p>Severus pointed firmly toward the kitchen door.</p>\n<p>“That’s <em>it</em>?” Potter demanded, making Severus regret not extending the Silencing charm to the boy himself.</p>\n<p>“Yes, Potter. That is it. I’ve had enough.”</p>\n<p>Potter waved aside that explanation as if Severus had missed the point. “That’s all you’re going to do?”</p>\n<p>“What, were you expecting me to join into your grating impromptu drum solo?”</p>\n<p>“Why aren’t you sending me away?” Potter burst. “I was sick for days, I refused to work today, and I’ve been annoying you tonight <em>on purpose</em>.”</p>\n<p>“I noticed that last one,” Snape said dryly. “Are you trying to get sent away?”</p>\n<p>Potter shook his head. “I mean, why aren’t you <em>punishing</em> me? Why aren’t you taking away my food privileges or adding bars to my windows or caning me?”</p>\n<p>It took most of Severus’s considerable training not to blanch at that litany. The boy had clearly conflated Severus and Filch in his mind. Even Filch was controlled by Dumbledore, though. Did he really think Severus was going to <em>starve</em> him? Merlin, could the boy have been more dramatic? Severus was torn between annoyance and horror. Dumbledore must have been mad when he’d sent Potter to live there. “Do you want to be sent back to your aunt and uncle for the rest of the summer?”</p>\n<p>“No!” Potter exclaimed, growing pale.</p>\n<p>“You’d only need to ask, you know. No reason for hysterics. I’m not holding you hostage. I’ll remind you that I didn’t precisely volunteer for this,” Severus said.</p>\n<p>“No, no. You can’t send me back,” Potter said.</p>\n<p>“Then walk me through just exactly is happening in that brain of yours. Merlin knows I can’t understand what you’re attempting here. Do you want to work, or don’t you? Do you want to stay here or not? Try being clear and using your words, Potter.”</p>\n<p>“You don’t understand? <em>I</em> don’t understand!” Potter said, a thread of desperation in his voice. “You’re not doing anything I thought you would! I’m just waiting for you to actually do something, and it’s driving me insane! You’ve been… You’ve been…”</p>\n<p>Severus gestured for him to continue.</p>\n<p>“You’ve been taking care of me,” Potter finally finished, sounding both baffled and horrified. “Even when I’ve been bad. I don’t know where the line is.”</p>\n<p>“The line where I refuse to take care of you anymore?” Severus confirmed, keeping his voice silky and light, using Potter’s own term so they would be on the same page.</p>\n<p>“Exactly,” Potter said.</p>\n<p>“And when I stop taking care of you, that’s when there will be window bars and starvation?”</p>\n<p>Potter hesitated. Smart boy. He’d finally seemed to realize that Severus’s quietness was a trap. “Yes?” he offered.</p>\n<p>“Potter,” Severus said firmly, resisting the urge to rub his temples. “I’m in charge of your safety for the duration of the summer. Technically, I’m always in charge of your safety, being your professor. But this summer, I’m responsible for you. That’s true whether you’re being helpful or being a brat.”</p>\n<p>“But…” Potter said, clearly not convinced.</p>\n<p>“There are certain obligations I have to you as a child in my care. When you’re sick, I’ll help you get better. When you’re about to turn in your chicken-scratch to your professors, I’ll intercede and make you rewrite it. When you’re hungry, I’ll provide food. None of these are unreasonable demands, no matter what you seem to think of me. If you act out, I’ll send you to your room for my own peace of mind. Your punishments will match the crime, and they’ll be explained in advance. If the situation grows desperate enough that I cannot fulfill my charge from Dumbledore to care for you, I’ll be sure you have somewhere more suitable to go before I kick you out. You won’t be thrown onto the streets.” Severus took a deep breath. “I may be…volatile, at school, but I do have rules, both for myself and those under my care.”</p>\n<p>Severus had still half-expected Potter to roll his eyes at that slow explanation, laughing that he’d never been afraid of any of that. Instead, Potter just seemed cautiously awed.</p>\n<p>“And those rules are…?”</p>\n<p>“I’ve told you them before. No going into my lab. No flying or walking past the wards. No tapping at the dinner table,” he said, raising an eyebrow pointedly.</p>\n<p>Potter frowned. “Are you sure that’s all?”</p>\n<p>“Yes.” Potter was still hesitant, watching Severus from across the table like he was being faced like an unknown, poisonous spider. “Or,” Severus added, voice growing waspish, “I could just beat you for every minor infraction, whether or not you knew it existed. Would that be preferable?”</p>\n<p>“Kind of,” Potter said with a strangled laugh. “At least then I wouldn’t have to keep waiting for it.”</p>\n<p>Severus stilled. Very, very quietly, he asked, \"Is that what your aunt and uncle would do?\"</p>\n<p>Potter matched his stillness, those bright green eyes darting over Severus's expression as though he was looking for the right answer. Not finding what he was looking for, he prevaricated, \"Well... I mean, I...\" Then he shrugged helplessly.</p>\n<p>\"You wanted to know my rules? This is one. I need honesty from you. When I ask you a question, you need to tell me the truth. Not what you think I want to hear, not what you think will get you in the least trouble—the truth. That is not a rule you wish to break to test me.” After Potter absorbed that, Severus continued, “Now. I’m asking what types of punishments your aunt and uncle preferred.”</p>\n<p>That rephrasing helped knock Potter from his frozen state. “They mostly just sent me to my room. That’s not such a bad punishment now.”</p>\n<p>“Now?”</p>\n<p>“In my new room. It’s bigger, and there’s even a window I can look out of.”</p>\n<p>What sort of room didn’t have a window? Still, not as terrible as Severus had begun to imagine. If Severus had raised Potter, he imagined he’d need time without him underfoot as well.</p>\n<p>“There’s a flap where they can slide food in, if they’re not too mad at me. That’s probably their favorite punishment, since they don’t have to deal with me. They can only do it when there’s nothing they need from me right then, though,” Potter said. “If I’m supposed to be cooking, cleaning, gardening, or something, they have to find other ways.”</p>\n<p>Severus gestured for him to continue. Potter just shrugged. Severus took a deep breath through his nose. “For example?”</p>\n<p>“Well. They yell at me. I’ve learned how to mostly ignore that, though, so it’s not very effective. Sometimes when Aunt Petunia is angry, she’ll lock me out of the house so it’s easier for Dudley to get at me. That’s my cousin. He and his friends like to push me around.” Severus’s expression didn’t change, which seemed to embolden the boy. “Aunt Petunia is pretty small compared to Dudley or Uncle Vernon, so there’s not much she can do anyway. I just have to make sure not to annoy her in the kitchen where she can reach her frying pan.” Potter rubbed absently at the side of his head, as though remembering a past injury.</p>\n<p>“But your uncle and cousin don’t need kitchen instruments for their corporeal punishments?” Severus prompted.</p>\n<p>Potter laughed. “They’d be offended you thought they’d need anything but their fists,” he said. “Uncle Vernon would think it was weak to use a frying pan. But if you’re looking for, um, inspiration, I’d much rather be sent to my room without dinner,” he added quickly.</p>\n<p>“You’d prefer starvation to being beaten by a man five times your age,” Severus said neutrally.</p>\n<p>Not neutrally enough. Potter flushed. “It’s not like he was giving me black eyes every day,” he said.</p>\n<p>“I’d think not,” Severus said. “That would have alerted your teachers to what was happening, and that would have stopped him from continuing. I’m sure he was quite skilled at focusing his blows to where they would not be seen.”</p>\n<p>“I had enough bruises from Dudley that no one would have noticed the difference. My teachers wouldn’t have stopped him anyway,” Potter said. “They don’t have any control over how my guardians raise me.”</p>\n<p>“Is that something your aunt and uncle told you, or something you learned from experience?”</p>\n<p>“Both?”</p>\n<p>“Are you sure? That sounded like a question.”</p>\n<p>Potter looked frustrated again. “You’re talking in circles. I can tell you’re trying to get me to say something, but I can’t tell what.”</p>\n<p>“As I said before, I’m looking for honesty. As long as you’re telling the truth, you’re saying what I want you to say,” Severus reminded him. “So. Did you enjoy being a punching bag for your relatives?</p>\n<p>“Of course not! I hate the Dursleys,” Potter exclaimed.</p>\n<p>“Then why have you never told anyone about this?”</p>\n<p>Potter blinked. “Who was I supposed to tell?”</p>\n<p>“Your teachers, for a start. If not in your Muggle schools, then at Hogwarts.”</p>\n<p>“The Dursleys weren’t at Hogwarts.”</p>\n<p>“Thank you for clarifying that,” Severus drawled, and Potter flushed angrily. “You did not think that a Hogwarts professor would have found a way to intervene? Your Head of House, perhaps?”</p>\n<p>“McGonagall has more important things to worry about. I stayed at Hogwarts for all the holidays. I just had to survive the summers. What was she supposed to do then?” Potter hesitated. “I did ask if I could stay for the summer my first year, but Dumbledore said that I couldn’t. No students can stay in the castle then. There’s also some sort of magic bond with the Dursleys. He didn’t explain it, but he said I’d be safe there.”</p>\n<p>“Did you explain your exact circumstances to the Headmaster?”</p>\n<p>“I wasn’t going to bother Dumbledore about that stuff,” Potter said. “The only time he talks to me is after Voldemort has almost killed me. It would be stupid to complain about the Dursleys after that.” Severus was about to point out the ridiculousness of that statement—after all, Voldemort wouldn’t need to concern himself with the boy if his relatives managed to kill him first—but the boy continued. “Besides, my Hogwarts letter was addressed to my cupboard. I assumed Dumbledore already knew everything, and just…decided it was worth the cost.”</p>\n<p>“Cupboard?” Severus repeated, voice very cold and very soft.</p>\n<p>“That was my room before I took Dudley’s old one,” Potter explained.</p>\n<p>“Of course. Is there anything else I should know about your living situation with your relatives?” he asked. When Potter shook his head, Severus nodded decisively. “Very well.” Standing up and pulling out his wand—noting the boy’s flinch—Severus cast a Patronus. The resulting doe was very faint, a physical manifestation of his shaken nerves. “Tell the Headmaster that I need his presence at Spinner's End. Now.”</p>\n<p>“What? What are you doing?” Potter exclaimed.</p>\n<p>“I’m putting an end to this.”</p>\n<p>Potter, if anything, looked more panicked. “You said that I just had to tell the truth! You can’t send me back. I’m sorry for complaining.”</p>\n<p>“You’re not going back there. You’re not going back there ever again.”</p>\n<p align=\"center\">#</p>\n<p>Harry reeled. His dinner was still half-finished on the table in front of him, but the night had taken a dramatic turn. Snape was standing at the other end of the table, looking absolutely thunderous. And, if Harry wasn’t completely mistaken, it was for Harry’s sake.</p>\n<p>When he’d told Snape about life at the Dursleys, he’d expected sneering. Maybe a comment about how the great Harry Potter could face down Voldemort, but whinged about being bullied by his relatives. Maybe Snape would even congratulate the Dursleys on keeping Harry in line.</p>\n<p>Instead, he’d called Dumbledore.</p>\n<p>“Sir, don’t overreact,” Harry said. “Maybe I didn’t explain it right.”</p>\n<p>“Did you lie to me?” Snape asked.</p>\n<p>“No,” Harry said quickly, remembering the rule of the night.</p>\n<p>“Then I believe I’m reacting perfectly reasonably.” He took a breath so deep it seemed to pain him, and then sat back down. “Potter,” he said. “What you have experienced at the hands of your guardians is entirely unacceptable. You have been abused and neglected for years, and it seems no one knew the breadth of the situation until now. So it is up to me to right it.”</p>\n<p>“You make it sound like…” Harry floundered for the words. “You make it sound like I’m some poor abused kid. I wasn’t always the victim. I deserved some of what happened.”</p>\n<p>“You deserved none of it. Children are not punching bags for their guardians. Starvation is never an appropriate punishment. From your reaction when you got sick, I assume that your aunt had you doing household chores far beyond what could be reasonably expected. Did you ever pass out under her care?”</p>\n<p>“That’s…” Harry was sure now that the answer would only make Snape angrier. “Sir, I—”</p>\n<p>“Be honest, Potter. If you learned that Miss Granger had been kept in a cupboard by her parents, would you tell her she had deserved it?”</p>\n<p>“Of course not,” Harry said impatiently. “But—”</p>\n<p>“I know you think you’re very special, Potter. I’ve known that since the day I met you. I just never realized that you took it in quite the opposite direction as I’d expected. You are worth protecting, Potter. It seems the adults in your lives have done a horrific job of it so far, but you are worth protecting.”</p>\n<p>Harry, for some reason, felt like crying.</p>\n<p>“No wonder you ended up taking on Voldemort on your own when you were eleven. I always thought you believed you could handle it alone. But the truth was, you didn’t think anyone would help you.”</p>\n<p>“I tried to tell Professor McGonagall!” Harry interjected, finding the one part of that rant he could even respond to.</p>\n<p>“And she dismissed your worries about Voldemort as the wild fantasies of an eleven-year-old with delusions of grandeur. Then, this past year, you assumed she would say the same about your discovery of the Chamber of Secrets, and you managed it on your own.” Snape shook his head. “Minerva will loathe herself for this.”</p>\n<p>“You can’t tell her.”</p>\n<p>“Can’t I?”</p>\n<p>“Please,” Harry said. Would McGonagall respond this strongly? Would she feel like she’d failed Harry? Or, worse, would she think that Snape and Harry were overreacting and that Harry was weak for needing help from his own relatives?</p>\n<p>Snape paused and gave Harry a considering look. “I won’t tell anyone you do not give me explicit permission to bring into your confidence,” he said. “Except,” he added before Harry could speak, “the Headmaster.”</p>\n<p>As though that had summoned him, there was a knock on the front door.</p>\n<p>Harry gave Snape a pleading look. “You don’t need to do this.”</p>\n<p>“I very much do. Wait in the living room.”</p>\n<p>Harry trudged into the living room and stood behind the couch, keeping it between him and the door. Snape opened the door, whispering something to Dumbledore that Harry couldn’t hear. Over Snape’s shoulder, Dumbledore gave Harry a brief, warm smile. Aflame with embarrassment and shame, Harry didn’t manage to return the expression, and Dumbledore’s smile fell.</p>\n<p>When Dumbledore took a step forward, Snape stepped aside to let him through, and then locked the door behind him. Since Harry knew Snape could have done that with a spell, if he needed to do it at all with the wards surrounding the area, he wondered if Snape was also regretting bringing Dumbledore into this.</p>\n<p>“Good evening, Harry,” Dumbledore said, striding into the living room. “Won’t you sit?” he asked, glancing at Snape to see if he objected.</p>\n<p>Snape waved his assent, and Dumbledore settled onto the couch. Harry moved around the couch to the other side, but didn’t sit. He was hyperaware of how close they were to the safety of his bedroom. Just a few steps, and Harry could escape this situation. Harry wasn’t sure whether it was his conviction that Snape would drag him right back out again or a desire not to seem weak that stopped him from bolting.</p>\n<p>When he realized Harry wasn’t going to speak, Dumbledore said, “I must admit, I was alarmed to receive such an urgent message from Professor Snape, so I’m relieved to see that you seem to be in good health. You are doing all right?”</p>\n<p>Harry nodded.</p>\n<p>“He’s doing better now that he’s here,” Snape said, striding into the living room. Like Harry, he declined to sit, and instead stood beside his usual armchair. “Headmaster, Potter has been telling me some stories I believe you need to hear.” When Harry didn’t jump in, he continued, “Stories about his current guardians.”</p>\n<p>“Indeed?” Dumbledore asked.</p>\n<p>“Headmaster,” Snape snapped. “Did you know?”</p>\n<p>“Did I know what, Severus?”</p>\n<p>Harry felt faint.</p>\n<p>“Potter’s guardians are horrific specimens of human beings, Muggle or otherwise,” Snape said. “They’ve tormented the boy for years, and he says that when he requested not to return there last summer, his request was ignored.”</p>\n<p>“I…” Dumbledore paused, looking forlorn. “I know that the Dursleys do not appreciate what they have in Harry. However, the magic of his blood relation through Lily is undeniably powerful. That house is the safest place for him.”</p>\n<p>“No. I’ll be damned if Potter spends another day with Petunia and her awful husband.”</p>\n<p>“I appreciate you taking care of him these few weeks, but it is vital that he continues to see Privet Drive as his home. I’ll be honest,” Dumbledore continued, a spark of amusement in his eyes, “that I did not expect quite this result when I assigned Harry to stay here. Have you found yourself getting attached, Severus?”</p>\n<p>Snape waved his hand as though dismissing that idea as absurd. “You’re not listening,” Snape said. “You never do, do you? Not with this sort of thing.”</p>\n<p>“It’s only natural to feel protective of Harry, as it seems you now understand.”</p>\n<p>“I understand. But do you? Have you ever asked Potter what his life is like in that house?”</p>\n<p>Dumbledore looked over at Harry. Finally, he seemed to grow solemn to the situation. “I always thought Harry would tell me if there was something truly wrong,” he said softly.</p>\n<p>Harry, immediately, felt terrible for implying earlier that Dumbledore had known everything the Dursleys had done. Snape, however, was less forgiving. “Even I could have told you that Potter would rather handle the monsters in his life without involving competent adults. You never checked in on him, not in all these years? I find that difficult to believe.”</p>\n<p>“There was only so much I could interfere, considering the Dursleys’ distrust of magic. A wizard appearing on their doorstep to interrogate them about their parenting style would not have gone over well.”</p>\n<p>“And you thought they’d enjoy <em>raising</em> a wizard better? Professor Dumbledore, your golden boy has been abused for years. You’re telling me you truly didn’t know? Or that you just thought it was worth it so that the boy would turn into the person you needed him to be?”</p>\n<p>Harry didn’t realize that he made a sound until both adults looked over at him. “I thought Potter would contribute to this conversation, but it seems to be upsetting him,” Snape said. “My office, Headmaster.”</p>\n<p>“Yes,” said Dumbledore slowly, looking older than Harry had ever seen him. “I do believe that’s wise.”</p>\n<p>“Potter, stay here,” Snape instructed, and then practically marched Dumbledore toward his lab.</p>\n<p>When the door shut behind them, Harry finally sat down. He put his head down into his shaking hands.</p>\n<p>He couldn’t decide who was at more risk being trapped in the room with the other—Snape or Dumbledore. Normally, Harry would bet on Dumbledore in any encounter, but Snape had been seething with a level of rage Harry had never seen from him before.</p>\n<p>It was honestly disconcerting to know that, for once, Snape’s rage was on Harry’s behalf instead of against him.</p>\n<p>Harry also, though, felt a warmth in his chest knowing that there was someone fighting for him behind that closed door, someone who had heard Harry’s problems and not only believed him, but had decided to <em>champion</em> for him.</p>\n<p>What were they saying? Was Dumbledore explaining that Harry have over-exaggerated his woes? Would Snape come out angry at Harry? Or worse, were they both sitting with their heads together, shaking their heads about poor, pitiful Harry who couldn’t even stand up to his own family? Dumbledore, who was so proud every time Harry managed to stop Voldemort’s plans and save the world, would be disappointed that Harry had never been able to save himself.</p>\n<p>Feeling sick to his stomach, Harry waited.</p>\n<p align=\"center\">#</p>\n<p>To his credit, Dumbledore listened to Severus’s recount of his conversations and experiences with Potter in attentive silence. His expression, so kind and warm when the boy had been in the room, had calmed into a stoic mask that betrayed no emotion. Severus tried to emulate the same, but could feel passion slipping into his tone.</p>\n<p>He explained Potter’s strange behavior when he had arrived, the way he had tiptoed around Severus as though waiting for an explosion. He told the story of Potter requesting to work in his greenhouse, and then continuing to do so while sick until he lost consciousness. Finally, he summarized the conversation of that night.</p>\n<p>It felt, disturbingly, like a betrayal of Potter’s trust to tell Dumbledore the details, but Severus worried that Dumbledore would dismiss his claims if they were too vague.</p>\n<p>Severus would need to find a way to regain the boy’s trust.</p>\n<p>That thought jarred him enough that he paused mid-sentence, stunned. Since when had he cared about the boy beyond excavating him from his current home situation? Why did he feel the need to make sure Potter knew he was different than his guardians?</p>\n<p>Dumbledore took that breath to interrupt. “Thank you, Severus. I understand. I must admit, I’m surprised to find you as the boy’s champion, no matter the situation.”</p>\n<p>“You honestly believe I would let Lily’s son live in a cupboard?” Severus snarled.</p>\n<p>“You never seemed to mind when it was James’s son.”</p>\n<p>Severus was silent for a moment, biting down on his initial gut response to disparage his childhood bully. “Not even Potter’s son deserves this abuse,” Severus said. He cleared his throat. “If one deserved suffering based on their father’s actions alone, my life would… Well, I suppose it would look the same as it does now.”</p>\n<p>“Don’t be so dour, Severus. Despite your struggles, it seems that you’ve moved far beyond the struggles of your youth. You’re a brilliant Potions Master, you’re free from Voldemort’s control—” Severus flinched. “—and you seem to have made a connection with young Mr. Potter out there.”</p>\n<p>Severus waved away that line of thought. “What I’m trying to say is that the boy has been suffering, and there’s no reason to let it continue.” When Dumbledore opened his mouth again, Severus pressed, “No blood bond will be worth it if the boy dies in their care. These situations escalate, especially if the abuser knows that no one will interfere.”</p>\n<p> </p>\n<p>“I do not believe they would permanently harm him. They do fear me, if not as much as they perhaps should,” Dumbledore said. “You must admit that Harry has grown into a spectacularly brave and selfless young man despite the circumstances of his childhood.”</p>\n<p>“He’s brave because he doesn’t think anyone will help if he asks. He’s selfless because he’s been taught that his life has no worth,” Severus snarled.</p>\n<p>Dumbledore’s shoulders slumped. “What do you suggest then, Severus?”</p>\n<p>“He needs somewhere safe to live. He can’t go back to Petunia.”</p>\n<p>“And where is this safe place?”</p>\n<p>“He could stay at Hogwarts.”</p>\n<p>“So few of us are there during the summer, that would be as good as asking the boy to live by himself. If I could take care of him, you know that I would, Severus. My duties involve far more travel and risk than reasonable, though, and I am an old man.”</p>\n<p>“No, Hogwarts wouldn’t work,” Severus agreed. “Ask anyone in our world. Take out an ad in the newspaper and we’d have a hundred applications by dawn.”</p>\n<p>“An entire list of people who want to have authority over the Boy-Who-Lived, who would treat him like a hero, and not a child.”</p>\n<p>“The Weasleys would adopt him in a heartbeat. Don’t forget, I’ve met both Molly and Arthur. If their finances can’t take it, ask anyone else from your Order. Don’t pretend there aren’t people you trust with this.”</p>\n<p>“Ah, but are there people <em>Harry</em> trusts?”</p>\n<p>“That hasn’t been your priority this far,” Severus pointed out, but he took that to heart. The only reason Potter hadn’t run away from Severus’s house that summer was because the thought hadn’t occurred to him. If he was with strangers in a house without wards, who could stop him from recklessly striking out on his own? Potter would need a firm hand, enough that he could trust his guardian to place and enforce rules that were for his own good, but someone subtle enough not to trigger the boy’s fear. Severus narrowed his eyes. “You’re trying to get me to volunteer.”</p>\n<p>“I know better than to try to manipulate you, my boy,” Dumbledore said. “And moreover, despite your current rush of protectiveness, I do not see you happily agreeing to be Harry’s guardian in the long term. For I fear that this placement will be for life. Harry’s greatest tasks are yet ahead of him, and if we’re going to tear him from his current home—”</p>\n<p>Severus scoffed.</p>\n<p>“—we should be sure that the second placement is permanent. Leaving him floating between different guardians would likely be even worse for his wellbeing. Perhaps Dedalus would be willing to volunteer. He has a friendly demeanor.”</p>\n<p>“You must be kidding,” Severus said. “Diggle would faint at the very idea. Potter doesn’t need hero worship any more than he needed the abuse.”</p>\n<p>“Arabella loves the boy, but she lives down the street from the Dursleys. I suppose if we erected the right wards…”</p>\n<p>“He needs stability, not a madhouse.”</p>\n<p>“I thought you had grown beyond your prejudice against Squibs,” Dumbledore said coolly.</p>\n<p>“It’s not her lack of magic I object to. It’s the cats.”</p>\n<p>Dumbledore tapped a finger to his chin. “Hagrid has always loved the boy.”</p>\n<p>“Hagrid is Hagrid. He wouldn’t be able to maintain any level of discipline. Potter would be as ill-behaved as any of Hagrid’s other charges within the year.”</p>\n<p>“You see? It is not so easy as you said,” Dumbledore said. “Why do you think I selected the Dursleys at first? Or sent him to you this summer? If there were an easy answer, I would have found it. Not to be arrogant, but there is rarely a solvable puzzle that I can’t sort out, especially not after twelve years.”</p>\n<p>“Then it seems we only have one option,” Severus said. “He’s staying with me.”</p>\n<p>“That’s not necessary,” Dumbledore said.</p>\n<p>“You said it yourself. If that were easy to find, you’d have saddled someone else with him this summer. But you didn’t. There was only me.”</p>\n<p>“You understand that this is not a decision to make on a whim, or to prove something,” Dumbledore said. “Harry has an important future ahead of him.”</p>\n<p>“You know I believe the Dark Lord will continue trying to return. Unlike you, I’m not willing to leave his defeat in the hands of a thirteen-year-old simply because of a prophecy by that old bat. If he does return, I plan on doing all in my power to stop him. I’ll make sure Potter can protect himself if he’s targeted, but I won’t usher him out the door to his doom. If that’s what you’re looking for—and that is what the Dursleys would have done—then maybe I’m not the best choice in your eyes. But you’d be wrong. He needs stability. He needs someone strong enough to protect him. I can do that.”</p>\n<p>Dumbledore, to Severus’s surprise, nodded. “Then it’s settled.”</p>\n<p>The dual rush of panic and relief that crashed over Severus was nearly overwhelming, but he cleared his throat. “There is one <em>other</em> matter to discuss,” he said silkily. “The matter of the Dursleys’ punishment.”</p>\n<p>“Ah,” Dumbledore said. “That, you will have to leave to me.”</p>\n<p>“But, sir—”</p>\n<p>“No matter what you seem to believe, I do not take kindly to the abuse Vernon and Petunia committed under my watch. I was the one who placed Harry in their care, and it is up to me to provide…feedback on their performance. I will not need assistance.”</p>\n<p>There was an icy glint in Dumbledore’s eye that Severus rarely saw, the one that betrayed the strength and cunning that was usually hidden behind a jovial mask. “No,” Severus agreed thoughtfully. “I suppose you won’t.”</p>\n<p align=\"center\">#</p>\n<p>When Dumbledore and Snape emerged, Harry felt like a spring that had been compressed for years, just waiting to be released. He bolted to his feet, head rushing from the sudden movement.</p>\n<p>Dumbledore approached Harry, reaching for him, but stopped shy when Harry took a small step back. Harry realized he’d been moving to put his hand on Harry’s shoulder, and felt a shamed flush take over his cheeks. Dumbledore would never hurt him. He <em>knew</em> that. Why couldn’t Harry just control his reactions?</p>\n<p>“My dear Harry,” Dumbledore said. “It would seem I owe you an apology.” Harry sent a quick glance at Snape, who was standing further back with a deliberately neutral expression. Dumbledore continued before Harry had to come up with a response. “I do hope you’ll forgive me.”</p>\n<p>“Yeah,” Harry said quickly. “Sure. I mean, of course, sir.” Why was Dumbledore apologizing? For leaving him with the Dursleys? Or for letting him stay with Snape that summer?</p>\n<p>“I’ve only ever wanted the best for you, Harry. Unfortunately, even I make mistakes, and in this case, they have caused you suffering. And worse, you felt you could not tell me. That is my biggest regret of all.”</p>\n<p>Harry opened his mouth, but he couldn’t find a response. He looked at Snape for guidance again. His professor just shrugged and gestured for Harry to turn his attention back to Dumbledore.</p>\n<p> </p>\n<p>“Going forward, please know that you can tell me anything, Harry. Not only that, but I expect to hear from you,” Dumbledore said.</p>\n<p> </p>\n<p>“Yes, sir,” Harry said.</p>\n<p> </p>\n<p>“Now,” Dumbledore said, straightening. “You must know that Severus and I have been discussing your future. Obviously, a return to the Dursleys would be untenable. You will not be returning to Little Whinging, not unless that’s what you desire. Is that what you desire?”</p>\n<p>“No,” Harry said urgently. “I don’t want to go back.”</p>\n<p>“How was your summer with Severus? Would you also prefer not to stay here? At this point, school is about to start. You could come to the castle early, though I fear there would not be much in the way of entertainment. You can leave if that is what you want.”</p>\n<p>“I,” Harry faltered, looking for a third time at Snape.</p>\n<p>This time, Dumbledore shifted to block his line of sight. “Do not fear to speak your mind, Harry.”</p>\n<p>“I don’t mind staying here.”</p>\n<p>“Are you sure?”</p>\n<p>Feeling defensive, Harry said, “Things have been good here. Snape cooked for me every day and helped me with my homework. He let me work in his garden, but also didn’t care when I took a day to practice flying,” Harry said. “He even took care of me when I was sick.”</p>\n<p>“Potter, you know those are not supposed to be abnormal things,” Snape drawled, but there was an unexpected hint of fondness in his exasperation.</p>\n<p>“I like staying here,” Harry told Dumbledore firmly.</p>\n<p>“Very well. Then it’s settled. Now, Harry, I must be off. It is getting late, though I suspect it is more trouble for my bedtime than yours. I’ll see you at the start of term feast. Again, come to me whenever you need to talk. You know where to find me. The password this year is ‘cauldron cake,’” Dumbledore said with a wink. Then, he tipped his hat and departed into the night.</p>\n<p>Severus closed the door behind him and waved his wand, presumably replacing the wards he let down to allow the Headmaster entrance to the house.</p>\n<p>“Of course he leaves it to me,” Snape grumbled quietly.</p>\n<p>Harry swallowed when Snape turned back to him. There was a strange blend of conflicting emotions on the professor’s face, and Harry couldn’t begin to guess what they meant.</p>\n<p>“You don’t have to stay here,” Snape said brusquely. “Not if you don’t want to. But if you do, you can.”</p>\n<p>Harry shrugged. “I already told Dumbledore I’d stay here for the rest of the summer.”</p>\n<p>Snape just shook his head. “Sit down. We should talk.”</p>\n<p>If it weren’t for the fact that Snape also looked nervous, Harry would have been terrified. To his surprise, he found that he was less nervous than he would have expected. Normally when an adult in his life wanted a serious conversation with him, it was to scream at him, or tell him the story of his parents’ murder, or to bully him into handing over the Sorcerer’s Stone. Tonight, after everything Snape had already done for him, even Harry couldn’t believe that he was about to yell at him.</p>\n<p>Snape had made the decision to call Dumbledore, had dragged the Headmaster away for a conversation, and had agreed to let Harry stay. He’d looked out for Harry this far. He might be annoyed by Harry’s reaction to the situation, about his unwillingness to help Snape start the conversation with Dumbledore. But even if he was mad, Harry was <em>safe</em> here.</p>\n<p>Harry perched on the edge of the couch, watching as Snape slumped into his armchair. Snape rubbed a hand over his forehead, and then said, “You might have guessed what I’m about to ask you. And I am going to be <em>asking</em>, not telling. I don’t imagine this would work without your cooperation. I’ve seen your interactions with authority you’re not interested in respecting.”</p>\n<p>“Sorry, sir?” Harry asked, completely lost.</p>\n<p>“You need a new guardian. It seems I am the best candidate.”</p>\n<p>Harry took a moment to process that. “You mean…permanently?”</p>\n<p>“Yes, Potter,” Snape said with surprising patience. “Permanently. You would come back here every summer until you’re of legal age. I tend to stay at Hogwarts for Christmas and Easter, so you’d either stay there with me or visit your friends at those times. As we discussed earlier, there would be some rules you’d need to follow. Improving your handwriting would be at the top of that list. But, ah,” Snape hesitated, “I believe I can improve on the experience you had this summer, once we’re on the same page. And I believe I would be an acceptable option. I know you’re not fond of me, and that you might have someone else in mind, and I won’t force the issue. This should be your choice.”</p>\n<p>“You want to be my guardian,” Harry repeated. There were a thousand questions in his mind, but all he could ask was: “<em>Why</em>?”</p>\n<p>“Because you need a new guardian,” Snape said.</p>\n<p>“Oh,” Harry said, slumping slightly. What had he expected? He had been nothing but trouble for Snape so far that summer. This was a request made from obligation. Dumbledore had probably forced him to make the offer.</p>\n<p>“And,” Snape said, “to everyone’s surprise, I believe we may be a good fit. Having you here this summer was not quite as…miserable as I expected. You’re sharper than you show in class and you’re motivated. It seems a shame that you have not been given the chance to reach your full potential.”</p>\n<p>From anyone else, that would have all sounded like the faintest praise. From Snape, though, Harry felt like he was being awarded some high honor. Snape had basically just admitted to <em>liking</em> Harry.</p>\n<p>“You don’t need to decide tonight. Either way, rest assured that you will <em>never</em> go back to your aunt and uncle’s house. That is in no way contingent on your response to me.”</p>\n<p>“The answer is yes,” Harry blurted.</p>\n<p>Raising an eyebrow, Snape said, “You’re so sure?”</p>\n<p>Harry nodded. “I’m sure.”</p>\n<p>For a moment, Snape seemed to be at a loss for words. Then, he nodded. “I’ll do my best to do this right,” he said solemnly. “Now, the Headmaster was right. It’s getting late, and you’ve had an active day, especially so soon after being ill. It’s time for you to go to bed.”</p>\n<p>Harry considered protesting, wanting to hear more details about this new situation, but a yawn escaped him at the thought of getting some sleep. “Okay,” he said. He stood up and headed toward his room. He paused at the door. “And, er, thank you, sir. For everything.”</p>\n<p>“You don’t need to thank me, Pott—Harry,” Snape said. “This won’t be easy,” he added, as though needing to be sure Harry had thought through his answer.</p>\n<p>“Nothing is,” Harry said wryly.</p>\n<p>That answer seemed to pain Snape, but he nodded. “Together, we’ll see if we can change that. Sleep well, Harry.”</p>\n<p>Harry smiled, and went to bed.</p>"
}