{
  "id": "12665469",
  "url": "https://archiveofourown.org/works/12665469?view_full_work=true",
  "author": [
    "Skalidra"
  ],
  "title": "Mark My Words",
  "rating": "Mature",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "DCU (Comics)",
    "Batman (Comics)"
  ],
  "relationships": [
    "Tim Drake/Jason Todd"
  ],
  "characters": [
    "Jason Todd",
    "Tim Drake"
  ],
  "additional_tags": [
    "Alternate Universe - Soulmates",
    "Soulmate-Identifying Marks",
    "Angst",
    "Hurt/Comfort",
    "Enemies to Friends to Lovers"
  ],
  "language": "English",
  "series": "",
  "published": "2017-11-08",
  "completed": "2017-11-08",
  "words": "15,513",
  "chapters": "2/2",
  "comments": "308",
  "kudos": "10,442",
  "bookmarks": "1,734",
  "hits": "99,274",
  "summary": "<p>The thing is that Tim's known for a while who his soulmate is. From the moment that a 'Red Hood' shows back up in Gotham, Tim knows exactly who the words stamped across the back of his thigh - 'Hey, Replacement' - belong to. Not a first conversation, not the last, but a moment somewhere in their lives that Tim has no choice but to wait for. Because really, how else is Tim ever going to convince him?</p>",
  "notes": "<p>Welcome! This is one of my two projects for the DCU Bang (the second will be posted next week). For this one I worked with the amazing TaneKore/JayKore, for an idea that I've been carrying around for awhile. I'm glad to have it out on a page, and I hope you'll all enjoy!</p>\n<p>A note about the world. This is a soulmate-mark AU in which you have printed on your skin, somewhere, a sentence your soulmate will say to you at some point. Not necessarily first words, or last, but an exchange that will happen. Tim's situation in this story is a very rare one, in that world.</p>\n<p> </p>\n<p> <a href=\"https://skalidra.tumblr.com/\" rel=\"nofollow\">You can find my Tumblr here!</a><br><a href=\"https://jaykore.tumblr.com/\" rel=\"nofollow\">You can find JayKore's Tumblr here!</a></p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>Thanks for reading! If you like the art (and you should, it's gorgeous) head over to JayKore's post <a href=\"https://jaykore.tumblr.com/post/167286661550/mark-my-words-by-skalidra-drawn-for-the\" rel=\"nofollow\">right here</a> and like/reblog it!</p>",
  "text": "<p>Tim wishes, from the moment he figures it out, that the business of soulmates was all a bit easier. He wishes he could just touch and have it happen, or that people would know right from the very start (at a look, at a word) that the person they've just met is meant to be theirs. Forever.</p>\n<p>He wishes it was that easy, because the problem is that he knows long before he ever actually comes face to face with his.</p>\n<p>The moment that there's word of a 'Red Hood' in Gotham, and Bruce orders him to stay out of the city until things are settled, the pieces fall into place for him. It might only be a suspicion to anyone else, there's not quite enough information or evidence — exceedingly well trained, familiar with their movements, familiar with <em>Gotham </em>— to make a call that won't be questionable and he knows that, but he's got another piece of the puzzle stamped across the back of his left thigh like a brand and that's all he needs to be sure.</p>\n<p><em>It's Jason, </em>he sends to Bruce, not really wanting to explain his reasons but wanting to give the answer anyway. He gets a sharp message back telling him not to jump to conclusions, and Tim lets it drop. Bruce knows his thoughts now, at least the important ones, and he doesn't need to wait to know he's right.</p>\n<p>He suspected it, back when Hush attacked them all and the older, white-streaked Jason took him captive. He didn't know what to say then, but that Jason had turned out to be Clayface anyway, so he guesses that it didn't matter. But such a direct call back to Joker's theorized creation? Such precisely targeted violence as what's in the reports Bruce has put in? Jason is a possibility, given the madness of their world, and the words printed on Tim's thigh have never seem to fit anyone else. They fit Jason.</p>\n<p>Who else is going to call him 'Replacement'? <em>Jason</em> is who he replaced, and if anyone from the Titans or Teen Titans was going to call him that they would have done it already. Given the evidence he has before him, it's the right answer, and he's never felt this sort of cold certainty about something and been wrong before.</p>\n<p>He almost wishes that he was.</p>\n<p>He's not vindicated, when it comes out that he was right. The Red Hood is Jason Todd, once-Robin and now a lethal, vengeful crime lord with a variety of highly-trained skills and one clear target. Them. All Tim feels is a dull sort of resignation, because the universe has landed some heavy blows on him before but this might be the worst yet.</p>\n<p>Jason is his soulmate. The kid and memory that he idolized and tried to live up to. The man that now would probably like to smash his face in and then put a bullet in his head.</p>\n<p>What he decides, is that he needs the words to answer. Something unique, something personal. A sentence that he's <em>absolutely </em>sure that Jason will recognize, instead of something generic enough that it risks being missed. He <em>has </em>to find something.</p>\n<p>The universe might think he's a punching bag, but he'll be ready when the time comes. He can make sure of that.</p>\n<p>The first time he meets Jason, really meets him, the words don't come. It's brilliantly strategic, and he can't help respecting that even as Jason beats him into the ground in a building filled with his sleeping or incapacitated team members and leaves him unconscious and broken. Alive though, which he doesn't fully understand but is maybe a step in the right direction.</p>\n<p>There are moments here and there, passing words and bits he hears third hand. When they do meet again it's… better. Jason isn't nearly as angry as he was the time before, and there's a certain kind of respect between them. He gives Jason one more chance, but the words don't come. The certainty in his chest only gets colder as time goes on.</p>\n<p>In the second real fight, Bruce is gone and they're all struggling to fill his place. Jason is so much further gone than he was before, and Tim tries to beat him, he really does, but the batarang to his chest and throat are pretty definitive finishers; he nearly dies, even though the suit he's wearing keeps the blows from being immediately fatal. He gets the information later that Dick is the one to beat Jason, before he decides to fall into the river instead of letting himself be rescued.</p>\n<p>For a while there's nothing, but Tim never truly believes that he's gone, and he's right. It's awhile before they meet again, but he keeps up to date. Fighting Dick and Damian, showing up with a sidekick, in prison, out of prison… Most of it he's not there for.</p>\n<p>When the day finally comes, it's just a day like any other.</p>\n<p>He's out in Gotham, running a patrol on a quiet night while Bruce attends some gala or another to make sure the people believe he's still alive. It's not a completely dead night, but there's not much apart from some minor crime. At least, not until the Red Hood drops down on the rooftop beside him, helmet hanging from his fingertips, mouth curled in a crooked grin that doesn't look entirely friendly. A large part of Tim goes tense and wary, the second he hears those footsteps and identifies the source. He doesn't go as far as reaching for his staff — Jason's hands are still empty — but he does shift to a better angle and dedicate his attention to the new threat.</p>\n<p>Jason strolls across the roof as if there's nothing that could make him afraid, coming within a dozen feet before offering a drawled, \"Hey there, Replacement.\"</p>\n<p>Tim feels that little hollow of frost in his chest shatter as the words wash through him, as the back of his thigh aches for a sharp moment and that <em>certainty </em>finally comes true. He swallows before he takes a shaky breath, barely paying attention to how Jason's grin is sliding into a frown as he doesn't answer the greeting. The words he searched for, memorized, and practiced more times than he can count come to the tip of his tongue; he gives a little huff of empty laughter before he says them.</p>\n<p>\"Whether she wished or feared it most, she could scarcely determine.\" It always seemed… right. If he was going to pick a literary quote, and if he was going to take it from a book he knows Jason loved, why not echo his own feelings in that quote?</p>\n<p>Jason flinches back like he's been stabbed. His left arm flattens protectively against his side as he automatically tilts away, as if expecting to be attacked. \"You—”</p>\n<p>Tim just watches.</p>\n<p>\"That's my favorite book,\" is what Jason actually says, sounding shaken, unnerved.</p>\n<p>\"I know. It's in your file.\"</p>\n<p>Anger joins it within a second, and Jason takes a sharp step forward as the hand not pressed to his side tightens to a fist and his teeth flash. \"If you're quoting my fucking mark just to screw with me, I swear to god—”</p>\n<p>\"They're not in the files,\" Tim interrupts, with a shake of his head. \"It's too personal, too capable of being used to lead one of us astray. You know that, Red. And I'm not…\" He lifts both hands to run them through his hair, feeling helpless and numb and like laughing all at the same time. Information. Give Jason <em>information</em>. \"I've known for years,\" he says; the first thing he thinks of. \"When it was confirmed you were alive again, I knew. You were… the most likely candidate to ever say that to me, so I looked you up. I found your— your love of books, your <em>favorite</em>, and I picked a quote from it.\"</p>\n<p>Jason's expression is falling somewhere close to a panicked desperation. \"No, I— I loved that book <em>because</em> it was where my mark came from. I thought anyone who would quote that to me would be—”</p>\n<p>Tim can only fill in the blanks at the end of that sentence as Jason steps back. A lover of literature? Well read? Highly intelligent? Well, at least he fits one of those things. Two, if case files count as real reading.</p>\n<p>\"Red—”</p>\n<p>\"No!\" Jason snaps, backing off another step. \"No, <em>fuck </em>this. This isn't happening. This is some shit dream or an accident or something. You're not my fucking soulmate, you got that?!\"</p>\n<p>Tim is pretty rapidly shifting towards the ‘laugh hysterically’ course of suggested actions. “Okay,” is about all he can manage in the face of that adamant refusal. Jason is glaring at him, arm still flattened defensively against his side, looking like he’s about to sprint off the building at any moment, and this… This is not how any of this was supposed to go. “Sorry to disappoint,” is what comes out of his mouth next. Faint.</p>\n<p>For a second he thinks maybe it’s faint enough that Jason won’t hear it, but it occurs to him that Jason reads lips at about the same time that the sneer of his mouth turns into a snarl. “Don’t you even fucking start,” is snapped at him. “This isn’t real; I’m not doing this.”</p>\n<p>There’s a jagged edge to Jason’s movements that’s wholly unfamiliar, as he steps away and yanks the helmet back on. Tim’s seen Jason be wild, seen him be vicious and seen him in pain, but he’s never seen him be anything but graceful. For all his size, and the bulk he used to have before he slimmed down, and the weight he throws around, Jason’s always been <em>graceful</em>. This is… something else. Something wrong.</p>\n<p>“Red—” he tries again.</p>\n<p>The gun is out of its holster and aimed towards his chest in the next moment, before he has time to do more than flinch and lift his hands halfway up in surrender.</p>\n<p>\"Back the <em>fuck </em>off!\" Jason shouts. \"You stay the hell away from me or I'll put one between your fucking eyes. I am <em>not your soulmate.\"</em></p>\n<p>Tim can only watch and try to keep breathing as Jason turns and runs for the edge of the building, dropping over the side and vanishing into Gotham's streets before he manages to catch his breath. His hands lower a couple moments later, belatedly. He stares at the point where Jason vaulted the ledge.</p>\n<p>Then the laugh escapes, a harsh bark of hollow amusement that he smothers by clasping his hand over his mouth. Jason… Jason doesn't believe it. Doesn't want him. (Why is he surprised? He knew Jason hated him; he has the scars to prove it. He already knew, didn't he? Isn't that what the quote was supposed to fix? Wasn't that the <em>point?</em>)</p>\n<p>He can feel it, is the worst part. The low ache of the words printed across the back of his thigh, that he's <em>finally </em>actually heard. It feels like a bruise, and he guesses that's accurate enough. This whole thing may as well have been a sucker punch, for as unprepared as he was for it and how hard he's finding it to breathe now that it's over with. Or maybe that's the hand still over his mouth. It's… It's hard for him to tell how much of this is external and how much is some sort of phantom pain that is squeezing his chest tight.</p>\n<p>He can't do this here.</p>\n<p>It's hard to make his hand drop away from his mouth, but he forces it before he activates a comm line out to Barbara. He doesn't know if she's working right now, but even if she isn't her systems will record his words so she can check them later.</p>\n<p>His voice sounds weak to his own ears as he says, \"Oracle, I'm done for the night. It's quiet out here.\"</p>\n<p>No answer. He shuts it back off.</p>\n<p>Getting back to his apartment happens in an automatic daze, and it isn't until he's halfway through stripping the suit off that everything starts to crash back down. His hands tremble, his breath coming short and sharp and he gives up on getting out of the rest of the suit. Pressing his back to the wall helps a bit with the encroaching urge to hyperventilate, but it doesn't stop his eyes from stinging with tears, or his chest from <em>aching </em>like he really did get hit. He knows this feeling; the raw, desperate pain and fear that claws his reasoning and mind to bits. He remembers it from when his father was killed. Everything just… falls apart.</p>\n<p>He lets his head fall into both hands, shifting to press his back into the corner between his bed and the wall, and lets go.</p>\n<p>Jason disappears off the face of the Earth. Granted, Tim isn't looking for him, but he thinks maybe that's for the best. Jason doesn't want anything to do with him, and it's not like trying to hunt him down will do anything. At best, it'll drive Jason further into hiding, and at worst it'll get him shot. Neither of those things is a good outcome, so Tim ignores how much he wants to run at least a search or two to look and makes himself leave it all alone.</p>\n<p>Things go… numb. His thigh aches almost constantly, but soon enough that becomes normal and he stops noticing. It's worst in the early hours of the morning after patrol, when he's trying to sleep and there's nothing but his own breathing and the shadows of the ceiling. That's when he starts to feel the ache, and ends up tossing and turning until exhaustion finally pulls him under. No amount of rubbing at it or ice or heat works, and though he tries to research it the internet doesn't offer any sort of solution to the feeling. It's nothing that can be affected by physical solutions, but at least all the sources online agree.</p>\n<p>It aches; his soulmate is in pain. There are other feelings, other things that people widely agree on, but Tim's never felt it go hot, or cold, or itch, or anything but that ache. That information gets to him more than he'd like to admit.</p>\n<p>Sixty-seven days go by, achingly slowly, before there's a knock on his door.</p>\n<p>It's unusual enough — his family have a habit of just coming through windows — that he stills for a moment before actually heading to answer it. It's still early by their standards, about eleven, and he yawns as he gets to the door, taking a glance down to make sure that he's not wearing anything with too-big holes in it. Checkered red and grey sweatpants — a secret gift from Alfred, for comfort, which is a fact he is never, ever to reveal on pain of no homemade meals ever again — and the white tank he sleeps in. He's even got a pair of boxers on underneath the sweatpants, which really is a step up from most days. Yeah, that's good enough.</p>\n<p>There's another knock, and he calls a, \"Coming,\" towards it as he takes the last couple steps.</p>\n<p>He flicks the main lock and opens the door, and comes face to face with a broad chest. He blinks, raising his gaze, and his whole world narrows down as he draws in a sharp breath.</p>\n<p>Jason is standing in front of his door. His face is bare, and that draws Tim up short. He's pretty sure that the last time he saw Jason without a mask, they were talking through a sheet of prison-issue plastic and Jason was still recovering from a bullet through the knee. He's seen Jason a few times since then, not counting the disaster of their last meeting in Gotham, but not without at least a domino in the way. It's jarring to look up at him and actually see his eyes, greener than any of the rest of their family.</p>\n<p>There's a moment of silence as he stares, and then Jason shifts, gaze flicking to the side as he offers a guarded-sounding, \"Hi.\"</p>\n<p>Tim remembers to blink then. \"Uh… Hi.\"</p>\n<p>It's after he says it that his mind actually decides to catch up to the situation at hand, and he drops his gaze to do a quick sweep for weaponry. Jason <em>isn't </em>in armor, is the first thing he notices. The leather jacket remains, but beneath it there's just a white shirt and a pair of dark jeans. The only bits he recognizes from Jason's 'costume' is the jacket itself, and the steel-toed boots all the way at the bottom. Otherwise, it's all… casual. And unarmed. No weaponry, hidden or otherwise, as far as he can tell.</p>\n<p>One of Jason's boots scuffs the ground, and then there's a quiet, \"Can I come in?\"</p>\n<p>He hesitates, his hand twisting the door knob. For some reason, \"Going to stab me again?\" is what comes out of his mouth.</p>\n<p>There's something in Jason's expression that cracks for a second, before it gets sharply hidden behind a hollow smirk. \"Not planning on it.\"</p>\n<p>It's probably as much of a guarantee as he's going to get.</p>\n<p>Tim carefully steps back, moving aside so that Jason, after a moment of pause and a look that almost reads as wary, can step into his apartment. He closes and locks the door again, and turns back to find Jason standing to the side of the entry corridor, shoulders raised a couple inches in tension, hands in the pockets of his jacket. For a second that makes him nervous, but he pushes the feeling aside and takes a breath in, tilting his head in a silent invitation for Jason to follow before he heads for the living room. It's... not as much of a mess as it usually is, thankfully. (Having a hard time sleeping means that he's had to fill the time, and some of that actually turned into cleaning.)</p>\n<p>\"There some case going on?\" he asks automatically, even though he's sure that this visit has nothing to do with a case.</p>\n<p>Jason is here, unarmed, at his home. What other reason except the whole soulmate business could there possibly be?</p>\n<p>He doesn't even get an answer. But when he turns around, standing at the far side of his couch and not quite comfortable enough to be the first to sit down, Jason's gaze is lifted towards his TV but distant. He doubts that his tech is actually interesting enough to be focused on, especially since it's not turned on.</p>\n<p>Then Jason asks, not looking at him, \"Your mark ache as much as mine?\"</p>\n<p>He's not sure about the specifics of that question, but he decides to just answer one option. \"It's pretty much all the time,\" he admits, with a small shrug. \"Supposedly it means you're—”</p>\n<p>\"In pain,\" Jason finishes, with a sharp edge. \"Yeah, I got that.\" The scuff of the boot is more pronounced on the wooden floor than it was the carpet of the outside hallway. \"I don't think I like the idea of you having some sort of stupid mood-ring sense hooked into my mind.\"</p>\n<p>Tim hadn't… really thought of it that way. He tilts his head, considering the ache of his thigh through that new light. \"I don't think 'constantly in pain' is going to be that much help,\" he comments, voice gone dry as his gaze drops towards the coffee table that's got his current work strewed over it. \"Goes both ways, doesn't it?\"</p>\n<p>Jason grunts something like agreement. \"Maybe we can… I don't know, work something out? Emotional stalemate or some shit.\" His head turns towards Tim, gaze rising to him for a brief moment as he gives an equally dry snort. \"It'd be nice to stop feeling like I got kicked in the ribs.\"</p>\n<p>Tim’s chest feels tight, but he manages a distant, “Yeah.” He takes a breath, carefully doing his best to just disconnect from all of this so he can look at it impassionately. It seems to mostly work; it’s been working for months, why not now? “Do you want to sit?”</p>\n<p>It takes a moment, but he gets a rough, “Sure,” as answer. A couple strides gets Jason across the room to one of his armchairs, and Tim settles down on one corner of the couch as he watches Jason’s hand press hard against his left side, expression twisting into a small grimace for a moment. “Would you stop whatever stupid shit it is you’re doing?” he snaps, with a glare.</p>\n<p>Tim blinks, lifting his gaze from Jason’s side to meet his eyes. “Sorry?”</p>\n<p>“Whatever stupid thing you’re doing that’s making my whole side feel like a phantom limb, would you <em>knock it off?</em>” Jason’s hand rubs over his side, like he’s trying to coax feeling back into a fallen-asleep limb or something. “Do you have any idea how uncomfortable it is to feel like a chunk of your ribs isn’t actually there?”</p>\n<p>Oh. <em>Oh</em>.</p>\n<p>Something hysterical threatens his tenuous numbness, and he forces himself to swallow. His voice is still faint when he manages to say, “I think I can do phantom limbs or pain.”</p>\n<p>There’s a moment of silence, but whatever Jason’s reaction is Tim looks up too late to catch it. It’s smoothing back out into a slight glare and hard eyes by the time he lifts his head, and Jason snorts. “Yeah, I think I’d rather go for pain, thanks.”</p>\n<p>Tim sort of wishes that Jason hadn’t chosen that option, but he reluctantly lets go of the disconnect he just began to cling to. He really doesn’t want to face all of this without that shield, but… He’ll manage. Somehow. He doesn’t know what that 'somehow' is yet, considering that he’s a mess of wary fear and that same literally soul-deep pain that he’s been dealing with since the words were finally said, but Jason is here and willing to talk, so he will <em>get through this</em>.</p>\n<p>Jason gives a little grunt, hand pressing hard to his ribs for a moment before pulling away. \"Great. Thanks.\" It's sarcastic, but at least it's something. \"So now that we've settled that, you got any ideas on how to make this bullshit go away?\"</p>\n<p>He has to take a slow breath, fighting back that threatening hysteria, and maybe that fries his brain or short-circuits his ability to try for anything subtle because what comes out of his mouth is, \"We're soulmates.\" It's just a fact; everyone knows it. You can't sever a soulmate connection; more than a handful of supervillains have tried, but it's something beyond the physical or mystical. A civilian might just say impossible, but Tim knows better than to make such absolute statements. 'No one's ever managed it,' is a safer thing to offer.</p>\n<p>He doesn't say any of that out loud; Jason knows it all already.</p>\n<p>There's a harsh silence for a moment. Then, quietly, Jason answers, \"Yeah. We are.\"</p>\n<p>Tim lifts his head, and the expression he finds on Jason is more openly shaken than he can ever remember seeing before. There's something in those eyes, when they meet his gaze, that reads like <em>fear</em>, at least before Jason turns his head away and clenches both fists. He leans forward, arms bracing on his knees as he glares off into one corner, mouth curling into a small sneer. Tim only watches, unsure of what he could say or do that won't just make things worse. He doesn't think Jason wants an attempt at comfort any more than he wants him.</p>\n<p>“I don’t want this,” Jason finally says, gaze dipping towards the floor. “I never wanted any of this. None of this— this bullshit about soulmates and destiny and <em>fate</em>. It's all just bullshit.\"</p>\n<p>The words come like a blow to the gut, and Tim tries not to let the breath he sucks in be too obvious. \"Never?\" he asks.</p>\n<p>Jason's shoulders lift in a stiff shrug. \"Sure, when I was a stupid, naive kid who thought that a <em>soulmate </em>was some perfect partner that would end in a fairytale romance and a happily ever after. Didn't take me long to figure out that it was all a big fucking lie; proof's all over the place if you bother to look.\"</p>\n<p>\"What happened?\" Tim can't help asking. The tone of it — bitter, sharp, pained — sounds far too personal for this to just be some fact that Jason's figured out. There's some sort of story attached to that belief.</p>\n<p>By the way that Jason's shoulders stiffen even further, and his sharp eyes flash towards him, Tim's right on the mark. He glares, and snaps, \"My parents were soulmates, did you know that?\" A sudden burst of movement has Jason on his feet, pacing across the room with long, sharp strides that halt just in front of the curtained window. One hand rises, brushing the curtain open just enough for him to peer out, mouth still in that curl of a sneer. \"Catherine and good old <em>Willis</em>; meant to be.\"</p>\n<p>The curtain falls closed, and the look that Jason aims at him makes Tim want to get off the couch and maybe grab the closest weapon before fists or knives follow it. He resists, but he can't quite help noticing the leashed violence and tension in Jason's stance, and how much he looks like some sort of wild animal in that moment, trapped inside the walls of the room.</p>\n<p>There's a snarl to his voice when he says, \"She would have been better off if she'd never met that abusive bastard. Those stupid fucking words were never anything but a chain that let him keep her tied down with him; every time there was a fight, there came the reminder that they were <em>soulmates</em>, so it wasn't like she was going to be able to find anyone else.\" Jason snarls for real then, eyes narrowed. \"I'm not letting some fucked up idea of 'destiny' influence what I do with my life. Not ever. And <em>you</em>—”</p>\n<p>Tim flinches a tiny bit, as Jason scoffs and shakes his head.</p>\n<p>\"Somehow I don't see this happening, considering how many times I've stabbed you and left you for dead.\" There's a flash of teeth, a bark of laughter that's far from actual humor, and then Jason's voice rises as he continues, \"Call it a wild fucking guess, but I'm not going to waste my time on a bullshit 'fated' relationship when I could be spending time with people I actually give a damn about. Fate can kiss my fucking ass as far as I'm concerned, because I'm sure as hell not about to let it walk all over me and dictate what I should do. I make my <em>own </em>goddamn choices!\"</p>\n<p>That's about when he notices something that doesn't quite make sense. A… lack.</p>\n<p>\"You're not angry,\" Tim says, the words coming out just about as dazed sounding as he feels.</p>\n<p>Jason turns on him. \"Like <em>hell </em>I'm not angry, you jack—”</p>\n<p>\"You're not.\" He lifts his gaze, meets Jason's glare and curled-up lip with an evenness born of that daze. \"Everyone agrees that heat means anger. There's no heat. You're not… You're just hurting.\"</p>\n<p>For a second, Jason's expression turns raw and surprised. Then he recovers, taking a few sharp steps forward to tower over him and snarl, \"You don't get to fucking tell me what I'm feeling based on some ache on your thigh. You don't get to tell me I'm not angry!\"</p>\n<p>He knows, with Jason looming over him and shouting down at him, he should be afraid. But Tim can't seem to move past that odd daze, so all he does is blink upwards and say, \"Sorry. I… sorry. I'm not— I'm not trying to—” The urge to laugh hits him again, and he drops his head into both hands, curling his fingers through his own hair. \"Never mind,\" he manages, even though his voice comes out tight from repressing the urge to break down into what he's worried might be unstoppable, hysterical giggles.</p>\n<p>He tries to regulate his breathing, counting each beat in his head to try and follow one of the basic rhythms he knows. It… helps. He thinks.</p>\n<p>After he feels less hysterical (and less dazed too, thankfully) he says, towards the ground, \"I'm not… I don't expect you to want me. I don't expect anything from you.\" His gaze lifts just enough to see Jason's legs, still standing in front of him. He's not brave enough to look any higher.</p>\n<p>\"I…” Jason sounds lost. The feet before him step back, almost backing into his coffee table. \"I have to go.\"</p>\n<p>Tim yanks his gaze up but Jason is already heading for the door, legs carrying him in long strides that eat up the distance before Tim can gather himself enough to do anything more than stand. His door is opened, but any call to wait, or for Jason to just give him a second to <em>think</em> gets stuck in his throat. By the time he's managed to swallow and inhale again, Jason's already slipped past the door and it's shutting firmly behind him.</p>\n<p>The doorknob's bolt clicks into place.</p>\n<p>Tim stares at it, trying to process what just happened. He wishes he'd been looking up; he wishes he could have seen what Jason's reaction or expression was. What made him leave just like that? (Still, the only feeling from his thigh is a dull ache; there's nothing more than pain being reflected.)</p>\n<p>Walking to the door happens automatically, as does locking it once more. It takes a few moments after that to push himself to move back into his apartment, his gaze sliding blindly across the room. Somehow he ends up sitting back on the couch, curling into the corner and bringing his knees up against his chest. His head leans into the back of the couch, the silence eating into his ears as he closes his eyes and focuses, again, on just breathing.</p>\n<p>He's not… He thought he could handle all of this. He's had years to come to terms with the fact that Jason wasn't going to want him, but to <em>hear </em>it like that, straight to his face… It hurts more than he thought it was going to, to know without any doubt that his soulmate doesn't want him. The words printed on his thigh are never going to matter.</p>\n<p>His chest feels tight, his throat locked shut, but he still struggles to breathe correctly. Slow, even, and deep. Bruce taught him these patterns for a <em>reason</em>; he should use them. If he can't control his own breathing, what hope is there for him to control any of the rest of it? He needs— He needs control over <em>something</em> right now. Anything. This has to be it, because he can't control how his thigh is still aching, or what Jason thinks of him, or anything related to the <em>mess </em>his lack of a love life has suddenly become.</p>\n<p>Tim's just managing to maintain that breathing pattern without struggling when his phone rings.</p>\n<p>It startles him, makes his breath hiccup for a second as he flinches. Then he looks down to his phone, lying on the coffee table where he'd left it before Jason came by. He doesn't recognize the number. He waits a couple seconds for his phone's software to run its searches and identify it, but nothing happens; the number's not one he can trace. It's almost belatedly that he remembers to actually stretch out and reach for the phone before it can stop ringing.</p>\n<p>\"Hello?\" he asks, thankful that his voice at least sounds mostly normal.</p>\n<p>Silence, for a moment, and then a low, <em>\"Hey.\"</em></p>\n<p>Jason. His breath catches. Hard.</p>\n<p><em>\"Look, I… Fuck, I know this whole thing is screwed up, but… I just need to get back to a safehouse and I can—” </em>There's a harsh laugh through the phone, humorless and grating, before Jason finishes, <em>\"I can barely fucking breathe with how much my ribs hurt so… Christ, I don't know. Talk to me, or something?\"</em></p>\n<p>Tim stares blankly at his floor for a moment before slowly curling back into the corner of the couch. \"Talk?\" he echoes. \"Talk about what?\"</p>\n<p><em>\"Anything. I don't know; whatever shows you're watching, cases you're working on, whatever stupid gossipy shit the Teen Titans are passing around.\" </em>He can hear the way Jason inhales, deep and strained. <em>\"Just anything that will make you feel better, so I can actually breathe again. Talk, or sing, or read case files at me. Anything.\"</em></p>\n<p>\"I…” He closes his eyes tight for a moment. \"Where are you?\"</p>\n<p>The silence stretches long enough that if not for the harsh breaths he can hear through the phone, he'd think Jason had hung up on him. But then comes a grudging, <em>\"Sitting in a corner of your parking garage. Don't really want to… take my bike while breathing's this hard.\"</em></p>\n<p>Guilt hits him hard, and he curls tighter into the couch.</p>\n<p><em>\"Fuck. No, damnit don't—” </em>Jason groans, and Tim can hear the pain in it. <em>\"It's not… Life's a giant, sadistic mess of a thing and maybe I don't like you but this shit is not your fault. Don't— Don't feel bad because whatever jackass powers that be there are decided to screw with us. Just work with me here, alright?\"</em></p>\n<p>\"Okay,\" he manages, after a couple more moments of trying to breathe around that guilt. \"Okay.\"</p>\n<p><em>\"Great.\" </em>A harsh breath, and equally hard exhale. <em>\"So pick something. A song, or whatever. Anything you want to talk about.\"</em></p>\n<p>\"My voice actually isn't great,\" Tim answers, latching onto the conversation with a desperation only just shy of someone drowning. \"Do you… Can you sing?\"</p>\n<p>Jason's snort actually sounds almost amused. <em>\"Sure, in the shower. Haven't got the range to actually sing much of anything interesting, but I learned to do drinking chants from Russians, so I can at least hold a tune. More or less.\"</em></p>\n<p>\"Russia? What were you doing in Russia?\"</p>\n<p>The frank answer of, <em>\"Learning how to make bombs,\" </em>isn't what he was expecting, but in hindsight Tim realizes that he probably should have. Jason's been all over the world, true, but there's still a lot about his original training that they don't know. Russia not ringing a bell should have been his first clue. The silence is apparently enough to press Jason into asking,<em>\"That scare you off, Replacement? I've done a lot worse than making some things explode under direct surveillance.\"</em></p>\n<p>\"I know.\" His thoughts start circling inwards, and he swallows, presses his head back into the couch. Thinking about all the terrible things he knows Jason has done isn't going to help him feel any better. \"I um… I don't keep up to date on the Titans' gossip.\"</p>\n<p><em>\"Bullshit you don't</em>,\" Jason instantly counters, and somehow that drags a small snort from Tim's throat. <em>\"Blackmail material? Nobody raised by B could resist that.\"</em></p>\n<p>He's right.</p>\n<p>Tim's legs uncurl a bit, and he leans more heavily into the couch. \"Alright, well…”</p>\n<p>He doesn't know how long he talks, slipping from topic to topic and only a couple times running into something that reminds him of the whole situation and having to draw away. But by the time that he pauses his voice is a bit raspy, and he's stretched out along the couch with his head resting on one arm of it. He actually feels… tired. Like he could actually sleep without having to struggle with it, and as he notices that feeling he realizes it's because the nearly constant presence of the ache in his thigh has dimmed down to a low throb.</p>\n<p>Jason takes a deep breath in, and Tim realizes that it sounds normal and easy. <em>\"Feeling better?\" </em>Jason asks, voice low.</p>\n<p>Tim takes a matching breath, and can actually truthfully answer, \"Yeah. Yeah I am. I… Thank you.\"</p>\n<p><em>\"Yeah.\" </em>There's a scuffle of sound from the phone, and then a halting, <em>\"We— This isn't going to stop; we're fucked up people. Maybe next time this gets bad we could just… talk. It worked this time, right? Maybe that's how we manage this.\"</em></p>\n<p>It makes sense, he thinks. \"Alright,\" he agrees, his voice quiet. \"I guess… I have your number now?\"</p>\n<p><em>\"And I've got yours, yeah.\" </em>There's a small stretch of silence, and then a rougher, short, <em>\"Well, bye.\"</em></p>\n<p>The call disconnects before he can even return the goodbye, leaving Tim staring at his phone until the screen clicks off by itself. It doesn't feel as bad as he expects, honestly. There's a bit of irritation, and a little twinge of hurt at the reminder that Jason isn't <em>actually </em>interested in interacting with him (but has to), but it's not nearly as bad as it was before.</p>\n<p>For now, he thinks maybe that's good enough.</p>\n<p>For the most part, it works. They weather what they can — and they've had experience with pain, so that's a lot — but when it gets too bad Jason picks up the phone and they talk about whatever bullshit, meaningless things come to mind until he can breathe again, and Tim stops sounding like he's being put through an emotional shredder. It's a long ways from perfect, it's more contact than he wants because he doesn't want <em>any</em>, but he grits his teeth and forces himself to think of it as necessary.</p>\n<p>It <em>is </em>necessary. If he wants to be able to consistently breathe, and to be able to spend his days not feeling utterly miserable, then he has to deal with the source of that misery. Tim. (It's not <em>all </em>his fault, Jason admits only grudgingly and to himself. It's a stupid feedback loop; one of them feels bad, which makes the other be in pain, and it just builds until one of them manages to deal with it.)</p>\n<p>But apart from his hatred of the situation, Tim himself is… alright. He's not as annoying or as much of a dick as he could be, so that's at least one point in his favor. Jason doesn't find himself feeling judged for his past, when it comes up, and the replacement always seems willing to talk shit with him about whatever stupid things the rest of the family has done recently. If he had to get stuck talking with someone, he supposes Tim isn't <em>that </em>bad.</p>\n<p>Everything else aside, he's sort of glad the waiting's done. It’s nice to finally know that he <em>does </em>have a soulmate, no matter how much he dislikes the man in question or how much more fucked up the whole thing gets the more he thinks about it. At first, before this, he'd thought… Well, he'd thought that the world had fucked up again. That since he’d died his fate had been knocked off course, and the words scripted diagonally the left side of his ribs in precise, elegant letters didn’t mean a goddamn thing. It was never going to happen; just a missed opportunity and that didn’t bother him all that much once he considered it. Maybe some stupid, romantic, hopeful corner of himself had still been hoping that his soulmate would be different than the disaster he’d watched growing up, and maybe it stung that he wasn’t going to get even a chance, but he brushed it aside like everything else.</p>\n<p>Now there’s Tim, and the more he thinks about it the more he thinks this might be worse. If Tim was <em>always </em>supposed to be his soulmate… If these were always going to be his words…</p>\n<p>Tim’s the one to call him that night, greeting him with a tired sounding, <em>“Whatever you’re thinking about, please stop. I have to fill in at Wayne Enterprises in like three hours and I need at least a little bit of sleep.”</em></p>\n<p>Jason blinks, caught off guard by the direct request after so much of the pretense that’s always been in their calls. As if they were just calling each other to chat, instead of to make the stabbing, aching pain go away.</p>\n<p>“Sorry,” he mutters into the phone, pressing his back harder into the edge of the door frame. “Not a fun night.”</p>\n<p>So, maybe he’s been sitting on the floor in his mostly dark apartment, just barely resisting the urge to see how much of a carton of cigarettes he can get through before he starts to feel any better. Yeah, it’s more pathetic than he usually goes for, but things had just… spiraled. One thought to another, into things he’s been avoiding thinking about for weeks. It’s… He’d barely even noticed the pain in his ribs, for once, though now that he does it makes his breath catch a little.</p>\n<p>Just reaction; feedback loop.</p>\n<p><em>“I think I’m too tired to keep up a conversation,” </em>Tim admits, and Jason can hear the edge of pain in his voice too. <em>“What’s wrong?”</em></p>\n<p>The words catch in his throat, and there’s a long stretch of silence where he can’t bring himself to say anything. Can’t admit to the thoughts in his head or the fears in his chest, and if he <em>says </em>any of it does that make it real? Does it mean that the conclusions he’s drawing from this whole fucked up situation are the truth? Could the universe be <em>that </em>messed up? (Yes.)</p>\n<p>\n<em>“Jason?”</em>\n</p>\n<p>“I was meant to die,” escapes the lump in his throat. He squeezes his eyes shut for just a second, but behind that dark lies coffins and the memory of the Joker and the Pit and he can never stay there long. “I…”</p>\n<p><em>“Fuck,” </em>Tim hisses, and Jason honestly doesn’t know whether it’s in reaction to his words or to how much pain he’s causing.</p>\n<p>“Sorry,” he whispers again, pressing the back of his skull into the frame as well. “I just… If I hadn’t died then you would never have been Robin, and you never would have known it was me so you wouldn’t have gone looking for lines from my— <em>fuck</em>, from my favorite fucking book. I never would have called you replacement, or… These marks wouldn’t make any <em>fucking</em> sense.” His throat feels tight, his chest like there are steel bands around it, but now he can’t <em>stop</em>. “So was I… Was I always meant to die? From the second I was fucking born was it all predestined, that I was supposed to be Robin and mess up and get myself killed by that psychopath? Was waking up in my coffin and digging my way out just fate? Falling into a coma? Getting shoved in the Pit?</p>\n<p>“I don’t see any other way this makes sense, and if that’s all true then what’s the fucking point of living? If all this shit is predestined, what does free choice matter, or what any of us do, or my whole <em>fucking </em>life?! I could have been <em>perfect </em>and I still would have died because this would never have happened otherwise. It’s not— <em>Fuck</em>, I don’t—”</p>\n<p>\n<em>“Jason, <strong>breathe</strong>.”</em>\n</p>\n<p>\"I— I can't—”</p>\n<p><em>\"Jason, you're panicking. I can feel you panicking, alright? That's the first thing I've ever felt from you but pain.\" </em>He hears a deep breath from over the phone. <em>\"Listen to me, alright? I want you to take a breath. Follow me, okay? Take a deep breath, right with me.\"</em></p>\n<p>Tim inhales, and slowly, his breath catching as he tries, Jason follows. He stares at the ceiling, his fingers tight around the phone, the edge of the door frame digging into his back and making every attempt at an inhalation catch a little bit. But he can't imagine trying to move right now, or pulling away from the comforting steadiness of that point of contact. If he moves he might just float off into space, or sink through the floor. Nothing else feels… feels solid.</p>\n<p><em>\"That's it,\" </em>Tim says, and Jason has just enough presence of mind left to feel a little bit annoyed at the careful tone. <em>\"Take a couple more, alright? Even out; you can handle this.\"</em></p>\n<p>\"I know that,\" he snaps. He knows how to deal with panic; he's a <em>fucking </em>vigilante for god's sake, he should be able to deal with a little fear. \"Don't need your— your condescension.\"</p>\n<p><em>\"I'm not—” </em>Tim cuts off with a sigh that sounds both exhausted and frustrated. <em>\"I was just trying to help; do you want it, or not?\"</em></p>\n<p>Jason grits his teeth together after the second breath; the case around his phone creaks and he forces himself to loosen his grip a little, to get his teeth apart and take another breath. \"I don't need it,\" he gets out after he's inhaled and the panic has receded a little bit. He's still finding it a little hard to force himself to breathe, and the fear lingers there just beyond his immediate focus like a storm front, but he can— he can handle this. He's dealt with panic attacks before (none of them based around <em>fate </em>and the utter meaningless of his <em>whole life</em>, but that's not the fucking point).</p>\n<p><em>\"I know. Jason, look, I'm exhausted. I wasn't trying to condescend I just— It's automatic. I'm sorry.\" </em>He hears the slow breath from over the phone; it reminds him to take his own. <em>\"I just want to sleep. Can you just like… take a sedative or something, and we can deal with this tomorrow?\"</em></p>\n<p>\"What?\"</p>\n<p><em>\"I'd take one myself but I have to get up and I don't know if I could—” </em>Tim yawns, loud and drawn out <em>\"—could get up in time. Please, Jason?\"</em></p>\n<p>He feels speechless for several long moments, the words deserting him until he finally asks, incredulously, \"You want me to <em>drug </em>myself so you can sleep? Are you fucking kidding me? I'm not—” For a second, all he can think about is syringes and needle marks and the prone form of his <em>mother</em>. \"I'm sorry you're stuck with a fucking mess like me, but I'm not taking <em>drugs</em> so you can get sleep for your goddamn <em>precious</em> meeting, you little bastard.\"</p>\n<p>\n<em>\"Wait, Jason, that isn't—”</em>\n</p>\n<p>\"<em>Fuck </em>you!\"</p>\n<p>He throws the phone across the room. It doesn't shatter as impressively as he wants, in that moment, but it hits the wall on the other side of the room and falls to the floor, face down. Anger and pain and the sharp, white fear still clinging in his chest drive him to his feet, and he strides into his bedroom to get away from the phone and everything it represents. Soulmates and <em>Tim </em>and the entitled son of a bitch's idea that the world should just do what he wants to make life better for <em>him</em>.</p>\n<p><em>Fuck </em>that. He's not some puppet on strings or some slave to do as commanded. And he's sure as fuck not ever, <em>ever</em>, using drugs to get away from his problems. Not fucking happening; he knows that evil.</p>\n<p>He wants to <em>hit </em>something. He wants an outlet for all the emotion swirling around in his chest, and if he can just beat that into someone, or a bag, or god fucking <em>anything </em>that can take it. He <em>has </em>a bag, all set up in the corner of the living room, but that means going back out there next to the fucking phone and wrapping his knuckles up and he's not sure he can manage any of that right now. But then he feels only about half a step away from doing something drastic and stupid and impulsive — like punching one of the too-close walls — and maybe it's better if he at least <em>tries </em>to get through this thing without seriously hurting himself or falling back into the panic.</p>\n<p>(Deep breaths. He <em>can </em>breathe, it's just a stupid physical reaction and he's <em>mastered </em>those.)</p>\n<p>He whirls on his heel, escaping the darkened bedroom for the living room that at least has the moonlight shining in from one window. It's enough for him to get to the bag and drag it a few steps further out so there's a bit more room to move. He picks up the tape lying beside it, but his hands are trembling and it's a struggle to get enough control to get his hand wrapped up right. The feelings build as he struggles with the tape, and he grits his teeth and ignores it as long as he can. The sharp pain in his ribs; just as immaterial as the mess of emotion shortening his breath and making him shake. He just has to— to—</p>\n<p>Jason gives a wordless shout, falling back a step and bringing the back leg up to spin in and kick the bag as hard as he can manage. The bottom of it <em>smacks </em>against the wall as it flies back, rebounds, and out of impulse and instinct he throws his fist into the returning weight. It hurts (not finished wrapping that hand; <em>shouldn't do that</em>) but it frees some part of him and he can't— He doesn't <em>want </em>to stop. He just wants all of this gone; he doesn't want to think about Tim, or <em>fate</em>, or the fucking mark branded across his ribs.</p>\n<p>Hitting the bag is easier; it's simple and he can just stop thinking and aim everything he's feeling into it. His vision blurs, his breath comes in ragged pants, his arms ache, and the anger is fading but that just leaves the pain and the fear and that's not <em>better. </em>Why won't it all just <em>go away?</em></p>\n<p>Something pings at the edge of his senses, a repeated sound, but he ignores it. It's faint and he doesn't want to pull away from the bag. If he stops, he's sure that everything left will overwhelm him and he'll just collapse. He doesn't think he can handle it and that <em>hurts </em>to even think but he just can't risk it. If he can't, then—</p>\n<p>\n<a href=\"https://jaykore.tumblr.com/post/167286661550/mark-my-words-by-skalidra-drawn-for-the\" rel=\"nofollow\"><img src=\"https://78.media.tumblr.com/d560b9dc3ba1fdfb1be2040cdf54311f/tumblr_oz4lkgAYEq1v6pmvxo1_1280.png\" alt=\"Art by JayKore\" height=\"1074\" width=\"1280\"></a>\n</p>\n<p>He whirls around before the disruption has even finished registering, gaze slashing across the apartment and finding a figure backlit by the light spilling in from the now open front door. He stares, feeling frozen as the door is pushed close; the click of it shutting feels as loud as a gunshot. The sudden return to darkness has him blinking, drawing in a sharp breath as the person takes a step towards him.</p>\n<p>\"Jason?\"</p>\n<p>He… He knows that voice.</p>\n<p>\"Tim?\" His voice comes out hoarse; has he been shouting at the bag? He's not sure. He remembers… He remembers hitting it, but…</p>\n<p>\"I picked the door,\" comes the answer, and Tim is still moving towards him. Slowly, circling the barriers of furniture to take the clearer path along the edges of the room. \"I'm sorry; you weren't answering and I can feel all the— the—”</p>\n<p>Jason jerks forward a step as Tim falters, staggering into the wall as one leg buckles. He slides down the wall, legs curled in as one shoulder and his head rest against the wall. Jason feels a sharp flash of something else through all the rest, something like concern but that can't be right, can it?</p>\n<p>\"Sorry.\" Tim's voice sounds weak, and Jason finds himself shifting forward, edging closer as the shadow that is Tim stays immobile. \"I shouldn't have come. I was— was worried. I didn't mean it; shouldn't have suggested that especially with—” one hand waves feebly his direction, as Jason stands over him \"—your background. No, that— that was insensitive, wasn't it? I didn't…”</p>\n<p>Jason hesitates, but sinks down to kneel in front of him. This close, he can see the contrast of the dark circles under Tim's eyes against his pale skin, and the way his brow is furrowed, eyes half-lidded and hazed. They focus on him though, jumping from his eyes to his chest to his hair and back again.</p>\n<p>Tim pushes against the wall, turning slightly so his back is more against it, his head tilted down towards one shoulder. \"You're not a mess,\" he says, voice a little stronger. \"Wait, no, you <em>are</em> a mess, but <em>I'm </em>a mess too so it's not like it's… it's strange. I said stupid things. I was stupid. You were hurt and I was… brushing it off. Sorry. I can— can try again if you—”</p>\n<p>\"What the fuck is wrong with you?\" Jason interrupts, staring. He flinches back a little when Tim laughs, short and sharp, and then frowns and draws inward.</p>\n<p>There's a moment where he's silent, and then he takes a slow breath and says, stronger and calmer, \"I— I'm sorry, I'm just tired. I haven't slept in awhile; cases needed to be finished. Emergency project. I was trying to sleep tonight. A little. I just talk when I'm tired, and I don't always think it through and I shouldn't have said half of what I did.\" Tim draws in another breath, this one faster but just as deep. \"I had to come over; leg feels like it's splitting off and I was— was afraid you'd…”</p>\n<p>\"That I'd <em>what?</em>\" he demands, tensing up.</p>\n<p>Tim stares at him. \"I don't know. I… usually know. That's why I came. I know you don't want me—” there's a slight hesitation before Tim ends the sentence \"—here, but I had to come. You can shove me back out the door if you want, but I think I'll probably just stay in the hallway. I'm… not sure I can get home again. I'm sorry.\"</p>\n<p>\"Stop apologizing.\" Jason knows he snaps the words, but Tim just blinks owlishly up at him so the flash of guilt he gets passes just as quickly. \"You're not—” He shoves up, running his hands back through his hair as he paces a tight circle. His hands aren't shaking anymore, but he still feels like all of it could just crash down at any moment and bury him. He hates the idea that having a soulmate means that if he lets all of this really break him, then Tim suffers for it too. Maybe he doesn't like the replacement, maybe he never wanted this, but who thought it was fucking fair that someone as messed up as him should ever have someone else tied to his feelings?</p>\n<p>He wishes he could brush all this bullshit aside. He never— But what does it matter? It's never mattered what he wanted. His whole world's been on a pre-programmed course from the very beginning.</p>\n<p>His gaze falls to Tim, curled in against the wall, head lowered and one hand clutching at his thigh. Jason's fists clench as he stares down, but the urge to strike isn't there. It's not Tim's fault that he's fucked up beyond repair, and it's not Tim's fault that the universe is fucking with them both. He knows that. Neither of them chose this. He just… God, none of this is fucking fair (fits with the whole fucking theme of the universe, as far as he's concerned).</p>\n<p>\"Just stay,\" he finally spits. Tim looks up at him, and he can't hold the gaze for more than a moment. It takes him a few moments to realize that Tim probably isn't going to do much more than stare at him, not with the exhaustion and pain clearly wrecking his focus. He bites his tongue for a moment, inhales slowly, and manages to push himself enough to say, \"Come on.\"</p>\n<p>He offers a hand, and Tim stares at it for a second before reaching up and taking it. Jason pulls him up despite how his arm and shoulders ache, and it isn't until Tim is standing, leaning into his grip with head bowed and leg visibly trembling, that he realizes it's the first time they've touched since the marks were spoken. He swallows, tries not to think about it as he pulls him towards the couch, keeping a careful eye out to make sure he doesn't topple over. Tim's limping, but he doesn't actually fall over so Jason doesn't have too much trouble getting him down on the couch. He drags one of the throw pillows over to press underneath Tim's head, which is when fingers close around his wrist with surprising strength for someone that's practically half asleep.</p>\n<p>\"You're hurt,\" Tim says, tugging his wrist forward and pushing half up against one arm of the couch.</p>\n<p>Jason tugs at the hold, and tries not to betray the unease that it causes when he doesn't immediately get free. \"I'm fine.\" He looks at his hand after he says it, remembering that he hadn't wrapped up those knuckles right at about the same time that he realizes the skin over them is a bit torn up. A little bloody, aching now that he's noticed it, but he flexes his fingers and there's no bad pain so it's not likely anything's broken. He tugs again, and Tim lets go.</p>\n<p>He watches as Tim sinks back onto the couch, eyes open and staring up at the ceiling; exhausted, but Jason’s had enough experience with pain to know that the short, shuddery breaths Tim’s taking means he won’t be sleeping anytime soon. His own breath feels short, but Jason knows that has more to do with the fact that his ribs only hurt worse if he breathes more deeply. That, and that he’s still sweaty and breathing harder than he should because of the freakout he aimed at the bag. He does feel… better. Marginally. Clearly not enough.</p>\n<p>He shoves out a breath and sinks down, sitting at the base of the couch and leaning his back into it. “Sorry,” he mutters, involving himself with pulling the half-finished tape off of his hands. That’s easier than actually looking up at Tim. “Not fair you got stuck with me.”</p>\n<p>The hand that touches the back of his shoulder nearly makes him jump, but when his head snaps around it’s just Tim. (Of course it is; who else would it be? <em>Dumb </em>paranoia.)</p>\n<p>“Life’s not about fair,” Tim murmurs back, and the replacement <em>smiles</em>. Small, strained, and short-lived, but he does. “‘Bout what you— what you do with it. Lemons and all that.”</p>\n<p>“You’re an optimistic little bastard, aren’t you?”</p>\n<p>Tim laughs and it’s too much like the smile for Jason’s tastes. Hitching and strained and short. “Not really,” is the answer, and he blinks in surprise. Tim’s fingers brush his shoulder again, and he shouldn’t be able to feel the warmth through his shirt but he swears he can. “I do… logic. Worst case scenarios, or what I <em>know </em>is truth.”</p>\n<p>Jason turns a bit, stares at Tim more directly. “You went hunting for Bruce when he was <em>dead</em>. That’s not logic, Tim, that’s stupid optimistic bullshit.”</p>\n<p>“No, I— I <em>knew</em>. I just knew.” Tim pauses a moment, gaze flicking towards the ceiling, and then says, “I… was maybe not too rational. Or sane. It was a bad year. But I was right; that’s the important part.”</p>\n<p>Jason snorts. “Uh-huh; sure.”</p>\n<p>He watches Tim for a second, and the uneven rise and fall of his chest as he breathes as best he can against whatever pain he’s in. Against the pain <em>Jason’s </em>put him in. He feels another surge of guilt, and Tim almost immediately winces in response, head pressing back into the pillow and hand pushing at the top of his thigh. Jason can feel the rebound effect at his own marks, a slice of pain across his ribs that makes his breath catch.</p>\n<p>“I’m going to go grab a blanket,” he mostly says to thin air, as he climbs to his feet.</p>\n<p>The apartment is still mostly dark, but he doesn't need light to find his closet, or the blankets stored within. He pulls out one of the thicker ones, then stalls with it in his arms.</p>\n<p>When he goes back to Tim, he has three pills in his hand as well as the blanket. He drops it on top of Tim, who startles and looks up at him, and then — before he can change his mind, before he can talk himself out of this — throws the pills in his mouth and works up just enough spit to swallow them down. Tim is staring at him, and Jason knows that it’s not physically possible that he’s feeling their effect this fast but it still feels like he can feel the weight of them in the pit of his stomach.</p>\n<p>“Get some sleep, Tim.” He takes a step back, only barely resists crossing his arms. “Go to the meeting; lock the door on your way out.”</p>\n<p>“What was that?” Tim asks, pushing up on the arm of the couch again, crystal blue eyes wide.</p>\n<p>Jason shrugs with all the nonchalance he doesn’t feel. “Sleeping pills. See you some other time, I guess.”</p>\n<p>“<em>Jason</em>—”</p>\n<p>“It’s fucking done, alright?” He doesn’t really mean to snap it, but it comes out anyway and then he doesn’t have any real choice but to fall in line with the sentiment. One of his hands lifts, raking back through his hair as he avoids Tim’s gaze. “Get some sleep,” he mutters. “You need it.”</p>\n<p>He doesn’t give Tim any chance to respond. It’s better that way. His legs are long enough to cover the distance in only a few long strides, and maybe it’s just some combination of sleep deprivation and pain but Tim doesn’t seem to get himself together fast enough to say anything before he closes his bedroom door behind him.</p>\n<p>It has a lock so he flips it, trying not to think about how little that will mean in the face of anyone with literally any experience as he sheds most of his clothing. Double-checking the security on his curtained window is automatic, and once that paranoid part of him has been laid to rest he actually lies down on the bed itself.</p>\n<p>Sleep doesn’t come immediately, but amid the silence and the dark it does, inevitably, come.</p>\n<p>The morning is a slow one, muted by the sort of hazy aftereffects of the pills and the soreness of muscle pushed too hard, too fast. It’s mostly his shoulders that ache, but the hand he didn’t wrap properly does too. There are a few scabs on that, but he decides it’s nothing serious after looking at it.</p>\n<p>He makes it all the way out to the kitchen, following the smell of the coffee his machine is set to make every morning and wearing only his boxers, before drawing up short.</p>\n<p><em>Tim </em>is sitting at his table, dressed up in business formal wear, jacket over the back of his chair, and with some sort of tall, blended, commercial coffee drink between his hands. Jason blinks, but the apparition doesn’t go away. In fact, it gives him a faint smile.</p>\n<p>“Weren’t you supposed to be gone?” is what comes out of his mouth, and then he fights the urge to groan, lifting a hand to rub over his eyes. “A… meeting, wasn’t it?”</p>\n<p>“I went,” Tim answers, “and came back. I wanted to say thank you for last night. Not just, you know, the pills, but all of it. Thanks.”</p>\n<p>Jason stares, shifting his weight as he tries to understand how damn <em>earnest </em>the replacement looks. \"Yeah,\" he finally says, \"sure.\"</p>\n<p>\"I brought coffee.\" Tim continues on like there wasn't an awkward silence, one hand lifting to point towards the other side of the table where, yeah, there's another of the tall coffee drinks in front of the other chair. This one hot, lidded, presumably filled with coffee. \"Also pastries. I didn't know what you like so I just grabbed a variety. Take whatever.\" Another flick of his hand to the counter, where there's a decently sized, creme-ish colored box.</p>\n<p>It's still a belated response, after a few moments of silence, but he manages to say, \"Thanks.\"</p>\n<p>He heads for the box, reaching up to retrieve a plate from within one of his cupboards. He hears the scrape of the chair, glances back to find Tim sort of cautiously approaching, and after a moment of hesitation pulls down a second plate as well. Tim takes the plate when he offers it, and is the one to flip open the box of the lid. Jason waits for a moment, but when it becomes apparent that Tim is letting him take first pick he reaches in to take a couple that look pretty good.</p>\n<p>It isn't until he's put them on his plate, and stepped back, that he catches the gaze aimed down towards his ribs. It hits him, suddenly, that he isn't wearing a shirt. The mark stretching across the left side of his ribs is bared, and although Tim is now fully devoted to staring down at the pastries, of <em>course </em>he'd stare. It's <em>his </em>damn mark, isn't it? His words.</p>\n<p>He sets his plate down with maybe more force than necessary, and the clatter of it makes Tim start, gaze turning to him. \"Just fucking look if you're going to,\" Jason demands, lifting his left arm to wrap around the back of his neck and bare the entirety of his side. He holds Tim's gaze, hiding the nervous, wary thrill that inspires in him by curling his lip in challenge. \"Don't sneak peeks like some kid in the locker room.\"</p>\n<p>Tim meets his gaze for a couple moments, then sets the plate aside and steps closer. Jason holds his ground. The weight of that stare dropping to his side is almost more than he can handle, but he steels himself and holds still, letting it rake across his mark. They seem to follow every flowing black line, from the start of it just below his left pectoral all the way down to the outside of his hip, and then up again to read the second half, indented like whatever higher power there is had taken the second line and hit 'center' while they were branding his fate into his side.</p>\n<p>\"It's… elegant,\" Tim says, voice soft and gaze — when Jason looks over — lingering on his mark.</p>\n<p>Of all the comments Jason expected, that wasn't one of them. He stalls for a moment, and then slowly drops his arm back down. \"Yeah,\" he agrees. He's thought that before, back when he was a kid, tracing the lines of it and trying to imagine what kind of person might say something like that. No one's ever echoed his thoughts, but then not many people have seen his mark. \"I'll put on a shirt.\"</p>\n<p>Tim calls, \"Wait,\" before he's even fully turned around.</p>\n<p>When Jason looks back he's undoing his belt and shoving his pants down his hips with a wiggle. Jason doesn't even have time to get past the surprise and ask what he's doing before Tim's turned around, one hand pulling up the side of his now hanging shirt. He sees the black words stamped across his back of Tim's left thigh, bold and harsh in the stark, flat lines of them, and then he understands. The words take his breath for a second like a lucky gut shot would, his own careless comment shoved back in his face.</p>\n<p>\"There.\" Tim is looking over his shoulder, and Jason swallows when he meets that gaze. There's a knowing edge to it. \"Fair's fair, right?\"</p>\n<p>When he can find his words, he just gives a jerky nod and a rough, \"Yeah.\" He pulls away, taking his plate and not looking at Tim as he throws, \"Put your pants back on,\" over his shoulder.</p>\n<p>The coffee is strong, black, and normally he'd dump milk or sugar or something into it to sweeten it up but he doesn't want to get back up. Tim does indeed have his pants back on when he sits down at the other side of the table, but Jason feels… less like he needs a shirt in the face of Tim being dressed. It's his own damn house, so screw it. If Tim wants to look, let him.</p>\n<p>He gets through half a pastry before Tim says, cradling the coffee between his hands, \"Did you want to talk, about last night?\"</p>\n<p>Jason stares down at his plate, shying away from the reminder of his thoughts from the night before. He shakes his head, closing his eyes for a moment. \"No.\"</p>\n<p>\"Alright.\" There's a moment of quiet. \"Do you want me to leave?\"</p>\n<p>He thinks about it, but… no. He's strangely not minding the company that much. \"No, it's alright.\"</p>\n<p>Tim gives another of those faint smiles. He doesn't say anything though, and Jason finds himself easing into the silence.</p>\n<p>This… isn't bad.</p>\n<p>Tim doesn't come over to his apartment again, but then Jason doesn't have any more breakdowns about the nature of the universe so it's not really called for. They still call, when things get a bit too painful for comfort, and usually it's for something dumb, honestly. Irritation over a case, or in Tim's case Damian being a shit to him, or so on. It's not as bad anymore, and it's not… It's easier, in a lot of ways. Jason actually doesn't mind the calls.</p>\n<p>It's nice, to have someone to just talk to when the world is messing with him. To vent to, or just distract himself with gossip, or talk about shows, or whatever. He almost looks forward to it, in a weird way. At least, the actual calls themselves, and not the reasons for them. He maybe… stays in those calls longer than he necessarily has to. Sometimes.</p>\n<p>Life goes on, slowly. Jason stays mostly in or around Gotham, keeping close enough to be around, even if he doesn't actually interfere in any of the Bats' business. Mostly. He's not actively building himself up as a crime lord anymore at least, so that should win him some points. (He still has some of his lieutenants report to him, but he thinks it's a pretty decent drug trade he has going that minimizes innocent casualties, so he's not inclined to stop it.)</p>\n<p>Despite being in Gotham, he does his best not to actually run into any of the family. It's better that way. He's pretty sure that none of the family knows yet that Tim's his soulmate, and he can't even imagine the reactions when they find out. God knows that he's not good or pure enough for them to be alright with him being Tim's soulmate, and he doesn't think he's willing to bow and scrape enough to get it to that point.</p>\n<p>He's at his apartment, just getting ready to head out for a small grocery run, when everything goes to shit.</p>\n<p>One step he's fine, and then before his foot comes down on the next <em>pain </em>stabs into his side, dragging a shout from his throat and sending him staggering into the wall. He presses his hands to it despite knowing there's no physical injury, sliding down the wall and turning his head to bite into the collar of his jacket to stifle another shout. He has to look down and lift a shaking hand just to confirm that he hasn't, in fact, been stabbed by invisible ninjas or something. <em>God</em>, it fucking hurts. Even that first night, when he'd gone to Tim, it hadn't been quite this bad, and it sure as hell hadn't struck this fast.</p>\n<p>What the <em>fuck? </em>Did someone die? Did he just get the betrayal of a lifetime?</p>\n<p>He scrabbles for his phone, taking two tries to get it out of his pocket and then probably another twenty seconds to actually unlock it and dial Tim's number. He traps it between his shoulder and his head so he can resume pressing into his side with both hands, reluctantly letting go of the leather between his teeth so he can actually speak.</p>\n<p>\"What the <em>hell</em>, Tim?\" he gasps, when he hears the click of it being picked up. \"You just went from zero to ninety in like two seconds flat; what the fuck happened?\"</p>\n<p><em>\"Oh,\" </em>Tim's voice sounds a little dazed. <em>\"Sorry, Jason. I—” </em>A sharp, pained sound that makes every crisis-trained instinct in Jason lift its head. A reaction that's proven right when Tim finishes, <em>\"Actually I've been shot.\"</em></p>\n<p>His whole world narrows. \"You fucking <em>what?</em>\" He forces himself to uncurl, to stagger up and head for the door. No, this <em>can’t </em>happen. “Where the hell are you? What happened?”</p>\n<p><em>“Fundraising event downtown,” </em>is Tim’s strained response. <em>“It’s okay; not vital and I can hear sirens already. It was just— just a lucky spray. Untrained thugs trying to take the crowd’s valuables, one of them got jumpy.”</em></p>\n<p>“Like <em>hell </em>it’s okay.” He grabs his keys from beside the door and shoves it open, breathing sharp and hard as desperation overwhelms the pain. “Stay on the phone with me, Tim. Tell me what hospital is closest to you.”</p>\n<p><em>“Gotham General,” </em>is the definitely weaker response. <em>“I think. Sorry, Jason; they’re coming towards me, I need to hang up.”</em></p>\n<p>“No, don’t you fucking dare—!”</p>\n<p>The click is a damning thing, and Jason grinds his teeth on a swear and all but sprints down the stairs instead of waiting for the elevator. It’s only once he’s there that he pauses long enough to look up current events happening downtown and pinpoint exactly where Tim is. His bike is faster than the car; dodge traffic and get there maybe fast enough to do something. But his bike isn’t any good to transport someone injured on, and if he needs to… No, the ambulances were there, and Tim’s in civilian dress. Stealing him off to the Batcave won’t get him much better treatment than a normal hospital, if it’s any better at all.</p>\n<p>He takes the bike.</p>\n<p>Most of the ride there is a blur of red lights and the blare of car horns, but he doesn’t slow for anything. Things only come back into sharp relief when he finally gets to the gathered, flashing emergency cars gathered around the museum Tim’s event was taking place at. He brings the bike to a skidding stop at a probably-legal parking stop, taking exactly long enough to turn the bike off and engage the security before he runs for the inner circle past the cars. There’s half a barricade in place, but he vaults it with only one shout aimed his direction and nowhere near close enough to stop him.</p>\n<p>A glance to the side shows a collection of officers guiding some handcuffed, heavy-jacketed men into the back of a van, and though Jason feels a sharp surge of anger towards the bastards (one of them <em>shot </em>Tim) he makes himself ignore it and throw his gaze around the rest of the clearing the emergency services have made.</p>\n<p>Three ambulances still clustered here; victims haven’t been pulled out yet. A fact even more obvious once his gaze turns far enough to scan over the museum steps, and there’s two pairs of EMTs pulling stretchers down them. He gets about as far as seeing black hair on one of them before he heads that way, swallowing down the shout in his throat until he’s close enough to confirm that the mid-length black hair and paler skin is in fact Tim.</p>\n<p>He falls into step behind one of the EMTs, close enough to the head of the stretcher that Tim’s eyes — open, <em>good</em> — focus on him even before he reaches in and brushes some of the clinging strands of hair away from his mouth. He catches the sharp glance that one of the EMTs gives him, but Tim tilts towards his hand and gives a faint, strained smile and apparently that's good enough for them not to worry about him.</p>\n<p>\"Is he going to be alright?\" Jason asks, glancing up at them.</p>\n<p>They reach the bottom of the steps, and one looks back at him with that same sharp gaze. \"Sir, you need to step away and let us get him in the ambulance. If you're family, you can get information from the hospital's staff as soon as we get him there.\"</p>\n<p>Yeah, that's not fucking happening.</p>\n<p>\"I'm not going anywhere,\" he snaps. \"Is he going to be <em>alright?</em>\"</p>\n<p>He has to step to the side as the EMTs spin the stretcher around, feeding the top end in with sure, practiced movements. Tim's head vanishes inside, and Jason steps right up in the way of the open door as the first EMT circles around to the driver's side and the second turns to him.</p>\n<p>\"We can't give information out to anyone who isn't family. You can meet us at the hospital, sir.\"</p>\n<p>\"I'm his <em>fucking </em>soulmate,\" Jason finds himself snapping through his bared teeth. The EMT actually flinches back, and he presses the advantage instead of letting himself think about it. \"Look, I'm trained in emergency medical procedure and I can handle the pain. I'm going with you.\"</p>\n<p>The man recovers quickly, and Jason thinks it probably has something to do with him being part of the Gotham breed; they deal with things so much better than most other cities. \"Fine. You don't touch anything, and you get out of the way if necessary. We clear?”</p>\n<p>“Crystal,” he answers, and climbs in before anyone else can tell him differently.</p>\n<p>He leaves the small bench for the EMT, fitting himself in beside the stretcher. Tim looks up at him, mouth in a slight curl even against the clear tension in his expression.</p>\n<p>“Did you just tell someone?” he whispers.</p>\n<p>Jason scoffs, only taking a moment to glance back to watch the EMT climb in and shut the door, calling for the driver to start moving. “Don’t make a big deal out of it,” he grumbles in return, reaching in to take one of Tim’s hands — lying on the top of the blanket spread over him — in his own, interlacing their fingers.</p>\n<p>Tim winces as the ambulance starts to move, jostling him slightly. His fingers clench down for a moment. “What are you doing here?”</p>\n<p>Jason only blinks for a moment, staring.down at the genuine confusion in Tim’s eyes and certain that the emotion is mirrored in his own. “What the fuck do you mean ‘what am I doing here’? You got <em>shot</em>. You think I’m just going to ignore that?” Tim looks like he’s genuinely considering his answer, and Jason shakes his head and slips his fingers free so he can wrap them around that wrist instead, feeling for the pulse. “No, you know what? Don’t answer that. How about you tell me what happened?”</p>\n<p>“Jason, I’m in an <em>ambulance</em>. You don’t need to check my pulse or my coherency; they already did.”</p>\n<p>He grunts, and levels Tim with an unimpressed look. “Maybe I just want to know how you got shot, jackass.” The EMT is watching them, when he looks up. \"Gunshot wound; needs surgery, right?\"</p>\n<p>A nod to confirm. \"Right thigh; no exit wound. Bleeding's not too bad though, and no major arteries got clipped. Assuming no complications, it shouldn't be that difficult. He's lucky.\"</p>\n<p>\"Hear that?\" he mocks, looking back down at Tim. \"You're <em>lucky</em>.\"</p>\n<p>\"That'd be a first,\" is the dry response, as Tim tilts his head back into the pillow and winces.</p>\n<p>The pulse beneath Jason's fingers is relatively fine, and he takes a slow breath in to forget the pain rebounding onto him as he slides his hand back up to interlace their fingers again. \"Yeah, yeah; the universe hates you. Now come on, tell me the story.\"</p>\n<p>It should occur to him beforehand, but somehow it isn't until Jason's sitting in the waiting room and Dick strides through the doors that he realizes that yeah, of <em>course </em>the rest of the family was going to show up. He stiffens up, and that draws Dick's gaze to him like a magnet suddenly finding its opposite. The surprise there is probably sort of deserved, but it doesn't stop Dick from heading for him and inspiring the sudden, sharp urge to run. Honestly it's way too late for that.</p>\n<p>\"Jason?\"</p>\n<p>He tries not to look too guarded; he's probably failing. \"Yeah?\"</p>\n<p>Dick just looks at him for a second, studying his expression and clothing choice — casual, civilian, what was he <em>thinking?</em> — with one deliberate sweep of his gaze. Whatever the look is, he seems to pass, because Dick just shifts his head in a small nod and asks, \"Tim?\"</p>\n<p>\"In surgery.\" He nods his head towards the doors leading deeper into the hospital on impulse more than to actually point the way. \"Shot to the leg; bullet didn't come out, but it looks like it didn't hit anything important. Should be pretty routine.\"</p>\n<p>He's actually sort of glad surgery was necessary, because once the adrenaline high of it all was past and he started to really notice the pain again, he was able to pinpoint the minute Tim went under by when it faded. In fact, one of the nurses actually stopped by and took the time to tell him that it was <em>normal </em>and he shouldn't be concerned by the sudden lack. They must have had some nasty freakouts from people that thought their partner was dying.</p>\n<p>\"Good.\" Dick nods, probably mostly to himself, as he looks at the doors. Then, in a quick flow of movement, he takes the seat next to Jason and looks over, leaning against the arm of the chair to face and focus on him. \"And you?\"</p>\n<p>Jason shifts a bit uneasily under the attention, narrowing his eyes. \"What about me?\"</p>\n<p>Dick smiles, but his eyes stay piercing and intent. \"Normally I wouldn't expect to find you near Tim,\" is the comment that accompanies the smile. \"I haven't heard anything about that changing. Were you nearby? A job of some sort?\"</p>\n<p>\"Something like that,\" is about all he's willing to say, but by the way Dick's head tilts that's a long ways from an acceptable answer. He scowls, hands coming between his knees to clasp together. \"I'm not the one that shot him, if that's what you're asking.\"</p>\n<p>Dick doesn’t immediately deny it, which really is proof enough that it’s one of the theories that was floating around in his head. Well, Jason can’t really be mad at him for that; his track record isn’t all that great when it comes to Tim, it’s not a theory that’s all that farfetched. Still, it stings a little.</p>\n<p>“Jason—”</p>\n<p>“Just ask what you fucking want to know,” he snaps, overriding whatever comment or delayed reassurement was about to come out. “I’m not up for the mind games right now, Dick.”</p>\n<p>There’s a short pause, but it isn’t long before Dick says, “Why are you here?” Simple, short; a question he can’t answer truthfully.</p>\n<p>“Replacement gets shot and I’m not allowed to be concerned?” he hedges, taking a glance at the hospital’s inner doors again.</p>\n<p>“Thought you didn’t want to play mind games.” He glares, and Dick offers a small shrug and smile before he sobers and adds, “Look, Jason, you said you didn’t shoot him and I believe you. I’m not going to judge you for whatever your reason is, alright? I promise.”</p>\n<p>“Bullshit,” he mutters. “You judge everything.”</p>\n<p>That gets Dick to sigh. “Okay, I won’t <em>tell </em>anyone. What promise do you want, Jason? I’ll make it.”</p>\n<p>His hands clench together a little more. “How about that you’ll stop being a prick and leave it alone?”</p>\n<p>What are the chances that the nurses or doctor come through that door and call Tim his ‘partner?’ Or make any other reference that gives this whole thing away? Too high for his comfort, definitely. He hasn’t given them a name or anything, so it isn’t like they have anything better to say. Fuck, for all he knows they could come out and confirm his identity by asking flat out if he’s Tim’s soulmate. Maybe it <em>would </em>be better to get that out of the way and say it himself instead of letting someone else reveal him.</p>\n<p>“I need to know.” Dick’s voice has lowered a bit, is a little more serious. “Jason, I trust you but I don’t have a reason for you to be here and that worries me. It also worries me that despite me clearly making you uncomfortable and defensive, you haven’t left yet. Whatever reason you have for being here it’s important, and I need to know what it is. Please.”</p>\n<p>“Stubborn bastard aren’t you?” he gripes, but he looks down to his hands. It takes a few deep breaths, and a whole lot of internal battling, before he forces himself to look back up and demand, “You don’t tell <em>anyone</em>, and you cover for me if anyone else asks.”</p>\n<p>Dick nods, holding his gaze. “Deal. I promise.”</p>\n<p>It’s something like panic in his chest, but he tightens the grip of his hands until it hurts and slowly inhales, and that’s just enough to let him say it.</p>\n<p>“Tim’s my soulmate.”</p>\n<p>Dick’s eyes widen in clear shock, and Jason yanks his gaze away and keeps talking just so he isn’t sitting there waiting on a real reaction. Or the inevitable rejection.</p>\n<p>“It’s a bitch, but we’ve been talking, managing it more or less. I felt it when he got shot, called him and went as soon as I knew where he was. Replacement’s not so bad, once you stick around him for a bit. And whatever lecture you’re cooking up just fucking leave it alone, alright? I know I’m not who you wanted for him, or good enough, or any of that, but there’s nothing I can do about it so just don’t, okay? It’s just the universe’s idea of a fucking joke; not my choice.”</p>\n<p>Jason flinches just slightly when there’s a brush of fingers against his shoulder, just enough pressure for him to feel it through the jacket and shirt that are in the way. He glares to cover the reaction up, lifting his head to meet Dick’s gaze, ready to face down whatever words and arguments are coming.</p>\n<p>“You know,” Dick murmurs, fingers still light against his shoulder, “none of that was what I was thinking.” He blinks, and Dick smiles, squeezing his shoulder for a moment before letting go. “Just… promise me you’ll be careful? If you’re at all interested? There’s a lot of history there, and I know that can be hard to navigate sometimes so if you ever want advice just let me know.”</p>\n<p>He shifts, not entirely sure what to do with the lack of aggression. It’s… not what he was expecting. At all.</p>\n<p>“I... Thanks, I guess.” His hands loosen, one rubbing at the wrist of the other. “You’re really not mad?”</p>\n<p>“Of course not. I trust you, Jason, and I trust Tim. You both can decide what you want; you’re adults. If you’re soulmates, there must be some sort of potential, right? What you do with it, that’s your choice.” The smile is still there when Dick adds, “You’re here, aren’t you?”</p>\n<p>He shrugs, his head dipping as he avoids Dick’s all too knowing gaze. “Yeah, I suppose. Just… don’t tell Bruce, alright?”</p>\n<p>Dick gives a small laugh, and when Jason looks up with a glare his smile and gaze is soft. “I promised, remember? You were tracking a lead nearby when the attack happened; stepped in to see if you could help and saw that Tim was one of the wounded. That sound about right?”</p>\n<p>Jason feels his shoulders easing down a little, along with the worry in his chest. “Yeah. Yeah it does.”</p>\n<p>He stays long enough for Tim to wake up and be actually coherent again, settled into a recovery room, but by that point half the family is there and gathered around the bed, and it’s easier for him to just share one look with Tim over their heads and then slip out. The alternative is standing awkwardly at the edges until everyone else leaves, and that’s a room filled with trained vigilantes who he’s not eager to show his hand to right now. Enough that Dick knows; he doesn’t want to try the rest of them yet.</p>\n<p>He kills time with walking back to collect his bike from its haphazard parking spot beside the museum. And during the walk he… thinks. About all of it. Tim, and the idea of soulmates, and Dick’s smile and offer and… Just all of it. Until he gets a text that just offers a brief, <em>‘All clear’</em>. Tim’s number.</p>\n<p>Visiting hours are long over at the hospital, were over even while they were waiting for the surgery to be done, so he has to sneak in. That’s easier than he thought it was going to be, really. It turns out to be a simple matter of that Tim’s room has a window, which is open, and it doesn’t take much work to climb up and into it.</p>\n<p>The lights are off, door closed and blinds shuttered, but the moonlight is more than enough for him to see it when Tim turns his head to look at him. One hand — the one not weighted down with the IV’s needle and tubing — lifts to wave at him before he crosses the room. There’s a chair still pulled up by the bed but he ignores it, taking a seat on the edge of the bed itself instead and looking down.</p>\n<p>“Doing alright?” he asks, keeping his voice quiet enough that there’s no way anyone outside the room hears.</p>\n<p>Tim nods, gives a smile that’s just slightly wider than Jason normally sees from him. “Good drugs, and no longer a bullet in me. It’s an improvement.” That same hand lifts, touching his elbow and curling lightly around his jacket. “Thank you for earlier, Jason. For coming.”</p>\n<p>“What else was I going to do, sit in a corner at home and clutch at my side?” He winces the moment he says it, and lifts his hands to drop his face into them and rub at his eyes. “Fuck, no, I’m sorry, I didn’t mean to make it sound like—” He sighs, lifting his head and looking over at Tim. “I’m really bad at all this. Sorry.”</p>\n<p>The shrug is small, but he catches it. “I don’t mind the sarcasm.”</p>\n<p>“<em>I </em>do.” He takes a short breath and turns a bit, reaching over and clasping his palm over the back of Tim’s hand, still curled into his jacket at his other elbow. “I… I was thinking, while you were in surgery, and while everyone else was here. None of this has been fair to you; <em>I </em>haven’t been fair to you.”</p>\n<p>“Jason—”</p>\n<p>“Hush,” he interrupts, “just let me talk. I swear this isn’t some sort of like, in the face of death bullshit or something, but this whole thing did kind of make me realize that I’ve been a real prick to you. And I’m sort of an ass in general so maybe don’t really look for that to change, but I really recognized that I’ve been an ass specifically to you and I’d… I’d like to change that. I don’t know if I can promise anything, or if I can get any better, but at the least I want to try. Because I…” He shrugs, continuing to avoid Tim’s gaze. “I like talking to you, and all the issues I had with you were pretty much just my own problems dumped on your head and that sure as fuck wasn’t fair either. So, I want to maybe see what this thing between us is… without my own bullshit in the way. I mean, if you want to.”</p>\n<p>Tim’s fingers curl tighter into his jacket, and it ramps the nervousness in Jason’s chest higher to do it, but he forces himself to look over anyway. It’s a small smile that greets him, and that’s unexpected enough that it all but deflates the pocket of nervousness.</p>\n<p>“I’d like that,” is Tim’s answer, soft but sure.</p>\n<p>He swallows. “Really?”</p>\n<p>The nod is as sure as Tim’s voice, and the fingers on his jacket pull just far enough away to take his hand instead and squeeze. “Really; I want to.”</p>\n<p>Jason squeezes back, his words sticking in his throat for a moment before he swallows again to clear it, and breathes in deep as he really meets Tim’s gaze. “Maybe we can take it slow and just see what we end up as?”</p>\n<p>“That sounds good.” Tim tilts his head a little, looking down at him a bit more directly. “Do you want to talk about it?”</p>\n<p><em>Yes</em>, but, “Not right now. You should get some sleep; we can do it later.”</p>\n<p>There’s definitely something teasing in Tim’s tone when he answers, “It’s a date.” Jason stalls for a moment, and that’s long enough for Tim to continue on. “Stay with me for a bit? Before I fall asleep?”</p>\n<p>Jason feels his own mouth curl into something like a smile. “Yeah,” he promises. “Of course.”</p>"
}