{
  "id": "12946683",
  "url": "https://archiveofourown.org/works/12946683?view_full_work=true",
  "author": [
    "Rose_gold715"
  ],
  "title": "Finally",
  "rating": "Not Rated",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "방탄소년단 | Bangtan Boys | BTS"
  ],
  "relationships": [
    "Jeon Jungkook/Park Jimin"
  ],
  "characters": [
    "Jeon Jungkook",
    "Park Jimin (BTS)",
    "Kim Namjoon | Rap Monster"
  ],
  "additional_tags": [
    "Alpha/Beta/Omega Dynamics",
    "Alpha/Omega",
    "Alpha Jeon Jungkook",
    "Omega Park Jimin",
    "Mating Bond",
    "Mild Blood",
    "Angst with a Happy Ending",
    "Angst",
    "Wolf Pack"
  ],
  "language": "English",
  "series": "",
  "published": "2017-12-08",
  "completed": "2018-06-29",
  "words": "12,262",
  "chapters": "2/2",
  "comments": "357",
  "kudos": "8,963",
  "bookmarks": "2,214",
  "hits": "169,381",
  "summary": "<p>Unloved and outcasted, Jimin runs away from his mate and his pack. Jungkook comes after him, and saves Jimin in more ways than he could imagine.</p>\n<p>Turkish translation by sushimonn - https://my.w.tt/0cnfmM3iJX</p>",
  "notes": "<p>So I wrote this just to be a short one-shot so it isn't as in depth as my other stories, anyway, hope you enjoy!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>Eep thank you for waiting for this sequel. I think it may not have been what you expected but nonetheless I hope you enjoyed it! Basically what I wanted to say with this chapter is that there's strength in fighting for yourself, but there's also strength in knowing when it's time to let go and move on - it's not giving up, it's realising what's best for yourself, your life, your happiness --- so never think it's cowardly to decide to walk away from something that doesn't make you happy. There's strength in removing yourself from a toxic environment!</p>\n<p>A lot requested historical au so I will think about a fic for this, and also may try some vampire au - we'll see hehehe</p>\n<p>Also, after much request, my twitter account is @R_g715 xxx I'm still figuring twitter out though hahaha. I probably won't be extremely active on the account all the time but I'm looking forward to interacting with you all more.</p>\n<p>xx</p>",
  "text": "<p>Jimin shoved what scraps of food he had managed to save and steal into his bag, along with a few bundles of blankets and coats and slipped into his worn out shoes. He swallowed down any hesitance he had before leaving the hut and sneaking off into the trees, out of the Kim territory.</p>\n<p>Kim Namjoon was a kind alpha pack leader, but he wasn’t the problem.</p>\n<p>It was the pack as a whole, and Jeon Jungkook, Jimin’s mate.</p>\n<p>At the thought of his significant other, Jimin inhaled sharply and willed the urge to return back to the warm bed away.</p>\n<p>Jungkook didn’t love him, never had. Jungkook mated because he had to, and chose Jimin because the omega had no choice. Jimin was practically a hostage when he was taken into their pack.</p>\n<p>The Park pack had been led by a ruthless, disgusting, vile leader who had taken many mates. He sought out the prettiest new beta or omega, made them his, and then disposed of them when he got bored.</p>\n<p>Jimin had been next.</p>\n<p>No one refused courting from the head alpha, especially not the Park’s.</p>\n<p>The night Jimin was prepared to be mated off was the night he thought had been saved, and yet, that wasn’t the case. He was overruled again and forced to mate to survive.</p>\n<p>The Kims and Parks had been rivals for years, pushing each other’s limits, venturing onto each other’s territory to purposely aggravate. The tension snapped when the Park leader sexually harassed one of the Kims’ mated betas. They decided enough was enough, and that this time he had gone too far. They weren’t going to stick around and wait for something worse to happen, like the revolting threats he whispered into the terrified beta’s ear.</p>\n<p>They attacked, and killed the wolves who fought back, showed mercy to those who surrendered. They took over their territory and allowed the remaining Park wolves to stay for a few days before they had to either pledge their allegiance to Kim Namjoon, or leave and find a new pack. Many wolves had friends in other packs which they left for, others decided to stay and, under scrutinizing watch, earned a place under Namjoon’s protection.</p>\n<p>Jimin wanted neither. He had no relatives or friends to go to, but he did not want to stay in a pack who hated him. In their eyes, he was the Park alpha’s mate, many argued he should, by extension, be killed also. Namjoon felt it was unfair considering they had not yet mated. Jimin pledged loyalty with a heavy heart. It didn’t stop the insults, the dirty glares, the lack of companionship from anyone.</p>\n<p>Why Jungkook asked for his mating had shocked him. Jungkook was devastatingly handsome, disarmingly charming, and despite his taciturn composure he seemed sweet. Silently, Jimin had been flattered, and then later worried it had been a joke, a trick to see if Jimin, the <em>disgusting, good-for-nothing Park alpha’s mate </em>would fall for it. It wasn’t til a few days later that Jimin heard the rumours.</p>\n<p>\n<em>Jungkook needs a mate to secure a higher position within the pack.</em>\n</p>\n<p>Jungkook was a young but highly skilled alpha wolf, but even the best needed mates to become higher ranked in the pack hierarchy. It was a safety blanket – that even if a wolf no longer supported the pack leader, they would be true to their mate, who was under the pack leader’s protection.</p>\n<p>At the time, Jimin told himself he didn’t care. He had long given up on finding a sincere mate who would court him properly, shower him with love, hold him during the winter and make him feel safe and like he belonged. But he underestimated how much a mating would do to him.</p>\n<p>Jimin craved affection in a way he never had before. He grew up with disappointed parents who had wanted an alpha. They had been happy when the Park leader chose him as his – possibly fifth – mate. Then, after the invasion, they took off without him. Jimin grew up with criticism, he was no stranger to cold stares and clipped tones, but since they mated, Jimin longed for approval, praises, acknowledgment from his alpha. Jungkook gave him none.</p>\n<p>\n<em>He doesn’t even like me.</em>\n</p>\n<p>During the mating, Jungkook had been gentle and patient, but none of it had been passionate or loving. Jimin felt cold and empty since they made the bond. A terribly weak bond. Jungkook shut him out almost instantly. He got his promotion. Jimin got another broken promise.</p>\n<p>He told himself it was purely for survival. A month and a half later he finally admitted it for what it was. A part of himself he can never get back. Omegas couldn't mate again, and what alpha would mate him anyway? He was useless. Jimin couldn’t hunt, couldn’t sew, couldn’t please his alpha. The few times he’s cooked for the pack he learnt the dishes the Parks ate were not to the Kim pack’s taste. He would go to collect berries and herbs with the other pack omegas but couldn’t distinguish the poisonous from the edible. Nevertheless, he used to pick out blueberries to give to Jungkook. The first time he did it his alpha had blinked at him, surprised, before taking them quietly.</p>\n<p>Jungkook always accepted them, sometimes with a quiet thank you, but a few months later an omega had sided up to Jimin with a sneer. “Jungkook hates blueberries.”</p>\n<p>Jimin stopped after that. Jungkook didn’t say anything when he came back with nothing for him.</p>\n<p>Jimin tried taking interest in Jungkook’s likes. He once asked if he’d take him hunting – Yoongi always took his mate Hoseok hunting – and Jungkook agreed. But Jimin was quite sure he ruined all their potential kills by his clumsy running and lack of stamina, and in the end Jungkook told him to just wait and left to hunt by himself. Jimin did his best to make Jungkook a coat out of bear skin but the sewing and stitching got too difficult and he when he asked for help from the other omegas he was met with looks of judgement. He gave up and turned it into a blanket instead. He wasn’t sure if Jungkook even knew about his failed attempt.</p>\n<p>Jungkook spent his rut elsewhere too, and rumours floated around that he had been with another omega.</p>\n<p>Due to that, Jimin decided to bear his heat alone despite how much he desired Jungkook. It had been awful. He sobbed into the rugs as his body flushed over and over, mating bite painful and burning, Jungkook so close nearby. After the heat, Jungkook had given him an apologetic look.</p>\n<p>It wasn’t all bad – Jungkook could be sweet, and sometimes did kind gestures. He once brought back a flower from a hunt, a pretty, white lily. He sat next to Jimin during the dinners and would offer to get the food for him, so Jimin didn’t have to go up and get it himself. He’d throw the others a glare and tell them to shut up when they started badmouthing Jimin’s almost mating.</p>\n<p>Jimin liked Jungkook a lot, but he couldn’t stay in this pack. He was an outsider, a nobody, a stepping stone. He was convenient. And now, unnecessary.</p>\n<p>Jimin trudged down the path, shoulders slumped despite the determination. Jungkook and the other alphas were out on some hunt to get resources for winter. By the time he got back, Jimin would – hopefully – be long gone. Out of the territory, out of the pack.</p>\n<p>It was a bit terrifying. Jimin knew he was probably going to freeze to death. He had little food and water, and no destination in mind. But he was at his breaking point. This was where he belonged – to no one, nowhere.</p>\n<p>A shiver ran up his skin and his teeth chattered. Jimin shoved his hands into his coat and walked faster, eyes scouring for a place to huddle up and stay until morning. He eventually found a bush where he could make space within the branches. It wasn’t warmer, but at least Jimin would be concealed from predators. He brought out a blanket from his bag and brought it to his nose, Jungkook’s warm ginger scent still on it. Jimin hated how it comforted him, eased the ache and emptiness in his chest.</p>\n<p>Their bond was already so weak it would surely break in a matter of months. Jimin wondered if he’d even feel it. He doubted Jungkook would.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Jimin was starving.</p>\n<p>It was the second day of his plan to escape – though he was sure no one was searching for him – and his stomach ached. He knew had to hunt for food, and at the idea of that his stomach plummeted even further.</p>\n<p>Leaving his bag and supplies on the ground, he shifted into his wolf form, a sandy blonde coat. Jimin sighed dejectedly as he raised his nose to the air, ears turned and listening for prey. He had never been the greatest hunter, but what was even worse was the skinning of the animal. His parents told him he was too soft for his own good.</p>\n<p>After an hour of searching and finally hunting down a small rabbit, Jimin shifted back, donned his clothes whilst shivering uncontrollably from the cold, and stared sadly at the dead animal. It was always different when he had to look at the fresh kills – it was easier to ignore when he just saw the meat already skinned and cut and cooked. This was life though, there was a food chain. There was always a hierarchy, an order, and maybe Jimin sympathised with the poor rabbit because he was also on the bottom – looked down and used.</p>\n<p>Jimin steeled himself as he pulled out a knife he had brought, clenching his jaw as he cut into the rabbit. He tried to dissociate himself from the breaking of bones, messy, staining blood, but before he knew it was bending over the ground vomiting what little was in his stomach. Hot tears stung his eyes and he wanted to sink into the ground and cry.</p>\n<p>Jimin should be used to loneliness by now.</p>\n<p>He wiped his nose on his sleeve and distracted himself by building a fire, then cooking the meat over, relaxing when the smell of blood was slowly swept away. He wondered what Jungkook’s reaction would be when he came home. Maybe he’d be surprised. Maybe glad. Maybe he’d search all over the territory for him. Maybe he’d come looking for him. Jimin shook his head at that with a sad smile.</p>\n<p>After putting out the fire, much to the disappointment of his freezing hands, he began his trek further south. He was quite sure he was out of Kim Namjoon’s territory, and now he could be seen as a traitor. They could kill him if he tried to come back. Jungkook could kill him.</p>\n<p>Jimin wrapped his coat around his small frame tighter, shivering from the cold winds and quite sure occasionally he could see small flakes of snow. His teeth chattered and more than ever he craved Jungkook’s body heat. They may have shared a bed but they didn’t hold each other, but the alpha’s heat warming up the blankets was enough for Jimin to feel cosy during winter. Sometimes, in the rare mornings Jimin woke up before Jungkook, he’d find himself tangled with Jungkook’s long limbs, or his sleeping face close to his, or a hand resting on his waist. For a moment he could pretend this alpha was his loving mate, that they’d chosen each other and had some beautiful romantic story behind their courting. Or, even if it wasn’t the greatest story, even if it was simple and plain and quite honestly cliché, Jimin wouldn’t mind. Anyway, he’d miss those mornings.</p>\n<p>Jimin’s feet were sore and tired, and though he could travel in wolf form he’d have trouble holding all his supplies, besides, he wasn’t exactly in a rush to get anywhere. Still, his toes were freezing and his nose getting cold. He felt pitiful and pathetic, like he did after he realised mating with Jungkook had been a mistake. He supposed, for once, he just wanted to be wanted.</p>\n<p><em>It could have been nice, </em>Jimin thought to himself. Jungkook was an ideal mate – Jimin’s parents would have handed him over to someone like Jungkook in a heartbeat. But now, Jimin understood it didn’t matter how attractive the person was, or how good he was at providing, Jimin felt empty and discarded. It wasn’t like he was forced into it – he could have said no, maybe he should have to see if Jungkook would have court him further or merely move on to the next available omega – he brought this on himself, and he deserved what he got.</p>\n<p>But, it would have been nice if it had worked out. Jimin saw a shot of happiness. Yesterday, he gave up on that.</p>\n<p>\n<em>I hope he’ll at least miss me, even a little.</em>\n</p>\n<p>Jimin sighed, breath visible in the cold air, and got lost in hopeless ‘what if’s.’</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Jimin knew something had been off when he felt a strange scent permeate the air. It was about midday, and he was starting to get a bit dazed and weak from dehydration, so he hadn’t paid heed to the prickles of a predator’s stare.</p>\n<p>It wasn’t until a large wolf stepped out in front of him that Jimin felt his heart thud against his ribcage and his breath catch in his constricting throat.</p>\n<p>Growl low in his throat and teeth bared.</p>\n<p>\n<em>Alpha.</em>\n</p>\n<p>It was slightly scrawny, but still built with muscle, and from the dark, vicious look in its eyes it was ready to kill.</p>\n<p>Jimin was frozen to the spot. There was no use running, he’d hardly have time to change even if he tried. The wolf must be rogue, and judging from its reaction, Jimin had ventured too close into his territory. Rogue wolfs didn’t take kindly to outsiders – they had little morals and ethical values. This wolf wouldn’t care that Jimin was a weak omega and an absolute threat to no one. He’d have no qualms ripping him apart.</p>\n<p>Jimin’s hands clenched into fists, sweat breaking out on his skin. He was trying to think but his mind was racing. <em>I’m going to die. </em></p>\n<p>He took a deep breath and tried to maintain his blank expression, tried to conceal the fear rushing through his veins, tried to ignore the way he pleaded for Jungkook, bond throbbing between them, the only indication that there was still some connection there as weak as it was.</p>\n<p>He wished Jungkook was here.</p>\n<p>Jungkook was the strongest, most agile, most skilful fighter in the Kim pack – he was the one who killed the Park pack leader, the one who found Jimin bundled in the corner of the hut, trembling from fear and whimpering as he tried to move away, just having watched his future mate slaughtered in front of his eyes.</p>\n<p>\n<em>“I’m not here to hurt you.” Jungkook had said after he shifted back, wiping blood off his arms and indifferently picking up one of the Park alpha’s coats to put on, merely for the sake of concealing his nudity, scowling a bit at the scent. “Are you his mate?”</em>\n</p>\n<p>\n<em>Jimin shook his head, mouth sealed shut, eyes brimming with tears. </em>\n</p>\n<p>\n<em>Jungkook’s eyes had fallen to his neck to check for a bite mark all the same. When he spotted none, he offered a hand. “Come. There’s nothing left for you here.”</em>\n</p>\n<p>\n<em>This man had just murdered his pack leader and seemed scarily nonchalant and calm about it. He was a stranger, a rival pack alpha. But from the second Jimin took his hand, he trusted him. </em>\n</p>\n<p>Jimin slowly slipped his hand into his pocket and found the knife. He wasn’t going to die without a fight.</p>\n<p>The rogue wolf took a step forward.</p>\n<p>Jimin steadied himself.</p>\n<p>Then he pounced.</p>\n<p>It happened so fast Jimin didn’t have time to think before the adrenaline kicked in. He drew out the knife and managed to drive it into the side of the wolf but the effect was minimal. The wolf knocked him over and his jaw came snapping down into his neck –</p>\n<p>There was a swish of the air past Jimin’s ear and then the wolf went limp above him.</p>\n<p>Something hot trickled down onto his neck and chest.</p>\n<p>A sharp, bitter scent invaded his senses.</p>\n<p>\n<em>Blood.</em>\n</p>\n<p>Jimin’s mind was in a daze. <em>Is that mine? What happened? Am I dead? </em>The wolf’s weight was pinning him to the ground but he was motionless. The liquid oozing onto him was making him frantic. Jimin hated blood. Tears stung his eyes as he tried to force the body off, the head shifted into the crook of his neck, nosing directly at the mating mark and Jimin <em>screamed. </em>He began shuddering uncontrollably, his heart rate was fast and his breathing was uneven. His feet scrambled on the ground and his fingernails dug into his palms –</p>\n<p>The wolf was suddenly hauled off his body and hurled away, back smacking across the icy forest floor. He was still.</p>\n<p>Jimin felt air finally enter his lungs and then –</p>\n<p>\n<em>Jungkook. His mate.</em>\n</p>\n<p>Relief. That was the first thing that raced through his body.</p>\n<p>Jungkook came for him.</p>\n<p>His alpha stood above him frowning, eyes dark and angry, but they softened when they met his. Jungkook was still in human form, long coat draped over him, black hair falling across his forehead and slightly panting.</p>\n<p>Jimin slowly looked to the side at the dead rogue wolf and noticed the large hunting knife piercing straight through the neck, just under his jaw. He saved him.</p>\n<p>“Jimin…” Jungkook whispered quietly, as if persuading himself that Jimin was actually here. He bent down and helped Jimin sit up, large hand on his back, the other grasping Jimin’s hand. “Shh, breathe.”</p>\n<p>Jimin realised he was whimpering. Blood was becoming sticky on his neck and chest and the adrenaline was still in his system. The panic hadn’t worn off yet. “J-J-Jung-kook –”</p>\n<p>“Hush, just breathe.” Jungkook commanded gently and wiped his cheeks. Jimin hadn’t even realised he was crying.</p>\n<p>Jimin wanted to sob. His mate – the mate he <em>abandoned</em> – came for him. He saved him. He had every right to kill Jimin too, punish him for his disloyalty, his betrayal, and yet here he was thumbing away his tears, whispering reassurances.</p>\n<p>Jimin didn’t know if he should be happy or upset. How could he leave now? How could he tell Jungkook, face to face, that he didn’t want to stay in the pack? How was he supposed to let go of his mate?</p>\n<p>“The b-blood…” Jimin managed to stutter. The smell was making him sick.</p>\n<p>Jungkook wordlessly helped Jimin out of his stained coat and used it to wipe up the blood on his skin. The cold made Jimin shiver and without a second thought he pressed into Jungkook’s side, into his body heat. Jungkook shrugged off his larger, thicker coat and wrapped it around Jimin.</p>\n<p>“But –”</p>\n<p>“I am fine, don’t worry about me.” Jungkook cut off Jimin’s protest sternly. He was upset with Jimin, that was obvious enough. “Are you hurt?”</p>\n<p>Jimin shook his head. He couldn’t register anything anyway, except that his mate was here and being so kind. <em>What has Jimin done to deserve this? Why did Jungkook come after him?</em></p>\n<p>“Can you stand?”</p>\n<p>“I t-think so.”</p>\n<p>Jungkook held his arms as he assisted Jimin to his feet. His knees were weak, his back hurt and he leaned on Jungkook more than he would have liked, but as he gained his balance, so did his resolve. He expected Jungkook to scold him, snap at him for running away, ask him why he did what he did, but instead, he adjusted the coat around Jimin’s smaller frame, the outerwear too large and drowning the omega.</p>\n<p>“Let’s go home.”</p>\n<p>Jimin’s heart ached.</p>\n<p>He wanted to, he really did. It sounded so tempting – a hut, a warm bed, clothes, food, Jungkook. But the Kim pack was not his home. Jungkook was not his home. He was an outsider, a wolf living within a pack that didn’t accept him, with a mate who did not know him.</p>\n<p>“I can’t…” Jimin stood firm and pulled his hand away from Jungkook’s gentle grip.</p>\n<p>His alpha froze, eyes boring into Jimin’s. “Stop this, Jimin. You’ve made your point –”</p>\n<p>“I hate living there. I’m not going back.” Jimin snapped and he felt like utter dirt. Jungkook had just saved his life, given him his coat which dripped of his scent and made Jimin feel comforted and safe, and here Jimin was acting like a spoilt child. But he <em>couldn’t </em>go back to feeling isolated and alone, feeling like he was useless and unwanted. He couldn’t keep pretending that it wasn’t killing him inside every day.</p>\n<p>“You’re being ridiculous.” Jungkook began but there was something in his tone, a desperation, a small tremble. “Where are you going to go? You’ll freeze out here, or starve.”</p>\n<p>“I’d rather starve.” Jimin retorted and felt new tears gather in his eyes. Jungkook’s nonchalance slipped and there was hurt. “Everybody hates me. I have no friends. I can’t do anything. I ruin your hunts, I can’t stitch you clothes, I-I don’t know how to get through to you, I feel so – so dumb and worthless.”</p>\n<p>Jungkook remained silent, looking a combination of shock and anger.</p>\n<p>“Nobody cares that I’m gone, right? Has anybody even noticed?” Jimin continued as tears trekked down his cheeks. “You can find a new mate, Jungkook. Don’t you already have one anyway? I’m sure they’re much better for you – and I’m not mad – I get it, you know, I’m just – such a disappointing – I was supposed to mate the Park leader, I’m disgusting –”</p>\n<p>“What are you talking about?” Jungkook interrupted, tone lowering and it was dangerous. He sounded livid. Jimin took a step back, an action that did not go unnoticed by the alpha. “What other mate do I have?”</p>\n<p>Jimin gulped. “Your rut...”</p>\n<p>“What about it?”</p>\n<p>“Didn’t you… did you not spend it with another omega?” Jimin mumbled.</p>\n<p>Jungkook looked incredulous. “<em>What?”</em></p>\n<p>“I understand why you would –”</p>\n<p>“You <em>shouldn’t. </em>Do you hear yourself? I am <em>your </em>mate. Why on earth would I spend it with someone else?”</p>\n<p>“Well, you didn’t spend it with me!”</p>\n<p>Jungkook flinched, but composed himself a half second after. “We can talk later. You’re freezing, and I bet you haven’t eaten a proper meal in the last two days –”</p>\n<p>“Please, can’t you hear what I’m saying? I’m not going back!”</p>\n<p>“Why?” Jungkook snapped and Jimin wanted to ease the despair off his face. He looked confused and… scared.</p>\n<p>“I just told you!”</p>\n<p>“Then what about how <em>I </em>feel?” Jungkook challenged and rounded on Jimin who felt pressure to bare his neck in submission. “Do you have any idea how much it fucked me up when I came back and you were just gone? You didn’t even give me a chance to try fix things. You didn’t give me any warning. What the hell was I supposed to do?”</p>\n<p>Jimin glanced down and felt his chest tighten at every sentence that left Jungkook’s mouth, deepening the cracks in his heart, tearing through his guilt. He never imagined Jungkook to react like that. “I don’t know – I didn’t think you would care,” he murmured quietly.</p>\n<p>Jungkook was silent as Jimin sniffled into his sleeve.</p>\n<p>“Come back, Jimin. I know I’ve been a shitty mate. I haven’t looked after you, and that’s all on me.” Jungkook sighed and stepped closer, words sincere and pleading. “Let me try again, I’ll do better, I promise. Don’t go – I don’t want you to go.”</p>\n<p>Jimin stared at the ground, wet from the cold and scattered with leaves.</p>\n<p>He wanted to believe Jungkook. He wanted to think that things would be different, but what if nothing changed? What if he was just saying those things just so Jimin would come back and he wouldn’t have to bear the shame of having an omega leave him? What if no matter what he did, Jimin would never be accepted there? Was that the kind of life he wanted to live? Was that a life worth living?</p>\n<p>“<em>Please, </em>I can’t sleep knowing you’re out here alone.” Jungkook reached for Jimin’s hand, but the omega moved away. “Can’t – our bond, can’t you feel it straining?”</p>\n<p>“It’s been strained for a while.” Jimin whispered.</p>\n<p>“Doesn’t it hurt you?”</p>\n<p>“Of course, it hurts me.” Jimin shot back and felt hot tears in his eyes, and a flush of frustration. His omega is crying for affection from his alpha. “But it hurts more when I get ignored, and have to eat in silence, when your pack send me dirty looks, when I have to do everything alone because no one wants to get near the Park <em>slut.”</em></p>\n<p>Jungkook flinched and anger filled his eyes, but there was also sadness and regret. He bit on his lower lip and looked away for a few seconds, gathering himself. Finally, he peered down at Jimin with delicacy. “<em>Our </em>pack.”</p>\n<p>Jimin scoffed to mask the way his stomach clenched at the softness of his tone. In his old pack, he would have gotten a beating for speaking to an alpha like that, but Jungkook was composed, and even if he had been upset by the words, he controlled his temper.</p>\n<p>“So there is nothing I can say to make you come back?” Jungkook resigned finally.</p>\n<p><em>Is he giving up? </em>Jimin fought the panic that rose in his chest as the mark in his neck ached. “No.”</p>\n<p>Something seemed to break within his alpha. Jungkook took a sharp breath and his stance loosened, as if the will had left him. Still, his gaze was surprisingly warm. “Then, let me at least find you somewhere to go.” He sounded more desperate now. “I’ll arrange a pack to take you in – a good one – and I’ll take you there so you don’t get hurt and – and then you never have to see me again. Just come back ‘til spring and then you can go. You don’t have to re-join the pack, just until winter is over, and then you can leave, okay?”</p>\n<p>Jimin stared at him, heart pounding furiously in his chest for a reason he was not ready to acknowledge.</p>\n<p>“I won’t force you to stay. I just want you to be safe. I know a pack up in the mountains – you’d like it there, I think, they have these fields with flowers and the pack is really nice… would that – would you be happy, then?” Jungkook stammered and he looked young, vulnerability betraying the stoic mask he often wore.</p>\n<p>Jimin was speechless. The offer was unbelievably thoughtful, and despite looking like it pained Jungkook to say it, was earnest. He hadn’t prepared himself for that. Jimin hadn’t thought about joining a new pack – why would they take him in? An omega who left his alpha, his loyalty would be questioned instantly. Especially since Jungkook was such a decent mate. <em>I’m leaving someone so inherently good. </em></p>\n<p>He was so confused. He didn’t know why the offer tore his heart apart, why he felt a pull to his mate’s arms. He was just <em>lost.</em></p>\n<p>Would he be happy?</p>\n<p>What did that even feel like?</p>\n<p>Jimin glanced up, vision blurry. When he spoke his voice was very small. Wavering. Unstable. “I just want to belong.”</p>\n<p>\n<em>That’s all I ever really wanted.</em>\n</p>\n<p>The second it took for Jungkook to walk closer and hold him was the time it took for his bruised and beaten heart to crumble, breaking down after years of enduring verbal abuse and neglect.</p>\n<p>“You do belong. With me.”</p>\n<p>Jimin allowed himself to be brought into Jungkook’s embrace. Jungkook hissed as Jimin’s freezing skin met his, pulling the coat tighter around him, body heat warming him up. “Give me another chance. If spring comes and you still want to go, I won’t stop you.”</p>\n<p>Despite how pathetic he felt running away for two days and then returning with his tail between his legs, Jimin nodded.</p>\n<p>\"Okay.\"</p>\n<p>Jungkook sighed into his neck, eyes closed.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>“You had me so worried.” Jungkook mumbled as Jimin wiped his body down of the remaining blood. He was turned away, giving Jimin his privacy.</p>\n<p>Jimin’s hands were trembling as he finally cleaned the last stain of blood, dropping the rag back into the bucket of water Jungkook had warmed up by the fire. “How did you find me?”</p>\n<p>“The hunt ended earlier than expected, and I could still follow traces of your scent.”</p>\n<p>Jimin quickly slipped into warm clothes and shamelessly shrugged on Jungkook’s coat again, scent wrapping around him. Protective. “You can turn back around.”</p>\n<p>Jungkook faced him again, gaze gentle but sad. “I’m sorry, Jimin.”</p>\n<p>Jimin sat down in the blankets of their bed, body glad to be back. He was so pitiful for thinking he could run away successfully, it was tragic.  He couldn’t even do that. And yet, here was Jungkook apologizing. “For what?”</p>\n<p>“For everything.” Jungkook replied and moved towards him slowly, sitting down beside him and pulling a blanket up – the one Jimin had tried to make into a coat – around his shoulders. “I’ve failed you as a mate.”</p>\n<p>Jimin remained silent.</p>\n<p>“I always thought having a mate would be a bother. I didn’t have an omega I liked, so I chose you because I figured you’d say yes and expect nothing much from me. You think I played you like a fool, but the fool is me. The pain I felt when I realised you left, I brought onto myself.” Jungkook played with the loose threads of the blanket. “I got so used to you being here, to sleeping next to you, seeing your face when I got back from hunts. I knew you weren’t happy and I just felt stupid and guilty. I didn’t want you with me during my rut because I’d already forced you into the mating. I didn’t think you’d be comfortable, and I didn’t want to make you feel obliged to be with me any further.”</p>\n<p>Jungkook took a deep breath and glanced at Jimin who was staring at his knees.</p>\n<p>“But I heard you crying during your heat and I… I just felt like the worst mate in the world. I wanted to try to be better, but – I don’t know – it’s hard. I don’t know how to act with you because I did this mating thing all wrong,” Jungkook ran a hand through his hair, eyebrows narrowed like he was angry at himself. “Then you left and I – I freaked. You took everything of yours with you – like you were just gone and… I thought I’d find you dead somewhere, to be honest. I screamed at the pack, and got in a bit of a fight with Namjoon-hyung, and – I was a mess.”</p>\n<p>Jimin swallowed heavily. He didn’t realise his absence would affect Jungkook so greatly. He felt guilt pooling in his stomach and it sickened him. He couldn’t deny a part of him was happy Jungkook missed him so much. He licked his lips, mouth dry and eyes stinging. “But I’m such a useless mate, Jungkook. I can’t do anything.”</p>\n<p>“What do you mean?” Jungkook tilted his head, looking confused.</p>\n<p>“Like – this blanket. I tried to make this into a coat for you, but I couldn’t.” Jimin motioned weakly to the blanket around his alpha’s broad shoulders. “And the blueberries. You don’t even like them but I would bring them back for you each time.”</p>\n<p>Jungkook gave a small chuckle, something so endearing about it that Jimin faltered. “I know. I waited for you to say something, gift it to me properly, but you didn’t. But I don’t really need a new coat anyway, and I like this. It… it smells like you.” His cheeks were a light shade of pink. “And I didn’t mind the blueberries. Is that why you stopped?”</p>\n<p>“Why didn’t you tell me you didn’t like them –”</p>\n<p>“Because you got them specifically for me. It made me happy, knowing you were thinking of me. I didn’t want you to get embarrassed or stop, I guess. I liked seeing your face when you’d give them to me. You’re so… gentle. I’m just, I’m just so fond of you.” Jungkook tugged at his hair and found Jimin’s hand under the blanket.</p>\n<p>Jimin felt like an idiot. Part of him was in disbelief, and the other just urged him to accept this moment, accept Jungkook’s words. <em>Fond. </em>That wasn’t a word he heard often associated with him. His mating bond burned and Jimin wanted to wrap his arms around Jungkook and kiss him. He was finally receiving the kind of affection he had been longing for his whole life.</p>\n<p>“Can I scent you?” Jungkook whispered cautiously.</p>\n<p>Jimin swore his heart almost stopped. Scenting was one of the most intimate acts a couple could do, it was a sign of love and protection, of devotion and trust.</p>\n<p>“Okay.”</p>\n<p>Jungkook leaned in almost instantly, mouth against the mating mark causing a shiver to run down Jimin’s spine. Jimin unconsciously gripped Jungkook’s hand tighter. The alpha’s scent washed upon his scent glands, spread across his body and made him feel strangely nostalgic, like finally coming home.</p>\n<p>“Don’t run off again. Please, don’t do that again without talking to me first.” Jungkook said against his neck, body shaking against Jimin’s.</p>\n<p>Jimin nodded because he was too choked up to say anything.</p>\n<p>They laid back in the bed and for the first time Jungkook pulled him close and held him, warming him from the winter, body like a furnace.</p>\n<p>Jimin hesitantly placed a hand on Jungkook’s chest, heart beating under his fingertips.</p>\n<p>\n<em>I’m just so fond of you.</em>\n</p>\n<p>Maybe he did belong somewhere.</p>\n<p>And maybe, it had been here all along.</p>\n<p>\n<em> “Come. There’s nothing left for you here.”</em>\n</p>\n<p>\n<em>Jimin felt dizzy and nauseous from the pool of blood now staining on the ground, the still warm body of his pack alpha and to-be mate lying lifeless in the centre of it. This new alpha – an enemy alpha – extended a hand. His eyes didn’t regard him with malice, he seemed harmless despite the carnage he had just caused.</em>\n</p>\n<p>\n<em>Jimin gulped and whined, curling his body and shuffling backwards when he stepped closer to him, baring his neck in automatic submission, eyes squeezed shut and trying to hide from this alpha’s gaze. He felt more exposed than ever – body paint now smudged over nude, pale skin.</em>\n</p>\n<p>\n<em>“You don’t have to be scared.” The alpha said softly. “Here.” He passed him one of the coats but Jimin physically recoiled, bile rising. He hated the scent of the pack alpha maybe even more than blood.</em>\n</p>\n<p>\n<em>The other alpha stopped and pondered for a second before he abruptly stood up and left. Jimin stared confusedly at the spot where he had just been. The thought of escape crossed his mind but it was gone the second he heard screams of fear from his pack and what sounded like fighting and whimpers of pain. Jimin was too afraid to cry.</em>\n</p>\n<p>\n<em>That other alpha returned a moment later, a different garment in hand. Without so much as a word of warning he draped it over Jimin’s frail shoulders, frowning when the omega jerked from fear. This new scent was toasty and warm with ginger undertones and hints of soft floral. Jimin felt something ease in his chest.</em>\n</p>\n<p>\n<em>“It’s alright.” He took Jimin’s hand and this time he allowed himself to be lead up and away from the dead body. His grip was firm, but not crushing. “No one will hurt you from my pack.”</em>\n</p>\n<p>\n<em>Jimin trusted him so stupidly back then – some part of him instantly convinced in the sincerity of this alpha’s words. </em>\n</p>\n<p>\n<em>What a lie he had said.</em>\n</p>\n<p>\n<em> </em>\n</p>\n<p>\n<em> </em>\n</p>\n<p> </p>\n<p> </p>\n<p>Jimin blinked up at Hoseok, perhaps the only beta in the pack that was friendly to him by choice, and tried to ignore the tightness of his throat and the guilt swirling in his stomach, hands shaking from the aftershocks.</p>\n<p>“Are you alright, Jimin?” Hoseok asked quietly, smile so warm. He was honestly a beauty – Jimin had thought this the very second he laid eyes on the beta – and nice. They didn’t interact much, and in the beginning Hoseok had not instantly been his friend, but he had never been unkind like the others.</p>\n<p>Jimin nodded, supressing the whimper clawing up his chest, and the hot tears of shame gathering in his eyes.</p>\n<p>“You should go see him. He’s worried about you, tried to leave the bed the second he got stitched up.” Hoseok gave a small chuckle.</p>\n<p>Jimin wanted to sink into the ground. He was such a burden – he knew it had been a bad idea. He was a terrible hunter. He wanted to prove himself and went after an elk by himself, but he wasn’t familiar with the hunting grounds and ended up going onto snowy terrain, slipped and stumbled down a small slope, rocks digging into his fur, awkwardly landing on a paw. Jungkook helped him up and supported him to a safer ground, but in the process got a deep wound down his side.</p>\n<p>Jimin’s possibly sprained hand was bandaged and resting on his knee, but the throbbing pain was nothing compared to how he felt when he saw all the blood down Jungkook’s thick coat. It didn’t seem too big at first, but then he made the mistake of shifting back into his human form and it tore the wound wider. Jungkook’s face had been twisted in pain, and Jimin wished he had cursed out and lashed at him in anger – instead all Jungkook cared about was him.</p>\n<p>Jimin swallowed and glanced away, staring at the twisted blankets at his feet, feeling small on the bed of rugs in their hut. The absence of Jungkook was suffocating.</p>\n<p>“Jimin…” Hoseok crouched down, voice soft. “He’s not mad.”</p>\n<p>\n<em>That’s the problem. He’s never mad. He’s too… too kind to me. Why is he so kind?</em>\n</p>\n<p> Jimin pressed his lips together as the uneasy feelings of embarrassment pooled up again. Jungkook surely would have liked a mate who could hunt, right? That was the train of thought that had Jimin volunteering to assist the alphas on their winter hunt – they needed more help due to prey being harder to find because of the cold. Jimin had foolishly wanted to prove himself, after all, Jungkook did so much for him. Since Jimin came back, Jungkook’s been looking after him, tending to his beck and call. He indulged Jimin in sweet, late night conversations, tried his hardest to make Jimin feel comfortable within his circle of friends, smiled and joked with him as they cleaned and cooked, helped him find a small role looking after the pups in the pack.</p>\n<p>Still, Jimin didn’t know why he felt so unhappy. He thought maybe it was because of his inadequacy in the relationship. So he tried to change that desperately and it only made everything worse. Like usual.</p>\n<p>“Go see him, please. He looks hopeful every time someone goes into the room and then he’s disappointed when it’s not you.” Hoseok stood up, sounding upset too.</p>\n<p>Jimin cleared his throat, eyes downcast. “I don’t know what to say.”</p>\n<p>“You don’t have to say anything.”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Jimin stood in the small village hospital building. Other pack wolves passed him, some throwing him a dirty look for getting their valued, adored alpha injured, some of them just scoffed and pushed past him rudely. Jimin was used to that, and it made the regret burn hotter.</p>\n<p>He shouldn’t have come back.</p>\n<p>Jimin crept up to the room, the door just slightly open, breath hitching when he saw Jungkook lying on the bed, half his body propped up by numerous pillows. He was talking to someone, and Jimin followed his gaze down to –</p>\n<p>Euna.</p>\n<p>She was another omega in the pack. Very pretty. She was fast, but stealthy. Jimin should be more like her. Euna was rather neutral to him – not nice, but not mean either. Most of the time she ignored his presence, something Jimin was often thankful for. It was better than being ridiculed and gossiped about.</p>\n<p>Jimin gulped when he suddenly realised they were holding hands. Euna was sitting beside Jungkook, both hands holding one of his. Jungkook looked comfortable.</p>\n<p>\n<em>They’re just friends.</em>\n</p>\n<p>Jimin felt the jealousy swarm up, and all those rumours about Jungkook having another omega on the side. <em>He doesn’t. He said he doesn’t. </em>Jimin stepped back from the door, numb.</p>\n<p>He did the only thing he ever did when it became too much.</p>\n<p>He ran.</p>\n<p> </p>\n<p>\n<em> </em>\n</p>\n<p> </p>\n<p> </p>\n<p>Jimin couldn’t sleep that night, the bed feeling empty and cold. That barely bothered him, all he could think about was Jungkook finding a new mate – a better one. Maybe he always intended to, and bringing Jimin back was just duty. Jimin shook his head furiously as he brought the blanket higher, breathing in his alpha’s ginger scent. Jungkook wasn’t like that. Jungkook was so good to him.</p>\n<p>Swallowing his pride, Jimin got up, a blanket still pulled around his shoulders, and headed for the hospital again. A few pack members were still walking around, enjoying bonfires and social events that Jimin did not waste his time with. He wouldn’t subject himself to more glares and snide remarks by choice.</p>\n<p>His heart slammed into his chest again as he got to Jungkook’s room, suddenly feeling guilty. Jungkook could be sleeping.</p>\n<p>\n<em>I’m his mate, maybe he won’t mind.</em>\n</p>\n<p>Jimin bit his lip as he knocked softly on the door, waiting a few seconds before opening the door and stepping in.</p>\n<p>A candle was burning beside Jungkook, and the alpha was indeed asleep, though it seemed he may have been trying to keep himself awake by tying intricate knots with an old piece of rope that was resting on his lap.</p>\n<p>Jimin drank in the sight of Jungkook, sharp jawline and long lashes, soft lips and smooth cheeks. He often wondered if Jungkook was happy being with him, he did come searching for him after all. He’s never hit him, never even so much used his alpha voice on him. Jimin’s been beaten before - by his parents, other superior wolves in the Park pack, backhanded by an angry beta from the Kim pack before he was Jungkook’s mate. Jungkook’s nothing like any of them. He was sweet. He tried really hard to make Jimin comfortable.</p>\n<p>\n<em>Maybe it’s got nothing to do with Jungkook. Maybe it’s something about me. </em>\n</p>\n<p>Jimin held his face in his hands, throat clenching up.</p>\n<p>“Jimin?” Jimin’s head snapped up at Jungkook who was looking at him with worry, sleep ebbing away. “What’s wrong?”</p>\n<p>Jimin steeled himself and forced a wobbly smile. “Nothing.”</p>\n<p>Jungkook didn’t seem convinced but he didn’t push further, sometimes Jimin wished he would. He placed the rope, bulky with all sorts of patterned knots, aside and tilted his head. “Why are you so far away?”</p>\n<p>Jimin was still standing by the door, feet shuffling awkwardly.</p>\n<p>“Let me see your hand.” Jungkook placed out his own, palm up and inviting. Hands that had just been holding someone else.</p>\n<p>Jimin glanced down at his bandaged hand, bitter feelings forming. “It’s okay. There’s nothing to see.”</p>\n<p>Jungkook’s smile faltered. It looked like he might have been wanting something else - whatever it was, he didn’t say it. Instead, he sat up further. “At least come closer. I was worried about you.”</p>\n<p>Jimin walked nearer to the bed, awkward all of a sudden. His gaze landed on the bandage around his waist, pale pink seeping through layers of white. He felt awful. His was clumsy and stupid and got his mate hurt, as usual.</p>\n<p>“I’m sorry.” Jimin choked out as he sat down on the chair. “I-I shouldn’t have chased after the –”</p>\n<p>“Sh, Jimin, it’s fine.” Jungkook reached out to him.</p>\n<p>Jimin flinched. Jungkook withdrew.</p>\n<p>\n<em>He’d been holding another omega like this. </em>\n</p>\n<p>\n<em>No, no don’t think like that. Jungkook is loyal.</em>\n</p>\n<p>“Jimin?” Jungkook said quietly, hurt. “Talk to me.”</p>\n<p>Jimin shook his head as hot tears slipped out, shame and humiliation and regret crashing into him. He didn’t deserve Jungkook, and Jungkook didn’t deserve this.</p>\n<p>His alpha touched his cheek hesitantly. “What is it? Did someone say something to you?”</p>\n<p>“No – no, it’s nothing… I have to go.” Jimin stood up abruptly, pulling away from Jungkook.</p>\n<p>“Wait, Jimin, don’t.” Jungkook sat up and winced harshly, hand immediately going to his injured waist.</p>\n<p><em>Always inflicting pain.</em> Jimin gulped and his hands hovered uselessly over the bandage, heart hammering in his chest at the look of pain on his mate’s face. “S-Should I get the healer? Do you want some water? Is it bleeding again?”</p>\n<p>Jungkook reached for Jimin’s uninjured hand and gave a light tug. “Just sit down with me. Please.”</p>\n<p>“But your waist…” Jimin trailed off quietly as Jungkook shuffled over on the narrow bed and pulled back the covers for the omega to sit down, the blanket Jimin had brought was still wrapped around his shoulders. He sat carefully, body revelling in the warmth.</p>\n<p>“Is it still painful?” Jungkook asked as he took Jimin’s other hand, inspecting the bandages and lightly running his fingers along the edges.</p>\n<p>“No.” Jimin glanced down at the small contrasts of tan and pale skin, one calloused and the other with nervous bitten nails. “Thank you for… for always looking after me.”</p>\n<p>Jungkook smiled brightly, looking proud of himself. “Of course, you’re welcome.”</p>\n<p>\n<em>I just wish I could look after you too.</em>\n</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Jimin buried his chin into his scarf as he trudged back to the village with Hoseok and Seokjin. As always, the happy-go-lucky beta was nothing but friendly to him, and Seokjin, who was Alpha Namjoon’s mate, was very warm and accepting. Few other pack members were this kind towards Jimin, so he appreciated when they invited him to come berry and herb picking with them. Jimin had tried numerous times in the past to become closer with the other omegas but all they did was sneer and ignore him, purposely keeping him out of their circle of friends. No matter how many times it happened, it was always just as humiliating as the first. Jungkook had seen him once, excluded from the others, and Jimin felt so inadequate in the face of Jungkook with all his adoration from the pack.</p>\n<p>Jimin’s spent more days than he would like to admit crying over how marginalised he still was.</p>\n<p>The other Park pack members who had stayed with the Kims’ had integrated well – of course, met with the same hostility at first, but now melded in seamlessly. Others who hadn’t adjusted had left already, and Jimin should have, if he hadn’t accepted Jungkook’s mating offer. He had thought it would help his acceptance by the others, and that he finally had a chance to settle down and have the life he always wanted. A loyal mate by his side and a lovely community to live and raise pups in.</p>\n<p>And Jungkook was perfect, the perfect mate. So why didn’t Jimin feel happy? He shoved his gloved hands into his coat pockets. The weather was still cold but winter had drawn to an end. Jimin met the first day of spring with these two other wolves, his mate in the hospital.</p>\n<p>\n<em>If spring comes and you still want to go, I won’t stop you.</em>\n</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>“I’m worried about you.”</p>\n<p>Jimin was in the middle of rearranging the blankets of the bed when Jungkook spoke. His voice was careful, Jimin could tell he had paid extra attention to the tone of his voice, the emphasis of the words.</p>\n<p>“Why?” Jimin asked, not meeting his gaze.</p>\n<p>He was too aware of how Jungkook walked closer, a tentative hand on his lower back. Jimin usually liked the contact, he always found something reassuring in it, but now the touch made him feel on edge. “You seem more detached lately. You barely ever step foot outside. You don’t eat much.” Jungkook sighed as Jimin moved away from his side to go smooth out one of the corner of the bed. “And you keep crying. No matter what I do, I can’t seem to make you stop.”</p>\n<p>Jimin faltered, his actions stilling. He had been trying to hide the tears from Jungkook.</p>\n<p>“Do you hate me for bringing you back?” Jungkook said quietly, voice shaking just the slightest and it was enough to make Jimin’s stomach twist. He hadn’t considered to what extent his evasiveness could be affecting Jungkook. He wondered, maybe, all the sadness Jimin felt Jungkook felt too in the form of guilt.</p>\n<p>Jimin glanced up to make eye contact for a second before he cowered. “I don’t hate you.” How could he hate someone who had only ever treated him with kindness? Running away had felt like freedom at first, but when Jungkook came searching for him, it had felt like belonging. But returning here, to a pack that despite Jimin’s efforts for friendship were adamant to change, he felt more like a stranger than ever.</p>\n<p>“But you don’t love me.” Jungkook countered. It wasn’t accusatory or bitter, spoken more like a sad conclusion, a fact he hadn’t wanted to admit. “You don’t like to touch me, half the time you don’t even look at me.”</p>\n<p>Jimin felt remorseful. Jungkook shouldn’t have to suffer the way Jimin did. It wasn’t that he didn’t like Jungkook’s company, honestly he loved it a lot, but he felt overwhelmed often – he felt too much. “This isn’t about you.”</p>\n<p>Jungkook flinched from his words, taken aback by his response. “What does that mean?”</p>\n<p>“It means…” Jimin sat down forlornly on the bed, staring down at his lap, “I <em>am</em> happy when I’m with you.” The happiest Jimin has probably ever been, the greatest happiest he’s ever known. He has a mate who looks after him despite all of Jimin’s shortcomings. Jungkook, on the other hand, was so easy to love – sweet and gentle and brave.</p>\n<p>“But?”</p>\n<p>Jimin swallowed and fidgeted. His omega side was in pain, the bond between them stung. He forced the words past his lips. “You know I can’t stay here.”</p>\n<p>Jungkook glanced away from him, eyebrows furrowing and mouth turning down, strained. He walked a few steps away and Jimin could see the tension in his shoulders. He felt an ache in the bite mark at his neck, the devastation his words have called within his beautiful alpha.</p>\n<p>“I don’t understand.” Jungkook choked out, eyes rimmed with red. “If things are good between us… what – why? Why do you want to leave?”</p>\n<p>It wasn’t fair on Jungkook, it really wasn’t. Jimin was being selfish and cruel. Jungkook had been nothing but lovely and patient, looking after him the way Jimin has always wanted someone to. In the beginning, there had been a lack of attention and acknowledgement from Jungkook, but since Jimin had tried to leave that had never been the case again.</p>\n<p>“I just can’t stay here anymore, regardless of you.” Jimin whispered. He knew he must seem so brutal, running from this pack and his mate for a second time. But, was it so bad of him to finally say he’d had enough? His first pack were awful in that they prided alphas and looked down harshly on omegas. Then this new pack, made him feel like he was a dirty whore and had ruined Jungkook. Was it strength to keep putting up with it, to try so hard to change their set opinion of him; wasn’t it stronger to get himself out of this environment? He felt like nothing, and Jungkook was everything.</p>\n<p> “But Jimin –”</p>\n<p>“I’m not accepted here. I feel so isolated. And even when I’m with you I feel so… unworthy.” Jimin cut him off, face in his hands. “All I do is hurt you.”</p>\n<p>“That’s not true.” Jungkook said, sounding almost angry. “There are other things you do and you are that mean more to me than your ability to hunt or whatever, I don’t care about – ”</p>\n<p>“But <em>I </em>do and that’s the difference.” Jimin cut in pleadingly. </p>\n<p>Jungkook lowered his head, appearing dejected. “The pack will come around.” He tried again gently.</p>\n<p>Jimin resisted the urge to scoff because he didn’t want to insult Jungkook, who loved his pack very much. But that was the thing – it was <em>his </em>pack, not Jimin’s, and it seemed impossible that it ever would be. Social network was important for wolves and Jimin had very rarely had that since pledging loyalty to alpha Namjoon, it was only a matter of time before his omega caved in to the darkness beckoning him. “They won’t. If they’d wanted to they would have… would have tried to include me. They wouldn’t belittle me and ignore me.”</p>\n<p>There was a new tension in the air that formed between them – a more insufferable one. “Your pack liked to taunt us, cause havoc and steal our resources, you can’t expect them to have warmed up to you instantly.” Jungkook didn’t raise his voice but this time his tone certainly had bite to it.</p>\n<p>Jimin felt his omega raise his hackles, defensive. “Your pack did the <em>exact </em>same to us. You invaded and slaughtered our people –”</p>\n<p>“Because your alpha almost raped one of our betas.” Jungkook snapped back and Jimin felt like a bucket of icy water had been thrown in his face.</p>\n<p>\n<em>Your alpha.</em>\n</p>\n<p>Jungkook had never addressed him like that.</p>\n<p>Jimin felt manipulated and dirty and everything that he had been called by the other omegas. His temper should have snapped – he wanted to scream that they never mated, that he had been bargained off by his parents to an alpha with countless affairs and almost three times his age. Jimin had just presented, just had his first heat, and he was sick to his stomach when he had been cleaned and dressed prettily for his mating ceremony. He was so revolted when the alpha touched him, kissed him, and he had been praying for someone to save him when the alpha drunkenly stumbled into his lavish dwelling, ready to take Jimin as his new mate.</p>\n<p>Jungkook was supposed to be different – he <em>was </em>different. He asked Jimin’s permission to kiss him, didn’t let his hands stray to places that made him uncomfortable. During their mating he had been patient and lovely, checking that he was okay, that he wasn’t scared or nervous. Jungkook was unlike anyone Jimin had ever met. Until this moment.</p>\n<p>Jimin wanted to argue back, but it felt pointless now. He let the burn of those words race through him, numbing his body. His shoulders sagged and he curled in on himself, instinctively shielding away like he had when they first met.</p>\n<p>Jungkook had turned pale and he looked shattered. “I-I didn’t mean that. I’m so sorry. Jimin – I don’t…” He stopped and he seemed so distraught Jimin wanted to ease him. “I’m sorry.”</p>\n<p>“It doesn’t matter.” Jimin replied. He didn’t want to talk about this anymore, he was so sick of being reminded of the past. There was so much he wanted to forget.</p>\n<p>“It <em>does. </em>You’re my mate, that was wrong of me to say that.” Jungkook insisted, eyes shining.</p>\n<p>Jimin remained silent.</p>\n<p>Jungkook walked closer, and hesitated before continuing. “It’s just… what if you move to a new pack and you don’t feel any happier there either?”</p>\n<p>There were unspoken words weaved into there – the futility of it, the pain he’d cause in its wake.</p>\n<p>Jimin didn’t know how to answer a question like that. It was a very possible scenario. Maybe the problem wasn’t the pack, it was Jimin. Maybe there was something wrong with him.</p>\n<p>“Jimin – please. Please talk to me. I’m so worried about you.” Jungkook pleaded and dropped down to his knees to cup Jimin’s face, looking up at him. “Tell me how I can help you.”</p>\n<p>Jimin was on the verge of tears again. Jungkook was right – he was crying a lot lately, and most of the time he didn’t even know why. “I just <em>need</em> to… to leave.” Jungkook’s expression crumbled miserably. “I’m sorry.”</p>\n<p>“No, I promised you.” Jungkook said, drawing back and Jimin missed the warmth of his hands on his face. “I said when winter ended and it has. I…I  have to let Namjoon know.” He stood up slowly, hair falling over his eyes. “We’ll leave in a few days.”</p>\n<p>He walked out, leaving Jimin with the most hollow sensation in his chest, like a part of him had just been ripped out. He supposed that wasn’t far from the truth. Jimin fell back onto the bed and reached for a blanket, nuzzling into Jungkook’s scent. It soothed his ragged breaths as he stared at the wall, feeling more confused and lost than ever.</p>\n<p>But, at least, a part of him was glad to be able to leave. He felt like a weight had been lifted off of his shoulders and he now had the chance to hope again. The other part of him, however, wanted to cling to Jungkook with every fibre of his being.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Jimin was sitting on the ground, absentmindedly braiding strands of grass as a young pup sat beside him. A chubby hand rested on his knee as the little girl, Suyoun, leaned over, fascinated by Jimin’s actions.</p>\n<p>“Here you go.” Jimin smiled brightly as he placed the finished flower crown upon her head. Her small curls framed her face as she squealed with delight.</p>\n<p>Jimin felt a longing ache in his chest. He wished he could have a child too, one day. But if he was to have a child he wanted to be able to raise them in a good place, with a good mate, where they would be treasured and loved. He wondered if Jungkook ever wanted pups. He brushed off the thought – there was no point dwelling on possibilities that he had now buried. Besides, he could never raise a child here – they’d be ostracised and ridiculed, would have to carry the same burden Jimin did. An innocent child didn’t deserve that.</p>\n<p>“Oppa – flower!” She grinned, deep dimples in her cheeks. She picked up a fallen flower, still nicely bloomed though a slight brown on the tip of one petal, and tried to tuck it behind Jimin’s ear.</p>\n<p>Jimin helped her place it securely before taking her hand. “Thank you, Suyoun-ah.”</p>\n<p>She giggled before walking a few steps back, touching her crown. Then she raised her arms suddenly, facing in a different direction. “Appa!”</p>\n<p>Jimin glanced towards the approaching alpha, recognising him to be Jisung. He had never interacted with him before. He was very tall with shoulder length hair and intimidating slanted eyes.</p>\n<p>Jisung swept Suyoun up and kissed her cheek like a father who loves his daughter does. “Hey, angel. What have you got on your head?”  </p>\n<p>Suyoun squealed. “Oppa made it for me!”</p>\n<p>Jisung noticed Jimin and his smile tensed. “I see.” He placed her down and gave her a small nudge back to the main area of the village. “I’ll be right behind you. See if you can spot mommy on the way home.” She nodded and took off, short legs not taking her very far. Jisung turned to Jimin and gave him a hard glare. “Please don’t talk to my child.”</p>\n<p>Jimin felt like he had been knocked to the ground and pinned there. “I-I’m sorry.”</p>\n<p>Jisung clenched his jaw before he hurried off after his daughter.</p>\n<p>Jimin felt the sob clawing its way up his throat. No matter what he did it would be like this. He would always be an outsider to them.</p>\n<p>As he was walking back, he stopped as he noticed a familiar figure and… Euna. They were smiling at each other, Jungkook was laughing freely. Jimin felt a wave of jealousy, unable to suppress it anymore.</p>\n<p>\n<em>He needs a mate to keep his rank in the pack. </em>\n</p>\n<p>Jimin felt his heart in free fall as the ground was teared out from under him. That was the whole reason he had wanted to mate with Jimin in the first place – not attraction, not desire, certainly not love. It shouldn’t matter, Jimin was choosing to leave him, after all. It still hurt though, a pain that crippled through his whole body. To see it with his own eyes, seeking a new mate whilst he still had one. Just like Jimin’s previous pack’s alpha.</p>\n<p>The very resemblance made him sick.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>That ugly feeling was still coursing through his veins when Jimin arrived back at the hut later that day, the sun disappearing behind the mountains. Jungkook was at the fire, igniting the embers, bringing it back to life. When he saw Jimin, he tensed but managed a sweet smile. Despite the awkwardness between them, the alpha had still been kind to him each day. Jungkook was good-hearted after all, hurting Jimin was always unintentional.</p>\n<p>“Hey, where have you been?” Jungkook sat back as the fire began to lick up the new blocks of wood he had placed.</p>\n<p>“Just looking after the pups again.” Jimin shrugged off his coat and went to sit down near Jungkook, the distance between them taunting him. There hadn’t been this distance between him and Euna. The mention of pups had his mind reeling again, his emotions scattered all over the place. That disdain on Jisung’s face – Jimin didn’t know what he had done. <em>They </em>were the ones who came and invaded his pack, they practically made Jimin a prisoner, but still it was <em>him </em>in the wrong.</p>\n<p>Jungkook’s lips twitched at the corners, eyes looking so doting – like how Jimin’s dreamt of being looked at like. He stared into the fire before glancing at Jimin, something in his gaze that held so much, held back even more. His shadow of a smile faded. “Why do you look at me like that?”</p>\n<p>Jimin’s eyes widened at his hurt tone. “Like what?”</p>\n<p>“Like…” Jungkook furrowed his eyebrows, looking down, “like every second with me I’m breaking your heart.”</p>\n<p>Jimin was frozen by those icy words spoken with so much pain. <em>Did</em> he look at Jungkook like that? “I’m sorry.”</p>\n<p>“You don’t have to apologise.” Jungkook distracted himself by tending to the fire again. “I brought this on myself.” There was regret in his voice, Jimin’s heard that before. It was funny how Jungkook blamed himself when Jimin could have said no. Should have said no.</p>\n<p>“Was it really that important to you? To be a high ranked alpha in the pack?” Jimin asked tentatively.</p>\n<p>Jungkook didn’t look at him after his question, but he had wanted to. “I suppose so.”</p>\n<p>That was expected even if the admittance was disappointing, Jungkook was ambitious and competitive, but he could have chosen anyone and he chose Jimin – the lowest of the low. It was almost mockery, that anytime anyone saw Jimin they saw his mate and how drastically different they were in every aspect, wondered why an alpha of that calibre ended up with an omega of such little capacity.</p>\n<p>“What happens to that when I leave?” Jimin whispered softly.</p>\n<p>“I have to find a new mate eventually.” Jungkook shifted uncomfortably, a hint of a scowl on his face.</p>\n<p>Jimin clenched and unclenched his hands. So he had assumed correctly after all. “I understand if you want to be with Euna. She’s perfect for you.” If he had ever felt like his heart was breaking, it was now.</p>\n<p>Jungkook’s expression crumpled. “Why are you so quick to disregard me? Why are you so willing to give me up when… when I’ve fought for you every way I can?”</p>\n<p>There were tears in Jungkook’s eyes. This was the first time Jimin had ever seen him cry. His omega was in anguish, and Jimin in agony. Raw, undulating pain seeped through their bond.</p>\n<p>“Don’t you want to be with her?” Jimin says, throat choking up</p>\n<p>“I want to be with <em>you</em>.” Jungkook stood up hastily, wiping his cheek with the back of his hand roughly. “How many times do I have to say that? I’ve tried everything, but… no matter what I do or say, it feels like – like you’re never going to be <em>mine.</em>”</p>\n<p>Jimin stared up at him, battered soul laid bare.</p>\n<p>Jungkook’s eyes were bloodshot red, the alpha in him finally breaking. “Do you know how much I want to kiss you all the time, how badly I want to see you smile and have to hold myself back from just –” he cut himself off with another sharp intake of breath, hand pressed against his forehead.</p>\n<p>Jimin stared at the rugs, soft against his skin but he barely felt their comfort. He was stuck in this push and pull again, this constant, never-ending ambivalence. He wanted to be with Jungkook, but that wasn’t enough. He wanted more in life, expected more from himself, too.</p>\n<p>Jungkook dropped his hand away, crestfallen. “You’re my mate, I just want to look after you.”</p>\n<p>Jimin ducked his head, the words leaving a pleasant feeling in his stomach, but it resided with that apprehensiveness. He didn’t feel like he belonged in this pack, and Jungkook didn’t feel like Jimin belonged to him.</p>\n<p>“This isn’t your fault.” Jimin said quietly, sniffling. “It’s difficult for me to show and receive affection.” Since he was a child he was raised with scorn, with disappointment and punishments. He was not used to the thoughtful words and actions Jungkook showered him with, and as much as he craved it there was an inability to accept and reciprocate it.</p>\n<p>“Why can’t you believe me?” Jungkook ran a hand through his hair.</p>\n<p>Jimin swallowed the lump in his throat. Jungkook was right - Jimin was willing to see the worst in every situation, sometimes he even wanted to just so he could be <em>right, </em>that maybe this feeling of fearfulness would finally stop. “I… I guess there is a part of me that still doesn’t trust you.”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>It was the day they planned to leave. Jimin laid in bed feeling relieved and yet conflicted. He pulled the covers up to his chin, not wanting to get out.</p>\n<p>Jungkook had already left the bed by the time Jimin woke up. His absence wasn’t exactly unusual, but it dawned on him that this is how he would wake up from now on – alone, and without a mate. The chances of him mating again were minimal, and with that his future raising his own pups gone. But even if he stayed here, he would never want to have pups to this sort of pack.</p>\n<p>He heard footsteps enter and the calming scent of his alpha welcomed back into the air. He would not be his alpha after this.</p>\n<p>“Jimin?” He stood at the end of the bed. “Oh, you are awake. We should probably head off soon.”</p>\n<p>Jimin nodded but curled up further under the covers, feeling so detached from the outside world. From everyone, even himself.</p>\n<p>“Hey...” Jungkook walked closer and placed a hand on his back, pressure nice even through the layers of their blankets. He looked like he was struggling too. “I thought… you would be excited to leave.”</p>\n<p>Jimin took a deep breath and then a shaky one out. He <em>was </em>eager to go to a pack where no one knew him, a fresh start and a clean slate. He bit his lip and stared at the threads of the pillow. “I am, but…”</p>\n<p>Jungkook crouched down so he was eye-level with Jimin, gaze so sweet and worried even after Jimin’s hurt him in all the ways possible. “What’s wrong?”</p>\n<p>Jimin’s chest was squeezing, too tight for his heart. “I don’t want to leave you.”</p>\n<p>His alpha moved his hand up to Jimin’s cheek, expression pained. “Then don’t.”</p>\n<p>\n<em>But I have to, and that’s what you don’t understand.</em>\n</p>\n<p>Jimin sat up, moving away from his touch, and slid off the bed wordlessly. He got changed and packed the leftover needed supplies. Jungkook was incredibly resourceful so he had significantly less to worry about than the last time he attempted to leave.</p>\n<p>Today he was getting out for real, and he was never coming back.</p>\n<p>Jimin was just reaching for his jacket when he felt Jungkook’s arms wrap around him, his mouth at the curve of his neck and scenting him desperately. Jimin sank back into his embrace without meaning to. This could be the last time he'd be held like this/</p>\n<p>“Why don’t you ask me to go with you? Why don’t you ask me if I would leave this pack?” Jungkook asked, voice raspy, \"because I would leave for you, if you wanted me to, I would.\"</p>\n<p>Desire and need and love slammed into Jimin from those words. “But you love this pack – t-this is your home.”</p>\n<p>“But you're my mate and you come first.” Jungkook nosed over their mating mark and Jimin went lax in his hold. It was what everyone wanted – to be held like this, needed like this. “I’ll give up my rank. If you can't stay here, then let me go with you.”</p>\n<p>Jimin turned around to face him properly, omega side of him swooning and begging for Jimin to accept the proposal. “But Jungkook –”</p>\n<p>Jungkook kissed him before he could grasp what was going on, hands firm on his hips, body pressed right up against each other. Jimin felt so complete, that hollowness within him gone. Jungkook wasn’t gentle with the kiss like he had been in the past – this one was hot and desperate and dominant and had Jimin breathless and his heart racing. Jimin had always admired Jungkook’s control, but this was his alpha with his inhibitions broken free – ravenous and wanting.</p>\n<p>It was almost like coming full circle – Jungkook giving up the rank which he had used Jimin for to obtain. </p>\n<p>Jungkook tugged on Jimin’s bottom lip and chased his lips when Jimin drew back, lungs burning for oxygen, not wanting to be without him. “I don't want to lose you.”</p>\n<p>Jimin cupped Jungkook's face and leaned back in. \"You won't.\"</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>\n<em>Epilogue</em>\n</p>\n<p>Jimin sighed quietly as he watched snow falling outside their window, and then occasionally to the dying flames in the fireplace. His head was resting on his hands which lay over the hard plane of his mate’s chest, enjoying the steady rise and fall with his breaths.</p>\n<p>There was a slightly withered flower in their vase beside the bed, probably the last to bloom before this winter started; it was always colder in the mountains, colder than any winters either of them had experienced before. But this winter, Jimin was surrounded by nothing but warmth.</p>\n<p>When he saw snow, it was always accompanied by a strange nostalgia. He thought of shivering nights and lonely days sitting by the fire, shut indoors and not wanting to go out because of the coldness that would greet him irrespective of the weather. Somehow, though, it was bittersweet. Not that Jimin ever wanted to return to those years, but he marvelled at how the Jimin then would never have imagined the kind of mate who would find him, the future waiting for him.</p>\n<p>Overcome with a surge of affection, Jimin tilted his head and kissed along the collarbone of the alpha. He saved him from his the Park clan’s alpha, saved his life, saved him from the self-destruction he was spiralling into. Jimin adored him more than his body could contain.</p>\n<p>His mate’s response was more exasperated than doting, however. “Sleep, love.”</p>\n<p>Jimin felt his lips tug into a smile. “I’m trying.”</p>\n<p>He grunted in disbelief, eyes remaining closed.</p>\n<p>Jimin traced over the outline of his arm muscles. “Jungkook?”</p>\n<p>Another huff. “Yes?”</p>\n<p>“Are you excited?” Jimin lifted his head and Jungkook felt the movement, finally opening his eyes to gaze down at Jimin. His annoyance melted away and was replaced with a gentle smile.</p>\n<p>“Of course I am.” Jungkook smoothed his hand down Jimin’s back, fingers dipping into his curves.</p>\n<p>Jimin nestled into the crook of Jungkook’s neck, nose against his scent glands, something within him soothed and eased. Jungkook moved his hand to Jimin’s stomach, stroking the skin with his thumb, the act so sweet and protective and often Jimin was afraid something would snatch this happiness away. He was getting better at dealing with that though, each day it was a little easier.</p>\n<p>“I love you, but go to sleep.” Jungkook said, suppressing a yawn, hand resting still over his slightly swollen stomach.</p>\n<p>Jimin took one last look at the falling snow and closed his eyes. He wished there was a way to tell his past self that one day it would be enough - the failed attempts to please everyone, the painstaking slow process of allowing Jungkook into his worst thoughts and fears, the timid efforts to return affection. And he himself, he was enough too.</p>\n<p>He’d like to tell himself those lonely days wouldn’t shape his whole life, that the marking on his neck nor the words spoken behind his back didn’t define who he was. </p>\n<p>But in the end he couldn't, so he focussed on what he <em>could</em> say to the important people currently in his life, to himself now, and to Jungkook - so he knew his efforts to please Jimin, his never-ending devotion, his unconditional kindness - had never been in vain.</p>\n<p>\"I love you too.\" </p>"
}