{
  "id": "13148322",
  "url": "https://archiveofourown.org/works/13148322?view_full_work=true",
  "author": [
    "TheSovereigntyofReality"
  ],
  "title": "Mutantkind",
  "rating": "General Audiences",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings",
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "The Avengers (Marvel Movies)",
    "X-Men - All Media Types"
  ],
  "relationships": [
    "Pepper Potts & Tony Stark",
    "James \"Rhodey\" Rhodes & Tony Stark",
    "Logan (X-Men) & Tony Stark",
    "Tony Stark & Avengers Team",
    "Tony Stark & Vision",
    "Happy Hogan & Tony Stark",
    "Peter Parker & Tony Stark"
  ],
  "characters": [
    "Tony Stark",
    "Logan (X-Men)",
    "Steve Rogers",
    "James \"Bucky\" Barnes",
    "James \"Rhodey\" Rhodes",
    "Vision (Marvel)",
    "Sam Wilson (Marvel)",
    "Scott Lang",
    "Clint Barton",
    "Wanda Maximoff",
    "Natasha Romanov (Marvel)",
    "Pepper Potts",
    "Harold \"Happy\" Hogan",
    "Peter Parker",
    "Charles Xavier"
  ],
  "additional_tags": [
    "Crossover",
    "random idea",
    "Logan kicks Cap's arse",
    "I make a lot of these",
    "Derived from the comics",
    "Mutants get involved in the Accords",
    "Pro-Accords",
    "Not Steve Friendly",
    "not team Cap friendly",
    "Civil War Team Iron Man",
    "Alternate Universe - Canon Divergence"
  ],
  "language": "English",
  "series": "",
  "published": "2017-12-25",
  "completed": "2018-01-01",
  "words": "14,631",
  "chapters": "8/8",
  "comments": "630",
  "kudos": "14,712",
  "bookmarks": "4,208",
  "hits": "212,905",
  "summary": "<p>Logan is present in Siberia when the fight breaks out. He sees everything and has one thought.</p>\n<p> </p>\n<p> <em>This dickhead needs his ass kicked.</em></p>\n<p>Time to clean up the mess.</p>\n<p>Tony learns about his unexpected ally.</p>\n<p>A bit of exposition is in order after everyone returns home.</p>\n<p>Logan takes a look at the Accords.</p>\n<p>Logan goes after the Black Widow.</p>\n<p>Professor X and Beast come to the Tower.</p>\n<p>Professor X, Logan, Beast, and Storm go to confront the Rogue Avengers.</p>\n<p>Time for the Rogue Avengers to learn the human cost of their actions.</p>\n<p>All the loose ends are tied up.</p>",
  "notes": "<p>\n<em>\n<strong>Disclaimer: If you recognise it from somewhere else, it isn't mine.</strong>\n</em>\n</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">more notes</a>.)\n</p>\n<p>In the comics, Steve and Bucky ran into Logan during WWII. They didn't realise he had a healing factor and so nicknamed him \"Lucky James\".</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>I know Logan's summary is long for a man who only says what he needs to say, but I wanted him to illustrate the point of the ridiculousness of Zemo's plan. XP</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>For the weight of Logan's adamantium skeleton, I'll have to reference Gnoggin's video: What If You Had Wolverine's Skeleton.</p>\n<p>https://www.youtube.com/watch?v=CzcxsnKLLEg</p>\n<p>Also, I went for 160 years, because I liked that \"Civil to Vietnam\" line.</p>\n<p>Okay, I'm in Australia. It's about 8 in the morning of the 1st of January, 2018. So...Happy New Year!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_8_endnotes\">notes</a>.)\n</p>\n<p>Well, that's it for this one. I won't be making a sequel but if you want to see history rewritten so Team!Cap and co will never get any hold over Tony, and read my Christmas pressie fic, you can head over here to the first story of my The Holmes Estate which starts with the story A Christmas Carol.</p>\n<p>http://archiveofourown.org/works/12836346/chapters/29308863</p>",
  "text": "<p>The bullet woke him up.</p>\n<p>The bullet was a high-calibre ballistic type. It penetrated thick ice and then bounced off the adamantium over the bridge of his nose. Had that just been bone, it would have gone right into the brain. It was enough to pull him out of his dormant state. The first thing Logan noticed, as he extracted himself from the ice, was that his memories were all back. He supposed it was down to his body being dormant for so long, so it finally could devote energy to whatever in his brain had caused the amnesia.</p>\n<p>Logan didn’t need to look very far to find who had shot him – and the four other guys. They were actually dead. The asshole seemed to be setting up for something. Logan could have pinned him and demanded answers, but he was curious. So, like the predator that was his namesake, Logan sat and waited. His healing factor starved off the freezing of his body in the sub-zero temperatures. The guy who’d shot him sat there and listened to a woman’s voicemail. The woman who’d made it was most likely dead and this was probably a revenge kick.</p>\n<p>When they finally arrived, Logan was startled to see the old Walking Flag and his Sergeant babysitter and Tony Stark in some kind of power suit. He must’ve missed a fair bit, because that was not the kid he’d occasionally seen in the media – the kid who suddenly had too much responsibility and didn’t know how to deal with it. This was a man, putting aside his differences with Rogers, which one often had to do, in order to fight some kind of threat.</p>\n<p>When they found the guy – Zemo, apparently – it was clear what had happened. This was a very elaborate trap for Rogers and Stark. Something about tearing the Avengers apart, whatever that was about. The conversation and the situation in the room made it easy for Logan to fill in a lot of the gaps.</p>\n<p>Then the video was played.</p>\n<p>Logan had heard that Howard Stark had crashed his car, killing both himself and his wife and leaving their teenaged son an orphan. That was not what happened in this video tape though. No, what Logan saw was a set-up assassination. Apparently what these fuckers had tried to do to him, they had done to the Sergeant.</p>\n<p>Logan had never been close to his parents – could barely remember them in fact. But Stark hadn’t been. In fact, he’d been a typical baseline human teenager. He had lost his parents at an age where he wasn’t ready to be on his own. Now, years later, he was learning that he had not merely lost them. They had been <em>taken</em> from him...by a man standing just a few feet away from him.</p>\n<p>The instant the video finished, Stark’s eyes turned to Barnes. Cap’s face was concerned, but not surprised. He’d clearly already known. Stark took a step towards Barnes. Cap grabbed his arm. ‘Tony, it wasn’t him!’ he insisted.</p>\n<p>The hell it wasn’t! Maybe he’d been brainwashed; hadn’t known what he was doing. Maybe, but it was still the hands of Sergeant James Barnes which had bashed Howard Stark’s face in and squeezed the throat of Maria Stark shut until she was dead. Diminished capacity did not absolve a man of murder.</p>\n<p>‘Did you know?’ Stark demanded, voice tight.</p>\n<p>‘I didn’t know it was him.’ The chemical change in Cap told Logan the truth. His claws pulsated under his skin, just about begging to pop and tear into that dick.</p>\n<p>Stark knew it was a lie too. ‘Don’t bullshit me, Rogers! Did you know?’</p>\n<p>‘Yes.’</p>\n<p>Stark staggered back a step. Betrayal. It was something that Logan had become acquainted with early in life. As a small boy, back when his powers first manifested, many con artists and other assorted criminals had deemed him useful and systematically betrayed him. As a billionaire, though, Stark would taste betrayal over a longer period of time. People would use him for years and years before they stabbed him in the back.</p>\n<p>That was why a man in his forties of Stark’s money and power looked so shocked – that and he’d likely been raised on the legend of Captain America and hadn’t thought this kind of thing in him.</p>\n<p>Stark jammed his eyes shut for a moment, and then he snapped. He swung his fist. The power-suit must’ve been pretty impressive. (Well, of course it was. A Stark built it.) Rogers went flying. Barnes turned his gun on Stark. Logan growled as the fight broke out. He wasn’t sure how much of his marbles Barnes still had, but fighting Stark at this moment was not the best thing to do. And Rogers’ dickhead remarks didn’t help.</p>\n<p><em>‘Leave him alone, Tony. He was forced to kill them.’</em> As if Stark was capable of calming down now when all Rogers had done was escalate the situation.</p>\n<p><em>‘You know I wouldn’t do this if I had another choice.’</em> Idiot. He had another choice. He could have told Stark in a controlled environment and this wouldn’t have happened. It wouldn’t have been news to Stark.</p>\n<p>And the best of the bunch. <em>‘I could do this all day.’</em></p>\n<p>There was a point in the end when Logan had enough. He’d never liked Rogers. He was a stupid boy trying to play hero in the middle of a war. Now, he was about to take the head off of the son of the man who had given him all his toys. He was about to kill a grieving man who he had lied to for years. Logan didn’t know about Stark – had always kind of pitied him to be honest – but one thing did cross his mind here.</p>\n<p>\n<em>This dickhead needs his ass kicked.</em>\n</p>\n<p>Logan leapt in, moving at top speed. With one hand, he snatched the shield out of Rogers’ hand. With the other, he threw a hard punch into Rogers’ jaw. He heard the distinctive crack of the bone. That would shut him up with some luck but it was only a fracture. Logan landed over Stark in a crouch. He tossed the shield at a wall, imbedding it into the concrete.</p>\n<p>The billionaire looked up at him surprised, but he remained where he was. He panted for air, relief and fear seeping out of his pores. Logan could hear the blood rushing in places it really shouldn’t be. <em>Internal bleeding.</em> Rogers staggered to his feet. A nice bruise was already forming on his jaw.</p>\n<p>‘Who are you?’ he demanded.</p>\n<p>‘I might be hurt at that if I gave a shit about you,’ Logan said.</p>\n<p>Rogers grabbed his buddy’s rifle from the ground. He let off the rounds. Logan shifted. The bullets pelted at him but bounced off his skeleton. Some of them went into his flesh, and were instantly pushed out by his healing factor. As they dropped, Stark turned his head.</p>\n<p>Rogers stared in disbelief. Of course all he could see was the healing of the tears in Logan’s skin. Logan just stood there and let him observe the skin knit and repair itself. Barnes, missing his metal arm from the fight with Stark, was staring at Logan’s face. Not the closing wounds like Rogers was, but his actual face. More likely than not, Barnes recognised Logan’s face but he couldn’t quite place where he knew it from.</p>\n<p>‘You finished?’ Logan asked.</p>\n<p>‘How...?’ Rogers began to ask.</p>\n<p><em>SNIKT!</em> Logan flicked his claws out.</p>\n<p>Rogers started. He cleared his throat. ‘Sir, there’s a lot happening here you don’t understand.’</p>\n<p>Logan smirked and cocked an eyebrow. Yup, that was him. Thought he knew it all and looked down on anyone who didn’t agree with him and follow him like a loyal dog. He wasn’t even going to dignify that with a response. Logan shot forward again. First he sliced apart the gun in Rogers’ hand. Within a millisecond, he aimed and stabbed the Walking Flag in the gut. Rogers hacked, spitting blood, and fell back.</p>\n<p>Logan heard Barnes before he was there. The one-armed man grabbed a nearby stray pipe and swung it at Logan’s head. Logan just lifted his claws and the pipe was cut into three pieces. With a quick slash down, Logan retracted one set of claws and punched Barnes into a wall. The guy’s body impacted, leaving a sizeable dent, and he dropped to the floor. Blood pooled around his leg and he didn’t get back up.</p>\n<p>Of course, he couldn’t even move his leg and he’d been in a mountain of pain.</p>\n<p>‘Bucky!’ Rogers charged at Logan again.</p>\n<p>Logan sidestepped and grabbed Rogers by the skull. He hoisted him up. Logan knew Rogers put a lot of value on his height. Towering over someone was the oldest intimidation tactic in the book, and it was a favourite of Rogers’. Logan had been on the receiving end back in the 40s, and Rogers had been quite annoyed that Logan hadn’t been intimidated. Had, in fact, laughed and walked away. Well, it had been quite amusing.</p>\n<p>Rogers was a weak individual. Despite the physical strength, his entire sense of self-worth came from being “special”. Logan could have always ripped that away – so easily – and he didn’t like the guy, but he’d cared more about the backlash of doing such a thing. Mutants, especially the kids, dealt with enough shit on a daily basis without adding this dickhead on top.</p>\n<p>Rogers started talking again. ‘You don’t realise what’s going on. You’re fighting on the wrong side.’ He continued nattering on, but Logan zoned out in favour of listening to Stark’s vitals.</p>\n<p>There were no sides here. There was a grieving man who had been beaten half to death by the killer of his parents and a pretentious asshole who thought he could decide who was guilty and who was innocent. Now Logan had to finish this so the poor bugger didn’t die. But he had the feeling Rogers wouldn’t stop talking.</p>\n<p>Logan retracted his other set of claws. Rogers began talking faster, obviously thinking he was “getting through to him”. It was getting on Logan’s nerves, to be honest. <em>THWACK-CRACK!</em> This time, Logan made sure his punch broke Rogers’ jaw. He also let go of Rogers’ skull on impact, sending the living propaganda piece flying across the bunker. He hit the ground and dragged across the snow.</p>\n<p>‘You talk too much.’ That said, Logan turned and walked towards Stark.</p>\n<p>Barnes gasped. ‘Lucky James,’ he whispered, finally placing where he knew Logan.</p>\n<p>\n<em>Oh, yeah. I said that in the 40s too, didn’t I?</em>\n</p>\n<p>Tony watched as his unexpected ally walk over and crouch down over him. The guy was wearing scrubs and didn’t appear to be wearing anything else. Rightfully, his fingers and toes should have been freezing off – tinged blue at the very least. Of course, he had been shot at wildly and was unharmed. Same thing could be working against the cold.</p>\n<p>Tony couldn’t deny he was curious about this guy who could beat the crap outta two super-soldiers. As the guy moved around him without a word, Tony considered it. Logically, he must’ve been a prisoner here. Like those other four Win...Wait a minute. Wilson had said there were five Winter Soldiers. Why had only four been visible? This guy wasn’t acting like a Winter Soldier – or at least what Tony had seen in Barnes.</p>\n<p>Tony heaved a sigh, which caused a spike of pain to shoot through his chest. He winced and swallowed. The other guy had brought Cap’s shield over and was currently using it as a fire pot as he dropped anything flammable that he could find into it. Well, the only way Tony was going to find anything out was by asking.</p>\n<p>‘How long have you been here?’</p>\n<p>The guy glanced up. ‘What year is it?’</p>\n<p>‘2016.’</p>\n<p>‘About 20 years.’</p>\n<p>20 years? That meant he’d missed a hell of a lot. Whatever was going on with him – probably some sort of a healing factor – may have even slowed down his ageing. After all, Barnes had recognised him. The name he’d used had seemed to familiar to...oh, crap. ‘What do I call you?’</p>\n<p>‘My name’s Logan.’ He lit a flint of some kind and threw it into the underside of the shield. A fire roared to life and Logan pushed it over to Tony. The heat was good. It’d keep him from getting frostbite and losing his fingers.</p>\n<p>‘So why did Barnes call you “Lucky James”?’ Tony asked.</p>\n<p>Logan’s lips quirked in amusement. ‘I first met Cap and his babysitter back in the War.’ No need to ask which one. Still, Tony would have snorted if he had the energy. Barnes was Cap’s <em>babysitter</em>? ‘Back then, I was going by James Howlett. They didn’t notice my healing factor and reckoned I just never got hit.’</p>\n<p>So they called him Lucky James.</p>\n<p>Logan suddenly turned his head, his nostrils flaring. ‘Someone else is here. I’ll be right back.’ He turned and strode out. Tony cocked an eyebrow. His first thought had been that Logan had been enhanced by HYDRA experiments. There was too much though. Healing factor, superhuman strength and speed, retractable metal claws between his knuckles, and now enhanced senses. On top of that, they apparently couldn’t brainwash him.</p>\n<p>Was it possible for someone to be <em>born</em> with powers?</p>\n<p>***</p>\n<p>T’Challa had secured Zemo and was heading down to find Rogers and Barnes. He had a debt to repay after hunting down the wrong man for so long. When he came to the entrance of the bunker, however, he was shocked to see an unfamiliar man step out. The man was not very tall, likely the result of stunted growth, he wore scrubs of some description, and had facial hair that travelled down his jaw and stopped as it reached his chin.</p>\n<p>Startled, T’Challa flicked his claws out. The man did the same, but his claws were wholly organic, as they seemed to be a part of his body despite the metal encasing them. They were also much longer and likely usually sat in his forearms. It startled T’Challa to be honest. He didn’t let it show on his face.</p>\n<p>‘Who are you?’ the man asked in English.</p>\n<p>‘I am King T’Challa of Wakanda,’ T’Challa stated. ‘Also known as the Black Panther.’</p>\n<p>‘Oh, you’re a long way from home,’ the man remarked.</p>\n<p>‘And who might you be?’ T’Challa demanded.</p>\n<p>‘The Wolverine.’</p>\n<p>T’Challa had never heard of a wolverine; he didn’t know what one was. All the same, he decided that enough blood had been shed. He retracted his claws. He watched the Wolverine do the same. However, the suspicion never left the other man’s eyes. Likely he’d been a prisoner here that Stark, Rogers, and Barnes had liberated.</p>\n<p>‘I will ask you to stand aside.’</p>\n<p>‘Why?’</p>\n<p>T’Challa hesitated, wondering how much he could say. Then he decided it couldn’t hurt. ‘I had believed Srgt. Barnes killed my father. I dicovered it wasn’t true, but I had been hunting him all this time. I need to rectify the situation.’</p>\n<p>The Wolverine cocked an eyebrow. ‘Isn’t that funny? Stark just found out that Barnes <em>did</em> kill his parents.’</p>\n<p>T’Challa was surprised by that. ‘I was under they impression they died as a result of a vehicular collision.’</p>\n<p>‘So did everyone else, but apparently HYDRA recorded the hit and Stark just had to watch that.’</p>\n<p>‘It may have been faked,’ T’Challa pointed out. ‘The evidence incriminating Barnes for my father’s death was.’</p>\n<p>‘Barnes admitted he did it.’</p>\n<p>T’Challa was stunned speechless for a moment. When he’d been chasing Barnes, he had denied his involvement. He turned out to be innocent. Now he admitted to an assassination. So he must have been guilty. T’Challa quickly recovered himself. ‘Surely, the fact that he was brainwashed must count for something.’</p>\n<p>‘Did it matter to you when you thought he killed your father?’</p>\n<p>Well...no. No, it hadn’t. ‘I was rash, but I have the true culprit. I still owe Barnes a debt for my sins against him.’</p>\n<p>The Wolverine shrugged. ‘It was stupid suspecting him anyway. I’ve heard of the Winter Soldier. He moves like a ghost. No one catches him, and suddenly he gets caught on tape? I don’t think so. How exactly did you plan to repay this debt?’</p>\n<p>‘I intended to take him back to Wakanda and offer him sanctuary until his programming could be removed.’</p>\n<p>Something on the Wolverine’s face gave T’Challa the distinct impression he’d said something wrong.</p>\n<p>‘How long ago did you come out of isolation?’</p>\n<p>Surprised by the random question, T’Challa found himself stammering out an answer. ‘A few months...’</p>\n<p>The Wolverine nodded. ‘So you got no idea that offering a wanted killer sanctuary, mind fucked or not, would incite an international incident that would not end well for Wakanda.’<br>\nT’Challa raised his chin. ‘We are the most technologically advanced nation in the world.’</p>\n<p>‘And you are alone.’ The Wolverine smirked. ‘It doesn’t matter how good your guns and bombs are. The minute you tell the world you don’t give a rat’s ass about all Barnes’s actual victims because it turns out your old man wasn’t one, you make every nation in the world your enemy. For reference, that’s nearly 200 countries against your 1. Doesn’t matter how advanced you are, you’re not coming out on top of that pissing contest.’</p>\n<p>‘Tell the world...?’ T’Challa’s head spun. Was did he mean?</p>\n<p>‘70 years,’ the Wolverine said. ‘The Winter Soldier has been killing for 70 years, and he has remained unseen. All those people, including the Starks, deserve to have justice delivered. Only Barnes can offer that. Maybe they find him not guilty or guilty under diminished capacity but he can tell them who was killed and who wanted those people dead. For the people he killed and disappeared cause he couldn’t fake an accident or whatever, he can tell where he stashed the bodies.’</p>\n<p>T’Challa hesitated. It hadn’t occurred to him that the outside laws could find Barnes innocent of his crimes because of his mental state. Yet this man, who clearly had an American accent, was saying that such a thing could happen. Still, he had to make amends someway. This was the best way he could think of.</p>\n<p>‘I presume you have advisors,’ the Wolverine said. ‘If I were you, I’d turn the actual killer in, go home, and ask them how you can make amends to Barnes. Guy’s been dealt a bum hand, and Rogers doesn’t help.’ He paused. ‘So what was the big idea anyway?’</p>\n<p>T’Challa looked up. ‘You mean for Zemo? What was his ultimate plan?’</p>\n<p>‘Yeah.’</p>\n<p>T’Challa sighed and explained it. By the time he was finished, he’d nearly made his decision. The Wolverine was right. There were countless others who really had lost their loved ones to the Winter Soldier. They deserved to know about it. And those whose bodies had been disappeared – he hadn’t thought of that – deserved to have their remains retrieved and given a proper burial.</p>\n<p>‘Let me get this straight,’ the Wolverine said. ‘This guy blamed the Avengers for his family dying in the Sokovia Disaster last year, he decrypted millions of files to find two specific pieces of information, found Barnes’s old handler, got Barnes’s activation codes, drowned the handler, relied entirely on Rogers being against a document that demanded the enhanced be held responsible for their actions and Stark being for it, bombed the signing hoo-hah of said document and framed Barnes for it, relied on Cap going charging in to stop Barnes from being arrested, relied entirely on Stark pulling them in, killed and impersonated a head shrink for Barnes to turn him into the Winter Soldier, was actually left alone with a prisoner considered highly dangerous, knocked out the power in Stark’s facility and sent Barnes on a rampage, relied on Rogers not telling Stark about the other Winter Soldiers and relied on all the Avengers being called in – even the ones who shouldn’t fucking be there – and relied on everyone but Stark, Rogers, and Barnes being knocked out of the fight or arrested, which included relying on the Black Widow to betray Stark, relying on no one calling the Russians on him, and relying on all three following him to an abandoned HYDRA bunker in Siberia.’</p>\n<p>TChalla paused.</p>\n<p>‘Then, to tie it all up, relying on Rogers to have not told Stark that the Winter Soldier killed his folks.’</p>\n<p>‘How did that plan work?’</p>\n<p>When FRIDAY lost contact with Tony, she had contacted his “Top 5” list: Pepper, Rhodey, Happy, Vision, and Bruce. Hopefully, Bruce still had his phone and got the message. Pepper had instantly made a million phone calls. (That may have been an exaggeration but it felt like a million.)</p>\n<p>The UN operator had told her, when she called and reported it, that Tony had sought permission to enter Russian and Siberian airspace and recieved it. He had gaven his reasons as: Barnes and Rogers have already entered and plan to engage five more Winter Soldiers. The local military was already en route to help deal with the threat.</p>\n<p>Vision had recieved permission to enter the airspace in order to assist and retrieve Tony. The “assuming he’s still alive” went unspoken. The military were obviously more concerned for Iron Man, who had respected their laws and borders, than they were for Captain America and the Winter Soldier who had just zoomed in like they owned the place.<br>Rhodey had called her only a couple of hours later, having woken up from surgery to that message on his phone. He had sounded as frustrated as Pepper felt. Tony was out there somewhere, needing help, and they couldn’t get to him. Pepper, at least, could work and distract herself. Rhodey was stuck in a hospital bed.</p>\n<p>Then King T’Challa had arrived to turn in Helmut Zemo, the man truly responsible for the bombing of the Vienna signing. He’d told them what had happened in Siberia. The Russians and Serbs weren’t happy that he’d violated their borders, but he had diplomatic immunity. Pepper could breathe easy, though, knowing that someone was there <em>with</em> Tony. T’Challa then headed back to Wakanda.</p>\n<p>Vision called in scarecely an hour later, informing them that while severely injured, Tony was alive and in surgery in the nearest UN-sanctioned hospital, having his chest (why was it always his chest?) reconstructed. Rogers and Barnes were in custody. The guy with him, it turned out, had focused on keeping Tony warm and had incapacited the two super-soldiers.</p>\n<p>Barnes had lost his metal arm – from the suit’s unibeam, Vision theorised – and had a femoral artery psudo-aneurysm. Pepper had little knowledge of medicine so she’d asked. Vision had explained that, generally, when that particular artery was cut – located on the inner thigh – the victim would bleed to death. The man who had done it, same one who had protected Tony, had explained that super-healing would stop that from happening. It’d just keep Barnes on the floor for a day or so.</p>\n<p>Rogers had been stabbed through the gut and his jaw had been broken. According to Logan – that was the guy’s name – “he wouldn’t shut up”. After what Pepper had learned (Vision had turned <em>the</em> video tape over to the UN along with Barnes and Rogers) she felt an uncharacteristic urge to go and break some of Rogers’ bones herself. Tony had, for 25 years, been under the impression that his parents had died in a car accident caused by his father’s drunkardness.</p>\n<p>\n<em>‘You know, Peggy Carter told him that.’ Rhodey had pointed at the screen, eyes flat black. ‘If she was Director of S.H.I.E.L.D. at that point like they say, there’s no way she could have really believed that.’</em>\n</p>\n<p>Pepper was inclined to agree. Howard had been bashed in the face, centring around his nose, until he died. Barnes had then rested his forehead against the steering wheel. All the newspaper and post-mortem pictures of Howard showed him with his <em>forehead</em> against the steering wheel. The wounds would have been in the <em>centre</em> of his face. Maria had been flat-out strangled. She would have had blue around her lips and bruising around her throat.</p>\n<p>A lot of people had clearly fallen down that night – or perhaps not.</p>\n<p>Nethertheless, Tony had been forced to watch that with the killer a few feet away from him. Pepper’s parents had died of natural causes. She’d been with both of them when they passed on – the latter of which Tony had given her nearly a full month of paid berevement leave for. She couldn’t even imagine what Tony had gone through.</p>\n<p>The icing on the cake was the footage of what happened <em>after</em> Tony had seen the video. Apparently Zemo had covered all of his bases. Tony had reacted to the situation in the same way any human being would have. Rogers had then escalated the situation by belting him. They beat him nearly to death before Logan showed up and kicked both of them to the curb. The look on Logan’s face while Rogers was trying to justify his inexcusable behaviour was like a balm to an open wound.</p>\n<p>Logan didn’t care what he had to say; just what he’d done.</p>\n<p>Pepper was curious though.</p>\n<p>***</p>\n<p>‘I’m a mutant,’ Logan said.</p>\n<p>Vision raised his nonexistent eyebrows. ‘I’m afraid I don’t quite understand your meaning.’</p>\n<p>‘I have a particular mutation on my 23rd chromosome. It gave me these powers. For every mutant the powers are different. They generally manifest during an emotional outburst in puberty.’</p>\n<p>‘That’s why you want a copy of the Accords?’</p>\n<p>‘If they’ve finally gotten around to making laws for super-powered folks, I’d like to see what they are.’ Logan shrugged. ‘Besides, I’m a Canadian that spends most of my time on American soil. I’d say they apply to me. I don’t like being ignorant. You end up looking like an idiot.’</p>\n<p>Vision nodded. ‘I’ll put in a request, Mr. Howlett.’</p>\n<p>‘Just call me Logan,’ he said.</p>\n<p>***<br>Rhodey was beyond relieved when Tony finally walked through the door. Vision and that Logan guy came with. Most of the time, while Tony was building the braces, Logan had his nose in the Accords. He had a red pen and would often mark things out. Rhodey had passed him a few times. Odd thing was, Logan was rough-talking and often dropped consanats from the ends of some words, but his handwriting was a neat calligraphy.</p>\n<p>\n<em>‘Logan said he was around 160 years old,’ Tony had said when Rhodey remarked upon it. ‘You know, back when you were graded on your handwriting too.’</em>\n</p>\n<p>160 years? And yet he’d flick out an iphone and look something up if he didn’t understand it – unlike a certain Capsicle he could mention. Once, while they were testing out the prototype braces, Tony had showed him something. ‘Look what my girl FRIDAY found, platypus!’ Tony had then flicked the screens up and Rhodey had stared in astonishment.<br>They were military files, spanning from the Civil War to the Vietnam War. There was a new military profile for each new war. He was generally registered under the name “James Howlett” and never rose higher in rank than lieutenant, but when they started incorporating pictures it was clear to see he was the same guy.</p>\n<p>‘Did he miss any?’ Rhodey asked, amazed.</p>\n<p>‘Nope,’ Tony said. ‘Civil to Vietnam, he was in every single one of them.’</p>\n<p>Rhodey looked at Tony. ‘You realise that makes him the most prolific soldier in North American history?’</p>\n<p>‘Yup.’ Tony’s jaw was tense though.</p>\n<p>‘But...?’</p>\n<p>‘Well, turns out in Vietnam, one particular colonel noticed the healing factor and decided to weaponise him. They lied to dad about what they were doing with his facility and ended up bonding adamantium to Logan’s bones before dad found out.’</p>\n<p>Rhodey frowned. ‘What’s adamantium?’</p>\n<p>Tony cracked a tight grin. ‘Think of it as man-made vibranium. The main difference is that adamantium weighs a lot more.’</p>\n<p>‘And Logan lugs that weight around?’ Rhodey had seen how fast he moved.</p>\n<p>Tony nodded. ‘Constantly. 105 pounds of it. Hardly a wonder he beat up Cap and Barnes.’</p>\n<p>‘So what happened?’</p>\n<p>‘Dad liked sending inspectors to factories and facilities without warning whoever was working there. Guess.’</p>\n<p>‘One of them went in and found them experimenting on him?’</p>\n<p>‘And immediately reported it to dad. Logan said the first words he heard from dad was “what the hell are you doing?”’ Tony forced a chuckle. ‘He then had them all arrested and uncuffed Logan. Soon as he was free, Logan bolted. Dad got them on violations of human rights. Turned out they liked recording their work and Logan wasn’t anywhere near their only victim.’</p>\n<p>‘And nobody questioned why a guy with adamantium bonded to his bones was still alive?’</p>\n<p>‘Dad didn’t draw attention to it.’</p>\n<p>‘That must’ve been how HYDRA found out about him.’</p>\n<p>‘That’d be my guess.’ Tony sighed. ‘I don’t think dad knew about the mutant thing though.’</p>\n<p>‘And the UN?’</p>\n<p>‘Look at this.’</p>\n<p>***</p>\n<p>This, Logan wasn’t afraid to admit, was weird. Stark was currently talking to the UN about mutants. Logan had gone through the Accords. There was nothing wrong with them, honestly. He didn’t know what the Walking Flag was complaining about. No, that was a lie. He did. The Walking Flag didn’t want people telling him that he was wrong. He didn’t want people telling him that he’d failed, or what he’d percieve as such.</p>\n<p>Rogers need to be the big hero had always baffled Logan.</p>\n<p>Logan turned his head. He could both smell and hear Rhodes as he walked to the room in those new braces. Stark was yet another mystery. He let Logan, a virtual stranger who’d saved his life once, stay in his tower free of charge and gave him money, food, and anything else he needed or asked for and expected nothing in return.</p>\n<p>Logan had been suspicious at first. Then the catching up he did had shown the other people who had lived in this tower – the Avengers. Tony had done the same for them. They had spat in his face. They degraded him, insulted him, made demands of him, and sat on their asses when not “avenging” all the while complaining he was the lazy, entitled, and egotistical one. They used his money, made a mess of his tower, and of the world in general and Tony always had to clean it up.</p>\n<p>Yet, Tony hadn’t kicked them out on their ears.</p>\n<p>Logan would’ve.</p>\n<p>In fact, Logan wanted to take a swing at that Black Widow. She was the only one not behind bars. The only ones who didn’t treat Tony like he existed for their beck and call were Rhodey, Pepper, Happy, and one other they called Bruce. Rhodey walked over, still getting used to the braces.</p>\n<p>‘Hey, Logan, I’ve been meaning to ask you something.’ And Rhodey, along with Pepper, Happy, and Tony had been quick to notice his intolerance for small talk.</p>\n<p>‘Shoot.’</p>\n<p>‘If you’ve been a soldier since the Civil War, how come you’ve never ranked higher than lieutenant?’</p>\n<p>Logan chuckled. It was a reasonable question, especially coming from another soldier. ‘I know what I can and can’t do. I can shoot, I can fight, and I can kill. I can see an ambush ahead and I can react to it. I can protect civilians from bullets and bombs. But I can’t lead men into battle worth a damn. I don’t connect with people and I terrify them. I’m a soldier, not a commander.’</p>\n<p>‘Lt. Howlett thinks he can find the Black Widow and capture her,’ Tony told the UN panel. It was better, in these settings, to use Logan’s military title. ‘We’re asking permission for him to try.’</p>\n<p>‘Are you certain he can successfully fight a highly trained assassin?’ the Romanian respresentative asked.</p>\n<p>‘Yes,’ Tony said. ‘Seems, between wars, he travelled an awful lot. He’s not only fluent in several languages but he’s also proficient in several forms of martial arts, which removes the one advantage Romanoff would have had over him.’</p>\n<p>‘His healing factor is certainly an advantage,’ the Chinese representative said. ‘You’re certain it can defend againsts poisons and narcotics?’</p>\n<p>‘We tested it,’ Tony said. ‘Any foreign substances that come into his body, or even into contact with his blood, are instantly attacked by his antibodies and neutralised. The healing factor is why HYDRA’s Winter Soldier experiments were ineffective on him.’</p>\n<p>‘We will discuss the issue,’ the New Zealand representative said.</p>\n<p>***<br>\n<strong>Ljubljana, Slovenia</strong></p>\n<p>All it took was a single sniff.</p>\n<p>Romanoff’s room in Stark Tower hadn’t been touched since she’d left. Her scent was drenched through the room. Then she was easy to track. She had moved herself into a heavily populated area, where she would be more difficult to pick out in a crowd. She had also dyed her hair blonde, merging her in further than her less-common red hair would do.</p>\n<p>Logan smirked as he toyed with his beer bottle cap. One might wonder why a guy like him would want to do this. It wasn’t that he didn’t have a stake in it, but he often didn’t involve himself in things he wasn’t getting paid for. Part of him pitied Stark, sure. Another part of him couldn’t believe Romanoff’s gall (a former Russian spy dumped the databanks of an entire intelligence agency on the internet and then gave the American senate a massive F-U) and he wanted to see her knocked off her pedastal.</p>\n<p>The third thing was that, over the years, he had seen countless minorities struggle out of the so-called shackles that society placed on them. He knew it was not an easy road. If mutants wanted to do the same thing, they had to follow suit. They had to disprove the prejudice against them, just like Martin Luther King had disproved that his minority were “of limited intellect”.</p>\n<p>If this shit was ever going to stop, and the Accords were the logical first step, they had to prove they were not sub-human like so many thought they were. The situation had become so dire that someone, Logan wasn’t sure who, had intentionally limited knowledge of mutants. That was why Stark, his buddies, and the UN had never heard of mutants. Stepping out now was a risk. Logan was aware of that and he had considered it.</p>\n<p>Logan lit a cigar. The little spider slipped out of the diner and Logan pulled his feet down from the table.</p>\n<p>Time to play Predator and Prey.</p>\n<p>***</p>\n<p>Natasha had noticed her shadow.</p>\n<p>At first, she tried to shake him off. He was just as dexterous she she was, however, and easily kept up with her. And it was a he. A male who didn’t appear to be overly tall. In fact, he seemed to be below average height. He was also wearing a large jacket, but his shoulders appeared wide enough for him to have a good set of muscles on him.</p>\n<p>Realising that she wasn’t going to shake him, Natasha led him into a secluded area. If she had to fight him, she didn’t want any witnesses. In the past, she’d had S.H.I.E.L.D. or Tony to shelter her when she needed to lie low. But she’d burnt those bridges now. She probably should have thought that through a bit more.</p>\n<p>Tony had been useful, even if he did push her tolerance to its limits.</p>\n<p>Natasha stopped and turned. The man stepped into the alleyway. Natasha got her first good look at him. He looked somewhere in his 30s. A cigar was lightly clenched between his teeth. He looked ferocious, in a way that people did to themselves. He wanted to scare people away. A slow smirk spread across his face, and then he spoke in an accent local to the Canadian Northwestern Territories.</p>\n<p>‘I was wondering when you were going to stop.’</p>\n<p>‘What do you want?’ Natasha affected a Slovenian accent.</p>\n<p>‘Oh, that’s good,’ he said. ‘But save it, darlin’. I know who you are, Natasha Romanoff.’</p>\n<p>Natasha ground her teeth.</p>\n<p>The guy smirked. ‘As for what I want, some beer,’ he tapped the cigar in his mouth, ‘and a few more stoogies would be nice.’</p>\n<p>He was being a smart-arse. Natasha ground her teeth. ‘How did you find me?’ She must have gotten careless somewhere, or been betrayed.</p>\n<p>The man just smirked and tapped his nose.</p>\n<p>The time for talk was over. Natasha attacked. The man stood there, waiting, smirking like every stupid man who thought they could take on the Black Widow. Her punch, aimed right for his nose, was knocked aside by his wrist in a smooth manoeuvre. The bones of his wrist seemed to be far more solid than most men. He was most likely used to strong-arming his way around.</p>\n<p>Natasha shifted, about to kick his legs out from under him, but he moved too. He stepped back with one leg and punched her in the shoulder. Natasha felt herself propelled through the air, spinning as her body was caught up in the momentum of the hit and she was forced to compensate. She recovered and made a perfect landing.</p>\n<p>That was a good enough hit that he’d be trained. Natasha rolled her shoulder as she stood up. She was almost out of her Bites so she’d avoid using those if she could. She flicked out her guns and shot before the man could react, aiming for the chest and the head. She hated to hurt anyone, but what could you expect going up against the Black Widow.</p>\n<p>The man chuckled as his head snapped back. He didn’t stagger though, not like she was expecting. He lowered his head again and she saw why. The wounds she’d inflicted on his face, which were quickly closing over, glinted as if there was metal inside. <em>Implants?</em> How many did he have? It looked like she’d hit nothing but the implants.</p>\n<p>Bites it was then. Natasha flicked her guns back away and fired a Bite at him. The man flinched back as it hit his shoulder. He then paused and looked at it. That wasn’t right! He should’ve been on the ground now. He picked it off his shoulder and looked at it. Natasha’s gut dropped. Just what was this guy?</p>\n<p>She was <em>not</em> afraid.</p>\n<p>‘Stark’s tech, I guess,’ he said. ‘Funny how you run him down at every turn but you're quite happy to use all his toys.’</p>\n<p>Natasha narrowed her eyes. ‘Tony sent you.’ Of course that arrogant bastard had to have the last word. He would find someone like this and send him hunting Natasha. It was his revenge for that “ego” comment she’d made at the hospital – not that it wasn’t true.</p>\n<p>‘No, the UN sent me. But I did ask. Gotta say, you’re not as good as the other Black Widows I’ve fought over the years. One of them even knocked me over.’</p>\n<p>She <em>wasn’t</em> afraid.</p>\n<p>Natasha ground her teeth. She charged again, leaping into the air and going in for a scissor kick to his head. It would distract him before it hit and she would be able to get out of here. As she came in, though, hot white pain shot through her left thigh. The next thing she knew, she was on the ground. </p>\n<p>Natasha tried to get up but her leg hurt too much. It wouldn’t move. Looking down to the leg, she saw a pool of blood around it. Natasha looked up. The man looked down at her, the picture of a child’s nightmare. Natasha watched as three razor-sharp metal claws retracted into his hand. He lifted his eyes and she twisted her head again.</p>\n<p>Armed and uniformed men moved into the alleyway. They had “SEP” stamped on their uniforms. <em>The Red Panthers.</em> They pointed their guns at her as they advanced. The man took the cigar out of his mouth and then spoke in unaccented Slovene. ‘<em>You might want to get a doctor to her leg. I didn’t hit the femoral artery, but I hit enough to immobilise her.</em>’</p>\n<p>Who was this guy?</p>\n<p>One of the men, likely the ranking officer, nodded. ‘<em>Thank you, Lt. Howlett. Mr. Stark has asked that you be informed he’s waiting for you with a jet.</em>’</p>\n<p>Lt. Howlett, obviously a foot soldier of some kind, winced and walked away.</p>\n<p>***<br>\nThe Rogue Avengers, as the media had dubbed them, were finally all in prison.</p>\n<p>Logan’s part in it, and the positive consequences of such, had been quietly released in the direction of a particular audience. Tony was right. It was important to let other mutants know that they were no longer non-entities to the United Nations; that things could get better if they stepped up and helped.</p>\n<p>Pepper was busy organising Legal and checking the lawsuits against each Rogue Avenger. Finally satisfied, she had headed back to her office to close up affairs for the day. Her PA was on the phone as she walked past. ‘Hold on, sir, she’s just come in.’ Cathy lowered the phone. ‘Miss Potts, there’s a Professor Charles Xavier on the telephone for you.’</p>\n<p>‘Thank you, Cathy. I’ll take it in my office.’ As Pepper walked through into her office, she thought about the name. It sounded familiar. By the time she sat down, she remembered where she’d heard the name before and she smiled to herself.</p>\n<p>For the past few weeks, ever since Logan had caught Romanoff, Tony had observed several mutants eyeing Stark Industries buildings – specifically the New York one where Tony himself was known to work. As of yet, none of them had the nerve to knock on the door, so to speak, and ask to see the Accords. Maybe they weren’t sure of approaching a figure such as Tony Stark, maybe they were unsure of the conditions. Some may have even, quite reasonably, suspected it to be a trap.</p>\n<p>This was the first contact. Pepper answered the phone. ‘Hello, Viriginia Potts speaking. How may I help you.’</p>\n<p>‘Miss Potts,’ a British accent on the other end of the line said. ‘My name is Professor Charles Xavier. I apologise, but I was unsure how else to contact Mr. Stark.’<br>\n‘That’s quite all right,’ Pepper said. ‘I presume that you want a look at the Sokovia Accords.’</p>\n<p>‘Indeed. May I ask how you knew the nature of my call?’</p>\n<p>‘Your school came to Mr. Stark’s notice shortly after the Battle of New York. I believe a number of your people arrived as volunteers to help with the clean-up.’ She smiled to herself. ‘It was the X-shaped insignia they were all wearing that aroused Mr. Stark’s curiosity.’</p>\n<p>From the sigh on the other end of the line, Pepper could just about see the poor man lift a hand to his face.</p>\n<p>Pepper held back her chuckle. When Tony had found the source of the insignia, he’d then zeroed in on the amount of dispossessed children that were taken in by the school. He’d even been suspicious when he saw Xavier’s taskforce, the X-Men operating on the down-low. It was only when he met Logan and became aware of the existence of mutants that he’d worked out there was nothing nerfarious going on there. Xavier was simply offering sanctuary and education to all of the underage mutants he could find and then some of them joined the X-Men when they grew up.</p>\n<p>The Brotherhood was a far greater concern.</p>\n<p>‘I was wondering, Miss Potts, if I could arrange an appointment with Mr. Stark.’</p>\n<p>‘Of course.’</p>\n<p>\n<strong>Westchester, NY</strong>\n</p>\n<p>Scott’s lips were pressed into a thin line. ‘I don’t like it.’</p>\n<p>‘Scott, I have told you,’ the Professor said. ‘I’ve already scanned Tony Stark. He is playing this straight. If we want to be accepted into society, we need to show society that we are willing to work with them.’</p>\n<p>Remy LeBeau nodded beside him. ‘And I’ve met Logan. If the Accords were a load of crock, he would’ve given them a great big F-U and walked out – not signed them.’</p>\n<p>Hank smiled to himself. ‘Added onto that, the amount of anti-mutant attacks since the event has dropped by 12%. The best way to drop it lower is to show the world more enhanced beings willing to work within the confines of the law. We need to show them that we are reasonable individuals; that the Rogue Avengers are the exception rather than the rule.’</p>\n<p>Reluctantly, Scott nodded.</p>\n<p>‘What about the other mutants?’ Storm asked. ‘You said they were loitering around.’</p>\n<p>‘They are unsure about precisely how safe this is,’ the Professor said. ‘Many want to be pulled under the protection of some kind of law, but just as many are fearful of a set-up. They are waiting for somebody else to walk in and prove to them that the Accords are not the metaphorical cheese on the mousetrap.’</p>\n<p>\n<strong>Manhattan, New York City</strong>\n</p>\n<p>‘Boss, your guests have arrived.’</p>\n<p>‘Thank you, FRIDAY.’ Tony picked up a copy of the Accords and walked into the lift. As FRIDAY moved it, he asked. ‘Who have we got?’</p>\n<p>‘Professor Charles Xavier and Dr. Hank McCoy,’ FRIDAY said.</p>\n<p>Tony nodded and stepped out of the lift. He walked down the hall and into the conference room FRIDAY had shown them to. Tony stepped in and he was mildly surprised. Professor Xavier, whom he’d seen a lot when he was investigating the school, was talking to a large man covered in blue fur, but dressed in an impeccable three-piece suit.<br>Logan had mentioned that occasionally mutants were born with vivid blue skin, but he’d never mentioned having a coat of fur in the colour.</p>\n<p>Huh. Must’ve been part of his mutation.</p>\n<p>‘Good morning, gentlemen,’ Tony said, ever the businessman. ‘Sorry to keep you waiting.’</p>\n<p>Dr. McCoy stood up. ‘Not at all, Dr. Stark. Thank you for making the time for us.’ Well, for looking like a blue furry monster, he sure did behave like a civilised man. Of course, Tony would be the last person to disparage someone’s appearance. He still had some theories on the Hulk to be honest.</p>\n<p>‘Not at all.’ Tony shook both their hands and sat down opposite them. ‘Now, you’ve looked through the copies of the Accords I gave you and made your own amendments?’</p>\n<p>‘We have,’ Professor Xavier said. ‘I must say, I was pleasantly surprised at the lack of issues we had with the Accords. I had thought there would be far more restrictive clauses in there.’</p>\n<p>Tony cracked a grin. ‘Yes. Logan already went through them and pointed out everything that he thought would be problematic to the mutant community.’</p>\n<p>‘And that’s exactly what Remy LeBeau theorised.’ Dr. McCoy smiled to himself and flicked open the document in front of him. ‘He seems to have only missed out on issues a politically-minded individual would notice.’</p>\n<p>Tony suppressed a chuckle. He still remembered what Logan had said when Tony had pointed out he’d stuck to practical problems over anything else. <em>‘I ain’t a diplomat and I ain’t gonna try to be one.’</em></p>\n<p>Hank McCoy was the diplomat.</p>\n<p>Professor Xavier smiled. From his power-set, Tony presumed he knew what had been plaguing Tony’s head since he’d learned the scope of Mutantkind. Logan hadn’t known the answer. He had, in fact, been as confused as Tony on the matter. A telepath, though, might have a better idea of what was going on.</p>\n<p>‘I can hear you wondering about it, Tony,’ the Professor said. ‘You can ask.’</p>\n<p>Tony cracked a smile, but asked. ‘Given the nature of your powers, and the common way in which these powers manifest, how have mutants remained undetected to this day? Especially considering how your bunch have been pushing for peaceful human and mutant co-existence.’</p>\n<p>The Professor and Dr. McCoy looked at each other and smiled tightly.</p>\n<p>‘There is a sub-branch of mutants,’ Dr. McCoy explained. ‘It is their belief that mutants as a whole would be safer if baseline humans are ignorant of our existence. They believe our right to the protection of the law are a fair price to pay for that safety.’</p>\n<p>‘They go to extreme lengths to ensure baseline humans such as yourself never discover that we exist,’ the Professor said. ‘They often use their powers to ensure such things and they have made our negotiations most difficult.’</p>\n<p>‘Right.’ Tony tapped the tabletop and a holographic screen appeared in front of him. ‘If you tell me what power-sets I’m looking at, I should be able to set up some counteractants for them.’</p>\n<p>***</p>\n<p>Xavier had made a request before they left. ‘I would like to meet Logan.’</p>\n<p>So Tony had FRIDAY let Logan know they were coming and led the Professor and Hank into the lift. FRIDAY moved them up to the suite he’d given Logan when he first came to the Tower. Unlike the Rogue Avengers, for some weird reason, Logan had been genuinely surprised at the level of hospitality.</p>\n<p>Logan had been surprised at the free room and board; had expected to have to pay for it. As he’d said, it’d cost a small fortune to run, so it should cost an arm and a leg to rent. He’d then been surprised that he was given anything he asked for, completely free of charge. He still wanted to find another place before he got too comfortable with it.</p>\n<p>Charles smiled to himself. He might have to talk to Tony about mental shields. The man was just projecting his thoughts outward like it was nothing. And, more concerning, there was a trace of forceful mental manipulation that Charles could pick up. It wasn’t the sort of thing that would result from emotional manipulation, but rather from the hand of a telepath – and it was palpably malignant.</p>\n<p>He would speak to the man on the matter later, when there was not an audience. Perhaps he could help him. It did, rather, make Xavier want to have a word with those people. That was not even mentioning what they had cost his home, and his children, with their callous and self-serving actions.</p>\n<p>The lift opened and Tony led them out into the suite. Logan, as Charles had been told, was not a particularly large man. He turned his head as they walked in. One eyebrow was lifted. What was curious was the lack of activity he seemed engaged in when they entered. He wasn’t watching TV, he wasn’t reading, he wasn’t playing any sort of video game. He was just sitting on the couch, smoking a cigar and with a beer in his hand.</p>\n<p>‘Afternoon.’ Tony strolled over and plopped down next to him. ‘I expect FRIDAY told you the Professor and Hank want a word with you.’</p>\n<p>‘Yeah.’ Logan looked at them. ‘What about?’</p>\n<p>‘I have a few questions,’ the Professor said, wheeling over to a more respectable distance for conversation. ‘My first question is this: I’d like to know your reasons for supporting the Accords.’</p>\n<p>Logan tapped his cigar in the ashtray on the coffee table in front of him. ‘My powers manifested when I was thirteen and I had to leave home. I know what happens out there. The UN were the first ones to define human rights as they stand now. I know the Accords were drafted as a response to the Walking Flag and his pack of mutts stomping all over the world like they owned it. Stark, at least, had regard for Sovereign borders, which was why they only talked to him.’</p>\n<p>Tony chuckled to himself.</p>\n<p>Logan cracked a smirk. ‘The Accords are the UN admitting that non-baselines are human and should have rights. Course, that’s just my translation. If I wanted to push that idea, I had to prove that I was willing to work within their system.’</p>\n<p>Charles would admit, if only to himself, that he was amused by Logan’s summary of Captain America and his followers.</p>\n<p>‘I fail to understand why Steve Rogers behaved in the way he did,’ Hank said.</p>\n<p>‘Because he’s a self-righteous little shit,’ Logan stated.</p>\n<p>Hank frowned. ‘Is the explanation really so simplistic?’</p>\n<p>‘Rogers is a simplistic guy,’ Logan told him. ‘For him, life is simple. There’s good and bad, and he’s got the strangest need to be the hero of the story. So anyone who argues with him or disagrees with him any other way must be a bad person, and anyone who follows him like a dog is a good person.’</p>\n<p>‘Hold on.’ Tony frowned. ‘Are you saying the whole reason Rogers treated me like I was morally bankrupt was because I didn’t agree with every word he said.’</p>\n<p>‘Well, that and two other reasons,’ Logan said. ‘Firstly, Rogers does not like to be confused, so he does not like people to use big words. Lazy ass doesn’t know how to put the words in context and he doesn’t try. So he glares at whoever’s talking in the hopes that they’ll dumb it down for him. The next reason is you were already Iron Man.’</p>\n<p>‘He considered that competition?’ Charles guessed. Logan’s mind was unusually hard to read. It might have been the adamantium on his skeleton. After all, Magneto had a metal helmet that kept Charles out.</p>\n<p>‘Like I said, he likes to be the big hero.’ Logan shrugged. ‘He hated anyone else doing the rescuing. Back in the War, I met him because my unit was teamed up with him and his Howling Commandos. We were supposed to rescue a group of civilians. I reckon there was someone important in the group of hostages.’</p>\n<p>Charles was about to ask what he meant, but he picked up Tony’s thoughts. It was apparently very unusual for soldiers to be tasked with rescuing civilians. The soldiers were often seen to be better suited on the front line. Tony knew the only reason his friend, Col. Rhodes, had been allowed to search for him for so long in 2008 was because of who he was, not that he was a civilian in enemy hands. He was <em>Tony Stark</em>, so he was important enough to rescue.</p>\n<p>‘While Rogers and his bunch punched the Nazis, my CO sent me and a bunch of others to rescue the hostages and move them to a safe location.’ Logan smirked bitterly. </p>\n<p>‘Afterwards, Rogers acted like we’d sworn in church or something. I guess that’s not as relevant a phrase as it was back then, but you get the point. He just didn’t like somebody else considered the hero.’</p>\n<p>‘So he felt threatened by Iron Man?’ Tony asked.</p>\n<p>‘Well, you were the only other one people considered a hero. It would have definitely rubbed him the wrong way.’</p>\n<p>‘And Barnes?’ Hank asked.</p>\n<p>‘Rogers is stuck in the past. He still thinks in terms of guilty until proven innocent, the League of Nations, and the Death Penalty. He thinks any trial would be a farce that would end with Barnes stood up and shot.’</p>\n<p>Charles frowned. ‘I should like to correct that.’</p>\n<p>Logan didn’t like to fly.</p>\n<p>He’d managed to shake off every piece of cultural conditioning from his early life, except that. Instead of focusing on the fact that he was in the air, he focused on the coming shitstorm. It wasn’t a surprise that Maximoff had been in Tony’s head and turned the guy’s guilt complex up to 11. No, Logan hadn’t been surprised when the Professor asked to see Tony alone and then, underestimating Logan’s hearing, told him that his mind had been tampered with. He hadn’t been surprised when, upon Tony agreeing to let the man check, the telepath had found the genius’s frontolimbic network being constantly remotely stimulated – or, Logan would call it “the self-blame part of the brain”.</p>\n<p>Maximoff was the only telepath Tony had been in contact with, and she was willing to toss over a dozen cars on top of the guy. She was certainly liable to mind-rape someone. Logan had seen the footage. Those jokers should not have been let out of the house by themselves. Sure the Raft hadn’t been ideal, but Thaddeus Ross had only been able to keep them there a week before the UN asked where they were and discovered his illegal incarceration facility.</p>\n<p>He was currently in prison awaiting trial.</p>\n<p>The jet came to a landing and Logan stood up. There had been a few other mutants who wanted to come, including some slim they called Cyclops. But Tony had said he and Rogers would just rile each other up. Logan was inclined to agree and, thankfully, so was the Professor. Instead, along with him, the Professor, and Hank, a nicely level-headed woman called Storm came along. She told him she’d been a teenaged thief before the Professor found her.</p>\n<p>Of course, that made sense.</p>\n<p>Most mutants spent some time as teenaged thieves.</p>\n<p>The guards let them in and they were taken to a cell block. Logan almost smirked. Barnes had already been removed from the facility. In fact, he’d never been here in the first place. A review had found that Barnes had been fine before Rogers showed up. The big guns had decided to separate the two of them for safety reasons.</p>\n<p>Not a dumb idea. It was fine when Barnes was in possession of all his faculties and was actually capable of babysitting the Walking Flag. When the Glorified Sales Gimmick was in charge though...well, look what happened in Bucharest. They were far better in these specialised cells that Tony had built years ago.</p>\n<p>Something he was sanctioned to do years ago by someone or other who was concerned about enhanced criminals. It made sense. And these cells were far more humane than the cells of the Raft. At least here they had some level of privacy - and their own adjoining bathrooms each one might add (thought there were ulterior motives attached to those). These were more like normal cells. Logan had never liked being ignorant – and these idiots were walking examples of why.</p>\n<p>Romanoff’s leg was obviously still healing. As she moved to her feet, on the defensive, her movements were sluggish. Of course, her noticing had the bird-brain notice and then the others jumped to attention. Barton reeked of anger. From what Logan knew of him, he was used to having his ass covered and had now stooped to the blame game.</p>\n<p>The glares from Wilson and Barton were the glares of self-righteous men who thought they had a moral high ground. Maximoff was making an express effort to look pathetic. She was trying to garner sympathy and possibly even assistance from them. Romanoff’s face was blank.</p>\n<p>Rogers himself stood there staring at Logan, as if trying to connect him with a man half-forgotten. That suited him. Rogers had always struck Logan as a “out of sight, out of mind” type. Logan walked over to his cell, leaned an elbow on the bars. The Walking Flag’s jaw tightened a moment before he opened his mouth.</p>\n<p>Logan interrupted him. ‘I see your jaw healed. Barnes tell you who I was?’</p>\n<p>Rogers scowled. ‘He said who he thought you were, but that’s impossible. Lucky James was a soldier in the Second World War. You can’t possibly be him.’</p>\n<p>‘Luck had nothing to do with it, bub.’ Logan lifted his fist. <em>SNIKT!</em> He was satisfied to see Rogers flinch back as he popped his claws. Out of the corner of his eye, he saw Romanoff’s eyes widen slightly as she must’ve only just worked out what he’d stabbed her with. ‘I got a healing factor.’</p>\n<p>‘How...?’</p>\n<p>Logan retracted his claws. ‘That we ain’t here to talk about.’ He walked away from the cell. ‘We’re here to talk about your recent bout of bullshit.’</p>\n<p>‘Hey, remember who you’re talking to!’ Wilson snapped.</p>\n<p>Logan smirked at him. ‘And who’s that, mutt? Captain America.’ He shrugged. ‘I’m Canadian.’</p>\n<p>‘So what?’ Clint demanded. ‘Wanda’s Sokovian and she still respects that he’s a hero.’</p>\n<p>‘No, she doesn’t.’ The Professor wheeled forward. He then injected his mental voice into all of their heads. <em>Miss Maximoff views you all as a convenient way to escape the consequences of her frankly detestable actions.</em></p>\n<p>Logan wasn’t sure how invasive it was to put your thoughts into someone else’s head, but it got the Professor’s point across. That, and it was entirely amusing to watch all of them nearly jump out of their skin. Maximoff even abandoned her act in favour of looking shocked and outraged. Outraged? Really? Why the hell should she feel the need to be outraged?</p>\n<p>\n<em>She can’t inject her thoughts into someone else’s mind, Logan. She likes to believe she is the most powerful psionic enhanced person in the world. She now feels threatened. Much like a small child’s reaction when they see another child has a toy that they perceive to be better than their own.</em>\n</p>\n<p>That one would’ve gone only to Logan.</p>\n<p>The next one was directed at everyone again. <em>When I was a boy, I discovered that I could hear the thoughts of others. I could make them think anything I wanted them to think.</em></p>\n<p>Barton interrupted him. ‘Don’t much like mind powers. Been there done that.’</p>\n<p>‘One.’ If he got to three, Logan was going to teach him the Victorian way of dealing with big-mouthed dumbasses.</p>\n<p>The Professor went on as if neither had spoken. <em>As I grew, though, I became aware that my power was not one to be taken lightly. I could cause extreme damage to a person – mentally, emotionally, and physically – if I did not control my use of the power. Mr. Barton, you have expressed your distaste for mind powers. I have encountered one other who said as much, and she spent years under mind control. I presume you have also been subjected to such.</em></p>\n<p>Barton’s haughty look fell away. It was safe to assume he hadn’t spent nearly as long under his mind-control session. Slowly, Barton nodded.</p>\n<p>Having made his point, the Professor switched to vocal communication. ‘Would it then interest you to know that you are currently under mind control?’</p>\n<p>‘Liar!’ Maximoff hissed.</p>\n<p>‘You are a sniper, are you not?’ the Professor asked.</p>\n<p>‘Yes...’</p>\n<p>‘Then why did you feel guilty for the death of Pietro Maximoff in the Sokovia Disaster?’ The Professor gave him a kind smile. ‘You must have had partners die before, and you had only just formed an uneasy alliance. Mr. Maximoff died, if my information is correct, saving yourself and a young child from gunfire. How should that incite feelings of guilt within yourself?’</p>\n<p>It shouldn’t. Snipers were desensitised to death. At the very most, in the circumstances, Barton should have felt a bit of regret at the other man’s death – not full-blown guilt. That was unless Maximoff’s sister had blamed Barton for her brother’s death and, upon finding no guilt in him, constructed it.</p>\n<p>Romanoff slowly turned her head and looked at Maximoff accusingly as the young woman spat out denials. With that collar though – because, really, how else were baseline guards going to protect themselves against her? – she couldn’t even try to stop Barton’s common sense from rearing its head.</p>\n<p>Barton slowly turned his head and he backed away to the fartherest corner of his cell from Maximoff.</p>\n<p>‘But...’ Rogers sounded like his head was spinning. ‘No, Clint. The fact that you felt bad for Pietro dying means you’re a good person.’</p>\n<p>‘No, Steve, he’s right.’ Romanoff spoke up now. ‘Clint and I are killers. We kill people, and we don’t feel bad about it. Guilt and remorse for death has been trained out of us. It makes far more sense that Wanda thought Clint should feel bad for her brother’s death and forced the emotion onto him.’</p>\n<p>‘Natasha, Wanda’s just a kid!’ Rogers insisted.</p>\n<p>The statement made Logan laugh. ‘A kid?’ He sauntered over to Wanda’s cell and looked down at her. Apparently she’d completely abandoned her previous image as a meek abused little girl. She was just about hissing at him. ‘Let’s see, we’re fully developed, we look like we want to kill me. Doesn’t look like a kid to me. How old are you, girl?’</p>\n<p>‘None of your business!’ she snapped.</p>\n<p>One of the guards answered for him. ‘She’s 25, Lt.’</p>\n<p>‘25, huh?’ Logan nodded and walked away from her cell. ‘You know, I can’t think of a single society that considers 25 a child. Generally, you become at adult at 18. 21 at the oldest.’ He shot the Walking Flag a hard smirk. ‘If they move from those two numbers, they tend to go down, not up.’ He looked at the other three. ‘I’m gonna take a guess as to why he’s saying she’s a kid.’</p>\n<p>‘Well, it seems you haven’t been wrong yet,’ the Professor remarked. ‘Please.’</p>\n<p>‘As I said before, Rogers <em>thinks</em> in the terms of the world in the 40s.’ Logan smirked. ‘If he can get a HYDRA volunteer like Maximoff onto his version of the Avengers, he thinks he can work Barnes outta trouble.’</p>\n<p>Rogers drew back, shocked.</p>\n<p>‘And you’re right again,’ the Professor surmised.</p>\n<p>‘That wouldn’t work,’ Barton said. ‘Barnes was brainwashed. Maximoff chose to join. I don’t know what the hell you were thinking Steve, but those are two completely different circumstances.’</p>\n<p>‘No!’ Steve insisted. ‘HYDRA manipulated Wanda and her brother into joining. They were victims, just like Bucky!’</p>\n<p>Romanoff gave Logan a sidelong look. It didn’t take much for him to guess she was impressed and annoyed that he’d read Steve’s motives so well when she hadn’t. Of course, Black Widows were trained only to seduce, infiltrate, and kill. People-reading was pretty low on their list of skills. Logan had learned it as a matter of survival.</p>\n<p>‘No, Mr. Rogers,’ the Professor said. ‘They knew what they were doing. They chose to join a terrorist organisation not to protect their country, as you believed, but because they wanted to kill Tony Stark. Their reasoning was extremely illogical and your catering to such a thing was even worse.’</p>\n<p>‘What do you mean?’ Wilson asked.</p>\n<p>‘What happened,’ the Professor said, ‘was that an unspecified explosive destroyed their apartment complex, killing the parents and trapping the twins inside. Following that, a bomb with Tony Stark’s name on it landed in the apartment and they decided to blame Tony Stark for the event. It makes sense for a 10 year old to do, but once you reach adulthood the argument falls apart.’</p>\n<p>Yes. Yes, it did.</p>\n<p>‘Liar!’ Maximoff hissed. ‘Stark killed—’</p>\n<p>‘Shut up, Wanda!’ Clint snapped. He spoke more levelly to the Professor. ‘What do you mean?’</p>\n<p>\n<em>I have no experience with Stark Industries weapons, Logan, the Professor told him. But you do. You tell them.</em>\n</p>\n<p>‘Stark’s weapons were the most reliable things you could get,’ Logan said. ‘I’ve been using the things since they hit the battlefield. I had a choice between weapons created by different companies, I’d go for the Stark ones. They’d work even when all the others would pack it in.’ He fixed Maximoff with a hard enough look to make her shrink back. ‘That had been a real Stark bomb, girlie, then you’d be dead.’</p>\n<p>‘No!’ Maximoff screamed. ‘It was Stark’s missile! Stark killed my parents!’</p>\n<p>‘You’re wrong,’ Rogers insisted. ‘Tony—’</p>\n<p>Logan interrupted him. ‘Even Stane sold working weapons. If it didn’t work, it was stripped down and never went into circulation.’</p>\n<p>‘Who?’ Rogers looked genuinely confused.</p>\n<p>Logan frowned. He couldn’t possibly have allowed himself to be that ignorant, could he? ‘Obadiah Stane. What, you never heard of him? The guy that was selling weapons to terrorists behind Tony’s back? And behind his old man’s before him? Are you really so resistant to this century that you won’t look up anything that happened since 1945?’</p>\n<p>‘Oh, give him a break!’ Wilson snapped. ‘I’d like to see you adjust to living out of your time.’</p>\n<p>Logan smirked at him. ‘Oh, I have, mutt.’</p>\n<p>Wilson drew back. ‘Huh?’</p>\n<p>Hank spoke up. ‘Logan was born in 1829. He has adapted to not only social changes in that time, but every invention from then to now. He adapted to indoor plumbing, to the invention of the automobile, the semi-automatic rifle, the invention of the light bulb, of radar, of CCTV, of the <em>internet</em>. It is not that Mr. Rogers—’</p>\n<p>‘Captain,’ Rogers interrupted him.</p>\n<p>‘It is not that <em>Mr.</em> Rogers,’ Hank just reiterated what he’d said, ‘is struggling to adapt. It is that he doesn’t want to adapt. Perhaps that is part of why he dislikes Tony Stark so. Mr. Stark is a living, breathing representation of everything that Mr. Rogers wants to ignore.’</p>\n<p>Good theory. Could even be true.</p>\n<p>Romanoff stared at Hank, like she couldn't believe such a monstrous-looking individual was so intelligent.</p>\n<p>‘That’s not—’ Rogers started to say.</p>\n<p>Logan wasn’t having that. ‘Which brings us to the Accords.’</p>\n<p>Rogers set his jaw. ‘We’re not signing them.’</p>\n<p>‘Bit late for that.’ Logan pulled a cigar out of his top pocket. ‘You’re being charged for international felonies, among some other shit, so you obviously don’t care about Sovereign borders.’</p>\n<p>‘We were saving people.’ Rogers’ tone took on that irritating disapproving edge. It’d always made Logan want to sock him in the jaw.</p>\n<p>‘Saving people?’ Storm finally spoke up. ‘You caused the deaths of 47 people in Nigeria.’</p>\n<p>‘More would have died if we hadn’t been there,’ Rogers stated like it was fact.</p>\n<p>‘How do you know that?’ Hank asked calmly.</p>\n<p>Rogers froze. ‘What are you talking about?’</p>\n<p>‘You mistook which building Crossbones was targeting,’ the Professor said. ‘Then you chased a baseline human terrorist through a crowded marketplace. This chase was what led to the deaths of those people – deaths which could have easily been avoided if you had contacted the ATS once you became aware of the issue.’</p>\n<p>‘ATS?’ Rogers asked, clearly confused.</p>\n<p>‘Anti-Terrorism Squad,’ Logan said. ‘The part of the Nigeria police force that deals with counter-terrorism.’</p>\n<p>Rogers shook his head. ‘There wasn’t time.’</p>\n<p>‘But there was time for you to set up a trap?’ Hank questioned with a raised eyebrow. ‘I begin to think that Logan is right. Your entire sense of self-validation comes from being the hero all the time.’</p>\n<p>Rogers looked annoyed and gave Hank the disapproving look.</p>\n<p>Hank, for his part, shot an amused look at Logan. ‘Despite your appearance, Wolverine, you are incredibly perceptive.’</p>\n<p>Logan chuckled. ‘You can talk.’</p>\n<p>‘Thank you.’</p>\n<p>Rogers shook his head. ‘We can’t always save everyone,’ he insisted, probably to draw attention back to him, ‘but we save everyone we can.’</p>\n<p>‘Really?’ Storm stepped forward and flicked out an iPad. ‘What about what happened in Bucharest?’</p>\n<p>‘They were going to kill Bucky!’ Rogers insisted. ‘He’s innocent!’</p>\n<p>‘He was innocent of the Vienna bombing, yes,’ Storm said. ‘But the orders were actually “shoot on sight, <em>if</em> the target becomes threatening”. The grenade the taskforce threw into the apartment was a stun grenade. It was designed to subdue, not to kill. The fact that he wasn’t killed when you were caught clearly displays killing him was never the objective.’</p>\n<p>‘Bucky was innocent!’ Rogers insisted again. ‘It was HYDRA!’</p>\n<p>‘You sound like a broken record.’ Storm inclined her head. ‘Tell me, what exactly do you think would happen if Sgt. Barnes was found guilty of murder?’</p>\n<p>‘He’s not guilty—’</p>\n<p>‘That is not what I asked.’ Storm interrupted him. ‘I asked you what you think will happen if he is found guilty.’</p>\n<p>‘I won’t let them execute Bucky!’ Rogers snapped.</p>\n<p>Wilson, Barton, and Romanoff looked at him funny.</p>\n<p>Logan lifted his eyes. ‘Called it.’</p>\n<p>‘What?’ Rogers demanded.</p>\n<p>‘Steve,’ Wilson said, ‘execution is not in force in this state.’</p>\n<p>‘...What?’</p>\n<p>‘As for him being innocent.’ Storm tapped a few things on the iPad. She then turned the iPad around and held it up. ‘See this man? This was the man Sgt. Barnes acquired that motorcycle from in Bucharest. He ripped him from the bike and threw him into oncoming traffic. It was a new bike this poor man was taking for a spin. He died on scene. Was <em>that</em> the Winter Soldier who did that?’</p>\n<p>Wilson opened and shut his mouth a few times, then he averted his eyes.</p>\n<p>Rogers stared at the picture. He swallowed audibly. ‘Bucky was scared! They were going to kill him...’</p>\n<p>‘We just told you they weren’t.’ Storm turned the iPad back to herself and manipulated it again. ‘But, if you insist, let’s talk about the taskforce. They were German counter-terrorist officers who were just following orders. You used excessive force on them and killed over half of them. Of the survivors, three are permanently crippled. The remaining men are in comas and they are not expected to ever wake up again.’</p>\n<p>‘Excessive...? I didn’t—’</p>\n<p>‘Oh, please!’ Logan rolled his eyes. ‘Little thing called CCTV, Rogers. We’ve seen the footage. You threw your little Frisbee at them and put effort into punching and kicking them. Do you have any idea how much stronger than them you are?’ He stuck his cigar in his mouth and lit it. ‘There should be a rule that until anyone with super-strength works out how much stronger they are than the average Joe, they shouldn’t be allowed to touch baseline humans.’</p>\n<p>Rogers looked so offended. It was hilarious. ‘We—’</p>\n<p>‘Collapsed a tunnel during knock-off traffic,’ Logan interrupted him again.</p>\n<p>‘34 people were injured,’ Storm said. ‘52 were killed. There are currently 9 people reported as missing, who are suspected to have been in the area. Out of those, 12 are confirmed to be children. You did that not to protect any innocent people, but to protect a single man who happens to be your best friend – at the expense of the innocent people.’</p>\n<p>The colour had drained out of Wilson’s face.</p>\n<p>Rogers was slowly shaking his head, trying to deny it.</p>\n<p>‘And that’s what it’s always been about, ain’t it?’ Logan remarked. ‘Protecting your buddy. That’s why you didn’t tell Tony Stark about his parents.’</p>\n<p>‘I...’</p>\n<p>Barton was the one who interrupted him this time. ‘What about Tony’s parents?’</p>\n<p>‘Howard and Maria Stark were in actual fact murdered by the Winter Soldier,’ the Professor said. ‘Mr. Rogers knew about it since 2014 and made the decision not to tell Mr. Stark. It was only in the Siberian bunker that he found out, by watching a video tape of the event.’</p>\n<p>‘It wasn’t Bucky!’ Rogers insisted. ‘Tony shouldn’t have attacked him.’</p>\n<p>‘He didn’t attack him first, as I recall,’ Logan said. ‘He punched you in the face and then Barnes turned his rifle on him.’</p>\n<p>That impression of a landed fish was quite amusing.</p>\n<p>‘How did you expect him to react?’ Clint asked. ‘He watches his parents being murdered with the killer standing right there. I’ve seen people snap into murderous rages over less than that!’ He frowned as something seemed to click. ‘And...knowing you, you probably responded to it by beating him up.’ He looked at Logan. ‘That’s why you beat Cap up, isn’t it?’</p>\n<p>‘Yup.’</p>\n<p>Clint shook his head and turned his back.</p>\n<p>Rogers glared at them. ‘Who are you people?’</p>\n<p>‘We are mutants,’ the Professor said. ‘We were born with a mutation that allows us a vast variety of powers. For centuries, people like us have existed. We have been the victims of xenophobic aggression and ostracism from all society. We manifest our powers in adolescence. Human law rarely recognises our existence and provides us with no protections. That is, until the Accords were drafted and Logan took the first steps to securing our protection under them.’</p>\n<p>Rogers shook his head. ‘The Accords will just turn you into government attack dogs, you and your children.’</p>\n<p>The four mutants smiled in amusement.</p>\n<p>‘He hasn’t read them, has he?’ Storm asked.</p>\n<p>‘No,’ Logan said.</p>\n<p>‘On the contrary, Mr. Rogers,’ Hank said, ‘the Accords are a set of checks and balances that allow us to be considered human beings and, as such, allow us access to our human rights. They allow us to negotiate for our specific conditions, and our children finally have a support system in place for the unexpected event of their powers manifesting. The vast majority of the mutant and enhanced communities are heavily in favour of them. Yourself and your cohort are the exception to the rule.’</p>\n<p>Rogers drew back. Wilson swallowed heavily. Maximoff said nothing, still seething. Romanoff and Barton didn’t look impressed.</p>\n<p>Hank went on. ‘In the time between the fall of S.H.I.E.L.D. and when you were apprehended, attacks on mutants and other enhanced individuals skyrocketed. It is unknown precisely how many were attacked but many were struck in unprovoked assaults which left them injured and, in some cases, dead. During your “Civil War”, the homes of such enhanced individuals were even attacked.’</p>\n<p>‘I can’t be—’</p>\n<p>Logan was kind of getting sick of interrupting this guy. ‘Let him finish.’</p>\n<p>‘Then Logan apprehended the Black Widow,’ Hank said. ‘These attacks dropped by 12%. For each enhanced individual that stepped in to view and, in some cases, signed the Accords, the attacks dropped even further. There is still the odd attack here and there, but now the attackers can be persecuted under the law without the police presuming that the enhanced individual provoked their attacker in some way.’</p>\n<p>‘Several community centres are being set up with support networks for those minors who suddenly and unexpectedly find themselves in possession of powers,’ the Professor went on. ‘They are run mostly by volunteers. Mutants and other enhanced individuals in the workforce are now gaining the protections from the law that their peers and co-workers are already entitled to – of which they were deprived of until now. This was something Dr. McCoy and myself had been working towards for years. It is only through the Accords that this progress was made.’</p>\n<p>‘We came here to tell you that.’ Storm tucked her iPad away. ‘You may think that the Accords are a bad thing, but the rest of the world does not agree. Your selfish actions made things worse for the thousands of other super-powered individuals across the planet because you were only interested in what <em>you</em> wanted. Tony and Logan were the ones who made it better.’</p>\n<p>The four of them turned and headed out.</p>\n<p>‘Hang on, what happened to Scott?’ Wilson called.</p>\n<p>‘Scott Lang?’ One of the guards chuckled in disbelief. ‘He violated parole to help you. He’s back in prison.’</p>\n<p>‘When Stark Industries released the list of charges it would be pressing against the Rogue Avengers, everyone questioned that “obstruction of justice” charges against Steven Grant Rogers and Natalia Alianova Romanov, otherwise known as Captain America and Natasha Romanoff. It turns out those charges are entirely accurate.’</p>\n<p>The news anchor glanced down at her notes.</p>\n<p>‘In the courthouse today, a video tape was shown of Howard and Maria Stark being brutally murdered by the Winter Soldier. This is a shocking divorce from the previously-held belief that their alleged accident was caused by Howard Stark being inebriated behind the wheel. The case has now been reopened and a carefully selected investigative team has been assembled to review the evidence.’</p>\n<p>Her co-anchor picked up the story then. ‘Following the viewing of the first video, a second was shown. The second video was CCTV footage from the Siberian HYDRA bunker. Tony Stark learned the truth by watching the aforementioned videotape with the killer standing only a few feet away from him. After an attempt at denial, Steve Rogers admitted he had known and intentionally kept the information to himself. When Tony Stark confronted him in prison at a later date, in the face of Mr. Stark’s quite understandable anger Rogers attempted to shift the blame to Miss Romanova by stating, quote, “we decided it was best not to bring up old wounds” and then revealing that the former Russian spy had been aware of the fact as well.’</p>\n<p>***</p>\n<p>A group of kids sat in a diner, arguing over a newspaper article.</p>\n<p>‘Well, you can’t blame him for thinking Bucky’d be put to death,’ one kid argued. ‘He is from the 40s. They did that stuff back then!’</p>\n<p>‘So what?’ another kid argued. ‘The other guy – that Logan guy – he was born in the old days. He didn’t grow up with cars, or phones, or computers, and he uses all that stuff.’</p>\n<p>A third kid lifted his head from his milkshake. ‘How come he’s alive anyway?’</p>\n<p>The second kid looked over at him. ‘They said he’s got this weird genetic quirk that means he heals quick and he ages slow. Lots of people think it was an accident.’</p>\n<p>‘Then how could he beat up two super-soldiers?’ the first kid asked.</p>\n<p>‘Hold on.’ The third kid pulled out his phone. ‘I’ll look it up.’ After a moment of searching. ‘Oh, he was illegally experimented on in the 70s. It was a Stark building, and the guys lied to Howard Stark about what they were actually doing, but the older Stark found out anyway. They reckon he got his super-strength there.’</p>\n<p>***</p>\n<p>‘Okay,’ the therapist said. ‘so tell me precisely what you’re confused about.’</p>\n<p>‘I find...emotions in general to be very strange,’ Vision said. ‘Wanda did assault me, after I thought there was genuine affection between us, pushing me through 19 floors of concrete, but I still felt incredible concern for her through the fight at the airport. Even now I am shocked when I learn of her actions against the people who were supposed to be her allies. I do not understand her self-serving actions at all.’</p>\n<p>The therapist nodded, but inside his mind was racing. The Vision had been sent to him in order to try and make sense of his emotions. He had only lived for a single year, and he had all the emotional understanding of a child of that age. At the same time, he was far more intelligent and logical than any human of equivalent age.</p>\n<p>How did one go about treating a synthetic human who had been on the recieving end of a one-sided abusive relationship with a woman who had clearly and shamelessly taken advantage of him? It was a completely unique situation. But his patient was relying on him to help him through this and Tony Stark had determined him a trustworthy therapist for Vision to confide in.</p>\n<p>‘Emotions are difficult for all of us,’ he explained. The first thing would be to reassure him that nothing he was thinking or feeling was unusual in any way whatsoever. The Vision was here because he needed to talk through the emotions and confusion that he was feeling as a result of the events of the media-dubbed Civil War. ‘What was your relationship with Wanda like prior to the event?’</p>\n<p>It would probably be better to start at the beginning and work through the sequence of events as they happened.</p>\n<p>‘I had thought it was a positive one,’ Vision said. ‘But she would often be projecting. I now realise that she was inducing the antagonism upon Tony at these times.’</p>\n<p>Oh...dear.</p>\n<p>‘You weren’t affected?’</p>\n<p>‘No, I don’t think so. I would sense the projections happening but they seemed to bounce right off of this,’ he touched a finger to the stone imbedded in his forehead, ‘and I never felt any antagonism for Tony myself. I do wonder if the stone was protecting me.’</p>\n<p>Quite likely.</p>\n<p>***</p>\n<p>‘So what happens now?’ Peter Parker asked as he and Mr. Stark walked through Stark Industries.</p>\n<p>‘Logan’s joining the X-Men,’ Tony said. ‘The UN’s got some recommendations for a new batch of Avengers. Barnes will likely spend quite a while in a psychiatric hospital. Turns out the brainwashing program worked by tearing up a fair bit of his grey matter.’</p>\n<p>‘Is that why it didn’t work on Logan?’ Peter asked.</p>\n<p>‘Yup.’ Tony chuckled. ‘Turns out, the reason those other Winter Soldiers didn’t work either was because Logan not only induced doubt on them but he induced a pack mentality in them and they turned on their handlers. It was almost like what happened to Barnes when Rogers was around.’</p>\n<p>Peter nodded. ‘So how did that Zemo guy play it so well? Can he see the future or something?’</p>\n<p>‘Nope,’ Tony said. ‘When HYDRA decided to kill someone, they would have their profilers study the target’s behaviour for a while, as well as the behaviour of the people around the target, in order to find the cleanest way to kill them without being caught. Zemo was one of these profilers. He was trained so he could pick out Rogers’ behaviour in a short amount of time and the behaviour of the rest of us too. Apparently, Rogers had a small group to study compared to what he’s used to.’</p>\n<p>‘So it was really easy.’</p>\n<p>‘Very easy.’</p>\n<p>‘What about Scott Lang?’ Peter asked. ‘He broke parole, didn’t he?’</p>\n<p>‘Yup.’ Tony looked amused. ‘His ex-wife called Pepper to pass on an apology for his behaviour to me and explain that he’s an idiot.’ He paused. ‘I also got a phone call from Hope Van Dyne to apologise for the exact same thing. She also made her father apologise to me.’ Tony grinned. ‘On facetime. The man looked so constipated.’</p>\n<p>Peter looked adorably confused, like a puppy who couldn’t figure something out. ‘What’s his problem with you?’</p>\n<p>‘A feud with my father, basically.’ Tony frowned. He wouldn’t say it to Pete, but the fact was Tony had found the incident for that feud in with the S.H.I.E.L.D. files. Howard had expressed an interest in the Pym Particles and Hank Pym had said “no”. That was it. Then suddenly Pym was accusing Howard of having interferred with them.</p>\n<p>Howard hadn’t denied it, had instead behaved in an exasperated manner. It had been translated to “yes, I did it, and I’m annoyed at being caught”. However, the others who’d known of it had later been exposed as HYDRA agents: Alexander Price and Mitchell Carson. It indicated to Tony that Howard just couldn’t be bothered defending himself against people who wouldn’t listen. <em>Was dad subject to the same kind of scapegoating that the Avengers did to me?</em></p>\n<p>Maybe he should look into that.</p>\n<p>‘That doesn’t make sense!’ Peter insisted. ‘That’s your dad, not you!’</p>\n<p>Tony smiled. ‘Happens a lot actually. People from the same family often get tarred with the same brush. It’s the same reason stereotyping happens. It’s just easier to make generalisations than it is to get to know independant people.’</p>\n<p>Peter sighed. ‘So...what happens with the Avengers now?’</p>\n<p>‘We reform,’ Tony said. ‘You still want to be an Avenger?’</p>\n<p>‘Yeah!’ Peter nodded so much Tony was sure his brain was shaking around in his skull.</p>\n<p>‘Well, you’ll go into training until you’re 18 then,’ Tony said. ‘They’re drawing up a set of guidelines for Avengers recruitment and I’m sure minors will come into it if they haven’t already.’</p>\n<p>‘18?’ Peter groaned. ‘But that’s <em>ages</em> away!’</p>\n<p>Tony grinned. ‘Well, it’d be the same if you wanted to join the police force. Besides, Pep would kill us if we tried to skip it.’</p>\n<p>Peter winced. ‘Miss Potts is really scary.’</p>\n<p>‘Yes, she is.’ Tony looked over him. ‘How’d your aunt take it?’</p>\n<p>‘She thought I was joking at first,’ Peter said. ‘So I stuck to the ceiling. Then she got mad at me.’</p>\n<p>‘Of course she did. Her 15 year old nephew is running around fighting crime. That’d send any parent through the roof.’</p>\n<p>Peter grimaced.</p>\n<p>‘In the meantime,’ Tony flicked up some schematics, ‘I designed a new suit for you. Tell me what you think of this.’</p>\n<p>With a grin, Peter trotted over.</p>"
}