{
  "id": "13278486",
  "url": "https://archiveofourown.org/works/13278486?view_full_work=true",
  "author": [
    "gveret"
  ],
  "title": "Hey, Are You Lena Luthor?",
  "rating": "Mature",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "F/F"
  ],
  "fandoms": [
    "Supergirl (TV 2015)"
  ],
  "relationships": [
    "Kara Danvers/Lena Luthor"
  ],
  "characters": [
    "Lena Luthor",
    "Kara Danvers"
  ],
  "additional_tags": [
    "Soulmate-Identifying Marks",
    "Generalized Pining",
    "Lesbian Disaster Lena Luthor"
  ],
  "language": "English",
  "series": "",
  "published": "2018-01-05",
  "completed": "2018-03-08",
  "words": "5,062",
  "chapters": "2/2",
  "comments": "389",
  "kudos": "9,290",
  "bookmarks": "881",
  "hits": "84,798",
  "summary": "<p>Those first words a soulmate is destined to say to you are supposed to be magical, indescribable, life changing. But for Lena Luthor, they're just an everyday occurrence.</p>\n<p>(In which Lena has the most infuriatingly mundane soul mark.)</p>",
  "notes": "<p><b>Warning</b> for mild violence.</p>\n<p> </p>\n<p> <a href=\"https://archiveofourown.org/works/14946737/chapters/34632884\" rel=\"nofollow\">French translation by LAAdelineB</a></p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Hadn't really planned on a part 2, but here it is anyway. Kara has no superpowers in this AU, btw, so there's no Supergirl. Hope you enjoy!</p>\n<p><b>Warning</b> for reference to child death (Krypton related), descriptions of injury, and some mild sexual content at the end. Just foreplay though, no smut, sorry!</p>",
  "text": "<p> </p>\n<p>\"Hey, are you Lena Luthor?\"</p>\n<p>Lena's heard these words dozens of times. When being accosted by reporters as a child; when fans of alien genocide want her to tell them what brand of deodorant Lex uses; when she checks into a hotel room or takes a taxi or makes any sort of purchase in person. Such a commonplace, innocuous sentence. And yet, every time she hears it, there's a little jolt, a tension of recognition, of hope and anxiety, because these are the words that have been with her longest, longer than Lena Luthor has even been her name. They're the words she was born with. The first words her soul mate is destined to say to her.</p>\n<p>\"Hey, are you Lena Luthor?\" asks the mailwoman at her door.</p>\n<p>She's short and solid and curvy, shiny brown hair in a sloppy bun tucked under her hat, beads of sweat at her hairline and above her lips, full brown lips, their pretty upper curve interrupted by an old, puckered scar.</p>\n<p>It happens so often, means so little, and yet, every damn time, Lena can't help the thought flashing through her mind: <em>Is she the one…?</em></p>\n<p>\"Yeah?\" Lena says, voice too high, breaking mortifyingly in the middle. She clears her throat. \"That's me.\"</p>\n<p>The mailwoman doesn't appear fazed in the least. \"Great,\" she says, brisk and professional. \"Sign here please.\" As she extends the clipboard for her to sign, Lena can make out the words <em>'seat taken?'</em> on the courier's wrist, peeking out underneath her shirtsleeve.</p>\n<p>.</p>\n<p>.</p>\n<p>Maybe it's silly to put so much stock in such a fatalistic and fundamentally shallow tradition. Certainly, it isn't too difficult to find dating opportunities where soul marks are irrelevant. Dating opportunities where Lena's last name isn't relevant, on the other hand, are slightly harder to come by. Especially within National City's limited lesbian dating pool. Even more especially when Lena is trying to avoid terrifying bigots.</p>\n<p>Considering her prospects, and her overlarge empty apartment, and her holidays spent eating takeaway at her desk, and her nights cuddling her pillow as she sleeps, it's rather hard for Lena to resist the allure of the destined partner, the cosmically ordained match, if only as an unattainable but comforting fantasy. Someone who is suited perfectly for her, who could appreciate her strengths and help her wrestle with her shortcomings, who could disregard her reputation and see her for who she is; someone who could <em>want</em> her in spite of everything.</p>\n<p>It is silly. She knows it is. But what can she do, she's silly sometimes. And those damned words continue to haunt her.</p>\n<p>.</p>\n<p>.</p>\n<p>\"Hey, are you Lena Luthor?\"</p>\n<p>Lena glances sideways at the well dressed man who'd asked the question, her lone lift mate. He's short and young and probably good looking, square jawed and whatnot.</p>\n<p>Since this is her fucking company, she doesn't have to deal with this nonsense a lot, here. Work, her one refuge. This man must be new. How fortunate that she's managed to get stuck in an elevator with him specifically. </p>\n<p>She makes a quick internal estimation. Her office is on the 46th floor; L-Corp escalators move quickly.  She takes a deliberately drawn out breath, adjusts the straps of her bag on her shoulder.</p>\n<p>\"No, sorry,\" she says. \"But I get that a lot.\" The doors ding open just as she finishes speaking, revealing the large sign reading <em>'Lena Luthor's Office'</em>.</p>\n<p>Lena steps out, pleased with herself. She'd timed that perfectly.</p>\n<p>.</p>\n<p>.</p>\n<p>Wrist cuffs and detached sleeves were very popular for a while in the early aughts, but have since fallen out of fashion. Since there's usually nothing very revealing in any one person's first sentence to any other, the need to cover up the marks is mostly seen as somewhat anachronistic and puritanical. Lena knew a boy once in middle school whose wrist read <em>'Blow me in the bathroom?'</em>; he had thought it was hilarious, and since he'd been a very charismatic kid, managed to leverage it quite effectively for social capital. </p>\n<p>One interesting consequence of all the bare-armed summers in the information age is the catfishing. During one hospital stay Lena had watched a documentary about a serial soulmate grifter who would tap into various surveillance footage displaying people's marks, track them down, engineer a meeting, say the words and later tattoo the victim's response on his own skin, only to remove the tattoo and start over.</p>\n<p>Of course, most people never get their credit card hacked, much less their love life. But Lena prefers to wear only long sleeves in public, anyway. For Lena, walking around with her mark exposed isn't just potentially embarrassing or even hazardous; she's carrying the Luthor brand, quite literally.</p>\n<p>.</p>\n<p>.</p>\n<p>\"Hey, are you Lena Luthor?\"</p>\n<p>Lena turns around. Behind her is a tall woman with glasses and dark eyes and a compelling relaxed posture. Her speaking voice had been rich and low and Lena fights not to create a mental image of her arms around her.</p>\n<p>\"Hi, hello!\" Lena stammers, slightly breathless, praying to say the right words. \"Um. Yes, I—\"</p>\n<p>The woman slugs her in the face.</p>\n<p>Lena's head snaps sideways from the impact, her feet stumble half a step. She feels the tissue of her cheek crush against the bone. Luckily the woman isn't wearing any large rings and didn't aim for Lena's mouth; none of the skin tears. She's going to be bruised and swollen and hurting, but at least there won't be blood.</p>\n<p>Unless the woman is aiming for another round, of course. Lena blinks furiously to clear her spotty vision and brings her arms up. But the woman just shakes out her hand and steps back, then simply stands there, glaring.</p>\n<p>She waits for Lena to recover, probably so that her words will land with more impact. \"That's for my family's bakery,\" the woman says then, and turns to go.</p>\n<p>\"Oh, what happened to it?\" Lena asks dazedly.</p>\n<p>The woman's eyes flash. \"Your brother destroyed it!\" she snaps. \"Our insurance was shit. We can't start over from nothing. My parents are over sixty and could lose their <em>home</em> because of you.\"</p>\n<p>\"Oh,\" Lena says again. \"I'm sorry.\"</p>\n<p>The woman stares at her for a long moment. Then she grimaces, and appears to consider hitting Lena again; but she just turns around and walks away.</p>\n<p>\"Okay. Have a nice day,\" Lena calls after her.</p>\n<p>Lena walks in the opposite direction for a couple of blocks, completely on autopilot, for no purpose other than to put some distance between the angry attractive woman and herself. Then she takes a cab to her office, where she plops her face onto a bag of crushed ice and sobs angrily for twenty five minutes.  </p>\n<p>.</p>\n<p>.</p>\n<p>Later, she looks up bakeries Lex had blown up, finds one in National City that had belonged to a large family with dark eyes, and buys a storefront and its building in their name.</p>\n<p>.</p>\n<p>.</p>\n<p>Apologizing is as good as an admission of guilt, and according to her lawyers she should never ever do it. According to her therapist, accepting the blame for her family's actions is unreasonable and counterproductive. But the news says she reaps the fruits of her brother's atrocities, and in many ways they're right.</p>\n<p>The tedious solution to all of these quandaries is, of course, another press conference, her favorite pastime. To which she shows up with a puffy face and one open eye and a half. The cherry on top of the exhausting overly rehearsed sundae.</p>\n<p>\"Ms. Luthor, what would you say to those who'd accuse you of attempting to bribe your most vocal critics?\"</p>\n<p>\"If you weren't complicit, why do you continue to pay off your brother's victims? Is that part of a settlement?\"</p>\n<p>\"What can you tell us about the jump in your stocks when your brother's sentence was announced to be extended?\"</p>\n<p>\"Hey Luthor, who punched you in the face!\"</p>\n<p>It goes on and on.</p>\n<p>.</p>\n<p>.</p>\n<p>Once the conference is over Lena gracefully slinks away to a nearby coffee shop. Not too nearby; she skips the closest half dozen and picks a crappy, large chain place. She'd really like to avoid any kind of attention. She sits at the far corner table and orders a pot of tea, drinks half a cup and orders some hot chocolate, extra whipped cream instead.</p>\n<p>Lena shamelessly monopolizes the table for over three hours, until long after the CNN live feed has stopped streaming. The café staff can likely sense she'll tip well, and don't pass by her table or drop subtle hints. One waiter with an awful fashionable beard did approach her around the second hour mark. \"Hey, are you L—\" he managed to say before thankfully balking under the weight of her black-eyed glare and backing away. Lena doesn't know what she'd have done if her intimidation skills had failed her just then.</p>\n<p>Twenty minutes past the third hour, a handsome woman in a cheap suit and wavy blonde hair walks in. A nametag clipped to her lapel reads <em>'CatCo Worldwide'</em>. Lena shrinks back in her seat, attempting to blend into the synthetically cozy background, praying not to be noticed. At least her unfortunate penchant for staring at attractive women has given her a heads up.</p>\n<p>The reporter orders nine different kinds of pastries and an iced coffee (in <em>January</em>). Two overflowing trays in her hands, she makes her way over and sits at the table exactly in front of Lena. Of course. And, of course, she looks up, of course catching Lena's eye, <em>of course </em> flashing her the most dazzling, pastry-filled smile Lena's ever had directed at her.</p>\n<p>Lena can feel the moment of recognition. The reporter freezes, then resumes chewing much faster, lowering the bear claw and brushing confectioner's sugar from her face. Lena has thrown a couple hundred dollar bills on the table and is rushing out the door before the woman can open her mouth.</p>\n<p>Lena almost makes it to the crosswalk when she catches up.</p>\n<p>\"Hey, are you Lena Luthor?\" the pretty blonde reporter asks, reaching out to grab her arm.</p>\n<p>Lena grinds her teeth and shakes off the touch, rattling with hurt and directionless fury. \"Hey, go <em>fuck </em>yourself!\" she spits out.</p>\n<p>The reporter stares at her in apparent shock, lightly gaping; the sight fills Lena with grim satisfaction. But then the woman blinks, and takes a bold step forward and further into Lena's space, face blooming into a lovely, slow smile. She aims again for Lena's arm and Lena is too confused now to evade.</p>\n<p>\"Oh, gosh, I didn't expect—you're so pretty,\" the woman babbles. \"Will you let me see your forearm?\" She laughs, short and ecstatic. \"Never thought being cussed at could feel so nice.\"</p>\n<p>Lena's been hounded by reporters before, but never quite like this. \"What the f—get off me!\" she splutters, gathering her arm close to her chest.</p>\n<p>The woman promptly lets her go, lifting her hands in the air, palms open. She takes a step back, but she's still too close for comfort. Lena eyes her warily, clutching at her sleeve.</p>\n<p>\"I'm sorry, that was so rude, I'm just—\" The woman shakes her head, as if she can't believe her own behavior. \"Look, here,\" she says gently, placating, and slowly reaches for her own arm. She unfastens her cuff and tucks her fingers beneath it, pulling down. The sleeve gets stuck partway down her wrist, the stiff suit jacket refusing to budge.</p>\n<p>The woman shoots Lena a look that seems to have been aiming for apologetic but falls severely short. She's still grinning madly, for one thing. \"I've always wondered what I'd do to make you so mad at me,\" she says as she strips out of the jacket and rolls up her shirtsleeve in quick, practiced motions. \"Turns out asking your name was all it took. That's a relief! I was worried I'd be a much worse asshole.\"</p>\n<p>Lena stares at her silently. She might be the one gaping this time. She's having trouble processing this woman's words. Surely she isn't implying that, that Lena is…</p>\n<p>\"Anyway, hi,\" the woman concludes cheerfully. \"My name's Kara Danvers. I think I might already know yours.\"</p>\n<p>Kara Danvers holds out her half-exposed arm for Lena to shake. And there, spelled in clear block letters in distinct greenish ink:</p>\n<p>\n<em>HEY, GO FUCK YOURSELF!</em>\n</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>When Kara was three she asked her dad what her mark meant.</p>\n<p>\"I don't know, sweetie,\" he said. \"Why don't you ask aunt Astra? She can take you to the archives and you can look it up there.\"</p>\n<p>But the archives were boring, and Kara would much rather ask aunt Astra to take her to get twellian sugar paste instead.</p>\n<p>.</p>\n<p>.</p>\n<p>The marks hadn't had much cultural significance at all on Krypton for millennia. This wasn't unusual; for most space faring civilizations, the pool of potential soulmates was so unimaginably wide that the odds of ever running into them were rather marginal. Some people whose marks were written in a particularly localized language would travel to its planet of origin, but most preferred not to upturn their lives for an uncertain chance at something that might not be worth much in the first place. The separation rates weren't significantly lower than those of other unions, anyway.</p>\n<p>Most adults paid no more mind to their marks than to any mole or scar. They were an occasional source of great childhood fascination, though.</p>\n<p>.</p>\n<p>.</p>\n<p>When Kara was five her friend Tal-Or from animal studies showed her the thin, loopy script on his arm, so different from Kara's mark.</p>\n<p>\"My mom says it says <em>'I like your ship'</em> in Grikkan,\" he explained. \"Means I'm gonna have my own ship.\"</p>\n<p>Kara gasped. That was the coolest thing she'd ever heard. \"<em>Cool</em>!\"</p>\n<p>\"What's yours say?\"</p>\n<p>\"<em>'Bloopidy bleep bloop</em>,'\" Kara cleverly improvised on the spot. \"My soulmate's a robot.\"</p>\n<p>\"Really?\"</p>\n<p>Kara nodded earnestly. She'd made this up, and now it was real. \"Big robot that can fly and shoot lasers from its eyes. Not like a library robot, like a… fighting robot.\"</p>\n<p>\"But robots don't have soulmates,\" Tal-Or said uncertainly.</p>\n<p>\"Mine does.\" She thrust her arm at him, waving it in his face. \"See? Says right here. <em>Bloopidy, bleep, bloop.</em>\"</p>\n<p>Tal-Or examined the strange, blocky print carefully. \"Okay,\" he said, satisfied the translation was up to par. \"I want a robot soulmate too.\"</p>\n<p>\"Trade me your ship for it!\"</p>\n<p>Tal-Or ended up surrendering his ship, his captaincy and his pocketful of glowy polymer scraps for Kara's fake robot soulmate. He maybe hadn't been the most seasoned negotiator, back then.</p>\n<p>Wouldn't really get the chance to become one, either.</p>\n<p>.</p>\n<p>.</p>\n<p>Earth, as Kara would come to discover, is a little different. On Earth, the marks are a cultural lynchpin. They have books and movies and laws and customs revolving entirely around them. For a while you were supposed to hide them, then you were supposed not to care if anyone saw them. Sometimes you should comment on them, sometimes you really, definitely, absolutely shouldn't. They were old-fashioned or romantic or oppressive, but they were always meaningful. It was one more set of confusing, clandestine rules Kara had to get used to once she'd arrived.</p>\n<p>There were a lot of Earth things that took getting used to. The gravity, the noise, the figures of speech. But this, as well as the food, ended up being frighteningly easy to embrace.</p>\n<p>It wasn't an accident, that her parents had sent her to this planet where people speak the language on her wrist. It couldn't be. It had to mean something. In all of this, the loss and the finality and the sheer terrible lack, there <em>has</em> to be some meaning.</p>\n<p>.</p>\n<p>.</p>\n<p>When Kara was eight she went to the tertiary Argo city archives on a research assignment, and as she kept accidentally bringing up untranslated alien texts, something occurred to her.</p>\n<p>\"Oh, yeah, that looks like some kinda Earthish,\" said Noora, Kara's uncle's friend's second cousin who'd once taught her how to spit further than anyone and now studied something boring about words and worked in the archive.</p>\n<p><em>Earthish? </em>Kara wrinkled her nose. Earthians didn't even have intergalactic travel. They weren't in any coalitions. They were pretty useless. \"What's it mean?\"</p>\n<p>\"Hm,\" Noora said, taking a quick scan of Kara's arm and turning to her console. \"Hold on.\"</p>\n<p>Kara plopped in one of the comfy but too tall chairs and kicked her legs while she waited. So she had an Earthian soulmate or whatever. At least they didn't look too weird. She heard somewhere that some people think Kryptonians were descended from them, though that sounded silly, Earth is so far away. And on second thought, having a really weird looking soulmate would be kinda cool, actually.</p>\n<p>\"All right, here we go,\" Noora said finally. \"Let's see… Says, 'Hey!' like an exclamation… Oh.\" She hesitated, quirked her lips. \"It says, uh, <em>'Hey, buzz off'</em>.\"</p>\n<p>\"What!\" Kara exclaimed, outraged. Not only was her soulmate really primitive and far away and regular looking, he was also really rude. \"My soulmate sucks. I don't like him. I don't want him.\"</p>\n<p>\"Kara, honey, that's okay. You never have to be with someone you don't want to. You know that, don't you? You are the master—\"</p>\n<p>\"The master of my destiny, and my body is my own,\" Kara recited tiredly. \"Yeah, I know.\"</p>\n<p>Noora snorted. \"Okay, that's good.\"</p>\n<p>\"Just sucks,\" Kara mumbled, kicking her legs some more. \"I hoped he would be, I don’t know. Nice.\"</p>\n<p>\"There are many nice people in the universe,\" Noora told her. \"You'll find them, if you wanted to. And you'll just have this really cool Earthish tattoo on your arm.\"</p>\n<p>\"A really <em>rude</em> Earthish tattoo,\" Kara said sullenly.</p>\n<p>Noora laughed. \"Okay. I'm a busy woman. Bye, Kara. Go sulk somewhere else.\"</p>\n<p>Kara did go sulk somewhere else. Sulked, and did her homework, and vowed to track down her soulmate, confront him, and tell him straight to his face <em>exactly </em>what she thought of him.</p>\n<p>.</p>\n<p>.</p>\n<p>\"I'm so happy I've found you,\" Kara says straight to Lena Luthor's compelling, expressive, injured face. \"Sorry. Um. That looks painful.\" Kara points at her own eye. Lena Luthor blinks silently at her. \"I'm so sorry I startled you, earlier. I was just really, um, really excited. It must have been scary, after that happened to you.\"</p>\n<p>Lena Luthor swallows visibly, stares at Kara, and shakes her head. \"It's fine,\" she croaks, looking and sounding the least fine that a person can be.</p>\n<p>\"Uh—I don't think it is? You look like you're gonna pass out.\" Kara reaches out hesitantly. \"Can I touch you? Maybe you can lean on me.\"</p>\n<p>\"No,\" Lena croaks some more. \"I don't think so.\"</p>\n<p>\"Okay, well,\" Kara says helplessly, \"can I buy you coffee? No, we were just in a coffee shop, you've probably already had coffee. Ice cream? Do you like ice cream? Tell me what you like, I'll buy you some. Unless it's really expensive, like caviar, I guess.\" Kara laughs nervously. She really wishes Lena Luthor would give her anything to go on, would do anything at all except sway slightly in place, looking worryingly queasy. \"I'd, um, I'd really like to get to know you.\"</p>\n<p>\"Okay,\" Lena Luthor practically whispers.</p>\n<p>\"Okay?\" Kara repeats, pleased and just a little taken aback. She's generally not the best at interpreting social cues, and Lena Luthor's seem to be even less intuitive than usual. \"Do you like Tex-Mex?\"</p>\n<p>.</p>\n<p>.</p>\n<p>\"So…\" Kara says, glancing at Lena over her oversized fajita wrap, shooting her a hopeful smile. \"I guess we're soulmates.\"</p>\n<p> Lena Luthor stares at her, her one uninjured eye widening briefly, and bursts into tears.</p>\n<p>Kara drops her fajita to the ground in her haste to make herself available for physical reassurance.</p>\n<p>\"Hey, hey, it's gonna be okay,\" she soothes, trying very hard to mask her distress. She hates seeing people cry. \"You don't have to do anything you don't want to. You're, um, you're the general of your future. You know? I'm sorry I came on so strong. It's okay if you don't wanna, uh, pursue anything. The marks don't mean anything unless we want them to.\"</p>\n<p>\"I thought—it seemed like—<em>never</em> maybe—\" Lena Luthor sobs haltingly, words muffled by the hands she's pressed to her face; Kara strains desperately to scrape together her meaning. \"But you—and—and—a <em>reporter, </em>you <em>know</em>—And I told you to go fu-fu-<em>fuck</em>—\"</p>\n<p>\"Oh, no, that's okay!\" Kara rushes to reassure her. \"Don't worry about it. I'm glad you did.\"</p>\n<p>Lena Luthor lowers her hands to glare at her suspiciously. \"What? Wh-why?\"</p>\n<p>\"I used to think you'd be a very rude man,\" Kara tells her. \"But you're not, huh? You're Lena Luthor. Right?\"</p>\n<p>Lena starts, hands curling into fists. She certainly seems to have some interesting reactions to hearing her own name. She glances at Kara, then away, gives a jerky nod.</p>\n<p>\"Right. You funded the LFNC Children's Hospital? You produce that alternative epinephrine autoinjector, selling at a 4.5% profit margin?\"</p>\n<p>Lena nods again.</p>\n<p>\"So you're probably not a horrible person, are you?\"</p>\n<p>Lena sniffles noisily, wipes roughly at her uninjured eye. \"I, I don't know.\"</p>\n<p>\"Well, we can figure it out later,\" Kara offers generously. \"I'm an alien, by the way. What do you think about aliens?\"</p>\n<p>Lena's face rapidly turns bright red. She blinks at Kara, frowning fiercely. Kara spends a moment trying to figure out whether she's embarrassed or pissed or surprised; then Lena actually <em>hisses</em>. So that solves that conundrum. \"Is this the sort of thing you ask people when you're trying to calm them <em>down</em>!\"</p>\n<p>\"I mean, it's good to get this stuff out of the way—\"</p>\n<p>\"What kind of reporter are you! Aren't you supposed to open with <em>softballs</em>?\"</p>\n<p>\"I hate these sports metaphors,\" Kara mumbles, feeling suddenly on the defensive.</p>\n<p>\"You don't do that on a date either!\" Lena continues fervently. At least she's no longer crying. \"'Where are you from! What do you do! Do you have any hobbies!'\"</p>\n<p>\"I did sort of ask about your favorite food,\" Kara interjects timidly.</p>\n<p>\"Not, 'Hey, are you Lena Luthor? Are you a horrible person? Do you hate aliens? Are you a mass murderer like your brother?'\"</p>\n<p>\"Oh. Okay.\" Kara already knows where Lena Luthor is from and what she does, of course. \"Um… do you have any hobbies?\"</p>\n<p>All at once, Lena seems to deflate. Her posture droops, and she goes back to touching her face. \"I like engineering,\" she says quietly. \"I oppose the deportation efforts. I haven't participated publically, though perhaps I should. I am trying to undo as much of the damage my family's caused as I can. I know it doesn't always go very well, of course.\" Kara tries not to stare at her black eye too obtrusively. \"I'm sorry I yelled.\"</p>\n<p>She peers at Kara, looking actually maybe kind of hopeful. Kara gives her a tentative smile, slowly holds out her hand in offer.</p>\n<p>Lena Luthor takes it.</p>\n<p>Her hand is rather cold. Kara easily manipulates it so their fingers thread together and squeezes steadily. Lena releases a quiet sigh. They sit silently for a little while, Lena's hand slowly warming in Kara's.</p>\n<p>Kara points at Lena's burrito with their tightly linked hands. \"So, uh… are you gonna finish that?\"</p>\n<p>\"<em>Ha</em>!\" Lena exclaims sharply. She hunches slightly forward, hands Kara her untouched burrito and curls her free hand over a scarily attractive, toothy grin.</p>\n<p>She<em> laughed</em>. That was a laugh. Kara has made her soulmate laugh<em>.</em></p>\n<p><em>Way cooler than a big flying robot, </em>Kara thinks as she stuffs half of Lena Luthor's burrito in her mouth.</p>\n<p>\"Do you, maybe—\" Lena says. \"Would you like to go back to my place?\"</p>\n<p>Kara struggles to swallow her unconscionably large bite; it takes too long, so she just nods vigorously instead. Lena gifts her with another one of those heady smiles.</p>\n<p>.</p>\n<p>.</p>\n<p>Lena Luthor's home is nothing like Kara had imagined. Well, it is big and fancy and very well secured, so maybe it's <em>something</em> like she'd imagined. But it's also sparsely decorated, starkly lit, and impressively cluttered; no horizontal space is free of some combination of binders, loose papers, tools and various tech. This place feels more like a warehouse or a movie scientist's workspace than a home.</p>\n<p>\"That was the <em>worst</em> first date I've ever been on,\" Lena says with a raw laugh as she leads Kara inside by the hand and kicks several unidentified items out of the way. \"And I've had some really shitty ones, too.\"</p>\n<p>\"Oh. I'm sorry.\"</p>\n<p>\"Why? Did you tell me to go fuck myself, freeze up, start crying and raising your voice for no reason?\"</p>\n<p>\"It wasn't for no reason,\" Kara protests, feeling defensive on Lena's behalf.</p>\n<p>Lena raises her eyebrow at her. \"Thanks for sticking around,\" is all she says.</p>\n<p>Lena lets go of Kara's hand and walks into her kitchen. Kara takes the opportunity to look over some of the papers on the island separating the kitchen from the living room. They're graph papers, filled with preliminary designs. Kara can't tell at a glance what their function is, but there's something almost soothing in their intricate, clean lines, the tiny, scattered notes filling up empty spaces.</p>\n<p>Lena returns with a half eaten chocolate bar, glancing at the papers over Kara's shoulder. \"Impressed?\" she teases, chocolaty breath blowing over Kara.</p>\n<p>\"Actually, yeah,\" Kara admits easily. \"You're impressive.\" She points at the now empty candy wrapper, the last bite disappearing between Lena's lips. \"You didn't bring one for me?\"</p>\n<p>Lena shrugs. \"You ate my entire burrito.\"</p>\n<p>She walks closer, framing Kara between her body and the kitchen island. Touches Kara's hip, a brief caress. Kara turns to face her fully. Lena Luthor, the infamous heir to a bloody fortune who'd bought a bakery for the stranger who punched her in the face. Jittery and messy and smelling like chocolate, touching Kara's hip and making comments one menu item removed from Earth innuendo.</p>\n<p>\"You are incredibly handsome,\" Lena Luthor says. \"Haven't had a chance to tell you that.\"</p>\n<p>Kara feels her face heat up. Her gaze is drawn to Lena's eye. It looks even more blatant and unwelcome up close.</p>\n<p>Her hand lifts unconsciously, instinctively wanting to comfort by touch, only realizing when Lena shifts subtly. Kara hesitates. \"Can I…?\"</p>\n<p>Lena smiles sardonically at her. \"I don't know, are you a medical doctor?\"</p>\n<p>\"Well—well, I wouldn't look at it, like, medically. More like, romantically?\"</p>\n<p>Lena's smile shifts and then fades. She looks intently in Kara's eyes, unwavering. Then she nods.</p>\n<p>Kara breathes in slowly and steps closer. She was already close; the angle of her elbow is less comfortable now, but she wanted the proximity. She touches Lena's jaw; Lena lifts her hand to brush over the inside of Kara's palm. Kara swallows, holds her breath, ghosts her fingers over the bruise under Lena's makeup, the broken blood vessels beneath the skin. Careful, light, purposeful.</p>\n<p>\"You really are an alien,\" Lena murmurs, and tilts her chin forward, and her lips slightly part, and Kara kisses her.</p>\n<p>Lena makes a sound, soft but fierce, slides two fingers into the space between the buttons of Kara's shirt, brushing over the periphery of her sports bra. Kara grabs at her blindly, over her lower back, her ass, fingers digging into soft flesh, and there's that sound again, and Lena gives her shirt a tug, and a button pops free—</p>\n<p>Kara walks her back to the sofa; Lena brushes several newspapers and a pair of earmuffs of all things out of the way while Kara climbs on top of her. Lena makes a face, wiggles around, pulls a small condom-covered vibrator out from under her back and tosses it to the floor.</p>\n<p>\"What—what—\" Kara stammers.</p>\n<p>\"Shh.\" Lena places a cool finger over Kara's heated lips. \"I'm a slob. Kiss me.\"</p>\n<p>Kara kisses the finger, instead, parting her lips around it so she can suck lightly on the tip. Lena hisses, lifts her hips into Kara. Kara sucks the finger deeper in her mouth, licks messily at the sensitive web between fingers. Lena bucks again, tugging Kara's body to her by her belt.</p>\n<p>Kara releases Lena's index finger, moves on to mouth at the inside of her middle finger, sloppy and wet and eager.</p>\n<p>\"<em>Fuck</em>,\" Lena mutters. She shifts her hand, sticky from Kara's mouth, presses it to her cheek. \"Okay, I get it, I get it. You're terribly sexy. Come here.\"</p>\n<p>Kara bends her arms, lowering herself to brush her mouth over Lena's. Her eyes close, breath coming shallow and rough through her nose. Lena runs her tongue at the seam of Kara's mouth, and Kara's lips open for her, welcoming every new sensation. More of her weight rests on Lena now, warm pressure pushing back against her stomach, her thighs, her breasts—she can feel the raised embroidered pattern of Lena's bra—</p>\n<p>\"I have to ask you something,\" Lena says, letting go of their kiss. She gazes up at Kara, tucking her fingers beneath the waist of Kara's pants, making her clench. \"I know it's a bit ridiculous, after I invited you over, and kissed you, and let you touch my eye, romantically, and you've actually already told me, but you'd just caught me at a stressful time and I was somewhat distracted—\"</p>\n<p>\"What is it?\" Kara interrupts her, slightly out of breath, ready to offer up anything, if she wanted it.</p>\n<p>Lena chews the inside of her lip, glances away and then back, blinks earnestly. \"What, uh—what's your name, again?\"</p>\n<p>.</p>\n<p>.</p>\n<p>Kara had spent a portion of her childhood in righteous indignation over how rude her soulmate appeared to be. Then she'd feared she would end up being the rude one. Then it became obvious the whole thing had more to do with defensiveness and hurt than anything. Now, seems her initial assumption maybe had some merit, after all.</p>\n<p>She wouldn’t trade her weird rude soulmate for the world, though.</p>\n<p>.</p>\n<p>.</p>\n<p>(\"Kara Zor-El Danvers,\" Kara says breathlessly, fighting to contain her laughter. \"Z-O-R hyphen E-L.\"</p>\n<p>\"Kara Zor-El Danvers,\" Lena repeats under her breath, an absurdly determined look on her face, her fingers still just inside Kara's pants. \"Kara Zor-El Danvers…\"</p>\n<p>\"Hey,\" Kara says, drawing out the syllable, and Lena's eyes snap to her, immediately suspicious. \"Are you, by any chance, Lena Luth—\"</p>\n<p>Lena Luthor shuts her up with a kiss.)</p>\n<p> </p>\n<p> </p>\n<p> </p>"
}