{
  "id": "13339998",
  "url": "https://archiveofourown.org/works/13339998?view_full_work=true",
  "author": [
    "aloneintherain"
  ],
  "title": "a fight that you were born to lose",
  "rating": "Not Rated",
  "archive_warnings": [
    "Graphic Depictions Of Violence"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Miraculous Ladybug"
  ],
  "relationships": [
    "Adrien Agreste/Marinette Dupain-Cheng",
    "Adrien Agreste & Gabriel Agreste"
  ],
  "characters": [
    "Adrien Agreste",
    "Marinette Dupain-Cheng",
    "Gabriel Agreste",
    "Alya Césaire",
    "Nino Lahiffe",
    "Chloé Bourgeois"
  ],
  "additional_tags": [
    "Angst",
    "Hurt/Comfort",
    "Hawk Moth is Gabriel Agreste",
    "Emotional Manipulation",
    "Child Abuse",
    "Forced dieting",
    "Food Issues",
    "Recovery",
    "Identity Reveal"
  ],
  "language": "English",
  "series": "",
  "published": "2018-01-11",
  "completed": null,
  "words": "17,992",
  "chapters": "1/1",
  "comments": "274",
  "kudos": "7,417",
  "bookmarks": "1,890",
  "hits": "58,685",
  "summary": "<p>When the prosecution starts throwing around the word victim in reference to Adrien, he has to stuff his hands under his thighs to keep himself from bolting out of the courtroom. </p>\n<p>Adrien had felt unsafe during those last few weeks, but, until he had woken up and seen Father silhouetted in his bedroom doorway, that had only been paranoia. Father was controlling and cold, but he wasn’t hateful. Adrien was isolated. He was often hungry. And some weeks ago, when he had snuck out to visit Nino, sitting thigh-to-thigh on his bed while Adrien cried in that silent, crumbling way of his, he hadn’t argued when Nino put a hand on his shoulder and said, tentatively, <em>That’s abuse.</em></p>\n<p>But Adrien remembers being small and Father touching his hair after he’d aced another test; Father holding his scribbled drawings like they were something precious, and framing them around his office; Father, dressed as Hawkmoth, his eyes wild behind the mask, lashing his sword against Adrien’s baton; Father, collapsed against Mum, crying into her ashy hair.</p>\n<p> </p>\n<p>Adrien finds out Gabriel is Hawkmoth, and Gabriel gets to bring his long-waited plan into action.</p>",
  "notes": "<p>Title is from Heirloom by Sleeping at Last.</p>\n<p>Warnings: forced dieting, child abuse, emotional manipulation, and Adrien’s biased thoughts about the way Gabriel treated him. If I’ve missed anything, or if you’d like a more detailed description of these warnings, feel free to message me.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>The ‘I love you as much as I can’ line is taken from a Next to Normal song, Superboy and the Invisible Girl. I had to include it, even if it is a touch melodramatic. </p>\n<p>Thanks for reading!</p>\n<p> </p>\n<p> <a href=\"https://captainkirkk.tumblr.com/\" rel=\"nofollow\">My tumblr.</a></p>",
  "text": "<p>When Ms. Bustier assigns them a project about family-trees, Adrien already knows he’s going to struggle to pass. The only relative he has semi-regular contact with is his father, who is too preoccupied to help him with something trivial like a school assignment.</p>\n<p>He doesn’t want to take this to Nathalie. Not yet. She would come back with a clinical .jpeg of his family tree attached to an even more clinical email. Adrien doesn’t want his family history written out like a textbook. He wants the authentic photos and scribbled family antidotes his classmates have already started to bring into class.</p>\n<p>He has some of his mother’s photos, but he wants something else. Maybe his history is hidden in the attic. In movies, family secrets are always hidden in the attic.</p>\n<p>Adrien has never been to the small upstairs area. Father instructed him to stick to his areas of the mansion, so that he wouldn’t interfere with his work, but Father isn’t here right now.</p>\n<p>Adrien glances around, but there aren’t any staff in sight. He dashes past the main staircase, towards the back of the mansion. There’s another staircase there, heading up to the smaller third floor.</p>\n<p>Most of it is storage. Adrien rummages through a stack of boxes, but only finds clothes from old Gabriel lines, and a lot of dust. Plagg twists in the air, coughing loudly.</p>\n<p>“What are you doing, kid? Can’t we go back to your nice <em>clean</em> room?”</p>\n<p>“This is important,” Adrien says. “I don’t know much about my family, not like the other kids do. I’ll never have a big extended family, but I can at least learn as much as I can.”</p>\n<p>Plagg takes a moment to look at Adrien, his squared shoulders, the almost desperate determination in his eyes, before sighing and lifting higher into the air. “Fine, but you’re not going to find anything in this dusty closet.”</p>\n<p>“You don’t know that—” Plagg zips out of the closet. Adrien sighs, and calls after him, “Stay out of sight!”</p>\n<p>“Don’t tell me how to do my job!”</p>\n<p>Adrien abandons the boxes to scan the upper shelves, but he only finds old magazines. The few folders he does find contain paperwork. Nothing personal.</p>\n<p>“Hey, what’s this?”</p>\n<p>Adrien sticks his head out of the closet. He finds Plagg hovering behind a hidden door, hand pressed against it.</p>\n<p>“What’s wrong?” Adrien asks.</p>\n<p>Plagg frowns. “What’s behind this door?”</p>\n<p>“I didn’t even know there was a door here.”</p>\n<p>They manage to pry open the door. Inside is a cavernous room. A round window is on one side of the room, covered by metal plating. There’s no furniture, but there are hundreds of white butterflies, ethereal in the dimly lit room.</p>\n<p>Adrien doesn’t know what he’s looking at. A hidden room, the windows covered up with protective barrier, the butterflies, and Plagg’s sudden shock—the puzzle pieces slot together.</p>\n<p>“Those butterflies,” Adrien says slowly, like he’s testing out the words, “they look like … ”</p>\n<p>“Hawkmoth’s,” Plagg says, shivering in midair.</p>\n<p>“But this is my house.” Adrien rubs a hand over his arms. He’s cold, suddenly. “This is my house, Plagg. Why would the butterflies Hawkmoth uses to akumatise people be here—”</p>\n<p>“Where’s your dad?”</p>\n<p>Adrien pauses. “I don’t know.”</p>\n<p>“Do you know when he’ll be back?” Adrien shakes his head, no. “We need to get out of here. If he knows that we know—”</p>\n<p>Adrien stumbles back. The butterflies flutter around them, never touching but not afraid of their presence. Their wings are opalescent.</p>\n<p>“Plagg, what’s going on?”</p>\n<p>“You’re not this dumb, kid.”</p>\n<p>Adrien walks backward until his back hits the wall. “There has to be another explanation for this. Just because there’s a room with butterflies doesn’t mean—we don’t know where Hawkmoth even is or what he really looks like. Maybe—maybe—”</p>\n<p>Plagg presses up against Adrien’s cheek. His small body is velvet-soft.</p>\n<p>“Kid,” Plagg says gently, more gentle than he ever is with Adrien, “we have to go.”</p>\n<p>Adrien’s knees are shaking. “Plagg.”</p>\n<p>“I’ll be with you the whole way. I’m not going anywhere.”</p>\n<p>Adrien’s hand flies to his ring, warm with the thrum of dormant magic. Touching it gives him strength.</p>\n<p>“Okay,” Adrien says, “let’s go.”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>They run down the stairs, and back into his room. (If he uses the front door, he might run into the staff, and then if they ask Adrien where he's going, he knows that he’ll open his mouth to answer and his heart will slide out through his teeth.)</p>\n<p>Adrien transforms halfway to the window. He jumps up, out of his room, and doesn’t stop running until the rooftops all look the same, and he can’t hear himself thinking above the blood pulsing in his ears.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>When patrol comes, the words get caught in Adrien’s throat.</p>\n<p>Ladybug cocks her head to one side. “Chat? What is it?”</p>\n<p>All this time, they’ve been fighting Hawkmoth. What will happen now? Would Ladybug want to charge into the Agreste mansion and confront him? Fight him?</p>\n<p>He doesn’t know if he could fight Father.</p>\n<p>“The akumas,” he says slowly, thinking about each word before he speaks it, something he does when he’s Adrien Agreste, not when he’s Chat Noir. “Do you think they’ll ever stop?”</p>\n<p>“We’ll make them stop.”</p>\n<p>“Maybe Hawkmoth will stop on his own.”</p>\n<p>Ladybug shoots him a disbelieving look. “Hawkmoth isn’t going to give up. We’ll defeat him, and then they’ll stop.”</p>\n<p>She’s right. He knows she’s right. His heart jackrabbits in his chest; he’s still in shock even now, hours later.</p>\n<p>“Are you sure you’re alright, kitty?” Ladybug says.</p>\n<p>He shakes his head, and musters up a smile. She blinks at him, alarmed, and he realises that this polite, distant-eyed smile is an Adrien Agreste smile, not a Chat Noir smile. He widens his smile, shows more teeth. She relaxes.</p>\n<p>“Off night?” she asks.</p>\n<p>“Me? Never.” He steps onto the balcony ledge, unhooking his baton from the small of his back. “Ready to go?”</p>\n<p>“You can tell me anything,” Ladybug says. “You know that, right?”</p>\n<p>His smile dim, becomes more Adrien, less showboating Chat Noir. He taps his mask. “Not quite anything, right?”</p>\n<p>“I meant that I’m here for you if anything—”</p>\n<p>“I know. I think the identity thing might be a good thing, after all. Imagine if I knew your identity, and he found out … ”</p>\n<p>Ladybug steps onto the ledge beside him. Her hand ghosts over his shoulder, and Adrien startles.</p>\n<p>“Chat,” she says. “What—?”</p>\n<p>“Let’s get going,” he says. He extends his baton and leaps over the street, not checking if Ladybug is following.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>It starts with his meals shrinking.</p>\n<p>Adrien spoons through his porridge, making a face. It’s not even poached eggs on wholemeal toast this morning. Just plain porridge. There’s not even a bowl of fruit on the side.</p>\n<p>“Nathalie,” he starts.</p>\n<p>“Your father has a new line in mind for summer,” she says without looking up from her tablet.</p>\n<p>“I’m at the right weight.”</p>\n<p>“Not for this photo shoot.”</p>\n<p>Adrien frowns at the porridge. He hates porridge. It tastes like melted paper. “How is the ‘starved teenager’ aesthetic supposed to sell clothes?”</p>\n<p>Nathalie sighs and finally looks up from her tablet. She looks tired, but that’s how she usually looks when she talks to him—exhausted by how difficult he is to handle. “And you are more of an expert on the fashion world than your father, the internationally renowned designer with decades of experience?”</p>\n<p>“Father was the one that changed my diet?” Adrien asks.</p>\n<p>“Yes. Eat your breakfast.”</p>\n<p>Adrien is hungry all through his morning classes. At lunch, he opens up a Tupperware container full of salad, and Nino frowns at him.</p>\n<p>“That looks very … green,” Nino says.</p>\n<p>Adrien stabs a cherry tomato with his fork. They agreed to bring lunch today, and he can’t help but wonder if he would have been given something different if he was at home. Maybe soup. Maybe the soup would come with a toasted sandwich. Adrien would do anything for a toasted sandwich right now.</p>\n<p>“New diet,” Adrien says into a forkful of spinach.</p>\n<p>Nino blinks at him. “New diet? Dude, your old one sucked balls, and now you’re on something worse?”</p>\n<p>“Apparently.”</p>\n<p>“No. No way. That’s not healthy.”</p>\n<p>Adrien shrugs. His old diet wasn’t so bad—standard portion control and healthy meals to make sure he didn’t start eating fatty foods.</p>\n<p>“It’s not like I can argue,” Adrien says.</p>\n<p>Nino pulls out his second sandwich and hands it to Adrien. He tries to refuse, but Nino shoves it at him again, more forcefully, and says, “I’d rather you eat it then have to sit here and watch you eat plain spinach with, like, three tomatoes. It’s painful, dude. Painful.”</p>\n<p>When Nino cracks open a packet of chips, he tilts the bag at Adrien without saying anything. Adrien ends up eating more than half of the chips, too. He doesn’t even realise until his fingers are brushing the bottom of the bag. He jerks his hand out.</p>\n<p>“Sorry,” Adrien says, face growing warm.</p>\n<p>“Don’t be,” Nino says, and for some reason, he sounds smug.</p>\n<p>Nino’s lunches almost double in size, after that. Adrien stops pretending to be annoyed that his friend is feeding him peanut butter sandwiches, and cold leftovers, and chips. Nino doesn’t complain about not going out to get lunch anymore.</p>\n<p>“What does you family say when they see you packing such big lunches in the morning?” Adrien says, halfway through a container of cold pasta.</p>\n<p>“They say, ‘that Gabriel Agreste is a dickmuncher.’”</p>\n<p>“They do not!”</p>\n<p>“Okay, maybe not exactly those words, but you get the idea. My parents are not a fan of your old man. At all.”</p>\n<p>It doesn’t take long for Alya and Marinette to join in, too. It’s not a secret that Adrien is overworked and that his father is overly strict, since everyone knows Nino was akumatised because Adrien wasn’t allowed to have a birthday party. That doesn’t stop Adrien from being embarrassed when the two girls frown at his lunches.</p>\n<p>“It’s … it’s not that bad?” he tries.</p>\n<p>“No, it is that bad,” Alya says. “I’m with Nino on this one—your dad’s a scumbag.”</p>\n<p>Marinette dumps her backpack onto the bench. Several boxes full of pastries fall out. Adrien looks at her like she hung the sun. Marinette goes red.</p>\n<p>“It’s—it’s not that much! Nino texted me, and well, I’m a bakery— I mean, my parents run a bakery. We always have leftovers. Not that I don’t care, I care about you—I just—” Alya shoves a croissant into her mouth. She chews and tells Alya, muffled, “Thank you.”</p>\n<p>His friends aren’t there at home, though. Nino tries to offer him food to take home, but Adrien is scared that the housekeeper will accidentally find some of it, and then Father will put a stop to the food he receives at school, probably by forcing him to come home for lunches, and checking his schoolbag.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>There are more akuma attacks.</p>\n<p>Before, there were several akuma in one week, and then, suddenly, there’s a new akuma every day.</p>\n<p>Adrien can’t predict it. Sometimes, the akuma appears during his lunch period, before he’s managed to scarf down the food his friends have offered him. Sometimes, an akuma appears in the middle of the night, his phone waking him up with a series of beeping notifications. And a few times, the akuma has woken him up in the pre-dawn mornings, only a few hours after Adrien had pulled himself from homework and climbed into bed.</p>\n<p>No matter what time they appear, it feels like the daily akuma attacks are always at the worst times.</p>\n<p>Adrien might have been secretly pleased to see Ladybug, but he keeps picturing that empty room sat at the top of the Agreste mansion, swarming with butterflies. The secret is lodged in his throat. He can’t let it out, not yet, but it hurts to keep it from Ladybug.</p>\n<p>“He’s growing more powerful,” Ladybug says while they’re hiding in an empty store, waiting for the akumatised nightshift employee to reappear.</p>\n<p>“But the akumas themselves aren’t becoming more difficult to deal with.”</p>\n<p>Ladybug hums, leaning back against the freezer. “You would think that he’d focus on making one overcharged akuma that could take us down, not lots of small ones that aren’t especially challenging.”</p>\n<p>“Maybe he just likes inconveniencing us.”</p>\n<p>“He needs a new hobby.”</p>\n<p>“We should send him some knitting brochures.”</p>\n<p>Ladybug’s laugh comes out as a snort. The sound unknots some of the tension settled behind Adrien’s ribs.</p>\n<p>“Mail him some thousand piece puzzles,” she says. “We just need to find out his email, and then we can sign him up for yoga classes. I heard they’re calming.”</p>\n<p>Adrien knows Hawkmoth’s address. He tries to picture Father in yoga pants, trying to do the downward dog between rows of mums in pastel-coloured active wear, but the image won’t come.</p>\n<p>“All these akumas,” Adrien says, “what do they mean?”</p>\n<p>Ladybug sobers. “I think it means he’s getting serious. I think … ” Her grip on her yo-yo tightens. “I think it means he’s planning something. Something big.”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Adrien’s schedule becomes more cramped.</p>\n<p>He didn’t think it was possible, but somehow, Father manages to squeeze more events into his schedule. Fashion shows, collaborative photo-shoots that block out entire afternoons and eat into his evening, extra piano and Chinese lessons to make up for the ones he’s missed, more tutoring with Nathalie in preparation for end of term exams, despite the fact that Adrien is firmly at the top of his class after years of homeschooling, his grades only rivalled by Max.</p>\n<p>The few moments he once managed to get with his friends outside of school vanish. Some days, he doesn’t even have time to see his friends during the lunch break before he’s being whisked off to a quick photo-shoot.</p>\n<p>Adrien’s days grow longer. He can barely make it to patrol, most days, and when he does, he’s listing to one side, struggling to keep his eyes open.</p>\n<p>Ladybug is worried. It feels like everyone is worried.</p>\n<p>Adrien is too exhausted to be worried himself.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Adrien doesn’t remember falling asleep. He remembers, vaguely, stumbling out of bed and getting dressed half-blind, ignoring Plagg zipping around his ears and nagging about getting enough sleep. He remembers the watery oats he had for breakfast. He remembers struggling to keep his eyes open on the short drive to school.</p>\n<p>He doesn’t remember laying his head on his desk and passing out, but the next thing he knows, Chloe is slamming her hands down, and complaining, “Adrien, we haven’t hung out in weeks. <em>Weeks</em>. You’re neglecting me.”</p>\n<p>Adrien sits upright, blinking at the bright lights. “Huh?”</p>\n<p>Chloe gasps. “Honey, what happened to your face?”</p>\n<p>Adrien presses a hand to his face. It’s still there. “What?”</p>\n<p>“The bags under your eyes—I knew you were tired, but you look terrible. Are your lips peeling?”</p>\n<p>Adrien runs a hand over his lips. The skin there flakes beneath his touch. Chloe makes a piteous noise in the back of her throat, and snaps at Sabrina to pass her handbag over. Even Sabrina winces when she looks at him.</p>\n<p>“I look that bad?” Adrien asks.</p>\n<p>“You still look better than everyone else in this class, except for me,” Chloe says, not bothering to lower her voice. “It’s because you look so perfect all the time that it stands out so much when you’re under the weather. You poor baby.”</p>\n<p>Adrien doesn’t like Chloe’s baby talk most days, but now, as tired as he is, it feels almost … nice. It’s familiar and easy. She rifles through her handbag until she finds her fluffy makeup bag.</p>\n<p>“Good thing I still have that liquid concealer in your shade. I’m that considerate.”</p>\n<p>“No dark eyeshadow this time,” he says quietly.</p>\n<p>She huffs out a breath. “You’re no fun.”</p>\n<p>When he blinks his eyes open sometime later, Chloe is pulling out an eyeliner pen and a stick of highlighter. “Chloe!”</p>\n<p>“Oh, come on! You’d look cute with cat-eye. It’s just a tiny flick.”</p>\n<p>A part of him wants to let her put the eyeliner on him, just for the potential pun material that is cat-eye, but a larger part of him doesn’t want to stand out. Not today, when he feels stretched out like melted taffy. And Father dislikes when he wears dark makeup outside of photo-shoots. He wants to avoid being scolded (as much as he <em>can</em> avoid it, anyway).</p>\n<p>“Chloe.”</p>\n<p>She rolls her eyes, but sweeps her makeup back into her bag. She pulls out a tube of lip balm, and presses it into his hand. “At least wear this. It’s only tinted a little bit. Very cute. Trust me.”</p>\n<p>He folds his fingers around the tube. “Thank you.”</p>\n<p>She hesitates, hovering over his desk. The way she’s looking at him—he doesn’t know the last time she looked at any of her friends with that searching stare. Maybe when he said he couldn’t be friends with someone who was mean. Maybe when Mum left and she swept into the mansion three days later, marching past the spluttering staff and into his room.</p>\n<p>Marinette almost runs into Chloe, because she’s too busy staring at Adrien. “Pink,” she says.</p>\n<p>Chloe pushes her away. “Watch where you’re going, Dupain-Cheng.”</p>\n<p>Marinette ignores her. “You look nice—I mean, your makeup looks nice, Adrien.”</p>\n<p>“Of course it does,” Chloe says, sniffing. “I did it.”</p>\n<p>Alya pokes out from behind Marinette. “Adrien, digging the eyeshadow!”</p>\n<p>Adrien goes to touch his face, but Chloe bats his hand away.</p>\n<p>“You look great,” Marinette blurts, seeing the tight expression on his face. She reddens. “The eyeshadow is this soft peach colour? Um. Very—very nice.”</p>\n<p>A muted colour. That’s fine, then.</p>\n<p>“Although his hair is a lost cause,” Chloe says, not even bothering to run her fingers through his fringe to settle it. “And his clothes. Adrien, honey, you are better than this.”</p>\n<p>Adrien doesn’t remember choosing his clothes this morning. He looks down at his chest. He’s surprised Nathalie let him out of the house in a plain hoodie. “Huh.”</p>\n<p>Chloe chews at her lip. Marinette looks around Chloe’s shoulder. Chloe is too preoccupied by staring at Adrien, her eyebrows pinched together, an almost painfully thoughtful expression on her face, to shove Marinette away.</p>\n<p>“Are you okay?” Marinette asks.</p>\n<p>Adrien pulls on a smile. “Of course.”</p>\n<p>None of them look like they believe him.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Adrien is burnt out. When he wakes one morning and is near-delirious with fever, he isn’t surprised.</p>\n<p>He climbs out of bed, and tumbles into the first pair of jeans he sees. He doesn’t see the dirt scuffed up one leg from where he’d dashed into an alleyway to transform. He snags a t-shirt, and doesn’t realise it’s a pyjama shirt.</p>\n<p>Nathalie takes one look at him and grimaces. “You cannot leave the house like that.”</p>\n<p>Adrien stands on the stairs, blinking at her. He looks down at himself. “Oh.”</p>\n<p>“Go get changed into something appropriate. I’ll fetch the painkillers—”</p>\n<p>“That won’t be necessary.” Father steps around Nathalie, and looks Adrien over. He hadn’t even noticed Father was home. “Adrien is unwell. He won’t be going to school today.”</p>\n<p>To Nathalie’s credit, she only hesitates a moment before she nods. “Yes, sir.”</p>\n<p>“Go back to your room,” Father tells him, and then returns to his office, Nathalie on his heels.</p>\n<p>Adrien wobbles back to his room, rubbing at his temples. It was a simple matter to reschedule tutors when he was a child, but for other things, like photo-shoots and fashion events, he was always expected to push through. After starting public school, Father had made it clear he would pull him out permanently if Adrien failed to meet those same expectations. And he already missed enough school as it was, with the akuma attacks.</p>\n<p>Strange.</p>\n<p>“This is what you get,” Plagg says when they’re alone in his room. “Not sleeping, eating weirdly—you humans are too fragile to mess around with your bodies like that.”</p>\n<p>“I can’t help my weird sleeping schedule,” Adrien says. “I didn’t ask for the akumas to start attacking in the middle of the night.”</p>\n<p>“And all those times you stayed up reading fanfiction?”</p>\n<p>“ … Shut up.” Adrien rubs a hand through his sweaty hair. “I can’t help my diet either.”</p>\n<p>Plagg scrunches up his face. They’ve had this argument enough times over the past few weeks.</p>\n<p>“At least change into something clean,” Plagg says. He ducks into Adrien’s drawers, and emerges with clean pyjamas.</p>\n<p>“Like your cheese is any better,” Adrien mutters under his breath. He changes, and crawls under the covers. He falls asleep before he can register Plagg, sitting on the neighbouring pillow, watching over Adrien with uncharacteristic quietness.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Adrien wakes when something bites his arm.</p>\n<p>He jerks upright, dazed and bleary-eyed. It takes a moment for his dark room to come into focus, and when it does, Adrien rubs at his eyes, cotton-wool brain not making sense of the figure silhouetted in his doorway.</p>\n<p>“Father?”</p>\n<p>Father doesn’t say anything. Beneath the covers, on the side furtherest away from the door, Plagg presses against Adrien’s stomach. His small hands knead the skin there.</p>\n<p>“Father?” Adrien says again. He fumbles for his phone, and winces at the brightness. It’s before lunchtime, but he already has a stack of unread messages. Chloe is throwing a small fit at his absence. Nino is asking if he’s been kidnapped, or if he’s been whisked away to another impromptu photo-shoot.</p>\n<p>Father presses a hand to the sweat-damp hair curling around his temples. He doesn’t push his fringe out of his face, like he did when Adrien was younger; instead, he tips Adrien’s head back, lightly grasping a fistful of hair.</p>\n<p>Father looks at him, searching. “How are you, Adrien?”</p>\n<p>“Father,” Adrien says, working his dry tongue against his teeth. “I’m in an oven.”</p>\n<p>“An oven,” Father repeats.</p>\n<p>“It’s hot. It’s … an oven.”</p>\n<p>Plagg presses against him insistently. Adrien flops a hand over his belly, trying to push both Plagg and the blankets off. His pyjamas sticks to his skin. He wants to go and lay belly-down on a tin roof, the way he does on hot nights when he’s Chat Noir, when it’s been dark for hours and all the heat has seeped out of the cold metal.</p>\n<p>“Let me help you,” Father says</p>\n<p>Father takes Adrien’s wrist, and turns his hand over. His fingers brush against the silver ring, and Adrien snatches his hand back, pushing back against the headboard. His sleepiness and fever-soft thoughts are gone, chased away by a fresh rush of adrenaline.</p>\n<p>“Adrien,” Father says, leaning in, “you’re sick. I’m trying to help—”</p>\n<p>“I’m fine,” Adrien says. He pants, open-mouthed. The air in the room is too thin.</p>\n<p>“Come here.” His voice isn’t gentle, but it is quiet. “I’m trying to help you, Adrien. You’re too young to understand all of this.”</p>\n<p>Father sits down on the bed, and reaches for Adrien. His hand is open, palm up.</p>\n<p>“Adrien,” Father says, voice hardening with each moment Adrien stays out of reach, “come here.”</p>\n<p>“No,” Adrien says, and he clings to the firmness in his voice. He’s shaking, but his voice is strong. “No.”</p>\n<p>Father is getting annoyed, now. He stands, so much taller than Adrien, especially when he’s like this, sprawled out in twisted sheets.</p>\n<p>“Adrien.”</p>\n<p>Plagg nips at his side. It doesn’t hurt, but it’s enough to make Adrien jump out the opposite side of the bed, right as Father makes a grab for him.</p>\n<p>Father is breathing heavily now, too. It’s not sickness or fear, but something else—frustration, maybe, or the sheer effort it takes to hold himself back.</p>\n<p>Hold himself back from what?</p>\n<p>“How long have you known?” Adrien asks,</p>\n<p>“Long enough to know this is a fool’s errand. You are running around after that girl, and for what? You aren’t making any real progress.” Father’s face softens, and it isn’t out of fondness, the way Mum’s face would gentle when she bent down to look at him, brushing his fringe out of his eyes. It’s pity. “She doesn’t need you to fight. She’s the one with the lucky charms, and the purifying yo-yo. She’s the one Paris loves.”</p>\n<p>“She needs my help,” Adrien says.</p>\n<p>“How many times have you been caught or brainwashed by an akuma? How many fights has she won on her own?” Father holds his hand out again, expectant. “Paris doesn’t need two superheroes.”</p>\n<p>Adrien cradles his hand to his chest, ring hidden beneath his other palm. He doesn’t move.</p>\n<p>Father sighs, and shakes his head. Adrien barely feels it; he’s used to disappointing him.</p>\n<p>“Why must you always be so difficult?”</p>\n<p>They stay like that for a beat, frozen, and then Father lunges across the bed and makes another grab for him.</p>\n<p>Adrien scuttled backward. He grabs the lamp off his bedside dresser, and holds it in front of him like a fencing sword. His pulse is in his ears.</p>\n<p>Father bares his teeth. He doesn’t look like Hawkmoth like this—hair gelled tightly back, wearing a salmon tie and grey blazer that clash with his flushed face. He just looks like Adrien’s dad.</p>\n<p>Plagg zips out of Adrien’s shirt. “Kid, you need to transform.”</p>\n<p>Adrien doesn’t listen to him.</p>\n<p>“How long have you been planning this?” Adrien asks.</p>\n<p>“I’m not stupid.”</p>\n<p>“This whole time—”</p>\n<p>“Who is she?” Father says. “Who is Ladybug?”</p>\n<p>“This whole time you were waiting. Planning.” Adrien shakes his head. “Do you—do you even love me?”</p>\n<p>“This is foolish, Adrien,” Father says. “You’re being ridiculous. If you join me—”</p>\n<p>Adrien drops the lamp. “Plagg, claws out.”</p>\n<p>His sight blurs with green light. Father shouts, and Adrien jumps backward, running out of his bedroom and into the main area, where the window is propped open.</p>\n<p>“Wait!” Adrien hesitates on the window sill. Father spreads his hands out. “You’re my son, Adrien. I love you, of course I do. I love you as much as I can.”</p>\n<p>Adrien pulls out his baton and hurls himself into the air. Father yells behind him. Adrien pushes onward. The suit dampens the effects of his illness. The fever is barely present—why, then, does Adrien feel like he’s in so much pain?</p>\n<p>He runs blindly, putting as much space between himself and the mansion as he can. He wants Plagg there beside him, telling him what to do, complaining about wasting energy, but he has to be Chat Noir right now. And Chat Noir doesn’t have Plagg there to hold his hand.</p>\n<p>The rooftops grow closer together as he gets deeper into the city. Everything is slick with rain. The air is fresh and damp, but Adrien barely feels it; he’s still overheated and dizzy. He knows he’s panicking. His heart is racing, and he can’t shake the hind-brain feeling of being prey, of being chased down, even though he keeps looking over his shoulder and finding nothing but empty air.</p>\n<p>He doesn’t pay attention to where he is. He tries to lunge across the street, and misjudges the distance. His chin crashes into the side of the building, arms scrabbling for purchase, and then he’s rocketing back down to Earth.</p>\n<p>All the air rushes out of his lung. Sprawled out on the damp pavement, gasping to draw breath, he doesn’t notice the pedestrians crowding around him until someone pokes him in the side.</p>\n<p>“Chat Noir? Are you alright?”</p>\n<p>Adrien squints up. A haze of red curls, a determined face—</p>\n<p>“Alya?”</p>\n<p>“He knows your name,” Nino says. He elbows her in the side with a quick grin, before focussing on Adrien. “How are you doing, dude? That was a crazy fall.”</p>\n<p>“Nino,” Adrien says, dazed. Nino blinks down at him. “Where … ?”</p>\n<p>“You know his name, too?” Alya asks.</p>\n<p>“Is he the real Chat Noir? Maybe he’s one of those enthusiastic cosplayers that run around doing parkour.”</p>\n<p>Alya shakes her head. Her phone is in one hand, not angled at Adrien. He wonders if he looks as bad as he feels, if she’s showing so much mercy.</p>\n<p>“No one that’s not wearing a magic suit could’ve fallen from that height without breaking their neck.” Alya looks him over again. “Your neck isn’t broken, is it?”</p>\n<p>Adrien pushes himself up onto his elbow. Nino hovers beside him, like he wants to help, but doesn’t know where to put his hands. It’s strange. If he were Adrien Agreste, Nino would have already scooped him up and demanded he visit the nurse.</p>\n<p>Adrien climbs to his feet. Nino is still there, hovering with his arms outstretched, ready to catch him. Alya’s eyes are piercing.</p>\n<p>“Where’s Ladybug?” Alya asks.</p>\n<p>“There’s not an akuma attack, is there?” Nino asks, checking the news app on his phone.</p>\n<p>Adrien shakes his head. His headache thumps behind his eyes. The rain-drenched sun glints off the puddles, making it worse.</p>\n<p>“What are you doing out, then?” Alya asks, arms crossed over her chest.</p>\n<p>“Hey, it is lunch break,” Nino says. “Maybe he felt like stretching his legs.”</p>\n<p>Alya steps around Nino, leaning in uncomfortably close. Adrien feels like she’s going to try and identify him again, but when she presses a hand to his face, it’s not to pick at the mask sealed to his face, but to check how flushed he is.</p>\n<p>“Do you have a fever?” Alya asks.</p>\n<p>“Um,” Adrien says.</p>\n<p>“Oh my god,” Nino says. “Are you pulling the mum card on a superhero right now? Alya.”</p>\n<p>“I will be the mum friend for all of Paris if I have to,” Alya says. Nino makes an apologetic face at Adrien. “Why did you go out if you’re sick? You just fell three storeys onto cement. And you’re quiet. You’re never quiet.”</p>\n<p>Adrien steps back, hands up. He gives them his best smile. “That’s confidential, I’m sorry, but don’t worry. Everything is under control, citizens.”</p>\n<p>“I know you know our names,” Alya says. “You just said them.”</p>\n<p>“You were hearing things.”</p>\n<p>Nino chews on the inside of his cheek. That’s a face Adrien is familiar with.</p>\n<p>“Are you hungry?” Nino starts. “We were just heading to a friend’s place. Her family owns a bakery. You should come with us. Sit down, eat something—”</p>\n<p>“Yeah, Marinette won’t mind,” Alya says, turning around to observe the empty side street. “She’s right—oh. Where did Marinette go? She was right there … ”</p>\n<p>Adrien collects his baton from where it had rolled away when he had fallen. His heart has calmed some. The sight of his friend’s faces bolsters something inside him.</p>\n<p>“I have to go.” Adrien offers another Chat Noir smile, and waves. His baton extends and he shoots back into the sky, flipping over the ledge that almost took his head off.</p>\n<p>“Come back here, young man,” Alya shouts after him, shaking her fist at him.</p>\n<p>“Please be safe, dude,” Nino shouts. “Drink some water!”</p>\n<p>Adrien only makes it over a few more rooftops before he slows and then stops. Where will he go now?</p>\n<p>“Fancied a midday stroll?”</p>\n<p>Adrien whirls around, and there, her suit an offensive blot of red against the drizzling cityscape, is Ladybug.</p>\n<p>“I heard you face-planted off a building,” she says, “and yet you keep telling me cats land on their feet. You really gave those two kids a scare back there. When they saw me, they were falling over each other to point me in your direction.”</p>\n<p>She drops off the higher roof, and lands beside the misty greenhouse. He doesn’t realise how much he’s missed her until she’s stepping closer, finally in arms reach, and his legs go weak. He falls into her.</p>\n<p>“Chat!” Her arms come up and wrap around him on reflex. He pushes his face into her neck. She sighs. Her hand settles on his hair, still mused from sleeping all morning. “Oh, Chat.”</p>\n<p>He loosens his hold on her, and she makes soft, soothing noises and pulls him closer. She rocks them from side to side. He’s shaking. She has to feel that, the violent tremors, but she just keeps patting his hair, murmuring nonsensically. He doesn’t know how long they stand like that, swaying like long grass in the wind. When he finally pulls away, he feels drained and rested all at once.</p>\n<p>Ladybug cups his face. “Hey, there.”</p>\n<p>“Hey,” Adrien says, voice wrecked. He gropes for a joke, some kind of pun to fill the heavy silence. “Nice weather we’re having.”</p>\n<p>She looks up at the bloated rainclouds. “No, not really.”</p>\n<p>Adrien sits against the edge of the greenhouse. Ladybug follows him down. The glass is wet against their backs.</p>\n<p>“Are you ready to tell me what’s wrong?”</p>\n<p>“What makes you think something is wrong?”</p>\n<p>“Chat.”</p>\n<p>Adrien rubs a hand against the back of his neck. Even through the glove, he can feel how warm his skin is. “Have you ever realised that everything you knew about someone— all the assumptions you’d made, the excuses they’d made, the lives you’d built up around each other—was wrong? That you thought you understood someone, but maybe, you never did.”</p>\n<p>“I’ve wrongly judged people before,” Ladybug says.</p>\n<p>“That’s not what I mean.”</p>\n<p>Ladybug rests a hand on his knee. She’s so kind. It feels so good to have her there, silent and strong, a pillar of support. “What do you mean?”</p>\n<p>Warring desires push up inside of him. There’s the desire to keep the dirty parts of himself hidden, and keep his father and Ladybug as far away from each other as he can. And there’s the fresh panic, the animal fear he’d felt when his father hunted him down in his own bedroom and tried to snatch his ring away.</p>\n<p>Ladybug is there when it’s dangerous. She keeps him safe, just as much as he protects her. He wants her to fix this. He wants a lucky charm that will magic this all away. He wants to go back to the days when his father was distant in that cold, excusable way, and Adrien could pretend the disappointment didn't hurt, and Hawkmoth was just a faceless puppeteer on the other end of the akuma attacks.</p>\n<p>Ladybug turns his hand over, and laces their fingers together. She squeezes his hand. “You can tell me anything.”</p>\n<p>Adrien draws in a breath. “Even if … ”</p>\n<p>“Even if,” she says without hesitation. He waits for her to add, <em>unless it comprises our identities.</em> But she doesn’t.</p>\n<p>Adrien straightens, tries to anchor himself to the feel of Ladybug’s hand wrapped up in his own, and opens his mouth.</p>\n<p>An explosion rocks the street.</p>\n<p>Ladybug draws away. “That sounds like an akuma. I’m sorry, Chat, but we have to—”</p>\n<p>“Ladybug.” Adrien grabs her hand.</p>\n<p>She carefully pries him away. “I’m sorry. I promise, after this, we can sit down and talk this out. I’ll block out my entire evening. We have to quickly deal with this akuma, and then—”</p>\n<p>She unhooks her yo-yo and steps up onto the roof’s edge. Adrien is seized with an irrational terror. If he lets her go, if she disappears out of his line of sight, then he can’t protect her.</p>\n<p>Hawkmoth is somewhere out there. Waiting for them to come after him.</p>\n<p>Waiting for Adrien.</p>\n<p>She pulls her arm back to throw her yo-yo, and Adrien grabs her again. She turns, another apology on her lips, and freezes when she sees his face, twisted up with stress.</p>\n<p>“He’s my father,” Adrien says.</p>\n<p>“What?” Ladybug says.</p>\n<p>“Hawkmoth.” Adrien can’t bear her touch, suddenly. He pulls away. He feels unclean. Dirty. “Hawkmoth is my father.”</p>\n<p>Ladybug drops her throwing arm. Adrien pulls at his fingers. The gloves aren’t removable; they barely move when he tugs at them with all his strength.</p>\n<p>“I wanted to tell you, but when I found out, I felt so sick. If I had told you, it would have been <em>real</em>.”</p>\n<p>Ladybug lifts her hand, but Adrien skitters away from her touch. He’s never done that before.</p>\n<p>“Chat,” she says softly. “Chat, what happened?”</p>\n<p>“I was sick this morning. He let me have the day off, but when I woke up, he was there, in my room, and he tried to convince me to hand my ring over.”</p>\n<p>“What?”</p>\n<p>“I didn’t! I <em>didn’t</em>. I promise I wouldn’t do that to you.”</p>\n<p>Ladybug grips Adrien’s forearms. It’s not a gentle touch, nothing like her soft eyes, and it draws Adrien away from a panic attack. Gives him something to focus on. Beneath her hands, it’s easier to breathe.</p>\n<p>“I know you wouldn’t,” Ladybug says.</p>\n<p>“He tried to take it, anyway.”</p>\n<p>“By force? Did he”—Ladybug looks like she might throw up—“hurt you?”</p>\n<p>“I got out of there as quickly as I could.” Ladybug’s mouth screws up, and Adrien knows she’s trying not to cry. “I just thought you needed to know. He knows who I am. He could be planning something.”<br>“You’re going to fight him?”</p>\n<p>“I didn’t tell you because I needed to be side-lined.” The akuma is still in the distance, a destructive vibration and an echo of screams. “I told you so that we’ll be ready.”</p>\n<p>Ladybug’s hands run down from his arms and take his hands. Her face is twisted up. Adrien is sure his isn’t much better. They don’t make a reassuring image, he’s sure—two teenage heroes holding hands and trying not to break down crying.</p>\n<p>“I won’t let him hurt you,” Ladybug says.</p>\n<p>“He won’t,” Adrien says. “He won’t hurt me.”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>When Ladybug and Chat Noir arrive on the scene, the akuma zeroes in on them. The butterfly symbol lights up her face.</p>\n<p>“There you are,” she says softly. Adrien can almost hear his father’s inflections in this stranger’s words.</p>\n<p>Ladybug steps in front of him. “Hawkmoth, enough. Stop this.”</p>\n<p>“I’ll stop when you surrender,” says the akuma. “When you hand over your miraculous. Then this can all be over, and we can go home.”</p>\n<p>“How could you do this to—”</p>\n<p>Adrien puts a hand on Ladybug’s shoulder, cutting her off. “Hawkmoth,” he says in that same demure way he might normally say, <em>Father</em>. “Please. Can’t we go back? Stop all of this, and just … ”</p>\n<p>“That is what I’m trying to do. Can’t you see that? This is for family.” The akuma extends a hand in the same way father had extended his hand to Adrien this morning, pleading for him to step closer, to peacefully hand over his miraculous. “Aren’t you tired? I see your pain. I see your loneliness. Come home, and this can be over.”</p>\n<p>Ladybug looks from the akuma to Adrien with wide eyes. Adrien doesn’t know what she’s thinking. Is she worried that he might believe Hawkmoth’s words, and surrender his miraculous? Or maybe she thinks that her partner might abandon her, and join Hawkmoth.</p>\n<p>That thought, more than his past experiences with both Father and Hawkmoth, more than the gentle words spoken through an akumatised civilian rather than from Father’s own lips, makes his decision for him.</p>\n<p>Adrien pulls out his baton.</p>\n<p>“Don’t do this,” the akuma says. It sounds like she’s begging. “Don’t make me do this.”</p>\n<p>Adrien shakes his head. There’s a lump in his throat he can't dislodge.</p>\n<p>Ladybug slots herself back into the conversation. As she speaks, she takes Adrien’s hand in her own. “We won’t let you keep terrorising innocent people. And we won’t let you get our miraculous.”</p>\n<p>The akuma sighs. “Very well.”</p>\n<p>Hawkmoth drops the possession. The akuma looks around, disorientated at the sudden autonomy over their own body, before the butterfly symbols flares again, reminding the akuma of its purpose.</p>\n<p>“Chat,” Ladybug murmurs.</p>\n<p>“I’m okay,” Adrien says. He notices that they’re still holding hands. They can’t fight like that. He pulls his hand away, and wonders if he’s imagining the flick of reluctance on Ladybug’s face as she takes her hand back.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>The fight shuts down half the city.</p>\n<p>Hawkmoth can’t create multiple akumas at once, but he has worked up his stamina. After they purified one akuma, another crops up within the hour.</p>\n<p>They break up to de-transform and feed their kwamis, and then, just as they’re catching their breath, as they’re beginning to head back out into the city, they hear news of the next akuma.</p>\n<p>At the sight of the first akuma, Adrien is swallowed up by dread. At the second akuma, he’s beginning to feel tired. At the third, his legs are shaking</p>\n<p>After the fourth akuma, Adrien slumps to the ground, splayed out like a starfish.</p>\n<p>There shouldn’t be civilians in this area, but, of course, Alya will do anything for a story.</p>\n<p>She skids to a stop in front of him. Her camera is out, filming, even though it’s school hours. Or—is it school hours? He had seen her during their lunch break. How long ago had that been? How long had they been fighting?</p>\n<p>Nino is a beat behind her, clearly out of breath. He hovers behind her, glancing at the prone akuma.</p>\n<p>“You shouldn’t be here,” Adrien says.</p>\n<p>Alya waves a hand at where Ladybug is in the process of purifying the akuma. “Dangers passed. For now, anyway.”</p>\n<p>“Right.” Adrien pushes himself into a sitting position, and fixes a welcoming smile onto his face. “What can I do for you, citizen?”</p>\n<p>“I know you know my name,” Alya says.</p>\n<p>“Have you been following the akumas today?” Adrien asks. “All of them?”</p>\n<p>“I didn’t want her to die,” Nino says.</p>\n<p>Alya waves of their concern. “I have to broadcast this. It’s final boss time, right?”</p>\n<p>“Final boss?” Adrien asks.</p>\n<p>“The battle at the very end of the game. The final boss.” She hoists her phone up, focussing it on the hero. “Chat Noir, what can you tell me about these fights?”</p>\n<p>“Let him be,” Nino says, gesturing at where Adrien is flopped on the asphalt, sweaty and clearly exhausted. “Hey, man, are you okay?”</p>\n<p>“Pawsitively purrfect,” Adrien says. “Why wouldn’t I be?”</p>\n<p>Nino and Alya exchange looks. Nino opens his mouth to say something, maybe to scold him the same way he might when they were at school and Adrien was overworking himself again, rather than in the middle of a crumbling city street with a purified akuma. But then the swirl of ladybugs washes over them, fixing the deep holes in the asphalt, and a slow clapping starts up.</p>\n<p>Alya jerks back. Nino grips her arm, like he wants to shove her behind him. “Is that—” Nino begins.</p>\n<p>Adrien pushes himself to his feet. His exhaustion is gone. His heart is racing.</p>\n<p>Hawkmoth stands atop the nearby apartment building. Adrien doesn’t recognise the purple suit, or the gunmetal grey mask. He doesn’t recognise the long cane, the gloves, the sharp smile—this man is a stranger, from head to toe.</p>\n<p>“You have fought admirably,” Hawkmoth says, voice projected down to them. Alya is shaking, but her phone is pointed upward. How many people are watching her livestream? “Your city commends you.”</p>\n<p>“Hawkmoth,” Ladybug says. “Come to ask us to surrender again?”</p>\n<p>“No.” Hawkmoth looks at Adrien. He feels naked. “I can see I took the wrong approach. You are too young to understand the full weight of your bullheadedness. The miraculouses should not be in the hands of naive children.”</p>\n<p>“And it’s better to be with you, who would use them for your own selfish purposes?”</p>\n<p>“My purposes are not selfish.” Hawkmoth steps off the edge of the building, and falls to the pavement. He lands gracefully. “Enough talking. Are you willing to—”</p>\n<p>Ladybug bares her teeth. “Never.”</p>\n<p>Hawkmoth flicks his gaze to Adrien. There is no softness to be found in his face. Nothing welcoming or kind. Nothing resembling mercy.</p>\n<p>Adrien feels cold.</p>\n<p>“And you?” Hawkmoth says. “Have you come to your senses?”</p>\n<p>“No,” Adrien says.</p>\n<p>“I thought as much. You never make life easy for me, do you?”</p>\n<p>Ladybug’s earrings beep. Her hand fly to cup them, and Hawkmoth laughs.</p>\n<p>“I don’t care about <em>your</em> identity, child.”</p>\n<p>“Go,” Adrien says. “Come back as soon as you can.”</p>\n<p>With one last lingering glance at Adrien and the two civilians behind him, she dashes into a side alley.</p>\n<p>Butterflies rise over the horizon, blocking out the sun. They buzz around Hawkmoth. He snatches one out of the air, and brings his palms together. When he opens his hands, a dark butterfly flitters into the air, a stain beside its white sisters.</p>\n<p>It flies at Adrien, and skitters against his chest, like it’s trying to find an opening for it to dip into, but his armoured suit is seamless and unwavering. The butterfly veers to the left. Alya and Nino shuffle closer to Adrien, but the butterfly ignores them, disappearing into the buildings behind them.</p>\n<p>Adrien looks at Hawkmoth. Had he just tried to akumatise him? Is that the way he would secure Adrien’s cooperation—by using dark magic to turn him into a blind puppet?</p>\n<p>“I wonder who hasn’t evacuated yet,” Hawkmoth says. “With so many attacks in one day, the people must be feeling so helpless. It’s a breeding ground for power.”</p>\n<p>Alya pushes in front of Adrien. “You can’t keep taking advantage of innocent people. The way you make vulnerable people fight your battles for you—it’s wrong.”</p>\n<p>“Alya,” Nino hisses, “don’t antagonise the super-villain.”</p>\n<p>Hawkmoth laughs. “You think I can’t fight my own battles?”</p>\n<p>“That’s definitely what it looks like. You’ve made puppets out of children—out of babies, even—and you still think you’re all that?”</p>\n<p>The cane isn’t for design. It isn’t to help his perfectly fit father move around.</p>\n<p>It’s a sword.</p>\n<p>Hawkmoth brandishes the blade at Alya. It glints in the afternoon sun, and Adrien is reminded of his father’s fencing background. Not sword fighting. Fencing. The sport with blunted swords and a strict code of honour.</p>\n<p>Adrien shoves Alya behind him into Nino’s waiting hands, and holds his baton in front of him. Hawkmoth scowls at him.</p>\n<p>“If I wanted to go after those two, I would have done so earlier.”</p>\n<p>“You did,” Alya begins. “You turned us into akuma, you cowardly piece of—”</p>\n<p>She’s cut off as Nino clamps a hand over her mouth. Adrien grits his teeth, and waits for the blade, held aloft, inches from his face, to strike him.</p>\n<p>“I won’t go after them,” Hawkmoth says to Adrien. “Out of courtesy to you, of course. They’re important to you. I know that—I care about that. Don’t you see how much I care?”</p>\n<p>Adrien’s baton skirts the edge of the blade, knocking it away from his throat. “If you cared, you’d stop this.”</p>\n<p>“So strong,” Hawkmoth says. “So courageous. Just like your mother. Don’t you want to see her again?”</p>\n<p>“What,” Alya says from behind him.</p>\n<p>The words get caught in Adrien’s throat. He has a thousand things he wants to say to his father, and he doesn't know how to say any of it. Or where to start.</p>\n<p>“Not like this,” Adrien says instead, and it isn’t enough. It will never be enough. It doesn’t change that strange almost-pity on his father’s face.</p>\n<p>Hawkmoth sheathes his sword. “I see.”</p>\n<p>The city goes silent. Unnaturally silent. Adrien turns. An akuma in all white is floating above the city, her hands splayed. The city below them is slowly vanishing, piece by piece,</p>\n<p>When he turns back around, Hawkmoth is walking away. Like he was going for a stroll. Like he is unaffected by everything, even as Adrien’s pulse throbs in his ears.</p>\n<p>“What the fuck was that?” Alya says. Nino tries to calm Alya down, but she whirls on him. “No, Nino. You saw that weird ‘come to the dark side, my son’ shtick—”</p>\n<p>“Are you?” Nino asks Adrien, quieter. “His son?”</p>\n<p>“Get somewhere safe,” Adrien says. “I have an akuma to deal with.”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>The akuma is a young girl with sensory issues. The constant akuma attacks caused her a lot of pain, and now she wants to quiet the city. Patches of the city are eclipsed in silence. She freezes cars in the middle of the street. In other places, she has vanished people and uprooted entire parks—taking anything that made noise, and getting rid of it.</p>\n<p>Adrien tries to fight her. He does his best, but she vanishes his baton. She throws up sound-sucking areas, and evaporates buildings from beneath his feet. And then, when he is trying to catch his breath, she tackles him. She pins his wrists. She isn’t smiling like most akumas, in that smug, power-drunk way—she wasn’t smiling at all. Her face is blank. Hollow.</p>\n<p>Like a wooden puppet.</p>\n<p>Hawkmoth isn’t far off. Adrien suspects he was waiting on the wings, watching this fight unfurl. When Adrien is pinned, he makes a reappearance.</p>\n<p>Hawkmoth’s sword slips beneath his chin, settling against his neck. He isn’t smiling either. Adrien opens his mouth to shout up at him—to plead, maybe—but no sound comes out.</p>\n<p><em>Stop</em>, Adrien says, mouth closing on nothing.</p>\n<p>Hawkmoth flattens Adrien’s hand against the asphalt, crushing his fingers in his effort to lay them flat. Adrien bucks, and tugs at his wrists, and shrieks up at him. Hawkmoth doesn’t look at him; all his attention is on Adrien’s hand.</p>\n<p>He plucks the ring off his finger. Adrien de-transforms in a whirl of light. He’s still wearing his pyjamas.</p>\n<p>Hawkmoth laughs, and releases the akuma. Awareness comes over the girl like a car crash, and she scrambles away from Hawkmoth on all fours. He barely looks at her.</p>\n<p>“Ladybug will—” Adrien says.</p>\n<p>Hawkmoth holds up the earrings, glinting in the light, and Adrien’s inside freeze over.</p>\n<p>He wasn’t waiting in the sidelines. Adrien wants to shake himself, wants to scream—of course Father would never patiently sit by. He was tracking down Ladybug.</p>\n<p>“Caught her just as she transformed,” Hawkmoth says. “Remarkable that Paris’s two superheroes were both in the same class. Did you know?” He inspects Adrien’s face, and clicks his tongue. “I guess not.”</p>\n<p>“Father,” Adrien says. “Please.”</p>\n<p>“I’m doing this for you,” Hawkmoth says. “I can bring your mother back home.”</p>\n<p>“Please,” Adrien says, so quiet it’s barely audible, but Hawkmoth doesn’t listen.</p>\n<p>The ring and earrings slot together like magnets, and for a moment, everything is quiet.</p>\n<p>Then the combined miraculous are ringed in scorching light, leaving sun-spots in Adrien’s vision. Hawkmoth lifts off the ground, and ascends into the sky. The light spreads, encircling him in its celestial glow. He floats above the city, more blinding then the smoke-hazy sun.</p>\n<p>Hawkmoth waves a hand, and the asphalt cracks open, a gaping chasm splitting the city street. Cars slide into the hole. Buildings list, and then topple. People, screaming, grasping at nothing, are pulled into the crack.</p>\n<p>Hawkmoth’s business suit is gone, replaced by seamless purple and fissures of sun-like light. He extends a hand, and a row of apartment buildings fold in on themselves.</p>\n<p>Nino hits the ground by Adrien’s side, skinning his jeans. His hands clamp down on Adrien’s shoulders and shake him.</p>\n<p>When did Nino get here? Adrien stares at his friend in a daze. Everything feels like it’s been swathed in cotton wool, like all the heat has been drained from the city. (Shock, Adrien will later learn. This is shock.)</p>\n<p>“Adrien, we have to go,” Nino says, frantic. “We have to <em>move</em>.”</p>\n<p>“I can’t.”</p>\n<p>“Are you hurt? Did you fuck up your leg?”</p>\n<p>“No, I’m.” Adrien chokes on the words. He swallows, and tries again, “Nino, I’m Chat Noir.”</p>\n<p>Nino’s hands slide off his shoulders. “What?”</p>\n<p>Alya shoves Nino to the side. “We have to get out of here. What’s the hold up?”</p>\n<p>“I have to stop him,” Adrien says. “I have to stop Hawkmoth.”</p>\n<p>“No,” Nino says.</p>\n<p>“Are you crazy?” Alya says. “He’s going to decimate Paris. He has the miraculouses. It’s over. We lost.”</p>\n<p>She’s crying. Or she was, at some point. Her face is puffy and raw, and her hair is scraped back into a lopsided bun. She has someone slung over her shoulders. It’s Marinette. He can’t see her face; he can only see the ribbons falling out of her ponytails, her pink jeans dirtied with soot, and the growing patch of blood on her shoulder.</p>\n<p>Adrien looks away from his classmate. He can only help her by doing this one thing. This one awful thing.</p>\n<p>“I’m Chat Noir,” Adrien says. “This is my fault. It’s my responsibility. I have to stop him.”</p>\n<p>“So that means—” Nino looks at Hawkmoth’s glowing form. “That means he really is your dad.” Adrien nods, and Nino sucks in a deep breath. He claps a hand on Adrien’s shoulder again. He looks like he wants to envelop Adrien in a hug and stay there, folded up on the asphalt, but there’s no time for that. “I always knew that guy was a jackass.”</p>\n<p>The revelation barely touches Alya. She shows no surprise. No panic. She just scowls at him, and clicks her fingers under his nose. “He’ll kill you. Are you listening to me? That thing up there—” She points up at Hawkmoth. “—will kill you. It’s not your dad anymore.”</p>\n<p>“Alya,” Nino says.</p>\n<p>“No. I won’t let you get yourself killed.”</p>\n<p>The stink of rotten eggs clogs the air. The cracks running through the city have burst the gas lines and sewage pipes. Plumes of smoke rise over the horizon.</p>\n<p>“If we can find Ladybug,” Adrien begins.</p>\n<p>“You don’t understand.” Alya hefts Marinette’s unconscious form further up her back. “We have Ladybug.”</p>\n<p>“Hawkmoth might have taken her earrings, but I know Ladybug. She wouldn’t give up.”</p>\n<p>“No, dude,” Nino says. “We stumbled into an alleyway to hide in, and we found Marinette, and then Hawkmoth found us, just as she transformed … ”</p>\n<p>Nino trails off, face pinched, but Alya looks even angrier. “She’s going to be okay. She will. No matter what that asshole did to her. Once we get out of the city, and Marinette wakes up—”</p>\n<p>“Marinette?” Adrien says. Nino and Alya look at him. Adrien’s mouth is dry. “You mean that Marinette is—?”</p>\n<p>“I’m sorry,” Nino says.</p>\n<p>Marinette is Ladybug. Ladybug is here, unconscious and bleeding steadily from a cut on her shoulder, her hair matted with blood.</p>\n<p>That means Adrien has spent his days in class, oblivious to Ladybug’s presence. It means he knows her. Or maybe it means he doesn’t know her at all.</p>\n<p>It means Nino and Alya can carry her to safety. It means Adrien can continue on without worrying about her. It means he is alone in this.</p>\n<p>Nino pulls Adrien to his feet, and tugs him away from where Hawkmoth is posed over the city, a vengeful god eclipsing the sun.</p>\n<p>Adrien shakes Nino off. “I can’t.”</p>\n<p>“Adrien,” Nino says.</p>\n<p>“Carry him,” Alya says. “He’s in shock. He’s going to get himself killed.”</p>\n<p>Nino tries to grab him, but Adrien dodges. Hawkmoth hasn’t hurt him. Without his miraculous, Adrien is fever-slow and exhausted, but he isn’t injured like the other three are.</p>\n<p>Adrien says, “I’m the only one that can do this.”</p>\n<p>He spares one last look at Marinette. Ladybug. There is no time to process that fully, and no time to look at her once more, to look at those familiar blue eyes and her freckles—the freckles that the mask had always hidden—and see Ladybug. His partner. His best friend.</p>\n<p>“He won’t hurt me,” Adrien tells them. “I’ll be okay.”</p>\n<p>And then he turns and runs before either of them can physically restrain him, ignoring their hoarse shouts for him to come back.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>The damage grows worse the farther Adrien runs. Hawkmoth has burnt his way through the city. He has carved chasms into roads, levelled parks until nothing is left but mirror-like tar, and knifed entire buildings.</p>\n<p>Adrien sees groups of people in some areas, running full tilt away from Hawkmoth. Some of them call out to him. To them, he’s a teenager in his pyjamas running through the middle of a burning wasteland. Not their hero.</p>\n<p>In other parts of the city, there’s nothing. No one. The ground is burnt flat. The rubble from the buildings that once stood here have been turned into ash. There’s no noise here, save for Hawkmoth’s power, like a thunderclap in the distance.</p>\n<p>Adrien runs, stopping only to throw up, or catch his breath.</p>\n<p>The raw destruction doesn’t last; an hour after it the miraculouses were joined, Hawkmoth begins to sink back to earth.</p>\n<p>When Adrien reaches him, Hawkmoth is twisting silvery spirals in the air. The ground is burnt around him in a perfect circle.</p>\n<p>Adrien approaches carefully. “Father. It’s me.”</p>\n<p>Hawkmoth’s head swivels to look at him. His eyes are a pupil-less sheen of gold. Adrien’s joints lock up; he has never felt so small before.</p>\n<p>Helicopters circle them overhead. Adrien doesn’t look away from Hawkmoth to check if they belong to the police or the press.</p>\n<p>“You’re destroying Paris,” Adrien says.</p>\n<p>Hawkmoth looks around, like he’s seeing the destruction for the first time. “I have power, now. The power to bring her back.”</p>\n<p>“Okay,” Adrien says, because arguing with his father normally makes things worse; doing so now would bring France to ruin. “Let’s do that. Let’s forget Paris and—and do that.”</p>\n<p>The silver spirals thicken. Mist-like glitter forms shapes. Arms. Then hands. Then a face.</p>\n<p>“Let’s do that,” says Hawkmoth.</p>\n<p>Mum solidifies on the blackened ground. She palms at the layers of ash, and sucks air into her new lungs.</p>\n<p>Adrien crosses to her. The distance feels enormous, suddenly, even though he just ran from one side of Paris to the other with a cold. He collapses by her side.</p>\n<p>She’s beautiful. Younger than he remembers, maybe only twenty, but still familiar. She touches Adrien gently, like she’s scared he’s not real, and then pulls him to her chest.</p>\n<p>His face presses against her neck. She’s warm. She doesn’t smell like the vanilla perfume he remembers. She smells like iron.</p>\n<p>“I’m sorry,” Adrien says. “I’m so sorry.”</p>\n<p>Adrien makes himself look beyond her dewey face to the ash dirtying her slacks. He makes himself think about Paris breaking to pieces under Hawkmoth’s hands. Alya and Nino, dirt-streaked and terrified. Marinette. His lady, hanging limply over Alya’s shoulder, steadily dripping blood.</p>\n<p>Adrien pulls away from Mum’s embrace. It’s one of the hardest things he has ever done. Will ever do.</p>\n<p>It hurts to look at Hawkmoth. He’s barely coherent, staring at Mum with vacant relief. He’s crying.</p>\n<p>But Hawkmoth’s eyes are glazed over. The power isn’t going to let Hawkmoth go.</p>\n<p>The light encircling Hawkmoth has brightened. The joined miraculous twitch against his chest. It’s so small, to have caused so much death.</p>\n<p>Adrien dives. Hawkmoth reaches for him. Adrien knows that, in this moment, Hawkmoth would snap his neck; crush his skull; burn the skin off his face. Adrien’s hands close around the joined miraculouses. It thrums under his palm like it recognises him.</p>\n<p>Hawkmoth’s fingers brush his temples as Adrien digs his fingers in and yanks the miraculouses apart.</p>\n<p>The light fades abruptly. Hawkmoth collapses onto the ashy ground on his knees. Adrien pants, holding the ring and earrings to his chest.</p>\n<p>Plagg and Tikki float out of the miraculouses, and huddle against Adrien’s pyjama shirt. They’re shaking.</p>\n<p>“Adrien,” Plagg says. “Kid.”</p>\n<p>“It’s okay,” Adrien says. “I’ve got this.”</p>\n<p>Hawkmoth tips his head up. Adrien had thought it was difficult this morning, his father raising his hand to him like a beggar, or later, when he used the akuma as a mouthpiece to beg Adrien to come home—but that was nothing compared to this. Father’s face is twisted up in pain. He’s still crying.</p>\n<p>He looks pathetic and small, and Adrien wants to collapse into the burnt ground, sandwiched between his two parents.</p>\n<p>“We can be a family again,” Hawkmoth says. Adrien desperately wants to believe him. “We can, Adrien. We can. But how do we know this is permanent? I need that power to keep her here. To stop anyone from killing your mother again.”</p>\n<p>Mum stands. She shakes like a newborn lamb.</p>\n<p>“My love,” Hawkmoth says. He reaches out slowly, like he’s afraid of touching her. “Don’t hurt yourself.”</p>\n<p>“Gabriel.” It’s the first thing she has said. “Gabriel, what have you done?”</p>\n<p>He collapses onto her, tangling her up in a hug. She lets him cry into her shoulder.</p>\n<p>Adrien distances himself from them. If he stays, if he crouches down beside them, he won’t be able to get back up again. The miraculouses are warm against his palm, reminding him of his responsibility.</p>\n<p>“Plagg,” he says, “how are you doing?”</p>\n<p>“I feel as bad as you look,” Plagg says, “but if there was ever a time to dig deep, now is it.”</p>\n<p>Still in view of Hawkmoth and Mum, still in the blacken circle burnt into the earth where buildings and asphalt once were, Adrien pulls his ring on, and says, “Plagg, claws out.”</p>\n<p>The transformation draws Hawkmoth’s gaze. He jerks out of Mum’s hold, and bares his teeth like a hunted animal. He draws his sword from the scabbard at his hip.</p>\n<p>“Gabriel.” Mum scrambles for him, but he pushes her back. She’s weak. Hawkmoth is right; the transformation doesn’t look complete. Is she even completely there, or is she a mirage, a shadow of her former self?</p>\n<p>Adrien pulls out his baton. The suit helps him feel strong. Helps him feel less like he’s single-handedly destroying his world with this one gesture.</p>\n<p>Hawkmoth rushes him. Their weapons clash, and their boots dig into the ash. The helicopters circle above like hungry birds.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Hawkmoth is the superior swordsman, but he’s desperate. He focusses on pushing Adrien back with strength, rather than using his experience and skill against him.</p>\n<p>Hawkmoth is beating him. Adrien’s hands are numb, each attack ricochetting painfully up his arm.</p>\n<p>Adrien turns and runs when he has an opening. If he can get the earrings somewhere safe, or if he can get to higher ground, reduce the height advantage Hawkmoth has on him—</p>\n<p>Alya pokes her head out of an alleyway, and flags him down. Adrien skids in after her, and is almost bowled over by Marinette’s hug.</p>\n<p>“I’m so glad you’re okay,” Marinette says into his neck. “Don’t ever do that again.”</p>\n<p>“I’m going to smack you when this is all over,” Alya agrees.</p>\n<p>“Same,” Nino says from where he’s crouched against the bricks. “I was so scared. I still am. I thought your old man was going to—”</p>\n<p>“We won’t let him,” Marinette says, pulling away. She’s still bloody, but she looks strong.</p>\n<p>“How did you get here?” Adrien asks. “I thought you were evacuating with everyone else.”</p>\n<p>Nino holds up his phone. “The choppers are livestreaming the whole thing. They were talking about calling in the army before you grabbed the miraculouses.”</p>\n<p>Livestreaming. All of Paris, maybe all of France, all of Europe, saw his father’s rampage through Paris. They saw Mum’s return. They saw Adrien’s transformation into Chat Noir.</p>\n<p>Adrien feels nothing at the realisation. It’s hard to care about the world knowing when his world, his small, intimate world, is already burning.</p>\n<p>Adrien hands Marinette the earrings. “I know you’re injured, but Hawkmoth isn’t going to give up. I can’t do this without you.”</p>\n<p>“I’m by your side,” Marinette says. “Always. Tikki, spots on.”</p>\n<p> </p>\n<p> </p>\n<p>It’s easy with Ladybug there. Easier than a normal akuma, even.</p>\n<p>It feels wrong, somehow. After years of fighting akumas; after weeks of lonely, hungry stress; after a day of panic, and pain, and blood, it shouldn’t be so easy to bring Hawkmoth down.</p>\n<p>But he’s exhausted, too. He’s scorched from the power-surge of the joined miraculous. He’s drained from his wife’s return.</p>\n<p>The lucky charm is a reel of fishing wire. In the fight, Hawkmoth is tangled in the fishing wire and stumbles, pinned in an awkward position while Ladybug holds the wire taunt. Adrien reaches down, and takes the brooch.</p>\n<p>Hawkmoth’s transformation dissolves, leaving Gabriel Agreste twisted up in the dirt.</p>\n<p>Ladybug holds the red fishing wire in her hand. Father scrambles for her.</p>\n<p>“Don’t. Please don't reverse it all. My wife—Adrien’s mother—”</p>\n<p>“Thousands of people died,” Ladybug says.</p>\n<p>“My wife,” Father says.</p>\n<p>Ladybug looks at Adrien. He stares at the ground. There was a park here once, he thinks. Now, there is only black dirt. No trees. No life. Only ash.</p>\n<p>“Do it,” he says around the tightness in his chest.</p>\n<p>Ladybug throws the fishing wire into the air. “Lucky charm!”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>The city looks like nothing has happened. Lucky charm rebuilds buildings and roads. It sucks the smoke out of the sky. It brings back thousands of people in a wash of pink light, standing where they had died.</p>\n<p>It takes away Mum.</p>\n<p>The police come. They don’t normally, after an akuma attack. Akuma victims are usually ushered into the back of ambulances and treated for shock.</p>\n<p>Gabriel Agreste is pinned on the newly formed grass by three officers and handcuffed. He’s read his rights. He looks past the police officers to Adrien.</p>\n<p>“I brought her back. I brought her home. How could you kill her again?” Father is wild-eyed. Adrien can’t say anything in response; his mouth is too dry. “I did this for us. I did this for you.”</p>\n<p>Adrien isn’t sure that that’s true.</p>\n<p>It would be better—easier—to believe that Father did something terrible for him. Adrien could swallow that Father killed for him, that he burnt half of Paris to ash, than to believe he hadn’t thought about Adrien at all when he was doing this.</p>\n<p>Maybe that makes Adrien selfish. Maybe it makes him a bad person. He wouldn’t be surprised; it seems like that kind of mindset runs in the family.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>The Agreste mansion is a monolith in the centre of Paris. It looks like a museum.</p>\n<p>They jump over the fence and land in the brick courtyard. Adrien hesitates, staring at the closed doors. No PA system crackles to life to scold them. The doors don’t burst open to reveal Nathalie glowering down at them.</p>\n<p>Did she know? Did the Gorilla? Was this one big inside joke that everyone but Adrien was in on?</p>\n<p>Ladybug takes his hand. “You’re shaking.”</p>\n<p>“You’re holding my hand,” he says. “You’ve been doing it a lot today.”</p>\n<p>“Do you mind?”</p>\n<p>He tightens his grip on her hand. She squeezes back. He can’t help but look at their intertwined hands, the red against black leather. He doesn’t know how he would have survived this without her.</p>\n<p>“I don’t mind,” he murmurs.</p>\n<p>They are there to get his things. The press haven’t swarmed yet, but it’s only a matter of time before half of Paris is outside the mansion, trying to bring down the gates.</p>\n<p>The house is cold inside, like no one has lived there for years. They don’t run into any staff. Father probably gave them all the day off.</p>\n<p>Ladybug holds his hand until they get to his bedroom, and then only lets go so he can pack everything. He doesn’t drop the transformation. He doesn’t want to do this as Adrien Agreste. If he’s Chat Noir, then it’s not real. He can pretend this is for the mission.</p>\n<p>He packs up his school books, his toiletries, his photographs, and his clothes. He picks up a muted orange shirt from the latest Gabriel collection, and thinks, <em>There won’t be another line of Gabriel clothing ever again.</em></p>\n<p>He grabs his wallet and then goes to father’s office. He takes some of his personal documents, like his birth certificate and passport. He knows he must be leaving behind important things, but he’s sixteen, and he doesn’t understand what’s important and what’s not. Father always handled everything. Does Adrien have any money, now? Does he have no money—<em>all</em> the money?</p>\n<p>“Ready to go?” Ladybug asks. She hasn’t said anything since they stepped inside the mansion.</p>\n<p>“The book,” Adrien says. “The one about the miraculous users. It’s in a safe. I don’t know the combination; Plagg got it out last time.”</p>\n<p>“Okay.” He doesn’t drop the transform. He just stares up at Mum’s portrait, hands loose by his side, eyes this side too blank, so Ladybug says, “Tikki, spots off.”</p>\n<p>Marinette emerges from the wash of pink light. Tikki flies over to Adrien. She nuzzles the underside of his chin, her antenna tickling his throat.</p>\n<p>“Oh, Adrien,” Tikki says. “I’m sorry. I’m so, so sorry.”</p>\n<p>He pushes her away gently. “The safe is just through there. Plagg floated through the safe door. Can you do that?”</p>\n<p>Tikki retrieves the book and a photo of Mum. Adrien tucks both into his bag.</p>\n<p>“Anything else?” Marinette asks. Adrien shakes his head. “Tikki, spots on.”</p>\n<p>It isn’t until Adrien is stepping out of the mansion doors that he realises he has no where to go. All he knows is that he can’t stay at the mansion.</p>\n<p>“What is it?” Ladybug asks.</p>\n<p>“I don’t know what to do now,” Adrien says. “Where can I go?”</p>\n<p>Ladybug laces their hands together, pulling on his fingers. “Is that all? You’re coming me, obviously.” She pauses, and then wrenches her hand away. “I mean, uh, if you want to! Nino wanted you to come home with him, but I said you should come with me, since we’re partners and I know more about what you’ve been through—not that I do really, of course! It’s terrible, what happened, and I know I don’t—I can’t—no one could possibly understand—”</p>\n<p>He pulls her back. He doesn’t ever want to let go of her hand. “I’d like to go with you, if your parents don’t mind.”</p>\n<p>Ladybug shakes her head. “They’re worried about you, too.”</p>\n<p>“Is it weird, now that you know who I am?” Adrien sucks in a breath. Will he ever stop feeling so fragile, like there’s a hole punched through his chest? “Do you resent it?”</p>\n<p>“I think I might still be in shock. I didn’t get to process when I found out you were Adrien, but you’re still my best friend. My partner. You’re still everything to me—”</p>\n<p>“Stop,” Adrien says, because if she keeps going, he’s going to lose it. He doesn’t want to break down crying here.</p>\n<p>“Are you ready to go?” she says gently. Always so gentle.</p>\n<p>“Ready to never come back,” Adrien says, even if he knows it’s a lie. He’ll probably have to come back here one day, even if it’s only to pick up more of his things. (And a part of him—a not-so-small, indisputable part of him wants to stay here, wants to be frog-marched back inside by Nathalie or the Gorilla and see his father standing at the top of the stairs, waiting for him.)</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Marinette’s parents stare at the two teenagers in their entryway. They’re not injured. They’re not even dirty. But the way they’re standing, leaning against each other, like they don’t have the strength to stand upright, would alarm any parent. Any attentive parent.</p>\n<p>Marinette and Adrien are bustled into the living room and towards the couch.</p>\n<p>“Are you alright? We were so worried—”</p>\n<p>“We’re fine, Mum,” Marinette says.</p>\n<p>Tom disappears into the kitchen, and comes back with water and a plate of pastries. He lays them on the coffee table, and takes a seat beside his wife.</p>\n<p>“We just saw what happened on the news,” he begins.</p>\n<p>Marinette glances at her partner. Adrien stares at his shoes, until Tom touches his shoulder, and says, “Are you okay?”</p>\n<p>Adrien stares at him. “Uh.”</p>\n<p>“You can stay here,” Sabine says. “For as long as you want.”</p>\n<p>“Permanently,” Tom says, “if that’s what you want. We don’t have much space, but we can make it work.”</p>\n<p>Adrien doesn’t move to pick up a pastry, even though he hasn’t eaten since last night. “You don’t even know me,” he says, quiet and wondrous. “How could you … ?”</p>\n<p>“You’re Marinette’s friend. She talks about you a lot.”</p>\n<p>“Dad!”</p>\n<p>“And we’ve seen what Chat Noir has done for Paris these past years, protecting us all,” Tom goes on.</p>\n<p>Adrien swallows, his mouth dry. It’s going to take a while to adjust to people referring to him as Chat Noir when he’s not transformed.</p>\n<p>“And even if we didn’t know who you were, you would still be welcome here,” Sabine says gently. They’re both so gentle. Adrien doesn’t know how to handle it.</p>\n<p>Is this where Ladybug’s kindness came from? It’s easy to look at these adults, smiling, giving them space, providing them with food and water and a roof above his head for as long as he wants to have one, and see Ladybug’s unwavering brand of heroism.</p>\n<p>Tom nods. “You’re a good kid. You deserve to have someplace to come home to.”</p>\n<p>Home.</p>\n<p>It’s hard to talk, suddenly. His throat is blocked up with tears. They move their attention to Marinette, giving Adrien and his damp eyes some time to think.</p>\n<p>“And are you okay, Marinette?” Sabine asks.<br>“I got somewhere safe with Alya and Nino,” Marinette says. She doesn’t tell them where Adrien was. She doesn’t need to. Is there anyone in Paris that doesn’t know by now? “Did both of you evacuate?”</p>\n<p>Tom and Sabine hesitate, glancing at each other. They're holding hands. It reminds Adrien of him and Marinette, tangling their fingers together, finding strength in the other’s warmth.</p>\n<p>“Ladybug’s lucky charm fixed everything,” Tom says, not quite looking at them. “That’s what matters.”</p>\n<p>Marinette’s hand flies to her mouth. Adrien’s insides feel cold. Their bakery would have been near the centre of all the chaos. If they hadn’t evacuated, then …</p>\n<p>Adrien remembers the blackened earth. In some places, the destruction had been so great that there hadn’t even been rubble from the fallen buildings. There hadn’t even been corpses. Everything had been reduced to ash.</p>\n<p>“I’m sorry,” Adrien says. His hand pulls at the hem of his shirt. “I’m so sorry. I should’ve—I should’ve realised sooner, or I should’ve—”</p>\n<p>Marinette grabs for his hand again. Sabine lays a hand on his shaking knee.</p>\n<p>“You listen to me, okay?” Tom says, leaning forward in his seat. He maintains eye contact with Adrien. It doesn’t burn, like eye contact sometimes does. It doesn’t make him feel like a corned prey animal, staring up at a predator poised at the top of the marble staircase. Instead, it makes him feel grounded. “This wasn’t your fault. You didn’t do anything wrong.”</p>\n<p>“He’s my dad.” Adrien is crying. That’s where the shakes are coming from. The sobs start in his chest, taking up all the room in his lungs, and he folds in on himself. “He’s my dad, and he killed you. He killed so many people.”</p>\n<p>“You fixed it, Adrien. You were so brave—we’re so proud of how strong you were, standing up to him. You saved so many people. Including us.”</p>\n<p>Adrien shakes his head. “Ladybug did that.”</p>\n<p>“You got the miraculouses back,” Marinette says.</p>\n<p>Adrien glowers at his knees. “But I knew.”</p>\n<p>“What?” Marinette says.</p>\n<p>“I knew my father was Hawkmoth.” He doesn’t look at the Dupain-Chengs. He can’t. “I found out a few weeks ago. I was going to tell Ladybug, but I couldn’t. Telling her would’ve made it real. It would mean that I’d have to fight my father, and I didn’t think I could do that.” His shoulders curl in on themselves. He feels so small. He’s felt like this since he first stumbled into that high ceilinged room weeks ago, and saw the mass of white butterflies. “I was so stupid.”</p>\n<p>Marinette grips his hand tighter. “You’re not stupid.”</p>\n<p>“You probably should have told Ladybug,” Tom allows, “but keeping quiet doesn’t make you a bad person. You were scared.”</p>\n<p>“I should have done something, at least. I knew how much Mum’s disappearance affected him. I should have helped him, tried to talk some sense into him.”</p>\n<p>“You’re just a kid, Adrien. And he’s your dad. He should be looking out for you, not the other way around.”</p>\n<p>Tom Dupain would know, Adrien thinks. He’s a dad. He’s the kind of dad Adrien had thought only existed on TV.</p>\n<p>Adrien wipes at his wet face, staring at his knees. His head is a mess.</p>\n<p>“I think it’s probably time for bed,” Tom says. “You kids go get ready. I’ll fetch the blow up mattress for Adrien.”</p>\n<p>They let him sleep in Marinette’s room. They inflate a blow up mattress, and layer it with pillows and blankets. Before they go, they sweep both Marinette and Adrien into hugs. When they let go and head back downstairs, Adrien stands in the middle of Marinette’s bedroom, staring after them. He feels like crying again.</p>\n<p>Adrien sits down on the mattress, and pulls out his phone. There are too many notifications. Some he recognises (Chloe must have left up to a hundred voicemails), but most, he doesn’t.</p>\n<p>He’ll have to get a new number.</p>\n<p>Marinette sits down beside him. Their thighs brush. It’s quiet in her room. It feels like all of Paris is quiet. Was it only hours ago that the whole world was burning?</p>\n<p>Marinette. Ladybug. Her pyjamas are pink, and her hair is in twin braids. Plagg settles in his hair. Tikki curls up against his neck. The four of them lay like that, curled up around Adrien, too exhausted to speak, until he falls asleep.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Chloe storms the bakery three days after Hawkmoth almost destroys Paris. Adrien has made sure to stay clear of the shop proper so none of the customers will recognise him and out his location to the press. Somehow, though, Chloe has tracked him down.</p>\n<p>He’s asleep in Marinette’s room, bundled up on the blow up mattress on the floor, when her voice wakes him up.</p>\n<p>“I won’t let you hide him away any longer. He’s my friend. I deserve to see him, after all the garbage that’s been on TV.”</p>\n<p>She barges into Marinette’s room, the last place she would ever willingly be. She looks around, grimacing, before zeroing in on Adrien.</p>\n<p>“Adrien, honey.” She pulls herself up from the trapdoor and jumps onto his blow up mattress, making him bounce. “What are you doing in bed?”</p>\n<p>“Sleeping?”</p>\n<p>“It’s lunchtime. Beauty sleep is one thing, but this moping is just sad. Come on, get up. You can stay with me. I won’t make you sleep on the floor.”</p>\n<p>Adrien twists out of her hold. “I like it here. Marinette’s family is really nice, and unless they want me to go—”</p>\n<p>“We want you to stay,” Marinette blurts beside the trapdoor. She doesn’t redden; she’s been getting better at staying composed after a few days of Adrien sleeping in her bedroom.</p>\n<p>Chloe glowers at her. “Well, you can’t keep me from seeing him, at least. I had to look everywhere to try and find you, Adrikins. I had to go to Nino Lahiffe’s apartment in person. Can you believe that?”</p>\n<p>“You can’t tell anyone where I am,” Adrien says. “Please, Chloe. I haven’t been watching the news—no one’s really let me, honestly—but I know everyone is probably looking for me. And I don’t think I can do that. Not right now.”</p>\n<p>“I wouldn’t do that.” Her glare softens until she looks almost gentle, scanning his face—his red eyes, blanket marks on his cheeks, face blotchy beneath tangled hair—before she turns back to Marinette and scowls. “I don’t hoard my friends, unlike some people!”</p>\n<p>Chloe stays the rest of the day. Somehow, she coaxes him out of bed and downstairs. She sits by him, and chatters about everything and also nothing. She doesn’t mention his father. She doesn’t even talk about how scared she was when Hawkmoth tore through the city on Thursday.</p>\n<p>Chloe pauses, halfway through instagraming a plate of strawberry eclairs. “Will this give you away?”</p>\n<p>“Well, you have no reason to visit the bakery,” Adrien says. “Everyone knows you don’t get on well with Marinette.”</p>\n<p>“But I do adore you. That’s a give away.” Chloe huffs and deletes the image. “This ‘being considerate’ thing is hard work. How do you do it?”</p>\n<p>Adrien blinks at her. “What do you mean?”</p>\n<p>“Are you in it for the fun costume? Because Adrien, honey, the catsuit isn’t nearly as trendy as the other things you wear. It’s a little slutty, to be honest. I support you and this apparent sluttiness, but is it worth the hard work?” Adrien stares at her. She points her phone at him. “No, I see. It’s obviously Ladybug. I would become a hero just to see her, too, even if it sounds like a lot of grunt work.”</p>\n<p>“Chloe,” Adrien says, “What?”</p>\n<p>Chloe doesn’t look at him. She picks up a strawberry eclair and squeezes it, grimacing as filling spills over her fingers. “It sounds exhausting—being selfless and brave like Chat Noir. Putting other people first. Saving lives no matter the personal cost.” She sticks her fingers into her mouth, frowning. “And sweaty! Ugh, your suit must be so disgusting after running all over Paris.”</p>\n<p>She looks away from him. Her face is scrunched up, like she’s sucking on a lemon, not on sugary icing.</p>\n<p>“Chloe,” Adrien says again. “What are you saying?”</p>\n<p>“I’m saying that my hero collection is lacking. I had to stay up all night ordering merchandise. The cute, expensive kind of merchandise, not the homemade crap off of Etsy.” Chloe slides her phone over to Adrien. Her photo gallery is open. It’s full of screenshots—screenshots of Chat Noir merchandise.</p>\n<p>And then, Adrien is laughing. It’s hiccuping and not flattering, but it’s laughter—he hasn’t laughed in weeks.</p>\n<p>“You don’t have to buy all this, Chloe. You don’t even like Chat Noir.”</p>\n<p>“He’s my favourite superhero,” she says indignantly, and then pauses. “Well. Almost my favourite superhero.”</p>\n<p>“It’s okay. I know you have a huge crush on Ladybug. She’s great.”</p>\n<p>He scrubs a hand through his knotted hair. Chloe had complained about his appearance, but she hasn’t left. She hasn’t wrestled him into better clothes or made fun of him. She’s here, and she’s trying so hard to make an effort.</p>\n<p>Being here, in Marinette’s living room, eating her pastries, watching Chloe’s stiff shoulders as she talks about expensive Chat Noir merch, knowing Nino and Alya are coming over later to see him—it makes him feel warm, where he’s been feeling cold for weeks. It makes him feel like everything could be okay again.</p>\n<p>“Ladybug is so perfect,” Chloe says. “You’re perfect, too, of course, but Ladybug is … ”</p>\n<p>They both sigh dreamily.</p>\n<p>“This is weird,” Marinette says from the doorway. Adrien flushes. Chloe—aware of Adrien’s identity, but oblivious to Marinette’s—sticks her tongue out at her.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>On Monday, four days after Hawkmoth’s arrest, Adrien wakes to a stone in his stomach.</p>\n<p>Tikki hovers in front of him. Plagg is still curled in the collar of his pyjama shirt, snoring.</p>\n<p>“I don’t know if I can do this,” Adrien says quietly, fidgeting with the thick blankets.</p>\n<p>“You’ll be okay, Adrien,” Tikki says. “You’re stronger than you give yourself credit for. And your friends will be with you the entire time.”</p>\n<p>“I just want to crawl back under the covers and sleep all day.”</p>\n<p>“The sooner you go back to school, the sooner everything will feel normal again.”</p>\n<p>Plagg rolls out of Adrien’s shirt and yawns, bobbing in the air. “Optimism only gets you so far, Tikki. We all know that things can’t just ‘go back to normal.’”</p>\n<p>Tikki scowls at him. “I know they can’t, but the sooner Adrien and Marinette do everyday things and settle into a routine, the sooner they’ll be able to feel like themselves again.”</p>\n<p>Plagg rolls his eyes and flies up to perch in Adrien’s bedhead. “Don’t put pressure on them to snap back to normal. Recovery isn’t a straight line.”</p>\n<p>“It’s better than staying holed up in here and being pessimistic.”</p>\n<p>Adrien gets up before the two kwamis can bicker anymore. He gathers up some clothes and gets dressed in the bathroom. The hair product he normally uses is still at the Agreste mansion. There’s no one to scold him for leaving the house with his hair looking messy, either, but Adrien would rather not draw more attention to the fact that he’s Chat Noir. He pulls Plagg out of his hair, runs the comb under the tap, and tries to flatten his hair out. He’s partway successful.</p>\n<p>When Marinette finally wakes up after a lot of prodding and a gentle reminder from Tikki that Adrien needs her, today of all days, they go downstairs and have sausage and eggs for breakfast. Not porridge. Not watery oatmeal. Adrien’s stomach is tied up in knots, but he asks for seconds, just so he can hear Mrs. Cheng say yes.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Adrien is reminded of his first day at public school, when he was nearly mobbed by students on the short walk to the classroom. But, this time, it’s worse.</p>\n<p>The police have cleared the front of the school of reporters by the time Adrien and Marinette arrive. Adrien waves shyly at the officers hovering in front of school grounds, and receives several knowing smiles and waves back.</p>\n<p>When they jog into the school proper, there’s a moment of silence, everyone digesting his presence, and then Adrien is surrounded by students. They’re all talking at once. Adrien glances from one face to another. His palms are sweaty. He thought he was prepared for this, but his chest is tight, and he’s lost sight of Marinette, and he can barely feel Plagg pressing up against his chest beneath his sweater.</p>\n<p>And then Chloe is there, barring her teeth, threatening to have her father arrest every single one of them. She grabs Adrien around the arm, and bodily drags him out of the crowds. Adrien barely notices Kim and Ivan jumping in front of the crowd, and standing resolutely between Adrien and the other students.</p>\n<p>“I don’t like them,” Chloe begins, “but your little friends at least recognise how impressive I am.”</p>\n<p>Adrien blinks. “They sent you in after me?”</p>\n<p>Chloe drags them over to Nino, Alya, and Marinette. Adrien receives a fresh wave of hugs. Chloe clings to him all the way to class. Adrien is grateful; this way, no one can tell how much he’s clinging back.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>The city gives Ladybug and Chat Noir awards.</p>\n<p>Adrien isn’t sure how much of it is Chloe influencing her father, or Mayor Bourgeois wanting to cash in on the heroes’ popularity, but a week after Hawkmoth burns half of Paris to ash, Marinette and Adrien stand in front of city hall in full costume while Mayor Bourgeois hangs medals around their necks.</p>\n<p>Adrien ignores the sea of cameras and the black hole in his chest, and instead focusses on the way the medal looks against Marinette’s collarbones, like she was born to wear to it. He focusses on Chloe off to one side, preening like she’s the one receiving an award. He focusses on Paris behind them, whole and untarnished, as though untouched by the Agreste family.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Adrien quits his extracurricular lessons. Fencing, Chinese, piano—it all feels pointless right now. He might go back to fencing, one day. It was the only thing he really enjoyed.</p>\n<p>He’s offered a hundred different modelling jobs. Companies he’s worked with, companies he’s never even heard of—all of them want Adrien Agreste, the victimised son, or Chat Noir, the suave superhero.</p>\n<p>Adrien quits modelling, too.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Nathalie spends time in police custody. Adrien doesn’t know if she’s released without charges, or if she works out a deal instead of facing jail time, but she walks out of the station of her own accord, holding a hand up to shield her face from the cameras. And then, two weeks after Gabriel Agreste is unmasked as Hawkmoth, Nathalie takes over Gabriel fashion.</p>\n<p>There’s talk of renaming the brand, and remodelling the company entirely, so to completely detach themselves from Gabriel Agreste’s blackened name.</p>\n<p>Adrien hasn’t spoken to Nathalie. He has questions: did she know that Father was Hawkmoth? Did she help him? Did she know, like Father did, that he was Chat Noir?</p>\n<p>But the thought of seeing Nathalie leaves Adrien feeling hollow. He wasn’t important to her. And she was only important to him, because, during the years spent trapped inside that cavernous house, he clung to every spare glance, every familiar face, every moment he wasn’t alone, or left making small talk with strangers.</p>\n<p>Unlike his coworker, the Gorilla seeks Adrien out. Sabine tries to stop him, forming a tiny, human blockade in the doorway to the apartment, but Adrien squeezes past her, and into the bakery proper.</p>\n<p>The Gorilla never talked much. He never needed to. But now, dwarfing the family bakery, his hands held stiffly by his side, the Gorilla opens his mouth, and says, “I’m sorry.”</p>\n<p>“For what?” A thought comes to him like an icepick through his stomach. “Did you know?”</p>\n<p>The Gorilla shakes his head, no. “Not that he was Hawkmoth. But I knew what sort of man he was.”</p>\n<p>“What?”</p>\n<p>“He was an unkind man,” the Gorilla says. “To you, especially.”</p>\n<p>Adrien stares at his shoes. Distantly, he’s aware of Sabine in the doorway. This is her store; they shouldn’t be doing this here. Adrien, especially, shouldn’t be doing this here. It would bring the wrong kind of attention to the bakery.</p>\n<p>“I didn’t know he was a terrorist,” the Gorilla goes on, “but I knew how he treated you. And I knew you were Chat Noir.”</p>\n<p>Adrien’s eyes fly up to look at the Gorilla. “You knew? How?”</p>\n<p>“It was my job to watch you. You were decent at slipping away, but not that decent.”</p>\n<p>“You let me get away?”</p>\n<p>The Gorilla nods. “There were a few times, towards the end, when I wondered if I shouldn’t just let you go running into a fight.”</p>\n<p>Adrien stares at him blankly. “Why?”</p>\n<p>“You’re a kid. A kid shouldn’t be in danger,” the Gorilla says, as though it’s obvious, as though it’s that easy. As though Father wasn’t the one that created the danger.</p>\n<p>As if Father wasn’t the danger.</p>\n<p>The Gorilla leaves the bakery with a box full of pastries (that he asked Adrien to pick out). And that evening, Adrien types up a reference letter—touching on the protection he received for years, and the way he, as a superhero, admired the Gorilla’s devotion towards guarding people—and sends it via email. A week later, the Gorilla accepts a position as head security to one of Europe’s leading politicians.</p>\n<p>(And Adrien learns that his name is Victor. Adrien still prefers ‘the Gorilla.’)</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>The lawyer hands over a white envelop. <em>Adrien Agreste,</em> it says on the front in Father’s handwriting.</p>\n<p>“Does he want to see me?”</p>\n<p>The lawyer stands, and smoothes out his suit jacket. “He asked me to deliver that to you. That’s all.”</p>\n<p>Adrien doesn’t know if he wants to see Father. The idea of standing in front of him or talking to him twists his stomach up, but he has so many questions. There is still so much left unsaid. Things Adrien doesn’t understand.</p>\n<p>“But all this work he put into handing all the family assets over to me, after everything, doesn’t he want to—”</p>\n<p>“I have to go now.” The lawyer nods coolly, and lets himself out. Adrien can hear him thanking Tom and Sabine before leaving.</p>\n<p>Adrien sits on the couch, staring at the envelop, until Plagg wriggles out of his shirt pocket. “Well, that felt familiar.”</p>\n<p>Adrien crumples up the letter. He could throw it out, he realises. There’s no one here that will make him open it. He doubts anyone will even blame him if he never wants to read anything Father sends him.</p>\n<p>But that idea leaves him feeling cold; he didn’t want Father to fall out of his life. He didn’t want any of this to happen. He didn’t want to lose the last part of his family.</p>\n<p>Tom and Sabine come in, gently asking how the meeting went. Adrien pulls on a polite smile, and excuses himself to Marinette’s room. She watches him from her desk.</p>\n<p>“I need some air,” he says, and climbs up onto the balcony. Marinette, thankfully, understands his need for space.</p>\n<p>He looks over the street. He wants to transform, and run through the city, but he doesn’t want to be Chat Noir right now. The thought of being Chat Noir is heavy, in a way it’s never been before.</p>\n<p>Adrien sits down against the rails. Plagg curls up in his hair, his tail falling over his forehead. Adrien opens the envelop, pulls out the letter, and begins to read.</p>\n<p>\n<em>Adrien,</em>\n</p>\n<p>\n<em>I have ensured that the lawyers will take care of the Agreste accounts properly, so that you may have the funds to live independently. I know there may be terrorism charges stacked against me—I do not want the Agreste fortune seized if this is the case. It should also be simple to get yourself emancipated. I imagine that, by the time you receive this letter, you will already be in the process of doing so.</em>\n</p>\n<p>\n<em>My name is tarnished, but I have no doubts that yours is as powerful as ever. Perhaps more powerful, now, after your little revelation. If you associate with the right people and maintain your influence, your modelling career will flourish. It will take you through to adulthood and beyond. I assume I do not need to tell you not to revive the Gabriel name. You must learn to recognise when certain associates become more of a drain than an advantage, and when this time comes, you must drop them so they do not drag you down with them. My name is not just a drain; it is a black hole.</em>\n</p>\n<p>\n<em>I would advise you to also drop that foolish girl, but you have made it clear that she means more to you than anything else, including your own family. She is powerful, at least. You have good instincts to jump ship when you did, so that you could avoid scorn and maintain the public’s trust, even if it was at the cost of your mother’s life.</em>\n</p>\n<p>\n<em>Do me one favour, Adrien. Even if you threw away your family, do not dispose of your mother’s photographs and paintings. They are all that is left of her, now. Even if you do not care for her visage anymore, place them in an art museum or move them to a storage container. Do not destroy her again.</em>\n</p>\n<p><em>I do not even know if this letter will reach you. And if it does, then I do not know if you will even read it. You do not listen to your father, as of late. I should have listened when they told me that children grow up faster than I could ever</em> <em>imagine.</em></p>\n<p>\n<em>I do not ask that you visit, but maybe one day, you will see me again. Not now, however. I cannot imagine we will have much to say to one another anytime soon.</em>\n</p>\n<p>\n<em>Sincerely,</em>\n</p>\n<p>\n<em>Gabriel Agreste</em>\n</p>\n<p>Adrien puts down the letter. He stares at the potted planets across from him, unseeing. He feels—he doesn’t know how he feels.</p>\n<p>Terrible, he realises after a long moment of staring at the sun-drenched plants. He feels terrible.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Adrien’s emancipation hearing is a quick, private affair.</p>\n<p>The judge interviews Adrien and several people closest to him. His friends, a few teachers, and Nathalie. The interviews take place the week before the court date, and Adrien is only present for his own.</p>\n<p>The hearing itself lasts half an hour. Adrien agrees to therapy sessions and annual meetings with a social worker, and then—with the reassurance that Adrien has the means to support himself financially, and the maturity and support system to do so emotionally—Adrien is emancipated.</p>\n<p>It feels—</p>\n<p>It feels like freedom. It feels like abandonment. It feels like a long-forgotten dream that was always hovering on Adrien’s horizon, the thing he wanted but never understood.</p>\n<p>He understands it now. It’s a beautiful, terrible thing. Adrien can hardly breathe around the painful, too-big feeling in his chest.</p>\n<p>He wants to cry, but his cheeks are dry. He goes into the hallway and nods, too dazed for words, and lets his friends sweep him up into hugs. He smiles as Nino swoops in three more times to hug him, but it doesn’t feel real. His heart, thumping against his ribs, is hard to ignore.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Gabriel Agreste’s trial lasts almost two weeks.</p>\n<p>On the witness stand is a gallery of familiar faces. Akuma victims, including a slew of Adrien’s classmates. Alya, Nino, and Marinette. Gabriel models and designers. The Gorilla. Nathalie. Ladybug.</p>\n<p>Adrien is called up more than once to speak as Chat Noir, Gabriel’s direct opponent, and Adrien Agreste, Gabriel’s son.</p>\n<p>When the prosecution starts throwing around the word <em>victim</em> in reference to Adrien, he has to stuff his hands under his thighs to keep himself from bolting out of the courtroom. When the prosecution depicts Father as an abusive monster, he chews on the inside of his mouth until he tastes blood.</p>\n<p>Adrien was unhappy at home. He felt unsafe during those last few weeks, but, until he had woken up and seen Father silhouetted in his bedroom doorway, that had only been paranoia. Father was controlling and cold, but he wasn’t hateful. Adrien was isolated. He was often hungry. And some weeks ago, when he had snuck out to visit Nino’s, sitting thigh-to-thigh on his bed while Adrien cried in that silent, crumbling way of his, he hadn’t argued when Nino put a hand on Adrien’s shoulder and said, tentatively, <em>That’s abuse.</em></p>\n<p>But this is different. While every media outlet reports that Gabriel Agreste was a violent, self-centred psychopath, Adrien remembers being small and Father touching his hair after he’d aced another test; Father holding his scribbled drawings like they were something precious, and framing them around his office; Father, dressed as Hawkmoth, his eyes wild behind the mask, lashing his sword against Adrien’s baton; Father, collapsed against Mum, crying into her ashy hair.</p>\n<p>Father is silent and emotionless in the courtroom. His shoulders are straight, and his hair is brushed. His bloodshot eyes and the chalky pallor of his face are the only indications that he’s hurting.</p>\n<p>When Adrien takes to the witness stand, he steals quick glances at Father.</p>\n<p>Father fixes his eyes on the wall. He never once, in the entire eight days the trail runs, looks at Adrien.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Adrien isn’t alone for the first month after Father’s arrest.</p>\n<p>He's used to being around people most hours of the day, but living with other people is entirely new. It’s the little things that leave him feeling punched out and breathless: waking up and seeing Marinette, or Nino, or Alya, or Chloe across the room from him, rather than open, empty space; stumbling down to breakfast and sitting down with people who smile and ask him how he slept; being welcomed home from school, knowing there is no where else he needs to be; helping Nino wash and dry dishes, getting suds down his designer jeans, laughing as Nino makes a bubble-beard out of dish soap; standing in Marinette’s cramped kitchen and quietly helping Tom chop vegetables, listening to his gentle voice as he teaches Adrien the recipe.</p>\n<p>It’s a lot to get used.</p>\n<p>Adrien can eat what he wants now. Wear what he wants. Go where he wants. There are no more schedules dictating his life.</p>\n<p>He misses it, sometimes. For all the years he suffocated under a colour-coded schedule, he misses the surety of knowing where he was supposed to be. When he was lost, he would go to Nathalie, and she would list off his timetable for the day, narrowed down to the minute.</p>\n<p>Adrien is lost most days, but now, there’s no Nathalie to tell him where to go. Sometimes, the freedom is a relief. Sometimes, it makes it hard to breathe.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Adrien puts weight on.</p>\n<p>Chloe catches him looking in the mirror, shirt hiked up around his throat, prodding his stomach. He’s been stick-thin for so long; every small change in his weight is immediately noticeable.</p>\n<p>She comes up behind him, startling him. He drops his shirt. She pulls it back up, pokes him in the side, as though testing how easy it is to feel his ribs—or how easy it isn’t, compared to months earlier, when his ribs stuck out.</p>\n<p>Chloe nods. “Better.”</p>\n<p>Adrien rubs at his side. “Better?”</p>\n<p>“Better. I guess that bakery isn’t completely terrible.”</p>\n<p>“You like their strawberry eclairs,” Adrien says. She likes more than their strawberry eclairs. She likes most of the store. She has a sweet tooth to rival his; it’s one of the newfound things they’ve bonded over.</p>\n<p>“I like how close it is to the school,” Chloe says, flipping her ponytail over her shoulder. “Now, come on. I want to feed you more pasta.”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>He wears whatever he wants.</p>\n<p>He bounces from house to house—always ending back at that small apartment that smells like baked bread, where the Dupain-Chengs welcome him with matching smiles—so his wardrobe is constantly shifting. He likes borrowing Nino’s clothes; he has tracksuit pants and hoodies worn into an unbeatable softness.</p>\n<p>Chloe likes to play dress up. Adrien slept at her house, something he hadn’t done since they were very small, and the next time he went up to the penthouse at the Grand Hotel, she had suddenly acquired a dozen different things in his size. (Tucked neatly next to her growing collection of Chat Noir merchandise.)</p>\n<p>Marinette likes to play dress up even more than Chloe, but with her, it’s different. She likes when he wears her things. The things she made.</p>\n<p>Adrien likes it, too. He knows the importance of wearing clothes made by someone you love.</p>\n<p>His outfits become a mash of designer clothes and faded hoodies, homemade clothes and expensive things foisted onto him by Chloe. He wears borrowed clothing, and feminine clothes, and clothes with holes in them, because he can.</p>\n<p>He stops wearing product in his hair. Father had disapproved of his naturally messy hair. But now—without the bathroom cabinets full of expensive hair product, and with his friend’s hands always tussling it, and the kwamis' constantly settling there and napping in his hair—Adrien’s hair is thicker and more untamed than ever. He looks like Chat Noir during the day. It’s freeing; it’s like Adrien has stolen some of the freedom he had felt when he was the mysterious, masked Chat Noir and taken it into his personal life.</p>\n<p>(One day, maybe soon, Adrien will branch out into his own style. There are things he’s attracted to, like the sketch in Marinette’s notebook of a leather jacket with green paw prints sewn down the back, and blanket-like scarves, and graphic t-shirts with puns scrawled on the front.</p>\n<p>But for now, he’s exploring. For now, anything his friends give him, anything Marinette has made, is more than enough.)</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Being in public is strange. Before, he would occasionally be recognised as Adrien Agreste, son of a famous fashion mogul, but it’s different, now. A superhero is more famous than a teenage model.</p>\n<p>The tourists are the worst. When they see Adrien—boring, everyday Adrien in the pastel green sweatshirt Marinette made him, stopping to buy coffee before school—they don’t see a sixteen year old. They see a superhero.</p>\n<p>His friends come in handy. Nino likes to stand in front of him, and pull ugly faces at whoever has their phone pointed at him without his permission. Alya calls people out for invading his privacy, comfortable with making a scene. Or, alternatively, she pulls out her phone, and films them right back.</p>\n<p>And through it all is Marinette.</p>\n<p>Even though her own identity could be compromised with how much time she spends with him, Marinette is always there, ready to tell people off. She’s there to gently tug Adrien away from busy public streets. She’s there when it gets too crowded, patting his hair when he hides his face in her neck. She’s there with beanies, and scarves, and hoodies that hide his gold-blond hair. She looked into fashionable face masks, just for him.</p>\n<p>Adrien loves her so much that he might die of it, too many emotions stuffed into his chest, too much of that easy, warm love for one human body.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Adrien buys an apartment, even though everyone tells him he doesn’t have to. Chloe spends weeks shoving photos of the Grand Hotel in his face, and telling him that he can stay there indefinitely, free of charge. Nino relays the many messages from his family, worried about Adrien living on his own. Alya just cackles, and vows to be over every other day to enjoy the quiet and mooch on his wifi.</p>\n<p>When he moves in, Sabine and Tom pile him with food. Nino comes over with potato bake casseroles from his mother, apologetic as he hands them over, and then runs into the living room to check out the game console Marinette helped set up the night before.</p>\n<p>Adrien has his grocery delivered regularly so he doesn’t forget, or have to go out to get them. He googles recipes, and prints them out, and pins them to his fridge.</p>\n<p>He learns that he’s a bad cook. It takes a while before his dishes shift from blackened and inedible, to passable.</p>\n<p>It’s not easy. His newfound freedom scares him, sometimes. So do the freedoms that have been taken from him—the way he struggles to go out in public without being recognised; the new rumours that have started up at school; the weird, hovering way people look at him, sometimes.</p>\n<p>But he’s okay, and that scares him, too. He wishes Father wasn’t Hawkmoth, that it never happened, that it didn’t still leave him waking in the dead of the night, crying into Plagg’s fur—but he’s okay. Adrien is okay.</p>\n<p>The revelation brought him closer to his friends. It brought him Marinette. It brought him a life that’s not ruled by a schedule. It gave him the ability to be known for something more than his modelling, or Father’s fashion. He’s known for his efforts as Chat Noir, his bravery, not just for his pretty face.</p>\n<p>Somedays, it feels like his life should have stopped the moment he stumbled into that hidden, shadowy room, and found the mass of bone-white butterflies. He feels like a bad person for letting time run past that moment. Somedays, he feels bad for living past it.</p>\n<p>He feels bad for living.</p>\n<p>But time, too, will eat up this feeling, until the vivid ache inside him feels less like a fresh bullet wound, and more like an old, puckered scar.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Paris is a thousand pale gold lights in the nighttime. Marinette watches the view quietly, waiting for him.</p>\n<p>Adrien lands on the Eiffel Tower, baton clinking against the railings. “Thanks for coming, Marinette.”</p>\n<p>“Nightmares?”</p>\n<p>“Yeah.”</p>\n<p>She laces their fingers together. They do it so often that this, the way their fingers slot together, the way their palms rub together, feels like muscle-memory.</p>\n<p>“Me, too,” Marinette says. “But we’ll be okay.”</p>\n<p>“Hm.” His hand tightens around hers for a moment. She squeezes back.</p>\n<p>“We will,” she says again, more firmly. “You’re going to be okay, Adrien.”</p>\n<p>Adrien pulls her up onto the railings. They stand there, hundreds of metres above the asphalt. The wind ghosts through their hair. Adrien dislodges the lump in his throat, pushes past the guilt and fear—always inside him but retreating day by day, like a jar of mud settling over time, dirt and sediment sinking to the bottom, leaving the water less murky with every passing moment—and says,“I think I’m already halfway there.”</p>"
}