{
  "id": "13590312",
  "url": "https://archiveofourown.org/works/13590312?view_full_work=true",
  "author": [
    "thestarsabove"
  ],
  "title": "fever started long ago",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "방탄소년단 | Bangtan Boys | BTS"
  ],
  "relationships": [
    "Jeon Jungkook/Kim Taehyung | V"
  ],
  "characters": [
    "Jeon Jungkook",
    "Kim Taehyung | V",
    "Jung Hoseok | J-Hope",
    "Kim Seokjin | Jin",
    "Park Jimin (BTS)",
    "Kim Namjoon | RM",
    "Min Yoongi | Suga"
  ],
  "additional_tags": [
    "Pining",
    "Friends to Lovers",
    "Smut",
    "Fluff",
    "Canon Compliant",
    "but with magic?"
  ],
  "language": "English",
  "series": "Part 1 of like a heat wave (burning in my heart)",
  "published": "2018-02-06",
  "completed": null,
  "words": "22,840",
  "chapters": "1/1",
  "comments": "603",
  "kudos": "16,703",
  "bookmarks": "4,434",
  "hits": "277,413",
  "summary": "<p>Where there is love, there is warmth. Where there is honesty, there is relief.</p>\n<p>In which Taehyung eats a magical fortune cookie and wakes up physically dependent on Jeongguk’s body heat.</p>",
  "notes": "<p>Honestly I have no excuse for this, basically it’s a lot of smut with some plot and fluff thrown in there.</p>\n<p>Title comes from Fever by Peggy Lee.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>\n<a href=\"https://streetlightserenades.tumblr.com/\" rel=\"nofollow\">Tumblr</a>\n<br>\n<a href=\"https://mobile.twitter.com/thestarsabove\" rel=\"nofollow\">Twitter</a>\n</p>",
  "text": "<p>As a rule, Taehyung has never been particularly good at following directions. He doesn’t do it on purpose - he just gets distracted, or forgets, or gets curious about what would happen if he takes a different approach. This has resulted in some funny outcomes, for example when he tried to give Yeontan a bath and accidentally turned him pink for a few days, and some less funny outcomes, ie when he tried to install a giant lava lamp in his room and ended up shorting the power to half the dorm. Luckily, none of these misadventures have had particularly serious consequences - that is, until The Saga that begins at the 2018 Golden Disc Awards.</p>\n<p>In retrospect, Taehyung acknowledges that the lady at the concession table probably did tell them that the purple fortune cookie was FOR SHOW ONLY, DO NOT EAT. At the time, though, taking this cookie seems like the obvious choice, mostly because it’s purple, duh, and how often does one see a purple fortune cookie? For the record, it tastes really good, too, which is why he shovels the whole thing into his mouth before he even spares a glance at the fortune itself. </p>\n<p>It’s longer than a usual fortune, written in scrawling purple font across a folded piece of white paper. It’s also less generic than the fortunes Taehyung is accustomed to seeing, with messages about changes on the horizon or finding success in life. The paper reads:</p>\n<p>\n<em>Where there is love, there is warmth.<br>\nWhere there is honesty, there is relief.</em>\n</p>\n<p>Not one he’s seen before, but he doesn’t think much of it, going to toss the slip into the trash.</p>\n<p>“Wait!” A stern voice makes him freeze, and he looks up to see the concession table lady. “Did you eat the purple cookie?” she asks sharply. Her tone seems a little serious for a question about a fortune cookie, but maybe she’s having a bad day.</p>\n<p>“Umm... yes?” Taehyung says.</p>\n<p>The woman shakes her head, muttering something to herself about privileged boy band members. “You’re going to want to save that,” she says, nodding at the fortune.</p>\n<p>Taehyung looks down at the crumpled piece of paper in his hand, confused. “...why? Is it like, a special fortune?”</p>\n<p>“You could say that,” the woman replies. “Good luck.” And then she bustles off surprisingly quickly for a woman of her age.</p>\n<p>Taehyung blinks, not sure what to make of this encounter. Then he shrugs, slips the fortune into his back pocket, and gets distracted by Hoseok and Namjoon waving him over for a selfie.</p>\n<p>They win the Daesang, which is incredible and mind blowing and emotional, as it has been every time. As Taehyung stands in a shell-shocked huddle with the other members, their arms wrapped around each other, all he can think is how grateful he is, for their success but especially for these people. They’ve been through so much together, and he can’t imagine doing it without these 6 boys by his side. </p>\n<p>They go home that night, as they’ll need to be up early for a full day of last minute promo and rehearsals for the 4th Muster tomorrow. As is often the case, Taehyung follows Jeongguk into whatever car he’s shepherded into, and they curl up in the backseat, Taehyung dropping his head onto Jeongguk’s shoulder. </p>\n<p>“Do you think that feeling of winning will ever get old?” he asks sleepily.</p>\n<p>“I dunno,” Jeongguk replies through a yawn. “I hope not, I never want to take it for granted.”</p>\n<p>“Mm,” Taehyung hums in agreement, snuggling closer into Jeongguk’s side. “You’re so nice and warm.”</p>\n<p>Jeongguk doesn’t say anything in response, just absentmindedly runs his fingers through Taehyung’s hair as they drive through the darkness. </p>\n<p>***</p>\n<p>Taehyung wakes up the next morning shivering so violently that he at first thinks he’s somehow ended up outside. When he looks around and establishes that he is in fact in his room, in his bed, he stumbles over to the thermostat, wondering if the heat had cut out overnight. It reads 22 degrees Celsius, a perfectly normal indoor temperature, but he twists the dial up anyway before diving back into his bed and burrowing as far as he can under the blankets. None of this seems to help, and he’s starting to get concerned that he’s going to bite his own tongue off with how hard his teeth are chattering.</p>\n<p>He sticks a hand out from under the covers, feeling around for his phone until he locates it on his bedside table. With shaking fingers, he types out a message to the boys:</p>\n<p>&gt;sos am maybe dying pls come to my room&lt;</p>\n<p>No one responds immediately, but there’s a soft knock on his door a few minutes later, and Jimin appears, his hair still sticking up from sleep.</p>\n<p>“What’s the matter, drama qu- “ he begins, but then his focus actually settles on Taehyung, and he cuts himself off. “Shit, are you okay? You’re shaking like a leaf.”</p>\n<p>“I’m f-freezing,” Taehyung stutters out. His fingers feel numb, even where he has them tucked under his armpits. “I don’t know what’s wrong with me, I just woke up feeling like this.”</p>\n<p>“Seriously?” Jimin says, concerned. “It’s like, a million degrees in here.” He crosses the room to Taehyung’s bed, pressing a hand to his forehead. His touch feels lukewarm, an improvement from Taehyung’s current state but not by much. “Jesus Christ, your skin is ice cold.” He looks genuinely worried now.</p>\n<p>“Told you,” Taehyung says weakly.</p>\n<p>“I’m going to get Seokjin hyung, hang on,” Jimin tells him, hurrying out of the room. He reappears with Seokjin in tow a few minutes later. Seokjin takes one look at Taehyung and his mouth droops into a frown to match Jimin’s.</p>\n<p>“Shit, you weren’t kidding,” he says once he’s had a chance to feel Taehyung’s skin for himself. “I think we should ask management about calling a doctor, this is intense.”</p>\n<p>“Shouldn’t we at least try to warm him up first?” Jimin asks, lifting up the covers and sliding into bed next to Taehyung. He wraps his arms around his torso, hugging him close. “Does this help at all?”</p>\n<p>“Maybe a li-little,” Taehyung says. He’s starting to get freaked out himself - why is nothing helping?</p>\n<p>“His lips are literally blue, I’m getting management,” Seokjin declares, just as the door to Taehyung’s room opens and a sleep-rumpled Jeongguk appears.</p>\n<p>“What’s going on?” he asks, looking between the three of them, his gaze snagging briefly on Jimin essentially spooning Taehyung in his bed.</p>\n<p>“Taehyungie is sick,” Jimin says. “His skin is freezing and he can’t get warm.”</p>\n<p>Jeongguk’s eyebrows shoot up in concern, and he walks over to the bed, pressing a tentative hand to Taehyung’s cheek.</p>\n<p>The reaction is instantaneous. Warmth, glorious warmth, shoots through Taehyung’s body as if emanating from the place where Jeongguk had touched him. Taehyung flinches hard in surprise, gasping, and Jeongguk pulls back sharply, looking embarrassed.</p>\n<p>“Sorry, I’m sorry,” he says hurriedly, backing away like a kicked puppy. </p>\n<p>“No,” Taehyung says, shaking his head and reaching out for him. “No, wait, do that again, please.”</p>\n<p>They all stare at him, but Jeongguk complies, inching forward until his knuckles brush against Taehyung’s cheek again. Taehyung sighs in relief, the same warmth seeping through his body.</p>\n<p>“You’re so warm,” he explains. Jeongguk looks down at him with wide, searching eyes, but he doesn’t move his hand.</p>\n<p>“Like, warmer than Jimin?” Seokjin asks, pressing a hand to both Jeongguk and Jimin. “They feel the same to me.”</p>\n<p>“I dunno,” Taehyung says. “Jeonggukie feels warmer. Like, really warm.”</p>\n<p>“Jeongguk, switch places with Jimin,” Seokjin instructs, his forehead knit with confusion. </p>\n<p>Jeongguk’s eyes get even wider. “I - ” he stammers, but Seokjin shushes him.</p>\n<p>“Quickly, it seems like the only thing that will help right now.”</p>\n<p>Jeongguk shuts his mouth and nods, slipping under the covers as Jimin scrambles out to make room for him. </p>\n<p>“Oh my god,” Taehyung whimpers, burrowing against him immediately. Jeongguk feels like a giant heater, a welcome respite to the brutal cold wracking his body. </p>\n<p>“Is that better?” Jeongguk asks, eyes soft with concern. </p>\n<p>“So much better, thank you,” Taehyung replies. Jeongguk wraps his arms around him, hooking his chin over Taehyung’s shoulder, and Taehyung sighs contentedly.</p>\n<p>Seokjin and Jimin are both staring at them now, completely bemused. </p>\n<p>“You’re not shaking anymore,” Jimin points out. </p>\n<p>“This is bizarre,” Seokjin says. “Let’s get the other boys and see if they’re feeling okay.”</p>\n<p>And so Namjoon, Yoongi, and Hoseok are summoned, filtering into the room in various states of alertness given that it’s hardly 7am. They all feel fine, but none of them have the same effect on Taehyung as Jeongguk - they all feel lukewarm, like Jimin had. </p>\n<p>“I still feel like we should call a doctor,” Seokjin says, and Namjoon nods in agreement. “I’m glad Jeongguk is helping, but this is definitely not normal.”</p>\n<p>“They’re going to think I’m on some sort of weird drug trip,” Taehyung protests.</p>\n<p>“<em>Are</em> you on some sort of weird drug trip?!” Jimin asks, alarmed.</p>\n<p>“No!” Taehyung replies, indignant. “You know I would never, come on.”</p>\n<p>“Maybe we should give it a day,” Namjoon says practically. “It could just be a weird bug, or something, and maybe Jeongguk just gives off extra body heat. Taehyung seems okay now.”</p>\n<p>This is true - with Jeongguk wrapped snugly around him, Taehyung feels mostly fine. Still a little chillier than usual, maybe, but nothing unbearable.</p>\n<p>“I can stay with you for the day, just in case,” Jeongguk offers, and Taehyung squeezes his hand in thanks. </p>\n<p>“Okay...” Seokjin says reluctantly. “But if gets bad again, I’m telling management.”</p>\n<p>“Deal.”</p>\n<p>The rest of the boys disperse to get ready for the day’s activities - they have to do some last minute promo shots for the Muster, and then they have choreography rehearsals all afternoon. The photo shoot won’t start until later in the morning, so Taehyung and Jeongguk are left alone for a few hours to explore the nuances of their new... situation.</p>\n<p>They discover that, if Jeongguk touches him for long enough, the residual warmth seems to stay with Taehyung, and he can be okay on his own for a little while. It also becomes apparent that the more of their bodies that are touching, the more it helps, and bare skin seems to be especially effective (although they skirt neatly right around the implications of that). </p>\n<p>This last discovery comes when they’ve ventured to Jeongguk’s room and broken apart temporarily so that he can get dressed. Taehyung starts shivering again while Jeongguk is standing in front of his closet, still shirtless as he ponders aloud about what to wear. </p>\n<p>“Should I wear my red sweatshirt or the graphic one?” he asks. “Or wait, there’s the gray one from Topman - oh, fuck, you’re shaking.”</p>\n<p>“Sorry,” Taehyung says as Jeongguk hurries over and wraps his arms around him. </p>\n<p>Jeongguk has worked a lot on getting stronger in the past year, and the change in his body is not lost on Taehyung, no matter how much he tries not to focus on it (he fears his head might explode if he does). He’s always been toned, but he has muscles now, sculpted arms and a set of abs that Taehyung tells himself would make any normal human take a second look. It would be more distracting to have said muscled arms and chest pressed against him right now were it not for the huge rush of heat that hits him as soon as they touch.</p>\n<p>“Oh my god, you’re even warmer without a shirt on,” Taehyung hums appreciatively, burrowing into him. </p>\n<p>Jeongguk coughs. “Oh, really? I guess that makes sense.”</p>\n<p>“Mm. I like the red sweatshirt.”</p>\n<p>Jeongguk tows him over to the closet, keeping one arm around his waist and only removing it when he pulls a T-shirt and the sweatshirt over his head. Taehyung tries not to whine audibly at the loss of his direct body heat. On the bright side, at least now he has a valid, not creepy excuse for wanting Jeongguk to be shirtless all the time.</p>\n<p>“This is really weird,” Jeongguk observes, hopping around on one foot to get his shoes on since one of his hands is linked with Taehyung’s. “Do you think I’m like, supernaturally warm or something?” He pauses, his face lighting up with excitement. “Maybe I’m a werewolf!”</p>\n<p>“Does that make me a vampire?” Taehyung asks, making a face. “I’m not craving blood. Although I could go for some lunch soon, are they ordering food for the photo shoot?”</p>\n<p>Jeongguk shrugs, assessing himself in the mirror. When did his jaw line get so defined, Taehyung wonders? It seems like just a few minutes ago he was just a baby faced teenager - when did he become this man who Taehyung is, regrettably, finding himself more and more attracted to?</p>\n<p>He and Jeongguk have been close pretty much since the beginning, although it had taken a little while for Taehyung to wear through his shyness and general aversion to being touched at first. But soon enough it became clear that they actually had a lot in common, and a special bond developed between them. Taehyung feels extremely close to all six members - they’re a family by now - but it’s no secret that Jeongguk is his number one, and vice versa. It’s never amounted to anything more than a very deep friendship though, and Taehyung has accepted that, even though he would be lying if he said the thought had never crossed his mind. They’ve had their close calls, moments when it felt like things were tipping into uncharted territory, but nothing ever came of it. It’s better this way, Taehyung has convinced himself - easier, neater. He just wishes Jeongguk would stop getting hotter (no pun intended) seemingly with each passing second, because even though his mind is practical, his body certainly is not.</p>\n<p>The promo shots are being done in-house, so Jeongguk gives him a piggy back to the studio where they’ve been told to meet. It ends up not mattering which sweatshirt Jeongguk picked, because the stylists adjust their outfits anyway, switching out certain items and fussing with their hair. It’s a testament to how touchy Taehyung is to begin with that no one bats an eye at him following Jeongguk around all day, clinging to him at every chance he gets. He can feel the boys watching him more closely than usual, especially Seokjin and Jimin, but they seem somewhat appeased once they see Taehyung acting like his usual self. </p>\n<p>The choreography rehearsals go smoothly as well, and the exercise seems to help a little, which is reassuring. Taehyung sticks close to Jeongguk just in case, linking their arms together or latching on to him from behind whenever he starts to feel cold again. He feels sort of like an addict, taking hits of Jeongguk to keep himself feeling normal, but it works like a charm every time. All he knows is that he’s grateful that Jeongguk’s super human body heat seems to be the antidote to this weird reverse fever situation he has going on, because he would probably be freaking out a lot harder if he wasn’t.</p>\n<p>The 7 of them eat dinner together, Jeongguk’s thigh pressed up against Taehyung’s under the table, and then retreat to their various rooms for an early bedtime, knowing that tomorrow will be hectic and exhausting with the first night of the Muster.</p>\n<p>“So, umm,” Jeongguk says awkwardly when they get to Taehyung’s door. “I guess... we should probably sleep together?”</p>\n<p>Taehyung quirks an eyebrow at him. “Jeonggukie, so forward!” he teases.</p>\n<p>“Shut up,” Jeongguk groans, turning red. “You know what I mean, like share a bed.”</p>\n<p>“Probably,” Taehyung nods. “Would be bad if I turned into an icicle the night before the Muster.”</p>\n<p>“Very,” Jeongguk agrees. “Alright, I’m just gonna go change, I’ll be back in a minute.”</p>\n<p>Taehyung slips into his own pajamas while he waits, wondering why he suddenly feels so nervous. He and Jeongguk have shared a bed plenty of times before, especially when they were younger and less famous and the hotels they stayed in weren’t as nice. There’s just something weird about making the conscious decision to do so, and the fact that they’re definitely going to have to cuddle if Taehyung is going to make it through the night.</p>\n<p>Jeongguk returns not long after, dressed in black sweats and a white T-shirt, and effectively cuts off Taehyung’s unexpected nerve spiral. They climb into Taehyung’s bed (as they’ve done many times before, he reminds himself), and Jeongguk hugs him close. </p>\n<p>“Thanks for being such a good sport about this,” Taehyung murmurs against his chest. “I know it seems really crazy.”</p>\n<p>“No worries,” Jeongguk replies. “I just am glad I can help.”</p>\n<p>“Me too,” Taehyung yawns. “Hopefully this was just some weird fluke and everything is back to normal tomorrow.”</p>\n<p>“Yeah, hopefully,” Jeongguk echoes. Something in his voice sounds a little off, but Taehyung falls asleep before he can put his finger on what.</p>\n<p>***</p>\n<p>Jeongguk wakes up in the middle of the night to find that he and Taehyung have rolled apart. Taehyung still seems to be asleep, but he’s shivering, and when Jeongguk reaches over to touch him, his skin is disconcertingly cold. Alarmed, he tugs off his own shirt and pulls Taehyung back to him, remembering what Taehyung had said about him being extra warm when he was shirtless. Not that Jeongguk has been reading too much into that, or anything. </p>\n<p>So this explains why, when he wakes up again the next morning, Taehyung blinks at him curiously and says: “When did you get naked?”</p>\n<p>“I’m not <em>naked</em>,” Jeongguk squawks, panicking for a second until he confirms that he is in fact still wearing his sweatpants.</p>\n<p>“Ok, fine, shirtless,” Taehyung replies, rolling his eyes.</p>\n<p>“I woke up in the middle of the night and you were freezing,” Jeongguk explains, rubbing the sleep out of his eyes and yawning. He could get used to waking up next to Taehyung. “So I thought the extra body heat would help.”</p>\n<p>“Oh,” Taehyung says, his eyes soft. “Thanks.”</p>\n<p>Jeongguk shrugs, swallowing. All of this extra proximity to Taehyung is making it even more difficult than usual for him to act normal (read: like he doesn’t have a hopeless crush on his best friend). “How are you feeling this morning?”</p>\n<p>“I feel fine now,” Taehyung says. “But I haven’t really been apart from you, so I can’t say for sure.”</p>\n<p>Jeongguk pointedly ignores the familiar fluttering in his stomach, stretching his arms over his head. “I’ll go get dressed, then. Come over if you start getting cold.”</p>\n<p>Privately, he’s kind of glad when there’s a knock at his door thirty minutes later, and he opens it to find Taehyung standing in the hallway, hugging himself. This definitely makes him a horrible person, 100%, but selfishly he likes having an excuse to touch Taehyung all the time.</p>\n<p>“Not better, then?” he says, opening his arms. Taehyung huddles against him immediately. He doesn’t feel as cold as he had last night, but the chill still seeps through the fabric of Jeongguk’s shirt.</p>\n<p>“Guess not.”</p>\n<p>They break the news to the other boys at breakfast, and predictably they immediately say it’s time to call a doctor. Jeongguk thinks they have a point, considering this is highly worrisome and definitely not normal, even if selfishly he’s not in a huge rush to get it figured out.</p>\n<p>Taehyung waves them off. “Guys, I’m fine. There’s no time for me to see a doctor anyway, the Muster starts tonight!”</p>\n<p>“You are definitely not fine if you start turning into an ice cube every time you’re away from Jeongguk for too long!” Seokjin argues.</p>\n<p>“So I’ll stay close to him,” Taehyung retorts, looping his arm through Jeongguk’s.</p>\n<p>“Forever?” Jimin says dubiously, and Jeongguk’s stomach does a backflip.</p>\n<p>“Come on, let’s just get through the Muster, okay?” Taehyung pleads. “Then we can figure it out.”</p>\n<p>Seokjin opens his mouth, but Namjoon pats him on the shoulder reassuringly. “We’re going to be together the whole time. As long as Jeongguk-ah is there, he’ll be okay.” They all turn to look at Jeongguk.</p>\n<p>“Yeah, of course, I’ll be right there,” he says firmly, without hesitation, and Taehyung flashes him a grateful smile. </p>\n<p>The thing is, Jeongguk will always be there if Taehyung needs him, even if it hurts, even if it means setting his own feelings aside sometimes. Taehyung is a rare kind of friend, someone who really sees him for who he is and who has been by his side through so much - good and bad. There is a part of Jeongguk that wants and has always wanted more, but he’d decided a long time ago that their friendship was the most important, that as long as he could keep Taehyung in his life, that would be enough. It’s not enough, not really, but he’ll take what he can get - Taehyung is worth it.</p>\n<p>The day passes in a blur of last minute fittings, hair and makeup, and dress rehearsals. They’re debuting some new choreography tonight, which Jeongguk is excited about - the fans are going to go wild, and it’s always nice to add some variety to their performances. Taehyung hovers close to him while they’re getting ready, so much so that the makeup noonas admonish him because he keeps making Jeongguk laugh. In the end, he settles on the floor in front of Jeongguk’s chair, sitting with his back against Jeongguk’s legs while he fiddles with his phone. </p>\n<p>The first night of the Muster is just as much of a success as they had hoped. The ARMYs are as happy and responsive as ever, eating up the skits and the new choreo. They also are used to the seven of them being touchy onstage, so it’s relatively easy to find opportunities to grab ahold of Taehyung and make sure he’s sufficiently warm. They’re all skilled enough at being in front of a crowd by now to pass it off as just a regular part of the show, even if Jeongguk’s touches linger a little longer than they usually would. For strictly scientific reasons, of course.</p>\n<p>He and Taehyung share a car back to the dorms with Hoseok, who shoots an appraising look at where they’re cuddled together in the backseat and says: “Aren’t you two cute.” </p>\n<p>Jeongguk fights to keep his expression neutral, but Taehyung beams, squeezing him tighter. “My personal space heater.”</p>\n<p>Back at the dorms, they all disperse, congratulating each other on a good show as they traipse off to their respective rooms. Taehyung turns to Jeongguk, yawning, and says casually: “Wanna sleep in your bed tonight?”</p>\n<p>Something about the way he says it knocks the wind out of Jeongguk - so easy, so natural, as if they’re a couple that actually does share a bed every night. Not just two friends, one of whom happens to have a body temperature regulation issue that can apparently only be moderated by the other.</p>\n<p>“Oh,” Jeongguk says, trying not to stutter. “Yeah, sure.”</p>\n<p>“Yay, I like that fuzzy blanket you have.”</p>\n<p>“You mean the one that you always steal and is currently in your bedroom?”</p>\n<p>Taehyung blinks at him. “Right, so I’ll bring that over once I’m done getting changed.”</p>\n<p>Jeongguk chuckles, shaking his head as he heads to his own room to change into pajamas. He debates foregoing a shirt, especially considering what had happened last night, but ends up chickening out and pulling a T-shirt on at the last second. It feels a little too close to actually dating territory to start the night without a shirt on, even if there is a legitimate reason for it.</p>\n<p>“Decided to keep your clothes on tonight, I see,” Taehyung teases, waltzing into Jeongguk’s room without knocking. You’d think he would have learned not to do that by now, after all the times they’ve accidentally caught each other in compromising positions, but Taehyung has never been great with boundaries.</p>\n<p>“Disappointed?” Jeongguk fires back cheekily, trying not to blush. He wishes.</p>\n<p>Taehyung raises his eyebrows in surprise, always delighted when Jeongguk sasses him back. “Maybe,” he tosses back with a cheeky wink, and Jeongguk has to disguise the choking sound he makes as a cough. Taehyung looks at him curiously. </p>\n<p>“For the record, I took my shirt off last night to keep you from freezing to death, you ungrateful ass,” Jeongguk says when he stops coughing. </p>\n<p>“I know,” Taehyung concedes, shuffling over and hugging him. He has Jeongguk’s blanket draped around his shoulders like a cape. “You’re the best friend ever, I don’t deserve you.”</p>\n<p>Jeongguk grumbles but hugs him back anyway - he’s powerless, really, when it comes to Taehyung.</p>\n<p>“How’d you think tonight went?” Taehyung asks, releasing Jeongguk in favor of crawling into his bed. </p>\n<p>“Well, I think,” Jeongguk says, following him. “It was fun to get to perform Best of Me.”</p>\n<p>“Yeah, I like that choreography.” He snuggles up close to Jeongguk, pressing his toes against his calf. </p>\n<p>“Jesus, your toes are freezing,” Jeongguk yelps, jerking away.</p>\n<p>“Yeah well, whose fault is that?” </p>\n<p>Jeongguk glowers at him incredulously. “What happened to ‘oh Jeongguk, I don’t deserve you?’ You’re all talk.”</p>\n<p>“Sorry, sorry,” Taehyung says, properly chastised. He tips his forehead forward until it rests on Jeongguk’s shoulder. “I meant it though, I really don’t deserve you.”</p>\n<p>His voice is soft, and Jeongguk’s heart stutters in his chest. He doesn’t know what to say in response, but luckily Taehyung saves him from having to think of something. Always rescuing him from feeling awkward. </p>\n<p>“Seriously though, will you warm up my toes?”</p>\n<p>“Ugh, fine,” Jeongguk groans, flinching when he feels Taehyung’s icy feet against his calf again. He doesn’t mind, though, not really - not if it means he gets to fall asleep to the sound of Taehyung breathing gently beside him. </p>\n<p>***</p>\n<p>On the third morning of The Saga, Taehyung wakes up at a pleasant temperature, tucked into the side of a sleeping Jeongguk. He’s mildly disappointed to find that Jeongguk is still wearing a shirt this morning, but he dismisses that thought quickly, internally scolding himself for being such a creeper. </p>\n<p>Never one to last very long without some form of attention, he fidgets and shifts at Jeongguk’s side, hoping the movement will “accidentally” wake him up. When this is unsuccessful (not surprising, considering Jeongguk sleeps like the dead and usually requires a minimum of 30 minutes to turn into a functional, responsive human being), Taehyung resorts to more direct tactics, such as repeatedly prodding his nose.</p>\n<p>“Mmf,” Jeongguk grunts eventually, stirring. “Wha.”</p>\n<p>“Good morning, sunshine,” Taehyung greets cheerily, squishing his cheeks.</p>\n<p>Jeongguk cracks one eye open, looking startled for a moment when he sees Taehyung next to him in bed. Then the pieces seem to fall into place, and he says: “I see you didn’t turn into an ice cube overnight.”</p>\n<p>“Huzzah,” Taehyung replies, pressing his hands together as if in prayer. “All thanks to you, Jeonggukie.”</p>\n<p>“Mm.”</p>\n<p>“I’m hungry,” Taehyung announces as Jeongguk’s eyes drift shut again. “Do you think there’s cake?”</p>\n<p>“It’s 8am,” Jeongguk says without opening his eyes.</p>\n<p>“So?”</p>\n<p>Jeongguk sighs.</p>\n<p>“I’m going to investigate, I’ll bring some back if I find it.” </p>\n<p>He crawls out of bed, merrily ignoring Jeongguk’s mumbled response of “diet,” and sets off for the kitchen. Once there, he finds Jimin, still in his pajamas, staring blankly at the contents of the refrigerator.</p>\n<p>“Morning, Jiminie,” Taehyung says, and Jimin nods at him. “Whatcha doin?”</p>\n<p>“Trying to decide what I want for breakfast,” he replies sleepily. His expression shifts to alarm. “Wait a minute, where’s Jeongguk? Are you okay?”</p>\n<p>“I’m fine, I just left him in bed,” Taehyung explains, waving him off, even though he does feel a bit cooler than he had a few minutes ago. “I came in search of cake.”</p>\n<p>Jimin blinks at him but doesn’t question this, which Taehyung views as a testament to how well they’ve gotten to know each other over the years.</p>\n<p>“Oh! Look, there is some left over,” Taehyung cries happily, lightly hip checking Jimin to the side and reaching into the refrigerator. There had been a small birthday celebration for one of their crew members in the dorm the other day, and the remnants of the cake had ended up in their kitchen. “Want some?” he asks, turning to Jimin.</p>\n<p>Jimin wrinkles his nose. “I’m just going to have some fruit... since it’s the morning...”</p>\n<p>“Suit yourself,” Taehyung shrugs, grabbing two forks out of the drawer. “See you in a bit.”</p>\n<p>Not surprisingly, Jeongguk still hasn’t moved by the time Taehyung makes it back to his room. The only natural response, obviously, is for Taehyung to climb on top of him and sit cross legged across his thighs.</p>\n<p>“Ugh, get <em>off</em>,” Jeongguk groans, batting at him weakly.</p>\n<p>Taehyung bounces slightly instead. “I have cake!”</p>\n<p>“I don’t care,” Jeongguk replies, opening his eyes so that he can glare at Taehyung.</p>\n<p>Taehyung spears a bite of cake on a fork and shoves it in Jeongguk’s face, grinning. </p>\n<p>“I told you, I’m on a d - ” he cuts off when Taehyung stuffs the cake into his open mouth. “I literally hate you,” he says once he finishes swallowing.</p>\n<p>“It’s good though, right?”</p>\n<p>Instead of responding, Jeongguk jerks his legs up, sending Taehyung sprawling to the side. Luckily, he manages to save the cake from toppling on to Jeongguk’s bed. </p>\n<p>“Rude,” Taehyung pouts. “Now I’m not going to share with you anymore.”</p>\n<p>Jeongguk lunges at him, his mouth closing around the bite of cake that Taehyung now has on his fork. Taehyung squeals indignantly, wriggling away, but somehow they end up face to face, Jeongguk hovering over him with one hand on either side of his head. It shouldn’t be weird, considering they rough house all the time and literally just spent the night in the same bed, but suddenly Taehyung’s breath is catching in his throat. Their eyes lock for just a moment too long, long enough for Taehyung to wonder - what if? - before Jeongguk is rolling away, a faint blush on his cheeks. </p>\n<p>“Sorry,” Jeongguk mutters, but Taehyung lies still for another moment, trying to process what had just happened and how Jeongguk is reacting to it now. He snaps back to reality when he registers that Jeongguk seems to be genuinely uncomfortable, which is pretty much Taehyung’s least favorite thing ever. </p>\n<p>“I knew you wanted the cake,” he says haughtily, sitting up and poking Jeongguk’s side. Jeongguk looks at him sideways, his lips twitching into a small smile. “Lucky for you, I brought plenty to share.”</p>\n<p>The rest of the day passes without incident, so chaotic that Taehyung hardly has time to think about what had happened between him and Jeongguk that morning. Before he knows it, they’re back onstage for the second night of the Muster, which conveniently includes a skit that requires him and Jeongguk to butt-check each other across the stage. It’s an odd sensation, to say the least, to feel a rush of heat in his butt every time Jeongguk bumps against him. That being said, Jeongguk has a really nice ass, so Taehyung isn’t complaining, even when the last round of the competition sends him sprawling to the ground. When he looks up, Jeongguk is watching him over his shoulder, smiling shyly, cheekily, and Taehyung feels a rush of something other than heat in his stomach. </p>\n<p>Everything is going fine until, through some mix-up with their staff, Jeongguk gets held up while they’re exiting the venue. Not wanting to be a diva, Taehyung climbs into a car with Namjoon, Yoongi, and Jimin instead, shrugging Jimin off when he questions whether it’s a good idea for Taehyung to be apart from Jeongguk. It’s a short ride back to the dorm, he’ll be fine. That is, until they hit traffic.</p>\n<p>There’s been some sort of accident ahead of them, causing a huge backup that slows their progress considerably. Anxiety twists uncomfortably in Taehyung’s stomach, but he tells himself to breathe, ignoring the worried looks the other boys cast at him. It’s no use, though - thirty minutes into the ride, they’ve still barely moved, and Taehyung has started shivering in earnest. Jimin huddles close to him, warming him the best he can, and Yoongi crawls into the backseat and curls around him from the other side. In the middle seat, Namjoon calls Seokjin, trying to figure out how close the other car is - they’d gone a different way but are also caught in the traffic.</p>\n<p>In the end, it’s Namjoon who convinces their driver to make an illegal turn on to a side road, keeping his voice surprisingly calm as he explains that Taehyung is ill and needs to get home immediately. They arrive back at the dorm fifteen minutes later, but by that point Taehyung is shaking so hard he can’t even hold himself upright. His whole body feels sluggish, numb, as his bandmates support him into the building and up the elevator back to the dorm.</p>\n<p>Once they’re there, there’s nothing to do but wait - Taehyung sits slumped on the couch in the living area, Jimin and Yoongi holding him tightly, matching panicked expressions on their faces. Namjoon paces back and forth in front of them, speaking frantically into his phone, presumably to Seokjin. Taehyung has rarely seen him this freaked out before, and it makes the fear spike in his own hazy brain. Everything is cold, so cold, and he feels like he might be teetering on the edge of blacking out. The only thing that’s clear in his mind is Jeongguk - he needs Jeongguk.</p>\n<p>As if on cue, the front door bangs open and Jeongguk tumbles into the dorm, Seokjin and Hoseok hot on his heels. His expression is tortured, terrified, and his eyes go wide in horror when they land on Taehyung. Even through the numbness that’s closing in on him, Taehyung’s heart gives a thump of approval when he registers Jeongguk’s presence. </p>\n<p>Jeongguk makes a beeline across the room, ripping off his jacket and flinging himself on top of Taehyung, one leg on either side of his waist. “I’m sorry, I’m sorry,” he whispers over and over again, his voice pained. “Jesus Christ, Taehyung, are you okay?” His hands come up to frame Taehyung’s face, thumb brushing over his cheek. </p>\n<p>Taehyung wants to respond that yes, he is okay, because now Jeongguk is here and there is warmth slowly seeping back into his frigid bones. But the words don’t quite reach his frozen lips, and Jeongguk is still searching his face with worried eyes.</p>\n<p>“Fuck, holy fuck,” Jeongguk says, and then he’s leaning in, pressing his hot mouth to Taehyung’s. The heat sparks through Taehyung’s body like a flame, and he gasps so hard he starts coughing, clutching at Jeongguk’s shoulders.</p>\n<p>“What was that for,” he croaks, the feeling gradually returning to his fingers and toes. The other boys are still huddled around them, watching closely, but Taehyung is only vaguely aware of their presence.</p>\n<p>“Your lips were blue,” Jeongguk whispers, leaning his forehead against Taehyung’s. Taehyung loops his arms around his neck and hugs him tightly.</p>\n<p>***</p>\n<p>It takes a while, but eventually the other members concede that Taehyung seems well enough to make it through the night. After an hour tucked into Jeongguk’s side - and that kiss, god - he’s nearly back to normal, apologizing to everyone for scaring them (because Taehyung <em>would</em> almost die and then apologize for it) but assuring them that he feels fine now. They drop off one by one, Namjoon the last to go when Jeongguk swears he won’t leave Taehyung’s side for the rest of the night.</p>\n<p>Jeongguk and Taehyung walk to Taehyung’s room in silence, arm in arm, but Jeongguk’s mind is racing. Now that the chaos from earlier has died down - he doesn’t think he’s ever been so scared in his life - he can’t stop thinking about the fact that he had <em>kissed</em> Taehyung. And in front of the entire band, no less. It had made sense at the time, what with the fact that Taehyung’s lips were literally blue, but still. Fuck.</p>\n<p>“You okay?” Taehyung asks when the door to his room closes behind them. </p>\n<p>“I can’t believe <em>you’re</em> asking <em>me</em> that,” Jeongguk says, shaking his head.</p>\n<p>Taehyung shrugs. “I know it was scary for you guys.”</p>\n<p>And it had been - Jeongguk doesn’t think he’ll ever forget the way Taehyung had looked when he’d arrived in the dorm, small and practically lifeless on the couch. And it had been all his fault.</p>\n<p>“I’m so sorry,” Jeongguk says, looking down as his voice cracks. He’ll never forgive himself for leaving Taehyung alone for so long. “I should have been in the car with you, I’m sorry.”</p>\n<p>“Stop it, this isn’t your fault,” Taehyung says sharply, nudging Jeongguk’s chin up so that their eyes meet. “Look at me, I’m fine. You made me better.” </p>\n<p>Jeongguk blinks rapidly, his eyes suddenly stinging with unshed tears. God, this is embarrassing.</p>\n<p>“Jeongguk-ah, come on,” Taehyung murmurs, squeezing his hand. “It’s okay.”</p>\n<p>Jeongguk nods, and they get ready for bed, Jeongguk borrowing a T-shirt and sweats from Taehyung because he refuses to leave him alone for even a minute. When they’re settled in, lying face to face under the covers with their legs intertwined, Taehyung says:</p>\n<p>“I have a question.”</p>\n<p>“Okay,” Jeongguk replies, nervous.</p>\n<p>“You kissed me, before.” He looks at Jeongguk through those gorgeous, soulful eyes and Jeongguk feels his breath stutter.</p>\n<p>“I - yeah,” he says awkwardly, hating that he can feel his face heating up. “Sorry, I just was so freaked out, I didn’t know what else to do.”</p>\n<p>“Don’t apologize,” Taehyung says, shaking his head. “I actually, was wondering if, now that the others aren’t around - you would do it again?”</p>\n<p>Jeongguk’s eyes go wide, and if he wasn’t blushing before, he certainly is now. His brain is having trouble processing what’s happening - Taehyung, <em>Kim Taehyung</em>, best friend, bandmate, and primary romantic fixation of the past 5 years of his life, is asking Jeongguk to kiss him. He’s fantasized about this moment so many times that a part of him doesn’t even believe it’s truly happening. </p>\n<p>“I,” he stammers, fighting to hear himself over the chaos unfolding in his mind. Taehyung is watching him curiously, almost hesitantly, as if he thinks Jeongguk might say no. Ha. “Yeah, I mean, of course - did it help, before?”</p>\n<p>Because that’s the only plausible scenario here - something about Jeongguk clearly helps Taehyung feel better, and it seems like kissing is just another part of that. A shudder runs through his body when he considers what other types of activities that might extend to, but he promptly squashes that thought. No need to make more of a fool of himself with Taehyung than he already has.</p>\n<p>Something indecipherable flickers across Taehyung’s face, but then he’s nodding, shifting slightly closer to Jeongguk. “Yeah, I don’t really know how to describe it, but it was more than when we just touch, you know?” He bites his lip, and Jeongguk can’t help it when his own gaze lingers there for just a moment too long. “I felt... warm from the inside.”</p>\n<p>Funnily enough, that’s exactly how Jeongguk would describe how he feels when he’s around Taehyung, but he’s not about to share that piece of information right now.</p>\n<p>“Okay,” Jeongguk nods, a sort of elated nervousness rising in his stomach. He gets to kiss Taehyung again. “Then, um, I’ll just...”</p>\n<p>He trails off, his mouth dropping open when Taehyung circles his wrist and guides his hand up to cup his cheek. Jeongguk’s heart is hammering in his chest, his breathing erratic as he leans in, closing the distance between them and kissing Taehyung for the second time that night. </p>\n<p>Taehyung’s lips are warm against his this time, soft as they part to kiss him back. He makes a happy sort of noise in the back of his throat, and Jeongguk wonders what this feels like for him, if it feels as good - or maybe even better? - as it does for Jeongguk. At the very least, he seems to be enjoying himself, pressing closer to Jeongguk and wrapping his hand around the back of his neck.</p>\n<p>It’s a little alarming how easily Jeongguk lets himself slip under, whimpering slightly when Taehyung’s tongue slips into his mouth. His fingers slide along Taehyung’s jaw, angling his face so as to kiss him more deeply, and it’s all he can do not to roll on top of him and cover Taehyung with his whole body. For now, he’ll settle for tangling his fingers in the soft hair at the base of Taehyung’s neck, shivering with every noise Taehyung makes.</p>\n<p>When they finally break apart, Jeongguk’s head is spinning, and he feels like the whole world probably could have collapsed around them without him noticing. Taehyung is smiling at him shyly, his lips kissed pink, and Jeongguk nearly has an aneurysm when it registers that he’s the one responsible for that.</p>\n<p>“Mm,” Taehyung hums. “That felt really nice.”</p>\n<p>Jeongguk might have picked something more along the lines of mind blowing or life altering, but nice works too. “Yeah,” he says, a little breathlessly. “Yeah, good.”</p>\n<p>Taehyung giggles, his teeth catching on his lower lip again, and wow, Jeongguk really needs him to stop doing that.</p>\n<p>“Night, Jeonggukie,” Taehyung says, shutting his eyes and draping an arm over Jeongguk’s waist.</p>\n<p>“Night,” he replies. He switches off the light on his bedside table, but he stays awake for a long time after that.</p>\n<p>***</p>\n<p>When Taehyung awakes the next morning, Jeongguk is, not surprisingly, still asleep beside him. Taehyung yawns, snuggling into the heat that seems to radiate from his chest, and pokes him in the stomach. </p>\n<p>“Jeongguk-ah,” he murmurs.</p>\n<p>Jeongguk grunts, which is actually more of a response than Taehyung had been expecting. </p>\n<p>“Wake up.” He pokes Jeongguk in the stomach again, eliciting a rather endearing noise of discontent as he squirms away.</p>\n<p>“Jeongguuuuk,” he whines. And then, without really thinking about it, he says: “Morning kiss?”</p>\n<p>Wait, what?</p>\n<p>Jeongguk’s eyes fly open just as Taehyung covers his own with his hands, embarrassed. </p>\n<p>“Sorry,” he says, peeking out from between his fingers. Jeongguk’s eyes are almost comically wide. “I shouldn’t just demand kisses from you.”</p>\n<p>But there’s no denying that his body seems to crave it now - the extra boost of warmth that comes when Jeongguk’s lips are on his. This is a problem, Taehyung thinks.</p>\n<p>“I’ll kiss you,” Jeongguk says, his voice raspy with sleep. He reaches out and grabs Taehyung’s hand, pulling it away from his face. “You don’t have to ask, Tae.”</p>\n<p>His face is so soft that Taehyung’s heart melts a little - his sweet, lovely Jeongguk. He’s known him since they were both practically kids, and now here he is, this man who has been so selfless in taking care of Taehyung. It creates an ache in Taehyung’s chest that he’s not sure how to deal with it, but more kissing seems like a good short-term solution.</p>\n<p>Taehyung is the one who leans in this time, kissing Jeongguk gently. That telltale heat rushes through him again, and it feels so good that he doesn’t even care if they both have a little bit of morning breath. He just wants to be closer to Jeongguk, to feel him everywhere.</p>\n<p>In pursuit of this goal, he lets his hand drift down from Jeongguk’s face, skimming over the (really well defined, Jesus) muscles in his arm. Jeongguk hums appreciatively, pressing closer, his tongue tracing along Taehyung’s lower lip. His hand finds Taehyung’s waist under the covers, settling on the bare skin where his T-shirt has ridden up, and the heat is so overwhelming that Taehyung gasps, his whole body jolting. Jeongguk pulls away immediately, looking guilty, but Taehyung presses his palm over his mouth before he can apologize. </p>\n<p>“Don’t,” he says, surprised at how hoarse his own voice sounds. Jeongguk’s eyes are dark where they’re watching Taehyung over his own hand. “That was a good reaction, trust me.”</p>\n<p>When he pulls his hand away, Jeongguk is gaping at him, and a different kind of heat twists in Taehyung’s stomach. They surge back together at the same time, and Jeongguk’s hand finds its way back to his hip, the tip of his thumb slipping ever so slightly under the fabric of Taehyung’s shirt.</p>\n<p>There’s a loud knock at the door, and they spring apart so violently that Jeongguk almost falls off the bed. Taehyung grabs his arm to steady him as a voice from outside shouts “INCOMING!” and the door swings open.</p>\n<p>Taehyung sits up as all five of the other members pile into his room, doing his best to look like he hadn’t just been making out with his best friend thirty seconds ago. Beside him, Jeongguk still looks shell-shocked, his hair mussed from, oops, Taehyung’s hands. Taehyung shivers a little, pointedly ignoring the suspicious look that Jimin casts at him as he glances back and forth between the two of them.</p>\n<p>“Gentlemen,” Taehyung greets as the boys drop into various sitting positions around his room. They all look concerned, and Taehyung can’t really blame them. </p>\n<p>“How are you feeling, Tae?” Namjoon asks.</p>\n<p>“I’m great,” he says honestly. “Jeongguk has been taking good care of me.”</p>\n<p>Jeongguk makes an odd sort of choking noise next to him, and Taehyung pats him on the back as Jimin’s eyebrows shoot right up to his hairline. Yoongi is also watching them with a slightly perplexed expression on his face, like he can’t quite figure out what’s going on between them but isn’t sure if he wants to know.</p>\n<p>“Good, I’m glad,” Namjoon says, either oblivious to the tension in the room or choosing to ignore it. “But we need to get serious about this. The Muster is over, and last night was way too close for comfort. I really thought - ” he clears his throat, the features of his face wobbling. “I wasn’t sure if you were going to make it.”</p>\n<p>The other boys all nod, frowning, and Taehyung is seized by guilt for having put them through that. “I’m really sorry, guys.”</p>\n<p>“Don’t apologize,” Namjoon says. “We just need to figure out what the hell is happening to you.”</p>\n<p>“Can we <em>please</em> call a doctor now?” Seokjin interjects.</p>\n<p>“What is a doctor going to tell me?” Taehyung asks. He understands their concern, feels it too, but something is telling him that a regular doctor isn’t going to be able to help. “Have any of you ever heard of a disease like this?”</p>\n<p>There’s silence, and Taehyung can tell they see his point, even if they’re not happy about it.</p>\n<p>“Alright, let’s think about this,” Hoseok says, leaning forward so that his elbows rest on his knees. “When did this all start? The morning after Golden Disc?” Taehyung nods. “So, did anything weird happen to you that night? Anything at all that could have caused this?”</p>\n<p>Taehyung frowns, considering. Nothing in particular jumps out at him.</p>\n<p>“You didn’t get bitten by a radioactive spider, or anything like that?” Yoongi asks. Taehyung’s eyes go wide, and he hurriedly tacks on: “Relax, I was joking.”</p>\n<p>But Taehyung has suddenly remembered one slightly unusual thing about the second night of the Golden Disc Awards - the purple fortune cookie, and the fortune inside of it. The words of the woman at the concession stand echo in his head: </p>\n<p>\n<em>You’re going to want to save that.</em>\n</p>\n<p>Oh god.</p>\n<p>“Oh god,” he breathes.</p>\n<p>The boys all stare at him. “What?” Yoongi prompts him.</p>\n<p>“You’re never going to believe me,” Taehyung says, mind racing. “But - there were purple fortune cookies, in the concession area.”</p>\n<p>“The ones that said DO NOT EAT?” Namjoon asks, sighing like he already knows where this is going.</p>\n<p>“Yeah, those,” he says, nodding sheepishly. “Well, I ate one - ”</p>\n<p>“Taehyung!” Seokjin admonishes, rolling his eyes.</p>\n<p>“I know, I know,” Taehyung says, waving him off. “But I did, and the woman at the concession stand yelled at me, telling me I better save the fortune. I didn’t think anything of it at the time, but...”</p>\n<p>“You’re not seriously suggesting that this is happening to you because of a fortune cookie,” Hoseok says, deadpan.</p>\n<p>Taehyung shrugs. “I don’t know. Maybe?”</p>\n<p>“What did the fortune say?” Jeongguk asks, speaking up for the first time since the other members had arrived. </p>\n<p>Taehyung blanches. He remembers exactly what the fortune had said, but he’s not sure he wants to share it with the whole room right now. </p>\n<p>\n<em>Where there is love, there is warmth.\nWhere there is honesty, there is relief.</em>\n</p>\n<p>Yeah, he’s going to need a little time to think that one over, especially the “love” part. His stomach twists uncomfortably.</p>\n<p>“Umm,” he deflects. “Something about, finding warmth where there’s... a strong connection.” </p>\n<p>That’s close enough, right?</p>\n<p>“So basically, you’re so connected to Jeongguk that he’s now the only thing that can make you feel warm?” Jimin says slowly, bewildered. </p>\n<p>“I guess so?” Taehyung replies, flushing. He chances a glance in Jeongguk’s direction and finds him wide-eyed, wearing what the fans had affectionately dubbed his “Jung-shook” expression. Taehyung would give anything to know what’s going on in his mind right now.</p>\n<p>“This is nuts,” Hoseok says, shaking his head. “A fortune cookie? There’s no way.”</p>\n<p>“It seems like a pretty crazy coincidence though,” Namjoon says thoughtfully. “I mean, if we suspend our disbelief - it kind of does fit with what’s happening.”</p>\n<p>“So, assuming that is, in fact the reason,” Jimin cuts in. “How do we get him back to normal? You guys can’t just be attached at the hip forever.”</p>\n<p>Taehyung doesn’t think that would be the worst thing ever, but Jimin has a point - they’re going to have to be apart at some point. His mind goes back to the second part of the fortune. </p>\n<p>\n<em>Where there is honesty, there is relief.</em>\n</p>\n<p>It seems like that might be the answer, but he has no idea what it’s supposed to mean.</p>\n<p>“Maybe I can get in touch with the lady who yelled at me,” he suggests. “She seemed to know this was going to happen, maybe she’ll know how to make it stop.”</p>\n<p>Jeongguk flinches next to him, but when Taehyung looks over, his gaze is fixed on his lap.</p>\n<p>“Alright, yeah,” Namjoon says, nodding. “Let’s start with that. I’m sure someone on the staff can get us her name, or at least the name of the catering company.”</p>\n<p>So Taehyung shoots a text to a few of the staff members he trusts the most, and everyone relaxes a little with the knowledge that they’re making progress towards figuring this whole thing out. The rest of the day hurries by, a little quieter than the past few now that the Muster is over. In the late afternoon, one of the staff members gets back to him with a name for the catering company, and Taehyung calls and leaves a message. He debates using a fake name, but decides in this instance his real one might yield better results. In general, he prefers not to take advantage of the privileges that come with being an idol, but this feels like a special set of circumstances.</p>\n<p>In reality, though, the thing that he can’t get off his mind all day isn’t the fortune cookie, but Jeongguk. What had happened between them last night, and this morning - the feeling of Jeongguk’s hand on the bare skin of his waist. All Taehyung wants to do is kiss him again, but he can’t exactly do that with the other five members hovering around. Holding hands or hanging off of each other is enough to keep Taehyung warm, but it’s not enough to satisfy the hunger that’s building inside of him, begging for more.</p>\n<p>By the time they crawl back into bed that night - Taehyung’s, again - Taehyung has worked himself up into a bit of a nervous tizzy. This isn’t like him, not at all, and it’s frustrating. Sure, this thing with Jeongguk has been simmering in the back of his mind for years, even more markedly in the past six months, but he’s never really given it room to breathe. Now, this debacle with the fortune cookie and his body’s newfound dependence on Jeongguk is messing with his head, making it hard to distinguish between what’s stemming from the fortune and what’s... just him.</p>\n<p>Taehyung is the first to get into bed, rolling on to his side, facing away from Jeongguk as he attempts to quiet the chaos in his mind. A few minutes later, the covers lift and the bed dips as Jeongguk slips in behind him, one arm draping loosely over Taehyung’s waist. He leans back into Jeongguk’s touch until they’re essentially spooning, Jeongguk’s breath warm against the back of his neck. Every sense in his body feels heightened, pulled taut.</p>\n<p>“Taehyung,” Jeongguk murmurs, right behind his ear. Something in his voice makes Taehyung turn to look at him, their eyes meeting over Taehyung’s shoulder. Jeongguk’s gaze is intense, almost pleading, and Taehyung knows in that moment that he doesn’t stand a chance.</p>\n<p>When their lips meet, Jeongguk tastes like toothpaste, the special spearmint one that Jimin uses and they all regularly steal. He’s more confident this time, kissing Taehyung firmly, his tongue slipping past Taehyung’s lips without hesitation or preamble. Distantly, Taehyung wonders when Jeongguk got so good at this, and how, and with who. An irrational sort of jealousy settles in his stomach at the thought of Jeongguk kissing anyone else.</p>\n<p>He turns fully so as to gain better access to Jeongguk’s mouth, allowing one adventurous hand to slip under Jeongguk’s sleep shirt and over the warm expanse of his lower back. Jeongguk lets out a small whimper, and without really meaning to, Taehyung cants his hips forward. They collide with Jeongguk’s, and - </p>\n<p>“Wait,” Jeongguk cries, panicked, springing backwards.</p>\n<p>Taehyung freezes, afraid he’s pushed too far. “What? What’s wrong?”</p>\n<p>Jeongguk is rapidly turning the color of a tomato, and the pieces start falling into place for Taehyung. “Nothing, I just, I’m - ”</p>\n<p>“You’re hard,” Taehyung breathes, and Jeongguk squeezes his eyes shut, nodding.</p>\n<p>Experimentally, Taehyung places a hand on his waist, shimmying forward until their lower bodies are pressed together again. Jeongguk’s hips jerk, and Taehyung can feel him, hard against his leg. White hot arousal surges through his body, stronger than anything he’s ever felt before. </p>\n<p>“Taehyung,” Jeongguk says warningly, an edge of desperation in his voice. </p>\n<p>“S’okay,” Taehyung soothes, rolling his hips forward. “Me too.”</p>\n<p>“Oh my god,” Jeongguk gasps, his eyes rolling back. He’s still holding himself very still, and Taehyung can feel the tightly coiled tension in his body.</p>\n<p>“C’mon,” Taehyung urges, tugging lightly at Jeongguk’s hair. “C’mon, it’s okay.”</p>\n<p>A floodgate seems to break, and Jeongguk groans, rolling forward until he’s on top of Taehyung, their hips aligned. Taehyung grabs the back of his neck, kissing him sloppily as their groins rub together, the sensation heady and delicious. It feels a little bit like drowning, but in the best way possible.</p>\n<p>In all their years of friendship, this is a side of Jeongguk that Taehyung has never seen before - insatiable, almost unhinged. He’s usually so tightly composed, acutely self-aware even when he’s relaxed or goofing off. But now, it’s like he’s lost control of himself, let his mind shut down for once and his body take over. His hips strain against Taehyung’s, his breathing harsh as he pulls away from his mouth to kiss along his throat. Taehyung gives it back as well as he can, arching up to meet him, fingertips teasing at the skin just above Jeongguk’s ass.</p>\n<p>God, there is so much that he wants to do.</p>\n<p>With two layers of clothing separating them, the friction against their cocks is secondary at best, but Taehyung doesn’t care, doesn’t think he’ll last much longer anyway. He’s got Jeongguk over him, swearing into his mouth, the muscles in his back and abdomen tense beneath Taehyung’s hands. It’s honestly a miracle Taehyung hasn’t come already.</p>\n<p>“Oh my god, Tae,” Jeongguk pants against his cheek. “Oh my god, oh my god,” he repeats, his words matching the rhythm of his hips. He’s close, Taehyung can tell, and the realization nearly knocks him out. </p>\n<p>“Yeah,” Taehyung murmurs encouragingly, breathless himself. “Yeah, me too, come on.”</p>\n<p>Jeongguk whines, a shudder wracking his body, and then stills. <em>Jeongguk just came, Jeongguk just came</em> flashes in giant neon letters in Taehyung’s brain, and he comes before he even feels Jeongguk’s wetness seeping through his sweatpants, comes with Jeongguk’s damp forehead resting against his shoulder. </p>\n<p>They lie like that for a few minutes, their chests rising and falling against each other, both of them in a sort of stunned silence. It takes a little while for Taehyung to come back to his senses, to process what had just happened, that he had just gotten of with <em>Jeongguk</em>. The kissing had been one thing, could be written off as just another part of this very weird situation they’ve found themselves in, but this - Taehyung’s not sure if there’s any coming back from this. </p>\n<p>As each second ticks by, the silence gets more and more awkward and oppressive, and the drying cum in Taehyung’s boxers gets increasingly uncomfortable. He can’t believe he’d literally come in his pants - he hasn’t done that since he was like 15, Jesus - but then again, Jeongguk had too. And he had done it first.</p>\n<p>“Jeongguk,” Taehyung says when the quiet becomes too much for him to bear, prodding at him gently. For a moment, he wonders if Jeongguk had actually fallen asleep on top of him (wouldn’t be the first time), but then he gives a low grunt and rolls to the side.</p>\n<p>His face is bright red, and now it makes more sense why he had kept it buried in Taehyung’s shoulder for so long. As is often the case, Taehyung is distracted from his own discomfort by a sort of compulsive need to put Jeongguk at ease. It’s a habit he’d developed a long time ago, back when Jeongguk was still shy around all of them, and he’s never quite shaken it.</p>\n<p>“Well,” he says, rolling up on his side to look at Jeongguk, cheek propped on his fist. “That was new.”</p>\n<p>Jeongguk snorts, glancing over at him sideways. His expression is a strange mix of what Taehyung would venture to guess is fucked out and mortified.</p>\n<p>“Are you okay?” Taehyung asks gently.</p>\n<p>“Yeah, I just.” He clears his throat. “Wasn’t expecting that.”</p>\n<p>“Me neither,” Taehyung admits.</p>\n<p>“Was it okay?” Jeongguk asks worriedly.</p>\n<p>“More than,” Taehyung says quickly. He feels the best he’s felt since before this whole thing started, warm and cozy. “I mean, I came in my pants, so that’s embarrassing, but. Otherwise, all good.”</p>\n<p>He smiles at Jeongguk, and is satisfied when it earns him a small grin in return. </p>\n<p>“Yeah, god,” Jeongguk says, his nose scrunching up in distaste. “I need to change.”</p>\n<p>“Me too,” Taehyung giggles. “Jeez, we’re a mess.”</p>\n<p>This gets an actual laugh out of Jeongguk, and Taehyung is relieved to feel the tension in the room lessening.</p>\n<p>Jeongguk gets up to go get fresh clothes from his own room, and Taehyung is left by himself to change as well. He’s still kind of stunned by what had happened, but he can’t say he regrets it - it had felt way too good. In a way, he wonders if he and Jeongguk have been building to this for a while, and he’s only just realizing it now. Taehyung kind of has an excuse, what with this whole body heat thing, but what about Jeongguk? Is he just going along with this to help Taehyung? It wouldn’t be out of character for him, Taehyung realizes with an odd sinking sensation. Then again, you can’t really fake arousal, and Jeongguk had definitely been aroused. Ugh, fuck. This really is a mess.</p>\n<p>He pushes those thoughts aside when Jeongguk reappears in a fresh pair of sweats, pasting on a smile instead. His face has returned to its normal shade, but he hovers awkwardly by Taehyung’s bed until Taehyung pats the spot next to him.</p>\n<p>“Tae,” he says, climbing into bed. “We’re okay, right?”</p>\n<p>“‘Course,” Taehyung replies, sounding much more confident than he feels. “We’re best friends. Nothing’s going to change that.”</p>\n<p>Jeongguk looks relieved, but Taehyung’s stomach twists uncomfortably. He’s always believed that their friendship can weather almost anything, and at this point, it kind of has. But this is different, this puts them past some kind of invisible line, and Taehyung isn’t sure where they’ll stand when it’s over. </p>\n<p>***</p>\n<p>The first thing Jeongguk sees when he wakes up is Taehyung, staring at him with wide, unblinking eyes. Those eyes will be the death of him, Jeongguk has long felt - something about the shape of them makes him so weak. </p>\n<p>“Hi,” Taehyung says brightly.</p>\n<p>“Hi,” Jeongguk replies, reaching out tentatively and closing his hand around Taehyung’s forearm. He seems to be at a normal temperature, maybe a little cool. “Warm enough?”</p>\n<p>“Mm,” Taehyung nods. “Thanks. I wanted to talk to you, though.”</p>\n<p>Jeongguk’s stomach lurches, memories of what had happened between them crashing back into his consciousness. “Okay,” he says.</p>\n<p>“You’ve been so amazing about all of this,” Taehyung begins, and Jeongguk’s stomach clenches. He’d been too transparent, he knows it, and now Taehyung is going to let him down easy, tell him they need to go back to just hugging and cuddling. “But I just want to make sure you don’t feel like you have to do this? For me?”</p>\n<p>Jeongguk blinks at him, confused. “You need me, though,” he says, hating how much he’s coming to rely on that knowledge in the past few days. He knows he should want Taehyung to get better, and he does, but a selfish part of him has loved every minute of this. “Or you’ll get too cold.” </p>\n<p>“I know,” Taehyung says. “I meant, more, like, the other stuff? The kissing, and, ah - getting off together.” His cheeks are faintly pink. “I just don’t want you to feel obligated.”</p>\n<p>Jeongguk snorts so loudly that Taehyung startles, looking almost offended, but he can’t help it - the idea that he, Jeon Jeongguk, doesn’t want this with 100% of his being is so ludicrous it’s laughable. “I don’t feel obligated,” he says in a rush. “I - <em>believe me</em>. I would tell you if I didn’t want to.”</p>\n<p>As if he would ever not want to, as if he hasn’t spent the last five years dreaming about what it would be like to have this with Taehyung. He just wishes Taehyung wanted this on his own, and not because of some weird fortune cookie curse that’s throwing his body out of wack, but he pushes that thought aside for now. Jeongguk’s not one to look a gift horse in the mouth, especially not when it’s giving him open access to Taehyung’s body.</p>\n<p>“Okay, good,” Taehyung says, looking relieved. “In that case...” he trails off, biting his lip, and fuck, it makes Jeongguk crazy when he does that. </p>\n<p>“Yeah?” Jeongguk prompts, breathless. His hand is still wrapped around Taehyung’s forearm, and he gives a slight tug, urging him forward. Taehyung comes easily.</p>\n<p>“In that case,” he repeats, more firmly this time. “I’m going to kiss you now.”</p>\n<p>And he does, leaning in as Jeongguk’s hand comes up to cradle the back of his head. His hair is so soft beneath Jeongguk’s fingers, his lips pliant and eager against Jeongguk’s own. They’ve done this a lot over the past 48 hours, but Jeongguk still hasn’t gotten used to it, still feels a rush in his stomach with every new sound and touch.</p>\n<p>He bites down lightly on Taehyung’s lower lip, curious, and feels a jolt of arousal when Taehyung lets out a soft whimper of approval. His hand sneaks up under Taehyung’s too-big T-shirt, fingers splaying across his back, his skin surprisingly warm to the touch. Taehyung arches closer, hitching one leg up over Jeongguk’s, and oh, fuck - he’s already half hard. </p>\n<p>The realization sends Jeongguk into a tailspin, a moan ripped from his throat when he feels Taehyung pressed hot against his thigh. He rocks his own hips forward immediately, searching for that same friction they had found last night. </p>\n<p>“Jeongguk,” Taehyung breathes, winding an arm around Jeongguk’s neck. His voice is shaky. “Touch me?”</p>\n<p>And Jeongguk knows, he knows what Taehyung is asking for, just as clearly as he knows he’s probably going to die from being so insanely, painfully turned on. He nods frantically, their noses bumping together, one hand smoothing down Taehyung’s side and coming to a halt on his waist. There, he freezes, fingers suspended over the waistband of Taehyung’s sweatpants, too overcome to know what to do next.</p>\n<p>Taehyung whimpers against his mouth, nosing at Jeongguk’s cheek impatiently. Jeongguk takes a moment to look at him, really look at him - his eyes are squeezed shut, his lips kissed raw. There’s something in his face, a kind of pleading desperation, that finally spurs Jeongguk back into action, his hand moving to cup Taehyung through his sweats. Taehyung gasps, jerking into Jeongguk’s palm, and fuck if it’s not the hottest thing Jeongguk has ever experienced.</p>\n<p>“More,” Taehyung begs, pressing a sloppy kiss to the corner of Jeongguk’s mouth. “Please.”</p>\n<p>Jeongguk obliges, tugging at Taehyung’s sweats until he can close a trembling hand around his cock. He’s hard and heavy in Jeongguk’s palm, which like, 1) fuck and also 2) FUCK, because this is actually happening. He fights to keep his breathing even, stroking firmly, watching in awe as Taehyung’s face goes almost slack with pleasure. Jeongguk is achingly hard in his own pants, but it’s worth it for the small noises that are slipping from Taehyung’s lips, for the knowledge that Jeongguk is the one making him feel this way. He never, ever wants to forget this feeling.</p>\n<p>Emboldened, Jeongguk brushes his thumb over the tip of Taehyung’s cock, smearing the pre-come that’s been gathering there. Taehyung jolts, pulling Jeongguk to him and kissing him filthily, their tongues tangling. It’s intensely intimate, to have Taehyung in his hand and to feel his every quake and shudder against his own mouth. He strokes harder, more diligently, twisting his wrist as Taehyung whines and hikes his leg up higher on Jeongguk’s waist. </p>\n<p>He can tell Taehyung is close when he starts fucking into the circle of Jeongguk’s hand, when the kisses cease and instead his teeth catch on Jeongguk’s lower lip. Elated, dizzy with arousal, Jeongguk pulls him through it, watching in awe as Taehyung’s features crumple, his lips forming a perfect “o”. He lets out a small whimper, slumping sideways, his come coating Jeongguk’s stomach and hand. It’s so insanely hot, and Jeongguk can’t help himself - when Taehyung’s hips stutter against his, he comes too, biting down on his lip to stop himself from moaning aloud. His face flames, but Taehyung doesn’t seem to notice just yet, still coming down from his own high. </p>\n<p>“Shit,” he breathes, kissing Jeongguk softly. “We should’ve been doing this all along.” Jeongguk’s stomach gives a funny kind of flip, because this is <em>exactly</em> what he’s wanted all along, and he wonders what Taehyung really means - if it’s just this weird spell he’s under, or the sex, or maybe, if Jeongguk really lets himself hope, maybe more. </p>\n<p>Taehyung reaches for the front of his pants, and Jeongguk flinches away, but it’s too late - his hand settles over Jeongguk’s cock and finds the telltale wetness there. Jeongguk hisses at the oversensitivity, mortified, and watches in horror as Taehyung makes the connection.</p>\n<p>“Just... from watching me?” he says, breathless, his eyes wide. </p>\n<p>Jeongguk nods jerkily, avoiding Taehyung’s gaze. This is so embarrassing, now Taehyung will know how pathetically gone Jeongguk is for him and get freaked out.</p>\n<p>“That’s so fucking hot,” Taehyung breathes, and Jeongguk’s eyes snap up to his, stunned. Taehyung has always been full of surprises in regular life, so Jeongguk supposes it makes sense that that applies to sex as well. He shifts closer, so that their lips are just barely brushing, his fingers tangling in the hair at Jeongguk’s nape. “I can’t wait to get a hand on you, though.”</p>\n<p>Jeongguk chokes on his own spit, gagging, and Taehyung responds by bursting into laughter, tucking his face into the side of Jeongguk’s neck. His fingers still rest loosely in Jeongguk’s hair, and it feels so simply intimate that Jeongguk’s heart aches with it.</p>\n<p>“Jesus <em>Christ</em>, Taehyung,” Jeongguk whines. “You can’t just <em>say</em> stuff like that, shit.”</p>\n<p>“Says who?” Taehyung challenges, pulling back to level Jeongguk with a cheeky grin. Seriously, this man will be the death of him. “I think you like it.”</p>\n<p>Jeongguk flushes again, gaping at him, but Taehyung just giggles and tugs him in for another kiss. </p>\n<p>***</p>\n<p>They’re recording two interviews that day, which means a lot of time in the car and getting primped by the stylists, and a little time actually talking to interviewers. During a break between the two, Taehyung checks his phone and finds that he has a voicemail from the Golden Disc catering company, saying they will gladly put him in touch with whoever he needs to speak to. Oddly, he’s not as relieved by this news as he expected to be. </p>\n<p>He gets up from his position leaning against Jeongguk to go call them back somewhere more private, waving off Jeongguk’s confused look. Someone actually answers this time, and after a few tries, they patch him through to the woman who was managing the concession table on the second night of the Golden Disc Awards. Her name is Yuna, and he immediately recognizes her voice.</p>\n<p>“Taehyung,” she says, as if she’s known him for years. “I was wondering when I would hear from you.”</p>\n<p>Taehyung feels like he’s in some sort cliche scene from a bad movie, but her greeting does reassure him that she won’t think he’s an insane person when he asks whether it is in fact possible to fall under a spell cast by a magical fortune cookie.</p>\n<p>“Yes, umm, hello,” he replies, not really sure how to broach the subject. “Thank you for speaking with me. I wanted your advice, as it seems...” He clears his throat. This is easily one of the weirdest conversations he’s ever had. “The fortune in that fortune cookie has come true.”</p>\n<p>“This is why we tell you not to eat them,” Yuna says sternly.</p>\n<p>“I can understand that now, yes.” There’s silence on the other end of the line, so Taehyung presses on. “I was wondering, umm... if you knew how long it would last? Or how I can make it go away? It’s become a bit of a personal health risk.”</p>\n<p>“The answer is in the fortune,” Yuna says sagely. She doesn’t sound particularly concerned about Taehyung’s health.</p>\n<p>“‘Where there is honesty, there is relief?’” Taehyung recites. “I’m sorry, but I don’t know what that means.”</p>\n<p>“You’re very dense, then,” Yuna chides. She’s not one to be gobsmacked by the fact that Taehyung is an idol, clearly. “Or you’re just lying to yourself.”</p>\n<p>Taehyung gapes at his phone, even though Yuna obviously can’t see him. “I don’t understand,” he says, feeling like an idiot.</p>\n<p>“Once you are honest with yourself, the fortune will lift,” Yuna says.</p>\n<p>“Honest with myself about what, though?”</p>\n<p>She sighs. “It’s all in the fortune, Taehyung. It’s not my place to interpret it for you.”</p>\n<p>“But - ” Taehyung starts, exasperated.</p>\n<p>“That is all I can do for you,” Yuna interrupts. “You will need to figure the rest out on your own. Good luck, Taehyung.”</p>\n<p>And she hangs up, leaving Taehyung possibly even more confused than he had been before. On the bright side, at least he knows now that he’s not totally insane, and that this is actually happening to him because of a goddamn fortune cookie (although how that’s even possible, he still doesn’t understand). On the less bright side, he doesn’t feel any closer to figuring out what the second part of the fortune means, or how to make this - condition, or whatever it is - go away. </p>\n<p>He walks back into the room where the other members are waiting, and Jeongguk greets him with a curious look, opening his arm to make room for Taehyung duck under. It’s so warm and cozy pressed against his side, and not for the first time Taehyung thinks to himself that it wouldn’t be so bad if he had to rely on this for a while longer. </p>\n<p>“The woman from the catering company called me,” he says quietly, absentmindedly linking his fingers with Jeongguk’s. </p>\n<p>Jeongguk tenses so slightly that Taehyung only notices because he can literally feel it. “What did she say?” he asks.</p>\n<p>“Well, first of all, that I’m not totally losing it, this is happening because of the fortune cookie,” Taehyung says. “But also that the answer for how to make it go away is in the fortune itself, which I still don’t understand.”</p>\n<p>Jeongguk hums, resting his chin on Taehyung’s shoulder. “What did it say, again?”</p>\n<p>“Something about finding honesty.” He’s still conveniently forgotten to mention to anyone the part of the fortune that includes the word “love”.</p>\n<p>“Honesty about what?” Jeongguk asks, looking puzzled. “I feel like you’re pretty honest.”</p>\n<p>Taehyung shrugs. “No idea, and the lady wasn’t much help in figuring it out.”</p>\n<p>“Maybe the hyungs will have an idea,” Jeongguk suggests.</p>\n<p>“Maybe,” Taehyung agrees. He snuggles closer to Jeongguk, slinging his legs over his lap. “At least I have you to keep me warm until we figure it out.”</p>\n<p>Jeongguk smiles and hugs him tighter, and Taehyung thinks again that really, this isn’t so bad.</p>\n<p>***</p>\n<p>Jimin finds him in the kitchen while Taehyung is in the shower, one of the rare moments these days when they’re not attached at the hip. Jeongguk is staring aimlessly into one of the cabinets above the sink, not particularly hungry, mostly just looking for something to take his mind off of its near constant loop of <em>Taehyung Taehyung Taehyung</em>.</p>\n<p>“Hey,” Jimin says, padding into the kitchen and startling Jeongguk out of his listless reverie.</p>\n<p>“Hi.”</p>\n<p>Jimin perches himself on one of the stools surrounding the center island, leveling Jeongguk with that look he gets when he’s about to Spit Some Truths. </p>\n<p>“Are you okay?” he asks, folding his hands together.</p>\n<p>Jeongguk decides to go for the “play dumb” approach first. “Uh... yes?”</p>\n<p>Predictably, Jimin sighs. “I mean, like, with this whole thing with Tae.”</p>\n<p>Jeongguk returns his attention to the still open cabinet, examining it closely without really seeing anything. “Why wouldn’t I be?” he asks defensively.</p>\n<p>This is the wrong answer. </p>\n<p>“Oh, I don’t know, maybe because you’ve been harboring secret feelings for him for literally years?” Jimin says quietly, rolling his eyes.</p>\n<p>Jeongguk whirls to face him, horrified. “Shut <em>up</em>,” he hisses.</p>\n<p>Jimin blinks at him, unimpressed. “Tell me that’s not true.”</p>\n<p>“I - I mean. How even - what?” Jeongguk stammers. He’s never talked about this with anyone before, never. Except for, okay, that one night years ago when he had gotten too drunk and confessed a diluted version of the truth to Jimin. But that had been <em>years</em> ago. “That was a long time ago, I don’t - ”</p>\n<p>“Jeonggukie,” Jimin says gently. “Come on.”</p>\n<p>Jeongguk sighs, defeated. In an odd way, it feels like a relief, to have a tiny piece of this secret lifted off of his chest. “How long have you known?” he asks quietly. </p>\n<p>“Since, like, forever,” Jimin says, shrugging, as if this isn’t the single biggest secret of Jeongguk’s life, one he’s spent the past 5 years guarding. “Before you even told me that one time when we were wasted.”</p>\n<p>Jeongguk flushes. “Is it really that obvious?” </p>\n<p>“Maybe not to the others,” Jimin says thoughtfully. “Although I feel like Namjoon might suspect. But to me, yes. You just... are softer, with him.”</p>\n<p>“Do you think <em>he</em> knows?” Jeongguk asks, staring at his hands, his voice very small.</p>\n<p>“Honestly?” Jimin says. “He’s fucking oblivious, but no.”</p>\n<p>Jeongguk lets out a sigh of relief at this, his stomach unknotting slightly.</p>\n<p>“I just want to make sure you’re okay,” Jimin says kindly, patting Jeongguk’s hand. “I can’t imagine it’s easy for you to be so close to him all the time, sharing a bed every night.”</p>\n<p>And because it’s apparently fucking honesty hour, Jeongguk says: “We’ve kind of been, umm. You know.”</p>\n<p>Jimin’s eyes go wide. “I KNEW you two were acting weird!” he cries, half accusing and half smug. “Shit. So you’re like, in it, then.”</p>\n<p>Jeongguk nods. “I don’t think I can stop.” His voice is barely above a whisper. It’s true - he knows this is going to hurt like hell when it’s over, when Taehyung’s body goes back to normal. But he also doesn’t see any scenario in which he’s physically able to walk away from whatever Taehyung is willing to give him.</p>\n<p>“Ah, Jeonggukie,” Jimin says sadly, slipping off his stool and walking over to hug Jeongguk around the middle. “What if you just... tell him?”</p>\n<p>Jeongguk shakes his head. “I can’t, not right now. Not when he’s literally physically dependent on me. It wouldn’t be fair.”</p>\n<p>“Not much about this situation is fair,” Jimin observes. “Or logically possible, but whatever.”</p>\n<p>“Taehyung’s health is the most important thing to me right now,” Jeongguk says firmly. “Everything else can wait.” And he really believes this, even if the “everything else” is breaking his fragile heart.</p>\n<p>Jimin looks at him fondly. “You’re a really, really good friend,” he says, hugging Jeongguk tighter.</p>\n<p>The problem is, Jeongguk worries that’s all he’ll ever be.</p>\n<p>***</p>\n<p>They have the next morning off, and Taehyung spends it draped fully on top of Jeongguk, playing games on his phone while Jeongguk catches up on responding to emails from various family members. It’s quiet, tranquil, with the added bonus that Taehyung feels like he’s lying on top of one of those electrically heated blankets. </p>\n<p>“How’s the fam?” he asks when Jeongguk snaps his laptop shut. His chin is propped on Jeongguk’s shoulder. </p>\n<p>“They seem good,” Jeongguk replies, stretching his arms out in front of him and wiggling his fingers. “They always say how much they miss me, it makes me feel guilty.”</p>\n<p>Taehyung understands that - this crazy, incredible, whirlwind life of theirs doesn’t allow much time for family, and they end up missing a lot. The guilt weighs on Taehyung as well, especially when he thinks about his younger siblings. Still, he doesn’t think he would change anything, especially when he considers this second family the seven of them have made, closer and more dear to him than he ever could have imagined when they first met.</p>\n<p>“You’re making them so proud, though,” Taehyung says reassuringly, rubbing his thumb over Jeongguk’s arm. </p>\n<p>“I know,” Jeongguk sighs. “And I mean, this is so - this is my dream, beyond my dream. I just wish I could be both, you know?”</p>\n<p>“I do,” Taehyung says. He’s tempted to kiss the back of Jeongguk’s neck, but restrains himself. “But we should remember to make the most of what we have right now. It won’t be this way forever.”</p>\n<p>Jeongguk is quiet for a moment. “Yeah,” he says eventually. “That makes me sad to think about too.” He pauses again, and Taehyung wishes he could see the expression on his face right now. It feels like something has shifted in their conversation. “I like the way things are now.”</p>\n<p>“Me too,” Taehyung replies softly, resting his cheek along the plane of Jeongguk’s back. The fear that’s been nagging at him all week, and especially since he spoke to Yuna, gains more traction in his brain. What is he going to do when he isn’t reliant on Jeongguk’s body heat anymore? </p>\n<p>“I’m gonna go shower,” Jeongguk announces abruptly. Taehyung makes a noise of dissent but rolls off of him anyway, ignoring the pit in his stomach as he watches Jeongguk discard his shirt and disappear out into the hallway.</p>\n<p>He flops back on to Jeongguk’s pillows, enjoying the scent of Jeongguk that surrounds him, and stays there for all of one minute before leaping up and following Jeongguk out the door. If their time in this sort of weird limbo is limited, he’s damn sure going to make the most of it. </p>\n<p>The hallway is blessedly empty as he makes his way to the bathroom, knocking lightly on the door when he finds it locked. </p>\n<p>“I’m about to shower!” Jeongguk calls from inside.</p>\n<p>“It’s me,” Taehyung responds, his mouth pressed up against the small crack between the door and its frame. </p>\n<p>There’s a beat of silence, and then the door opens slightly, Jeongguk peering out at him curiously. He’s still dressed in just his sweats, his torso lean and taut. “Is something wrong?” he asks. “Are you too cold?”</p>\n<p>Taehyung shakes his head, pushing past Jeongguk and shutting the door behind him, locking it. Jeongguk looks between him and the door, confused, and Taehyung feels a heady rush of excitement and desire.</p>\n<p>“I just was thinking,” he murmurs, stepping closer, so that Jeongguk is crowded up against the counter. The words feel impossibly bold on his tongue, but he can’t stop himself from saying them. “How I haven’t gotten to touch you, yet.”</p>\n<p>Jeongguk inhales sharply, eyes going wide, his hands scrambling to clutch at Taehyung’s hips. “Jesus,” he says, and Taehyung kisses him.</p>\n<p>“Is that okay?” Taehyung asks, fingers hovering at his waistband, just barely brushing the skin there. </p>\n<p>“<em>God</em>, yes,” Jeongguk breathes, his mouth chasing Taehyung’s, so that when Taehyung smirks, it’s against his lips. </p>\n<p>He reaches for Jeongguk, the heel of his palm pressing experimentally against his groin, smile widening when he finds him half hard. He quirks a self-satisfied eyebrow at Jeongguk, who groans and grabs the back of his head, pulling him in for another kiss. </p>\n<p>Jerking Jeongguk off is one of the more gratifying experiences Taehyung has had in his life. His body is exceptionally responsive, jumping under every touch of Taehyung’s hand. He whimpers when Taehyung finally wraps a hand around his length, hips arching hard off the counter, his hands flying back to steady himself. Jeongguk is the one with his cock out, but Taehyung flushes under his gaze, dark and hungry, his lips just slightly parted.</p>\n<p>When Jeongguk comes, his head is thrown back, throat exposed as Taehyung presses a row of kisses from his chin to his collarbone. The noises he’s making have gotten progressively less restrained, soft whines devolving into something rawer, louder, more guttural. Taehyung wonders vaguely if they’re being loud enough for someone to hear if they pass by in the hallway, feels a zing of arousal at the prospect. He’s drunk on the knowledge that he can make Jeongguk feel this way, that this gorgeous boy who gives away so little is shaking apart under his hands, Taehyung’s name on his lips. </p>\n<p>He comes across Taehyung’s shirt, which incidentally is actually one of Jeongguk’s shirts that he had borrowed earlier.</p>\n<p>“Sorry,” he winces, eyes settling on the mess once Taehyung has tucked him carefully back into his sweatpants.</p>\n<p>“It’s your shirt,” Taehyung replies cheerily.</p>\n<p>Jeongguk sighs. “I thought it looked big on you.”</p>\n<p>“Guess we have no choice but to get cleaned up,” Taehyung says brightly, stripping off the dirty T-shirt and dropping it on the floor. He steps out of his sweats as well, preening a little when Jeongguk’s gaze snags on the obvious bulge in his briefs. </p>\n<p>“Like - together?” Jeongguk chokes out when Taehyung turns on the shower and looks at him expectantly. His eyes are almost comically round.</p>\n<p>“Unless you’d rather take turns,” Taehyung says, raising an eyebrow at him.</p>\n<p>“No!” he nearly shouts, then flushes. “I mean, no, or yes - let’s, god.” He looks so adorably flustered that Taehyung can’t resist stepping forward and kissing him.</p>\n<p>“So, together, then?” he murmurs.</p>\n<p>“Yes, please.”</p>\n<p>Acting bolder than he actually feels, Taehyung steps back from him and tugs off his briefs. Jeongguk has literally touched his cock before, but he stills feels exposed, standing here totally naked in front of him. A flush threatens to creep up his neck, until he notices the way Jeongguk is looking at him, eyes raking over his body like he’s never wanted anything so badly in his life. Under a gaze like that, it’s hard to stay shy for long.</p>\n<p>“You do realize you need to take your clothes off before you get in the shower,” Taehyung teases, giggling when Jeongguk nearly trips over himself in his rush to pull off his sweatpants and underwear.</p>\n<p>“C’mon, you dork,” he says fondly, extending his hand to Jeongguk once he’s fully undressed. Jeongguk’s eyes linger on his outstretched hand for just a moment before he takes it and follows Taehyung into the hot spray of the shower.</p>\n<p>***</p>\n<p>So Taehyung’s day starts with an orgasm, and then they have dance practices all afternoon, followed by a sweaty, exhausted dinner. Jeongguk slips away to call his parents before bed, and Taehyung finds himself in Jimin’s room with Jimin and Namjoon, not doing much of anything in particular. It doesn’t occur to him that this may have been a bit of a set up until Namjoon says:</p>\n<p>“So, Tae, any progress on the whole fortune cookie front?”</p>\n<p>Taehyung shrugs. He’d told them in passing that he’d spoken to Yuna yesterday, but hadn’t given much detail. He supposes he should have expected them to press it further at some point. The real question here is why Taehyung himself hasn’t been more invested in figuring it out, given that his own health seems to be at risk.</p>\n<p>“Yuna basically said I have to figure it out by myself,” he says. “The answer’s in the fortune, or so she says.”</p>\n<p>“Can we read the actual fortune?” Jimin asks. “Like, word for word? Maybe we’re missing something.”</p>\n<p>Taehyung blanches, and Jimin looks at him suspiciously.</p>\n<p>“Taehyung?”</p>\n<p>Namjoon is watching him curiously too.</p>\n<p>“I, umm,” Taehyung says sheepishly. “Maybe adjusted the language, just a little? When I told you guys about it?”</p>\n<p>Jimin glares at him, and Namjoon sighs.</p>\n<p>“Alright, come on, let’s hear it,” Namjoon says. </p>\n<p>Taehyung swallows. He supposes now is as good as time as any to tell them - it was going to have to come out eventually. “So, the full thing said: Where there is love, there is warmth.” He winces a little at the word love, and he can tell Namjoon and Jimin catch it too. “Where there is honesty, there is relief.”</p>\n<p>Namjoon whistles. “Love, huh?”</p>\n<p>Taehyung buries his face in his hands, nodding. “I mean, obviously I love Jeongguk,” he scrambles to say. “But I love all of you guys too.”</p>\n<p>“Maybe it’s... different?” Jimin suggests gently, as if he’s afraid of scaring Taehyung off with his words. He seems less surprised by this development than Namjoon.</p>\n<p>It is different, Taehyung knows that. It’s always been different with Jeongguk, pretty much since day one. And now they have this weird connection, and they’re hooking up, and it’s just - it’s a lot, and Taehyung doesn’t know how to process it all.</p>\n<p>“I don’t know,” he groans, flopping back on Jimin’s bed. He’s starting to feel a little chilly again, and his body craves Jeongguk, even as his mind reels. “I just, I don’t know what’s happening to me.”</p>\n<p>Jimin nods sympathetically, sitting down next to him and patting his leg. As usual, his touch feels lukewarm - pleasant, but nothing compared to how it feels when Jeongguk touches him, the heat that explodes through his body.</p>\n<p>“Maybe we should focus on the other part of the fortune,” Namjoon suggests. He’s sitting on the floor, knees bent up in front of him, arms draped across them. “The part about honesty bringing relief.”</p>\n<p>“Yuna said I had to be honest with myself,” Taehyung says, sitting up. “And that would end this.”</p>\n<p>“Maybe...” Jimin begins, looking thoughtful. “Maybe, you have to be honest with yourself about the source of the warmth.”</p>\n<p>Taehyung blinks at him. “About Jeongguk?” he says, throat suddenly dry. “I already know it has to come from him, though. And why, I guess.”</p>\n<p>Jimin shrugs. “Just a thought.” </p>\n<p>Taehyung looks back and forth between Jimin and Namjoon, not feeling particularly good about the assessing looks they’re giving him. Is he missing something here? Of course he loves Jungkook, they’re best friends - there’s nothing new there. </p>\n<p>“You should get back to him,” Namjoon says, breaking into his thoughts. “You’re starting to shiver.”</p>\n<p>Taehyung nods silently, wrapping his arms around himself as he bids them goodnight. He’s oddly nervous as he walks to Jeongguk’s room, his conversation with Jimin and Namjoon lingering in his mind. The feelings that have been accumulating in the back of his mind over the course of this week clamor for attention, but he does his best to block them out. Just because he and Jeongguk are hooking up now doesn’t mean anything else has changed. And besides, he doesn’t even know how Jeongguk feels about all of this, other than that he seems to be enjoying the sex part just as much as Taehyung is.</p>\n<p>He knocks lightly at Jeongguk’s door, realizing belatedly that he never knocks. Maybe he just needed the extra few seconds to collect himself. The door swings open and Jeongguk appears, phone in hand.</p>\n<p>“Fuck, sorry, I was just coming to find you,” he says, ushering Taehyung inside. “I can never get my mom off the phone, you know how it is.”</p>\n<p>“It’s okay,” Taehyung says quietly. </p>\n<p>Jeongguk takes in the way he’s hunched in on himself and reaches for his face, eyebrows furrowing in concern. “Shit, Tae, you’re cold,” he says. “You should have come and gotten me sooner.”</p>\n<p>“I’m fine,” Taehyung protests, even though he’s not, really.</p>\n<p>Jeongguk ignores him, yanking his shirt over his head and pulling him close. Taehyung smiles fondly at the way his hair sticks up at odd angles and allows himself to be held, resting his cheek on Jeongguk’s shoulder. The warmth seeps back into him slowly, spreading through his heart and out to the tips of his fingers and toes. He thinks he could stay here standing like this forever. A part of him aches to tell Jeongguk that, but the more practical side of his brain keeps him quiet.</p>\n<p>“Want to sleep?” Jeongguk asks, when Taehyung yawns into his neck. He nods, exhaustion tugging at his eyelids. Sleep sounds a lot more appealing than sorting through the mess in his brain right now. </p>\n<p>He follows Jeongguk into bed, and they curl up side by side, Jeongguk curving around him and holding him close. It makes Taehyung melt, just a little. </p>\n<p>“Warm enough?” Jeongguk asks, his breath soft against Taehyung’s ear. Taehyung squeezes his eyes shut, because it’s so sweet, but it’s also a reminder of why they’re in this position in the first place - not because they chose to be, but because of the fortune, and Taehyung’s physical well-being. Jeongguk is just being a good friend, like he always is.</p>\n<p>“Perfect,” Taehyung whispers, eyes stinging traitorously as he feels Jeongguk’s nose press against the back of his neck. He resists the urge to thread his fingers with Jeongguk’s and wills himself to sleep instead.</p>\n<p>***</p>\n<p>Taehyung is stretched out underneath Jeongguk, chest bare, lips kissed pink and swollen, pupils slightly dilated. He looks throughly debauched from just a few minutes of kissing, and Jeongguk can’t help but feel a little smug about it. The expanse of his chest is smooth and unmarred, his belly flat and tender, and all Jeongguk wants to do is ruin him, leave marks from his collarbones down to the jut of his hips. Jesus fuck, he just <em>wants</em> so fucking much.</p>\n<p>Luckily, Taehyung can’t hear the thoughts ricocheting around in his head, although he can probably read them on Jeongguk’s face when he reaches for him, fingers weaving into his hair as he pulls him in for a kiss. He’s hard, Jeongguk can feel it against his hip, and there’s another thought hovering at the forefront of his mind, threatening to slip out any moment now: he wants to taste.</p>\n<p>Taehyung makes a noise of dissent when Jeongguk pulls away from his mouth, but it turns into a gasp when Jeongguk’s teeth skim down his neck, tongue flicking over a nipple. He restrains himself from getting too caught up as he works his way down Taehyung’s torso, but he can’t resist sucking a bite or two into the soft, perfect skin. Taehyung, for his part, doesn’t seem to mind, his head thrown back against the pillow as he squirms under Jeongguk’s mouth.</p>\n<p>“Hyung,” Jeongguk says when reaches the waistband of Taehyung’s sweats, his voice breathier than he had intended. He’s situated between Taehyung’s legs now, hands resting on the outsides of his thighs, and he’s so close to his cock that he can barely articulate a coherent sentence.</p>\n<p>Taehyung works himself up on to his elbows, looking down at him with dark eyes. “Yeah? he says. He has to know what Jeongguk’s thinking, what with where he’s currently positioned and all.</p>\n<p>The words tumble out of Jeongguk’s mouth before he can stop them. “Hyung, can I,” he stammers, swallowing. “CanIgodownonyou,” he finishes in a rush.</p>\n<p>Taehyung gapes at him, his eyes wide, and Jeongguk feels his cheeks flame. </p>\n<p>“You want to?” Taehyung says, his voice cracked.</p>\n<p>“I want to make you feel good,” Jeongguk all but whispers. “I think it’ll make you feel good.”</p>\n<p>He’s thought about it more than he cares to admit - if everything they’ve done so far makes Taehyung warm, he wants to know what his mouth can do. And he wants to know more than that too, what it would feel like to be inside -</p>\n<p>“Shit, Jeongguk, <em>yes</em>,” Taehyung says, his mouth still hanging open.</p>\n<p>Together, they fumble with Taehyung’s pants and briefs, tugging them off in one go. Then Jeongguk settles back down between his legs, face to face with the magnificence that is Taehyung’s cock and not a great deal of knowledge about what to do next. But Taehyung is still staring at him with a somewhat glazed over expression on his face, so he just goes for it, ducks his head and takes him down as far as he can go, flattening his tongue along the underside.</p>\n<p>From there, it comes naturally enough, hollowing out his cheeks to suck harder, tonguing at the slit and catching Taehyung’s hips when they jerk up off the mattress. If Jeongguk thought Taehyung had been vocal before, it’s nothing compared to this, his voice husky and wrecked as he whines prettily. His elbows give way beneath him at some point, and he collapses back into the pillows, one arm tossed over his eyes. </p>\n<p>When Taehyung comes, it takes them both by surprise, and Jeongguk gags a little, coughing even as he manages to swallow most of it. Taehyung is back up on his elbows as soon as he comes down from the high, reaching for Jeongguk guiltily.</p>\n<p>“Sorry! I’m sorry,” he says apologetically. “C’mere.”</p>\n<p>Jeongguk crawls up his body, eyes still watering just a little, not that he cares at all. He just made Kim Taehyung come down his throat <em>and</em> managed not to come in his pants (though it was a near thing) in the process, which feels like a win win.</p>\n<p>“Jeonggukie,” Taehyung murmurs adoringly, brushing a thumb over his lower lip. He’s looking at Jeongguk almost reverently, the gaze making Jeongguk’s heart ache. His eyes fall shut as Taehyung’s knuckles graze over his cheek, and for one second he lets himself get lost, pretends he can have this always and not just because he managed to give Taehyung a halfway decent blow job.</p>\n<p>“Kiss me,” he pleads, wondering if Taehyung can hear the desperation in his voice, if he’ll even want to kiss Jeongguk after where his mouth had just been. </p>\n<p>He gets his answer to the second question not 10 seconds later, when Taehyung not only kisses him but slides his tongue into Jeongguk’s mouth, whimpering a little when he tastes himself there. It feels so filthy, but in the best way possible, and Jeongguk groans, pressing their lips together more urgently. </p>\n<p>He’s grateful for the distraction when Taehyung rolls them over, whispering “your turn” against his mouth before shimmying down his body. Jeongguk barely has the time to realize what he means before Taehyung’s tongue is teasing around the head of his cock, and his brain effectively short circuits.</p>\n<p>He’s not sure how much longer he can do this, but he knows he never wants it to end. </p>\n<p>***</p>\n<p>“Jiminie,” Taehyung moans, flinging himself down on Jimin’s bed.</p>\n<p>“What’s wrong,” Jimin says patiently, spinning in his desk chair to face him. </p>\n<p>“I have a problem, I think.”</p>\n<p>“You have a lot of problems, but okay,” Jimin says cheekily, and Taehyung sits up to glare at him.</p>\n<p>“I’m serious.”</p>\n<p>“Okay, tell me.”</p>\n<p>“Jeongguk gave me a blow job,” Taehyung says, because that’s easier than saying what he’s actually thinking.</p>\n<p>“Oh, Jesus Christ,” Jimin wails, clapping his hands over his ears. “I really super duper did not need to know that.”</p>\n<p>Taehyung sulks, and Jimin sighs, pulling his hands away from his ears.</p>\n<p>“Why is this a problem? Was it bad or something?”</p>\n<p>“No, god, it was so good, fuck,” Taehyung says hurriedly, glazing over for a minute when he remembers how it had felt to be engulfed in the spectacular heat of Jeongguk’s mouth. And the way he had <em>looked</em> after, fuck. <em>Fuck</em>, Taehyung is so screwed.</p>\n<p>“Earth to Taehyung,” Jimin says loudly, snapping his fingers. “Ew, god, you’re thinking about it right now aren’t you.”</p>\n<p>“Sorry,” Taehyung says sheepishly, his face heating up.</p>\n<p>“So then walk me through this,” Jimin continues. “If it was that good - which, by the way, not surprised, the golden maknae <em>would</em> give grade A head - then why are you upset?”</p>\n<p>Taehyung groans, falling backwards on the bed again. “We keep doing this,” he says. “We keep doing more and more, and I keep wanting more and more. I feel like I can barely even think straight.”</p>\n<p>Jimin gets up from his chair and walks over to the bed, sitting down cross legged beside him. “Do you think it’s just because of the fortune cookie?” he asks cautiously.</p>\n<p>“I can’t tell,” Taehyung sighs. “That’s what started it, but... I can’t tell anymore.”</p>\n<p>“Is it just about the sex?” </p>\n<p>The question hangs in the air between them, and Taehyung’s stomach clenches, because this is what’s been nagging at him all along.</p>\n<p>“I don’t think so,” he whispers, covering his face with his hands. “Ugh, I’m so fucked.”</p>\n<p>Jimin tugs on his wrist, pulling one hand away. “Maybe you should just... talk to him?” he suggests. “Find out where his head is?”</p>\n<p>Taehyung shakes his head despairingly. “I don’t feel like I can while this whole thing is going on. It’s too complicated, I don’t even know my own head right now.”</p>\n<p>It feels a little bit like a cop-out, but there’s too much at stake right now: he can’t risk further jeopardizing their friendship, especially when there’s the minor detail of Taehyung still being physically dependent on Jeongguk’s body heat. He doesn’t want to make things even messier by dragging his feelings into it, especially when his judgment is being clouded by the fortune cookie.</p>\n<p>Jimin sighs. “Yeah, I understand. I still feel like you guys should talk though, once you’re back to normal.”</p>\n<p>Taehyung nods, biting his lip. “The problem is, I don’t want it to end.”</p>\n<p>Jimin runs a hand through his hair, examining Taehyung carefully. “Well,” he says. “I think you found your honesty.”</p>\n<p>Really, though, Taehyung finds his honesty later that night, when he and Jeongguk are huddled together on the floor of Jeongguk’s room, at least an hour deep into playing Overwatch. He’s talking smack, obviously, and Jeongguk shoves him playfully, smiling that smile where his nose scrunches up and the left side of his mouth quirks a little higher than the right. His face is totally makeup free, his hair is flat and messy, and he’s dressed in a giant hoodie, but Taehyung just loves him, is the thing. He really fucking loves him.</p>\n<p>Oh, shit.</p>\n<p>“What’s wrong?” Jeongguk asks, because apparently Taehyung had said that last part out loud.</p>\n<p>“Nothing, never mind,” Taehyung says hurriedly, shaking his head. Jeongguk gives him a weird look but shrugs and goes back to playing.</p>\n<p>Shit, fuck.</p>\n<p>It seems kind of obvious, now that he thinks about it, and he’s not really sure how he hadn’t realized it earlier. Maybe he did realize, and he’s just been hiding from himself, like Yuna had implied. But now he knows it, clear as day: Taehyung loves Jeongguk, and it’s not in the way he loves the other boys - he loves him like a shock of heat through his body, the kind that makes you feel warm all over. </p>\n<p>***</p>\n<p>When Taehyung wakes up the next morning, the space between him and Jeongguk confirms what he already suspected. He feels completely normal, not too cold, and when he reaches over to tentatively touch Jeongguk’s hand, he finds him lukewarm, nothing compared to the rush of warmth he’s grown accustomed to over this past week. He pulls his hand away quickly, and his stomach drops. He’s been cured, and this thing between them, whatever it is - it’s over.</p>\n<p>“Hey,” Jeongguk says sleepily, blinking awake. His face is smushed into his pillow, and he looks so adorable that Taehyung is tempted to lie and pretend that nothing has changed.</p>\n<p>“Hi,” he replies, his voice strangled.</p>\n<p>“You okay?” Jeongguk asks, reaching for him. His hand closes around Taehyung’s wrist, and just like before, the touch of his skin just feels... normal.</p>\n<p>“Jeongguk,” he says quietly. “I think...” He swallows, forcing himself to continue speaking. “I think I’m better.”</p>\n<p>Jeongguk’s eyes widen, and he yanks his hand away as if he’s been burned. Taehyung flinches.</p>\n<p>“Oh,” he says hollowly. “So you’re not... you’re not cold, or anything?”</p>\n<p>Taehyung shakes his head, feeling like his heart is cracking in half. “I feel totally normal.”</p>\n<p>“Well, that’s great!” Jeongguk says, his voice a little strained. He’s smiling, although it doesn’t quite reach his eyes. “You don’t need me anymore!” </p>\n<p>Except for Taehyung does need him, he does.</p>\n<p>“Yeah, I guess not,” he agrees, forcing himself to smile back. “But, I just wanted to say - thank you, so much. You literally saved my life this week, and I really - it means a lot.”</p>\n<p>The words are raw with emotion, and he aches to reach out and touch Jeongguk’s face, but he can’t - everything is different now, every action feels more weighted. He needs time to think, to sort through his feelings and figure out what this means for their relationship moving forward.</p>\n<p>“Of course,” Jeongguk murmurs. “I’ll always be here.”</p>\n<p>Taehyung smiles at him sadly, his eyes stinging with tears. He needs to get out of here before he completely loses it.</p>\n<p>“I’m, uh - I’m gonna go shower, and stuff,” he says hoarsely, rolling away from Jeongguk to hide his face. </p>\n<p>“You can stay,” Jeongguk offers, and Taehyung wants to die. “If you want to.”</p>\n<p>Taehyung shakes his head, even though he wants nothing more than to stay, to curl up against Jeongguk’s chest and stay there all day. “I need to clear my head, I think. I’ll see you in a bit.”</p>\n<p>He doesn’t look back when he leaves the room, afraid of what he might see on Jeongguk’s face if he does.</p>\n<p>***</p>\n<p>Taehyung tells the boys the news that morning at breakfast, and everyone is thrilled. Seokjin looks like he might pass out from relief, having spent the better part of the last week fretting to anyone who would listen (mostly Namjoon) over whether it was his responsibility as the group hyung to force Taehyung to see a doctor.</p>\n<p>Jeongguk pastes a smile on and does his best to join in on the group’s merriment, but it’s a tall order when he feels like he might fall apart at any moment. He’s furious with himself, because he knew this would happen, he <em>knew</em>, and yet he’d let himself get caught up anyway. And now here he is, right back where he started, except for now that he’s had a taste he doesn’t know how he’s ever going to be normal around Taehyung again. </p>\n<p>Mercifully, Jimin is the only one who seems to notice something’s off with him, which honestly Jeongguk could have predicted. He keeps shooting worried looks at Jeongguk during breakfast, which Jeongguk pointedly ignores until Jimin literally corners him in his bedroom later that day.</p>\n<p>“I don’t want to talk about it,” he snaps when Jimin opens his mouth. Jimin raises an offended eyebrow at him, and Jeongguk sighs. “Sorry.”</p>\n<p>“I guess I don’t really need to ask how you’re doing, then,” Jimin says, folding his arms across his chest.</p>\n<p>Jeongguk shrugs miserably. “It’s my own fault, I knew this would happen and I did it anyway.”</p>\n<p>“Don’t be so hard on yourself,” Jimin says gently. “You were being a good friend.”</p>\n<p>Jeongguk snorts derisively. “Yeah, going down on someone because you’re thirsty for their cock is the hallmark of any good friendship.”</p>\n<p>God, he hates himself right now. He’d been so fucking stupid.</p>\n<p>“I heard you were good at it,” Jimin offers, and Jeongguk’s head snaps up so quickly he nearly breaks his neck. </p>\n<p>“What.”</p>\n<p>Jimin flashes him a smug smile, wiggling his eyebrows. </p>\n<p>“He said that?” Jeongguk says disbelievingly.</p>\n<p>“Yes, unfortunately, and I’m traumatized,” Jimin informs him. “But also very proud of you for taking that D like a champ.”</p>\n<p>“Oh my <em>god</em>,” Jeongguk hisses, his face heating up. There’s a swell of hope in his stomach though, because this means Taehyung had talked about him with Jimin. It’s not much, but it’s something, a confirmation that this past week really did happen.</p>\n<p>“Yeah, so before you get all dejected and sulky, think about that,” Jimin says. “This cause may not be as lost as you think.”</p>\n<p>Jeongguk’s shoulders droop as he thinks back to this morning, how quick Taehyung had been to leave the room, how he’d barely even looked at Jeongguk when he did. “I dunno, Jiminie,” he says, shaking his head. “He practically bolted after he told me this morning, and we haven’t spoken since.”</p>\n<p>Jimin sighs. “Give him a little time. I think this week was confusing for him, too.”</p>\n<p>Jeongguk nods, because even though it’s painful, he knows Jimin is right. After this week, some space would probably be good for both of them. </p>\n<p>So he gives Taehyung time, and he gives Taehyung space. They don’t exactly avoid each other, but they’re careful around each other, choosing their words and actions closely. The easiness that had always existed between them is gone, and Jeongguk thinks that’s the worst part - his heart is shattered, but it kills him to feel like he’s losing his best friend. </p>\n<p>Ironically, the best word Jeongguk can find to describe how he feels now is cold. He spends a lot of time lying awake in his bed, staring up at his ceiling and listening to sad music like some sort of teen movie cliche. He misses the warmth of Taehyung next to him every night, misses his aimless chatter and the press of his body. A few times, he slips and gets himself off to the memory of Taehyung’s lips wrapped around his cock, his broken whimpers when Jeongguk had made him come. The way he had looked standing in the bathroom in Jeongguk’s too-big shirt, streaked with Jeongguk’s cum. It works like a charm, but every time he comes down from his orgasm he just feels guilty and empty. Cold.</p>\n<p>They don’t say it outright, but he thinks the other members probably notice something is off - Jeongguk knows he’s being quieter than usual, and it’s hard to miss that he and Taehyung aren’t attached at the hip the way they had been even before the fortune cookie debacle. He catches Namjoon watching him curiously a few times, and Seokjin is extra maternal and affectionate, massaging Jeongguk’s neck and fluffing his hair at least five times a day. Jimin hangs off of him more than usual, clinging to Jeongguk like some sort of real live security blanket. Even Yoongi is gentle with him, letting him off the hook even when he’s grumpy or petulant.</p>\n<p>It’s Hoseok who ends up staging an actual intervention, after he walks in on Jeongguk lying facedown on his bed listening to Adele.</p>\n<p>“Jesus Christ,” he says, turning off the music. “I’m not even going to ask, but get your ass up. Impromptu dance practice, dance line only.”</p>\n<p>So they get Jimin and go spend three hours in the studio, running through old choreography, refining some of the new stuff, and free styling to their favorite songs. It does help, and on the bright side Jeongguk is so exhausted that night that he ends up sleeping better than he has all week.</p>\n<p>On Saturday, Taehyung appears at his bedroom door. He knocks, which is weird, but Jeongguk is so happy to see him that he doesn’t even care. </p>\n<p>“Hi,” he says, startled when he opens the door and finds Taehyung on the other side.</p>\n<p>“Hi,” Taehyung says shyly. He has his arms wrapped around himself, and on reflex, Jeongguk reaches for him.</p>\n<p>“Shit, is it back?” he asks worriedly, grabbing Taehyung’s forearms and looking him up and down.</p>\n<p>“No, no, I’m fine,” Taehyung says, and Jeongguk drops his hands quickly, embarrassed.</p>\n<p>“Sorry,” he mumbles, stepping back. “Old habit, I guess.”</p>\n<p>“It’s okay.” Taehyung shakes his head, shuffling closer and wrapping his arms around Jeongguk. Jeongguk stills, stunned. “I missed you this week.”</p>\n<p>Jeongguk swallows, carefully hugging Taehyung back. It feels so good to hold him again. “I missed you too,” he chokes out.</p>\n<p>“Want to play Overwatch?” Taehyung says into his shoulder. </p>\n<p>“Always.”</p>\n<p>Taehyung laughs. </p>\n<p>It’s not perfect, and there’s still an ache in Jeongguk’s chest that he’s not sure how to fix, but at the very least it’s better than the cold blankness he’s been feeling all week.</p>\n<p>***</p>\n<p>The first week after the fortune cookie spell is broken is really, really difficult. Taehyung’s whole body aches for Jeongguk, and more than once he stops halfway through walking to Jeongguk’s room and forces himself to go back to his own. He knows that the space is important, not just for him but probably for Jeongguk as well, but it doesn’t make it any easier. The one upside is that he gets a lot of time to think, to sort through everything that happened and piece together his feelings now that his body is his own again. He finds that he feels almost exactly the same as he had during that week - it’s like some sort of dam has broken inside of him, and everything he’d been holding back for so long is rushing forth.</p>\n<p>The second week is both easier and harder, because he and Jeongguk start easing back into the way things had been before the fortune cookie. It soothes the part of him that had missed Jeongguk so desperately, but it also makes him hungry for more. Taehyung is very much gone for his best friend, he knows this with total certainty now, but that doesn’t resolve the minor issue of what the hell he’s going to do about it. </p>\n<p>“You should talk to him,” Jimin says approximately once an hour.</p>\n<p>“He’s been moping around like a kicked puppy all week,” Yoongi chimes in, probably because Jimin put him up to it. “Put the kid out of his misery.”</p>\n<p>Still, Taehyung balks. The prospect of coming clean to Jeongguk is daunting, especially when things are so fragile between them right now. He can’t bear the thought of potentially driving Jeongguk away for good. </p>\n<p>That Sunday night, the seven of them pile into the rec room to watch a movie together. It’s become something of a tradition on the Sundays when they’re not working late and don’t have to be up too early the following morning. They spread out around the room, Seokjin and Namjoon sprawled across the couch, Hoseok stretched out on the floor, Yoongi and Jimin folded up in one of the big arm chairs. Taehyung ends up accidentally on purpose sitting next to Jeongguk, and he curls into his side, resting his head on Jeongguk’s shoulder. This is always his favorite place to be when they watch movies. </p>\n<p>The movie is scary, and he spends the first half of it hiding in Jeongguk’s shoulder, gripping his hand like a vise. He’s too freaked out to think too much about whether he’s pushing it by being so close to Jeongguk, until they pause the movie so that Yoongi can make popcorn, and suddenly he becomes very aware of the fact that they’re holding hands. He chances a sideways glance at Jeongguk and finds him with wide eyes, staring hard at the place where their interwoven fingers rest on his thigh.</p>\n<p>Yoongi walks back into the room, bowl of popcorn in his arms, and his gaze falls on Taehyung and Jeongguk. “Does this mean you two finally sorted your shit out?” he asks, looking pointedly at their hands.</p>\n<p>The room is suddenly very quiet, all eyes on Taehyung and Jeongguk. Jeongguk’s cheeks stain pink, and he unlinks his fingers from Taehyung’s, curling in on himself. “I, umm,” he mutters, avoiding everyone’s gaze, including Taehyung’s. “Sorry, I don’t feel well.” He pushes himself up off the couch and vanishes into the hallway, his head ducked low.</p>\n<p>Jimin kicks Yoongi in the shin as soon Jeongguk leaves. </p>\n<p>“Ow!” he yelps. </p>\n<p>“What the hell,” Jimin hisses.</p>\n<p>Yoongi looks disgruntled, rubbing his shin and glowering at Jimin. “Sorry, I thought -” he turns to Taehyung. “Sorry, Tae.”</p>\n<p>Everyone looks to Taehyung again, but he’s too busy staring at the doorway that Jeongguk had left through to really notice. His side feels disappointingly cool where Jeongguk had been pressed up against him just a few minutes before.</p>\n<p>“Taehyung-ah,” Namjoon says sharply, and Taehyung whips his head around, surveying the faces of the boys around him. They’re all watching him expectantly, and his throat goes dry.</p>\n<p>“What,” he says robotically.</p>\n<p>Hoseok looks like he’s about to slap him. </p>\n<p>“Go after him, you ass,” Jimin cries, exasperated. He’s managed to spread himself out over the whole chair so that Yoongi no longer has a place to sit down. </p>\n<p>“Right,” Taehyung says, leaping up from the couch. His heart is racing as he runs down the hallway, sliding into his own room briefly to grab something important before coming to a halt at Jeongguk’s door. He pushes it open tentatively, not bothering to knock.</p>\n<p>Jeongguk is sitting cross-legged on his bed, his face in his hands. He looks so small and hunched that Taehyung wants to cry. “I’m <em>fine</em>, Jimin,” he says when the door opens, sounding decidedly not fine.</p>\n<p>“It’s me,” Taehyung says softly, shutting the door behind him, and Jeongguk’s head snaps up. His eyes are rimmed with a hint of red, like he’s been fighting back tears, and Taehyung wants to fling himself across the room and wrap Jeongguk in his arms. </p>\n<p>“Oh,” Jeongguk says, composing himself and blinking rapidly. “Sorry.” </p>\n<p>Taehyung hovers by the door, unsure of what to do with himself. “Jeongguk,” he begins, forcing himself to speak. “I, umm. I owe you a conversation, I think.”</p>\n<p>“You don’t have to let me down easy, Tae,” Jeongguk says hoarsely. He looks utterly miserable. “It’s fine.”</p>\n<p>“No, that’s not -” Taehyung shakes his head vehemently, taking one step into the middle of the room. “I’m sorry I’ve been kind of MIA these past few weeks. I just needed some time, after everything that happened, to clear my head, I guess. I didn’t think it would be fair to talk to you before that.”</p>\n<p>Jeongguk just stares at him, his face unreadable, his arms crossed protectively over his chest.</p>\n<p>Taehyung clears his throat, soldiering on. “I wasn’t totally honest with you, about the fortune,” he explains, pulling the slip of paper he had grabbed from his room out of his pocket. “I want you to read it.”</p>\n<p>He moves closer, extending his arm, and Jeongguk takes the fortune wordlessly, blinking down at it. </p>\n<p>“Where there is love, there is warmth,” He reads aloud, and his voice catches. “Love?” he whispers, looking up at Taehyung with round eyes. </p>\n<p>Taehyung nods, shrugging helplessly. “Looks like it.”</p>\n<p>“I don’t understand,” Jeongguk says, his voice colored with disbelief.</p>\n<p>“I have feelings for you,” Taehyung replies, forcing himself to maintain eye contact even as his face flames. “Like, big ones. The reason I got better - it’s because I finally admitted it to myself.”</p>\n<p>He drops down on the bed next to Jeongguk, taking his hand. Jeongguk looks from Taehyung to their joined hands and back up again, his expression stunned.</p>\n<p>“Tae,” he says pleadingly, tugging his hand away. “Tae, please, I can’t -”</p>\n<p>Taehyung feels like he’s been slapped. “You don’t have to want me back,” he murmurs. “I just - wanted to be honest with you.”</p>\n<p>“You think I don’t want you back,” Jeongguk says flatly, shaking his head in disbelief. “I’ve wanted you back for five fucking years, Tae.”</p>\n<p>Taehyung gapes at him, something exploding in the region of his heart.</p>\n<p>“I just, are you sure?” Jeongguk asks, twisting his hands in his lap. “Like, are you really fucking sure? Because I can’t do this unless you are, Taehyung. I can’t get my hopes up again, I won’t survive it.” His eyes are wild, desperate as they search Taehyung’s face.</p>\n<p>“Of course I’m sure,” Taehyung says softly. “How could I - it’s you.”</p>\n<p>“But you weren’t - you didn’t, before,” Jeongguk protests weakly. Five years is a long fucking time, Taehyung realizes. It’s a long time to harbor feelings you think are unreciprocated.</p>\n<p>“Everybody wants you, Jeongguk,” he says helplessly. It sounds like a stupid excuse, but it’s true. “You’re - Jesus, come on. I didn’t think I stood a chance.”</p>\n<p>“Says the most handsome face of 2017,” Jeongguk snorts.</p>\n<p>“Listen to me,” Taehyung says fiercely, grabbing his hands again. “I can’t stop thinking about you. I could keep it in check, before, but now that I know what it’s like to have you - I can’t, I’m a lost cause.”</p>\n<p>“Hyung,” Jeongguk breathes, shaking his head. </p>\n<p>Now that he’s started, Taehyung can’t seem to stop. The words spill out of his mouth unbidden, everything he’s been wanting to say for so long. “I want to kiss you, and I want to touch you, not because my body needs it, but because I fucking <em>want</em> it, I want you more than anything.” </p>\n<p>Jeongguk shudders, watching him with wide, wet eyes.</p>\n<p>“Jeongguk-ah,” Taehyung pleads, his voice gentler now. “Do you want to be with me?”</p>\n<p>It feels like time stands still while he waits for Jeongguk’s answer.</p>\n<p>“Yes,” Jeongguk whispers. The word comes out like the exhale of a long-held breath. </p>\n<p>“So be with me.”</p>\n<p>There’s a pause, and then Jeongguk nods. </p>\n<p>“Okay.”</p>\n<p>Taehyung’s heart soars, smiling so wide he feels like his face might split in two. Jeongguk bites his lip, the corners of his mouth tugging upwards, and Taehyung can’t help himself - he takes Jeongguk’s face in his hands and kisses him senseless, until his smile lights up his entire face and they’re both gasping for air.</p>\n<p>When they finally break apart, breathless, Taehyung rests his forehead against Jeongguk’s, gripping the back of his head. Jeongguk is giggling almost uncontrollably, little half-laughs slipping from his mouth.</p>\n<p>“What?” Taehyung says, amused.</p>\n<p>“Nothing,” Jeongguk says, shaking his head. “I just am really happy.”</p>\n<p>“Me too,” Taehyung breathes, his heart swelling as he crushes their lips together again. He just wants to be touching Jeongguk always, everywhere, for the rest of his life. </p>\n<p>In pursuit of this noble goal, he crawls into Jeongguk’s lap, straddling his hips as they continue to kiss. Jeongguk groans, immediately slipping his hands up and under Taehyung’s shirt, fitting them around his waist.</p>\n<p>“Take it off,” Taehyung urges him, lifting his arms up over his head so Jeongguk can rid him of his shirt. Jeongguk is back on him in an instant, hands skimming over the newly exposed skin as he sucks a mark into Taehyung’s collarbone. Taehyung wants to give him everything.</p>\n<p>With one hand wrapped securely around Taehyung’s waist, Jeongguk tips them backwards on to the bed, pulling away briefly to tug off his own shirt. Taehyung watches appreciatively as his chest comes into view, the muscles in his arms tensing as he tosses his shirt aside. His heart is racing, his mind fuzzy with desire, because he knows what he wants, now that Jeongguk is his.</p>\n<p>He reaches for Jeongguk, grabbing at the empty air between them, and Jeongguk comes willingly, stretching out over him. It feels like he’s everywhere - mouthing along Taehyung’s jaw, his neck, his bicep. One of his hands finds Taehyung’s, lying beside his head on the pillow, and links their fingers together. His hips press Taehyung down into the mattress, hot and insistent, the feeling of Jeongguk’s erection against his own making Taehyung see stars.</p>\n<p>“Fuck, Tae, I want you so badly,” Jeongguk whimpers when Taehyung pulls him in for another kiss. The words make Taehyung’s head spin, and Jeongguk’s eyes are darker than he’s ever seen them when Taehyung pushes the hair back from his forehead.</p>\n<p>“You have me,” Taehyung murmurs, and Jeongguk surges forward again, kissing him harder.</p>\n<p>“What do you want,” Jeongguk says hoarsely, tipping his forehead against Taehyung’s. “I’ll give you anything.”</p>\n<p>It’s the hottest fucking thing he’s ever heard, and Taehyung whines, fingers tugging at Jeongguk’s hair. His heart is beating so hard he feels like it might explode out of his chest at any given moment. </p>\n<p>“I want you to fuck me,” he breathes, making sure to meet Jeongguk’s gaze when he says it. </p>\n<p>Jeongguk chokes, his eyes fluttering shut. “Fuck.”</p>\n<p>“Please,” Taehyung adds as an afterthought, and Jeongguk gasps out a disbelieving laugh. “Jeon Jeongguk,” he continues. “Would you please, kindly, fuck my brains out -”</p>\n<p>“Oh my god, shut up,” Jeongguk groans, cutting him off with a kiss, and Taehyung laughs against his mouth. “But yes, I will, fuck.”</p>\n<p>“Do you have stuff?” Taehyung asks, his stomach twisting with anticipation, and Jeongguk nods, blushing hard. He nearly falls over himself scrambling off the bed and over to his dresser, and if Taehyung weren’t so beside himself right now he might have teased him for it.</p>\n<p>As it is, he settles for shimmying out of his pants and boxers, so that when Jeongguk turns back to him, he’s lying naked on the bed, trying to look sexy and confident rather than embarrassed and nervous. Jeongguk promptly drops the lube and condom that he’s holding, which makes Taehyung burst out laughing and does a bit to assuage his nerves.</p>\n<p>Jeongguk swears, ducking down to scoop them up, his face bright red when he pops back up. </p>\n<p>“It’s okay, you’re still sexy as hell, c’mere,” Taehyung says, reaching out for him, and Jeongguk comes, tossing the lube and condom on the bed so that he can kick off his own pants. </p>\n<p>Then they’re both naked, and Jeongguk is sitting back on his heels before him, propping Taehyung’s legs up. He presses a kiss to the inside of Taehyung’s knee, and Taehyung wishes he was closer so that he could touch him. Jeongguk’s hands are shaking as he squeezes the lube into his palm, his eyes wide when he grazes a finger over Taehyung’s hole, pressing in tentatively.</p>\n<p>Taehyung yelps, squirming, and Jeongguk’s eyes snap up to him, mortified.</p>\n<p>“S’okay,” Taehyung says soothingly before Jeongguk can start freaking out. “Keep going. Please.”</p>\n<p>So he does, fingering Taehyung open carefully, and Taehyung does his best to keep his eyes open so that he can watch him. The stretch of each additional finger makes Taehyung shudder, his body taut and strung out when Jeongguk leans forward to kiss him. His breathing is ragged against Taehyung’s lips, the kisses uneven and sloppy, but Taehyung gets it - Jeongguk is three fingers deep by now, and he suspects they’re both wondering what it’ll feel like when they’re replaced with his cock.</p>\n<p>“Jeongguk,” Taehyung grits out when he doesn’t think he can take it any longer. His body is coiled so tightly he feels like he’s about to snap. </p>\n<p>Jeongguk pulls back to look at him, eyes widening when he sees the expression on Taehyung’s face. “Yeah?” he asks, breathless. Taehyung nods fervently, and Jeongguk ducks down, kissing him again and again. </p>\n<p>“<em>Jeongguk</em>,” Taehyung whines, wriggling against his fingers.</p>\n<p>“Right, sorry,” Jeongguk says, dropping one last kiss to the corner of Taehyung’s mouth before scrambling up to his knees. </p>\n<p>His hands are trembling so hard that he can’t get the condom wrapper open, and really, Taehyung is so in love with him he can hardly stand it. He sits up, taking the package from Jeongguk (whose gaze flicks up to him gratefully) and tearing it open with his teeth, preening when Jeongguk’s jaw literally drops. </p>\n<p>“Relax,” Taehyung says gently. “I’m not going anywhere.” Jeongguk nods, inhaling deeply, and then hisses when Taehyung rolls the condom over his length. </p>\n<p>Taehyung cries out when Jeongguk presses inside of him, going achingly slowly to allow him time to adjust. He clutches at Jeongguk’s back, finding purchase along the curve of his shoulder blades, and Jeongguk drops his head into the crook of Taehhyung’s neck, breathing harsh.</p>\n<p>“Jesus,” he pants, when he’s fully inside. </p>\n<p>“Move,” Taehyung murmurs into his ear, wrapping his legs around Jeongguk’s waist.</p>\n<p>It’s not the most graceful sex anyone has ever had - it’s their first time together, after all, and there’s a learning curve to these things. Their noses bump together, and it takes some time to find the right rhythm, but it doesn’t matter. It’s them, together, it’s Jeongguk moving over him, inside of him, and that alone has Taehyung’s head spinning. </p>\n<p>He isn’t expecting them to last very long, and he’s right, they don’t. But Jeongguk does manage to wind their fingers together above Taehyung’s head, catching Taehyung’s moans in his mouth as he fucks into him. After a little while, Taehyung doesn’t even bother trying to keep his voice down, because he wants Jeongguk to know exactly how good he makes him feel.</p>\n<p>He comes when Jeongguk gets a hand between them, jerking Taehyung off in time to his thrusts until he spills across their stomachs. Jeongguk follows not long after, with Taehyung’s fingers in his hair, panting breathless encouragements into his ear. </p>\n<p>“Fucking hell,” Jeongguk says, once he’s pulled out of Taehyung as gently as possible and collapsed at his side.</p>\n<p>“Same,” Taehyung agrees, rolling on to his side so that he can nestle against Jeongguk’s chest. He flattens his hand against Jeongguk’s stomach, tracing patterns with his fingers. </p>\n<p>“We need to do that, like, five more times,” Jeongguk says, and Taehyung snorts, propping his chin on Jeongguk’s chest so that he can look up at him.</p>\n<p>“Only five?” he teases, cheeky, and Jeongguk groans.</p>\n<p>“You’re going to kill me,” he grumbles, twisting a finger in Taehyung’s hair.</p>\n<p>“I would never,” Taehyung laughs. “Although death by sex doesn’t sound like the worst way to go.”</p>\n<p>Jeongguk makes a face at him and deliberately messes up his hair, pushing it down into his eyes. It’s something he’s done a million times before over the course of their friendship, and Taehyung’s heart lurches when he thinks about it, how long they’ve been dancing around each other. A part of him wishes they would have figured it out sooner, but he’s also glad they have that foundation to build from. He already knows Jeongguk so well - now he just gets to love him.</p>\n<p>“Jeongguk,” Taehyung says, his hair still hanging in his eyes. “I love you.”</p>\n<p>He hears Jeongguk’s sharp inhale, and then he’s rushing to push Taehyung’s hair back, so that Taehyung can see the radiant smile on his face.</p>\n<p>“I love you too,” he breathes, like he can’t believe he’s actually saying it out loud.</p>\n<p>Taehyung has never been so grateful for a stupid fortune cookie.</p>\n<p>***</p>\n<p>When all is said and done, they don’t end up leaving Jeongguk’s room until well into the following morning. They stay up late into the night, talking and laughing just like they always would have, except now Jeongguk can roll over and kiss Taehyung whenever he wants to, now he can say “I love you” and hear it said back to him. They also have sex again, and then again, and when Jeongguk wakes up the following morning to Taehyung’s mouth wrapped around his cock, he thinks he may have actually died and gone to heaven.</p>\n<p>So, really, he can’t even blame the boys when they walk into the kitchen hand in hand and are met with a wall of whoops and catcalls. </p>\n<p>“Jesus Christ, have you two just been fucking for the past 14 hours?” Namjoon asks, looking pointedly at Taehyung, who between his puffy pink lips and flushed cheeks looks positively debauched. Jeongguk feels a rush of smug, giddy pride and can’t even manage to suppress his smile.</p>\n<p>“Only for like, 12 of them,” Taehyung says casually, and Jeongguk gags on his own spit.</p>\n<p>“God help us all,” Hoseok mutters, at the same time Seokjin says, “It’s about time.”</p>\n<p>Yoongi clears his throat, shuffling over to them. “I’m sorry about last night,” he says. “Although it looks like it worked out for you two, so maybe I’m not sorry.”</p>\n<p>“Don’t worry about it, hyung,” Jeongguk replies, smiling when Taehyung squeezes his hand.</p>\n<p>Jimin shoves Yoongi out of the way and flings himself at them, hooking one arm around each of their necks. Jeongguk is pretty sure his eyes are glistening.</p>\n<p>“God, you absolute shits,” he mutters, but his voice is warm. “Took you long enough.” </p>\n<p>“Sorry, Jiminie,” Taehyung laughs, as Jeongguk pats him on the back. </p>\n<p>And then... things pretty much just go back to normal. They can’t be fully public about it yet, but that’s probably for the best anyway, to maintain some semblance of privacy. Half the fans ship them together anyway, and it’s not like they can’t be affectionate with each other in public. Just no actual making out, and no blatantly obvious hickeys (which poses a bit of a challenge, but they get creative).</p>\n<p>In a lot of ways, things are exactly the same. The other members are no different around them, aside from the occasional wretching when they catch them being particularly lovey dovey, and Seokjin’s vague obsession with taking couple’s photos of them. They still stay up late playing Overwatch, they goof around during rehearsals and photo shoots, and Taehyung continues to make sculptures out of Jeongguk’s hair when there’s a lot of product in it. They’re still best friends, which Jeongguk is exceptionally grateful for. </p>\n<p>In other ways, everything is different. He gets to share a bed with Taehyung every night, fall asleep to the sound of his breathing and wake up to him burrowed into his side. He gets to hold Taehyung’s hand whenever he feels like it, just because he wants to, and not worry about whether it’ll seem weird or too obvious. He gets to fuck him, in every way he had ever fantasized about and a lot more than that also, because they do have 5 years of time to make up for, after all. And he gets to love him, freely, openly, and without heartache or shame, and know that he’s loved in return. That part is his favorite. </p>\n<p>There’s a night, maybe a month after they officially get together, when Jeongguk goes out to dinner with Jimin and Seokjin. Taehyung and the others stay behind, either not hungry or too tired from the day’s work. The three of them get a little buzzed on soju, and end up in a snowball fight on their way home, which culminates in Seokjin pushing Jeongguk into a snow bank. All in all, by the time he gets back to the dorm, he’s drenched, covered in snow and dripping freezing water. </p>\n<p>He discards his shoes and jacket by the front door and wanders to Taehyung’s room without really thinking about it. He finds him curled up on his bed, messing around on his phone, but he looks up with a soft, sleepy smile when he sees Jeongguk.</p>\n<p>“Hi,” he says, putting his phone down and drinking Jeongguk in. “How was - oh my god, you’re soaked.”</p>\n<p>Jeongguk looks down at himself - he supposes his pants are still kind of wet from the snow. A drop of melting snow slips from his hair and lands on his cheek, making him wince.</p>\n<p>“Seokjin hyung pushed me into a snow bank,” he explains, shrugging. Taehyung raises his eyebrows. “Don’t worry, I got my revenge.”</p>\n<p>“I am worried, because you’re going to get a cold,” Taehyung tuts, rolling off the bed to grab a towel from his closet. “Take off your pants.”</p>\n<p>Jeongguk quirks a suggestive eyebrow at him, grinning cheesily. </p>\n<p>“Before you freeze to death, you loser,” Taehyung says, rolling his eyes. “Your dick is probably the size of a peanut right now.”</p>\n<p>Jeongguk gapes at him in mock horror. “I think we both know that’s not possible, Tae.”</p>\n<p>Taehyung snorts, but Jeongguk swears his ears go a little pink. “Well, at least the size of your ego isn’t in question,” he says, holding out the towel. “Come here.”</p>\n<p>Grinning to himself, Jeongguk kicks off his pants and goes to sit beside Taehyung on his bed, sighing happily when Taehyung starts massaging his head with the towel.</p>\n<p>“Jeez, did you burrow a tunnel through that snow bank?” Taehyung teases, patting at Jeongguk’s forehead before setting the towel aside. “You’re so cold,” he says with a frown.</p>\n<p>“Can think of one way to get warm,” Jeongguk hums, tugging Taehyung into his lap. He comes easily, straddling his thighs and looping his arms loosely around Jeongguk’s neck. </p>\n<p>“Oh yeah?” Taehyung says playfully. “What’s that?”</p>\n<p>“Worked like a charm when you were the cold one,” Jeongguk murmurs, sliding his hands under Taehyung’s shirt and up his back. </p>\n<p>Taehyung shivers a little, smiling. “Your hands are cold.”</p>\n<p>“Guess you’ll just have to warm me up then,” Jeongguk says, kissing his neck.</p>\n<p>Taehyung sighs contentedly. “I think I’m up to the challenge.”</p>\n<p>***</p>\n<p>On one of the first truly hot days of the summer, they have an outdoor photo shoot, because of course. They’re posing on a rooftop somewhere in Seoul, and the air is thick and sticky, the sun utterly unforgiving. It’s a long day, and by the time they trudge back into the dorms, they’re all grumpy, sweaty, and exhausted.</p>\n<p>There’s a wild clamor to see who will get to shower first, but Taehyung pulls away from the fray, recognizing a losing battle when he sees one. He grabs Jeongguk’s wrist and tugs him along with him, effectively banishing his reluctance when he murmurs:</p>\n<p>“If we go later, we can shower together.”</p>\n<p>Jeongguk comes willingly after that. </p>\n<p>They end up in the kitchen, and Taehyung roots around in the freezer until he finds what he’d been looking for. </p>\n<p>“Have I mentioned lately that I love you,” Jeongguk says when he straightens up holding a box of fruit-flavored popsicles. </p>\n<p>“Feel free to tell me again and again,” Taehyung grins, tossing Jeongguk a blue raspberry before tearing open the package of a cherry flavor.</p>\n<p>The popsicle is deliciously sweet and cold on his tongue, the perfect refreshment after such a hot, disgusting day. He makes a bit of a show of moaning while he eats it, dragging his tongue lasciviously along the side while Jeongguk glowers at him with increasingly dark eyes. </p>\n<p>“Can you not,” Jeongguk huffs, when Taehyung hollows out his cheeks and lets out a particularly filthy noise.</p>\n<p>Taehyung beams at him cheekily, finishing off his popsicle and dropping the stick in the trash. “Be nice and maybe I’ll do that to you in the shower later.” </p>\n<p>Jeongguk quite literally growls at him, and Taehyung lives for this, that they’ve been having sex for five whole months and he can still so easily get Jeongguk to react to him this way. It’s the biggest ego boost in the world, not to mention really fucking hot.</p>\n<p>“I hate you,” Jeongguk grumbles, but it’s hard to take him seriously when his mouth is stained blue from the popsicle.</p>\n<p>“You just said you love me,” Taehyung points out, sidling up to him with a shit-eating grin. Jeongguk rolls his eyes, but Taehyung ignores him, opting instead to cup his cheeks and kiss him. His lips are cool and taste of blue raspberry.</p>\n<p>“What was that for?” Jeongguk asks.</p>\n<p>Taehyung smiles at him fondly, linking their fingers together.</p>\n<p>“Your lips were blue.”</p>\n<p>***</p>\n<p>FIN</p>"
}