{
  "id": "1385362",
  "url": "https://archiveofourown.org/works/1385362?view_full_work=true",
  "author": [
    "AWickedMemory (TeddyLaCroix)"
  ],
  "title": "Good to Me (And I'd Be So Good to You)",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Harry Potter - J. K. Rowling"
  ],
  "relationships": [
    "Draco Malfoy/Harry Potter"
  ],
  "characters": [
    "Draco Malfoy",
    "Harry Potter",
    "Hermione Granger"
  ],
  "additional_tags": [
    "Hogwarts Eighth Year",
    "Obsessive Harry",
    "Oblivious Harry",
    "Resigned Draco",
    "Tall Draco"
  ],
  "language": "English",
  "series": "",
  "published": "2014-04-15",
  "completed": null,
  "words": "8,905",
  "chapters": "1/1",
  "comments": "653",
  "kudos": "17,766",
  "bookmarks": "3,604",
  "hits": "255,141",
  "summary": "<p>Everyone returns to Hogwarts after the war, but nothing is quite the same. Harry's groupies are creepier than ever, Ron and Hermione are snogging all over the place, and the once-proud Draco is shuffling around like a kicked puppy. But that's okay: Harry's got a plan.</p>\n<p><b>Art:</b><br><a href=\"https://bafflinghaze.tumblr.com/post/149257875783/\" rel=\"nofollow\">D&amp;H walking through Hogwarts</a> by bafflinghaze (22/02/2017)</p>\n<p> </p>\n<p>\n<b>Translations:</b>\n<br>\n</p>",
  "notes": "<p>You envisioned this as \"cute and fun, fluffy-angst,\" and short, fluffy pieces are normally my thing. But somehow this fic ran away with me? Oh, well. I hope you like it, Kurla!</p>\n<p>ALL MY LOVE to my betas, <a href=\"https://archiveofourown.org/users/Duomi\" rel=\"nofollow\">Duomi</a> and <a href=\"https://archiveofourown.org/users/gonnaplotz\" rel=\"nofollow\">GonnaPlotz</a>. Bless you both for putting up with my incessant whimpering!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p><strong>Mods' Note:</strong> If so inclined, leave a comment here or at <a href=\"http://dracotops-harry.livejournal.com/272794.html\" rel=\"nofollow\">LiveJournal</a>. Comments are ♥.<br><strong>Author's Notes:</strong></p>\n<p>- Title from Marianas Trench’s “Good to You”<br>- The book Draco was reading is Fyodor Dostoyevsky’s <em>Crime and Punishment</em>. He wasn’t embarrassed to be caught reading; he was embarrassed to be caught reading <em>Muggle philosophical literature</em>.<br><strong>Known items from Harry’s Draco Lucius Abraxas Malfoy Repository of Information Collected Whilst Stalking:</strong></p>\n<p>\n<strong>Known items from Draco’s Situational Diagnostics Manual for Harry James Potter:</strong>\n</p>\n<p> <br><strong>Thanks for reading!</strong></p>",
  "text": "<p>\n<strong>Operation MFwDM: Briefing</strong>\n</p>\n<p>There were many things that Harry was known to be good at.</p>\n<p>For one thing, he was made to fly. Between his slight stature and his quick reaction time, he often felt more natural in the skies than on land. He sometimes fancied himself to have been a peregrine falcon in a past life: not terribly impressive in size or appearance, but quick and agile. The skies were his domain.</p>\n<p>For another thing, he’d remained the top student in DADA six years running; this \"eighth\" year looked like it would be no different. When it came to topics he cared about, not even Hermione could beat him. His generally average marks weren’t an indicator of his intelligence, really; they were an indicator of how much he gave a damn about the subject.</p>\n<p>Additionally, he could bring people together in a way normally only done by martyrs and evil dictators, in spite of his easygoing temperament and unintimidating image and tendency to skulk about alone at night (much to Hermione's chagrin, but what else was he supposed to do when she and Ron insisted on such mundane hobbies as <em>sleeping</em>?).</p>\n<p>He didn’t entirely understand how or why, but he walked and people followed.</p>\n<p>Then there were the <em>other</em> things Harry was good at – things people did not know. Or, things that even the ones who knew pretended they didn’t. Things that made Hermione fret uncomfortably even when she knew he was right, things that confused Ron no matter how much he tried to explain, things that had ultimately ended his stint with Ginny very quickly.</p>\n<p>For instance, Harry was very good at obsessing. Very, <em>very</em> good at obsessing. In fact, he considered himself something of an expert in obsession. He could try to laugh it off or dismiss it as dedication, but it went beyond that. He <em>obsessed</em>, and he knew it.</p>\n<p>He’d obsessed over the prophecy of being the one to kill Voldemort. He’d obsessed over Quidditch. He’d obsessed over competing with Malfoy. He’d obsessed over hating Snape. He’d obsessed over stalking Ginny when she was dating other boys and his hormones were kicking in for the first time since that disastrous nonsense with Cho.</p>\n<p>(It might not have been so bad with Ginny had he realised sooner that obsession and romantic affection were two very different things. Then again, he wouldn’t have realised it at all had Ginny not sat him down for a good, long bollocking about the ways in which he was a pretty shite boyfriend. Not wanting to go any further than snogging ranked high on that list, as did his tendency to demand her attention when he wanted it but forgetting about her when he had something else to fixate on. She’d accused him of being gay, and – oh.)</p>\n<p>(<em>Ohhhh.</em>)</p>\n<p>He’d obsessed every time he returned to Hogwarts and something strange and new happened to him. The normal reaction of a small child being stalked through the corridors by whispers in the walls, for instance, would be terror (or at the very least questioning his sanity). The normal course of action would be to report the happenings to a figure of authority.</p>\n<p>Harry was the small child who would go running after the whispers by himself in the dead of night instead of running <em>away</em> from them.</p>\n<p>(<em>Oops.</em>)</p>\n<p>It wasn’t that he was immune to fear, not at all. It was simply that once a concept got into his brain, it looped over and over and over again, as if on repeat. It didn’t always occur to him to report the obsession to others, and even when he did, the responses he got were generally unfavourable (read: Hermione would fret or chide him, Dumbledore would not tell him anything useful, most everyone else would wonder if he was turning into the next Dark Lord). This meant he was generally on his own, obsessing in private until things got far out of hand.</p>\n<p>He still didn’t see this as a bad thing.</p>\n<p>Harry was also very good at manipulating. Much as he’d hated the way the Sorting Hat had waffled on his house when he’d first come to Hogwarts, he could see now exactly why it had considered Slytherin for him: he <em>was</em> driven and ambitious, he <em>was</em> sneaky when he wanted to be, he <em>did</em> take advantage of the fact that he could read people well enough to trick them into doing what he wanted.</p>\n<p>He knew when to go to Hermione for help and when to keep his mouth shut. He knew how to play Ron. He knew how far he could push people before they pushed back.</p>\n<p>He didn’t see this as a bad thing, either. It was all in their best interests, after all.</p>\n<p>In short, what this all boiled down to was that Harry was pretty all right at getting what he wanted, especially when it took obsession and manipulation to get it.</p>\n<p> </p>\n<p>\n<strong>Operation Make Friends with Draco Malfoy</strong>\n</p>\n<p>”Anyone sitting here?”</p>\n<p>Draco Malfoy barely had time to look up before Harry slid into the seat, bookbag dropping to the floor with a heavy <em>thunk</em> as he smiled.</p>\n<p>Malfoy – <em>Draco</em>, Harry amended in his head; if this was going to work, getting on a first name basis would really be the first step – <em>Draco</em> frowned at him in confusion. “What?”</p>\n<p>“Is that a yes?” Smile faltering (just a little) ((he didn’t want to overdo it, after all)), Harry stood halfway up again.</p>\n<p>As he did, some distracted part of him noticed that Mal – <em>Draco</em> seemed longer and lankier than usual. Given their respective levels of elevation, the difference in height was not what Harry would have expected based on past experiences. Judging by the way the cool, collected young man’s legs fidgeted a bit under the table as he tried in vain to get them comfortable, Harry had the feeling he wasn’t used to his own height yet, either.</p>\n<p>Despite no longer wishing Draco ill, Harry was oddly delighted at the little fidget. It was adorably charming to see him put off by something as mundane as a growth spurt.</p>\n<p>Reining his thoughts in as he reminded himself of the mission at hand, he continued in an embarrassed, contrite tone. “Sorry, I didn’t mean to take – ”</p>\n<p>“No,” <em>Draco</em> corrected hastily, shaking his head. “I mean, nobody’s sitting there, but why would you – ”</p>\n<p>“Oh, brilliant!” Harry interrupted, dropping back down again with a pleased smile and busying himself with taking out his class supplies. He pretended not to notice the way the other students stared at him (as if that were anything new). He also pretended not to notice the way Draco leaned away from him warily (which <em>was</em> new, but he couldn’t really blame him).</p>\n<p>He <em>also</em> pretended not to notice that his head only seemed to come up to the blond’s shoulder. Seated directly beside him like this, the growth spurt seemed flat-out ridiculous. Rather than jealous, however, Harry felt tiny next to him – and why was that so pleasing? Strange. He would have to consult with Hermione later – except oh, <em>no</em>, he wouldn’t, and that was precisely why he was sitting here now.</p>\n<p>Two tables over, there was one pair of students too lost in their own world to notice the unusual seating arrangement. Hermione's long hair fell over her face as she ducked, rosy-cheeked and giggling and overall acting far more girly than Harry had never known her to act; beside her, Ron beamed at making her laugh.</p>\n<p>Harry knew this without having to look at them. It was how they’d been spending every waking moment since they’d gotten together. Breakfast? Teasing, giggles, and smiles. Lunch? Teasing, giggles, and smiles. One of them returning from a quick trip to the loo? Teasing, giggles, and smiles.</p>\n<p>He was happy for them, really. They were his best mates, and this had been a long time coming. In fact, he was so happy for them that he was glad to give them space to enjoy their relationship. Lots of space. From across the room. Or possibly in another room altogether so he couldn’t hear or see them forgetting themselves and snogging in front of him.</p>\n<p>Again.</p>\n<p>\"So, how are you?\" he asked Draco cheerfully as though they did this all the time. \"Merlin, but this summer was a mess. It's good to see you back here, though. How's your mum?\"</p>\n<p>Wary look transforming into an irritated scowl, Draco opened his mouth to tell Harry off for being strange when he stopped. His head didn't move, but his eyes darted sideways as if feeling the burn of a thousand (or at least two dozen) glares. Weary look settling back in again, he turned away to twirl his quill around in a nervous fidget, staring down at the blank parchment before him. \"She's well, thank you.\"</p>\n<p>Well, that was… something.</p>\n<p>Harry couldn’t blame him for shutting down, really. Their peers could be a little… disturbing. The same students who glared daggers at Draco had a bothersome tendency to trail Harry through the halls these days. Some degree of creepy adulation was not uncommon; Harry was not the only experienced stalker in the school, and Romilda Vane was by no means the only one to resort to unscrupulous methods over the years whilst trying to pull him. Still, it was getting pretty ridiculous.</p>\n<p>(He’d already “lost” three quills and a textbook since the start of school, and the number of owls he received every morning had tripled. He’d taken to automatically burning any bulky pink envelopes without opening, as they had a disturbingly high rate of containing women’s panties. There were also a pair of socks currently on auction amongst the lower years as the ones he’d worn during the final battle, and the present going rate was twelve galleons and six sickles. The funny part was, they weren’t even his; he’d never owned green socks in his life.) ((The comb that had sold last week for seventeen galleons, on the other hand, <em>had been</em> his; there was now a stronger locking charm on his trunk.))</p>\n<p>In short, their classmates had quite lost their heads and Harry didn’t really want to deal with the general population any more than Draco probably did.</p>\n<p>Before Harry could respond, McGonagall swept in and the class fell silent. Sparing them all only a glance, she began the lesson.</p>\n<p>Harry sighed in a combination of disappointment and relief. The disappointment was because he hadn’t simply been taking the piss or hiding from the deliriously happy couple his friends made; he really <em>had</em> meant to check in on the lone \"eighth year\" Slytherin and try to make friends. Bygones and fresh starts and all that.</p>\n<p>The relief was because fresh starts were still pretty fucking awkward. Especially with someone with whom he shared such a tumultuous past.</p>\n<p>What it really boiled down to was that Harry was just <em>tired</em> of the rivalry. He was 18 and had just finished a long, drawn-out, seven-year war that had been a frustrating combination of Hurry-Up-and-Wait and Oh-My-<em>God</em>-We’re-Going-to-Die. He was tired of constantly watching his back. He was tired of being in a never ending one-up contest. He was tired of matching glare for glare and scathing remark for scathing remark.</p>\n<p>He suspected Draco was as well.</p>\n<p>Since returning to Hogwarts two weeks prior, Draco didn't seem to be talking to anyone. He kept his head down, slipped through side corridors to avoid the crowds, and generally behaved like a kicked puppy. Given his added height, he wasn’t succeeding very well at remaining under the radar, and it only served to make Harry ache in sympathy at the sight. While Harry couldn’t necessarily say he was actively <em>fond</em> of the prat, they had six years of mutual antagonism under their belts, so he liked to think he knew Draco quite well.</p>\n<p>He even had the repository to prove it. This repository was spread across old homework assignments, napkins, books, the inside edge of one of his pillowcases, and all over his brain.</p>\n<p>Fact #14: Draco Malfoy was a people person. While he worked independently in terms of… well, <em>work</em>, he was otherwise always surrounded by people. He thrived on attention.</p>\n<p>Fact #9: Draco Malfoy was a loud person. He had the sort of voice that could cut across the Great Hall, and had he been less of a prat, he could have made a pretty decent leader. He was good at projecting, and even better at bossing people around.</p>\n<p>Fact #429: Draco Malfoy was a positive person. That was strange to think about, but Harry really couldn’t recall seeing him ever act depressed (well, except for that beastly ordeal in sixth year, understandably). With his cockiness and house popularity came an automatic assumption that he was always right and things would always go well for him.</p>\n<p>But now he was alone, silent, and subdued.</p>\n<p>And now, Harry’s Draco Lucius Abraxas Malfoy Repository of Information Collected Whilst Stalking (DLAMRoICWS) was facing a glaring discrepancy between the contents of that repository and the young man beside him and blaring a code red.</p>\n<p>(Amongst the things Harry <em>wasn’t</em> good at – a list which included being an adequate boyfriend, as Ginny could attest to – was letting things go.)</p>\n<p>((He could already feel the obsession settling in again.))</p>\n<p>He also thought they could really use each other at this point. Draco really needed to get out more and have a friend, and Harry needed someone who simply Got It. Got the war, got the desire to hide from the well-meaning crowds, got the fact that he was more a boy than a hero and didn’t give a damn about his fame. Got, even, that Hermione and Ron were a bit much, and going from a trio to one was not a pleasant experience.</p>\n<p>(Obviously, their circumstances were quite a bit different in the details, and it wasn’t something Harry would be bringing up.)</p>\n<p>((He wondered if Draco was still in touch with Goyle or Zabini or Nott. Merlin, was he even still in touch with <em>Parkinson</em>?))</p>\n<p>Even if their mutual understanding had come about through years of hostility, it was still there now – and hopefully the antagonism wouldn’t be.</p>\n<p>None of these thoughts were new.</p>\n<p>Well, they were new in the grand scheme of things, perhaps, but he’d thought them through all summer as he read article after article on how the Malfoys were faring after the war. Taking in the quiet comments from the young heir and how resigned he looked in his photos, Harry <s>obsessed</s> observed from a distance, quietly considering his options and what the best course of action would be. He’d hoped Draco would get better once school began and he was surrounded by familiar peers, but even as he hoped, Harry knew better.</p>\n<p>And thus, Operation Make Friends with Draco Malfoy was born.</p>\n<p>//</p>\n<p>At dinner, Harry begged off on joining his friends in the Great Hall. Citing a headache, he headed off in the general direction of the hospital wing until Hermione and Ron vanished – then changed course and went to the kitchens. There, he chatted with the house elves a bit, confiscated Winky’s butterbeer, and politely asked for a sandwich and maybe some pumpkin juice to take outside.</p>\n<p>The picnic basket they gave him had him leaning heavily to one side to compensate for its weight. Oh, well – he certainly wasn’t one to turn down free food.</p>\n<p>It took about fifteen minutes to find Draco, and most of that time was spent resting and shaking out his arm. Running, camping, and hiding didn’t give him quite the same workout Quidditch had, and he was suffering for it now. By the time he made it to the greenhouse where the blond had taken to spending several evenings a week, he was sweating slightly.</p>\n<p>It was possible that Hermione’s bag with its Extension Charm had spoiled him just a bit.</p>\n<p>“Lovely night for a picnic,” he remarked as he dropped the basket onto the bench beside the lone Slytherin, smiling apologetically when he jumped. “Sorry about that. I thought you’d heard me come in.”</p>\n<p>Draco gave him the puzzled, wary frown again. “People come and go. I didn’t expect anyone to approach me, much less <em>you</em>.”</p>\n<p>It wasn’t much, but Harry could hear just a little of the old Draco Malfoy sneer. In another life, with another set of priorities, the tone would have grated at his nerves; now, however, he was simply relieved. Maybe he wasn’t too far gone.</p>\n<p>“Well, I didn’t exactly expect you, either,” Harry lied cheerfully, settling on the bench with the basket between them. “But there you are, and here I am, and the elves were a bit over-eager in packing. Help a bloke out?”</p>\n<p>Draco narrowed his eyes. “If you’re trying to poison me, there are more elegant ways to do it than some ridiculous picnic scheme.”</p>\n<p>“I’d probably end up blessing you instead, or poisoning myself on the fumes,” Harry retorted with a snort. (Fact #108: Draco Malfoy loved it when Harry was bad at something.) “You know how I am at brewing. Go on, then – I nearly tore my arm off carrying this thing. We may as well enjoy it.”</p>\n<p>Draco’s suspicion didn’t lessen, but when he opened his mouth he simply shut it again without protest. A look of exhaustion flashed across his face, and he turned away with a sigh. “Why are you even out here? Shouldn’t you be celebrating with your minions?”</p>\n<p>“They’re not minions,” Harry responded with an eyeroll.</p>\n<p>Draco snorted in response. Harry smiled.</p>\n<p>Pulling out a sandwich and fussing with the wrapping, he continued. “Well, not most of them, anyway. I suppose a few of them have been acting a bit minionly, but I’m hoping it’ll pass in a few weeks if I ignore it. It’s pretty awkward to go to brush my teeth and have Seamus hand me my toothbrush, or come back to Neville fluffing my pillow.”</p>\n<p>The look Draco gave him clearly said he thought Harry was exaggerating.</p>\n<p>(If only.)</p>\n<p>They settled into a silence disrupted only by the sounds of Harry chewing and a choir of crickats chirping outside. (They were sounding better this week, Harry mused. Two had missed practise the last time he was out here, but now they were mewing almost in sync.)</p>\n<p>After a few minutes, Draco sighed and reached into the basket. “That wasn’t a very smooth deflection, Potter,” he drawled, picking at the contents before pulling out a bowl of steak and kidney pie.</p>\n<p>“Wasn’t it?” Harry asked unhelpfully, smiling as he watched Draco conjure a fork as if it were second nature. “Maybe I just wanted fresh air.”</p>\n<p>Draco paused in his bite to give him a Look. “We’re inside a greenhouse.”</p>\n<p>“So I got the fresh air on the way to the greenhouse, and am ready to be indoors again.”</p>\n<p>Dropping his fork into his bowl and setting both on the bench, Draco stood to leave. Harry hastily reached out to grab his sleeve, grabbing it again when he got promptly shaken off. “Hey, wait – I’m sorry?”</p>\n<p>“What exactly are you trying to do?” Draco demanded. “Why are you sitting next to me, why are you calling me by name, why are you <em>out here</em>?”</p>\n<p>Squishing down the little cheer of triumph in his throat at the familiarly imperious tone, Harry gave him a sheepish smile. “It’s not anything to do with you, really,” he replied. “I just… it’s all noise in there. Too many people, too much staring. Hermione and Ron have been all over each other since the summer – ”</p>\n<p>Draco graced him with a constipated look at that mental image.</p>\n<p>“ – and I can’t get any privacy anywhere else, not even my room. You’re...” Hesitating just long enough to express vulnerability (Fact #23: Draco Malfoy was drawn to weakness like a shark to blood) but not long enough to increase his irritation, Harry shrugged. “You don’t care. You don’t really care about me, and the students who came back don’t really care about you. And we’ve never really been about the war, have we – the two of us? So it’s quiet here.”</p>\n<p>This part was a gamble. There was nothing in his DLAMRoICWS that said Draco was a sympathetic person (well, except for Fact #243: Draco Malfoy didn’t have the stomach for true violence – see exception 14B, The Nose Incident). Harry was relying partially on Draco’s attraction to vulnerability and partially (largely) on his recent reticence to obtain his passive compliance.</p>\n<p>Draco scrutinised him.</p>\n<p>Never one to be intimidated by scrutiny, Harry stared back.</p>\n<p>The crickats purred.</p>\n<p>Draco sighed and sat back down. “Just stop babbling at me. You sound like an idiot,” he grumbled, picking up his pie again and biting into it crabbily.</p>\n<p>Harry grinned.</p>\n<p>//</p>\n<p>In the end, Harry decided he could definitely consider the picnic a success. They admittedly hadn't made much headway in terms of positive communication (and in fact, stopped speaking almost entirely for the rest of the evening), but he thought they’d come to an adequate understanding. Plus, they'd successfully had dinner together (+suspicion) (-aggression) and it was only stage one of his project implementation.</p>\n<p>Operation Make Friends with Draco Malfoy had officially begun.</p>\n<p>//</p>\n<p>The next time he approached Draco was in the blond's territory. He knew that Draco haunted the library fairly often these days, sticking to unpopular areas like Wizarding History, but today he was surprised to locate him in the culinary section. Well, he could work with that.</p>\n<p>\"Hey, Draco,\" he greeted after stepping into the aisle and affecting a look of surprise at spotting him seated at a table midway down. \"Taking up a new hobby?\"</p>\n<p>Sitting up straight from where he was uncharacteristically hunched over, Draco frowned at him at the name, then frowned more deeply at the question. “A hob– what?”</p>\n<p>Harry gestured at the shelf just above his head. Draco followed the movement until his eyes took in the spines of the books around him: <em>Making Magic in Your Kitchen</em>, <em>Puree Your Pain Away</em>, <em>Bubble, Bubble, Toil and Trouble: Cooking for Beginners</em>, <em>Peter Piper’s Peck of Peculiarly Potente Pickled Peppers</em>, and <em>Fabulous French Fricassee</em>.</p>\n<p>Harry took the opportunity of his distraction to sneak a glimpse of the spine of the book that was actually occupying the blond’s attention. He didn’t recognise it, but that wasn’t very surprising; he wasn’t much of a reader unless it pertained to one of his obsessions. What <em>was</em> surprising was how not-magical it sounded. Draco had always been particularly vocal about his disinterest in topics not pertaining to magic, money, or Quidditch. “What’s that, a law text? Are you planning to join the Ministry?” he asked curiously.</p>\n<p>Looking back over at Harry, Draco frowned for a moment before suddenly looking embarrassed. He shut his book hurriedly and slid it off the table to be hidden on his lap. “Of course not,” he replied with a scowl. “It’s a novel.”</p>\n<p>Aha! Harry added this to the DLAMRoICWS as Fact #478. “I didn’t know you liked to read!” he exclaimed cheerfully, flinching when one of the books to his right hushed him. Shooting it an apologetic look, he quickly settled down into the seat across from Draco’s. “Tell me about it?” (Fact #299: Draco Malfoy liked showing off his knowledge.)</p>\n<p>“No,” came the automatic response. “Find your own copy.”</p>\n<p>“How do I know I’ll want to read it if I don’t know what it’s about?” Harry reasoned. Leaning over the table, he made a playful grab for the book and only noticed that he was essentially swiping at the Slytherin’s lap when Draco jerked back, pink-cheeked and indignant at the invasion of space. “Come on, tell me about it! It can’t be that boring if you’re reading it in your free time.”</p>\n<p>Swatting at Harry’s hands, the blond scowled. “It wouldn’t interest you.”</p>\n<p>“How do you know that?”</p>\n<p>“Because I kn– ” Cutting himself off from what Harry strongly suspected was an incriminatingly familiar <em>know you</em>, Draco shot him a distinctly disgruntled look. “Because I don’t think mad, self-destructive, Russian murderers are really your type, even if you may share a sometimes similar sense of self-righteous arrogance.”</p>\n<p>Not having expected such a heavy subject matter, Harry blinked. “Merlin. Are you <em>sure</em> you’re not meant to be friends with ‘Mione? Because really, both your ideas of recreational reading are a little… intense.” He made another grab for the book nonetheless and laughed when Draco lifted it just long enough to smack the side of his head with it.</p>\n<p>“What are <em>you</em> doing here?” Draco demanded as he swung the book out of reach again. “It’s not as though there’s anywhere for you to cook at Hogwarts.”</p>\n<p>Harry ignored the victory cheers going off in his head to settle back in his seat with affected resignation. Rubbing his head where he’d been hit, he slipped a random book off the shelves to flip through idly. “Ah, no. I mean, I know the basics of how to cook in a Muggle kitchen, but it’s not something I’d call a hobby. I was just…” Letting his voice trail off for a moment, he glanced up (and up, and <em>up</em>) at Draco before returning his gaze to the book cover and shrugging. “I was looking for somewhere to hide for a bit.”</p>\n<p>“Doesn’t nattering at me defeat the purpose of hiding?”</p>\n<p>Harry grinned. “Maybe, but it’s still more fun.” Ignoring the look Draco gave him – this one more along the lines of <em>Are you brain-damaged?</em> – he shrugged. “I can deal with maybe one or two people I actually personally know. But Ron and Hermione are busy, so…”</p>\n<p>“Forgive me for not actually <em>caring</em>.”</p>\n<p>Harry’s grin returned. “I’m not asking you to care. I told you – it’s a relief. It’s pretty liberating.”</p>\n<p>The book hushed him again.</p>\n<p>Draco rolled his eyes. “You also said you appreciated the quiet, but you’re certainly not living up to the claim.”</p>\n<p>Lowering his book, Harry leaned over it to stare at Draco seriously. “If I shut up while we’re in the library, will you <em>please</em> just accept my words at face value? If I say I don’t expect you to care, I don’t expect you to care. Only I don’t want kids I barely know coming up to me when I’m alone and making awkward small talk. And I don’t think you really want kids <em>you</em> barely know standing close to you and making passive-aggressive comments, either.”</p>\n<p>(Because maybe he was sort of blind, but he definitely wasn’t <em>deaf</em> – and neither was Draco.)</p>\n<p>((And because fact #313: Draco Malfoy liked bargaining. Whether it was because he was a Slytherin or whether it was because he was his father’s son, he worked well in trading favours, secrets, material possessions, and/or services. Case in point: Crabbe and Goyle had protected him from his enemies, and he’d kept them from flunking out of school and gave them focus for their aggression.))</p>\n<p>Although Draco was clearly wary, he finally relented after staring suspiciously at Harry for a good, long minute.</p>\n<p>Well, “relented” was euphemistic: he seemed to deflate, losing interest in the argument as his shoulders slumped down in resignation. “Fine,” he sighed, opening up his book again. “I don’t entirely believe you, and I don’t know why you’re being so damn persistent about this, but if it keeps you from being such a bother, do as you please. Just do it <em>quietly</em>.”</p>\n<p>A bit worried about the clear weariness in the other boy but relieved nonetheless, Harry nodded, settled back in his chair, and picked up his book again.</p>\n<p>//</p>\n<p>Like the picnic, Harry decided to count this as a success. They remained together for about two hours, Draco stubbornly ignoring Harry and Harry keeping to his promise of quiet company. He could tell when Draco started getting bored and fidgety, but as the blond was too stubborn to start up a chat, Harry pretended not to notice. Eventually, Draco marked his place and shut his novel before getting to his feet to leave (after knocking his knees against the belly of the table and swearing; Harry had to bite his cheek to stifle a smile). A soft “Good night, Draco” earned him a strange look, but as the Slytherin didn’t actually argue or tell him to stop, he decided that was as much permission as any.</p>\n<p>Operation Make Friends with Draco Malfoy was well under way.</p>\n<p>//</p>\n<p>After that, Harry found that it was surprisingly easy to get Draco out and about. Well – not as easy as Ron or Hermione, perhaps, as it still took some wheedling, but he soon found himself no longer worrying about getting rejected or needing to set up picnic schemes.</p>\n<p>That wasn’t to say he didn’t still do some plotting, of course.</p>\n<p>//</p>\n<p>“What in Merlin’s name is around your neck, Potter?” (Because it was still always “Potter” from Draco.)</p>\n<p>Harry blinked up (and up, and <em>up</em>) at Draco with perfect innocence. “I’m pretty sure they were called scarves the last I checked.”</p>\n<p>Draco stared disdainfully at his frizzy, orange/puce/mauve-mottled scarf. “And did you kill it yourself?”</p>\n<p>Harry looked down at the ragged ends of his scarf in absent curiosity and tugged at a loose thread. It quickly became apparent that said loose thread was actually one end of the design as it began to unravel. “I dunno. It’s the only one I’ve got besides my house scarf,” he shrugged. “I don’t really know anything about fashion, and Hermione’s been too busy to drag me shopping.”</p>\n<p>“<em>Ugh</em>.”</p>\n<p>The next Hogsmeade weekend found Harry dragging Draco to Scrivenshaft's Quill Shop to restock on parchment and ink for class, “just for a moment, and then we can head back.” Of course, now that they were out <em>anyway</em>, and since Harry was still wearing <em>the scarf</em>, there was no reason for Draco not to force Harry into one of the clothing shops he’d frequented before the war.</p>\n<p>Opening the door, he hesitated in the entryway as if expecting to get kicked out (and indeed, the shopkeeper seemed to consider it as she glared at him warily), but Harry ducking under his arm and tugging on his sleeve until he followed seemed to appease everyone. With the responsibility of his unspoken crime of trespassing relinquished to the Saviour of the Wizarding World, Draco seemed to relax as he steered Harry over to the winter section and tossed a few scarves at him.</p>\n<p>Harry stared bemusedly at the scarves before tentatively placing one around his neck and wrapping it around once. He looked up (and up, and <em>up</em>) at Draco with wide, hopeful, and deceptively guileless eyes and allowed himself a small smile when the blond huffed in exasperation and adjusted it. (Fact #299 again.)</p>\n<p>This process was repeated four more times until Draco decided on two of them. On the way to the counter, Draco directed them to the winter coats as well and made Harry model half a dozen of those, then added a grey woollen one to their purchase pile. Some dragonhide gloves were thrown on top, and then they were off.</p>\n<p>When they left, the shopkeeper’s suspicious stare was for another reason entirely.</p>\n<p>Shopping turned into lunch at the Hog’s Head when Harry’s stomach began growling and even Draco could confess to an appetite. Lunch turned into cauldron cakes from Honeydukes because it wasn’t a meal without something sweet for dessert, and then cauldron cakes turned into drinks because they were a little <em>too</em> sweet. Drinks turned into an argument about the merits of tea versus coffee (Draco, of course, considering the latter utterly plebian whereas Harry swore by it), which turned into staying at a cafe long enough to sample a selection. (Fact #480 became <em>Draco Malfoy favoured tea, particularly hojicha and Earl Grey</em>.)</p>\n<p>By the time they waddled back to the castle, bellies full and Harry bedecked in new winter attire after Draco insisted he couldn’t stand the eyesore of Dudley’s old rags any longer, the proud Slytherin had all but given up the pretense of reluctance.</p>\n<p>//</p>\n<p>After a month and a half of Hogsmeade trips and library visits and impromptu dinners, it only seemed natural for one of them to follow the other home.</p>\n<p>Draco didn’t say anything as Harry trailed after him after class. He continued to not say anything as Harry followed him down to the dungeons. Even as he spoke the password to the Slytherin commons, he didn’t bother to try and conceal it. When he slipped through the door and Harry entered as well, however, he finally gave him another one of those early Looks – as did the other Slytherins seated inside.</p>\n<p>“<em>What’s Potter doing in here?</em>”</p>\n<p>“<em>Is he with </em>Malfoy<em>?</em>”</p>\n<p>“<em>Are they about to fight?</em>”</p>\n<p>“<em>I wonder if Malfoy’s got him Imperiused…</em>”</p>\n<p>“<em>Didn’t you hear? Potter can throw off the Imperius!</em>”</p>\n<p>“<em>Maybe Potter’s got</em> Malfoy <em>Imperiused…</em>”</p>\n<p>“<em>Or maybe they’re</em> – you know!”</p>\n<p>Long accustomed to people whispering around him, Harry ignored them to follow Draco to his room.</p>\n<p>Once they got there, Draco turned at the door to frown at him. “Exactly how far are you planning to follow me?” he asked mildly, although it seemed more exasperated than anything else.</p>\n<p>Grinning, Harry shrugged one shoulder. “What makes you think I have a plan?” he asked.</p>\n<p>“You’ve had a plan of some sort since you started pestering me,” Draco drawled. “You’re not exactly subtle.”</p>\n<p>Actually a little offended this time, Harry was only slightly appeased by Draco letting him into the room. “What? I can be subtle!” he protested indignantly. Stalking after him, he dumped his bookbag on the same bed Draco did. “I can! We had to sneak around all the time last year!”</p>\n<p>“Yes, and you’re excellent at sneaking around the castle, too. But when I can actually <em>see</em> you, you’re not subtle,” Draco shot back as he headed over to a wardrobe – a <em>wardrobe</em>; the Slytherins each had personal <em>wardrobes</em>? – and hung his house robe up. “You get this look in your eye like you’re up to something, and the corner of your mouth twitches like you’re trying not to smile.”</p>\n<p>Alarmed by that news and more than a little embarrassed (and also a little pleased that Draco had noticed) ((or maybe a <em>lot</em> pleased)), Harry frowned as he removed his robe and handed it over to Draco’s outstretched hand to be hung. “Nobody <em>else</em> notices. Hermione, for one, would have said something.”</p>\n<p>At least his ability to obsess wasn’t being challenged. Still, it rankled that maybe he wasn’t quite as manipulative as he’d thought.</p>\n<p>“She hasn’t had as much reason to look for signs that you’re tricking her, has she?” Draco pointed out as he shut the door and dropped onto his chair (because each Slytherin also had a <em>chair</em> with a personal <em>writing desk</em>, and how was this in any way fair?). “I’ve been trying all month to figure out what you’re after, but I don’t have any social status to offer you anymore and that nonsense about sitting with me so that other people leaving you alone was a thin excuse. Even the people complaining about me have quieted down by now, yet here you are. The only answers I come up with don’t make any <em>sense</em>, like that you – ”</p>\n<p>“Just want to be friends?”</p>\n<p>“ – just want to be friends.” Draco stared at him in disgruntled disbelief.</p>\n<p>Harry smiled brightly back.</p>\n<p>Truth be told, that wasn’t really the whole story – not anymore. If there was anything Harry had figured out while dragging Draco around like a puppet, it was that he apparently liked the blond’s company quite a bit. What had started off as sympathy and goodwill and a desire to make up for their long years of petty rivalry was quickly becoming an actual desire for friendship – </p>\n<p> – and okay, maybe a little bit more.</p>\n<p>But he didn’t exactly want Draco to know <em>that</em>.</p>\n<p>Turning away from him, Draco scowled and pointedly began pulling out his lesson books. “Whatever it is you’re <em>really</em> up to, I <em>will</em> find out,” he warned.</p>\n<p>Merlin’s <em>pants</em>.</p>\n<p>Sighing, Harry dropped onto the Slytherin’s bed. “You do that,” he replied, “and let me know when you do, yeah? So I know what I’m supposedly up to?”</p>\n<p>Draco wordlessly turned a page in his Ancient Runes text.</p>\n<p>Taking the silence as assent – because he wasn’t just being self-serving here; with Draco Malfoy silence really <em>did</em> seem to be assent – Harry smiled to himself and settled in to wait until Draco got bored of studying. He could be patient. He’d out-stubborned him at the library several times.</p>\n<p>And Merlin, but the Slytherins had such comfortable (<em>unfairly</em> comfortable) beds.</p>\n<p>And the pillow smelled quite nice...</p>\n<p>//</p>\n<p>The next thing Harry knew, he was being smothered with another equally nice-smelling pillow.</p>\n<p>Flailing and choking, he managed to twist to his side until the pillow left his face and he could stare up (and up, and <em>up</em>) at Draco with wide, startled eyes.</p>\n<p>The apparently homicidal Slytherin stared down at him with an unimpressed look. “Were you ever planning to go away, or have you moved in now?”</p>\n<p>“You couldn’t just say ‘Wake up’ or something like a normal person?” Harry rasped as he sat up and adjusted his glasses.</p>\n<p>“I’ve been trying to get you up for nearly ten <em>minutes</em>, Potter. You sleep like the damn dead.” Draco crossed his arms. “Case in point, you’ve been napping for the last four <em>hours</em>, and I’d like to sleep now.”</p>\n<p>That announcement startled Harry further awake. “Four hours?” he echoed. That meant it was, what… eleven? Midnight? Groaning, he dropped back down and covered his head with a pillow. “It’s not even worth going back.”</p>\n<p>“Yes, it <em>is</em>, because you’re hogging <em>my</em> bed,” Draco scowled, yanking the pillow off and swatting him with it. “Get moving.”</p>\n<p>“But the corridors are <em>cold</em>.”</p>\n<p>“You’ve got a robe.”</p>\n<p>“A robe doesn’t stop the draughts!”</p>\n<p>Sighing, Draco rubbed his nose before stalking over to his wardrobe. Flinging it open, he pulled out Harry’s Gryffindor robe and tossed it at him. It was followed up with one of his own house scarves. <em>This</em> was followed up with a snug, green hat and a matching pair of gloves.</p>\n<p>“Any other complaints?”</p>\n<p>Harry decided not to push his luck. For now. “It’ll do,” he told Draco with a shameless grin, pulling on every one of the pieces. Bidding Draco good night, he headed back to Gryffindor tower.</p>\n<p>//</p>\n<p>When Harry slipped into his own room, his housemates took one look at his scarves and hat and gloves, rolled their eyes, and went back to bed.</p>\n<p>Harry wondered how long it would take for Draco to miss his accoutrements.</p>\n<p>//</p>\n<p>It took four days.</p>\n<p>//</p>\n<p>It took three more for Harry to actually return any of it.</p>\n<p>//</p>\n<p>Operation Make Friends with Draco Malfoy was maybe getting out of hand.</p>\n<p>Harry realised this when Hermione came up to him one day, four months since the start of his project, and informed him, “Harry, this is maybe getting out of hand.”</p>\n<p>Harry blinked at her, in part surprised that she’d detached herself from Ron long enough to come after him. “What is?” he asked innocently.</p>\n<p>Hermione rolled her eyes. “You know perfectly well what I’m talking about, Harry. You’ve got that look in your eye, and your mouth is twitching.”</p>\n<p>(<em>What?!</em>)</p>\n<p>“And besides, aside from questioning your tastes, I don’t really care that you’re dating Malfoy.”</p>\n<p>Harry sat up, alarmed. “Now, wait a minute! I’m not – ”</p>\n<p>“I can’t say I’m surprised, really. We all heard your testimony at the trials, and that was still nothing compared to the way you used to stalk him.”</p>\n<p>“I didn’t – I had good reason to – ”</p>\n<p>“And even I can admit that he’s much more tolerable these days, now that he’s not spouting all that blood purity rubbish.”</p>\n<p>“Well, yes, but I don’t see how that has – ”</p>\n<p>“But don’t you think he deserves a little more honesty?”</p>\n<p>This time, Harry was <em>actually</em> confused. “Honesty? About what?”</p>\n<p>Hermione huffed. “Harry. You’ve got the poor boy carrying your books around school.”</p>\n<p>“I hurt my shoulder in Transfigurations!” Harry protested.</p>\n<p>“You’ve been wearing his scarf like a brand.”</p>\n<p>“It’s a nice scarf!”</p>\n<p>“You rarely sleep in your own room anymore.”</p>\n<p>“Have you <em>seen</em> the beds in the dungeon?” Harry demanded. “They’re brilliant. It’s completely unfair.”</p>\n<p>“Oh, for Godric’s sake! Even the <em>gossip columns</em> are making bets on how long you two will last. The entire wizarding world basically knows you’re dating him – <em>except him</em>,” Hermione finished.</p>\n<p>Harry stared blankly. He then continued staring, but less blankly and more grimly. He then continued staring, but less grimly and more embarrassedly.</p>\n<p>He then finally looked properly chastised.</p>\n<p>“We’re not dating,” he informed her quietly. “Really, we’re not. He wouldn’t be interested. It’s been difficult enough just getting him to be friends, and he’s never given any hint of anything else...”</p>\n<p>Hermione snorted.</p>\n<p>Harry blinked at her.</p>\n<p>Sighing, she gripped his shoulders in both hands and gave him a hard shake. “Harry James Potter. He <em>doesn’t refuse you anything</em>. He went from quietly letting people shove him around and hiding in the library in September – ”</p>\n<p>(<em>How did she know that?</em>)</p>\n<p>“ – to going on regular Hogsmeade outings and having private dinners and sharing clothes with you. You’re <em>dating him</em>. You’re dating him even more than I’m dating Ron, and I am <em>definitely</em> dating Ron.”</p>\n<p>Harry blinked at her again.</p>\n<p>“The only difference is Ron and I know it, whereas Malfoy completely doesn’t. You know what he said when I asked him how your date on Sunday went?”</p>\n<p>Stifling the urge to jealously demand why she’d been talking to Draco, Harry blinked at her again.</p>\n<p>“That you’re <em>after something</em>, and you’re just <em>biding your time</em> until you can bargain for it.” Her gaze hardened firmly, and Harry took a moment to wonder when Draco’d gotten under her skin like that. “He thinks you <em>want</em> something from him, something other than him, and I <em>know</em> I raised you better than that. So you stop leading that poor boy in circles and let him know what’s on your mind. Clear?”</p>\n<p>She gave him another hard shake when he didn’t immediately respond.</p>\n<p>Harry squeaked.</p>\n<p>That was enough for him to (kind of) ((sort of)) gather his wits. Managing to mumble something along the lines of “Yes, ma’am, sorry, ma’am” (or <em>yes, mum, sorry, mum</em>; it was difficult to tell when he was busily trying to conjure a hole to swallow him up), he made his Gryffindor ancestors proud by bravely turning tail to flee.</p>\n<p>//</p>\n<p>“So, uh.”</p>\n<p>Draco looked up when Harry entered his room, seemingly unsurprised to see him. The Slytherins had long ago given up trying to keep the password from him, and while Draco still sometimes kicked him out if he wanted to sleep in his own bed for a change (because Harry never seemed to fall asleep on one of the <em>empty</em> beds – oops?), more often than not he crashed on what used to be Blaise’s.</p>\n<p>He waited expectantly.</p>\n<p>Shuffling in farther, Harry shut the door behind himself and rubbed his neck. “So, uh – Hermione mentioned the two of you’ve been talking recently?”</p>\n<p>Draco stared at him impatiently.</p>\n<p>“I mean, that’s good – that’s great!” Harry added hastily. “Really. You both like long books and, and runes, and – and... stuff like that.”</p>\n<p>Sighing, Draco set his quill down and turned around in his chair. “Stop deflecting and spit it out, Potter.”</p>\n<p>Wincing, Harry cleared his throat. He took a deep breath, mustered up his Gryffindor courage, and…</p>\n<p>And he cleared his throat again.</p>\n<p>He took another deep breath.</p>\n<p>He frowned.</p>\n<p>“Do I <em>really</em> have an eye twitch?” he blurted out.</p>\n<p>Okay… he should maybe have continued mustering a little longer.</p>\n<p>Draco stared at him for a moment before slowly raising his eyebrows in disbelief. “<em>That’s</em> what you’re – oh, for Salazar’s sake. No, you pillock, you have a <em>mouth</em> twitch. You get the look in your eye first, and the mouth twitch starts just before you say something you think is sneaky.”</p>\n<p>“Since when?”</p>\n<p>“Since, I don’t know, third year? Fourth? <em>Birth</em>?” Draco huffed. “What does it <em>matter</em>?”</p>\n<p>“Of course it matters!” Harry despaired. “Nobody’s ever mentioned anything like that before, and even if Snape used to stare at me suspiciously, he stared at <em>everyone</em> suspiciously, so it didn’t exactly mean anything. And now you suddenly say I have these facial tells I never knew about! I’d think you were having me on, since you weren’t behaving the way you normally do when carrying out Fact #299, except Hermione confirmed it today, and I just – ”</p>\n<p>“Wait. Wait, wait, <em>wait</em>,” Draco interrupted. “Did you just say ‘Fact #299’?”</p>\n<p>Harry froze. “Er…”</p>\n<p>“You <em>did</em>,” Draco declared triumphantly, rising from his seat. “You only freeze up like that when you’re embarrassed, and since scenarios A and C are irrelevant, it must be scenario B.”</p>\n<p>“Scenario B?” Harry echoed. This was starting to feel surreal.</p>\n<p>Draco waved him off impatiently. “Why are you numbering <em>facts</em> about me?”</p>\n<p>“Why are you lettering scenarios about <em>me</em>?” Harry retorted, bewildered.</p>\n<p>“What’s ‘Fact #299’?”</p>\n<p>“What are scenarios A, B, and C?”</p>\n<p>“There are <em>lots</em> of scenarios A, B, and C for different behavioural patterns.”</p>\n<p>“And now <em>you’re</em> deflecting!”</p>\n<p>“Well, there <em>are</em>!”</p>\n<p>“There are a lot of facts, too!”</p>\n<p>“<em>What’s ‘Fact #299’?</em>”</p>\n<p>Harry abruptly noticed that they were all but shouting at each other. He noticed this because they were standing so close that his head was tilted back to look up (and up, and <em>up</em>) at Draco, and the shouting was making his ears pound.</p>\n<p>He sort of thought his heart was pounding, too.</p>\n<p>Was Draco wearing cologne, or had he always smelled this good?</p>\n<p>Were his pupils dilated from the arguing or the proximity?</p>\n<p>Was he <em>blushing</em>?</p>\n<p>“Not as important, I think,” he suggested slowly, dropping his voice back down to a decent volume, “as Fact… I suppose it will be Fact #500.”</p>\n<p>Desperately hoping he was reading the situation correctly, Harry swayed closer, close enough for his bony shoulders to bump Draco’s chest. Draco’s hands reflexively came up to grip his upper arms, but he neither pulled him closer nor pushed him away.</p>\n<p>With their gazes still locked, Harry saw a perplexing play of hesitation, hope, confusion, frustration, disappointment, hesitation, and hope again flashing across his face. “What is it?” he asked quietly, waiting for – for whatever Draco wanted, really.</p>\n<p>Swallowing, Draco gently pushed him back. “I… I believe I’m misinterpreting the current situation.”</p>\n<p>Draco’s withdrawal only confirming what he hoped the collection of scenarios meant, Harry made a frustrated noise. “What is there to misinterpret? I’m pretty sure we’re on the same page here.”</p>\n<p>“You’re a <em>hero</em>, Harry.”</p>\n<p>Harry’s heart skipped a beat at hearing his first name coming from the blond; all the same, he felt his stomach lurch at the reminder of how the rest of their world saw him. He hadn’t thought Draco cared about such things. In fact, he’d been <em>positive</em> he didn’t. Their conflicts had always revolved around <em>them</em>, not their social – </p>\n<p>“And I’m a <em>criminal</em>.”</p>\n<p> – clout.</p>\n<p>Wait, what?</p>\n<p>“Now, wait a minute,” Harry protested. “You are not! You were pardoned!”</p>\n<p>Even knowing that the war was too big to ignore, it was the <em>last</em> thing he wanted to talk about right now. He didn’t want history getting in the way of the present, of their potential, of… this.</p>\n<p>“On a technicality. I was pardoned because <em>you</em> testified on my – ”</p>\n<p>“You were pardoned because you were a <em>minor</em>, and you were coerced with no way out!” Harry shot back hotly. “What were you <em>supposed</em> to do when your parents were being held at wandpoint?”</p>\n<p>Draco sucked in a sharp breath.</p>\n<p>“I <em>saw</em> you break down, I saw you and your family <em>tortured</em>, and you <em>still</em> didn’t turn me in when you could have. How could I hold that against you?”</p>\n<p>“You still deserve better,” Draco argued wearily. “You deserve someone who never would have wavered in the first place, someone good and brave.”</p>\n<p>“Not changing is easy,” Harry snapped. “Following in your family’s footsteps is easy. Siding with your friends is easy. Doing the right thing when it goes <em>against</em> everything you’ve ever known? When the devil on your shoulder is your own kin? When you’re flanked by friends who are bigger and meaner than you, and you still tell them to stop?</p>\n<p>“At age eleven, you saw a shadow in the Forbidden Forest and ran off without me; this year, you stayed in <em>Fiendfyre</em> to try and save your unconscious friend. At age thirteen, you refused to bow down to an enormous hippogriff; this year, you’re humbling yourself to <em>me</em>. At age sixteen – ”</p>\n<p>Harry had to pause to swallow around a sudden lump in his throat.</p>\n<p>“At age sixteen, I nearly killed you while you were desperate and depressed. I watched you bleeding out, and I ran. I never even apologised for it. But this year, you lied to your father’s face to save my life. What could possibly be better and braver than that?”</p>\n<p>“I’ve never apologised to you, either,” Draco reminded quietly. “Not for anything I’ve said and done to you over the years.”</p>\n<p>“Okay,” Harry said.</p>\n<p>Draco blinked at him, and frowned. “‘Okay’?”</p>\n<p>“Okay,” Harry repeated. He gave the blond a small smile.</p>\n<p>“Okay… oh.” Realisation dawning, a look of intense discomfort settled on Draco’s face. He took a deep breath and let it out. “I’m sorry.”</p>\n<p>“Accepted,” Harry replied. “And for the record… I’m sorry, too. For being a prat right back… for the things I said or did that got you in trouble, too… for taking your wand.”</p>\n<p>“Taking my wand kept the Elder Wand away from the Dark Lord,” Draco pointed out. “You don’t have to apologise for <em>that</em>.”</p>\n<p>“Taking your wand left you helpless to protect yourself during a war. You’re the one who had Voldemort” – Harry resisted the impulse to roll his eyes at Draco’s reflexive flinch – “and the Death Eaters actually in your home.”</p>\n<p>“You’re the one they were trying to <em>kill</em>.”</p>\n<p>Harry waved him off impatiently. “Someone’s always trying to kill me; I’m pretty used to that.”</p>\n<p>Draco gave him a disgruntled look. “That’s not the <em>point</em>.”</p>\n<p>“And neither is this entire argument!” Harry declared. “We’ve got a long history of fighting. I <em>know</em> that. We’re probably <em>always</em> going to fight. We bicker when we’re getting along, for Godric’s sake. And we’re going to have some long, bad talks about the war, too. But that’ll happen no matter what so long as we stay in touch, I think. Which, you know, I’d <em>really</em> like to do. The point is – ”</p>\n<p>And here, his Gryffindor courage hiccupped again.</p>\n<p>Fidgeting uncomfortably, he cleared his throat. He shuffled his feet. He rubbed his neck. He avoided Draco’s eyes to stare roughly at his throat.</p>\n<p>Draco sighed, cupped his cheeks, and bent down (and down, and <em>down</em>) to kiss him soundly. “Yes,” he stated firmly, “I like you.”</p>\n<p>“Oh,” Harry replied, slightly dazed from both the kiss and his sheer disbelief that this was actually happening. “Okay. Good. I, uh… I mean, I like you. Too. I like you, too. A lot. Yeah.”</p>\n<p>“Okay.”</p>\n<p>“Okay.”</p>\n<p>After a few more seconds of standing about awkwardly, the situation finally sank in, and Harry broke out into a grin. “Wait, so then – so we… we’re…?”</p>\n<p>Snorting softly, Draco slid his arms down and around to Harry’s lower back and pulled him in closer. “If you want.”</p>\n<p>“I want,” Harry confirmed almost before Draco finished speaking.</p>\n<p>For the first time in over a year, Draco smiled.</p>\n<p>Harry tried not to expire.</p>\n<p>“Then yeah. Yeah, ‘we’re’. Whatever you want.”</p>\n<p>Mission <em>finally</em> accomplished.</p>\n<p> </p>\n<p>\n<strong>Operation MFwDM: Debriefing</strong>\n</p>\n<p>Over the course of Operation Make Friends with Draco Malfoy, Harry learned several things:</p>\n<p>1. He learned that maybe he couldn't read people as well as he'd previously believed.<br>\nCase 1a: He'd had no idea that Draco had been interested in him. He could forgive himself for this one, seeing as how he'd been too busy (badly) hiding his own interest.<br>\nCase 1b: He'd had no idea that Hermione knew when he was scheming, and apparently tolerated it anyway. This was a bit more difficult to accept, given that she was one of his best and oldest friends.</p>\n<p>2. He learned that maybe he wasn't as sneaky as he'd previously believed.<br>\nCase 2a: His apparent transparency when scheming. What did it say about him that both his best friend and his former rival had to <em>inform</em> him of what his visual tells were?<br>\nCase 2b: The public awareness of Operation Make Friends with Draco Malfoy. Really, the collage of newspaper clippings Ron and Ginny'd given him sort of made him want to stick his head under a pillow and not come out. Did he really look that soppy?</p>\n<p>3. He learned that maybe neither of these points really mattered, because:<br>\nReason 3a: It was sort of nice to know that he <em>could</em> fail at reading people now, and it was okay. He was done with fighting.<br>\nReason 3b: It was definitely nice to know that he had people who cared enough to read <em>him</em>.<br>\nReason 3c: It was even <em>nicer</em> to know that those same people accepted him enough to take the piss out of him.</p>\n<p>And most importantly:</p>\n<p>Reason 3d. Despite these minor failings in self-awareness, he still got the guy.</p>"
}