{
  "id": "1432078",
  "url": "https://archiveofourown.org/works/1432078?view_full_work=true",
  "author": [
    "black_nata"
  ],
  "title": "lethe",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Captain America (Movies)"
  ],
  "relationships": [
    "James \"Bucky\" Barnes/Steve Rogers"
  ],
  "characters": [
    "Steve Rogers",
    "James \"Bucky\" Barnes",
    "Natasha Romanov",
    "Sam Wilson (Marvel)",
    "Phil Coulson",
    "Maria Hill",
    "Peggy Carter"
  ],
  "additional_tags": [
    "Frottage",
    "Captain America: The Winter Soldier"
  ],
  "language": "English",
  "series": "",
  "published": "2014-04-08",
  "completed": null,
  "words": "6,962",
  "chapters": "1/1",
  "comments": "147",
  "kudos": "14,957",
  "bookmarks": "2,304",
  "hits": "190,905",
  "summary": "<p>\"Do it,\" he goads. \"Do it or come back home with me and let me help you. But you gotta do it now, Buck, because I can't take another moment of this hell.\"</p>",
  "notes": "",
  "text": "<p> </p>\n<p> </p>\n<p>\"So what do you think?\" Sam asks when he wakes up, peering over his magazine with bright eyes.<br><br> It takes a little time to focus, a little coughing and sputtering and Sam has the decency to drop his magazine aside and fill up a plastic cup for him. \"Thanks,\" Steve rasps, gulping down the contents. Some foul taste lingers in the back of his throat, like saltwater —like sand and smoke and blood, like things he wants to forget— that doesn't wash away even after four cups.<br><br> He hears the soft drone of a saxophone from Sam's iPod. It's a good tune, soothing, heavy. Almost makes him want to go back to sleep again and never wake up.<br><br> \"I like it,\" he says, watching Sam's mouth curl at the edges. There's something else there, too. Something else that puts a shadow on Sam's brow and deepens the tired lines around his eyes.<br><br> \"Your boy got away,\" Sam whispers, \"Left a couple of tracks at the shore and disappeared.\"<br><br> Steve knows this already. It's not like he was expecting him to wait around after all that, to run back into Steve's arms and say <em>'Stevie, buddy, you know I couldn't go, not like that, not without you...'</em><br><br> \"Natasha said she'd do some digging when she gets the chance, which isn't gonna be soon, what with the suits breathing down her neck, trying to lock us all up. A lot of paperwork. But she'll get to it. You just need to relax, get your mind off of it. Take the proper time to heal.\"<br><br> Steve wasn't expecting that cautious tone. Sure, he's in a pretty bad place right now, with IVs hooked up to his body and Bucky's sad, sad face stuck in his mind, but it's not like he's gonna do anything drastic. It's not like he's gonna rip out all these wires and limp out into the streets screaming Bucky's name, over and over and over—<br><br> He can't stop coughing. Sam hands him another cup of water, eyeing him carefully. For a moment, Steve is nineteen again, sprawled out on a dirty mattress with a paper-thin blanket over his frail form, shivering in the darkness. Bucky's there, too, holding a mug against his dry lips and a wet cloth on his forehead. He shushes him every time Steve says he's dying, <em>'dying, Buck, just like my ma'</em>, calls him an idiot with a voice that sounds like he's swallowed ten whole rolls of sandpaper.<br><br> \"Take it easy on that, Cap. I know you got magical superpowers and everything, but even with your healing abilities, abdominal wounds still need a lotta care. If you were any other guy, you wouldn't be drinking any water for some time.\"<br><br> Steve smiles at that. \"Alright, doc. Whatever you say.\"<br><br> Whatever Sam sees in him puts him at ease. He goes back to his magazine after a while, his mouth still curled a little at the edges, and Steve goes back to not sleeping, not thinking about Bucky and his frightened, sandpaper voice.<br><br><br><br> —<br><br><br><br> He dreams that Bucky comes to him that night, after Sam is gone and the nurses are changing for the midnight shift, and here he looks less like the Winter Soldier and more like good old Bucky with a really bad hangover.<br><br> \"Can't get a break even when I'm dreaming, huh?\"<br><br> Bucky only stares at him. That short stubble of his is well on its way to becoming a full beard, and Steve just wants to reach over with some foam and a razor and fix him up real nice like Bucky always liked.<br><br> The man's gaze runs over his form, half-hidden under white sheets and clear wires, under that itchy hospital gown, as though evaluating the damage. Ninety percent of it came from his bullets. Ten percent of it from that metal fist.<br><br> \"It's alright, Buck,\" Steve rasps, \"I'm pumped full of cortisone. Can't feel a damn thing.\" And the weak smile he tries to give would've worked just fine if his lungs hadn't decided to seize up and send him coughing like an old man right at that moment. He tries to reach over to the bedside table, behind that damn IV that always seems to be in the way of something, but with the way his lungs are burning and those stitches feeling like they're coming apart at the seams, he can't really do much.<br><br> Steve's just about to give up when he feels the cool cup press against his palm.<br><br> \"Gotta be careful, Stevie. The weather ain't getting any better, and that asthma sure as hell ain't either. Gonna have to get some soup in ya, even if you don't feel like eating.\"<br><br> It must be a dream, some warped memory from long ago, it must be—<br><br> But then Bucky's eyes grow wide like he just realized the words came out of his own mouth, and before Steve has the time to even breathe, Bucky's already gone.<br><br><br><br> —<br><br><br><br> It's a few weeks later when the topic comes up.<br><br> \"He came to me,\" Steve says, and Natasha doesn't seem surprised at all. She barely flinches, doesn't even give him that signature judgmental stare that makes Steve want to curl up on the ground with his shield over him. She hands him the folder along with a red flash drive, and though it's only some paper and a piece of metal, Steve feels like it's the heaviest thing he's ever held in his life.<br><br> \"Don't go looking, Steve.\"<br><br> \"Natasha, he's my friend, I need to—\"<br><br> \"I didn't mean it like that,\" she stops him. There's something in her eyes, that same something that Sam had when he talked to him at the hospital. \"Don't go looking. You don't need to. He'll come to you.\"<br><br> Her heels leave imprints on the dark cemetery earth as she goes. Fury is already a small dot in the distance. If Steve didn't feel alone when he first woke up after so many decades, he does now, just a little. He still has Sam, and Sam is good. Sam is friendly and loyal and a damn good shot, and in another lifetime —if Bucky wasn't haunting his mind like the ghost that he's become, the ghost they made him into— he could have taken Bucky's place.<br><br> \"Let's do this, Rogers,\" Sam exclaims, with that familiar curl of his mouth. Steve tries to ignore the part itching at the back of his mind that wishes Bucky had just died on those mountains, buried under rock and snow. It would have been painless. Bucky wouldn't have had to suffer for so many years, alone, trapped inside his own body. If only he hadn't fallen into the wrong hands. If only he hadn't fallen from that train.<br><br> If only Steve had caught him.<br><br><br><br> —<br><br><br><br> He follows Natasha's advice at first. He carries on with his life, scratching things off his notepad day by day, jogging with Sam every morning until Sam can't take it any more. He visits Peggy once a week because even though it's too late for it, he still owes her that one dance, and owes her so much more for all the things she's done that he can never repay, for believing in him when no one else would. Just her and Bucky and Erskine. Ma, too.<br><br> Half of them are gone. Peggy doesn't have a lot of time left, either, so Steve tries his best to swallow the pain when she forgets and sees him anew all over again, and then forgets, and remembers, and forgets, and Steve has to smile and clutch her hand in a tight grip just so she doesn't slip away like all the rest.<br><br> He can't let Bucky slip away, either.<br><br> He follows Natasha's advice for two more weeks before he caves in, after another meeting with Peggy, and the tears are still fresh in his eyes when he picks up the folder and starts looking.<br><br> Unsurprisingly, it all leads to Moscow in some abandoned soviet-era compound that turns out to be hiding an underground lab. It's like Zola all over again. But the place is all ruins. There's nothing useful, the drives are all burnt out and Steve ends up smashing the rest of the place to bits with his bare fists. He reckons Banner would have something witty to say about that.<br><br> Steve goes home empty-handed. He's not surprised to find Natasha waiting outside his doorstep, her eyes hard.<br><br> \"I thought I told you not to go looking,\" she bites. Natasha's always been the calm, collected type, and seeing her jaw clench like that makes Steve's gut twist with impending dread.<br><br> \"What's going on?\"<br><br> \"Winter Soldier trashed your place.\"<br><br> \"<em>What?</em>\"<br><br> A hand on his arm keeps him from going through the door. Another man would have most likely tried to push her aside, but Steve has seen her take down ten rogue commandos in less than sixty seconds with only a pen knife and not a single scratch. \"Hill's got a team inside, courtesy of Stark. Gotta make sure he hasn't rigged the place.\"<br><br> At that, Steve flinches. \"Natasha...\" he warns, his tone low, \"He wouldn't have trashed my apartment if he wanted to rig it. He wouldn't have left any evidence behind, and I'd be dead already, we both know that. So what else is there?\"<br><br> There's a short moment of contemplation before Natasha lets out an exasperated sigh. \"Fine,\" she says, and Steve watches her take out her earpiece and put it in her pocket with his brow knit. \"We found blood.\"<br><br> The words make the hair on the back of Steve's neck rise. Bucky's hurt. Bucky's hurt, oh God, he was hurt and he came looking for help and Steve wasn't there and he lost his mind, <em>oh God</em>—<br><br> \"It's not his, so you can relax,\" Natasha barks. She must have noticed the panicked look on his face, Steve thinks, and feels a little ashamed for letting his walls collapse so easily. \"DNA matched five HYDRA agents, ex-S.H.I.E.L.D. They most likely noticed you were gone and decided to throw you a little welcoming party. They're getting pretty desperate. Seems like your boyfriend surprised them first.\"<br><br> \"How do you know it's Bucky?\"<br><br> Something unreadable flashes across her eyes, and Steve realizes he should have probably corrected her instead of letting her call Bucky that.<br><br> \"How could it not be?\" she whispers. There's a smile at the edge of her lips now, like she's found another secret to add to her collection. It makes Steve want to lower his eyes and blush. \"Besides, we also found prints. They don't match anything on any database.\"<br><br> \"Doesn't mean they're his. The Winter Soldier wouldn't have left any prints behind.\"<br><br> \"No, he wouldn't. But Bucky would.\"<br><br> Steve can't say anything to counter that.<br><br> Natasha puts her earpiece back in and issues a few commands, and two seconds later Hill and her team are coming out through the back door. A century ago, the place would have smelled of bleach for a year to get it so spotless. Now Steve can't even estimate what the damage could have looked like. Everything looks exactly the same as it was when he left, and it's strange to think anyone was even here. To think Bucky was here.<br><br> \"Come on, Cap, think about it,\" Natasha says when they're inside. \"Someone killed all those agents for you. Then they cleared out the bodies. Now, why would anyone do that? Unless they were sentimental. Unless they didn't want you to see what they'd done to those agents. And judging by the mess, they paid a heavy price for trying to harm you.\"<br><br><br><br> —<br><br><br><br> Deep down, Steve thinks he should have known this was coming. It was either this or Bucky knocking down his door in the middle of the night and running that metal fist right through Steve's head, so Steve is somewhat thankful to know there's still a little hope.<br><br> It still feels all wrong. It's not like it's 1938 and Bucky's fending off the bullies that tried to knock Steve's teeth down his throat. It's not like they're in the trenches, so deep in Nazi territory that everything seems to be made of red swastika flags, and Steve's breaking through the lines with Bucky watching over him from the barracks with his sniper rifle.<br><br> This is different. And Steve doesn't want anyone ripping people apart for him. Especially Bucky.<br><br><br><br> —<br><br><br><br> \"Natasha seems to think there's something more between you and the Winter Soldier,\" Sam says one day, over pizza and beers in some bright little joint downtown.<br><br> Steve tries not to let his eyes widen. He takes a big bite out of his pepperoni and washes it down with ten whole gulps of beer that make Sam look at him with something between jealousy and awe, and simply answers, \"I don't know why she'd say that.\"<br><br> It's a lie. Sam's good at reading people, so if he notices, he's kind enough not to call Steve out on his bluff.<br><br> They talk about other things instead. Sam says Stark heard about the Falcon and offered to give his wings an upgrade in exchange for vodka shots with Steve. \"Said he wants to see how much he can get in you before you get all wobbly,\" and Steve almost chokes on his pepperoni laughing and says he'll think about it.<br><br> Later on, when he's back in his apartment —not home, never home, Steve doesn't know the word anymore—, he finds himself thinking back on Sam's words. He's always loved Bucky, like a friend, like a brother, but both Sam and Natasha seem to be implying something else. The thought lingers as he tries to sleep. He twists and turns in that bed that always feels too small, too big, too soft.<br><br> He thinks of Bucky and that dumb protective instinct of his and asks himself if maybe it was something else. How many times had Bucky kissed him on the forehead when he was sick and held him close? How many times had he pressed them together in the trenches, front to back, so they could stay warm? How many times...<br><br> No. It wasn't like that. It was just like motherly affection, nothing more. Steve sighs. He flips the pillow over to the cold side and tries to get comfy, rolling over only to get his legs tangled in the sheets, and he's just about to quit and turn on the TV when he notices the shadow on the far wall.<br><br> A pair of dark, glimmering eyes stare right back at him.<br><br> He can't help the noise he makes, and it must sound ridiculous coming from a nearly three-hundred-pound highly-trained super-soldier. \"B-Buck?\" he stammers. How long has he been sitting there? Something else glints in the darkness, small and sharp, in Bucky's metal hand. The red star on the deltoid looks faded. As though he'd tried to scrub it off.<br><br> \"Were we lovers?\" Bucky suddenly asks.<br><br> Steve's mouth goes dry. He must have been listening in on their conversations somehow, Steve thinks, listening to Sam ask about things that Steve doesn't even know the answer to. \"No,\" he gulps, and Bucky follows the motion of his throat's apple with sharp eyes. For once in his life, Steve wants to sink back into that soft marshmallow bed and disappear, let it swallow him whole.<br><br> The feeling gets worse when Bucky rises to his feet. \"You're lying. Why are you lying?\"<br><br> \"I-I'm not.\"<br><br> It's not very convincing. Bucky tightens his jaw and inches closer, the knife glinting in his palm. He's nearly at the foot of the bed when he holds up the knife like he's ready to fight. Steve's about to draw his legs up and pounce, when Bucky suddenly turns the blade on himself in one angry, mean slice.<br><br> \"Bucky, no!\" he shouts. By the time he realizes Bucky hasn't done any damage to himself but only ripped his vest open, Steve already has one hand curled around the arm holding the knife, and the other pressed against the center of his chest where Bucky cut. He's surprised to find bare skin beneath his palm instead of Kevlar.<br><br> \"Were we lovers?\" Bucky asks again.<br><br> Bucky sheds the tattered remains of his top like it's the most natural thing. Steve draws back like he's touched fire. God knows he's seen Bucky more naked than this, has shared a bed and a shower with the man a thousand times before. But this is different. Bucky never had that dazed look in his eyes when he looked at Steve, no— That look was reserved for pretty ladies at the fair, for good food and whiskey and that dirty magazine Steve always knew Bucky kept under his mattress. Not for Steve. Never Steve.<br><br> \"Don't—\"<br><br> But Bucky kisses him. Presses their bodies together like they were made to fit and licks into his mouth when Steve gasps. Bucky's stubble scratches his face up real good and Steve tells himself it's because it hurts that he moans, tells himself it's because he's planning to knee him in the groin that he slots his thigh between Bucky's legs, and not because he can't get enough of it.<br><br> In the end, he has to pull away. Bucky isn't himself. Bucky would have never done this if he was in his right mind. And Steve can't afford to put more holes in something that's already so damaged.<br><br> \"Stop, stop,\" he rasps, and tries to ignore the hurt look on Bucky's face when he pushes him away a little too hard. Just like he tries to ignore the spit shining on Bucky's raw, red lips. \"We... We weren't lovers, Buck, you got it all wrong.\"<br><br> Bucky looks like some stray, abandoned animal. With dull eyes, he brings that metal arm up to his face and wipes his lips clean, pushes the hair stuck to his flushed cheeks away. Steve feels like he needs to say something. To apologize. He isn't even sure if that would work at this point. Bucky just reaches down and picks up his torn ballistic vest, flings it over his shoulder and walks over to the door like he's planning to go out into the streets half-naked in December. Steve's about to offer one of his shirts when Bucky speaks.<br><br> \"I remembered,\" he murmurs, almost like he's afraid of the sound of his own voice. \"I remembered summer at Coney Island. I made you ride the Cyclone. You wouldn't go on any of the rides with me after that, so we sat down at the beach with a couple of ice-cream sodas from the stand.\"<br><br> Bucky looks like he's about to cry, though it's probably just the light, just a trick of the light—<br><br> \"I remembered thinking that all I had to do was lean over and kiss you and it'd be like a real date. I wanted to. I almost did, but there were people...\"<br><br> He doesn't finish the sentence. He slams the door on the way out and it seems to echo for whole minutes after he's gone, and Steve is left standing there in the middle of the room with Bucky's sharp, glinting knife forgotten on the carpeted floor.<br><br><br><br> —<br><br><br><br> Steve doesn't sleep for days after that night, so a few weeks later when S.H.I.E.L.D. is operational again, he's more than thankful for the distraction.<br><br> Hill is made Director as second-in-command to Nick, and she's gracious enough to give him mission after mission after mission when he asks. Steve can tell she knows there's something wrong, but she never asks. Hill is smart enough to know that some people deal with things differently in a lonely, dangerous place like S.H.I.E.L.D., and besides, it's not like she's going to waste the company's best asset by keeping him grounded until he's feeling better.<br><br> He's given new recruits to train, new terrorists to take out. The whole world's a mess, strange and foreign. Spec ops come and go and Steve feels like he's watching everything come apart around him, like he's going to live the rest of his life solid and ageless, like a fixed point, while everything else dissolves.<br><br> It's like a sign from God when a familiar figure shows up at the compound, and Steve drops his shield and rushes through the crowd to get a better look, like he isn't sure of what's real, like he's seen a ghost.<br><br> \"Phil?\" he gasps.<br><br> \"Captain Rogers.\"<br><br> His whole life is a dream. Some dark, recurring nightmare where all the phantoms of everyone he's failed come back to haunt him. First Bucky, now this. Is Erskine gonna come back, too? Come back with his ma and take him out for coffee like they haven't been dead for a hundred years?<br><br> Phil looks a lot better than the last time he saw him. He takes a sip of that frothy milky concoction of his and says, \"Heard you were reunited with an old friend,\" and Steve doesn't know how he'll ever be able to forget about Bucky —forget about his soft, red mouth and the feel of that metal hand pressing gently at the back of his neck— when everyone keeps talking to him about it. \"Agent Romanoff asked me for a favor. And you know that when the Black Widow starts asking for favors, it's gotta be important.\"<br><br> This catches Steve's attention. \"What kind of favor?\"<br><br> \"I got a lead on his location,\" Phil suddenly says. He pulls out a piece of paper from the inside of his jacket and places it under Steve's cup. Steve can see a shadow of red ink from the back of the note. \"He keeps changing location every couple of days, so you'll have to be fast if you want to get to him in time. I think he wants you to find him or else he'd already be far away from here.\"<br><br> Steve clenches his jaw. \"Why are you helping me? I thought S.H.I.E.L.D. wanted me to stay away from him.\"<br><br> He tries not to think about the bugs in his apartment that someone keeps putting back in week after week that Steve's been ripping out only to find new ones the next day. He tries not to think about someone listening in on everything —Natasha listening to Bucky's confession, to the unmistakable sounds coming from their lips with every kiss— and instead fixes Coulson with a hard stare like he can actually make a man like him feel threatened.<br><br> \"Natasha wanted to thank you for saving her life in Zola's lab,\" Phil smiles. It's like a natural thing for him. It doesn't come so easily for any of the other agents, not even Sam. He takes another long sip of his coffee and licks the froth from his lips. \"And me, well... You know I'm always happy to help Captain America.\"<br><br><br><br> —<br><br><br><br> The address on the paper leads to some dingy, run-down hotel crammed behind a Denny's, and the whole place smells like burnt bacon and dirty laundry even from the outside. This isn't someplace Steve would even like to walk past, but he figures Bucky isn't here for a five-star experience.<br><br> There's no one at the front desk. Steve hears a man's voice from behind the door to the left, probably the receptionist. He finds the chance to reach over and grab a set of keys from the rack while the man talks on the phone. Room 202. Steve doubts anyone will notice they're gone. He forfeits the rusty elevator and goes for the stairs, hearing the faint pitter-patter of water leaking from the upper levels until he reaches the second floor. Then it all goes quiet.<br><br> It's unsettling. The air feels thick with moisture and Steve feels like something's going to jump out of the ugly yellow shadows and—<br><br> \"Don't move.\"<br><br> He should have brought his shield. It wouldn't exactly have been covert, but this is Bucky— no, the <em>Winter Soldier</em>, and what with that deadly body pressed against his back and the tip of a blade resting at the hollow of his throat, Steve realizes that he might have miscalculated the extent of Bucky's recovery.<br><br> \"Bucky, please...\" he groans. The man just pushes the knife harder against him in warning. \"Please, let me help you.\"<br><br> He can feel the quick thump of Bucky's heart, violent and erratic, even through all these layers. \"I... I need to finish my mission. I need to. I...\" Bucky stammers. It puts a knot in Steve's stomach, how frightened he sounds. How all this could have been nothing more than a trap for him.<br><br> \"You don't need to, Buck,\" he shivers when Bucky's hot breath washes over his neck. \"HYDRA's compromised. It's over. You don't have to finish it.\"<br><br> \"I need to, I need... I...\"<br><br> Steve isn't sure if Bucky's all here. He doesn't seem to be realizing what Steve is saying, or that the knife is starting to cut a little into his skin. It hurts, less to feel the blade's mark and more to know that Bucky's the one wielding it, dragging it across his skin like he isn't sure what kind of pattern to draw into him yet. A star, maybe.<br><br> \"You saved my life,\" Steve chokes. The knife stills momentarily, just so he can get the words out. \"You fished me out of the water. You killed those HYDRA agents. You remembered what they did to you, didn't you? <em>God</em>, they must have wiped you so many times, but you remembered.\"<br><br> He doesn't know if Bucky's listening, but dammit, he hopes—<br><br> \"W-What about Coney Island, huh? You remembered that, too,\" he gulps and feels the knife against his apple. For a moment, he wishes Bucky would just do it. Cut deep and put an end to Steve's misery. But then Bucky would be all alone. And Steve doesn't want that. \"You remember how you always tried to set me up with all those girls? And I kept telling you not to cos I was just waiting for the right partner? Remember that?\"<br><br> He can barely hear himself over the deafening beat of Bucky's heart.<br><br> \"I lied to you, Buck. I lied. I'd already found the right partner.\"<br><br> \"I need to... I need to finish my mission. I need to—\"<br><br> \"It was you, goddamn it. It was you all along. From the moment you picked me out of that ditch and ruined your pa's hanky wiping the dirt off my scraped knees,\" and Steve laughs just so he doesn't burst out in tears instead. \"I'm sorry, Bucky. I'm sorry. I didn't think anyone could love a scrawny little punk like me. People only started to like me when I became Captain America. Except you. You wouldn't even look at me after the serum, you kept away like I was some kind of stranger, and I didn't like that, Buck, I didn't like that at all...\"<br><br> He stops himself before he says too much. A strange noise catches at the back of his throat that Steve convinces himself isn't a sob.<br><br> Bucky turns him around then. Holds him by the back of the neck and Steve isn't sure whether he's going to kill him or kiss him or maybe both, but he hopes Bucky will do it quick because he can't stand this anymore. It feels too much, like they're dragging it into eternity. He should have died in that crash years ago. They should have let them both rest in their graves of snow.<br><br> Bucky doesn't kiss him. He doesn't even blink, just stares with dull eyes like he's had enough, too. The knife trembles in his metal hand, and for a second, Steve hears the low whir of the gears trying to adjust.<br><br> \"Do it,\" he goads. \"Do it or come back home with me and let me help you. But you gotta do it now, Buck, because I can't take another moment of this hell.\"<br><br><br><br> —<br><br><br><br> It's a cold night.<br><br> Steve turns on the heater, draws a hot bath and sinks into the water with a groan. The ache in his back loosens. His eyes grow heavy with sleep. By the time he steps out again, it feels as though a day has gone, and somewhere behind those curtains, the sun is peeking over the horizon, red and bright.<br><br> He notices Bucky's curled up under the sheets just as he's about to collapse on the bed. His face is still twisted in a scowl even in his sleep, his dark hair spilling over it, but at least he's here. At least he's trying.<br><br> With a smile playing at the edges of his eyes, Steve turns towards the door. He's just about to walk out when something like a steel trap closes around his wrist, and Bucky says, \"Don't go.\"<br><br> \"It's alright, Buck. Don't worry about it. I'll just sleep on the couch.\"<br><br> But Bucky's hand tightens around him, the metal whirring. Steve can only see half his face in this darkness, and the other half looks a little wet around the eyes, a little swollen. There's a silent desperation there that Steve can't ignore, so he breathes out a shaky sigh and lets Bucky pull him down into the bed and wrap himself around him, radiating warmth. Just like in the trenches.<br><br> Steve tries to keep his heart from beating too loud in the sudden silence.<br><br><br><br> —<br><br><br><br> \"Ma'am, with all due respect, if I hand him over to S.H.I.E.L.D. now, he'll probably run off and disappear before I even manage to get him in the car. He's in a fragile state. He needs more time. We bring him in too soon, he'll shut down again. Let me keep him here until he remembers more, and when the time is right we can have him debriefed and analyzed. Meanwhile, I'll keep you updated every twenty-four hours, on the clock. I'll tell you everything you need to know.\"<br><br> It's another lie.<br><br> Bucky disappears one day and Steve keeps it to himself, rides through the streets on his motorcycle looking for him like he'll find him sitting at the curb, but Bucky is nowhere to be found and Steve panics. He calls Hill at six and tells her everything's fine, '<em>He's just sitting by the TV watching old pictures</em>', and the lie leaves a bitter taste at the back of his throat.<br><br> It's the same answer the next day, and the next, and Hill must be getting suspicious of him by now.<br><br> Five days later, S.H.I.E.L.D. comes knocking at nine in the morning. \"Where is he?\" Coulson asks. It's strange to see that look of disappointment on the man's face, but for once, Steve can't blame anyone for it. Three agents walk in behind him, their hands resting on their guns like Steve is some kind of threat that they're going to have to put down.<br><br> \"I'm right here.\"<br><br> Steve just about loses it. He turns to find Bucky coming out of the bathroom, clean-shaven, his wet hair slicked back.<br><br> \"What's all this?\" Bucky raises his eyebrows at the crowd like he doesn't know a damn thing.<br><br> The agents share an indecipherable look between them. Coulson turns to him and smiles. \"Just checking up on Captain Rogers,\" he says, and \"Have a nice day\", and Steve watches them step outside without a word and roll out into the morning air in that black SUV.<br><br><br><br> —<br><br><br><br> Steve doesn't ask where he goes.<br><br> Bucky disappears for days, a backpack strapped to his shoulders and a Kevlar vest under that hooded sweatshirt. He never says goodbye. Just pulls that baseball cap low over his eyes and slams the door behind him.<br><br> Steve doesn't mind. Every time he comes back shaky and exhausted, his eyes red, but every time he comes back looking less and less like the Winter Soldier. Steve figures he's looking for answers, remembering things. Whatever it is that he finds on those journeys puts him at ease, and by the end of the month, he's smiling a little, wrinkles at the corners of his eyes and everything, and he holds Steve a little tighter while they sleep.<br><br> Some nights, he kisses him. Splays that metal hand across his chest and presses him down onto the mattress. \"How'd you get so big, Stevie?\" he whispers, lips curled in a grin and brushing against his throat, and Steve feels something in him stir.<br><br> But Bucky never goes any further. There's still that frightened look in his eyes, and sometimes Steve finds him standing under the shower in the middle of the night, steam curling all around him, his skin looking like it'd melt right off if the water was just a notch hotter. On those nights, Bucky doesn't touch him. He sits in a corner by the window, right on the living room floor. Vantage point.<br><br> He sits there and studies that metal arm, traces the joints and the faded red star, and when he starts scratching the marred flesh where his shoulder and the bionic limb connect, Steve wants to reach over and stop him. Take those hard hands and press them against his own chest as a reminder that he's right here, right here with Bucky and he's safe.<br><br> It's one of those nights again.<br><br> Bucky has his back pressed against the wall with a knife tight in his palm, like he's waiting for someone to come in through the window and take him away. Steve leaves him to his own devices, because if there's one thing he knows about cases like this, it's that it's better not to interfere.<br><br> He keeps an eye on him nonetheless. There's a documentary about space exploration on TV and Steve pretends like he's really watching it, like he isn't staying up for Bucky's sake in case he does something stupid. He's got the volume turned so low he can hear the man's breathing, deep and harsh, the kind Steve only hears from new recruits on their way to their first parachute drop.<br><br> On the TV, a dying star explodes. Steve watches as it consumes the worlds around it before he realizes that Bucky's murmuring something.<br><br> \"What's that, Buck?\"<br><br> Bucky doesn't register the words. He looks down at his hands, down at the knife's steel teeth with dark eyes. \"Я должен завершить миссию,\" he whimpers, and Steve goes rigid. His Russian has needed brushing up since 1942, but there's one word in there he remembers clear as day. <em>Mission</em>.<br><br> \"You don't have a mission anymore, remember?\" He tries to ignore the desperation in his own voice. \"Why don't you come over here and watch TV with me? They're showing that Mars rover that you like. Bucky?\"<br><br> But Bucky is miles away, murmuring that same phrase over and over again until it doesn't even sound like a language anymore, but a cold, desolate plea.<em> 'Я должен завершить миссию. Я должен завершить миссию.' </em>Steve wants to put a pillow over his ears and muffle that godawful noise.<br><br> \"Bucky!\" he barks. The sound startles him, the knife slipping from his fingers and clattering in the sudden silence. Bucky's eyes widen. That last word catches in his throat and he looks down at his hands again, at the knife resting near his boots. It's like watching someone come out of a dream. \"Come here,\" Steve says again. His whisper almost goes unheard but Bucky rises to his feet almost mechanically. Like he's following commands. The couch creaks under their combined weight.<br><br> They keep their eyes fixed on the TV for what feels like hours, motionless and tense. They're showing a program about dinosaurs now. Some big, strong creature with thick skin is found frozen in ice, perfectly preserved, and the scientists are hoping to bring it back to life once it's thawed out.<br><br> \"They're never going to learn to leave things where they belong, are they?\"<br><br>  \"Я должен завершить—\"<br><br> Steve snaps. He doesn't realize what he's done until Bucky makes a soft noise beneath him, and Steve tastes salt and sweat. He can't think of anything else to get him to snap out of it. He straddles Bucky —the Winter Soldier, whoever's in there right now— and feels the man canting up his hips in response, digging his thumbs into Steve's thighs. A startled noise comes out of him. In all honesty, Steve wasn't expecting it to work.<br><br> But then something like a growl leaves Bucky's throat and suddenly, Steve's on his back on the carpet with Bucky looming over him, ripping his shirt apart with one metal fist and the noise of gears whirring. \"Bucky...\" Steve gasps. It's the last sound he makes before Bucky covers his mouth with his own.<br><br> Bucky feels like a damn furnace. Back in the days when Steve was just a bag of bones, too thin and too cold and too sick to look after himself, he'd burrow into Bucky's arms to stave off the cold. It was a need that later on became a silly habit. Even in the trenches, when Steve no longer had reason to do so, he'd try to fit his bulk against Bucky's suddenly smaller form, and Bucky would laugh and say, <em>'What the hell are you doing, Stevie? You know I can't be the bigger spoon anymore.'</em><br><br> They've balanced out now. They've felt the bitter bite of the same ice and the sting of the same needle. Half men, half machines. Steve holds onto Bucky a little tighter at the thought, tries not to flinch when his fingers wrap around warm metal instead of flesh.<br><br> \"Steve?\" Bucky stills for a moment. It feels strange to hear his name from Bucky's lips after so long. It makes Steve shiver and open his eyes, full of wonder, asking himself how he can get Bucky to say it again and again and again.<br><br> \"Yeah, Buck?\"<br><br> He looks hesitant. If the Winter Soldier was there a moment ago, he's gone now. Dark eyes fix him with a questioning stare and Steve's about to ask if something's wrong when Bucky reaches down and grabs him through his jeans. Steve's mouth falls open. \"I wanna do something for you,\" Bucky says. He leans over and traps a pink nipple between his teeth, traces the skin with his tongue and whispers, \"Would you let me do something for you, Steve?\"<br><br> If only Steve's voice would work.<br><br> It doesn't have to. Bucky's deft fingers brush over his stomach to his belt and Steve feels his cheeks grow warm, feels his eyelashes flutter without his consent as the metal hand begins to undo the buttons.<br><br> And then that mouth is on him. That hot, slick mouth with lips as red as sin, red like the star on Bucky's arm and the blood Steve tastes on his teeth from trying to stifle his own sounds. It takes all he has not to look down at Bucky's face while he does it, because if he does, it'll all be over faster than he'd like. He buries his fingers into Bucky's hair instead, feels the soft texture of the strands. Feels the motion as he bobs up and down his cock.<br><br> \"Jesus, Buck, <em>God</em>.\"<br><br> He feels Bucky smile around him, the smug son of a gun, wrap his lips around the head and pull off with a loud, obnoxious pop that makes Steve finally look down.<br><br> It's not Bucky anymore. At least, not all of him. The Winter Soldier's there, too, behind the blackened depths of his eyes, and Steve isn't sure whether he wants to pull away before he takes over or offer himself up in surrender. It's a hard choice that Bucky is kind enough to make for him. With urgent hands, he opens his own pants to pull himself out and take them both in one rough hand.<br><br> Steve unconsciously licks his lips at the sight of it. They fit like they always have, warm and right, and when Bucky starts to thrust, Steve pulls him down on top and takes all of his weight, takes him like he's always wanted to but never had the chance.<br><br> It all gets too slick and too hot all too soon.<br><br> Bucky's motions grow erratic, his hips thrusting at a brutal pace, and just as Steve thinks he might last a little longer, Bucky's hot mouth presses against his throat and he moans, deepening the blush on Steve's cheeks as he says, \"Fuck, Steve, I'm gonna come,\" — and Steve's done for, just like that.<br><br><br><br> —<br><br><br><br> Bucky sleeps for six whole hours that night.<br><br> He wakes up like he always does, a little confused, a little pale on the cheeks like he's been seeing nothing but nightmares since he closed his eyes, but he smiles when he looks at Steve. He smiles and says, \"That you, Stevie?\" and blinks twice, always twice, just to make sure it's not a dream.<br><br> \"Yeah, Buck. It's me.\"<br><br> \"They told me you were dead,\" Bucky rasps, his voice suddenly heavy with emotion. He looks down at his metal arm like it's the first time he's ever seen it, and then looks up at him with wide eyes. Steve swallows bitterly. Sometimes, this happens. Sometimes, Bucky forgets —just like Peggy, he thinks, and hates himself for even having the thought— and Steve has to remind him who he is, why they're still alive. But it's alright. He reaches over and takes Bucky's metal hand into his own. It's alright.<br><br> \"Well, I'm here with you, right?\" He puts a little extra effort to his smile when he talks to Bucky. \"I'm with you 'til the end of the line.\"</p>\n<p> </p>\n<p> </p>"
}