{
  "id": "14343888",
  "url": "https://archiveofourown.org/works/14343888?view_full_work=true",
  "author": [
    "Jazzfordshire"
  ],
  "title": "it feels like the first time",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "F/F"
  ],
  "fandoms": [
    "Supergirl (TV 2015)"
  ],
  "relationships": [
    "Kara Danvers/Lena Luthor"
  ],
  "characters": [
    "Kara Danvers",
    "Lena Luthor",
    "Alex Danvers",
    "Samantha \"Sam\" Arias"
  ],
  "additional_tags": [
    "Oral",
    "Strap-Ons",
    "Lena's first orgasm",
    "Alternate Universe - No Powers",
    "Based on a Tumblr Post"
  ],
  "language": "English",
  "series": "",
  "published": "2018-04-17",
  "completed": null,
  "words": "8,451",
  "chapters": "1/1",
  "comments": "489",
  "kudos": "16,536",
  "bookmarks": "1,955",
  "hits": "271,187",
  "summary": "<p>“Wait. You don’t – what do you mean, you don’t ‘get there’?”</p>\n<p>“You know,” Lena blushes, stirring her cappuccino awkwardly with her pinkie. “Orgasm. I just don’t…do that.”</p>\n<p>“You don’t orgasm,” Sam says flatly, looking increasingly horrified. Lena starts to feel more and more self-conscious about her admission, shifting in her chair with badly-concealed discomfort.</p>\n<p>“No.”</p>\n<p>“EVER?!”</p>\n<p>OR</p>\n<p>Lena has never had an orgasm, so Sam asks her girlfriend's little sister to give her a night to remember. The problem is, Lena isn’t gay. Right?</p>\n<p>Cue lots of sex, a few feelings, and a dash of panic.</p>",
  "notes": "<p>Someone prompted me to write a fic based on a twitter thread/tumblr post, which made me laugh. Hope you guys enjoy!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Come yell at me on tumblr @jazzfordshire!</p>",
  "text": "<p>“Over here, Lena!”</p>\n<p>Shaking the water from her umbrella, Lena spots Sam at a table in the corner of the café, far from the rain-streaked windows.</p>\n<p>“You’re lucky I came at all, in this weather,” Lena grumbles as she sits down, leaning the umbrella against her chair and trying her best not to get water all over her pantyhose. Sam smiles, pushing a large cappuccino towards her – Lena takes an appreciative sip, humming at the warmth and the jolt of caffeine.</p>\n<p>“Yes, but this proves that you truly love me.”</p>\n<p>“Was there ever any doubt?” Lena says, and Sam laughs.</p>\n<p>“Considering I’ve hardly seen you in three weeks, I’d say so!”</p>\n<p>Guilt stabs at Lena’s chest at the comment. She has been working crazy hours lately – L-Corp is in the process of acquiring a new company, and she’s been working overtime to make sure it goes smoothly. Sam is one of the few people she sees outside of work, and she hasn’t been making enough time for her.</p>\n<p>Sam’s phone pings next to her on the table, the screen lighting up with a new message, and Sam glances down at it. Whatever it says, it makes her face light up in a smile.</p>\n<p>“So, how is Alex?” Lena asks, looking pointedly at Sam’s phone. Sam grins guiltily, but her happiness is infectious.</p>\n<p>“Great! She and Ruby love each other, so that’s one less thing to worry about. Honestly, she’s pretty wonderful.” Sam’s smile turns dreamy, and Lena can’t help but feel a bit jealous. She knows she shouldn’t – Sam is happy, and that’s the most important thing – but whatever Sam is feeling seems to be the complete opposite of every relationship Lena has ever had.</p>\n<p>“I’m a little upset that I still haven’t met her,” she says instead, sipping her coffee.</p>\n<p>“I know, I know,” Sam agrees. “But even <em>I</em> barely get to see you right now. I had to practically drag you out of the office today.”</p>\n<p>“I know, and I’m sorry,” Lena says, squeezing Sam’s hand briefly. “It’s been a mess at L-Corp. I promise I’ll make more time. What with this acquisition, and the whole James fiasco…”</p>\n<p>Sam winces sympathetically. “Is he still acting weird?”</p>\n<p>“Yes,” Lena sighs, dipping a finger into her cappuccino foam and licking it off. She’s been on edge all week, waiting for James to come get the rest of his things from her apartment, and it feels good to finally relax with Sam. “He keeps saying he doesn’t understand why we broke up. I don’t have the heart to tell him I was <em>bored</em>.”</p>\n<p>“That can’t have been the only reason,” Sam probes, and Lena frowns.</p>\n<p>Maybe there were other reasons.</p>\n<p>“It was just so…I don’t know. He was a good guy. Kind, affectionate. There just wasn’t a spark. And don’t get me started on the sex.” Lena rests her elbows on the table, massaging her temples.</p>\n<p>“That bad huh?”</p>\n<p>“I mean, it’s not like I ever really <em>get there</em> with anyone, but it’s still frustrating.”</p>\n<p>James had just been so…standard. He had gotten so dejected when Lena admitted that he didn't make her come that she just started faking it, and pretending to enjoy herself got to be exhausting. His cologne made her wince, and while he had a fairly varied set of moves, none of them ever worked for Lena.</p>\n<p>Granted, <em>no</em> man’s moves have ever worked on Lena, but she pushes that thought aside. She’s deep enough in thought over it that she almost doesn’t notice Sam choke on her tea.</p>\n<p>“Wait. You don’t – what do you mean, you don’t <em>get there</em>?” Sam asks, dabbing at her chin with a napkin and narrowing her eyes.</p>\n<p>“You know,” Lena blushes, stirring her cappuccino awkwardly with her pinkie. “Orgasm. I just don’t…do that.”</p>\n<p>“You don’t orgasm.” Sam says flatly, looking increasingly horrified. Lena starts to feel more and more self-conscious about her admission, shifting in her chair with badly-concealed discomfort.</p>\n<p>“No.”</p>\n<p><em>“EVER?” </em>Sam practically shouts, and Lena jumps at the volume.</p>\n<p>“Shhh, Sam, keep your voice down!” Lena hisses, looking around furtively – a few people have glanced over, but their attention moves on quickly. “Can we not <em>yell</em> about my sex life in a public place?”</p>\n<p>Sam nods, looking terribly concerned, and lowers her voice. “I’m sorry, I just – <em>none</em> of the guys you’ve dated have ever made you come?”</p>\n<p>“No, okay?” Lena whispers, her face starting to get hot. “None of them.”</p>\n<p>“Oh, Lena, sweetie. Please tell me you at least take care of it yourself.”</p>\n<p>“I – that’s –“ Lena stutters, her face now flushing crimson. “I don’t have time to – I don’t know how -“</p>\n<p>Sam gapes at her, flabbergasted. “Lena, oh my <em>god</em>. Have you <em>ever</em> had an orgasm?”</p>\n<p>“I – there was one time that maybe, I think –“</p>\n<p>“Okay, if there’s any doubt, then the answer is no,” Sam sighs, leaning back in her chair, and Lena crosses her arms over her torso protectively. She certainly wasn’t expecting this strange conversation when she agreed to meet for coffee, and it’s throwing off her entire day.</p>\n<p>“Is that really so weird?” Lena argues, trying to seem nonchalant. “Lots of women don’t have an orgasm every time. Some people never do. I’ve read studies.”</p>\n<p>“Of course you have,” Sam says, sighing. “And you’ve never tried it by yourself?”</p>\n<p>“I’ve never felt…I don’t know, turned on enough, I suppose.” Lena focuses on precisely folding the napkin in front of her into neat squares to distract herself, and Sam waits patiently. When it gets too tight to fold, she drops it and finally voices a fear that she’s been harboring ever since she broke up with Jack when she was 22. “Maybe…maybe I’m just built wrong.”</p>\n<p>Sam looks at her intensely for a few moments, her expression unreadable, and Lena averts her gaze. She stares at the table instead, scratching at a small hole in the wood with her thumbnail. Finally, Sam seems to come to a decision - she leans forward, putting her hand over Lena’s.</p>\n<p>“You’re built just fine, honey. But maybe you just need someone to show you what good sex can be like.”</p>\n<p>Lena laughs nervously, pulling her hand back gently. “What, are <em>you</em> going to do it? I don’t think Alex would like that.”</p>\n<p>But Sam is already pulling out her phone, and Lena’s insides clench with nerves.</p>\n<p>“No, not me. Alex’s little sister is single, and I think you’ll like her,” Sam says, already tapping at her screen. Lena feels an inexplicable panic wash over her.</p>\n<p>“<em>Her</em>? Sam, I’m not gay,” Lena says loudly and probably a little too fast. Sam rolls her eyes.</p>\n<p>“I <em>know</em>, Lena. You’ve assured me of that several times over the course of our friendship,” Sam says, a twinkle in her eye. “But in those studies you read, did it not say that gay women have proportionately more orgasms than straight women? Why do you think that is?”</p>\n<p>Lena stays silent. It’s true – all of the studies she had read, after the first few months with her first boyfriend Jack had been proving fruitless, <em>did</em> say that women with female partners had the highest percentage of orgasms. Sam knows exactly how to sway her – with facts, and data, and persuasive argument – and she finds herself starting to consider it.</p>\n<p>“I just – I’m not going to be into it, that’s all. It’s going to be an awkward night for both of us.”</p>\n<p>“Well then, it won’t be much different than your other sexual encounters, will it? Consider it an experiment.”</p>\n<p>It’s a fair point. At least with a woman, she won’t feel obligated to go through with it for the sake of the other person. And besides, Sam is impossible to dissuade once she has an idea in her head. Lena figures it’ll probably be easier to just meet this woman, deal with the awkwardness, and prove that the idea didn’t work rather than try talk her out of it.</p>\n<p>“Fine. But you’ll be getting a text afterwards saying ‘I told you so’. Go ahead and ask her.”</p>\n<p>“Good, because I already sent the message. Smile, I need to send her a picture.”</p>\n<p>\n<em>“Sam!”</em>\n</p>\n<p> </p>\n<p> </p>\n<p>\n<em>What the hell do you wear for a pre-planned casual hookup with a woman?</em>\n</p>\n<p>Lena rifles through her closet for what feels like the hundredth time, grabbing both a tight red dress and a slacks-and-blouse combination. She holds them against herself in the mirror one at a time, frowning at the result. <em>Too dressy. I feel like an expensive call-girl.</em> They go back into the closet, and she pulls out a simple pair of leggings and a tank top instead. <em>Ugh. Now I look like I’m going to the gym.</em></p>\n<p>In all honesty, she has no idea why she cares so much. She’s been telling herself all week that she has no intention of actually sleeping with this woman – who, in her opinion, agreed to this strange liaison alarmingly quickly – so in theory, she could wear her pyjamas and it wouldn’t matter. But instead, she’s been trying and eliminating outfits for 45 minutes. After spending over an hour showering and styling her hair to be silky and straight, another 20 applying and re-applying makeup, and a full hour and a half getting waxed earlier today.</p>\n<p>But she <em>isn’t</em> going to sleep with her, so it doesn’t matter.</p>\n<p>Finally she decides on jeans and a soft purple sweater – the kind of thing that she’d wear to hang out with Sam. If she’s going to have an awkward makeout-session-turned-rejection with Sam’s girlfriend’s younger sister (god knows that’s a tangled web she’s already regretting getting herself into), she might as well be wearing comfortable clothes.</p>\n<p>If she decides to throw on her nicest pair of matching lace underwear last-minute, that’s her business. It’s not like anyone is going to see them. It's just a confidence thing.</p>\n<p>She applies her light perfume, touches up her lipstick, and, on a whim, cuts her fingernails. About halfway through it she stops, wondering why on earth the idea came over her, but she keeps going – she might as well finish – and files them for good measure. Finally, she’s left pacing her kitchen as the clock slowly ticks towards 7:00.</p>\n<p>At exactly 6:52 her intercom buzzes, and she rushes over to it, her heart pounding.</p>\n<p>“Yes?”</p>\n<p>“Miss Luthor, I have a Miss Danvers waiting for you?”</p>\n<p>“Send her up, please.”</p>\n<p>The two-minute wait while her not-quite-date makes her way from the lobby to Lena’s apartment is excruciating, and no matter how many times Lena tells herself that she has no reason to care, she still fusses with her hair in the mirror while she waits. Finally there’s a decisive knock, and she has to clutch the edge of her kitchen island to rein in the impulse to run to the door.</p>\n<p>She walks there slowly instead, her heels clacking on the shiny hardwood floor, and takes a fortifying breath as she puts her hand on the doorknob. When she opens it, the breath immediately leaves her in a rush.</p>\n<p>She hadn’t been sure exactly what to expect in terms of appearance. When she asked what Kara looked like – purely out of objective curiosity, since her attractiveness doesn’t matter, since Lena won’t be sleeping with her – Sam’s only reply had been ‘<em>really cute, but not as cute as Alex’</em>. Lena figured that Sam was a little biased, but honestly, her under-selling of this woman borders on <em>criminal</em>.</p>\n<p>The woman standing in her doorway is, to put it bluntly, fucking <em>hot</em>. She’s leaning casually against the doorframe, one foot crossed behind the other, with her hands in the pockets of her skinny slacks. She looks sharp without being too dressy – her thick-soled boots are well-worn but not dirty, her polka-dotted shirt is tucked into her belted pants and slightly unbuttoned, and the strap of a small messenger bag crosses her chest. Her hair is long and blonde, loose and simple, and Lena can’t detect any makeup besides a glossy lip balm. If Lena was interested in women, she’d probably be throwing herself at this girl, with her soft-looking lips and her strong shoulders and her enchanting, spicy perfume.</p>\n<p>Not that Lena usually notices things like that. Since Kara is the only thing to look at, it’s natural for Lena to pick out her features. And stare at them. And feel her heartbeat start to race.</p>\n<p>As if she can hear it too, Kara grins, holding out a hand. Lena’s heart skips another beat at the way the sunny smile makes her eyes crinkle at the edges.</p>\n<p>“Hey! I’m Kara.”</p>\n<p>“Lena,” she manages, as Kara takes her hand in a warm shake. “You’re early.”</p>\n<p>“I usually am,” Kara says easily, pushing herself off the doorframe and rubbing her hands together. “I had some pretty good motivation today.”</p>\n<p>Lena flushes, clearing her throat. <em>Get a grip. This is just to get Sam off my back.</em></p>\n<p>“Would you like to come inside?” Lena asks, opening the door wider and inviting Kara in. She has several bottles of wine, two types of beer, and a selection of whiskeys at the ready, to cover all her hostess bases. Even if it doesn’t work out, she wants to be able to offer Kara something.</p>\n<p>“Actually, I thought maybe we could go out first? I figured that meeting and then getting right down to it would be a little…impersonal,” Kara suggests, staying put in the hallway. Lena blinks, struggling to adjust to the new suggestion. Her first instinct is to say no, to insist that Kara just coming inside and having a drink and getting right to it is so much easier, but there’s a hopefulness in Kara’s face that she doesn’t have the heart to douse just yet.</p>\n<p>“Sure. Just let me grab my coat.”</p>\n<p>When they exit the building Lena looks around, wondering what Kara drives, but Kara just holds out an arm.</p>\n<p>“The place is just a few streets away. I figured we could walk, if that’s okay with you?”</p>\n<p>Surprised again, Lena nods, slipping her arm into Kara’s and heading towards the nearby intersection. They make small talk for a few streets – Lena reveals that she hasn’t actually met Alex yet, and Kara laughs, assuring her that she’s only met Sam twice so far.</p>\n<p>“I was surprised when she texted me. And I have to say, the picture Sam sent me did <em>not</em> prepare me for how beautiful you are in real life.”</p>\n<p>Lena lets out an embarrassing sound, somewhere between a laugh and a snort. “That’s, um. Very sweet.”</p>\n<p>“It’s the truth.” Kara’s clear blue eyes meet Lena’s, and her expression is so genuine that Lena has to look away.</p>\n<p>“I wasn’t exactly prepared for you, either,” Lena finds herself saying, and Kara grins, squeezing her arm lightly.</p>\n<p>\n<em>Oh my god, am I flirting? </em>\n</p>\n<p>Before she can fully investigate that strange revelation, Kara is guiding her towards a half-hidden streetside door and into a cozy-looking bar. Kara doesn’t bother to wait for a server to acknowledge them – she just grabs two menus and waves at the bartender, a tall barrel-chested man with a stoic expression, pointing to her left.</p>\n<p>“Hey, J’onn! Window seat taken?”</p>\n<p>“It’s all yours,” he nods, cracking a smile. Lena follows Kara to their table, trying to hide her smile as Kara pulls her chair out for her. A short woman with a curly brown bob yells from across the room, already starting to fill a pint glass from one of the beer taps.</p>\n<p>“Hey, Kara! I’ll bring your usual in just a minute. Who’s your pretty friend?” she says with a wink, and Kara blushes, rubbing her neck. Kara waves back, and hands Lena a menu. She herself doesn’t look at one – Lena can assume that whatever she usually orders is on the way.</p>\n<p>“Do you come here often?” Lena jokes, as yet another server waves hello at Kara. She laughs, the sound making Lena’s chest flutter. <em>What the hell is going on today?</em></p>\n<p>“Yeah, this is my favourite bar. Alex and I practically live here. It’s pretty lucky that you live so close by!”</p>\n<p>The female server turns up with Kara’s beer, interrupting their conversation, and Lena finds herself slightly irritated. As much as she had doubted this was a good idea, she’d been enjoying listening to Kara talk.</p>\n<p>The waitress redeems herself slightly with a friendly smile, holding her hand out for Lena to shake. “Since Kara is clearly not going to introduce us, I’m Lucy. Has she told you the ridiculous amount of money she spends here yet? You might run for the hills.”</p>\n<p>Lena chuckles, and Kara just shrugs good-naturedly. She orders a gin and tonic for herself, and on Lucy’s recommendations, they order a few appetizers to share.</p>\n<p>“Kara’s special potstickers are on the way, but she never shares those,” Lucy jokes, leaving them to make Lena’s drink.</p>\n<p>“I do so! I let Alex have one last week!” Kara calls after her, indignant. Lucy just waves her off, and Kara finally settles in her seat, leaning back and grinning. As the drinks and food start to come, Lena hardly notices the time passing – the conversation flows easily between them, and the two gin and tonics make her feel relaxed, but not quite tipsy. When they finally leave (Kara insisting on paying the tab, since she suggested going out in the first place), Lena doesn’t even bother to correct Lucy when she tells them to enjoy the rest of their ‘date’.</p>\n<p>The part of her brain that spent the last few days in a whirlwind of panic and self-justification seems to have finally shut down, and she finds herself simply enjoying Kara’s company. They walk back to Lena’s building arm in arm, their shoulders brushing and Lena surreptitiously enjoying the flex of Kara’s biceps, and it seems like only a few seconds before they’re standing in front of the lobby doors. Kara steps back slightly, leaving a respectable distance between them, and Lena misses her warmth immediately.</p>\n<p>“Listen, Lena – I’ve had a really good time so far. I think you’re kind of incredible, actually.”</p>\n<p>Lena blushes, and Kara continues. “But I know this is probably sort of a weird night for you. So if you want me to go now, I will. We had a nice night, and we can leave it at that.”</p>\n<p>Lena swallows. Kara – sweet, concerned, conscientious Kara – is giving her the perfect out. A way to avoid any awkwardness, and even be able to keep up some kind of friendship. She really has had a great time so far, and it’s been a long time since she felt this kind of easy interaction with anyone but Sam. She isn’t exactly swimming in friends, and it’s not like this is going to go anywhere, since she’s not gay. She should take it.</p>\n<p>She opens her mouth to do so, but what comes out is the opposite, in a surprisingly confident voice that she hardly recognizes.</p>\n<p>“Do you want to come upstairs for a drink?”</p>\n<p>After a pause, Kara grins brilliantly, and nods.</p>\n<p>“I’d love that.”</p>\n<p>She holds out an arm and Lena takes it, leading them past the doorman and into the elevators.</p>\n<p>The ride up to her floor seems longer than usual – her arm is still looped through Kara’s, but the contact suddenly seems closer than it did before. She can smell Kara’s perfume – <em>is it cologne? Whatever it is, it smells amazing – </em>and she’s hyperaware of the softness of skin where her fingers brush Kara’s wrist. Her hands shake slightly as she turns the key and ushers Kara inside, and she’s grateful that the blonde seems to get distracted by the floor-to-ceiling windows facing the city skyline in her living room – it gives her the opportunity to take a few deep breaths.</p>\n<p>\n<em>Just because she’s up here doesn’t mean anything is going to happen. We can just have a drink, maybe kiss for a minute to prove I’m not into her. Maybe a bit of grinding on the couch. That’s it –</em>\n</p>\n<p>“This is a gorgeous view,” Kara interrupts her musing, silhouetted by the glow of the surrounding buildings.</p>\n<p>“It’s why I took the apartment,” Lena admits, handing Kara a beer and sipping her own scotch. Kara nods, taking a slow drink and then setting her bottle down on the table. She turns to Lena, a small smile on her face. Lena fidgets with her glass under the intense gaze.</p>\n<p>“You’re not going to say something corny like ‘this view is better’, are you?” Lena jokes, trying to deflect her own nervousness. Kara just smiles, moving closer.</p>\n<p>“I wasn’t, but it’s true.”</p>\n<p>\n<em>Walked right into that one.</em>\n</p>\n<p>Kara moves closer again and Lena swallows, her hand clutching her glass like a lifeline. Gently Kara eases it from her grasp, setting it next to her bottle on the table. Her body feels foreign to her – her hands feel jumpy, like she wants to grab onto something, and there’s a low throbbing starting up between her legs that only seems to make the tightness in her belly worse. Somehow, Kara standing close to her and staring at her <em>like that</em> is doing something uniquely physical to her body, and she isn’t sure that she wants to open the Pandora’s box of investigating why that is.</p>\n<p>“If you want to stop, please tell me,” Kara murmurs, putting a soft hand on Lena’s hip. “If I do anything wrong, or you’re feeling uncomfortable, or if –“</p>\n<p>Lena is almost as surprised as Kara is when she cuts the speech off with a kiss.</p>\n<p>She isn’t sure why she did it – at the time, she’d been watching Kara’s mouth and thinking about how soft it looked. Kara was being so considerate, and through Lena’s head like a mantra was the phrase <em>get it over with, just get it over with</em> – and then they’re kissing, and everything goes blank.</p>\n<p>Kara freezes for a moment, her hands hovering a few inches from Lena’s waist – but as Lena relaxes into the embrace, so does she, and she slides them over Lena’s hips to pull them closer together. The kiss is chaste at first, just a pressing of closed lips, with Lena’s hands curled into the collar of Kara’s shirt; but as they both relax, their mouths separating for a moment, it eases into something more intimate. Lena can feel the places where their lips cling together, lipstick melding with gloss, and Kara’s breath washes over her mouth and all her nervous thoughts and denials disappear. Her hands slide to rest against Kara’s skin, one on her neck and the other slipping under her shirt to spread out over her breastbone, and she can feel Kara’s pulse hammering almost as hard as her own. All she can think about is leaning forward again.</p>\n<p>Kara does it for her, in the end. One hand slides against her lower back, slipping under her shirt to touch the heated skin underneath, and Lena gasps at the sparks that rush through her at such a simple touch. The gasp means that her mouth is slightly open as their lips meet again, and Kara’s tongue swipes over her lower lip and her teeth follow to scrape gently over the sensitive skin and <em>sweet <strong>fuck</strong>, is this what kissing is supposed to feel like?</em></p>\n<p>Following Kara’s lead she tilts her head and slides her tongue briefly along Kara’s and god, she can feel it <em>everywhere</em>. The hand on her lower back slides up and up until it slips under her bra strap and then back down, without even trying to unclip her bra like she’s used to men doing, and it’s like a trail of fire – her heart is pounding and her clit is throbbing like it never has before and Kara’s tongue is doing something in her mouth that feels fucking incredible. She’s spent hours kissing men and never felt anything close to what 45 seconds of contact with Kara has done to her.</p>\n<p>Kara gently scrapes short nails over her back and she whimpers, arching into the sensation. There’s a jolt as her chest rubs against Kara’s – <em>god, my nipples are hard, I can <strong>feel</strong> her</em> – and then in a whirlwind few seconds she’s on her back on the couch, Kara suspended over her on flexing arms.</p>\n<p>“Is this okay? Are you -“ Kara starts, lifting herself up so that she isn’t pinning Lena to the cushions. In response, Lena spreads her legs wide and hooks one over Kara’s hip, pulling her flush and arching.</p>\n<p>“Shh, shh. Just kiss me.”</p>\n<p>Let it not be said that Kara can’t follow instructions. Immediately her weight is on Lena, pressing her into the couch as their lips connect again with hot, open-mouthed kisses. Lena pants into her mouth as Kara grinds her hips slowly forward, sending white-hot jolts up Lena’s spine. This is all so new, there’s a pressure building in her abdomen that she can’t explain, she feels like she’s climbing towards an unfamiliar peak and she has no idea how to get there. All she can do is cling to Kara and let it sweep her away.</p>\n<p>“Do you want to go to the bedroom?” Kara whispers, biting at Lena’s neck and making her hips jump. She’s always scolded boyfriends for biting too hard or leaving marks, but now she’s arching into the pain – it feels <em>good</em>, it makes her feel hot and dirty and <em>wet</em> and she wants proof of this crazy, incredible feeling on her body after this is over.</p>\n<p><em>Do you want to go to the bedroom? </em>The words hit her fully, and they go straight between her thighs. She imagines Kara pressing her into her white sheets, both of them naked, Kara’s bare thigh slipping between her own -</p>\n<p>\n<em>God, I do. I want her to fuck me.</em>\n</p>\n<p>The voice that’s existed in the back of her head since she can remember - the one that’s always justified every second look at a woman as admiration or jealousy, the one that encouraged her to pursue boys who made her feel nothing, the one that almost convinced her to cancel this ridiculous, amazing date – for the first time in her life, it’s quiet. There’s just Kara, her mouth hot and wet against Lena’s neck and her hips rocking rhythmically and her sweet, light cologne making Lena’s chest flutter.</p>\n<p>“Yes,” Lena breathes, closing her eyes and giving in. <em>“Yes.”</em></p>\n<p>Kara’s legs brace against the ground and a hand slips under Lena’s ass and then she’s straddling Kara, her hips spread wide over Kara’s thighs. She feels remarkably light, but even so, she gasps when Kara stands up and takes Lena with her. She wraps her legs around Kara’s hips instinctively, Kara’s hands hooking under her thighs to hold her up – <em>Jack always said I was too heavy, how is she</em> – but Kara carries her towards the hallway easily, continuing her assault on Lena’s neck and jaw as she goes.</p>\n<p>“Which door?” Kara pants, pressing Lena against a wall. A framed picture falls and Lena hears a crack, but it’s the last thing on her mind – Kara has braced her knee against the wall to help hold her up, and her taut thigh is proving the perfect surface for her to <em>rub</em> –</p>\n<p>“End of the hall,” Lena manages, and Kara picks her up again, shouldering the door open. She doesn’t spare a glance for Lena’s well-decorated bedroom or the huge windows on the opposite wall overlooking the bay – she just presses Lena into the soft duvet, and Lena weaves her fingers into blonde hair and pulls their lips together for another messy kiss. It falls like a curtain around them, blocking out the rest of the world.</p>\n<p>Throwing caution to the wind, she starts undoing the buttons of Kara’s shirt with shockingly steady hands. When it hangs open she slides her hands under it to grasp Kara’s back, feeling the muscle shift as Kara works to free her arms. Lena watches as she removes her belt as well, her abs flexing. She starts on the button of her pants, but stops to look up at Lena – her gaze is questioning, and Lena acknowledges it as a request for permission.</p>\n<p>It’s the first time she’s slowed down to really consider what she’s doing since they started kissing. She takes stock of herself – her sweater is rucked up over her stomach, her hair is probably a mess, and she can tell that her neck is already a landscape of reddish marks. She’s so wet that she can feel her underwear clinging to her, she can feel it on her inner thighs as they rub together. For the first time, the lubricant she keeps in the bedside drawer is completely unnecessary.</p>\n<p>Lena is turned on. Almost painfully so, her clit throbbing and her nipples almost chafing against her bra. She’s finally close to whatever it is people always rave about when it comes to sex, and she can’t fathom stopping.</p>\n<p>She nods slowly, biting her lip, and Kara pulls her sports bra off and throws it to the floor. Lena only gets a few moments to admire her – she’s all lean muscle and smooth skin and boxer briefs, but Lena can see a jagged scar that runs over her chest and ribs – before Kara is on her again, kissing and nipping at Lena’s stomach and undoing her jeans.</p>\n<p>The sheer awe on Kara’s face as she removes the layers of Lena’s clothing is almost enough to quell her usual anxiety at being naked with another person. Kara strips her quickly but, somehow, it’s incredibly erotic to watch her smooth her hands and lips reverently over the revealed skin. She spends a few minutes lavishing attention on Lena’s nipples, sucking indulgently until Lena is squirming and spreading her legs even wider. She squeezes Lena’s thighs and nuzzles the soft swell of her belly, making her smile, and Lena just threads her fingers through Kara’s hair, scratching gently at her scalp and letting her explore.</p>\n<p>Somehow, she feels more comfortable with Kara after three hours than she ever has with long-term boyfriends.</p>\n<p>Eventually Kara seems to settle between Lena’s legs, kiss-swollen lips trailing over the soaked material of Lena’s panties.</p>\n<p>“Kara – you don’t have to. That never really works for me, so don’t bother –“</p>\n<p>Kara just grins, sliding the fabric down Lena’s legs and tossing it aside. “Do you mind if I try?”</p>\n<p>“I – no, I guess not. I just, you don’t have to.”</p>\n<p>“I want to,” Kara counters, kissing Lena’s inner thighs. “I like it. I want to taste you. If that's okay.”</p>\n<p>Lena feels herself clench at that. <em>She likes it. She wants to. </em>Her exes had always acted like it was a chore, and gotten frustrated when their sloppy efforts hadn’t yielded results. Kara, at least, seems like she’ll enjoy herself even if Lena doesn’t come.</p>\n<p>“…okay.”</p>\n<p>Kara shifts forward, her shoulders guiding Lena’s legs further apart, and gets to work.</p>\n<p>The first few passes feel nicer than usual - Kara’s tongue is gentle and exploratory, rather than forceful – but like always, there’s no jolt. No toe-curling pleasure, like she knows there’s supposed to be. Her heart sinks.</p>\n<p>\n<em>I guess it’s official. I’m just broken. </em>\n</p>\n<p>Just as she’s about to ask Kara to stop, her tongue slides upwards and Lena feels it. It’s only a moment, but it’s there – the same deep pull as before, when Kara was grinding their hips together, but concentrated. It zips through her like lightning, and her hips jump.</p>\n<p>\n<em>“Fuck!” </em>\n</p>\n<p>Between her legs, Kara grins.</p>\n<p>“There it is,” she murmurs, and with that she hooks her hands under Lena’s thighs and dives back in.</p>\n<p>Like a switch has been flipped, Kara locates whatever magic button made Lena feel that way and makes it <em>dance</em>. Lena’s hips buck so violently that Kara has to sling an arm over her hipbones and hold her down, but Lena can’t comprehend making her body stay still – she’s full of it, this lightning feeling, and she needs <em>more</em>. Her hand clenches hard in Kara’s hair, her heels dig into her back, and she can’t stop the stream of desperate words spilling from her mouth.</p>\n<p>“God – Kara, fuck, what are you <em>doing</em>, that’s so – that’s so good, you’re so <em>good</em>, don’t stop, don’t stop, <em>don’t stop</em> -“</p>\n<p>Why Kara might stop she has no idea, but the idea is unacceptable. The distinctly tight, coiled feeling from earlier is back with a vengeance, and she can feel herself on the edge of <em>something</em> – it’s right there, within reach, and she wants it.</p>\n<p>“Let go, baby, just let go - I want you to come,” Kara rasps, and the pet name makes her heat up even more – and then Kara lowers her mouth again she swirls her tongue and then <em>sucks</em>, and the pressure is so good, <em>it’s so good</em> –</p>\n<p>Just like that, Lena flies over the edge of that unknown cliff and into <em>everything</em>.</p>\n<p>The pressure in her belly breaks, and her toes curl as she cries out wordlessly. It’s incredible, it’s mindblowing, it’s <em>perfect</em> – it’s like pure relief condensed into a physical feeling. It rushes through her like a tsunami, crashing in waves as Kara’s tongue softens its attention and guides her through. She can hear high, needy cries echoing through the quiet of her apartment, and it’s only when the waves start to ease that she realizes that her throat is hoarse. Her thighs shake uncontrollably on Kara’s shoulders, and as her comprehension slowly returns to her, she wonders how on earth she lived so long without this.</p>\n<p>Kara finally abandons her still-pulsing clit and climbs up to Lena’s level, and Lena pulls her in for a hard kiss – Kara’s face is still slick, and she tastes strange but undeniably <em>good</em>. She never would have considered kissing her own come from another woman’s face a turn-on before tonight, but as she sinks her teeth into Kara’s lower lip, she feels a long-ignored part of herself opening up. She’s still high on her first orgasm, naked and spread open under an incredibly hot woman with her own come smeared on her face from their deep kisses, and she already wants more.</p>\n<p>Like she can read Lena’s mind, Kara pulls back slightly and wiggles her hips between Lena’s, pressing gently.</p>\n<p>“Can you go again?” Kara asks, grinning, and it’s like Lena never came – she’s desperate and wanting again, and she nods frantically.</p>\n<p>“Yes, godpleaseyes.”</p>\n<p>Kara’s hand slides between their bodies, and Lena is guiding her fingers inside before Kara can even ask for permission. Like oral, fingering has never done anything for her – it’s always felt token, like her partners were just getting it out of the way before the ‘good part’ – but, like oral, she’s eager for Kara to prove her wrong.</p>\n<p>Kara fucks her with two fingers, and then three, and when she slips her thumb upwards and uses her hips to grind it into Lena’s clit she starts to feel that pressure building again even stronger than before. Kara is doing something with her fingertips – rather than just fucking her she’s curling and probing on every thrust, like she’s looking for something. Finally, she presses <em>just so </em>and in seconds Lena skyrockets from a 7 to an 11 – Kara grins victoriously, braces herself on the mattress, and fucks into the spot in earnest, and in seconds Lena’s vision whites out as she comes all over Kara’s hand with a surprised cry.</p>\n<p>Lena is just starting to recover when Kara starts kissing her way down her body again, murmuring all the way in a surprisingly shaky voice.</p>\n<p>“You‘re so – you’re so fucking beautiful, god, Lena –“</p>\n<p>Kara buries her face between Lena’s thighs again, sucking her clit like it’s her last meal, and shoves her free hand into her own boxers. Lena, unable to do anything but spread her legs and cling to Kara’s shoulders for dear life, has to slap a hand over her own mouth to muffle the noises that follow. When Lena comes in her mouth, Kara groans almost as loudly as Lena does while her fingers work frantically over her own clit.</p>\n<p>Lena can’t think – she can barely even breathe. Three times in one night, and as soon as the last orgasm eases she’s craving more. It’s almost decadent, having the sharpness of her newfound desire taken care of so quickly and with such obvious enthusiasm.</p>\n<p>Kara comes back up again, kissing her hard and messy, and Lena whimpers at her next words.</p>\n<p>“God, I don't want to stop - I wanna fuck you again. Can I try something?”</p>\n<p>\n<em>She’s going to kill me. This is how I die.</em>\n</p>\n<p>“You can do anything you want to me, just make me come again –“ Lena gasps, and Kara springs up from the bed and roots around in her messenger bag. Lena exhales shakily, overcome with a strange urge to laugh.</p>\n<p>“Okay, I wasn’t expecting you to <em>leave</em>.”</p>\n<p>Kara just grins, pulling something out of the bag. It’s a mess of black straps, attached to a small piece of leather with a metal ring –</p>\n<p>Oh<em>.</em></p>\n<p>“I figured you wouldn’t have one,” Kara says, holding up her other hand – a fair-sized purple dildo, with a flat base to secure it to the harness.</p>\n<p>\n<em>Fuck.</em>\n</p>\n<p>“You were right about that,” Lena breathes, and Kara slips off her boxer briefs before stepping into the straps, tightening them around her hips and slipping the toy into the ring. It looks almost silly – a big purple dildo sticking straight out of Kara’s narrow hips – but then Kara is crawling up the bed to settle between Lena’s hips and the toy drags sinfully against her clit and suddenly the silliness ebbs away.</p>\n<p>It’s gone completely a few minutes later, when Kara has both hands on Lena’s hips and her thrusts are slamming the headboard into the wall. Lena finds her own clit for the first time at Kara’s instruction, and she chokes off a scream as she rubs herself into the most intense orgasm yet. She’s fairly sure that it isn’t possible to come any harder – at least, she’s sure until Kara flips her over and she’s taking all 6 inches from behind, biting the pillow as Kara’s fingers hone in on her most sensitive spots like a magnet.</p>\n<p>Finally, Lena tries to tap out.</p>\n<p>“I can’t – I can’t go again, it’s not possible –“ It’s overwhelming, all these new sensations, and Lena feels like she’s entered a whole new world of possibility with how Kara guides her body into pleasure. Her experience with sex before this had been to wait until the man she was with had his requisite single orgasm and then try to get on with her night - she has no idea how much her body can actually take. </p>\n<p>But Kara pulls her close, nipping at her ear and encouraging her in a low voice.</p>\n<p>“I think you can. Can I try?”</p>\n<p>Lena acquiesces enthusiastically, eager to see Kara live up to her word. Twice more, in fact, bringing the final tally up to 7 by the time she blinks herself back into awareness. She’s tingly and slightly numb below the waist, and every muscle in her body feels relaxed and satisfied.</p>\n<p>\n<em>Okay. Maybe I'm a little bit gay.</em>\n</p>\n<p>Kara, still breathing hard, eases the straps of the harness down her legs and throws it in the direction of her bag.</p>\n<p>“Wow,” Lena says, still working on getting her legs to stop shaking. “So…that’s what that’s supposed to feel like.”</p>\n<p>Kara laughs, clutching her abs and wincing. “Ow. God, I think you broke me.”</p>\n<p>“<em>I</em> broke <em>you</em>?” Lena asks incredulously, gesturing downwards. “I can’t feel anything below my hips!”</p>\n<p>“All in a day’s work,” Kara winks, and Lena rolls her eyes at the faux-cockiness. Lena settles back down and looks up at the ceiling, and Kara’s face grows more serious.</p>\n<p>“Do you need me to go?” Kara asks, no hesitation in her voice. “I get it if you need some time alone.”</p>\n<p>“Is that okay?” Lena asks hesitantly. She doesn’t want Kara to feel like she’s being thrown out, but she really does need some time to think about the strange turn her life has taken in the last few hours.</p>\n<p>“Of course it is. I like you, Lena. I want you to be comfortable.” Kara’s smile is easy, and she rolls out of bed, pulling her discarded pants back on. Lena watches her re-dress, leaving her shirt untucked and her hair mussed, not moving from her spread-out position on the bed. To be honest, she isn’t entirely sure she could get up if she tried.</p>\n<p>“I’ll find my way out. Text me, if you feel up to it – I’d really love to see you again.” Kara runs her fingers through her messy hair, looking around to make sure she hasn’t forgotten anything – and then with a surprisingly slow, heartfelt goodbye kiss, Kara is gone. Lena hears the soft click of the door closing as she leaves the apartment, and it feels surprisingly lonely all of a sudden.</p>\n<p>For a few minutes Lena just lies in bed, still naked and deliciously sore. She should be thinking through the events of the night – she <em>knows</em> she should – but instead she just smiles, turns over, hugs the nearest pillow, and falls into a stress-free sleep.</p>\n<p> </p>\n<p> </p>\n<p>Lena wakes up the next morning feeling alarmingly cheerful. Strangely, her first thoughts are somewhere along the lines of ‘today will be a good day’ – something she hasn’t thought in months, as she’s been working more or less around the clock during this acquisition. She has to go into work today, in fact, but the happy bubble doesn’t burst even as she gets into her car and heads to the office.</p>\n<p>While the driver eases them into rush hour traffic opens her messages with Sam, reading the last one sent – it’s from Sam, dated 11:56pm last night.</p>\n<p>\n<strong>[Sam]: So, am I getting an ‘I told you so’ text?</strong>\n</p>\n<p>Lena hesitates with her answer, typing and re-typing until she finally just hits send.</p>\n<p>\n<strong>[Lena]: Is lesbian sex always that good?</strong>\n</p>\n<p>Seconds later, her phone vibrates, and she snorts as she reads the message.</p>\n<p>\n<strong>[Sam]: IT ABSOLUTELY IS!!! AND ALSO HOW WAS IT, TELL ME EVERYTHING</strong>\n</p>\n<p>\n<strong>[Lena]: It was incredible, not that you need to know that. </strong>\n</p>\n<p>The speech bubble pops up immediately, and Lena smiles. She normally isn’t prone to talking about such intensely private things, but she’s bursting at the seams to talk to <em>someone </em>about her experience last night, if only to figure out how <em>she</em> feels about it. She tells Sam more or less everything – she leaves out the specifics, but includes the number of orgasms and Kara’s unquestionable skill in bed – and in response, Sam sends one message.</p>\n<p>\n<strong>[Sam]: That’s my girl!!!!!!!</strong>\n</p>\n<p>Lena isn’t sure whether Sam is referring to her, or to Kara. Either way, she gets sidetracked when the car arrives at L-Corp, sweeping her up into morning meetings.</p>\n<p>Through each of them she manages to focus, but every time there’s a lull, her mind slips back to last night. How Kara felt, so warm and solid on top of her; Kara’s tongue on her clit, bringing forth the electric feeling that she’s chased her whole life with just a few strokes; Kara behind her, one hand in her hair and the other on her hip, telling her to come. More than once she has to excuse herself to dab cold water on her face in her private bathroom, waiting for the arousal to subside.</p>\n<p>By lunchtime, she’s practically twitching.</p>\n<p>Finally she gives in, and pulls out her phone. Sam had put Kara's number in there before they even had their date, and now she's staring at her contact entry like it holds the secrets of the universe.<em> </em></p>\n<p>\n<em>I should just text her. She said she wanted me to. </em>\n</p>\n<p>After 5 full minutes of deliberation, she settles on the most neutral greeting possible.</p>\n<p>\n<strong>[Lena]: Hey.</strong>\n</p>\n<p>She puts the phone face-down on her desk and tries to get back to work, but it taunts her – she moves it to a desk drawer, and finally she’s about to shove it into her purse when it vibrates. She almost drops it in her haste to check the message.</p>\n<p>\n<strong>[Kara]: You need it again already huh?</strong>\n</p>\n<p>Lena’s entire body flushes. She huffs, throwing the phone into her purse and then immediately digging it out again to glare at the message. Before she can concoct the perfect rant to send back, another message comes in.</p>\n<p>\n<strong>[Kara]: Sorry, I was joking! I’m realizing you don’t know me that well, and sarcasm doesn’t come across in text. I’m really glad you messaged me</strong>\n</p>\n<p>Lena deflates immediately, slightly embarrassed at her reaction. She taps out a reply, sending it before she can second guess herself.</p>\n<p>\n<strong>[Lena]: Well, since my intention was to invite you over tonight, you weren’t exactly wrong.</strong>\n</p>\n<p>After a few seconds, the text bubble pops up again, and the next message comes through. It makes Lena laugh genuinely, and through the glass of her door she can see her secretary look up from her work, startled at the unfamiliar sound.</p>\n<p>\n<strong>[Kara]: …can we get food after? </strong>\n</p>\n<p>Lena leaves work early for the first time in months so that she can wash her sheets and get into comfortable, easy-to-remove clothes – by the time Kara knocks on her door, she’s almost vibrating.</p>\n<p>She opens the door, and before Kara can open her mouth Lena’s pulling her in by her skinny tie, slamming the door and pressing herself fully to the length of Kara’s body. She pulls her gradually down the hallway, refusing to let their lips separate, and a few orgasms later Kara is almost as sated as she is – as inexperienced as she might be, Lena is nothing if not a fast learner. They order pizza and Kara puts on Lena’s tiny silk robe to pay the delivery guy, bringing it back to the bedroom so they can eat it in bed. Kara tells her about Alex, about being adopted by the Danvers, and Lena opens up a bit about her own family issues. They talk about favourite movies (The Little Mermaid for Kara, Star Wars for Lena), Lena’s friendship with Sam, and each of their careers.</p>\n<p>When only a few crusts remain in the box, Kara sets it on the bedside table and tugs Lena close to her again with a grin. She kisses her deeply, and Lena feels the pull – she’s sure that at some point it must run out, but it shows no sign of stopping so far.</p>\n<p>“I taste like pepperoni,” Lena argues weakly, already moving her hips against Kara’s.</p>\n<p>“That’s my favourite food.”</p>\n<p>“How do you do that?” Lena asks later, sweaty and trembling as Kara flops onto her back and stretches out, cracking her knuckles. “I’ve never – I didn’t think I could feel that way. I thought I was just…built wrong.”</p>\n<p>“You’re not built wrong,” Kara says, frowning. She wiggles until her front is flush with Lena’s side, propping herself up on an elbow and tracing soft patterns on her stomach. “Who told you that? Besides, you just have a small clit. It wasn’t that hard to find. Whoever made you feel that way is clearly just shitty in bed.”</p>\n<p>Unexpectedly, Lena feels hot tears welling in her eyes at the validation. Mortified, she shuts them immediately but despite her efforts they manage to escape anyways, sliding down her temples and into her hair. <em>God, stop it, stop crying –</em></p>\n<p>“Are you okay?” Kara asks softly, her warm hand splaying out protectively over Lena’s ribs. The light, comforting pressure and the lack of judgement in Kara’s tone release something in Lena’s chest, and before she can stop herself she’s crying – full, hot tears spill out, and her breath comes in short sobs. Immediately Kara pulls her close, and Lena buries her face into her neck.</p>\n<p>“Hey, it’s okay. It’s okay. You’re perfect, Lena. You’re <em>so</em> perfect,” Kara murmurs into her hair, and Lena takes a ragged breath. She isn’t sad – the opposite, in fact. She feels happy and <em>free</em>, like something long-caged has escaped her chest. A weight has been lifted – <em>I’m not broken, I’m fine, Kara likes me, I’m not broken</em> – and the relief hits her hard. Last night she’d been too overwhelmed to acknowledge it, but now it’s clear – whatever this is, it’s <em>right.</em></p>\n<p>Finally her tears subside, and Kara rubs soothing circles on her back.</p>\n<p>“You okay?” Kara murmurs, and Lena manages a watery laugh.</p>\n<p>“Yeah, I am. Probably for the first time in my life,” she sniffs, leaving the safe haven of Kara’s shoulder to grab a Kleenex from her bedside table. “God, I’m gross. I’m sorry.”</p>\n<p>Kara chuckles, grabbing a tissue for herself and drying her shoulder off. “It’s okay – you’re cute.”</p>\n<p>After she wipes her face Lena flops onto her back, staring up at the ceiling and trying to get used to the new world that’s opened up in front of her. Kara waits quietly, watching her with fondness, and Lena feels a deep ache in her chest. She likes Kara. She wants to try…whatever this is, and judging by the look on her face, Kara might too.</p>\n<p>“I’m a mess,” Lena states plainly, starting to fidget. Her fingers rub over the palm of her opposite hand over and over as she offers what little she can to Kara. “I work all the time, and I only have one friend. I’ve never had a successful relationship.”</p>\n<p>“Is this supposed to scare me off?” Kara grins, dropping kisses onto Lena’s shoulder.</p>\n<p>“Yes,” Lena deadpans, and Kara just laughs.</p>\n<p>“Well, it isn’t working.”</p>\n<p>“I just figured out I might be gay yesterday,” Lena argues.</p>\n<p>“It’s a journey, you’ll need my help to navigate it.”</p>\n<p>“I’ve barely even touched you yet. I might be terrible at it.”</p>\n<p>“I’m happy to tutor you. Something tells me you’re not terrible at anything.”</p>\n<p>“My mother is the devil incarnate,” Lena says, fighting off a grin.</p>\n<p>“Clearly you’re nothing alike.”</p>\n<p>Kara bumps their foreheads together, and Lena sighs. “Is there anything that could scare you off?”</p>\n<p>Kara grins, shrugging. “Nope. I like you. I’m pretty stubborn.” She kisses Lena’s nose, and finally, Lena smiles.</p>\n<p>“Fine. Since you’re so convinced - you mentioned something about tutoring?”</p>\n<p>Later that night, Sam gets a gift basket delivered to her door. When she reads the note she dissolves into laughter, and Alex approaches from the hallway, looking confused.</p>\n<p>“What is it?”</p>\n<p>Wordlessly, Sam hands her the label. On a solitary piece of cardstock is a rainbow sticker, and six words:</p>\n<p>\n<strong> <em>“I hate it when you’re right.”</em> </strong>\n</p>"
}