{
  "id": "1439476",
  "url": "https://archiveofourown.org/works/1439476?view_full_work=true",
  "author": [
    "Faith Wood (faithwood)"
  ],
  "title": "An Issue of Consequence",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Harry Potter - J. K. Rowling"
  ],
  "relationships": [
    "Draco Malfoy/Harry Potter"
  ],
  "characters": [
    "Draco Malfoy",
    "Harry Potter",
    "Blaise Zabini",
    "Pansy Parkinson"
  ],
  "additional_tags": [
    "HP: EWE",
    "Hogwarts Eighth Year",
    "Romance",
    "Mystery",
    "Humor",
    "Explicit Sexual Content",
    "Potions"
  ],
  "language": "English",
  "series": "",
  "published": "2014-04-09",
  "completed": "2014-04-15",
  "words": "20,798",
  "chapters": "5/5",
  "comments": "754",
  "kudos": "41,080",
  "bookmarks": "6,992",
  "hits": "639,708",
  "summary": "<p>Draco has woken up in an alternate universe. Or he has woken up utterly insane. Nothing else can possibly explain why Harry Potter suddenly seems to think he's Draco's boyfriend.</p>",
  "notes": "<p>Thank you, pierian, melusinahp and marguerite_26, for the beta. Your corrections and suggestions were beyond helpful. ♥</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">notes</a>.)\n</p>\n<p>Thank you to everyone who read and reviewed! ♥</p>",
  "text": "<p>Draco's feet were unwilling to support his weight. He had to drag them to breakfast, mourning the fact that one didn't have the luxury of leaving their feet behind when they were being useless and uncooperative. As well as one's head, really, as it was clear his head was the main cause of his troubles. A pounding headache made it feel twice as large, and Draco had to go as far as thoroughly inspecting it in the mirror to make sure it was normal-sized. </p>\n<p>It served him right. Who in their right mind studied late on a Saturday night? What was he thinking? He spent far too much time studying. The N.E.W.T.s were still far away, and even though last year had been a blur of fear and pain, he'd learnt more than he realised. If he'd had any say in this, he would have never come back to Hogwarts. But apparently in order to have a future, one must have a good reputation, a good education and loads of gold. He had certainly lost the good reputation, and his father was the one with all the gold, so a good education was all he could aspire to. Nonetheless, the amount of studying he had done in the past several months was simply unnatural. Even his father would think he was exaggerating. </p>\n<p>Well, no. No, he wouldn't.</p>\n<p>Draco scowled and shook off thoughts of his father. They made him uneasy. His father's usual pressuring ways increased tenfold this year. All because the two of them had failed to do what all the Malfoys had managed before them — pick the winning side. Well, fuck that, was all Draco had to say about it. He couldn't fix it by getting an <i>O</i> in Potions. Not that he planned to get anything less than an <i>O</i> in Potions. But fewer headaches and more obedient feet should definitely be a part of his plan.</p>\n<p>It was settled. He was having fun today, and no one was stopping him. It was Sunday, after all, and he deserved a break. All he had to do was decide how best to entertain himself. Quidditch was the obvious choice, but he'd have to find someone to play with. Instead, he might pick a convenient spot for setting up an ambush to throw snowballs at unsuspecting students. He didn't need anyone's help with that.</p>\n<p>Draco felt much better when he walked into the Great Hall, either because of his resolution or because of the sweet scent of food. The Hall was packed with light and colour and chatter and <i>bacon</i>. There was no room for headaches and heavy limbs or the anxious feeling he should be doing something relevant rather than have a moment of peace.</p>\n<p>As he sat down next to Pansy at the Slytherin table, Draco glanced across the Hall out of sheer habit. Potter was in his usual spot, surrounded by his gang of Gryffindors, laughing with Weasley and Granger at something the Weasley girl was saying. Gaze fixed on Potter, Draco filled his plate with bacon and eggs. Potter would have to look his way today because today was a fun day, and winding Potter up was simply the best possible entertainment available. And it was so easy. For example, all Draco had to do was scowl at him, and Potter's eyes would promptly narrow, as though he couldn't believe someone would dare to give him the evil eye after he had saved them all so bravely. But Draco dared and was mighty proud of it.</p>\n<p>Draco felt even more daring today. When Potter finally looked at him, Draco not only scowled, he made a rude gesture in Potter's general direction. Potter's look of confusion was golden. But it only lasted for about two seconds. In the next moment, Potter's lips twitched, as though he were about to smile, and then he <i>winked</i>.</p>\n<p>\"I slept very well, thank you for asking.\"</p>\n<p>Pansy's annoyed voice made Draco look around. \"Right. Good morning,\" he said, distracted. Potter had turned away towards his friends, as though nothing out of the ordinary happened. Draco stared at the back of his head. \"Potter just winked at me.\"</p>\n<p>Pansy gave a huge sigh. \"Oh, don't start.\"</p>\n<p>\"Start what?\"</p>\n<p>\"With the Potter hate. It's too early in the morning for that.\" She glanced around nervously. \"Or at least keep your voice down.\" Pansy did <i>not</i> scowl at Potter these days. She tended either to smile at him, with a shyness of a two-year-old, or to avoid looking at him altogether. Her loss, really.</p>\n<p>\"No, Pansy, you don't understand. He <i>winked</i> at me.\"</p>\n<p>\"Mm-hmm. Which is clearly a sign of him planning to do something horrid to you.\"</p>\n<p>\"Well, maybe.\" Potter didn't look like someone who was making evil plans, though. He was laughing with his friends again, ignoring Draco.</p>\n<p>\"Or you imagined it,\" Pansy went on. \"Or he was winking at someone else, and you're just really self-involved.\" She scowled at her sausage. \"Or maybe he was winking at Blaise.\"</p>\n<p>Draco whipped around to glare suspiciously at Blaise, who was pouring himself some pumpkin juice. \"Why would he be winking at Blaise?\"</p>\n<p>\"Everyone's winking at Blaise.\"</p>\n<p>Blaise must have felt eyes on him because he looked up, smiled, and winked. Draco's cheeks heated up. He was completely charmed for a few seconds, and then he shook his head to snap out of it. He had long suspected that Blaise was actually a Veela. </p>\n<p>\"I see,\" Draco said. \"But I doubt Potter was winking at any of the Slytherins.\"</p>\n<p>\"You're a Slytherin.\"</p>\n<p>\"He was winking at me <i>evilly</i>. There's a difference.\"</p>\n<p>Pansy shook her head and continued to maul her sausage.</p>\n<p>Draco scanned the Hall in search of something else that was amiss. A Hufflepuff boy smiled at him, but Hufflepuffs were strange and smiled too much in general, so that might not have been all that relevant. Everything else seemed normal enough. Perhaps a little too normal. For all he knew, the other three houses might have been planning something, a vicious trick to pull on the Slytherins. Or Draco specifically. He expected it to happen long before this. The entire year had an air of calm before the storm. The Gryffindors were just generally too friendly, in his opinion. Perhaps it was a kind of graciousness only winners could afford.</p>\n<p>As worrying as that thought was, out of the corner of his eye, Draco noticed Pansy pouring something into her pumpkin juice. She downed the whole thing with several large gulps and then let out a happy sigh.</p>\n<p>Draco was more than a little unnerved. \"What was that?\" </p>\n<p>She looked up, blinking. \"What was what?\"</p>\n<p>\"You just put something in your pumpkin juice. A potion or something.\" </p>\n<p>\"So?\" She lifted her chin. \"It's my pumpkin juice. I can put whatever I like in it.\"</p>\n<p>\"But... are you sick or —\"</p>\n<p>\"I'd appreciate it if you didn't pry.\" She seemed quite flustered. \"I'd suggest you worry about Potter's evil plans instead.\"</p>\n<p>\"You told me not to.\"</p>\n<p>\"No, go right ahead. Just do it quietly.\"</p>\n<p>Several Slytherins were already looking their way, and Draco let it slide for now. He poked Pansy in the ribs. \"You need more fun in your life. Come on. Let's go out and play some Quidditch.\" It was a long shot, he was aware. </p>\n<p>\"As if. I have to study. You should come with me to the library instead.\"</p>\n<p>That was, without a doubt, the last thing Draco wanted to hear. For a second, he felt like growling, but he managed to keep his temper in check. \"I'm sick of studying. All I've done for months is study. We should do something fun.\"</p>\n<p>Pansy gave him a withering look. \"I can't afford fun.\"</p>\n<p>Draco sighed. Pansy had the same reputation-education-gold problem he had. Only her father had far less gold than Draco's, so she was probably worse off. It still didn't mean she had to study on a <i>Sunday</i>. </p>\n<p>Just as well. She wasn't any good at Quidditch, anyway. Except neither was Goyle, unless one wanted to be knocked off their broom a lot. Besides, he was still in bed and likely not to wake up before noon. Draco would not be playing Quidditch today, it seemed. Just as he didn't get to play it yesterday.</p>\n<p>Accepting the fact that Pansy would be of no help, Draco quickly finished his breakfast, drank some juice, and escaped the Great Hall. But not before he trapped Pansy's head in his palms, blew in her ear, and said, \"You better not be on drugs you're not sharing.\" She pushed him away with a grimace, and he left her alone.</p>\n<p>Only when he reached the Entrance Hall and looked outside did he notice that the snow had melted overnight. He'd be setting up no snowball-throwing ambushes now. </p>\n<p>Or <i>ever</i>, he realised. He'd be long gone by the time snow covered Hogwarts grounds again. </p>\n<p>It hit him suddenly: three more months and he'd leave the school, its familiar routine and the company of a thousand students forever. Many of them he'd never see again, except in passing. He'd be at home, with his parents, figuring out his future career path, searching for a job. It was likely he'd be trapped in the manor for months, if not longer. This wouldn't have been a problem two years ago, but these days his home was a darker, damper place. </p>\n<p>And here he was, worrying he'd have no one to play Quidditch with today, but that described his future, not just a random Sunday. </p>\n<p>Draco scowled at the loud, laughing Great Hall. On the other hand, this lot was utterly annoying, and he'd finally be free of them. Really, it gave cause for celebration not worry. </p>\n<p>There was at least one fun thing he could always do, and he didn't need anyone to help him. He decided to go back to his dormitory and have a good, long wank.</p>\n<p>He'd already made his way towards the dungeons when he caught movement in the corner of his eye. Potter had exited the Great Hall all by himself, which wouldn't be strange, except Draco couldn't remember the last time he saw Potter wandering about all alone. Normally, friends and admirers surrounded him, and he couldn't make a step without them. It looked like he might have snuck out. Draco felt obligated to investigate the matter.</p>\n<p>He doubled back and hurried after Potter, who had already turned the corner. Left or right, Draco didn't know, but the left corridor led to Gryffindor Tower, so Draco picked that one.</p>\n<p>Potter was nowhere to be seen. He couldn't have disappeared that fast. Unless… Unless he had used his Invisibility Cloak. That was probably it. Perhaps this was Potter's fun day, too, and Draco was his target. He was somewhere near, laughing at the fact it was so easy to get Draco to follow him. Pansy was right. Draco had to be careful not to show too much interest in Potter, or it would all backfire, and Potter would feel like an even bigger celebrity. </p>\n<p>Draco spun around and headed back for the dungeons. <i>Honestly</i>. Now that he thought about it, he was sure he knew what this was all about. Slytherin had lost the match yesterday and was likely to lose the Cup, but Draco had assumed no one would mock him for it since the new captain kicked him off the team months ago. Not even postponing the Gryffindor-Slytherin match to give the new Seeker time to prepare helped. Gryffindor still won. The match was an embarrassment. The new Seeker was no threat to Potter. So if anyone had mocking rights here, it was Draco. At least that would be clear to people capable of logical thinking. He should have known Potter and his lot would be more interested in any excuse to make Draco feel like shit. This was likely an ambush. The Gryffindors would jump out of corners any moment now to insult him and goad him into doing something that would get him into trouble. He had to get away before that happened. Yesterday, after the match, Potter had given him such an intense and clearly evil look, Draco had escaped to the safety of his dormitory. He had managed to erase Potter from his memory by concentrating hard on his Transfiguration essay. But if Potter thought Draco was guilty of something, he was unlikely to just let it go.</p>\n<p>Draco hurried down the corridor, trying not to look over his shoulder too much. </p>\n<p>His paranoia was not unjustified.</p>\n<p>Something fast emerged from the darkness. It grabbed Draco's arm and pulled. Before he could react, Draco was manhandled into a broom cupboard. The door slammed shut. Lights flared. Draco's thundering heart stopped beating altogether.</p>\n<p>\"Potter?\" he breathed, for it <i>was</i> Potter, with his black hair and green eyes, which were entirely too green and entirely too close. </p>\n<p>Despite all his earlier theories, Draco didn't actually expect Potter to ambush him like this. He truly didn't do anything to earn Potter's ire. Not this time. Potter had no reason to assault him, unless it was because Draco had flipped him the bird earlier.</p>\n<p>Draco went for his wand, but Potter flattened his palms against Draco's chest and pushed him against the wall. He didn't look angry. But he looked... <i>intense</i>. Draco froze. He just stood there, helpless, as Potter leaned in and kissed him. Kissed him right on the mouth with warm lips and passion that made Draco's head spin. In his shock, Draco didn't even close his eyes. He could see Potter clearly, the dark locks of his hair falling around his face, the frames of his round glasses, the thick eyelashes resting on his cheeks. Potter's tongue slid into Draco's mouth with a slow, sinuous twirl that had Draco's body reacting instantly. His skin heated up and a pleasant pressure built low in his stomach. He almost let go, closed his eyes and kissed back, but this was <i>Potter</i>. It made no sense.</p>\n<p>Draco grabbed Potter's shoulders and shoved him off. Potter looked surprised, frowning between Draco's face and Draco's hands that held Potter at a safe distance.</p>\n<p>\"What the hell are you doing?\" Draco whispered even though he meant to yell. His throat was dry and his voice low, and his lips felt full, hot and tingling. It made talking difficult. </p>\n<p>\"It's called kissing.\" Potter cocked his head. \"Or snogging if you prefer. But I heard you can't use that term seriously after you've turned seventeen.\"</p>\n<p>Now that Potter was no longer kissing him, Draco's mind was clearer. Clear enough for him to be really fucking pissed off. \"I don't know what you're trying to pull, but it's not funny.\" Draco was pleased to hear his voice sounded calm and threatening this time.</p>\n<p>It had no effect on Potter, however. He merely smiled. \"Well, there was something I wanted to pull, and I definitely didn't count on you laughing about it. So I think we're on the same page.\"</p>\n<p>Draco blinked at Potter's smiling face, lost for words. Potter was flirting so blatantly it was impossible to misunderstand. Which meant he had gone quite mad. Or someone put him up to it through magical means. Or Draco was going mad, and this wasn't even happening.</p>\n<p>\"Er.\" Potter looked down at Draco's hands. \"Have you been working out? Because that's quite a grip you have there. Pretty soon I'll have to say <i>Ow</i>.\" Potter bit his lip. \"In a very turned on way, of course.\"</p>\n<p>Potter was not only mad, his madness was contagious. Draco could feel himself giving in, wanting nothing more than to just let go and let Potter flirt with him and kiss him as much as he wanted.</p>\n<p>Draco's arms lost their strength. Potter approached, his hands on Draco's chest again, his smiling mouth tantalisingly close.</p>\n<p>\"See? I'm irresistible.\"</p>\n<p>He really was. At least Draco couldn't resist him when Potter bent his head to the side and pressed his warm lips to Draco's neck, sucking and licking the tender spot below Draco's ear. Potter's teeth grazed his skin, and Draco shivered, his hips bucking only to be stopped by Potter's grip. When had Potter managed to get his hands there, Draco didn't know, but it seemed like the most perfect spot for them. Something fiery and intense clenched his insides every time he tried to move and Potter didn't let him.</p>\n<p>\"I hate robes,\" Potter mumbled, nipping on Draco's jaw, his palms dragging against the fabric of Draco's robes, up and down and around his waist and hips, as though in desperate search for an opening they could break through. It made Draco hate robes, too, with a passion he normally reserved for... Well, for Potter. \"Would you mind terribly if I rip them?\" Potter asked, breathless, his lips close to Draco's again. He pulled Draco's bottom lip between his teeth, bit down lightly, then licked and sucked the sore skin. Draco caught himself making a pathetic whimpering sound. It scared him so much he pushed Potter away again.</p>\n<p>Potter didn't seem overly concerned; Draco didn't manage to push him very far. Potter's hands were still firm on Draco's hips.</p>\n<p>\"You worry about your clothes too much,\" Potter told him, in a fond sort of way that only added to Draco's confusion. </p>\n<p>\"It's not my clothes I'm worried about,\" Draco said. He was more worried about his sanity. This wasn't actually happening, surely. It was all in his head.</p>\n<p>Potter's face filled with genuine concern. \"Why? What's wrong?\"</p>\n<p>\"Um. You sexually assaulting me is pretty wrong, I think.\"</p>\n<p>Unexpectedly, Potter laughed. \"You're right. I <i>am</i> rather grabby, aren't I?\" He pressed closer with a wicked gleam in his eyes and lowered his voice as he said, \"I heard you like that sort of thing.\"</p>\n<p>Draco blinked, appalled. \"I do not!\"</p>\n<p>Potter seemed to find that funny, too. \"Well, then... My mistake. Perhaps you'd prefer to sexually assault <i>me?</i> I <i>do</i> like that sort of thing.\" With a grin, he spun them around so that he was the one pressed against the wall. It made Draco dizzy. \"Go on, then,\" Potter said. \"Have at it. You're welcome to rip my clothes off.\"</p>\n<p>That was just about the most tempting offer Draco had ever heard in his entire life. His fingers itched to point his wand at Potter's clothes and rip them to shreds. </p>\n<p>Except it felt like an evil overlord just offered him a million Galleons for no reason at all, and if he agreed he'd surely end up selling his soul.</p>\n<p>But then again... Potter looked so excited and willing, with his full lips parted and his pupils blown wide, maybe it was worth selling his soul. It probably shouldn't reach such a high price, anyway.</p>\n<p>Draco took out his wand and pointed it at Potter, already imagining him naked. But there was something about him standing there with a wand in his hand and Potter's green gaze looking back that reminded him — he was Draco Malfoy and this was Harry Potter. They didn't meet in cupboards to rip each other's clothes off and have sex. This was some sort of joke. One that would be on him if he showed any weakness.</p>\n<p>Draco gripped his wand more firmly. \"Stay away from me, Potter,\" he said. \"Or next time, I'll break your nose. Again.\"</p>\n<p>With that, he spun around, opened the door, and ran for the safety of his dormitory.</p>\n<p>\n<b>TBC</b>\n</p>\n<p>It was an odd day. Or rather, it was odd how normal the day was, considering the way it'd started. Draco was beginning to think he had imagined the whole thing. Potter didn't even acknowledge his existence afterwards. Draco saw him at lunch, at supper, and at the pitch, but Potter didn't look his way.</p>\n<p>As far as Draco could conclude, there were only three possibilities. Potter had tried to pull some kind of prank. Or someone had pulled a prank on Potter and cursed him into thinking he wanted to make out with Draco. Or someone had cursed Draco and given him hallucinations. The latter was the reason why Draco kept quiet and didn't tell Pansy what happened. He really didn't need her accusing him of losing his mind. And this theory was beginning to sound like the most plausible one because Draco had spent the night thinking about Potter's kiss, and that simply wasn't natural. </p>\n<p>Well, to be fair, it wasn't the first time his thoughts had strayed in that direction, but strange sexual fantasies during a good, long wank were only to be expected. This, however, was an obsessive, feverish night where Draco kept waking up sweaty, with his heart thundering in his chest, and utterly unsure what was real and what was just a dream. </p>\n<p>On Monday morning, he resolved to forget the whole thing and dismiss it as a riddle unworthy of his time and effort. At first, it looked like he'd be allowed to do exactly that. Everything was normal enough during morning Transfiguration lessons, with Potter ignoring him as he usually did, but Draco should have known it wouldn't be that easy. There was a moment during Charms when Draco, quite by accident, looked Potter's way and their eyes met. Potter gave him a small, uncertain smile before looking away. </p>\n<p>Draco spent the rest of the class contemplating whether that truly was odd or if he should just ignore it. In the end, he decided he simply couldn't trust his judgement. Not when it came to Potter. </p>\n<p>He couldn't wait for the bell to ring. When it finally did, he grabbed Pansy's hand, dragged her into a nearest alcove, and told her everything that had happened yesterday. She listened patiently with an unreadable expression.</p>\n<p>\"I see,\" she said at last, staring at his eyes so intently Draco was sure she was checking whether his pupils were dilated or not.</p>\n<p>\"I'm not crazy!\" Draco hurried to add even though he was aware that was exactly what a crazy person would say. </p>\n<p>Pansy reached out and took Draco's hand. She gave it a little squeeze. \"Of course not! But… Maybe you could go see Madam Pomfrey, anyway?\" She smiled. Draco knew that smile. He gave the same one to his mother when she had escorted him to the train station in September and, looking quite serious, said, \"Perhaps you could try to befriend Potter this year. He saved your life; I saved his. You have a bond now, and it can only serve you well.\"</p>\n<p>It was a smile one gave to a person who had clearly lost all touch with reality.</p>\n<p>Draco freed his hand from Pansy's grip with a scowl. \"There's nothing wrong with me. I'm completely rational about this. It's not like I think Potter is secretly in love with me. And I'm not claiming this is Potter's evil plan, either. Someone clearly did something to him. Dared him or hexed him.\"</p>\n<p>\"Right. Of course. It's possible. But why not make sure? If we hurry, we might catch Pomfrey before she goes to lunch.\"</p>\n<p>\"Pansy! If someone cursed me, I'd know it.\"</p>\n<p>\"But you wouldn't. And I'm not talking about curses. Not necessarily. I just think you're under a lot of stress.\"</p>\n<p>\"Stress,\" Draco repeated, perplexed. \"I'm not stressed!\" he yelled. \"And if I am, it's your fault. You're just so... <i>paranoid</i>. It's affecting me. Things are going well this year, you know. No Dark Lord, no Carrows. I'm learning things I already know, and I have plenty of time to study. And there's quite a prominent feel of unity between the Houses if you haven't noticed.\" Draco decided against mentioning his 'calm before the storm' suspicions. \"Gryffindors and Slytherins have never been on such good terms.\"</p>\n<p>\"Other Slytherins, Draco. Not you and me. We're the ones who tried to deliver Potter to the Dark Lord. Even our House is staying away because it's unwise to be seen with us.\"</p>\n<p>\"Oh, don't be so dramatic. The situation is hardly that hopeless.\"</p>\n<p>\"Oh, really? You have friends I don't know about? People to talk to? Play Quidditch with?\"</p>\n<p>\"There's Goyle.\"</p>\n<p>\"He just grunts. It doesn't count.\"</p>\n<p>\"You're far too picky. That's the real problem. And there's Blaise. He winks at me.\"</p>\n<p>\"He winks at everyone!\" Pansy yelled, getting quite irrationally agitated. \"It's what he does. Believe me, he's not going to talk to you in public.\"</p>\n<p>\"So this is about Blaise? You fancy him or something?\"</p>\n<p>Pansy took a deep breath and closed her eyes. Her lips were moving silently.</p>\n<p>Draco frowned at her. \"What are you doing?\"</p>\n<p>\"Counting to a hundred.\"</p>\n<p>\"Pansy, I hate telling you this, but I think you're having a nervous breakdown.\"</p>\n<p>Pansy opened her eyes. \"I already had it, you idiot. I've been on potions for months.\"</p>\n<p>\"Oh.\" That explained a lot. He should have noticed. Why didn't he notice? \"They're not really helping, are they?\"</p>\n<p>Pansy scowled. \"There's a limit to how much you can take. I had to take a pause. But they do help. And I really think you should —\"</p>\n<p>\"I'm not having a nervous breakdown. This is Potter's crazy, not mine.\"</p>\n<p>Pansy wasn't listening. \"I thought you were doing better. You seemed much calmer lately, but now you're at it again.\"</p>\n<p>\"Because of <i>Potter</i>. Because he's ambushing me and kissing me.\"</p>\n<p>\"Draco, can you hear yourself?\"</p>\n<p>\"I'm not having a nervous breakdown!\"</p>\n<p>\"Well, I am!\" a voice cried. Draco jumped and looked around in fright. A very angry little girl stood beside them, a piece of parchment in her hand. \"I was asked to give you this.\" She thrust the parchment against Draco's stomach, forcing him to take it. She must have stood there for quite a while, trying to attract his attention. </p>\n<p>\"Right,\" Draco said. \"Or you're just trying to eavesdrop.\" </p>\n<p>She scowled at him. \"Whatever, Malfoy.\"</p>\n<p>\"Oh, you little brat.\" Draco pretended to go for his wand. \"Go away.\"</p>\n<p>She yelped and scurried off. Draco cursed after her.</p>\n<p>\"Oh, for fuck's sake! What's wrong with you?\" Pansy cried. \"See, this? <i>This</i> is what makes things harder for both of us. You can't bully first years! It just makes you look evil.\"</p>\n<p>Draco was utterly indignant. \"She was bullying <i>me!</i> Calling me Malfoy like that? Who is she? What gives her the right?\"</p>\n<p>Pansy stared at him. \"She's three-feet tall, Draco!\"</p>\n<p>Draco resisted stomping his feet. Instead, he said, more calmly, \"Excuse me. I have to read my note.\" It was a short note, but Draco pretended to read it for a minute, hoping Pansy would get bored and leave. He had no such luck.</p>\n<p>\"Well?\" she asked impatiently.</p>\n<p>\"It's a love letter. From Potter.\"</p>\n<p>She snatched the note and scanned it, scowling. It was from Slughorn, actually. He wanted Draco to stop by his office so they could discuss his Potions assignment. Draco had handed in his essay on Friday, and there was simply nothing wrong with it. It was as superb as an essay could be.</p>\n<p>\"See?\" Pansy said. \"He doesn't like you either.\"</p>\n<p>\"Maybe he wants to tell me he has never read something so brilliant.\" Draco snatched back the note and stepped out of the alcove.</p>\n<p>\"Draco.\" Pansy's tone turned softer. \"I'm only trying to help, you do realise that?\"</p>\n<p>Draco waved her off and headed for the dungeons. He regretted telling her anything. A lot of good it did him. He didn't need Pansy to tell him no one here liked him anymore. He was perfectly capable of noticing that himself. What Pansy failed to understand was that there was no reason to dwell on it. They knew why no one liked them, and nothing could be done about it, anyway. Potter's behaviour on the other hand was a mystery in need of solving, which was what Draco planned to do, as soon as he found out what Slughorn wanted. Commending Draco on his essay definitely wasn't it.</p>\n<p>He considered ignoring the message, but that would be unwise. His father insisted that if only Draco tried, Slughorn would accept him into his little club. His father, like his mother, had lost touch with reality, Draco was aware of this, but he didn't want to risk Slughorn sending an owl to his parents. </p>\n<p>The door of the Potions classrooms was ajar, and Draco stepped inside, looking around. There was no one there, which only made sense. Why did he even think Slughorn would risk being late for lunch?</p>\n<p>The door slammed shut behind him. Draco spun around.</p>\n<p>The moment he saw Potter, things became clear. The little girl who had given him the note earlier was a Gryffindor, and Draco didn't stop to analyse the handwriting. He had made it so easy for Potter to trap him. </p>\n<p>\"Sorry about this,\" Potter said. \"I guessed you wouldn't talk to me.\"</p>\n<p>\"You guessed right. Out of my way,\" Draco growled and stepped forward, but he didn't dare to come too close to Potter.</p>\n<p>\"Wait.\" Potter looked harmless enough this time, but he was nonetheless blocking the exit. There was an apologetic, nervous air about him, and Draco wasn't sure whether to be relieved or worry even more. \"I just want to talk.\"</p>\n<p>\"You mean apologise,\" Draco said, wondering if there was a chance he could slip past Potter. He'd have to be quick.</p>\n<p>Potter's jaw tightened, but he nodded. \"Yes. I just didn't expect you to be angry yesterday, so I didn't even notice it.\"</p>\n<p>Draco was angry <i>now,</i> and he doubted someone could not notice it. \"You're unbelievable!\" Did Potter honestly believe that he could just ambush and assault people and they'd be thankful? Anger gave Draco courage, and he tried for the door.</p>\n<p>Potter was quick to move directly in front of him. \"Wait, <i>please</i>. I thought about it, and I think I get what happened.\"</p>\n<p>Draco shook his head in disbelief. \"And I thought Goyle was slow.\"</p>\n<p>\"It was the Quidditch match, wasn't it?\"</p>\n<p>Draco didn't see that one coming. He could do little but stare at Potter as he went on, \"Draco, I do agree it's unfair. They shouldn't have kicked you off the team. The new Slytherin Seeker is terrible. He was ridiculously easy to defeat. But...\" Potter stepped closer, his expression pleading and petulant all at once. \"It's not my fault. It's not fair for you to blame me. What was I supposed to do? Not play? Let Slytherin win? How would that help? It would only make the Slytherin captain think he'd made the right decision. Don't you see? He's probably feeling pretty stupid right now. And he should. You'd be a bigger challenge.\"</p>\n<p>Draco nearly pointed out that he had never beaten Potter to the Snitch, so how the fuck would he be a bigger challenge, but Potter's entire ramble was quite unbelievably <i>random</i>. Draco chose his words carefully and spoke very slowly. \"You think I pushed you off yesterday because I'm upset about Quidditch?\"</p>\n<p>Potter's forehead wrinkled. \"That's not why? Then what?\" He stepped even closer, carefully touching Draco's arm. \"Draco.\" His hand slid down to Draco's fingers and wrapped around them with a little squeeze. \"Talk to me.\" He was definitely pleading now, his expression earnest.</p>\n<p>Draco stared at Potter's hand that held his. Pansy was wrong. This was Potter's madness, not Draco's. A love spell of some sort. It had to be. Potter was positively delusional. Overly familiar with Draco as though he believed they were friends. Or lovers.</p>\n<p>Draco pulled away, jaw clenched. He had to explain this to Potter, make him understand. Get him to Pomfrey or Slughorn. Maybe warn his friends. Because this was too ridiculous. And everyone would blame Draco for it. He just knew it. It would turn out Draco was the one who had hexed him. Maybe that was the plan. Whoever did this to Potter wanted to get Draco into serious trouble. This was no joke; this was a disaster. Potter would murder him. Potter’s friends would murder him. His father would murder him. He'd be expelled. Be sent to Azkaban...</p>\n<p>Potter leaned in, his face so close Draco could feel the warmth of his skin. \"There's nothing you can't tell me,\" he whispered, his expression soft, his voice intimate, wrapping around Draco like a warm, alluring spell, urging him to give in, to let Potter pull him close so that he could bask in the protection he offered. For a wild, wonderful second it seemed like Draco could really just tell him. Tell him something was wrong, and it wasn't Draco's fault, and maybe Potter would believe him, promise him it was okay, and they'd sort it out without murders or Azkaban. \"It's okay,\" Potter said as though he had read Draco's mind. As though something compelled him to say whatever Draco wanted him to say. \"Just tell me, and we'll deal with it.\"</p>\n<p>This was too cruel. It wasn't just a random kiss in a cupboard that only served to remind Draco of what he could never have. This was really much worse. This was Potter behaving in a way that Draco rarely dared even to imagine. He'd only resort to it when his need was dire. When his nightmares were too vivid, and the images refused to vanish even after Draco woke up and opened his eyes. In those moments, his mind trusted only Potter. He was the only one who could convince Draco that it was all right, that he was safe now, that the Dark Lord wasn't coming back. Only Potter could save him from nightmares the way he had saved him from flames.</p>\n<p>Their foreheads were touching. Potter's skin was warm, the scent of his shampoo too delicious for Draco not to breathe it in. Whichever spell Potter was under, it was definitely contagious. Or Draco really was having a nervous breakdown. </p>\n<p>Telling Potter he'd been hexed would be the smart thing to do. Better sooner than later to minimise the damage. </p>\n<p>One of Potter's hands sneaked behind Draco. Potter's palm was a firm, calming presence on the small of Draco's back.</p>\n<p>Maybe telling Potter wasn't the best idea. Draco had witnessed the effects of love spells before. They were considered dangerous for a reason. Trying to convince a person under a spell that what they're feeling wasn't real never went well. They often turned angry and violent. If Draco were to tell Potter this wasn't real, doing it somewhere a teacher could save him when Potter lost his mind would be the wise course of action. </p>\n<p>Besides, he was in big trouble as it was. </p>\n<p>And he wasn't getting another chance like this. </p>\n<p>\"Tell me,\" Draco said, \"am I really such a challenge? I'm pretty amazing at Quidditch, aren't I?\"</p>\n<p>Potter laughed. \"So this <i>is</i> about Quidditch.\"</p>\n<p>\"Yeah. All about Quidditch.\"</p>\n<p>Potter's lips pressed softly against Draco's, and Draco shivered. \"You’re a definite challenge. In every way. And you know how much I enjoy those.\"</p>\n<p>\"Not sure if that's a compliment.\"</p>\n<p>\"It's fact.\" Potter kissed him again, properly this time, in a way that made Draco feel like he was at risk of melting into nothing. </p>\n<p>Potter pulled away with a suspicious sort of look. After all, Draco hadn't been kissing him back. He didn't dare. It felt like a line he shouldn't cross. \"Are you planning to push me away again?\" Potter asked.</p>\n<p>\"I should,\" Draco said honestly.</p>\n<p>\"Why?\" Potter cocked his head, placing his lips in the perfect position for Draco to lean in and kiss them. That had to have been deliberate. </p>\n<p>\"Because you're Potter.\"</p>\n<p>\"What a boring, old reason. You know what I think? I think…\" Potter pressed something cold into Draco's hand. \"I think you should stop thinking so much and just take what's offered.\" </p>\n<p>Draco looked down at his palm. Potter had given him a small phial filled with pearlescent liquid. Draco already opened his mouth to ask what the hell was it — he was imagining Potter morphing into Pansy and giving him a Calming Draught to help with his nerves — but the phial came with a handy label that clearly spelled out what it was. Draco swallowed. Potter was pink-cheeked and worrying his bottom lip. </p>\n<p>\"You…\" Draco tried to make his throat work. \"You want…\" He looked down at the phial again. \"Now?\"</p>\n<p>Potter laughed, though it sounded nervous. \"Potions classroom in the middle of the day? I think breaking in here is enough excitement for one afternoon. I'm leading a simple, unadventurous life these days.\" He nodded.</p>\n<p>Draco stared at the phial, then at Potter again.</p>\n<p>\"Tonight.\" Potter licked his lips. \"After curfew. Just… be wherever. I'll find you.\"</p>\n<p>Draco looked at the phial again. Potter wanted to have sex. <i>Sex.</i> Of the penetrative variety, apparently. Draco's whole body was suddenly hot and sweaty. </p>\n<p>\"Or maybe you don't want to?\" Potter leaned in, and their noses bumped. The sheer ridiculousness of it startled a laugh from Draco. Potter deepened his voice. \"Because I'm Potter,\" he purred with a teasing smile as though it really didn't matter who they were.</p>\n<p>\"I...\" He couldn't. He obviously couldn't just give in. He had to think of something to get out of it without making Potter angry. </p>\n<p>But... Here he was in the Potions classroom with Slughorn's storeroom at his fingertips. He could snatch a love spell antidote and give it to Potter. <i>Later.</i> Once he had an escape route planned. This meeting might be the perfect opportunity. \"Okay,\" he said, and Potter's face lit up like sunrise.</p>\n<p>Potter pressed a quick kiss to Draco's lips. \"Good. I'll see you then.\" He pulled back as though to leave, but Draco wasn't letting go. He had wrapped his arms around Potter, holding him in a tight embrace. He hadn't even noticed.</p>\n<p>\"You call that a kiss?\" he asked because Potter had always hated him, and he'd hate him more after he drank the antidote, so another kiss wouldn't make much difference, anyway. Why not take what he could? Potter had said as much, too.</p>\n<p>Potter needed no further encouragement. He pulled Draco in a toe-curling kiss, which was nothing like the quick assault in the broom cupboard or the sweet kiss from earlier. This one was slow and promising, skilled in a way that made Draco feel like a fumbling boy. Though once he relaxed and gave in, his tongue slid against Potter's with practiced ease as though his body was one step ahead of his brain and handled the situation much better than Draco's mind. Kissing Potter seemed to come to him as naturally as breathing.</p>\n<p>\"Mmm.\" Potter smiled against Draco's lips. \"On the other hand, I'd hate a simple, unadventurous life, and we still have half an hour at least.\" Potter's hips pressed in closer, and Draco could feel Potter was hard.</p>\n<p>Panicking, he gave Potter a little push and took a hasty step back.</p>\n<p>\"More shoving,\" Potter commented.</p>\n<p>\"I just... This...\"</p>\n<p>\"Is not the time or place,\" Potter finished for him. \"I know. I was joking.\"</p>\n<p>\"Right. Okay. I'll see you later,\" Draco said because he really needed Potter to leave. He had a nasty feeling that if Potter stayed a minute longer, Draco would end up begging for more. Potter's kisses were a dangerous thing.</p>\n<p>Potter didn't look happy about being brushed off, but he nodded. \"I'll go first.\" He moved to the door, walking backwards. \"We wouldn't want to be seen together. Because I'm Potter and you're Malfoy.\" With that, he was off, and Draco promptly collapsed onto a bench to catch his breath and force himself to calm down. He had survived the Dark Lord, war and fire; he could survive being kissed by Harry Potter.</p>\n<p>\n<b>TBC</b>\n</p>\n<p>Skipping lunch and avoiding Pansy seemed like the most sensible plan, if not the easiest. Pansy all but stalked him, demanding to know what, pray tell, was Draco doing in the Potions classroom since Slughorn was at the High Table during lunch.</p>\n<p>Draco was tempted to ask her if Potter was at lunch, too, and whether he arrived late, just to make sure that the Potter who insisted on kissing him wasn't a figment of his imagination but was in fact the actual, real Potter. He resisted, however, and only showed up at supper to snatch a sandwich and leave before Pansy could spot him.</p>\n<p>He hid in his dormitory, ate the sandwich, and downed the Calming Draught he had stolen from Slughorn's storeroom along with the love spell antidote. Taking the Draught had been wise; it instantly made him feel better. He could then sit on his bed, with a quill and parchment in his hands, and calmly and rationally consider the situation. He decided, grudgingly, that it was unlikely all this was Potter's evil plan. If Potter wanted to humiliate him by showing the world Draco was romantically and sexually interested in him, he was doing a poor, unconvincing job of it. Not only was Potter careful to keep their meetings a secret, Draco was certain that if Potter was trying to pull a simple prank, he wouldn't go as far as actually kissing Draco just to prove a point. Someone else must have been responsible.</p>\n<p>\"Is that your kill list?\"</p>\n<p>Of course, Draco should have realised that peace and quiet was too much to ask for. He glared up at Blaise. \"It is. And you're on it.\" It was actually a list of suspects, and Blaise was definitely on it. In fact, quite a lot of people were on it. Draco had crossed out a few names because there were some people who would never hurt Potter by giving him an embarrassing crush on Draco, but then he realised that perhaps that hadn't been the intended result, merely an unwanted side effect. Perhaps they had intended to make Potter fall in love with them, and Draco had somehow been caught in the middle. He had to put Pansy on the list, too, since she had confessed to having a nervous breakdown, which meant she was currently unstable and could not be trusted. It seemed unreasonable to put Goyle on the list, as he didn't have the means or the brains or any reason Draco could think of to plot such a plan, but then again it was always the person one least expected, so Draco felt obligated to write down his name, though it was appropriately marked with many question marks and exclamation points. </p>\n<p>\"You're a very angry person. Did anyone ever tell you that?\" Blaise didn't seem too upset about it, however. He grinned and winked when Draco scowled at him. \"I like you anyway.\" </p>\n<p>\"No, no, you don't.\" Draco was getting rather sick of people winking at him.</p>\n<p>Blaise gave him a peculiar look. \"I'm sensing love troubles.\"</p>\n<p>Draco stiffened. \"And what would you know about that?\"</p>\n<p>\"Plenty.\"</p>\n<p>Blaise's smug smile seemed to negate the effects of the Calming Draught Draco had consumed. He jumped off the bed and stalked towards Blaise. He should have known. \"It was you. <i>You</i> did this to Potter. Didn't you?\"</p>\n<p>Blaise smile slipped. He blinked. \"Potter? Harry Potter? You're saying...\" His eyes were very wide. He gasped. \"You and Potter...?\"</p>\n<p>Draco never wanted to hit someone as much as he wanted to hit himself in that moment. What had he done? Blaise was always smug and had an all-knowing air about him. It meant nothing. And Draco had just revealed too much. Now Blaise would tell everyone who would listen that Draco had a thing for Potter, and there would be no escaping the accusation that he had put a love spell on him.</p>\n<p>\"What? No. You misunderstood.\" Draco sounded unconvincing to his own ears, which was ridiculous because he wasn't even guilty.</p>\n<p>Blaise wasn't listening; he was too busy gaping at Draco as though he were a ghost come to life. \"Merlin. <i>Potter</i>. It can't be.\"</p>\n<p>\"It's not!\"</p>\n<p>\"There you are!\" said Pansy, who had materialised in the doorway, hopefully to save Draco from his own stupidity. She frowned at Blaise. \"Go away. I need to talk to Draco.\"</p>\n<p>\"You go away. I'm talking to Draco.\"</p>\n<p>Draco was beginning to feel quite popular. It was annoying. \"Both go away. I don't feel like talking to anyone.\" Not to mention he had to go. To meet Potter. And have sex with him, apparently. How was this suddenly his life?</p>\n<p>Blaise gave Draco a disgruntled look and shoved a book he must have come here for in his bag.</p>\n<p>Only when he moved to the door did it occur to Draco that pissing Blaise off wasn't the smartest thing to do. He ran after him. \"Blaise, wait, please! You can't tell anyone. I mean… There's nothing to tell. You just made a wrong conclusion. But you can't tell anyone about that either.\"</p>\n<p>Blaise scowled down at Draco's hand that clutched his forearm, and Draco hastily let go. \"You're a dick,\" he said and left.</p>\n<p>\"You told Blaise?\" Pansy voice shook Draco out of his confusion. \"What did you tell him? Not something about Potter, surely? Oh, <i>Draco</i>.\"</p>\n<p>\"Leave me alone.\" Draco was too miserable to argue. He wasn't sure why Blaise was so angry. It wasn't the first time he'd told him to leave him alone. It never seemed to bother Blaise before. It was as though everyone had lost the ability to behave rationally.</p>\n<p>Pansy gave a huge sigh. \"Here.\" She pressed a small phial into Draco's hand. For a confusing, horrifying second, Draco was sure Pansy had given him another phial of lube, and this whole thing was a giant conspiracy meant to drive Draco insane with sexual innuendo. At a closer look, however, this phial didn't seem to contain lube.</p>\n<p>\"It's what you've been taking for your nerves,\" he guessed.</p>\n<p>\"It is. And I don't see why you can't at least try it.\"</p>\n<p>\"Because I just drank a whole phial of Calming Draught.\"</p>\n<p>Pansy waved him off. \"Nah. Mixing it with Calming Draught hasn't killed me yet.\"</p>\n<p>Draco was much too exhausted to disagree. He uncorked the phial and drank its content with two large gulps.</p>\n<p>Pansy frowned. \"Well, that was a little excessive.\"</p>\n<p>\"I need it,\" Draco said, checking the time. He grabbed his cloak and made sure the antidote was still in his pocket. Lube was still there, too, not that he would need that.</p>\n<p>\"Where are you going?\" Pansy demanded. \"I think you should lie down.\"</p>\n<p>Draco thought it best not to offer an answer. \"I appreciate your concern,\" he said, squeezing her shoulder, and then ran outside as fast as humanly possible.</p>\n<p>He hoped Pansy wouldn't follow him. He ran all the way up to the fourth floor, making sharp turns and occasionally sprinting.</p>\n<p>The corridor he had chosen at random appeared to be completely abandoned. Potter had said he'd find him no matter where Draco was, which was an odd thing to claim, but then again Potter was rather skilled at following Draco around.</p>\n<p>Draco hid in an alcove, excited despite himself, feeling like a boy playing hide and seek with a friend.</p>\n<p>Logically, Potter would have to search the entire castle to find him. Unless he had put a Trace on Draco. </p>\n<p>Maybe he did. Maybe Potter just wanted to have sex with him. Maybe this was Potter's elaborate, kinky fantasy. Which, well. Draco was all right with any plan that involved sex with Potter.</p>\n<p>\"Got you,\" empty air said in Potter's voice. A second later, Potter pulled off his Invisibility Cloak and promptly lunged forward to kiss Draco senseless.</p>\n<p>Draco decided this was something he could easily get used to. He had to grin when Potter pulled back with a satisfied sigh as though kissing Draco was a special kind of pleasure for him.</p>\n<p>\"I could do this for hours,\" Potter whispered, his lips still trailing against Draco's.</p>\n<p>\"I could do this forever.\" The moment those words came out of his mouth, Draco noticed blurry edges around his vision. He shook his head. Merlin. Combining the Calming Draught and Pansy's potion had not been a good idea.</p>\n<p>Potter laughed. \"I am getting rather good at it, aren't I?\" He said it rather arrogantly, but his cheeks had gone pink. Draco's theory that Potter had meticulously planned all this just to seduce him didn't look quite so plausible anymore. \"Must be all the practical experience,\" Potter added.</p>\n<p>\"Right. Bet people stand in line for a chance to kiss you.\" Draco tried hard not to sound bitter.</p>\n<p>Potter looked around at the empty corridor. \"Must be a very stealthy line.\"</p>\n<p>\"Oh, come on, Potter. You know it's true.\"</p>\n<p>Potter's good mood seemed to have darkened instantly. \"Now you're jealous?\" He stepped back. \"You know, you're beginning to seriously piss me off.\"</p>\n<p>Damn. Draco had forgotten. Angering a person under a love spell was not a good idea. Angering Harry Potter under a love spell was definitely dangerous. And he was clearly much too irrational as it was if he didn't realise half of wizarding Britain wanted to shag him.</p>\n<p>Draco pulled Potter back into his embrace. And what an odd feeling that was. Potter came willingly, let himself be pulled, his gaze much softer as his body moulded against Draco's. How was putting Potter in a good mood suddenly so much easier than pissing him off ever was? \"Sorry?\" Draco said even though he suspected he had already been forgiven. \"I'm just... er...\"</p>\n<p>\"Nervous?\"</p>\n<p>\"Yes! Definitely nervous. I actually drank some Calming Draught.\" A half-truth was even better than a lie.</p>\n<p>Potter's smile was kind and so comforting Draco's insides twisted again.</p>\n<p>\"You have nothing to be nervous about,\" Potter said firmly, which was a bit rich since Potter definitely seemed nervous. \"Come on.\" He took Draco's hand and gave it a little pull. \"I want to show you something.\"</p>\n<p>Draco followed him without objections and with more curiosity he had any right to feel as a person who was only waiting for the right moment to give Potter the antidote.</p>\n<p>Potter led him in front of the Transfiguration classroom. \"Professor Hardy is sick again,\" he said as he cast spell after spell at the door. \"So unless he decides to read essays in his feverish state, I think we're safe.\" The door swung open.</p>\n<p>\"You're quite a cat burglar,\" Draco said, impressed.</p>\n<p>\"Again...\" Potter grinned and pulled Draco inside. \"<i>Practice</i>.\"</p>\n<p>The light in the right corner of the room attracted Draco's attention. There was an actual bed there. Small and pathetic, obviously Conjured and not very well, but it was definitely a bed with a mattress and pillows and sheets. High above it a dozen lit candles floated in mid-air.</p>\n<p>Draco didn't really need another confirmation, but he got it anyway — this was <i>not</i> Potter's elaborate, kinky plan. This was definitely a love spell. One that infected the victim with cheesy attempts at romance.</p>\n<p>\"I know, I know,\" Potter burst out, stuffing his hands into his pockets. \"I know what it looks like. But… we need light. It's not my fault there's no electricity in Hogwarts, and I had to use candles. And we could use a bed. What's the harm in that? And it's not my fault I'm better at Conjuring silk than cotton.\"</p>\n<p>Draco squinted at the sheets. He didn't even realise they were silk. \"And, er, what's with the little stool?\" There was a three-legged stool next to the foot of the bed as well as a bedside table at the head of it.</p>\n<p>\"It's for our clothes.\" Potter sounded petulant.</p>\n<p>\"There are about thirty chairs in here, you do realise that?\"</p>\n<p>\"I was in a Conjuring mood.\"</p>\n<p>\"And in no mood for four legs?\"</p>\n<p>\"Oh, shut up. And get naked.\" Potter headed for the bed, pulling off his cloak as he went. He sat down to take off his shoes and socks. He clearly wasn't joking about getting naked. Or having sex with Draco. Right now, in a Conjured bed with silken sheets and candles flickering above them.</p>\n<p>Potter had taken off his glasses and put them on the bedside table. He looked up while unbuttoning his shirt and paused. \"What?\" </p>\n<p>Draco stood rooted to the spot and stared. He should have moved, obviously. He rectified that immediately because only an idiot would stay away from something so inviting. He paused in front of Potter, fascinated.</p>\n<p>\"What?\" Potter repeated, and Draco knew he was acting strangely, but he couldn't help himself, and he couldn't worry about it. He felt rather calm and happy, if a little unsteady on his feet. He cupped Potter's jaw to trail his thumb against Potter's skin, his jaw, his lips. Potter's eyes were no longer obscured by his glasses; the contrast of his dark lashes and bright green irises was startling. Everything was startling. Potter's black hair, the warmth of his skin, the fullness of his lips. Why had Draco not realised how beautiful Potter was? So beautiful it was making Draco dizzy.</p>\n<p>Or no. No, Draco was actually dizzy. That wasn't Potter. That was the potion Draco had consumed.</p>\n<p>\"Are you all right?\" Potter shot up just as Draco nearly collapsed.</p>\n<p>Potter swung them around, which made Draco laugh; it felt like they were dancing. But then Draco was forced to sit, and Potter fussed with Draco's cloak, pulling and yanking. It must have wrapped around Draco awkwardly; he felt a little trapped.</p>\n<p>\"What the hell is this?\" Potter sounded more upset than worried this time.</p>\n<p>Draco squinted at him. Potter held a small, silver flask in his hand, right in front of Draco's nose. </p>\n<p>\"Malfoy family heirloom.\" Draco nodded.</p>\n<p>Potter opened the flask and sniffed with a grimace.</p>\n<p>\"It's a Calming Draught?\" Draco tried again. He couldn't really remember what it was. Lately, there were all these bottles and phials and flasks all over the place. \"Or lube?\"</p>\n<p>\"You got drunk?\"</p>\n<p>Draco was very confused. \"I drank lube?\"</p>\n<p>\"It's Firewhisky.\" Potter's face was suddenly very close. He grabbed Draco's chin much too firmly and stared at Draco's eyes. \"Merlin. What the hell, Draco?\"</p>\n<p>\"No, no. I drank some Calming Draught.\" Draco's head was clearing again. \"And something Pansy gave me. Not that!\" He pointed at the flask. \"That's just… Firewhisky.\" He frowned. \"Oh right.\" Firewhisky laced with antidote for love spells. \"You should have some,\" he told Potter with a — hopefully — innocent grin.</p>\n<p>\"I can't believe this. Why would you do that?\"</p>\n<p>\"Um. I was nervous?\"</p>\n<p>This didn't seem to appease Potter as well as the last time. There was nothing soft about his expression; he just looked pissed off. \"And getting drunk helped you how? You can't even stand.\"</p>\n<p>\"I can stand,\" Draco argued. \"I'm just choosing not to.\"</p>\n<p>Potter tossed the flask on the bed.</p>\n<p>Draco stared at it. \"You should really have some. It will help.\"</p>\n<p>Potter wasn't listening. \"What's wrong with you? I thought you wanted this. Why would you ruin it?\"</p>\n<p>\"I don't want this!\" Except he did. \"I mean, I do want it. I want sex. Of course I want sex. I want to have sex all the time. I just don't want it like this.\" He waved around. \"Not this. This isn't right. This is <i>wrong</i>.\" Draco bit down on his lip to make himself shut up. He was so dizzy. His mind wasn't working properly. But he remembered he wasn't supposed to make Potter angry. That would be dangerous. \"You should drink some Firewhisky,\" he said because he wasn't sure if he'd mentioned it before.</p>\n<p>But Potter was looking less and less angry and more and more hurt. Which was good, actually. Because a Potter who was hurting was more likely to drown his sorrows in whisky and less likely to hex Draco to death.</p>\n<p>If only Draco could remember how he had hurt Potter. There were words coming out of his mouth, but he could not remember their meaning.</p>\n<p>Potter helped him out unknowingly. \"If you thought this was so wrong, you should have told me sooner.\"</p>\n<p>\"Wrong! Yes!\" Draco was pleased he remembered what to say. \"This is wrong. Very wrong. All kinds of wrong. And gay. So very gay. You know? Which is… not my thing? It's just ugh, right? <i>Ugh</i>.\" Draco pretended to shudder. \"Urghh—\"</p>\n<p>\"I got it,\" Potter snapped. He was putting his clothes back on with jerky tugs and pulls. He looked miserable.</p>\n<p>\"I'm sorry,\" Draco said because he truly was sorry. He had hoped for more kissing. Things went south much too soon. Potter didn't even drink the antidote, but he seemed to hate Draco enough to break through the spell himself or else he wouldn't just give up.</p>\n<p>\"Come on,\" Potter said. \"We should go. I have to Vanish this and lock up the place.\"</p>\n<p>Draco felt like saying something nice. \"These sheets are really pretty.\" He patted the silk. \"I love them.\"</p>\n<p>\"Please. Get up and go.\" Potter sounded tired.</p>\n<p>\"We could have a nap first?\"</p>\n<p>\"Draco…\"</p>\n<p>\"Can I keep the sheets? I can't Conjure silk, and I don't have silky sheets here in Hogwarts. Everything is <i>cotton</i>.\"</p>\n<p>Potter grabbed Draco's upper arms and pulled him up. The world spun. Potter was staring at Draco's eyes again.</p>\n<p>Draco grinned. \"You're pretty, too. Can I keep you?\"</p>\n<p>Potter's grip eased; it felt more like a hug now. \"You can't even walk, can you?\"</p>\n<p>\"Of course I can. I just… can't see very well.\"</p>\n<p>Potter's face darkened, and Draco felt himself falling forward. He hoped Potter was there to catch him.</p>\n<p>\n<b>TBC</b>\n</p>\n<p>The morning looked warm and sunny, likely just to spite Draco with too bright light that was becoming fast friends with his pounding headache. Opening his eyes was a chore that exhausted all of his energy. He didn't even manage it in the end. Things he truly wanted to see were in his head, anyway.</p>\n<p>Last night was a blur. He remembered being manhandled, dragged and pushed by more than one pair of hands. He was sure Blaise had tucked him in. He could still smell Blaise's sweet body lotion and hear lots of grumbling and insults as his clothes were pulled off. He remembered some of what had happened before that, too. Potter's angry, hurt expression was more vivid than any other memory. There was no point in dwelling on that, though. It was the plan, wasn't it? One that his mind had concocted in an addled state, but it still made some sense even now. All Potter had to do was be hurt enough to recognise the temptation the Firewhisky offered. It was a better plan than his original one, which consisted of Draco randomly offering Potter Firewhisky. The potions Draco had consumed had given him courage; he'd not have dared to risk pissing Potter off otherwise.</p>\n<p>\"Drink this.\"</p>\n<p>Draco squinted at Blaise, who was leaning over him, peering into Draco's face with a frown.</p>\n<p>\"You look like shit,\" Blaise informed him. \"Here. Drink.\" He had a small phial in his hand.</p>\n<p>\"No.\" Draco shook his head, which only made his headache worse. \"No more potions. I don't want to see a single potion for the rest of my life.\"</p>\n<p>\"Well, excuse me.\" Blaise stuffed the phial in his pocket. He got insulted easily these days. \"I didn't realise you're enjoying your hangover.\"</p>\n<p>\"I'm not hung over!\" Draco sat up even though moving too much made him queasy. \"I didn't drink a single drop of alcohol yesterday.\"</p>\n<p>\"Right. You didn't get drunk, Harry Potter is not your boyfriend, you two didn't have a nasty fight, and you're in a spiffing mood. Is that your story?\" Blaise said it all with far too much sarcasm, as though he knew better. As though Potter being Draco's boyfriend was a thing a perfectly sane person could assume.</p>\n<p>\"No, that's not my story. I'm in a terrible mood. The rest is true.\" Well, not quite. \"I suppose it's true we had a fight.\"</p>\n<p>Blaise shrugged. \"I predict swift reconciliation, considering Potter took the time to Transfigure your sheets into silk.\"</p>\n<p>Draco looked down, only then noticing the soft, cool touch of fabric against his skin. The sheets were unmistakably silken. Draco's heart beat a little faster, his hand caressing the sheets in wonder. Was this what having Potter for a boyfriend was like? He was well aware that, from Potter's perspective, Draco had been drunk and had behaved like a complete dick yesterday. He didn't deserve silken sheets, but he got them anyway.</p>\n<p>Draco wished Potter were his boyfriend. He'd run to him right now, say he was sorry and get him back. But really, this only proved that Potter was the victim of a spell-induced obsession. Potter would not have taken him to the dormitory, tucked him in and Conjured silken sheets had he not been under a love spell. Or maybe he would have. He was probably the perfect boyfriend just so the universe could mock Draco for wishing he had someone like that, knowing it would never happen.</p>\n<p>\"He's under a love spell,\" Draco said, not without sadness. \"Probably not anymore, though.\" He had no business regretting that. Whatever had caused Potter to behave like this had to be reversed. Sooner rather than later because Draco could no longer stand it.</p>\n<p>Blaise was gaping at him. \"You put Potter under a love spell?\"</p>\n<p>Draco wondered if he should feel vindicated for predicting everyone would think he had done this to Potter.</p>\n<p>\"Are you insane?\" Blaise sounded scandalised.</p>\n<p>Draco thought it best not to answer that question because he was pretty sure the answer was <i>yes</i>. And, really, his sanity was beside the point. Sane or insane he had done nothing to Potter. \"It wasn't me,\" he gritted out. \"Someone else did it. That's why he's been acting like...\" Draco tugged on the sheets. \"This.\"</p>\n<p>Inexplicably, that statement seemed to have calmed Blaise down. \"I see. Potter being under a love spell is your <i>theory</i>.\" He had said that very slowly. \"Has it occurred to you that Potter is with you of his own free will, and you're just ruining it with your self-esteem issues?\"</p>\n<p>Draco stared at him.</p>\n<p>\"Is this about your father? I know he wouldn't approve. Not a bloke, definitely not Potter. But, Draco—\"</p>\n<p>\"Goddammit, Blaise, shut up.\" Draco shot out of bed, annoyed. \"I'm not an idiot. Potter's behaviour isn't normal. If he's not under some sort of spell, then he's just a giant dick. And off his rocker.\"</p>\n<p>\"Well, personally, I wouldn't call Potter normal, and he's definitely a giant dick.\" Blaise grinned. \"Though, the thing with the sheets was adorable, so I'm willing to reconsider.\"</p>\n<p>Draco grabbed a towel and a bathrobe. \"Blaise,\" he said very calmly. \"Potter is not my boyfriend. He only thinks he is, and I'm in the process of fixing it. Hopefully in a way that won't result in me being kicked out of Hogwarts, which was undoubtedly someone's plan. Now...\" He tossed the towel over his shoulder. \"If you'll excuse me.\" He headed for the showers, hoping Blaise would leave him be.</p>\n<p>He had a new theory now: Blaise and Pansy were in this together. They did something to Potter, and now they were trying to mess with Draco's head, with Pansy claiming he was insane for thinking Potter would want something to do with him, and Blaise claiming he was insane for thinking Potter would never want him. </p>\n<p>The only thing this theory lacked was motive. </p>\n<p>And common sense.</p>\n<p>Maybe he was stuck in some bizarre parallel universe where they shipped off people with nervous breakdowns. Or he was actually in St Mungo's, staring blankly ahead, and this was just a dream. </p>\n<p>Draco pinched his arm. It hurt a lot. </p>\n<p>At least he had some luck left, and he managed to shower and dress in peace. But when he went to the common room, he found it empty save for Pansy, who sat on the sofa he had to walk past to reach the door. She had a plateful of sandwiches next to her, though, and Draco's stomach fell in love with her instantly, refusing to let him ignore her and flee.</p>\n<p>\"Are these for me?\" He sat down and snatched a sandwich.</p>\n<p>\"No,\" she said, still staring at the book she'd been reading. \"They're for my sane friend. Seen him around?\" </p>\n<p>\"You poisoned him with your stupid potion, and he hasn't been seen since.\" Draco took a bite of his sandwich.</p>\n<p>\"I didn't tell you to drink all of it!\" Pansy said indignantly. \"Nor mix it with that much Calming Draught. You clearly had more than I thought.\"</p>\n<p>Draco would have argued but the sandwich was ham — his favourite — so he rather busied himself by eating it.</p>\n<p>Pansy had more to say, though. \"Potter carried you in here, you know. In his arms. Like a damsel.\"</p>\n<p>Draco almost choked. \"He <i>what?</i> You're lying. Please say you're lying.\" He didn't even want to imagine it, but the vivid image of the embarrassing scene burst in front of his eyes. He contemplated choking on the sandwich on purpose.</p>\n<p>Pansy snorted. \"Of course I'm lying. The poor thing looks underfed. He'd not have the strength.\"</p>\n<p>Draco's relief knew no bounds. He decided against pointing out that Potter was very fit, thank you very much. One probably had to be held in his arms or at least see him with his shirt unbuttoned to realise it.</p>\n<p>\"It was nonetheless ridiculous,\" Pansy said. \"He half-dragged you, you half-walked. The whole common room saw it. We thought he'd hexed you.\"</p>\n<p>\"You did? Did you fight him? Threaten him?\" Thinking about the entire Slytherin common room surrounding Potter was a fun thought.</p>\n<p>\"Are you mad?\" Pansy snapped her book shut. \"It's Harry Potter.\" Draco must have shown he was none too pleased by this answer because she hurried to add, \"I thought I noticed some people glaring at him?\"</p>\n<p>Draco huffed. \"Some housemates you are. He could have murdered me, and you'd do nothing.\"</p>\n<p>\"Blaise helped him get you to your room.\"</p>\n<p>\"Great. So he could have murdered me, and Blaise would help him get rid of my body.\"</p>\n<p>\"Don't exaggerate. Potter clearly didn't pose a threat to you. It took us just a moment to realise that. I mean, I'm guessing he found you somewhere, and I can only imagine what you told him in your state. And he thought you were drunk; he could have reported you. Instead, he brought you here, and he seemed very concerned, actually. All 'watch the stair' and 'you can do it, Draco.'\"</p>\n<p>Draco took another sandwich. His third. Potter was making this so difficult. Why did he have to be so nice to him? If only Potter had dumped him somewhere and left him for dead. It would be so much easier to go back to hating him. He missed those days. Things were much simpler.</p>\n<p>Actually, no, they weren't. Draco frowned. Two years ago, he'd have been lucky if this were his only problem. But then again, back then, Potter's kindness would be strange and amusing; it wouldn't hurt the way it did now. </p>\n<p>\"So I've been thinking about all this,\" Pansy went on. \"I think maybe you should go for it.\"</p>\n<p>\"Go for what?\"</p>\n<p>Pansy shot him a nervous look, but she clearly wasn't nervous enough to stop talking. \"It just seems like the real cause of your troubles is, well... Like I said, I thought about it, and I realised you have feelings for Potter. Romantic ones. And that's not the end of the world, is what I'm saying. I think you should give it a shot and approach him. Why not? He doesn't appear to hate you, and I hear none of his relationships with girls worked out, so who knows? And even if he rejects you, at least you'll know. And then you can concentrate on finding someone else. I'm sure there's a nice bloke out there just for you. One with better taste in men than Potter. You deserve to be happy, Draco. But you have to fight for it.\" Pansy squeezed his arm.</p>\n<p>Draco swallowed a mouthful. He was out of sandwiches to eat. He supposed that meant he had to comment on Pansy's inane monologue. \"So,\" he said, \"you no longer think I'm having a nervous breakdown? I'm just gay and crushing on Potter?\"</p>\n<p>\"No. I think you're having a nervous breakdown <i>because</i> you're gay and crushing on Potter. And it's perfectly understandable. If I were crushing on Potter, I'd be upset too. He's such a messy thing, with the hair and the glasses and the clothes...\"</p>\n<p>Draco rubbed his face in his palms.</p>\n<p>Pansy patted his back. \"I know. I know, darling. One can't control one's heart. I'm sure having a father like yours isn't helping. I'm sure it's a lot of pressure being the only Malfoy heir. There’s no telling what he'd do if he found out. Disinherit you probably, if you're lucky.\"</p>\n<p>\"Enough!\" Draco shot up. \"I <i>will</i> have a nervous breakdown if you don't stop. You're all crazy. I don't get it. It's like I woke up in crazyland.\"</p>\n<p>\"Draco,\" Pansy said kindly, \"does that seem likely? That everyone's crazy, and you're the only sane person around? If that's how it feels, shouldn't it give you a hint?\"</p>\n<p>\"Yes, I got the hint, thank you. Apparently, no one believes a word I say.\"</p>\n<p>\"Draco…\"</p>\n<p>\"Don't Draco me. I can't take it anymore.\" He wished he had more Calming Draught and Pansy's potion. Though, he <i>had</i> decided not to take any more potions ever. He'd been traumatised by phials. \"We should go,\" he said firmly. \"I can't afford to skip classes.\" Draco checked the time to see how late they were. He blinked.</p>\n<p>\"Er,\" Pansy said. \"It's after lunch. And Professor Hardy is sick, so we're free this afternoon.\"</p>\n<p>\"Right.\" That was shocking. Draco didn't think he had slept quite that long. He looked around the empty common room. \"Where is everyone?\"</p>\n<p>\"Oh! They're at the match. A couple of students organised an impromptu competition. Slytherin and Ravenclaw against Gryffindor and Hufflepuff.\" Pansy stood up with a careful smile. \"Sounds like fun, right?\"</p>\n<p>It really didn't sound like fun, and Pansy clearly agreed, but Draco did want to see Potter. Maybe he had drunk the antidote yesterday, maybe he hadn't. Draco needed to find out to decide what his next step should be. Should he run for the hills or continue as though nothing happened? Or maybe Potter was still in love, and Draco had to find another way to give him the antidote. Blaise and Pansy were of no help, obviously. He was alone in this mess.</p>\n<p>\"All right,\" he said, and Pansy beamed at him.</p>\n<p>\"Excellent. It will do you good. Better than sitting around and moping.\"</p>\n<p>Rather than argue — he was not moping; he had legitimate concerns — Draco settled for a noncommittal grumble, and they went to get their cloaks before walking down to the pitch.</p>\n<p>The entire student body seemed to be there, and they insisted on yelling and whistling with so much enthusiasm Draco was sure his head would explode. The match was a bore, and it went on forever. Potter wasn't even playing, and Weasley was having a good day, rarely letting Slytherin and Ravenclaw Chasers get a Quaffle past him. Slytherin Beaters compensated by trying to hospitalise every Hufflepuff on the other team, and Draco predicted a massacre, ending with everyone losing house points. It looked like the Slytherin-Ravenclaw combination might win, though. Not only was Potter absent, the Hufflepuff Seeker was nowhere to be seen, either, and his replacement was abysmal.</p>\n<p>Bored out of his mind, Draco snuck away after putting his Omnioculars to good use and searching the whole pitch for Potter. He couldn't find him or Granger anywhere in the stands, but he did spot them eventually. They were sitting on a wooden bench in front of Hagrid's hut and appeared to be in a heated discussion. Draco went all the way round and sneaked up on them from behind, hidden by the walls of Hagrid's hut. It was a good thing the snow had melted or else they'd surely hear him.</p>\n<p>They were whispering, and Draco had to creep even closer. He should not have bothered.</p>\n<p>\"I'm not defending him!\" Granger burst out. \"I'm just saying this shouldn't be such a surprise, Harry. It's Malfoy.\" Draco winced and quickly took a few steps back. This was it, then. Potter had drunk the antidote, realised he'd been under a love spell and, naturally, blamed Draco. \"Did you really expect him to change?\" Granger went on. \"You must have known something like this would happen.\"</p>\n<p>Draco seethed. This was simply unfair. Did Granger honestly think that it was only a matter of time before Draco did something evil and stupid? That was really quite judgmental.</p>\n<p>Potter grumbled something unintelligible.</p>\n<p>\"I know,\" Granger said. \"And I get it. But I just think you must have been expecting this, at least to a certain extent, but you've done nothing about it for a reason. And that reason still exists. I'm thinking of you, Harry. I don't want you to have any regrets. Honestly, I expected worse things from him. When you think about how he was raised and who his father is…\" Granger sighed. \"Oh, for heaven's sake. I can't believe I'm saying this. To be perfectly honest, I just want to slap him. But… But maybe you should wait before you make any drastic, final decisions.\"</p>\n<p>Draco took a fearful step back. And then another. What drastic, final decisions did Potter plan to make? Tell McGonagall? Get Draco kicked out of Hogwarts? Something even worse?</p>\n<p>Draco carefully retreated and then turned and sprinted for the castle. He had to do something. Prevent it, minimise the damage. He could demand to be questioned under Veritaserum and prove his innocence. It would reveal some embarrassing facts about Draco's feelings for Potter, but what choice did he have? Would they even let him defend himself with a truth potion? He needed a solicitor, and he needed one fast.</p>\n<p>Draco went straight to his dormitory, with a half-formed plan that included owling his mother and fleeing the castle. On his broom if it came to that.</p>\n<p>He burst into the dormitory, completely out of breath, and went straight for his trunk. There was probably no time to write a note and run to the Owlery. His best chance was to grab his warm cloak, Summon his broom and head for the manor. His father wouldn't be pleased, but he would have to help. </p>\n<p>Oh Merlin. He'd forgotten. He would never be allowed to defend himself with Veritaserum. There was more than his fantasies about Potter at stake. He'd risk babbling about the war and all the incriminating things that had transpired. He was screwed.</p>\n<p>\"Do you mind?\"</p>\n<p>Draco spun around and blinked at two half-naked people on Blaise's bed. It took him a moment to process the visual. Blaise was, apparently, making out with the missing Hufflepuff Seeker.</p>\n<p>\"Sorry,\" Draco managed, trying hard not to ogle. They were both rather fit, and seeing two blokes together like that excited him more than he cared to admit. Merlin, he was frighteningly gay. If he weren't already having a nervous breakdown, he'd have one now. Pansy would be pleased. \"I'm just here to get my cloak.\" He tore his gaze away and focused on searching through his trunk.</p>\n<p>\"Are you all right? You look horrible.\" Blaise got up and walked over.</p>\n<p>\"I'm fine. I'm just…\" Draco looked up from the futile search for his warmest travelling cloak. An idea occurred to him. \"Blaise, can you please owl my mother? Tell her I'll be home shortly and she should contact Mr Anderson immediately. Have him come to the manor. Please, an owl will be faster. I'll have to avoid Muggle areas, and it's too cold to fly high.\"</p>\n<p>Blaise didn't move; he just stood there with his perfect, chiselled chest, making Draco feel bad for not working out more. \"What the fuck are you on about?\" Blaise asked. </p>\n<p>Draco took a deep, calming breath. \"I told you. Someone put a love spell on Potter, and he thinks it was me. He'll try to get me expelled. I have to act fast. I can't get expelled. I just can't. I need my N.E.W.T.s. They barely let me come back. Don't you get it? And where the fuck is my cloak?\"</p>\n<p>\"The wardrobe?\" Blaise suggested, and Draco realised he was right.</p>\n<p>He ran to the wardrobe and found the cloak hanging there. At least Blaise helped with that; he didn't seem inclined to send any owls out even though Draco had said please twice. He had no intention of begging. He threw the cloak around his shoulders and glared. \"Will you help me or not?\"</p>\n<p>\"I will,\" Blaise said, then took out his wand and yelled, \"Expelliarmus!\"</p>\n<p>Draco was too surprised to react. His wand flew out of his pocket into Blaise's waiting hand.</p>\n<p>\"What the hell? Give it back!\" Draco would have lunged forward, but Blaise had both wands pointed at him.</p>\n<p>\"I'm helping you, you insane creature,\" Blaise said through his teeth. \"You've been acting bizarre since Sunday, but it seems you've finally lost it. I'm not letting you fly out there. Not in the state you're in. You're likely to crash and die. I'm not having that on my conscience.\"</p>\n<p>Draco had had enough. \"I am not crazy!\"</p>\n<p>\"You do seem a bit crazy,\" said the Hufflepuff, who was still inexplicably there. And still shirtless. And still distractedly fit.</p>\n<p>\"Who asked you?\" Draco snapped. \"And who are you, even? Go away!\"</p>\n<p>\"Hey!\" Blaise glared at Draco. \"Don't talk to him like that!\" He turned towards the Hufflepuff and said more kindly, \"You should probably leave, though.\"</p>\n<p>\"Yeah, sorry.\" The Hufflepuff — Brian Barnaby, Draco remembered — jumped up from the bed and snatched his shirt from the floor. \"This is just very interesting. Love spells, broom getaways, disarming!\" He grinned. \"Slytherins have all the fun, apparently.\"</p>\n<p>\"Leave now,\" Draco gritted out before turning to Blaise. \"And you! You don't want my death on your hands? What do you think will happen if my father gets an owl from the Headmistress, telling him his son got expelled for casting a love spell on Harry Potter? I have to explain things to him before that happens!\"</p>\n<p>\"He's got a point there,\" Barnaby commented. He was still shirtless. \"Sorry, sorry,\" he said when both Draco and Blaise turned to glare at him. He hastily pulled on his shirt. \"I'm just saying. The man has a temper. I saw how he reacted when he found out Draco got kicked from the team.\" He grimaced at Draco. \"Tough luck, mate.\"</p>\n<p>\"I'm not your mate, and my father doesn't even know I was kicked out, so shut about things you know nothing about!\"</p>\n<p>That wiped the smile from Barnaby's face. \"Right,\" he said, moving towards the door. \"Sorry. I just assumed that's what you fought about this Saturday, during the match. I just… get it, you know? A father like that.\" He whistled. \"Worse than mine. Er, but you don't care. Sorry. I'll just—\" He pointed at the door and grabbed the knob.</p>\n<p>Draco stared at him.</p>\n<p>\"Your father was here?\" he heard Blaise ask. \"This Saturday?\"</p>\n<p>\"No. No, he wasn't.\" Draco had no idea what Barnaby was on about, and if he had more time he'd make sure to investigate his motives, but for now he just wanted him and his made up stories gone.</p>\n<p>Barnaby turned. \"Er, okay. If you say so.\" It looked as though he'd finally leave, but apparently he just couldn't shut up. \"Except I saw him. And you. Out by the lake, fighting.\"</p>\n<p>\"Was the Dark Lord there, too? Did we all hold hands and sing a pretty song?\"</p>\n<p>Barnaby's lips thinned. Apparently, he didn't enjoy sarcasm. \"I had my Omnioculars. I zoomed in,\" he insisted, and then must have realised how that sounded. \"I mean, I'm sorry. I didn't watch on purpose. It was a boring match, and I was… Well, I was just so surprised when I found out you were gay. Because you're a Malfoy and I just… thought that was interesting. And... it's hard not to notice you from afar. With the hair and all. And, really, Draco, it's impossible not to recognise your dad.\"</p>\n<p>Draco had to take a deep breath before he could speak with some semblance of calm. \"Stop talking to me like you know me.\" He whipped around to glare at Blaise. \"What have you been telling him?\"</p>\n<p>Blaise didn't even have the decency to look guilty. He was staring at Barnaby. \"You saw Lucius Malfoy here, this Saturday? And you didn't tell me?\"</p>\n<p>\"He wasn't here,\" Draco gritted out, but Blaise ignored him.</p>\n<p>\"I didn't realise it was a secret,\" Barnaby said. \"I thought you knew. You said he's acting funny because of his father, didn't you?\"</p>\n<p>\"I'm not the one acting funny!\" Draco shouted. \"And for the last time, he wasn't here. I'd remember.\" Of course he'd remember his father being here. He'd definitely remember fighting with him. Barnaby was making this up. For reasons Draco couldn't understand, but that was nothing new — he understood nothing these days. </p>\n<p>\"Draco.\" Blaise was suddenly in front of him, squeezing his shoulders and peering into his face.</p>\n<p>\"I'm not lying! I have no reason to.\" Draco pointed at Barnaby. \"He's lying.\" </p>\n<p>But Blaise was still staring at him as though Draco held the answers. \"What <i>do</i> you remember? Do you remember what you did this week? This month? The month before?\"</p>\n<p>That was a stupid question. \"Of course I do! I was studying. Our N.E.W.T.s are approaching. I had to study. So I did.\" He remembered studying. He remembered studying a lot. \"Why are you asking me that? Barnaby is making things up! My father wasn't here. It's a lie.\"</p>\n<p>Blaise just wouldn't stop staring.</p>\n<p>Something hard and tight coiled around Draco's throat. It pressed in, spread to his chest, his stomach. His eyes were burning. \"I was <i>studying</i>,\" he repeated. </p>\n<p>A horrible thought tried to reach his conscious mind, and Draco desperately pushed it back.</p>\n<p>\"What else? What else did you do?\"</p>\n<p>\"I don't know! Things!\" Draco struggled to free himself from Blaise's grip, but it was hard to breathe; it made his limbs feel heavy. He remembered vague conversations and going to sleep and having breakfast. But studying stood out the clearest. And classes and homework. Nothing else mattered.</p>\n<p>\"Do you remember meeting Brian? Two weeks ago? You found us here, like you did today.\"</p>\n<p>Draco shook his head; he shook it so hard it hurt. \"That didn't happen.\"</p>\n<p>\"It did happen. We thought you'd tell the whole castle. But you didn't. Instead, you told us about the bloke you like. That you're with.\"</p>\n<p>\"I'm not with... With anyone. Certainly not a bloke.\"</p>\n<p>\"You are. You were. And you were happy. Do you remember being happy?\"</p>\n<p>Draco's vision blurred. He had to blink a few times to clear it. He didn't even know why he felt like crying. </p>\n<p>\"Draco?\" Blaise said his name gently, the way one whispered when talking to someone gravely ill. \"You get what happened, don't you?\"</p>\n<p>\"No.\" <i>No, no, no. </i>\"You're lying. You're both lying.\"</p>\n<p>\"You never told me his name, you know. But I guess now it's obvious who it was.\"</p>\n<p><i>Draco. Talk to me. There's nothing you can't tell me.<br></i> <br>\"No.\"</p>\n<p>\"It was Potter.\"</p>\n<p>\"No.\"</p>\n<p>It couldn't be. Potter was under a love spell. And his father was never here. These were the facts.</p>\n<p><i>What's wrong with you? I thought you wanted this. Why would you ruin it?<br></i> <br>\"Draco?\" Blaise shook him. \"Draco, you've been Obliviated.\"</p>\n<p><i>We wouldn't want to be seen together, now would we?<br></i> <br>\"It can't be. Potter is... Potter hates me, and he's Potter. How would that even...?\"</p>\n<p><i>I could kiss you for hours.</i><br><br>\"I don't know. You never gave me any details. You probably thought I wouldn't believe you.\"</p>\n<p>Who would believe it? Draco certainly couldn’t. He tried to imagine it. Potter and him, an item, meeting in secret, talking about their lives and plans for the future. It seemed like a dream too bizarre for his mind to conjure even in an unconscious state. It could never be real.</p>\n<p>Could it?</p>\n<p>\"Maybe I'm just crazy. Maybe I was always crazy.\"</p>\n<p>\"Well, I'm not crazy,\" said Barnaby. \"I know what I saw. And if you don't remember it, then you were Obliviated.\"</p>\n<p>\"Brian's right, Draco. We remember something you don't. You should see Pomfrey. And you have to report this. To McGonagall or someone.\"</p>\n<p>\"Or someone,\" Draco repeated.</p>\n<p>\n<i>There’s nothing you can’t tell me.</i>\n</p>\n<p>Could it be true? How many times did Potter kiss him, touch him, smile at him? And Draco remembered none of it. It was all taken away. By his father. That at least could definitely be true. \"I have to...\" <i>Find Potter.</i> \"Go.\"</p>\n<p>\"Wait!\" Blaise pulled him back the moment Draco stepped towards the door. \"Do you need me to go with you?\"</p>\n<p>\"No,\" Draco said, even though he really wanted someone to go with him to tell him what was real and what wasn't. In his mad state, he might address a suit of armour thinking it was Potter.</p>\n<p>\"I think you should go to Pomfrey first,\" Barnaby said, actually looking concerned.</p>\n<p>Apparently, Draco also had two friends he didn't know about.</p>\n<p>\"I'll be fine,\" he said and walked out, trying hard not to run.</p>\n<p>\n<b>TBC</b>\n</p>\n<p>Was Potter still on the grounds with Granger? Was he at the match? Somewhere else? In the castle? Draco had no idea.</p>\n<p>He stopped to catch his breath. A quick look around told him he was near the Entrance Hall. He'd been running without a clear goal. He had to pick a sensible direction.</p>\n<p>Although, he wasn't in such a big hurry now, was he? If Blaise was right, reporting Draco for casting a love spell wasn't the drastic, final decision Potter had planned to make. What was it, then?</p>\n<p>Maybe Potter wanted to break up and never see him again. Draco laughed. How drastic and final. He'd lose a boyfriend he never had.</p>\n<p>Draco fell silent, looking around. Laughing out loud while alone in a corridor wasn't the sanest thing to do. His laughter had sounded maniacal to his own ears. Maybe he was crazy after all. Honestly, a nervous breakdown seemed like an emotionally safer option. He knew how to deal with that. Pansy had done it. There was a potion for it. But how was he supposed to deal with his father Obliviating him? With memories of being with Potter locked in his mind? Would he ever get them back? Memory charms were tricky, and there were all kinds of them. What if he had lost those memories forever? How it all happened, how he felt about it, their first kiss, the apparent happiness Blaise talked about.</p>\n<p>And even if Potter believed him and agreed to describe it all, it would never feel real.</p>\n<p>But it couldn't have been real. What if <i>all</i> his theories were true? What if he had lost his mind? And <i>then</i> he'd cast a love spell on Potter? And <i>then</i> his father Obliviated him?</p>\n<p>The massive Hogwarts door burst open, and a large group of Gryffindors and Hufflepuffs walked in. Their chatter was unusually low and subdued. They must have lost the match. Which was just wonderful. Now Potter would be even angrier. </p>\n<p>Draco considered fleeing. Talking to Potter first was a risk. He should try Madam Pomfrey. </p>\n<p>A dozen students headed for the Great Hall for dinner, but a number of older Gryffindors lingered, apparently for no other reason than to give Draco odd looks. Potter was with them; Draco only noticed him when he moved to the front, looking very surprised. </p>\n<p>\"What happened?\" Potter asked, and everyone fell silent, staring at Draco. </p>\n<p>For a horrifying moment, Draco thought that there was yet again something everyone knew except him, but then he realised — he must have looked a sight. He felt hot and sweaty from all the running in the heavy travelling cloak; his hair must have been a right mess, too. And he must have looked as confused and terrified as he felt. </p>\n<p>\"I was just—\" Draco fell silent, unnerved by having that many Gryffindors watching him as though he were about to say something shocking. If he were them, he'd assume he was there to mock them for losing the match. He must have looked worse than he could imagine. Potter didn't even look angry anymore, just worried.</p>\n<p>Draco's chest constricted. To think Potter was worried about him, to think he had Conjured silken sheets for him despite being hurt and angry. Was being with Potter always like this? Was this one of the things Draco was forced to forget? </p>\n<p>He wanted it back.</p>\n<p>Draco sucked in a breath and looked Potter in the eye. \"I need to talk to you. In private.\"</p>\n<p>\"What happened?\" Ginny Weasley burst out. \"Did someone attack you?\" She looked behind Draco as though she expected to see a monster there, chasing him. Several people went for their wands. </p>\n<p>People panicked easily these days, Draco reflected.</p>\n<p>Potter at least seemed to realise there were no monsters around. \"Er, sure. We can go outside,\" he said, then looked between Granger and Weasley. </p>\n<p>\"Come on, you lot. I'm hungry,\" Ron Weasley said, apparently understanding Potter's silent message. </p>\n<p>\"Yes! Quite hungry,\" Granger agreed, tugging on Ginny's arm and pulling her towards the Great Hall. Some of the Gryffindors followed them, but others weren't that easy to convince. </p>\n<p>Potter walked over, looking as though he wanted to grab Draco's forearm but thought better of it. \"Come on,\" he said and headed for the exit.</p>\n<p>They didn't go far. Potter paused at the steps and turned towards Draco. Several students lingered in the Entrance Hall, craning their necks, but Draco ignored them and faced Potter. </p>\n<p>\"That was rather public,\" Potter said.</p>\n<p>Draco couldn't help feeling insulted. Was their relationship a secret because Potter was ashamed of him? \"Did you mind?\" </p>\n<p>It was the wrong thing to say. \"Did <i>I</i> mind?\" Potter looked angry again. </p>\n<p>Draco wished he knew what was truly happening. Then he'd know what to say next. Vagueness was his friend, he concluded. \"My father was here on Saturday,\" he said.</p>\n<p>Potter blinked in obvious confusion, but then comprehension crept into his expression. Along with more anger. \"I see. Well, that's just great. I suppose it explains everything. I mean, everything except why you let him control your life. Draco, we talked about —\"</p>\n<p>Potter saying his name gave Draco courage. \"I don't remember it.\"</p>\n<p>Potter frowned. \"What?\"</p>\n<p>\"I don't remember him being here. I was told he was here. And apparently he talked to me. We were seen.\" Draco studied Potter's face, looking for clues. Something that would make things clear to him: should he explain himself further or run?</p>\n<p>\"I don't—\" Potter shook his head. \"I don't understand what you're saying.\"</p>\n<p>\"I'm saying there's a lot I don't remember. These past few months are a blur. I remember studying and… That's pretty much it.\"</p>\n<p>\"I... I don't believe you. You're making this up.\"</p>\n<p>\"Why? Why would I do that?\"</p>\n<p>\"I don't know! Because... Look, Malfoy, if you want to end this, that's fine. As a matter of fact, I want to break up, too. So you don't have to— why are you smiling?\" Potter looked unnerved, but Draco felt so light he thought the next gust of wind might blow him away.</p>\n<p>\"Break up? You want to break up?\"</p>\n<p>\"No need to look so pleased about it, Malfoy!\"</p>\n<p>\"So it's true? There's something <i>to</i> break?\"</p>\n<p>\"Stop it!\" Potter jerked away, and Draco realised he'd been clutching Potter's shoulders. \"You're lying. You remembered everything just fine yesterday.\" Potter no longer sounded completely sure, so Draco pressed on.</p>\n<p>\"But I didn't. I just didn't want to show it. I thought it was some sort of joke. That you were pretending we were an item to mock me. Or that you were under some kind of love spell.\"</p>\n<p>Potter took another step back. \"That's ridiculous. You're ridiculous. If you want to pretend that the last two months never happened, then go ahead. I can do it, too.\"</p>\n<p>\"Two months?\" Draco was temporarily distracted. \"We've been together for two months? And we didn't have sex yet? What are we, twelve?\"</p>\n<p>Potter blinked. \"We did have sex.\"</p>\n<p>\"Then what was yesterday about?\" Judging by the way Potter had been acting, Draco thought yesterday was supposed to be their first time.</p>\n<p>Potter stepped closer and peered into Draco's eyes, as though he'd find an answer there. His chest rose and fell rapidly. \"You really don't remember?\" he asked with a healthy dose of caution, but Draco was sure his tone was full of hope. Potter <i>wanted</i> to believe him. \"Do you remember the snow fight?\"</p>\n<p>Draco remembered many snow fights, but he had a feeling he didn't remember the one Potter was referring to. \"We had a snow fight. My God, we are twelve.\"</p>\n<p>\"But it can't be. If you don't remember any of it, you wouldn't be here. You hated me before. You wouldn't care. You'd be glad you lost those memories.\"</p>\n<p>Draco had to laugh at that, if somewhat bitterly. \"My father would have to erase at least two years from my mind to make me not care. I don't know what happened to you in this snow fight, but it happened to me long before that.\"</p>\n<p>Potter's eyes widened. \"You never told me that.\"</p>\n<p>\"Oh.\" Draco smiled, abashed. \"I must have had a reason. Which I can't remember.\"</p>\n<p>Potter was the one clutching Draco's arms now. He looked hopeful, excited, worried. \"We should go see Pomfrey.\"</p>\n<p>\"Yes. Yes, we should.\"</p>\n<p>Potter seemed surprised Draco had agreed so easily, and he took Draco's hand, pulling him towards the castle.</p>\n<p>Draco allowed himself to be dragged, imagining all kinds of horrible scenarios. Like Pomfrey saying there was nothing wrong with his memory. Or finding something wrong only to declare she can't fix it. Or Draco remembering everything and realising he had given Potter a love potion during the snow fight. He should have asked Potter whether he had drunk any Firewhisky yesterday. Taken a sip at least.</p>\n<p>\"If Pomfrey can't help, maybe Hermione can,\" Potter was saying. He sounded anxious. \"She restored her parents' memories without a glitch. She did so much research on the subject. She knows all the experts on Memory charms.\" They entered the Hospital Wing, which was empty. \"Maybe she's at supper. I'll check her office.\" Potter gave Draco's hand a little squeeze and ran off.</p>\n<p>Draco sat up on one of the hospital beds, not trusting his shaky legs to support him much longer. Mercifully, he had no time to mentally go through worst scenarios again because Madam Pomfrey walked in, waving her wand and grumbling. \"Another Quidditch accident, is it? I swear this sport ought to be banned.\"</p>\n<p>Potter hurried back to Draco's side. \"No. We think he's been Obliviated.\"</p>\n<p>Draco hated how unsure Potter sounded, but then again Draco didn't trust himself either.</p>\n<p>\"Oh my!\" Pomfrey grabbed Draco's chin and turned his head this way and that, peering into his eyes. \"Who was it? When? Any other symptoms? Headaches?\"</p>\n<p>Draco chose to answer the safest question. \"Yes, headaches.\"</p>\n<p>\"Anxiety?\" Pomfrey pointed her wand at Draco's forehead. \"Paranoia?\"</p>\n<p>\"Er, yes.\" He didn't realise anxiety and paranoia could be symptoms. It gave him hope, but it was still hard not to be apprehensive when Pomfrey said, \"Let's see, then,\" and muttered a spell. Draco closed his eyes.</p>\n<p>\"Hmmm,\" she said. \"There's nothing here… Oh wait, there it is.\" Draco sucked in a breath and opened his eyes. \"A bit of a tangle, it seems. Quite contained. Well, that's fortunate. There's no tissue damage. Whoever did this was careful not to harm your brain function.\"</p>\n<p>\"I'll send them a thank you note,\" Draco said. It really happened, then. His father really did it. Draco wasn't sure how he was supposed to feel about that. Angry, probably, but he was mostly disappointed. And to think he had believed his father couldn't disappoint him any more than he already had.</p>\n<p>\"Quite a skilled spell for a... Hogwarts student?\" Pomfrey's eyebrow was raised.</p>\n<p>\"Mmm,\" Draco said noncommittally.</p>\n<p>Pomfrey looked like she wanted to say more but thought better of it. She was usually good about not asking too many questions. </p>\n<p>\"Can you restore his memories?\" Potter asked. He was clutching Draco's hand again. Draco hadn't even noticed. It was a warm, welcome comfort. He squeezed Potter's hand more tightly, worried Potter might pull away.</p>\n<p>\"It's likely, yes.\" Pomfrey was frowning. \"I'll need you to drink a potion for protection. The side effects of the spell I must use can be overwhelming. The potion will make you feel a bit lightheaded, though.\"</p>\n<p>Draco recognised a euphemism when he heard one. \"Please, no potions. I'm sure I can handle it.\" The last thing he needed was more potions affecting his brain and making him feel like he wasn't himself.</p>\n<p>Potter seemed to have understood. \"I'm sure he can, Madam Pomfrey,\" he said in a charming way that Draco was sure would make everyone do what he asked. Pomfrey was immune to it, though.</p>\n<p>\"If I say he needs a potion, then he needs a potion,\" she said tartly and headed for the cabinets on the other side of the room.</p>\n<p>Draco seized the moment to whisper urgently at Potter. \"Did you drink any Firewhisky at all yesterday?\" </p>\n<p>Potter looked very confused. \"What? Why? No.\"</p>\n<p>Draco's heart sank. Potter could still be under a love spell. \"Not even a sip?\"</p>\n<p>Potter shook his head. \"What are you —?\"</p>\n<p>Pomfrey was back. \"Drink this,\" she ordered, handing him a phial, and Draco obeyed, knowing it was pointless to argue. Then she gripped Draco's chin again and said, \"Stay very still.\"</p>\n<p>Draco clutched Potter's hand as Pomfrey shot a spell at his forehead. The effect was immediate, taking Draco's breath away with its intensity. It felt as though someone threw him headfirst into a cold lake. </p>\n<p>Memories flooded his mind without order or reason. But even more intense than that was the onslaught of emotions, which replaced the emptiness filled with nothing but studying and routine. He remembered the joy of his morning flights, lingering anger at being kicked off the team, sadness that hit him every time he saw Crabbe's empty bed. He remembered worrying about Pansy, who was fighting depression and was getting steadily worse. He had switched her Calming Draught with apple juice because she was mixing it with other potions and it was doing her no good. </p>\n<p>He remembered catching Blaise and Barnaby in bed one day. They were worried, thinking Draco would spread the story. They'd calmed down only after Draco confessed he was quite gay himself and promised he wouldn't tell a soul. Barnaby had shaken his hand, saying, \"You're all right,\" and Blaise had been helping Draco with his Transfiguration homework ever since.</p>\n<p>More than three months had been taken away and some things before that in patches. Pieces of his memory were coming together, and Draco remembered Potter now, too. Memories of him burned slowly, outshining all others, as though his mind struggled to present them with care. Maybe that was a part of Pomfrey's spell. To make the intense ones unfold carefully.</p>\n<p>He remembered the snow fight. It happened just after Christmas holidays. He'd been freezing in an ambush, waiting for Potter to walk past, so he could dump as much snow in his face as possible. It was meant to be a prank, a way to piss Potter off, to make him notice Draco and glare at him the way he used to glare. But it turned into a battle, harmless snowballs their only weapon. They were out there for hours, having too much fun to be angry. Potter's cheeks were pink, and he laughed whenever one of his snowballs found its mark. His laughter was infectious, as were his good spirits. They wobbled to the castle, like two frozen fools, and Potter said, \"We should do this again.\"</p>\n<p>So they did it again. And again and again. And now Draco knew which snow fight Potter was talking about. Not the first one, but the one that happened weeks later. When the fight resulted in Potter pushing Draco down on his back, straddling him, and then instead of feeding him snow, he kissed him. He remembered how it felt. How the kiss warmed his frozen bones. How shocked Potter was even though he initiated it. Potter had run away; it was the first time Draco saw Potter running from something. It had given Draco the courage to go after him and kiss him back.</p>\n<p>More kissing followed, in cupboards and broom sheds, hidden passageways and every dark corner the Hogwarts castle possessed. </p>\n<p>And it wasn't just kissing. Draco definitely remembered the sex now. Their messy, nerve-wracking first time that resulted in embarrassment rather than orgasms; their diligent future efforts with much more pleasurable results. </p>\n<p>His mind lingered on their last encounter. It happened on Friday night, a day before the Quidditch match. They'd been lying on the floor of a hidden passageway, on top of their cloaks and robes. Draco trailed his fingertips against the smooth skin of Harry's inner thighs, gathering courage. \"Maybe, we could do it a bit differently sometime,\" he had said, his fingers slipping boldly between Potter's legs. Potter squirmed, grabbed Draco's wrist and said, \"Er, sure. Sometime.\" Draco didn't know if that was a promise or rejection. But Potter blushed and added, \"Match tomorrow, remember? I'll have to sit on my broom for hours. So. Sunday, though. We'll do fun things on Sunday.\"</p>\n<p>\"Quidditch is stupid,\" Draco had grumbled, and Potter had kissed his grumpiness away.</p>\n<p>They talked about Quidditch all the time. It was a safe subject. It was even safe to fight about it. But he remembered other conversations, too. More serious ones about the war. It was never safe to fight about that but fight they did. About who they were and who they should be, about charging forward and clinging to shadows. Draco definitely didn't want to charge. He wanted to keep their relationship secret. He expected they wouldn't last. There was no need to risk his future and inheritance for it.</p>\n<p>But he was beginning to change his mind.</p>\n<p>He remembered writing a letter to his mother, telling her of his classes and friends and hinting of something more happening with Potter. His father showed up at Hogwarts two days after he had sent that letter. Draco remembered his horror turning to numbness as his father pointed a wand at his head and said, \"You ate, you slept, you studied. There were no distractions. Nothing of importance happened; nothing else mattered. Especially Potter.\"</p>\n<p>\"Well?\" Pomfrey's impatient question pulled Draco back to present. \"Don't leave us in suspense! Did you get your memories back or not?\"</p>\n<p>Draco felt his face stretch into a smile he could not control. \"I remember.\"</p>\n<p>Potter tugged on his hand. \"All of it?\" His eyes were wide and worried, and they seemed so different now that Draco had the memory of them staring down at him as Potter rolled his hips and pushed inside him.</p>\n<p>Excitement bubbled in Draco's chest. It was as though he felt too many things at once. He was grateful for Pomfrey's potion now. \"I hope it's all of it,\" he said. \"If there's more…\" Draco grinned even wider. \"I'd blame the loss of memory on sheer exhaustion.\"</p>\n<p>Potter tried to — unsuccessfully — hide his embarrassed laugh with a cough, and Draco remembered Pomfrey was still there beside them. \"That was quite a potent potion you gave me there, Madam Pomfrey,\" he said.</p>\n<p>Pomfrey stared at their joined hands. \"Clearly. All right, then.\" She cast another quick spell at Draco's head, looking pleased with the result. \"Off you go. I'm afraid you won't get a note. You're fine. Return if you develop a headache, but I'll know if you're lying, so don't even bother.\" </p>\n<p>\"Thank you,\" Potter said and tugged on Draco's hand again. Draco hopped off the bed, grateful for being pulled away before he said something even more embarrassing in front of Pomfrey.</p>\n<p>\"Mr Malfoy!\" Pomfrey stopped them. She hesitated for a moment, then said, \"If there's anything you feel you need to tell the Headmistress, she's in her office all evening.\" Her expression was kind and full of concern. </p>\n<p>Draco nodded, knowing he wouldn't accept that offer — this was his father and his problem — but he appreciated it all the same.</p>\n<p>His heart soared the moment they reached the corridor. He pushed Potter against the wall and kissed him with ease and familiarity that was still somehow new and exhilarating. How could he have forgotten this? How could he have suspected love potions and nervous breakdowns when nothing ever felt more real? </p>\n<p>\"I'm so sorry,\" Potter was babbling in between kisses. \"I should have realised. I should have noticed.\"</p>\n<p>Draco shook his head. \"Now I know whose fault this is, Potter, and it's not yours.\"</p>\n<p>\"It's not yours either.\"</p>\n<p>\"Maybe. But I know what I should have done to prevent it.\"</p>\n<p>\"How did he find out?\"</p>\n<p>\"I'm assuming by intercepting a letter I sent to my mother. I didn't tell her everything; I kept it vague. He must have thought that if he made me forget, there would be no one to make me remember.\"</p>\n<p>Potter's expression was tight, his jaw clenched. \"What do you want us to do? What do you want <i>me</i> to do?\" He looked ready to charge the Malfoy Manor and bring Draco's father to justice.</p>\n<p>Draco had to smile. \"Don't worry about it. We should let Mother handle it. I can't think of a worse punishment.\" </p>\n<p>\"I can,\" Potter said darkly.</p>\n<p>Draco steeled his voice as he said, \"This is his loss, not mine. He's the only one who will suffer the consequences here.\"</p>\n<p>Potter looked miserable. \"I'm sorry,\" he said again. \"I should have noticed.\"</p>\n<p>\"I'm sure you would have had I reacted like a normal person.\"</p>\n<p>Potter shook his head. \"I can imagine how confusing it must have been. We have quite a history. I'm surprised I survived after ambushing you all over the castle. If hexing me was the normal reaction you were supposed to have, I'm glad you resisted.\"</p>\n<p>\"Honestly, I just didn't want it to stop. I wanted it to be real.\" Draco couldn't stop staring at Potter's face. The way Potter looked at him, with softness and emotion — Draco suspected he would never get enough of it. </p>\n<p>\"It was real. It <i>is</i>.\" Potter kissed him again, long and slow this time.</p>\n<p>\"Hmm,\" Draco murmured. \"I was wondering where I learned to kiss like that.\"</p>\n<p>Potter grinned. \"By snogging half the Slytherin house. Or so you claimed.\"</p>\n<p>Oh. Apparently, Draco was still fuzzy on some of the details. He waved it off. \"I'm sure you never believed that anyway. You were my first real kiss. I had a practice session with Pansy once, but it was very awkward... <i>What?</i>\"</p>\n<p>Potter was studying him, his bottom lip between his teeth. \"You're all about confessions today.\"</p>\n<p>\"Ah. Well, who knows what all these potions did to my brain? And also... keeping secrets hasn't worked out for me so well, has it? In fact…” Draco stepped back, pulling Potter with him. \"There's something we should do. Right now.\"</p>\n<p>\"Have a celebratory shag?\" Potter asked with a grin.</p>\n<p>\"No. Well, yes, but not right now. First, we're going to the Great Hall.\"</p>\n<p>\"Oh. That's good, too. I'm famished.\"</p>\n<p>\"Mmm,\" Draco said noncommittally. Eating wasn't really what he had in mind, but he said nothing as they walked down to the Entrance Hall. It was one of the most pleasant walks in his life. A part of him felt ridiculous for walking around holding Potter's hand, but another part refused to stop being giddy about it. They hadn't done that before, but Potter didn't seem to find it odd. However, he did look down at their joined hands uncertainly once they reached the Great Hall's entrance and Draco paused in the doorway. Students and teachers were busy eating and chatting, paying no attention to them. Pansy was looking their way, though, with a deep frown, her fork halfway to her mouth.</p>\n<p>\"Er, so,\" Potter said. \"I need help here.\" He gently tugged on Draco's hand. \"I'm thinking, if I don't pull away, you'll be angry; if I do pull away, you'll be angry. I need to know your plan.\"</p>\n<p>Draco pulled Potter close, wrapping his arms around his waist. \"This is my plan.\"</p>\n<p>Potter stared at him, blinking. \"I see. That's a very public plan.\" He looked around the Hall. \"Not really what I had in mind when I said I want to stop hiding.\"</p>\n<p>\"Oh. Sorry.\" Draco tried to pull away, but Potter pulled him back.</p>\n<p>\"No, I get it. You father can't Obliviate half of Hogwarts.\"</p>\n<p>\"Yes, there's that.\" Draco bit his lip. \"But also I just want everyone to know.\"</p>\n<p>Potter laughed. \"I don't think I can handle this level of honesty.\"</p>\n<p>\"I'm afraid you'll have to get used to it. I just a made a resolution. I plan to test it on my father, too, by writing him a letter to tell him — honestly — that he's a giant bag of dicks.\"</p>\n<p>\"What about... possible <i>financial</i> repercussions?\" </p>\n<p>That had always been one of Draco's arguments against making their relationship public. But he had reconsidered. He shrugged. \"I don't plan to go back home, anyway. I do plan to get straight <i>O</i>s on my N.E.W.T.s. And I have a wealthy, famous boyfriend. I'll be fine.\" The best part was Draco truly believed that. </p>\n<p>Potter beamed at him. \"Not that wealthy, I'm sure, but I think I can afford to feed you.\"</p>\n<p>\"That's very kind of you.\"</p>\n<p>\"Well, then...\" Potter pressed closer. \"I think your famous boyfriend is about to become even more famous for shagging Draco Malfoy. But, you know, I'm so often accused of deliberately grabbing public attention it's only fair I do it deliberately at least once. Besides...\" He glanced at the Hall that seemed much quieter. \"It's too late to back down now.\" </p>\n<p>Heat spread through Draco's cheeks and neck. Quite a few students were watching them, pointing and whispering, some with smiles and snickers, others with confusion and frowns. Even some teachers were staring; Slughorn was craning his neck for a better look. The Gryffindors were collectively leaning toward Granger and Weasley, who looked a bit flustered as they shrugged and shook their heads, looking very unconvincing. At the Slytherin table, Pansy was alternating between staring at Draco and her glass, as though she suspected she had one sip of pumpkin juice too many.</p>\n<p>Draco grinned and winked at her. Then he looked back at Potter.</p>\n<p>\"No backing down, definitely,\" he said and pulled Potter in for a kiss. </p>\n<p> </p>\n<p>\n<b></b>\n</p>\n<p>\n<b>EPILOGUE</b>\n</p>\n<p>\"You know what would be really nice?\" Draco said. \"If you were to, for example, say hello to Pansy and ask how she's doing these days.\" The suggestion earned Draco a sideways glance from Potter. \"No, really.\" Draco nodded.</p>\n<p>They were lying on Draco's bed in the Slytherin dormitory, likely to be left alone for a good while longer. Blaise had agreed to keep Nott and Greg busy to stop them from showing up here. He hadn't been thrilled by the request, but Draco had made a sad grimace and said, \"I've been Obliviated by my own father. Don't you think I deserve some comfort?\" Blaise had been quick to point out he recognised blatant manipulation when he saw it, but he had agreed. </p>\n<p>\"Are you trying to pull strings?\" Potter gasped, sounding affronted, but he was smiling. He seemed to be in high spirits. He usually was after shagging Draco silly.</p>\n<p>\"Shamelessly.\"</p>\n<p>\"Hmm. I don't know. I think you should try harder. Make a tempting offer in return.\"</p>\n<p>Draco rolled onto his side and grinned down at Potter. He'd felt spent and lethargic a second ago, but the mere sight of Potter lying naked on Draco's bed was enough to restore his energy. \"I definitely plan to give you something. Now that I know what you want.\"</p>\n<p>\"Is that so? And what do I want, exactly?\" </p>\n<p>Draco's hand travelled downward beneath the covers, lingering teasingly on Potter's hip. \"You want what you offered yesterday.\"</p>\n<p>Potter pursed his lips. \"That wrong, gay thing?\"</p>\n<p>\"That's the one. And by the way, though I am sorry about what I said, I can't believe that you thought that I think that was wrong and gay unlike all the other things we did. And it was my suggestion.\"</p>\n<p>Potter scowled. \"How could I ever guess what goes through your mind? Have you met yourself? I bet not even you can predict your leaps of logic.\"</p>\n<p>Draco couldn't disagree with that. Not after spending two days thinking up crazy theories. \"Fair enough. But nonetheless, now that I've thought about it, I find your reaction <i>telling</i>.\"</p>\n<p>Potter squirmed as Draco slipped his fingers lower to caress the soft skin of Potter's inner thighs. \"Telling how?\" Potter sounded annoyed, probably because Draco had pulled away. His gaze followed Draco's every move as Draco reached for the wand on the other side of the bed to Summon the phial Potter had given him yesterday. With a grin, Draco pulled off the covers and gave Potter's naked body a slow once over as he uncorked the phial with his teeth. He made a show of pouring the slick liquid on his palm. </p>\n<p>\"See,\" Draco said conversationally, rubbing the lube between his fingers. \"I thought we were so monotonous in our sexual encounters because you're Harry Potter and Harry Potter doesn't take it up the arse. Especially from someone with a past as filthy as mine.\" Draco frowned. \"Which probably says something about my self-esteem, and I should reflect on it. But not today.\" He grinned. \"But then you went all out — a bed and candlelight and silk sheets. And when you were rejected...\" Draco tsked. \"You had a little dramatic outburst. Poor Granger had to hear all about it.\"</p>\n<p>Potter, who listened mesmerised until then, blinked. \"How do you know about that?\"</p>\n<p>Draco waved him off. \"I stalk. I eavesdrop. You do that, too, so don't judge me. The important thing is that now I know.\" Draco slowly slid his slick hand between Potter's legs. Potter sucked in a breath, his half-hard cock twitching, his thighs spreading wide. Draco's fingers brushed against Potter's balls, then moved lower to the crease of his arse. \"I know the truth, and the truth is you're scared.\"</p>\n<p>Draco's finger slipped more firmly between Potter's arse cheeks, his fingertip tracing the puckered patch of skin there.</p>\n<p>\"I'm what?\" Potter said, likely aiming to sound indignant, but it sounded more like a breathy gasp.</p>\n<p>\"You're <i>terrified</i>,\" Draco insisted. \"Terrified of showing me just how badly you want me to fuck you.\" He pushed the tip of his finger past the tight muscle, amazed by how firmly Potter's body gripped it.</p>\n<p>Potter shuddered, his eyes closing, his hands clutching the sheets. He didn't deny Draco's statement, and Draco felt a little braver, slowly working his finger deeper inside Potter.</p>\n<p>\"It'd be awfully nice if you admit it, though,\" Draco said and sat up, pushing Potter's legs apart so he could kneel between them.</p>\n<p>\"Why, if I'm that obvious?\" Potter gasped as he bent his legs at the knees, clenching around Draco's finger.</p>\n<p>Draco had quite a view now. He could see his finger move in and out, with pink, wrinkled skin stretched around it. Potter's cock, now thick and heavy, twitched lightly against Potter's stomach every time Draco pushed in. Every muscle in Potter's body seemed to clench and relax as he squirmed and struggled not to.</p>\n<p>\"Because,\" Draco said, his voice very low now, \"it'd be nice to hear it.” He pulled out his finger and pressed back in with two.</p>\n<p>Potter gasped, his body arching, arse lifting off the bed. \"I want you to fuck me,\" he burst out. \"God, I want it.\"</p>\n<p>Draco's limbs lost some of their strength; his throat went dry. He had imagined Potter saying it, but a part of him didn't really believe Potter would actually do it. Especially not so readily or so honestly. \"How could you ever believe I wouldn't? Merlin, Potter, if you could see yourself...\" Draco pressed his lips together before he said something embarrassing. His brain wasn't working very well. How could it with Potter's naked body exposed before him, his hips rolling as he answered every thrust of Draco's hand.</p>\n<p>Potter had the strength to laugh. \"I thought you wouldn't want to push your pretty little pure-blood body parts into filthy, dark places.\"</p>\n<p>Draco paused, not knowing how to react to that. He couldn't tell which part of that statement was a joke, which part a jab, and whether or not Potter just confessed to having lingering issues about who Draco was. </p>\n<p>But then again, they both had issues, and Potter was right here, letting Draco finger-fuck him and shamelessly loving every moment of it. There was only one thing they had to clear up. \"<i>Little</i> body parts?\" Draco asked, adding another finger and pushing into Potter again. Potter's gasp was so loud Draco wondered if he should cast silencing charms. But he couldn't be bothered to care too much at the moment. \"Want me to stop this and get measuring tape?\"</p>\n<p>\"No, no, no,\" Potter moaned, his hands twisting the sheets. His skin was slick with sweat, his hair a bigger mess than ever. He seemed unable to keep still, writhing this way and that, his lips red as though bitten, his eyes dark when Draco caught a glimpse of them. \"You're big. You're so big. You have the biggest cock,\" Potter babbled, sounding feverish.</p>\n<p>Draco grinned, taking advantage. \"Bigger than yours?\"</p>\n<p>\"So, so much bigger.\" Potter nodded, moaning as Draco pushed even deeper, stretching Potter wide.</p>\n<p>\"Oh, indeed. Sure you can take me?\"</p>\n<p>\"Yes. <i>Yesyesyes</i>.\"</p>\n<p>\"Well, then.\" Draco struggled to steady his breathing and his hand as he reached for his cock. It truly felt bigger and heavier than ever, and Draco was afraid to touch it, thinking it'd all be over the moment he did. He shuddered as he smeared it with lube, but he managed to control himself.</p>\n<p>Potter had gone silent and suspiciously still, staring at Draco's cock.</p>\n<p>\"It'll be fine,\" Draco blurted, unsure if Potter needed reassurance or he'd scoff at Draco for assuming he did.</p>\n<p>\"I know. I know,\" Potter said and smiled, which certainly made Draco feel braver.</p>\n<p>Bravery didn't help him much as his mind awkwardly tried to calculate a good position to do this in.</p>\n<p>\"Come here,\" Potter said, and it turned out all Draco had to do was edge a little closer on his knees. His body acted on its own, then. He reached for Potter, hands grabbing his arse to pull it up against his thighs. Potter was open, slick and ready, and Draco pressed the head of his cock to Potter's entrance. It made Potter shudder.</p>\n<p>Draco pushed in, just a little, and Potter moaned. So Draco did it again, pressed in another inch. It was the most pleasurable game he had ever played. Every push, every twitch, every roll of his hips was followed by a slightly different reaction, a slightly different moan and a gasp.</p>\n<p>Had Draco had more inches to play with, he'd put them to good use. But he ran out of them and pressed as deep inside Potter as he could, his balls pushed up tight against Potter's arse.</p>\n<p>He didn't know it would feel like this. He'd imagined it being tight and hot, but not this tight and not this hot, and he definitely didn't expect to be so intensely aware he was <i>inside</i> Potter. And that Potter wanted it and he wouldn't push him away.</p>\n<p>Potter was gasping, clenching, adjusting. Draco knew how <i>that</i> felt.</p>\n<p>\"What a dark, filthy place my body part found itself in,\" Draco said.</p>\n<p>Potter's breathless laughter seemed to travel through his body in the form of tremors that reverberated around Draco's cock. \"Is that why it seems so confused and does nothing constructive?\"</p>\n<p>Draco didn't need to be told twice. He moved carefully, leaned forward, and bent Potter double. Potter's legs wrapped around him, heels digging into his buttocks.</p>\n<p>\"Hey,\" Draco said, looking down at Potter's flushed face and, before Potter could reply, Draco rolled his hips. Potter's eyelashes fluttered, and his hand flew to Draco's hair, gripping it tight.</p>\n<p>\"Do that again,\" he said, placing his feet on the bed and pushing up.</p>\n<p>Draco obeyed, finding a push-roll-pull rhythm that Potter followed with upward thrusts of his hips. It felt so good. Too good. Panic gripped Draco with rapidly building pleasure: he wasn't going to last. But Potter sneaked a hand between their bodies, and Draco could feel it move frantically against his stomach, Potter's gasps turning louder with every twitch.</p>\n<p>Draco came first anyway, pleasure that shot through him impossible to stop. It ebbed away slowly; his muscles relaxed, his body sagged. It took him awhile to realise Potter was still thrusting upwards feebly, his hand trying to move beneath Draco's weight.</p>\n<p>\"Wait. <i>Wait</i>,\" Draco said, gathering his strength. He moved downwards, batting Potter's hand away. Potter didn't seem inclined to retreat, but when Draco bent down, his mouth hovering above Potter's cock, he let go with a needy groan. Draco's lips closed around the head of Potter's cock, his fingers toying with his sack before sneaking down where Potter was hot and open and sticky. He shoved three fingers inside, and Potter cried out, managing to gasp, \"Fuck,\" before clamping down on Draco's fingers and bucking his hips. He shoved his cock deep into Draco's throat and came.</p>\n<p>Draco choked and pulled away. His eyes watered and he swallowed, working through the soreness in his throat. But his annoyance dissipated at the sight before him. Potter looked lost in his pleasure, his body a shivering mess, thrashing as he panted and fucked himself on Draco's fingers. Draco started moving his fingers the moment Potter went still, loving the way Potter whimpered and squirmed as though he didn't know whether to edge away or push closer.</p>\n<p>\"Stop stop stop,\" Potter decided at last, and Draco pulled away with a grin. He moved up to lie beside Potter, absentmindedly wiping his hand on the sheets.</p>\n<p>Potter gave him a sideways look, still struggling to even his breathing. \"There's really no need to look quite that smug.\"</p>\n<p>Draco beamed. \"I blew your mind, admit it.\"</p>\n<p>\"What ever happened to those self-esteem issues you mentioned?\"</p>\n<p>\"Sorry, can't answer that question. Too busy noticing you haven't denied it.\"</p>\n<p>Potter laughed and then opened his mouth to say something, but Draco leaned in and kissed him to prevent it. Potter only managed a small \"Umh\" that turned into a satisfied sort of hum when Draco deepened the kiss.</p>\n<p>\"However...\" Draco said once they pulled apart. \"We need to have a serious conversation about your hips. They're out of control and a bloody danger.\"</p>\n<p>\"Is that so? I remember you enjoying my hip movement very often and very loudly.\"</p>\n<p>\"There's a time and a place for everything.\"</p>\n<p>Potter snorted. \"All right, then. A serious conversation about my hips. What can we do?\"</p>\n<p>Draco reached down to caress and squeeze one of those hips. \"Well, we could strap them down.\"</p>\n<p>\"What if they're too wild and break free?\"</p>\n<p>\"Then we'll have to train them. The more we work on that, the better.\"</p>\n<p>Potter narrowed his eyes. \"Is this your way of asking if we're doing this again? You do realise this was just a one-time thing?\"</p>\n<p>Draco blinked.</p>\n<p>Potter burst out laughing and, annoyed, Draco rolled on top of him to press him down against the mattress. \"You're such a prat.\"</p>\n<p>Potter cocked his head, gaze soft. \"<i>Your</i> mind-blown prat, though.\"</p>\n<p>Draco couldn't help shivering at that statement.</p>\n<p>\"I promise to never let you forget that again.\" Potter reached up to thread his fingers through Draco's hair. </p>\n<p>\"You better keep that promise.\"</p>\n<p>Potter pulled him closer. \"I will.\"</p>\n<p>\n<b>FIN</b>\n</p>"
}