{
  "id": "14849339",
  "url": "https://archiveofourown.org/works/14849339?view_full_work=true",
  "author": [
    "Madelinedear"
  ],
  "title": "and when i think of tomorrow",
  "rating": "Not Rated",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Spider-Man: Homecoming (2017)",
    "Marvel Cinematic Universe",
    "The Avengers (Marvel) - All Media Types",
    "Marvel"
  ],
  "relationships": [
    "Tony Stark & May Parker",
    "Tony Stark & Peter Parker",
    "Pepper Potts/Tony Stark"
  ],
  "characters": [
    "Tony Stark",
    "May Parker (Spider-Man)",
    "Peter Parker",
    "Pepper Potts",
    "James Rhodes",
    "Happy Hogan",
    "briefly some other rogue avengers",
    "MJ and Ned mentions"
  ],
  "additional_tags": [
    "Friendship",
    "platonic co-parenting",
    "Panic Attacks",
    "Found Family",
    "PTSD",
    "Recovery",
    "plot?? don't know her",
    "Tony can't sleep",
    "may learns piano",
    "peter becomes an instagram star",
    "ironfam is real and i love them",
    "no compliant with infinity war",
    "because this is my house"
  ],
  "language": "English",
  "series": "Part 2 of call you home",
  "published": "2018-06-04",
  "completed": null,
  "words": "10,706",
  "chapters": "1/1",
  "comments": "363",
  "kudos": "7,493",
  "bookmarks": "1,140",
  "hits": "49,574",
  "summary": "<p>“Did you know that we're secretly married and have an illegitimate child?” Tony asks blandly over breakfast, swiping butter onto his piece of toast.</p>\n<p>It says a lot, May thinks, about the absolute shitshow her past year has been, that she doesn’t even bat an eye.</p>\n<p>(or; between sundays, tony and may find solid ground in a shaky world.)</p>",
  "notes": "<p>continuing my never-ending quest to give peter the co-parents he deserves and to save may from writers who brutally murder her</p>\n<p>sequel to 'for good', but can work as a stand alone.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>huge thank you to everybody who read 'for good', and my infinite love to everybody who commented. you guys constantly brighten my day and inspire me to write.</p>\n<p>if you liked it, comments give me life and i will love you forever</p>",
  "text": "<p>“Your right hand is two keys down from C.” Tony tells May, sliding next to her on the piano bench.</p>\n<p>His hands fly lightly over the ivory, and she silently marvels as he plays a short melody.</p>\n<p>“Is there anything you can’t do?” she wonders, only somewhat joking. Tony snorts, lightly brushing the keys.</p>\n<p>“I can’t sing worth a damn.” he tells her wryly, and she bites her tongue to stop herself from saying that she’s heard him sing with Peter many times. He breaks her gaze, trailing his hands across the piano to find a chord.</p>\n<p>“My mother taught me.” he offers quietly, as though she needed to ask, as though it doesn’t mean the world that they’ve reached this point where he’s willing to share. Instead she nods.</p>\n<p>“Was she much good?” May questions, although she already knows the answer. Tony’s smile is worth it.</p>\n<p>“She was magnificent.” he says reverently, eyes shining. A pause. “I wish I was a talented as her, but alas. I’ll settle for good looks and charm.”</p>\n<p>May studies his hand placement, and Tony moves his aside so she can take his place.</p>\n<p>“Teach me the song you were playing.” she says, more of a demand then a request.</p>\n<p>Tony rolls his eyes, but she knows that he’s privately grateful for the distraction. His left hand’s been trembling for the past hour, and it hasn’t escaped her notice that everytime he places his fingers on the smooth, white keys that they’re steady.</p>\n<p>He places May’s fingers over the first chord, ghosting lightly over her hands to provide direction.</p>\n<p>It’s nice.</p>\n<p>Just them and the music. May’s clumsy attempts, Tony’s flawless examples.</p>\n<p>They’re both pretending like it’s an ordinary Sunday. Like Tony hasn’t been pacing the length of the compound since he woke up. Like he definitely hadn’t sent Peter to a nationally acclaimed physics camp in order to keep him away from the compound for the week. Like May definitely hadn’t taken the day off to offer Tony some form of silent support, some kind of backup.</p>\n<p>Tony definitely doesn’t need backup– at least, the kind of backup she can provide. He definitely can handle himself.</p>\n<p>Still, she’s seen the bags under his eyes. The rumpled clothes, the shaking hands.</p>\n<p>The blank look on his face, when he had told her that <em> all </em> the Avengers had been pardoned, and were returning to the compound.</p>\n<p>(He had been working on revising the accords for months, had fought brutally for their pardons. Had sacrificed days of sleep, had worked himself to the bone to bring them home.</p>\n<p>He hadn’t even thought about afterwards. That home meant himself.)</p>\n<p>But still, Tony doesn't need protection, especially from her. And yet…</p>\n<p>(The look on Tony's face, when she had broached the idea of stopping by the compound for the day. May can tell she spends too much time with him, because she has an armful of excuses at the ready. Tony doesn't call her on any of them.</p>\n<p>Instead, he looks relieved.)</p>\n<p>She hears a light buzzing sound, and Tony glances as his watch. They both already know what it means, but Tony’s sharp intake of breath still shakes her. May’s suddenly, infinitely glad that she took the day off.</p>\n<p>“They’re here.” Tony says, voice emotionless. He spins and pushes himself off the bench. For a moment he simply stands, and she can see his hands rapidly opening and closing, until he forces them still. He fishes sunglasses out of his pocket, taking a deep breath.</p>\n<p>May watches him make his way across the room. She wants, for a moment, to follow him. But this is his demon to face.</p>\n<p>“May.” he calls, turning at the door frame. He takes his sunglasses off, meeting her eyes. “Thank you. For being here.”</p>\n<p>He’s out the door before May can respond.</p>\n<p> </p>\n<p> </p>\n<p>Summer announces itself in a gentle haze, and for the first time in a long time May finds that she’s enjoying, well, everything.</p>\n<p>She’s hesitantly cut down on hours at the hospital, since Tony’s starting siphoning money into her bank accounts.</p>\n<p>(It had been a constant source of arguments between them, quick and brutal. May didn’t want to be a charity. Tony just wanted to help.</p>\n<p>“Consider it alimony.” He’d joked dryly, when she’d finally relented and they had worked out the terms.)</p>\n<p>She still works, of course. She enjoys work at the hospital, however draining it may sometimes be. But now she’s working more reasonable hours, closer to what she worked before Ben died. She has more time with Peter, now, which she’s grateful for.</p>\n<p>Peter’s busier than a bee, even though school’s let out. Summer decathlon and a slew of other clubs that she can’t keep track of, plus whatever summer camp Tony’s willing to pay for. He’s thrilled to have more time to Spider-man, and May’s sure that the amount of time he spends at the tower or the compound is going to double.</p>\n<p>They keep up their weekly dinners– May, Peter, and Tony. Sometimes Pepper or Rhodey will join them– even Happy, on occasion. May likes the way it makes the apartment feel, when everyone’s there, snug but comfortable in her cramped living room, eating takeout and watching bad movies.</p>\n<p>It makes the house feel full, and she misses that.</p>\n<p> </p>\n<p> </p>\n<p>tony (4:28): is there a reason your kid is taking photos of literally everything every 3.2 seconds</p>\n<p>tony (4:30): I had friday time it</p>\n<p>tony (4:31): it’s not like he’s never been in the lab before</p>\n<p>tony (4:31): this is literally his lab</p>\n<p> </p>\n<p>The picture thing is going to have to be addressed, May thinks, grimacing at the message from Tony.</p>\n<p>It’s one of Peter’s newest habits, snapping pictures of everything and anything from different angles, different lighting. May’s concerned he’s going to run out of room on his phone, even with the insanely large storage capacity Tony had designed.</p>\n<p>She hadn’t realized this was a reoccuring theme outside of the house, though.</p>\n<p> </p>\n<p>may (4:34): you could…. ask him about it</p>\n<p>may (4:34): like a responsible adult</p>\n<p> </p>\n<p>tony (4:35): unrealistic</p>\n<p>tony (4:35): blocked</p>\n<p> </p>\n<p>may (4:36): blocked? from what?</p>\n<p> </p>\n<p>tony (4:37): peter says that shit all the time you think i know what the fuck it means</p>\n<p>tony (4:38): we could confront him at dinner</p>\n<p> </p>\n<p>may (4:40): sure. I’ll see you tonight</p>\n<p> </p>\n<p> </p>\n<p><br> It’s Peter, actually, who brings it up at dinner. His hands are jittery, and he’s been tapping the table with a fork all night. Tony hasn’t mentioned it, but May can tell it’s slowly driving him insane.</p>\n<p>“I want to enroll in Midtown’s summer photography course.” Peter says, when he’s finished his Chinese food. May nods, mentally she’s bracing herself for the oncoming expensives.</p>\n<p>“That sounds like a great idea, sweetie.” she says. “What exactly… brought up, this new interest?”</p>\n<p>“You’re always telling me to branch out.” Peter says honestly. He plays with his hands. “Ms. Birch, you know, she’s the photography teacher and helps out at summer band. We had a small project at the end of last year in another class, and last week she told me that she was looking through some of my work and that I have a good eye.”</p>\n<p>He’s still nervous, but May can hear the pride tinging his words.</p>\n<p>“She said I should work on it over the summer, maybe join photography club.” Peter says. “Plus the Midtown High Press needs photographers for school events, and she said I should submit some work to get in next year.”</p>\n<p>“Sounds like you have real promise, and it’s something you really enjoy.” Tony says, clearing the last of his plate. “So why didn’t you mention it sooner? Don’t think we haven’t noticed your little photography kick.”</p>\n<p>Peter’s cheeks redden slightly, and he avoids their eyes.</p>\n<p>“It– It’s kind of expensive. For a single class. And I need to rent a camera, so that’s an extra cost–”</p>\n<p>“–i’ll pay for the class, kid.” Tony interrupts. “And we can pick up a camera tomorrow before we head to the compound.”</p>\n<p>“<em>Tony. </em>” May admonishes, over Peter’s spluttering. Tony waves her off.</p>\n<p>“You can buy dinner next week.” he says. And then, quietly, when Peter’s putting dishes away</p>\n<p>“I won’t, if you really don’t want me to.” Tony says. “But– let me do this, for the kid. My dad never encouraged me to do anything and look how I turned out.”</p>\n<p>He’s looking at her, earnestly, and May rolls her eyes.</p>\n<p>“Alright, superdad.” she says. “But nothing crazy with the camera.”</p>\n<p>(She knows nothing about expensive cameras, but the next day Peter shows her a DSLR with a price tag high enough to make her stomach swoop.)</p>\n<p> </p>\n<p> </p>\n<p>“You need a hobby.” May tells Tony, when he invites himself into the Parker household for the fourth time that week.</p>\n<p>“I have a hobby,” Tony says from where he’s sprawled out on the couch. “Superheroing. Saving the world. Ironman, you may have heard of me.”</p>\n<p>“Something that doesn’t threaten your life.”</p>\n<p>“Workshop. I invent things. That’s why I’m a billionaire.”</p>\n<p>“Then why have you stopped by four times this week?” May questions him.</p>\n<p>For a fraction of a second Tony looks hurt, then his face is smoothed into a neutral expression.</p>\n<p>“If you were tired of my company you could have told me, Parker.”</p>\n<p>May launches a wooden spoon at him from the kitchen. It makes its mark with a satisfying yelp of surprise from Tony.</p>\n<p>“That’s not what I meant, <em> you nimrod</em>.” she snarls, ignoring the way Tony mouths the word <em> nimrod </em> back at her. “Listen. You’re crazy smart– I know your mind is in a thousand places at once. And since you’re here, clearly you can’t focus on work.”</p>\n<p><em> Got ya </em>, she thinks, watching Tony avoid her gaze.</p>\n<p>“And I know you’ve been avoiding the compound.” she adds. It’s a cheap move, and they both know it. “What i’m saying is that you need, like, something you enjoy that you can focus on.”</p>\n<p>Tony stares at her.</p>\n<p>“I enjoy building things.” he says slowly. May takes a calming breath.</p>\n<p>“Something else.” she says, in her best <em> let’s be reasonable voice</em>. “I mean, you’re not going to be Ironman forever, you know. What are you gonna do in twenty years when your body can’t handle that?”</p>\n<p>May pauses, considering.</p>\n<p>“I don’t know how your body handles that now.” She admits.</p>\n<p>Tony smiles at her, but it looks empty. His eyes are dark, the corners of his mouth brittle.</p>\n<p>“Optimistic of you to think i’m going to live that long.” Tony says, in a way that tells her he definitely has never considered that he would live that long.</p>\n<p>Before she can answer, they’re both distracted by the sound of the lock clicking in the door.</p>\n<p>“Hey Mr. Stark.” Peter says brightly from the doorway, stepping into the apartment and depositing his backpack next to the door.</p>\n<p>“Hey kid.” Tony says, putting on a tired but genuine smile.</p>\n<p>“Hi May!” Peter calls into the kitchen.</p>\n<p>“Hey sweetheart. How was the movie?”</p>\n<p>Peter shrugs.</p>\n<p>“It was fine, nothing special. Pretty much what I expected.” he says, moving into the living room to crash on the sofa adjacent to Tony. “What’s up with you guys?”</p>\n<p>“We were talking about finding Tony a hobby.” May says, and Tony rolls his eyes.</p>\n<p>“You don’t have any hobbies?” Peter asks, surprised. Tony glowers.</p>\n<p>“Do <em> you </em> even have hobbies?” he hurls at May. She shrugs.</p>\n<p>“I like reading. I have bridge nights with the girls.” she pauses. “What makes you happy?”</p>\n<p>It’s a loaded question, and for a second Tony looks unsure. May backtracks.</p>\n<p>“Have you ever even played a board game?”</p>\n<p>Tony looks at her.</p>\n<p>“Boardgame?” He mutters quietly to himself. He closes his eyes and leans back for a moment.</p>\n<p>“Okay.” he says, and when he opens his eyes he looks steadier. “Have either of you ever played backgammon?”</p>\n<p> </p>\n<p> </p>\n<p>“I fired my therapist.” Tony says, when he makes the fifth appearance in May’s apartment that week. He looks more manic than usual, with bright eyes and wild hand gestures. “She treated me like I was stupid.”</p>\n<p>A pause</p>\n<p>“I'm not stupid.” he says venomously, and May understands.</p>\n<p>She pulls up Tony’s vitals on her phone and winces. Red letters scream at her that Tony hasn’t slept in over forty hours.</p>\n<p>It’s probably considered odd, May thinks idly, to have constant access to your friends vital statistics. She used to pretend like she was unaware that Tony watched their stats on loop when he got anxious.</p>\n<p>(\"<em>Tony,” </em> she had said tiredly, once she found a dime sized tracker hidden behind a button on her coat. “You can’t just track people without their consent.”</p>\n<p>“It’s not just a tracker.” Tony had said sulkily, avoiding her gaze. “It gives me your vitals. Heart rate. Sleep patterns. Nutritional intake. In case…”</p>\n<p>He cut himself off, and his expression grew blank. May watched the nails digging into his palms drew blood.</p>\n<p>“Okay.” she said. Tony blinked. “But only if I can do the same for you. You know about me, I know about you. With limitations, of course.”</p>\n<p>“Of course.” Tony agreed quickly.</p>\n<p>May paused.</p>\n<p>“You’re not gonna microchip me, are you?”</p>\n<p>“What?” Tony said, looking offended. “I wouldn’t microchip you.”</p>\n<p>He contemplated for a moment.</p>\n<p>“Well, I did microchip Pepper.” he admitted, and May looked alarmed. He held up his hands defensively. “We microchipped each other, it was totally consensual.”</p>\n<p>“I don’t want to get into that.” May said.</p>\n<p>“Fair.”)</p>\n<p>She glances at Tony, who’s pacing nervously around the living room. The light catches the slim silver around his wrist, and she looks down at it’s twin looped around her own arm.</p>\n<p>She’d requested something like an activity tracker, to avoid the microchipping scenario.  </p>\n<p>(“They're like friendship bracelets.” May had said, idly latching the tracker around Tony's wrist. He shot her an unimpressed look.</p>\n<p>“They're not friendship bracelets. They're state of the art location trackers and health monitors–”</p>\n<p>“With matching color schemes.” May said smugly.</p>\n<p>Peter had lobbied for his own matching tracker, once he realized what was going on, but Tony pointed out that both the Spider-man suit and Peter’s watch already carried the same function. He did give Peter limited access to his vitals, though. Something about trying to even the playing field.)</p>\n<p>“You’re not stupid, Tony.” May says, bringing her attention back to the present. “Didn’t you create a 500 million dollar machine so you could avoid seeing a therapist, anyway?”</p>\n<p>“600 million.” Tony corrects moodily, dropping to the couch. He picks at the hem of his shirt.</p>\n<p>“It was helping.” he mutters. “She– I thought she could help.”</p>\n<p>Tony looks at her, then, really looks at her, for the first time since he’s entered the apartment that day.</p>\n<p>“I’m so fucking tired.” he says honestly, and May feels her heart break. She’s no stranger to insomnia, especially after Ben died. But she’s never been as bad as Tony seems to be now, seems to always be.</p>\n<p>“Usually it’s fine.” he mutters. “But I can’t think straight. I can’t build or design or fucking do anything and I <em> sure as hell </em> can’t sleep.”</p>\n<p>“Do you want to do a puzzle with me?” she says, instead of offering pity.</p>\n<p>Tony watches her with dark eyes from the sofa as she riffles through games, pulling out a few different options.</p>\n<p>Briefly, May considers opening a puzzle of the andromeda galaxy that Ben got her from a second hand store, before Tony stops her from opening the box.</p>\n<p>“<em>Not that one</em>.” he says sharply, before collecting himself.</p>\n<p>“Sorry.” he says quietly, sliding off the couch to sit on the floor with her. “I don’t, uh. I don’t really like–”</p>\n<p>He gestures with his hand.</p>\n<p>“Space.” he finishes, and he looks defensive, smaller. “I just– yeah.”</p>\n<p>He’s waiting for her to comment, or push. She can see it in the way his shoulders tense, his eyes look guarded.</p>\n<p>“Okay.” she says, because that’s what she does when Peter skirts around topics. “How do you feel about farms?”</p>\n<p>Tony blinks at her for a moment before responding.</p>\n<p>“Good.” he says as May tips the open box over, and he seems steadier.</p>\n<p>When Tony falls asleep on the couch later that night, sandwiched between Peter and May, she pulls out her tablet, and watches the calm slope of Tony’s heart rate until sleep claims her as well.</p>\n<p> </p>\n<p> </p>\n<p>“He’s not going to be able to keep his identity a secret from them forever.” Tony tells May one morning, staring tiredly into his cup.</p>\n<p>It’s not uncommon for them to meet regularly for morning coffee somewhere in the city, but Tony had requested they meet at the tower today.</p>\n<p>“I’m doing <em> everything </em> I can.” Tony placates hastily, before she can even respond. “If I had my way, the kid wouldn’t be anywhere near them. But he still needs to come to the compound for training, and–”</p>\n<p>Tony grimaces, like he’s going to regret his next words.</p>\n<p>“Training from some of the others would probably beneficial.” he says. May nods slowly, the gears whirring in her mind.</p>\n<p>“Even if you seperate them,” she says. “Peter and Spider-man, there’s still… a large chance that they’re going to meet Peter, at some point.”</p>\n<p>Tony nods.</p>\n<p>“Unavoidable, at this point.” he agrees. “I’ve been trying to take precautions. Peter’s new suit has an automatic vocal modulizer to prevent people from recognizing his voice, to start.”</p>\n<p>May listens as Tony rambles, trying not to feel dread in her stomach. She doesn’t really think the Avengers will harm Peter, if they knew his identity. At the very least, she trusts Tony to keep Peter safe no matter what happens. But Peter had been so firm, on this one detail. His single request.</p>\n<p>“May.” Tony says, snapping her away from her thoughts. His tone is serious. “They’ll find out. Some way. Th– there’s a reason they’re all still alive. These are some of the most intelligent people on the planet.”</p>\n<p>“How smart can Captain America be?” she asks. She doesn’t really like deflection. This is more of Tony’s wheelhouse, but she’s tired of the look on Tony’s face. “I mean, he broke up with you. Which,<em> first of all </em>–”</p>\n<p>She doesn’t get a chance to finish, because Tony honest to god <em> laughs </em>, and May is glad.</p>\n<p>“You have to stop joking about that.” Tony says, when his laughter has died down to a snicker, but his eyes are sparkling. “Those jokes are gonna rub off on the kid, then i’ll never hear the end of it.”</p>\n<p> </p>\n<p>She’s getting ready for a double shift when Tony tells her about taking Peter to the conference in LA.</p>\n<p>“Won’t that put him in the public eye?” May asks worriedly. She can feel Tony’s anxiety over the phone.</p>\n<p>“Yes.” he says grudgingly, the <em> but i don’t like it </em> implied. “The– there’s already been rumors about him, circulating in the press.”</p>\n<p>May feels her heart rate spike.</p>\n<p>“I’ve been handling it.” Tony says quickly. “But we need to get in front of it. I want to present Peter’s work on the altered webbing we’ve been working on for medical purposes. It could save a lot of lives”</p>\n<p>May is quiet, considering the implications.</p>\n<p>“People are starting to ask questions.” Tony says. “My people are good, but they won’t be able to stop the press forever. I want to get in front of this.”</p>\n<p>May blows out a stream of air.</p>\n<p>“I don’t love this.” she admits. Tony hums.</p>\n<p>“It fucking sucks.” he agrees. “But it’ll be better to have articles about Peter Parker: <em> Stark Industries Boy Genius </em> , than, Peter Parker: <em> Have the Consequences of Tony Stark’s Youth Finally Caught up to Him?” </em></p>\n<p>“Plus,” he adds. “The sooner we can direct their attention towards something, the better. The last thing we want is a hard-headed reporter digging deeply into Peter’s extracurriculars. We present him as a Stark intern, and they’ll focus on that.”</p>\n<p>“Yeah.” she says softly. “You’re right. Talk to him about it tonight. Band practice ends at–”</p>\n<p>“–four.” Tony finishes for her, and she can feel the warmth in his voice. “You know, I wouldn’t have to pick him up if you had let me give him a car when he turned sixteen.”</p>\n<p>“You love it.” May says absently, scanning the room for her swipe card. “It gives you something to do.”</p>\n<p>Tony snorts.</p>\n<p>“Yes, now my days are planned around the schedule of a toddler.” he says without malice. “I’ll text you when I have retrieved your kid. Have a nice day at work.”</p>\n<p> </p>\n<p> </p>\n<p>She questions Pepper over drinks on a Tuesday night.</p>\n<p>(“Abandoning me for my fiance?” Tony had asked in a faux wounded voice when they had told them it was a ladies night, but he was smiling. “I see how it is, Parker.”)</p>\n<p>“Have you noticed Tony is… “ May hesitates. Pepper gives her an understanding smile.</p>\n<p>“Spiralling?” Pepper says. May shrugs.</p>\n<p>“Not sleeping.” she finishes. A pause. “Maybe spiralling a little.”</p>\n<p>Pepper hums. She stirs her drink, seeming to mull over her words.</p>\n<p>“He’s always been a little…” she lets the sentence hang, but May doesnt need her to finish it. <em> Reckless, manic, suicidal. </em>“You know. But he goes through phases.”</p>\n<p>Pepper takes a long drink.</p>\n<p>“This shit with the Rogues isn’t helping.” she says. “But we just have to stick it out, be there for him.”</p>\n<p>“You help.” Pepper adds honestly. “You and Peter. But that’s not gonna change everything. Tony’s in too deep for that.”</p>\n<p>“That’s a hard way to live.” May says, and Pepper gives her a sharp smile.</p>\n<p>“If he’s breathing, the day’s a success.” she says.</p>\n<p>For a moment the air feels heavy.</p>\n<p>“Why did you microchip each other? May asks. Pepper splutters on her drink, and ends up laughing</p>\n<p>“He told you about that?” she ask with a grin, once she gets control of herself.</p>\n<p>They spend the rest of the night trading stories about their respective boys, whom they love as a whole but who individually spend their days doing the stupidest shit.  </p>\n<p> </p>\n<p> </p>\n<p>“<em> I webbed Black Widow to the wall today! </em>” Peter says excitedly, the moment May steps into the Stark Tower penthouse.</p>\n<p>“I’m sure she was very happy about that.” she says dryly, moving into the kitchen. Tony looks over at her, drawing his attention away from vegetables he was cutting.</p>\n<p>“Hey, May.” he says. She flashes him a peace sign in greeting.</p>\n<p>“Anyone else coming, tonight?”</p>\n<p>Tony shakes his head.</p>\n<p>“Rhodey’s meeting with the UN. Pep’s flight gets in at around one, though, so we can make her leftovers.”</p>\n<p>“It’s night.” Peter says, eyeing Tony, who’s pouring himself a cup of coffee.</p>\n<p>“And I didn't believe the school when they said you were a genius.” Tony says dryly, leading them to the dining table. Peter rolls his eyes.</p>\n<p>“Do you ever drink anything else?”</p>\n<p>Tony has the grace to look moderately offended.</p>\n<p>“I only drink coffee when i’m exhausted and stressed.” he says. Peter looks concerned.</p>\n<p>“Mr. Stark,” he says. “You’re always drinking coffee.</p>\n<p>“How’s your photography project going?” May asks, once they’ve settled down around their meal. Peter brightens immediately, and launches into a detailed description of everything he’d worked on that week.</p>\n<p>Tony and May take turns nodding and adding the appropriate affirmative sounds, grinning at each other across the table.</p>\n<p> </p>\n<p> </p>\n<p>“Why am I doing this?” Tony asks uselessly, frowning down at his Stark phone as the Instagram icon loads.</p>\n<p>“Do you have one?” he shoots at May, who shrugs.</p>\n<p>“Peter made me get one. I don’t really use it.”</p>\n<p>“It’s <em> fun </em>.” Peter says in a wounded voice. “Plus, everyone has one. You can use it to keep up with all your friends.”</p>\n<p>Tony gives Peter a stony look.</p>\n<p>“Bold of you to assume I have any friends, Parker.”</p>\n<p>Peter rolls his eyes.</p>\n<p>“I thought you were, like, the <em> tech leader </em> of the world”</p>\n<p>That gets Tony’s attention.</p>\n<p>“I <em> am </em>.”</p>\n<p>“I’m just sayin,” Peter says. “Even the <em> Osborns </em> have accounts. Oscorp has an account.”  </p>\n<p>“Stark Industries has social media.” Tony says dismissively.</p>\n<p>“But you don't.” Peter whines. “Which is, insane. Famous people post things all the time. It’s free PR.”</p>\n<p>“Is this part of your photography kick?” Tony asks, opening up the app. He waves away Peter’s help to set up the account. When he’s finished, he frowns at his phone.</p>\n<p>“I’m just supposed to follow people?” Tony asks, unimpressed.</p>\n<p>“Yeah, people you’re interested in.” Peter tells him. “And if, miraculously, they are interested in you, they will follow you back.”</p>\n<p>May laughs at Tony’s mutinous expression from the couch.</p>\n<p>“You can follow me, Tony.” she says, voice full of mirth. Tony rolls his eyes, but a second later her phone pings with the follow notification.</p>\n<p> </p>\n<p>  </p>\n<p>group chat: parker-starks</p>\n<p> </p>\n<p>peter (7:09): holy shit</p>\n<p> </p>\n<p>may (7:10): peter</p>\n<p> </p>\n<p>peter (7:11): may</p>\n<p>peter (7:11): mr. stark posted a picture of us on his instagram</p>\n<p>peter (7:11): and i woke up with 30k follows</p>\n<p> </p>\n<p>may (7:12): che cazzo stark you made my kid a celebrity</p>\n<p> </p>\n<p>tony (7:14): first</p>\n<p>tony (7:14): i feel like i can be absolved of a lot of blame</p>\n<p>tony (7:14): because evidently i am an old man and can’t understand technology</p>\n<p>tony (7:14): or social trends</p>\n<p> </p>\n<p>peter (7:15): why are people following me !!!</p>\n<p> </p>\n<p>tony (7:16): because they remember you from the conference and you're interesting</p>\n<p> </p>\n<p>may (7:18) @peterparker i thought your account was on private</p>\n<p> </p>\n<p>peter (7:19): when we were setting up mr. stark’s account i was showing him the settings</p>\n<p>peter (7:20): i must have forgotten to change it back</p>\n<p> </p>\n<p>tony (7:22): also</p>\n<p>tony (7:23): that’s not really celebrity level. from the data i have gathered</p>\n<p> </p>\n<p>may (7:25): what picture did you even post</p>\n<p>may (7:27): okay that’s fuckin cute</p>\n<p> </p>\n<p>peter (7:30): oh my god ned’s gonna lose it</p>\n<p>peter (7:31): oh my god flash is gonna lose it</p>\n<p>peter (7:31): i can already feel the social pressure</p>\n<p> </p>\n<p>may (7:35) great job tony you made my son an instagram star</p>\n<p> </p>\n<p>  </p>\n<p>“Do you know how to play?” Rhodes asks her, when he finds her seated at the piano bench in the tower. She’s in the common room, waiting for Tony to arrive for lunch.</p>\n<p>“Tony’s been teaching me.” May says, and Rhodes raises an eyebrow. She raises an eyebrow back.</p>\n<p>“What?”</p>\n<p>“Nothing.” he backtracks, and then</p>\n<p>“Tony's hardly played since Maria died.\" Rhodey says slowly. \"But this is good for him, I think.\"</p>\n<p>May hums in agreement.</p>\n<p>“You and Peter are good for him.” he says. May turns back to the piano.</p>\n<p>“I told him to find a hobby.” she voices, looking over the sheet music, and Rhodey snorts.</p>\n<p>“He needs one.” he agrees. He swipes at the coffee table, and together they watch blue holograms knit themselves into existence.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>May and Tony find out that Peter has a job accidentally.</p>\n<p>(Somewhat accidentally. Peter had left his tracker on after his late night of Spider-manning– which placed him at a cafe in the city. Tony and May had been expecting to peek through the window on their way to morning coffee and see him on a secret date with MJ.</p>\n<p>Instead, Tony had spotted him smiling brightly behind the counter, writing a customer’s name on a cup with a swirling loop of letters, and he had dragged May in before she could reason with him.)</p>\n<p>May’s grateful that there’s no line, because she’s sure Tony would have bypassed it entirely to get up to the counter.</p>\n<p>Peter looks up form the register with a smile on his face, but the moment recognitions hits he sighs.</p>\n<p>“You’re <em> working! </em>” Tony says to Peter accusingly. He turns to May.</p>\n<p>“He’s <em> working! </em>” Tony informs her, looking incredulous.</p>\n<p>“Are you mad that I got a job?” Peter asks, looking confused.</p>\n<p>“We’re not mad.” May cuts in, watching Tony open his mouth. “Just– confused. That’s all.”</p>\n<p>Peter nods, muttering a quick <em> hang on </em> to them before stepping back from the counter to talk in hurried whispers to a woman watching the exchange with amusement. Tony’s mind looks properly boggled. A moment later Peter slides around the counter and gestures for Tony and May to follow him.</p>\n<p>Peter leads them into what looks like a break room. It’s small but cozy, with dim lights and blessed air conditioning. Peter slides into a seat at a small table, and May and Tony sit across from him. The chairs, May decides, are decidedly subpar.</p>\n<p>For a short while no one says anything. Peter is pointedly avoid their gazes by looking serently at the table. Tony is the one to break the silence.</p>\n<p>“Kid,” he starts. “if you wanted more hours at the Tower or more money, you could have just asked.”</p>\n<p><em> Oh </em> , May thinks. <em> So that’s why he’s upset </em>.</p>\n<p>“What? No!” Peter says, confusion evident. “It’s not about that.”</p>\n<p>Tony still looks beside himself, but May understands.</p>\n<p>“It’s about doing something myself.” Peter says. “Being responsible– growing as a person, you know?”</p>\n<p>He plays with his hands as Tony stays silent.</p>\n<p>“Getting a job–”</p>\n<p>“You have a job.” Tony interrupts. His brows furrow, and when he speaks again he sounds like he’s trying to hide a degree of sadness. “Do you not like your job?”</p>\n<p>This time Peter is the one who looks incredulous.</p>\n<p>“What are you talking about? I love interning at the Tower.” Peter says, bewildered. He avoids Tony’s gaze again. “But I didn’t really get that job myself, really. You just sort of, just, handed it to me.”</p>\n<p>“Not that i’m not grateful!” Peter adds hasilty as Tony’s expression grows mutinous. “But I wanted to try and do something on my own. Without <em> Tony Stark </em> or <em> May Parker </em> growling at people over my shoulder, making people do things for me.”</p>\n<p>“I glad you think i’m as intimidating as Tony Stark.” May says dryly. She reaches across the table and squeezes Peter hand, giving him a proud smile. Peter returns it before glancing worriedly at Tony, who is staring at the wall in stony silence.</p>\n<p>Finally, Tony sighs.</p>\n<p>“Listen, Pete.” Tony says seriously, turning back to look at Peter. “I didn’t just <em> hand </em> you anything. Your internship at the lab didn't just happen because of your... extracurriculars, or because you’ve grown on me like a fungus. It happened because you’ve got a brilliant mind. You’re smart and capable and I think you’re going places, kid.”</p>\n<p>Tony takes another deep breath. Peter’s eyes are wide.</p>\n<p>“You have an internship at the tower because I want you there. Because <em> you have earned it </em>.”</p>\n<p>Peter is glowing, and Tony snorts.</p>\n<p>“Of course, if you feel like you needed to become a barista to feel like you’ve accomplished something, be my guest.”</p>\n<p>Peter laughs, but his eyes are bright and it sounds a little choked.</p>\n<p>“Hey, baristas are the backbone of society.” he says defensively. Peter slides off his seat and moves around the table to crush both of them in a hug.</p>\n<p>“Thank you for understanding.” he says seriously, and May rolls her eyes. “Also please don’t visit me at work because I love you but you’re both super embarrassing.”</p>\n<p>“<em> Embarrassing? </em>” Tony sputters in mock outrage, prying himself out of the hug and straightening his jacket.</p>\n<p>Peter makes a placating hum, trading smiles with May.</p>\n<p>“Duty calls.” He says brightly. He aims finger guns at the pair before turning away to head back onto the floor.</p>\n<p>“<em> Embarrassing </em>.” Tony mutters good humoredly. “I’ll show that little shit embarrassing.”</p>\n<p>“Congrats, Tony.” May says with a grin. “You’ve officially passed on from the <em> cool parent </em> phase.”</p>\n<p>“I’m always cool.” Tony shoots back, eyeing the room they’re still seated in. “We should probably leave, right? Like, we definitely shouldn’t be chilling in their back room.”</p>\n<p>“Definitely.” May agrees.</p>\n<p>Tony calls Pepper on their way out, waving to a fond but exasperated Peter.</p>\n<p>“Pep– did you know that i’m embarrassing? <em> You did? </em> Why didn’t anyone ever tell me?”</p>\n<p> </p>\n<p>  </p>\n<p>You have been added to a group message with: <em> Tony Stark, Peter Parker, Pepper Potts, James Rhodes, </em> and <em> Happy Hogan </em></p>\n<p> </p>\n<p><em> Peter Parker </em>has changed the group name to: Ironfam</p>\n<p> </p>\n<p>group chat: Ironfam</p>\n<p> </p>\n<p>peter (4:44): what does everyone think of the group name</p>\n<p> </p>\n<p>rhodey (4:46): mushy</p>\n<p>rhodey (4:46): probably gave tony hives</p>\n<p>rhodey (4:47): <em> (thumbs up emoji) </em></p>\n<p>\n<em> Happy Hogan likes this </em>\n</p>\n<p> </p>\n<p>pepper (4:50): It’s very fitting</p>\n<p> </p>\n<p>may (4:51): what do you need peter</p>\n<p> </p>\n<p>peter (4:52): who said i needed anything</p>\n<p> </p>\n<p>tony (4:52): perhaps the fact that you just created a group chat for the all the essential and responsible adults in your life</p>\n<p> </p>\n<p>peter (4:54): weird that I would add you then :/</p>\n<p>\n<em> Pepper Potts &amp; May Parker like this </em>\n</p>\n<p> </p>\n<p>peter (4:58): can’t I just have a place to talk to my favorite people in the world at once??</p>\n<p>peter (4:58): my favorite people who love and care for me and cherish me</p>\n<p> </p>\n<p>may (4:59): no</p>\n<p> </p>\n<p>tony (4:59): unrealistic</p>\n<p> </p>\n<p>peter (5:01): shot down</p>\n<p>peter (5:02): fine</p>\n<p>peter (5:02): you caught me</p>\n<p>peter (5:02): i need a favor</p>\n<p> </p>\n<p>happy (5:04): just spit it out so i can go back to work</p>\n<p> </p>\n<p>peter (5:05): glad to know you love me</p>\n<p>peter (5:07): mj asked me out on a date</p>\n<p>peter (5:07): i need suggestions on where to take her</p>\n<p> </p>\n<p>pepper (5:08): aw congrats peter</p>\n<p>pepper (5:09): i’m sure she’ll have a good time wherever you take her</p>\n<p> </p>\n<p>tony (5:09): i told you she would say yes</p>\n<p> </p>\n<p>peter (5:10): i mean technically she asked me</p>\n<p> </p>\n<p>may (5:10): because you’re chicken</p>\n<p> </p>\n<p>peter (5:11): because i’m chicken</p>\n<p>peter (5:11): and she knows that</p>\n<p> </p>\n<p>rhodey (5:13): well i’m sure your date will go better than tony’s first date with pepper</p>\n<p> </p>\n<p>tony (5:15): i happen to be great at first dates</p>\n<p> </p>\n<p>pepper (5:16): just the first one though</p>\n<p> </p>\n<p>tony (5:18):  maybe so</p>\n<p>tony (5:18):  but you agreed to marry me</p>\n<p> </p>\n<p>pepper (5:19): that i did</p>\n<p> </p>\n<p>may (5:20): any ideas peter?</p>\n<p> </p>\n<p>peter (5:22): no</p>\n<p>peter (5:22): sos</p>\n<p>peter (5:23): oh this was such a bad idea</p>\n<p>peter (5:24): i’m full of regrets</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>“Are we not going to talk about the fact that you haven't slept in 40 hours.” Peter says lightly, once May has wrapped both of the boys up in blankets and pushed them onto the couch.</p>\n<p>His voice is too calm, words too precise, and from the kitchen, May take a deep breath in.</p>\n<p>That was the deal– they could track Peter's vitals if he could track theirs. And <em> yeah </em>, this whole thing is probably way too invasive, but she’s not stupid. She knows that Peter has his share of PTSD too, and if it helps either of them rest easy, then it’s a small price to pay.</p>\n<p>“You’re one to talk, kid.” Tony says icily.</p>\n<p>It’s been a bad week, overall. She thinks the shitty weather might have something to do with it.</p>\n<p>She knows Tony is full of phantom aches and pains. The temperature changes make him clutch his chest, like he’s looking for something to ground him that isn’t there.</p>\n<p>His breathing problems during bad weather are mostly psychosomatic, he had told her. It didn’t really matter.</p>\n<p>Peter isn’t as bad, not yet, but this is something he understands more than May.</p>\n<p>Stormy weather drives him crazy, now. Sensory overload from hearing millions of raindrops, every high frequency of light, every vibration of the rain on the building. Survival spidey senses, Tony had dubbed them, before working on ways to help him.</p>\n<p>So, stormy weather is bad news.</p>\n<p>(The rogue Avengers settling in Tony’s compound definitely weren’t helping, either.)</p>\n<p>“Doesn’t your therapist have, like, sleeping pills she can give you?” Peter asks.</p>\n<p>Tony purses his lips.</p>\n<p>“I avoid pills when I can.” he says, in a<em> don’t push me tone </em>. “And i’m… between therapists. At the moment.”</p>\n<p>Peter frowns.</p>\n<p>“I’m pretty sure you need a therapist.” Peter says honestly, and Tony snorts. “I’m seeing a therapist.”</p>\n<p>“I know. I recommended you to her.”</p>\n<p>“So you know she’s great. You’re the one who told me that people like us need people like them.”</p>\n<p>When May comes back with a tray of hot chocolate for the three of them, she wedges herself in between them. When she looks at Peter, she can see he's wearing the implants Tony gave him to help block out sound.</p>\n<p>She hands a mug to both boys before turning on a nature documentary. She throws on subtitles because the volume is so low.</p>\n<p>Halfway through, she can feel Peter fall asleep. She cranes her head to look at Tony, whose hands are still wrapped around his now empty mug.</p>\n<p>“You can sleep, Tony.” she says quietly. He looks apologetic.</p>\n<p>“I can’t.” he says.</p>\n<p>She pulls the mug from his hands. Wraps the blanket tighter around them. For a moment she feels exhausted, like there’s a large weight on her chest that’s choking her. She wonders if it’s how Tony feels all the time.</p>\n<p>“I know.” she says, and gets up to make them more cocoa.</p>\n<p> </p>\n<p> </p>\n<p>“He doesn't scream.” May says to Rhodey, one day. Peter and Tony's image is floating in pixelated blue on the edge of the table where May and Rhodes are playing mancala. “Tony, you know?”</p>\n<p>The pair of them had been working in the lab before Peter had fallen asleep on the downstairs couch. Tony has only intended to sit for a moment, sort through emails, but he had soon followed. The holo-feed shows them both snoozing comfortably.</p>\n<p>Rhodes raises an eyebrow.</p>\n<p>“I've worked with a lot of PTSD patients.” she elaborates. “The almost all have night terrors. They wake up screaming.”</p>\n<p>May chews on her words.</p>\n<p>“Peter does, sometimes.” she says finally. Rhodey’s expression darkens.</p>\n<p>“I’m sorry.” he says quietly. He takes his turn smoothly, dropping a stone into his store and taking another turn. May makes a quick move to steal a pocket of Rhodey’s stones.</p>\n<p>“I think it’s from the cave.” Rhodey says. <em> Afghanistan </em>, May thinks. It always comes back to Afghanistan, with Tony. “I don’t know exactly what happened, there. Even now, Tony’s very... protective, of that information. But I know enough.”</p>\n<p>Rhodes lets out a deep sigh.</p>\n<p>“Anyways,” he says, sounding tired. “after everything that’s happened, at this point it's rare for him to even sleep without being a foot away from someone he trusts.”</p>\n<p>The list, May knows, is short.</p>\n<p>“You know , I was furious, when I found out how old Peter was and Tony recruited him.” Rhodes says, staring at the board.</p>\n<p>“I was too.”</p>\n<p>“I’m glad, now.” Rhodes says.</p>\n<p>May watches the holo-feed, Tony and Peter sleeping in blue.</p>\n<p>“I know what you mean.” she says.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>May is finally relaxed when her phone pings. She’s burrowed herself in blankets, made herself a steaming mug of tea, and is almost through the first chapter of her new sci-fi novel.</p>\n<p> </p>\n<p>group: may parker &amp; tony stark</p>\n<p> </p>\n<p>tony (4:55): i’m sending peter home. happy’s driving.</p>\n<p>tony (4:55): didn’t get a chance to eat so you’ll probably have to feed him</p>\n<p> </p>\n<p>may (4:57): ??</p>\n<p>may (4:57): what happened??</p>\n<p> </p>\n<p>tony stark is typing…</p>\n<p> </p>\n<p>May watches the bubbles start and stop, anxiously tapping her hand on the side table.</p>\n<p> </p>\n<p>may (5:05): tony?</p>\n<p>may (5:06): stark</p>\n<p>may (5:06): what the hell happened</p>\n<p> </p>\n<p>Annoyed, she changes tactics, thumbs flying furiously across her phone.</p>\n<p> </p>\n<p>group: may parker &amp; james rhodes</p>\n<p> </p>\n<p>may (5:07): rhodes</p>\n<p>may (5:08): do you know why stark is sending my kid home?</p>\n<p> </p>\n<p>She presses send on the message to Rhodey, but before he can respond she gets a notification from Tony.</p>\n<p> </p>\n<p>tony (5:08): he punched rogers in the face</p>\n<p> </p>\n<p>May takes a moment to read the text, then reread it again. For a moment she just stares at the dull glow on her screen, feeling her stomach swoop.</p>\n<p> </p>\n<p>tony (5:09): honestly it’s something i too would like to do</p>\n<p>tony (5:09): but i figured that wouldn’t really set a great example. sent him home to cool off</p>\n<p> </p>\n<p>may (5:10): oh my god</p>\n<p>may (5:10): oh my GOD</p>\n<p>may (5:11): my kid punched captain america</p>\n<p> </p>\n<p>Before she can spiral into a panic, her phone pings again, a message from Rhodes.</p>\n<p> </p>\n<p>rhodey (5:11): he clocked rogers in the jaw</p>\n<p>rhodey (5:12): it was lit</p>\n<p> </p>\n<p>May takes a deep breath, leaning back into the couch and closing her eyes</p>\n<p> </p>\n<p>may (5:13): you don’t use the word lit. you’ve been talking to peter too much</p>\n<p>may (5:13): and it is very much not lit</p>\n<p>may (5:13): my kid just punched a national hero</p>\n<p> </p>\n<p>rhodey (5:14): who was recently a war criminal</p>\n<p>rhodey (5:14): if that helps</p>\n<p> </p>\n<p>may (5:15): it doesn’t</p>\n<p> </p>\n<p>rhodey (5:16): it sorta does</p>\n<p>rhodey (5:16): i’m honestly just mad he beat me to it</p>\n<p> </p>\n<p>you have (1) new message from tony stark</p>\n<p> </p>\n<p>tony (5:17): peter dislocated his jaw btw</p>\n<p>tony (5:17): steve’s</p>\n<p>tony (5:18): so his little super secret is sort of out of the bag</p>\n<p> </p>\n<p>may (5:18): fuck</p>\n<p> </p>\n<p>tony (5:19): yeah</p>\n<p>tony (5:19): fuck</p>\n<p> </p>\n<p>you have (1) new message from james rhodes</p>\n<p> </p>\n<p>rhodey (5:19): (attachment: <em> getfuckedsteve.jpg </em>)</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>When Peter arrives at the apartment twenty minutes later, he slams the door before storming into the living room. May doesn’t say a word as she watches him from the kitchen, pouring spaghetti into a boiling pot of water. Peter throws himself on the couch, glowering at the opposing wall.</p>\n<p>She lets him stew in silence, sneaking through pages of her book while occasionally stirring the boiling spaghetti. When it’s done, she strains the pasta and rations out a reasonable portion for herself and a heaping mound for Peter, before carrying it into the living room.</p>\n<p>She deposits Peter’s dinner onto the coffee table in front of him. His attention snaps away from the wall, and he thanks her with a low grumble.</p>\n<p>For awhile the only sound is the clattering of their forks against ceramic. May isn’t exactly sure how to confront this. She doesn’t really want to.</p>\n<p>“So,” she finally airs. Peter’s eyes are on his plate, and she watches his whole body tense. “I heard that you had an altercation with Captain Rogers at the compound.”</p>\n<p>Peter doesn’t deny it, but he also doesn't respond. May tries to avoid gritting her teeth in annoyance. She only lets the silence hang briefly.</p>\n<p>“Peter.” she pushes, and that’s all it takes. His head snaps up to meet her eyes.</p>\n<p>“<em>You weren’t there </em>.” Peter snarls, and he sounds furious and tired and incredulous all at once. “You didn’t see Mr. Stark afterwards. You didn’t see what he did.”</p>\n<p><em> Siberia </em>, she thinks. May forces her muscles to stay loose, to appear calm. If she’s learned anything from Tony, it’s how to appear blank when you’re really boiling. She twirls spaghetti around her fork.</p>\n<p>“Did it make you feel better?” She asks calmly, and Peter’s anger seems to dissipate.</p>\n<p>“No,” he says tiredly, closing his eyes. “It didn’t.”</p>\n<p>“Okay.” May says, and when they finish their pasta May scoops them towering bowls of ice cream.</p>\n<p>They spend the rest of the night quietly curled up in front of the TV. Peter’s face keeps falling into a blank expression, but she watches as the tension in his body loosens, until he’s fast asleep.</p>\n<p>For awhile May just watches the rise and fall of his chest, breath steady, and tries to avoid thinking about the fallout to come.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>tony (11:02): so</p>\n<p>tony (11:02): what’d you do to the kid</p>\n<p> </p>\n<p>may (11:03): …</p>\n<p>may (11:04): i gave him ice cream</p>\n<p> </p>\n<p>tony (11:07): my hero</p>\n<p> </p>\n<p> </p>\n<p>May wonders if she should have seen it coming, when Peter has a panic attack during movie night. It’s a been a bad week already, and Peter’s been on edge, stressed and tense.</p>\n<p>A building in the movie had exploded, and before May could even turn down the volume Peter was lurching forward to switch off the TV entirely, before sliding to the carpet.</p>\n<p>Tony and May had made a quick, silent decision to give Peter space, sitting on the floor a few paces across from him. She can see his chest rising and falling at an extreme pace.</p>\n<p>“<em> Stop freaking out </em>.” Peter snarls.</p>\n<p>“We aren’t.” May says calmly, but Peter shakes his head.</p>\n<p>“I can hear your blood pressure rising.” he says, with a spark of desperation. “I can hear your heart rates.”</p>\n<p>“Kid– ” Tony starts.</p>\n<p>“<em> I'm fine </em>.” Peter snaps.</p>\n<p>“Sure.” Tony hums. There’s a pause, and he looks like he’s deciding something. Tony stares at a spot a few feet to the right of Peter.</p>\n<p>“Do you know when I started getting panic attacks?”</p>\n<p>Peter's head snaps up, this time. Tony still isn’t looking at him.</p>\n<p><em> “You?” </em> he asks quietly, and Tony actually chuckles.</p>\n<p>“That's exactly what I said when Jarvis diagnosed me.” Tony says, and his smile is bittersweet. He picks at the sleeve of his shirt. “For me, they started after New York. After that– <em> that fucking wormhole </em>.”</p>\n<p>“I can’t breath.” Peter says.</p>\n<p>May feels her heart clench.</p>\n<p>“I know, kid.” Tony says softly. “But we’re here for you. Think you pick out five things you can see for me?”</p>\n<p> </p>\n<p> </p>\n<p>may (6:12): so</p>\n<p>may (6:12): what’s going on with you today</p>\n<p>may (6:13): peter said you were in a mood</p>\n<p> </p>\n<p>tony (6:14): i dont know what he’s talking about</p>\n<p>tony (6:14): i’m always like this</p>\n<p> </p>\n<p>may (6:15): petty and spiteful?</p>\n<p> </p>\n<p>tony (6:17): sounds like me</p>\n<p> </p>\n<p>may (6:20): it definitely doesn't have anything to do with the fact that peter asked steve for help on a project about WWII</p>\n<p> </p>\n<p>tony (6:17): of course not</p>\n<p>tony (6:17): that would be an immature overreaction</p>\n<p> </p>\n<p>may (6:20): you’re right that doesn't sound like you at all</p>\n<p> </p>\n<p> </p>\n<p>Tony looks miserable. He glances towards the clock, and May knows he’s counting down the seconds until Pepper returns home from her shareholders meeting in Japan.</p>\n<p>Rhodes won’t be back until morning, and Peter’s spending the night at Ned’s. May and Tony have been laying on the floor for the better part of an hour, basking in the air conditioning.</p>\n<p>“What should we do?” Tony asks.</p>\n<p>May’s eyes drift across the room.</p>\n<p>“We should drink.” she says, and Tony snorts.</p>\n<p>“I’m a recovering alcoholic.” he says blandly, but he’s already shuffled towards the liquor cabinet.</p>\n<p>A few hours later she’s well on her way through her bottle of wine, she’s lost track of how many drinks Tony has poured himself, and they’ve drunk halfway through High School Musical.</p>\n<p>(“<em> We should start a club! </em>” Tony is saying to her drunkenly. His eyes are bright, and his smile is somehow even more dazzling than usual.</p>\n<p>May snorts.</p>\n<p>“That’s called therapy, Tony.”)</p>\n<p>When Pepper comes home, she walks into the living room to see the two of them sitting on the floor, curled up in thick blankets and surrounded by a few empty cartons of ice cream.</p>\n<p>“<em>Babe!! </em>” Tony says excitedly, craning his neck backwards at an awkward angle to see her.</p>\n<p>“Babe!!” May imitates drunkenly, raising a half-full glass of whatever Tony’s poured her last.</p>\n<p>Pepper takes a moment to look over the scene. Her eyes scan over the empty containers, swipe across the various bottles and onto the TV, which is blaring High School Musical 2.</p>\n<p>“It’s 8 pm.” she says.</p>\n<p>“Perfect time for a party!” Tony tells her. He gestures towards the television. “Want to watch the rest of this American classic with us?”</p>\n<p>Pepper rolls her eyes but steps forward anyway, dropping a kiss on Tony’s forehead.</p>\n<p>“Let me change into sweats, and i’ll be right out.”</p>\n<p>Pepper disappears down the hallway, and Tony and May watch her leave blankly. May considers the mess around them.</p>\n<p>“Do you think she’ll make us stop drinking?” she wonders worriedly. Tony’s head snaps to face her, looking distraught.</p>\n<p>“She might.” he says, solemnly. His eyes flick to the kitchen.</p>\n<p>“I have an idea!” he whisper-shouts, launching himself to a standing position. He stumbles immediately, and May make a half-assed effort to keep him standing. With a certain degree of difficulty, the two move out of the living room. </p>\n<p>Pepper finds them in the kitchen pouring a carton of milk down the drain.</p>\n<p>(“What the hell are you doing?” she says, standing the the kitchen doorway. Tony looks at her guiltily from the sink, May from the counter she’s perched on.</p>\n<p>“We thought you were going to make us stop drinking.” May informs her. “We were going to fill the milk carton with vodka.\" </p>\n<p>Pepper stares at them for a grand total of five seconds before exiting the kitchen without a word.)</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>May doesn’t remember falling asleep, but she remembers waking up. Her head is pounding like a steel drum and she feels so dehydrated she’s sure her skin is wrinkled and flaky. When she finally forces herself off the couch into the kitchen, Tony looks like he’s feeling similarly.</p>\n<p>“God. My tolerance is shot.” Tony says sulkily, staring into his coffee. “I miss being an alcoholic.\"</p>\n<p>He jerks forward slightly as he’s smacked in the back of the head by Rhodey with a folded magazine.</p>\n<p>“I was kidding, Platypus.”</p>\n<p> </p>\n<p> </p>\n<p>“Did you know that we're secretly married and have an illegitimate child?” Tony asks blandly over breakfast, swiping butter onto his piece of toast.</p>\n<p>It says a lot, May thinks, about the absolute shitshow her past year has been, that she doesn’t even bat an eye.</p>\n<p>“If we’re married, how is he illegitimate?” she wonders.</p>\n<p>“I was married to Captain America at the time.” Tony tells her solemnly, and May chokes on her orange juice.</p>\n<p>“Those timelines really do not line up at all.” May says with a wheeze, shaking her head. Rhodey makes a humming sound as he dips his spoon in his cereal.</p>\n<p>“Of course not.” he says brightly, chewing around a mouthful of Frosted Flakes. “That’s why it’s in the <em> Daily Super </em> and not the <em> New York Times </em>.”</p>\n<p>May takes the magazine Tony is offering her with interest. The article is accompanied by a photo of her and Tony sitting at dinner, framed with bright neon lettering.</p>\n<p>“Why do you even get this?” she asks, bewildered. “And in paper, no less.”</p>\n<p>“It’s his favorite one.” Pepper tells her, deadpan as she spreads butter on her own piece of toast. “I believe his excuse was, <em> I like their ingenuity </em>.”</p>\n<p> </p>\n<p> </p>\n<p>Glowing brightly on her phone, Tony’s image is scrolling through holograms with a furrowed brow.   </p>\n<p>“Tuesday won’t work.” he says critically, eyeing the hovering images. “Meeting with the secretary to finalize addendums to the Accords.”</p>\n<p>He throws the sentence like it’s nothing, but she doesn’t need to see his left hand to know that it’s convulsing. Even on the small of her screen, the bags under his eyes are clear enough that they make her cringe. They’re so large that the airlines would probably count them as carry ons, May thinks, wondering when the last time Tony slept for more than two hours at a time was.</p>\n<p>“Peter has band Wednesday–”</p>\n<p>“–and decathlon practice Friday.” Tony finishes for her. “Thursday?”</p>\n<p>“Thursday it is.” May agrees.</p>\n<p>The tablet on her bedside chirps with a notification.</p>\n<p>\n<em> Tony Stark has added the event Dinner at 6pm to the Parker-Stark Family Calendar for Next Thursday. </em>\n</p>\n<p>(Peter had named the calendar the moment Friday has synced their apps together.  </p>\n<p>Tony had rolled his eyes good naturedly and lobbied for it to be renamed Stark-Parker, but he had been tragically outvoted.</p>\n<p>Tony had also lobbied, one sleepless night when he was highly manic, to program May her own AI, since he had Friday, and Peter had Karen, who now was programmed in all his devices.</p>\n<p>May had firmly refused. )</p>\n<p>“Takeout this week, or should I make us a reservation? Tony asks, snapping her back to the present. She can see his suggestion for various locations pop up on her tablet in quick succession.</p>\n<p>“I was thinking,” May says, and Tony’s eyes narrow on her phone. “What if we ate at the Compound? With the team.”</p>\n<p>Tony’s silence is stony.</p>\n<p>“Listen.” she goes on. “I know you’ve been.. <em> dealing </em>with all this shit. But I think this could be good for everyone. Especially Peter.”</p>\n<p>“Cheap move, Parker.” Tony mutters.</p>\n<p>“I’d also like a better chance to meet your ex.” she adds, the corner of her mouth twitching.</p>\n<p>“You’re exaggerating.” he says dryly, but doesn't argue the point further. Tony lets out a long breath, leaning back into his chair with closed eyes.</p>\n<p>“Alright.” he says tiredly. “When it all goes to hell, I will be blaming you.”</p>\n<p> </p>\n<p> </p>\n<p>Dinner does not completely go to hell.</p>\n<p>As in, no punches are thrown, no one storms off before they’re finished with their meal. But May’s not sure she would exactly label it as a success.  </p>\n<p>It almost hurts. In between blinks, she thinks she can see it, the way things that might have been. Conversations are kept light, but there are undercurrents of old loyalties. Old patterns and old jokes, lines fed to one another without thought, easy as breathing. Passing things to each other without being signaled.</p>\n<p>And sometimes everything flows, and Tony smiles as much as the Captain, and Widow and Falcon look almost at ease. </p>\n<p>Of course, at times things are still stilted.</p>\n<p>May can tell that they’re all under orders<em> (from Tony or Rhodes, she can’t tell) </em>to play nice, to let things slide.</p>\n<p>Tony’s jaw is tight the whole night, but everytime Peter laughs it loosens, somewhat, and his eyes soften. Peter already has a rapport with the others, something to build off of. Peter is familiar. When it comes to her, though, she can feel their curiosity.</p>\n<p>She can’t exactly pin what it is, exactly. But it’s the same feeling she’ll sometimes get around Tony and Rhodey, occasionally even Peter. When her body isn’t exactly screaming danger, but senses there’s a threat.</p>\n<p>The rogues have the same kind of energy– powerful people trying very hard to appear non-threatening.  </p>\n<p>May thinks she’s imagining it, but then she catches Steve’s eye, and for no reason at all feels like her body’s been dipped in ice.</p>\n<p><em> Some of the most intelligent people on the planet </em>, she remembers, and for the first time she believes it.</p>\n<p> </p>\n<p> </p>\n<p>Things are… different, now that the others know Peter the intern is Spider-man.</p>\n<p>May knows there was fallout at the compound. When she asks Tony about it, he gives her a smooth smile and reassurances, but she can see the tightness around his eyes– even when he’s wearing sunglasses.</p>\n<p>(“It sucked.” Rhodey tells her honestly. “But hey, it’s not like there are anymore life altering and trust-breaking secrets between the team. Probably. So that’s a plus.”)</p>\n<p>It also means that Peter spends more time at the compound, as, well, Peter. Which mean May spends more of her time there, too.</p>\n<p>“Can I go over to Ned’s tonight?” Peter asks, making an appearance in the common area.</p>\n<p>They’ve spent the week at the compound so Peter can have more time to train, which both Tony and May had insisted upon after Peter came home the previous week with a stab wound.</p>\n<p>“Have you finished your work for summer decathlon?” May asks from the couch.</p>\n<p>Distantly, she’s aware of the other Avengers roaming about, though she hadn’t been paying them much mind. She and Tony had been firing buzzfeed quiz questions at each other.</p>\n<p>“Yeah, before I showered.” Peter nods, his wet hair sending water droplets flying.</p>\n<p>“Then it’s alright with me.” May says, and Peter grins.</p>\n<p>“Thanks May!” he calls over his shoulder as he disappears, presumably to get his backpack. He skids back in a minute later.  </p>\n<p>“Can I take the Audi?”</p>\n<p>“In your dreams, kid.” Tony scoffs, tossing Peter a set of keys along with a hoodie he had abandoned the day before. “Take a jacket. It’s supposed to get cold.”</p>\n<p>“And get a snack before you go.” May instructs. “You haven't had dinner yet.”</p>\n<p>Peter looks like he’s trying very hard not to roll his eyes.</p>\n<p>“Ned has snacks. And i’ll be inside.” he placates, but he holds onto the hoodie.</p>\n<p>“Fine.” she says. “But eat something tonight, okay?”</p>\n<p>“I will, May.”</p>\n<p>“Text us when you get there.” Tony adds, frowning at a floating blue schematic.</p>\n<p><em> “Oh my god.” </em> May hears Sam mutter. “This is so domestic. <em> What the fuck </em>.”</p>\n<p> </p>\n<p> </p>\n<p>Tony steps into the apartment with a pizza box and wrinkles his nose at the smell. </p>\n<p>“What's going on here?” he asks, eyeing May and Peter seated at the table. May’s left hand is splayed out neatly, and Peter is holding her right, halfway through painting her nails. His eyes widen at the sight of Tony at the door.</p>\n<p><em> “Mr. Stark!” </em>he all but shouts. He looks nervous, and May cringes internally. Peter had wanted to finish before the older man arrived, take the polish off of his own nails, but the process had turned out to be more time consuming than either of them expected.</p>\n<p>Peter is nervous, tripping over his words and himself.</p>\n<p>“ I, uh, i’m practicing on May because MJ was complaining to me about how she can only paint one hand, which, wow, she’s right it’s <em> really hard–”   </em></p>\n<p>May watches Tony's eyes flick to Peter's left hand, which looks daily well done in pink, to his right, which is sloppy and a mess.</p>\n<p>“–so i just wanted to learn to paint nails, you know, to surprise her so she can have both hands done and everything. Hopefully she likes it. I don’t want to offend her and like, imply that she <em> can’t </em>do her own nails but it would just be easier for me to do them, you know?”</p>\n<p>Tony and May trade smirks before turning their attention back to Peter. They’ve made a deal to try and not tease Peter about MJ.</p>\n<p>“I just wanted some practice. And I'm getting better, but, I need to do it a few more times.” Peter finishes quietly, ducking his head.</p>\n<p>Tony nods, moving forward and depositing the pizza on the table.</p>\n<p>“You can do mine, kid.” he offers nonchalantly, and both May and Peter stare.</p>\n<p>Tony hides his discomfort by raising an eyebrow.</p>\n<p>\"Or not,\" he starts, but Peter stumbles over him in apology, promising to do his after he finishes the last coat on May.</p>\n<p>“Any color preferences, Tony?” she asks, and Tony grins.</p>\n<p>“Got anything red?”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>group name: parker-starks</p>\n<p> </p>\n<p>tony (8:06): i have received a multitude of compliments about your work, peter</p>\n<p> </p>\n<p>peter (8:07): from the conference last month?</p>\n<p> </p>\n<p>tony (8:08): what</p>\n<p>tony (8:08): no</p>\n<p>tony (8:09): well yes but that’s not what i’m talking about</p>\n<p> </p>\n<p>peter (8:09): oh my god</p>\n<p>peter (8:09): you told the avengers i painted your nails??</p>\n<p> </p>\n<p>tony (8:10): yep</p>\n<p> </p>\n<p>peter (8:11): this is child abuse</p>\n<p>peter (8:11): some kind of slander</p>\n<p>peter (8:13): @mayparker stop him</p>\n<p> </p>\n<p>may (8:14): i think it’s too late for that   </p>\n<p>may (8:14): rip</p>\n<p> </p>\n<p> </p>\n<p>“I though the piano was just for show.” Peter says when they’re at the Tower for Sunday dinner, frowning at the corner. The cover had been left lifted, the black and white keys sparkling. Tony makes an offended sound.</p>\n<p>“You thought I was just one of those rich guys who owns a piano just to have one as a showpiece? That hurts, Parker.” he pauses. “Although that does sound like something I would do.”</p>\n<p>“Were you playing?” Peter asks curiously.</p>\n<p>“I’ve been giving May lessons.” Tony says, trying to sound casual. He’s tapping away at a holoscreen. “That counts as a hobby, right?”</p>\n<p>Peter’s eyes are shining, and he slides onto the piano bench, staring at the sheet music.</p>\n<p>“I’ve always wanted to learn.” Peter says, brushing the keys lightly.</p>\n<p>“He’s a pretty good teacher.” May adds truthfully. “Although we only play songs written by Italians.”</p>\n<p>“Dean Martin was Italian.” Tony defends. He wanders over the the corner, sliding next to Peter on the piano bench.</p>\n<p>For awhile the only sound is the tinkling of chords and hushed conversation from the corner.</p>\n<p>(“I’m in<em> band </em>. I can read sheet music.”</p>\n<p>“So you can read both treble and bass clef?\" </p>\n<p>“... yes.”)</p>\n<p>May drinks in the image. The way the light reflects on the sleek surface of the baby grand piano. Peter, smiling and snug in one of Tony's MIT sweatshirts. The look on Tony’s face everytime Peter correctly copies the melody.</p>\n<p>Her eyes drift to Peter’s new camera on the side table.</p>\n<p>Before either of the boys even register her approach, the camera flashes. Distantly, she’s aware of spluttered protest from both Tony and Peter, but she ignores them in favor of finding the library button.  </p>\n<p>Pepper is looking over her shoulder at the picture before May even realizes she’s there.</p>\n<p>“I have the food.” Pepper says, raising the bags of takeout briefly beforing eyeing the camera screen.</p>\n<p>“God, that’s adorable.” she adds. Rhodes pushes himself off the couch, his exoskeleton leg braces whirring. He looks critically at the photo.</p>\n<p>“Well done, May.” he says faux-professionally. “You have a superior sense of lighting and the two-thirds rule. It’s clear where Peter gets his photography genes from.”</p>\n<p>“I’m <em> great </em> at taking photos.” Tony interrupts, standing and siding over to the group huddled around the camera. “Have you seen how many likes my selfies get?”</p>\n<p>May shows him the picture. His expression doesn’t change, but May knows he loves it.</p>\n<p>“Friday?” he calls. “Sync that to my files.”</p>\n<p>“Done, Boss.”</p>\n<p>Peter deftly lifts the camera from her grasp, smiling at the image. He glances around, eyes scanning the room.</p>\n<p>“Can we take a photo of all of us?” he asks, and May is glad they all pretend not to hear the edge of nervousness. “You know, for my project?”</p>\n<p>“Well, if it’s for your project, how can we say no?” Rhodey says, mocking goodnaturedly.</p>\n<p> </p>\n<p> </p>\n<p>“You know if we pose, we can just have Friday take a picture with one of the wall cameras.” Tony says once they’ve set Peter’s camera timer that Peter had insisted upon. It’s sitting precariously on a stack of books on the coffee table.</p>\n<p>Rhodey had declared the structure steady.</p>\n<p>(“<em> Tony’s not the only one who went to MIT, you know. </em>”)</p>\n<p>May found it questionable, but Peter had seemed to agree that it was fine.</p>\n<p>“It’s gonna take four photos, ten seconds after I set it off.” Peter informs the rest of the group, who’s already in position. “There’s gonna be three seconds in between photos. Ready, <em> go! </em>”</p>\n<p>Peter presses the button and the light on the camera flashes red. He squeezes himself in between Tony and May.</p>\n<p>“Wait, when is the first–”</p>\n<p>\n<em> Flash. </em>\n</p>\n<p>“Fuck, okay.”</p>\n<p>“Ha, Tony Stark can’t even fucking– ”</p>\n<p>\n<em> Flash. </em>\n</p>\n<p>“–count.”</p>\n<p><em> “ </em>Silly pic!” Peter shouts brightly.</p>\n<p>\n<em> Flash. </em>\n</p>\n<p>“Look cute!” Peter says happily. He snakes an arm around May and Tony.</p>\n<p>\n<em> Flash. </em>\n</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>When May wakes up the next day, she’s annoyed to find that her follower count on Instagram has skyrocketed. She takes a brief moment to mourn what Peter must have felt like when the same happened to him.</p>\n<p>It takes her a few minutes to scroll through the mass amount of notifications on her phone, but she predictably traces the cause back to a single photo that had been posted at an inhuman hour of the day. </p>\n<p>(3:23) <em> Tony Stark (@youknowwhoiam) has tagged you in a photo </em></p>\n<p>May throws out a few Italian curses, clicking the link to Tony’s page. When she sees Tony’s post, though, she finds herself smiling.</p>\n<p> </p>\n<p>image: <em> Tony, May, Peter, Pepper, and Rhodey huddled together from the night before. Arms looped around each other, laughing at each other instead of looking at the camera. </em></p>\n<p>caption: <em> night in with my favorite people in the world. #ironfam </em></p>\n<p> </p>\n<p>(The mass amount of followers, May thinks, are worth it.)</p>\n<p> </p>"
}