{
  "id": "15189752",
  "url": "https://archiveofourown.org/works/15189752?view_full_work=true",
  "author": [
    "Feneris"
  ],
  "title": "Looping Back to the Beginning",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
  ],
  "relationships": [],
  "characters": [
    "Class 1-A (My Hero Academia)",
    "Midoriya Izuku",
    "Uraraka Ochako",
    "Bakugou Katsuki",
    "Yagi Toshinori | All Might",
    "Yamada Hizashi | Present Mic",
    "Shinsou Hitoshi",
    "Aizawa Shouta | Eraserhead",
    "Todoroki Shouto",
    "Kirishima Eijirou",
    "Jirou Kyouka",
    "Shigaraki Tomura | Shimura Tenko",
    "Kurogiri (My Hero Academia)",
    "Dabi (My Hero Academia)",
    "Toga Himiko",
    "My Hero Academia Ensemble",
    "The works basically - Character"
  ],
  "additional_tags": [
    "Time Travel",
    "Time Loop",
    "messing with people",
    "Messing with Dangerous People",
    "messing with friends",
    "Conspiracy Theories",
    "Crack"
  ],
  "language": "English",
  "series": "",
  "published": "2018-07-06",
  "completed": "2018-08-07",
  "words": "10,532",
  "chapters": "5/5",
  "comments": "1,172",
  "kudos": "32,392",
  "bookmarks": "8,184",
  "hits": "302,161",
  "summary": "<p>Where Class 1-A finds itself in a time loop centered around their first year at UA. After getting over the usual angst, they decide that the best way to grow as heroes is by antagonizing dangerous villains for fun and amusement.</p>",
  "notes": "<p>What can I say, time loops are fun. I've been trying to get something complete for BNHA and this is the closest I've gotten, hope if brings a few laughs.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
  "text": "<p>\n<em> Dear Mr. Shigaraki. </em>\n</p>\n<p> </p>\n<p><em> We regret to inform you that due to unforeseen circumstances All Might will be unavailable for your </em> <b> <em>Villainous Attack </em> </b> <em> on the </em> <b> <em>UA Unforseen Joint Simulator </em> </b> <em> at </em> <b>10:45am.</b></p>\n<p> </p>\n<p><em> If you wish to reschedule your </em> <b> <em>Villainous Attack </em> </b> <em> for a later date, please get in contact with us as soon as possible. </em></p>\n<p> </p>\n<p>\n<em> We apologize for any inconvenience this may have caused. </em>\n</p>\n<p> </p>\n<p>\n<em> — </em>\n</p>\n<p> </p>\n<p>Shigaraki stepped out of the portal and surveyed the group standing before him. All Might wasn’t there. Just a bunch of kids standing around gawking at him. Why wasn’t All Might here!?</p>\n<p> </p>\n<p>“SEE!” One of the kids suddenly called out. “I told you he would be stupid enough to actually do it!”</p>\n<p> </p>\n<p>A loud grumble came from the group and sheafs of money changed hands.</p>\n<p> </p>\n<p>—</p>\n<p> </p>\n<p>Aizawa zipped up his sleeping bag and laid out on the floor of the bus. He gave it twenty minutes before 13 realized the emergency they had been called out for was a prank. That was twenty minutes of uninterrupted sleep while his kids pounded the shit out of the League of Villains.</p>\n<p> </p>\n<p>There was a shattering of glass and a villain bounced off the hood of the bus. Aizawa cracked open an eye. No one particularly dangerous.</p>\n<p> </p>\n<p>He closed his eyes again.</p>\n<p> </p>\n<p>Those kids had it all under control.</p>\n<p> </p>\n<p>—</p>\n<p> </p>\n<p>“I don’t get it,” Present Mic admitted. “He’s been so well rested lately. Not that that’s a bad thing! But, he’s never been well rested! Never! I don’t think he ever got more than six hours sleep in a row since high school!”</p>\n<p> </p>\n<p>“There’s also his class to consider too,” Midnight added, frowning in thought.</p>\n<p> </p>\n<p>“What about them?” All Might asked. “They seem like good kids from what I can tell.”</p>\n<p> </p>\n<p>“He never expelled any of them.” Present Mic clarified. “Hasn’t even threatened to expel them. He even let them attend the opening ceremony.”</p>\n<p> </p>\n<p>“That’s unusual?”</p>\n<p> </p>\n<p>“He hasn’t had a single class where he didn’t expel at least one kid on the first day.”</p>\n<p> </p>\n<p>“Oh.”</p>\n<p> </p>\n<p>A long silence fell over the staff room.</p>\n<p> </p>\n<p>“I think we may have an imposter here,” Midnight finally declared.</p>\n<p> </p>\n<p>—</p>\n<p> </p>\n<p>\n<em> Late last night the infamous vigilante Stain was arrested by local police after being rescued from a tree in Honsu Municipal Park in the hours after midnight. According to sources within the police department, they received an anonymous tip off which led to them finding the vigilante in question hanging from a tree by a bright red ribbon. </em>\n</p>\n<p> </p>\n<p>\n<em> Witnesses report that Stain was restrained by several sheets of brightly colored wrapping paper and that his limbs were tied with more bright red ribbons. </em>\n</p>\n<p> </p>\n<p>\n<em> Police have not released any details as to how Stain might have gotten into such as situation, but have asked for any witnesses who may have seen the incident take place to come forward. </em>\n</p>\n<p> </p>\n<p>\n<em> — </em>\n</p>\n<p> </p>\n<p><em> “ </em>Hey Hands Dude,” Dabi called out, carrying two boxes of pizza into the room. “Why'd you order a pizza delivered to your secret hideout?”</p>\n<p> </p>\n<p>“The fuck?” Shigaraki turned from his place in front of the TV. “I didn't order a pizza.”</p>\n<p> </p>\n<p>Dabi’s eyebrows rose. “Pizza guy said someone named Shigaraki had placed the order.”</p>\n<p> </p>\n<p>“I…”</p>\n<p> </p>\n<p>“Hey guys!” Toga bounded into the room. “Hey you ordered pizza Handsy! Awesome!”</p>\n<p> </p>\n<p>“I didn’t…”</p>\n<p> </p>\n<p>Kurogiri followed in Toga’s wake. He took one look at the pizza boxes in Dabi’s hands and let out a sigh that spoke of long years of frustrated suffering. “Why did you order a pizza delivered to our hideout Shigaraki?”</p>\n<p> </p>\n<p>“I DIDN’T ORDER THE GODDAMN PIZZAS!”</p>\n<p> </p>\n<p>He snatched the boxes from Dabi and flipped open the lid. He was kind of hoping to find a bomb inside, if just to prove he didn’t order the damn things. Instead he found an extra large pepperoni with mushrooms.</p>\n<p> </p>\n<p><b>“Good Luck with your attack on the Training Camp :)” </b>Was written on the underside of the lid.</p>\n<p> </p>\n<p>“Hey!” Toga protested. “I wanted a slice from that one!”</p>\n<p> </p>\n<p>—</p>\n<p> </p>\n<p>There’s a sign. It’s bright, yellow, and wasn’t there when they scouted the coordinates for the place.</p>\n<p> </p>\n<p><b>“WARNING! LANDMINES!”</b> It says it big black letters.</p>\n<p> </p>\n<p>There’s a picture too. It shows a stick figure flying through the air in pieces. The stick figure has a bunch of severed hands attached to its body.</p>\n<p> </p>\n<p>“I think they may be expecting us,” Dabi suggested.</p>\n<p> </p>\n<p>—</p>\n<p> </p>\n<p>“Well of course this was part of the plan!” Bakugou strained against the restraints that held him to the chair. “You think we didn’t know you planned to kidnap me and take me to your secret base where you keep all your Nomu?”</p>\n<p> </p>\n<p>“You’re bluffing,” Toga singsonged. “You don’t have a clue where you are.”</p>\n<p> </p>\n<p>Bakugou glared. “674 Kammino Ward, Yokohama. The big creepy warehouse next to the old fish packing plant. The only reason I’m still here is so that the pro-heroes have a reason to bust you. We don’t have the licensing to kick your fucking ass otherwise we’d do it ourselves.”</p>\n<p> </p>\n<p>“Umm,” Spinner interrupted by clearing his throat. He held up a little plastic baggie. “This was left on the doorstep.”</p>\n<p> </p>\n<p>Inside was a red toothbrush and a paper note that just said, “<b>Bakugou forgot this</b>.”</p>\n<p> </p>\n<p>—</p>\n<p> </p>\n<p>Midoriya had had his provisional licence for just under a day, and he was already in the hospital. In his defence, he wasn’t the person getting treated. But the little girl clinging to his costume refused to let go no matter how the nurses and doctors tried to coax her.</p>\n<p> </p>\n<p>“I was walking down the street when she ran into my legs,” Midoriya was explaining to the police officer taking his statement. “Then the building blows up. So I grabbed her and immediately fled to a safe location where we waited for first responders to arrive.”</p>\n<p> </p>\n<p>“And you don’t know where she came from or who her parents might be?”</p>\n<p> </p>\n<p>He gave a half shrug. The other arm was holding onto Eri who flinched and looked away as the nurse tried to take her blood pressure.</p>\n<p> </p>\n<p>“She said her name was Eri and that she didn’t want to go back.”</p>\n<p> </p>\n<p>The officer glanced down at Eri, and at the scars covering the arm she was holding out. The look the nurse gave him said the rest. Looks like social services would be getting involved.</p>\n<p> </p>\n<p>When all was said and done, Inko Midoriya was an official foster mother to a little girl who seemed to have no presence in any official records. While police and professional heroes poured over the remains of a burned out complex that was rapidly generating more questions than answers.</p>\n<p>The fact that Class A-1 collectively smelled like a structural fire for a week went largely unremarked upon.</p>\n<p> </p>\n<p>—</p>\n<p> </p>\n<p>Shigaraki stepped out of the portal and surveyed the group standing before him. All Might wasn’t there. Just a bunch of kids standing around gawking at him. Why wasn’t All Might here!?</p>\n<p> </p>\n<p>“YES!” One of the kids suddenly cheered. “An arch-nemesis, we’re set for life!”</p>\n<p> </p>\n<p>\n<em> What? </em>\n</p>\n<p> </p>\n<p>He must have said that out loud because the entire group turned as one to look at him.</p>\n<p> </p>\n<p>“You need an arch-nemesis if you really want to make in this industry dumbshit,” a kid with spiky blonde hair explained.  “Peaceful times without megalomaniacs running around driving up the crime-rate are bad for the industry. You think All Might would be what he is if he didn’t have All for One driving up his public image?”</p>\n<p> </p>\n<p>Confusion is swirling around in his head, and then it turns into anger. “You dare! I am not some stepping stone to advance your careers! I’m going to kill you all right now!”</p>\n<p> </p>\n<p>“Excellent, keep doing that,” another kid cheered. “We’ll be set before we’re even out of highschool!”</p>\n<p>Shinsou has always believed that if you tried your hardest you could prevail. It would never be as easy as it was for certain other people, but with sufficient effort and perseverance you could overcome the difficulties that pull you down.</p>\n<p>The entrance exam for UA however is also teaching him the value of opportunity.</p>\n<p>He doesn’t know who that green haired kid is, but he’s tearing through the testing robots like All Might through a mob of villains. He’s also leaving behind a lot of robots that are badly damaged but not quite out. </p>\n<p>It may not be very heroic to bludgeon wounded enemies to death with a piece of rebar with a concrete chunk on the end, but it’s the only chance he has. His quirk is utterly and completely useless against robots. He’s not even sure if what he’s doing even counts as points. But he’s out of options, and something that might work is better than nothing that won’t. </p>\n<p>How many points does he have? Assuming he’s actually earning any? Twenty? Thirty? He’s lost count. Thirtyish is probably closest to the mark.</p>\n<p>He passed by the shattered remains of the giant robot without a word.</p>\n<p>—</p>\n<p>He can scarcely believe it when he gets the package from UA that delivers the news he was hoping for, but never believed he’d actually get. </p>\n<p>Class 1-A is a name that triggers no alarm bells or subconscious terror. </p>\n<p>That won’t last for long.</p>\n<p>—</p>\n<p>“HOW COULD YOU GUYS DO THIS TO ME!?”</p>\n<p>“You’re lucky this is all we’re doing Grape-shit,” Bakugou growled. “I still think we should run you down with the bus after the stunt you pulled in the last loop.”</p>\n<p>“But, but…” Mineta’s eyes darted this way and that as he looked around at his classmates arrayed in front of him. “You too Kaminari?”</p>\n<p>Kaminari grimaced. “Sorry dude. But I’m with them on this one. That was not cool man.” </p>\n<p>“Look!” Izuku interrupted before Mineta could protest further. “It’s just General Education. We’re not sentencing you to hard labor in a salt mine. Prove you can behave yourself, and we’ll let you rejoin the class on the next loop. If you don’t…” he added as Mineta opened his mouth again. “Aizawa-sensei will have to get involved.”</p>\n<p>That shut him up.</p>\n<p>—</p>\n<p>If you asked Shinsou to describe the experience of being in class 1-A, he would say it was like being in a theater play.</p>\n<p>A weird one.</p>\n<p>And that he was the only one that didn’t have a script. </p>\n<p>It wasn’t as if they were ostracizing him. They were actually great people, willing to help and accept him into their groups. But he couldn’t help shake the feeling like he was in the middle of a gigantic inside joke, and that he was the only one that wasn’t in on it. </p>\n<p>“Are you sure we should be doing this?”</p>\n<p>“Hey,” Sero shrugged. “Aizawa-sensei was very clear. We can do anything we want for the class project so long as we don’t get arrested.” </p>\n<p>Shinsou raised an eyebrow.</p>\n<p>“We won’t get arrested if we don’t get caught.” Kaminari explained. “Now pass me the wire-cutters.”</p>\n<p>—</p>\n<p>“Alright,” Aizawa said from his place at the front of the class. “They’ve finished totaling up the damages.” He turned around and began writing figures on the board. “In fifth place we have Asui with just over 5,000,000 yen, in fourth we have Aoyama with 3,500,000 yen, third is Sero with 3,000,000 yen, second is Kouda with 1,500,000, and first place goes to Shinsou with…” he peered closer at the clipboard in his hand. “Who somehow managed to make it through the whole assignment without damaging anything.”</p>\n<p>A round of applause burst from the class. </p>\n<p>“How’d you do it?” someone shouted.</p>\n<p>“I hid under a car with a bunch of kids until the screaming stopped.” </p>\n<p>Aizawa checked something on his clipboard and shrugged. “Protecting bystanders. It counts.” </p>\n<p>—</p>\n<p>“We are going to jail for this.” Shinsou breathed through his mouth and tried not to panic. “They’re going to hunt us down and toss us in Tartarus where we’ll never see the light of day again.” </p>\n<p>“Shut up and shovel.” Bakugou snarled.</p>\n<p>—</p>\n<p>It’s very disconcerting to wake up in a different bed than the one you went to sleep in. Thankfully he recognizes his room at home and the bed he’s lying in is the same one he’s been sleeping on since he was five. It’s a much better alternative than say a roadside ditch, or a cot in a police holding cell.</p>\n<p>The faintly alarming part is that when he went to bed last night, it was in his room at the UA dorms. Had he been drinking or something last night? He doesn’t smell like booze or feel hungover. He does however, feel like he just escaped from being trapped in a cement mixer.</p>\n<p>Thanks to his classmates he knows exactly what that feels like.</p>\n<p>What time is it anyway? He grabs his phone and turns it on. Weird. He thought he’d gotten rid of his old phone when his parents got him a new one to celebrate him getting into UA. According to his phone it is 8:15 in the morning. It is also, according to the date, nearly half a month before the UA entrance exams.</p>\n<p>That can’t be right. </p>\n<p>He fumbles around for his new phone. He can’t find it. When he turns on his computer it shows the same date. The x-ed off boxes on the calendar on his wall corroborate this. He’s not sure what he expects when he looks out the window, but at least everything still looks normal. </p>\n<p>Except that his parents had had that dead lilac bush out front cleared away just after the sports festival at UA. </p>\n<p>“MOM! WHAT DATE IS IT?”</p>\n<p>“JUNE 16TH!”</p>\n<p>“WHAT YEAR?”</p>\n<p>“2235! WHY?”</p>\n<p>“WEIRD DREAM! THREW ME OFF!”</p>\n<p>He’s panicking now. What the hell is going on? He grabs his phone and flips open the contacts. Of course, none of his classmates are in there, that was all on his new phone. So he dials the first number that comes to mind that he can still remember.</p>\n<p>“Hello?”</p>\n<p>“Midoriya? Is that you? What the hell is going on?”</p>\n<p>“Uh? Who is this?”</p>\n<p>“This is Midoriya Izuku right? It’s me, Shinsou. From school.”</p>\n<p>“Who? There’s no Shinsou in my class. How do you know my name?” </p>\n<p>“I… sorry, I must have the wrong number.” </p>\n<p>He hangs up and barely suppresses a scream. That was Midoriya, he recognized the voice. But Midoriya hadn’t recognized him. Panic is gnawing at the edges of his mind as he dials the only other number he remembers.</p>\n<p>“Hello?”</p>\n<p>“Yaoyorozu! It’s Shinsou, please tell me you remember me.”</p>\n<p>The scream that came out of the phone nearly deafened him. </p>\n<p>“I’m sorry!” Yaoyorozu sounds nearly as panicked as him. “But, Shinsou? That’s really you? What’s going on?”</p>\n<p>“That’s what I was going to ask you! What’s happening!? The last thing I remember is going to bed in the dorms and when I woke up the next morning I’m back at home, and my phone is saying I’ve gone back in time, and I already called Midoriya and he didn’t recognize me!”</p>\n<p>“It’s a time loop!” Yaoyorozu hastily explained. “We’ve been repeating our first year. But, it’s always been… you’ve never looped with us before!” </p>\n<p>A time loop. That… actually explained a lot. The panic began to recede from his brain. “What about Midoriya? He had no idea who I was when I called him.”</p>\n<p>“We all loop back to different points,” Yaoyorozu explained. It sounded like she was calming down too. “Midoriya doesn’t come back until just before the entrance exam. We have some theories as to why that is, but nothing really concrete. Oh god. You said you called him!?”</p>\n<p>“Uh… yeah? Sorry, I was freaking out and he was the first number I could remember. Is that going to…”</p>\n<p>“No, no. You’re not going to destroy time or anything like that. Time is apparently a lot more robust that some sci-fi writers gave it credit for. It’s just that… well… Midoriya gets kind of weird when he suspects there’s something going on that he’s not aware of.”</p>\n<p>“What do you mean?”</p>\n<p>—</p>\n<p>Midoriya stared at his phone in confusion. That had been one weird call. Out of curiosity, he redialled the number. Busy signal. Interesting. </p>\n<p>He reached over and grabbed the black notebook off the nightstand. Notes and papers bulged out of its sides.</p>\n<p>-Got strange call at 8:34 June 16th<br>-Caller knew my full name<br>-Said his name was Shinsou<br>-Seemed to expect me to know who he was<br>-Said something about us being in the same class<br>-Possible connection to what happened to Kacchan?</p>\n<p>He turned on his computer and began searching the name Shinsou across various social media sites. He spared a rueful glance at his overflowing notebook. If this new development panned out he was going to need a better way of organizing his data. That big cork-board that belonged to his dad would work great for that now that he thought about it. </p>\n<p>He wondered if his mom had any red string left.</p>\n<p>—</p>\n<p>He does a lot better in the exams this time. For one, he didn’t follow in Izuku’s wake bludgeoning damaged robots to death with a piece of concrete. His quirk was still worthless against robots of course, but apparently cooperation points were a thing. </p>\n<p>It was also a new feeling to find himself a true part of the group now, instead of just this weird bystander that’s been allowed to observe them. It’s a nice kind of feeling actually.</p>\n<p>Except there’s something wrong. </p>\n<p>“So Mineta hasn’t looped?”</p>\n<p>It’s strange seeing how sudden the change is from the boy who had been following Shinsou around with a notebook and stalking his social media profiles, to the classmate he remembers from his first loop. </p>\n<p>“Question. Who’s Mineta?”</p>\n<p>“He used to be in the loop with us,” Yaoyorozu explained. “He is-was one of our classmates but he didn’t make it through the practical exam in the last loop and so got shuffled to general education.” </p>\n<p>There’s more to it than that, but Shinsou doesn’t ask. He’s kind of scared to find out. </p>\n<p>“Have I met him before? I don’t even know what he looks like.”</p>\n<p>“Small guy,” Ochako indicated waist height. “Got purple hair that forms into these balls on the top of his head. Kind of a perv too.”</p>\n<p>Oh. Him. Shinsou remembers him from from the last loop now that he thinks about it. He was always glaring at Shinsou whenever he saw him and seemed to bear some kind of grudge against him. That made sense now. </p>\n<p>“So, he hasn’t looped yet?”</p>\n<p>“No.” Izuku rubbed the back of his head. “He didn’t recognize any of us, and he should have looped already.” </p>\n<p>“Tried to grab my ass during the exam too,” Jirou hissed. “He knows better. At least he used to.” </p>\n<p>Now that he thought about it, Shinsou had also seen someone wheeled out of the exam on a stretcher with gauze stuffed in their ears.</p>\n<p>“Actually… he should have looped back about the same time you did,” Yaoyorozu added. </p>\n<p>Everyone turned to look at Shinsou.</p>\n<p>“You think I somehow took his place!?”</p>\n<p>“That makes the most sense,” Iida said. “It’s always been the entire class. When Mineta wasn’t part of the class anymore he no longer applied.”</p>\n<p>“And now that I’m part of the class, it applies to me now too?”</p>\n<p>“Well,” Izuku said. “In any case, we should probably make this formal.” He gave Shinsou a smile. “Sorry for leaving you in the dark like that. Welcome to Class 1-A.”</p>\n<p>It’s starts during the second attack of the sludge villain.</p>\n<p>It’s a quick thing. Midoriya is just turning around to follow after All Might when he catches a glimpse of Kacchan out of the corner of his eye.</p>\n<p>He has this strange expression on his face. It’s not rage, Midoriya knows that face well. It’s, well he’s not sure what it is. Neither, he suspects, does Kacchan.</p>\n<p>Then Kacchan notices he’s watching. Midoriya braces for the anger, except it doesn’t happen. Instead, he gives a small two-fingered salute.</p>\n<p>“Thanks.”</p>\n<p>That’s when Midoriya knows beyond any doubt that something is horribly wrong.</p>\n<p>—</p>\n<p>Kacchan has changed, there’s not doubt about it now. He’s still Kacchan, just Kacchan that acts like he’s on medication for rage problems. </p>\n<p>And he’s not on medication, Midoryia checked. </p>\n<p>—</p>\n<p>“Hey Deku!”</p>\n<p>The train station is crowded, packed wall to wall with commuters rushing to and from the platforms. Midoryia only barely hears his nickname being called out amongst the noise, but he does, and its enough to have his phone brought up on reflex. He doesn’t even remember snapping the picture, or even seeing the person he was photographing. But when he’s finally free of the crowd he glances down at the picture he’s taken.</p>\n<p>There’s a girl waving her hand above the heads of the crowd. Brown hair cut straight, wide brown eyes, a wide smile, and pink pads on the tips of her fingers. </p>\n<p>She’s cute. </p>\n<p>Normally his mind would be overloading just trying to process the idea that a cute girl (or any girl for that matter) would actually know who he is. But there’s a mystery to solve right now. He’s already singled out her face and is running the picture through a image sourcing app on his phone.</p>\n<p>Uraraka Ochako huh?</p>\n<p>—</p>\n<p>There’s a boy waiting outside the school for him. He has this burn scar on side of his face, and hair that’s half white and half red, split right down the middle. </p>\n<p>“I’ll be waiting for you to remember,” is all he says before turning around and walking in the direction of the train station. </p>\n<p>—</p>\n<p>The birds outside his bedroom window spell out “Hello.” </p>\n<p>Izuku is already prowling the internet for people with animal control quirks.</p>\n<p>—</p>\n<p>There’s being stalked, and then there’s being stalked by Midoriya. Despite the fact he’s been following Yaoyorozu for three hours now, writing in his notebook and muttering furiously, he still gives the impression of a stray puppy that’s decided to follow you home. Plus it's hard to feel threatened by someone whom you’ve known for years (Metaphysically) and whom you’ve learned to trust. </p>\n<p>The problem, is that he knows about her in the first place. She has studiously avoided having any contact with Midoriya before he looped back on the day of the entrance exams. He shouldn’t have any reason to follow her at all.</p>\n<p>Except he’s here, holding up a magazine trying to pretend he’s engrossed in reading it as he follows her down the street. She’s not the only one either, Iida, Jirou, Kaminari and Sero have all had Izuku either message them out of the blue or show up at their school or home. Even Aizawa-sensei had Midoriya knock on his apartment door. (He had been in the middle of catching up on his sleep, and so had answered the door with, “What do you want this time Midoriya?”)</p>\n<p>She glanced behind her through a reflection in a store window. Midoriya had ditched the magazine and was now typing something into his phone.</p>\n<p>They really needed to stop doing this. </p>\n<p>—</p>\n<p>“I know this looks crazy.”</p>\n<p>Toshinori blinked as he took in the mess of photos and notes pinned to his prodigy's wall. There was a lot of information here, arrayed in a way that brought to mind the digital layouts he had seen Tsukauchi and other members of the police force use when they were try to layout evidence and connect it with suspects and timelines.</p>\n<p>“What exactly am I looking at my boy?” he asked, his eyes darting this way and that as he tried to piece together what was going on.</p>\n<p>“There’s been strange things going on,” Izuku admitted. “Just after you saved me and Kacchan from the Sludge villian, things changed. Kacchan started acting weird, and while he swears there’s nothing wrong. I also started running into people who I had never met, but who seemed to know me, and who kept making weird references to me remembering. I managed to talk to a few of their parents and a few of them admitted that they had also changed suddenly for no apparent reason.”</p>\n<p>Yes, Toshinori could see it now. Each node of the chart was devoted to specific people, along with lists detailing who they were, important facts about them, and documenting encounters with young Midoriya. Red string highlighted connections between various people along with facts they had in common. One stand even looped around the entire board in a circle. Apparently they were all around young Midoriya’s age. Interesting. </p>\n<p>“I’ve got some theories about what’s going on, but I haven’t been able to verify any of them. … Look I know this looks crazy.”</p>\n<p>Yes, he could sort of see how young Midoriya would be worried about giving off that impression. Still, this was an impressive display of investigation. The police would welcome someone like that with open arms. If he hadn’t already chosen the boy to be his successor, he would be pushing him to consider a career in the police. More to the point…</p>\n<p>“I think you may actually be on to something here my boy.” </p>\n<p>—</p>\n<p>Kirishima had just looped back. Bakugou was already waiting on his doorstep with a game console and a bag of snacks. They had were just on the seventh round of All Star Melee when the doorbell rang. He opened the door to find Midoriya standing on the front step, clutching a notebook to his chest.</p>\n<p>“It’s a time loop isn’t it? You’re my future classmates at UA and we’re stuck in a time loop.”</p>\n<p>Whatever Kirishima was going to say was drowned out by the sound of Bakugou sucking half a granola bar into his lungs.</p>\n<p>---</p>\n<p>“Well, time to find out if this is true or I’m just crazy,” Midoriya looked down at the hair in his hand, the innocuous piece of hair that supposedly give him the chance to achieve his dream, and prove once and for all whether or not the whole time loop thing is an elaborate joke being played on him by Kacchan and a bunch of strangers.</p>\n<p>Toshinori, sitting there off to the side, can’t help but wonder the same thing. It seems insane on the surface, but he’s faced a lot of insane things during his career. Time quirks are certainly nothing new, and time looping is not impossible. </p>\n<p>Not probable, but by no means impossible. The evidence certainly points to it being real. But you can also never discount the possibility of a trick. </p>\n<p>Midoriya swallows the hair, then his face changes. At first it's this blank, kind of shocked look. Like someone had just come up to him and slapped him across the face with a fish. Then comes a look of dawning horror.</p>\n<p>“AHHHHHHHHHGGGGG! I TOLD THEM TO STOP DOING THIS!”</p>\n<p>A tactful person might describe Shoto Todoroki’s relationship with his father as complex. That is to say it was mostly antagonistic with a confusing jumble of familial feelings and expectations mixed in.</p>\n<p>On a calm day, Shoto would say he hated his father, but didn’t want him dead or anything. The problem was, was that when he looped back, it wasn’t on a calm day. It was the day his special admission to into UA went through. His father in response had dragged him out of bed in the early hours of the morning for an extra gruelling training session. </p>\n<p>So he’s never calm when he loops back. In fact he’s practically boiling over with barely suppressed anger and resentment. Sometimes he keeps his cool and avoids making a scene.</p>\n<p>Sometimes.</p>\n<p>Most of the times he lashes back with everything he has picked up during the many, many loops they have gone through. He’s even put his dad into the intensive care ward at the hospital a couple (hundred) times. </p>\n<p>He had actually been doing pretty good these last few loops. The worst he had done was cracked a few ribs. Looking back, that might have been part of the problem. The fact that the last loop hadn’t gone well had also likely contributed.</p>\n<p>In any case he’s already riled up before he even finishes opening his eyes to greet the new loop. It’s like there’s an elastic band stretched inside him that gets tighter and tighter with each grueling exercise his dad puts him through. </p>\n<p>Then they start the sparing, and that elastic band inside of him just snaps. </p>\n<p>—</p>\n<p>Midoriya Izuku probably should be in bed right now. But it's saturday night, his mom is out with her friends, and he honestly has nothing better to do. So that means another late night prowling the hero fanboards and watching videos of hero fights. He’s not expecting the doorbell to ring. His mom isn’t due back for another couple hours and she has a key. </p>\n<p>There’s a boy standing on the front step. He’s got a burn scar across half of his face and his hair is split down the middle, half white and half red. Ash and blood are smeared across his clothes and he smells like a campfire. </p>\n<p>“I just killed my dad.”</p>\n<p>—</p>\n<p>Bakugou Katsuki is in bed right now. He’s in fact in the middle of a deep sleep when his phone rings. His mind is understandably fuzzy when he grabs his phone off the nightstand and answers.</p>\n<p>“W’thefuck do you want?” </p>\n<p>“Kacchan? Hey, it’s Izuku. Do you know someone with red and white hair and a burn scar on their face?”</p>\n<p>“Huh? Fucking Half’n’half? Yeah, what’about him?” </p>\n<p>“He’s at my house. He said he just killed his dad.”</p>\n<p>“WHAT!?”</p>\n<p>---</p>\n<p>The first thing Shoto’s sleepy mind registers is that this is not his bedroom. His father would never have allowed this much All Might merchandise anywhere near his house. There’s also Bakugou standing by the bed, glaring down at him.</p>\n<p>“You really fucked things up this time Half and Half.” He snarled.</p>\n<p>“I wasn’t planning on killing…”</p>\n<p>“Not that!” Bakugou snapped. “We all figured you’d flip and murder the bastard one day. You just had to fucking go on the run and make Deku’s house the first fucking place you head.”</p>\n<p>“Why is that…” and then it clicked. “The entrance exam is still a week away.”</p>\n<p>“Ex-fucking-xactly. I had to tell Deku we were time traveling heroes using a quirk to prevent your dad from becoming a villain and destroying japan. Had to lie to his fucking mom too. She thinks your a friend of Deku’s who’s having family problems.” </p>\n<p>“What now?”</p>\n<p>“We’ve got some bloody clothes to burn,” Bakugou scoffed. “Deku’s out getting you some hair dye and Photocopier said she would be over in a bit with a disguise for you.”</p>\n<p>—</p>\n<p>His hair had been dyed black and styled so that it covered his burn scar. Yaoyorozu had given him new set of clothes that included a hoodie, a leather jacket, and a pair of loose pants, along with a wad of bills she had pulled out of her thigh. He didn’t look like Todoroki Shoto, Endevor’s prodigal son anymore.</p>\n<p>He looked kind of like Dabi actually.</p>\n<p>A large hand clamped down on his shoulder from behind and he turned to catch sight of a grinning face decorated with piercings and cosmetic skin graphs. </p>\n<p>“Hey little brother, heard you were in a bit of trouble.” Dabi’s grin was radiating the same kind of smug satisfaction you’d expect to see in a cat that had finally figured out how to open the birdcage. “Congratulations. Wish I had been there to see you crush the Bastard.” </p>\n<p>—</p>\n<p>One would have thought sharing an apartment/hideaway with Himiko Toga would involve being stabbed a lot more. He had only been stabbed once since Dabi brought him here, and that had involved a cockroach and his arm being in the way. </p>\n<p>What he also hadn’t expected was the sudden feeling of loneliness. It’s an old familiar feeling, but one he hadn’t really felt since the time loops began. Time looping had brought the class together in a way nothing else really could, and it had driven away the loneliness. He likes and trusts the people of his class like no one else in his life. Only now he’s suddenly apart from them because he decided to crush his dad under a fiery glacier.</p>\n<p>What are they doing right now anyway? It’s been ages since he’s had to wonder that.</p>\n<p>It was at that moment his phone buzzed with a message.</p>\n<p>“YOU KILLED YOUR DAD!?”</p>\n<p>Ah yes, it's the entrance exam today.</p>\n<p>—</p>\n<p>Aizawa finished up the roll call, dutifully checking off yet another absent for Todoroki before snapping the file closed.</p>\n<p>Having gotten in on special recommendation before the regular entrance exam, Todoroki Shoto was a card-carrying member of class 1-A. The fact he had yet to actually show up for a class and was wanted by the police in connected to his father being crushed under a localized glacier didn’t actually remove his name from the class roster.</p>\n<p>And if Administration had neglected to do that, he wasn’t going to bring it to their attention. </p>\n<p>“Alright,” he announced. “You guys know the drill. Pick a class president, I don’t care how you do it, etcetera etcetera. Wake me when it’s over.”</p>\n<p>He shuffled out of the class, closing the door behind him.</p>\n<p>Midoriya stood up. “Guys, I think there’s only one person in this class who deserves the honor this time.”</p>\n<p>—</p>\n<p>“What are you doing?”</p>\n<p>Shoto looked up from his tablet. “I’ve been elected class president. My classmates have been sending me everything I need to do the job.”</p>\n<p>The look Dabi gave him was impossible to describe. At least if you were Shoto. Most people would call it mildly worried. “You’re on the run from the law, and haven’t shown up for a single day of class.”</p>\n<p>“Exactly, they figure I’ll have a lot of time on my hands.”</p>\n<p>“We should have gotten you out of that house years ago.”</p>\n<p>---</p>\n<p>One thing Shoto had not expected about being on the run from the law, was how utterly boring it was. He was already starting to get a sense of why exactly his brother and Toga had joined the League of Villains. He had only been hiding out in this apartment for two weeks and already burning the world was looking appealing. </p>\n<p>He had already read all the books in the apartment, including the owners manual for the rice-cooker, had exhausted the capacity of the internet to relieve boredom two hundred loops ago, and was currently amusing himself by testing whether or not it was possible to prevent a pot of water on a stove from boiling through continued observation.</p>\n<p>Toga and Dabi for their part were waging their own fight against boredom by engaging in their 2642th round of high-speed stabscotch on the kitchen table. </p>\n<p>...and it looks like they were finished with that now.</p>\n<p>“So what should we do next?” Dabi asked as they bandaged his hand. </p>\n<p>“Let’s rob a bank.”</p>\n<p>---</p>\n<p>He had been kidding when he suggested it.</p>\n<p>---</p>\n<p>Everything was one fire. Someone was screaming about being stabbed. Burst pipes were spraying water everywhere which was not actually helping to put out the fires. </p>\n<p>It had all been going to plan right until Dabi’s piercings had set off a metal detector and Toga had responded by shanking a security guard with a ballpoint pen. </p>\n<p>Shoto created a ramp of ice, shouldered the duffle bag full of money, and ducked out the window sliding to a perfect stop safely on the ground.</p>\n<p>The heroes were already responding. No surprise, they couldn’t possibly have missed the cloud of black smoke coming from the building or the bursts of blue fire that were still erupting from the windows. It took him a while to recognize the hero waiting for him at the bottom of the ramp. Rock Roller was a minor hero with a big ego, a chip on his shoulder, and petty sense of resentment against anyone who looked like they might possibly overshadow him. That apparently included new interns who were just looking for someone to show them the ropes.</p>\n<p>“Ah you.” He said, his left side flaring with fire. “Just as we planned.”</p>\n<p>—</p>\n<p>He was being sarcastic when he said it.</p>\n<p>—</p>\n<p>“Guess what! We made the news!” </p>\n<p>It was old news to Shoto, his classmates had all sent him messages drawing his attention to the blaring headline which stated that “Maniac Teenagers” had burned down a bank in middle of central Korosantu in broad daylight. Not to mention curb stomping said teenagers had delivered to local pro-hero Rock Roller, who had responded to the emergency. </p>\n<p>“They’re even saying we might in the same league as Stain,” Toga continued, letting out an excited squeal and hugging the phone to her chest.</p>\n<p>“We’re not in the same league as Stain,” Shoto replied. An idea was forming in his head. “We can do better than him.”</p>\n<p>---</p>\n<p>It was a night of regrets for the the Turbo Hero Ingenium. They ranged in size from big ones, like the fact that he didn’t tell Tenya how proud he was of him, to small ones such as the regret that he never got around to replacing that ugly coffee table in his apartment. All of them however, centered on one key regret.</p>\n<p>That he had gone hunting for Stain alone. </p>\n<p>It had happened so fast, one moment all had been peaceful then suddenly he had been stabbed. He had turned around just in time to catch Stain licking the blood from a knife, and just like that, he couldn’t move.</p>\n<p>That had been bad enough. Then someone had called out “HEY! THAT HERO IS OURS!” And he suddenly found himself caught in a battle royale between Stain, a teenage girl with a knife, and an older boy with a flame quirk. Two of the three new villians that had been targeting heroes for the past few weeks.</p>\n<p>All he could do was lie their helpless on the ground while the three of them battled it out. If he could just shake off Stain’s quirk then maybe he had a chance. He couldn’t win this battle, but if he could escape to safety that was a victory in and of itself. At the very least he could provide some information of how Stain was defeating his victims. </p>\n<p>A pair of arms hooked under his arms and began dragging him away from the battle. He couldn’t move his neck, but he was able to flop his head in such a way he could see who was carrying him. </p>\n<p>Hello villain number three. Todoroki Shoto, Endevor’s son, who according to the media had snapped under his father’s overbearing expectations, crushed said father under a miniature glacier that still hasn’t melted, and ran off to become a villain.</p>\n<p>“Are you going to kill me now?” </p>\n<p>“No. We only go after assholes. You’re cool.” He propped Tensei up behind a dumpster and began covering him with bags of garbage. “Stain’s quirk should wear off in a couple of minutes. Try to stay hidden. Once we take care of Stain, I’ll tell them you got away. Get yourself somewhere safe as soon as we’re clear.”</p>\n<p>“You planned this.” Tensei gasped. He had to have. The lot of them being in the same place at the same time could be coincidence. But this whole dragging him off and hiding him suggested something planned. “Why?”</p>\n<p>Todoroki shrugged. “Your little brother would kill me if I didn’t.”</p>\n<p>---</p>\n<p>Even after all the loops he’s gone through, Shoto has still hasn’t figured out what to think about his mom. Like his dad, his relationship is complicated to say the least. But at least he’s never had the overwhelming urge to crush her with a glacier. </p>\n<p>He’s also never visited his mom with his older brother either.</p>\n<p>“You’ve dyed your hair, both of you.” Their mom is looking between the two of them, probably trying to digest how much they’ve changed since she last saw them. “I like it.” It made them look less like their dad after all. “What’s been happening with you two?”</p>\n<p>Right, Mom didn’t watch the news did she. “They’re going well,” he answered. “I’ve been elected class president.”</p>\n<p>“That’s wonderful Shoto. What about you dear?” she asked, turning towards Dabi. </p>\n<p>“Well…”</p>\n<p>It was at that moment the door burst open and Toga ran into the room. She had a scalpel in one hand and blood splattered across the nurses uniform she was wearing. </p>\n<p>“I just made a new friend!” </p>\n<p>“Sorry Mom,” Dabi said, getting up from his chair. “We need to leave now.”</p>\n<p>They bolted for the window as the sounds of police sirens started to become audible.</p>\n<p>—</p>\n<p>“Alright you little shithead kid. Who the fuck are you, and what the fuck did you do to our boss?” </p>\n<p>It was hard to tell with the plague doctor mask over his face but Shoto suspects Shin Namoto is extremely pissed off at him. Even more so than he would normally be if he had just discovered Eri was missing and there was some strange teenager trying to sneak out of their secured compound. </p>\n<p>He shrugged. “I’m a time traveling hero from the future. We’ve replaced your boss with a shapeshifting teenage serial killer and intend to drive your organization into the ground before my compatriots get bored and decide to wipe you off the map.” He shrugged. “We’ve had a lot of practice.” </p>\n<p>It's hard to read expressions with the plague doctor mask, but Shin has gone quiet. </p>\n<p>“What can I say, its the truth.” </p>\n<p>—</p>\n<p>There’s the kind of awkward when a good friend walks in on you when your in the middle of doing something illegal. </p>\n<p>“Ummmmm…”</p>\n<p>And then there was the kind of awkward when said best friend was also in the middle of something completely unrelated, but equally illegal. </p>\n<p>“Vigilantism again Izuku?”</p>\n<p>Izuku gave a nervous laugh and adjusted his grip on the villain her was currently throttling. “Armed robbery Shoto?”</p>\n<p>“It pays the bills,” Shoto shrugged. “I didn’t see you if you didn’t see us?”</p>\n<p>“Sounds fair,” Izuku replied. He gave the villain one last squeeze, to make sure he was unconscious. “See you later.” Then he was gone in a green blur. </p>\n<p>“Who the hell was that?” Dabi asked, hefting his bag of money over his shoulder. </p>\n<p>“He’s like All Might, only worse.” Shoto replied. “We’re better off not messing with him.”</p>\n<p>“Is he one of the people time-traveling with you then?” Toga asked.</p>\n<p>Kurogiri is not one of those villains that seek the spotlight. He actively avoids it if he can. Notoriety is all well and good, but the brighter you shine, the more the cops look your way. The cops can’t target you if they don’t know you exist, and he’s been careful about there being nothing to link the villain Kurogiri to his more mundane identity.</p>\n<p>That’s why it's a very unwelcome surprise when he gets an email, and it’s not from All for One. He doesn’t know who its from, the names are not familiar and probably fake in any case. </p>\n<p>And they definitely know who he is. They want to hire him and his quirk for a mission. They apparently want him to rescue this little girl from a high security facility. (Which he knows basically means they want to kidnap someone’s daughter/niece/little-sister to use as leverage.) They even have the exact coordinates he needs for his quirk, a list of the best times for him to find her alone, the promise that he will never have to worry that the cops will bust his bar (which he doesn’t believe), along with the assurance that it will only take about five minutes and he won’t have to listen to Shigaraki rant about how the latest boss in his game is a cheapass little bitch. </p>\n<p>It’s likely a trap, is probably far more than it appears, and is definitely a bad idea.</p>\n<p>His eyes darted over to where Shigaraki is parked in front of the TV, a game controller in his hand, swearing and cursing at the characters on the screen. </p>\n<p>But goddamnit did they make a persuasive argument. </p>\n<p>---</p>\n<p>For Eri, hope is black mist and a dark portal opening up in her room.</p>\n<p>---</p>\n<p>There’s two fourteen year old girls waiting for him when he gets to the meeting place. (A fenced off construction site.) One of them greets Eri by name, introduces herself as Ochako, then gives her a blanket and a candy apple before leading her off somewhere. Obviously she was chosen someone non-threatening to keep the girl from freaking out and making a scene. The other girl, a small thing with what appears to be audio-jacks dangling from her earlobes couldn’t quite be explained off in the same way. </p>\n<p>She, to Kurogiri’s surprise, produced a wad of bills. “Here’s your payment as promised.”</p>\n<p>Kurogiri quickly counted the money, everything he had been promised indeed. Well except… “How do you propose to make it so I will never have to worry about the cops raiding my bar?”</p>\n<p>“Oh that’s easy, now that we’ve wiped out the League of Villains there’s nothing to really draw attention to your place. Don’t worry,” she added. “We made sure Shigaraki had left your bar before we thrashed him.” </p>\n<p>… What? … </p>\n<p>It was at that moment the earth shook. Kurogiri first thought it was an earthquake, then he saw the pillar of fire mushrooming into the sky in the vague direction of Yokohama. </p>\n<p>The girl nodded grimly. “You can never be too careful with All for One. Overkill is usually the best policy. If that doesn’t finish him off we’ll have to send in Midoriya.”</p>\n<p>---</p>\n<p>It’s not often the home phone in the Todoroki house rings, and the callers can usually be divided neatly up into three categories, people looking to reach either Endevor of Fuyumi for work reasons, telemarketers, and fans of Endevor who somehow got their hands on their phone number. So Fuyumi has no reason to expect anything different when the phone rings and she goes to answer it.</p>\n<p>“Hello?”</p>\n<p>“Hello.” The caller on the other end is a woman, though Fuyumi doesn’t recognize the voice. “Is this the Todoroki household?”</p>\n<p>Probably not a fan then. Something for work? “Yes this is the Todoroki residence.”</p>\n<p>“Am I speaking to Shoto’s mom?”</p>\n<p>What? “Ah, no, I’m Shoto’s big sister.”</p>\n<p>“Oh… can I speak to your mother then?”</p>\n<p>The only people who would ask about their mother are people who already know she can’t be reached here. “She’s ummm, not living with us right now. She’s been er… sick for a while.” </p>\n<p>“OH! I’m sorry! Can I speak to your father then?” </p>\n<p>Does this woman not know who their father is? “He’s also not here. He ummm, had an accident and is in the hospital right now.” An accident that involved lots of ice, fire and falling down a flight of punches. </p>\n<p>“Ahh… well… maybe you can still help me. Have you noticed your little brother undergo any kind of strange or sudden change in personality lately? Like within the last year or so?” </p>\n<p>Well he suddenly snapped and sent our father to the hospital after giving him frostbite and breaking every bone in his body. But we all figured that was…</p>\n<p>“What about new friends? Is he suddenly best friends with people who had been complete strangers a month ago?”</p>\n<p>“Well… Shoto has never really had any friends…” Father wouldn’t let him. Except… there had been that Uraraka girl stopping by after Shoto put their father in the hospital. She had said she was an online friend of Shoto’s. Shoto had also mentioned he was meeting up with someone named Midoriya whom she had never heard before…</p>\n<p>“Is he suddenly busy with some kind of project or plan and gets evasive when you ask him what he’s doing?” </p>\n<p>“No. Well… except…”</p>\n<p> It had been the middle of the night, she had woken up needing to use the bathroom. Shoto had been half out of the window, dressed all in black, a sword sheathed at his hip and a bandoleer of what looked like grenades strapped across his chest.</p>\n<p>“There’s a raccoon in the garbage.” Had been his explanation.</p>\n<p>“Look, you’re not the only one who's had something like this happen to someone they love. A group of us are going to be meeting this friday to talk about it. You’re welcome to join us.”</p>\n<p>“Well…”</p>\n<p>“We’ve rented a room at the Mustafu community center. Just ask for Midoriya's group. We’ll have cookies.”</p>\n<p>---</p>\n<p>“Right, so that’s Stain, Overhaul, that woman with the tentacles, Kill Smasher, those Neo Stain guys, that mailman with the razor-paper quirk, and of course the near-entirety of the League of Villains.” Izuku looked up from his notebook. “I think that’s everyone now.”</p>\n<p>Preemptive total annihilation was not considered a practical crime prevention method. (Or even a sane one for that matter.) But if that’s what it took to have a normal school year, than that’s what they were going to do. Plus Kurogiri’s bar made a good place to meet up away from the prying eyes of parents, teachers, police officers, and intelligence agents who all asked stupid questions. Kurogiri for his part just gave them a key to the back door, let them use one of the upstairs rooms, and told them he didn’t want to know what they were up to, just don’t break anything. </p>\n<p>“Right,” Izuku continued. “Now that they’re all taken care of we can move onto more important things. Any ideas on what we want to do for the cultural festival this loop?”</p>\n<p>---</p>\n<p>There really was cookies. Fuyumi nibbled on a gingersnap shaped like All Might, as she listened to Kirishima’s dad speak.</p>\n<p>“And then one day he dyes his hair red, and before the dye has even dried there’s this kid I have never seen before in my life knocking on the door saying he’s Eijiro’s friend, and Eijiro is greets him like they’ve been buddies for years.”</p>\n<p>“And after that,” Kirishima’s father added. “He starts coming home in the middle of the night smelling like smoke and suddenly knows how to pick locks.” He ran a hand through his black hair. “Its not manly to dump our problems onto strangers, but we have no idea what to do here.” </p>\n<p>“Don’t worry. We’re all going through the same thing,” Midoriya’s mother said, patting Kirishima’s dad on the arm. “We’re all in this together.”</p>\n<p>---</p>\n<p>It’s not that Izuku dislikes Mei. She’s a very skilled support technician, and her devices are usually extremely useful. But she also a bit of a loose cannon with no regard for personal boundaries.</p>\n<p>But she also doesn’t ask stupid questions. Like, ‘why do you need twenty sets of motorized climbing equipment and a microwave receiver?’ </p>\n<p>“Ummm… excuse me. You’re Hatsume Mei right?” </p>\n<p>“Sorry,” Mei said, brushing past him. “I don’t have time to talk. I have work to do.”</p>\n<p>“WAIT! We want to commission some things from you. Form T2 things!” </p>\n<p>Mei froze in mid-step. There was this awed kind of manic gleam in her eyes as she turned towards Izuku. </p>\n<p>“I always knew time travelers would come looking for my services! What do you need?”</p>\n<p>—</p>\n<p>“Those class 1-A bastards are up to something.” </p>\n<p>It had only been a week, and already Class 1-B had collectively learned to tune out most of what Monoma said if it involved Class 1-A, the government, organized religion, and the overuse of turnips in the cafeteria lunch menu. </p>\n<p>But he also kind of had a point this time. </p>\n<p>Class 1-A was definitely up to something. They had all started wearing dark glasses and small ear-sets. They had also started started standing around either watching people, or pointing strange instruments with microphones at the windows of various classrooms. </p>\n<p>“They’re watching us right now too,” Ibara added, gesturing to a table in the far corner of the cafeteria. Everyone turned to the direction she indicated. </p>\n<p>Five sets of newspapers snapped up to cover faces. Which did nothing to encourage the kids of Class 1-B. </p>\n<p>They could all see the eye holes cut into them after all.</p>\n<p>—</p>\n<p>“And then he starts showing me all these outfits for little girls, and asking what I thought of them.” Present Mic explained. “They were all hideous of course, but when I asked him why he needed to know, he said his niece was staying with him and she was going to need new clothes. He doesn’t even have siblings, let alone a niece! I mean, I don’t think it's anything nefarious, he’s done stuff like this before when he got jobs from Witness Protection. But, there’s so many other things going on. He’s seemingly ignoring his class, not that they need it, they’re acing all their other classes, and he’s doing his other classes like normal, but its very out of character for him. I mean, I can sort of see Eri taking up some of his time, he already doesn’t get enough sleep…”</p>\n<p>“Wait,” Inko interrupted. “Is Eri about six years old, has stark white hair and a single bronze horn poking out of her forehead about here?” She gestured to the side of her head.</p>\n<p>“Yeah, that’s exactly her,” Mic exclaimed. “You know her?”</p>\n<p>“Well, not exactly,” Inko explained. “I got home early one day and Izuku was in the kitchen with this little girl showing her how to make candy apples. He said her name was Eri and he was doing a Big Brothers and Sisters program through the school.”</p>\n<p>“We had something similar happen,” Jirou’s mom added. “Our daughter brought home this little girl one day and started teaching her how to play guitar. When we asked she said she was a little sister of one of her classmates. None of your have a little girl like that right?” </p>\n<p>Everyone in the room shook their head.</p>\n<p>---</p>\n<p>It had been a normal for class 1-B. Then Jirou fell through the ceiling. </p>\n<p>Vlad King had nearly attacked her until he realized who she was. He almost did, even then. Jirou wasn’t wearing her school uniform. Instead she had on a plain black suit, along with the dark glasses and ear-pieces Class 1-A had taken to wearing. She was also surrounded by bits of ceiling tile and, where those listening devices? </p>\n<p>Jirou climbed to her feet, brushed pieces of ceiling tile off her clothes, then grabbed the listening device.</p>\n<p>“Your pipes need fixing.”</p>\n<p>Then she just left.</p>\n<p>---</p>\n<p>“We’re worried about Class 1-A.” </p>\n<p>Nedzu looked up from his paperwork at the teachers assembled in front of his desk. “What brought this on?”</p>\n<p>“They’re up to something. They’re not even trying to hide it. They’re even baiting everyone about it.” Vald King said. “Monoma is literally frothing at the mouth trying to figure out what it is.”</p>\n<p>“Not to mention that I have a major suspicion none of them are doing any schoolwork. And Aizawa is letting them get away with it.” Midnight added.</p>\n<p>“They’re passing the tests.” Nedzu pointed out. “And getting all their assignments done.”</p>\n<p>“And they shouldn’t be.They’re treating every assignment they get like they already know the perfect solution ahead of time. I would suspect cheating except I cheating to this degree would involve far more resources and time than any group of persons in this entire school have.” </p>\n<p>“Well time travelers like them have no shortage of time,” Nedzu mussed. “But I think this case is more a matter of continued repetition and practice rather than any attempt to subvert the system. Unavoidable really.” </p>\n<p>He took in the teachers gobsmacked looks.</p>\n<p>“Right. Keep forgetting that’s not obvious to most people.” </p>\n<p>—</p>\n<p>“So when Katsuki gets home he immediately heads to the fridge, and eats the last of the yogurt.” Bakugou Masaru explained. “Then Mitsuki comes in and they get into an argument about consideration for other people in the house, eating food before it goes bad, and putting labels on things. While they are arguing, Katsuki’s friends rush into the house, up the stairs, and begin hauling things out of Katsuki’s room. I counted at least three large crates, a potted plant, a steel table, and a large rolled up carpet. Not to mention several duffle bags they kept bringing back in and reloading. They just finish hauling the last item out when Katsuki yells ‘FINE I WON’T TOUCH THE FUCKING YOGURT!’ and storms out of the door after them.”</p>\n<p>“That little shit,” Mitsuki muttered.</p>\n<p>---</p>\n<p>It had been a whim. Gentle would admit that. Breaking into a highschool cultural festival was hardly the sort of feat that would burn his name into the annals of history. But a part of him had always wanted to see the inside of the UA campus for himself. Plus their media ratings had been on a downward trend lately. They could do another video of them robbing a convenience store, or they could mix it up a little. </p>\n<p>La Brava had hacked into UA’s network and made them both fake guest passes. Those had gotten them through the gate. Once that was done, everyone apparently assumed that if they were there, then they must have clearance. Gentle suspected that as long as he didn’t draw too much attention to himself, like say, by going up to one of the many famous heroes around and asking for an interview, they would probably leave him alone. </p>\n<p>Besides, this was actually turning out to be kind of fun.</p>\n<p>“I can’t believe they don’t have candy apples here.” La Brava complained, panning the camera around to show more of the festival.</p>\n<p>“Most disgraceful,” Gentle agreed. “What should we attend to next?”</p>\n<p>“Well, Class 1-A has got a booth nearby,” La Brava replied, pointing to a small map tacked to a post. “Apparently it’s some kind of fortune… telling… booth.” </p>\n<p>The trio of black vans parked in the spot did not look like a fortune-teller booth. They looked like a shady government stakeout. An image not helped by the array of antennas and radio dishes bolted to the roof of one of them, or the students standing around in black suits and sunglasses casting suspicious looks at everyone. Blocky white letters on the side of one van just said “Fortunes.”</p>\n<p>“It’s spy themed apparently.” Gentle remarked.</p>\n<p>---</p>\n<p>“So you 1-A Bastards think your so great just because you fit fluorescent lights and a two-way mirror into a van?” Monoma sneered.</p>\n<p>On the other side of the steel table, Ashido remained silent. She just held out her hand and accepted the folder Iida handed to her. </p>\n<p>“You think your so high and mighty with your listening devices and secret code words. But we’re on to you! You won’t get the better of us.”</p>\n<p>“Did you say that when you wet the bed during that overnight class-trip when you were seven?” </p>\n<p>Monoma’s mouth snapped shut. </p>\n<p>“What about when you put that baseball through Old Lady Tokomori’s window? You never did tell your parents about that did you?”</p>\n<p>“How did you know…?”</p>\n<p>Mina smiled. “We know everything about you Neito Monoma.”</p>\n<p>---</p>\n<p>Izuku had to give Yaoyorozu credit, she had done an excellent job on Eri’s little suit and dark glasses. Eri wasn’t in on the joke of course, but she had been happy enough to copy what her adopted older siblings were doing, and more importantly she was having fun.</p>\n<p>At the moment they were sitting at a picnic table and Eri was nibbling on the candy apple he had brought for her. The booth was turning out to be surprisingly popular, and there was even a line. Actually, now that he looked, that line hadn’t moved in fifteen minutes. </p>\n<p>What was Mina doing in there?</p>\n<p>---</p>\n<p>“We knew what you were doing from the moment you started doing it.” Mina said. “The only difference is whether or not you’ll confess or not. Believe me, you will regret it if you make things difficult for us.”</p>\n<p>“I confess!” Monoma shrieked, huddling in his uncomfortable steel chair. He had absolutely no idea what he was confessing to.</p>\n<p>Neither did Mina.</p>\n<p>---</p>\n<p>“Well, the festival was apparently a success,” Sero said as they all sat down at the lunch table. “At least two-thirds of the school is now jittery in our presence, and at least half are convinced we actually do work for a secret world conspiracy.” </p>\n<p>Now that the festival was over, they had ditched the dark glasses and the whole charade of pretending they hadn’t already gathered all the information they needed two whole loops ago. It was back to being normal students for them.</p>\n<p>For some reason that just made people even more uneasy.</p>\n<p>“So what do you guys have planned for the rest of the school year. I was just planning of laying back and relaxing for…”</p>\n<p>A great primeval roar suddenly erupted from the direction of the ocean with enough force to make the entire building shake.</p>\n<p>“Fucking Mother of Monsters,” Bakugou growled.</p>\n<p>“I knew we forgot someone,” Izuku groaned.</p>\n<p>---</p>\n<p>“Hi Mom!” Izuku burst into the house and raced up the stairs to him room, not even bothering to wait for his mom’s reply.</p>\n<p>Mother of Monsters, of all the villain groups they had forgotten to wipe up before the school year started, it had to be the nutbar terrorists who were trying to distinguish themselves by raising gigantic sea-life with powerful and unusual quirks. In their defence they had only really had to deal with Mother of Monsters twice before. Usually the group was stomped down by larger and more powerful groups like the Eight Precepts or the League of Villains. Or was busted by the cops in the wake of the increased security put in place by escalating villain attacks. </p>\n<p>Regardless, they were still a dangerous group to deal with, especially when they got the chance to raise one of their monsters to full adulthood. No taking chances. </p>\n<p>Izuku stuffed two bandoliers of syringe darts into his bag, along with an extra large bottle of monsters tranqs. That was immediately followed by the first aid kit, the emergency surgery kit, and the ‘we’ll sew you back together later’ kit. There was also the rocket-propelled grenades, the bundle of flower crowns, and the cage full of mice.</p>\n<p>He also grabbed The Leveler from its spot on his dresser and flicked it on. Red warning lights lit up along its length, the clear tube in the middle started to glow green, and it let out an ominous humming sound. Hopefully they wouldn’t have to demonstrate to Mei that it was aptly named.</p>\n<p>He raced back down the stairs. His mom was sitting in the living room with Kacchan’s parents, as well as Kirishima’s dads, Mina’s mom, Kouta’s ma and pop, and… the parents or guardians of everyone in his class. Even Present Mic was seating in one of the living room’s more comfortable chairs.</p>\n<p>“What’s going on?”</p>\n<p>“Oh the community center is closed for renovations,” his mom explained. “So we’re having our parent support group here instead.”</p>\n<p>\n<i>Parent support group?</i>\n</p>\n<p>He was just about to ask with another primeval roar reverberated across the city.</p>\n<p>“Sorry mom, have to run. School business! Bye!”</p>\n<p>He could ask after they’d dealt with the attack of the twenty meter sea-cucumber.</p>"
}