{
  "id": "15397608",
  "url": "https://archiveofourown.org/works/15397608?view_full_work=true",
  "author": [
    "crime_fighting_spiderling"
  ],
  "title": "Kissin’ Dynamite",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "F/M",
    "Gen"
  ],
  "fandoms": [
    "Marvel Cinematic Universe",
    "The Avengers (Marvel Movies)",
    "Spider-Man: Homecoming (2017)",
    "Iron Man (Movies)"
  ],
  "relationships": [
    "Peter Parker & Tony Stark",
    "May Parker (Spider-Man) & Peter Parker",
    "May Parker (Spider-Man) & Tony Stark",
    "Pepper Potts/Tony Stark",
    "Michelle Jones/Peter Parker",
    "Peter Parker & Avengers Team",
    "Ned Leeds & Peter Parker",
    "Michelle Jones & Ned Leeds & Peter Parker",
    "Michelle Jones & Peter Parker",
    "Michelle Jones & Ned Leeds",
    "Peter Parker & Shuri"
  ],
  "characters": [
    "Peter Parker",
    "Tony Stark",
    "Michelle Jones",
    "Ned Leeds",
    "Flash Thompson",
    "May Parker (Spider-Man)",
    "Steve Rogers",
    "Sam Wilson (Marvel)",
    "James \"Bucky\" Barnes",
    "James \"Rhodey\" Rhodes",
    "Clint Barton",
    "Bruce Banner",
    "Natasha Romanov (Marvel)",
    "Wanda Maximoff",
    "Pepper Potts",
    "Thor (Marvel)",
    "Loki (Marvel)",
    "Shuri (Marvel)",
    "T'Challa (Marvel)"
  ],
  "additional_tags": [
    "Parent Tony Stark",
    "Iron-Dad",
    "Spider-son",
    "Tony Stark Acting as Peter Parker's Parental Figure",
    "Peter Parker Has a Family",
    "Precious Peter Parker",
    "Protective Tony Stark",
    "Tony Stark Has A Heart",
    "Tony Stark Does What He Wants",
    "Post-Spider-Man: Homecoming",
    "Domestic Avengers",
    "Avengers Family",
    "Protective Avengers",
    "BAMF Michelle Jones",
    "Field Trip"
  ],
  "language": "English",
  "series": "",
  "published": "2018-07-23",
  "completed": "2018-09-09",
  "words": "27,591",
  "chapters": "9/9",
  "comments": "737",
  "kudos": "11,605",
  "bookmarks": "1,645",
  "hits": "240,344",
  "summary": "<p>“Maybe I shouldn’t go.” Peter spoke. MJ shoved a permission slip into his hand at his comment.</p>\n<p>“You’re going.” She simply stated.</p>\n<p>Where Peter and his class go on a field trip to Stark Tower.</p>",
  "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>Hello all! I got a little carried away with MJ in this chapter. I hope you liked it!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>I wasn’t as satisfied with this chapter as the last one. Oh well :/</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>The comments you guys are giving me are amazing!! I love all of the support!!</p>\n<p>Heads up: the second scene is a flashback</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">more notes</a>.)\n</p>\n<p>Hey guys!! That was my first attempt at writing Shuri, so I hope I did alright. I also hope the meme stuff was ok. Let me know what you guys want to see later on in this fic!!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">notes</a>.)\n</p>\n<p>Special thanks to all the people giving me feedback!! I love hearing your thoughts and it keeps me motivated! This chapter was later than I wanted it to be, but I won’t be as busy for the rest of the time this story is being written. I plan on posting every two or three days. Let me know what you guys want to see as this fic nears the end!!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">notes</a>.)\n</p>\n<p>I had a blast writing the scene with Sam and Clint! I’ve had the boomerang arrows and stolen sandwich idea for a while now, so I was really excited to finally write it! We’re nearing the end of this fic, so tell me what you guys want to see before it ends!</p>\n<p>Oh my goodness, it’s been so long since I last updated. I am so sorry guys. I’ve been very busy the last few days, and I just recently found time to write, so that’s why the chapter came so late. My apologies!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_8_endnotes\">more notes</a>.)\n</p>\n<p>Only one chapter left! I hope this went how you guys hoped it would!</p>\n<p>Hello everyone!! So sorry for the late update, I was totally not prepared for classes to start again. Due to my lateness, I decided to make this chapter extra long for you guys, it’s over 5,500 words! Also, I wanted to thank everybody who read this story, and left kudos and comments!! You guys helped me finish this fic! Enjoy the last chapter!!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_9_endnotes\">more notes</a>.)\n</p>\n<p>That’s a wrap! I hope this turned out the way you guys wanted it to. I now have a wattpad account for those of you who are on that website. My username is crime_spiderling. Also, I thought I’d let you guys know that I’ll be writing a series of one shots and short stories based around Peter, for any of you that are interested in reading it. I’m not sure when I’ll put it up, but be on the lookout!! I’ll hopefully be updating it weekly. Thank you everybody for reading!!</p>\n<p>Hello all! This is my first fanfic so I’d really appreciate any comments!</p>",
  "text": "<p>Peter knew he was on the brink of sleep. The cloudiness was blocking most of his enhanced senses as well as his thought process. It was keeping him from thinking so much, that he was practically unaware he was aware of these things.</p>\n<p>A sharp and annoying noise kept penetrating the silence. Peter could tell it was a voice, but he couldn’t decipher it. Maybe it was because he didn’t want to in the first place.</p>\n<p>Sometimes it would briefly stop, and Peter would have a moment of peace. But it would always continue right afterwards. The boy willed it to stop, it may have been one of the most annoying sounds Peter had ever heard.</p>\n<p>As the voice continued on, the cloudiness in Peter’s mind slowly seeped away. Peter finally registered all the information he’d been missing in his near sleep.</p>\n<p>That was Mr. Larson’s voice. Oh yeah, that meant he was in chemistry class. This class was so much fun, considering Peter’s conscious state. He tried to fall back asleep as Mr. Larson droned on about something Doctor Banner had taught him a month ago when he was at the tower.</p>\n<p>A few minutes later he could feel Ned nudging him. Peter mentally moaned but didn’t ignore Ned, despite how much he just wanted to go back to sleep.</p>\n<p>“Peter, you should probably take these notes, Mr. Larson said that it’ll definitely be on the test.” Ned informed him. “Also, we have homework on this.”</p>\n<p>“I can do this stuff in my sleep, what good would the notes be?” Came Peter’s stubborn reply. He went back to resting his head on his head so he could rest.</p>\n<p>MJ’s snicker interrupted his attempt. “Well you’re practically asleep now, so if you can do it in your sleep as you claim to be able to, then be a good boy and get the homework done now.”</p>\n<p>Peter opened his mouth to protest, but stopped before words came out. It generally wasn’t the best idea to go against MJ. He grumpily picked up his pencil and lazily worked on the homework.</p>\n<p>“There you go, you hobbledehoy.” MJ teased him.</p>\n<p>Peter and Ned both gave her strange looks. “What’s that supposed to mean?” Peter asked her.</p>\n<p>“Wow, you guys are seriously uneducated. It means you’re awkward and gawky, loser.” The girl explained. Peter gave her an offended expression.</p>\n<p>“Ooh, she got you there.” Ned told him. Peter huffed, deciding to ignore the two for the rest of class.</p>\n<p>Peter noticed MJ reading a new book, which she was already halfway through, and a blank homework packet lying on her desk. He was slightly frustrated at her for being hypocritical, but decided not to mention it to her.</p>\n<p> — — —</p>\n<p>The bell had finally signaled the end of class, but Mr. Larson told everyone stay in their seats. It was supposedly for an “important announcement”. There were several moans and protests, including one from Peter.</p>\n<p>“Next Wednesday our class will have the opportunity to go to Stark Tower!” Mr. Larson announced. With that, the class erupted in excitement, everyone except for Peter and MJ. </p>\n<p>Ned was still bouncing on his feet, even though he’d already been a few times. MJ hadn’t been before, but then again, she also hadn’t wanted to see the Washington Monument on their trip to DC. Peter slept there on the weekends, so for him, he was mostly feeling dread.</p>\n<p>“Information on what we’ll be touring is on the website for Stark Industries, and I’ll give you all more information closer to Wednesday. The permission slips are on my desk.” Their teacher added on.</p>\n<p>As soon as he said where the permission slips were, most of the class raced over to the desk. It was a mess by the time the three friends got there.</p>\n<p>“Maybe I shouldn’t go.” Peter spoke. MJ shoved a permission slip into his hand at his comment.</p>\n<p>“You’re going.” She simply stated.</p>\n<p>“Well, he has been there a ton of times - ” Ned protested in Peter’s favor, only to get cut off by their female counterpart.</p>\n<p>“He’s going.” She stated again, leaving no room for discussion. MJ quickly left the room, a book in hand.</p>\n<p>“I guess I’m going.” Peter said to Ned. He was not excited to bring this up to May. She would definitely make him go, and she’d probably find it funny that they were going on a field trip to the tower.</p>\n<p>The two boys left the room into the hallway. Their last class of the day was gym. Both Peter and Ned hated it. The class was pointless and took up one of their elective spots. Peter recently decided that he didn’t need the exercise considering what he does in his spare time.</p>\n<p>“Hey Penis!” Flash shouted from down the hall, “What are you going to do when your lies are exposed?” He teased, a smirk on his face.</p>\n<p>“Leave me alone Flash.” Peter told him, knowing that it wouldn’t work.</p>\n<p>“Nobody believes that you actually work for Tony Stark. Only your oaf of a friend here does.” Flash continued.</p>\n<p>Anger filled Peter at that comment. He wanted to answer back, but Ned intervened. “Let’s just get to class Peter.” He said, speeding up their pace towards the gym.</p>\n<p> — — —</p>\n<p>“So Peter,” May started. They were at the table in their apartment. May had come back from Delmar’s to pick up some subs for them to eat. “Tell me about this field trip you’re going on.”</p>\n<p>Peter stopped chewing for a moment. He was surprised that she already knew about it.</p>\n<p>“How’d you find out about that?” He asked her.</p>\n<p>“MJ called me earlier, saying something about making sure I sign the slip and stuff.” She told him.</p>\n<p>“Oh.” Peter said, wondering if the two talked often. He wouldn’t be surprised. “We’re going to Stark Tower.”</p>\n<p>May laughed. “And you didn’t want to go?”</p>\n<p>“Not for a class trip!” Peter told her. “If Mr. Stark finds out, he’ll just embarrass me!”</p>\n<p>“That does seem like something he would do, doesn’t it.” May responded.</p>\n<p> — — —</p>\n<p>“Boss, May Parker is calling you.” Tony Stark’s AI informed him.</p>\n<p>“Put me on, Friday.” He instructed her. He was currently in his lab at the compound, working on installing another parachute into Peter’s suit. “How’s it going May?”</p>\n<p>“Pretty good, actually.” She began. “Apparently Peter is going on a field trip to your tower on Wednesday.”</p>\n<p>A smirk formed on Tony’s face. “Is he now?” He asked rhetorically. That would be a lot of fun. The kid was really easy to play with.</p>\n<p>May almost seemed to be reading his mind. “Don’t embarrass him too much, Tony. I’m the one he’ll come home and complain about the trip to.” She reminded him.</p>\n<p>He supposed he didn’t have to do it too much, he thought with a frown. But there were plenty of others who could, and most of them were at the compound with him. The opportunity was too good to pass.</p>\n<p>“I’ll keep that in mind.” He told her, not really sure if he would do it or not. May hung up afterwards.</p>\n<p>Tony quickly finished installing the parachute in the suit. He went to the common floor where the most of the Avengers were relaxing. Steve was sketching in his old WWII notebook, with Sam and Bucky quarreling near him. Wanda and Nat were watching a movie, with a blanket wrapped around the two of them. Clint was sitting on the counter, shoving the cookies that Pepper made that morning into his mouth. Tony knew that Scott was off with his family somewhere, and Bruce was in his lab. Rhodey would be back within the next few hours.</p>\n<p>“Our Spider-Kid is having a field trip at the tower on Wednesday.” Tony announced to the team. All the faces in the room turned towards him. “We’re going to spend the day there.” The billionaire added, smiling mischievously.</p>\n<p>“Maybe we shouldn’t, Tony. You wouldn’t want to embarrass Peter in front of his class.” The Capsicle suggested.</p>\n<p>“But I do.” Tony corrected the super soldier.</p>\n<p>Clint seemed to really like his idea. The size of his smirk was unreal. “We’ll give him one heck of a field trip.” He said.</p>\n<p>The weekend before the field trip had come and gone, and Peter was feeling slightly better about going. He’d checked with Mr. Stark, and none of the Avengers would be at the tower on Wednesday. They would all be at the compound training because they would have a mission the following week.</p>\n<p>Mr. Stark didn’t mention his field trip, so he was assuming that his mentor didn’t know about it. That alone was a miracle in itself. If he did know, it would be a no mercy zone, and no mercy with Iron Man was not fun.</p>\n<p>Peter was hoping that Natasha hadn’t found out either. Nat would be just as bad as Mr. Stark. But he had talked to her over the weekend too, and she didn’t seem to know about it. Then again, she was a spy for years before her identities were exposed.</p>\n<p>Pepper was the only one who would be at the tower. She generally spent a lot more time there than other places. Most of the meetings regarding SI were at the tower, although sometimes she would have to travel.</p>\n<p>With this information, Peter felt that he’d be relatively safe on the field trip. He knew many of the interns who worked at the tower. That would disprove the popular theory that Peter was lying about his internship if he wanted his class to believe him. But since he’d be with his class, he knew they would keep their distance for the day.</p>\n<p>He met up with Ned as he walked to school, Peter’s friend was munching on an almost burnt bagel. They lived on the same block, so they usually walked together. Having their houses so close to each other made it easy to hang out often. MJ’s house was on the other side of Midtown, so normally May would drive Peter if he went to her house.</p>\n<p>Today, Ned was insanely energetic. Actually, it wasn’t much different from the last few days. Peter’s friend wouldn’t stop talking about the trip. He kept getting messages way too early in the morning for Ned, and the only reason he answered was because he was on patrol anyways.</p>\n<p>It was a little overwhelming, having to be with an excited Ned. Yeah, he loved him and all, they’re bros. But it was starting to test Peter’s patience. Half a week was a long time.</p>\n<p>MJ didn’t even help him, she just sat and watched Peter answer question after question like “what if...” and “do you think...” She always had some sort of book, and Ned would start spewing questions. So MJ would just smirk into her book, pretending like she wasn’t seeing any of it.</p>\n<p>“Do you think I’ll get to meet Iron Man?” The interrogation began.</p>\n<p>“You’ve already met him, Ned.” Peter pointed out.</p>\n<p>“But he’s so cool. You’re really lucky you get to spend so much time with him. Hey, do you think if I could remake the experimental spider and let it bite me, that I’d get powers too? Do you think Tony Stark would make me a suit?” Rambled the boy.</p>\n<p>“Um. I don’t know, Ned. Maybe.” Peter replied, not exactly sure how to answer those questions.</p>\n<p>“What would happen if you have kids? Would they have powers like you? What if something happened in the womb and they grew eight legs?” At this point Peter wasn’t even listening.</p>\n<p>“You have super strength right? How much can you lift? Do you think you can lift more than Captain America? Can you break his shield? I heard it’s made out if vibranium. Can you break vibranium? Does that mean you could break the Winter Soldier’s arm? It’s made out of vibranium too, right?” Ned paused to take a bite of his bagel. Peter wasn’t even sure if he swallowed before he began talking again.</p>\n<p>“How much vibranium do you think they keep in Wakanda? I heard that all their structures are made of it. Is Black Panther’s suit made of vibranium? I heard that his sister makes all of his tech. Do you think she’ll be like the next Tony Stark? I wonder if she’s hot.” Peter almost missed a step when he heard the last question.</p>\n<p>“She’s a princess, she must be. Do you think if the situation popped up that she would date me? I bet she would date you, I mean, you’ve got abs man.” That was slightly freaky. Since when had Ned seen him with his shirt off?</p>\n<p>“I already have a girlfriend, Ned. I think if I traded MJ for a princess, MJ would find a way for me to have a slow and painful death.” Peter told him. How does he come up with these?</p>\n<p>“Good point. We should probably try to avoid that.” Peter’s friend pointed out the obvious.</p>\n<p>The crazy scenarios stopped as the two arrived at Midtown. The ugly yellow school bus that was supposed to take them to Stark Tower was already waiting by the front. Their trip was for the whole day, so they were supposed to leave in a few minutes. Most of their classmates were already waiting on the bus.</p>\n<p>Mr. Larson was collecting permission slips by the doors to the bus. It took Ned about a quarter of a second to get his out. Peter, on the other hand, had to dig through the depths of his bag, and handed the crumpled and ripped sheet to his teacher. Mr. Larson looked at it in disgust, probably because of the ketchup stain that was on it.</p>\n<p>Peter and Ned joined MJ in the back of the bus. Somehow the last few seats had stayed open. Peter’s guess was that MJ had a big part in keeping the section clear for them. He knew that MJ’s glare could work wonders. Maybe he should learn to do that himself. Or better yet, ask Mr. Stark to put it into his suit. Interrogation mode hadn’t quite done the trick.</p>\n<p>“You losers were almost late.” MJ told them, keeping her gaze on the book she was reading. It was a different book than yesterday, Peter noted. Yesterday’s book had been different from the day before too. It wasn’t surprising considering how much the girl read.</p>\n<p>Peter also noticed that MJ was carrying her “crisis notebook” with her. MJ had show him the sketch of the teacher who watched the students in detention. Peter had just ditched it and the sketch showed his reaction.</p>\n<p>“Then I should have left later.” Peter mumbled. Maybe then he could have missed the bus.</p>\n<p>“What’s that I heard?” MJ asked him. Her voice warned him to be careful of his next words.</p>\n<p>“I said that it would have been a shame.” Corrected the teen. It was practically dripping sarcasm.</p>\n<p>“That’s right.” Was MJ’s reply. She seemed to ignore the fact that it was completely sarcastic.</p>\n<p>The bus began its trip to Stark Tower. The majority of the class was talking about the tour they’d be getting. Ned kept asking silly questions, and MJ continued reading her book. Then there were the loud and obnoxious people who made everyone want to rip their ears off. Namely, Flash and his clique. So, the volume on the bus was nearly as high as the tower they were going to.</p>\n<p>“Yo Penis! Can you introduce me to Tony Stark?” Flash teased Peter. “Oh wait, you don’t even know him. My bad!”</p>\n<p>Peter chose to ignore the taunting and waited for Ned to ask another question. His friend didn’t seem to get the memo because none came.</p>\n<p>“I heard your girlfriend is forcing you to come. Are you scared, Penis?” Flash went on.</p>\n<p>“I could just die right here.” Peter muttered under his breath in embarrassment. Only Ned and MJ should have heard him. They were sitting closest to him.</p>\n<p>“Ooh, do you think lovely Michelle will follow you in her grief?” Flash said, snickering.</p>\n<p>Peter was taken back by Flash’s comment. Usually he left MJ alone. Bothering him alone was one thing. But bringing his girlfriend into it was a whole other story. Peter was about to have a few words with Flash until MJ beat him to it.</p>\n<p>“Flash, if I wanted to die, I would climb up your ego and jump down to your IQ level.” She told him, giving Flash her evil glare. The bus suddenly became very quiet, and most eyes were on MJ and Flash. What a solid burn.</p>\n<p>“And if you make a comment like that again, I’ll add some color to your pasty face.” MJ added on. Peter knew she was tough, but he did not know that she was the supreme master of roasting.</p>\n<p>It seemed there was already more color on his face than there originally was. An embarrassed blush was consuming his whole face. He looked like a ripe tomato, ready for harvesting.</p>\n<p>“Whatever.” Flash squeaked out, making his way to the seat he was in earlier. The rest of their class fell back into chatter, although more quiet this time.</p>\n<p>“You had to wait until now to pull that one out?” Peter questioned MJ jokingly.</p>\n<p>“I had to wait for the right moment. I’ve been waiting for this opportunity for months.” She informed him. A smirk was creeping up her face.</p>\n<p>She folded the corner of a page in her book and shut it. MJ opened her “crisis notebook” and took out a pencil. She noticed Ned and Peter watching her.</p>\n<p>“You saw his face, right? It deserves a special place in here for safekeeping and blackmail purposes.” Said MJ. She began scribbling in the notebook. Peter would have to see it when she finished. Generally her sketches were pretty accurate.</p>\n<p> — — —</p>\n<p>Tony walked into the kitchen, where Steve was making breakfast. He and Nat were the only Avengers who could actually cook. Steve was the only one who ever made the food though, because you’d be caught dead before you saw Nat cooking. Tony knew, it had almost happened once.</p>\n<p>Most of the team was still asleep. He noticed Wanda on the couch, fiddling with her earbuds as she listened to music. Tony hoped it wasn’t rap, he couldn’t stand that style of music. Clint was once again sitting on the counter, legs swinging back and forth like a child. He was drinking Tony’s coffee right from the pot.</p>\n<p>“Could you maybe not drink all of the coffee that I asked Friday to brew?” The billionaire asked, clearly annoyed.</p>\n<p>“Well, as Cap likes to say, the early bird gets the worm, Tony.” Came the archer’s reply, taking another sip from the pot.</p>\n<p>“I was working on Peter’s suit before you woke up.” Tony grumbled at him.</p>\n<p>“You’re missing the point. I was here first, so I get the coffee.” Clint told Tony, taking another gulp of the caffeinated drink.</p>\n<p>“I don’t think so, Legolas.” Tony started. “Friday.” The man qued.</p>\n<p>Almost instantly, the lid to the pot shut, and the pot zoomed back over to the coffee maker. Clint appeared to be shocked. Cap looked over from the stove to see what happened. They both looked confused. Wanda didn’t seem to notice anything, the music likely blocking the rest of the world out.</p>\n<p>“Magnets can work wonders.” Tony simply stated. A smug smile formed on his face.</p>\n<p>“When did you add that?” Clint protested.</p>\n<p>“Since this became a daily occurrence, you thief.” Accused the billionaire. Tony dumped out the coffee in the pot since it was contaminated by Clint, and made himself some new coffee. Clint’s also probably had a ton of sweeteners in it, gross. Tony liked it bitter.</p>\n<p>“Since when do I say, ‘the early bird gets the worm?’ I’m pretty sure I’ve never said that in my life.” Steve asked.</p>\n<p>“You old people say that sort if stuff all the time. I’m sure you used to, back in your day.” Clint explained to the super soldier.</p>\n<p>“I’m not even sure it was ever said before my plane crashed.” He argued.</p>\n<p>“Actually, Sir, the first recording of that phrase was by John Ray in the late 17th century. He said ‘The early bird catcheth the worm.’” Friday announced. Steve had a defeated look on his face.</p>\n<p>“Maybe you’re just uneducated, Cap.” Suggested Clint.</p>\n<p>As Steve finished cooking their breakfast, more members of the team came in. He made omelettes, and there was cheese oozing out the sides.</p>\n<p>“Are any of you going to vote today?” Wanda asked the group in attempt to start a conversation.</p>\n<p>“Nah, I hate politics. Plus, researching each person is boring. I have suits to build, a company to run.” Tony said.</p>\n<p>Steve looked nearly horrified. “But voting is important! Every vote counts, it could be the difference between who wins, Tony.” The patriotic man lectured.</p>\n<p>“Like I said, I don’t have time for that stuff. Also, since when has an election ever come down to one person’s vote?” Explained Tony.</p>\n<p>Steve looked a little put back. He couldn’t think of any, and he hadn’t caught up on much politics since coming out of the ice. Determination was evident in Cap’s eyes.</p>\n<p>“You should appreciate that you even have the right to vote! It took generations for some Americans to be allowed to vote. Some people in other countries still don’t have that right!” The righteous man told them.</p>\n<p>“I appreciate it, I just don’t use it.” Replied Tony with his “I don’t care” attitude.</p>\n<p>Steve looked mad at this point. It really ticked him off when people weren’t thankful or appreciative of what they have. Steve fought so many battles in one of the biggest wars in history in order for people to keep these rights! It wasn’t fair!</p>\n<p>“I’m going to take a walk.” Cap announced to the group. He got out of his seat at the table and walked towards the elevator.</p>\n<p>“I think Pete was trying to convince people to vote for President Ellis again. He should be downstairs. Why don’t you talk to him about it?” Suggested Clint.</p>\n<p>“Maybe I will!” Cap said, not turning to look back as he stepped in the elevator.</p>\n<p>As soon as the doors shut, Clint and Tony high fived. Wanda was fruitlessly trying to hide a smile.</p>\n<p>“Cap won’t be very happy when he finds out you two set him up.” Wanda pointed out.</p>\n<p>“Yeah, well he wasn’t going to meet up with Peter intentionally. Distracting him from thinking why the kid is here was the only way to do it.” Clint explained to her.</p>\n<p>“I’m not sure I like the idea of embarrassing Peter.” Wanda stated. She knew that it would happen anyways.</p>\n<p>“Like I said before, he’s going to have one heck of a field trip.” Clint repeated from the week before.</p>\n<p> — — —</p>\n<p>The bus finally pulled up at Stark Tower. It dropped them off at the front, the same place they would be picked up in a few hours. There was only one other school group there. Everyone else worked there.</p>\n<p>The entrance area was big and grand. It had Tony Stark written all over it. The floor was covered in marble tile, and many of the walls were completely made of glass. The ceiling was at least three stories high. The whole class, especially Ned, was amazed. Peter couldn’t appreciate it the same way, he was just used to it by now.</p>\n<p>Their teacher led them towards the check in desk. A tour guide was waiting there for them, and she was holding their badges. Peter recognized her. Katelyn was one of SI’s interns. She was blonde and short, but well built. Peter knew that she was on her school’s crew team.</p>\n<p>Katelyn smiled at the group when they arrived. “Hello Midtown High! My name is Katelyn, and I will be leading you on your tour today.” She said sweetly.</p>\n<p>Katelyn started talking about some the history of SI. Peter wasn’t listening. The elevator doors had opened, and someone who wasn’t supposed to be here came out. He wasn’t recognizable at first glance, but if you looked past the baseball cap and the large sunglasses, you would recognize him.</p>\n<p>Peter was a little scared now. Mr. Stark had told him that none of the Avengers would be at the tower today, and yet, there was Captain America. That meant that Mr. Stark must be planning to do something with his class. It could be that it was a last minute decision and had nothing to do with his trip. Or maybe it was just Steve at the tower.</p>\n<p>Cap appeared to be looking for something or someone in particular. Peter really hoped that it wasn’t him. The soldier walked around some more and searched, until he spotted Peter. Great, luck was on his side today.</p>\n<p>Steve approached him, keeping his head low so that he wouldn’t be recognized. Peter shifted away from his group so that hopefully they wouldn’t see him with Steve. Only MJ seemed to notice that Peter was drifting from the group.</p>\n<p>“Hey Peter, I heard that you’re supporting President Ellis in getting re-elected.” Steve said.</p>\n<p>“Um, well, not really. But I’d be happy if he did get elected again I guess.” Peter replied, a little confused on Cap’s choice of topic.</p>\n<p>“Really? Tony was just telling me about it.” Steve told him, clearly confused.</p>\n<p>“Do you mean that Mr. Stark is here, in the tower?” An alarmed Peter asked.</p>\n<p>“Yes, he’s in the penthouse. I thought you’d be happy about…” Cap drifted off as he noticed Peter’s class. “Oh yeah, you have a field trip.” Steve finished, realizing why the kid seemed so freaked out.</p>\n<p>Most of the group noticed him by now, and there were whispers of “That looks like Captain America!” Peter looked panicked, almost like a deer caught in headlights.</p>\n<p>“I’m sorry Peter, Tony and Clint must have tricked me into coming down here just to talk to you.” Steve told him, looking genuinely upset on the boy’s behalf.</p>\n<p>“It’s fine, it’s not your fault if they tricked you.” Peter paused. “Does this mean that Mr. Stark and Clint are planning something for today?”</p>\n<p>“Definitely. I’m not sure what, but there’s definitely something coming.” The super soldier confirmed. Peter shivered.</p>\n<p>“I think I’ll go and scold Tony and Clint now.” Steve said to Peter. “Maybe I can convince them to stay away from your group. Try to have some fun and don’t worry about those two too much.” Added Steve in attempt to help Peter not worry so much.</p>\n<p>It didn’t work well, the kid was still nervous. But he did appreciate Cap’s effort. He would try to stop thinking about it, because he really wanted to relax and enjoy the tour. Peter wouldn’t have to stay on guard too much because his spider sense would warn him.</p>\n<p>“Thanks. See you later, Steve.” Peter replied, speaking softly so his class couldn’t hear. The older man left, leaving Peter.</p>\n<p>Peter awkwardly walked back over to his class. Some of the students were gaping at him, having recognized the man he was talking to. Flash seemed to be among them, but also denying what he saw. Others looked confused. And then there was one who didn’t seem to care. That was MJ. She was reading her book again.</p>\n<p>“Alright then! Let me hand out your badges.” Katelyn started in her super cheery voice. “I don’t know your names, so just come up when I call you. Becky Anderson.” One by one each person grabbed their badge.</p>\n<p>As this happened, Flash approached him. Peter mentally groaned. He just never stopped.</p>\n<p>“Who was that, Penis? You’ve got some people fooled into thinking it’s actually Captain America.” Flash confronted the boy.</p>\n<p>“He’s one of my friends. We see each other on the weekends a lot.” Peter told him truthfully.</p>\n<p>“Then why was he here? Don’t try and tell me it’s because he works with you, Penis. You can’t trick me with that lie.” Flash questioned him. Peter panicked, he didn't want to tell Flash who it was, but he was running out of options. And technically, everything Flash had just told him not to tell him was true. Peter, as Spider-Man, worked with Steve on missions occasionally.</p>\n<p>“He works with Mr. Stark, and I see him during my internship.” Peter explained.</p>\n<p>Flash still didn't believe he was telling the truth. His eyes were narrowing at Peter suspiciously. Flash opened his mouth to say something else, probably another accusation, when his name was called for his badge. Peter saw Katelyn give Flash the stink eye as she handed his card to him. She must have seen what was going on.</p>\n<p>Peter took the opportunity to escape back to his friends. They already had their badges since they were being called out in alphabetical order.</p>\n<p>“Peter, was that really-” Ned started rambling excitingly. Peter cut him off.</p>\n<p>“Ned, quiet! I don’t want people to know about that.” The boy urgently whispered to his friend.</p>\n<p>“So it is? Dude, you have got to introduce me.” Expressed Ned at a much lower volume. His eyes wide in amazement.</p>\n<p>“Sure Ned, maybe some other time.” Peter assured his friend.</p>\n<p>Ned directed his attention towards his temporary badge. He seemed to soak in every little detail that was there. Peter didn’t understand why Ned found it so amazing, but apparently it was to him.</p>\n<p>They had the person’s name on it with a picture and the Stark Industries logo. At the top, there was a colored bar with the person’s status. For their class, the bar was yellow, and the status was Delta.</p>\n<p>Peter took his badge out of his bag. One of the security measures of the tower was that each person was only allowed one badge. So Peter could not get a separate one for the field trip. He just hoped nobody noticed.</p>\n<p>Peter’s looked different. It still had his name, picture, and the logo. However, the bar color and status were different. The bar was purple and the status was Alpha. This gave him access to every part of the tower.</p>\n<p>“All of your badges should look the same, but we actually have a wide variety of badges.” Their tour guide started explaining. “There are four major status classifications. There’s Alpha, Beta, Gamma, and Delta, with Alpha as the highest and Delta as the lowest. Within those classifications are four others. These are determined by the color of the bar on you badge. There’s purple, blue, green, and yellow, with purple as the highest and yellow as the lowest.” Katelyn taught them.</p>\n<p>“Delta is usually for our manufacturers and our tour groups. Gamma is for the engineers, scientists, and techs. Beta is for some of the higher ups who help run the company. If Pepper Potts, our CEO, was only CEO, then she would be a Beta purple. But, she is also the personal assistant and fiancée of Tony Stark, so she is an Alpha purple. Alpha gives someone access to the penthouse section of the tower. All of the Avengers have Alpha badges. Some, like Ant-Man and Black Panther, don’t stay very often, so they would have Alpha yellow. Alpha purples are the only ones who have access to the entire tower.” Katelyn went on.</p>\n<p>“Now we will make our way to the manufacturing section of the tower, which is more interesting than it sounds.” Katelyn smiled sweetly and led them away from the glamorous entrance area.</p>\n<p>Ned was practically dancing as they walked down the long hallway. He kept looking down at his badge in awe. MJ was using hers as a bookmark. She wasn’t actually reading at the moment, and was enjoying the atmosphere of the tower.</p>\n<p>Peter felt his spider sense prickle before his badge was snatched out of his hand. He quickly turned around to find Flash, with Peter’s badge in his grasp.</p>\n<p>“Why is your badge different, Penis? Did you steal it?” Flash accused him.</p>\n<p>“No! Give it back, Flash.” Peter protested, reaching for the card.</p>\n<p>Flash moved it out of the other boy’s reach. “I don’t think so, Parker. You’re not getting this back until you admit you stole it.” He teased him. Peter kept trying to reach for the card, and Flash kept moving it out of the way.</p>\n<p>MJ walked up behind Flash and plucked it right out of his hand. She wasn’t even trying to be discreet about it, and Flash still hadn’t noticed. Even without his spider sense, Peter would have seen that coming.</p>\n<p>His girlfriend looked at the card. “It has his picture on it.” She simply stated. MJ flipped the card back around to show Flash, still keeping it out of his reach. Her eyebrows were raised in annoyance. She handed the badge back to Peter.</p>\n<p>“Well, what if he hacked-” Flash started saying before he was cut off.</p>\n<p>“As smart as Peter is, he would not be able to hack Tony Stark’s security system. He makes it so that no one can.” MJ interrupted. “You’re on decathlon, Flash. You should be able to figure this one out.”</p>\n<p>MJ waited for his reply but none came. “Are you having trouble? Let me help you. That is Peter’s real badge.” She said the last sentence slowly and emphasized each word. There was still no response from Flash.</p>\n<p>“Come on, say it with me.” MJ waited until Flash started saying it.</p>\n<p>“That is Peter’s real badge.” They two said simultaneously. Each word was emphasized and slow, just like MJ said it the first time. Flash grumbled as he said it, clearly only doing it because of MJ’s threat from the bus earlier.</p>\n<p>They finally arrived at the manufacturing stations, and Flash left. They all had to swipe their badges to get in. Katelyn led them around while talking about what was going on and what they were seeing. Peter had never been to this part of the tower, so it was actually pretty cool to look around and learn the little parts of SI that he didn’t already know. MJ stuck closer to Peter, just in case Flash wanted to be annoying again. As for Ned, well, we can all guess how he was reacting.</p>\n<p> — — —</p>\n<p>The doors to the elevator in the penthouse dinged. Steve walked out, looking quite ticked off. There was nobody in the kitchen area, where Cap thought Tony and Clint would be. Several plates were in the sink, so they probably already finished eating.</p>\n<p>However, when he checked the living room, almost everyone was there. Clint, Sam, and Wanda were playing Mario Kart on the TV with the fancy steering wheel handles you can put on the wii remote. If there weren’t numbers indicating which place they were in on the screen, Steve would have thought they were all tied.</p>\n<p>Nat was sitting on the couch, sipping what appeared to be hot chocolate. She was sitting with one leg folded on top of the other, and she still had her pink Black Widow pajamas on. Bruce was on his Starkpad, most likely reading some classic novel that came out after Steve’s time. Rhodey was on the opposite side of the couch Nat was on, and was dozing off. He must have gotten back really late the night before. Bucky was lazily reading the news and looked up when Steve came in.</p>\n<p>“You good, Steve?” His friend asked, clearly noticing his ticked off expression.</p>\n<p>“Nope, he’s not.” The archer answered for him as he was opening his mouth to reply.</p>\n<p>“Damn right I’m not!” Confirmed the soldier harshly.</p>\n<p>“Language!” Everyone in the room said at once. No one stopped what they were doing or looked at him as they said it. Even Banner had taken part in it, a tiny smirk was evident on his face.</p>\n<p>Steve rolled his eyes. “Where’s Stark?” He demanded. Steve decided to leave Clint alone for the time being. Tony was the brains of the duo, so he was probably the one who came up with idea to trick him.</p>\n<p>“Where else but his lab?” Wanda pointed out. She was right, Tony was always down there doing something with the suits. He should have thought to check there first.</p>\n<p>As he was leaving the room, he heard lots of shouting. Most of them were protests, but one of them sounded victorious. A glance at the TV screen showed that Sam, who played as Donkey Kong, had placed first.</p>\n<p>“That’s right! Take an L, suckers!” Sam shouted to Clint and Wanda.</p>\n<p>When Steve opened the glass doors to Tony’s lab, the music wasn’t as loud as he expected. Usually it was blaring on possibly the highest volume, but now is was soft enough to be background noise. He heard another voice in the room, so he figured it was probably because he was talking to someone.</p>\n<p>He was right, Tony was talking to Pepper. The latter was facing his direction and smiled when she noticed him. He politely nodded to her in acknowledgment.</p>\n<p>He took advantage in the pause in their conversation to speak. “That was rude, Stark.” Cap scolded. Pepper gave her fiancé a pointed look.</p>\n<p>“Tony, what did you do?” She said in an accusing tone.</p>\n<p>“Just telling Capsicle that I wasn’t going to vote today.” The man told her. He wasn’t telling the whole truth, and Pepper could definitely tell.</p>\n<p>“And tricking me into embarrassing Peter in front of his class!” Steve added.</p>\n<p>“Tony!” Pepper exclaimed. “I thought May told you not to do that!” The woman reminded him.</p>\n<p>“How did you know about that? Were you listening to my calls again?” Tony expressed his curiosity.</p>\n<p>“How else am I supposed to keep you in line?” Pepper declared.</p>\n<p>“You have no sense of privacy, Pep.” The billionaire claimed.</p>\n<p>“We share a room.” She kindly reminded her soon to be husband.</p>\n<p>“Right.” He murmured.</p>\n<p> — — —</p>\n<p>The class had finished touring the manufacturing section, and was walking towards their next destination. Katelyn hadn’t told them what it was yet, but said it would be pretty cool. The technology that was used to make SI’s products had been more interesting than it sounded, just as Katelyn promised.</p>\n<p>One of the men that worked in that department had told them about his job and what a normal day for him was. It sounded like a lot of lifting and moving things around. The man also showed them all the power tools he used on a daily basis. There was also a lot that the machines did for them.</p>\n<p>Right now, they were walking down another hallway that looked similar to the one from earlier. Peter knew that most of the hallways on the first floor looked this way.</p>\n<p>They reached another door, this one made of glass. The surrounding walls were also made of glass and curved around the place they were looking at. On the other side was a grassy area surrounded by tall walls. The top of the walls weren’t visible, so you couldn’t tell if there was a roof, but there was sunlight streaming in, so there must not be one.</p>\n<p>In the center was a large circular shape with a strange looking pattern inside. Where the pattern was, there wasn’t any grass. The mini lawn looked freshly mowed, and Peter felt sympathetic for whoever had the job if mowing the tiny place.</p>\n<p>“The place you’re looking at now is where the Thor comes to earth. When they get here, a lot of pressure is put on the ground, and would collapse the tower if it were on a higher floor. Mr. Stark also didn’t want the print engraved every time Thor came to visit, so he made a place just for that purpose.” Katelyn educated them.</p>\n<p>Murmurs of incredulity rippled through cluster of students. It was very fascinating to look at. Peter had never really thought about how Thor got to Midguard, as he called it. He’d always just seen him enter through the elevator doors.</p>\n<p>Ned’s mouth dropped open, and his jaw was hanging low. He was gaping like a fish with his eyes wide open.</p>\n<p>“You’ll catch flies, Ned.” MJ warned him. He shut his mouth, but his eyes were still bulging.</p>\n<p>“We do not have authorized access to this space, but feel free to take a look.” Katelyn let them know.</p>\n<p>Ned ran up to one of the walls and pressed his hands and face against it. He looked like a little kid at an aquarium.</p>\n<p>MJ took out her phone and snapped a few pictures. She pocketed her phone when she got too frustrated from the glare that the glass was reflecting.</p>\n<p>“Alright, if you’ll all follow me this way-” Katelyn started as she led the class in a different direction. She was interrupted by a flash of lightning and booming thunder that shook the whole building. It had come in the direction of the area they had just come from. Peter felt his spider sense tingle.</p>\n<p>Out of curiosity, the group made their way back to the miniature courtyard. Standing there was Thor and Loki. The tour group erupted into whispers.</p>\n<p>“Would you kindly remind me why we’re here, brother?” Loki asked Thor as they stepped into the hallway. Thor was dressed in casual clothing with an umbrella rather than his armor and cape, and Loki was dressed in a suit in his attempt to dress like a normal Midguardian. Most people seemed a little wary of Loki, recognizing him from the Battle of New York a few years ago. All eyes were on them, and they didn’t seem to notice.</p>\n<p>“I was told by Stark that there was an emergency at the tower, but I do not see any problems as of yet.” Thor answered. The muscular Asguardian finally spotted Peter.</p>\n<p>A wide smile graced the man’s face. “If it isn’t for mini Stark! What a pleasure to see you!” Thor walked towards him and gave him a hug. It would have been bone crushing if not for Peter’s super strength. The boy grimaced at the nickname the older man had given him.</p>\n<p>“I was not aware that Stark had a son.” Loki announced. Peter’s eyes went wide.</p>\n<p>“No no no! I’m not his son, Mr. Loki, I’m just his intern.” The boy corrected the trickster. </p>\n<p>“Oh! My apologies Peter. I was under the impression that you and Stark were related!” Thor informed him. The man let out a thunderous laugh. Peter stayed silent, fully aware of the eyes that were watching him. Thor seemed to notice his uncomfort.</p>\n<p>“What’s the matter?” He asked, concern in his expression.</p>\n<p>“Uh, nothing, Mr. Thor. I’m fine.” Assured Peter. Thor didn’t seem to buy it. He finally noticed the group near them.</p>\n<p>“Do you know these young Midguardians?” The muscular man inquired.</p>\n<p>“Well, yes. I do. They’re in my chemistry class from school.” Peter answered. A beaming smile spread across Thor’s face.</p>\n<p>“Wonderful! Would you all like to see the Avenger’s personal training room? I can show you my hammer.” Thor asked, facing the entire group as he spoke.</p>\n<p>Loud shouts of “Yes!” were heard, finalizing the decision. Peter didn’t like this idea at all. But, when Thor had a crazy idea, there was no stopping him. Besides, at least all the attention wasn’t on him anymore.</p>\n<p>“Excuse me, but these people do not have access to the higher floors, including the training room.” Katelyn informed him.</p>\n<p>Thor stopped to think for a moment, before his face brightened again. “Don’t worry about that, I can swipe them all in!” The man resolved the conflict. He pulled out his own badge, which was an Alpha purple.</p>\n<p>“I’m afraid that this is against many of the security policies.” Their tour guide protested again. Peter felt bad for her, she was just trying to do her job.</p>\n<p>“I’m sure the Man of Iron won’t mind.” Thor told her, fully convinced he was right. He lead the group towards the main elevator, and they somehow fit the whole class inside.</p>\n<p>“Brother, even burning Asgard to the ground was a better idea than this.” The trickster reprimanded.</p>\n<p>“Boss, Thor and Loki have arrived at the tower.” Friday informed Tony. The man smiled. “They are bringing the Midtown Science tour group to the training room.” The AI added on.</p>\n<p>The genius’s smile faltered slightly, that part hadn’t exactly been part of the plan. Tony was supposed to meet Asgardian down there, and then they would go find Peter. He supposed he would just have to change the plan. Easy peasy.</p>\n<p>“Hold up the elevator, Fri.” Tony instructed. He headed towards the door to his lab at a quick pace. Pepper caught him before he could leave.</p>\n<p>“Where do you think you’re going?” She challenged him.</p>\n<p>“The living room. I’ve got to talk to Nat and Wanda.” He told her. She narrowed her eyes at him suspiciously.</p>\n<p>“As long as you’re not going downstairs to talk to Peter.” Pepper said. “Or trick someone into doing it for you.”</p>\n<p>“Wasn’t even considering it.” Tony promised. He quickly left the room.</p>\n<p>“I’m not kidding, Tony!” He heard his fiancée yell from his lab.</p>\n<p>He hadn’t been lying. He wasn’t going to talk to Peter and he wasn’t going to trick anyone into doing it for him. However, he knew some people who would do it without convincing.</p>\n<p>Tony went to the living room where he assumed the two Avengers would be. He was right. Natasha was playing Mario Kart with Sam and Clint. She was creaming them. Tony saw about a dozen banana peels and koopa shells bouncing around the track. Every few seconds, Sam or Clint would crash into one. Nat was on her third lap while the other two were somewhere on their first. Wanda was sitting on the sofa, laughing at the two men struggle and fail.</p>\n<p>“That’s what you get for criticizing the gaming skills of women.” Nat told them as Yoshi finished in first. Wanda started another round of laughing fits. The bird themed heroes hung their heads in shame, muttering about it not being fair. Yoshi was jumping in his vehicle, pumping his fist in the air. Donkey Kong shook his head in disbelief, and Baby Peach cried and had a mini tantrum.</p>\n<p>“Phase three, Plan C.” Tony said aloud. The four heads in the room whipped around to look at him. Nat and Wanda glared at him for interrupting, but obliged and headed towards the elevator.</p>\n<p>“Thor’s already in there with Pete’s whole class, you’re going to have to use the stairs.” He told them. They both looked fairly annoyed.</p>\n<p>“That's seventeen flights, Tony.” Wanda complained. She looked more like a teenager when she did that.</p>\n<p>“That's not really my problem.” The billionaire replied. Wanda moaned, and then followed Natasha down the staircase. “And you better hurry up! I stopped the elevator to buy you some time, but there’s a ton of people in there.” Tony yelled after them. Technically, Wanda could make her and Nat fly down using her magic, but he would let them figure it out themselves.</p>\n<p>After being defeated in Mario Kart, Clint and Sam switched to Wii Sports Resort. They were in the middle of a dogfight, and Sam was down by a few balloons. Tony left as Sam’s Mii chased Clint’s Mii into the volcano.</p>\n<p> — — —</p>\n<p>“You couldn't have taken just one day off from being an idiot, now could you?” Loki scolded his brother. “Stark told you there was an emergency, and now we're stuck in this elevator with thirty little children with no way to get out! ‘Get help’ won't help us like it did last time, brother.”</p>\n<p>“Oh, so it's my fault now? Wasn't it your grand idea to have a blue glowing cube control everyone's mind?” Thor accused his brother.</p>\n<p>“And it was your idea to attack the frost giants and start a war.” Loki reminded Thor in return.</p>\n<p>The Asgardian brothers continued to argue, their voices rising as they went on. Peter wished they would be quieter. He was squished between the two men, and with his enhanced senses, it sounded like they were shouting. Peter didn’t want to go into sensory overload. Especially not in front of his class.</p>\n<p>A few minutes earlier, the elevator had stopped moving on their way to the training room. That meant that about thirty students, an intern, a teacher, and two Asgardians were huddled in an unmoving elevator. It was not the most preferable situation to be in, although Ned was freaking out about being squished against the other side of Thor. If it weren’t for their argument, you’d probably be able to hear him squealing.</p>\n<p>Nearly all of the students were watching the siblings fight. Their insults were hilarious and hard hitting, even if they didn’t understand most of them. The tension that was present around Loki at first was almost all gone now that people were seeing the other side of him.</p>\n<p>Peter had watched MJ pull out the “crisis notebook” again. Based on the way she frequently looked from Loki back to the paper, she was probably sketching the black haired god.</p>\n<p>“My outfit looks outrageous? You’re the one dressed like a witch! You’re like Parry Hotter!” Thor boomed.</p>\n<p>“What in the nine realms is Parry Hotter? I don’t think you know anything you’re talking about!” Loki argued back.</p>\n<p>“Of course I know what I’m talking about! I’m not an idiot!” Defended the Asgardian.</p>\n<p>“Brother, if I agreed with you, then we’d both be wrong. You’re the one who got us stuck here in the first place!” Quipped Loki.</p>\n<p>As Thor opened his mouth to yell back, the elevator started moving again with a jolt. Peter was thankful that nobody was yelling in his ears anymore. The rest of the class grew excited again, now that they weren’t stuck.</p>\n<p>Thor smiled a beaming smile. “Well, it doesn’t look like that’s a problem anymore, now does it, brother?” Thor asked Loki, thinking he won the argument. Loki just rolled his eyes.</p>\n<p>The anti-gravitational feeling simmered away as the elevator slowed to a stop. The doors slid open and the class exited, with the Asgardians in the lead.</p>\n<p>There was a hallway with one solid wall, and one glass wall. On the other side of the glass was the training room, judging by the equipment. The glass wall was in place for safety reasons so that someone in the hallway wouldn't get hurt. The lights weren’t as bright, and it created a softer atmosphere. This room didn’t scream billionaire like the first floor did.</p>\n<p>Katelyn’s reaction would have made Peter laugh if it weren’t for the situation he was in. The intern didn’t have access to this part of the tower, just like the rest of the group, so her expressions were similar to the class she was supposed to be guiding.</p>\n<p>Ned looked ready to break the glass wall separating the hallway from the training room in his excitement. At this point, Peter wasn’t at all surprised. MJ was taking in the place around her, but her face didn’t reveal her thoughts to Peter. The rest of the class had expressions of awe.</p>\n<p>In the center of the training room was a large mat. All the other equipment was pushed to the side against the three walls that weren’t glass. Black Widow and Scarlet Witch were fighting in the center.</p>\n<p>Peter would have called it sparring, considering that’s what Nat usually did for her training, but it wasn’t. Wanda was using her magic to fight Natasha, so they really had no contact at all. The assassin dodged things that were being thrown at her, and sometimes threw them back.</p>\n<p>They were moving at high speeds, so it was really hard to follow what was going on. This just made it more admirable. The two just seemed to move in rhythm, falling in the right places at the right times. Even Peter, who already trained with these two women, wished he could do that.</p>\n<p>The whole group was watching against the glass wall from the hallway. MJ looked impressed, which was a strange look on her.</p>\n<p>Thor, still with his beaming smile, entered the arena without thought. Loki followed him, looking slightly hesitant on whether he should enter or not. Despite the hesitation, he still held his aura of confidence.</p>\n<p>The ruler of the nine realms approached the two women. He got hit in the face with the tail of one of the arrows Wanda was launching at Nat. It clearly startled him. Thor was not close enough to the mat to get hit, so it was likely done on purpose.</p>\n<p>“Oops.” Wanda said with a boring tone and a mundane expression. “My bad.”</p>\n<p>Thor quickly recovered from the surprise. “Do not worry, I was not harmed.” He assured Wanda.</p>\n<p>“No one is going to worry about you, brother.” Loki told him.</p>\n<p>Wanda finally stopped aiming objects as Natasha. She looked at the tour group, and then at Thor.</p>\n<p>“Why did you bring children in here? You do know we sometimes throw knives, right?” Wanda questioned the Asgardian with a disapproving look.</p>\n<p>“I thought they might want to see my hammer! And how did you know it was my idea and not my brother’s?” Thor answered her.</p>\n<p>“Because Loki at least knows a good idea from a bad one.” Nat explained to him. Loki smirked.</p>\n<p>“She’s right you know.” He added on. Thor appeared to disagree with the popular opinion.</p>\n<p>“Anyways, now I will show you all my hammer!” Thor boomed, facing back to Peter’s class as he spoke. The god flipped his umbrella in the air, and when it landed back in his hand, it was his famous hammer.</p>\n<p>The class stared in amazement. Nobody there had ever seen anything like it. Even Peter, who had briefly met Thor a few months earlier.</p>\n<p>“Nobody wants to see your boring hammer.” Loki harshly told him. Thor looked like a kicked puppy. He looked like his brother had shattered his dreams.</p>\n<p>There were many mumbled protests to Loki’s statement. No one in the class was brave enough to openly disagree with the trickster.</p>\n<p>Thor was ready to protest when Natasha spoke up. “We could show them Wanda’s powers. There are a lot of people who don't fully understand what she can do.” The woman suggested.</p>\n<p>Many of Peter’s classmates who were upset with not getting to see the hammer stood up a bit straighter. Not understanding Scarlet Witch’s powers was one of the reasons the Sokovia Accords were written. People didn't know what she could do, so they feared her.</p>\n<p>“But my hammer…” Thor drifted off. He was still upset about not getting to show it off. The other three heroes chose to ignore him.</p>\n<p>“In order for this to work, I will need a volunteer.” Wanda said to the class. There was only one person who didn't raise their hand. Even Mr. Larson and Katelyn raised their hands, and they weren't even supposed to participate. It was a chance to get close to an actual Avenger! Who wouldn't want to do that? Well, Peter wouldn't. He completely understood his friend’s abilities, and he'd rather if she didn't notice him at all.</p>\n<p>Wanda looked through the crowd on the other side of the glass wall, skimming through all the different faces. Her eyes hovered on Peter’s, and he could see a glimmer of mischievousness in them. That was never good news.</p>\n<p>“Pick me, witch lady!” One of them begged. MJ rolled her eyes as Flash waved his hand around in the air to get her attention.</p>\n<p>“Sure, just call me ‘witch lady’ one more time.” She threatened the obnoxious kid. He didn't seem to understand that she wasn't being literal.</p>\n<p>“No problem, witch lady!” He used the offensive nickname again. Wanda visibly pursed her lips into a thin line.</p>\n<p>“Alright, come over here.” The young woman said, gesturing for him to enter the room through the door. Flash did so, an excited smile on his face. He looked over at Peter as if to rub it in his face that he’d gotten picked and Peter hadn’t. It was hilarious that he was oblivious.</p>\n<p>Wanda told Flash to stand in a certain place in the room. The boy was happy to do so. A miniscule amount of magic swarmed around Flash’s head. Only Peter could see it, because he had impeccable eyesight due to the spider bite. Wanda slowly walked towards Flash, her heels clicking with every step she took.</p>\n<p>“I'm glad you think I'm hot.” She told him. Flash’s face visibly paled several shades. It was clear now that Wanda was reading Flash’s mind. The boy tried to take a step towards the door to the hallway, but the red magic flowed to the front of his body and held him back. Flash looked just short of terrified.</p>\n<p>“What do you say to someone you're mean to?” Wanda asked him, a fake sweetness in her voice. Flash mumbled something so quietly that even Peter couldn’t hear it.</p>\n<p>“Say it louder please.” She instructed Flash.</p>\n<p>“I'm sorry.” The boy apologized to her more loudly. The magic faded from view as it swirled away from Flash. He took no time in rushing to the door, and back into the hallway with the rest of his class.</p>\n<p>“I don't take kindly to disrespectful people.” Wanda warned the rest of the group. “Are there any other volunteers?”</p>\n<p>There were less hands raised this time, but only by a few. Everyone else still seemed eager to be with an Avenger. Wanda’s eyes caught Peter’s once more. The woman pretended to consider everyone else in the crowd, but then looked back over at Peter.</p>\n<p>“Young man in the back, step on up!” She said, pointing to Peter. He had totally seen this coming. He mentally groaned, preparing himself for the worst as he stepped onto the mat.</p>\n<p>“Привет, маленький паук.” Peter heard Nat whisper only loud enough for him to hear. He wasn’t sure he was going to enjoy this. Natasha only ever called him that when she was going to do something he didn’t like. She’d said “hello little spider” in Russian.</p>\n<p>“So, what you all just saw Wanda do was telepathy and energy manipulation, which are both psionic powers. Wanda got her powers from the exposure of cosmic energy from the mind stone. Because of this, all her powers are psionic.” The assassin educated them. Peter was still awkwardly standing in the middle of the mat.</p>\n<p>“Wanda also has telekinesis...” Nat said, starting the list. Peter felt himself lift off the ground and flip in the air. It felt like someone was holding him by the ankle, but nobody was. Wanda was using her magic to hold Peter upside down by the ankle in midair. There was a glowing red surrounding his ankle.</p>\n<p>“...flight…” The woman carried on. Wanda put Peter back on the mat. He sat up, and watched as Wanda floated into the air. Her magic was swirling all around her form.</p>\n<p>“...psionic force field generation…” Scarlet Witch landed back down on the mat next to Peter. She turned to Thor.</p>\n<p>“Do you want to show them your hammer now?” Wanda asked the Asgardian. He perked up a little bit.</p>\n<p>“Yes, I’d love to!” Thor exclaimed.</p>\n<p>“Great. Throw it at me.” She instructed him. His face fell. “Do it, Thor.” Wanda said more firmly as she noticed the man’s hesitation.</p>\n<p>He threw the hammer, and when it hit Wanda, it made a loud pinging sound. The area where Wanda was hit flickered red, but otherwise she was perfectly fine. The hammer fell to the ground on the mat. After Thor recovered from his shocked reaction, he summoned it back to him and placed it beside him on the floor.</p>\n<p>“...and mental manipulation.” Nat finally finished. Wanda looked back down at Peter, who was still sitting on the mat. He took a deep breath, and hoped for the best. The class watched as Peter went from looking up at the Scarlet Witch, to laying completely sprawled out on the mat, snoring loudly.</p>\n<p>The whole class laughed, especially Flash. It was very funny to see the normally composed Peter Parker sleep in such a crazy position. Ned almost felt bad for his friend, but he knew after a while Peter wouldn’t care about what happened today anyways. MJ didn’t feel any guilt at laughing at her boyfriend. In fact, she already had a sketch of him in crisis from when he first went into the room.</p>\n<p>“Alright, now that we’re finished here, my idiot brother will lead you all back downstairs.” Loki strictly spoke, queuing for Thor to lead them towards the elevator. The Asgardian didn’t notice it until Loki nudged him, or elbowed him, hard in the ribs.</p>\n<p>“Oh! Yes! This way children of Midgard!” Thor lead them all back the way they came. The group seemed upset to leave the private training room, for obvious reasons. As grand as the first floor was, it was nothing compared to the Avengers’ training room.</p>\n<p>“I don’t want to go, Mr. Stark!” Shouted a voice. It was Peter, who was still sleeping on the mat. His class was giving him weird looks, especially MJ.</p>\n<p>“I don’t want to go to school!” Peter unconsciously elaborated. In between words was incoherent mumbling.</p>\n<p>“I don’t want to go!” Mumbling. “Chemistry class…” More mumbling. “...my teacher…” More mumbling. “...so boring…” Peter finished after some more mumbling.</p>\n<p>Mr. Larson looked downright offended. The students looked ready to burst with laughter. They could all agree on that aspect at least.</p>\n<p>Ned was looking back at Peter on the other side of the glass wall. Should he wait for his friend? Should he stick with MJ and the rest of his class?</p>\n<p>Wanda seemed to sense his uncertainty. “We’ll bring Peter back in a little while.” She assured the class. Only Flash, Ned, and MJ noticed that nobody ever told Wanda Peter’s name.</p>\n<p>“That wasn’t as bad as you were making that out to be, Loki.” Thor told his brother as the elevator doors closed. Loki didn’t reply back.</p>\n<p>It was another slow trip down to the first floor. At least they didn’t stop at all this time. You could see Loki’s frustration with his brother showing on his face, but other than that the sibling rivalry didn’t come up.</p>\n<p>The elevator dinged and the doors slid open, revealing lots of men with lots of cameras, and tons of commotion and loud noise.</p>\n<p> — — —</p>\n<p>“Petey Petey, wakey wakey.” Wanda calmly spoke as she gently shook Peter. He wasn’t waking up. She eventually gave up with being nice and began harshly shaking his shoulder.</p>\n<p>“Wake up! I did not put you under a very strong sleep spell.” Wanda said to no one in particular.</p>\n<p>“He doesn’t get as much sleep as he tells Tony.” Natasha said from behind her. Wanda could see the softness in her eyes.</p>\n<p>What was it with this kid that brought out everyone’s gentle side? Why did he make the most irresponsible people act paternal? Peter had nearly all the Avengers wrapped around his fingers.</p>\n<p>Even Nat. She had Peter sitting up, and was rubbing circles on his back. Her other hand was combing through his curls, which weren’t normally there. Whenever Wanda saw Nat like this, she always thought the woman would have made a wonderful mother, despite Nat’s own opinions. Her expression was just so loving in these moments.</p>\n<p>The two watched as the young boy slowly stirred. He was definitely tired, and he looked like a child as he used his fists to rub his eyes. Peter yawned and moaned, then leaned back against Natasha.</p>\n<p>Wanda knew that if Peter was awake enough, he would never be doing this. Maybe that’s the realization that brought the soft smile to Nat’s face. She continued rubbing circles onto his back and Wanda watched the two for several minutes.</p>\n<p>Then of course Friday had to interrupt their scene.</p>\n<p>“I was told to inform you that King T’Challa and Princess Shuri have arrived.” The AI told them.</p>\n<p>Peter was now wide awake. His eyes were wide and he scrambled to his feet.</p>\n<p>“What?”</p>\n<p>“What did Friday just say?” Peter exclaimed. His spider sense had tingled in his sleep. That was when he first discovered that he had been sleeping. Then he heard Friday speak.</p>\n<p>“I guess the royal family of Wakanda came.” Natasha repeated for the AI. Peter looked panic stricken.</p>\n<p>“No no no. This is not good.” Peter said out loud, but to himself. The boy felt paralyzed.</p>\n<p>“You might not even see her, Peter.” Wanda pointed out.</p>\n<p>Peter considered it. That might be true, because the princess often came to help Tony with projects or give him access to other resources. When Peter first met Shuri, that had been the reason she was there.</p>\n<p> — — —</p>\n<p>Mr. Stark had asked Peter to work on the new coms in his suit. They were nearly the same as the older ones, but these adjusted to Peter’s hearing sensitivity. It was generally different by the time and day, which was something Mr. Stark didn’t know when he first made Peter the suit.</p>\n<p>So he’d come straight from school in order to work on the newer coms. Mr. Stark couldn’t really help him with coding it to right volume. It would be hard considering the man didn’t have super hearing.</p>\n<p>Speaking of his super hearing, Peter could pick up the quiet sound of someone mumbling song lyrics. The person seemed to be nearby, and they were coming closer by the second. It really didn’t sound like Mr. Stark, and Peter couldn’t identify the voice.</p>\n<p>He made a split second decision and hid behind the couch in the lounge section of the lab. He watched as the unidentified person strode into the lab with a bounce to her step as she softly sang. Now that she was in the room, Peter could tell it was God’s Plan by Drake.</p>\n<p>What were they doing here? Why is this person in Mr. Stark’s private lab? As far as Peter knew, he and Dr. Banner were the only ones that Mr. Stark allowed in this lab. The situation seemed sketchy. But at least she had good taste in music.</p>\n<p>The girl had dark hair that was braided and twisted into two buns on the top of her head. It reminded Peter of Mickey Mouse a little bit. She wore an assortment of jewelry that mostly consisted of beads. The girl was definitely pretty, but she wasn’t Peter’s type. Plus, he liked MJ anyways.</p>\n<p>The weird thing was that the girl wasn’t being discreet. She was loudly moving around and using Mr. Stark’s tools and equipment. She didn’t appear to be looking for anything in particular. A little device was in front of her, and she was just working on whatever it was. It seemed like she was allowed in here with the way she acted.</p>\n<p>He tried to inch closer to get a better look at the mystery girl, but his foot caught onto something in the process. Peter heard a crash and turned around. Dum-E was on the ground, but thankfully not broken. Mr. Stark wouldn’t have been happy about that.</p>\n<p>“Dum-E!” He shouted in worry. The friendly robot beeped in distress. Peter carefully picked him up and set him on the desk he was on before.</p>\n<p>“Were you talking to me or to yourself?” The girl asked him. She was still steadily working on the device from before.</p>\n<p>“I was talking to the robot.” Peter hesitantly answered.</p>\n<p>“Ok, so then you’re definitely a dummy.” She assumed.</p>\n<p>“Hey!” He yelled in defense. Dum-E also let out some beeping in protest.</p>\n<p>“Relax, I was just playing with you.” The girl said, smiling. When Peter didn’t say anything, she continued. “Some man in the vents was telling me about Stark’s kid. That’s you, right?” She asked him.</p>\n<p>Peter rapidly shook his head. “No. Mr. Stark doesn’t have a kid. I’m not sure why Clint told you that.” He confidently answered.</p>\n<p>The girl smiled again. “Well, I’m sorry to break it to you, but you’re definitely Stark’s kid.” She informed Peter. The boy started stuttering.</p>\n<p>“I’m Shuri, by the way.” The girl told him.</p>\n<p>“I’m Peter.” He replied back. Realization sunk in and Peter’s eyes grew wide. “Wait! You’re Princess Shuri from Wakanda?”</p>\n<p>“I don’t think there are any other people named Shuri, so yes. But don’t call me ‘Princess Shuri of Wakanda’, it makes me sound fancy and proper.” Shuri confirmed. She switched to a British accent as she said fancy and proper.</p>\n<p>“So Mr. Stark let you in here.” Peter reasoned.</p>\n<p>“No. He thinks I’m working in some boring lab he showed me. This actually has cool stuff in it.” Shuri corrected.</p>\n<p>“I don’t think Mr. Stark will –” Peter began before he was cut off.</p>\n<p>“What’s he going to do? Kick me out? I’ll just find another way in later.” She said. “It’s better to ask for forgiveness than for permission.” Shuri quoted.</p>\n<p>“I guess so…” The boy trailed off. He walked back over to the station he was working at. Peter still had to adjust the right volumes for his different sensitivity levels.</p>\n<p>The two worked in silence for a bit. They weren’t ignoring each other, they were just concentrating on their own tech. Peter wasn’t sure what to make of Shuri, she was definitely different from what he imagined. She didn’t act like a princess at all, and Peter liked that.</p>\n<p>At some point Peter heard the sound of an electrical shock. Shuri hissed and held her left index finger and shook it to ease the pain.</p>\n<p>“This is so sad. Friday, play Despacito.” Instructed Shuri.</p>\n<p>The AI did as told, and Peter couldn’t help but burst into laughter. Shuri fake cried, using her hands to “wipe away tears”.</p>\n<p>The two spent hours showing each other memes and recreating vines. Lots of the tools and furniture in the lab were either used or moved, so the place became a mess. The two didn’t care at all.</p>\n<p>Tony woke up from his midday nap a while later to discover the two there. He wasn’t pleased, to say the least, but he also hadn’t had his coffee yet, so it was a tough call.</p>\n<p> — — —</p>\n<p>Peter spent a while thinking about possible scenarios now that Shuri was in the tower. There wasn’t any reason to worry about King T’Challa. But Shuri wouldn’t understand how much it would embarrass Peter.</p>\n<p>“We promised your friend that we would bring you back to your class.” Nat informed the kid. She watched him closely as he tried not to panic too much.</p>\n<p>“Can I wait just a few more minutes?” Peter begged her. Natasha thought about it. She didn’t like forcing him into anything. But she and Wanda had other things to do that day too.</p>\n<p>“Just a few. Wanda and I have to go somewhere, so you’ll have to ask Friday where they are.” Natasha told him, with Wanda still watching.</p>\n<p>“Thanks!” Peter said to the two women. They got up and walked over to the stairs. Apparently they were choosing the hard way to get around the tower. Or maybe they were trying to avoid some of Mr. Stark’s employees.</p>\n<p>Peter was relieved. Now nobody would have to see him with Wanda and Nat any longer. He loved the two ladies, they were like family, but he didn’t want people to know that.</p>\n<p>He took some deep breaths to prepare himself for what might happen. He might as well leave now. He’d probably run into Shuri no matter what he did. It seemed inevitable.</p>\n<p>As Peter was about to leave the training room and go back into the hallway, he caught sight of Thor’s hammer. It was just lying in the middle of the room, just outside the mat. Wouldn’t Thor want that in a less obvious place?</p>\n<p>On his way out, he picked up the hammer and placed it closer to the wall of the room. Now it wouldn’t be lying around. Thor would still be able to find it if he came looking.</p>\n<p>“Where’s my class, Friday?” Peter asked the helpful AI.</p>\n<p>“They are heading to the second floor soon, so you should wait there.” Friday suggested.</p>\n<p>He may as well. No need to go to the first floor just to go up another. There was no harm in that. Peter pressed the button for the second floor, and waited a few minutes as the elevator slowly descended. There were a ton of floors in this tower.</p>\n<p>There was a ding and the doors slid open once more. Peter stepped out and sat in one of the nearby chairs. This way he could see the elevator and would know when his class came. Peter leaned back and relaxed as he waited, he was still sleepy from his unwanted power nap.</p>\n<p>He’d have to talk to Wanda about that later. Peter wasn’t fond of falling asleep in front of his class without consent. It could have been much worse, Peter knew, but that still doesn’t mean he has to like it. However, that was for a different time, maybe when he came back here after he went back to school at the end of the day. That part was slightly annoying too.</p>\n<p>As Peter got lost in his thoughts, a door nearby opened, which Peter didn’t notice. It was one of the squeakier doors in the tower, so it definitely made noise as it opened.</p>\n<p>A young woman stepped out, her phone in hand. Unlike the last time she’d been here, her hair was twisted into a bun, with the rest hanging down her back. She’d been wearing a dress just moments ago, but now she wore a normal outfit for the average teenager. The press didn’t go easy on her at all, especially now that Wakanda wasn’t a secret anymore. The world wanted to know every little aspect of it.</p>\n<p>Shuri noticed the boy, now nearly asleep, in the chair. A smile of excitement spread across her features, and she nearly bounced on top of him.</p>\n<p>“Peter!” She shouted, running over and squishing him in her hug. “I haven’t seen you in so long!”</p>\n<p>“Shuri, I can’t –” Peter started explaining. The girl seemed to pick up on what he was saying very quickly.</p>\n<p>“Oh! Sorry Peter.” Apologized Shuri.</p>\n<p>Peter was thrilled to see his friend, but now was not the time. He prayed his class wasn’t coming up too soon.</p>\n<p>“What are you doing here?” Peter asked.</p>\n<p>“Tony said that he wanted to work more on the Accords with my brother, so I decided to come along!” Shuri told him excitedly. She couldn’t wait to hang out with Peter for the next few days!</p>\n<p>“That’s great! Did I ever show you the upgrades I made to my suit?” Peter asked her. He couldn’t remember if he’d said anything the last time they talked through video chat.</p>\n<p>“No, I don’t think so.” Shuri responded.</p>\n<p>“Really? Well, it has –”</p>\n<p>“I was kidding! You’ve told me maybe a hundred times!” The girl explained to Peter.</p>\n<p>“Oh.” He paused in thought. “Did I show you my new R2D2? I also have the structure pieces done for BB8, but his code and wiring aren’t done yet.” Peter rambled.</p>\n<p>“You made Star Wars droids? How did I not think of that? Have you made C-3PO yet? We could make a version of him too!” The girl reacted.</p>\n<p>“I haven’t gotten there yet. We didn’t even have time to finish remaking all those vines from last time! And now there’s more memes!” The teen reminded her.</p>\n<p>“I know! I never got to do the mannequin challenge when it was a thing, we need to do that! You should get your Avenger buddies to do it with us, it would go viral!” Shuri suggested.</p>\n<p>“I’m not sure if I could get the Avengers in on it, I can’t see Nat doing that sort of thing. But I bet we could set up some holograms and it would look the same!” Peter brainstormed.</p>\n<p>“Yeah! We could use the holograms to make the Avengers do the ‘in my feelings challenge’ too!” Said Shuri in excitement.</p>\n<p>“And the zoom challenge! Ned and I did that one, but I haven’t gotten to do it with you yet!” Peter added. He was going to bring up the ‘you’re so precious when you smile’ videos, and mention the one he did with MJ. Unfortunately, Shuri spoke before he could.</p>\n<p>“There’s a bunch of people staring at us.” She pointed out. Peter whipped around to see his whole class behind him.</p>\n<p>This was exactly what he’d been trying to avoid. Now everyone had seen him with Shuri. They already saw him with Thor and Loki, but Shuri was the princess of Wakanda! Not that being a god was unimportant or anything.</p>\n<p>Flash was glaring daggers at Peter. Ned was awestruck, and Peter remembered their conversation from earlier that day. He wondered if Ned would actually try to ask Shuri out. MJ had her “crisis notebook” out again. That probably meant that he looked terrified. The rest of their group looked confused.</p>\n<p>Finally, Ned spoke up. “You talk to the princess of Wakanda about me?” He managed to squeak out. Ned looked ready to pounce on Peter for a hug.</p>\n<p>“Are you Ned?” Shuri asked the boy in the crowd who had spoken.</p>\n<p>“Yes.” Ned squeaked out again, shocked that Shuri was speaking to him.</p>\n<p>“We need to hang out sometime! You’re the one who hacked into Peter’s –” The girl almost slipped up.</p>\n<p>“Yes, great idea! You two should totally spend some time together.” Peter agreed. He couldn’t believe Shuri had almost spilled his secret. That would have been really bad.</p>\n<p>A buzzing sound was heard from Shuri’s direction. She pulled out her phone from the back pocket of her shorts and looked at the screen. She apparently received a message.</p>\n<p>“T’Challa says I have to go up to the penthouse. You’ll be coming up later, right?” The girl asked Peter. He nodded in confirmation. Shuri turned to leave for the elevator, pocketing her phone.</p>\n<p>Flash looked about ready to burst. His face was bright red, similar to the ripe tomato look he’d been sporting on the bus earlier. It slightly worried Peter, but he doubted Flash would do anything with Shuri nearby. Apparently his assumption was wrong.</p>\n<p>“How do you know Penis? It’s not like he even deserves to know you.” Flash exploded.</p>\n<p>Every head turned towards him, including Shuri’s, which people noticed. They were all afraid for her reaction. Flash’s eyes went wide. He apparently realized his mistake too late.</p>\n<p>“I’m sorry, I didn’t get that. I don’t speak BS.” Shuri harshly told him.</p>\n<p>Her face was tight, and her teeth were clenched. Their faces were only inches apart, and since Shuri was taller, it was very intimidating. Flash appeared to be shaking.</p>\n<p>“Peter is one of my closest friends because he’s a genuine person and is nice to everyone he talks to. If anything, I’m the one who doesn’t deserve to know him.” She paused, making it dramatic and increasing the tension. “I can talk to him about things that other people don’t understand because he’s such a nerd.” That didn’t come out exactly the way Shuri meant it to.</p>\n<p>“That might be a little advanced for your vocabulary. It means he’s actually smart, unlike you.” She explained. That was what she’d meant before. But boy she was angry. Shuri couldn’t believe the nerve of that kid to talk about Peter like that!</p>\n<p>“If I hear you say something like that to Peter again, then you’ll have to deal with an angry Tony Stark. Even I don’t know what that looks like.” Shuri threatened.</p>\n<p>She still didn’t leave. The girl shook her head in disbelief, she couldn’t even fathom someone disliking Peter.</p>\n<p>“I don’t have enough middle fingers to express myself to you.” Shuri stated.</p>\n<p>She turned around back towards the elevator. Shuri jammed the button for the penthouse floor in anger. The doors eventually closed, but it felt like an eternity.</p>\n<p> — — —</p>\n<p>Tony Stark waited for the young princess to arrive. Friday had informed him when she and Peter had found each other down on the second floor. That part hadn’t even been part of his plan, but it was even better!</p>\n<p>Tony didn’t hear about the rest of what happened, so he was waiting for Shuri so she could tell him. The doors to the elevator opened with a ding and out stepped T’Challa’s sister. Except, she didn’t seem quite the way Tony expected her to be.</p>\n<p>She looked downright furious. Her hands were balled into fists. He recalled her saying it was like “Arthur’s fist” when someone did that. Her jaw was also clenched tight.</p>\n<p>What could have made her so angry while she was with Peter? It was unlikely that the two had fought, but Tony didn’t know what would upset her like that.</p>\n<p>“Yikes, what happened down there?” He questioned her.</p>\n<p>Shuri was very tempted to tell Tony what had transpired downstairs. However, she knew Peter wouldn’t want people knowing, especially Tony, so she decided to stay silent. She also told that useless turd she would tell Tony only if he did it again. But she wasn’t doing it for him, only for Peter.</p>\n<p>“Some of the press was very frustrating.” She answered him.</p>\n<p>Tony seemed like he wanted to talk, but Shuri was not in the mood for it at the moment. She walked straight past him, towards the first open guest room. It left Tony confused, but he wasn’t about to deal with an angry princess.</p>\n<p>He still wondered what could have made her so mad. Normally the press wouldn’t bother her so much, so he wasn’t falling for that lie. He’d have to keep a closer eye on Peter.</p>\n<p> — — —</p>\n<p>Natasha had watched Shuri come in the penthouse fuming and looking enraged. That emotion was not often present within the young girl. Nat had heard her excuse and instantly knew it was a big fat lie. That made her very suspicious.</p>\n<p>Natasha was currently watching the video footage of Peter and Shuri talking. It wasn’t anything to worry about, just teenager talk. That is, until Peter’s class saw them there.</p>\n<p>She watched the interactions, which seemed to be fine. Then Shuri was leaving. Nothing was wrong, she didn’t even look angry.</p>\n<p>Then that jerk spoke up. Nat immediately understood Shuri’s reaction. She would have acted differently, probably lock him in a neck hold and threaten him worse. For the most part though, Shuri had reacted perfectly.</p>\n<p>She also understood why Shuri didn’t tell Tony. She and Peter were friends, and she valued that and wanted to protect it. Natasha wasn’t going to hold anything against the princess. But that doesn’t mean that the assassin has to do the same.</p>\n<p>Nat used Tony’s tech to find the boy’s identity. His name was Flash Thompson. She instantly hated the name.</p>\n<p>Natasha was going to give Flash one heck of a field trip.</p>\n<p>“You guys should take a look at this.” Natasha said aloud to the team.</p>\n<p>They were all lounging in the living room. Clint and Sam were still video gaming, with someone else joining them here and there. Tony was actually taking a break from being in his lab, but only to get some more coffee. Rhodey must have just woken up, because he was eating a late breakfast. Wanda was reading a book, apparently in Sokovian. Bruce was nowhere to be seen, but maybe that was for the best. Steve was back to his sketching, and he must have been drawing Bucky because he was sitting aesthetically in front of the window.</p>\n<p>All the heads turned to look at Nat, except for Sam’s and Clint’s. That was not acceptable. The assassin took the remote from its spot on the coffee table and turned the TV off in the middle of their game.</p>\n<p>“I was just about to get robo-bird over there! He was nearly in my grasp!” Shouted Clint in protest. Nat gave him a stern look, and he immediately shut himself up.</p>\n<p>Everyone set their things down, except for Tony with his coffee, and followed Nat. She let them to the private room she was in earlier. They were all curious as to why she was upset like Shuri had been only minutes before.</p>\n<p>“Friday, play the video recording I was just watching.” She ordered the AI. She dutifully complied, pulling up a large hologram in the middle of the room so everyone could see.</p>\n<p>They watched the end of Peter and Shuri’s interaction and Shuri beginning to leave. They heard that douchebag make the comment about Peter, their Peter. They saw the way Shuri handled it, throwing insult after insult. That kid deserved it.</p>\n<p>As the video played, the team’s expressions changed. Gone were the joyful moods from video games, or the calm moods from reading or drawing peacefully. The Avengers, the earth’s protectors and mightiest heroes, were angry. Bad things happened when the Avengers were angry. They avenged.</p>\n<p>“Friday, play that one more time.” The billionaire instructed. The AI did as told, replaying the entire scene.</p>\n<p>The disbelief that had been present in the room died down, and adrenaline replaced it. Even though Shuri had taken care of that particular situation, they couldn’t let something like that happen again.</p>\n<p>“Send this to Pepper, and make sure she watches it, Fri.” Tony half growled out. His AI didn’t deserve that tone, but he was too upset to care at the moment.</p>\n<p>“Ms. Potts is currently watching the video.” Friday announced.</p>\n<p>“Wonderful, then she’ll understand why that prick will be waiting on the sidewalk instead of taking the tour.” Tony started walking towards the elevator.</p>\n<p>“Wait.” Natasha commanded him. It was a dangerous move considering how furious he was. Tony turned back around to look at her. “We should come up with a plan of attack.” She suggested.</p>\n<p>“Don’t say your plan is to attack.” Steve told him, recalling their first mission together.</p>\n<p>Tony sighed in defeat. “Alright. But we better make this quick.” Everyone looked to Nat for instructions.</p>\n<p>“Do the honors, Cap.” She said to the super soldier. And they began planning.</p>\n<p> — — —</p>\n<p>“Alright, let's continue the tour.” Katelyn announced, interrupting the silence. She went back in front of the group so she could lead them all again.</p>\n<p>“The next place I will show you is –” Katelyn was cut off.</p>\n<p>“The conference room.” Pepper Potts informed them. Katelyn saw the tall woman standing beside her and glanced up with a confused expression. People kept interrupting her tour, and she didn’t know what to do about it.</p>\n<p>“Hello Midtown Science. As I’m sure you all know, I am Pepper Potts, the CEO of Stark Industries. I’ll be your tour guide for the rest of the day.” She announced with a friendly smile. Then she faced Katelyn. “You don’t have to stay here with them, go ahead and work on your project.” Pepper said, releasing her. The intern nodded and walked off in a different direction.</p>\n<p>Peter was frightened, and that was an understatement. He wasn’t sure what had just occurred upstairs. Shuri may have told them about Flash, but he didn’t think so. She understood and respected the friend code well enough not to do that.</p>\n<p>But, despite what happened, the team knew about Flash. Peter had no idea what they would do. He didn’t want them to pick on Flash, even though he highly disliked him (because hate is a strong word). Also, if the team picked on him, Flash would bully Peter even more when the others weren’t around. There were just no benefits to whatever they were doing.</p>\n<p>MJ seemed to disagree. She was grinning, and it didn’t look innocent. MJ hated Flash, probably more than he did. Knowing her, she was probably excited for what was coming up. She’d also probably have a few more sketches in her “crisis notebook” after the trip.</p>\n<p>As they walked, Peter could feel Flash’s gaze on him. He didn’t doubt that his glare would send lasers through Peter’s head. It was honestly a little freaky. When Peter turned to look at Flash, he snapped his head in the other direction, as if pretending he wasn’t just trying to stare Peter down moments ago.</p>\n<p>Peter didn’t feel any better when they finally got to the conference room. His spider sense was tingling, and that was never a good sign. So far today it was only going off when there was an Avenger nearby.</p>\n<p>The room was fairly comfortable. The floor was covered in carpeting, and while it wasn’t soft, it gave the room a relaxing aura. There was a large table in the center of the room, with at least a dozen chairs surrounding it. The chairs were soft, as opposed to the leather that sticks to your legs, and were spinny. Behind the head of the table was a whiteboard. It was clean at the moment, but you could still see the leftover ink that didn’t come off when it was wiped. A hologram projector sat at the head seat at the table.</p>\n<p>“You can all have a seat in front of the whiteboard.” Pepper instructed them sweetly. She quickly noticed there wouldn’t be enough space for everyone in that section.</p>\n<p>“Peter, would you mind helping me move these over?” The woman asked, as she walked towards the table and chairs.</p>\n<p>“Yeah, uh, sure.” Peter said with uncertainty. He was very conscious of the eyes watching him. Why would Pepper Potts know him? Then again, Steve, Thor, Loki, and Shuri had all known him too.</p>\n<p>He helped Pepper roll the chair in a corner and lift the table into another corner. Everyone who hadn’t taken a seat before now sat down. Peter took a seat next to Ned and MJ.</p>\n<p>Pepper walked up to the front of the room like a teacher would. “We have a special guest here to talk to you guys today! Let me introduce you to Steve Rogers, or better known as Captain America!” The woman announced to the class.</p>\n<p>And with that, the super soldier walked out carrying a chair and wearing his bright spangly outfit.</p>\n<p> — — —</p>\n<p>May couldn’t concentrate the way she usually could at work. The business of it all generally pushed away any stray thoughts. It had really helped her when she was recovering from Ben’s death.</p>\n<p>But the thoughts that were bouncing around in her mind right now weren’t stray. She was thinking about Peter. May was wondering if Tony was keeping his unofficial promise. She hoped that Pepper would at least keep him from doing anything drastic. A little bit was okay though, that was why she called Tony in the first place.</p>\n<p>When she finally got on her lunch break, she decided to give Pepper a call. It was probably fine, but May wanted to be prepared in case something happened.</p>\n<p>She waited a few seconds before Pepper answered. “Hello May. Is something wrong?” The woman asked her.</p>\n<p>“No, I was just checking up on Peter.” She informed Pepper. “I wanted to make sure Tony’s not bothering him too much.” May clarified some more.</p>\n<p>Pepper thought about how to answer that. She could tell May what was going on and how Flash was bullying Peter. That would be the right thing to do. But Pepper knew that Peter might not trust her and Tony the same way after that, and he certainly wouldn't tell them when this sort of thing happened again. She didn't want to lose May’s trust, but Peter was both of their priorities, so in the end, not telling May was the better option.</p>\n<p>“Don't worry, Tony isn't bothering Peter at all.” Pepper assured the protective aunt as she watched Steve enter the room Peter's class was in.</p>\n<p> — — —</p>\n<p>Peter froze. Of course this was going to happen. Stuff like this happened to Peter all the time. It was just part of his “Parker Luck”. He guessed he would just have to sit through it.</p>\n<p>Cap put the chair down backwards and sat down on it facing the class. He was using the back of the chair as an armrest. This reminded Peter of his time in detention and the Captain America fitness challenge.</p>\n<p>“So, you’ve been caught in a tough situation. Someone is bothering you, and you’re not sure what to do. Trust me, as a man that’s been living as long as nearly a century, I know what bullying is like.” He started lecturing them. The righteousness in his voice was unbelievable. It also sounded incredibly fake.</p>\n<p>Of course he would make up another PSA. At least Peter remotely knew what they were doing. And they definitely heard Flash’s comment. There was no question about that now. Honestly, Peter was surprised that a PSA on bullying hadn’t been made earlier.</p>\n<p>“The best thing you can do is ignore the person. Usually, they’re just jealous. If they ask you for something, just say no. Most of the time, the person will stop after you take those steps.” Captain America instructed them.</p>\n<p>Through most of this, Peter was trying not to get too embarrassed. But he was partially listening to Cap talk. Peter had actually done most of these things when Flash was being annoying.</p>\n<p>“However, if they won’t leave you alone after this, it’s time to take another course of action. It’s best to talk to your parents first, but if you can’t do that, then talk to your teacher. Sometimes you might not be comfortable talking about this to your family or teacher, but you should still talk to someone.”</p>\n<p>It almost seemed like Steve was calling him out. In fact, he probably was.</p>\n<p>“When I was in school, I was able to talk to my best friend and his family about my problems.” Cap confessed to everyone.</p>\n<p>Bucky took that as his que to enter. He was dressed in a version of his old officer uniform. It didn’t really go well with his metal arm, but it would have to do. Both his and Steve’s outfits were just costumes.</p>\n<p>“Hello, I am Sergeant Barnes, or better known to my friends as Bucky.” He said as he walked up next to Steve. He had entered through a side door like Cap had earlier, so people didn’t know he was coming.</p>\n<p>It seemed like he had especially caught Peter off guard. His eyes were wide as he watched Bucky. The kid didn’t look excited to hear what they were saying. Bucky didn’t care, this stuff was important for Peter to hear, and for that Thompson kid.</p>\n<p>“Before I joined Cap in fighting for our country, we were best friends. Because of this, I knew that a lot of bigger and stronger men liked to bully him and beat him up. But I could help Steve, so together we would stop them.” Bucky explained.</p>\n<p>Captain America looked Flash dead in the eyes. “But even then, I wasn’t afraid to punch a bully in the face.”</p>\n<p>They watched as Flash’s face paled several shades. That kid ought to be scared, the Avengers were out to get him. Steve’s threat was also not a light one. He was a super soldier after all.</p>\n<p>The two Avengers left the room, leaving the class in silence. Pepper stepped back up to the front of the room to address the group. “I think now is a wonderful time for your lunch break.” She told them.</p>\n<p>Pepper’s expression was smug, but it was almost impossible to tell. To someone who didn’t know her, she would just seem like a very happy lady. But to Peter, it was her victory face.</p>\n<p> — — —</p>\n<p>Tony was looking through all the security footages from Peter’s school. He was skipping through all the parts that didn’t have either Flash or Peter in them. Everything else was deemed unimportant from Tony’s point of view.</p>\n<p>“Have you found anything?” Clint asked him. Everyone was worried about the kid.</p>\n<p>“It seems like Peter’s been putting up with this guy since their freshman year.” Tony answered.</p>\n<p>It was true. In their very first class, Flash decided to pick on Peter. They hadn’t even known each other then and he was already on his kid. At least Ned was with Peter through the thick and thin of it.</p>\n<p>Tony could hear Rhodey sigh next to him. “That kid has gone through way too much.”</p>\n<p>The billionaire knew that he didn’t just mean as Spider-Man. Too much of his family had died too. His parents died when he was only four, and then his Uncle Ben had passed away just after Peter was bitten. That alone was a lot to handle.</p>\n<p>That was one of the reasons that Tony let Peter get close to him. Before, he was certain he would be a terrible mentor and role model, and would have shut down the idea of being either of those to someone so young. But after meeting Peter, Tony realized that mentoring him was better for the kid than having nothing. He still never imagined the kid would get so involved in his life and would eventually get his own room in the tower.</p>\n<p>Watching the feed broke Tony’s heart. There were days when he remembered that Peter was going through a rough time, and it seemed like Flash teased him about it.</p>\n<p>Like the day after homecoming in their sophomore year. Apparently Flash had heard that Liz’s dad gave him “the talk” before the dance started, and that Peter disappeared shortly after. The recording showed Flash bullying Peter for being weak and too afraid to face someone’s dad. It made Tony feel sick.</p>\n<p>Another of these scenarios happened just later that day. They were doing weights in gym, and Peter was using some sort of equipment where you have to lift the bar over your head. The kid had set it on really heavy weights and was struggling to lift it. Peter began hyperventilating, and was soon excused from the class. When he came back, Flash teased him for “having the strength of a girl”. Tony remembered Peter telling him that the Vulture trapped him under the rubble of a building and he had to lift it up to escape.</p>\n<p>Tony really wanted to bash this guy’s head open for hurting Peter. Most of the time his comments were short lived and didn’t mean anything. But, there were other times when he would make a comment that hit home.</p>\n<p>He didn’t fully understand why Peter hadn’t told him earlier about Flash. Tony knew that telling someone was stressful, and that Peter wouldn’t want Tony to do anything about it. But why didn’t the kid just tell him that?</p>\n<p>There was no way that Tony could do nothing, but he could certainly make his actions little enough not to be noticed. He could simply make a few calls to Peter’s teachers and tell them to keep an eye on Flash and Peter. They didn’t even have to know he was Tony Stark!</p>\n<p>And sure, usually laying low like that wasn’t his forte, but for Peter, he would do it.</p>\n<p>Except now, Flash had made him mad. And there was no way to convince the others not to carry out their plan.</p>\n<p>Pepper lead the class away from Steve and Bucky, and in the direction of the eating area. Peter knew that there were two. One was inside near the entrance area, and the other was an outdoor courtyard. Pepper was leading them to the courtyard.</p>\n<p>It was a quaint place. There were bushes and shrubs, as well as trees and flowers along the edges. There were a few round picnic tables with umbrellas in the center for shade. It wasn’t huge, but it was reasonably sized and comfortable for relaxing.</p>\n<p>Some people were already there. Many of them were interns, but there were also small groups of business men dressed in fancy attire. The other school group that Peter had seen at the entrance was there eating their own lunches.</p>\n<p>Peter’s class all chose a place to sit down and eat. Since a lot of the places to sit were already taken, they had to sit in the grass. In the permission slip, everybody was told to pack a lunch. Most people had brought one in a brown lunch bag.</p>\n<p>Ned and Peter followed MJ to a shady spot against the wall. Ned was practically bouncing in his spot.</p>\n<p>“Dude, how do you know so many Avengers? I knew about Tony Stark, but you didn’t tell me about everyone else!” Ned excitedly exclaimed.</p>\n<p>“You never said anything about Captain America! Then Thor shows up and knows you too! Peter, you are so lucky.” The boy quickly added.</p>\n<p>Peter honestly didn’t know how to answer that. He was too humble to talk about all of it, not that he tried to be. Peter also knew that this was how Ned would react, so that’s why he never told him in the first place.</p>\n<p>“And he called you mini Stark.” MJ whispered in Peter’s ear. Ned didn’t even seem to notice, as he was too lost in his own thoughts.</p>\n<p>MJ knew that the comment would annoy him. How many times already had Clint brought it up in the penthouse? Everyone who didn’t know Peter seemed to think the two were related, but they weren’t.</p>\n<p>Sure, Mr. Stark was a great mentor. But it definitely wasn’t anything more than that. He just came to the tower on weekends to train with the team and work in the lab, they didn’t really hang out besides that.</p>\n<p>Alright, maybe Peter wanted Mr. Stark to be more. Maybe he sometimes called Mr. Stark “Dad” in his mind occasionally on accident. That didn’t mean they had that relationship.</p>\n<p>But the whole Avengers team seemed to think otherwise. As mentioned earlier, Clint constantly reminded Tony and Peter, calling the younger of the two “your kid” and Tony “your old man”. Eventually the others caught on, and now that’s just what they were called.</p>\n<p>“But I’m not! Peter protested. He sounded like a little kid with the way he whined.</p>\n<p>MJ raised her eyebrows. “Are you sure about that?” She questioned her boyfriend. He was getting more and more annoyed, and it was a lot of fun for MJ.</p>\n<p>“I just go to his lab on the weekends. That’s it. You know that, MJ.” Peter insisted. MJ hummed in agreement.</p>\n<p>“I also know that he drives you to and from school almost every day.” The girl added.</p>\n<p>MJ didn’t usually see Peter until he was actually in the building in the mornings, but May had informed her of the arrangement. As for driving Peter home, MJ always walked from school and would see Tony Stark in one of his less fancy cars waiting in the kiss and ride line.</p>\n<p>“”That’s only because of May’s promotion! She works longer shifts now and can’t get me there herself!” Her boyfriend argued with her again.</p>\n<p>“I thought it was Happy who drove you before, not May.” She pointed out. Peter groaned. MJ wouldn’t let herself lose this argument.</p>\n<p>“Fine. We’re close, but he’s not my dad.” Peter finally submitted.</p>\n<p>His annoyed expression made MJ smirk. He looked so cute like this. She knew that Peter knew it too. He didn’t exactly agree with it, but he knew about it. May mentioned it when MJ didn’t, so he heard about it plenty from the two ladies.</p>\n<p>She was also suspicious of Stark reminding her boyfriend of it also. Sometimes Peter came to school on Monday mornings looking annoyed, and Tony was the last person Peter saw. Maybe Ms. Potts was up to it too.</p>\n<p>“Did you know that Scarlet Witch knows your name? Do you know her too? Does that mean you also know Black Widow? You could be like spider partners! That would be super cool!” Ned rambled.</p>\n<p>Peter hadn’t heard his friend rant in a while. He almost missed it because of what had happened so far thay day. He’d take Ned’s rambling over endless embarrassment any day.</p>\n<p>“I still can’t believe you told the princess of Wakanda about me! Did you hear what she said? She said we should hang out sometime! How cool is that?” His best friend continued.</p>\n<p>“Do you think she’ll let me see her lab? Would I get to go to Wakanda? Could I actually use some of her tech? Hey, didn’t she almost say something about me hacking into your suit? Do you think she was impressed? Probably not, she could probably do that way faster than I did.” He went on. The boy hadn’t even started eating yet because he was talking so much.</p>\n<p>“Who do you think is smarter, Tony Stark or Princess Shuri? If what the press says about Shuri is true and she actually designed the metro system in Wakanda, then I’d say it’s her. Tony Stark did create the arc reactor though. And his suit too. But Shuri made the Black Panther suit. Did you know that his suit turns kinetic energy into potential energy, and then back into kinetic? I think that’s awesome!” Ned went on.</p>\n<p>Eventually Peter zoned Ned out, it didn’t seem like the other boy needed answers anyway. His lunch was good and everything was peaceful.</p>\n<p>Until his spider sense flared again.</p>\n<p> — — —</p>\n<p>“Are you sure you can stay on?” Sam checked, unsure. He was giving Clint a disbelieving look.</p>\n<p>“Of course I can. I trained at Shield, remember?” The immature man assured him.</p>\n<p>“Yeah, but did they teach you how to do anything like this?” Asked Sam. He wasn’t going to trust Clint so easily.</p>\n<p>“Not exactly. But we only use the training half the time anyways. For the other half, we completely wing it.” Clint explained. He smiled at his obvious pun, knowing it would annoy Sam.</p>\n<p>“That’s not exactly comforting.” The winged hero stated.</p>\n<p>“Aww. I didn’t know you cared.” Clint responded. He pretended to look touched.</p>\n<p>“Don’t get your hopes up, bird brain.” Sam said back.</p>\n<p>He straightened out his wings in set his tinted goggles in place. A moment later, he jumped off one of the side balconies on Stark Tower.</p>\n<p>It was a little harder to control the direction he was going in. His turns were significantly wider, but he’d have to get used to it. He couldn’t really stop flying at this point.</p>\n<p>“How’re hanging in there, Legolas?” Sam teased the other man on his back.</p>\n<p>He looked behind him to see Clint struggling to hang on.</p>\n<p>“I’m doing great!” He said instead, but the death grip Clint had on the back of his suit begged to differ.</p>\n<p>“Also, that’s Tony’s thing! He’s The only one who calls me that.” Clint whined at Sam. The winged man laughed.</p>\n<p>“Since when? I think I’m fully privileged to call you whatever I want.” Sam replied.</p>\n<p>“It’s been Stark’s thing since before Cap met you.” Informed Clint.</p>\n<p>“Jeez, you didn’t have to go that far, man. That stung.” He told Clint. “You do realize I could throw you off whenever I want, right?” He asked, making a great point.</p>\n<p>Sam jerked to the side slightly just to prove it. Clint swallowed, clearly just thinking about it now.</p>\n<p>“Yeah. So I’m going to call you whatever I want, Oliver Queen.” Sam finished, satisfied with the turnout. He could see Clint pouting.</p>\n<p>“Whatever, Maximum Ride.” Clint glumly replied.</p>\n<p>Sam wasn’t too sure when Clint originally came up with this idea. However, he completely changed his mind when he saw what Flash did to Peter. That was absolutely not okay.</p>\n<p>It was time to do their jobs. They were called the Avengers for a reason. Apparently that bully didn’t realize it before. He would definitely know after everyone got to him.</p>\n<p>Clint had been rushing Sam the whole time he was suiting up. He even tried to help put the wings on, but that didn’t end up so well. It actually slowed them down, and Clint still had the nerve to blame him for it. Sam didn’t really know what else he was expecting, this was just how Clint was.</p>\n<p>“Are you done practicing, Tinker Bell, or should I fly this suit myself?” Clint grumbled. That man was not patient.</p>\n<p>“I’d like to see you try.” Sam replied, a smile gracing his face as he tried to imagine Clint flying his suit. That would be a disaster. With the wings and the arrows, he may as well be Cupid.</p>\n<p>He still turned around back towards Stark Tower to please the man on his back. Sam wanted to fly around a bit before they carried out their plan. Clint was obviously opposed to the idea since it meant he had to wait longer, but too bad for him.</p>\n<p>“Pepper says they should be outside in the courtyard.” Clint informed him.</p>\n<p>Sam swooped lower and flew around the tower towards the courtyard. He’d never actually been out there himself since he stayed in the penthouse so much. He never found the need to go down there. Steve had tried to convince him one time, saying it was a chance to get some fresh air and some food. He still didn’t go.</p>\n<p>The winged man stayed high enough so he wasn’t too noticeable to the people below. It would completely foil their plan if someone saw him. Clint would probably throw a tantrum if he let that happen. It was probably best not to do that.</p>\n<p>A few moments later, Sam heard the sound of one of Clint’s arrows zooming past his head. He watched as it quickly shot downwards towards Peter’s class.</p>\n<p>It almost looked like it was going to hit Peter’s bully, especially from the height they were at. But it didn’t quite, and the arrow shot back towards the archer.</p>\n<p>Except when Clint caught the arrow, Sam noticed a sandwich on it. Of all the things to shoot at, of course Clint chose a sandwich.</p>\n<p>This was Sam’s que to get closer to the tour group. He swooped down so that he was maybe 20 feet off the ground. They just had to be close enough for everyone to hear them.</p>\n<p>“Thank you for these boomerang arrows, Pete!”</p>\n<p> — — —</p>\n<p>“Thank you for these boomerang arrows, Pete!” Came a loud voice from above.</p>\n<p>Peter whipped his head towards the voice. Sam was flying with his suit on, not too high above them. The weirdest part was that Clint was on his back. He was holding on with one hand, and in the other was one of the arrows Peter recently designed, and a sandwich.</p>\n<p>The kid’s eyes went wide. Hadn’t the others embarrassed him enough? Peter knew they were trying to get back at Flash for what he said earlier, but didn’t they realize they were still embarrassing him in the process?</p>\n<p>Clint took a big bite out of the fresh sub. He made a face of pure delight to signify how delicious the sandwich was.</p>\n<p>“Is this one from Delmar’s too, Flash? Peter keeps telling me how good their sandwiches are, but I’ve never been there myself.” Clint asked the boy.</p>\n<p>Flash looked freaked out that another Avenger was here, but also really upset that his lunch was gone. He looked conflicted on whether or not he should say something.</p>\n<p>Peter hadn’t even realized it was Flash’s food, he just assumed it was Clint’s. Apparently not. He hadn’t seen it, but the archer likely used the boomerang arrow to get the food. That is definitely something Clint would come up with.</p>\n<p>“What kind is this? Italian?” Clint asked, delightfully munching on the sandwich. Peter knew he was just trying to rub it in Flash’s face more. Clearly the boy didn’t realize that.</p>\n<p>“You can’t just steal my sandwich! I don’t care who you are!” Flash yelled up at Clint. The man kept a face of indifference.</p>\n<p>“Remember when I asked for your opinion? Me neither.” Clint replied to the boy.</p>\n<p>That seemed to humble Flash ever so slightly. According to his expression, he remembered who he was talking to. It was a good thing too, because Clint wouldn’t let Flash win, even if he put up a fight.</p>\n<p>“It’s still my sandwich.” Flash repeated himself.</p>\n<p>“I know. That’s why I took it.” Clint explained to the irritated boy.</p>\n<p>Flash looked confused, as well as angry that he wouldn’t get his lunch back. Clint decided to elaborate a bit more.</p>\n<p>“It’s sort of like what you did to Peter on December 22nd last year.” The archer started. Flash still looked incredibly confused, maybe even more so now. “You stole Peter’s lunch that day.” Clint finished.</p>\n<p>The bully no longer appeared confused. He was still angry though, but didn’t say anything. He slowly seemed to be learning not to talk to the Avengers and Peter the way he had been earlier.</p>\n<p>“They say people get what they deserve. In your case it’s a stolen sandwich.” Clint added taking another bite.</p>\n<p> — — —</p>\n<p>The rest if the Avengers watched from one of the balconies. It was too good to miss. Clint had the right character for this part of the plan, and it was going great so far.</p>\n<p>Tony was glad that Flash was getting what he deserved. It was about time too. Tony hadn’t realized until earlier that Peter was being bullied for so long.</p>\n<p>The kid really deserved better. He worked so hard all the time with everything he did. The kid forced himself to get near perfect grades in school. When he was out as Spider-Man, he could tell based on Peter’s heart rate and fatigue that he was working almost too hard. In the lab, Peter tried to get every small detail perfect, and when he messed up, he was too hard on himself for it.</p>\n<p>Tony just wanted what was best for his kid. He didn’t need anything else.</p>\n<p>The rest of the Avengers teased him about it constantly too. It was practically his motto, and his team could probably tell.</p>\n<p>Clint called Peter “your kid” when he talked to Tony. He also heard that Clint addressed him as “your old man” when he was talking to Peter.</p>\n<p>Tony liked the names, he just didn’t like that he was teased about it. If they said it like it was a normal occurrence, he wouldn’t mind at all.</p>\n<p>He also wasn’t sure what the kid thought of it. Tony didn’t want the kid to be freaked out. But Clint knew his limits for the most part, and he figured Peter probably didn’t mind too much if the man was still doing it.</p>\n<p>And yes, of course he heard about what Thor said when he got to the tower. The god had come bounding through the elevator after he left Peter’s group, with Loki in tow. He didn’t realize the god actually thought they were related by blood. They didn’t look that alike did they?</p>\n<p>So no, they weren’t father and son. But if Tony was being completely honest, he would love it if they were. He already thought of Peter as his son in his head. It probably wouldn’t even change their relationship too much.</p>\n<p>Tony would never admit any of this, of course. He still had plenty if pride to keep in check and the press to watch out for. He assumed that the rest if his team didn’t need him to tell them though, based on the teasing.</p>\n<p>Maybe he would bring some of this up to Peter sometime. Not too seriously of course, that wasn’t Tony’s forte. Probably as a joke. Tony wasn’t sure, and now wasn’t the time to think about this stuff anyways.</p>\n<p>Peter would have to forgive him first. Hopefully it wouldn’t be too long of a road.</p>\n<p>Tony’s turn was coming up, and just like the others, he was ready to give Flash one heck of a field trip.</p>\n<p>“Now everyone follow me, we have a Q&amp;A with Tony Stark!” Pepper announced to the eager students.</p>\n<p>Everyone had finished eating their lunches, except for Flash. They got to relax a little bit before Pepper continued their tour.</p>\n<p>It was a wonderful break for Peter. He was definitely not excited for the Q&amp;A. Based on the way things were going, it wouldn’t turn out well for him. Or even Flash for that matter.</p>\n<p>Everyone looked super excited, and Peter heard many of the girls squealing. He sighed. He missed the days he felt the same about seeing Mr. Stark. Not that he didn’t like seeing his da- mentor, they were just used to each other enough that Peter didn’t feel that kind if excitement anymore.</p>\n<p>Pepper hadn’t told them where in the tower they were going, but Peter guessed it was the press conference room. He recognized the hallway they were in. Usually this was where Mr. Stark would make announcements about the company and hold press conferences. Sometimes it would be set up so people could walk around and look at the new tech that would soon be released. Generally, it wasn’t used for anything else.</p>\n<p>But apparently now it would be. That couldn’t mean anything good at all.</p>\n<p>Peter followed Pepper and his class. There were lots of excited whispers from the jittery students. Peter was just jittery for a whole different reason. MJ surprisingly excited too. Based on her expression, she also knew something was coming. Great. Ned was being Ned, and was soaking in everything he could, his expression in awe. Peter was surprised he wasn’t rambling like before.</p>\n<p>Apparently Peter thought too soon.</p>\n<p>“So Hawkeye knows you too? And you talked to him about Delmar’s? Does that mean he knows your sandwich order? Does Tony Stark know your sandwich order? Has he ever gone to buy you a sandwich? I would love if Tony Stark bought me food!” Ned excitedly babbled.</p>\n<p>“He has ordered you food before, Ned.” Peter pointed out to his friend. Ned looked like he remembered that now that Peter mentioned it.</p>\n<p>“Right! But it would be cool if he knew my sandwich order too.” The boy paused in thought. “How many Avengers to you actually know? I’m pretty sure almost all of then have come up to you today! Do you know Ant-Man too? What about Dr. Strange? I heard he’s basically a wizard. Do you think he has one of those wizard hats? Do you think he’s more like Harry Potter? Would he have a wand then?” He chattered some more.</p>\n<p>“He just has a cape, Ned, and a glowing green necklace.” Peter answered the boy.</p>\n<p>“That’s so cool.” Ned said.</p>\n<p>When they got to the press conference room, Pepper had everyone sit down on the floor again. Peter personally hated sitting on floors. Especially hard tile ones like the floor he was sitting on now. But the room didn’t have any chairs, so he’d have to deal with it anyways.</p>\n<p>There was a large stage in the front. Normally, there would be a podium and Mr. Stark would go up and announce whatever he was going to announce from there. Sometimes Pepper would do it for him too. Peter could no longer see the podium, so it was probably behind the curtain that was also there.</p>\n<p>It was a very stylish setup. It had to be, considering the room was constantly on TV and the press had almost complete free run of it. The floors where tile and the edges were wedged together so that there were no gaps between each square. There were many modern styled chandeliers hanging from the high ceiling above them. Like the entrance area, this room spoke luxury.</p>\n<p>Pepper walked in front of the stage, but not on it. Her heels clicked against the tile as she walked.</p>\n<p>“Let me introduce you to… Tony Stark!” The woman announced to the group.</p>\n<p>There were a few cheers as the curtains opened up to reveal Tony. The man wore a more casual suit and put on the mask that the public saw. He stepped forwards with swagger, confidence, and indifference. The press definitely wouldn’t be seeing this, but he had a reputation to uphold and it was basically habit by now.</p>\n<p>Tony could see Peter nearly sweating out of anxiousness. He wasn’t surprised, but it really wasn’t his goal anymore to embarrass Peter. The poor kid’s face made him feel guilty.</p>\n<p>He stopped near the edge of the stage. Tony cleared his throat to keep his crowd waiting and to prepare for his talk.</p>\n<p>“Hello Midtown. I heard you’re the school for smart kids or something. Supposedly you get the highest SAT scores in the nation.” Tony muttered like it was no big deal.</p>\n<p>“So, I’m guessing most of you came here to see the tech side of Stark Industries. We have a lot to see. This company specializes in efficient energy, so we have tons of different branches of products based on that concept.” Tony paused to take a breath.</p>\n<p>“We sell a variety of devices, such as phones, tablets, laptops, and TVs. There is also a branch that specializes in making lab equipment and tools. Mr. Chemistry Teacher, you should definitely check those out.” The billionaire suggested, pointing at Peter’s teacher. “We also recently started a branch that specializes in prosthetics and different technology for hospitals.” Tony finished talking about the company.</p>\n<p>There was a round of applause. Tony waited so he could talk about the next part.</p>\n<p>“But, if you’re not crazy about the wonderful tech, then you can still find something interesting. SI has something for everybody. If you just like to build stuff, we have our mechanics and manufacturers. If you like to invent, we’ve got several large teams of engineers. If you just want to chill and make a bit of money, you can get paid to test our products. If you’re still young, you can intern.” Tony informed the class.</p>\n<p>There was more clapping from the excited group. He was done for the most part, now he just had to wait for that jerk to make a move.</p>\n<p>Peter didn’t look much better than he had before his little speech. His complexion was slightly whiter and he was still sweating. He’d have to make it up to the kid after the long field trip ended.</p>\n<p>“Does anyone have any questions?” Tony asked the class.</p>\n<p>The group stayed silent for maybe three seconds, then several hands simultaneously shot high in the air. Some students looked desperate to be picked, and others were waving their hands around. The billionaire noticed Eugene Thompson’s hand among them.</p>\n<p>“Yes! You in the purple shirt. Fire away.” Tony said, pointing at Flash. The boy looked taken aback that the man actually picked him. He spoke anyways.</p>\n<p>“Do you accept personal interns here?” He asked Tony.</p>\n<p>He contemplated on how to answer this question. Tony didn’t know if Peter wanted anyone else to know, and he had already embarrassed the kid a lot. He didn’t want to reveal something that Peter didn’t want revealed.</p>\n<p>“No, I don’t take personal interns.” Answered Tony truthfully. “That’s bec –” The man was cut off by the bully.</p>\n<p>“Ha! I knew you didn’t work with him, Penis!” Flash shouted towards the back of the group where Peter was sitting.</p>\n<p>Pure rage filled Tony. To see it on a screen was one thing, but to see it and hear it in person was something else. That was his kid, no, his son damn it! He wanted to do something nasty to that guy, but he had to keep his cool.</p>\n<p>“Let me finish.” Tony shouted sharply.</p>\n<p>His teeth were clenched, and based on the expressions of the students, they could all tell he was mad. Flash didn’t look very brave at the moment.</p>\n<p>“I don’t accept personal interns because I already have one.” He corrected the boy, looking him in the eyes. “I came to Peter before he even applied for an internship. He caught my attention for being so talented at such a young age.” Tony explained.</p>\n<p>He double tapped the arc reactor to his suit. Tony, with Peter’s help, had designed the new nano tech. It was much easier to get the suit on and it was easier to keep with him. The armor seemed to melt around his whole body as it slid into place. It looked great.</p>\n<p>Tony looked back at Flash with his helmet on too. “And I’ve decided I don’t like it when you call my kid by that name.” He said almost threateningly.</p>\n<p> — — —</p>\n<p>“Boss has suited up.” Friday informed the team. That was the que, now it was time for action.</p>\n<p>“Alright everyone, suit up!” Cap ordered, following the plan.</p>\n<p>They all hurried to their respective rooms to get their uniforms. Nat and Wanda were already in their outfits because of the training room scenario earlier. Sam and Clint hadn’t bothered to change out of their suits either, so they were ready too.</p>\n<p>They were all meant to meet in the living room. It didn’t take long, because they had to be quick if there was ever an emergency. Clint was staring longingly at the video game controller, and fiddling with the movable button. But he forced himself not to turn on the TV.</p>\n<p>There was only one person missing. Or rather, an Asgardian. Loki was already waiting in the designated meeting place, but his brother was not.</p>\n<p>“How long does your brother take?” Wanda asked Loki in disbelief. She would have thought he’d be faster.</p>\n<p>“Who knows? He likes being dramatic.” Loki told her.</p>\n<p>Some frustrating and confused shouts could be heard from down the penthouse hallway. It sounded like Thor’s voice based on how deep it was.</p>\n<p>Suddenly, Thor walked in the living room. “I cannot find Mjölnir!” He exclaimed.</p>\n<p>“What do you mean, brother. I thought only you could move it?” The other Asgardian questioned.</p>\n<p>“Apparently not.” Thor replied, seemingly in thought. “What about our red friend, from when Ultron attacked? Is he around?”</p>\n<p>“No, he’s doing his own thing on the other side if the country. He couldn’t have moved it.” Steve informed Thor.</p>\n<p>Thor looked very confused. He didn’t know anyone else who could pick up his hammer. Only that person knew where Mjölnir was. That also meant that they were technically worthy of ruling Asgard.</p>\n<p>“Where did you leave it last?” Cap asked him. He seemed focused on helping Thor find the famous hammer.</p>\n<p>“I believe it was the training room.” Thor told him.</p>\n<p>Nat seemed surprised. If you knew her well enough, you could see her different expressions even if her face didn’t change.</p>\n<p>“Wanda and I left Peter in there.” She said.</p>\n<p>Everyone seemed to realize what she was trying to tell them. The Avenger’s faces nearly mirrored each other. Peter was the one who picked up Mjölnir? Could they really be surprised though? He was such an innocent and sweet kid.</p>\n<p>“Well, I don’t think he would have taken it. Peter probably didn’t even realize how significant it was that he could pick up your hammer.” Steve mentioned. “Are you sure you didn’t see it in the training room?”</p>\n<p>“I don’t believe so.” Thor answered.</p>\n<p>Loki didn’t seem to believe his brother. “Hello, voice in the roof, where is Thor’s hammer?” He asked Friday.</p>\n<p>“It appears to be in the training room.” She informed the team.</p>\n<p>Loki gave his brother a pointed look. “Goodness brother, everyone is allowed to act stupid once in a while, but you really abuse the privilege. It’s like you’re missing an eye or something.”</p>\n<p>Thor ignored his brother and heading towards the stairs. He was skipping maybe four steps at a time, so it wouldn’t take too long to get to the training room and retrieve his hammer.</p>\n<p> — — —</p>\n<p>“Your kid?” Flash questioned Tony’s phrase. He seemed afraid, which he had every right to be. The boy had just messed, and had been messing, with Tony’s kid.</p>\n<p>“That’s right.” Confirmed Tony. He was still staring straight at the boy’s eyes.</p>\n<p>“I… I’m sorry, Tony Stark, sir.” The man listened as Flash attempted to apologize. “I was just… it’s this game we play, we’re sort of… uh… friends at school and all that.” The boy lied.</p>\n<p>Everyone knew it too. Even if Tony hadn’t watched the video surveillance of Peter’s school, he would have know this boy was lying. It was written all over his face. He was even worse at lying than Peter was, which was certainly hard to accomplish.</p>\n<p>“Oh yeah! The bully game. I’ve heard of that one.” Flash visibly paled. “I know more about you than you think, Eugene Thompson.” Tony said through his anger.</p>\n<p>“How –”</p>\n<p>“Did I know about that? I’ve seen the video surveillance, all of it. You’ve got nothing to hide from me.” He interrupted the boy.</p>\n<p>Tony shook his head in disbelief. “You couldn’t even take one day off from hurting Peter.”</p>\n<p>The said kid didn’t know how to feel about the situation. Mr. Stark was defending him! That alone made Peter feel protected and safe. He hadn’t really realized that the man cared so much about him. It only made Peter idolize his mentor even more.</p>\n<p>On the other hand, Mr. Stark was making a huge scene. He looked furious, and Tony Stark with emotions was a strange concept to the public eye.</p>\n<p>“This just absolutely blows my mind, aren’t teachers supposed to look out for this sort of thing? When I was in school, you would have gotten suspended.” Tony directed his statement towards Peter’s chemistry teacher.</p>\n<p>“My father will hear about this! I’ll tell him what you’re doing.” Flash attempted to threaten the billionaire.</p>\n<p>“Then I guess I’ll have to explain what you’ve been doing to Peter.” Tony responded. “I don’t even understand why you hate my kid so much!” Tony went on. “You are kissing some seriously explosive dynamite.”</p>\n<p>“I… I’m really sorry! I promise I won’t do it again!” Flash apologized to Tony.</p>\n<p>“Damn right you won’t! Otherwise, I’ll make sure you’ll have a tough time getting into a good school.” The angry man assured him. “I don’t want you in my tower anymore. They’ll show you to the door.”</p>\n<p>Tony was pointing towards a group of people entrance to the room. No one noticed them there before, as they were too occupied with watching Tony. People gasped and whispered as they recognized the group.</p>\n<p>All of the Avengers were standing there, with Captain America standing in the front.</p>\n<p>They were watching as Flash debated on what to do. He knew that Tony Stark had dismissed him, but he really didn’t want to leave. Eventually the stares of everyone made him realize that they were going to wait for him to leave.</p>\n<p>The bully stood up and awkwardly walked towards the Avengers. His head was hung in shame. Everyone in the room watched him walk. Flash could feel all the eyes on him.</p>\n<p>Once Flash and the team of heroes left the room, Tony looked back at the crowd. “Do you guys want to see the new tech I added to my suit?” He asked them, fully knowing their answer. Everyone listened intently as Tony told them about the nano technology.</p>\n<p> — — —</p>\n<p>“I hope you understand what you’ve done wrong, son.” Steve reprimanded Flash in his Captain America voice.</p>\n<p>They were all done embarrassing the bully for hurting Peter. He only deserved so much, and they had reached that point. They still had to make sure that Flash knew that what he did was wrong. He had to stop.</p>\n<p>Flash looked down at the ground. “Yes, sir.” He said in a disappointed voice.</p>\n<p>“Great. We’re going to have you wait over here while your class finishes up. Don’t worry, you’re hardly missing anything.” Cap assured the teen. The boy only nodded to show he’d heard. His head was still hung in shame.</p>\n<p>Steve led Flash to a row of chairs against a long wall. They were back in the entrance area, from the very beginning of the field trip. The boy sat down in one near the end.</p>\n<p>“Thor is going to wait with you until your class comes.” Steve informed him.</p>\n<p>The Avengers left through the elevator, leaving Flash alone with Thor. He noticed the man was very big and muscular. Flash felt very small compared to the Asgardian. He looked up at the tall man.</p>\n<p>“Would you like to see my hammer?” Thor asked him. The happy man was smiling, like he had no care in the world.</p>\n<p>After Flash left, Tony went into detail about the technology of his suit. He tried to explain it in a way that would make sense, but based on the confused stares of the majority of the class, they still didn’t understand. There was a reason Tony didn’t take on a teaching career. That, and because most children and teenagers annoyed him. Only one person stopped him from saying all children and teens.</p>\n<p>“That’s all for today, Midtown! Pepper will lead you back to the main entrance.” Tony announced to the group. The students looked bummed and disappointed, and there were murmurs of protest.</p>\n<p>He walked over to the teacher, who was behind his class as they were leaving. “Mr. Teacher, I’ll be keeping this kid.” He informed the man, pointing at Peter. Tony spoke quietly, knowing Peter wouldn’t want his whole class to know he’d be with him. The only reason that “my kid” had slipped in the first place was because of Flash.</p>\n<p>“Of course, Mr. Stark.” The man replied. He was looking for Peter so he could get the boy, but Tony made him pause.</p>\n<p>“Let me know if there’s any more trouble with that Flash kid.” Tony instructed with a firm tone and warning look. The teacher clearly hadn’t thought to do it all the other times, so hopefully this friendly reminder would do the trick.</p>\n<p>“Yes Mr. Stark. I’ll be sure that doesn’t happen again in my class, and I’ll bring it to the attention of Principal Morita.” Mr. Larson assured Tony. Satisfied, he let the other man get his kid.</p>\n<p>Tony couldn’t figure out what Peter was thinking as the boy walked over to him. He was clearly flustered from everything that had happened in the last few hours, but beyond that Tony couldn’t tell.</p>\n<p>“Why’d you do that?” The kid asked.</p>\n<p>Tony put his arm around Peter’s shoulder and started walking them towards the elevator. “I couldn’t let Eugene treat you like that, kid. You deserve way better than that.”</p>\n<p>Peter looked up at him. “But you didn’t have to do that much. Everyone but Bruce did something to him.” The kid protested with a whine to his voice.</p>\n<p>“Rhodey didn’t do anything either.” Tony said matter-of-factly. They stepped out of the elevator and into the penthouse.</p>\n<p>Peter sighed at his father figure and rolled his eyes. “You know that’s not what I meant, Mr. Stark.” He whined again.</p>\n<p>Tony mentally chuckled at the kid’s tone. He sat down on the cushy sofa in the abandoned living room.</p>\n<p>“You’re my kid, Pete. Not anybody else’s, just mine. Actually, I guess you’re May’s too, but that’s beside the point. You’re my kid, and I’m not letting anyone get away with hurting you. Especially some immature ten year old punk who’s jealous of you.” Tony told his kid.</p>\n<p>The boy looked at him with confusion. He tilted his head in and scrunched up his face. It looked remarkably similar to a puppy’s face.</p>\n<p>“He’s not jealous of me. At least I’m pretty sure he isn’t, Mr. Stark.” The boy fumbled with his words a little.</p>\n<p>Tony smiled at Peter. “You bet he is kiddo. I watched the footage. You aced an algebra test when he failed and then accused you of cheating.” He explained.</p>\n<p>“But that doesn’t necessarily mean that he’s jealous Mr. Stark. He might just really hate me.” Peter told him, denying the truth.</p>\n<p>“Did you see him when I called you my kid? If that didn’t mean that he was jealous, I don’t know what does.” Continued Tony.</p>\n<p>Pete seemed to be thinking hard about it. His face was scrunched even more now.</p>\n<p>“You’ve got a lot, kid. I’m not surprised he wants what you have.” Tony paused, not sure how to phrase the next part correctly. “But considering what you’ve had to go through, I think you deserve a lot more.” He said in a soft tone. They both knew what he meant.</p>\n<p>Peter looked up at him with his large doe eyes. “You think so, Mr. Stark?” The kid asked, trying to judge Tony’s expression very carefully.</p>\n<p>“Of course, kiddo. That’s one of the reasons why I…” Tony paused as he fiddled with his front pocket. This was the first time Peter noticed something was in there. “...reinstalled the parachute in your suit.” He finished, pulling out an incredibly tiny box.</p>\n<p>Peter imagined it could fit a ring just fine. But the man began to pull his suit out, and Peter didn’t know how he could have possibly fit that in the teeny box.</p>\n<p>“This one won’t drown you.” His mentor joked with him. Peter grimaced at the memory of nearly dying in the lake, but smiled at Mr. Stark’s attempt to make him laugh. “It also fits into compact spaces.” Tony added, as if Peter hadn’t already noticed.</p>\n<p>The boy was already thinking of all the benefits of the suit’s compactness. He wouldn’t have to worry about someone accidentally seeing it in his backpack. Peter could probably just slide it into his pocket like Mr. Stark had done.</p>\n<p>“Mr. Stark, this is just… woah!” The boy said, trying to describe what he thought of the upgrades.</p>\n<p>The surprise of getting his suit upgraded never seemed to get less exciting. It was like having Christmas several times a year. Hopefully it would never get old.</p>\n<p>“What did you expect, kid, I made it.” Mr. Stark sarcastically said to him. “Anything else you want me to add?” Tony asked him.</p>\n<p>Peter was only half listening to Tony talk. He was enthralled with his suit and trying to squeeze it super tight in his hands. It was almost like a stress ball, except Spider-Man themed. Did they make those? They certainly made some strange merch with his logo on it, Peter honestly wouldn’t be too surprised.</p>\n<p>“Nope, it’s great, Dad.” Peter said, not really thinking about it much.</p>\n<p>Tony froze.</p>\n<p>His mind started going crazy. What did he mean? Had Pete even meant to say that? Wait. Did this mean he thought of Tony as a father figure?</p>\n<p>“What?” He asked the clueless kid sitting next to him.</p>\n<p>The boy looked up at Tony, clearly confused. “What?” Peter asked him back.</p>\n<p>The boy had noticed the short silence, but he didn’t know what had caused it. He didn’t mind as long as it wasn’t an awkward one, which it wasn’t. What was Mr. Stark talking about? Had he missed something? It wasn’t often that Tony let silence hang over them, if Peter wasn’t talking then his dad -</p>\n<p>“Oh.” The boy said, finally realizing what he’d done.</p>\n<p>He’d been thinking of Mr. Stark as his dad for a while now, and he must have let it slip. How could he have let that happen? Mr. Stark wasn’t supposed to hear that.</p>\n<p>Peter suddenly felt very awkward sitting there. What was he supposed to do now? He had no idea how the man would react, and he didn’t want to assume anything. That would just mess things up even more.</p>\n<p>He chanced a glance at his mentor. The man was smiling. He quickly mirrored Tony’s expression. Peter didn’t feel as out of place as he had moments earlier. It was a relief, and he felt himself relax.</p>\n<p>Tony reached out and pulled Peter closer to him. The kid felt Mr. Stark ruffle his hair in good nature.</p>\n<p>“So it’s Dad now, huh?” Tony asked the kid who looked up at him. He was still smiling.</p>\n<p>“Uh…” Peter trailed off, not knowing how to answer.</p>\n<p>Tony softly chuckled at his kid. Peter’s grin widened in response.</p>\n<p>The two could hear banging above them, and the next moment, Clint fell out of one of the higher vents. He landed hard on the living room floor.</p>\n<p>“Oof!” Clint shouted as he hit the ground. He saw the duo watching him. Tony didn’t look very happy at him. The billionaire had demanded countless times for him to get out of the vents. It was a lot like their situation with the coffee.</p>\n<p>“Hi there.” Clint said bluntly.</p>\n<p> — — —</p>\n<p>Apparently Mr. Stark had talked to May, because now he was staying the night at the tower, and it was only Wednesday. However, Peter wasn’t complaining in the slightest.</p>\n<p>He’d done a large portion of his homework, using Tony and his knowledge to his advantage. For the stuff that his mentor didn’t know, like history, he went to Steve. When Steve wasn’t around Peter would find Bucky and ask him.</p>\n<p>After dinner came and went, Peter decided it was the perfect time to go patrolling. It took a little while to get to Queens, but Peter didn’t really mind. He returned someone’s lost dog, a little poodle named Angel, who actually didn’t seem to like him much. The owners were nice though, and he felt great after seeing how happy the family was when they were reunited with their last member. Peter also stopped a number of thieves, which there was an unusual amount of that evening.</p>\n<p>He stayed out until 10 o’clock, and came back only because of his dad’s insistence. Peter liked to stay out longer, when the real action happened. But May and Mr. Stark made sure their guidelines stuck. It was one of the compromises they’d made in order for Peter to still be Spider-Man. Tony was normally more lenient with these types of things, but May made it clear that the rules would be followed, and his mentor definitely didn’t want to get on May’s bad side.</p>\n<p>The spiderling climbed in through the window to the living room, making sure to close it before hopping off the wall. Peter ripped his mask off, which was a relief. His face always felt free and refreshed when the air hit his skin.</p>\n<p>He looked in the cupboard to find a post patrol snack. Peter found an unopened box of his favorite protein bar in there. Then his eyes landed on the pudding cups. Protein bar or pudding cups? It wasn’t a hard decision to make. Peter grabbed three pudding cups and sat at the counter to eat.</p>\n<p>“I was afraid you were going to choose the healthy snack.” A voice came from the doorway to the kitchen. Shuri went into the cupboard and grabbed her own pudding cup.</p>\n<p>“Nuh uh.” Peter replied with his mouth stuffed with pudding. He shook his head. “We can’t have that. God forbid we actually eat the nutritious foods that help our bodies grow.” He said sarcastically.</p>\n<p>“Nope. Absolutely not acceptable.” Shuri agreed, peeling of the top to the pudding cup and throwing it in the trash bin.</p>\n<p>Shuri gasped. “You traitor!” The teen exclaimed, pointing an accusing finger at Peter. The boy looked offended and confused. “You’re eating the sugar free ones? How dare you betray me in such a way!”</p>\n<p>“But they were the only vanilla ones we had! That doesn’t count!” Peter protested.</p>\n<p>Shuri gasped and held her stomach as if she had gotten stabbed. She pretended to fall to the ground dramatically. “Et tu, Brute?” Was her only reply.</p>\n<p>“You’re the real traitor! You’re having the chocolate ones!” Peter accused her. He mimicked Shuri and pointed and accusing finger at her too.</p>\n<p>“How is that a bad thing? It’s completely unhealthy.” The girl argued, sitting up on the ground.</p>\n<p>“But if you have it once a day it’s not.” Peter challenged her.</p>\n<p>Shuri raised her eyebrow at him. “Do you mean if you have a small piece of dark chocolate?” She asked him, smirking at his inaccuracy.</p>\n<p>“Um, I’m pretty sure it applies to chocolate pudding too.” Peter claimed. He was slightly unsure looking at Shuri’s smirk.</p>\n<p>“I think you are confusion. America explain!” She quoted the vine.</p>\n<p>“According to several studies, having a small piece of dark chocolate every day can be healthy, although this does not apply to milk chocolate pudding cups.” Friday spoke up. “Does that answer your question, Mr. Parker?”</p>\n<p>Peter could have sworn he heard some sass in the AI’s voice. Shuri was laughing at him now. Great.</p>\n<p>“Sure, thanks a lot Fri.” He grunted in a very monotone voice.</p>\n<p>“Anytime, Peter.” She replied. Yep, that was definitely a sassy voice he’d detected.</p>\n<p>Shuri was still laughing at him. She tried taking a few deep breaths to steady herself, but to no avail. The teen burst out laughing again moments later.</p>\n<p>Peter ignored her and threw away his three empty pudding cups. Shuri’s was still on the counter, only half finished. He sat back on the stool and pouted as his friend kept laughing at him.</p>\n<p>The boy’s eyes widened when another person entered the room. His jaw opened wide and he didn’t do anything for a few moments. He’d actually forgot he was here at the tower! Peter’s mind went through a chorus of “Oh my God”. He remembered that the man could see him, so he pulled himself together so he didn’t look like an idiot.</p>\n<p>“Hello Mr. Black Panther King T’Challa, sir.” Peter greeted the King of Wakanda. He could hear Shuri stifle a laugh.</p>\n<p>T’Challa smiled at him. “Hello Peter, T’Challa is fine.” He told the thrilled teen. He was on a first name basis with the king of Wakanda! And he knew his name! He couldn’t wait to tell Ned the next day.</p>\n<p>Peter realized he’d been staring. He immediately stopped himself. He would not embarrass himself in front of the Black Panther.</p>\n<p>“Shuri, we will be leaving on Saturday evening.” T’Challa addressed his sister. He glanced at the clock near the kitchen table. “It’s late, so go get some sleep soon.”</p>\n<p>Shuri rolled her eyes at her brother. “Yes, Mom.” She said. “I have a belly to fill.” Shuri added.</p>\n<p>T’Challa ignored her first comment. He glanced at the pudding cup and looked at Shuri disapprovingly.</p>\n<p>“You should really try to eat healthier, Shuri.” He paused, making a point to look at her from her head to her toes and back up again. “It would really benefit you.” The king explained.</p>\n<p>Shuri looked offended, her mouth gaping at the insult. “Are you telling me I’m fat, brother?” She yelled down the hall where her brother had disappeared. “I’m about a third of your size, you hippo!” Shuri shouted again when an answer didn’t come.</p>\n<p>“It’s all muscle!” T’Challa yelled back down the hallway.</p>\n<p>Shuri looked annoyed in a way that you only get when you’re around a sibling. Peter didn’t want to interfere. He was afraid he’d do something wrong.</p>\n<p>Shuri faced Peter. “I’ve got to show this man dawae to the door.” She told him. He instantly cringed at the old meme.</p>\n<p>“Shuri…” He whined. It was truly painful to hear the meme aloud again. It reminded him of how much he and Ned had overused it when it first became a thing. Now he knew how MJ felt whenever she told them to stop and they didn’t. He’d have to apologize to his girlfriend later.</p>\n<p>Shuri ran down the hallway after her brother. In the following minutes Peter could hear lots of shouting.</p>\n<p>The only reason Peter had been there for a few extra minutes to even hear the yelling was because Shuri had left her pudding cup. It was only half gone and it wouldn’t be any good to waste it. Peter threw it away empty.</p>\n<p> — — —</p>\n<p>Peter wasn’t ready for his alarm to go off the next morning. He moaned, but reluctantly pulled himself out of bed, not wanting to be late for school.</p>\n<p>The alarm stopped buzzing. What? He hadn’t even hit the button on the clock. Peter opened his eyes and was greeted to the sight if his familiar room in Stark Tower. Right. He’d had an interesting day yesterday.</p>\n<p>He wasn’t excited to go to school. The rumors flew around quickly at Midtown, and people would be talking about him. Who knew what Flash would do. Hopefully he would stop harassing Peter, but the kid wasn’t sure.</p>\n<p>The sleepy teen groggily walked into the kitchen, where he’d been able to smell breakfast since he’d woke up. He squinted as he entered the room. The windows let in a lot of light. Considering how high up they were, and that the sun was still rising, it wasn’t surprising.</p>\n<p>There were a few others in the room, but they were mostly doing their own thing. Steve, who was usually up first, had made breakfast for everyone. The super soldier was currently sitting at the kitchen table with some tea and a newspaper. Peter could almost invision reading glasses on the man’s face. He probably would have laughed at the thought if he wasn’t so sleepy.</p>\n<p>Peter gladly took enough to fill himself. That meant almost a quarter of all the food that Cap made for the whole team.</p>\n<p>The spiderling ate his breakfast as more of the Avengers woke up. Most of them were in the kitchen now, with the exception of T’Challa, Shuri, Bruce, Clint, and Bucky. The ones that were there were either eating, or watching the news, which had been turned on at some point when Peter was eating. Thankfully it wasn’t very loud, Peter hated the noise of someone droning on.</p>\n<p>The peacefulness of breakfast with his friends and family surrounding him was interrupted by a loud noise. Said noise came bounding into the kitchen and immediately attacked the pile of pancakes that Steve had made. On his way to the table, he grabbed the whole coffee pot again.</p>\n<p>“Hey there, mini Stark. You don’t think your old man would mind if I took this, do you?” He addressed the boy.</p>\n<p>Peter was confused. Since when did Clint have so much energy in the mornings? Usually he was a dead man walking and wouldn’t talk to anyone except Nat.</p>\n<p>Also, what was all of this “mini Stark” and “your old man” about? Sure, the Avengers would toss around a word here or there referring to their relationship, but never to that level.</p>\n<p>Why was Clint asking him? His dad was sitting right next to him. It was probably Clint just being Clint.</p>\n<p>With his advanced hearing, he could hear Loki whispering quietly to his brother on the other side of the room. “I thought you told me they weren’t related, brother.”</p>\n<p>“I would absolutely mind, Legolas. Now put that thing back before I make you.” Tony said with a warning tone.</p>\n<p>Clint grinned. “Sorry, no say can do. I have an energy level that needs boosting.” The energetic man refused.</p>\n<p>Tony glared at him. “I think you have plenty of energy, Barton.” He opinionated. Clint took a sip out of the pot, probably just to spite Tony.</p>\n<p>“Friday, do the honors, would you?” He ordered his AI.</p>\n<p>“Boss, I am afraid that the Barton Proof Coffee protocol has been disabled.” Friday informed Tony. The man looked surprised, to say the least.</p>\n<p>“What?” He took a moment to think. “Who did you contact, Clint, because you don’t have nearly enough brain cells to hack my AI.” Tony questioned the other man.</p>\n<p>“I have a few friends at Shield.” The man started, smirking. He was about to continue when he was interrupted.</p>\n<p>“Let's be real here, Clint. I’m your only friend at Shield.” Natasha interjected their argument. Clint pouted before continuing.</p>\n<p>“Coulson convinced one of his team members to hack into your system for me, although I heard it didn’t take much convincing.” Clint explained. “And I have friends in other places too, Nat.”</p>\n<p>“Do you mean us? Don’t you think that’s a little far fetched?” Tony denounced.</p>\n<p>“At least I have a wife.” Clint muttered in defense.</p>\n<p>“That doesn’t hold much on me anymore, Barton. I have a fiancée.” He reminded Clint.</p>\n<p>“I have kids.” Clint added. “Although, I guess I’m not the only one anymore.” He said mischievously, looking in Peter’s direction.</p>\n<p>Oh yeah. Peter almost forgot that Clint had overheard his and Tony’s personal conversation. This probably wouldn’t finish well for the two of them.</p>\n<p>“Yes! The man of ants introduced me to young Cassie!” Thor boomed from the other side of the room. “She liked my hammer.” He added, looking at Loki for what happened the previous day.</p>\n<p>“Children like everything, Thor. Don’t let that get to your head.” Loki explained to his brother.</p>\n<p>“I wasn’t talking about Cassie.” Clint told them. Still looking at Peter. Everyone but Thor seemed to understand what Clint was saying. Loki noticed this and quietly whispered to his brother, explaining the obvious message he was missing.</p>\n<p>“I don’t know what you’re talking about.” Peter attempted to assure them. It didn’t work in the slightest. Peter was a horrendous liar.</p>\n<p>“We all saw it coming, Peter. Tony is just such a dad to you.” Rhodey commented. Peter blushed at the second sentence. He didn’t really know what to say after that.</p>\n<p>He didn’t have time to say anything either. Peter checked the time and jumped out of his seat in a panicked state. After all the classes he’d skipped due to being Spider-Man a few months ago, he was on thin ice. Only one or two tardies would have him in big trouble.</p>\n<p>“Slow down there, underoos. I can get us there in time.” Tony said, getting out of his seat. They left the rest of the team to their breakfasts, and headed towards the garage.</p>\n<p>Tony checked his watch. It would be close getting there on time. The duo got into the black Audi, which would be less obvious than some if the other options, and were on their way.</p>\n<p>It didn’t take long for them to get onto the highway. There was a very good reason for that too.</p>\n<p>“Mr. Stark, slow down! You’re going thirty miles past the speed limit!” The kid told him in a panicked state.</p>\n<p>“I told you I would get you to school on time.” Tony calmly told Peter. He didn’t look any less relieved at the man’s statement.</p>\n<p>“But you’re breaking the law!” The boy protested again. Sometimes Tony forgot how innocent the kid was.</p>\n<p>“Been there, done that.” Tony carelessly said.</p>\n<p>“We could die, Mr. Stark!” The kid looked even more panicked now, so Tony slowed down a little bit. But they were still over the speed limit.</p>\n<p>They got to the school twenty minutes early. Tony decided he wouldn’t be speeding so much the next time he drove Peter to school, even if they were late.</p>\n<p> — — —</p>\n<p>“Woah, dude, did you just get out of Tony Stark’s Audi?” Ned asked him when he came out of the kiss and ride line. His friend’s face was full of disbelief.</p>\n<p>“Yeah, Ned. I thought you already knew about that?” He asked the boy.</p>\n<p>“Seeing is believing, my bro.” He explained to Peter.</p>\n<p>When they got to Peter’s locker, MJ was already waiting for them. Her nearly empty backpack was slung over one shoulder, and she had a book in her other hand. She looked up from her book as the two boys arrived, but didn’t say anything. That was just how MJ worked.</p>\n<p>“You’re reading The Color Purple again?” Peter asked his girlfriend, recognizing the cover and book title. It was the book she reread the most, which Ned and Peter quickly noticed. According to MJ, it was what originally got her active into woman’s rights. Peter had never read it.</p>\n<p>“It brings the real world into perspective.” She informed them.</p>\n<p>“Like A Doll’s House?” Peter asked. She had talked a lot about that one too.</p>\n<p>She shrugged her shoulders. “In a sense.” MJ didn’t elaborate on what that meant. She was blunt and to the point.</p>\n<p>“You guys are still up for coming to my house on Saturday, right?” Ned checked. They were planning a Disney marathon, with all the older movies, which they all agreed were the better ones.</p>\n<p>“My Dad said it was fine, so sure.” MJ confirmed with him.</p>\n<p>Ned turned to Peter. “What about you, Peter?” He asked his friend.</p>\n<p>There was a split second where Peter could see MJ’s eyes light up. Uh oh. “Yeah, Peter. What did your Dad say?”</p>\n<p>He guessed he should have expected MJ to bring that up again. Everyone seemed to keep asking about him and Mr. Stark. While he liked what had happened, Peter didn’t like the type of attention he was getting for it.</p>\n<p>“What do you mean?” Peter asked her. He looked like a deer caught in headlights. Ned was quietly humming the next lyrics in the song he accidentally quoted.</p>\n<p>“Don’t even try, Peter. Your stepmom already told me about it.” She explained.</p>\n<p>“You mean Pepper? She’s not my stepmom, MJ.” Peter defended. “And since when did you start talking to her?”</p>\n<p>“But she’s your dad’s fiancée, isn’t she?” His girlfriend pointed out, completely ignoring his second question. She wasn’t going to give up anytime soon. Ned was looking back and forth between them rapidly as each of them spoke.</p>\n<p>“Well…” Peter started, as he tried to come up with a decent excuse.</p>\n<p>“Exactly.” MJ finished. She looked satisfied at winning that little argument. “Don’t make it seem like such a bad thing.”</p>\n<p>Peter’s girlfriend went back to reading her favorite book, no longer paying attention to the two boys. She was still standing by them though.</p>\n<p>“Hold on, I’m really confused.” Ned said to Peter with a shocked expression. “Did MJ just say that Tony Stark is your dad?”</p>\n<p>“Maybe?” Peter told his friend. He nervously scratched the back of his neck, which he realized afterwards was pretty cliché.</p>\n<p>When Ned’s eyes grew even wider, he realized the other boy thought something different. “Not biologically, Ned.”</p>\n<p>“Oh, ok. Well, we could all see you two bonding anyways.” Ned seemed to calm down a little. That was strange. Just a few minutes ago he was freaking out about Tony driving him to school.</p>\n<p>“This is insane, Peter! So are you calling Tony Stark ‘Dad’ now or something?” There was the Ned that Peter knew.</p>\n<p>He blushed awkwardly. “Yeah, I guess I am.” Peter admitted, a smile forming on his lips.</p>\n<p> — — —</p>\n<p>Peter walked home with Ned that day, like he normally did. The previous day had been an exception. He was talking about how boring their chemistry teacher was. Considering how Peter barely stayed awake in that class on a daily basis, he would have to agree.</p>\n<p>He unlocked his apartment door, and was surprised to see May already there. Normally she worked until much later, which left him alone for several hours. Sometimes he’d take the metro to the tower and work in his and Tony’s lab for a while to kill off some of that time.</p>\n<p>May was attempting to bake again. He didn’t really know why she kept trying. It was a never ending process. May would bake or cook something, it would turn out horrible, she would stop for awhile, and then she would try again.</p>\n<p>The only exception to this cycle was when Peter had first met Tony. The man had been polite in saying that May’s date loaf was good, but she became obsessed with the notion that she actually was good at it, and started making them all the time. He’d gotten one in almost every meal for a month after the event. It finally ended when Ned made a revolted expression while eating one.</p>\n<p>“Hey sweetheart. I’m trying to make that banana bread recipe that MJ suggested.” She informed Peter. “How does it look?”</p>\n<p>Peter set his bag down on a chair and went over to May. She opened the door to the oven so he could peek inside. It smelled horrible. It reeked way too much of banana, as well as burnt. The shape of the bread was also horrendously off. Whatever that was, it certainly wasn’t banana bread.</p>\n<p>“Maybe we should stick to the supermarket brand, May.” He told her. Peter felt horrible telling her this.</p>\n<p>“Yeah, I think you’re right.” She checked her “banana bread” again. “It seems just slightly deformed, doesn’t it.” She added sarcastically.</p>\n<p>Peter was surprised she didn’t bring up the smell, but then he noticed the wooden clip on her nose. That would explain it.</p>\n<p>“I thought it would be nice to have some of that while we talk, but I guess the grapes will have to do.” May sighed in disappointment. She pulled out the container of grapes from the fridge, and set it down on the coffee table in the living room.</p>\n<p>May sat down on the sofa and Peter followed suit. He was reluctant to have a serious talk with May, but he wouldn’t find a way out of it anyways. These moments reminded Peter of the difficult days after Ben’s death, when they’d sit down like this and talk to each other about their feelings and struggles.</p>\n<p>Peter’s aunt put an arm around him and pulled Peter close to her. He instantly relaxed at her kind touch. He loved how comfortable and loved he felt around May. Peter didn’t know what he’d do without her.</p>\n<p>“How long has Flash been bothering you?” She asked him in a soft tone. She didn’t want to upset him.</p>\n<p>Peter was silent for a few moments before he decided to answer. “I think… since freshman year, maybe.”</p>\n<p>May hummed and nodded, rubbing her hand against Peter’s arm in comfort. “What does he do?”</p>\n<p>“It’s really nothing bad, May. I could handle it fine, really.” He tried to assure her. But May could tell by the way he stiffened up that it wasn’t completely alright.</p>\n<p>“Just tell me what he did, sweetheart.” She softly told him.</p>\n<p>Peter didn’t answer right away. He appeared to be gathering his thoughts. His eyes were darting around and his eyes were slightly squinted.</p>\n<p>“He would tease me sometimes.” He started, still thinking about everything else Flash had done. “And he liked to give me names.” Peter added on.</p>\n<p>“What kind of names?” She asked him. May was hoping he would be more specific.</p>\n<p>Peter was reluctant to answer. He didn’t want to freak May out and make her worry. She had too much going on to deal with this sort of stuff.</p>\n<p>“Like, inappropriate names.” Peter answered. He really didn’t want to go into detail. May could tell, her boy wasn’t very hard to read.</p>\n<p>“Can you tell me, Peter?”</p>\n<p>He looked down, shoved away his pride, and answered. “Puny Parker.” Peter told her. His voice lowered. “And sometimes Penis Parker.”</p>\n<p>May felt empathetic for her nephew. She remembered her own high school days where she wasn’t particularly popular either. May pulled him closer and kissed his messy mop of hair.</p>\n<p>Peter felt comforted by her gesture and relaxed again. “You’re not going to do anything, are you? Mr. Stark already made sure Flash won’t bother me anymore.” He pleaded. It wasn’t likely she would, but if he was really hurt, no one would stop her from being a mother hen.</p>\n<p>“Well, I guess since Tony did that already, I don’t have to anymore.” May agreed. She would probably check in with Peter’s school to make sure these things didn’t repeat, but she wouldn’t do anything directly.</p>\n<p>May knew that Tony was protective of the people he truly cared about, and that one of those people was Peter. May felt comforted and relieved that Tony cared about him as much as he did. Pepper had told May what had occured on the field trip once the group had left. Once May was slightly surprised about Flash, but she definitely not surprised at Tony’s actions.</p>\n<p>She’d had her suspicions about Peter being bullied, but she’d never gotten an answer about it until now. There were days when her nephew would come to their small apartment building looking sullen and depressed. Other days he would come home beat up, with bruises and cuts along his face, legs, and arms. When she discovered his masked identity, Peter brushed it off as something that happened during patrol. Now she knew better.</p>\n<p>Peter felt better knowing that May wasn’t going to do anything to Flash. Like he told her, Tony had already taken care of it. There was really no point for her to do anything at this point.</p>\n<p>There was a few minutes of comfortable silence between the two. They both gathered their thoughts.</p>\n<p>“So,” May started, giving Peter a mischievous look. “I heard you called Tony ‘Dad’ yesterday.”</p>\n<p>Peter moaned loudly, making his annoyance obvious. “Not you too, May!” He complained. May laughed and ruffled Peter’s hair again. She couldn’t ask for a better moment.</p>"
}