{
  "id": "15475770",
  "url": "https://archiveofourown.org/works/15475770?view_full_work=true",
  "author": [
    "seekeronthepath"
  ],
  "title": "The Hogwarts Potions Professor",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Harry Potter - J. K. Rowling"
  ],
  "relationships": [
    "Minerva McGonagall & Severus Snape",
    "Harry Potter & Severus Snape"
  ],
  "characters": [
    "Severus Snape",
    "Harry Potter",
    "Minerva McGonagall",
    "Filius Flitwick",
    "Pomona Sprout"
  ],
  "additional_tags": [
    "Severus Snape being a decent teacher",
    "Abused Harry Potter",
    "Snape notices",
    "Good Severus Snape",
    "Mentor Severus Snape",
    "competent adults",
    "Alternate Universe - Canon Divergence",
    "Letters and lists as a narrative format",
    "Worldbuilding"
  ],
  "language": "English",
  "series": "Part 1 of Severus Snape and the House of Slytherin",
  "published": "2018-07-29",
  "completed": "2019-01-03",
  "words": "11,191",
  "chapters": "22/22",
  "comments": "884",
  "kudos": "9,237",
  "bookmarks": "1,346",
  "hits": "155,633",
  "summary": "<p>An exploration of what a strict, unapproachable, safety-conscious potions teacher MIGHT have been like.</p>\n<p>Featuring homework feedback, discussions between teachers, and a growing awareness that Potter is not quite what Severus was expecting...</p>\n<p>The first chapter of the sequel, 'The Head of the House of Slytherin' has now been posted at https://archiveofourown.org/works/17281838</p>",
  "notes": "<p>Section in italics belongs to JKR</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">more notes</a>.)\n</p>\n<p>Let me know what you think! Ideas for more chapters are welcome</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>Is Malfoy enjoying this syllabus? No, not really.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>Should Hogwarts staff get a break over the holidays? Yes. Do they? Not really</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>Mwahaha...and the fixing of canon begins!</p>\n<p>(For the record: magic cloak that belonged to his dad is not nearly as cool as a real photo of his mum, and a connection to someone who knew her, so Harry's night-time wanderings and discovery of the mirror are gonna be delayed a bit)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">notes</a>.)\n</p>\n<p>I'm playing with a lot of different formats here, so let me know what you think!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">notes</a>.)\n</p>\n<p>Harry's glasses will be dealt with on a second trip, as they want him to go through certain healing and potions regimes first.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">notes</a>.)\n</p>\n<p>I had so much fun with the Scots - hopefully I got it right?</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_8_endnotes\">notes</a>.)\n</p>\n<p>Why not the Weasleys, you may ask. Well, Severus has fairly strong opinions about children paying their way; he is not happy for the cost of Harry's care to come out of his own trust vaults. Whether or not he's right in that opinion is its own question.</p>\n<p>Who do you think will end up fostering Harry?</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_9_endnotes\">notes</a>.)\n</p>\n<p>Congratulations to those of you who guessed Andromeda and Ted!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_11_endnotes\">notes</a>.)\n</p>\n<p>So...I spent about five hours today making a feasible timetable for all seven core subjects at Hogwarts. (It's harder than it looks, once you take into account the fact that each teacher has to deliver ALL the contact hours for TWELVE class groups.) Since it took me so long, I couldn't possibly let it disappear into the ether, so you're all very welcome to check it out at https://goo.gl/qaB5vD and boggle at how ridiculously hard most of the teachers are working.</p>\n<p>(Also - I've edited the 'previous' chapter so that it comes after this one, because I've realised I messed up the timing. It should have been set just after the Easter holidays, which would have been mid-April in 1992.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_13_endnotes\">notes</a>.)\n</p>\n<p>I realized that Snape's letters didn't really expose his full scheme, so...here's a little more of it</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_14_endnotes\">notes</a>.)\n</p>\n<p>Severus is getting a little bit fed up</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_17_endnotes\">notes</a>.)\n</p>\n<p>There's a few quotes from the book here, so if you recognise it, it's Rowling's</p>\n<p> </p>\n<p>Please, please tell me what you thought, this is my favourite chapter</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_21_endnotes\">notes</a>.)\n</p>\n<p>And so we reach the end of Book One!</p>\n<p>I have more ideas in mind for this universe, but they get substantially more canon divergent and it's going to take we a while to figure out how it's all going to work. But, hopefully, I will start posting Book Two at some point in the not-too-distant future.</p>\n<p>In the meantime, I'd love to hear what about this fic you liked best, if you've got a minute to tell me about it - I tried a lot of new things with this one, and I'd love to know what worked!</p>",
  "text": "<p><em>Snape finished calling the names and looked up at the class. His eyes were black like Hagrid’s, but they had none of Hagrid’s warmth. They were cold and empty and made you think of dark tunnels.</em><br>\n<br>\n<em> ‘You are here to learn the subtle science and exact art of potionmaking,’ he began. He spoke in barely more than a whisper, but they caught every word – like Professor McGonagall, Snape had the gift of keeping a class silent without effort. ‘As there is little foolish wand-waving here, many of you will hardly believe this is magic. I don’t expect you will really understand the beauty of the softly simmering cauldron with its shimmering fumes, the delicate power of liquids that creep through human veins, bewitching the mind, ensnaring the senses ... I can teach you how to bottle fame, brew glory, even stopper death – if you aren’t as big a bunch of dunderheads as I usually have to teach.’</em><br>\n<br>\n<em> More silence followed this little speech. Harry and Ron exchanged looks with raised eyebrows. Hermione Granger was on the edge of her seat and looked desperate to start proving that she wasn’t a dunderhead.</em><br>\n<br>\n<em> ‘Potter!’ said Snape suddenly. ‘What would I get if I added powdered root of asphodel to an infusion of wormwood?’</em><br>\n<br>\n<em> Powdered root of what to an infusion of what? Harry glanced at Ron, who looked as stumped as he was; Hermione’s hand had shot into the air.</em><br>\n<br>\n<em> ‘I don’t know, sir,’ said Harry.</em><br>\n<br>\n<em> Snape’s lips curled into a sneer. ‘Tut, tut – fame clearly isn’t everything.’</em><br>\n<br>\n<em> He ignored Hermione’s hand.</em><br>\n<br>\n<em> ‘Let’s try again. Potter, where would you look if I told you to find me a bezoar?’</em><br>\n<br>\n<em> Hermione stretched her hand as high into the air as it would go without her leaving her seat, but Harry didn’t have the faintest idea what a bezoar was. He tried not to look at Malfoy, Crabbe and Goyle, who were shaking with laughter.</em><br>\n<br>\n<em> ‘I don’t know, sir.’</em><br>\n<br>\n<em> ‘Thought you wouldn’t open a book before coming, eh, Potter?’</em><br>\n<br>\n<em> Harry forced himself to keep looking straight into those cold eyes. He had looked through his books at the Dursleys’, but did Snape expect him to remember everything in One Thousand Magical Herbs and Fungi?</em><br>\n<br>\n<em> Snape was still ignoring Hermione’s quivering hand. ‘What is the difference, Potter, between monkshood and wolfsbane?’</em><br>\n<br>\n<em> At this, Hermione stood up, her hand stretching towards the dungeon ceiling.</em><br>\n<br>\n<em> ‘I don’t know,’ said Harry quietly. ‘I think Hermione does, though, why don’t you try her?’</em><br>\n<br>\n<em> A few people laughed; Harry caught Seamus’s eye and Seamus winked. Snape, however, was not pleased.</em><br>\n<br>\n<em> ‘Sit down,’ he snapped at Hermione. ‘For your information, Potter, asphodel and wormwood make a sleeping potion so powerful it is known as the Draught of Living Death. A bezoar is a stone taken from the stomach of a goat and it will save you from most poisons. As for monkshood and wolfsbane, they are the same plant, which also goes by the name of aconite. Well? Why aren’t you all copying that down?’</em><br>\n<br>\n<em> There was a sudden rummaging for quills and parchment. Over the noise, Snape said, ‘And a point will be taken from Gryffindor house for your cheek, Potter.’</em></p>\n<p>\n<em> </em>\n</p>\n<p>“In this class, there is no substitute for knowledge, or for skill,” Snape declared with a sneer. “Fame will not save your life if you add ingredients in the wrong order; the safety precautions of this classroom <em>might.</em>”</p>\n<p>Harry looked up hurriedly as Snape flicked his wand at the blackboard and a list of rules appeared.</p>\n<p>“First,” said Snape, “you will follow all instructions precisely. If you do not comprehend them, you will not foul them up with your incompetent guesses; you will <em>raise your hand</em> and wait for my clarification.</p>\n<p>“Second, you will shield your cauldron immediately at any sign of danger. In this classroom, you will be working with a pharmacopeia of exceedingly dangerous substances. Rather than waste Madam Pomfrey’s time healing the bizarre results of your inevitable mistakes, the workbenches have been warded with runic arrays that will create an impenetrable shield in a sphere around your cauldron once touched. If you idiotically allow the wrong ingredient to fall into your cauldron, you will shield. If your potion is unexpectedly bubbling, spitting, or emitting vapours of any kind, you will shield. If I instruct you to do so, you will shield. <em>Once</em> you have activated the runic array, you will raise your hand and wait for me to assess the disastrousness of your errors, and whether it is worth attempting to repair them.</p>\n<p>“Third, there will be <em>no pranks </em>in my classroom.” Snape looked around slowly, meeting Harry’s gaze as if staring into his soul. “A prank here is no mere disruption; it can mean disfigurement, destruction, and even death. I have the lowest fatality rate of any Hogwarts Potion Master, and if you break my streak, the consequences will be…severe.</p>\n<p>“Fourth, you will consume <em>nothing</em> made here without my specific and explicit approval. At best, your concoctions will be simply useless. At worst…”</p>\n<p>Snape trailed off, looking around the room. “Failure to follow these rules will result in a failing mark on the practical, loss of points, and multiple detentions. I assure you, the results of failing to complete a potion through excessive caution will be far preferable. Is. That. Clear.”</p>\n<p>There was a disjointed chorus of agreement from the cowed students, and Snape turned, his robes billowing as he flicked his wand to reveal a door at the side of the classroom.</p>\n<p>“This room,” he said, “holds both equipment lockers and wash-stations. As you have undoubtedly allowed your tools to come into contact with all manner of unsavoury substances, today you will be learning how to clean and store them properly.”</p>\n<p>In the year 1991, it was Hogwarts policy that student marks would be determined by end of year exams only. Severus Snape, Esteemed Potions Master and, for his sins, Professor of Potions at Hogwarts, believed this to be a foolish, misguided, and potentially disastrous approach. A student's performance on a single day could be atypical for any number of reasons. As such, he kept detailed notes for <em>every</em> student, on their performance in every class. For example, Harry Potter.</p>\n<p> </p>\n<p>\n<b>Week 1 </b>\n</p>\n<p><u>Cleaning Basic Personal Equipment:</u> EE. Thorough.</p>\n<p><u>Identifying and Cleaning Basic Classroom Equipment:</u> EE. Unfamiliar with range of materials. Thorough.</p>\n<p><u>Cleaning Used Cauldrons:</u> A. Willing to scrub hard; insufficiently cautious about potion remnants.</p>\n<p><em>HW: Dangers of Cross Contamination:</em> D. \"As your handwriting is so atrocious as to be utterly illegible, attempting to read this essay would be a waste of my time. Avail yourself of D.R. Gall's <em>Quill Primer</em> before your next assignment, or you will be practising your letters under my supervision.\"</p>\n<p> </p>\n<p>\n<b>Week 2</b>\n</p>\n<p><u>Measuring Ingredients by Weight and Volume:</u> P. Clearly unfamiliar with scales, and units of measurement.</p>\n<p><u>Identifying Potentially Contaminated Ingredients:</u> A. Diligent, but misses fine details. </p>\n<p><u>Knife Safety and Techniques:</u> O. Surprisingly competent.</p>\n<p><em>HW: Conversions Between Non-Standard Measurements:</em> A. \"Your habit of converting measurements to their metric equivalents is a waste of time. Wizards use imperial measurements almost exclusively.\"</p>\n<p> </p>\n<p>\n<b>Week 3</b>\n</p>\n<p><u>Crushing and Grinding:</u> A. Diligent, but misses fine details. Tends to grind too fine rather than too coarse.</p>\n<p><u>Ingredients Preparation Review:</u> EE. Careful and thorough.</p>\n<p><u>Ingredient Mixing and Stirring Techniques:</u> A. Imprecise.</p>\n<p><em>HW: Ingredient Studies:</em> P. \"So long as you rely exclusively on the books on your reading list, you will fail to complete your assignments to my satisfaction. I suggest you swallow your pride and beg Miss Granger to introduce you to a library.\"</p>\n<p> </p>\n<p>\n<b>Week 4:</b>\n</p>\n<p><u>Decanting Potions of Different Temperatures and Consistencies:</u> EE. Precise, but insufficiently cautious.</p>\n<p><u>Fire Safety and Temperature Control:</u> A. Familiar with basic concepts, but clumsy.</p>\n<p><u>Ingredient Identification Quiz:</u> P. Able to tentatively identify ingredients encountered in the classroom, but otherwise, utterly ignorant of even common items.</p>\n<p><em>HW: The Four Types of Ingredient Storage:</em> A. \"Tolerable, but unimaginative. A more comprehensive answer would include additional categories of ingredients and investigation of ingredients with unusual storage requirements.\"</p>\n<p> </p>\n<p>\n<b>End of September Comments:</b>\n</p>\n<p>Mixed competence. Diligent and thorough, excellent at general cooking techniques, but extremely ignorant of potions-specific skills. Occasionally careless with personal safety, but generally precise at following instructions. Misses fine detail, perhaps related to short-sightedness. Unexpectedly quiet in the classroom. Poor at theory, but potentially excellent at practicals. Pair with Longbottom for future brewing.</p>\n<p>\n<span>It was not standard practice at Hogwarts for parents to meet with teachers for anything short of serious welfare or disciplinary issues; instead, the Heads of House took on the everyday pastoral responsibilities for their students. As such, the first few days of Severus' Christmas break were always occupied by meetings with the other class teachers regarding his Slytherins, and with the other Heads of House, regarding his potions students. Some of these discussions were brief and straightforward; where a student was outstandingly talented (or troublesome), they could be quite in depth. At times, and with certain members of staff, the conversations could become unprofessionally adversarial, however - despite the traditional rivalry between their Houses - talking with Professor Minerva McGonagall was often a very satisfying evening.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Yes, that tallies with what I've heard from her other teachers,\" Minerva commented, making a note by Miss Patil's name and taking another piece of shortbread. \"I think I'll have a word with Filius and see how Padma is doing outside the classroom - it's always challenging for twins when they're separated.\"</span>\n</p>\n<p>\n<span>\"Though god knows having the Weasleys in separate classes would have been preferable,\" Severus muttered. \"Now, as for Potter...\"</span>\n</p>\n<p>\n<span>Minerva sighed, sitting back in her chair. \"Let me guess: quiet in the classroom, average performance, tending to poor on his homework?\"</span>\n</p>\n<p>\n<span>Severus hummed. \"In general, yes, but he shows some...unexpected patterns of competence and ignorance.\"</span>\n</p>\n<p>\n<span>\"Is that so?\" Minerva asked, looking pleased. \"Do you think pairing him with Longbottom has helped?\"</span>\n</p>\n<p>\n<span>\"Perhaps.\" Severus took a sip of his tea. \"As they are both quiet children, they do not overwhelm each other. But I think that while Longbottom has been moderating Potter's academic failures, Potter has been the source of his own success in practical classes.\"</span>\n</p>\n<p>\n<span>Minerva nodded, making a note. \"I may try separating him from Weasley more often, then. Potter doesn't seem to know how to branch out socially; it may help to give him a little push.\"</span>\n</p>\n<p>\n<span>Severus frowned contemplatively. \"He certainly lacks the...self-assurance I would have expected from </span>\n<em>\n<span>Potter's</span>\n</em>\n<span> son,\" he said coolly. \"If I didn't know better, I'd think he was a muggleborn.\"</span>\n</p>\n<p>\n<span>\"Well he was raised by them, wasn't he?\" Minerva pointed out. \"Awful family. I don't know </span>\n<em>\n<span>what</span>\n</em>\n<span> Dumbledore was thinking.\"</span>\n</p>\n<p>\n<span>Severus, who had relaxed somewhat during the conversation, sat up straight, and carefully put down his teacup. \"I beg your pardon,\" he said stiffly. \"Dumbledore told me he was placed with a wizarding family.\"</span>\n</p>\n<p>\n<span>Minerva shook her head. \"Oh no, I was there when he did it. Harry went to his aunt - Lily's sister. And a more Muggle-ish neighborhood I've never seen. I doubt he learnt anything about potions while living with </span>\n<em>\n<span>them.\"</span>\n</em>\n</p>\n<p>\n<span>Lily's sister? Petunia? Severus stood up abruptly. \"I apologise, Minerva, but you will have to excuse me. There are...matters I must attend to.\"</span>\n</p>\n<p>\n<span>As a rule, students and teachers at Hogwarts did not exchange gifts at Christmas. There were exceptions, of course. It was not considered improper for students to give confectionery to favoured teachers or their Head of House, and students in the upper years might give a more personalised gift to a teacher who was mentoring them. Teachers, however, generally gave gifts only to family members or similar among the student body.</span>\n</p>\n<p>\n<span>Severus Snape, for example, was currently wrapping a box of warming candies to give to Draco Malfoy, his godson. The formulation, which he usually took as a liquid, but had easily modified to add to simple boiled lollies, was extremely effective at protecting one from the chill of the drafty corridors in winter. If Draco was clever, he would ask for the recipe, although it would be beyond his skill level for another year or two.</span>\n</p>\n<p>\n<span>Gift wrapped and addressed, Severus glanced at the other present sitting on his desk, and pulled out another piece of parchment.</span>\n</p>\n<p>\n<em>\n<span>\"Mr Potter,\"</span>\n</em>\n<span> he wrote,</span>\n</p>\n<p>\n<em>\n<span>\"In my youth, I was fortunate enough to be friends with your mother. As I doubt your aunt kept any wizarding photographs of her, please find enclosed a picture of Lily in her first year at Hogwarts. The frame is unbreakable, but I am highly unlikely to give you another copy if you carelessly lose this one.</span>\n</em>\n</p>\n<p>\n<em>\n<span>Merry Christmas,</span>\n</em>\n</p>\n<p>\n<em>\n<span>S. Snape.\"</span>\n</em>\n</p>\n<p> </p>\n<p align=\"center\">\n<span>-----</span>\n</p>\n<p> </p>\n<p>\n<span>On the morning of Christmas Day, Severus found himself anticipating Potter's response to the gift with curiosity - not that he was inclined to show it, nor did he make himself any more available to the child than he habitually would have. When, at breakfast, he observed the child's frequent and unsubtle glances at the High Table, he had to confess he was rather satisfied with the reception of his gift. He was not expecting Potter to approach him.</span>\n</p>\n<p>\n<span>Severus had just left the Great Hall, and was striding briskly towards the stairs down to the dungeons, when he heard running footsteps behind him. He automatically readied his wand as he turned, only to see Harry Potter hurrying to catch up to him. \"What is it,\" Severus bit out.</span>\n</p>\n<p>\n<span>The child stumbled to a halt, his eyes wide behind those ridiculous glasses, and his mouth opened and closed once or twice. \"S-sir...\" he stammered. \"I just wanted to - to thank you. For the photo, Professor. I've...\" The child swallowed hard, ducking his head. \"I've never had a photo of my mum before,\" he whispered.</span>\n</p>\n<p>\n<span>Severus narrowed his eyes, for a moment evaluating the child as any other child - his unfamiliarity with his heritage, his uncertainty when called on, his diligent manual labour, his height and weight... \"Potter,\" he snapped, then corrected himself - \"Harry. When was the last time you had a general health check?\"</span>\n</p>\n<p>\n<span>\"Madam Pomfrey saw me after I fell in my first Quidditch match, sir?\" the child said warily, and Severus' heart sank.</span>\n</p>\n<p>\n<span>\"You will come with me to Madam Pomfrey,\" he said, softening his tone, \"you will allow her to check your health and vision, and accept the treatment she prescribes, and in turn, I will tell you about Lily.\"</span>\n</p>\n<p>\n<span>Unsurprisingly, the child looked distrustful and reluctant, but he clearly couldn't resist the opportunity to learn about his mother, and slowly, he nodded.</span>\n</p>\n<p>\n<span>Hogwarts did not, officially, have a policy for managing child abuse cases. However, for practical purposes, the Heads of House had developed a general plan of action which could be adapted to specific cases.</span>\n</p>\n<p>1. The discovering adult and the Head of House would act in partnership to ensure a balanced approach</p>\n<p>2. All available evidence would be recorded, with each adult keeping a separate copy</p>\n<p>3. Once evidentiary needs were satisfied, the child would immediately begin treatment for any lingering health issues</p>\n<p>4. The child would be asked how they would prefer to proceed, and particularly if there was an adult they would like to be placed with</p>\n<p>\n<span>5. If a trusted adult </span>\n<em>\n<span>was</span>\n</em>\n<span> available, they would be contacted, the case explained, and their permission sought for the child to stay with them during the summer</span>\n</p>\n<p>6. If a trusted adult was not available, the discovering adult or Head of House would act as interim guardian</p>\n<p>7. If it was possible to remove the abuser's access to the child without legal action, that would be done immediately</p>\n<p>8. If necessary, the Child Services Agency would be contacted</p>\n<p><br><br>For example, in the case of Harry Potter:</p>\n<p>1. Following Potter's health check by Madam Poppy Pomfrey, Severus Snape called an urgent meeting with Minerva McGonagall</p>\n<p>2. Each of them made and hid a copy of the abominably long list of past injuries and health concerns revealed by the health check</p>\n<p>3. Severus began brewing the necessary potions to treat the child's malnutrition</p>\n<p>4. The two of them discovered that Harry didn't want to make a fuss, but he also wanted to never ever go back. If he could stay at Hogwarts in the summer, he'd like that very much, and he'd be happy to help with chores and things. He supposed if he had to go somewhere, he could ask Mrs Weasley? She was nice when they met on the platform, and she'd even sent him a Christmas jumper.</p>\n<p>5. Severus and Minerva exchanged glances, and moved on.</p>\n<p>6. Harry didn't want to be any trouble, and he knew they were both very busy, especially with protecting the, um, thing on the third floor from getting stolen, whatever it was. He was sure they didn't have time to be his guardian, but...maybe Professor Snape would be willing to tell him more stories about his mum sometime?</p>\n<p>\n<span>7. Removing Harry from the Dursleys would be easy, but they didn't have anywhere to remove him </span>\n<em>\n<span>to</span>\n</em>\n<span>, especially considering his special circumstances.</span>\n</p>\n<p>8. Severus and Minerva looked at each other. Surely Dumbledore would concede without them involving the Ministry?</p>\n<p>\n<span>In most cases, it was the responsibility of a child's guardian to provide all needed supplies. However, the Heads of House were well aware that in some cases, this was unlikely, or even impossible. For this reason, a small fund had been established long ago, to which each Head contributed two galleons of their House budget per annum, for the purposes of assisting students in need of mid-term shopping. In general, any payments were reimbursed once the child's situation was resolved, and it was not uncommon for those who had benefited to the fund to contribute a little extra. As such, the vault was in quite a healthy state when Severus Snape made the following purchases on behalf of Harry Potter:</span>\n</p>\n<p> </p>\n<p>\n<span>26th December 1991</span>\n</p>\n<p>\n<em>\n<span>Primark, Oxford Street East</span>\n</em>\n</p>\n<p>\n<span>£10 - Socks, pants</span>\n</p>\n<p>\n<span>£8 - Shirts</span>\n</p>\n<p>\n<span>£19 - Pyjamas</span>\n</p>\n<p>\n<span>£30 - Shoes, winter boots</span>\n</p>\n<p>\n<span>£5.50</span>\n<span> - Hat and gloves</span>\n</p>\n<p>\n<span>£4 - Toiletries</span>\n</p>\n<p>\n<em>\n<span>Subtotal: </span>\n</em>\n<span>£76.50 (G15, S6)</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Stowe and Packer's Magical Trunks, Diagon Alley</span>\n</em>\n</p>\n<p>\n<span>G14 - Second-hand trunk with standard expansion charm</span>\n</p>\n<p>\n<span>-G8 - Credit for trade-in standard trunk</span>\n</p>\n<p>\n<em>\n<span>Subtotal:</span>\n</em>\n<span> G6</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Folio's Second-hand Books, Diagon Alley</span>\n</em>\n</p>\n<p>\n<span>G1 - The Wizarding Way: Magical Solutions to Everyday Problems</span>\n</p>\n<p>\n<span>S11 - A Traveller's Guide to Magical Britain </span>\n</p>\n<p>\n<span>G1, S5 - Britain's Noble and Ancient Houses </span>\n</p>\n<p>\n<span>S10 - Recreational reading </span>\n</p>\n<p>\n<em>\n<span>Subtotal:</span>\n</em>\n<span> G3, S9</span>\n</p>\n<p> </p>\n<p>\n<span>Total: G24, S15</span>\n</p>\n<p>The division of powers between the Headmaster of Hogwarts and the Heads of House was a matter of ongoing...discussion. Certain things went uncontested: the Heads happily conceded negotiations with external bodies (the Board, the Ministry, etc) to the Headmaster; and the Headmaster did not attempt to interfere in goings-on within the common rooms and dorms. The Heads were generally responsible for student well-being; the Headmaster was generally responsible for oversight of curriculum and hiring. Disciplinary matters were a major area of contention, as the Heads could be accused of preferential treatment, while the Headmaster was rarely familiar with the student's individual context. </p>\n<p>This balance of powers had shifted with the individuals involved, of course. Headmaster Fronsac had conceded most matters to the Heads of House, three of whom were of greater rank than him in the noble hierarchies, and contented himself filling out paperwork and overseeing the library. At the other end of the scale, Headmaster Dumbledore (Chief Warlock of the Wizengamot, Supreme Mugwump of the ICW, hero of Grindelwald's War) was able to preside over four non-noble Heads of House, all of whom had been hired during his tenure, and managed to affect an air of omnipotence within the school's walls.</p>\n<p>This made it rather difficult when the Heads disagreed with his judgements.</p>\n<p> </p>\n<p>-----</p>\n<p> </p>\n<p>Minerva rapped on the door of Severus' private potions lab impatiently, and strode inside as soon as it unlocked. \"Ward us,\" she snapped, noting the lack of cauldron on any workbench and clearing a corner of the room. </p>\n<p>A corner of Severus' mouth twitched, and he silently activated the heavy-duty wards that would keep even Dumbledore out. \"I take it your meeting was unsatisfactory?\" he commented mildly.</p>\n<p>\"That fecking scunner dinnae hae the sense God gave a heap o' shite!\" Minerva yelled, conjuring a ball of glass and shattering it on the floor. \"Ah gan up there to tell the eejit wha' the wee bairn's been gaun through, and he starts havering on aboot <em>love </em>and <em>family</em> as if it's worth a knut to a dangleberry looking for someone to wallap!\" She conjured and smashed another bauble.</p>\n<p>Severus, who had seen this happen before, calmly went back to the stores he'd been organising before she arrived. He was sure once she actually explained he'd be furious himself, but for now, he let the mixture of angry Scots and smashing glass fade into the background as he focused on evaluating the quality of his ingredients, and made a note to get out the fire-whisky later.</p>\n<p>\n<span>It was Severus, as Harry's interim guardian, that took the child to an oculist shortly before the end of the Christmas break, watching with mixed amusement and chagrin as the child gaped at his new clarity of vision. Afterwards, he transfigured their outer robes into passably Muggle coats, and took Harry to a Muggle cafe where they were unlikely to be observed. It was only sensible, after all, to have this conversation outside Dumbledore's area of influence. The child's shy enjoyment of the shared meal had nothing to do with it.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Now,\" Severus said, once their food had arrived and a discreet privacy charm had been cast around their table, \"I'd like to speak to you about what will happen in the summer.\"</span>\n</p>\n<p>\n<span>Harry looked up from his plate, crestfallen. \"Is there a problem, sir?\"</span>\n</p>\n<p>\n<span>\"Yes and no,\" Severus replied. \"Professor McGonagall and I promised that we would find you somewhere safe, where you would have plenty to eat and no one would hurt you. And we will keep that promise if we have to mind you ourselves, understand?\"</span>\n</p>\n<p>\n<span>\"Yes sir,\" Harry said, eyes wide behind his new glasses. \"I - I don't want to be any trouble, sir.\"</span>\n</p>\n<p>\n<span>\"You are not.\" Severus took a sip of his tea - it was quite tolerable, really. \"Nevertheless, Professor McGonagall and I are being quite careful about potential caretakers for you. Not only must they meet the general requirements for a suitable foster family - financially comfortable, good with children, generally reliable, and so on - there are additional concerns in your specific case.\"</span>\n</p>\n<p>\n<span>\"Why's that, sir?\" Harry asked worriedly. \"Is it because I'm, um...\"</span>\n</p>\n<p>\n<span>\"A celebrity?\" Severus replied dryly. \"Somewhat. We don't want to place you with anyone who would exploit that, but we also want to make sure your caretaker is prepared to get to know you as you are, rather than relying on their own expectations.\"</span>\n</p>\n<p>\n<span>Harry glanced up at Severus, then quickly away, and Severus smiled slightly. \"Yes, as I did,\" he agreed. \"I have corrected myself since.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Harry swallowed his mouthful of toasted sandwich and asked tentatively, \"Does that mean you're going to put me with Muggles again?\"</span>\n</p>\n<p>\n<span>Severus gave him an approving nod. \"Well reasoned,\" he said. \"However, if you have read the books I purchased for you last week, you will recall that House Potter is a noble family in wizarding Britain, and as such, you will need to learn to comport yourself appropriately. Muggles and Muggleborns cannot teach you the nuances of wizarding lordship, so you will need to be placed with someone who can.\"</span>\n</p>\n<p>\n<span>\"Like who?\" Harry asked warily.</span>\n</p>\n<p>\n<span>\"We are still considering the matter,\" Severus admitted candidly. He saw no reason to exclude Harry from the decision making process, not when it was him who would have to suffer the consequences. \"Someone like the Longbottom family, perhaps. They have had close ties with the Potters for a long time - I believe Neville Longbottom's mother is your godmother, in fact.\" Harry bit his lip, looking down at his plate, and Severus hid a sigh. \"What is it, Harry?\" he asked patiently.</span>\n</p>\n<p>\n<span>\"I - I'm sure Mrs Longbottom is very nice, sir,\" Harry stammered. \"I just - I don't think... Neville says his Gran is...strict?\"</span>\n</p>\n<p>\n<span>\"Ah.\" Another student they'd need to interfere with? Perhaps he could encourage Pomona to have a word. Longbottom certainly wasn't going to respond to </span>\n<em>\n<span>him</span>\n</em>\n<span>, after all. \"In that case, we'll try to find someone you're more comfortable with.\"</span>\n</p>\n<p>\n<em> Minerva McGonagall, Deputy Headmistress of Hogwarts School of Witchcraft and Wizardry, Head of the House of Gryffindor, Professor of Transfiguration, and Severus Snape, Head of the House of Slytherin, Professor of Potions, send cordial greetings to Edward Tonks, Master Healer, and Andromeda Tonks, Master Healer. </em>\n</p>\n<p>\n<em> In the course of our duties, we have encountered a student matter in which would benefit greatly from your expert advice. May we have the pleasure of visiting you for tea, at your convenience?</em>\n</p>\n<p>\n<em>M. McGonagall, S.Snape</em>\n</p>\n<p> </p>\n<p align=\"center\">-----</p>\n<p> </p>\n<p>\n<em> To Minerva McGonagall, Head of House Gryffindor, and Severus Snape, Head of House Slytherin, Edward and Andromeda Tonks send greetings. </em>\n</p>\n<p>\n<em> You are cordially invited to call on us at 3pm this Sunday at Tonks Tower.</em>\n</p>\n<p>\n<em>T. Tonks, A. Tonks</em>\n</p>\n<p> </p>\n<p align=\"center\">-----</p>\n<p> </p>\n<p>\"So,\" Andromeda said, once Ted had got them settled with their tea. \"Why do you need advice from two master healers, and why isn't Poppy here with you?\"</p>\n<p>Minerva shook her head. \"It isn't in your capacity as healers that we need you,\" she explained. \"We're here to speak to you in your capacity as parents. Potentially, we hope, as foster parents for a child in our care who very much needs them.\"</p>\n<p>\"This case,\" Severus added immediately, \"is a matter of the greatest confidentiality. <em> No one </em> may hear of the matter from your lips.\"</p>\n<p>Andromeda raised her eyebrows, her hand resting on Ted's thigh. \"You think we don't understand confidentiality? We're <em> healers </em>, Severus.\"</p>\n<p>\"I am aware,\" Severus replied darkly. \"Nevertheless. I am <em> reminding </em> you to live up to that professional standard.\"</p>\n<p>\"We will,\" Ted promised, squeezing Andromeda's hand. \"How about you tell us what the problem is - what's happened to the kid?\"</p>\n<p>McGonagall scoffed. \"Those dreadful relatives have been treating him worse than a house-elf all his life, half-starving him, lying to him about his parents, punishing him for accidental magic, denying him <em> any </em>sort of medical treatment, and actively encouraging their son to beat him up on a regular basis.\"</p>\n<p> </p>\n<p>\"The situation is perhaps not the worst I have heard of,\" Severus contributed, observing the horror on Andromeda's face with satisfaction, \"but it is serious enough by far to warrant a permanent removal from his 'caretakers'.\"</p>\n<p>\"Serious enough for legal action!\" Ted exclaimed. \"Surely Child Welfare would remove him when it's this unambiguous - why are you contacting us privately?\"</p>\n<p>\"<em> That </em>,\" Minerva said sourly, \"would be because we expect the Chief Warlock to intervene if we go through legal channels.\"</p>\n<p>Andromeda sat up straight, her gaze narrowing. \"And why,\" she demanded icily, \"does Albus Dumbledore see fit to prevent a child from leaving an abusive home?\"</p>\n<p>Considering Andromeda's relationship with her natal family, Severus doubted she would want to hear just how much a Black she looked in that moment, so he didn't say it, but he did think it. \"He claims that no other dwelling's wards could offer the same certainty of protection from the political enemies the boy is guaranteed to have before his majority,\" Severus told her, letting her read between the lines. \"He fears that, if there were a resurgence of Death Eater activity, as he anticipates, the child would be a high-priority target.\"</p>\n<p>Andromeda exchanged glances with Ted, and the pair stood in unison. \"If you will excuse us for a moment,\" Andromeda said politely, and the pair left the room.</p>\n<p> </p>\n<p>There was a long, tense wait, far more than even a generous definition of 'a moment'. But at last, the two of them returned.</p>\n<p>\"We'll do it,\" Ted declared, sitting down directly across from Minerva. \"Tell us everything we need to know.\"</p>\n<p>\n<span>With a few exceptions, Hogwarts professors were expected to be acknowledged masters of their art. Severus Snape was almost one of these exceptions, having been unable to serve an apprenticeship during the war...but he took rather extraordinary measures to ensure he would have that status which would allow him to demand the same respect for himself and his subject as any other professor. Namely, he presented himself before five highly respected and politically neutral potions masters, and demonstrated to them the breadth of his skills, the depth of his knowledge, and the incisive originality with which he improved and created potions recipes. Their verdict was unanimous, and Severus Snape became the youngest recorded Potions Master in Britain at the age of twenty-two.</span>\n</p>\n<p>\n<span>While it was traditional for masters of any art to pass on their knowledge to apprentices and journeymen, it surprised many when Master Snape first took on a protege, in 1985. Until then, it had been assumed that his duties as a teacher and a Head of House left him little time for additional tutoring. The potions community watched with interest as young Mr Jonathan Quentin graduated in 1987 with an O in Potions, was almost immediately apprenticed to Master Eloise Dubois, and completed that apprenticeship within two years. Master Quentin (as he became, in 1994) later commented that \"A large part of my time as Master Snape's protege was dedicated to assisting him with his out-of-class teaching duties - marking, tutoring, and preparing ingredients. I benefited a great deal from his mentorship, but he also benefited, from the reduced workload associated with his classes. I always considered it a fair exchange.\"</span>\n</p>\n<p>\n<span>Professor Snape chose a second protege after Mr Quentin graduated, a third the year after, and by 1992, his better fifth years were vying eagerly to be chosen as his seventh. His selection criteria was opaque - he didn't choose by highest mark, in Potions or in general; by number or choice of subjects; nor could his choice be predicted by any visible preference in the classroom. In truth, Severus chose based on two things: intent to become a Potions Master, and what </span>\n<em>\n<span>he</span>\n</em>\n<span> judged was their likelihood to succeed.</span>\n</p>\n<p> </p>\n<p>\n<span>Unfortunately, he thought to himself as he watched Jennifer Li evaluate the colour of her Deflating Draught, this year he'd been too preoccpuied with Potter and the third floor nonsense to do his proteges justice. Well, now that he'd persuaded Flitwick to add some reasonable warding to 'Fluffy's' chamber, he'd be able to correct that.</span>\n</p>\n<p>\n<span>\"Li,\" he barked. \"What colour is Deflating Draught 'supposed' to be?\"</span>\n</p>\n<p>\n<span>Li looked between him and her cauldron. \"True violet, sir - but I </span>\n<em>\n<span>was</span>\n</em>\n<span> just about to add more turmeric.\"</span>\n</p>\n<p>\n<span>Severus raised his eyebrows slightly. \"And can you tell me what would happen if you added an additional penny-weight? Beyond making the potion royal purple.\"</span>\n</p>\n<p>\n<span>Li opened her mouth to speak, then blinked, a thoughtful frown coming over her face. \"It would...reduce the effect of the butterfly wings, sir?\"</span>\n</p>\n<p>\n<span>\"Add the extra turmeric,\" Severus directed her, \"and then tell me.\"</span>\n</p>\n<p>Severus Snape was a very, <em>very</em> busy man. Since the war, Hogwarts had lacked the necessary budget to maintain an appropriate number of staff - and indeed, it had been argued that the smaller student body didn't <em>require</em> as many teachers. Severus, contemplating his schedule for the next day, defied any proponent of that argument to say so to his face.</p>\n<p> </p>\n<p>7:30am   - Breakfast</p>\n<p>8:15am   - Prepare for first class</p>\n<p>8:30am   - Practical with Ravenclaw/Hufflepuff first years</p>\n<p>10:30am - Clean up and prepare for next class</p>\n<p>11:00am - Practical with Slytherin/Ravenclaw third years</p>\n<p>1:00pm   - Clean up</p>\n<p>1:15pm   - Lunch</p>\n<p>2:00pm   - Class with Gryffindor/Ravenclaw second years</p>\n<p>3:00pm   - Class with Slytherin/Gryffindor fifth years</p>\n<p>4:00pm   - Prepare for next class</p>\n<p>4:30pm   - NEWT practical with seventh years</p>\n<p>6:30pm   - Clean up</p>\n<p>6:45pm   - Dinner</p>\n<p>7:30pm   - Detention: Fred Weasley, George Weasley, Lee Jordan</p>\n<p>8:30pm   - Slytherin prefect meeting</p>\n<p>9:00pm   - Marking</p>\n<p> </p>\n<p>When the average working day of your key staff members was more than ten hours long, even excluding their breaks, and their working week consisted of five such days, followed by a 'weekend' of marking, class preparation, and meetings with students, it was patently obvious (in Severus' opinion) that you did not need a Potions Professor; you needed a Potions Department. Unfortunately, he had yet to convince the necessary decision-makers of this fact, and he had too little free time to mount a successful campaign for it. </p>\n<p>On the nineteenth of April, 1992, Severus Snape received the following correspondence:</p>\n<p align=\"center\">\n<em>Dear Professor Snape,</em>\n</p>\n<p align=\"center\">\n<em>Hagrid has a dragon egg and I don't know what to do. Please help.</em>\n</p>\n<p align=\"center\">\n<em>Harry Potter</em>\n</p>\n<p align=\"left\"> </p>\n<p align=\"left\"> </p>\n<p align=\"left\">That evening, having privately conferred with the child shortly before dinner, he wrote the following letters:</p>\n<p align=\"center\">\n<em>Pomona,</em>\n</p>\n<p align=\"center\">\n<em>Our groundskeeper has acquired an infant Class XXXXX creature which he cannot be allowed to keep. Of course, as usual, he is utterly intent on raising it, and completely blind to the foolhardiness of the venture. If you will exercise your considerable patience and persuasive powers to inveigle him to give the creature up, I will arrange for its collection by a qualified person in time to prevent any student injury. </em>\n</p>\n<p>\n<em>Severus</em>\n</p>\n<p>\n<span>The appearance on the 27th of April at the staff table of one Jonathan Burke, his frame well-muscled, his face tanned, and his outer coat recognisably made of dragonhide, caused quite a stir among the student body. Particularly among the Slytherins, some of whom correctly identified him as a Hogwarts graduate of 1985, first cousin once removed of the current Lord Burke, and a journeyman Beast-Handler currently employed at the Icelandic Dragon Sanctuary. By the end of dinner, the rumours had jumped the house divide, and the whole hall was waiting eagerly for someone to explain his unexpected presence.</span>\n</p>\n<p>\n<span>When the headmaster stood, and an instant hush fell over the room. (Dumbledore smiled serenely. A corner of Severus’ mouth twitched in irritation.) “Now that you have satisfied your stomachs,” Dumbledore pontificated, “let us satisfy your curious minds as well. I see many of you have observed the guest at our table, and I am pleased to introduce him to you all: Mr Jonathan Burke, Journeyman Beast-Handler!”</span>\n</p>\n<p>\n<span>This, of course, answered no questions at all, so the polite applause quickly died away when Burke stood up to speak. To Severus, he appeared somewhat nervous, but he covered it very well. “Good evening,” he said clearly. “And thank you, Headmaster, for the welcome. My thanks go also to Professor Kettleburn, who invited me to visit the school in order to speak to his students about my experiences at the Icelandic Dragon Sanctuary.” </span>\n<em>\n<span>That</span>\n</em>\n<span> news went around the Hall like wildfire, and Burke sensibly waited for the noise to die down. (Severus, meanwhile, observed with amusement the disappointment of those who were </span>\n<em>\n<span>not</span>\n</em>\n<span> Kettleburn’s students.) “I will be attending his Care of Magical Creature classes over the course of tomorrow and the morning of the day after. For everyone else, I will be giving a talk in the Hall during seventh period tomorrow. Sixth and seventh years who have class during the talk may speak to Professor Snape about attending a repeat session that evening.”</span>\n</p>\n<p>\n<span>“Did you bring a dragon with you?” someone yelled. From the vicinity of the third-year Gryffindors. Severus gave the Weasley twins an unimpressed look.</span>\n</p>\n<p>\n<span>Burke chuckled. “Transporting dragons across national borders requires specific negotiation between the governments in question because of the secrecy and safety risks,” he pointed out. “And I’m sure the school board would be a little tetchy with me if I brought a Class Five-X animal onto the grounds.”</span>\n</p>\n<p>\n<span>Severus lifted his goblet to his lips to hide his amusement at Burke’s sense of humour, and exchanged a glance with Professor McGonagall. What Burke had said was absolutely true.</span>\n</p>\n<p> </p>\n<p align=\"center\">\n<span>-----</span>\n</p>\n<p> </p>\n<p>\n<span>Two days later, Burke departed, leaving absolutely no dragons behind.</span>\n</p>\n<p>\n<span>The staff meeting nine days before the end-of-year exams was always tiring. This close to the end of term, the teachers were exhausted, and contemplating a solid week of examinations (followed by the requisite marking) was never pleasant.</span>\n</p>\n<p> </p>\n<p>\n<span>\"...Charity, Bathsheba, Septima, you are supervising the theory exams once again,\" Minerva said briskly, \"For which all of us heartily thank you. Pomona, Aurora, are you still comfortable supervising the middle-years potions practicals?\"</span>\n</p>\n<p>\n<span>\"Many hands make light work,\" Pomona said with a shrug. \"I can't say I'd be disappointed to have a lighter load, but we do what we can with what we have.\"</span>\n</p>\n<p>\n<span>\"It's only fair,\" Aurora added.</span>\n</p>\n<p>\n<span>Severus shook his head. \"It is more than fairness,\" he said firmly, \"and you have my gratitude. I don't think I could endure two weeks of practical exams.\"</span>\n</p>\n<p>\n<span>\"I'm sure if it were necessary, Severus, you would rise to the occasion,\" Dumbledore opined, his eyes twinkling.</span>\n</p>\n<p>\n<span>Severus took a sip of tea so he didn't give Dumbledore a dirty look. Necessary. Honestly.</span>\n</p>\n<p>\n<span>Minerva cleared her throat. \"That's all we need to discuss for the exam timetables. Does anyone else have anything to discuss?\"</span>\n</p>\n<p>\n<span>Hagrid shifted in his chair, making it creak. \"Summat killed a unicorn in the forest a couple of nights ago.\"</span>\n</p>\n<p>\n<span>\"Oh, for FUCK'S SAKE!\" </span>\n</p>\n<p> </p>\n<p>\n<span>The room turned to look at Severus, and he cleared his throat awkwardly. \"...I apologise,\" he muttered. \"I am...somewhat overtired. Hagrid, what was the condition of the unicorn when you found it?\"</span>\n</p>\n<p>\n<span>\"Looked like it 'ad just been killed, but I'd say it were a few hours since,\" Hagrid answered gruffly. \"Poor thing 'ad a great wound in her throat.\"</span>\n</p>\n<p>\n<span>Severus frowned thoughtfully. \"Just the one wound? She was otherwise intact, including horn and hair?\"</span>\n</p>\n<p>\n<span>\"Aye,\" Hagrid said with a solemn nod. \"Just the one. No signs of a fight at all.\"</span>\n</p>\n<p>\n<span>Severus leaned forward, watching Quirinus out of the corner of his eye. \"Was there blood on the ground? An injury like that should have caused a lot of bleeding.\"</span>\n</p>\n<p>\n<span>Someone inhaled sharply - Minerva, Severus thought - and he heard Silvanus swear.</span>\n</p>\n<p>\n<span>Hagrid's face was thunderous. \"It did, professor,\" he said. \"I wouldn't swear that none got taken, but there was plenty around. A real mess, poor creature.\"</span>\n</p>\n<p>\n<span>Severus hummed. \"Then whatever it was, I believe it abandoned its purpose,\" he concluded.</span>\n</p>\n<p>\n<span>\"If it was a beast, one would expect signs of consumption - if a being, removal of the valuable hair and horn. Blood may have been consumed, but it was not carefully harvested. Silvanus, Quirinus - do you concur?\"</span>\n</p>\n<p>\n<span>Both nodded. \"Not that there should be anything around here that <em>could</em> hunt a unicorn,\"</span>\n</p>\n<p>\n<span>Silvanus added, \"but I follow your reasoning.\"</span>\n</p>\n<p>\n<span>\"Then as I see it, there are two possibilities,\" Severus concluded. \"Either the killer was dissuaded by some internal impulse, and they will make no further attempt, or they were interrupted, and they may try again. Unfortunately, if it was the first, we may never find them, and we will not know which it is unless there is a second attack.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"You're not saying we should just ignore it!\" Hagrid objected.</span>\n</p>\n<p>\n<span>\"Calm yourself, Hagrid,\" Dumbledore said serenely. \"I am sure Severus is suggesting no such thing.\"</span>\n</p>\n<p>\n<span>Severus exchanged a weary look with Minerva. \"We simply don't have the manpower to do anything substantial right now. Calling in the Aurors will be necessary, but it will cause enormous disruption, and if we can delay that until after exams, I believe we should.\" He held up a hand against any objections. \"I am not saying we should neglect the seriousness of this incident. But if it is not repeated, then delaying investigation by a further fortnight does no substantive harm.\"</span>\n</p>\n<p>\n<span>\"If this had happened a month ago, I'd say call the Aurors and hang the consequences,\" Pomona said frankly. \"But as it is, it puts us in a tight spot and no mistake. Is there anything we can do to stop it happening again?\"</span>\n</p>\n<p>\n<span>“We don’t have the </span>\n<em>\n<span>time</span>\n</em>\n<span> to do anything,” Aurora muttered.</span>\n</p>\n<p>\n<span>Hagrid’s chair creaked. “I do,” he said. “I’ll start patrolling the forest, professors, looking for anything odd. Might ‘ave a word with the centaurs, too, see if they’ll help out. No-one likes a unicorn-killer.”</span>\n</p>\n<p>\n<span>Minerva nodded firmly. “Along with checking the wards, that will have to do,” she said firmly. “Hopefully, it was an isolated incident.”</span>\n</p>\n<p> </p>\n<p align=\"center\">\n<span>-----</span>\n</p>\n<p> </p>\n<p>\n<span>It was not an isolated incident.</span>\n</p>\n<p> </p>\n<p>\n<span>Exams were as exhausting as ever, unicorns were still being killed, and Severus' Dark Mark was aching. He had not had a good week. </span>\n</p>\n<p> </p>\n<p>\n<span>It didn't get any better when he found Minerva trying to pacify a frantic Harry Potter (and his usual hangers-on), who was apparently convinced the Philosopher's Stone was in imminent danger of theft. </span>\n</p>\n<p>\n<span>\"Why </span>\n<em>\n<span>exactly</span>\n</em>\n<span> do you believe the Stone is in danger now, when we were able to reassure you in January?\" Severus asked, casting </span>\n<em>\n<span>muffliato</span>\n</em>\n<span> around the five of them.</span>\n</p>\n<p>\n<span>The child's eyes widened hopefully at this evidence he was being listened to. \"B-because Hagrid told the stranger how to get past Fluffy, and Dumbledore's gone, and...\" </span>\n</p>\n<p>\n<span>Miss Granger looked at Harry, then spoke up: \"And his scar's been hurting, Professor.\"</span>\n</p>\n<p>\n<span>\"I see,\" Severus said seriously. That suggested a more concerning explanation for the Dark Mark acting up than he had been assuming. Old wounds might ache with remembered pain, but the resonance of curse scars was a different matter. \"Mr Potter, you will go to Madam Pomfrey and inform her you need treatment for a curse scar, and that I instructed you to get it. Ordinary pain potions will do little, because the source of the pain is not physical, but she is familiar with treatments that will be effective. Myself and Professor McGonagall will monitor the Stone's protections, and if necessary, we can arrange for Professor Dumbledore to return - a journey which will take him five minutes, at most. The knowledge that a prospective thief might be able to easily circumvent 'Fluffy' is indeed concerning but - if you will swear not to discuss it </span>\n<em>\n<span>at all</span>\n</em>\n<span> - I believe I can reassure you on that front as well.\"</span>\n</p>\n<p>\n<span>\"Severus!\" Minerva exclaimed, aghast. \"You can't mean to tell them - \"</span>\n</p>\n<p>\n<span>\"I mean to do what I must to protect them from their own anxiety and curiosity,\" Severus said sharply, pinning her down with his gaze. \"Unless I am mistaken,\" which of course, he was not, \"they are </span>\n<em>\n<span>correct</span>\n</em>\n<span> that any escalation will be soon. The risk of them investigating alone is now more hazardous than the risk of them betraying their knowledge.\" </span>\n</p>\n<p> </p>\n<p>\n<span>The children, meanwhile, were having their own whispered conversation, far less subtly than they probably thought they were. \"You promise you won't just ignore it?\" Harry finally asked. \"You'll really check?\"</span>\n</p>\n<p>\n<span>\"Mr Potter,\" Severus replied, \"I am sufficiently convinced of the risk that this will be my top priority until the situation is resolved.\"</span>\n</p>\n<p>\n<span>The children exchanged glances. \"We - we'd rather know, Professor,\" Miss Granger said. \"We won't tell anyone.\"</span>\n</p>\n<p>\n<span>Severus shook his head. \"There is more to secrecy than not telling outsiders,\" he corrected her. \"You will not discuss this amongst yourselves, no matter how safe you believe you are, not even in code. You will not write anything down, even in code. Do you understand?\"</span>\n</p>\n<p>\n<span>\"Yessir,\" Harry said with a nod. \"We promise.\"</span>\n</p>\n<p>\n<span>\"And you two?\" Severus demanded, giving Miss Granger and Mr Weasley a pointed look.</span>\n</p>\n<p>\n<span>\"I promise, sir.\"</span>\n</p>\n<p>\n<span>\"Promise.\"</span>\n</p>\n<p>\n<span>Severus nodded. \"Good,\" he said firmly. \"Then here is what you are allowed to know: the protections Hagrid is aware of, including Fluffy, are not intended to stop the thief. They are intended to delay, distract, and tire him. Additional, more secure and secret protections have been added to prevent a thief's escape, even if they reach their goal. Furthermore, retrieval of the Stone from its keeping place is extremely difficult - enough that even I would have trouble. Does that satisfy your fears?\"</span>\n</p>\n<p>\n<span>Harry gave him a relieved smile. \"They really can't get past?\"</span>\n</p>\n<p>\n<span>\"They really can't,\" Severus promised him. \"Now, off to Madam Pomfrey to deal with that scar, and give yourself something else to think about. Teaching Mr Weasley how to play Go Fish will suffice, I imagine.\" He lifted the silencing spell. \"And Minerva, if you would do the honours?\"</span>\n</p>\n<p>\n<span>She raised a wry eyebrow, but conceded. \"Twenty points to Gryffindor for coming to a teacher with your concerns for school safety. Go on now. Shoo.\"</span>\n</p>\n<p>\n<span>The heads of house gathered in Severus' private laboratory, and he proceeded to take every security precaution he could think of. </span>\n</p>\n<p>\n<span>\"Is all this necessary, Severus?\" Pomona asked, looking shocked. \"What on earth's happened?\"</span>\n</p>\n<p>\n<span>Severus completed the final privacy spell with a flourish of his wand and sat. \"We have reason to believe that the Stone may be stolen tonight,\" he announced.</span>\n</p>\n<p>\n<span>Filius gasped, Pomona's eyebrows flew up, and Minerva leaned forward intently. \"You can't mean that you believe </span>\n<em>\n<span>Harry</span>\n</em>\n<span>, Severus?\" she pointed out.</span>\n</p>\n<p>\n<span>Severus gave her a dour look. \"I mean that </span>\n<em>\n<span>in this instance</span>\n</em>\n<span>, his instincts are in accord with my conclusions. The evidence is as follows: one, my and Mr Potter's curse scars have both been more-than-usually painful of late. As the two scars are different in size, shape, age, and cause, the resonance is highly suggestive, particularly since our daily activities are also vastly different. We must assume that there is a presence in the vicinity that is dark enough to cause irritation to both. Two, the unicorn hunter has persisted, and increased the frequency of their hunts, even while taking only blood. Someone desperate to prolong their life is within our wards, and has been for weeks. Three, Mr Potter has attested that a mysterious and anonymous stranger acquired the secret of Fluffy's pacification from Hagrid, some time before Easter. We </span>\n<em>\n<span>must</span>\n</em>\n<span>, therefore, assume that our potential thief believes themselves able to bypass the first stage of the gauntlet. And finally, the Headmaster has left the grounds for the first time in several weeks, since well before the first unicorn killings. There is a desperate, dangerous presence on the grounds, who has motive to steal the Stone, may believe they have the means to steal the Stone, and at last has the opportunity to steal the Stone. They will make an attempt tonight.\"</span>\n</p>\n<p> </p>\n<p>\n<span>\"Should we call Albus back?\" Pomona suggested, looking determined. </span>\n</p>\n<p>\n<span>Severus shook his head. \"We have control of the situation right now. If the thief is thwarted tonight, he may be less circumspect in a second attempt, and put more students in danger.\"</span>\n</p>\n<p>\n<span>\"Well, I agree with your strategy,\" Filius said, \"but what about tactics? If we go through the gauntlet first, we may leave signs of our passage to warn the thief, and if we go after, we may be too much delayed. Either way, we will not reach the end in our best state for a duel.\"</span>\n</p>\n<p>\n<span>\"Albus must know another way in,\" Minerva pointed out.</span>\n</p>\n<p>\n<span>Severus shook his head. \"There's no way to securely communicate it to us without being in the same location.\"</span>\n</p>\n<p>\n<span>Pomona grinned. \"Well, I'm no duellist, but </span>\n<em>\n<span>this</span>\n</em>\n<span> one I think I can fix,\" she said cheerfully, and conjured her patronus, a formidably large swan. \"Tell Fawkes: I need your help, for the safety of the school.\"</span>\n</p>\n<p>\n<span>As the swan departed, the three of them stared at her. \"Fawkes...\" Minerva breathed. \"Merlin, I wouldn't be surprised if </span>\n<em>\n<span>he</span>\n</em>\n<span> was Albus' second way in.\" Phoenixes went where they pleased, after all.</span>\n</p>\n<p>\n<span>\"That's 'how' solved, then,\" Pomona said briskly. \"I doubt he'll say no. So the next question is 'who'.\"</span>\n</p>\n<p>\n<span>\"More than one of us, but less than all of us,\" Minerva decided. \"If it all goes wrong, we can't leave the school unprotected.\" She paused, then admitted reluctantly, \"And I should probably stay behind. Both as Deputy Head, and because I'm a little less in practice and than you two.\"</span>\n</p>\n<p>\n<span>Filius gave Severus a concerned look. \"If your scar is aching...what will you do if the thief is an old ally? I know you've been maintaining those ties.\"</span>\n</p>\n<p> </p>\n<p>\n<span>Severus contemplated that for a long, thoughtful moment, and was about to speak when Fawkes arrived in his customary burst of flame, giving Pomona an inquisitive look.</span>\n</p>\n<p>\n<span>\"Hello, old thing,\" she said fondly. \"We've set a trap for an intruder, but we don't have a way in to retrieve him.\"</span>\n</p>\n<p>\n<span>Fawkes gave an inelegant, mocking squawk.</span>\n</p>\n<p>\n<span>Pomona chuckled. \"Yes, I know, it's not the cleverest plan, but you should really blame Albus for that. Would you mind transporting Filius, and perhaps Severus, when the time comes?\"</span>\n</p>\n<p>\n<span>Fawkes hopped onto Severus' shoulder, preening his hair. </span>\n</p>\n<p>\n<span>\"Wretched bird,\" Severus muttered, rolling his eyes, but he made no move to stop him. \"We'll call on you when we need you, then.\"</span>\n</p>\n<p>When Quirinus Quirrell stepped into the last chamber which guarded the Philosopher's Stone, there was already someone there.</p>\n<p> </p>\n<p>Severus Snape stood, black eyes glittering, hands empty by his sides, in front of the Mirror of Erised, and smiled. \"Hello, Quirinus,\" he said calmly. \"I was wondering whether I'd be meeting you here.\"</p>\n<p>Quirinus laughed coldly. \"Didn't suspect p-p-poor st-stuttering P-Professor Quirrell after all, Severus?\"</p>\n<p>\"It was your competence I doubted, not your intent.\" Quirinus' eyes widened slightly, and Severus went on: \"Jinxing the boy's broom in his first Quidditch match? That nonsense with the troll on Hallowe'en? I've known first-year Hufflepuffs with more subtlety. And waiting until the last week of term to try for the Stone? I was beginning to think I'd have to give you a hint. Or had you simply lost your nerve?\"</p>\n<p>Quirinus sneered. \"I don't need your 'hints', Severus,\" he said tightly, \"and I have plenty of nerve. <em> You</em>, on the other hand, seem to have spent the last decade pretending you never served the Dark Lord at all.\"</p>\n<p>\"I serve the Dark Lord as I have always served him,\" Severus replied, his face like stone. \"I am a trusted confidant of Albus Dumbledore, ready for him to call on me. What proof have you of faithful service? You do not bear his mark.\"</p>\n<p>\"My master is with me wherever I go,\" Quirinus said, smiling.</p>\n<p>Severus raised one eyebrow, then stepped to the side, bowing slightly. \"Then by all means...retrieve the Stone.\"</p>\n<p> </p>\n<p>Quirinus wasted several minutes, tapping at the frame, examining the back of the Mirror, and muttering to himself as he tried to decipher its secrets. \"What does this mirror do?\" he finally exclaimed. \"How does it work? Help me, Master!”</p>\n<p>And then, there came a voice, a high, whispering voice that said, \"Let me speak to him...face to face...\"</p>\n<p>Slowly, Quirinus unwrapped his turban, letting it fall away, and turning his back to reveal to Severus that where the back of his head should have been, there was a terrible, inhuman face.</p>\n<p>\"...My Lord,\" Severus said, bowing lowly. \"What an...unusual method of conveyance.\"</p>\n<p>\"Severus Snape...\" the face whispered. \"You have always had a way with words.\"</p>\n<p>Severus inclined his head, his face blank. \"Thank you, my Lord,\" he said. \"I must admit, this form seems to lack your true majesty. I am sorry to see you so restricted.\"</p>\n<p>The face laughed thinly. \"There have always been those willing to let me into their hearts and minds, Severus,\" it hissed. \"And once I have the Elixir of Life, I will be able to create a body of my own. Now...why don't you retrieve it for me?\"</p>\n<p>\"I am afraid I cannot, my Lord,\" Severus admitted. \"Though there is nothing I desire more for the present and future than to see you returned, I am made weak by my regrets for the past. If I looked into the Mirror, I would see only pretty lies, and not the - Stone.\"</p>\n<p><br>\n</p>\n<p>In that brief pause, the Dark Lord (and Severus could deny no longer that this <em> was </em> the Dark Lord) drove through Severus' outer shields and into his mind - and it was only through long-ago practice that Severus kept his feet. He had forgotten the searing pain of the Dark Lord's mental presence: where Dumbledore infiltrated his shields like water seeping through the ground, the Dark Lord pierced them like a red-hot needle. Severus did not try to bar the way, baring all for the Dark Lord to inspect, memories flashing before his mind's eye until he lost all awareness of his surroundings...</p>\n<p>...and then, he felt the Dark Lord wrenched from his mind, doing even more damage as he was torn away, and Severus fell into blackness, down...down...down...</p>\n<p>\n<span>There was something he urgently needed to do, but his head was aching fiercely, and his thoughts moved as slow as treacle. Something of great importance had happened, and he needed to...needed to what?</span>\n</p>\n<p>\n<span>He opened his eyes, then closed them hurriedly against the bright light of the room he was in. That was...in some part of his mind, that was reassuring. </span>\n</p>\n<p>\n<span>He opened his eyes again, more cautiously this time, and recognised the cheerful face of Filius Flitwick above him.</span>\n</p>\n<p> </p>\n<p>\n<span>\"Good afternoon, Severus!\" Filius said cheerfully. \"We were quite worried, you know. How are you feeling?\"</span>\n</p>\n<p>\n<span>Severus watched him for a moment, then rasped, \"What did I tell you before we entered the Chamber?\" His throat was so dry it almost hurt to speak.</span>\n</p>\n<p>\n<span>Filius' eyebrows flew up, then he rolled his eyes indulgently. \"Worried about Polyjuice? I'd chide you for being paranoid, but I suppose you've already been proven right once this week. You told me that if you looked into the mirror, I was to intervene, because you'd lose all tactical usefulness otherwise.\"</span>\n</p>\n<p>\n<span>Severus nodded slightly. \"Security?\" he asked hoarsely.</span>\n</p>\n<p>\n<span>With an amused huff, Filius proceeded to surround the two of them with a very respectable set of security charms, and Severus took the opportunity to look around him, moving his head gingerly because of his headache. He was in the hospital wing, that was why it was so bright. Next to him was a table with a small pile of envelopes, and Filius seemed to have set up a lap-desk arrangement so that he could work on his marking.</span>\n</p>\n<p>\n<span>\"We've been taking turns to sit with you,\" Filius explained, settling down. \"You've had a few attempted student visitors too, but we've kept them away.\"</span>\n</p>\n<p>\n<span>Making a face, Severus tried to sit up, and immediately regretted it, collapsing back with a pained groan.</span>\n</p>\n<p> </p>\n<p>\n<span>“Let me get you some water,” Filius offered, swiftly conjuring a goblet and filling it. “But </span>\n<em>\n<span>do</span>\n</em>\n<span> lie back, Poppy will be rather cranky with me if I threaten your recovery.”</span>\n</p>\n<p>\n<span>“How long?” Severus rasped, taking the goblet gratefully, though his hands were a little shaky. He frowned at them. He took pride in the steadiness of his hands. </span>\n</p>\n<p>\n<span>“Three days. Everyone’s going to be </span>\n<em>\n<span>so</span>\n</em>\n<span> relieved you’ve come round, we were getting quite concerned,” Filius said, his serious gaze belying his cheerful demeanour. “I was terribly worried that I’d been too late.”</span>\n</p>\n<p>\n<span>The water was like heaven to his parched throat, and when Severus spoke again, it was no longer painful. “You needn’t worry, Filius,” he murmured. “I’ve played this game before. The Dark Lord saw only what I wished him to see.”</span>\n</p>\n<p>\n<span>“Not for your memories, Severus, for </span>\n<em>\n<span>you</span>\n</em>\n<span> - you looked absolutely ghastly when I brought you up here.” Filius shook his head. “As far as Poppy could tell, it was just magical and physical exhaustion, but the look on your face when he attacked you… We had no way to be sure of the state of your mind until you woke.”</span>\n</p>\n<p>\n<span>Severus turned his attention inwards, probing (very) gently. “...No permanent damage,” was his eventual verdict. “I’ve healed worse before. Quirrell?”</span>\n</p>\n<p>\n<span>“Oh, that’s </span>\n<em>\n<span>excellent</span>\n</em>\n<span> news,” Filius said gladly. “As for Quirinus, he is quite thoroughly unconscious, there’s anti-spirit warding around him, the Grey Lady is keeping watch, and Minerva’s called on a friend who specialises in putting spirits into bottles. Not being truly alive, that...</span>\n<em>\n<span>parasite</span>\n</em>\n<span> cannot be killed yet, but we can at least stop him from getting into any further mischief until we find a final solution.”</span>\n</p>\n<p> </p>\n<p>\n<span>Severus smiled thinly. “Who came up with the bottle plan?”</span>\n</p>\n<p>\n<span>“Pomona, if you’d believe it,” Filius replied, smiling. “Not that Albus agreed, at first, but we persuaded him. Persuaded him to wait until you were awake, too, just in case.”</span>\n</p>\n<p>\n<span>“My thanks,” Severus said gravely, inclining his head. “Who knows?”</span>\n</p>\n<p>\n<span>“The four of us, Albus, and Fawkes are the only ones who know the whole of it,” Filius promised. “The staff know Quirrell made an attempt at the Stone and you stopped him. The student body know that you have been absent from meals these past two and a half days, and are in the hospital wing. Rumors are everywhere, of course. The prevailing theory appears to be that someone poisoned you for fear of your marking.”</span>\n</p>\n<p>\n<span>Severus raised his eyebrows. “An unlikely scheme,” he commented. “Anyone afraid of my marking is presumably an incompetent, yet poisoning </span>\n<em>\n<span>any</span>\n</em>\n<span> Potions Master requires exceptional skill. Furthermore, incapacitating me would do absolutely nothing to decrease the accuracy of my marking once I recovered.”</span>\n</p>\n<p>\n<span>“Your proteges volunteered to help with yours, by the way,” Filius said with a smile. “I anonymised the first and second years’ for them - so don’t you fret yourself out of this bed before Poppy says you’re ready! Speaking of which, I should tell her you’re awake.”</span>\n</p>\n<p>\n<span>Poppy Pomfrey was a lovely woman, but she was at least as strict with her patients as Irma was with her books, sometimes to the distress of their visitors.</span>\n</p>\n<p>\n<span>“Just five minutes,” Severus could hear Potter beg.</span>\n</p>\n<p>\n<span>“Absolutely not.”</span>\n</p>\n<p>\n<span>“Poppy,” Severus called out. “Let him in.”</span>\n</p>\n<p>\n<span>There was a pause, then Poppy opened the door, shaking her head. “</span>\n<em>\n<span>Only</span>\n</em>\n<span> five minutes, Mr Potter, understand?”</span>\n</p>\n<p>\n<span>The child nodded, rushing past her, only to come to an abrupt halt by Severus’ bedside, hanging back nervously. “Professor!” he said worriedly, looking pale. “I was - no one would - I didn’t say anything, I promise - I -”</span>\n</p>\n<p>\n<span>“Calm down, Harry,” Severus told him gently, gesturing to the chair by his bedside. “Sit. I am quite well, and the Stone is secure.”</span>\n</p>\n<p>\n<span>Hands fretting at his robe, Harry sat. “</span>\n<span>But you've been in the hospital wing for three days!” he exclaimed. “Everyone says it's really serious if you're kept overnight…”</span>\n</p>\n<p>\n<span>Severus sighed, looking Harry over carefully, regretting that the child had had to see him without the facade of invulnerability that he generally made it a policy to maintain in front of his students. “</span>\n<span>Mr Potter,” he said, “do you recall the week we spent over Christmas correcting the effects of your nutritional deficiencies?” </span>\n</p>\n<p>\n<span>Harry frowned. “Yes sir,” he replied.</span>\n</p>\n<p>\n<span>“And do remember what I told you about why it would take so long?”</span>\n</p>\n<p>\n<span>“Because...because the body's reserves can't be built up quickly?” Harry guessed hesitantly.</span>\n</p>\n<p>\n<span>“Exactly,” Severus confirmed. “My task was to distract the thief long enough for Professor Flitwick to render him unconscious, and after a long and busy term, that was enough to use up the remainder of my reserves. I was not injured in any severe or damaging way; I was simply exhausted.” He would leave aside the matter of his lingering headache - it was nothing more serious than an additional reminder of having unwisely surpassed his limits.</span>\n</p>\n<p> </p>\n<p>\n<span>After a few moments, Harry hesitantly spoke up again. “...But professor, if you were so tired, why couldn't someone else do it? Why did it have to be you?”</span>\n</p>\n<p>\n<span>And here they came to the root of the problem. “Mr Potter,” Severus murmured. “Look at me, if you would.” Patiently, he waited for Harry to meet his gaze. “I hope you are not regretting bringing the matter to my attention…?” he probed gently.</span>\n</p>\n<p>\n<span>Harry glanced away, biting his lip. “...no sir?”</span>\n</p>\n<p>\n<span>Severus sighed. “Mr Potter, it is my duty to ensure that every student feels safe within these walls, and doubly so in your case,” he said firmly. “Telling me you were afraid was </span>\n<em>\n<span>exactly</span>\n</em>\n<span> the right thing to do.”</span>\n</p>\n<p>\n<span>“Oh.” Harry contemplated that for a moment, then spoke up again. “Professor?”</span>\n</p>\n<p>\n<span>“Yes, Mr Potter?” Severus replied calmly.</span>\n</p>\n<p>\n<span>“Why, um...why 'doubly so in my case'?”</span>\n</p>\n<p>\n<span>“You know already that your mother was my friend,” Severus said slowly, choosing his words with care. He would not lie, but there were things the child was not ready to know. “In fact, she was my first, best, and for many years, my only friend. What I have not yet told you is that when we were in sixth year, we had a truly terrible fight, in which I said something so horrible that I could not take it back, and Lily could not forget it. We parted ways, and though in time I came to regret my words deeply, the circumstances of the war kept us too far separated for me to attempt the reconciliation I wished for.” Indeed, he still wished for it, so much so that if he </span>\n<em>\n<span>had</span>\n</em>\n<span> looked into that damnable mirror, he was all but certain that he would see Lily’s forgiveness there. “Lily died before I had the chance to ask if she could forgive me, but I knew that there was nothing in this world so important to her as your safety, and so I swore that, in her memory, I would protect you to the very best of my ability.”</span>\n</p>\n<p>\n<span>There was a pause as Harry took that in, then Severus added: “And if you are wondering why that protection was absent before your arrival at Hogwarts… I was informed you were placed with a loving magical family, and very firmly instructed not to contact you.” He was still contemplating what he would do about that...oversight. “Rest assured, Mr Potter, that if I had been aware what you were enduring, I would not have hesitated to intervene.”</span>\n</p>\n<p>\n<span>The child ducked his head, shoulders relaxing a little. “Thank you, sir,” he mumbled. “You’re really going to be alright?”</span>\n</p>\n<p>\n<span>“I really am,” Severus promised, glancing up at Poppy, who had appeared in the doorway of his room. “Now, go outside and enjoy the sunshine. If I’m not mistaken, your five minutes are up.”</span>\n</p>\n<p>\n<span>Following the last staff meeting of the year, when academic results were delivered to the Heads of House, there was always a second meeting of just the four of them to determine who the top three students were in each year, and to distribute points appropriately. The results were not precisely </span>\n<em>\n<span>predictable</span>\n</em>\n<span>, but they did follow certain patterns: Ravenclaws were well-represented in the lower years; Slytherins did better in the upper years where exam results were more meaningful; Hufflepuffs tended towards consistency across their subjects that usually got one of them into the top three; and Gryffindors were underrepresented. Indeed, Percy Weasley was the only Gryffindor who’d made it to the top three in the last several years. That is, until the current batch. </span>\n</p>\n<p>\n<span>“Well!” said Filius, when they reached the first year subject rankings. “I’d realised Miss Granger was remarkable, but I didn’t know she was so universally accomplished!”</span>\n</p>\n<p>\n<span>Minerva looked smug. </span>\n</p>\n<p>\n<span>“Between her and Mr Malfoy, they’ve taken top in every subject but mine,” Pomona commented. “And that’s the only one where they aren’t both in the top three, as well.”</span>\n</p>\n<p>\n<span>Severus hummed, already calculating the conversation he would need to have with Lucius if a </span>\n<em>\n<span>Muggleborn</span>\n</em>\n<span> beat Draco to first place. “Since we already know who first and second will be, shall we ascertain who has attained third place?”</span>\n</p>\n<p> </p>\n<p>\n<span>After some calculations, they determined that Finch-Fletchley’s consistently high results beat Li’s occasionally extraordinary ones, and Pomona happily took fifty points for Hufflepuff, bringing her House total up to a very respectable 2,352 - only seventy-four points behind Ravenclaw, which was currently in the lead. Slytherin and Gryffindor were close behind, however, and with at least a hundred points going to each of them depending on the final ranking, it was possible that Gryffindor would overturn Slytherin’s seven year streak.</span>\n</p>\n<p>\n<span>All they had to do was decide whether Hermione Granger or Draco Malfoy had the more impressive results.</span>\n</p>\n<p>\n<span>Granger had come first in Charms, Transfiguration, and History of Magic.</span>\n</p>\n<p>\n<span>Malfoy had come first in Defense, Potions, and Astronomy.</span>\n</p>\n<p>\n<span>Granger had come second in Herbology and Astronomy.</span>\n</p>\n<p>\n<span>Malfoy had come second in Charms, Transfiguration, </span>\n<em>\n<span>and</span>\n</em>\n<span> History of Magic.</span>\n</p>\n<p>\n<span>However, Granger had come third in Defense and Potions, and Malfoy had only come </span>\n<em>\n<span>fourth</span>\n</em>\n<span> in Herbology. </span>\n</p>\n<p>\n<span>Did a second and fourth outrank two thirds? Did the margin of difference matter? Did the subject matter? What about general behaviour? Should Madam Pince be consulted as a potential tie-breaker? Should Madam Hooch?</span>\n</p>\n<p> </p>\n<p>\n<span>The debate was lively, but it was verbal sparring more than a serious argument. The traditional Slytherin-Gryffindor rivalry was hardly a serious matter in comparison with the threats of recent weeks, after all. A few minutes in, Severus noted Filius conjuring quill and ink to start calculating Malfoy and Granger’s averages (presumably), but he was enjoying the verbal sparring too much to wait for hard numbers. </span>\n</p>\n<p>\n<span>At last, though, Severus had to concede. Granger’s Charms final was just too extraordinary. “Very well,” he said, bowing his head. “Mr Malfoy will take second place. Minerva, would you like to do the honours?”</span>\n</p>\n<p>\n<span>Minerva smiled triumphantly, but at least she didn’t brag. “It would be my pleasure, Severus,” she said evenly. “One hundred points to Slytherin, and...one hundred and fifty points to Gryffindor.”</span>\n</p>\n<p> </p>\n<p>\n<span>(“That was as good as a play,” Pomona muttered.)</span>\n</p>\n<p>\n<span>The end of term was always rife with loose ends to tie up - this one more than most. Indeed, Severus anticipated that certain threads would require managing for weeks or months to come. Others, however, could be dealt with more immediately.</span>\n</p>\n<p>\n<span>Harry, Weasley, Granger, and Longbottom passed through the barrier at Kings’ Cross together. From his vantage point, Severus could observe the exchange between the boy and Mrs Weasley, and soon spotted Andromeda and Ted (disguised by Polyjuice, with Harry sent pictures in advance) approach the group.</span>\n</p>\n<p>\n<span>“Are you ready, Harry?” Ted, despite wearing a different face, still seemed warm and friendly (his approachability made him very popular with his younger patients). Behind him stood Andromeda, less warm, but still visibly pleased to see Harry.</span>\n</p>\n<p>\n<span>“You must be Harry’s family!” said Mrs Weasley.</span>\n</p>\n<p>\n<span>“In a manner of speaking,” said Andromeda. “Come along, Harry, we need to be going.” She took Harry’s trunk and loaded it onto a trolley, ready to move away.</span>\n</p>\n<p>\n<span>Harry hung back for a last word with his friends. “See you over the summer, then.”</span>\n</p>\n<p>\n<span>“Hope you have a good holiday,” said Neville, looking nervously after Andromeda.</span>\n</p>\n<p>\n<span>“Oh, I will,” said Harry, with a grin. </span>\n</p>\n<p>\n<span>Severus nodded to himself, and returned to the school to finish packing.</span>\n</p>\n<p><a href=\"https://archiveofourown.org/works/17281838\" rel=\"nofollow\">The sequel</a> exists! Check it out and let me know what you think!</p>"
}