{
  "id": "1581335",
  "url": "https://archiveofourown.org/works/1581335?view_full_work=true",
  "author": [
    "hipsterchrist"
  ],
  "title": "i was found and now i don't roam these streets",
  "rating": "Mature",
  "archive_warnings": [
    "Graphic Depictions Of Violence"
  ],
  "categories": [
    "Gen",
    "M/M"
  ],
  "fandoms": [
    "Marvel Cinematic Universe",
    "Marvel"
  ],
  "relationships": [
    "James \"Bucky\" Barnes/Steve Rogers",
    "Minor or Background Relationship(s)",
    "Pepper Potts/Tony Stark",
    "Jane Foster/Thor",
    "Clint Barton/Natasha Romanov"
  ],
  "characters": [
    "James \"Bucky\" Barnes",
    "Steve Rogers",
    "Tony Stark",
    "Thor (Marvel)",
    "Clint Barton",
    "Natasha Romanov",
    "Bruce Banner",
    "Sam Wilson (Marvel)",
    "James \"Rhodey\" Rhodes",
    "Original Characters",
    "Original Female Character",
    "Original Female Character(s) of Color",
    "Original Male Character(s) of Color",
    "Original Male Character",
    "Original Child Character(s)",
    "Jane Foster (Marvel)",
    "Bucky Bear"
  ],
  "additional_tags": [
    "Team Dynamics",
    "Team Bonding",
    "Friendship",
    "Therapy",
    "Hospitals",
    "Medical",
    "Illnesses",
    "Minor Character Death",
    "Child Death",
    "Teddy Bears",
    "New York City",
    "Canon-Typical Violence",
    "Children",
    "Self-Esteem Issues",
    "Post-Traumatic Stress Disorder - PTSD",
    "Bucky Barnes Needs a Hug",
    "Bucky Barnes Feels",
    "Post-Captain America: The Winter Soldier"
  ],
  "language": "English",
  "series": "",
  "published": "2014-05-07",
  "completed": null,
  "words": "15,613",
  "chapters": "1/1",
  "comments": "449",
  "kudos": "12,946",
  "bookmarks": "4,466",
  "hits": "159,402",
  "summary": "<p>They’ve decided to start producing Bucky Bears again, now that he’s all shiny and redeemed and fighting for good on this big Avengers misfits team. \"He has a little shiny gray arm,\" Bucky says, wiggling the stuffed arm in question, one of the tweaks made in the new model. It takes Steve a second to realize that Bucky’s got a small smile on his face, actually looks a little bit proud around the eyes.</p>\n<p>Or, Bucky relearns himself and how to be on a team, the rest of the Avengers try to get answers, and everyone watches too much Criminal Minds.</p>",
  "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>The two baby sloth videos that Bucky and Tony watch are <a href=\"https://www.youtube.com/watch?v=q1mAGQAw3Oc\" rel=\"nofollow\">here</a> and <a href=\"https://www.youtube.com/watch?v=G-Zfozy7gGI\" rel=\"nofollow\">here</a>. At the team meeting Tony mentions, they also watch <a href=\"https://www.youtube.com/watch?v=t9TLsZAU0Fg\" rel=\"nofollow\">this one</a> involving sloth gymnastics and <a href=\"https://www.youtube.com/watch?v=1x5tjPWwABc\" rel=\"nofollow\">this one</a> involving potty training, at which point Clint taps himself out, because he saw enough animal poop growing up in the circus, thank you.</p>\n<p>Gregory's Coffee is a real place on 7th Ave., but it doesn't open until 6am, and Grandma's Place is a real place, too. I'm not familiar with the layout of the Morgan Stanley Children's Hospital of New York-Presbyterian and I'm sure they are actually very stringent on volunteer background checks, but the Child Life Centers and family lounges do exist there, according to the guides available online. </p>\n<p>Title from fun.'s \"Carry On.\"</p>",
  "text": "<p>They’ve decided to start producing Bucky Bears again, now that he’s all shiny and redeemed and fighting for good on this big Avengers misfits team. Steve sees them sitting in the window of a tiny neighborhood toy store in Brooklyn - an employee has painted the glass, flexing their bragging rights about being the home of Bucky Barnes before he was the Winter Soldier, and Steve rolls his eyes and braces himself before going inside, because hipsters really seem to like him, but he hates what they’ve done to his old home - and can’t resist buying one. Bucky’s been back with him, with them, and in recovery for nine months now, and Steve thinks this will make a nice little celebratory gift, a recall to a funny memory and, considering the tweaks that the manufacturers have made to the new Bucky Bear, an acknowledgment that Steve knows Bucky has changed irrevocably, can still do good as this different person. </p>\n<p>Bucky holds it in his hands and stares down at it, blinking slowly, completely silent. Steve’s explaining the whole thing to the rest of the team, how popular the original Bucky Bears were during the war, how any mail the Commandos ever got delivered to them was always full of letters for Bucky with photos of smiling children holding American flags and Bucky Bears tight to their chests, how even though Bucky was a sniper he was still considered more appropriate to cuddle with at night than a stuffed toy Captain America. Clint’s eyes have gone wide with excitement at this information and Bruce grins, admits to having been passed an old and faded hand-me-down Bucky Bear from his mother as a kid. </p>\n<p>“Well, where the hell is it now?” Tony asks. “Do you have any idea how much money you could make if you auctioned that off? An original Bucky Bear once owned by a tiny Hulk?” </p>\n<p>Bruce shrugs and rubs at the back of his neck. “It was buried with her.” </p>\n<p>“Oh,” Tony says with a wince, reaching out to squeeze Bruce’s shoulder in apology. “Hey, what if the toy companies started making little stuffed Avengers and Friends? Or just our Friends? Who do I talk to to get a Rhodey Bear made, is what I’m asking.”</p>\n<p>“Jealous that Steve’s best friend has a cuddly counterpart and yours doesn’t, Tony?” Sam says, grinning. </p>\n<p>Bucky finally looks up. “Rhodey definitely deserves a bear,” he says. Tony beams.</p>\n<p>“You know, he is going to be so glad to hear you said that,” Tony says, phone suddenly in hand, pointing proudly at Bucky and walking backward out the room. “Totally over the moon. He might even ask you out. Or kiss you. Just remember you brought this on yourself.” Bucky looks back down at the bear in his hands.</p>\n<p>Clint sits down next to Bruce and pulls out his tablet, opens a window to ebay. “We’re gonna find you a new old Bucky Bear, buddy.” Bruce starts to shake his head, but Clint gets like this when Bruce talks about his parents, resolute and determined to fix all memories of Bruce’s awful, abusive childhood. “Don’t you think it’ll be a good anger management tool?” he asks, only because appealing to Bruce’s more deliberately calming habits is a sure way to get him to relent. “Even the Hulk could use something soft to snuggle.”</p>\n<p>The room is quiet for a few moments, and Steve pokes Bucky’s side. “You don’t have to keep it if you don’t want to,” he says lowly. “I just, you know, I thought it would be--I thought it might--be nice.” It sounds more pathetic once it’s been said out loud. Steve frowns. “Yeah, you don’t have to keep it--” Bucky looks at him. </p>\n<p>“He has a little shiny gray arm,” Bucky says, wiggling the stuffed arm in question, one of the tweaks made in the new model. It takes Steve a second to realize that Bucky’s got a small smile on his face, actually looks a little bit proud around the eyes. </p>\n<p>“Yeah,” Steve says, tentatively happy, and then, thinking Bucky’s different pronoun use might be significant, “he does.” Bucky looks down at the bear again, smiles bigger.</p>\n<p>“I’ve got a therapy appointment,” Bucky says after a silent minute. </p>\n<p>Sam stands and pulls on his jacket, elbows Steve and says, “Keys, Steve? Steve, keys. Keys, Steve. Steve,” and Steve rolls his eyes, makes a big deal out of retrieving Sam’s car keys from his front pocket, and when he looks at Bucky again, the bear has disappeared. </p>\n<p>--</p>\n<p>Bucky’s been doing weird stuff with his money since he was made aware of both the bank account in his name full of decades upon decades of government pay and Amazon.com. Giant boxes of every candy invented in the past seventy years have kept the entire Avengers team amped on sugar for nine weeks and counting. One Tuesday two months ago, UPS delivered the entire collection of Disney’s animated films, which has supplied the features for the past twenty-two Tower Movie Nights and sparked countless arguments about animation eras in American cinema, all of which have gotten intensely heated in a surprisingly short amount of time. A heavy aluminum briefcase under Bucky’s bed holds a dozen weapons of varying size and purpose, all of them pink and eerily pretty. Members of the team keep tripping over one Harry Potter book or another, could push them together to form the complete series four times over in English and German and French and Russian. </p>\n<p>Still, when Bucky breaks away from the team during cleanup of a particularly gruesome gigantic robot attack and returns carrying three huge cardboard boxes of Bucky Bears, the whole team is fairly concerned. </p>\n<p>“So,” Tony says finally, across the table from Bucky at their usual shawarma joint, blessedly unaffected by their battle this time. “Bucky. Whatcha doing with all those Bucky Bears?”</p>\n<p>Bucky shrugs, tears into his third wrap with his teeth bared like an animal. Tony grimaces. “If you get the Rhodey Bear made,” Bucky says once his mouth isn’t full of food, “you should try to get a version of him in a little Air Force uniform made, too. Not just the War Machine suit.”</p>\n<p>“I’m gonna tell him you called him War Machine and not Iron Patriot,” Tony says. “He’ll be thrilled. He’ll change the name back immediately.” </p>\n<p>“Will he kiss me for that, too?” Bucky says, smirking. </p>\n<p>“Definitely,” Tony says. “He will definitely kiss you. Expert subject changing, by the way. You’re a class act.” Bucky laughs, wide and open and alarming.</p>\n<p>“My therapist thinks so, too,” he says, and takes another bite.</p>\n<p>--</p>\n<p>The boxes of bears disappear the next day with Bucky, except that Bucky returns eventually, in time for dinner, and the bears do not. Clint almost asks, but Bucky’s visibly on edge, dragging his fork across the plate just for the noise, wordlessly flexing his metal hand, not quite eating, hunching his shoulders up and ducking his head down. They all know better by now than to talk to Bucky when he’s like this, all have had bruises and a few still have scars to show for trying once, or twice. Steve’s is the only voice he responds to even remotely positively when he’s in this particular kind of little black rain mood, and tonight Steve pushes his half-full plate away and settles his hand over Bucky’s, stops the horrible dragging fork sound immediately. </p>\n<p>“Wanna go for a walk, Buck?” he asks. Bucky tilts his head up just enough to be able to look at Steve’s face. From his seat on the other side of Steve, Sam can’t tell if Bucky’s eyes are dead or just sad. A lot of times, it’s the same look. “We can get some street food,” Steve offers. “And some Starbucks.” One corner of Bucky’s mouth lifts. Steve gives him a smile. “I’ll order for you. You won’t even have to talk to anyone, or say the word ‘macchiato.’”</p>\n<p>They’re gone minutes later, Steve promising to bring back overpriced coffee for everybody, and as soon as the elevator doors close, Tony claps his hands gleefully and says, “Theories on where the bears went. Now.”</p>\n<p>But Clint says, “Funeral pyre,” first, and everyone else agrees, even Thor, who knows well his funeral pyres. </p>\n<p>--</p>\n<p>Two weeks later, Bucky buys another store’s entire stock of Bucky Bears. It requires delivery by truck to the Tower, and Tony watches helplessly as delivery boys pushing dollies loaded tall with boxes stare in awe at the digs. </p>\n<p>“Dude, you live here?” one of them asks Bucky as he picks up the last box. “Like, all the time? Why do you ever go outside?”</p>\n<p>“I get claustrophobic,” Bucky says, shoves a fifty in the guy’s hand. The boy shakes his head, tries giving it back, but Bucky closes his metal hand in a fist and says, “Uh-uh. The others all got the same amount. If it makes you feel bad, give half of it to the first homeless vet you see.”</p>\n<p>The kid nods, says, “You got it, Sergeant,” and tries to salute. Even accounting for teenage awkwardness, it’s all wrong, but Bucky doesn’t seem to mind. </p>\n<p>“Any reason why you’re piling my house high with Bucky Bears?” Tony asks after the delivery guys have all left. </p>\n<p>“I’m trying to get you to move out,” Bucky says, all faux reluctance like it’s a real confession. “I’m trying to get all of you to move out, leave this place for me and Stevie.”</p>\n<p>Tony scoffs. “As if you and Steve would know what to do with a residence like this.” Bucky makes a face like he’s trying to smile only because he knows he should, and Tony’s not having that, kicks Bucky’s shoe with his and raises his eyebrows expectantly.</p>\n<p>“Doesn’t matter, does it?” Bucky says finally, quiet and serious. “Steve deserves a place like this. Always did, but I could only ever give him couch cushions on dirty floors.”</p>\n<p>“Well, that’s a step up from couch cushions on dirt floors,” Tony says, aiming for light and landing somewhere around desperate and anxious. He’s ill-equipped to handle Bucky’s mood swings, especially the ones brought on by a mere stray thought of Steve.</p>\n<p>Bucky smiles, for real this time, and looks at Tony. His eyes are clear and kind. Tony likes Bucky best with eyes like this. “That’s a decent point,” Bucky says, and then his grin goes lopsided, which can only mean - “I wasn’t kidding about you moving out, though.”</p>\n<p>--</p>\n<p>The bears and Bucky are gone the next day. Bucky doesn’t return until after dinner this time, when the team is gathered around the TV on Thor’s floor, eating from four laughably large bowls of popcorn and marathoning Criminal Minds. He flops down in the only empty chair, his body stretched over the seat and his legs and head dangling over the armrests. He blindly reaches back with his metal hand to steal popcorn from Bruce’s bowl, and he’s not sure if it’s his aiming skills or Bruce’s shoving the bowl under his open palm that lends to him getting a handful on the first try. </p>\n<p>“So, Bruce,” Bucky says quietly, “what do you know about genetic diseases?” On Bucky’s other side, Natasha loses interest in the episode, turns a confused look on Bucky and Bruce. </p>\n<p>Bruce blinks at Bucky only once before answering. “Well,” he says, “a fair amount. What exactly do you want to know? It sort of depends on the disease.” Steve catches the last bit of Bruce’s words and nearly gives himself whiplash turning to look at him and Bucky with silent concern.</p>\n<p>“Let’s start with Juvenile Huntington’s Disease,” Bucky says. Clint turns toward them, leans forward with interest. </p>\n<p>“Huntington’s is pretty rare for juveniles,” Bruce says thoughtfully. “I think that’s only about 10 percent of all cases. The symptoms are different for everyone, but usually with kids, seizures are really common, stiffness in the muscles, tremors, that sort of thing. They’ll have trouble speaking or swallowing. Dementia symptoms are common, too.” Tony and Sam are listening now, watching Bruce and Bucky with narrowed eyes. </p>\n<p>“And the treatments,” Bucky says, “anticonvulsant drugs, right?” </p>\n<p>“Mostly, yeah,” Bruce says. “Those side effects can be pretty rough. Physical therapy is usually recommended, too, to help with the muscle function.” Bucky clears his throat.</p>\n<p>“Life expectancy?” he asks, and Thor, the last man watching, is no longer watching.</p>\n<p>“No longer than twenty years, on average,” Bruce says. “But if you’re talking juvenile - the earlier the onset, the more rapid the progression of the disease.” Bucky rubs a hand over his face.</p>\n<p>“And there’s no cure?” he says.</p>\n<p>“Not yet,” Bruce says. “Most research is focused on delaying the onset and developing therapies that help relieve the symptoms better than the current ones out there.” Bucky sighs, heavy and sad, and Bruce frowns. “Can I ask where all this is coming from?”</p>\n<p>“You can,” Bucky says, “but I won’t answer.” He sits up and swings out with his legs, is on his feet and across the room in a flash, and before he disappears across the hall into the elevator, he says, “You’re all shitty spies.”</p>\n<p>--</p>\n<p>No more Bucky Bears enter the Avengers Tower. Bucky still sometimes goes missing for entire days, though, and returns at night almost exclusively to pick Bruce’s brain. One night it’s muscular dystrophy, another it’s leukemia, and then it’s lupus, and later cystic fibrosis. He’s started cornering Bruce away from the others, glancing over his shoulder before every question in case someone’s standing behind him now, listening. Bruce is happy to talk, happier still to not ask further questions about Bucky’s sudden interest in medical conditions and advancements, but he mentions it to the rest of the team every time it happens, just in case it becomes relevant later. </p>\n<p>The problem is that Steve refuses to invade Bucky’s privacy by hounding him about where he goes on those days he disappears and why he comes back full of questions about cancer and blood disorders. </p>\n<p>“Why does it have to be me anyway?” Steve asks, arms crossed stubbornly over his chest.</p>\n<p>“Because out of all of us, he’s least likely to get mad and try to kill you,” Clint says, rolling his eyes like the answer is obvious.</p>\n<p>“Which is pretty funny, considering he’s already gotten mad and tried to kill you,” Tony says. Sam slaps him on the back of the head.</p>\n<p>“All this Stark money and you still can’t buy tact,” he says. “Look, I’m with Steve on this one.”</p>\n<p>“Shocking,” says Natasha.</p>\n<p>“I am, too,” Bruce says. </p>\n<p>“Traitor,” Tony says. Bruce makes a kissy face at him and waits for him to smile before continuing.</p>\n<p>“If he was going to use medical knowledge to, I don’t know, poison us all or infect us with some deadly disease,” Bruce says, “then he wouldn’t be asking about genetic conditions.”</p>\n<p>“It’s possible he could give us all cancer,” Clint says. “Was that arm checked for radiation?”</p>\n<p>“Okay, stop,” Steve says, authority in his voice, and it’s just like they’re in the field: everyone goes quiet and stands at attention. “I know that I’ve got a Bucky-sized blind spot, but I’m pretty sure I would have noticed almost a year’s worth of evidence of his secret plans to poison us. He’s not a killer, not anymore. He’s one of us. We wouldn’t have this conversation about Tony, or Bruce, or Sam, or Thor. We’re not going to have it about Bucky.” </p>\n<p>“I would have this conversation about Tony, Bruce, <i>and</i> Sam,” Clint says. When everyone looks at him, he shrugs, says, “I’m only half-joking. That otherworldly brainwashing thing did a number on my sense of trust. But I get what you’re saying, Cap. We’ll lay off.”</p>\n<p>“You would not assume misdeed on my part, Clint Barton?” Thor asks, sincere curiosity all over.</p>\n<p>“Nah, buddy,” Clint says. “Not you.” He holds out his fist and grins when Thor bumps it with his own. </p>\n<p>“This has been a strange morning,” Sam says, “and that concerns me, because it’s been a very normal morning.”</p>\n<p>“We can go for another run,” Steve suggests, all innocent eyes and guileless smile, “and I can kick your ass again. It’ll be like a restart button.”</p>\n<p>“Fuck you, Steve.” </p>\n<p>Steve laughs all the way to the elevator.</p>\n<p>--</p>\n<p>There’s an open press conference, and then a signing, and it’s Bucky’s first of both since officially joining the team. The others encourage him to speak up, let the public get to know him as an Avenger, but he doesn’t want the public to know him as anything, so he stays quiet, utterly silent save for exactly three instances of laughter, two of which were at Tony’s expense. The final question is from a little boy who holds a Bucky Bear in one hand and the microphone in the other when he asks, “Will there be Bears of the other Avengers?” </p>\n<p>Bucky decides to talk. </p>\n<p>He leans forward, smiles big, and says, “Not officially, that I know, but Tony and I are working on getting a War Machine Bear made, so we’ll see.”</p>\n<p>The boy’s eyes go wide at the mention of a Rhodey Bear and it makes Bucky’s face hurt, how hard he’s smiling. The kid’s father looks considerably less enthused, takes the mic from his son and asks, “You really think a <i>War Machine</i> Bear is appropriate for a child?” </p>\n<p>Bucky’s face falls immediately, not into anger or hurt, just confusion, which is enough to make Steve and Natasha try to cut Bucky off before he can respond, but they’re too late. “I’m a sniper turned assassin for HYDRA,” he says, his voice like sandpaper amplified through the mic in front of him. “It hasn’t even been a year since I was deprogrammed. I’m still regaining memories I lost, and I’m fighting next to my best friend who I nearly killed eighteen months ago. I murdered Howard and Maria Stark. I started wars - not figuratively, literally, me, <i>I</i> started wars that killed millions of people. I’m probably going to be in therapy for the rest of my life and the only reason I manage to go every week is because the Falcon drives me there and sits in the waiting room until my hour is up and drives me back. You think a Bucky Bear is more appropriate for your son than a teddy bear based on an Air Force Colonel who’s saved countless lives, who saved <i>the President</i>, because his codename is a little militaristic?” </p>\n<p>Tony starts clapping, and Thor pounds his hand on the table in support, and most of the audience begins to cheer, but Bucky still has confused, imploring eyes set on the father, now flustered and huffing. He turns to look at Steve, who’s staring at him with a heartbroken look on his face, and Bucky doesn’t know <i>why</i>. </p>\n<p>“Why are they <i>clapping</i>?” Bucky whispers. </p>\n<p>“Bucky,” Steve says quietly, puts his hand on Bucky’s knee and squeezes, shakes his head, and it answers nothing, but it makes Bucky feel much farther away from tipping over the edge of panic any second. Bucky still has to go to the restroom and splash water on his face before the signing starts, press hard at his forehead with the metal hand until it stops feeling like his frontal lobe is going to explode from the sudden wash of guilt. He’s so tired. He considers bailing, could easily exit the building without even being seen, will never ever forget how to be a ghost, but he pokes his head into the big conference room and sees a little dark-skinned girl in line, wearing an Avengers backpack and hugging a Bucky Bear close to her, and he chooses to stay. </p>\n<p>The adults seem uneasy about him now, in a way that they weren’t during the press conference at first, which is fine with him because it means making less small talk than he’d originally anticipated. People go from Natasha on his right directly to Steve on his left, and Steve keeps trying to send them back to him, keeps saying, “Oh, you’ve skipped an Avenger!” like he doesn’t know they’re doing it on purpose, and Bucky keeps twirling his pen around his fingers like a knife and saying, “No, they didn’t,” and resolutely not taking his eyes off a spot on the ceiling directly above the emergency exit sign. The little girl hugging the Bucky Bear, though, shyly says, “Thank you, Black Widow,” and then leaps in front of Bucky. He looks down and doesn’t hesitate before meeting her big grin with his own. </p>\n<p>“Hey there, little lady,” he says. “That’s a pretty neat toy you’ve got there.” She hunches up her shoulders and hugs the Bear tighter, says nothing. Bucky ducks under the table and crawls out from under the heavy cloth covering it, sits cross-legged in front of the girl and gives her a kind smile. “Is this okay?” She nods and he notices that the Bear’s silver arm is covered in stickers. “You’re a good decorator,” he says, pointing at a tiny cupcake below the red star. “I’m a little jealous of this Bucky, to be honest.” The girl’s eyes go wide and she shoves the Bear into Bucky’s hands, twists her bookbag around to unzip it, and pulls out a dozen sheets of stickers, each with a different theme. She hands them to him, taking the Bear back like a trade, and shoving her bookbag around again.</p>\n<p>“I got plenty more at home,” she says proudly. “You can have all of those!” Bucky stares down at little rainbows and goldfish and airplanes. </p>\n<p>“Thank you,” he says, looking back up at her and smiling. “Help me choose which one should go on first, then.” She picks a yellow kitten, reaches out to hold his metal hand and turn his arm over, presses it carefully to his cold wrist. He runs his thumb over it slowly. “What’s your name?”</p>\n<p>“Talliyah,” the little girl says, and then, in a whisper, “Is it true what you said? That you killed Iron Man’s mom and dad?” Bucky leans toward her and lowers his voice.</p>\n<p>“Yes,” he says, “all of it is true. I wasn’t who I am now when I did it, but that doesn’t change the fact that I did it.” He frowns at the Bucky Bear under her arm. “Kind of makes him less cuddly, I guess.”</p>\n<p>Talliyah shakes her head. “No,” she says, earnest and loud, “you asked for help and you had friends on your side. My mommy’s in rehab, and my aunt says she’s brave and good because she had the courage to ask for help. She says it’s the hardest thing you can do. You’re getting better just like Mommy’s getting better, and she’s my hero and so are you.”</p>\n<p>Bucky clenches his jaw hard enough to give himself a headache, ignores the tears stinging suddenly at his eyes. He holds his arms open and asks, “Is it okay if I hug you?” Talliyah smiles and launches herself at him, throws her arms around his neck and squeezes so he can feel the Bucky Bear at the back of his neck. “Don’t tell anyone,” Bucky says when she lets go and moves away, “but you’re <i>my</i> hero. Thank you for the stickers, Talliyah.”</p>\n<p>“You’re welcome, Bucky!” she says happily, bouncing as she steps over to get in line to meet Steve. “I love you!” Bucky smiles.</p>\n<p>“I love you, too, Talliyah,” he says, just loud enough for her to hear, and then realizes that Steve and Natasha are both leaning over the table to look at him, curious expressions on their faces. “Sit down, you two,” Bucky says, waving his metal hand dismissively above his head. “I’m okay. I’ve got stickers!” A boy appears next to him suddenly, wearing a shirt that’s all black except for one silver sleeve. </p>\n<p>“You’ve got stickers?” the boy asks, eager and wide-eyed.</p>\n<p>“Sure do,” Bucky says, brandishing twelve sheets of assorted stickers. “You wanna pick the next one that goes on?” He turns his arm to show the kitten and the boy gasps, reaches out to hold the metal wrist, the silver contrasting with his brown skin.</p>\n<p>“Cool!” he says, and picks a shiny purple airplane, smooths it out over a space above Bucky’s elbow. Bucky beams at him.</p>\n<p>“Look at that!” he says, holding out his arm proudly. “You picked a good one. What’s your name?”</p>\n<p>“Rico,” the boy answers, and Bucky holds up his hand for a high five.</p>\n<p>“Thank you, Rico,” he says. “I like your shirt.” Rico grins. </p>\n<p>“My dad gave it to me the last time he was home on leave,” he says. “He’s in the Army!”</p>\n<p>“I thought you looked like an Army brat,” Bucky teases. “What’s he do in the Army?”</p>\n<p>“He’s a Captain,” Rico says. “He’s got a team and everything.”</p>\n<p>“Sounds like you should be talking to our Captain over there,” Bucky says, jerking his thumb over his shoulder toward where Steve is sitting, signing autographs and smiling for Instagram pictures. Rico shakes his head.</p>\n<p>“We do love Captain America,” Rico says, “but my dad always says he’d be nothing without his best friend overseas. He says the people who protect him from the sidelines should never be overlooked because they’re the reason people like him and Captain America are still here.”</p>\n<p>“Your dad’s right,” Steve says loudly, leaning over the table again. “I wouldn’t have even been Captain America without Bucky.”</p>\n<p>Bucky doesn’t look up at Steve. Instead, he leans closer to Rico and stage whispers, “I paid him to say that.” Rico laughs and Bucky grins again, and this time it’s Rico who asks for a hug before he lines up for Steve. </p>\n<p>“You’ve really got a way with these kids, Bucky,” Steve says above him. </p>\n<p>“Sign your pictures, Stevie,” Bucky says, and smiles at the little girl who approaches him now. She’s carrying a Bucky Bear and wearing green sneakers that roar like the Hulk with each step. “Oh, I bet your teachers love those,” he says to her, and two minutes later he’s got a cupcake with pink frosting stuck at the top of his metal shoulder, another hug, and small crowd of children around him, most holding Bucky Bears, some wearing Winter Soldier shirts, all eager to decorate his arm. By the time the signing ends and the room is being cleared, parents are having to pull their kids away from him, and the shiny metal of his arm is hardly visible. </p>\n<p>“New look, Bucky?” Tony asks, putting on his sunglasses as the Avengers finally exit. Bucky peels one of the few unused stickers off a nearly empty sheet and sticks a bunch of bananas to the right lens of Tony’s sunglasses. Tony sighs dramatically. “Why do you hate me, Bucky?” Bucky throws his head back and laughs.</p>\n<p>--</p>\n<p>Recovery has pushed Bucky dangerously off his game. It’s before dawn and he’s in the pitch dark of the kitchen on the main Avengers floor - Steve’s fridge was out of eggs, and so was his own, and he didn’t want to bother checking anyone else’s - for a full twenty seconds and doesn’t notice another person in the room until they say, “Heard you’ve been up to some tricks, Sergeant.”</p>\n<p>Bucky jumps, grabs a knife from his belt and throws it as he spins around, before he can register that the mystery guest is a friend and not an enemy. Rhodey’s already moved, though, had probably darted away from the corner table as soon as he’d spoken, Bucky realizes, and the blade ends up stuck in the wall, handle shivering ominously. </p>\n<p>“I’m sorry,” Rhodey says, hands up in placating surrender, face sincere and guilty but not scared. Even with his heart thundering in his chest, Bucky appreciates that Rhodey’s never been afraid of him. “That was my fault. Lights, JARVIS?” Light floods the room, subdued enough for the painfully early hour but bright enough to scatter the darkest shadows. Bucky squeezes his eyes shut and counts to fifteen before opening them again. Rhodey’s next to him now, cracking the eggs Bucky had retrieved into a pan and flipping on the stove. </p>\n<p>“That’s how you Air Force guys do it, huh?” Bucky says, forcing out a chuckle. His voice still trembles. He used to have better control of this. “Sit in the dark like an owl, scare a fella fresh out of bed, and then cook him breakfast to apologize?” </p>\n<p>“Who says this breakfast is for you?” Rhodey says, but he grins anyway, shakes some pepper into the eggs he’s scrambling, the way Bucky likes. “You never answered me, you know.”</p>\n<p>“About the tricks I’m allegedly up to?” Bucky asks. He places his hands on the counter behind him, pushes up until he’s sitting next to the burners, his heels kicking lightly at the cabinets below. “Let me guess: Tony thinks I’m going to put anthrax in his pillow.”</p>\n<p>“He said something about infecting him with sickle cell anemia, actually,” Rhodey says. “Then, when I explained in great detail why that was impossible, even for an ex-assassin, he moved on to brain cancer caused by radiation from that arm.” He taps Bucky’s metal elbow with the spatula. “Mostly I think he’s just worried about you, with your disappearing acts, but paranoia is easier for Tony than concern for other people, so that’s where he lands.”</p>\n<p>“There’s no radiation emitting from my arm,” Bucky says. Rhodey sighs and turns off the stove.</p>\n<p>“I know, Bucky. Plate.” Bucky reaches behind him and pulls a plate from the cupboard, holds it out in front of him and watches Rhodey scrape the eggs onto it. Rhodey opens a drawer on the other side of the stove and hands Bucky a fork. He leans his hip against the counter, watches Bucky eat in silence for a few moments, and finally says, “What <i>do</i> you do when you’re gone all day?”</p>\n<p>Bucky says nothing, continues to eat. He chews slowly, stares straight ahead at the knife lodged in the wall, and when his plate is finally clean, he says, “If I show you, do you promise not to tell Tony?”</p>\n<p>“Assuming it’s nothing that’s putting you or the others in imminent danger,” Rhodey says. “You know I have no problem letting Tony sweat.”</p>\n<p>Bucky drops down off the counter, puts his plate in the sink, and says, “Let’s go, then.” On his way out of the kitchen, he pulls the knife out of the wall and shoves it back in his belt, adds, “Thanks for breakfast.”</p>\n<p>--</p>\n<p>“So where’d you drag Rhodey off to all day?” Tony asks at dinner that night. “And does it have anything to do with the stab wound in the wall behind you?”</p>\n<p>Bucky looks over his shoulder at the damage. He shrugs. “Easy patch job,” he says. “Steve used to put holes in our walls worse than that and he wasn’t even all bulky then.” Steve puts his fork down in a huff.</p>\n<p>“I only punched the walls because you <i>moved</i>,” he says. </p>\n<p>“Well, yeah,” Bucky says. “You packed a wallop even when you were scrawny and asthmatic, and unlike <i>you</i> ever did, I had the good sense to run away.”</p>\n<p>“You were supposed to be teaching me how to <i>fight</i>,” Steve says.</p>\n<p>“Exactly,” Bucky agrees. “You <i>still</i> hardly know how to duck.”</p>\n<p>“Okay, Grandpas. You’re not sidestepping the subject again,” Tony says, pointing his fork at Bucky. “Where’d you take Rhodey?”</p>\n<p>“Toy factory,” Bucky answers easily. “Needed his approval for the Rhodey Bear prototype. He’s pissed it was me who got it done and not you, by the way. Might not be your best friend anymore.”</p>\n<p>“Fine,” Tony says. “Don’t tell me.” </p>\n<p>“Wasn’t planning to.”</p>\n<p>“You have to tell someone,” Tony says. </p>\n<p>“Leave him be, Tony,” Thor says. “If the good sergeant wishes us to not know, then he is not required to share his secret with us.”</p>\n<p>“Thanks, Thor,” Bucky says. “Spar with me tonight?” Thor smiles at him around a mouthful of spaghetti.</p>\n<p>“With great pleasure,” Thor says. </p>\n<p>“What about you, Bruce?” Bucky asks. Tony perks up again at that.</p>\n<p>“Oh, what’s the topic tonight? Non-Hodgkin’s lymphomas?” Tony says. </p>\n<p>“Actually, I was thinking we could revisit thalassemia,” Bucky says. </p>\n<p>“Are we really just going to ignore the arm?” Sam asks. He’s been staring at Bucky’s metal arm, covered in stickers again, for the better part of a half-hour. </p>\n<p>“You like it?” Bucky says, stretching out his arm, eyes twinkling. “Rhodey did it. His artistic genius is clearly wasted in the Air Force.”</p>\n<p>“<i>Where</i> do you <i>go</i>?” Clint says, loud and exasperated. Bucky tilts his head from side to side, grinning.</p>\n<p>“Harvard Law School,” he says in a high-pitched voice, and Steve and Thor laugh, because Natasha sat them down to watch Legally Blonde last week, and it took approximately sixteen minutes after the credits rolled to realize what a horrible mistake that had been. Tony groans. </p>\n<p>“Don’t take this the wrong way, Bucky,” he says, “but you’re literally my least favorite teammate.”</p>\n<p>“What, like it’s hard?” Bucky says, still smiling sweetly. Natasha sighs.</p>\n<p>--</p>\n<p>Sam pokes at Bucky’s metal arm in the waiting room. “Dude, what is up with these crappy little drawings?” Bucky turns toward him with a glare, but it relaxes so fast Sam thinks he might have honestly imagined it this time.</p>\n<p>“Just some doodling yesterday,” he says. “Kinda hard to get a good angle when you’re drawing on one arm with the other hand, you know.” Sam makes a noncommittal sound.</p>\n<p>“Thought Steve was the artist,” he says. </p>\n<p>“He was,” Bucky says. He looks sad all of a sudden. “Is he still? Does he sketch anymore?” Something about the uncertainty in his voice breaks Sam’s heart.</p>\n<p>“Not that he lets anybody see,” Sam says. “If even you haven’t seen him, then he’s not gonna let any of us catch him at it.” Bucky looks up at him again with surprise in his eyes.</p>\n<p>“I think he’d let you see,” he says. Sam doesn’t know what to say to that. Bucky’s rarely this open and unguarded. It’s the therapist’s office that does it, Sam thinks. “I used to save up for weeks to buy him high-end pencils and paints,” Bucky says. He smiles at the memory. “He hated it. Kept telling me to save my money for something important. As if there was anything more important to me than him. I’d have gone hungry for months if it meant he’d have things that made him happy.”</p>\n<p>“You thought it would keep his mind off the war, didn’t you?” Sam asks knowingly. Bucky looks at the ground like he’s ashamed.</p>\n<p>“I told him I enlisted,” he says quietly, and Sam knows he’s getting access to a secret about Bucky Barnes that even Steve doesn’t have. “Because what else could I tell him? He was killing himself trying to join up and get sent to Europe, and I was the lucky able-bodied bastard who got the draft letter.” Bucky kicks at the carpet like a stubborn child. “I’d have done anything to keep him from going,” he says, “and when I got my orders, I thought, At least if I die, Stevie won’t have to.”</p>\n<p>“But you died, and then Steve wanted to,” Sam says. Bucky scoffs.</p>\n<p>“He’s so stupid.” They’re silent for a few moments, and Sam pulls out his phone to do a Yelp search, and then, “Do you think we could stop at an art supplies store on the way back?” </p>\n<p>“Already on it,” Sam says, showing Bucky the results page. Bucky smiles. </p>\n<p>“I’m glad he’s got you, Sam,” Bucky says. Sam looks at him.</p>\n<p>“Thanks, Bucky,” he says. “I’m glad he’s got <i>you</i>.” The door to the personal office opens and a woman with a kind face peeks out and smiles at them.</p>\n<p>“You’re up to bat, Bucky,” she says. </p>\n<p>“Gonna hit a home run this time, Doc,” Bucky says, standing and strutting his way across the room toward her office. “Make the Dodgers so proud they’ll move back home.” She rolls her eyes good-naturedly and moves aside to let him into the room behind her. Just before she shuts the door, Sam could swear he sees a little plush bear head with a black eye mask poking out of Bucky’s jacket pocket. </p>\n<p>--</p>\n<p>Bucky finds Steve lying on the couch, sketchpad perched on his chest, putting lazy pencil strokes across the page. </p>\n<p>“Dunno if Stark told you,” he says, leaning over the back of the couch, raising an eyebrow at Steve, “but you got your own floor.” Steve grunts, shrugs as much as he can in this position. “Not that I’m complaining,” Bucky says. He grips the back of the couch with his metal hand and jumps over it. Steve brings his legs up just in time to avoid Bucky landing heavy on his shins, and Bucky rests his arm across Steve’s knees. “It’s nice to see you draw again.”</p>\n<p>“I never really stopped,” Steve admits, eyes focused on the paper in front of him. “I just--stopped letting people see, fighting with the Commandos, and then.” He pauses, lets the sketchpad fall back, looks up at Bucky’s face. “After I woke up, drawing what I saw….”</p>\n<p>“Didn’t look right,” Bucky finishes. Steve nods, sighing. Bucky looks away from him, swallows. “Sometimes, I think I remember images of how the city looked in the decades you missed. They’re not full memories, and maybe that’s better, but--just snapshots of development and destruction. I’m not sure if I want them to be real or not, ‘cause if they’re real, it means I--”</p>\n<p>“It means you weren’t--” Steve tries, but Bucky gives him a sharp look and counters the interruption.</p>\n<p>“It <i>means</i> I was here, and I was doing something terrible.” Steve frowns. “You gotta let me deal with what I did, Stevie,” Bucky says. “Just ‘cause I wasn’t doing it by choice doesn’t erase it.”</p>\n<p>“I know,” Steve says. It’s a conversation they’ve had before. “I’m sorry.” He sits up, setting the sketchpad and pencil on the coffee table. “How are the nightmares?” Bucky shrugs. </p>\n<p>“Not as bad as they were at first, usually,” he says. “Every once in awhile I still wake up standing with a knife in my hand, though, trying to fight to the death with random household objects. I’ve lost more desk lamps that way.” He smiles, and Steve knows it’s okay to laugh, so he does.</p>\n<p>“I’ve noticed the fan mail is getting full of kids and their Bucky Bears again,” Steve says. </p>\n<p>“Stickers, too,” Bucky says. “<i>So</i> many stickers. Parents are apparently sending vintage ones, too. I think I prefer old Lisa Frank to new Lisa Frank.”</p>\n<p>“I don’t know what that means,” Steve says, then, “Hey, let me decorate your arm.”</p>\n<p>“The stickers are in my room,” Bucky says with a groan, “and I don’t feel like movin’.”</p>\n<p>“Good, ‘cause I want to use that paint you got me,” Steve says, groping blindly at the floor under the coffee table. He pulls up a canvas bag with a victorious raise of his fist, and retrieves brushes and acrylic paints from it. He drags the half-empty cup of water that’s been on the table for days closer to him, dunks a brush into it, and scrutinizes his available paint colors. “Don’t move, jerk.”</p>\n<p>“Hurry it up, then, punk,” Bucky says.</p>\n<p>“Tony would say you can’t rush genius,” Steve says, finally settling on white. Bucky laughs. </p>\n<p>“Just like Howard,” Bucky says. “What’d you do in a past life to get landed with two generations of Starks?”</p>\n<p>“Dunno,” Steve says, holding Bucky by the elbow and painting the red star a vivid, clean white. “But clearly you were there, too, else you wouldn’t be here with Tony and me now.”</p>\n<p>“Of course I was there,” Bucky says, like he’s offended Steve would suggest he wouldn’t have been right next to him in their past lives, fucking up something big enough to get them punished with multiple rounds of Starks. “Can’t let you go anywhere alone, can I? You’d just embarrass yourself, like when you walked in on me and Marlene that time.”</p>\n<p>“This again?” Steve asks, eyes wide and mouth twisted up into an exasperated smile, still focused on painting. “You were with her in <i>my</i> bed! What was I supposed to do?”</p>\n<p>“You were <i>s’posed</i> to notice the tie on the doorknob, hear the noises she was making, and go to my room until we were done, <i>like a normal person would</i>,” Bucky says. </p>\n<p>“Because <i>a normal person</i> runs into their best friend and their dame of the week in his own bed so often, I guess, right?” Steve switches the brush with white paint on it for a clean one, dips it in the blue, and starts outlining Bucky’s now white star.</p>\n<p>“I went with Marlene for <i>two</i> weeks, thank you very much,” Bucky says. “Had to take her to dinner four times to get her into bed with me.”</p>\n<p>“And I think you’re exaggerating her enjoyment, by the way,” Steve says. “I distinctly remember not hearing any noises from her.”</p>\n<p>“Probably ‘cause she was strictly into dames herself,” Bucky says thoughtfully, and Steve stills the brush in his hand, looks up at him.</p>\n<p>“Wait, really?” he asks. Bucky nods. “Marlene?” </p>\n<p>“She told me when she dumped me a few days later,” Bucky says. </p>\n<p>“Huh,” Steve says, goes back to painting. “It’s nice that she felt comfortable enough to tell you.”</p>\n<p>“Yeah, well,” Bucky shrugs with his right shoulder only. “Apparently it was obvious how I felt about you, so I guess it made her feel like she could trust me with it. Plus, she thought you walking in on us was a sign that you and me should be together. She was so earnest about it, I didn’t have the heart to tell her we sorta already were.” Steve laughs.</p>\n<p>“We kind of always were, weren’t we?” Bucky turns his head to look at Steve, takes in the look of concentration on Steve’s face, all that Steve Rogers attention focused solely on beautifying the horror of Bucky’s metal arm, and feels like he’s ten years old again, stupid in love with his best friend and not even knowing what that meant.</p>\n<p>“Yeah,” he says softly. “Always were, always will be.”</p>\n<p>“‘Til the end of the line,” Steve murmurs, using his thumb to rub away a stray stroke of blue paint. Bucky closes his eyes and lets his head fall to rest on the back of the couch. He wakes up two hours later with Steve curled up on the couch next to him, his feet tucked in between Bucky’s back and the sofa, like he’d been trying to make himself small again. </p>\n<p>Bucky looks down at his arm and sees a white star on blue, outlined by red, glances at the table to see three brushes resting in the glass of murky water. He gets up carefully, slowly, and grabs the blanket from the chair across the room. As he throws it over Steve, his eyes catch the sketch he’d interrupted earlier: Bucky holding a Bucky Bear, one of the new ones, pinching at the left arm, and smiling proudly. </p>\n<p>--</p>\n<p>In a mid-afternoon battle in Queens, Maximillian Zaran aims a spear at a child on her way home from school, and Bucky breaks. Sam kicks the gun out of the guy’s hands, turns in the air to kick him in the face, but the Winter Soldier is already there, pinning him to the ground like he’s nothing. With his knees on Zaran’s chest, the Winter Soldier slashes with a knife at Zaran’s arms, across Zaran’s exposed throat, before tossing the knife away and punching, cruel and relentless, with his left hand. It takes both Thor and the Hulk to pull him back, and he’s still thrashing and gritting his teeth the whole way. The Hulk holds him in a hug, says, “SOLDIER. CALM,” and after a full minute, he finally relaxes, and the Hulk drops him as gently as possible onto the street. Bucky’s face down and coughing, shaking, and when he finally manages to push onto his arms and look up, the team is staring down at him, fear and concern in their eyes. </p>\n<p>“Is the girl okay?” Bucky asks, scrambling to his feet, dizzy and ignoring it. “He didn’t hurt her, did he? He was going to--” He sees her then, a little girl in a bright blue dress, stopped still on the sidewalk two blocks ahead, staring at the scene before her. He smiles at her, waves, and Tony jumps in front of him, faceplate raised, looking wild-eyed and angry. </p>\n<p>“Don’t fucking smile and wave at a little kid with blood all over your face, Patrick Bateman!” he says. “What the hell is wrong with you?!” Bucky steps back, blinking in surprise, and wipes at his face, spits out the blood he suddenly realizes has splattered in his mouth. He looks down at Zaran, sees less of a face and more blood-soaked hair and asphalt, teeth and flesh and skull fragments drowning in it. </p>\n<p>“He was--” Bucky starts, breathing heavy and quick, heartbeat in overdrive like it hasn’t been in months. “He was gonna kill her. He was going to kill a child. I just--” He catches sight of his metal arm, his punching hand, widens his eyes at the blood, thick like paint on his knuckles, sprayed all the way up to match the star on his shoulder. There’s a tooth jammed between two fingers, cartilage strewn across where fingernails should be. His knees buckle, and Sam and Steve are there on either side of him just as the panic attack really starts. “I did it,” he says to Sam, uncontrollable tears falling. “I--I killed him, I was the weapon, Winter Soldier, I did it--”</p>\n<p>Sam presses his palm to the back of Bucky’s neck, looks him in the eyes, says, “No, Bucky, listen to me. Today you were Bucky. He wasn’t a mark and you weren’t an assassin. He was a <i>bad guy</i>, Bucky, and <i>you</i> made the choice. You weren’t under orders; you didn’t hurt anyone innocent. You <i>saved</i> someone, Bucky. You saved a <i>kid</i>.” </p>\n<p>“He was going to--” Bucky says, turning his head toward Steve on his left side, but Sam puts his hand on Bucky’s bloody face, directs Bucky to look back at him again.</p>\n<p>“Steve’s got you,” Sam says. “Steve’s here, he’s cleaning up your arm, okay, Bucky? I need you to focus, though. I need you to pay attention to my breathing and then do like I do.” He guides Bucky through it, the slow and deliberate inhale and exhale, and after a minute or two Bucky’s not even shaking on the exhale that much, and he lets the hand that was resting on Bucky’s cheek drop to hold Bucky’s right wrist again. Bucky looks to his left again, sees Steve sitting cross-legged next to him, bare-chested with a bundle of blue material stained with red tossed over his shoulder, and Bucky realizes that Steve used his own shirt to clean the blood off Bucky’s arm. </p>\n<p>“Steve,” he says, horrified, but Steve slips his fingers between Bucky’s metal ones and smiles. </p>\n<p>“You okay, Bucky?” he asks. “You with us? With me?” Bucky swallows.</p>\n<p>“‘Til the end of the line, pal,” he says, and Steve nods, stands and pulls Bucky up with him. </p>\n<p>--</p>\n<p>Two days later, Bruce pulls back the sheets on his bed to find a Bucky Bear and a Hulk Bear. The Hulk Bear is wearing little purple shorts and is hugging the Bucky Bear. Under them is a note that reads, “SOLDIER THANKS.” He laughs at that, and sets the bears on the pillow next to his head.</p>\n<p>The rest of the team finds Bear versions of themselves in their living quarters over the course of the following week. The Black Widow Bear wears a necklace with an arrow on it; Natasha stares at it for fifteen minutes before she places it gingerly on the table next to her bed. When Sam squeezes the Falcon Bear, wings pop out of the back of its shirt, and he’s never felt so delighted. The Iron Bear’s faceplate opens to reveal a goatee, and when Tony peels back the suit, there are threads crisscrossing, forming scars, like it got an arc reactor removed, too. Clint finds the Hawkeye Bear perched on top of the entertainment center in his living room while he’s doing a routine sweep for unauthorized surveillance, pulls a tiny arrow from the quiver on the Bear’s back, and cackles when he actually manages to fire it with the bow in the Bear’s hand. The Thor Bear holds a miniature Mjolnir, and Thor brings it to bed and shows it to Jane with unbridled excitement, even though Jane’s still half-asleep. Steve gets out of the shower to find the Captain America Bear on the counter next to the sink, holding its little shield above its head like an umbrella for the steam. </p>\n<p>Tony gets a text from Rhodey on a Wednesday night: a picture of a Rhodey Bear in a little Air Force uniform and a War Machine Bear in the suit’s original design, with the caption, <i>Thought u were only kidding!!</i> Tony stares at the picture the entire way to Bucky’s floor, and when he gets there, he finds Bucky sitting on the kitchen tile, Stark Industries-issued laptop balanced on his knees, watching YouTube videos of baby sloths. Tony has a million questions, like he’s always had for Bucky, like, <i>Why are you sitting on the kitchen floor? Why didn’t you tell me you really were having Bears made for Rhodey? What is it with you and kids? What did you think of my father? Where do you go on the days you disappear? Did you think we’d stop noticing just because you got us Bears? That’s not really where you’ve been going, is it, to get those manufactured? It can’t be, because you’re still leaving, right? Why sloths? Have you ever even slept in your bed or have you just been crawling into Steve’s every night since you moved in?</i> </p>\n<p>He forgoes all of them in favor of sitting down next to Bucky and saying, “You could’ve just talked to us, you know. We’re your team.” </p>\n<p>“You're Steve’s team,” Bucky says, his eyes never leaving the screen. Tony doesn’t blame him. Turns out baby sloths are seriously adorable. “I’m the scary eighth wheel.” </p>\n<p>“Have you ever heard of a seven-wheeler being anything but terrifying and unsafe?” Tony asks. “No, you haven’t, because a seven-wheeled vehicle would just be very terrifying and extremely unsafe. You need the eighth wheel. <i>We</i> need the eighth wheel.”</p>\n<p>“You need the eighth wheel to be sane if you’re gonna be safe,” Bucky says, and Tony starts laughing because he just can’t help it. Bucky looks at him. </p>\n<p>“Bucky, I’ve got news for you: the other seven wheels aren’t exactly a secure package of sanity either,” he says. “Natasha has more secrets than hair follicles on her entire body, Clint grew up in a fucking <i>circus</i>, Bruce has a literal monster of anger inside of him that he can actually <i>control</i>, how is <i>that</i> not scary, Thor’s daddy issues intimidate the hell out of <i>my</i> daddy issues, Steve was like - listen, I don’t know if he’s told you, so if he hasn’t, don’t tell him I did - but he was really fucking depressed before you popped back up, I was getting calls from Natasha every week just worried as fuck about him, even if she didn’t use the word ‘worry,’ and I fought one battle with all these weirdos and immediately started building them their own separate floors here, and I thought that was a normal reaction until Pepper looked at me with <i>pity</i> in her eyes, and then I was like, Wow, I really need friends. Sam’s the only one who came to this game put together, but that’s because he was put through the ringer already and got out the other side. Are those sloths hanging out to dry?” </p>\n<p>Bucky blinks, glances at the screen. “Yeah, they got a bath and now they’re drying.”</p>\n<p>“Oh my god,” Tony says. “<i>Fuck</i>, that’s the cutest thing I’ve ever seen. But hey, so my point is, we’re all getting better, right? Natasha’s opening up more, Steve’s a lot happier, Bruce has made peace with the Green Guy, Clint only checks for bugs once a week now instead of twice a day, Thor’s here because he likes us more than he’s angry at his family, I’m not the loneliest boy in New York anymore, Sam’s got a team again, I know that means a lot to him, and you--” </p>\n<p>“Me,” Bucky agrees. Tony shrugs.</p>\n<p>“Isn’t it obvious? You’re getting better, Bucky,” he says. Bucky shakes his head, looks away from Tony, away from the computer screen. </p>\n<p>“I’m mean to you because I don’t deserve you to be nice to me,” Bucky says. “Or whatever your equivalent of nice is. You shouldn’t even want me on this team.”</p>\n<p>“Why?” Tony asks. “Because you killed my parents? When you were under some Nazi mind control?”</p>\n<p>“You were still just a kid--”</p>\n<p>“Yeah, and it sucked,” Tony says. “It’s in my top three worst things that have ever happened to me, and I have had a considerable amount of terrible things happen to me, and when I first found out that the guy Steve was chasing murdered my parents - yeah, I was pissed. I took a sledgehammer to his floor. I had to remodel everything, so that was pretty stupid in hindsight, but honestly? Bucky, I spent decades thinking I was crazy for suspecting that their death hadn’t been an accident, and then years after that thinking my dad’s best friend had them killed for control of the company, and of me, and just - knowing that my parents had HYDRA so damn nervous that they sent their best master assassin to get them out of the way of HYDRA’S dream world? It’s actually - it’s helped. I know that’s weird, but it’s true, and I want you on this team, and it’s not because you used to be a weapon. I don’t just want you fighting next to me, okay? I want to fight next to <i>you</i>, because I know you never got into any fights that weren’t ones your best friend had started, and you’ve had your life stolen from you again and again and again since 1942, and you’re still here, you never gave up, you’ve never stopped fighting. I know what it’s like to be the friend who starts the fights, and Rhodey never let me lose one, he never stopped looking for me, he never gave up.” Bucky’s looking at him now, and Tony sighs. </p>\n<p>“Last week when you went to town on that Zaran guy,” Tony says, voice low, “I wasn’t <i>mad</i> at you, I wasn’t scared of you. I was scared <i>for</i> you, because I thought it meant something happened to the progress you’ve been making, I thought we - I thought Steve was losing you again, I thought you were losing <i>yourself</i> again. I wasn’t fucking mad at you for killing a guy who was going to kill a kid - are you kidding? That was like, my first day as Iron Man. None of us were worried you were going to kill us in our sleep, Bucky. We were worried for you, and if you’d just talked to us instead of creeping around our living quarters leaving personalized gifts like a fucking Criminal Minds episode, then you’d know that, but I guess you also wouldn’t be moping in your kitchen watching baby sloths, so, you know, maybe it’s for the best.”</p>\n<p>Bucky’s silent for a few moments, and then says, “But you like the Iron Bear, right?”</p>\n<p>“Iron Bear is my new lab mascot, I like it so much,” Tony says. “Hey, where do you go when you disappear all day?”</p>\n<p>“Nice try, Tony,” Bucky says, turning back to his laptop in time to watch a shaved baby sloth get smeared with sulfur and lard. </p>\n<p>“What the fuck?” Tony asks. </p>\n<p>“He had mange,” Bucky explains. “See, now they’re swaddling him so he doesn’t lick it off.”</p>\n<p>“Jesus,” Tony says. “I’m so mad about how cute that is.” He stands up, says, “Email all these sloth videos to me. I’m making everybody watch them. Team meeting.”</p>\n<p>“You got it,” Bucky says, and, just before Tony leaves the room, “Tony?” Tony turns back, looks like he expected this, and Bucky runs his hand through his hair. “Thank you,” he says, “for, you know. Just - thanks.” Tony nods. </p>\n<p>“Don’t mention it,” he says, and Bucky knows he means it. </p>\n<p>--</p>\n<p>Steve is sweaty and shivering under a thin, scratchy blanket, tired and achey. Bucky’s curled around him, an omnipresent protective force, and Steve’s coughing has shaken Bucky awake.</p>\n<p>“Steve,” Bucky murmurs, his arm heavy over Steve’s chest. “Stevie, shh, lemme get you some water.” He starts to crawl out from under the blanket, but Steve grabs his hand, holds it with all the strength he can muster.</p>\n<p>“Please stay, Bucky,” he rasps. “You’re the only thing keeping me here.” Bucky settles over him again immediately, pressing soft kisses to the back of his clammy neck, humming sweet little sounds into his thin skin.</p>\n<p>“Stevie,” Bucky whispers. Steve shifts back against Bucky’s body, swallows past a raw and burning throat. “Stevie,” Bucky repeats, and Steve grunts an underwhelming response. Bucky’s hand comes to rest on Steve’s arm and, after a second, squeezes; it’s cold and unyielding. “Stevie,” he says, and Steve opens his eyes to Bucky standing over him, fully dressed, metal hand curved protectively over Steve’s bicep. “Stevie?” Bucky says, and then, “You sleep like the dead.”</p>\n<p>“After seventy years, it’s a habit,” Steve says with a small smile, their usual morning joke. He blinks the dream out of his vision, squints past Bucky at the angry red numbers of the clock on the shelf and groans. “Buck, it’s not even five.”</p>\n<p>“You always get up before dawn,” Bucky says.</p>\n<p>“This is <i>before</i> before dawn,” Steve whines. “What’re you doin’ awake anyways?” He rolls over, stubbornly pulling the comforter up to his neck as he goes. “Come back to bed, Bucky.” There’s silence for a few moments, and then--</p>\n<p>“You wanna know where I go when I’m gone all day?”</p>\n<p>Steve rolls over to look at Bucky again. “Really?” he asks, heart pounding fast. “You’re gonna take me with you?” Bucky grins, and it’s blinding.</p>\n<p>“Get dressed,” he says. “We’re on a schedule.”</p>\n<p>Steve decides to take his wardrobe cues from Bucky, like he did every day for the first few months after Bucky moved in. Bucky’s wearing tight dark jeans and a Black Widow t-shirt under one of Steve’s plaid button-downs, open and casual, because even through decades of brainwashing and memory loss Bucky could still never shake his effortless coolness, so Steve pulls on jeans and a t-shirt too - Hawkeye, because he’s feeling sentimental and sarcastic - and sits to put on the loose-fitting sneakers that Sam’s still trying to get him to call “kicks.” Bucky stands patiently at his left, and Steve glances at Bucky’s boots to see that the laces are red, white, and blue. “When’d you swap those out?” he asks, tugging lightly at a loop, recalling months of fighting next to Bucky’s bloodstained black laces, and Bucky only shrugs.</p>\n<p>It’s just after five by the time they step outside, and Bucky leads the way to a coffee shop on 7th. He pauses before opening the door, says, “It’s not Starbucks, but they’re not open this early, and Gregory’s has better pastries.”</p>\n<p>“Think most New Yorkers would be glad it’s not Starbucks,” Steve says as he walks in.</p>\n<p>“Think most New Yorkers are pretentious assholes.” Steve can’t exactly argue with that, despite the amusement he’s gotten from Bucky discovering an unbridled love for overpriced chain coffee. Still, Steve doesn’t miss the delight on Bucky’s face at the two young men behind the counter greeting him by name. </p>\n<p>“The usual, Bucky?” the one at the register asks. His arms are covered in tattoos and his bottom lip is pierced. Steve can’t stop staring at it. </p>\n<p>“Double it,” Bucky says, gesturing at Steve behind him. Two lattes and two chocolate croissants in hand and two twenties placed in the tip jar later, and Steve and Bucky are back outside. Steve takes a bite of his chocolate croissant and swears loudly in appreciation. “Exactly,” Bucky agrees, and stuffs the entire thing in his mouth at once. Steve follows him onto a bus where he watches Bucky talk to the driver like they’re old friends, and maybe they are, Steve realizes, when Bucky’s asking how the driver’s grandson’s Little League game went last week. They get off after twenty-five minutes, Bucky waves a goodbye to the driver, tells him that the Winter Soldier is rooting for West Side, and leads Steve down 120th. </p>\n<p>“Harlem?” Steve asks, looking around, smiling politely when the few people on the street at this hour wave to him and Bucky.</p>\n<p>“Got the name of the place from Sam,” Bucky says, tossing his coffee cup into a trash can. Steve follows suit.</p>\n<p>“What place?” Steve says, and then, “Wait, has Sam known what you do and he hasn’t told me?” </p>\n<p>“He doesn’t know,” Bucky says. “He just mentioned the shop once.” He gives Steve a significant look. “And he doesn’t tell you everything about me, you know.”</p>\n<p>“What shop?” Steve asks again, but then Bucky stops so abruptly that Steve just barely manages to not crash into him. Bucky raises an eyebrow at Steve and looks up. Steve follows his gaze to take in a brown storefront and a name written in blue and black lettering on yellow and red, Grandma’s Place. He looks through the glass of the storefront, into the dark of the shop, at the yellow sign indicating that the store is closed. “Uh, Bucky--”</p>\n<p>“I’m comin’, Sarge,” says a woman with short gray hair and a friendly face approaching them. Bucky grins at her.</p>\n<p>“Wouldn’t dream of rushin’ you, darlin’,” he says, moving out of the way for her to unlock the door. </p>\n<p>“Should still be dreaming,” she says, and Bucky holds the door open while she enters the shop and turns on the lights, disappears into the back room. Steve stands next to Bucky inside the store and stares in awe at the dolls surrounding him, in all different shades of dark and light skin and varied hairstyles, at books with children of color on the covers, at toys made for autistic kids. </p>\n<p>“This place is amazing,” he whispers to Bucky. “Is this where you got those Avengers Bears made?” Bucky nods, and the woman reappears from the back of the store pushing a dolly loaded with two large boxes. </p>\n<p>“Here you go, Sarge,” she says, handing him a clipboard and a pen. He signs for the order and hands them back to her, leans down to pick up one of the boxes. </p>\n<p>“You’re an absolute angel,” Bucky says with a smile, while Steve grabs the second box. “You sure you won’t take a tip? It’s really the least I can do for making you get up this early.”</p>\n<p>“Anything for those kids,” she says, ushering them out so she can close the shop again. “But you can take me out to dinner like you promised.” Bucky laughs. </p>\n<p>“You got it,” he says. “We’ll double date with Iron Man and Pepper Potts.”</p>\n<p>“Thor and that Dr. Foster girl look like they’d be more entertaining,” she says, locking up. </p>\n<p>“Whatever you want, dear,” Bucky says, bending down to kiss her on the cheek. “See you next week.” She waves a farewell and Bucky and Steve set off again. </p>\n<p>“What’s in the boxes?” Steve asks, hoisting his up on his shoulder. “And what kids?”</p>\n<p>“You’re asking lots of questions, Stevie,” Bucky says. “Just be patient.” Steve sighs, rolls his eyes, but Bucky reaches out to hold Steve’s left hand, and Steve decides to try patience.</p>\n<p>They sit next to each other on the A train, boxes in the empty seats on either side of them. Bucky hooks his ankle around Steve’s and Steve traces little stars and hearts on Bucky’s palm with his fingers. No one gives them a second look. Steve turns his head, catches Bucky’s eyes, rests his forehead against Bucky’s, and says quietly, “It’s kinda nice, isn’t it? That it doesn’t matter who sees, no matter where we are.” He pauses, frowns, and, thinking of the weird Avengers publicity, amends, “Well, I guess it does matter, a little.”</p>\n<p>“Not to me,” Bucky says firmly, instantaneous, and Steve presses a grateful kiss to his mouth, his jaw, down to his neck. Bucky smiles, squirms away, and Steve feels a triumphant little thrill at the sight of Bucky’s face tinted pink. “<i>Does</i> matter if you make me miss our stop, though,” he says, rolling his eyes, and Steve laughs and squeezes his hand. It’s past seven when they get off at the sixth stop, and Steve manages to keep quiet as they walk, even as he follows Bucky into the children’s hospital. </p>\n<p>“Good morning, ladies,” Bucky says, approaching the welcome desk in the lobby. He sets his box on the floor by his feet and, like a dial being suddenly pushed to its maximum, turns up his charm. Steve can practically see the girls Bucky used to date in the faces of the middle-aged women behind the desk, flattered and flushed and falling all over themselves to greet him. Steve wants to laugh, but not as much as he wants to see this unedited, this world Bucky’s whittled down for himself when no one else was looking, where he’s charming and happy and full of purpose again. It’s the closest Bucky’s come to being the Bucky Steve knew before the war, or even during it, in eighteen months. </p>\n<p>“I brought a friend with me today,” Bucky’s saying, jerking his thumb toward Steve. “I know you lovelies are usually so thorough with your background checks for volunteers, but we can make an exception just this once for Captain America, right?” He fixes a lazy, smug look on his face, the kind of smirk that reaches past his eyes, the exact expression that used to have dames lining up around the block for him, that he only ever used on Steve when he really wanted something. The women at the desk are eager to please, too, and hand over a badge to Steve that says VOLUNTEER in big black letters. Steve doesn’t notice that the badge they give Bucky says BUCKY BARNES until they get to the elevator. </p>\n<p>“How’d <i>you</i> pass the background check?” he asks once they’re inside, and Bucky turns the smirk on him, all the evidence that’s needed. Steve nods, swallows, fidgets with his jeans. “Got it.” Bucky laughs at him.</p>\n<p>“Get yourself together, Steve,” he hisses, teasing. “We’re in a children’s hospital, you dirty old man.”</p>\n<p>“Jerk,” Steve grumbles.</p>\n<p>“Don’t you wish?” Bucky says, and the doors open to the fifth floor, and Bucky leads Steve to the Infectious Diseases Unit. The nurse standing at the desk, with a headscarf and a beautiful face, stops looking through papers on a clipboard and smiles at Bucky, clearly happy to see him. “Assalamu alaikum, Yalda,” Bucky says to her, and Yalda’s eyes light up.</p>\n<p>“Much better than last time,” she says. “Alaikum assalam, Bucky, Captain Rogers.”</p>\n<p>“Just ‘Steve,’ please,” Steve says, reaching his hand out to shake hers and then jerking it back. “I’m sorry - I know this, should’ve waited for you to initiate that.” She looks impressed.</p>\n<p>“You said you found him in an alley?” she asks Bucky. </p>\n<p>“Over and over again,” Bucky says, picking up the clipboard from the counter and scanning the paper on it. “Getting punched in the stupid face every time. Did Marcus finally get discharged?” The amused look on Yalda’s face falls. </p>\n<p>“No,” she says, quiet and sad. “He passed away last week.” Bucky looks up at her, stricken.</p>\n<p>“What?” he says. “But--he was doing so much better a month ago.”</p>\n<p>“You know how it can go by now,” she says, not unkindly. “Sometimes it gets better before it gets worse, and then sometimes, it stops getting better.” She takes in Bucky’s sad face, says, “You should know - we lost Rianne, too, a week and a half ago, and Damien the week before that. It’s been gloomy around here since your last visit. The kids could really use you.” She takes the clipboard from him. “I’ve got rounds to finish. You two can help with breakfast. It was nice to meet you, Steve. No food fights this time, Bucky.”</p>\n<p>“Nina started it!” Bucky says, but Yalda’s on her way down the hall, waving dismissively behind her. Bucky turns to Steve. “C’mon. We can put the boxes in the Child Life Center and then pass out breakfast. You’ll get to meet the kids individually before the real fun starts, it’ll be good.”</p>\n<p>“Real fun?” Steve asks, but he follows Bucky anyway, and in twenty minutes they’ve been given responsibility for a cart loaded with trays of hospital breakfast food. “Can you believe hospital food nowadays?”</p>\n<p>“It’s so much better,” Bucky agrees. “Nobody around here believes me when I tell them that the food used to be worse. No respect for their elders.” He knocks lightly on a door before opening it, pushing the cart inside. “Hey, Jonas!” </p>\n<p>“Bucky!” The boy - he can’t be older than eight, and his bare head and bony arms make something distant ache inside Steve’s chest - sits up in bed instantly at Bucky’s greeting, smiles like he’s not in a hospital.</p>\n<p>“What’re you doing in the Infectious Diseases Unit, buddy?” </p>\n<p>“Pneumonia,” Jonas says with an exaggerated frown, rolling his eyes. “Chemo messed up my immune system.” He takes the tray Bucky hands to him. </p>\n<p>“Steve here knows a thing or two about pneumonia,” Bucky says, and Jonas finally notices Steve, his eyes going wide and his jaw dropping open. “He used to get it every winter, sometimes twice. Huh, Steve?”</p>\n<p>“Nuh-uh,” Jonas says. </p>\n<p>“It’s true,” Steve says with a shrug. </p>\n<p>“I told you he was sick all the time,” Bucky says. “He looked different then, though. He was all skin and bones, like you. And you know what? He still made it through every time.” Bucky pats Jonas’ knee through the blanket. “You’re gonna be fine, Jonas.” Jonas smiles.</p>\n<p>“Thanks, Bucky,” he says. “Are you both gonna be in the Center today?”</p>\n<p>“Yup,” Bucky says. “Got a surprise for you, too, so you’d better eat your breakfast if you don’t wanna miss it.”</p>\n<p>The remainder of breakfast goes the same way. Most of the kids already know Bucky, and the few who haven’t met him yet have heard about him from the others, almost cry when they do meet him, like they’d been thinking all the stories were just collective fever dreams. None of them ever once refer to Steve as Captain America, but he can tell that it’s not for lack of recognition; they know him, instead, as simply Steve. </p>\n<p>“Is it true you punched Hitler over two hundred times?” an eleven-year-old girl with endocarditis asks him. </p>\n<p>“Is it true you never ran away from a fight?” a five-year-old tuberculosis patient asks him. </p>\n<p>“Is it true Bucky saved your life?” a nine-year-old boy in for multiple bone infections asks him.</p>\n<p>“Well, sort of,” he says, and, “Yes,” and, “Multiple times.”</p>\n<p>“And then he saved mine,” Bucky says. “Even after I almost killed him. He spent months trying to find me, and another month convincing me that I was more than what I’d been, until I finally came back to New York with him.” </p>\n<p>Steve keeps preparing for a simplified story, pretty lies and less gruesome metaphors, but Bucky never once veers from the truth. A little girl he’s never met before - admitted two weeks ago and diagnosed with HIV that no one understands why she has - tells him she’s read in magazines and heard on radio talk shows that he’s a killer. Bucky owns up to it immediately, explains the brainwashing and HYDRA in age-appropriate detail, says, “But you know, even before that, I was a sniper in the Army, and I killed people then, too, and now, I’m an Avenger, and sometimes I kill people still.” The girls’ shoulders slump, like she’d been hoping it wasn’t true. Bucky gives her an understanding smile. “I don’t know how I feel about it, honestly,” he says, “but everybody has choices, every day, and sometimes they feel impossible. Some days I wake up and I don’t want to go to therapy, or out to save the world, or get out of bed, or keep living. Do you ever feel like that?” The girl nods slowly, and doesn’t flinch when Bucky puts his metal hand on her shoulder. “It’s okay to feel like that. The toughest thing about healing is choosing to do it every single day,” he tells her. “But I promise you, Olivia, I <i>promise you</i> that it’s worth it.”</p>\n<p>“Bucky,” Steve says when they leave Olivia’s room. “You never told me you felt like that.” Bucky shrugs, doesn’t meet Steve’s eyes.</p>\n<p>“It’s not a big deal,” he says. “It’s not something I need to talk about. These kids, though, they need to hear it sometimes.”</p>\n<p>“Bucky,” Steve says again, but Bucky’s already going into another room, tray in hand.</p>\n<p>After returning the empty cart to the kitchen, Steve follows Bucky into the Child Life Center again, and Bucky says, “Time to unpack!” He pulls a knife from his belt and cuts the tape on both boxes, swift as he is in battle, and Steve finally opens the box he carried all over Manhattan. </p>\n<p>“Are you--” he says, gingerly removing a small plush doll from the box, like the ones back at Grandma’s Place, except that it looks exactly like the girl who asked him about Hitler: brown skin and dark eyes, black hair in a ponytail behind her head. He stares down at the doll, slackjawed. </p>\n<p>“Am I what?” Bucky asks, and Steve glances over to see that Bucky’s box is full of Bucky Bears. </p>\n<p>“You had these made,” Steve says, picking out doll after doll, cute plush replicas of most of the children they just served breakfast. “You had these custom made for each kid here.” Bucky frowns, takes one of the dolls from Steve’s hands. He peers into the box in front of Steve and removes two more. </p>\n<p>“I was too late with these,” he says quietly, rubbing his thumbs over the dolls’ faces. He tucks one into each of his jacket pockets, the third into a back pocket of his jeans. Steve wants to ask so many questions, but a boy in a wheelchair - David, Steve remembers, four months here, bacterial infection in a wound on his thigh that keeps coming back worse than before - enters the room.</p>\n<p>“I ate my breakfast!” he says excitedly. Bucky smiles at him. </p>\n<p>“I guess you’re here for your surprise then, huh?” he asks. David nods, spins around in the chair a few times, giggling. </p>\n<p>“I can wait, though,” David says. “Bucky likes to wait for all of us to get here,” he explains to Steve, sounding very proud to know Bucky’s routine.</p>\n<p>“That’s very egalitarian of him,” Steve says, and Bucky rolls his eyes. </p>\n<p>“Hey, David, you wanna race Captain America?” he asks, which is how Steve finds himself running laps at full speed around the Center. Bucky is pushing David, not holding back at all, and David is laughing, arms up in the air, shrieking as he and Bucky manage to beat Steve in the final lap. </p>\n<p>“Okay,” Steve says, breathing a bit hard, hands on his knees. “Not bad.” Bucky and David bump fists with matching grins.</p>\n<p>More children begin joining the three of them in the Center, and by nine, the Center is full of sick kids, their families, a few nurses, and Bucky and Steve. Bucky and Steve pass out the custom dolls to their human counterparts, and Bucky Bears to the new kids and their siblings. Jonas stares at his doll - Bucky had owed it to him, had been planning on swinging by the Cancer Unit to give it to him before they left - for so long that Steve begins to think that something’s wrong with it, but when he bends down and asks, Jonas wipes at his eyes and says, “He’s perfect.”</p>\n<p>Steve thinks of the way Bucky called his new Bucky Bear “he” instead of “it,” tries to think of what Bucky would have said to him if he had ever gotten sick the way Jonas is sick, and says, “Yeah, he is, and so are you, Jonas.” Jonas looks at him with shining, watery eyes, and Steve puts his hand around Jonas’ tiny wrist, the way Bucky used to touch him when he was on bedrest for weeks at a time, and he hopes that Jonas finds it just as comforting as he did. </p>\n<p>One of the kids - Harper, ten years old, osteomyelitis - challenges Bucky to a few rounds of Mario Kart. Steve’s never seen Bucky play any of the video games at the Tower, and Bucky’s usually the first to get bored and leave the room when Tony and Clint pull out the controllers, but he’s apparently widely known as something of a Mario Kart champion at the hospital. Harper recruits her younger sister and Olivia to play the other two cars, and most of the other children gather around as spectators, many rooting for Harper and Olivia as hospital representatives, but some of them - including Jonas, Steve notes - cheer loudly for Bucky. Steve sits down on the floor just outside the circle of kids, figuring he’s as good at corralling as anyone, if he needs to, and notices the boy sitting next to him. </p>\n<p>“Hey,” he says, and the boy looks at him shyly. “You’re the kid from the Smithsonian, aren’t you?” The boy smiles and nods, happy to be recognized. “What’s your name?”</p>\n<p>“Brady,” the boy says. “I was on a family vacation. Nobody believed me when I told them after that you were there.” Steve smiles.</p>\n<p>“Well, thank you for keeping my secret,” he says. “So, you live here in New York, huh? Do you mind if I ask what brings you to the hospital?”</p>\n<p>Brady looks down at the floor. “It’s my sister,” he says miserably, and points to a small girl in the crowd ahead, wearing a pink and purple wig, cheering for Harper. “She’s got cancer, only not right now. When it’s in remission, she gets infections, which is why we’re here this time, but then she gets better, and it just comes back.” He looks up at Steve with sad eyes and a clenched jaw. “Sometimes I don’t think she’ll ever <i>really</i> get better.” Steve reaches out and touches Brady’s elbow.</p>\n<p>“I know it feels that way,” he says, thinking of how Bucky must have felt as they grew up together, Steve in and out of hospitals, doctor’s offices, sickbeds, never knowing if the next hit would be the fatal one. “I bet she feels like that sometimes, too. I bet sometimes she feels like it’s not worth fighting. But you know what even a little bit of helps a whole lot?” Brady shakes his head. “Hope,” Steve says. “I know it feels hopeless, but you’ve gotta show her that you believe in her. Sometimes people you love having hope for you, believing you can do something - that’s what makes it worth the fight. You think you can do that for your sister?”</p>\n<p>“Yes, sir,” Brady says, and Steve smiles.</p>\n<p>“You can just call me ‘Steve,’ Brady.” </p>\n<p>The Mario Kart competition somehow lasts until lunch, with lots of kids getting tagged in as substitutes, and even Steve trying a couple of rounds - he’s not bad, but there’s a whole minute where he’s driving into a wall repeatedly, and he can never get out of the way of the banana peels that Bucky throws. Bucky and Steve distribute the meals again, and then help with cleaning up the kitchen. When Steve asks about their own lunch, Bucky blinks like he’d forgotten about eating entirely, and they end up buying several of everything from the vending machine and sitting side by side on the tile floor, eating messy chips and licking chocolate from their fingers. </p>\n<p>“Do you ever get angry that we were only one year away from experiencing Almond Joys when they first started making them?” Steve asks, because it’s easier than any of his other questions.</p>\n<p>“Only every time I eat an Almond Joy,” Bucky says, crumbling a Kit Kat wrapper in his metal hand. “Too bad the war couldn’t wait. For several reasons.” He sorts through his remaining junk food, says, “I’ll trade you a bag of Doritos for that Reese’s.” Steve pulls a face, grips his package of Reese’s Cups protectively.</p>\n<p>“That’s a terrible trade, you cheat,” he says. Bucky laughs.</p>\n<p>“Nah, if I was gonna cheat you, I’d just--” and then he’s kissing Steve, and Steve’s lost in the faint chocolate taste of Bucky’s mouth, and in seconds Bucky is smiling against Steve’s lips and pulling away, opening a pack of Reese’s Cups as he goes. Steve blinks, his mouth swollen and red and open, and Bucky grins at him from around a bite of peanut butter and chocolate. </p>\n<p>“Hey!” Steve says, and Bucky laughs again, victorious and merciless.</p>\n<p>“And that was with me getting it right out of your <i>hands</i>,” he says. “Let’s hope no supervillains ever learn of your weakness, or you’ll be necking with Thor’s little brother next time he visits.”</p>\n<p>“Nobody says ‘necking’ anymore,” Steve says, stubborn and pouting as best as he can. Bucky gives an exaggerated sigh and hands him a Peanut Butter Cup.</p>\n<p>“And that’s a damn shame,” Bucky says. “It was a great term. You ready for Round Two at the Infectious Diseases Unit?” </p>\n<p>The afternoon sees more parents hovering anxiously against walls, always instantly relieved when they see Bucky. He stops to talk to them all, introduces them to Steve, asks them questions about the kids’ conditions that the kids can’t answer. One mother starts crying while describing the horrible side effects that the treatment is having on her son, and Bucky puts his metal arm around her shoulders, lets her sob on his chest, and Steve wonders, with a sudden jolt of shame and grief, if Bucky had ever had to do the same with Steve’s mother. It’s over an hour before Bucky goes back to playing with the children, in a corner this time, helping a little boy decorate a Barbie Dream House. Steve stands nearby, watching silently, and after a few minutes, he feels a tugging at his jeans. </p>\n<p>He looks down to see a girl with pink and purple hair. “Well, hello there,” he says, crouching down to look at her face. “I met your brother Brady earlier. What’s your name?”</p>\n<p>“Lila,” she says, hugging a doll with pink and purple braids to her chest and twisting from side to side. </p>\n<p>“You have a beautiful name, Lila,” Steve says. “Just like your hair.” Lila giggles.</p>\n<p>“You’re nice,” she says. “Just like Bucky said.” Steve smiles.</p>\n<p>“Oh yeah?” he says. “Do you like when Bucky visits?”</p>\n<p>“Uh-huh,” Lila says. “He gives me hugs and toys, and he’s nice to Mommy and Daddy and Brady.” </p>\n<p>“He was always real nice to me, too,” Steve says. Lila nods. </p>\n<p>“The news and the Smith-zone-yun say you’re Captain America,” she says, “but we kids here, we know the truth.”</p>\n<p>“Do you?” Steve asks. He’s not sure where this is going.</p>\n<p>“Uh-huh,” says Lila. “Just like we know Bucky isn’t really Winter Soldier. We know he’s really Bucky Barnes, and you’re really Steve Rogers, Bucky Barnes’ best friend.” </p>\n<p>It’s an identifier Steve hasn’t heard spoken with such conviction and certainty in decades, and maybe that’s why it knocks the breath out of him like fights never do anymore. He remembers Bucky at the signing a couple of months ago, the way he was so careful, and asks Lila, “Can I give you a hug?” When Lila nods and throws her own arms open, Steve leans in and holds her, ends up lifting her off the ground without even meaning to. Tears escape his eyes, and he has to wipe at his face quickly with the back of his hand when he lets her go. </p>\n<p>“Don’t cry, Steve Rogers,” Lila says, patting him on the elbow. “Grownups are always crying ‘round me, but I’m getting better!” She skips off proudly, and Steve watches her plop down on the floor next to Bucky, who elicits her help with decorating immediately. Steve leaves the room as inconspicuously as possible, heads down the hall to the family lounge, where he sits in the first empty chair he sees and rests his head in his hands. </p>\n<p>“Having a rough time of it?” a woman next to him asks, and he sits up instantly. </p>\n<p>“Oh, no,” he says, “I’m not--”</p>\n<p>“Captain Rogers!” the woman says. “I guess Sergeant Barnes finally brought you.” Steve blinks at her.</p>\n<p>“Uh--”</p>\n<p>She holds out her hand. “Major General Tricia Martin,” she says. “Call me Trish.”</p>\n<p>“As long as you call me Steve,” he says, shaking her hand. “You know Bucky?”</p>\n<p>“My daughter’s been in and out of here for the better part of a year,” Trish says. “Compromised immune system. Gets infections a lot. Sergeant Barnes is a star around here.”</p>\n<p>“I’m sorry about your daughter,” Steve says, and Trish frowns, shrugs a little.</p>\n<p>“I appreciate that,” she says. “It kills me to see her so sick over and over. Just when we think she’s in the clear, something else crops up. But like I said, Barnes is a star. He makes these kids so happy, keeps them getting the care they need.” Steve furrows his brow, and Trish tilts her head. “He hasn’t told you? He pays for all the parts of the hospital bills that insurance won’t cover, expensive medications and experimental treatments, long stays, all of that.”</p>\n<p>“For--for this ward?” Steve asks.</p>\n<p>“For the whole children’s hospital,” Trish says. “Apparently on his second day volunteering here, he went to the billing department, wanted to pay the balances for everyone who’d been in the Cancer Unit for the past three months. Raised hell when they wouldn’t do it, but I guess he wore them down eventually. Maybe something to do with the arm.” She holds up her left arm, widens her eyes meaningfully. “Anyway, now he covers it all, and I heard the nurses saying he’s talking to someone about setting up a scholarship program so that kids from poor families can come here.”</p>\n<p>Steve stares at her. “I--” he says. “I had no idea.”</p>\n<p>“Well, he keeps it all anonymous here,” Trish says. “Or tries to. Most of the parents know anyway, word gets around, but we don’t say anything to him about it. It’s clear he doesn’t want recognition. Figured he would’ve told you, though.” She shrugs. “I imagine he’s still playing it close to the chest, after what he’s been through, and I don’t even know the half of it, I’m sure.” She sets a grateful expression on Steve. It makes him feel vaguely uncomfortable. “I feel like I should thank you, Steve, for finding him. We’re damn lucky to have Barnes back.”</p>\n<p>“We?” Steve says.</p>\n<p>“The country,” Trish says, looking away from Steve. “The Avengers, the citizens, the kids. I hope you don’t take offense to this, but when I was in elementary school, we did projects every November on famous veterans. Everybody - including me, the first year - would claw at each other to get to write about you, but every year after the projects were presented, I always went home thinking, Bucky Barnes is the kind of guy you want on your side. You got all the glory and a catchy song, not that you didn’t deserve it, of course, but--well, Bucky was captured and tortured and he still stayed to fight alongside you.” She nods to herself, repeats, “He’s the guy I want on my side.” She looks back up at Steve again. “You’re lucky you’ve got him.”</p>\n<p>Steve nods at her, resolute. “I know I am,” he says. “I’ve always been lucky I’ve got him.”</p>\n<p>--</p>\n<p>The sun is on its way to setting when Steve and Bucky finally leave the hospital. On the train, Bucky falls asleep with his head on Steve’s shoulder, and when they’re walking to the Tower, Bucky pulls Steve into a tiny florist shop. Steve watches as Bucky personally chooses flowers for three different bouquets, writes notes for each, and retrieves the custom-made dolls from his pockets, arranges them in the bouquets to hold the notes. He doesn’t ask how Bucky knows the addresses of the families who lost their children in the hospital, or why Bucky doesn’t sign his name on the card, just draws a little Bucky Bear under sincere condolences, or how Bucky knows which family wouldn’t like which flowers. Earlier Steve had so many questions, and now he has too many answers, and he’s not sure how to get his bearings in this new place.</p>\n<p>At the Tower, Bucky eats a messy burger and won’t stop asking Bruce about medical research funding, says, “Huh? No, of course not,” when Sam asks if he’s in need of medical care or something, ignores Tony’s requests for a change in topic of conversation. Steve doesn’t eat, blames a headache that isn’t real, excuses himself from the table. When he gets to his own floor, he goes to the kitchen, thinking he’ll eat alone and won’t feel smothered by the heaviness of the day, but he only gets as far as the sink when tears begin stinging at his eyes.</p>\n<p>Bucky finds him in the living room three hours later, red-rimmed eyes and all, staring at the muted TV. </p>\n<p>“Man, why do we all like Criminal Minds so much in this house?” Bucky says, sitting down on the sofa next to Steve. “You’d think between the eight of us, we’ve seen enough sick shit in real life.” Steve says nothing, doesn’t take his eyes off the television, and Bucky puts a hand on the back of Steve’s neck. “Hey,” he says softly. “What’s wrong? Is it Lila? I saw you talking to her today. She was telling the truth, you know, she <i>is</i> getting better. Her parents said she might even be able to go back to school in a couple weeks.” </p>\n<p>Steve looks at him then, blinking wide eyes. For a long moment, he simply stares, and then he shakes his head in disbelief. “How are you like this?” he asks. “How do you do what you did today <i>all the time</i>, and send flowers to grieving families, and pay for medical bills--” Bucky flushes at that, looks away from Steve’s face like he’s ashamed. “Bucky,” Steve says, and waits for Bucky’s eyes to reach his again. “How can you do this and still think--Bucky, you’re the <i>best</i> of us, of all of us, and you still don’t think you deserve any of this, I know you don’t, but I don’t know <i>how</i>.”</p>\n<p>Bucky shrugs and it makes Steve want to cry again. “It’s not as important as all that,” Bucky says. “It’s selfish, really - those kids are no different than you were when we were their age. You don’t need me like that anymore, not since you gained a hundred fifty pounds of pure muscle, but they do, and it’s--” He shrugs again, looks away, runs the metal hand through his hair. “It’s just a way to feel needed. Like I said, it’s selfish.” Steve stares at him in silence until Bucky looks up at him again, nervous eyes and pursed lips. </p>\n<p>“Bucky,” Steve says, imploring, “that’s not--it’s not <i>selfish</i>, what you do. It wasn’t <i>selfish</i> when you made me soup and risked catching fever by curling up with me in my sickbed. It was never <i>selfish</i>, you stealing heliox from the hospital for my asthma, or working triple shifts when no one would hire sick little Steve Rogers so we could afford to see a picture the next weekend, or letting me throw a few pathetic punches before stepping in to save my ass. It’s not <i>selfish</i> to be there when someone needs you.” Bucky looks down at his knees, swallows, and Steve says, “And I <i>do</i> still need you.” Bucky’s eyes shift back up at him. “Maybe not to nurse me back from near death, but to be here, next to me, with me?” He takes Bucky’s hand in both of his, says, “I need you, Bucky. I’m always gonna need you.” Bucky’s eyes are wet and shining, and Steve has wanted to kiss him all day, so he leans over and presses his lips to the soft skin under Bucky’s eye, trails down to kiss Bucky’s trembling mouth. </p>\n<p>“Stevie,” Bucky says, voice hoarse. “What’d I do in a past life to deserve you, huh?” Steve smiles against the corner of Bucky’s mouth, rests another kiss there before moving to Bucky’s jaw. </p>\n<p>“Dunno,” Steve murmurs, “but clearly I was there, too.”</p>"
}