{
  "id": "16009088",
  "url": "https://archiveofourown.org/works/16009088?view_full_work=true",
  "author": [
    "luway"
  ],
  "title": "on my lips (your laughter is the sweetest)",
  "rating": "General Audiences",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Stray Kids (Band)"
  ],
  "relationships": [
    "Han Jisung | Han/Lee Minho | Lee Know",
    "Han Jisung | Han & Lee Minho | Lee Know"
  ],
  "characters": [
    "Han Jisung | Han",
    "Lee Minho | Lee Know",
    "Bang Chan",
    "Kim Woojin",
    "Seo Changbin",
    "Hwang Hyunjin",
    "Lee Felix",
    "Yang Jeongin | I.N",
    "Kim Seungmin"
  ],
  "additional_tags": [
    "Alternate Universe - Coffee Shops & Cafés",
    "kind of",
    "Deaf Character",
    "Meet-Cute",
    "Friends to Lovers",
    "Jisung makes a fool out of himself",
    "theyre both cute",
    "im projecting onto my writing whats new",
    "Fluff",
    "Fluff and Angst",
    "Kissing"
  ],
  "language": "English",
  "series": "",
  "published": "2018-10-08",
  "completed": null,
  "words": "7,089",
  "chapters": "1/1",
  "comments": "232",
  "kudos": "13,216",
  "bookmarks": "2,084",
  "hits": "111,158",
  "summary": "<p>Jisung cleared his throat, a sudden feeling of embarrassment coming over him. He stared at the paper cup in his hands as he spoke. \"So you're really nice and all, and your cocoa is amazing, but the whole lip thing— I can see you staring when I talk and I just wanted to say it's kind of uncom-\"</p>\n<p>\"Uh sorry, strange question, but could you look up at me?\" Minho suddenly asked. \"I need to read your lips or else I can't really understand what you're saying.\"</p>\n<p>aka Jisung asks barista Minho to stop staring at his lips, not realizing Minho is deaf, and kind of has to.<br>Minho thinks Jisung's lips are pretty</p>",
  "notes": "<p>welcome to me projecting again </p>\n<p>unbeta'd as usual<br>enjoy!</p>\n<p>edit: thank y'all so much for all the kudos and comments, I'm honestly amazed at the feedback this fic has gotten ♡</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>comments/kudos appreciated</p>\n<p>I am not deaf, but loss of hearing and deafness runs in my family (and is something I am experiencing already myself) so I was able to do my own research with my family members while writing this (which btw was an amazing experience).<br>anyways, hope you enjoyed reading!</p>\n<p>briee-elle on Tumblr drew <a href=\"https://briee-elle.tumblr.com/post/180809164373/jisung-cleared-his-throat-a-sudden-feeling-of\" rel=\"nofollow\">this amazing piece</a> of minho as a barista and honestly it's so cute please give it and her some love!</p>",
  "text": "<p>   Jisung has never been a coffee person. There’s just something about the taste and the way it lingers on his tongue and in the back of his throat that he could never get past. Not even with all the sugar and cream in the world—and let it be known that he had tried outrageous combinations of the two. Jisung just couldn't do it. Thankfully, however, during his move into the new dorms maybe a month or so before, Jisung found a small, but bustling, cafe hidden around the corner from the student building.</p>\n<p><br> <br>    The space is cute and vintage without being annoying or disgustingly so, which is something that Jisung appreciates greatly. There's a constant buzz of life as people speak and machines whir in the background, and Jisung immediately felt comfortable surrounded by the pale colors and lazy script detailing what the menu offered.</p>\n<p> </p>\n<p>   That, and the baristas standing behind the counter and Jisung was sure he would like the place as soon the little bell above his head went off to announce his arrival.</p>\n<p> </p>\n<p>   All in all, Jisung likes the cafe, and most of the people who work there are very nice and great at their jobs. But there's one thing that always bothered him, that he was just too shy and anxious to bring up when it occurred.</p>\n<p> </p>\n<p>  It's one barista in particular really, Minho, according to the small print on his nametag.</p>\n<p> </p>\n<p>  Minho took Jisung's order every time he reached the counter, even when someone else seemed to be working mere seconds before. Minho was pleasant, always courteous and smiling at Jisung when he came in for his morning hot chocolate. The only problem was that Minho had a thing for staring at Jisung, or more specifically Jisungs <em>lips. </em>His<em> </em>gaze unrelenting in the way he followed every word Jisung said.</p>\n<p> </p>\n<p>   Jisung couldn't help but notice, even though he tried his best to ignore it. Because no matter how nice Minho was, the whole thing was beginning to creep Jisung out.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p><br> <br>    A month into Jisung's visits to the cafe he decided he needed to deal with Minho, because even though he could simply go somewhere else, the cafe had some of the best hot chocolate he had ever tasted. And of course Minho just happened to be the one who made it for Jisung every day.</p>\n<p><br> <br>    Jisung was standing at the counter waiting for Minho to bring his cocoa over when he finally felt like the time was right enough to bring the whole staring-contest-with-his-lips situation up. Without anyone waiting behind him Jisung didn't feel too strange bringing it up to the barista, or like he was taking up time that could be better spent. The cafe was mostly empty now, and every other barista seemed to be on break besides Minho. </p>\n<p><br> <br>    \"Hey, uh, Minho.\" Jisung started when the barista passed by his table, waving his hand a little in an awkward greeting. Minho stopped where he was going and turned towards Jisung with a polite smile, eyes once again trained on Jisung's lips as he spoke to him. Jisung wondered if he should be annoyed, because he's not surprised at this point. </p>\n<p> </p>\n<p>   \"What's up?\" Minho was always cheery, something Jisung <em>did</em> admire about him.</p>\n<p> </p>\n<p>   He had a sense of humor, and Jisung could occasionally see him joking around with one of the other baristas, Jeongin, when things were more slow during the day.</p>\n<p> </p>\n<p>   Of course now the cafe was void of people, so Minho's attention was solely on Jisung. </p>\n<p> </p>\n<p>   Jisung cleared his throat, a sudden feeling of embarrassment coming over him. He stared at the coffee cup in his hands, unable to look Minho in the eyes for fear he wouldn't be able to get the right words out as he rambled.</p>\n<p> </p>\n<p>  \"So, you're <em>really</em> nice and all, and your cocoa is amazing, but the whole lip thing, I can see you staring when I talk and I just wanted to say it's kinda uncom—\"</p>\n<p> </p>\n<p>   \"Uh sorry, strange question, but could you look up at me?\" Minho interrupted him, an oblivious but sincerely embarrassed smile on his face as he pointed at his lower lip for emphasis. Another one of Minho's habits that Jisujg couldn't deny was sort of adorable. \"I need to read your lips or else I can't really understand what you're saying.\"<br> <br> <br>    Jisung felt the whole world stop and restart in that one moment, head snapping up to look at Minho with a slack jaw and wide eyes.</p>\n<p> </p>\n<p>   Minho looked perfectly unaware of Jisungs crisis at the moment.</p>\n<p> </p>\n<p>   Jisung's cheeks, ears, and his whole body was flushed red in embarrassment, because how could it have <em>not</em> occurred to him at any moment that Minho was <em>reading</em> his lips? </p>\n<p> </p>\n<p>   He's suddenly reminded of all the times Jeongin had yelled and scared half the cafe but Minho had barely flinched, every time Jisung had said hello and Minho didn't respond until Jisung waving was clear in his view.</p>\n<p> </p>\n<p>  Jisung was such an idiot.</p>\n<p><br>    Minho seemed to sense something was wrong when Jisung's lips were doing very little other than opening and closing as he tried to think of what to say to him.</p>\n<p> </p>\n<p>   Minho's smile faded and eyebrows knitting together in a questioning gaze.</p>\n<p> </p>\n<p>   \"You've got to be kidding me.\" Jisung muttered after a long bout of shocked silence.</p>\n<p> </p>\n<p>   \"Oh... You were pointing it out weren't you—\"</p>\n<p> </p>\n<p>   \"No, not at all!\" Jisung's hands flew it in front of him, as if him frantically waving would make his lie seem any better.</p>\n<p> </p>\n<p>   \"Don't worry it happens all the time. I get a kick out of it at this point if I'm being honest.\" Minho chuckled, rubbing the back of his neck in a gesture that Jisung knew meant he was at least a bit uncomfortable with the situaiton.</p>\n<p> </p>\n<p>   Jisung nodded, still in a state of shock as he left a tip—a dollar or two more than usual—in the jar by the register and stumbled out the door, cocoa left forgotten in his haste to leave. </p>\n<p> </p>\n<p><em>   Stupid. Stupid. Stupid.</em> Jisung chanted in his head all the way to his first lecture of the day.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p><br> <br>    A week later and the conversation still haunts Jisung, so much so that he has taken to going to the cafe an hour later than usual in a not-so-sly attempt to avoid Minho, and the embarrassment of facing him again after the events that occured. Albeit his morning mood and palette are suffering with Minho's absence, and poor Jeongin has been left to figure out the old kettle used for hot drinks they can’t use the ever-so-popular espresso machine for. It’s an old blue thing that only seemed to like Minho—if such a thing was possible—and left a strange aftertaste whenever Jeongin attempted to make anything for Jisung with it. The tang of metal on his tongue ever present, just like the regret of his awful social skills and inability to simply go and apologize, for fear of offending Minho.</p>\n<p><br> <br>    It takes Jisung completely by surprise when he ends up bumping into Minho in the produce section of the grocery store.</p>\n<p> </p>\n<p> </p>\n<p><br> <br>    Truth be told they don’t really bump into each other. It’s more like Jisung see’s Minho bagging some peaches in the fruit aisle, and decides to run in the opposite direction.</p>\n<p> </p>\n<p>   He doesn’t like fruit all that much anyways, or this grocery store come to think of it. He supposes it’s time to find a new one. He almost makes it around the corner too, but before he can disappear with his cart in tow, someone is calling out for him.</p>\n<p> </p>\n<p>   \"Jisung?\"</p>\n<p> </p>\n<p>   \"Oh, hey! Didn't see you there.\" Jisung's face was burning from the lie, but if Minho noticed he didn't say anything. The barista just smiled and walked up to Jisung like the latter hadn't been avoiding him for the past few days after making a complete ass of himself.</p>\n<p> </p>\n<p>   \"I've missed you at the cafe, it's really boring without you.\" Minho speaks as if there was nothing wrong with what he is saying, as if they’re friends instead of acquaintances. \"No one else gets hot chocolate other than you, and I hate using the machines—\"</p>\n<p> </p>\n<p>   Jisung can’t take it anymore, the way Minho seems so content just talking his ear off,  which to be honest, isn’t a problem for Jisung, who enjoys listening to Minho talking very much. Especially when he can make out the slight (adorable) lisp the other boy has on some words, most likely from not being able to hear himself speak. </p>\n<p> </p>\n<p>   Jisung has to apologize for his behavior before he can allow Minho to continue, and before the guilt eats away at him to the point where there’s nothing left.</p>\n<p><br>    \"Look Minho, I'm so sorry about that day with the lip reading and stuff, I had no idea.\" Jisung cuts Minho off mid sentence, about to hide his face in his hands but hesitating when he remembers what Minho had said. So Jisung leaves his face exposed in flushed shame as he speaks.</p>\n<p> </p>\n<p>   \"Honestly it made me uncomfortable—<em>before</em> I realized what you were doing, and I should have just owned up to that but I didn't and thats—”</p>\n<p> </p>\n<p>   \"Hey,\" Minho interjects, \"don't worry about it Jisung, it happens to everyone most of the time. Your brain isn't wired to immediately assume things like that.\"</p>\n<p> </p>\n<p>   The way Minho says it, and with a smile that assures Jisung he means what he’s saying, Jisung feels all the guilt melt away. His shoulders visibly slump with relief, and a small breathy laugh slips past his lips.</p>\n<p> </p>\n<p>   \"You're sure?\"</p>\n<p> </p>\n<p>   \"Oh definitely.\" Minho steps up and squeezes Jisungs shoulder. \"And please, just come to me for hot chocolate, poor Jeongin is having a mental breakdown trying to learn the kettle.\"</p>\n<p> </p>\n<p>   A real laugh comes out this time, one that Jisung can feel throughout his whole body. He almost misses the way Minho's eyes widen and his grip on his shoulder tightens when it happens, feeling the motion and slight tremors from Jisung's laugh through his arm.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>   “Isn’t it hard to read lips constantly?”</p>\n<p> </p>\n<p>   “Of course it is, it’s exhausting sometimes, but it gets easier when I’m used to the way people move their lips when they talk. Like in the beginning it was kind of hard to read your lips, but after a while I pretty much got it down. I still can’t catch every word you say though.”</p>\n<p> </p>\n<p>   “That’s actually really cool. It’s not hard to deal with customers at all?”</p>\n<p> </p>\n<p>   “Sometimes, but working as a barista only gives so many options for people to choose from. I’ve been working there long enough where I’m confident. If I mess up, I’m only human.”</p>\n<p> </p>\n<p>   “You don’t use, it uh, <em>it</em> as an excuse?”</p>\n<p> </p>\n<p>   “What? Me being deaf? Nah, I’m not looking for pity.”</p>\n<p><br>    Jisung finds himself with Minho for the rest of the day, no longer so uncomfortable with the way Minho stares at his lips as he talks.</p>\n<p> </p>\n<p>   He finds the way that Minho laughs a few seconds after he cracks a joke strangely endearing, watching as Minho puts together his words, eyes narrowing as he follows Jisungs lips.</p>\n<p> </p>\n<p>   Jisung tries his best to speak slower than usual, but not so slow that Minho would catch him in the act and pout—as he did when Jisung had become too obvious about it earlier.</p>\n<p> </p>\n<p>   It’s clear to Jisung that Minho is in no way incapable of following a conversation, but he can also see the effort Minho puts into following.</p>\n<p> </p>\n<p>   After so long with not knowing Minho was impaired at all when it came to his hearing, Jisung has to continuously remind himself to face Minho when he speaks.</p>\n<p> </p>\n<p>   Once or twice Minho will tap him on the shoulder and ask him to repeat himself, Jisung’s face will burn red in embarrassment and he'll stutter over his words for a moment. But if it makes Jisung harder to understand, Minho says nothing about it.</p>\n<p> </p>\n<p>   He learns that reading lips is exhausting for Minho some days, and that Minho can use and understand sign language, but he prefers being able to know more of what is going on around him when it comes to hearing people.</p>\n<p> </p>\n<p>   Minho says being able to take part in at least some of the world when you otherwise are closed off is something he wouldn’t trade.</p>\n<p> </p>\n<p>   Jisung finds that he likes getting a glimpse (no matter how small) of Minho’s world.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>  </p>\n<p>   “You look like shit.”</p>\n<p> </p>\n<p>   Jisung glares at Minho—who is grinning at him and trying and failing to hold back his giggles—dragging the hood of his sweater further down his face to hide the shadows under his eyes and the rats-nest that is his hair at the moment.</p>\n<p> </p>\n<p>   “You’re just mean.” Jisung says glumly, knowing he looks just as bad, if not worse than Minho's teasing. “I’d like you better if you were blind, give me my fucking cocoa.”</p>\n<p> </p>\n<p>   Jisung pouts over the steaming mug as Minho tells him about his day, clearly supressing a grin at Jisung's state.</p>\n<p> </p>\n<p> </p>\n<p>   Over the past few weeks Jisung and Minho have become strangely close.</p>\n<p> </p>\n<p>   Jisung has grown more accustomed to some of Minho’s odd quirks, used to Minho’s staring, how he listens to what that is less music and more making <em>everything</em> around them practically vibrate with how high Minho has the bass settings turned to. How Minho blinks often but almost too quick for Jisung to catch him in the act, as if Minho is trying to take in everything at once and miss as little as possible.</p>\n<p> </p>\n<p>   Jisung also learns that even if Minho is not in any way ashamed of his deafness, he often attempts to make it seem like it was less of a hassle during daily life, and in turn reveals that there were a few people—no longer in his life—who had made him feel like a burden some time ago.</p>\n<p> </p>\n<p>   Jisung finds this out when watching a movie with Minho in his apartment, as they had taken to having dinner at each others places when their acquaintanceship turned to friendship, seemingly over a simple cup of coffee (or cocoa in Jisung’s case).</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>   The apartment itself is small but homey, not cluttered but full of things that give the space it’s own personality. Minho explains that rent is cheap because of the train station right next to his building, which makes too much noise for someone to sleep, meaning it's perfect for Minho.</p>\n<p> </p>\n<p>   With large windows and an amazing view of a park across the street and the sun brushing the tops of the buildings in the distance, Jisung falls in love with it almost immediately, even when Minho tries to convince him it really wasn’t much to look at.</p>\n<p> </p>\n<p>   While watching the movie—it being the first time they had done such a thing together— Jisung finds himself fidgeting and stealing small furtive glances at Minho, appreciating Minho’s high cheekbones and long eyelashes and everything else that made him so unique and lovely to look at. It takes Jisung a few glances, and one or two more just in case to confirm his suspicions. Minho looks completely lost, eyes squinting and lips moving as he tries—and fails—at following the quick pace of the actors lips on screen.</p>\n<p> </p>\n<p>   Jisung can see how the slump of defeat in Minho's shoulders only worsens whenever he realizes he has missed a line of dialogue spoken offscreen.</p>\n<p> </p>\n<p>   Jisung grabs the remote and pauses the television, startling Minho.</p>\n<p> </p>\n<p>   “Why—?</p>\n<p> </p>\n<p>   “I can see you trying to lip read.” Jisung makes sure he’s facing Minho, and only turns away when he’s sure Minho understood him. Taking the time to turn on the subtitles and rewind to the beginning, seeing as they only had been watching for maybe fifteen minutes.</p>\n<p> </p>\n<p>   Minho sputters for a moment, and Jisung can see behind his indignant expression he’s embarrassed for being caught, yet grateful at the same time. The faint scowl fades and Minho’s eyes flicker between Jisung’s lips and eyes, lips pursed.</p>\n<p>   </p>\n<p>   “You won’t be bothered by the subtitles?” Minho finally asks.</p>\n<p> </p>\n<p>   “<em>That’s</em> why you didn’t say anything?” Jisung laughs, giggling through his words until he sees Minho’s ears are bright red and he refuses to look at Jisung.</p>\n<p> </p>\n<p>   Jisung’s smile fades and he reaches over, tapping Minho’s knee to get his attention. It takes a moment but Minho eventually looks at him, lips pursed in a shy way that makes Jisung want to squish Minho until that laughter comes back, unfiltered and loud and everything that Minho seems to like to hide about himself.</p>\n<p> </p>\n<p>   “I had a friend once, he would get annoyed by them.” Minho says, eyes not meeting Jisung’s like he usually makes an effort to do when he can. “He said it was annoying and he couldn't enjoy hanging out with me because of them and other... stuff. so I guess I just assumed—”</p>\n<p>  </p>\n<p>   “Hey, I don’t find it annoying okay? As long as you can enjoy the movie too I think I’ll manage.” Jisung smiles, and vows that if he ever meets this so called ‘friend’ he’ll have a few choice words for him, and a nice fist for his face. </p>\n<p> </p>\n<p>   The room is much louder now, as Minho finally is able to chuckle at jokes and make commentary on what is going on. Jisung finds himself watching Minho for most of the movie, finding the shape of Minho's side profile more interesting than what is happening on screen. If Minho catches him doing so, he says nothing.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>   Then there are times Jisung forgets that Minho can’t exactly hear him. Minho is so fluid and natural when it comes to daily life, that it happens once or twice where Jisung will end up talking to himself for a few minutes, not realizing that Minho isn’t even looking at him, let alone reading his lips.</p>\n<p> </p>\n<p>   It happens occasionally, and most of the time Jisung can play it off like nothing happened, and Minho will be none the wiser. Jisung sometimes feels bad about it, being stupid enough to forget about such a big part of Minho’s life, but nothing will make him feel worse than the day he and Minho go to the mall.</p>\n<p> </p>\n<p>   When Minho’s shift at the cafe ends, Jisung is waiting out back by the dumpster, face breaking into a smile as soon as he sees Minho’s familiar head of hair, styled to perfection so it looks messy but calculated at the same time. Minho is tugging a jean jacket onto his arm as he struggles to bump the back door shut with his heel, and Jisung finds himself holding back a chuckle when he sees Minho’s black jeans are stained with sugar and flour—he must have been working with one of the bakers in the back today.</p>\n<p> </p>\n<p>   “We okay?” Minho asks when he finally notices and reaches Jisung a few meters away, holding up his hand with his thumb and pointer finger touching in an ‘OK’ symbol.</p>\n<p> </p>\n<p>   Jisung rolls his eyes and grabs Minho’s wrist, tugging him out of the alley. He doesn’t notice for a while that he never exactly lets go of his loose hold on Minho’s wrist, a warm feeling filling his chest when he realizes Minho never makes any move to take his hand away, other than pulling it slightly so Jisung is holding onto his hand rather than his wrist.</p>\n<p> </p>\n<p>   Jisung knows it makes it harder for Minho to understand him when he stutters, but he thinks Minho almost enjoys that he has this effect on Jisung at all.</p>\n<p> </p>\n<p>   When they arrive at the mall, Jisung drags Minho into a few department stores, with a few errands to run before he can do some leisure shopping. All this socialization in the past few months has left him with a slowly shrinking closet as he tries to not wear the same thing too often. He doesn’t want new clothes to impress Minho or anything, that would be completely absurd.</p>\n<p> </p>\n<p>   After Jisung finishes his errands, Minho drags him into a store Jisung has never been to before, but has heard mentioned once or twice from his friends.</p>\n<p> </p>\n<p>   “I’ve been needing new pants for ages.” Minho explains as he starts to pick and choose what he wants to try on. From what Jisung understands, being a barista is very harsh on your clothes, and while Minho does okay in the shirt department with his apron, his jeans often take a good beating and have to be replaced every month or two depending on the damage. Jisung personally finds it charming when Minho shows up at his apartment with some flour still on his nose, but can understand the annoying aspects of having his jeans constantly covered in white hand prints.</p>\n<p> </p>\n<p>   Before Minho disappears into the dressing room he hands Jisung his phone and wallet to hold while he tries the jeans on.</p>\n<p> </p>\n<p>   “Don’t take too long, I’ll be bored out here waiting for you.” Jisung pouts, which turns into a scowl when Minho just laughs at him before closing the door.</p>\n<p> </p>\n<p>   It doesn’t take a while for Jisung to get restless, he wanders around the store aimlessly, keeping the dressing room in sight for a little while, until across the way he sees a store with advertising headphones. Not just any headphones though, insanely good headphones that Jisung has totally been lusting after for the past three months, and there they are right in front of him. Jisung is itching for something to do, so he pops back over to the dressing room and knocks once to get Minho’s attention.</p>\n<p> </p>\n<p>   “I’m going to look at some headphones.”</p>\n<p> </p>\n<p>   And then he’s gone.</p>\n<p> </p>\n<p>   Jisung doesn’t even think about it as he browses over all the color selections of the headphones, eventually settling on black with red decals covering the smooth surface. Jisung might even say he’s in love when he walks out of the store with them tucked into his backpack.</p>\n<p> </p>\n<p>   The prospect of going home to test them out has him rushing to the back of the store where he left Minho so they can go back and he can show Minho how the bass setting work, let Minho feel the vibrations how he showed Jisung he does a week or so ago.</p>\n<p> </p>\n<p>   Only Minho isn’t in the dressing room when he gets back. The door is open and there’s a pile of neatly folded pants in the return basket outside the room.</p>\n<p> </p>\n<p>   “Minho?” Jisung’s eyebrows knit together as he scans the store for a head of familiar black hair. His confusion only grows when he finds he can’t see any sign of Minho anywhere.</p>\n<p> </p>\n<p>   Jisung feels a strange pit slowly growing in his stomach, dragging his phone out of his pocket and tries to text Minho. A few seconds go by and there’s a violent buzzing coming from his jacket pocket.</p>\n<p> </p>\n<p>   “Shit.” Jisung swears when he pulls out Minho’s phone, the screen lit up with the text Jisung just sent, cringey emoji and everything. Jisung goes to call out for Minho—figuring he can’t have gone far as Jisung was only in the other store for a few minutes. His words die in his mouth though when he remembers, and begins to mentally murder his past self.</p>\n<p> </p>\n<p>\n<em>   Stupid. Stupid. Stupid. </em>\n</p>\n<p> </p>\n<p>   He chants in his head as he squeezes Minho’s phone almost too tightly to his chest, the edges of the case digging into his palm. He makes his way through the racks of clothes, until he reaches the front desk, where a young woman sits clacking away on the keyboard of the computer in front of her. The sound is like nails on a chalkboard to Jisung’s slowly building headache but he has to has her if she noticed Minho go anywhere.</p>\n<p>  </p>\n<p>   “Excuse me,” Jisung tries to sound calm, Minho’s phone pressed to his chest as if it would magically begin to ring and have Minho on the other side telling him how dumb he was. “Have you seen the guy I was with earlier? I— I kind of lost him and I have his phone so—”</p>\n<p> </p>\n<p>   “Him?” The girl looks up at him and seems to think for a moment. “He paid for his stuff a minute or two ago, then he walked out. I didn’t see where he went, sorry.”</p>\n<p> </p>\n<p>   “Oh, thank you.”</p>\n<p> </p>\n<p>   Jisung contemplates all his options, he can’t call Minho, he has Minho’s phone and Minho would never even be able to hear him anyways. He can’t go to the mall security, they’d just make an announcement, and Minho wouldn’t hear that either. He knows Minho can take care of himself, but the thought of Minho not knowing where he went, wondering if Jisung abandoned him, is enough for Jisung to fall into something close to panic.</p>\n<p> </p>\n<p>   God, what did people even do before phones? How did they go anywhere and not lose each other? Fuck. </p>\n<p> </p>\n<p>   Jisung pinches himself on the arm to calm his thoughts, focusing on the small burst of pain until his head clears more. </p>\n<p> </p>\n<p>   Minho’s phone begins to buzz violently in his grip, making Jisung jump before he shakily presses the ACCEPT CALL button with his trembling thumb. The caller ID is an unknown number, but Jisung has hope.</p>\n<p> </p>\n<p>   “Huh—Hello?”</p>\n<p> </p>\n<p>   “Hello dear, is this a Han Jisung?” An old woman's shaky voice crackles through the phone, and Jisung holds the phone with two hands against his ear.</p>\n<p>  </p>\n<p>   “Yes ma’am.” Jisung feels a tear fall down his cheek, out of the overwhelming rush of anger and guilt taking root inside of him. He hiccups as he rubs his sleeve over his cheek to brush the tear away.</p>\n<p> </p>\n<p>   “I have a young man with me, Minho. I think he’s a bit lost.”</p>\n<p> </p>\n<p>   Jisung is on his feet before the woman is finished with her sentence, knuckles white as they clutch Minho’s phone like a lifeline.</p>\n<p> </p>\n<p>   “Oh my god, yes, I mean—Uh, yes I’ve been looking for him cuh—can you please tell me where you are?” Jisung stumbles over his words, but he can’t bring himself to care he’s so relieved.</p>\n<p> </p>\n<p>   “Of course sweetie, we’re on the first floor sitting by the fountain.” The woman pauses, and Jisung holds his breath, unable to hear anything over the line. “Minho would like to say something.”</p>\n<p> </p>\n<p>   “Jisung?” Minho sounds hopeful, but tired. “I uh, if you say something I won’t be able to know obviously, but I just wanted to say I’m okay. I’ll be waiting for you.”</p>\n<p> </p>\n<p>   Jisung rushes down the stairs, trying not to bump into too many people as he searches for the fountain him and Minho had walked by on their way inside. It was easy to spot when Jisung reached the first level, filled with coins tossed in exchange for a wish.</p>\n<p> </p>\n<p>   It took a moment for him to locate Minho, seeing him sitting on the edge of the fountain with an old woman with greying hair, both of them moving their hands in strange ways.</p>\n<p> </p>\n<p>   Minho looks stressed, but the woman seems to be doing a good job keeping him company, it only takes Jisung a few seconds to reach them and catch Minho’s attention.</p>\n<p> </p>\n<p>   “You called?” Jisung cringes at his introduction, but he’s pretty sure Minho didn’t even pickup on it with the way he marches right up to Jisung and punches him in the shoulder as hard as he can.</p>\n<p> </p>\n<p>   Jisung lets out a yelp, unable to reach up and make sure his shoulder is okay before Minho drags him into a bone crushing hug.</p>\n<p> </p>\n<p>   “I couldn’t find you anywhere you asshole!” Minho’s voice is a bit more slurred than usual, which is understandable. Minho was probably more concerned with finding his asshole of a friend than his pronunciation.</p>\n<p> </p>\n<p>   Jisung waits until Minho let’s go and can see him to speak, gripping Minho’s shoulders and hoping Minho understands how sorry he is. “I swear I didn’t mean to—”</p>\n<p> </p>\n<p>   “Jisung you’re crying.”</p>\n<p> </p>\n<p>   Turns out Jisung <em>is</em> crying, but only a little bit. One or two more tears have slipped out since Minho hugged him. Jisung looks down and wipes them away, laughter coming out in breathy gasps as he sniffles and tries his best to look okay, and not like his entire world had just been imploding less than five minutes before.</p>\n<p> </p>\n<p>   “Shit, I guess I kinda panicked back there.” Jisung takes a shaky breath, and is glad Minho can’t hear the hiccups that continue to slip out of him.</p>\n<p> </p>\n<p>   “I’m glad you found him.” The old woman speaks finally, moving her hands yet again as she talks.</p>\n<p> </p>\n<p>   Jisung doesn’t want to assume anything, but he’s almost sure that she is signing to Minho.</p>\n<p> </p>\n<p>   For a moment Jisung is lost, watching as Minho and the woman have a whole conversation in front of him, and he knows nothing of what they’re saying. He can’t describe the feeling that comes over him—pity, uselessness, something that settles over his heart—when he realizes Minho must live like this day to day, watching people all around him engage and talk with one another.</p>\n<p> </p>\n<p>   Jisung can't imagine living with no way to understand what people are saying on a whim, especially when he knows not everyone Minho has come across has been willing to give him the time he needs to understand and think and really talk.</p>\n<p> </p>\n<p>   Jisung would give Minho all the time in the world if he could, wishing the world would understand the beauty in how Minho navigated through his days and how he didn’t let it bring him down.</p>\n<p> </p>\n<p>   “Jisung?”</p>\n<p> </p>\n<p>   Minho is looking up at him with a worried expression, eyebrows knit together as he searching Jisung’s face for something.</p>\n<p> </p>\n<p>   “I’m here, sorry, just a bit lightheaded.” Jisung says, assuring Minho he’s fine.</p>\n<p>  </p>\n<p>   “Too much excitement for one day I assume.” The old woman chuckles, patting Minho on the cheek and giving Jisung a polite bow, to which both he and Minho respond. \"Get home safely boys.\"</p>\n<p> </p>\n<p>   Both of them make it to Minho’s apartment just fine, but it’s clear how exhausting the experience was for Minho when he collapses onto his couch and falls asleep almost instantly. Clothes and all. Jisung takes the time to at least take Minho’s shoes off and place them in the shoe rack by his door, relieved that he doesn’t have to watch how much noise he makes.</p>\n<p> </p>\n<p>   Jisung doesn't talk to Minho again until later that night when he walks out of the shower to see almost 20 voicemails from Minho. Most of them are him singing horribly off-key to the lyrics of girl group songs he's never heard the melody of, and a hundred texts of colorful emojis and selfies of Minho pouting and making kissy faces at him, and one final one with a heart at the end. </p>\n<p> </p>\n<p>     MINHO 21:18 </p>\n<p>&gt; Sleep well pretty Jisungie, you're dumb but I wouldn't be friends with you if you weren't. Don't beat yourself up and have good dreams! ♡</p>\n<p> </p>\n<p>   Jisung falls asleep smiling, and with a new lockscreen on his phone of Minho blowing him a kiss. His chest full of a pleasant warmth. </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>   It’s a few weeks after the mall incident that Jisung gathers the courage to ask Minho.</p>\n<p> </p>\n<p>   They’re in the middle of making lunch in Jisung’s kitchen, just another domestic habit they’ve picked up ever since they found out that Minho’s afternoon shift starts at the same time as Jisung’s courses for the afternoon.</p>\n<p> </p>\n<p>   Minho mentioned it offhandedly, how he usually ended up in the cafe an hour earlier than scheduled because that was the only time the bus in his neighborhood made the stop that was—by some strange coincidence—right outside of Jisung’s housing building, which was just around the corner from the cafe.</p>\n<p> </p>\n<p>   It worked perfectly.</p>\n<p> </p>\n<p>   Like Jisung mentioned before though, it was almost grossly domestic; eating whatever Jisung had for dinner the night before, or whatever Minho brought from his own place in Jisung’s cramped lounge until they both had to leave.</p>\n<p> </p>\n<p>   It was both the most disappointing part of Jisung’s day, four times a week, but also the one he looked forwards to the most. Because without fail, Minho would hug Jisung everyday before they stepped out of the front hall of the building to go their separate ways. </p>\n<p> </p>\n<p>   It was those few seconds every day that kept Jisung warm as he walked to the lecture hall. </p>\n<p> </p>\n<p>   “Hey Minho?” Jisung asks, waving his hand to gain Minho’s attention from the sandwich he is making.</p>\n<p> </p>\n<p>   “Did you say something?” Minho asks, and Jisung wonders one last time if Minho will find him rude for asking, having always treated Minho no different than he would a hearing person.</p>\n<p> </p>\n<p>   Jisung wonders whether this is the invisible line he wasn’t meant to cross.</p>\n<p> </p>\n<p>   “I uh, I don’t want to seem rude or anything, I just kind of have a question… For you…”</p>\n<p> </p>\n<p>   “Okaay.” Minho drags the last syllable out, eyebrows quirking up in curiosity.</p>\n<p> </p>\n<p>   “So, like,” Jisung rubs the back of his neck, trying his best to not look away from Minho. “Wuh—What’s it like to be, uh, <em>deaf</em>?”</p>\n<p> </p>\n<p>   The silence drags on much longer for Jisung than it does in reality, he knows, but it still is enough for him to start thinking of a million apologies, contemplating kneeling in front of Minho.</p>\n<p> </p>\n<p>   “Pfft, you’re not rude Jisung, don’t worry.” Minho chuckles and hands Jisung his plate.</p>\n<p> </p>\n<p>   They end up on Jisung’s couch like usual, facing each other as they talk.</p>\n<p> </p>\n<p>   “It’s kind of hard to explain, especially since I’ve been deaf most of my life. Even when I still had some hearing, it was very poor, and the hearing aids I used only did so much for me.”</p>\n<p> </p>\n<p>   Jisung listens to Minho with morbid fascination, his curiosity only growing now that he knows Minho is comfortable talking to him about the topic.</p>\n<p> </p>\n<p>   “Actually, I have an idea!” Minho exclaims just a bit too loud, another quirk that fills Jisung up with a warm feeling in his chest.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>   “So, you'll put these on, and try to read my lips, okay?” Minho explains, holding Jisung’s headphones out, the ones that are nearly soundproof. Them, paired with some white noise, according to Minho, will be able to give Jisung an idea of what it’s like to be able to read lips.</p>\n<p> </p>\n<p>   “It’s going to be harder than it seems, I’ve had years of practice and experience.” Minho doesn’t say it as if he’s bragging, just explaining. “I generally only catch seventy percent of what you’re saying, and even then a lot of it is process of elimination and guesswork, depending on context clues.”</p>\n<p> </p>\n<p>   Minho tells Jisung that it’s not only the lips he pays attention to, it’s also body language, facial expressions, and Jisung is struck with how hard Minho must work to talk with him at all, and begins to feel guilty about the number of times he spoke to fast, with food in his mouth, and so many other things that must have made it more of a challenge for Minho.</p>\n<p> </p>\n<p>   “You ready?”</p>\n<p> </p>\n<p>   Jisung nods, taking a deep breath before fitting the headphones over his ears.</p>\n<p> </p>\n<p>   It takes Jisung a moment to adjust to the buzzing in his ear, which after a few seconds, blends into a hum that reminds him of those times when it’s so silent it seems like everything is so loud. In front of him, Minho gives him a thumbs up, and Jisung finds himself staring intently at Minho’s lips as they move.</p>\n<p> </p>\n<p>\n<em>   Okay? </em>\n</p>\n<p> </p>\n<p>   Jisung feels a small burst of pride when he understands Minho, but it fades quickly when Minho’s lips begin to move again, in strange ways that Jisung can’t follow fast enough to figure out what they mean.</p>\n<p> </p>\n<p>   He misses the first part of the sentence, but he can at least tell that it’s a question. He considers it a very sad victory that isn’t a victory at all.</p>\n<p> </p>\n<p>   “Do I want tteokbokkie?” Jisung asks hesitently, looking up to Minho’s eyes, which crinkle up as he laughs—Jisung mourns the fact that he can’t hear it happen—and shakes his head. Jisung pouts.</p>\n<p> </p>\n<p>   “Are you sure?”</p>\n<p> </p>\n<p>   Jisung pouts and takes off the headphones for a moment. </p>\n<p> </p>\n<p>   \"What did you say?\" Jisung asks, feigning a kick at Minho when he continues to laugh. \"Come on! What did you say?\"</p>\n<p> </p>\n<p>   \"I asked you if you knew you were pretty.\"</p>\n<p> </p>\n<p>   All words leave Jisung for a moment as he stares at Minho, who gives him a shy smile in return. </p>\n<p> </p>\n<p>   \"Oh...\"</p>\n<p> </p>\n<p>   \"Very pretty.\"</p>\n<p> </p>\n<p>   Minho hums as he nods, reaching up and tugging the headphones back over Jisung's ears. A shiver runs through Jisung when he feels Minho's fingers brush past his flushed cheeks. </p>\n<p> </p>\n<p>   Jisung is still frozen for a moment, until he sees Minho talking to him and his racing mind is overcome with the need to try and figure out this new puzzle. His face doesn't cool down for a long while though. </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>   Jisung learns that he is absolutely terrible at reading lips. It seems that the more dejected Jisung becomes, the more entertained Minho appears to be.</p>\n<p> </p>\n<p>   Minho holds up one finger to help Jisung along.</p>\n<p> </p>\n<p><em>   One</em> <em>more?</em></p>\n<p> </p>\n<p>   Jisung nods, knowing that all too soon they’ll both have to leave each other. The happy feeling in Jisung’s chest will hopefully remain throughout his class, and be the one thing preventing him from smashing his head into his desk in an attempt to end his suffering.</p>\n<p> </p>\n<p>   Jisung focuses on Minho’s lips, silently admiring them in the moments Minho isn’t speaking, and also as he talks. Jisung finds the way Minho forms his words strangely beautiful, like a form of art that has yet to be discovered. Something Jisung could keep to himself to admire.</p>\n<p> </p>\n<p>   He thinks that even if he never wears these headphones again for this purpose, he’ll be looking at Minho’s lips a lot more often than he used to.</p>\n<p> </p>\n<p>\n<em>   Can I...you? </em>\n</p>\n<p> </p>\n<p>   “A little slower.” Jisung asks, leaning forwards, he’s determined to get this last one.</p>\n<p> </p>\n<p>\n<em>   Can I kiss you? </em>\n</p>\n<p> </p>\n<p>   “Can I kiss you? Can I kiss you!” Jisung throws his arms up when he finally gets it, only to freeze and look at Minho, who is watching him with an expression Jisung has never seen before.</p>\n<p> </p>\n<p>   It’s vulnerable, almost scared.</p>\n<p> </p>\n<p>   “Can you kiss me?” Jisung blinks a few times, unsure if he actually understood right. He almost wonders if it’s a joke Minho is playing, until Minho nods slowly.</p>\n<p> </p>\n<p>   Jisung lowers his hands into his lap, jaw slack.</p>\n<p> </p>\n<p>   Minho turns to stand up, probably about to run out. Jisung snaps out of his stupor and drags Minho back down onto the couch, the static playing in his ears nothing compared to the sound of blood rushing through his head as he nods, taking Minho’s hands in his own.</p>\n<p> </p>\n<p>   “Yeah, yes, <em>please</em> kiss me.”</p>\n<p> </p>\n<p>   Minho’s hands are soft, Jisung thinks when Minho settles one of them on the side of his neck, right over his pulse, which is sure to be going crazy at this point. Even more so as Minho takes his own sweet time removing the headphones and seems to take a minute to just <em>look</em>, though it could be Jisung’s own brain turning the kiss into his very own disney moment. </p>\n<p> </p>\n<p>   His heart pounding as Minho leans in.</p>\n<p> </p>\n<p>   Jisung’s breath catches in his throat when Minho’s lips brush against his own, his eyes closed and hands trembling where they rest on Minho’s hip and knee respectively. The taste of peach soda is both unexpected yet still unsurprising to Jisung. Something that is unapologetically Minho, he thinks fondly.</p>\n<p> </p>\n<p>   It should be awkward, seeing as one half of the situation depends on Jisung <em>not</em> being so, but strangely everything seems to click into place.</p>\n<p> </p>\n<p>   Minho’s lips are soft, but firm against Jisung's own when he leans closer, the first brush of lips merely a tentative step before Minho’s lips are moving against Jisung’s and a tingling sensation spreads throughout Jisungs body.</p>\n<p>  </p>\n<p>   He doesn't even notice as he leans into every touch, following Minho as he leans back, until Jisung falls forward into Minho's waiting arms with a small surprised huff. He doesn't let Minho get away with his shit eating grin though, climbing into Minho's lap and taking a handful of his shirt to keep him from moving any further away. </p>\n<p> </p>\n<p>   It takes a moment for Jisung to realize that Minho is laughing as he kisses him, Minho’s other hand coming up to cup Jisung’s cheek and brush his thumb across his cheekbone.</p>\n<p> </p>\n<p>   “What?” Jisung pulls away, the happiness that had begun to fill his body faltering for a moment. Did Minho think he was a bad kisser? Did he do something weird? </p>\n<p> </p>\n<p>   “Nothing, I promise, it’s just your heartbeat is insane—” Minho giggles, dragging Jisung over into another gentle kiss.</p>\n<p> </p>\n<p>   \"It's always like that when it comes to you.\" Jisung admits, shoving Minho down on the couch to kiss him again, and again, and again, until his own lips are stained with the taste of peach and Minho has felt every tremor of excitement and will know how happy he makes Jisung. </p>\n<p> </p>\n<p>   Jisung wonders if Minho can feel his smile as he kisses him, relishing every shaky exhale and small nose swallowed up by his lips. He knows Minho probably isn't even aware of them, and the thought sends a shiver down his spine that he might be one of the only people to know Minho this way. To see Minho's eyes crinkle up when Jisung kisses him all over his face, to hear Minho fall into a fit of giggles when Jisung snuggles up into his chest and presses a kiss to his jaw.  </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>   Fifteen minutes later and Jisung’s heart has yet to calm itself, and if you were to look closely, you would see that Jisung’s lips are slightly more red than usual. His lower lip tingles as he runs his tongue over the seam of his lips. The taste of Minho’s peach soda is there, and he feels a small burst of satisfaction.</p>\n<p> </p>\n<p>   Minho kisses the corner of his smile before they leave the apartment.</p>\n<p> </p>\n<p>   They walk down the stairs to the front hall as slow as they can manage, fingers laced together even though it makes going through the revolving door a hassle.</p>\n<p>  </p>\n<p>   “See you when your shift ends?” Jisung asks, and Minho is staring at his lips for a whole new reason now as he leans down to cover their inch difference and kiss Jisung before nodding.</p>\n<p> </p>\n<p>   “For sure.”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>   \"So how do I ask for a kiss in sign language?\"</p>"
}