{
  "id": "16122836",
  "url": "https://archiveofourown.org/works/16122836?view_full_work=true",
  "author": [
    "reading_raindrop"
  ],
  "title": "What The Fuck Did You Just Call Me?",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
  ],
  "relationships": [
    "Bakugou Katsuki/Midoriya Izuku"
  ],
  "characters": [
    "Bakugou Katsuki",
    "Midoriya Izuku",
    "Kirishima Eijirou",
    "Kaminari Denki",
    "Uraraka Ochako",
    "Ashido Mina",
    "Mineta Minoru",
    "Todoroki Shouto",
    "Aizawa Shouta | Eraserhead"
  ],
  "additional_tags": [
    "Bakugou Katsuki Swears A Lot",
    "Bakugou Katsuki is Bad at Feelings",
    "My First AO3 Post",
    "Oblivious Midoriya Izuku",
    "Oblivious Bakugou Katsuki",
    "Two oblivious dorks",
    "Mutual Pining",
    "katsuki’s POV mostly",
    "Fluff",
    "Teensy teensy bit angsty I guess"
  ],
  "language": "English",
  "series": "",
  "published": "2018-09-28",
  "completed": "2018-10-04",
  "words": "8,303",
  "chapters": "4/4",
  "comments": "854",
  "kudos": "40,774",
  "bookmarks": "6,111",
  "hits": "472,881",
  "summary": "<p>“A-ah B-Bakugou! You dropped some pencils!”</p>\n<p>Katsuki stiffened. Kirishima and Kaminari froze. Basically, everyone within earshot stopped what they were doing to look at Izuku like he sprouted a second head. What did he just call him? “What the fuck did you just say to me?”</p>\n<p>Katsuki whipped his head towards Izuku with his signature death glare as he stood up from where he picked up the fallen supplies.</p>\n<p>“U-um I said you dropped some pencils! I think this eraser might be yours to-”</p>\n<p>“No. What the fuck did you just call me?”</p>\n<p>Izuku starts calling him Bakugou and it pisses the explosive teen off a lot more than he thought it would</p>\n<p>Katsuki is an early bird and Deku is his worm c:</p>\n<p>Katsuki has a bad habit of walking away instead of facing his problems. :'-(</p>\n<p>Katsuki and Izuku make a habit of running into each other in the wee hours of the morning.</p>",
  "notes": "<p>Thanks to my friend <a href=\"https://twitter.com/LuaLunatica2\" rel=\"nofollow\">Lua</a> (u should follow her on twitter she's really nice!) this story is being translated into Portuguese!! </p>\n<p>You can find the translation on <a href=\"https://www.spiritfanfiction.com/historia/de-que-merda-voce-me-chamou-19407608\" rel=\"nofollow\">spiritfanfiction</a> or <a href=\"https://www.wattpad.com/story/226552790-de-que-merda-voc%C3%AA-me-chamou\" rel=\"nofollow\">wattpad</a></p>\n<p>Thank you so much Lua &lt;3 And I hope you all like my story thank you for reading ily &lt;3</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>I am SO surprised at all the feedback I am getting for this fic!??? I honestly thought I'd get maybe 10 kudos if I was lucky haha! And I didn't even THINK about comments! I just did this for the fun of it but I'm actually really happy so many people seem to enjoy the story so far! I've always been too self-conscious to contribute to my fandoms but this is actually really fun! Thank you so much for all the kudos and nice comments! The tips and pointers are greatly appreciated as well! Please let me know if you notice any repeating mistakes or ways I can improve my writing! I hope you enjoyed this chapter! Thank you for reading &lt;3 &lt;3 &lt;3</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>I really hope you liked this chapter!! And I want to give another thank you to all the kudos and comments! A lot of you have given me really good advice and even some good ideas to add to the story! So thanks a lot!! &lt;3 &lt;3 Hope you all have a good day :D</p>\n<p>P.s.<br>In case it's not obvious enough, the whole class is aware that these two dorks are pining for each other :P</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>WELP. THAT'S IT. THAT'S MY STORY ᕕ(ᐛ)ᕗ<br>I really hope you guy's liked the way I ended it! I wasn't intending to write a kissing scene cause I'm not confident enough in my writing skills but it just kind of happened and I think it turned out okay!? Anyways please tell me what you thought! Or if you have any more writing tips! Again thank you so much for the kudos and comments!! I'm still in shock at how good the response was for this story!? It's been a great first fic experience I think! &lt;3 I hope to write more about my blushy explodo boi and freckled bunny boi soon.</p>\n<p>ALSOOO A little extra backstory the whole class was trying to scheme ways to get the two idiots to finally admit to there feelings for each other because its literally painful and disgusting to watch them pine for each other until one-day Izuku was telling Uraraka how he felt like Katsuki's nickname was annoying him and Kirishima happened to be in the room at the same time and he knew that Izuku calling him Bakugou would drive him nuts and so you can guess the rest lol</p>\n<p>Also would like to add that Kirishima and Uraraka were trying to help and didn't think it would cause Katsuki such emotional pain and turmoil like it did.</p>\n<p>Thank you for all the kind words and comments again!!! I'm so sorry if I don't get to replying to all of them! Just know I read every one and they mean a lot &lt;3 &lt;3 &lt;3</p>\n<p>THANK YOU FOR READING</p>\n<p>P.S.</p>\n<p>This really awesome person made these fucking <a href=\"https://pumpkincalico.tumblr.com/post/179054026377/i-read-such-a-cute-bkdk-fanfic-by#_=_\" rel=\"nofollow\">adorable drawings</a> for my fic and I literally cried for ten years when I saw them?? Seriously if you haven't followed <a href=\"https://pumpkincalico.tumblr.com\" rel=\"nofollow\">pumpkincalico</a> on tumblr already you really should!!! They’re so sweet and make AMAZING ART!!</p>\n<p>Soooo this is my first fic like EVER so constructive criticism would be greatly appreciated! I'm not sure if a fic like this has already been made but it popped in my head and I kept getting ideas for it so I figured why not? This a short first chapter and so far kinda basic? But other chapters will probably be a bit more lengthy and have more Izuku and Katsuki Interaction! I'm thinking it'll be 3 chapters long maybe 4! I'm not sure how consistent I have to be with chapter lengths I'm so new at this haha! I would love to hear feedback and some writing pointers since I am clearly very new at this! Thank you for reading!! &lt;3</p>",
  "text": "<p>“Hey Baku-bro!” Kirishima called cheerfully, Kaminari trailing behind him,” Wanna study with us for that Math test tonight?”</p>\n<p>“Why the fuck would I wanna study with you losers?” Katsuki shoved his notebooks and binder in his bag. He noted both of them were already packed up with their backpacks on even though the final bell rang barely ten seconds ago. They probably anticipated Katsuki making a swift exit to fit in some extra training before dinner and homework. Those assholes, cornering him like this.</p>\n<p>“Ahh c’monn Bakugou! You’re so good at Geometry and I really need help with proofs!” Kaminari whined, putting his arm around Bakugou’s shoulder before he shoved him away.</p>\n<p>“Yeah c’mon Baku-bro! There’s gonna be snacks!! I’ll bring your favorite Extra Spicy Jalapeno Chips!!!” So they were bribing him now.</p>\n<p>“Tch. Fine. But only because you dumbasses wouldn’t stand a chance at passing that test without my help.” Definitely not cause he actually liked spending time with them. Definitely not.</p>\n<p>Katsuki aggressively swung his backpack over his shoulder not realizing he forgot to zip the pencil pocket until a certain puppy-eyed, freckled face, nerd called out to him.</p>\n<p>“A-ah B-Bakugou! You dropped some pencils!”</p>\n<p>Katsuki stiffened. Kirishima and Kaminari froze. Basically, everyone within earshot stopped what they were doing to look at Izuku like he sprouted a second head. <em>What did he</em> <em>just call him?</em> “What the fuck did you just say to me?”</p>\n<p>Katsuki whipped his head towards Izuku with his signature death glare as he stood up from where he picked up the fallen supplies.</p>\n<p>“U-um I said you dropped some pencils! I think this eraser might be yours to-”</p>\n<p>“No. What the fuck did you just call me?”</p>\n<p>By now most people were hastily packing up the rest of their things and shuffling out of the room before they have to witness another one of Katsuki’s infamous ‘Explodo Moods.’ A common occurrence whenever Midoriya was involved.</p>\n<p>“ Oh haha!” Izuku scratched the back of his head and looked to the side sheepishly, a light blush dusting his cheeks at Katsuki noticing the change so quickly, “ I-I figured we’re kind of starting to get too old for me to call you such a childish nickname! And I know it really annoys you so I figured since we’re proper rivals now I should call you something more mature and most people call you Bakugou so it makes sense that I’d call you that t-”</p>\n<p>“Shut the fuck up! Whatever. I don’t care. Call me whatever the fuck you want just stop with the fucking mumbling!” Katsuki pushed passed Izuku and stomped out the door.</p>\n<p> </p>\n<p> </p>\n<p>He stalked down the busy hallway with an even deeper glare than usual. Why did he feel so bothered all the sudden?</p>\n<p>“That was really weird huh?”</p>\n<p>“Yeah for a bit I didn’t even think Midoriya knew he went by Bakugou”</p>\n<p>“I didn’t even realize it was Midoriya talking till I saw him!” </p>\n<p>He didn't notice the two idiots were still following him through the hallways. “Why don’t you go fucking follow somebody else for a change? I’m tired of hearing your annoying ass voices,” Katsuki spat. Sending a particularly harsh glare over his shoulder that would probably send anyone else fleeing. But dunce-face and shitty-hair where stubborn little shits who weren’t intimidated by Katsuki’s death stares or threats. God he wanted to go explode something.</p>\n<p>“This is the fastest way to the dorms!” Kaminari shrugged, “ And why are you so extra grumpy right now? I can practically see steam blowing out of your ears! Midoriya can’t piss you off that much. I thought you guys were kinda cool now?”</p>\n<p>Kaminari was right. They were on a lot better terms now ever since that night at ground beta when they finally talked (and fought) things through. Katsuki found himself not as pissed off when he was around the nerd. They sometimes even trained together if they ended up at the training grounds at the same time. And if they were both alone in the library studying and doing homework, maybe they sat at the same table. Maybe Katsuki helped Izuku with English. Maybe Izuku would ramble to Katsuki about a new hero article he read and maybe Katsuki let him.</p>\n<p>And maybe Katsuki found himself begrudgingly like spending more time with the nerd, but WHATEVER what the fuck ever the freckled idiot still pissed him off even if it was significantly less than before. And it’s not like he would ever in a million years tell Dunce-face or anyone that.</p>\n<p>Why was he even pissed off anyway? If anything he should be happy that nerd finally dropped that sissy nickname. <em>B-</em>Bakugou<em>!</em> It sounded so foreign coming from the nerd and thinking about it made irritation prick at the back of Katsuki’s neck. And it only ticked him off more that it bothered him so much.</p>\n<p>“You know what I think?” Kirishima sped up to match pace with Katsuki and looked at him with a sly grin. “I think you’re mad cause you actually liked Midoriya’s cute little nickname for you!”</p>\n<p>“Why the FUCK would I like that stupid, kiddie ass name!?” Katsuki shouted. He was really getting pissed now. Small sparks shooting from his palms. Of course he hated that name. <em>Kacchan.</em> <em>Kacchan. Kacchan!</em> So fucking annoying! He could just picture that nerd with his soft voice, and wide emerald eyes, those round freckled cheeks, and hair that was probably still as soft as it was when they were little and WHERE THE FUCK WAS KATSUKI’S BRAIN GOING RIGHT NOW.</p>\n<p>Katsuki’s glare got impossibly more deadly, mouth set in a snarl and he was practically making craters with every stomp of his feet. “Why else would you be so pissed off right now!?” Kirishima asked with a cheeky grin. Kaminari was smiling like an idiot too.<em> Fuckking Shitty-hair. Fucking dunce-face. Fuck them both.</em> “I bet he’s never called you anything else huh? You’ve guys have known each other since you were toddlers that name has to have some sentimental value no matter how ‘annoying’ you say it is.”</p>\n<p>“Awwww poor Bakugou! If you want I can start calling you Kacch-”</p>\n<p>“FUCK OFF” Kaminari was blasted against a locker, hair sizzling and clothes burnt.</p>\n<p>Katsuki pulled up his burnt orange scarf to cover his nose. <em> Fuck it’s cold. </em>It was barely October and already he was freezing his ass off almost every morning. But he was probably not a reliable opinion considering his quirk relies on him being warm which makes him pretty sensitive to the cold.  </p>\n<p>His classmates would think otherwise. Katsuki was practically a walking furnace radiating heat. Sometimes he’d have to fight them off from clinging to him like they were a fucking pack of penguins or some shit.</p>\n<p>It was currently 7:15 AM and Katsuki was already making his way out the dorms towards the school building. He liked being at school pretty early. The quiet was peaceful and he usually spent the 45 minutes or so before the first bell sitting at his desk finishing up homework while listening to music. It was the calmest part of his day and he cherished the stillness of early mornings.</p>\n<p>Cold crisp air nipped at his face and ears. He was about to put his headphones on as makeshift earmuffs when he noticed a figure at the corner of his eye sitting on one of the various benches lining the front of the dorms.</p>\n<p>Turning his head to get a better view of the person he saw dark green curls covered by a bright red beanie and matching gloves. <em>Deku</em>. What was up with him and that obnoxious ass color? <em>Your eyes are that obnoxious ass color so why are you talking shit? Touché self, touché. </em></p>\n<p>Izuku was hunched over, his phone in one hand, the other jotting down notes on his notebook. Mumbling something Katsuki couldn’t hear. He didn’t notice he was even walking closer to the nerd till the soft crunch of his shoes on the frosted grass caused Deku’s head to shoot up in alert.</p>\n<p>His eyes lit up at the sight of Katsuki and flashed a friendly smile. His nose was a little red from the cold making the freckles there less noticeable. “Oh! Good morning Bakugou! You’re out early!”</p>\n<p>Katsuki grimaced slightly at the name. Oh yeah, that’s how the nerds addressing him now. The name still sounded so unnatural coming from him. It felt like someone set a paperweight in his chest every time he heard that name out of the freckled teen’s lips.  “I should say the same for you. What the fuck are you doing out so early Deku?”</p>\n<p>“Uraraka-san wanted to go to this new coffee shop across the street from the school! So I told her I’d meet her early in the morning to try it before class!” Izuku looked down fumbling with the end of his scarf, a light blush dusted his cheeks. He spoke again hesitantly, “ U-um you can c-come too if you want! I hear they have a really good dark brew!”</p>\n<p>Katsuki whipped his head to the side. “Tch. Like I’d want to go to some stupid ass coffee shop with you dorks.” he snapped, pushing down that pleasant feeling beginning to swell in his chest at the invitation.</p>\n<p>He looked back towards Izuku to see his smile slightly crestfallen like he was trying to hide his disappointment. Katsuki felt an ugly weight replace that pleasant feeling from before. <em>Shit.</em> Why was he such an asshole and why did Deku’s dejected face make him feel this way.</p>\n<p>“A-ah Y-Yeah I didn’t think you’d want to come anyway. I just thought it wouldn’t hurt to ask!” Izuku explained trying to sound cheery.</p>\n<p>“I just!” Katsuki quickly said, wanting to wipe that stupid upset expression off the nerd's face. “I have homework to finish before class starts..” his voice lowering as he finished his sentence looking down a little to avoid looking at Izuku.</p>\n<p>When he glanced back up Izuku was smiling again, more genuine than before. “Oh! Of course! Wow, Bakugou! So responsible!”</p>\n<p>While he winced at the sound of his dumb fucking surname again, he could feel his cheeks warm up from the praise. “Whatever! Don’t flatter me nerd!” he barked, though it didn’t carry much bite.</p>\n<p>He was about to turn to continue his walk towards the school building for lack of anything else to say before he heard the nerds soft voice call to him again.</p>\n<p>“Uh Wait! Ka-B-Bakugou!” A feeling he couldn’t explain coursed through Katsuki when he almost heard his pet name. Maybe the nerd was just as uncomfortable with the name change as he was. “I forgot to give you your pencils and eraser back from yesterday!”</p>\n<p>Oh yeah.. He forgot about that. He had to borrow a pencil from Shitty-Hair last night when they were working on the study guide for Geometry. He could’ve used one of his pens but every dumb motherfucker knows it’s better to use a pencil with math.</p>\n<p>“Oh Okay… thanks,” he said stiffly. Turning his back towards Izuku and looking back at him expectantly.</p>\n<p>The nerd shuffled slightly a hint of confusion in his expression.</p>\n<p>“Just put it in the fucking small pocket!”</p>\n<p>“O-Oh! Okay, sure!” Izuku stumbled over to Katsuki, unzipping his bag and placing the writing utensils back inside.</p>\n<p>Katsuki felt the tug of Izuku opening and closing the pocket of his backpack before he heard a small exclamation, “Wha! Bakugou!! Is that the new limited edition Best Jeanest pin! So cool!! Did you get that from your workplace experience!?”</p>\n<p>Katsuki whirled around a scowl on his face. He definitely could not stand hearing that damn name out of the nerd's mouth. “Would you fucking STOP-” he cut short, realizing just how close he was to Deku.</p>\n<p>His breath caught in his throat, eyes widening slightly. Katsuki was stuck in place lost in the deep green of Izuku’s eyes, the morning sun casting flecks of gold in his emerald irises. His eyes traveled down to his flushed freckled cheeks and dusty red button nose, to his slightly chapped lips.</p>\n<p>“Good morning Deku-kun!! Ah Bakugou?”</p>\n<p>Katsuki jumped back at the new voice and shook his head trying to push down the red crawling up his neck and burning the tips of his ears. <em>What the fuck just happened?</em></p>\n<p>Izuku snapped his head towards the bubbly brunette. “O-O-Oh G-Goodmorning Uraraka-san!”</p>\n<p>Jesus. His face was even redder than Katsuki’s face felt. He looked like a tomato and the red beanie wasn’t helping.</p>\n<p>Ochako trotted over and gave Deku a hug for a greeting. Irritation spiked through Katsuki at the sight. <em> What the fuck is wrong with me today? </em></p>\n<p>She then turned her gaze towards Katsuki “Good morning Bakugou-san! Are you coming with us to Cafe Oo La La?” Her smile was cheeky and the way she looked at Izuku knowingly made the nerd flush even deeper.</p>\n<p>Katsuki was too busy recovering from whatever the fuck happened a minute ago to think too much about their little exchange. He could still feel his cheeks burning.</p>\n<p>“HELL NO.” He snapped, whipping around and stalking away before he became as red as the freckled dork.</p>\n<p><em>Fuckk. </em>What was that? Why did he get distracted like that? He didn’t even get a chance to tell the nerd to stop fucking calling him Bakugou.</p>\n<p>He marched across the quad towards the  Hero Department building with a scowl on his face, shoulders hunched and hands shoved in his pockets.</p>\n<p>But maybe it was better that he didn’t say anything about it. How the fuck was he supposed to word that?</p>\n<p>\n<em>“Hey I actually don’t hate that you call me Kacchan but boy does it piss me off when you call me Bakugou.”</em>\n</p>\n<p>\n<em>“Listen I actually like that stupid nickname and hearing you call me anything else sounds too formal and detached and it grinds my fucking gears?”</em>\n</p>\n<p>Either way he says it he’s gonna sound like a fucking sentimental chump so he might as well not say anything.</p>\n<p>Deku’ll get over it eventually right? It has to feel as foreign on the nerd's tongue as it sounded in Katsuki’s ears. In a week or two he’ll give up the whole Bakugou thing judging from his little slip earlier.. right?</p>\n<p> </p>\n<p>He was wrong. THREE FUCKING WEEKS had passed and he still hadn’t heard his childhood nickname from the nerd.</p>\n<p>Three fucking weeks of, “<em> Bakugou did you make adjustments to your gauntlets? So cool!” </em></p>\n<p>\n<em> “U-um Bakugou do you maybe want to spar?” </em>\n</p>\n<p>\n<em> “Bakugou can you help me with this question on the homework?” </em>\n</p>\n<p>\n<em> “Bakugou” </em>\n</p>\n<p>\n<em> “Bakugou” </em>\n</p>\n<p>“BAKUGOU”</p>\n<p>“WHAT?” Katsuki snapped his head to the shitty haired idiot who just called his name. He glared at Kirishima only to see him staring at Katsuki’s food tray.  He looked down to his plate to see his salad spread all over the place and a very mutilated looking baby tomato.</p>\n<p>“You’ve been repeatedly stabbing your salad for like two minutes now. Hmm, Could a certain self-destructive, all might loving fanboy be plaguing your thoughts?” Kirishima questioned with a knowing grin.</p>\n<p>“I don’t know what the fuck you’re talking about.” Katsuki glowered. He stabbed the mangled tomato one last time and shoved it in his mouth, chewing aggressively.</p>\n<p>“Oh c’mon Bakugou! Everyone knows that’s why you’ve been like ten times more irritable lately!” Kaminari said before blowing on his soup and slurping it obnoxiously.</p>\n<p>“Well..” Mina interjected, head resting in her palm and a smirk on her lips, “maybe not everyone.” She glanced over her shoulder to the table across from them.</p>\n<p>Katsuki followed Pinky’s eyes to were the nerd was sitting. He was smiling, talking and gesturing excitedly to Todoroki. The corner of Half n’ Half’s lips upturned the slightest bit as he quietly listened to the enthusiastic boy. He felt that same pang of irritation he experienced a couple weeks ago when Deku hugged Uraraka.</p>\n<p>The nerd must have felt Katsuki’s gaze cause he stopped talking and looked around till their eyes met. He flashed him a sunny smile, freckled cheeks dusted pink, and a small wave. Katsuki quickly broke eye contact and snapped his head to the side with a scowl. Fuck he hoped his blush wasn’t noticeable.</p>\n<p>“Why don’t you just tell him it bothers you when he calls you Bakugou?”</p>\n<p>“Oi! Are you guys talking about Midoriya!” Mineta crawled out from under the table (<em> What the fuck was he doing down there? </em>) and pushed himself up on the bench between Katsuki and Kaminari. He then scrunched his face up and cooed mockingly at the explosive blonde “Awwwwww do you miss your cute little Deku calling you Kacch-BLRPDL”</p>\n<p>Katsuki shoved Mineta’s head in Kaminari’s soup followed by a small explosion, his lip curling dangerously. “The fuck did you say Balls for Brains? He’s not my cute little anything”</p>\n<p>“DUDE. What the fuck!!? My soup!!”  </p>\n<p>Katsuki then whipped his head towards Kirishima, “And there is nothing to tell Deku because I don't give a flying FUCK that he calls me Bakugou and I don’t give a FUCK about that stupid baby name.” He then mushed Mineta’s head deeper in the soup for emphasis before letting go.</p>\n<p>“Mmm. Kaminari! Is that minestrone?”</p>\n<p>Katsuki shot up from his seat and marched out of the cafeteria without another word. He was fucking done with his shitty friends and their shitty opinions. It pissed him off that it was so obvious he hated the name change and it pissed him off even more that it even bothered him so much in the first place.</p>\n<p>“Hey Bakugou!! Slow down!” Kirishima jogged up to walk with the seething blonde across the courtyard. “Listen. We’re best bro’s! You don’t have to lie to me! And as much as you deny it, it’s clear as day you miss that nickname Midoriya calls you. I see the way you flinch when he’s called out to you the past couple weeks.”</p>\n<p>“Leave me the fuck alone Shitty Hair,” he growled speeding up his pace to get away from the idiot.</p>\n<p>“No! Wait! Come on bro!” He marched faster and placed his hand on Katsuki’s shoulder to stop and face him. “I really think you should just tell him. What do you think Midoriya’s gonna do? Make fun of you? Mock you? When has he ever done any of those things to like anyone?”</p>\n<p>“Never..” Katsuki said begrudgingly then shook his head when he realized he was actually listening and fucking CONSIDERING following the shitty red head’s advice. The bell rang, signaling the end of lunch. He yanked his shoulder from the other’s grasp and stomped away. “JUST STAY OUT OF IT SHITTY KIRISHIMA. This doesn’t concern you.”</p>\n<p>“Hey wait!!” Kirishima tried to catch up but he lost him in a stampede of students trying to get back to class. He let out a visible sigh and shook his head with a hand on his hip. “What am I gonna do with that kid”</p>\n<p> </p>\n<p>Katsuki pushed open the Library doors after school that day, as he usually did on Wednesdays and Fridays. And if he chose those specific days because a certain freckled nerd was there at the same time every week, then he’d never admit it out loud.</p>\n<p>He almost considered not going in and just studying in his room. Being around the nerd was becoming too much for his mental health. Every time he said his fucking shitty ass surname, he swore three days were knocked off his life. It pissed him off to no end and he really didn’t want to lash out at him if he finally snapped. Seeing Deku upset, especially cause of him, was becoming even more unbearable than his lost nickname.</p>\n<p>But his body betrayed him, feet marching to the library right as the final bell rang like they had a mind of their own. There was no denying it. He could begrudgingly admit to himself that he felt a deep-rooted longing to be near Deku. It was like a magnetic pull that always had Katsuki searching Deku out in a busy hallway or gravitating closer to him in a crowded room.</p>\n<p>As soon as he walked through the library entrance he immediately noticed the mop of green curls near the corner of the room where the nerd always sat. He was facing away from Katsuki and when he saw who Deku was turned towards he instantly scowled. <em> Fucking Half n Half bastard. </em></p>\n<p>Heterochromatic eyes lit up when they met with blaring red and then the bastard smirked before saying something to Deku that he couldn’t hear. He couldn’t see the nerds expression from where he was walking. But he could tell from his posture that he was a little confused, but he nodded slightly in understanding.<em> The fuck? </em></p>\n<p>When he finally got within earshot Todoroki stood up from his seat and gave Izuku a small smile. “Well. I should probably get going.” he said evenly, “It was nice talking with you Deku-kun,see you later.”</p>\n<p>When the fuck did Half n Half bastard start calling him Deku-kun? He wasn’t fucking Round-Face.</p>\n<p>“O-oh Okay! See you later Todoro-Uh Todo-kun.?” Katsuki’s left eye twitched and his back went rigid. <em> What. The. FUCK?????? </em></p>\n<p>Todoroki look pleased before he grabbed his bag and strolled past Katsuki. He gave him a  nod in greeting, his smile smug and a mischievous glint in his eye, ”Bakugou.”</p>\n<p>“Fucking Half n Half.” he snarled darkly with barely contained rage. He was doing his best to calm the small sparks escaping from his clenched fist. The librarian here was SCARY and he did not like to recall the last time he went on a rampage in the library.</p>\n<p><em> What the flying pile of dog shit on a stick did Deku just fucking call Todoroki? When the fuck did that shitty pet name become a fucking thing? </em> He whipped his head around, glaring daggers at Todoroki's retreating back. <em> Fuck I want to explode off every hair on his shitty half n half head. </em></p>\n<p>He then turned back to Deku. His head was buried in his textbook and he softly mumbled to himself as he took notes. Katsuki slammed his backpack on the table and aggressively plopped down where Half n Half was sitting moments ago.</p>\n<p>Deku jumped from the loud thud of his bag, “Oh geez! Y-you scared me!” The nerd sighed hand clutching his chest. Katsuki said nothing and pulled his textbook and binder out of his bag, dropping them on the table with a loud smack.</p>\n<p>A vein bulged on his forehead as he tried to make sense of the nerd and Half n Half’s exchange. <em> Why did they call each other that? When did they start addressing each other so familiarly? Oh god. They couldn’t be. Could they be? </em>Katsuki’s stomach lurched and his heart clenched painfully at the conclusion that jumped in his head</p>\n<p>“Hey.. What’s the matter?” Katsuki’s train of thought was interrupted and he looked towards worried green eyes. His heart clenched even harder just looking at him. God, why did the thought of Deku dating that half n half bastard cause him such physical pain?</p>\n<p>“Nothing.” Katsuki answered stiffly, willing himself to look indifferent and turning to his book and opening his binder.</p>\n<p>“Are you sure? You seem upset about someth-”</p>\n<p>“I said it’s nothing!” Katsuki snapped harshly, daring the nerd to keep pushing the subject.</p>\n<p>He seemed to have got the message cause he didn’t say anything after that and they both worked in silence. It was unbearable. The quiet only left room for Katsuki’s brain to run wild with thoughts of Izuku and Todoroki possibly dating. It couldn’t be though right? He would have heard about it. Wouldn’t he? But they had become really close especially since the Sports Festival and even more so since there run in with the Hero Killer. And Half n Half rarely smiled unless he was with Midoriya. <em> Fuckkkkkkkkkkk. </em>He kept getting unwanted images of them holding hands, them hugging, them ki-ki-ki-</p>\n<p>“AREYOUANDHALFNHALFDATING?” Katsuki blurted all at once before he could finish that deeply disturbing thought.</p>\n<p>“U-um what? I’m sorry I didn’t catch that.” The nerd looked at him with curious eyes.</p>\n<p>Katsuki felt his cheeks warming. <em> Fuck I can’t believe I’m asking this. </em> But he HAD to know or he was pretty sure it was going to eat him alive. He took a deep breath, willing his blush down before looking up at Izuku. “Are you and Half n Half.. <em> involved </em>?”</p>\n<p>Deku’s eye’s widened a bit as he processed what he had just asked then sputtered an incredulous chuckle. “Pfffttt. Me and Todoroki? Of course not!! What made you think that?”</p>\n<p>Katsuki put all his willpower into not visibly sighing in relief. Of course, they weren’t dating. He was so stupid. He was pretty sure that stoic asshole wasn’t capable of romantic feelings.. Or any feelings for that matter. But his blush darkened slightly at his reaction to the possibility of them together. And he didn’t want to tell Deku that he noticed or cared about the shitty nickname he gave to Todoroki. “Uhh. No reason. Just noticed you two were pretty close I guess.”</p>\n<p>“Well yeah. We’re close but we’re just friends!! Todoroki’s not my type!” He didn’t notice that the nerd wasn’t referring to him as Todo-kun anymore in favor of wanting to ask what exactly <em>was</em> his type? <em> God dammit why should I care? </em></p>\n<p>“But hey!” Izuku continued excitedly, he then glanced around to make sure no one else was listening before lowering his voice “He won’t admit it, but I think Todoroki likes somebody.”</p>\n<p>“Real shit?” Katsuki wasn’t usually one for gossip but he had to admit he was pretty curious. Who could that impassive bastard possibly fall for? “Who?”</p>\n<p>“I’ll tell you but you have to PROMISE that you won’t tell anyone!”</p>\n<p>“I promise”</p>\n<p>“Pinky promise?”</p>\n<p>“Are you fucking kidding me? What are we? Five?”</p>\n<p>Deku didn’t answer and stared at him pointedly his pinky held in the air.</p>\n<p>Katsuki rolled his eyes and sighed before bringing up his pinky and linking it with the nerds. “Fine. I pinky swear nerd,” he promised a small amused smile on his face.</p>\n<p>Deku’s face lit up and he scooted closer, hand cupping over his mouth and whispering a name into Katsuki’s ear. “THAT WIND BASTARD-mmf”</p>\n<p>Izuku quickly covered the explosive teen's mouth with his palm. “SHHHH. Be quiet! Someone could hear you!” he whispered, frantically looking around to make sure no one noticed his outburst.</p>\n<p>If it were anyone else, Katsuki would have bitten their finger off. But this was Deku so he simply smiled deviously from under his grasp before licking a sloppy wet stripe up the nerd's palm.</p>\n<p>“A-AH. Ewwww.” Deku snatched his hand away and quickly grabbed a handkerchief to wipe off the spit. Katsuki sniggered.</p>\n<p>“That’s what you get for trying to silence me.” He said with an evil grin.</p>\n<p>“Ugh. Bakugou! So mean!” The nerd pouted.</p>\n<p>Katsuki’s face fell, his mood instantly turning at the god-awful sound of that name on Izuku’s lips. His heart clenched anew and he looked down expression turning sour.</p>\n<p>“Hey..” Izuku looked at him, concern lacing his features. “Are you okay?”</p>\n<p>“I’m fine. I- I need to go.” Katsuki reached for his bag and went to stand up before a hand was placed gently on his shoulder.</p>\n<p>“W-wait!” Izuku looked at Katsuki with soft and caring eyes. It made his heart hurt even more. “I’ve noticed you seem kind of o-off lately. And I just wanted you to know that you can always talk to me. You can tell me anything.”</p>\n<p>\n<em> “What do you think Midoriya’s gonna do? Make fun of you? Mock you? When has he ever done any of those things to like anyone?” </em>\n</p>\n<p>Kirishima’s words rang in his head as he looked at Izuku’s soft smile. He could tell Deku outright that he missed his childhood nickname and he knew for a fact that the nerd wouldn’t judge him. He could end all this turmoil if he just told Deku that it physically hurt whenever he called him Bakugou, but he just couldn’t bring himself to say the words. He couldn’t tell the nerd because that would only prove how weak he was. That he was so weak, he couldn’t even handle something as simple as missing a stupid fucking pet name.</p>\n<p>Katsuki grabbed Izuku’s hand and released it from his shoulder. He stood up, bag over his shoulder, “I'm fine Deku.” He was out the library doors before Izuku could say anything else.</p>\n<p> </p>\n<p> </p>\n<p>\"Hey Midoriya, let's play a game.\"</p>\n<p>\"Umm, a game?\" Izuku looked at Todoroki questioningly. </p>\n<p>\"Yeah.. You have to call me Todo-kun and I have to call you Deku-kun for the rest of the day. Whoever messes up the other's name first, loses.\"</p>\n<p>\"Does that even count as a game?\"</p>\n<p>\"C'mon Midoriya, it will be fun.\" </p>\n<p>\"I mean I guess if you really want to! Is there like a prize you get if you w-\"</p>\n<p>“Well. I should probably get going. It was nice talking with you <em> Deku-kun </em> , see you later.” Todoroki stood abruptly with a smile, his eyes seeming to lock onto something behind Izuku when he said <em>Deku-kun.</em></p>\n<p>“O-oh Okay! See you later Todoro-Uh Todo-kun.?” </p>\n<p>Todoroki smiled almost smugly(?) and sauntered off. </p>\n<p>\n<em> Hmm. That was kinda weird. I wonder what that was about? </em>\n</p>\n<p>Izuku simply shrugged and carried on with his work.</p>\n<p> </p>\n<p> </p>\n<p>Todoroki is a little shit lol </p>\n<p> </p>\n<p>Katsuki tossed and turned in his bed. He’d been sleeping on and off all night. He just couldn’t turn his fucking brain off. “Fuck!” Katsuki groaned and turned to look at the clock. 3:06 AM. “Fuck.”</p>\n<p>With a sigh, he swung his legs out over the edge of the bed to sit up. He fucking gave up. <em> I’m going for a jog. </em> He dragged his hands down his face and rubbed at his eyes before getting up to find his running shoes.</p>\n<p><br>\n</p>\n<p>Katsuki shivered at the cool air on his bare arms as he walked towards the jogging trail that encompassed the school. He decided against a hoodie considering he would be pretty warmed up by the time he really got going.</p>\n<p>He was scrolling through his playlist looking for a proper song to start off his run when he heard rustling grass. His eyes darted up before he heard that soft call of his name that had been driving him mad all month. “Oh B-Bakugou! Are you going on a jog too?” <em> Of-fucking-course. </em></p>\n<p>Deku was mid stretch in a deep side lunge. His round eyes looked up to Katsuki curiously. The lamp pole cast a glowing halo around his inky green curls and shading a deep outline of his upper arms and calves. The nerd really was starting to bulk up. Especially in the bottom half area since he started practicing shoot style. Deku could probably crush a watermelon between those strong, thick thi-<em> OKAY GETTING OFF THE FUCKING SUBJECT. </em></p>\n<p>“What the fuck are you doing out so late you fucking nerd?”  Katsuki willed down the blush rising up his neck from that previous train of thought.</p>\n<p>Deku stood up from his stretch. “U-um I’ve been having kind of strange dreams lately.” He spoke looking down, face serious with a small furl of his eyebrows like he was thinking of something troubling. “Couldn’t sleep. So I thought I’d run to clear my head!”</p>\n<p>Katsuki wanted to ask if his dreams had to do with the power he inherited from All Might  or the trauma from past battles and losses, but he was really bad at comforting people and he didn’t want to snap at the nerd if he got flustered for not knowing what to say so he simply hummed in understanding. “Yeah.. me too.”</p>\n<p>They both stood there in silence for a minute, but not an uncomfortable one. Finally, Katsuki knelt down to do some quick stretches of his own before hopping up and stepping off the grass onto the track. He looked over to Deku with a challenging smirk. “Well nerd, are you coming!?”</p>\n<p>A smile sprouted on Izuku’s face, eyes shining and then narrowing slightly in determination “Mhm!” He nodded, then met Katsuki on the track. They took off at an easy pace, side by side, feet thumping on the dirt road.</p>\n<p>As they made their way further down the trail the two boys started picking up speed. Katsuki a little ahead of Izuku before Izuku sped up ahead of Katsuki. They went like that back and forth a couple blocks till they were both in a full out sprint. Their chests were heaving and their breath puffed out in white clouds from the cold but neither of them were anything but warm.</p>\n<p>From the corner of Katsuki’s eye, he saw a light orange glow and he turned his head to see green electricity dancing across the nerd's body. Izuku advanced a few yards ahead of him in seconds. “Are you seriously using your fucking quirk Deku!? This is not a fucking race!!!” he puffed.</p>\n<p>The nerd chuckled breathily and turned around to look at him, jogging backward “Who said it was a race Bakugou?”  he asked innocently, a challenge hidden in his oh so friendly smile. He turned back around and took off full speed.</p>\n<p>A vein bulged on Katsuki’s forehead from the name but he couldn’t help the grin on his face as he watched the nerd get smaller and smaller. His head lowered and eyebrows tilted, grin turning vicious and competitive. <em> Oh, it was fucking ON. </em></p>\n<p>He shot his arms behind him (Naruto style) and released explosions as his sprint turned into a half skip half run. The explosions launching him yards at a time. He caught up with Izuku in a matter of seconds. “EAT MY DUST YOU FUCKING NERD.” He shot himself ahead with a particularly strong explosion.</p>\n<p>“Not if you eat mine first!” He sprinted past Katsuki with lightning speed and turned his head to side eye him, Deku stuck out his tongue tauntingly then snapped his head back forward charging off. <em> When did he become such a little shit? </em></p>\n<p>They raced back and forth again, one advancing the other every hundred yards or so. Both reaching unnatural speeds. When the duo reached a particularly steep decline down a hill they reverted back to normal, quirkless, sprinting.</p>\n<p>The once silent, peaceful night, was interrupted by heavy pants, harsh curses, and taunting laughs. As the miles went by the boys gradually slowed their strides till they were at a normal jogging pace. They began pushing and trying to trip each other laughing and taunting each other lightly. “You’re so fucking slow *huff* you’re slower than Dunce Face’s brain after 1000000 Volts!”</p>\n<p>“Well.. *pant* you’re so slow *hah* that Mineta could run faster even with his little diaper pants around his ankles!”</p>\n<p>“HA! WELL *pant* YOU RUN LIKE MY FUCKING MOM”</p>\n<p>“I’VE SEEN YOUR MOM RUN! THAT’S A COMPLIMENT”</p>\n<p>“Haha! Fuck off!” Katsuki yelled with a grin. He pushed Deku in the bushes on the side of the track. But before he hit the ground he grabbed Katsuki’s wrist and tugged hard, dragging him down with him. They rolled through the bushes, tumbling into an open grass area surrounded by trees, the moon their only source of light.</p>\n<p>They wrestled around pushing and shoving one another, even throwing handfuls of grass in each other’s faces, and cackling like the dumb teenage boys they were. Now Izuku was straddling him and trying to pin his hands to the floor. Katsuki brought his knees up and firmly planted his feet to the ground, he then used all the strength in his lower half to push himself up and over, flipping them and startling Deku so Katsuki could slam their interlaced hands to the floor on either side of the nerds head.</p>\n<p>Izuku looked up in surprise eyes wide, puffing out tired breaths. Katsuki was panting as well his smile smug and looking down at Deku with victorious eyes. They stayed like that for a minute or two just panting and catching their breaths. And then Deku puffed out a laugh his smile bright, face flushed and shiny, his hair was splayed out all over the place and littered with blades of grass. There was dirt smudged on his nose and he was fucking beautiful. Katsuki didn’t even think that word was in his vocabulary, but that was all he could think about to describe this giggling dork lying beneath him.</p>\n<p>“Haha! Kacchan I-”</p>\n<p>Everything stilled. Katsuki couldn’t explain the feeling that overtook him at the sound of that name. It was like his heart exploded but in a good way. It was like every paperweight placed in his chest from the past three weeks of not hearing his childhood nickname were suddenly lifted and he could breathe freely again.</p>\n<p>Izuku sputtered, “I-I-I mean B-Bakug-”</p>\n<p>“NO.” Katsuki fell to his forearms with a loud thud staring Izuku down, eyes panicked. A million emotions were flooding through him at once, most of them confusing and scary but also happy and pleasant and he really just couldn’t handle this being ruined by hearing that name.</p>\n<p>Izuku flushed deeper at the close proximity. “Wh-wh-what?”</p>\n<p>“STOP calling me that. I can’t fucking stand it!”</p>\n<p>“C-calling you wh-what? I-I don’t understand”</p>\n<p>“BAKUGOU.” Katsuki shouted. “I hate hearing it out of your stupid mouth! Ev-every time you say it,” he clenched his fist in the grass, “my chest hurts and I feel like I can’t breathe.” His voice was cracking and he hated how vulnerable he sounded but he didn’t care anymore. “Just. Just go back to calling me that kiddie ass nickname.” he felt his ears burning and he avoided Izuku’s eyes.</p>\n<p>When he finally chanced a look at Izuku when he didn’t hear a response he saw green eyes wide with realization then suddenly tears trickled down his cheeks. <em> Shit. </em> “Deku. Why are you crying?” Was it cause he yelled at him? Fuck he’s such an idiot. He placed his hands on Izuku’s cheeks trying to wipe away the tears with his thumbs but the nerd kept shaking his head. “Deku! Fuck! I didn’t mean to-”</p>\n<p>“Th-th-that’s why you’ve been so u-upset lately!?” he croaked. “Cause of m-me? Cause I stopped calling you K-kacchan!?” Snot was dribbling out of his nose and his bottom lip was quivering. “Why didn’t you t-t-tell me?”</p>\n<p>“I just told you right now! Please stop crying.” Katsuki didn’t know what to do and he hated himself for making the nerd so upset.</p>\n<p>“A-all th-this time you’ve been h-hurting! And it’s m-my fault! Kacchan I’m so sorry!” he sobbed apologizing over and over. Katsuki pressed closer to wrap his arms around Izuku in a hug, keeping most of his weight off with his legs.</p>\n<p>“Stop! Don’t be! It’s not your fault! How would you know? I was too fucking prideful to say anything!” He tightened his hold slightly and pressed his forehead to Deku’s shoulder not knowing how else to calm him down. “So please just stop crying!”</p>\n<p>Izuku sniffled, trying to calm down, his chin hooked over Katsuki’s shoulder and clutching onto the arms wrapped around him. Soon the blubbering turned to small hiccups and they stayed like that for a couple of minutes. “I didn’t like calling you Bakugou either,” Deku said quietly. “It felt weird. Unnatural.”</p>\n<p>Katsuki lifted up, back on his forearms to look at him, releasing their embrace but Izuku still had a loose hold on his upper arms. “Then why did you?”</p>\n<p>“I-I don’t know.” Izuku looked down, his eyes puffy and red from crying. “I thought you hated that I called you Kacchan and Uraraka-san and Kirishima-kun suggested if I call you something more mature you’d-”</p>\n<p>“Wait, wait, wait, WHAT.”</p>\n<p>“I-I said I thought you hated when I called you-”</p>\n<p>“No. After that! WHO the fuck told you to call me that?”</p>\n<p>“Uh. Uraraka-san and Kirishima-kun?”</p>\n<p>It suddenly clicked. That shit eating grin Shitty-Hair had when he first heard Izuku call him Bakugou and the fact that he knew it bothered Katsuki right off the bat, the way Round-face smiled like she knew something he didn’t. <em> Those fuckers set me up. </em> “I’m gonna kill them.” his voice was low and dangerous.</p>\n<p>“H-hey! Don’t get mad at them! They were just trying to help!” Izuku said, unaware that their friends were conniving little shits. “I mean, the name is kind of baby-ish! I’m sure it might get embarrassing for you when we’re both heroes! Maybe I can call you umm.. <em> Katsuki </em> ?” Both boys froze, faces immediately flooding with color. All thoughts of murdering Shitty-Hair and Round-Face completely forgotten. That definitely wasn’t intended to come out as <em> intimate </em> as it sounded.</p>\n<p>Katsuki suddenly became hyper-aware of how close they were and his eyes unconsciously zeroed in on Izuku’s flushed pink lips. “A-a-ah m-maybe I-I should just stick to K-kacchan! It’s what I’ve always called you and we’re both used to it! I-I’m sure it won’t matter when we go pro-” Before Katsuki even knew what he was doing he pressed his lips to the corner of Izuku’s mouth.</p>\n<p>Once again, everything stilled and as Katsuki started to become conscious of what the fuck he just did, his face burned with the power of a hundred suns. He leaped off of Deku and started crawling backward away from him. Izuku was still frozen in shock, face impossibly red and Katsuki knew he was even worse. <em> FuckFuckFUckFuCk </em>“FUCK!”</p>\n<p>At his outburst, Deku snapped out of his trance and immediately went scrambling trying to follow Katsuki on his hands and knees. “W-wait! K-kacchan!!”</p>\n<p>“GET AWAY FROM ME DEKU!” He scooted pathetically away as Izuku tried getting closer. Katsuki was burning from the bottom of his neck to the tips of his ears and he wanted to DIE. <em> Why the fuck did I do that!!! </em></p>\n<p>“Kacchan!! Wait! P-please!” When Izuku finally crawled close enough he grabbed his foot to keep him from scooting away any farther. Katsuki desperately tried to yank his foot away but the fucker activated his quirk. Katsuki closed his eyes too mortified to look Izuku in his tomato red face.</p>\n<p>He sensed Deku get closer, knees settled in between Katsuki’s sprawled out legs. Then he felt soft lips mush against his own. Katsuki’s eyes snapped open, unmoving. All he could see was Izuku’s scrunched closed eyes and his scarlet blush. When the nerd started to move away from his lack of response Katsuki grabbed the curls at the nape of Deku’s neck and pulled him back in to crush their mouths together again. His eyes fluttered shut at the pleasant feeling that washed over him and Izuku sighed contently against his lips.</p>\n<p>The kiss was slow and sweet. Their mouths moved clumsily against each other from their inexperience but it was perfect, it felt perfect, and Deku was perfect. The nerd was practically sitting in his lap now, arms wrapped around his neck and Katsuki’s hands resting on his hips, thumbs tracing circles on the heated skin under his shirt.</p>\n<p>They finally parted for breath and Katsuki lightly pressed his forehead against the other’s. He felt a warm pleasant tingle surround him from the kiss. Izuku’s eyes were half-lidded and his face was still flushed (though considerably less than it was before). Katsuki saw tears welling up and threatening to spill down Deku’s cheeks. “Why are you crying again nerd?” his usually raspy voice came out softer then he’d ever heard it.</p>\n<p>He cupped Izuku’s cheeks wiping away the tears before they fell. “They’re good tears I swear!” The nerd smiled “I’m just really happy Kacchan!”</p>\n<p>Katsuki dropped his head to rest on Izuku’s shoulder and hugged him closer. God, it felt nice to hear his nickname again. “Again,” Katsuki mumbled, cheeks burning up again at the request.</p>\n<p>“Huh?”</p>\n<p>“Say it again.” He buried his face in the crook of Deku’s neck, “Call me Kacchan again.”</p>\n<p>Katsuki felt arms wrap around his neck. “Kacchan” his voice was soft and sweet and it was heaven to his ears.</p>\n<p>“Again.”</p>\n<p>‘Kacchan”  </p>\n<p>Katsuki kissed the spot where his neck and shoulder met and Izuku’s breath hitched. “Again”</p>\n<p>“Kacchan”</p>\n<p>“Again” He kissed the corner of Deku’s jaw.</p>\n<p>“How many times are you gonna ask me to say it!” he giggled softly at the feather-like kisses.</p>\n<p>“As many times as it takes to make up for the three weeks I went without hearing it.”</p>\n<p>“Kacchan, Kacchan, Kacchan!” Izuku tightened his hold when Katsuki flipped them over so he was lying on his back again with Katsuki hovering over him. “Kacchan..” Izuku said quietly, voice thick with emotion. “I really like you.”</p>\n<p>Katsuki felt like his heart was going to burst at the words. <em> Of course. </em> That’s what this was, that’s what this feeling was that made him blush and caused his heart to ache and why he had a burning desire to be around him all the time. He dipped his head down and their lips met again, movements gaining confidence the second time around. The kiss was more passionate and laced with emotion. Just when Katsuki chanced brushing his tongue against Deku’s bottom lip he was suddenly ripped away.</p>\n<p>White cloth bound his legs together and his arms to his sides he jerked his head over to see Deku in a similar predicament. The nerd’s body looked like a mummy but his head was uncovered and looking up behind Katsuki, eyes wide with fear and all the color drained from his face.  “You little shit’s BETTER not be fighting again.” a deep, gravelly voice rumbled menacingly.</p>\n<p><em> Oh fuck. </em> Katsuki slowly turned his head to see a very tired, very angry looking Aizawa. His hair was tied in lazy low bun much like that night months ago and his face was scrunched up in a dangerous glower. The moon cast an ominous shadow over his features and the bags over his eyes were darker than usual. “Because I’m not in a particularly merciful mood and All Might isn’t here to save you this time.”</p>\n<p>\n<em> Fuck. </em>\n</p>\n<p><br>\n<br>\n</p>\n<p>After convincing Aizawa that they were in fact not fighting, but simply horsing around and explaining why they went for a run in the middle of the night (Both boys silently agreed to leave out the whole ‘making out in the grass’ part. <em> Thank God it was too dark for Aizawa to see what they where doing </em>), he let them off with just a few days of detention for leaving the dorms after hours.</p>\n<p>Katsuki and Izuku walked through the Heights Alliance doors around 4:45 AM, tired and ready for bed after these very eventful, very emotional, last couple of hours. Thankfully tomorrow was Saturday so they could make up for this very late night by sleeping in.</p>\n<p>They walked silently through the lounge room to the elevators, not really having said anything to each other since before Aizawa caught them. Deku was fidgeting next to him, probably trying to find something to say.  </p>\n<p>Izuku walked into the elevator followed by Katsuki, still not saying a word. Once the elevator doors closed Katsuki turned around and stalked towards Izuku, face impassive. The nerd backed up freckled cheeks growing red as his back hit the elevator walls with Katsuki pressed close. He then sunk his fingers into dark green curls and kissed the nerd gently, hoping to convey all the feelings he had for Deku with the press of his lips. Katsuki pulled away and rested his forehead against the other, firey red eyes burning with emotion, “I like you too, <em> Izuku </em>.”</p>\n<p>Deku’s face went beet red.</p>\n<p> </p>\n<p><br>\n<br>\n“OI KIRISHIMA!!!!!” A thunderous growl echoed through the halls.</p>\n<p>Kirishima turned his head towards the noise, a wide smile on his face at hearing his grumpy best friend's call, “Heyy!! Baku-bro-” His grin faltered, a sweatdrop forming on his brow when he saw Bakugou. <em> Oh boy. </em></p>\n<p>Bakugou wasn’t that much taller than Kirishima but it seemed like the former was towering over him with a deathly glare on his face and he swore he could see the depths of hell in the red of his eyes. Over his shoulder was Ochako hanging pathetically and looking at Kirishima with mournful expression and tears rolling down her cheeks, “I’m sorry Kirishima-kun, we’ve been discovered.” she said weakly.</p>\n<p>“Haha. I would love to stay and chat Baku-Bro. But I just remembered this really important thing so I’m just going to..” He booked it out of the hallways as fast as he could.</p>\n<p>“YOU DARE FUCKING RUN FROM ME SHITTY-HAIR?” He heard an explosion not too far behind him. <em> ShitShitShitShit. </em></p>\n<p>“RUN KIRISHIMA-KUN! RUN FOR YOUR LIFE!!!”</p>\n<p> </p>\n<p> </p>\n<p>A few minutes later after a lot of pointless running and explosions, Kirishima was cornered in the back of the gym, Ochako shoved on the floor next to him. She tried to make herself float away but Bakugou firmly pushed her down by the shoulder. “Oh no you fucking don’t”</p>\n<p>Kirishima was already hardened preparing for an onslaught of punches and explosions. <em> Is he really going to hit Uraraka? Bakugou! How unmanly! </em></p>\n<p>Bakugou was knelt down staring at them, eyes narrowed dangerously and lip curled with rage. “You motherfuckers…” he started voice rough and gravelly. Kirishima prepared to shield Uraraka. Then suddenly Bakugou’s shoulders slumped and his face softened. <em> HUH? </em> He looked to the side and the faintest hint of a blush on his cheeks. “Thank you,” he grumbled so quietly the two almost didn’t hear it.</p>\n<p>“Wh-what?” Uraraka looked up from where she was covering her head, confusion was written on her face.</p>\n<p>“I’m not gonna FUCKING REPEAT MYSELF.” He then shot up and stalked away hands shoved in his pockets.</p>\n<p>Kirishima and Uraraka looked at each other. <em> Did Bakugou Katsuki just BLUSH and say THANK YOU? </em></p>"
}