{
  "id": "16599113",
  "url": "https://archiveofourown.org/works/16599113?view_full_work=true",
  "author": [
    "slippin_into_darkness",
    "SpiritsFlame"
  ],
  "title": "Satisfaction Brought It Back",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen",
    "M/M"
  ],
  "fandoms": [
    "DCU (Comics)"
  ],
  "relationships": [
    "Clark Kent & Bruce Wayne",
    "Clark Kent/Bruce Wayne"
  ],
  "characters": [
    "Clark Kent",
    "Bruce Wayne"
  ],
  "additional_tags": [
    "transformation fic",
    "in which no one is as stupid as they may appear"
  ],
  "language": "English",
  "series": "",
  "published": "2018-11-12",
  "completed": null,
  "words": "18,231",
  "chapters": "1/1",
  "comments": "308",
  "kudos": "10,096",
  "bookmarks": "2,236",
  "hits": "61,245",
  "summary": "<p>Bruce always thought that Superman's cute shtick of rescuing cats from trees was a bid for publicity—until a confrontation with a magic user leaves him stuck as a cat. He learns how mistaken he was when Superman not only rescues him, but takes him back to a small Metropolis apartment. The opportunity to learn more about the alien can't be ignored, but is Bruce ready for everything he will learn about someone he has only ever regarded with distrust and dislike?</p>",
  "notes": "",
  "text": "<p>Bruce had always assumed that Superman’s bit about rescuing cat from trees was just that—a bit. A publicity stunt. He’d seen the photos, of Superman carefully plucking a kitten from top branches and handing it to some girl with pigtails. It was all so cute and All-American that Bruce always wanted to vomit.</p>\n<p>It was just like Superman himself, all flash, no substance.</p>\n<p>And Bruce believed that wholeheartedly. Right up until Superman floated up next to him, not a camera in sight.</p>\n<p>“Hey, puss.” His voice is softer than Bruce hears on television, or on the few disastrous occasions that they’ve spoken in person.</p>\n<p>It was pure sadism that had led the magic user Bruce had been facing to leave him in a tree.</p>\n<p>\n<em> “The path you’re on will lead to tragedy,” she said, and her eyes had been sad. “Not only for you but for the entire world. We can’t afford to lose Hope, not this early.” Bruce had been trying to apprehend her without hurting her, because so far she hadn’t hurt anyone too badly. “This is a gift, though I doubt you’ll see it that way.” </em>\n</p>\n<p>\n<em> And she had snapped her fingers. </em>\n</p>\n<p>Superman reaches out to Bruce, who instinctively hisses and swipes at him, claws extended.</p>\n<p>He’s expecting Superman to evade, but he doesn’t anticipate the way Superman looks at him afterwards; amused, affectionate. “Careful. That won’t hurt me any, and you’ll damage your claws.”</p>\n<p>He reaches out with both hands this time, scooping Bruce gently in his broad palms. “How did you get up here?”</p>\n<p>\n<em> Bruce had yowled, furious. When the fog had cleared from his vision after her snap, he’d been horrified to find himself looking up at her. </em>\n</p>\n<p>\n<em> “It’s alright, kitty,” she had said. “I’ll make sure you stay safe.” And he’d been in this fucking tree. As a cat. </em>\n</p>\n<p>Superman runs a gentle finger under his chin, around his neck, ignoring as Bruce tries to bite him. “No collar. Do you have anywhere to go?”</p>\n<p>What a moron. Talking to a cat like it could understand him.</p>\n<p>Unless. Was animal speech some Kryptonian power? He had thought the idiot had revealed all his powers in that first interview with Lane, but he might have been smart enough to hold something back.</p>\n<p>‘I’m under a spell,’ he tries to say, and it comes out as a strangled meow.</p>\n<p>Superman only smiles down at him. “I don’t hear anyone looking for you, but,” he glances up, “it does look like rain.”</p>\n<p>‘I’M BATMAN,’ Bruce tries to shout. Nothing. Fantastic.</p>\n<p>“It’s too late for the shelters too,” Superman continues. “But I think I know somewhere I can take you.”</p>\n<p>He tucks Bruce close to his chest. “Please don’t move too much. I won’t drop you, but you might get hurt.” He’s not wrong. Even held as carefully as this, he can feel the strength in those arms, the power. He may as well throw himself at a brick wall, for all the good it would do him.</p>\n<p>He pushes the thought away, focusing on the constant murmur of Superman’s voice, letting the frustration build. Even Dick had stopped talking to animals when he was 10. God, he was stuck with the biggest idiot on the planet.</p>\n<p>And the idiot was taking him even further away. Further away from Gotham, from his home. Further away from the sorceress who had done this to him.</p>\n<p> </p>\n<p>\n<img src=\"https://66.media.tumblr.com/7ba1e0386b5b6c60961f53b6c5aade14/tumblr_pi1wlmZpNv1wsxpr5o1_1280.jpg\" alt width=\"850\" height=\"843\">\n</p>\n<p>  </p>\n<p> </p>\n<p>Bruce hadn’t been able to see much beyond the leaves of his tree when he was stuck, but when Superman floats easily into the air, it’s not the Gotham skyline he sees. It’s Metropolis. The witch had dropped him in Metropolis.</p>\n<p>Superman is flying more slowly than is his usual wont, his arms bracketed around Bruce, preventing him from moving. Bruce will give him this much at least, he is in control of his own strength. Bruce has seen him bend steel like paper mache, has seen him pulverize brick walls with a single punch. But his grip on Bruce is just tight enough to keep him in place, without hurting him in anyway.</p>\n<p>To his further surprise, Superman floats gently to a stop outside of an apartment window, not too far from where Bruce had been left. He taps the glass gently, adjusting his grip to keep Bruce secure.</p>\n<p>A woman answers his knock after just a minute. Despite the hour, it’s clear she’s only recently awake, with hair pulled back into a sloppy bun, eyes and nose red and raw looking. She’s wearing a too-big sweatshirt over pair of Metropolis University sweatpants, and when she sees Superman in her window, she flinches back.</p>\n<p>Bruce automatically bristles at the reaction, the instinctive fear. Most of Metropolis was ready to throw themselves down at his feet, and this was a place Superman knew on site. The theories building in his mind aren’t pleasant; reinforcing the worst of fears.</p>\n<p>Then she opens the window, color building in her cheeks. “Oh my god, Kal. Tonight, of all nights?” Her voice is hoarse and rough.</p>\n<p>Superman’s perfect face creases into a frown. “Is everything alright?”</p>\n<p>She covers her face with both hands. “Yeah. I’m just—Superman is seeing me in my sick clothes. Please just kill me now.” She follows this up with a wracking cough, and the look she sends Superman is mortified when it subsides.</p>\n<p>“It’s nothing to be embarrassed by,” Superman says. “I have seen sick humans before.”</p>\n<p>“Oh my gooood,” she moans. “Tell me what you need so I can lie down and hide forever, please?”</p>\n<p>“I’m very sorry to bother you, Alys, if I had known you were sick,” he trails off.</p>\n<p>“I’m just surprised you couldn’t hear me coughing from all the way across the city.”</p>\n<p>“I would never!” His indignation sounds genuine, perfectly pitched to create the illusion that he respects privacy, respects boundaries. As if he isn’t an Orwellian nightmare, Big Brother embodied in a single man.  </p>\n<p>Alys buys is, leaning against the window frame and smiling out at Superman. “I’m joking. What can I do you for?”</p>\n<p>Superman shifts, revealing Bruce in his arms. Alys’ eyes light up.</p>\n<p>“Oh, he’s so sweet!” She reaches out to pet him, and Bruce hisses at her. He can’t swipe at her, contained as he is, but he refuses to be called sweet.</p>\n<p>“I don’t think he is, actually,” Superman says sardonically. Alys laughs, but the sound quickly turns into a hacking cough.</p>\n<p>“I’d take him if I could, Kal, but,” she gestures weakly. “This is the first time I’ve even been awake today.” She gives him a concerned look. “Do you have somewhere else to take him?”</p>\n<p>I might,” Superman says hesitantly.</p>\n<p>“It better not be your place again. I’ve said before, I don’t think arctic fortresses are built to hold earth animals.”</p>\n<p>Bruce has to close his eyes. He still can’t believe how easily Superman had revealed the location of his home, and to hear civilians reference it so casually actually pains him. It’s to Bruce’s advantage, Superman’s abilities and weaknesses and home base all laid at his feet, and yet—</p>\n<p>Superman chuckles. “No, don’t worry. I have another idea.”</p>\n<p>Alys gives him a weak smile. “I’ll take the next one, don’t worry.”</p>\n<p>“Just focus on feeling better.”</p>\n<p>“Well, if Superman says so, I gotta,” Alys gives him a sarcastic salute. Superman rolls his eyes, a surprisingly casual move from a man who Bruce has always seen as dour and unapproachable.</p>\n<p>“Have a good night, Alys,” Superman says, and he drifts higher into the air as Alys returns to the sentiment.</p>\n<p>Higher up, out of Alys’ ranger, Superman sighs. “Alright, I guess we’re doing this.”</p>\n<p>He sets off again, faster than last time, tucking Bruce in his cape to protect him from the windchill. Bruce hates it. When he feels them land and Superman drops his the fabric, Bruce has no idea where they are. They’ve landed on a shadowed roof, dark enough that even Superman’s bright colors are hidden. Superman still looks around suspiciously before he pushes open the roof door and slips inside.</p>\n<p>Bruce feels baffled, confused. Is Superman breaking into someone’s apartment?</p>\n<p>When they get to the door that must lead to the rest of the building, Superman’s gaze sharpens before he pushes it open. Then he takes a deep breath and the world blurs around Bruce. The next thing he knows, he’s in a small apartment, shabby but comfortable. It looks lived in, well-used. What the hell is Superman doing in a place like this?</p>\n<p>“Sorry about that,” Superman says, setting Bruce gently down on the floor. “I usually change first, but I didn’t want to set you down outside.”</p>\n<p>The second Bruce’s paws touch the grown, he runs. There is no visible exit, but he darts across the apartment and ducks under the couch. It’s utterly hideous, but it suffices as a hiding place. Not that such a thing matters to a man with X-ray vision and super strength, but it makes Bruce feel just a bit more comfortable.</p>\n<p>“And that would be why,” Superman says, sounding amused.</p>\n<p>Bruce moves enough that he can see out from under the couch, prepared to pull back if he needs to. But Superman isn’t even looking at him, is already moving to the fridge. He pulls out a gallon of milk, drinks directly from the jug, like a savage, and puts it back.</p>\n<p>Bruce only feels more confused. What the hell is Superman doing here. Then Superman looks down at himself and wrinkles his nose. “Try not to destroy my apartment,” he says over his shoulder, moving down the hall into another room that Bruce can’t see.</p>\n<p>His apartment?</p>\n<p>Then Superman comes out of the other room and Bruce’s mind reels. Superman is almost unrecognizable. His hair is down from his Superman style, curls falling loose around his face. He’s changed into a pair of sweats and a loose Met U shirt, a pair of glasses perched on his nose. He can’t possibly need them. He looks normal. He looks <em> human </em>.</p>\n<p>Bruce can’t stop staring at Superman’s bare feet, deceptively vulnerable looking on the wood floors. He watches them cross the apartment, watches them stop in the kitchen.</p>\n<p>“I’m pretty sure I still have some cat food,” Superman mutters to himself. It seem absurd to call this man, with his sweats and his bare feet, Superman. What had the woman called him? Kal? He remembers Superman saying that was in name in that absurd interview. Still, in this moment, it feels more natural than Superman.</p>\n<p>Kal stretches up to the highest cabinet, and pulls out a half-full bag of cat food with a small noise of triumph. He pours it into a bowl and sets it down on the kitchen floor. “You’ll have to come out to get it,” he says, filling another bowl with water. “It’s been awhile since I’ve had to take a cat home. Alys usually helps out with that.”</p>\n<p>He ruffles his hair as he looks over at where Bruce is still crouched under the couch. “I’ll take you to a shelter tomorrow,” he says. Bruce hisses at him.</p>\n<p>Kal rolls his eyes, unimpressed. “Now, human food,” he mutters under his breath. He opens the fridge again, peering inside before he lets out a long breath. “Looks like takeout again.”</p>\n<p>Bruce watches incredulously as Superman, <em> Superman </em>, speed dials a Chinese restaurant and orders with comfortable familiarity. What is happening? Is Superman pretending to be a human? The idea is laughably absurd. A man who can destroy mountains, who can fly through the air, ordering Chinese food.</p>\n<p>Order placed, Kal reaches for a laptop that’s plugged in at the table and crosses to the couch.</p>\n<p>Bruce darts away from him, moving across the room and ducking behind a bookshelf.</p>\n<p>Kal doesn’t even react, just sits down at the couch and opens his laptop. Then he just sits there, typing away. He only stops when the door rings. When the door opens, Bruce debates trying to get out. But Kal is blocking the door, and Bruce can hear another voice in the hall.</p>\n<p>“Clark, man, you have got to try something else. I am literally begging you.”</p>\n<p>“I like the Lo Mein,” Kal, Clark?, says.</p>\n<p>The other man, what must be the delivery, says “I know you do, that has been made abundantly clear, but please. Get like, Sweet and Sour Chicken next time. Get fried rice. Try something new, I am begging you.”</p>\n<p>“I’ll think about it,” Kal says as he pays.</p>\n<p>The other man groans. “You liar. You are the most boring man on the planet!”</p>\n<p>“Goodbye, Kevin.”</p>\n<p>“Yeah, yeah,” Kevin mutters, and Kal closes the door behind him.</p>\n<p>Bruce’s mind is whirring. So Superman pretends to be human. Is this something new? According to his interview with Lane, he had only arrived on Earth a few years ago, had he set up this identity in that time? Had it been set up by the government? What purpose does it serve? Is it just to gain information on humanity, to better impersonate them? What is his game?</p>\n<p>Kal—Bruce refuses to call him by his fake name that the delivery man had used—takes his food to the couch and snaps open the chopsticks. He eats like that, cross-legged on the couch with his laptop open in front of him. There is something surreal about watching him eat, dangling noodles into his mouth. He eats like a teenager, like Dick does on the rare occasion that they order in.</p>\n<p>Just as Bruce is starting to wonder if his mind had somehow played a trick on him, that Superman had left the apartment and this other man had just come out of the bedroom at the same time, Kal’s head jerks up. He still has noodles in his mouth, he looks ridiculous.</p>\n<p>Then he blurs, and in just a moment, Superman is standing in the living room. He tosses the glasses down onto the couch, opens the window and is gone.</p>\n<p>Bruce concentrates, but he can’t hear anything. Slowly, carefully, he pads out from behind the bookshelf. Upon closer inspection, the apartment is just as ratty as he had thought. The apartment has two other rooms, a small bedroom that barely fits the full-sized bed and dresser, and a bathroom. The bed is rumpled but the room itself is fairly clean.</p>\n<p>There is a mirrored sliding closet door, and Bruce gets his first good look at his new form. He looks like any other black cat on the street, a bit bigger than an average stray but nothing unusual. He’ll need to figure out how to contact the Manor. He’s never not come home from patrol, Dick and Alfred will both be worrying.</p>\n<p>Using both his front paws, he is able to get the sliding door to the closet open. He’s surprised by what he sees. Inside the closest is a long row of terrible suits. And Bruce doesn’t mean that in the way he refers to all off-the rack suits. These are genuinely awful. Some of them are just the wrong shade of gray. Some of them have elbow patches. Some of them just have absurd cuts, with too-wide lapels or an extra few inches at the bottom. They are all, to Bruce’s experienced eye, too large even for a man of Kal’s girth.</p>\n<p>Is it that an alien can’t judge human apparel? Has Kal studied humans, using exclusively films from the 80s?</p>\n<p>He slides the closet door closed again and begins to prowl through the apartment. His initial investigation is done, now he needs to find a phone. He can’t talk, but he can still use morse code. Alfred and Dick both know it, will be able to at least know that he’s okay, even if he can’t explain the full situation.</p>\n<p>But if Kal has a landline, he can’t find it. There is a cell phone still on the counter from when he had ordered food, but it’s locked and Bruce can’t get it open as he is now.</p>\n<p>Bruce crosses then to the laptop. It has gone to sleep, but he taps at the trackpad with his paw and it wakes up. This, too, is locked. The login screen just says Clark. It makes sense, he supposes: alias or not, Superman wouldn’t be stupid enough to have his login as Superman.</p>\n<p>He hears a rustle from the bedroom, the sound of a window closing. From the couch, he can see the hall as Kal crosses from the bedroom, in the process of stripping off the Superman costume. He has soot on his face and hands. Then he disappears into the bathroom and Bruce hears the shower start up.</p>\n<p>When Kal emerges, he’s back in his sweatpants and he looks tired. He wouldn’t have thought that Superman got tired.</p>\n<p>Kal drops down onto the couch, but doesn’t reach for his laptop this time. He just lies there, one arm draped over his eyes, breathing quietly for a few minutes.</p>\n<p>Then he drops his arm, letting it fall down, until his fingers hang just above the floor, at eye level. Bruce contemplates biting him, but it would undoubtedly hurt Bruce more than Kal.</p>\n<p>He hisses again, and Kal seems to remember that he is even there for the first time. He leans over to peer, upside down, under the couch. “Hey, puss,” he says, soft. He stretches out his hand, more deliberately. Bruce ignores him. After a moment, Kal pulls back.  </p>\n<p>Then he sighs, and pulls his laptop to him again. This time, he seems less focused. Under the couch as he is, Bruce can’t see him, but the typing is less determined, less continuous. He keeps stopping and starting.</p>\n<p>After what feels like an hour of this—and Bruce’s inner clock is well-honed—Kal sighs again, and his arm crosses into Bruce’s field of vision as he sets his laptop down, closed this time, on the coffee table. Then he stands and stretches, and heads into the bathroom. Bruce can hear him brush his teeth, going through a standard pre-bed routine. But surely he doesn’t intend to—  </p>\n<p>And then he crosses into the bedroom, the light goes out, and Bruce hears the distinctive sound of someone dropping onto a mattress. Does he even need to sleep? If he doesn’t why go through the charade? He must require sleep then, and that alone is enough to make this entire miserable experience worth it.</p>\n<p>If he requires sleep, he can get tired. If he can get tired, he can be outlasted, defeated.</p>\n<p>After another hour, curiosity gets the better of him, and Bruce pads into the bedroom. Kal is very clearly asleep, stretched out on the bed like a starfish, in just his boxers and the t-shirt he had been wearing earlier. He doesn’t look anything other than human.</p>\n<p>Bruce lays down in the hallway, not wanting to take his eyes off of him.</p>\n<p>In the soft noises of the city outside, in the moments between Kal’s deep breaths, he falls asleep.</p>\n<p> </p>\n<p> </p>\n<p>Bruce wakes up as he always does; all at once. It takes him less than a moment to remember the previous day, to place the unfamiliar location. There is an alarm going off somewhere else in the apartment, that had been what woke him up.</p>\n<p>Superman, Kal, is sitting up in bed, knuckling sleep out of his eyes. Bruce is a genius, arguably one of the smartest men on the planet, and he can hardly conceive that this is the man who had caught a plane in his arms, who could shoot lasers from his eyes. Who could kill people in the millions in less than a minute, if he was ever inclined to do so.</p>\n<p>Then Kal sighs and pushes himself upright. This time, Bruce doesn’t run, doesn’t move out of the way. Regardless of his suspicions—his fears—he doesn’t truly think that Kal is the kind of being who would kill an animal just for the sake of it. He doubts he is in any danger as he is now. Were he to be discovered, however, is another matter.</p>\n<p>If it weren’t for the fact that even being here means leaving Gotham unguarded, with just Alfred and a fifteen year old boy to keep an eye on things, Bruce would view this as invaluable reconnaissance. Which means he may as well learn anything he can.</p>\n<p>Kal passes him in the hall, bending to give him a quick scratch that Bruce dodges. He does take a swipe at Kal’s hand though, but Kal avoids him just as easily.</p>\n<p>He watches as Kal goes through the all motions of humanity, brushing his teeth, combing his hair. He uses gel and slicks his hair close to his head, which looks ridiculous. However, if his goal is to look less like Superman, Bruce has to admit that it works. The crowning piece of the performance is watching Kal put on one of the the over-sized suits, which make him look smaller in comparison. As soon as the suit jacket slides over those broad shoulder, he hunches in. The glasses hide his face, his striking cheekbones, his blue eyes.</p>\n<p>The overall effect is impressive. If Bruce didn’t know that this was Superman, hadn’t seen the change with his own eye, he would have a hard time picking this man out of a crowd.</p>\n<p>He isn’t sure who could have set this up for Kal, whether it was the government, or Lois Lane, or simply through his own ingenuity, but Bruce has to admit that Superman is smarter than Bruce had given him credit for.</p>\n<p>What the disguise does not do, Occam's razor does the rest. Who would ever believe that this is Superman, walking about with a bad haircut and an ill-fitting suit.</p>\n<p>“Off to work,” Kal says, presumably to Bruce. “I’ll find a home for you soon, don’t worry.”</p>\n<p>Bruce doesn’t plan to be here when he gets back.</p>\n<p> </p>\n<p> </p>\n<p>After Kal leaves, taking his laptop with him, Bruce decides to do more research into the apartment before he breaks out. At the very least, he wants to figure out who is footing the bill. If someone has Superman in their pocket, Bruce needs to know about it. If Superman has someone in his pocket, Bruce needs to know that even more.</p>\n<p>It’s possible that this Clark persona functions for Superman as Matches Malone functions for Bruce. Or perhaps one of his less criminal names. Bruce has more than his share of safe houses under fake names, aliases he slips in and out of to get different pieces of information.  He hadn’t thought that was Superman’s style, but he won’t rule it out.</p>\n<p>In this body, he finds he can jump higher than he would have thought, proportional to his adjusted height. Getting onto the counter isn’t even difficult, and he is able to find a pile of bills and other mail. The first one is addressed simply to ‘Current Resident’, but he nudges the stack until a name becomes clear.</p>\n<p>Clark Kent.</p>\n<p>The name rings a bell, which is surprising in and of itself. Bruce prides himself on being well informed, but he doesn’t know the name of every man and woman on the streets, especially outside of Gotham. If he’s heard the name before, that means Clark Kent is someone. A criminal, or someone in the public eye, neither of which fit with this fake persona Superman has set up.</p>\n<p>He also can’t remember where he’s heard the name before, which is infuriating.</p>\n<p>All he can do is investigate further, then work on his plan to escape.</p>\n<p>As a whole, the apartment is jarrringly human. It’s small, and homey, and there isn’t quite enough space, none of which fits into the image he has of Superman. The couch is too small for a grown man to stretch out on, hardly more than a loveseat, and the bookshelves are packed with books and tchotchkes.  </p>\n<p>Bruce has to climb onto the shelves to get a closer look, an undignified maneuver that bears little resemblance to his experiences in climbing buildings and scaling mountains.</p>\n<p>There are souvenirs from all over the country—all over the world. But then, it would be easy for Superman to travel. A ten minute trip to Japan, to Australia. It shouldn’t surprise him.</p>\n<p>Briefly, the absurd image of Superman flying across the Atlantic with a snow globe held carefully in both hands crosses his mind. Ridiculous.</p>\n<p>Even stranger, the souvenirs are all cheap tourist nonsense. Snow globes or postcards or silver spoons. The kind found in a hotel gift store or even a convenience store. Why pick them up? Why keep them?</p>\n<p>The climb higher feels precarious, not enough room on the packed shelves for his feline form. He doesn’t care. He’s the goddamn Batman. He can manage a set of cheap shelves in a Metropolis apartment. At the higher shelves, his determination pays off.</p>\n<p>There, at a man’s eye level, a few carefully framed photos.</p>\n<p>An elderly couple, arms around each other, smiling in front of a picturesque farmhouse. A modern American Gothic. If this is part of a pretense, an all-American alias, Superman couldn’t have done better. A stock photo, perhaps?</p>\n<p>Another photo of the same couple, standing with what appears to be a recent graduate—high school or college isn’t clear. The graduate is laughing, waving away the camera. Their face is turned away, making the angle of the cap obscure the face, but Bruce can see dark curls, a strong jawline, a pair of heavy frames.</p>\n<p>It could easily pass for a young Superman—a young Clark Kent. Perhaps not a stock photo—a staged photo then? The kid is clearly younger than Superman, but with all the world to choose from, it wouldn’t be too difficult to find a look-alike. There are at least three Bruce Wayne look-alikes, one of whom makes regular appearances on SNL.</p>\n<p>The jump back to the floor is easier.</p>\n<p>There is nothing meaningful in the rest of the apartment, nothing he hasn’t already seen. A small TV sits facing the couch, a stack of books piled high in front of it. The coffee table is just barely kept organized, a small pile of National Geographic taking up a corner, a stack of Daily Planet copies in the other. Bruce glances at the top one, a Lois Lane byline covering a recent fire in an apartment complex and Superman’s efforts in putting it out. Bruce wants to scoff at the aggrandizing nature of keeping articles like this in the apartment.</p>\n<p>But what Bruce can’t get past is the why. Why this pretense? Surely if Superman was going to play at human, he could live in more luxury than this? Even without tipping a hand to his identity, a man with his abilities could do anything, surely? Could crush coal into diamonds, could slip into any bank in the country, could pull lost riches from the ocean floor.</p>\n<p>One thing is made clear. Superman is smarter, sneakier than Bruce had given him credit for. This apartment holds up to scrutiny, even with the knowledge Bruce has. It’s as well put together, as well forged as any of Bruce’s safehouses.</p>\n<p>It’s dangerous.</p>\n<p>He curls up on the couch, tucking his paws—how utterly absurd—under him as he thinks. He needs to get back to Gotham, to his home and his patrols and his ward. But this is an unparalleled opportunity to observe Superman, to see who he is when he thinks no one is looking.</p>\n<p>He confronted the sorceress on a Thursday. Today is Friday. Kal has left wearing a suit, carrying a briefcase. Assuming that he is feigning at a job, he will likely spend his evening or weekend hours here, in between heroics</p>\n<p>Bruce can trust Alfred and Dick with Gotham for another night. He has to. The risk that Superman poses is greater than anything he has ever faced in Gotham. He can’t waste this opportunity.</p>\n<p>One thing that Bruce had failed to consider is the functional limits of this body. Cats sleep a lot. A lot. He finds himself drifting off if he stays still for too long, the only cure being more movement. He takes pleasure in racing around the apartment, knocking things over.</p>\n<p>When Superman does get home, he enters through the front door, still in his ill-fitting suit. Bruce understands aliases and disguises, but he doesn’t understand this one. Why would a god walk among men, play at being one of them.</p>\n<p>Zeus had walked among mortals, and had used the opportunity to mete out judgment, to take women and punish men. He had not used it to order Chinese food and wear bad suits.</p>\n<p>This time, Superman, Kal, has brought food with him. Not Chinese food, but clearly more takeout. He eats like a child, like a teenager left off the leash for a weekend.</p>\n<p>His eyes light immediately on Bruce, who had curled up on the couch after a nap had caught him by surprise.</p>\n<p>“Hey there,” he says, and even knowing it’s Bruce’s transformation, it’s a bit disconcerting. No one has ever been so pleased to see him. Then his eyes travel over the rest of the apartment, and Bruce feels himself tense. There is a certain mindlessness to being a cat. A certain number of behavioral impulses that even Bruce feels hard-pressed to suppress. It had made sense, at the time, to run about the apartment knocking things over, a certain satisfaction in it.</p>\n<p>But now, under Kal’s cool gaze, he thinks about the consequences. He does not truly think that Kal is the kind of person to hurt an animal, but there are things anyone might do in anger. At the very least, he could be thrown from the apartment, could lose the advantage of this position.</p>\n<p>Then Kal huffs out a breath, and his mouth twitches into a smile. “I don’t know what I expected.”</p>\n<p>He sets down the food and moves through the apartment, righting the lamp that had fallen, putting things back on shelves. Bruce hadn’t even noticed that he’d knocked off one of the photos—this form is dangerous, more than he’d realized—until he sees Kal linger over it.</p>\n<p>Looking at the position of the other photos on the shelf, the blank space this one left, Bruce can tell it’s the one of the elderly couple, the picture-perfect American couple. The way that Kal’s fingers linger on the pane, the careful way he sets it down, it’s not the way one would treat a stock photo.</p>\n<p>This family, that couple, they mean something to him. Bruce resolves to learn who they are. Another reason not to leave.</p>\n<p>“No harm done,” Kal says, and Bruce thinks he picks up just the hint of an accent—something midwestern and slow. Then Kal turns back to him, and his face is open, amused. “I knew you were a troublemaker.”</p>\n<p>That is the least of what Bruce has been called. He stretches. Kal huffs a laugh as he crosses back to the counter, pulling out the food he’d brought.</p>\n<p>“You didn’t eat anything,” he says reprovingly. Bruce sniffs. He’s not planning to eat cat food anytime soon.</p>\n<p>Kal rolls his eyes. “Alright then.”</p>\n<p>This time, he eats his meal standing at the counter, apparently unmoved by Bruce’s unwavering, unblinking stare. “You’re an odd cat,” Kal says when he’s done. He crosses over to Bruce and makes a move like he might pet him. Bruce hisses, recoiling on the couch.</p>\n<p>Kal stills his hand, and rocks back on his heels. “That’s alright,” he says, “I’m a bit odd myself.”</p>\n<p>Bruce doesn’t try to hide his snort of derision. ‘Odd’ is putting it mildly.</p>\n<p>He watches as Kal crosses back across the apartment, moving into the bedroom. “I’m heading out!” Kal calls, and Bruce can only assume it’s directed at him. He’s not sure how he feels about it. Talking to animals is absurd, foolish, but it’s a very human kind of absurd and foolish. Not anything he would have expected from Superman.</p>\n<p>He jumps off the couch, getting a view of the bedroom just in time to see the familiar red boots disappear through the window. It seems like a sloppy mistake to make, to so often leave from this apartment.</p>\n<p>Bruce crosses to window and realizes that he has underestimated Superman again. This apartment is nestled in a dark corner, almost an alcove. There are no windows that look into this room, and in the evening gloom, the shadows more than obscure it from the street.</p>\n<p>He has already seen Kal use the roof as well, which must be his exit and entrance when the light is not so forgiving. Unlike Batman, Superman is not only a creature of the night, he combats threats during all hours.</p>\n<p>What kind of job must this alias of his hold, if indeed it is a job, that allows him the time to be Superman?</p>\n<p>Another prowl of the apartment yields no new clues. This time Bruce is careful not to knock anything over, not to disturb the apartment. Bruce himself comes back from patrol high with adrenaline, the thrum of violence echoing through his veins. He doesn’t want to discover that the same is true of Superman.</p>\n<p>This time, hours and hours pass before Kal returns, long enough that Bruce drifts off to sleep again. When Kal sees Bruce, lying on the bed this time—the best vantage point of the window—he just goes “Huh,” and draws the curtain closed.</p>\n<p>He strips off the Superman costume with the unselfconscious air of someone alone in his own apartment, no reason to think that he should be embarrassed. It feels like an intrusion.</p>\n<p>Kal is wearing plaid boxers under the Superman suit, so incongruous that Bruce doesn’t realize that he’s staring. A god, a perfect specimen standing in front of him, the image of physical perfection, undercut by plaid boxers.</p>\n<p>The way that Kal then pulls on a worn-soft sweatshirt and loose pajama pants is not the way a man might pull on a disguise, but the tired actions of any man getting ready for an evening in.</p>\n<p>Bruce follows as Kal pads, barefoot again, into the living room, watching as he spends another two hours typing away on his laptop. Bruce tries to angle himself to see what he is writing, but a proper view would require him to get close, closer than he is willing to get. All he can see is that it’s clearly text document, all the typing towards one thing. A manifesto?</p>\n<p>Hacking is nearly impossible with paws, but if he stays here long enough, he is sure that he will have the opportunity to read it. Something written like this—the furrow in that strong brow, the way he stops and sighs, the way he deletes sentences and rewrites them—something written with this level of passion would be an invaluable insight.</p>\n<p>It’s past three am when Kal folds up the computer and heads to bed. Bruce stays in the living room, listening to the sounds of someone getting ready for sleep.</p>\n<p> </p>\n<p> </p>\n<p>Bruce, and he suspects Kal, is woken up by an insistent banging on the door.</p>\n<p>“Rise and shine, Kent!” someone, a woman, calls. Even from his spot on the couch, Bruce can hear he groan that Kal lets out in response.</p>\n<p>The woman bangs on the door again. The clock on the microwave gives the time as 7:30.</p>\n<p>Kal all but stumbles to the door, his hair a mess of bedhead. He’s down to his flannel pajama pants and no shirt. It’s a good look on him. He yanks open the door, and Bruce is surprised to note that, despite the frustration in the movement, it still only opens the door. A move like that from Superman could take the door off its hinges, could crumple the handle, could pull the very wall down. Half-asleep as he clearly is, surely it would be harder not to ruin the door.</p>\n<p>What does that say about his control?</p>\n<p>Kal barely has the door open before the woman is shouldering past him, and Superman turns into it to accommodate her, when she could so easily bounce off his broad chest.</p>\n<p>“Don’t think you can distract me with your shirtlessness,” she says. “We have places to be, names to take.”</p>\n<p>“That’s not the expression, Lo,” Kal says, looking tired and amused as he closes the door and leans against it.</p>\n<p>“You’ve expressed your objection to kicking ass, so I’m yielding to your delicate sensibilities.”</p>\n<p>“I’m going to go get dressed,” Kal says, not rising to her baiting.</p>\n<p>“If you have to,” she says with a pointed once-over of his bare chest. The view of Superman spluttering, going red under her gaze is a fascinating one. A charming one.</p>\n<p>“Lois, c’mon,” Kal says.</p>\n<p>Lois waves him off. “Yeah, yeah, do your thing. I’m making coffee.”</p>\n<p>She is clearly familiar with the apartment, with Kal. She rustles casually through his cabinets and sets a pot of coffee on with easy familiarity.</p>\n<p>When she turns to the couch, Bruce gets his first real look at her. This face he knows. Lois Lane, Daily Planet’s star reporter. Breaker of the Superman story. Infamously the only woman on the planet with a direct line to the Man of Steel. More direct than anyone had realized.</p>\n<p>And with that realization comes another, as Bruce finally places the name Clark Kent. He’s read the name before, a byline in the Daily Planet, sometimes shared with Lane but increasingly getting more and more meaningful stories of his own.</p>\n<p>Bruce had read a story of his about corruption in the mayor’s office that had taken the front page, pushing even Lane’s byline below the fold. Bruce can remember being impressed at the level of research, the attention to detail. He remembers that Kent had a tendency towards idealism in his articles.</p>\n<p>Superman moonlights as a Daily Planet reporter. One who waxes poetic about justice and truth in his articles. One who genuinely writes well and writes often, who must take the job seriously to land front page by-lines and be so often partnered with Lois Lane.</p>\n<p>But why? Why bother? As far as jobs go, a reporter is a good one to keep informed, to be able to run off as needed, but it’s also a risky one. He has surrounded himself with people who do research into Superman on a daily basis, who are known for their investigative abilities. The only worse job he could take would be a police officer.</p>\n<p>Which raises the question, does Lane know that her coworker is Superman?</p>\n<p>“Did you get a cat?” Lane calls to Kal, still in the bedroom.</p>\n<p>“Sort of. Don’t pet him, he’s trouble.”</p>\n<p>Lane, who had been moving towards him, rocks back. “So, not your usual style.”</p>\n<p>Kal emerges from the bedroom, slicking his hair back. “Haha.”</p>\n<p>“Don’t forget,” Lane mimes pushing a pair of glasses up her nose. Well then.</p>\n<p>“I wasn’t going to,” Kal says mildly, ducking into the bathroom. “Coffee’s done.”</p>\n<p>“Your hearing will never fail to impress and alarm me,” Lois says, moving to the kitchen and pouring two cups. Bruce a surge of—irritation? Amusement?—when he sees that one of the mugs has a Superman logo on it.</p>\n<p>“That one was my nose, actually,” Kal calls back. When he comes back he is fully Clark Kent, shoulders hunched in his suit, bright eyes obscured by glasses, dark curls tamed close to his head.</p>\n<p>“We’re just going to chase a few leads, you can loosen up a bit, Smallville.” She moves like she wants to tousle his hair loose, and he ducks under her hands. Bruce can feel his ears prick at the clue, dropped so casually. Is Smallville part of the cover?</p>\n<p>Kal makes a clear face at the Superman mug, and very pointedly takes the other.</p>\n<p>“One of us has to look like a professional,” Kal says.</p>\n<p>Lane is wearing a loose blouse tucked into a pair of jeans. “Screw you,” she says amicably. “You look like a door to door salesman.”</p>\n<p>Kal pushes his glasses up his nose, and the move is so pointed that Lane snorts.</p>\n<p>Lane turns her attention back to Bruce as Kal proceeds to doctor the coffee past the point of recognizability. “Where did you get this one?”</p>\n<p>“Up a tree.”</p>\n<p>“You’re a goddamn bleeding heart, Kent.” She rounds on Bruce, “And you are a cliche. Have some dignity.”</p>\n<p>Bruce hisses at her.</p>\n<p>“Like I said, trouble.”</p>\n<p>“Why not the shelter? Or your friend?”</p>\n<p>“Alys has the flu, and all the shelters are full, I checked last night. I didn’t want to risk just dropping him off.”</p>\n<p>Lane shakes her head, “Jesus. You’re giving me cavities.”</p>\n<p>“You said you had a new lead?”</p>\n<p>Lane leans back on the counter, watching as Kal tips another spoonful of sugar into his cup. “I think it’s dead, Smallville. You’ve killed it.”</p>\n<p>Kal takes a pointed sip of his coffee and lets out an even more pointed sigh of pleasure. Lane rolls her eyes. Something about this, this casual playfulness, this strikes at Bruce more than the apartment itself, more than the ill-fitting suits and the heavy glasses. He doesn’t know what to make of it, what to do with it.</p>\n<p>They lean against the counter together, finishing their coffee as Lane explains a tip that she’d gotten from a source, something that could give more info on a story that the two of them are apparently working together.</p>\n<p>“How’s your O’Hara story going?” Lois asks as they’re wrapping up.</p>\n<p>Kal gives her a look over his mug, amused, skeptical. “I’m not falling for that.”</p>\n<p>Lane holds up one hand, an unarmed gesture. “Just a question!”</p>\n<p>“How is your story on the docks going?” Kal asks.</p>\n<p>Lane huffs into her coffee. “Yeah, yeah. Point taken.” She set her mug down. “And how is the,” she makes a gesture over her head, like bunny ears, “going.”</p>\n<p>Kal grimaces. “It’s not.”</p>\n<p>She taps a fist on his arm. “You’ll get there.”</p>\n<p>Kal makes a doubtful noise in his throat as he takes her cup, and his own, and puts them both in the sink. “I’m going to break that mug one day.”</p>\n<p>“You do, and I’ll buy you three more. A veritable hydra of Superman merch.”</p>\n<p>Kal laughs, and Bruce is struck again by how normal the sound is, how human.</p>\n<p>He watches as Kal ushers Lane out of the apartment, two coworkers, two friends, off to work at their job. Nothing supernatural, nothing menacing about it. If it’s all a performance for Lane’s benefit, it’s a good one. But why bother? If Lane knows that he is Superman, as she clearly does, why play at being human for her?</p>\n<p>He curls up on the couch and thinks, and thinks.</p>\n<p> </p>\n<p> </p>\n<p>He’s asleep on the couch when Superman pushes open the door to the apartment.</p>\n<p>“—have to get a few more sources. I’ll probably do that this week.” Kal has his phone between his shoulder and his ear as he closes the door and sets his briefcase down. His suit is even more rumpled than it was when he left in the morning. A side-effect of changing into Superman during the day?</p>\n<p>Bruce wonders who he’s talking to. Is he speaking as Superman or the alias? He suspects the latter. His voice is lighter, less confident than the sure tone he adopts when in costume.</p>\n<p>“I have a few leads, but nothing concrete yet. Do you need me to come by?” He listens to the response from the other end of the line.</p>\n<p>Bruce watches, refusing to move from the spot he’s claimed, as Kal goes moves around the kitchen, setting up a pot of water on the stove, leaning back against the fridge as he talks. Something the other person says makes him laugh.</p>\n<p>“Well, I wouldn’t say no,” he says. Bruce finds his eyes drawn to the line of his throat, the gleam of his teeth. “I always miss your cooking.” Another pause. “Me? Uhhhh. I’m having a salad for dinner.” This is a lie. Bruce can clearly see him mixing up a fluorescent orange bowl of mac and cheese.</p>\n<p>“No, Ma!” Kal protests, laughing again. The word rocks through Bruce. Ma. He doesn’t know what it means, can’t understand it. Superman had said in an interview that he was the only one of his people here. Was it a lie? Is there a whole race of super-powered beings throughout the world? A sleeper-cell, ready to take Earth by storm?</p>\n<p>Kal is still talking, his phone back between his shoulder and ear as he carries the bowl to the couch. Bruce is too startled to move off the couch. He does, however, make a reflexive swipe at Kal’s hand when he reaches out to scratch Bruce’s ears.</p>\n<p>Kal makes a face at him. Then, to the phone, “No, Ma, it’s fine. It’s not like I need to—” the person—his mother?—on the other end must cut him off. Whatever she’s saying has the overtones of a lecture, from the cadence that Bruce can now catch, and the long-suffering look on Kal’s face.</p>\n<p>“Maybe nothing can live up to your cooking,” Kal suggests, with the same tone that Dick uses when trying to wheedle something out of Alfred. The look on his face says that is lands just as well. “Would you believe pasta-salad?” A beat. “Yes.” Another pause. “Yes, Ma.”</p>\n<p>Then his face sobers. Bruce tries to move closer as subtly as possible, hoping to get a better ear on the conversation.</p>\n<p>“No, I’ve been—it’s been fine. No, Ma. No, things are,” he swallows, throat tightening, “they’re fine.” For the first time, Bruce feels as though he is intruding on something private, intimate. “I’m fine.”</p>\n<p>Kal tips his head back against the back of the couch. He looks, for a moment, so tired. So human.</p>\n<p>“It’s been… better. I think people are really starting to trust me. That—they think I can help.” Bruce can practically feel his fur go on end. Superman is all but admitting that he wants their trust—that he needs it for some purpose.</p>\n<p>Kal closes his eyes. Whatever the speaker is saying seems to smooth him, lines of tension relaxing around his mouth, his eyes. “I know.” Beat. “I know. I’m,” another swallow. “I’m trying.”</p>\n<p>Bruce has moved close enough that he can hear the words now, hear a woman’s voice say “That’s all they can ask of you,”</p>\n<p>Superman’s laugh, when it comes out, is a tired as his expression. “I don’t think it is.” There is a moment of silence, echoing on both ends of the line. Then, like a confession. “I don’t want to just try, Ma. I want to do it right. I want to be perfect.”</p>\n<p>There is another long pause. Then the woman says, “You’re not a god, Clark.”</p>\n<p>It means something, that she calls him Clark. Bruce doesn’t know what. He doesn’t have enough information, and it is infuriating. He has all the puzzle pieces in front of him, and he can’t manage to sort them into a comprehensive picture.</p>\n<p>“I know. I don’t want—I don’t want anyone to think I am. I just want to help.”</p>\n<p>“Then help.”</p>\n<p>Kal takes a deep breath, then another. “Yeah. Yeah. Thanks Ma.”</p>\n<p>“Anytime, baby.”</p>\n<p>Kal’s eyes catch on Bruce when he sits up. “Do you need another mouser, by chance?”</p>\n<p>It breaks whatever mood had settled over the phone line. “No. And I swear, if you bring me another cat, you will regret it. These city cats you bring me, they can’t catch a mouse to save a life. They sit outside by the door all day, crying until I bring the food to them.”</p>\n<p>Kal laughs, and it’s lighter again, not heavy with something Bruce knows all too well.</p>\n<p>“Alright, alright. I’ll find a home for him.”</p>\n<p>“Come by next weekend, once your article is done.”</p>\n<p>“Yes, Ma.”</p>\n<p>There is one last, final pause. Then “I love you, baby.”</p>\n<p>Kal ducks his head. “Love you too, Ma.”</p>\n<p>The woman on the other end of the phone, who talks like a mother and sounds so very human, hangs up.</p>\n<p>Kal settles back into the couch, and takes a bite of his congealed mac and cheese. It’s gone cold. Bruce wants to laugh at the face he makes, disgusted and juvenile. He doesn’t know how to feel about that.</p>\n<p>He doesn’t know how to feel about any of this.</p>\n<p> </p>\n<p> </p>\n<p>Once Kal is done with his abominable dinner, he picks up his laptop again. His work, whatever he is writing, is steady this time.</p>\n<p>“What sounds better, do you think?” he asks about a half an hour in. Bruce, lying under the coffee table, just looks at him. “’The lack of proper building materials in the Riverside housing complex contributed to the building collapse, an act of criminal neglect on the part of Bron Management’, or ‘In an act of criminal negligence, Bron Management used subpar building material in the Riverside housing complex, which ultimately led to the building’s collapse.’”</p>\n<p>He’s working on an article, Bruce realizes. He has been all week. Not a manifesto or a call to arms. He remembers hearing about the Riverside housing complex, which had collapsed just a few days before Bruce had confronted the sorceress. It was only thanks to Superman that no one had died. Is this just his way to praise Superman, a self-aggrandising effort to make himself look good, call attention to Superman’s good deeds?</p>\n<p>“Lois called dibs on the Superman saves people angle,” Kal says, and there is something sardonic in the angle of his mouth, “but Bron Management needs to be held accountable. I could see—” he lets out a sigh, pushing his hair back. “It’s easy to know things,” he says, only partly to Bruce. “It’s proving them that’s hard.”</p>\n<p>Bruce wonders what it was he did see. While he was pulling families, children, out of a crumbling building. Was it faults in the wood, was it something in the makeup of the steel? Something that caught his attention even as he saved lives. Something that Superman could do nothing about. Something that Clark Kent might be able to fix.</p>\n<p>Maybe that’s the point of all of this. Not a spy, not infiltration. Just a different way to accomplish his goals.</p>\n<p>But what those goals were, Bruce still couldn’t be sure. The idea that he really did just wanted to help, as he’d said on the phone, was absurd. He could shatter mountains, could pull the earth out of orbit. Why would someone with that kind of power worry about the concerns of ants.</p>\n<p>Kal works on his article for another twenty minutes before something catches his attention, something beyond human hearing and concern. Whatever he hears, it’s urgent, no sardonic ‘got to go,’ like he’s said before. There is hardly a pause between him hearing whatever it was, and his leaving the apartment, the window closing behind him.</p>\n<p>And the laptop, still open on the coffee table.</p>\n<p>It’s hard to navigate the keys with his paws, but it’s not impossible. Bruce has managed keyboards and trackpads with most of his fingers broken before, this is nothing.</p>\n<p>He reads over the document that Kal was working on, and it’s exactly as it appears. Once again, Bruce is struck by the idealism, the call for justice. It rings through the entire article. Is it possible that Superman is just like this?</p>\n<p>Next, Bruce opens up an incognito window and looks up the news in Gotham. Nothing serious has happened, and Bruce breathes a sigh of relief. He trusts Alfred, trusts Dick, but neither of them are Batman.</p>\n<p>From there, Bruce snoops. There is a folder of Planet articles that he skims, each one as well written, well researched and idealistic as the last. If Bruce had ever met Clark as a reporter, without the knowledge of who he was, Bruce would have found him insufferable.</p>\n<p>‘Or irresistible,’ a voice inside him says, reminding him of his past experiences with intelligent idealists. The voice sounds infuriatingly like Alfred.</p>\n<p>There is something that strikes him, as he reads these articles. When looked at together, when one looks under the sheer optimism in them, there is a sardonic note to them, a thread of wit and humor that Bruce is coming to associate with a particular quirk to Kal’s lips.</p>\n<p>He closes out of that folder, opens up the pictures.</p>\n<p>Unlike the photos in the apartment, there is no reason to stage these, no reason to curate them for an audience. The elderly couple features prominently, moving around what is clearly a farm. Kal appears as well, most often alongside them, but occasionally by himself. And it is clearly Kal, no look-alike.</p>\n<p>He’s careful, there is no sign of his powers, but there is something about him, in the way that he carries himself, that is impossible to mistake.</p>\n<p>And he is also, unmistakably, younger in the photos. As he gets older, the man from the photos disappears, leaving just Kal and the woman. Is this the woman from the phone, whom Kal had called Ma with no pause or hesitation?</p>\n<p>Bruce had taken it at face value, when the Lane article said he came here as an adult, escaping the wreckage of a dying world. But who knew what his culture considered an adult? And who knew how much of that had been real. These pictures, they tell the story of someone who has lived on earth for at least ten years. Has lived with a family.</p>\n<p>Bruce closes out of everything he opened and leaves the computer where it is, settling back onto the couch. For every question he gets an answer for, the more questions he has.</p>\n<p>He can feel Gotham calling, feels the need for it in his bones. But there is too much at stake here, too much still unanswered. He can’t leave yet.</p>\n<p> </p>\n<p> </p>\n<p>Bruce doesn’t know what time Kal gets home, but Kal is there when Bruce wakes up the next morning. This time, there is no reporter to wake Kal up, but he is still up early. Up with the sun, one might say. He staggers around, half-awake for a few minutes before he shakes it off. Bruce is getting the horrifying impression that Superman is a morning person.</p>\n<p>This time, when he gets dressed, he doesn’t go full Clark Kent. Instead, he just pulls on a pair of jeans and a plaid shirt, frames pushed up his nose but hair loose around his face as he heads out. Bruce has resigned himself to another day of an empty apartment when Kal returns, a bag held in one hand.</p>\n<p>“I got bagels for myself,” Kal says, presumably to Bruce, “and for you, lox!” He pulls out a small box of smoked salmon with an air of triumph, and Bruce’s stomach rumbles despite itself. He knows that Kal hears it, too.</p>\n<p>Kal sets the lox on the floor for Bruce, and watched expectantly. Bruce looks back, tail twitching. Kal rolls his eyes extravagantly, and looks away. “Jesus, you’re a drama queen aren’t you?”</p>\n<p>Bruce wishes, dearly wishes, that he had hands, just to flip him off. He settles on ignoring him, digging into the salmon. It’s good; rich and flavorful. And, best of all, not cat food.</p>\n<p>Kal eats his own bagel, liberally coated in cream cheese, at the counter beside him, carefully not looking at Bruce.</p>\n<p>When he’s done, Bruce watches as he paces around the apartment, muttering to himself. Bruce has seen him do this, once or twice, but never gotten close enough to hear what he’s saying.</p>\n<p>Today, he leans into the cat side of his thinking, lets himself get close, to twine around Kal’s feet, close enough now to hear what he is saying.</p>\n<p>It’s not in English, whatever it is, nor in any of the other languages Bruce knows. Which is more than a few.</p>\n<p>After a few minutes, he is able to discern a pattern in the muttering. A single word, than two or three variants on the same word. He’s conjugating. Bruce has studied enough languages to know the pattern of someone else doing the same.</p>\n<p>And suddenly, he’s sure, with the intuition he has honed over his entire life, that this is Kryptonian. Kal is practicing his Kryptonian.</p>\n<p>Which means, which has to mean, that he doesn’t already know it.</p>\n<p>Bruce has had his suspicions, since the phone call last night, or perhaps since hearing Lane say ‘Smallville’ so casually, that Kal didn’t come to Earth as adult as he’d implied.</p>\n<p>But to not even know the language of his own people. How young was he when he got here? Young enough to be taken in by a human family. Young enough to be raised as a human, with a human name. With human parents. Does Kal think of himself as human?</p>\n<p>Bruce thinks that he might.</p>\n<p>Though Kal’s face is creased with concentration and there is no sign of distress in his face or voice, it strikes Bruce as terribly sad, to study a language you should have been raised with. He had lost his own parents so young, but he had known them, had spoken with them. He doesn’t think that Kal can say the same.</p>\n<p> </p>\n<p> </p>\n<p>Kal doesn’t sleep much. Sometimes he gets home late, coming through the window as Superman. Sometimes he returns from work as Clark Kent, then leaves from the apartment. Sometimes, he makes all appearances of settling in, only to jerk his head up at some alert only he can hear.</p>\n<p>Bruce unearths the remote from under the couch, keeps an eye on the news. He watches Superman help tsunami victims, and come back with mud on his boots. He sees him fight monsters, and return without a scratch. He watches all the reports with the single minded focus he devotes to everything, but has never had the time to fully dedicate to Superman.</p>\n<p>He watches reports of a construction worker saved from a fall, of bank robbers apprehended, of fires put out and ships saved and kittens rescued, and he can’t even blame himself for not thinking that Superman might have a civilian persona. He doesn’t know how Kal has the time to do all that he does and hold a job.</p>\n<p>And yet. And yet, he spends his evenings, and some of his days, saving people. Then he comes home and eats crappy food and pulls out his laptop and does work for the Daily Planet and practices his Kryptonian and calls the woman he calls Ma faithfully. Not every night, but often enough to be notable. He brushes his teeth like a human, washes his face like a human, goes to bed like a human.</p>\n<p>Then he wakes up after one, maybe two hours of sleep, and does it again.</p>\n<p>On Tuesday, it’s one of the good nights, when Kal is back before sunrise and could get what a human might call a good night’s sleep. Bruce has taken to sleeping just under the bed, to keep an eye on his comings and goings without getting in the way or being stepped on.</p>\n<p>It’s the middle of the night when Bruce is jolted awake, and for a split second the rattling of the bed makes him think of an earthquake. Then reality sets in, the solidness of the floor beneath him, the inexplicable sudden chill in the room. The noises from the bed.</p>\n<p>There is no mistaking them; noises of fear, of terror. The bed shakes again, and Bruce gets out from under it.</p>\n<p>Kal’s face is twisted in fear, and every exhale leaves a pale cloud in the air, dropping the temperature in the room another few degrees. When he thrashes, the whole bed shakes. Bruce is suddenly, terribly aware that this is the most out of control he has ever seen Superman.</p>\n<p>And yet.</p>\n<p>And yet, there is no anger in his face, only pain and despair. There is nothing alien in that face, nothing that Bruce hasn’t seen in his own face, on the faces of people he’s saved. On the face of his ward, on the nights that Dick had crawled into his bed, shaking from nightmares.</p>\n<p>No one who lives the lives they lead—lives of never being fast enough, of fighting the odds with every life they save—escapes unscathed. Nightmares are part of the deal, if you care. And Clark cares. Bruce has seen it, can read it in every word of his articles, in every late night, every time his head jerks up at something only he can hear. Bruce can see it now, in the fearful twist of his face.</p>\n<p>What does Superman fear?</p>\n<p>Bruce thinks he knows, now.</p>\n<p>With that in mind, it’s an easy choice. It’s easy to bury the fear of Superman’s strength, or his other myriad of abilities and focus instead on Clark.</p>\n<p>Bruce has woken from his own nightmares often enough to know not to startle him, but it’s easy enough to get onto the bed, to press his paws to Clark’s shoulder, settling his weight onto him. He leans into the cat side of his thinking, lets himself knead at Clark’s shoulder, stiff with tension, until the thrashing slows. From there, he climbs carefully onto Clark’s chest, curling up in the broad center of him. The room is still cold, and the warmth of Clark’s body is not unpleasant.</p>\n<p>Clark has gone still, though his face is still tense. Bruce follows some instinct he doesn’t recognize and lets himself settle into Clark’s warmth, focusing on the feel of his chest rising and falling until a low purr begins to fill the room.</p>\n<p>Slowly, the room gets warmer, the tension melts from Clark’s frame. If Clark fully wakes up, Bruce isn’t aware of it.</p>\n<p> </p>\n<p> </p>\n<p>It’s the sun that wakes Bruce up next. Clark, he has learned, likes to sleep with his curtains cracked, so that the morning sun falls on him. It’s disgusting.</p>\n<p>Bruce is still curled up on Clark’s chest, and it takes an effort of will not to recoil. Being a cat is bad—terrible—but there is something about the sheer vulnerability, the implied affection, of sleeping on—with—on someone like this that makes it worse.</p>\n<p>But Clark’s face is still, his chest rising and falling evenly, and Bruce finds that he doesn’t want to disturb him. Instead, Bruce fights the purr that wants to escape him, and watches the beam of sunlight move up Clark’s body until it hits him in the face.</p>\n<p>Clark wrinkles his nose, scrunches his whole face, and comes awake. He seems startled to find Bruce on his chest, and he raises one hand tentatively to pet him, scratching gently behind his ears then dragging his hand down Bruce’s spine. Bruce allows this for a few long strokes, until he feels the purr burst from his own chest, unbidden.</p>\n<p>He immediately stands, dislodging Clark’s hand, and hops off of the bed. Clark doesn’t give any indication of remembering his nightmare; no traces of it linger on his face or body.</p>\n<p>Bruce watches him from the couch as he gets ready, brushing his teeth, slicking his hair back, putting on the ill-fitting suit and bulky glasses. When he leaves, no one would ever guess he’d had the kind of nightmares that could shake the building now. No one would ever think he was hiding anything.</p>\n<p> </p>\n<p> </p>\n<p>Clark hands in his article on Thursday, a full week after he took Bruce into his apartment. Bruce doesn’t know what his deadlines are like, but he suspects Clark takes them seriously.</p>\n<p>“They’re letting me choose more of my own assignments lately, if I can find something worth writing about. I’m usually pretty good at it.”</p>\n<p>Bruce just bets he is. The two of them are sitting on the couch, Bruce sitting beside Clark, absently letting himself get pet.</p>\n<p>Clark has a tendency to talk aloud, especially when Bruce is within petting distance. Bruce can find no reason not to encourage this. He’s debating to Bruce the merits of two different topics when Bruce sees the familiar quick tilt of Clark’s head.</p>\n<p>This time, it’s not urgent, no rush to leave. Instead, he looks puzzled. Thoughtful.</p>\n<p>Bruce pushes his paw into Clark’s stomach, slowly, so that he doesn’t just bounce right off.</p>\n<p>“It’s…someone unexpected,” Clark says slowly. “Somewhere I’m not supposed to go.” Whatever he heard, he is still hearing it, because the lines around his mouth tighten. “It could be a trap.”</p>\n<p>‘Then don’t go,’ Bruce wants to say. He digs his claws into Clark’s thigh. Clark hisses, but Bruce knows better than to think he’s hurt him. He’s seen Clark make the same sound after touching the hot stove, a learned reaction to anything that might hurt a human.</p>\n<p>“I think, it sounds genuine.” Clark edges Bruce off his lap, and Bruce wants to curse at him. This stupid idiot. If even he thinks it’s a trap, then it probably is. But he’s going to go anyway.</p>\n<p>When the window clicks shut, Bruce curls up in the middle of Clark’s bed to wait for him. He’s not worried about Clark, of course. If Clark gets hurt, disappears, no one will feed him. He’ll have to figure out how to walk from Metropolis to Gotham as a cat.</p>\n<p>When Clark does return, he’s not hurt, not even ruffled. Instead, his face is creased in thought, his jaw clenched tight. He only barely pauses to change into his pajamas before he moves to the couch.</p>\n<p>“It wasn’t a trap,” he says, but there is tension in his voice. Bruce follows him out, jumping up to lay near Clark’s feet. Clark is more likely to talk to him if he’s within reach. That’s all it is. “A…” Clark pauses, “an ally has gone missing. If you can even call him that.” He laughs. “I’d like to call him that.</p>\n<p>“I didn’t even realize he had such a big team. A sidekick, someone with him on the tech. People who notice when he goes missing. People who are worried, <em> personally </em>worried.” He’s talking about Batman, Bruce realizes. Someone, Dick, probably, had called him, had told him.</p>\n<p>Bruce is momentarily so furious that he can’t breathe, can hardly think. He takes a moment to rein himself in. Clark won’t understand this level of anger from a cat. It’s not Clark’s fault. It’s not even Dick’s fault, not really. He’s just a kid, and Bruce has been missing for a week. A week with no word, no check in. The real surprise is that it took a week for Dick to reach out.</p>\n<p>When Bruce gets himself under control, he realizes that Clark is still talking.</p>\n<p>“…always saying that he works alone, and this whole time—when I would give anything for—” He cuts himself off, putting his head in his hands, before Bruce can hear what he would give anything for. “I’m being selfish,” he says. Bruce has heard him say it before, like a condemnation. Often about things, normal, human things that are not selfish at all.</p>\n<p>Clark views any instance of wanting things for himself as unforgivable, and Bruce hurts every time he hears it. Bruce butts his head against Clark’s hand, feels Clark absently move to pet him.</p>\n<p>“It doesn’t matter,” Clark says. “He’s in trouble, missing. The kid, he wouldn’t tell me how long it’s been, but I highly doubt that anyone on that team would try to contact me unless it had been a week or longer.” He lets out a breath. “That stubborn asshole.”</p>\n<p>Bruce is startled to hear Clark speak like that, even more to hear it applied to himself. Not that he disagrees.</p>\n<p>“I’ve been trying for months to get him to listen, to agree that we could be a good team, and then shit like this happens. I don’t even know how to help. But there’s a kid out there, who loves him and I can’t not help. He, God, he’ll be furious if I get involved. But…” Clark swallows. “I never thought of him as someone who was loved.”</p>\n<p>Bruce’s heart clenches. He knows that Alfred cares, that Dick cares. But to hear it laid out like this, by what should be an objective observer. For Dick to reach out to Superman, when he knows how much Bruce would hate it. But it’s been a week, and Bruce has thought of Gotham, but he hadn’t thought to let the people in his life know that he was okay.</p>\n<p>Bruce is accustomed to his own selfishness, so different from Clark’s, but this was an almost cruel oversight. He should have known they would worry, should have found a way to reach out. He could have sent an email, when he had access to Clark’s computer.</p>\n<p>“I checked Gotham,” Clark is saying. “If he was there, it wasn’t in the suit.”</p>\n<p>And that is interesting, the Clark could recognize the suit, but not Bruce outside of it. Bruce had wondered, before, if Clark knew who he was. If he had looked through the kevlar and mechanics and found the clues of Bruce’s identity.  Now he knows.</p>\n<p>He wonders if there is something in the makeup of the suit that prevents him seeing through it, or if it was just Clark’s own code of honor, a determination not to unmask another hero. Before, Bruce would have said he was certain of the answer.</p>\n<p>Now, in Clark’s home, surrounded as he is by Clark’s own secrets, he has a different theory. That Clark, who so clearly loves the life he has, and who works so hard to keep it a secret, would not want to take that secret from anyone else.</p>\n<p> </p>\n<p> </p>\n<p>Clark gets back late the following day, leaving Bruce with little to do around the apartment. The information he picks up here is invaluable but only in the hours that Clark is actually home. The rest of the apartment has been thoroughly explored, mapped out and dissected.</p>\n<p>Bruce has gone through the apartment three times now—updating his conclusions based on what he learns from Clark. The photos of Clark with his family, telling of a life on a farm, somewhere midwestern and rural. The tchotchkes, mementos of either Superman’s travels or Clark’s, Bruce isn’t sure. He wants to find out. The cheap furniture, the acquisitions of a man on a budget. No facade, no safe house.</p>\n<p>He’d gone through the bills again, a few left out. Clark Kent is a man living just inside his means—and that was considering the Daily Planet paystub that showed just how much of an already meager paycheck was sent to one Martha Kent.</p>\n<p>The last feels like a cruel joke. Martha. Another Martha with a son who loved her, a son who wants to protect her. A son who wants to change the world.</p>\n<p>When Clark does get home, Bruce is pacing back and forth. His own thoughts make him agitated. He needs to get back to Gotham, back to his family. What else is there to know about Superman, about Clark Kent? But at the same time, Clark feels like a faceted gem, and Bruce will never stop learning about him.</p>\n<p>Clark drops down onto the couch, and he pats the spot next to him on the couch almost absently. Bruce finds himself responding, jumping up beside him and curling up against Clark’s thigh. God, he’s becoming domesticated.</p>\n<p>Still, it’s hard to protest when Clark gently scratches his ears, or when he begins to speak. His voice is tired in a way his body surely never is, and it’s not hard to think that Clark needs this as well.</p>\n<p>“I went looking again. Still nothing. I have no idea what they want me to do. I don’t want to undermine him in Gotham by being too visible while he’s gone, but…” he trails off. Bruce paws at his leg. “I have to assume that they’re looking for his civilian identity, but without the suit or him literally yelling for me, there just isn’t much I can do.”</p>\n<p>Clark tilts his head back against the couch, and Bruce is struck by how much this bothers him. It bothers him that he can’t help Batman, a man who has always professed to hate him, who has rebuffed every gesture of friendship or teamwork.</p>\n<p>“I can’t give up,” he says after long moment. “I just, I know that we could be a good team. If he ever gets his head out of his goddamn ass, I think he would see it too.” Bruce bites at Clark’s hand on its next pass by his head, but Clark hardly seems to notice. “I don’t want to do this alone forever,” Clark confesses, and it’s so soft that Bruce hardly hears him.</p>\n<p>What must it have been like, growing up in a small, midwestern town. Developing powers, learning to hide them like other people learn to ride bikes. Always knowing that he was different, always being afraid to hurt someone, equally afraid to be discovered. Never able to make close friendships, with so much to hide?</p>\n<p>Bruce was wrong to push him away. He can see now, see what Clark has always seen. Together, they can be magnificent. Together, they can change the world.</p>\n<p> </p>\n<p> </p>\n<p>On Saturday, as promised, Clark goes to visit his mother. He doesn’t take Bruce with him, because why would he?</p>\n<p>He’s back by midafternoon, his arms full of tupperware, with dirt under his nails and a chagrined look on his face.</p>\n<p>“She always gives me too much food,” he says to Bruce, rueful. While he loads it into the refrigerator, Bruce amuses himself with the image of Superman flying back across the country with a week’s worth of leftovers in his arms. He’s almost glowing, though whether that’s from seeing his mother or a morning spent under unrelenting sunlight, Bruce can’t say. He would do terribly in Gotham, perpetually overcast and foggy even in the summer.</p>\n<p>“The tractor is acting up again,” he tells Bruce. “Ma does her best, of course, but it’s always been fussy. Says I’m better with it.” His mouth quirks. “Being able to pick it up for maintenance doesn’t hurt.”</p>\n<p>Bruce watches from his own spot on the couch as Clark browses idly for used tractors. Bruce can’t imagine what a good price would be, or what Clark’s budget is, but Clark clearly doesn’t find anything he’s looking for. He sets his laptop down with a frustrated sigh. “It’s not like I can just pick up a few extra shifts,” he mutters.</p>\n<p>How hard would it be, Bruce wonders, to have a tractor replaced? A gift from an anonymous benefactor would raise red flags, of course, but there were other ways… He turns them over in his mind, drifting pleasantly as Clark pets him. He hardly stirs when Clark pulls his laptop back towards him and begins research on his newest article.  </p>\n<p>He’s roused later as Clark sets his laptop down with a decisive noise, face already turned to the window. “What…” Clark doesn’t finish, already off the couch. A blink, and he’s suited up. Another, and he’s gone.</p>\n<p>It’s the first time since Dick reached out to Superman that Bruce has had access to Clark’s computer, already unlocked and open.</p>\n<p>It’s hard enough to open an incognito window with his stupid cat paws, much less open up the secure email address he uses when compromised. But, after more time then he would ever admit to, he gets a message to Alfred, an all-safe codeword that means he’s not in immediate danger but will not be making it home yet. He doesn’t know how long Clark will be gone, and he can’t risk a longer explanation. He’s not sure where to even begin.</p>\n<p>It had already taken too much time to route the email through enough proxies that Alfred wouldn’t be able to track the email back to Clark’s address. There is nothing to be gained by having Alfred, or worse, Dick, storm the place looking for a hostage. No need to tip off to anyone that he knows that Clark Kent is anything more than he appears.</p>\n<p>And, more than he wants to admit, he doesn’t want to betray Clark’s secret.</p>\n<p>Only when he’s shut down the email, hidden all traces that the computer was in use, does he let himself turn on the television. He doesn’t have to look to find what had caught Clark’s attention—it’s the main story on every channel.</p>\n<p>Bruce has seen a lot of crazy things over the years, not even counting the appearance of a flying alien in primary colors, but this—this is something else.</p>\n<p>There is a giant purple robot terrorizing downtown Metropolis. It’s easily the size of a building, towering over the pedestrians in the street. In the center of its chest, a lurid green light seems to be powering it.</p>\n<p>Superman is mid-battle, but he’s hindered in ways the robot is not. His attention is split between the fight and his surroundings, clearly careful not to hurt any of the civilians or cause too much structural damage.</p>\n<p>Bruce watches in horror as the robot backhands Clark through a neighboring building. It’s can’t have done much damage to Superman himself but then—who knows how much damage Superman can withstand?</p>\n<p>Superman flies from the building, back at the robot. He dodges the next swing of the robot’s fists, and lands up uppercut to it’s jaw that rocks it back. They’ve been at this long enough that the streets have emptied out, but Bruce sees the cars crushed underfoot as it staggers.</p>\n<p>If they keep the fight out in the open, in the middle of the city, someone will get hurt.</p>\n<p>Superman knows it too, by the way he’s trying to steer it back, but he’s too close to it. As he fights, it’s so easy to see the places where a partner would be able to help—where Batman would be able to help.</p>\n<p>Superman is smart, there’s no denying that, but he’s not a strategist in the way that Bruce has trained himself to be. Superman is bright and bold and strong, but he can’t get in undetected, unnoticed. Together, with Clark as the focus, dealing heavy damage and Bruce there to get in close, sneak under its defenses, they might have already defeated it.</p>\n<p>Is it Bruce’s imagination, or is Clark slowing down? He lands another hit, but this one doesn’t send the robot staggering back, only rocks it in place. When he comes in again, the robot actually manages to catch him, throwing him to the ground.</p>\n<p>Bruce barely has time to worry before Clark is up again, but his motions are stiff, labored. There is sweat on his brow. Another round of hits are exchanged—Bruce is useless, only able to sit here and think how he would be able to help, if he were there—and this time, when Clark comes up, there is blood in his mouth, smearing on his face. It looks wrong. Clark shouldn’t bleed.</p>\n<p>Is it that the fight is strenuous, wearing him down? Or is it something in the robot itself? Is he vulnerable to robots? But no, that makes no sense. There is nothing unique to robots that wouldn’t apply to other technology, and he’s seen Clark use a laptop with ease.</p>\n<p>But, maybe, something about <em> this </em>robot. His eyes are drawn again to that green glow. A power system—or a defense system? Clark seems to be steering clear of the chest, even though center mass would be an easier hit. Instead, he aims for the head, the legs.</p>\n<p>But even he seems to realize that it’s an untenable solution. Bruce seems him hit the chest cavity, sees the green light flare up.</p>\n<p>Sees Clark falter.</p>\n<p>Clark actually drops several feet, as if his ability of flight has given out on him, but he catches himself. Still, it’s no imagination now. He’s slower, weaker. Dangerously so. The robot knocks him to the ground again, and it takes too long for Clark to get up. Long enough for Bruce to fear—</p>\n<p>Then Clark shoots out of the crater he had made, impossibly fast—desperately fast. And maybe it’s the speed, or just one last rush of adrenaline, but he manages to hook onto the robot, enough to lift it off its feet, carry it up and up. It’s an effort, it’s clearly an effort, but he manages to get clear of the buildings, then the city, until he’s out of sight.</p>\n<p>The news helicopters aren’t fast enough to follow him. Bruce doesn’t know what happens after that.</p>\n<p>All he can do is wait.</p>\n<p> </p>\n<p> </p>\n<p>A bit after dawn, Clark comes in through the window and, for the first time that Bruce has seen him, doesn’t go immediately to change. He collapses face first on the bed, and doesn’t move. For a second, Bruce thinks that he’s being dramatic- he’s seen Dick pull the same move when sulking or exhausted from training.</p>\n<p>But Clark is still, terrifyingly still. There is no blood, not that Bruce can see, but that doesn’t always mean anything. He can see Clark’s face in profile, pressed into the mattress. He’s pale, with sweat beading at his hairline, his temples. Bruce didn’t think he was capable of sweat.</p>\n<p>At a loss, unable to help—a fucking cat—Bruce jumps onto the bed and nudges at Clark’s hand. The fingers twitch weakly, like Clark is trying to pet him. When Bruce looks up, there is one blue eye peering down at him. Not unconscious, then.</p>\n<p>Bruce nudges his hand again, and it’s clear that Clark is trying to lift his arm. Trying, and failing. It is terrifying to see him struggling, pulls at a part of Bruce he’d thought reserved exclusively for Dick, Alfred and the ghosts of his parents. Then Clark groans, agonized, and his hand falls again.</p>\n<p>He’s shivering now, a tremble that runs through his entire body. When Bruce nudges at Clark’s hand again, it’s clammy, cold. Worse, it doesn’t twitch this time. He’s going into shock. Bruce doesn’t know how to help. All his first aid training, all his experience, and he’s going have to watch someone die in front of him.</p>\n<p>Carefully, mindful of any internal injuries, he moves to Clark’s back, trying to see if there is anything he can do, any wound to which he can apply pressure, any sign of what’s slowly killing him.</p>\n<p>When he moves, something catches the light, and Bruce stops. He turns his head, slowly, trying to catch it again. A fine green powder coats Clark’s suit, the bits of skin Bruce can see, his hair. It’s broken up only by larger green crystals like splinters, none of them larger than an inch. Bruce is sure, utterly certain, that this is the cause of Clark’s sickness. And there is nothing he can do about it.</p>\n<p>He bats away all the larger pieces, knocking them to the floor, but it does very little. He moves around to nudges at Clark’s face, trying to wake him.</p>\n<p>Then the phone starts to ring. Clark had moved it to the bedside table before leaving, and it’s easy to see the caller. Ma. The picture that comes up is the same woman from the living room photos, her face lined and friendly. Calling because she, surely, had seen the news report as well. Because she was worried about her son.</p>\n<p>Clark seems to realize that as well, because he stirs again. He tries to reach for the phone, trying to - what? Reassure her? Give his last words to someone who loves him? Bruce isn’t sure which thought it more devastating.</p>\n<p>Clark can’t reach it. The phone stops ringing, and Clark slumps back down. Bruce nudges at his chin again, trying to keep him awake. He has to stifle that cat impulse to lick him, but he has no idea what ingesting those crystals will do to him, especially with a cat’s metabolism.</p>\n<p>The phone rings again, and Bruce closes his eyes in despair. It’s Lois Lane this time, and once again it rings through. Bruce is glad that smartphones no longer play voicemails out loud. He couldn’t bear to hear their desperation, their concern.</p>\n<p>It rings thrice more, two more times from Ma Kent and another from Lane. He feels utterly helpless. Clark is still groggily conscious, but only barely. He makes aborted reaches for the phone each time it rings, his face creasing with effort.</p>\n<p>Bruce wants to say he doesn’t remember the last time he felt so helpless, but of course he does. In a dark alley in Gotham, over fifteen years ago.</p>\n<p>The worst part is knowing that, somewhere out there in the world is a woman who is desperately, terribly concerned for her son. Who had seen him fall and seen him fly away and hadn't even had the comfort that Bruce had, of knowing that he had gotten home, had made it at least as far as his apartment.</p>\n<p>As far as Ma Kent knows, as far as Lane knows, Clark had lost the battle to the robot, out of sight of the camera. He could have fallen into the ocean or been knocked down and speared through and none of them would have any idea.</p>\n<p>His desperation is mutating into something physical, something pressing. He can feel it in every part of his body, filling him like hot water, tingling and urgent and terrible. It builds in him, unbearably and irrefutably until, like a sudden drop in pressure, it pops.</p>\n<p>Every part of Bruce's body hurts, every inch of him tingles in pins and needles, his fingers and toes arching with released pressure. And then he realizes that he has fingers and toes, that every inch of his body is his own. He's still in the batsuit, the cowl pulled up over his face, his cape brushing the hardwood floors of Clark's apartment.</p>\n<p>He doesn't have time to be surprised, to be relieved. He rushes immediately to Clark's bed and turns him over.</p>\n<p>Clark groans again, face twisted. He's still shivering, still pale and clammy. He's clearly deep in shock and it's a miracle he's still conscious.</p>\n<p>His eyes focus blearily on Bruce's face, and Bruce thinks he's probably too deep in shock to be truly surprised.</p>\n<p>\"You,\" he says, and his voice is muddy, slurred.</p>\n<p>\"Me,\" Bruce agrees. He's startled by his own voice distortion, but there is nothing for it now. \"What do you need?\" He brushes the green glitter from Clark's hair, but it rains down on his pillow and doesn't help.</p>\n<p>\"I ws lookin for you,\" Clark says. He reaches out and clasps Bruce's shoulder with a weak hand. \"Found you.\"</p>\n<p>It's more true than he knows. It he weren't so sick, it the situation weren't so desperate, it would be funny. \"What do you need?\"</p>\n<p>Clark's stare moves past him, clearly fading out again. His hand on Bruce's shoulder goes lax.</p>\n<p>\"Superman,\" Bruce snaps, not letting any desperation into his voice. Then, with no response, \"Clark.\"</p>\n<p>That works. Clark's gaze snaps to him, and then moves around the room. For the first time, he registers his surroundings, his own apartment, Batman's presence in it. He looks afraid. Bruce shakes his shoulder, gently. \"What do you need?\"</p>\n<p>Clark focuses back on his face, and whatever he reads in it seems to relax him. \"Suit,\" he forces out.</p>\n<p>Of course. Between the two of them- mostly Bruce but with Clark's weak instructions and weaker help, the they get the suit off. It crumples to the ground between them, the crystals glittering in the folds. Without it, Clark is almost able to stand. He's back in a different pair of plaid boxers—the suit is so tight, how does that even work?— and Bruce is hit by a wave of affection that almost knocks  him over.</p>\n<p>\"Shower,\" he says definitively, as Clark sways and almost falls. He has to all but drag Clark into the bathroom. He leaves the boxers on;, the suit seems to have stopped anything from getting through it, all newly exposed skin is tan and whole and free of crystals.</p>\n<p>Bruce starts the water and all but shoves Clark under it. He ends up taking off his own gloves, just to dump a quart of shampoo onto Clark's hair and scrub vigorously. With his help, Clark is able to get his head back under the faucet to rinse.</p>\n<p>When it's all gone from his hair, Clark is already better. He stands straight instead of swaying, and when he meets Bruce's eyes, his own are clear and full of suspicion. \"I can take it from here,\" he says coolly.</p>\n<p>Bruce wants to protest but, of course, he has no good reason to do so. If Clark can stand, he can certainly wash himself. He bites back his first response and just nods, heading back to the bedroom.</p>\n<p>At a loss, and strangely unused to his own body, he reaches for the Superman suit. It will have to be washed, and thoroughly. He doubts Superman has a reliable dry cleaner for such things. Although, he'd has a designated cat-contact, so maybe he does.</p>\n<p>The green crystals are embedded in the fibers, some of them worked so deep Bruce can could hardly see them. He picks out the shards he can,  lets them fall to the floor, and sets the suit aside.</p>\n<p>Then, worried that just returning to this room and it's crystal debris will make Clark worse again, he takes off the sheets and the pillowcase, where green dust still glitters, puts them with the suit. He unearths a small dustpan from under the bed and makes a small pile. And it is small, terrifyingly so. That this much, less than a handful of dust, could have reduced Superman to such an extent.</p>\n<p>He surveys the pile, unsure what to do with it. He can't just throw it away or toss it out the window, but he can't keep it in the apartment either.</p>\n<p>\"Lead shielding.\"</p>\n<p>God, he hadn't even heard Clark approach. He turns, and Clark is back in the Met U sweats and loose shirt that Bruce has become accustomed to.</p>\n<p>\"Hm?\"</p>\n<p>Clark tilts his head to indicate to pile of green crystals and even looking at it seems to make him pale. \"If you put it in lead shielding, that helps.\" He gives Bruce another cold, suspicious look. \"I take it you aren't going to throw it away?\" The subtext is an accusation, that Bruce would take it with him. Bruce can't say the thought didn't cross his mind.</p>\n<p>\"Do you have any lead?\" he asks.</p>\n<p>Clark doesn't answer, but turns on his heels and begins to rummage through the hall closet. He pulls out a brightly colored box, covered in striped wrapping paper. He hands it to Bruce with a look that dares him to comment on it.</p>\n<p>Bruce peers inside, and, sure enough, the entire thing is lined with thin lead sheeting. He gently scoops up the crystal and tips it into the box. Mutely, Clark hands him a lid, and the second that it closes over the top, his entire face relaxes. He still doesn't come fully into the room, staying clear of the pile of sheets and suit and crystals.</p>\n<p>\"Did you want to?\" Bruce tilts his head towards the door and the living room beyond it.</p>\n<p>Clark makes a face, he moves out into the living room. \"Coffee?\"</p>\n<p>Bruce stares at his back. Clark is clearly furious, clearly scared, clearly thinking about how much Bruce knows, how much he can be trusted. And yet. And yet, he offers him coffee. Bruce's mouth twitches, hiding a smile. Clark Kent might be Superman, and an alien from another planet, but he is also clearly midwestern to the core.</p>\n<p>\"Yes, please.\"</p>\n<p>They stand in silence while it brews, the sound of the coffee dripping into the pot almost overwhelmingly loud in the apartment.</p>\n<p>Clark, pointedly, hands him the coffee in a Superman mug. Bruce has to stifle another smile.</p>\n<p>\"So.\" Clark leans against the counter and takes a sip of his own cup. For a man only recently recovered from near death, he looks remarkably solid. Healthy. \"You were my cat.\"</p>\n<p>Bruce winces, takes a sip of his coffee to hide it, and winces again. It's very hot. Clark gives him amused look and very pointedly takes a long gulp from his own cup, and sighs in satisfaction. Bruce resists the childish urge to do the same, to scald himself just to prove a point.  </p>\n<p>\"Yes,\" he says, calm because he can't be anything else.</p>\n<p>\"Was it,” Clark hesitates, his hands tight around the coffee mug. That grip is an illusion, Bruce thinks wildly. It would take only the slightest effort to crush the mug completely, to let it fall in tiny shards and powered ceramic. Instead, Clark takes another sip, gathering himself. \"Did you intend to spy on me?\"</p>\n<p>\"You picked me up, if you recall,\" Bruce says. \"I was minding my own business.\"</p>\n<p>\"In a tree, with a storm coming,\" Clark say skeptically. Bruce fixes him with a cold look.</p>\n<p>\"I didn't intend for it to be you who found me.\" After a moment, he adds, \"I didn't intend to be found.\"</p>\n<p>\"Is it part of your,\" Clark gestures at the suit, the ears and the cape, \"your thing? Turning into a cat?\"</p>\n<p>Bruce snorts, he can't help it. \"If I could control it, do you think I would have stayed here for over a week?\"</p>\n<p>Clark's stare focuses on him. \"Your son is worried about you.\"</p>\n<p>\"He's not my-\" Bruce cuts himself off. He supposes, in all ways that matter, it's not a distinction worth making. \"He shouldn't have called you.\"</p>\n<p>\"He was worried,\" Clark repeats. He take another sip of his coffee, then carefully sets it down. His hands curl around the edges of the countertop. \"I think you can understand why I'm feeling,\" he hesitates, \"angry.\"</p>\n<p>Bruce considers all the words he could have used instead. Humiliated. Exposed. Vulnerable. He's sure they would all be true. He can't imagine having someone crawl into the heart of him and see every secret, hear those secrets fall from his own lips.</p>\n<p>\"I can,\" he says. He does understand. \"I think you can understand that none of this was within my control.\"</p>\n<p>He sees Clark's hands tighten on the counter. \"I can,\" he admits, and the words sound torn out of him. \"I still don't—I still—\" He bites his lip, and Bruce tracks the motion with his eyes before tearing his gaze away. He watches, instead, as Clark moves around the apartment, takes a seat on the couch.</p>\n<p>For a long moment, Clark just stares at his own hands. \"I—this life means everything to me. Being Clark Kent, having this apartment. It's important. I know you don't like me, that you don't trust me. But please. Don't—Please let me keep this life.\"</p>\n<p>Bruce stares at him, taken aback. Is there no end to the ways that Clark Kent will surprise him? But, of course, Clark has no way to know how much Bruce's opinion of him has changed. Has no way to know that Bruce <em> knows </em>Clark now, trusts him. Believes in him, and the good he does—both as Clark Kent and as Superman. The world would be worse off without both of them.</p>\n<p>Bruce Wayne is supposed to be good with words—it’s supposed to be his one saving grace in a life of vice. He can charm, he can schmooze, he can talk anyone into anything. But it’s as much a ruse as the drinking and the women. He can say anything when it doesn’t matter. But something like this, with Clark so raw and vulnerable before him—he can’t think of a single word.</p>\n<p>Instead, he reaches up and pulls the cowl up and off.</p>\n<p>Clark, who had been staring at his hands as he awaited Bruce’s reply, jerks. His eyes jump to Bruce’s face, searching. His mouth falls open, and Bruce can’t be distracted by that at the moment.</p>\n<p>“I. Wow.” Clark clears his throat. “I did not expect that.”</p>\n<p>Bruce, feeling at a loss, hating the sensation, holds out a hand. “Bruce Wayne. Pleasure to meet you.”</p>\n<p>Clark stands, seemingly on impulse, and Bruce wants to laugh again. A good midwestern boy. “Clark Kent.” He ducks his head. “But you knew that.”</p>\n<p>After a moment Clark starts to laugh, slumping back down onto the couch. Bruce raises a brow and waits him out.</p>\n<p>“Did you know?” Clark asks, then has to stop to catch his breath, “Did you know we had a meeting scheduled, this week? You missed it.”</p>\n<p>“We’ll have to reschedule,” Bruce says with a smile, with Bruce Wayne’s easy charm. Clark frowns at him.</p>\n<p>“You hate me.”</p>\n<p>Bruce bows his head. “I did.”</p>\n<p>Clark catches on the past tense, as Bruce intended him too.</p>\n<p>“What changed?”</p>\n<p>Bruce looks at him incredulously. Then he looks around the apartment, as if to indicate all of it. When Clark just looks at him, he says “It’s hard to be afraid of a man who calls his mother with such regularity.”</p>\n<p>“Oh my god, Ma!” Clark says. “I have to call her.” He doesn’t wait for an answer, gone into the bedroom and back again in a blink.</p>\n<p>Bruce tunes him out as he calls her, reassuring her that he’s fine.</p>\n<p>“No, Ma, please don’t cry. I’m fine. I had a,” he hesitates, “a friend help.” He makes a noise of protest. “I have friends!”</p>\n<p>Bruce forces his attention away again. It had become clear, over their week together, that Clark was desperately lonely. He had his mother, and he had Lane, and he had no one else. He examines the pictures again, easier to see how that he’s not almost the same size.</p>\n<p>Clark doesn’t exactly look like the man and the woman in the photo, but there is something in the curve of the smile, the tilt of the head, that makes him resemble his parents. Years of familiarity, shaping their expressions into the same lines.</p>\n<p>“My Ma says thank you. For helping me.”</p>\n<p>“Anyone would have,” Bruce says, uncomfortable with thanks and even more uncomfortable with thanks from a mother. He looks down at the shelf again. Bruce looks around, his eyes falling back on that shelf, with the pictures and tchotkes. “I didn’t realize,” he says. “I didn’t know how human you were.”</p>\n<p>Clark shrugs, minutely. “I try to keep it out of the press. Lois knows, of course.” He laughs. “She says I’m too trusting. It’s probably a good thing she did the interview, she helped edit anything too incriminating.”</p>\n<p>Bruce nods. “No one looks for a secret identity if they don’t think that you have one.”</p>\n<p>“It has downsides. It’s easier to think of me as, as other. As an alien.”</p>\n<p>“Yes,” Bruce agrees. Not accepting blame, but not absolving himself of any either.</p>\n<p>Clark looks down at the photo closest to him. “That’s our farm, in Kansas.” Kansas. Damn. Bruce’d bet himself it was Iowa. Bruce reaches out and takes the snow globe next to it, shaking it. A silent question.</p>\n<p>Clark laughs. “That was from Paris.” Obviously. “There was this little kiosk, I stopped a robbery. But the owner didn’t see him at first, and thought I was trying to rob the place. I was still,” he indicates his glasses and casual clothes. “Once we got it sorted out, she gave it to me.” He grins down at it. “She’d hit me with her broom.”</p>\n<p>Bruce wants to sit on the couch with him, listen to Clark tell him about every tchotchke on the shelf, to hear him talk his parents and how he’d developed his powers. He wants to know how many languages Clark has learned, wants Clark to teach him Kryptonian conjugations. He wants to know everything.</p>\n<p>But he has responsibilities he’s put off for too long, a family to get back to.</p>\n<p>“I should go.”</p>\n<p>Clark watches him, speculative. “My offer still stands, you know. I think we’d be a good team.”</p>\n<p>Bruce watches him back. It’s not easy to admit when he’s wrong. But somehow, it’s not too hard to say, “I think you might be right.”</p>\n<p>It’s worth it for the smile that blooms across Clark’s face, wide and radiant. At short range, in his human body, it’s devastating.</p>\n<p>“Did you want a lift?” Clark asks.</p>\n<p>Bruce shakes his head. “You should rest. And wash that suit, before you wear it again.”</p>\n<p>Clark makes a face, confirming Bruce’s suspicions about a washing machine.</p>\n<p>“Or…” he starts, tentative. “I have an industrial washer in my, back at my place. I could, help?”</p>\n<p>It’s a strange offer, foreign. Clark seems to sense it. They both know how much trust that would require.</p>\n<p>“How would I get it back?” he asks, after a moment. Not a no.</p>\n<p>“You’d have to come for dinner, sometime.” He grins. “I’ve seen the way you eat, it’ll be good for you.”</p>\n<p>Clark makes a face at him, and it’s shocking that this is so easy. To talk with him, joke with him.</p>\n<p>“Alright, yeah. You should borrow something too. You’re a bit conspicuous.”</p>\n<p>Bruce looks down at himself, the Batsuit especially absurd in Clark’s well lit apartment. It’s a look that lends itself best to dark alleys and shadowed corners. “Good idea.”</p>\n<p>In the end, he packs the Batsuit in a duffle and Superman’s suit in a backpack that Clark lined with lead sheeting he’d pulled from a kitchen drawer.</p>\n<p>After a moment, Clark offers the bedsheets to Bruce as well. “They’re useless to me at the moment, and I’d rather not corrupt the apartment washer.”</p>\n<p>Bruce is never giving these monstrosities back to him. Clark probably won’t notice if the replacements are Egyptian cotton. Probably.</p>\n<p>“Are you going to keep the,” he indicates the box, incongruously like a birthday gift, still in the middle of Clark’s bedroom. Clark goes a little green at the thought of keeping it.</p>\n<p>“I don’t know if,” he hesitates. “You’ve already done so much, but,”</p>\n<p>But to trust someone who, only a month ago, hated your very existence, with a weapon to kill you is asking a lot.</p>\n<p>“I understand,” Bruce says. He does.</p>\n<p>Clark surveys him for a long moment. “What’s your boy’s name?”</p>\n<p>It would be easy to find out the name of Bruce Wayne’s ward, if he doesn’t already know. That’s not the point of the question.</p>\n<p>Bruce thinks of everything he’s seen, of Clark waking in the middle of the night, torn apart by nightmares of the people he’s failed. Of Clark, pained and pale after a fight only he could win.</p>\n<p>“Dick,” he can feel himself smile at the name. Bruce has missed him, he realizes. Him and Alfred both. He wants to go home. “Dick Grayson.”</p>\n<p>Clark nods, like this is just a confirmation, and picks up the box. “Please be careful with it.”</p>\n<p>Bruce’s hands close around it, instinctive. “I will.”</p>\n<p>Clark sees him to the door. Bruce pulls his borrowed cap over his face, hiding his own distinctive features, and it seems to work. He takes three cabs back to Gotham, making sure that there is no connection between a small Metropolitan apartment and Wayne Manor.</p>\n<p>Dick meets him at the door, launching directly into his arms, and Bruce barely has time to drop the bags he’s carrying to catch him.</p>\n<p>“I missed you,” Dick says into his neck.</p>\n<p>Bruce puts his arms around Dick. “I missed you too.”</p>\n<p>He meets Alfred’s eyes when he looks up, reads the same sentiment in his look.</p>\n<p>There will be explanations later. Later, Bruce will tell Alfred the whole story. He’ll let Dick hang on his arm and tell him all about meeting Superman. Later, Dick will ask “Did Superman find you?” and it will be easier than Bruce expected to say “Yes, he did.”</p>\n<p>But for now, he steps back into the Manor, still holding Dick, and lets Alfred put a hand on his shoulder.</p>\n<p>“Welcome back, Master Bruce.”</p>\n<p> </p>\n<p> </p>\n<p>Epilogue:</p>\n<p>It’s strange to miss his cat, now that Clark knows his cat was secretly a human man in disguise the entire time. But Clark has never pretended to be the most rational person. He misses having something to take care of, misses the way the cat would curl up on his chest while he slept and purr, keeping the nightmares away.</p>\n<p>It’s a mortifying thought, all of the things that Batman had seen. His stupid boxers and the calls to his mother were the least of it, though it had been nice of Bruce not to mention anything else. Not to mention seeing Clark complain about loneliness, or the way that he woke up with a bitten back scream more than once.</p>\n<p>He feels terribly exposed at the thought, vulnerable. Clark is private out of necessity and he recognizes that none of the situation was Batman’s fault, but still. To have so much of his private self shown to someone—anyone. It sounds overly dramatic, but so few people truly know him. People know Superman, or they know Clark Kent, and no one except his mother has seen him truly be Clark. Not even Lois, though she’s probably come the closest.</p>\n<p>Add to that the stupid emotional reaction of wanting his cat back, and Clark has been on edge all week. Lois hasn’t bothered him, clearly thinking it’s a residual effect from Saturday’s fight, but that hardly registers after everything that followed.</p>\n<p>He needs to get his suit back. It had made sense to give it to Batman at the time, when Batman—when Bruce—had trusted him with more than he had too, when Bruce had saved his life. But now, Clark needs to overcome his awkwardness about the whole situation enough to contact him. Which is easier said than done.</p>\n<p>All in all, Clark would rather take on the robot again.</p>\n<p>“Hey, Smallville! Earth to Smallville.”</p>\n<p>Clark blinks back into focus as Lois waves her hand in front of his face. “Funny.”</p>\n<p>“Are you going to answer your phone?” Lois asks. “It’s been ringing.”</p>\n<p>God, how out of it was he? It is ringing, and by Lois’s expression, mingled concern and irritation, it’s been ringing for a bit.</p>\n<p>“Clark Kent, Daily Planet.”</p>\n<p>“Hello, Clark Kent, Daily Planet. This is Bruce Wayne.” After a beat, “Wayne Enterprises.”</p>\n<p>Clark stifles his surprise. Does thinking of the man summon him? From what he’s seen of Batman, it wouldn’t shock him. “I think I’ve heard of it,” he says. Lois has planted her butt on the edge of her desk, and he doesn’t want to incriminate himself.</p>\n<p>Bruce laughs, low and intimate through the phone. “I believe that we have an interview to reschedule? Terribly sorry to have missed that first one. Something came up.”</p>\n<p>Clark can picture him, can picture the Bruce Wayne he’s seen on tv, waving a frivolous hand.</p>\n<p>“I hope it was something important,” Clark says.</p>\n<p>When Bruce replies, his voice has dipped, ever so slightly, into his Batman register, and Clark fights a shiver. “Very important. World changing, even.”</p>\n<p>Clark swallows. “Well, then I guess I can’t fault you.”</p>\n<p>“I should hope not. I’d hate to offend you so early in our relationship.” He’s back to Bruce Wayne, flirty and flighty, and Clark finds the dichotomy of him fascinating.</p>\n<p>“What time would work best for you, Mr. Wayne,” he says, and curses to himself when he sees Lois’ eyebrows shoot up.</p>\n<p>“Oh please, call me, Bruce. Mr. Wayne was my father.”  When Clark doesn’t reply to that, he says, “How about 7 o’clock? Dinner?”</p>\n<p>“For an interview?” Clark asks, amused. Lois is making a face at him, like she can’t believe he’s going to blow this.</p>\n<p>“I’m very flexible,” Bruce says, and Clark almost blushes at the way he rolls the words out. He doesn’t think this level of flirtation is necessary, when he knows who Bruce really is.</p>\n<p>“7 o’clock it is,” he says, rather than rise to Bruce baiting him. “Where would you like to meet?”</p>\n<p>“Oh, why don’t you just swing by the Manor,” Bruce says airily. As though Gotham isn’t three hours away for a normal man. As if Bruce hasn’t had a strict no-press policy on the Manor for almost two decades.</p>\n<p>“That works,” Clark grins. Then, partly for Lois’ benefit, and partly for Bruce’s, he adds “Is there a dress code?”</p>\n<p>Bruce doesn’t disappoint, laughing. “Oh, I think I have a suit that will fit you.”</p>\n<p>Clark can’t help grinning as he hangs up, and it’s so, so worth the interrogation he’s about to get from Lois.</p>\n<p>He doesn’t tell her anything worthwhile. A little curiosity is good for her.</p>\n<p> </p>"
}